{"entry_id": "http://arxiv.org/abs/2303.07377v1", "published": "20230313180024", "title": "Robustness of Bell Violation of Graph States to Qubit Loss", "authors": ["Shahar Silberstein", "Rotem Arnon-Friedman"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\ntheoremTheorem\nlemma[theorem]Lemma\n\n\n\n\n\nThe Center for Quantum Science and Technology, Department of Physics of Complex Systems,\nWeizmann Institute of Science,\nRehovot 76100, Israel\n\nRobustness of Bell Violation of Graph States to Qubit Loss\n    Rotem Arnon-Friedman\n    March 30, 2023\n==========================================================\n\n\n\n\nGraph states are special entangled states advantageous for many quantum technologies, including quantum error correction, multiparty quantum communication and measurement-based quantum computation. Yet, their fidelity is often disrupted by various errors, most notably qubit loss. \nIn general, given an entangled state, Bell inequalities can be used to certify whether quantum entanglement remains despite errors. \nHere we study the robustness of graph states to loss in terms of their Bell violation. Treating the recently proposed linearly scalable Bell operators by Baccari et al., we use the stabilizer formalism to derive a formula for the extent by which the Bell violation of a given graph state is decreased with qubit loss. Our analysis allows to determine which graph topologies are tolerable to qubit loss as well as pinpointing the Achilles' heel of each graph, namely the sets of qubits whose loss jeopardizes the Bell violation. These results can serve as an analytical tool for optimizing experiments and protocols involving graph states in real-life systems.\n\n\n\n\n§ INTRODUCTION\n\n\n\n\n\n\n\n\n\n\n\n    \n\n    Graph states <cit.> are special entangled states that can be characterized by a  graph in which each vertex represents a qubit. They are defined to satisfy a set of “stabilizing constraints” applying to each qubit and its neighbors. The states are useful for many quantum tasks and technologies, ranging from quantum error correction <cit.>, to multiparty cryptographic protocols <cit.>, to all-photonic quantum repeaters <cit.> and computers <cit.>.\n    As they hold such great importance, a vast amount of research is devoted to investigating their theoretical aspects and creating them in laboratories using different quantum technologies <cit.>.\n    \n    As graph states are entangled states, there exist Bell inequalities that can be violated by them <cit.>. The violation gives a very strong form of “certification” of the states <cit.>. \n    These facts allow us to use graph states as a quantum resource in the so called device-independent (DI) setting. \n    In the DI paradigm <cit.> one wishes to certify that an unknown quantum state is sufficiently good in order to accomplish a given task (e.g., the production of randomness <cit.>). This is done by measuring the state using uncharacterized devices and checking whether the resulting classical information, namely, the measurement outcomes, can be used to violate a Bell inequality <cit.>. \n    \n    In recent years, several Bell inequalities were developed specifically for graph states <cit.>. The inequalities differ in the number of prescribed measurement settings, \n    \n    the maximal violation ratio with respect to the classical bound and more. In this work we are interested in the robustness of the Bell violation of the inequalities to the loss of qubits. A loss of qubits is the most common source of error in many setups. Most drastically, attenuation causes loss when photonic qubits are being sent over a quantum communication channel <cit.>. \n    \n    Another reason to consider loss comes from the field of multipartite computation and cryptography <cit.>. Consider a setup in which a graph state is being used as a resource for some task where, say, each entity holds one qubit of the graph state. \n    If one of the parties decides to stop participating in the protocol, this results, effectively, in the loss of a qubit. Ideally, one would like the protocol to be robust to this loss so the task can be accomplished regardless.\n    \n    Some studies regarding the effects of loss of qubits on graph states in the context of error correction have been performed, e.g., <cit.>. We stress that our work considers the DI setup, where the initial state, the set of possible measurements and the errors are unknown. Hence, the more demanding Bell violation is asked for, as apposed to having an error model and an error correcting code that can be used to handle qubit losses. <cit.> discussed the implication for specific types of hyper-graphs. Here we provide a general theorem for the violation of a lineally scalable Bell inequality <cit.> which can be applied to any graph state. Apart from the fundamental aspects, our findings can be used to construct loss-tolerant DI protocols that use graph states. \n    \n    Our main goal is to understand how the violation of the Bell inequality decreases when some qubits of a given graph state are lost (see Section <ref>). In addition, we show that for any graph state, when a qubit from the set of roots is lost there is no violation. \n    \n    We present several examples for loss-tolerant (Section <ref>) and loss-sensitive graph states (Section <ref>) and find that a redundancy of roots is beneficial to construct loss-tolerant graph states.\n    In each example, we indicate which qubits are “more important” than others and how many qubits can be lost while still allowing to observe a violation of the Bell inequalities (see Table <ref> for a summary). Lastly, we explore the implication of the possibility of the set of lost qubits being unknown (Section <ref>).\n    \n    \n    On top of the theoretical contribution, our results and examples are of relevance for experiments. \n    Firstly, if loss is to be expected, one should clearly aim to create loss-tolerant graph states; our results show how many qubits can be lost for a given state while still presenting a Bell violation.  \n    Then, since some qubits are crucial for the violation, it is  wise to treat them differently in an experiment. For example, have them as, e.g., atomic qubits or be measured right away, while others can be sent as photons.\n    \n    Thus, our work lays out important facts for consideration when developing experiments that produce graph states.     \n\n\n\n\n§ PRELIMINARIES\n\n\n\n §.§ Bell Scenarios\n\nWe consider (N,2,2) Bell Scenarios, which can be thought of as “cooperative games” with N participating parties. Each participant i receives an input x_i∈ℐ_i={ 0,1} sampled from some probability distribution q({ x_i}_i=1^N), and produces an output y_i∈𝒪_i={ -1,1}. The score of the game is defined via a function v({ x_i} _i=1^N,{ y_i} _i=1^N).\nThe behavior of the parties can be described by some conditional probability distribution P({y_i}_i=1^N| {x_i}_i=1^N), which is also called the strategy of the game.\n\nThe score of a strategy is given by \n\n\n    I(P)\t=∑_{ x_i} _i=1^N,{ y_i} _i=1^Nq({ x_i} _i=1^N) P({y_i}_i=1^N| {x_i}_i=1^N) v({ x_i} _i=1^N,{ y_i} _i=1^N)\n    \t .\n\n\nA strategy is called local, or classical, if there exists a family of local processes ∀λ : { P_1^λ(y| x),…,P_N^λ(y| x)} and a distribution Q(λ) such that \n\t\n\n    P({y_i}_i=1^N| {x_i}_i=1^N) = ∫ dλ Q(λ)Π_i=1^NP_i^λ(y_i| x_i) \n    \t .\n\nA strategy is called deterministic if the set of outputs is predetermined for any set of inputs, i.e\n\t\n    P({y_i}_i=1^N| {x_i}_i=1^N) = δ_(y_1,…,y_n) = f(x_1,…,x_n) ,\n\nwhere f is some function of the inputs. Hence, a strategy is said to be local deterministic if it relies on a predetermined agreement of the outputs to each input separately. According to Fine's theorem <cit.>, any local strategy can be written as a convex combination of local deterministic strategies. The classical bound β_C of the game is defined as the maximal average score a local strategy can achieve. \n\nIn Bell scenarios, the strategies which involve quantum resources can achieve better scores. A strategy which uses a quantum resource in this context is described by a quantum density matrix ρ acting on  ⊗_i=1^Nℋ_i where {ℋ_i} _i=1^N are Hilbert spaces, and families of measurements\n\n    ∀ i,∀ x_i∈ℐ_i:{Π_i(x_i, y_i)|y_i∈𝒪_i}   ,∑_y_i∈𝒪_iΠ_i(x_i ,y_i)=𝕀_i ,\n\nsuch that\n\n    P({y_i}_i=1^N| {x_i}_i=1^N)=Tr(ρ⊗_i=1^NΠ_i(x_i,y_i))\n    \t .\n\n\nThe quantum bound of the game β_Q is the maximal average score a quantum strategy can achieve. In a Bell scenario β_Q≥β_C.\n\n\nA correlator of the outputs is a function of the form \n\n    ⟨ y_i_1··· y_i_k⟩({ x_i} _i=1^N)= \n        ∑_{ y_i}_i=1^N y_i_1··· y_i_k P({y_i}_i=1^N| {x_i}_i=1^N)\n         ,\n\nwhere { i_1,…,i_k}⊆{ 1,…,N}. In many cases, I(P) is a linear combination of such correlators. For a quantum strategy Equation (<ref>) can be written as an operator expectation value\n\n\n    ⟨ y_i_1··· y_i_k⟩({ x_i} _i=1^N) = ⟨  Y_i_1(x_i_1)… Y_i_k(x_i_k) ⟩ ,\n\nwhere Y_i(x_i) =  ∑_y_i∈𝒪_iy_i·Π_i(x_i,y_i).\n\n\n\n §.§ Graph States\n\nThe (N,2,2) Bell inequalities examined in this paper are maximally violated by N-qubit states called graph states, which are defined as follows.\nLet G=(V,E) be a graph, where V={v_1,…,v_N} is the set of vertices (|V|=N) and \nE is the set of edges. Each of the qubits in the system is associated with a vertex in V. Denote by 𝒩_i^G the neighborhood of the vertex v_i, i.e., 𝒩_i^G = {j: (v_i,v_j)∈ E } and define 𝒩_i^G≡𝒩_i^G∪{i}. To every vertex v_i∈ V associate a stabilizing operator\n\t\n\n    S_i^G≡ X_i⊗_j∈𝒩_i^G Z_j ,\n\nwhere the identity operator acts on all sites not appearing explicitly. Note, that the operators {S_i^G}^N_i=1 commute with one another and therefore can be diagonalized simultaneously. The graph state |ϕ^G⟩ associated with the graph G is an N-qubit state defined as the unique[Generally, for a stabilizer code with n qubits and k stabilizers, the corresponding code space has 2^n-k states. This is proved by induction by adding one stabilizer at a time to the stabilizer group and showing that with each addition the number of eigenstates with eigenvalue 1 for all stabilizers is cut in half. For more information see <cit.>.] eigenstate of all the stabilizers with eigenvalue 1, i.e\n\n    ∀ i∈{1,…,N} :  S_i^G|ϕ^G⟩ = |ϕ^G⟩ .\n\n\nA node with the maximal number of neighbors n_max is called a root. Denote without loss of generality one of the roots by the index r.\nDefine the following Bell operator maximally violated by graph states, proposed in  <cit.> \n\n\n    I_r^G[{Y_i(0)}_i=1^N,{Y_i(1)}_i=1^N]    = n_max[Y_r(0) + Y_r(1)]\n    \t⊗_i∈𝒩_r^G Y_i(1) \n        + [Y_r(0) - Y_r(1)]∑_i∈𝒩_r^G\n    \tY_i(0)⊗_j∈𝒩_i^G∖{r} Y_j(1) \n        + ∑_i∉𝒩_r^G\n    \tY_i(0)⊗_j∈𝒩_i^G \n    \tY_j(1)\n    \t .\n\nAn example of a graph with two possible root vertices and n_max = 4 is shown in Figure <ref>.\n\n\n\nIt is shown that this Bell operator has the following classical bound \n\n\n    β_C=n_max+N-1\n    \t ,\n\nand the maximal quantum violation is\n\n    β_Q=(2√(2)-1)n_max+N-1\n    \t .\n\n The maximal expectation value in Equation (<ref>) can be achieved by using the following measurements and the graph state\n\n    Y_i(0) = \n    \t1/√(2)(X_i+Z_i)     i = r \n    \n    \t\tX_i   otherwise       \n    \tY_i(1) =\n    \t1/√(2)(X_i-Z_i)     i = r \n    \n    \t\tZ_i   otherwise .\n\n\nIn this case[The * in I_r^G* in Equation (<ref>) stands for the specific choice of measurements described in Equation (<ref>)]\n\n    I_r^G*   = √(2)n_maxX_r⊗_i∈𝒩_r^G Z_i\n        + √(2)Z_r∑_i∈𝒩_r^G\n    \tX_i⊗_j∈𝒩_i^G∖{r} Z_j\n        + ∑_i∉𝒩_r^G\n    \tX_i⊗_j∈𝒩_i^G \n    \tZ_j\n        = \n    \t √(2)n_maxS_r^G\n    \t+ √(2)∑_i∈𝒩_r^G S_i^G + \n    \t∑_i∉𝒩_r^G S_i^G .\n\n\nNotice that the above is a sum of the stabilizing operators associated to each vertex of the graph as in Equation (<ref>). For each one of the operators the corresponding graph state has eigenvalue 1 (This is part of the reason for which this Bell operator is maximally violated by graph states). Other examples of Bell inequalities violated by graph states were shown in <cit.>.\n\nGiven a graph G=(V,E), let V' ⊂ V be any subset of vertices of G. The induced subgraph G[V'] is the graph whose vertex set is V' and whose edge set consists of all of the edges in E that have both endpoints in V'. An example of an induced graph of the graph in Figure <ref> is shown in Figure <ref>, where an excluded vertex is marked in red. In this paper we discuss the effect of loss of qubits on the violation of the Bell operators. When qubits are lost, it is natural to examine the violation of the Bell operator corresponding to the original graph or to the induced subgraph defined above. \n\n\n\n§ RESULTS\n\n\nWe now consider the effect of loss of qubits on the possibility of violating the Bell inequalities presented in Section <ref>. The loss-tolerance is determined by the decrease of the violation when losing qubits of the ideal graph state and while using the ideal measurements.\n\n\n\n §.§ Graph States' Violation of Bell Inequalities after Qubit Loss\n\n\n\nThe quantitative effect of tracing out qubits on the expectation value of the operator in Equation (<ref>), for both the original graph and the induced graph, is the content of Theorem <ref>.\n\n\n\n    Let |ϕ^G⟩ be a graph state defined on the graph G=(V,E), (|V|=N). Let ℒ be a set of indices ℒ⊆{ 1,…,N } of the lost qubits. Define the density matrix after qubit loss[The choice of representing the lost qubits by replacing them with ⊗_l ∈ℒ|0⟩_l⟨0|_l is arbitrary, the same results would have been obtained by replacing the lost qubit set with ⊗_l ∈ℒ|1⟩_l⟨1|_l or the totally mixed state.]\n     \n    ρ = Tr_ℒ( |ϕ^G⟩⟨ϕ^G| ) ⊗_l ∈ℒ|0⟩_l⟨0|_l .\n\n  Denote by  n_max the maximal number of neighbors of a vertex in the graph and by r an index of a vertex with the maximal number of neighbors such that r∉ℒ.[For r∈ℒ the equation holds for I_r^G*.] \n  \n  Define the sets 𝒲^G = 𝒩_r^G∖⋃_l ∈ℒ𝒩_l^G and 𝒯^G = {1,…,N}∖( ⋃_l ∈ℒ𝒩_l^G∪𝒩_r^G).\n\tThen,\n\t\n    ⟨ I_r^G*⟩_ρ = ⟨ I_r^G[V∖{ v_l s.t  l∈ℒ}]*⟩_ρ = \n    \t\t√(2)n_max+√(2)|𝒲^G|+|𝒯^G|    𝒩_r^G∩ℒ = ∅\n    √(2)|𝒲^G|+|𝒯^G|    otherwise ,\n\n\t\n\twhere I_r^G*, I_r^G[V∖{ v_l s.t  l∈ℒ}]* are defined via Equation (<ref>).\n\n\nAn example of a graph along with the sets 𝒲 and 𝒯 defined in Theorem <ref> is shown in Figure <ref>.\n\n\n\nThe Bell operators maximally violated by the corresponding graph states described in Equation (<ref>) and Equation (<ref>) are a sum of stabilizing operators defined in Equations (<ref>). The following lemma describes the effect of tracing out qubits on the expectation value of each stabilizer; The proof of Theorem <ref> is a direct result of it. \n\nlemmauniverse\n\nLet G, ℒ, ρ be as in Theorem <ref>.\nLet S_i^G be the stabilizing operator associated with the vertex v_i∈ V corresponding to the graph G. Then,\n\t\n\t\n  * \n    ⟨ S_i^G⟩_ρ  = \n        \t    \n        \t\t   0     i ∈⋃_l ∈ℒ𝒩_l^G\n    \n        \t\t1    otherwise\n\n    \n  * \n    ⟨ S_i^G[V∖{ v_k s.t.  k∈ℒ}]⟩_ρ  = \n            \t    \n            \t\t   0     i ∈⋃_l ∈ℒ𝒩_l^G\n    \n            \t\t1    otherwise .\n\n\t\n\n\n\nThe full proof of Lemma <ref> is shown in Appendix <ref>, with the main ideas mentioned here. It becomes apparent that after the partial trace, the remaining state is not a graph state of the induced graph. Stabilizing operators corresponding to neighbors of traced out qubits i ∈(⋃_l ∈ℒ𝒩_l^G) do not have expectation value 1 in the new state. \n\n\nThe classical limits of the Bell operators corresponding to the graphs G and G[V∖{ v_l s.t  l∈ℒ}] generally satisfy β^G[V∖{ v_l s.t  l∈ℒ}]_C < β^G_C, since the number of vertices is smaller in the induced graph when ℒ≠∅.\nAs shown in Theorem <ref>, the expectation values of the operators I_r^G* and I_r^G[V∖{ v_l s.t  l∈ℒ}]* with respect to the density matrix in Equation (<ref>) are the same. Hence, it is more likely to observe violation of the operator I_r^G[V∖{ v_l s.t  l∈ℒ}]*. Hence, one can gather the statistics performing measurements with respect to the original full graph and then compare the expectation value to the classical limit of the induced graph.\n\n\nWhen attempting to use graph states in scenarios in which qubit loss is dominant, the following theorem shows that for every graph, a loss of a root jeopardizes the violation.\n\n\n\n    Let G, ℒ, ρ be as in Theorem <ref> and let ℛ be the set of all roots of G. Denote by ℬ={ I_r^G* |   r∈ℛ} the set of Bell operators defined in Equation (<ref>) with the specific measurement bases defined in Equation (<ref>). Then, ∀ r' ∈ℛ if ℒ = {r'}, it follows that[In Equation (<ref>), ⟨ I_r^G[V ∖{r'}]*⟩_ρ is not always defined, it assumes r is also a root for the induced graph.] ∀  I_r^G*∈ℬ\n    \n    ⟨ I_r^G*⟩_ρ = ⟨ I_r^G[V ∖{r'}]*⟩_ρ < β_C^G[V ∖{r'}] < β_C^G .\n \n\n\n\n    Let r,r' be as in the theorem conditions. First, assume that n_max of the induced graph remains unchanged so that β_C^G[V ∖{r'}] = N + n_max -2 and that r ≠ r'. If some root is lost,  n_max + 1 stabilizers in Equation (<ref>) vanish according to Lemma <ref> (corresponding to the lost qubit and its neighbors). The coefficients of all stabilizers in Equation (<ref>) are 1, √(2) or √(2)n_max, meaning that the quantum bound is decreased at\n     least by n_max + 1. Hence, ∀  I_r^G*∈ℬ\n     \n    ⟨  I_r^G*⟩≤β_Q^G - (n_max + 1) = (2√(2)-2)n_max+N-2 < β_C^G[V ∖{r'}] .\n\n     If n_max is decreased, it follows that r' ∈𝒩_r^G which means that the expectation value is decreased by at least (√(2) + 1)n_max + √(2)  - 1, meaning that there is a violation even though the classical limit is decreased by a larger amount.\n      β_C^G[V ∖{r'}] < β_C^G as mentioned before so this holds for β_C^G as well. The cases where r = r' or when there is a single root are treated similarly.\n\n\nTheorem <ref> implies that when a root vertex is lost there is no violation of the classical limit and hence for every choice of graph state, the set of roots must be kept safe when attempting to use the Bell operator proposed in Equation (<ref>) as the operator for a Bell test. The margin by which the Bell operator is not violated is generally expected to decrease further with additional lost qubits. In some extreme examples this does not hold (such as graphs where roots belong to clusters which are almost disconnected and a whole cluster of qubits is lost).\n\n\n\n §.§ Examples\n\nIn this section, we discuss several applications of Theorem <ref>. Different examples of graph states are examined, with the objective of identifying structures which are more likely to violate the classical limit, even when some qubits are lost. We start with well-known examples which are found to be loss-sensitive, move to loss-tolerant examples and in the end discuss the case where the set of lost qubits is unknown. In order to simplify the notation, induced graphs of the form G[V∖{ v_l s.t  l∈ℒ}] are denoted by G'. In the entire section, N stands for the total number of vertices in the graph, as before.\n\n\n\n  §.§.§ Loss-Sensitive Graph States\n\n\n\n\n  \nRing graph state. An example of a ring graph state is shown in Figure <ref>. The classical limit is given by β_C^Ring=N+1 and is reduced by 1 with every lost qubit (as long as the maximal number of neighbors remains 2). In this state, all the vertices are roots, and therefore as an immediate result of Theorem <ref> there is no violation when any qubit is lost.   \n\n\n\n\n\n  \nGHZ (“star”) graph state. The GHZ state is the graph state corresponding to a “star” graph (Figure <ref>) up to local unitaries. The classical limit is given by β_C^GHZ=2N - 2. If the qubit corresponding to the center vertex is lost, the expectation value of the Bell operator vanishes as shown in the proof of Theorem <ref>. If some other qubit is lost, the expectation value becomes\n\n    ⟨ I^GHZ*_r⟩_ρ = ⟨ I^GHZ'*_r⟩_ρ = √(2)(N-2) < β_C^GHZ', β_C^GHZ .\n\n\nThe GHZ example demonstrates that when neighbors of the vertex chosen as the root are lost, a major contribution to the Bell operator's expectation value vanishes. This leads to the understanding that in order to construct graph states that are robust to loss of qubits, it can be beneficial to choose a graph with a redundancy of roots.  \n\nIn order to maintain some violation of the classical limit it is sufficient to have one choice of root succeed. A graph with only one root is sensitive to loss of any neighbor of the root or the root itself and thus having more than one root might be helpful. On the other hand, if all qubits are roots according to Theorem <ref> there is no violation. Hence, more promising architectures must include several “clusters” of roots and their neighbors. This key insight leads to the construction of following examples.\n\n\n\n  §.§.§ Loss-Tolerant Graph States\n\n\n\n\n  \n“Two centered GHZ” graph state. Consider the “two centered GHZ” as in Figure <ref>. The graph has two root vertices connected to one another and several leaf vertices adjacent to each one of the centers. Denote the centers by r_1,r_2. The classical limit in this case is given by β_C^Two centered GHZ = 3/2N - 1. If r_1 or r_2 are lost there is no violation as implied from Theorem <ref>. \n\nOn the other hand, suppose that a qubit corresponding to v_l, l ≠ r_1,r_2 is lost. Without loss of generality l∈𝒩(r_1). The expectation value of the Bell operator corresponding to r_2 is given by \n\n    ⟨ I^Two centered GHZ*_r_2⟩_ρ =\t⟨ I^Two centered GHZ'*_r_2⟩_ρ = (√(2) + 1/2)N -√(2) - 2\n    \t  .\n\nHence the classical limit is violated.\nIf qubits adjacent to both r_1, r_2 are lost, there is no violation. However, if multiple qubits adjacent to the same root are lost there is always a violation of the Bell inequality corresponding to the induced graph, and in many cases also with respect to the full graph. The exact conditions are summarized in Table <ref>.\n\n\n\n\nThe two centered GHZ example demonstrates that having more than one root enables robustness to loss of qubits. If a qubit adjacent to one of the roots is lost, it is possible to evaluate the Bell inequality with respect to the other root and maintain the violation. However, it allowed loss of qubits adjacent to only one of the roots. This can be improved upon by constructing graphs with a larger number of roots which will violate the Bell inequality as long as all neighbors of some root aren't lost. This leads to the following example.\n\n\n\n  \n“Dense center graph state”. Consider the graph in  Figure <ref> <cit.>. It is constructed of a complete graph in the middle and a leaf connected to each vertex in the complete graph. The classical bound in this case is given by β^Dense center_C = 3/2N - 1. \nAs before, if one of the qubits from the complete-graph center is lost, there is no violation. \n\n\n\n\n\n\n\nRemarkably, for this graph, it is possible to violate the classical limit when several leaves are lost. The maximal number of lost qubits for which the remaining state still violates the classical limit can be calculated as follows. Every lost leaf qubit decreases the original quantum limit by √(2) + 1, i.e,\n\n    ⟨ I^Dense center*_r⟩_ρ= ⟨ I^Dense center'*_r⟩_ρ = β_Q^Dense center -(√(2) + 1)|ℒ|\n          .\n\nAs a result, the violation is maintained as long as |ℒ| ≤√(2) - 1/√(2) N for the induced graph and |ℒ| ≤√(2) - 1/√(2) + 1 N for the full graph. The results are summarized in Table <ref>. Note that the complete graph in the center can be approximated by some other, lower degree k-regular graph. In this case, since n_max is smaller the amount of lost qubits allowed will be smaller.\n\n\nAlthough a smaller number of leaves can be lost in the dense center example compared with the two-centered GHZ example, the dense center graph has a better performance in terms of the number of leaves that can be lost in the worst case with respect to which set of leaves is lost. We remark that these two examples are complementary is some sense.  The difference between the classical and the quantum bound is linear in n_max and hence the larger n_max is, the better. In order for a violation to hold when qubits are lost, the graph topology should protect n_max from changing. In the two-centered GHZ example n_max is large by making each root connected to many leaves while in the dense center example this is achieved by the roots being highly connected to one another. \n\n\n\n\n\n\n  §.§.§ Unknown Set of Lost Qubits\n\n\nThe previous sections discussed situations in which the set of lost qubits is known. This section is devoted to the scenario where this information is unavailable. \nIn this case, the density matrix is a convex combination of density matrices in the form of Equation (<ref>), corresponding to all the possibilities of lost qubit sets and their probability. Thus, the expectation value of the Bell operator corresponding to the full graph should be calculated in a similar way as in the previous sections. It is the linear combination of all the expectation values as in Theorem <ref> with coefficients according to the probability for each density matrix in the convex sum. \nIt is also natural to ask how the expectation value with respect to one of the possible induced graphs behaves in these cases. When the lost qubits were known, it was always better to evaluate the expectation value of the Bell operator of the induced graph. Interestingly, we find that this is no longer clear cut when the set of lost qubits is unknown. This should be taken into account when deciding which measurements to perform.\n\nFor example, suppose that in the dense center graph example described in Section <ref> and in Figure <ref> there is probability p for a single qubit loss of one of the leaves (without knowing which). The density matrix is a sum of the following density matrices: (1-p)|ϕ^G⟩⟨ϕ^G| + 2p/N∑_ℒρ_ℒ (where ρ_ℒ is the density matrix corresponding to each possibility of lost qubit). For every choice of root there is a density matrix in the sum corresponding to the loss of the leaf adjacent to the chosen root. \nFor the full graph Bell operator, as seen before, when this leaf is lost, there is no violation. However, the total state still violates the Bell inequality by a margin which decreases with larger p. In the limit of small p the violation approaches its maximal possible margin.\nOn the other hand, choosing to focus on the Bell operator of one of the possible induced graphs, the violation in the limit p → 0 is dominated by the case where no qubit is lost, and as shown in Appendix <ref> in Lemma <ref>, the violation is not optimal since the expectation value of some stabilizers in the sum vanishes. Generally, this advantage of the full graph Bell inequality should be expected to hold up to some finite value of p. \n\n\n\n§ DISCUSSION AND OPEN QUESTIONS\n\nIn this work we have discussed the robustness of Bell violation of graph states to loss of qubits. We used the stabilizer formalism to derive a lemma which, for any given graph state, provides the exact\ndecrease in the Bell violation for any subset of lost qubits. Provided a graph state, the results allow to determine how many qubits can be lost while still maintaining the violation. In addition, it allows to identify qubits that are more important and must be kept safe since their loss demolishes the violation. \nIn particular, it was shown that the widely studied GHZ and ring\ntopologies are susceptible to loss of any qubit, while other topologies such as the “two-centered GHZ” and “dense center” graphs presented in Section <ref> are more resilient. \n\n\nWe find that for no-click events (scenarios in which, e.g., photon detectors are expected to detect a photon but they do not and thus it is known which qubits were lost) considering the Bell operator of the induced sub-graph of the remaining qubits better optimizes the violation. The expectation value of the Bell operator of the full graph and the induced graph in this case turn out to be the same, but the classical bound for the induced sub-graph is lower and hence the violation is more significant. In addition, we've discussed the scenario in which the information of which qubit is lost is unavailable. For these cases, we've demonstrated examples in which it is better to use the Bell operator corresponding to the full graph.  \n\nFor future work, the main lemma derived here can be used to optimize graph topologies with respect to different metrics of robustness. The relevant metric should arise from constraints in real experimental setups and depend on use-case specification for the graph state. For example, one could consider maximal loss of qubits where there is still a violation, maximal violation after a specified subset of qubits is lost, and so on. Furthermore, other sources of error such as bit flips and phase errors may be taken into account in the analysis. In addition, the stabilizer formalism approach used here to derive Lemma <ref> can be applied to other Bell inequalities violated by graph states as they are all sums of multiplications of the stabilizing operators.\n\n\n\n§ ACKNOWLEDGMENTS\n\nWe would like to thank Ziv Aqua and Barak Dayan for insightful discussions and Thomas Vidick for helpful comments on the manuscript. \nThis research was generously supported by the Peter and Patricia Gruber Award, the Daniel E. Koshland Career Development Chair, the Koshland Research Fund and the Minerva foundation with funding from the Federal German Ministry for Education and Research. \n\n\n\n\n\n\n§ PROOF OF LEMMA <REF>\n \n\n*\n\n\n\n\n\tExpress the graph states as follows\n\t\n\t\n    |ϕ^G⟩ =\n    \t\t∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ ,\n\n\t\n\twhere {|ψ_s⟩_{1,…,N}∖ℒ} _s ∈{0,1}^|ℒ| are normalized in the remaining N - |ℒ| dimensional Hilbert space. In addition,\n\t\n    ∑_s ∈{ 0,1 }^|ℒ||α_s|^2=1 \n    \t\t  ,\n\n\n\tsince |ϕ^G⟩ is normalized. Hence \n\t\n\t\n    ρ    =Tr_ℒ[ \n    \t\t(∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ)\n    \t\t(∑_s ∈{0,1}^|ℒ|α_s^*⟨ψ_s|_{1,…,N}∖ℒ⊗⟨ s |_ℒ) ]\n    \t\t⊗(⊗_l ∈ℒ|0 ⟩_l⟨ 0 |_l) \n        =\n    \t\t(\n    \t\t∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t⊗(⊗_l ∈ℒ|0 ⟩_l⟨ 0 |_l)\n    \t\t  .\n\n\t\n\tThe expectation values in Equation (<ref>) are calculated separately for each  of the following cases\n\t\n\t\n\t\t\n  * i ∉⋃_l ∈ℒ𝒩_l^G\n\t\t\n  * i∈(⋃_l ∈ℒ𝒩_l^G)∖ℒ\n\t\t\n  * i ∈ℒ (Relevant only for part a)\n\t\n\t\n\tThe proof is divided into two parts. In Part A the eigenvalue equation (Equation (<ref>)) is used in order to calculate the action of the stabilizers S_i^G omitting their support on the lost qubits, on the states |ψ_s⟩ for all i ∈{1,…,N}, s ∈{0,1}^|ℒ|. These reduced operators are in fact the stabilizers of the induced graph S_i^G[V∖{ v_k s.t  k∈ℒ}] for i∈{1… N}∖ℒ. In Part B the result is applied in order to calculate the expectation value of the stabilizing operators S_i^G,S_i^G[V∖{ v_k s.t  k∈ℒ}]. Note that when stabilizers act on states |ψ_s⟩ in a reduced Hilbert space, it is to be understood that the identity operators in the complementary system are discarded.\n\n\t\n\t\n\n  \nPart A: Calculating the Action of the Stabilizers on |ψ_s⟩.\n\t\n\t\n\t\t\n  * For i ∉⋃_l ∈ℒ𝒩_l^G: S_i^G = S_i^G[V∖{ v_k s.t  k∈ℒ}].\n\t\tUsing the eigenvalue equation\n\t\t\n\t\t\n    S_i^G|ϕ^G⟩    = \n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s S_i^G|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ\n        =\n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s S_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ\n        =\n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ .\n\n\t\t\n\t\tFor all |s⟩_ℒ, s ∈{0,1}^|ℒ|\n\t\t\n    S_i^G|ψ_s⟩_{1,…,N}∖ℒ = \n    \t\t\tS_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ = \n    \t\t\t|ψ_s⟩_{1,…,N}∖ℒ ,\n\n\t\tmeaning that {|ψ_s⟩_{1,…,N}∖ℒ} _s ∈{0,1}^|ℒ| are eigenstates of S_i^G  = S_i^G[V∖{ v_k s.t  k∈ℒ}] with eigenvalue 1.\n\t\t\n\t\t\n  * For  i∈( ⋃_l ∈ℒ𝒩_l^G)∖ℒ \n\t\t\n    S_i^G = S_i^G[V∖{ v_k s.t  k∈ℒ}]⊗_l∈𝒩_i^G∩ℒ Z_l .\n\n\t\tHence, \n\t\t\n\t\t\n    S_i^G|ϕ^G⟩    = S_i^G[V∖{ v_k s.t  k∈ℒ}]⊗_l∈𝒩_i^G∩ℒ Z_l∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ\n        =  ∑_s ∈{0,1}^|ℒ|α_s( S_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ) ⊗( ⊗_l∈𝒩_i^G∩ℒ Z_l|s⟩_ℒ)  \n        = ∑_s ∈{0,1}^|ℒ|α_s( S_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ) ⊗[ ⊗_l∈𝒩_i^G∩ℒ Z_l( ⊗_l'∈ℒ|s_l'⟩_l') ]  \n    \t\t\t\n        = ∑_s ∈{0,1}^|ℒ|α_s( S_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ) ⊗( (-1)^∑_l∈ℒ∩𝒩_i^G s_l|s⟩_ℒ) \n    \t\t\t\n        =\n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ ,\n\n\t\twhere in the third step |s⟩ = ⊗_l'∈ℒ|s_l'⟩_l'. \n\t\tFor all |s⟩_ℒ, s ∈{0,1}^|ℒ|\n\t\t\n\t\t\n    S_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ = (-1)^∑_l∈ℒ∩𝒩_i^G s_l|ψ_s⟩_{1,…,N}∖ℒ ,\n\n\t\tmeaning that |ψ_s⟩_{1,…,N}∖ℒ are eigenstates of S_i^G[V∖{ v_k s.t  k∈ℒ}] with eigenvalues -1,1. The eigenvalue depends on the parity of the number of 1's in the string s ∈{ 0,1 }^|ℒ| in indices l ∈ℒ∩𝒩_i^G. \n\t\t\n\t\tThe number of states |ψ_s⟩ with eigenvalue 1 is equal to the number of states with eigenvalue -1. This can easily be shown by proving a one-to-one correspondence between these two sets. Choose l' ∈ℒ∩𝒩_i^G (it is possible since ℒ∩𝒩_i^G is not empty). Notice that s = s_l_0,…,s_l',… ,s_l_|ℒ| and s = s_l_0,…,s̅_̅l̅'̅,… s_l_|ℒ| have opposite parity and therefore have opposite signs of their eigenvalues with respect to S_i^G[V∖{ v_k s.t  k∈ℒ}].\n\t\t\n\t\t\n  * For i ∈ℒ using the eigenvalue equation as before\n\t\t\n\t\t\n    S_i^G|ϕ^G⟩    = X_i⊗_j∈𝒩_i^G∖ℒZ_j⊗_l∈𝒩_i^G∩ℒ Z_l∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ\n        = \n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s( ⊗_j∈𝒩_i^G∖ℒ Z_j|ψ_s⟩_{1,…,N}∖ℒ) ⊗( X_i⊗⊗_l∈𝒩_i^G∩ℒ Z_l|s⟩_ℒ)  \n        = \n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s( ⊗_j∈𝒩_i^G∖ℒ Z_j|ψ_s⟩_{1,…,N}∖ℒ) ⊗[ X_i⊗⊗_l∈𝒩_i^G∩ℒ Z_l(⊗_l'∈ℒ|s_l'⟩_l') ]  \n        = \n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s( ⊗_j∈𝒩_i^G∖ℒ Z_j|ψ_s⟩_{1,…,N}∖ℒ) ⊗[ (X_i|s_i⟩_i) ⊗⊗_l∈𝒩_i^G∩ℒ Z_l(⊗_l'∈ℒ∖{i}|s_l'⟩_l') ]   \n        = \n    \t\t\t∑_s ∈{0,1}^|ℒ|α_s( ⊗_j∈𝒩_i^G∖ℒ Z_j|ψ_s⟩_{1,…,N}∖ℒ) ⊗[(-1)^∑_l∈ℒ∩𝒩_i^G s_l|s̅_̅i̅⟩_i⊗(⊗_l'∈ℒ∖{i}|s_l'⟩_l') ]   \n        = ∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ .\n\n\t\t\n\t\tAgain, in the third step |s⟩ = ⊗_l'∈ℒ|s_l'⟩_l'.\n\t\tFor all |s⟩_ℒ, s ∈{0,1}^|ℒ|, s = s_l_0,…,s_l_i,… ,s_l_|ℒ|\n\t\t\n\t\t\n    α_s_l_0,…,s_l_i,… ,s_l_|ℒ|⊗_j∈𝒩_i^G∖ℒ Z_j|ψ_s_l_0,…,s_l_i,… ,s_l_|ℒ|⟩_{1,…,N}∖ℒ = \n    (-1)^∑_l∈ℒ∩𝒩_i^G s_lα_s_l_0,…,s̅_̅l̅_̅i̅,… ,s_l_|ℒ||ψ_s_l_1,…s̅_̅l̅_̅i̅,…_l_|ℒ|⟩_{1,…,N}∖ℒ .\n\n\t\t\n\t\tNotice that for all i ∈ℒ\n\t\t\n    |α_s_l_0,…,s_l_i,… ,s_l_|ℒ||= |α_s_l_0,…,s̅_̅l̅_̅i̅,…,s_l_|ℒ||\n    \t\t     ,\n\n\t\tsince the operator ⊗_j∈𝒩_i^G∖ℒ Z_j is unitary, meaning that the states remain normalized after it is applied.\n\t\t\n\t\tHence, for all s,s' ∈{0,1}^|ℒ|\n\t\t\n    |α_s| =|α_s'|\n    \t\t      ,\n \n\t\tsince s,s' differ from one another by flipping a finite set of indices, and one can create a series of equalities  transforming from |α_s| to  |α_s'| by flipping one index at a time while maintaining the equality.\n\t\n\t\n\t\n\n  \nPart B: Calculating the Expectation Values.\n\t\n\t\t\n  * For i ∉⋃_l ∈ℒ𝒩_l^G, using the eigenvalue equation obtained in Equation (<ref>)\n\t\t\n\t\t\n    ⟨ S_i^G⟩_ρ    = \n    \t\t\tTr[ ( S_i^G∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t\t⊗( ⊗_l ∈ℒ|0 ⟩_l⟨ 0 |_l) ] \n        = \n    \t\t\tTr_{ 1,…,N}∖ℒ[\n    \t\t\t∑_s ∈{0,1}^|ℒ||α_s|^2  S_i^G|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ] \n        =\n    \t\t\tTr_{ 1,…,N}∖ℒ[\n    \t\t\t∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ] \n        = 1\n    \t\t\t  .\n\n\t\t\n\t\tIn the third step the qubits in ℒ are traced out, in the fourth step Equation (<ref>) is used, and the last step is correct due to the normalization of |ϕ^G⟩  as in Equation (<ref>). The exact same calculation holds for S_i^G[V∖{ v_k s.t  k∈ℒ}].\n\t\t\n\t\t\n  * For i∈( ⋃_l ∈ℒ𝒩_l^G)∖ℒ\n\t\t\n    ⟨ S_i^G⟩_ρ    = \n    \t\t\t⟨  S_i^G[V∖{ v_k s.t  k∈ℒ}]⊗_l∈𝒩_i^G∩ℒ Z_l⟩\n        = \n    \t\t\tTr[ S_i^G[V∖{ v_k s.t  k∈ℒ}]⊗_l∈𝒩_i^G∩ℒ Z_l(∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t\t⊗( ⊗_l ∈ℒ|0 ⟩_l⟨ 0 |_l) ] \n        = \n    \t\t\tTr[ ( ∑_s ∈{0,1}^|ℒ||α_s|^2  S_i^G[V∖{ v_k s.t  k∈ℒ}]|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t\t⊗(⊗_l ∈𝒩_i^G∩ℒ Z_l⊗_l ∈ℒ|0 ⟩_l⟨ 0 |_l) ] \n        = \n    \t\t\tTr_{1,…,N}∖ℒ[∑_s ∈{0,1}^|ℒ||α_s|^2(-1)^∑_l∈ℒ∩𝒩_i^G s_l|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ] \n    \n    \t\t\t\n    \t\t\t    = \n    \t\t\t∑_s ∈{0,1}^|ℒ|(-1)^∑_l∈ℒ∩𝒩_i^G s_l|α_s|^2 .\n\n\t\t\n\t\tIn the fourth step Equation (<ref>) is used as well as the notation |s⟩ = ⊗_l'∈ℒ|s_l'⟩_l'.\n\t    In Part A for i∈( ⋃_l ∈ℒ𝒩_l^G)∖ℒ, it was shown that there is a one-to-one correspondence between the eigenstates |ψ_s⟩ with eigenvalue 1 and the eigenstates with eigenvalue -1. In addition, in Equation (<ref>) it was shown that the coefficients α_s for all s∈{0,1}^|ℒ| have the same absolute value. As a consequence, the sum above vanishes.\n\t\t\n\t\tThe exact same calculation holds for S_i^G[V∖{ v_k s.t  k∈ℒ}] discarding the ⊗_l∈𝒩_i^G∩ℒ Z_l part in the calculation.\n\t\t\n\t\t\n  * For i∈ℒ\n\t\t\n    ⟨ S_i^G⟩_ρ    = ⟨ X_i⊗_j∈𝒩_i^G∖ℒ Z_j⊗_l∈𝒩_i^G∩ℒ Z_l⟩\n        =\n    \t\t\tTr[ X_i⊗_j∈𝒩_i^G∖ℒ Z_j⊗_l∈𝒩_i^G∩ℒ Z_l(\n    \t\t\t∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t\t⊗( ⊗_l ∈ℒ|0 ⟩_l⟨ 0 |_l) ] \n        = \n    \t\t\tTr[(⊗_j∈𝒩_i^G∖ℒ Z_j∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t\t⊗(⊗_l∈𝒩_i^G∩ℒ Z_l⊗_l ∈ℒ∖{i}|0 ⟩_l⟨ 0 |_l) ⊗( X_i|0 ⟩_i⟨ 0 |_i)] \n        =\n    \t\t\tTr[(⊗_j∈𝒩_i^G∖ℒ Z_j∑_s ∈{0,1}^|ℒ||α_s|^2|ψ_s⟩_{1,…,N}∖ℒ⟨ψ_s|_{1,…,N}∖ℒ)\n    \t\t\t⊗(⊗_l∈𝒩_i^G∩ℒ Z_l⊗_l ∈ℒ∖{i}|0 ⟩_l⟨ 0 |_l) ⊗|1 ⟩_i⟨ 0 |_i] \n        = 0\n    \t\t\t  .\n\n\t\t\n\t\tThe expression vanishes due to the partial trace on the i'th qubit. \n\n\n\n\n\n§ EXPECTATION VALUE OF AN INDUCED GRAPH STABILIZER ON THE ORIGINAL STATE\n\n\n\n\n\nLet G, ℒ be as in Theorem <ref>, |ϕ^G⟩ the graph state corresponding to G and \nS_i^G as in Lemma <ref>. Then,\n\n    ⟨ S^G[ V∖{ v_k s.t  k∈ℒ}]_i⟩_ϕ^G  = \n            0     i ∈⋃_l ∈ℒ𝒩_l^G\n    \n            1    otherwise\n\n\n\n\nThe proof is very similar to the proof of Lemma <ref>.\nWrite |ϕ^G⟩ as in Equation (<ref>) and have, \n    \n\n    ⟨ S^G[ V∖{ v_k s.t  k∈ℒ}]_i⟩_ϕ^G    = \n         ⟨ϕ^G| S^G[ V∖{ v_k s.t  k∈ℒ}]_i|ϕ^G⟩\n        =\n         (∑_s' ∈{0,1}^|ℒ|α_s'^*⟨ψ_s'|_{1,…,N}∖ℒ⊗⟨ s' |_ℒ) S_i^G[V∖{ v_k s.t  k∈ℒ}]( ∑_s ∈{0,1}^|ℒ|α_s|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ) \n         \n        = \n         (∑_s' ∈{0,1}^|ℒ|α_s'^*⟨ψ_s'|_{1,…,N}∖ℒ⊗⟨ s' |_ℒ)  ( ∑_s ∈{0,1}^|ℒ|α_s(-1)^∑_l∈ℒ∩𝒩_i^G s_l|ψ_s⟩_{1,…,N}∖ℒ⊗|s⟩_ℒ) \n        = \t\n         ∑_s ∈{0,1}^|ℒ|(-1)^∑_l∈ℒ∩𝒩_i^G s_l|α_s|^2 .\n   \n\nIn the third step we used Equation (<ref>). As in the proof of Lemma (<ref>) this sum vanishes when ℒ∩𝒩_i^G≠∅.\n\n\n\n\nunsrt\n\n"}