{"entry_id": "http://arxiv.org/abs/2303.07225v1", "published": "20230313155846", "title": "On the cyclotron absorption line and evidence of the spectral transition in SMC X-2 during 2022 giant outburst", "authors": ["G. K. Jaisawal", "G. Vasilopoulos", "S. Naik", "C. Maitra", "C. Malacaria", "B. Chhotaray", "K. C. Gendreau", "S. Guillot", "M. Ng", "A. Sanna"], "primary_category": "astro-ph.HE", "categories": ["astro-ph.HE", "astro-ph.SR"], "text": "\n\nfirstpage–lastpage\nEstimate distillable entanglement and quantum capacity by squeezing useless entanglement\n    Xin Wang\n    March 30, 2023\n========================================================================================\n\n\n\n\n\n\n\nWe report comprehensive spectral and temporal properties of the Be/X-ray binary pulsar SMC X-2 using X-ray observations during the 2015 and 2022 outbursts. The pulse profile of the pulsar is unique and strongly luminosity dependent.  It evolves from a broad-humped into a double-peaked profile above luminosity 3×10^38 ergs s^-1. The pulse fraction of the pulsar is found to be a linear function of luminosity as well as energy. We also studied the spectral evolution of the source during the latest 2022 outburst with NICER. The observed photon index shows a negative and positive correlation below and above the critical luminosity, respectively, suggesting evidence of spectral transition from the sub-critical to super-critical regime. The broadband spectroscopy of four sets of NuSTAR and XRT/NICER data from both outbursts can be described using a cutoff power-law model with a blackbody component. In addition to the 6.4 keV iron fluorescence line, an absorption-like feature is clearly detected in the spectra. The cyclotron line energy observed during the 2015 outburst is below 29.5 keV, however latest estimates in the 2022 outburst suggest a value of 31.5 keV. Moreover, an increase of 3.4 keV is detected in the cyclotron line energy at equal levels of luminosity observed in 2022 with respect to 2015. The observed cyclotron line energy variation is explored in terms of accretion induced screening mechanism or geometrical variation in line forming region. \n\n\n\n\n\nstars: neutron – pulsars: individual: SMC X-2 – X-rays: stars.\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nBe/X-ray binaries (BeXRBs) represent two-thirds of the population of high mass X-ray binaries (HMXBs). These systems consist of a massive (>10) optical companion and a compact object (usually a neutron star) in a binary system. The optical companion in BeXRBs is a non-supergiant OB spectral type star that shows Balmer series emission lines and infrared excess at a point in its life <cit.>. The above characteristics originate from an equatorial circumstellar disk that is formed around the Be star due to its rapid rotation at velocities of more than 75% of Keplerian limit <cit.>. The compact object in the system, on the other hand, accretes directly from the Be-circumstellar disk. Two kinds of X-ray outbursts are observed from BeXRBs.  First, Type-I outbursts are short (only a few weeks long), (quasi-)periodic events that reach a peak luminosity\nof ≤10^37and occur close to the periastron passage of the binary system.\nThe second category of outbursts is giant in nature, where the peak luminosity reaches ≥10^37-38. The latter usually lasts for a multiple or significant portion of the orbit and does not follow any orbital dependencies. \n\nA significant population of BeXRBs is found in the Milky Way and the Magellanic Clouds with luminosities in the range of 10^34-38<cit.>. Our Galaxy hosts about 60–70 such systems <cit.>. The Small Magellanic Cloud (SMC; a neighboring irregular dwarf galaxy), however, contains about 68 pulsars (and a total of 122 sources including candidates) despite being only a few percent of the mass of the Milky Way Galaxy <cit.>. \n\nSMC X-2 is a 2.37 s pulsating  source in a BeXRB system located inside SMC <cit.> at a distance of 62 kpc <cit.>. It was the second brightest X-ray source in the galaxy when SAS 3 discovered it in October 1977. The recorded luminosity was 8.4×10^37 ergs s^-1 (assuming  a distance of 65 kpc) in the 2–11 keV energy band <cit.>. Later observations with the HEAO, Einstein and ROSAT missions demonstrated the X-ray transient nature of the source <cit.>. Thanks to (Rossi X-ray Timing Explorer) and ASCA (Advanced Satellite for Cosmology and Astrophysics), coherent X-ray pulsations from SMC X-2 were detected for the first time during the 2000 January-April outburst <cit.>. This discovery made it possible to identify the accreting object as a neutron star. The optical observations of the system, on the other hand, suggested two possible early-type stars at an angular separation of 2.5 arcsec as the potential counterparts of the pulsar. The Optical Gravitational Lensing Experiment (OGLE) I-band photometric studies found variability at a period of 18.62±0.02 d from one of the stars (northern star) <cit.>. This periodicity closely matched the orbital period of ≈18.4 days measured by studying the X-ray pulse-period modulation during the 2002 and 2015 outbursts <cit.>. The optical counterpart (northern star) is identified to be an O9.5 III-V emission star <cit.>.      \n\nThe system displayed major outbursts during 1977 October <cit.>, 2002 January-April  <cit.>, 2015 August-November <cit.>, and 2022 June-August <cit.>.\nDetailed studies with XMM-Newton, Swift/XRT, and NuSTAR were performed during the 2015 outburst when the pulsar was accreting in the super-Eddington regime with a peak outburst luminosity of 6×10^38 ergs s^-1 <cit.>. Ionized emission lines from N, O, Ne, Si, and Fe were detected in the data from the XMM-Newton observation  <cit.>. Moreover, with broadband coverage of   in the range of 3-79 keV, the neutron star magnetic field was estimated  for the first time to be ≈3×10^12 G based on the discovery of a cyclotron resonance scattering feature (CRSF) at around 27 keV <cit.>. A negative correlation between the luminosity and cyclotron line energy was also reported in the study. In addition to this, the pulsar is known to show luminosity-dependent pulse profiles evolving from single to double-peaked <cit.>. The onset of the propeller regime observed in late 2015 also provided a measurement of the magnetic field to be ≈3×10^12 G <cit.>, in agreement with the estimation through CRSF detection. \n\nAfter seven years of X-ray quiescence, SMC X-2 became active on 2022 June <cit.>. The pulsar reached a peak luminosity of 1×10^38 ergs s^-1, three weeks after its detection in the soft X-ray band <cit.>. Unlike the 2015 outburst, the /GSC <cit.> did not detect any significant outburst peak in 2–20 keV band due to the relatively moderate nature of the outburst in addition to the observational coverage gap (see, e.g.,  Figure <ref>).  We monitored the target closely with and to understand the spectral and temporal evolution during the 2022 outburst. We also analyzed three observations from the 2015 outburst to examine the cyclotron line and its evolution and also studied the broadband temporal and spectral properties of the source.  Section 2 reports the details of the observations and data analysis methods. The timing and spectral results are presented in Section 3, followed by a discussion and conclusion in Section 4. \n\n\n\n\n\n\n\n\n\n§ OBSERVATIONS AND DATA ANALYSIS\n\n\n\n\n\n §.§ \n\n\nLaunched in 2017 June, the X-ray timing instrument (XTI, ) is a soft X-ray telescope (0.2–12 keV) attached to the International Space Station. The XTI consists of a total of 56 co-aligned concentrator optics. Each optics collimates the soft X-ray photons onto a silicon drift detector at the focus <cit.>. A high time resolution of ∼100 ns (rms) and spectral resolution  of ≈85 eV at 1 keV are achieved by . The effective area of the instrument is ≈1900 cm^2 at 1.5 keV, with 52 active detectors. The total field of view of is ≈30 arcmin^2. \n\nmonitored   after the onset of the 2022 outburst in June.  \nWe used a total of 37 observations under the ObsIDs 52028301xx with a net exposure time of ≈ 39.6 ks for studying the pulsar emission during the outburst between 2022 June 20 and August 17. We reduced the data using the nicerl2 [<https://heasarc.gsfc.nasa.gov/docs/nicer/analysis_threads/nicerl2/>] script available under HEASoft version 6.30. The reprocessing is done in the presence of the gain and calibration database files of version 20200722. The cleaned events obtained from the pipeline are used in our further analysis. In the beginning, the events from  the South Atlantic Anomaly region were filtered out. We further applied standard filtering criteria based on the elevation angle from the Earth limb, pointing offset, and the offset from  the bright Earth. Good time intervals were produced using the  nimaketime task. Final spectra and light curves were created with the XSELECT package of FTOOLS. The spectral background corresponding to each observation is generated using the nibackgen3C50[<https://heasarc.gsfc.nasa.gov/docs/nicer/toolsnicer_bkg_est_tools.html>] tool <cit.>. The response matrix and ancillary response files of version 20200722 are applied in our spectral analysis. \n\n\n\n   \n\n\n\n\n\n\n §.§ \n \nis the first hard X-ray focusing observatory launched in 2012 June  <cit.>. It consists of two co-aligned grazing angle incidence telescopes. The mirrors in each optic are coated with multilayers of Pt/SiC and W/Si that reflect the soft to hard X-ray photons. A Cadmium-Zinc-Telluride detector at the focal point of each unit is sensitive to the 3–79 keV photons.  Following the recent outburst of SMC X-2, we requested a ToO observation. The target was observed for an effective exposure of 42.7 ks on 2022 July 13-14 (Table <ref>). Standard  analysis procedures were followed for data reduction with NuSTARDAS 1.9.7 software. Unfiltered events were processed in the presence of the CALDB of version 20220802 using nupipeline task. Source products are extracted from a circular region of 120 arcsec radius around the central coordinates on each detector using the nuproducts task. The background products are also accumulated in a similar manner from a source-free circular region of 120 arcsec radius. The background-subtracted light curves from both detector modules of were combined for our timing studies. \n\nWe also reduced the data from the observations of SMC X-2 during its 2015 major outburst (Table <ref>) by following the above procedure. The first observation was close to the peak of the outburst in 2015 September, while the other two were in the declining phase. Corresponding /XRT observations are analyzed to perform broadband spectroscopy (see also  for XRT data analysis and descriptions; ). All four observations in the 2015-2022 timeline are simply referred to as Obs-I, Obs-II, Obs-III, and Obs-IV in the paper. For spectroscopy, we have grouped each , , and XRT spectra for a minimum of 32 counts per channel bin to achieve a good signal-to-noise ratio using grppha.   \n \n\n\n\n\n\n\n\n\n\n\n\n\n§ RESULTS\n\n\n\n\n §.§ Timing analysis\n\n\nWe searched for X-ray pulsations in the 3–79 keV light curves of using the χ^2-maximization technique <cit.>. The barycentric corrected pulse period of the neutron star was estimated to be  2.37197(2), 2.37141(2),  2.37257(2), and  2.37283(1) s during Obs-I, Obs-II, Obs-III, and Obs-IV, respectively. The light curves from all the observations are folded with the corresponding pulse period to obtain pulse profiles in the 3–79 keV band,  which are shown in  Figure <ref>. A double-peaked profile is clearly evident at a luminosity[The 0.5–100 keV unabsorbed luminosity is calculated at a distance of 62 kpc after broadband spectroscopy that is presented in Section 3.2.] of 6×10^38 ergs s^-1 (top panel of Figure <ref>). The shape of the pulse profile changes as luminosity decreases to <3×10^38 ergs s^-1 where a hump-like structure appears in the profile between 0.5–1.5 pulse phase. The pulse profiles exhibit similar morphology at an equal level of luminosities observed during the 2015 (Obs-II) and 2022 (Obs-IV) outbursts.\n\nWe adopted the following definition to evaluate the pulse fraction (PF) of the pulsar, i.e., the relative amplitude of pulsed modulation:\n\n    PF = F_max - F_min/F_max + F_min,\n\nwhere, F_max and F_min are the maximum and minimum intensities observed in the pulse profile, respectively. The estimated PFs during Obs-I, Obs-II, Obs-III, and Obs-IV are ≈45.7±0.4, 29.2±0.4, 17.6±0.2, and 26.2±0.3%, respectively. The observed PF is correlated with luminosity. This means that the pulsed emission from the accretion column or the hot spot contributes more than the unpulsed radiation (originating from accretion flow or from the surface) when the source luminosity increases. \n\n\nTo examine the evolution of pulsed beam geometry of the source, we folded the energy-resolved light curves in 3–7, 7–15, 15–25, 25–40, and 40–79 keV from the observations (Figure <ref>). Doubled peaked profiles are observed throughout soft to hard X-ray energy ranges during Obs-I. The emission from both poles is clearly apparent at this stage. As the luminosity decreases to a level of ∼3×10^38 ergs s^-1, the pulse profiles below 15 keV (Obs-II and Obs-IV) appear with a hump-like structure that further evolves into a double-peak at higher energies. The Obs-III is at around the Eddington limit of a classical neutron star. At this point, the soft to hard pulse profiles are single-peaked with a hump in the middle. We further studied the energy evolution of the PF from the pulse profiles. Figure <ref> shows positive dependencies between the energy and the PF. An extremely low PF of about 11% is found during Obs-III in the 3–7 keV band. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Spin evolution\n\n\nWe used the barycentric corrected data to investigate the evolution of the temporal properties with the outburst and in particular, the spin evolution.\nTo search for a periodic signal, we followed the same methodology adopted for monitoring of SXP 15.6 <cit.>.\nFirst we adopted the epoch folding Z-search test implemented through HENdrics and Stingray <cit.>.\nThen we refined the temporal solution and its uncertainty based on the ToA of individual pulses by using PINT[<https://github.com/nanograv/pint/>] <cit.>.\nFor some snapshot phases connecting the ToAs was challenging to impossible due to multiple peaks in the periodogram with similar intensity, a problem often encountered in slow pulsars observed with gaps <cit.>.\nThe resulting period measurements are shown in Fig. <ref>, In the same plot, we mark the measurement. We note that observations where a defined period was not obtained are marked as `bad` and no error is given as their uncertainty is similar to the range of the plot. \n\nIn the spin evolution, we see clear signatures of orbital motion, consistent with the 18.38 d period reported in the literature based on data <cit.>, while a similar periodicity is also seen in optical data of the system <cit.>.\nModeling of the archival data has revealed an almost circular orbit with an eccentricity of about 0.07. The sampling of the data was sparse and in similar orbital phases. In contrast, the new data cover a smaller baseline but better sample the orbital cycle near the peak of the outburst. Thus their study could help improve the old orbital solution.\nTo model the orbital evolution, we used a model composed of the orbital signature and the first derivative of the frequency similar to <cit.>. \nMoreover, we followed a Bayesian approach to effectively sample the  whole parameter space of the underline model <cit.>. \nWe applied the same method to the data, and the measurements[Data points were extracted from <cit.>].\nGiven the issues with the period determination at the later stages of the 2022 monitoring, we constrained our fit  within MJD 59750-59790.\nWe find that the 2022 monitoring data yield a somehow eccentric orbit (e=0.27), while the period is better constrained by the  data. Interestingly, if we maintain no priors for the eccentricity the fit to the  data yields a lower eccentricity consistent with the one reported by <cit.>. For comparison, we plotted both solutions to the newly obtained and archival data shown in Figure <ref>.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ The continuum emission during 2022 outburst\n\n\nThe soft X-ray energy spectrum of is studied to understand the emission at different phases of the 2022 outburst. We used observations at multiple epochs of the outburst in this study. Each 0.5–10 keV spectrum can be fitted statistically well with an absorbed cutoff power-law model in XSPEC (). Figure <ref> shows the energy spectra from these observations together. We considered TBabs model at  Wilm abundance <cit.> and Verner cross-section <cit.> to account for the local and interstellar medium absorptions along the source direction in our spectral fit. We found that the equivalent hydrogen column density (N_ H) varies  in the range of (1–3)×10^21 atoms cm^-2 during these observations. To reduce the spectral fitting degeneracy in the soft X-ray band, the column density is fixed at an average value of 1.43×10^21 cm^-2, which is consistent with the value observed with XMM-Newton in 2015 within error bars <cit.>. We then fitted each individual spectrum with an absorbed cutoff power-law model at the above-fixed column density. No signature of iron fluorescence line is detected in the spectra. The 0.5–10 keV unabsorbed flux is estimated using the cflux convolution model. The parameter errors are estimated for the 90% confidence interval in this paper.  \n\nThe evolution of the spectral parameters during the outburst is shown in Figure <ref>. The power-law photon index and cutoff energy are variable across the rise (blue) and decay (red) phases of the outburst. The peak luminosity in the 0.5–10 keV range is found to be 1.3×10^38 ergs s^-1 (for a source distance of 62 kpc) around the outburst peak. To examine the spectral changes and associated spectral transition, the parameters are studied with respect to the 0.5–10 keV unabsorbed luminosity in Figure <ref>. The photon index and cutoff energy follow a positive correlation   (with a Pearson correlation coefficient of 0.61 and 0.66, respectively) with luminosity above 9×10^37 ergs s^-1. The index stays close to a value of 0.35 at luminosity in the range of (6-9)×10^37 ergs s^-1. This could be identified as a critical limit of the pulsar where the spectral shape changes. Below this limit, the source shows a negative correlation (with a Pearson correlation coefficient of –0.57) between luminosity and the photon index.  Similar behavior is observed between luminosity and the cutoff energy (with a Pearson correlation coefficient of –0.54).  \n\n We also fitted each spectrum with two absorption components together with a cutoff power-law model. One of the column densities was fixed at a foreground value 4×10^20 cm^-2 <cit.> at the Solar abundance. Another column density was free in our study at the SMC abundance of 0.2 Solar <cit.> to incorporate the local absorption. The SMC column density changes in the range (0.5–3)×10^21 cm^-2 during the outburst.  All the fitted parameters, such as SMC column density, photon index, and the cutoff energy, however, were found to decrease with luminosity.  A gradual decline may be because of spectral degeneracy among these parameters in the soft X-ray band. This is similar to the findings discussed above in this section. Though we can not totally disentangle the variation of the local absorption during the outburst, therefore, to reduce the degeneracy among the parameters, we fixed the SMC column density to an average value of 1.25×10^21 cm^-2. This resulted in similar kinds of parameter variations as reported in Figures <ref> & <ref>. \n\n\n\n\n\n §.§ Broadband spectroscopy of the pulsar during 2015 and 2022 giant outbursts\n\n\nWe further performed broadband spectroscopy of in the 1–70 keV range to investigate the continuum as well as the nature of the cyclotron absorption line and its evolution. Three sets of XRT and quasi-simultaneous data from the 2015 outburst are used along with the 2022 July and pointed observations (Figure <ref>). These spectra are additionally binned for representation purposes using setplot rebin command of XSPEC. The pulsar spectrum can be described by standard models such as the Fermi-Dirac cutoff power-law, the Negative and Positive power-law with Exponential cutoff (NPEX; ), and the cutoff power-law with a blackbody component (see also ). In our study, we used an absorbed cutoff power-law model with a blackbody component (bbodyrad in XSPEC)  to study all four data sets.  The column density was pegged at a lower limit of 1×10^20 cm^-2 in the fit. A 6.4 keV Gaussian component for an iron fluorescence line is also needed. In addition to the emission, a cyclotron absorption feature appears in the data and is fitted with a Gaussian absorption line. The cyclotron lines are detected at <30 keV and at 31.5 keV in the 2015 and 2022 data sets, respectively (Table <ref>).  We used the Markov chain Monte Carlo (MCMC) model in XSPEC for error estimation on the spectral parameters. The Goodman–Weare algorithm with 20 walkers and a total length of 200000 is considered in our study. The spectral parameters at a 90% confidence interval are presented in Table <ref>. We also show the 68, 90, 95, and 99.7% confidence level contour maps for cyclotron line energy and width for second and fourth observations in Figure <ref>.\n\n\nThe cyclotron line energy, width, and line strength decreased with the luminosity during the 2015 outburst (Figure <ref>). The second and fourth observations (see Table <ref>) are at almost the same luminosity level. However, the cyclotron line parameters, especially the cyclotron line energies, are found to be marginally higher (within 90% level) in 2022 July. The magnetic field of the neutron star can be estimated to be 3.5×10^12 G based on this recent detection. \nMoreover, to study the model-independency of the cyclotron line, we show the parameter evolution using an absorbed NPEX model with a GABS component. The cyclotron parameters are consistent between both models (Figure <ref>).     \n\nFollowing the broadband fit, we found that the 0.5–10 keV luminosity represents about 40% of the total pulsar emission in a 0.5–100 keV band. Therefore, an average bolometric correction of 2.5 can be applied to the outburst emission measured by . This is consistent with the typical estimates where the soft band mostly contributes around 30–40% of the pulsar emission <cit.>.\nThe 2022 outburst of peaked at around MJD 59769.4 with a bolometric corrected luminosity of 3.2×10^38 ergs s^-1. This is close to half of the peak value the pulsar attained in the 2015 outburst.  \n\n Other parameters in Table <ref> such as the blackbody temperature was found to be in a narrow range of (0.85–1.1) keV during both outbursts. We also measured the corresponding emission radius (Radius_ bb) to examine the possible origin and location of thermal emission. The observed Radius_ bb is estimated to be in the range of (14–22) km (see Table <ref>), which is close to the size of a neutron star. This suggests that the thermal component may originate from the neutron star surface or from the accretion column during the 2015 and 2022 outbursts.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ DISCUSSION AND CONCLUSIONS\n\n\nThe broadband emission from the accreting X-ray pulsars is understood to be due to thermal and bulk Comptonizations of seed photons from the hot spots within the accretion column mounted on the magnetic poles of the neutron star <cit.>. The underlying physical phenomena of these sources can be understood by studying the pulse emission geometry and the spectral evolution of the pulsar during X-ray outbursts. At lower luminosities such as 10^34-35 erg s^-1, the accreted material falls freely until it gets halted and settled by Coulomb interactions in a hydrodynamical shock near the surface <cit.>. This leads to a simplistic pulsed emission geometry in the form of a pencil beam where the X-ray photons propagate along the magnetic field lines. At this stage, the radiation is mostly dominated by bulk Comptonization <cit.>. When the accretion rate increases, a radiation-dominated shock is expected to be formed in the accretion column at a critical luminosity that leads to geometrical changes or spectral transition in the emission <cit.>. The infalling material interacts closely with the shock and gets decelerated through it before settling down onto the neutron star. The photons below the shock region diffuse through the column side-wall in the form of a fan beam pattern. The anticipated emission geometry is a mixture of fan and pencil beam patterns at a luminosity of ∼10^36-37 erg s^-1. The thermal as well as bulk Comptonization processes contribute significantly to the observed broadband emission at this stage. In the super-critical luminosity regime (>10^37 erg s^-1), a pure fan beam pattern is expected because of a strong radiative shock that makes the accretion column optically thick for photons propagating along the magnetic field lines.\n\nwas observed with at luminosities above the Eddington limit of a classical neutron star during the 2015 and 2022 outbursts. The pulse profiles are found to be luminosity dependent. At a luminosity of 6.1×10^38 ergs s^-1 (Obs-I), a doubled peaked profile appears throughout soft to hard X-rays suggesting the emission from both the poles of the neutron star as the observed peaks are separated by 0.5 phase in the pulse profile. The emission geometry, however, evolves below this luminosity, where the soft X-ray profiles are mainly broad or contain a hump-like structure. The emission from both poles is clearly apparent in the hard X-rays in the case of Obs-II and IV.  The pulse fraction of the pulsar increases with energy clearly up to 40 keV, indicating an increase in the pulsating photons contributing to  emission at higher luminosities. This suggests the rising height of the accretion column or mound. The profile changes  with luminosity can be understood in terms of evolving emission geometry, where the significant contribution of the fan beam is anticipated  in the super-critical regime.  \n\nWe also detected a spectral transition in during the 2022 outburst with . The photon index shows a positive and negative dependency on luminosity below and above a range of value  in the range of (6–8)×10^37 ergs s^-1 in 0.5–10 keV range. Considering a bolometric correction factor of 2.5, we expect a critical luminosity of (1.5–2)×10^38 ergs s^-1 at which the emission pattern is expected to change. According to <cit.>, the critical luminosity depends on the magnetic field assuming disk accretion onto a classical neutron star with a 1.4mass and a 10 km radius.\n\n\n    L_ crit   =    1.49 × 10^37( B/10^12 G)^16/15 erg s^-1\n\n\nUsing equation <ref>, the magnetic field B can be estimated to be in the range of (8.7–11.4)× 10^12 G for the above range of luminosity values. The estimated magnetic field differs by a factor of 3 to 4 from the measurement based on the detection of a cyclotron line in the spectrum <cit.>. \n In case no bolometric correction is applied, the magnetic field from equation <ref> turns out to be  (3.7–4.8)× 10^12 G i.e., much closer to the estimates based on cyclotron line energy.\n\n\n\n\n §.§ The evolution of cyclotron absorption line and its implication on the magnetic field\n\n\nBoth the 2015 and 2022 X-ray outbursts of lasted for more than 2 months with peak bolometric luminosities of 6×10^38 ergs s^-1 and 3×10^38 ergs s^-1, respectively (see Figure <ref>). We report broadband spectral properties of the pulsar during the latest giant outburst using data from and observations. The 2015 and Swift/XRT observations are also used to study the cyclotron absorption line and its long-term evolution. We found relatively higher cyclotron line energy (with an increase of 3.4 keV) during the current outburst in comparison to the 2015 measurement made around a similar luminosity. In addition, the line energy is anti-correlated with luminosity in the 2015 outburst. The cyclotron line is a unique absorption-like feature that is observed in the 10-100 keV spectrum of X-ray pulsars <cit.>. They appear due to a resonance scattering of photons with electrons in quantized Landau energy states in the presence of a strong magnetic field. The field strength can be estimated directly using a 12-B-12 rule depending on the line energy since it is expressed as E_cyc=11.6B_12×(1+z)^-1 keV, where  B_12 is the magnetic field in 10^12 G unit, and z is the gravitational red-shift. \n\nThe centroid energy of the cyclotron line in principle measures the field strength at the line-forming region. A change in line energy with luminosity is observed in several accretion-powered X-ray pulsars during outbursts <cit.>. In some cases like Her X-1 <cit.>, the cyclotron energy and luminosity are positively correlated, whereas there are pulsars such as 4U 0115+63 <cit.> and V 0332+53 <cit.> that show a negative correlation between these parameters <cit.>. The positive correlation is expected in the sub-critical region (below the critical luminosity) when the pressure of the accreting plasma pushes the hydrodynamical shock or line-forming region closer to the neutron star surface with an increasing accretion rate (luminosity). On the other hand, a formation of radiation-dominated shock is expected in the accretion column at higher accretion rates. The shock drifts upwards in the column due to strong radiation pressure with increasing mass accretion rate in the super-critical regime <cit.>. Therefore, a negative correlation between the cyclotron line energy and luminosity is expected at this phase. This is observed in SMC X-2 when the pulsar was accreting in the super-critical regime during the 2015 outburst. Alternatively, the formation of a cyclotron line and its observed negative correlation can be understood by the reflection of accretion column photons onto the neutron star surface <cit.>. The hypothesis suggests that the cyclotron line gets formed on the surface rather than in the accretion column where the gradient is high to explain the observed changes in the line energy. As the accretion rate increases, a larger accretion column covers a substantial portion of the atmosphere from the pole to the equator (high to low magnetic field regions). This can also explain the origin of the observed negative correlation between the cyclotron energy and luminosity in SMC X-2 resulted due to a change in illumination pattern. \n\n\nIt is important to note that the  cyclotron line energy of is different at a given luminosity observed at Obs-II and Obs-IV during different outbursts. The /GSC light curves in Figure <ref> show a clear rise in the source intensity after MJD 57259 and 59738 during the 2015 and 2022 outbursts, respectively. The source reached a luminosity of (2–3)×10^38 ergs s^-1 (Obs-II and IV) after 49 and 36 days since the onset of respective outbursts. Our measurements suggest an increase of 3.4 keV in the cyclotron line energy between these data sets at comparable luminosities. This difference in the cyclotron line energy corresponds to a change in the magnetic field of 3.8×10^11 G, assuming a classical neutron star and gravitational redshift of 0.3. Such an enhancement in the cyclotron energy can be understood by an accretion-induced screening of the magnetic field or geometrical changes in the line-forming region. Theoretical studies suggest that the accretion flow distribution from poles to lower latitudes may drag the field lines ( and references therein). This mechanism could effectively lower down the original field strength even on a shorter time scale in the top layer of the distributed material, considering no effect of magnetic buoyancy. However, in reality, the screening mechanism depends on the ratio of timescales for field burial by the advection mechanism and the re-emerging of the field through magnetic buoyancy and Ohmic rediffusion <cit.>. An increase of 3.4 keV in cyclotron line energy in the latest modest outburst suggests that the screening mechanism is not effective as it is in the case of the 2015 giant outburst, where a similar luminosity is achieved in the decay phase almost 49 days after the onset. The neutron star by this point would accumulate a factor of two or more mass with an integrated value of 3.5×10^24 g in 2015. \n\nA similar possibility is discussed for V 0332+53 during its 2004/05 outburst where the cyclotron line energy at a given luminosity in the decay  got reduced by ≈1.5 keV with respect to the rising phase of the outburst <cit.>. However,  <cit.> argued that the expected time scales for field burring/reemerging are significantly shorter than those observed in the case of Vela X-1 and Her X-1. They also noticed discrepancies between the spin rates in rising and declining parts of the outburst that could explain the difference in the magnetic field based on the accretion-torque theory. In addition, they suggested that the change in the accretion disk and effective magnetospheric radius in different phases of the outburst lead to a variable column height, resulting in an evolving cyclotron line through X-ray reflection on the surface <cit.>. In the case of , however, we observe the increase in cyclotron line energy in the decay phase of two outbursts at a comparable luminosity. This is important to recall that the pulse profile observed during Obs-II and IV appears identical, suggesting similar accretion geometry of the pulsar. The accretion-induced screening mechanism, thus, seems a possible explanation for the observed behavior over the geometrical change in the line-forming region.\n\n \n\nThe long term evolution of the cyclotron line is well studied for two sources, Her X-1 and Vela X-1 <cit.>. The cyclotron centroid energy of Her X-1 has shown a secular decay of ≈5 keV in 20 years before stabilizing between 2012 and 2019. There was also a period in 1993-1996 when the line energy was increased by a few keV. The time evolution of the cyclotron line energy is still a matter of study. It is believed that the observed decay/increase in line energy represents a geometrical change within the emission region or in the configuration of the local magnetic field rather than a change in the global dipolar magnetic field of the neutron star <cit.>. This could be further understood in terms of a marginal imbalance between the accretion rate and the losing or settling rate of the accreted material on the accretion mound. If the settling rate is slightly higher than the leakage of the material from the bottom of the mound, this may lead to an increase in the column height as well as a change in the local magnetic field configuration of the line forming region. A line decay is expected naturally in this case. Over time, the excessive accumulation of the material and its pressure on the mound may result in a forced redistribution of the material across the surface. This would adjust the accretion mount to its unperturbed configuration where higher line energy would be expected. The time scale for such redistribution is unclear. But, it may happen after continuous accumulation of matter over a long period or (multiple) strong outbursts like those observed in 2002 and 2015 of . Future observations of the source during outbursts will allow understanding the behavior of the cyclotron line better. \n\n\n \n\n\n\n\n §.§ ACKNOWLEDGMENTS\n\nWe thank the referee for constructive suggestions on the paper.\nThis research has made use of data obtained through \nHEASARC Online Service, provided by the NASA/GSFC, in support of NASA \nHigh Energy Astrophysics Programs. This work used the NuSTAR Data Analysis \nSoftware (NuSTARDAS) jointly developed by the ASI\nScience Data Center (ASDC, Italy) and the California Institute of Technology (USA).\nSG acknowledges the support of the CNES. GV acknowledges support by \nH.F.R.I. through the project ASTRAPE (Project ID 7802).\n\n\n\n\n§ DATA AVAILABILITY\n\nWe used archival data of NICER, NuSTAR, Swift, and MAXI observatories for this work. \n\nmnras\n\n\n\n\n\n\n\n"}