{"entry_id": "http://arxiv.org/abs/2303.07222v1", "published": "20230313155731", "title": "Reconciling rough volatility with jumps", "authors": ["Eduardo Abi Jaber", "Nathan De Carvalho"], "primary_category": "q-fin.MF", "categories": ["q-fin.MF", "q-fin.CP"], "text": "\n\nEfficient Semantic Segmentation by Altering Resolutions for Compressed Videos\n    Yubin Hu1  \n    Yuze He1  \n    Yanghao Li1  \n    Jisheng Li1  \n    Yuxing Han2  \n    Jiangtao Wen3  \n    Yong-Jin Liu1Corresponding author.\n\n    1Department of Computer Science and Technology, Tsinghua University \n\n    2Shenzhen International Graduate School, Tsinghua University  \n\n    3Eastern Institute for Advanced Study\n\n    {huyb20, hyz22, liyangha18}@mails.tsinghua.edu.cn, jas0n1ee@icloud.com, \n\n    yuxinghan@sz.tsinghua.edu.cn, jtwen@eias.ac.cn, liuyongjin@tsinghua.edu.cn\n\n    March 30, 2023\n=======================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\nWe reconcile rough volatility models and jump models using a class of reversionary Heston models with fast mean reversions and large vol-of-vols.\nStarting from hyper-rough Heston models with a Hurst index H∈(-1/2,1/2), we derive a Markovian approximating class of one dimensional  reversionary Heston-type models. Such proxies encode a trade-off between an exploding vol-of-vol and a fast mean-reversion speed controlled by a reversionary time-scale ϵ>0 and an unconstrained parameter H ∈ℝ. Sending  ϵ to 0 yields convergence  of the reversionary Heston model towards different explicit asymptotic regimes based on the value of the parameter H. In particular, for H ≤ -1/2, the reversionary Heston model converges to a class of  Lévy jump processes of Normal Inverse Gaussian type.  Numerical illustrations  show that the reversionary Heston model is capable of generating at-the-money skews similar to the  ones generated by rough, hyper-rough and jump models.\n \n\n\n\n  Mathematics Subject Classification (2010): 91G20, 60G22, 60G51 \n\n  JEL Classification: G13, C63, G10.   \n    \n  Keywords:  Stochastic volatility, Heston model, Normal Inverse Gaussian, rough Heston model,  Ricatti equations\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nSince the 1987 financial crash, financial option markets have exhibited a notable implied volatility skew, especially for short-term maturities. This skew reflects the market's expectation of significant price movements on very short time scales in the underlying asset, which poses a challenge to traditional continuous models based on standard Brownian motion. To address this issue, the literature has developed several classes of models that capture the skewness in implied volatilities. Three prominent approaches  are:\n\n\n\n\n\n\n    \n  * conventional  one-factor stochastic volatility models boosted with large mean-reversion and vol-of-vol. This class of models have been  justified by  several empirical studies that have identified the presence of very fast mean-reversion in the S&P volatility time series <cit.> and by the fact that they are able to correct conventional models  to reproduce the behavior of the at-the-money (ATM) skew for short maturities  <cit.>;\n    \n    \n  * jump diffusion models, especially the class of affine jump-diffusions for which valuation problems become (semi-)explicit using Fourier inversion techniques, see <cit.>. Such class of models incorporates  occasional and large  jumps to explain the   skew  observed implicitly on option markets, see <cit.>, and <cit.> for an empirical analysis of the impact of adding jumps to stochastic volatility diffusion on the implied volatility surface;\n    \n    \n  * rough volatility models, where the volatility process is driven by variants of the Riemann-Liouville fractional Brownian motion\n    \n    W_t^H = 1/Γ( H+1/2 )∫_0^t ( t-s)^H-1/2dW_s,    t ≥ 0,\n\n    with W  a standard Brownian motion and H ∈(0,1/2)  the Hurst index. Such models are  able to reproduce  the roughness of the spot variance's trajectories measured empirically <cit.> together with  the explosive behavior of the ATM-skew <cit.>.\n\n\n\nSo far, in the mathematical finance community, jump diffusion models and rough volatility models have  often been treated as distinct approaches, and, in some cases, they have even been opposed to each other, see for instance  <cit.>. However, on the one side,  connections between rough volatility models and fast mean-reverting factors have  been established in <cit.>. On the other side, jump models have been related to fast regimes stochastic volatility models in <cit.>. In parallel, from the empirical point of view,  it can be very challenging for the human eye and for statistical estimators to distinguish between roughness, fast mean-reversions and jump-like behavior, as shown in <cit.>. \n\n\n\nThe above suggests that rough volatility and jump models may not be that different after all. Our main motivation is to establish for the fist time in the literature  a connection between rough volatility and jump models through conventional volatility models with fast mean-reverting regimes. \n\n \n We aim to reconcile these two classes of models through the use of the celebrated conventional Heston model <cit.> but with a parametric specification which encodes a trade-off between a fast mean-reversion and a large vol-of-vol.  We define the  reversionary Heston model  as follows:\n    \n    dS_t^ϵ = S_t^ϵ√(V_t^ϵ)( ρ dW_t + √(1-ρ^2) dW_t^⊥),    S_0^ϵ=S_0,\n        dV^ϵ_t =  ( ϵ^H- 1/2θ - ϵ^-1( V_t^ϵ-V_0 ) ) dt + ϵ^H-1/2ξ√(V_t^ϵ)dW_t,    V^ϵ_0=V_0,\n\n    where ( W, W^⊥) is a two-dimensional Brownian motion, θ≥ 0, S_0, ξ, V_0 >0, ρ∈ [-1,1]. The two crucial parameters here are the reversionary time-scale ϵ>0 and H ∈ℝ. Such parametrizations nest as special cases the fast regimes extensively studied by <cit.>, see also <cit.>, which correspond to the case H=0; \n    and also the regimes studied in <cit.> for the case H = -1/2. Letting the parameter H∈(∞, 1/2] free in (<ref>)  introduces more flexibility in practice    and leads to better fits with stable calibrated parameters across time as recently shown in <cit.>. In theory, it allows for a better understanding of the impact of the scaling in H on the limiting behavior of the model as ϵ→ 0  as highlighted in this paper.\n    \n\n\nIn a nutshell, we show that:\n\n\n    \n  * for H>-1/2, the reversionary Heston model  can be constructed as a proxy of rough and hyper-rough Heston models  where H ∈ (-1/2,1/2] plays the role of the Hurst index,\n    \n  * for H≤ -1/2, as ϵ→ 0,\n    the reversionary Heston model  converges towards Lévy jump processes of Normal Inverse Gaussian type with distinct regimes for H=-1/2 and H<-1/2 respectively,  \n    \n  * the reversionary Heston model is capable of generating implied volatility surfaces and  at-the-money (ATM) skews similar to the ones generated by rough, hyper-rough and jump models, and comes arbitrarily close to the ATM skew scaling as τ^-0.5 for small τ that characterizes the market, contrary to widespread understanding. \n\n\nOur results allow for a  reconciliation between rough and jump models as they  suggest that jump models and (hyper-)rough volatility models are complementary, and do not overlap. For H>-1/2, the reversionary Heston model can be interpreted as a proxy of rough and hyper-rough volatility models, while for H≤ -1/2, it can be interpreted as a proxy of jump models. Jump models actually start at H=-1/2 (and below), the first value for which hyper-rough volatility models can no-longer be defined. \n\n\nMore precisely,  our argument is structured as follows.\nFirst, in Section <ref>, we show how the reversionary Heston model (<ref>)-(<ref>) can be obtained as a Markovian and semimartingale proxy of rough and hyper-rough Heston models <cit.> with Hurst index H ∈ (-1/2,1/2). This is achieved using the resolvent of the first kind of  the shifted fractional kernel. \n\nSecond, in Section <ref>, we derive the joint conditional characteristic functional of the log-price log S^ϵ and the integrated variance V̅^ϵ := ∫_0^· V^ϵ_s ds in the model  (<ref>)–(<ref>) in terms of a solution to a system of time-dependent Riccati ordinary differential equations; see Theorem <ref>. Compared to the literature, we  provide a  novel and  concise proof for the existence and uniqueness of a global solution to such Riccati equations using the variation of constant formulas.\n\nFinally, in Section <ref>, we establish the convergence of the log-price and the integrated variance (log S^ϵ,V̅^ϵ) in  the reversionary Heston model (<ref>)-(<ref>) towards a Lévy jump process (X,Y), as ϵ goes to 0. More precisely, we show that the limit (X, Y) belongs to the class of Normal Inverse Gaussian - Inverse Gaussian (NIG-IG) processes which we construct from its Lévy exponent and we connect such class to first hitting-time representations in the same spirit of <cit.>. Our main \nTheorem <ref> provides the convergence of the finite-dimensional distributions of the joint process (log S^ϵ, V̅^ϵ)  through the  study of the limiting behavior  of the Riccati equations and hence the  characteristic functional given in Theorem <ref>. Interestingly, the limiting behavior disentangles three different asymptotic regimes based on the values of H. The convergence of the integrated variance process  is even strengthened  to a functional weak convergence on the Skorokhod space   of càdlàg paths on [0,T] endowed with the M_1 topology. We stress that the usual J_1 topology is not useful here, since jump processes cannot be obtained as limits of continuous processes in the J_1 topology. \n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelated Literature. \n Convergence of the reversionary Heston models towards jump processes: our results clarify and extend the results of <cit.>, derived for the case H=-1/2, that establish and make clear the precise limiting connection between the Heston log-price process and the normal inverse-Gaussian (NIG) process of <cit.>. Connections between the long time behavior of the Heston log-price process and NIG distribution were first exposed  in <cit.> and were the main motivations behind the work of <cit.>.\n\nRelevance of fast regimes in practice: the pricing of options near maturity is challenging because of the very steep slope of smiles observed on the market and <cit.> showed that stochastic volatility should embed both a fast regime Ornstein-Uhlenbeck factor (see Remark <ref> below) from which approximations of option prices can be derived using a singular perturbation expansion, and a slowly varying factor to be able to match options with long maturities. On the other hand, <cit.> considers a Heston model with a fast mean-reverting volatility and uses large deviation theory techniques to derive an approximation price for out-of-the-money vanilla options when the maturity is small, but large compared to the characteristic time-scale of the stochastic volatility factor. More recently an Ornstein-Uhlenbeck process with the same parametrization as in (<ref>) has been used to construct  the Quintic stochastic volatility model <cit.> to achieve remarkable joint fits of SPX and VIX implied volatilities, outperforming its rough and path-dependent counterparts as shown empirically in <cit.>.\n\n\n\nNotations. For p≥ 1, we denote by L^p_loc the space of measurable functions f:_+→ such that ∫_0^T |f(s)|^p ds<∞, for all T>0. We will denote by √(x) the principal square root of x ∈ℂ, i.e. its argument lies within (-π/2,π/2]. \n\n\n\n§ FROM ROUGH HESTON TO REVERSIONARY HESTON\n \n\n\nIn this section, we show how reversionary Heston models (<ref>)-(<ref>) can be seen as proxies of rough and hyper-rough Heston models whenever H>-1/2. \n\n\n\n §.§ Rough and hyper-rough Heston\n\nLet ( W, W^⊥) be a two-dimensional Brownian motion and set  B := ρ W + √(1-ρ^2) W^⊥ with ρ∈[ -1, 1 ].  We take as starting point a stochastic volatility model for an underlying asset P in terms of a time-changed Brownian motion:\n\n    dP_t = P_t dB_U̅_t,     P_0>0,\n\n for some non-decreasing continuous process U̅. If U̅_t = ∫_0^t U_s ds, then U would correspond to the spot variance and U̅ plays the role of the integrated variance. The hyper-rough Volterra Heston model introduced in <cit.>  and studied further in <cit.> assumes that the dynamics of the integrated variance is of the form\n\n    U̅_t = G̅_0(t) + ξ∫_0^t K_H(t-s)  W_U̅_s ds,\n\nfor a suitable continuous function G̅_0, and ξ > 0, and K_H is the fractional kernel\n\n    K_H(t)  =  t^H-1/2,    t >0,\n\n for H ∈ (-1/2,1/2]. The lower bound H>-1/2 ensures the L^1_loc integrability of the kernel K_H so that the stochastic convolution appearing in (<ref>) is well-defined.\n\n\nAny kernel K only in L^1_loc can be considered for the specification of the integrated variance in (<ref>), and if furthermore the kernel happens to be in L^2_loc, the following lemma ensures the existence of a spot variance process.\n\n\n    Let K ∈ L^2_loc and g_0 ∈ L^1_loc. Assume there exists a non-decreasing adapted process U̅ and a Brownian motion W such that\n    \n    U̅_t  = ∫_0^t g_0(s)ds + ∫_0^t K(t-s) W_U̅_s ds,\n\n    with sup_t≤ T𝔼[ | U̅_t | ] < ∞, for all T>0. Then, U̅_t = ∫_0^t U_s ds, where U is a non-negative weak solution to the following stochastic Volterra equation\n    \n    U_t = g_0(t) + ∫_0^t K(t-s) √(U_s)dW_s,    ℚ⊗ dt-a.e.\n\n    Conversely, assume there exists a non-negative weak solution U to the stochastic Volterra equation (<ref>) such that sup_t≤ T𝔼[ U^2_t ] < ∞, for all T>0, then U̅ solves (<ref>).\n\n\n\n   This is obtained by an application of stochastic Fubini's theorem, see <cit.>.\n\n\nGoing back to the fractional case, if we restrict H  in ( 0, 1/2 ], then we have K_H ∈ L^2_loc. For G̅_0(t) := ∫_0^t g_0(s) ds, a direct application of Lemma <ref> yields that the model (<ref>)-(<ref>) is  equivalent to the rough Heston model of <cit.> written in spot-variance form\n\n    dP_t = P_t√(U_t)dB_t, \n        U_t = g_0(t) + ∫_0^t K_H(t-s) ξ√(U_s) dW_s,\n\nfor some initial input curve g_0: ℝ_+ →ℝ ensuring the non-negativity of V. Two notable specifications of such admissible input curves  are given by <cit.> and read \n\n    g_0  continuous and non-decreasing with  g_0 ≥ 0,\n    or\n    \n         g_0(t) = U_0 + θ∫_0^t K_H(s)ds,  for some  U_0, θ≥ 0.\n\n  \n\nMoreover, for H∈ (0,1/2] the sample paths of the spot variance U are locally Hölder continuous of any order strictly less than H, and consequently rougher than those of the standard Brownian motion, which corresponds to the  case H=1/2, justifying the denomination  `rough model'.   The hyper-rough appellation corresponds to the case H∈ (-1/2,0] for which the process U̅ is continuous but no longer absolutely continuous. Indeed, in this case, one can show that the trajectories of U are nowhere differentiable, see <cit.>.\n\n\nA key advantage of rough and hyper-rough Heston models is the semi-explicit knowledge  of the characteristic function of the log-price modulo a deterministic Riccati Volterra convolution equation, as they belong the class of Affine Volterra processes <cit.>. More precisely,   \nfor any u=(u_1,u_2) ∈ℂ^2  satisfying  \n    (u_1)=0,  (u_2) ≤ 0,\n \n\tthe joint Fourier–Laplace transform of (log P, U̅)  is given by\n\t\n    𝔼[ exp( u_1log P_T + u_2 U̅_T  ) ] = exp(  u_1 log P_0 +   ∫_0^T  R(ψ_H(T-s))dG̅_0(s) ),\n\n\tfor all T ≥ 0, where ψ_H is the continuous solution to the following fractional Riccati–Volterra equation\n\n    ψ_H(t)   =∫_0^t K_H(t-s)  R(ψ_H(s))ds,    t ≥ 0, \n    \n    \tR(x)   =1/2 (u_1^2 -u_1) +u_2 +  ρν  u_1 x + ν^2/2 x^2,\n\nsee <cit.>.\nThis allows fast pricing and calibration via Fourier inversion techniques. Compared to the conventional Heston model where the characteristic function is known explicitly, the solution to the Riccati Volterra equation is not explicitly known. \n\n\n\n §.§ Deriving  reversionary Heston as a proxy: ϵ-shifting  the singularity\n\nIn both regimes,  rough and hyper-rough, with the exception of H=1/2, the model is non-Markovian, non-semimartingale with singular kernels. From a practitioner standpoint, it  is therefore natural to look  for  Markovian approximations by suitable smoothing  of the singularity of the fractional kernel (<ref>) sitting at the origin.\nIn this section, we show how we can build a Markovian semi-martingale proxy of hyper-rough models. This is achieved using a two-step procedure. \n\n\nFirst step: recover semimartingality by smoothing out the singularity of the fractional kernel K_H. \nWe fix ϵ>0, and  we  consider the shifted fractional kernel \n\n    K_H, ϵ(t) := ( t+ ϵ)^H-1/2,    t> 0,\n\nand the corresponding `integrated variance' U̅^ϵ given by \n\n    U̅^ϵ_t = ∫_0^t g_0^ϵ(s) ds + ξ∫_0^t K_H, ϵ(t-s)  W_U̅^ϵ_s ds,\n\nwith   \n\n    g_0^ϵ(t) = U_0 + θ∫_0^t K_H,ϵ(s)ds.\n\nNote that now K_H, ϵ is in L^2_loc for any value of H, so that an application of Lemma <ref> yields that U̅^ϵ = ∫_0^· U^ϵ_s ds where the spot variance U^ϵ solves the equation \n\n    dP^ϵ_t    = P^ϵ_t √(U^ϵ_t)dB_t \n    \n         U^ϵ_t    = U_0 + ∫_0^t K_H,ϵ(t-s) θ ds  + ∫_0^t K_H,ϵ(t-s) ξ√(U^ϵ_s) dW_s.\n\nMoreover, since K_H,ϵ is continuously differentiable on [0,T], denoting by K'_H,ϵ its derivative, we get that U^ϵ is a semimartingale with the following dynamics \n\n    dU_t^ϵ =   (K_H,ϵ (0)θ + ∫_0^t K'_H,ϵ(t-s) dZ_s^ϵ)dt + K_H,ϵ (0) ξ√(U_t^ϵ) dW_t,\n\nwith\n\n    dZ^ϵ_t  = θ dt + ξ√(U_t^ϵ) dW_t.\n\n\n\nSecond step: recover a Markovian proxy thanks to the resolvent of the first kind.  The only non-Markovian term in (<ref>) is the term ∫_0^t K'_H,ϵ(t-s) dZ_s^ϵ appearing in the drift. Using the resolvent of the first kind of K_H,ϵ we will re-express this term in terms of a functional of the past of the process U^ϵ.  For a kernel K, a resolvent of the first kind is a  measure L on _+ of locally bounded variation such that\n\n    ∫_[0,t] K(t-s)L(ds) = 1,    t≥ 0,\n\nsee <cit.>.  A resolvent of the first kind does not always exist.  We will make use of the notations (f*g)(t)=∫_0^tf(t-s)g(s)ds and (f*L)(t)=∫_[0,t]f(t-s)L(ds). \n\n\n\n\n    Fix ϵ>0 and H ∈ (-1/2,1/2). The kernel K_H, ϵ admits a resolvent of the first kind L_ϵ  of the form\n\n    L_ϵ (dt)= δ_0 (dt)/K_H,ϵ(0) + ℓ_ϵ(t)dt,\n\nwith ℓ_ϵ a locally integrable function.\nMoreover,  the function ( K_H, ϵ' * L_ϵ) is continuously differentiable and it holds, for all t≥ 0, that\n\n    ∫_0^t K'_H,ϵ(t-s) dZ_s^ϵ  =  - ( 1/2-H ) ϵ^-1( U_t^ϵ-U_0)  + ∫_0^t ( K_H, ϵ' * L_ϵ)'(t-s)   ( U_s^ϵ - U_0) ds.\n\n\n\n\nFirst, the existence of the resolvent is justified as follows. Given H ∈ (-1/2,1/2), K_H, ϵ is a positive completely monotone kernel[Recall that a function f is completely monotone if it is infinitely differentiable on (0,∞) such that (-1)^n f^(n)≥ 0, for all n ≥ 0.] on [0,T] so that an  application of <cit.> yields the existence of a resolvent of the first kind in the form (<ref>) with ℓ_ϵ a completely monotone function. Convolving (<ref>) with K'_H,ϵ one obtains that \n\n    (K'_H,ϵ * L_ϵ)(t)  = K'_H,ϵ(0)/K_H,ϵ(0) +  (K'_H,ϵ * ℓ_ϵ)(t).\n\nSince K_H,ϵ is twice continuously differentiable on [0,T] and ℓ_ϵ is integrable, it follows that (K'_H,ϵ * ℓ_ϵ) is continuously differentiable and so is (K'_H,ϵ * L_ϵ). Writing \n\n    ( K_H, ϵ' * L_ϵ) = ( K_H, ϵ' * L_ϵ)(0)+ 1 * ( K_H, ϵ' * L_ϵ)',\n\nconvolving  on the left hand side by  by K_H, ϵ combined with the associativity of the convolution operation and the fact that (L_ϵ*K_H, ϵ)=1 yields:\n\n    K_H, ϵ' * 1 = K_H, ϵ' *( L_ϵ*K_H, ϵ) = (K_H, ϵ' * L_ϵ)*K_H, ϵ = ( K_H, ϵ' * L_ϵ)(0) (1*K_H, ϵ) + 1 * ( K_H, ϵ' * L_ϵ)'*K_H, ϵ.\n\nAnd thus, we obtain almost everywhere with regards to the Lebesgue measure that:\n\n    K_H, ϵ' = ( K_H, ϵ' * L_ϵ)(0) K_H, ϵ + (K_H, ϵ' * L_ϵ)' * K_H, ϵ.\n\nIn addition, using (<ref>), we notice that\n\n    ( K_H, ϵ' * L_ϵ)(0)= K_H, ϵ'(0)/K_H, ϵ(0) = ( H-1/2) ϵ^-1.\n\nCombining the above, we obtain that \n\n    ∫_0^t K'_H,ϵ(t-s) dZ_s^ϵ  =  ( H-1/2) ϵ^-1∫_0^t K_H,ϵ(t-s) dZ_s^ϵ    + ((K_H, ϵ' * L_ϵ)' * (K_H, ϵ*dZ_t^ϵ))_t,\n\nwhich yields (<ref>), after recalling that U^ϵ - U_0 = ∫_0^· K_H,ϵ(·-s) dZ_s^ϵ.\n\n\nWith the help of the resolvent of the first kind, we were able to recover in the first term of (<ref>), the first order mean-reversion scale  of the fractional kernel, the second term depends on the whole past trajectory of U^ϵ.\n\nWe can now derive our Markovian proxy of the hyper-rough Heston model as follows: plugging the expression (<ref>) in the drift of (<ref>), recalling that K_H,ϵ(0)=ϵ^H-1/2 and dropping the non-Markovian term ( ( K_H, ϵ' * L_ϵ)' )_. * ( U^ϵ_· - U_0^ϵ) )_t, we arrive to the Markovian process:\n\n    d Ṽ_t^ϵ = (  ϵ^H-1/2θ  -  ( 1/2-H ) ϵ^-1( Ṽ_t^ϵ - U_0) ) ) dt + ϵ^H-1/2ξ√(Ṽ_t^ϵ) dW_t,   Ṽ_0 = U_0.\n\n\nFinally, re-scaling the mean-reversion speed from ( 1/2-H ) ϵ^-1 to ϵ^-1 leads to our reversionary Heston model  (<ref>)–(<ref>) where the parameter H becomes unconstrained.  In the following section, we illustrate numerically  the fact that such reversionary Heston model can be seen as a proxy of rough and hyper-rough Heston models. \n\n\n    Such proxy approximation can directly be applied to the Riemann-Liouville fractional Brownian motion defined in (<ref>) to get the proxy:\n    \n    W_t^H,ϵ = ϵ^H-1/2∫_0^t e^- ( 1/2-H ) ϵ^-1 (t-s) dW_s,\n\n    which is a mean-reverting Ornstein-Uhlenbeck process as long as H<1/2, while the value H=1/2 yields back the standard Brownian motion.\n First, such Ornstein-Uhlenbeck process has been recently used to construct  the Quintic stochastic volatility model <cit.> to achieve remarkable joint fits of SPX and VIX implied volatilies, outperforming even its rough and path-dependent counterparts as shown empirically in <cit.>. \n\n    Furthermore, notice that the case H=0 degenerates into the fast scale volatility factor from <cit.>, with m=0, ν=1 and their time-scale is twice the reversionary time-scale ϵ, and whose auto-correlation under the invariant distribution is given by\n    \n    𝔼[ W_t^0,ϵ W_s^0,ϵ] = e^-|t-s|/2ϵ.\n\n    Consequently, the reversionary time-scale ϵ sets the speed of decay of the auto-correlation function of W^H,ϵ.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Numerical illustration\n\n\nWe now illustrate numerically that the reversionary Heston model  (<ref>)–(<ref>) is able to reproduce  shapes of   implied volatility surfaces and at-the-money skew that are similar to the ones generated by rough and hyper-rough Heston models.\n\n\nFor this, we first generate implied volatility surfaces of the hyper-rough and rough Heston model via the Fourier-Cosine series expansion technique from <cit.>, where we used the fractional Adams scheme described in <cit.> on the fractional Riccati equation (<ref>) to compute the characteristic function of the (hyper-)rough Heston models. Three target smiles are generated with a (hyper-)rough Heston having parameters\n\n    ρ=-0.7,   θ=0.02,   ξ=0.3,    U_0=0.02,\n\nfor H ∈{ 0.1, 0, -0.05 }.\n\nFor each of these smiles, we  calibrate the parameters ( ϵ̂, Ĥ) of the reversionary Heston model (<ref>)-(<ref>),  while fixing the other parameters equal to those of the hyper-rough Heston's, by minimizing a weighted  loss\n\n    ∑_i,j w_i,j( C_rough Heston(T_i,K_j)-C^ϵ̂, Ĥ_reversionary Heston(T_i,K_j) )^2.\n\nThe reversionary Heston prices are also obtained by Fourier-Cosine expansion of the characteristic function. In contrast to the rough Heston models, the characteristic function is known explicitly, see Corollary <ref> below.  \nAfter calibration, we obtain the following parameters\n\n\nThe resulting At-The-Money (ATM) skews between 1 week and 1 year are shown on Figure <ref>. The implied volatility surfaces for the case H=0.1 is illustrated on Figure <ref>. The fit of the smiles for H=0 and H=-0.05 are deferred to Appendix <ref>, see Figures <ref> and <ref>. The graphs show that the reversionary Heston model seems to be able to generate similar shapes of the implied volatility surfaces of rough and hyper-rough models and very steep skews even in the hyper rough regimes H≤ 0. \n\n\n\n\n\n\n\n\n\n\n§ THE JOINT CHARACTERISTIC FUNCTIONAL OF REVERSIONARY HESTON\n\nThe following theorem provides the joint conditional characteristic functional of the log-price log S^ϵ and the integrated variance V̅^ϵ := ∫_0^· V^ϵ_s ds in the model  (<ref>)–(<ref>) in terms of a solution to a system of time-dependent Riccati ordinary differential equations. \n\n\n     Let f,g: [0,T]→ℂ be measurable and bounded functions  such that\n\n    g + 1/2(( f)^2 - f)  ≤ 0.\n\nThen, the joint conditional characteristic functional of (log S^ϵ, V̅^ϵ) is given by \n\n    𝔼[ . exp(∫_t^T f(T-s) dlog S^ϵ_s + ∫_t^T g(T-s) d V̅_s^ϵ) | ℱ_t ] = exp(ϕ_ϵ( T-t ) + ϵ^1/2-Hψ_ϵ( T-t ) V^ϵ_t ),    t ≤ T,\n\nwhere (ϕ_ϵ, ψ_ϵ) is the solution to the following system of time-dependent Riccati equations \n\n    ϕ_ϵ'(t)     = ( θ + ϵ^-H-1/2 V_0 ) ψ_ϵ(t),   ϕ_ϵ(0) = 0, \n     \n    ψ_ϵ'(t)     =  ϵ^H-1/2ξ^2/2ψ_ϵ ^2(t) +  ( ρξϵ^H - 1/2 f(t) - ϵ^-1) ψ_ϵ(t) \n                + ϵ^H - 1/2( g(t) + f^2(t)-f(t)/2),     ψ_ϵ(0) = 0.\n\n\n\n\n    The proof is given in Section <ref> below.\n\nBefore proving the result, we note that in the case f and g are constant, one recovers the usual formula for the characteristic function of the <cit.>  model, where the solution (ϕ_ϵ, ψ_ε) of (<ref>)-(<ref>) is explicit as stated in the following corollary. \n\n\n\n Let u,v ∈ℝ and set \nf(t) =i u and g(t)=i v, for all t∈  [0,T]. Then, the solution (ϕ_ϵ,ψ_ϵ)  to the Riccati equations (<ref>)-(<ref>) is explicitly given by \n\n    ϕ_ϵ(t)    = ( ϵ^-1/2-Hθ + ϵ^-1-2H V_0) ξ^-2( ( 1 - i ρϵ^H+1/2ξ u - d ) t - 2 ϵln( 1 - ge^- ϵ^-1 td/1-g) ), \n    ψ_ϵ(t)    = ϵ^-H-1/2ξ^-2( 1 - i ρϵ^H+1/2ξ u - d ) 1 - e^- ϵ^-1 td /1 - ge^- ϵ^-1 td  ,\n\nwith\n\n    g     := 1 - i ρϵ^H+1/2ξ u - d/1 - i ρϵ^H+1/2ξ u + d,    \n        d  := √(( 1 - i ρϵ^H+1/2ξ u )^2 - 2 ( ϵ^H+1/2ξ)^2 ( i v - u^2 + iu/2)),    d > 0.\n\n Consequently, the conditional joint characteristic function  of (log S_T^ϵ, ∫_t^T V^ϵ_s ds ) is given by \n\n    𝔼[ . exp( iu logS^ϵ_T + iv∫_t^T   V_s^ϵ ds) | ℱ_t ] = exp(iulog S^ϵ_t +ϕ_ϵ( T-t ) + ϵ^1/2-Hψ_ϵ( T-t ) V^ϵ_t ),    t ≤ T.\n\n\n\n\n    For the explicit derivation of the formulas, see for example  <cit.>. An application of Theorem <ref> yields the result.\n\n\n\nSuch formulas for ϕ_ϵ avoid branching issues as described in <cit.>.\n\n\nThe rest of the section if dedicated to the proof of Theorem <ref>. We first study the existence of a solution to time-dependent Riccati ODEs for which equation (<ref>) is a particular case, and provide some of their properties in Section <ref>. We complete the proof of Theorem <ref> in Section <ref>. \n\n\n\n §.§ Time-dependent Riccati ODEs: existence and uniqueness\n\n\n In this section, we consider a generic class of time-dependent Ricatti equations that encompass \n equation (<ref>),  in the form \n\n    ψ'(t)  = \n    a(t) ψ^2(t) + b(t) ψ(t) + c(t),   ψ(0) = u_0,    t≤ T,\n\n with u_0 ∈ℂ and a,b,c:[0,T]→ℂ three measurable and bounded functions. We say that ψ:[0,t^*] →ℂ for some t^* ∈( 0,T ] is a local extended solution to (<ref>) with some initial condition ψ(0)=u_0 ∈ℂ if, almost everywhere on [0,t^*], it is continuously differentiable and satisfies the relations in (<ref>). The extended solution is global if t^*=T.\n  \n\nThe presence of the squared non-linearity in (<ref>) precludes the application of the celebrated Cauchy-Lipschitz theorem and  can lead to explosive solutions in finite time. Compared to the related literature on similar Riccati equations  <cit.>, we provide a concise and simplified proof for the existence and uniqueness of a global extended solution to the Riccati equation (<ref>) using a variation of constant formula under the following assumption on the coefficients (a,b,c) and the initial condition u_0:\n\n    (a(t)) = 0,     a(t) >0,   ( c(t) ) + ( b(t) )^2/4a(t)≤ 0,   (u_0)≤ 0,    t≤ T.\n\n\nThe following theorem gives the existence and uniqueness of a solution to the Riccati equation (<ref>).\n\n \nLet u_0∈ℂ with (u_0)≤ 0 and a,b,c:[0,T]→ℂ be measurable and bounded functions satisfying (<ref>). Then,  there exists a unique extended solution ψ:[0,T]→ℂ to the Ricatti equation (<ref>) such that \n\n    (ψ(t))≤ 0,    t≤ T,\n\nand\n\n    sup_t≤ T |ψ(t)|<∞.\n\n\n\n\n For the existence part, we proceed in two steps. First, we  start by arguing the existence of a local solution using \nCarathéodory's theorem.  For this we rely on <cit.>,  using the notations therein (see equation (1.7) for example), we consider the integral equation\n\n    ψ(t) = ψ(0) + ∫_0^t g (t,s,ψ(s))ds,    t ≥ 0,\n\nwhere the operator g is defined by\n\n    g(t,s,ψ(s)):= a(s) x(s)^2 + b(s) x(s) + c(s).\n\n Let D be an open, connected subset of ℝ^+ ×ℂ that contains ( 0, ψ(0) ). Define\n\n    T_∞ := sup{ t ∈ℝ^+ | C_ψ(0),D( [0,T), ℂ) ≠∅},\n\nwhere\n\n    C_ψ(0),D( [0,T), ℂ) := {ϕ∈ C( D, ℂ) | ϕ(0) = ψ(0)  and ( t, ϕ(t)) ∈ D  for  t ∈ [0,T)}.\n\nAn application of  <cit.>  yields the existence of a unique non-continuable solution to (<ref>) that satisfies ( t, ψ(t) ) ∈ D on the interval [0,T_∞) such that either T_∞ = T or t → T_∞lim |ψ(t)| = ∞.  Indeed, the assumptions (i) to (v) of <cit.> are readily satisfied by boundedness and integrability of a, b and c and the fact that g does not depend on t and satisfies the Carathéodory conditions.\n\n  For the existence part, assume without loss of generality that u_0=0. Define the local domain\n  \n    D: 0 ≤ t ≤ T,   | x | ≤ b,\n\n  with T and b are positive real numbers. The right-hand function f(t,x) := a(t) x^2 + b(t) x + c(t) satisfies the three Carathéodory conditions on D such that\n  \n      \n  * x ↦ f(t,x) is continuous for almost all t ∈[ 0, T ],\n      \n  * t ↦ f(t,x) is measurable for all x,\n      \n  * | f(t,x) | ≤ A | x |^2 + B | x | + C ≤ A b^2 + B b + C =: K(b) < ∞, with K(b) a constant (which is integrable on [ 0, T ]) depending on b and a,b and c are upper-bounded by A, B and C respectively.\n  \n  \nConsequently, <cit.> yields the existence of a local extended solution ψ to (<ref>) up to a maximal time 0<t_+≤ T, and one can take an arbitrary number t_+ which satisfies the inequalities\n\n    0 ≤ t_+ ≤ T,    t_+ ≤b/K(b)\n\nC'est un mauvais résultat car la borne supérieure en temps dépend de la borne en espace, et T → 0 pour b → 0... \n\n\nThe right-hand function f(t,x) := a(t) x^2 + b(t) x + c(t) satisfies the three Carathéodory conditions and <cit.> yields the existence of a local extended solution ψ to (<ref>) up to a maximal time t_+≤ T such that either t_+ = T or t → t_+lim |ψ(t)| = ∞[How to justify this?].\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSecond, we argue that \n\n\n    sup_t≤ T_∞ |ψ(t)|<∞,\n \nwhich would then yield T_∞=T and the existence of a global solution ψ.  Let t< T_∞. We start by showing that (ψ(t)) ≤ 0.  Indeed, taking real parts in (<ref>), ψ_ r:=( ψ) satisfies the following equation on [0,T_∞):\n    \n    ψ_ r' (s)= { a(s) ( ψ(s) ) + ( b(s) ) }ψ_ r(s)+ d(s),\n\nwhere d(s) = - a(s) ( ( ψ(s) ) + ( b(s) )/2a(s))^2 + ( c(s) ) + ^2( b(s) )/4a(s)≤ 0 thanks to condition (<ref>), after a completion of squares. The variation of constant for ψ_ r then yields\n    \n    ψ_ r(t) = e^∫_0^t ( a(u) ( ψ(u) ) + ( b(u) ) ) du(u_0)  + ∫_0^t   d(s)  e^∫_s^t ( a(u) ( ψ(u) ) + ( b(u) ) ) duds ≤ 0,\n\n since the exponential is positive and d(s)≤ 0, and (u_0)≤ 0 by assumption.  This shows that (ψ)≤ 0, on [0,T_∞). Finally, an application of a similar variation of constants formula on  equation (<ref>) leads to \n  \n    ψ(t) = e^∫_0^t ( a(u) ( ψ(u) ) + ( b(u) ) ) du u_0  + ∫_0^t  e^∫_s^t ( a(u) ( ψ(u) ) +  ( b(u) ) ) du c(s) ds,\n\nso that taking the module together with the triangle inequality and the fact that (ψ)≤ 0 on [0,T_∞), yields \n\n    |ψ(t)|    ≤ |e^∫_0^t ( a(u)  ψ(u)  + ( b(u) ) ) du | |u_0|  + ∫_0^t  | e^∫_s^t ( a(u)  ψ(u)+  ( b(u) ) ) du|  |c(s)| ds\n       =    e^∫_0^t ( a(u)  ( ψ(u) ) + ( b(u) ) ) du  |u_0|  + ∫_0^t  e^∫_s^t ( a(u)  ( ψ(u) ) +  ( b(u) ) ) du |c(s)|ds\n       ≤  e^∫_0^t  ( b(u) )  du  |u_0|  + ∫_0^T  e^∫_s^t  ( b(u) )  du  |c(s)|ds \n       ≤ C( |u_0| + ∫_0^T |c(s)|ds),\n\nwhere C=sup_s,s'∈ [0,T]^2 e^∫_s^s'(b(u)) du  does not depend on t \n and is finite by boundedness of b. \nThis shows (<ref>) as needed. Combining the above we obtain the existence of a solution ψ on [0,T] satisfying (<ref>) and (<ref>).\n\n\nTo argue uniqueness, assume there are two such extended solutions ψ_1 and ψ_2 that satisfy (<ref>). Then,\n\n    (ψ_2-ψ_1)'(t) = \n    ( a(t) (ψ_2+ψ_1)(t) + b(t) ) (ψ_2-ψ_1)(t),   (ψ_2-ψ_1)(0) = 0,    t≤ T,\n\nwhich yields\n\n    |ψ_2-ψ_1|(t) ≤∫_0^t | a(s) (ψ_2+ψ_1)(s) + b(s) | |ψ_2-ψ_1|(s) ds ≤ c ∫_0^t |ψ_2-ψ_1|(s) ds ,     t≤ T,\n\nfor some c>0 by boundedeness of (ψ_1,ψ_2, a, b) using (<ref>), so that \nthe uniqueness is obtained  from Gronwall's lemma.\n\n\n\n\n\n\n\n §.§ Proof of Theorem <ref>\n\nWe first argue the existence of a solution to the system of Riccati equations (<ref>)-(<ref>). Let us rewrite the Ricatti ODE from (<ref>) as\n\n    ψ_ϵ'(t) = a_ϵψ_ϵ ^2(t) + b_ϵ(t) ψ_ϵ(t) +c_ϵ(t),   ψ_ϵ(0) = 0,    t ≤ T,\n\nwhere we defined\n\n    a_ϵ    := ϵ^H-1/2ξ^2/2\n    \n        b_ϵ(t)     := ϵ^H-1/2ρξ f(t) -  ϵ^-1\n    \n        c_ϵ(t)     := ϵ^H-1/2[ g(t) + f^2(t) - f(t)/2].\n\nSince condition (<ref>) ensures\n\n    ( c_ϵ) + ( b_ϵ)^2/4a_ϵ = ϵ^H-1/2(  g + 1/2( ( f)^2 -  f ) + ( ρ^2 - 1 ) (  f )^2 ) ≤ 0,\n\nthen conditions (<ref>) are readily satisfied and consequently Theorem <ref> yields the existence and uniqueness of a solution ψ_ϵ:[0,T]→ℂ\nto the Ricatti ODE (<ref>) such that\n\n    (ψ_ϵ(t)) ≤ 0,   t ≤ T.\n\n The function  ϕ_ϵ defined  in integral form as\n\n    ϕ_ϵ(t) = ( θ + ϵ^-H-1/2 V_0 ) ∫_0^t ψ_ϵ(s)ds,    t ≤ T,\n\nsolves  (<ref>). \n\nWe now prove the expression for the charateristic functional (<ref>). Define the following process M:\n\n    M_t    = exp(U_t),  \n    \n    U_t    =  ϕ_ϵ( T-t ) + ϵ^1/2-Hψ_ϵ( T-t ) V^ϵ_t +    ∫_0^t f(T-s) dlog S^ϵ_s + ∫_0^t g(T-s) d V̅_s^ϵ.\n\nIn order to obtain (<ref>), it suffices to show that M is a martingale. Indeed, if this is the case, and after observing that the terminal value of M  is  given by\n\n    M_T = exp(  ∫_0^T f(T-s) dlog S^ϵ_s + ∫_0^T g(T-s) d V̅_s^ϵ),\n\nrecall that ϕ_ϵ( 0 )=ψ_ϵ( 0 )=0,\nwe obtain \n\n    𝔼[ exp(  ∫_0^T f(T-s) dlog S^ϵ_s + ∫_0^T g(T-s) d V̅_s^ϵ) |ℱ_t] =  𝔼[  M_T  | ℱ_t] = M_t = exp(U_t),\n\nwhich yields (<ref>). We now argue that M is a martingale. We first show that M is a local martingale using Itô formula. The dynamics of M read\n\n    dM_t = M_t (dU_t + 1/2 d⟨ U⟩_t ),\n\nwith \n\n    dU_t =    {ϕ_ϵ'(T-t) - ( θ + ϵ^-1/2-H V_0 ) ψ_ϵ(T-t)  + ( - ϵ^1/2-Hψ_ϵ '(T-t) - ϵ^-1/2-Hψ_ϵ(T-t) + g(T-t) - f(T-t)/2) V^ϵ_t } dt\n        + ( ξψ_ϵ(T-t) + ρ f(T-t) ) √(V^ϵ_t)dW_t+√(1-ρ^2)f(T-t)√(V^ϵ_t)dW^⊥_t.\n\nThis yields that the drift in dM_t/M_t is given by \n\n    ϕ_ϵ'(T-t) - ( θ + ϵ^-1/2-H V_0 ) ψ_ϵ(T-t) \n        + ( - ϵ^1/2-Hψ_ϵ'(T-t) + ξ^2/2( ψ_ϵ (T-t) )^2 + ( ρξ f(T-t) - ϵ^-1/2-H) ψ_ϵ(T-t) + g(T-t) + f^2(T-t) - f(T-t)/2) V^ϵ_t\n\n\nwhich is equal to 0 from the Riccati equations (<ref>) and (<ref>). This shows that M is a local martingale. \nTo argue that M is a true martingale, we note that (ψ_ϵ)≤ 0 which implies (ϕ_ϵ)≤ 0, so that \n\n    (U_t)    ≤∫_0^t (f(T-s)) dlog S^ϵ_s + ∫_0^t (g(T-s)) d V̅_s^ϵ\n       = ∫_0^t ( (g(T-s)) \n     -1/2(f(T-s)))  V_s^ϵ ds + ∫_0^t   (f(T-s))  √(V_s^ϵ)dB_s \n       ≤  -1/2∫_0^t  \n    (f(T-s))^2 V_s^ϵ ds + ∫_0^t   (f(T-s))  √(V_s^ϵ)dB_s=:Ũ_t,\n\nwhere the last inequality follows from (<ref>).  It follows that \n\n    |M_t|=exp((U_t)) ≤exp(Ũ_t),\n\nwhere the process exp(Ũ) is a true martingale, see <cit.>. This shows that  M is a true martingale, being a local martingale bounded by a true martingale, see <cit.>, which concludes the proof. \n \n\n\n\n\n\n\n§ FROM REVERSIONARY HESTON TO JUMP PROCESSES\n\n\nIn this section, we establish the convergence of the log-price and the integrated variance (log S^ϵ,V̅^ϵ) in  the reversionary Heston model (<ref>)-(<ref>) towards a Lévy jump process (X,Y), as ϵ goes to 0. More precisely, the limit (X, Y) belongs to the class of Normal Inverse Gaussian - Inverse Gaussian (NIG-IG) processes defined as follows.\n\n Fix  α≥ |β| ≥ 0, δ,λ > 0 and μ∈. We say that ( X_t, Y_t )_t ≥ 0 is a Normal Inverse Gaussian - Inverse Gaussian (NIG-IG) process with parameters ( α,β,δ,μ,  λ) if it is a two-dimensional homogeneous Lévy process with càdlàg sample paths, starting  from (X_0,Y_0)=(0,0) almost surely, with Lévy exponent η defined by\n\n    η(u,v) := [ i μ u + δ( √(α^2 - β^2) -√(α^2 - 2iλ v -( β + iu )^2)) ],    u, v ∈ℝ,\n\ni.e. the joint characteristic function is given by\n\n    𝔼[ exp( iu X_t + iv Y_t ) ] = exp( η(u,v) t ),    u, v ∈ℝ,    t ≤ T.\n\n\n\nIn order to justify the existence of such a class of Lévy processes, one needs to justify that η given in (<ref>) is indeed the logarithm of a characteristic function associated to an infinitely divisible distribution, see  <cit.>.  \n This is the object of the following lemma, which also provides the link with first-hitting times and subordinated processes. \n\n\n    Let α≥ |β| ≥ 0, δ,λ > 0, μ∈  and   (W, W^⊥) be a two dimensional Brownian motion. Let (Λ_t)_t∈ [0,T] be the first hitting-time process defined as\n    \n    Λ_t :=  inf{ s ≥ 0 : √(α^2-β^2)s + W_s≥δ t },    t ∈[ 0,T \n        ],\n\nand define Z as the following shifted subordinated process \n\n    Z_t =μ t + βΛ_t +  W^⊥_Λ_t,    t ∈[ 0,T \n        ].\n\nThen,\n\n    𝔼[ exp( iuZ_t+ iv λΛ_t ) ]  = exp(η(u,v)t),    u,v ∈ℝ,    t ∈[ 0,T \n        ].\n\n In particular, η given by (<ref>) is the logarithm of the characteristic function  of the joint random variable (Z_1,λΛ_1) which is infinitely divisible.\n\n\nFix t ∈[ 0,T ]. By construction, it is well-known that  Λ_t has an Inverse Gaussian distribution if α > | β| with parameters IG( δ t/√(α^2 - β^2), δ^2 t ), and in the drift-free case α = | β|, Λ_t follows a Lévy distribution with parameters Lévy( 0, δ^2 t ) (see <cit.> and Definition <ref> in the Appendix). Now conditional on Λ_t, Z_t is Gaussian with parameters 𝒩( μ t + βΛ_t, Λ_t ) and using the tower property of conditional expectation, we get for the first case that\n    \n    𝔼[exp( iu Z_t + iv λΛ_t ) ]     = 𝔼[ 𝔼[ . exp( iu Z_t ) | Λ_t ] exp( iv λΛ_t ) ] \n        = 𝔼[ exp( iu ( \n            μ t + βΛ_t ) - Λ_t u^2/2 + iv λΛ_t ) ] \n        = exp( iu μ t ) 𝔼[ exp( ( iu β - u^2/2 + iv λ) Λ_t ) ] \n        = exp( iu μ t + δ t √(α^2 - β^2)( 1 - √(1-2/α^2 - β^2( iu β - u^2/2 + iv λ))) )\n    i.e. 𝔼[ exp( iuZ_t+ivλΛ_t ) ]     = exp( i u μ t + δ t ( √(α^2 - β^2) -√(α^2 - 2iλ v -( β + iu )^2))) = exp(η(u,v)t),    u,v ∈ℝ,\n\nwhere we used Definition <ref> to get the fourth equality, noting that ( i (u β + v λ) - u^2/2) ≤ 0. Similar computations yield the result for the case α = | β|. Furthermore, we will say that that the random variable (Z_1,λΛ_1) follows a NIG-IG distribution with parameters (α,β,μ, δ,λ) (see Definition <ref> in the Appendix). Such distribution is  infinitely divisible because if ( X_1, Y_1 ), ⋯, ( X_m, Y_m ) are independent NIG-IG random variables with common parameters ( α, β, λ) and individual ( μ_i, δ_i ), for i =1, ⋯, m, then ( X, Y ) :=  ( ∑_i=1^mX_i, ∑_i=1^mY_i ) is again NIG-IG-distributed with parameters ( α, β, ∑_i=1^mμ_i, ∑_i=1^mδ_i, λ).\n\n\n\nThe appellation NIG-IG for the couple (X,Y) in Definition <ref> is justified as follows:\n  \n\n  * Y is an Inverse Gaussian process first derived by <cit.> which can be checked either by recovering the Inverse Gaussian distribution with parameters IG( λδ/√(α^2 - β^2), λδ^2 ) after setting u=0 in (<ref>); or by using  the representation as a first passage-time in (<ref>). It is worth pointing that, \n for α = |β|, one recovers the well-known Lévy distribution for the  first-passage of a Brownian motion  with parameters Lévy( 0, λδ^2 ). The Lévy distribution can be seen as a special case of the Inverse Gaussian distribution. \n    \n  * X is the celebrated Normal Inverse Gaussian process of <cit.>, with parameters NIG( α, β, μ, δ), which can be checked by setting v=0 in (<ref>) or by using the representation as subordinated Brownian motion with an Inverse Gaussian subordinator as in (<ref>).\n\n\nIn addition, we allow in Definition <ref> the parameter α to be equal to ∞ in the following sense:\n\n\nConsidering the set of parameters\n    \n    (α,β,δ,μ, λ) =  ( α, 0, σ^2 α, μ, 1 ),\n\n    a second order Taylor expansion, as α→∞, of the square root yields\n    \n    𝔼[ exp( iu X_t + iv Y_t ) ] = exp( [ i μ u - σ^2 (u^2/2 + iv)] t ),    u, v ∈ℝ,    t ≤ T,\n\n    which is equivalent to the normal-deterministic process defined by\n    \n    ( X_t, Y_t )_t ∈ [0,T] =  ( μ t + σW_t, σ^2 t )_t ∈ [0,T]d=( μ t + W_σ^2 t, σ^2 t )_t ∈ [0,T].\n\nWe will consider that such (degenerate) process is a particular case of Definition <ref> with parameters denoted by\n    \n    . ( α, 0, σ^2 α, μ, 1 )|_α→∞.\n\n\n\n\nWe are now in place to state our main convergence theorem. Theorem <ref> provides the convergence of the finite-dimensional distributions of the joint process (log S^ϵ, V̅^ϵ)  through the  study of the limiting behavior of the  characteristic functional given in Theorem <ref>. Interestingly, the limiting behavior disentangles three different asymptotic regimes based on the values of H that can be seen intuitively on the level of the Riccati equation (<ref>) as follows. Applying the variation of constants on ψ_ϵ, we get:\n\n    ψ_ϵ(t)     = ϵ^H+1/2∫_0^t K_ϵ(t-s) F(s,ψ_ϵ(s)) ds,    t≤ T,\n    \n        F(s,u)     := ξ^2/2 u^2 + ρξ f(s) u + g(s) + f^2(s) - f(s)/2,\n\nwith K_ϵ the kernel defined by \n    K_ϵ(t) =  ϵ^-1 e^-ϵ^-1t,     t≥ 0.\n\nAssuming that ψ_ϵ converges to some ψ_0 and observing that K_ϵ plays the role of the Dirac delta as ϵ→ 0, one expects ∫_0^t K_ϵ(t-s) F(s,ψ_ϵ(s)) ds → F(t,ψ_0(t)) in (<ref>), the  pre-factor ϵ^H+1/2 suggests then  three different limiting regimes with respect to H that can be characterized through the functions F  and  ψ_0: \n\n    ψ_0(t) = 0,      H>-1/2,   \n    ψ_0(t)= F(t,ψ_0(t)),    (ψ_0(t))≤ 0,      H=-1/2,   \n    \n         0 = F(t,ψ_0(t)),          (ψ_0(t))≤ 0,       H<-1/2.\n\nThe function  ψ_0 in (<ref>) is even explicitly given by \n\n    ψ_0(t)=  \n        0,       H>-1/2,   \n    ξ^-2( 1 - ρξ f(t) - √(( 1 - ρξ f(t) )^2 - 2 ξ^2 ( g(t) + f^2(t)-f(t)/2))),      H=-1/2,   \n    \n          - ξ^-1( ρ f(t) + √(f(t) ( 1 - ( 1- ρ^2 ) f(t) ) - 2 g(t))),      H<-1/2,\n\nsee Lemma <ref> below. Furthermore, the convergence of the integrated variance process is strengthened to a functional weak convergence on the Skorokhod space  (D(0,T), M_1) of càdlàg paths on [0,T] endowed with the strong M_1 topology, see Section <ref> below. Such topology is weaker and less restrictive than the commonly used uniform or J_1 topologies which share the property that a jump in a limiting\nprocess can only be approximated by jumps of comparable size at the same time or, respectively, at nearby times. On the contrary, the M_1 topology of <cit.> captures approximations of unmatched jumps, which in our case, will allow us to prove the convergence of the stochastic process V̅^ϵ  with continuous sample trajectories towards a Lévy process with càdlàg sample trajectories. The statement is now made rigorous in the following theorem.\n\n\n    Let f,g:[0,T]→ℂ be bounded and measurable such that f =  g = 0 and such that ψ_0 defined in (<ref>) has bounded variations. Then, based on the value of H, we obtain different explicit asymptotic formulas for the characteristic functional given in Theorem <ref>:\n    \n    lim_ϵ→ 0𝔼[ exp(∫_0^T f(T-s) dlogS^ϵ_s + ∫_0^T g(T-s) d V̅_s^ϵ) ]=exp( ϕ_0(T)),\n\n    with \n     \n    ϕ_0(T) := \n        V_0 ∫_0^T h(s) ds,       H>-1/2,   \n    ( θ + V_0 ) ξ^-2( T - ∫_0^T ( ρξ f(s) + √(( 1 - ρξ f(s))^2 - 2 ξ^2 h(s))) ds ),      H=-1/2, \n    \n        -θξ^-1∫_0^T ( ρ f(s) + √(ρ^2 f^2(s) - 2 h(s))) ds,       H<-1/2,\n\nwhere h(s): =g(s)+ f^2(s)-f(s)/2.\nIn particular for ρ∈ (-1,1), as ϵ→ 0,   the finite-dimensional distributions of the joint process (logS^ϵ/S_0,V̅^ϵ) converge to the finite-dimensional distributions of a NIG-IG process (X,Y) in the sense of Definition <ref> with the following parameters depending on the value of H:\n \n    (α,β,δ,μ, λ) := .( α, 0, V_0 α, - V_0/2, 1 )|_α→∞,        H>-1/2, \n    ( 1/2√((ξ-2ρ)^2 + 4(1-ρ^2))/ξ (1-ρ^2), -1/2ξ - 2 ρ/ξ( 1 - ρ^2 ), √(1-ρ^2) (θ+V_0)ξ^-1, - ρ(θ + V_0) ξ^-1, 1/1-ρ^2) ,      H=-1/2, \n    ( 1/2(1-ρ^2), - 1/2(1-ρ^2), √(1-ρ^2)θξ^-1, - ρθξ^-1, 1/1-ρ^2),       H<-1/2,\n\nwhere θ, S_0, ξ and V_0 are the same from (<ref>)-(<ref>). Furthermore, the process V̅^ϵ converges weakly  towards Y on the space (D(0,T), M_1), as ϵ→ 0.\n\n  The  convergence of the characteristic functional in (<ref>) is established in Section <ref> (Lemmas <ref> and <ref>). This implies the convergence of the finite-dimensional  distributions of \n (log S^ϵ,V̅^ϵ) as detailed in Section <ref>. Finally, the weak convergence of V̅^ϵ on ( D(0,T),M_1) is proved in Section <ref>.\n\n\n\nThe  interpretation of the convergence results becomes even more interesting when combined with Section <ref>. In Section <ref>, for H>-1/2,  the reversionary Heston model (log S^ϵ, V̅^ϵ) is constructed as a proxy of rough and hyper-rough Heston models.  Theorem <ref> shows that the limiting regime for H>-1/2 is a (degenerate) Black-Scholes regime, cf.Remark <ref>, whereas,  for H≤ -1/2 one obtains the convergence of the reversionary regimes towards (non-degenerate) jump processes with distinct regimes between H=-1/2 and H<-1/2, see Corollary <ref> below. This suggests that jump models and (hyper-)rough volatility models are complementary, and do not overlap. For H>-1/2 the reversionary model can be interpreted as a proxy of rough and hyper-rough volatility models, while for H≤ -1/2 it can be interpreted as a proxy of jump models.   Jump models actually start at H=-1/2 (and below), the first value for which hyper-rough volatility models can no-longer be defined. \n\n\n\nIn Figures <ref> and <ref>, we plot respectively the convergence of the smiles and the skew of the reversionary Heston model (log S^ϵ, V̅^ϵ) for the case H=-1/2 towards the Normal Inverse Gaussian model. The volatility surface is obtained by applying Fourier inversion formulas on  the corresponding characteristic functions.  Similar to Figures <ref> and <ref>, the graphs show that the fast parametrizations introduced in the Heston model  are able to reproduce very steep skews for the implied volatility surface. \n\n\n\n\n\n\nIn the case (f,g) = ( iu, iv ), with u, v ∈ℝ, the asymptotic marginals of reversionary Heston expressed in Corollary <ref> below are obtained as a direct consequence of the convergence Theorem <ref>. \n\n \nBased on the value of H ∈ℝ, the pair of normalized log price and integrated variance (logS^ϵ_T/S_0, V̅^ϵ_T ) has distinct asymptotic marginals as the reversionary time-scale ϵ goes to zero given by:\n\n    \n  * H>-1/2, i.e. Black Scholes-type asymptotic regime (BS regime)\n    \n    \n    𝔼[ iulog S^ϵ_T/S_0 + ivV̅^ϵ_T ] ϵ→ 0⟶exp{ - V_0/2( u^2 - 2i ( v - u/2) ) T }.\n\n    \n    \n  * H=-1/2, i.e. Normal Inverse Gaussian-type asymptotic regime (NIG regime)\n    \n    \n    𝔼[ iulog S^ϵ_T/S_0+ ivV̅^ϵ_T ] ϵ→ 0⟶exp{( θ + V_0 ) ξ^-2( 1 - i ρξ u -√(( 1 - i ρξ u )^2 - 2 ξ^2 ( i v - u^2 + iu/2))) T }.\n\n    \n    \n  * H<-1/2, i.e. Normal Lévy-type asymptotic regime (NL regime)\n    \n    \n    𝔼[ iulog S^ϵ_T/S_0 + ivV̅^ϵ_T ] ϵ→ 0⟶exp{ - θξ^-1(i ρ u + √(( 1 - ρ^2 ) u^2 - 2i ( v - u/2))) T }.\n\n    \n\n\n\n\nIn Figure <ref>, we illustrate numerically the convergence of the characteristic function in all three regimes.\n\n\n\nThe rest of the section is dedicated to the proof of Theorem <ref>. \n\n\n\n §.§ Convergence of the joint characteristic functional\n \n    \nIn this section we prove the convergence of the characteristic functional of (logS^ϵ/S_0, V̅^ϵ) as ϵ goes to 0 stated in Theorem <ref>. For this, we fix \nf,g:[0,T]→ℂ bounded and measurable such that f = g = 0. We note that (<ref>) is trivially satisfied so that an application of Theorem <ref>, with t=0, yields that \n\n    𝔼[ exp(∫_0^T f(T-s) dlog S^ϵ_s + ∫_0^T g(T-s) d V̅_s^ϵ) ] = exp( ϕ_ϵ(T) + ϵ^1/2  - H ψ_ϵ(T) V_0 ),\n\n    where (ϕ_ϵ,ψ_ϵ) solve (<ref>)-(<ref>).\n  We start by showing that the second term in the exponential  ϵ^1/2-Hψ_ϵ goes to 0 for any value of H∈ in the following lemma. \n   \nFor ϵ>0, let ψ_ϵ be a solution  the time-dependent Ricatti ODE (<ref>) such that (ψ^ϵ)≤ 0 with   f, g:[0,T]→ℂ  bounded and measurable functions such that f =  g = 0. Then, \n\n    | ψ_ϵ(t) | ≤ C ϵ^H+1/2( 1 - e^- ϵ^-1t),    t≤ T,\n\n    for some constant C independent of ϵ. In particular, we have the uniform convergence\n    \n    lim_ϵ→ 0sup_t≤ Tϵ^1/2-H|ψ_ϵ(t)| = 0,        H ∈.\n\n\n\n \n The variation of constants applied to the differential equation (<ref>) yields:\n\n    ψ_ϵ(t) = ∫_ 0^t c_ϵ(s)e^∫_s^t ( a_ϵψ_ϵ(u) + b_ϵ(u) ) du ds,\n\nwith a_ϵ, b_ϵ, c_ϵ defined as in (<ref>).  Given that f and g are both bounded on [0,T], we fix C ≥ 0 such that | c_ϵ(u) | ≤ C ϵ^H-1/2, u ≤ T. Note that b_ϵ = - ϵ^-1, having also ( ψ_ϵ) ≤ 0 and a_ϵ > 0, we get the desired upper bound on the solution. The convergence result follows immediately.\n\n\n  \nThe first term ϕ_ϵ, however,  yields  different limits based on the value of H. Consequently, we will study in Lemma <ref> the convergence of the following quantity\n\n    ϕ_ϵ (t) = ∫_0^t ( θ + ϵ^-H-1/2 V_0 ) ψ_ϵ(s) ds,\n\n for different regimes of H. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n  \n    We have the convergence\n \n    lim_ϵ→ 0ϕ_ϵ(T) = ϕ_0(T),\n\n where  ϕ_0(T) is given by (<ref>).\n \n \n \nCase H>-1/2.\n    In this case, the solution ψ_ϵ converges uniformly to zero from the upper bound given in Lemma <ref> which, combined with the expression of F in (<ref>),  yields \n\n    lim_ϵ→ 0 F(s,ψ_ϵ(s))  = F(s,0) = g(s) + f^2(s) - f(s)/2,    s≤ T.\n    \n    Furthermore, integrating the variation of constants expression (<ref>) leads to\n    \n    ∫_0^t ϵ^-H-1/2ψ_ϵ(u) du     = ∫_0^t {∫_0^u K_ϵ(u-s) F(s,ψ_ϵ(s)) ds } du\n        = ∫_0^t {∫_s^t K_ϵ(u-s) du } F(s,ψ_ϵ(s)) ds\n        = ∫_0^t ( 1 - e^-ϵ^-1(t-s)) F(s,ψ_ϵ(s)) ds,\n\nwhere we used Fubini for the second equality as the integrated quantity is bounded and measurable. Now, given the function s ↦( 1 - e^-ϵ^-1(t-s))F(s,ψ_ϵ(s)) is uniformly bounded in ϵ by a constant on [0,T], and that it converges pointwise to s ↦ F(0,s), then an application of  Lebesgue's Dominated Convergence Theorem yields\n\n    ∫_0^t ϵ^-H-1/2ψ_ϵ(u) du ϵ→ 0⟶∫_0^t ( g(s) + f^2(s) - f(s)/2)ds,\n\nhence the resulting convergence \n\n    ϕ_ϵ (t) ϵ→ 0⟶ V_0 ∫_0^t ( g(s) + f^2(s) - f(s)/2) ds.\n\n\nCase H=-1/2.\nNow fix ϵ>0 and using the second equation in (<ref>), observe that \n     \n    ψ_ϵ'(t)     = - ϵ^-1ψ_ϵ(t) + ϵ^-1( F(t,ψ_ϵ(t)) - F(t,ψ_0(t)) + ψ_0(t) )\n       = - ϵ^-1( ψ_ϵ(t) - ψ_0(t) ) + ϵ^-1β_ϵ(t) ( ψ_ϵ(t) - ψ_0(t) ),\n    with β_ϵ(t)     := ξ^2/2( ψ_ϵ(t) + ψ_0(t) ) + ρξ f(T-t).\n\n\n     Since ψ_0 has bounded variations by assumption, the complex-valued Riemann-Stieltjes integral on continuous functions f against ψ_0 is well-defined, and satisfies an integration by part formula such that\n    \n    ∫_0^t f(s) d ψ_0(s) = f(t)ψ_0(t)-f(0)ψ_0(0) - ∫_0^t ψ_0(s) df(s),\n\n    see Theorems A.1 and A.2 from <cit.>. Define \n        Δ_ϵ(t):=(ψ_ϵ(t)-ψ_0(t))e^t/ϵ. Then,  it follows that \n    \n    dΔ_ϵ(t)    = (ψ'_ϵ(t)dt-dψ_0(t))e^t/ϵ +  ϵ^-1(ψ_ϵ(t)-ψ_0(t))e^t/ϵdt\n       =  ϵ^-1β_ϵ(t) Δ_ϵ(t) - e^t/ϵdψ_0(t),\n\n    and applying the variation of constants formula leads to \n    \n    Δ_ϵ(t) = e^ϵ^-1∫_0^tβ_ϵ(r)dr Δ_ϵ(0)  - ∫_0^t e^ϵ^-1∫_s^tβ_ϵ(r)dr e^ϵ^-1s dψ_0(s),\n\n    so that, recalling that ψ_ϵ(0)=0,\n    \n    ψ_ϵ(t) - ψ_0(t)    =  -e^ϵ^-1∫_0^tβ_ϵ(r)dr e^-ϵ^-1tψ_0(0)  - ∫_0^t e^ϵ^-1∫_s^tβ_ϵ(r)dre^-ϵ^-1(t-s) dψ_0(s) \n        =:  I_ϵ(t) + II_ϵ(t) .\n\nWe now prove successively that |∫_0^T  I_ϵ(t)dt| → 0 and |∫_0^T II_ϵ(t)dt| → 0.\n\n\n    \n  * Given that β_ϵ≤ 0, then\n\n\n    | e^ϵ^H-1/2∫_0^tβ_ϵ(r)dr e^-ϵ^-1tψ_0(0) | ≤ e^-ϵ^-1t| ψ_0(0) | → 0,    t ∈ (0,T),\n\nso that I_ϵ(t) converges pointwise to 0 on (0,T)  and is dominated by an integrable function, hence |∫_0^T  I_ϵ(t)dt| → 0 by Lebesgue's dominated convergence theorem.\n\n\n    \n  * Regarding the second term, we have\n    \n    | ∫_0^T ∫_0^t e^ϵ^H-1/2∫_s^tβ_ϵ(r)dre^-ϵ^-1(t-s) dψ_0(s) dt|    ≤∫_0^T ∫_0^t e^-ϵ^-1(t-s)| dψ_0(s) | dt\n        = ∫_0^T ∫_s^T e^-ϵ^-1(t-s) dt | dψ_0(s) |\n        = ∫_0^T ϵ( 1 - e^-ϵ^-1( T-s)) | dψ_0(s) |\n\n    where the inequality comes from Theorem A.4 from <cit.> and using again that β_ϵ≤ 0, with the positive measure on the right-hand side being the total variation measure defined as in Theorem 6.2 from <cit.>, and we used Fubini-Lebesgue to get the first equality. Noting the point-wise convergence of the function f_ϵ : s ↦ϵ( 1 - e^-ϵ^-1( T-s)) to zero and its uniform boundedness in ϵ by a constant on [0,T], the dominated convergence theorem applied to the total variation measure proves the result.\n\nThus, we obtained\n\n    ∫_0^T ψ_ϵ(t) dt ϵ→ 0⟶∫_0^T ψ_0(t) dt,\n\nwhere ψ_0 satisfies the second equation in (<ref>), hence we get\n\n    ϕ_ϵ (T) ϵ→ 0⟶( θ + V_0 ) ∫_0^T ψ_0(s) ds,\n\nwhich is the desired convergence.\n\n\nCase H<-1/2. Define ψ_0 as the root with non-positive real part from the third equation in (<ref>), recall Lemma <ref>. Fixing again ϵ>0, we have\n\n    ψ_ϵ'(t)     = - ϵ^-1ψ_ϵ(t) + ϵ^H-1/2( F(t,ψ_ϵ(t)) - F(t,ψ_0(t)) )\n       = - ϵ^-1ψ_ϵ(t) + ϵ^H-1/2β_ϵ(t) ( ψ_ϵ(t) - ψ_0(t) ),\n\nwith β_ϵ given by (<ref>). Similarly the case H<-1/2, computing the differential of Δ_ϵ(t):=(ψ_ϵ(t)-ψ_0(t))e^t/ϵ and applying the variation of constants formula leads to\n\n    Δ_ϵ(t) = e^ϵ^H-1/2∫_0^tβ_ϵ(r)dr Δ_ϵ(0)  - ∫_0^t e^ϵ^H-1/2∫_s^tβ_ϵ(r)dr e^s/ϵ(dψ_0(s) + ϵ^-1ψ_0(s) ds ),\n\n so that \n\n    ψ_ϵ(t) - ψ_0(t)    =  -e^ϵ^H-1/2∫_0^tβ_ϵ(r)dr e^-ϵ^-1tψ_0(0)  - ∫_0^t e^ϵ^H-1/2∫_s^tβ_ϵ(r)dre^-ϵ^-1(t-s)(dψ_0(s) + ϵ^-1ψ_0(s) ds )\n       = -e^ϵ^H-1/2∫_0^tβ_ϵ(r)dr e^-ϵ^-1tψ_0(0)  - ∫_0^t e^ϵ^H-1/2∫_s^tβ_ϵ(r)dre^-ϵ^-1(t-s) dψ_0(s) \n          - ∫_0^t e^ϵ^H-1/2∫_s^tβ_ϵ(r)dre^-ϵ^-1(t-s)ϵ^-1ψ_0(s) ds\n        =:  I_ϵ(t) + II_ϵ(t)  + III_ϵ (t).\n\nWe already have from the previous case H=-1/2 that, as ϵ→ 0, both integrals ∫_0^T  I_ϵ(t) dt, ∫_0^T II_ϵ(t) dt converge to 0, all that remains to show consequently is that ∫_0^T III_ϵ(t) dt converges to 0 too.\n\n    \n  * A finer upper bound on β_ϵ is required to deal with this third term. We already know from Theorem <ref> that ψ_ϵ≤ 0, and by definition of ψ_0, we get the following bound\n    \n    β_ϵ = ξ^2/2( ψ_ϵ + ψ_0) ≤ξ^2/2ψ_0≤ 0.\n\n    Set\n    \n    E := { s ∈ [0,T], ( f(s), g(s) ) ≠( 0, 0 ) },\n\n    and from (<ref>), we know that ψ_0=0 on E^C while lemma <ref> yields ψ_0 ≠ 0 on E so that we can  bound III_ϵ as follows\n    \n    | III_ϵ (t) |    ≤∫_[0,t] ∩ Eϵ^-1 |ψ_0(s)| e^ϵ^H-1/2∫_s^tβ_ϵ(r)dr e^-ϵ^-1(t-s) ds \n       ≤∫_[0,t] ∩ Eϵ^-1|ψ_0(s)|/-ϵ^H-1/2ξ^2/2ψ_0(s)( -ϵ^H-1/2ξ^2/2ψ_0(s) e^∫_s^t ϵ^H-1/2ξ^2/2ψ_0(r) dr) ds \n       ≤∫_[0,t] ∩ Eϵ^-H-1/2 2 ξ^-2|ψ_0|/- ψ_0( -ϵ^H-1/2ξ^2/2ψ_0(s) e^∫_s^t ϵ^H-1/2ξ^2/2ψ_0(r) dr) ds,\n\n    and an application of lemma <ref> yields the existence of a finite positive constant C>0 such that\n    \n    |ψ_0|/- ψ_0≤ C,   ∀ s ∈ E,\n\n    so that\n    \n    | III_ϵ (t)|    ≤ C ϵ^-H-1/2∫_[0,t] ∩ E( -ϵ^H-1/2ξ^2/2ψ_0(s) e^∫_s^t ϵ^H-1/2ξ^2/2ψ_0(r) dr) ds\n       ≤ C ϵ^-H-1/2( 1 - e^∫_0^t ϵ^H-1/2ξ^2/2ψ_0(r) dr) ϵ→ 0⟶ 0,\n\n    since -H-1/2>0 so that ϵ^-H-1/2→ 0 as ϵ→ 0. Thus III_ϵ is dominated by a finite constant C independent of ϵ (which is integrable on [0,T]) and Lebesgue's dominated convergence theorem yields that ∫_0^T III_ϵ(t) dt converges to 0.\n\nConsequently, we obtained\n\n    ∫_0^T ψ_ϵ(t) dt ϵ→ 0⟶∫_0^T ψ_0(t) dt,\n\nwhich then yields\n\n    ϵ^-H-1/2∫_0^T ψ_ϵ(t) dt ϵ→ 0⟶ 0,\n\nand finally we get\n\n    ϕ_ϵ (T) ϵ→ 0⟶θ∫_0^T ψ_0(s) ds.\n\n\n\n\n\n\n\n §.§ Convergence of the finite-dimensional distributions towards  NIG-IG\n \n\nIn this section, we prove the  second part of Theorem <ref>, that is the convergence of the finite-dimensional distributions of ( logS^ϵ/S_0, V̅^ϵ) towards those of a NIG-IG process  ( X, Y ) in the sense of Definition <ref>  with parameters (α, β, μ, δ,λ) as in (<ref>) depending on the regime of H. Let d ∈ℕ^* and take 0 =: t_0 < t_1 < … < t_d ≤ T to be d distinct times of the time interval [0, T] and ( u_k, v_k )_k ∈{ 1, …, d }∈(ℝ^2)^d. We will prove that \n\n    𝔼[ exp( i∑_k=1^d u_k logS^ϵ_t_k/S_0 + i∑_k=1^d v_k V̅_t_k^ϵ) ] ϵ→ 0⟶𝔼[ exp( i∑_k=1^d u_k X_t_k + i∑_k=1^d v_k Y_t_k) ].\n\nFirst, we recover the finite-dimensional distributions of (logS^ϵ_T/S_0, V̅^ϵ_T ) from (<ref>) by setting  the bounded and measurable functions f and g to be equal to\n\n    f(s) := i∑_k=1^d 1_[t_k-1, t_k)(T-s) ∑_k=j^d u_j     \n        g(s)  := i∑_k=1^d 1_[t_k-1, t_k)(T-s) ∑_k=j^d v_j.\n\n Notice indeed that\n\n    i ∑_k=1^d u_k logS^ϵ_t_k/S_0 + i∑_k=1^d v_k V̅_t_k^ϵ   =  i∑_k=1^d (logS^ϵ_t_k/S_0-logS^ϵ_t_k-1/S_0) ∑_j=k^d u_j + i∑_k=1^d (V̅_t_k^ϵ-V̅_t_k-1^ϵ) ∑_j=k^d v_j \n       =  ∫_0^T f(T-s) dlogS^ϵ_s + ∫_0^T g(T-s) d V̅_s^ϵ,\n \nand that  the corresponding ψ_0 defined in (<ref>) has bounded variations (being piece-wise constant for this choice of f and g), so that an application of the convergence of the characteristic functional in (<ref>) yields\n\n    𝔼[ exp( i∑_k=1^d u_k logS^ϵ_t_k/S_0 + i∑_k=1^d v_k V̅_t_k^ϵ) ] ⟶exp( ϕ_0(T) ),\n\nwith\n     \n    ϕ_0(T) \n            = \n        V_0 ∑_k=1^d (t_k -  t_k-1) (iv̅_k- u̅_k^2 + iu̅_k/2) ,       H>-1/2,\n    ( θ + V_0 ) ξ^-2∑_k=1^d(t_k -  t_k-1) ( 1 - ρξ iu̅_k + √(( 1 - ρξ iu̅_k)^2 - 2 ξ^2 (iv̅_k- u̅_k^2+iu̅_k/2))),      H=-1/2, \n    \n        -θξ^-1∑_k=1^d (t_k -  t_k-1) ( ρ iu̅_k + √(-ρ^2 u̅_k^2 - 2 (iv̅_k- u̅_k^2+iu̅_k/2))),       H<-1/2,\n\nwhere we defined u̅_k := ∑_j=k^d u_j, v̅_k := ∑_j=k^d v_j.\n\n\nSecond, we identify such ϕ_0(T) with the corresponding finite-dimensional distributions of the NIG-IG process ( X, Y ) with parameters (α, β, μ, δ,λ) as in (<ref>) depending on the regime of H. We denote by   η its Lévy exponent, recall  (<ref>), and we write \n\n    𝔼[ exp( i∑_k=1^d u_k X_t_k + i∑_k=1^d v_k Y_t_k) ]     = 𝔼[ exp( i∑_k=1^d (X_t_k-X_t_k-1) ∑_j=k^d u_j + i∑_k=1^d (Y_t_k-Y_t_k-1) ∑_j=k^d v_j) ]\n        = ∏_k=1^d 𝔼[ exp( (X_t_k-X_t_k-1) i∑_j=k^d u_j + (Y_t_k-Y_t_k-1) i∑_j=k^d v_j) ]\n        = ∏_k=1^d 𝔼[ exp( X_t_k-t_k-1 i∑_j=k^d u_j + Y_t_k-t_k-1 i∑_j=k^d v_j) ]\n        = exp( ∑_k=1^d ( t_k - t_k-1) η( u̅_k, v̅_k ) )\n\nusing respectively telescopic summation, the independence of increments, the fact that ( X_t_2, Y_t_2) - ( X_t_1, Y_t_1) law=( X_t_2-t_1, Y_t_2-t_1) and the definition of the characteristic function of ( X_t_k-t_k-1, Y_t_k-t_k-1) for all k ∈ 1, …, d to get the successive equalities. Using the parameters  (α, β, μ, δ,λ) as in (<ref>)  it is immediate to see that  \n\n    ∑_k=1^d ( t_k - t_k-1) η( u̅_k, v̅_k ) = ϕ_0(T),\n\nhence the desired convergence (<ref>).\n\n\n\n\n §.§ Weak-convergence of the integrated variance process for the M_1 topology\n \n\nIn this section, we prove the weak convergence stated in Theorem <ref> of the integrated variance process V̅^ϵ with sample paths in C([0,T], ℝ^+) to the Lévy process V̅^0 whose Lévy exponent is given by v ↦η(0,v) with η defined in (<ref>) and with sample paths valued in the càdlàg functional space D := 𝒟([0,T], ℝ^+)) endowed with Skorokhod's Strong M1 (SM_1) topology. There will be two subsections: first, in Section <ref> we recall briefly the definition of the Strong M1 (SM_1) topology as well as some associated convergence results, and then we prove the tightness of the integrated variance in Section <ref>.\n\n\n\n  §.§.§ Reminder on the SM_1 topology and conditions for convergence\n \n\nWe recall succinctly key definitions and convergence theorems for the M_1 topology. We refer the reader to the key reference book <cit.> for more details.  For x ∈ D, we define the thin graph of x as\n\n    Γ_x := { (z,t) ∈ℝ×[ 0, T ]: z ∈[ x(t^-), x(t) ] },\n\nwhere, for t ∈[ 0,T ], [ x(t^-), x(t) ] denotes the standard segment {α x(t^-) + ( 1 - α)  x(t), 0 ≤α≤ 1 }, which is different from a singleton at discontinuity points of the càdlàg sample trajectory x. We denote Disc(x) the set of such instants. Define on Γ_x the strong order relation as follows: (z_1,t_1) ≤(z_2,t_2) if either t_1<t_2 or t_1=t_2 and |x(t_1^-)-z_1| ≤|x(t_1^-)-z_2|. Furthermore define a strong parametric representations of x as a continuous non-decreasing (with respect to the previous order relation) function ( x̂, r̂) mapping [ 0,1 ] into Γ_x such that ( x̂(0), r̂(0) ) = ( x(0),0 ) and ( x̂(T), r̂(T) ) = ( x(T),T ). We say the component r̂ scales the time interval [ 0,T ] to [ 0,1 ] while x̂ time-scales x, and we denote by Π_s(x) the set of all strong parametric representations of x. Finally, the strong M1 topology is the topology induced by the metric d_s defined as\n\n    d_s( x_1, x_2) := ( x̂^i, r̂^i) ∈Π_s(x^j), j=1,2inf{| x̂^1 - x̂^2| ∨| r̂^1 - r̂^2| }.\n\n\n\nBelow we mention briefly five theorems in a row that eventually yields criteria to prove the desired convergence.\n\n\n    D := D([0,T], ℝ^+) endowed with the SM_1 topology is Polish, i.e. metrizable as a complete separable metric space.\n\n\n\n    Let (S,m) be a metric space. If a subset A in 𝒫(S) is tight, then it's relatively compact. On the other hand, if the subset A is relatively compact and the topological space is Polish, then A is tight.\n\n\nThe first two theorems ensure that, since (D,SM_1 ) is Polish, proving relative compactness of any family of probability measures on such space is sufficient to ensure the existence of a convergent sub-sequence. Finally the convergence of finite-dimensional laws allows to uniquely determine its limit as formulated in the following theorem.\n\n Let ( ( X_n)_n∈ℕ, X ) be random functions defined on a common filtered probability space ( Ω, ( ℱ_t )_t, ℙ). Then, X_n ⇒ X in D for the SM_1 topology if the following conditions hold:\n\n        \n  * (X_n)_n∈ℕ is tight with regards to the SM_1 topology.\n        \n  * The finite dimensional distributions of X_n converge to those of X on T_X, where:\n        \n    T_X := { t > 0, ℙ(t ∈ Disc(X) ) = 0 }∪{T}.\n\n        \n    \n\n\nTo conclude this section, we recall a characterization of tightness for a sequence of probability measures.\n\n\nThe sequence of probability measures {ℙ_n }_n ≥ 1 on (D,SM_1) is tight if and only if:\n\n    \n  (i) ∀ε̅>0, ∃ c < ∞, ∀ n ≥ 1, ℙ_n ( { x ∈ D: ||x|| > c }) < ε̅\n    \n  (ii) ∀ε̅>0, ∀η > 0, ∃δ>0, ∀ n ≥ 1, ℙ_n ( { x ∈ D: w'(x,δ) ≥η}) < ε̅\n\nWhere we defined for x ∈ D, t∈ [0,T] and δ>0:\n\n    ||x||     := t ∈ [0,T]sup |x_t|,\n    \n        w'(x,δ)    := w(x,δ) ∨v̅(x,0,δ) ∨v̅(x,T,δ) ,\n    \n        w(x,δ)    := t ∈ [0,T]sup w_S(x,t,δ), \n    \n        w_S(x,t,δ)    := 0 ∨ t-δ≤ t_1 < t_2 < t_3 ≤ (t+δ) ∧ Tsup| x(t_2)-[ x(t_1), x(t_3)] |, \n    v̅(x,t,δ)    := 0 ∨ t-δ≤ t_1 ≤ t_2 ≤ (t+δ) ∧ Tsup| x(t_1)-x(t_2) |.\n\n\n\n\n\n  §.§.§ Convergence of the integrated variance process\n\n\nWe already proved in Section <ref> the convergence of finite dimensional distributions as ϵ goes to zero of V̅^ϵ toward those of either the deterministic linear, or the Inverse Gaussian, or the Lévy process denoted Y depending respectively on the value of the Hurst index with Lévy exponent η(0,·) from (<ref>) with the respective parameters given in Theorem <ref>. Consequently, all that remains to prove is the tightness of the family of processes ( V̅^ϵ)_ϵ>0 for the SM_1 topology to get the desired convergence result as a direct consequence of Theorem <ref>. We will apply the characterization Theorem <ref> of tightness in SM_1 to conclude, and more precisely, we will see that the criteria of tightness within the SM_1 topology simplifies greatly for almost surely non-decreasing and continuous stochastic processes in general.\n\n\n\n\n\n\n\n\n\n\n\nFix ε̅> 0. Since, for all ϵ>0, V̅^ϵ is almost surely non-decreasing and non-negative, we have that, for all ω∈Ω\n\n    ||V̅^ϵ(ω)||    = V̅_T^ϵ(ω), \n    \n    w'(V̅^ϵ(ω)), δ)    = 0∨V̅^ϵ_δ(ω) ∨( V̅^ϵ_T(ω) - V̅^ϵ_T-δ(ω)),   δ >0.\n\nThis yields that, for a threshold c>0 big enough, the probability in condition (i) on the measures ℙ_ϵ := ℙ_(V̅_t^ϵ)^-1 reduces to\n\n    ℙ_ϵ( { x ∈ D, ||x|| > c }) = ℙ( {ω: ||V̅_.^ϵ(ω)||>c }) = ℙ( V̅_T^ϵ>c ) ≤sup_ϵ>0ℙ( V̅_T^ϵ>c ) < ε̅,\n\nwhere the last inequality is satisfied by tightness of the family ( V̅_T^ϵ)_ϵ>0 of random variables in  which is obtained as a direct consequence of Lévy's continuity theorem, recall that  ( V̅_T^ϵ)_ϵ>0 has been shown to converge in Section <ref>. This yields (i). In addition, regarding the second condition (ii), set an arbitrary η>0, then the oscillation function w' simplifies to\n\n    ℙ_ϵ( { x ∈ D: w'(x,δ) ≥η})      = ℙ( 0 ∨|V̅_δ^ϵ| ∨|V̅_T^ϵ - V̅_T-δ^ϵ| ≥η) < ε̅,\n\nwhere we take δ small enough to ensure the last inequality by stochastic continuity of V̅^ϵ.\n\n\n    Since log S^ϵ = - 1/2V̅^ϵ + ρ W_V̅^ϵ + √(1-ρ^2) W^⊥_V̅^ϵ, and composition is not continuous in ( D, M_1 ) (see <cit.>), we cannot expect the tightness of the log price within SM_1.\n\n\n\n\n\n\n§ SOME LEMMAS\n\n\n \n    (Uniqueness of the complex root with a non-positive real part) \n    Take ξ>0. For all f, g bounded and measurable with f =  g = 0, t ∈[ 0,T ] and ρ∈[ -1,1 ], both polynomials \n    \n    \n    P(X)     := ξ^2/2 X^2 - ( 1 - ρξ f(t) ) X + g(t) + f^2(t) - f(t)/2\n    \n            Q(X)     := ξ^2/2 X^2 + ρξ f(t) X + g(t) + f^2(t) - f(t)/2\n\n    admit exactly two roots with respective real parts of strict opposite signs if ( f(t), g(t) ) ≠( 0, 0 ), and if ( f(t), g(t) ) = ( 0, 0 ), then the polynomial P has roots 0 and 2/ξ^2, while Q has 0 as a double root.\n\n\n\n    Let us detail the proof for P, similar arguments will apply to Q. By d'Alembert-Gauss theorem, the polynomial P admits exactly two roots expressed as:\n    \n    \n    {ξ^-2( 1 - ρξ f(t) ±√(( 1 - ρξ f(t) )^2 - 2 ξ^2 ( g(t) + f^2(t)-f(t)/2))) },\n\n    where we take the principal square root in the expression above, i.e.with non-negative real-part. Consequently, the roots have real parts\n    \n    \n    {ξ^-2( 1 ±(√(( 1 - ρξ f(t) )^2 - 2 ξ^2 ( g(t) + f^2(t)-f(t)/2))) ) },\n\n    so that it remains to show | (√(( 1 - ρξ f(t) )^2 - 2 ξ^2 ( g(t) + f^2(t)-f(t)/2))) | > 1.\n\n    \n    Denote δ=a+ib, a,b ∈ℝ such that δ^2 = ( 1 - ρξ f(t) )^2 - 2 ξ^2 ( g(t) + f^2(t)-f(t)/2), then it follows that a and b satisfy\n    \n    \n    a^2 - b^2     = 1 + ( 1 - ρ^2 ) ( ξ f(t) )^2, \n    \n                ab     = - ( ρξ f(t) + ξ^2 (  g(t) -  f(t)/2) ).\n\n    \n    If ρ≠± 1, then the result is immediate from the first inequality in (<ref>), while if ρ = ± 1, then |a| = √(1+b^2) and b cannot be zero, otherwise δ^2 = a^2 = 1 - 2i( ρξ f(t) + ξ^2 (  g(t) -  f(t)/2) ) which cannot be the case, since a ∈ℝ and ( f(t),  g(t)) ≠( 0, 0 ).\n\n\n \n    Let f and g be bounded measurable functions such that f =  g = 0. Then there exists a finite positive constant C such that the ratio\n    \n    γ(s) := |ψ_0(s)|/- ψ_0(s)≤ C, ∀ s ∈ E,\n\n    where the set E is given by\n    \n    E := { s ∈ [0,T], ( f(s), g(s) ) ≠( 0, 0 ) },\n\n    and ψ_0 is given in (<ref>) in the case H<-1/2.\n\n\n\n    We start by explicitly computing the real and imaginary parts of ψ_0 in the case H<-1/2, whose expression is given anew by\n    \n    ψ_0(s) = - ξ^-1( ρ f(s) + √(f(s) ( 1 - ( 1- ρ^2 ) f(s) ) - 2 g(s))),    s ∈ [0,T].\n\n    Set the real functions a and b such that, for any s ∈ [0,T]\n    \n    a(s) + i b(s) = √(f(s) ( 1 - ( 1- ρ^2 ) f(s) ) - 2 g(s)),\n\n    square the above equality, identify the real and imaginary parts, find a unambiguously on E (which imposes a ≠ 0) as a root to a fourth-degree polynomial knowing the square roots in (<ref>) are principal (i.e. with positive real parts), then deduce the associated b, such that\n    \n    a     = √(1/2( ( 1 - ρ^2 )(  f )^2 + √(( 1 - ρ^2 )^2(  f )^4 + (  f - 2  g)^2))), \n    \n            b     = 1/2 f -  g/a.\n\n\n    Consequently, we get explicitly on E\n    \n    ψ_0 = ψ_0 + i ψ_0,\n\n    with\n    \n    ψ_0     = -ξ^-1 a,\n    ψ_0     = -ξ^-1( ρ f + 1/2 f -  g/a).\n\n    \n    Rewrite γ as\n    \n    γ = √( 1 + γ̃^2),   γ̃:= ψ_0/ψ_0,\n\n    and we can readily discard the case ρ=0 and f - 2  g=0, since ψ_0 = 0 in that case and the ratio simplifies into 1 which yields the result. Assume from now on that ρ≠ 0 or f - 2  g ≠ 0. We can write\n    \n    γ̃= A(  f,  g ) + B(  f,  g ),\n\n    with\n    \n    A(  f,  g )     := ρ f/√(1/2( ( 1 - ρ^2 )(  f )^2 + √(( 1 - ρ^2 )^2(  f )^4 + (  f - 2  g)^2))),\n    B(  f,  g )     := 1/2 f -  g/1/2( ( 1 - ρ^2 )(  f )^2 + √(( 1 - ρ^2 )^2(  f )^4 + (  f - 2  g)^2)),\n\n    so that there are three remaining cases for which it is sufficient to show that both A(  f,  g ) and B(  f,  g ) are bounded to conclude the proof.\n    \n        \n  * Case ρ≠ 0 and f - 2  g = 0, then\n        \n    A(  f,  g )     = ρ/√(1-ρ^2),\n    B(  f,  g )     = 0,\n\n        are both bounded, recall ρ∈ (-1,1).\n\n        \n  * Case ρ = 0 and f - 2  g ≠ 0, then\n        \n    A(  f,  g )     = 0,\n    B(  f,  g )     = 1/2 f -  g/1/2( (  f )^2 + √((  f )^4 + (  f - 2  g)^2)),\n\n        and B(  f,  g ) is bounded since ( x, y ) ↦B( x, y ) is continuous on any compact set of ℝ^2\\{(0,0)} (recall both f and g are bounded) and has a finite limit at (0,0), valued 1, indeed\n        \n    B( x, y ) = 1/( 1-ρ^2) x^2/x-2y + √(( 1-ρ^2)^2x^4/( x-2y )^2+1)x-2y ≠ 0(x,y) →(0,0)⟶ 1.\n\n\n        \n  * Case ρ≠ 0 and f - 2  g ≠ 0, then\n        \n    A(  f,  g )     = ρ f/√(1/2( ( 1 - ρ^2 )(  f )^2 + √(( 1 - ρ^2 )^2(  f )^4 + (  f - 2  g)^2))),\n    B(  f,  g )     = 1/2 f -  g/1/2( ( 1 - ρ^2 )(  f )^2 + √(( 1 - ρ^2 )^2(  f )^4 + (  f - 2  g)^2)),\n\n        are both bounded by continuity of ( x, y ) ↦A( x, y ) and ( x, y ) ↦B( x, y ) \n        on any compact set of ℝ^2\\{(0,0)} (recall both f and g are bounded) and both functions have a finite limit at (0,0), valued 0 and 1 respectively, obtained with similar arguments as in the previous case.\n    \n\n\n\n \n(Inverse Gaussian, Lévy and NIG-IG distributions)\n    \n        \n  * We say X follows a Normal Inverse distribution, denoted X ↪IG( μ, λ) if its probability density writes\n    \n    f(x) = √(λ/2π x^3)exp( -λ( x-μ)^2/2 μ^2 x),\n\n    where μ∈ℝ, λ>0, or equivalently if the following equality holds true\n    \n    𝔼[ exp( w X ) ] = exp( λ/μ( 1 - √(1-2μ^2 w/λ)) ),    w ∈ℂ,    w ≤ 0.\n\n\n    \n  * We say τ follows a Lévy distribution, denoted τ↪Lévy( μ, c), if its probability density writes\n    \n    √(c/2π)e^-c/2(x-μ)/( x-μ)^3/2,\n\n    where μ∈ℝ, c>0, or equivalently if the following equality holds true\n    \n    𝔼[exp( w τ)] = exp( μ w - √(-2c w)),    w ∈ℂ,    w ≤ 0.\n\n\n    \n  * We say ( X, Y ) follows a Normal Inverse Gaussian - Inverse Gaussian distribution, denoted ( X, Y ) ↪NIG-IG( α, β, μ, δ, λ), if its characteristic function writes\n    \n    𝔼[ exp( iu X + iv Y ) ] = exp[ i μ u + δ( √(α^2 - β^2) -√(α^2 - 2iλ v -( β + iu )^2)) ],    u, v ∈ℝ,\n\n    \n\n\n\n\n§ ADDITIONAL PLOTS\n \n\n\n\n\n\nplainnat\n\n\n\n\n"}