{"entry_id": "http://arxiv.org/abs/2303.07218v1", "published": "20230313155250", "title": "Chow rings of unimodular triangulations", "authors": ["Mykola Pochekai"], "primary_category": "math.CO", "categories": ["math.CO"], "text": "\nLower (negative) bounds on the static electric susceptibility of non-equilibrium cubic crystals\n    F. Castles\n    March 30, 2023\n===============================================================================================\n\n\n    We will construct the Chow rings for unimodular triangulations and prove that if a polytope admits a unimodular triangulation, such that the closed star of every interior point is a convex polytope, the intersection of the closed stars of any collection of interior points is a full-dimensional polytope, and every interior point is connected with a point on the boundary via an edge of the triangulation, then its Ehrhart δ-vector is unimodal.\n\n\n\n§ INTRODUCTION\n\nBy a lattice polytope we mean the convex hull of a finite number of points in ^N. All polytopes mentioned in the paper are lattice polytopes.  By ∂ P we mean the boundary of P relative to the affine hull of P, which we denote as (P) or P, and by P we mean the interior of P relative to P. Consider a d-dimensional  polytope P ⊂^N. The Ehrhart series of P is defined as\n\n    _P(t) = ∑_k = 0^∞ t^k |kP ∩^N|\n\nwhere kP is a dilation of P by a factor of k. It is known that there exist integers δ_0,…,δ_d ≥ 0 such that \n\n    _P(t) = δ_0 + δ_1 t + ... + δ_d t^d/(1-t)^d+1\n\nas stated in the <cit.>. The polynomial δ_0 + ... + δ_d t^d is called the δ-polynomial of P and the vector (δ_0,...,δ_d) is called the δ-vector of P. It is not necessarily true that δ_d ≠ 0, and we refer to <cit.> for more information on the degree of the δ-polynomial. In some sources, the terms \"the h^*-polynomial\" and \"the h^*-vector\" are used instead, like in <cit.>. It follows from the definition that δ_0 = 1, δ_1=|P ∩^N| - (d+1), and from Ehrhart reciprocity  that δ_d = |relint(P) ∩^N| <cit.>. Despite the fact that one can find expressions for δ_k from the definition, a deeper understanding of the δ-vector is desired. \n\nOne way to gain a deeper understanding of the δ-vector is by studying polytopes for which it exhibits interesting combinatorial-numerical properties, such as symmetricity (δ_i = δ_d-i) or unimodality (δ_0 ≤δ_1 ≤ ... ≤δ_c ≥δ_c+1≥ ... ≥δ_d for some 0 ≤ c ≤ d). The symmetricity question has been fully resolved by Hibi, showing it holds exactly when P is a reflexive polytope, and now is the standard part of the Ehrhart theory <cit.>. Here a reflexive polytope is a full-dimensional lattice polytope P ⊂^n with 0 in the interior such that the dual polytope, defined by the formula\n\n    P^∨ = { r ∈^n : (r,p)+1 ≥ 0,  forall  p ∈ P}\n\nis also a lattice polytope.\n Hibi conjectured in <cit.> that if a polytope P is reflexive, then its δ-vector is unimodal. However, this conjecture was proven false by Mustață and Payne <cit.>, who discovered a counterexample in dimension 6. The polytope found by Mustață and Payne does not satisfy the following not-so-restrictive condition:\n\n\n    A lattice polytope P ⊂^N is called integrally closed if for every k ≥ 1, (kP) ∩^N = (P ∩^N) + ... + (P ∩^N), where the sum is in the Minkowski sense.\n\n\nSometimes, this condition is referred to as IDP, as in <cit.>. So, it makes sense to ask the following question: \n\n(Unimodality Question) \n    Is it true that the δ-vector of an integrally closed lattice polytope P is always unimodal? \n\n\n\n\nThere are extensive mathematical and historical discussions of Question <ref> in the literature, we refer the reader to <cit.> for an overview and further references. The following theorem represents state of the art on the unimodality question:\n\n <cit.> \n    If P is a reflexive, integrally closed polytope of dimension d, then \n    \n    δ_0 ≤ ... ≤δ_⌊d/2⌋ = δ_⌈d/2⌉≥ ... ≥δ_d\n\n    holds. If P is an integrally closed polytope of dimension d, then\n    \n    δ_⌈d/2⌉≥ ... ≥δ_d\n\n    holds. If P ⊂^d is an integrally closed polytope of dimension d with (P ×{1}) ∩^d+1 generated at height ≤ j then \n    δ_0 ≤ ... ≤δ_⌈d - j/2⌉\n \n    holds. \n\nTo elaborate on the statement, \"generated at height ≤ j\" means that the semigroup (P ×{1}) ∩^d+1 is generated by the set (P ×{1}) ∩{(x_1,...,x_d,t) ∈^d+1: t ≤ j}).\n\nWe would like to highlight some additional results pertaining to the properties of the δ-vector. In <cit.>, it is shown that a lattice parallelepiped has a unimodal δ-vector. Furthermore, according to <cit.>, any integrally closed polytope of dimension ≤ 4 also has a unimodal δ-vector. Additionally, <cit.> demonstrates that if a polytope P has a special type of triangulation, known as a box unimodal triangulation and defined in <cit.>, then its δ-vector is also unimodal.\n\nMoreover, in <cit.>, some additional linear inequalities on the δ-vector of an integrally closed polytope have been established. Finally, in <cit.>, a method for constructing new integrally closed simplices with a unimodal δ-vector from existing ones is presented. \n\nDespite the established unimodality of the δ-vector for reflexive integrally closed polytope in Theorem  <ref>, the general case of Question <ref> remains open. In this paper, we will prove the following theorem.\n\n\n    Let P ⊂^N be a lattice d-polytope, which admits a regular  unimodular triangulation T (see Definition <ref>, Definition <ref>). if T satisfies the following three properties:\n    \n        \n  * (Boundary points connected to interior points) For every point on the relative boundary p ∈∂ P ∩^N, there exists a point in the relative interior q ∈relint(P) ∩^N such that {p,q}∈ T.\n        \n  * (Čech complex condition) For every tuple of lattice points in the relative interior p_1,...,p_r ∈relint(P), we have ((p_1) ∩ ... ∩(p_r)) = d, where (p) = ⋃_p ∈σ, σ∈ Tσ is the closed star in T. \n        \n  * (Polytopial condition) For any point in the relative interior p ∈relint(P) ∩^N, the (p) is a convex polytope.\n    \n    then δ_0 ≤ ... ≤δ_⌈d/2⌉.\n\n\n Unimodular triangulations satisfying the three properties above will be referred to as triangulations induced by interior points, or ibip triangulations for short (see Definition <ref> and Figures <ref>, <ref>). Using additionally <cit.> or, alternatively, \n <cit.>, which says that if polytope admits regular unimodular triangulation then the δ-vector is unimodal, we will obtain the next corollary:\n\n\n    Let P ⊂^N be a d-dimensional polytope that admits a regular, unimodular, ibip triangulation. Then, the δ-vector is unimodal, specifically: \n    \n    δ_0 ≤δ_1 ≤ ... ≤δ_⌊d/2⌋ = δ_⌈d/2⌉≥ ... ≥δ_d\n\n\n\nThe next example demonstrates that Theorem <ref> and Corollary <ref> are not formal consequences of Theorem <ref>. Specifically, we need to show that there exists a d-dimensional polytope P ⊂^d that admits a regular, unimodular, ibip triangulation, but the semigroup ((P ×{1})) ∩^d+1⊂ℝ^d+1 is not generated at height 1. This property is satisfied by the 2-dimensional polygon shown in Figure <ref>, which has two interior points and its dilation by a factor of 2 has 5 interior points. Therefore, the cone ((P ×{1})) ∩^d+1⊂ℝ^d+1 cannot be generated at degree 1.\n\n\n\n\nTo prove the result, we will construct the Chow ring A^*(T) of a unimodular triangulation T by performing an Artinian reduction on the corresponding Stanley-Reisner ring [T]. We call them Chow rings because there is a tradition of referring to similar ring constructions as Chow rings, as can be seen in <cit.>. Additionally, these rings are closely related to the Chow rings of toric varieties, as specified in Theorem <ref>. It should be noted that Theorem <ref> discusses cohomology instead of Chow rings, but for simplicial complete toric varieties, the cohomology ring is isomorphic to the Chow ring. We will then demonstrate that if the triangulation is regular and ibip, the Chow ring possesses a weak form of Lefschetz element. Specifically, we will construct an element ϕ∈ A^1(T) such that multiplication by an appropriate power of ϕ induces an injective morphism A^i(T) → A^d-i(T) for each i ≤⌈d/2⌉. This is analogous to the Hard Lefshetz theorem for algebraic varieties. \n\n\n\n\nThe idea of using a Hard Lefschetz-like theorem for a Chow-type ring constructed from combinatorial configurations is a widely-used technique in combinatorics, as demonstrated by works such as <cit.>. Braun and Davis <cit.> have already applied this idea in the context of the Unimodality Question <ref>, albeit in a slightly different setting. They investigated the quotients of the semigroup algebra of a polytope by a system of parameters. In contrast, we study the quotient of the Stanley-Reisner algebra of a triangulation by a regular sequence. Our Chow ring is a generalization of the Chow ring of a smooth resolution of a Gorenstein Fano toric variety, as it corresponds to a unimodular star triangulation of a reflexive polytope, as shown in Proposition <ref>. In <cit.>, the authors also used quotients of the semigroup algebra of a polytope by a general enough linear system of parameters and applied a Hard Lefschetz-like theorem to obtain unimodality results. \n\nThe author is grateful to Peter Bränden for pointing out the useful reference.\n\n\n\n\n\n§ CHOW RING OF UNIMODULAR TRIANGULATION\n\n\n\nWe will remind the reader of some basic definitions.\n\n\n\n  \n    A unimodular triangulation T of a polytope P ⊂^N is a set T of affine simplices in ^N that satisfies the following properties:\n    \n        \n  * (Union property) ⋃_σ∈ Tσ = P.\n        \n  * (Downwards closure property) If σ∈ T and σ' ⊂σ is a face of σ, then σ' ∈ T.\n        \n  * (Proper intersection property) If σ', σ”∈ T, then σ' ∩σ” is a common face of σ' and σ”.\n        \n  * (Unimodularity property) For every σ∈ T, the set of vertices |(σ) could be completed to an affine basis of ^N.\n    \n\n\n If the set T satisfies only first three properties, then T is called just triangulation. Notice that in our definition the empty simplex ∅ is also considered as an affine simplex of dimension -1 with the empty set of vertices. The empty simplex is a face of any other simplex, including itself. Now, we can introduce our two main players.\n\n\n(Definition of Stanley-Reisner ring)\n    Let T be a unimodular triangulation of a polytope P ⊂^N. The next ring\n    \n    [T] = [x_p : p ∈ P ∩^N]/I\n\n    \n    I := (x_p_1 ... x_p_r : r ≥ 0, {p_1,...,p_r}∉T)\n\n    is called Stanley-Reisner ring of a unimodular triangulation T.\n\n\n\n\nThe definition is taken from <cit.>. The definition is valid for any simplicial complex. Stanley-Reisner rings have been widely studied in Stanley-Reisner theory, see <cit.>. The definition of [T] depends only on the combinatorial type of T and does not depends on how P is embedded into ^N. Usually, Chow rings for combinatorial structures are defined as quotients of something like Stanley-Reisner rings by some natural homogeneous system of parameters, see <cit.>. In our case we will do the same.\n\n  Let T be unimodular triangulation of a polytope P ⊂^N. The next ring\n    \n    A^*(T) := [x_p : p ∈ |T| ∩^N]/I + J\n\n    \n    I := (x_p_1 ... x_p_r : r ≥ 0, {p_1,...,p_r}∉T)\n\n    \n    J := (∑_p ∈ P ∩^Nϕ(x_p) x_p : ϕ : ^N → is an affine function )\n\n    will be called the Chow ring of T. \n\nRings [T] and A^*(T) are naturally -graded by the condition (x_p) = 1. Definitions <ref> and <ref> are given only for polytopes embedded in ℝ^N. However, a similar definition could be given for any abstract affine real space with an integral-affine structure. This observation will be used in Proposition <ref>.\n\nIf P is a polytope with an unimodular triangulation T, we will write A^*(P) instead of A^*(T) if the triangulation T is clear from the context. It should be noted that the Definitions <ref> and <ref> could be given for any triangulation, not just unimodular ones. However, for our purposes, it suffices to only consider unimodular triangulations. Additionally, it is important to note that J is generated by N+1 elements \n\n    f_0 :=∑_p ∈ P ∩^N x_p\n \n\n    f_1:=∑_p ∈ P ∩^N (e_1,p) x_p\n \n\n    ...\n\n\n    f_N:=∑_p ∈ P ∩^N (e_N,p) x_p\n \nwhere e_1,...,e_N is the standard basis of ^N. The elements f_0,...,f_N would be referred as the standard generators of the ideal J. The next proposition shows that the ring A^*(T) does not depend on the ambient space.\n\n\n    Let T be a unimodular triangulation of a d-polytope P ⊂^N. Let A^*(T,^N) be the Chow ring of the triangulation T of the polytope P considered as an embedded polytope in ^N. Let A^*(T,(P)) be the Chow ring of the polytope P considered as a subset of the affine space (P) with the natural integral-affine structure. Then there is the natural isomorphism A^*(T,^N) ≅ A^*(T,(P)).\n\n\n\n    By Definition <ref> and the remark following the definition, we have\n    \n    A^*(T,^N) = [x_p : p ∈ P ∩^N]/I + J\n\n    \n    A^*(T,(P)) = [x_p : p ∈ P ∩^N]/I + J'\n\n    where \n    \n    J = (∑_p ∈ P ∩^Nϕ(p)x_p  : ϕ : ^N → is an affine function)\n\n    \n    J' = (∑_p ∈ P ∩^Nϕ(p) x_p : ϕ : (P) ∩^N → is an affine function)\n\n    We observe that J=J', since ϕ is only evaluated on P and any affine function on (P) ∩^N can be extended (possibly non-uniquely) to an affine function defined on the whole ^N.\n\n\nThe next thing which we want to show is that pullbacks via embeddings of subpolytopes are well-defined. It will be a crucial instrument in the proof of Theorem <ref>.\n\n    Let T' be a unimodular triangulation of a polytope P' ⊂^N and T” be a unimodular triangulation of a polytope P”⊂^M. Suppose there exists an injective -affine map ψ : ^N →^M, which maps every simplex of the triangulation T' affine-isomorphically onto some simplex of the triangulation T”. Then there is the canonical pullback morphism ψ^*: A^*(T”) → A^*(T') defined in the next way on the generators\n    \n    ψ^*(x_p”) = x_ψ^-1(p”) for any  p”∈ P” or  0  if p” not in the image of ψ\n\n\nNotice, that attempt to define a pushforward map via the formula ψ_*(x_p) = x_ψ(p) will fail. Namely, defined in such a way pushforward could map an expression that represents 0 to an expression that represents a nonzero element.\n    \n    \n    \n    \n    \n\n    Let\n    \n    A^*(T”) = [x_p” : p”∈ P”∩^M]/I”+J”\n\n    \n    A^*(T') = [x_p' : p' ∈ P' ∩^N]/I'+J'\n\n    be the corresponding Chow rings. The ψ^* map is well-defined as a map between the polynomial rings [x_p” : p”∈ P”∩^M] →[x_p' : p' ∈ P' ∩^N] To show ψ^*(I”) ⊂ I', we notice that ψ^* maps generators of I” to I'. Indeed, since T' is a sub-triangulation of T” via the map ψ, it has fewer faces than T”. Saying the same differently, T' have more nonfaces than T”.\n    \n    To show ψ^*(J”) ⊂ J', we will show that the image ψ^*(x”) of a general degree 1 element x” is contained in J'. Since J” is generated by degree 1 elements, ψ^*(J”) ⊂ J' will follow. Let\n    \n    x” =∑_p”∈ P”∩^Mϕ(p”) x_p”, ϕ : ^M → is an affine function\n be an element of J”. Direct computation shows\n    \n    ψ^*(x”) = ∑_p”∈ P”∩^Mϕ(p”) ψ^*(x_p) = ∑_p' ∈ P' ∩^Nϕ(ψ(p')) x_ψ(p')\n\n    Since ϕ∘ψ : ^N → is an affine function, we have ψ^*(x”) ∈ J'. \n\n\n\n\n\n§ CHOW RING OF UNIMODULAR REGULAR TRIANGULATION\n\nWe consider unimodular triangulations for a reason: the dimension vector of the Chow ring of a unimodular triangulation is precisely the Ehrhart δ-vector of this triangulation, as we will soon show in Theorem <ref>. However, for this result to hold, we must assume that the triangulation is regular. The regularity assumption will also be used in the Hard Lefschetz type argument in Theorem <ref>.\n\n  \n(Definition of regular triangulation) We say that a triangulation T of a polytope P ⊂^N is regular if there exists T-piecewise-affine convex function ϕ : P → such that its restriction to different maximal simplices of T corresponds to different elements in ^N. Functions with such property are called T-piecewise-affine strictly convex functions. We call ϕ the weight function that witnesses the regularity of T.\n\n\n\n\n\nIn some sources, regular triangulations are also called coherent <cit.> or projective <cit.>. We will remind several definitions from graded commutative algebra. We will work with -graded, connected (with A^0 =), finitely-generated -algebras. The notion of -graded module over an -graded, connected, finitely-generated -algebra can be defined in a standard way. Note that if T is a unimodular triangulation of a polytope P, then both [T] and A^*(T) are -graded, connected, finitely-generated -algebras, with grading (x_p) = 1, p ∈ P ∩^N. We will use the definitions of graded Cohen-Macaulay R-modules, homogeneous system of parameters and M-regular sequence from <cit.>.\n\nIt is worth to mention, that graded version of the Cohen-Macaulay definition, taken from <cit.>, is equivalent to the standard non-graded definition for R and M considered as non-graded -algebra and non-graded R-module <cit.>. Indeed, from the definitions follows, that -graded, finitely-generated, connected -algebra R is a special case of a ^*local Noetherian ring  <cit.> with a ^*maximal ideal 𝔪 = R^1 + R^2 + R^3 + …. <cit.> states that a finite -graded R-module M is Cohen-Macaulay in the standard non-graded sense if and only if M_𝔪 is Cohen-Macaulay in the standard non-graded sense. Unpacking the last sentence, this is equivalent to the existence of a maximal M-regular sequence a_1,...,a_n ∈ R^1 + R^2 + R^3 + …, but not necessarily a homogeneous one. <cit.> guarantees the existence of a maximal homogeneous M-regular sequence through a reverse induction argument.\n\n Homogeneous system of parameters for M always exists, see <cit.>. If M is a -graded Cohen-Macaulay module over an -graded, connected, finitely-generated -algebra R, then every homogeneous system of parameters is also a maximal regular M-sequence <cit.>.\n\n We are ready to prove now that, in good situations, the dimension vector of A^*(T) is equal to the Ehrhart δ-vector of P.\n \n \n    (Dimension Theorem) Let T be a unimodular and regular triangulation of a d-dimensional polytope P ⊂^N. We have _ A^i(P,T) = δ_i, 0 ≤ i ≤ d where δ_0,...,δ_d is the δ-vector of the triangulation T. \n\n\n    By Proposition <ref>, we can assume N=d without loss of generality. The Hilbert series of the ring [T] is equal to h_0 + h_1 t + ... + h_d t^d/(1-t)^d+1, where the vector of numbers h_0,...,h_d is the h-vector of the triangulation T. Since the triangulation T is unimodular, the h-vector is equal to the Ehrhart δ-vector <cit.> (note, that Ehrhart δ-vector is called h^*-vector in the reference). Hence, the Hilbert series for [T] is actually δ_0 + δ_1 t + ... + δ_d t^d/(1-t)^d+1. The only remaining task is to prove that the quotient of [T] by the ideal J has the Hilbert series δ_0 + δ_1 t + ... + δ_d t^d. \n    \n    To achieve this goal, it is sufficient to prove that the standard generators f_0,...,f_d of the ideal J form a maximal homogeneous [T]-regular sequence. Indeed, it can be shown through direct computation that the quotient of a graded ring by a degree 1 non-zero divisor multiplies its Hilbert series by (1-t), hence, the quotient by a length d+1 regular sequence multiplies the Hilbert series by (1-t)^d+1. Alternatively, one can refer to <cit.>.\n    \n    For this purpose, it is important to note that the triangulation T is regular and thus shellable via linear shelling <cit.>. As a result, [T] is a -graded Cohen-Macaulay module over itself <cit.>, and every homogeneous system of parameters is a maximal homogeneous [T]-regular sequence <cit.> .\n    \n    By  <cit.>, to check that f_0,...,f_d is a homogeneous system of parameters, it is enough to check that for every d-simplex σ∈ T, the following holds: \n    [σ]/(f_0,...,f_d) =\n where f_0,...,f_d are considered as elements of [σ] via the canonical pullback construction [T] →[σ]. This is indeed true, as the triangulation is unimodular and σ is -affinely isomorphic to the standard d-simplex in ^d. This leads to the following sequence of isomorphisms:\n    [σ]/(f_0,...,f_d) ≅[x_0, x_e_1, ..., x_e_d]/(x_0+x_e_1+...+x_e_d, x_e_1,x_e_2, ..., x_e_d) =\n\n    where e_1,...,e_d is the standard basis of ^d.\n\n\nNotice how the proof of Theorem <ref> uses both regularity (for the Cohen-Macaulayness of [T]) and unimodularity (for h_i=δ_i and [σ]/(f_0,...,f_d) =).  We will now show that our Chow rings have a nice specialization to the context of toric geometry.\n\n\n  \n    Let P ⊂^d be a polytope with a unique interior point that admits a unimodular, regular, star triangulation T with weight function ϕ : P →. Let Σ be the smooth projective fan associated with T, and let X_Σ be the associated smooth projective toric variety. Then there is a canonical isomorphism A^*(T) = H^2*(X_Σ,) and [ϕ] ∈ H^2(X_Σ,) is an ample element. \n\n A triangulation is called star if it can be obtained by coning a triangulation of the boundary from some interior point, as defined in <cit.>. Also, note that if a polytope has a unique interior point and a star triangulation that is unimodular and regular, it implies that the polytope is reflexive.  The associated Gorenstein Fano variety (obtained by coning the faces of polytope P) has a crepant smooth projective desingularization determined by the triangulation T, as shown in <cit.>.\n\nBy element [ϕ] we mean the element \n\n    [ϕ] := ∑_ρ∈Σ_1ϕ(u_ρ) x_ρ\n \nwhere u_ρ is a primitive generator of the ray ρ and Σ_1 is the set of all rays of the fan Σ.\n\n\n\n    Without loss of generality, assume that the unique interior point of P is 0. Consider the ring\n    \n    H^2*(X_Σ,) = [x_p : p ∈∂ P ∩^d]/I_Σ + J_Σ\n\n    \n    I_Σ = (x_p_1 ... x_p_r : { p_1, ..., p_r}∉T; p_1, ..., p_r ∈∂ P ∩^d)\n\n    \n    J_Σ = (∑_p ∈∂ P ∩^dϕ(p) x_p : ϕ : ^d → is linear )\n\n    According to Definition <ref>, we have\n    \n    A^*(T) = [x_p : p ∈ P ∩^d]/I + J\n\n    The ring H^2*(X_Σ,) is the cohomology ring of a toric variety X_Σ <cit.>, and there is a one-to-one correspondence between the sets ∂ P ∩^d and Σ_1. So, we will not distinguish between a ray and the corresponding point on the boundary of P. There is a natural morphism \n    ψ : C[x_p, p ∈ P ∩^d] → [x_p, p ∈∂ P ∩^d]\n\n    defined on the generators as\n    \n    ψ(x_0) = -∑_p ∈ (P ∩^d) ∖{0} x_p\n\n     \n    ψ(x_p) = x_p  for any  p ∈∂ P ∩^d\n\n     Our goal is to show that ψ(I) = I_Σ and ϕ(J) = J_Σ. After performing the direct computation, we obtain ϕ(I) = I_Σ + I_Σ' where\n     \n    I_Σ' = ((-∑_p ∈∂ P ∩^d x_p) x_p_1 ... x_p_r : {0,p_1...,p_r}∉T; p_1,...,p_r ∈ P ∩^d)\n\n    The I_Σ component of ψ(I) comes from simplices in T which do not contain 0, and I_Σ' comes from those simplices that contain 0. However, since the triangulation is star, we have that {0,p_1...,p_r}∉T if and only if {p_1,...,p_r}∉T so we have:\n    \n    I_Σ' = ((-∑_p ∈∂ P ∩^d x_p) x_p_1 ... x_p_r : {p_1...,p_r}∉T; p_1,...,p_r ∈ P ∩^d)\n\n    Therefore, we have the trivial embedding I_Σ' ⊂ I_Σ, so I_Σ' + I_Σ = I_Σ. \n    \n    ψ(J) = ( ∑_p ∈∂ P ∩^d (ϕ(p) - ϕ(0)) x_p : ϕ : ^d → is affine )\n\n    \n    ψ(J) = ( ∑_p ∈∂ P ∩^dϕ(p) x_p : ϕ : ^d → is linear )\n\n    This means that ψ(J) = J_Σ. Thus, ψ induces an isomorphism ψ : A^*(T) → H^2*(X_Σ,). \n    \n    The same type of computation shows that ψ sends T-piecewise-affine strictly convex function ϕ to Σ-piecewise-linear strictly convex function. By <cit.>, we have that element [ϕ] ∈ H^2(X_Σ,) is an ample element. \n \n\n\n\n\n\n§ CHOW RING OF UNIMODULAR REGULAR IBIP TRIANGULATION\n\n\nIn this section, we will prove that if a polytope P admits a special type of triangulation, which we will call ibip, then the δ-vector of P is unimodal. \n\n  (Definition of ibip triangulation)\n     A unimodular triangulation T of a polytope P ⊂^N is induced by interior points or ibip for short, if following properties hold: \n     \n        \n  * (Boundary points connected to interior points) For every point on the relative boundary p ∈∂ P ∩^N, there exists a point in the relative interior q ∈relint(P) ∩^N such that {p,q}∈ T.\n        \n  * (Čech complex condition) For every tuple of lattice points in the relative interior p_1,...,p_r ∈relint(P), we have ((p_1) ∩ ... ∩(p_r)) = d, where (p) = ⋃_p ∈σ, σ∈ Tσ is the closed star in T.\n        \n  * (Polytopial condition) For any point in the relative interior p ∈relint(P) ∩^N, the (p) is a convex polytope.\n    \n\nIn Figure <ref> below, you can see non-examples of ibip triangulations. In the first case, the red point is not connected to the point in the interior, so the first property does not hold. In the second picture, the intersection (p_1) ∩(p_2) of the only two interior points p_1,p_2 is the red segment, which is a 1-dimensional polytope, so the second condition does not hold. In the third picture,  of the red point is not a convex polytope. The example of ibip triangulation could be seen on the Figure <ref> in the introduction.\n\n\n\n\nThe next proposition shows that if triangulation is ibip, then we can extract a lot of information from  of the interior points.\n\n\n(Injectivity into covering)\n    Suppose P ⊂^N be a d-dimensional polytope and T be a unimodular, regular, ibip triangulation T. Then the natural morphism of rings\n    \n    A^*(T) →∏_p ∈relint(P) ∩^N A^*((p))\n \n    is injective.\n\n\n    Fix a total linear ordering < of the set relint(P) ∩^N. For every element x ∈[T] and every tuple of distinct interior points p_1,...,p_r ∈(P) ∩^N in ascending order (p_1<...<p_r) we will write x|_p_1,...,p_r as the restriction of x on (p_1) ∩ ... ∩(p_r) (this is d-dimensional polytope by the second and third requirement of the Definition <ref>). We extend the notation to any tuple of distinct interior points, not necessarily in ascending order, by considering the index to be antisymmetric. This means that for any distinct tuple of point p_1,...,p_r ∈(P) ∩^N the equality\n    \n    x|_p_1,...,p_i,...,p_j,...,p_r = -x|_p_1,...,p_j,...,p_i,...,p_r\n\n    holds for all 1 ≤ i < j ≤ r. Consider the following Čech-like complex:\n    \n    \n    0 →[T] →∏_p ∈(P) ∩^N[(p)]  →\n\n    \n    →∏_p<q; p,q ∈(P) ∩^N[(p) ∩(q)] → ...\n\n    \n    ... →[⋂_p ∈(P) ∩^N(p)] → 0\n\n    We will refer to this complex as C^∙, with the \n    grading convention C^-1 = [T]. The coboundary operator d : C^k→ C^k+1 is defined as follows:\n    \n    d(x)|_p_0,...,p_k+1 = ∑_i=0^k+1 (-1)^i x|_p_0,...,p̂_i,...,p_k+1 for  x ∈ C^k\n\n    We will show that C^∙ is exact by explicit homotopy of the endomorphism Id_C^∙ to 0_C^∙.  Fix some interior point p_fix∈(P) ∩^N. Define the map \n    h(x)|_p_1,...,p_k = x̃_p_fix, p_1,...,p_k\n \n    for any x ∈ C^k+1, where x̃|_p_fix, p_1,...,p_k is the image of x|_p_fix,p_1,...,p_k under the canonical embedding:\n    \n    [(p_fix) ∩(p_1) ∩ ... ∩(p_k)] →[ (p_1) ∩ ... ∩(p_k)]\n\n    The exactness of the complex C^∙ then follows from the identity dh + hd = Id_C^∙.\n\n    \n    We aim to demonstrate that the complex C^∙ remains exact after the quotient by J. According to <cit.>, it suffices to prove that the sequence (f_0,...,f_d) is a regular sequence for every term C^k, considered as an [T]-module. From the definition of a regular sequence, it follows that regularity can be checked on each direct factor separately. Each direct factor is a Cohen-Macaulay ring, since it is a Stanley-Reisner ring of regular, unimodular triangulation of a convex polytope. The triangulation is shellable via linear shelling <cit.> and therefore each direct factor of C^k is Cohen-Macaulay <cit.>. Additionally, f_0,...,f_d is a homogeneous system of degree 1 parameters, so, it is [T]-regular sequence as well, and the statement follows from <cit.>.\n\n\n\n\n\n\n    Let ϕ : P ∩^N → be a weight function that is a witness of the regularity of T and [ϕ] ∈ A^1(T) is the corresponding cohomological class. We will show that for every 1 ≤ k ≤⌈d/2⌉ the multiplication by [ϕ]^2k for even d or by [ϕ]^2k-1 for odd d is an injective linear operator from A^⌈d/2⌉  - k to A^⌊d/2⌋ + k. From this, the statement follows, since if the composition of operators \n    [ϕ] : A^⌈d/2⌉ - k→ A^⌈d/2⌉ - k+1\n \n    \n    [ϕ] : A^⌈d/2⌉ - k+1→ A^⌈d/2⌉ - k+2\n \n    \n    ...\n\n    \n    [ϕ] : A^⌊d/2⌋+k-1→ A^⌊d/2⌋+k\n\n    is injective, then the first operator, [ϕ] : A^⌈d/2⌉ - k→ A^⌈d/2⌉ - k+1, is also injective. However, if an injective operator A^⌈d/2⌉ - k→ A^⌈d/2⌉ - k+1 exists, then _ A^⌈d/2⌉ - k≤_ A^⌈d/2⌉ - k+1 and, by Theorem <ref>, we have δ_⌈d/2⌉ - k≤δ_⌈d/2⌉ - k+1.\n\n    Suppose d is odd, the argument for the even case is the same. Take any element x ∈ A^⌈d/2⌉  - k(T) such that x ≠ 0. By Proposition <ref> there exist p ∈relint(P) ∩^N such that i_(p)^*(x) ≠ 0, by Proposition <ref> i_(p)^*([ϕ]) is an ample element. Therefore,\n    \n    i_(p)^*([ϕ]^2k-1 x) = i_(p)^*([ϕ])^2k-1 i_(p)^*(x) ≠ 0\n by the Hard Lefshetz Theorem on smooth projective varieties and by Proposition <ref>. Hence [ϕ]^2k-1 x ≠ 0 also.\n\n\n\n    This is a consequence of Theorem <ref> and <cit.>. \n\n\n\nalpha\n\n\n\n\n\n\n\n"}