{"entry_id": "http://arxiv.org/abs/2303.07217v1", "published": "20230313155242", "title": "Transversal effects on the ground-state of hard-core dipolar bosons in one-dimensional optical lattices", "authors": ["H. Korbmacher", "G. A. Domínguez-Castro", "W. Li", "J. Zakrzewski", "L. Santos"], "primary_category": "cond-mat.quant-gas", "categories": ["cond-mat.quant-gas"], "text": "\n\n\nInstitut für Theoretische Physik, Leibniz Universität Hannover, Appelstr. 2, D-30167 Hanover, Germany\n\nInstitut für Theoretische Physik, Leibniz Universität Hannover, Appelstr. 2, D-30167 Hanover, Germany\n\nMax Planck Institute for the Physics of Complex Systems, Nöthnitzer Str. 38, 01187 Dresden, Germany\n\nInstytut Fizyki Teoretycznej, \nUniwersytet Jagielloński,  Łojasiewicza 11, PL-30-348 Kraków, Poland\nMark Kac Complex Systems Research Center, Uniwersytet Jagielloński, PL-30-348 Kraków, Poland\n\nInstitut für Theoretische Physik, Leibniz Universität Hannover, Appelstr. 2, D-30167 Hanover, Germany\n\n\n\n\n\nPolar lattice gases are usually assumed to have an inter-site interaction that decays with the inter-particle  distance r as 1/r^3. However, a loose-enough transversal confinement may strongly modify the dipolar decay in one-dimensional lattices. We show that this modification alters significantly the ground-state properties of hard-core dipolar bosons. For repulsive inter-site interactions, the corrected decay alters the conditions for devil's staircase insulators, affecting significantly the particle distribution in the presence of an overall harmonic confinement. For attractive interactions, it results in a reduction of the critical dipole interaction for the formation of self-bound clusters, and for a marked enhancement of the region of liquefied lattice droplets. \n\n\n\n\n\n\n\n\nTransversal effects on the ground-state of hard-core dipolar bosons \n in one-dimensional optical lattices\n    L. Santos\n    March 30, 2023\n=========================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nUltracold quantum gases in optical lattices constitute an optimal platform for studying many-body physics under precisely controlled conditions  <cit.>. In most current experiments, the interactions between particles are short-range and well-modeled by a contact pseudopotential.  However, seminal experiments on dipolar systems formed by magnetic atoms <cit.> and polar molecules <cit.> in optical lattices are starting to explore exciting physics beyond the short-range scenario. \n\nDue to the anisotropic and long-range character of the dipole-dipole potential, polar gases confined in optical lattices are  characterized not only by on-site interactions, but, crucially, also by anisotropic inter-site interactions. As a result, dipolar lattice gases of pinned particles \ncan be employed as quantum simulators for spin models, whereas itinerant particles realize different forms of the extended-Hubbard model <cit.>. Compared to their non-dipolar counterparts, dipolar lattice gases present a much richer ground-state physics, including crystalline phases <cit.> and  supersolids <cit.>, or the Haldane-insulator phase <cit.>.\n\nThe spatial decay of the inter-site interactions plays a crucial role in polar lattice gases. Due to the form of the dipolar interaction in free space, this decay is typically assumed as 1/r^3, with r the inter-site distance. \nHowever, the interaction decay may be significantly affected by the confinement transversal to the lattice axis <cit.>. This confinement alters the on-site wave functions, introducing a modification of the inter-site interaction, which may potentially depart very significantly from the 1/r^3 dependence, and hence alter the equilibrium and out-of-equilibrium physics of the polar lattice gas  <cit.>.\n\nIn this paper, we show that the modification of the interaction decay in the presence of a loose-enough transversal confinement results in a significant modification of the ground-state properties of hard-core dipolar bosons. We first consider the case of repulsive interactions, showing that the modified decay results in markedly shifted insulating phases, which translate into a \ndistorted particle distribution in the presence of an overall harmonic confinement. For attractive dipoles, we show that the modified decay may significantly ease the conditions for the realization of self-bound clusters. Moreover, it results in a much wider parameter region for the observation of liquefied self-bound droplets <cit.> without the need of super-exchange processes.  \n\n\n\n\n\n\n\n\n\n\n\n \n\nThis manuscript is organized as follows. In Sec. <ref>, we introduce the lattice model considered, and show how the transversal confinement modifies the inter-site interaction decay. In Sec. <ref>, we study the effects of the modified interaction on the phase diagram of repulsive hard-core bosons, whereas  Sec. <ref> focuses on the attractive case.  Finally, in Sec. <ref>, we summarize our conclusions.\n\n\n\n\n§ MODIFIED INTERACTION DECAY\n\n\nWe consider dipolar hard-core bosons of mass m confined longitudinally by a 1D optical lattice, U_0sin^2(π z/a) with a the lattice constant, and transversally by an isotropic harmonic potential 1/2mω_⊥^2(x^2+y^2), ω_⊥ being the trap frequency (see Fig. <ref>(a)). The dipole moments are assumed to be oriented by an external field on the xz plane forming an angle α with the lattice axis z. Within the tight-binding approximation, the system is well described by the extended Hubbard model (EHM):\n\n\n    Ĥ=∑_i [\n    -t  (b̂^†_i+1b̂_i\n    +H.c. )\n    +∑_j>0V_rn̂_in̂_i+j  -μn̂_i ],\n\n\nwhere t is the tunneling amplitude between nearest neighbors, b̂_i^† (b̂_i) is the creation (annihilation) operator at site i, n̂_i=b̂_i^†b̂_i is the corresponding particle number operator, and μ is the chemical potential. The hard-core constraint means that no double occupancy is allowed, i.e. (b̂_i^†)^2=0. This restriction can be achieved by means of strong-enough on-site interactions (which may demand the use of Feshbach resonances). The inter-site interaction between dipoles separated by j sites is given by:\n\n\n    V_r = ∫ d^3r ∫ d^3r'  V(r⃗-r⃗')|ϕ(r⃗)|^2|ϕ(r⃗-jae⃗_z)|^2,\n\n\nwith V(r⃗) = C_dd/4π r^3(1-3(xsinα+zcosα)^2/r^2) being the dipole-dipole interaction. The coupling constant C_dd is μ_0μ^2 for particles having a permanent magnetic dipole moment μ (μ_0 is the permeability of vacuum) and d^2/ε_0 for particles having a permanent electric dipole moment d (ε_0 is the vacuum dielectric constant). \n\nThe on-site wave function can be written as ϕ(r⃗)=ψ_0(x,y)W(z), where W(z) is the Wannier function associated with the lowest-energy band, and ψ_0(x,y) = e^-(x^2+y^2)/2ℓ_⊥/√(π)ℓ_⊥ is the ground-state wave function of the transversal confinement, with ℓ_⊥ = √(ħ/mω_⊥) the harmonic oscillator length. For deep-enough lattices, we may employ the harmonic approximation, W(z)≃e^-z^2/2ℓ/√(√(π)ℓ) with ℓ = a/(π s^1/4) the associated length of the trap, s=U_0/E_R the lattice depth, and E_R=π^2ħ^2/2ma^2 the recoil energy. One can show that for ℓ_⊥ > ℓ <cit.>:\n\n    V_j/E_R = 3B^3/2/2π^2(3cos^2α-1)(a_dd/a)f(√(B)j),\n\nwhere a_dd = mC_dd/(12πħ^2) is the dipolar length, B=π^2/2χ/1-χ/2√(2), χ=ħω_⊥/E_R, and\n\n\n    f(ξ) = 2ξ -√(2π)(1+ξ^2)e^ξ^2/2erfc(ξ/√(2)).\n\n\nBy using V=V_1, the interaction potential in Eq. (<ref>) can be written as V_j=VG_j(B), with G_j(B) = f(√(B)j)/f(√(B)). The resulting interaction decay has hence a universal dependence on the parameter B, which is a function of the confinement parameters only. To further characterize the potential in Eq. (<ref>), we introduce the parameter β_eff=-log G_2/log 2 that characterizes the next-to-NN interaction decay i.e. G_2 = 1/2^β_eff <cit.>. For the bare dipole-dipole interaction, β_eff=3, however, by changing the transversal confinement it can be tuned within the interval 0<β_eff<3.2 <cit.>. \nWhen ℓ_⊥ < ℓ, β_eff>3, whereas the opposite is true if ℓ_⊥ > ℓ. For the rest of the manuscript, we focus \non the latter case.  In Fig. <ref>(b) we plot the spatial dependence of the modified interaction decay for different values of β_eff. Although for sufficiently large distances the potential in Eq. (<ref>) recovers the usual dipole-dipole tail, i.e. G_j→∞→ 1/j^3, the modification of the interaction to the neighboring sites is very significant, and has, as shown below, relevant consequences for the ground-state properties of the system.\n\n\n\n\n\n§ REPULSIVE POLAR LATTICE GAS\n\n\n\nWe focus first on the ground-state properties for the case of repulsive inter-site interactions, V>0. In absence of dipolar interaction, the standard Hubbard model with hard-core bosons may present only two phases, either a superfluid (SF) phase or a band insulator, with filling factor n̅=N/L=1, with N the number of bosons and L the number of sites. Note that the latter is equivalent to the vacuum (n̅=0) due to particle/hole symmetry. In the presence of inter-site dipolar interactions, and depending on the dipole strength V/t and the chemical potential μ the system may present different insulating phases with commensurate fractional fillings (devil's staircase) <cit.>. \nParticularly relevant are the \nhalf-filled density-wave (2DW) (n̅=1/2), which for t=0 acquires the form |⋯     ⋯⟩, and the one-third-filled (3DW) (n̅ =1/3) \n|⋯       ⋯⟩ (or equivalently the phase with n̅=2/3). Other fractional fillings are possible but they require significantly larger V/t ratios. \n\nWe are interested in how the modified interaction decay alters the boundaries of the insulating phases. We employ density-matrix renormalization group (DMRG) techniques to obtain the ground-state of a system of L=120 sites, assuming periodic boundary conditions. Superfluid (insulating) phases are characterized by a polynomial (exponential) decay of the single-particle\ncorrelation, \nC_SF(i,j)=⟨â_i^†â_i+j⟩. To distinguish amongst the different insulating phases, we evaluate the structure factor \n\nM(k)=1/L∑_j=1^L-1e^-ikj⟨n̂_in̂_i+j⟩, \n\nwhere k∈[-π, π] is the quasi-momentum. For an insulating phase with filling n̅=1/m, M(k) presents peaks \nat k=±2π/m. Due to particle-hole symmetry, the same is true for the phase with n̅=m-1/m. Note that particle-hole symmetry results in a mirror symmetry of the phase diagram on the \n(t/V,μ/V) plane around the chemical potential (μ/V)_0(B)=∑_j>0G_j(B). \nIn order to compare properly the results for different B values, we introduce the re-scaled chemical potential, μ̃=μ/(2∑_j>0G_j(B)), such that the phase diagram presents mirror symmetry around μ̃/V=1/2. \nWith this shift, the borders of the band insulator, n̅=1, and the \nvacuum, n=0, are given by μ̃/V=0,1. \n\n\n\n\n\n\n\n\n\n\n\n\nIn Fig. <ref> (top), we depict the phase diagram for a \n1/r^3 decay (blue), and for the modified dipolar interaction with β_eff=2 (red). The central lobe, which corresponds to the 2DW phase, is significantly smaller for β_eff=2. This must be compared to the results of Ref. <cit.>, which focused on the case ℓ_⊥≪ℓ (and hence β_eff≳ 3), for which the modification of the 2DW lobe compared to that expected for the 1/j^3 dependence is very small. \n\n\nThe relative deviation from the results considering\nthe standard 1/j^3 dependence is even more relevant \nfor insulating phases at lower fillings. In Fig. <ref> (top) we observe as well the lobes with filling n̅=1/3 and n̅=1/4, and the particle/hole symmetric ones for n̅=2/3 and n̅=3/4. Note that these lobes, which are depicted in detail in the inset, are significantly modified. In particular, for β_eff=2, the critical V/t for the observation of the 3DW is strongly reduced from a critical V/t ≃ 47 to V/t≃ 27. Figure <ref> (bottom) shows the critical (V/t)_cr for 2DW and 3DW, as a function of β_eff, normalized to the value expected for a 1/j^3 decay. Note that for 2DW (3DW) (V/t)_cr increases (decreases) by \napproximately a factor of 2 when reducing β_eff down to 1.\n\n\n\n\n\n\n\n\n\nThe lobes are also changed in their dependence with chemical potential. In addition to the above-mentioned (μ/V)_0(B) shift, the width (in chemical potential) of the 2DW (3DW) lobe significantly shrinks (widens) with decreasing β_eff. This is illustrated in Fig. <ref> (top), where \nwe consider t=0, for which the \nphase boundaries may be evaluated analytically. \n\nThe modification of the insulating lobes has significant consequences \nfor the spatial particle distribution in the \nthe presence of an overall harmonic confinement.\nThe confinement results in an additional term Ω∑_i(i-L/2)^2n̂_i in \nEq. (<ref>). For a sufficiently weak confinement, local-density approximation \narguments apply, and the density profile presents the expected wedding-cake profile. Figure <ref> (bottom) shows the local mean occupation ⟨ n_i⟩. In the plateaus, which characterize \nthe DW phases, we average over neighboring sites to flatten the DW oscillations in ⟨ n_i⟩. In agreement with the phase diagram, the central 2DW plateau shrinks while the 3DW plateau widens when decreasing β_eff. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ATTRACTIVE POLAR LATTICE GAS\n\n\n\nWe analyze at this point the case of  V<0, focusing first on the simplest case of just two bosons, and then discussing the formation of self-bound lattice droplets.\n\n\n\n §.§ Dimers\n\n\nThe wave function characterizing a state of two bosons can be separated as Ψ(R, r) = e^iKRΦ_K(r), where R=(i_1+i_2)/2 is the center-of-mass, r=i_1-i_2 is the relative coordinate, and i_j=1,2 is the lattice site in which particle j is. The wave function Φ_K(r) depends on the center-of-mass quasi-momentum K∈[-π, π], and satisfies the Schrödinger equation Ĥ_K|Φ_K⟩ = E_KΦ_K, with \n\n\n    Ĥ_K   =    -2tcos (Ka/2 )∑_r≥ 1 (|K, r+1⟩⟨ K, r| + H.c.) \n       +    V∑_r≥ 1G_j(B)|K,r⟩⟨ K, r|,\n\n\nwhere |K, r⟩ stands for the state with center-of-mass quasi-momentum K, and inter-particle separation r. Diagonalizing Ĥ_K for different K \nin the Brillouin zone provides the energy spectrum,  \ndepicted in Fig. <ref> for V/t=-4 and different values of β_eff. Compared to the case 1/r^3 for the same V/t, the modification of the dipolar tail results in additional bound eigenstates. \n\nThe two-body ground-state is given for all β_eff values by a bound pair  with K=0, and a spatial distribution peaked at nearest neighbors. However, the binding becomes stronger, i.e. pairing (and in general the formation of clusters, as discussed below) demands a smaller |V|/t when β_eff decreases. \n\nFurthermore, dimer mobility may be strongly modified by tuning the transversal confinement. \nNote that the curvature of the lowest branch at K=0, associated with the effective mass of the ground-state dimer, is significantly modified as a function of β_eff. \nThis is best illustrated with the case of strong V/t, for which the lowest bound-state branch corresponds to bound nearest-neighbor dimers, which \nmove via second-order hopping with amplitude \n\n    t_D=1/1-2^-β_efft^2/V.\n\nThis should be compared to the corresponding value t_D = 8t^2/7V for the case of 1/r^3 decay. Note that e.g. for β_eff=1, t_D = 2 t^2/V, and hence the dimer dynamics is approximately twice faster.\n\n\n\n\n\n\n\n\n\n\n §.§ Self-bound lattice droplets\n\n\nThe formation of bound dimers in the two-body problem extends in the many-body case to the formation of self-bound lattice droplets formed by potentially many particles. These resemble those recently discussed in binary mixtures <cit.> and cavities <cit.>. Dipolar self-bound lattice droplets have been discussed in the context of out-of-equilibrium polar lattice gases after a quench of the confinement potential <cit.>. Very recently, ground-state self-bound dipolar lattice droplets were studied in Ref. <cit.>.\n\nAlthough self-bound lattice droplets present some interesting similarities to quantum droplets in binary and dipolar Bose-Einstein condensates <cit.>, they differ from them \nin the physical mechanism as well as in the fact that lattice droplets are self-pinned, i.e. they remain for any practical purposes immobile, due to their large effective mass.\n\nIn Ref. <cit.>, it was shown that droplets \ncan be either a self-bound Mott insulator (with saturated unit filling) or in a liquefied state (self-bound but with a filling lower than unity). It was argued that liquefaction arises due to the interplay between inter-site dipolar attraction and the super-exchange processes originating from short-range repulsion in soft-core Bose systems. \n\nIn the following, we show that self-bound droplets in hard-core gases (where super-exchange is absent) are generally in either a saturated or liquid regime, and that the boundaries between the saturated, liquid, and unbound (gas) phases are \nstrongly dependent on β_eff.\n\n\n\n\n\n\n\n\n\n\nIn order to analyze self-bound lattice droplets, we develop a variational approach similar to that used in Ref. <cit.>. We assume that the impenetrable lattice gas is well described by a Tonks-Girardeau |Ψ_TG⟩=Π_k<k_Fb̂_k^†|0⟩ ansatz with the density n=k_F/π as a variational parameter, k_F being the Fermi momentum of the fermionized bosons. Evaluating  ⟨Ψ_TG|Ĥ|Ψ_TG⟩ yields the energy per particle\n\n    E[n]/tN = -2sin nπ/nπ+V/tn∑_r>0G_r[1-sin^2nπ r/π^2r^2].\n\nThe first and second terms are associated with the kinetic energy and the modified dipolar interaction, respectively.\nFollowing Ref. <cit.>, we classify the quantum phases of the dipolar system according to the value of the density n_c at which the energy per particle is minimal. In the unbound (gas) phase, the dipoles spread uniformly over all available sites. As a result, the gas phase is characterized by a vanishing density n_c=0. In contrast, in a liquid phase, where the droplets are self-bound and localized at zero pressure <cit.>, the energy per particle takes its minimal value at a finite density 0<n_c<1. Furthermore, the energy per particle at n_c is smaller than the bottom of the scattering band, i.e E[n_c]/N<-2t. Lastly, we define the saturated droplet regime as that in which the energy per particle becomes minimal at n_c=1. In such a phase, the droplet is incompressible and hole propagation within the droplet is inhibited due to the high energy cost of breaking a dipole bond <cit.>. In Fig. <ref>, we show, in a color scheme, the resulting phase diagram of impenetrable dipolar bosons as a function of the interaction strength |V|/t and β_eff. The saturated droplet regime is indicated in red, whereas the liquid and gaseous phases in white and blue, respectively. In stark contrast to the bare dipolar potential 1/r^3 <cit.>, the modified interaction gives rise to a wide liquefied region without removing the hard-core constraint.\n\n\n\nIn addition to the above-mentioned variational approach, we calculate the ground state of the dipolar system for different values of |V|/t using DMRG simulations with N=24 bosons in L=80 sites. In our DMRG simulations, we define the gas-to-liquid transition at the interaction strength |V_c|/t in which the energy per particle is equal to the bottom of the scattering band E/N = -2t. Meanwhile, we define the saturated droplet regime as that in which the central density of the ground state reaches unity, i.e. the density distribution acquires a flat-top profile. Note that the wings of the droplet are not necessarily saturated, although when |V|/t increases eventually the whole droplet enters the unit filling regime. Green circles and orange stars in Fig. <ref> correspond to our DMRG results for the gas-to-liquid and liquid-to-saturated boundaries, respectively. A good agreement is found between the variational and numerical results. Note as well, that the gas-to-liquid transition is well-estimated by the threshold of dimer bound-state formation (dashed line in Fig. <ref>), obtained from the two-body calculations discussed above.\n\n\n\n\n\n\n§ CONCLUSIONS\n\n\nA sufficiently loose transversal confinement  results in a significant \nmodification of the inter-site interaction between dipoles in a one-dimensional optical lattice, which departs from the usually assumed \n1/j^3 dependence. We have shown that this modification, which \nacquires a universal dependence on the confinement parameters, may significantly modify the ground-state properties of hard-core bosons. For repulsive dipoles, it leads to a marked shift of the boundaries of the insulating devil's staircase phases, that translates in a significantly modified particle distribution in the presence of an overall harmonic potential. For attractive dipoles, the modified interaction decay results in a lower critical dipolar strength for the formation of self-bound clusters, \nand to a much wider parameter region for the observation of liquefied droplets without the need of super-exchange processes. The discussed effects should play a relevant role in future lattice experiments on magnetic atoms or polar molecules.\n\n\n\n§ ACKNOWLEDGMENTS\n\nWe acknowledge support of the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) – Project-ID 274200144 – SFB 1227 DQ-mat within the project A04, and under Germany's Excellence Strategy – EXC-2123 Quantum-Frontiers – 390837967. J.Z. was supported by the National Science Centre (Poland), grant 2021/43/I/ST3/01142.\n\n\n\n\n"}