{"entry_id": "http://arxiv.org/abs/2303.07216v2", "published": "20230313155138", "title": "Parallel Vertex Diffusion for Unified Visual Grounding", "authors": ["Zesen Cheng", "Kehan Li", "Peng Jin", "Xiangyang Ji", "Li Yuan", "Chang Liu", "Jie Chen"], "primary_category": "cs.CV", "categories": ["cs.CV", "cs.AI"], "text": "\n\n\n\n\n\n\n\nParallel Vertex Diffusion for Unified Visual Grounding\n    \nZesen Cheng^1 Corresponding Author.   Kehan Li^1   Peng Jin^1   Xiangyang Ji^3\n\nLi Yuan^1,2   Chang Liu^3    Jie Chen^1,2 ^1 School of Electronic and Computer Engineering, Peking University \n\n^2 Peng Cheng Laboratory   ^3 Tsinghua University   \n\n\n\n    March 30, 2023\n============================================================================================================================================================================================================================================================\n\n\n\nempty\n\n\n\nUnified visual grounding pursues a simple and generic technical route to leverage multi-task data with less task-specific design.\n\nThe most advanced methods typically present boxes and masks as vertex sequences to model referring detection and segmentation as an autoregressive sequential vertex generation paradigm.\n\nHowever, generating high-dimensional vertex sequences sequentially is error-prone because the upstream of the sequence remains static and cannot be refined based on downstream vertex information, even if there is a significant location gap.\n\nBesides, with limited vertexes, the inferior fitting of objects with complex contours restricts the performance upper bound.\n\nTo deal with this dilemma, we propose a parallel vertex generation paradigm for superior high-dimension scalability with a diffusion model by simply modifying the noise dimension.\n\nAn intuitive materialization of our paradigm is Parallel Vertex Diffusion (PVD) to directly set vertex coordinates as the generation target and use a diffusion model to train and infer.\n\nWe claim that it has two flaws: (1) unnormalized coordinate caused a high variance of loss value; (2) the original training objective of PVD only considers point consistency but ignores geometry consistency.\n\nTo solve the first flaw, Center Anchor Mechanism (CAM) is designed to convert coordinates as normalized offset values to stabilize the training loss value. \n\nFor the second flaw, Angle summation loss (ASL) is designed to constrain the geometry difference of prediction and ground truth vertexes for geometry-level consistency.\n\nEmpirical results show that our PVD achieves state-of-the-art in both referring detection and segmentation, and our paradigm is more scalable and efficient than sequential vertex generation with high-dimension data.\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nVisual grounding is an essential task in the field of vision-language that establishes a fine-grained correspondence between images and texts by grounding a given referring expression on an image <cit.>. \n\nThis task is divided into two sub-tasks based on the manner of grounding: Referring Expression Comprehension (REC) using bounding box-based methods <cit.>, and Referring Image Segmentation (RIS) using mask-based methods <cit.>. \n\nREC and RIS are chronically regarded as separate tasks with different technology route, which requires complex task-specific design. However, REC and RIS share high similarities and have respective advantages so that it is natural and beneficial to unify two tasks. \n\nRecently, unified visual grounding becomes a trend of visual grounding because it avoids designing task-specific networks and can leverage the data of two tasks for mutual enhancement <cit.>. \n\n\nThe most advanced unified visual grounding paradigm represents boxes and masks as vertex sequences and models both REC and RIS as an autoregressive sequential vertex generation problem <cit.> which is solved by an autoregressive model <cit.>.\n\nAlthough this paradigm unifies REC and RIS in a simple manner, it is hard to scale to high-dimension settings, which causes inferior fitting to objects with complex contours.\n\nThis flaw of sequential vertex generation paradigm mainly attributes to the sequential generation nature of its fundamental architecture, i.e., autoregressive model  <cit.>.\n\nSpecifically, if upstream of vertex sequence is not precise enough, this paradigm easily gets stuck in a trap of error accumulation because upstream of sequence is stationary during subsequent generation.\n\nIn Fig. <ref>(b), we can find that sequential vertex generation methods easily generate error vertexes when upstream vertexes don't hit the right object.\n\nMoreover, sequential vertex generation methods face efficiency problem when scaling to high-dimension data because the iteration for generation sharply increases with the dimension of data <cit.>.\n\n\n\n\nTo tackle the issues of sequential vertex generation paradigm, we design parallel vertex generation paradigm to parallelly generate vertexes, which is more scalable for high-dimension data.\n\nSpecifically, the parallel nature allows dynamic modification of all vertexes to avoid error accumulation and requires only a few iterations to accomplish generation, which ensures it is easier to scale to high-dimension data.\n\nFig. <ref>(b) conceptually shows how our paradigm works.\n\nNoisy vertexes are first sampled and then are gradually refined to precise vertexes of the object.\n\nRecently, diffusion model <cit.> is demonstrated as an effective and scalable model when processing high-dimension generation tasks (Text-to-Image generation <cit.>) and discriminative tasks (Panoptic Segmentation <cit.>). \n\nThe scalability of diffusion model mainly attributes to its parallel denoising mechanism. \n\nDiffusion model can easily scale to high-dimension settings by simply modifying the dimension of noise.\n\nTo leverage the scalability, we adopt a diffusion model to instantiate parallel vertex generation paradigm as Parallel Vertex Diffusion (PVD) for more scalable unified visual grounding.\n\nMoreover, we find that there are two aspects for improving the convergence of PVD: (1) The coordinates of vertexes are not normalized so that the loss value has a high variance. (2) The vanilla training objective of PVD only considers point-level consistency and ignores the geometry-level consistency between prediction and ground truth vertexes.\n\nTo implement this, we extra design Center Anchor Mechanism (CAM) to normalize coordinate values for stabilizing the optimization signal and Angle Summation Loss (ASL) to constraint geometry difference for achieving geometry consistency (Fig. <ref>). \n\n\nExtensive experiments are conducted for both REC and RIS on three common datasets (RefCOCO <cit.>, RefCOCO+ <cit.> and RefCOCOg <cit.>). On one hand, the empirical results show that PVD w/ CAM and ASL achieves SOTA on both REC and RIS tasks. On the other hand, the results also show that parallel vertex generation can better handle data with high-dimension and requires lower computation cost than sequential vertex generation paradigm.\n\n\n\n\n§ RELATED WORK\n\n\n\n\n §.§ Visual Grounding\n\n\nVisual grounding is essentially an object-centric fine-grained image-text retrieval <cit.>, which has two forms: Referring Expression Comprehension (REC) at box level <cit.> and Referring Image Segmentation (RIS) at mask level <cit.>. \nAlthough they were parallel in the past, recent researches gradually focus on unified visual grounding because it requires little task-specific design and can leverage data from multiple tasks for mutual promotion.\n\nReferring Expression Comprehension.\nREC starts with the two-stage pipeline <cit.>, where region proposals are first extracted by a pretrained detector <cit.> and then ranked according to the reasoning similarity score with the referring expression. To tackle the two-stage pipeline's efficiency problem, researchers develop the one-stage pipeline to integrate location and cross-modal reasoning <cit.> into a single network for end-to-end optimization <cit.>.\n\nReferring Image Segmentation.\nRIS models the fine-grained referring object location as a pixel classification problem <cit.>. The main focus of RIS research is to design better cross-modal alignment and fusion, e.g., concatenate <cit.>, cross-modal attention mechanism <cit.>, visual reasoning <cit.>. Recent endeavors in RIS shift to simplify the pipeline of RIS system. EFN <cit.> couples the visual and linguistic encoder with asymmetric co-attention. LAVT <cit.> and ResTR <cit.> replace those complex cross-modal attention and reasoning with a simple stack of transformer encoder <cit.> layers.\n\nUnified Visual Grounding.\n\nUnified visual grounding has generally three types, i.e., two-stage paradigm <cit.>, multi-branch paradigm <cit.>, and sequential vertexes generation paradigm <cit.>. \n\n(1) Two-stage: Methods in the two-stage paradigm are built upon a pretrained detector (e.g., Mask R-CNN <cit.>) to first generate region proposals, and then referring expression is used to retrieve the most confident region as results <cit.>. \n\n(2) Multi-task: For breaking through the bottleneck of pretrained detector, multi-branch paradigm is proposed to assign task-specific branches to different tasks for joint end-to-end optimization <cit.>. \n\n(3) Sequential Vertex Generation: To simplify previous schemes and reduce optimization bias resulting from a multi-branch architecture <cit.>, SeqTR models both REC and RIS as a vertex generation problem <cit.> and adopt an autoregressive model <cit.> to sequentially generate vertices of objects, which is currently the most advanced unified visual grounding scheme <cit.>.\nBecause of the sequential generation nature, SVG is easily trapped in error accumulation. This work proposes Parallel Vertex Generation to parallelly generate vertexes to avoid this issue.\n\n\n\n §.§ Generative Model for Perception\n\n \nSince Pix2Seq <cit.> first claims that sequence generation modeling is a simple and generic framework for object detection, generative model for perception is gradually gaining more attention. Following Pix2Seq, Pix2Seq v2 <cit.> is proposed as a general vision interface for multiple location tasks, e.g., object detection, instance segmentation, keypoint detection, and image caption. Although sequence generation modeling shows its potential, its fundamental generative architecture (autoregressive model) hard scales to high-dimension data <cit.>. Subsequently, Pix2Seq-D shows that diffusion model <cit.> is a better fundamental generative architecture for processing high-dimension task, i.e., panoptic segmentation <cit.>. Then researchers expand diffusion model to other high-dimension tasks, e.g., semantic segmentation <cit.> and pose estimation <cit.>. \n\n\n\n\n\n\n§ METHOD\n\n\n\n\n §.§ Overall Pipeline\n\n\nFor claiming the relationship between different components of our workflow (Fig. <ref>), we describe the training and inference processes of the overall pipeline.\n\nTraining. An image-text pair {I, T} is input into visual and linguistic encoder to extract cross-modal features F_c (Sec.<ref>). The cross-modal features are then used to regress center point c (Sec.<ref>). To create the ground truth of parallel vertex diffusion, center point is used to normalize the vertexes sampled from bounding box and mask contour for acquiring  ground truth vertex vector V̂ (Sec.<ref>). The final step is to calculate loss for optimization:\n\n    ℒ =  ℒ_c + ℒ_p + ℒ_g,\n\nwhere ℒ_c is the center point loss (Eq. <ref>) for optimizing center point prediction, ℒ_p is the point-to-point reconstruction loss (Eq. <ref>) for point level consistency, and ℒ_g is the angle summation loss (Eq. <ref>) for geometry consistency. The below sections will describe how to calculate these losses.\n\nInference. Same as the training process, we first predict the center point c (Sec.<ref>). Then sampling a noisy state x_T from standard gaussian distribution 𝒩(0, I). The noise is iteratively denoised to clean vertex vector V_0 by denoiser f_θ (Sec.<ref>). Finally, denormalizing the coordinates of vertexes and convert the denormalized coordinates of vertexes to bounding box and binary mask by toolbox of COCO <cit.>.\n\n\n\n §.§ Cross-modal Feature Extraction\n\n\n\nThe first step is to prepare cross-modal fusion features. An image-text pair {I∈ℝ^h× w×3, T∈ℕ^n} is first sampled from dataset, where h, w, and n denote the image height, the image width, and the number of words.\n\n Note that the words of text are already tokenized to related numbers by Bert tokenizer <cit.>. \nTo encoder image, the image is input in visual backbone (e.g., ResNet <cit.>, Darnet53 <cit.>, Swin <cit.>) for acquiring  multi-scale visual features {𝐅_v_1∈ℝ^h/8×w/8× d_1, 𝐅_v_2∈ℝ^h/16×w/16× d_2,\n𝐅_v_3∈ℝ^h/32×w/32× d_3}.\nTo encoder text, the word tokens of text are input in language backbone (e.g., Bert <cit.>) for obtaining linguistic features F_l∈ℝ^n× d_l. Specifically, the language backbone is the base bert model so that d_l is 768. Then we blend visual and linguistic features via element-wise multiplication <cit.> and adopt multi-scale deformable attention Transformer (MSDeformAttn) <cit.> for multi-scale cross-modal fusion:\n\n\n    𝐅_c_i = MSDeformAttn(MLP(σ(𝐅_v_i) ⊙σ(𝐅_l))),\n\nwhere ⊙ denotes element-wise multiplication, MLP(·) are three fully-connected layers and 𝐅_c_i∈ℝ^h_i× w_i× d denotes cross-modal features of i-th stage. d is set to 256.\n\n\n\n §.§ Center Anchor Mechanism\n\n\n\nThe specific motivation of center anchor mechanism is to provide a coordinate anchor for converting coordinates to normalized offset values based on anchor, which is demonstrated to reduce the difficulty of coordinate regression <cit.>.\n\nCenter Point Prediction. \nthe first step is to locate the rough center point c ∈ℝ^2 of the object referred by text. \n\nFollowing previous advanced keypoint prediction network (e.g., centernet <cit.>, cornernet <cit.>), the center point is represented as a gaussian heatmap Y∈[0, 1]^h× w by a gaussian kernel:\n\n    Y_ij = exp(-(i - c_i)^2+(j - c_j)^2/2σ^2),\n\nwhere σ^2 is an image size-adaptive standard deviation <cit.>. Firstly, we use this point representation method to generate target gaussian heatmap Y of ground truth center point c. Then the cross-modal features with largest spatial shape 𝐅_v_1 are used to generate prediction heatmap Y, i.e., Y = MLP(𝐅_v_1). Finally, a focal loss <cit.> is adopted as the training objective for optimization:\n\n    ℒ_c=1/hw∑^h,w_i,j{\n    (1 - Y_ij)^αlog(Y_ij)     ,Y_ij = 1, \n    \n    (1 - Y_ij)^βY_ij^αlog(1 - Y_ij)     ,Y_ij < 1,\n    .\n\nwhere α and β are hyper-parameters of the focal loss. Following previous works <cit.>, α and β are set to 2 and 4, respectively. For resolving the prediction heatmap to concrete coordinate, we set the point with peak value of prediction heatmap as the prediction center point c = {i_c, j_c}.\n\nCoordinate Normalization. To normalize a single point p = {i, j}, we adopt the scale and bias strategy:\n\n    p̂ = (î, ĵ) = (i - i_c/h, j - j_c/w),\n\nwhere p̂ denotes the point after normalizing.\n\n\n\n §.§ Parallel Vertex Diffusion\n\n\n\nParallel Vertex Diffusion (PVD) is the key component for implementing parallel vertex generation paradigm. \nIn this paper, we mainly refer to the usage of diffusion model in Pix2Seq-D <cit.>. The network which supports the reverse process of diffusion model is named “Denoiser\".\n\n\n\nDenoiser. Because normalized coordinates of vertexes are range in [0, 1], it needs to be scaled to [-b, b] for approximating gaussian distribution, where b is set to 1 <cit.>. Before inputting into denoiser, the noisy state x_t needs to be clamped to [-1, 1] and descaled from [-1, 1] to [0, 1]:\n\n    V_t = (x_t / b + 1)/2,\n\nwhere x_t is the noisy state of t-th step, V_t is the noisy vertex vector of t-th step. \nDenoiser is the denoise function for reverse transition of diffusion model. Firstly, the Denoiser converts the noisy state x_t to vertex vector V_t by Eq. <ref>. Then the vertex vector is embedded to vertex embeddings 𝒬_t by 2D coordinate embedding <cit.>. The embeddings are input into transformer decoder <cit.> as queries and interacted with cross-modal features F_c. For keeping high-resolution features, three scales of cross-modal features are circularly utilized by different layer of the transformer decoder <cit.>. The circle is repeated L times. After transformer decoder, the embedding is normalized by time embedding ℰ_t and is projected to refined vertex vector V_t-1. Finally, The refined vertex vector is processed by DDIM step <cit.> for acquiring  next noisy state x_t-1. To better understand the Denoiser, the detailed workflow is illustrated in Fig. <ref>.\n\nTraining phrase. Suppose that we already sample a single image I and its corresponding box B∈ℝ^2× 2 and mask M∈{0, 1}^h× w from dataset. 182 Preparation: The first step is to extract and normalize the vertexes of the box and mask. The vertexes of box are left top corner and right bottom corner {p_b^lt = (i_b^lt, j_b^lt), p_b^rb=(i_b^lt, j_b^rb)}. To represent mask as point sets, we retrieve mask contour via a classical contour detection algorithm <cit.> implemented by opencv <cit.>. Then the mask contour is used to sample the vertexes of mask {p_m^1 = (i_m^1, j_m^1), ⋯, p_m^N=(i_m^N, j_m^N)}, where N is the sampling number of mask vertexes. The vertex set is finally normalized by center anchor mechanism (Sec. <ref>) and flattened to vertex vector (V̂∈ℝ^4+2N): \n\n    V̂={î_b^lt, ĵ_b^lt, î_b^rb, ĵ_b^rb, î_m^1, ĵ_m^1, ⋯, î_m^N, ĵ_m^N}.\n\n183 Forward transition: The normalized vertex vector V̂ is set as the initial state x_0 of diffusion model and is forward transitioned to noisy state x_t, i.e., q(x_t|x_0): \n\n    x_t = √(γ(t))x_0 + √(1 - γ(t))ϵ,\n\nwhere ϵ and t are drawn from the standard normal distribution 𝒩(0, I) and uniform distribution 𝒰({1,⋯,T}), γ(t) denotes a monotonically decreasing function from 1 to 0. \n184 Point constraint: For training the denoiser, the noisy state x_t is reversely transitioned to the noisy state x_t-1, i.e., p_θ(x_t-1|x_t). Following Bit Diffusion <cit.>, the noisy state x_t-1 is required to approach initial state x_0:\n\n    ℒ_p =  𝔼_t∼𝒰({1,⋯,T}),ϵ∼𝒩(0, I)‖ f_θ(x_t, F_c,t) - x_0 ‖^2,\n\nwhere f_θ(·) is the parameterized Denoiser, x_t is derived by Eq. <ref> from x_0, F_c={𝐅_c_1, 𝐅_c_2, 𝐅_c_3} denotes all of the cross-modal features mentioned in Sec. <ref>. Eq. <ref> is point-to-point reconstruction loss.\n\nInference phrase. To generate vertex vector of box and mask, it requires a series of state transitions x_T→⋯→ x_t →⋯→ x_0. Because T is set to a large value, x_T∈ℝ^4+2N follows standard normal distribution 𝒩(0, I). Specifically, we sample a noise x_T from standard normal distribution 𝒩(0, I) and iteratively apply Denoiser to denoise x_T to implement the state transition chain for generation. During the generation, the vertex coordinates contained in noise vector x_T are parallelly denoised to ground truth vertex coordinates, fully reflecting the characteristics of parallel generation.\n\n\n\n\n\n\n\n\n §.§ Geometry Constraint\n\n\n\nThe main optimization constraint of vertex generation is point-to-point reconstruction loss (Eq. <ref>). This loss can modify the prediction vertex set to one by one approach the ground truth vertex set and does not consider the geometry difference between two sets. Inspired by point-in-polygon problem of computational geometry, we introduce a simple geometry algorithm (Angle Summation algorithm <cit.>) to make an optimization objective. \n\nAngle Summation. Computing the sum of the angles between the test point and each pair of points making up the polygon. As shown in <ref>, if this sum is equal to 360^∘ then the point is inside the polygon. As shown in <ref>, if this sum is less than 360^∘ then the point is outside the polygon. Therefore, we can calculate an angle summation map 𝒜∈(0, 360]^h× w according to the relative position between each pixel and vertexes of polygon V. The details of how to convert coordinates of polygon vertexes to angle summation polygon please refer to the appendix.\n\nTraining Objective. According to the \"Angle Summation\", prediction vertexes V and ground truth vertexes V̂ are converted to prediction angle summation map 𝒜 and ground truth angle summation map 𝒜̂. The angle summation map reflects the global geometry of vertex vector so that we hope the prediction angle summation map to approach the ground truth angle summation for reducing geometry difference:\n\n    ℒ_g =  𝔼_t∼𝒰({1,⋯,T})‖𝒜_t - 𝒜̂‖^2,\n\n\nwhere ℒ_g is named Angle Summation Loss (ASL).\n\n\n\n§ EXPERIMENTS\n\n\n\n\n §.§ Experimental Setup\n\n\n\nOur model is evaluated on three standard referring image segmentation datasets: RefCOCO <cit.>, RefCOCO+ <cit.> and RefCOCOg <cit.>. \n\nThe maximum sentence length n is set 15 for RefCOCO, RefCOCO+, and 20 for RefCOCOg. The images are resized to 640× 640. The sampling number of mask vertexes N is set by default to 36. \nOther data preprocessing operations are generally in line with the previous methods <cit.>.\nAs for the total diffusion step T, it is set to 1000 during training phrase. During inference phrase, T is set to 4 because DDIM step is adopted for accelerating sampling speed <cit.>.\n\nBased on previous works <cit.>, mask IoU and det accuracy are adopted to evaluate the performance of methods.\n\nAdamW <cit.> is adopted as our optimizer, and the learning rate and weight decay are set to 5e-4 and 5e-2.  The learning rate is scaled by a decay factor of 0.1 at the 60th step. We train our models for 100 epochs on 4 NVIDIA V100 with a batch size of 64.\n\nAll of the quantitative analyses are based on the val split of RefCOCO dataset.\n\n\n\n §.§ Main Results\n\n\nReferring Expression Comprehension. Single-task part of Tab. <ref> reports the comparison results between our method and previous referring expression comprehension methods.\n\nFrom Tab. <ref>, our PVD boosts previous methods by a clear margin.\n\nFor example, PVD based on Darknet53 <cit.> respectively surpasses TransVG <cit.> and TRAR <cit.> with +2.74∼+6.13% and +3.58∼+7.73% absolute improvement on RefCOCO+.\n\nThe results show that our PVD generally achieves SOTA when compared to previous referring expression comprehension methods.\n\nBesides, we construct a stronger network based on Swin Transformer <cit.> for achieving higher effectiveness, which gets larger improvement than previous methods.\n\n\n\n\n\nReferring Image Segmentation. Single-task part of Tab. <ref> reports the comparison results between our method and previous methods.\n\nFor comparing to previous SOTA, i.e., vision transformer-based methods (CoupleAlign, LAVT), we construct a stronger network based on Swin Transformer <cit.>.\n\nIn this case, our PVD can outperform LAVT on all of datasets by +0.8∼+2.09% and CoupleAlign on most of datasets by +0.12∼1.4%, which demonstrates our PVD achieves SOTA for referring image segmentation task. \n\nUnified Visual Grounding. Multi-task part of Tab. <ref> and Tab. <ref> report the comparison results between our method and previous unified visual grounding methods.\n\nCompared to SOTA method (SeqTR), our parallel vertex generation paradigm (PVD w/ Darknet53) outperforms it by +0.74∼+1.46% for referring expression comprehension and +0.74∼+2.14% for referring image segmentation, which verifies the superiority of our paradigm.\n\n\n\n §.§ Quantitative Analysis\n\n\n\nHow does the number of points affect the effectiveness? \nThe main advantage of parallel vertex generation paradigm compared to sequential vertex generation paradigm is easier to scale to high-dimension tasks. To verify this statement, we check the effectiveness of two paradigm with different number of prediction points in Fig. <ref>. Note that the number of points reflects the dimension of task. The figure provides two justifications: (1) the performance of sequential vertex generation is bottlenecked at 18 points, which substantiates the dimension dilemma of sequential vertex generation paradigm (the network is perturbed by error accumulation with large number of points and is underfitting to complex object with a small number of points). (2) the performance of parallel vertex generation stably increases with the number of points, which demonstrates that our paradigm is more scalable to high-dimension tasks.\n\nThe efficiency of Parallel Vertex Generation. Except for effectiveness, efficiency is also an aspect for verifying scalability. To further claim the advantage of parallel paradigm compared to sequential paradigm, we select several point settings (“9pts\", “18pts\", “27pts\", “36pts\") to benchmark the efficiency of two paradigms in Tab. <ref>. This table shows that the sequential paradigm is heavily impacted by the number of points and needs a large amount of extra computation overheads when scaling from a small number of points to a large number of points. For example, the inference speed becomes 4× of previous speed when scaling from “9pts\" to “36pts\". However, our paradigm only requires a little extra overhead to scale to high-dimension tasks. Specifically, the inference speed only increases +9ms when scaling from “9pts\" to “36pts\".\n\n\n\n\n\n\n\nThe advantage of scalability. The scalability ensures that parallel vertex paradigm have favorable effectiveness and efficiency for a large number of points. This advantage makes methods based on our paradigm more robust to samples with complex contours than sequential paradigm. To quantitatively analyze the robustness, we define “Difficulty Degree\" as the complexity metric and count the “Difficulty-IoU\" density map of samples in Fig. <ref> and Fig. <ref>. The calculation details of the metric please refer to appendix. Comparing two figures, we can find that our paradigm still has high IoU for hard samples (“Difficulty Degree\" > 0.2) but the IoU of sequential paradigm heavily decreases for hard samples, which justifies that the scalability to high-dimension tasks of our paradigm prompts better robustness to hard samples than seuqnetial paradigm.\n\nThe effectiveness of Center Anchor Mechanism. As mentioned in Sec. <ref>, CAM is proposed to cope with the high variance of unnormalized prediction vertex coordinates. To verify the effectiveness of CAM, we conduct ablation experiments. Tab. <ref> shows that PVD w/ CAM boosts vanilla PVD by +1.86% Acc for referring expression comprehension task and +1.59% IoU for referring image segmentation task, which justifies the effectiveness of CAM.\n\nThe effectiveness of Angle Summation Loss. Since the original training objective of PVD only achieves point-level constraint between prediction and ground truth vertexes, we propose ASL in Sec. <ref> for geometry constraint. In Tab. <ref>, PVD w/ ASL improves vanilla PVD by +1.79% Acc for referring expression comprehension task and +2.12% IoU for referring image segmentation task. Besides, ASL also improves PVD w/ CAM. These results comprehensively verifies the effectiveness of ASL.\n\n\n\n §.§ Qualitative Analysis\n\n\nAs described in Sec. <ref>, our parallel vertex generation paradigm is more effective and efficient than sequential vertex generation paradigm, especially for hard samples. To qualitatively verify this point, we select some easy cases and hard cases to illustrate the grounding difference between two paradigm. Fig. <ref> shows that our parallel vertex generation paradigm generates high-quality vertexes of bounding box and mask contour but the sequential vertex generation paradigm easily hits error objects or generates inferior vertexes, which justifies our paradigm is more capable of grounding referring expression on the image.\n\n\n\n§ CONCLUSION\n\n\nIn this paper, we observe that the sequence vertex generation paradigm (SeqTR) is trapped in a dimension dilemma although it is by far the best paradigm for unified visual grounding. On one hand, limited sequence length causes inferior fitting to objects with complex contours. On the other hand, generating high-dimensional vertex sequences sequentially is error-prone. To tackle this dilemma, we build a parallel vertex generation paradigm to better handle high-dimension settings. Since the diffusion model can scale to high-dimension generation by simply modifying the dimension of noise, it is adopted to instantiate our paradigm as Parallel Vertex Diffusion (PVD) for pursuing highly scalable unified visual grounding. Subsequently, Center Anchor Mechanism (CAM) and Angle Summation Loss (ASL) are designed and introduced into vanilla PVD for improving convergence. Our PVD achieves SOTA on referring expression comprehension and referring image segmentation tasks. Moreover, PVD has a better fitting ability for objects with complex contours and requires fewer computation costs than SeqTR, which justifies our parallel paradigm is more scalable and efficient than sequential paradigm.\n\nieee_fullname\n\n\n\n"}