{"entry_id": "http://arxiv.org/abs/2303.07376v1", "published": "20230313180023", "title": "Metal Factories in the Early Universe", "authors": ["Stephen Eales", "Haley Gomez", "Loretta Dunne", "Simon Dye", "Matthew W. L. Smith"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA"], "text": "\n\nfirstpage–lastpage\nRobustness of Bell Violation of Graph States to Qubit Loss\n    Rotem Arnon-Friedman\n    March 30, 2023\n==========================================================\n\n\n\n\n\nWe have measured the mass of metals in 13 submillimetre galaxies at z ∼ 4 in which the\ngas, based on previous observations, lies in a cold rotating disk.\nWe measured the metal masses\nusing either the submillimetre line or continuum emission\nfrom three tracers of the overall metal content -\ncarbon atoms, carbon monoxide molecules and dust grains -\nusing the first \ncalibration of this technique that treats all three\ntracers simultaneously <cit.>. \nWe obtain very similar mass\nestimates from the different tracers, which are\nsimilar to the entire metal content of\na present-day massive early-type galaxy.\nWe used the dynamical masses of these galaxies to set an upper limit on the mass of the interstellar\nmedium in each\ngalaxy, allowing us to set a lower limit on the metal abundance of the\nISM, finding values for many of the galaxies well above the solar value.\nThe only caveat to this result is that we cannot be certain for all galaxies that the\nemission from the tracer comes \nfrom within the region covered by the dynamical analysis.\nOur high values for the metal abundance are supported by a recent\nJWST study of \none galaxy which measured a super-solar metal abundance consistent with our limit.\nUsing two chemical evolution models, \nwe show \nthat the high metal masses and metal \nabundances are what is expected shortly after the formation of\na galaxy for a top-heavy IMF.\nWe suggest a scenario for galaxy evolution in which massive galaxies reach a\nhigh metal abundance during their formation phase, which is then\ngradually reduced by dry mergers with lower mass galaxies. \nWe use the chemical-evolution models to show that the metals in the outflows \nfrom massive early-type galaxies in their formation phase can quantitatively explain the\nlong-standing puzzle that such a large fraction (≃0.75) of the metals \nin clusters of galaxies is in the intracluster\ngas rather than in the galaxies themselves. \n\n\n\n\n\n\ngalaxies: ISM – galaxies: high-redshift – galaxies: evolution – submillimetre: galaxies – galaxies: formation – galaxies: abundances\n\n\n\n \n\n\n\n\n§ INTRODUCTION\n\n\nOne of the most distinctive properties of the galaxy population today is the strong relationship\nbetween metal abundance and stellar mass, with metal abundance increasing with\nstellar mass and\nreaching a value of about twice the solar value at the highest masses\n<cit.>. There is evidence that this relationship already existed\nfor galaxies at z ∼ 3-5, although with the metal abundances \na factor of ≃4 lower than for galaxies with the same stellar mass in the\nuniverse today <cit.>. \nThese relationships should be a good test of any theory of galaxy\nevolution, although in practice it is possible to explain them\nin a number of different ways\n<cit.>.\nRecent observations with the James Webb Space\nTelescope (JWST) have \nmeasured metal abundances in galaxies at z ∼7-8, confirming the\npicture that the metal abundances of high-redshift\ngalaxies are generally lower than for ones at the present day, although\nthe metal abundances of galaxies at z ∼7-8 are not clearly lower\nthan those of galaxies\nat z ∼ 2-3 <cit.>. \nLower metal abundances for galaxies at high redshifts are, of\ncourse, not really surprising\nbecause there has been less time then\nfor metals to have been made in stars and ejected into the ISM.\n\nNevertheless, there are signs in the universe today that there\nmust have been a period of rapid metal production early in the\nhistory of the universe.\nThe best evidence comes from rich clusters of galaxies, in which \nthe strong gravitational\nfields ensure that no metals should have been lost from the cluster.\nIn nearby rich clusters, roughly 75 per cent of the metals are in the\nintracluster gas rather than in the \ngalaxies <cit.>. \nClusters\ntoday are dominated by elliptical and lenticular galaxies - early-type\ngalaxies - in which the current rate of star formation, and therefore\nmetal production, is low. The best estimates, based on the spectra\nof these galaxies, suggest that most of the stars were formed during\nthe first two billion years after the big bang <cit.>. It \ntherefore\nseems likely that most of the metals that are in the intracluster gas\nwere formed during this early period of star formation and then ejected\nfrom the galaxies, although models based on this assumption have so far failed\nto reproduce the mass of metals in the intracluster gas by a\nfactor of between 2 and 10 <cit.>.\n\nTwenty-five years after they were discovered, the galaxies \nrevealed\nby the first submillimetre surveys <cit.> \nstill seem likely to be the\nancestors of the most massive early-type galaxies <cit.>.\nThe stellar populations and metal abundance ratios\nrevealed by optical spectra of the most massive galaxies\nin present-day clusters\nimply that  most of the stars in one of these galaxies \nmust have formed during the first two billion years after the \nbig bang during a burst of star formation of only ≃5 × 10^8\nyears <cit.>, requiring a star-formation rate of 100-1000 \nM_⊙ year^-1. The `submillimetre galaxies'\n(henceforth SMGs) are still the only high-redshift galaxies\nwith the necessary star-formation\nrates, and the wide-field submillimetre surveys with the Herschel Space\nObservatory and the South Pole Telescope have discovered many\nexamples with a star-formation rate >1000 M_⊙ year^-1\n<cit.>.\n\nThe high-redshift SMGs must contain a large mass of dust, which is mostly\ncomposed of metals, and they are therefore an exception\nto the\nmetal-poor high-redshift universe revealed by the early\nJWST observations. \nThe dust, however, makes it challenging to use standard optical techniques\nto measure the metal abundance, with estimates of the visual\nextinction often having\nextreme values (e.g. A_V > 450 - <cit.>). On top \nof this problem, there\nis the additional problem that many of the brightest SMGs are gravitationally\nlensed, which means there is a bright galaxy sitting in front of the\nSMG, contaminating its optical emission.\n\nIn this paper, we have developed an alternative way of measuring the\nmass of metals and the metal abundance in these galaxies. \nA standard technique for estimating the mass of the ISM in a \ngalaxy is to use a tracer of the\nISM, using the luminosity of the tracer to estimate the ISM mass. \nCarbon monoxide \nmolecules <cit.>, carbon atoms <cit.>, and \ndust grains <cit.> have all been used as tracers. \nAn objection\nto this method when it is applied to a high-redshift\ngalaxy is that it is almost always calibrated on observations\nin the Galaxy, and so it is often necessary to assume that\nthe metal abundance in the high-redshift galaxy is the\nsame as in the Galaxy <cit.>, which may not\nbe true.\n\nThis objection can be neatly sidestepped if the method is used to estimate the mass\nof the metals rather than the\nmass of the ISM, since when the method is used\nin this way it does not rely on any assumption about the\nmetal abundance. Using the first \ncalibration of the method that calibrates\nall the tracers above simultaneously <cit.>,\nwe have used this method  to estimate the mass of metals in a sample\nof SMGs at z ∼ 4.\nAn advantage of our approach is\nthat all the observations are in the submillimetre waveband, so\nare unobscured by the dust in the SMG, and there is also neglible contamination\nby emission from any gravitational lens.\n\nThis method, of course, is a way of estimating the total mass of metals\nbut not the metal abundance, which does require knowledge of the mass\nof the ISM. However, a large proportion of the extreme SMGs discovered\nwith Herschel and the South Pole Telescope are magnified by gravitational\nlenses,\nwhich has made it possible to\ninvestigate the motion of the gas with resolution as high as 50 parcsec\n<cit.>. Observations of the gas kinematics have revealed\nthat the gas in many of these\ngalaxies is distributed in a cold rotating\ndisk <cit.>, which makes it \npossible to estimate the mass of the\ngalaxy from the circular velocity of the gas. We have selected a sample of\nSMGs for which there is good evidence that the gas lies in a rotating disk.\nBy estimating the dynamical mass of each galaxy, we have put an upper\nlimit on the mass of the ISM, which has allowed us to put a\nlower limit on the metal abundance. \n\nThe arrangement of the paper is as follows. 2 describes our sample\nof galaxies. In 3 we describe our method for estimating \nthe mass of metals\nand the application of this method to our sample.\nIn 4, we use the dynamical masses\nof the galaxies to set an upper limit on the mass of the ISM of each galaxy and thus\na lower limit on the galaxy's\nmetal abundance. In this section, we also propose\na solution to the well known paradox that the estimate of the mass of the\nISM in a high-redshift galaxy is often greater than its dynamical mass.\nIn 5, we use chemical evolution models to interpret\nour results.\nIn 6\nwe discuss our results and we list our conclusions in 7.\nWe used the cosmological parameters given in <cit.>.\n\n\n\n\n\n§ THE SAMPLE\n\n\nWe selected a  sample of 13 high-redshift galaxies for which there is evidence from the velocity profile (velocity versus radius) and from the high value of the ratio of rotational\nvelocity to velocity dispersion (4.1)\nthat the gas in the galaxy lies in a cold rotating disk (Table <ref>).\nAll the galaxies \nalso have observations that make it possible to estimate the mass of the ISM in the galaxy, having at least\none, and in most cases more than one, of the following observations: spectral line observations of ; spectral line observations of CO; continuum observations of\ndust. \nEight of the 13 galaxies are gravitationally lensed, and for each of these there is a lensing model with an estimate of the magnfication and\nits uncertainty (Table <ref>). Twelve of the sample are at z>4 when the universe was less than 1.6 billion years old.  \n\n\n\n\n\n§ METAL MASSES\n\n\n\n\n §.§ The Method\n\n\nSince molecular hydrogen does \nnot itself emit spectral lines at the \ntypical temperature of the ISM, the standard method to estimate\nthe mass of the ISM is from the luminosity (L) of some\n`tracer'.\nThe mass of the ISM is then given by the\nequation: \n\n\n\n    M_ ISM = α L\n\n\n\nin which α is a calibration factor.\nCarbon atoms (), CO and dust grains have all been used as tracers.\nThe calibration factor\nis almost always ultimately based \non observations of the ISM in the Galaxy, from which it is \npossible to estimate the ISM mass more directly, for\nexample from gamma-ray observations or from the dynamical masses of molecular \nclouds <cit.>. Over the last decade the application of this technique to high-redshift galaxies\nhas led to the conclusion that as much as 90 per cent of the \nbaryonic mass in a high-redshift galaxy is in the form of gas\n<cit.>.\n\nAn obvious concern with this technique, especially when it is \napplied at high redshift, is the effect of metal abundance.\nAll of the tracers above  are made of metals, \nwhich are made in stars, and it therefore may be\ndangerous to assume that for a galaxy at high redshift, when there has \nbeen much less time since the big bang to make metals, the value \nof α is the same as in the Milky Way.  Nevertheless, although sometimes an attempt is \nmade to correct the value of α using a measurement of the metal \nabundance <cit.>,  \nthe \nvalue of the metal abundance is rarely known, and the standard optical techniques for estimating metal abundance\nall themselves have large systematic uncertainties\n<cit.>. Therefore, for the want \nof anything better, the assumption that the\ncalibration factors have the same values as in the Galaxy is \nthe one that is often made.\n\nIn this paper, we try to avoid this problem by using observations of the tracers to estimate the mass of the metals\nrather than the mass of the ISM. We calculate the mass of metals in a galaxy from the luminosity\nof a tracer, L using the equation:\n\n\n\n    M_ = α_ MW  A_ MW  L\n \n\n\nIn this equation, α_ MW is the \nsame calibration factor as in equation (1), to which we have added\na subscript to show it is\nultimately based on observations in the Galaxy\n(Milky Way), and A_ MW is the \nmetal\nabundance in the ISM in the Galaxy. We assume a metal abundance in the ISM in the Galaxy of 86.9, based of the latest\nestimates of the gas-to-dust ratio (167.2) and the fraction of the metals that is incorporated in the\ndust (0.52) <cit.>.\n\n\n\n\nThis equation should still be correct\nif the metal abundance in the galaxy that\nis being observed, A_ gal, is different from \nthe value in the Galaxy. \nFor the optically-thin tracers, dust and   <cit.>,\nthe value of the calibration factor for the galaxy, \nα_ gal,\nwill be inversely proportional to the galaxy's metal abundance, \nand therefore α_ gal A_ gal = α_ MW \nA_ MW. This is not \nso obviously true for CO because the \nline emission is optically thick. Nevertheless, although\nthe dependence\nof CO emission on metal abundance is still \nuncertain, the data does suggest a similar\nrelationship between α_ gal and A_ gal (Figure 9 of\n<cit.>).\n\nWe estimated the metal masses for the galaxies in the sample \nusing observations of the following tracers: carbon atoms (), carbon monoxide molecules (CO) and dust\ngrains, with calibration factors α_CI, α_ CO and α_ dust, respectively.\nWe used the calibration factors from <cit.>, which was the first attempt to calibrate all\nthree calibration factors simultaneously. The values we assume are\n1/α_850 μ m = 6.9×10^12 W Hz^-1 M_⊙^-1 for the dust,\nα_ CO = 4.0 M_⊙ (K km s^-1 pc^2)^-1 for the CO J=1-0 line,§ \nand \nα_CI= 17 M_⊙ (K km s^-1 pc^2)^-1 for the CI J=1-0 line.\nWe assume the uncertainties in the calibration factors α_850 μ m, α_ CO\nand α_CI are 31 per cent, 39 per cent and 19 per cent respectively, based on the values \nestimated in their paper.\n\nWe restricted ourselves to observations that are least likely to be affected by \nsystematic uncertainties. We therefore used observations of atomic carbon in the   J=1-0 line \nbut not in the   J=2-1  line\nbecause of the recent evidence of subthermal excitation, which leads to \nlarge uncertainties in ISM masses estimates from this line <cit.>.  \nWe used \nobservations of carbon monoxide in the J=1-0 and J=2-1 lines but not in the \nhigher J lines because the ratio of the line flux for these lines to the line flux for \nthe J=1-0 line, on which the calibration is based, depends strongly on the temperature \nof the gas. We estimated a line flux for the J=1-0 line \nfrom the line flux in the J=2-1 line using the flux ratio \nCO 2-1/1-0 = 2.97±0.61, \nwhich we derived from a study of carbon monoxide in a \nlarge sample of ultraluminous infrared galaxies <cit.>. \n\nWe only used dust as a tracer if there was an observation close in rest-frame wavelength to \n850 μ m, the wavelength at which the dust method is \ncalibrated <cit.>, which in practice mostly meant observations \nin ALMA Band 3. We found unpublished observations in the ALMA archive for three galaxies, and\nwe measured new flux densities for these, which are given in Table <ref>.\nWhere there continuum observations at many wavelengths <cit.>\nwe fitted a modified blackbody\n(F_ν∝ B_νν^β) to the flux densities\nat wavelengths ≥ 500 μ m, using a single dust temperature and \na dust emissivity index β=2. The advantage of estimating the \ndust temperature from only long-wavelength flux measurements is that the estimate should be \ncloser to the mass-weighted dust temperature; the inclusion of flux measurements on the \nshort-wavelength side of the blackbody peak biases the estimate towards the \nluminosity-weighted dust temperature <cit.>. \nOur estimated dust temperatures for these galaxies \nare listed in Table <ref> and they\nsupport the argument that the mass-weighted dust\ntemperature, even for galaxies with very high star-formation rates,\nis≃ 25 K <cit.>. For these galaxies, we\nhave estimated the rest-frame flux density at 850 μm from\nthe best-fitting modified blackbody. For the galaxies for which there is only\na flux measurement at a single wavelength, we estimated\nthe rest-frame flux density at 850 μm\nfrom this measurement and a modified blackbody with\na dust temperature of 25 K and β = 2.\n\nWhere necessary we corrected the line and continuum fluxes for the gravitational\nmagnification factors given in Table <ref>.\nWe have estimated errors on our metal masses by adding the following errors in\nquadrature: the error on the calibration factor (see above), the error on the\nflux of the tracer and, where applicable, the errors in the gravitational magnification\nfactor and in the CO 2-1/1-0 line ratio.\nAll the galaxies in the sample have observations of at least one tracer, 10 have \nobservations of two tracers, and seven have observations of all three. \n\n\n\n §.§ Corrections for the Cosmic Microwave Background\n\n\nAt these redshifts, the cosmic microwave background (CMB) can have a large effect on submillimetre \nand radio observations, leading to underestimates in both line and \ncontinuum flux measurements. We have made corrections to the line and continuum fluxes using the method in <cit.>.\nIn this work we estimate metal masses both with and without a correction for the CMB\nbecause of the potential for errors introduced by the assumptions necessary in making\nthis correction.\n\nFor optically thin radiation, which is the case for the dust continuum radiation at long wavelengths and the   J=1-0 line <cit.>, \nthe CMB corrections only depend on the temperature of the dust and the excitation temperature \nof the gas, respectively. We corrected the continuum flux\ndensities for each galaxy on the assumption that the temperature\nof the dust is 25 K (3.1). We then estimated the rest-frame\n850-μm flux density from the corrected flux densities using\nthe procedure described in 3.1.\n\nThe excitation temperature of the    1-0 line for SMGs is ≃25 K\n<cit.>, very similar to our estimates of the dust temperature (3.1), \nwhich is\nwhat one would expect if the dust temperature and kinetic temperature are the\nsame and the gas is in local thermodynamical equilibrium. We have made the assumption\nthat the dust temperature and excitation temperatures are the same and\ncalculated the CMB corrections using the equation for the increase in dust temperature\ncaused by the CMB given by <cit.> (equation 12 in their paper).\n\nThe corrections for the CO J=1-0 and J=2-1 lines\nare not so obvious\nsince the lines are optically thick, which \nmeans the corrections should depend on the opacity of the gas as well as \non its temperature <cit.>. The uncertainties in the corrections from the \ninclusion of opacity are so large that we decided not to try to include opacity but \nto apply the same method as for the optically-thin  line.\nOur \nCMB corrections for the CO lines therefore show the \npossible size of the effect of the CMB, but the actual size of the \ncorrection for these lines is very uncertain.\n\n\n\n\n\n\n\n §.§ Results\n\n\nTable <ref> lists our estimates of the mass of metals using the three independent tracers, with and without \na correction for the CMB. The results are shown in Figure <ref>. The figure shows that there is very good agreement between the masses calculated using the different tracers.\nFor nine out of 10 galaxies, the different mass measurements\nare consistent within the errors. The only exception is SPT0345-47, for which the estimates from\nCO and dust are in very good agreement, but both are higher than the 3σ upper limit from the   1-0 observation.\n\nThe line at the bottom of each panel shows an estimate of the mass of metals\nin the molecular phase of the ISM in the Galaxy (1.3×10^7 M_⊙), which we \nhave calculated from an estmate of the mass of molecular gas\nin the Galaxy of ≃ 1.1 × 10^9 M_⊙ <cit.> and estimates of the gas-to-dust ratio\n(167.2) and of the fraction of metals in dust (0.52) from <cit.>. The mass of metals in the ISM in these high-redshift\ngalaxies is ≃100-1000 times greater than in the molecular gas in the Galaxy today.\n\nSince it seems likely that the SMGs are the ancestors of present-day massive\nearly-type galaxies (1), it is interesting to compare the masses of metals for the\ntwo populations.\nA useful low-redshift benchmark is the\nHerschel Reference Survey (HRS), which contains the galaxies with the highest\nstellar masses in a volume of space that includes the Virgo Cluster <cit.>. \nSince most of the metals in an early-type galaxy are contained in the stars, we have estimated\nthe metal mass for the HRS early-type galaxies from estimates of their stellar masses <cit.>\nand a stellar metal abundance of \nlog_10(Z/Z_⊙) = 0.3, appropriate for the galaxies with the highest\nmasses <cit.>. In the figure, the\npurple horizontal band shows the range of metal mass\nfor the HRS early-type galaxies, from the one with the largest stellar mass down to\nthe one with the tenth largest stellar mass. When the correction for the CMB is included (lower panel),\nthe SMGs contain a mass of metals very similar to that in their probable descendants\nin the universe today.\n\n\n\n\n\n §.§ Limitations of the Method\n\n\nWe have used the calibration factors from <cit.>, but the values for all three calibration factors\nare very similar\nto the other recent best estimates in the literature. Our value\nfor α_ CO - \n4.0 M_⊙ (K km s^-1 pc^2)^-1) is very similar to the value adopted in the latest\nbig review article on the subject: α_ CO = 4.36±0.9 M_⊙ (K km s^-1 pc^2)^-1 <cit.>.\nIt is lower than the value of α_ CO = 6.5 M_⊙ (K km s^-1 pc^2)^-1 adopted by Scoville and\ncollaborators <cit.> but adopting this value would make the metal masses of the galaxies even higher.\nOur value for the calibration factor for the dust emission (1/α_850 μ m = 6.9 × 10^12 W Hz^-1 M_⊙^-1)\nis very similar to the value adopted in <cit.> (1/α_850 μ m = 6.2 \n× 10^12 W Hz^-1 M_⊙^-1). Our value for the calibration factor for atomic carbon\n(α_CI = 17.0 M_⊙ (K km s^-1 pc^2)^-1) is also similar to the value found in the most\ncomparable large study <cit.>: α_CI = 21.4^+13_-8 M_⊙ (K km s^-1 pc^2)^-1.\n\nAlthough our method \nshould still give the correct result if the metal abundance of the ISM in the SMG is\ndifferent from that of the ISM in the Galaxy, it still relies on the assumption that\nthere are no differences in the physics/chemistry of the ISM in the SMG from that\nin the ISM of the Galaxy that lead to changes in the values of the calibration\nfactors. We will look at this issue in the next section, in which we show\nthat there is evidence that the calibration factors for the SMGs are lower\nthan the standard values. But we will argue that this is\nprobably caused by changes in the metal abundance rather than changes in the\nphysics/chemistry of the ISM. If this is so, \nour estimates of the metal mass are unaffected. \n\n\n\n§ WHAT DO THE DYNAMICAL MASSES TELL US?\n\n\n\n\n\n §.§ Estimates of the Masses\n\n\nThe evidence that the gas in the SMGs lies in a cold rotating disk\nis two-fold.\nFirst, the SMGs all have velocity profiles (velocity versus radius) that are very similar to the velocity profiles \nof rotating disk galaxies in the universe today. Second, the galaxies mostly have ratios of v_ rot/σ > 10, in which \nv_ rot is the rotational velocity of the gas and σ is its velocity dispersion. Such a high ratio suggests that \ngravity in the galaxy is being balanced by centripetal force rather than by the internal pressure provided by the \nspread in stellar velocities. All 13 galaxies have published estimates of their dynamical masses, which are listed in \nTable <ref>. In all cases, these have been obtained using modelling packages such as  3DBarolo <cit.>, \nwhich make it possible to vary the velocities in concentric rings around the\ncentre of the galaxy, and also the position of the centre and the inclination and position angle \nof the disk, until the model provides a good fit to the spectroscopic data. \n\nFor six of the 13 galaxies, the authors of the mass estimate have made an explicit correction for the effect of the stellar \npressure, the `asymmetric drift’. In the other studies, the authors have simply assumed \nit is negligible because of the high ratio of v_ rot/σ. For each of the galaxies, \nwe have used the data in the original papers to estimate the relative contributions of the asymmetric drift \nand the centripetal force, and where necessary made a correction to the published masses (Appendix A).\nFor all but two galaxies the correction to the mass is ≤10 per cent.\n\nThe original papers sometimes list separate estimates of the baryonic and non-baryonic masses (we list\nthe former in Table <ref>).\nIn order to check that \nthe attempt to model separately the distribution of the baryonic and non-baryonic mass has\nnot led to systematic errors in the mass estimates - as well as to check that there are no\nother hidden systematic errors in the original analysis - we\nwe have made our own estimates of the dynamical masses from the\nvelocity profiles and\nthe estimates of the galaxy inclination in the original paper.\n\nWe have made estimates of the mass from the equation:\n\n\n    M_ tot = v^2 r/G  sin(i)^2\n\n\nin which v is the rotational velocity of the gas at a distance r from the centre of the\ngalaxy and i is the estimate of the inclination of the disk. We have made a correction to these\nestimates for the effect of asymmetric drift (Appendix A). \nEquation 3 gives the correct mass interior to \nr if the density distribution is spherically symmetric. If the density is \nnot spherically symmetric our mass estimates will be too high <cit.>,\nby roughly 40 per cent if the mass is distributed in a razor-thin exponential disk[Bovy et al. 2022, Dynamics\nand Astrophysics of Galaxies, galaxiesbook.org, accessed 7/4/2022].\nWe calculated errors on the mass estimates\nby combining the errors in velocity and inclination. \nTable <ref> lists our mass estimates and the distance from the centre of the SMG at which\nwe made the estimate.\n\nThe published mass estimates and own estimates are in good agreement for 10 out of the 13\ngalaxies, which agrees with the evidence that non-baryonic matter is neglible in the\ncentral regions of high-redshift galaxies <cit.>.\nFor the three galaxies\nwhere there is a significant discrepancy, our mass estimate is higher than the published\nmass by a factor of 1.6 for \nALESS073.1, by a factor of 2.1 for SPT0418-47 and by a factor of 1.5 for SPT0441-46. \n\n\n\n\n\n\n\n §.§ The ISM Mass Versus Dynamical Mass\n\n\nWe estimated the mass of the ISM in each galaxy using equation (1) rather than equation (2) but otherwise followed\nthe procedure described in Section 3.1, which means our ISM mass estimates\nare equal to the metal mass estimates in Table <ref>\nmultiplied by the gas-to-metal ratio (86.9).\nSince the dynamical masses we have measured ourselves are slightly larger than the ones in the literature,\nand therefore place a less stringent upper limit on the ISM mass, to be conservative we have used our mass estimates\nrather than the published ones.\n\nIdeally, we  would compare the dynamical mass with an ISM mass estimate made within the radius used to estimate\nthe dynamical mass. \nThis is possible for the observations of the dust, for which there are high-resolution observations which\nshow the emission is coming from\nwithin the radius listed in Table <ref> <cit.>).\nHowever, most of the CO and   observations\n<cit.>\ndo not\nhave enough resolution to show whether the CO and   emission is coming from within the region covered by\nthe dynamical analysis. There is a high-resolution map of \n  1-0 for one galaxy <cit.> and a high-resolution\nmap of CO for one galaxy <cit.>, and in both cases the line emission from the tracer\ncomes from the region covered by the dynamical analysis. \nFurthermore, by detailed radiative modelling of multiple CO and  lines from 24 high-redshift\nSMGs, <cit.> concluded that the emission in these lines\nis typically from a region within 3 kpc of the centre of the galaxy, very similar\nfor most of the galaxies to the radius of the region covered by the dynamical analysis\n(Table <ref>).\nNevertheless, we cannot say this for certainty for most of the\ngalaxies that the   and CO emission is confined to the region covered by the dynamical analysis. We discuss the possibility that there are halos of molecular gas\naround these galaxies, and its effect on our comparision of the dynamical and ISM\nmasses, in 6.1.\n\nFigure <ref> shows the comparison between the dynamical and ISM mass. The dynamical mass is a measure of the total\nmass, which is the sum of the masses of\nall the galaxy's components: gas, stars, and non-baryonic matter. But Figure <ref> shows that for many of the galaxies \nthe ISM mass estimate is actually higher than the estimate of the\ntotal mass. This paradox has been spotted many times\nbefore when CO has been used as a tracer, but the figure shows that there is the same problem when   and dust\nare used. There is, of course, the caveat that, as we noted above, for many of the galaxies\nwe cannot be sure that the emission from the tracer is from within the region covered by the dynamical\nanalysis, but we note that the discrepancies when dust is used as a tracer are just as large as for the other two\ntracers. Moreover, the galaxy for which there is a high-resolution map in  1-0, ID141 <cit.>, is one of the\nbest examples of this paradox.\n\n\n\n\n\n §.§ A Possible Solution  of the Paradox\n\n\nThis paradox has been noted many times before in papers in which CO has been used to estimate\nthe mass of the ISM.\nOur results show that the same problem is present when carbon atoms and dust grains are used. Unless the assumptions used in the dynamical estimates are \ncompletely wrong, or the emission from the tracer is mostly from outside\nthe region covered by the kinematic observations (4.2), the only way to\nmake the ISM masses consistent with the dynamical masses is to\nreduce the\nvalues of the three calibration factors.\n\nA crucial point to note when thinking about this issue is that the\ngood agreement between the ISM mass estimates made with the different tracers\nimplies that if the calibration factors are lower for an SMG than the values\nwe have assumed, which are ultimately based on\nobservations in the Galaxy <cit.>, all three calibration factors\nmust be lower by a similar factor. This conclusion is supported by\nthe analysis in <cit.> of 407\ngalaxies in the redshift\nrange 0 < z < 5.  By examining\nthe ratios of the luminosity of the emission from the three tracers,\nthese authors concluded that there was no difference in the ratios\nof the calibration factors between \nnormal galaxies and galaxies with very high star-formation rates \nand also between\nSMGs\nat z < 3 and z > 3.\nThese results strongly suggest that if the values of the calibration factors\nfor the SMGs are  different from the standard values, they must all be different\nby a\nsimilar factor.\n\nThere are two obvious reasons why the calibration factors\nfor the SMGs might be lower than the values estimated\nfrom observations of the ISM in the Galaxy.\nThe first is that physical/chemical/structural differences in the ISM of a high-redshift\nSMG relative to the ISM in the present-day Galaxy might easily\nlead to changes in the calibration factors.\nThis has been the explanation that has always been favoured before when\nthe discrepancy between the dynamical masses and the ISM masses estimated \nfrom CO observations has been noticed.\nThis is quite a reasonable supposition because the hundred-fold\ndifference in star-formation rates between an SMG and the Galaxy might\neasily lead to differences in the structure, physics or chemistry of the\nISM.\n\nThe observational evidence that α_ CO is lower\nin a galaxy with a high star-formation rate is, however, very slight,\nbeing based almost entirely\non a study of CO\nin the \nnuclei of low-redshift ultra-luminous infrared galaxies (ULIRGs) <cit.>. These authors\nargued that because of the strong shear in the velocity field in\nthe central regions of these galaxies, where most of the CO is found,\nthe CO emission \nmust be from a moderate-density warm intercloud medium rather \nthan from self-gravitating clouds, as in the Galaxy. They\nestimated a\nvalue for α_ CO lower than the standard value by a factor of ≃5.\nThe star-formation rates of the SMGs are similar to those of the ULIRGs,\nso it has always seemed plausible that the values of α_CO might be\nlower for them as well, although the ISM of an SMG is distributed over\na much larger region than the ISM in a ULIRG, over which there is much less shear in the velocity \nfield <cit.>.\nVery recently, however, in the first comprehensive multi-line investigation of CO in\nSMGs,\n<cit.> estimated a value of α_ CO for these objects very\nsimilar to the standard value. They concluded\nthat much of the CO\nin SMGs is in warm dense gas, which would have been missed by the observations in \nlow-J CO transitions, which were the ones used to observe the ULIRGs <cit.>. With only observations\nof the SMGs in the low-J CO transitions, they \nconcluded that they would have estimated a value of α_ CO similar to\nthat for the ULIRGs.\n\nNevertheless, it seems likely that the ISM in a high-redshift SMG is different in some\nways from the ISM in the Galaxy, and it is easy enough to think of differences\nthat might lead to changes in the calibration factors. The\nproblem with this explanation is that it is difficult to think of\ndifferences that might lead to all three calibration factors\nbeing changed by the same factor.\nDifferences in the spatial and temperature distribution of the ISM might lead to a change\nin α_ CO;\ndifferences\nin the sizes, structure or composition of the dust grains \nmight lead to a change in α_ dust; and\nthe high star-formation rate in an SMG would probably lead to\na higher density of cosmic rays than in the Galaxy, which would\nwould lead to\ndifferent proportions of carbon monoxide and atomic carbon, which might lead\nto a change in α_CI <cit.>. \nTherefore, it is easy enough to think of differences that would lead to \nchanges in the calibration factors.\nHowever, since the emission from each tracer depends on such different\nproperties of the ISM, it seems very unlikely that these differences would lead\nto the \nthree calibration factors all being reduced and being reduced by a similar factor.\n\nThe alternative explanation is that the metal abundance of the ISM in the SMGs is\nhigher than in the Galaxy today. This would also provide a natural explanation of why the three\ncalibration factors change by similar amounts. \nAs\nlong as there is no change in the relative abundances of different elements, \nthe optically-thin   and dust emission are\ndirectly proportional to the metal abundance of the ISM, which\nimplies that α_CI and α_ dust are inversely proportional to metal\nabundance. The relationship between the optically-thick CO emission and\nmetal abundance is more uncertain, but a compilation of the data\nis consistent with a similar relationship\n<cit.> (see their Figure 9).\nA higher metal abundance\nin SMGs would therefore be a natural explanation of why the\ncalibration factors are \nlower by a similar factor.\n\n\nFor the rest of this paper, we assume that the second explanation is the correct one. \nWe cannot rule out the first\nexplanation, but it does seem unlikely that changes in different aspects of the ISM should\nhave conspired to produce very similar changes in the calibration factors. \nIf we are wrong and\nthe first explanation is the correct one,\na decrease by a factor of X in the three calibration factors would mean that our estimates of the metal masses\nin 3 would also need to be reduced by a factor X.\n\n\n\n §.§ Metal Abundances\n\n\nWe have estimated a lower limit to the metal abundance of each galaxy\nfrom the equation:\n\n\n    Z/Z_⊙ = M_ metals/M_ dyn× 0.0142\n\n\nin which M_ metals is the metal mass corrected\nfor the effect of the CMB, M_ dyn is the dynamical\nmass, and the number on the right-hand side is the bulk metal fraction of the Sun \n<cit.>.\nOur estimates of Z, which range from 0.9Z_⊙ to 12.9Z_⊙,  \nare listed in Table <ref> and a histogram of the\nvalues is shown in Figure <ref>.\n\n\n\n\n\n\n§ METALS INSIDE AND OUTSIDE \nGALAXIES - CHEMICAL EVOLUTION MODELS\n\n\nSuch high metal \nmasses and metal abundances at such early times might\nbe surprising because there would have been much less time to make the \nmetals. We have used\ntwo chemical-evolution models to investigate \nthe cause of these high values.\nThe first is the\nwidely used gas-regulation model <cit.>.\nIn this model, there is a flow of gas from \nthe intergalactic medium into the galaxy, and \nthere is also an outflow \nwith a rate proportional to\nthe galaxy's star-formation rate, \nwhich leads eventually to the mass of the ISM reaching an equilibrium value. The mass \nof metals that is produced in this model depends \non the strength of the outflow\nand the form of the stellar initial mass function (IMF).\n\nThe gas-regulation model is based on the \n`instantaneous recycling approximation’, \nin \nwhich it is assumed that all the \nmetals produced by a newly \nformed population of stars are made the moment the stars are born \nand immediately released into the ISM. This assumption is likely to\nbe a particularly poor one for SMGs\nbecause \nof their very short gas depletion times\n <cit.>. We have therefore also included the predictions of a model \nthat does not include this assumption, \nwhich we constructed to model the evolution of one of \nthe galaxies in our sample <cit.>. This model also \nincludes more realistic inflows and outflows and takes account \nof the dependence of stellar yields on metal abundance.\n\n\n\n §.§ The Gas-Regulation Model\n\n\nIn this model, there is an outflow\nwith a rate equal to a constant (Λ) times the \ngalaxy's star-formation rate, which leads to the \nmass of the ISM eventually \nreaching an equilibrium value (hence the \nterm `gas regulation’). We use the analytic formalism \nof <cit.>, which makes it possible to follow the evolution\nof a galaxy from t=0 to t >> τ_ eq, \nwhen the galaxy asymptotically approaches an \nequilibrium state. \nIn this equilibrium state, the \ngas mass, the metal abundance of the gas and the mass of metals in the\ngas are \nconstants, although the fraction of the mass of the galaxy that \nconsists of stars continues to climb as new stars are made out of gas. \n\nThe equilibrium time, τ_ eq is given by\n\n\n    τ_ eq = τ_ dep/1 - R + Λ = \n    1/ϵ(1 -R + Λ)\n\n\nin which\nτ_ dep is the depletion time (the \nratio of the gas mass to the star-formation rate), ϵ\nis the inverse of this (the star-formation efficiency), \nand R is the fraction of the mass of a \ncohort of newly formed stars that is eventually returned \nto the ISM, which in the instantaneous recycling approximation \nhappens immediately. The equilibrium time therefore \ndepends on conditions in a particular galaxy, and so \nwe express the time dependence of our \nmodels in units of the equilibrium time, so the models are applicable to all the galaxies in our sample. \n\nWe have used the following equations taken directly from <cit.>:\n\n\n    M_ gas = Φ/ϵ (1 - R + Λ)(1 - e^- tτ_ eq)\n\n\n\n\n    M_ star = Φ/ϵ1-R/(1-R+Λ)^2[t/τ_ eq - (1 - e^- tτ_ eq) ]\n\n\n\n    Z_ gas = y/1 - R + Λ(1 - e^-tτ_ eq)\n    [ 1 - e^-(t/τ_ eq(1 - e^-t/τ_ eq ) )]\n\n\nIn these equations, y is the yield, the mass of metals produced\nby one solar mass of stars, and Φ is the rate at which gas is flowing\nonto the galaxy. We can combine\nequations (6) and (8) to get an estimate of the total mass of metals\nin the ISM:\n\n\n    M_ metals = Z_ gas M_ gas\n\n\nWe then combine equations (6), (7) and (9) to calculate the ratio\nof the metal mass to the total mass (M_ gas + M_ star). Neither this\nratio nor the metal abundance of the ISM (equation 8) depend\non the values of Φ or ϵ but they do depend on the\nvalues of R, y and Λ. The first two of these\ndepend on the choice of the IMF.\n\n\n\n\n\n\n\n §.§ A Bespoke SMG Model\n\n\nThe instantaneous recycling assumption \nmay be particularly poor for SMGs because\nof their very short gas-depletion and dynamical times\n<cit.>. We have therefore also \nused a chemical evolution model we developed\nfor the z=4.24 submillimetre galaxy ID141, \nwhich does not include this assumption and which incorporates\nthe lifetimes of the stars that make the metals <cit.>.\nWe refer the reader to our earlier paper for more details of the\nmodel but, in brief, the galaxy starts as a cloud of gas with no\nheavy elements, with the gas then being converted into stars using\nan assumed IMF and star-formation history.\nOutflows of gas and metals are based on \nprescriptions of feedback from stars and active galactic \nnuclei, and the model includes inflows via accretion from the \ncosmic web. Stars eject gas, metals and dust in each \ngeneration based on prescriptions for the \nstellar yield of low-mass <cit.> and \nhigh-mass stars <cit.> and for \nthe \nremnant mass function <cit.>. \n\n\n\n §.§ Results\n\n\nWe have considered four different \nforms for the IMF. The first two are the\ncommonly used\nChabrier and \nSalpeter IMFs. The other two are top-heavy IMFs \nin which there is a higher proportion of \nhigh-mass stars. One of \nthese was proposed to explain the dynamics of \nlow-redshift elliptical galaxies <cit.>, the \nother to explain the observations of isotopologues \nof carbon monoxide in four SMGs <cit.>. We \nhave estimated the values of the return fraction, \nR, and the yield, y, for each IMF from \na compendium of stellar yields <cit.>. \nThe values \nare listed in Table <ref>.  \n\nThe prediction of both models\nfor the ratio of metal mass to total\nmass (gas plus stars) versus time are shown in \nFigure <ref> and the predictions for metal abundance versus time in Figure <ref>. \nTime is plotted in units of the equilibrium time, a key parameter\nof the gas-regulation model, along the top of each figure.\nTo give an impression of the timescales, we have calculated\nthe value of τ_ eq in years using a Chabrier IMF and the\nproperties of the galaxy ID141 <cit.>, and then plotted\ntime in the usual units along the bottom of the figures,\nalthough strictly this is only correct for one galaxy and one\nform of the IMF. We stopped the model based on ID141 <cit.> when\nit reached a stellar mass of 5 × 10^11 M_⊙ when we assume\nan outflow clears the galaxy of its ISM <cit.>.\nThe left panel in each figure shows the predictions for\nthe standard Chabrier and Salpter IMFs and the right panels show\nthe predictions for the top-heavy IMFs.\n\nIn Figure <ref>, we have plotted our estimates for the SMGs\nof the ratio of metal mass\nto total mass, \nwhich we assume is given by the dynamical mass.\nIn Figure <ref>, we have plotted our estimates\nof the lower limits on the metal abundance. \nSince the ages of the galaxies are unknown, we have plotted\nour estimates in both figures at\narbitrary points along the time axis.\n\nFigure <ref> shows that the predictions of  both \nmodels are very similar, with the only difference \nbeing, as expected, that the ratio of metal mass \nto total mass peaks later for the model that includes \na delay from stellar lifetimes. Nevertheless, \neven in this model, the peak is reached very early, \nonly ≃2 × 10^8 years after the \ngalaxy begins to form, much less than the time \nsince the big bang at these redshifts. \n\nThe left-hand panel of Figure <ref> shows that the predictions for\nthe two standard forms of the IMF are too low compared\nwith our estimates \nfor the SMGs.\nThe left-hand panel of Figure <ref> shows that while it is possible to\nreproduce the observed metal abundance for a standard IMF and\na closed-box model, this model seems unlikely given the evidence\nfor outflows from star-forming galaxies in the high-redshift\nuniverse <cit.>.\n\nThe right-hand panels in both figures show that with a top-heavy IMF\nthe predictions agree better with the observations.\nWe note that although we don't know the ages of these\ngalaxies, it seems likely that we are seeing them at an\nepoch at which the dust mass, and therefore the mass of metals\nin the ISM, was at close to its maximum value, simply because\nof the strong selection bias towards high dust masses for\ngalaxies discovered in a submillimetre survey.\n\nThe curves in both figures for both sets of models are sensitive to\nthe choice of input yields and the chosen remnant mass function\n(which in turn affects the return fraction R). Different stellar\nyield tables <cit.>, \nfor example, can reduce the yield, y, and hence\nthe metal abundance, Z_ gas, by 20-30 per cent for the \nCappellari IMF <cit.>.\nThis is not enough to affect the conclusions above.\n\n\n\n\n\n\n\n\n\n\n §.§ The Metals in the Intracluster Gas\n\n\nOur analysis shows that the SMGs\ncontain very large masses of metals. There is plenty of evidence\nfor massive outflows of gas from high-redshift\nstar-forming galaxies <cit.>.\nIn this section, we will \ninvestigate whether the metal production in the SMGs\nmight be a significant source of the metals in the\nintergalactic medium today. As a test case, we will consider the\nlong-standing conundrum that ≃75 per cent of the metals in rich\nclusters of galaxies is in the intergalactic gas rather than in\nthe galaxies themselves <cit.>, which \nprevious models have not been\nable to explain <cit.>. \nThe strong gravitational fields of clusters mean that any metals\nproduced in a cluster should have stayed in the cluster.\nThe clusters\nare dominated by early-type\ngalaxies and the most likely ancestors of these galaxies are the\nSMGs (1), \nand it\ntherefore seems likely that the \nmetals produced in the SMGs\nmust have contributed at least in part to the metals found\nin the intracluster gas. We use the\ngas-regulation model to estimate how big a part this might\nhave been.\n\nWe follow on from the exposition of the gas-regulation model in 5.1.\nOn the assumption that the metal abundance in the outflowing gas is the same\nas in the ISM in the galaxy, the mass of metals ejected into intergalactic\nspace is given by:\n\n\n    M_ ejected metals = ∫^t_ final_0 Z_ gasΛ SFR dt\n\n\nin which SFR is the star-formation rate, which is given by:\n\n\n    SFR = Φ/1 - R + Λ (1 - e^-t/τ_ eq)\n\n\nThe predicted mass of metals that is incorporated in the stars within\na galaxy is given by:\n\n\n    M_ metals, stars = (1-R) ∫^t_ final_0 Z_ gas SFR dt\n\n\nThe predicted metal abundance of the stars is then given by:\n\n\n    Z_ stars = ∫^t_ final_0 Z_ gas SFR dt/∫^t_ final_0  SFR dt\n\n\nIn Figure <ref>, we have plotted on the y-axis the prediction of the model \nfor the ratio of the mass of metals carried away \nin the outflow to the \nmass of the metals that is incorporated in \nthe galaxy’s stars. The x-axis shows the model’s \nprediction for the final metal abundance \nof the stars (mass of metals divided by mass of stars). \nThe former is given by the ratio of equations (10) and (12), the latter\nby equation (13). \nThe former is independent of\nt_ final and the latter is\nonly weakly dependent on it -  we have set its value to 20 τ_ eq.\nThere is evidence that the average value of Λ for the\npopulation of high-redshift star-forming galaxies lies\nbetween 1 and 2 <cit.>. We have plotted the predictions of the\nmodel for outflows with these values and for the four forms of the IMF.\n\n\n\nAlso plotted in Figure <ref> are the rough observational\ntargets for the model. The horizontal blue band shows the\nobserved range of the metal ratio (mass of metals in cluster gas divided\nby mass of metals in the cluster galaxies) for present-day rich clusters <cit.>.\nThe two vertical lines show solar metal abundance <cit.> and\na metal abundance of twice solar, typical of the most massive galaxies\nin the universe today <cit.>.\n\nAll the models predicts values that are roughly in the target area, \nwhich, given their simplicity, shows that\noutflows of metals from SMGs are at\nleast a plausible source for the metals in the intracluster gas\nin present-day rich clusters.\n\n\n\n§ DISCUSSION\n\n\n\n\n §.§ The Observational Results\n\n\nWe have two main observational results:\n(1) the mass\nof metals in an SMG is very high, as large as the entire\nmetal content of a massive low-redshift early-type galaxy; (2) the metal\nabundance is also very high, often well over the solar\nvalue. In this section, we will discuss the limitations of these\nresults. In the following section we will discuss their implications\nfor galaxy evolution.\n\nThe first result seems robust. It is based on the \nestimates of the calibration factors of <cit.>, who made the first\nattempt to estimate all three calibration factors\nin a self-consistent procedure.\nNevertheless, the values we have used\nare actually quite similar to \nthe other recent estimates in the literature (3.4).\nThe comparison betweent the ISM mass estimates and dynamical mass estimates\nin Figure <ref> implies that the true calibration factors for the SMGs\nmust be lower than these\nvalues, but as long as this\ndecrease is caused by\nan increase in the metal abundance rather than\ndifferences in the ISM that reduce all three calibration\nfactors by a similar factor, our estimates\nof the metal mass are unaffected (4.3).\nSince the calibration factors all depend on such different aspects of\nthe physics and chemistry of the ISM, the latter explanation seems unlikely, but it is not impossible.\n\nThere are two causes for concern over the second result. The first\nis that it does rely\non the dynamical masses being correct. We have made our own\nestimates of the dyanamical masses from the published rotation curves, obtaining\nsimilar values to the ones in the literature, but both sets of masses are\nbased on the assumption that the gas in these galaxies is distributed in a cold\nrotating disk. The velocity profiles for these galaxies do look remarkably like\nthe rotation curves of present-day disk galaxies (see, for example, the beautiful\nvelocity profile of SDP81 in <cit.>), but it is possible that there may\nbe an alternative explanation of these very disk-like velocity profiles.\n\nA more immediate concern is that for the most of the CO and   observations, we\ncannot be sure that the emission is from within the region traced by the dynamical\nanalysis. There have been some recent claimed detections of molecular\ngas in the halos around high-redshift AGN <cit.>.\nIf some of the CO or   emission is coming from halos around the SMGs,\nthe conflicts between the ISM and dyanamical masses would be less and the\nlimits on the metal abundance weaker.\nTo estimate the possible size of this effect, we can\nuse the results of\n<cit.>, who used a stacking\nanalysis to search for extended emission in the   2-1 line\naround\nextremely red quasars. They estimated average molecular masses of\n10^10.8±0.14 M_⊙ and 10^10.2±0.16 M_⊙ for the\ngalaxy and halo components, respectively. If these proportions applied\nto the galaxies in our sample, our limits on the metal abundance of the SMGs\nwould be lower by ≃20%, which would still require\nvery high values of the metal abundance. It would leave unaffected our estimates\nof the total mass of metals, although the metals would be distributed over\na larger region. An obvious way to test whether the emission from\nthe CO and   is confined within the region traced by the dynamical\nanalysis would be future high-resolution observations with\nthe JVLA in the low-J CO lines and with ALMA in the   1-0 line.\n\nOur lower limits for the metal abundance in these galaxies are much higher\nthan almost all the estimates of the metal abundance in high-redshift galaxies\nso far made with the JWST\n<cit.>. By good fortune, though, one of the galaxies\nin our sample already has a measurement of the metal abundance with the JWST: SPT 0418-47  \n<cit.>. Using two of the standard methods\nfrom optical spectroscopy (N2 and S23), these authors estimated a metal abundance of\nZ ∼ 1.6 Z_⊙. Our lower limit\nfor this galaxy is Z > 0.58 Z_⊙, and so for this galaxy at\nleast the two methods give consistent results.\n\n\n\n §.§ Implications for Galaxy Evolution\n\n\nWe have shown that it is possible to reproduce the high values of the metal abundance in the\nSMGs\nwith chemical evolution models (5). In these models, the\nmass of metals\nin the ISM of an SMG  is at its highest only ∼ 2×10^8 years after the\ngalaxy begins to form, much less than the age of the universe at these redshifts.\nThe values for the ratio of metal mass to total mass (Figure <ref>) and of the metal\nabundance (Figure <ref>) can be\nbe reproduced by the models as long as the IMF has a \nhigher fraction of high-mass metal-producing stars than in the Galaxy.\nOur conclusion that the IMF in the SMGs is `top-heavy' is\nsupported by observations of isotopologues of CO in four SMGs,\nwhich can also only be explained by a top-heavy IMF <cit.>.\n\nWe have also used these models to show that the metals in outflows from the\nSMGs\nprovide a plausible explanation of why such a large fraction of the metals in present-day\nclusters is found in the intracluster gas \n(5.4). Figure <ref> shows that this conclusion does not require a\ntop-heavy IMF, since even models with standard IMFs do well at reproducing\nthe proportions of the metals in the galaxies and the gas - the success of the models\nis due to the large metal masses and vigorous outflows of\nSMGs rather than the high values of the metal abundance,\nwhich is the observational result that requires a top-heavy IMF.\nOur model is, of course, a very simple model, which we have applied to\nSMGs with some of the highest star-formation rates known, which are\nlikely to be the ancestors of only the most massive early-type galaxies in\nclusters. Present-day clusters contain galaxies with a wide range of stellar\nmass.\nA conclusive demonstration\nthat the metals in galactic outflows are the source of the\nmetals in the intracluster gas would require the model to \ninclude galaxies covering the whole mass range, incorporating\nthe\nrelationship between metal abundance and stellar mass, about which we\nknow quite a lot (1), and the relationship between\noutflow rate and\nstellar mass, about which we as yet know little <cit.>.\n\nOur estimates of the metal abundance in the SMGs are surprisingly large,\noften even larger than the values of the metal abundance of the galaxies\nthat are likely to be their descendants.\nTheir descendants in the universe today are likely to\nbe the massive early-type galaxies (1), which reach a metal abundance\nof about twice the solar value <cit.>.\nThe immediate descendants of SMGs\nat z ∼ 4 seem likely to be the population of quiescent galaxies\nat z ∼ 3 <cit.>. \nThere is only one galaxy in this population for which there\nis a measurement of the metal abundance, which is\n∼ 1.8 Z_⊙ <cit.>. In the case of both populations, the\nvalues of the metal abundance for the SMGs are often higher than\nthe values for their putative descendants.\n\nIs there a way that the subsequent evolution of the\nSMG might have reduced its initial metal abundance?\nThe \nevolutionary route from an SMG, a galaxy with a small physical size but with a\nhuge star-formation rate, to a massive early-type galaxy in the universe\ntoday, a galaxy with a large\nphysical size but a low star-formation rate,\nis still very uncertain <cit.>.\nWe speculate that it is the sequence of mergers that seems likely to have occurred since\nthe SMG epoch - the obvious way of pumping up the physical size of the\ngalaxy - which might have reduced the initial metal abundance.\nThe ages of the stellar populations of present-day early-type\ngalaxies imply that most of the star formation in one of\nthese galaxies must have happened in the SMG epoch, with relatively\nfew stars (and thus small amounts of metals) having been formed in the subsequent \nevolution of the galaxy <cit.>.\nIt therefore seems likely that most of the mergers that occurred\nafter the SMG epoch would have been dry mergers, because otherwise\nthere would have been new bursts of star formation.\nThe masses of the SMGs in Table 4 are only a few times lower than the\nmasses of the most massive early-type galaxies today, so it seems likely\nthat most of the mergers would have been minor mergers in which the galaxy\nthat was the direct descendant of the SMG was the largest partner,\nbecause otherwise the galaxy would have grown too large by the present\nday. Given the\nstrong relationship between metal abundance and stellar mass seen at all\nepochs (1), it therefore seems likely that each merger would have reduced\nthe metal abundance of the SMG-descended galaxy.\n\n\n\n§ CONCLUSIONS\n\n \nWe have measured the mass of metals in 13 submillimetre galaxies (SMGs) at z ∼ 4 in which the gas, based on\nprevious observations, lies in a cold rotating disk. We measured the metal masses using observations\nof CO in either the J=1-0 or J=2-1 lines, observations of atomic carbon in the   1-0 lines and\ncontinuum observations of dust. We used the values of the calibration factors for these\ntracers obtained by the first attempt to calibrate all three tracers simultaneously\n<cit.>. For 10 of the 13 galaxies there are observations of\nat least two tracers and for 7 galaxies there are observations of all three. Our method is independent of the\nmetal abundance in the SMGs, in contrast to the method in which the tracer\nis used to estimate the total mass of the ISM. We obtained the following results:\n\n\n\n\n  * We obtained very similar mass estimates for the different tracers. Our estimates\nof the mass of metals in the SMGs are similar to the entire metal content of a massive early-type\ngalaxy at the present day.\n\n\n  * There is a well known paradox that when the mass of the ISM in an SMG is estimated\nfrom CO observations it is often \noften higher than the dynamical mass. We show that the same is true when the\nmass of the ISM is estimated from   1-0 or from dust continuum\nobservations. We argue that the most likely explanation is that the metal abundance\nin SMGs is higher than in the Galaxy. The alternative explanation is that the\nISM in an SMG is different in its chemistry, physics or structure from the ISM in the Galaxy in just such a way that the\ncalibration factors for all three tracers are reduced by a similar factor, which is possible\nbut seems unlikely.\n\n\n  * On the\nassumption that our explanation of this\nparadox is the correct one, we used the dynamical masses of the galaxies to set an upper limit on the mass\nof the ISM in each galaxy, allowing us to set a lower limit on the metal abundance.\nWe found lower limits on Z/Z_⊙ of between 0.9 and 12.9. The caveat to\nthis result is that we cannot be sure that for most of the galaxies the CO and   emission\nis confined to the region of the dynamical analysis. \nOur lower limits on the metal abundance are much higher than virtually all the recent measurements\nof the metal abundance in high-redshift galaxies from JWST observations, although\nfor the one galaxy in our sample for which there\nis a JWST measurement,\nthe JWST measurement gives a super-solar metal abundance that is\nconsistent with our lower limit.\n\n\n  * We have used chemical evolution models to investigate the cause of the high metal masses\nand abundances. We show that these are what is expected shortly after the formation\nof a galaxy if the stellar IMF is top-heavy with a higher fraction of high-mass metal-producing\nstars than in the Galaxy.\n\n\n  * We use these models to show that the metals in the outflows from these galaxies can explain quantitatively\nthe long-standing conundrum that ≃75 per cent of the metals in present-day rich clusters are in the\nintracluster gas rather than in the galaxies.\n\n\n  * Our estimates of the metal abundance in the SMGs are higher than the values of the metal\nabundance in the galaxy populations that are their probable descendants. We speculate that\nthe explanation is the gradual dilution of the metal content by a sequence of dry mergers after the\nSMG epoch.\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nWe thank Tim Davis for comments on an early version\nof this manuscript. \nStephen Eales and Matthew Smith\nthank the Science and Technology Facilities Council for support \n(consolidated grant ST/K000926/1).\n\n\n\n\n\n\n§ DATA AVAILABILITY\n\n\nThe ALMA data referenced in Table <ref> is in the ALMA archive. All the other observational\ndata is in published papers. \n\n\n\n\n\n\nmnras\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ APPENDIX A: CORRECTION FOR THE EFFECT OF ASYMMETRIC DRIFT\n\n\nWe have made a correction to the dynamical masses for the effect of stellar pressure (asymmetric drift) for\nthe six galaxies for which this correction was not made in the original analysis in the literature, using the\nformalism given in Appendix A of <cit.>.\nThe gravitational potential is given by:\n\n\n    GM(<r)/r = v_ rot^2 + ησ^2(r/r_d)\n\n\n\nin which v_ rot is the rotational\nvelocity, σ is the velocity dispersion, r_d is the scale length of the disk, and η is a numerical constant of order unity.\nThe value of η depends on the model assumed for the disk <cit.>.\nWe have assumed a value of 1 appropriate for a disk in which the disk thickness and velocity dispersion have no radial dependence.\nThe fractional correction to the masses for asymmetric drift is given by the ratio of the second to the first term on the righthand side of\nthe equation.\nWe have estimated this from the data in the original papers, and our estimates are listed in Table <ref>.\nFor all but two galaxies the correction is ≤10 per cent.\nWe have used these estimates to correct the masses for asymmetric drift for the\nseven galaxies in the sample for which this effect was not included in the original analysis.\n\n\n\n\n\n\n\n\n"}