{"entry_id": "http://arxiv.org/abs/2303.07214v1", "published": "20230313154919", "title": "New insight into the massive eccentric binary HD 165052: self-consistent orbital solution, apsidal motion, and fundamental parameters", "authors": ["Sophie Rosu", "Edwin A. Quintero", "Gregor Rauw", "Philippe Eenens"], "primary_category": "astro-ph.SR", "categories": ["astro-ph.SR"], "text": "\n\nfirstpage–lastpage\nParallel Vertex Diffusion for Unified Visual Grounding\n    \nZesen Cheng^1 Corresponding Author.   Kehan Li^1   Peng Jin^1   Xiangyang Ji^3\n\nLi Yuan^1,2   Chang Liu^3    Jie Chen^1,2 ^1 School of Electronic and Computer Engineering, Peking University \n\n^2 Peng Cheng Laboratory   ^3 Tsinghua University   \n\n\n\n    March 30, 2023\n============================================================================================================================================================================================================================================================\n\n\n\n\nHD 165052 is a short-period massive eccentric binary system that undergoes apsidal motion. As the rate of apsidal motion is directly related to the internal structure constants of the binary components, its study allows to get insight into the internal structure of the stars.\nWe use medium- and high-resolution spectroscopic observations of HD 165052 to provide constraints on the fundamental properties of the binary system and the evolutionary state of its components.\nWe apply a spectral disentangling code to reconstruct artefact-free spectra of the individual stars and derive the radial velocities (RVs) at the times of the observations. We perform the first analysis of the disentangled spectra with the non-LTE model atmosphere code  to determine the stellar properties. We derive the first self-consistent orbital solution of all existing RV data, including those reported in the literature, accounting for apsidal motion. We build, for the very first time, dedicated stellar evolution tracks with the  code requesting the theoretical effective temperatures and luminosities to match those obtained from our spectroscopic analysis. The binary system HD 165052, consisting of an O6.5 V((f)) primary (T_eff,P=37 500 ± 1000 K) and an O7 V((f)) secondary (T_eff,S=36 000 ± 1000 K), displays apsidal motion at a rate of (11.30^+0.64_-0.49)^∘ yr^-1. Evolutionary masses are compared to minimum dynamical masses to constrain the orbital inclination. \nEvolutionary masses M_ev,P=24.8±1.0 M_⊙ and M_ev,S=20.9±1.0 M_⊙ and radii R_ev,P=7.0^+0.5_-0.4 R_⊙ and R_ev,S=6.2^+0.4_-0.3 R_⊙ are derived, and the inclination is constrained to 22.1^∘≤ i ≤ 23.3^∘. Theoretical apsidal motion rates, derived assuming an age of 2.0±0.5 Myr for the binary, are in agreement with the observational determination. The agreement with theoretical apsidal motion rates enforces the inferred values of the evolutionary stellar masses and radii.\n\n\n\nstars: early-type – stars: evolution – stars: individual (HD 165052) – stars: massive – binaries: spectroscopic\n\n\n\n\n\n\n§ INTRODUCTION\n\n \n\nMassive stars play a key role in many processes in the Universe, notably through their winds and powerful supernova explosions that contribute to the chemical enrichment of the Universe.  It is nowadays thought that the majority of the massive stars (i.e. O and B-type stars having a mass larger than 8 M_⊙) are, or have been, part of a binary or higher multiplicity system <cit.>. According to current estimates, more than 70% of the massive stars inhabiting our Galaxy have spent some part of their existence in a binary system <cit.>. The simple fact of being bound to another star by gravitational attraction can deeply modify the evolutionary track of the considered star, as its evolution is now driven not only by its own properties – initial mass, mass-loss rate (a problem that has not been self-consistently solved in stellar structure and evolution models yet), and rotation rate <cit.> –, but also by the binary orbit's parameters <cit.>. The study of  detached eclipsing and/or spectroscopic binaries is the most accurate way to obtain reliable physical properties of O and B stars. Among these systems, those showing evidence for apsidal motion (i.e. slow precession of the binary system major axis) offer additional possibilities to sound the interior of these massive stars. Indeed, the apsidal motion rate is directly related to the internal structure constant of the stars that make up the binary system <cit.>. The internal structure constant is a sensitive indicator of the density stratification inside a star and its value strongly changes as the star evolves away from the main sequence. Measuring the rate of apsidal motion in a binary system hence not only provides a diagnostic of the – otherwise difficult to constrain – internal structure of the stars, but also offers a test of our understanding of stellar structure and evolution <cit.>.\n\nThe massive eccentric binary HD 165052 is a well-known early-type double-lined spectroscopic (SB2) binary system of the very young open cluster NGC 6530. NGC 6530 is itself located in the centre of the H ii region M8, also known as the Lagoon Nebula. This cluster is one of the most studied clusters in our Galaxy, notably for its interesting history of ongoing star formation <cit.>. The age of NGC 6530 was estimated by several authors <cit.>. Most authors agree about an age estimate around 2 Myr: <cit.> and <cit.> both derived an age of 2 Myr, <cit.> set a lower limit of 2 Myr though star formation would have continued as recently as 0.25 Myr ago,  <cit.> estimated the age to range from 1 to 3 Myr, <cit.> estimated the age to 1.5 Myr with an age spread of 4 Myr, <cit.> derived a median age of cluster stars in the central region of 0.8 Myr, with a maximum age spread for the whole NGC 6530 cluster of 4 Myr, and <cit.> derived an age of 2.3 Myr with an age spread compatible with 2 Myr. Only <cit.> derived a much larger age of 5±2 Myr.\n\n<cit.> was the first to report evidence for binarity of HD 165052 through the discovery of a variable radial velocity (RV). <cit.> pointed out the double-lined binary nature of HD 165052. The very first orbital solution was proposed by <cit.>. However, due to the apparent similarity in the optical region between the two components of the binary, the authors did not unambiguously identify the two components and derived an orbital period of 6.14 days that appeared to be erroneous. <cit.> revisited the orbital period P_orb=2.96 days of the system, among other properties (see Table <ref>), based on 15 high-resolution IUE spectra. The binary system was classified as O6.5 V + O6.5 V by <cit.>, modified to O6.5 V(n)((f)) + O6.5 V(n)((f)) by <cit.>, and to O6 V + O6 V by <cit.>. <cit.> presented a new optical spectroscopic study of HD 165052 based on intermediate and high-resolution CCD observations. The authors derived a new orbital solution for the system (see Table <ref>) and found, for the first time, evidence of apsidal motion in the system from the comparison with previous RV determinations <cit.>. <cit.> investigated the Struve-Sahade effect that was originally pointed out in the system by <cit.> and also derived a new orbital solution for the system (see Table <ref>). Finally, <cit.> presented a new set of RV measurements of HD 165052 which they obtained through the disentangling of high-resolution optical spectra using the method described by <cit.>. They provided a new orbital solution for the system (see Table <ref>) and confirmed the variation of the longitude of periastron with time. The authors derived the first estimate of the apsidal motion rate in the system: ω̇=(12.1 ± 0.3)^∘ yr^-1. \n\nIn this article, we perform a new, in-depth spectroscopic investigation of the binary HD 165052 through the analysis of both old and new medium- and high-resolution spectra. We reassess the fundamental and orbital parameters of the system making use of the most advanced disentangling method proposed by <cit.> that allows the reconstruction of artefact-free individual spectra. We further analyse those reconstructed spectra with, for the first time, a non-LTE model atmosphere code, namely . We derive the first self-consistent orbital solution of all existing RV data, including those reported in the literature, accounting for the change of the longitude of periastron with time. Given that the rate of apsidal motion is directly related to the internal stellar structure constants of the binary components, its determination allows us to infer additional constraints to perform critical tests of stellar structure and evolution models <cit.>. Finally, we also compute dedicated stellar structure and evolution tracks to derive evolutionary masses and radii for the stars and to put a robust constraint on the value of the inclination of the orbit, as well as to see how the theoretical apsidal motion rates compare to the observational value. \n\nThe set of spectroscopic data we use is introduced in Sect. <ref>. In Sect. <ref> we perform the spectral disentangling, reassess the spectral classification of the stars, and analyse the reconstructed spectra by means of the CMFGEN non-LTE model atmosphere code <cit.>. The RVs deduced from the spectral disentangling are combined with data from the literature in Sect. <ref> to derive values for the orbital period, the mass ratio, the rate of apsidal motion, and the orbital eccentricity of the system, among others. The stellar structure and evolution tracks computed with the Code Liégeois d'Évolution Stellaire are presented in Sect. <ref>. We provide our conclusions in Sect. <ref>.\n\n\n\n§ OBSERVATIONAL DATA\n\n\n\n §.§ Spectroscopy\n\nWe extracted a total of 47 medium- and high-resolution échelle spectra of HD 165052 in the optical domain from the ESO science archive. Those spectra were collected between May 1999 and July 2017 using different instruments. Twenty-one spectra were obtained with the Fiber-fed Extended Range Optical Spectrograph (FEROS) mounted on the European Southern Observatory (ESO) 1.5 m telescope in La Silla, Chile <cit.>, between May 1999 and April 2002, three spectra were obtained with the FEROS instrument mounted on the ESO 2.2 m telescope between May 2004 and April 2007. FEROS has a spectral resolving power of 48 000. The FEROS data were reduced using the FEROS pipeline of the MIDAS software. Ten spectra were obtained with the ESPaDOns spectrograph attached to the Canada-France-Hawaï observatory (CFH) 3.6 m telescope in Hawaï <cit.>. These data were collected during a single night in June 2010. ESPaDOnS has a spectral resolving power of 68 000. The reduced ESPaDOnS data were retrieved from the CFHT archive. Four spectra were obtained with the Ultraviolet and Visual Echelle Spectrograph (UVES) mounted on the ESO Very Large Telescope (VLT) at Cerro Paranal, Chile <cit.>, during a single night in November 2002. UVES has a spectral resolving power of 65 030 in the blue arm and of 74 450 in the red arm. The wavelength domain ranges from 3000 to 5000 Å (blue arm) and from 4200 to 11 000 Å (red arm). Nine spectra were obtained with the XSHOOTER instrument mounted on the VLT <cit.>, in July 2016 and July 2017. The wavelength domain ranges from 3000 to 5595 Å (UVB) and from 5595 to 10 240 Å (VIS). The spectral resolving power of XSHOOTER is, depending on the observations, 4112 or 5453 (UVB) and 6505, 8935, or 11 333 (VIS). The ESPaDOns, UVES, and XSHOOTER spectra provided in the archive were already reduced using the dedicated pipelines. We complemented those spectra with 24 high-resolution échelle spectra obtained with the HEROS instrument mounted on the TIGRE telescope between April 2019 and April 2021 <cit.>. The wavelength domain ranges from 3500 to 5600 Å (blue channel) and from 5800 to 8800 Å (red channel). The spectral resolving power is 20 000. For all the spectra, we removed cosmic rays and telluric absorption lines using MIDAS and the telluric tool within IRAF, respectively.  We normalised the spectra with MIDAS by fitting low-order polynomials to the continuum as in <cit.>. The journal of the spectroscopic observations is presented in Table <ref>, together with the radial velocities computed in Sect. <ref> and the phase computed using the orbital period derived in Sect. <ref>.\n\n\n\n§ SPECTRAL ANALYSIS\n\n\n\n §.§ Spectral disentangling\n\nAs a first step, we performed the spectral disentangling of all data using our disentangling code based on the method described by <cit.>. We derived the individual spectra of the binary components as well as their RVs at the times of the observations. We refer to <cit.>, <cit.>, and <cit.> for detailed information about the methodology and its limitations, and to Appendix <ref> for a detailed description of the method adopted in the present context.\n\n\nThe resulting RVs of both stars are reported in Table <ref> together with their 1σ errors.\n\nWe confirm the observations of <cit.> who reported artefacts in the spectra of the stellar components of HD 165052 after disentangling using the version of the “shift and add” technique of <cit.>, a precursor of the code proposed by <cit.>. <cit.> demonstrated that the shift and add method produces artefacts when the spectra contain broad lines with low Doppler shifts. These artefacts distort the spectral line profiles, producing uncertainties in the flux and the profile of the spectral lines of the stellar components.\n\nThe novel QER20 spectral disentangling algorithm proposed by <cit.> combines the advantages of the shift and add method (versatility and ease of implementation) with artefact-free reconstructed spectra. The fundamental principle of the QER20 Package consists in considering the integrated flux of a given spectral line as a free parameter <cit.>.\n\nHence, as a second step, we used the QER20 algorithm, fixing the RVs of the stars to those computed previously and reported in Table <ref>. In order to illustrate the reliability of this novel disentangling method in the case of the binary HD 165052, Figure <ref> compares the reconstructed Hγ line of both stellar components, obtained with the shift and add method and the QER20 Package. The former shows the artefacts mentioned above: emission wings in the spectrum of the primary, and absorption wings in the secondary. In contrast, the QER20 Package yields profiles free of these artefacts. The difference in integrated flux of the lines amounts to 5% to 7% between the two methods.\n\n\n\n\n\n\n §.§ Spectral classification and absolute magnitudes\n\nWe reassessed the spectral classification of the binary components of HD 165052 based on their reconstructed spectra. \n\nTo determine the spectral types of the stars, we used Conti's criterion <cit.> complemented by <cit.>. We found that log W' = log[EW(He  iλ 4471)/EW(He  iiλ 4542)] amounts to -0.17± 0.01 for the primary star and to -0.05 ± 0.01 for the secondary star, which correspond to spectral types O6.5 and O7 (with spectral type O7.5 within the error bars), respectively. We also followed the Walborn criterion <cit.> based on the strengths of the He ii λ 4686 line and the N iii λλ 4634-40-42 triplet to asses the luminosity classes of the stars. Given that He ii λ 4686 is seen in strong absorption and N iii λλ 4634-40-42 in weak absorption, both stars are of luminosity class V((f)).\n\nWe estimated the brightness ratio of HD 165052 in the visible domain based on the ratio between the equivalent widths (EWs) of the spectral lines of the  secondary star and TLUSTY spectra of similar effective temperatures. We used the Hβ, Hγ, He i λλ 4026, 4471, 5016, and He ii λ 4542 lines. The ratio EW_ TLUSTY/EW_sec = (l_P+l_S)/l_S amounts to 2.42± 0.39 and 2.43±0.37 when  spectra of T_eff of 37 500 and 35 000 K, respectively, are used. Both results give us l_S/l_P = 0.70±0.19.\n\n\n<cit.> derived a distance of 1212.7^+42.8_-31.5 pc from the parallax of ϖ = 0.7893± 0.0297 mas quoted by the  Gaia early data release 3 <cit.>. This leads to a distance modulus of 10.42^+0.08_-0.06 for the binary system. Mean V and B magnitudes of 6.87 and 6.98, respectively, are reported by <cit.>, for which we estimated errors of 0.01. We adopted a value of -0.27±0.01 for the intrinsic colour index (B-V)_0 of an O6.5-O7 V star <cit.> and assumed the reddening factor in the V-band R_V equal to 3.15±0.06 for NGC 6530 <cit.>. In this way, we obtained an absolute magnitude in the V-band of the binary system M_V=-4.75^+0.10_-0.08. Using the brightness ratio, we then derived individual absolute magnitudes M_V,P =-4.17±0.15 and M_V,S =-3.79^+0.20_-0.19 for the primary and secondary stars, respectively.\n \nFrom the comparison with the magnitudes reported by <cit.>, we observe that the primary star is slightly less luminous than a `typical' O6.5 V star while the secondary star is fainter than expected for O7-O7.5 V type stars.\n\n\n\n §.§ Projected rotational velocities\n\nWe used the Fourier transform method <cit.> and proceeded as in <cit.> to derive the projected rotational velocities of both stars. The results are summarised in Table <ref>, and the Fourier transforms of the C iv λ 5801 line for the primary star and of the Si iv λ 4631 line for the secondary star are illustrated in Fig. <ref>. \nThe results presented in Table <ref> show that the mean v sin i_rot computed on metallic lines alone or on all the lines agree very well. We adopted a mean v sin i_rot of 67±8 km s^-1 for the primary star and of 62±7 km s^-1 for the secondary star. Our values are compatible, within the error bars, with those derived by <cit.>, <cit.>, <cit.>, and <cit.> but are slightly lower than those quoted by <cit.>.\n\n\n \n\n\n\n\n\n\n §.§ Model atmosphere fitting\n\nWe analysed the reconstructed spectra of the binary components by means of the non-LTE model atmosphere code CMFGEN  <cit.> to constrain the fundamental properties of the stars. We broadened the CMFGEN spectra by the projected rotational velocities determined in Sect. <ref> and adjusted the stellar and wind parameters following the procedure outlined by <cit.>.\n\nGiven that the surface gravity derived in the  adjustment is underestimated for a binary star <cit.>, we decided to fix the value of the surface gravity log g_spectro to 3.92 cgs for both stars following Tables 1 and 4 in <cit.>. We fixed the microturbulence value at the level of the photosphere, v_micro^min, to 15 km s^-1. The clumping parameters of the wind were fixed: the volume filling factor f_1 was set to 0.1, and the f_2 parameter controlling the onset of clumping was set to 100 km s^-1, as in <cit.>. Likewise, the β parameter of the velocity law was fixed to 1.0 as suggested by <cit.> for O6.5-O7 V type stars. The wind terminal velocity v_∞ was fixed to 2335 km s^-1 for both stars, as derived from the combined IUE spectra by <cit.>.\n\nWe adjusted the macroturbulence velocity v_macro on the wings of the O iii λ 5592 and Balmer lines and derived values of 120± 20 km s^-1 and 65±10 km s^-1 for the primary and secondary stars, respectively.\n\nThe stellar and wind parameters of the best-fit CMFGEN model atmosphere are summarised in Table <ref>. The normalised disentangled spectra of HD 165052 are illustrated in Fig. <ref> along with the best-fit CMFGEN adjustments.\n\nWe derived the effective temperature based on the adjustment of the He i λλ 4121, 4471, 4713, 4922, 5016, 5874, 7065 and He ii λλ 4200, 4542, 5412 lines. This was clearly a compromise as we could not find a solution that perfectly fits all helium lines simultaneously. We discarded the He i λ 4026 line because of its blend with the weak but non-zero He ii λ 4026 line. We derived effective temperatures T_eff,1 = 37 500 ± 1000 K and T_eff,2 = 36 000 ± 1000 K for the primary and secondary stars, respectively. \n\nThe mass-loss rate was derived based on the adjustment of the Hα and He ii λ 4686 lines. We derived values of (1.5± 0.5)× 10^-7 M_⊙ yr^-1 and (9.0± 1.0)× 10^-8 M_⊙ yr^-1 for the primary and secondary stars, respectively. \n\nWe set the surface chemical abundances of all elements, including helium, but excluding carbon and oxygen, to solar as taken from <cit.>. We derived the oxygen abundance based on the O iii λ 5592 line as it is the sole oxygen line free of blends. We derived sub-solar oxygen abundances in number O/H of (3.0± 0.2)× 10^-4 and (4.0± 0.2)× 10^-4 for the primary and secondary stars, respectively. For both stars, with these oxygen abundances, the weak O iii λλ 4368, 4448, 4454, 4458 lines are well-reproduced, while the O iii λ 5508 line is slightly overestimated. We derived the carbon abundance based on the C iii λ 4070 line as it is the sole reliable carbon line free of blends. Indeed, as stated by <cit.>, the C iii λλ 4647-51 blend and the C iii λ 5696 line are known to be problematic because their formation processes are controlled by a number of far-UV lines, hence their strength and nature critically depend upon subtle details of the stellar atmosphere model. The C iii λ 4379 line is heavily blended with the N iii λ 4379 and therefore useless, while the C iii λ 4388 line is not significantly affected by a change in carbon abundance. We also know the C iv λ 5801, 5812 lines to be problematic and rarely correctly reproduced <cit.>. We derived a sub-solar carbon abundances in number C/H of (2.0± 0.2)× 10^-4 for both stars.  \nFinally, we set the nitrogen abundance to solar as taken from <cit.> as we could not adjust the nitrogen abundance based on the nitrogen lines. Indeed, N iii λ 4379 is heavily blended with C iii λ 4379, the N iii λλ 4510-4540 blend is not significantly affected by a change in nitrogen abundance, and the  spectra display the N iii λλ 4634-4640 complex in emission. We tested a nitrogen abundance 4.83 (respectively 3.35) times solar for the primary (respectively secondary) star – such that, combined with the depleted C and O abundances, the CNO abundance is solar – and observed that the nitrogen lines in the  spectra were much deeper than in the observational spectra. This results suggests that the initial metallicity of the stars is (at least slightly) sub-solar.\n\n\n\n\n \n\nWe computed the bolometric magnitudes of the stars assuming the bolometric correction depends only on the effective temperature through the relation \n\n    BC = -6.89log(T_eff)+28.07\n\n<cit.> and got M_bol,P = -7.61± 0.17 and M_bol,S = -7.11± 0.21, which then converted into bolometric luminosities give us L_bol,P = 89 000± 14 000 L_⊙ and L_bol,S = 56 000 ± 11 000 L_⊙. Combined with the effective temperatures derived from the  analysis, we inferred spectroscopic radii R_spectro,P=7.1 ± 0.7 R_⊙ and R_spectro,S=6.1 ± 0.7 R_⊙. The surface gravities, corrected for both the centrifugal force and radiation pressure, amount to 3.99± 0.01 and 3.98^+0.02_-0.01 for the primary and secondary stars, respectively. Spectroscopic masses M_spectro,P=17.7^+3.5_-3.4 M_⊙ and M_spectro,S=12.9±2.9 M_⊙ were then inferred.\n\n\n\n\n\n§ RADIAL VELOCITY ANALYSIS\n\nOur total set of RV measurements consists of our 71 primary and secondary RVs determined as part of the disentangling process (see Sect. <ref>) complemented by 94 primary and secondary RVs coming from the literature. Twelve RVs come from <cit.> but we adopted the corrected values by <cit.>. The latter authors do not report uncertainties on their measurements, and we therefore assumed symmetric uncertainties of 15 km s^-1, as representative of the O-C. Fifteen RVs come from <cit.>, and we assumed symmetric uncertainties on these RVs of 10 km s^-1 as representative of the O-C. Thirty RVs come from <cit.> and (J. I. Arias, private communication, 2021), for which we adopted the uncertainties quoted by the authors. The remaining 37 RVs come from <cit.> that we recalculated here (see Appendix <ref>). We ended up, in total, with a series of 165 RVs spanning about 46 years. For the RVs derived from the spectral disentangling, we adopted formal errors of 3 km s^-1, as the small errors derived as part of the disentangling method would bias the adjustment given our high number of RVs compared to those coming from the literature. We then processed in the adjustment of the RVs along three different avenues.\n\n\n\n\n\n\n\n\nFirst, for each time of observation t, we adjusted the primary RV data with the following relation \n\n    RV_P(t) = γ_P + K_P [cos(ϕ(t)+ω(t)) +ecosω(t)],\n\nwhere γ_P, K_P, e, and ω are the primary apparent systemic velocity, the semi-amplitude of the primary RV curve, the eccentricity, and the argument of periastron of the primary orbit, respectively. The true anomaly ϕ is inferred from the eccentric anomaly, itself computed through Kepler's equation, which involves both e and the anomalistic orbital period P_orb of the system. We accounted for the apsidal motion through the variation of ω with time following the relation \n\n    ω(t) = ω_0 + ω̇(t-T_0),\n\nwhere ω̇ is the apsidal motion rate and ω_0 is the value of ω at the time of periastron passage T_0. Given that different spectral lines give potentially slightly different values of the apparent systemic velocities, and given that the different RVs were obtained based on different sets of lines, the systemic velocity of each subset of our total dataset was adjusted so as to minimise the sum of the residuals of the data about the curve given by Eq. (<ref>).\n\nSecond, we adjusted the secondary RV data with a relation similar to Eq. (<ref>) corresponding to the secondary star, with K_S and γ_S having straightforward definitions.\n\nThird, we made use of the linear relation \n\n    RV_P(t)=-qRV_S(t)+B\n\nrelating the primary and secondary RVs of an SB2 system, where q=M_S/M_P is the mass ratio and B=γ_P+qγ_S, to convert the RVs of both stars into equivalent RVs of the primary star with\n\n    RV_eq(t)=RV_P-qRV_S+B/2.\n\nto which we associate corresponding K_eq and γ_eq. We derived a value q =0.902 ± 0.009 from the RVs coming from the disentangling process.\n\nIn the three cases, we scanned the 6-D parameter space in a systematic way to find the values of the free parameters (P_ orb, e, T_0, ω_0, ω̇, and K_ P or K_ S or K_ eq) that provide the best fit to the whole set of corresponding RV data. The projections of the 6-D parameter space onto the 2-D planes is illustrated in Fig. <ref> for the equivalent RVs. The corresponding orbital parameters are given in Table <ref>. a_Psin i and a_Ssin i stand for the minimum semi-major axis of the primary and secondary stars, respectively, M_Psin^3 i and M_Ssin^3 i stand for the minimum mass of the primary and secondary stars, respectively, and χ^2_ν is the reduced χ^2. We note that in the case of the primary (respectively secondary) RVs, we used the mass ratio derived previously to convert K_P (respectively K_S) into a value for K_S (respectively K_P) and compute the associated minimum masses but we did not adjust the secondary (respectively primary) RVs directly. Figure <ref> illustrates the best fit of the RV data with the equivalent RVs solution at 16 different epochs.\n\nThe eccentricities we obtained for the three solutions are compatible, within the error bars, with those coming from the literature (see Table <ref>), except with the value of <cit.> as these authors explicitly assumed a zero eccentricity for the system. Our orbital periods are longer and not compatible, within the error bars, with those coming from the literature (we did not consider the one of <cit.>, see discussion in Sect. <ref>). Our value of K_P is compatible, within the error bars, with those of <cit.>, <cit.>, and <cit.>, but slightly larger than the one quoted by <cit.>. Our value of K_S is compatible with those of <cit.>, and <cit.> but slightly larger than the one quoted by <cit.> and slightly smaller than the one quoted by <cit.>. Our mass ratio is compatible, within the error bars, with those coming from the literature, except for the one quoted by <cit.>. Finally, our apsidal motion rates are slightly smaller than the value of (12.1±0.3)^∘ yr^-1 reported by <cit.> but, in the cases of the primary and equivalent RVs solutions, still in agreement within the error bars. \n\n\n\n§ STELLAR STRUCTURE AND EVOLUTION TRACKS\n\n\nWe computed stellar structure and evolution tracks with the Code Liégeois d'Évolution Stellaire[The  code is developed and maintained by Richard Scuflaire at the STAR Institute at the University of Liège.] <cit.>. The first goal of this theoretical analysis is to derive evolutionary masses for the stars and, hence, to put a constraint on the value of the inclination of the orbit through the confrontation with the minimum stellar masses derived in Sect. <ref>. The second goal of this analysis is to see how the theoretical apsidal motion rates derived for two stellar models of the same age compare to the observational apsidal motion rate. In the present analysis, we assumed that HD 165052 has an age of 2.0±0.5 Myr (see Sect. <ref>).\n\nThe apsidal motion rate of a binary system, in the simple two-body case, is the sum of a Newtonian contribution (N) and a general relativistic correction (GR), which expressions were introduced by <cit.> for the former one, and <cit.> and <cit.> for the latter one. We here adopt the same conventions and notations as in <cit.> (see Sects. 3 and 4, and Equations (17) to (20) and (5) to (9)).\n\nWe built a grid of stellar evolution tracks having an initial mass M_init ranging from 18 to 27 M_⊙ and a turbulent diffusion coefficient D_T of 0, 10^7, 2×10^7, and 3×10^7 cm^2 s^-1, and for which we adopted a standard mass-loss scaling factor ξ=1 and an overshooting parameter α_ov=0.30 <cit.>. We present in the Hertzsprung-Russell diagrams in Figs. <ref> and <ref> the evolutionary tracks for the primary and secondary stars, respectively. For better visibility in the diagrams, we decided to only present the tracks that cross the observational boxes defined by the observational effective temperatures and bolometric luminosities of the stars. Among these selected models, we discarded those having an age lower than 1.5 Myr or higher than 2.5 Myr when crossing the observational box in the Hertzsprung-Russel diagram. Given the conclusions reached by <cit.> about the necessity to include enhanced turbulent mixing in the stellar evolution models to reproduce the internal structure of the massive stars they studied, it is highly unlikely that a model without any turbulent diffusion would be representative of the stars of HD 165052. Hence, we further discarded the tracks having D_T=0 cm^2 s^-1. We were thus left with nine tracks for the primary star and seven tracks for the secondary star.    \n\n\n\n\n\nFor each selected evolutionary track, we report in Table <ref> the evolutionary mass, radius, effective temperature, and internal stellar structure constant corrected for the effects of rotation following <cit.> at the ages of 1.5, 2.0, and 2.5 Myr. The comparison between models of same initial mass and same current age shows us that the turbulent diffusion coefficient has a negligible impact on the current mass of the model and has only a small impact on the current radius and internal stellar structure constant of the model. This behaviour is not surprising given that the star is very young and, hence, the turbulent mixing occurring in its interior did not act for a long enough time to produce important changes to both the radius and the internal stellar structure constant. \n\n\n\nAssuming that the primary model with M_init=25 M_⊙ and D_T=2× 10^7 cm^2 s^-1 and the secondary model with M_init=21 M_⊙ and D_T=2× 10^7 cm^2 s^-1, both at ages 2 Myr, are representative of the stars, we infer evolutionary masses M_ev,P=24.8±1.0 M_⊙ and M_ev,S=20.9±1.0 M_⊙, where the subscript P and S stand for the primary and secondary stars, respectively, evolutionary radii R_ev,P=7.0^+0.5_-0.4 R_⊙ and R_ev,S=6.2^+0.4_-0.3 R_⊙, and internal stellar structure constants corrected for the stellar rotation following <cit.> k_2,P= 1.20^+0.13_-0.16× 10^-2 and k_2,S= 1.26^+0.09_-0.12× 10^-2, where the angular rotation velocities Ω were computed using the projected rotational velocities derived in Sect. <ref> corrected for the inclination.  The error bars include the differences coming from a difference of 1.0 M_⊙ in M_init, of 1×10^7 cm^2 s^-1 in D_T, and of 0.5 Myr in the stellar age. The evolutionary mass ratio of the binary amounts to 0.84^+0.08_-0.07, slightly smaller than but still within the error bars of the observational mass ratio. Combined with the minimum masses obtained in Sect. <ref> (see last column of Table <ref>), the evolutionary masses put a constraint on the orbital inclination: 22.1^∘≤ i ≤ 23.3^∘. This small value of the inclination indicates that eclipses are very unlikely to be seen in photometric observations of this binary system (see also Fig. <ref>).\n\nWe then computed theoretical values for the apsidal motion rate. We adopted models for the primary and secondary stars of the same age and combined all the possible pairs given in Table <ref>. The semi-major axis is computed through the Kepler's third law for the corresponding combination of primary and secondary masses whilst the rotational periods of the stars are computed using the projected rotational velocities derived in Sect. <ref> corrected for the inclination. The results are provided in Table <ref>: We adopted the models having an age of 2.0 Myr as our reference models and computed the error bars based on models of 1.5 and 2.5 Myr. All theoretical apsidal motion rates agree with the observational determination (see last column in Table <ref>) except those computed combining the pairs of models PM24DT2-SM20DT3 and PM24DT3-SM20DT3 that slightly underestimate the apsidal motion rate compared to the observational value. This confrontation between observational and theoretical apsidal motion rates allows us to confirm the inferred evolutionary masses and radii of the stars. \n\n\n\n\nFinally, we computed the observational weighted-average mean of the internal structure constants of the stars, k_2,obs, as defined by Equations (18) and (19) in <cit.>, adopting an inclination of 22.7^∘± 0.6^∘ while all other parameters are taken from observational determinations. We obtained k_2,obs = 1.36^+0.44_-0.43× 10^-2, a value slightly larger but still compatible with the theoretical determinations for the two stars within the error bars.\n\n\n\n§ CONCLUSION\n\n\nWe presented a new, in depth spectroscopic analysis of medium- and high-resolution spectra of the massive eccentric binary system HD 165052 and derived the first self-consistent orbital solution of all existing RV data, including those reported in the literature, accounting for the change of the longitude of periastron with time.\n\nWe applied our disentangling code based on the method of <cit.> to derive the RVs of the stars at each time of observations. Then, we applied the advanced disentangling method proposed by <cit.>, that allows the reconstruction of artefact-free individual spectra, to the spectroscopic observations to reconstruct the spectra of the components. These latter were analysed, for the first time, with the non-LTE model atmosphere code  to derive fundamental stellar and wind parameters. \n\nWe performed the RV analysis of all data, including those coming from the literature, along three avenues: considering the primary RVs only, the secondary RVs only, and converting the primary and secondary RVs into primary-equivalent RVs. In all three cases, we obtained orbital solutions which were in agreement within their error bars. We adopted the equivalent RVs solution as the final solution and hence, concluded that the apsidal motion rate in the system amounts to (11.30^+0.64_-0.49)^∘ yr^-1. We conclude that our analysis of the spectroscopic observations of HD 165052 and the  analysis of the RVs of the stars explicitly accounting for the apsidal motion allow us to derive a consistent measure of the apsidal motion rate in the binary. Our analysis of all available RV data also allowed us to determine more reliably the orbital parameters of the binary. Our values differ from those of <cit.>, <cit.>, and <cit.> mainly because we explicitly accounted for the apsidal motion in the RV analysis. Our results differ from those of <cit.> mainly due to the increased number of RV data available at the time of our study.\n\nWe computed dedicated stellar structure and evolution tracks with  assuming the stellar effective temperatures and luminosities obtained as part of the  analysis, and an age of 2.0± 0.5 Myr for the binary. We derived evolutionary masses M_ev,P=24.8±1.0 M_⊙ and M_ev,S=20.9±1.0 M_⊙ and evolutionary radii R_ev,P=7.0^+0.5_-0.4 R_⊙ and R_ev,S=6.2^+0.4_-0.3 R_⊙ for the primary and secondary stars, respectively. Through the confrontation with the minimum stellar masses, we constrained the orbital inclination: 22.1^∘≤ i ≤ 23.3^∘. We computed theoretical apsidal motion rates adopting  two stellar models of the same age and observed that these were in agreement with the observational apsidal motion rate, therefore enforcing the inferred values of the evolutionary stellar masses and radii, and putting some constraints on the density stratification inside the stars through the internal stellar structure constants.\n\nWhilst our results exclude the possibility of photometric eclipses, it would nevertheless be worth to acquire high-precision space-borne photometry to look for low-level photometric variability due to a phase-dependent tidal distortion of the stars and/or tidally-induced pulsations <cit.>. Adopting our best estimates of the stellar parameters, we used the Nightfall code to simulate synthetic lightcurves of HD 165052 for different values of the orbital inclination between 17.5^∘ and 27.5^∘ (see Fig. <ref>).  In all cases, we found that the lightcurve is dominated by the so-called heartbeat variations due to the orbital eccentricity rather than by ellipsoidal variations. For the most likely inclination near 22.5^∘, we expect peak-to-peak amplitudes of about 0.01 mag which are certainly within reach of sensitive space-borne photometry. We inspected both ASAS and Hipparcos photometric data. No significative variation is observed for the ASAS lightcurve and the error bars on the data are larger than the expected variations. Whilst the Hipparcos data have lower error bars than the ASAS data, the errors remain quite large and the data do not sample the most interesting parts of the orbit, namely the phases close to periastron passage. Unfortunately, there exist currently no other high-precision space-borne photometric data. Hence, the existing data cannot be used to study the light curve of this system. Whereas heartbeat variations could help confirming the estimate of the orbital inclination that we have obtained, the detection of pulsations would offer the possibility to gain further insight into the internal structure of the stars that would offer a powerful tool for comparison with the  models that we have tested here. \n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nS. Rosu acknowledges support from the Fonds de la Recherche Scientifique (F.R.S.- FNRS, Belgium). We thank Dr John Hillier for making his code CMFGEN publicly available. This research uses optical spectra collected with the TIGRE telescope (La Luz, Mexico). TIGRE is a collaboration of Hamburger Sternwarte, the Universities of Hamburg, Guanajuato, and Liège. The authors thank the referee for his/her suggestions and comments towards the improvement of the manuscript.\n\n\n\n§ DATA AVAILABILITY\n\nThe ESO and CFHT data used in this study are available from the corresponding archives, whilst the TIGRE spectra can be made available upon reasonable request.\n\n\n\n99\n[Arias et al.(2002)]arias02\nArias, J. I., Morrell, N. I., Barbá, R. H., et al. 2002, , 333, 202\n[Asplund et al.(2009)]asplund09\nAsplund, M., Grevesse, N., Sauval, A. J., & Scott, P. 2009, , 47, 481\n[Bailer-Jones et al.(2021)]bailer21\nBailer-Jones, C. A. L., Rybizki, J., Fouesneau, M., Demleitner, G., & Andrae, R. 2021, , 161, 147\n[Böhm-Vitense et al.(1984)]boehm84\nBöhm-Vitense, E., Hodge, P., & Boggs, D. 1984, , 287, 825\n[Brott et al.(2011)]brott11\nBrott, I., de Mink, S. E., Cantiello, M., et al. 2011, , 530, A115\n[Claret(1999)]claret99\nClaret, A. 1999, , 350, 56\n[Claret & Giménez(2010)]claret10\nClaret, A., & Giménez, A. 2010, , 519, A57\n[Claret et al.(2021)]claret21\nClaret, A., Giménez, A., Baroch, A., et al. 2021, , 654, A17\n[Claret & Torres(2019)]claret19\nClaret, A., & Torres, G. 2019, , 876, 134\n[Conti(1974)]conti74\nConti, P. S. 1974, , 187, 539\n[Conti & Alschuler(1971)]Conti71\nConti, P. S., & Alschuler, W. R. 1971, , 170, 325\n[Conti & Ebbets(1977)]conti77\nConti, P. S., & Ebbets, D. 1977, , 213, 438\n[Damiani et al.(2004)]damiani04\nDamiani, F., Flaccomio, E., Micela, et al. 2004, , 608, 781\n[Dekker et al.(2000)]dekker00\nDekker, H., D'Odorico, S., Kaufer, A., Delabre, B., & Kotzlowski, H. 2000, Proceedings SPIE, 4008, 534\n[Donati et al.(2003)]donati03\nDonati, J.-F. 2003, ASP Conference Series, 307, 41\n[Duchêne & Kraus(2013)]Duchene13\nDuchêne, G., & Kraus, A. 2013, , 51, 269\n[Ekström et al.(2012)]ekstrom12\nEkström, S., Georgy, C., Eggenberger, P., et al. 2012, , 537, A146\n[Ferrero et al.(2013)]FER\nFerrero, G., Gamen, R., Benvenuto, O., & Fernández-Lajús, E. 2013, , 433, 1300\n[Gaia Collaboration(2021)]EDR3\nGaia Collaboration, Brown, A. G. A., Vallenari, A., Prusti, T., et al. 2021, , 649, A1\n[Giménez(1985)]gimenez85\nGiménez, A. 1985, , 297, 405\n[González & Levato(2006)]GL \nGonzález, J. F., & Levato, H. 2006, , 448, 283\n[González-Pérez et al.(2022)]gonzalez22\nGonzález-Pérez, J. N., Mittag, M., Schmitt, J. H. M. M., et al. 2022, FrASS, 9, 912546\n[Gray(2005)]gray05\nGray, D. F. 2005, The Observation and Analysis of Stellar Photospheres (Cambridge University Press)\n[Gray(2008)]Gray08\nGray, D. F. 2008, The Observation and Analysis of Stellar Photospheres, 3rd edn. (Cambridge University Press)\n[Hejlesen(1987)]Hejlesen \nHejlesen, P. M. 1987, , 69, 251 \n[Hillier & Miller(1998)]Hillier\nHillier, D. J., & Miller, D. L. 1998, , 496, 407\n[Howarth et al.(1997)]howarth97\nHowarth, I. D., Siebert, K. W., Hussain, G. A. J., & Prinja, R. K. 1997, , 284, 265\n[Kaufer et al.(1999)]Kaufer\nKaufer, A., Stahl, O., Tubbesing, S., et al. 1999, The Messenger, 85, 8\n[Kilambi(1977)]kilambi77\nKilambi, G. C. 1977, , 178, 423\n[Kołaczek-Szymański et al.(2021)]Kolaczek21\nKołaczek-Szymański, P. A., Pigulski, A., Michalska, G., Moździerski, D., & Różański, T. 2021, , 647, A12\n[Linder et al.(2007)]linder07\nLinder, N., Rauw, G., Sana, H., De Becker, M., & Gosset, E. 2007, , 474, 193\n[Marchenko et al.(1998)]marchenko98\nMarchenko, S. V., Moffat, A. F. J., & Eenens, P. 1998, , 110, 1416\n[Martins(2011)]Martins11\nMartins, F. 2011, Bulletin de la Société Royale des Sciences de Liège, 80, 29\n[Martins & Hillier(2012)]Martins12\nMartins, F., & Hillier, D. J. 2012, , 545, A95\n[Martins & Plez(2006)]MP\nMartins, F., & Plez, B. 2006, A&A, 457, 637\n[Martins et al.(2005)]Martins05\nMartins, F., Schaerer, D., & Hillier, D. J. 2005, , 436, 1049\n[Mathys(1988)]Mathys88\nMathys, G. 1988, , 76, 427\n[Mayne & Naylor(2008)]mayne08\nMayne, N. J., & Naylor, T. 2008, , 386, 261\n[Mazeh(2008)]mazeh08\nMazeh, T. 2008, EAS Publications Series, 29, 1\n[Morrison & Conti(1978)]morrison78\nMorrison, N. D., & Conti, P. S. 1978, , 224, 558 \n[Muijres et al.(2012)]muijres12\nMuijres, L. E., Vink, J. S., de Koter, A., Müller, P. E., & Langer, N. 2012, , 537, A37\n[Palate & Rauw(2012)]palate12\nPalate, M., & Rauw, G. 2012, , 537, A119\n[Plaskett(1924)]plaskett24\nPlaskett, J. S. 1924, PDAO, 2, 287\n[Penny(1996)]penny96\nPenny, L. R. 1996, PhD thesis, Georgia State University\n[Prisinzano et al.(2005)]prisinzano05\nPrisinzano, L., Damiani, F., Micela, G., & Sciortino, S. 2005, , 430, 941\n[Quintero et al.(2020)]quintero20\nQuintero, E. A., Eenens, P., & Rauw, G. 2020, Astronomische Nachrichten, 341, 628\n[Rosu et al.(2020a)]rosu20a\nRosu, S., Noels, A., Dupret, M.-A., et al. 2020a, , 642, A221\n[Rosu et al.(2020b)]rosu20b\nRosu, S., Rauw, G., Conroy, K. E., et al. 2020b, , 635, A145\n[Rosu et al.(2022a)]rosu22a\nRosu, S., Rauw, G., Farnir, M., Dupret, M.-A., & Noels, A. 2022a, , 660, A120\n[Rosu et al.(2022b)]rosu22b\nRosu, S., Rauw, G., Nazé, Y., Gosset, E., & Sterken, C. 2022b, , 664, A98\n[Sagar & Joshi(1978)]sagar78\nSagar, R., & Joshi, U. C. 1978, , 184, 467\n[Sana et al.(2012)]sana12\nSana, H., de Mink, S. E., de Koter, A., et al. 2012, Science, 337, 444\n[Sana et al.(2003)]sana03\nSana, H., Hensberge, H., Rauw, G., & Gosset, E. 2003, , 405, 1063\n[Scuflaire et al.(2008)]scuflaire08\nScuflaire, R., Théado, S., Montalbán, J., et al. 2008, , 316, 83\n[Shakura(1985)]shakura\nShakura, N. I. 1985, Sov. Astron. Lett., 11, 224\n[Simón-Díaz & Herrero(2007)]Simon-Diaz\nSimón-Díaz, S., & Herrero, A. 2007, , 468, 1063\n[Sterne(1939)]sterne\nSterne, T. E. 1939, , 99, 451  \n[Stickland et al.(1997)]stickland97\nStickland, D. J., Lloyd, C., & Koch, R. H. 1997, The Observatory, 117, 295\n[Sung et al.(2000)]sung00\nSung, H., Chun, M., Bessell, M. 2000, , 120, 333\n[Topasna et al.(2020)]topasna20\nTopasna, G. A., Jones, R. H., & Kaltcheva, N. T. 2020, , 132, 044301\n[van Altena & Jones(1972)]vanaltena72\nvan Altena, W. F., & Jones, B. F. 1972, , 20, 425\n[Vernet et al.(2011)]vernet11\nVernet, J., Dekker, H., D'Odorico, S., et al. 2011, , 536, A105\n[Walborn(1972)]walborn72\nWalborn, N. R. 1972, , 77, 312\n[Walborn(1973)]walborn73\nWalborn, N. R. 1973, , 78, 1067\n[Walborn & Fitzpatrick(1990)]walborn90\nWalborn, N. R., & Fitzpatrick, E. L. 1990, , 102, 379\n[Wellstein et al.(2001)]wellstein01\nWellstein, S., Langer, N., & Braun, H. 2001, , 369, 939\n[Zacharias et al.(2013)]Zacharias13\nZacharias, N., Finch, C. T., Girard, T. M., et al. 2013, , 145, 44\n\n\n\n\n\n\n§ SPECTRAL DISENTANGLING BASED ON THE METHOD DESCRIBED BY <CIT.>\n\n\nThis appendix provides the journal of the spectroscopic observations of HD 165052 (Table <ref>) and a detailed description of the  spectral disentangling performed to derive the RVs of the stars.\n\nFor the disentangling, we used synthetic TLUSTY spectra with T_eff = 35 000 K, log g = 4.0, and v sin i_rot =  70 km s^-1 as cross-correlation templates in the determination of the RVs.\n\nWe performed the disentangling on 15 separate wavelength domains: B1[3810:4150] Å, B2[4150:4250] Å, B3[4300:4570] Å, B4[4600:5040] Å, B5[4600:4980] Å, B6[4800:5040] Å, B7[5380:5610] Å, B8[5380:5840] Å, B9[5790:5840] Å, B10[5380:5450] Å, B11[5380:5750] Å, and B12[5560:5840] Å in the blue domain, and R1[5860:5885] Å, R2[6500:6700] Å, and R3[7000:7100] Å in the red domain. As a first step, we only considered the FEROS, ESPaDOns, and TIGRE spectra as these spectra have a better resolution than the UVES and XSHOOTER spectra. We processed the wavelength domains (B1, B2, B3, B4, B7, B8, B9, R1, R2, and R3) to reproduce the individual spectra and simultaneously estimate the RVs of the stars. The TIGRE spectra cover all above-mentioned domains except for B8, and three FEROS spectra (taken at 2 451 304.7434, 2 451 304.7507, and 2 451 304.9309 HJD) do not cover the B2 domain due to instrumental artefacts in that wavelength domain. We averaged the RVs from the individual wavelength domains using weights corresponding to the number of strong lines present in these domains (five lines for B1, one for B2, three for B3, two for B4, two for B7, three for B8, two for B9, one for R1, one for R2, and one for R3). The resulting RVs of both stars are reported in Table <ref> together with their 1σ errors. We then performed the disentangling on the ten domains covered by the XSHOOTER and UVES spectra (B1, B2, B3, B5, B6, B10, B11, B12, R2, and R3) with the RVs of XSHOOTER and UVES observations free to vary, and the RVs of the FEROS, ESPaDOns, and TIGRE spectra fixed to their previously computed weighted averages. Two UVES observations (taken at 2 452 584.5002 and 2 452 584.5161 HJD) cover the B1, B2, B3, and B5 domains only, the other two UVES observations (taken at 2 452 584.5216 and 2 452 584.5234 HJD) cover the B6, B10, B11, and R2 domains only, four XSHOOTER observations (taken at 2 457 583.7901, 2 457 583.7916, 2 457 954.7756, and 2 457 954.7772 HJD) cover the B1, B2, B3, B5, B6, and B10 domains only, and the remaining five XSHOOTER observations (taken at 2 457 583.7902, 2 457 583.7916, 2 457 583.8401, 2 457 954.7757, and 2 457 954.7773 HJD) cover the B12, R2, and R3 domains only. We averaged the RVs from the individual wavelength domains using weights corresponding to the number of strong lines present in these domains (five lines for B1, one for B2, three for B3, two for B5, one for B6, one for B10, two for B11, two for B12, one for R2, and one for R3). The resulting RVs of both stars are reported in Table <ref> together with their 1σ errors.\n\n\n\n\n\n\n\n\n\n§ JOURNAL OF THE RVS OF HD 165052 COMING FROM <CIT.>\n\n\nThis appendix provides the journal of the RVs of HD 165052 from <cit.>. Given that the authors do not provide any error bar on their mean RVs, we computed both the mean RVs and standard deviation based on their individual measurements given in their Table B2, which we provide in Table <ref>.\n\n\n\n\n\n\n\n\n\n\n"}