{"entry_id": "http://arxiv.org/abs/2303.07212v1", "published": "20230313154711", "title": "Distributed Non-Bayesian Learning for Games with Incomplete Information", "authors": ["Shijie Huang", "Jinlong Lei", "Yiguang Hong"], "primary_category": "math.OC", "categories": ["math.OC"], "text": "\n\nParallel Vertex Diffusion for Unified Visual Grounding\n    \nZesen Cheng^1 Corresponding Author.   Kehan Li^1   Peng Jin^1   Xiangyang Ji^3\n\nLi Yuan^1,2   Chang Liu^3    Jie Chen^1,2 ^1 School of Electronic and Computer Engineering, Peking University \n\n^2 Peng Cheng Laboratory   ^3 Tsinghua University   \n\n\n\n    March 30, 2023\n============================================================================================================================================================================================================================================================\n\n\n\n\tWe consider distributed learning problem in games with an unknown cost-relevant parameter, and aim to find the Nash equilibrium while learning the true parameter. Inspired by the social learning literature, we propose a distributed non-Bayesian rule to learn the parameter (each agent maintains a belief on the parameter and updates the belief according to the received noisy cost), combined with best response dynamics for strategy update. The difficulty of the analysis lies mainly in the fact that the parameter learning process and strategy update process are coupled. We first prove that agents' beliefs converge to a common belief and the strategy profiles converge to a Nash equilibrium under this common belief. On this basis, we further show that the beliefs eventually concentrate on the true parameter.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nGame model has attracted much research attention due to its wide applications in smart grid <cit.>, wireless communication network <cit.>, traffic control <cit.> and machine learning <cit.>. Equilibrium learning is a promising topic in game theory because it provides a rational way for agents to make decisions. Particularly, in some complex situations, agents usually need to make decisions when faced with an unknown environment. For example, the true value of a stock is unknown in a stock market <cit.>; the delay of each route is unknown in a traffic routing problem <cit.>; the location of target is unknown in a robotic target covering problem <cit.>. Therefore, developing learning algorithms in such game models with incomplete information is crutial and has gained increasing popularity in recent years. \n\nThe common framework of learning dynamics in games with an unknown cost-relevant environment (parameter) consists of two processes: parameter learning and strategy update. In the parameter learning process, agents update the estimates of the parameter according to received historical information. In the strategy update process, agents make decision given the current estimates of the parameter. Distinct from the learning dynamics for misspecified game model <cit.>, parameter learning and strategy update are coupled in this framework, which brings additional difficulty to the convergence analysis. Inspired by the social learning in networks <cit.>, the authors in <cit.> studied the limit behaviour of rational learning process in linear games with an unknown parameter. Along another line of research, <cit.> and <cit.> designed learning dynamics for stochastic routing games with unknown latency function and stochastic network aggregative games with unknown network parameter, respectively, by utilizing the least-squares estimation technique. \n\nThe aforementioned works assume that the unknown parameter influences the cost function in a special structure (such as a linear structure). Learning dynamics for game models with general parameter structure are rare in the literature. To the best of our knowledge, there are two works devoted to this kind of problem. On the premise that the parameter learning process converges at a rate faster than O(log t/t), <cit.> designed a distributed fictitious play dynamics for finite potential games with incomplete information. More recently, <cit.> proposed a Bayesian learning dynamics that does not depend on the structure of parameter affecting the cost. The learning process in <cit.> assumes the existence of an information system for centrally updating the belief about the parameter. However, such an information system may not exsit in some industries. This may be the case, for example, using a central system to collect information from all traders in the stock market may be impossible. A more rational way is that traders estimate the true value of the stock distributedly based on local information. This paper addresses distributed learning problem in games with incomplete information, where each agent updates the belief about the parameter according to private signals.   \n\nIn the absence of a central system, it is computationally expensive for each agent to deduce other agents' information in a fully Bayesian fashion. In contrast, non-Bayesian learning rules are usually more effective when dealing with learning problmes in large-scale networks because of its low computational burden <cit.>. Following up on the seminal work of Ali Jadbabaie et al. <cit.> on distributed learning, various non-Bayesian learning rules have been developed in social learning or distributed parameter estimation literature. This type of learning rules share a common framework, where each agent first performs a Bayesian update based on the private information and then incorporates the neighbors' beliefs in a simple way. For example, <cit.> designed a non-Bayesian update rule for distributed hypothesis testing by averaging the neighbors' log-beliefs and analyzed the convergence rate. To reduce the communication burden, <cit.> developed a switching learning rule between Bayesian and non-Bayesian regimes. Furthermore, <cit.> studied the performance of non-Bayesian rule proposed by <cit.> in random digraphs. <cit.> and <cit.> proposed adaptive non-Bayesian rules to deal with social learning problems with disparate hypotheses and variable true hypotheses, respectively. In addition, <cit.> considered the scenerio where the agents might have incosistent hypotheses from an optimization point of view and proposed an effective non-Bayesian learning rule for time-varying communication graphs.   \n\nIn this paper, we design learning dynamics for game models with incomplete information by leveraging the idea of non-Bayesian learning. In our learning process, each agent first performs a local tempered Bayesian update to form a posterior belief according to received noisy cost. Then, agents exchange the posterior belief through a communication network and geometrically average the neighbors' beliefs to achieve belief consensus. Based on the current belief, agents select best response strategies for minimizing the expected cost function. Our contributions are as follows:\n\n\t\n  * We propose a novel distributed non-Bayesian learning dynamics for NE seeking in games with incomplete information, which generalizes the learning rule for social learning considered in <cit.>. Moreover, our dynamics does not require an information system to collect the noisy costs of all agents as in <cit.>.\n\t\n  * We prove that agents' beliefs about the parameter converge to a common belief and that the strategy profiles converge to a Nash equilibrium under this common belief. Compared with <cit.>, the beliefs do not necessarily converge to the common belief faster than O(log t/t) in our algorithm.\n\t\n  * We overcome the difficulty of coupling parameter learning and strategy update by combining the strong law of large numbers and Toeplitz' lemma, thus futher showing that the beliefs about the parameter converge to the true parameter.\n \n\nNotations. Denote by ℝ^n the n-dimensional real Euclidean space and 1_n the n-dimensional vector of all ones. For a matrix A, A(i,j) denotes the element in the ith row and jth column. Δ(S) denotes the set of probability distributions on a set S. For a random variable x with probability distribution μ, denote by 𝔼_μ[x] the expectation of x. Denote by D_KL(μ_1μ_2) the Kullback-Leibler divergence between two probability distributions μ_1 and μ_2. An undirected graph is characterized by the 2-tuple 𝒢 = (𝒱,ℰ), where 𝒱 = {1,…,n} is the set of nodes and ℰ⊂𝒱×𝒱 is the set of edges. A path from i_1 to i_p is an alternating sequence i_1e_1⋯ i_p-1e_p-1i_p such that e_r = (i_r,i_r+1)∈ℰ (r = 1,…,p-1). An undirected graph is connected if there is a path between any pair of distinct nodes.\n\n\n\n§ PROBLEM FORMULATION\n\nConsider a group of N agents that repeatedly play a stage game G = (𝒩,{𝒳_i},{u_i},Θ) with incomplete information. In game G, the strategy variable of each player i∈𝒩:={1,…,N} is denoted by x_i belonging to a convex and compact set 𝒳_i. Define x := col{x_1,…,x_N}∈𝒳:=∏_i=1^N𝒳_i and x_-i:=col{x_1,…,x_i-1,x_i+1,…,x_N}∈∏_j≠ i𝒳_j, respectively, as the strategy profile and the strategies of all agents except i. The important feature of this game is that the cost function of each agent u_i:𝒳×Θ→ℝ depends not only on a strategy profile, but also on an unknown parameter θ in a finite set Θ:={θ_1,…,θ_M}. Assume that the costs are realized with noises given a strategy profile x and a parameter θ. Specifically, let the realized cost of agent i be\n\n    y_i = u_i(x,θ) + ϵ_i(x,θ),\n\nwhere ϵ_i(x,θ) is the noise term with zero mean. Denote by f_i(y_i|x,θ) the likelihood function of y_i. We make the following assumption on the likelihood function.\n\n\tThere exists a positive constant L such that\n\t\n    max_imax_θ',θ”∈Θmax_x∈𝒳sup_y_i|logf_i(y_i|x, θ')/f_i(y_i|x,θ”)|≤ L.\n\n\tIn addition, for each i∈𝒩, f_i(y_i|x,θ) is continuous in x for all θ∈Θ.\n\nAssumption <ref> requires that every realized cost has bounded information content, which is a standard assumption for the convergence of the beliefs in the social learning literature <cit.>. Also, the continuity assumption is crutial to ensure the convergence of the strategies in the game setting <cit.>.\n\nMoreover, we denote the true parameter by θ^∗∈Θ. Then, the associated Nash equilibrium is defined by a strategy profile x^∗ such that no agent can benefit from deviating unilaterally, i.e., for i∈𝒩,\n\n    u_i(x_i^∗,x_-i^∗,θ^∗)≤ u_i(x_i,x_-i^∗,θ^∗), for all x_i∈𝒳_i.\n\n\n\nTo measure the explanatory quality of the parameters in the set Θ, we consider the Kullback–Leibler (KL) divergence between the distribution of the realized costs conditioned over the strategies and parameters. Recall that the KL divergence between any two probability distributions P and P' is defined by\n\n    D_KL(PP'):= 𝔼_P[logP/P'],\n\nwhich equals to 0 if and only if P = P' with probability 1. Inspired by <cit.>, for each agent i∈𝒩 and a given strategy profile x∈𝒳, we define a set of cost-equivalent parameters\n\n    Θ̅_i(x):= {θ∈Θ: D_KL(f_i(y_i|x,θ^∗)f_i(y_i|x,θ)) = 0}.\n\nIn other words, given a strategy profile x, the parameters in the set Θ̅_i(x) are locally indistinguishable to agent i. To learn the true parameter, we generalize the global identifiability assumption in the social learning literature <cit.> to the game setting.\n\n\tFor every θ≠θ^∗, there is at least one agent i∈𝒩 for which the KL divergence D_KL(f_i(y_i|x,θ^∗)f_i(y_i|x,θ)) is strictly positive for all x∈𝒳. \n\nAssumption <ref> guarantees that for all x∈𝒳,\n\n    Θ̅_1(x)∩Θ̅_2(x)∩⋯∩Θ̅_N(x) = {θ^∗}.\n\nTherefore, although a single agent may not distinguish θ^∗ from all other parameters, the true parameter is globally identifiable from the standpoint of the global game model. \n\nThe problem to be addressed in this paper is how agents learn the Nash equilibrium distributedly when the true parameter is unknown. Each agent forms its own belief on the parameter and can exchange information with other agents through a communication network. Agents attempts to learn the true parameter θ^∗ by combining their local knowledge (realized costs) with the information received from the network. \n\nWe model the communication network via an undirected graph 𝒢(𝒩,ℰ), where 𝒩 is the node set and ℰ is the edge set. Denote by 𝒩_i:={j∈𝒩: (j,i)∈ℰ} the set of neighbors of agent i. Each agent can receive information from its neighbors. Moreover, we let W = [w_ij]∈ℝ^N× N denote the associated adjacency matrix, which defines the weights that each agent assigns to neighbors' information such that w_ij > 0 if and only if j∈𝒩_i. We require the following assumptions which have been previously used in distributed optimization <cit.> and game theory <cit.>.\n\n\tThe undirected communication graph 𝒢(𝒩,ℰ) is connected and W is doubly stochastic, i.e., ∑_j=1^Nw_ij = ∑_i=1^Nw_ij = 1.\n\nThe following lemma <cit.> provides a mixing rate of the adjacency matrix and plays an important role in the convergence analysis.\n\n\tDenote by λ_i(W) the i-largest eigenvalue of the mixing matrix. Under Assumption <ref>, W satisfies\n\t\n    |W^t(i,j) - 1/N|≤λ_max(W)^t,\n\n\twhere λ_max(W)≜max{|λ_N(W)|,|λ_2(W)|}∈ (0,1). \n \n\n\n§ ALGORITHM DESIGN\n\nOur learning process consists of two parts: the evolution of agents' beliefs about the unknown parameter and the update of agents' strategies. At each time step t, each agent i maintains a private belief μ_i^(t)∈Δ(Θ) and takes action x_i^(t). The cost y_i^(t) realized according to f_i(y_i^(t)|x^(t),θ) when the parameter is θ and each agent forms a posterior belief b_i^(t) based on the cost. Then, agents exchange the posterior beliefs with their neighbors and updates the private beliefs using a non-Bayesian rule.\n\nGiven the current private belief μ_i^(t+1), agent i evaluates its expected cost by\n\n    u_i(x,μ_i^(t+1)):= ∑_θ∈Θμ_i^(t+1)(θ)u_i(x,θ).\n\nFurther, assuming that the rivals' strategies are fixed as x_-i^(t), the best-response mapping of agent i is defined by\n\n    BR_i(x_-i^(t),μ_i^(t+1)):=min_x_i∈𝒳_iu_i(x_i,x_-i^(t),μ_i^(t+1)).\n\nWe thoroughly describe our learning process in Algorithm <ref>.\n\nNote that the update rule (<ref>) of posterior belief is different from the traditional Bayes rule. Such a generalized posterior is called tempered posterior distribution, which is easier to theoretical analysis <cit.> and more robust to model misspecification <cit.>. Tempered posterior has also been used in social learning <cit.> and stochastic bandit problem <cit.>.\n\n\n\n\n\tCompared to the non-Bayesian learning algorithm for social learning <cit.>, in a game setting, the likelihood functions of the realized costs {y_i^(t)}_t≥ 0 depends not only on the unknown parameter, but also on the strategy profile x^(t). And hence, the costs are not independent and identically distributed with respect to time t. In addition, different from the learning algorithm in <cit.> that requires an information system to centrally perform Bayesian update, agents employ a non-Bayesian rule to distributedly learn the unknown parameter in our algorithm.   \n\n\n\n§ MAIN RESULTS\n\nIn this section, we present the convergence of agents' beliefs to the true parameter and the convergence of the strategy profile to the Nash equilibrium.\n\n\n §.§ Belief Convergence\n\nIn this part, we show that agents' beliefs reach consensus to a common belief μ. Before presenting the proof, we make the following assumption on the step-size sequence. \n\n\tThe step-size sequence {α^(t)} satisfies 0<α^(t)<1, ∑_t=0^∞α^(t) = ∞, and ∑_t=0^∞(α^(t))^2 < ∞.\n\nFirst, we prove the convergence of the average belief ratio 1/N∑_i=1^Nμ_i^(t)(θ)/μ_i^(t)(θ^∗). Let ℱ_t:=σ{μ_i^(0),x_i^(s),y_i^(s),0≤ s≤ t-1, i∈𝒩} denote the σ-field containing the past information about all agents. \n\n\tLet Assumption <ref> hold. Then, the sequence 1/N∑_i=1^Nμ_i^(t)(θ_k)/μ_i^(t)(θ^∗) converges with probability 1 to some non-negative random variable ν_k for all θ_k∈Θ.\n\n\n\tBy the belief update rules (<ref>) and (<ref>),\n\t\n    μ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)   =exp( ∑_j=1^Nw_ijlogb_j^(t)(θ_k)/b_j^(t)(θ^∗))\n       ≤∑_j=1^Nw_ijf_j(y_j^(t)|x^(t),θ_k)^α^(t)μ_j^(t)(θ_k)/f_j(y_j^(t)|x^(t),θ^∗)^α^(t)μ_j^(t)(θ^∗),\n\n\twhere the inequality is followed by ∑_j=1^Nw_ij = 1 and the Jensen's inequality. Furthermore, using ∑_i=1^Nw_ij = 1, we get\n\t\n    ∑_i=1^Nμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)≤∑_i=1^Nf_j(y_i^(t)|x^(t),θ_k)^α^(t)μ_i^(t)(θ_k)/f_i(y_i^(t)|x^(t),θ^∗)^α^(t)μ_i^(t)(θ^∗).\n\n\tThus, by taking conditional expectation and noting that μ_i^(t)(θ) is ℱ_t-measurable for all θ∈Θ, we derive\n\t\n    𝔼[∑_i=1^Nμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)|ℱ_t] ≤∑_i=1^Nμ_i^(t)(θ_k)/μ_i^(t)(θ^∗)𝔼[(f_i(y_i^(t)|x^(t),θ_k)/f_i(y_i^(t)|x^(t),θ^∗))^α^(t)|ℱ_t],\n\n\twhere the expectation is taken on the probability distribution ∏_j=1^Nf_j(y_j|x,θ^∗). Since x^α is a concave function when 0<α<1, Jensen's inequality implies that\n\t\n    𝔼[∑_i=1^Nμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)|ℱ_t]    ≤∑_i=1^Nμ_i^(t)(θ_k)/μ_i^(t)(θ^∗)𝔼[f_i(y_i^(t)|x^(t),θ_k)/f_i(y_i^(t)|x^(t),θ^∗)|ℱ_t]^α^(t)\n       =  ∑_i=1^Nμ_i^(t)(θ_k)/μ_i^(t)(θ^∗)(∫_y_i^(t)f_i(y_i^(t)|x^(t),θ^∗)f_i(y_i^(t)|x^(t),θ_k)/f_i(y_i^(t)|x^(t),θ^∗)dy_i^(t))^α^(t)\n       = ∑_i=1^Nμ_i^(t)(θ_k)/μ_i^(t)(θ^∗),\n\n\twhere the first equality follows from that conditioned on the current action profile x^(t), f_i(y_i^(t)|x^(t),θ_k)/f_i(y_i^(t)|x^(t),θ^∗) is independent of ℱ_t. Therefore, ∑_i=1^Nμ_i^(t)(θ_k)/μ_i^(t)(θ^∗) is a positive supermartingale. By the supermartingale convergence theorem <cit.>, we conclude that 1/N∑_i=1^Nμ_i^(t)(θ)/μ_i^(t)(θ^∗) converges with probability 1.\n\nNext, we establish the consensus of the log-belief ratio logμ_i^(t)(θ)/μ_i^(t)(θ^∗).\n\n\tLet Assumptions <ref>,<ref>,<ref> hold. Then the agents' log-belief ratios reach consensus, i.e., for all θ_k∈Θ,\n\t\n    |logμ_i^(t)(θ_k)/μ_i^(t)(θ^∗) - 1/N∑_i=1^Nlogμ_i^(t)(θ_k)/μ_i^(t)(θ^∗)|→ 0.\n \n\n\n\tAgain, by the belief update rules (<ref>) and (<ref>), we derive\n\t\n    logμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)   = ∑_j=1^Nw_ijlogb_j^(t)(θ_k)/b_j^(t)(θ^∗)\n       = ∑_j=1^Nw_ijlogμ_j^(t)(θ_k)/μ_j^(t)(θ^∗) + α^(t)∑_j=1^Nw_ijlogf_j(y_j^(t)|x^(t),θ_k)/f_j(y_j^(t)|x^(t),θ^∗)\n       = ∑_j=1^N∑_τ=1^tW^τ(i,j)α^(t-τ +1)logf_j(y_j^(t-τ+1)|x^(t-τ +1),θ_k)/f_j(y_j^(t-τ+1)|x^(t-τ +1),θ^∗) + ∑_j=1^NW^t+1(i,j)logμ_j^(0)(θ_k)/μ_j^(0)(θ^∗)\n       = ∑_j=1^N∑_τ=1^tW^τ(i,j)α^(t-τ +1)logf_j(y_j^(t-τ+1)|x^(t-τ +1),θ_k)/f_j(y_j^(t-τ+1)|x^(t-τ +1),θ^∗),\n\n\twhere the last equality follows from μ_i^(0) = 1/M1_M. By the double stochasticity of W, \n\t\n    1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗) = 1/N∑_i=1^N∑_τ=1^tα^(t-τ +1)logf_i(y_i^(t-τ+1)|x^(t-τ +1),θ_k)/f_i(y_i^(t-τ+1)|x^(t-τ +1),θ^∗),\n\n\tAs a result,\n\t\n    |logμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗) - 1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)|\n       ≤∑_j=1^N∑_τ=1^tα^(t-τ+1)|W^τ(i,j) - 1/N||logf_j(y_j^(t-τ+1)|x^(t-τ+1),θ_k)/f_j(y_j^(t-τ+1)|x^(t-τ+1),θ^∗)|.\n\n\tBy the connectivity of the communication graph, |W^τ(i,j) - 1/N|≤λ_max(W)^τ. Thus, by Assumption <ref>,\n\t\n    |logμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗) - 1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)|≤ NL∑_τ = 1^tα^(t-τ+1)λ_max(W)^τ,\n\n\twhich converges to 0 by Lemma 7[Let 0<β<1 and let {γ_k} be a positive scalar sequence. Assume that lim_k→∞γ_k = 0. Then lim_k→∞∑_l=0^kβ^k-lγ_l = 0.] of <cit.>. \n\nLemma 3 provides the reason why we consider a tempered posterior distribution in Algorithm <ref>. Based on Lemma 2 and Lemma 3, we now present our first main result in the following theorem.\n\n\tLet Assumptions <ref>, <ref>, <ref> hold. The belief sequence {μ_i^(t)}_t≥ 0 of each agent generated by Algorithm <ref> converges almost surely to a common belief μ with the form\n\t\n    μ(θ_k) = ν_k/∑_k=1^Mν_k, for k = 1,…,M\n\n\twhere ν_k is defined in Lemma 2.\n\n\n\tPerforming an exponential operation on Lemma 3 yields\n\t\n    μ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)·1/exp(1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗))→ 1.\n\n\tTaking the average, we get\n\t\n    1/N∑_i=1^Nμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)·1/exp(1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗))→ 1.\n\n\tFurthermore, taking the logarithm of both sides, we obtain\n\t\n    log(1/N∑_i=1^Nμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)) - 1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)→ 0.\n\n\tThus, by Lemma 2, \n\t\n    1/N∑_i=1^Nlogμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)→logν_k, a.s.\n\n\tUsing Lemma 3 again, we get\n\t\n    logμ_i^(t+1)(θ_k)/μ_i^(t+1)(θ^∗)→logν_k, a.s.\n\n\tOn the other hand, by the belief update rules,\n\t\n    μ_i^(t+1)(θ^∗)    (<ref>)=exp(∑_j=1^Nw_ijlog b_j^(t)(θ^∗))/∑_θ∈Θexp(∑_j=1^Nw_ijlog b_j^(t)(θ))\n       = (1 + ∑_θ≠θ^∗exp(∑_j=1^Nw_ijlogb_j^(t)(θ)/b_j^(t)(θ^∗)))^-1\n       (<ref>)=(1 + ∑_θ≠θ^∗exp(∑_j=1^Nw_ijα^(t)logf_j(y_j^(t)|x^(t),θ)/f_j(y_j^(t)|x^(t),θ^∗) + ∑_j=1^Nw_ijlogμ_j^(t)(θ)/μ_j^(t)(θ^∗)))^-1\n\n\tWithout loss of generality, we let θ^∗ = θ_1. By Assumption <ref> and Assumption <ref>, logf_j(y_j^(t)|x^(t),θ)/f_j(y_j^(t)|x^(t),θ^∗) is bounded and α^(t)→ 0. Thus, for all θ∈Θ,\n\t\n    exp(∑_j=1^Nw_ijα^(t)logf_j(y_j^(t)|x^(t),θ)/f_j(y_j^(t)|x^(t),θ^∗))→ 1.\n\n\tAnd by (<ref>),\n\t\n    exp(∑_j=1^Nw_ijlogμ_j^(t)(θ_k)/μ_j^(t)(θ^∗))→ν_k,   a.s.\n\n\tSubstituting (<ref>) and (<ref>) into (<ref>), we obtain \n\t\n    μ_i^t+1(θ^∗)→ (1 + ∑_k=2^Mν_k)^-1, a.s.\n\n\tFurther, applying (<ref>) yields\n\t\n    μ_i^t+1(θ_k)→ν_k/1 + ∑_k=2^Mν_k, a.s.\n\n\tThe assertion follows by noting that ν_1 = 1 when θ^∗ = θ_1.\n\nTheorem <ref> shows that agents' beliefs converge to a common belief, which is not necessarily the true belief. Distinct from the centralized Bayesian update in <cit.> whose belief convergence is directly obtained through the martingale convergence theorem, we also need to prove that the beliefs of different agents reach consensus.\n\n\n §.§ Strategy Convergence\n\nSimilar to (<ref>), we define the Nash equilibrium of the game with a common belief μ by a strategy profile x^∗(μ) satisfying\n\n    u_i(x_i^∗(μ),x_-i^∗(μ),μ)≤ u_i(x_i,x_-i^∗(μ),μ), for all x_i∈𝒳_i\n\nwhere the expected cost is defined by (<ref>). Moreover, we consider an auxiliary trajectory x̅(t) generated by the following continuous-time best-response dynamics under the common belief μ \n    dx̅_i(t)/dt∈BR_i(x̅_-i(t),μ) - x̅_i(t),  x̅_i(0) = x_i^(0).\n\nTo study the strategy convergence of Algorithm <ref>, we require the following assumption on the cost function.\n\n\tThe cost function u_i(x_i,x_-i,θ) is continuous in x and strictly convex in x_i for any θ∈Θ.\n\nAssumption <ref> guarantees that there exists a unique Nash equilibrium for the game with a common belief <cit.> and for any μ'∈Δ(Θ) and any x_-i∈𝒳_-i, the best response mapping BR_i(x_-i,μ') is single-valued. Further, from Berge's maximum theorem <cit.>, BR_i(x_-i,μ') is continuous in both x_-i and μ'. \nIn addition, inspired by <cit.>, we impose the following assumption on the best-response dynamics (<ref>), which holds for potential games and dominance solvable games <cit.>.\n\n\tFor any x^(0)∈𝒳, the solution of (<ref>) converges to the Nash equilibrium of the game with the common belief μ, i.e., lim_t→∞x̅(t) = x^∗(μ). \n\nOur next main result is based on the following stochstic approximation conclusion <cit.>.\n\n\tConsider a stochstic approximation scheme\n\t\n    z_n+1 = z_n + γ_n(h(z_n) + ξ_n),\n\n\twhere {ξ_n} is a bounded random sequence with ξ_n→ 0 almost surely. Assume that h is Lipschitz continuous and the step-size sequence γ_n satisfies ∑_nγ_n = ∞ and ∑_nγ_n^2<∞. If sup_nz_n<∞ almost surely, then the sequence {z_n} converges almost surely to the set of asymptotically stable equilibria of the dynamics dz(t)/dt = h(z(t)). \n\nWe proceed to derive the convergence of the strategy profiles {x^(t)}_t=1^∞.\n\n\tLet Assumptions <ref>, <ref>-<ref> hold. Then, the strategy profile x^(t) generated by Algorithm <ref>  converges almost surely to x^∗(μ).\n\n\n\tBy (<ref>), we get\n\t\n    x_i^(t+1)   = (1 - α^(t))x_i^(t) + α^(t)BR_i(x_-i^(t),μ_i^(t+1))\n       =x_i^(t) + α^(t)(BR_i(x_-i^(t),μ_i^(t+1)) - x_i^(t))\n       = x_i^(t) + α^(t)(BR_i(x_-i^(t),μ) - x_i^(t) + BR_i(x_-i^(t),μ_i^(t+1)) - BR_i(x_-i^(t),μ))\n\n\tNote by Theorem 1 that μ_i^(t+1)→μ almost surely. Thus, using the continuity of BR_i, we obtain\n\t\n    BR_i(x_-i^(t),μ_i^(t+1)) - BR_i(x_-i^(t),μ)→ 0, a.s.\n\n\tThe conlusion is followed by applying Assumption <ref> and Assumption <ref> to Lemma 4.\n\nThe strategy update rule (<ref>) is similar to the best-response strategy considered in <cit.>, except that each agent uses its own belief in our algorithm. In fact, the equilibrium strategy and the corresponding convergence result in <cit.> are also applicable since we have obtained μ_i^(t)→μ, a.s..\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Convergence to the True Parameter\n\nIn this part, we further prove that agents' beliefs converge to the true belief by combining Theorem 1 and Theorem 2. In general, the strong law of large numbers and McDiarmid’s inequality are employed in the social learning literature <cit.> to show the convergence of agents' beliefs to the true parameter. However, all these results rely on an assumption that the private signals (realized costs in our setting) are independent and identically distributed across the time t. And hence, these techniques cannot be directly applied to the game setting as the realized costs are not i.i.d due to the influence of the strategies. We instead use the following Toeplitz's lemma <cit.> to develop a similar convergence result.\n\n\tLet {A_nk,1≤ k≤ k_n}_n≥ 1 be a double array of positive numbers such that for fixed k, A_nk→ 0 when n→∞. Let {Y_n}_n≥ 1 be a sequence of real numbers. If Y_n→ y and ∑_k=1^k_nA_nk→ 1 when n→∞, then lim_n→∞∑_k=1^k_nA_nkY_k = y. \n\t\n \nNow we state our final main result in the following theorem.\n\n\tSuppose that Assumptions <ref>-<ref> hold. Let {μ_i^(t)}_t≥ 0 be the belief sequence generated by Algorithm <ref>. Then, for each agent i∈𝒩, it holds that \n\t\n    lim_T→∞1/∑_t=1^Tα^(t)logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k)\n    \t= Z(θ^∗,θ_k)   a.s.\n\n\twhere Z(θ^∗,θ_k)=1/N∑_j=1^ND_KL(f_j(y_j|x^∗(μ),θ^∗)f_j(y_j|x^∗(μ),θ_k)) is the network divergence and x^∗(μ) is defined in Assumption <ref>. In particular, we have μ_i^(t)(θ^∗)→ 1 almost surely.\n\n\n\tSimilar to (<ref>), we get\n\t\n    lim_T→∞1/∑_t=1^Tα^(t)logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k)\n       = lim_T→∞1/∑_t=1^Tα^(t)∑_j=1^N∑_t=1^TW^t(i,j)α^(T-t+1)logf_j(y_j^(T-t+1)|x^(T-t+1),θ^∗)/f_j(y_j^T-t+1|x^(T-t+1),θ_k)\n       = lim_T→∞1/∑_t=1^Tα^(t)∑_j=1^N∑_t=1^Tα^(T-t+1)(W^t(i,j) - 1/N)logf_j(y_j^(T-t+1)|x^(T-t+1),θ^∗)/f_j(y_j^(T-t+1)|x^(T-t +1),θ_k)\n          + lim_T→∞1/∑_t=1^Tα^(t)1/N∑_j=1^N∑_t=1^Tα^(T-t+1)logf_j(y_j^(T-t+1)|x^(T-t+1),θ^∗)/f_j(y_j^(T-t+1)|x^(T-t +1),θ_k).\n\n\tNote by (<ref>) and (<ref>) that\n\t\n    lim_T→∞1/∑_t=1^Tα^(t)∑_j=1^N∑_t=1^Tα^(T-t+1)(W^t(i,j) - 1/N)logf_j(y_j^(T-t+1)|x^(T-t+1),θ^∗)/f_j(y_j^(T-t+1)|x^(T-t +1),θ_k)\n       = lim_T→∞1/∑_t=1^Tα^(t)(logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k) - 1/N∑_i=1^Nlogμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k))\n       = 0,\n\n\twhere the last equality follows from Lemma 3 and Assumption <ref>. As a result, combining the above two relations and denoting by z_j^(t)(θ^∗,θ_k) = logf_j(y_j^(t)|x^(t),θ^∗)/f_j(y_j^(t)|x^(t),θ_k) and s^(T) = ∑_t=1^Tα^(t), we further derive\n\t\n    lim_T→∞1/∑_t=1^Tα^(t)logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k)\n       = lim_T→∞1/∑_t=1^Tα^(t)1/N∑_j=1^N∑_t=1^Tα^(T-t+1)logf_j(y_j^(T-t+1)|x^(T-t+1),θ^∗)/f_j(y_j^(T-t+1)|x^(T-t +1),θ_k)\n       = 1/N∑_j=1^Nlim_T→∞1/s^(T)∑_t=1^Tα^(t)z_j^(t)(θ^∗,θ_k)\n\n\tTo consider the convergence of the weighted average of the random variables z_j^(t)(θ^∗,θ_k), we first study the convergence of 1/T∑_t=1^Tz_j^(t)(θ^∗,θ_k). By Theorem 2, x^(t)→ x^∗(μ) almost surely. We define the following cumulative distribution functions\n\t\n    F_j^(t)(z)≜ P{z_j^(t)(θ^∗,θ_k)≤ z},   F_j^∗(z)≜ P{logf_j(y_j|x^∗(μ),θ^∗)/f_j(y_j|x^∗(μ),θ_k)≤ z}.\n\n\tWe establish the relationship between F_j^(t)(z) and F_j^∗(z) in two steps.\n\n\tStep 1: From F_j^(t)(z) to uniform distribution on [0,1]\n\n\tDefine\n\t\n    Δ_j^(t)≜ F_j^(t)(z_j^(t)(θ^∗,θ_k)).\n\n\tThen, Δ_j^(t)∈[0,1] and for any δ∈[0,1],\n\t\n    P{Δ_j^(t)≤δ} = P{z_j^(t)(θ^∗,θ_k)≤ (F_j^(t))^-1(δ)} = F_j^(t)(F_j^(t))^-1(δ) = δ.\n\n\tThus, Δ_j^(t) has a uniform distribution on [0,1] for all t.\n\n\tStep 2: From uniform distribution on [0,1] to F_j^∗(z)\n\n\tDefine\n\t\n    η_j^(t)≜ (F_j^∗)^-1(Δ_j^(t)).\n\n\tSince Δ_j^(t) has a uniform distribution, we get \n\t\n    P{η_j^(t)≤ z} = P{Δ_j^(t)≤ F_j^∗(z)} = F_j^∗(z).\n\n\tNote that conditioned on the action profiles, the sequence {z_j^(t)(θ^∗,θ_k)} is independent over t. Therefore, the sequence {η_j^(t)}_t≥ 1 is independent and identically distributed over t and has the cumulative distribution function F_j^∗(z). Furthermore, by the strong law of large numbers,\n\t\n    lim_T→∞1/T∑_t=1^Tη_j^(t) = 𝔼[logf_j(y_j|x^∗(μ),θ^∗)/f_j(y_j|x^∗(μ),θ_k)]   a.s.\n\n\t\n\tOn the other hand, since x^(t)→ x^∗(μ) a.s., we get by the continuity of the likelihood function (Assumption 1) that z_j^(t)(θ^∗,θ_k)→logf_j(y_j|x^∗(μ),θ^∗)/f_j(y_j|x^∗(μ),θ_k), a.s. Thus, the convergence also holds in distribution, i.e., for all z∈ℝ,\n\t\n    lim_t→∞F_j^(t)(z) = lim_t→∞F_j^∗(z).\n\n\tMoreover, since the set of discontinuous points of a monotone function is at most countable <cit.>, we get\n\t\n    lim_t→∞(z_j^(t)(θ^∗,θ_k) - η_j^(t)) = lim_t→∞(z_j^(t)(θ^∗,θ_k) - (F_j^∗)^-1F_j^(t)(z_j^(t)(θ^∗,θ_k))) = 0   a.s.\n \n\tBy (<ref>)-(<ref>) and using Toeplitz's lemma (Lemma 4) with A_Tt = 1/T (t = 1,…,T) and Y_t = z_j^(t)(θ^∗,θ_k) - η_j^(t), we obtain\n\t\n    lim_T→∞1/T∑_t=1^Tz_j^(t)(θ^∗,θ_k) = 𝔼[logf_j(y_j|x^∗(μ),θ^∗)/f_j(y_j|x^∗(μ),θ_k)]   a.s.\n\n\t\n\tNext, we associate the weighted sum (<ref>) with lim_T→∞1/T∑_t=1^Tz_j^(t)(θ^∗,θ_k). From (<ref>), we further derive \n\t\n    lim_T→∞1/∑_t=1^Tα^(t)logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k)\n       = 1/N∑_j=1^Nlim_T→∞1/s^(T)(Tα^(T)·1/T∑_t=1^Tz_j^(t)(θ^∗,θ_k) + ∑_t=1^T-1t(α^(t) - α^(t+1))·1/t∑_τ=1^tz_j^(τ)(θ^∗,θ_k)).\n\n\tNotice that Tα^(T) + ∑_t=1^T-1t(α^(t) - α^(t+1)) = s^(T). As a result, by s^(T)→∞ (T→∞), applying Toeplitz's lemma again with A_Tt = t(α^(t) - α^(t+1))/s^(T) (t = 1,…,T-1), A_TT = Tα^(T)/s^(T), and Y_t = 1/t∑_τ=1^tz_j^(τ)(θ^∗,θ_k) yields\n\t\n    lim_T→∞1/∑_t=1^Tα^(t)logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k)   = 1/N∑_j=1^Nlim_T→∞1/T∑_t=1^Tz_j^(t)(θ^∗,θ_k)\n       = 𝔼[1/N∑_j=1^Nlogf_j(y_j|x^∗(μ),θ^∗)/f_j(y_j|x^∗(μ),θ_k)]   a.s.\n\n\t\n\tRecall that Z(θ^∗,θ_k)≜1/N∑_j=1^ND_KL(f_j(y_j|x^∗(μ),θ^∗)f_j(y_j|x^∗(μ),θ_k)). From the definition (<ref>) of KL divergence,\n\t\n    Z(θ^∗,θ_k) = 𝔼[1/N∑_j=1^Nlogf_j(y_j|x^∗(μ),θ^∗)/f_j(y_j|x^∗(μ),θ_k)].\n\n\tBy Assumption <ref>, Z(θ^∗,θ_k) is strictly positive. Additionally, from (<ref>), for all ϵ > 0, there exists T' such that for all T≥ T',\n\t\n    |1/s^(T)logμ_i^(T+1)(θ^∗)/μ_i^(T+1)(θ_k) - Z(θ^∗,θ_k)|≤ϵ   a.s.\n\n\tTherefore,\n\t\n    μ_i^(T+1)(θ_k)/μ_i^(T+1)(θ^∗)≤exp(-s^(T)(Z(θ^∗,θ_k) - ϵ))   a.s.\n\n\tUsing ∑_k=1^Mμ_i^(T+1)(θ_k) = 1, we get\n\t\n    1/μ_i^(T+1)(θ^∗) - 1≤∑_θ_k≠θ^∗exp(-s^(T)(Z(θ^∗,θ_k) - ϵ))   a.s.\n\n\tFurthermore, we derive\n\t\n    1/1 + ∑_θ_k≠θ^∗exp(-s^(T)(Z(θ^∗,θ_k) - ϵ))≤μ_i^(T+1)(θ^∗)≤ 1   a.s.\n\n\tHence we have that μ_i^(t)(θ^∗)→ 1 a.s., and the assertion is proved.\n\nTheorem 3 establishes the convergence of the beliefs to the true parameter and the rate is given by (<ref>). Combining Theorem 3 and Theorem 2, we further obtain that the strategy profile converges to the true Nash equilibrium. \n\n\tThe equation (<ref>) shows that the convergence rate depends on the step-size sequence {α^(t)}. Combined with Theorem 1 in <cit.>, we know that if we choose an appropriate sequence {α^(t)} such that μ_i^(t) converges to μ at a rate faster than O(log t/t), agents may replace the best response strategies with a distributed fictitious play scheme. \n\n\n\n§ CONCLUSION\n\nIn this paper, we studied a Nash equilibrium seeking problem in games with a cost-relevant parameter. In order to learn the true parameter while finding the Nash equilibrium, we introduced a diminishing step-size sequence on the basis of the traditional non-Bayesian learning rule to ensure that the beliefs of agents on the parameter reach consensus. Then we combined the best response dynamics to update the strategies, and thus, proposed a novel distributed non-Bayesian rule. Using the strong law of large numbers and Toeplitz's lemma, we showed that agents' beliefs concentrate on the true parameter and the strategy profile converges to the true Nash equilibrium.  \nIEEEtran\n\n"}