{"entry_id": "http://arxiv.org/abs/2303.07208v1", "published": "20230313154006", "title": "Social network analysis of Japanese manga: similarities to real-world social networks and trends over decades", "authors": ["Kashin Sugishita", "Naoki Masuda"], "primary_category": "physics.soc-ph", "categories": ["physics.soc-ph", "cs.SI"], "text": "\n\nAPS/123-QED\n\n\n\n\n\n\n\n\n\nDepartment of Transdisciplinary Science and Engineering, Tokyo Institute of Technology, 152-8550 Tokyo, Japan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n naokimas@buffalo.edu\n\nDepartment of Mathematics, State University of New York at Buffalo, Buffalo, NY 14260-2900, USA\n\nComputational and Data-Enabled Science and Engineering Program, State University of New York at Buffalo, Buffalo, NY 14260-5030, USA\n\n\n\n\n             \n\n\nManga, Japanese comics, has been popular on a global scale.\nSocial networks among characters, which are often called character networks, may be a significant contributor to their popularity. \nWe collected data from 162 popular manga that span over 70 years and analyzed their character networks.\nFirst, we found that many of static and temporal properties of the character networks are similar to those of real human social networks.\nSecond, the character networks of most manga are protagonist-centered such that a single protagonist interacts with the majority of other characters.\nThird, the character networks for manga mainly targeting boys have shifted to denser and less protagonist-centered networks and with fewer characters over decades.\nManga mainly targeting girls showed the opposite trend except for the downward trend in the number of characters. \nThe present study, which relies on manga data sampled on an unprecedented scale, paves the way for further population studies of character networks and other aspects of comics.\n\n\n\n                              \nSocial network analysis of Japanese manga: similarities to real-world social networks and trends over decades\n    Naoki Masuda\n    March 30, 2023\n=============================================================================================================\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe global comic market has been rapidly growing. \nThe market size was valued at USD 14.7 billion in 2021 and is expected to expand at a compound annual growth rate of 4.8% from 2022 to 2029 <cit.>.\nA driving force underlying the rapid expansion of the market is the widespread availability of e-books, which enables us to easily access comics around the world.\nThe COVID-19 pandemic also helped the growth of the comic market because the lockdown in many countries increased the demand for comics. \nManga, Japanese comics, has been especially popular on a global scale.\nMany manga have been translated into different languages.\nFor example, over 510 million copies of One Piece have circulated worldwide; One Piece is recorded in the Guinness Book of Records as the best-selling comic in the history <cit.>.\nThe history of the development of manga culture in Japan, its social background, and its global prevalence have been studied <cit.>.\n\n\nOur social networks are complex but characterized by common properties such as heterogeneity and community structure <cit.>. \nBecause literally all storylines of manga rely on interactions among characters,  social networks among characters, which are often called character networks, may provide a backbone of the story of manga and influence its popularity. \nMore generally, character networks have been analyzed for quantitatively characterizing fiction works <cit.>.\nA number of problems can be addressed through analyses of character networks, such as summarization <cit.>, classification <cit.>, and role detection <cit.>.\nCharacter networks have been studied for a variety of fiction such as novels <cit.>, plays <cit.>,  movies <cit.>, and TV series <cit.>.\nHowever, character networks for comics have been rarely explored except for Marvel comics <cit.>\nand a few manga titles <cit.>. \nOne possible reason for this is the difficulty of automating data collection for comics <cit.>.\n\n\n\n\nIn the present study, we analyze character networks of 162 popular Japanese manga that span decades and test the following two hypotheses. \nFirst, we expect that popular manga tend to produce realistic social networks.\nTherefore, we hypothesize that structural and temporal properties of the character networks of manga are similar to those of human social networks. \nSecond, our data enables us to investigate how trends of manga have changed over approximately 70 years. \nTherefore, we hypothesize that character networks of modern manga and old ones are systematically different. \nWe also examine differences in the network structure between manga mainly targeting boys versus girls. \n\n\n\n\n§ RESULTS\n\n\n\n\n §.§ Similarities to Empirical Social Networks\n\nOur original data are equivalent to a temporal bipartite graph in which the two types of nodes are characters and pages, and the edges connect characters to the pages in which they appear. \nThe pages are ordered in time.\nWe show the degree distribution for the character nodes for One Piece and the Poisson distribution with the same mean in Fig. <ref>A. \nThe coefficient of variation (CV), which is defined as the standard deviation divided by the average, of the original degree distribution is 1.66. \nThis value is approximately 11.1 times larger than that of the Poisson distribution. \nTherefore, similar to human social networks <cit.>, the characters in manga have heterogeneous numbers of connections, and there are a small number of characters that appear disproportionately frequently on various pages. \nWe obtained similar results for the other manga (see https://github.com/KS-92/MangaSI file).\n\n\n\n\n\n\nIn contrast, the CV of the degree distribution for the page nodes is 0.462 for One Piece. \nThe CV for the Poisson distribution with the same mean is 0.580.\nTherefore, we argue that the characters do not appear uniformly randomly over the pages. \nAs we show in Fig. <ref>B, there are typically two or three characters on a page in One Piece, and pages containing none or just one character are relatively rare.\nWe obtained similar results for the other manga (see https://github.com/KS-92/MangaSI file).\nThese results suggest that the high heterogeneity of the characters in terms of the frequency of appearance on pages and the tendency of a page typically containing two or three characters are two common properties of manga. \nTherefore, in the following analyses, we consider the bipartite configuration model, in which the degrees of all character and page nodes are preserved and the edges are otherwise randomly placed, as a null model. \nThen, we examine properties of character networks that we can explain by the null model versus those we cannot.\n\n\nWe show the weighted character network, which is the projection of the bipartite graph onto the space of character nodes, for One Piece in Fig. <ref> (see https://github.com/KS-92/MangaSI Fig. S1 for the networks for all 162 manga). \nBy definition, the edge weight is equal to the number of pages in which the two characters simultaneously appear.\nThe character networks vary widely in size from manga to manga.\nSpecifically, the number of nodes, N, ranges from 8 to 124, with mean± standard   deviation=32.6 ± 16.6. \nThe number of edges, M, ranges from 19 to 950, with mean± standard   deviation=156.1 ± 128.9. \nWe define the protagonist as the node with the largest node strength (i.e., weighted degree) in the character network.\nThe protagonist is the character that appears in the largest number of pages for most manga (97.5%).\nIn fact, the protagonist for One Piece, indicated by an arrow in Fig <ref>, is Monkey D. Luffy, who is generally known as the most central character in One Piece.\n\n\n\nWe compared various properties of character networks between the empirical character networks and their randomization obtained by the one-mode projection of the bipartite network generated by the bipartite configuration model.\nWe first compare three strength-related indices, i.e., the average strength, ⟨ s ⟩, the CV of the strength, s_ CV, and the strength of the protagonist, s_P, of the character networks for all 162 manga between the original and randomized networks in Figs. <ref>A-C.\nThese figures suggest that randomized character networks well explain the strength-related indices of the original character networks.\n\nFigure <ref>A shows the strength distribution for One Piece. \nWe find that the strength obeys a heavy-tailed distribution over some scale.\nThis result is consistent with Fig. <ref>B, which shows that the CV of the strength for most manga is substantially larger than 1; the CV for One Piece is 1.48.\nNote that the exponential distribution, which lacks a heavy tail, yields CV=1.\nThe heavy-tailed strength distributions shown in Fig. <ref>A for One Piece and implied in Fig. <ref>B for a majority of manga are consistent with those for empirical social networks <cit.>.\n\n\n\n\n\n\n\n\n\n\nIn contrast to the strength-related indices, the randomized character networks do not explain the degree-related indices of the original character networks. \nThe randomized networks tend to overestimate the average degree, ⟨ k ⟩, of the original character networks (see Fig. <ref>D).\nThis result suggests that characters tend to repeat interacting with relatively few characters. \nThe CV of the degree, k_ CV, for the original networks tends to be larger than that for the randomized networks (see Fig. <ref>E).\n\n\nThe fraction of the other characters that the protagonist is adjacent to, k_ P/(N-1), is 0.900 ± 0.103 \n   ( mean± standard   deviation  based on the 162 manga) and 0.971 ± 0.0413 for the original and randomized character networks, respectively  (see Fig. <ref>F).\nTherefore, the protagonist is adjacent to most of the other characters in both original and randomized networks.\nBased on these results, we conclude that the character networks are strongly protagonist-centered, in which the protagonist interacts with most of the other characters, while other characters tend to interact only with fewer characters than expected for the randomized networks, but including the protagonist. \nThis interpretation is consistent with the aforementioned observation that ⟨ k⟩ and k_ CV are smaller and larger for the original than randomized networks, respectively.\n\nWe show the degree distribution for One Piece in Fig. <ref>B.\nThe CV of the degree, k_ CV, for One Piece is 0.77.\nFigure <ref>E shows that the CV of the degree for most of the manga is smaller than 1.\nIn fact, this result is consistent with that for empirical social networks with similar number of nodes <cit.>, while large empirical social networks tend to have heavy-tailed degree distributions implying a large CV <cit.>.\n\n\nWe found that the strength is super-linearly scaled with the degree, i.e., s_i ∝ k_i^α with α>1, in the character networks, where ∝ indicates “proportional to”.\nNote that the absence of correlation between the strength and degree would yield α=1 <cit.>.\nSpecifically, in Fig. <ref>C, we show the relationship between k_i and s_i for One Piece.\nWe obtained α=1.94 with the coefficient of determination R^2=0.847.\n\n\nWe obtained similar results for the other manga (see Fig. <ref>G). \nThese results are consistent with power-law relationships between the strength and degree with α > 1, which has been observed in empirical social networks <cit.>. \nNote that the randomized character networks also yield α > 1 and that α for the original and randomized networks are highly correlated with a small number of exceptions.\n\n\n\n\nThe character networks are disassortative. \nThe degree assortativity coefficient, denoted by r, of the character network is -0.345 on average.\nIn fact, the values of r for all but two manga are negative (see Fig. <ref>H).\nThis result is in stark contrast with various observations that social networks are more often than not assortative with positive r <cit.>.\nWe argue that the character networks are disassortative because they are strongly protagonist-centered.\nIn fact, star graphs are disassortative with large negative values of r <cit.>. \nThe degree disassortativity is also observed for empirical egocentric social networks <cit.>.\nFigure <ref>H indicates that r is also negative for the randomized character networks although the correlation between r for the original and randomized networks is low.\nTherefore, we conclude that the degree disassortativity in our character networks is a consequence of the protagonist-centered nature of the original character-page bipartite network.\n\n\n\n\n\n\n\n\n\n\nThe character networks are highly clustered. \nThe clustering coefficient, denoted by C, over the different manga is 0.790 with the minimum value of 0.598 (see Fig. <ref>I).\nThis result is consistent with the observations that empirical social networks have high clustering coefficients <cit.>. \nIn fact, randomized character networks also have similarly large C although the spread is large between the empirical and randomized networks.\nTherefore, we conclude that a high clustering coefficient is a consequence of one-mode projection of the bipartite graph, which is known <cit.>. \n\n\nWe found that heavy-tailed distributions\nof interevent times (IETs) are simultaneously present for nodes and edges in the character networks.\nCopresence of two characters on a page defines a time-stamped event on the edge, where we identify the page number as discrete time. \nA time-stamped event for a given node is the presence of the character on a page.\nWe show the survival functions of the IETs (i.e., probability that the IET, denoted by τ, is larger than the specified value) for individual nodes and edges in One Piece in Figs. <ref>A and <ref>B, respectively. \nThe relatively slow decay in Fig. <ref> suggests heavy-tailed distributions for both nodes and edges across some scales of τ.  \nThe CV values for IETs on nodes and edges for One Piece are 1.72 ± 0.697 and 1.92 ± 0.535, respectively. \nWe obtained similar results for the other manga, as we show in Figs. <ref>J and <ref>K.\nThese figures also indicate that the randomization of the bipartite network does not preserve this feature, yielding CV values close to 1 regardless of the CV value for the original temporal character networks.\nIt should be noted that a Poisson process produces an exponential IET distribution, which yields CV = 1.\nThese results support that IETs for nodes and edges in the original character networks are non-Poissonian and heterogeneously distributed, which is consistent with properties of empirical social networks <cit.>.\n\n\n\n\n\nRelated to heavy-tailed IET distributions, we found that epidemic spreading occurs more slowly in the temporal character networks than in randomized counterparts. \nWe ran the susceptible-infectious (SI) model.\nBy assumption, an infectious character independently infects each susceptible character coappearing on the same page with probability β=0.2.\nWe ran the SI dynamics N times, with the ith character being the only initially infectious one in the ith run.\nFor One Piece, we show in Fig. <ref> the time course of the fraction of the infectious characters averaged over the N runs. \nWe also show the corresponding averaged time courses for each of the 1,000 randomized temporal networks by the blue lines.\nFigure <ref> indicates that the infection occurs more slowly in the original temporal network than in the randomized temporal networks. \nWe obtained similar results for the other manga (see Fig. <ref>L). \nThese results are qualitatively the same as those observed for empirical social temporal networks <cit.>.\n\n\n\n\n §.§ Trends of Network Structure over Decades\n\n\n\nThe 162 manga span nearly 70 years, from Astro Boy with the first volume being published in 1952 to Jujutsu Kaisen in 2018 (see https://github.com/KS-92/MangaSI file for detailed information on the 162 manga).\nThe trend of the structure of manga character networks may have changed over the ≈ 70 years, reflecting the transitions of Japanese society including in economics and fashion.\nIn this section, we explore possible existence of such trends.\n\n\n\n\nWe first calculated the Pearson correlation coefficient between the year of publication of the first volume, denoted by y, and various indices of network structure on the basis of all 162 manga.\nWe show the correlation coefficients and their 95% confidence intervals (CIs) in Fig. <ref>A.\nWe find that the number of characters, N, tends to decrease over decades (i.e., negative correlation between N and y). \nThe CV of the node degree, k_ CV, and that of the node strength, s_ CV, are negatively correlated with y with moderate effect sizes.\nIn general, these and other network indices may be affected by the number of nodes, N <cit.>. \nTherefore, we also examined the partial correlation coefficient between y and each index by partialing out the effect of N.\nThe results of the partial correlation coefficient for k_ CV and s_ CV, shown by the lines with squares in Fig. <ref>A, are consistent with those of the Pearson correlation coefficient, although the partial correlation is closer to 0 than the Pearson correlation.\nWe also find that the average degree, ⟨ k ⟩, is positively correlated with y in terms of the partial correlation. \nThese results suggest that more recent manga tend to be denser and more homogeneous in the node's connectivity, such that various characters, not just the protagonist, tend to have more connections in more recent manga.\n\n\n\n\nHow the trend of the character network changes over time may depend on genres of manga.\nA most major categorization of Japanese manga is the one based on the gender of their main readership <cit.>.\nTherefore, we classify the 162 manga into 124 boys' and 38 girls' manga based on the genre section on their Wikipedia pages (see https://github.com/KS-92/MangaSI file for the genre of each manga), while their classification is necessarily subjective. \nWe show the Pearson and partial correlation coefficients between each index and y, separately for the boys' and girls' manga in Figs. <ref>B and <ref>C, respectively.\n\nWe find that there tend to be less characters for more recent manga for both boys' and girls' manga.\nThe boy's and girls' manga are different in the following aspects in terms of the partial correlation coefficients, i.e., when we control for the number of characters. \nThe trends that we identified for all the 162 manga are even more pronounced in the boys' manga.\nThe effect sizes of the partial correlation for ⟨ k ⟩, k_ CV, and s_ CV for the boys' manga are larger than those for the 162 manga.\nIn addition, the degree assortativity coefficient, r, is positively correlated with y. \nBecause r is negative for most manga, this result implies that r tends to be closer to 0 for more recent boys' manga.\nOn the other hand, the two protagonist-related indices, i.e., k_ P/(N-1) and s_ P, are not correlated with y. \nThese results suggest that the character networks in more recent boys' manga tend to be less protagonist-centered, in which non-protagonist characters have more  connections among them.\n\nThe trend for the girls' manga is opposite to that for the boys' manga except that the downward trend in the number of characters is common.\nThe two indices for which the partial correlation was negative for the boys' manga, i.e., k_ CV and s_ CV, are positively correlated with y for the girls' manga in terms of the partial correlation.\nOn the other hand, the two indices for which the partial correlation was positive for the boys' manga, i.e., ⟨ k ⟩ and r, are negatively correlated with y for the girls' manga.\nFurthermore, the normalized degree of the protagonist, k_ P/(N-1), for which we did not confirm a correlation for the boys' manga, is positively correlated with y.  \nOverall, these results indicate that the character networks in the girls' manga have shifted toward more protagonist-centered networks.\n\n\n\n§ DISCUSSION\n\nWe found that the empirical character networks have various features consistent with empirical social networks.\nThe bipartite configuration model, which is a standard random bipartite graph, has been shown to be reasonably accurate at explaining some features of the empirical character networks including statistics of the node's strength, α values, disassortativity, and the high clustering coefficients.\nIn contrast, there are other features of the empirical character networks that deviate from the expectation from the bipartite configuration graph.\nSuch features include statistics of the degree, the IET distributions, and speeds of epidemic spreading.\nWe suggested that part of these differences originates from the protagonist-centered nature of the character networks. \nIn other words, the protagonist interacts with most characters, while non-protagonist characters tend to interact only with the protagonist and a smaller number of other characters than expected by the configuration model.    \nThere are positive support of protagonist-centered social networks in the real world when the network is egocentric\n <cit.>.\n\nSimilarities between character networks and human social networks have been investigated for some fictions such as Marvel comics <cit.>, Shakespeare's plays <cit.>, and myths <cit.>.\nOur results of the high clustering coefficient and the heavy-tailed distribution of the strength in the character networks are consistent with these previous studies.\nHowever, we ascribe the high clustering coefficient to the effect of one-mode projection rather than to similarity to empirical social networks because the randomized character networks also have high clustering.\nOur results of the disassortativity is also consistent with the results for Marvel comics <cit.> and myths <cit.>.\nTherefore, we infer that the heavy-tailed distribution of the strength and disassortativity in the character networks are common properties for various types of fictions.\nAlthough the aforementioned previous studies investigated only the static properties of the character networks, we further revealed temporal properties of the character networks, such as the long-tailed IET distributions, which are in fact consistent with empirical social networks <cit.>. \n\n\nWe also found that the trend of the manga character networks has shifted over decades. \nSpecifically, more modern manga tend to have fewer characters, denser and be less protagonist-centered for the boys’ manga, which may reflect a modern change in the society that places more emphasis on diversity and teamwork <cit.>.\nIn contrast, the character networks in the girls' manga have shifted toward more protagonist-centered, although the downward trend in the number of characters is common.\nIn general, girls' manga in Japan tend to revolve around issues of love and friendship with a focus on inner feelings of the protagonist <cit.>.\nOur results suggest that more recent girls' manga may describe the relationships between the protagonist and a few other characters in depth.\n\nThere are many future directions of investigation.\nFirst, we focused on 162 manga with high circulations. \nBy analyzing manga with low circulation as well, we may be able to discover static and temporal properties of character networks that readers favor, contributing to understanding why some manga are more popular than others.\nSecond, we analyzed only the first three volumes of each manga.\nExamining all volumes would allow us to understand the narrative structure, which have been analyzed for novels <cit.>, movies <cit.>, and TV series <cit.>.\nFor this purpose, a wide variety of time series and temporal network analysis tools, such as change-point detection, temporal centrality, and temporal community structure, may be useful <cit.>.\nThird, character networks are probably signed in most cases, connecting characters by positive or negative ties. \nIt is worth to deploy sentiment analysis based on text <cit.> and facial expressions <cit.> to construct and analyze signed networks of characters in manga.\nTemporal network analysis of signed character networks may also reveal complicated dynamics of relationships among characters (e.g., an enemy \n later becomes an ally).\nFourth, manga in different genres such as action, adventure, sports, and comedy, may  have different structures of character networks.\nIn addition, we have only analyzed the manga that have been published in the paperback pocket edition, which is the most common for the boys' and girls' manga in Japan. \nAnalyzing manga of other sizes may help us understand variation of character networks over a wider range of genres.\nFifth, studying character networks in comics in countries other than Japan warrants future work. \nFor example, character networks may reflect societal differences from country to country.\n\nIn conclusion, to the best of our knowledge, the present study of character networks for 162 manga titles is unprecedented in scale in quantitative studies of comics and has enabled us to discover their general features.\nWe also introduced new tools and views to the analysis of fiction character network data, such as the bipartite configuration model, the concept of protagonist-centeredness, and temporal network analysis.\nWe hope that this study triggers further quantitative studies of character networks in manga and other types of fictions.\n\n\n\n\n\n\n§ MATERIALS AND METHODS\n\n\n\n §.§ Data Collection\n\nWe focus on manga of which more than 10 million copies have been published in Japan as of January 2021 <cit.>.\nSince the physical size of the manga may affect the number of panels per page and we adopted the page as the unit of analysis, we excluded the manga that had not been published in the paperback pocket edition (112   mm× 174   mm).\nNote that the paperback pocket edition is the most common for the boys' and girls' manga in Japan.\nAs a result, we included 162 manga (see https://github.com/KS-92/MangaSI file for the list of the 162 manga).\n\nWe prepared a data table of time-stamped copresence of characters for each manga as follows. \nFor each manga, we manually examined volumes one through three.\nAll the selected 162 manga had at least three volumes.\nThen, we first extracted all the characters whose name, blood relation to a named character, or job title that uniquely identifies the character, is known. \nTo ensure the reproducibility of this work, we avoided to use any other information sources  (e.g., other volumes of the same manga, the Internet, or anime) to attempt to identify more characters. \nIn practice, such additional information sources would not contribute to identifying many more characters. \nSecond, we recorded the copresence of characters on each page as interaction between the characters.\nNote that the copresence is the most common definition of interaction in constructing character networks in fictional works <cit.>.\nWe used copresence on a page rather than in a single panel within a page because it is common that characters appearing in different panels on the same page have some interactions (e.g., two characters talk to each other by using alternately occupying successive panels).\n\n\n\n\n §.§ Bipartite Configuration Model\n\nThe original data from which we construct the temporal and static character networks are equivalent to a temporal bipartite graph in which the two types of nodes are characters and pages, and an edge connects a character and a page in which the character appears.\nTo generate a randomized bipartite network, we choose a pair of edges in this bipartite graph uniformly at random, denoted by (c, p) and (c', p'), where c and c' are characters and p and p' are pages.\nIf c and c' are the same or p and p' are the same, we discard the pairs and redraw them. \nThen, we rewire the two original edges to (c, p') and (c', p). \nWe repeat this procedure 1,000 times excluding the discarded edge pairs to generate a randomized temporal bipartite network. \nWe construct a static randomized character network from the generated randomized bipartite graph by one-mode projection. \nIn other words, we connect two characters by an edge whose weight is the number of pages on which the two characters are copresent.\n\n\n\n\n §.§ SI Model\n\n\nWe use the SI model <cit.> to numerically investigate contagion.\nWe assume that just one character is initially infectious and that the other N-1 characters are initially susceptible. \nIf a susceptible character co-appears with an infectious character on a page, the susceptible character becomes infectious with probability β. \nDifferent infectious characters appearing on the same page independently attempt to infect each susceptible character on the page.\nOnce a character contracts infection, it stays infectious forever. \nWe run the SI dynamics with each of the N characters as the sole character that is initially infectious.\n\n\n\n §.§ Temporal Correlation Coefficient\n\nWe quantify the persistence of edges over time by the temporal correlation coefficient <cit.>. \nFirst, we calculate the topological overlap for node i at time t by\n\n    O_it = ∑_j=1^N A_ij^t A_ij^t+1/√(∑_j=1^N A_ij^t∑_j=1^N A_ij^t+1) ,\n\nwhere A_ij^t is the adjacency matrix of an unweighted network at time step t. \nIn other words, A_ij^t = 1 if characters i and j are copresent on page t, and A_ij^t = 0 otherwise.\nWe then define the average topological overlap for node i by\n\n    O_i = 1/T-1∑_t=1^T-1 O_it ,\n\nwhere T is the number of pages.\nThe temporal correlation coefficient for the entire temporal network is given by\n\n    O = 1/N∑_i=1^N O_i .\n\n\n\n\n\nWe thank Juyong Park for valuable discussion. K.S. thanks the financial support by the Japan Society for the Promotion of Science (under Grant No. 19K23531 and 22K14438). \nN.M. thanks the financial support by AFOSR European Office (under Grant No. FA9550-19-1-7024), the Japan Science and Technology Agency (JST) Moonshot R&D (under Grant No. JPMJMS2021), and the National Science Foundation (under Grant No. 2052720 and 2204936).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}