{"entry_id": "http://arxiv.org/abs/2303.07204v1", "published": "20230313153845", "title": "Direct Statistical Simulation using generalised cumulant expansions", "authors": ["G. V. Nivarti", "J. B. Marston", "S. M. Tobias"], "primary_category": "physics.flu-dyn", "categories": ["physics.flu-dyn", "physics.ao-ph"], "text": "\n\nSocial network analysis of Japanese manga: similarities to real-world social networks and trends over decades\n    Naoki Masuda\n    March 30, 2023\n=============================================================================================================\n\n\n\n\nIn recent years, the Generalised Quasilinear (GQL) approximation has been developed and its efficacy tested against purely quasilinear (QL) approximations <cit.>. GQL systematically interpolates between QL and fully non-linear dynamics by employing a generalised Reynolds decomposition for dynamics in one spatial direction. Here, we present an exact statistical closure for the GQL equations on the doubly periodic β-plane. Closure is achieved at second order using a generalised cumulant approach which we term GCE2. We demonstrate that the GCE2 equations systematically interpolate the statistics between those corresponding to CE2 and fully non-linear systems. GCE2 is shown to yield improved performance over statistical representations of purely QL dynamics (CE2). Hence, GCE2 enables Direct Statistical Simulation of complex mean flows that do not entirely fall within the remit of pure QL theory.\n\n \n\nDSS; QL; CE2; GQL.\n\n\n\n\n§ INTRODUCTION\n\n\n Fluid turbulence, where nonlinear interactions occur over a wide range of spatial and temporal scales, plays an important role in engineering, geophysical, astrophysical and even biological fluid mechanics. Much turbulence research focuses on the idealised case of homogeneous and isotropic turbulence, despite the canonical situation involving important inhomogeneities and anisotropies. For example, in geophysical and astrophysical situations rotation and stratification may play an important role in selecting preferred directions, whereas in other cases mean flows and boundaries often lead to both inhomogeneities and anisotropies. For these cases, it is important to develop a framework that builds in inhomogeneity and anisotropy from the outset and turns this “bug\" into a “feature”. Such a framework involves constructing equations for the evolution of the statistics of the turbulence; it is important to bear in mind that the presence of anisotropy and inhomogeneity often leads to non-trivial low-order statistics — for example, sustained mean flows that interact strongly with fluctuations. Methods designed for describing the evolution of such flows will perform badly for the homogeneous isotropic case, where mean flows are absent. For a description of the many methods that have been developed and the underlying philosophy of this approach see the review by <cit.>.\n\n In general these methods rely on developing equations governing the evolution of the low-order statistics for the flow (often termed the cumulants). Such an approach often requires a closure approximation, where the higher order statistics are either neglected completely or written as functions of the low-order cumulants. However, if the system exhibits quasilinear dynamics, then the system of low order statistical equations closes exactly <cit.> and no further approximations are needed; such a system of statistical equations is known as CE2 (representing a cumulant expansion at second order). Recent years has seen many systematic investigations of the validity of the quasilinear approximation (QL) in representing the full nonlinear dynamics <cit.>; it has been determined that there are certainly circumstances where the QL approximation breaks down and better approximations are needed. Recent research has focused on a generalisation of the quasilinear approximation (termed GQL) that has certain advantages in that it allows energy to be scattered among the turbulent eddies through interaction with the mean flow. This eddy-scattering often leads to a more faithful representation of the nonlinear dynamics than QL, where these interactions are forbidden. In this paper we derive the statistical representation of the GQL approximation (which we term GCE2) and describe the utility of this approach by comparing it with CE2 for two model fluid dynamics problems (one deterministic and one stochastic) describing the interaction of mean flows with turbulence in two dimensions.\n\n\n\n\n\n\n§ GENERALISED CUMULANT EXPANSIONS\n\n\n\n\n §.§ The Generalised Quasilinear (GQL) Approximation\n\n\nWe consider a system of non-linear dynamical equations for a state vector q(x,t)  written as\n\n\n    ∂_t q = ℒ[q] + 𝒩[q,q] ,\n\n\nwith ℒ [·] a linear and 𝒩[·,·] the non-linear (in this case, quadratic) operator. In order to apply the GQL approximation, the state vector q is expanded using a spectral basis along the zonal direction (more generally, the direction exhibiting statistical homogeneity). GQL then proceeds <cit.> by applying a low-pass filter (projection operator) with cutoff Λ in the zonal direction, leading to a generalised Reynolds decomposition of the state vector\n\n\n    q = q_ℓ  + q_h ,\n\n\nwhere the subscripts (ℓ) and (h) denote low and high zonal wavenumber modes, respectively. \nFor the two dimensional Cartesian models considered here\n\n\n    q_ℓ \n    =∑_k=-Λ^Λq_k(y)  e^i k x    \n    q_h = q - q_ℓ.\n\n\n\nThis decomposition obeys the usual rules of orthogonality and idempotence, and can be simplified to the conventional Reynolds decomposition (into mean and fluctuation) simply by setting Λ = 0. Note, however, that the conventional Reynolds decomposition obeys the equality qq = q q Note that we use the overline to indicate a mean computed as a spatial (zonal) average, but other averages are also possible including ensemble and time averages.). In comparison, (q_ℓq)_ℓ (q_ℓq_ℓ)_ℓ for Λ > 0 under the generalised Reynolds decomposition into low- and high-modes; this inequality is remedied after applying certain interaction rules as follows.\n\nApplying the decomposition <ref> to the q in <ref>, gives rise to various classes of non-linear terms that correspond to different triadic interactions involving low- and high- modes. The possible triad interactions can be represented using Feynman diagrams in which low-modes (zonal wavenumber |m| ≤Λ) and high-modes |m| > Λ are denoted using low-frequency and high-frequency wave edges <cit.>. GQL equations retain non-linear self-interactions give rise to low modes, as well as quasilinear interactions between low- and high-modes. Non-linear self-interactions giving rise to high-modes as well as interactions between low and high modes giving rise to low modes are dropped <cit.>. Such elimination of triad interactions (as for constrained triad decimation in pairs <cit.>) and therefore conserves quadratic invariants such as energy and enstrophy. The following GQL equations are obtained by applying these interaction rules \n\n\n    ∂_t q_ℓ    = ℒ[q_ℓ] + 𝒩_ℓ[q_ℓ,q_ℓ] + 𝒩_ℓ[q_h,q_h], \n    ∂_t q_h     = ℒ[q_h] + 𝒩_h[q_h,q_ℓ],\n\n\nfor the low- and high-modes. Here, by virtue of discarding the appropriate interactions, GQL recovers the conventional Reynolds equality so that (q_ℓq)_ℓ = (q_ℓq_ℓ)_ℓ. Furthermore,  when Λ = 0, we have q_ℓ = q and q_h = q^', and the GQL equations reduce to the well-known system of QL equations <cit.>. Similarly, setting Λ as the full spectral resolution in the zonal direction, we obtain q_ℓ = q and q_h = 0; the GQL equations are identical to the fully-nonlinear (NL) equations <ref> in this limit. Hence, the GQL equations interpolate systematically (though not monotonically) between QL and NL dynamics by varying the zonal spectral cutoff Λ. Crucially, the GQL equations lack high-mode non-linearities which makes GQL amenable to statistical closure as <ref> is formally linear in q_h. We shall make use of this property now.\n\n\n\n\n\n\n\n\n\n\n\n §.§ Deriving the Generalised Cumulant Expansion at Second Order (GCE2)\n\n\nStatistically-closed equations termed CE2 have been derived for quasilinear (QL) equations using cumulant expansions <cit.> and other methods <cit.>. A closure for QL equations is achieved at second order – the equations for the mean and fluctuation terms are used as a starting point for deriving the corresponding equations for the first two cumulants: q and q^'q^', respectively. This strategy allows for Direct Statistical Simulation (DSS) of low-order statistical quantities that correspond to QL dynamics. In a similar manner, statistical closure for GQL dynamics is also achievable at second order using generalised cumulant expansions which employ the notion of the mean implicit within the generalised Reynolds decomposition of <ref>. We thus define the first two generalised cumulants as \n\n\n    c_1    ≡q_ℓ, \n    \n        c_2    ≡ (q_h q_h)_ℓ,\n\n\nfollowing the spectral filter (projection operator) notation used earlier. Closed form equations for these generalised cumulants, termed GCE2, are obtained by following a similar approach to that adopted for deriving CE2 equations from QL equations <cit.>. The generalised first cumulant is identical to low modes (analogous to q in CE2). As a result, the equation governing the evolution of the generalised first cumulant c_1 is the same as that for the low modes q_ℓ as given by <ref>: \n\n    ∂_t c_1     = ℒ[c_1] + 𝒩_ℓ[c_1, c_1] + 𝒩_ℓ[c_2].\n\nThe generalised second cumulant is a field bilinear in high modes (akin to the Reynolds stress C = q^'q^' in CE2). The equation for c_2 = (q_h q_h)_ℓ is thus obtained by multiplying the high-mode equations <ref> with high-modes and subsequently projecting down to the low-modes as follows\n\n\n    ∂_t (q_h q_h)_ℓ    = ( {q_h ∂_t q_h} )_ℓ  = ({q_h ℒ[q_h]} )_ℓ + ({q_h 𝒩_h[q_h,q_ℓ]} )_ℓ,\n        \n    ∂_t c_2     = ℒ[c_2] + ({𝒩[c_2, c_1)]})_ℓ.\n\nwhere the curly braces {··} denote symmetrization, i.e. {a b} = a b + b a, and 𝒩_h = 𝒩[·, ·] - 𝒩_ℓ[·, ·] denotes the high-mode spectral projection of the non-linear operator 𝒩[·, ·]. Taken together, <ref> and <ref> form a closed set of equations in terms of generalised cumulants. This allows the implementation of Direct Statistical Simulation of GQL dynamics, i.e. solve directly for statistics that interpolate between QL and NL dynamics. We note however that a recent study has demonstrated that although one can mathematically arrive at the CE2 system starting from the QL equations, the two frameworks are not statistically equivalent <cit.>. This is because, as opposed to QL equations, the CE2 system can be initialised with an ensemble-averaged second cumulant and thereafter sustain solutions wherein the second cumulant has rank > 1. We note therefore that the GCE2 and GQL systems are not equivalent either. However, we emphasise that the ability of GCE2 to predict a generalised second cumulant with rank greater than unity ought to be considered as a feature not a bug, one that motivates further study.\n\nThis paper has two aims: 1) to test the predictions of GCE2 against those of GQL, thereby demonstrating that, even for a cutoff Λ = 1, GCE2 improves significantly over CE2, and 2) to probe observed divergences between GCE2 and GQL, relating them to the presence of rank instabilities as in the case of CE2 and QL <cit.>.\n\n\n\n\n§ NUMERICAL IMPLEMENTATION\n\nWe conduct simulations of a rotating, incompressible fluid on a doubly-periodic β-plane [0,2π]^2. The time evolution of the relative vorticity ζ≡z· (∇× u) is given by \n\n\n    ∂_t ζ = β∂_x ψ - κζ + ν∇^2 ζ + J[ψ,ζ] + F,\n\n\nwhere u is the velocity, J[ψ,ζ] = ∂_xψ∂_y ζ - ∂_x ζ∂_y ψ and the streamfunction ψ≡∇^-2ζ. Gradients of rotation are included via the β term, `bottom friction' via the κ term and viscosity via the ν term. The forcing term F models energy injection into the system. We adopt two different models of forcing (or driving) in this study: 1) a deterministic steady two-scale Kolmogorov-type forcing as used by <cit.> - see equation (<ref>), and 2) a white-in-time stochastic model of forcing adapted from <cit.> - see equation (<ref>). The latter is a commonly-used model that mimics thermal driving.\n\nThe spectral solver  (written in Julia <cit.> and made available online <cit.>) is used to obtain direct numerical solutions of equation (<ref>). Timestepping algorithms are imported from the well-tested ecosystem of the  <cit.> package. We use different timestepping methods to simulate flows with different types of driving models. For the deterministically-driven Kolmogorov flow, we use the explicit 5/4 Runge-Kutta method of Dormand-Prince with a fixed timestep of Δ t = 0.001. For the stochastically-driven flow, we use the SRIW1 method of order 1.5. To be consistent, we use the same timestepping algorithm to solve the dynamical equations (QL/GQL/NL) and the statistical equations (CE2/GCE2) for a given flow. Unless specified otherwise, the initial condition consists of random noise of mean power 10^-4. We employ resolutions of 10× 10 for the Kolmogorov flow system and 12× 20 for the stochastically-driven system. The solutions are therefore not extremely turbulent.\n\nWe have conducted a number of validation tests to ensure that the equations are implemented accurately in our code. Solutions for equations neglecting the dissipative terms have been tested to confirm conservation of energy and enstrophy is satisfied in such regimes. Additionally, the agreement of mean equilibrium solutions for a given energy input with dissipation has also been confirmed across the various equation systems. In the presence of non-linear terms, our tests confirm that setting the spectral cutoff Λ = 0 in GCE2 reproduces CE2 results and setting Λ = N reproduces the fully-nonlinear (NL) results. In addition to the forcing models outlined above, the aforementioned tests are also conducted for a determinstic driving model with relaxation to a point jet <cit.>; here, an additional validation test is available as the GCE2/CE2 as well as GQL/QL results converge to NL for small relaxation times. All these tests have been automated, such that the Github workflows server conducts them each time a code change is pushed to the online repository <cit.>.\n\nIn the following, we present results comparing GCE2 against GQL for a spectral cutoff Λ = 1. For each forcing model and specified set of parameters, we compare these results against predictions of the NL system as well as of the CE2 and QL equations. Note that, we use overlines to indicate spatial (zonal) averages (not ensemble or time averages) on QL solutions as in the comparisons against CE2. When time averages are used (such as to facilitate comparison of Hövmöller plots), we explicitly state this along with specifying the averaging window in the accompanying text.\n\n\n\n\n§ RESULTS\n\n\n\n\n\n §.§ Two-scale Kolmogorov forcing\n\n\n<Ref> shows the final time (t = 1000 days) resolved vorticity solution for a flow driven by a two-scale Kolmogorov forcing, i.e. we set F in <ref> to be\n\n\n    F(y) = -cos(y) -8cos(4y).\n\n\nand the parameters as ν = 0.02 and β = κ = 0 in <ref>. This system is known to lead to non-trivial dynamics <cit.>. \n\nThe NL solution (top panel in <ref>) consists of a strong band of positive vorticity centred at y = π surrounded by negative vortical regions, as was observed by <cit.>. The band of positive vorticity appears to be composed of a strong zonal mean and a sinusoidal zonal wave with wavenumber m = 1, the latter contributing to the varying width of the band as a function of x. As noted in <cit.>, this vorticity solution corresponds to a rightward flow on the upper half y> π of the domain and leftward flow in the lower half.\n\n\n\nThe QL solution (middle left panel in <ref>) captures the central positive vorticity band, albeit with an apparently weaker m = 1 harmonic resulting in a band of more uniform height and thickness. For presentation of results, we adopt zonal (spatial in x direction) averaging so that q denotes the zonal mean of quantity q. The zonal mean vorticity ζ predicted by CE2 (middle right) agrees reasonably well with QL dynamics both in magnitude and distribution. The localised negative vorticity regions predicted by QL (middle left panel) in the upper and lower half of the domain are averaged out in the CE2 prediction (middle right panel). The bottom panels in <ref> show the GQL (left) and the resolved GCE2 (right) solutions for a cutoff Λ = 1. These are in very close agreement with the fully-nonlinear solution, improving significantly over the QL/CE2 solutions. \n\n\n<Ref> contains Hövmöller plots of ζ(y,t) showing the evolution of the central band of vorticity with time for the five different equation systems. All solutions evolve from the same initially random noise field of power 10^-4. Time-averaging is conducted in the window 500 < t < 1000 days. Up until time-averaging begins, the QL, GQL and GCE2 systems exhibit noticeable fluctuations in jet location over a relatively small time-scale of t ∼ 10 days. Such fluctuations appear to be much less pronounced in the NL and CE2 systems, wherein the vorticity jet appears to stabilise at its location at around t = 250 days. The time-averaged solution of all five systems are in excellent qualitative agreement, with the possible exception of QL which appears to predict a slightly weaker jet (lighter red colour in the middle left panel).\n\n\n\n\n\nFocussing on subtle quantitative differences, we show time-averaged energy spectra for the various solutions in <ref>. Each panel plots ζ_m,n^*ζ_m,n/(m^2 + n^2) with zonal wavenumbers m running along the x-axis and non-zonal wavenumbers n along the y-axis. Evidently, all equation systems predict energy to be primarily concentrated in two pairs of conjugate modes, namely (m = 0, n = ± 1) and (m = ± 1, n = 0) (N.B. the mode (m = 0,n = 0) denotes the mean across the entire domain and has been set to contain no energy in our solutions). In the fully non-linear case (top panel),  the remaining energy is spread over spectrally-local modes within a relatively narrow band of zonal wavenumbers, with remaining zonal wavenumbers containing small but non-zero energy. In QL and CE2 (middle panels), this zonal spreading of energy is limited to |m| ≤ 2, with no energy in modes with larger zonal wavenumbers. On close inspection, minute differences between QL and CE2 can be observed. For instance, QL (middle left panel) contains slightly higher energy in the (m = ± 1, n = 0) harmonic pair (dark orange squares) and a slightly different energy distribution across the zonal mean modes (m = 0,n) as compared with CE2 (middle right panel).\n\nThe GQL and GCE2 solutions (bottom panels), however,  are in excellent agreement with each other. Moreover, they both clearly improve upon the QL/CE2 solution (middle panels) when compared with the NL solution (top panel). Both GQL and GCE2 exhibit similar spreading of energy around the four most energetic modes as seen in NL, albeit with slightly less energy in the outer bands of modes with |m| = 4,5. Crucially, the modes |m| > 5 contain a small amount of energy in a similar manner to NL, and as opposed to QL/CE2 where energy is completely absent in these modes. These results validate GCE2 as a statistical theory for GQL dynamics, with the ability to improve upon predictions of CE2.\n\n\n\n\n\nWe now proceed to make quantitative comparisons between the various solutions to elucidate on the qualitative differences observed above. We show the energy distribution over zonal wavenumbers m in the n = 0 slice of the time-averaged energy spectra in <ref> (left panel). NL (black line) contains energy in all non-trivial zonal wavenumbers m ∈ [1,9]. Moving away from the strongest wavenumber m = 1, energy tapers-off rapidly across the wavenumbers m ≤ 4 and more gently along the wavenumbers m ≥ 5. GQL (orange line) and GCE2 (orange dots) mimic this distribution of energy reasonably well; however, the m = 1 mode is slightly stronger and the wavenumbers m ≤ 4 have slightly lower energy in GQL/GCE2 than NL. Interestingly, minor departures of energy between GCE2 and GQL are apparent, particularly for m = 5,7. In comparison, QL (blue line) and CE2 (blue dots) contain most energy in two wavenumbers. Comparing these modes carefully, we note that QL contains significantly more energy in the m = 1 mode than does CE2, showing that QL and CE2 solutions also have disagreements.\n\nIn the right panel of <ref>, we plot the zonal mean vorticity as a function of the y-coordinate. The centreline vorticity (y = π) of the NL solution is quite well predicted by CE2, followed closely by GQL and GCE2. However, the QL solution departs conspicuously from the remaining predictions at the centreline. Differences between the solutions away from the centreline are relatively small, although, at y ∼ 3π/2, the NL solution is over-predicted by both solution pairs GQL/GCE2 and QL/CE2. Again, the QL and CE2 solutions exhibit significant departures from each other. Though we have noted here a difference between QL and CE2 solutions, no major departures are immediately evident between the GQL and GCE2 solutions . \n\n\n\n\n\nThe results above demonstrate that GQL/GCE2 improve upon the predictions of QL/CE2 when compared with the NL solution. Barring the minor differences, these results also validate the predictions of DSS (CE2 or GCE2) against the corresponding dynamical systems (QL or GQL, respectively). Now we focus our attention on investigating the origin of divergences between each solution pair QL/CE2 and GQL/GCE2. As mentioned earlier, <cit.> pointed out recently that divergences can and do arise between the QL and CE2 solutions despite the mathematical correspondence between them. Importantly, they linked such divergences to a rank instability available to the dynamics of the CE2 system and prohibited within the QL system. Divergences occur when the rank of a zonal submatrix C^(m) in the CE2 second cumulant departs from its initial unity value – the corresponding rank in QL must always remain unity, thus constituting an important source of differences. In order to compare GQL against GCE2, the zonal projection of the GCE2 field  can be employed.\n\n\n\n\n\n<Ref> simultaneously plots the time-evolution of two different quantities for 0 ≤ t ≤ 20 days. The left vertical axis quantifies the absolute difference in zonal energy |E(m)_CE2 - E(m)_QL| between CE2 and QL for a given zonal mode m plotted using blue lines. The right vertical axis quantifies the rank rank(C^(m)) of the cumulant submatrix C^(m). The top panel in <ref> compares the QL and CE2 solutions considering the zonal mode m = 1. As both systems evolve from an identical random noise initialisation, the difference |E(1)_CE2 - E(1)_QL| (blue line) is zero initially. The zonal energies begin to differ around t = 5 days showing an increasing magnitude of differences with time. Simultaneously with the emergence of differences, the rank of second cumulant submatrix C^(1) in CE2 (orange line) departs from unity, increasing nearly-monotonically until t = 20 days. This is a clear indication of the strong link between the onset of rank instability in CE2 and CE2's divergence from QL as also found by <cit.>. In a similar manner, the bottom panel in <ref> compares the same quantities for GQL and GCE2 with spectral cutoff Λ = 1 for the high mode m = 2. The zonal energy difference |E(2)_GCE2 - E(2)_GQL| (blue line) shows that the respective solutions begin to diverge even before t = 5 days. Again, this happens simultaneously with the departure of the corresponding submatrix C^(2) (orange line) rank from unity. In fact, in this case, we also observe that at times when the solutions have very similar energy (say at t ∼ 8 days), the rank also returns to unity. These results confirm that, akin to divergences observed previously for QL and CE2 <cit.>, predictions of GQL and GCE2 may also diverge from one another as a result of the onset of rank instabilities.\n\n\n\n\n\n\n\n\n §.§ Narrow-band stochastic forcing\n\nWe now consider a stochastically-driven system on the rotating β-plane. We adopt the formalism detailed in  <cit.> which was used for the validation of the Statistical State Dynamics (SSD) model. The forcing term F in the vorticity equation becomes\n\n\n    F(x,t) = ε Q (x) η(t),\n\n\nwhere η(t) is white-in-time Gaussian noise with zero mean and unit variance. Following <cit.>, the forcing spectrum Q(x) is specified in Fourier space as Q (k) = c(k_x)^2 d^2 e^-k_y^2d^2 over a band of zonal wavenumbers k_x ∈ [k_f, k_f + δ k). The constant d = 0.1 and  the normalising factor c(k_x) set such that the total contribution of Q(k) is unity for each zonal wavenumber <cit.>, and as a result the total energy injection rate of F(x,t) in <ref> is ε. Here, we have set k_f = 8 and δ k = 2 (two zonal wavenumbers 8, 9 are forced) on a 12×20 grid.\n\n<Ref> shows Hövmöller plots ζ(y,t) for a case corresponding to the equatorial β-plane (θ = 0^∘) with β = 10.0 and μ = 0.01. As is customary <cit.>, a hyperviscosity coefficient ν_4 is applied such that the largest wavenumber dissipates energy at unit rate. The energy injection rate (described above) via the forced zonal wavenumbers is ε = 0.02. The dynamical equations (NL,QL and GQL) are solved for 10000 days, whereas the statistical equations (CE2 and GCE2) need only be solved for a tenth of that time.\n\nThe NL solution (top row in <ref>) consists of two opposed jets of vorticity that migrate gently downwards beginning at t = 5000 days. The migration appears to occur at constant speed (fixed slope in t-y coordinates) as has been identified previously by <cit.>. The QL solution (middle left panel) predicts instead a relocation of the positive vorticity jet from the lower half of the domain to its centreline during the period 2500 < t < 7500 days. After this period, the jet stabilises to a steady position. No vertical movement is recorded in the CE2 solution (middle right panel), which merely captures the dual-jet solution with the sharp inter-jet boundary lying along y = 0 ∀ t ∈ [0,1000] so the migration is not captured by a QL theory, as also determined by <cit.>. The GQL and GCE2 solutions are shown in the bottom row. Whereas GQL (bottom left) appears to predict a mild degree of jet migration, GCE2 (bottom right) records the downward jet migration as observed in NL (top)! Note that the slope in GCE2 must be magnified ten times for an apples-to-apples comparison with that in NL due to the former's much shorter run. Here too then, GCE2 improves significantly over CE2 by capturing jet migration that CE2 can not.\n\n\n\nIn order to elucidate on the differences in jet behaviour recorded by GQL and GCE2, we conducted a series of GQL simulations with different random seed values used to generate the initial conditions. This resulted in an ensemble containing a wide range of jet behaviour, including jet migration and steady jet propagation. In the interest of brevity, we show in <ref> the results of a single GQL run (left) chosen from the ensemble that predicts upward jet movement with a speed of roughly 0.41m^∘ per day. We compared this with a GCE2 simulation (left) initialised with maximum ignorance, i.e. with a full-rank second cumulant initialised with power 10^-6. GCE2 records the identical upward jet migration with a speed of roughly 0.44m^∘ per day. Note that the x-axis ranges in both figures are significantly different, so the slopes do not appear identical visually. It is interesting that GCE2 with a maximum ignorance initial condition predicts upward jet migration rather than in the opposite direction as observed in GCE2 with a unity rank IC (see <ref>).\n\n\n\n\n\n\n\nIn <ref>, we show time-averaged energy spectra for the different solution methods for the stochastically-forced case shown in <ref>. The fully-nonlinear system (top panel) contains energy in the m = 1 zonal mode, primarily via the n = ± 1 non-zonal wavenumber (which corresponds to the opposed jet configuration). A significant portion of the energy is also present in the m = 1 and m = 2 zonal modes, the remaining being scattered through the entire range of zonal modes but a relatively narrow band of non-zonal modes. In comparison with NL, the QL and CE2 solutions (middle row) consist of localised bands of excited zonal modes. For instance, the m = 1 and m = 2 modes are relatively very weak in the QL and CE2 solutions; so also, the modes m = 6 or m ≥ 9 appear to be absent in comparison to NL. This localisation of energy arises because scattering is unavailable in QL (and therefore CE2) owing to the absence of the required non-linearities; a given zonal mode m becomes energetic in QL only via a corresponding instability of the mean flow. Once energetic, the zonal mode m can transfer its energy back to the mean via self-interactions, but may not transfer energy to another non-mean mode |m|  0. On closer examination, it is revealed that QL and CE2 exhibit differences. The differences between energy distribution over non-zonal wavenumbers in the m = 2 mode are immediately evident between QL (left panel) and CE2 (right panel). In other words, the CE2 solution obtained is not identical to that of a single realisation of QL. As in the Kolmogorov flow case, we hold that these divergences are linked to the rank instability in CE2.\n\nThe GQL and GCE2 solutions in <ref> (bottom row) improve considerably over the QL/CE2 solutions. The missing zonal modes m = 1,2,6, etc. are found to be energetic in GQL/GCE2. This is because non-linear interactions involving the m = 1 mode that are available within GQL (and thereby GCE2) allow for scattering of energy leading to a broader spread of energy over the range of zonal wavenumbers. It is remarkable though that GQL with a cutoff Λ = 1 appears to be in excellent agreement with NL (top panel). We note that GCE2 diverges from GQL to some extent in the same way CE2 was seen to diverge from the QL solution. Broadly speaking, energy appears to be less spread out in GCE2 as compared to GQL, being more concentrated to small non-zonal wavenumbers. For instance, energy in the m = 1 mode in GCE2 (bottom right panel) is limited to a significantly narrower range of non-zonal wavenumbers |n| ≲ 3. Additionally, the (± 1,0) modes are weaker in GCE2 by an order of magnitude.\n\n\n\n\n\n\nIn light of the divergences shown previously for Kolmogorov forcing, it would suffice here to show a departure in the rank of a second cumulant submatrix to explain the divergences seen above for the stochastically driven case. In <ref>, we show the final-time ranks of second cumulant submatrices. For CE2 (orange bars in the left panel), the zonal modes m = 8,9 are full-rank by virtue of the stochastic driving; however, we note that a number of additional zonal mode submatrices also depart in rank from unity as is held by the corresponding QL solution (blue bars in the left panel). Since there is no pathway of interactions that can transfer energy between the various non-mean zonal modes in QL (and CE2 by extension), each of the zonal modes with non-unity rank must have acquired its own rank instability. This contrasts with GCE2 (orange bars in the right panel) where all high zonal modes |m| > 1 for the spectral cuttoff Λ = 1 are full rank. In essence, scattering of energy allowed within the GQL/GCE2 formalism causes full rank of stochastically-driven modes to be transferred to all remaining zonal modes. We term this rank scattering. Thus we observe that communication matters: moving from CE2 to GCE2 changes significantly the channels of communication so that energy scattering and rank scattering can occur.\n\n\n\n\n§ CONCLUSIONS\n\n\n\nIn this paper we have tested a method of Direct Statistical Simulation (DSS) that is obtained as a mathematically exact closure for the Generalised Quasilinear (GQL) equations. This method of DSS, which we term GCE2, adopts generalised cumulant expansions and is capable of systematically interpolating between statistics corresponding to quasilinear and fully non-linear equations. We have implemented GCE2 in a numerical code for simulations on the β-plane with two driving models, deterministic and stochastic. Our simulations, which employ a minimal  spectral cutoff Λ = 1,  confirm that GCE2 improves considerably over CE2, the DSS method corresponding to quasilinear dynamics. We have also shown that statistics of GCE2 may depart from those of GQL due to the rank instability as found recently for QL and CE2 <cit.>.\n\nInterestingly, we also confirm the recent conclusions of <cit.> demonstrates that CE2 and QL solutions may diverge at identical parameters despite the fact that CE2 is an exact mathematical closure for QL. Such divergences (also observed by <cit.>) were linked to the emergence of instabilities, particularly the rank instability, that are available within the CE2 system but unavailable in QL. We have found that the GCE2 system is amenable to such instabilities too, and therefore its solutions can and do divergence from solutions of the GQL system. This is a feature rather than a bug. CE2 is a statistical description, whereas any single realisation of QL dynamics is a dynamical one. Hence GCE2 is a powerful method for self-consistently modelling the full dynamics of a range of spectral scales, coupled with the statistics of the quasilinear dynamics of the smaller spectral scales not captured directly by the full dynamics. \n\n\n\nWe acknowledge support of funding from the European Union Horizon 2020 research and innovation programme (grant agreement no. D5S-DLV-786780). JBM and SMT are supported in part by a grant from the Simons Foundation (Grant No. 662962, GF).\n\n\njfm\n\n"}