{"entry_id": "http://arxiv.org/abs/2303.07375v1", "published": "20230313180017", "title": "On the Tidal Capture of White Dwarfs by Intermediate-mass Black Holes in Dense Stellar Environments", "authors": ["Claire S. Ye", "Giacomo Fragione", "Rosalba Perna"], "primary_category": "astro-ph.HE", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "text": "\n\n\n\n0000-0001-9582-881X]Claire S. Ye\nCanadian Institute for Theoretical Astrophysics, University of Toronto, 60 St. George Street, Toronto, Ontario M5S 3H8, Canada\nClaire S. Ye\nclaireshiye@cita.utoronto.ca\n\n\n0000-0002-7330-027X]Giacomo Fragione\nDepartment of Physics & Astronomy, Northwestern University, Evanston, IL 60208, USA\nCenter for Interdisciplinary Exploration & Research in Astrophysics (CIERA), Northwestern University, Evanston, IL 60208, USA\n\n0000-0002-3635-5677]Rosalba Perna\nDepartment of Physics and Astronomy, Stony Brook University, Stony Brook, NY, 11794, USA\nCenter for Computational Astrophysics, Flatiron Institute, 162 5th Avenue, New York, NY 10010, USA\n\n\n\n\nIntermediate-mass black holes (IMBHs) are the missing link between stellar-mass and supermassive black holes, widely believed to reside in at least some dense star clusters, but not yet observed directly. Tidal disruptions of white dwarfs (WDs) are luminous only for black holes less massive than ∼ 10^5, therefore providing a unique smoking gun that could finally probe the existence of IMBHs beyond any reasonable doubt. Here, we investigate the tidal captures of WDs by IMBHs in dense star clusters, and estimate a typical rate of ∼ 1  Myr^-1 for galactic nuclei and ∼ 0.01  Myr^-1 for globular clusters. Following the capture, the WD inspirals onto the IMBH producing gravitational waves detectable out to ∼100 Mpc by LISA for ∼ 10^4 IMBHs. The subsequent tidal stripping/disruption of the WD can also release bright X-ray and gamma-ray emission with luminosities of at least ≳10^40 erg s^-1, detectable by Chandra, Swift, and upcoming telescopes, such as the Einstein Probe.\n\n\n\n\n\n\n§ INTRODUCTION\n \nIntermediate-mass black holes (IMBHs) are some of the most mysterious objects in the Universe. They are often introduced as the black holes (BHs) occupying the mass range between stellar-mass BHs (∼ 10 M_⊙) and supermassive black holes (SMBHs; 10^6-10^10 M_⊙). IMBHs may play a crucial role in cosmology and galaxy formation, as they could act as building blocks of SMBHs that are observed at the centers of most galaxies <cit.>. Understanding how IMBH masses are related to their environments (e.g., velocity dispersion) may also provide unique insights into the dynamical evolution of dense star clusters <cit.>. Furthermore, the inspirals of stellar compact remnants into an IMBH could provide an extraordinarily powerful tool for testing general relativity in the strong field regime <cit.>. Despite these rich physical applications, the existence of IMBHs has long been debated and very little is known about their origin and evolution. Only recently was their existence confirmed, when a 150 M_⊙ binary BH merger was detected by LIGO/Virgo <cit.>.\n\nIMBHs are most likely produced in dense stellar environments, such as globular clusters (GCs) and galactic nuclei. They could form through collisional runaways of massive stars <cit.> or through repeated mergers of stellar-mass BHs <cit.>. Here, IMBHs can also have frequent dynamical encounters with stars and compact objects. For example, during these interactions, it is very likely that the IMBHs will quickly form binaries with other compact objects through exchange encounters. The subsequent intermediate-mass inspirals of the stellar remnants into the IMBHs can produce gravitational wave (GW) sources detectable by LISA and ground-based telescopes such as the Einstein Telescope <cit.>. \n\nIMBHs are also uniquely suited at tidally disrupting white dwarfs (WDs). The tidal disruption radius of a WD is outside the event horizon of an IMBH; on the other hand, the tidal disruption radius of a WD is inside the event horizon of an SMBH, so no electromagnetic waves can be observed, and a stellar-mass BH will enter a WD instead of disrupting it during close encounters <cit.>. Since WD tidal disruptions are a smoking gun for revealing IMBHs, they have been under intense scrutiny <cit.>.\n\nDespite the wealth of studies on WD tidal disruptions, little attention has been devoted to computing the tidal capture rates of WDs, with the possible exception of <cit.>. In this study, we explore in detail the characteristics of IMBH-WD tidal interactions in both galactic nuclei and GCs. During close encounters, the tidal force exerted by an IMBH can induce oscillations within the WD, which can then lead to the formation of an IMBH-WD binary. This mechanism for capturing WDs is different from binary splitting according to the Hills mechanism which requires a binary or the scattering of WDs into the loss cone, and thus provides an additional channel for IMBH-WD binary formation <cit.>. These captured binaries are prime sources of low-frequency gravitational radiation during their inspiral and will provide key GW sources for future space detectors such as LISA <cit.>. Subsequent tidal stripping/disruption of the WD can be observed by ongoing and future time-domain surveys <cit.>. These multi-wavelength detections will provide definitive evidence for the existence of IMBHs. \n\nOur paper is organized as follows. In Section <ref>, we describe the analytical methods used to calculate the WD oscillation energy during close passages to the IMBHs. In Section <ref>, we discuss the WD tidal capture rates in different dense star clusters, while we show the potential multi-wavelength signals from gravitational radiation and WD stripping/disruption in Section <ref>. Lastly, we discuss the uncertainties and conclude in Section <ref>.\n\n\n\n§ TIDAL CAPTURES OF WHITE DWARFS\n \nIn this Section, we describe the methods used for estimating the tidal capture rates of WDs by an IMBH in galactic nuclei and GCs.\n\nThroughout this study, we fix the mass of the WDs to be 0.6 and adopt Eq. 91 in <cit.> for the radius of a WD. These low-mass WDs are well represented by an n=1.5 polytrope <cit.>. Following <cit.>, <cit.>, and <cit.>, we estimate the amount of oscillation energy deposited into a WD that is passing at a distance R_p from an IMBH as\n\n\n    Δ E_osc = GM_WD^2/R_WD(M_IMBH/M_WD)^2 ∑^∞_l=2(R_WD/R_p)^2l+2 T_l(η) ,\n\nwhere M_WD and R_WD are the mass and radius of the WD, respectively, T_l is a dimensionless function measuring the contributions from different harmonic modes l (we include the quadruple and octupole terms), and η is the duration of the periastron passage\n\n\n    η = (M_WD/M_WD+M_IMBH)^1/2(R_p/R_WD)^3/2 .\n\n\nThe maximum tidal capture radius, R_cap, is obtained when the total initial kinetic energy of the two interacting objects, E_orb=1/2μσ_v^2 (σ_v is the relative velocity of the IMBH and WD), equals Δ E_osc, assuming fast dissipation of the oscillation energy. \n\nThe effect of an IMBH's tidal force on a WD is stronger the closer the WD is to the IMBH as can be seen from Eq. <ref>. Figure <ref> shows the amount of orbital energy injected into a WD during the first passage of tidal interactions with IMBHs of different masses. For example, for a 10^3 IMBH and WD encounter where the pericenter distance is smaller than ∼ 30 R_WD, the energy deposited into the WD and subsequently dissipated through its oscillation exceeds the total initial kinetic energy assuming a velocity dispersion of 100 km s^-1. For lower velocity dispersions, e.g., in GCs where σ_v is ∼ 10 km s^-1, the minimum pericenter distance is larger, at ∼40R_WD. For all IMBH masses, the maximum capture radii in GCs are about 1.3 times larger than in galactic nuclei for the velocity dispersions considered in Figure <ref>.\n\n\n\nThe capture cross section can then be written as <cit.>\n\n    σ_cap = π R_cap^2(1+2GM_IMBH(1+q)/R_capσ_v^2),\n\nwhere σ_v is the local velocity dispersion and q = M_WD/M_IMBH. Thus, the rates of IMBH-WD tidal captures (per IMBH) can be estimated by the two-body collision rates\n\n    Γ = n σ_capσ_v ,\n\nwhere n is the local WD number density. The timescale for tidal capture is T_c = Γ^-1.\n\nAt the moment of tidal capture, the semi-major axis of the newly-formed IMBH-WD binary, a, can be calculated from its binding energy E_b\n\n    a = G M_IMBH M_WD/2 |E_b| ,\n and the eccentricity, e, can then be derived from R_cap = a(1-e). For E_b close to zero, the orbit will tend to be parabolic, and a and e will be close to infinity and unity, respectively. We can calculate the minimum possible a and e by assuming that the total initial energy, E_orb, is zero, and that E_b = Δ E_osc at the WD's tidal disruption radius. We define the tidal disruption radius of a WD to be <cit.>\n\n    R_t = (M_IMBH/M_WD)^1/3 R_WD .\n\nThe radius of a WD with M_WD=0.6 is about 0.013 R_⊙. For IMBHs with masses of 10^2, 10^3, and 10^4, the tidal disruption radius of a WD is 5.5 R_WD (3×10^-4 AU), 11.9 R_WD (7×10^-4 AU), and 25.5 R_WD (1.5×10^-3 AU), respectively. The minimum possible capture semi-major axis and eccentricity, [a, e], are then estimated to be [0.012 AU, 0.973], [0.12 AU, 0.994], and [1.24 AU, 0.999], respectively. Both the semi-major axis and eccentricity are larger for binaries captured at larger pericenter distances than the tidal disruption radii (Eq. <ref>). The maximum capture semi-major axes are about 160, 1641, and 16456 AU for IMBHs with masses of 10^2, 10^3, and 10^4, respectively, for captures at about 3R_t. At the same time, the eccentricities tend to be unity (see also Figure <ref> below).\n\n\n\n\n§ RATES\n \nIn this Section, we analyze the capture rates for IMBHs of masses 10^2, 10^3, and 10^4 in different dense stellar environments.\n\n\n\n §.§ Galactic Nucleus Environments\n\nHere, we consider various galactic nucleus environments hosting SMBHs with masses M_SMBH=10^5, 10^6, and 10^7. The radius of influence of an SMBH is defined as <cit.>\n\n    R_h = GM_SMBH/v_h^2 ,\n\nwhere v_h is the velocity dispersion at R_h. The velocity dispersion is a function of the galactocentric distance r, σ_v ∼ (G M_SMBH/r)^1/2. Following <cit.> for the `M-σ' relation, v_h can be expressed as a function of the mass of the SMBH\n\n    M_SMBH = γ v_h^4 ,\n\nand γ≈ 0.0758  (km s^-1)^-4 <cit.>. Combining Eq. <ref> and Eq. <ref>, we can write the radius of influence as \n\n    R_h = Gγ^1/2M_SMBH^1/2 .\n\n\nWe assume power-law number density distributions for the main-sequence stars and WDs surrounding the SMBHs <cit.>. The distribution function can be written as\n\n    n_WD = n_inf(r/R_h)^-α ,\n\nwhere\n\n    n_inf = 1.38×10^4 √(10^6 /M_SMBH)  pc^-3 .\n\nThe number density of main-sequence stars is 10 times larger following the same distribution.\n\nIn galactic nuclei, a massive binary will gradually inspiral through dynamical friction. Following <cit.>, and using the definition that the enclosed mass within R_h equals 2M_SMBH, we can write the dynamical friction time at a distance r as\n\n    T_df   = [1+(1+β)(r/R_h)^β/2][1+(r/R_h)^β]^0.5(r/R_h)^1.5/1.5χlogΛβ (r/R_h)^β\n       × Q T_h≈ 2.67 Myr (Q/1000)\n       ×[1+(1+β)(r/R_h)^β/2][1+(r/R_h)^β]^0.5(r/R_h)^1.5/χβ (r/R_h)^β ,\n\nwhere β = 3-α, log Λ∼ 5 is the Coulomb logarithm <cit.>, Q = M_SMBH/M_IMBH, the factor χ can be written as <cit.>\n\n    χ = erf(X)-2X/√(π)e^-X^2\n\nwith X = √(2-β) <cit.>, and T_h=R_h/v_h. The dynamical friction timescale at the radius of influence of a 4×10^6 SMBH is about 2000, 200, and 20 Myr for M_IMBH=10^2, 10^3 and 10^4, respectively. For these values, the power-law slope of the stellar distribution is assumed to be α = 1.4.\n\nFor shorter distances to the SMBHs, the inspiral of the massive binary is dominated by GW radiation instead, and the GW inspiral timescale is <cit.>\n\n    T_GW   = 5/256a_IMBH^4 c^5/G^3 M_IMBH^3 Q(1+Q) (1-e_IMBH^2)^7/2\n       ≈ 5.84×10^4 Gyr1/Q(1+Q)(a_IMBH/10^-4pc)^4(M_IMBH/10^3)^-3,\n\nwhere c is the speed of light, and a_IMBH and e_IMBH are the semi-major axis and eccentricity of the IMBH orbiting the SMBH, respectively. The inspiral timescale due to GW emission is about 10^7, 10^6, and 10^5 Myr for M_IMBH=10^2, 10^3, and 10^4, respectively, assuming the IMBHs are orbiting a 4×10^6 SMBH at 10^-3 times its radius of influence on a circular orbit.\n\nWe show in Figure <ref> the maximum tidal capture radius in galactic nuclei. The maximum capture radius increases as the distance to the center of galaxies increases or the mass of the central SMBH decreases, which causes the velocity dispersion to decrease. For very small galactocentric distances, the maximum tidal capture radii could be smaller than the tidal disruption radii. At these distances, no tidal capture binaries can form during close encounters between IMBHs and WDs, and the IMBHs will directly disrupt the WDs.\n\n\n\nIn addition, a WD can only be captured in the galactic nuclei before the IMBHs spiral into the central SMBHs. A successful capture depends on the dynamical friction (Eq. <ref>) and GW inspiral (Eq. <ref>) timescales of the IMBH, and needs to satisfy the condition T_c<min(T_𝑑𝑓, T_GW). We compare in Figure <ref> the typical timescale for an IMBH to capture or tidal disrupt a WD in galactic nuclei with the IMBH's dynamical friction and GW inspiral timescales. The capture/disruption timescale is the shortest for the most massive IMBH orbiting the least massive SMBH. For IMBHs with M_IMBH≳ 10^3, tidal capture of a WD is possible for relatively flat stellar number density slopes α≲ 1.4. Observations and theoretical studies have shown that the power-law slope of the stellar density distribution in the Milky Way nuclear star cluster is ∼ 1.4 <cit.>, and may be as low as ∼ 1 for main-sequence stars <cit.>. Thus our Milky Way center can potentially produce tidally captured IMBH-WD binaries. For distances closer to the central SMBH, the WD capture radius is smaller than the tidal disruption radius so a WD cannot be captured (left of the yellow line). In this region when T_c<min(𝑇_𝑑𝑓, 𝑇_𝐺𝑊), an IMBH will directly disrupt a WD during close encounters.\n\n\n\nThe capture and disruption rates as a function of the distance to the galactic center are shown in Figure <ref>. The maximum tidal capture rate in a galactic nucleus is ∼ 5 per Myr for an IMBH with M_IMBH=10^4 orbiting a 10^5 SMBH. For a more typical IMBH mass of 10^3 and an SMBH mass of 10^6, the tidal capture rate is ∼ 0.02 per Myr. The tidal disruption rate in this case is ∼ 0.1 per Myr.\n\n\n\n\n\n §.§ Globular Cluster Environments\n\nWe assume that GCs can be modeled\nwith a Plummer density profile <cit.>\n\n    ρ(r) = 3M_cl/4π b^3(1+r^2/b^2)^-5/2,\n\nwhere M_cl is the total mass of the cluster and b is the Plummer scale length. The half-mass radius of a Plummer sphere is r_hm≈ 1.3b. We adopt a Kroupa initial mass function <cit.> between masses 0.08 and 180 and follow an initial-to-final mass relation from <cit.>. At the present day, about 17% of the objects are WDs and we assume that the spatial distribution of the WDs follows the Plummer profile.\n\nThe velocity dispersion of a Plummer sphere is \n\n    σ_p^2(r) = G M_cl/6√(r^2+b^2).\n\n\nHere, we assume that the IMBHs reside at the cluster centers. This is a reasonable assumption given that IMBHs are most likely formed from collisional runaways of stars <cit.> or repeated mergers of stellar-mass BHs <cit.>, which occur at around the centers of GCs. Besides, a massive IMBH would quickly mass segregate back to the cluster center in ∼Myr timescale if it is displaced by dynamical encounters. The least massive IMBHs may be more easily displaced or even ejected from their host clusters <cit.>, but for this first rate estimate we ignore these effects.\n\nSimilar to the galactic nuclei case in the above Section, the maximum tidal capture radius increases as the distance to the center of GCs increases or the total mass of GCs decreases, as is shown in Figure <ref> (the increase is slow here). However, the maximum tidal capture radii in this case are always larger than the tidal disruption radii because the velocity dispersion in GCs is much smaller than in galactic nuclei. The tidal capture radius is about 3R_t for all IMBH masses.\n\n\n\n\n\nThe capture rates as a function of the distance to the GC centers are shown in Figure <ref>. For a typical GC with M_cl = 2×10^5 and hosting a 10^3 IMBH at the center, the maximum tidal capture rate is ∼ 0.002 per Myr. The tidal capture rates shown in Figure <ref> are also consistent with the rates calculated by <cit.>. For a Milky Way-like galaxy hosting ∼ 200 GCs, if we assume that all clusters have an IMBH, the optimistic tidal capture rate is a few times 0.1 per Myr per galaxy, roughly comparable to the tidal capture rate from one IMBH in a galactic nucleus. These rates in GCs and galactic nuclei are within the ranges of the predicted rates of ultra-long gamma-ray bursts <cit.>, which have been suggested to be associated with WD tidal disruptions by IMBHs <cit.>. See Section <ref> for more details.\n\n\n\n\n\n\n§ OBSERVATIONAL SIGNATURES\n\nWe discuss here the multi-messenger observational signatures of these IMBH-WD interactions and the detectors that are sensitive to these signals.\n\n\n\n §.§ Gravitational Wave Emission\n\nAfter an IMBH-WD binary is formed, the two objects inspiral via the emission of GW radiation, and the emission will be observable by LISA. To estimate the amount of energy radiated by the binary, we compute the evolution of its semi-major axis and eccentricity by integrating Eq. 5.8 from <cit.> and stop the evolution when the pericenter distance R_p = R_t.\n\nFor eccentric binaries, the frequency at peak GW emission is given by <cit.>\n\n    f_peak = √(G(M_IMBH+M_WD))/π(1+e)^1.1954/[a(1-e^2)]^1.5.\n\nThe characteristic strain at the nth harmonic can be calculated as <cit.>\n\n    h_c,n^2=1/(π D)^2(2G/c^3Ė_n/ḟ_n),\n\nwhere D is the luminosity distance to the source, ḟ_n is the time derivative of the GW frequency of the nth harmonic at the rest frame, and Ė_n is the GW power radiated at f_n. The frequency at the nth harmonic is given by the orbital frequency of the binary f_n=nf_orb, and f_orb = √(GM_tot/a^3)/2π where M_tot is the total mass of the binary. The radiated power Ė_n can be written as <cit.>\n\n    Ė_n = 32/5G^7/3/c^5(2π f_orbℳ_c)^10/3g(n,e),\n\nwhere ℳ_c is the chirp mass at the rest frame and ℳ_c = (M_IMBHM_WD)^3/5/M_tot^1/5. The time derivative of the frequency is computed to be\n\n    ḟ_n = n96/10π(Gℳ_c)^5/3/c^5(2π f_orb)^11/3F(e).\n\n\nKnowing the characteristic strains and the GW frequencies, we can calculate the signal-to-noise ratio S/N for eccentric binaries by summing over the relevant harmonics\n\n    (S/N)^2 = ∑_n=1^∞∫_f_n^f^'_n[h_c,n/h_f]^2 d f_n/f_n,\n\nwhere h_f is the LISA noise curve from <cit.>, and f_n^' is the GW frequency of the nth harmonic at the end of the LISA observation time. We truncate the calculation at the maximum harmonic <cit.>\n\n    n_max = 5(1+e)^0.5/(1-e)^1.5,\n which is about 7053 for e=0.99. Here we did not consider the orbital decay from tidal effects because <cit.> showed that they are negligible compared to GW radiation. The characteristic strains for binaries at 10 kpc in comparison to the LISA sensitivity curve are shown as an example in Figure <ref>. Note that the characteristic strains are only accurate up to when tidal stripping starts since we assume no mass loss during the inspiral (; see Section <ref> for more details).\nThe evolutionary time span of these strains (assuming inspiral stops at the tidal disruption radius) are about 390, 1830, and 8440 years for M_IMBH=10^4, 10^3, and 10^2, respectively. Combining the duration of the GW signals with the capture rates in Figure <ref> and <ref>, we can expect ∼10^-4-10^-3 events per Milky Way-like galaxy.\n\n\n\nFor S/N>2, the GW signals can be detected out to about 73, 15, and 3 Mpc for M_IMBH=10^4, 10^3, and 10^2, respectively. If we require that S/N>10, the maximum detectable distances are 14, 3, and 1 Mpc instead for the same three IMBH masses. These values are consistent with <cit.> which showed that the GW emission with S/N>30 can be detected out to ≈ 200 Mpc for BHs with masses in the range of ≈10^4-10^5, WDs with masses in the range of ≈0.5-1, and circular orbits at tidal disruption or the innermost stable orbit.\n\n\n\n §.§ Electromagnetic Counterparts\n\n\nAs discussed above and illustrated in Fig. <ref>, tidal capture dominates in GCs and at relatively larger distances in galactic nuclei, while in the innermost regions of the latter WDs are tidally disrupted more efficiently. The associated electromagnetic counterparts are expected to be qualitatively and quantitatively different in the two situations, and hence we discuss them separately below.\n\n\n\n  §.§.§ Prompt Tidal Disruption (near parabolic orbit)\n\nPrompt tidal disruption of a WD by an IMBH will occur if the WD passes sufficiently close to the IMBH such that the pericenter R_p of its orbit becomes smaller than the tidal disruption radius defined in Eq. <ref>. The strength of the encounter is measured by the penetration factor\n\n\n    β≡R_t/R_p\n    =(R_p/R_WD)^-1(M_ IMBH/M_WD)^1/3 .\n\n\nThe outcome of the encounter will depend on the value of β <cit.>. Let us first consider the more typical case of β≳ 1, which has been well studied in the limit in which the debris have a uniform spread in energy between a minimum value (the most bound debris) and a maximum (unbound) \n<cit.>. Under these conditions, about half of the debris from the tidal disruption remains bound to the IMBH and falls back, while the other half is unbound. Accretion of the bound debris onto the IMBH begins on a timescale determined by the fallback of the most bound debris\n\n\n    t_ fb   ≈ 2π(\n    R_WD^3 M_ IMBH/G M_WD^2)^1/2≈ 10^3  s\n       ×   (M_ IMBH/10^3 M_⊙)^1/2(M_WD/0.6 M_⊙)^-1(R_WD/10^4  km)^3/2.\n\n \nAfter an initial rapid rise, the late-time fallback rate (on timescales >> t_ fb) of the tidally disrupted bound debris is expected to follow a power-law decay as\n\n\n    Ṁ_ fb (t) ≈Ṁ_ fb (t_ fb) (t/t_ fb)^-5/3 ,\n\n\nwhere the peak rate Ṁ_ fb (t_ fb) is on the order of \n\n\n    Ṁ_ fb    (t_ fb) ≈M_WD/3t_ fb≈ 2× 10^-4  M_⊙  s^-1\n       ×   (M_ IMBH/10^3 M_⊙)^-1/2(M_WD/0.6 M_⊙)^2(R_WD/10^4  km)^-3/2.\n\n\nThe precise fate of the fallback material can only be determined via numerical simulations. Whether the fallback material is able to circularize depends on its ability to lose a significant amount of energy. Hydrodynamic simulations by <cit.> show that WD-BH TDEs result in a variety of outcomes depending on the WD/BH masses and pericenter of the orbit. They find a subset of cases where self-interception of the stream occurs, favoring circularization of the debris and the onset of super-Eddington accretion rates. Strong outflows and relativistic jets are likely to ensue in these situations. The accretion rate onto the BH (and hence the emitted power) tracks the fallback rate as long as the viscous timescale of the disk is shorter than the fallback time. Assuming that a jet can be launched with efficiency ϵ_j and that a fraction ϵ_γ of the jet energy is dissipated into high energy radiation, then transients with luminosities ∼ (10^46-10^47)(ϵ_j/0.1)(ϵ_γ/0.1) erg s^-1 can be expected.\n\nWhen the WD approaches the IMBH with a large penetration factor, it can be severely compressed to an extent that explosive nuclear burning can be ignited <cit.>. During the period of compression, elements up to the iron group can be synthesized, which are then injected into the outflow with the explosion. The explosive transient would observationally manifest as a peculiar, underluminous thermonuclear explosion <cit.>. At the same time, a sizable fraction of the debris (∼ 35%, ) would still remain bound and accrete to the BH, possibly after circularization onto a disk.\n\nThere have already been several unusual transients for which the tidal disruption of a WD by an IMBH provides a compelling explanation. <cit.> suggested this progenitor model for Swift J1644+57 <cit.>, a bright X-ray source (peak isotropic luminosity ∼ 4 × 10^48 erg s^-1) which, after a steady period of about 700 s, underwent several flaring events separated by longer timescales. These were interpreted as the result of repeated close passages and hence stripping. <cit.> suggested that the unsual pair of the gamma-ray burst GRB060218 and the accompanying supernova SN2006aj may be the result of a WD which is tidally disrupted by a BH of ∼ 10^4 M_⊙. The unusually long GRB, of about 2600 s duration and equivalent isotropic luminosity ∼  10^47 erg s^-1 <cit.>, is compatible with the typical accretion timescale expected in these events, while the unusual supernova, the fastest of all the ones associated with GRBs, could have been the result of tidal pinching and ignition of the WD. More generally, tidal disruption of a WD by an IMBH is considered a good alternative model (to massive star collapse) for the subset of ultra-long GRBs <cit.>.\n\nAmong transients of different nature, <cit.> suggested that the tidal disruption of a WD by an IMBH is responsible for producing the two fast X-ray transients, CDF-S XT1 <cit.> and XT2 (, with a peak luminosity ∼ 3× 10^45 erg s^-1), characterized by an X-ray initial plateau lasting around hundreds to thousands of seconds, followed by a rapid decay in the light curve. Most recently, <cit.> has shown that SN 2020lrt may be a candidate for a WD being tidally compressed and disrupted by an IMBH. \n\n\n\n\n  §.§.§ Tidal Stripping after Tidal Capture (eccentric orbit)\n \n \n\nOnce the WD has been captured by the IMBH, the orbit of the newly formed IMBH-WD binary will begin to shrink due to GW emission, as discussed in Section <ref>.\n\nMass loss in interacting binaries with eccentric orbits was studied by <cit.>. They showed that stripping of the outer layers of the WD begins when the pericenter of the orbit becomes small enough that the radius of the WD exceeds its Roche lobe, that is\n\n    R_WD≳ R_ lobe≈γ R_p (M_ IMBH/M_WD)^-1/3 ,\n\nwhere the parameter γ in the expression for the  Roche lobe depends on the orbital eccentricity, the mass ratio of the two objects in the binary, and the rotation of the WD. An average value is taken to be γ≈ 0.5. As the WD makes repeated passages through the pericenter of its orbit, mass gets stripped. This process was first studied semi-analytically by <cit.>, and subsequently, with increasing degree of sophistication, by <cit.>, <cit.> and <cit.>. The qualitative features of the phenomenon are similar in all these works, while quantitative details vary depending on the various approximations made. Here, we will follow the more recent <cit.>, who compared their analytical formalism against hydrodynamic simulations. For a penetration factor β≲ 0.7, they found that the fraction of mass lost, Δ M/M_WD, at each pericenter passage can be well approximated (when compared to numerical results) by the expression\n\n    Δ M/M_WD≃ 4.8 [1-(M_WD/M_ Ch)^4/3]^3/4(1-γ/β)^5/2 ,\n\nwhere M_ Ch=1.4 M_⊙ is the Chandrasekhar mass. The stripped debris is found to remain bound to the IMBH for eccentricities below a critical value\n\n    e_ crit≲ 1 -   0.078 ξ β M_ IMBH^-1/3(M_WD/0.6 M_⊙)^1/3 ,\n\nwhere the parameter ξ quantifies the uncertain tidal effects. From numerical simulations, they found e_ crit∼ 0.8-0.9 for a WD of 0.67 M_⊙, and  e_ crit∼ 0.7-0.8 for a WD of 1.07 M_⊙. \n\n\n\nFig. <ref> shows the distribution of eccentricities \nat capture (upper panel and solid lines), as well as at the moment that tidal stripping begins[Note that, if at the time that mass stripping starts the WD is rather found in a circular orbit, then the following evolution is characterized by stable mass transfer which, depending on the conditions, may lead to the WD to recede from the IMBH while filling its Roche lobe <cit.>.] (bottom panel – note that the condition in Eq. <ref> with γ≈ 0.5 is equivalent to R_p≲ 2R_t). While the eccentricity is close to one at capture, for systems that are captured with R_p> 2R_t, the eccentricity drops quickly by the time mass loss begins. Except for the narrow range of capture parameters [2R_p/R_t-2.2 R_p/R_t], the eccentricity is below the critical value in Eq. <ref>, and hence the stripped mass is expected to remain fully bound.\n\nOnce mass loss has begun, the  subsequent mass loss rate undergoes two phases. At early times, the mass loss follows the orbital shrinkage driven by the emission of GW radiation. Later, as the smaller WD expands and becomes less dense, it becomes easier to disrupt after each passage, until the WD is completely disrupted after a time t_ ML. <cit.> showed that this timescale is generally smaller than the GW timescale by a factor\n\n    t_ ML/t_ GW≃ 0.02\n    (M_ IMBH/10^4 M_⊙)^4/15(M_WD/0.6 M_⊙)^16/15(1-e_0/0.1)^-1 ,\n\nwhere e_0 is the eccentricity at the beginning of the mass loss.\n\nAt the same time, mass loss will proceed with modulation on the binary period and increasing amplitude as the WD gets increasingly more stripped <cit.>. The fallback rate of the tidally disrupted debris is also expected to display such a modulation, as long as the accretion timescale is smaller than the orbital period P. The calculations by <cit.> showed that a good approximation to the results of their numerical simulations for the ratio between these two timescales is\n\n    t_ fb/P≃[\n    1 + 2ξβ/1-e(\n    M_ IMBH/M_WD)^-1/3]^-3/2.\n\nFor the range of parameters β (0.55-0.7), orbital parameters (0.7≤ e ≤ 0.9 ), and WD masses (0.67 and 1.67 M_⊙) explored in their simulations, they found the above timescale ratio to be ∼ 0.2-0.5.\nThe average fallback rate over an orbital period can be estimated as Ṁ_ fb∼Δ M/P (since, as discussed above, the greatest majority of our systems is found to be in a regime where all the stripped mass remains bound). For typical orbital parameters, its peak magnitude is found to exceed the Eddington value by several orders of magnitude, that is Ṁ_ fb∼ 10^-5-10^-3M_⊙ s^-1 <cit.>. The modulation of the accretion rate onto the IMBH will further depend on the accretion (viscous) timescale if disk circularization occurs. The ratio between the accretion timescale and the orbital period can be estimated as (e.g. )\n\n    t_ acc/P≃ 0.2\n    (1-e/0.03)^3/2(α/0.1)^-1(H/R/0.5)^-2 ,\n\nin a viscously accreting ring of scale height H\nwith viscosity parameter α <cit.>. Given the range of α∼ 0.01-0.1, these timescales can be comparable.  Modulation in the accretion rate onto the IMBH will still be expected even when partially smoothed out by viscosity.\n\nDetailed predictions of the luminosity and its spectrum during the periodic mass loss phase are still lacking, since they depend heavily on whether an outflow and/or a jet can be driven. If the electromagnetic emission is the direct result of accretion onto the IMBH, then it will be Eddington-limited, and hence, for the IMBH masses considered here, luminosities would be limited to the 10^40-10^42 erg s^-1 range. However, considering that the accretion rates are highly super-Eddington, it is plausible that outflows and jets could be driven, in analogy to the standard TDE case discussed in the previous subsection. If a fraction ϵ (=ϵ_jϵ_γ) of accreted mass is converted to luminosity, the peak fallback rates reported above would lead to an emission L=ϵṀ_̇ ̇ḟḃ c^2 ∼ \n(ϵ/0.01) (10^45-10^47) erg s^-1. The luminosity would be variable on the binary period and last for a timescale ∼ t_ ML[Note that this timescale does not account for the modifications to the WD structure where the outer layer of the WD is expected to heat up and ignite before the point of disruption due to tidal heating  <cit.>.].\n\nTidal stripping of a WD by an IMBH in a binary has already been invoked to explain some unusual, rare transients. <cit.> suggested this progenitor system as \npotential progenitor candidate of the ultraluminous X-ray flares, with rapid rise (∼ minute) and decay (∼ hour) and peak luminosities ∼ 10^40-10^41 erg s^-1, that are observed in GCs and elliptical galaxies (; see also  for modeling of these sources). Similarly, <cit.> proposed the WD tidal stripping model to explain the quasi-periodic ultrasoft X-ray eruptions (with durations of 10^3-10^4 sec, periods of about 9 hours, and peak luminosity ∼ 5× 10^42 erg s^-1) observed from the galaxy GSN 069 <cit.>. Sources of this brightness have been resolved by the Chandra telescope up to redshifts ∼ 4 <cit.>, and will be detectable up to ≳ 300 Mpc with a short ∼ 10 s exposure time by the Follow-up X-ray Telescope (FXT) of the upcoming mission Einstein Probe <cit.>.\n\n\n\n\n§ CONCLUSIONS AND DISCUSSION\n \nIn this study, we estimated the rates of WDs tidally captured by IMBHs in dense stellar environments. We assumed that a typical WD behaves as an n=1.5 polytrope and computed the capture radii based on the energy dissipated through WD oscillations during the first passage of the IMBH-WD encounter. We computed the capture rates for IMBHs with various masses in two environments, galactic nuclei and GCs. For the galactic nuclei, we adopted power-law distributions of stars and WDs around the central SMBHs, and studied how different SMBH masses and slopes of the stellar distribution affect the capture rates. We adopted Plummer profiles with different masses and half-mass radii in the case of GCs. Using these analytical models, we demonstrated that for a Milky Way-like galactic nucleus, the capture rate is ∼ 0.02 per Myr for an IMBH of 10^3. Meanwhile, the capture rate is about a few times 0.1 per Myr in a Milky Way-like galaxy if we assume that all GCs contain an IMBH. \n\nThese captured IMBH-WD binaries are sources of intermediate-mass ratio inspirals and radiate GWs in the LISA frequency band. We calculated the characteristic strains and S/N for inspiralling eccentric IMBH-WD binaries and showed that their GW signals may be detected out to ∼100 Mpc by LISA. Following the phase of GW radiation which shrinks the orbits of the IMBH-WD binaries, tidal stripping and disruption of the WDs by the IMBHs will take effect. The luminosity of the electromagnetic emission during the periodic mass loss is at least ≳ 10^40-10^42 erg s^-1 (depending on the IMBH mass, if Eddington-limited). If aided by the launch of an outflow or jet, the luminosity may reach ∼ 10^45-10^47 erg s^-1, comparable to that of standard TDEs <cit.>.\n\nThe capture and disruption rates and gravitational S/N estimated here should be taken as upper limits. We assumed that energy deposited into the WDs is efficiently dissipated, and the structure of the WDs stays unchanged during capture and inspiral. This essentially neglects any build-up of oscillation energy in the WDs and the possibility of WD disruption, allowing for all WDs that approach close to an IMBH to be captured into a lasting binary. We also did not consider WD spins which could play an important role in the orbital evolution of the binaries <cit.>. These are reasonable assumptions for the first-order rate approximation here. A more detailed understanding of the WDs' reaction to the strong tidal force will require numerical calculations. For the computation of the GW emission, we followed the WD till its pericenter reaches the tidal radius of the IMBH. However, both the magnitude of the signal and its duration  should be considered as upper limits since tidal stripping reduces the WD mass and shortens the inspiral time. In addition, the IMBH occupation fraction and the mass distribution in galactic nuclei and in GCs are uncertain. Larger occupation fractions and flatter mass distributions will lead to higher tidal capture rates and vice versa. Future (non-)detection of IMBH-WD inspirals and electromagnetic emissions would be able to shed more light on the existence of IMBHs and potentially supply data for probing this wide range of physics. \n\n\n\nWe thank Fred Rasio and Kyle Kremer for helpful discussions. This work was supported by NSF Grants AST-1716762, AST-2108624 at Northwestern University, and by the Natural Sciences and Engineering Research Council of Canada (NSERC) DIS-2022-568580. G.F. acknowledges support from NASA Grant 80NSSC21K1722. \nR.P. acknowledges support by NSF award AST-2006839.\nThis research was supported in part through the computational resources and staff contributions provided for the Quest high performance computing facility at Northwestern University, which is jointly supported by the Office of the Provost, the Office for Research, and Northwestern University Information Technology.\n\n\n\n\n\n\naasjournal\n\n"}