{"entry_id": "http://arxiv.org/abs/2303.07188v1", "published": "20230313152933", "title": "Horospherical dynamics in invariant subvarieties", "authors": ["John Smillie", "Peter Smillie", "Barak Weiss", "Florent Ygouf"], "primary_category": "math.DS", "categories": ["math.DS"], "text": "\n\nTransverse single-spin asymmetry of midrapidity π^0 and η\nmesons in p+Au and p+Al collisions at √(s__NN)= 200 GeV\n    L. Zou\n    March 30, 2023\n=================================================================================================================\n\n\nWe consider the horospherical foliation on any invariant subvariety in the moduli space of translation surfaces. This foliation can be described dynamically as the strong unstable foliation for the geodesic flow on the invariant subvariety, and geometrically, it is induced by the canonical splitting of -valued cohomology into its real and imaginary parts. We define a natural volume form on the leaves of this foliation, and define horospherical measures as those measures whose conditional measures on leaves are given by the volume form. We show that the natural measures on invariant subvarieties, and in particular, the Masur-Veech measures on strata, are horospherical. We show that these measures are the unique horospherical measures giving zero mass to the set of surfaces with no  horizontal saddle connections, extending work of Lindenstrauss-Mirzakhani \nand Hamenstädt \n\nfor principal strata. We describe all the leaf closures for the horospherical foliation.\n\n\n\n\n§ INTRODUCTION\n\n\nIt is an interesting fact that geometric questions about rational polygonal billiards can be addressed by studying the dynamics on moduli spaces of translation surfaces. This is one of many reasons  to study the dynamics on moduli spaces of translation surfaces — see \n the surveys  <cit.> for other motivations and a survey of results. We remind the reader that this moduli space is partitioned into strata, which correspond to translation surfaces of a fixed topological type. The group G acts on each stratum.\n\nThe horocycle flow is given by \n\n    U {u_s  : s ∈}⊂ G,    where u_s\n     (  1     s \n      0     1 ).\n\nThe analogy between dynamics on strata and homogeneous dynamics has been fruitful. In the setting of homogeneous dynamics U-actions and G-actions were analyzed in work of Ratner which showed that orbit closures and ergodic invariant probability measures are surprisingly well-behaved. The dynamics of G-actions (and moreover the dynamics of its subgroup P of upper triangular matrices) on strata were analyzed in  two papers <cit.> where it was shown that orbit closures and ergodic invariant measures have nice  descriptions (see Section <ref> for a precise statement). \n\n\nThe G-orbit closures\nare endowed with a wealth of geometrical structures, among which is the horospherical foliation which plays the role of the strong unstable manifold foliation for the one parameter diagonal subgroup which is called the geodesic flow (see <ref>). In <ref> we will define horospherical measures. Loosely speaking, the horospherical leaves are endowed with affine structures and the horospherical measures are those for which the conditional measures on theses leaves are translation invariant with respect to these affine structures.  \n\n\n\n\n\n §.§ Statement of results\n\nAll measures considered in this paper are Borel regular Radon measures on strata of translation surfaces. Any G-orbit closure ^(1)⊂^(1) supports a unique ergodic G-invariant finite smooth measure; we will refer to this  measure as the special flat measure on ^(1). The following are the main results of this paper. \n\n\nThe special flat measure on any G-orbit closure is horospherical. \n\n\nWe will say that a measure μ is saddle connection free if μ-a.e. surface has no horizontal saddle connections.\n\n Up to scaling, the only saddle connection free horospherical measure on a G-orbit closure is the special flat measure. \n\n\nWe emphasize that horospherical measures are a a priori not assumed to be finite. It is thus a consequence of Theorem <ref> that horospherical measures are finite under the saddle connection free assumption; it seems likely, but we were not able to prove, that all horospherical ergodic measures are finite. Theorem <ref> was announced without proof in <cit.>.  The saddle connection free assumption cannot be removed; for example, the length measure on a periodic horocycle trajectory in a closed G-orbit. In <ref> we will give more interesting examples of invariant subvarieties and horospherical measures on them, which are not the special flat measure. We will also classify (see <ref>) all the horospherical measures on the simplest nontrivial invariant subvarieties, namely the eigenform loci in (1,1). \n\n\nIf a surface has a horizontal cylinder then so does any surface on its horospherical leaf. We will say that a leaf of the horospherical foliation is cylinder-free if all surfaces on the leaf have no horizontal cylinders. We say that a measure  μ  on  is cylinder-free if μ-a.e. surface has no horizontal cylinders. In <ref> we give examples of horospherical measures which are not special flat  and for which almost every point has a horizontal saddle connection. For these measures it is also the case that almost every point has a cylinder. \n\n\n\nIt seems likely that\nthis is always the case; or in other words, that in Theorem <ref> the condition `saddle connection free' can be\nweakened to `cylinder-free'. \nThe analogous assertion about orbit closures is true:\n\nAny cylinder-free leaf for the horospherical foliation is dense. \n\n\nThe proof of Theorem <ref> uses a statement of independent interest (Theorem <ref>), about extending horizontal saddle connections while staying inside  invariant suborbifolds. This result was explained to us by Paul Apisa and Alex Wright, and its proof is given in Appendix <ref>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe geodesic flow is the restriction of the G-action to the subgroup\n\n    A {g_t : t ∈}⊂ G,    where  g_t  ( e^t     0 \n     0    \n          e^-t).\n\n\nFrom a dynamical perspective, the horospherical foliation is the strong unstable foliation for the geodesic flow. Our arguments yield a simpler proof of the following theorem.\n\n\nThe special flat measure is the unique A-invariant horospherical measure on any G-orbit closure. Any leaf for the weak-unstable foliation on any G-orbit closure is dense.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Motivations, prior work, and some ideas from the proofs\n \n\nThe work of Eskin, Mirzakhani and Mohammadi gives a very detailed understanding of invariant measures and sets for the G-action and the P-action on strata of translation surfaces. A central remaining open problem is to understand horocycle invariant ergodic measures. \n\nAs we will see in <ref>, horospherical measures are horocycle-invariant; thus understanding horospherical measures can be seen as a contribution to the problem of understanding  general horocycle-invariant measures.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA previous measure rigidity result for horospherical measures was obtained in 2008, independently by Lindenstrauss and Mirzakhani <cit.> and by Hamenstädt <cit.>. They were interested in understanding mapping class group invariant measures on the space of measured laminations. By a `duality principle' (see <cit.>) this question is very closely related to the problem of  classifying horospherical measures on the principal stratum. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur  argument for Theorem <ref> follows <cit.>, which in turn is inspired by ideas of Dani <cit.> and Margulis <cit.> The main ingredients are the mixing of the A-action, the use of dynamical boxes and how they transform under the A-action,  and nondivergence results for the U-action (which in the present context were obtained in <cit.>). After the requisite preparations, this argument is given in <ref>. In order to carry out the details of this argument one needs to give a precise description of horospherical measures and the special flat measures, and their decomposition into conditional measures in flow boxes. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Acknowledgements\n\nWe are grateful to Paul Apisa and Alex Wright for providing the proof\nof Theorem <ref>. The proof is given in Appendix\n<ref>. We acknowledge support from grants BSF 2016256,  ISF 2019/19\nand ISF-NSFC 3739/21.\n\n\n\n\n\n§ PRELIMINARIES\n\nIn this section we introduce our objects of study and set up our\nnotation. There are many approaches to these definitions. In our\napproach, the linear orbifold structure (or affine orbifold structure) given by period coordinates will be important and we will stress this point of view in what follows. A suitable reference for the theory utilizing this point of view is  <cit.>, and unless stated otherwise, our notation, terminology and assumptions are as in <cit.>. \nSee also \n<cit.>.\nSee <cit.> for a general discussion of affine manifolds.\n\n\n\n §.§ Strata and period coordinates\n\n\nLet S be a connected, compact orientable surface of genus g, Σ = {ξ_1, …, ξ_k }⊂ S a finite set, a_1, …, a_k non-negative integers with ∑ a_i = 2g-2, and = (a_1, …, a_k) the corresponding stratum of translation surfaces. We let _m=_m(a_1, …, a_k) denote the stratum of marked translation surfaces and π : _m→ the forgetful mapping. It will be useful to assume that singular points are labeled, or equivalently, = _m / (S, Σ), where (S, Σ) is the group of isotopy classes of orientation-preserving homeomorphisms of S fixing Σ, up to an isotopy fixing Σ. \n\nWe will typically denote elements of  by the letter q when we want to consider them as points of , and by the letter M or M_q when we want to consider their underlying topological or geometrical properties as spaces in their own right. To make this distinction clear we will write M_q for the underlying surface associated with a point q ∈. Points in _m will be typically denoted by boldface letters such as  . \n\nWe recall the definition of the map : _m→ H^1(S, Σ; ^2). \nFor an oriented path γ in M_q which is either closed or has endpoints at singularities, let (M_q, γ) ( ∫_γ dx_q, ∫_γ dy_q ), where dx_q and dy_q are the 1-forms on M_q inherited from the the forms dx and dy on the plane. \nGiven ∈_m represented by f: S → M_q, where M_q is a translation surface, we define ()  f^*((M_q, ·)). The map  is also known in the literature as the period map. There is an open cover {𝒰_τ} of _m, indexed by triangulations τ of S with triangles whose vertices are in Σ, such that the restricted maps\n\n    φ_τ|_𝒰_τ,   φ_τ: 𝒰_τ→ H^1(S, Σ; ^2)\n \nare homeomorphisms onto their image. The charts φ_τ give an atlas with affine overlap maps and endow ℋ_m with a structure of affine manifold. This atlas of charts {(𝒰_τ, φ_τ)} is known as the period coordinate atlas.  \n\nThe (S,Σ)-action on _m is properly discontinuous and affine, and hence  inherits the structure of affine orbifold, and the map π: _m→ is an orbifold covering map. We can associate to any affine manifold a holonomy cover and a developing map. In this case  is the holonomy cover and  is the developing map of  (see <cit.>).\n\nThe group  acts on translation surfaces in   and _m by modifying planar charts. It acts on H^1(S, Σ; ^2) via its action on the coefficients ^2.  The -action commutes with the (S, Σ)-action, and thus the map π is -equivariant for these actions. The -action on _m is free, since (g) ≠() for any nontrivial g ∈. \n\nWe have a coordinate splitting of ^2 and we write ^2 = _x⊕_y to distinguish the two summands in this splitting. There is a corresponding splitting of cohomology\n\n    H^1(S, Σ; ^2) = H^1(S, Σ; _x)  ⊕\n      H^1(S, Σ; _y).\n\nWe refer to the summands in this splitting as the horizontal space and vertical space respectively.\n\n It can also be useful to identify the coefficients with  and consider H^1(S, Σ; ). This is the most natural choice when we are considering Abelian differentials.\nAn -structure on a complex vector space V is given by a choice of a real subspace W⊂ V so that V=W⊕𝐢W. \nIf V is equipped with an -structure we say that a complex subspace V'⊂ V is defined over  if V'=W'⊕𝐢W' for some real subspace W'⊂ W.\nWe give H^1(S, Σ; ) the -structure corresponding to the real subspace H^1(S, Σ; )=H^1(S, Σ; _x)⊂ H^1(S, Σ; ). In this language 𝐢H^1(S, Σ; )=H^1(S, Σ; _y).\n\nIf V has an -structure then an -basis for V is a basis for V as a complex vector space consisting of elements of W.\nWe say that a linear equation on V has real coefficients if it is represented by a matrix with real entries when expressed with respect to an -basis.\n\n\nLet V⊂ H^1(S, Σ; ) be a complex vector space.  \nThe following are equivalent:\n\n    \n  * \n    V is invariant under the action of .\n    \n  * \n    V⊂ H^1(S, Σ; ) is defined over .\n    \n  * \n    V is the set of zeros of a collection of linear equations with real coefficients.\n\n\n \nThe universal coefficients theorem identifies H^1(S, Σ; ^2 ) with \n\n    (H_1(S,Σ;),^2 ).\n \nWith respect to this identification  acts on the left by post-composition.\n\n\nLet \n\n    a[  0 -1;  1  0 ],    b [ 1 0; 0 0 ],     and  c  aba^-1 = \n    [ 0 0; 0 1 ].\n\n\nNote that multiplication by a corresponds to multiplication by 𝐢, and multiplication by b and c correspond respectively to projections onto \nthe two summands in (<ref>). \n\n\n\n\n\nWe first prove the implication (<ref>)  (<ref>).  If V is a complex vector space then it is invariant under a, b and c.  Since a,b,c generate the ring of 2 × 2 real matrices, V is -invariant. \n\nIt is clear that (<ref>) implies (<ref>), and we now prove that (<ref>) implies (<ref>). \n If h:H_1(S,Σ;)→^2 is an element of (H_1(S,Σ;),^2) and L∈, then h maps to L∘ h. In particular h and h' differ by an element of  exactly when they have the same kernel. Thus if V is  invariant it corresponds to a subspace K⊂ H_1(S,Σ;)→^2. If k_j is a basis for K then V is determined by the equations v· k_j=0 where the dot represents the Kronecker pairing. These equations have real coefficients.\n\n\nWe have a restriction map : H^1(S, Σ; ^2) → H^1(S; ^2) (given by restricting a cochain to closed paths). Since  is topologically defined, its kernel ( ) is (S, Σ)-invariant. \nMoreover our convention that singular points are marked implies that the (S, Σ)-action on ( ) is trivial.\n\nDefine\n\n    Z =  (  )∩ H^1(S, Σ; _x).\n\nSince monodromy acts trivially on Z, for any v ∈ Z the constant vector field on H^1(S, Σ; ^2) in direction v pulls back to a well-defined vector field on _m on  via the local diffeomorphism dev. Integrating this vector field gives a locally defined real REL flow (corresponding to v) (t, q) ↦_tv(q). For every q ∈ a trajectory is defined for t ∈ I_q, where the domain of definition I_q  = I_q(v) is an open interval of  which contains 0. This interval is all of  if the underlying surface M_q has no horizontal saddle connections. If q ∈,   s ∈ and t ∈ I_q then t ∈  I_u_sq, and _tv(u_sq) = u_s _tv(q). The set\n\n    Z^(q){v ∈ Z: _v(q)  is defined} = {v ∈ Z: 1 ∈ I_q(v)},\n\nas well as the sets I_q(v), are explicitly described in <cit.>. \n\n\n\n §.§ Invariant subvarieties\n\n\nIn this subsection, we introduce our notion of invariant subvarieties and irreducible invariant subvarieties. It will be shown in <cit.>, using the work of Eskin-Mirzakhani <cit.> and Eskin-Mirzakhani-Mohammadi <cit.>, that an irreducible invariant subvariety is exactly a -orbit closure while an invariant subvariety is a finite union of such -orbit closures. \n\n\n A d-dimensional linear manifold is a submanifold L of  which is a connected component of ^-1(V) where V is a d-dimensional complex subspace of H^1(S,Σ;^2) defined over .\n\n\n\n Since the developing map is equivariant and (S,Σ) acts linearly on the space H^1(S,Σ;^2 ), it follows that (S,Σ) takes a d-dimensional linear manifold to a d-dimensional linear manifold.\nIf L is a linear manifold corresponding to V_L ⊂ H^1(S,Σ;^2 ), we denote by Γ_L be the subgroup of (S,Σ) that preserves L. Since the developing map  is (S,Σ)-equivariant, we get an induced action of Γ_L on V_L. We say that L is an equilinear manifold if furthermore we have (γ|_V_L)= ± 1 for every γ∈Γ_L.  \n\n\nA d-dimensional invariant subvariety is a subset  ⊂ such that π^-1() is a locally finite union of d-dimensional equilinear manifolds.\n\n\nWe will write d =  (); in some texts this is referred to as the complex dimension of .\nThe term “invariant\" in the definition  of invariant subvariety is justified by the following: \n\n\nAn invariant subvariety is  closed and -invariant.\n\n\n\nSince V is a closed subset of H^1(S,Σ;^2) it follows that  ^-1(V) is a closed subset of . It follows that a linear manifold is a closed subset of .\nThe set π^-1() is closed because it is a locally finite union of closed sets, and this implies that  is closed.\n\nSince π is -equivariant, it is enough to prove that π^-1() is -invariant. Let L be a linear submanifold contained in π^-1() which maps to V_L under . By definition, V_L is defined over  and by Lemma <ref> it is invariant under the action of  on H^1(S,Σ;^2 ). Since  is -equivariant the action of  on  preserves ^-1(V_L). Since  is connected, the action of  on  preserves L. Since π^-1() is a union of linear sub-manifolds it follows that it is invariant under .  \n\n\n\n\n    A d-dimensional invariant subvariety is said to be irreducible if it cannot be written as a union of two proper distinct d-dimensional invariant subvarieties. \n\n\n\n\nWe have the following equivalent characterization:\n\n\n    Let  be a d-dimensional invariant subvariety. Then  is irreducible if and only if for any d-dimensional equilinear manifold L ⊂π^-1(), we have \n     \n    ⋃_γ∈(S,Σ) L ·γ = π^-1().\n\n\n\nFor the proof of Proposition <ref> we will need the following: \n     If L and L' are distinct d-dimensional linear submanifolds, then  π(L)∩π(L') is a meager subset of π(L) and of π(L').\n \n \n We first show that π^-1(π(L)∩π(L') ) is a countable union of sets of dimension less than d. We have:\n \n    π^-1(π(L))=⋃_γ∈(S,Σ) L·γ  and  π^-1(π(L'))=⋃_γ∈(S,Σ) L'·γ.\n\n\nNow consider an intersection  (L·γ) ∩ (L'·γ'). We have (L·γ)⊂ V and (L'·γ)⊂ V' for d-dimensional linear subspaces of H^1(S,Σ;^2). \n If V=V' then L·γ and L'·γ' are topological components of ^-1(V) so they are either disjoint or equal. If L·γ=L'·γ' then L=L'·γ'γ^-1 so \n π^-1(π(L))=π^-1(π(L')) and π(L)=π(L') contrary to assumption.\n \n If V V' then (L·γ) ∩ (L'·γ')⊂^-1(V∩ V'). This is a complex subspace of positive codimension so its inverse image is a nowhere dense subset of the d-dimensional manifolds L·γ and L'·γ'. \n Thus π^-1(π(L)∩π(L')) is a meager subset of π^-1(π(L)) and π^-1(π(L')). Since π is open and the intersections (L ·γ) ∩ (L' ·γ') are closed, the projection π(L)∩π(L') is a meager subset of π(L) and π(L').\n \n \n\n\n\n\n\n\n\nSay that  is irreducible and let L be a d-dimensional equilinear manifold in π^-1(). If (<ref>) is false, we can write π^-1() as a countable union of orbits of distinct linear submanifolds L_1,L_2,…, as \n\n    π^-1()= ⋃_ℓ⋃_γ∈(S,Σ) L_ℓ·γ,\n\nwhere L=L_1 and the list {L_i} contains more than one element. We have \n \n    = ⋃_ℓπ( L_ℓ).\n\n We define\n \n    A π(L_1)  and  B ⋃_1<ℓπ(L_ℓ).\n\nSince  is irreducible, and since we have assumed that  (<ref>) fails, we have =B. This implies A⊂ B, and hence  π(L_1)=⋃_ℓπ(L_1)∩π(L_ℓ).\n According to Lemma <ref> π(L_1)∩π(L_ℓ) is a meager subset of π(L_1) so our decomposition of π(L_1) expresses π(L_1) as a meager set and violates the Baire category theorem. We conclude that =A which is what we wanted to show.\n\n Now assume that for any d-dimensional equilinear manifold L ⊂π^-1() we have (<ref>). Suppose we have a decomposition =A∪ B where\n\n    A= ⋃_jπ(L_j)  and  B=⋃_kπ(L'_k),\n\n  where both collections {L_i},  {L'_k} are (S, Σ)-invariant and comprised of d-dimensional equilinear manifolds. By (<ref>), π^-1(A) and π^-1(B) are either empty or equal to π^-1(). Thus A and B are not proper subsets of . \n\n\n\n\n\n\n\n\nIt follows from Proposition <ref> that if  is a d-dimensional irreducible invariant subvariety and L is a d-dimensional equilinear manifold contained in π^-1(), then π(L)=. This motivates the following definition that will be used throughout the text \n\n\n    Let  be a d-dimensional irreducible invariant subvariety. A lift of  is a d-dimensional equilinear manifold L ⊂π^-1(). \n\n\n\n\nThe following result \nestablishes the link between -orbit closures and invariant subvarieties. In the forthcoming \n<cit.>, it will be deduced from the results of <cit.>.  \n\n\nIrreducible invariant subvarieties and -orbit closures coincide. Furthermore, any invariant subvariety is a finite union of irreducible invariant subvarieties. \n\n\n\n\n\nStanding assumption: all the invariant subvarieties we will consider from now on will be assumed to be irreducible. \n\n\n\n\nLet  be a d-dimensional invariant subvariety. We conclude this section by constructing a Radon measure supported on  which will be uniquely defined up to a multiplicative constant. This will require some standard constructions which are summarized in Appendix <ref> for lack of a suitable reference. Let L be a lift of , let V_L = (L) and let Γ_L be the stabilizer in (S,Σ) of L. Let α be a volume form on L that is obtained as the pullback by  of an element of the top degree exterior power of V_L. The group  acts smoothly on . Denoting by g^∗ the pull-back operator on differential forms corresponding to the action of g ∈ on , we have \n\n    ∀ g ∈,   g^∗α = (det g)^d α.\n\n\n\n\n\n\nThe volume form α defines a measure on L that we denote by μ_L. Since L is an equilinear manifold, the measure μ_L is Γ_L-invariant. Furthermore, since (S,Σ) acts transitively on the set of irreducible components, it can be arranged that for any γ∈(S,Σ), γ_∗ m_L = m_L ·γ. This means that the sum\n\n    μ̃_ = ∑_L ⊂π^-1()μ_L,\n \nwhere the sum ranges over the lifts of ,\nis a (S,Σ)-invariant measure on .\nThe measure μ̃_ is a Radon measure, which follows from the fact that the collection of irreducible components is locally finite. Using Proposition <ref>, there is a unique Radon measure μ_ on  such that for any f ∈ C_c(), we have\n\n    ∫_ f  dμ̃_ = ∫_( ∫_ f  dθ_q )  dμ_(q),\n\nwhere \n\n    θ_q ∑_∈π^-1( q) N() ·δ_,   N()   |{γ∈(S, Σ) :  = ·γ}|\n\n(as in (<ref>)). \nThe measure μ_ is supported on . It follows from Lemma <ref> that it is -invariant. We call it the linear measure on . Notice that this is a slight abuse of language as μ_ is only determined up to a multiplicative constant. \n  \n\n\n §.§ Area one locus, cone construction, and special linear measures\n Let ∈_m, let q =π(), and let M= M_q be the  underlying translation surface. The area of M can be expressed using period coordinates as follows.\nWe define a Hermitian form on H^1(S, Σ ; ) by \n\n    ( α, β ) = 1/2 𝐢∫_Sα∧β̅.\n\n(See <cit.> for a topological interpretation of (<ref>).) The area of M is then given by ((), ()). This is thus a quadratic formula in period coordinates. \n\nFor the purposes of this paper we will use a related real valued bracket ⟨α, β⟩ involving the pairing of horizontal and vertical classes. Say that on a marked surface M_q we have a 1-form α corresponding to an element of H^1(S, Σ; _x) (a horizontal form) and a 1-form β corresponding to an element of H^1(S, Σ; _y) (a vertical form). Then \n\n    ⟨α, β⟩ =  ∫_Sα∧β\n\nand this gives\n\n    (M_q)=⟨ dx_q, dy_q ⟩ =  ∫_S dx_q ∧ dy_q .\n\n\nWe denote the subset of surfaces in  and  of area one by ^(1) and ^(1). More generally, when  is an invariant subvariety and L is a lift of , we also denote by ^(1) and L^(1) their intersection with the area-one locus. The latter are G-invariant and invariant under real REL flows (where defined). \n\nWe recall that there is a rescaling action of _+^∗ on  that corresponds to the action of the subgroup of  of scalar matrices with positive coefficients. We consider the cone measure m_ on ^(1) defined for any Borel subset A ⊂^(1) by \n\n    (A) μ_(cone(A)),   where cone(A) {t· a : t ∈ (0,1],  a ∈ A}.\n\nWhen  is the whole stratum , the measure m_ is called the Masur-Veech measure. More generally, we shall call the measure  the special flat measure on . If L is a lift of , we can perform the same cone construction with the measure μ_L and we denote by m_L the corresponding measure. \nLet m̃_\nbe the pre-image of m_ under π, that is the unique measure \non  such that \nfor any f ∈ C_c(),\n\n    ∫_π^-1() f  dm̃_ = ∫_(∫_X̃ f  dθ_q )  dm_(q)\n\n    (see \nDefinition <ref>). It is easily verified that \n\n    m̃_ = ∑_L ⊂π^-1() m_L.\n\n\n\n\n §.§ The sup-norm Finsler metric\n \nWe now recall the sup-norm  Finsler metric on .  This structure was studied by Avila, Gouëzel and Yoccoz, for proofs and more details see <cit.> and <cit.>. Let · denote the Euclidean norm on ^2. For a translation surface q, denote by Λ_q the collection of saddle connections on M_q and let ℓ_q(σ)= _q(σ) be the length of σ∈Λ_q. For β∈ H^1(M_q,Σ_q; ^2) we set \n\n    β_q sup_σ∈Λ_qβ(σ)/ℓ_q(σ).\n\n\n\nWe now define a Finsler metric for . Let f: S → M_q be a marking map representing a marked surface ∈. Using period coordinates we can  identify the tangent space to  at  with H^1(S,Σ;^2).  \nThen \n\n    β_sup_τ∈Λ_β(f(τ))/ℓ_q(f(τ))\n\nis a norm on H^1(S, Σ ; ^2). It satisfies the equivariance property \n\n    ∀ h ∈(S,Σ),   β_ = h^*β_ . h,\n\nwhere . h is represented by the marking map f ∘ h. \nThe map \n\n    T(_m) →,        (,β) ↦β_\n\nis continuous.  \nThe Finsler metric  defines a distance function[In order to avoid confusion we use `distance function' to refer to what is often called a metric.] on  which we call the sup-norm distance and define as follows:\n\n    dist(_0, _1) inf_γ∫_0^1 γ'(τ)_γ(τ) dτ,\n\nwhere γ ranges over smooth paths γ:[0,1] → with γ(0)=_0 and γ(1) = _1.  The topology induced by the sup norm distance on   is the one  induced by period coordinates, and the resulting metric space  is proper and complete. We can use the distance function on  to define a distance function on  by\n\n    dist(q_0, q_1) = inf{dist(_0, _1): _i ∈π^-1(q_i),  i=0,1}.\n\n\n\n\n§ HOROSPHERICAL MEASURES\n\n\nLet  be an invariant subvariety of dimension n. The goal of this section is to define the horospherical foliation on  and the related horospherical measures, which are our object of study in this paper. These objects will be defined via their counterparts for the irreducible components of π^-1(). \n\n\n\n\n §.§ Boxes\n We now define a notion of boxes. They will be used throughout the text and will play two roles: boxes give local coordinates on invariant subvarieties (more precisely, on the irreducible components of their pre-image by π) that are convenient for the study of horospherical measures; additionally, they will be used in a mixing argument in the proof of Theorem <ref>.\n\nFrom now on, we identify H^1(S,Σ,) with H^1(S,Σ,^2) as in <ref>.  Let V ⊂ H^1(S,Σ,) be a complex linear subspace defined over . We have \n\n    V = V_x⊕ V_y,\n\nwhere\n\n    V_x V ∩ H^1(S, Σ; _x)    and  V_y V ∩ H^1(S, Σ; _y)\n\nare identified by the isomorphism V_x∋ v ↦𝐢 v ∈ V_y. We define\n\n    V^(1){(x,y) ∈ V: x ∈ V_x,   y ∈ V_y,  ⟨ x, y ⟩ =1 },\n\nand denote by\n\n    π_ : V → V_,      π_: V → V_\n\nthe projections corresponding to the direct sum\ndecomposition (<ref>), and by π'_ the\nprojection from π_^-1 (V_{0}) to the\nprojective space 𝐏(V_). Finally let\n\n    Ψ:V^(1)→𝐏(V_)× V_,     Ψ(q)  =\n      (π'_(q),π_(q)).\n\n \n  The map Ψ is a local diffeomorphism.\n\n\n\n\nSay that (x_0, y_0) ∈ V^(1) is mapped by Ψ to (x̅_0,y_0) in 𝐏(V_)× V_. We will construct a local inverse. Since ⟨ x_0,y_0⟩=1 we can find neighborhoods U_ of x_0 in V_ and  U_ of y_0 in V_ so that ⟨ x,y⟩>0 for x∈ U_ and y∈ U_. We define maps\n\n    ψ̃:U_× U_→ V^(1),    ψ̃(x,y)=(x/⟨ x,y⟩,y )\n\nand\n\n    ψ:U'_× U_→ V^(1),    ψ([x],y) ψ̃(x,y),     where  U'_π'_(U_).\n\nThe map ψ̃ is smooth and descends in a well-defined way to define ψ. We see that Ψ∘ψ is the identity map, i.e., ψ is a local inverse of Ψ. \n\n\n[Boxes]\nLet L be a lift of  and let V = (L). A box in L is a relatively compact subset ⊂ L^(1) together with a diffeomorphism φ : → such that, in the notations above,\n\n  \n  * U'_ and U_ are open sets in V_ and 𝐏(V_) respectively.\n  \n  * Ψ∘∘φ = Id.\n\nFor y  ∈ U_, the plaque of y in  is the set _y φ(U'_×{y}). \n\n\nThe composition in the second item in Definition <ref> makes sense since (L^(1)) ⊂ V^(1), in light of \n(<ref>).\nIt should be understood as a choice of a suitable parameterization for boxes. Note that the data φ, are implicit in the notion of a box, but in order to avoid excessive notation we simply write .\n\nMore generally, a box in π^-1() is a box in one of the irreducible components of π^-1(). Such a box  will be called regular if for any γ∈(S,Σ) either ·γ∩ = ∅ or γ∈Γ, where Γ is the stabilizer in (S,Σ) of  (i.e. the set of γ∈(S,Σ) such that ·γ =). When  is regular, the map π induces a homeomorphism / Γ→π(). In particular the image of a regular box by π is an open subset of . Since (S,Σ) acts diagonally on 𝐏(H^1(S,Σ,_)) × H^1(S,Σ,_), the set of boxes is preserved by the action of (S,Σ). Furthermore, a finite intersection of boxes is a box. Thus, by Lemma <ref>, for every ∈π^-1(), there is a regular box in π^-1() containing . \n\n\n\n\n\nThere is an asymmetry in the definition of a box; we could equally well define a box using V_ and 𝐏(V_), but we will make no use of that kind of box.\n\n\n\n\n\n §.§ Definition of the horospherical foliation\n\nRecall that a smooth map of manifolds is a submersion if its\nderivative is of full rank at every point. The implicit function\ntheorem implies that the connected components of the fibers of a\nsubmersion are the leaves of a foliation. \n\n \nLet L be a lift of  and let V be the linear space on which L is modeled. The foliations on L^(1) induced by the submersions\n\n    π'_∘ : L^(1)→𝐏(V_)   and  π_∘ : L^(1)→ V_,\n\nare called the weak stable and strong unstable foliations. They are denoted respectively by ^s and  ^uu. The leaves of ∈ L^(1) are denoted by ^s() and  ^uu(). \n\n\nIt follows from Lemma <ref> that these foliations are well-defined, and the leaves of these foliations are everywhere transverse. \n\n\n\n\n\nThere was an idea to discuss this in the language of \n  orbifold foliations and (G,X)-structures. \n  I guess Peter's contribution in this direction is in the file `(G, X) structures on \n  orbifolds'... but I didn't understand whether Peter wanted us to use \n  that, and if so, how... I used the stuff in 2.3 to remove the \n  need to work with orbifolds. Note that the boxes are only boxes in the \n  nonsingular part of  and similarly for the foliation. Please check \n\n\n\n\n\nRecall that  for ∈_m, the local group Γ_\n  for the orbifold structure on  is the subgroup of (S,\n  Σ) fixing . We will say that a foliation on\n  _m induces an orbifold foliation on  if\n  the monodromy action permutes the leaves,  and each local group  Γ_ preserves the \n  tangent space to the leaf of ; the leaves of an orbifold\n  foliation are thus orbifolds on their own right. \n\n\n\n \nThe action of (S, Σ) permutes the leaves of ^uu. For any leaf F, the restriction |_F is a local homeomorphism to an affine subspace of V and with respect to this affine structure, the subgroup Γ_L {γ∈(S, Σ) : L ·γ = L} acts on the leaves of W_L^uu by affine maps. \n\n\n\nThe monodromy preserves the product splitting V=V_⊕ V_ and acts linearly on each factor. Thus the monodromy acts projectively on 𝐏(V_). Since  is monodromy equivariant, the leaves of the foliations ^s, ^uu are permuted by the action of (S, Σ). \n\nFor the second assertion, it is clear from the definitions that  maps the leaf F to a set of the form { (x,y_0) ∈ V : x ∈ V_ and ⟨ x, y_0 ⟩ =1} for some fixed y_0 ∈ V_y, and by Lemma <ref>, the map |_F is a local diffeomorphism. The last assertion follows from the (S, Σ)-equivariance of  and the fact that (S, Σ) preserves the bracket ⟨·, ·⟩. \n\n\n\n\nLemma <ref> equips the leaves of the foliation W^uu with an affine manifold structure. This structure need  not be geodesically complete. Using real Rel deformations, one easily constructs affine geodesics in a leaf ^uu() which contain a surface with a horizontal saddle connection whose length  goes to zero as one moves along the leaf. There are additional sources of non-completeness involving surfaces whose horizontal foliation is minimal but not uniquely ergodic, see <cit.>. Furthermore, using <cit.>, one can show that each leaf ^uu() is mapped by the developing map homeomorphically to an explicitly described convex domain in H^1(S, Σ; _), defined by finitely many linear inequalities. \n\n\n\n\nIt follows from Lemma <ref> that the partition of L^(1) given by the leaves ^uu induces a partition of ^(1). We denote it by W^uu and if q ∈, we denote by W^uu(q) the element of the partition  that contains q. We emphasize that W^uu does not depend on the choice of a particular irreducible component used to define it. This is a consequence of the fact that (S,Σ) acts on H^1(S,Σ,) by real endomorphisms and thus preserves the splitting into real and imaginary parts of cohomology classes.  \n\n\n    A horosphere is an element of the partition of W^uu. \n\n\n\nOccasionally, we may call the partition W^uu the horospherical foliation of . Even if this will play no role in the rest of the paper, we justify this choice of terminology for the sake of completeness: the invariant subvariety  can be seen to have the structure of a properly immersed manifold , i.e., is the image of a manifold  under a proper orbifold immersion f : → and there is a foliation on  whose leaves are sent to horospheres by f. We can choose  to be the quotient of L by a finite-index torsion-free normal subgroup Γ_0 of (S, Σ) and f : L / Γ_0 →,  Γ_0 ↦π(). By Lemma <ref>, the horospherical foliation on L descends to a foliation on the manifold L /Γ_0. The leaves of this foliation are indeed mapped to horospheres and f is an orbifold immersion. The fact that it is proper follows from the fact that the collection of irreducible components of π^-1() is locally finite.\n\n\n\nReversing the roles of π_ and π_, and defining π'_ in an analogous fashion, we also define the strong stable and unstable foliations ^ss and ^u as those induced by the submersion π_∘,  π'_∘ respectively. Lemma <ref> holds for these foliations as well, with obvious modifications. Summarizing: for every ∈ L we have\n\n    ^ss() ⊂^s(),    ^uu() ⊂^u(),\n\nthe leaves ^ss() and ^uu() have a natural affine structure and, for n =  (), we have \n\n    ^ss() = ^uu() = n-1,      ^s() = ^u(q) = n.\n\n\nAs we saw in <ref>, the sup-norm Finsler metric induces a distance function on _m as a path metric. We will induce distance functions on leaves of the stable and strong stable foliations using the same approach. For _0, _1 ∈_m belonging to the same stable (respectively, strong stable) leaf, we  define dist^(s)(_0, _1) (respectively, dist^(ss)(_0, _1)) by (<ref>), but making the additional requirement that the entire path γ is contained in the stable (respectively strong stable) leaf of the _i. \n\nWe similarly define dist^(s)(q_0, q_1) and dist^(ss)(q_0, q_1) for q_0, q_1 ∈ belonging to the same stable (respectively, strong stable) leaf. We will call the distance functions dist^(s),  dist^(ss) the stable (resp. strong stable) sup-norm distance function. \n\nThese distance functions have the following properties:\n\n\nLet L a lift of  and let _0, _1 ∈ L.\n  \n\n    \n  *  If _0, _1 are in the same stable (resp., strong stable leaf) leaf then dist(_0, _1) ≤dist^(s) (_0, _1) (resp., dist(_0, _1) ≤dist^(ss) (_0, _1)).\n    \n  *  If _0, _1 are in the same strong stable leaf then for all t ≥ 0, \n    \n    \n    dist^(ss) (g_t _0, g_t _1) ≤dist^(ss) (_0, _1).\n\n\n    And the same holds for the strong unstable leaf. \n    \n    \n  *  If _1 = g_t _0 for some t ∈ then dist^(s)(_0, _1) ≤ |t|.\n    \n  * Statements (<ref>), (<ref>) and (<ref>) also hold in , for q_0, q_1 in place of _0, _1. \n \n   \n\n\nAssertion (<ref>) is obvious from definitions, and assertions (<ref>) and (<ref>) are proved in <cit.> (where what we call the strong stable foliation is referred to as the stable foliation). The assertions for  follows from the corresponding ones for _m. \n\n\n\n\n\nAlmost everywhere, the horospheres W^uu(q), W^ss(q) are actually the unstable and stable manifolds of the geodesic flow. That is, for any q, and almost every (with respect to the measure class induced by the affine structure on leaves) q_1 ∈ W^uu(q),   q_2 ∈ W^ss(q), we have \n\n    dist (g_t q, g_t q_1) t → -∞⟶ 0   and  dist (g_t q, g_t q_2) t →∞⟶ 0.\n\nThis is proved in <cit.> (see also <cit.>) for = ^(1). The same result for general invariant subvarieties can be proved by adapting the  arguments  used in <cit.>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Definition of horospherical measures\n\n\nLet L be a lift of  and let V ⊂ H^1(S,Σ,) be the subspace on which L is modeled. We write V = V_⊕ V_ as in (<ref>). Let η_ and η_ be the translation invariant volume forms on V_ and V_ determined by a choice of an element of the top degree wedge power of V_≅ V_. Define\n\n    α_ (π_∘)^*(η_),       α_ (π_∘)^*(η_).\n\n\n\nWe recall that the measure μ_L on L was defined in Section <ref> as the integral of a volume form α. From now on, this form will be chosen so that α = α_∧α_y. We define the Euler vector field E on  such that for any ∈,\n\n    E(q)= E_x() ∂/∂ t|_t=0[ e^t   0;   0 e^t ]·.\n\n\nThis vector field can be thought of as the tangent vector to the rescaling action, which justifies our choice of terminology. Notice furthermore that the image of E by  is the usual Euler vector field e(v) = v on H^1(S,Σ;). This is due to the fact that  is -equivariant. Since L is a linear manifold, the vector field E is tangent to it.  We use this to define the form\n\n    ι_E α_,\n\ni.e., the contraction of α_ by the Euler field E. The restriction of  to the leaves of ^uu induces a volume form. We denote by ν_β_ the induced measures. \nWe emphasize that this defines a system of measures, one on each leaf W^uu_L(),  so one should write ν_,^L instead of ν_β_; we omit this in our notation. We say that a measure m on L is horospherical if it is supported on L^(1) and its conditional measures on the leaves of ^uu are given by the measures ν_β_. More precisely, this means that for any box  in L, there is a measure λ on U_ such that for any compactly supported continuous function f:L →, \n\n    ∫_ f  dν = ∫_U_( ∫_L_y f   dν_β_)  dλ(y).\n\n     \nThe measure λ is a so-called `transverse measure' for the horospherical foliation. This means it is a system of measures on sets tranverse to the foliation which is invariant under holonomy along leaves, see <cit.>. The theory of transverse measures implies that (<ref>) serves as a bijection between horospherical measures and transverse measures. We will not be using this point of view in this paper. \n\n\n         \n    \n\nLet ϕ_t be a smooth flow acting on L. A measure ν is said to be invariant if for any t ∈ we have (ϕ_t)_* ν = ν. This definition is equivalent to requiring that the conditional measures of ν on the orbits of ϕ_t be multiples of the Lebesgue measure dt, i.e., invariant under  the maps ϕ_s x ↦ϕ_t+sx for any fixed t. The equivalence can be shown by disintegrating ν on flow boxes, i.e., boxes whose horizontal plaques are pieces of ϕ_t-orbits. By Lemma <ref>, leaves of ^uu are modeled on linear subspaces, and thus one could try and define horospherical measures as those that are invariant under translation along the leaves. However, these translations are not part of a globally defined group action; for instance trajectories might escape to infinity in finite time. To remedy this we adapt the other characterization of invariant measures, where the foliation by orbits of ϕ_t is replaced by the strong unstable foliation and the translation invariant measure dt is replaced by . \n \n\nIn order to define a notion of horospherical measures on , we first need some terminology: let ν be a Radon measure on  and let ν̃ be its pre-image by π as in (<ref>) (see also Appendix <ref>). By construction, the measure ν̃ is supported on π^-1(). If L is a lift of , then the restriction of the measure ν̃ to L is called the lift of ν corresponding to L. More generally, a lift of ν is a measure of the form ν̃|_L where L is any lift of .  For instance, the measures m_L in (<ref>) are the lifts of m_. \n\n[Horospherical measure] A Radon measure ν on  is horospherical if its lifts are horospherical. \n \n\nBy Proposition <ref>, it is enough that one of the lifts is horospherical, as the action of (S,Σ) preserves the set of horospherical measures on _m. By definition, a horospherical measure is supported on L^(1). We have the following useful local disintegration formula: \n\n    Let ν be a horospherical measure on . For any regular box\n    φ : →\n    in π^-1(), there is a measure λ on U_ such that for any compactly supported continuous function f:→, denoting B=π() we have\n\n    ∫_ f  dν = ∫_U_( ∫_L_y f ∘π dν_)  dλ(y).\n\n\n\n\n\nLet L be a lift of  in which  is contained. We denote by Γ the stabilizer in (S,Σ) of , and by ν̃  the pre-image of ν under π. By definition, the measure ν̃|_L is horospherical,  and we let λ_0 be a measure on _ as in (<ref>). We set λ1/|Γ|λ_0, and claim that λ satisfies (<ref>). Indeed, let f ∈ C_c() and assume for now that the support of f is contained in B̅. Let h be the function that is equal to f ∘π on  and 0 elsewhere. This function is continuous and its support is contained in  by construction. Using that the stabilizer of  in (S,Σ) is also Γ, we calculate that for any q ∈, we have ∫_ h  dθ_q = |Γ| f(q). We have\n    \n    ∫_B f  dν   = 1/|Γ|∫_ h  dν̃ = 1/|Γ|∫_U_( ∫_L_y f ∘π dν_)  dλ_0(y),\n \nwhich is what we wanted. In  case the support of f is arbitrary, we pick a sequence ψ_n of uniformly bounded smooth functions with support contained in  and that converge pointwise to 1_B, the indicator function of B, and we apply the previous computation to ψ_nf in place of f. We have\n\n    ∫_B ψ_n f  dν = ∫_U_( ∫_L_yψ_n f ∘π dν_)  dλ(y).\n \nPassing to the limit using Lebesgue's dominated convergence, we obtain (<ref>).  \n\n\n\n\n\n §.§ The special flat measures are horospherical\n\nIn this subsection we prove Theorem <ref>, which gives us our first  examples of horospherical measures. Namely we will show that the Masur-Veech measures on strata, and more generally, the special flat  measures defined in (<ref>), are horospherical.\n\n\nLet  be an invariant subvariety and let L be a lift of . In order to establish Theorem <ref>, we shall first establish that the measure m_L as in (<ref>) is horospherical. This will be achieved in Proposition <ref>. We need some preparatory results. We recall that the measure m_L is obtained by the cone construction applied to μ_L, i.e., for any Borel set A ⊂ L^(1),\n\n    m_L(A) = μ_L(cone(A)),\n\nand the measure μ_L is itself obtained by integration of α = α_∧α_, where α_ and α_ are as in (<ref>). Let βι_Eα. By construction, β induces a volume form on L^(1) and we denote by μ_β the measure obtained by integration of β. The following relates the measure μ_β and the cone measure m_L. \n\n We have \n\n    μ_β = () · m_L.\n\n\n\n\nThe proof is an application of Stokes' theorem. It follows from (<ref>) that the Lie derivative of α with respect to the Euler vector field satisfies ℒ_E(α) = () ·α. Let U be an open set in L^(1) contained in one chart for the manifold structure on L. Notice that the only part of the boundary ∂cone(U) of cone(U) to which E is not tangent is U itself. In particular, the only part of ∂cone(U) on which ι_Eα does not vanish is U. We have from Stokes' formula (for manifolds with corners, see e.g. <cit.>) that\n\n    ∫_cone(U) d(ι_E α) = ∫_∂cone(U)ι_Eα = ∫_U ι_Eα = μ_β(U).\n\nIt follows from the Cartan formula  that ℒ_E(α) = d ι_E α + ι_E d α. Since α is closed, we deduce that d ι_E(α)= ℒ_E(α). Gathering everything, we obtain\n\n    () · m_L(U) = μ_β(U).\n \nThis is true for all U as above, and these open sets generate the Borel σ-algebra on L^(1).\n\n\nWe introduce two new vector fields E_ and E_ on :\n\n    E_x() ∂/∂ t|_t=0[ e^t   0;   0   1 ]·   and    E_y() ∂/∂ t|_t=0[   1   0;   0 e^t ]·.\n\nBy definition we have E = E_x + E_y, and for any ∈, we have\n\n    ∂/∂ t|_t=0 g_t · = E_x() - E_y().\n\n\nFor the proof of Theorem <ref>, we will also need the following calculation: \n  The restrictions of the forms\n  α_ and α_ to L^(1) satisfy\n   \n    ι_E (α_∧α_) = 2 (ι_E α_) ∧α_.\n\n  \n\n\n\nLet n = (). We begin by observing that on restriction to L^(1), we have\n  \n    ι_(E_-E_)(α_∧α_)=0.\n\nIndeed, we deduce from (<ref>) that E_x-E_y is tangent to L^(1). In particular, since L^(1) has dimension 2n-1 (as a real vector space), any family of 2n-1 linearly independent vector fields that are tangent to L^(1) contain E_ - E_ in their span. This implies (<ref>). \n\n\nNow we calculate:\n\n    ι_E(α_∧α_)    = ι_2E_ - (E_-E_) (α_∧α_)\n       (<ref>)= 2ι_E_(α_∧α_) = 2ι_E_α_∧α_ + (-1)^nα_∧ι_E_xα_.\n\nThe last equality follows from the Leibniz formula for contractions \n\n    ι_V(α∧β)=(ι_Vα)∧β+(-1)^(  α)α∧ι_Vβ.\n\nNow, notice that E_ is tangent to the fibers of π_∘. Since α_ = (π_∘)^∗η_, we deduce that ι_E_α_ = 0. Similarly, we prove that ι_E_α_ = 0 and thus \n\n    ι_E(α_∧α_) = 2ι_E_α_ = 2ι_Eα_.\n \n\n\n\n    The measure m_L is horospherical. \n\n\n\nIt follows from Lemma <ref> that m_L is given, up to a multiplicative constant, by integration of the differential form β = ι_E( α_∧α_). Lemma <ref> implies that β = 2 β_∧α_.  Notice that both the forms β_ and α_ are basic, i.e., they are obtained by pullback of forms on 𝐏(V_) and V_ by the projections ∘π_' and ∘π_. Indeed, we have α_ = (∘π_)^∗η_y and using Lemma <ref>, we can build a differential form β_' on 𝐏(V_) such that (∘π_')^∗β_' = β_x.\n\nNow, let φ : → be a box in L^(1) and let f ∈ C_c(L). Notice that φ^∗α_ = η_ and φ^∗β_ = β_'. We have: \n\n    ∫_ f ·β_∧α_   = ∫_ f ∘φ·β_' ∧η_\n       =  ∫_U_( ∫_U_' ×{y} f ∘φ·β_' ) ·η_\n       =  ∫_U_( ∫__y f ·β_) ·η_.\n\nIf we let λ be the measure on U_ given by integration of the form 2/()·η_y, we obtain \n\n    ∫_ f  dm_L = ∫_U_( ∫__y f  d)  d λ(y).\n\n\n\n\n\n\nBy definition, in order to prove that m_ is horospherical, we need to show that the lifts of m_ are horospherical. We recall from (<ref>) that the lifts of m_ are given by the m_L. Theorem <ref> is then a consequence of Proposition <ref>.  \n\n\n\n\n\n §.§ The horocycle flow, real REL, and horospherical measures\n\nIn this subsection we will show that the horocycle flow and the real Rel deformations move surfaces inside their horospherical leaf, and preserve horospherical measures. \n\n\n\nHorospheres and horospherical measures are horocycle flow-invariant. \n\n\n\n\n For ∈_m with () = (x, y) and s ∈, we have \n  \n    (u_s ) = (x + sy, y).\n\n This implies that the horocycle flow maps ^uu() to itself and since π is -equivariant, we deduce that horospheres are preserved by the horocycle flow.  \n\nWe also deduce from (<ref>) that the horocycle flow preserves the form α_. Since the horocycle flow commutes with the rescaling action, it also preserves the Euler vector field, from which we deduce that for any s ∈ we have u_s^∗ =. In particular, the horocycle flow preserves the measures ν_. \n\n\nLet ν be a horospherical measure and let s_0 >0. We claim that for any q ∈ such that the orbit segment {u_sq : s∈,  |s| ≤ s_0 } is embedded, i.e., Uq is not a periodic horocycle orbit with period of length smaller than 2s_0, there is an open set ⊂ containing q such that for any compactly supported continuous function f with support contained in 𝒰 and any s ∈ with |s| ≤ s_0,  we have:  \n\n    ∫_ f∘ u_s dν = ∫_ f  dν.\n\nTo see this, let ∈ be such that π()=q and define\n\n    σ{ u_s  : s ∈,  |s| ≤ s_0 }.\n\n\nLet Γ be the stabilizer in (S,Σ) of . Since the -action on  commutes with (S,Σ), the group Γ acts trivially on σ and since Uq is not a periodic orbit with period smaller than 2s_0, we have that that σ·γ∩σ = ∅ for any γ∈(S,Σ), unless γ∈Γ. By thickening σ, we can find a box ⊂π^-1() containing σ and up to replacing  with  ∩_γ∈Γ·γ, we can assume that  is regular. By construction, for any s ∈ with |s| ≤ s_0, the surface u_sq belongs to B = π() and lies on the plaque of q. Since the horocycle flow acts continuously, there is a neighborhood ⊂ around q such that for any ' ∈π^-1() ∩ and |s| ≤ s_0, we have u_s ' ∈. Let λ be a transverse measure on U_, i.e., a measure as in (<ref>), and let f be a continuous function with support contained in 𝒰. It follows from (<ref>) that\n\n    ∫_ f ∘ u_s d ν   = ∫_U_(\n        ∫_L_y f ∘ u_s∘π d ν_)  dλ(y)\n       = ∫_U_( ∫_L_y f  ∘π d u_s_∗ν_)  dλ(y)\n       = ∫_U_( ∫_L_y f  ∘π d  ν_)  dλ(y) = ∫_ f  dν.\n\nThe second equality follows from the fact that π is -equivariant and the fact that for any y ∈ U_, the action of u_s maps supp(f ∘π) ∩L_y inside L_y, which in turns is implied by our choice of  and the fact that the horocycle flow maps the leaves of ^uu into themselves.  \n\n\nFor any f ∈ C_c(), define\n\n    s_f inf{s >0 : supp(f)  contains a periodic surface of period s }.\n\nIt is easy to see that s_f is always positive, and using the first part of the proof together with a partition of unity argument, we can show that (<ref>) holds for f and s ∈ with |s| ≤ s_f. Furthermore, notice that for any s ∈, we have s_f = s_f ∘ u_s. Writing s=ks' with k ∈ℕ and |s'| ≤ s_f, we obtain\n\n    ∫_ f ∘ u_s dν = ∫_ f ∘ u_(k-1)s' dν = ⋯ = ∫_ f  dν.\n\nThis proves that ν is horocycle flow-invariant. \n\n\n\nFor any irreducible invariant subvariety , we let\n\n    Z_ V ∩ Z,\n\nwhere V is the model space of any lift of π^-1(). Notice that the space Z_ actually does not depend on the choice of particular lift. This is a consequence of Proposition <ref> together with with the fact that (S,Σ) acts trivially on (). \n\n\nLet v ∈ Z_, q ∈, and suppose  _v(q) is defined. Then _v(q) ∈ W^uu(q). If ν is a horospherical measure and _v(q) is defined for ν-a.e. q, then ν is invariant  under the (almost everywhere defined) map q ↦_v(q).\n\n\n\nLet Z^(q) be as in (<ref>). Since Z_⊂ V, where V is the subspace that  is modeled on, we have _v(q) ∈ if q ∈ and v ∈ Z_∩ Z^(q). The only properties of the horocycle flow which were used in the proof of Proposition <ref> are that u_s_0 preserves the horospheres, and  acts on them by translations. The same properties are valid for the action of _v for v ∈ Z_. Indeed, _v sends surfaces of area one to surfaces of area one, and if () = (x,y) then (_v ) = (x + v , y). \n\n\n\n If a measure μ on  is saddle-connection free, then for μ-a.e. q ∈, _v(q) is defined for every v ∈ Z_, and satisfies the `group law' property \n\n    ∀ v_1, v_2 ∈ Z_,   _v_1( _v_2(q) ) = _v_1+v_2(q).\n\nFollowing <cit.>, we say that an irreducible invariant subvariety  is of rank one if ((V))=2,\nwhere V is the model space of any lift of π^-1(). In the rank one case we have the following converse to Propositions <ref> and <ref>: \n\n    If  is an invariant subvariety of rank one and μ is a saddle connection-free measure, then μ is horospherical if and only if it is invariant under the horocycle and the real Rel flows. \n\n\n\nBy a dimension count, we see that when  has rank one, the dimension of horospheres is the same as (Z_)+1. This means that the horosphere W^uu(q) satisfies \n\n    W^uu(q) = {_v(u_sq): s ∈,  v ∈ Z_},\n\nthat is the group action generated by the  horocycle flow and real Rel acts transitively on the horospheres. \nAs we saw in the proofs of Propositions <ref> and <ref>, this action is by translations, with respect to the affine structure on W^uu(q) afforded by Lemma <ref>. Since the measures ν_β_ are the unique (up to scaling) translation-invariant  measures on the affine manifolds L^(1), the invariance of μ under the horocycle and real Rel flows implies that the conditional measures on the plaques in a box are given by ν_β_.\n    \n\n\n\n\n §.§ Further properties\n\nLet X be a manifold with a foliation, and a Borel measure μ. We say that μ is ergodic for the foliation if any Borel subset A which is a union of leaves satisfies either μ(A)=0 or μ(X  A)=0. For instance we have:\n\n\n\nThe special flat measure on an invariant subvariety is ergodic for the horospherical foliation.\n\n\n\nThis follows from Proposition <ref> and the ergodicity of the special flat measure with respect to the U-action. \n\n\n\nDenote by  𝒫^(uu)() the collection of horospherical measures on  with total mass at most one. The following standard results in ergodic theory are valid in the context of horospherical measures:\n\n\nFor the horospherical foliation on any invariant subvariety ^(1), we have:\n\n    \n  * The space 𝒫^(uu)(), with the weak-* topology, is a compact convex set. \n    \n  * A horospherical probability measure is ergodic if and only if it is an extreme point of  𝒫^(uu)(). \n    \n  * For any probability measure μ∈𝒫^(uu)() there is a probability  space (Θ, η) and a measurable map Θ→𝒫^(uu)(),  θ↦ν_θ, such that ν_θ is ergodic and a probability measure for η-a.e. θ, and μ = ∫_Θν_θ  dη(θ).\n    \n  * If μ_1, μ_2 ∈𝒫^(uu)() such that μ_1 ≪μ_2, and μ_2 is  ergodic, then μ_1 = cμ_2 for some c ≥ 0. \n\n  \n\n\n\nIt is clear from definitions that if μ_1, μ_2 ∈𝒫^(uu)(), and α∈ (0,1), then αμ_1 +(1- α)μ_2 ∈𝒫^(uu)(). It is also clear that condition (<ref>), and the condition μ() ≤ 1, are both closed conditions. This proves the first assertion. The remaining assertions follow from Choquet's theorem by standard arguments, see e.g. <cit.>. \n\n\n\nWe say that two surfaces q, q' ∈ are horizontally equivalent if there is a homeomorphism M_q→ M_q' of the underlying surfaces, that preserves the labels of singularities and maps the horizontal saddle connections of M_q bijectively to those of M_q'.  Note that a horizontal equivalence only preserves certain horizontal structure. It preserves saddle connections but need not preserve the horizontal foliation.\n  \n\nAny two surfaces in the same horospherical leaf are horizontally equivalent. \n\n\n\nIt suffices to show this upstairs; that is, we let , ' ∈_m with ' ∈^uu(), let f: S → M_q and f': S → M_q' be marking maps representing , ' and show that f' ∘ f^-1 gives a bijection of horizontal saddle connections. We first discuss ' ∈^uu() which are sufficiently close to . Let f: S → M_q be a marking map representing  and let σ_1, …, σ_r be the horizontal saddle connections on M_q. Using  a neighborhood 𝒰_τ corresponding to a fixed triangulation τ of S, we see that there is a neighborhood 𝒰 of  such that for any surface ' ∈𝒰, represented by f': S → M_q', the paths f'∘ f^-1(σ_i) are represented by saddle connections on M_q'. Furthermore, if ' ∈𝒰∩^uu() then these paths are horizontal saddle connections, so that f' ∘ f^-1: M_q → M_q' is a homeomorphism mapping the horizontal saddle connections of M_q injectively to horizontal saddle connections on M_q'.\n\nNow choose _max∈^uu() so that it has the maximal number of horizontal saddle connections. We will show that the set 𝒱 of surfaces in ^uu() which are horizontally equivalent to _max is open and closed, and this will conclude the proof. By the preceding discussion, 𝒱 is open in ^uu(). Furthermore, if _n →_∞ is a convergent sequence of surfaces in ^uu(), with _n ∈𝒱, then the horizontal saddle connections on the surfaces M_q_n have length bounded uniformly from above and below, and so converge to paths on M_q_∞ which are represented by horizontal saddle connections or by finite concatenations of horizontal saddle connections. Thus _∞ has at least the same number of saddle connections as _max, and so, by maximality, _∞∈𝒱. This completes the proof. \n\n\n\nFrom Proposition <ref> we deduce: \n  \n\nIf ν is an ergodic horospherical measure then there is a subset ' ⊂ of full ν-measure such any two surfaces in ' are horizontally equivalent. \n\n\n\nIn <cit.>, using boundary marked surfaces, topological horizontal equivalence is  introduced. In this definition the homeomorphism M_q → M_q' is required to preserve additional structure, e.g. the angular differences between saddle connections at each singular point. Proposition <ref> and Corollary <ref> hold for this finer notion of equivalence as well.  \n\n\n\n\n  \n\n\n\n\n\n\n\n§ SADDLE CONNECTION FREE HOROSPHERICAL MEASURES\n \nIn this section we will prove Theorem <ref>. We first state and prove some auxiliary statements.\n\n\n\n §.§ The Jacobian distortion in a box\n\n\nThe different plaques in a box can be compared to each other using the structure of a box. Namely, let φ: →⊂ L^(1) be a box. For any point y ∈ U_ we define\n\n    φ_y: U'_→_y,     φ_y([x] ) φ([x],y),\n \nwhere _y is the plaque of y in  (see Definition <ref>). \n\nFor any two points y_0 and y_1 in U_, the map φ_y_0,y_1φ_y_1∘φ_y_0^-1 is a diffeomorphism between the plaques _y_0 and _y_1 in B, identifying points parameterized by the same point in U'_. Define\n\n    δ_y_1 : _y_0→,    δ_y_1 ( ) ⟨ x_, y_1 ⟩^-(),\n\nwhere x_ = π_∘(). The diffeomorphism φ_y_0,y_1 is not measure preserving. Instead, we have the following: \n\n (Jacobian calculation) \nFor any two points y_0, y_1 ∈ U_ we have\n\n\n    (φ_y_0,y_1)^∗(|__y_1) = δ_y_1·(|__y_0).\n\n\n\n\n \nFor any y ∈ U_, write \n\n    L̅_y π_∘ (_y),\n\nwhere π_ is the projection in (<ref>). Then L̅_y is an open subset of an affine hyperplane in V_, which is a translate of\n\n    {x ∈ V_: ⟨ x, y ⟩ =0}.\n\nBy Definition <ref> the map\n\n    F: L̅_y →_y,     F(x ) φ([x], y)\n\nis a diffeomorphism with inverse π_∘. We denote by e_ the Euler vector field on V_. Notice that F^* β_ is the restriction to L̅_y of ι_e_η_. Indeed, we calculate\n\n    F^* β_ = F^* ι_E (π_∘^* η_)  =  F^* (π_∘) ^* (ι_e_η_) = ι_E_ (η_).\n\nThe map F gives a chart of _y in which β_ is  ι_e_η_.  We shall perform our calculation in these charts and verify (<ref>) in L̅_y instead of L_y. Let y_0, y_1 ∈ U_, and set\n\n    h: L̅_y_1→,       h(x) 1/⟨ x, y_1 ⟩.\n\nThe map φ_y_0, y_1 : L_y_0→ L_y_1 is expressed in charts simply as the map \n\n    φ̅_y_0, y_1: L̅_y_0→L̅_y_1,   φ̅_y_0, y_1(x) =  h(x)   x.\n\nThis implies by the multivariable product rule that\n\n    (D φ̅_y_0, y_1)_x(v) = h(x)   v + (Dh)_x(v)   x.\n\nHence, for v_1, …, v_d-1 in the tangent space to L̅_y_0 at x, denoting n = () we have:\n\n    ((φ̅_y_0, y_1)^* ι_e_η_x )_x (v_1,… , v_d-1)  \n     =     (ι_e_η_x)_φ̅_y_0, y_1(x)(D_xφ̅_y_0, y_1(v_1), …, D_xφ̅_y_0, y_1(v_d-1) ) \n    \n        =    (η_)_h(x)x (h(x)x, h(x)v_1 + D_xh(v_1)   x, …, h(x)v_d-1+ D_xh(v_d-1)   x)\n     \n        =   (η_)_h(x)x (h(x)x, h(x)v_1,…,h(x)v_d-1 ) =h(x)^n (ι_e_η_)_x(v_1,…,v_d-1).\n\nThis is Formula  (<ref>). \n\n\nNotice that for any y_0,y_1 ∈ U_ and [x] ∈ U_', we have \n\n    δ_y_1∘φ_y_0([x]) = ( ⟨ x, y_0⟩/⟨ x, y_1⟩)^().\n\nThis leads us to define the distortion of  as follows: \n\n    δ_sup{|1 - (⟨ x, y_0 ⟩/⟨ x, y_1 ⟩) ^d | : [x] ∈ U'_,   y_0, y_1 ∈ U_}.\n \n\n \nThe quantity ⟨ x, y_0⟩/⟨ x, y_1⟩\nhas the following geometric interpretation. The points φ([x],y_0) and φ([x],y_1) are in the same weak stable leaf, and this leaf is further foliated by strong stable leaves. The geodesic flow maps a given weak stable leaf to itself, permuting the strong stable leaves inside it. The choice t = log(⟨ x, y_0⟩/⟨ x, y_1⟩) is the value of t∈ for which g_t maps φ([x], y_0) to the strong stable leaf of φ([x], y_1).  \n\n\n\n\n\nThe distortion can be used to bound the variation of the mass of the horospherical plaques of  with respect to the measures ν_. Indeed, by an easy change of variables, using φ_y_0,y_1 we have  \n\n    |  (_y_1) - (_y_0) | ≤δ_ (_y_0).\n\nFrom this it follows that\n\n    | (_y_1)/(_y_0) - 1 | ≤δ_.\n\n\nThe distortion of a box is well-behaved with respect to the geodesic flow. For t ∈ and any  in π^-1(), we write\n\n    _t  g_t()     and   B_t π(_t).\n\n\n\nLet  be a box in π^-1(). Then _t is a box with δ__t = δ_ and it is regular whenever  is.  \n\n\n Let φ: U'_× U_→ L^(1) be the parametrization of , where L is an irreducible component of π^-1() and let U̅_ be the image of U_ under multiplication by e^-t, and let φ̅ ([x], y)  g_t ∘φ ([x], e^ty). Using the fact that the geodesic flow preserves the splitting into stable and horospherical foliation, and acts on V_ by multiplication by e^-t, we see that φ̅: U'_×U̅_→ L^(1)_1 is a parameterization of _t as in Definition <ref>. Also, for i=0,1,  if ([x], y̅_i) ∈ U'_×U̅_, where y̅_i = e^-ty_i, then\n\n    ⟨ x, y̅_0 ⟩/⟨ x, y̅_1 ⟩ =\n    ⟨ x, y_0 ⟩/⟨ x, y_1 ⟩.\n\n\nThis implies that the distortion of  is the same as the distortion of _t. \n\nThe last statement simply follows from the fact that the actions of  and (S,Σ) commute. \n\n\n\n\n\n §.§ Thickness of a box\n \nWe now introduce the notion of the thickness of a box.\n\n\n\n      \nTo define this quantity we use the sup-norm Finsler metric of <ref> to induce a distance function on leaves of the stable foliation. We rely on work of Avila and Gouezel <cit.>, who defined a similar distance function on the leaves of the strong stable foliation.\n\n\nFor a subset of a stable leaf, we denote by diam^(s) its diameter with respect to the distance function dist^(s).  We define the thickness of the box  as\n\n    τ_[x] ∈ U'_supdiam^(s) φ( {[x]}× U_) ;\n\nthat is, the maximal diameter of a plaque for the stable foliation. \n\nWe will need boxes whose thickness is also well-behaved under the geodesic flow. Similarly to Proposition <ref>, we have: \n\nFor any >0 and any ∈π^-1(^(1)), there is a regular box  in π^-1() containing  such that for any t≥ 0, τ__t≤.  \n\n\n\nIn the thickness discussion we would like to know\n  that under the forward geodesic flow lengths of paths in the leaves\n  of the weak stable foliation do not grow when we apply the geodesic\n  flow. AG prove this for the strong stable foliation. (Recall the\n  confusing notation remark.) We also know (AG) that the lengths of\n  geodesic paths do not grow. To connect two points in a weak stable\n  leaf we can concatenate a weak stable path and a geodesic path. The\n  length of this path is an upperbound for distance. If our boxes have\n  controlled diameter in both the strong stable direction and the\n  geodesic direction we can show that the lengths of weak stable paths\n  do not grow under the geodesic flow. Observe that the “geodesic\n  width\" is bounded by |log⟨ x, y_0  ⟩/⟨\n   x,  y_1  ⟩| (see previous “geometric interpretation\") so in\n  fact we have already bounded it in the discussion giving a bound for\n  δ. \n\nConnection between d^s and d: d≤ d^s and if\n  both are small they are comparable in size for points in the strong\n  stable manifold. It follows from AG Prop. 5.3 that distance less\n  than 1/25 implies distortion less than 2. \nadd the above discussion to the proof of Prop. 4.2.\n\n\n\n\nLet L be a lift of  that contains  and let Γ be the stabilizer in (S,Σ) of . Since (S,Σ) acts properly discontinuously on , there is a neighborhood  containing  such that for any γ∈(S,Σ), either ·Γ∩ = ∅ or γ∈Γ. By Lemma <ref>, let ⊂ be a box containing  and let φ̅ :  U̅'_×U̅_→ be the parametrization of . Let () = (x_0, y_0), let Û'_ be a neighborhood of [x_0] whose closure is contained in U̅'_, and let\n\n\n    𝐂φ_1(Û'_×{y_0}).\n\nThat is, 𝐂 is a bounded subset of a horospherical leaf, contained in a plaque of , and with closure in the interior of . Let _1 ∈ (0, /4) be small enough so that \n\n    𝐂_1 ⋃_|t| ≤_1g_t (𝐂) ⊂,\n\nand let _2 ∈(0, /4) such that \n\n    𝐂_2 ⋃__1 ∈𝐂_1{_2 ∈^ss(_1)  : dist^(ss)(_1, _2) < _2 }\n\nis contained in . Such numbers _1, _2 exist because 𝐂 is bounded, and 𝐂_2 contains a neighborhood of . We can therefore let U'_⊂Û'_ and U_⊂U̅_ be small enough open sets so that = φ̅ (U'_× U_) contains  and is contained in 𝐂_2. Since  is contained in , we may replace  by ∩_γ∈Γ·γ and we can assume that  is regular, with stabilizer Γ. \n\nFor ∈, let ^s() be the plaque through  for the weak stable foliation, that is, the connected component of  in ∩^s(). For each _2 ∈ there is a point _0, which is the unique point in the intersection 𝐂∩^s(_2), and a path from _0 to _2 which is a concatenation of two paths γ_1 and γ_2. The path γ_1={g_t_0 : t ∈ I } from _0 to _1 goes along a geodesic arc, where I is an interval of length at most _1. The path γ_2 from _1 to _2 has sup-norm length at most _2 and is contained in ^ss(_2). Since _1, _2 < /4, each point in any stable plaque in  is within distance at most /2 from the unique point at the  intersection of this plaque with 𝐂, where the distance is measured using the distance function dist^(s). Concatenating such paths we see that the diameter of any stable plaque in  is at most , and this implies the same bound for stable plaques in B. That is, the thickness of B is less than . By Proposition <ref>, the lengths of geodesic paths and of paths in strong  stable leaves, do not increase when pushed by g_t for t ≥ 0. Thus the same argument (using the pushes of γ_1 and γ_2 by g_t) give the required upper bound on the thickness of _t. \n\n\n\nFor a compactly supported continuous function f on , we denote by ω_f its continuity modulus with respect to the sup-norm distance function. That is, ω_f(t) →_t → 0+0 and \n\n    |f(q_1) - f(q_2)| ≤ω_f(dist(q_1, q_2))     for any  q_1, q_2 ∈.\n\n\nThe following key lemma says that for any horospherical measure ν, any regular box  and any test function f, the integral of f with respect to ν|_B can be approximated by the integral of f ∘π with respect to  on any one horospherical plaque of , provided that  has small distortion and small thickness.  We recall that B ⊂ is defined as the image of  by π. \n\n\nLet ν be a horospherical measure, let f ∈ C_c (^(1)) and let  be a regular box such that ν(B)>0. Then for any y ∈ U_,\n\n\n    | 1/ν(B)∫_B f   dν - 1/(_y)∫__y f ∘π d| ≤ω_f(τ_) + 2f_∞δ_.\n\n\n\n\nFor y, y'∈ U_, let φ_y, y' : _y →_y' be as in <ref>. On the one hand, for any y' ∈ U_ we have\n\n    | ∫__y' f ∘π  d  - ∫__y' f ∘π∘φ_y',y  d|     ≤∫__y'| f ∘π -f ∘π∘φ_y',y|   d\n       ≤ω_f(τ_)(_y').\n\n\nThe second inequality follows from the fact that, by definition of the thickness, for any [x] ∈ U'_, the distance between the points φ([x]) and φ(φ_y',y([x])), with respect to the distance function dist^(s), is at most τ_ and thus also with respect to the distance function dist, together with the fact that π is a contraction.\n\nOn the other hand, by the definition of δ_, we have:  \n\n\n    | ∫__y' f ∘π∘φ_y',y  d  - ∫__y f ∘π  d|    =  | ∫__y f ∘π  dφ_y,y'^∗ - ∫__y f ∘π  d| \n       ≤f_∞δ_(_y).\n\n\nThe last inequality follows from Proposition <ref> and the definition of δ_B. Using equation (<ref>) we deduce that for any y,y'∈ V_,\n\n    | 1/(_y')∫__y' f ∘π  d  -\n         1/(_y)∫__y f ∘π  d|\n       ≤ω_f(τ_) + 2f_∞δ_.\n\n\nLet y_0 ∈ U_ and let λ be a  measure on U_ as in\n(<ref>). Notice that ν(B) = ∫_U_(_y) dλ(y). Therefore\n\n    | 1/ν()∫_ f  dν -\n          1/(_y_0)∫__y_0 f ∘π  d| \n    ≤   | 1/ν()∫_U_( ∫_L_y f ∘π  d) dλ(y) - 1/(_y_0)∫__y_0 f ∘π  dν_|  \n    ≤   1/ν(B)∫_U_(_y) | 1/(_y)∫__y f ∘π  d  - 1/(_y_0)∫__y_0 f ∘π  d|  dλ(y) \n    ≤   ω_f(τ_) + 2f_∞δ_.\n\n\n\n\n\n §.§ Mixing of geodesics, nondivergence of horocycles\n\nWe recall the following useful results: \n\n\n \nFor any ε>0 and c>0 there is a compact K ⊂^(1) such that for any q ∈^(1), one of the following holds: \n\n\n    \n  * T →∞liminf 1 /T∫_0^T 1_K(u_s  q)   ds> 1 - ε (where 1_K is the indicator of K). \n    \n  * The surface q has a horizontal saddle connection of length smaller than c. \n\n   \n\n\n\n\nLemma <ref> will be used at several places in this text. The first fact we deduce from it is the following:  \n\n\n Let ν be a saddle connection free horospherical measure and let δ>0. Then there is a regular box ⊂π^-1(), a constant c>0 and an unbounded increasing sequence of times t_i such that:\n\n\n    \n  *  For all i ≥ 0, ν(_t_i) > cν (), where _t_i = π(_t_i).\n    \n  *  Both the thickness and distortion of each _t_i are smaller than δ. \n  \nIn particular it follows from (a) that ν is finite. \n\n\n\nLet K be a compact subset as in Lemma <ref> for ε = 1/2, c=1, and denote ν_t  (g_-t)_∗ν. By Proposition <ref>, ν is U-invariant, and since g_t normalizes U, the same holds for ν_t. An application of a generalisation  of the Birkhoff ergodic theorem for locally finite measures (see <cit.> for a general formulation) to the function 1_K shows that there is a function f ∈ L^1(ν_t) such that f_L^1(ν_t)≤1_K_L^1(ν_t) = ν_t(K) and for ν_t-almost every q ∈^(1), \n\n    1/T| { s ∈ [0,T] :  u_s  q ∈ K}| T →∞⟶ f(q).\n\n\nSince the {g_t}-action preserves the property of having horizontal\nsaddle connections, ν_t is also saddle connection free and thus by\nLemma <ref>,  we have almost surely\nf(q)>1/2. As a consequence,\n\n    ν_t(K) ≥∫_ f   dν_t >ν_t()/2.\n \n\nFor every δ>0, using Proposition <ref>, K ∩^(1) can be covered by the image by π of regular boxes _1, …, _N whose distortion is smaller than δ, and for which the thickness of g_t(_j) is smaller than δ, for each j and each t ≥ 0. By Lemma <ref>, the distortion of g_t(_j) is also less than δ for each j and each t ≥ 0. Let c 1/2N. For each t, there is j=j(t) ∈{1, …, N} such that\n\n    ν_t(B_j ) ≥ν_t(K) /N> c  ν_t().\n\nLet t_i\n→∞ be a sequence along which j = j(t_i) is constant. Then <ref> and <ref> hold  for = _j. \n\n\n  \nFor any invariant subvariety , the geodesic flow is mixing with\nrespect to the special flat measure on \n^(1). \n\n\n\nFor a proof and detailed discussion of this result and its\nquantitative strengthenings, see\n<cit.> or <cit.>. \n\n\n\n\n §.§ Putting it all together\n\nWe have gathered all the ingredients needed to give the proof of our\nmain result.  \n\n\nLet ν be a horospherical measure. We assume first that ν is ergodic for the horospherical foliation. We will show that the special flat measure m_ is absolutely continuous with respect to ν. To see this, let A be a Borel set of positive measure for m_. Since m_ is a Radon measure, in particular inner regular, there is a compact K contained in A such that m_(K) > 0. Let U be an open set that contains A and let  f:^(1)→ [0,1] be a continuous function whose support is contained in U and that evaluates to 1 on K. Such a function exists by Urysohn's Lemma. Let ε >0, and choose δ>0 so that\n\n\n    ω_f(δ) + 2f_∞δ < .\n\n\nBy Lemma <ref>, there is c>0,  a regular box  and t_i →∞ such that\nfor each i, τ__t_i < δ and δ_ < δ, and ν(B_t_i) ≥ c ν (). Applying Lemma\n<ref> to both  ν and m_ we obtain\n\n\n    | 1/ν(B_t_i)∫__t_i f  dν -1/m_ (_t_i)∫_B_t_i f  dm_| <2ε.\n\n\nBy mixing of the geodesic flow with respect to m_, there is i>0 large enough such that m_(B_t_i∩ K) > m_(B) (m_(K) - ε). Therefore: \n\n\n    ν(U)/c  ν(^(1))≥   ν(U)/ν(_t_i)≥1/ν(_t_i)∫__t_i f   dν\n      \n         >    1/m_(_t_i)∫__t_i f   dm_ - 2ε\n    ≥   m_(_t_i∩ K)/m_(_t_i) -2ε > m_(K)-3ε.\n \nSince ε was chosen arbitrarily, we have proven  ν(U)\n≥ c  ν ()   m_(K). We deduce by inner regularity of the\nmeasure ν that ν(A) is positive. This completes the proof that m_≪ν.\n\nIt follows from Proposition <ref> that m_ = cν for some c ≥ 0, and since m_ is nonzero, c>0 and ν = 1/c m_.  For general ν, we obtain from the case just discussed  that all the ergodic components of the measure ν are proportional to the special flat measure and thus ν itself is proportional to the special flat measure. \n\n\n\n\n\n\n§ EXAMPLES OF HOROSPHERICAL MEASURES\n\nThe simplest example of a horospherical measure which is not the special flat measure occurs when  is a closed -orbit. In this case the leaves of the horospherical foliation are the U-orbits, and the length measure on a closed periodic U-orbit is a horospherical measure; indeed, in this case, the transverse measure λ in (<ref>) is atomic.\n\nIn order to obtain more complicated examples, we use the following:\n\n\nLet W^uu(q) be a closed horosphere in . Then W^uu(q) is the support of a horospherical measure ν whose lifts are the measures ν_,^L where L is a lift of  and π() = q.   \n\n  \n\nThe horosphere W^uu(q) is closed if and only the collection {^uu() } is locally finite, where  ranges over π^-1(q) and L ranges over the lifts of  that contain . Each of the ^uu() carries the Radon measure ν_,^L and the measure \n\n    ν̃∑ν_,^L\n\nis a (S,Σ)-invariant Radon measure on π^-1(). Let ν be the Radon measure on  whose lift is ν̃ (see Proposition <ref>). The measure ν is horospherical by construction. \n\n\n\n\nTo construct an example of a closed horosphere, we use horizontally periodic surfaces, i.e., surfaces which can be represented as a finite union of horizontal cylinders. Let = ℋ(1,1). This stratum is an invariant subvariety of dimension 5, and thus its horospherical leaves have real dimension 4. Let a,b be real numbers with a, b  ∈ (0,1) and 0 < b < min(a, 1-a), let τ_1, τ_2 ∈𝕊^1  /ℤ,  and set τ̅_1   aτ_1 and τ̅_2  (1-a)τ_2, so that τ̅_1, τ̅_2 take values in circles of circumference a, 1-a respectively. Define the surface q=q_a,b, τ_1, τ_2∈ by the polygonal representation shown in Figure <ref>. In the horizontal direction it is comprised of two cylinders, each of height 0.5, and of areas 0.5a and 0.5(1-a). The parameters τ_1, τ_2 are called twist parameters. Changing them by adding an integer amounts to performing the corresponding number of Dehn twists in the two cylinders, and thus does not change the surface q.\n\n\n\nIt is clear that varying  the parameters a, b, τ_1, τ_2 results in surfaces that belong to the horospherical leaf of q, and thus, by a dimension count, they locally parameterize the leaf of q. In either of the cases b→ 0, b →min(a, 1 a), the surface q_a,b, τ_1, τ_2 has shorter and shorter horizontal saddle connections on the boundaries of the cylinders, and thus exits compact subsets of ^(1). This means that the horosphere W^uu(q) is closed and that the map \n\n    𝕊^1 ×𝕊^1 ×{(a,b) ∈ (0,1)^2  :  0<  b < min(a, 1-a)}→^(1)   (a,b,τ_1, τ_2) ↦ q_a,b,τ_1, τ_2\n \nis a proper homeomorphism onto W^uu(q).\n\nIt can be checked that in this case the map (a,b, τ̅_1, τ̅_2)\n↦(q_a,b,τ_1, τ_2 ) is affine in charts. Thus the horospherical measure can be written explicitly (up to scaling) as  dν(q_a,b,τ_1, τ_2) =  da   db   dτ̅_1   dτ̅_2. \n\n\nFor the horospherical measure constructed in the preceding example, the space Z_ (defined in (<ref>) is one dimensional, and for every surface q in  the support of this measure, Z^(q) (defined in (<ref>)) is a bounded interval. Moreover, for any v ∈ Z_ there is a positive measure set of surfaces q (with small values of a) for which _v(q) is not defined. This shows that the hypothesis in Proposition <ref>, that _v(q) is defined, is not always satisfied.\n\n\n\nIt is no coincidence that the closed horopsheres in the two preceding examples consist of horizontally periodic surfaces. \n\n\nFor any  and any q ∈, the surface M_q is horizontally periodic if and only if  W^uu(q) is closed. In this case every surface in W^uu(q) is horizontally periodic, and the horospherical measure on W^uu(q) constructed in Proposition <ref> is finite. \n\n\n\nSuppose first that M_q is horizontally periodic, and let f: S → M_q be a marking map representing ∈π^-1(q). Let C_1, …, C_s be the horizontal cylinders on M_q, and let c_j, h_j denote respectively the circumference and height of C_j. Since the area of M_q is one,\n\n    ∑_j=1^s  c_j h_j =1.\n\n\nLet α_1, …, α_r, α_r+1, …, α_s  ∈ H_1(S, Σ) be a generating set satisfying the following:\n\n\n    \n  * The collection {f(α_i): i =1, …, r+s} consists of saddle connections.\n    \n  * {f(α_i): i = 1, …, r}, are all the horizontal saddle connections on cylinder boundaries, and are oriented from left to right.\n    \n  * For j = 1, …, s, f(α_r+j) is contained in C_j, connects one boundary component of C_j to the other, and is oriented from bottom to top. \n\n\nWrite the holonomies (M_, α_i) as \n\n\n    (M_, α_i) =     (t_i, 0)    i =1, …, r \n    (M_, α_j) =     (τ_j, h_j)    j=1, …, s.\n\n  For each j and each boundary component of C_j, we\n  have\n  \n    ∑_i ∈ℐ t_i = c_j,\n\n  where ℐ is\n  a subset of {1, …, r} containing the saddle connections\n  comprising the boundary component. The numbers t_i, h_j, τ_j\n  also satisfy some linear equations L_1, …, L_t, which\n  describe the space that L is modeled on, in a neighborhood of . \n\nLet ' ∈^uu(). We first show that the underlying surface\nM_q' is horizontally periodic. There is a continuous path σ↦(σ), \nwith (0) = and (1)=', such that (σ) ∈^uu() for\nevery σ∈ [0,1]. \nBy definition of the horospherical foliation, for any σ∈ [0,1],\n((σ)) - () ∈ H^1(S, Σ; _). \nThat is to say, there are t_1(σ), …, t_r(σ), τ_1(σ),\n…, τ_s(σ) ∈ such \nthat (<ref>) holds for (σ). Note that\nh_j is independent of σ, that the numbers t_i(σ),\nh_j, τ_j(σ) also\nsatisfy the equations L_1, …, L_t, and that the numbers\nc_j(σ) defined by (<ref>) also satisfy\n(<ref>).\n\nAssume first that\n\n    t_i(σ)>0     for all σ∈ [0,1]   and \n    i ∈{1, …, r}.\n\nFor each j ∈{1, …, s}, the\nset\n\n    {σ∈ [0,1] :  the curve  α_r+j\n      crosses a horizontal cylinder on (σ) }\n\nis open (this is a general property of cylinders, see e.g. <cit.>) and \nclosed (since the heights h_j are fixed). Therefore, by a connectedness\nargument, ' is also made of s horizontal cylinders. By \n(<ref>), these \ncylinders occupy the entire area of (σ), and thus (σ) is\nhorizontally periodic. \n\nNow if (<ref>) fails, let σ_min be the\nsmallest value of σ for which it fails. When σ increases to\nσ_min from below, the surfaces (σ) have shorter and shorter\nhorizontal saddle connections on the boundaries of cylinders, and this\nmeans that the surfaces (σ) cannot converge to (σ_min). This shows that (<ref>) holds and\nproves that all surfaces in ^uu() are horizontally periodic. \n                           \n\n\n\n\n  \nAs\nlong as there are numbers c'_i satisfying (<ref>),\nand numbers t'_i>0 satisfying the equations (<ref>) (with\nc_i, t_i replaced by c'_i, t'_i), there is a surface M_' made\nof s cylinders with circumferences c'_j, heights h_j, glued in\nthe same way that they are glued on M_. Clearly we then have '\n∈^uu().\n\nFlorent asks whether injectivity of the developing map\n  is implicitly being used here. Also there are more equations coming\n  from  that are missing.\n\n\nThe set of parameters t_i, τ_j giving surfaces in W^uu(q) is bounded. Indeed, the c_i defined by (<ref>) are bounded by (<ref>),  and this implies that the numbers t_i ∈ (0, max_j c_j) are bounded. Changing the τ_j by adding an integer multiple of c_j amounts to performing Dehn twists in the cylinder C_j and does not change the projection of the surface to . That is, the numbers τ_j  can be taken to lie in the bounded set [0, c_j ). Also, as the parameters t_i leave compact subsets of the bounded domain described above, at least one of the horizontal saddle connections on the corresponding surface has length going to zero. This implies that the bounded set of surfaces we have just described by varying the parameters t_i, τ_j projects to the entire leaf W^uu(q), that this leaf is properly embedded, and that all surfaces in this leaf are horizontally periodic.\n\nFurthermore, we can use (<ref>) to express c_1 as a function of c_2, …, c_s (a constant function when s=1), and using the linear equations defining L, we can write some of the variables c_j, τ_j, t_i as linear combinations of a linearly independent set of variables. We can then write the horospherical measure up to scaling as dν(q) = ∏_j=𝒥_1 dc_j   ∏_j∈𝒥_2 dτ_j  ∏_i ∈𝒥_3 dt_i, for some subsets of indices, and thus the preceding discussion shows that the total measure of the leaf is bounded.   \n\nNow suppose  that M_q is not horizontally periodic. According to <cit.>, the horocycle orbit Uq consists of surfaces that are not horizontally periodic, but there is q' ∈Uq such that M_q' is horizontally periodic. By Proposition <ref>, Uq ⊂ W^uu(q), and thus q' ∈W^uu(q). Since M_q is not horizontally periodic, according to the first part of the proof, q' ∉ W^uu(q). This shows that the leaf W^uu(q) has an accumulation point that is not contained in the leaf, which is to say that W^uu(q) is not closed. \n\n\n    \n\n\n §.§ Classification of horospherical measures in the eigenform loci in\n  (1,1)\n\nThe stratum (1,1) contains a countable collection of complex 3-dimensional invariant\nsubvarieties known as eigenform loci. This terminology is due to\nMcMullen, who gave a complete classification of these invariant\nsubvarieties in a sequence of papers (see <cit.> and references\ntherein), following the first such examples \ndiscovered by Calta <cit.>. The horocycle invariant measures and\norbit-closures for the U-action on an eigenform locus, were\nclassified in <cit.> (these classification results require Theorem\n<ref> of the present work). We can classify the\nhorospherical measures inside eigenform loci as follows: \n\n\n\n\nLet  be an eigenform locus in (1,1), and let ν be an ergodic horospherical measure on . Then either ν is the special flat measure m_ or ν is the measure given by Proposition <ref> on a closed horosphere W^uu(q) of a horizontally periodic surface q ∈. \n\n\n\nIf ν is saddle connection free then it is the special flat measure\nby Theorem <ref>, and by Proposition <ref>, ν is supported on a properly embedded leaf if and only if ν is supported on horizontally periodic surfaces. The only remaining possibilities are that for a set of positive measure, surfaces have one horizontal saddle connection or a horizontal slit, corresponding to cases (3), (4) or (6) of <cit.>. We assume that such a horospherical measure ν exists, and we will reach a contradiction. By Corollary <ref>, each of the conditions (3), (4), (6) is invariant under the horospherical foliation and so by ergodicity, one of these cases holds for ν-a.e. surface.\n\nLet f: supp ν→_+ be the function that assigns to a\nsurface the length of a horizontal saddle connection (note that in\ncase (3) there is a unique horizontal saddle connection and in cases\n(4) and (6) there are two of equal length).\nLet\n\n    _t  f^-1(t),       _c ≤ c' f^-1([c,c']),\n\nand let c'> c>0 such that ην(_c ≤ c')>0.\nLet K ⊂(1,1) be the compact set given by Lemma\n<ref>, corresponding to c and to 1/2. \nThe U-action preserves the lengths of horizontal saddle\nconnections, and thus preserves _c ≤ c'. The U-action also\npreserves ν, by Proposition <ref>. We\nclaim as in the proof of Lemma <ref> that \n\n    ν(K ∩_c ≤ c') ≥η/2\n\n(and in particular η is finite). Indeed, defining ν' ν|__c ≤ c', we have by the Birkhoff ergodic theorem that\nfor ν'-a.e. x,\n\n    1/T∫_0^T 1_K(u_sx)   ds ⟶_T →∞ f(x),\n\nwhere f is a function satisfying\n\n    f_L^1(ν')≤1_K_L^1(ν') = ν(K ∩_c ≤ c').\n\nBy Lemma\n<ref> we have f(x) ≥1/2 whenever the limit in\n(<ref>) exists, and this gives (<ref>). \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNow note that by Proposition <ref>, \nν is invariant under Rel deformations. In our context there are\nRel deformations which increase the lengths of saddle connections by an\narbitrary  fixed number. This implies that for every s>0,\n\n    ν(_c ≤ c') = ν(_c+s ≤ c'+s) .\n\nRepeating the arguments by which we obtained (<ref>)\nwe obtain for every s>0,\n\n    ν(K ∩_c+s ≤ c'+s) ≥η/2.\n\nFor s >c'-c, and j ∈,  the sets _c+js ≤ c'+js are\ndisjoint. This implies that\n\n    ν(K) ≥∑_j=1^∞ν(K ∩_c+js ≤ c'+j s)  =\n    ∞,\n\ncontradicing the fact that ν is a Radon measure. \n      \n    \n\n\n\n §.§ A further example in (2)\n\n  Since there is currently no classification of horospherical measures in (2),\n  it is of interest to give examples.\nIn this subsection we construct an ergodic horospherical measure which is not\nthe special flat measure and is not supported on one properly embedded\nhorospherical leaf. Its support is contained  in the four-dimensional\ninvariant subvariety = (2), the genus two\nstratum consisting of surfaces with one singular point of order two. \n\nRecall from Corollary <ref> that for a given\nergodic horospherical measure, almost all surfaces are horizontally\nequivalent. In Figure <ref> we\nshow a typical surface q for our horospherical measure, and a typical\ntopological picture of its horizontal\nsaddle connections. These saddle connections will be denoted by\nδ and δ'. They disconnect the surface into\na horizontal cylinder C, shaded gray in Figure <ref>,\nand a torus T. \n\n\n\n\n\n\n\n\n                           \nLet x be the length of δ and δ', let η be a saddle\nconnection passing from top to bottom of the cylinder C, and let its\nholonomy be (a, τ). Fix ∈π^-1(q). The height of C\nis constant and equal to a in a neighborhood of  in\n^uu(). The area of C is ax, and hence\n\n    0< x < 1/a.\n\nMoreover, changing τ by an integer multiple of x amounts to\nperforming a Dehn twist in C so does not change the surface\nM_q. Thus we \nmay take \n\n    τ∈ [0, x).\n\nWhen varying surfaces within their horospherical leaves, we change\nhorizontal components of all saddle connections, and thus changing\nτ and x we stay in the horospherical leaf. Similarly, by\nProposition <ref>, u_s'q ∈ W^uu(q) for\nevery s'.  Moreover, if M_q=C ∪ T as\nabove, the surface u^(T)_s M_q obtained by performing the\nhorocycle flow on T and leaving C unchanged is also in\nW^uu(q). \nIt is easy\nto check that changing the three parameters x,τ, s gives a linear\nmapping in period coordinates, and that the three corresponding\ntangent directions in  directions in T_q() are linearly independent. Since\n()=4, the dimension of the horospherical leaves in  is\nthree, so the variables x, τ, s give an affine parameterization of a neighborhood of\nq in W^uu(q).\n\n\n\nSince the height a of C remains constant in W^uu(q), by (<ref>), (<ref>), the variables x,τ take values in the\nbounded domain\n\n    Δ{(x,τ): 0 ≤τ < x < 1/a}.\n\nWe construct a bundle ℬ with base Δ, and a homogeneous space\nfiber, as follows.\nLet  Tor G/_2(ℤ), the space of tori of\nsome fixed area. This area is usually taken to be one, but by\nrescaling, can be taken to be any fixed number. For each x ∈(0, 1/a), let \nTor(x) denote the space of tori of area 1-ax and with an\nembedded horizontal segment of length x. This is the complement in\nTor of a closed set with empty interior (consisting of\nperiodic horocycles of period at most x). Define ℬ to be \nthe bundle with base Δ and such that the fiber \nover (x, τ) ∈Δ is Tor(x).\n\nLet  \nμ be the G-invariant probability measure on\nTor. Since the set of surfaces which do not admit an\nembedded horizontal segment of some length is of μ-measure zero,\nwe can also think of μ as a probability measure μ_x on\nTor(x). \nFor  (x, τ) ∈Δ let C = C(x,τ) be a\ncylinder  of height a, circumference x and\ntwist τ. We have a map \n\n    Ψ: ℬ→ℋ(2)\n\ndefined by \ngluing the torus T from Tor(x), with a slit of length x, to the\ncylinder C(x, τ). Let\n\n    ν∫_0^1/a∫_0^x\n    Ψ_*(μ_x)   dτ  dx.\n\nThe image Ψ(ℬ) is a five-dimensional properly embedded\nsubmanifold of , consisting of all surfaces that can be presented \nas in Figure <ref> for some fixed choice of a>0. Along\nany sequence of elements  \n(x,τ) ∈Δ leaving compact subsets, we have either x → 0\nor the area 1-ax of T goes to zero, and in both cases the surfaces in\nthe image of Ψ have short saddle connections. This shows that\nΨ(ℬ) is properly embedded. Since ν is\ninvariant under translations \nusing the affine coordinates x,τ,s, it is a finite\nhorospherical measure supported on Ψ(ℬ). \n\n\nWe now claim that any measure\nν which is strong-stable invariant \nand ergodic, with Ξ(ν) of type D, is the above measure up to\nmultiplication by a scalar. \nTo see this, note that the number a = a(M) described\nabove for a surface M ∈ℋ(2) with Ξ(M) of type D, is\na function on supp ν which is fixed on strong stable leaves,\nso is constant. So we may assume it takes a fixed value a for ν\na.e. surface. Let\nℒ_a be the subset of ℋ(2) consisting of\nsurfaces with Ξ(M) of type D, and a(M)=a. Then one can show\nusing the above discussion that ℒ_a\nis the image of the set of parameters x, τ, M, where x and\nτ satisfy (<ref>), (<ref>) and M ∈Tor(1-ax,x). Moreover this set of parameters embeds\nproperly, i.e. one goes to infinity in ℒ_a ⊂ℋ(2) exactly when x goes to either 0 or 1/a, or M\ngoes to infinity in Tor(1-ax,x). So the functions assigning\nto a surface its parameters x, τ are well-defined functions, let\nℒ_a,x,τ be the level sets of such a function,\ni.e. the subset of ℒ_a with coordinates x, τ two\nfixed numbers. Then the measure ν decomposes into conditional\nmeasures on each ℒ_a,x,τ which are invariant under\nthe intersection of the strong stable leaf with this set. As discussed\nabove, each ℒ_a,x,τ is the pre-image of\nΨ_x,τ, i.e. is Tor(1-ax,x), and so ν\ndecomposes into horocycle invariant measures on each\nTor(1-ax,x). By Dani's measure classification <cit.>,\nthis measure is either ν(x,τ) or a measure supported on a\nclosed horocycle. But the surfaces with closed horocycles have\nadditional horizontal saddle connection so, since Ξ(ν) is of\ntype D (not F), we cannot assign positive mass to closed horocycles in\na positive measure's worth of Tor(1-ax,x). So the measure\nν decomposes into the measures ν(x,τ), and by invariance\nunder the flows in direction x and τ, are equal to the measure \n ∫_0^1/a∫_0^x f(x)\ndν(x,τ)   dτ  dx up to a constant factor. \n\nTo discuss orbit closures use a similar analysis, using Dani-Smillie\n<cit.> in each Tor(1-ax,x) instead of \n<cit.>. The orbit closure is ℒ_a. \n\n\n\n\n\n§ THE GEODESIC FLOW AND WEAK UNSTABLE FOLIATION\n\n\nLet ν be a horospherical measure that is invariant by the geodesic\nflow. We will assume that ν is ergodic and is not equal to the\nspecial flat measure, and prove that ν=0. By Theorem <ref>, ν-a.e\nsurface in ^(1) has a horizontal saddle connection. Denote by f the\nmap that maps a surface to the length of its shortest  horizontal\nsaddle connection. Using Lemma <ref> as in the proof of Theorem\n<ref>, we have that for any c>0, \n\n    ν(_≥ c) <∞,     where _≥ c f^-1([c,∞)).\n\nSince ν( ⋂_c' ≥ c_≥ c')= 0, this implies\n\n    ν(_≥ c')  ⟶_c' →∞ 0.\n \nThe geodesic flow expands the horizontal direction, and hence \n\n    g_t (_≥ c)= _≥ ce^t.\n\nBy invariance of the measure ν under the A-action, we obtain\nthat ν(_≥ c ) = ν(_≥ ce^t )\n→ 0, and hence ν(_≥ c)=0 for any c>0. This implies ν\n=0.\n\n\nWe now show that any leaf for the weak-unstable foliation is dense. Let q ∈_1^(1), let U be an open set contained in ^(1) and let f be a nonzero non negative compactly supported function whose support is contained in U. In order to show U ∩ W^u(q) ≠∅ we will show that there is p ∈ W^u(q) such that f(p)>0. Let ε∫_ f  d μ_>0, let ω_f denote the continuity modulus of f with respect to the sup-norm distance function, and let ∈π^-1(q). Using Propositions <ref> and <ref>, let  be a regular box containing  such that for any t ≥ 0, the box _t  g_t() satisfies ω_f(τ__t) + 2f _∞δ__t < ε/4. Let m_ be the special flat measure on ^(1). By mixing of the geodesic flow (Proposition <ref>), there is T>0 such that for any t>T, we have  \n\n\n    | 1/m_()∫__t f   dm_ - ∫_f   dm_| < ε/4.\n\n\nApplying Proposition\n<ref> to the special flat measure m_, and denoting by _t the plaque of g_t in _t, we have \n\n\n    |1/m_()∫__t f   dm_ - 1/(_t)∫__t f ∘π d| < ε/4,\n\n\nand consequently\n\n    |∫_ f   dm_ - 1/(_t)∫__t f ∘π d | < ε/2.\n\n\nThis implies ∫__t f ∘π d > 0 and since π(_t) is\ncontained in W^u(q), we obtain that there is p ∈ W^u(q) such that f(p) >0. \n\n\n\n\n\n\n§ CLOSURES OF HOROSPHERICAL LEAVES\n\nThe goal of this section is to prove Theorem <ref>. First, in order to explain the idea, we will prove\nthe following weaker result.\n\n\n\n\nLet q ∈^(1) be a surface without horizontal saddle connections. Then W^uu(q) is dense in ^(1).  \n\n\n\nLet U be any open set contained in ^(1) and let f be a nonzero non-negative function whose support is contained in  U.  It is enough to show that there is p ∈ W^uu_q such that f(p)>0. Let ε∫_ f   dm_ >0, let c  1,  and let K be a compact subset as in Lemma <ref>. For any n>0, the surface g_-nq does not have horizontal saddle connections and thus there is s_n >0 such that p_n  u_s_n g_-n  q satisfies \n\n\n    p_n ∈ K ∩ W^uu(g_-n q).\n\n \nThe horocycle flow preserves the horospheres and the geodesic flow permutes them. As a consequence g_n p_n ∈ W^uu(q). Since K ∩_1^(1) can be covered by the image by π of finitely many arbitrarily small boxes, by passing to a subsequence and using Propositions <ref> and <ref>, we can assume that there is a box ⊂π^-1() such that the translates _n = g_n() satisfy ω_f(τ__n) + 2f_∞δ__n < ε/4  and p_n ∈π(), for all n ∈ℕ. Denote by _n a plaque of _n = g_n() whose image by π contains g_n(p_n). By mixing of the geodesic flow, for all large enough n:\n\n\n    | 1/m_()∫__n f   dm_ - ∫_f   dm_| < ε/4.\n\n\nIt thus follows from Proposition <ref> applied to the special flat measure m_ that\n\n\n    |1/m_(B)∫_B_n f   dm_ - 1/(_n)∫__n f ∘π| < ε/4 .\n\n\nConsequently, for large enough n, \n\n    |∫_ f   dm_ - 1/(_n)∫__n f ∘π| < ε/2,\n\n\nand thus\n\n\n    1/(_n)∫__n f ∘π > ∫_ f   dm_ - ε/2 > 0.\n \n \nThis implies that there is a p ∈π(_n) ⊂ W^uu(q) such that f(p) >0. \n\n\n\n\n\n  In order to upgrade Theorem <ref> to Theorem <ref>, we will need the following result:\n  \nLet   be an invariant subvariety and suppose that q ∈^(1)\nhas horizontal saddle connections, but is not horizontally\nperiodic. Then there is q' ∈ W^uu(q) \nsuch that all horizontal saddle connections on M_q' are longer than\nthe shortest horizontal saddle connection on M_q. If in addition\nM_q has no horizontal cylinders, then for any T>0  there is q' ∈ W^uu(q)\nsuch that the shortest horizontal saddle connection on M_q' is\nlonger than T.  \n    \n\n\n\n\nWe repeat the arguments given in the proof of Theorem <ref>. In that proof, the only place where we used the assumption that q has no horizontal saddle connections, is to ensure the existence of p_n satisfying (<ref>). For this, using Proposition <ref> and Lemma <ref>, it is enough to show that  there is q_n' ∈ W^uu(g_-nq) such that the shortest horizontal saddle connection in M_q'_n has length at least one. By our assumption, M_q has no horizontal cylinders and therefore neither does M_g_-nq, and thus we can conclude using the second assertion of Theorem <ref>.  \n\n\n \nLet q ∈_1^(1) be a surface with horizontal cylinders C_1, …, C_s. Its leaf-closure W^uu(q) can be described as a properly embedded bundle ℬ in ^(1), very similar to the one discussed in <ref>. We sketch the argument here. Any surface in q' ∈ W^uu(q) also has corresponding cylinders  C'_1, …, C'_s (see the proof of Proposition <ref>). Let c'_j, a'_j, τ'_j denote respectively their circumferences, heights, and twists. We have a'_j = a_j, that is the heights of the cylinders are the same on the surfaces M_q and M_q'. Arguing as in the proof of Proposition <ref>, the numbers c'_j, τ'_j belong to a bounded subset Δ⊂^2s. Let Δ_q be the subset of Δ describing cylinders that can arise for q' ∈ W^uu(q). This set is the base of ℬ. The fiber over c⃗, τ⃗∈Δ_q is described as follows.  Let q' ∈ W^uu(q) have cylinders C'_1, …, C'_s whose geometry is prescribed by c⃗, τ⃗, and  let q” be the surface obtained by removing the cylinders C'_1, …, C'_s and regluing the boundary components to each other by a translation. The translation in each cylinder is chosen so that singularities on opposite sides of a cylinder are not glued to each other. This surface can be alternatively described as the limit t → 0 of the cylinder stretch map g̅, for g=(  t     s \n 0     1), for some s  (see Proposition <ref>). The surface q” belongs to some invariant subvariety ”, independent of c⃗, τ⃗, in a lower dimensional stratum. It has no horizontal cylinders, so by Theorem <ref>, its horosphere is dense in ”. Note that the area of q” is not one and so we apply Theorem <ref> after rescaling. Thus the fibers of ℬ are all isomorphic to ”. As c⃗, τ⃗ leaves compact subsets of Δ_q, the corresponding surfaces have shorter and shorter horizontal saddle connections, and thus ℬ is properly embedded in .\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n§ EXTENDING SADDLE CONNECTIONS AND CYLINDERS (APISA AND WRIGHT)\n       \nIn this section we give the proof of Theorem <ref>. We need some auxiliary statements. A horizontal cylinder on a translation surface is a cylinder whose core curve is horizontal. We say that a cylinder and a saddle connection are disjoint if they do not intersect, except perhaps at singular points. Our convention is that cylinders are closed, and thus a cylinder and a saddle connection on one of its boundary components are not considered to be disjoint. \n\n\nWe recall the notion of -equivalence of cylinders, introduced in <cit.>.  Let  be an invariant subvariety, let q ∈ and let C_1, C_2 be two parallel cylinders in M_q. The cylinders are called -parallel if there is a neighborhood 𝒰 of q in , such that C_1, C_2 remain parallel for all q' ∈𝒰. More precisely: \n\n\n    \n  * there is a lift L of  and open 𝒱⊂ L and 𝒰⊂ such that q ∈𝒰, π|_𝒱: 𝒱→𝒰 is a homeomorphism and  is injective on 𝒱;\n    \n  * for ∈𝒱 with q = π(), represented by a marking map f: S → M_q, and for any ' ∈𝒱, represented by f': S → M_q', the sets f' ∘ f^-1(C_i),  i=1,2 are parallel cylinders on q' = π('). \n \nBeing -parallel is clearly an equivalence relation.\n\nFor a cylinder C on a translation surface M, we denote by G_C the subgroup of  fixing the holonomy of the core curve of  C. Clearly G_C_1 = G_C_2 if C_1, C_2 are parallel. If C_1, …, C_r are parallel on M and g ∈ G_C_1 then the cylinder surgery corresponding to g, C_1, …, C_r consists of applying g to the C_i and leaving the complement M ⋃_i=1^r C_i untouched. \nFor example if C is horizontal then the elements of G_C are of the form ( 1     s \n 0     t), with t>0. The cylinder surgery of such a matrix with t=1 consists of cylinder shears (with shear parameter s), and with s=0, consists of cylinder stretches (with stretch parameter t). By an appropriate conjugation, the definition of cylinder shears and stretches is extended to non-horizontal cylinders. \n\n\nWe have: \n\nFor , any q ∈, and an -parallel equivalence class of cylinders C_1, …, C_r on M_q, if g ∈ G_C_i then the surface  obtained from M_q by cylinder surgery corresponding to g, C_1, …, C_r is also in . \n\n\n\n\n \nSuppose q ∈ and C_1, …, C_r are -parallel cylinders on q, which are not necessarily a full equivalence class of -parallel cylinders. \nLet L be a lift of , let ∈ L ∩π^-1(q) and let V ⊂ H^1 ( S, Σ; ) such that (L)=V.  \nVarying g ∈ G_C_1 gives rise to a two dimensional collection (in the previous example, corresponding to possible choices of the parameters s,t) of surfaces, obtained from M_q\n by cylinder surgery corresponding to g, C_1, …, C_r. This collection is affine in period coordinates and its tangent direction is a one dimensional complex subspace of H^1 (S, Σ; ). A generator for this subspace is \n    σ_{C_i, h_i}∑_i=1^r h_i γ_i^*,\n\n where h_i is the height of C_i, γ_i is the core curve of C_i (considered as an element of H_1(S, Σ)) and γ_i^* is the dual class in H^1(S, Σ). Moving along the line tangent to σ_{C_i, h_i} in  amounts to performing cylinder shears in each of the C_i, and moving along the line tangent to 𝐢·σ_{C_i, h_i} in  amounts to performing cylinder stretches. \n \n Below we will be interested in such one-parameter families of deformations, tangent to σ_{C_i, h_i} as in (<ref>), in which the C_i might not be a full equivalence class of -parallel cylinders, and the h_i might not be their heights. Note that for cylinder shears, such surgeries are well-defined for any value of the shear parameter s, and for cylinder stretches, they are well-defined as long as t>0. \n \n \n When σ_{C_i, h_i}∈ V for , L, V as above we simply say that σ_{C_i, h_i} is contained in the tangent space to  at q.\n \n\n\n\n \n  \nIf  is an invariant subvariety and q ∈ is not horizontally periodic, then there is a nonempty collection of -parallel cylinders C_1, …, C_r on M_q which consists of cylinders disjoint from all horizontal saddle connections on M_q,\nand positive h_1, …, h_r such that the class σ_{C_i, h_i} as in (<ref>) is contained in the tangent space to  at q.\nFurthermore, there is A_0>0, depending only on , so that if q ∈ has no horizontal cylinders, one can choose a collection of cylinders with these properties, so that in addition, the sum of the areas of the cylinders is at least A_0. \n\n\nWe note that the h_i in Proposition <ref> might not be the heights of the C_i. The vector σ_{C_i, h_i} is tangent to the line in  obtained by applying different cylinders shears to each C_i. In order to formalize this, \n for g_i ∈ C_i for each i, we define the cylinder surgery corresponding to {C_i, g_i} to be the map obtained by applying g_i to each C_i, leaving the complement M ⋃_i=1^r C_i untouched. With this terminology, \nthe line tangent to σ_{C_i, h_i} is the collection of surfaces obtained by cylinder surgery corresponding to {C_i, g_i}, where s ∈ and  g_i performs a cylinder shear with parameter sh_i in C_i. Similarly, the line tangent to 𝐢·σ_{C_i, h_i} is the collection of surfaces obtained by cylinder surgery corresponding to {C_i, g_i}, where s ∈ and  g_i performs a cylinder stretch with parameter sh_i in C_i.\n\nSince the U-action is linear in charts,  preserves horizontal saddle connections, and maps -equivalent cylinders to -equivalent cylinders, preserving their area, the validity of both statements is unchanged if we replace q with some surface q'  in its horocycle orbit Uq. According to\n<cit.>, there is q_∞ in the closure of Uq which is horizontally periodic, and we will see that the required properties hold for all q' sufficiently close to q_∞. Let M_∞ be the underlying surface of q_∞, let C_1, …, C_r be the horizontal cylinders on M_∞, and for each i, A_i, c_i, h_i, γ_i denote respectively the area, circumference, height, and core curve of C_i. Here we consider γ_i as an element of H_1(S, Σ) by using a marking f: S → M_∞ corresponding to _∞∈π^-1(q_∞). By Proposition <ref>, σ_{C_i, h_i} belongs to the tangent space of  at q.\n\nFor any θ_0>0 there is a neighborhood 𝒰 = 𝒰(θ_0) of q_∞ in  such that  if q' ∈𝒰 then the underlying surface has r cylinders C'_1, …, C'_r of circumferences and areas satisfying\n\n\n    c'_i < c̅\n    2max_i=1, …, r c_i,     A'_i\n    > A1/2min_i=1, …, r A_i ,\n\nand with directions of core curves in (-θ_0, θ_0).\n\nIf C and σ are a cylinder and a straight segment on a translation surface, we say that σ crosses C if it intersects both of the boundary components of C (possibly at singular points). Since a cylinder contains no singularities in its interior, if a saddle connection intersects the interior of a cylinder, then it must cross it. Let s  be the maximal length of a horizontal saddle connection on M_q and let θ_0 be small enough so that a horizontal segment of length s cannot cross a cylinder of direction θ satisfying 0 < |θ| < θ_0, with circumference at most c̅ and area at least A. \n\nBy making 𝒰 smaller, so that it is an evenly covered neighborhood of q_∞, we can ensure that \nσ_{C'_i, h_i} belongs to the tangent space of  at q'. Indeed, if 𝒱 is a connected component of π^-1(𝒰) and ', _∞∈𝒱 are preimages of q', q_∞ respectively, then the core curves of the cylinders C'_i, C_i map to the same elements γ_i ∈ H_1(S, Σ) under the corresponding marking maps, and thus σ_{C'_i, h_i} = σ_{C_i, h_i}. \n\n\n\n\n\nNow suppose that q' ∈ Uq ∩𝒰, and let M' be the underlying surface. Since q is not horizontally periodic, neither is q'. Therefore there is an equivalence class C_1, …, C_r of -parallel cylinders on M_∞, so that the corresponding cylinders C'_1, …, C'_r are not horizontal cylinders on M', and satisfy the bounds (<ref>). Furthermore the maximal length of a horizontal saddle connection on M' is s, since the horocycle flow maps horizontal saddle connections to horizontal saddle connections of the same length. By choice of θ_0, the cylinders in this equivalence class are all disjoint from horizontal saddle connections on M'. This proves the first assertion.  \n\nLet t be an upper bound on the number of horizontal cylinders for a surface in  and let A_0 1/2t. The argument above works for any collection of -parallel cylinders C_1, …, C_r which are horizontal on q_∞ and are not horizontal on q'. If q has no horizontal cylinders then neither does q', and we can apply the argument with any equivalence class of -parallel horizontal cylinders C_1, …, C_r on M_∞. One of these classes must have total area at least 1/t, and thus for 𝒰 sufficiently small, the sums of the areas of the corresponding cylinders C'_1, …, C'_r is at least A_0. \n\n\n \n We first prove the first assertion. Let C_1, …, C_r be the -parallel cylinders on M_q, and h_1, …, h_r the positive numbers provided by Proposition <ref>. \nWe define q' as g ∘φ (q), where g ∈ and φ is a cylinder surgery corresponding to {C_i, g_i}, and g_i is the cylinder stretch with parameter sh_i for some s<0. \nNeither of the maps g, φ preserves the area of the surface, we will choose parameters so that their composition does. Moreover both of these maps will not change the vertical component of the holonomy of any curve. \nThe -action preserves , and by Proposition <ref>, so does φ. The map g will increase the length of all horizontal saddle connections on q, and the cylinder surgery φ will not affect their length, since the cylinders C_i are disjoint from the horizontal saddle connections on q. \n\n\n\nThe area of φ (q) is smaller than the area of q since all of the cylinders C_i are stretched by a negative parameter. Let A  be the sum of the areas of the cylinders C_1, …, C_r. Then by choosing the parameter s appropriately, we can arrange so that the area of φ(q) is 1-A/2. We now set \n\n    t (1 -A/2)^-1    and  g (  t     0 \n     0     1 ).\n\n\nThen g increases the lengths of horizontal saddle connections by a factor t>1, and multiplies the area of φ(q) by t. This completes the proof of the first assertion.\n\nFor the second assertion, we use the second assertion in Proposition <ref> to choose the cylinders so the sum of their areas satisfies A ≥ A_0. This ensures that the horizontal saddle connections on q'  g ∘φ (q) are longer than the horizontal saddle connections on q by a factor of at least t, where t>1 is as in (<ref>) and t-1 is bounded away from 0. In light of Proposition <ref>,  q' ∈ W^uu(q) also does not have horizontal cylinders. So we can apply the above argument iteratively, at each stage obtaining surfaces in W^uu(q) with longer and longer horizontal saddle connections. Since the lengths of these horizontal  saddle connections grows by a definite amount in each step, after finitely many steps they will all be longer than T. \n\n\n\n\n\n\n§ MEASURES ON  AND (S,Σ)-INVARIANT MEASURES ON \n\nThe goal of this section is to prove a result on the correspondence between Radon measures on  and (S,Σ)-invariant Radon measures on . This result is part of the folklore but we were not able to find a reference; see <cit.> for an analogous result in a restricted setting. \n\nWe state the result in a general setting.\nLet X̃ be a paracompact manifold and Γ a discrete group acting properly discontinuously on X̃. We will write the Γ-action as an action on the right.  \nLet X=X̃/Γ be the quotient space and π:X̃→ X the quotient map. \nIf Γ acts freely then X is a manifold and π is a covering map. If Γ does not act freely then we can view X as an orbifold and π as a regular orbifold covering map (although no knowledge of orbifolds is assumed in this section). \nWe do not assume that the action on Γ is faithful but, since the action of Γ is proper, the subgroup of Γ that acts trivially on X̃ must be finite.\n\n\n\n\nFor q̃∈X̃ let Γ(q̃) be the stabilizer of q̃ in Γ.\nFor any q ∈ X, we define a measure on X̃ by\n\n    θ_q ∑_q̃∈π^-1( q) |Γ(q̃)|·δ_q̃,\n\nwhere δ_q̃ is the Dirac mass at q̃. The measure θ_q is supported on π^-1(q).  For any f ∈ C_c(X̃) and q̃∈X̃ we have\n\n    ∫_X̃ f   dθ_π(q̃) = ∑_γ∈Γf(q̃·γ).\n\n It follows from the fact that Γ acts properly discontinuously on X̃ that the sum on the right-hand side is finite.\n\n\nGiven a Radon measure ν on X we define a Radon measure ν̃ on X̃, called the pre-image of ν, by the formula \n\n    ∫_X̃ f  dν̃ = ∫_X(∫_X̃ f  dθ_q )  dν(q)    for any  f ∈ C_c(X̃).\n\n\nEquation (<ref>) defines a unique Radon measure ν̃ on X̃ in light of the Riesz Representation Theorem. To see that (<ref>) converges, note that the integrand q ↦ F(q) \n∫_X̃ f  dθ_q is a Borel function, which is supported on the compact set π( supp  f), and is bounded by D   f _∞, where D #{γ∈Γ: (supp  f) ·γ∩supp  f ≠∅} is finite since the Γ-action is properly discontinuous.  \n\nBy (<ref>) the measures θ_q are all Γ-invariant, and since ν̃ is an average of the measures θ_q, we have: \n\n\nThe measure ν̃ is  Γ-invariant.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe following converse can be understood as a disintegration theorem for Γ-invariant Radon measures on X̃.\n\n\n    Let m be a Γ-invariant Radon measure on X̃. There is a unique Radon measure μ on X such that m is the pre-image of μ.\n\n\nWe call μ the image of m.\n\n\nLet m be given. We are claiming the existence of a Radon measure μ so that \n(<ref>) holds (with ν̃, ν replaced with m, μ). \n\n\n\n\nThe idea of the proof is to build μ on small neighborhoods using the fact that π is an orbifold cover. This will be made rigorous using a partition of unity. Let q̃∈X̃ and let Γ(q̃) be the stabilizer of q̃ in Γ. Since Γ acts properly discontinuously on X̃,  Γ(q̃) is finite, and there is connected Γ(q̃)-invariant neighborhood  of q̃ and a neighborhood  of π(q̃) such that π induces a homeomorphism / Γ(q̃) →, and \n    \n    π^-1() =  _γ∈Γ(q̃) \\Γ·γ,\n\nwhere γ ranges over a set of coset representatives, and where the sets 𝒱·γ are  disjoint.\n We say that such a ⊂ X is evenly covered (in the orbifold sense). \n \n Let (_i)_i ∈ I be a locally finite cover of X by evenly covered neighborhoods. \n Such a cover exists by the paracompactness of X̃ and the considerations above. \n For each i ∈ I choose a connected component _i of π^-1(_i). Denote by Γ_i=Γ(_i) the stabilizer of _i in Γ. \n Let (ρ_i)_i∈ I be a partition of unity subordinate to the cover (_i)_i ∈ I and define a Radon measure μ on X (by using the Riesz Representation Theorem) such that for any f ∈ C_c(X),\n    \n    ∫_X f  dμ = ∑_i ∈ I1/|Γ_i|∫__i (ρ_i f) ∘π  dm.\n\n\n\n    We want to show that the measure μ satisfies (<ref>). \n    We claim first that for any q̃∈X̃, there is a neighborhood  around q̃ such that (<ref>) holds for any f ∈ C_c(X̃) with support contained in . \n    Indeed, let q̃∈X̃ and let  be a neighborhood of q̃ small enough so that for any i ∈ I,  intersects at most one connected component of π^-1(_i). \n    This is possible since the cover by the _i is locally finite. Let J = {i ∈ I : π() ∩_i ≠∅} and for j ∈ J, let γ_j ∈Γ be such that _j ·γ_j ∩≠∅. \n    By the assumption on 𝒱, the coset  Γ_j ·γ_j is uniquely determined. \n    Let f ∈ C_c(X̃) with support contained in . We compute:\n \n    ∫_X( ∫_X̃ f  dθ_q )  dμ(q) \n               = ∑_i ∈ I1/|Γ_i|∫__i∑_γ∈Γρ_i(π(q̃) )f(q̃·γ)  dm(q̃) \n       = ∑_j ∈ J1/|Γ_j|∫__j ·γ_j∑_γ∈Γ_jρ_j(π(q̃)) f(q̃·γ)  dm(q̃) \n       = ∑_j ∈ J1/|Γ_j|∫_X̃∑_γ∈Γ_jρ_j(π(q̃)) f(q̃)  dm(q̃) \n       = ∑_j ∈ J∫_X̃ρ_j(π(q̃)) f(q̃)  dm(q̃) = ∫_X̃ f   dm.\n\n    \n    Now let  f be an arbitrary compactly supported continuous function and let K denote its support. \n    Using a covering argument and the computation above, we can find finitely many (_i)_i that cover K and such that (<ref>) holds for continuous functions with support contained in _i. Let (ψ_i)_i be a partition of unity associated with this cover.\n    We can write f = ∑_i ψ_if. By construction, each of the ψ_if has support contained in _i and the result follows by (<ref>) and the linearity of the integral.  \n    \n    To prove uniqueness of the measure μ, we proceed as follows. Let μ_1 and μ_2 be two Radon measures on X that satisfy (<ref>) (with m,μ_i instead of ν̃, ν).\n    \n    Let f ∈ C_c(X) be a compactly supported continuous function whose support is contained in an evenly covered neighborhood  and let  be a connected component of π^-1(). \n    We denote by Γ() the stabilizer in Γ of . Let h be the function on X̃ that is equal to  f ∘π on  and vanishes outside of . \n    Since the support of f is contained in , the function h is continuous and has compact support. Furthermore, it is easy to see that for any q ∈ X, ∫_X̃ h  dθ_q = |Γ()| f(q). This implies\n    \n    ∫_X f  dμ_1 = 1/|Γ()|∫_X̃ h  dm =∫_X f  dμ_2.\n\n    To deal with the case when f is an arbitrary function of compact support we appeal once more to existence of partitions of unity. \n\n\n\n\nLet G be a group acting on X̃ so that the action commutes with the action of Γ.\nThe group G induces an action on X so that π is G-equivariant.\n\n\n A Radon measure μ on X is invariant under g∈ G if and only if its pre-image μ̃ is invariant under the action of g on X̃.\n\n\n \nWe start by proving two formulas showing the naturality of the pre-image construction.\n\ng_*(θ_q)=θ_g(q).\n\n\n\n    g_*(θ_q)   \n     \n     =∑_π(q̃)=q|Γ(q̃)|·δ_g(q̃)\n        =∑_π(g(q̃))=g(q)|Γ(q̃)|·δ_g(q̃)\n       =∑_π(g(q̃))=g(q)|Γ(g(q̃))|·δ_g(q̃)=θ_g(q).\n\nIn line (<ref>) we used the fact that π(g(q̃))=g(π(q̃))=g(q). In line (<ref>) we used the fact\n\nthat the Γ action commutes with g, which implies that |Γ(g(q̃))|=|Γ(q̃)|.\n\n\ng_*(μ̃)=g_*(μ).\n\n\nIt suffices to show that both measures assign the same integrals to continuous functions of compact support on X̃. Let f be such a function.\n\n    ∫_X̃f  dg_*(ν)    =∫_X(∫_X̃ f  dθ_q )  dg_*(ν)(q)\n        =∫_X(∫_X̃ f  dθ_g(q)) dν(q) =∫_X(∫_X̃ f  dg_*(θ_q) ) dν(q) \n        =∫_X(∫_X̃ f∘ g   dθ_q ) dν(q) \n        =∫_X̃f∘ g  dν̃=∫_X̃f  dg_*(ν̃).\n\nIn line (<ref>) we used Claim <ref>. In line (<ref>) we used the definition of the pre-image applied to the function of compact support f∘ g.\n\nUsing these formulas we now prove the Proposition.\nIf g_*(μ)=μ then g_*(μ̃)=g_*(μ)=μ̃ by Claim <ref>. So μ̃  is invariant under the action of g on X̃.\nIf g_*(μ̃)=μ̃ then g_*(μ)=g_*(μ̃)=μ̃ so the pre-images of g_*(μ) and μ are equal. \nIt follows from the uniqueness assertion in Proposition <ref> that g_*(μ)=μ.\n\n\nalpha\n\n\n"}