{"entry_id": "http://arxiv.org/abs/2303.07356v1", "published": "20230313152315", "title": "Recovering Zipf's law in intercontinental scientific collaboration", "authors": ["Malgorzata J. Krawczyk", "Krzysztof Malarz"], "primary_category": "cs.DL", "categories": ["cs.DL"], "text": "\n  \n\n\n,\n\nal. Mickiewicza 30, 30-059 Kraków, Poland\n\n\n\n\nScientific collaboration on an international level has been well studied in the literature. However, much less is known about this collaboration on the intercontinental level. In this letter, we address this issue by creating a collection of approximately 30 millions publications around the papers by Alessandro Vespignani. The obtained rank-frequency distribution of the probability of sequences describing continents and number of countries—with which authors of papers are affiliated—follows the inverse power law with an exponent close to 1.5. Such a dependence is known in the literature as Zip's law and it has been originally observed in linguistics, later it turned out that it is very commonly observed in various fields.\n\n\n\nRecovering Zipf's law in intercontinental scientific collaboration\n    Krzysztof Malarz\n    March 30, 2023\n==================================================================\n\n\n\n\n\nIntroduction.\nStudies of scientific collaboration between authors of scientific articles are mainly focusing on the international level <cit.>.\nMuch less is known about intercontinental scientific collaboration.\nIn the Web of Science database <cit.> we were able to identify only two articles <cit.> dealing with this topic.\n\nIn Ref. Kozma_2019 the analysis focuses on mapping, based on publication output, scientific collaboration of African researchers, and the role of the South African research community as a channel for within- and intercontinental collaborations.\n say, that they `have selected ten scientific fields, namely, tropical medicine, parasitology, infectious disease, ecology, water resources, immunology, zoology, plant sciences, agricultural and food sciences, and psychology to gain a clear picture of the aforementioned scientific activity.'\nThe authors also state that they `created cooperation networks and visualised them on world-maps.\nIn addition, centrality measures of the network were calculated to see the frequency of involvement regarding different countries, with a focus on South Africa, in the collaboration process.\nFurthermore, first and last authorship positions of the publications were summed to highlight the influence of the selected authors on the direction of and resources provided to the publications. Finally, the most prominent funding organisations and their focus on the selected fields were singled out. Through combining these steps of analysis, authors gained an accurate picture of the level of involvement of the South African research community in within- and intercontinental scientific collaboration.'\n\nIn Ref. Abramo_2020 the influence of geographic distance on knowledge flows, measured through citations to scientific publications was studied.  showed `that the effect of geographic distance on knowledge flows is significant at the national level, not negligible at the continental level, but completely irrelevant at the intercontinental level'.\n\nTo fill the gap mentioned above in continent-based studies of scientific collaboration, in this letter, we construct a set of nearly 30 million publications and analyze it in terms of intercontinental scientific collaboration.\nBased on mapping authors' to continents (via the countries where they institutions are located), we generate sequences of continents with the number of countries on these continents.\nAs we show below, the obtained rank-frequency distribution of sequences reveals Zipf's law <cit.> with an exponent close to 1.5.\n\n\n\nMethodology. \n\nTo collect data on the affiliation of authors of scientific publications, we used the Scopus API <cit.>. As we are interested in analysis of scientific collaboration, we decided to build a graph around scientist who is active in more than one discipline. Our choice fell on Alessandro Vespignani <cit.> who is one of the most famous scientists in the field of complex networks and whose scientific interests cover the analysis of social <cit.> and biological networks <cit.>, or the spread of epidemics <cit.>.\nSubsequently, we found all authors who published with Vespignani, then found their co-authors, and so on. However, during data aggregation, we decided to stop this recursive finding for authors whose total number of publications is less than fifty, for authors whose last publication was published before 2015 and for authors whose distance, measured as the number of edges on a shortest path connecting a given author with the starting node (Alessandro Vespignani), in the graph of authors is greater than six. \nFrom this set, we also excluded articles if the number of affiliations of a given author at a particular publication is greater than five or if the data associated with a given publication do not allow automated country identification.\nThis methodology allowed us to collect data on 29 918 476 publications.\n\nAffiliations contained in publications are processed as follows:\n\n    \n  * for each author all his/her n_i affiliations mentioned in a given paper are identified together with a country where this affiliation is settled;\n    \n  * duplicates of countries in the list created for an individual author are removed, i.e., each country may appear in this list exactly once, which results in a number n_c^a of countries per author;\n    \n  * the lists of countries for all authors are merged into a single list—without repetitions—resulting in n_c countries; \n    \n  * n_c countries that appear in a given publication are then mapped to continents on which these countries are located;\n    \n  * for the purposes of further analysis, a number is added to each continent in the collection, specifying the number of different countries located on this continent represented by the authors of a given publication.\n\n\n\n\n\n\nFor a better understanding of this process, let us analyze an example publication <cit.>. In <Ref> all their authors (in alphabetical order) are presented, with indication of the countries of particular affiliation, number of affiliations n_i and number of countries n_c^a. Nine out of twelve authors of this work are affiliated with only one institution in one country. Two of the twelve authors (3rd and 11th) are affiliated with two institutions in two countries. The remaining one (4th) is affiliated with three institutions located in two countries. All these countries are in the oval (marked as `Authors') at the top of <Ref>. In the next step, we map countries to continents (removing country repetitions) and sum up the number of countries on each continent.\n\n\n\n\n\n\n\n\n\n\n\nResults. In <Ref> the top-20 of the most frequent sequences in the form `continent (number of countries)' together with its percentage in all analyzed publications are presented.\nThe complete list (containing more than eight thousand types of case) is available in Ref. data-intercont-rank.\n\n\n\n\n\nThe visualization of the latter as the rank-frequency distribution is presented in <Ref>.\nThe obtained diagram reveals the power-law dependence\n\n\n    𝒫(ℛ)∝ℛ^-α,\n\n\nwhere 𝒫 is the frequency of the sequence, ℛ is the rank of this sequence and the exponent α≈ 1.5460 with its uncertainty u(α)=0.0017.\nSuch an inverse relation in the rank-frequency distribution is known as Zipf's law <cit.>.\n\n\n\n\n\n\n\nDiscussion. The most frequently observed sequences obtained from mapping authors' countries to continents do not show their intercontinental nature. \nThe three most popular sequences (in the papers analyzed) correspond to single-country papers by authors affiliated in countries from Europe (𝒫≈ 23.5%), North America (𝒫≈ 23.14%) and Asia (𝒫≈ 15.01%). These three cases slightly deviate from the fitting to Zipf's law (<ref>) as presented in <Ref>.\n\nThe fourth place is taken by papers committed by authors affiliated with institutes in two European countries (𝒫≈ 4.85%).\n\nThe first intercontinental collaboration is ranked as the fifth, and it corresponds to papers co-authors by authors from a single European country plus authors from a single country in North America. The abundance of such a sequence is 𝒫≈ 4.65%.\nAlso, the next two most frequent cases [Asia (1), North America (1) with 𝒫≈ 3.45% and Asia (1), Europe (1) with 𝒫≈ 1.73%] correspond to a bilateral intercontinental collaboration established by authors from a pair of countries.\n\nThe eighth place is again taken by monocontinental collaboration between authors affiliated in countries from Australia & Oceania.\nThe ninth place corresponds to the situation where authors are affiliated in two European countries and authors from one country (either USA or Canada) from North America.\n\nFinally, the top-10 list is closed by papers committed by authors affiliated with three European countries (again without revealing the intercontinental character of the scientific collaboration).\n \nThe complete ranking containing more than eight thousand sequences is available as a comma-separated-value file in Ref. data-intercont-rank.\n\n\n\nConclusions. In this letter, the intercontinental collaboration among the authors of nearly 30 millions articles collected from Scopus <cit.> is studied. The obtained rank-frequency-based histogram reveals power-low dependence (<ref>), which is known as Zipf's law, and occurs in many types of studied data—ranging from quantitative linguistics (where it was originally formulated <cit.>), via social sciences <cit.>, music <cit.>, seismic activity <cit.> to physics <cit.> and others <cit.>. \n\nThe further studies may include detailed look into frequencies of sequences for fixed number continents (for example, for single, double, triples, etc, involved continents) or for more sophisticated methods of sequence analysis (by applying, for example, a scalar variable—as the inverse participation ratio—to distinguish among sequences). Also, a more thorough analysis of cooperation (based on international collaboration level) may exhibit some free-scaling behavior in rank-frequency distribution of analogous sequences but for countries. Detailed results of the studies mentioned above will be given in Ref. <cit.>.\n\n\n\n\n\n"}