{"entry_id": "http://arxiv.org/abs/2303.07374v1", "published": "20230313180011", "title": "Higher-Order Methods for Hamiltonian Engineering Pulse Sequence Design", "authors": ["Matthew Tyler", "Hengyun Zhou", "Leigh S. Martin", "Nathaniel Leitao", "Mikhail D. Lukin"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.dis-nn"], "text": "\n\n\n\nDepartment of Physics, Harvard University, Cambridge, Massachusetts 02138, USA\n\n\nThese authors contributed equally to this work\n\nThese authors contributed equally to this work\n\n\n\nlukin@physics.harvard.edu\n\n\n\n\nWe introduce a framework for designing Hamiltonian engineering pulse sequences that systematically accounts for the effects of higher-order contributions to the Floquet-Magnus expansion.\n\nOur techniques result in simple, intuitive decoupling rules, despite the higher-order contributions naively involving complicated, non-local-in-time commutators.\n\nWe illustrate how these rules can be used to efficiently design improved Hamiltonian engineering pulse sequences for a wide variety of tasks, such as dynamical decoupling, quantum sensing, and quantum simulation.\n\nHigher-Order Methods for Hamiltonian Engineering Pulse Sequence Design\n    Mikhail D. Lukin^1\n    March 30, 2023\n======================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION AND MOTIVATION\n\nThe effective control of many-body quantum dynamics is an important challenge in the emerging field of quantum science and technology, with wide-ranging applications in quantum computation <cit.>, quantum sensing <cit.>, and quantum simulation <cit.>.\n\nOne of the key tools for controlling such many-body quantum dynamics is Hamiltonian engineering <cit.>, in which a train of pulses transform the original system Hamiltonian into a desired target Hamiltonian for various applications.\n\nIndeed, from the inception of such techniques in early NMR work to the present day, Hamiltonian engineering has enabled high resolution spectroscopy <cit.>, high sensitivity metrology <cit.>, as well as the realization of exotic Floquet phases of matter <cit.>.\n\nOne of the key tools for performing Hamiltonian engineering is average Hamiltonian theory <cit.>.\n\nHere, the engineered Hamiltonian is approximated by the time-average of interaction-picture Hamiltonians with respect to the control pulses.\n\nThis allows the effective engineering of many-body Hamiltonians, even in the case where only global manipulation of spins is accessible, as is the case in many large-scale quantum systems <cit.>.\n\nMoreover, design rules that systematically take into account robustness against various imperfections can be derived <cit.>, enabling robust pulse sequence design as well.\n\nDespite the success of techniques based on average Hamiltonian theory, large variations in performance still exist among the different sequences obtained, suggesting that higher-order contributions in the full Magnus expansion may play an important role.\n\nExisting works treating higher-order contributions often rely purely on symmetrization, or treat the higher-order terms on a case-by-case basis <cit.>.\n\nHowever, finding general conditions for the cancellation of higher-order Magnus terms can be non-trivial, as the expressions involve commutators that are non-local in time.\n\nIn this paper, we systematically analyze higher-order Magnus contributions to effective Hamiltonians, providing a general toolset for pulse sequence design in interacting spin systems in the form of concise decoupling rules.\n\nDespite the non-local nature of the commutators involved in higher-order contributions, we are still able to generalize many results from average Hamiltonian theory. First, we find that the frame representation employed in Ref. <cit.> still provides a convenient way to describe the pulse sequence and contributions, resulting in analytical decoupling rules for higher-order terms.\n\nAs an example, in Fig. <ref>(c) we illustrate how first-order Magnus terms involving disorder and Heisenberg interactions have a simple geometric interpretation in analogy with dipoles, and in Fig. <ref>(d) we illustrate how first-order Magnus terms involving Ising and Heisenberg interactions have a similar interpretation as balancing the center of mass along a given axis.\nSecond, we find that although there exist additional cross-terms, the majority of finite pulse duration effects can still be described as a simple extension of the effective free evolution time <cit.>, making it easy to build in robustness to sequence design.\nFinally, we extend the principle of pulse cycle decoupling <cit.> to more general pulse sequences and Hamiltonians, beyond those where the zeroth-order average Hamiltonian vanishes.\n\nWe use this to show how decoupling rules can be significantly simplified for pulse sequences that are composed of common motifs, such as spin echoes <cit.> or WAHUHA blocks <cit.> (Fig. <ref>(a,b)), resulting in time-local decoupling conditions even for higher-order Magnus contributions.\nTogether, these techniques allow us to find higher-order robust pulse sequences with substantially improved performance for a variety of dynamical decoupling, Hamiltonian engineering and quantum sensing applications, as discussed here and in the accompanying paper, Ref. <cit.>.\n\nThis paper is organized as follows: in Sec. <ref>, we review our representation of the pulse sequence and associated interaction picture Hamiltonian, as well as existing decoupling rules for the zeroth order effective Hamiltonian.\n\nIn Sec. <ref>, we utilize this representation to provide general expressions for the higher-order Magnus contributions and present systematic decoupling conditions for higher-order terms.\n\nWe then analyze the structures present in these decoupling rules in Sec. <ref>, finding significant simplifications for commonly-found pulse sequence structures in both the disorder-dominant and interaction-dominant regimes.\n\nWe also tabulate the resulting decoupling rules, and provide a pictorial depiction of them.\n\nIn Sec. <ref>, we provide further details on the efficient numerical screening of pulse sequences, resulting in high-performance pulse sequences for dynamical decoupling, quantum sensing, and quantum simulation. Finally, in Sec. <ref> we conclude with a discussion of further extensions and future directions of the formalism.\n\nA summary of the notation adopted in this manuscript can be found in Appendix. <ref>.\n\n\n\n\n\n\n§ GENERAL FRAMEWORK AND REVIEW OF EXISTING RESULTS\n\n\n\n\n\n §.§ General Framework and Frame Representation\n\n\nWe begin by introducing our method to represent the pulse sequence and associated average Hamiltonian, which will greatly simplify the analysis of effective Hamiltonians and finite pulse effects compared to the conventional representation of individual pulses. We will adopt the toggling-frame sequence representation (also known as the Mansfield representation) used in Choi et al. <cit.>, which focuses on how operators are transformed under the pulses, rather than the applied pulses themselves. In addition to being a complete and concise representation of the pulse sequence, this representation also has the additional advantage that it leads to simple decoupling conditions that are amenable to fast numerical screening.\n\nConsider a pulse sequence composed of n global spin-rotation pulses {P_1, ⋯, P_n} acting on a system with native Hamiltonian H, with a free evolution time τ_k preceding the kth pulse P_k. The interaction picture Hamiltonian with respect to the ideal control pulses can then be written as\n\n    H̃(t)=U_c^†(t)^⊗ m H U_c(t)^⊗ m,\n\nwhere H̃(t) is the interaction picture Hamiltonian at time t, U_c(t) is the single spin rotation due to the control field (e.g. U_c(t)=P_kP_k-1⋯ P_1 right after the kth pulse), and m is the number of spins in the system.\n\nAssuming ideal, infinitely fast rotation pulses, and that the combined rotation unitary is identity P_n⋯ P_1=I, we can write the total unitary evolution as\n\n    U(T)=𝒯exp(-∫_0^T iH̃(t)dt)≈exp(-iH^(0)T),\n\nwhere 𝒯 indicates time-ordering and T is the Floquet period. For pulse separations much shorter than the dynamical timescale of the system, we can conveniently write the effective Hamiltonian to leading order as\n\n    H^(0)=1/T∫_0^T H̃(t_1)dt_1.\n\n\nFor general system Hamiltonians satisfying the secular approximation (rotating wave approximation under a strong quantizing field) <cit.>, the interaction picture Hamiltonian H̃_s(t) can be uniquely determined by transformations of the S^z operator (we will refer to these as toggling “frames\")\n\n    S̃^z(t)=U_c^†(t)S^zU_c(t)=∑_μ F_μ(t)S^μ,\n\nwhere S^μ is a basis for the spin system, e.g. the Pauli spin operators for qubits, and we have defined the coefficients\n\n    F_μ(t)=2Tr[S^μS̃^z(t)].\n\n\nAssuming ideal, instantaneous pulses (the case of finite pulse effects and other associated imperfections are discussed in Sec. <ref>), we can express the preceding information in the form of a single 4× N matrix, where each element F_μ,k corresponds to the coefficient F_μ(t) during the kth free evolution time, and the last row contains the free evolution time duration.\n\nAs a concrete example, let us consider a spin-1/2 system, where each pulse P_k is assumed to be a π/2 pulse around ±x̂,ŷ.\n\nNote that π pulses can be viewed as two consecutive π/2 pulses, with zero time separation in between.\n\nWith S^μ chosen to be the Pauli basis, a spin echo can be represented as\n\n    [ F; τ ]_echo\n    =[  0  0;  0  0; +1 -1;  τ  τ;    ],\n\nwhile the WAHUHA decoupling sequence for dipolar interactions <cit.> can be expressed as\n\n    [ F; τ ]_WAHUHA\n    =[  0  0 +1 +1  0  0;  0 +1  0  0 +1  0; +1  0  0  0  0 +1;  τ  τ  τ  τ  τ  τ;    ].\n\n\nPictorially, we can represent the first three rows of the matrix by the blocks in Fig. <ref>(a,b), in which a yellow(green) block indicates a +1(-1) value along the given axis (row) at a given time (column).\n\nWe illustrate more advanced versions of spin echoes and WAHUHA blocks in Fig. <ref>(a,b), in both pulse notation and the frame matrix notation utilized here.\n\nIn the preceding examples, we have neglected finite pulse duration effects, but they can be easily treated by specifying an additional intermediate toggling frame with zero time duration.\n\nThis representation allows us to easily express the interaction picture Hamiltonian H̃(t). For example, for a spin-1/2 dipolar-interacting many-body spin system with on-site disorder, the system Hamiltonian can be written as\n\n    H_dip   =∑_i h_iS_i^z+∑_ijJ_ij(S_i^xS_j^x+S_i^yS_j^y-2S_i^zS_j^z)\n       =∑_i h_iS_i^z+∑_ijJ_ij(S⃗_i·S⃗_j-3S_i^zS_j^z),\n\nwhere h_i is the on-site disorder strength for spin i, and J_ij is the dipolar interaction between spins i and j.\n\nWith our representation, for sequences composed of π/2 or π pulses around ±x̂,ŷ, the interaction picture Hamiltonian during the kth free evolution time can be easily expressed as\n\n    H̃_dip,k   =∑_iμ F_μ,k h_i S_i^μ+∑_ijJ_ijS⃗_i·S⃗_j-3∑_ijμF_μ,k^2 J_ijS_i^μ S_j^μ,\n\nwhere we have organized the terms according to how they transform with F_μ,k. Using these expressions, it is easy to verify that the spin echo cancels disorder, since ∑_k F_μ,kτ_k=0, while the WAHUHA pulse sequence fully symmetrizes (decouples) dipolar interactions, since ∑_k F_μ,k^2τ_k is the same for all μ.\n\nMotivated by these considerations, for any secular Hamiltonian, we will organize the interaction picture Hamiltonian in terms of how the operators transform as the toggling frame changes.\n\nLet us write\n\n    H̃(t)=∑_α c_α(t)𝒪^α,\n\nwhere c_α(t) are time-dependent coefficients encoding the frame transformations of a general operator basis set 𝒪^α (we will use greek letters to denote labels of operator sets in the remainder of the paper). For the example above in Eq. (<ref>), we can write out the individual terms in the summation as\n\n    𝒪^0   =∑_ijJ_ijS⃗_i·S⃗_j,    c_0(t)   =1,\n    𝒪^1,μ   =∑_i  h_i S_i^μ,    c_1,μ(t)   =F_μ,k,\n    𝒪^2,μ   =3∑_ij J_ijS_i^μ S_j^μ,    c_2,μ(t)   =F_μ,k^2,\n\nwhich clearly illustrates how the various terms in the Hamiltonian transform differently with the toggling frames.\n\n\n\n §.§ Magnus Expansion\n\nWith this general representation framework in hand, we will now briefly review the Magnus expansion, which provides a useful tool to calculate the effective dynamics of the periodically-driven system, and extend the analysis beyond the average Hamiltonian described in Eq. (<ref>).\n\nThe total unitary over a single Floquet cycle can be expressed in terms of a time-independent effective Hamiltonian 𝒰(T)=exp(-iH_effT), where in the fast-driving limit, the effective Hamiltonian can be written via the Magnus expansion up to order l as H_eff≈∑_k=0^lH^(k), with\n\n    H^(0)   =1/T∫_0^TH(t_1)dt_1,\n    \n        H^(1)   =-i/2T∫_0^Tdt_1∫_0^t_1dt_2[H(t_1),H(t_2)],\n    \n        H^(2)   =1/6T∫_0^Tdt_1∫_0^t_1dt_2∫_0^t_2dt_3\n       ([H(t_1),[H(t_2),H(t_3)]]+[H(t_3),[H(t_2),H(t_1)]]).\n\n\nHigher-order terms are more complex, involving progressively deeper nested commutators, but in the fast-driving limit they will be relatively suppressed, and we can focus on the leading order terms above.\n\nPlugging in Eq. (<ref>) and separating the time-independent operator commutation relation information from the time integrals, we have\n\n    H^(0)   =∑_α1/T^α∫_0^T dt_1c_α (t_1),\n     H^(1)\n           =∑_α,β-i/2T[^α ,^β ]∫_0^Tdt_1∫_0^t_1dt_2c_α (t_1)c_β (t_2),\n     H^(2)   =∑_α,β,γ1/6T[^α,[^β,^γ]]∭_0≤ t_3≤ t_2≤ t_1≤ Tdt_1dt_2dt_3\n       (c_α(t_1)c_β(t_2)c_γ(t_3)+c_α(t_3)c_β(t_2)c_γ(t_1)).\n\nThis allows us to reduce the computation of the Magnus expansion to the evaluation of a few integrals on the c(t) coefficients, which can in turn be readily phrased as algebraic conditions on the set of frame transformations.\n\n\n\n §.§ Review of Zeroth Order Rules\n\nUsing the preceding framework, we can readily write down conditions for the cancellation or symmetrization of various zeroth order average Hamiltonian terms, see also Ref. <cit.> for details.\n\nFor example, plugging Eqs. (<ref>-<ref>) into Eq. (<ref>), and assuming ideal, instantaneous pulses, we can easily see that on-site disorder is cancelled when ∑_k F_μ,kτ_k=0 for each axis μ=x̂,ŷ,ẑ, while interactions are symmetrized into a Heisenberg Hamiltonian or cancelled when ∑_k F_μ,k^2τ_k is equal for all different μ.\n\nMore importantly, as shown in Ref. <cit.>, these conditions can be readily generalized to the case with pulse imperfections.\n\nThe primary effect of finite pulse durations is to extend the effective free evolution times in each frame, as most of the terms generated by π/2 rotations can be written as an average of the Hamiltonian before and after the pulse.\n\nHowever, there will be additional terms arising from rotation angle errors or interaction cross-terms during rotations, which give rise to additional chirality or parity conditions between neighboring frames <cit.>.\n\nThe simple, time-local nature (all rules only involve neighboring frames) of these decoupling conditions enabled efficient design and screening of pulse sequences.\n\nIndeed, using these simple decoupling conditions, novel pulse sequences with improved decoupling performance have been found, leading to the demonstration of the first solid-state AC magnetometer that operates beyond the limits of spin-spin interactions <cit.>.\n\nHowever, the further extension of such techniques to incorporate higher-order Magnus contributions and improve performance is at first sight challenging, given the time-non-local nature of higher-order Magnus terms, which involve commutators between all times of a Floquet cycle.\n\nIn the following, we demonstrate how this challenge can be systematically overcome by utilizing the structure of commonly-used pulse sequences.\n\n\n\n§ SYSTEMATIC ANALYSIS OF HIGHER-ORDER MAGNUS TERMS\n\n\n\nWith the basic formalism in hand, we now turn to the systematic extension of these decoupling rules from zeroth-order to higher-order.\n\nFirst, we will describe the pulse cycle decoupling principle <cit.> and extend it to the case of more general interactions, which serves as a useful tool to decompose non-local higher-order terms into local blocks.\n\nWe will then systematically derive expressions for first- and second-order Magnus contributions in the general case, assuming ideal pulses.\n\nFinally, we briefly describe how the treatment can be readily generalized to the case with finite pulse durations, primarily by extending the effective duration of free evolution times, with more details given in Appendix. <ref>.\n\n\n\n §.§ Pulse Cycle Decoupling\n\n\nIn order to simplify sequence analysis, it is helpful to be able to break down larger pulse sequences into smaller blocks and analyze them independently.\n\nIn this section, we show how common motifs used in sequence design—in the form of spin echoes or interaction symmetrization—allow us to decompose higher-order contributions into a sum of independent, local pieces, no longer requiring non-local correlators between arbitrary locations and thus significantly simplifying the design.\n\nOur results are applicable even to some cases where the symmetrization results in a residual Heisenberg interaction Hamiltonian, thus extending the existing methods <cit.> of pulse cycle decoupling to new and experimentally important regimes.\n\nLet us proceed by examining the first-order contribution when sequentially applying two sequences A and B of equal length T.\n\nWe can split the first-order Magnus contribution in Eq. (<ref>) into integrals within the first and second sequence respectively, and cross terms between the two sequences, resulting in\n\n    H^(1)=1/2H^(1)_A+(-i/4T)[TH^(0)_B,TH^(0)_A]+1/2H^(1)_B,\n\nwhere H^(0,1)_A,B are the zeroth (first) order effective Hamiltonians during pulse sequences A and B.\n\nThe key observation of pulse cycle decoupling is that if the commutator [H^(0)_A, H^(0)_B] vanishes, then the first-order contribution fully decouples into the sum of that in each individual block, regardless of the details.\n\nIn prior work <cit.>, this was achieved by making one of the average Hamiltonians vanish, thus causing the commutator to automatically vanish as well.\n\nFor more general Hamiltonians, however, this no longer directly applies, since the Heisenberg interaction is invariant under global rotations and cannot be cancelled with a global drive <cit.>.\n\nDespite this challenge, we find that we can still make use of the pulse cycle decoupling principle in many scenarios beyond the case where the Hamiltonian vanishes.\n\nFirst, even if the total Hamiltonian does not vanish, pulse cycle decoupling can still apply to individual terms.\n\nFor example, if a given block fully decouples disorder (the rapid echo blocks in Fig. <ref>(a)), then any first-order terms involving disorder will not have cross terms between this block and other parts of the sequence, simplifying the design.\n\nSecond, if the interaction is transformed into the same form in two separate blocks, then although H_A,B^(0) are both nonzero, they still commute, and so the pulse cycle decoupling principle still applies (see e.g. Fig. <ref>).\n\nThus, even if the interaction has a Heisenberg component that cannot be cancelled, the cross-term is still zero because [∑_ijJ_ijS_i· S_j, ∑_ijJ_ijS_i· S_j]=0.\n\nThis insight generalizes the pulse cycle decoupling principle to cases in which one desires to engineer a non-zero target Hamiltonian, significantly expanding its applicability.\n\n\n\nWhile we have illustrated the pulse cycle decoupling principle at first order, the same methods also apply at higher-order by generalizing the arguments in Ref. <cit.>.\n\nFor example, the second-order Magnus contribution can be expressed as a sum of commutators between zeroth and first-order terms, and thus if lower orders are fully symmetrized, then the second-order Magnus contribution will also separate into independent, local blocks.\n\n\n\n §.§ First-Order Decoupling\n\n\nWe now return to analyze the structure of higher-order Magnus terms directly and derive decoupling rules for various contributions.\n\nThe expressions here will be derived in full generality, without making use of the pulse cycle decoupling principle, although we will use this to further simplify the expressions in following sections.\n\nIn order to better understand the structure of the first-order Magnus contributions and derive decoupling rules, let us rewrite the preceding expressions into a form that relates them to zeroth-order Magnus contributions and makes clear how terms can be cancelled.\n\nDenoting the zeroth order contribution up to a given time as _α(t)≡∫_0^tc_α (t_1)dt_1, we can rewrite Eq. (<ref>) as\n\n    H^(1)   =-i/T∑_α>β[^α ,^β ]\n       ×∫_0^Tc_α (t_1)_β(t_1)dt_1-1/2_α(T)_β(T).\n\n\nFocusing first on the case of instantaneous, ideal pulses (the more general case will be treated in Sec. <ref>), our toggling-frame Hamiltonian becomes piecewise-constant in time, allowing us to replace integrals with summations.\n\nWe can then define the discrete frame equivalents of the terms in the previous section, letting c_α,k=c_α (t) for t∈[t_k-τ_k/2,t_k+τ_k/2] and _α,k≡∑_l<kc_α,lτ_l, and find\n\n    H^(1)   =∑_β<α[^α ,^β ]\n       ×(∑_k=1^n c_α,kτ_k(_β, k+1/2τ_k c_β,k)-1/2_α,n+1_β,n+1),\n\nThe first term in the parenthesis can be interpreted as a product between the c_α coefficient during a given frame and the integral of zeroth order average Hamiltonians up to the center of the frame.\n\nThe last term is simply the product of two zeroth-order contributions over the entire Floquet period, which will vanish when zeroth-order decoupling rules are satisfied.\n\nGeometrically, this expression can be understood as rewriting the triangular integration area in Eq. (<ref>) into a sum over thin column slices.\n\nWe emphasize that these results apply to all first-order contributions, illustrating the common structure found in the decoupling of many different types of terms.\n\nBy keeping track of the running sum, the evaluation of this expression now requires only linear time, as opposed to the naive quadratic complexity.\n\nIn addition, although Eq. (<ref>) still contains products of coefficients that are non-local in time, in Sec. <ref> we shall see that in many cases of interest, it can be reduced into simple, local decoupling rules.\n\nWe also generalize these results to the case with finite pulse durations in Sec. <ref>.\n\nThe primary effect, similar to the zeroth-order case <cit.>, is to lengthen the effective duration of each free evolution time by an amount proportional to the pulse duration.\n\nThere will be additional cross terms that we tabulate in the appendix, but they are generally smaller.\n\n\n\n §.§ Second-Order Decoupling\n\n\nWe can now apply the same formalism to the second-order Magnus contributions.\n\nAs we show in Appendix. <ref>, by reordering the integrals, we can re-express the second-order contribution in terms of the zeroth- and first-order contributions at different times. Let us define the first-order contribution from time t_1 to t_2 of the operator [^β,^γ] as\n\n\n    c^(1)_β, γ(t_1,t_2)\n       =∬\n    t_1<t_b<t_a<t_2(c_β(t_a)c_γ(t_b)-c_β(t_b)c_γ(t_a)),\n\nwhere we have dropped the integrand dt_a dt_b for notational simplicity here and below.\n\nWe can rewrite the expression as follows\n\n    H^(2)   =1/6T∑_α<β<γ ([^α,[^β,^γ]])\n    ×   ∫_0^Tdt_1c_α(t_1)(c^(1)_β,γ(0,t_1)-c^(1)_β,γ(t_1,T) ).\n\n\nThus, we see a very similar structure as at first order, wherein the second-order term can also be expressed as a simple integral of lower-order products, enabling formulation of simple decoupling rules.\n\n\n\n §.§ Robustness Conditions\n\n\nWe now extend these results to the case with finite pulse durations, and describe how to incorporate robustness to these effects into the sequence design.\n\nWe will focus our attention on the dominant contribution, which we find to be a simple extension of the effective free evolution time by an amount proportional to the pulse duration.\n\nA full treatment of the finite pulse effects, including additional sub-leading cross terms, can be found in Appendix. <ref>.\n\n\n\nAs shown in Fig. <ref>, with a finite pulse duration, the coefficient c_α(t) of each term of the Hamiltonian will consist of a ramp up (the preceding rotation), free evolution in the frame, a ramp down (the following rotation), as well as some additional cross-terms between the frames.\n\nThe primary effect of finite pulse effects is illustrated in Fig. <ref>(b), in which the effective duration of each frame is lengthened by the integral of _α, k and _α , k over time.\n\nThis is a simple extension of the calculation for the zeroth-order case, and scales as O(ττ_p), where τ is the free evolution time and τ_p is the pulse duration.\n\nWe incorporate this into the main term in the decoupling rule table, Tab. <ref>, as described in more detail in the next section.\n\nIn addition to this dominant term, there are contributions that scale as O(τ_p^2) or higher powers.\n\nFirst, we have to treat the overlap of the frames, which gives rise to the additional term:\n\n    ∬_0<θ_2<θ_1<π/2_α,k(θ_1)_β,k+1(θ_2)-_α,k+1(θ_2)_β,k(θ_1).\n\nThese terms correspond to the overlap of the ramp up of one frame with the ramp down of another. We note that we get a positive effect from the ramp down of one into the ramp up of the other, and a negative effect from the ramp up of one with the ramp down of the other. These are the main finite pulse effects to each of the correction terms, and are shown in column 4 of Tab. <ref>. \n\nThe final contribution originates from first-order contributions involving interaction cross-terms q_ρ.\n\nMore specifically, during the continuous rotation from an XX Hamiltonian to a YY Hamiltonian, XY-type terms are generated; the q_ρ cross-terms come from first-order cross-terms between these XY-type terms and other terms.\n\nNote that there will be no such cross-terms for the disorder part of our Hamiltonian.\n\nThus, although the magnitude of this term can in principle scale as O(τ_pτ), in practice the coefficients are small for disorder-dominated systems, and we will analyze this in detail instead in Appendix <ref>.\n\n\n\n§ HIGHER-ORDER DECOUPLING RULES\n\n\n\n\n §.§ Summary of General Rules\n\n\n\n\n\n\n\n\n\n\nWe now utilize the results from the preceding section to derive concrete decoupling rules for various important higher-order contributions.\n\nPlugging in different Hamiltonian terms into the expressions derived in Sec. <ref>,<ref>, we arrive at the decoupling rules in Tab. <ref>.\n\nAs higher-order terms originate from commutators between different terms, we label the cancellation rules with all operators involved.\n\nThe table includes two types of contributions: first, there are the main terms that will appear even with ideal, infinitesimally short pulses, together with corrections to their effective duration due to finite pulse durations; second, we include terms that come purely from the finite pulse duration, in the form of the overlapping pulse term derived in Eq. (<ref>).\n\nThere is one additional type of term, as mentioned in the preceding section, that involves interaction cross terms q_ρ during continuous rotations.\n\nWe omit them from this table, since they do not appear for disorder terms that are dominant in our experiments, but we discuss them in more detail in Appendix <ref>.\n\nNote also that since the Magnus expansion is not invariant with respect to cyclic permutations of the pulse sequence, there are modifications to terms relating to the first and last frames in the complete expression.\n\nHowever, we neglect them from this table, both to simplify notation, as well as due to the fact that after many Floquet cycles we expect the contributions from these boundary terms to be diminished.\n\nWhile the decoupling rules are somewhat more complicated than the zeroth-order rules derived in Ref. <cit.>, many of them nonetheless have simple geometric intuitions (Fig. <ref>), and can be further simplified for many common scenarios.\n\nMoreover, the decoupling rules can often be satisfied with simple local motifs, further simplifying the pulse sequence design task.\n\nFor example, in many cases, by using the pulse cycle decoupling principle described in Sec. <ref>, one can apply the same rules as zeroth-order sequence design, except requiring the cancellation on a much faster timescale.\n\nThese considerations are summarized in the last column of Tab. <ref>.\n\nWe will now go through a few representative examples in more detail, and explain how to interpret and simplify the rules.\n\n\n\n §.§ Fast Echo Cancellation for Disorder-Related Terms\n\nLet us now focus our attention on first-order rules related to disorder-disorder and disorder-Ising terms.\n\nTo derive the first and second conditions in Tab. <ref>, which hold with full generality and no restrictions on the frame matrix, let us examine the structure of the first-order Magnus contribution shown in Eq. (<ref>).\n\nThere, we found that a generic first-order Magnus contribution can be rewritten as a product between the current frame contribution of one term and the cumulative contribution of another term, together with a factor corresponding to the total zeroth order contribution of both terms.\n\nPlugging the disorder and Ising expressions in Eqs. (<ref>-<ref>) into Eq. (<ref>) results in the rules in the third column of Tab. <ref>.\n\nDue to this common structure, we see in Tab. <ref> that the decoupling of first-order disorder-disorder and disorder-Ising contributions are almost identical, except replacing one term from scaling with F_μ,k to be scaling instead as F_μ,k^2=|F_μ,k| for F_μ,k=0,± 1.\n\nWe can thus decouple the primary contribution of both of these first-order effects with the same pulse sequence block, simply by arranging the frames to form fast spin echoes.\n\nThese fast spin echoes are illustrated in Fig. <ref>(a).\n\nTo see this, first note that the commutator pre-factor implies that there will be a nonzero contribution only when μ≠ν.\n\nWith a spin echo block, the contribution from F_μ,k flips and cancels, while the sum F_<k^ν or I_<k^ν is along a different axis and thus remains unchanged during this time.\n\nMoreover, the average zeroth order disorder Hamiltonian over the entire pulse sequence will also vanish due to the spin echo blocks.\n\nThus, the main term rules in conditions 1 and 2 are satisfied in Tab. <ref>.\n\nIn column 4 of Tab. <ref>, we derived additional corrections to the expressions, originating from the pulse-induced overlaps in Eq. (<ref>).\n\nInterestingly, we find again that the different terms share some common structures, where they can be related to each other simply by replacing F_ν,k by |F_ν,k|.\n\nMoreover, we find that the finite pulse duration corrections for first-order disorder-disorder terms are proportional to that of rotation angle errors at zeroth-order <cit.>, making it automatically satisfied if the latter has been incorporated into sequence design.\n\nWe also include an example of a second-order rule involving disorder only in Tab. <ref>.\n\nAs one can see, the structure bears many similarities with the first-order contributions.\n\nIn the case where the pulse sequence is composed of fast echoes, we can further simplify the expressions.\n\n\n\n §.§ Block Symmetrization for Ising-Ising Terms\n\nMoving on to the first-order Ising-Ising terms (row 3 of Tab. <ref>), we see that the structure of the expression again has many similarities as above.\n\nHowever, here we have grouped the terms slightly differently, since the zeroth-order sum I̅^ν=∑_k |F_k^ν|(τ_k+τ_p) will always be nonzero.\n\nExpressed in this way, first-order Ising-Ising interactions are decoupled by ensuring that for every pair of axes μ and ν, the cumulative occurrences of ν frames before and after each μ frame are equal, i.e. the appearance of the two frames is balanced.\n\nBased on this result, we find that a simple motif is to perform a mirror symmetrization <cit.> of the frames within each block, as illustrated in Fig. <ref>(b).\n\nNote that since the coefficient of the Ising contribution is identical regardless of the sign of the frame, only the relative frame ordering matters and not the sign.\n\nIf within each block the frames are balanced along the x̂, ŷ and ẑ directions, and mirror symmetrization in terms of ordering is performed, then using the pulse cycle decoupling principle, the first-order Ising-Ising contribution will be cancelled.\n\nHere, contrary to global mirror symmetrization, we find that symmetrization within local blocks can also be a useful tool to effectively cancel certain first-order contributions.\n\nThe finite pulse duration correction terms for the first-order Ising-Ising contribution are shown in the fourth column of the Tab. <ref>.\n\nThey resemble the other correction terms, but with additional absolute value signs, and can be easily incorporated as decoupling rules in a similar fashion.\n \n\n\n §.§ Dipole Cancellation and Row Balancing for Heisenberg-Related Terms\n\nLet us now examine terms related to the Heisenberg interaction S⃗·S⃗.\n\nAs noted in Eq. (<ref>), the Heisenberg interaction is invariant under frame transformations.\n\nThus, the first-order expression resulting from the Heisenberg term and a different term will be the commutator between a constant term (Heisenberg), and a term that depends on the frame transformations (other).\n\nThe inclusion of the time integrals then result in the expressions in row 4-6 of Tab. <ref>, where there are no first-order contributions between two Heisenberg Hamiltonians because they are identical and thus commute.\n\nIn this case, because the Heisenberg Hamiltonian is invariant, the frame length extension becomes exact, and we do not need to include any additional finite pulse corrections in the table.\n\nTo explore in more detail what the resulting rules mean, let us first recall the expressions for cancelling disorder at zeroth order.\n\nHere, we found that in order for disorder to be cancelled at zeroth order, we require the average disorder along each axis to vanish, i.e.\n\n    ∑_k=1^n F_μ,k(τ_k+4/πτ_p)=0.\n\n\nA useful physical analogy to interpret this expression is to associate a positive(negative) charge with F_μ,a=+1(-1).\n\nThe zeroth-order decoupling condition then dictates that the average charge is 0.\n\nGeneralizing the analogy to first-order terms, the first-order term of a given Hamiltonian contribution with the invariant Heisenberg Hamiltonian will be proportional to the given Hamiltonian, weighted by its location in time in the sequence.\n\nThis is because of the integration limits in Eq. (<ref>), where the relative ordering of the time variable values of the two Hamiltonians determines the sign of the expression.\n\nFurthering the electromagnetic analogy, this results in a distance weighting factor from the center of the pulse sequence timing.\n\nThus, the first-order expression resembles the expression of a dipole, with charge given by F_μ,k at each time point and distance being the distance in time to the center of the sequence.\n\nCancelling this contribution requires the net dipole along each axis to vanish, as illustrated in Fig. <ref>(c).\n\nWe note that this intuition was key to improving decoupling pulse sequence performance in Sec. <ref>, and led to insights regarding the dichotomy between AC field sensing and decoupling for existing pulse sequences described in Ref. <cit.>.\n\nSimilarly, we can also analyze the expression for cross-terms between Ising interactions and Heisenberg interactions, simply by replacing the general charge by a non-negative charge value (|F_μ,k|).\n\nWith only positive charges, the condition can also be alternatively viewed geometrically as balancing frame weights in each row;\n\nas illustrated in Fig. <ref>(d), one can imagine a fulcrum placed at the middle of a sequence, and for a given axis, placing a weight whenever the frame is along this axis (regardless of it being a positive or negative frame); the rule then becomes that the row would balance.\n\n\n\n§ DETAILED SEQUENCE DESIGN PROCEDURE\n\n\n\nWe now utilize the preceding insights to design higher-order pulse sequences for various applications, focusing on the case of interacting spin ensembles dominated by on-site disorder <cit.>.\n\nThe result is a pulse sequence that decouples all zeroth-order and first-order contributions in the Magnus expansion, and is robust against disorder to second order, which we name DROID-R2D2 (Disorder RObust Interaction Decoupling - Robust To Disorder 2nd order), and a pulse sequence that achieves similar results but also has interesting AC field sensing capabilities <cit.>.\n\nThese pulse sequences were crucial for a variety of our recent experiments in dynamical decoupling, quantum metrology <cit.>, and Hamiltonian engineering <cit.>.\n\nWe will illustrate the complete design procedure in detail, and mention a few practical tricks to improve the efficiency of sequence screening and to examine larger design spaces of pulse sequences.\n\n\n    \n  1. Choose target decoupling rules\n\n\nThe first step is to determine the set of decoupling rules that should be satisfied by the desired sequence.\n\nThe choice of this set is usually informed by several factors: First, the target application may influence which terms need to be decoupled.\n\nFor example, if we wish to study many-body dynamics in a disordered system, we may wish to preserve the disorder term while engineering interactions.\n\nAlternatively, if we are interested in quantum sensing, then there may be additional design rules that are imposed to maximize sensitivity.\n\n\n\n\n\nSecond, the experimental system characteristics may inform which contributions are most important to decouple.\n\nAs an example, dense electronic spin ensembles, such as nitrogen-vacancy (NV) centers and nitrogen (P1) defects in diamond, or rare earth ions, typically have much larger disorder than interactions <cit.>.\n\nThus, it is much more important to address disorder-related effects to higher-order than interaction-related effects.\n\nThe relative importance of different contributions can be made more quantitative by using our expressions for various terms to estimate the typical total magnitude of each of the Hamiltonian terms.\n\nFinally, for a given pulse sequence, we can also diagnose the dominant residual term by examining a cluster of a few spins, typically two or three, and computing the exact unitary for a set of disorder and interaction values.\n\nTaking the matrix log of the unitary yields the exact effective Hamiltonian, and performing polynomial fits of the dominant terms with respect to the disorder and interaction strengths informs us which type of contribution is the largest, as well as the order at which it contributes in the Magnus expansion.\n\nFor example, in Fig. <ref>(a), we find that the dominant error terms for the existing DROID sequence from Ref. <cit.> are the XZ and ZX components of the Hamiltonians, when decomposed in the Pauli basis.\n\nIn Fig. <ref>(a,b), we find that the dominant scaling of this term is linear in both the disorder strength and interaction strength, suggesting that it originates from a first-order cross-term between them.\n\nThis motivated us to systematically include decoupling rules that target this effect.\n\nIn practice, we search for sequences by randomly enumerating those of a fixed length that satisfy a chosen set of rules (see below for a description of how to efficiently enforce rules).\n\nWe iterate the preceding error diagnosis step several times by identifying the dominant contributions for typical pulse sequences, and adding in new rules to fully decouple them.\n\nEach addition of a new dominant rule eliminates the most poorly performing sequences, and increases the probability of enumerating a sequence with high coherence time; see Fig. 2 of the accompanying paper <cit.>.\n\nFollowing this procedure leads us to include the following decoupling rules for our disorder-dominated NV center ensemble: decoupling of all zeroth-order conditions, as described in Ref. <cit.>; decoupling of all first-order conditions involving at least one factor of disorder, including disorder-disorder cross-terms, disorder-Ising and disorder-Heisenberg cross-terms, for both free evolution times and pulses; second-order disorder-disorder-disorder cross-terms, for both free evolution times and pulses.\n\n\n    \n  2. Efficiently construct candidate frame sets\n\n\nWith the set of target decoupling rules in hand, we now discuss how to efficiently enumerate pulse sequences satisfying a set of imposed decoupling rules.\n\nThe number of possible frame sets without any additional constraints is combinatorially large.\n\nFor example, even a sequence consisting of 12 free evolution times connected by π/2 pulses, including intermediate frames for the finite pulse durations (e.g. the frame half way through π pulses or composite π/2 pulses), admits approximately 4^23≈ 10^14 distinct pulse sequences (each frame is connected to 4 other frames by π/2 pulses, and the first frame is fixed to be +ẑ).\n\nHowever the vast majority of these sequences will not satisfy our rules. \n\nTherefore it is essential to enumerate only sequences that satisfy them.\n\nFor the disorder-dominated interacting NV ensembles we work with, we choose to impose the following structures to efficiently pre-screen pulse sequences:\n\nwe require that all frames, including both free evolution and pulse frames, come in spin echo pairs, in order to echo out disorder on the fastest possible timescale.\n\nIn addition, we require an equal number of elements along each row, so as to symmetrize interactions.\n\nFinally, we impose the “dipole\" rules for first-order disorder-Heisenberg cross-terms, by requiring there to be an equal number of +- and -+ spin echoes.\n\nIn order to directly restrict the search space to candidate frame sequences that satisfy the above rules, we separately enumerate the locations of X, Y and Z spin echo pairs, and enumerate the echo ordering signs (i.e. whether the echo frames has the ordering +- or -+) of both free evolution frames and finite pulse frames.\n\nWe then combine these pieces of information to generate candidate frame sequences, imposing the additional constraint that each frame must be distinct from the two neighboring frames, to ensure that a π/2 pulse is applied and the pulse error calculation is accurate.\n\n\n    \n  3. Screen frame sets using decoupling rules\n\n\nHaving generated candidate frame sets that already have a number of rules enforced by construction, we now proceed to screen through them by applying the remaining decoupling rules.\n\nIn order to speed up the screening process, the key insight is to transform the original rules into a vectorized form, such that fast matrix computation can be performed, significantly reducing the run time.\n\nThis is achieved by labeling the frames as 1 to 6 for +x,+y,+z,-x,-y,-z, and noting that the rules become simple cumulative sums of index matching results when expressed in this fashion.\n\nWe then further simplify them based on known decoupling structures (e.g. the rapid spin echoes built into the sequence).\n\nMoreover, when evaluating some of the higher-order expressions in full generality, we can keep track of the cumulative integral of lower-order terms <cit.>, which reduces the time complexity of computing many such terms to linear in the sequence length, rather than a higher polynomial scaling.\n\n\n    \n  4. Verify performance and further optimization\n\n\nTo optimize the performance of the pulse sequences, we further symmetrize the pulse sequence to reduce higher-order error contributions.\n\nHere, for dynamical decoupling, we employ the symmetrization used in Ref. <cit.>, where the frames are repeated twice, but the frame ordering is reversed and sign of all frames flipped in the second repetition.\n\nFor the quantum metrology pulse sequences designed here and in Ref. <cit.>, this symmetrization will affect the magnetic field sensitivity, and consequently we employ a mirror-symmetrization instead, where the frame ordering is reversed but the sign is not flipped in the second repetition.\n\nFinally, we numerically simulate the performance of these pulse sequences to identify the ones with the longest decoupling timescales.\n\nEffective Hamiltonian extraction using the matrix log of the unitary can identify dominant error terms for the pulse sequences employed, and the whole design procedure can be repeated with an improved rule set.\n\nFor the above final set of decoupling rules, we no longer find a single contribution that dominates over the others, instead seeing a competition between several different contributions.\n\n\n\n\n\n §.§ Resulting Pulse Sequences\n\n\nUsing the decoupling rules described above, we designed pulse sequences for dynamical interaction decoupling, many-body physics, and quantum metrology.\n\nFor dynamical decoupling and Hamiltonian engineering, one of the best pulse sequences we identified, DROID-R2D2, is shown in Fig. <ref>(b).\n\nWe find that compared to the previous best pulse sequence DROID <cit.>, as shown in Fig. <ref>(a), that had significant residual first-order cross terms (Fig. <ref>(a)), primarily cross terms between disorder and first-order Heisenberg interactions, the residual errors when examining the effective Hamiltonian are much reduced (Fig. <ref>(b)).\n\nMoreover, we can adapt this pulse sequence to perform Hamiltonian engineering by adjusting the frame durations along the x̂, ŷ and ẑ axes <cit.>, resulting in a tunable interaction Hamiltonian\n\n\n    H_XXZ=∑_ijJ_ij[1+λ/3(S_i^xS_j^x+S_i^yS_j^y)+1-2λ/3S_i^zS_j^z],\n\n\nwhere λ is a coefficient that tunes the XXZ Hamiltonian.\n\nWe find that our techniques also significantly reduce the error in engineering a wide range of generic XXZ Hamiltonians.\n\nIn Fig. <ref>(c,d), we see that both two-body and single-body imperfection terms are much smaller across a wide range of different Hamiltonians, which can help improve the fidelity of Hamiltonian engineering and reduce systematic artifacts.\n\nThese techniques can be readily generalized to engineer XYZ Hamiltonians, with different coefficients in front of each term, or even more complex many-body Hamiltonians.\n\nThe same techniques can also be used to design pulse sequences for improved quantum sensing, as we explain in more detail in Ref. <cit.>.\n\nThe key insight is that current pulse sequences for quantum sensing <cit.>, which periodically flip the spin along each axis with the same frequency as the target signal, will always result in a violation of the “net dipole cancellation\" rule in Fig. <ref>(c) for first-order disorder-Heisenberg terms.\n\nThis imposes a fundamental trade-off between sensitivity and decoupling quality for current pulse sequences.\n\nWith this insight from higher-order decoupling rules, we are able to design the new pulse sequence DIRAC2 (DIsorder Robust AC sensing with period 2), as shown in Fig. <ref>(c), which circumvents this issue by targeting a sensing signal half the frequency of frame flipping, thereby fully cancelling all first-order Magnus contributions while also increasing the rate of spin echo decoupling, leading to better performance.\n\nSee Ref. <cit.> for a more detailed description.\n\n\n\n§ DISCUSSION AND CONCLUSION\n\n\nWe have developed a general framework for dynamical Hamiltonian engineering that includes higher-order considerations.\n\nContrary to the naive expectation, we found that many higher-order decoupling conditions can still have simple, intuitive interpretations, particularly when the pulse sequence is designed to have certain structures in it.\n\nWe analytically derived a number of decoupling rules for higher-order contributions, and used them to design robust pulse sequences in disorder-dominated systems for dynamical decoupling, Hamiltonian engineering, and quantum sensing, significantly improving upon state-of-the-art pulse sequences.\n\nWhile we have focused on the application of our techniques to the case of electronic spin ensembles, where disorder is much larger than spin-spin interactions, we believe that our techniques can be applied to disparate systems such as NMR <cit.>, simply by changing which rules are emphasized and included at higher-order.\n\nIt may also be interesting to further extend the techniques to even higher-order than the ones that we have considered here <cit.>, or to examine alternative expansions beyond the Magnus expansion <cit.>.\n\nIn our formalism, the contributions from higher-order terms are decomposed into an operator commutation portion, and a portion that relates to the frame matrix and pre-factors.\n\nThis also makes the extension to higher-spin systems relatively straightforward, and can be combined with recent methods for robust Hamiltonian engineering with higher-spin systems <cit.>.\n\nWith these further improvements, we believe that our framework presents a key tool for advanced Hamiltonian engineering pulse sequence design, with broad applications in dynamical decoupling, quantum many-body physics, and quantum metrology.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe thank J. Choi, A. Douglas, H. Gao, N. Maskara, P. Peng, M. Yu for helpful discussions. This work was supported in part by CUA, HQI, NSSEFF, ARO MURI, DARPA DRINQS, Moore Foundation GBMF-4306, NSF PHY-1506284.\n\n\n\n\n\n§ CONVENTIONS\n\n\nSee Tab. <ref> for a summary of the conventions employed in this manuscript.\n\n\n\n\n§ DERIVATION OF FIRST-ORDER MAGNUS FORMALISM\n\n\n\nTo develop the full expression at first order, we extend the formalism developed in Ref. <cit.>. To keep the expressions fully general, we do not restrict to a specific qubit Hamiltonian here, and specialize to the dipolar Hamiltonian only in the following sections.\n\nFollowing Ref. <cit.>, we can separate the evolution into free evolution periods and evolution during pulses.\n\nWe will write the coefficient of a given operator ^α during the k-th free evolution period as c_α(t)=c_α,k, and during the π/2 pulse after the k-th free evolution period as\n\n    c_α(t)=_α,k(t/r)+q_α,k,k+1(t/r)+_α,k+1(t/r).\n\nHere, r is the rate of angular precession under the applied pulses, and the rotation angles during the π/2 pulse are given by θ=t/r.\n\nThe first term _α,k(θ) describes the finite pulse duration contribution from the k-th frame that precedes the pulse, while _α,k+1(θ) describes the contribution from the (k+1)-th frame that follows the pulse.\n\nq_α,k,k+1(θ) is an additional cross-term between the two frames that arises for certain types of interaction terms.\n\nNote that similar to Ref. <cit.>, in our pulse sequence composed of π/2 pulses and π pulses, we treat each π pulse as a combination of two π/2 pulses with zero free evolution time in between.\n\nAs a concrete example to illustrate these terms, let us consider a rotation that transformed the S^z operator into S^x, i.e. S̃^z(θ)=cosθ S^z+sinθ S^x.\n\nFor an Ising interaction H_I=JS_i^zS_j^z, the time-dependent operator would be\n\n    H̃_I(t)   =J[cos^2θ S_i^zS_j^z+sinθcosθ(S_i^xS_j^z+S_i^zS_j^x)+sin^2θ S_i^xS_j^x].\n\nThe three terms in the parenthesis correspond to the _α,k(θ), q_α,k,k+1(θ) and _α,k+1(θ) terms, respectively.\n\nWith this representation in hand, we proceed by rewriting the integral in Eq. (<ref>) as a summation over the distinct blocks.\n\nLet us examine the first term, which integrates all c_β terms occurring temporally before c_α:\n\n    A=∫_0^Tdt_1c_α(t_1)∫_0^t_1dt_2c_β(t_2)\n\n\nTo compute this, we first define the integral of the coefficient of a given frame, including its finite pulse duration effects:\n\n    C_α,k=r∫_0^π/2_α,k(θ)dθ+∫_0^τ_kc_α,kdt+r∫_0^π/2_α,k(θ)dθ.\n\n\nThis can be viewed as a simple extension of the effective free evolution time.\n\nWe can then decompose the inner integral in Eq. (<ref>) into three parts (ignoring additional contributions from q_α,k,k+1-terms for now): a contribution from previous, non-overlapping free evolution times, together with their surrounding pulses (A_free); a contribution from integrating both time variables within the same free evolution period, corresponding to first-order contributions within the same frame (C_α,β,k^(1)); and a further correction arising from the pulse overlaps of neighboring free evolution times (P_k,k+1,α,β).\n\nThis is illustrated in Fig. <ref>.\n\nMore concretely, the first term describes contributions where t_1 lies within the k-th frame, and t_2 originates from an earlier frame. As most of these contributions will be temporally non-overlapping, we can factorize these contributions as\n\n    A_free=∑_k=1^n C_α,k∑_j=1^k-1C_β,j.\n\n\nThe next term describes contributions where both t_1 and t_2 come from the k-th frame, with t_2<t_1∈[t_k-1+τ_k-1/2,t_k+1-τ_k+1/2], i.e. the first-order Magnus contribution of a frame with itself.\n\nWe can explicitly write this as\n\n    C^(1)_α,β,k=∫_t_k-1+τ_k-1/2^t_k+1-τ_k+1/2c_α(t_1)dt_1∫_t_k-1+τ_k-1/2^t_1c_β(t_2)dt_2.\n\nNote that this term is usually zero in our case, as the commutator [^α,^β] vanishes when α=β, and otherwise c_α, c_β are both non-zero within the same free evolution period only when they originate from different types of non-commuting Hamiltonians, e.g. one coming from local S^z disorder, and the other coming from Heisenberg interactions.\n\nFinally, we have additional corrections P_k,k+1,α,β that arise from the overlap in terms due to the pulses: for the k-th frame, we overcounted the overlap contribution with the previous (k-1)-th frame by assuming that the k-th frame came completely after the (k-1)-th frame, but undercounted the overlap contribution with the next (k+1)-th frame.\n\nExplicit calculation shows that this results in a first order pulse correction that is related to both the preceding and subsequent frame:\n\n    P_k,k+1,α,β=∫_0^π/2_α,k(θ_1)rdθ_1∫_0^θ_1_β,k+1(θ_2)rdθ_2-∫_0^π/2_α,k+1(θ_1)rdθ_1∫_θ_1^π/2_β,k(θ_2)rdθ_2.\n\n\nThus, neglecting all terms that directly dependent on multiple pulses (see q-terms below), we can express the integral in a clean manner as\n\n    A=A_free+∑_k=1^n-1P_k,k+1,α,β+∑_k=1^nC^(1)_α,β,k.\n\n\nFor certain interaction terms such as the Ising Hamiltonian, there is an additional contribution we need to keep track of, the q_α,k,k+1(θ) terms described in Eq. (<ref>).\n\nThese terms come from the fact that the Ising interaction transforms as the square of the frame coefficients, introducing additional cross-terms when expanding the square.\n\nThese terms are ignored in the main text, as they are negligible for our disorder-dominated system, but we will analyze them in more detail here.\n\nWe can perform a similar decomposition of the terms as above, now adding in the contributions from the q-terms.\n\nWe can treat the q-terms as a special type of free evolution frame, and decompose the sum into the three types again, this time keeping track also of whether the other term is a q-term or a regular free evolution period.\n\nSimilar to Eq. (<ref>), we can evaluate the first-order contributions involving a single q-term and a single free evolution frame as\n\n    QA_free=∑_k=1^nC_α,k∑_j=1^k-1Q_β,j,j+1+∑_k=1^nQ_α,k,k+1∑_j=1^kC_β,j,\n\nwhere\n\n    Q_α,k,k+1=∫_0^π/2q_α,k,k+1(θ)dθ\n\nis the integral of the q-term during a given pulse.\n\nIn analogy to the corrections P_k,k+1,α,β found above, we also have similar corrections here\n\n    QP_k,k+1,α,β   =∫_0^π/2q_α,k,k+1(θ_1)rdθ_1∫_0^θ_1_β,k+1(θ_2)rdθ_2-∫_0^π/2q_α,k,k+1(θ_1)rdθ_1∫_θ_1^π/2_β,k(θ_2)rdθ_2\n       +∫_0^π/2_α,k(θ_1)rdθ_1∫_0^θ_1q_β,k,k+1(θ_2)rdθ_2-∫_0^π/2_α,k(θ_1)rdθ_1∫_θ_1^π/2q_β,k-1,k(θ_2)rdθ_2.\n\n\nFinally, we also have corrections coming from the first-order contributions between q-terms at different times and in the same pulse\n\n    Q_self=∑_k=1^nQ_α,k,k+1∑_l=1^k-1Q_β, l,l+1+∑_k=1^n∫_0^π/2q_α,k,k+1(θ_1)rdθ_1∫_θ_1^π/2q_β,k,k+1(θ_2)rdθ_2.\n\n\nPutting all of this together, the final, complete expression for first-order terms is\n\n    A=A_free+∑_k=1^n-1P_k,k+1,α,β+∑_k=1^nC^(1)_α,β,k+QA_free+Q_self+∑_k=1^nQP_k,k+1,α,β\n\n\n\n\n§ DERIVATION OF FIRST-ORDER CANCELLATION RULES\n\n\n\n\n\nWe will now apply the preceding general calculations to specific first-order terms, in order to derive first-order decoupling rules.\n\nAs we shall see, in many cases of interest, a lot of the terms in Eq. (<ref>) will drop out, resulting in simple expressions.\n\n\n\n §.§ Disorder-Disorder Rules\n\nLet us start with first-order disorder-disorder contributions, involving commutators between disorder at different times.\n\nSince this Hamiltonian involves only single-qubit terms, there will be no q-terms.\n\nFurthermore, there are no C^(1)_α,β,k terms, as the operator in each frame commutes with itself.\n\nWe thus have\n\n    A_dis-dis=A_free+∑_k=1^n-1P_k,k+1,α,β.\n\n\nExamining the transformation of the operators for different frames, we have\n\n    c_α,k   → F_μ,k,\n    _α,k(θ)   → F_μ,ksin(θ),\n    _α,k(θ)   → F_μ,kcos(θ),\n    \n    C_α,k   = F_μ,k(τ_k+4τ_p/π).\n\n\nPlugging this into the preceding definitions of the individual terms, we find\n\n    A_free   =∑_k=1^nF_μ,k(τ_k+4τ_p/π)∑_l=1^k-1F_ν,l(τ_l+4τ_p/π),\n    \n    P_k,k+1,dis,dis   = (F_μ,kF_ν,k+1-F_μ,k+1F_ν,k)(1-π/4)(2τ_p/π)^2,\n\n\nFurther plugging this into the full expression Eq. (<ref>) for the first-order disorder-disorder term, we arrive at the full expression for the main term\n\n    ∑_k=1^nF_μ,k(τ_k+4/πτ_p)F^ν_<k-1/2F̅^μF̅^ν,\n\nand the finite pulse correction\n\n    (1-π/4)(2τ_p/π)∑_k=1^nF_μ,kF_ν,k+1-F_ν,kF_μ,k+1,\n\nas described in Tab. <ref>.\n\nBased on these expressions, we can formulate relatively simple rules for their cancellation in sequence design.\n\nThe expression P_k,k+1,α,β involves a term that can be rewritten as F⃗_k×F⃗_k+1, and thus has the same conditions for cancellation as zeroth-order rotation angle errors <cit.>.\n\nDue to the rapid spin echo structure found in many decoupling sequences for disorder-dominated systems, e.g. DROID-60 in Ref. <cit.>, the majority of terms in A_free are also cancelled in the inner sum, and the only contribution remaining is from the commutator between a spin echo pair and the intermediate pulse frame that the π pulse uses.\n\nTo give a concrete example of this remaining contribution, consider a sequence of two π pulses around X, which implements the following frame transformations +Z → +Y → -Z → -Y, with +Z and -Z being longer free evolution frames, and +Y and -Y being shorter frames with zero free evolution time and only pulse effects.\n\nThe first-order contribution from this will then be proportional to the commutator between Z and Y, and changes sign both when we flip the sign of one of the operators (e.g. +Z → -Y → -Z → +Y), as well as when we switch the order of the operators (e.g. +Y → +Z → -Y → -Z).\n\nThus, this term has the same transformation properties as a rotation angle error that acts only within such spin echo blocks.\n\n\n\n §.§ Disorder-Heisenberg Rules\n\nThe next term we consider is the first-order disorder-Heisenberg contribution, which was the dominant imperfection in the previous DROID-60 sequence <cit.> and key to the design of improved sensing sequences such as DIRAC2 <cit.>.\n\nAs shown in Eq. (<ref>), we can choose an index ordering where disorder is after Heisenberg interactions, such that α is a disorder index and β is a Heisenberg interaction index.\n\nThe case where both are Heisenberg indices gives zero contribution, as the operator terms are equal to the fixed Heisenberg Hamiltonian and hence commute.\n\nAs the Heisenberg interaction is invariant under frame transformations, the coefficients can be chosen to take a particularly simple form:\n\n    c_β,k   → 1,\n        \n    _β,k(θ)   → 1,\n        \n    _β,k(θ)   → 0,\n        \n    \n        C_β,k   =τ_k+τ_p.\n\nPlugging these into the preceding expressions, we find\n\n    A_free   =∑_k=1^nF_μ,k(τ_k+4τ_p/π)∑_j=1^k-1(τ_j+τ_p),\n    \n    P_k,k+1,α,β   =F_μ,k(π/2-1)(2τ_p/π)^2,\n    \n    C_α,β,k^(1)   =F_μ,k[∫_0^π/2sin(θ_1)rdθ_1∫_0^θ_1rdθ_2+∫_0^τ_kdt_1(τ_p+∫_0^t_1dt_2)+∫_0^π/2cos(θ)rdθ(τ_p+τ_k)]\n       =F_μ,k[(2τ_p/π)^2+τ_kτ_p+τ_k^2/2+(τ_p+τ_k)(2τ_p/π)].\n\n\nWe can simplify the sum of the last two contributions\n\n    P_k,k+1,α,β+C^(1)_α,β,k   =F_μ,k(τ_kτ_p+1/2τ_k^2+(2τ_p+τ_k)(2τ_p/π))\n       =F_μ,k(τ_p+1/2τ_k)(τ_k+4τ_p/π).\n\n\nAdding the corrections together, we get\n\n    A=∑_k=1^nF_μ,k(τ_k+4τ_p/π)∑_j=1^k-1(τ_j+τ_p+τ_p+1/2τ_k)=∑_k=1^nF_μ,kt_k(τ_k+4τ_p/π),\n\nwhere t_k is the midpoint of the kth free evolution frame.\n\nThe remaining term in Eq. (<ref>) can be evaluated to be\n\n    1/2_α(T)_β(T)=F̅^μT/2,\n\nwhich combined give us the full algebraic condition for first-order disorder-Heisenberg decoupling\n\n    ∑_k=1^nF_μ,k(τ_k+4/πτ_p)(t_k-T/2).\n\n\nAs described in the main text and in Ref. <cit.>, there is a relatively simple intuition for these contributions, which we visualize using dipole balancing.\n\nIf we associate a charge to each frame, with +1(-1) values of F_μ,k being a positive(negative) charge, then the above expression corresponds to the product of charges (F_μ,k) with their center-of-mass location (t_k-T/2), which is precisely the definition of a dipole.\n\nThus, geometrically, we can visualize the cancellation of first-order disorder-Heisenberg contributions as requiring that the net dipole corresponding to a frame configuration to be 0.\n\n\n\n §.§ Disorder-Ising Rules\n\nNext we move on to the Ising contributions, starting with first-order disorder-Ising terms.\n\nFor this, we use c_α,k from the disorder term, and we use the following for the c_β,k terms:\n\n    c_β,k   → |F_ν,k|, \n    \n    _β,k(θ)   → |F_ν,k|sin^2(θ),\n    \n    _β,k(θ)   → |F_ν,k|cos^2(θ),\n    \n    \n    q_β,k,k+1(θ)   → F_ν,kF_ρ,k+1sin(θ)cos(θ),\n    \n    \n    C_β,k   =|F_ν,k|(τ_k+τ_p),\n    \n    \n    Q_β,k,k+1   =F_ν,kF_ρ,k+1τ_p/π.\n\n\nPlugging these into the definitions for the individual terms, we find\n\n\n    A_free   =∑_k=1^nF_μ,k(τ_k+4τ_p/π)∑_l=1^k-1|F_ν,l|(τ_l+τ_p),\n    \n    \n    P_k,k+1,dis,isi   =(F_μ,k|F_ν,k+1|-F_μ,k+1|F_ν,k|)(π/4-2/3)(2τ_p/π)^2.\n\n\nThe term C^(1)_α,β,k will not contribute, as the disorder and Ising Hamiltonian within the same free evolution time commute with each other, [S^μ⊗ I, S^μ⊗ S^μ]=0.\n\nThe algebraic conditions in the Tab. <ref> are based on the preceding expressions, and ignore the q-terms.\n\nCombining A_free with the rest of the terms gives the main term:\n\n    ∑_k=1^nF_μ,k(τ_k+4/πτ_p)I_<k^ν-1/2F̅^μI̅^ν.\n\nSumming over pulses in the pulse term gives the finite pulse correction\n\n    ∑_k=1^n(2τ_p/π)^2(π/4-2/3)(F_μ,k|F_ν,k+1|-|F_ν,k|F_μ,k+1).\n\nThe main term will vanish with the same fast spin echo blocks as that found in the first-order disorder-disorder term, and the finite pulse correction can be viewed as a simple generalization of, e.g. the chirality condition in Ref. <cit.>.\n\nWe now further evaluate the q-terms.\n\nAs any two adjacent frames will have different operators due to the frame change, we will have no contribution when ν=ρ. Explicitly plugging into the above expressions gives\n\n    QA_free   =∑_k=1^nF_α,k(τ_k+4/πτ_p)∑_j=1^k-1F_ν,jF_ρ,j+1τ_p/π,\n    \n    \n    QP_k,k+1,dis,isi   =1/6(F_μ,kF_ν,kF_ρ,k+1- F_μ,kF_ν,k-1F_ρ,k)(2τ_p/π)^2,\n    \n    \n    Q_self   =0.\n\n\n\n\n §.§ Ising-Ising Rules\n\nWe will now compute the first-order Ising-Ising term. Using the definitions of the individual terms as in the previous calculation (taking both α and β to be Ising indices), we find\n\n    A_free   =∑_k=1^n|F_μ,k|(τ_k+τ_p)∑_l=1^k-1|F_ν,l|(τ_l+τ_p)\n       =∑_k=1^n|F_μ,k|(τ_k+τ_p)I_<a^ν,\n    \n    P_k,k+1,isi,isi   =(|F_μ,k||F_ν,k+1|-|F_μ,k+1||F_ν,k|)(π^2/32-1/4)(2τ_p/π)^2\n\nSimilar to the disorder-disorder case and the disorder-Ising case, we have no contribution from the C^(1)_α,β,k terms. Next, we calculate the contribution from the q-terms. Directly plugging things in\n\n    QA_free   =∑_k=1^n|F_μ,k|(τ_k+τ_p)∑_j=1^k-1F_ν,kF_ρ,k+1τ_p/π+∑_k=1^nF_μ,kF_ρ,k+1τ_p/π∑_l=1^k|F_ν,l|(τ_l+τ_p),\n    \n    QP_k,k+1,isi,isi   =τ_p^2/8π(F_μ,kF_λ,k+1|F_ν,k+1|-F_μ,kF_λ,k+1|F_ν,k|+|F_μ,k|F_ν,kF_ρ,k+1-|F_μ,k|F_ν,k-1F_ρ,k),\n    \n    Q_self   =∑_k=1^nF_μ,kF_λ,k+1τ_p/π∑_l=1^k-1F_ν,lF_ρ,l+1τ_p/π+∑_k=1^nτ_p^2/2π^2F_μ,kF_λ,k+1F_ν,kF_ρ,k+1.\n\n\n\n\n §.§ Ising-Heisenberg Rules\n\nFinally, we calculate the first-order Ising-Heisenberg terms.\n\nTaking α to be the Ising terms, we can repeat the derivation from disorder-Heisenberg rules to find that the main terms can be written as\n\n    ∑_k=1^n|F_μ,k|(τ_k+τ_p)(t_k-T/2),\n\nwhich simply replaces the F_μ,k in the original disorder-Heisenberg rule by |F_μ,k|.\n\nAlthough this term is no longer cancelled by imposing a zero net dipole, we can still formulate a simple condition for it to be cancelled: if we have “balanced\" rows, in which the center of mass of each row is in the middle, then this term will be cancelled.\n\nFor example, a simple mirror symmetrization will cancel this first-order term.\n\nFor the q-terms, using the expressions found above, we can easily calculate\n\n    QA_free   =∑_k=1^nF_μ,kF_λ,k+1τ_p/π∑_l=1^k(τ_l+τ_p),\n    \n    QP_k,k+1,isi,heis   =π/8(2τ_p/π)^2F_μ,kF_λ,k+1,\n    \n    \n    Q_free   =0.\n\nWe note that after summing the pulse term over k, we can add the two expressions together to obtain\n\n    Q_tot=∑_k=1^nF_μ,kF_λ,k+1τ_p/π(∑_l=1^k(τ_l+τ_p)+τ_p/2).\n\nWe note that the second sum is exactly the time at the middle of the pulse, similarly to the other Heisenberg rules. This tells us that we can cancel this the same way, by balancing the center of mass for terms of the form F_μ,kF_λ,k+1.\n\n\n\n §.§ Summary of Two Qubit Commutators\n\nWe lastly summarize the general commutators of the form 𝒪_α, 𝒪_β over a basis of two-qubit operators, { O_α}_α, to be defined shortly. To this end, it is convienent to write a generic two-qubit Hamiltonian in the form of a 4 × 4 matrix 𝒜, \n\n    H(𝒜)    = ∑_μν=0^3 𝒜_μν σ_μ⊗σ_ν,\n\nwhere we have defined σ_μ = ( 1, σ⃗) as a 4-vector of Pauli operators, including the 2 × 2 identity matrix 1. It follows that a native symmetric secular Hamiltonian can be specified by the matrix\n\n    𝒜   = ([       0       0       0     h_2;       0     g_0       0       0;       0       0     g_0       0;     h_1       0       0 g_0+g_1;         ]),\n\nparameterized by disorder fields h_1,h_2 and Heisenberg/Ising interactions g_0, g_1. Note that we have introduced horizontal and vertical bars to visually distinguish between interactions and disorder. As explained in the main-text, under global driving mapping S_z → F_μ S_μ the secular Hamiltonian will depend only on this column vector F. This representation of the 2-qubit interaction will thus transform as \n\n    𝒜↦𝒜'( F)   =([                                               h_2 F^T                  ;                                                                        ;             h_1 F                   g_0 1 + g_1  FF^T                  ;                                                                        ;                   ]), \n       = ∑_α c_α 𝒜_α(F),\n\nwhere {𝒜_α(F) }_α are judicious choice of operator basis. A particular choice of operators that is convenient to summarize the commutators is the following \n\n    {𝒜_α(F) }_α   = {𝒜_±(F) = ([           ±F^T     ;                    ;    F         0     ;                    ;      ]), 𝒜_H =([        ;        ;     1  ;        ;   ]),  𝒜_I(F) = ([                    ;                    ;           FF^T     ;                    ;      ]) }.\n\nThe matrix commutator between the interaction picture Hamiltonians in different frames lifts to a bracket on the basis 𝒞 matrices, yielding surprisingly simple “selection rules\" for understanding the structure behind the first order Magnus calculation. \n\nBefore presenting the result, we define two more interactions\n        \n        \n    𝒜̃_I( F,  G)    =  ([                                                                    ;                                                                    ;                                   (FG^T + GF^T )/2                 ;                                                                    ;                  ]), \n    𝒜_A( F)    =  ([                                        ;                                        ;                     ϵ_ijk F_k          ;                                        ;           ]),\n\n\nwhere the first one contains the Ising interaction 𝒜_I( F) = 𝒜̃_I( F, F) as a special case, and the second one is an anti-symmetric exchange  𝒜_A( F).\n\nDisorder, Disorder → Disorder\n\n\n\t\n  * 𝒜_σ(𝐅),𝒜_σ'(𝐆) = 2i  𝒜_σσ'(𝐅×𝐆)     σ, σ' ∈± \n\n\nDisorder, Interaction → Interaction\n\n\n\t\n  * 𝒜_+(𝐅), 𝒜_H  =0\n\t\n  * 𝒜_+(𝐅), 𝒜_I(𝐆)  = 4i  𝒜̃_I(𝐆, 𝐅×𝐆)\n\t\n  * 𝒜_-(𝐅), 𝒜_H  = -4 i  𝒜_A(𝐅)\n\t\n  * 𝒜_-(𝐅), 𝒜_I(𝐆)  = 2i((F· G) 𝒜_A(𝐆)-𝒜_A(𝐅))\n\n\nInteraction, Interaction → Disorder\n\n\n\t\n  * 𝒜_H, 𝒜_H  = 0\n\t\n  * 𝒜_H, 𝒜_I(𝐆)  = 0\n\t\n  * 𝒜_I(𝐅), 𝒜_I(𝐆)  = 2i   (F · G) 𝒜_+(𝐅×𝐆)=0 for pulse sequences built from π/2,π pulses\n\n\n\n\n\n\n§ DERIVATION OF SECOND-ORDER DECOUPLING RULES\n\n\nFrom Eq. (<ref>), we have that the cancellation condition for the second-order term is given by two integrals\n\n    ∭_0<t_3<t_2<t_1<Tc_α(t_1)c_β(t_2)c_γ(t_3)+∭_0<t_1<t_2<t_3<Tc_α(t_1)c_β(t_2)c_γ(t_3).\n\n\nIn order to see the similarities to the previous order, we write the above integrals as follows\n\n    ∫_0^Tdt_1c_α(t_1)(∬_0<t_3<t_2<t_1c_β(t_2)c_γ(t_3)+∬_t_1<t_2<t_3<Tc_β(t_2)c_γ(t_3)).\n\nNoting that the coefficient here is [^α,[^β,^γ]], we can again sum the terms which have β and γ switched, as we did with first order, and derive the following expression\n\n    H^(2)   =1/6T ([^α,[^β,^γ]])∫_0^Tdt_1c_α(t_1)·\n       ·( ∬_0<t_3<t_2<t_1 c_β(t_2)c_γ(t_3)-∬_0<t_2<t_3<t_1 c_β(t_2)c_γ(t_3).+\n       +.∬_t_1<t_2<t_3<Tc_β(t_2)c_γ(t_3)-∬_t_1<t_3<t_2<Tc_β(t_2)c_γ(t_3)).\n\nThe inner integrals in the above expression are the first order contribution of the β,γ first order term for all times before t_1, minus the first order contribution of the β,γ first order term for all times after t_1. Letting \n\n    c^(1)_β, γ(t_1,t_2)   = ∬\n    t_1<t_a<t_b<t_2c_β(t_a)c_γ(t_b)-∬\n    t_1<t_b<t_a<t_2c_β(t_a)c_γ(t_b),\n\nwhich is exactly the first order contribution between times t_1 and t_2 of the operator [^β,^γ], we can rewrite the expression as follows\n\n\n    H^(2)   =1/6T ([^α,[^β,^γ]])∫_0^Tdt_1c_α(t_1)(c^(1)_β,γ(0,t_1)-c^(1)_β,γ(t_1,T) ).\n\nWe then write\n\n    ∫_0^Tdt_1c_α(t_1) (c^(1)_β,γ(0,t_1)-c^(1)_β,γ(t_1,T) )\n    \n        =   ∫_0^Tdt_1c_α(t_1)c^(1)_β,γ(0,t_1)-∫_0^Tdt_1c_α(t_1)(c^(1)_β,γ(0,T)-c^(1)_β,γ(0,t_1))\n    =    2∫_0^Tdt_1c_α(t_1)c^(1)_β,γ(0,t_1)-c^(1)_β,γ(0,T)∫_0^Tdt_1c_α(t_1).\n\n\nWe note that this form is identical to the first order case, with c_β(t) replaced by c^(1)_β,γ(0,t). We will now perform the same substitution that we did for first order to convert the integral expression into a summation expression. For simplicity, we restrict our discussion to Hamiltonians involving disorder only. In this case, c^(1)_β,γ does not change over a free evolution period, i.e. looking at c^(1)_β,γ(0,t_a) and c^(1)_β,γ(0,t_b), for t_a,t_b in the same free evolution period, the contribution to the overall term is 0, as the commutator [^β,^γ] will be 0 during this time. Thus we can write the same approximation for this term as in the 1st order term\n\n    A   =∫_0^Tdt_1c_α(t_1)c^(1)_β,γ(0,t_1)\n       =A_free+∑_k=1^n-1P_k,k+1,α,β,γ+∑_k=1^nC^(2)_α,β,γ,k,\n\nwhere\n\n    C^(2)_α,β,γ,k   =∫_t_k-1+τ_k-1/2^t_k+1-τ_k+1/2c_α(t_1)dt_1∫_t_k-1+τ_k-1/2^t_1c^(1)_β,γ(0,t_2)dt_2,\n    \n        P_k,k+1,α,β,γ   =∫_0^π/2_α,k(θ_1)rdθ_1∫_0^θ_1^(1)_β,γ,k+1(θ_2)rdθ_2-∫_0^π/2_α,k+1(θ_1)rdθ_1∫_θ_1^π/2^(1)_β,γ,k(θ_2)rdθ_2,\n    \n        A_free   =∑_k=1^nC_α,k∑_j=1^k-1C_β,γ,j.\n\nHere C_β,γ,j=C_β,j∑_ℓ=1^j-1C_γ,ℓ, and the angle terms are defined as follows:\n\n    ^(1)_β,γ,k(θ)   =   ∬_0≤θ_1≤θ_2≤θ_β(θ_1)_γ(θ_2)-∬_0≤θ_2≤θ_1≤θ_β(θ_1)_γ(θ_2),\n    ^(1)_β,γ,k(θ)   =    ∬_0≤θ_1≤θ_2≤θ_β(θ_1)_γ(θ_2)-∬_0≤θ_2≤θ_1≤θ_β(θ_1)_γ(θ_2).\n\nWe note that this means if the two ramp up functions are proportional, i.e. _γ(θ)=F_γ,ksin(θ), _β(θ)=F_β,ksin(θ), these terms will always be 0. There are also no q-terms as we are restricting to a disorder Hamiltonian. Thus, the only term left is the free evolution term with the frame-lengthening correction.\n\nWe can now plug in expressions for the explicit terms in the qubit Hamiltonian to calculate the leading second-order effects. The free evolution period is much like the lower orders\n\n    A_free=∑_k=1^nF_μ,k(τ_k+4/πτ_p)F^ν,ρ_<k,\n\nwhere F^ν,ρ_<k=∑_l=1^kF_ν,l(τ_l+4/πτ_p)(F^ρ_<l-F^ρ_>l) is the first-order contribution given by ν,ρ through time k. By combining A_free with the rest of the terms, we obtain the expression in Tab. <ref>\n\n    2∑_k=1^n F_μ,k(τ_k+4/πτ_p)F_<k^ν,ρ - F^μF^ν,ρ,\n\nwhere F^ν,ρ=∑_k=1^nF_ν,k(τ_k+4/πτ_p)F_<k^ρ is the total first-order disorder-disorder term between axes ν and ρ.\n"}