{"entry_id": "http://arxiv.org/abs/2303.07176v1", "published": "20230313151755", "title": "Reduced order model of a convection-diffusion equation using Proper Orthogonal Decomposition", "authors": ["Neelakantan Padmanabhan"], "primary_category": "math.NA", "categories": ["math.NA", "cs.NA", "math-ph", "math.MP"], "text": "\n\n\nProbabilistic Uncertainty-Aware Risk Spot \n Detector for Naturalistic Driving\n    Tim Puphal, Malte Probst and Julian Eggert\n\n\n The authors are with the Honda Research Institute (HRI) Europe, Carl-Legien-Str. 30, 63073 Offenbach, Germany \n\t(e-mail: tim.puphal@honda-ri.de; malte.probst@honda-ri.de; julian.eggert@honda-ri.de) \n\n    March 30, 2023\n=========================================================================================================================================================================================================================================================\n\n\n\n§ ABSTRACT\n\nIn this work, a numerical simulation of 1D Burgers' equation is developed using finite difference method and a reduced order model (ROM) of the simulation is developed using proper orthogonal decomposition (POD). The objective of this work is to provide an introduction of the POD method to researchers interested in computational fluid dynamics (CFD). This work discusses a physical interpretation of the POD method, its strengths and shortcomings and an implementation of the algorithm that may be extended to 2D, 3D Burgers' equation and other non-linear partial differential equations (PDE) of this class, to develop models for more complex systems.\n\n\n\n§ INTRODUCTION\n\nBurgers' equation is a fundamental nonlinear partial differential equation that finds applications in the areas of thermo-fluids and CFD <cit.>. It is a generalized convection-diffusion equation and falls under the same category of equations as the Navier-Stokes equations. Numerical solution and reduced order modeling of Burgers' equation, is of great interest in the CFD community. Numerical solution of Burgers' equation and other PDEs of this class can be computationally very expensive <cit.>. Thus, reduced order models are highly desirable since they can capture the essence of the phenomenon with a fraction of the computational resources. POD / PCA (principal component analysis) is a well established approach to develop reduced order models <cit.>. For a given data, POD extracts the modes that contain the most dominant characteristics of the data. In a function space, these modes form the orthonormal basis that can be used to reconstruct the data. Ideally, POD modes can be constructed from any simulation or experimental data and if the governing equations of the system are known, Galerkin projection may be applied on a subset of this basis to create a ROM, to predict the time evolution of the system. While this approach results in accurate ROM for systems with high diffusivity, the predictions for systems with low diffusivity especially for long simulation times are observed to be less accurate. A number of improvements to this method have been proposed, that help in developing more accurate models. Some of these include a large eddy simulation like approach <cit.>, where the large scale effects are modeled by POD and the small scale effects are modeled by eddy viscosity type model <cit.>, goal-oriented POD <cit.>, and discrete empirical interpolation method (DEIM) <cit.>. \n\n\n\n§ NUMERICAL SIMULATION OF BURGERS' EQUATION\n\n1D Burgers' equation of the form presented in Eq.<ref> is solved using finite difference approach. \n\n    ∂ U/∂ t = - U ∂ U/∂ x + ν∂ ^2 U/∂ x^2 + Q,\n\nwhere, U=U(x,t) represents a field variable, t represents time, x represents the spatial vector, ν represents the diffusivity, and Q a source term. The generic Burgers' equation incorporates a non-linear convection term, and a linear diffusion term. An additional source term is considered in this work. A second order central finite difference scheme is used for spatial discretization of the diffusion term, while a second order upwind scheme is employed for the nonlinear convection term. An explicit forward Euler scheme is used for time stepping. \n\n    U(x,t+Δ t) - U(x,t)/Δ t = -U(x,t) 3 U(x,t)-4 U(x-Δ x,t) + U(x-2Δ x,t)/2Δ x\n     + νU(x+Δ x,t) - 2 U(x,t) + U(x-Δ x,t)/Δ x^2 + Q\n\nThe equations are solved on an equally spaced Cartesian grid. Constant diffusivity values are used in the simulations. CFL conditions for velocity and diffusivity are used to determine the minimum time step. Periodic boundary conditions are used in the domain. The following initial conditions are used for the field variable and source term, \n\n    U(x,0) = U_0 sin(x),\n    \n        Q(x,0) = Q_0 sin(x),\n\nwhere, u_0=0.01, Q_0=0.1. Simulations are run for various configurations of number of grid points and duration (t_final). The results from the numerical simulations are presented in Figs. <ref>-<ref>.\n\n\n§ REDUCED ORDER MODELING\n\nAn overview of a few concepts of linear algebra that are central to the POD method is presented in Appendix <ref>. A brief review of this section might be useful in developing a better understanding of the method. \n\n\n §.§ A physical interpretation of POD\n\nSolutions of Burgers' equation (U(x,t)=U ∈ℝ^m × n, with m spatial points and n temporal points), can be expressed analytically in terms of the basis vectors x and t, in a physical space. While it is desirable, it is not always convenient or viable to obtain an analytical solution in this space. Alternatively, this solution can be also expressed in terms of a different set of basis vectors in a function space. This alternative basis can be determined by singular value decomposition (SVD) of the solution matrix U or by eigen decomposition of the covariance matrices of the solution matrix (Cov_1(U)=UU^* and Cov_2(U)=U^*U). The covariance matrices, represent the variance exhibited by the elements of the solution matrix U and the covariance between the pairs of dataset. It is useful in separating structured relationships in a matrix of random variables. When eigen decomposition of the covariance matrix is performed, it results in a factorization of the form Cov(U)=VΛ V^-1. Here, V represents the eigenvectors or the principle components and Λ represents the eigenvalues of the covariance matrix. Geometrically, this can be interpreted as a linear transformation represented by Cov(U) which when applied to the vectors V, only results in V scaling up or down by a factor of Λ. Since Cov(U) represent the variance in the data, the vectors V indicate the directions along which the variance in the data is the highest or the lowest and Λ represents the magnitude of significance of the given eigenvector. In other terms, the variance indicates how the energy or information of the solution is distributed and the eigenvectors indicate the directions in which the distribution is significant. A graphical illustration of this is presented in Fig.<ref>. In a function space, the vectors V form an orthonormal basis. In many cases (except the cases with very low diffusivity in the Burgers' equation), it is observed that the first few basis vectors (or modes) typically contain most of the energy of the solution. Hence, by projecting U on these first few modes, the highest energy solutions can be recovered. By Galerkin projection of a weak form of the governing equation onto a sub-space of this basis, a reduced order model can be obtained, from which the time evolution of the system can be predicted.\n\n\n\n\n\n §.§ Formal description of POD\n\nSnapshots of the field variable, U ∈ℝ^m × n of m spatial points and n temporal points are obtained from the numerical simulation of 1D Burgers' equation. Singular value decomposition of this matrix, decomposes the solution into,\n\n    SVD(U) = ΦΣΨ^*,\n\nwhere, the matrix Φ∈ℝ^m × m represents the left singular vector and Ψ^* ∈ℝ^n × n the conjugate transpose of the right singular vector. These matrices are composed of the eigenvectors ϕ (columns of Φ), ψ (rows of Ψ^*) of the covariance matrices U^*U and U U^*. The matrix Σ∈ℝ^m × 1 represents the singular values of U. The singular values are ordered as σ_1 ≥σ_2 ≥...≥σ_m. The i^th row of the solution matrix thus can be written as,\n\n    u_i = ∑_i ^m σ_i ϕ_ijψ_ik.\n\nσ_i represents the magnitude of significance of the modes. The relative significance of the modes can be estimated as,\n\n    r = σ_i/∑_i=1σ_i,\n\nwhere, ∑ r=1. As observed in Figs. <ref>-<ref>, when the diffusivity coefficient (ν) is high, the first three to five modes contain upto 99 % of the energy. A reduced solution can then be obtained by choosing a few dominant modes (r). Once the low dimensional basis set has been determined, it can be used to reformulate the Burgers' equation to create a reduced order model. Separation of variable and basis expansion is applied to Eq.<ref>, where the field variable is expressed as\n\n    U(x,t)= A(t) Φ(x) = ∑_i=1 ^m a_ik (t) ϕ_ij(x),\n\nwhere, ϕ_ij(x) represents the orthonormal basis functions obtained by SVD of the data matrix, a_ik(t) the temporal coefficients, and i index of number of modes. It is to be noted that the basis function and temporal coefficients exist in a function space, where the continuous function U(x,t) is discretized into a system of finite dimensions. By substituting Eq.<ref> into Eq.<ref>, the PDE for U(x,t) can be transformed into an ordinary differential equation (ODE) for A(t). \n\n    d/dt∑ a_ikϕ_ij = - ∑ a_ikϕ_ijd/dx∑ a_ikϕ_ij + νd ^2/dx^2∑ a_ikϕ_ij + Q,\n\nSince the basis functions are orthogonal they hold the property,\n\n    ∫ϕ_ij(x) ϕ_il(x)^* dx =\n        ∑ϕ_ij(x) ϕ_il (x) = \n        \n          1     j=l\n    \n          0     j ≠ l\n\nThe final form of equation is obtained by multiplying both sides of Eq.<ref> by ϕ_ij^T(x), \n\n    d/dt∑ a_ik = - ϕ_ij^T ∑ a_ikϕ_ijd/dx∑ a_ikϕ_ij + ϕ_ij^T νd ^2/dx^2∑ a_ikϕ_ij + ϕ_ij^T Q.\n\nTo build a reduced order model, a small number of modes (i<<m) are considered in Eq.<ref> and Eq.<ref>. The spatial derivatives in Eq.<ref> are solved using finite difference approach. Periodic boundary conditions are applied and the same initial condition (as the one used in the finite difference simulation), is imposed for the temporal coefficient a_0=U(x,0) Φ. This equation is then solved for a(t) using a standard ODE solver and a ROM is created by projection of this solution on Φ. The results from the ROM are compared against the numerical simulation and presented in Figs. <ref>-<ref>. It is observed that the ROM is very accurate in predicting the field variable's evolution in space and time with a few modes (i ≤ 5). For new initial and boundary conditions, it is sufficient to assemble a snapshot matrix considering different instances of initial and boundary conditions and compute the POD at an offline stage. The ratio of computation time required to run the finite difference simulation and the POD-ROM for various cases are presented in Table <ref>. In most cases, POD-ROM requires a smaller fraction of computation time when compared to the finite difference simulation. The costs of determination of POD basis and Galerkin projection increases with increase in number of dimensions, resolution and simulation run times.\n\n\n §.§ Implementation of POD\n\n\n     Compute the instantaneous field variable (U(x,t) ∈ℝ^m × n) from the finite difference solution of 1D Burgers' equation.\n     Decompose the instantaneous field variable via Singular value decomposition,\n    \n    SVD(U)=U_L · S · V_ℝ^*.\n\n    U_L ∈ℝ^m × m: Spatial modes (left singular vector), S ∈ℝ^m × 1: Magnitude of the modes (singular values), V_ℝ^* ∈ℝ^n × n: Temporal coefficients (complex conjugate of the right singular vector). Note: The singular values and vectors are ordered in a descending order.\n     Determine the number of significant modes by computing the relative magnitude of the singular values,\n    \n    r_k=S_k^2/∑_k S_k^2,k=1,2,…,m.\n\n     Choose a small number of modes (i) based on the values of r (i ≪ m).\n     \tCreate new matrices with the reduced number of spatial modes and their corresponding temporal coefficients.\n    \n    ϕ=U_L ∈ℝ^m × i,\n\n    \n    ψ=V_ℝ^T ∈ℝ^i × n,\n\n    \n    σ= S ∈ℝ^i × 1.\n\n     Specify initial condition (same initial condition as the numerical simulation). The initial temperature is projected onto the reduced basis,\n    \n    a_0=ϕ· U(x,0).\n\n     Compute first derivative ϕ_x (upwind scheme) and second derivatives ϕ_xx (central finite difference) of the spatial modes.\n     Assemble the parameters: modes, temporal coefficients, derivatives, initial conditions, boundary conditions, source, and diffusivity coefficients\n    \n    Parameters=[ϕ^T,ϕ,ϕ_x,ϕ_xx,Q,ν].\n\n     Perform Galerkin projection by applying separation of variable to the data matrix and combining it with the governing equation,\n    \n    U(x,t)=A(t) Φ(x),\n\n    \n    d/dt∑_i ϕ_i a_i = -∑_i ϕ_i a_i d/dx∑_i ϕ_i a_i + νd^2/dx^2∑_i ϕ_i a_i + Q.\n\n     Invoke the orthogonality property,\n     \n    ∫ϕ_i ϕ_j dx = \n        \n          1,     i=j\n    \n          0,     i ≠ j\n\n     Multiply both sides of the equation by ϕ_i ^T\n     \n    d/dt∑_i a_i = -ϕ_i ^T ∑_i ϕ_i a_i d/dx∑_i ϕ_i a_i + ϕ_i ^T νd^2/dx^2∑_i ϕ_i a_i + ϕ_i ^T Q.\n\n      Compute the right hand side of the equation: \n     \n    RHS = rhs_C + ν· rhs_D + rhs_S,\n\n     where,\n      U=ϕ· a, which is equivalent to ∑_i ϕ_i a_i,\n      rhs_C = -ϕ^T · U ·ϕ_x · a, which is equivalent to -ϕ_i ^T ∑_i ϕ_i a_i d/dx∑_i ϕ_i a_i,\n      ν· rhs_D = ϕ^T ·ν·ϕ_xx, which is equivalent to νd^2/dx^2∑_i ϕ_i a_i,\n      rhs_S = ϕ^T Q, which is equivalent to ϕ_i ^T Q.\n     Compute the temporal coefficient using a standard ODE solver,\n    \n    a(t) = Standard.ODE.Solver(RHS,a_0,t,Parameters).\n\n     Compute the time evolution of the reduced order model of the system,\n    \n    U_ROM (t) = a(t) ϕ.\n\n\n\n\n§ RESULTS\n\nThe results presented in this section evaluate the accuracy of POD-ROM for the following cases, Case 1: simulation with high diffusivity and short simulation run time (t_final), Case 2: simulation with high diffusivity and longer simulation run time, Case 3: simulation with low diffusivity and short run time, Case 4: simulation with low diffusivity and longer run time, and Case 5: heat equation with only diffusion term (Burgers' equation without convection term). For each case, the percentage error between the simulation and the model data is computed. For the case with high diffusivity and short simulation time (Fig.<ref>), it is observed that a satisfactory ROM can be created with as few as 1-3 dominant modes. However, with 5 dominant modes, the original data can be reconstructed with negligible error. At longer simulation times as in Case 2 (Fig. <ref>), a larger number of modes are required to reconstruct the data. For Case 1, it is observed that the POD-ROM constructed with 1 dominant mode between t=0 s and t=0.5 s captures the fluctuation in the field, but the POD-ROM constructed with 1 dominant mode in Case 2 does not capture the fluctuations between t=0 s and t=0.5 s. This occurs because the POD modes are constructed from the data obtained from a specific simulation. As a result the POD modes and the distribution of energy across the modes vary for different data. At lower diffusivities and shorter simulation times as in Case 3 (Fig. <ref>), the trends similar to Case 1, where the data can be reconstructed with a few dominant modes, are observed. However, with increase in simulation time as in Case 4 (Fig. <ref>), large transient fluctuations are observed. At low diffusivity, Burger's equation is driven primarily by the convection term. If a parallel between this equation and the Navier Stokes equation is drawn, this is similar to a case at high Reynolds number. In such a scenario a large range of spatial and temporal scales exist, and the energy distribution is no longer dominated by a few modes. As a result, the POD-ROM constructed even with a large number of modes (i= 5 or i= 30) is inaccurate. The differences between the original data and ROM are observed to accentuate at simulation times t > 10. For 1D heat equation (Burgers' equation without the convection term), it is observed that POD-ROM can be constructed with only 1-3 modes even when the diffusivity is very small. Convection term is the primary source of non-linearity and fluctuations in Burgers' equation and POD is a great tool for construction of ROM for linear PDEs. An additional case (Case 6 - Fig.<ref>) is evaluated where a highly diffusive first order upwind scheme is used for discretization of the convection term. In this case, the fluctuations in the original data are observed to dissipate at longer simulation times. As a result, the energy distribution has a few dominant modes and the POD-ROM reconstructed with the limited number of modes is still accurate. This however is not an elegant solution since the original data from the simulation is highly diffusive and unreliable. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSIONS\n\nThis work explores the development of ROM for 1D Burgers' equation using POD method. POD is very useful in creating fast and accurate ROM for a wide range of linear and non-linear equations. The primary idea of this work is to provide a feel for the method and present the material in an accessible format. It is the hope of the author that the reader is able to develop an appreciation for the approach and is able to apply it to more complex systems for reduction of computational times. \n\n\n\nunsrt\n\n\n\n\n§ BACKGROUND IN LINEAR ALGEBRA AND RELEVANT TERMINOLOGIES\n \n(Excerpts of lectures on the topic of linear algebra <cit.>)\n\n    \n  * Vector space: A non-empty set V, of objects called vectors on which two operations (linear combinations) can be performed. Vector addition (u+v ∈ V) and scalar multiplication (λ u ∈ V).\n    \n  * Span: A set of all possible vectors that can be formed by a linear combination of a set of vectors and scalars.\n    \n  * Space: For a given vector space, if the tails of the vectors are at the origin and the tip of the vectors point at different locations, a grid space can be created such that each grid point is located at the tip of a given vector.\n    \n  * Linear dependency: When two vectors point in the same coordinate direction and their span is restricted to a line or a plane, the vectors are called linearly dependent.\n    \n  * Basis: A set of linearly independent vectors that span the full space. An infinite set of basis vectors exist, however physically only three vectors are perceived. For example, in a Cartesian coordinate the coordinate directions x,y,z are defined as the basis.\n    \n  * Linear transformation / Matrix-Vector multiplication: An operation, which when applied to a vector, it either rotates, scales, or performs a combination of the two to move it to a new location in space. A linear transformation is performed via matrix-vector multiplication (Ax=b), where the matrix A is the linear transformation applied to vector x to form a new vector b. For a transformation to be defined as linear, the grids formed by the vector tips must remain parallel, evenly spaced and the origin must not move.\n    \n  * Matrix multiplication: A linear transformation that is defined as a combination of two linear transformations. \n    \n  * Change of Basis: A linear transformation that translates a vector representation in one basis to a representation of the same vector in a new basis. \n    \n  * Eigenvector and Eigenvalue: When a linear transformation A changes the basis, some of the vectors v in the space, remain on their span as an effect of the transformation. These vectors only scale in magnitude. This is defined as Av=λ v, where v is defined as the Eigenvector and λ is defined as Eigenvalue, which is a scaling factor. \n\t\n  * Eigen decomposition: A factorization of a matrix (A=V Λ V^-1), where the matrix A is represented a product of its Eigenvalues Λ and Eigenvectors V. Eigen decomposition can only be applied to square matrices. \n\t\n  * Singular value decomposition: A factorization of a real or complex matrix (A=U Σ V^T) that is a generalization of Eigen decomposition but is applicable to non-square matrices as well. These factors may be physically interpreted as U (orthogonal matrix - rotation), Σ (diagonal matrix - stretching), and V^T (orthogonal matrix - rotation)\n\t\n  * Function spaces : A set of all mathematical functions that have the same properties as vectors and vector spaces. For example, a function f(x) that can be expressed a sum of two other functions f(x)=u(x)+v(x) and a scalar product of another function f(x)=λ w(x). From an abstract point of view, these functions are mathematically similar to a vectors and linear combinations can be applied to them to determine distance between them or to project them on one another. The difference in the analogy appears in the physical interpretation of the number of dimensions. It can be shown that an infinite number of linearly independent functions can be built from an infinite number of vectors to span the space. Therefore, functions exist in an infinite dimensional vector space. For example, a function f(x) specified in the interval [a,b], sampled at intervals x_1,x_2,…,x_N with corresponding function values of f_1,f_2,…,f_N, can be expressed as, \n    f(x)=[ f_1;   ⋮; f_N ] =f_1 e_1+f_2 e_2+…+f_N e_N,\n\nwhere, e_i represents the basis of the function that takes the value of 1 at the corresponding sampling point and 0 elsewhere. A Dirac delta function may be used as a basis function. This product gives an approximation of the original function, and the approximation gets better as the number of samples are increased. In the limit N →∞, the basis functions become infinitely thin and infinitely many. Thus, the function over the interval is defined as,\n\n    f(x)=∫_a ^b f(λ) e_λ (x) dλ.\n\nIt must be noted that rectangular function is only one possible set of basis function. Other basis functions may also be used here to express the function, however not all basis functions exhibit the property of orthogonality. Using this definition of function space, a number of useful properties may be obtained such as projection of a function onto subspace span of another set of functions and determination of orthogonality of two functions. For an orthonormal basis e_1,e_2,…,e_N,\n\n    a = ∑_i a_i e_i.\n\nInner product of two vectors: ⟨ a,b ⟩=a_1 b_1^*+a_2 b_2^*+…+a_N b_N^*. Projection of a vector into a subspace of an orthonormal basis W=span[w_1,w_2,…,w_M],\n\n    w=⟨ a,w_1 ⟩ w_1+⟨ a,w_2 ⟩ w_2+…+⟨ a,w_M ⟩ w_M.\n\n\n"}