{"entry_id": "http://arxiv.org/abs/2303.07174v1", "published": "20230313151501", "title": "Nonlinearly charged black holes: Shadow and Thin-accretion disk", "authors": ["Akhil Uniyal", "Sayan Chakrabarti", "Reggie C. Pantig", "Ali Övgün"], "primary_category": "gr-qc", "categories": ["gr-qc"], "text": " \n\n\n\n\n\n\nakhil_uniyal@iitg.ac.in\nDepartment of Physics, Indian Institute of Technology, Guwahati 781039, India\n\n\n\nsayan.chakrabarti@iitg.ac.in\nDepartment of Physics, Indian Institute of Technology, Guwahati 781039, India\n\n\n\n\nrcpantig@mapua.edu.ph\nPhysics Department, Mapúa University, 658 Muralla St., Intramuros, Manila 1002, Philippines\n\n\n\n\n\nali.ovgun@emu.edu.tr\nPhysics Department, Eastern Mediterranean University, Famagusta, 99628 North Cyprus via Mersin 10, Turkey\n\n\n\n\nIn this paper, we explore the effect of non-linear electrodynamics (NLED) parameters and magnetic charges on various aspects of black holes, like how they bend light, how they emit radiation, and how they appear as a shadow by considering a thin accretion disk model. We initially examine the overall behavior of the photonsphere and the corresponding shadow silhouette under the effects of these parameters. Using the EHT data for Sgr. A* and M87*, we aim to find constraints for q_m. Our results indicate that M87* gives better constraints, and as the value of β is varied to increase, the constrained range for q_m widens. At lower values of q_m, we find that the shadow radius is close to the observed value. Then, we study different things like how much energy the black hole emits, the temperature of the disk around it, and the kind of light it gives off. We also look at how the black hole shadow appears in different situations. We also study how matter falls onto the black hole from all directions. Finally, we investigate how the magnetic charge affects all these things when we take into account a theory called  NLED along with gravity. This study helps us understand the complex relationship between magnetic charge and black holes.\n\n\n\n95.30.Sf, 04.70.-s, 97.60.Lf, 04.50.+h\nNonlinearly charged black holes: Shadow and Thin-accretion disk\n    Ali Övgün\n    March 30, 2023\n===============================================================\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nUnderstanding black hole (BH) physics has always been an interesting topic, both for theoreticians as well as for observational astrophysicists as it can cast light into the predictions from the theory of general relativity, and thereby a large part of the gravitating Universe itself could be explained by understanding BH physics <cit.>. Compact objects, particularly BHs have received a lot of attention within the premises of  Einstein’s general relativity from the perspective of observations. While the existence of BHs is now unquestionable, their detection still remains an extremely difficult task. In this direction, the concept of the shadow of a BH plays a significant role, since the very idea of imaging a black hole leads one to study the extremely strong gravity regime near the black hole horizon. One of the first works towards this direction for a static spherically symmetric black hole was performed by Synge <cit.> and Luminet <cit.>, and later Bardeen <cit.> extended the idea for studying BH shadow in the rotating Kerr geometry. In recent times, the Event Horizon Telescope (EHT) has published the black hole shadow image in the center of the M87^* galaxy <cit.> and the shadow of Sagittarius A^* (Sgr A^*) black hole in the center of Milky Way galaxy <cit.>. Recent observations by EHT and Stratospheric Observatory for Infrared Astronomy (SOFIA), have shown that <cit.> the polarised appearance of the black holes, these studies is a significant milestone since the polarisation of light provides valuable information that can help us comprehend the physics underlying the image.\n\nImmediately after the release of these images a number of works flooded the literature, many of which focused towards understanding the alternate theories of gravity around the black hole (for a detailed discussion and references, see <cit.>). The work in <cit.> studies a wide range\nof well-motivated modifications to classical General Relativistic black hole solutions and constrains them using the EHT observations of Sgr A^*. In the process of studying so, they connect the size of the bright ring of emission to that of the underlying BH shadow using the Sgr A^*'s mass-to-distance ratio. Different scenarios including regular BHs, string-inspired BH space-times, alternative models of the theory of gravity, and BH mimickers including wormhole and naked singular space-times were studied in the above paper to constrain the fundamental parameters of those modified theories and exotic objects, it was demonstrated that the EHT image of Sgr A^∗ puts very stringent constraints on the models and predicts a shadow size larger than that of a Schwarzschild BH of a given mass. On another front, it is to be mentioned here that since one can only have information about the diameter of the shadow size from observations made so far, one can easily get into the trouble of shadow-degeneracy, i.e. two black holes from two different theories of gravity casting similar shadow <cit.>  and in the recent work that comparison is also done with the rotating Kerr black hole and non-rotating dilaton black hole <cit.>. Therefore, in future, we expect to overcome such degeneracies by observing the black hole with more precision.\n\nOne of the alternative theories to general relativity (GR) is known as the non-linear electrodynamic theory (NLE). It was the first outcome of the motivation to remove the central singularity of the point charge and the related energy divergence by generalizing Maxwell’s theory in the 1930s by Born and Infeld <cit.>. After that Plebanski extended the work in the special relativity framework by including an arbitrary function of the electromagnetic field invariants in the theory <cit.>. After this, a lot of work has been done in this field having the motivation that this theory can produce regular black holes,  some kinds of NLE theories are limiting cases of certain types of models in the string theory and also solving singularity problems in cosmology <cit.>. Among all of them, the spherically symmetric solutions are the simplistic ones in the sense that we only have radial electric and magnetic charges in the theory <cit.>. Therefore, in this work, we will be interested in understanding to look into one of the purely magnetic charge spherical symmetric solutions of NLE <cit.> with the motivation to first constrain the magnetic charge with the help of known EHT results and then look into the accretion disk and shadow behaviour for different ideal intensity profiles.\n\nTo learn more about black holes, scientists study the accretion disk that surrounds them. Scientists have been studying black holes for many years, and in 1973 Cunningham and Bardeen <cit.> were the first to study what a black hole would look like if a star was orbiting around it. In 1979, Luminet <cit.> theorized what the accretion disk around a black hole would look like using a thin disk model. The disk's structure was described by other scientists, including Shakura and Sunyaev in 1973 <cit.>, Novikov and Thorne in 1973 <cit.>, and Page and Thorne in 1974 <cit.>. The disk is thin and opaque, meaning that as gas moves within it radiate energy due to the strong gravity of the black hole <cit.>. The radiation emitted from the accretion disk depends on how particles move within the gas and the structure of space-time around the black hole. By studying the radiation emitted from accretion disks, scientists can test the theory of gravity around black holes. Therefore, this paper aims in the same direction to understand the effect of a magnetically charged NLED black hole on the particles moving along the geodesics path around the black hole.\n\nThe main motivation of this work is to understand the effect of magnetically charged NLED black holes on the particles' geodesics, radiation emitted from the thin accretion disk, and shadow of the black hole. Moreover, we first find the constraints to the NLED coupling parameter (β) and magnetic charge (q_m) of the black hole by using the data released by EHT for M87* and Sagittarius A*. Then, we look at things like the energy flux (F), temperature (T), luminosity (dL_∞), and spectrum of the disk (νℒ_ν,∞) coming form the thin accretion disk, and how they change when we include NLED in our calculations. We also look at how things change with β and q_m when we consider different emission profiles emitted from the thin accretion disk and observed by the observer at infinity including with an infalling spherical accretion in the equatorial plane of the accretion disk. We use a specific unit system G=M=c=1 and metric signature (-,+,+,+) in our paper.\n\n\n\n\n\n\n\n\n\n\n§ BLACK HOLE METRIC\n\nThe definition of the action for the NED theory in general relativity is provided as <cit.>\n\n    I=∫ d^4x√(-g)(R/16π G_N+ℒ(ℱ) ),\n\n the Newton constant G_N is also included. The NED Lagrangian utilized in this work is suggested in <cit.> (see also <cit.>)\n\n    L(ℱ) =- F/1+√(2|β F|).\n\nwhere we have the Lorentz invariant F=F^μνF_μν/4=(B^2-E^2)/2. The electric and magnetic induction fields are denoted as E and B respectively. When β is set to zero in Equations (<ref>) and (<ref>), we get the action of black holes with Maxwell electrodynamics. By making variations to the action (<ref>), we can obtain the equations for the gravitational and electromagnetic fields given below\n\n    R_μν-1/2g_μνR =8π G_N T_μν,\n\n\n    ∂ _μ( √(-g)ℒ_ℱF^μν)=0,\n\nwhereℒ_ℱ=∂ℒ( ℱ)/∂ℱ.\nThe stress tensor of electromagnetic fields is given by\n\n    T_μν=F_μρF_ν^ ρℒ_ℱ+g_μνℒ( ℱ).\n\nNow, let us consider a space-time with spherical symmetry as follows,\n\n    ds^2=-f(r)dt^2+1/f(r)dr^2+r^2( dθ^2+sin^2θ dϕ ^2).\n\nThen the tensor F_μν possesses the radial electric field F_01=-F_10 and radial magnetic field F_23=-F_32=q_m sin(θ) with the magnetic charge q_m. The stress tensor is diagonal, T_0^ 0=T_r^ r and T_θ^ θ=T_ϕ^ ϕ. The metric function in Eq. (<ref>) can be written as <cit.>,\n\n    f(r)=1 - 2m(r)G_N/r,\n\nand the mass function is given by,\n\n    m(r)=m_0+ ∫_0^rρ (r)r^2dr.\n\nIn equation (<ref>), the integration constant m_0 represents the Schwarzschild mass, and ρ(r) denotes the energy density. It should be noted that models involving electrically charged black holes that conform to Maxwell's weak-field limit have singularities <cit.>. Therefore, in this study, we only consider magnetic black holes with ℱ=q_m^2/(2r^4).\nWhen we substitute q_e=0 in equation (<ref>), we obtain the energy density:\n\n    ρ=q_m^2/2r^2(r^2+q_m√(β)).\n\n Making use of Eqs. (<ref>) and (<ref>) to find out the mass function as,\n\n    m(r)=m_0+q_m^3/2/2β^1/4arctan(r/√(q_m)β^1/4).\n\nSo, we are creating a definition for the magnetic mass of the black hole\n\n    m_M=∫_0^∞q_m^2/2(r^2+ q_m√(β))dr=π q_m^3/2/4β^1/4.\n\nTo explain, when β=0, Eq. (<ref>) shows that the magnetic energy becomes infinite at the Maxwell limit. This is because a magnetic monopole (as well as point-like charges) has an infinite total magnetic energy. Hence, the coupling constant β helps smooth out the NLED model's singularities under consideration. A similar situation can be observed in Born-Infeld electrodynamics. By using Eqs. (<ref>) and (<ref>), we can calculate the metric function as presented in <cit.>\n\n    f(r)=1-2m_0G_N/r-q_m^3/2G_N/β^1/4rarctan(r/√(q_m)β^1/4).\n\nAs we increase the value of the coupling constant β to a very large value, β→∞, the metric function (<ref>) takes the form of the Schwarzschild black hole that is already known. From Eq. (<ref>), we can find the metric function as r tends to infinity <cit.>,\n\n    f(r)=1-2(m_0+m_M)G_N/r+q_m^2G_N/r^2-q_m^3√(β)G_N/3r^4+𝒪(r^-6)\n\nEquation (<ref>) indicates that there are adjustments to the familiar Reissner–Nordstrom solution. Therefore, we can associate the ADM mass of the black hole with the total mass M≡ m_0+m_M, which is the combination of the Schwarzschild mass m_0 and the magnetic mass m_M, according to Eq. (<ref>). When m_0=0, the asymptotic metric as r→∞ can be obtained by using Eq. (<ref>) <cit.>\n\n    f(r)=1-q_mG_N/√(β)+G_Nr^2/3β+𝒪(r^4)    r→ 0,\n\nthe metric function given in equation (<ref>) corresponds to a black hole with mass and charge-like terms. As per equation (<ref>), the metric function remains finite at the origin r=0, hence it is regular at m_0=0. Figure <ref> shows the plot of the metric function (<ref>) with G_N=1 for the different values of NLE parameter β in left and magnetic charge q in right with fixing other one to unity as given in <cit.>.\n\n \n\n\n\n\n \n  \n   \n\n\nAccording to the figure shown in Fig. <ref>, it can be observed that the black hole has only one horizon for both the parameters β and q_m. It can be observed in the Figure that the event horizon decreases with increasing the value of β (left) while increases with increasing the value of q_m (right). Therefore, one can understand that in this space-time the effect of the β and q_m are opposite to each other.\n\n\n\n§ PHOTONSPHERE AND THE SHADOW OF NONLINEARLY CHARGED BLACK HOLE\n\nThe concept of the black hole shadow is of great importance in the field of astrophysics because it provides a rare opportunity to test the predictions of Einstein's theory of general relativity. The shadow's size and shape are determined by the curvature of spacetime around the black hole, which is a fundamental prediction of general relativity. By observing and scrutinizing the shadow, scientists can test the theory's predictions and search for any deviations that could lead to a better understanding of the fundamental laws of physics. In this section, we study the deviation caused by a black hole under the effect of the NLED parameter and magnetic charge.\n\nTo carefully study the shadow, we must initially investigate the deviations in the photonsphere. Using Eqs. (<ref>) and (<ref>), and following the standard prescription in Ref. <cit.>, the location of the photonsphere can be determined by solving the equation numerically.\n\n    3 q_m^3/2tan ^-1(r/√(β)√(q_m))/√(β)+6 m_0=r (q_m^2/√(β) q_m+r^2+2)\n\n\nWe plot the results in Fig. <ref>, where we explored various effects of q_m and β. Clearly, the photonsphere radius becomes larger as q_m increases for a given value of β. The effect of increasing β, however, is to suppress the increase in the radius due to q_m.\n\n\nNow that we know how to locate the photonsphere, we are now in the position to find constraints to q_m using the EHT's results for M87* and Sgr. A*. We follow the method in Ref. <cit.>, where we can find the expression for the angular radius as\n\n    tan(α_sh) = lim_Δ x → 0Δ y/Δ x = (r^2 f(r))^1/2dϕ/dr|_r=r_o,\n\nwhich can be simplified to\n\n    sin^2(α_sh) = b_crit^2/h(r_o)^2\n\nwith the help of the orbit equation\n\n    (dr/dϕ)^2 =r^2 f(r) (h(r)^2/b^2-1).\n\nHere, the function h(r) is defined as <cit.>\n\n    h(r)^2 = r^2/f(r).\n\nNote the use of the critical impact parameter in Eq. (<ref>) and H(r) evaluated at the observer position r_o. Using the prescription in Refs. <cit.>,\n\n    b_crit^2 = 4r_ph^2/r f'(r) |_r=r_ph + 2f(r_ph),\n\nby which we find\n\n    b_crit^2    = 4 r_ph^3β^1/4(q_m √(β)+r_ph^2) [ 2 q_m (m_0 -r_ph) β^3/4\n        + (r_ph^2 q_m^3/2+q_m^5/2√(β)) arctan(r_ph/√(q_m) β^1/4) \n        + 2 r_ph(m_0 r_ph +1/2 q_m^2-r_ph^2) β^1/4]^-1.\n\nFinally, with the help of Eqs. (<ref>) and (<ref>), the shadow radius can be obtained as\n\n    R_sh = b_crit.\n\n\n\n\nThe shadow contour is expected to be a perfect circle since this is a non-rotating black hole. However, we could see the dependence of the shadow radius R_sh on the r_ph, and in the metric function Eq. (<ref>) evaluated at the observer position. Relative to Sgr. A*, the observer position are 8277 pc, while from M87*, 16.8 kpc. In terms of M_⊙, the masses of the central black holes Sgr. A* and M87* are 4.3 ± 0.013x10^6 (VLTI <cit.>) and 6.5 ± 0.90x10^9, respectively. Furthermore, we used the allowable bounds for Sgr. A* and M87*, set by the EHT, which uses the reported Schwarzschild deviation at 68% confidence level. These are, 4.55M ≤ R_sh≤ 5.22M, and 4.31M ≤ R_sh≤ 6.08M, respectively <cit.>. With these data, we can now find constraints to q_m, where the results are plotted in Fig. <ref>. Note that M87* allows a wider range of q_m values as compared to Sgr. A*. Moreover, there are some values of q_m that coincide with the reported shadow radius for M87*, which makes the SMBH a better candidate for constraining NLED BH. \n\nAs a final remark, the plot also indicates how the shadow radius behaves when q_m varies. It turns out that the R_sh behaves in a similar manner as in r_ph.\n\n\n\n§ THIN ACCRETION DISK MODEL\n\nFirst, we will examine how particles move around the black hole by investigating the thin accretion disk in the equatorial plane using the Novikov-Thorne model <cit.>. This model is an extension of the Shakura-Sunyaev thin disk model <cit.>.\n\n\n\n §.§ Novikov-Thorne accretion model\n\nTo obtain the spectrum of the disk, we start by examining the Lagrangian of a test particle that is orbiting around a compact object <cit.>\n\n    ℒ=1/2g_μνẋ^μẋ^ν.\n\nTo obtain the solution for a general space-time, we begin by considering the following form of a static,  where g_μν is the metric of the space-time and a dot on the right-hand side indicates differentiation with respect to the affine parameter\n\n    ds^2=g_ttdt^2+g_rrdr^2+g_θθdθ^2+g_ϕϕdϕ^2,\n\nwe assume that the metric components g_tt and g_rr only vary with the radial coordinate r. Then, by applying the Euler-Lagrange equations in the equatorial plane of the accretion disk (where θ=π/2), we obtain the following equations:\n\n    ṫ=-E/g_tt,\n\n\n    ϕ̇=L/g_ϕϕ,\n\nLet's say there's a particle moving around a compact object in the equatorial plane, and we use the terms \"specific energy E\" and \"specific angular momentum L \" to describe its movement. If we assume that a certain equation (which we call \"Eq. (<ref>) \") holds true, and we also assume that the value of \"2L\" is equal to negative one 2ℒ=-1 for this particular particle, we can use another equation (which we call \"Eq. (<ref>) \") to come up with a new equation that looks like this: \n\n    -g_ttg_rrṙ^2+V_eff=E^2,\n\nwhere the V_eff is known as the effective potential for the particle and defined as,\n\n    V_eff=-g_tt(1+L^2/g_ϕϕ).\n\nFigure <ref> displays the effective potential for β (left) and q_m (right). As discussed earlier that the effect of these parameters is completely opposite to each other, the similar behaviour we have seen in this case also. It was observed that the effect of q_m is larger and more prominent with small values than the effect of β. However, we tried to look at the effect of both the parameters in this paper for the thin accretion disk study and later on focused only on q_m with fixing β=1 for the shadow part. It can be seen in the Figure that as we increase the magnetic charge q_m or NLE parameter β, the effective potential starts showing maxima close to the black hole which acts as a centrifugal barrier to the test particle falling into the black hole due to its high gravity. Therefore, we study the effect of the parameters on the massive particle trajectory around the black hole in the equatorial plane of the disk.\n\n\n\n \n  \n   \n\n\nTo achieve circular orbits that are stable, certain conditions must be met, including having an effective potential of zero (written as V_eff=0) and a radial effective potential of zero (written as V_eff,r=0). Additionally, we need to determine the specific energy (E), specific angular momentum (L), and angular velocity (Ω) of the test particle that's moving in the equatorial plane of the accretion disk around the compact object. These values can be obtained in the following manner:\n\n    E=-g_tt/√(-g_tt-g_ϕϕΩ^2)\n\n\n    L=-g_ϕϕΩ/√(-g_tt-g_ϕϕΩ^2)\n\n\n    Ω=dϕ/dt=√(-g_tt,r/g_ϕϕ,r)\n\n\n\n \n  \n   \n\n\n \n  \n   \n\n\n \n  \n   \n\n\nIn this paper, it is considered that the inner edge of the accretion disk is the innermost stable circular orbit r_ISCO position therefore to obtain the r_ISCO radius for any general spherically symmetric black hole space-time, we use the following required condition, V_eff,rr=0, and get the following equation,\n\n    E^2g_ϕϕ,rr+L^2g_tt,rr+(g_ttg_ϕϕ)_rr=0\n\nWe looked at a black hole space-time that's described by the metric function (Eq. (<ref>) ), and we presented a table (Table <ref>) that shows the positions of the horizon, marginally bound orbit, and ISCO (innermost stable circular orbit) for different magnetic charge values (q=0.1,0.3,0.5) and similarly for the β in (Table <ref>). It was observed that the positions of the horizon, marginally stable orbit and ISCO increase with increasing the magnetic charge q_m while decreasing with increasing the NLED parameter β. The magnitude of this change is notable when compared to the Schwarzschild case. Therefore, one can study the properties of accretion disks and the images of black hole shadows to understand the impact of magnetically charged NLED black holes on observational features.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn this study, we focus on a thin accretion disk and assume that its vertical height (H) is much smaller than its radius (r). We also assume that the disk is in a state of local hydrodynamic equilibrium, which means that the pressure and vertical entropy gradients are insignificant. The disk is able to maintain its vertical structure because it has efficient cooling, which prevents it from accumulating heat generated by the dynamic friction in the disk. The disk is also in a steady state, which means that its mass accretion rate (Ṁ) remains constant over time. The inner edge of the disk is fixed at the ISCO position, while the matter that's far from the black hole follows Keplerian motion. We can represent the stress energy-momentum tensor for the matter that's accreting around the compact object in a specific form <cit.>\n\n    T^μν=ρ_0 u^μ u^ν+2u^(μq^ν)+t^μν.\n\nThe conditions u_μ q^μ=0 and u_μ t^μν=0 apply here. In these equations, u^μ represents the four-velocity of the orbiting particles, while ρ_0, q^μ, and t^μν represent the rest mass density, energy flow vector, and stress tensor of the accreting matter, respectively. We can use the conservation of rest mass, represented by ▿_μ (ρ_0 u^μ)=0, to calculate the time-averaged mass accretion rate (Ṁ). This accretion rate is independent of the radius of the accretion disk\n\n    Ṁ=-2π√(-g)Σ u^r=const.\n\nThe variable Σ represents the time-averaged surface density and is defined as such:\n\n    Σ= ∫_-h^+h <ρ_0>dz.\n\nIn this context, z is being used as a coordinate in the cylindrical coordinate system. We have utilized the conservation laws for both energy, represented by ▿_μ E^μ=0, and angular momentum (L), represented by ▿_μ J^μ=0, to obtain the following equations:\n\n    [ṀE-2π√(-g)Ω W^r_ϕ]_,r=4π rF(r)E,\n\nand\n\n    [ṀL-2π√(-g)Ω W^r_ϕ]_,r=4π rF(r)L,\n\nwhere W^r_ϕ is called the averaged torque and given by\n\n    W^r_ϕ= ∫_-h^h <t^r_ϕ> dz.\n\n\nThe value <t^r_ϕ> is the (ϕ,r) component of the stress-energy tensor which is determined by averaging it over a time interval δ t and an angle δϕ=2ϕ. Equation (<ref>) represents a balanced-energy equation where the rest mass energy of the disk (Ṁ E) and the energy caused by the torque present in the disk (2 π√(-g)Ω W^r_ϕ) are in equilibrium with the energy radiated (4 π r F(r) E) from the surface of the disk.\n\nThe equation (<ref>) depicts the balance of angular momentum, in which the transferred angular momentum by the rest mass of the disk (Ṁ L) and that due to the present torque in the disk (2π√(-g)Ω W^r_ϕ) is equally counterbalanced by the transferred angular momentum from the surface of the disk through the outgoing radiation (4 π r F(r) L).\n\nBy applying the energy-angular momentum relation, E_,r=Ω L_,r, and eliminating W^r_ϕ from equations (<ref>) and (<ref>), we can derive an expression for the time-averaged energy flux F(r) that is emitted from the surface of an accretion disk surrounding a compact object\n\n    F(r)=-Ω_,rṀ/4π√(-g)(E-Ω L)^2∫_r_ISCO^r(E-Ω L)L_,r dr.\n\nThe relationship between the temperature of the accretion disk and the energy flux can be expressed as:\n\n    F(r)=σ T^4(r).\n\nIn the same vein, the Stefan-Boltzmann constant is denoted by σ. By taking into account both energy and angular momentum conservation laws, we can obtain the derivative of the luminosity L_∞ at infinity as <cit.>\n\n    dℒ_∞/dln r=4 π r √(-g) E F(r).\n\nNow, considering the disk emission as a blackbody emission and calculating the spectral luminosity by converting the differential luminosity as a function of (r) into the spectral luminosity with the dependency on frequency (ν) and get the following expression,\n\n    νℒ_ν,∞=60/π^3∫_r_ISCO^∞√(g) E/M^2(u^t y)^4/exp[u^t y/F^1/4]-1 dr\n\nwhere, y=h ν /kT_* is a dimensionless parameter with h Planck constant, k Boltzmann constant, and T characteristic temperature of the disk. The figures in Figs.<ref>, <ref>, <ref> and <ref> depict the energy flux, temperature, differential luminosity, and spectral radiation, respectively. The results show that when the NLE parameter β (left) increases, the radiative flux, temperature, differential luminosity, and spectral profile of the disk also increase whereas it decreases when the magnetic charge increases q_m (right). This implies that for higher values of the β and lower values of the q_m, the radiation emitted from the disk is greater, and the temperature of the disk will be higher compared to the other values of β and q_m. The spectral luminosity is particularly interesting from an observational standpoint, as both the parameters β and q_m have shifted the curve downward compared to the Schwarzschild space-time case (β=q_m=0). The effect of q_m is much more prominent in comparison to the effect of β in the lower branch of the spectrum with respect to the Schwarzschild case. Therefore, magnetically charged black holes exhibit higher spectral luminosity than uncharged black holes, and in the future researchers may want to explore the possibility of detecting such black holes through observations.\n\n\n\n\n\n\n\n\n\n\n\n\n \n  \n   \n\n\n \n  \n   \n\n\n \n  \n   \n\n\n\n \n  \n   \n\n\n\n\n\n §.§ Direct Emission, Lensing Ring, And Photon Ring\n\n\nIn this section, we investigate the impact of photon trajectories on the black hole shadow and the observed emission profile for an observer within the framework magnetically charged NLED black hole. \nMoreover, we aim to examine the trajectories of photons around a magnetically charged NLED black hole and their impact on the observed emission profile and black hole shadow for an observer located at a finite distance from the black hole. To accomplish this, we adopt a method introduced by Wald et al. <cit.> to categorize null rays emanating from the observer's sky based on the number of orbits n(γ), which represents the final azimuthal coordinate ϕ of the ray after it has completely escaped the effective gravitational field of the black hole. This parameter indicates how many times the geodesic γ has crossed the accretion disk's equatorial plane and is defined as follows:\n(1) Null rays with n<3/4 correspond to direct emission and have only crossed the equatorial plane once.\n\n(2) Null rays with 3/4<n<5/4 correspond to the lensing ring and have crossed the equatorial plane twice.\n\n(3) Null rays with n>5/4 correspond to the photon ring and have crossed the equatorial plane more than twice.\n\nIn this figure <ref>, we have presented a plot of the number of orbits n versus the impact parameter b. The direct emission rays are represented by the color black, the lensing ray by yellow, and the photon ring rays by red. The green dashed circle in the ray tracing figure indicates the photon orbit. It should be noted that we utilized the Okyay-Övgün Mathematica notebook package <cit.> to calculate the thin-accretion disk, null geodesics, and shadow cast, which was also employed in <cit.>.\n\n\n\n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n \n  \n   \n    \n   \n   \n \n  \n   \n    \n \n\n   \nIn Table <ref>, we present the changes in the black hole shadow as the magnetic charge q_m increases. Our main objective was to investigate the impact of the magnetic charge on photon trajectories around the NLED black hole. Fig. <ref> is a 2D plot showing the same. The range of lensing and photon rings increases with q_m, and the shadow angular diameter also increases as the horizons shift outwards with the magnetic charge. An increase in q_m leads to an increase in the contribution of brightness from lensing and photon rings. Furthermore, when the impact parameter is near the critical impact parameter b ± b_c for the photon trajectories, the photon orbit indicates a narrow but sharp peak in the (b,ϕ) plane. For all the cases, the photon trajectories show that as we continually increase the impact parameter, all trajectories will fall into the category of direct emission.\n\n\n\n §.§ Transfer functions and observed specific intensities\n\nHere, we aim to explore the intensity emanating from the black hole as detected by an observer located a finite distance away. We make the assumption that the disk releases radiation isotropically within the stationary worldline's rest frame, and therefore, Liouville's theorem can be applied to the ratio of the emitted intensity (I^em_ν) and its frequency (ν_e^3) along the path of the light ray. Consequently, the formula for the observed intensity can be derived\n\n    I_ν'^obs=g^3 I_ν^em.\n\nWe define g=√(f(r)), use it to calculate the observed intensity I_ν'^obs of a frequency (ν') coming from a black hole. We integrate all the frequencies using the equation,  ν'=g dν, with the total emitted specific intensity being given by I_em=∫ I_ν^em dν. Finally, we can calculate the observed frequency using this information\n\n    I^obs=g^4 I_em.\n\nTherefore, the sum of the received intensity for an observer will be given as\n\n    I(r)=∑_n I^obs(r)|_r=r_m(b),\n\nThe m^th intersection in the equatorial plane outside the horizon is called the transfer function, denoted as r_m(b) in the text. It gives us the relationship between the impact parameter of the photon with the radial coordinates. The slope of this transfer function is known as the demagnification factor, which tells us about the demagnified scale of the photon transfer function <cit.>. Accordingly, the transfer functions have been represented for different values of the magnetic charge \"q_m\" (see Fig. <ref>). \n\n\n\n\n \n  \n   \n    \n  \n\n\nIn Figure <ref>, we plotted the transfer function (r_m(b)) with impact parameter (b) for q_m=0.1,0.3, and 0.5 with β=0.3. In all the plots, black dots depict the transfer function for the direct emission which has a nearly constant slope and corresponds to m=1. The slope of the direct emission represents the redshifted source profile for photons received by the observer. The transfer function for the lensing ring has been shown by yellow dots which corresponds to m=2. It is observed that for the lensing ring as b approaches the critical impact parameter b_c, the slope for m=2 is small, but it increases rapidly as b increases. Since the slope is much greater than one, the back side image of the accretion disk will be demagnified for the observer receiving the photons from the back side of the disk. And the photon ring is represented by the red dots which correspond to m=3 having an infinite slope for the transfer function. This indicates that the front side of the accretion disk will be highly demagnified for the observer. Therefore, the main contribution to the observed flux is coming from the direct emission of photons from the accretion disk. Here, we are not considering the emissions which correspond to (m>4) because of their minimal contribution to the observed flux due to their infinite slopes in the transfer function. Hence, we are only concerned with the transfer function corresponding to m=1,2, and 3.\n\n\n\n §.§ Observed characteristics of direct emission, photon, and lensing rings\n\nThe specific brightness is solely dependent on the radial coordinate r for the observer. Thus, we will now discuss three theoretical models that are ideal for the emission intensity profile from the accretion disk, denoted as I_em\n\n  \n  * Model 1:\n    I_em^1(r)= \n    ( 1/r-(r_ISCO-1))^2   ,     r≥ r_ISCO\n    \n        0,                  r ≤ r_ISCO\n\n  \n  * Model 2:\n    I_em^2(r)= \n    ( 1/r-(r_ph-1))^3   ,     r≥ r_ph\n    \n        0,                  r ≤ r_ph\n\n   \n  * Model 3:\n    I_em^3(r)= \n    1-arctan(r-(r_ISCO-1))/1-arctan(r_ph)    ,     r≥ r_h\n    \n        0.                  r ≤ r_h\n\n\nThe models consist of three distinct radii: r_ISCO, r_ph, and r_h, representing the innermost stable circular orbit, photon sphere around the black hole, and the event horizon of the black hole respectively. Each of the models exhibits unique features. For example, the second model has a rapid decay rate, while the third model has a very slow decay rate compared to the others. Also, the third model considered the disk to be distributed till the horizon and the emission starts directly from the horizon, while the second model considered that emission starts from the photon sphere and the first model considered emission from the ISCO.\n\n\n\n\n \n  \n   \n    \n  \n   \n \n  \n   \n\n \n  \n   \n  \n   \n  \n\n\n\n\n\n \n  \n   \n    \n \n  \n   \n  \n   \n    \n  \n   \n    \n \n  \n   \n\n\n\n\n\n \n  \n   \n    \n  \n   \n    \n  \n   \n    \n \n  \n   \n  \n   \n   \n\n\nFigures <ref>, <ref>, and <ref> display the observed features of the thin accretion disk, including the observed intensity and impact factor, corresponding to the above described three models for different magnetic charges of q_m=0.1,0.3,0.5, respectively with β=0.3. Across all figures, we observe that the emission intensity coming from the accretion disk (first row, first column) for the first model as described earlier (top row), has a peak near the critical impact parameter at r∼ b_c, which then decreases with the radial distance and ultimately reaches zero. Additionally, we note that the location of the photon sphere is inside the interior region of the disk's emission profile. Furthermore, due to the effect of the gravitational lensing, we observe two independently separated peaks corresponding to the lensing and photon rings (first row, second column) within the region of the observed emission profile. However, we find that the peaks of the photon and lensing rings have a narrower observational area with respect to the direct emission and are also smaller in size. Thus, we conclude that in the observed intensity, the main contribution is coming from the direct emission, with smaller contributions from the lensing rings and an even smaller contribution from the photon rings. Furthermore, it is evident from the 2D shadow image (first row, third column) that the direct emission and photon ring are dominating the optical appearance of the accretion disk in this model.\n\nIn the second toy model (second row of the figures), the emission intensity from the disk reaches its peak value at the photon sphere (r∼ r_ph) and then decreases as we move away radially (first column of the second row). The observed intensity profile (second column of the second row) also has a peak due to the direct emission, but it then attenuates as r increases. The lensing and photon rings in this model are overlapping, which results in an increase in the total intensity of that area, leading to a new peak with multiple small peaks due to the effect of the photon ring, lensing ring, and direct emission. However, as we discussed earlier, the photon and lensing rings have a narrow area and are highly demagnified. Therefore, the observed intensity is still dominated by the direct emission, as can be observed in the 2D shadow image of the accretion disk (third column of the second row).\n\nIn the last third model (shown in the third row of the figures), the intensity peaks at the black hole's horizon and decreases as the radial distance from the black hole increases (as seen in the first column of the third row). In this particular case, the photon ring, lensing ring, and direct emission regions overlap for a significant range of radial distance, resulting in a peak in the observed intensity (shown in the second column of the third row). The intensity increases gradually just above the horizon and then shows a sharp increment to a peak value in the photon ring region. Also, due to the existing contribution of the lensing ring, the observed intensity of the disk shows a higher peak value, followed by a sudden and slow decrease, and then eventually decreases to zero as shown in the Figure. Consequently, the 2D shadow image exhibits multiple rings resulting from the observed contribution of the photon ring, lensing ring, and direct emission (shown in the third column of the third row) It is clear that for q_m=0.1 to q_m=0.5, the variation in the observed intensity is very prominent hence with some relativistic emission intensity profile, one can explore more about the effect of the charge on the observed shadow.\n\nIn this section, we compared the emission profiles of the three models emitted from the accretion disk with the observed intensity observed by an observer and the optical appearance of the disk for various magnetic charge values (q_m=0.1,0.3,0.5) when β=0.3. We noticed that as we increase the magnetic charge, the observed intensity decreases with the peak of the direct, lensing, and photon rings occurring at different locations. However, the magnitude of the peak intensity is much less than that for the Schwarzschild spacetime <cit.>. This indicates that there are significant changes in the observed intensities of the disk when we consider the magnetically charged NLED effect in the theory, and we can differentiate between the NLED black hole with a magnetic charge and the Schwarzschild black hole. This could be more interesting to study in detail and we expect that in future with more precious observations, we will be able to make this difference more clear.\n\n\n\n §.§ Shadow With Infalling Spherical Accretion\n\nLet's dive into this section, where we'll explore the infalling spherical accretion around a magnetically charged NLED black hole. Specifically, we'll be using the optically thin disk model developed by Bambi <cit.> to examine the behaviour of radiative gas as it moves around the black hole to form the spherical accretion disk. Our goal is to gain insight into the observable features of this system by studying the effect of the magnetic charge q on the spherical accretion. To do this, we'll be analyzing the specific intensity observed by an observer located at a finite distance from the black hole\n\n    I_obs= ∫_Γ g^3 j(ν_e) dl_prop,\n\nit is noted that g, ν_e, and ν_obs represent the redshift factor, photon frequency, and observed photon frequency, respectively. We can shift our focus to the emitter's rest frame, where we have the emissivity per unit volume, j(ν_e) ∝δ (ν_e-ν_f)/r^2, which has a radial profile proportional to 1/r^2. In the above equation, δ is the delta function, ν_f refers to the frequency of the radiative light, which is considered to be monochromatic, and dl_prop is an infinitesimal proper length. The redshift factor for any black hole space-time can be expressed as:\n\n    g=𝒦_ρu_o^ρ/𝒦_σu_e^σ.\n\nThe four-velocity of a photon is denoted as 𝒦^μ, which represents its velocity in four-dimensional spacetime. On the other hand, u_o^μ=(1,0,0,0) is the known four-velocity of a static observer located at infinity. Therefore, the four-velocity (u_e^μ) of the matter which is in the infalling accretion can be written as,\n\n    u^t_e=f(r)^-1,u^r_e=-√(1-f(r)),u^θ_e=u^ϕ_e=0.\n\nTherefore, we can express the four velocities of the photon utilizing the null geodesic,\n\n    𝒦_t=1/b,𝒦_r/𝒦_t=±1/f(r)√(1-f(r)b^2/r^2),\n\nWe use the symbols + and - to represent whether the photon moves towards or away from the black hole. With this in mind, we can express the redshift factor for the infalling accretion\n\n    g=[ u_e^t + ( 𝒦_r/𝒦_e) u^r_e ]^-1.\n\nThe proper distance will be changed as follows:\n\n    dl_prop=𝒦_μu^μ_e dλ = 𝒦_t/g |𝒦_r |dr.\n\nTherefore, we can now calculate the observed intensity of the disk with the infalling spherical accretion by integrating equation (<ref>) over all frequencies\n\n    I_obs∝∫_Γg^3 𝒦_t dr/r^2 |𝒦_r |.\n\nUsing the above equations, we examine how the distribution of the brightness of the black hole shadow can be affected by the magnetically charged NLED black hole.\n\nThe plot in Fig. <ref> indicates that the observed specific intensity I_obs rises sharply as the impact parameter b increases for all the values of the magnetic charge and reaches a peak value at b ∼ b_ph. Beyond the point where b>b_c, the observed intensity (I_obs) diminishes and ultimately reaches zero as b approaches infinity. An increase in magnetic charge q_m has been observed to decrease the peak value and goes to zero at the same rate for all cases as the impact parameter increases. The graph includes Schwarzchild β=q_m=0 (in black), q_m=0.1 (in green), q_m=0.3 (in blue), and q_m=0.5 (in red) for comparison with β=0.3. A similar effect is observable in the 2D shadow image (refer to Fig. <ref>) where it is clear that the brightness decreases with increasing the magnetic charge (q_m) and the angular diameter also increases. From the observation point of view, it is clear that for the higher value of the magnetic charge, the intensity of the shadow should decrease. \n\n\n\n\n\n\n§ CONCLUSIONS\n\nIn this paper, we aimed to investigate the impact of a magnetically charged NLED black hole on various physical parameters, such as the radiation emitted by a thin accretion disk. Our preliminary investigation examines the behavior of the photonsphere under the effect of the NLED parameter β and magnetic charge q_m. For instance, the magnetic charge generally increases the photonsphere radius proportionally, in contrast to the effect of β. It turns out that as photons traverse the modified black hole geometry caused by the NLED parameter and q_m, an increase in shadow size is perceived by some remote observer. Using realistic values for the observer position and SMBH data from the EHT, M87* gives a wide range for q_m than in Sgr. A*. In M87*, there are values of q_m that match exactly the observed shadow radius. We observe that as the NLED parameter increases, the wider the range for q_m would be.\n\nNext, we analyzed the qualitative behaviour of the β and q_m on the time-averaged energy flux (F), disk temperature (T), differential luminosity (dL_∞), and spectrum νℒ_ν∞ produced by the thin accretion disk in the equatorial plane surrounding the black hole. Our findings indicate that an increase in the NLED parameter (β) of the black hole results in an increase in all the mentioned physical parameters, as well as some deviation from the radiation spectrum of a Schwarzschild black hole while it shows completely opposite behaviour as we increase the magnetic charge (q_m). We observed in the spectrum profile that the change in the spectrum for q_m is more prominent than for β with respect to the Schwarzchild black hole therefore we decided to study the effect of the magnetic charge on the shadow profile of the black hole.\n\nIn order to do that we focused on studying the emission profile of a thermally stabilised black hole and looked at the effect of the magnetic charge on some specific ideal emission profiles to get a qualitative idea about the observed emission profiles. We used the Okyay-Övgün Mathematica notebook package <cit.>, which has also been used in <cit.>, to investigate the effect of the black hole's magnetic charge on the shadow and rings using three toy models of a thin accretion disk. The observed profiles displayed multiple peaks, but it was determined that direct emission was the main factor contributing to the shadow image for the first two models. However, for the third model of the emission profile, the lensing ring was observed to have a significant impact due to the presence of a magnetic charge in the NLE black hole.\n\nThe current study investigated the impact of the magnetic charge of the NLED black hole on the observed features of spherical accretion flows. Results showed that an increase in magnetic charge leads to a decrease in the peak of observed intensity. However, this effect is accompanied by a decrease in intensity at the same rate. The impact of increased intensity can be observed in the 2D shadow image Fig. <ref>, where the plot of q=0.1 exhibits higher brightness in comparison to q_m=0.3 and q_m=0.5 with β=0.3. In the future, this research could be expanded to explore the impact of other variables on the observed features of spherical accretion flows. Additionally, more studies could be carried out to explore the implications of these findings for our understanding of black holes and the universe.\n\nA. Ö. and R. P. would like to acknowledge networking support by the COST Action CA18108 - Quantum gravity phenomenology in the multi-messenger approach (QG-MM). The work of SC is supported by the SERB-MATRICS grant MTR/2022/000318.\n\n\n"}