{"entry_id": "http://arxiv.org/abs/2303.07171v1", "published": "20230313151353", "title": "Simultaneous generation and detection of energetic particle and radiation beams from relativistic plasma mirrors driven at kHz repetition rate", "authors": ["Jaismeen Kaur", "Marie Ouillé", "Dan Levy", "Louis Daniault", "Axel Robbes", "Neil Zaïm", "Alessandro Flacco", "Eyal Kroupp", "Victor Malka", "Stefan Haessler", "Rodrigo Lopez-Martens"], "primary_category": "physics.plasm-ph", "categories": ["physics.plasm-ph", "physics.optics"], "text": "\n\nAIP/123-QED\n\n\n\n\n\n\n\n jaismeen.kaur@ensta-paris.fr  \n  \n \n \n \n \n \n \n \n \n \n\n\n\n\n\n\nWe report on the first simultaneous measurement of high-order harmonics, relativistic electrons and low divergence proton beams generated from plasma mirrors driven at kHz repetition rate by relativistic-intensity milliJoule-energy femtosecond laser pulses. This setup enables detailed parametric studies of the particle and radiation spatio-spectral beam properties for a wide range of controlled interaction conditions, such as pulse duration and plasma density scale length. This versatile setup should aid in further understanding the collective laser absorption mechanisms at play during the laser-plasma interaction and in optimizing the secondary beam properties for potential applications.\n\nSimultaneous generation and detection of energetic particle and radiation beams from relativistic plasma mirrors driven at kHz repetition rate\n    Rodrigo Lopez-Martens\n    March 30, 2023\n==============================================================================================================================================\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nWhen an intense femtosecond laser pulse is tightly focused on an optically polished solid surface, it generates a thin layer of surface plasma with near-solid density, which becomes highly reflective for the incident laser light, and is therefore often called \"plasma mirror\" (PM). Progress in high-power laser technology going back almost two decades, in particular the generation of ultra-short laser pulses with high temporal contrast <cit.>, has enabled the exposure of PMs to peak electric field amplitudes that can drive relativistic plasma electron motion, making PMs potentially interesting sources of ultrashort energetic particle and radiation beams for applications. For typical lasers emitting around a central wavelength λ_0 = 800 nm, this occurs for peak focused intensities I_0 > 10^18 W/cm^2 or normalized vector potentials a_0 = √(I_0 [W/cm^2] λ_0^2 [μ m^2]/ 1.37× 10^18) > 1. In this so-called relativistic regime, the highly nonlinear PM response to laser light can lead to generation of high-order laser harmonics (HHG), relativistic electron bunches and energetic ion beams. \n\nHHG extends into the extreme ultra-violet (XUV) and even up to the X-ray <cit.> spectral ranges and corresponds to a train of attosecond pulses in the time domain <cit.>. Two main generation mechanisms have been identified in simulations and experiments: coherent wake emission (CWE) <cit.> and relativistic oscillating mirror (ROM) <cit.>. In CWE, the laser field injects vacuum-heated or so-called \"Brunel\" electrons <cit.> from the surface into the bulk of the plasma, forming a propagating electron density peak which excites plasma oscillations in its wake, finally leading to HHG. CWE is an ubiquitous mechanism in all HHG experiments on PMs <cit.> and is efficient even at intensities as low as I∼10^15 W/cm^2. ROM only comes into play at relativistic intensities, where the PM surface itself begins to oscillate at relativistic velocities, leading to a periodic frequency upshifting of the reflected light, resulting in HHG. In the relativistic regime, it is important to take electron motion into more detailed account, as in the more advanced relativistic electron spring <cit.> and coherent synchrotron emission <cit.> models. The relative contributions of relativistic HHG (RHHG) and CWE to the total emission depends mainly on the incident laser intensity <cit.> and the plasma gradient scale length  <cit.>. These two HHG families are easily distinguishable experimentally through their different spectral widths, phase properties and divergence. \n\n\n\nIn addition to HHG, PMs can also emit ultrashort relativistic electron bunches. It is possible to access different acceleration regimes by controlling the plasma conditions. For relatively long density gradients ( > λ_0), electrons are accelerated to multi-MeV energies by a laser wake-field produced inside the plasma gradient itself, a process which is only observed with few-optical-cycle driving pulses <cit.>. For sharper density gradients (≪λ_0), electrons ejected out of the plasma surface co-propagate with the reflected laser field in vacuum and subsequently gain large amounts of energy by vacuum laser acceleration <cit.>. The energy and charge of the electron beam emitted in this regime have been found to be correlated to RHHG emission <cit.> and anti-correlated to CWE <cit.>. \n\nMost of the experimental ion acceleration studies from PM have been focused on the beams emitted from the back-side of the target through the well-known target normal sheath acceleration (TNSA) mechanism <cit.>. TNSA-based ion sources show large beam divergences, varying from 10^∘ to 30^∘ depending on the driving laser and target parameters <cit.>. Often, additional collimation devices and special target geometries <cit.>, along with complicated target fabrication and handling are required to keep the beam collimated. However, in case of front-side ion acceleration, a different acceleration mechanism driven by Brunel electrons has been found to be more efficient than TNSA for the steepest plasma density gradients <cit.>. Acceleration takes place during the time of interaction of the laser pulse with the plasma and results in extremely low-divergence proton beams <cit.>. Such exceptional beam properties, useful for numerous potential applications <cit.> from a fairly simple target geometry warrants further exploration of this particular acceleration regime. \n\nHere, we report on the recent progress on HHG, electron and proton acceleration from relativistic PMs driven at kHz repetition rate. At the heart of this work is the simultaneous measurement of these three signals with a controlled surface plasma density gradient. A simultaneous measurement enables us to observe direct correlations between the signals whilst ensuring identical interaction conditions on target. These multiple diagnostics are a fine in-situ probe into the collective plasma dynamics and can be a powerful tool to better understand the rich underlying nonlinear physics. Previously such measurements have been limited to HHG and electrons <cit.>. We extend the previous work by additionally measuring the accelerated proton beams, characterizing them spectrally as well as spatially. At constant driving pulse energy and focused spatial beam distribution, we can vary the driving pulse duration between 4 fs and 1.5 ps, thus scanning over a wide range of intensities I ∼ 10^16 - 10^19 W/cm^2 and transitioning from the sub-relativistic to the relativistic regime, while observing all three emission types (HHG, electrons and protons) simultaneously. \n\n\n\n\n§ EXPERIMENTAL SETUP\n \n\n\n\n §.§ Driving pulses\n\nThe experiments were carried out in the Salle Noire laser facility at Laboratoire d’Optique Appliquée (LOA), delivering waveform-controlled, up to 2.5 mJ on-target, high-temporal contrast (> 10^10@10ps) laser pulses, centered around λ_0 = 780nm, with tunable pulse duration from 27 fs to sub-4 fs <cit.>. While maintaining the same on-target fluence (same energy contained within the same focal volume), the laser pulses can also be stretched up to 1.5 ps by adding group delay dispersion using an acousto-optic programmable dispersion filter (Dazzler, Fastlite) integrated into the laser chain. A schematic layout of the experimental set-up is illustrated in figure <ref>. Under vacuum, the p-polarised Main pulses are focused by an f/1.3 28^∘ off-axis parabolic (OAP) mirror (effective focal length f=54.4mm) onto a rotating, thick fused optical grade silica target at an incidence angle of θ_i = 55^∘, to a ≈ 1.8 μm FWHM spot.\n\n\n\n §.§ Plasma density gradient control\n\nA spatially overlapped, time-delayed Pre-pulse is created by picking-off ≈ 4% of the Main pulse through a holey mirror, decreasing its size by a factor ≈2 in a Galilean telescope, and sending it through a delay stage. It is collinearly recombined with the Main pulse through a second holey mirror (M1 in figure <ref>) before being focused to a 13 μ m FWHM spot with the same OAP. Its much larger size compared to the Main pulse leads to a spatially homogeneous plasma expansion on the target surface. The plasma density gradient scale length, ≈ L_0 + τ, is scanned by varying the lead time τ of the Pre-pulse before the Main pulse. Here, L_0 is the scale length increase due to the finite temporal contrast of the Main pulse. The plasma expansion velocity  is measured with the spatial domain interferometer (SDI) technique <cit.>, detailed in section <ref>.\n\nThe overlapped Pre-pulse (in grey scale) and Main pulse (in color-scale) beam profiles in-focus are shown in figure <ref>(f). Whether at fixed lead time or during a τ-scan, the spatial overlap of these two focal spots is extremely stable thanks to laser's excellent pointing stability and to the use of a retro-reflector and a low-wobble motorized translation stage in the Pre-pulse delay line. The retro-reflector produces an elliptical polarization state of the Pre-pulse, which is remediated by a half-wave plate that rotates the major axis of the ellipse into the p-polarization direction.\n\n\n\n §.§ Solid target and shot sequence\n\nA rotating target positioner refreshes the target surface at kHz repetition rate with precise control over shooting position and rotation speed, maintaining adequate shot spacing between consecutive laser shots <cit.>. To ensure identical shot-to-shot interaction conditions, the target surface is aligned with high precision to be perpendicular to the rotation axis with the help of a frequency-stabilized helium-neon laser in a Mach-Zehnder interferometer <cit.>. The residual target fluctuations in the normal direction are maintained <z_R/5 peak-to-valley, where z_R is the Rayleigh range of the driving laser. Angular fluctuations are reduced to <80 μrad peak-to-valley, limited by mechanical stress in the target's rotary bearing.\n\n\n\nA slow and a high-speed mechanical shutter (Uniblitz CS45, 45 mm diameter, 14 ms opening time), block the beams in front of the OAP for longer ∼1-s durations between acquisitions and control the shot sequence length, respectively. The target controller, made from an Arduino micro-controller board, (i) tracks the angular and radial positions of the laser-target interaction point and which of these positions have already been shot at, (ii) sets the target rotation speed according to the desired shot spacing (typically 100 μm), and (iii) triggers the shot sequence as well as the diagnostics detailed in section <ref>. For an acquisition, the target controller triggers the slow shutter opening and sets the target rotation speed. Once an angular position with a fresh target surface has been reached, the fast shutter opens and 14 ms later the diagnostics are triggered. After the desired acquisition time (typically 100 ms, thus averaging over 100 consecutive laser shots), the fast shutter closes, the target rotation slows down and the slow shutter closes. Once a full circle of shots at a given radius is completed, the target is translated laterally by typically 100 μm to commence a new circular shot pattern.\n\nWe exclusively use SiO_2 as target material in the form of uncoated 5 inch diameter substrates, polished to λ/10 flatness on both faces. With a 100 μm shot spacing, these targets can in principle take 1.2 million consecutive shots per face, corresponding to 20 min of continuous operation at 1 kHz. In practice, we take ≈1000 acquisitions of ≈100 shots per day of experiment, so that one target lasts approximately one month.\n\n\n\n\n §.§ Diagnostics\n\nThis experimental set-up has been designed to simultaneously detect three observables resulting from the laser-PM interaction, namely the emission of HHG radiation, energetic electrons, and proton beams. This is achieved with three dedicated diagnostics, illustrated in figure. <ref>b,c,d and detailed below. These are complemented by a fourth one consisting in recording the reflected laser beam's near-field beam profile, as illustrated in figure <ref>a. \n\n\n\n  §.§.§ XUV spectrometer\n\nA rectangular hole in the screen for the near-field beam profile transmits light within the angular acceptance of the XUV spectrometer that spectrally characterizes the HHG emission.  The spectrometer consists of an aberration-corrected, flat-field concave grating (Hitachi 001-0639, 600 groves/mm, incidence angle α = 85.3^∘, optimized for wavelenegths λ≈ 22-124nm) that images in the horizontal dimension the ∼1 μ m size HHG source spot on the PM surface, and spectrally disperses it onto an image plane. Beam propagation is hardly influenced in the vertical dimension which thus provides angular resolution to the resulting spectrograph. A single-stack micro-channel plate (MCP) coupled with a P46 phosphor screen (Photonis Scientific, APD 1 PS 97X79/32/25/8 I 40:1 P46) is placed in the image plane. It is finally imaged using a CCD camera (12-bit PCO Pixelfly VGA). Figure <ref>(a) shows a typical recorded XUV spectrograph. The MCP is time-gated for 200 ns synchronously with the laser pulses to suppress background signal from longer incoherent plasma emission. The P46 phosphor screen has a decay time of ≈ 300 ns enabling detection at kHz repetition rate. \n\n\n\n  §.§.§ Electron diagnostics\n\nThe angular electron distribution is measured with a scintillating screen <cit.> (Carestream Lanex fast), placed ∼ 20cm from the point of interaction, covering a small but sufficient angular range between the target normal and the specular direction, for 30^∘ < ϕ < 50^∘, where ϕ is the angle w.r.t the target normal in the plane of incidence. The front side of the Lanex-screen is covered with a 15 μ m thick aluminium foil to block visible light and low-energy electrons (E_k < 150keV). Detection of low-energy electrons is also suppressed by the substrate of the Lanex-screen. The green light emission of the Lanex-screen is imaged by a second CCD camera (12-bit, Pixelink PL-B957U) through an interferometric band-pass filter. The electron energy spectrum can be measured for ϕ = 38^∘ - 40^∘ by inserting a purpose-built electron spectrometer, comprising of a 0.5-mm pinhole and a pair of neodymium magnets (B_0≈ 80mT over ≈20mm). The magnetic field map has been measured with a Hall probe and injected into a numerical electron trajectory calculation to calibrate the electron energy vs. the position along the trace of deflected electrons on the Lanex-screen. \n\n\n\n  §.§.§ Proton diagnostics\n\nAccelerated protons along the target normal are spectrally characterized using an in-house built Thomson parabola spectrometer (TPS). A 300 μ m pin-hole placed at about 60 cm from the point of interaction selects protons emitted along the target normal direction, which are then dispersed in energy and charge-mass ratio by a 2 kV/cm electric and an anti-parallel 300 mT magnetic field, created by 50 mm long electrodes and 15 mm long magnets, respectively. Figure <ref>(c) shows a typical recorded TPS trace. Protons can be easily distinguished from the heavier ions due to their unique charge-to-mass ratio. The TPS trace is recorded with another MCP-Phosphor screen assembly imaged by a third CCD camera (12-bit, Pixelink PL-B957U).\n\nAlternatively, angularly resolved proton spectra can be measured with a movable time-of-flight (TOF) detector. It consists of a 6 mm diameter MCP, placed ≈37.5 cm from the point of interaction, and mounted on a linear translation stage moving parallel to the target surface. This TOF-MCP has an angular acceptance of 0.9^∘, small enough to neglect the convolution owing to the finite size of the detector. The transient MCP current is read out using a KEYSIGHT MSOS804A 8 GHz oscilloscope capable of individually recording all ∼100 shots in one acquisition, when operated in segmented memory acquisition mode. Figure <ref>(d) shows a typical recorded TOF trace. \n\n\n\n\n§ EXPERIMENTAL RESULTS\n\n\n\n\n §.§ Plasma density gradient measurement\n\n\nThe plasma density profile on the target surface is a critical experimental parameter, be it for HHG <cit.>, electron acceleration <cit.>, or proton acceleration <cit.>. Its control requires a high temporal contrast of the femtosecond driving laser, typically such that its intensity remains <10^10W/cm^2 until <10ps before the pulse peak. This is 2 orders of magnitude below the intensity required to start field-ionizing<cit.> SiO_2, and also excludes possible multi-photon processes. If this is the case, a femtosecond Pre-pulse can create a preplasma with an initially quasi-step-like density profile, with an electron density n_0 in the half-space x<0, the x-direction being perpendicular to the target surface. The free expansion of such a plasma can be described by a 1D isothermal (i.e. constant electron temperature T_e) model <cit.> yielding a time-dependent exponential electron density profile that starts dropping at x=-c_st from n_0 towards vacuum like\n\n    n(x,t) = n_0 exp[-x/ t -1],\n\nwith a gradient scale length = t that linearly increases with the so-called ion sound velocity = √(Z k_BT_e/m_i), where Z is the ion charge state, k_B the Boltzmann constant, and m_i the ion mass. This implies that, as long as the absorption coefficient of the Pre-pulse by the target surface is intensity-independent, so that the resulting local electron temperature T_e is proportional to the local Pre-pulse fluence F, the local expansion velocity  at every position is proportional to √(F). \n\n\n\nAs a daily routine measurement, this characteristic velocity c_s of the plasma expansion initiated by the Pre-pulse is determined with the SDI technique introduced by Bocoum et al. <cit.>. The principle of SDI is to interfere light reflected off the expanded plasma with light reflected off an unperturbed part of the target surface. The light is considered to reflect on the critical-density surface at depth x_c, where the electron density is n_ccos^2θ_i, with n_c=ω_0^2 m_eϵ_0/e^2, the laser carrier angular frequency ω_0, the electron mass m_e, the vacuum permittivity ϵ_0 and the electron charge e. The phase shift due to the reflection at x = x_c rather than at the initial target-vacuum boundary at x=0 is given by (as in Bragg reflection) \n\n    ϕ = 2ω_0/c x_ccosθ_i.\n\nDephasing due to propagation through the low-density tail of the plasma is at least an order of magnitude smaller and is thus neglected. The measured phase shift as a function of the Pre-pulse lead time τ thus tracks the position x_c(τ) of the critical density surface. Imposing the exponential shape of equation <ref> (where time t is equivalent to τ) for the plasma density profile, this corresponds to the gradient scale length\n\n    (τ) = x_c(τ)/ln[n_0/(n_ccos^2θ_i)]-1.\n\n\nExperimentally, SDI is implemented  by inserting a periodic transmission mask of period a (in our case a hexagonal pattern of 3 mm holes with a period a=4mm) into the near-field of the main beam, as shown in figure <ref>, thus transforming it into the probe beam for SDI. Upon focusing by the OAP, this turns into its far-field diffraction pattern on the target surface. In the paraxial approximation, this is given by the probe beam's spatial Fourier-transform, which is again a hexagonal pattern of \"probe spots\" (each of the same ≈ 1.8 μm-FWHM size as the main beam focus) with a period d=λ_0 f/a, where λ_0 is the light wavelength. For λ_0=800nm we thus obtain d=10 μm. This means that the central (zeroth diffraction order) probe spot overlaps with the center of the Pre-pulse and thus with the nearly homogeneously expanding plasma with which the Main pulse would interact, while the surrounding hexagon of (first diffraction-order) probe spots overlaps with the wings of the 13-μm Pre-pulse spot, where the Pre-pulse fluence F_1 has dropped to ≈10% of its peak value F_0.\n\nThe expanding plasma thus induces a phase shift Δϕ=ϕ_0-ϕ_1 between the central (zeroth order) and the surrounding hexagon of (first order) probe spots. In the simplest case, the first order spots probe an unaffected target surface, so that ϕ_1=0. \n\nIn our case however, the first-order spots reflect off an expanding plasma \"launched\" by a finite local Pre-pulse fluence of F_1≈0.1F_0, with the fluence F_0 at the Pre-pulse center. Two assumptions are now required: (i) Relying on the 1D isothermal expansion model mentioned above, we can write how much smaller the local expansion velocity at the location of the first order probe spots, ^1, will be compared to its value, , at the center: ^1 = √(F_1/F_0). (ii) We set the maximum plasma density n_0 to be the same everywhere. By combining equations <ref> and <ref>, we deduce that\n\nthe gradient scale length at the Pre-pulse center, , is proportional to the measurable phase shift Δϕ:\n\n    (τ) = α Δϕ(τ), \n    with α = λ_0/(4πcosθ_i)/{ln[n_0/(n_ccos^2θ_i)]-1}(1-√(F_1/F_0)).\n\n\nThe measurement of Δϕ is made by observing, through an interferometric band-pass filter around λ_0=800nm, the modification of the probe beam's near-field profile (cf. Fig.<ref>a). As demonstrated in ref. <cit.> and illustrated in figure <ref>, the pattern reverses every time the phase shift Δϕ reaches an integer multiple of π. The pattern reversal is easily extracted from the recorded near-field images by tracing the \"SDI contrast\" defined as C=[S_b(τ)-S_d(τ)]/[S_b(τ)+S_d(τ)], where S_b and S_d are the integrated signals over selected image areas that are initially (at τ=0) bright and dark, respectively. As visible in the examples shown in the left column of figure <ref>, the SDI contrast oscillates and its extrema mark the times, τ, when the dephasing, Δϕ, has increased by π. The resulting dephasing curve, Δϕ(τ), is found to be linear (at least for the first ≈20ps or so), which through equation <ref> corresponds to a linearly increasing = τ, as expected from the 1D isothermal expansion model. Its slope is easily found by a fit on the linear range of data points and yields the sought-after expansion velocity, , that is then used to calibrate the gradient scale length in experiments.\n\nAlthough it only contributes logarithmically in equation <ref>, the choice of the n_0-value is a significant source of uncertainty. Barrier-suppression intensities for field ionization <cit.> predict ion charge states for the Pre-pulse and SDI probe pulse intensities in our experiments, which  correspond to n_0≈100 n_c only. Field ionization may, however, not be the dominant ionization mechanism. Indeed, once the target is ionized, the laser only interacts inside the plasma skin depth, which is much shorter than a wavelength for a strongly overdense plasma. Then, ionization proceeds through collisional processes in the plasma bulk, possibly further increasing the ion charge states. Estimating the plasma ionization state (which may very well be inhomogeneous and time-dependent) is thus not straightforward. The -values shown in figure <ref> are all obtained with n_0=300 n_c, corresponding to fully ionized SiO_2.\n\n\n\nFigure <ref> shows a series of SDI measurements that answers the question whether the plasma expansion initiated by the Pre-pulse varies with laser pulse duration. Since neither the energy nor the spatial profile of the Pre-pulse vary with pulse duration, its fluence remains the same (≈50 J/cm^2) and only its intensity varies. The question thus comes down to whether the Pre-pulse absorption coefficient is intensity-dependent, which would lead to varying T_e and thus varying . The telescope and wave plate traversed by the Pre-pulse add a group delay and a third-order dispersion of ≈260fs^2 and ≈200fs^3, respectively. As a consequence, the 27 fs pulse is stretched to 38 fs with a peak intensity of 1.1×10^15W/cm^2, the 8 fs pulse is stretched to ≈100fs with a peak intensity of 0.5×10^15W/cm^2, and the 4 fs pulse is stretched to ≈200fs, with a profile dominated by a ≈40fs spike with a peak intensity of 0.7×10^15W/cm^2. As visible in figure <ref>, the three cases lead to very similar expansion velocities, with a variation clearly below the uncertainty of the SDI method itself. We conclude that the -value is independent of the Pre-pulse duration in the range covered by our experiments. This intensity independence corroborates the proportionality ∝√(F) used in the SDI-analysis. \n\nThe slope of the Δϕ(τ)-curves decreases for longer delays, τ>20ps, indicating a decreasing velocity, , and thus a cooling of the plasma electrons through transfer of energy to the ions. The -values relevant to (most of) our PM experiments are however reached before these effect set in, such that the linear evolution, =τ+L_0, remains valid. \n\n\n\n\n §.§ Short and intermediate plasma density gradients\n\n\n\n\nAll data reported here are acquired and integrated over 100 ms long bursts of laser pulses at 1 kHz repetition rate. Figure <ref> shows the simultaneously measured HHG, electron and proton spectra for a range of short to intermediate plasma density gradients, with relativistically intense main driving pulses of (a) 29 fs (a_0 = 1.0 for λ_0 = 800 nm) and (b) 4 fs (a_0 = 2.1 for λ_0 = 780 nm) duration. The gradient scale length is calculated, up to the small offset L_0, as -L_0=τ (top axis) from the plasma expansion velocity = 18 nm/ps, measured as described in section <ref>, and the Pre-pulse lead time τ (bottom axis). Each of the scans in figure <ref> have been individually normalized to its maximum value and hence the spectral intensity cannot be directly compared. The HHG spectrum (figure <ref> top frame) is angularly integrated over the full detected range of [-35 mrad, + 35 mrad]. The spectral response of the MCP has not been taken into account so as to enhance the visibility of higher harmonic orders. We can identify the two regimes for HHG: CWE-HHG at steep gradients (-L_0 < 0.03λ_0) and RHHG at more gentle gradients of -L_0 ≈ 0.03λ_0– 0.2λ_0 <cit.>. In the CWE regime, the intensity-dependence of the Brunel electron trajectories leads to a temporal aperiodicity of the emitted attosecond pulse train and, hence, to broadened harmonics in the spectral domain <cit.>. In contrast, the RHHG emission in the moderately relativistic regime (a_0∼ 1) is Fourier-limited <cit.>, corresponding to narrower spectral widths of the harmonics as compared to the CWE-HHG, as observed in figure <ref>(a) (top frame) with 29 fs driving pulse duration. However, this transition between the CWE and RHHG regimes becomes less distinct with shorter driving pulse durations (a_0>1) since the harmonics emerge in the spectrograph from the interference between fewer attosecond pulses. In figure <ref>(b), for a 4 fs driving pulse, around an optimal -L_0 ≈ 0.08λ_0, the HHG spectrum extends well beyond the CWE cutoff of 30 eV for an SiO_2 target, which is definitive proof of RHHG.\n\nThe electron energy spectrum (figure <ref>, middle frame) is simultaneously measured at ϕ = 38^∘– 40^∘. These positions do not sample the center of the electron beam, which is located a few degrees closer towards the specular direction (see Fig. <ref>c), but they allow simultaneous detection of the HHG emission. At the steepest gradients, where the CWE-HHG is optimum, low electron energy and charge is measured for both driving pulse durations of 29 fs and 4 fs. This anti-correlation between the electron beam energy and charge and CWE-HHG has also been previously observed at sub-relativistic intensities with 30 fs driving laser pulses <cit.>. We measure electrons up to 1.5 MeV in energy in the relativistic regime for a_0>1. Higher energies are expected in the center of the electron beam. The apparent dip in the electron spectra at the optimal gradient for RHHG is suspected to be linked to a moving electron beam.\n\n\n\nFigure <ref> (bottom frame) shows the proton energy spectrum simultaneously measured with the TPS along the target normal direction (ϕ=0^∘). We observe that for both driving pulse durations, the proton energies benefit from the steepest plasma density gradients and are optimised for the same gradients as CWE-HHG, suggesting that Brunel electrons play an important role in the acceleration mechanism <cit.>. If an optimal plasma gradient exists for efficient acceleration of protons, it is below our resolution limit of L_0 ≈ 0.01λ_0. The highest proton energies of 0.25 MeV are obtained with 29 fs driving pulses for the steepest density gradients and drop below the detection threshold of 0.1 MeV for >0.1λ_0. The cut-off energy decreases to ≈0.15 MeV for shorter 4 fs driving pulses.\n\nFigure <ref>(a) shows the proton energy spectrum measured with the TPS for the steepest plasma density gradient and longer driving pulses obtained by adding positive group delay dispersion. We observe an optimum between 100 fs and 300 fs, yielding ≈ 0.45 MeV protons. In this acceleration regime, protons are accelerated only during the the interaction time of the pulse, hence they benefit from a longer driving pulse duration, despite the corresponding drop in laser intensity <cit.>. Figure <ref>(b)-(e) shows the angle-resolved proton energy spectrum measured with the moving TOF detector for four different driving pulse durations, 4 fs (b), 7 fs (c), 29 fs (d) and chirped 200 fs (e), at the steepest plasma gradient. In all cases, we observe a very low ≤ 4^∘ FWHM divergence of the proton beam. This is significantly lower than the 16^∘ FWHM reported earlier <cit.>, which may be the result of a higher temporal contrast ratio of the driving laser in our case.\n\n\n\n\n §.§ Long density gradients regime\n\n\n\n\n\nFor long density gradients (≥λ_0), RHHG disappears due to the onset of chaotic electron dynamics in the near-critical-density layer <cit.> of the plasma density gradient. However, before getting reflected, the laser propagates through the sub-critical tail of the plasma density profile. In the zone of density ∼ n_c/10, few-cycle laser pulses < 10 fs are able to resonantly excite a strong plasma wakefield. Electrons can be injected into this laser wakefield by ionization and then get accelerated to relativistic energies. The plasma wavefront is rotated by the density gradient and electrons are pushed away from the specular direction <cit.>. Figure <ref> shows the electron spectra measured in this regime for gradient scale lengths up to ≈ 10λ_0, reaching up to 2.6 MeV. Note that the gradient scale lengths given by the top axis result from the same 18 nm/ps expansion velocity, as determined for the initial expansion phase with Pre-pulse lead times <20ps. As discussed in connection with figure <ref>, we know that the expansion slows down considerably at longer times, so that the true gradient scale lengths are certainly shorter than those indicated in Figure <ref>.\n\n\n\n§ SUMMARY\n\nWe have reported the first simultaneous measurements of HHG, electron beams and proton beams from a laser-driven PM. The kHz laser repetition rate allowed exploring a wide range of laser and plasma parameters. We have presented spectral measurements of HHG, electrons and protons as a function of controlled plasma density scale lengths ranging from 0.01λ_0 - 0.2λ_0 for three different driving pulse durations: 29 fs (a_0=1.0), 7 fs (a_0=2.0), and 4 fs (a_0=2.1). Such simultaneous measurements vastly expand the level of characterization of relativistic PMs. While ensuring identical interaction conditions on target, we observe direct correlations between the CWE-HHG and Brunel-dominated accelerated proton beams, and the anti-correlated emission of relativistic electron beams. We also observe direct correlation between the RHHG and the emitted electron beams. At extremely long density gradients, only with few-optical-cycle driving laser pulses, we measure up to 2.5 MeV electrons accelerated by the laser wake-field formed in the gradient. \n\nWe also measured proton spectra for a wide range of driving pulse durations, from 4 fs up to 1.5 ps, at the steepest plasma density gradient, and find an optimum pulse duration range for proton yield, between 100 fs and 400 fs, under such conditions. These novel measurements of low-divergence (< 4^∘ FWHM) font-side-accelerated proton beams with a controlled density gradient hold intrinsic value of their own. The exceptional beam properties, along with the possibility of scaling with the driving laser energy to multi-MeV proton energy levels <cit.>, are promising for applications in the field of medicine, for example to produce radio-isotopes <cit.>. \n\nTo conclude, this work is a decisive step towards a highly detailed characterization of fundamental PM dynamics and the optimal generation of energetic particle and radiation beams exploiting the high repetition rate of our laser system.\n\nAdditionally, we have also implemented carrier-envelope phase control, with feedback at the full repetition rate of the laser system. This should enable the generation of isolated intense attosecond pulses <cit.> with high conversion efficiencies <cit.>, by controlling the collective plasma dynamics at a the sub-light-cycle level.  \n\n\n\nThis work has been supported by the Agence Nationale pour la Recherche (ANR-14-CE32-0011-03 APERO), the European Research Council (ERC ExCoMet 694596) and the European Union's Horizon 2020 research and innovation program (LASERLAB-Europe under grant agreements 654148 and 871124). \n\n\n\n\n§ DATA AVAILABILITY STATEMENT\n\nThe data that support the findings of this study are available from the corresponding author upon reasonable request.\n\n\n\n\n\n10\n\nDoublePlasmaMirrorDoumy2004\nG. Doumy, F. Quéré, O. Gobert, M. Perdrix, Ph. Martin, P. Audebert, J.C.\n  Gauthier, J.-P. Geindre, and T. Wittmann.\nComplete characterization of a plasma mirror for the production of\n  high-contrast ultraintense laser pulses.\nPhys. Rev. E, 69:026402, Feb 2004.\n\nPlasmaMirrorDromey2004\nB. Dromey, S. Kar, M. Zepf, and P. Foster.\nThe plasma mirror—a subpicosecond optical switch for ultrahigh\n  power lasers.\nRev. Sci. Instrum., 75:645, Feb 2004.\n\nKalashnikov:05\nM. P. Kalashnikov, E. Risse, H. Schönnagel, and W. Sandner.\nDouble chirped-pulse-amplification laser: a way to clean pulses\n  temporally.\nOpt. Lett., 30(8):923–925, Apr 2005.\n\nRelativisticHHGDromey2006\nB. Dromey, M. Zepf, A. Gopal, K. Lancaster, M. S. Wei, K. Krushelnick,\n  M. Tatarakis, N. Vakakis, S. Moustaizis, R. Kodama, M. Tampo, C. Stoeckl,\n  R. Clarke, H. Habara, D. Neely, S. Karsch, and P. Norreys.\nHigh harmonic generation in the relativistic limit.\nNature Physics, 2:456–459, Jan 2006.\n\nRevHHGfromPlasmaMirrors_Thaury2010\nC. Thaury and F. Quéré.\nHigh-order harmonic and attosecond pulse generation on plasma\n  mirrors: basic mechanisms.\nJournal of Physics B: Atomic, Molecular and Optical Physics,\n  43(21):213001, 2010.\n\nAttosecond_Nomura2008\nY. Nomura, R. Horlein, P. Tzallas, B. Dromey, S. Rykovanov, Zs Major,\n  J. Osterhoff, S. Karsch, L. Veisz, M. Zepf, D. Charalambidis, F. Krausz, and\n  G. D. Tsakiris.\nAttosecond phase locking of harmonics emitted from laser-produced\n  plasmas.\nNature Physics, 5:124–128, 2008.\n\nSpatioTemporal_Chopineau2021\nLudovic Chopineau, Adrien Denoeud, Adrien Leblanc, Elkana Porat, Philippe\n  Martin, Henri Vincenti, and Fabien Quéré.\nSpatio-temporal characterization of attosecond pulses from plasma\n  mirrors.\nNature Physics, 17:968–973, June 2021.\n\nCWE_Quere2006\nF. Quéré, C. Thaury, P. Monot, S. Dobosz, Ph. Martin, J.-P. Geindre, and\n  P. Audebert.\nCoherent wake emission of high-order harmonics from overdense\n  plasmas.\nPhysical Review Letters, 96:125004, 2006.\n\nROM_Lichters1996\nR. Lichters, J. Meyer‐ter‐Vehn, and A. Pukhov.\nShort‐pulse laser harmonics from oscillating plasma surfaces driven\n  at relativistic intensity.\nPhysics of Plasmas, 3(9):3425–3437, 1996.\n\nHHGoverDensePlasmas_Baeva2006\nT. Baeva, S. Gordienko, and A. Pukhov.\nTheory of high-order harmonic generation in relativistic laser\n  interaction with overdense plasma.\nPhysical Review E, 74:046404, 2006.\n\nBrunelAbsorption_1987\nF. Brunel.\nNot-so-resonant, resonant absorption.\nPhysical Review Letters, 59:52–55, 1987.\n\nRES_Gonoskov2018\nA. Gonoskov.\nTheory of relativistic radiation reflection from plasmas.\nPhysics of Plasmas, 25(1):013108, 2018.\n\nEnhancedRHHG_Brugge2010\nD. an der Brügge and A. Pukhov.\nEnhanced relativistic harmonics by electron nanobunching.\nPhysics of Plasmas, 17(3):033110, 2010.\n\nCSE_Mikhailova2012\nJ. M. Mikhailova, M. V. Fedorov, N. Karpowicz, P. Gibbon, V. T. Platonenko,\n  A. M. Zheltikov, and F. Krausz.\nIsolated Attosecond Pulses from Laser-Driven Synchrotron\n  Radiation.\nPhysical Review Letters, 109:245005, 2012.\n\nCSE_Dromey2012\nB. Dromey, S. Rykovanov, M. Yeung, R. Hörlein, D. Jung, D. C. Gautier,\n  T. Dzelzainis, D. Kiefer, S. Palaniyppan, R. Shah, J. Schreiber, H. Ruhl,\n  J. C. Fernandez, C. L. S. Lewis, M. Zepf, and B. M. Hegelich.\nCoherent synchrotron emission from electron nanobunches formed in\n  relativistic laser–plasma interactions.\nNature Physics, 8:804–808, 2012.\n\nHHGscalingLaw_Edwards2020\nM. R. Edwards and J. M Mikhailova.\nThe x-ray emission effectiveness of plasma mirrors: Reexamining\n  power-law scaling for relativistic high-order harmonic generation.\nScientific Reports, 10:5154, 2020.\n\nLgEffect_Kahaly2013\nS. Kahaly, S. Monchocé, H. Vincenti, T. Dzelzainis, B. Dromey, M. Zepf, Ph.\n  Martin, and F. Quéré.\nDirect observation of density-gradient effects in harmonic generation\n  from plasma mirrors.\nPhysical Review Letters, 110:175001, 2013.\n\nLWFAfromPM_Zaim2019\nN. Zaïm, F. Böhle, M. Bocoum, A. Vernier, S. Haessler, X. Davoine, L. Videau,\n  J. Faure, and R. Lopez-Martens.\nFew-cycle laser wakefield acceleration on solid targets with\n  controlled plasma scale length.\nPhysics of Plasmas, 26(3):033112, 2019.\n\nVLAfromPlasmaMirrors_Thevenet2016\nM. Thévenet, A Leblanc, S. Kahaly, H. Vincenti, A. Vernier, F. Quéré, and\n  J. Faure.\nVacuum laser acceleration of relativistic electrons using plasma\n  mirror injectors.\nNature Physics, 12:355––360, 2016.\n\nElectronAccFromOverdensePlasmas_Thevenet2016\nM. Thévenet, H. Vincenti, and J. Faure.\nOn the physics of electron ejection from laser-irradiated overdense\n  plasmas.\nPhysics of Plasmas, 23(6):063119, 2016.\n\nIdentCouplingMechnisms_chopineau2019\nL. Chopineau, A. Leblanc, G. Blaclard, A. Denoeud, M. Thévenet, J-L. Vay,\n  G. Bonnaud, Ph. Martin, H. Vincenti, and F. Quéré.\nIdentification of Coupling Mechanisms between Ultraintense\n  Laser Light and Dense Plasmas.\nPhysical Review X, 9(1):011050, 2019.\n\nSHHGelectrons_haessler2022\nStefan Haessler, Marie Ouillé, Jaismeen Kaur, Maïmouna Bocoum, Frederik\n  Böhle, Dan Levy, Louis Daniault, Aline Vernier, Jérôme Faure, and Rodrigo\n  Lopez-Martens.\nHigh-harmonic generation and correlated electron emission from\n  relativistic plasma mirrors at 1 kHz repetition rate.\nUltrafast Science, 2022:9893418, 2022.\n\nHHGelectronsAntiCorr_Bocoum2016\nM. Bocoum, M. Thévenet, F. Böhle, B. Beaurepaire, A. Vernier, A. Jullien,\n  J. Faure, and R. Lopez-Martens.\nAnticorrelated emission of high harmonics and fast electron beams\n  from plasma mirrors.\nPhysical Review Letters, 116:185001, 2016.\n\nProtonsInSolids_Wilkis2001\nS. C. Wilks, A. B. Langdon, T. E. Cowan, M. Roth, M. Singh, S. Hatchett, M. H.\n  Key, D. Pennington, A. MacKinnon, and R. A. Snavely.\nEnergetic proton generation in ultra-intense laser–solid\n  interactions.\nPhysics of Plasmas, 8(2):542–549, 2001.\n\nProtonsFromPetaWattLaser_Snavely2000\nR. A. Snavely, M. H. Key, S. P. Hatchett, T. E. Cowan, M. Roth, T. W. Phillips,\n  M. A. Stoyer, E. A. Henry, T. C. Sangster, M. S. Singh, S. C. Wilks,\n  A. MacKinnon, A. Offenberger, D. M. Pennington, K. Yasuike, A. B. Langdon,\n  B. F. Lasinski, J. Johnson, M. D. Perry, and E. M. Campbell.\nIntense high-energy proton beams from petawatt-laser irradiation of\n  solids.\nPhysical Review Letters, 85:2945–2948, 2000.\n\nLaserIonAccReview_Macchi2013\nA. Macchi, M. Borghesi, and M. Passoni.\nIon acceleration by superintense laser-plasma interaction.\nReviews of Modern Physics, 85:751–793, 2013.\n\nTargetEnggforProtons_Kar2008\nS. Kar, K. Markey, P. T. Simpson, C. Bellei, J. S. Green, S. R. Nagel,\n  S. Kneip, D. C. Carroll, B. Dromey, L. Willingale, E. L. Clark, P. McKenna,\n  Z. Najmudin, K. Krushelnick, P. Norreys, R. J. Clarke, D. Neely, M. Borghesi,\n  and M. Zepf.\nDynamic control of laser-produced proton beams.\nPhysical Review Letters, 100:105004, 2008.\n\nFrontSideProtonAcc_Hou2009\nB. Hou, J. Nees, J. Easter, J. Davis, G. Petrov, A. Thomas, and K. Krushelnick.\nMev proton beams generated by 3 mJ ultrafast laser pulses at 0.5\n  khz.\nApplied Physics Letters, 95(10):101503, 2009.\n\nBrunelProtonAcc_Veltcheva2012\nM. Veltcheva, A. Borot, C. Thaury, A. Malvache, E. Lefebvre, A. Flacco,\n  R. Lopez-Martens, and V. Malka.\nBrunel-Dominated Proton Acceleration with a Few-Cycle Laser Pulse.\nPhysical Review Letters, 108(7):075004, 2012.\n\nCollimatedMeVProtons-Levy2021\nDan Levy, Igor A. Andriyash, Stefan Haessler, Jaismeen Kaur, Marie Ouillé,\n  Alessandro Flacco, Eyal Kroupp, Victor Malka, and Rodrigo Lopez-Martens.\nLow divergence proton beams from a laser-plasma accelerator at kHz\n  repetition rate.\nPhysical Review Accelerators and Beams, 25(9):093402, 2022.\n\nLaserAccIonsAppl_Torrisi2006\nL. Torrisi, A.M. Mezzasalma, S. Gammino, J. Badziak, P. Parys, J. Wolowski,\n  L. Laska, and G. Franco.\nIon implantation induced by cu ablation at high laser fluence.\nApplied Surface Science, 252(24):8533–8538, 2006.\n\nProtonsForMedIsotope_Fritzler2003\nS. Fritzler, V. Malka, G. Grillon, J. P. Rousseau, F. Burgy, E. Lefebvre,\n  E. d’Humières, P. McKenna, and K. W. D. Ledingham.\nProton beams generated with high-intensity lasers: Applications to\n  medical isotope production.\nApplied Physics Letters, 83(15):3039–3041, 2003.\n\nSubLaserCycle_chopineau2022\nL. Chopineau, G. Blaclard, A. Denoeud, H. Vincenti, F. Quéré, and\n  S. Haessler.\nSub-laser-cycle control of relativistic plasma mirrors.\nPhysical Review Research, 4(1):L012030, 2022.\n\nSN2Laser_ouille2019\nM. Ouillé, A. Vernier, F. Böhle, M. Bocoum, A. Jullien, M. Lozano,\n  JP Rousseau, Z. Cheng, D. Gustas, A. Blumenstein, P. Simon, S. Haessler,\n  J. Faure, T. Nagy, and R. Lopez-Martens.\nRelativistic-intensity near-single-cycle light waveforms at kHz\n  repetition rate.\nLight Science & Applications, 9(1):2047–7538, 2020.\n\nSDI_Bocoum2015\nM. Bocoum, F. Böhle, A. Vernier, A. Jullien, J. Faure, and\n  R. Lopez-Martens.\nSpatial-domain interferometer for measuring plasma mirror expansion.\nOptics Letters, 40(13):3009–3012, 2015.\n\nSolidTarget_Borot2014\nA. Borot, D. Douillet, G. Iaquaniello, T. Lefrou, P. Audebert, J.-P. Geindre,\n  and R. Lopez-Martens.\nHigh repetition rate plasma mirror device for attosecond science.\nReview of Scientific Instruments, 85(1):013104, 2014.\n\nElectronSpectrometer_Glinec2006\nY. Glinec, J. Faure, A. Guemnie-Tafo, V. Malka, H. Monard, J. P. Larbre,\n  V. De Waele, J. L. Marignier, and M. Mostafavi.\nAbsolute calibration for a broad range single shot electron\n  spectrometer.\nReview of Scientific Instruments, 77(10):103301, 2006.\n\nzepf_role_1998\nM. Zepf, G. D. Tsakiris, G. Pretzler, I. Watts, D. M. Chambers, P. A. Norreys,\n  U. Andiel, A. E. Dangor, K. Eidmann, C. Gahn, A. Machacek, J. S. Wark, and\n  K. Witte.\nRole of the plasma scale length in the harmonic generation from solid\n  targets.\nPhysical Review E, 58:R5253, 1998.\n\nRoedel2012ultrasteep\nC. Rödel, an der Brügge, J. Bierbach, M. Yeung, T. Hahn, B. Dromey,\n  S. Herzer, S. Fuchs, A. Galestian Pour, E. Eckner, M. Behmke, M. Cerchez,\n  O. Jäckel, D. Hemmers, T. Toncian, M. C. Kaluza, A. Belyanin,\n  G. Pretzler, O. Willi, A. Pukhov, M. Zepf, and G. G. Paulus.\nHarmonic generation from relativistic plasma surfaces in ultrasteep\n  plasma density gradients.\nPhys. Rev. Lett., 109:125002, 2012.\n\ndelone_tunneling_1998\nN. B. Delone and Vladimir P. Krainov.\nTunneling and barrier-suppression ionization of atoms and ions in a\n  laser radiation field.\nPhysics-Uspekhi, 41(5):469, 1998.\n\nbauer_ejection_1997\nD. Bauer.\nEjection energy of photoelectrons in strong-field ionization.\nPhysical Review A, 55(3):2180–2185, 1997.\n\nmora_plasma_2003\nP. Mora.\nPlasma expansion into a vacuum.\nPhysical Review Letters, 90(18):185002, 2003.\n\nHHGphaseProperties_Quere2008\nF. Quéré, C. Thaury, J-P. Geindre, G. Bonnaud, P. Monot, and Ph. Martin.\nPhase properties of laser high-order harmonics generated on plasma\n  mirrors.\nPhys. Rev. Lett., 100:095004, Mar 2008.\n\nIAPfromPM_Boehle2020\nF. Böhle, M. Thévenet, M. Bocoum, A. Vernier, S. Haessler, and\n  R. Lopez-Martens.\nGeneration of XUV spectral continua from relativistic plasma\n  mirrors driven in the near-single-cycle limit.\nJournal of Physics: Photonics, 2(3):034010, 2020.\n\nIIAP_Jahn2019\nO. Jahn, V. E. Leshchenko, P. Tzallas, A. Kessel, M. Krüger, A. Münzer,\n  S. A. Trushin, G. D. Tsakiris, S. Kahaly, D. Kormin, L. Veisz, V. Pervak,\n  F. Krausz, Z. Major, and S. Karsch.\nTowards intense isolated attosecond pulses from relativistic surface\n  high harmonics.\nOptica, 6(3):280–287, 2019.\n\n\n\n"}