{"entry_id": "http://arxiv.org/abs/2303.07168v2", "published": "20230313151105", "title": "Hybrid Kinetic/Fluid numerical method for the Vlasov-Poisson-BGK equation in the diffusive scaling", "authors": ["Tino Laidin", "Thomas Rey"], "primary_category": "math.NA", "categories": ["math.NA", "cs.NA"], "text": "\n\n\n\nHybrid Kinetic/Fluid numerical method\n\n\n\n\n\nUniv. Lille, CNRS, Inria, UMR 8524 - Laboratoire Paul Painlevé, F-59000 Lille, France\n\n\nHybrid Kinetic/Fluid numerical method for the Vlasov-Poisson-BGK equation in the diffusive scaling\n    Tino Laidin 1 Thomas Rey1\n    March 30, 2023\n==================================================================================================\n\n\n\n\n  This short note presents an extension of the hybrid, model-adaptation method introduced in [T. Laidin, arXiv 2202.03696, 2022] for linear collisional kinetic equations in a diffusive scaling to the nonlinear mean-field Vlasov-Poisson-BGK model. The aim of the approach is to reduce the computational cost by taking advantage of the lower dimensionality of the asymptotic model while reducing the overall error. It relies on two criteria motivated by a perturbative approach to obtain a dynamic domain adaptation. The performance of the method and the conservation of mass are illustrated through numerical examples.\n\n\n\n\n\n\n\n§ THE MODEL\n\nIn this work, we are interested in the kinetic description of a system of particles interacting via both mean-field electromagnetic interaction and  collisions. Such system can be modeled using the Vlasov-Poisson-BGK equation. The unknown is the probability distribution function f=f(t,x,v)∈^+ solution to:\n\n    {   ∂/∂ t f^ + v_x/ε  f^ + E^/ε ∂_v_xf^=1/ε^2𝒬(f^),\n       f(0,x,v)=f_0(x,v),\n        .\n\nwhere (t,x,v)∈^+×[0, x_*]×^d_v with periodic boundary conditions in the physical space and v = (v_x, v_y, v_z). The long range interactions are modeled via the self-consistent electrical field E=E(t,x) solution to the Poisson equation\n\n    E^=ρ^-ρ  with  ρ=∬ f_0  x v.\n\nThe short-range interactions between particles are taken into account through the linear BGK-like relaxation collision operator\n\n    𝒬(f^ε)(t,x,v)=ρ^(t,x)(v)-f^ε(t,x,v),   ∀ (t,x,v)∈^+×[0, x_*]×^d_v,\n\nwhere the global Maxwellian and local density  are respectively defined as\n\n    (v)=e^-|v|^2/2/(2π)^d_v/2,   ρ^ε(t,x)=∫ f^ε(t,x,v) v =: ⟨ f^(t,x,·)⟩.\n\nIn (<ref>), the scaling parameter ε is related to the Knudsen number: the ratio between the mean free path of the particles and the length scale of observation. It is now well known <cit.> that the limit case ε=0 is described by a drift-diffusion equation on the density ρ: when → 0, the distribution function f^ converges towards a Maxwellian distribution ρ whose density ρ is solution to \n\n    P{   ρ - J = 0,   J=ρ - Eρ,\n       ρ(0,x)=ρ_0(x),   ∀ x ∈ [0, x_*].\n        .\n\nThe approximation of solutions to (<ref>)-(<ref>) can be computationally expensive because of the high dimensionality of the kinetic phase space. Nevertheless, using the more accurate kinetic description of the system may not be necessary in the whole computing domain because of the local validity of the fluid description (the system being in a state of thermodynamic equilibrium). This latter is less accurate in describing the kinetic zones, but computationally  less costly. The aim of this work is therefore to design a hybrid kinetic/fluid scheme with an automatic domain adaptation method. It relies on a robust numerical scheme for the kinetic equation, on relevant criteria to carefully determine fluid and kinetic regions and on a smart implementation.\n\n\n\n§ MACROSCOPIC MODELS\n\nThe aim of this section is to derive a higher-order macroscopic model from which we deduce a macroscopic coupling criterion. It generalizes the approach presented in <cit.>.\nLet us now introduce the truncated Chapman-Enskog expansion of the distribution function f^ε at order K∈^*: \n\n    f^ε(t,x,v)=ρ^ε(t,x)(v) + ∑^K_k=1ε^k h^(k)(t,x,v).\n\nBy inserting (<ref>) into the original equation (<ref>), one can identify powers of epsilon to obtain \n\n\nk=0:        h^(1) =    -(ρ^ε),\n\nk=1:        h^(2) =    -(ρ^ε) -(h^(1)),\n\n2≤k≤K-1:        h^(k+1) =    -h^(k-1) - (h^(k)),\n\n\nwhere 𝒯f=v_x  ∂_xf+E  ∂_v_x f is the transport operator. \nTo obtain a hierarchy of macroscopic models, one considers different truncation orders K, then plugs (<ref>) into (<ref>) and integrates in velocity. The order K=1 allows us to (formally) recover the asymptotic model (<ref>). \n\nLet us now present the idea behind the computations in a 1D/1D setting for the case K=3. Note that the same method can be applied up to the full 3D/3D setting. Integrating in velocity then yields\n\n    ρ^+⟨ vh^(1)⟩+ε^2⟨ vh^(3)⟩=4.\n\n The set of equations (<ref>) allows us to compute the functions h^(k), k=1,2,3. Using the identity =-v, one has\n\n    h^(1)=-v J^ε,   J^= ρ^-E^ρ^.\n\n\n    h^(2)=-ρ^ε+v^2 J^ε+(1-v^2) E^ε J^ε,\n\nand\n\n    h^(3)=   v J^ε+v(ρ^ε)-v^3 J^ε-(v-v^3)(E^ε J)\n       -v E^ερ^ε -(2v-v^3) E^ε J^ε -(v^3-3v)(E^ε)^2J^ε.\n\nIt remains to compute the quantities ⟨ vh^(1)⟩ and ⟨ vh^(3)⟩. By the definition of , one can explicitly compute its second and fourth moments: m_2=1 and m_4=3. It yields\n\n    ⟨ vh^(1)⟩= J^ε.\n\nMoreover, to avoid some approximation of mixed derivatives, we observe from (<ref>) that \n\n    ρ^= J^ + 2,\n\nand we deduce that\n\n    J^= J^-E^ J^-ρ^ E^+2.\n\nReplacing the time derivatives by their approximations (<ref>) and (<ref>) yields\n\n    ⟨ vh^(3)⟩=   - J^ε+ρ^ε E^ε-ρ^ε( E^ε)+3 E^ε J^ε\n       +E^ε J^ε+2J^ε( E)+2.\n\nFinally, using the Poisson equation (<ref>) and rearranging the terms, we obtain a higher order macroscopic model:\n\n    ρ^ε- J^ε=-ε^2ℛ+4,\n\nwhere the remainder ℛ^ε is given by\n\n    ℛ^ε=- J^ε + E J^ε + (2ρ^ε-3ρ) J^ε +2J^ερ^ε -ρ^ε E^ε.\n\nFurthermore, we emphasize the fact that this remainder term does not depend on the velocity variable but on the macroscopic quantities ρ and E. It quantifies very accurately the deviation from the thermodynamical equilibrium.\n\n\n\n\n§ NUMERICAL SCHEME\n\nIn this part, we briefly recall the derivation of the micro-macro model for (<ref>) introduced in <cit.>. Then, we present a micro-macro finite volume scheme that enjoys the property of being Asymptotic Preserving (AP), which is a crucial point of the hybrid method we present. \n\nLet us decompose the distribution f^ε as follows:\n\n    f^ε = ρ^ε+g^ε.\n\nWe introduce the orthogonal projector Π in L^2( x v^-1) on Ker(𝒬) defined for all f∈ L^2( x v^-1) by: \n    Π f=⟨ f⟩.\n\nThe so-called micro equation is obtained by plugging (<ref>) into (<ref>) and applying (I-Π). Moreover, plugging (<ref>) into (<ref>) and applying the projection Π yields the macro equation. The micro-macro model is then given by:\n\n    Micro g^ε+1/ε( g^ε - ⟨ v_xg^ε⟩ + v_x J^ε) =-1/ε^2g^ε, \n    Macroρ^ε+1/ε⟨ v_xg^ε⟩=0.\n\n\nLet us now present the discretization of the (<ref>)-(<ref>) model. We shall adopt a finite volume approach to discretize the phase space and present only the 1D/3D case that we shall consider in our numerical simulations.\n\n\n\n\n\n\n\n\n\n\n  \nThe mesh. The velocity domain is restricted to the bounded symmetric cube [-v_⋆,v_⋆]^3. We consider a Cartesian mesh of the phase space composed of N_v=2L velocity cells in each direction arranged symmetrically around v=0. Let 𝒥={ -L+1,…,L } and  j=(j_x,j_y,j_z)∈𝒥^3 be a multi-index. The cells of the velocity mesh are denoted by 𝒱_j for j∈𝒥^3. Each cell 𝒱_j has a constant volume Δ v^3 and midpoint v_j.\n\nThe physical domain, a torus 𝕋 of length x_*, is discretized into N_x primal cells \n    𝒳_i=(x_,x_),    i∈ℐ=ℤ/N_xℤ,\n of constant length Δ x and centers x_i. We also define dual cells 𝒳_=(x_i,x_i+1) for i∈ℐ, of constant length Δ x and centers x_. This defines respectively the so-called primal and staggered meshes as\n\n    K_ij= 𝒳_i×𝒱_j and K_,j= 𝒳_×𝒱_j,  ∀(i,j)∈ℐ×𝒥^3.\n\nFinally, we set a time step Δ t>0 and define t^n=nΔ t for n∈ℕ.\nThe Maxwellian is discretized as a product of 1-dimensional Gaussians in such a way that it satisfies discrete counterparts of its continuous properties, namely parity, positivity, and unit mass.\n\nThe transport terms in (<ref>) are approximated using a first order upwind scheme and the time derivative is dealt with using a first order exponential time integrator. Regarding the macro equation, we take advantage of approximating the perturbation on the dual cells in position for the space derivative. The usual choice <cit.> to obtain an AP scheme is to implicit the stiff term of (<ref>). The equation on the electrical field is solved using a centered finite difference scheme. The numerical scheme reads as follows:\n\n    Let n∈ℕ. Let (g_,j^ε,n)_ij and (ρ^ε,n_i)_i be given by the following micro-macro finite volume scheme:\n    \n    g_,j^ε,n+1 = g_,j^ε,ne^-Δ t/ ε^2 - ε(1-e^-Δ t/ ε^2)(T^ε,n_,j/Δ xΔ v^3+ξ_j_jJ^ε,n_), \n    ρ_i^ε,n+1 = ρ_i^ε,n - Δ t/εΔ x(⟨ξ g^ε,n+1_⟩_Δ-⟨ξ g^ε,n+1_⟩_Δ),\n    \n            E^,n_-E^,n_ = (ρ_i^,n-ρ)Δ x,\n\n    where ξ_j=ξ_(j_x,j_y,j_z)=v_j_x ∀ j∈𝒥^3 and T^ε,n_,j is the discretization of the transport terms.\n    Assuming some uniform bounds in ε on ρ^ε and for a fixed mesh size Δ x, Δ v>0, the scheme enjoys the AP property in the diffusion limit. This property does not depend on the initial data, and the associated limit scheme reads\n    \n    ρ_i^n+1 = ρ_i^n +  m_2^Δ vΔ t/Δ x(J_^n-J_^n),\n    \n            E^n_-E^n_ = (ρ_i^n-ρ)Δ x,\n\n    with the limit flux\n    \n    J_^n = ρ^n_i+1-ρ^n_i/Δ x - E_ρ^n_,\n\n    where m_2^Δ v is given by ∑_l∈𝒥v_l^2M_lΔ v_l.\n\n\n\n\n\n§ HYBRID METHOD\n\nLet us now introduce the main contribution of this work, namely the hybrid method between kinetic and fluid schemes. It consists in a coupled solver that is faster than a full kinetic one to solve (<ref>) while still being accurate. \nFollowing <cit.> we first construct a hybrid kinetic/fluid solver with a dynamic domain adaptation method and present its implementation.\n\n\n\n §.§ Coupling criteria\n\nThe idea of the dynamic domain adaptation method is twofold. On the one hand, the subdomains must accurately describe the state of the solution. In particular, the fluid model has to be used only where the solution is near the local velocity equilibrium. On the other hand, the method has to be dynamic, in the sense that the subdomains are adapted at each time step. To determine in which domain each cell lies, we use two criteria based on the higher order macroscopic model (<ref>) introduced in Section <ref> and the norm of the perturbation g^ε=f^ε-ρ^ε. Let ℛ_i^ε,n be a discretization of the remainder (<ref>) at time t^n in cell 𝒳_i. \n\nThe coupling procedure will unfold as follows: ℛ_i^ε,n is computed using both the kinetic density ρ^ε in kinetic cells and the fluid density ρ in fluid cells. Cell changes happen when one of the following situations occurs, depending on a coupling threshold investigated in the previous work <cit.>:\n\n    \n  * If ℛ_i^ε,n is small (w.r.t. a fixed threshold), the solution (<ref>) is close to the limit model (<ref>) and one must use it;\n    \n  * If g^ε is small (w.r.t. another fixed threshold), the solution is close to the local equilibrium in velocity, and one must consider the fluid description.\n\n\n\nIf any of those two conditions are not met then, depending on its current state, the cell either stays or becomes kinetic.\n\n\nNote that in a kinetic cell, the criterion on the norm of g^ε is mandatory. Indeed, the remainder ℛ^ε,n_i could be small because of small gradients, but the perturbation large. In this situation, one does not want to change from kinetic to fluid. As an example, one could take a distribution function at equilibrium in position and far from the Maxwellian in velocity (see <cit.> for details).\n\n\n\n\n §.§ Implementation\n\nThe way the method is implemented is crucial. Indeed, the main goal of the method is to avoid the update of the perturbation which is the most computationally expensive part of the code. Therefore, from an implementation point of view, g^ε is not updated in fluid regions and is set to 0 only when needed. In particular, it occurs only when a fluid cell becomes kinetic and when saving data. The interface conditions between kinetic and fluid cells are treated in the same way as in <cit.>.\n\n\n    Note that we want to start the resolution with the approach containing the full information on the system. Hence, the domain is initialized as fully kinetic. \n    Moreover, let us emphasize that in practice the kinetic fluxes are explicitly computed. Therefore, the hybrid setting is an explicit method.\n\n\n\n\n\n§ NUMERICAL RESULTS\n\n\nLet us now present some numerical simulations with our approach. \n\nWe shall start with the validation of the AP property of the micro-macro Vlasov-Poisson-BGK solver with exponential integrator presented in Section <ref>. It is a combination of the methods presented in <cit.> that have never been implemented in any work, to the best of our knowledge.\nFigure <ref> presents the time evolution of the L^2 norm of the energy of solutions to equations (<ref>–<ref>) with different values of the relaxation parameter , for the seminal weak Landau damping initial data from <cit.>.\nWe observe the convergence with respect to  of the energy. The oscillations due to the Vlasov-Poisson transport term  occur only in the kinetic regime, when  is large. They are then damped by the linear BGK term for smaller values of , where exponential decay of the electric field occurs.\n\n\n\nWe now turn our attention to the hybrid method. Figure <ref> assesses the validity of this new method by computing the time evolution of the density of a smooth solution. The initial condition is a Maxwellian distribution ρ, whose initial space dependent density is given by ρ(x) = 1 + 0.05cos(2x) for x_* = 2π with a fixed = 0.1. \nAlthough the solution is far from the fluid description because of this mild value of , we observe an almost perfect agreement between the fully kinetic and the hybrid kinetic-fluid solvers.\nWe also observe the back-and-forth phenomenon between kinetic and fluid cells, resulting in large time in a full fluid (albeit accurate with the kinetic equation) solver for the global equilibrium. \nThe speed-up tables are similar to those presented in <cit.>, where factors up to 400 have been observed between the hybrid and the fully kinetic solver.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThen this domain adaptation is investigated in Figure <ref>. One can observe the precise domain adaptation during time. We notice in particular the quick vanishing of the kinetic cells in favor of the fluid ones (and hence a computational speedup). This adaptation phenomenon can bring mass variation as noticed in <cit.>, but we observe that it remains very close to the machine precision.\n\n\n\nFinally, we investigate again the case of the weak Landau damping using the new hybrid solver. We observe in Figure <ref> that this new method is able to accurately capture the oscillations induced by the transport operator  in short time. Nevertheless, these oscillations are destroyed by the switch to a full fluid solver, which relax exponentially because of its relaxation structure.\n\n\n\n\nAcknowledgements. \nThe authors were partially funded by Labex CEMPI (ANR-11-LABX-0007-01) and the MSCA DN-2022 program DATAHYKING. \n\n\n\n\n\n\n\nspmpsci\n\n"}