{"entry_id": "http://arxiv.org/abs/2303.07373v1", "published": "20230313180007", "title": "Hochschild cohomology of differential operators in positive characteristic", "authors": ["Joshua Mundinger"], "primary_category": "math.AG", "categories": ["math.AG", "math.RA", "math.RT", "14F10 (Primary) 16E40, 14G17 (Secondary)"], "text": "\n\n\n    For k a field of positive characteristic and X a smooth variety over k, we compute the Hochschild cohomology of Grothendieck's differential operators on X. The answer involves the derived inverse limit of the Frobenius acting on the cohomology of the structure sheaf of X.\n\n\nHigher-Order Methods for Hamiltonian Engineering Pulse Sequence Design\n    Mikhail D. Lukin^1\n    March 30, 2023\n======================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nAlgebras of polynomial differential operators are objects used throughout mathematics, sitting at the interface of analysis, geometry, topology, and algebra. \nOver a field of characteristic zero,\nthe algebra of differential operators _X on a variety X consists of operators locally of the form \n∑_I f_I ∂^i_1/∂^i_1 x_1⋯∂^i_n/∂^i_n x_n\nwhere x_1,…, x_n are local coordinates and f_I are regular functions on X.\n\n\nOne can also consider differential operators over a field of positive characteristic; then the definition must be modified to account for the identity (d/dx)^px^n = 0 in characteristic p. In this paper, we study differential operators with divided powers, formulated by Grothendieck in connection with crystalline cohomology. This algebra includes operators such as (p!)^-1(d/dx)^p. Precise definitions are given in §<ref> below. \n\nHochschild cohomology is a fundamental invariant of associative algebra A. As a ring, the Hochschild cohomology HH^*(A) coincides with self-extensions of the A-bimodule A. Gerstenhaber showed that the bar complex of the A-bimodule A controls deformations of the product on A <cit.>. Since then, Hochschild cohomology has attracted considerable interest due to its connection to deformations.\n\nIn this note, we prove:\n\n[see Theorem <ref>]\n    Let k be a field of postitive characteristic, X a smooth variety over k, \n    and _X the ring of differential operators on X.\n    Then there are short exact sequences \n    \n    0 → R^1_r H^m-1(X,_X)^(r)→ HH^m(_X) →_r H^m(X,_X)^(r)→ 0\n\n    for all m ≥ 0, where the inverse limit is taken over the sequence of relative Frobenius maps Fr: H^∗(X,_X)^(r+1)→ H^∗(X,_X)^(r).\n\n\nWe also consider the cup product structure on HH^*(_X) in §<ref>. There it is shown that the map HH^*(_X) →_r H^m(X,_X^(r)) is a map of graded rings.\n\nOver the field ℂ of complex numbers, it follows from work of Wodzicki that HH^*(_X) ≅ H^∗_dR(X/ℂ) for smooth affine X <cit.>. In fact, in loc cit. Wodzicki calculates the Hochschild homology as HH_*(_X/ℂ) ≅ H_dR^2 X - ∗(X/ℂ), reflecting that _X/ℂ is a Calabi-Yau algebra of dimension 2  X. One year later, Wodzicki calculated the Hochschild homology of _X for X smooth affine over k of positive characteristic <cit.>. He showed that HH_*(_X) is concentrated in degree n =  X and HH_n(_X) = Ω^n_X / B_∞Ω^n_X, where B_∞Ω^n_X are the potentially exact forms. Unlike in characteristic zero, Wodzicki's method does not apply to Hochschild cohomology. Our results show _X over a field of positive characteristic is not Calabi-Yau, as for affine X, HH^*(_X) will have amplitude exactly [0,1].\n\nIf X is not affine, then _X is not an associative algebra but rather a sheaf of such; this makes defining an appropriate category of bimodules more difficult. Hochschild cohomology of ringed spaces and, more generally, abelian categories has been developed by Lowen and Van den Bergh <cit.>, following earlier work by Gerstenhaber and Schack on cohomology of diagrams of associative algebras <cit.>. Lowen and Van den Bergh showed that if Å is a sheaf of algebras on X which is locally acyclic with respect to a basis ℬ, then the Gerstenhaber-Schack cohomology of the diagram Å_ℬ coincides with Hochschild cohomology of the category of Å-modules <cit.>. This paper uses Gerstenhaber and Schack's definition of Hochschild cohomology of a diagram (see §<ref>); as _X is quasi-coherent, our computation thus agrees with categorical Hochschild cohomology.\n\nWe should point out that Ogus obtains very similar formulas for ^*__X(_X,_X) in <cit.>. The relationship is explained in Remark <ref>. \n\n\n\nAcknowledgments.\n\n    The author was supported by NSF Graduate Research Fellowship DGE 1746045. \n    The author thanks Luc Illusie for pointing out the paper <cit.> and Tim Porter for the reference <cit.>.\n\n\n\n\n§ PRELIMINARIES\n\n\n\n\n §.§ Differential operators\n\n\n\nLet k be a field.\nA smooth variety X over k will mean a morphism of schemes X → k which is smooth, separated, and of finite type. We recall Grothendieck's definition of differential operators on a smooth variety, following <cit.>.\n\n\n    <cit.>\n    For a smooth variety X over k, let I be the ideal of the diagonal in X ×_k X, that is, I = ⟨ f ⊗ 1 - 1 ⊗ f ⟩⊆_X ⊗_k _X.\n    A k-linear map of sheaves h : _X →_X is a differential operator of order m if and only if the linearization h: _X ⊗_k _X →_X is annihilated by I^m+1.\n\nA map h is a differential operator of order m if and only if for all local sections f_0,f_1,…, f_m of _X, we have [f_0,[f_1,[…,[f_m,h]]]] = 0.\nA degree zero differential operator is _X-linear and thus is a section of _X.\nDifferential operators form a filtered sheaf of rings _X with a map _X →_X from the inclusion of degree zero differential operators.\nAs a left or right _X-module, the sheaf _X is quasi-coherent.\n\nThe sheaf _X contains differential operators “with divided powers.” For example, if ∂ = d/dt is the usual derivative acting on k[t], the operator ∂^q is divisible by q!, as ∂^q t^n = q! nqt^n-q. Thus 1/q!∂^q: t^n ↦nqt^n-q makes sense, regardless of the characteristic of k.\nThe following proposition states that _X locally has a basis of such operators:\n\n<cit.> \n    Suppose X is a smooth variety and {x_1,…, x_n}⊆Γ(X,_X) such that {dx_1,…, dx_n} is a basis for Ω^1_X. Then as either a left or a right _X-module,\n    _X has a basis of the form \n    \n    {∂_1^(q_1)∂_2^(q_2)⋯∂_n^(q_n)| q_1,q_2,…, q_n ≥ 0}\n\n    where ∂_i^(q_i) are differential operators such that\n    \n        \n  * ∂_i^(0) = 1 for all i;\n        \n  * the operators {∂_i^(1) = ∂_i}_i=1^n are derivations dual to the 1-forms {dx_i};\n        \n  * ∂_i^(q)∂_i^(q') = q+q'q∂_i^(q+q') for all i and q,q' ≥ 0;\n        \n  * the following commutator relations hold:\n        \n    [∂_i^(q_i), ∂_j^(q_j)]    = 0,   [∂_i^(q_i),x_j]    = \n                    0     i ≠ j\n    ∂_i^(q_i - 1)    i = j .\n\n    \n\nWe should think of ∂_i^(q) as 1/q!(d/dx_i)^q, and indeed the commutator relations imply ∂_i^(q)(x_i^n) = nqx_i^n-q.\n\n\n\n §.§ Frobenius twists and matrix subalgebras\n\n\n\nIn this section, assume that k has characteristic p > 0. \n\nConsider the setting of Proposition <ref>. The derivations {∂_i}_i=1^n do not generate the algebra _X over _X. Instead, they generate an associative algebra of finite type over _X, centralizing the pth power of any element of _X.  \nTo deal with rings of pth powers, we use the standard language of Frobenius twists.\nFor any scheme S of characteristic p, let F_S: S → S be the absolute Frobenius morphism on S, which is the identity on |S| and acts on functions by f ↦ f^p.\n\n\n    The Frobenius twist X^(1) of X→ k is the base change X ×_ k ( k, F_ k) of X along the absolute Frobenius of k.\n\nThe Frobenius twist fits into a diagram \n\n    X [rd] [r, \"Fr_X/k\"]     X^(1)[r] [d]     X [d] \n        k [r, \"F_ k\"]               k\n\n\n\n\n\n\nwhere the composition X → X^(1)→ X is the absolute Frobenius F_X of X.\nThe induced map Fr_X/k: X → X^(1) over k is called the relative Frobenius.\nWhen there is no risk of confusion, we will write Fr instead of Fr_X/k.\nIf X is a smooth variety over k, then Fr is a homeomorphism and the induced map Fr: _X^(1)→ Fr_∗_X is an inclusion making Fr_∗_X a finite free _X^(1)-module of rank p^ X <cit.>.\nWe may identify the image of _X^(1) in _X with the Frobenius twist _X^(1) of the sheaf _X.\nWe will also write Fr^r: X → X^(r) to mean the r-fold composition of relative Frobenius maps X → X^(1)→⋯→ X^(r).\n\n\n    The subalgebra ^r_X is the centralizer of _X^(r) in _X.\n\n\n <cit.>\n    \n    If X is a smooth variety over k,\n    then the action of _X on _X induces an isomorphism ^r_X →_X^(r)(Fr^r_∗_X)\n    and _X = ⋃_r≥ 0^r_X.\n\n\n    The map _X^r→_X^(r)(Fr^r_∗_X) is injective.\n    For r ≥ 1, \n    Let I^(r) = ⟨ f^p^r⊗ 1 - 1 ⊗ f^p^r⟩⊆_X ⊗_k _X.\n    Since X is of finite type, the chains of ideals I ⊇ I^2 ⊇⋯ and I ⊇ I^(1)⊇ I^(2)⊇⋯ are cofinal.\n    Hence every _X^(r)-linear map of Fr^r_∗_X is a differential operator,\n    so ^r_X→_X^(r)(Fr^r_∗_X) is surjective.\n    Cofinality also implies every differential operator is linear over some _X^(r), so _X = ⋃_r≥ 0^r_X.\n\n\n\n\n\n\n\n\n    The subalgebras ^r_X are Morita equivalent to _X^(r), realizing Katz's equivalence of _X-modules with stratified sheaves on X <cit.>.\n\n\n\n\n§ THE GERSTENHABER-SCHACK COMPLEX\n\n\n\nLet k be any field. We now describe the Gerstenhaber-Schack complex for computing Hochschild cohomology <cit.>.\nThe construction begins with a poset J, a presheaf of k-algebras Å on J, and a presheaf of Å-bimodules .\nLet N(J) be the nerve of the poset J in the sense of category theory: it is the simplicial complex with p-simplices the chains σ = (U_0 < ⋯ < U_i) for U_0,…,U_i ∈ J. Any such simplex σ has a maximal element maxσ = U_i and a minimal element minσ = U_0. Then the Gerstenhaber-Schack complex is the double complex \nwith cochains \n\n    C^i,j(Å, ) = ∏_σ∈ N(J)^i C^j(Å(maxσ), (minσ)),\n\nwhere C^∗(-,-)=_k(-^⊗∗,-) are the usual Hochschild cochains.\nThe horizontal differential is the differential on simplicial cochains on N(J) with respect to the system of local coefficients σ↦ C^j(Å(maxσ),(minσ)).\nThe vertical differential is the Hochschild differential. Then Hochschild cohomology of (Å,) is defined by\n\n    HH^*(Å,) = H^*( C^∗,∗).\n\nIn case J is a single point, the Gerstenhaber-Schack complex coincides with the usual Hochschild complex of an associative algebra.\n\nWe now consider the standard filtration F^ℓ C^i,j = 0 if i< ℓ and F^ℓ C^i,j = C^i,j if i ≥ℓ.\nThe associated spectral sequence yields:\n\n    Let J be a poset, Å a presheaf of associative k-algebras on J, and  a presheaf of Å-bimodules.\n    Consider the local system on N(J) with coefficients \n    \n    HH^j(Å,)(σ) = HH^j(Å(maxσ),(minσ)).\n\n    There is first-quadrant spectral sequence with E_2-page\n    \n    E_2^i,j = H^i(N(J), HH^j(Å,))\n\n    converging to HH^i+j(Å,).\n\n\nIn our situation, the algebra _X is the union of subalgebras ^r_X. The following Lemma relates Hochschild cohomology of ^r_X and _X.\n\n\n    Let J be a poset,\n    Å a presheaf of associative k-algebras on J with a complete filtration by subalgebras Å^0⊆Å^1⊆⋯⊆Å. Then for any presheaf of Å-bimodules , there are short exact sequences \n    \n    0 → R^1 _r HH^m-1(Å^r,) → HH^m(Å,) →_r HH^m(Å,) → 0\n\n    for all m ≥ 0.\n\n\n    Fix an i-simplex σ∈ N(J),\n    and let U_0 = minσ, U_i = maxσ.\n    Then we have Å(U_i) = ∪_r Å^r(U_i).\n    Since k is a field, the maps \n    \n    _k(Å(U_i)^⊗ j, (U_0)) \n           →_k(Å^r+1(U_i)^⊗ j,(U_0))\n           →_k(Å^r(U_i)^⊗ j,(U_0))\n\n    are surjective for all j ≥ 0.\n    Hence, the sequence of complexes C^i,j(Å^r,) satisfies the Mittag-Leffler condition on cochains and \n    \n    C^i,j(Å,) = _r C^i,j(Å^r,).\n Now the Proposition follows from <cit.>.\n\n\n\n\n§ HOCHSCHILD COHOMOLOGY OF DIFFERENTIAL OPERATORS\n\n\nFor the rest of the paper, the field k is of characteristic p > 0 and X is a smooth variety over k. As X is separated, the intersection of two affine opens is an affine open. \nHence there exists a covering of X by nonempty open affines closed under finite intersections; let 𝔘 be such a covering.\nWe will compute the cohomology of the Gerstenhaber-Schack complex for _X with respect to the poset 𝔘. \nHere is a sketch of the argument: we will first compute HH^*(^r_X,_X) locally, then apply the spectral sequence of Proposition <ref> to compute HH^*(^r_X,_X).\nFinally, Lemma <ref> will relate HH^*(^r_X,_X) with HH^*(_X).\n\nGiven affine U, let (U) = Γ(U,_U), and similarly for ^r, , etc..\n\n\n    Let V ⊆ U be smooth affine varieties over k. Then \n    the inclusion (V^(r)) →(V) induces \n    \n    HH^0(^r(U), (V)) ≅(V^(r))\n\n    and HH^m(^r(U), (V)) = 0 for all m > 0.\n\n\n    By Propsition <ref>, \n    the algebra ^r(U) is the matrix ring _(U^(r))((U)).\n    It is well-known that Hochschild cohomology is Morita-invariant.\n    Under the Morita equivalence ^r(U)≃(U^(r)), the ^r(U)-bimodule (V) is sent exactly to (V^(r)).\n    This is seen as follows: for affine U, the inclusion (U^(r)) →(U) is split as (U^(r))-modules <cit.>.\n    If e ∈^r(U) is the idempotent corresponding to the splitting, then it is easily checked that the map e(V)e →_k((V^(r))) induces an isomorphism e (V)e ≅(V^(r)).\n\n    Thus, it suffices to show the claim when r=0,\n    that is, to compute Hochschild cohomology of ((U),(V)). The claim is local, so we may assume that U has local coordinates x_1,…, x_n such that {x_i ⊗ 1 - 1 ⊗ x_i} generate the ideal of the diagonal in U × U. \n    Let P_∗→(U) be the Koszul complex for (U) as an (U)-bimodule corresponding to the regular sequence x_1,…, x_n. Then HH^∗((U),(V)) is computed by the complex _(U)⊗(U)(P_∗, (V)).   \n    Using the basis of Proposition <ref>, the complex above is the tensor product over (V) of the two-term complexes \n    \n    (V) ⟨∂_i⟩[r,\"[x_i,-]\"] \n               (V)⟨∂_i⟩\n \n    for 1 ≤ i ≤ n,\n    where (V)⟨ - ⟩ means free divided power algebra. The differential (<ref>) is surjective with kernel (V). Now the Künneth formula finishes the proof.\n\n\n\n    The complex constructed in the proof above coincides with the PD de Rham complex for a free divided power algebra. See <cit.>.\n\n\n\n\n\n    For a smooth variety X over k,\n    there is an isomorphism\n    \n    HH^m(^r_X,_X) ≅ H^m(X,_X^(r))\n\n    for all m ≥ 0\n    such that the following diagram commutes:\n    \n    \n    \n    \n    \n    \n    HH^m(^r+1_X,_X) [r, \"∼\"] [d]\n                H^m(X,_X^(r+1)) [d, \"Fr\"] \n    \n            HH^m(^r_X,_X) [r, \"∼\"] \n                H^m(X,_X^(r))\n\n\n\n    Consider the spectral sequence of Proposition <ref> for (^r_X,_X). By Proposition <ref>,\n    for any pair V⊆ U in 𝔘,\n    we have HH^0(^r(U),(V)) = (V)^(r) and HH^j(^r(U),(V)) = 0 for j > 0. \n    Thus, the spectral sequence has E_2-page \n    \n    E_2^ij = \n                H^i(N(𝔘),_X^(r))     j = 0 \n    \n                0     j > 0,\n\n    and so collapses at E_2.\n    \n    We would like to relate N(𝔘), the nerve in the sense of category theory, to Čech cohomology with respect to 𝔘.\n    Let N_Čech(𝔘) be the Čech nerve of 𝔘.\n    As 𝔘 is closed under intersection, Theorem 1.4 of <cit.> implies that the map N_Čech(𝔘) →𝔘 sending (U_0,…, U_i) ∈𝔘^i+1 with nonempty intersection to U_0 ∩⋯∩ U_i induces a homotopy equivalence N_Čech(𝔘) → N(𝔘).\n    This map induces \n    \n    H^i(N(𝔘),_X^(r)) ≅ H^i(N_Čech(𝔘),_X^(r)) = Ȟ^i(𝔘,_X^(r)).\n\n    The sheaf _X^(r) is quasi-coherent on X^(r)\n    and the r-fold relative Frobenius Fr^r: X → X^(r) is a homeomorphism, so _X^(r) is acyclic for every affine open subset of X.\n    As 𝔘 consists of affine open subsets of X and is closed under intersection, we obtain \n    E_2^i,0 = H^i(X,_X^(r)). This proves the claim.\n    \n\n\n\n    Let k be a field of positive characteristic and X be a smooth variety over k.\n    Then there are short exact sequences \n    \n    0 → R^1_r H^m-1(X,_X^(r)) → HH^m(_X) →_r H^m(X,_X^(r)) → 0\n\n    for all m ≥ 0,\n    where the limit is taken over the sequence of relative Frobenius maps Fr: X^(r)→ X^(r+1).\n\n\n    Combine Proposition <ref> with Lemma <ref>.\n\n\n\n    In <cit.>, Ogus shows that there is an exact sequence \n    \n    0 → R^1 _r H^m-1(X,_X^(r)) →^m__X(_X,_X) →_r H^m(X,_X^(r)) → 0\n\n    for all m ≥ 0. The connection with Theorem <ref> is this: for any abelian category 𝒞 and object C of 𝒞 there is the Chern character ch_C: HH^*(𝒞) →^*_𝒞(C,C) <cit.>.\n    When 𝒞 = A for an an associative algebra A and C ∈ A, the characteristic morphism is implemented by the morphism of Hochschild complexes C^*(A,A) → C^*(A,_k(C)). It may then be checked for smooth affine X that the Chern character ch_(X) is an isomorphism \n    HH^*((X)) →\n    ^*_(X)((X),(X)). \n    At present, it is not clear to the author how to implement the Chern character in <cit.> on the Gerstenhaber-Schack complex, as _k(_X) is not quasi-coherent.\n\n\n\n\n§ EXAMPLES\n\n\n\n    Let X = 𝔸^1_k, so that (X) = k[t].\n    Then (X^(r)) = k[t^p^r]\n    and the relative Frobenius X^(r)→ X^(r+1) is induced by the inclusion k[t^p^r] → k[t^p^r+1]. Theorem <ref> implies that HH^0(_𝔸^1) = k, \n    \n    HH^1(_𝔸^1) ≅ R^1 _r k[t^p^r],\n\n    and HH^m(_𝔸^1) = 0 when m > 1.\n    Let us compute R^1_r k[t^p^r].\n    The short exact sequence of diagrams \n    \n    0 →{ k[t^p^r]}_r →{k[t]}_r →{k[t]/k[t^p^r]}_r → 0\n\n    gives a medium-length exact sequence of derived inverse limits\n    \n    0 → k → k[t] →_r k[t]/k[t^p^r] → R^1_r k[t^p^r] → 0 → 0 → 0.\n\n    Hence R^1 _r k[t^p^r] is identified with (_r k[t]/k[t^p^r])/k[t]. The space _r k[t]/k[t^p^r] embeds into kt as those power series which may be written as a formal sum f= ∑_r=0^∞ f_r for f_r ∈ k[t^p^r].\n    The identification HH^1(D(X)) ≅ R^1_r (X^(r)) sends such a power series f to the commutator with f, which is well-defined since every element of D(X) commutes with some (X^(r)).\n    This explains S. Paul Smith's observation from 1986 that taking the commutator with the series t + t^p + t^p^2 + ⋯ gives an outer derivation of D(𝔸_k^1) <cit.>.\n\n\n\n    Suppose that X is proper over k, so that H^m(X,_X) is finite-dimensional over k for all m≥ 0. Pullback by Frobenius is a semilinar endomorphism of H^m(X,_X), and thus there is a canonical splitting\n    \n    H^m(X,_X) = H^m_n(X,_X) ⊕ H^m_s(X,_X)\n\n    into Fr-stable subspaces where the Frobenius acts nilpotently and as an isomorphism, respectively <cit.>. Then \n    _r H^m(X,_X)^(r)≅ H^m_s(X,_X)\n    via the projection _r H^m(X,_X)^(r)→ H^m(X,_X), while\n     R^1 _r H^m(X,_X)^(r) = 0.\n    We conclude HH^m(_X) ≅ H^m_s(X,_X) when X is proper over k.\n  \n\n\n\n§ CUP PRODUCT\n\n\n\nGerstenhaber and Schack defined a cup product on (<ref>) in terms of the cup product on the Hochschild complex.\nGiven simplices τ = (U_0 < ⋯ < U_ℓ) and  ν= (U_ℓ < ⋯ < U_i) in N(J) with maxτ = minν, \ndefine τ∪ν = (U_0 < ⋯ < U_ℓ < ⋯ < U_i).\nFor Å a presheaf of associative algebras on J,  a presheaf of Å-bimodules with compatible associative product, α∈ C^m(Å,), and β∈ C^n(Å,), define \n\n    (α∪β)^σ = ∑_σ = τ∪ν (-1)^|ν|(m-|τ|)α^τφ_Å∪φ_β^ν,\n \nwhere φ refers to structure maps of the presheaves Å and , and ∪ on the right-hand side is the cup product on the usual Hochschild complex <cit.>. \n\n\n    Let J be a poset, Å a presheaf of associative k-algebras on J, and  a presheaf of Å-bimodules with a compatible associative product.\n    Then the spectral sequence \n    \n    E_2^i,j = H^i(N(J),HH^j(Å,))  HH^i+j(Å,)\n\n    of Proposition <ref> is a spectral sequence of algebras with the usual product on E_2.\n\n\n    Formula (<ref>) makes the Gerstenhaber-Schack double complex a differential bigraded algebra,\n    and endows E_2 with the usual product structure.\n\n\n\n    Let k be a field of positive characteristic and X be a smooth variety over k.\n    Then the surjection HH^∗(_X) →_r H^∗(X,_X^(r)) of Theorem <ref> is a map of rings.\n\n\n\n\n\n\n"}