{"entry_id": "http://arxiv.org/abs/2303.07161v1", "published": "20230313143615", "title": "Quantum estimation of a charge distance from a hole-spin qubit in Si quantum dots", "authors": ["Gaia Forghieri", "Andrea Secchi", "Andrea Bertoni", "Paolo Bordone", "Filippo Troiani"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall", "quant-ph"], "text": "\n\n\n\n\n\n\n\n\n\n\n^1Università di Modena e Reggio Emilia, I-41125 Modena, Italy\n ^2Centro S3, CNR-Istituto di Nanoscienze, I-41125 Modena, Italy\n\n\nHole-spin qubits in semiconductors represent a mature platform for quantum technological applications. Here we consider their use as sensors of the electrostatic environment, and specifically for estimating the distance from the qubit of an external charge. Different approaches are considered — based on the use of single or double quantum dots, ground and out-of-equilibrium states, Rabi and Ramsey measurements — and comparatively analyzed by means of the classical and quantum Fisher information. Detailed quantitative aspects result from the multiband character of the hole states, which we account for within a multiband approach. Beyond this, general conclusions can be drawn on the relative efficiency of the above options, and analytical expressions are derived for the Fisher information of a generic qubit within the Rabi and Ramsey schemes.\n\n\n\n\nQuantum estimation of a charge distance from a hole-spin qubit in Si quantum dots\n    Filippo Troiani^2\n    March 30, 2023\n=================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nSpin qubits in silicon quantum dots are the subject of an intense research activity <cit.>. In recent years, high fidelities have been achieved in all fundamental primitive operations, including single-  <cit.> and two-qubit gates <cit.>, state preparation <cit.> and readout <cit.>. \nThe suitability of silicon as a host material for spin qubits <cit.> is related to the long coherence times <cit.>, resulting from the natural abundance of nonmagnetic isotopes and from the possibility of further enhancing such fraction through isotopic purification <cit.>. \n\nMoreover, the manufacturing processes of silicon devices are well established in the modern industry <cit.>. Thus, dense arrays of spin qubits can be realised <cit.> and possibly operated at temperatures as high as 4K <cit.>.\n\n\n\n\nSilicon quantum dots can host both electron- and hole-spin based qubits. An appealing feature of the hole-based implementation lies in the strong atomic spin-orbit coupling, which offers the opportunity to perform all-electrical manipulation of the qubit states <cit.>, without the inclusion of micromagnets in the device <cit.>. A double-edged sword in the use of hole spins is represented by the dependence of the qubit properties and of its coupling to external fields on the band mixing, which can in turn be rather sensitive to the electrostatic environment. On the one hand, this makes hole-spin qubits highly susceptible to electric noise <cit.>. On the other hand, it allows for a strong tunability and dynamic control of the qubit properties <cit.>. Here we explore the possibility of exploiting such properties, along with the maturity of hole-spin qubits, in the context of quantum parameter estimation <cit.>. Specifically, we aim at estimating the distance D from the qubit of a point charge: as shown in Fig. <ref>, different distances D_1 and D_2 result in different spatial distributions of the hole ground state [panels (a,b)], and consequently in different values of the Larmor (ω_ L) and Rabi (ω_ R) frequencies. This, in turn, translates into different rotation angles of the qubit state for given free precession times τ [panels (c,d)] or manipulation pulses [panels (e,f)]. The inference of the unknown parameter D can thus be based either on the properties of the hole ground state (static approach), or on the final out-of-equilibrium state |ψ⟩ of the spin qubit resulting from a given pulse sequence (dynamic approach). We assess and compare the quality of the parameter estimation based on these approaches by computing the classical and quantum Fisher information, the former one being specifically related to the Rabi and to the Ramsey measurement schemes. This approach thus combines aspects of remote charge sensing <cit.> and of quantum parameter estimation. As in remote charge sensing, a property of a target charge is inferred from its effect on a sensor dot. However, unlike in remote charge sensing, the unknown quantity is a continuous one (the charge distance, rather than its value) and is mapped onto the state of the sensor qubit, rather than on the measured position of its Coulomb peaks.\n\nHole eigenstates are computed within a six-band 𝑘· 𝑝 approach <cit.>. The Coulomb interaction between the hole and the external charge contributes to the total electrostatic potential acting on the hole, under the assumption that the external charge is localized enough for its state to be unaffected by the interaction with the hole. This allows for a realistic simulation of the interplay between the shape of the confining electrostatic potential, the Coulomb hole-charge interaction, the atomic spin-orbit coupling and an external magnetic field. The role of the confinement potential clearly emerges from the comparison between single quantum dots (SQDs) and double quantum dots (DQDs). \nThe latter ones are characterized by a wider polarizability of the hole ground state, and thus a stronger dependence of its properties on the distance of the external charge. Moreover, the Rabi and Ramsey frequencies of DQDs have a stronger dependence on D than those of SQDs, eventually resulting in a large enhancement of the precision in the estimate. Overall, the dynamic approach based on the Ramsey measurement with a DQD allows one to achieve values of the Fisher information that are several orders of magnitude larger than those obtained with the other considered approaches. This emerges as a robust conclusion, irrespective of the detailed properties of the quantum dot systems. \n\nThe rest of the paper is organized as follows. In Section II we introduce the multiband model of the hole-spin qubit, along with the Hubbard model that qualitatively reproduces the main features of the DQD implementation. Section III discusses the static estimation strategy, based on the dependence of the hole ground state on the charge distance. Section IV is devoted to the dynamic strategy, where the parameter estimation is based on the Rabi and Ramsey measurements. Finally, in Section V we report the conclusions and the outlook.\n\n\n\n\n§ THE MODEL SYSTEM\n\n\nThe multiband character of the hole eigenstates plays a crucial role in determining the relevant qubit properties, specifically the Larmor and Rabi frequencies. In fact, these result from the interplay between the atomic spin-orbit coupling, the confining potential, and the external magnetic field. In order to account for these features, we model the hole-spin qubit by means of a six-band Luttinger-Kohn Hamiltonian <cit.> (Subsec. <ref>), with an external confining potential that models either a SQD or a DQD. In the DQD case, the interplay between interdot tunneling and charge-induced bias can also be described by means of a simpler and more intuitive Hubbard model, which confirms the independence of some reported behaviors on the details of the DQD system, and additionally allows for the derivation of analytical results. Such model is introduced in Subsec. <ref>.\n\n\n\n §.§ Multiband model of the single and double quantum dots\n\n\nThe six-band Luttinger-Kohn envelope-function Hamiltonian is appropriate for the description of the low-energy hole states close to the maximum of the valence band in silicon (Γ point) <cit.>. There, the atomic spin-orbit coupling provides an energy splitting Δ_ SO = 44 meV between the j = 3/2 quartet (heavy and light hole bands) and the j = 1/2 doublet (split-off band). The single-hole Hamiltonian defined in such combined position-spin space and with the inclusion of external (electric and magnetic) fields, is diagonalized numerically in order to derive the hole energies and eigenstates <cit.>. \n\n\n\n  \nSingle and double quantum dots.\n\nThe hole confinement is induced by a combination of band offset and electrostatic coupling to the metal gates. In the presence of an additional external charge, the total potential acting on the hole is given by: V( r) = V_ conf( r) + V_ c( r), where V_ conf( r) is the confinement potential, and V_ c( r) accounts for the Coulomb interaction with the charge. In the case of the single (SQD) and double quantum dots (DQD) considered hereafter, V_ conf( r) coincides with \n\n    V_ SQD( r) = κ/2( x^2 + y^2 ) + V_∥(z)  ,\n\nand\n\n    V_ DQD( r) = κ/2[ (x^2-a^2)^2/4a^2 +y^2] + V_∥(z)  ,\n\nrespectively. \nIn both cases, the last contribution accounts for the confinement in the vertical direction and reads\n\n    V_∥(z) = { - E_∥ z     |z| < L_z / 2 \n     V_ bo    |z| > L_z / 2 . ,\n\nwhere L_z is the channel width, V_ bo is the band offset between the well and the barriers along the z direction (here V_ bo = 4000meV and L_z = 5nm), and E_∥ is an electric field applied along the z direction <cit.> (E_∥ is set to zero in Sec. <ref> and to -50mV/nm in Sec. <ref>). \nThe strength of the in-plane confinement is determined by κ and, close to the minima of V_ DQD( r), it approaches that of the SQD, both in the x and y directions (here κ = 7.6566 × 10^-2meV/nm^2). The interdot distance is identified with the distance 2a between the minima of V_ DQD( r). \n\nThe Coulomb interaction between the confined hole and the external charge (assumed to be equal to - |e|) is\n\n    V_ c( r) = -  e^2/ε√((x-x_ c)^2+(y-y_ c)^2+(z-z_ c)^2) ,\n\nwhere ε = 11.68 is the dielectric constant of bulk silicon <cit.>. In the following, we specifically consider the case where the charge is positioned along the x axis, r_ c = (D,0,0), in order to highlight the interplay between the interdot tunneling and the Coulomb interaction. \n\nFinally, the coupling between the hole and the static magnetic field is accounted for by the Zeeman-Bloch Hamiltonian and the substitution k→ k + (e / ħ)  A in the 𝑘· 𝑝 Hamiltonian, with A being the vector potential associated to the magnetic field <cit.>.  \n\n\n\n\n\n\n  \nLarmor and Rabi frequencies.\nIn order to realize a hole-spin qubit, it is crucial to split the Kramers degeneracy in the ground doublet by means of a static magnetic field B=B (sinθ cosϕ,sinθ sinϕ,cosθ). \nThe resulting energy splitting between the lowest energy eigenvalues e_1 and e_2 defines the Larmor angular frequency\n\n    ω_ L≡1/ħ (e_2-e_1)    ,\n\nwhose value depends on the field intensity (B) and orientation (θ and ϕ), on the detailed composition of the hole eigenstates, and (therefore) on the parameters that define the confinement potential.\n\n \nHole-spin qubits can be manipulated electrically, by applying voltage pulses to a neighboring metal gate. Here, we assume that such voltage induces a time-dependent potential perturbation δ V( r,t) = - δ E_0  cos (ω t)  z, corresponding to an oscillating, homogeneous electric field (here δ E_0 = 3meV/nm). The resulting Rabi angular frequency is given by:\n\n    ω_ R≡1/ħ δ E_0  |⟨ψ_1|  ẑ |ψ_2⟩|   ,\n\nwhere |ψ_1⟩ and |ψ_2⟩ are the hole eigenstates belonging to the ground doublet.\n\nBoth ω_ L and ω_ R are affected by the Coulomb interaction between the hole and the external charge [Eq. (<ref>)], and depend on the distance D between this and the center of the (double) quantum dot. The figures of merit that determine the accuracy in the estimation of D (Section <ref>) are functions of both these angular frequencies and their derivatives with respect to D, ω_ L'≡∂_D ω_ L and ω_ R'≡∂_D ω_ R. These are here calculated through the extended Hellmann-Feynman theorem, which allows to avoid the finite-differences approach and the related numerical noise (see Appendix <ref> for further details). \n\n\n\n §.§ Hubbard model of the double quantum dot\n\n\n\nThe coupling of the hole to the external (electric and magnetic) fields, and the resulting accuracy in the parameter estimation achieved through the dynamic approach (Sec. <ref>) depends on the detailed composition of the hole eigenstates, and thus on the specific geometry of the host device and on the resulting shape of the confining potential. The properties of the hole ground state that determine the performance of the static approach (Sec. <ref>) are less dependent on such details. It is therefore possible to identify general trends and properties, which can be effectively described in terms of a simpler model. In fact, as shown below, the simplest model of a DQD system, namely, the biased two-site single-band Hubbard Hamiltonian, qualitatively accounts for several features of the more realistic multiband system, including the dependence on D of the quantum Fisher information. \n\n\n\n\nThe biased DQD Hubbard Hamiltonian, for a single hole, reads:\n\n    Ĥ^ Hub=∑_α = ⇑, ⇓( ϵ_1 n̂_1, α+ϵ_2 n̂_2, α- t  ĉ_1, α^†ĉ_2, α- t^* ĉ_2, α^†ĉ_1, α) .\n\nHere, α∈{⇑, ⇓} is a pseudospin quantum number, distinguishing time-reversal conjugated single-particle states <cit.>; ĉ^†_i, α creates a hole in a state localized in dot i with pseudospin α, and n̂_i,α = ĉ^†_i, αĉ_i, α; t is the inter-dot tunneling parameter, and ϵ_i is the onsite energy for site i. The eigenvalues are independent of α, and read \n\n    e^ Hub_± = 1/2[ ϵ_1 + ϵ_2 ±√((ϵ_1 - ϵ_2)^2 + 4 |t|^2 )]  .\n\n\nThe parameters introduced in Eq. (<ref>) can be related to the energies characterizing the multiband system. In particular, the two dots are assumed to be symmetric, so that the difference between the onsite energies ϵ_i is entirely due to the presence of the external charge. As a simple approximation, we then take ϵ_i to coincide with V_ c( r_i), where r_1/2 = (± a,0,0) correspond to the minima of V_ DQD( r):\n\n    ϵ_1 = V_c ( r_1) = -e^2/ε (D+a),   ϵ_2 = V_c ( r_2) = -e^2/ε (D-a) .\n \nThe bias δ_ c between the two dots, induced by the charge, is then given by\n\n    δ_ c = ϵ_1 - ϵ_2 = 2ae^2/ε(D^2-a^2).\n\n\n  \nAs to the energy separation δ_3 , 1 ≡ e_3 - e_1 between the ground and first excited doublets, obtained from the multiband calculations at zero magnetic field and for V_ c = 0, this is identified with 2 |t|, corresponding to the energy gap e^ Hub_+-e^ Hub_- of the Hubbard model in the absence of external charges. As discussed in Subsec. <ref> and Appendix <ref>, the hopping parameter in the DQD depends on a according to |t| = t_0  e^- γ a^2 to a very good approximation.\n\n\n\n\n\n§ STATIC APPROACH TO THE ESTIMATE OF THE CHARGE DISTANCE\n\n\nThe presence of a charge in the vicinity of the DQD affects the eigenstates of the system. In particular, the dependence of the hole ground state on the distance of the charge can be used to estimate its value [Fig. <ref> (a,b)]. The highest achievable precision in such estimate is here quantified by means of the quantum Fisher information (QFI). Its maxima, corresponding to optimal working points, are investigated through the dependence on the charge position of the hole density distribution and of the energy gap between the ground and first excited doublets. \n\n\n\n §.§ Charge distribution and energy eigenvalues\n\nIf the confinement potential V_ DQD( r) is symmetric with respect to the plane x=0, the same applies to the hole density of the eigenstates. This symmetry is broken by the presence of the charge positioned away from the yz plane (Fig. <ref>). In particular, a negative charge at r_ c =(D,0,0) (with D>0) tends to localize the hole density n_k( r)=|⟨ r|ψ_k⟩|^2 for the ground (k=1,2, red curves) and first excited doublets (k=3,4, cyan curves) respectively in the right (x>0) and left (x<0) dots.\nThe degree of localization results from the competition between the Coulomb interaction with the charge, which induces a bias between the two dots and thus tends to localize the hole, and the interdot tunneling, which tends to delocalize the eigenstates over the DQD. \nA transition between a delocalized and a localized-hole regime is observed for increasing values of a at a given charge distance D [panels (a-c)], and for decreasing values of D at a given interdot half distance a [panels (a-c)].\n\nSuch transition clearly shows up in the behavior of the hole energy eigenvalues at zero magnetic field. In particular, we consider the energies e_1=e_2 and e_3=e_4 of the Kramers-degenerate ground and first-excited doublets as a function of a [Fig. <ref>(a)]. In the absence of an external charge, the energy gap δ_3,1≡ e_3-e_1 decreases monotonically in the considered range of values [Fig. <ref>(b), dashed grey line]. This is because δ_3,1 is related to the tunneling amplitude between the two dots, which decreases approximately as e^-γ a^2 (for further details, see Appendix <ref>). This behavior changes in the presence of the external charge (solid lines), where  δ_3,1 displays a minimum for a≈ a_ min. There, a transition takes place from a regime where the interdot tunneling is larger than the charge-induced bias and the hole state is delocalized, to the opposite for a≳ a_min. Correspondingly, the energy levels e_1 and e_3 undergo an avoided crossing, as can be seen by comparing the curves corresponding to the same value of D in Fig. <ref>(a).\n\nThis interplay is qualitatively reproduced by the Hubbard model described in Subsec. <ref>. In fact, the bias between the two dots, induced by the external charge, concurs with quantum tunneling to determine the avoided crossing between the energy levels e_-^ Hub and e_+^ Hub [Eq. (<ref>)], corresponding to e_1 and e_3, respectively (see Appendix <ref>).\n\n\n\n\n\n\n\n §.§ Quantum Fisher information of the hole ground state\n\nThe dependence on the interdot distance of the hole localization and of the energy gap anticipate and explain that of the QFI. The QFI is a key quantity in quantum parameter estimation <cit.>, for it provides — via the quantum Cramér-Rao bound — the highest achievable precision in the estimate of the unknown value of the parameter. For a generic state |ψ⟩ depending on a parameter λ, the QFI reads as\n\n    H = 4 ( ⟨∂_λψ|∂_λψ⟩ + ⟨∂_λψ|ψ⟩^2 ) .\n\nThe QFI related to the parameter λ=D is computed hereafter in order to further characterize the dependence of the hole ground state on the position of the charge and to allow for a quantitative comparison between the potentialities of the static and dynamic approaches to the estimate of the charge distance.\n\nThe dependence of H on the half interdot distance a, for different distances D of the charge from the DQD, is characterized by a maximum for a≈ a_ min, where δ_3,1 is minimal (Fig. <ref>, solid lines). In agreement with what was previously observed for the energy eigenvalues, the maxima occur at values of the interdot distance that increase with the distance D between the charge and the DQD. \n\nThe behavior obtained from the six-band 𝑘· 𝑝 Hamiltonian is qualitatively reproduced by the Hubbard model (dashed lines), especially for values of D that are sufficiently larger than 2a. Besides, in the case of the Hubbard model, one can derive the analytical expression of the QFI:\n\n    H^ Hub = [ 2e^2   a   |t|  ε  D /a^2 e^4+ |t|^2ε^2(D^2-a^2)^2]^2  ,\n\nwhich depends on the half interdot distance a also through the tunneling parameter t (see Appendix <ref>). At a given value of a, the maximum value of H^ Hub as a function of D (in the case of D > a) is obtained at \n\n    D_max H^ Hub =  √(a/3( a + √(4 a^2 + 3 e^4/ε^2 |t|^2) ) ) .\n\nThe above expression thus gives the value of D at which the hole ground state is most sensitive to small variations in D. The problem of identifying the value of a that maximizes H^ Hub, for a given D, is not analytically solvable. However, we find that such optimal value of a is close to satisfying the condition σ≈ 1 (see Fig. <ref>), where σ≡ 2 |t| / δ_ c is the ratio between the tunneling energy gap and the charge-induced bias. The Hubbard model thus provides a clear indication that the maximal sensitivity of the hole ground state to the position of the external charge is achieved when the competition between interdot tunneling and charge-induced bias is balanced. \n   \n\n\n\n§ DYNAMIC APPROACH TO THE ESTIMATE OF THE CHARGE DISTANCE \n\nIn the dynamic approach, the position of the charge is inferred from the outcome of the qubit readout, performed after a coherent control scheme. When the hole is operated as a qubit, the only degree of freedom which is accessed is the particle spin, defined by the lowest-energy doublet: {|0⟩≡|ψ_1⟩,|1⟩≡|ψ_2⟩}. \nThe particular qubit state |ψ⟩ that is generated after manipulating the hole depends on the Larmor and Rabi frequencies and, through these, on the distance D between the (double) quantum dot and the external charge. \n\n\n\n §.§ Larmor and Rabi frequencies\n\n\nThe presence of the external charge affects the Larmor frequency in ways that depend on the orientation of the magnetic field 𝐁. As the charge distance D from the DQD increases, f_L≡ω_ L/2π monotonically increases [Fig. <ref>(a-c), solid lines], and eventually tends to the value obtained in the absence of the charge (dashed lines). While this behavior is qualitatively independent of the magnetic-field orientation, the sensitivity of f_L to D is maximal when B is oriented along either the x or y directions. The situation is analogous for a SQD, although in this case the curves corresponding to 𝐁∥𝐱 and 𝐁∥𝐲 have opposite curvatures (i.e. opposite values of f_ L'). \n\nBoth the value of the Larmor frequency (ω_ L) and its change (Δω_ L) in the presence of an external charge display a non-monotonic dependence on the interdot distance [panels (d-e), 𝐁∥𝐱]. The position of the maxima of both ω_ L and Δω_ L depends on the distance D. The role played by spin-orbit coupling, and specifically by the value of the splitting between the j=3/2 and the j=1/2 bands, is demonstrated by the comparison between the above mentioned results and those obtained by a four-band calculation (corresponding to the limit where Δ→∞). In the opposite limit with no spin-orbit coupling (Δ_ SO=0) the Larmor frequency is entirely independent of the orbital degrees of freedom and, thus, of the electrostatic potential. In this case f_ L is given by the Zeeman splitting, hf^ Z_L=g_ sμ_BB=115.77 μeV, where μ_B is the Bohr magneton and g_ s≈ 2 is the electron-spin g-factor. This implies that the presence of Δ_ SO≠ 0 is fundamental, since the dependence of the Larmor frequency on D plays a crucial role in the estimation of the parameter D performed both in the Rabi and in the Ramsey measurement schemes (see Subsec. <ref>). \n  \n\n\n\n\n\n\n\nThe Rabi frequency for a hole-spin qubit in a Si SQD has been previously studied for different devices and confining potentials. A crucial role in the tuning of ω_ R is played by the orientation of the magnetic field with respect to the crystal and dot axes. The dependence of the Rabi frequency on the angles θ and φ, that we obtain here, qualitatively coincides with the results reported elsewhere for SQDs <cit.>. In the following, we focus of the field orientation defined by θ=60^∘ and ϕ=90^∘, which represents a good compromise between the conflicting requirements of obtaining large Larmor and Rabi frequencies. Both ω_ R and its derivative with respect to D decrease monotonically with the distance D [Fig. <ref>(c,d)], in analogy to what is obtained for the Larmor frequency [panels (a,b)]. The comparison between the two quantities shows that the Larmor frequency, besides being much larger than the Rabi frequency in absolute terms, displays a much stronger dependence on the position of the charge [panels (e,f)]. This will have important implications in the identification of the optimal parameter estimation protocols.\n\n\n\n §.§ Fisher information of the qubit state\n\n\nOnce the dependence of the Larmor and Rabi frequencies on D has been derived, one can devise a strategy for estimating the charge distance. This consists in identifying a manipulation protocol that results in a strong dependence on D of the qubit state |ψ⟩, and specifically of the measurement-outcome probabilities p_0=|⟨ 0 | ψ⟩|^2 and p_1=|⟨ 1 | ψ⟩|^2. In the following, we focus on the Rabi and Ramsey measurement schemes.\nIn both cases, the key figure of merit is the Fisher information (FI) associated with the observable σ_Z. For a qubit in a generic state |ψ⟩, the FI related to the parameter D reads:\n\n    F(|ψ⟩,σ_Z) = ∑_k=0,1(∂_D p_k)^2/p_k = (∂_D p_1)^2/(1-p_1) p_1 .\n\nThe above expression also applies to the case of a mixed state ρ̂, where p_1=⟨ 1|ρ̂|1⟩. \n\nDecoherence tends to erase the information on the value of D encoded in the qubit state, and thus to reduce the FI. In order to account for this effect, in particular for that induced by the hyperfine interactions <cit.>, we include a simple decoherence model. This corresponds to a depolarizing channel with a Gaussian decay of the pure-state component on a characteristic time T_2^* (see Appendix <ref>), and essentially plays a role during the free evolution of the spin qubit in the Ramsey measurement. \n\n\n\n  \nRabi measurement.\n\nIn the Rabi scheme and under the rotating-wave approximation, the occupation probability of state |1⟩, for a qubit initialized in |0⟩ and addressed by a rectangular pulse of frequency ω and duration T, is given by <cit.>:\n\n    p_1=ω_ R^2/Ω^2sin^2(T Ω/2)  ,\n\nwhere Ω = √(ω_ R^2 + Δ^2), and Δ≡ω - ω_ L. We assume that T ≪ T_2^*, so that the effect of decoherence on the occupation probabilities p_0 and p_1 can be neglected. Combining Eqs. (<ref>-<ref>), one obtains the expression of the FI, which reads:\n\n\n    F_ Rabi = [ T cos(Ω T/2) ω_ RΩ( ω_ Rω'_ R - Δω'_ L) + 2 Δsin(Ω T /2) ( ω_ Rω'_ L  + Δω'_ R)   ]^2/Ω^4 [ Δ^2 + ω_ R^2 cos^2( Ω T/2) ] .\n\n\nFor each pulse duration (T) and central frequency (ω), the qubit read out thus allows the estimate of D with a precision whose upper bound is fixed by the above F_ Rabi. We stress that the above expression is valid for a generic Rabi measurement, irrespective of the involved physical system. \n\nIn local quantum parameter estimation, the goal is the precise estimate of a parameter, whose possible values are already restricted to a limited range by an a priori knowledge. In order to account for this, we consider hereafter values of the charge distance from the (double) quantum dot ranging from D_ min = 140nm to D_ max = 160nm. A suitable choice of the pulse is crucial in order to optimize the estimation process. The uncertainty on the value of D also implies an uncertainty on ω_ R and ω_ L, and thus on the pulse duration and frequency that are required to generate a given qubit state |ψ⟩. However, if the variation of the Larmor and Rabi frequencies within the range of possible values of D is sufficiently small, then a given pulse leads to the implementation of well-defined rotations. More specifically, we consider a value of the pulse frequency equal to ω̅_ L, defined as the integral average of the Larmor frequency in the interval [D_ min;D_ max]. By doing so, we effectively show in Fig. <ref> that the final occupation probability of the qubit state |1⟩ displays a negligible dependence on the exact value of D for both the double [panel (a)] and single dot [panel (b)]. We also evaluate the integral average of the Rabi frequency, ω̅_ R, which allows us to define a reference time for the duration of the pulse, T_ Rabi=π/ω̅_R. We note that the value of ω̅_ R is approximately 25 times larger for the DQD than for the SQD, which determines a much shorter pulse duration T_ Rabi in the former case (0.038 vs 0.95 μs). \n\nAs to the FI, the regions of interest clearly coincide with those where ω̅_ RT≈ (2n+1)π [panels (c,d)]. In order to gain further insight into the parameter dependence of F_ Rabi, we focus hereafter on the case n=0 [panels (e,f)], where the assumption that T ≪ T_2^* is better satisfied. The FI, plotted as a function of D for slightly different values of the pulse duration, displays a non-trivial behavior. It generally tends to decrease with the distance between the hole and the charge. However, the curves also display a marked minimum in correspondence of the resonance condition (Δ=0), where the FI approaches zero. Besides, such dip becomes increasingly narrow as ω̅_ RT approaches the value of π.\nWhile such complex behavior can only be described by the full expression of the FI [Eq. (<ref>)], the trend obtained away from the resonance condition at T=T_ Rabi is reflected by the simplified expression:\n\n    F_ Rabi≈4 ω_ R^2(ω_ L')^2/Ω^4  .\n\nThis is obtained from Eq. (<ref>) if Ω T_ Rabi≈π for any charge distance within the considered range, and exploiting the fact that |ω_ L'|≫ |ω_ R'| (see Subsec. <ref>).\n\nOverall, the values of the FI are comparable to those obtained for the QFI in the static approach, and larger for the single than for the double quantum dot. On the other hand, the pulse duration T_ Rabi required for the DQD is about 25 times shorter than that for the SQD, which might represent a significant advantage in dots with shorter decoherence times. \n\n\n\n\n\n\n  \nRamsey measurement.\nIn the Ramsey measurement, one ideally applies two π/2 pulses to the system, separated by a waiting time τ. The final occupation probability of the state |1⟩ depends on the phase difference between the two basis states accumulated during the waiting time τ, and thus on ω_ L. The inference of D is based on such dependence, but also on the dependence on ω_ L and ω_ R of the rotations implemented by the two pulses. \n Within the RWA, and in the absence of decoherence, the expression of the final p_1 reads <cit.>:\n\n    p_1, coh     =  4 | ω_ R|^2 /Ω^2sin^2( Ω T /2)    [   \n    cos( Ω T /2)    cos( Δτ/2)  \n          - Δ/Ωsin( Ω T /2)    sin( Δτ/2)   ]^2   ,\n \nwhere T is the duration of each pulse.\n\nWe report hereafter the analytical expression of the FI. Even though it is quite complex, it applies to any qubit within the Ramsey measurement scheme. The FI is given by\n\n    F_ Ramsey, coh=   4 B^2/1-X^2 A^2  ,\n\nwhere the terms A and B read\n\n    A= cos(Δτ/2) sin(Ω T )-Ysin(Δτ/2) [1-cos(Ω T )]  ,\n\nand\n\n    B=    A ω_ R'-XΩ'/Ω \n    + A_1 ω_ L'τ/2 + A_2 Ω' T\n    + A_3 ω_ L'+YΩ'/Ω  .\n\nIn the above equations, we have introduced the dimensionless quantities X≡ω_ R^X/Ω and Y≡Δ/Ω, defined such that X^2+Y^2=1. As usual the prime denotes the derivative with respect to the unknown parameter λ = D .\nFinally, the three terms A_1, A_2, and A_3, which appear in the expression of B, are given by:\n\n    A_1 =   sin(Δτ/2) sin(Ω T )+Ycos(Δτ/2) [1-cos(Ω T )]  , \n    \n    A_2 =   cos(Δτ/2) cos(Ω T )-Ysin(Δτ/2) sin(Ω T )  , \n    \n    A_3 =   sin(Δτ/2) [1-cos(Ω T )]  .\n\n\nThe sensitivity allowed by the Ramsey measurement can ideally increase with the duration of the waiting time τ, but it is in practice limited by decoherence. In order to account for such effect, and being in general τ≫ T, we assume that the effect of decoherence is mainly manifest during the free evolution phase (see Appendix <ref> for details). As a result, the final occupation probability p_1, coh [Eq. (<ref>)], obtained for the pulse sequence in the absence of decoherence, is replaced by the probability\n\n    p_1     =  e^-    ( τ  / T_2^* )^2  p_1,  coh + 1/2[1-  e^- ( τ / T_2^* )^2] .\n\nCombining the above equation with Eq. (<ref>), one obtains the FI in the presence of decoherence, which reads:\n\n    F_ Ramsey   =16X^2A^2B^2/[e^2(τ/T_2^*)^2-1]+4X^2A^2(1-X^2A^2) \n       =F_ Ramsey,coh1-(1-2p_1)^2/e^2(τ/T_2^*)^2-(1-2p_1)^2  .\n\nThe latter equation above explicits the relation with the FI in the coherent case, and shows how the ratio F_ Ramsey/F_ Ramsey,coh varies from 1 in the limit τ≪ T_2^*, to the exponentially decaying function e^-2(τ/T_2^*)^2 in the opposite limit.\n\n\n\nThe general expressions of the qubit occupation probabilities and of the corresponding FI are finally applied to the case of the hole-spin qubit in the single and double quantum dots, where we include the specific values of the Larmor and Rabi frequencies and of their derivatives with respect to λ=D obtained from our 𝑘· 𝑝 simulations.\nIn particular, we plot p_1 and F_ Ramsey as a function of D and of the waiting time τ, for T_2^*=2.5 μs (Fig. <ref>). We fix the pulse duration to a reference time T=T_ Ramsey=π/2ω̅_ R. In the case of the DQD, the dependence of p_1 on τ and on D [panel (a)] recalls the one typically obtained in Ramsey spectroscopy <cit.>, with D modulating ω_ L and thus being the cause of detuning. In both cases, the oscillations as a function of D are damped for values of the waiting time τ that are much larger than T_2^*. \nThe FI displays analogous oscillations as a function of D and τ, with a shorter periodicity and a similar damping at long waiting times [panel (c)]. Further details can be appreciated from the sections of the contour plots, corresponding to given values of τ [panel (e)]. The dependence of the frequency in the oscillations on τ reflects the fact that the sensitivity of the accumulated phase on the exact value of ω_ L (and thus of D) increases with τ. This should also imply a monotonic increase of the local maxima with τ, which however does not occur in the presence of decoherence.\nThe effect of decoherence can be appreciated by comparing these plots with those obtained for larger values of T_2^* and for the coherent case (Appendix <ref>). \n\nThe difference with respect to the SQD case [panels (b,d,f)] is striking. On the one hand, in the SQD case one hardly observes an oscillatory behavior for either p_1 and F, because ω_ L varies much less than in the case of the DQD in the considered range of values of D. On the other hand, the maximal values of the Fisher information in the DQD are two orders of magnitude larger than in the SQD.For optimal values of τ, F_ Ramsey is roughly 10 times larger than F_ Rabi for the SQD, while it is 1000 times larger for the DQD. In fact, since F_ Rabi is similar in both systems, the discriminating factor in F_ Ramsey is the value of ω_ R, which we found to be an order of magnitude larger in the DQD with respect to the SQD.\nThis conclusion results from a simplified expression of the Fisher information, derived for Ω T_ Ramsey≈π/2 and | ω_ L' τ| ≫ |X'|, |Y'|. In this case, one has that\n\n    F_ Ramsey   ≈ C  4ω_R^2(ω_L')^2/Ω^4  (ω_Rτ)^2   .\n\nwhere C is a factor that oscillates as a function of Δ (and thus of D), whose expression in reported in Appendix <ref>. The second factor in the above formula coincides with the approximate expression of F_ Rabi given in Eq. (<ref>). The third factor increases quadratically with the free evolution time τ. Since ω_ R T_ Ramsey≈π/2, when τ≫ T_ Ramsey the factor (ω_ Rτ)^2 might become very large, allowing the maximal values of F_ Ramsey to be much larger than those of F_ Rabi. On the other hand, τ cannot be chosen to be large at will, since C also includes an exponentially decreasing dependence on τ/T_2^*, which suppresses F_ Ramsey at τ≫ T_2^*. Therefore, the optimal value of τ should represent a compromise between these conflicting requirements.\n\nThe strongly oscillating behavior of F_ Ramsey with respect to both D and τ should be taken into account in devising the measurement strategy. The oscillations as a function of the charge distance imply no problem if their period is larger than the a priori uncertainty on the value of D. If this is not the case, one can either enhance the period by reducing the free evolution time τ, or make use of a composite measure, which combines two Ramsey measurements, obtained with different values of the pulse frequency ω, and thus with different positions of the minima. This approach would lead to a smearing of the oscillating features, and thus to an enhancement of the minimal precision, at the cost of reducing the maxima.\n\n\n\n§ CONCLUSIONS AND OUTLOOK\n\n\nThe purpose of this paper is to explore the potentialities of hole-spin qubits for performing quantum sensing of the electrostatic environment. These potentialities ultimately lie in the multiband character of the eigenstates, which can be significantly influenced by the electrostatic environment. This, in turn, affects its coupling to the external (electric and magnetic) fields, and thus the qubit state |ψ⟩ that is generated by a given pulse sequence. We have specifically considered different approaches for estimating the distance D from the qubit of a point charge, and quantified the estimate precision in terms of the classical and quantum Fisher information.\n\nBeyond the dependence on the specific properties of the quantum dots, some general aspects emerge from our investigation. First, the use of double — rather than single — quantum dots allows for a significant enhancement of the precision in the estimate. In fact, at the static level, the hole ground state is more polarizable, and thus more sensitive to the position of the external charge, especially in the range where the charge-induced bias is comparable to the interdot tunneling amplitude. Besides, at the dynamic level, when the hole is localized in the double quantum dot, its Larmor and Rabi frequencies, ω_ L and ω_ R, are more sensitive to the charge position. Second, we saw that a dynamic approach, where the value of D is encoded in the statistics of a Rabi or a Ramsey measurement, allows for better estimates than the static approach, where the distance of the charge determines the statistics of an arbitrary measurement performed on the hole ground state. Third, among the dynamic approaches, the Ramsey measurement performs better than the Rabi scheme, because it allows for more efficient exploitation of the dependence of ω_ L on the charge distance, which is stronger than that of ω_ R. While the dependence on D of the ground state, ω_ L, and ω_ R is specific to the hole-spin qubit, the analytical expressions of the Fisher information corresponding to the Rabi and Ramsey measurements that we have derived are completely general and apply to any physical implementation of the qubit.\n\nPossible generalizations of the presented results can be envisaged. These include the inclusion of a multidimensional estimate, where more than one parameter needs to be simultaneously inferred, and less constrained spatial distributions of the point charge. On the other hand, the downside of the sensitivity of the hole-spin qubit to the electrostatic environment is represented by its fragility to electrical noise. The present approach and figures of merit can in principle also be used to investigate and quantify such fragility, and devise strategies for reducing or minimizing the effects of electrical-noise-induced decoherence. \n\n\n\nThe authors acknowledge financial support from the European Commission through the project IQubits (Call: H2020–FETOPEN–2018–2019–2020–01, Project ID: 829005) and fruitful discussions with M. G. A. Paris.\n\n\n\n\n\n§ NUMERICAL EVALUATION OF THE QFI VIA THE EXTENDED HELLMANN-FEYNMAN THEOREM\n\n\n\nThe evaluation of the QFI for a parameter-dependent state | ψ_λ⟩ requires the evaluation of the state derivative, | ∂_λψ_λ⟩. Here, the unknown parameter is the charge distance from the origin (λ=D), but the discussion that follows is more general. Each state | ψ_λ⟩ is obtained by numerically diagonalizing the Hamiltonian, for each value of λ. The state | ψ_λ⟩ is thus given with a global phase factor (gauge) that is fixed randomly, i.e. without any defined or user-controlled relation with the phase assigned to the state | ψ_λ'⟩, resulting from another diagonalization. In order to compute the derivative | ∂_λψ_λ⟩ via, e.g., the finite-differences method, one should perform two numerical calculations at the values λ±δλ / 2, for sufficiently small values of δλ, and then fix the gauge in order to remove the random non-derivable global phase. One possible choice would consist in requiring that the scalar product of the state of interest with a fixed reference (basis) state is real. Then, one can compute the derivative\n\n    | ∂_λψ_λ⟩≈| ψ_λ+δλ / 2> - | ψ_λ-δλ / 2>/δλ .\n \nAlthough well-defined, this procedure has two drawbacks: (1) it requires two numerical calculations for each value of λ, and (2) in practice, the result might depend on δλ and, ultimately, be inaccurate. In fact, if δλ is too large, then Eq. (<ref>) is not a good approximation of the derivative. Instead, if it is too small, the derivative is given by the ratio between two very small numbers, which might be prone to significant numerical noise. \n\n\n\n\nTo avoid this problem, we apply the extended Hellmann-Feynman theorem <cit.>, whose statement can be summarized as follows. Let us consider the Schrödinger equation ℋ̂ | ψ_n ⟩ = e_n | ψ_n ⟩, where the Hamiltonian, its eigenstates and eigenvalues depend on the parameter λ. Then, the following relations hold:\n\n    ∂_λ e_n = ℋ'_n,n ,\n\nand\n\n    | ∂_λψ_n ⟩ =  i w_n | ψ_n ⟩ + ∑_m ≠ nℋ'_m,n/e_n - e_m  | ψ_m ⟩ ,\n\nwhere ℋ'_m,n≡⟨ψ_m | ( ∂_λℋ̂ ) | ψ_n ⟩, while w_n is an undetermined real number. By an appropriate choice of the overall phase of state | ψ_n ⟩, w_n can be set to zero, even though this is not required in what follows.\n\nThe advantage of the present approach lies in the fact that it does not require to perform and combine the results of two independent numerical calculations, and avoids the above mentioned drawbacks. In fact, the derivative with respect to λ is only applied to the Hamiltonian, which is a known analytical function of the parameter, and can thus be computed by performing calculations for a single value of λ. In particular, the numerical evaluation of the QFI for the ground state (n=1) can be performed by combining Eq. (<ref>) and Eq. (<ref>). The result is\n\n    H = 4 ∑_m ≠ 1ℋ'_1,mℋ'_m,1/(e_m-e_1)^2 ,\n\nindependent of w_n. \nIn calculating the QFI with Eq. (<ref>), one should only take care that the sum converges. While it might seem that the convergence of the sum requires convergence on the calculation of the excited states (and thus the expansion of the Hamiltonian on a large basis set), we have verified that in practice only the convergence of the ground state is required. \n\n\nIn order to compute the QFI for the state generated by the Rabi and Ramsey experiments, one needs to numerically evaluate the D-derivatives of the Larmor and Rabi frequencies. We use the extended Hellmann-Feynman theorem for this purpose as well. The derivative of the Larmor frequency is obtained by applying Eq. (<ref>):\n\n    ∂_D ω_ L = 1/ħ(  ℋ'_2,2   - ℋ'_1,1)  .\n\nThe derivative of the Rabi frequency, instead, requires the application of Eq. (<ref>), which yields:\n\n    ∂_D ω_ R = | δ E_0 | /ħ |z_1,2|    Re( z_1,2∑_m ≠ 2ℋ'_2,m/e_2 - e_m z_m,1. \n       .      +   z_2,1∑_m ≠ 1ℋ'_1,m/e_1 - e_m z_m,2)  ,\n\nwhere\nz_m,n≡⟨ψ_m | ẑ | ψ_n ⟩.\nThis procedure can be applied to the numerical calculation of analogous differential quantities, corresponding to the derivative with respect to λ of diagonal or off-diagonal matrix elements.\n\n\n\n§ TUNNELING PARAMETER AND ENERGY LEVELS IN THE HUBBARD MODEL\n\n\n\n\n\n\nIn the absence of external charge and magnetic field, the gap δ_3,1 = e_3 - e_1 between the lowest Kramers doublets is identified with the corresponding energy gap in the solutions of the Hubbard model, given by 2 |t| as mentioned in Subsec. <ref>. In general, the tunneling parameter is expected to decrease exponentially under a linear increase of the barrier height between the two dots, due to the exponential decay of the dot-localized envelope functions at each side of the barrier. For the potential that we have used, Eq. (<ref>), the barrier height is V_ DQD( 0) = κ a^2 / 8, quadratic in a. It is thus reasonable to try and fit the dependence on a of the energy gap obtained from the diagonalization of the 𝑘· 𝑝 Hamiltonian by means of the function\n\n    f_3,1(a;t_0,γ) = 2 t_0  e^- γ a^2 ,\n  \nwhere the parameters t_0∈ℝ^+ and γ are determined using the method of non-linear least-squares. As shown in Fig. <ref>, the fitting can indeed reproduce the dependence of the gap on the interdot half distance with a high degree of accuracy in a significant range of values.\n\nGiven the functional dependence of the tunneling parameter on the interdot half distance, one can also analytically express the energy levels and the quantum Fisher information as a function of a. The QFI derived from the Hubbard model is shown to reproduce qualitatively the behavior of the one derived from the multiband approach (Sec. <ref>). The same applies to the energy levels and to the gap between the ground and first excited levels. \nFigure <ref>(a) shows the energies e_±^Hub obtained from Eq. <ref> in the presence of an external charge, after identifying the hopping parameter δ_3,1 for each given a with the t_0  e^- γ a^2. The corresponding energy gap e_+^Hub-e_-^Hub is shown in Fig. <ref>(b), for different values of D. The comparison between these results and those reported in Fig. <ref> shows that the Hubbard model also qualitatively reproduces the behavior of the energy levels obtained from the six-band calculations.\n\n\n\n§ EFFECT OF QUBIT DECOHERENCE ON THE RAMSEY MEASUREMENT\n\n\n\n\n\nThe precision that one can achieve in the Ramsey scheme is limited by the environment-induced decoherence that affects the qubit during the free evolution time τ. For the sake of simplicity, we assume here that the environment acts as a depolarizing channel <cit.>, \nwith depolarization probability p=1- e^-( τ  / T_2^* )^2, and that the pulse duration T is much shorter than T_2^*, so that the time evolution during the application of the pulses can be regarded as coherent. Therefore, if | ψ⟩ is the qubit state in the absence of decoherence, the state density matrix at the end of the free-evolution interval in the presence of decoherence reads\n\n    ρ̂  =  e^-    ( τ  / T_2^* )^2  | ψ⟩⟨ψ |  +  1 -  e^- ( τ / T_2^* )^2 /21̂ .\n\nThe application of the second pulse induces an approximately unitary evolution, which leaves unaffected the contribution proportional to the identity operator. As a result, the final population difference between the two basis states, χ = p_0 - p_1, is entirely due to the first contribution in Eq. (<ref>), and is thus related to the corresponding quantity in the coherent case by the relation: χ = χ_ coh e^-( τ  / T_2^* )^2. From this, from Eq. (<ref>), and from the relation p_1=(1-χ)/2, it follows that \n\n    F  =    ( χ'_ coh)^2/ e^ 2  ( τ  / T_2^* )^2   - χ^2_ coh .\n\nIf the environment acts as a phase-flip channel (pure dephasing), its effect on the final occupation probabilities of the qubit state, and thus on the Fisher information, is slightly different. In particular, the dephased component of the density operator ρ̂ does not include the dependence on ω_L resulting from the free evolution, but it still contains a dependence on the Rabi and Larmor frequencies related to the qubit time evolution during the application of the pulses. However, as discussed in Section <ref>, this represents a minor contribution to the Fisher information in view of the fact that τ≫ T. \n\nIn order to highlight the effect of decoherence on the final occupation probability p_1 and on the Fisher information, in Fig. <ref> we plot these quantities in the case of a fully coherent evolution (T_2^*→∞) and for decreasing values of T_2^*. All quantities are shown as a function of the charge distance D and the waiting time τ, for a DQD with half-distance a=12nm, while pulse duration T is fixed in each case to the corresponding value of T_ Ramsey (defined in the main text). The probability p_1, coh [Fig. <ref>(a)] displays similar features to those obtained in the presence of decoherence [Fig. <ref>(c,e,g)], with a contrast in the oscillations which increases with T_2^*. As to the Fisher information, the maxima progressively move from the region of small τ, for the smallest value of the decoherence times [panel (h)], to the one of large τ in the coherent case [panel (b)]. Correspondingly, the evidence of the oscillations as a function of D decreases, resulting in a qualitative difference between the behaviors in the presence and in the absence of decoherence.\n\nWe finally report the expression of the oscillating prefactor that appears in the approximate expression of F_ Ramsey, given in Eq. (<ref>):\n\n    C = [cos(Δτ/2) - sin(Δτ/2) Y ]^2 [ cos(Δτ/2)   Y     + sin(Δτ/2)         ]^2       / e^2 ( τ / T_2^* )^2  - \n    { 1-2 X^2 [  cos(Δτ/2) - sin(Δτ/2) Y ]^2}^2 .\n\n\n\n\n"}