{"entry_id": "http://arxiv.org/abs/2303.07157v1", "published": "20230313143249", "title": "An elementary method to compute equivariant convolutional kernels on homogeneous spaces for geometric deep learning", "authors": ["Vincent Knibbeler"], "primary_category": "math.RT", "categories": ["math.RT", "cs.AI", "53Z50 (Primary) 68T07, 16Z05, 43A85 (Secondary)"], "text": "\n\n\n\n\nWe develop an elementary method to compute spaces of equivariant maps \nfrom a homogeneous space of a Lie group to a module of this group. \nThe Lie group is not required to be compact. \nMore generally we study spaces of invariant sections \nin homogeneous vector bundles, and take a special interest \nin the case where the fibres are algebras. \nThis latter case has a natural global algebra structure. \nWe classify the resulting automorphic algebras \nfor the case where the homogeneous space has compact stabilisers.\nThis work has applications in the theoretical development of \ngeometric deep learning and also in the theory of automorphic Lie algebras. \n\n\nQuantum estimation of a charge distance from a hole-spin qubit in Si quantum dots\n    Filippo Troiani^2\n    March 30, 2023\n=================================================================================\n\n\n\n\n\nMathematics Subject Classification:\n53Z50, \n68T07, \n16Z05, \n43A85, \n\n\n\nKeywords:\ngeometric deep learning, equivariant convolutional kernels, automorphic Lie algebras, homogeneous space, geometric Frobenius reciprocity\n\n\n\n§ INTRODUCTION\n\n\nLet G be a Lie group and X a homogeneous space of G. That is, a smooth manifold with transitive G-action: for any two points x_0,x∈ there exists g∈ G with g x_0=x. Let V be a representation of G and denote the space of G-equivariant maps → V by \n\n    GV={K:→ V | K(gx)=gK(x) ∀ g∈ G, ∀ x∈}.\n\nWe develop an elementary method to compute this space. More generally, for any closed subgroup H of G and representation W of H we compute the G-invariant sections of the homogeneous vector bundle G×_H W over G/H, as we explain in detail in Section <ref>. \nIn Section <ref> we replace V by an algebra  with compatible G-module structure, and study the algebra\n\nof -equivariant maps →.\n\nThis investigation is motivated on one hand by recent developments of geometric deep learning, and on the other hand by the expanding horizons of research on automorphic Lie algebras.\nThe connection between these two topics has not been studied so far, but they are dealing with closely related problems.\n\nThis paper can be read without knowledge of deep learning and automorphic Lie algebras, because we only tackle the differential geometric problem described above. Nonetheless we give a brief description of the two areas in this introduction and explain why they motivate our objective. One can skip to Section <ref> from here. \n\n\n\nArtificial intelligence is currently developing at a rapid pace and there is a great need for mathematics in this field, as is explained in the recent survey article by Kutyniok <cit.>. A particular challenge where researchers are looking to mathematics for answers is the search for good architectures of deep neural networks. One approach to this problem is the highly active field of geometric deep learning.\n\nTwo surveys articles on geometric deep learning appeared in May 2021, by Bronstein, Bruna, Cohen and Veličković <cit.> and Gerken et al. <cit.> and another by Weiler, Forré, Verlinde and Welling <cit.> appeared only a month later. We will not attempt to provide an overview of the literature but simply refer to the combined literature reviews in these three works, which we would not be able to improve. We do mention however the paper of Cohen, Weiler, Kicanaoglu and Welling <cit.> and Cheng et al. <cit.>, which highlight the importance of convolution with equivariant kernels. These papers inspired this research: we compute spaces of equivariant kernels.\n\nWe start our slightly longer summary of the geometric deep learning that motivated this paper with\nCohen, Geiger and Weiler's description of equivariant convolutional networks on homogeneous spaces <cit.>. The features of such convolutional networks are sections of homogeneous vector bundles G×_H V, which can be presented as maps f:G→ V such that f(gh)=h^-1f(g) for all h∈ H (see Section <ref> for more details). \nThe authors use the fact that cross-correlation\non the group\neq:cross(κ⋆f)(g)=∫_Gκ(g^-1h)f(h)h\nis equivariant under the group G in the sense that\n\n    κ⋆ (u· f)=u· (κ⋆ f),  ∀ u∈ G,\n \ngranted that h is a left-invariant measure on G[cross-correlation is sometimes called convolution in the literature, although the term convolution is classically reserved for the operation (κ∗ f)(g)=∫_Gκ(gh^-1)f(h) h, which is not G-equivariant.]. The map κ:G→(V ,V_out) is called the kernel, or the filter, and the group acts as u· f=f∘ u^-1.\nThe main result of <cit.> shows that κ⋆ takes sections of G×_H V_in to sections of G×_H V_out if and only if κ descends to a section of the homogeneous vector bundle G×_H× H(V_in,V_out) defined by the right action of H× H on G×(V_in,V_out) given by (g,m)·(h_1,h_2)=(h_2^-1 g h_1, ρ_out(h_2)^-1 m ρ_in(h_1)).\n\nGeometric deep learning developed further in \nthe papers by Cohen, Weiler, Kicanaoglu and Welling <cit.> and Cheng et al. <cit.> where one considers convolutional networks on manifolds M in general, rather than homogeneous spaces specifically. This adds another level of abstraction that we briefly describe. \nFor a comprehensive treatment, we refer to <cit.>.\n\nLacking a transitive group action on a manifold M, one has to find another way to move a filter over the manifold. The solution proposed in <cit.> is to use parallel transport.\n\nThe i-th feature space is the space of sections Γ_i of a vector bundle π_i:E_i→ M. \nFeatures f_i are elements of Γ_i.\nThe kernel is defined by a map\n\n    K:T_x^*M→(π_in^-1(x^*), π_out^-1(x^*))\n\non the tangent space of M at the point x^*, and the convolution is then defined by  an integral of the form\neq:convolution\n(K∗f_in)(x)= ∫_B⊂T_x^*M  K(v) f_in|_exp_x v(x)  ^d v\nwhere f_in| _exp_x v(x) \nis the parallel transport of f_in(exp_x v)\nalong the geodesic from exp_x v to  x, and d the dimension of M.\n\nThe tangent space T_x^*M is isomorphic to R^d. A family of such isomorphisms parametrised by M is called a gauge. A choice of gauge allows us to consider the kernel as a map\n\n    K: R^d →(V_in, V_out)\n\nwhere we keep notation light by using the same letter K, and renaming the fibres.\n\nBecause the choice of gauge is arbitrary, convolution has to be invariant under any gauge transformation in the structure group G⊂(d, R). The action of the structure group on the feature spaces is denoted ρ_in:G→(V_in) and ρ_out:G→(V_out). Weiler et al. <cit.> show that the convolution is invariant under gauge transformations if an only if\n\n    K(g v)=(g)^-1 ρ_out(g) K(v)ρ_in(g)^-1,   g∈ G,   v∈ R^d.\n\nCheng et al. <cit.> show that if the maps Γ_in→Γ_out between feature spaces satisfy some reasonable conditions, then they are of the form (<ref>).\n\nWe propose to compute the space of G-equivariant kernels K on R^d by considering the G-orbits in R^d separately. Although it is not always a trivial task to combine the results on these orbits in order to describe the kernels on R^d, the advantage is that the computation of equivariant kernels on the orbits, homogeneous spaces , can be done with simple methods that work equally well for noncompact groups as for compact ones.\n\nTherefore we will be looking for the G-equivariant maps → V where V=^*⊗ V_out⊗ V_in^*. \nThe special case ⊗ V_in=V_out comes with an associative algebra structure (matrix multiplication) and is therefore most interesting to us (the case V_in=V_out also allows the use of biases in neural networks and this case is highlighted in the discussion of <cit.> due to interesting analogies in physics).\n\nTo ensure the integrals (<ref>) and (<ref>) are finite, the kernels are often required to have compact support. We want to study equivariant kernels for noncompact groups G, which do not have compact support, so we do not impose this condition. The reader interested in convolution is advised to keep this in mind.\n\n\n\nAutomorphic Lie algebras were introduced in relation to integrable systems in mathematical physics by Lombardo and Mikhailov <cit.>. They are Lie algebras of meromorphic maps from a Riemann surface  into a finite dimensional Lie algebra g which are equivariant with respect to a group Γ acting discretely on  and on g by automorphisms, and have some restriction on the poles. The best known examples are the twisted loop algebras \n\n    L( g, σ, m)={f: C^∗→ g  Laurent polynomial | f(e^2π i/m z)=σ f(z)}\n\nwhere σ is an automorphism of order m of the Lie algebra g. Twisted loop algebras are used in concrete realisations of affine Kac-Moody algebras. These are however somewhat misleading examples because they are the only simple automorphic Lie algebras due to the landmark papers by Kac and Mathieu <cit.>: loop algebras are highly exceptional.\n\nThe algebra of Onsager <cit.> gives a better impression of the nature of the topic. In the original work of Onsager, it is not at all obvious that this Lie algebra O fits in the framework of automorphic Lie algebras, but Roan showed that this is indeed the case <cit.>, with the construction of an isomorphism\n\n    O≅{f: C^∗→[2]   Laurent polynomial | f(z^-1)=σ f(z)}\n\nwhere [2] is the Lie algebra of traceless complex 2× 2 matrices and σ is an order 2 automorphism thereof. The Onsager algebra is not simple, the commutator subalgebra [ O,  O] is a nontrivial ideal. The involved action of the 2 element group on C^∗  given by z ↦ z^-1 has nontrivial stabilisers at z=1 and z=-1. The automorphic Lie algebra evaluates to a lower dimensional algebra at these points than elsewhere. This is the more typical situation. In fact, many automorphic Lie algebras with [2] as target Lie algebra are isomorphic to the Onsager algebra, even if the involved group actions are more complicated. Examples abound in <cit.>.\n\n\nBefore the recent work of Lombardo, Veselov and the author <cit.>, the groups Γ used in the construction of automorphic Lie algebras had been finite. The successful study of algebras of [2]-equivariant matrices shows that the infinite discrete groups are in reach, and there is an optimism that we can start to understand automorphic Lie algebras in various geometries.\nA first step in this direction, studied in this paper, is to simplify the situation to the case of continuous (Lie) groups (which contain the desired discrete groups) and their homogeneous spaces. This enables us to obtain subalgebras of the desired automorphic Lie algebras.\n\n\nThere are methods to compute invariants of discrete groups from other invariants, such as transvection <cit.>, Rankin-Cohen brackets and modular derivatives <cit.>. These methods have been proven effective in the development of automorphic Lie algebras by Lombardo, Sanders and the author <cit.> and Lombardo, Veselov and the author <cit.>, but they do have a weakness: you need an invariant to start with, before you can compute more of them. The subalgebras of automorphic Lie algebras that can be computed with the method of this paper provide a starting point for discrete methods and further study of automorphic Lie algebras in new geometries.\n\n\n\nVarious examples have been selected to illustrate the theory and inspire further development of geometric deep learning and automorphic Lie algebras.\n\n\n\n\n§ INVARIANT SECTIONS OF HOMOGENEOUS VECTOR BUNDLES\n\n\nThroughout this section, let  be a homogeneous space of a Lie group G, and V a representation of G. Our main practical contribution is this\n\nElementary method to compute all G-equivariant maps → V.\n\n\n\n\n  1 Choose a base point x_0∈.\n\n  2 Determine H G_x_0={g∈ G | g x_0=x_0}.\n\n  3 Find a map f:→ G such that f(x)x_0=x. \n\n  4 Compute a basis {v_1,…,v_n} for the invariants V^H.\n\n\n\nThe maps x↦ f(x)v_1,…,x↦ f(x)v_n constitute a basis for GV.\n\n\n\nA few comments are in order. \nIf f:→ G is such that f(x)x_0=x then x↦ f(x)H is an isomorphism → G/H. Existence of this map is equivalent to transitivity of the action of G on . It is well known that such a map can be chosen to be smooth near any point, but in general there is no such map that is globally smooth[There is a smooth map f:→ G such that f(x)x_0=x if and only if the H-bundle G→ is isomorphic to the trivial bundle × H→. Indeed, given such f, one can construct a map G→× H by g↦(g x_0,f(g x_0)^-1g). This is a bijection with inverse (x,h)↦ f(x)h, and hence an isomorphism of H-bundles. For the converse, suppose that ϕ:× H→ G is an isomorphism of H bundles, i.e. a smooth bijection such that ϕ(x,h)x_0=x. Then we can define a smooth map f:→ G is such that f(x)x_0=x by f(x)=ϕ(x,1).]. \n\nIt is not well known how to find a map like f and we are in fact not aware of a general method to tackle this problem. Luckily it is easy to do for many of the cases that appear in geometric deep learning applications. It is for instance trivial for Euclidean spaces n≅(n)/(n) and for spherical spaces n≅(n+1)/(n) it can be solved with the Gram-Schmidt process. For hyperbolic spaces we did not find a general approach. The 2-dimensional case is simple enough and for the 3-dimensional case we present an ad hoc solution in Example <ref>.\n\nThe computation of the invariants V^H is simplified by moving to the Lie algebra level. That is, one determines a basis B for the Lie algebra h of the Lie group H and solves the system of linear equations h v=0 for v∈ V and h∈ B. The complicating factor of this step is that the dimension of V can be very large in deep learning applications. Finzi, Welling and Wilson <cit.> approached this problem using singular value decompositions, and they made their software library publicly available.\n\nArriving at the solution, we can also see why we do not impose conditions on the maps we consider. It is the action of G that determines the properties of equivariant maps on homogeneous spaces. For example, if the action is smooth, so are the maps.\n\nBefore we prove that the method works, we give an example.\n[The hyperbolic plane 2]\n\nThe hyperbolic plane  can be realised as the space of complex numbers τ=x+iy with positive imaginary part, y>0. The group (2,R) acts transitively on  by Möbius transformations \n    [ a b; c d ]·τ=aτ+b/cτ+d.\n\nIf we let (2,R) act on (R^2) by conjugation then we can define the space of (2,R)-equivariant maps →(R^2). This example fits in the setting above with =, =(2,R) and V=(R^2). To see this, we must check that (2,R) can take one point in , say i, to an arbitrary point τ=x+iy∈. A group element that does this is\n\n    f(τ)=[   √(y) x/√(y);      0 1/√(y) ].\n\n\nTo carry out our method we pick a point x_0=i∈ and determine that the subgroup H of (2,R) fixing i is (2).\nThe map f defined above satisfies f(x)x_0=x, so the only part that is possibly challenging is already taken care of. It remains to compute a basis for (R^2)^(2). For instance we can take\n\n    v_1=[ 1 0; 0 1 ],   v_2=[  0 -1;  1  0 ].\n\nWe then arrive at a basis of the space of equivariant matrix-valued maps given by τ↦ f(τ)v_i f(τ)^-1, i=1,2. This first basis element is given by the identity matrix and the second reads\n\n    τ=x+iy↦[        x/y -x^2+y^2/y;        1/y       -x/y ].\n\n\nAs a bonus we have in this case a real algebra structure, where the product is the pointwise matrix multiplication. Identifying the above matrix with the imaginary unit provides an isomorphism to the algebra of complex numbers.\n\n\nWe will now proof that this computational method gives the correct answers.\nMaps → V can be identified with sections of the trivial vector bundle × V. We will generalise this set-up to homogeneous vector bundles, following Cohen et al. <cit.> and Aronsson <cit.>, which are nontrivial bundles over  defined by a representation of H rather than G, known for their role in the celebrated Borel-Weil theorem. The invariant sections of homogeneous vector bundles are easily determined. These are then mapped onto the desired space of equivariant maps → V.\n\nThe following is a standard construction of a homogeneous vector bundle (see for instance <cit.>). \nLet W be a H-module and define a right action of H on G× W by (g,v)h=(gh,h^-1v). The orbit space (G× W)/H is denoted\n\n    G×_H W.\n An element of this space is of the form [g,w]={(gh,h^-1w) | h∈ H}. Together with the projection map \n    π :G×_H W→ G/H,   [g,w]↦ gH\n this is a W-bundle over G/H. It carries a G-action given by g_1[g,w]=[g_1g,w]. This action restricts to linear maps between fibres and descends to a transitive action on G/H. The vector space Γ (G/H, G×_H W) of sections s becomes a G-module by the action \n    (g_1 s)(gH)=g_1 s(g_1^-1gH).\n\nNotice that we have started with a representation W of H and ended up with a representation of G. \n\nThese representation are commonly reformulated in the language of maps. Let  denote the maps →, where  is R or C, \nand V the maps → V. The sections of the homogeneous vector bundle G×_H W can be identified with the maps\n\n    GHW=\n    {f:G→ W | f(gh)=h^-1f(g), ∀ h∈ H, ∀ g∈ G}\n with G-action (g_1· f)(g)=f(g_1^-1 g). The sections of the trivial vector bundle G/H× V can be identified with the maps\n\n    GH⊗ V≅{f:G→ V | f(gh)=f(g), ∀ h∈ H, ∀ g∈ G}\n\nwith G-action (g_1· f)(g)=g_1 f(g_1^-1 g) (where the field  is considered as the trivial representation of H).\n\nIf G is compact then GHW is known as the representation of G induced by the representation W of H. For locally compact groups G such as the Lie groups we work with, induced representations have been defined as various subrepresentations of GHW. Mackey required functions to be L^2 (square integrable) with respect to a well chosen measure <cit.>, and Moore worked with L^1 functions <cit.>. For our simpler objective it is neither desirable nor necessary to make any of these restrictions.\n\n\n\nLet V be a representation of G and W a representation of H. Let  denote the trivial representation of H. Then\n\n    Φ:GHW→GH⊗ V,  Φ(f)(g)=gf(g)\n\nis an isomorphism of G-representations if and only if W is the restriction of V to H.\n\nLet us denote the restriction of V to H by GHV.\nSuppose that W=GHV. Then Φ(f)∈GH⊗ V whenever f∈GHW since Φ(f)(gh)=ghf(gh)=gf(g)=Φ(f)(g), so that Φ is well defined. It has an inverse given by Φ^-1(f̃)(g)=g^-1f̃(g) and the G-linearity follows from the computation \n\n    Φ(g_1· f)(g)   =Φ(f∘ g_1^-1)(g)\n    \n       =gf(g_1^-1 g)\n    \n       =g_1g_1^-1gf(g_1^-1 g)\n    \n       =g_1Φ(f)(g_1^-1 g)\n    \n       =(g_1·Φ(f))(g),\n\nwhich completes the proof of one direction.\n\nSuppose now that Φ is an isomorphism of G-modules. We show first that W=V as vector spaces. Let G=⊔_x∈g_x H and for each w∈ W define the map g_x h↦ h^-1 w, which is an element of GHW. Therefore Φ sends it to an element g_x h↦ g_x w ∈ V. Taking g_x=1 we find that W⊂ V.\nIn the other direction we have an easier construction because for each v∈ V the constant map g↦ v is in GH⊗ V. The inverse of Φ sends this map to the map g↦ g^-1v in GHW. With g=1 we see that V⊂ W.\n\nTo see that the action of H on W is such that W= GHV we write out the equivariance condition for g↦ f(g)=g^-1v in GHW while we keep track of the actions we are using with subscripts:\n\n    h·_W (g^-1·_Vv)=h·_Wf(g)=f(gh^-1)=(gh^-1)^-1·_Vv=h·_V (g^-1·_Vv).\n\nPutting g=1 we get h·_W v=h·_V v and we conclude that W=GHV.\n\n\n\n\nThe space GHW^G corresponds to the space of constant maps G→ W^H. This provides an isomorphism GHW^G≅ W^H.\n\n\nIf f∈GHW^G then f(g)=g· f(g)=f(1) hence f is constant. If f(g)=w then hw=hf(g)=f(gh^-1)=w hence w∈ W^H and f is a constant map G→ W^H. \nVice versa, any constant map G→ W^H is clearly contained in GHW^G.\n\nThe obvious isomorphisms GH≅G/H and GH⊗ V≅G/HV of representations provide an isomorphism\n\n    (GH⊗ V)^G≅GV\n\nwhere GV are the G-equivariant maps → V.\n\n\n\nLet V be a representation of G.\nThe space of equivariant maps GG/HV corresponds to the algebra of maps gH↦ gv where v∈ V^H. This provides an isomorphism GG/HV≅ V^H.\n\n\nWe map the constant maps G→ V^H that constitute GHW^G by Lemma <ref> onto GG/HV using the isomorphism Φ of Lemma <ref>.\n\nTheorem <ref> reduces the infinite dimensional problem of determining the invariants in G/HV to the finite dimensional problem to determine V^H. It finishes the proof of our method to compute equivariant convolutional kernels.\n\nThe statement of Theorem <ref> for compact groups also follows from the Frobenius reciprocity theorem as can be found in many textbooks. There is also a version of Frobenius reciprocity that allows for noncompact groups, but it is much harder to find in the literature. We found it in the excellent but advanced book by C̆ap and Slovák, <cit.>, where they describe it as a geometric version of Frobenius reciprocity, and use it to understand G-invariant geometric\nstructures on G/H.\n\nWe apply the method to a second common example.\n[The sphere 2]\nThe sphere is compact and the equivariant maps on the sphere are therefore described in the existing literature of geometric deep learning (cf. <cit.>, <cit.> and <cit.>). This makes it a good example to illustrate our alternative approach to this problem.\n\nFor convenience we will work with the homogeneous space \n    C≅(2)/(1)\n where (2)=(2)/± acts on the Riemann sphere C= C ∪{∞} by Möbius transformations, rather than the more obvious 2≅(3)/(2). Stereographic projection 2→ C takes one description to the other.\n\nThe complex irreducible representations (irreps) of (2) can be realised as \n\n    V_n= C⟨ x^n,x^n-1y, x^n-2y^2,…,y^n⟩\n\nwhere an element of g∈(2) acts on a polynomial p∈ V_n by (g· p)(x,y)=p(g^-1(x,y)). \nIf p∈ V_2m then p(-x,-y)=p(x,y) so that  V_2m is a representation of (2)/±≅(3). All irreps of SO(3) are obtained this way.\nAny complex representation of a compact group such as (2) and (3) is a direct sum of irreps.\nSee for instance <cit.> or another textbook on this topic.\n\nWe carry out our elementary method to compute (2) CV_2m.\nAs base point we choose x_0 0∈ C. The subgroup of (2) stabilising 0 is \n    H={±[ a 0; 0 a ] | a∈ C, | a| =1}.\n\nWe need a map f: C→(2) such that f(Z) sends 0 to Z. For instance, we can define[The map f is not continuous at Z=∞ but this poses no problem. A continuous solution does not exist because (2) and C×(1) are topologically inequivalent.]\n\n    f(Z)=\n    {[ ±1/√(1+| Z| ^2)[  1  Z; -Z  1 ]                          if Z∞,;               ±[  0 -1;  1  0 ]                         if Z=∞. ].\n\nOur next step is to determine V^H. In this case we quickly find that \nV_2m^H= C x^m y^m. Thus we find the solution: \n(2) CV_2m the one-dimensional space spanned by the map Z↦ f(Z)x^my^m where\n\n    f(Z)x^my^m=\n    {[ (x-Zy)^m(Zx+y)^m/1+| Z| ^2                     if Z∞,;               (-1)^mx^my^m                    if Z=∞. ].\n\n\nIt was explained in <cit.> that this problem can be solved using knowledge of spherical harmonics (see e.g. <cit.>). With our approach we do not need to know bases of spherical harmonics a priori. Such bases appear automatically in the computation, because the coefficients of an equivariant vector form a basis for the spherical harmonics. To find these coefficients we rewrite\n\n    (x-Zy)^m(Zx+y)^m/1+| Z| ^2   =\n    1/1+| Z| ^2(∑_i=0^m mi x^m-i(-Zy)^i)\n    (∑_j=0^m mj(Zx)^m-jy^j)\n    \n       =\n    1/1+| Z| ^2∑_i=0^m ∑_j=0^mmimj x^2m-i-j y^i+j\n    (-Z)^iZ^m-j\n       =\n    ∑_ℓ=0^2m  x^2m-ℓ y^ℓ[1/1+| Z| ^2∑_i+j=ℓmimj\n    (-1)^i Z^iZ^m-j]\n\nand find in square brackets a basis for the spherical harmonics of degree m.\n\n\nWe end this section with the important specialisation to tangent vector fields. \nThe tangent bundle of a homogeneous space can be studied in the framework of homogeneous vector bundles, using the isomorphism  \neq:tangent bundle\nT(G/H)≅G×_H g/h\nof vector bundles over G/H described by Sharpe in <cit.>. The symbols g and h denote the Lie algebras of the groups G and H respectively. \nCombining Lemma <ref> and (<ref>) we obtain\n\n\nThe space of G-invariant tangent vector fields on  is isomorphic to ( g/ h)^H. If H is connected then one can write ( g/ h)^H in purely Lie algebraic terms as N_ g( h)/ h where N_ g( h) is the normaliser {A∈ g | [A,B]∈ h ∀ B∈ h} of h in g.\n\nWhen H is the trivial group, Corollary <ref> reduces to the well known fact that the space of left-invariant vector fields on a Lie group is isomorphic to its Lie algebra.\n\n\n\n\n\n§ FIXED POINT SUBALGEBRAS OF HOMOGENEOUS ALGEBRA BUNDLES\n\n\nIn this section we investigate what happens when the fibres of the homogeneous vector bundles have the structure of an algebra.\n\nThroughout this section we assume that G is a Lie group and H a closed subgroup, and that  is an -algebra and H-representation and these two structures are compatible in the sense that h(aa_1)=(ha)(ha_1) for all h∈ H and a,a_1∈.\n\nGH has an algebra structure defined by (ff_1)(g)=f(g)f_1(g), where f,f_1∈GH and g∈ G. The invariants GH^G form a subalgebra.\n\nWe will take the algebra structure of GH into account and write GH to emphasize this. A subalgebra of invariants will be called an automorphic algebra. The automorphic algebra GH^G will be denoted GH.\n\nThe linear isomorphisms obtained in the previous section are algebra isomorphisms in the setting of the current section. We state the results but omit the elementary proofs.\n\n In the context of invariant sections of homogeneous bundles and equivariant maps we have  respectively the following results.\n\n\n  * The automorphic algebra GH corresponds to the algebra of constant maps G→^H. \n\n  * If G acts on  by algebra isomorphisms, then the automorphic algebra GG/H corresponds to the algebra of maps gH↦ ga where a∈^H. \n\nThis provides isomorphisms GH≅GG/H≅^H of algebras.\n\n\n\nThe isomorphism class of GH does not depend on G. The full group only plays a role in the realisation of the algebra.\n\n\n[Automorphic Lie algebras on the Riemann sphere]\n\nLombardo and Sanders classified automorphic Lie algebras on the Riemann sphere with target algebra [2] <cit.> (elements of these Lie algebras are invariants of a finite group). Their analysis starts with the observation that the map \n    C^2→[2],  [ x; y ]↦[   xy -x^2;  y^2  -xy ]\n is [2]-equivariant with respect to left multiplication on C^2 and the adjoint action (conjugation) on [2].\n\nWe recover this observation with the approach of this paper, where we consider C^2∖{0} as  [2]-space. The stabiliser of x_0[ 1; 0 ] is \n\n    A={[ 1 b; 0 1 ] | b∈C}=e^C[ 0 1; 0 0 ].\n\nA map f:C^2∖{0}≅[2] with f(x)x_0=x is given by \n\n    [ x; y ]↦[      x -y/r^2;      y  x/r^2 ],   r^2=x^2+y^2.\n \nand provides an isomorphism C^2∖{0}≅[2]/A.\n\nThe space of A-invariants in [2] is spanned by [ 0 1; 0 0 ]. Hence, by Theorem <ref>, the space of  [2]-equivariant maps C^2∖{0}→[2] is spanned by \n\n    [ x; y ]↦([      x -y/r^2;      y  x/r^2 ])[ 0 1; 0 0 ]=[  -xy  x^2; -y^2   xy ].\n\n\nTheorem <ref> is not necessary to compute this example. For example, if V_n is the irreducible representation of [2] with highest weight n, then we know from representation theory that we have the isomorphisms of [2]-modules\n\n    (V_n)≅ V_n⊗ V_n^∗≅ V_n⊗ V_n≅ V_2n⊕ V_2n-2⊕…⊕ V_0.\n With Schur's lemma we can then see that there is precisely one equivariant map C^2∖{0}→gl(V_n) of homogeneous order 0, 2, 4, …, 2n, up to multiplicative constant, and these can be computed by brute force. It is however difficult to say anything about the algebra structure of this space based only on the representation theory of [2]. Here we find the value of Theorem <ref> for this example, as it shows that the solution space is conjugate to the space of A-invariants.\n\nIf we define the nilpotent operator E for a representation ρ_n:[2]→(V_n) by \n    E=ρ_n[ 0 1; 0 0 ]\n then any power of E is fixed by A (because ρ_n(A)=e^ C E and (e^ c E)E^n=e^ c (E)E^n=E^n). Moreover, the minimal polynomial of E is λ^n+1, thus \n\n    gl(V_n)^A=C[E]≅C[T]/(T^n+1),\n and we have an isomorphism \n    C[T]/(T^n+1)→[2]C^2∖{0}gl(V_n)\n of algebras\ngiven by\n\n    T↦[[ x; y ]↦(ρ_n[      x -y/r^2;      y  x/r^2 ]) E].\n\nThis cyclic algebra is of course a subalgebra of any automorphic Lie algebra defined by restricting the above actions of [2] to one of its subgroups.\n\nIf we replace V_n by a reducible representation U then the algebra gl(U)^A is no longer abelian.\n\n\nIn the context of convolutional networks, the target representations are spaces of real matrices. \nIn the context of automorphic Lie algebras we are interested in target spaces with algebra structures. For this reason we will emphasize the intersection of these special cases, where W==(U). When we involve the algebra structure, we will write gl(U) instead of (U).\n\nDue to the Skolem-Noether theorem we know than any automorphism of gl(U) is inner, i.e. of the form m↦ r m r^-1 for some r∈(U). Hence any homomorphism ρ:H→gl(U) is of the form ρ(h)m=σ(h)mσ(h)^-1 where σ is a homomorphism H→(U), that is, a projective representation of H.\n\nRecall that the endomorphism ring of an irrep is a division ring due to Schur's lemma, and that a real division ring is isomorphic to either the real numbers R, the complex numbers C or the quaternions H due to Frobenius' theorem. Real irreps are said to be of real type, complex type or quaternionic type accordingly. Combining these facts with the complete reducibility of representations of compact groups we obtain the following corollary of Lemma <ref>.\n\nLet K be a compact subgroup of G and let U be a real projective representation of K. Then there is an isomorphism of algebras \n    GKgl(U)≅⊕_rgl(r, R)⊕⊕_cgl(c, C)⊕⊕_hgl(h, H)\n where r ranges over the multiplicities of projective K-irreps in U_C of real type, c ranges over the multiplicities of conjugate pairs of projective K-irreps in U_C of complex type, and h ranges over the multiplicities of pairs of projective K-irreps in U_C of quaternionic (or symplectic) type.\n\nWe refer to Bourbaki <cit.> for a general method to determine the type of an irrep of a simple Lie algebra.\n\n[Common compact stabilisers] All two- and three-dimensional model geometries in the sense of Thurston <cit.> have compact stabilisers K with connected component isomorphic to the trivial group or (2) or (3). The hyperbolic, spherical and Euclidean geometries n, n and n have stabilisers (n) in their isometry groups and stabilisers (n) in their orientation preserving isometry groups.\nThese cases are therefore expected to be most common in applications and deserve special attention.\n\nThe group (2) has only one irrep of real type: the trivial representation. All nontrivial irreducible projective representations of (2) are of complex type. Hence \n    G(2)gl(U)≅gl(r, R)⊕⊕_cgl(c, C)\n where r= U^(2), cf. Example <ref>.\n\nThe irreducible projective representations of (3) correspond to the irreps of its double cover (2). There is precisely one irrep of (2) of any finite dimension. It is of real type when the dimension is odd (and the representation descends to a representation of (3)) and of quaternionic type if the dimension is even, so that\n\n    G(3)gl(U)≅⊕_rgl(r, R)⊕⊕_hgl(h, H).\n\n\n\n[Quaternions]\n\nLet V_1 be the natural representation of (2) of 2 complex-dimensions. It is of quaternionic type. Hence V_1⊕ V_1 has a basis in which (2) is represented by matrices with real entries. Let U be the corresponding (4 real-dimensional) representation. Then gl(U) is a real representation of (2)/±≅(3) (and of its extensions). We write down a basis for gl(U)^(3) to confirm it is isomorphic to the quaternions. \n\nWith the embedding C^∗↦(2,C) given by a+bi↦[  a  b; -b  a ] we construct real matrices\n\n    ρ_U([  a+bi -c+di;  c+di  a-bi ])=\n    [  a  b -c  d; -b  a -d -c;  c  d  a -b; -d  c  b  a ]\n\nfor the representation ρ_U:(2)→(U).\nThe matrices that commute with the image of this representation are spanned by the identity matrix and \n\n    I=[  0 -1  0  0;  1  0  0  0;  0  0  0 -1;  0  0  1  0 ],  \n    J=[  0  0 -1  0;  0  0  0  1;  1  0  0  0;  0 -1  0  0 ],  \n    K=[  0  0  0 -1;  0  0 -1  0;  0  1  0  0;  1  0  0  0 ].\n\nThese matrices satisfy I^2=J^2=K^2=IJK=- and provide the isomorphism gl(U)^(3)≅ H.\n\n\n[Hyperbolic space]\n\nIn this example we will compute the algebra of maps from hyperbolic 3-space to the algebra of matrices gl(U) from Example <ref>, which are equivariant under the Lorentz group, and exhibit its isomorphism to the quaternion algebra.\n\nHyperbolic 3-space 3 will be identified with the hyperboloid model;\n\n    3={(t,x,y,z)∈ R_≥ 1× R^3 | -t^2+x^2+y^2+z^2=-1}\n\na component of a level set of the quadratic form \n\n    Q(t,x,y,z)=-t^2+x^2+y^2+z^2.\n\nThe group of linear transformations preserving Q is denoted (1,3) and corresponds to the group of automorphisms of 3. The connected component G^+(1,3) containing the identity  acts transitively on 3 (as we will find below) and the stabiliser subgroups are isomorphic to (3).\n\nThere is an isomorphism of real Lie groups between ^+(1,3) and (2, C), which can be understood using the Weyl representation that we now describe.\nThe space of 2× 2 hermitian matrices of determinant 1 has two connected components distinguished by the sign of the trace. Its component of matrices with positive trace is in one-to-one correspondence with Hyperbolic space by the map\n\n    ϕ:(t,x,y,z)↦ A=[  t+z x-iy; x+iy  t-z ].\n\nThe group (2, C) acts on this space by \n    [g]A=gAg^*\n where g^* is the conjugate transpose of g (it is easy to see that gAg^* is hermitian and has determinant 1. To argue that its trace is positive we can use the fact that [2] is connected, so that gAg^* is in the same connected component as A ^*=A). When this action of (2, C) is translated to 3 using ϕ one finds an isomorphism (2, C)→^+(1,3). We will continue this example using the Weyl representation.\n\nWe choose a base point x_0 (1,0,0,0)∈3. Its stabiliser is H(2). To find a map f:3→(2, C) such that f(x)x_0=x, we need to solve \neq:Lorentz\ngg^*=A\nfor g∈(2, C). \nSince A is hermitian, we can write it as \n    A=PDP^*\n with D=(λ^+,λ^-) where \n    λ^±=t±√(t^2-1)\n are the eigenvalues of A and P∈(2) (uniquely defined up to right multiplication by (ζ,ζ^*), ζ∈(1)).\nWe then find a solution to (<ref>) given by \n    g=P√(D)P^*\n where √(D) is defined as (√(λ^+),√(λ^-)), and hence an explicit isomorphism \n    3→(2, C)/(2),   (t,x,y,z)↦± g (2).\n The matrix g thus constructed reads\neq:g\ng=1/√(2)√(t+1)[ t+1+z  x-iy;  x+iy t+1-z ].\n\n\nLet us write down a basis for the automorphic algebra  (1,3)^+3gl(U) where U is the representation defined in Example <ref> in which we computed a basis {1,I,J,K} for gl(U)^(3). \n\nThe group element (<ref>) acts on U with the matrix\n\n    ρ_U(g)=1/√(2)√(t+1)[ t+1+z     0     x    -y;     0 t+1+z     y     x;     x     y t+1-z     0;    -y     x     0 t+1-z ]\n\nand on gl(U) by conjugation with this matrix. Applying g to I,J and K respectively yields\n\n    I   =([  0 -1  0  0;  1  0  0  0;  0  0  0 -1;  0  0  1  0 ]),\n    \n     J\n       =([    x    y -t-z    0;    y   -x    0  t+z;  t-z    0   -x    y;    0 -t+z    y    x ]),\n    \n     K   =([   -y    x    0 -t-z;    x    y -t-z    0;    0  t-z   -y   -x;  t-z    0   -x    y ]).\n\nTogether with the identity matrix, these form a basis for (1,3)^+3gl(U) due to Theorem <ref>. The quaternion algebra can thus be presented by matrix-valued functions on hyperbolic space equivariant under the Lorentz group.\n\n\nBogatskiy et al. <cit.> designed a Lorentz group equivariant network to be used for the study of particle physics. The equivariance is incorporated as another learning task in this network, rather than being hard wired.\n\n\n\n\n§ DISCUSSION\n\n\nWe have described how the problem of computing all vector-valued equivariant maps on a homogeneous space can be reduced to finite dimensional linear algebra with a geometric version of Frobenius reciprocity. \n\nIf G is compact then one can take the alternative approach of Fourier analysis to find the invariants. Representations of compact groups are completely reducible, so that L^2() and V decompose into irreps, and each pair of isomorphic irreps in these respective modules gives rise to one invariant in L^2()⊗ V≅ L^2(,V). Such an approach is presented by Lang and Weiler <cit.> and Lombardo, Sanders and the author in <cit.>.\nThe hard part of this approach is the determination of the decomposition of L^2(). For important cases the solution is readily available. E.g. the decomposition of L^2((2)) is known from classical Fourier analysis and L^2((3)/(2)) from harmonic analysis on the two dimensional sphere.\n\nThe approach presented in this paper has the advantage that G can be noncompact, Fourier analysis is not needed, irreps of G \nneed not be determined and neither do isotypical components of L^2(). \nThis simple approach is possible because the domains  considered here are G-orbits, hence any equivariant map is determined by one value, contrary to the situation of automorphic Lie algebras where /G is a Riemann surface.\nThis also shows the disadvantage of our approach. If  is not a homogeneous space, there is more work to be done.\n\nFor the study of algebra structures our construction has a second advantage: it preserves the algebra structure. For this reason there is no need to compute structure constants and find normal forms after the invariants are determined, which is one of the major challenges in the research on automorphic Lie algebras to date.\n\nAnother natural approach to solve a Lie group-invariance constraint is to start with differentiation and reduce it to a linear problem defined by the generators of the Lie algebra. Finzi, Welling and Wilson <cit.> used this approach in the context of geometric deep learning. The authors show how the resulting linear system can be effectively solved using the singular value decomposition in case the representation is finite dimensional, and they made their software library publicly available. For the infinite dimensional representation GHW considered in this paper, and commonly in geometric deep learning, the linearised problem is a system of partial differential equations. Solving this system is much harder than the method presented in this paper, and is therefore no longer practical. However, our results reduce the problem of finding G-invariants in the infinite dimensional function space to finding H-invariants in the finite dimensional representation W of H. For high-dimensional representations W the approach and software of <cit.> can be used to compute W^H and complete the computation of GHW^G.\n\nWe hope that the simplicity of the presented method, and its applicability to noncompact groups, will make it useful to the designers of convolutional neural networks with symmetries. For example, the authors of <cit.> express their interest in computing (3)-equivariant convolutional kernels on a particular homogeneous space but did not yet proceed because (3) is not compact. This should no longer be an obstacle.\n\nFurthermore, we hope that this material shall serve as a starting point for the study of automorphic Lie algebras in unexplored geometries such as hyperbolic 3-space or Siegel upper-half space, and uncover new Lie structures.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe are grateful to Jan E. Gerken, Sara Lombardo, Fahimeh Mokhtari, Jan A.  Sanders and Maurice Weiler for helpful and stimulating discussions.\n\n\n\n\n"}