{"entry_id": "http://arxiv.org/abs/2303.07155v1", "published": "20230313142903", "title": "Quantum Maximal Correlation for Gaussian States", "authors": ["Salman Beigi", "Saleh Rahimi-Keshari"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\n\nSchool of Mathematics, Institute for Research in Fundamental Sciences (IPM), P.O. Box 19395-5746, Tehran, Iran\n\n\nSchool of Physics, Institute for Research in Fundamental Sciences (IPM), P.O. Box 19395-5531, Tehran, Iran\nDepartment of Physics, University of Tehran, P.O. Box 14395-547, Tehran, Iran\n\n\n\n\tWe compute the quantum maximal correlation for bipartite Gaussian states of continuous-variable systems. Quantum maximal correlation is a measure of correlation with the monotonicity and tensorization properties that can be used to study whether an arbitrary number of copies of a resource state can be locally transformed into a target state without classical communication, known as the local state transformation problem. We show that the required optimization for computing the quantum maximal correlation of Gaussian states can be restricted to local operators that are linear in terms of phase-space quadrature operators. This allows us to derive a closed-form expression for the quantum maximal correlation in terms of the covariance matrix of Gaussian states. Moreover, we define Gaussian maximal correlation based on considering the class of local hermitian operators that are linear in terms of phase-space quadrature operators associated with local homodyne measurements. This measure satisfies the tensorization property and can be used for the Gaussian version of the local state transformation problem when both resource and target states are Gaussian. We also generalize these measures to the multipartite case. Specifically, we define the quantum maximal correlation ribbon and then characterize it for multipartite Gaussian states.\n\nQuantum Maximal Correlation for Gaussian States\n    Saleh Rahimi-Keshari\n    March 30, 2023\n===============================================\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe problem of preparing a desired bipartite quantum state from some available resource states under certain operations is of great foundational and practical interest in quantum information science. This problem has been extensively studied under the class of local operations and classical communication in the context of entanglement distillation, where two parties aim to prepare a highly-entangled state using copies of a weakly entangled state <cit.>. The optimal rate of entanglement distillation for pure states equals the entanglement entropy <cit.>, and there are mixed entangled states that are not distillable <cit.>. \n\nA more recent version of this problem is local state transformation under local operations and without classical communication <cit.>. See Figure <ref> for a precise description of the problem. This problem is highly non-trivial even if the goal is to generate only a single copy of the target state σ_A'B' \nusing arbitrarily many copies of the resource state ρ_AB. The difficulty remains even if the target state is not entangled, or even in the fully classical setting <cit.>; see also <cit.>.\n\n\nTo study the local state transformation problem we need measures of correlation that are monotone under local operations and remain unchanged when computed on multiple copies of a bipartite state. The latter crucial property is called tensorization, and is required since in local state transformation we assume the availability of arbitrary many copies of the resource state while we aim to generate only a single copy of the target. There are resource measures, based on certain free operations, for Gaussian states <cit.>, quantum coherence <cit.>, and  nonclassicality of quantum states <cit.> that satisfy the tensorization property. However, this property is not satisfied by most measures of correlation, such as mutual information and entanglement measures, which makes them inapplicable to the local state transformation problem. Quantum maximal correlation was introduced as a measure that satisfies both the monotonicity and the tensorization properties, and therefore is suitable for proving bounds on this problem <cit.>. In particular, based on these properties, one can see that local state transformation is not possible if the maximal correlation of the target state is larger than that of the resource state; see Section <ref> for more details.\n\t\nQuantum maximal correlation of a bipartite quantum state ρ_AB is defined as sup |(ρ_AB X_A^†⊗ Y_B)|, where the supremum is taken over all local operators X_A, Y_B that satisfy (ρ_A X_A) = ρ(ρ_BY_B) =0 and (ρ_A X_A^† X_A) = ρ(ρ_BY_B^† Y_B) =1. It is shown that computing quantum maximal correlation is a tractable problem for systems with a finite-dimensional Hilbert space <cit.>. However, in general, it is not clear how to calculate quantum maximal correlation for states of continuous-variable systems with infinite-dimensional Hilbert spaces, as the space of local operators X_A, Y_B becomes intractable. Of particular interest is the class of Gaussian states that are readily available in the laboratory and can be used as resource states to prepare other states.   \n\n\nIn this paper, we compute the quantum maximal correlation for Gaussian states of continuous-variable systems. This measure enables us to study the local state transform problem when either the resource state or the target state is Gaussian. In this case, we show that for Gaussian states it is sufficient to optimize over local operators X_A, Y_B that are linear in terms of phase-space quadrature operators. This turns the inherently infinite-dimensional problem of computing quantum maximal correlation into a finite dimensional one; see Theorem <ref> for the statement of our main result. Moreover, we define Gaussian maximal correlation, as a measure based on hermitian and linear local operators in terms of quadrature operators, corresponding to local homodyne measurements. This measure can be used in the Gaussian local state transform scenarios, where the target and resource states are Gaussian. In particular, this shows that copies of weakly-correlated Gaussian states cannot be locally transformed to a highly-correlated Gaussian state. This result should be compared to previous results showing that entanglement in Gaussian states cannot be distilled using Gaussian operations <cit.>.\n\nWe also generalize the quantum maximal correlation to the multipartite setting. We define an invariant of multipartite quantum states called quantum maximal correlation ribbon that, similar to the bipartite case, satisfies the monotonicity and the tensorization properties. We also show that to compute the maximal correlation ribbon for multipartite Gaussian states it suffices to restrict to local operators that are linear in terms of quadrature operators. \n\n\n  \n\n\n\nStructure of the paper:  In Section <ref>, we review the notion of quantum maximal correlation from <cit.>. In Section <ref>, we review the definition of Gaussian states and some of their main properties. We note that the objective function in quantum maximal correlation is a bilinear form which can be thought of as an inner product. Then, to compute maximal correlation it would be useful to find orthonormal bases for the space of local operators X_A, Y_B. Following this point of view, Section <ref> is devoted to introduce such an orthonormal basis for Gaussian states which might be of independent interest. Results of this section will be used to prove our main result in Section <ref>. We introduce the Gaussian maximal correlation in Section <ref>. Considering examples of Gaussian states in Section <ref>, we further illustrate various features of these correlation measures. We also generalize the definition of maximal correlation for multipartite states in Section <ref> by introducing the quantum maximal correlation ribbon. We show that maximal correlation ribbon satisfies the monotonicity and the tensorization properties, and compute it for multipartite Gaussian states. Detailed proofs of the results in the multipartite case are left for the appendices. We conclude the paper in Section <ref>.\n\n \n\n\n\n§ REVIEW OF QUANTUM MAXIMAL CORRELATION\n\n\nGiven a bipartite probability distribution p_AB, its maximal correlation is defined as the maximum of the Pearson correlation coefficient over all functions of random variables A and B <cit.>. That is, the classical maximal correlation is given by[In the classical literature, maximal correlation is usually denoted by ρ. Here in the quantum case, following <cit.>, we save ρ for density matrices and denote maximal correlation by μ.]\n\n    μ(A, B) = sup[f_A g_B],\n\nwhere the supremum is taken over all real functions f_A and g_B with zero mean and unit variance, i.e., [f_A]=[g_B] =0 and [f_A^2] = [g_B^2]=1. The classical maximal correlation is zero if and only if the two random variables are independent, and equals one if they have a “common bit,\" meaning that there are non-trivial functions f, g such that f(A)= g(B).\n\nMaximal correlation for Gaussian distributions is first computed in <cit.>. The main result of <cit.> is that in the computation of maximal correlation for a Gaussian distribution p_AB over ℝ^2, it suffices to restrict the optimization in (<ref>) to functions f_A and g_B that are linear in A and B, respectively. Based on this, there are essentially unique choices of linear functions f_A and g_B and then μ(A, B) for such a Gaussian distribution p_AB equals\n\n    μ(A, B) =|Cov[A,B]|/√(Var[A]Var[B]),\n\nwhere Cov[A,B]=[A B]-[A][B] and Var[A]=Cov[A,A] is the variance.\n\nMaximal correlation in the quantum case can be defined by replacing functions in Eq. (<ref>) with  local operators <cit.>. Given a density operator ρ_AB describing the joint state of a bipartite quantum system, quantum maximal correlation is defined as\n\n    μ(A, B) := sup_X_A, Y_B    |(ρ_AB X_A^†⊗ Y_B)|\n        (ρ_A X_A) = ρ(ρ_BY_B) =0,\n        (ρ_A X_A^† X_A) = ρ(ρ_BY_B^† Y_B) =1,\n\nwhere the supremum is over all choices of local operators X_A, Y_B. Note that, in this definition, these operators are not necessarily hermitian, hence we maximize over the modulus of the objective function (ρ_AB X_A^†⊗ Y_B). In fact, as shown in <cit.>[See the updated arXiv version of <cit.>.] and discussed in Section <ref>, for some quantum states non-hermitian operators are required to further optimize the quantum maximal correlation.\n\n\nAn application of the Cauchy-Schwarz inequality shows that 0≤μ(A, B)≤ 1. It can be shown that μ(A, B)=0 if and only if ρ_AB=ρ_A⊗ρ_B is a product state. Note that if ρ_AB is not product, there always exist local measurements whose outcomes are correlated and hence their maximal correlation is nonzero. Also, restricting X_A and Y_B to local hermitian operators, one can verify that μ(A, B)=1 if and only if there exist non-trivial local measurements described by operators {Π_A,n}_n=1^d and {Π_B,m}_m=1^d, where d≥2, such that the joint outcome probability distribution is perfectly correlated <cit.>: \n\n    p(n,m)=(ρ_ABΠ_A,n⊗Π_B,m)=p_nδ_n,m.\n\nThis form means that the shared state between two parties can be used to extract perfect shared randomness through local measurements. \nBased on this, we can see that μ(A, B)=1 for any pure entangled state |ψ_AB⟩=∑_n c_n|n_A,n_B⟩ with {|n_A⟩} and {|n_B⟩} being the Schmidt bases, and its completely dephased version in the Schmidt bases, ρ_AB=∑_n |c_n|^2 |n_A⟩⟨n_A|⊗|n_B⟩⟨n_B|, which is a separable state. In these cases, considering observables N_A=∑_n h_n|n_A⟩⟨n_A| and N_B=∑_n h_n|n_B⟩⟨n_B| for subsystems A and B, the optimal local operators in (<ref>) can be found as  X_A=(N_A-⟨ N_A⟩)/Δ N_A and Y_B=(N_B-⟨ N_B⟩)/Δ N_B with the identical means ⟨ N_A⟩=⟨ N_B⟩=∑_n |c_n|^2 h_n, and the identical standard deviations, Δ N_A=Δ N_B=(∑_n |c_n|^2 h_n^2-⟨ N_A⟩^2)^1/2.\n\nMaximal correlation satisfies two crucial properties\n <cit.>:\n\n\n  * (Data processing) If σ_A'B' = Φ_A→ A'⊗Ψ_B→ B'(ρ_AB), where Φ_A→ A' and Ψ_B→ B' are local quantum operations (quantum completely-positive trace preserving (cptp) super-operators) then \n\n    μ(A', B') ≤μ(A, B).\n\n\n\n  * (Tensorization) For any bipartite density matrix ρ_AB and any integer n we have\n\n    μ(A^n, B^n) = μ(A, B),\n\nwhere the left hand side is the maximal correlation of the state ρ_A^nB^n=ρ_AB^⊗ n considered as a bipartite state. \n\n\nThe first property says that maximal correlation is really a measure of correlation, and does not increase under local operations. The second property, however, is an intriguing property saying that no matter how many copies of ρ_AB are shared between two parties, their maximal correlation remains the same. This is unlike most measures of correlations (such as mutual information and entanglement entropy) that scale when the number of copies increase. \n\nThe above two properties of maximal correlation make it suitable for proving impossibility of certain local state transformations. Suppose that ρ_AB and σ_A'B' are two bipartite state with μ(A, B)<μ(A', B'). Then, it is not possible to transform ρ_AB to σ_A'B' under local operations even if an arbitrary many copies of ρ_AB is available.\nThis is because if there exist local operations Φ_A^n→ A', Ψ_B^n→ B' acting on n copies of ρ_AB such that σ_A'B' = Φ_A^n→ A'⊗Ψ_B^n→ B'(ρ_AB^⊗ n), then we must have \n\n    μ(A, B) = μ(A^n, B^n)≥μ(A', B'),\n\nwhere the equality is due to the tensorization property and the inequality follows from the data processing inequality.\n\nLet us examine the example of  noisy Bell states. Let \n\n    ρ_AB^(κ) = κ|ψ⟩⟨ψ| + (1-κ) 1/4 I,\n\nbe a mixture of the Bell state |ψ⟩= 1/√(2) (|00⟩ + |11⟩) and the maximally mixed state I/4 for two qubits with 0≤κ≤1.  It is not hard to verify that μ(A, B) = κ; see <cit.>. Thus, by the above observation, local transformation of ρ_AB^(κ) to ρ_AB^(κ') is impossible if κ'>κ even with arbitrary many copies of ρ_AB^(κ). \n\nIt is shown in <cit.> that the maximal correlation μ(A, B) of ρ_AB is equal to the second Schmidt coefficient of some vector associated to ρ_AB in a tensor product Hilbert space. This makes the problem of computing μ(A, B) tractable when the dimensions of the local Hilbert spaces of A, B are finite. In the infinite dimensional case, however, computation of maximal correlation remains a challenge in general.  \n\nOur main result in this paper is to compute the maximal correlation for Gaussian quantum states, which are of great practical interest in quantum information processing. Similar to the classical maximal correlation for Gaussian probability distributions, we show that in the computation of μ(A, B) for Gaussian state ρ_AB, the optimization in (<ref>) can be restricted to operators X_A, Y_B that are linear in local creation and annihilation operators. \n\n\n\n\n\n§ GAUSSIAN QUANTUM STATES\n\n\nIn this section we review the  definition and some basic properties of Gaussian states. For more details we refer to <cit.>.\n\nThe Hilbert space of an m-mode bosonic quantum system  is the space of square-integrable functions on ℝ^2m. We denote the annihilation and creation operators of the j-th mode by _j = (_j+i_j)/√(2) and _j^† = (_j-i_j)/√(2), where _j and _j are the phase-space quadrature operators, similar to the position and momentum operators of the quantum harmonic oscillator, that satisfy the commutation relations[We assume that ħ=1.]\n\n    [_j, _k] = iδ_jk.\n\nWe denote by \n\n    𝐑=(_1, _1, …, _m, _m)^⊤,\n\nthe column-vector consisting of quadrature operators. Then, the above commutation relations can be summarized as \n\n    [, ^⊤] = iΩ_m,\n\nwhere [, ^⊤] is understood as coordinate-wise commutataion and Ω_m= Ω_1⊕⋯⊕Ω_1 with\n\n    Ω_1 = [  0  1; -1  0 ].\n\nFor 𝐫 =(r_1, …, r_2m)^⊤∈ℝ^2m, the m-mode displacement operator (also called the Weyl operaator) D_𝐫 is defined by\n\n    D_   = e^-i^⊤Ω_m \n    = e^i∑_j=1^m (r_2j_j-r_2j-1_j )\n        = ⊗_j=1^m e^(r_2j_j-r_2j-1_j)\n    = ⊗_j=1^m D_(r_2j-1, r_2j),\n\nwhich is the tensor product of the displacement operators for each mode, and hence is local. We note that D_^† = D_-. Moreover, as a consequence of the Baker-Campbell-Hausdorff (BCH) formula[If [X, [X, Y]]=[Y, [X, Y]]=0, then e^X+Y = e^Xe^Y e^-1/2[X, Y].] we have\n\n    D_D_ = e^-i 1/2^⊤Ω_m  D_+.\n\nThis, in particular, means that D_D_^†=D_D_- = D_0= I, i.e., the displacement operator is unitary. \n\nA crucial property of D_ is that[For the proof note that if [X, [X, Y]] = 0, then e^XYe^-X= Y+[X, Y]. Also, see <cit.>.] \n\n    D_ D_^†= -.\n\nThis means that D__j D_^† = _j - r_2j-1 and D__j D_^† = _j - r_2j, i.e., D_ displaces quadrature operators under conjugation, thus the name.\n\n\nFor an arbitrary m-mode density operator ρ = ρ_A_1, …, A_m, the vector of first-order moments in ℝ^2m is defined as \n\n    (ρ) = (ρ),\n\nwhich contains the canonical mean values (ρ)_2j-1 = (ρ_j) and (ρ)_2j = (ρ_j). The covariance matrix, containing the second-order moments, is defined by\n\n    (ρ) = [ρ{(- (ρ)), (- (ρ))^⊤}],\n\nwhere {·, ·} denotes anti-commutation, and as before {(- (ρ)), (- (ρ))^⊤} is understood as coordinate-wise anti-commutation. Thus, (ρ) is a (2m)× (2m) matrix, that by definition is real and symmetric. Furthermore, it can be shown (see <cit.>) that as a consequence of the canonical commutation relations (<ref>) we have\n\n    (ρ)+iΩ_m≥ 0.\n\nThis, in particular, means that (ρ) is positive definite.[Taking the transpose of (<ref>) we find that  (ρ)-iΩ_m≥ 0. Summing this with the original equation gives (ρ)≥ 0. To verify that (ρ) does not have a zero eigenvalue, suppose that (ρ)=0 and for = - ϵ i Ω_m write down the condition ^†(ρ)≥ -i^†Ω_m to conclude that =0.] \n\nLet _j(ρ) be the j-th 2× 2 block on the diagonal of (ρ). Then, by definition, the covariance matrix of ρ_A_j, the marginal state on the j-th mode, equals (ρ_A_j)=_j(ρ). Similarly, (ρ_A_j), the first-order moments of the marginal state, equals the j-th pair of components of (ρ).\n\nLet us examine the effect of the displacement operator on the first and second moments of a density operator. Let ρ'=D_^†ρ D_. Then, by (<ref>) we have\n\n    (ρ')  = (ρ')=(ρ D_ D_^†)= (ρ)- .\n\nThis implies that  D_(-(ρ')) D_^† =  - (ρ) and therefore by (<ref>) we get (ρ')=(ρ). Thus, the application of the local unitary D_ shifts the first-order moment of ρ but does not change the covariance matrix.\n\n\n\nLet H be a real symmetric matrix. Then 1/2^⊤ H is a Hamiltonian that is quadratic in terms of the position and momentum operators. A unitary operator associated to this Hamiltonian equals \n\n    U_H = e^-i1/2^⊤ H .\n\nThen, we have\n\n    U_H^† U_H = S_H ,\n\nwhere S_H = e^Ω_m H. This equation can be proven by putting a time parameter t into the picture (replacing H with tH) and thinking of U_H^† U_H as the time evolution of  in the Heisenberg picture. Then, applying Schrödinger's equation and computing [1/2 H ^⊤,  ], the desired result follows (see <cit.> for more details). We note that since U_H is unitary, \n\n    [U_H^† U_H, (U_H^† U_H)^⊤] = [^⊤, ]=iΩ_m.\n\nTherefore, \n\n    iΩ_m=[S_H , (S_H )^⊤] = S_H [, ^⊤] S_H^⊤ = iS_H Ω_m S_H^⊤.\n\nThis means that S_HΩ_m S_H^⊤ = Ω_m and S_H is a symplectic matrix. Thus, for any quadratic Hamiltonian there is an associated symplectic matrix such that (<ref>) holds. Conversely, it can be shown that for any symplectic matrix there is a related quadratic Hamiltonian through (<ref>).  \n\nLet us now compute the effect of U_H on the first and second moments. Define ρ' = U_H ρ U_H^†. Then, using (<ref>)  it can be shown that  \n\n    (ρ') = S_H (ρ),\n\nand \n\n    (ρ') = S_H (ρ)S_H^⊤.\n\n\n\nThe following proposition, that is a special case of <cit.>, summarizes the above findings.\n\n\nLet ρ=ρ_A_1, …, A_m be an m-mode full-rank density operator. Then there is a local unitary V such that for ρ'=Vρ V^† we have (ρ') = 0 and the 2× 2 blocks on the diagonal of (ρ')  are multiples of identity of the form λ_j I with λ_j≥ 1. Thus, the covariance matrix of the marginal state ρ'_A_j equals (ρ'_A_j) = λ_j I.\n\n\n\nWe note that when H is block-diagonal with 2× 2 blocks on the diagonal (one block for each mode), the unitary operator U_H defined in (<ref>) is local. The associated symplectic matrix S_H to such an H is also block diagonal since Ω_m is block-diagonal. This means that block-diagonal symplectic matrices correspond to local unitaries. \n\nNow, if S_j is the j-block on the diagonal of a block-diagonal S_H, and _j is the j-th 2× 2 block on the diagonal of the covariance matrix, then by (<ref>) the application of the local unitary U_H would change _j to S_j _j S_j^⊤. On the other hand, it is well-known that for any 2× 2 positive definite matrix _j there is a symplectic matrix S_j such that '_j=S_j_j S_j^⊤ is a multiple of identity (see <cit.>). We note that if '_j = λ_j I, then by (<ref>) we have λ_j I+iΩ_1≥ 0 meaning that λ_j≥ 1.\nPutting these together we find that there is a local unitary operator U_H that brings the covariance matrix to the desired form. \n\nNext, applying an appropriate displacement operator, that is a local unitary, we can shift the first moment to the zero vector. We note that displacement operators do not change the covariance matrix. \n\n\n\n\nThe characteristic function of a density operator ρ is defined by \n\n    χ() = (ρ D_).\n\nCharacteristic function fully determines a density operator via \n\n    ρ = 1/(2π)^m∫_ℝ^2mχ() D_- ^2m.\n\nThe Wigner function function <cit.> is then defined as the Fourier transform of the characteristic function\n\n    W() = 1/(2π)^2m∫_ℝ^2mχ() e^i^⊤Ω_m ^2m.\n\nApplying the inverse Fourier transform we obtain\n\n    (ρ e^-i^⊤Ω_m ) =χ() = ∫_ℝ^2m W() e^-i^⊤Ω_m ^2m.\n\nWe note that this equation holds for any ∈ℝ^2m. Thus, thinking of both sides as functions of , considering their Taylor expansion and comparing corresponding terms, we realize that the same equation holds for all  beyond real ones. That is, for any\ncomplex ∈ℂ^2m, we have \n\n    (ρ e^^⊤) = ∫_ℝ^2m W() e^^⊤^2m.\n\n\nA quantum state is called Gaussian if its Wigner function is Gaussian. In this case, the Wigner function is specified by the first-order moments =(ρ) and the covariance matrix =(ρ):\n\n    W() = 1/π^m √() e^-(-)^⊤^-1(-).\n\nBy using the Wigner function, one can verify that the purity of Gaussian states can be calculated as (ρ^2)=(2π)^m∫_ℝ^2m W^2() ^2m=1/√(γ). Therefore, pure Gaussian states have γ=1.\n \nThe Wigner function of a marginal state is the marginal distribution of the Wigner function of the joint state. Hence, marginal states of Gaussian state are also Gaussian. Note also that, due to the uncertainty principle, the Wigner function cannot be viewed as the joint probability distribution associated with local measurements.\n\nCoherent states are well-known examples of a single-mode Gaussian states, which are displaced vacuum states. For a complex number α=(x+ip)/√(2) let |α⟩=D_α|0⟩ where D_α=exp(α^†-α̅)=D_(x, p). Then,  (|α⟩)=(x,p)^⊤ and (|α⟩)=I, where I is the 2×2 identity matrix[In this paper, I_n denotes the n× n identity matrix but we drop the subindex for n=2.]. Other important examples are squeezed-vacuum states |z⟩=exp(z(^†2-^2)/2)|0⟩ with squeezing parameter z and thermal states ρ_th=∫  e^-|α|^2/n̅/(n̅π)|α⟩⟨α| d^2α with mean-photon number n̅. The first-order moments of these states are zero and their covariance matrices are (|z⟩)=diag(e^2z,e^-2z) and (ρ_th)=(2n̅+1)I.\n\t\n\nIn general, Gaussian unitary operators that map Gaussian states to Gaussian ones can be described in terms of a displacement operator and a unitary operator associated to Hamiltonians that are quadratic in terms of quadrature operators <cit.>. The latter \ncan be written in the form of U_H=e^-1/2 i^⊤ H in which H is a (2m)× (2m) real symmetric matrix. Letting ρ' = U_H ρ U_H^†, it can be shown that  \n\n    (ρ') = S_H (ρ),\n\nand \n\n    (ρ') = S_H (ρ)S_H^⊤,\n\nwhere S_H = e^Ω_m H is a symplectic matrix (satisfying S_HΩ_m S_H^⊤ = Ω_m). \nExamples of single-mode unitary operators are the phase rotation with H_Ro=θ(I-Y) and the symplectic matrix S_Ro=cos(θ) I+isin(θ) Y, and squeezing  with H_Sq=zX and the symplectic matrix S_Sq=diag(e^z,e^-z), where here Y and X are the Pauli matrices. Using these two unitary operations and displacement, any single-mode pure Gaussian state can be transformed to the vacuum state.\n\n\n\nThe following proposition provides a standard form for Gaussian states under local unitaries.\n\n\nLet ρ=ρ_A_1, …, A_m be an m-mode Gaussian state. Then, there exists a local Gaussian unitary V such that for ρ'=Vρ V^† we have (ρ') = 0 and  _j(ρ') = (ρ'_A_j) =λ_j I with λ_j≥ 1. If m=2 we can further assume that the covariance matrix can be in the standard form\n\n    (ρ') = [ λ_1 I      ;    ^⊤ λ_2 I ],\n\nwith =diag(ν_1,ν_2). \n\n\n\n\tFirst, by applying an appropriate displacement operator, that is a local unitary, we can shift the first-order moments to zero without changing the covariance matrix. Next, to bring the state into the desired form, we use a local unitary operator U_H=e^-1/2 i^⊤ H, where H is block-diagonal with 2× 2 blocks on the diagonal (one block for each mode). This means that block-diagonal symplectic matrices correspond to local unitaries. \n\nNow, suppose that S_H = diag(S_1, …, S_m) is a block-diagonal symplectic matrix with S_j's being 2× 2 symplectic matrices to be determined. Also, let _j(ρ) = (ρ_A_j) be the j-th 2× 2 block on the diagonal of the covariance matrix. By (<ref>) we know that the application of the local unitary U_H would change _j(ρ) to S_j _j(ρ) S_j^⊤. By choosing each local unitary to be a phase rotation that diagonalizes _j(ρ), followed by a squeezing operator that makes the diagonal elements equal, we get '_j=S_SqjS_Roj_j S_Roj^⊤ S_Sqj^⊤ =λ_j I with λ_j≥ 1. Note that λ_j=1 means that the marginal state ρ'_A_j is the vacuum state, which is pure and hence cannot be correlated with the other modes. Also,\nλ_j>1 implies a thermal marginal state with mean-photon number n̅=(λ_j-1)/2.\nPutting these together we find that there is a local Gaussian unitary operator V= U_H D_, consisting of local displacements, phase rotations and squeezing, that brings the covariance matrix to the desired form with marginal thermal states.\n\n\nFor m=2, the above procedure gives a covariance matrix of the form \n\n    [ λ_1 I     ';   '^⊤ λ_2 I ].\n\nHowever, by including further local phase-rotation operations with the block-diagonal symplectic matrix S_H'=diag(S'_Ro1,S'_Ro2) into V, we can get \n\n    [             λ_1 I  S'_Ro1' S'_Ro2^⊤; S'_Ro2'^⊤S'_Ro1^⊤             λ_2 I ],\n\nwhere S'_Ro1' S'_Ro2^⊤= is diagonal. Thus, we obtain the standard form of the covariance matrix for bipartite Gaussian states.\n\n\nAnother useful phase-space quasiprobability distribution is the Glauber-Sudarshan P-function <cit.> that, in terms of the characteristic function, is given by\n\n    P() = 1/(2π)^2m∫_ℝ^2mχ() e^^⊤/4 e^i^⊤Ω_m  ^2m.\n\nUsing this distribution, a density operator of an m-mode system can be expressed in terms of m-mode coherent states\n\n    ρ=∫_ℂ^mP(α) |α⟩⟨α| ^2mα,\n\nwhere α=(α_1,α_2,…,α_m)^⊤∈ℂ^m and by using α_j=(s_2j-1+is_2j)/√(2) we have P(α)=2^m P(). For most quantum states the Glauber-Sudarshan P-function either takes negative values or is a highly-singular function, existing as a generalized distribution <cit.>; these states are known as nonclassical states <cit.>. Quantum states whose P(α) is a probability density distribution are known as classical states <cit.>. For Gaussian states, if \n\n    (ρ)=(ρ)- I_2m≥0,\n \nwhere I_2m is the 2m× 2m identity matrix, then the Fourier transform (<ref>) exists and the Glauber-Sudarshan P-function is a Gaussian distribution,\n\n    P() = 1/π^m √() e^-(-)^⊤^-1(-).\n\nIn this case, the state is classical and separable. \n\n\n\n\n\n§ AN ORTHONORMAL BASIS FOR LOCAL OPERATORS\n\n\n\nIn this section, we derive an orthonormal basis for the space of (local) operators with respect to a Gaussian state. Let ρ be an arbitrary quantum state which for the sake of simplicity, is assumed to be full-rank. Then, for any pair of operators X, X' we define\n\n    ⟨ X, X'⟩_ρ:= (ρ X^† X').\n\n⟨·, ·⟩_ρ satisfies all the properties of an inner product: it is linear in the second argument and anti-linear in the first argument; also, ⟨ X, X⟩_ρ≥ 0 and equality holds iff[Note that we assume that ρ is full-rank] X=0. Note that the objective function in the maximal correlation (<ref>) can be written in terms of this inner product:\n|⟨ X_A, Y_B ⟩_ρ_AB|.\nThus, to compute the maximization in (<ref>) it would be helpful to compute an orthonormal basis for the space of local operators X_A, Y_B with respect to the inner products associated to\nthe marginal states ρ_A=_B(ρ_AB) and ρ_B=_A(ρ_AB), respectively.\n\nLet ρ_AB be a two-mode Gaussian state. It is clear from the definition that local unitaries do not change the maximal correlation. Therefore, by using Proposition <ref> and without loss of generality, we assume that the covariance matrix of ρ_AB is in the standard form (<ref>) with (ρ_AB)=0.\n\nIn the following, we consider a single-mode thermal state  with ()=0 and ()=λ I with λ> 1. This can be either of the marginal states ρ_A or ρ_B of the Gaussian state ρ_AB.\n\nFor any ∈ℝ^2, let \n\n    C_ =exp(^⊤Υ -λ/4^⊤ΥΥ^⊤),\n\nwhere Υ is a 2× 2 matrix to be determined. Using the BCH formula, we have\n\n    C_^† C_ = η  e^(^⊤Υ̅+^⊤Υ),\n\nwhere Υ̅ is the entry-wise complex conjugate of Υ, and\n\n    η=exp( -λ/4(^⊤Υ̅Υ̅^⊤ + ^⊤ΥΥ^⊤) + i/2^⊤Υ̅Ω_1 Υ^⊤).\n\nThen, by using (<ref>) and (<ref>), we have\n\n    ( C_^† C_)    = η∫_ℝ^2 W()   e^(^⊤Υ̅+^⊤Υ) ^2 \n        =exp(λ/2^⊤Υ̅Υ^⊤ + i/2^⊤Υ̅Ω_1 Υ^⊤),\n\nwhere W()=exp(-^⊤/λ)/(πλ) is the Wigner function of the thermal state.\nNow let \n\n    Υ= 1/√(2)[  1 -i;  1  i ],\n\nwhich is unitary and gives\n\n    Υ̅Ω_1 Υ^⊤ = [ -i  0;  0  i ].\n\nThis choice of Υ simplifies (<ref>) as\n\n    ( C_^† C_) \n       =exp((λ+1)r_1 s_1/2+(λ-1)r_2 s_2/2)\n       = ∑_k, ℓ=0^∞1/k! ℓ!((λ+1)r_1 s_1/2)^ k((λ-1)r_2 s_2/2)^ℓ.\n\n\nOn the other hand, we define the operators H_k, ℓ by expanding C_ as a function of =(r_1, r_2)^⊤:\n\n    C_ = ∑_k, ℓ=0^∞1/√(k!ℓ!)ζ_0^k(λ)ζ_1^ℓ(λ) r_1^k r_2^ℓ  H_k, ℓ,\n\nwith \n\n    ζ_0(λ) = √((λ+1) /2),   ζ_1(λ) = √((λ-1) /2).\n\nWe note that H_k, ℓ is a polynomial of the \nquadrature operators  and  of degree k+ℓ. For instance, H_0,0=I and \n\n    H_1, 0 = 1/√(λ+1)(-i),   H_0, 1 = 1/√(λ-1)(+i).\n\nBy using the expansion (<ref>), we can then write\n\n    (   C_^† C_) \n       = ∑_k, ℓ, k', ℓ'ζ_0^k+k'(λ)ζ_1^ℓ+ℓ'(λ)/√(k!ℓ!k'!ℓ'!) r_1^k r_2^ℓ s_1^k's_2^ℓ'( H^†_k, ℓ H_k', ℓ').\n\nComparing this equation with (<ref>) we find that \n\n    ⟨ H_k, ℓ, H_k', ℓ'⟩_ = ( H_k, ℓ^† H_k', ℓ') = δ_k, k'δ_ℓ, ℓ'.\n\n\n\n\nLet  be a single-mode thermal state with ()=0 and ()= λ I with λ> 1. Define operators H_k, ℓ via (<ref>) where C_ is given in (<ref>). Then,  \n\n    Γ={H_k, ℓ:  k, ℓ≥ 0},\n \nis an orthonormal basis for the space of operators with respect to the inner product ⟨·, ·⟩_.\n\n\n\nWe have already shown in (<ref>) that {H_k, ℓ:  k, ℓ≥ 0} is an orthonormal set. It remains to show that {H_k, ℓ:  k, ℓ≥ 0} span the whole space of operators. \n\nLet 𝒱_t be the space of of polynomials of operators , of degree at most t. In other words,\n\n    𝒱_t = span{I, , , ^2, , ^2, …, ^t-1,^t}.\n\nWe note that, as mentioned above, H_k, ℓ is a polynomial of operators , of degree k+ℓ. Thus,  \n\n    span{H_k, ℓ:  k+ℓ≤ t}⊆𝒱_t.\n \nOn the other hand, by the orthogonality relations already established, we know that {H_k, ℓ:  k+ℓ≤ t} is an independent set. Thus, computing the dimensions of both sides in the above inclusion, we find that span{H_k, ℓ:  k+ℓ≤ t}= 𝒱_t. Thus, taking union over t≥ 1, we find that span(Γ) is equal to 𝒱_∞=∪_t 𝒱_t, i.e., the space of all polynomials of the quadrature operators. On the other hand, we know that the later set spans the whole space of operators.[This is essentially the content of the Stone-von Neumann theorem <cit.>.] In fact, 𝒱_∞ contains the displacement operators, and any bounded operator can be expressed in terms of displacement operators <cit.>.\n\n\n\n\n\n\n\n\n§ MAXIMAL CORRELATION FOR BIPARTITE GAUSSIAN STATES\n\n\nAs discussed, the maximal correlation is invariant under local unitary transformations. Hence, in order to compute the maximal correlation for bipartite Gaussian states, we can restrict to Gaussian states in the standard form (<ref>) through Proposition <ref>. Let ρ_AB be a bipartite Gaussian state that is in the standard form with first moment (ρ_AB)=0 and the covariance matrix\n\n    _AB = (ρ_AB) = [ λ_A I      ;    ^⊤ λ_B I ],   ν=[ ν_1   0;   0 ν_2 ].\n \nHence, the marginal states are thermal states with the covariance matrices (ρ_A) =λ_A I, (ρ_A) =λ_B I and (ρ_A) = (ρ_B)=0.\n\nAccording to Theorem <ref>, we know that the sets \n\n    {H_k, ℓ^A:  k, ℓ≥ 0}  and  {H_k, ℓ^B:  k, ℓ≥ 0},\n\nare orthonormal bases with respect to the inner products ⟨·, ·⟩_ρ_A and ⟨·, ·⟩_ρ_B, respectively. Here H_k, ℓ^A's and H_k, ℓ^B's are defined in terms of the corresponding quadrature operators and the parameter λ_A and λ_B, respectively. To compute the maximal correlation μ(A, B), we use the above bases to expand the local operator X_A and Y_B. Then, the objective function in the definition (<ref>), which is equal to |⟨ X_A, Y_B⟩_ρ_AB|, can be expressed in terms of the inner products ⟨ H_k, ℓ^A, H_k', ℓ'^B⟩_ρ_AB, which we compute in the following.\n\nLet C_^A and C_^B be the operator (<ref>) in terms of the modal quadrature operators _A=(_A, _A)^⊤ and _B=(_B, _B)^⊤, respectively.\nAs C_^A and C_^B are local operators and commute, we have\n\n\n    (C_^A)^† C_^B = τ  e^^⊤Υ_AB,\n\nwhere \nτ=exp(-λ_A/4^⊤Υ̅Υ̅^⊤-λ_B/4^⊤ΥΥ^⊤),\nand\n\n    =[ ;  ],   and  Υ= [ Υ̅  0;  0  Υ ].\n\nThus, by using the Wigner function (<ref>), we can compute the following inner product\n\n    ⟨  C_^A, C_^B⟩_ρ_AB   =   τ (ρ_AB e^^⊤Υ_AB)\n       = τ∫_ℝ^4 W_ρ_AB() e^^⊤Υ^4 \n        = τ  e^1/4^⊤Υ_ABΥ^⊤\n     = e^1/2^⊤Υ̅Υ^⊤\n        = ∑_p_00, p_01\n     p_10, p_11ω_00^p_00ω_01^p_01ω_10^p_10ω_11^p_11/p_00!p_01!p_10!p_11!\n    r_1^p_00+p_01 r_2^p_11+p_10\n             × s_1^p_00+p_10 s_2^p_01+p_11\n \nwhere ω_00, …, ω_11 are entries of 1/2Υ̅Υ^⊤ given by\n\n    [ ω_00 ω_01; ω_10 ω_11 ] = 1/2Υ̅Υ^⊤ = 1/4[ ν_1+ν_2 ν_1-ν_2; ν_1-ν_2 ν_1+ν_2 ].\n\nOn the other hand, using the expansion (<ref>), we have \n\n    ⟨  C_^A,     C_^B⟩_ρ_AB\n       = ∑_k, ℓ\n     k', ℓ'α_0^kα_1^ℓβ_0^k'β_1^ℓ'/√(k!ℓ!k'!ℓ'!) r_1^kr_2^ℓ s_1^k's_2^ℓ'⟨ H_k, ℓ^A, H_k', ℓ'^B⟩_ρ_AB ,\n\nwhere α_0=ζ_0(λ_A), α_1=ζ_1(λ_A),  β_0=ζ_0(λ_B) and β_1=ζ_1(λ_B) are given in (<ref>). Comparing the above equations \nyields\n\n    ⟨ H_k, ℓ^A, H_k', ℓ'^B⟩_ρ_AB=0,    if    k+ℓ≠ k'+ℓ'.\n\nMoreover, if k+ℓ = k'+ℓ', then \n\n    ⟨  H_k, ℓ^A,    H_k', ℓ'^B⟩_ρ_AB =  √(k!ℓ!k'!ℓ'!)/α_0^kα_1^ℓβ_0^k'β_1^ℓ'  ∑_p_00+ p_01=k\n     p_10+p_11=ℓ\n     p_00+ p_10=k'\n     p_01+p_11=ℓ'   ω_00^p_00ω_01^p_01ω_10^p_10ω_11^p_11/p_00!p_01!p_10!p_11!.\n\n\nNow let X_A, Y_B be arbitrary operators that satisfy the conditions (ρ_AX_A)=(ρ_B Y_B)=0 and (ρ_AX_A X_A^†)=(ρ_B Y_B Y^†_B)=1. Consider the expansion of these operators in the orthonormal bases {H_k, ℓ^A:  k, ℓ≥ 0} and {H_k', ℓ'^B:  k', ℓ'≥ 0} as follows:\n\n    X_A = ∑_k, ℓ f_k, ℓ   H_k, ℓ^A,   and   Y_B = ∑_k', ℓ' g_k, ℓ   H_k', ℓ'^B.\n\nThe first condition on X_A, Y_B means that ⟨ I_A, X_A⟩_ρ_A= ⟨ I_B, Y_B⟩_ρ_B=0. As I_A=H_0,0^A and I_B=H_0,0^B, we find that f_0,0=g_0,0=0. The second condition on X_A, Y_B can also be written as ⟨ X_A, X_A⟩_ρ_A =⟨ Y_B, Y_B⟩_ρ_B=1. Thus, \n\n    ^2= ^2=1,\n\nwhere = (f_0,1, f_1, 0, f_1, 1, …)^⊤ and = (g_0,1, g_1, 0, g_1, 1, …)^⊤ are the vectors of coefficients excluding the first ones f_0,0, g_0,0 that are zero.\nHence, the inner product can be written as\n\n    ⟨ X_A, Y_B⟩_ρ_AB = ∑_k, ℓ\n     k', ℓ'f̅_k, ℓ g_k', ℓ'⟨ H_k, ℓ^A, H_k', ℓ'^B⟩_ρ_AB.\n\n\nLet 𝒬 be the matrix whose rows and column are indexed by pairs {(k, ℓ):  k+ℓ≥ 1}, and whose ((k', ℓ'), (k, ℓ) )-th entry is equal to   \n\n    _(k', ℓ'), (k, ℓ) =⟨ H_k, ℓ^A, H_k', ℓ'^B⟩_ρ_AB.\n\nWe note that by (<ref>),  is a block-diagonal matrix whose t-th block ^(t) is associated with pairs (k, ℓ) with k+ℓ=t and is of size (t+1)× (t+1):\n\n    = [ ^(1)    0    0    ⋯;    0 ^(2)    0    ⋯;    0    0 ^(3)    ⋯;    ⋮    ⋮    ⋮    ⋱ ].\n\nThe matrix elements in the t-th block, for 0≤ℓ, ℓ' ≤ t, are given by\n\n    (^(t))_ℓ, ℓ'   = ⟨ H_t-ℓ, ℓ^A, H_t-ℓ', ℓ'^B⟩_ρ_AB\n       = √((t-ℓ)!ℓ!(t-ℓ')!ℓ'!)/α_0^kα_1^ℓβ_0^k'β_1^ℓ'∑_ p_10+p_11=ℓ\n      p_01+p_11=ℓ'\n     p_00+p_01+p_10+p_11=t   ω_00^p_00ω_01^p_01ω_10^p_10ω_11^p_11/p_00!p_01!p_10!p_11!.\n\nIn particular, \nthe first block reads\n\n    ^(1)   \n    = [ ω_00/α_0β_0 ω_01/α_0β_1; ω_10/α_1β_0 ω_11/α_1β_1 ]\n       =1/2[ (ν_1+ν_2)/√((λ_A+1)(λ_B+1) ) (ν_1-ν_2)/√((λ_A+1)(λ_B-1) ); (ν_1-ν_2)/√((λ_A-1)(λ_B+1) ) (ν_1+ν_2)/√((λ_A-1)(λ_B-1) ) ]\n       =1/2[ α_0^-1      0;      0 α_1^-1 ]Υ̅Υ^⊤[ β_0^-1      0;      0 β_1^-1 ].\n\n\nNow we can state the main result of this paper.\n\n\nLet ρ_AB be a Gaussian state with (ρ_AB)=0 and covariance matrix (<ref>). Let {H_k, ℓ^A:  k, ℓ≥ 0} and {H_k', ℓ'^B:  k', ℓ'≥ 0} be orthonormal bases for the spaces of local operators of modes A and B, respectively,  constructed \nin Theorem <ref>. Let  be the matrix consisting of inner products of operators in {H_k, ℓ^A:  k+ ℓ> 0} and {H_k', ℓ'^B:  k'+ ℓ'> 0} defined as in (<ref>) and with the block structure given in (<ref>) and (<ref>). Then, the maximal correlation for the Gaussian state is given by\n\n    μ(A, B) = ^(1).\n\nEquivalently, this means that in computing the maximal correlation in (<ref>) we may restrict to X_A, Y_B that are linear in quadrature operators.\n\n\n\n\nBy using (<ref>) and (<ref>), the maximal correlation (<ref>) for a Gaussian state reads \n\n    μ(A, B) = =max_==1 |^†|,\n\nwhere  is the operator norm of . Given the block structure of  we know that = max_t ^(t). Thus, to prove the theorem we need to show that \n\n    ^(1)≥^(t),    ∀ t>1.\n\nTo this end, we derive an equivalent representation of the matrices ^(t).\n\n\nFor 0≤ℓ≤ t and =(b_1, …, b_t)∈{0,1}^t with ||=∑_i b_i define\n\n    s_ℓ, = δ_ℓ, ||√(ℓ! (t-ℓ)!/t!),\n\nand let S be the matrix of size (t+1)× 2^t with entries s_j,.\nObserve that \n\n    (SS^†)_ℓ, ℓ'   = ∑_ s_ℓ,  s_ℓ', \n        = ∑_δ_ℓ, ||δ_ℓ', ||ℓ! (t-ℓ)!/t!\n        = δ_ℓ, ℓ'∑_: ||=ℓℓ! (t-ℓ)!/t!\n        =δ_ℓ, ℓ'.\n\nThus SS^†=I_t+1 with I_t+1 being (t+1)×(t+1) identity matrix. Next, to simplify the notation we use \n\n    =^(1),\n \nand compute\n\n    (S   ^⊗ t S^†)_ℓ, ℓ'\n        = ∑_, ' s_ℓ ,  s_ℓ' , '^⊗ t_, '\n       = ∑_, 'δ_ℓ, ||δ_ℓ', |'|√(ℓ! (t-ℓ)!ℓ'!(t-ℓ')!)/t!^⊗ t_, '.\n \nFor a given , '∈{0,1}^t define p_aa' \n\nas follows:\n\n\n\n\n\n\n\n    p_aa' = {i:  (b_i, b'_i) = (a,a')},    (a, a')∈{0,1}^2.\n\nHence, by using (<ref>), we get\n\n    ^⊗ t_, '    = _00^p_00_01^p_01_10^p_10_11^p_11\n       = ω_00^p_00ω_01^p_01ω_10^p_10ω_11^p_11/α_0^p_00+p_01α_1^p_10+p_11β_0^p_00+p_10β_1^p_01+p_11.\n\nOn the other hand, we note that if ||=ℓ and |'|=ℓ', then \n\n    ℓ=p_10+p_11,   and  ℓ'=p_01+p_11.\n\nFor a fixed tuple (p_00, p_01, p_10, p_11) satisfying these equations, we can see that there are \n\n    tp_00, p_01, p_10, p_11 = t!/p_00! p_01! p_10! p_11!,\n\npairs of (, ') that satisfy (<ref>). Therefore, putting these together and comparing with (<ref>), we obtain\n\n\n    (S^⊗ t S^†)_ℓ, ℓ'    =   ∑_p_10+p_11=ℓ\n     p_01+p_11=ℓ'\n     p_00+p_01+p_10+p_11=t  tp_00, p_01, p_10, p_11√(ℓ! (t-ℓ)!ℓ'!(t-ℓ')!)/t!_11^p_00_12^p_01_21^p_10_22^p_11\n         = ∑_p_10+p_11=ℓ\n     p_01+p_11=ℓ'\n     p_00+p_01+p_10+p_11=t  √(ℓ! (t-ℓ)!ℓ'!(t-ℓ')!)/p_00! p_01! p_10! p_11!ω_00^p_00ω_01^p_01ω_10^p_10ω_11^p_11/α_0^p_00+p_01α_1^p_10+p_11β_0^p_00+p_10β_1^p_01+p_11\n        = ^(t)_ℓ, ℓ'.\n\n\nTherefore, S^⊗ t S^†= ^(t) and\n\n    ^(t)   =S^⊗ t S^†\n       ≤S·S^†·^⊗ t\n        =  ^⊗ t = ^t,\n\nwhere in the second line we use the fact that SS^†=I_t+1 which gives S=S^†= 1. Next, we note that ≤ 1 because\n\n    =max_, ≠ 0| ^† |/·\n        = max_, ≠ 0| ⟨ f_0H_1,0^A + f_1H_0,1^A, g_0H_1,0^B + g_1H_0,1^B⟩_ρ_AB  |/·\n       ≤max_, ≠ 0  f_0H_1,0^A + f_1H_0,1^A ·g_0H_1,0^B + g_1H_0,1^B /·\n       = 1,\n\nwhere in the third line we use the Cauchy-Schwarz inequality and in the last line we use the fact that {H_1,0^A + H_0,1^A} and {H_1,0^B + H_0,1^B} are orthonormal. Thus,\n\n    ^(t)≤^t ≤= ^(1),\n\nand \ntherefore the maximal correlation for a Gaussian state in the standard form becomes\n\n    μ(A, B)    =^(1)=max_==1 | ^†^(1) |.\n\nThis implies that the optimal local operators by using (<ref>) can be expressed as a linear combination of quadrature operators\n\n    X_A   =f_0H_1,0^A + f_1H_0,1^A = α_x _A + α_p _A,\n    \n    Y_B   =g_0H_1,0^B + g_1H_0,1^B = β_x _B + β_p _B,\n\nwhere the coefficients are determined by (<ref>). Note that, in general, the coefficients may be complex numbers, and hence the optimal operators may not correspond to local physical observables.\n\n\n\n\n\n\n\n§ GAUSSIAN MAXIMAL CORRELATION\n\n \nIn this section, we define another measure of correlation for bipartite Gaussian states by restricting the optimization in (<ref>) to Gaussian observables <cit.>, i.e., operators that are Hermitian and linear in terms of quadrature operators and correspond to homodyne measurements. We refer to this new correlation measure as the Gaussian maximal correlation which is given by\n\n    μ_G(A, B) = sup_X_A, Y_B(ρ_AB X_A⊗ Y_B),\n\nwhere ρ_AB is a bipartite Gaussian state, and X_A, Y_B are local Hermitian observables that are linear in terms of quadrature operators and satisfy (ρ_A X_A)= (ρ_B Y_B)=0 and (ρ_AX_A^2)=(ρ_B Y_B^2)=1. Note that by definition, μ_G(A, B)≤μ(A, B).\n\n\nSuppose that the covariance matrix of ρ_AB is\n\n    _AB = (ρ_AB) = [    _A   _AB; _AB^⊤    _B ],\n\nand for simplicity assume that (ρ_AB)=0. By the restrictions on X_A, Y_B, there are real vectors _A, _B such that X_A=_A^⊤_A, Y_B=_B^⊤_B and \n\n    1   =(ρ_A X_A^2)\n       =1/2( ρ_A {X_A, X_A})\n       =1/2_A^⊤( ρ_A {_A, _A})_A\n       =1/2_A^⊤_A _A,\n\nand similarly _B^⊤_B _B =2. Note that (ρ_A X_A) = (ρ_B Y_B)=0 is automatically satisfied since (ρ_AB)=0.\nNext, similar to the above computation, it is easily verified that 2(σ_AB X_A⊗ Y_B)=_A^⊤_AB_B. Therefore, rescaling _A, _B by a factor of √(2), the Gaussian maximal correlation reads\n\n    μ_G(A, B) = max__A, _B     _A^⊤_AB_B\n        _A^⊤_A _A=1\n        _B^⊤_B _B=1.\n\nWriting the above optimization in terms of _A= _A^1/2_A and _B= _B^1/2_B, we find that \n\n    μ_G(A, B)=_A^-1/2_AB_B^-1/2.\n\nTherefore, for a Gaussian state in the standard form (<ref>) with |ν_1|≥|ν_2|, which can always be accomplished by relabeling the phase-space quadratures, the Gaussian maximal correlation becomes\n\n    μ_G(A, B) = |ν_1|/√(λ_A λ_B).\n\nNote that the joint probability distribution p(x_A,x_B) associated with local homodyne measurements on the x-quadratures is Gaussian with Cov[x_A,x_B]=ν_1,  Var[x_A]=λ_A, and Var[x_B]=λ_B. Therefore, comparing this equation with (<ref>), we observe that the Gaussian maximal correlation is in fact the classical maximal correlation of the outcome probability distribution of optimal local homodyne measurements. However, unlike the classical case, (<ref>) shows that  μ_G(A, B) cannot be equal to one, as due to the uncertainty relation (<ref>) the covariance matrix of physical states cannot have a zero eigenvalue.\n\nConsidering the characterization of Gaussian cptp maps <cit.>, one can verify that μ_G(A, B) is monotone under local Gaussian cptp maps; the point is that under such local super-operators in the Heisenberg picture, linear operators are mapped to linear operators. Therefore, correlations between phase-space quadratures cannot be increased under Gaussian operations. Gaussian maximal correlation also satisfies the tensorization property. To verify this, it suffices to use (<ref>), the fact that (ρ_AB⊗ρ_A'B') = (ρ_AB)⊕(ρ_A'B') and ξ⊕η= max{ξ, η}. Therefore, the Gaussian maximal correlation satisfies both the monotonicity and tensorization properties, and therefore can be used to study the local state transformation problem when both resource and target states are Gaussian. For example, this result shows that n copies of a Gaussian in the standard form with the Gaussian maximal correlation (<ref>), cannot be locally transformed into another Gaussian state with the same marginal states but with |ν_1'|>|ν_1|.\n\n\n\nWe state yet another reformulation of the Gaussian maximal correlation. Note that \n\n    (_A⊕_B)^-1/2   _AB (_A⊕_B)^-1/2\n       = [                 I_A   _A^-1/2_AB_B^-1/2; _B^-1/2_AB^⊤_A^-1/2                 I_B ].\n\nThen, using (<ref>) we fine that (_A⊕_B)^-1/2_AB (_A⊕_B)^-1/2≥ 1- μ_G(A, B). Therefore, we can write\nμ_G(A, B)=1-V(A,B) where V(A,B)=max{q≤1:_AB≥ q(_A⊕_B)}. This  formulation of the Gaussian maximal correlation is related to the measure for Gaussian resources <cit.> and is reminiscent of the entanglement measure introduced in <cit.> for Gaussian states.\nIndeed, the measure of <cit.> is defined by V'(A, B)=max{q≤1:_AB≥ q('_A⊕'_B)} where '_A, '_B are covariance matrices of some quantum states, while in our case they are the covariance matrices of the marginal states of ρ_AB. \n\nWe finish this section by emphasizing on the fact that the Gaussian maximal correlation is monotone only if we restrict to local Gaussian operations, while the quantum maximal correlation studies in previous sections is monotone under all local operations.  \n\n\n\n\n§ EXAMPLES\n\nIn this section, we further illustrate various features of the correlation measures by considering examples of Gaussian states. We consider two classes of bipartite Gaussian states that are in the standard form with symmetric marginal states and zero first-order moments.\n\nThe first class of Gaussian states is described by the covariance matrix (<ref>) with λ_A=λ_B=λ>1 and ν_1=-ν_2=ν≥0. The physicality condition (<ref>) implies that ν≤√(λ^2-1), and the state is entangled for λ-1<ν<√(λ^2-1). We refer to these states as correlated-anticorrelated (CA) Gaussian states. The maximal correlation for these states, using (<ref>) and (<ref>), is given by\n\n    μ__CA(A,B)   = max_==1[ f̅_0 f̅_1 ][           0 ν/√(λ^2-1 ); ν/√(λ^2-1 )           0 ][ g_0; g_1 ]\n       =ν/√(λ^2-1),\n \nwhere the maximum is attained for f_0=f_1=g_0=g_1=1/√(2). Hence, optimal local operators using (<ref>) and (<ref>) can be found as X_A=_A^†/√(λ+1)+_A/√(λ-1) and Y_A=_B^†/√(λ+1)+_B/√(λ-1), which are not hermitian and cannot be viewed as physical observables.  \nNote that for ν=√(λ^2-1), the Gaussian state corresponds to a two-mode squeezed vacuum state,\n\n    |ψ_AB⟩=√(2/λ+1)∑_n (λ-1/λ+1)^n/2|n_A,n_B⟩,\n\nwhich is a pure entangled state with μ__CA(A,B)=1. Here {|n_A⟩} and  {|n_B⟩} are the Fock states. Thus, following Section <ref>, one can easily verify that for two-mode squeezed vacuum states the maximal correlation of μ=1 can be achieved using local hermitian operators X_A=(_A^†_A-n̅)/Δ n=H_1,1^A and Y_B=(_B^†_B-n̅)/Δ n=H_1,1^B, where n̅=(λ-1)/2 and Δ n=√(λ^2-1)/2 are the mean and the standard deviation of photon-number distribution of the marginal states. This implies that the same maximal correlation can be obtained for two-mode squeezed vacuum states by using local hermitian operators that are quadratic in the phase-space quadrature operators. This means that, in general, optimal local operators for the maximal correlation are not unique.\n\nAs discussed, the maximal correlation for Gaussian states can be used to study the local state transformation problem when the target state is not Gaussian. For example, by using (<ref>), it can be seen that any arbitrary number of copies of CA Gaussian states cannot be locally transformed into the noisy Bell state (<ref>) without classical communication if ν<κ√(λ^2-1). Note, however, that if two states have the same amount of the maximal correlation, it is not clear whether or how the two states can locally be transformed into one another in general. \n\nWe also consider a second class of Gaussian states described by the covariance matrix (<ref>) with λ_A=λ_B=λ>1 and ν_1=ν_2=ν≥0. Note that for all physical values of ν≤λ-1, these states are separable with a nonnegative Glauber-Sudarshan P-function. We refer to these states as correlated-correlated (CC) Gaussian states. Using (<ref>) and (<ref>), the maximal correlation is given by\n\n    μ__CC(A,B)   = max_==1[ f̅_0 f̅_1 ][ ν/λ+1      ;     0 ν/λ-1 ][ g_0; g_1 ]\n       =ν/λ-1.\n \nHere, for g_0=f_0=0 and  g_1=f_1=1, we can see that optimal local operators X_A=_A√(2/(λ-1)) and Y_B=_B/√(2/(λ-1)) are not hermitian again. Of particular interest is the case of ν=λ-1 where μ__CC(A,B)=1. In this case, the Gaussian state can be written as\n\n    ρ_AB=∫2e^-2|α|^2/(λ-1)/(λ-1)π|α⟩⟨α|⊗|α⟩⟨α|^2α.\n\nUsing this representation, we can see that for any local measurements {Π_A,n: n} and  {Π_B,m: m}, \n\n    (ρ_ABΠ_A,n⊗Π_B,m)=∫   2e^-2|α|^2/(λ-1)/(λ-1)π⟨α|Π_A,n|α⟩\n       ×⟨α|Π_B,m|α⟩^2α≠0,\n\nfor any n and m. \nNote that here the positivity of measurement operators implies ⟨α|Π_B,n|α⟩≥0 and ⟨α|Π_A,m|α⟩≥0. Also, ⟨α|Π|α⟩ is, in general, an everywhere convergent power series in terms of α and α̅ and cannot be identical to zero on some nontrivial region, unless Π=0 <cit.>. Therefore, ⟨α|Π_A,n|α⟩⟨α|Π_B,m|α⟩ cannot be zero almost everywhere. As the joint outcome probability distribution (<ref>) is not in the form of (<ref>), μ__CC(A,B)=1 for ν=λ-1 cannot be achieved using hermitian local operators. This example shows that the maximal correlation of continuous-variable systems must be optimized over all hermitian and non-hermitian local operators.\n\n\nIt is easy to verify that even for non-Gaussian bipartite states of this form\n\n    ρ_AB=∫ P(α) |α⟩⟨α|⊗|α⟩⟨α|^2α,\n\nwhere P(α) is not necessarily Gaussian, the quantum maximal correlation of one is achieved using non-hermitian local operators X_A=(_A-⟨_A⟩)/Δ_A and Y_B=(_B-⟨_B⟩)/Δ_B with ⟨_A⟩=⟨_A⟩=∫ P(α)α ^2α and Δ_A^2=∫ P(α)|α|^2 ^2α-⟨_A⟩^2=Δ_B^2. This fact can also be verified by examples of two-qubit states; see the updated arXiv version of <cit.>.\n\n\nComparing the maximal correlation of the CC and CA states for the same marginal states and 0≤ν≤λ-1, in which case both states are separable, we can see that μ__CC(A,B)<μ__CA(A,B). Although the only difference between the two classes is the sign of the correlation, this shows that any arbitrary number of copies of the CC state cannot be  transformed to the CA state by local operations and without classical communication. We note, however, that these two states have the same amount of Gaussian maximal correlation since by (<ref>)  \n\n    μ_G_CA(A,B)=μ_G_CC(A,B)=ν/λ.\n\nHence, although the maximal correlation gives impossibility of local state transformation of the CC state to the CA state, the Gaussian maximal correlation cannot detect this. We also note that for these states the Gaussian maximal correlation is strictly less than the maximal correlation given by (<ref>) and (<ref>). \n\nAs an application of the Gaussian maximal correlation measure, suppose that a third party prepares a CA state ρ_AB and sends one subsystem to Alice and the other one to Bob through lossy channels. The covariance matrix of the shared state between Alice and Bob is given by <cit.>\n\n    [ (τ_Aλ+1-τ_A) I   √(τ_Aτ_B)ν Z;   √(τ_Aτ_B)ν Z  (τ_Bλ+1-τ_B)I;                ],\n\nwhere 0≤τ_A≤1 and 0≤τ_B≤1 are the transmissivities of lossy channels to Alice and Bob, and Z=diag(1,-1).  We can then see that, if τ_A<1 and/or τ_B<1, the Gaussian maximal correlation of the shared state is less than the Gaussian maximal correlation of the initial state,\n\n    √(τ_Aτ_B)ν/√((τ_Aλ+1-τ_A)(τ_Bλ+1-τ_B))<ν/λ.\n\nTherefore, using any arbitrary number of copies of the shared state and without classical communication, Alice and Bob cannot locally retrieve the initial state ρ_AB.\n\n\n\n\n\n\n§ MULTIPARTITE GAUSSIAN STATES\n\n\nClassical maximal correlation for multipartite probability distributions is first defined in <cit.>. The maximal correlation of an m-partite distribution is a subset of [0,1]^m, called the maximal correlation ribbon. This subset for m=2 is fully characterized in terms of  a single number that is the (bipartite) maximal correlation <cit.>. Thus, the maximal correlation ribbon is really a generalization of the (bipartite) maximal correlation. Moreover, maximal correlation ribbon satisfies the data processing and tensorization properties, which are required for the local state transformation problem in the multipartite case.\n\n\nIn this section, we first generalize the classical notion of the maximal correlation ribbon for multipartite quantum states. Then, we characterize the quantum maximal correlation ribbon for multipartite Gaussian states. Here, we briefly discuss these results and give the details in  Appendix <ref> and Appendix <ref>.\n\n\n\nFollowing the definition of the maximal correlation ribbon in the classical case <cit.>, in order to define a quantum maximal correlation ribbon we first need a notion of quantum conditional expectation. Let ρ_A^m=ρ_A_1, …, A_m be an m-partite quantum state, and let ρ_A_j, j=1, …, m be its marginal states. For simplicity we assume that ρ_A_j is full-rank for all j. Then, for any 1≤ j≤ m define the super-operator (·) by\n\n    _j(X) = _ j (Xρ_A^mρ_A_j^-1),\n\nwhere by _ j we mean tracing out all the subsystems except the j-th one. _j(·) behaves like a “conditional expectation\" whose properties are given in Lemma <ref> in Appendix <ref>.\n\nNext, recall that the variance of an operator X is defined by\n\n    (X)    = ⟨ X, X⟩_ρ_A^m - |(ρ_A^mX)|^2\n       = ⟨ X-(ρ_A^mX) I, X-(ρ_A^mX) I⟩_ρ_A^m\n       = X-(ρ_A^mX) I^2,\n\nwhere as before ⟨ X, Y⟩_ρ_A^m = (ρ_A^m X^† Y). \n\n\n\n\tFor an m-partite quantum state ρ_A_1, …, A_m let (A_1, …, A_m)⊆ [0,1]^m be the set of tuples (θ_1, …, θ_m) such that for any operator X=X_A^n we have\n\t\n    (X)≥∑_j θ_j (_j(X)).\n\n\tWe call  (A_1, …, A_m) the maximal correlation ribbon (MC ribbon) of ρ_A_1, …, A_m.\n\n\n\nRemark that since (X)≥ 0, in the definition of (A_1, …, A_m) we restrict to θ_j≥ 0. Moreover, as shown in Lemma <ref> in Appendix <ref>, we have \n\n    (X)≥(_j(X)),   ∀ j.\n\nThus, (<ref>) implies θ_j≤ 1. This is why (A_1, …, A_m) is defined as a subset of [0,1]^m. Moreover, by (<ref>), any (θ_1, …, θ_m)∈ [0,1]^m with ∑_j θ_j≤ 1 belongs to (A_1, …, A_m) for any ρ_A^m. Thus, the interesting part of (A_1, …, A_m) is the subset [0,1]^m beyond the above trivial subset. Finally, from the definition, it is clear that (A_1, …, A_m) is a convex set. See Figure <ref> for a typical shape of the MC ribbon. \n\n  \n\nIt can be shown that for product states ρ_A^m= ρ_A_1⊗⋯⊗ρ_A_m, the MC ribbon is the largest possible set: (A_1, …, A_m)= [0,1]^m. On the other hand, for the maximally entangled state 1/√(2)(|00⟩ +|11⟩), the MC ribbon consists of only trivial points: (A_1, A_2)= {(θ_1, θ_2)∈ [0,1]^2: ∑_j θ_j≤ 1 }. See Appendix <ref> for more details.\n\nIn particular, as shown in Theorem <ref> in Appendix <ref> when m=2, the pair (θ_1, θ_2)∈ [0,1]^2 belongs to (A_1, A_2) if and only if\n\n    (1/θ_1 -1 )(1/θ_2 -1 )≥μ^2(A_1, A_2),\n\nwhere μ(A_1, A_2) is the maximal correlation of the bipartite state. This shows that the  MC ribbon can be viewed as the generalization of the maximal correlation.\n\nAs shown in Theorem <ref> in Appendix <ref>, maximal correlation ribbon also satisfies the data processing and the tensorization properties:\n\n\t\n  * (Data processing) For local quantum operations Φ^(j)_A_j→ A'_j, if\n\t\n    σ_A'^m = Φ^(1)_A_1→ A'_1⊗⋯⊗Φ^(m)_A_m→ A'_m(ρ_A^m),\n\n\tthen (A_1, …, A_m)⊆(A'_1, …, A'_m).\n\t\n\t\n  * (Tensorization) For any ρ_A^m and any integer n we have\n\t\n    (A_1^n,…, A_m^n) = (A_1,…,  A_m),\n\n\twhere the left hand side is the MC ribbon of ρ_A^m^⊗ n.\n\n\nThese two properties show that the MC ribbon is a relevant invariant for the local state transformation problem in the multipartite case. \n\nNow we get to our main problem, namely, how to compute the MC ribbon for multipartite Gaussian states. The following theorem, that is a generalization of Theorem <ref>, is our main result in this direction.\n\n (Informal)\n\tTo compute the MC ribbon for Gaussian state it suffices to restrict X in (<ref>) to operators that are linear in phase-space quadrature operators.\n\n\nFor a formal statement of this result and its proof see Appendix <ref>. \n\nMotivated by the definition of the Gaussian maximal correlation (<ref>), we can define a Gaussian maximal correlation ribbon for multipartite Gaussian states as follows. For an m-mode Gaussian state ρ_A_1, …, A_m let _G(A_1, …, A_m) be the set of tuples (θ_1, …, θ_m)∈ [0,1]^m satisfying \n\t\n    (∑_j=1^m X_j) ≤∑_j=1^m 1/θ_j(X_j),\n\n\tfor all local operators X_1, …, X_m that are hermitian and linear in terms of phase-space quadrature operators. We note that, by Theorem <ref> in Appendix <ref>, removing the latter constraints on X_j's, we recover (A_1, …, A_m). Therefore, we have (A_1, …, A_m)⊆_G(A_1, …, A_m). Moreover, it is not hard to verify that _G(A_1, …, A_m) is monotone under the action of local Gaussian operations and satisfies tensorization (in the sense of Theorem <ref>).\n\nTo find an equivalent characterization of _G(A_1, …, A_m),\n\ta straightforward computation as in the bipartite case shows that (θ_1, …, θ_m) belongs to _G(A_1, …, A_m) if and only if \n\t\n    [ 1/θ_1_A_1         0         ⋯         0;         0 1/θ_2_A_2         ⋯         0;         ⋮         ⋮         ⋱         ⋮;         0         0         ⋯ 1/θ_m_A_m ]≥_A_1, …, A_m,\n\n\twhere _A_1, …, A_m is the covariance matrix of ρ_A_1, …, A_m and _A_j is the covariance matrix of its marginal ρ_A_j.\n\n\n\n\n\n§ DISCUSSION\n\n\nThe maximal correlation is of particular interest for the local state transformation problem, where two parties are restricted to local operations but do not have access to classical communication. \nWe have shown that the maximal correlation for bipartite Gaussian states can be simply calculated by restricting the optimization to local operators that are linear in terms of the phase-space quadrature operators. These optimal local operators may not be hermitian and therefore the maximal correlation, in general, is an upper bound on the classical maximal correlation of the joint outcome probability distribution associated with optimal local measurements (local hermitian observables). Using our results, one can investigate the problem of local state transformation with local operations when either the resource or the target state is Gaussian.\n\nWe have also introduced the Gaussian maximal correlation, as another measure of correlation for Gaussian states, by restricting the optimization to the class of hermitian and linear operators in terms of quadrature operators. This measure corresponds to performing optimal homodyne measurements on the phase-space quadratures, and is relevant to the local state transformation when both the resource and the target states are Gaussian. Nevertheless, we have shown through examples, that sometimes the maximal correlation gives stronger bounds on the local state transformation \ncompared to the Gaussian maximal correlation even if both the states are Gaussian.\n\n\nAn interesting question, motivated by the definition of the Gaussian maximal correlation, is whether one can define other variants of maximal correlation by considering hermitian local operators that are quadratic or higher order in terms of quadrature operators. As we have shown for two-mode squeezed vacuum states, the optimal local measurements yielding the maximal correlation of one are photon-counting measurements that are non-Gaussian. This suggests that the maximization in the Gaussian maximal correlation can be further optimized using hermitian and quadratic operators in terms of quadrature operators. We leave the study of the properties of such invariants for future works.\n\n\nWe have also generalized the maximal correlation to the quantum maximal correlation ribbon for the multipartite case. We have shown that the quantum maximal correlation ribbon of Gaussian states can also be computed by restricting to local operators that are linear in terms of quadrature operators. Further, we have discussed its Gaussian version based on using Gaussian local observables.\n\nIn this paper, both in the bipartite and multipartite cases, in the computation of maximal correlation for Gaussian states we assume that each subsystem consists of a single mode. Another interesting problem it to generalize our results to cases where each party can have more than one mode of the shared Gaussian state. For example, one can consider the maximal correlation of a Gaussian state ρ_AB in which each subsystem A, B consists of two modes.\n\nHypercontractivity ribbon is another invariant of quantum states that gives bounds on the local state transformation problem <cit.>. It would be interesting to compute the hypercontractivity ribbon for Gaussian states. \n\nFinally, the quantum maximal correlation is really a measure of correlation and not a measure of entanglement, as it can take its maximum value on separable states. It is desirable to find a measure of entanglement that satisfies the tensorization property; see <cit.> for an attempt  in this direction. \n\n\n\n\n\n\n35\n\tfxundefined [1]\n\t\tifx#1\n\t\n\tfnum [1]\n\t\t#1firstoftwo\n\t\tsecondoftwo\n\t\t\n\tfx [1]\n\t\t#1firstoftwo\n\t\tsecondoftwo\n\t\t\n\t\n\t\n\t\n\t\n\t\n\tnoop [0]secondoftwo\n\t\n\tref[1]@startlink#1@href\n\thref[1]#1@endlink\n\tanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\n\tstartlink[1]\n\tendlink[0]\n\t\n\trl [1]href #1\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t@bib@innerbibempty\n\t\n\t[Bennett et al.(1996a)Bennett, Bernstein, Popescu, and Schumacher]BennettPRA1996\n\tauthor author C. H. Bennett, author H. J. Bernstein, author S. Popescu,\t\tand author B. Schumacher,\ttitle title Concentrating partial entanglement by\n\t\t\tlocal operations, https://doi.org/10.1103/PhysRevA.53.2046\n\tjournal journal Phys. Rev. A volume 53, pages 2046 (year\n\t\t1996a)NoStop\n\t[Bennett et al.(1996b)Bennett, Brassard, Popescu, Schumacher,\n\t\tSmolin, and Wootters]BennettPRL1996\n\tauthor author C. H. Bennett, author G. Brassard,\n\t\tauthor S. Popescu, author B. Schumacher, author\n\t\tJ. A. Smolin, and author\n\t\tW. K. Wootters, title\n\ttitle Purification of noisy entanglement and faithful\n\t\t\tteleportation via noisy channels, https://doi.org/10.1103/PhysRevLett.76.722 journal journal Phys. Rev. Lett. volume 76, pages 722 (year 1996b)NoStop\n\t[Bennett et al.(1996c)Bennett, DiVincenzo, Smolin, and Wootters]BennettPRA1996-2\n\tauthor author C. H. Bennett, author D. P. DiVincenzo, author J. A. Smolin, and author W. K. Wootters, title title Mixed-state entanglement\n\t\t\tand quantum error correction, https://doi.org/10.1103/PhysRevA.54.3824 journal journal Phys. Rev. A volume 54, pages 3824 (year 1996c)NoStop\n\t[Horodecki et al.(2009)Horodecki, Horodecki, Horodecki, and\t\tHorodecki]HorodeckiRMP2009\n\tauthor author R. Horodecki, author P. Horodecki, author M. Horodecki, and author K. Horodecki, title title Quantum entanglement,\thttps://doi.org/10.1103/RevModPhys.81.865 journal\n\t\tjournal Rev. Mod. Phys. volume 81,\t\tpages 865 (year 2009)NoStop\n\t[Horodecki et al.(1998)Horodecki, Horodecki, and Horodecki]HorodeckiPRL98\n\tauthor author M. Horodecki, author P. Horodecki, and author R. Horodecki, title title Mixed-state\n\t\t\tentanglement and distillation: Is there a “bound” entanglement in\n\t\t\tnature?, https://doi.org/10.1103/PhysRevLett.80.5239 journal journal Phys. Rev. Lett. volume 80, pages 5239 (year\n\t\t1998)NoStop\n\t[Beigi(2013)]Beigi13\n\tauthor author S. Beigi, title title A new quantum data\n\t\t\tprocessing inequality, https://doi.org/10.1063/1.4818985\n\tjournal journal Journal of Mathematical Physics\t\tvolume 54, pages 082202 (year 2013)NoStop\n\t[Ghazi et al.(2016)Ghazi,\n\t\tKamath, and Sudan]GhaziFOCS2016\n\tauthor author B. Ghazi, author P. Kamath, and\t\tauthor M. Sudan, title title Decidability of non-interactive simulation of\n\t\t\tjoint distributions, in https://doi.org/10.1109/FOCS.2016.65\n\tbooktitle 2016 IEEE 57th Annual Symposium on Foundations\n\t\t\t\tof Computer Science (FOCS) (year 2016) pp. pages 545–554NoStop\n\t[Qin and Yao(2021)]QinYao2021\n\tauthor author M. Qin and author P. Yao,\ttitle title Nonlocal games with noisy maximally\n\t\t\tentangled states are decidable, https://doi.org/10.1137/20M134592X\n\tjournal journal SIAM Journal on Computing\t\tvolume 50, pages 1800 (year\n\t\t2021)NoStop\n\t[Lami et al.(2018)Lami,\n\t\tRegula, Wang, Nichols,\n\t\tWinter, and Adesso]LamiPRA2018\n\tauthor author L. Lami, author B. Regula,\n\t\tauthor X. Wang, author\n\t\tR. Nichols, author A. Winter, and author G. Adesso, title title Gaussian\n\t\t\tquantum resource theories, https://doi.org/10.1103/PhysRevA.98.022335 journal journal Phys. Rev. A volume 98, pages 022335 (year 2018)NoStop\n\t[Lami et al.(2019)Lami,\n\t\tRegula, and Adesso]LamiPRL2019\n\tauthor author L. Lami, author B. Regula, and\t\tauthor G. Adesso, title title Generic bound coherence under strictly incoherent\n\t\t\toperations, https://doi.org/10.1103/PhysRevLett.122.150402\n\tjournal journal Phys. Rev. Lett. volume 122, pages 150402 (year\n\t\t2019)NoStop\n\t[Lee et al.(2022)Lee,\n\t\tBaek, Park, Kim, and\t\tNha]LeePRR2022\n\tauthor author J. Lee, author K. Baek, author J. Park, author\n\t\tJ. Kim, and author\n\t\tH. Nha, title title Fundamental limits on concentrating and preserving tensorized\n\t\t\tquantum resources, https://doi.org/10.1103/PhysRevResearch.4.043070 journal\n\t\tjournal Phys. Rev. Research volume\n\t\t\t4, pages 043070 (year 2022)NoStop\n\t[Eisert et al.(2002)Eisert,\n\t\tScheel, and Plenio]EiserScheelPlenio\n\tauthor author J. Eisert, author S. Scheel,\t\tand author M. B. Plenio,\ttitle title Distilling gaussian states with\n\t\t\tgaussian operations is impossible, https://doi.org/10.1103/PhysRevLett.89.137903 journal\n\t\tjournal Phys. Rev. Lett. volume 89,\t\tpages 137903 (year 2002)NoStop\n\t[Giedke and Ignacio Cirac(2002)]GiedkeCirac02\n\tauthor author G. Giedke and author J. Ignacio Cirac, title title Characterization of\n\t\t\tgaussian operations and distillation of gaussian states, https://doi.org/10.1103/PhysRevA.66.032316 journal journal Phys. Rev. A volume 66, pages 032316 (year 2002)NoStop\n\t[Fiurá ššek(2002)]FiurasekPRL2002\n\tauthor author J. Fiurá ššek, title\n\ttitle Gaussian transformations and distillation of entangled\n\t\t\tgaussian states, https://doi.org/10.1103/PhysRevLett.89.137904\n\tjournal journal Phys. Rev. Lett. volume 89, pages 137904 (year\n\t\t2002)NoStop\n\t[Giedke and Kraus(2014)]GiedkeKraus14\n\tauthor author G. Giedke and author B. Kraus,\ttitle title Gaussian local unitary equivalence of\n\t\t\tn-mode gaussian states and gaussian transformations by local operations\n\t\t\twith classical communication, https://doi.org/10.1103/PhysRevA.89.012335 journal journal Phys. Rev. A volume 89, pages 012335 (year 2014)NoStop\n\t[Hirschfeld(1935)]Hirschfeld1935\n\tauthor author H. O. Hirschfeld, title title A connection between\n\t\t\tcorrelation and contingency, https://doi.org/10.1017/S0305004100013517 journal journal Mathematical Proceedings of the Cambridge Philosophical Society\t\tvolume 31, pages 520 (year\n\t\t1935)NoStop\n\t[Gebelein(1941)]Gebelein1941\n\tauthor author H. Gebelein, title title Das statistische problem\n\t\t\tder korrelation als variations- und eigenwertproblem und sein zusammenhang\n\t\t\tmit der ausgleichsrechnung, https://doi.org/https://doi.org/10.1002/zamm.19410210604 journal journal ZAMM - Journal of Applied Mathematics and\n\t\t\t\tMechanics / Zeitschrift für Angewandte Mathematik und Mechanik volume 21, pages 364 (year\n\t\t1941)NoStop\n\t[Rényi(1959)]Renyi1959Measures\n\tauthor author A. Rényi, title title On measures of\n\t\t\tdependence, https://doi.org/10.1007/BF02024507 journal journal Acta Mathematica Academiae Scientiarum\n\t\t\t\tHungarica volume 10, pages 441\n\t\t(year 1959)NoStop\n\t[Witsenhausen(1975)]Witsenhausen1975\n\tauthor author H. S. Witsenhausen, title title On sequences of\n\t\t\tpairs of dependent random variables, https://doi.org/10.1137/0128010 journal journal\n\t\t\tSIAM Journal on Applied Mathematics volume 28,\t\tpages 100 (year 1975)NoStop\n\t[Lancaster(1957)]Lancaster\n\tauthor author H. O. Lancaster, title title Some properties of the\n\t\t\t\tbivariate normal distribution considered in the form of a contingency\n\t\t\t\ttable, https://doi.org/10.1093/biomet/44.1-2.289 journal journal Biometrika volume\n\t\t\t44, pages 289 (year 1957)NoStop\n\t[Serafini(2017)]Serafini17\n\tauthor author A. Serafini, https://doi.org/10.1201/9781315118727 title Quantum Continuous Variables: A Primer of Theoretical Methods\t(publisher CRC press, year 2017)NoStop\n\t[Adesso et al.(2014)Adesso,\n\t\tRagy, and Lee]Adesso+14\n\tauthor author G. Adesso, author S. Ragy, and\t\tauthor A. R. Lee, title title Continuous variable quantum information: Gaussian\n\t\t\tstates and beyond, https://doi.org/10.1142/S1230161214400010\n\tjournal journal Open Systems & Information\n\t\t\t\tDynamics volume 21, pages 1440001\n\t\t(year 2014)NoStop\n\t[Wigner(1932)]Wigner\n\tauthor author E. Wigner, title title On the quantum correction\n\t\t\tfor thermodynamic equilibrium, https://doi.org/10.1103/PhysRev.40.749 journal journal Phys. Rev. volume 40, pages\n\t\t749 (year 1932)NoStop\n\t[Glauber(1963)]Glauber1963\n\tauthor author R. J. Glauber, title title Photon correlations,\thttps://doi.org/10.1103/PhysRevLett.10.84 journal\n\t\tjournal Phys. Rev. Lett. volume 10,\t\tpages 84 (year 1963)NoStop\n\t[Sudarshan(1963)]Sudarshan1963\n\tauthor author E. C. G.\t\t\tSudarshan, title title\n\t\tEquivalence of semiclassical and quantum mechanical descriptions of\n\t\t\tstatistical light beams, https://doi.org/10.1103/PhysRevLett.10.277 journal journal Phys. Rev. Lett. volume 10, pages 277 (year 1963)NoStop\n\t[Cahill(1965)]Cahill1965\n\tauthor author K. E. Cahill, title title Coherent-state\n\t\t\trepresentations for the photon density operator, https://doi.org/10.1103/PhysRev.138.B1566 journal journal Phys. Rev. volume 138, pages\n\t\tB1566 (year 1965)NoStop\n\t[Mandel(1986)]Mandel1986\n\tauthor author L. Mandel, title title Non-classical states of\n\t\t\tthe electromagnetic field, https://doi.org/10.1088/0031-8949/1986/t12/005 journal\n\t\tjournal Physica Scripta volume T12,\t\tpages 34 (year 1986)NoStop\n\t[Titulaer and Glauber(1965)]Titulaer1965\n\tauthor author U. M. Titulaer and author R. J. Glauber, title title Correlation functions for\n\t\t\tcoherent fields, https://doi.org/10.1103/PhysRev.140.B676\n\tjournal journal Phys. Rev. volume 140, pages B676 (year\n\t\t1965)NoStop\n\t[Hall(2013)]Hall13\n\tauthor author B. C. Hall, https://doi.org/10.1007/978-1-4614-7116-5 title Quantum Theory for Mathematicians, Vol. volume\n\t267 (publisher Springer New York, NY, year\n\t2013)NoStop\n\t[Cahill and Glauber(1969)]Cahill1969-I\n\tauthor author K. E. Cahill and author R. J. Glauber, title title Ordered expansions in\n\t\t\tboson amplitude operators, https://doi.org/10.1103/PhysRev.177.1857 journal journal Phys. Rev. volume 177, pages\n\t\t1857 (year 1969)NoStop\n\t[Holevo(2019)]Holevo2019\n\tauthor author A. S. Holevo, https://doi.org/doi:10.1515/9783110642490 title A Mathematical Introduction (publisher De\n\t\tGruyter, address Berlin, Boston, year\n\t2019)NoStop\n\t[Beigi and Gohari(2018)]BeigiGohari18\n\tauthor author S. Beigi and author A. Gohari,\ttitle title ϕ-entropic measures of\n\t\t\tcorrelation, https://doi.org/10.1109/TIT.2018.2806965 journal journal IEEE Transactions on Information Theory\t\tvolume 64, pages 2193 (year\n\t\t2018)NoStop\n\t[Delgosha(2014)]DelgoshaBeigi2014\n\tauthor author B. S. Delgosha, P., title title\n\t\tImpossibility of local state transformation via hypercontractivity, https://doi.org/https://doi.org/10.1007/s00220-014-2105-y journal journal Commun. Math. Phys. volume 332, pages 449 (year\n\t\t2014)NoStop\n\t[Beigi(2014)]beigi14\n\tauthor author S. Beigi, title title Maximal entanglement – a\n\t\t\tnew measure of entanglement, in https://doi.org/10.1109/IWCIT.2014.6842486 booktitle\n\t\t\t2014 Iran Workshop on Communication and Information Theory (IWCIT)\t(publisher IEEE, year 2014) pp. pages 1–6NoStop\n\t[Bhatia(2007)]Bhatia-P\n\tauthor author R. Bhatia, https://doi.org/https://doi.org/10.1515/9781400827787\n\ttitle Positive Definite Matrices (publisher Princeton University Press, year\n\t2007)NoStop\n\n\n\n\n\n\n\n\n\n\n\n§ QUANTUM MAXIMAL CORRELATION RIBBON\n\n\nIn this appendix we discuss in details some properties of the quantum maximal correlation ribbon mentioned in Section <ref>. We start with the conditional expectation operator defined by\n\n    _j(X) = _ j (Xρ_A^mρ_A_j^-1),\n\nwhere _ j means partial trace with respect to all subsystems except the j-th one. We note that _j maps an operator acting on the whole system A^m to an operator acting only on the j-th subsystem.\n\n\n\n\n\n  * If Y is an operator acting on the j-th subsystem, then for any X we have\n\n    ⟨ Y, X⟩_ρ_A^m = ⟨ Y, _j(X)⟩_ρ_A_j,\n\nwhere the inner product is given in (<ref>).\n\n  * _j is a projection, i.e., _j^2=_j.\n\n  * _j is self-adjoint with respect to the inner product ⟨·, ·⟩_ρ_A^m. \n\n  * For an operator X define its variance by\n\n    (X)    = X-(ρ_A^mX) I_ρ_A^m^2\n       = ⟨ X-(ρ_A^mX) I, X-(ρ_A^mX) I⟩_ρ_A^m\n       = ⟨ X, X⟩_ρ_A^m - |(ρ_A^mX)|^2.\n\nThen, we have\n\n    (X) = (_j(X)) + (X-_j(X)).\n\nMoreover, since (X-_j(X))≥ 0 we have  (X)≥(_j(X)).\n\n\n\n\n\nEquation (<ref>) can be understood as a quantum generalization of the law of total variance. \n\n\n(i) Since Y acts on the j-th subsystem we have\n\n    ⟨ Y, X⟩_ρ_A^m   = (ρ_A^m Y^† X) = (Y^† X ρ_A^m) = (Y^†_ j(X ρ_A^m) ) =  ( ρ_A_jY^†_ j(X ρ_A^m) ρ_A_j^-1)\n       = ( ρ_A_jY^†_ j(X ρ_A^mρ_A_j^-1)  )= ⟨ Y, _j(X)⟩_ρ_A_j.\n\n\n(ii) We need to show that for Y_A_j, acting on the j-th subsystem, we have _j(Y)=Y. We compute\n\n    _j(Y)= _ j(Yρ_A^mρ_A_j^-1) = Y _ j(ρ_A^m) ρ_A_j^-1=Y ρ_A_jρ_A_j^-1=Y.\n\n\n(iii) We need to show that ⟨_j(X), Y⟩_ρ_A^m = ⟨ X, _j(Y)⟩_ρ_A^m. We compute\n\n    ⟨_j(X), Y⟩_ρ_A^m    = (ρ_A^m_j(X)^† Y) = ( ρ_A^m_ j(Xρ_A^mρ_A_j^-1)^† Y  ) \n       = (  _ j(Xρ_A^mρ_A_j^-1)^†_ j (Yρ_A^m)  ) = (  _ j( ρ_A_j^-1ρ_A^m X^†) _ j (Yρ_A^m)  ) \n       = (  ρ_A_j^-1_ j(  ρ_A^m X^†) _ j (Yρ_A^m)  ) = (   _ j(  ρ_A^m X^†) _ j (Yρ_A^m) ρ_A_j^-1) \n       = (   _ j(  ρ_A^m X^†) _ j (Yρ_A^mρ_A_j^-1)  )\n    = (    ρ_A^m X^†_ j (Yρ_A^mρ_A_j^-1)  ) \n       = (ρ_A^m X^†_j(Y))\n       = ⟨ X, _j(Y)⟩_ρ_A^m.\n\n\n(iv) Let Y=X-_j(X). By (i) and the fact that I_A^m can be considered as an operator acting on the j-th subsystem, we have ⟨ I_A^m, X⟩_ρ_A^m = ⟨ I_A_j, _j(X)⟩_ρ_A_j\n and (ρ_A^mY) = ⟨ I_A^m, Y⟩_ρ_A^m = 0. This, in particular, means that (ρ_A^mX)=  (ρ_A_j_j(X)). Therefore,\n\n    (Y)    = ⟨ Y, Y⟩_ρ_A^m= ⟨ X-_j(X), X-_j(X)⟩_ρ_A^m\n       = ⟨ X, X⟩_ρ_A^m -⟨ X, _j(X)⟩_ρ_A^m - ⟨_j(X), X⟩_ρ_A^m +⟨_j(X), _j(X)⟩_ρ_A_j\n       = ⟨ X, X⟩_ρ_A^m -⟨_j(X), _j(X)⟩_ρ_A_j\n       = ⟨ X, X⟩_ρ_A^m + |(ρ_A^mX)|^2 -  |(ρ_A_j_j(X))|^2 -⟨_j(X), _j(X)⟩_ρ_A_j\n       = (X) - (_j(X)),\n\nwhere in the third line we use (i).\n\n\n\n\nNow recall that the maximal correlation ribbon is defined by\n\n    (A_1, …, A_m) = {(θ_1, …, θ_m): (X)≥∑_j θ_j (_j(X)), ∀ X}.\n\nIn the above definition (when the underlying Hilbert space is infinite dimensional), X runs over the space _A^m of operators for which ⟨ X, X⟩_ρ_A^m is finite. We note that for such an X∈_A^m, by the Cauchy-Schwarz inequality (ρ_A^m X)=⟨ I,  X⟩_ρ_A^m is also finite. Moreover, by the low of total variance established in Lemma <ref>, _j maps _A^m to _j, the space of operators X_j acting on the j-th subsystem with ⟨ X_j, X_j⟩_ρ_j<∞. Thus, (A_1, …, A_m) is well-defined even in the infinite dimensional case.\n\n\nTo establish (θ_1, …, θ_m)∈(A_1, …, A_m) we need to verify an inequality for all operators X∈_A^m acting on the whole system A^m. In the following we show that we may restrict X to be a linear combination of local operators belonging to _j. We note that \n\n    =_1+⋯ + _m⊂_A^m,\n \nis a subspace of _A^m, where _1+⋯ + _m is the closure of the subspace _1+⋯ + _m. Moreover, _A^m is equipped with the inner product ⟨·, ·⟩_ρ_A^m. Thus, we may consider the orthogonal complement of  in _A^m:\n\n    = ^⊥,     _A^m = ⊕=(_1+⋯ + _m)⊕.\n\nLet Y∈. Then, by the orthogonality condition and part (i) of Lemma <ref> for X_A_j∈_j⊂  we have\n\n    0=⟨ Y, X_A_j⟩_ρ_A^n= ⟨_j(Y), X_A_j⟩_ρ_A_j.\n\nThus, _j(Y) is an operator acting on the j-th subsystem that is orthogonal to all local operators in _j. This means that _j(Y)=0 for all j and Y∈. Moreover, since I_A^m∈ we have (ρ_A^mY)=⟨ I_A^m, Y⟩_ρ_A^m =0.\n\n\nIn the definition of the MC ribbon in (<ref>) we may restrict to X∈. That is, we may restrict to operators that are linear combinations of local ones. Moreover, we may assume that (ρ_A^mX)=0. \n\n\n\nFirst, by continuity we may assume that X belongs to (_1+⋯ + _m)⊕⊆(_1+⋯ + _m)⊕ = _A^m. \nSuch an X can be written as \n\n    X = X_1+⋯ + X_m + Y,\n\nwhere X_j∈_j and Y∈. Let X'=X_1+⋯ + X_m∈. Then, by the above discussion we have _j(X) = _j(X'). Moreover, using ⟨ X', Y⟩_ρ_A^m=0 and (ρ_A^mY) we have\n\n    (X)    = (X' + Y) =⟨ X'+Y - (ρ_A^mX'), X'+Y - (ρ_A^mX')⟩_ρ_A^m\n       =⟨ X' - (ρ_A^mX'), X' - (ρ_A^mX')⟩_ρ_A^m + ⟨ Y , Y ⟩_ρ_A^m\n        = (X') + (Y)\n       ≥(X').\n\nPutting these together we find that if the inequality in (<ref>) holds for X', then it holds for X. \n\nWe also note that (X) = (X+ cI_A^n) and (_j(X)) = (_j(X) + cI_A_j)=(_j(X+ cI_A^n)). Thus, without loss of generality we can assume that X in (<ref>) satisfies (ρ_A^mX)=0.\n\n\n\nFor any 1≤ j≤ m let \n\n    _j^0 = {X∈_j: (ρ_A_j X)=0},\n\nand ^0 = _1^0+⋯+ _m^0. Observe that _j^0 is the orthogonal complement of the identity operator in _j, and we have\n\n    _A^m = ℂI⊕_m^0⊕.\n\nBy the above proposition, in the definition of the MC ribbon we may restrict to X∈_1^0+⋯+ _m^0.\n\n\n\n\n\nFor any 1≤ j≤ m let \n{F_j,k: k=1, 2, …}⊂_j^0,\nbe an orthonormal basis for _j^0, where _j^0 is defined in (<ref>). Define\n\n    g_jk, j'k':= ⟨ F_j, k, F_j', k'⟩_ρ_A^m,\n\nand let 𝒢=(g_jk, j'k') be the Gram matrix associated with the set ⋃_j {F_j,k: k=1, 2, …}. Also for (θ_1, …, θ_m)∈ [0,1]^m let Θ be the diagonal matrix \n\n    Θ_jk, j'k'=δ_j, j'δ_k, k'θ_j.\n\nThen (θ_1, …, θ_m)∈(A_1, …, A_m) if and only if \nΘ^-1≥,\nmeaning that Θ^-1- is positive semidefinite. Equivalently, (θ_1, …, θ_m)∈(A_1, …, A_m) if and only if for every X_j∈_j^0, j=1, …, m, we have\n\n    (∑_j=1^m X_j) ≤∑_j=1^m 1/θ_j(X_j).\n\n\n\n\nBy assumption any X∈^0 can be written as\n\n    X= ∑_j=1^m ∑_k c_jk F_j, k.\n\nSince (ρ_A^mX)=0 we have\n\n    (X) =⟨ Y, Y⟩_ρ_A^m = ∑_j, j'=1^m ∑_k, k'c̅_jk c_j'k'⟨ F_j, k, F_j', k'⟩_ρ_A^m = ^†,\n\nwhere  is the vector of coefficients c_jk. Next, using _j(X)∈_j^0 we have\n\n    (_j(X))    = ⟨_j(X), _j(X)⟩_ρ_A^m\n       = _j(X)^2\n       = ∑_k |⟨ F_j, k, _j(X)⟩_ρ_A_j |^2 \n       = ∑_k |⟨ F_j, k, X⟩_ρ_A^m |^2 \n       = ∑_k |∑_j', k' c_j'k' g_jk, j'k'|^2.\n\nAlso, a simple computation shows that \n\n    ∑_j=1^m θ_j (_j(X))  =∑_j=1^m θ_j (∑_k |∑_j', k' c_j'k' g_jk, j'k'|^2) = ^† G^†Θ.\n\nTherefore, (θ_1, …, θ_m)∈(A_1,…, A_m) if and only if \n\n\n    ^†≥^†Θ.\n\nEquivalently, this means that ≥^†Θ. Now note that  is the Gram matrix of a linearly independent set, and is invertible. Hence, multiplying both sides from left and right by ^-1=(^†)^-1, we find that ≥Θ is equivalent to ^-1≥Θ. Next, using the fact that t↦ 1/t is operator monotone <cit.>, we obtain the equivalence of (θ_1, …, θ_m)∈(A_1, …, A_m) and\n\n    Θ^-1≥.\n\nThis equation means that for any  we have ^†Θ^-1≥^†. Then, thinking of  as the vector of coefficients of the expansions of operators X_j∈_j^0 in  bases {F_j, k:  k=1, 2, …} for j=1, …, m, and following similar calculations as above, it is not hard to verify that the above equation is equivalent to (<ref>).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLet us use this theorem to compute the MC ribbon for the example of a product state ρ_A^m=ρ_A_1⊗⋯ρ_A_m. In this case, for basis operators F_j, k, F_j', k' with j≠ j' we have\n\n    ⟨ F_j, k, F_j', k'⟩_ρ_A^m = (ρ_A_j⊗ρ_A_j'  F_j, k^†⊗ F_j', k'  ) \n    = (ρ_A_j F_j, k^†)(ρ_A_j' F_j', k'  )=0.\n\nThus, the Gram matrix  is the identity matrix. In this case, for any (θ_1, …, θ_m)∈ [0,1]^m and its associated matrix Θ we have Θ^-1≥. This means that (A_1, …, A_m) =[0,1]^m. That is, for product states, the MC ribbon is the largest possible set. \n\n\n\n\n\nThe following theorem shows that MC ribbon is really a generalization of the maximal correlation in the bipartite case.\n\n\nIn the case of m=2 we have\n\n    (A_1, A_2) = {(θ_1, θ_2)∈ [0,1]^2: (1/θ_1 -1 )(1/θ_2 -1 )≥μ^2(A_1, A_2))}.\n\n\n\n\nBy Theorem <ref>, (θ_1, θ_2)∈ [0,1]^2 belongs to (A_1, A_2) iff for any X_j∈_j^0, j=1, 2 we have\n\n    (X_1+X_2)≤1/θ_1(X_1) +1/θ_2(X_2).\n\nWe note that since (ρ_A_1X_1)=(ρ_A_2X_2)=0 we have \n\n    (X_1+X_2) = ⟨ X_1, X_1⟩_ρ_A_1+⟨ X_2, X_2⟩_ρ_A_2 + 2Re⟨ X_2, X_1⟩_ρ_A^2.\n\nThen, (θ_1, θ_2)∈(A_1, A_2) iff for every X_j∈_j^0, j=1, 2 we have\n\n    2Re⟨ X_2, X_1⟩_ρ_A^2≤(1/θ_1-1) (X_1) +(1/θ_2-1) (X_2).\n\nScaling X_1, X_2 and replacing them with c_1X_1, c_2X_2 we obtain\n\n    2Re(c_1c̅_2 ⟨ X_2, X_1⟩_ρ_A^2)≤  |c_1|^2 (1/θ_1-1) (X_1) + |c_2|^2(1/θ_2-1) (X_2),     ∀ c_1, c_2.\n\nThis is equivalent to \n\n    [     (1/θ_1-1) (X_1) - ⟨ X_1, X_2⟩_ρ_A^2;  -⟨ X_2, X_1⟩_ρ_A^2     (1/θ_2-1) (X_2) ]≥ 0,\n\nbeing positive semidefinite, that itself is equivalent to \n\n    |⟨ X_1, X_2⟩_ρ_A^2| ≤√((1/θ_1-1)( 1/θ_2-1) )√((X_1)(X_2)).\n\nTherefore, (θ_1, θ_2)∈(A_1, A_2) iff\n\n    max|⟨ X_1, X_2⟩_ρ_A_2|/√((X_1)(X_2))≤√((1/θ_1-1)( 1/θ_2-1) ),\n\nwhere the maximum is taken over X_1∈_1^0 and X_2∈_2^0. We note that by definition the left hand side is equal to μ(A_1, A_2).\n\n\n\nRecall that for |ψ⟩_A_1A_2 = 1/√(2) (|00⟩+|11⟩) we have μ(A_1, A_2)=1. Thus, by the above theorem, (θ_1, θ_2)∈(A_1, A_2) iff (1/θ_1-1)(1/θ_2-1)≥ 1 that is equivalent to θ_1+θ_2≤ 1.\nTherefore, the MC ribbon for |ψ⟩_A_1A_2 is the smallest possible set.\n\n\nFor the next result we first need a lemma.\n\n\nLet X, X', Y, Y' be positive semidefinite matrices with the block forms X=(X_ij), X'=(X'_ij), Y=(Y_ij), Y'=(Y'_ij).\nSuppose that X≥ Y and X'≥ Y', meaning that X-Y and X'-Y' are positive semidefinite. Then,\n\n    X⊠ X'≥ Y⊠ Y',\n\nwhere X⊠ X' is a matrix whose ij-th block equals X_ij⊗ X'_ij, and Y⊠ Y' is defined similarly.\n\n\n\nSince X-Y and X'-Y' as well as X', Y are positive semidefinite, (X-Y)⊗ X' and Y⊗ (X'-Y') are positive semidefinite. This means that (X-Y)⊗ X'+Y⊗ (X'-Y')= X⊗ X'-Y⊗ Y' is positive semidefinite. Now, we note that X⊠ X'-Y⊠ Y' is a principal submatrix of X⊗ X'-Y⊗ Y', so is positive semidefinite. \n\n\n\nWe now prove the main properties of the MC ribbon, namely the data processing inequality and the tensorization.\n\n\n\n\n\n  * (Data processing) Suppose that Φ_A_j→ A'_j is a quantum operator acting on the subsystem A_i. Then for ρ_A_1, …, A_m and σ_A'_1, …, A'_m we have\n\n    (A_1, …, A_m) ⊆(A'_1, …, A'_m).\n\n\n\n  * (Tensorization) For any ρ_A_1, …, A_m, σ_A'_1, …, A'_m we have \n\n    (A_1A'_1, …, A_mA'_m) = (A_1, …, A_m)∩(A'_1, …, A'_m),\n\nwhere the left hand side is the MC ribbon of the state ρ_A_1, …, A_m⊗σ_A'_1, …, A'_m considered as an m-partite state. \n\n\n\n\n(Data processing) Any quantum operation is a combination of an isometry and a partial trace. Clearly, local isometries do not change the MC ribbon. Thus, it suffices to prove data processing under partial traces. To this end, we need to show that for a state ρ_A_1B_1, …, A_mB_m we have\n\n    (A_1B_1, …, A_mB_m) ⊆(A_1, …, A_m).\n\nThis inclusion is immediate once we note that in the definition of the MC ribbon in (<ref>), we may restrict X_A_1B_1, …, A_mB_m to act non-trivially only on the subsystems (A_1, …, A_m).\n\n(Tensorization)\nLet {F_j,k: k=0, 1, …} be orthonormal bases for _A_j with F_j, 0=I_A_j.  We note that {F_j,k: k=1, 2, …} is an orthonormal basis for _A_j^0 = {X∈_A_j: ⟨ I_A_j, X⟩_ρ_A_j =0}.  \nThen,  the Gram matrix  of the set ⋃_j {F_j,k: k=1, 2, …} can be decomposed into blocks =(_jj') where the block _jj' consists of the inner products of elements of {F_j,k: k=1, 2, …} and {F_j',k: k=1, 2, …}.\nSimilarly, letting {F'_j,k': k'=0, 1, …} be an orthonormal basis for _A'_j with F_j, 0=I_A'_j, we can consider the associated Gram matrix '=('_jj') as above. \n\nWe note that the space of operators acting on A_jA'_j is equal to _A_jA'_j = _A_j⊗_A'_j. Then, \n{F_j,k⊗ F'_j, k': k, k'=0, 1, …} is an orthonormal basis for _A_jA'_j. Moreover, since F_j, 0⊗ F'_j, 0 = I_A_jA'_j, the set {F_j,k⊗ F'_j, k': (k, k')≠ (0,0) } is an orthonormal basis for ^0_A_jA'_j.\nThus, following Theorem <ref>, we need to compute the Gram matrix of the set ⋃_j {F_j,k⊗ F'_j, k': (k, k')≠ (0,0) }. This set can be decomposed into ⋃_j {F_j,k⊗ F'_j, k': (k, k')≠ (0,0) } = ℱ∪ℱ'∪ℱ, where \n\n    ℱ   =  ⋃_j  {F_j,k⊗ I_A'_j: k=1, 2,…},\n    ℱ'    =  ⋃_j {I_A_j⊗ F'_j, k': k'=1, 2,…},\n    ℱ    = ⋃_j{F_j,k⊗ F'_j, k': k, k'=1, 2,…}.\n\nObserve that, first, these three sets are orthogonal to each other. Second, the Gram matrix of ℱ equals , the Gram matrix of ⋃_j  {F_j,k: k=1, 2,…}, and similarly the Gram matrix of ℱ' equals '. Third, a straightforward computation shows that the Gram matrix of ℱ is equal to ⊠', defined in Lemma <ref>. Putting these together, we find that the Gram matrix of the union is given by\n\n    [     0  0;  0  '  0;  0  0 ⊠' ].\n\nNow, suppose that (θ_1, …, θ_m)∈(A_1, …, A_m)∪(A'_1, …, A'_m). Then, by Theorem <ref> we have Θ^-1≥ and Θ'^-1≥', where Θ' is defined similarly to Θ but probably with a different size. Thus, by Lemma <ref> we have\n\n    [   Θ^-1      0      0;      0  Θ'^-1      0;      0      0 Θ^-1⊠' ]≥[     0  0;  0  '  0;  0  0 ⊠' ].\n\nNext, we note that Θ^-1 is diagonal, so \n\n    Θ^-1⊠' = Θ^-1⊠diag('_11, …, '_mm),\n\nwhere diag('_11, …, '_mm) is a the block-diagonal matrix with blocks '_jj on the diagonal. On other hand, recall that '_jj is the Gram matrix of the set {F'_j, k':  k'=1, 2, …}, that is orthonormal. Thus, '_jj is the identity matrix. Therefore, \n\n    Θ^-1⊠' = Θ^-1⊠diag(I^(1), …, I^(m)),\n \nwhere I^(j) is the identity matrix of an appropriate size. Then,  using Theorem <ref>, equation (<ref>) implies that (θ_1, …, θ_m) ∈(A_1A'_1, …, A_mA'_m) and\n\n    (A_1, …, A_m)∩(A'_1, …, A'_m)⊆(A_1A'_1, …, A_mA'_m).\n\nInclusion in the other direction is a consequence of the data processing property proven in the first part. \n\n\n\n\n\n\n\n\n\n§ MAXIMAL CORRELATION RIBBON FOR GAUSSIAN STATES\n\n\nIn this appendix we compute the MC ribbon for multipartite Gaussian states. We show that, similar to the bipartite case, in order to compute the MC ribbon via (<ref>), it suffices to consider only observables X_1, …, X_m that are linear in the position and momentum operators. To prove this result, we follow similar ideas used in Section <ref>.\n\nLet ρ_A^m=ρ_A_1,…,A_m be an m-mode Gaussian state. We note that, as is clear from its definition, the MC ribbon does not change under local unitaries. Thus, by Theorem <ref> we may assume that (ρ_A^m)=0 and \n\n    =(ρ_A^m) = [ λ_1 I   _12     ⋯   _1m;   _21 λ_2 I     ⋯   _2m;     ⋮     ⋮     ⋱     ⋮;   _m1   _m2     ⋯ λ_m I ],\n\nwhere (ρ_A_j) = λ_j I and _jj' =_j'j^⊤.\n\n\nLet ρ_A^m be an m-mode Gaussian state with first moment (ρ^m)=0 and covariance matrix given by (<ref>).  Let \n\n    Λ = diag(√(λ_1+1/2), √(λ_1-1/2), …, √(λ_m+1/2), √(λ_m-1/2)),\n \nand Υ_m=Υ⊕⋯⊕Υ,\nwhere Υ is given in (<ref>). Then, (θ_1, …, θ_m)∈ [0,1]^m belongs to (A_1, …, A_m) if and only if \n\n    1/2Λ^-1Υ̅_m ( + iΩ_m) Υ_m^⊤Λ^-1≤Θ^-1⊗ I_2,\n\nwhere Θ= diag(  θ_1,  …, θ_m) and I_2 is the 2× 2 identity matrix.\nIn particular, to compute the MC ribbon of ρ_A^m, it suffices to consider X_1, …, X_m in (<ref>) that are linear in terms of \nphase-space quadrature operators. \n\n\n\n\n\nWe follow similar steps as in the proof of Theorem <ref>. First, we note that the set {H_k, ℓ^(j):  k, ℓ≥ 0} defined via (<ref>), for λ=λ_j, forms an orthonormal basis for _j, the space of operators acting on A_j. Moreover, we have H_0,0^(j) = I_A_j, so {H_k, ℓ^(j):  (k, ℓ)≠ 0} is an orthonormal basis for _A_j^0. Thus, to apply Theorem <ref> we need to compute the Gram matrix of the set ⋃_j {H_k, ℓ^(j):  (k, ℓ)≠ 0}. To this end, we decompose this set in terms of the total degrees:\n\n    ⋃_j {H_k, ℓ^(j):  (k, ℓ)≠ 0} = ⋃_t=1^∞(⋃_j {H_k, ℓ^(j):  k+ℓ=t}).\n\nWe note that by (<ref>), basis operators with different degrees are orthogonal to each other. Then, the associated Gram matrix takes the form \n\n    diag(^(1), ^(2), …),\n \nwhere ^(t) is the Gram matrix of ⋃_j {H_k, ℓ^(j):  k+ℓ=t}. As computed in (<ref>), the inner products of elements of {H_k, ℓ^(j):  k+ℓ=1} and {H_k, ℓ^(j'):  k+ℓ=1} equals\n\n    ^(1)_jj' = 1/2[ ζ_0^-1(λ_j)           0;           0 ζ_1^-1(λ_j) ]Υ̅_jj'Υ^⊤[ ζ_0^-1(λ_j')            0;            0 ζ_1^-1(λ_j') ],\n\nwhere ζ_0(λ), ζ_1(λ) are defined in (<ref>). On the other hand, a simple computation shows that \n\n    1/2[ ζ_0^-1(λ_j)           0;           0 ζ_1^-1(λ_j) ]Υ̅(λ_j I + iΩ) Υ^⊤[ ζ_0^-1(λ_j)           0;           0 ζ_1^-1(λ_j) ]=I_2,\n\nis the identity matrix, i.e., the Gram matrix of {H_k, ℓ^(j):  k+ℓ=1}. Putting these together, we conclude that  \n\n    ^(1)=1/2Λ^-1Υ̅_m ( + iΩ_m) Υ_m^⊤Λ^-1,\n\nwhich is the left hand side of (<ref>). Thus, the statement of the theorem says that (θ_1, …, θ_m)∈(A_1, …, A_m) if and only if\n\n    ^(1)≤Θ^-1⊗ I_2.\n\nWe note that by Theorem <ref>, (θ_1, …, θ_m)∈(A_1, …, A_m) if and only if for any t we have\n\n    ^(t)≤Θ^-1⊗ I_t+1,\n\nwhere Θ=diag(θ_1, …, θ_m) and I_t+1 is the (t+1)× (t+1) identity matrix. Thus, to prove the theorem we need to show that if the above inequality holds for t=1, then it holds for all t. \nWe note that t=1 corresponds to degree-one basis operators, that are linear in terms of quadrature operators. \n\n\n\n\n\n\n\n\n\nLet S be the matrix of size (t+1)× 2^t used in the proof of Theorem <ref> whose entries are given by (<ref>). Also, let \n\n    S_m = S⊕⋯⊕ S = I_m⊗ S.\n \nBased on the computations in the proof of Theorem <ref> we have SS^†=I. Moreover, letting ^(t)_jj' be the jj'-th block of ^(t) that consists of the inner products of elements of {H_k, ℓ^(j):  k+ℓ=t} and {H_k, ℓ^(j'):  k+ℓ=t}, we have S(^(1)_jj')^⊗ tS^† = ^(t). Therefore, using the notation of Lemma <ref> we have\n\n    S_m (^(1))^⊠ t S^†_m = ^(t).\n\nThus, to prove the theorem we need to show that if ^(1)≤Θ^-1⊗ I_2, then S_m (^(1))^⊠ t S^†_m ≤Θ^-1⊗ I_t+1. Starting from ^(1)≤Θ^-1⊗ I_2 and using Lemma <ref> we have\n\n    (^(1))^⊠ t≤(Θ^-1⊗ I_2)⊠(^(1))^⊠ (t-1) = Θ^-1⊗ I_2^⊗ t,\n\nwhere the equality follows from the fact that Θ^-1⊗ I_2 is diagonal and the blocks on the diagonal of (^(1))^⊠ (t-1) are equal to I_2^⊗ (t-1). Next, conjugating both sides with S_m=I_m⊗ S and using (<ref>) yield\n\n    ^(t)≤ S_m(Θ^-1⊗ I_2^⊗ t)S_m^† = (I_m⊗ S)(Θ^-1⊗ I_2^⊗ t)(I_m ⊗ S^†) = Θ^-1⊗ SS^† =Θ^-1⊗ I_t+1,\n\nwhich proves the theorem.\n\n\n\n\n\n"}