{"entry_id": "http://arxiv.org/abs/2303.07151v1", "published": "20230313142539", "title": "Amélioration de la qualité d'images avec un algorithme d'optimisation inspirée par la nature", "authors": ["Olivier Parisot", "Thomas Tamisier"], "primary_category": "cs.CV", "categories": ["cs.CV"], "text": "\n\nL'amélioration de la qualité des images est un sujet d'intérêt dans le domaine de la vision par ordinateur.\nDe nouvelles techniques sont régulièrement proposées afin de traiter efficacement le flou, le bruit, les problèmes de contraste et même la faible résolution (<cit.>).\nAinsi, la sélection et l'application de transformations appropriées est une tâche complexe qui nécessite un savoir-faire et des outils spécifiques pour le traitement d'images.\nDans un premier temps, il est essentiel d'utiliser des métriques pour guider le processus: à cet égard, l'évaluation de la qualité des images (IQA – Image Quality Assesment) vise à estimer automatiquement la qualité d'une image de manière à ce qu'elle corresponde à une évaluation humaine subjective (<cit.>).\n\nPar ailleurs, en recherche scientifique et en ingénierie, il est plus que jamais utile voire nécessaire de garantir la reproductibilité des expériences sur les jeux de données à base d'images en disposant de la trace des transformations effectuées (<cit.>).\n\nUn travail récent a montré qu'une information complète et rigoureuse au sujet des traitements effectués sur les images fait défaut dans une grande proportion d'articles scientifiques, ce qui peut compromettre l'interprétation des résultats obtenus (<cit.>).\nNous pouvons faire une analogie avec l'apprentissage automatique lorsqu'il est appliqué sur des données numériques ou catégorielles: le prétraitement des données doit être documenté de manière précise pour aboutir à des modèles prédictifs significatifs et de confiance (<cit.>).\n\nL'approche que nous présentons procède par optimisation inspirée de la nature pour améliorer une image: elle s'appuie sur des méthodes standard d'évaluation de la qualité et elle construit la trace explicite de la séquence de transformations successivement opérées.\nLe reste de cet article est organisé comme suit. \nTout d'abord, les travaux connexes sur l'évaluation de la qualité et l'optimisation inspirée par la nature pour les images sont brièvement présentés (Section <ref>). \nEnsuite, notre approche pour améliorer la qualité des images est introduit (Section <ref>). \nUn prototype est décrit (Section <ref>) et les résultats des expériences réalisées sont discutés (Section <ref>).\nPour finir, nous concluons en ouvrant quelques perspectives (Section <ref>).\n\n\n\n\n§ ETAT DE L'ART\n\n\n\n\n\n §.§ Evaluation de la qualité d'image\n\n\nDe nombreuses approches d'évaluation de la qualité d'image ont été développées ces dernières années et une liste exhaustive a déjà été compilée par <cit.>. \nOn peut distinguer deux grandes familles de techniques: \n\n\n  * Les méthodes à référence complète (Full Reference IQA – FR-IQA) et à référence réduite (Reduced Reference IQA – RR-IQA) sont basées sur un référentiel d'images (brutes/déformées). \n\n  * Les techniques sans référence (No Reference IQA – NR-IQA) et à l'aveugle (Blind-IQA) visent à estimer la qualité de manière non supervisée (<cit.>).\n \n\nDans cet article, nous nous concentrons sur l'utilisation d'approches NR-IQA et Blind-IQA et parmi lesquelles nous pouvons citer:\n\n\t\n  * BRISQUE (Blind/Referenceless Image Spatial Quality Evaluator) proposé par <cit.>: un score entre 0 et 100 est produit (0 pour une image de bonne qualité, 100 pour une qualité médiocre) .\n\t\n  * NIMA (Neural Image Assessment) introduit par <cit.>: un ensemble de modèles de Deep Learning pour estimer la qualité esthétique et technique des images: un score entre 0 et 10 est produit (0 pour une image de mauvaise qualité, 10 pour une image de bonne qualité).\n\n\nEn pratique, ces méthodes d'évaluation sont largement utilisées dans les benchmarks pour comparer l'efficacité des algorithmes de traitement d'images, comme décrit par <cit.>.\nElles permettent de détecter avec une efficacité certaine les images de mauvaise qualité.\n\n\n\n\n §.§ Optimisation inspirée par la nature pour le traitement d'images\n\n\nA l'instar des réseaux neuromimétiques, de nombreuses approches de résolution de problèmes ou d'optimisation sont inspirées par des processus naturels, notamment les algorithmes évolutionnaires et l'optimisation par essaims de particules (<cit.>).\nCes techniques sont fréquemment appliquées en vision par ordinateur pour diverses tâches telles que la réduction du flou et du bruit, la restauration et la segmentation (<cit.>).\nEn particulier, <cit.> propose un algorithme génétique pour mettre en valeur automatiquement une image en la modifiant de manière progressive.\n\nDans la suite de cet article, nous proposons une solution pour la génération de séquences ordonnées de transformations d'images en appliquant avec un algorithme guidé par les techniques d'évaluation de la qualité des images précédement citées.\n\n\n\n\n§ APPROCHE\n\n\n\nL'élément central de l'approche est défini de la manière suivante:\n\n\t\n  * Une image initiale.\n\t\n  * Une séquence ordonnée de transformations appliquée sur l'image initiale (exemples: ajustement du contraste puis suppression du brouillard, suivi d'un ajustement de l'histogramme et d'un débruitage par variation totale, etc.). Au départ, cette séquence est vide.\n\t\n  * Un score de qualité est évalué avec les méthodes d'évaluation de la qualité de l'image BRISQUE ou NIMA (esthétique ou technique). Cette étape est critique et pilote l'algorithme (la qualité sert ici de fitness de la solution, dans la terminologie utilisée pour les algorithmes évolutionnaires).\n\n\nPour une image d'entrée donnée (I), en considérant une méthode d'évaluation de la qualité de l'image (M) et un nombre maximum d'époques (E), l'algorithme suivant calcule un ensemble de séquences ordonnées de transformations à appliquer sur l'image: \n\n\t\n  * Une population est générée avec P images: chaque image est un clone de l'image initiale I sur laquelle une transformation aléatoire a été appliquée ou non. En effet, pour s'assurer que l'algorithme ne conduit pas à une image de moindre qualité, il est important de conserver au moins un clone non modifié de l'image initiale dans la population dans le cas où l'algorithme ne produit pas de meilleure solution.\n\t\n  * Pendant E itérations :\n\t\n\t\t\n  * La meilleure image présente dans la population ainsi qu'une autre image choisie au hasard sont clonées, puis une transformation aléatoire est appliquée pour chacune: les images nouvellement créées sont évaluées avec M et ajoutées à la population.\n\t\t\n  * Une autre image est sélectionnée aléatoirement dans la population et est empilée avec l'image initiale (avec un poids aléatoire): l'élément nouvellement créé est évalué avec M et ajouté à la population.\n\t\t\n  * Selon l'évaluation avec M des images présentes dans la population, les plus mauvaises images sont sélectionnées puis retirées de la population (pour toujours garder P images dans la population).\n\t\n\t\n  * Le résultat final est l'image de la population consolidée ayant la meilleure estimation de qualité. La sortie de l'algorithme est alors une séquence ordonnée de transformations qui conduit à une amélioration de l'évaluation de la qualité de l'image.\n\n\nPour éviter que l'image ne diffère trop de l'image initiale, nous avons ajouté un test comparant la similarité entre l'image produite et l'image initiale: si la similarité est trop faible (c'est-à-dire inférieure à un seuil prédéfini T), alors le score de l'image est fortement pénalisé et la dernière transformation appliquée n'est donc pas considérée comme acceptable.\nLe test est ici basé sur l'indice de similarité structurelle (Structural Similarity Index): en pratique, la valeur est proche de 1 lorsque les deux images sont similaires alors que la valeur est proche de 0 lorsque les images sont vraiment différentes.\n\n\n\n\n§ IMPLEMENTATION ET EXPÉRIENCES\n\n\n\nL'algorithme a été implémenté dans un prototype Python.\nDivers composants open-source standards ont été intégrés.\nLe chargement et la transformation des images sont réalisés à l'aide de divers packages Python dédiés tels que openCV [<https://pypi.org/project/opencv-python/>] et scikit-images. [<https://pypi.org/project/scikit-image/>].\nLe score BRISQUE est calculé grâce au package image-quality [<https://pypi.org/project/image-quality/>] et les scores NIMA sont fournis par une implémentation de Tensorflow [<https://github.com/idealo/image-quality-assessment>].\n\nEn utilisant ces composants, les transformations d'images suivantes peuvent être appliquées et combinées à la volée via notre prototype:\n\n\t\n  * Débruitage via différentes méthodes: variation totale, moyennes non locales, ondelettes, bilatéral.\n\t\n  * Ajustement du contraste et de la luminosité notamment via des algorithmes comme CLAHE (Contrast Limited Adaptive histogram equalization, <cit.>). \n\t\n  * Traitement du background, notamment pour améliorer les images à faible luminosité (<cit.>).\n\t\n  * Atténuation du brouillard via des modèles de Deep Learning comme Cycle-Dehaze (<cit.>).\n\t\n  * Transformations morphologiques comme erosion et dilatation (<cit.>).\n\t\n  * Reconstruction des détails avec des modèles comme Noise2Noise (<cit.>).\n\t\n  * Empilage pondéré et/ou soustraction d'images.\n\n\nCe code Python a été développé de manière à pouvoir être exécuté sur une infrastructure haute performance ayant la configuration matérielle suivante: 40 cœurs et 128 Go de RAM (CPU Intel(R) Xeon(R) Silver 4210 @ 2,20 GHz) et NVIDIA Tesla V100-PCIE-32 Go.\nPlus précisémment, les librairies CUDA [<https://developer.nvidia.com/cuda-zone>] et NUMBA [<http://numba.pydata.org/>] ont été utilisées autant que possible pour accélérer l'exécution de code sur cette infrastructure.\n\n\n\n\n§ EXPÉRIENCES\n\n\n\n\n\nL'algorithme a d'abord été testé sur des photographies telles que Figure <ref> [<https://commons.wikimedia.org/wiki/Main_Page>].\nDans l'exemple de l'image de la fusée, les transformations suivantes ont été appliquées sur une version volontairement altérée de la photographie initiale: désembrumage, empilement avec image initiale (avec poids à 0.8), débruitage par filtrage bilateral, augmentation du contraste, traitement de la netteté (avec beta à 0.95), augmentation du contraste, débruitage par filtrage bilateral, suppression du fond, augmentation du contraste, traitement de la netteté (beta: 1.05).\nCette séquence ordonnée d'opérations permet d'améliorer la qualité mesurée de l'image dégradée (en se référant aux scores BRISQUE et NIMA).\n\nDans un second temps, plusieurs jeux de données de référence en traitement d'images ont été considérées durant nos expérimentations: TID2013 avec 500 images déformées choisies au hasard (<cit.>) et LIVE avec 175 images bruitées (<cit.>).\nDe plus, nous avons testé l'approche sur les benchmarks CID2013 et LOL: le premier contient 475 images capturées avec des appareils grand public comme les smartphones (<cit.>) et le second consiste en 485 images à faible luminosité (<cit.>).\n\nLes résultats du Tableau <ref> ont été obtenus avec les hyperparamètres suivants: NIMA-esthétique comme score d'évaluation de la qualité d'image ciblée, une population initiale de 20 images, 50 époques maximum et 0,5 comme similarité minimale.\nSelon nos différents essais, cette configuration de l'algorithme offre le meilleur compromis entre l'amélioration de la qualité et le temps d'exécution. \nLe score BRISQUE a été calculé par la suite pour estimer d'une autre manière et à posteriori la qualité des résultats de l'algorithme et la variance du bruit (Noise Variance) a été calculée pour mettre en évidence le niveau de bruit dans les benchmarks.\n\n\n\n\nD'après ces premières expériences, les scores de qualité (NIMA-esthétique et BRISQUE) sont meilleurs pour les images provenant des benchmarks TID2013 et LIVE après l'exécution de notre algorithme.\nIdem pour le bruit: notre algorithme tend à le réduire dans les images transformées pour ces benchmarks.\n\nNous notons cependant que les résultats pour les images à faible luminosité sont partiellement satisfaisants (benchmark LOL).\nMême si les transformations calculées par notre algorithme augmentent le score NIMA-esthétique comme souhaité, elles ont tendance à dégrader le score BRISQUE et à augmenter le bruit.\nCe problème montre les limites de NIMA et BRISQUE pour l'évaluation de la qualité des images à faible luminosité: ces méthodes ne devraient pas être utilisées pour guider la transformation de telles images.\n\nEn ce qui concerne les performances de calcul, le temps nécessaire pour exécuter le prototype Python était raisonnable en utilisant l'infrastructure décrite ci-dessus (de quelques secondes à plusieurs dizaines de secondes par image, en fonction de leur résolution). \nLe temps d'exécution du prototype dépend pour l'essentiel de la méthode d'évaluation de la qualité appliquée: par exemple, l'évaluation NIMA-esthétique est réalisée en moyenne en moins de 100 millisecondes tandis que l'évaluation du score BRISQUE peut prendre plusieurs secondes.\nEn pratique, ce temps peut être réduit en diminuant la taille des images avant évaluation (mais cela affecte également la précision des évaluations, ce qui n'est pas forcément souhaitable).\n\n\n\n\n\n\n§ CONCLUSION AND PERSPECTIVES\n\n\n\nCet article présente un algorithme d'optimisation inspirée de la nature améliorant la qualité mesurée d'une image avec le calcul d'une séquence ordonnée et reproductible de transformations à appliquer.\nUn prototype Python basé sur les méthodes d'évaluation de la qualité des images a été mis en oeuvre et testé sur diverses bases de données d'images de l'état de l'art.\n\nDivers partenaires académiques et opérationnels permettront de mettre en place des cas d'utilisation réels de l'approche (notamment en bio-informatique).\nEn parallèle, nous améliorons le prototype en générant automatiquement le code source Python permettant de transformer les images, en nous inspirant de ce qui est proposé dans les approches AutoML (Automated Machine Learning).\nDe plus, les futurs cas d'utilisation seront également utilisés pour améliorer le prototype proposé sur les images à faible luminosité.\nEnfin, les performances d'exécution seront renforcées en distribuant les calculs via des frameworks comme Spark.\n\n\n\n\n\n\n§ REMERCIEMENTS\n\n\nCe travail a été réalisé en utilisant la plateforme Artificial Intelligence, Data Analytics opérée par le Luxembourg Institute of Science and Technology.\nDans ce cadre, nous remercions tout particulièrement Jean-François Merche et Raynald Jadoul pour leur support.\n\n\nrnti\n\n\n\n\n\n\n\n"}