{"entry_id": "http://arxiv.org/abs/2303.07147v1", "published": "20230313141915", "title": "Enhanced Vibrational Stability in Glass Droplets", "authors": ["Surajit Chakraborty", "Vishnu V. Krishnan", "Kabir Ramola", "Smarajit Karmakar"], "primary_category": "cond-mat.soft", "categories": ["cond-mat.soft", "cond-mat.dis-nn"], "text": "\n\n\n\n\n\n\n\n\n \nschakraborty@tifrh.res.in\n\n\n \n[Current address: ]RCAST, University of Tokyo, 4-6-1 Komaba, Meguro, Tokyo 153-8904, Japan\nvishnuvk@g.ecc.u-tokyo.ac.jp\n\n\n\n \nkramola@tifrh.res.in\n \nsmarajit@tifrh.res.in\nTata Institute of Fundamental Research, Hyderabad 500046, India\n\n\n\n\n\nWe show through simulations of amorphous solids prepared in open boundary conditions that they possess significantly fewer low-frequency vibrational modes compared to their periodic boundary counterparts. Specifically, using measurements of the vibrational density of states, we find that the universal D(ω) ∼ω^4 law changes to D(ω) ∼ω^δ with δ≈ 5 in two dimensions and δ≈ 4.5 in three dimensions. Crucially, this enhanced stability is achieved when utilizing slow annealing protocols to generate solid configurations. We perform an anharmonic analysis of the minima corresponding to the lowest-frequency modes in such open-boundary systems and discuss their correlation with the density of states. A study of various system sizes further reveals that small systems display a higher degree of localization in vibrations. Lastly, we confine open-boundary solids in order to introduce macroscopic stresses in the system which are absent in the unconfined system, and find that the D(ω) ∼ω^4 behavior is recovered.\n\n\n\n\n\nEnhanced Vibrational Stability in Glass Droplets\n    Smarajit Karmakar\n    March 30, 2023\n================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nIn contrast to crystalline solids, whose vibrational states are well described by the Debye model, amorphous solids exhibit anomalous mechanical and thermal properties <cit.>. For a system in d-dimensions, the Debye model predicts a vibrational density of states (VDoS), D(ω) ∼ω^d - 1 arising from phonons <cit.>. On the other hand, disordered systems possess an excess of low-frequency modes above the Debye prediction, termed the “Boson peak” <cit.>. It has been suggested that the large specific heat of glasses and the plastic failure of amorphous solids are intimately related to these low frequency non-phononic vibrational modes <cit.>. However,  a complete understanding of the structural and statistical properties of these vibrational modes has been elusive and remains an important current topic of interest in the field of disordered solids.\n\n\nSeveral theoretical frameworks for the vibrations in disordered systems seek to model amorphous solids as an ensemble of anharmonic oscillators. Such a treatment is motivated by a disordered arrangement of particles containing local `soft spots' where the stiffness associated with a collective vibration is very small. The phenomenological “Soft Potential Model” (SPM) treats these regions as non-interacting oscillators and predicts a VDoS D(ω) ∼ω^4 for the lowest frequencies of stable inherent structures <cit.>. An extension to the SPM that includes effects of interactions between the anharmonic oscillators continues to retain the ω^4 behavior of the VDoS <cit.>. Other recent theoretical studies also predict a D(ω) ∼ω^4 at the lowest frequencies <cit.>. “Fluctuating Elasticity Theory” on the other hand predicts a low frequency regime composed of extended modes that scale as D(ω) ∼ω^d+1 in d dimensions <cit.>. Certain mean field theories such as the “Perceptron Model” <cit.> and the “Effective Medium Theory” <cit.> predict non-phononic vibrations with a D(ω) ∼ω^2 dependence. In this context, numerical investigations of amorphous solids, in order to ascertain the nature of the low-lying excitations of such systems, is of crucial importance.\n\nRecent numerical studies of amorphous solids have identified a universal D(ω)∼ω^4 scaling in the low-frequency regime of the VDoS across a broad class of simulated model systems <cit.>. The universality of this non-phononic power-law at low frequencies has been established in 2, 3 and 4 dimensions <cit.>. In order to extract this behavior, studies have focused on small system sizes, where the lowest-frequency quasilocalized vibrations are well separated in energy from the first system-spanning phonon. This suggests that these quasilocalized modes (QLM) are primarily responsible for the power-law tail in the VDoS <cit.>. Further, a suppression of system-spanning vibrations using random pinning protocols has been shown to enhance the non-phononic spectra, thereby displaying a pronounced D(ω) ∼ω^4 behavior  <cit.>. Yet other studies have utilized measures such as participation ratios in order to isolate such quasilocalized modes that have been shown to contribute to the observed power-law behavior <cit.>. Simulations of various systems including ultrastable glasses <cit.>, silica models <cit.>, long-ranged models <cit.>, finite-temperature systems <cit.> and random matrix models <cit.>, all provide significant evidence of the ubiquity of the ω^4 regime of the VDoS. However, other studies simulating amorphous solids report deviations from  the universal quartic law. High parent temperatures, poor annealing and small system sizes have each been shown to result in power-law exponents that are less than 4 <cit.>. Recent studies have further identified exponents of 3 and 3.5 in the low-frequency regime <cit.>.\n\nA crucial aspect often overlooked in simulations of amorphous solids are the residual shear stresses arising due to periodic boundary conditions (PBC) <cit.>. This implies that energy-minimized configurations of disordered systems under PBC are unstable to shear deformations. It has recently been shown that the low-frequency regime of the VDoS is modified to D(ω) ∼ω^5 when considering ensembles stable to simple-shear perturbation <cit.>. Significantly, such an increase in the exponent points to a correlation between the shear-stability of the system and a reduction in the propensity for localized vibrations. Given these observations, a natural question regarding the consequences of stabilization against all possible deformations arises. Solids formed under open boundary conditions (OBC) are a suitable candidate, since all elements of their pressure tensor are identically zero for each configuration. Furthermore, unlike systems under PBC, phonons in OBC are not required to obey the artificial symmetries enforced by the periodicity. Consequently, solids under OBC can accurately capture features of natural solids, including surface as well as system-size effects. \n\n\n\nIn this paper, we report a characterization of the VDoS of open boundary amorphous solids. The low-frequency vibrational properties of open systems remain relatively unexplored, and our study forms the first such computational examination of open-boundary amorphous solids. We observe the low-frequency vibrational spectrum of a simulated model amorphous solid under open boundary conditions to be of the form D(ω) ∼ω^δ with δ > 4, both in two and three dimensions. Since an increase in the exponent implies a reduction in the degree of vibrational localization, the corresponding solid ensemble may be said to possess enhanced stability. Notably, the model system displays such a VDoS only when configurations are annealed to their inherent structures. On the other hand, commonly used quenching protocols lead to ensembles with δ∼ 4. Interestingly, at large enough system sizes, the exponent saturates to a value δ = 5 in 2D and δ = 4.5 in 3D. \nA detailed investigation of the average stress profile of the solids allows us to identify a surface layer that suggests a source of the system-size effects. Lastly, we also observe that confining open boundary solids under a harmonic trap recovers the D(ω) ∼ω^4 behavior of PBC systems confirming the role of stresses in the stability of solids.\n\nThe outline of the paper is as follows. Section <ref> describes the numerical protocol we use to generate stable open boundary solids. In Section <ref>, we demonstrate the effect of different minimization protocols to generate stable solids. In Section <ref>, we present the data to demonstrate the effect of the system size on the vibrational spectrum. \nFinally, we conclude and provide directions for future research in Section <ref>.\n\n\n\n§ MODEL AND SIMULATION DETAILS\n\nIn order to simulate the behavior of amorphous solids in open boundary conditions, we use models with attractive interactions between the particles. Specifically, we use variants of the canonical Kob-Andersen Lennard-Jones model <cit.> in two and three dimensions. The model consists of binary mixtures of particles in number ratios 65:35 in two dimensions (2D) and 80:20 in three dimensions (3D), with an interaction potential:\n\n\n    V_αβ(r) = 4 ϵ_αβ[(σ_αβ/r)^12-(σ_αβ/r)^6+∑_i=0^2 c_2 i(r/σ_αβ)^2 i]\n\n\nwhere α, β∈{A, B} correspond to the two types of particles resulting in three types of interactions. The potential is cut off at a distance r^αβ_c=2.5 σ_αβ. σ_AA=1 is the unit of length and ϵ_AA=1 is the unit of energy (Boltzmann's constant being unity). The remaining parameters are ϵ_AB=1.5, ϵ_BB=0.5, σ_AB=0.8, and σ_AB=0.88 with all masses set to unity m=1.0. We equilibrate liquid configurations at high temperatures (T=0.55 in both two and three dimensions) by performing constant temperature molecular dynamics simulations under periodic boundary conditions. The liquid is then cooled to a low temperature (T=0.2) at a rate Ṫ = 10^-4. In order to achieve a density close to that of a system under open boundary conditions, we perform zero-pressure molecular dynamics simulations using the isobaric NPT ensemble.\n\nFinally, in order to study solid droplets under OBC, we begin by cutting out a circular (spherical in 3D) region of the zero-pressure liquid. We ensure that all the droplet samples contain a fixed number of particles, say N, by selecting the N closest particles to the center of mass of the corresponding liquid sample referred to henceforth as a “cut-out” sample. Solids are configurations that resist deformations, which correspond to the inherent structures of the amorphous configuration of particles. We generate such structures by performing an energy minimization of the particle-position degrees of freedom using three different protocols, namely: (i) Molecular dynamics simulations in the presence of dissipative viscous drag in the athermal limit (Damped Dynamics)  <cit.>, (ii) FIRE <cit.> and (iii) the non-linear conjugate gradient algorithm <cit.>. Note that we do not equilibrate the cut-out sample, but instead directly quench or anneal through the energy minimization protocol.\n\nSimulations of the largest system-size three dimensional zero-pressure PBC liquids are performed using LAMMPS <cit.>. The vibrational properties of the solid configurations are probed through the Hessian matrix as defined in Eq. (<ref>). We perform eigenvalue computations using the Intel Math Kernel Library <cit.> sparse solver routine . Below, we discuss the three protocols we employ in order to find the minimum-energy amorphous configurations.\n\n\n\n §.§ Damped Dynamics\n\nIn the Damped Dynamics (DD) protocol a  dissipative viscous drag in the absence of a temperature bath or other energy input serves as a method to find the stationary state of the conservative force fields. Such an evolution of the system is described by the equation of motion \n\n    dv⃗_i/dt=F⃗_⃗i⃗-γv⃗_i\n\nwhere F⃗_i is the conservative force on particle i  due to interactions with other particles, v⃗_i is the instantaneous velocity of the particle i and γ is the viscous damping parameter. A stable steady-state solution of these equations corresponds to a minimum energy configuration of the system of particles with F⃗_i = 0 and v⃗_i = 0 for all particles. We employ a velocity Verlet integration scheme modified to incorporate velocity-dependent accelerations. These damped equations of motion allow the system to traverse the basins of multiple inherent states before selecting and settling in a more stable minimum. We use a low value of the damping constant (γ = 0.1) so that the system is able to execute such a relaxation. On the other hand, a large value of γ would be equivalent to a steepest-descent minimization of the energy. \n\n\n\n §.§ FIRE Minimization\n\nThe Fast Inertial Relaxation Engine (FIRE) is an efficient protocol designed to find local minima of multidimensional functions <cit.>. The procedure involves numerically integrating a dynamical equation with a variable viscous damping and additionally, a gradient director. The equation of motion for each particle is\n\n    d v⃗/d t=F⃗(t)-γ(t)|v(t)|[v̂(t)-F̂(t)]\n\nThese two aspects of the FIRE algorithm that lend it its speed also prevent the system from leaving its original energy basin. Therefore the inherent structure obtained is primarily a function of the equilibrium sampling, and is not dependent on the stability of the minimum of the basin.\n\n\n\n §.§ Conjugate Gradient Minimization\n\nWe also test the stability of configurations obtained via a conjugate gradient (CG) minimization scheme  <cit.>. We implement the non-linear conjugate gradient for the open boundary system using the Polak-Ribiere method to obtain the updated direction and the secant minimization method in order to determine the step size of the line search. As in the case of the FIRE algorithm, conjugate gradient leads the system to its nearest minimum.\n\n\n\n\n\n\n\n§ STABLE VIBRATIONAL MODES\n\n\nHarmonic vibrations of a solid can be probed by diagonalizing the “Hessian Matrix”, defined as \n\n    .𝐇_i j≡∂^2 U(𝐫_1, 𝐫_2, …𝐫_n)/∂𝐫_i∂𝐫_j|_{𝐫_i^0},\n\nwhere U(𝐫_1, 𝐫_2, …𝐫_n) is the total potential energy of the system and 𝐫_i denotes the position of particle i. The eigenvectors (ψ_k) of the Hessian matrix correspond to the cooperative displacements of the particles participating in harmonic vibrations (termed normal modes) and the corresponding eigenvalues (λ_k) represent the frequency of that vibration. The system when perturbed along a normal mode, will perform a pure oscillation with a frequency ω_k = √(λ_k). The Hessian matrix evaluated at an energy minimum of the landscape is positive semi-definite with zero-modes corresponding to the global invariants of the Hamiltonian (Goldstone modes). For example, a 3D system under PBC possesses three translational degrees of freedom and the corresponding Hessian therefore has three zero-modes. Systems under OBC on the other hand additionally also possess rotational degrees of freedom. In general, in d dimensions, such a solid has d(d+1)/2 zero modes corresponding to d translational modes and d(d-1)/2 rotational modes. The vibrational density of states (VDoS) of a system of N particles in d dimensions is defined as \n\n    D(ω)=1/N d∑_i=1^Ndδ(ω-ω_i)\n\n\nIn Fig. <ref> (b) we display the first non-zero mode of an open boundary 2D solid configuration of N = 400 particles corresponding to a frequency ω = 3.24107×10^-1 with a participation ratio (defined in Eq. (<ref>)) of 1.313714×10^-1. Similarly, in Fig. <ref> (d) we show the mode corresponding to a 3D solid of N = 4096 particles corresponding to a frequency ω=4.039514×10^-1 and participation ratio of 6.792794×10^-3. These low-frequency modes are quasilocalized with a small number of particles displaying a large participation by forming the core of the vibration. Interestingly, these eigenmodes resemble the quadrupolar modes observed in the low-frequency regime of the vibrational density of states of structural glass formers under PBC <cit.>.\n\n\n\n\n §.§ Anharmonic Stability Analysis\n\nWhile the Hessian characterizes the curvature of the energy minimum and thereby the frequency of vibrations, an anharmonic analysis is necessary in order to better understand the vicinity of the energy minimum. The energy near the minimum may be approximated upto fourth order as\n\n    δ U(s)=1/2! B_2 s^2+1/3! B_3 s^3+1/4! B_4 s^4.\n\nwhere s is the scalar distance of particles from the minimum, along a given direction in the energy landscape. If the particles are displaced along an eigenvector (ψ) of the Hessian (H),\n\n    B_2=ψ· H ·ψ\n\nis the eigenvalue of the Hessian, and \n\n    B_3=ψ_i[∂^3 U/∂ r_i ∂ r_j ∂ r_l] ψ_l ψ_j,\n\n\n    B_4=ψ_i ψ_l[∂^4 U/∂ r_i ∂ r_l ∂ r_k ∂ r_j] ψ_k ψ_j\n\nquantify the non-linearity of the energy landscape along that mode.\n\nGiven a vibration in the energy landscape as defined by an eigenvector, the corresponding energy minimum is said to be `stable' provided that the minimum is the deepest in its neighborhood. Under the quartic approximation of the energy near the minimum, such stability is achieved when <cit.>\n\n    B_3^2≤ 3 B_2 B_4.\n\n\n\n\n §.§ Effect of Minimization Protocol\n\n\nSimulated models studying the properties of amorphous solids have typically been systems under periodic boundaries. It has been shown that in such systems, the CG minimization protocol generates configurations with stable minima, provided that configurations are obtained from a sufficiently low parent temperature <cit.>. \nHowever, the open boundary configurations obtained by quenching the cut-outs of zero-pressure PBC systems contain among them, some inherent structures at unstable minima. We therefore explore an energy-minimization protocol that anneals the system into an ensemble comprised of primarily stable minima.\n\n\n\n\n\n\n\n\n\nWe find that different energy minimization protocols drive the system to different minima. In Fig. <ref> (a), we show the displacements incurred by each particle from a particular liquid configuration, when undergoing energy minimization through two different protocols, namely Damped Dynamics and Conjugate Gradient. While both procedures yield inherent structure configurations, they do not correspond to the same minimum. Most significantly, Damped Dynamics finds minima in a relatively expanded region in the energy landscape as compared to CG and FIRE. In Fig. <ref> (a) we present corroborating numerical evidence with particles undergoing relatively larger displacements in the case of Damped Dynamics. In order to qualify this difference, we compute the distance between the cut-out liquid configuration and the energy minimized solid configuration as \n\n    d_c=√(∑_i=1^N|r⃗_i^L-r⃗_i^S|^2 )\n\nwhere r⃗_i^L and r⃗_i^S represent the position of particle i in the liquid and solid configurations respectively. In terms of the radial and tangential displacement incurred by particles at different radial distances,\n\n    d_c^2=∫_r=0^Rr dr (|u_r(r)|^2+|u_θ(r)|^2)\n\nwhere u_r(r) and u_θ(r) are the radial and tangential displacement of particles at a radial distance r from the center of mass of the liquid droplet. In Fig. <ref> we show the average (b) radial and (c) tangential displacement at different radial distances of the liquid configurations. For the case of Damped Dynamics minimization, particles near the surface undergo comparatively larger displacement in the tangential direction which results in a stable inherent structure. Since the viscosity of the surrounding medium determines the exact extent of this search space, we use an appropriately chosen damping, optimizing for both improved search area as well as speed.\n\nWe now consider the vibrational properties of the minima obtained through the various energy minimization protocols. In Fig. <ref> we show the lowest frequency vibrational mode of a solid configuration obtained via (b) CG and (c) Damped Dynamics minimization of the same liquid configuration. Although both modes show signatures of similar quadrupolar vibrations, the inherent structure corresponding to (a) does not satisfy the stability criterion defined in Eq. (<ref>).\n\nAn important difference between the ensembles of minima obtained via the various protocols lies in their vibrational stability as defined in Eq. (<ref>).\nThrough Fig. <ref> we assess the stability of each of the open-boundary solid configurations across the different minimization protocols. We use the quartic Taylor expansion as illustrated in Sec. <ref> along the direction specified by the lowest frequency mode in order to extract the stability of the minimum. Interestingly, the CG and FIRE minimization protocols present many unstable inherent structures indicated by the data points above the stability line corresponding to (B_3^2 = 3B_2B_4). At the same time, the Damped Dynamics minimizer produces predominantly stable inherent structures as shown by the data points being well within the regime of stability. This suggests that the Damped Dynamics minimizer allows the system to find a locally deeper minimum.\n\n\n\n\n\nSince the choice of minimization protocol affects the stability of minima, we next examine its effects on the vibrational spectrum. In Fig. <ref> we plot the distribution of the low-lying vibrational frequencies of two-dimensional solid ensembles. While the VDoS of CG and FIRE minimized ensembles display the erstwhile universal low-frequency power law D(ω) ∼ω^4 <cit.>, ensembles generated via the Damped Dynamics minimizer show a power law of ω^5 in the low-frequency regime, as has been seen previously in shear-stabilized systems <cit.>. Generically the smaller the lowest frequency mode, the closer the system is to an instability. An increase in the power of the VDoS from 4 to 5 corresponds to a reduction in the proportion of such small-valued modes. Therefore, such a change is a signature of a transformation to a more stable solid ensemble enabled by an appropriate choice of an annealing energy minimizer.\n\n\n\n\n\n\nIn the inset of Fig. <ref>, we plot the distribution of\n\n    β = B_3/√(3B_2B_4),\n\nwhere states within the dashed lines (|β|<1) correspond to stable minima. We find that the stability condition is best satisfied by configurations obtained via Damped Dynamics minimization. Thus, we observe that the model system, under open boundary conditions displays a correlation between stable minima and the vibrational stabilization of the corresponding solid ensembles.\n\n\n\n§ SYSTEM SIZE EFFECTS\n  \n\nIt is well-known that the low-frequency vibrational spectrum of amorphous solids contain system spanning phonons in addition to localized vibrations <cit.>. The long-wavelength phonons in a solid with linear dimension L, under periodic boundary conditions possess a frequency that varies with system-size as L^-1. This decrease in the frequency of the phonons with increasing system-size leads to a difficulty in the characterization of quasilocalization at low frequencies. At the same time, the regime of the VDoS that is most amenable to the study of quasilocalized behavior are the frequencies below the first phonon <cit.>. As the phonon frequencies become comparable to the frequencies of quasilocalized modes at larger system sizes, it is then necessary to perform a disorder averaging over an increasingly large number of samples in order to distinguish these modes. This becomes computationally infeasible at very large system-sizes. Additionally, QLMs also display finite size effects when the extent of these modes becomes comparable to the size of the system <cit.>. The softness of QLMs therefore becomes independent of system size once it surpasses the lengthscale of the localized vibration. In this context, very small system sizes have been shown to possess an excess of quasilocalized vibrations with D(ω) ∼ω^δ where δ < 4 <cit.>, as the finite size effects dominate in such situations.\n\nSolids prepared under open boundary conditions can display additional surface effects in their low frequency vibrational spectrum, as boundary effects not present in PBC systems also play a role. The stiffness of particle motion near the surface of the solid is small compared to the bulk of the material. Therefore the eigenmodes are softer near the boundary of the solid. It is thus natural to expect that in small open boundary solids there will be stronger surface effects than in larger solids. This occurs in addition to the finite size effects arising from the interplay between the size of the system and the size of the quasilocalized modes. It is therefore important to study the variation of the VDoS with system-size, under open boundary conditions, in order to identify regimes of validity of the enhanced stability.\n\nA quantitative characterization of the surface effects may be performed through a measurement of the stress distribution within such solids. Moreover, since the low-lying VDoS is crucially sensitive to the macroscopic stress in the amorphous structure <cit.>, it is reasonable to assume that the finite size effects displayed by the stress profiles also carry over to the VDoS. In PBC systems, the average stress displays homogeneity over the sample, and therefore the local elastic behavior is also independent of the location in the solid. However, as the macroscopic stress is precisely zero in open boundary solids, any bulk stress is necessarily counterbalanced by the stresses on a “boundary layer”. Such a distinct surface region possessing a typical thickness is yet another source of finite-size effects. Additionally, the local elasticity properties of the material are correlated with the local stress distribution, with particles near the boundary displaying lower stiffness in their interaction. In this context, we study the boundary stress layer in solids prepared under open boundary conditions, in order to systematically analyze the finite size effects present in their low-frequency VDoS.\n\n\n\n §.§ Stress Distribution and the Boundary-layer\n\n\n\n\n\nIn Fig. <ref> we describe the stress distributions which highlight the existence of a surface layer in an open boundary solid. Specifically, in Fig. <ref> (a) and (b), we plot the spatial distributions of the pressure and shear stress respectively, as seen in open boundary solids comprised of 900 particles. These stress profiles are constructed by averaging over 10^5 amorphous configurations and using coarse-graining boxes each of dimension 0.28 σ_AA× 0.28 σ_AA. The typical radius of a configuration is approximately 15 σ_AA resulting in about 9000 bins. Fig. <ref> (c) plots the radial distribution of the pressure for amorphous solids of various sizes. The stress distributions display clear indications of a boundary layer, with the effects of the surface spanning over approximately 5 σ_AA. We also find that while the pressure in the bulk is sensitive to the total size of the droplet, the thickness of the boundary layer is largely independent of the system size.\n\nThe microscopic stress field (σ_ij(𝐫)) can be expressed as \n    σ_i j(𝐫)=σ_i j^0(𝐫)+δσ_i j(𝐫),\n where σ_i j^0(𝐫) represents the stress tensor of the initial liquid configuration and δσ_i j(𝐫) is the change in the stress tensor which results from the process of energy minimization. The original distribution of stress σ_ij^0 in the liquid is dependent on the preparation protocol. The effect of removing a circular cut-out from the zero-pressure liquid configuration gives rise to a non-trivial stress distribution near the boundaries of the cut-out. This excess stress causes the particles near the edges to be displaced further inwards (due to the attractive nature of the interaction) near the boundaries. This leads to a new stress-balanced state, \n    ∂_iσ_i j(𝐫)=0,\n with δσ_ij displaying larger changes near the boundary. The condition of mechanical equilibrium at the boundary of the solids is satisfied when the normal force acting on the surface due to the internal pressure exactly balances the surface tension force. Our numerical observations suggest that the stress profile within the surface layer is largely independent of the system-size, leading to a constant surface tension across different system sizes. This suggests the bulk pressure will decrease as the radius of the solid is increased. In Fig. <ref> (d) we plot the bulk pressure for different system-size solids. We observe a P ∼1/R scaling of the bulk pressure with the radius of the solid droplet R, which is consistent with a “Laplace Law” for the pressure in a droplet <cit.>.\n \n\n\n §.§ Vibrational Density of States\n\nHaving characterized the boundary stress layer, we next turn to the system size dependence of the vibrational density of states. We expect the effects of the boundary to be significant only in system sizes for which the width of the boundary is comparable to the radius of the droplet. In order to discern the lengthscales corresponding to such a crossover, we analyze solids of various system-sizes with particle numbers ranging from N = 144 to 1600 in two dimensions and from N = 216 to 10000 in three dimensions. \n\n \n\n\n\nIn Fig. <ref> we report the effect of system size on the low-frequency vibrational spectrum of open boundary solids in two dimensions. The small systems (N = 144, 256) display a higher degree of softness in their vibration as can be seen from their low-frequency behavior of D(ω) ∼ω^4.5. The VDoS of systems with particle numbers equal to and larger than 400 appear to exhibit a low frequency regime of D(ω) ∼ω^5. This shows a crossover as the size of the system is increased beyond a lengthscale with the low frequency VDoS showing a significant change in the power-law, with the exponent varying from 4.5 to 5 in two dimensions.\n\nThe enhanced stability in the VDoS at large system sizes suggests that quasilocalized modes in the bulk result in the power-law ω^5, whereas modes localized on the surface are much softer and more unstable. We show further analysis comparing bulk and boundary localization in Appendix <ref>.\nFinally, such behavior in the thermodynamic limit of the OBC systems under consideration is consistent with earlier studies in PBC systems <cit.>.\n\n\n\n\nIn Fig. <ref> we plot the vibrational density of states for different system sizes in three dimensions. Here we observe a low-frequency behavior of D(ω) ∼ω^4.5 in contrast to the results in two dimensions. In Appendix <ref> we perform further analyses to examine this behavior.\n\n\n\n\n§ CONCLUSION AND DISCUSSION\n\n\nIn this paper, we have performed a detailed characterization of the vibrational modes of amorphous solids prepared under open boundary conditions in both two and three dimensions. We showed that structures prepared under open boundary conditions differ crucially in their stability properties in comparison to solids prepared with periodic boundary conditions. Specifically, we observed that the D(ω) ∼ω^δ with δ = 4 seen in systems under PBC is modified to a δ≈ 5 in 2D and δ≈ 4.5 in 3D, for solids under OBC. This points to the fact that open boundary solids which lack any macroscopic stresses are inherently more stable than their periodic boundary counterparts. These results reinforce the phenomenon observed by Krishnan et. al. <cit.> where shear-stabilized (σ_αβ = 0   ∀  α≠β) configurations under PBC display an increase in the exponent to δ≈ 5. Further, we probed the nature of energy minima of systems under OBC, through an analysis of the anharmonic coefficients associated with their lowest frequency vibrational mode. Surprisingly we have found that the anharmonic stability of the minimum is sensitive to the protocols employed in generating solid configurations. Moreover, the nature of the minima under consideration are also correlated with a change in the exponent of the VDoS. Specifically, the ensembles with unstable minima correspond to a D(ω) ∼ω^4, whereas ensembles with stable minima show larger exponents. In particular, we observed clear enhancements in the stability of configurations resulting from dissipative dynamical processes that anneal the system when compared to those obtained via quenching minimization protocols. Next, we also characterized the dependence of the low-frequency modes on the system size. Solids at small systems sizes show a higher degree of softness in their low frequency vibrations, as evidenced by a decrease in the exponent of the VDoS. We also performed an analysis of eigenmode localizations on the boundary and bulk of the system in order to decipher the source of the enhanced stabilization in systems under OBC. We found strong indications that the bulk of the solid predominantly contains stable vibrations, whereas the surface supports unstable modes. Finally, in order to isolate the cause of instability under PBC, we studied the vibrational spectrum of confined solids using a harmonic trap that introduces finite macroscopic stresses in the solid. We indeed showed that the D(ω) ∼ω^4 behavior of the VDoS is recovered with an increase in the strength of the confinement.\n\nOur study highlights aspects of the protocols used to create amorphous structures that have direct consequences on the nature of the sampled energy minima. We showed that various energy-minimization procedures populate qualitatively different minima of the landscape, as has also been observed in previous studies <cit.>. Our work in the context of open-boundary solids sheds light on the sparse nature of stable minima in such realistic systems. These results further raise important questions about the limits of stability that may be achieved through sufficient annealing.\n\nThrough our analysis of the stress-profiles of solids under OBC, we found that the crossovers between the stable and unstable behaviors of the VDoS are well-described by a bulk-boundary decomposition of the solids. The enhanced stability is derived from the low-stress environment of the bulk of the solid supported by a constant boundary stress. These results point to the fact that the frozen-in stresses are crucial in determining the stability of the amorphous solids as well as their vibrational density of states. It would be interesting to use the characterization of the boundary layer and stress distributions that appear in such confined systems to understand the correlations between the macroscopic stress tensor and the distribution of eigenmodes.\n\nNotably, our ensembles exhibit liquid-like surface tensions, as seen by the conformance of bulk pressures to the Laplace law. This observation bares further examination in order to probe any correlation to the enhanced stability of open-boundary solids. Although our results for the cut-out protocol reveal striking properties of vibrations in solids under OBC, it would be intriguing to further characterize this behavior with other preparation protocols, such as by evaporation and deposition, which is of direct experimental relevance.\n\nFinally, our results in three-dimensional systems regarding their smaller power-law exponent D(ω) ∼ω^4.5 in comparison to two-dimensional systems is surprising in the context of earlier work displaying a universal ω^5 behavior in shear-stabilized systems under PBC. This points to a possibility that systems in higher dimensions support more localization of vibrations. It would be interesting to explore aspects of this non-universality in open-boundary systems.\n\n\n\nWe thank Roshan Maharana, Monoj Adhikari, Deepak Dhar and Prasad Perlekar for useful discussions. S. K. would like to acknowledge support through the Swarna Jayanti Fellowship Grant No. DST/SJF/PSA-01/2018-19 and SB/SFJ/2019-20/05. The work of K. R. was partially supported by the SERB-MATRICS grant MTR/2022/000966. This project was funded by intramural funds at TIFR Hyderabad from the Department of Atomic Energy, Government of India.\n\n\n\n\n\n\n§ EIGENMODE LOCALIZATION — SURFACE VS BULK\n\n\nIn this section we provide further analysis of the lowest frequency vibrational modes in two dimensions, in order to determine the potential source of the stable vibrations achieved under open boundary conditions.\n\nThe spatial extent of a mode may be evaluated by measuring the participation ratio (PR), \n\n    PR=(∑_i=1^N⟨ψ_i|ψ_i⟩)^2/N∑_i=1^N(⟨ψ_i|ψ_i⟩)^2\n \nwhere |ψ_i^k⟩ denotes the d dimensional component of the eigenmode ψ^k, corresponding to particle i. System spanning modes possess a PR close to unity while spatially localized modes display a PR ∼ 1/N.\n\n\n\n\nThe contribution of the particles on the surface of the solid to a particular mode may then be estimated through the “Surface Participation” (SP) as defined below.\n\n    ψ_s^2(k) = ∑_i ∈⟨ψ_i^k|ψ_i^k⟩\n\nThe  is defined as encompassing all the particles belonging to the boundary layer as determined by the stress-analysis described in Sec. <ref>. Modes localized on the surface of the solid display an SP close to 1 whereas a vibration that is localized deeper within the bulk of the solid incurs an SP closer to 0. In Fig. <ref> (a) we plot the probability distribution of SP for the lowest frequency modes in two dimensional solids of system size N=400. The peak of the distribution corresponds to modes with extended, system-spanning vibrations that all particles participate in. By observation, we consider modes with an SP ≤ 0.7 to be predominantly bulk-localized vibrations and modes with an SP ≥ 0.8 to be predominantly surface-localized. In Fig. <ref> (b) and (c) we plot histograms of the lowest frequency divided by ω_min^δ in order to extract the power-law. We find that bulk-localized modes (Fig. <ref> (b)) display the stabilized δ≈ 5 while the surface-localized modes (Fig. <ref> (c)) present a more unstable δ≈ 4.5. This points to the possibility that the low-stress environment of the bulk contributes stable vibrations while the large stresses at the surface result in modes of lower stability. Furthermore, such a separation potentially explains the large degree of softness observed in the vibrational spectrum at small system-sizes.\n\n\n\n§ EFFECT OF CONFINING STRESSES\n\n\n\nIn this section, we show that the vibrational properties of systems under periodic boundaries can by reproduced by imposing macroscopic stresses on open boundary solids.\n\nThe stresses in a system are described through the force moment tensor defined as\n\n    Σ_αβ=∑_i∑_j f_α^i j r_β^i j=σ_αβ A\n\nwhere f_α^i j is the α-component of the force on particle i by particle j, r_β^i j is the β-component of the vector distance between the particles i and j, σ_αβ is the macroscopic stress tensor and A is the area of the two dimensional system. Solids prepared under open boundary conditions have precisely zero macroscopic stresses i.e. σ_xx=σ_yy=σ_xy=0. As described in Secs. <ref> and <ref>, such systems display a D(ω) ∼ω^δ with δ>4, in contrast to PBC systems where δ = 4. It is therefore interesting to analyze the effects of re-introducing stresses, on the vibrational spectrum of solids.\n\n\n\n\n\n\n\n\n\nIn order to accomplish this we have studied the vibrational modes of solids confined in a radially symmetric harmonic trap centered at the center of mass (CM) of the system, as follows:\n\n\n    U(𝐫_1, 𝐫_2, …𝐫_n) =  V(𝐫_1, 𝐫_2, …𝐫_n) + 1/2∑_i=1^Nκ |𝐫_i-𝐫_cm|^2,\n\n\nwhere κ is the spring constant of the trap, 𝐫_cm is the location of the CM and V(𝐫_1, 𝐫_2, …𝐫_n) represents the pair-wise particle interaction. We then perform Damped Dynamics to obtain energy-minimized solid configurations.\nSince the center of the harmonic trap is fixed, it breaks translational symmetry. However, it being radially symmetric, the system retains one zero mode corresponding to global rotations. The translational zero-modes are substituted with eigenvalues corresponding to the stiffness of the confining harmonic potential. We therefore sample the low-frequency modes while excluding the zero mode as well as this trivial addition to the spectrum. In Fig. <ref> we display the effect of confinement on the low-frequency vibrational spectrum at various strengths of the harmonic trap. Remarkably we find that confinement results in a higher degree of softness in the vibrational spectrum of the solids. Increasing the stiffness constant results in large shear stresses in the solid ensemble with a corresponding change in the VDoS from D(ω) ∼ω^5 to D(ω) ∼ω^4.\n\n\n\n§ THREE DIMENSIONAL SYSTEMS\n\n\nIn this section we provide a characterization of the lowest frequency vibrational modes in  three dimensional open boundary solids. We study the contribution of surface particles on these modes through their “Surface Participation” (SP) as defined in  Eq. (<ref>). In Fig. <ref> (a) we plot the probability distribution of SP corresponding to the lowest frequency modes in three dimensional solids of various system sizes. The modes with a value of SP corresponding to the peaks of the distributions are extended, system-spanning vibrations. In the case of the distribution corresponding to a system size N = 4096, we define the modes with SP ≤ 0.82 as being predominantly bulk-localized vibrations and modes with ≥ 0.9 as predominantly surface-localized. In Fig. <ref> (b) and (c) we plot histograms of the lowest frequency for bulk and surface localized modes respectively. We find that bulk-localized modes display a δ≈ 4.5 and surface-localized modes show a δ≈ 4.\n\n\napsrev4-2 \n\n"}