{"entry_id": "http://arxiv.org/abs/2303.07372v1", "published": "20230313180005", "title": "Dark matter from hot big bang black holes", "authors": ["Avi Friedlander", "Ningqiang Song", "Aaron C. Vincent"], "primary_category": "hep-ph", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "text": "\n\n\n\n\n\navi.friedlander@queensu.ca\nDepartment of Physics, Engineering Physics and Astronomy, Queen's University, Kingston ON K7L 3N6, Canada\nArthur B. McDonald Canadian Astroparticle Physics Research Institute, Kingston ON K7L 3N6, Canada\n\n\nsongnq@itp.ac.cn\nInstitute of Theoretical Physics, Chinese Academy of Sciences, Beijing, 100190, China\nDepartment of Mathematical Sciences, University of Liverpool, \n Liverpool, L69 7ZL, United Kingdom\n\n\naaron.vincent@queensu.ca\nDepartment of Physics, Engineering Physics and Astronomy, Queen's University, Kingston ON K7L 3N6, Canada\nArthur B. McDonald Canadian Astroparticle Physics Research Institute, Kingston ON K7L 3N6, Canada\nPerimeter Institute for Theoretical Physics, Waterloo ON N2L 2Y5, Canada\n\n\n\n\nIf the temperature of the hot thermal plasma in the Early Universe was within a few orders of magnitude of the Planck scale , then the hoop conjecture predicts the formation of microscopic black holes from particle collisions in the plasma. Although these evaporated instantly, they would have left behind a relic abundance of all stable degrees of freedom which couple to gravity. Here we show that, upon minimal assumptions of a high reheat temperature and semiclassical black hole dynamics, this process could have produced the relic abundance of dark matter observed today for a particle mass anywhere in the range of 100 keV≲ m_dm < M_ Pl. The production mechanism does not rely on any additional assumptions about non-gravitational dark matter-Standard Model interaction.\n\n\nDark matter from hot big bang black holes\n    Aaron C. Vincent\n    March 30, 2023\n=========================================\n\n\n\nIntroduction — Big Bang cosmology describes an expanding universe originating from an initially hot, dense state. Its modern incarnation, the ΛCDM (dark energy-cold dark matter) concordance model, accurately predicts nucleosynthesis and recombination, and with only six free parameters, is able to reproduce the observed power spectrum of the Cosmic Microwave Background (CMB) and Large Scale Structure <cit.>. However, ΛCDM remains agnostic about the origins of these free parameters, and about the initial temperature of the Universe, —usually called the reheating temperature—so long as it is a factor of a few higher than what is necessary for nucleosynthesis.\n\nMost attempts to explain the relic abundance of dark matter, Ω_dmh^2, postulate some non-gravitational portal between the Standard Model and the dark sector,  that could lead to signatures in the laboratory from scattering, annihilation or production at colliders (see Refs. <cit.> for reviews). However, as the evidence for dark matter comes via its gravitational effects alone, such a portal is not required. For instance, superheavy dark matter could have been produced from the vacuum fluctuations during or at the end of inflation <cit.>. \n\nHere, we show that if the Universe started at a very high temperature, within a few orders of magnitude of the Planck mass , the high-energy tail of the plasma's phase space distribution would lead to super-Planckian collisions which produce microscopic black holes. Because Hawking radiation produces all kinematically-accessible particles that couple to gravity, the subsequent rapid black hole evaporation  can yield the measured value of Ω_dmh^2 with minimal assumptions, and without requiring the dark sector to communicate non-gravitationally with the Standard Model.\n\nThe production of dark matter from black hole evaporation has been examined in Refs. <cit.>. Those scenarios rely on a well-established but “beyond-ΛCDM” black hole production mechanism, such as non-Gaussian field excursions during inflation. Alternatively, the production and evolution of primordial black holes from particle collisions has been studied in scenarios with exotic assumptions about the Planck scale <cit.>. \n\nIn contrast to previous approaches, the scenario that we examine here only makes minimal assumptions about standard Big Bang cosmology, namely: 1) a high  and 2) semiclassical arguments about the formation and evaporation of black holes remain valid near the Planck scale. These  values are larger than allowed by the simplest slow roll single field inflation models. However, no model independent constraints exist on such  values. The first upper bounds on ∼ should come from next-generation CMB observatories <cit.>. \n\nWhile little is conclusively known about the breakdown of semiclassical black hole physics, we will present results for different assumptions on the impact of quantum gravity on Planck-scale black holes including a demonstration that the qualitative results in this work hold even if the formed black holes are restricted to a regime where semiclassical arguments are expected to be trustworthy. \n\nWe will show that dark matter can be produced gravitationally in the early Universe without requiring any non-gravitational interactions or exotic cosmology beyond the ΛCDM framework. While the absence of non-gravitational interactions would make direct detection challenging, there are observational signatures that arise from the requirement of a hot big bang. Furthermore, black hole evaporation yields a non-thermal dark matter velocity distribution. We will briefly return to these ideas in the final sections.\n\nHereafter, we work in “particle physicist units” where c=ħ=k_B =1, but  carries units of energy.\n\n\nFormation and evaporation of black holes in the primordial plasma — A black hole of mass  is characterized by its horizon radius (). The hoop conjecture posits that when two particles with centre-of-mass energy √(s) come within an impact parameter 2r_h(√(s)) of each other, they will form a black hole of mass = √(s) <cit.>. If the collision is head-on and has no net charge, then = 2 /^2 and a neutral, non-rotating Schwartszchild black hole is formed. In reality, particle collisions will not be exactly head-on and many would have non-zero net charge. However, the majority of formed black holes would be non-extremal. While charged and rotating black holes would have altered evaporation rates leading to 𝒪(1) changes in the relic abundance, these  are unlikely to affect our overall conclusions.\n\nEven if the plasma temperature is well below the Planck scale, the high-energy tail of the phase space distribution can extend to energies above . During radiation domination, the black hole collisional production rate per unit mass per unit volume is <cit.>\n\n    dΓd=g_⋆(T)^2 ^5 T^22π^3 ^4[TK_1(/T)+2K_2(/T)],\n\nas long as  is greater than , the minimum mass-energy required to form a black hole. Here, g_*(T) is the  effective number of relativistic degrees of freedom in the plasma, which has a temperature T, and K_i(x) is the modified Bessel function of the second kind. A derivation of Eq.(<ref>) can be found in the Spp. Mat. <ref>. Because K_i(x) ≈√(π/(2x))e^-x for large x, in the limit of temperature T≪ the black hole production rate is approximately\n\n    dΓd=g_⋆(T)^2 ^11/2 T^3/22√(2)π^5/2^4e^-/T ,\n\nfor >. A simple assumption is that ≃. However, in the absence of a theory of quantum gravity, arguments can be made about the minimum black hole mass being larger or smaller than . We will thus explore a range of  values, and will find that it does not qualitatively affect our conclusions as long as it is within an order of magnitude of the Planck mass.\n\n\nThe black holes thus formed will evaporate nearly instantaneously. Hawking's semiclassical arguments predict a distorted thermal spectrum comprising all degrees of freedom that couple to gravity. The evaporation rate is characterized by a Hawking Temperature T_H = ^2/8π <cit.>. \n\nThe rate of mass loss from evaporation to species i can be compactly expressed as\n\n    -d M_∙→ i/dt = g_i/2π^2∫E σ_i(r_hE)exp(E/T_H)∓ 1p^2dp ,\n\nwhere the (+) sign applies to fermions and the (-) sign to bosons. g_i is the number of degrees of freedom in species i, and E and p are respectively the energy and momentum of the evaporation product. The greybody distortion factors σ_i encode the probability of a particle escaping to “infinity”, and are computed via partial-wave scattering. Here, we use values provided by  <cit.> and compiled in  <cit.>.\n\nGoing forward, we take the limit where the masses of the evaporation products  m_i are much lower than T_H, which will hold for m_i ≪.   (<ref>) then integrates to a constant times T_H^2, and the total evaporation rate is a sum over all evaporation species:\n\n    d M_∙/dt = ∑_i d M_∙→ idt=-∑_ig_i α_i ^2 = -α_ tot T_H^2,\n\nwhere the α_i are constants that depend only on the spin of species i. These are provided in Tab. <ref> for spin 0, 1/2 and 1 particles, along with α_tot, which is simply a sum of the α_i weighted by the number of degrees of freedom in each sector in the Standard Model. Graviton (spin-2) production is suppressed, and does not affect the value of α_tot to the precision that we quote.\n\n\nThe number of particles produced is found in a near-identical way to Eqs. (<ref>-<ref>), but dropping the factor of E in the integrand of Eq. (<ref>). At high T_H, this yields a production rate of particles of species i per black hole:\n\n    dN_i/dt = g_i β_i ,\n\nwhere the β_i are factors that again depend only on the spin; these are given in Tab. <ref>. \nThe total number of particles of each species produced by a black hole of initial mass  is thus\n\n    N_i = ∫_^0 ddN_i/dt(d /dt)^-1 = 4π g_iβ_i ^2/α_ tot^2  .\n\n\nRelic abundance of dark matter — We now specialize to the case of interest, the production of a stable dark matter species with g_dm degrees of freedom and mass m_dm≪ that is thermally decoupled from the primordial plasma. \n\n\nDark matter production shuts off exponentially as the Universe cools, so the number density of dark matter particles at T = T_RH is found, to good accuracy, by convolving the black hole production rate with N_dm over all temperatures:\n\n\n    n_dm() ≈∫_^0 dT(dT/dt)^-1∫_^∞ d N_dmdΓd .\n\nDuring radiation domination, dT/dt=-HT and the Hubble parameter is given by the Friedmann equation, H^2=8πρ_r/(3^2), where the radiation density is ρ_r=π^2g_* T^4 / 30.\nThe integral in  (<ref>) can be performed analytically, yielding\n\n    n_dm()≈3√(5/2) g_*()^3/2 g_dmβ_dm/π^3α_ tot^8/^5 f_dm(T_RH/),\n\nwhere the dependence on  is encoded by the function f_dm(x). To lowest order in /, this is\n\n    f_dm(T_RH/) ≃(/)^3/2 e^-/ .\n\nGoing forward, we will nonetheless use the full (but less intuitive) analytic result of the integral in (<ref>). The full expression as well as a comparison with Eq. (<ref>) can be found in Supp. Mat. <ref>.\n\nFinally, if the dark sector is fully decoupled, it only redshifts due to adiabatic expansion, and the conservation of entropy yields a present-day dark matter density:\n\n    Ω_dm = g_*s(T_0) T_0^3 n_dm() m_dm/g_*s() ^3 ρ_c ,\n\nwhere g_*s is the effective number of degrees of freedom contributing to entropy, T_0 is the CMB radiation temperature today, and ρ_c is the present-day critical density. The abundance of DM thus scales as:\n\n    Ω_dm h^2 ∼ 0.1  g_dmm_dm/10  keV(/)^5 (/10 )^3/2 e^-/10 ,\n\nas long as g_dm is significantly smaller than the total number of Standard Model degrees of freedom.\n\n\n\n <ref> shows the relic abundance of dark matter with different masses as a function of the reheating temperature. Because the Hawking temperature is much higher than the dark matter masses we are considering, production is relativistic and the process leads to a fixed number density for a given  and . It is thus insensitive to the dark matter mass except for the linear scaling in  (<ref>). A larger / predictably yields more black hole production, and more transfer of energy into the dark sector. \n\nIn the absence of a theory of quantum gravity, there is significant uncertainty about Planck scale black hole production and evaporation.  <ref> and <ref> therefore present results for a range of values of  from 0.1 to 4 times the Planck mass, covering optimistic to conservative scenarios. At the higher end of this range, we have demanded that the evaporation timescale be much longer than the horizon formation rate, which amounts to a condition on the black hole entropy, and ensures that semiclassical assumptions remain valid <cit.>. However, sub-Planckian black holes have been discussed in the context of certain quantum gravity frameworks <cit.>, and it is furthermore not clear that horizon-formation is even necessary for this mechanism to have produced our dark matter, as pre-Hawking radiation which prevents total collapse could have very similar consequences as seen by an observer at “infinity” <cit.>. \n\n <ref> shows the locations in the –m_dm plane that yield the observed abundance of dark matter today. Different line styles correspond to different assumptions for the minimum allowed black hole mass, while colours correspond to dark matter spin. Because of the exponential scaling with , dark matter with masses from a few keV to ≳ 10^18 GeV can be produced in the observed amount within only a comparatively small window of reheating temperatures 10^-3≲/≲ 0.1. A higher minimum mass for black hole formation predictably raises the required .\n\nFor completeness we also consider the possibility that the evaporating black hole ends up as a stable remnant with ∼, the so called Planckeon[Also called  “Planck Relics” or “Black Hole Remnants”, see Ref. <cit.> for a review.] <cit.>, which would act as cold dark matter, an alternative channel to evaporative production. Planckeon production by particle collisions during a hot big bang has been previously proposed <cit.>; we improve on their estimates by making use of  the full differential black hole production rate, discussed above. We show in  <ref> and <ref> the Planckeon relic abundance and the corresponding reheating temperatures. In  <ref>, the Planckeon lines are horizontal because their mass is held fixed at m_dm=. These figures demonstrate that if Planckeons are stable, their abundance will always dominate over dark matter species produced from evaporation. Additional details on our calculation of the Planckeon abundance are presented in the Supp. Mat. <ref>. We note that if a significant fraction of Planckeons retains some electric charge their presence as the dominant dark matter component may be discovered or severely constrained in the near future <cit.>.\n\nWarm Dark Matter Constraints — The matter power spectrum is measured via the Lyman-α forest and places strong constraints on warm dark matter (WDM). This can be translated to a lower limit on the mass of dark matter from black hole evaporation. Because evaporation produces a distorted thermal spectrum, we follow the method of Ref. <cit.>, and demand that the average dark matter velocity is at most the average velocity of WDM <cit.> with the minimum mass allowed by Lyman-α observations, m_ min^wdm.\n\nWe obtained the average dark matter momentum at production by reproducing the procedure from previous sections, finding the total energy density of dark matter produced, ρ_dm, and noting that for relativistic particles the average momentum is simply ρ_dm/n_dm. If the dark matter momentum redshifts only due to Universe expansion, this yields a limit on m_dm:\n\n    m_dm≳ 10^-5  GeVα_dm/β_dm( 0.1 /) ( m_ min^wdm/4  keV)^4/3 ,\n\nwhere we take the WDM mass limit of m_ min^wdm = 4.65 keV <cit.>. These  limits are shown as a shaded region in  <ref>, and constrain dark matter produced in black hole evaporation to be heavier than ∼ 100 keV.\n\nLarge Reheating Temperature —\nIn single-field slow-roll inflationary models, CMB meaasurements of the scalar power spectrum amplitude A_s and limits on the tensor-to-scalar ratio r set an upper limit on the energy density at the end of inflation of ρ_RH≲ (1.6×10^16  GeV)^4 <cit.>. However, these do not directly apply to some multi-field inflation models <cit.> or to non-inflationary theories of the early Universe such as a cyclic Universe <cit.> or String Gas Cosmology <cit.>.\n\nBecause the mechanism discussed here can in principle produce a relic abundance of completely sterile dark matter, the high  required is one of the few model-independent observational targets. A large reheating temperature would enhance the normally ^-2-suppressed background of gravitational waves with frequencies 𝒪(100  GHz) <cit.>. These   would contribute to the effective number of relativistic degrees of freedom at recombination, N_ eff. While current N_ eff measurements do not constrain sub-Planckian  values, the next generation of CMB experiments could probe ≲ <cit.>. Ultimately, if CMB experiments are able to constrain N_ eff down to the theoretical uncertainty limit δ N_ eff∼ 10^-3, then < 2×10^17 GeV could be within reach <cit.>, conclusively testing the microscopic black hole production of dark matter with ≥ and m_dm≲ 10^16 GeV as seen by the gray dot-dashed line in  <ref>. The high-frequency gravitational waves from  and from black hole evaporation could be converted to microwaves in a strong magnetic field via the inverse Gertsenshtein effect <cit.>. However, even optimistic predictions lead to similar sensitivities <cit.> as N_ eff, and the technology remains largely undeveloped.\n\n\n Conclusions —\nWe have presented a novel mechanism which allows for the gravitational production of dark matter that does not rely on any non-gravitational interactions with the Standard Model or specific inflationary physics. The only non-standard assumption required to achieve the observed relic abundance is a large ≳ 10^17 GeV. While the curves presented in  <ref> and <ref> rely on only the existence of Standard Model particles and one dark matter species, additional stable or unstable particle species between the Weak and Planck scales do not affect our conclusions, and are only a matter of bookkeeping in the values of g_dm, α_ tot, g_⋆, and g_⋆ S at . \n\n\nA more detailed treatment including the effects of black hole rotation and charge will yield a more accurate prediction of the values of  and  required to produce the dark matter observed today. As such greybody factors differ only by ∼ O(1-10), we do not expect a qualitative change in the overall conclusions. \n\nObservational handles on such a secluded sector produced at such early times remain few and far between. However, discovery of a large near-Planck scale  will set a model-independent upper bound on the mass of any new stable particle which does not reach chemical equilibrium with the Standard Model. Subtle gravitational-wave observables may hint at such high reheating temperatures, and quantifying the impact of this non-thermal dark matter distribution on large scale structure may provide additional clues. Ultimately, the question of dark matter's true nature may be tied to the very early Universe and quantum gravity, and if we can pull on a single thread, it may reveal far more than expected.\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe thank Joe Bramante and Sarah Shandera for helpful discussions.\nAF is supported by an Ontario Graduate Scholarship. NS is supported by the National Natural Science Foundation of China (NSFC) Project No. 12047503. NS also  acknowledges the UK Science and Technology Facilities Council for support through the Quantum Sensors for the Hidden Sector collaboration under the grant ST/T006145/1. ACV is supported by the Arthur B. McDonald Canadian Astroparticle Physics Research Institute, NSERC, and the province of Ontario via an Early Researcher Award. Equipment is funded by the Canada Foundation for Innovation and the Province of Ontario, and housed at the Queen's Centre for Advanced Computing. Research at Perimeter Institute is supported by the Government of Canada through the Department of Innovation, Science, and Economic Development, and by the Province of Ontario.\n\n\nDark matter from hot big bang black holes\n    Aaron C. Vincent\n    March 30, 2023\n=========================================\n\n\n\nDark matter from hot big bang black holes\n\n\n\n Supplementary Material\n \n\n\nAvi Friedlander, Ningqiang Song and Aaron C. Vincent\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ BLACK HOLE PRODUCTION RATE\n \n\nIn a high-temperature relativistic plasma, the collisional black hole formation rate per unit volume per unit mass can be written as <cit.>\n\n    dΓd=g_⋆(T)^2∫d^3k_1(2π)^3d^3k_2(2π)^3e^-k_1/Te^-k_2/Tσ()v_relδ(√((k^μ_1+k^μ_2)^2)-)Θ(-) ,\n\nwhere we have assumed that the thermal distribution of parent particles is approximately Maxwellian because particles with k ≪ T are irrelevant for black hole formation. The step function Θ ensures E_CM≥. The integral can be evaluated if v_rel=|v⃗_1-v⃗_2|≃ 1 by defining θ as the angle between the incoming particles and integrating over all other angles. This results in:\n\n    dΓd=\n        g_⋆(T)^2 σ()/8π^4∫ dk_1 dk_2 dcos(θ) e^-k_1/Te^-k_2/T\n       k_1^2k_2^2 δ(√(2k_1 k_2 (1-cosθ))-)Θ(-) .\n\nThese integrals can be performed analytically resulting in a formation rate of\n\n    dΓd=g_⋆(T)^2σ() 32π^4^3 T^2[TK_1(/T)+2K_2(/T)]Θ(-) ,\n\nwhere K_i(x) is the modified Bessel function of the second kind. Finally  (<ref>) is produced by assuming that the production cross-section is equal to the geometric limit:\n\n    σ()  = 4 π^2  ,\n\n\n\n\n§ ANALYTIC EXPRESSIONS AND THEIR ACCURACY\n \n\nIn deriving the relic abundance of dark matter we used three approximations:\n\n    \n  * Using the T ≪ limit for the production rate of black holes to transform  (<ref>) to  (<ref>). \n    \n  * Assuming black hole evaporation is independent of dark matter mass. This was used to determine the black hole evaporation rate (<ref>) and particle production rate (<ref>).\n    \n  * Presenting the analytic expressions only to lowest order in /.\n\nThe results shown in the main text use the first two approximations, whereas the third  is only used to present the analytic equation in a more intuitive form. In this section we demonstrate the range of validity of these approximations and present the full analytic form for dark matter number density.\n\nFor the first approximation, we simplified the production rate of black holes, dΓ/d by assuming that the plasma temperature, T, is much smaller than the mass of the formed black hole, . In this limit, the Bessel function is K_i(x) ≈√(π/(2x))e^-x for large x. The left panel of  <ref> shows the black hole production rate at different temperatures. The full expression which accounts for the integral over the full Maxwell-Boltzmann distribution is shown as solid curves, whereas the dashed curves show the low-T approximation. \n\nBy directly comparing the approximation (<ref>) to the full equation (<ref>), the fractional error, δ_Γ, from using this approximation is\n\n    δ_Γ = 1 - √(2 /π T) e^-/T(TK_1(/T)+2K_2(/T))^-1 .\n\nThe right panel of  <ref> shows how the fractional error depends on the ratio of plasma temperature to black hole mass. As long as ≳ 20 T, the error on the black hole production rate is less than 10%. For black hole production the black hole mass will always be larger than  which is typically close to  and the plasma temperature is always below the Planck scale. This makes the low-T limit a viable approximation.\n\n\n\nThe second approximation we use is that the black hole evaporation is independent of any particle's mass, which is true as long as all species are produced relativistically, i.e. m_i≪. This results in the evaporation rate being proportional to ^2 as expressed in  (<ref>) and the particle number production rate being proportional to  ( <ref>). Without this assumption, the constants α_i and β_i would be replaced by functions that depend on m_i/. The validity of our results only start to break down when the dark matter mass comes within an order one factor of the Planck scale. \n\nFinally, Eq. (<ref>) only shows f(x) to first order, whereas the full expression is:\n\n    f_dm(T_RH/) =  1/8[(/)^8 Γ(17/2, /) - √(π)( 1 -  erf(√(/))  )]  .\n\nwhich we have used to produce the results of Figs. <ref> and <ref>. Here, Γ(s,x) is the upper incomplete Gamma function and erf(x) is the error function.\n\n <ref> compares three methods for determining relic abundance of dark matter from evaporating black holes: the analytic expression using  (<ref>) used to produce the main text's results is depicted as solid red curves, the lowest order analytic expression using  (<ref>) is depicted as dashed red curves, and the most accurate result found by numerically solving all integrals without the small / or small m_dm/ approximations. In all cases the lowest order analytic approximation underestimates the relic abundance while maintaining the same qualitative dependence on dark matter mass and reheating temperature. These three methods are compared for largest  and m_dm values shown in  <ref>.\n\nThe upper left panel of  <ref> shows the relic abundance of fermionic dark matter with m_dm = 10^-5 GeV. The reheating temperature required to produce the observed relic abundance is ∼ 0.1. As shown in  <ref>, the small T/ approximation under-predicts the number of black holes that form in the early Universe. This in turn leads to under-predicting the relic abundance of dark matter produced by those black holes evaporating. For this set of parameters where ∼ 0.1, the relic abundance is underestimated by about 20%. However, the upper right panel shows that this error is significantly reduced to below 10% for lower reheating temperatures, ∼ 0.05, as is needed to produce the correct relic abundance for fermionic dark matter with m_dm = 1 GeV.\n\nThe lower two panels of  <ref> demonstrate the success of the analytic approximation even for very heavy dark matter. As discussed above, when m_dm≳, the analytic approximation ignores the Boltzmann suppression and predicts more dark matter production than the more correct numeric calculation. The lower left panel shows that for m_dm = 10^17 GeV, the analytic approximation does not over-predict the dark matter abundance at all. For even heavier dark matter with a mass of m_dm = 10^18 GeV, the analytic approximation does start to over-predict the relic abundance of dark matter producing an error of about 7%. This is the upper limit shown in  <ref> for dark matter mass produced from black hole evaporation.\n\n\n\n\n\n§ PLANCKEON ABUNDANCE\n \nIf stable Planckeons are indeed the end result of black hole evaporation then one Planckeon would be produced for each black hole. The number density of Planckeons can be found using the same approach as for black hole evaporation, but  using N_dm = 1 in the integrand of (<ref>). Following the same procedure as for dark matter from evaporation, this gives a number density of Plankeons:\n\n    n_pl()   ≈3√(5/2) g_*()^3/2/4π^4^6/^3f_pl(/),\n\nwhere the  dependence is encoded in the function f_pl(x). For the full analytic dependence on  we obtained:\n\n    f_pl(T_RH/) =  1/6[(/)^6 Γ(13/2, /) - √(π)( 1 -  erf(√(/))  )]  .\n\nWhile this differs from the black hole evaporation case provided in  (<ref>), to lowest order the  dependence is the same for Planckeons and dark matter from evaporation. Using f_pl≈ f_dm, we obtain:\n\n    n_pl() ≈3√(5/2) g_*()^3/2/4π^4^6/^3(/)^3/2 e^-/ .\n\nThe results of this expression are shown in purple in Figs.  <ref> and <ref>.\n"}