{"entry_id": "http://arxiv.org/abs/2303.07145v1", "published": "20230313141328", "title": "Sublinear drag regime at mesoscopic scales in viscoelastic materials", "authors": ["A. E. O. Ferreira", "J. L. B. de Araújo", "W. P. Ferreira", "J. S. de Sousa", "C. L. N. Oliveira"], "primary_category": "cond-mat.soft", "categories": ["cond-mat.soft"], "text": "\n\n\n\n\n\n\nDepartamento de Física, Universidade Federal do\n  Ceará, 60451-970 Fortaleza, Ceará, Brazil\n\n \nLaboratório de Ciência de Dados e Inteligência Artificial, \nUniversidade de Fortaleza, 60811-905 Fortaleza, Ceará, Brazil\n\n \n\nDepartamento de Física, Universidade Federal do\n  Ceará, 60451-970 Fortaleza, Ceará, Brazil \n\n\n\nDepartamento de Física, Universidade Federal do\n  Ceará, 60451-970 Fortaleza, Ceará, Brazil\n  \n\nlucas@fisica.ufc.br\nDepartamento de Física, Universidade Federal do\n  Ceará, 60451-970 Fortaleza, Ceará, Brazil\n\n\n\nStressed soft materials commonly present viscoelastic signatures in\nthe form of power-law or exponential decay. Understanding the origins\nof such rheologic behaviors is crucial to find proper technological\napplications. Using an elastic network model of macromolecules\nimmersed in a viscous fluid, we numerically reproduce those\ncharacteristic viscoelastic relaxations and show how the microscopic\ninteractions determine the rheologic response. We find that\nexponential relaxations are indeed the most common behavior. However,\npower laws may arise when drag forces between the macromolecules and\nthe fluid are sublinear, which is related to micro-deformations of the\nmacromolecules.\n\n\nSublinear drag regime at mesoscopic scales in\n  viscoelastic materials\n    C. L. N. Oliveira\n    March 30, 2023\n======================================================================\n\n\n\n\nPurely elastic and purely viscous behaviors are limited cases of\nconstitutive equations of materials <cit.>. Actual\nsubstances may deform and flow, but one of these attributes usually\ndominates the other, depending on the applied conditions. This\nsolid-liquid duality has teased researchers since at least the\n19^th century. Back then, pioneers such as James Maxwell and\nLudwig Boltzmann proposed analytical models based on series and\nparallel associations of springs and dashpots to explain the peculiar\ncharacteristics observed in silk, glass fibers, and steel\nwires <cit.>. The effective response of\nsuch early models invariably presents exponential relaxation decays,\nregardless of how springs and dashpots are connected. However, these\nsimple approaches are only suited for some viscoelastic materials\nnowadays.\n\n\nIn modern society, soft matter is ubiquitous and broadly\naccessible. The emergence of such complex materials has triggered new\ntheoretical models and the improvement of proper experimental\ntechniques to explain and control their viscoelastic\nproperties <cit.>. Nanoindentation methods, such\nas Atomic Force Microscopy, have become essential to characterize\nviscoelastic features at micro and nanometer scales by probing\nmaterials with nano-sized indenters <cit.>. The\ncharacterization of viscoelastic materials attempts to determine the\nrelaxation function that possesses both qualitative and quantitative\ninformation.\n\n\nExponential and power-law relaxation functions are the two major types\nof experimentally probed responses. Polyacrylamide\ngels <cit.> and aqueous solutions of cationic\nsurfactants <cit.>, for instance, present exponential-like\nresponses with a relaxation time for the material to achieve a new\nequilibrium configuration. On the other hand, living\ncells <cit.>, microgel dispersions <cit.>, soft\nglassy materials <cit.>, and hydrogels <cit.>\npresent a time-invariant power-law-like behavior.  As observed in\nelastic materials <cit.>, macroscopic\nphysical parameters are intrinsically connected to their microscopic\ninteractions and structures <cit.>.\n\n\nPower laws and exponentials arise in many physical phenomena having a\ndeep origin in their dynamic processes. For instance, in non-additive\nentropy systems, many physical variables are described by power-law\ndistributions instead of the traditional exponential functions in the\ncounterpart entropy <cit.>. Exponential and\npower-law canonical distributions emerge naturally regarding whether\nthe heat capacity of the heat bath is constant or\ndiverges <cit.>. Moreover, power laws are associated with\nemergence phenomena where exponents display scaling behaviors as they\napproach criticality <cit.>. Systems with precisely the\nsame critical exponents belong to the same universality class, and a\nsmall set of universality classes describes almost all material phase\ntransitions.\n\n\nOne of the challenges in material science is linking the physical\nmechanisms at microscopic scales to macroscopic functional\nbehavior. This approach is especially relevant for soft matter because\nproperties on the molecular scale are linked to conformational and\ncompositional fluctuations on the nanometer and micrometer scale and,\nin addition, span many orders of magnitude in\nlength <cit.>. Soft matter holds rich\nstructures and various interactions at the mesoscale, where thermal\nenergy per unit volume is negligible, in contrast with the high energy\ndensity stored in atomic bonds of crystalline\nstructures <cit.>. While exponential materials can be modeled\nby an association of springs and dashpots, such as the so-called\nstandard linear solid model, power-law materials are usually obtained\nby fractional rheology <cit.> or glassy\nrheology models <cit.>. However, these models\ncannot explain the connection between macroscopic responses and their\nelastic and viscous components.\n\n\n\nWe design a model of viscoelastic materials composed of an immersed\nelastic network of macromolecules to study how mesoscopic interactions\ninfluence macroscopic rheological behavior in soft\nmaterials <cit.>. We assume non-linear hydrodynamic drag\nforces act between the macromolecule and the fluid, where the\ncontribution of elastic and viscous interactions are controlled at the\nmesoscopic level. By changing the physical parameters of elastic and\ndrag forces, we obtain materials with exponential or power-law\nrelaxations or then an intermediary behavior for responses not clearly\ncharacterized. Our results show that exponential behavior is, in fact,\nthe most common regime of deformation, being described by the standard\nlinear solid model. Power-law responses are exceptional outcomes for a\nparticular range of sublinear drag forces.\n\n\n\n \n\n\n\nOur model consists of N spherical particles of diameter σ and\nmass m arranged in a face-centered cubic (FCC) lattice with\ndimensions x× y× z given by σ Hsin(π/3) ×σ Hsin(π/3) ×σ H, where H is the number of\nlayers in z direction, as shown in Fig. <ref>(a).  Every\nparticle interacts with its twelve nearest neighbors through an\nelastic potential with an effective spring constant k.  The spring\nnetwork is immersed in a viscous fluid, where drag forces act on\nmoving particles. In this coarse-grained approach, the particles\nrepresent macromolecules commonly found in suspended polymer chains,\ncolloidal aggregations, and other load-bearing structures of soft\nmatter.\n\n\nWe perform computational indentation assays to probe this network's\neffective viscoelastic properties.  Firstly, a rigid spherical\nindenter presses down the network at a constant rate. This\nloading stage is done during a time τ_l until a maximum\nindentation depth δ_max is achieved. After that, called\ndwell stage, the indenter stays still while the network\nrearranges towards a minimum energy configuration. Particles in the\nbottom layer are not allowed to move along the z-axis (where\ndeformation is applied) but are free to slide horizontally. To avoid\nfinite-size effects, we limit the maximum indentation to less than\n10% of the network height <cit.>, and thus we apply\nδ_max≈σ.\n\n\nThe equation of motion of the i_th particle, at position r⃗_i, is given by the following\nequation <cit.>\n\n    md^2 r⃗_i/dt^2 = - ∇ U_i - γ v^α_iv̂_i,\n\nwhere U_i is the interaction potential of particle i due to other\nparticles and the indenter, given by\n\n    U_i = k/2∑_j (r_ij-ℓ)^2 + ϵ[σ/r_is-(σ_s-σ)/2]^ξ.\n\nThe summation in the first part runs over the neighbors, where\nr_ij=|r⃗_i-r⃗_j| and ℓ are, respectively, the\ndistance and the equilibrium distance between the centers of particles\ni and j. The last term in Eq. (<ref>) represents a hard-core\npotential applied only to those particles in contact with the\nindenter, where ϵ is an energy parameter, and\nr_is=|r⃗_i-r⃗_s| is the distance between the center of\nthe particle and the indenter. The exponent ξ must be large enough\nto keep the stiffness of the indenter.\n\n\nThe last term of Eq. (<ref>) represents a generalized drag\nforce acting oppositely to the particle velocity, v⃗_i = v_iv̂_i, with magnitude given by γ v^α_i, where γ\nand α are related to the particle geometry and the fluid\nproperties in which the particles are immersed. Dissipation vanishes\nfor γ=0, leading to purely elastic networks where our model\nreproduces the well-known Hertz behavior for mechanical\ncontacts <cit.>. However, when local friction becomes\nrelevant, γ > 0, the model may produce distinguished behaviors\nof viscoelastic materials. Notice that α = 1 and α = 2\nrepresent typical values for drag forces acting on rigid\nstructures. The linear regime, known as Stoke's law, arises for small\nReynolds numbers when viscous forces dominate over inertial forces,\nwhere γ is proportional to the medium's viscosity and the\nparticle's diameter. On the other hand, the quadratic drag is dominant\nfor large Reynolds numbers. In this case, γ is proportional to\nthe medium's density and the cross-sectional area of the particle.\n\n\n\n \n\n\n\nThe physical origins of the sublinear regime (α<1), however,\nare entirely different and are related to the\ndeformability/adaptability of bodies subjected to drag\nforces <cit.>. Many living beings present sublinear drag\nbehaviors, where deformability is a survival strategy to protect their\nfragile structures under hydrodynamic conditions. Characterizing the\ndrag exponents in deformable systems is recurrent in botany,\naerodynamics, and hydrodynamics <cit.>. Typical drag exponents for algae are as\nsmall as 0.34 <cit.>. On the other hand, tulip and willow\noak trees are more rigid and present exponents close to unity,\nα=0.92 and α=0.94 <cit.>, respectively. The\nlimiting case of α=0 corresponds to constant frictional forces,\nregardless of the particle velocity. In our model, micro deformations\nare associated with a new molecular arrangement of the macromolecules.\n\n\nThe numerical solution of Eq. (<ref>) is performed through\nmolecular dynamics simulations <cit.> with\nperiodic boundary conditions applied to the horizontal plane, and time\nintegration is done with the velocity Verlet algorithm with time step\ndt. See <cit.> for the parameters used. The force is computed\nas the sum of all collisions on the indenter at each time step. Each\nset of k, γ, and α represents a specific material and\ndefines the macroscopic viscoelastic responses. To investigate how\nmicroscopic properties lead to the rheological behavior of the entire\nnetwork, we perform simulations varying the spring constant between\n100 and 1000, the drag constant between 10 and 100, and the drag\nexponent between 0.0 and 1.0, totalizing 2100 different networks.\n\n\nFigure <ref>(b) shows typical force curves for γ=80 and\nk=800 and different values of the drag exponent. F(t) is the\ncomputational analogous of an indentation assay used to characterize\nmacroscopic responses of actual materials. In the loading stage, the\nindenter slowly deforms the network until the contact force reaches\nits maximum value, which is inversely proportional to α. In the\ndwell stage, when the indenter stays still, F(t) relaxes until part\nof the mechanical energy is lost through friction.  The timescale of\nsuch dissipation depends on α in a highly complex fashion. For\nα = 2, dissipation is fast enough so that the response behavior\nis qualitatively identical to a perfectly elastic network. For\nα<1, drag forces slowly remove energy from the network leading\nto a viscoelastic decay.\n\n\nIn a continuum approach, the analytical time-dependent contact force\nof a viscoelastic sample indented by a spherical punch follows the\nconvolution integral <cit.>\n\n    ℱ(t) = ∫_0^t\n        R(t-t^')dδ^3/2(t^')/dt^' dt^',\n\nwhere R(t) is the relaxation function and δ(t) the\nindentation depth history. The contact force in\nEq. (<ref>) is normalized by the constant\n4√(σ_s)δ_max^3/2 / 3(1-ν^2), where ν\nis the Poisson coefficient. Typical relaxation behaviors for\nviscoelastic materials are given by\n\n    R_P(t)    =    E_∞ + Δ E    t^-β,\n    \n      R_E(t)    =    E_∞ + Δ E    e^-t/τ,\n\nwhere R_P(t) is the relaxation model for power-law materials with an\nexponent β and R_E(t) for exponential materials with\nrelaxation time τ. In both models, E_∞ is the elastic\nmodulus at considerable times when the material is completely relaxed,\nand Δ E is the difference between the maximum value, at\nt=τ_l, and E_∞. We assume that materials become\nperfectly elastic after some time, although this long-time elasticity\nplateau is only sometimes observed in actual\nmaterials <cit.>.  However, micro-deformations are allowed\nonly due to the movement of the pseudo-atoms, which is represented by\nthe sublinear drag regime. Solving Eq. (<ref>) with\nEqs. (<ref>) in the dwell stage leads, respectively, to\n\n    ℱ_P(t)    =    E_∞ + a   t^-β,\n    ℱ_E(t)    =    E_∞ + b   e^-(t-τ_l)/τ - c   e^-t/τ,\n\nwhere the constant a≈Δ E/Γ(1-β) is\nobtained by expanding the incomplete beta function, Γ(1-β)\nis the gamma function, and b=3τ/2τ_lΔ E and\nc=3√(π)/4(τ/τ_l)^3/2Δ E\n erfi(√(τ_l/τ)), where\nerfi(√(τ_l/τ)) is the imaginary error function of\nx.\n\n\nFitting the dwell part of the force curve allows us to map the\nmacroscopic mechanical properties (E_∞, Δ E, τ,\nβ) with the mesoscopic parameters (k, γ and α)\nas done previously for α=1 <cit.>. Here we focus on\nfinding the qualitative rheological behavior rather than describing\nrelations among parameters. Figures <ref>(c) and (d) show the\nsame force curves as in (b) for α=0.45 and α=0.85,\nrespectively, where the curves are fitted both with ℱ_P(t)\nand ℱ_E(t). Clearly, the α=0.45 case is better\nfitted with the power-law model, while α=0.85 with an\nexponential.\n\n\nThe mean-square error determines the goodness-of-fit parameter between\nthe obtained numerical force curve F(t) and the analytical force\nmodels given in Eqs. <ref> and <ref>,\n\n    χ_M = 1/N_p∑_i=1^N_p[F(t_i)-ℱ_M(t_i)]^2,\n\nwhere N_p is the number of points in the force curves and M stands\nfor exponential (E) or power-law (P) model type. This statistical\nindex, calculated for each combination of k, γ, α, is\nused in a K-means method as an unsupervised clustering\nstrategy <cit.> to classify the computational\nforce curves as either an exponential or a power-law behavior, or even\na transitional regime that cannot be clearly classified. In this\nmachine learning process, the classification of the material takes\ninto account not only the values of χ_E and χ_P but also\nthe trends and distributions in the phase space of χ_E and\nχ_P. Figure <ref>(a) shows the graph visualization of this\nclustering process. The exponential behavior is indeed the most common\none, as shown in the big cluster in Fig. <ref>(a), but small\ngroups of power-law materials are also observed.  The parallel\ncoordinates plot in Fig. <ref>(b) summarizes the rheological\noutcomes. Each line passes through every combination of k, γ,\nand α ending up in one of the three boxes representing the\nresponse behavior of the network.\n\n\nTo understand why small clusters of power-law materials form in\nFig. <ref>(a), we must investigate the impact of considering\nsublinear drag regimes. Fig. <ref> shows the normalized\nprobability P(α) of finding PL, EXP, or TR behavior for a given\nα. In panel (a), P(α) is computed for all values of k\nand γ considered here. The three distributions strongly\noverlap, making classification a challenging exercise.  In panel (b),\non the other hand, we remove small values of k and γ. For\nnetworks not too soft, k ≥ 800, and not too elastic, γ≥\n80, those distributions split for different regions of α, and\nthe drag exponent becomes the central controller to characterize the\nmacroscopic behavior. Exponential behaviors are found mainly for\nα⪅ 0.2 and α⪆ 0.55, while the\nrelaxation is a power law for α between 0.3 and 0.45.  For\nintersecting values of α, the superposition of the\nprobabilities of PL and EXP leaves doubt in classifying the material\neither as an exponential or a power law.\n\n\n\n\n\n\n\nFor those cases where the network presents a power-law behavior, we\nshow in Fig. <ref> the relationship between the macroscopic\nrelaxation exponent β and the drag exponent. For each value of\nα, there is a small dispersion distribution of β whose\nmean range is between 1.05 and 1.35. Actual materials exhibiting\npower-law relaxation usually present smaller exponents and exhibit\nstructural disorder and metastability <cit.>. Computational investigations of\ndisordered two-dimensional networks obtained relaxation exponents\nbetween 0.5 and 0.75, depending on the network\narrangement <cit.>.  Our simulations exhibit macroscopic\nrelaxation exponents above 1.0, mainly because our viscoelastic solid\nmodel is structurally ordered and stable, restricting the viscoelastic\nresponses to faster relaxation regimes. Our results clearly show that\nstructural disorder is not a mandatory ingredient for power-law-like\nviscoelasticity and can only change the exponent.\n\n\n\n \n\n\n\nIn conclusion, we show why viscoelastic materials present power-law or\nexponential relaxation responses. Using molecular dynamics\nsimulations, we perform numerical indentations onto a network of\ninteracting macromolecules immersed in a fluid and reproduce typical\nviscoelastic signatures as those found experimentally. The\nmacromolecules interact with the fluid through a non-linear drag\nregime given by γ v^α, where γ and α are\nmesoscopic parameters, and v is the particle's velocity.  For each\nset of the interacting parameters, we classify the macroscopic\nviscoelasticity using an unsupervised clustering algorithm according\nto the type of relaxation of the deformed network, namely, exponential\nor power-law relaxations or transitional behavior between them. While\nexponential behaviors are predominant, power laws may arise in the\nsublinear regime. In fact, the drag exponent alone may explain the\nmacroscopic viscoelastic relaxation for materials not too elastic nor\ntoo soft. More specifically, power-law responses are found for\n0.3⪅α⪅ 0.45, while exponential responses\nfor 0.0⪅α⪅ 0.2 and 0.55⪅α⪅ 1.0.\n\n\n\n\nThe authors acknowledge the financial support from the Brazilian\nagencies CNPq, CAPES, and FUNCAP.\n\n\n\n\n100\n\nLakes2017 R. S. Lakes, Viscoelastic Solids (CRC Press,\n  2017).\n\nMaxwell1867 J. C. Maxwell, On the dynamical theory of gases,\n  Phil. Trans. Royal Soc. London 157, 49 (1867).\n\nMarkovitz1977 H. Markovitz, Boltzmann and the beginning of\n  linear viscoelasticity, Trans. Soc. Rheology 21, 381 (1977).\n\nSousa2020 J. S. de Sousa, R. S. Freire, F. D. Sousa,\n  M. Radmacher, A. F. B. Silva, M. V. Ramos,\n  A. C. O. Monteiro-Moreira, F. P.Mesquita, M. E. A. Moraes,\n  R. C. Montenegro, and C. L. N. Oliveira, Double power-law\n  viscoelastic relaxation of livingcells encodes motility trends,\n  Sci. Rep. 10, 4749 (2020).\n\nSousa2021 F. B. de Sousa, P. K. V. Babu, M. Radmacher,\n  C. L. N. Oliveira, and J S de Sousa Multiple power-law viscoelastic\n  relaxation in time and frequency domains with atomic force\n  microscopy, J. Phys. D: Appl. Phys. 54, 335401 (2021).\n\nSousa2017 J. S. de Sousa, J. A. C. Santos, E. B. Barros,\n  L. M. R. Alencar, W. T. Cruz, M. V. Ramos, and J. Mendes Filho,\n  Analytical model of atomic-force-microscopy force curves in\n  viscoelastic materials exhibiting power law relaxation, App.\n  Phys. Rev. 1, 8 (2017).\n\nSong2017 R. Song, G. Jiang, and K. Wang, Gelation mechanism\n  and rheological properties of polyacrylamide crosslinking with\n  polyethyleneimine and its plugging performance in air-foam\n  displacement, App. Polymer Sci. 4 11 (2017).\n\n Calvet2004 D. Calvet, J. Y. Wong, and S.  Giasson,\n   Rheological Monitoring of Polyacrylamide Gelation: Importance of\n   Cross-Link Density and Temperature, Macromolecules 7769 7771\n   (2004).\n\nRehage1988 H. Rehage and H. Hoffmann, Rheological properties\n  of viscoelastic surfactant systems, The Journal of Physical\n  Chemistry 4713 4719 (1988).\n\nEfremov2017 Y. M. Efremov, W.-H. Wang, S.  D. Hardy,\n  R. L. Geahlen and A. Raman, Measuring nanoscale viscoelastic\n  parameters of cells directly from AFM force-displacement curves,\n  Nature 4 11 (2017).\n\nKetz1988 R. J. Ketz, Jr., R. K. Prud'homme and\n  W. W. Graessley, Rheology of concentrated microgel solutions,\n  Rheologica Acta 535 531 (1988).\n\nSollich1998 P. Sollich, Rheological constitutive equation\n  for a model of soft glassy materials, Phys. Rev. E 58 738\n  (1998).\n\nLarson1999 R. G. Larson, The Structure and Rheology of\n  Complex Fluids (Oxford University Press, 1999).\n\nMoreira2012 A. A. Moreira, C. L. N. Oliveira, A. Hansen,\n  N. A. M. Araújo, H. J. Herrmann, and J. S. Andrade, Fracturing\n  Highly Disordered Materials, Phys. Rev. Lett. 109, 255701\n  (2012).\n\nOliveira2014 C. L. N. Oliveira, J. H. T. Bates, and B. Suki,\n  A network model of correlated growth of tissue stiffening in\n  pulmonary fibrosis, New J. Phys. 16, 065022 (2014).\n\nAchar2012 B. N. Achar, and J. W. Hanneken, \"Microscopic\n  Formulation of Fractional Theory of Viscoelasticity\", in\n  Viscoelasticity - From Theory to Biological Applications. London,\n  United Kingdom: IntechOpen, 2012.\n\nYucht2013 M. G. Yucht, M. Sheinmanb and C. P. Broedersz,\n  Dynamical behavior of disordered spring networks, Soft Matter\n  9, 7000 (2013).\n   \nMilkus2017 R. Milkus, and A. Zaccone, Atomic-scale origin of\n  dynamic viscoelastic response and creep in disordered solids,\n  Phys. Rev. E 95, 023001 (2017).\n\nTsallis1988 C. Tsallis, Possible Generalization of\n  Boltzmann-Gibbs Statistics, J. Stat. Phys. 52, 479 (1998).\n\nTsallis2009 C. Tsallis, Nonadditive entropy and nonextensive\n  statistical mechanics - an overview after 20 years,\n  Braz. J. Phys. 39, (2a) (2009).\n\nMurilo2001 M. P. Almeida, Generalized entropies from first\n  principles, Phys. A 300, 424 (2001).\n\nStanley1971 H. E. Stanley, Introduction to Phase\n  Transitions and Critical Phenomena (Oxford, 1971).\n\nPraprotnik2007 M. Praprotnik, L. D. Site and K. Kremer,\n  Multiscale Simulation of Soft Matter: From Scale Bridging to\n  Adaptive Resolution, Rev. Phys. Chem. 547, 571 (2007).\n\nQu2011 Z. Qu, A. Garfinkel, J. N. Weiss, M. Nivala,\n  Multi-scale modeling in biology: How to bridge the gaps between\n  scales?, ELSEVIER 21, 31 (2011).\n\nDoi2013 M. Doi, Soft Matter Physics (Oxford, 2013).\n\nWest2003 B. J. West, M. Bologna, and P. Grigolini, Physics of Fractal Operators (Springer, 2003).\n \nJaishankar2012 A. Jaishankar and G. H. McKinley, Power-law\n  rheology in the bulk and at the interface: quasi-properties and\n  fractional constitutive equations, Proc. R. Soc. A 469, 20120284\n  (2012).\n\nFabry2001 B. Fabry, G. N. Maksym, J. P. Butler, M. Glogauer,\n  D. Navajas, and J. J. Fredberg, Scaling the microrheology of living\n  cells, Phys. Rev. Lett. 87, 148102 (2001).\n \nFabry2003 B. Fabry, G. N. Maksym, J. P. Butler, M. Glogauer,\n  D. Navajas, N. A. Taback, E. J. Millet, and J. J. Fredberg, Time\n  scale and other invariants of integrative mechanical behavior in\n  living cells, Phys. Rev. E 68, 041914 (2003).\n\nAraujo2020 J. L. B. de Araújo, J. S. de Sousa,\n  W. P. Ferreira, and C. L. N. Oliveira, Viscoelastic multiscaling in\n  immersed networks, Phys. Rev. Research 2, 033222 (2020).\n\nGarcia2018 P. D. Garcia and R. Garcia, Determination of the\n  Elastic Moduli of a Single Cell Cultured on a Rigid Support by Force\n  Microscopy, Biophys. J. 114, 2923 (2018).\n\nLangevin1908 P. Langevin, Sur la théorie du mouvement\n  brownien, C. R. Acad. Sci. (Paris) 146, 530 (1908).\n  \nLemons1997 D. S. Lemons and A. Gythiel, Paul Langevin's 1908\n  paper “On the Theory of Brownian Motion” [“Sur la théorie du\n    mouvement brownien,” C. R. Acad. Sci. (Paris) 146, 530 (1908)],\n  Am. J. Phys. 1081, 1081 (1997).\n\nVogel1994 S. Vogel, Life in moving fluids: the\n  philosophical biology of flow (Princeton University Press. 1994).\n\nGosselin2010 F. Gosselin, E. de Langre and\n  B. A. Machado-Almeida, Drag reduction of flexible plates by\n  reconfiguration, J. Fluid Mech. 650, 319 (2010).\n  \nVogel1989 S. Vogel, Drag and Reconfiguration of Broad Leaves\n  in High Winds, Journal of Experimental Botany 945, 948 (1989).\n\nJohn2015 J. A. Chapman, B. N. Wilson, and J. S. Gulliver,\n  Drag force parameters of rigid and flexible vegetal elements, Water\n  Resources Research 3293, 3292-3302 (2015).\n\nFavier2009 J. Favier, A. Dauptain, D. Basso and A. Bottaro,\n  Passive separation control using a self-adaptivehairy coating,\n  J. Fluid Mech. 627, 451 (2009).\n\nVogel1984 S. Vogel, Drag and Flexibility in Sessile\n  Organisms 1, Amer. Zoll. 40, 44 (1984).\n\nRapaport2004 D. C. Rapaport, The Art of Molecular\n  Dynamics Simulation - second edition (Cambridge University Press,\n  2004)\n  \nAraujo2017 J. L. B. de Araújo, F. F. Munarin,\n  G. A. Farias, F. M. Peeters, and W. P. Ferreira, Structure and\n  reentrant percolation in an inverse patchy colloidal system,\n  Phys. Rev. E 95, 062606 (2017).\n  \nParam The dimensionless length, mass, and energy units are\n  given, respectively, by σ=1, m=1, ϵ=1, and the\n  timestep dt=0.001t_0, where the time unit has the following\n  relation t_0=√(mσ^2/ϵ).  Other length\n  parameters are given by σ_s=10σ, ℓ=σ, and\n  H=15σ, and some exponents by ν=0.5 and ξ=400. The\n  number of particles in the network is N=2748.\n  \nFootnote This assumption is necessary to avoid high-pressure\n  effects in our numerical model. For instance, if the external force\n  is large enough to ultimately compress the small particles until a\n  condensate network is formed, any additional pressure would induce\n  the deformation of those particles.\n  \nGeron2019 A. Geron, Hands-On Machine Learning with\n  Scikit-Learn, Keras, and TensorFlow, Published by O'Reilly Media,\n  Inc., 1005 Gravenstein Highway North, Sebastopol, CA 95472., 1150\n  (2019).\n  \nSinaga2020 K. P. Sinaga and M. Yang, Unsupervised K-Means\n  Clustering Algorithm, IEEE Access 8, 80716 (2020).\n  \nSollich1997 P. Sollich, F. Lequeux, P. Hébraud,\n  M. E. Cates, Rheology of Soft Glassy Materials,\n  Phys. Rev. Lett. 78, 2020 (1997).\n \n\n\n\n\n  \n\n\n\n\n   \n\n\n"}