{"entry_id": "http://arxiv.org/abs/2303.07136v1", "published": "20230313140507", "title": "Comparison of confidence regions for quantum state tomography", "authors": ["Jessica O. de Almeida", "Matthias Kleinmann", "Gael Sentís"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\nICFO - Institut de Ciències Fotòniques, The Barcelona Institute of Science and Technology, 08860 Castelldefels (Barcelona), Spain.\n\nNaturwissenschaftlich-Technische Fakultät, Universität Siegen, Walter-Flex-Straße 3, 57068 Siegen, Germany\n\nFísica Teórica: Informació i Fenòmens Quántics, Departament de Fisica, Universitat Autònoma de Barcelona, E-08193, Bellaterra (Barcelona), Spain\n\n\nThe quantum state associated to an unknown experimental preparation procedure can be determined by performing quantum state tomography. If the statistical uncertainty in the data dominates over other experimental errors, then a tomographic reconstruction procedure must produce a statistical confidence region in state space rather than a single state. Naturally, the size of this region decreases when increasing the number of samples, but it also depends critically on the construction method of the region. We compare recent methods for constructing confidence regions as well as a reference method based on a Gaussian approximation. For the comparison, we propose an operational measure with the finding, that there is a significant difference between methods, but which method is preferable can depend on the details of the state preparation scenario.\n\n\nComparison of confidence regions for quantum state tomography\n    Gael Sentís\n    March 30, 2023\n=============================================================\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nQuantum state tomography is a complete and agnostic procedure to characterize an unknown quantum state from experimental data <cit.>. As such, it plays a central role as a quality control subroutine in quantum experiments or quantum technological applications, allowing us to assess the outcome of a state-preparation procedure and verify that a targeted quantum state is indeed being produced.\n\nThe outcome of a tomographic procedure is usually a point estimate ρ̂ of the true density matrix ρ, along with some sort of error bar. A common approach is to use maximum likelihood estimation <cit.> to construct ρ̂, and report the variance of the point estimate obtained by bootstrapping <cit.>. However, this approach accounts only for the statistical fluctuations of the maximum likelihood point estimate, which can turn out to be smaller than its actual bias <cit.>. More importantly, such error bars tell us nothing about how far off is ρ̂ from the true state ρ. To answer this question rigorously in statistical terms, confidence regions (CRs) are constructed: these are regions in the space of Hermitian operators that intersect the state space and contain the true state with high probability. Generally speaking, we can regard a confidence region C as a function from the experimental data to the space of Hermitian operators fulfilling\n\n\n    [ ρ∈ C(data)|data∼ρ ] ≥ 1-δ\n\n\nfor every state ρ, where 1-δ is the confidence level.\n\nThere exist diverse methods to construct CRs from tomographic data in the literature <cit.>. Methods may differ on the theoretical grounds they are built on, in turn leading to differences in their tightness, speed of convergence, and computational cost. However, these features are not always conveyed in a way that allows for a direct comparison between different methods, particularly in the practically relevant regime of finite data. As a result, the natural question of which CR should one choose to report the results of a tomographic experiment has, to this day, no straightforward answer. The main objective of this work is to close this gap by developing an operational benchmark under which methods to build CRs can be fairly contrasted.\n\nGenerically, for the same dataset and confidence level, the smaller a CR is, the better. To illustrate why this simple criterion is problematic to evaluate in practice, let us have a first look at two recent results in Refs. <cit.>, which we will further analyze in this work. A usual way of expressing Eq. (<ref>) (see, for example, Refs. <cit.>) is\n\n\n    [ ⋆ρ̂-ρ≤ϵ ] ≥ f(ϵ,d,N),\n\n\nwhere d is the dimension of the quantum system, N is the number of tomographic experiments, and the form of f varies with the norm ⋆ (usual examples are trace, Hilbert-Schmidt, or operator norm) and with the estimator used for ρ̂. In terms of speed of convergence with the number of samples taken, Guţă et al. <cit.> report an almost optimal scaling of f with respect to N, d, but fixed ϵ (showing an improvement over Ref. <cit.> for the same norms). In contrast, Wang et al. <cit.> provide an explicit construction of the function C as a polytope, and the convergence of the region with N is implicit, preventing a direct comparison to Eq. (<ref>) based only on the region size. For finite N, neither of these works consider the tightness of the CRs quantitatively. Then the question arises, how can we judge whether one of these CRs is smaller than the other in a given experiment? First, the regions have incomparable shapes (a sphere in a norm and a polytope), hence a parametric comparison is not possible. One could look at volumes to disregard shape, but the relevant volume to consider would be that of the intersection of the CRs with the state space, hence we would require numerical estimates (for example, by Monte Carlo sampling) that are not scalable beyond relatively small systems and will be in any case dependent on the chosen integration measure. Finally, we would encounter the same problems when comparing CRs of the form in Eq. (<ref>) if these are expressed in different norms. In this case, we could use inequalities between norms to transform one into another, but we would always be underestimating or overestimating one of the regions.\n\nIn this work we propose to assess the power of a CR by how well can it distinguish a pair of states. More precisely, we simulate a tomography experiment on two given target states, and find, for a given confidence level, the minimum number of repetitions necessary for their corresponding CRs (built with the same method) to stop intersecting, which ensures that the two states can be distinguished with the chosen confidence. While, clearly, this is not the most efficient test to discriminate the two states, as a test it has several desirable features: It has an operational meaning, it is agnostic to the specifics of a CR, and it is computationally efficient. We use this test to carry out a comparative analysis of recent CRs in paradigmatic scenarios involving pairs of states of up to 4 qubits, and we focus on performing local Pauli-basis measurements as our tomographically complete set of measurements for its practical relevance and widespread use. Our results show that there is no single CR that outperforms the others in all cases. The performance of the CRs varies not only with the dimension of the system, but also with the pair of states selected for the distinguishability test. An example of this is the finding that while a CR may allow to distinguish a pure state from the completely mixed state with the fewest number of samples, it underperforms when distinguishing two pure states that are very close to each other. This notwithstanding, our analysis allows us to make some general recommendations.\n\nWe apply our comparative analysis to the recent results in Ref. <cit.> and Ref. <cit.>. In addition, we provide a method to build CRs  based on a Gaussian approximation, which will serve us as a reference. While there are other works on CRs in the literature, the rationale behind focusing on these ones is the following.\nFirst, we concentrate on unconditional tomography, leaving aside Bayesian methods that require assuming a prior distribution over the possible states (and result in credibility regions instead of CRs) <cit.>, methods that assume rank-deficient states like compressed sensing <cit.>, permutationally invariant states <cit.>, or matrix product states <cit.>, and heuristic methods like self-guided tomography <cit.> or CRs based on likelihood ratios <cit.>. Second, we select those works which have not yet been clearly superseded (for example, Ref. <cit.> improves on Ref. <cit.>, and Ref. <cit.> on Ref. <cit.>). Finally, it is worth mentioning with Ref. <cit.> another recent comparative study on quantum state tomography, which evaluates a different aspect in tomography schemes, namely the typical error (distance between the estimate and the true state) of various point estimators.\n\nThe paper is structured as follows. In Section <ref> we summarize the CRs considered in our study. Section <ref> details the methodology used for comparing between CRs in a series of simulated tomography experiments, and includes the results of our testing. We end the paper with a short discussion in Section <ref>. In the Appendix, we include details on the derivation of the Gaussian CRs as well as technical considerations about the simulations.\n\n\n\n§ METHODS FOR BUILDING CONFIDENCE REGIONS\n\n\nHere we summarize the results that we use for our comparative analysis. A common feature of all selected methods is that the CRs are built for the free least-squares estimator for ρ̂, see Appendix <ref>. Importantly, this estimator is unbiased, although due to finite statistics in experiments it generally produces a non-physical density matrix. This is not necessarily problematic, in the sense that the associated CR will almost certainly have some overlap with the state space. CRs for physical (hence biased) estimators exist, for example, for projected least-squares <cit.> or other variants <cit.>, but they are derived from a CR for the free least squares estimator and thus do not improve over them. Hence, to treat all methods on equal footing, in this paper we restrict ourselves to free least squares. For easy referencing, we label the CRs used in our analysis as A, B, C_1, and C_2.\n\n\n\nThe first result we review is a non-asymptotic concentration bound for the operator-norm error of the free least-squares estimator. In Ref. <cit.>, Guţǎ et al. show that the free least-squares estimator obeys\n\n\nConfidence region A\n\n    [ ∞ρ̂-ρ≥ϵ ]\n    ≤ R_d(ϵ√(N))\n\n\n\nwhere ∞X is the operator norm of X, N is the total number of state preparations, and d is the dimension of the underlying Hilbert space. Hence, the CR is of the form in Eq. (<ref>). One has\n\n\n    log R_d(ξ)=-38ξ^2 g(d)+log d,\n\n\nwhere the factor g(d) takes different forms depending on the chosen measurement scheme. For multiqubit states and local Pauli-basis measurements, we have g(d)= 3^-log_2 d.\n\n\n\nAnother method by Wang et al. <cit.> constructs a polytope-shaped region Γ(f⃗) as a function of the empirical frequencies f⃗=(f_1,…,f_M) of a single positive operator-valued measure (POVM), that is, positive semidefinite operators {E_i}_i=1^M obeying ∑_i E_i =, applied on the state ρ, where f_i=n_i/N, n_i is the number of occurrences of outcome i, and N the total number of state preparations. The region Γ(f⃗) obeys\n\n\nConfidence region B\n\n    [ ρ∉Γ(f⃗) ]≤δ.\n\n\n\nEach facet of the polytope is determined by the half-space\n\n\n    Γ_i(f_i)=ρ | (E_i ρ)≤ f_i+ϵ_i ,\n\n\nwhere ϵ_i is the positive root of\nD(f_i‖ f_i+ϵ_i)=-log(δ_i)/N,\nwith ∑_i=1^M δ_i = δ, and D(x‖ y) = x log (x/y) + (1-x)log[(1-x)/(1-y)] is the relative binary entropy. Then, the CR is given by the intersection of all half-spaces, that is, Γ(f⃗)=⋂_i Γ(f_i). Because each half-space corresponds to an independent confidence interval for the frequency f_i, we are free to choose each individual confidence level by fixing δ_i as long as they add up to the total confidence parameter δ. This method thus allows us to shrink the CR along a preferred measurement direction at the expense of enlarging it in other ones, which adds versatility. For our comparative analysis, we make the uniform choice δ_i=δ/M.\n\n\n\nWe also provide bounds based on a Gaussian approximation. Here we make the approximation that the empirical frequencies f⃗ of the measurement outcomes are Gaussian distributed with mean p⃗(ρ) and a nonsingular covariance matrix Σ(ρ). Then we obtain the Gaussian CR defined by\n\n\nConfidence region C_1\n\n    [ 2Σ(ρ)^-1/2(f⃗-p⃗(ρ)) > ϵ ]=P_k(ϵ^2),\n\n\n\nwhere P_k(x) is the survival function of the central χ^2-distribution with k=(Σ) degrees of freedom, see Appendix <ref> for details. Note that Σ(ρ) here scales with the number of samples. This CR is exact, but comes with the disadvantage that the region depends nonlinearly on ρ through Σ. We can improve on this at the cost of getting a more relaxed bound, see Appendix <ref>,\n\n\nConfidence region C_2\n\n    [ 2p⃗(ρ̂)-p⃗(ρ)\n             >ϵ ]≤ P_d^2-1(σ^-2_maxϵ^2),\n\n\n\nwith σ^2_max the largest eigenvalue of Σ(ρ) across all states.  Note that the resulting CR forms an ellipsoid in the state space. For multinomial distributions, we have σ^2_max=1/(2n), where n is the number of samples per measurement setting. For example, for local Pauli-basis measurements on a q-qubit state, we have 3^q distinct measurement settings, N=3^q n (see Appendix <ref>).\n\n\n\n§ METHODOLOGY FOR COMPARING CRS AND RESULTS\n\n\nWe propose two universal tests to benchmark CRs irrespective of their specifications. The first test consists in computing the (1-δ)-quantile of the distribution of the ratio\n\n\n    r=⋆…/ϵ(δ)\n\n\nover several repetitions of the same tomography experiment with confidence level (1-δ). The terms in r depend on the chosen CR, as they appear in [ ⋆… > ϵ(δ) ] ≤δ and note that the norm can be defined either in probability space or in the state space. This test quantifies the tightness of a CR in a scale-independent way. On the one hand, a value 100% for the (1-δ)-quantile of r indicates that the region is exact, inasmuch as the probability of obtaining ρ̂ at a distance no more than ϵ from ρ coincides with the confidence level, that is, the inequality in Eq. (<ref>) is saturated. On the other hand, a small value of r tells us that the CR is unnecessarily large, since in (1-δ)× 100% of the experiments ρ̂ is actually much closer to ρ than the size of the region ϵ.\n\n\n\nWe run simulations of tomography experiments on Haar-random pure states of up to 4 qubits. We simulate using N=60 000 samples and local Pauli-basis measurements, see Appendix <ref>, and evaluate r for a confidence level of 1-δ=99%. For Confidence Region A, Confidence Region C_1 and Confidence Region C_2, and for each state considered, we determine the empirical (1-δ)-quantile from 10 000 samples of the ratio r; the results are summarized in Table <ref>. Note that, since \nConfidence Region B is not norm-based, we do not run this test on it.\nWe observe that Confidence Region C_1 is an exact region, which supports the validity of the Gaussian sampling assumption in our numerical experiments. For Confidence Region A and C_2 we see that C_2 is tighter for the 1-qubit, 2-qubit and 3-qubit cases and then becomes looser for states of 4 qubits, whereas the tightness of Confidence Region A is more stable with an increasing number of qubits. As we see next, these results correlate well with those of our second test, even though they quantify different features of the CRs.\n\n\n\nThe second test we devise is aimed at quantifying the distinguishability power of CRs. Choosing two distinct target states over which we perform tomography, we ask the question of how many samples N are required so that their respective CRs do not contain a common state. At this point we can distinguish the two states with confidence 1-δ based on the CRs, see Figure <ref>. In this way we can attach a number to a CR and a given pair of states which is indirectly related to the size of the region. This test thus allows us to rank CRs according to an operationally well defined task and independently of their specifications.\n\nWe run this test with Confidence Region A, B, and C_2 for two types of pairs of states of up to 4 qubits: pairs comprised by a pure state and the completely mixed state, and pairs of two pure states relatively close to each other, with fidelity ⟨ϕ_1|ϕ_2|⟩^2= 0.63. The specific states are detailed in Appendix <ref>, and we fix the confidence level to 1-δ=90%.\nImportantly, the value of N at which the CRs stop intersecting is a stochastic variable, \nsince it directly depends on the estimate ρ̂ where the regions are centered and thus on the data obtained in each tomography experiment. For increasing values of N, we look at the frequency of finding an intersection over many repetitions (3000 for q=1,2; 1000 for q=3 and 500 for q=4). We also note that testing whether two regions share a common state can be computed efficiently via a convex optimization program, see Appendix <ref>. This is the case with the exception of Confidence Region C_1 since this region depends nonlinearly on the true state through Σ(ρ)^-1/2, and for this reason we do not include it in this test.\n\nIn Figure <ref> we show the frequency that the CRs of the two target states contain a common state, for each of the three CRs considered. Each plot corresponds to a different pair of target states of one and two qubits. For the case of one-qubit states, Confidence Region C_2 performs best in this test, closely followed by Confidence Region B, regardless of whether we try to distinguish a pure state versus the completely mixed state or two pure states close to each other, whereas Confidence Region A requires roughly a factor of two more state preparations. For two-qubit states we observe an interesting phenomenon: Confidence Region A distinguishes a Bell state from the identity with the least number of state preparations and Confidence Region C_2 has almost the same performance, but it becomes notably more inefficient when distinguishing between a Bell state and the same state with a slight local rotation applied (with fidelity 0.63), for which case Confidence Region C_2 is again the best one. An important remark is that the states selected for the test are not aligned with any measurement direction, in order to represent a generic case of state tomography. Particularly for one-qubit states, if the state would point in the x,y or z direction, we find that Confidence Region B slightly outperforms Confidence Region C_2. This is due to the facets of the polytope Γ(f⃗) being perpendicular to the measurement directions by design.\n\nWe show the results of the intersection test for pairs of 3-qubit and 4-qubit states in Figure <ref>. Here we observe a clear advantage of Confidence Region A in all cases. This is consistent with the results of Ref. <cit.>. Indeed, the derivation of Confidence Region A is based on the observation that ρ̂ can be seen as a sum of N random matrices and the subsequent application of a matrix concentration inequality, which becomes sharper as N increases (which is necessary for a larger number of qubits). Also, the ranking between the analyzed CRs is maintained throughout the studied 3-qubit and 4-qubit cases, with Confidence Region C_2 in a second position and Confidence Region B requiring the largest number of state preparations.\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\nWe have proposed and tested two methods to benchmark confidence regions for quantum state tomography. One of them, based on the distinguishability power of a given confidence region construction, is operationally defined and applicable to any such construction regardless of its shape, specifications, and whether the region is defined in probability space or in state space. In addition, we proposed a second method which determines how tight a given region is. These new metrics allow us to compare existing (and future) methods to build confidence regions that were until now not directly comparable. Thus, we provide a robust tool to help in deciding which confidence region to report in any state tomography experiment.\n\nOur numerical experiments show that this choice should depend on the dimension of the system at hand and the goal for which tomography is used. We see this variability as a reflection of the diverse techniques used to derive confidence regions. For general purposes, the method by Guţǎ et al. <cit.> appears to be a safe choice, particularly for large systems, while in special cases involving 1-qubit and 2-qubit states, one may consider using the method of Wang et al. <cit.> or a Gaussian approximation as in Confidence Region C_2. In addition, Confidence Region C_2 has also been found to be useful in deriving optimal tests for detecting properties of the measured state directly from the tomographic data, without going through the intermediate step of computing a point estimate of the density matrix. An example of this is a proposal for the experimental detection of bound entanglement <cit.>.\n\nWith this work, we argue that unconditional full quantum state tomography is almost settled as a research topic. A point estimate of the unknown state obtained by linear inversion equipped with a confidence region is computationally inexpensive and should suffice for any purpose where tomography is needed. As for which confidence region is best to use, as we have seen, it depends. There may still be room for improvement in light of our (1-δ)-quantile tests, since, for example, for the method of Guţǎ et al. we observe it is only around 40%. This means there could be an even tighter construction, although this seemingly suboptimal slackness does not have a great effect on our intersection tests.\n\n\nWe thank Richard Kueng, Maciej Lewenstein, and Michael Skotiniotis for the helpful discussions.\nThis work was supported by\nERC (Advanced Grant NOQIA and Consolidator Grant 683107/TempoQ);\nMinisterio de Ciencia y Innovation Agencia Estatal de Investigaciones (PGC2018-097027-B-I00/10.13039/501100011033, CEX2019-000910-S/10.13039/ 501100011033, Plan National FIDEUA PID2019-106901GB-I00, FPI, QUANTERA MAQS PCI2019-111828-2, QUANTERA DYNAMITE PCI2022-132919, Proyectos de I+D+I “Retos Colaboración” QUSPIN RTC2019-007196-7,\nPID2019-107609GB-I00); \nMICIIN with funding from European Union NextGenerationEU(PRTR-C17.I1) and by Generalitat de Catalunya;\nFundació Cellex;\nFundació Mir-Puig;\nGeneralitat de Catalunya (European Social Fund FEDER and CERCA program, AGAUR Grant No. 2021 SGR 01452, QuantumCAT U16-011424, \nQuantumCAT 001-P-001644 \nco-funded by ERDF Operational Program of Catalonia 2014-2020);\nBarcelona Supercomputing Center MareNostrum (FI-2022-1-0042);\nEU Horizon 2020 FET-OPEN OPTOlogic (Grant No 899794);\nEU Horizon Europe Program (Grant Agreement 101080086 – NeQST), National Science Centre, Poland (Symfonia Grant No. 2016/20/W/ST4/00314); ICFO Internal “QuantumGaudi” project;\nEuropean Union's Horizon 2020 research and innovation program under the Marie-Skłodowska-Curie grant agreement No 101029393 (STREDCH) and No 847648 (“La Caixa” Junior Leaders fellowships ID100010434: LCF/BQ/PI19/11690013, LCF/BQ/PI20/11760031, LCF/BQ/PR20/11770012, LCF/BQ/PR21/11840013);\nDeutsche Forschungsgemeinschaft (DFG, German Research Foundation, project numbers 447948357 and 440958198);\nSino-German Center for Research Promotion (Project M-0294);\nGerman Ministry of Education and Research (Project QuKuK, BMBF Grant No. 16KIS1618K).\nViews and opinions expressed in this work are, however, those of the author(s) only and do not necessarily reflect those of the European Union, European Climate, Infrastructure and Environment Executive Agency (CINEA), nor any other granting authority. Neither the European Union nor any granting authority can be held responsible for them.\n\n\n\n\n\n\n\n\n§ CONFIDENCE REGION FOR NORMAL-DISTRIBUTED TOMOGRAPHIC DATA\n\n\nHere we provide the proofs for Confidence Region C_1 and Confidence Region C_2. For that, we write f⃗ for the collection of the empirical frequencies and assume that f⃗ is normal distributed with mean p⃗(ρ) and covariance matrix Σ(ρ), where ρ is the state on which the tomography is performed. Statistically dependent entries are eliminated from p⃗ and f⃗—for example for a multinomial distribution, ∑_i p_i=1 and hence we remove one entry from p⃗. Then Σ(ρ) is nondegenerate, except for a subset of states which has measure zero, and hence is irrelevant.\n\nWe observe that\n\n\n    Δ⃗_ρ = Σ(ρ)^-1/2 [ p⃗(ρ)-f⃗ ]\n\n\nis normal distributed with mean 0⃗ and covariance matrix . Consequently 2Δ⃗_ρ^2 is distributed according to the central χ^2(k)-distribution with k=(Σ) degrees of freedom and survival function [ 2Δ⃗_ρ^2 > y ]=P_k(y). This already yields Confidence Region C_1 via\n\n\n    [ 2Δ⃗_ρ > ϵ ] =  P_k(ϵ^2).\n\n\nWe mention that for a multinomial distribution and n samples one has\n\n    (Δ⃗_ρ)^2= n ∑_i [ p_i(ρ)-f_i ]^2/p_i(ρ),\n\nwhere the sum includes the element that had been omitted from p⃗ and f⃗ in order to make Σ(ρ) nondegenerate.\n\nFor Confidence Region C_2 we consider M(ρ-ρ')=p⃗(ρ)-p⃗(ρ') as linear map M on the space of zero-trace Hermitian matrices, which we consider as a real vector space of dimension d^2-1. We write M^+ for the pseudo-inverse of M and P is a map onto ℝ^d^2-1 with P=PMM^+ and M=P^TPM. Note that P can can be constructed by orthogonalizing the row vectors of M. We use now the free least-squares estimate\n\n\n    ρ̂=_X2p⃗(X)-f⃗^2 | X=X^† and (X)=1\n\n\nwhere the result is not required to be positive semidefinite. We have ρ̂=M^+f⃗ and ρ=M^+p⃗(ρ). It follows that PM(ρ̂-ρ)=PMM^+[f⃗-p⃗(ρ)]=P[f⃗-p⃗(ρ)] has mean 0⃗ and covariance Σ'(ρ)=PΣ(ρ)P^T. Note that Σ'(ρ) is nonsingular (even if Σ(ρ) is degenerate) because M is injective and has dimensions (d^2-1)×(d^2-1). Therefore we have\n\n\n    [ 2Σ'(ρ)^-1/2P(p⃗(ρ̂)-p⃗(ρ)) >ϵ ] = P_d^2-1(ϵ^2)\n\n\nThe main advantage of both confidence regions derived so far is that they do not contain any approximations up to the assumption of a normal distribution. Hence they are optimal in this respect. However, they do not have a simple shape because they depend in a nonlinear way on ρ via Σ(ρ). For this reason we replace Σ(ρ) by σ_max^2 with σ^2_max the largest eigenvalue of the covariance matrix over all states ρ. Using P^TP[p⃗(ρ̂)-p⃗(ρ)]= p⃗(ρ̂)-p⃗(ρ), this gives us Confidence Region C_2 via\n\n\n    [ 2p⃗(ρ̂)-p⃗(ρ)\n             >ϵ ]≤ P_d^2-1(σ^-2_maxϵ^2).\n\n\nWe mention that the spectral decomposition of ϵ  (M^TM)^-1/2 yields the semiaxes of the confidence ellipsoid in the state space.\n\nWe can relax Confidence Region C_2 even further. For that we let μ be the smallest (nonzero) singular value of M. Since M is injective, it follows that 2M(ρ-ρ̂)≥μ2ρ̂-ρ. This gives us an additional CR defined by\n\n\n    [ 2ρ-ρ̂> ϵ ]\n      ≤ P_d^2-1(μ^2 σ_max^-2ϵ^2).\n\n\nAlthough this bound has a very similar structure to Confidence Region A, it cannot be expected to yield a good CR. This can be understood geometrically, because we approximated the previous CR, which gave us an ellipsoid, by simply fitting a sphere around it with the radius of the largest half-axis.\n\n\n\n§ LOCAL PAULI-BASIS MEASUREMENTS FOR QUANTUM STATE TOMOGRAPHY\n\n\nIn this appendix we provide specifications for computing the CRs analyzed in the main text when choosing local Pauli-basis measurements as a tomographically complete set of measurements.\n\nGenerically, a measurement on a d-dimensional quantum state ρ can be described by a POVM, that is, as \nM positive semi-definite matrices E_1,…,E_M, each with dimension d× d, such that ∑_i E_i=. Each measurement of ρ results in a corresponding outcome and the probability of observing outcome i=1,…,M is given by p_i=( E_i ρ ). This probability can be estimated based on the outcome frequency when measuring many copies of ρ. The frequency corresponding to outcome i after n repetitions of the measurement E_1,…,E_M is\n\n    f_i= n_i/n    for  i=1,…,M  ,\n\nand we have f_i→ p_i in the limit n→∞.\n\n\n\n §.§ Local Pauli-basis measurements\n\n\nWe now particularize this generic POVM for state tomography with local Pauli-basis measurements. For one qubit, measuring in the three Pauli bases can be viewed as a single six-outcome POVM, whose elements correspond to the eigenstates of each Pauli matrix σ_j, j=x,y,z. Each POVM element has two labels, the direction j and the two possible outcomes along that direction, +1 and -1. Therefore, we  write E_j,±=(±σ_j)/2=w_j,±. When each measurement σ_j is performed n times, the frequency vector corresponding to the six-outcome POVM has components f_j,±=n_j,±/(3n).\n\nGeneralizing the tomography scheme for q qubits, the dimension of the system is d=2^q, and there are 3^q Pauli measurement settings m⃗=(m_1,…,m_q)∈x,y,z^q, each with d possible outcomes o⃗ = (o_1,…,o_q), where o_j∈± 1. This tomography scheme can also be written as a single POVM, whose elements are now specified by the measurement setting m⃗ and the outcome o⃗, as\n\n\n    E_m⃗,o⃗ = 3^-q⊗_j=1^q w_m_j,o_j.\n\n\nIf each measurement setting m⃗ is performed n times, we obtain for the single POVM the frequencies f_m⃗,o⃗ = n_m⃗,o⃗/(3^q   n) where the total number of samples is N=3^q n.\n\nAt this point we note that, formally, there is no difference between measuring each combination of Pauli matrices m⃗ separately as 2^q-outcome projective measurement and considering the single POVM E_m⃗,o⃗ with 6^q outcomes. However, in the finite data regime there is a potential difference when it comes to the covariance matrix of the data. Indeed, when considering a single POVM there is only one frequency that is dependent of the others, by the normalization ∑_m⃗,o⃗ f_m⃗,o⃗=1. If, instead, we consider applying the Pauli measurements specified by each m⃗ independently and aggregating the data at a later stage, we have now 3^q dependent frequencies, since now ∑_o⃗ f_m⃗,o⃗ = 1. This is relevant when computing the covariance matrix Σ(ρ) that appears in Confidence Region C_1: if we do not eliminate frequencies corresponding to the trivial outcomes from f⃗, Σ(ρ) will not have a well defined inverse. Moreover, as we saw in Appendix <ref>, discarding these outcomes results in a tighter CR. When detailing how to compute Confidence Region A and Confidence Region B for local Pauli-basis measurements, we use the single-POVM formulation to follow the original references <cit.> and <cit.> closer. We switch to the individual measurement settings m⃗ when discussing our bound Confidence Region C_2 (<ref>).\n\n\n\n §.§ Adaptations for the Confidence Regions\n\n\n\n\n\n  \nGeneralized Bloch representation.\nIt is convenient for our computations to write the density matrix in the generalized Bloch representation. For the tuple of 4^q matrices μ⃗=2^-q/2(,σ_x,σ_y,σ_z)^⊗ q, any Hermitian matrix can be written as X = x⃗·μ⃗ with x⃗∈ℝ^4^q . Due to the choice of the normalization, we have (XY)=x⃗·y⃗ for X=x⃗·μ⃗ and Y=y⃗·μ⃗.\n\n\n\n  \nFree last-squares estimator.\nThe free least-squares estimator in state tomography is the solution to the least-squares problem that seeks to minimize the distance between the frequencies and the probabilities, see also Eq. (<ref>),\n\n\n    ρ̂=_X∑_i ( f_i- ( E_i X ))^2 | X=X^† and (X)=1 .\n\n\nNote that the optimization is performed over all Hermitian matrices with unit trace and hence the resulting estimate ρ̂, in general, will fail to be positive semidefinite. For local Pauli-basis measurements, where f⃗ has 6^q entries, this problem has an analytical solution <cit.>. In our definitions, the frequencies have the form f_m⃗,o⃗= n_m⃗, o⃗/(3^q n), and the free least-squares estimate is given by\n\n\n    ρ̂=∑_m⃗,o⃗f_m⃗,o⃗⊗_j=1^q (3w_m_j,o_j -).\n\n\nWe use this explicit solution when evaluating Confidence Region A.\n\n\n\n  \nConfidence Region C_1 and C_2.\nAs indicated in Appendix <ref>, when considering Confidence Region C_1 and Confidence Region C_2, we assume that each measurement setting m⃗ is measured independently n times, yielding frequencies f_m⃗,o⃗=n_m⃗,o⃗/n with ∑_o⃗ f_m⃗,o⃗ = 1. Therefore, there is one statistically dependent frequency per measurement setting m⃗, which we can compute from the remaining frequencies of the same setting. We thus omit the 3^q dependent frequencies to avoid having a singular covariance matrix, which reduces the dimension of the data f⃗ to 3^q(2^q-1) components.\n\n\n\n§ INTERSECTION OF CONFIDENCE REGIONS VIA CONVEX OPTIMIZATION\n\n\nGiven two regions of the types A, B, or C_2, we can determine whether they have a non-empty intersection via convex optimization, see, for example, Ref. <cit.>. In our numerical experiments we use the Splitting Conic Solver SCS <cit.> for convex-cone optimization with the Python programming language.\n\n\n\n  \nIntersection for Confidence Region A.\nWe have two CRs, R_1 and R_2, for two tomography experiments on the states ρ_1 and ρ_2, and corresponding free least-squares estimates ρ̂_1 and ρ̂_2. Confidence Region A for confidence level 1-δ is given by all states ρ obeying\n\n\n    ∞ρ-ρ̂_i≤ϵ(δ),\n\n\nwith ϵ(δ)=N^-1/2R_2^q^-1(δ)=√(3^q log(2^q/δ) 8/(3N)) and N the total number of samples. We can run the following semidefinite program to test for the existence of a state ρ∈ R_1 ∩ R_2:\n\n\n    find       ρ\n    such that       ρ≥ 0,  (ρ)=1,\n       -ϵ(δ) ≤ρ-ρ̂_i ≤ϵ(δ)     for  i=1,2.\n\n\nIf the above program does not find a feasible solution, we conclude that the intersection R_1∩ R_2 is either empty or does not contain physical states.\n\n\n\n  \nIntersection for Confidence Region C_2.\nFor Confidence Region C_2 we proceed analogously, where here the region with confidence level 1-δ is given by all states ρ satisfying\n\n\n    2p⃗(ρ)-p⃗(ρ̂)^2 ≤ϵ^2(δ),\n\n\nwith ϵ(δ)^2 = P_d^2-1^-1(1-δ)/(2n) and n the number of samples per measurement setting, hence N=3^qn. A state ρ in the intersection can be found by the quadratic convex program\n\n\n    find       ρ\n    such that       ρ≥ 0,  (ρ)=1,\n       ∑_j=1^3^q(2^q-1)((E_jρ)-(E_jρ̂_i))^2≤ϵ_i^2(δ)\n         for  i=1,2.\n\n\n\n  \nIntersection of Confidence Region B.\nFor regions of type B, we need to find a state in the intersection Γ^(1)∩Γ^(2) of the two confidence polytopes.\nThe facets of either polytope Γ^(i), i=1,2, are given by the linear inequalities\n\n\n    (E_jρ)≤ f_j^(i)+ϵ^(i)_j(δ),\n         for  j=1,… 6^q,\n\n\nwhere ϵ_j^(i) is determined by the root of the equation\n\n\n    D(f_j^(i)‖ f_j^(i)+ϵ_j^(i) )=-1/Nlog (δ_j^(i)),\n\n\nN is the total number of samples, and we make the uniform choice δ_j^(i)=6^-qδ.\nFinding a state ρ∈Γ^(1)∩Γ^(2) hence corresponds to the semidefinite program\n\n    find       ρ\n    such that       ρ≥ 0,  (ρ)=1,\n       (E_jρ) ≤ f_j^(i)+ϵ_j^(i)(δ)\n         for  i=1,2  and  j=1,…,6^q.\n\n\n\n\n\n§ TARGET QUANTUM STATES\n\n\nThe target quantum states used for evaluating the empirical (1-δ)-quantiles of different CRs in Table <ref> are uniformly random pure states sampled according to the Haar measure.\n\nFor the tests of intersecting CRs in Figs. <ref> and <ref>, we choose pairs of target states ρ^(1), ρ^(2). The first state is always chosen as ρ^(1) = Ψ_ target, where |Ψ_ target⟩ is obtained by applying uniformly random rigid local unitaries on exemplary pure states of up to 4 qubits, i.e.,\n\n\n    |Ψ_ target⟩ = U^⊗ q|ψ_q⟩ ,\n\n\nwhere q=1,2,3,4 is the number of qubits of |ψ_q⟩, U∼μ_ Haar(SU(2)), and\n\n\n    |ψ_1⟩   = 1/√(2)(|0⟩+|1⟩)  ,\n    |ψ_2⟩   = |Φ^+⟩ = 1/√(2)(|00⟩+|11⟩)  ,\n    |ψ_3⟩   = | GHZ⟩ = 1/√(2)(|000⟩+|111⟩)  ,\n    |ψ_4⟩   = 1/2( |0000⟩+|0011⟩+|1100⟩-|1111⟩)  .\n\n\nThen, we distinguish two cases: the second state is either the maximally mixed state ρ^(2) = 2^-q, or another pure state defined as ρ^(2) = U_z(θ)^⊗ qρ^(1) (U_z(θ)^⊗ q)^†, where U_z(θ) = exp(i θσ_z), and θ is chosen such that (ρ^(1)ρ^(2)) = 0.63.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}