{"entry_id": "http://arxiv.org/abs/2303.07135v1", "published": "20230313140357", "title": "A diffuse interface approach for vector-valued PDEs on surfaces", "authors": ["Michael Nestler", "Axel Voigt"], "primary_category": "math.NA", "categories": ["math.NA", "cs.NA"], "text": "\n\n\n\n\nlabel1]Michael Nestler\n[label1]organization=Institute of Scientific Computing, TU Dresden,\n            city=Dresden,\n            postcode=01062, \n            country=Germany\n\nlabel1,label2,label3]Axel Voigt\n[label2]organization=Center for Systems Biology Dresden (CSBD),\n            addressline=Pfotenhauerstraße 108, \n            city=Dresden,\n            postcode=01307, \n            country=Germany\n[label3]organization=Cluster of Excellence Physics of Life (PoL),\n            city=Dresden,\n            postcode=01062, \n            country=Germany\n\n\nApproximating PDEs on surfaces by the diffuse interface approach allows us to use standard numerical tools to solve these problems. This makes it an attractive numerical approach. We extend this approach to vector-valued surface PDEs and explore their convergence properties. In contrast to the well-studied case of scalar-valued surface PDEs, the optimal order of convergence can only be achieved if certain relations between mesh size and interface width are fulfilled. This difference results from the increased coupling between the surface geometry and the PDE for vector-valued quantities defined on it.\n\n\n\n\n\n\n§ INTRODUCTION\n\n\t\nPDEs on surfaces remain an active field of research in applied mathematics and computational science. Due to their coupling with the geometry of such surfaces, PDEs are intrinsically nonlinear. This leads to new challenges in modeling and numerical analysis. Most of these challenges are addressed for scalar-valued surface PDEs, see <cit.> for a review. In the scalar case the coupling between surface geometry and the PDE is relatively weak, and thus numerical approaches established in flat spaces are applicable after small modifications. For vector-valued surface PDEs these approaches are no longer sufficient. Surface vector-fields often need to meet additional constraints. One example is the tangentiality of these fields. In this case, they need to be considered elements of the tangent bundle of the surface. This will lead to a strong nonlinear coupling between the surface geometry and the PDE. One break through which allows us to deal with these new challenges was the idea to express the solution and the surface differential operators in the global coordinate system of the embedding space and to penalize normal components, independently introduced in  <cit.> and generalized in <cit.>. This approach essentially allows us to apply established tools for scalar-valued surface PDEs to each component. Popular approaches are surface finite elements (SFEM) and trace finite elements (TraceFEM), which have been applied to various problems in liquid crystal theory <cit.>, fluid mechanics <cit.> and biological physics <cit.>. Numerical analysis results for these methods also exist, but are restricted to the most simple equations of this type, the surface vector-valued Laplace equation <cit.>, the surface vector-valued Helmholtz equation <cit.> and the surface Stokes equations <cit.>. All these results show the necessity for an appropriate approximation of the geometric quantities that enter these equations. Optimal order of convergence can often only be achieved if this approximation is of a higher order than the solution. These results reflect the increased coupling between the surface geometry and the solution for vector-valued surface PDEs if compared with scalar-valued surface PDEs. This increase in complexity is also shown numerically by comparing scalar-, vector- and tensor-valued surface diffusion equations by various numerical methods <cit.>.\n\nAnother popular method to solve surface PDEs, the diffuse interface method <cit.> is less explored for vector-valued surface PDEs. Two examples, where solutions are compared with other more established methods are <cit.>. The diffuse interface method approximates the surface PDE by a bulk PDE that can be solved with standard numerical tools. This makes the approach attractive to be used in various application areas for more complex problems, especially those where the surface evolves according to physical laws which depend on the vector-valued surface quantity. Such applications can be found in biology, e.g. in morphogenesis, where the method recently led to spectacular results <cit.>. However, knowing the subtleties associated with the approximation of geometric terms in SFEM and TraceFEM, discussed above, and the additional error emerging from the approximation of the diffuse interface method, such results should be considered with care. \n\nWe here consider a tangential vector-valued surface Helmholtz equations to explore the convergence properties of the diffuse interface methods. This can be considered as a model problem, and the obtained results can be assumed to be applicable also to other more complex surface PDEs. In Section <ref> we introduce the surface model, review the described extension to the embedding space and required penalization of the normal component, which provides the basis for a SFEM discretization and derive from this the diffuse interface formulation. We formulate these approaches in variational form and provide a finite element (FEM) discretization. The diffuse interface approximation is justified by formal matched asymptotics, which directly follow from the results for scalar-valued surface PDEs <cit.>. In Section <ref> we construct an analytical solution and perform various convergence studies. The results indicate the necessity for accurate approximations of the surface normals. These approximations can be obtained from the phase field variable or the signed distance function of the implicit surface description. Depending on the chosen approach specific minimal requirements regarding the relation of interface width and mesh size at the interface have to be meet for optimal convergence. Ignoring these requirements can result in numerical solution procedures that do not converge! These results significantly differ from the known results for the diffuse interface method for scalar-valued surface PDEs. In Section <ref> we draw conclusions.  \n\t\n\t\n\t\n\n\n§ MODEL PROBLEM\n \nWe demonstrate the applicability of the diffuse interface approach by considering the surface vector-valued Helmholtz equation on a smooth, oriented two-dimensional surface ⊂^3 without boundaries. The equation reads\n\n    - +     =   ,\n\n\nfor a tangential vector field  defined in the tangent bundle  of  and a compatible right hand side . The considered differential operators  and  correspond to the metric-preserving covariant derivative ∇_. The diffuse interface formulation will be based on the SFEM formulation for vector-valued surface PDE's, as detailed in <cit.>. The general idea is to express the solution and the operators in the global coordinate system of the embedding space ^3 and to penalize normal components. We denote the Euclidean coordinates of ^3, by uppercase letters I,J,K, … and consider Einstein's sum convention. We consider the outward oriented normal , the surface identity = 𝕀- and the shape operator = -∇_. For  we denote the formal extension to the embedding space by , for which we require [ - (·)  ]|_=. Finally we define the full tangential projection of such extended fields along all their components by [.],  for a vector-valued field [𝐏]_I = _IJP_J and for a 2-tensor-valued field []_IJ = _IKQ_KL_LJ.  \n\nGiven these notations we can express the surface differential operators by their ^3 counterparts. Acting on the extended field  this reads\n\n    = [∇]|_ + (|_·) \n    \n    \t[]_IJ    = _IL∂_K _L _KJ + _IJ_L_L,\n\nsee <cit.> for details. To obtain the embedded variational formulation we use scalar products of pointwise full contraction of the tangential parts of the extended solution  and the test function , e.g.\n\n    =  = ∫_ ([],[]) d = ∫__I _IJ_J d.\n\nFrom these ingredients we set up a component wise solution-test space [H^1()]^3 and write the embedded variational problem\n\n    [∇] + (·)[∇] \n    \t\t+ (·)   \n     +  + ··    =    ∀∈ [H^1()]^3\n\nwith an additional penalty term with prefactor  to approximate · = 0. In this formulation each component can be considered by classical SFEM for scalar-valued fields, see <cit.>.\n\nVarious numerical studies confirm the applicability of this approach. Numerical analysis provides various estimates of solution error convergence for surface mesh size _→ 0. Here, we consider the surface  to be approximated by faceted polyhedra . Such first order geometry approximation allows only linear Lagrangian elements [_]_I ∈() ≈ H^1() for the discretization of the component solution-test space. This approach is referred to as the linear isogeometric ansatz. With the penalty prefactor = (1/_^2) one obtains quadratic convergence of the L^2-error \n    ( -[_];_) = ( -[_] - [_])^1/2.\n Please note, by approximating  by a faceted polyhedra  we yield _ = 0 which significantly simplifies the discretized weak formulation of the Laplacian in eq. (<ref>). Various numerical studies, also for more complicated problems <cit.>, confirm quadratic order.\n\t\nAt first glance it seems straight forward to apply the tools introduced in <cit.> to each component in eq. (<ref>) to obtain a diffuse interface approximation which turns the problem defined on  into a problem defined in ^3. However, eq. (<ref>) contains various geometric terms, which are not considered in <cit.> or any subsequent analysis. The sensitivity of the solution to the approximation of these geometric terms is known from <cit.> and contrary to the scalar case <cit.>, higher order approximations for the surface and the solution only lead to better convergence properties if a higher order approximation of the normals is used in the introduced penalization term. So, the question arises if an additional approximation of the normals, resulting from an implicit description of the surface in the diffuse interface formulation, is sufficient to obtain the same convergence properties as the SFEM approach. We will answer this question in the following.\n\t\nIn order to formulate the diffuse interface approximation we extend the quantities , ,  and  to the embedding space. We consider this component wise constant in the normal direction and denote the extended quantities by , ,  and , respectively. With this we can write _IJ=- _IK∂_K _J, and _IJ|_ = _IJ. We now follow <cit.> and embed the surface in a bulk domain ⊂ and use an implicit description of . For this purpose we use a signed distance function () with |∇ | = 1 and = {∈, ()=0} and a phase field function () = 1/2 (1 -tanh(3()/)) with interface width > 0 and = {∈, ()=1/2}. With these functions we can evaluate extended normals. We obtain \n\n    = ∇,     = -∇ / | ∇\n\nThe surface delta function is approximated by ≈() = 36/ (1-)^2 ^2, the classical double-well potential in Ginzburg-Landau energies <cit.>. Within this notation we substantiate the previously used constant normal extension by the closest point projection : →,  () =  -,  () = ∘(), which is well defined for  sufficient small such that () < 1, ∀∈. With this notation we express the surface scalar product by a scalar product of the embedding space\n\n    = ≈∫_() _I _IJ_J d = .\n\nWe use this embedded scalar product to set up the embedded variational problem with a component wise solution space [H^1()]^3. So the diffuse interface approximation of the component wise embedded variational problem eq. (<ref>) reads\n\n    [[∇] + (·)][∇] + (·)   \n    \n    \t +  + [·][·]   =   ∀∈ [H^1()]^3.\n\nConsidering such component wise formulation as a coupled system of scalar fields, the matched asymptotic analysis of <cit.> provides formal convergence of eq. (<ref>) to eq. (<ref>) for → 0. This establishes eq. (<ref>) to be a diffuse interface approximation of eq. (<ref>). Using this procedure any surface PDE can be reformulated into the corresponding diffuse interface approximation.\n\t\n\nIn analogy to the SFEM approach, we use a linear ansatz for the implicit geometric description by _, _∈(_) for a tetrahedral mesh _ of , where  denotes the bulk mesh size in the interface ∈ [0.05, 0.95]. Within such ansatz the recovered surface = {_≡ 0} or = {_≡ 1/2} is a faceted polyhedra. The same ansatz is considered for the solution _∈ [(_)]^3. This allows us to consider _ = 0 across the interface and we obtain \n\n    H(_,) + P(_,) + R(_,) = F()   ∀ ∈ [(_h)]^3\n\nwith the Helmholtz operator H(_,), the normal penalty term P(_,), a bulk stabilization R(_,) and the right hand side F(), defined by:\n\n    H(_,) =   (_)[_]_IJ ∂_K _,I∂_K _J\n        + (_)[_]_IJ _,I_J\n    \n    \tP(_,) =     (_) [_]_I _,I[_]_J_J\n    \n    \tR(_,) =     ∂_K _,I∂_K _I\n    \n    \tF() =    (_)[_]_IJ _I_J,\n\nrespectively. Here we have used a component wise constant regularization outside the interface of =10^-6 as discussed for the scalar case in <cit.>. Inspired by the normal penalty condition, specified in <cit.> for the isogeometic case, we consider also within the diffuse interface approximation = 10/h^2.\n\t\n\t\n\n\t\n\t\n\n\t\n\n\n§ RESULTS\n \n\t\nWe are interested in the convergence properties of the diffuse interface approach. We have to take into consideration that error measures will depend on  and . For further discussion we define a relation (, ) to essentially express the number of mesh points across the interface for a given interface width. For our considerations we follow <cit.> and group those relations as linear, where = () so the number of points remains constant within the interface for → 0, and higher order relations, where ^2 = (^3),(^4),(^5) such that the number of points within the interface increases for → 0, see Figure-<ref>-[B].\n\t\nWithin the same setting, a linear ansatz for the geometric description and a linear ansatz for the solution, in <cit.> a numerical study was performed to estimate convergence rates. For a linear relation (, ) quadratic convergence was obtained for the scalar-valued problem, which can be considered optimal. It thus provides an upper limit to our vector-valued problem. However, it remains open if this limit can be reached in typical applications, where the signed distance function _h or the phase field variable _h need to be constructed from a surface mesh or where the phase field variable _h might be a solution to another PDE. In these cases the computation of the normals _h by eq. (<ref>)[A] or [B] adds an additional source of error. \n\t\n\n\n §.§ Benchmark formulation\n\n\t\nTo assess the impact of the major sources of approximations in the diffuse interface approach we perform a series of numerical experiments on a torus  with radi R=1 and r=0.5. The torus is embedded in = [-2,2]^3. The analytical signed distance function for this geometry is given in ℝ^3,  = [x,y,z] by\n\n    () = (( √(x^2 + y^2)  - R )^2 + z^2 )^1/2 - r\n\nThe analytic phase field function  is defined as before and for the analytic normal to  we consider = ∇. On  we consider the solenoidal tangential vector field = ×∇_(x^2 y - 5 z^3) and its extension to  by = ∘, see Figure-<ref>-[C]. This vector field will be used as an analytical solution for estimating the rate of error convergence. A compatible right hand side in eq. (<ref>) is constructed by\n\n    F() = () [ ] _IJ[∇]_IJ + ()_I[]_I.\n\nTo obtain results, which are comparable to the SFEM results in <cit.> we estimate - [_]≤ - _ + _· and approximate surface error measured by the following diffuse interface L^2 error measures.\n\n    ( - _h; , )    = (() ( - _h)·( - _h))^1/2\n    (_h ·; , )    = (() [_h·][_h ·])^1/2.\n\n\t\nFor the subsequent numerical experiments we consider a set of mesh sizes ∈ [(1/2)^7, (1/2)^2], corresponding to bisections of . For each  and (,) relation we evaluate an associated  and construct an adaptive tetrahedral mesh with meshsize  in the diffuse interface of width . Off the interface, the mesh is only refined to preserve conformity. See Figure <ref>-[A]. We use the toolbox <cit.> to generate these meshes and evaluate _. uses a triangulated surface as input which we generate via <cit.> with vertices on  and meshsize _ = /4. Different methods exist to compute signed distance functions, see e.g. <cit.>. In a second order method is implemented. We use the finite element toolbox  <cit.> to solve eq. (<ref>), which uses an unpreconditioned BiCGstabL solver provided by  <cit.> for the linear system.\n\t\n\n\t\n\n\n\t\n\t\n\n\n §.§ Numeric evaluation of diffuse interface variables and normals\n First we examine the convergence of errors in the chosen method to compute diffuse interface variables _, _ and _ derived from these fields. We compute _ and _ with for all  and (,) relations. We evaluate the diffuse interface L^2-errors  the analytical results ( - _; , ), and ( - _; , ) and plot these quantities versus , see Figure-<ref>-[A]. We observe the errors in evaluating _h converge quadratic,  → 0 for linear (,) relation. Higher order (,) relations increase the rate of convergence. For _h we observe the rates of convergence to be reduced about one order compared to rates for _h. Recalling that |∇ | = 1 while |∇ | ≈ 1/ near the interface such reduced order of convergence is expected. Using the evaluated diffuse interface fields to determine the normals along the approaches described in eq. (<ref>) we evaluate the diffuse interface L^2-errors, ( - ∇_h; , ) and ( + ∇_h / | ∇_h |; , ), see Figure-<ref>-[B]. Using the linear (,) relation, see Figure-<ref>-[B](blue lines), we yield quadratic rate of convergence in ( -∇_; , ) while (^a + ∇_ / | ∇_ |; , ) does not converge for → 0. Considering higher order (,) relations the convergence rates,  , for ( - ∇_; , ) could be improved beyond quadratic rate. In the case of ( +∇_ / | ∇_ |; , ) a linear convergence rate could be achieved for ^2 = (^3) and a quadratic rate is achieved with ^2 = (^5) relation. We conclude that, in order to obtain normals with converging errors for → 0, provides sufficient good approximations for _h to evaluate _h = ∇_h even for a linear (,) relation. Yet considering the approach of computing normals from _h, we have to keep in mind that the rate of convergence,  → 0, is effectively reduced by two orders. Therefore, errors in normals only converge with higher order (,) relations.\n\t\n\n\t\n\t\n\t\n\n\n §.§ Error convergence for solution with analytic diffuse interface variables\n Next we consider the analytical forms for ,  and  and solve eq. (<ref>) for a set of  and (,) relations. We evaluate the diffuse interface L^2-error ( - _h; , ), see Figure-<ref>-[C]. We observe that for a linear (,) relation a quadratic rate of error convergence  → 0. This confirms the result from <cit.> for scalar-valued PDEs. Again, using higher order (,) relations improves the rate of error convergence  → 0. But reviewing the error convergence   it becomes apparent that  is the crucial factor in convergence of ( - _h; , ) and using higher order (,) relations does not improve the rate of convergence for → 0. So, we conclude that an analytical diffuse interface approximation does not impair the convergence of errors  → 0, and we observe a quadratic rate of convergence for linear (,) relation.\n\t\n\t\n\t\n\n\n §.§ Error convergence for diffuse interface approximation\n We now combine both, consider approximations of the diffuse interface variables _, _ and _ obtained with and solve eq. (<ref>) for a set of  and (,) relations. For these numeric solutions _h we evaluate the diffuse interface L^2-error  ( - _h; , ) and the normal component (_h ·; , ), see Figure-<ref>. For the normal approximation by _h = ∇_h, see Figure <ref>-[A] and a linear (,) relation we observe quadratic rate of convergence for → 0 in the normal component and for the solution error. Due to the linear nature of the (,) relation this behavior translates into quadratic rate of convergence   with absolute values very close to the results with analytic diffuse interface variables and normals in Figure <ref>-[C]. For higher order (,) relations the errors and convergence rates are also very close to the results with analytic diffuse interface variables and normals. Quite contrary, we observe while using the approximation of _h = - ∇_h / | ∇_h | the errors in normal approximation to be dominant. Reviewing Figure <ref>-[B](right) we observe that the reduced normal approximation quality of this approach yields reduced convergence rate for controlling the solutions normal component, see Figure <ref>-[B](left) directly impacting the solution error convergence rate in Figure <ref>-[B](middle). In the case of a linear (,) relation =() we observe no convergence in solution error, at ^2=(^3) we obtain a linear rate of convergence and for  ^2=(^4) and ^2=(^5) we yield close to quadratic rates of convergence. Comparing to the results for analytic diffuse interface variables and normals we observe only for ^2=(^5) similar errors and rates of convergence for (_h · ; , ) and ( - _h; , )  → 0 and → 0. Therefore, we conclude that the diffuse interface method, based on component-wise FEM, yields rates of error convergence compatible to the results of SFEM for vector-valued surface PDEs only if a high-quality signed-distance function is used to compute the normals. In this case a linear (,) relation is sufficient. Alternatively if the normals are approximated by _h = - ∇_h / | ∇_h | a (,) relation with ^2=(^5) is required to achieve quadratic rate of convergence. A linear (,) relation does not lead to convergence in this case! This significantly differs from the diffuse interface method for scalar-valued surface PDEs introduced in <cit.>.\n\t\n\n\t\n\n\n§ DISCUSSION AND CONCLUSION\n \n\t\nWe provided a systematic derivation of a diffuse interface method to solve vector-valued surface PDEs. This approach builds on established SFEM formulations <cit.> and allows us to consider each component as a scalar quantity. The resulting system of equations can be solved by standard FEM. The connection to the surface PDE is established by formal matched asymptotic following <cit.> and is applicable to any vector-valued surface PDE. Along the same lines the approach can also be extended to tensor-valued surface PDEs.\n\nOur numerical studies show that the same convergence properties as for SFEM can be achieved. With a linear isogeometric approach, which in our approach corresponds to linear Lagrange elements and a simplicial mesh, a quadratic order of convergence can be obtained for the considered vector-valued surface Helmholtz equation on a torus. However, to achieve this optimal order requires an accurate approximation of the surface normals. If they have to be numerically constructed a specific (,) relation is necessary. If the computation of the normals is based on the signed distance function _h a linear relation is sufficient. However, if the computation of the normals is based on the phase field variable _h a linear relation does not lead to convergence and a higher order relation is required. The numerical results suggest ^2=(^5) to obtain a quadratic rate of convergence.\n    \nThis result has severe consequences for applications. While for stationary surfaces, the computation of a signed distance function is not an issue and in such cases the diffuse interface method with normals computed from the signed distance function provides a valuable tool with optimal order of convergence, for moving surfaces this is no longer an option. The increased computational cost resulting from the computation of a signed distance function in each time step makes the approach inefficient. Assuming that the evolution of the surface is governed by a phase field problem which determines _h in each time step, the normals should be computed using _h. Such approaches are common for scalar-valued surface quantities, such as concentration <cit.> or particle density <cit.>. However, for vector-valued surface quantities using this approach does not lead to convergence if a linear (,) relation is considered. We can only expect convergence for higher order relations and quadratic convergence for ^2=(^5). This needs to be respected in applications. Accounting for this issue increases the computational cost. However, the advantages of using basic numerical tools like linear Lagrangian elements and generic iterative solvers and the possibility to deal with topological changes in the evolution of the surface remain. This together with the possibility to couple the surface PDE with equations in the embedding space <cit.>, e.g. in two-phase flow problems with fluidic surfaces <cit.>, makes this approach appealing for various applications.\n\n    \nAcknowledgments: \nThis work was supported by the German Research Foundation (DFG) through grant VO 899/22 within the Research Unit ”Vector- and Tensor-Valued Surface PDEs” (FOR 3013). We further acknowledge computing resources provided by ZIH at TU Dresden and by JSC at FZ Jülich, within projects WIR and PFAMDIS, respectively.\n\t\n\t\n\t\n\t\n\telsarticle-num\n\t \n\t\n"}