{"entry_id": "http://arxiv.org/abs/2303.08048v1", "published": "20230313140006", "title": "Active target TPC for study of photonuclear reactions at astrophysical energies", "authors": ["M. Kuich", "M. Ćwiok", "W. Dominik", "A. Fijałkowska", "M. Fila", "A. Giska", "Z. Janas", "A. Kalinowski", "K. Kierzkowski", "C. Mazzocchi", "W. Okliński", "M. Zaremba", "D. Grządziel", "J. Lekki", "W. Królas", "A. Kulińska", "A. Kurowski", "W. Janik", "T. Pieprzyca", "Z. Szklarz", "M. Scholz", "M. Turzański", "U. Wiącek", "U. Woźnicka", "A. Caciolli", "M. Campostrini", "V. Rigato", "M. Gai", "H. O. U. Fynbo"], "primary_category": "physics.ins-det", "categories": ["physics.ins-det", "nucl-ex"], "text": "\n\n\n\n\n\n\n\nActive target TPC for study of photonuclear reactions at astrophysical energies\nPresented at Zakopane Conference on Nuclear Physics 2022\n\n\n    M. Kuich^1e-mail: mkuich@fuw.edu.pl, M. Ćwiok^1, W. Dominik^1, A. Fijałkowska^1, M. Fila^1, A. Giska^1, Z. Janas^1, A. Kalinowski^1, K. Kierzkowski^1, C. Mazzocchi^1, W. Okliński^1, M. Zaremba^1, D. Grządziel^2, J. Lekki^2, W. Królas^2, A. Kulińska^2, A. Kurowski^2, W. Janik^2, T. Pieprzyca^2, Z. Szklarz^2, M. Scholz^2, M. Turzański^2, U. Wiącek^2, U. Woźnicka^2, A. Caciolli^3, M. Campostrini^4, V. Rigato^4, M. Gai^5, H. O. U. Fynbo^6\n^1Faculty of Physics, University of Warsaw, Warsaw, Poland\n\n^2Institute of Nuclear Physics Polish Academy of Sciences, Cracow, Poland\n\n^3University of Padova and INFN-PD, Padova, Italy\n\n^4Laboratori Nazionali di Legnaro, Legnaro, Italy\n^5University of Connecticut, CT, USA \n ^6Department of Physics and Astronomy, Aarhus University, Aarhus, Denmark\n\n\n    March 30, 2023\n=========================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\nA setup designed to study photonuclear reactions at astrophysical energies - an active target Time Projection Chamber was developed and constructed at the Faculty of Physics, University of Warsaw. The device was successfully employed in two experiments at the Institute of Nuclear Physics Polish Academy of Sciences in Cracow, in which γ- and neutron-induced reactions with CO_2 gas target were measured. The reaction products were detected and their momenta reconstructed. Preliminary results are shown.\n\n  \n\n\n§ INTRODUCTION\n\nOne of the most important open questions in nuclear astrophysics concerns the creation of carbon and oxygen in the stars.\n\nSynthesis of carbon and oxygen happens in helium-burning thermonuclear reactions in the star’s core, the triple-alpha reaction and ^12C(α,γ)^16O, respectively. \nThe basic observable to resolve the reaction rates is the cross-section, which has to be determined at the relevant energies (at the Gamow peak) and also is required as input information for star evolution models <cit.>.\nOne way to determine the reaction cross-section is to study its inverse reaction by using an active-target together with photon and neutron beams. In this paper, we present preliminary studies to validate this approach.\n\n\n\n\n§ EXPERIMENTS\n\n\n\nStudying the γ- and n-induced reactions on ^12C and ^16O requires a detection system that allows for reconstructing the momenta of all the charged reaction products. An ideal tool is an active-target time-projection chamber (active-target TPC), filled with CO_2 gas. \nThe Warsaw active-target TPC was developed for this purpose. It consists of a 33× 20 × 20 cm^3 active volume, immersed in a vacuum vessel equipped with a control system to maintain a constant gas pressure inside. The active volume is surrounded by field-shaping electrodes and terminated with a cathode plate on one end and a stack of 3 Gas Electron Multiplier foils as amplification section followed by a planar, 3-coordinate (U, V, W), redundant readout plane at the other end. The arrays of U-, V-, and W-strips register the charge deposit in 2-dimensions, while time-distribution of the charge collected at the electrode, combined with the drift velocity of the electrons in the given gas mixture and drift field, allows for determining the third coordinate. The device allows for full and unambiguous kinematic reconstruction of multiple-particle events <cit.>. The first commissioning measurements with the Warsaw active-target TPC were conducted in 2021 at the Institute of Nuclear Physics, Polish Academy of Sciences in Cracow (IFJ). \n\nIn the first experiment, a 1.03 MeV proton beam from the Van de Graaff accelerator with currents of about 10-20 μA was used to produce 13.1 MeV γ-rays in the ^15N(p,γ)^16O reaction. For this purpose, a ^15NCr target (about 1.3× 10^18 atoms/cm^2), produced in reactive ion sputtering on a Ta backing at the National Laboratories of Legnaro, was used. The γ beam intensity was monitored by a NaI detector positioned at the side of the target. The TPC, filled with CO_2 at the absolute pressure of 250 mbar, was placed right behind the target station and the produced γ-rays interacted with the gas of the TPC, where they induced the photo-disintegration of ^12C and ^16O. Charged reaction products were detected. Examples of ^16O(γ,p)^15N and ^16O(γ,α)^12C event candidates are shown in Fig. <ref>.  \nRaw charge distributions in strip (U-, V-, W-) coordinate and time are presented as 2D plots. A manual reconstruction method was used to determine the emitted particle position in the chamber and measure its range. Identification of the two-particle event as due to ^16O(γ,p)^15N or ^16O(γ,α)^12C as well as the energy reconstruction was done by comparing the track length of emitted particles with SRIM simulations <cit.>. Examples of event reconstruction is presented in the 1D plots in Fig. <ref> as charge distribution along the track(s) with fitted Bragg curve(s). \nA preliminary distribution of the reconstructed energy of the protons is depicted in Fig.<ref> (partial statistics was analyzed).\n[13]l0.5\n \n    < g r a p h i c s >\n\n Reconstructed proton energy spectrum from ^16O(γ,p)^15N. \n \n \n \n\nThe mean energy of the protons, ⟨ E_⟩ = 890 ± 24 keV, is in 3σ agreement with expected 966 keV.\n\nThe second experiment took place at the Impulse Neutron Generator (IGN-14), where 14 MeV neutrons were produced in the d(t,n) reaction and interacted with the CO_2 gas, which was kept at 80 mbar, in the TPC positioned just behind the tritium target. The neutron flux was monitored with a ^3He counter and additionally estimated with activation of aluminium targets.\nThe typical neutron flux amounted to about 3 × 10^4 n/s/cm^2.\nTwo example events for ^12C(n,n')^12C^* and ^16O(n,α)^9Be reactions are presented in Fig. <ref>.\n\nPartial statistics was manually analyzed and the emitted particles identified. The majority of the two-particle events were classified as ^12C(n,α)^9Be, while three-particle events as carbon dissociation into 3 α particles. Preliminary reconstruction of the particles momenta indicates that the ^12C(n,n')^12C^* event in the Fig. <ref> corresponds to the decay of the Hoyle state at 7654 keV by 3α emission.\n\n\n\n§ SUMMARY\n\nAn active-target TPC dedicated for studying reactions of astrophysical interest at the relevant energies with γ or neutron beams was developed at the University of Warsaw. The first experiments employing it were conducted in 2021 at IFJ, where ^16O(γ,α)^12C, ^16O(γ,p)^15N, ^12C(γ,3α), ^12C(n,α)^9Be and ^12C(n,n')^12C^* were observed. Preliminary analysis shows that the Warsaw active-target TPC is an adequate tool for measuring such reactions induced by non-charged particles.\n\nWe would like to thank H. Czyrkowski and R. Dąbrowski for their support in the preparation of the equipment. Scientific work was supported by the National Science Centre, Poland, contract no. 2019/33/B/ST2/02176, by the University of Warsaw, Poland, through the Interdisciplinary Centre for Mathematical and Computational Modelling, comp. alloc. no. G89-1286. \n\n\n  unsrt\n\n"}