{"entry_id": "http://arxiv.org/abs/2303.07124v1", "published": "20230313135612", "title": "Dimensional Analysis of Vapor Bubble Growth Considering Bubble-bubble Interactions in Flash Boiling Microdroplets of Highly Volatile Liquid Electrofuels", "authors": ["Avijit Saha", "Abhishek Y. Deshmukh", "Temistocle Grenga", "Heinz Pitsch"], "primary_category": "physics.flu-dyn", "categories": ["physics.flu-dyn"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nmymainaddress]A. Sahamycorrespondingauthor\n[mycorrespondingauthor]Corresponding author\na.saha@itv.rwth-aachen.de\nmymainaddress]A. Y. Deshmukh\nmymainaddress,mysecondaryaddress]T. Grenga\nmymainaddress]H. Pitsch\n\n[mymainaddress]Institute for Combustion Technology, RWTH Aachen University, Aachen, Germany\n[mysecondaryaddress]Faculty of Engineering and Physical Science, University of Southampton, Southampton, United Kingdom\n\n\nElectrofuels (e-fuels) produced from renewable electricity and carbon sources have gained significant attention in recent years as promising alternatives to fossil fuels for the transportation sector. However, the highly volatile e-fuels, such as short-chain oxymethylene ethers (OME_x) are prone to flash vaporization phenomena, which is associated with the formation and growth of vapor bubbles, followed by explosive bursting of the liquid jet. This phenomenon is important in many practical applications, for example, superheated liquid sprays in gasoline direct injection engines as well as cryogenic engines. The simulation of a flash boiling spray of such highly volatile liquid fuels is numerically challenging due to several reasons, including (1) the complexity of the bubble growth process in the presence of multiple vapor bubbles and (2) the need to use an extremely small time step size to accurately capture the underlying physics associated with the flash boiling process. In this paper, we first present a bubble growth model in flash boiling microdroplets considering bubble-bubble interactions along with the finite droplet size effects. A dimensional analysis of the newly derived Rayleigh-Plesset equation (RPE) with bubble-bubble interactions is then performed for Reynolds numbers of different orders of magnitude to estimate the relative importance of different forces acting on the bubble surface. Based on this analysis, a simplified nondimensional semi-analytical solution for bubble growth, which also includes the bubble-bubble interactions, is derived to estimate the bubble growth behavior with reasonable accuracy using the larger time step sizes for a wide range of operating conditions. The derived semi-analytical solution is shown to be a good approximation for describing the bubble growth rate  over the whole lifetime of the bubble, thus making it useful for simulations of superheated sprays with large numbers of droplets and even more bubbles. The bubble-bubble interactions are found to have a significant impact on the bubble growth dynamics and result in delaying the onset of droplet bursting due to the slower growth of the vapor bubble compared to the bubble growth without bubble-bubble interactions. Furthermore, in a comparison with DNS results, the proposed bubble growth model is shown to reasonably capture the impact of bubble interactions leading to smaller volumetric droplet expansion.\n\n\n\n\n\n\nFlash boiling Bubble-bubble interactions  Bubble growth Bubble dynamics Reduced-order model E-fuels\n\n\n\n\n\n\n\nElectrofuels (e-fuels) produced from renewable electricity and carbon sources have gained significant attention in recent years as promising alternatives to fossil fuels for the transportation sector. However, the highly volatile e-fuels, such as short-chain oxymethylene ethers (OME_x) are prone to flash vaporization phenomena, which is associated with the formation and growth of vapor bubbles, followed by explosive bursting of the liquid jet. This phenomenon is important in many practical applications, for example, superheated liquid sprays in gasoline direct injection engines as well as cryogenic engines. The simulation of a flash boiling spray of such highly volatile liquid fuels is numerically challenging due to several reasons, including (1) the complexity of the bubble growth process in the presence of multiple vapor bubbles and (2) the need to use an extremely small time step size to accurately capture the underlying physics associated with the flash boiling process. In this paper, we first present a bubble growth model in flash boiling microdroplets considering bubble-bubble interactions along with the finite droplet size effects. A dimensional analysis of the newly derived Rayleigh-Plesset equation (RPE) with bubble-bubble interactions is then performed for Reynolds numbers of different orders of magnitude to estimate the relative importance of different forces acting on the bubble surface. Based on this analysis, a simplified nondimensional semi-analytical solution for bubble growth, which also includes the bubble-bubble interactions, is derived to estimate the bubble growth behavior with reasonable accuracy using the larger time step sizes for a wide range of operating conditions. The derived semi-analytical solution is shown to be a good approximation for describing the bubble growth rate  over the whole lifetime of the bubble, thus making it useful for simulations of superheated sprays with large numbers of droplets and even more bubbles. The bubble-bubble interactions are found to have a significant impact on the bubble growth dynamics and result in delaying the onset of droplet bursting due to the slower growth of the vapor bubble compared to the bubble growth without bubble-bubble interactions. Furthermore, in a comparison with DNS results, the proposed bubble growth model is shown to reasonably capture the impact of bubble interactions leading to smaller volumetric droplet expansion.\n\n\n\n\n§ INTRODUCTION\n\nThe growth of a vapor bubble in a liquid is of great interest in the study of superheated boiling phenomena, e.g., flash boiling in gasoline direct injection engines and cryogenic engines. Generally, a bubble undergoes four different growth stages, i.e., (1) surface tension-controlled (ST) stage, (2) transition (T) stage, (3) inertia-controlled (IC) stage, and (4) thermal diffusion-controlled (TD) stage <cit.>. The bubble grows very slowly in the initial growth stage, which is mainly dominated by the surface tension force. A significant growth starts in the later ST-period due to strong positive thermal feedback from the surrounding superheated liquid. The transition growth stage is limited by both surface tension and inertia forces. As the bubble grows sufficiently large, in the IC-stage, the surface tension force diminishes, and only the inertial force limits the growth rate. Once the inertial forces tend towards zero, in the TD-stage, only the thermal diffusion acts as a rate-limiting factor for the bubble growth. It is to be noted that in cases, where the liquid inertial force is not sufficient to balance the pressure difference at the bubble surface, thermal diffusion along with the surface tension control the growth in the transition stage <cit.>, which thus connects the surface tension and thermal diffusion-controlled growth stages. Several numerical studies are available in the literature, which simulate all the growth stages that a vapor bubble undergoes during its lifetime, such as <cit.>, <cit.>, <cit.>, and <cit.> to name a few. <cit.> developed a simple theory of bubble growth assuming temperature equilibrium at the liquid-vapor interface and a linear temperature drop across a thin thermal boundary layer surrounding the bubble surface. <cit.>, <cit.>, and <cit.> proposed similar bubble growth models by relaxing the assumption of the linear temperature drop across the thin thermal boundary layer. They numerically solved a one-dimensional energy equation together with the one-dimensional momentum equation such that the temperature gradient at the liquid-vapor interface can be obtained from the computed temperature field. The bubble evolutions predicted by their models were in good agreement with the experimental measurements. The numerical studies described above were performed to simulate the growth of a single vapor bubble in a homogeneous infinite liquid medium. The liquid expansion and disruption phenomena were not considered in these studies. However, for flash boiling spray in automotive or cryogenic engines, multiple bubbles can be present inside superheated liquid droplets. As the vapor bubbles grow, the droplets continue to expand and can eventually rupture into smaller child droplets once a critical void fraction is reached. To explore the effect of the presence of multiple bubbles and the droplet disruption phenomena, <cit.> simulated the flash boiling in a superheated single droplet of dimethyl ether (DME) using the boiling explosion model derived by <cit.>. They reported that the boiling explosion time becomes shorter for higher fuel temperatures and lower ambient pressures. <cit.> recently proposed a reduced-order model (ROM) for simulating the flash boiling of a superheated single droplet of highly volatile e-fuels with multiple monodisperse vapor bubbles under subatmospheric operating conditions. They also investigated the detailed underlying physics associated with the growth of vapor bubbles. The effect of bubble-bubble interactions is crucial in determining the growth characteristics of vapor bubbles in superheated microdroplets. <cit.> performed a direct numerical simulation (DNS) of bubble clusters to quantify the effects of bubble-bubble interactions in comparison with the single bubble growth for liquid oxygen (LOx) in different simplified configurations. They reported a significant reduction (more than 70%) in the growth rate of the vapor bubbles located near the center of the LOx jet. These bubbles were found to have a negligible contribution to the volumetric expansion of the liquid jet. However, such fully-resolved simulations for accurate predictions of the bubble growth characteristics in multibubble environments are not feasible for large-scale spray simulations due to the high computational cost. A ROM considering the bubble-bubble interactions is thus necessary in this regard. The studies available in the literature mainly focus on the reduced-order modeling of the bubble-bubble interactions in the context of cavitation phenomena (such as <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, and <cit.>, to name a few). In contrast, studies on reduced-order modeling of flash boiling of single droplets are still scarce in the literature. Although there are plenty of studies on flash boiling ROMs of single droplets and spray available in the literature (such as <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, and <cit.>, to name a few), none of them considered the effect of bubble-bubble interactions in their study.The time-step size is another important factor in the simulation of the flash boiling phenomena of high-volatility liquid fuels. In a previous study by the current authors <cit.>, a fixed time-step size of one nanosecond (𝒪(10^-9 s)) was used to simulate the flash vaporization phenomena of highly volatile e-fuel microdroplets. Yet, it was found that this time-step size is still insufficiently small when considering bubble-bubble interactions for high-volatility fuels. Thus, the computational cost will also increase for the simulation of the large-scale spray case consisting of millions of single droplets.A universal correlation or a simplified analytical solution for the bubble growth rate throughout the whole bubble lifetime, which also considers all the complex physical processes including bubble-bubble interactions occurring during the flash vaporization of a superheated single droplet, would be useful for the accurate and computationally efficient simulation of the large-scale spray case.Previous studies were mainly focused on the derivation of the analytical formulation and correlation for the single vapor-bubble growth in an infinite superheated liquid medium only at later growth stages, such as IC and TD growth <cit.>. <cit.> proposed an analytical solution for bubble growth by neglecting the viscous effect and the cooling effect of vaporization as \n\n    d/dt=(2/3-/)^1/2,\n\nwhere  is the bubble radius, t the time, and  the liquid pressure.  and  are the saturated liquid density and vapor pressure, respectively, at bulk liquid temperature . eqn:rayleigh is referred to as inertia-controlled growth and provides a good description of bubble dynamics for sufficiently large initial superheating degrees or sufficiently low system pressures. <cit.> later obtained an asymptotic solution of bubble growth controlled by the thermal diffusion effect as\n\n    d/dt=1/2(12/π t)^1/2(-())/,\n\nwhere  is the thermal diffusivity of the liquid and  the liquid specific heat capacity.  and  denote the latent heat and saturated vapor density at saturation temperature, , respectively. The time t in eqn:pless is measured from the onset of nucleation of the bubble. The range of applicability of the analytical works described above is limited to the later stages of bubble growth when the radius is much larger than the critical radius defined as\n\n    =2σ()/ -,\n\nwhere σ is the surface tension.In order to correlate the bubble radius as a function of time in terms of nondimensional parameters, <cit.> derived the reference length and time scales by requiring the nondimensionalization to be reasonable for both eqn:rayleigh and eqn:pless, which leads to\n\n    = B^2/A,   =B^2/A^2,\n\nwith \n\n    A   =(2/3-/)^1/2,     B=Ja (12/π)^1/2,\n\n where Ja is the Jakob number defined as \n\n    Ja=(-())/.\nThe nondimensional radius and time are then expressed as\n\n    = /  and  =t/.\n\n<cit.> reported an analytical formulation for bubble growth rate by combining eqn:rayleigh and eqn:pless in terms of nondimensional parameters proposed by <cit.> as\n\n    d/dt^*=√(t^*+1)-√(t^*).\n \nThe scaling proposed by <cit.> works well only in the later period of the bubble lifetime when the growth is mainly controlled by inertia or thermal diffusion effect. <cit.> later attempted to derive an approximate law of bubble growth based on the theory provided by <cit.> for the bubbles that have grown sufficiently large beyond their critical radius, at least by about an order of magnitude. In addition, they also defined a more general scaling law, which was expected to work also in the surface tension-dominated growth phase, However, the detailed analysis of this scaling law was not reported as they found it to be of less practical interest compared to the former one. The scaling relationships proposed by <cit.> are given in <ref>.The surface tension-controlled growth may become relevant to automotive or cryogenic engine applications, such as injecting superheated liquid fuel into a combustion chamber. Here, the lifetime of the vapor bubbles becomes much shorter as the liquid jet undergoes bursting phenomena once the critical void fraction is reached <cit.>. <cit.> reported that for moderate to high superheating degrees, the onset of droplet burst times, t_b, for highly volatile e-fuel microdroplets are in the order of 𝒪(t_b)≈10^-6-10^-7 s. For the lower superheating degree case, the order of magnitude increases to 𝒪(t_b)≈10^-4 s. Due to the shorter droplet lifetime, the initial surface tension-controlled growth phase of the vapor bubbles becomes equally important to the inertia, transition, and thermal diffusion-controlled growth phases. This is because the shorter the ST growth stage is, the earlier the significant bubble growth starts and vice-versa, thus influencing the bubble-growth characteristics in the later bubble growth stages as well. However, the influence of the ST growth stage on the bubble dynamics becomes negligible when the bubble grows for a long period <cit.>.Recently, <cit.> derived two different analytical solutions for the vapor bubble growth rate in superheated single droplets for high and low Reynolds numbers (Re) using a similar general scaling law to that proposed by <cit.>, but neglected the bubble-bubble interactions in their study. The analytical solutions derived by <cit.> are provided in <ref>.Along these lines, the objectives of this paper can be summarized as follows: (1) to propose a modified Rayleigh-Plesset equation (RPE) for characterizing the growth of vapor bubbles in superheated microdroplets considering bubble-bubble interactions; (2) to highlight the limitations of the numerical solver for simulating the bubble growth with the newly derived RPE in a flash boiling single droplet of highly volatile liquid fuels; (3) to analyze the effect of bubble-bubble interactions on the growth characteristics of the vapor bubbles in superheated microdroplets; (4) to explore a scaling law for evaluating its capability of describing the different bubble growth stages including ST, T, IC, and TD growth for a flash boiling single droplet; and (5) to derive a semi-analytical solution in terms of nondimensional parameters for the bubble growth considering the bubble-bubble interactions to describe the bubble evolution with reasonable accuracy in different growth phases. The manuscript is organized as follows: in Section <ref>, first, we present the bubble growth models for superheated microdroplets with and without considering bubble-bubble interactions. Next, we provide the nondimensional formulations of the governing equations. The details of the computational setup and the solution procedure are shown in Section <ref>. The performance of the proposed bubble growth model is compared with that of the DNS results by <cit.> in Section <ref>. Section <ref> outlines the results from the numerical simulations. Finally, the findings are summarized in Section <ref>.\n\n\n\n§ THEORETICAL FORMULATIONS\n 10pt\n\nThe conventional Rayleigh-Plesset equation (RPE) <cit.> is often used to describe the temporal dynamics of a single vapor bubble in a superheated liquid medium. However, the conventional RPE needs to be modified for the flash boiling microdroplets containing multiple bubbles, where the interaction among bubbles significantly alters the bubble dynamics <cit.>. In this study, we first derive the modified RPE considering the bubble-bubble interactions along with the finite-size effects of the flash boiling microdroplets. In this section, first, we discuss the governing equations of the single isolated vapor bubble growth in an infinite liquid medium and in a finite-size superheated microdroplet. Next, we describe the equations governing the vapor bubble growth in superheated microdroplets considering the bubble-bubble interactions. Finally, we present the nondimensional form of the governing equations.\n\n\n\n §.§ Single isolated vapor bubble growth\n10pt\nThe growth rate of an isolated spherically symmetric vapor bubble in a homogeneous infinite liquid medium can be estimated using the conventional RPE as <cit.>\n\n    ()-_    = d^2/ d t^2_+3/2(d/ d t)^2_+4/d/d t_+2 σ/_,\n\n where (t) denotes the instantaneous vapor bubble radius and  the liquid viscosity. The physical parameters of RPE1 are evaluated at , which is assumed to be equal to the liquid temperature at the liquid-vapor interface <cit.>. In RPE1,  describes the difference between saturated vapor pressure inside the vapor bubble and liquid pressure acting on the bubble surface,  the pressure due to liquid viscosity, and  the pressure due to the surface tension force at the liquid-vapor interface.  and  are the hydrodynamic pressures induced by the surrounding liquid due to the bubble surface acceleration and velocity, respectively. In this study, we denote the total hydrodynamic pressure for the bubble growth without bubble-bubble interactions as =+.For a finite-size single droplet in a quiescent gaseous medium, the conventional RPE can be modified as\n\n    ()-=[(1-/) d^2/ d t^2+(3/2-2 /+^4/2 ^4)(d/ d t)^2]+4 μ_l/d/ d t+2σ/,\n\nwhere (t) denotes the instantaneous droplet radius. In comparison with the conventional RPE shown in RPE1, RPEtrl includes additional inertia terms on the right-hand side given by -(^2/)(d^2/dt^2) and {-2/+^4/(2^4)}(d/dt)^2.  in RPEtrl is given by the mechanical balance between the liquid and the surrounding gas phase as\n\n    =+2 σ/,\n\nwhere  is the surrounding gas pressure. Substituting  into RPEtrl yields\n\n    ()-_=(1-/) d^2/ d t^2_+(3/2-2 /+^4/2 ^4)(d/ d t)^2_+4 μ_l/d/ d t_+2 σ(1/+1/)_.\n\nIt is to be noted that the RPE2 is valid only for a single isolated vapor bubble inside a superheated single droplet.\n\n\n §.§ Vapor bubble growth in a multibubble environment\n10pt\nIn reality, there are multiple bubbles inside the droplet. Thus, the bubble growth rate is also influenced by the interaction between the individual bubbles. Considering the bubble-bubble interactions, the RPE in RPE2 is modified as\n\n    ()-=[d/d t(∑^2/d/ d t)+(1-/) d^2/ d t^2+(3/2-2 /+^4/2 ^4)(d/ d t)^2]\n    +4 /d/ d t\n    +2 σ(1/+1/),\n\nwhere the first term on the right-hand side of RPE3 represents the pressure, , acting on the target bubble surface induced by all the other bubbles. The distance  is measured from the center of the i-th bubble to the center of the target  bubble. The bubbles are assumed to be monodisperse in this study. For simplicity, it is also assumed that the bubbles remain sufficiently far away from each other such that the interactions among the boundary layers across the bubble surface can be neglected <cit.> and the relative position of the bubbles remain unchanged during the vaporization process. A schematic model of the bubble-bubble interactions is shown in Schm_Int. \n\nThe detailed derivation of  is given in <ref>.  can be rearranged as follows <cit.>\n\n    d/d t[∑^2/d/ d t]=d/d t[^2d/ d t∑1/]=d/d t[^2d/ d t∫_0^1/r(n  d v)],\n\nwhere n denotes the number density of the vapor bubbles and n d v the total number of bubbles in an infinitesimal volume of the droplet, dv.Assuming heterogeneous nucleation due to air as dissolved gas, the number density of the vapor bubble nuclei can be estimated using the approximation suggested by <cit.> as\n\n    n=5.757 × 10^12·exp(-5.279  K/Δθ),\n\nwhere Δθ denotes the superheating degree defined as Δθ = -(), with  the droplet bulk temperature and  the droplet boiling temperature at .The integration over the sphere of influence () in prss1 yields\n\n    d/d t[^2d/ d t∫_0^1/r(n  d v)]    =d/d t[^2nd/ d t∫_0^1/r 4 π r^2 d r] \n       =d/d t[2π^2 nd/ d t^2] \n       =2 π n [{d^2/ d t^2+2(d/ d t)^2}+2 ^2(d/ d t)(d/ d t)],\n\nwhere it is assumed that the number of vapor bubbles in the droplet remains constant during the flash vaporization process. Substituting prss2 into RPE3 and rearranging the terms, the modified RPE for spherically symmetric vapor bubbles in a single droplet of radius  considering the bubble-bubble interactions is written as\n\n    ()-_=(1-/+2 π^2 n ) d^2/ d t^2_+(3/2-2 /+^4/2 ^4+4 π^2 n )(d/ d t)^2_+4/d/ d t_\n    +4 π n ^2(d/ d t)(d/ d t)_+2 σ(1/+1/)_,\n\nwhere the superscript ` ' ' denotes the modified pressures acting on the bubble surface for the bubble growth considering the bubble-bubble interactions. The new pressure term, , is the contribution to the total hydrodynamic pressure () due to the expansion velocities of both the bubble and the droplet.  is thus expressed as =++.In this study, the droplet is considered much larger than the vapor bubbles (≫). Thus, the second term of  can be neglected, since the order of magnitude of the bubble to droplet radius ratio, /,  remains very small compared to the first and third terms. Similarly, the contribution from the second and third terms of  also becomes negligible with respect to the first and fourth terms and hence can be neglected. The second term of  can also be neglected, since 1/≫1/. The resulting simplified RPE after neglecting the above-mentioned terms is given as \n\n    ()-_=ρ_l(1+2 π^2 n ) d^2/ d t^2_+(3/2+4 π^2 n )(d/ d t)^2_+4 /d/ d t_\n    +4 π n ^2(d/ d t) (d/ d t)_+2σ/_.\n\nThe saturated vapor temperature, , is obtained by solving the implicit relation as <cit.>\n\n\n    W/d/d t+/3d/d t( W/)=-/δ,\n\n\nwhere W is the molecular weight of the fluid,  the liquid thermal conductivity, and  the universal gas constant. δ in eqn:vap_tmp denotes the thickness of the thin thermal boundary layer adjacent to the bubble surface defined as <cit.> \n\n    δ=(π t/3)^1/2.\n\nThe energy flux at the liquid-vapor interface causes the liquid to vaporize and creates a pressure difference, which is then balanced in the RPE by the hydrodynamic terms (IC growth stage), the surface tension term (ST growth stage)), or both (T stage).In this study, the vapor bubbles are assumed to grow until a critical void fraction value is reached. The void fraction, ε, is defined as <cit.>\n\n    ε=V_bubble/V_bubble+V_droplet,\n\nwhere V_droplet describes the volume of the liquid droplet and V_bubble the total volume of the vapor bubbles. The droplet is considered to burst once the void fraction exceeds its critical limit (ε≥ε_crit). The critical void fraction value of 0.55 is chosen here for all simulated test cases <cit.>.\n\n\n\n\n §.§ Nondimensionalization of the governing equations\n 10pt\nThe RPE is nondimensionalized using the critical bubble radius, ,  as the length scale, A as the velocity scale (eqn:LienAB), and the time scale, =/A <cit.>:\n\n\n    _k   =R_k/,   Ṙ_k^+ = Ṙ_k/A,   =t/,   =/;\n       =/,    =P/ A^2,    =σ/σ_0,   =n^3,\n\n\nwhere the subscript `k' can be replaced by subscripts `d' and `b' for droplet and bubble quantities, respectively. The superscript ‘+’ denotes the nondimensional quantities and the subscript ‘0’ represents the initial values.The resulting nondimensional RPE for a spherically symmetric vapor bubble, considering the bubble-bubble interactions, in a finite-size single droplet of radius  is given as \n\n\n    -_=(1+2 π) d^2/ dt^+2_+(3/2+4 π)(d/ d)^2_+4//Red/ d_\n    +4 π(d/ d) (d/ d)_+2/We1/_.\n\n\nRPEndwB can be simplified for the bubble growth without bubble-bubble interactions as\n\n    -_   =d^2/d_+^+3/2(d/d)^2_+4//Red/d_+2 /We1/_.\n\n\nRe and We are the Reynolds number and Weber number defined as\n\n    Re=ρ_l A R_c/μ_l0.5cmand0.15cm  We=ρ_l A^2 R_c/σ_0=4/3.\n\nThe derivation of the nondimensional RPE with and without bubble-bubble interactions is given in <ref>.\n\n\n\n§ NUMERICAL METHODOLOGY\n\n\nIn this work, a square box of size 0.54 m × 0.54 m × 0.54 m with no-slip walls is chosen as the simulation domain. The schematic of the simulation domain is shown in Schm. A superheated single droplet with a diameter of 200 m is placed at the center of the domain. Although a spherical droplet is introduced into a three-dimensional computational domain, the complete problem is reduced to the solution of an ordinary differential equation in zero dimension by assuming the spherical symmetry of the droplet and considering the surrounding flow field as frozen. \n\nThe droplet is considered to be stationary. Inert gas nitrogen is used as an ambient medium and the chemistry in the gas phase is neglected. The temperature and pressure inside the liquid droplet are assumed to be homogeneous. The vaporization from the droplet's external surface is neglected in this study due to its negligible contribution compared to internal vaporization. The reader is referred to <cit.> for a more detailed discussion regarding coupled internal and external vaporization under superheated operating conditions. It is to be noted that the size of the square box and the subsequent spatial discretization were chosen such that they have no influence on the bubble dynamics presented in this study due to the assumptions of the frozen surrounding flow field.\n\n\n\nThe nondimensional RPEs are advanced using a fixed time-step second-order Runge-Kutta (RK) scheme. RPEndwB is solved for the case with bubble-bubble interactions. Whereas for the case without bubble-bubble interactions, eqn:nd_RPE1 is solved assuming monodisperse vapor bubbles of the number density of n in an infinitely large single droplet (≫). The bubble growth is initiated by perturbing the bubble critical radius, , by 10^-4%. A detailed discussion on the influence of initial perturbation on the bubble dynamics has been provided by <cit.> and <cit.>. The temperature inside the vapor bubble, , is obtained by iteratively solving eqn:vap_tmp using the Newton-Raphson method.\n\n\n\n\n§ MODEL VALIDATION\n\nIdeally, the proposed ROM needs to be validated at a microscopic level in two steps. First, the validation with experimental measurements of single isolated vapor bubbles is required to ensure that the model is able to accurately capture the single bubble growth in a superheated liquid medium. In the second step, the validation must be performed using flash boiling single droplet experimental measurements in the presence of multiple bubbles. The present model has already been validated in a previous publication <cit.> at the single isolated bubble level, which is shown here for completeness in <ref>, and a further comparison with the single isolated bubble simulation by <cit.> will be shown in the following. Additionally, the performance of the proposed reduced-order bubble growth model with bubble-bubble interactions is compared against the DNS of multiple bubbles with variable expansion rate performed by <cit.> in terms of the volumetric expansion of a superheated LOx fuel droplet. A single droplet including 221 vapor bubbles was simulated for this purpose. The initial perturbation in  was chosen based on their single isolated bubble reference solution. The volume of the droplet was considered to be equivalent to that of the cylindrical liquid jet of <cit.>. DNSVald2 depicts the comparison of the nondimensional volumetric expansion of the LOx droplet for the isolated bubble and the bubble-bubble interaction case with the DNS results. For the single isolated bubble simulations, both the DNS and the ROM predict a similar volumetric expansion of around 75 %, as can be seen from DNSVald2. It is observed that the present ROM predicts a volumetric droplet expansion of around 7.5 % for the case with bubble-bubble interactions, whereas the multibubble DNS with variable expansion rate results in approximately a 5 % increase in the volume of the liquid jet. This demonstrates the strong impact of bubble interactions in the present case. The simulation is continued only up to t=0.45s, as this marks the minimum time required to the onset of bubble merging for the <cit.> case. The resulting overprediction from the ROM in the volumetric expansion for the bubble-bubble interactions case is reasonably small compared with the total effect of bubble interactions and can be attributed to the assumptions considered in its derivation such as spherically symmetric monodisperse vapor bubbles and homogeneous pressure and temperature distribution in the liquid droplet. Overall, it can be concluded that the proposed ROM is capable of predicting the considerably smaller volume expansion in presence of the bubble-bubble interactions with reasonable accuracy. \nAt a macroscopic scale, the present bubble growth model could be validated by applying it to the primary breakup simulation of the flash boiling spray case and comparing the droplet size distributions in the near-nozzle regime obtained from the simulations with the experiments. This validation at a macroscopic level is beyond the scope of the present article and will be left for future work.\n\n\n§ RESULTS AND DISCUSSION\n 10pt\n\nIn order to accurately and efficiently describe the vapor bubble growth rate in superheated microdroplets, it is necessary to consider the following three sub-problems: (1) the limitations of the numerical solver, (2) the influence of bubble-bubble interactions, and (3) nondimensional analysis of vapor bubble growth. In this section, considering high volatility e-fuels, such as short-chain oxymethylene ethers (OME_x) as a generic example, first, the issues related to the use of large time-steps are illustrated for the simulation of highly volatile liquid fuels under various operating conditions considering the bubble-bubble interactions. Next, the influence of the bubble-bubble interactions on the dynamics of the vapor bubble growth in superheated microdroplets is described. Then, the applicability of different scaling laws in describing the bubble growth in a flash boiling single droplet is highlighted under subatmospheric operating conditions. After that, the nondimensional RPE is used to evaluate the relative importance of different forces acting on the bubble surface. Finally, based on the nondimensional analysis, a semi-analytical solution is proposed for the bubble growth in terms of nondimensional parameters and validated with the numerical solution of the RPE.\n\n\n\n §.§ Limitations of the numerical solver\n\n\nSaha567wB shows the variation of bubble growth rate for different time-step sizes for  microdroplets under two different operating conditions considering the bubble-bubble interactions. For Δθ=135 K, it is observed that the time-step size of Δ t=1×10^-9 s causes the growth rate to become negative in the very beginning (see Saha567wBa), which then causes an increasing vapor temperature, as shown in Saha567wBb. The simulation is not continued further since the Newton-Raphson iteration estimates an unrealistically negative vapor temperature with the negative bubble growth rate in the next time-step. As the time-step size is decreased to Δ t=1×10^-10 s, the bubble evolves well in the very beginning. However, it shows a sudden jump in growth rate at around 7 ×10^-4 s, followed by a sharp decline at 9 ×10^-4 s. A sudden drop in vapor temperature can also be seen from Saha567wBb due to a sudden rise in bubble growth rate. Nevertheless, the bubble growth rate increases further in time and subsequently results in decreasing . This fluctuating growth behavior does not appear to be physical <cit.>. The time-step sizes are then further reduced to Δ t=1×10^-11 s and Δ t=5×10^-12 s, which are found to eliminate the spurious fluctuations in the bubble growth rate curve, as obtained earlier with the larger time step sizes. All the physical phenomena associated with the bubble growth such as the surface-tension dominated extremely slow growth stage, followed by the rapid bubble surface acceleration and subsequent gradual deceleration are captured with the reduced Δ t. Qualitatively, these results are in good agreement with previous publications <cit.>. Saha567wBc & Saha567wBd depict the bubble growth rate and vapor temperature variation for Δθ=120 K. Similarly, Δ t=1×10^-9 s and \nΔ t=1×10^-10 s  result in unrealistic growth rates and vapor temperatures, whereas Δ t=1×10^-11 s and Δ t=5×10^-12 s correctly predict the evolution of the bubble. The numerical issue with the time-step size is also demonstrated using another highly volatile cryogenic e-fuel microdroplets of DME and the results are included in <ref>.The numerical results described above are obtained using the explicit RK solver as mentioned in CompStSolPrc. An implicit ODE solver CVODE, which includes variable time-step, variable-order backward differentiation formulas, is also employed in this study to simulate the bubble growth characteristics. It is observed that the CVODE solver produces spurious fluctuations in the bubble growth rate curve near the beginning of the T growth stage. The simulation results obtained from the CVODE solver are shown here for Δθ=90 K with Δ t=1×10^-9 s in Saha19a. As the time-step size is reduced to Δ t=1×10^-10 s, the bubble growth rate is found to be well predicted by the CVODE solver similarly to the explicit RK solver, as shown in Saha19b. However, due to its implicit nature, the computational cost associated with the CVODE solver is higher compared to the explicit RK solver. For example, the simulated case with the CVODE solver is run on a machine using the Intel Broadwell processor architecture on a single core for 1.2585 CPUh, whereas the same case with the explicit RK solver is run on the same machine on a single core for 0.0186 CPUh.\n\n\n\n §.§ Influence of bubble-bubble interactions on the bubble dynamics\n\nThe comparison between the bubble growth characteristics of  microdroplets with and without bubble-bubble interactions is shown in Bubbub1 for =0.3 bar, =434.72 K, and Δθ=150 K. It can be seen that the bubble growth characteristics are significantly influenced by the bubble-bubble interactions once the bubbles surpass the T stage and enter into the IC growth stage. Bubbub1a depicts that the bubble-bubble interactions cause much slower expansion of the bubbles. This is because the additional pressure force induced by the surrounding growing bubbles on the target bubble surface markedly reduces its growth rate in the IC growth stage, as illustrated in Bubbub1b. It is also observed from Bubbub1b that the rate at which the vapor temperature decreases considering the bubble-bubble interactions decreases substantially in this growth stage and subsequently reduces the positive thermal feedback at the bubble surface, which is proportional to =-. The higher hydrodynamic pressure emerging from the bubble-bubble interactions in the IC growth stage is eventually the reason behind this phenomenon, which is depicted in Bubbub2. \n\nFrom Bubbub1b, it is interesting to note that the vapor temperature curve for the bubble growth with bubble-bubble interactions shows a gradual rise near the onset of droplet bursting. This phenomenon can be explained as follows: the mass within the bubbles increases in time as the surrounding superheated liquid becomes vapor due to the continuous energy flux at the bubble surface. The increasing mass causes a build-up of vapor pressure inside the bubbles. The bubbles then grow in size such that this excess of pressure can be relaxed. Since the vapor inside the bubbles is assumed to be saturated, a reduction in  also lowers the vapor temperature . However, for the bubble growth considering the bubble-bubble interactions, a gradual rise in  near the onset of the droplet bursting suppresses the bubble growth, and subsequently the bubble surface acceleration (as shown in Bubbub2a) to such an extent that the vapor pressure continues to build up due to the slower growth of the vapor bubbles, and thus leading to an increase in vapor temperature near the onset of droplet bursting, as shown in Bubbub1b. The faster droplet expansion in this regime eventually increases  (as can be seen from Bubbub2b) in the later period of IC growth, which in turn, causes the total hydrodynamic pressure,  to increase (note that the slope of  curve changes from negative to positive in the IC growth stage). Whereas for the bubble growth without the bubble-bubble interactions,  continues to decrease in the IC growth stage due to the absence of the additional pressure force term, . Thus, the vapor temperature also shows a continuous decline in time, as shown by the blue dash-dotted line in Bubbub1b. Due to the slower growth of the vapor bubbles, the onset of droplet bursting is also considerably delayed for the bubble growth with bubble-bubble interactions. The variation of the nondimensional pressure terms due to the viscous and surface tension forces is not shown as the bubble-bubble interactions are found to have negligible influence on these forces.The dimensionless volume of the  fuel droplet is shown in Bubbub3 for the bubble growth with and without bubble-bubble interactions up to 2.67 s, which marks the onset of droplet bursting for the later case. It is observed that the volumetric expansion of the liquid droplet is significantly smaller in presence of bubble-bubble interactions. It can be seen that the droplet volume has increased by only 23% after 2.67 s when considering bubble-bubble interactions. Conversely, the case without bubble-bubble interactions leads to an increase in droplet volume by approximately 120% within the same time interval. \n\n\n\n §.§ Scaling law for superheated microdroplets\n\nThe scaling relationships of <cit.> (eqn:AB) work well only for the later bubble growth stages when the bubble surpasses the T stage and enters into the IC or TD growth stage <cit.>. This is expected because the effect of surface tension, which remains a dominating factor during the first two growth stages <cit.>, is not considered in the <cit.> formulation. The <cit.> scaling law (Pros) also shows a behavior similar to the <cit.> scaling law because it assumes a linear variation of saturated vapor pressure with temperature and constant physical properties in the formulations to describe the scaled bubble growth behavior.In real engine conditions, liquid jets or droplets will not remain intact for a long period. They will rupture within a very short period (in the order of microseconds) due to the rapid growth of multiple vapor bubbles. Thus, the scaling laws, eqn:AB and Pros, which work well in later bubble growth stages when the bubbles are grown sufficiently large beyond their critical radius, will not be applicable for the realistic engine conditions. This is illustrated in Saha9a, where the temporal variations of nondimensional bubble radii of  microdroplets are plotted using the <cit.> scaling law considering the bubble-bubble interactions for various operating conditions, as listed in OMcases. Hence, the need arises for a more general scaling law, which reasonably models not only the later IC and TD growth stages but also the initial ST growth stage. \n\n\n\n\nSaha9b shows the variation of dimensionless bubble radii plotted with eqn:scl_qnt1 considering the bubble-bubble interactions for the similar pressure and temperature ranges, as shown in OMcases. It can be seen from Saha9b that all the dimensionless radius curves merge into a single curve of value unity in the regime of ST growth. In the later growth stages, however, the scaled radius-time curves do not perfectly collapse into a single curve. Thus, it is difficult to describe a reasonably accurate universal bubble growth behavior with a relation of the form\n\n    = f().\n \n\n\n §.§ Dimensional analysis of the modified RPE\n\nIn this section, first, a dimensional analysis of the modified RPE (RPEndwB) is performed to determine the magnitude of the different nondimensional force terms acting on the bubble surface for Reynolds numbers of different orders of magnitude. Based on the dimensional analysis, a semi-analytical solution for the bubble growth is then derived in terms of nondimensional parameters considering the bubble-bubble interactions to mitigate the numerical issues described in Limit. Finally, the proposed semi-analytical solution is validated with the numerical solution of the modified RPE.Saha10wB illustrates the variation of  for three different Re with bubble-bubble interactions. The physical parameters and their values corresponding to the different Reynolds number cases are listed in Recases. It is to be noted that the definition of the Re shown in ReWe allows a maximum value of Re in the order of the magnitude of 2, which corresponds to a very low superheating degree case (Δθ≈𝒪(10^-2 K)). In this study, we have considered three different Re of 31.35, 5.06, and 0.85, termed as high Reynolds number (`HRe'), moderate Reynolds number (`MRe'), and low Reynolds number (`LRe'), respectively. \n\n\nIt can be seen from Saha10wBa that for the case of `HRe', the order of magnitude of  is negligible throughout the whole bubble lifetime compared to the other terms. However, with decreasing Re, the influence of  becomes important already in the later period of the ST growth stage, as shown in Saha10wBc for `LRe'. The order of magnitude of  starts to become important towards the end of the ST growth stage and becomes negative in the transition stage with gaining importance for later times. Nevertheless, as the Re is reduced, the rate of decrease in  also decreases. Thus, it can be concluded that  becomes less important in determining the bubble growth characteristics compared to  as the Re is reduced from 31.35 to 0.85. Since  has a tendency to become less significant with decreasing Re, we neglect this term in the following to derive an approximate semi-analytical solution of RPEndwB. The effect of neglecting  on bubble growth behavior will be discussed later in detail. Neglecting , RPEndwB becomes\n\n    -=(3/2+4 π)(d/ d)^2+4//Red/ d+4 π(d/ d) (d/ d)+2/We1/.\n\nDefining\n\n    X = (3/2+4 π),\n\n\n    Y = 4{/Re+ π(d/ d)},\n\n\n    Z = {2/We1/-(-)},\n\nRPEnd34 becomes\n \n\n    X(d/ d)^2+Y(d/ d)+Z=0.\n\nTreating RPEnd6 as a quadratic equation for d/d, it can be analytically solved for d/d as\n\n    (d/ d)=-Y±√(Y^2-4XZ)/2X.\n\nReplacing X, Y, and Z from A, B, and C, respectively, into RPEnd5 and assuming the temporal variation of , , and , to be negligible, one obtains\n\n    (d/ d)=-2{1/Re +π(d/ d)}/3/2+4 π+[4{1/Re+π(d/ d) /3/2+4 π}^2 - {2/We-(-)}/(3/2+4 π)]^1/2.\n\nThe negative root does not have physical significance in the context of vapor bubble growth in superheated microdroplets, and therefore is neglected in this study. RPEnd7 describes the simplified semi-analytical solution for the bubble growth, which needs to be numerically integrated to obtain the bubble radius. The assumptions considered to derive RPEnd7 are summarized as: (1) spherical symmetric bubble; (2) /≪ 1; (3) = constant; (4) ≈ 0, and (5) ≈ ≈ ≈ 1.Saha1314wB compares the numerically obtained nondimensional radius-time behavior of the  vapor bubble with the dimensionless semi-analytical solution for three Reynolds numbers of 31.35 (Saha1314wBa), 5.06 (Saha1314wBb), and 0.85 (Saha1314wBc), as listed in Recases. The three different Re cases are chosen based on the different superheating degrees ranging from very low (θ = 6 K) to super-high (θ = 150 K) values. We have considered the numerical solution of the modified RPE (RPEndwB) as the reference to validate the proposed semi-analytical solution. It is observed from Saha1314wB that the semi-analytical solution underpredicts the bubble growth behavior for all the investigated cases. This is expected due to the neglection of the acceleration term in the derivation of RPEnd7. Nevertheless, it can be seen that the underprediction reduces with decreasing Re. This is because the acceleration term becomes less significant with decreasing Re as also revealed by the analysis of the order of magnitude of the different pressure terms in Saha10wB. Overall, it can be concluded that the simplified nondimensional semi-analytical solution provides a good approximation of the bubble evolution for the whole bubble lifetime.\nIt has to be noted that the derived semi-analytical solution does not depend on the source (e.g., turbulence, throttling effect, etc.) and location of inception (e.g., inside or outside of the injector nozzle) of the vapor bubble. As soon as a bubble nucleates in a superheated liquid medium, it can be used to reasonably predict the bubble evolution until the liquid jet (or droplet) bursts even with the larger time-step sizes compared to the numerical approach.\n\n\n\n §.§ Computational cost\n\nThe proposed semi-analytical solution is found to accurately predict the bubble growth behavior with a time-step size of Δ t=1×10^-8 s, whereas a much smaller time-step size is required by the numerical solver (as described in Limit), thus substantially increasing the required number of time-steps. In order to demonstrate the capability of the derived semi-analytical solution, the numerical and semi-analytical predictions of the bubble growth characteristics for  microdroplet are shown in Saha11 for =0.8 bar, =428.71 K, and Δθ=120 K with Δ t=1×10^-8 s. It is observed in Saha11 that the semi-analytical solution accurately captures the growth characteristics of the vapor bubbles regardless of the large time-step size, whereas the numerical approach results in an unphysical bubble growth rate and vapor temperature, as described in Limit.\nFive different cases with superheating degrees ranging from 80 K (Case `A-80') to 150 K (Case `E-150') are investigated to illustrate the reduction of the computational cost with the derived semi-analytical formulation. In this work, all the simulations are performed on machines using the Intel Broadwell processor architecture. The simulation parameters are listed in Cost. The semi-analytical solution is found to accelerate the computing speed significantly for all the investigated cases, as shown by factor x in Cost.  Thus, for large-scale spray simulations with millions of microdroplets <cit.>, the semi-analytical solution would be very beneficial to speed up the whole computation process.\n\n\n\n §.§ Limitations of the proposed ROM\n\nSeveral assumptions were made in the derivation of the modified RPE (RPE5), such as constant bubble number density, monodisperse and spherically symmetric vapor bubbles, and sufficiently large inter-bubble spacing, which may not always hold true in comparison to the practical scenario. It has to be noted that while the assumptions are being made, the proposed model is closer to reality than completely neglecting the interactions. A more advanced subgrid-scale model for bubble growth may be derived by relaxing these assumptions. For example, polydisperse vapor bubbles arranged randomly in a superheated microdroplet could be considered. However, such an advanced modeling approach requires solving the RPE for each of the vapor bubbles present in the superheated droplet. This is also likely to increase the computational cost for large-scale sprays due to the presence of millions of microdroplets with multiple polydisperse vapor bubbles. Although it is necessary to study the dynamics of the droplet-bubble system with the above-mentioned advanced modeling strategy, the actual need for such models in predicting global spray characteristics should be determined based on the comparative analysis of cost-accuracy trade-off for different subgrid-scale bubble growth models with varying degrees of simplification.\n\n\n\n\n§ CONCLUSIONS\n 10pt\n\nA new ROM for vapor bubble growth considering the bubble-bubble interactions in superheated microdroplets is proposed in this study. The model performance is compared with the DNS performed by <cit.>. The present reduced-order bubble-growth model was shown to capture the trend in considerably smaller volumetric droplet expansion relative to the single isolated bubble case. It was found that the bubble-bubble interactions significantly influence the bubble growth characteristics once the bubble surpasses the transition growth stage. The additional inertial force, , emerging from the bubble-bubble interactions was found to markedly reduce the bubble growth rate, and thus, significantly delay the onset of droplet bursting.The numerical challenges associated with the proposed bubble growth model for the accurate prediction of the vapor bubble growth process were highlighted for highly volatile liquid fuels using OME_x as a generic example. It was found that for certain operating conditions, the numerical approach requires an extremely small time-step size to accurately capture the bubble growth rate as well as the temperature at the liquid-vapor interface, thus hindering the simulation of large-scale flash boiling spray cases due to the high computational cost associated with it. Realizing the need for developing a simple correlation for bubble growth, a scaling law was first explored in this study to assess its ability to characterize bubble growth for superheated microdroplet cases under subatmospheric operating conditions. It was observed that the scaling law does not result in a perfect collapse of the scaled radius-time curves over the whole lifetime of the vapor bubble.To derive a simplified solution of the modified RPE, a dimensional analysis was performed for different orders of magnitudes of Reynolds numbers. It was revealed that the nondimensional acceleration term possesses much lower significance in determining the bubble growth characteristics as the order of magnitude of the Re is decreased from 𝒪(10^1) to 𝒪(10^0). Thus, neglecting this term, a simple semi-analytical solution was derived for the bubble growth rate considering the bubble-bubble interactions and validated for different operating conditions against its numerical solution. The derived semi-analytical solution for bubble growth was found to provide a good approximation of the bubble radius as a function of nondimensional time. A posteriori computational cost analysis for the single droplet cases also revealed that the proposed semi-analytical solver is significantly faster compared to the numerical solver; thus, it may be used in many practical applications including but not limited to flash-boiling spray simulations with millions of single droplets in automotive or cryogenic engines, where tracking of bubble growth phases in an individual droplet by solving the full RPE simultaneously with the energy balance at the liquid-vapor interface may be computationally very expensive.\n\n\n§ ACKNOWLEDGEMENTS\n\nThis work was performed as part of the Cluster of Excellence “The Fuel Science Center”, which is funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) under Germany’s Excellence Strategy – Exzellenzcluster 2186\n“The Fuel Science Center” ID: 390919832.\n\n\n§ PREVIOUS SCALING RELATIONSHIPS AND NONDIMENSIONAL ANALYTICAL SOLUTIONS\n\n\n\n §.§ Scaling laws\n\nThe first scaling law proposed by <cit.> based on the theory provided by <cit.> is given by \n    =C^2/,   t̃=D C^2 t,\n\nand\n\n    C=(2 σ() /9π)^1/2/{[-]}^-1/2/(-()),\n\n\n    D=[-]^3/2/2 σ() ^1/2,\n\nwhere `' implies nondimensional quantities. The physical parameters of Cconst and Dconst are evaluated at (), except σ. The second scaling law proposed by <cit.> is given by \n\n    =/,   t̂=Dt,\n\nwhere `' denotes nondimensional quantities.\n\n\n §.§ Analytical solutions\n\nThe nondimensional analytical solutions derived by <cit.> are expressed as\n\n    d^+/dt^+=√(2/3(-){1-(1/^+)^3}-2/^+We{1-(1/^+)^2})  for high Re,\n\nand\n\n    d^+/dt^+=-4/3^+Re + √((4/3^+Re)^2-{4/3^+We-2/3(-)})  for low Re,\n\n\n\n\n§ DERIVATION OF THE PRESSURE FORCE DUE TO BUBBLE-BUBBLE INTERACTIONS\n\nLet us consider a spherically symmetric superheated microdroplet consisting with multiple bubbles. The pressure force, , induced by the i-th bubble on the target bubble, located at the center of the droplet can be obtained by solving the continuity and momentum equations for an inviscid incompressible liquid flow <cit.>. The one-dimensional momentum and continuity equations in spherical coordinates are given by:\n\n    ∂/∂ t+∂/∂ r=-1/∂/∂ r,\n\n\n    ∂/∂ r( r^2)=0,\n\nwhere (r,t) describes the velocity in the liquid phase relative to the interface, r denotes the radial coordinate with the origin at the droplet center, and t is the time. Integrating the continuity equation (Cont1) in radial direction yields\n\n    (r, t)=F(t)/r^2.\n\nF(t) can be obtained by prescribing the kinematic boundary condition at the bubble surface.The vapor mass flow rate for a single bubble can be computed as \n\n    ṁ_b=4π^2ρ_vd/d t+4/3π^3dρ_v/dt,\n\nwhere  is the saturated vapor density at . Neglecting the second term on the right-hand side of mdotb1, as it can be shown to be very small compared to the first term, ṁ_b can be expressed as <cit.>\n\n    ṁ_b=4π^2ρ_vd/d t.\n\nEquating mdotb with the inward liquid mass flux yields\n\n    u_l,a=d/d t,\n    \n    u_l,a=/d/d t,\n\nwhere subscript `a' represents absolute quantity and  the saturated liquid density at . Thus, the relative velocity of the liquid across the interface (r=R_b),\n\n    (, t)=d/d t-()/d/d t=[1-()/] d/d t.\n\nSubstituting uR1 into Cont2, F(t) at the liquid/vapor interface can be obtained as\n\n    F(t)=[1-ρ_v()/] ^2d/d t.\n\nAssuming ≪, Ft becomes\n\n    F(t)=^2d/d t.\n\nSubstituting F(t) into Cont2 yields,\n\n    u(r, t)=^2/r^2d/d t.\n\nReplacing u(r,t) in Cont2 with uR2 yields\n\n    ∂/∂ t(^2/r^2d/d t)+(^2/r^2d/d t) ∂/∂ r(^2/r^2d/d t)=-1/∂/∂ r.\n\nAssuming (r→∞,t)=0 and integrating Mom2 along r,  can be expressed as\n\n    =/rd/d t(^2 d/d t)+O(1/r^4).\n\nNeglecting the higher order term in Pint and summing over multiple bubbles,  finally becomes\n\n    =d/dt(∑^2/d/ d t).\n\n\n\n\n\n\n§ DERIVATION OF THE NONDIMENSIONAL RPE\n\nThe RPE for an isolated spherically symmetric vapor bubble in a homogeneous infinite liquid medium is given by\n\n    -    = [d^2/ d t^2+3/2(d/ d t)^2]+4/d/d t+2 σ/.\n\nThe modified RPE for spherically symmetric vapor bubble in a single droplet of radius  considering bubble-bubble interactions is given by \n\n    -=[(1+2 π^2 n ) d^2/ d t^2+(3/2+4 π^2 n )(d/ d t)^2]+4 /d/ d t\n    +4 π n ^2(d/ d t) (d/ d t)+2σ/.\n\nSubstituting the following relationships\n\n    =/,   =/A,   =t/τ,   =/,   =n^3;\n       =/,    =P/ A^2,    =σ/,   =/,\n\ninto RPE11 yields,\n\n    (-) A^2= A^2d^2/d+ A^23/2(d/ d)^2+4 A/d/d+2 σ^+σ_0/.\n\nDividing both sides of RPEnd1 by A^2 one obtains\n\n    -=d^2/d+3/2(d/ d)^2+4/ Ad/d+2 σ^+σ_0/ A^2.\n\nDefining Re= A/ and We= A^2/, the nondimensional RPE for an isolated vapor bubble in an infinite liquid medium without bubble-bubble interactions is expressed as \n\n    -=d^2/d+3/2(d/ d)^2+4/Red/d+2 σ^+/We.\n\nSubstituting the scaling relations shown in eqn:scl_qnt into RPEMod yields\n\n    (-) A^2= A^2(1+2 π)d^2/d+ A^2(3/2+4 π)(d/ d)^2+4 A/d/d\n    +4π A^2(d/d)(d/d)+2 σ^+σ_0/.\n\nDividing both sides by A^2, RPEnd4 becomes\n\n    -=(1+2 π)d^2/d+(3/2+4 π)(d/ d)^2+4/ Ad/d\n    +4π(d/d)(d/d)+2 σ^+σ_0/ A^2.\n\nSubstituting Re= A/ and We= A^2/, the nondimensional RPE of a spherically symmetric vapor bubble in a single droplet configuration considering bubble-bubble interactions is given by\n\n    -=(1+2 π)d^2/d+(3/2+4 π)(d/ d)^2+4/Red/d\n    +4π(d/d)(d/d)+2 σ^+/We.\n\n\n\n\n§ MODEL VALIDATION RESULTS AT SINGLE ISOLATED BUBBLE LEVEL\n\nWaterVald shows the validation of the bubble growth model for a single isolated vapor bubble growth in a homogeneous infinite superheated liquid water medium. The reader is referred to <cit.> for more details about the simulation setup considered for this validation. \n\n\n\n\n§ LIMITATIONS OF THE NUMERICAL SOLVER FOR DME\n\nThe numerical issue with the time-step size is also demonstrated using another highly volatile cryogenic e-fuel microdroplets of DME in Saha8910wB for Δθ=150 K (Case `DM-150'), Δθ=100 K (Case `DM-100'), and Δθ=80 K (Case `DM-80'), with bubble-bubble interactions. The simulation parameters are listed in LMCases2. As described for  microdroplets, the smaller time-step size is also required for the accurate prediction of vapor bubble growth in DME microdroplets. For a very high superheating degree of Δθ=150 K, the time-step size needs to be further reduced to the order of picoseconds (𝒪(10^-12 s)) to avoid unphysical prediction of bubble growth and vapor temperature.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}