{"entry_id": "http://arxiv.org/abs/2303.07118v1", "published": "20230313135107", "title": "Ramsey interferometry with arbitrary coherent-population-trapping pulse sequence", "authors": ["Ruihuan Fang", "Chengyin Han", "Bo Lu", "Jiahao Huang", "Chaohong Lee"], "primary_category": "physics.atom-ph", "categories": ["physics.atom-ph", "quant-ph"], "text": "\n\n\n\n\n\n\nGuangdong Provincial Key Laboratory of Quantum Metrology and Sensing & School of Physics and Astronomy, Sun Yat-Sen University (Zhuhai Campus), Zhuhai 519082, China\nState Key Laboratory of Optoelectronic Materials and Technologies, Sun Yat-Sen University (Guangzhou Campus), Guangzhou 510275, China\nCollege of Physics and Optoelectronic Engineering, Shenzhen University, Shenzhen 518060, China\n\n\nCollege of Physics and Optoelectronic Engineering, Shenzhen University, Shenzhen 518060, China\n\n\n\nCollege of Physics and Optoelectronic Engineering, Shenzhen University, Shenzhen 518060, China\n\n\n\nhjiahao@mail2.sysu.edu.cn; eqjiahao@gmail.com\nGuangdong Provincial Key Laboratory of Quantum Metrology and Sensing & School of Physics and Astronomy, Sun Yat-Sen University (Zhuhai Campus), Zhuhai 519082, China\nCollege of Physics and Optoelectronic Engineering, Shenzhen University, Shenzhen 518060, China\n\n\nchleecn@szu.edu.cn\nCollege of Physics and Optoelectronic Engineering, Shenzhen University, Shenzhen 518060, China\n\n\n\n\n             \n\n\n  \n  Coherent population trapping (CPT) is a multi-level quantum coherence phenomenon of promising applications in atomic clocks and magnetometers.\n  \n  Particularly, multi-pulse CPT-Ramsey interferometry is a powerful tool for improving the performance of CPT atomic clocks.\n  \n  Most studies on multi-pulse CPT-Ramsey interferometry consider periodic pulse sequence and time-independent detuning.\n  \n  However, to further improve the accuracy and precision, one may modify the spectrum symmetry which involves pulse sequence with time-dependent detuning or phase shift.\n  \n  \n  \n  Here, we theoretically analyze the multi-pulse CPT-Ramsey interferometry under arbitrary pulse sequences of time-dependent detuning and obtain a general analytical formula.\n  \n  Using our formula, we analyze the popular CPT-Ramsey interferometry schemes such as two-pulse symmetric and antisymmetric spectroscopy, and multi-pulse symmetric and antisymmetric spectroscopy.\n  \n  Moreover, we quantitatively obtain the influences of pulse width, pulse period, pulse number, and Rabi frequency under periodic pulses.\n  \n  Our theoretical results can guide the experimental design to improve the performance of atomic clocks via multi-pulse CPT-Ramsey interferometry.\n  \n\n\nRamsey interferometry with arbitrary coherent-population-trapping pulse sequence\n    Chaohong Lee\n    March 30, 2023\n================================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nCoherent population trapping (CPT) is a phenomenon of atoms trapped in a coherent state that does not interact with external laser fields.\n\nSince the first observation of CPT spectrum <cit.>, it has been extensively utilized in various applications of quantum engineering and quantum sensing, such as all-optical manipulation <cit.>, atomic cooling <cit.>, atomic clocks <cit.>, and atomic magnetometers <cit.>.\n\nConventionally, CPT spectroscopy has the drawback of power broadening caused by strong CPT light power.\n\nUsing two CPT pulses to perform CPT-Ramsey interferometry can narrow the spectral linewidth and improve the signal-to-noise ratio (SNR) <cit.>.\n\n\nIn this case, the linewidth of CPT-Ramsey spectrum can be narrower as the interval dark time between the two pulses increases <cit.>.\n\n\n\nAs the demands for higher measurement precision and accuracy grow, various techniques are developed to improve the spectrum SNR and resolution, as well as mitigate light shift.\n\n\nThe multi-pulse CPT-Ramsey interferometry has been developed in recent years <cit.>.\n\nThe spectrum linewidth can be narrowed and meanwhile, the central peak can be identified due to the multi-pulse interference.\n\n\n\nUnderstanding the mechanism of multi-pulse CPT-Ramsey interferometry is beneficial to designing suitable CPT pulse sequences for frequency measurement.\n\nSome typical multi-pulse CPT-Ramsey schemes can be analytically analyzed.\n\nFor example, under multiple pulses with identical periods and duration, one can explain the multi-pulse CPT-Ramsey interference using a simple model based on the Fourier analysis of the CPT pulse sequence <cit.>.\n\nThe Fourier analysis introduces a characteristic number N_s as the spectrum will reach steady-state for large pulse number N <cit.>.\n\nThe other analytical treatment is to compare the multi-pulse CPT-Ramsey interferometry to the Fabry-Pérot resonator,\n\nwhich is valid from periodic CPT pulse sequence <cit.> to arbitrary time-independent CPT pulse sequence <cit.>.\n\nHowever, to further improve the performances one may need to modulate the pulse detuning or phase shift with time.\n\nFor example, the auto-balance technique uses a detuning change during the dark time to modify the symmetry of the spectrum to achieve real-time clock servo.\n\nThe frequency shift and phase jump have been applied to change the vertical symmetry of the spectrum and are used as the additional variables in auto-balanced CPT <cit.>.\n\nMoreover, for quantum lock-in amplifier <cit.>, one may even use the mixing between the alternating magnetic field and CPT pulse sequence.\n\nThe alternating magnetic field may also induce alternating detuning.\n\nThe modulation of frequency or phase has been applied in experimental CPT schemes and become a potential technique.\n\nThus the analytical analysis of multi-pulse CPT-Ramsey interferometry under time-dependent detuning and arbitrary pulse phase is of great importance and broad applications.\n\nIn this article, we study the multi-pulse CPT-Ramsey interferometry with arbitrary CPT pulse sequences.\n\nIn particular, when the single-photon detuning and Rabi frequencies are relatively small compared to the decay rate of the excited state,\n\nwe obtain an analytical formula to analyze various CPT-Ramsey interferometry scenarios, such as the conventional CPT-Ramsey interferometry, CPT-Ramsey interferometry with frequency shift or phase jump, multi-pulse CPT-Ramsey interferometry, and multi-pulse CPT-Ramsey interferometry with frequency shift.\n\nFor the periodic CPT pulse sequence <cit.>, we can analytically study the influences of pulse length, pulse strength, pulse interval, and pulse number on the spectrum linewidth.\n\nThe formula we derived is a general solution that is valid for most situations with arbitrary CPT pulse sequences.\n\n\n\n\n§ CPT IN THREE-LEVEL Λ SYSTEM\n\n\n\n\n §.§ Model\n\n\nCPT can usually be achieved in a three-level Λ structure as shown in Fig. <ref>.\n\n\n\nThe bi-chromatic field with Rabi frequencies Ω_1 and Ω_2 couple the two ground states |1⟩ and |2⟩ to the excited state |3⟩.\n\nHere, δ_1 and δ_2 are the corresponding detunings, and Γ is the decay rate of the excited state |3⟩.\n\nUnder the rotating wave approximation, the Hamiltonian in the interaction picture reads <cit.>\n\n\n    Ĥ_I=   ħ(δ_1|1⟩⟨ 1|+δ_2|2⟩⟨ 2|)\n       +ħ(Ω_1/2|1⟩⟨ 3| + Ω_2/2|2⟩⟨ 3| + h.c.).\n\n\nAccording to the Lindblad equation, the time-evolution of the density matrix ρ obeys\n\n    dρ/d t = -i/ħ[Ĥ_I, ρ] + Γ/2∑_j=1^2[L̂_jρL̂_j^†\n      -1/2{L̂_j^†L̂_j, ρ}].\n\n\nHere, L̂_j=|j⟩⟨ 3| and their Hermite conjugate L̂_j^† are the Lindblad operators.\n\nIn most cases, the Rabi frequencies of monochromatic light are equal, i.e., |Ω_1|=|Ω_2|=Ω.\n\nThen the Rabi frequencies can be expressed as Ω_1=Ωe^iϕ_1 and Ω_2=Ωe^iϕ_2, with ϕ_1 and ϕ_2 are the phases of monochromatic light.\n\nIn this case, Eq. (<ref>) can be written as follows,\n\n\n    d/dtρ_11 = Γ/2ρ_33 - i(Ωe^-iϕ_1/2ρ_13^* - Ωe^iϕ_1/2ρ_13)\n    d/dtρ_12 = -iΩe^-iϕ_1/2ρ_23^* + iΩe^iϕ_2/2ρ_13 - i(δ_1-δ_2)ρ_12\n    d/dtρ_13 = -Γ/2ρ_13 + iΩe^-iϕ_1/2ρ_11 - iΩe^-iϕ_1/2ρ_33\n                  + iΩe^-iϕ_2/2ρ_12 - iδ_1ρ_13\n    d/dtρ_12^* = iΩe^iϕ_1/2ρ_23 - iΩe^-iϕ_2/2ρ_13^* + i(δ_1-δ_2)ρ_12^*\n    d/dtρ_22 = Γ/2ρ_33 - i(Ωe^-iϕ_2/2ρ_23^* - Ωe^iϕ_2/2ρ_23)\n    d/dtρ_23 = -Γ/2ρ_23 + iΩe^-iϕ_1/2ρ_12^* + iΩe^-iϕ_2/2ρ_22\n                   - iΩe^-iϕ_2/2ρ_33-iδ_2ρ_23\n    d/dtρ_13^* = -Γ/2ρ_13^* - iΩe^iϕ_1/2ρ_11+iΩe^iϕ_1/2ρ_33\n                  -iΩe^iϕ_2/2ρ_12^* + iδ_1ρ_13^*\n    d/dtρ_23^* = -Γ/2ρ_23^* - iΩe^iϕ_1/2ρ_12 - iΩe^iϕ_2/2ρ_22\n                  + iΩe^iϕ_2/2ρ_33 + iδ_2ρ_23^*\n    d/dtρ_33 = -Γρ_33 + iΩe^-iϕ_1/2ρ_13^* - iΩe^iϕ_1/2ρ_13\n                  + iΩe^-iϕ_2/2ρ_23^* - iΩe^iϕ_2/2ρ_23,\n\n\nwhere ρ_ij=⟨ i|ρ|j⟩. In the following, we solve these equations analytically.\n\n\n\n §.§ Analytical formula of ground-state coherence\n\n\nUnder the condition of the Rabi frequency is far smaller than the decay rate Ω≪Γ, one can find d/d tρ_33≪Γρ_33, and we can get\n\n\n    ρ_33 = 1/Γ(iΩe^-iϕ_1/2ρ_13^* - iΩe^iϕ_1/2ρ_13 + iΩe^-iϕ_2/2ρ_23^* - iΩe^iϕ_2/2ρ_23).\n\n\nUsually, the CPT works in the situation of near resonance δ_1,2≪Γ.\n\nDue to the large decay rate of the excited state, the population in the excited state can be ignored (compared with ground state populations), i.e.,  ρ_33≪ρ_11 and ρ_33≪ρ_22.\nThus we can obtain\n\n\n    ρ_13 = 1/Γ(iΩe^-iϕ_1ρ_11 + iΩe^-iϕ_2ρ_12),\n\n\n\n    ρ_23 = 1/Γ(iΩe^-iϕ_1ρ_12^* + iΩe^-iϕ_2ρ_22),\n\n\n\n    ρ_13^* = 1/Γ(- iΩe^iϕ_1ρ_11-iΩe^iϕ_2ρ_12^*),\n\n\n\n    ρ_23^* = 1/Γ(-iΩe^iϕ_1ρ_12 - iΩe^iϕ_2ρ_22).\n\n\nIn a CPT process, the population is mostly in the ground states that ρ_11+ρ_22≈ 1.\nSubstituting Eqs. (<ref>)- (<ref>) into Eqs. (<ref>) and (<ref>), we obtain\n\n\n    ρ_33 = Ω^2/Γ^2(1+2(ρ_12e^iϕ(t))),\n\n\nand\n\n\n    d/dtρ_12=-Ω^2/2Γe^-iϕ(t) - (Ω^2/Γ+ iδ)ρ_12.\n\n\nHere, δ=δ_1-δ_2 is the two-photon detuning, and ϕ(t)=ϕ_1-ϕ_2 is the phase of monochromatic light.\n\n\n\nEq. (<ref>) can be analytically solved under a train of CPT pulses.\n\n\nWe can construct the response of Eq. (<ref>) to an impulse taking place at t_0, which is the Green's function <cit.>\n\n\n    G(t, t_0) = H(t-t_0)exp(-∫_t_0^t (Ω^2(u)/Γ+iδ(u))du),\n\n\nwhere H(x) is Heaviside's function.\n\nIf the density matrix starts from a mixture state ρ=|1⟩⟨ 1|+|2⟩⟨ 2|.\n\n\n\n\n\n\n\n\n\n\n\nTake the initial value ρ_12(0)=0, we have\n\n\n\n\n\n    ρ_12(t, Ω)=-∫_0^tΩ^2(t^')/2Γe^-iϕ(t^')G(t,t^')dt^'\n\nbeing a function of δ(t) and Ω(t).\n\nWe analyze Eq. (<ref>) within the context of a general CPT pulse sequence, as shown in Figs. <ref>(b,c).\n\nThe orange pulses represent the CPT pulses with Rabi frequency Ω, variable pulse duration τ_i, and phase Φ_i.\n\nThe gray solid line represents the time-dependent detuning δ(t).\n\nAs a result, Eq. (<ref>) can be expressed as\n\n\n    ρ_12(t, Ω)=   -Ω^2/2Γ∑_l=1^N(∏_k=l+1^Nexp(-Ω^2/Γτ_k))\n       ×exp(- ∫_t_l+τ_l^tiδ(u) du )e^-iΦ_l\n       ×∫_t_l^t_l+τ_lexp(- ∫_t^'^t_l+τ_l(Ω^2/Γ+iδ(u))du)dt^'.\n\n\nThis is the general formula of ground-state coherence.\n\nEq. (<ref>) can be used to describe most cases of pulse sequences including the two-pulse CPT-Ramsey interferometry and multi-pulse CPT-Ramsey interferometry under fixed or time-dependent frequency detuning and phase.\n\nHowever, the absence of single-photon detunings δ_1 and δ_2 in the derivation of Eqs. (<ref>)-(<ref>) means that the influences of light shift induced by the excited state are not taken into account.\n\nAccording to Eq. (<ref>), if the phases of each CPT pulse are identical, the phase value does not affect the observation ρ_33.\n\nThis is because a global phase of the Rabi frequencies can be gauged into the state without changing the density matrix if we select the initial mixture state without non-diagonal terms.\n\nThat means the magnitude of Rabi frequencies can be real if we select proper initial phases of |1⟩ and |2⟩.\n\nGenerally, we gauge the phase of the last CPT pulse Φ_N into zero such that the phase of Eq. (<ref>) can be eliminated, thus\n\n\n    ρ_33=Ω^2/Γ^2(1+2(ρ_12)).\n\n\nAnd if the phases of CPT pulses are constant, all the phases can be gauged as zero.\n\n\nIf the detuning δ(t) is fixed as δ during the CPT pulses and varies with time t during the dark period, Eq. (<ref>) can be written in the form of\n\n\n    ρ_12 = f(δ) Q,\n\n\nwhere\n\n\n    f(δ)=-Ω^2/2Γ(Ω^2/Γ+iδ),\n\n\nis the slow variant envelope and Q is the multi-pulse CPT-Ramsey interference term,\n\n    Q = ∑_l=1^N   (∏_k=l+1^Ne^-Ω^2/Γτ_k)exp(- ∫_t_l+τ_l^tiδ(u) du )e^-iΦ_l\n       ×(1-exp(-(Ω^2/Γ+iδ)τ_l)).\n\n\n\n\n\n§ APPLICATIONS IN CPT-RAMSEY SPECTROSCOPY\n\n\nOur analytical formula Eq. (<ref>) can be applied in various experimental CPT-Ramsey scenarios.\n\nIn the following, we show its applications in conventional two-pulse CPT-Ramsey spectroscopy, anti-symmetric two-pulse CPT-Ramsey spectroscopy with frequency shift, and multi-pulse CPT-Ramsey spectroscopy.\n\n\n\n §.§ Two-pulse sequence\n\n\nIn most cases, the CPT-Ramsey interferometry is implemented with two pulses, as shown in Fig. <ref> (a).\n\nIn this scheme, the CPT pulse sequence contains a preparation pulse with duration τ_1 and a detection pulse with duration τ_2, which are separated by a free evolution with dark time T <cit.>.\n\nUsing Eq. (<ref>) with pulse number N=2, we can easily get the corresponding analytical results, which can be used as a benchmark example.\n\nOur analytical results can also be used for optimizing the CPT pulse sequence as we need.\n\n\n\n\n  §.§.§ Conventional Two-pulse CPT-Ramsey Spectroscopy\n\n\nConsidering the simple case, in which the detunings are time-independent and the phases equal zero. Then, Eq. (<ref>) can be simplified as\n\n    ρ_12(t, δ, Ω)=   -Ω^2/2Γ(Ω^2/Γ+iδ)∑_l=1^N(∏_k=l+1^Nexp(-Ω^2/Γτ_k))\n       ×exp(-iδ(t-t_l-τ_l))\n       ×(1-exp(-(Ω^2/Γ+iδ)τ_l)).\n\n\n\n\nFor a two-pulse CPT-Ramsey interferometry, the CPT-Ramsey interference term reads\n\n\n    Q = Q^T_1 + Q^T_2,\n\nwhere\n\n    Q_1^T =   exp(-Ω^2/Γτ_2)(1-exp(-(Ω^2/Γ+iδ)τ_1))\n       ×exp(-iδ(T+τ_2)),\n\nand\n\n    Q_2^T = (1-exp(-(Ω^2/Γ+iδ)τ_2)).\n\n\nThe conventional CPT-Ramsey fringe is mainly dominated by Q^T_1 in Eq. (<ref>).\n\nIt increases with the preparation pulse duration τ_1 and decreases with the detection pulse duration τ_2.\n\nQ^T_2 in Eq. (<ref>) increases with the detection pulse τ_2, which contributes a trend of slow variance, resulting in the vertical asymmetry <cit.>.\n\nAs a benchmark example, we examine the conventional CPT-Ramsey pulse sequence consisting of a preparation pulse of duration τ_1, a detection pulse of duration τ_2, and the pulse interval T=1000×2π/Γ, as illustrated in Fig. <ref> (a).\n\nThe Rabi frequency of the CPT pulse is Ω=0.035Γ.\n\nFor a detection pulse duration of τ_2=60×2π/Γ, if the preparation pulse duration is short, τ_1=60×2π/Γ, the CPT-Ramsey spectrum contrast is low, as shown in Fig. <ref> (b).\n\nThe black solid line is the analytical result of Eq. (<ref>) and blue dots are the numerical result of Lindblad equations.\n\nAs the preparation pulse duration τ_1 increases to τ_1=200×2π/Γ, the Q^T_1 of Eq. (<ref>) grows, improving the contrast of the CPT-Ramsey fringe, see Fig. <ref> (c).\n\nMeanwhile, reducing the detection pulse duration to τ_2=10×2π/Γ further improves the contrast of the CPT-Ramsey fringe and the spectrum becomes vertically symmetric, as shown in Fig. <ref> (d).\n\nWhen the preparation pulse duration τ_1=1000×2π/Γ is sufficient, the spectrum will reach a saturation point, see Fig. <ref> (e).\n\nAs the period in frequency space of the Q^T_1 is 2π/T+τ_2.\n\nThe linewidth of the CPT-Ramsey spectrum satisfies Δν = 1/2(T+τ_2).\n\nThus, the CPT-Ramsey with a long dark time T can narrow the spectrum linewidth, which is consistent with our common knowledge.\n\nThese results indicate that our analytical formula is valid for conventional two-pulse CPT-Ramsey scenarios.\n\n\n\n\n  §.§.§ Anti-symmetric Two-pulse CPT-Ramsey Spectroscopy with Frequency shift\n\n\nUsually, we need to perform two CPT-Ramsey interferometry with different frequencies and compare their differences to obtain an antisymmetric error signal for clock locking <cit.>.\n\n\n\nTo achieve real-time antisymmetric spectra, we can directly apply a frequency shift of Δδ during the dark time T or implement a change in phase ΔΦ=Φ_2-Φ_1 for the detection pulse based on conventional CPT-Ramsey interferometry, as illustrated in Fig. <ref> (a).\n\nHere, Φ_1 and Φ_2 are the phases of the preparation pulse and detection pulse, respectively.\n\nAccording to Eq. (<ref>), the two-pulse CPT-Ramsey interference term becomes\n\n    Q = Q^T'_1 + Q^T_2,\n\nwhere\n\n    Q^T'_1 =Q^T_1exp(-iΔδΔ t + iΔΦ).\n\n\nAs an example, we set τ_1=1000×2π/Γ, τ_2=10×2π/Γ, and T=1000×2π/Γ.\n\nWhen the two phases are equal, i.e., Φ_1=Φ_2 and ΔΦ=0, then it reduces to the conventional CPT-Ramsey interferometry as shown in Fig. <ref> (b).\n\nWhile the spectra will become horizontal antisymmetric if the frequency shift and phase shift satisfy ΔδΔ t-ΔΦ=π/2, as shown in Fig. <ref> (c) and (d).\n\nThen, the real-time processing of error signals will be obtained.\n\nIn auto-balance CPT-Ramsey interferometry <cit.>, the ΔΦ or Δδ can be used as the additional parameters to compensate for the light shift.\n\nHowever, if τ_1=60×2π/Γ is short and τ_2=60×2π/Γ is substantial, the error signals will not be horizontally antisymmetric as Q^T_2 is considerable compared to Q^T'_1.\n\nIt means that if the detection pulse duration is comparable with the preparation pulse duration, the spectrum will become horizontally asymmetric, as shown in Fig. <ref> (e).\n\nThe black solid lines are the analytical result of Eq. (<ref>) and the blue dots are the corresponding numerical results.\n\nAll the results match perfectly.\n\n\n\n\n §.§ Multi-pulse sequence\n\n\nIn Sec. <ref>, we analyzed conventional and frequency-shifted two-pulse CPT-Ramsey spectra using our analytical formula.\n\nIn this section, we will analyze multi-pulse CPT-Ramsey interferometry.\n\nWith a multi-pulse sequence, the central peak becomes obvious due to constructive interference while the neighboring peaks are suppressed through destructive interference.\n\nThe multi-pulse CPT-Ramsey interferometry makes the central peak easy to be identified and makes the signal-to-noise ratio (SNR) better.\n\nThus, the multi-pulse sequence is useful for developing practical quantum sensors, such as atomic clocks.\n\nHowever, for practical applications, the multi-pulse CPT-Ramsey interferometry involves multiple pulses which need to be sophisticatedly tuned.\n\nOur analytical formula provides a simple way to analyze and optimize the pulse sequence as desired.\n\nWe consider that the multi-pulse CPT Ramsey interferometry starts with a preparation pulse τ_1 to prepare the dark state, followed by N pulses of duration τ with pulse interval T, as shown in Fig. <ref> (a).\n\nBy using our analytical formula, below we analyze the roles of preparation pulse and periodic pulse sequence and provide an example to achieve the anti-symmetric spectrum with frequency shift.\n\n\n\n  §.§.§ The influence of preparation pulse\n\n\n\nWe consider the phases of all CPT pulses are identical and so that we can set the phases as zero.\n\nAccording to Eq. (<ref>), the interference term\n\n\n    Q=Q^M_1+Q^M_2,\n\nincludes two parts,\n\n    Q^M_1 =   exp(-Ω^2/ΓNτ)exp(-iδ N(T+τ))\n       ×(1-exp(-(Ω^2/Γ+iδ)τ_1)),\n\n\nand\n\n\n    Q^M_2 =    ∑_i=1^Nexp(-Ω^2/Γ(N-i)τ) exp(-iδ (N-i)(T+τ))\n       ×(1-exp(-(Ω^2/Γ+iδ)τ)).\n\n\nQ^M_1 is the fast oscillating term versus δ.\n\nObviously, the preparation pulse duration τ_1 only affects Q^M_1 and Q^M_1 increases with τ_1.\n\n\n\nTherefore the amplitude of the spectrum increases with the preparation pulse duration.\n\nAs shown in Fig. <ref> (b) and (c), the spectra of multi-pulse CPT-Ramsey interferometry with longer preparation pulse duration τ_1=200×2π/Γ has a higher amplitude of the peaks than that with shorter preparation pulse τ_1=60×2π/Γ.\n\n\nHowever, the subsequent CPT pulses also affect Q^M_1.\n\nThe more or longer subsequent CPT pulses, the smaller the Q^M_1 is.\n\nHence, when the number N or the duration τ of the subsequent CPT pulses is large, the duration of the preparation pulse τ_1 has little impact on the spectra.\n\nAs shown in Fig. <ref> (d) and (e), the preparation pulse has little influence on the spectra of multi-pulse CPT-Ramsey interferometry when the pulse number N is large.\n\n\n\n\n  §.§.§ Periodic pulse sequence\n\n\nWith a large amount of pulse number N, the influence of the first CPT pulse duration can be neglected.\nFor simplicity, many experiments use periodic multi-pulse sequences <cit.>.\n\nUnder a periodic CPT pulse sequence with interval T, pulse number N, pulse duration τ, and Rabi frequencyΩ, according to Eq. (<ref>), we have\n\n\n    ρ_12(δ)=f(δ)∑_l=0^N-1ℛ^lexp(-ilδ T)𝒯.\n\n\nThis is a temporally analog to light passing through the Fabry-Pérot resonator <cit.>, in which ℛ≡exp(-Ω^2/Γτ) takes the role the reflection coefficient and 𝒯≡ 1-exp(-(Ω^2/Γ+iδ)τ) corresponds to the transmission coefficient.\n\nUsing the series summation, Eq. (<ref>) can be simplified as\n\n\n    ρ_12(δ) = f(δ)𝒯S,\n\n\nwith\n\n\n    S=1-R^Nexp(-iNδ T)/1-Rexp(-iδ T).\n\n\nFor a multi-pulse CPT-Ramsey interferometry, f(δ) and 𝒯 are flatter than S near the resonance point.\n\nThe lineshape of ρ_12 is mainly described by S, as shown in Fig. <ref>.\n\nIf the pulse number N→∞, the full width at half maximum (FWHM) 2πΔν_∞ of ρ_12 is determined by the reflection coefficient ℛ and the pulse period T_p=T+τ, which is the Airy distribution <cit.>,\n\n\n    2πΔν_∞ = 4/T_parcsin(√((1-ℛ)^2/2(ℛ^2+1))).\n\n\nEq. (<ref>) is valid in the saturation region of ℛ^N ≪ 1.\n\n\nFor a finite pulse number, the FWHM of Eq. (<ref>) cannot be exactly given <cit.>.\n\nHowever, we can calculate the Lorenztian linewidth through the Taylor expansion for the 1/Re(S),\n\n\n    1/Re(S) = F_0 + 1/2F_2 T_p^2 δ^2 + 𝒪(T^4δ^4),\n\n\nwith\n\n    F_0 = 1-ℛ/1-ℛ^N,\n\n\nand\n\n    F_2 = ℛ(1+ℛ)/(1-ℛ)(1-ℛ^N) - N^2ℛ^N(1 - ℛ) + 2 N ℛ^N + 1/(1 - ℛ^N)^2.\n\n\n\n\nThe real part of S can be approximated as the Lorentzian form\n\n\n    Re(S)≈S = A(1/2W)^2/(1/2W)^2+δ^2.\n\n\nHere, A=1/F_0 and W=2√(2)/T√(F_0/F_2) are the amplitude and FWHM of S.\n\nSubstituting Eq. (<ref>) and Eq. (<ref>), we get that\n\n\n    W = 2/T_p[2(ℛ^2+ℛ)/(1-ℛ)^2 - 2N^2ℛ^N/1-ℛ^N -4Nℛ^N+1/(1-ℛ^N)(1-ℛ)]^-1/2.\n\n\n\n\n\nIn Fig. <ref> (a) we show W versus the pulse number N, where W decreases with the pulse number N.\n\nIntuitively, more pulses will lead to a narrower linewidth.\n\nSince ℛ decreases with both τ and Ω, larger Ω and τ will result in a larger linewidth.\n\nLarger values of Ω and τ mean fewer pulses needed to reach saturation and fewer pulses contributing to multi-pulse interference, therefore the linewidth becomes broader.\n\nFor illustration, Fig. <ref> (c) shows the change of FWHM with the pulse number N and the pulse duration τ when Ω=0.04Γ.\n\nWhile Fig. <ref> (d) displays the change of FWHM versus the pulse number N and the Rabi frequency Ω when τ=10×2π/Γ.\n\n\n\n\n  §.§.§ Anti-symmetric multi-pulse CPT-Ramsey spectroscopy with frequency shift\n\n\n\n\nAs mentioned in Sec.<ref>, one may prefer to use an anti-symmetric spectrum for frequency locking.\n\nIn a multi-pulse CPT-Ramsey interferometry, applying a frequency shift Δδ for a duration of Δ t before the k-th subsequent pulse [as illustrated in Fig. <ref> (a)], or introducing a phase jump ΔΦ, can alter the spectrum horizontal symmetry to be anti-symmetric.\n\nHowever, how to determine pulse sequence with frequency shift or phase jump is still challenging.\n\nHere, we use our analytical formula to address this issue.\n\nTaking the frequency shift and the phase jump before the k-th subsequent pulse, we can divide the interference term into three parts\n\n    Q=Q^M'_1+Q^M'_2+Q^M'_3,\n\nwhere\n\n    Q^M'_1 =   exp(-Ω^2/ΓNτ)(1-exp(-(Ω^2/Γ+iδ)τ_1))\n       ×exp(-iδ N(T+τ))exp(-iΔδΔ t + iΔΦ),\n\n\n\n    Q^M'_2 =    ∑_i=1^k-1exp(-Ω^2/Γ(N-i)τ)\n       ×(1-exp(-(Ω^2/Γ+iδ)τ))\n       ×exp(-iδ (N-i)(T+τ))exp(-iΔδΔ t + iΔΦ),\n\n\nand\n\n    Q^M'_3 =    ∑_i=k^Nexp(-Ω^2/Γ(N-i)τ)\n       ×(1-exp(-(Ω^2/Γ+iδ)τ))\n       ×exp(-iδ (N-i)(T+τ)).\n\n\nThe frequency shift Δδ affects the horizontal symmetry of Q^M'_1 and Q^M'_2, but Q^M'_3 remains horizontally symmetric.\n\nIf the frequency shift satisfies ΔδΔ t=π/2, it will adjust Q^M'_1 and Q^M'_2 from symmetric into antisymmetric in the horizontal direction.\n\nTo obtain a horizontally antisymmetric spectrum, the contribution of the horizontally symmetric term Q^M'_3 should be small.\n\nThus, it is a natural choice to apply frequency shift right before the last pulse to suppress Q^M'_3.\n\nIn Fig. <ref> (b)-(e), we applied the frequency shifts with ΔδΔ t=π/2 after the preparation pulse τ_1, before the last 10-th pulse, before the last third pulse, and before the last pulse, respectively.\n\nThe preparation pulse is τ_1=200×2π/Γ and the pulse interval is T=500×2π/Γ.\n\nThe duration τ=10×2π/Γ and the pulse number N=40.\n\nClearly, as the delay of frequency shifts, Q^M'_3 decreases and the spectrum tends to become antisymmetric.\n\nThus, our analytic analysis can provide a straightforward way to design the multi-pulse sequence for CPT-Ramsey interferometry, which should be beneficial for developing high-accuracy schemes such as auto-balanced Ramsey spectroscopy <cit.>.\n\n\n\n\n§ DISCUSSION\n\n\nIn conclusion, starting from the Lindblad equation, we derive an analytical formula to describe the multi-pulse CPT-Ramsey interferometry with arbitrary pulse sequence.\n\nThe analytical formula can potentially optimize the pulse sequence and analyze the influence of time-dependent detuning.\n\nWe illustrate the validity of the analytical result with the popular CPT-Ramsey scenarios and obtain the sort of views.\n\nFor a two-pulse CPT-Ramsey interferometry, we study the influence of the preparation and the detection pulse.\n\nWe quantitatively show that the preparation pulse should as long as possible to gain a larger spectrum amplitude,\n\nand the detection pulse should be small to avoid destroying the CPT coherence.\n\nThe frequency shift or phase jump will change the spectrum symmetry.\n\nThe analytical results show that a long preparation pulse and a small detection pulse are required to obtain the antisymmetric spectrum.\n\nFor multi-pulse cases, the role of preparation pulses becomes less significant as the number of subsequent pulses increases.\n\nAs the number of pulses increases, the side peaks are continuously destroyed by interference, and we obtain a high-contrast central peak.\n\nBy adding a frequency shift or phase jump right before the last pulse, we obtain an antisymmetric multi-pulse CPT-Ramsey spectrum.\n\nOur theoretical results can be applied to design novel multi-pulse and frequency modulated CPT-Ramsey schemes.\n\nUnder the condition of the period pulse sequence, we find out the approximate Lorenztian line shape of the spectrum and get the relationship between FWHM and the parameters of the CPT pulse sequence.\n\nIt quantitatively grapes the role of multi-pulse interference.\n\nFor the multi-pulse and frequency regulation CPT-Ramsey interferometry, there are many potential applications such as  CPT clock and CPT magnetometers.\n\nEffective optimization methods are conducive to efficiently improving the measurement accuracy.\n\nIn this work, we eliminate the one-photon detunings and the effect of light shift is ignored.\n\nHowever, the real systems always contain many states, deriving light shift from a three-level system is not meaningful.\n\nAs our analytical results can describe the situations of time-dependent detuning, we can also analyze the impact of CPT pulses on the present light shift by adding the light shift into detuning.\n\nThese are deserved for further investigations.\n\n\nThis work is supported by the National Key Research and Development Program of China (Grant No. 2022YFA1404104), the National Natural Science Foundation of China (Grant No. 12025509), and the Key-Area Research and Development Program of GuangDong Province (Grant No. 2019B030330001).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n32\n  fxundefined [1]\n   ifx#1\n  \n  fnum [1]\n   #1firstoftwo\n   secondoftwo\n   \n  fx [1]\n   #1firstoftwo\n   secondoftwo\n   \n  \n  \n  \n  \n  \n  noop [0]secondoftwo\n  \n  ref[1]@startlink#1@href\n  href[1]#1@endlink\n  anitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\n  startlink[1]\n  endlink[0]\n  \n  rl [1]href #1\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  @bib@innerbibempty\n  \n  [Alzetta et al.(1976)Alzetta, Gozzini, Moi, and Orriols]alzetta1976experimental\n    author author G. Alzetta, author A. Gozzini,\n    author L. Moi,  and author G. Orriols, 10.1007/BF02749417 journal journal Nuov Cim B    volume 36, pages 5 (year\n    1976)NoStop\n  [Rogers et al.(2014)Rogers,\n    Jahnke, Metsch, Sipahigil,\n    Binder, Teraji, Sumiya,\n    Isoya, Lukin, Hemmer, and    Jelezko]PhysRevLett.113.263602\n    author author L. J. Rogers, author K. D. Jahnke,\n    author M. H. Metsch, author A. Sipahigil, author\n    J. M. Binder, author\n    T. Teraji, author H. Sumiya, author J. Isoya, author M. D.    Lukin, author P. Hemmer,  and author F. Jelezko, 10.1103/PhysRevLett.113.263602 journal journal Phys. Rev. Lett. volume 113, pages 263602 (year\n    2014)NoStop\n  [Das et al.(2018)Das,\n    Liu, Grémaud, and Mukherjee]PhysRevA.97.033838\n    author author S. Das, author P. Liu, author B. Grémaud,  and author M. Mukherjee, 10.1103/PhysRevA.97.033838 journal journal Phys.\n    Rev. A volume 97, pages 033838\n    (year 2018)NoStop\n  [Xia et al.(2015)Xia,\n    Kolesov, Wang, Siyushev,\n    Reuter, Kornher, Kukharchyk,\n    Wieck, Villa, Yang, and    Wrachtrup]PhysRevLett.115.093602\n    author author K. Xia, author R. Kolesov,\n    author Y. Wang, author\n    P. Siyushev, author\n    R. Reuter, author T. Kornher, author N. Kukharchyk, author A. D.    Wieck, author B. Villa, author S. Yang,  and    author J. Wrachtrup, 10.1103/PhysRevLett.115.093602 journal journal Phys. Rev. Lett. volume 115, pages 093602 (year 2015)NoStop\n  [Santori et al.(2006)Santori, Tamarat, Neumann, Wrachtrup, Fattal, Beausoleil,\n    Rabeau, Olivero, Greentree,\n    Prawer, Jelezko, and Hemmer]PhysRevLett.97.247401\n    author author C. Santori, author P. Tamarat,\n    author P. Neumann, author J. Wrachtrup, author\n    D. Fattal, author R. G. Beausoleil, author J. Rabeau, author P. Olivero, author A. D.    Greentree, author S. Prawer, author F. Jelezko,     and author P. Hemmer, 10.1103/PhysRevLett.97.247401 journal journal Phys. Rev. Lett. volume 97, pages 247401 (year 2006)NoStop\n  [Jamonneau et al.(2016)Jamonneau, Hétet, Dréau,\n    Roch, and Jacques]PhysRevLett.116.043603\n    author author P. Jamonneau, author G. Hétet, author A. Dréau, author J.-F. Roch,\n     and author V. Jacques, 10.1103/PhysRevLett.116.043603 journal journal Phys. Rev. Lett. volume 116, pages 043603 (year 2016)NoStop\n  [Ni et al.(2008)Ni,\n    Ospelkaus, de Miranda, Pe'er, Neyenhuis, Zirbel, Kotochigova, Julienne, Jin, and    Ye]Ni231\n    author author K.-K. Ni, author S. Ospelkaus,\n    author M. H. G. de Miranda,\n    author A. Pe'er, author B. Neyenhuis, author\n    J. J. Zirbel, author\n    S. Kotochigova, author\n    P. S. Julienne, author\n    D. S. Jin,  and author\n    J. Ye, 10.1126/science.1163861 journal journal\n    Science volume 322, pages 231\n    (year 2008)NoStop\n  [Aspect et al.(1988)Aspect,\n    Arimondo, Kaiser, Vansteenkiste, and Cohen-Tannoudji]PhysRevLett.61.826\n    author author A. Aspect, author E. Arimondo,\n    author R. Kaiser, author N. Vansteenkiste,  and author C. Cohen-Tannoudji, 10.1103/PhysRevLett.61.826 journal journal Phys. Rev. Lett. volume 61, pages 826 (year 1988)NoStop\n  [Vanier(2005)]Vanier2005\n    author author J. Vanier, 10.1007/s00340-005-1905-3 journal\n    journal Appl. Phys. B volume 81,    pages 421 (year 2005)NoStop\n  [Merimaa et al.(2003)Merimaa, Lindvall, Tittonen, and    Ikonen]Merimaa:03\n    author author M. Merimaa, author T. Lindvall,\n    author I. Tittonen,  and    author E. Ikonen, 10.1364/JOSAB.20.000273 journal journal\n    J. Opt. Soc. Am. B volume 20, pages\n    273 (year 2003)NoStop\n  [Yun et al.(2017)Yun,\n    Tricot, Calosso, Micalizio,\n    Franççois, Boudot, Guérandel, and de\n    Clercq]PhysRevApplied.7.014018\n    author author P. Yun, author F. Tricot,\n    author C. E. Calosso, author S. Micalizio, author\n    B. Franççois, author\n    R. Boudot, author S. Guérandel,  and author E. de Clercq, 10.1103/PhysRevApplied.7.014018 journal journal\n    Phys. Rev. Applied volume 7, pages\n    014018 (year 2017)NoStop\n  [Liu et al.(2017)Liu,\n    Ivanov, Yudin, Kitching,    and Donley]PhysRevApplied.8.054001\n    author author X. Liu, author E. Ivanov,\n    author V. I. Yudin, author J. Kitching,  and author E. A. Donley, 10.1103/PhysRevApplied.8.054001 journal journal\n    Phys. Rev. Applied volume 8, pages\n    054001 (year 2017)NoStop\n  [Scully and Fleischhauer(1992)]PhysRevLett.69.1360\n    author author M. O. Scully and author M. Fleischhauer, 10.1103/PhysRevLett.69.1360 journal journal Phys. Rev. Lett. volume 69, pages 1360 (year\n    1992)NoStop\n  [Nagel et al.(1998)Nagel,\n    Graf, Naumov, Mariotti,\n    Biancalana, Meschede, and Wynands]Nagel_1998\n    author author A. Nagel, author L. Graf,\n    author A. Naumov, author E. Mariotti, author\n    V. Biancalana, author\n    D. Meschede,  and author\n    R. Wynands, 10.1209/epl/i1998-00430-0 journal journal\n    Europhys. Lett. volume 44, pages 31\n    (year 1998)NoStop\n  [Schwindt et al.(2004)Schwindt, Knappe, Shah, Hollberg, Kitching, Liew, and    Moreland]doi:10.1063/1.1839274\n    author author P. D. D.    Schwindt, author S. Knappe, author V. Shah,\n    author L. Hollberg, author J. Kitching, author\n    L.-A. Liew,  and author\n    J. Moreland, 10.1063/1.1839274 journal journal Appl. Phys.\n    Lett. volume 85, pages 6409 (year 2004)NoStop\n  [Tripathi and Pati(2019)]Tripathi2019\n    author author R. Tripathi and author G. S. Pati, 10.1109/jphot.2019.2922831 journal\n    journal IEEE Photonics Journal volume\n    11, pages 1 (year 2019)NoStop\n  [Zanon et al.(2005)Zanon,\n    Guerandel, de Clercq, Holleville, Dimarcq, and Clairon]PhysRevLett.94.193002\n    author author T. Zanon, author S. Guerandel,\n    author E. de Clercq, author D. Holleville, author\n    N. Dimarcq,  and author\n    A. Clairon, 10.1103/PhysRevLett.94.193002 journal journal\n    Phys. Rev. Lett. volume 94, pages\n    193002 (year 2005)NoStop\n  [Vanier et al.(2003)Vanier,\n    Levine, Janssen, and Delaney]PhysRevA.67.065801\n    author author J. Vanier, author M. W. Levine,\n    author D. Janssen,  and    author M. Delaney, 10.1103/PhysRevA.67.065801 journal journal Phys. Rev. A volume 67, pages 065801 (year 2003)NoStop\n  [Guerandel et al.(2007)Guerandel, Zanon, Castagna, Dahes, de Clercq, Dimarcq, and    Clairon]4126869\n    author author S. Guerandel, author T. Zanon,\n    author N. Castagna, author F. Dahes, author\n    E. de Clercq, author\n    N. Dimarcq,  and author\n    A. Clairon, @noop  journal journal IEEE Trans. Instrum. Meas. volume 56, pages 383 (year\n    2007)NoStop\n  [Yun et al.()Yun,\n    Zhang, Liu, Deng,\n    You, and Gu]Yun_2012\n    author author P. Yun, author Y. Zhang, author G. Liu, author\n    W. Deng, author L. You,  and author S. Gu, 10.1209/0295-5075/97/63004     volume 97, pages 63004, note 16 citations (Crossref) [2023-02-27]NoStop\n  [Warren et al.(2018)Warren,\n    Shahriar, Tripathi, and Pati]Warren2018\n    author author Z. Warren, author M. S. Shahriar, author R. Tripathi,\n     and author G. S. Pati,    10.1063/1.5008402 journal journal J. Appl. Phys. volume 123, pages 053101 (year 2018)NoStop\n  [Nicolas et al.(2018)Nicolas, Delord, Jamonneau, Coto, Maze, Jacques, and Hétet]Nicolas2018\n    author author L. Nicolas, author T. Delord,\n    author P. Jamonneau, author R. Coto, author\n    J. Maze, author V. Jacques,  and author G. Hétet, 10.1088/1367-2630/aab574\n    journal journal New J. Phys. volume 20, pages 033007 (year\n    2018)NoStop\n  [Fang et al.(2021)Fang,\n    Han, Jiang, Qiu,\n    Guo, Zhao, Huang,\n    Lu, and Lee]fang_temporal_2021\n    author author R. Fang, author C. Han, author X. Jiang, author\n    Y. Qiu, author Y. Guo, author M. Zhao, author J. Huang,\n    author B. Lu,  and author C. Lee, 10.1038/s41534-021-00479-y journal journal Npj\n    Quantum Inf. volume 7, pages 1\n    (year 2021)NoStop\n  [Abdel Hafiz et al.(2018a)Abdel Hafiz, Coget, Petersen, Rocher, Guérandel, Zanon-Willette, de\n    Clercq, and Boudot]abdel_hafiz_toward_2018\n    author author M. Abdel Hafiz, author G. Coget,\n    author M. Petersen, author C. Rocher, author\n    S. Guérandel, author\n    T. Zanon-Willette, author\n    E. de Clercq,  and author\n    R. Boudot, 10.1103/PhysRevApplied.9.064002 journal journal\n    Phys. Rev. Appl. volume 9, pages\n    064002 (year 2018a)NoStop\n  [Abdel Hafiz et al.(2018b)Abdel Hafiz, Coget, Petersen, Calosso, Guérandel, de Clercq, and Boudot]abdel_hafiz_symmetric_2018\n    author author M. Abdel Hafiz, author G. Coget,\n    author M. Petersen, author C. E. Calosso, author\n    S. Guérandel, author\n    E. de Clercq,  and author\n    R. Boudot, 10.1063/1.5030009 journal journal Appl. Phys.\n    Lett. volume 112, pages 244102\n    (year 2018b)NoStop\n  [Yudin et al.(2018)Yudin,\n    Taichenachev, Basalaev, Zanon-Willette, Pollock, Shuker,\n    Donley, and Kitching]yudin_generalized_2018\n    author author V. I. Yudin, author A. V. Taichenachev, author M.\n    Yu. Basalaev, author T. Zanon-Willette, author J. W. Pollock, author M. Shuker, author E. A.    Donley,  and author J. Kitching, 10.1103/PhysRevApplied.9.054034 journal journal\n    Phys. Rev. Appl. volume 9, pages\n    054034 (year 2018)NoStop\n  [Kotler et al.(2011)Kotler,\n    Akerman, Glickman, Keselman,    and Ozeri]kotler_single-ion_2011\n    author author S. Kotler, author N. Akerman,\n    author Y. Glickman, author A. Keselman,  and author R. Ozeri, 10.1038/nature10010 journal journal Nature    volume 473, pages 61 (year\n    2011)NoStop\n  [Shahriar et al.(2014)Shahriar, Wang, Krishnamurthy,\n    Tu, Pati, and Tseng]Shahriar2014\n    author author M. Shahriar, author Y. Wang,\n    author S. Krishnamurthy, author Y. Tu, author\n    G. Pati,  and author\n    S. Tseng, 10.1080/09500340.2013.865806 journal journal J.\n    Mod. Opt volume 61, pages 351\n    (year 2014)NoStop\n  [Berberan-Santos(2010)]berberan-santos_greens_2010\n    author author M. N. Berberan-Santos, 10.1007/s10910-010-9678-2 journal journal Journal of Mathematical Chemistry volume 48, pages 175 (year\n    2010)NoStop\n  [Zanon-Willette et al.(2005)Zanon-Willette, Guérandel, de\n    Clercq, Holleville, Dimarcq, and    Clairon]zanon-willette_high_2005\n    author author T. Zanon-Willette, author S. Guérandel, author E. de\n    Clercq, author D. Holleville,\n    author N. Dimarcq,  and    author A. Clairon, 10.1103/PhysRevLett.94.193002 journal journal Phys. Rev. Lett. volume 94, pages 193002 (year 2005)NoStop\n  [Ismail et al.(2016)Ismail,\n    Kores, Geskus, and Pollnau]ismail_fabry-perot_2016\n    author author N. Ismail, author C. C. Kores,\n    author D. Geskus,  and author M. Pollnau, 10.1364/OE.24.016366 journal journal Opt.\n    Express volume 24, pages 16366\n    (year 2016)NoStop\n  [Pissadakis(2000)]pissadakis_bragg_2000\n    author author S. Pissadakis, @noop  journal journal\n    University of Southampton  (year 2000)NoStop\n  \n\n"}