{"entry_id": "http://arxiv.org/abs/2303.07108v1", "published": "20230313134345", "title": "Quantum ghost imaging of a transparent polarisation sensitive phase pattern", "authors": ["Aditya Saxena", "Manpreet Kaur", "Vipin Devrari", "Mandip Singh"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\nUpcycling Models under Domain and Category Shift\n    Sanqing Qu^1Equal Contribution , Tianpei Zou^1, Florian Röhrbein^2,\nCewu Lu^3, Guang Chen^1Corresponding author: guangchen@tongji.edu.cn ,\n Dacheng Tao^4,5, Changjun Jiang^1\n\n^1Tongji University, ^2Chemnitz University of Technology,\n\n^3Shanghai Jiao Tong University, ^4JD Explore Academy, ^5The University of Sydney\n\n\n    March 30, 2023\n=================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\nempty\n\n\n\n\n§ INTRODUCTION\n\nQuantum ghost imaging of light absorbing objects relies on Einstein-Podolsky-Rosen (EPR) quantum entanglement of photons <cit.>. A single photon after interaction with an absorptive object is detected by a stationary detector and a non-interacting photon is detected in the image plane of an imaging lens in a coincidence measurement with the interacting photon. EPR entanglement of photons manifests position correlations between the object plane and its ghost image plane. In quantum ghost imaging,  a momentum state of the interacting photon is measured in the object plane by placing a lens after the object plane, which focus the photon on a stationary single photon detector. Therefore, a photon detection does not reveal any information of location on the object where a photon has interacted with it. In other words, momentum measurement projects an interacting photon quantum state in a quantum superposition of its position states in the object plane. In contrast, a non-interacting photon is measured in a position basis in the image plane. Quantum ghost imaging techniques of photon-absorptive objects has been extensively investigated theoretically as well as experimentally <cit.>. Classical ghost imaging has been of considerable interest with thermal light <cit.>. Quantum imaging of spiral objects has been realised with random light <cit.>. Furthermore, ghost imaging experiments are performed with X-rays <cit.>, electrons <cit.> and correlated atoms <cit.>. A transparent phase object is imaged with quantum entangled photons using ghost diffraction <cit.> and computational ghost imaging technique <cit.>. In a direct coincidence imaging experiment, a polarisation sensitive meta-surface is imaged with polarisation entangled photons <cit.>.\n\nIn this paper, a quantum ghost imaging experiment of a transparent polarisation sensitive phase pattern is presented, which manifests a polarisation and position dependent phase shift of transmitted photons. To image such type of pattern represented by a unitary transformation, quantum entanglement in the polarisation degree of freedom is incorporated in addition to EPR entanglement of photon pairs. Photons are EPR entangled and polarisation entangled separately in the form of a hyper-entangled state. Polarisation entanglement leads to detection of polarisation sensitive phase shift exhibited by the pattern and EPR entanglement correlates  position states of an interacting photon in the object plane with  position states of a non-interacting photon in the image plane. However, experiment presented in this paper is performed in quantum mechanical way, where the which-position-polarisation information of interacting photon on the pattern is not available even in principle. This experiment is a quantum ghost imaging version of a direct coincidence imaging experiment of a transparent polarisation sensitive phase pattern described in Ref. <cit.>. However, in this paper the quantum entanglement under consideration involves EPR and polarisation degrees of freedom in hyper-entanglement of photon pairs, where in Ref.<cit.> the hyper-entangled state involves momentum and polarisation degrees of freedom. These two experiments are fundamentally different. To produce a quantum ghost image, EPR-polarisation hyper-entanglement becomes necessary as further described in this paper. Therefore, experimental and theoretical analysis given in Ref. <cit.> cannot be applied directly to the present experiment. Furthermore, the experiments described in this paper and in Ref.<cit.> are very different from the experiment described in Ref.<cit.> which involves only polarisation entanglement of photon pairs and a direct imaging is performed in the close vicinity of object. In contrast, experiment presented in this paper and in Ref.<cit.> are realised for a large optical path length, where the object is situated at a large distance from the imaging camera . Hyper-entanglement is necessary to realise a ghost and direct imaging of the distant object by jointly measuring momentum-polarisation of interacting photon and position-polarisation of non-interacting photon.\n\n As a consequence of EPR-polarisation hyper-entanglement the  polarisation, momentum and position quantum states of an individual photon are completely undefined prior to a measurement. Hyper-entangled photons are produced by type-II spontaneous parametric down conversion (SPDC) at the intersection of emission cones of down converted photons. A  nonlinear crystal is pumped by a broad diameter laser beam to produce the required quantum entangled state of photons. A polarisation sensitive phase pattern is produced by a spatial light modulator (SLM). A corresponding quantum ghost image is captured on an intensified-charge-coupled-device (ICCD) single photon sensitive camera.  ICCD camera detects a non-interacting photon only if an interacting photon is detected with a particular measurement outcome by a stationary single photon detector, which triggers the camera. A quantum ghost image gradually emerges after accumulating the detections of non-interacting photons by repeating the experiment for the same measurement outcomes. Each detection event of the non-interacting photon on the camera corresponds to its position measurement. However, momentum measurement outcome of interacting photon is kept same in all measurements presented in this paper, which reveals no position-information of the interacting photon on the pattern. Different quantum ghost images are produced for different polarisation detection outcomes of photons in a selected diagonal polarisation basis. By ignoring the interacting photon measurement outcomes or by letting this photon escape without any measurement, no ghost image is produced by single photon accumulation on camera. This is regarded as one of the main characteristics of quantum ghost imaging method, where an individual photon reveals no information of the pattern because of quantum entanglement.\n\n\n\n§ CONCEPT AND EXPERIMENT\n\n\nConsider a schematic diagram of a ghost imaging configuration as shown in Fig. <ref>, where a hyper-entangled photons pair is produced by a source positioned around origin. Photon-1 passes through a polarisation sensitive phase pattern without absorption. After that, it passes through a polariser and a convex lens L_o, which focus photon-1 on a single photon detector. If the detector detects  photon-1, then a particular joint measurement outcome corresponding to a specific polarisation and  momentum state of photon-1 in an object plane containing the pattern is produced. Whereas photon-2 never interacts with the pattern. It is detected  by a single photon sensitive coincidence camera, which measures its position in an image plane of an imaging convex lens after a polarisation selection made by a polariser-2.  Coincidence camera detects photon-2 only if it receives a trigger signal from a single photon detector i.e. a signal corresponding to a particular joint measurement outcome of photon-1. An imaging lens is placed in path of photon-2 such that an object plane corresponds to a plane containing the pattern and an image plane corresponds to a plane of camera image sensor. Since the pattern under consideration is transparent and it introduces a polarisation dependent phase shift therefore, it cannot be imaged with conventional ghost imaging method for absorptive objects. The current setup shown in Fig. <ref> differs from a conventional setup in three main aspects, (a) photons are polarisation entangled and EPR entangled separately, which is a necessary condition to produce a quantum ghost image of a transparent polarisation sensitive phase pattern. Polarisation entanglement detects the polarisation dependent phase shift and EPR entanglement correlates  locations of photons between the object and image planes. (b) The polarisation and  momentum state of photon-1 are measured  together in the object plane. (c) The polarisation and position states of photon-2 are measured together in the image plane. A quantum ghost image is produced by correlating the joint measurement outcomes of both photons.\n\nIn one-dimension,  EPR quantum state in position basis can be written as |α⟩=∫^∞_-∞|x⟩_1|x+x_o⟩_2dx, where subscripts 1 and 2 are particle labels and x_o is  position difference between position states of particles. In momentum basis, the same quantum state can be written as |α⟩=∫^∞_-∞e^i p x_o/ℏ|p⟩_1|-p⟩_2dp, where particles have opposite momenta and ℏ=h/2π is the reduced Planck's constant. Therefore, both position and momentum of each particle are completely unknown. If x_o=0, then both particles have same position in the integral. In addition, for the EPR quantum state |α⟩, both particles are equally likely to be found at all spatial and momentum locations i.e.  spatial and momentum extensions of their position and momentum wavefunctions are infinite. In this paper, a three dimensional time independent scenario for photons is considered, where a finite source of photons is positioned around origin as shown in Fig. <ref>. Let 𝐫' be an arbitrary point in the source where both photons are produced together. An amplitude to find photon-1 at  point o_a in region-a and photon-2 at point  o_b in region-b originating from a point 𝐫' and prior to any optical element can be written as e^ip_1|𝐫_a-𝐫'|/ℏ/|𝐫_a-𝐫'|e^ip_2|𝐫_b-𝐫'|/ℏ/|𝐫_b-𝐫'| <cit.>, where p_1 and p_2 are magnitudes of momentum of photon-1 and of photon-2, respectively. Consider 𝐫_a and 𝐫_b are position vectors\n of points o_a and o_b from origin, respectively. Therefore, |𝐫_a-𝐫'| and |𝐫_b-𝐫'| are distances of o_a and o_b from 𝐫', respectively.\nIn addition, |H⟩_a and |V⟩_b are the polarisation quantum states of photon-1 propagating in region-a and of photon-2 propagating in region-b, respectively.\n\n\nFor an extended source, a quantum state leading to a finite amplitude to find a photon at o_a with polarisation state |H⟩_a and a photon at o_b with polarisation state |V⟩_b is a linear quantum superposition of amplitudes originating from all the points in the source, which can be written as\n\n    |Ψ⟩_12=A_o∫^∞_-∞∫^∞_-∞∫^∞_-∞ψ(x',y',z')\n      e^ip_1|𝐫_a-𝐫'|/ℏ/|𝐫_a-𝐫'|e^ip_2|𝐫_b-𝐫'|/ℏ/|𝐫_b-𝐫'|dx'dy'dz' ⊗|H⟩_a|V⟩_b\n\n\n where, A_o is a constant and  ψ(x',y',z') is an amplitude of pair creation at a location r'(x',y',z'). For a special case of an infinitely extended EPR state the amplitude of pair production ψ(x',y',z') is constant for any arbitrary position vector 𝐫'. A symbol ⊗ denotes separation of quantum states of different uncoupled degrees of freedom.\n Consider magnitudes of photons momenta are equal, p_1=p_2=p. Therefore, due to Bosonic nature of identical photons, a symmetric quantum state of photons is written as |Ψ⟩= 1/√(2)(|Ψ⟩_12+|Ψ⟩_21), where |Ψ⟩_21 is a quantum state given in Eq. <ref> after the exchange of photons.\nTherefore, after symmetrization <cit.>, a total symmetric quantum state can be written as\n\n    |Ψ⟩= A_o∫^∞_-∞∫^∞_-∞∫^∞_-∞ψ(x',y',z')\n      e^ip|𝐫_a-𝐫'|/ℏ/|𝐫_a-𝐫'|e^ip|𝐫_b-𝐫'|/ℏ/|𝐫_b-𝐫'|dx'dy'dz' ⊗1/√(2)(|H⟩_1|V⟩_2+|V⟩_1|H⟩_2)\n\n\nThis integral represents a continuous variable entangled quantum state for a finite extension of EPR source and 1/√(2) (|H⟩_1|V⟩_2+|V⟩_1|H⟩_2) represents a discrete variable symmetric polarisation entangled state. Total quantum state in Eq. <ref> is a hyper-entangled state, this combined quantum state is a tensor product of quantum entangled states in different degrees of freedom.\n\nA pair creation amplitude is considered be a gaussian function such that ψ(x',y',z')= a e^-(x'^2+y'^2)/σ^2e^-z'^2/w^2, where a is a constant, σ and w are the widths of the gaussian. Consider two planes parallel to xy-plane located on z-axis at distance s_1 (plane-1) and s_2 (plane-2) from origin. An amplitude to find photon-1 on plane-1 and photon-2 on plane-2 can be evaluated close to z-axis as follows. Consider distances of planes are such that σ^2p/h s_1≥ 1 and σ^2p/h s_2≥ 1, where s_1 and s_2 are much greater than σ and w. This approximation is applicable to the experimental considerations presented in this paper. However, in Ref.<cit.>, a small source extension is considered i.e. σ^2p/h s_1≪1 and σ^2p/h s_2≪ 1, which leads to a  momentum-polarisation hyper-entanglement of photons.\n\nTherefore, Eq. <ref> becomes\n\n\n    |Ψ⟩= a A_o/s_1s_2 e^ip(s_1+s_2)/ℏ∫^∞_-∞e^-x'^2/σ^2 e^ip/ℏ((x_1-x')^2/2s_1+(x_2-x')^2/2s_2)dx' ∫^∞_-∞e^-y'^2/σ^2 e^ip/ℏ((y_1-y')^2/2s_1+(y_2-y')^2/2s_2)dy' ∫^∞_-∞e^-z'^2/w^2 e^-i2p/ℏz'dz'\n    ⊗1/√(2)(|H⟩_1|V⟩_2+|V⟩_1|H⟩_2)\n\n\n\nAfter solving this integral,  Eq. <ref> can be succinctly written as |Ψ⟩= Φ(x_1,y_1; x_2, y_2) ⊗ (|H⟩_1|V⟩_2+|V⟩_1|H⟩_2)/√(2),\nwhere Φ(x_1,y_1; x_2, y_2) is a two-photon position amplitude with variables in the argument separated by a semicolon denoting a position of photon-1 on plane-1 and of photon-2 on plane-2 such that\n\n\n    Φ(x_1,y_1; x_2, y_2)= c_ne^ip/ℏ(s_1+s_2) e^-iϕ/(4s^2_1s^2_2+(p/ℏ)^2σ^4 (s_1+s_2)^2)^1/2exp(-(p/ℏ)^2(s_1 s_2σ)^2((x_1/s_1+x_2/s_2)^2+ (y_1/s_1+y_2/s_2)^2)/4s^2_1s^2_2+(p/ℏ)^2σ^4 (s_1+s_2)^2-(p/ℏ)^2w^2)\n    exp( -ip/2 ℏ((x_1/s_1+ x_2/s_2)^2 +  (y_1/s_1+ y_2/s_2)^2)  (p/ℏ)^2σ^4 s_1 s_2 (s_1+s_2) /4s^2_1s^2_2+(p/ℏ)^2σ^4 (s_1+s_2)^2)\n       exp(ip/2 ℏ(x^2_1+y^2_1/s_1+x^2_2+y^2_2/s_2))\n\n\n\nprovided tan(ϕ)=-p(s_1+s_2)σ^2/2ℏ s_1 s_2 with c_n as a constant.  The resulting quantum state of photons is a product of a continuous variable EPR entangled quantum state, where position states of photons on two planes are quantum entangled with each other, and a discretely entangled quantum state in the polarisation degree of freedom.  In this analysis to evaluate Φ(x_1,y_1; x_2, y_2), photons propagation close to z-axis is considered. However, by considering propagation along all directions in three-dimensional space for a large distance from the source, it is shown in Ref.<cit.> that photons propagate in opposite direction along z-axis. Therefore, equation of plane-1 is z=-s_1 where photon-1 is found and of plane-2 is z=s_2 where photon-2 is found.\nIn actual experiment, anti-symmetric polarisation entangled state is produced as it remains same in the diagonal polarisation basis.  Photons are propagating in the opposite direction along z-axis from the source, in non-overlapping regions. This imposes a condition that Φ(x_2,y_2; x_1, y_1)=0, when photons are further exchanged <cit.>. Therefore, a hyper-entangled state produced by source can be written as\n\n    |Ψ⟩= Φ(x_1,y_1, z_1=-s_1; x_2, y_2, z_2=s_2) ⊗1/√(2)(|H⟩_1|V⟩_2-|V⟩_1|H⟩_2)\n\nwhere z-position of photons is incorporated in Φ(x_1,y_1, z_1=-s_1; x_2, y_2, z_2=s_2).\n\n\n\n\n\n §.§ Quantum ghost interference\n  EPR entanglement part of Eq. <ref> produces a quantum ghost interference <cit.>, which can be captured on a coincidence camera if a polarisation sensitive phase pattern is replaced with a double-slit positioned in a plane z=-s_1, which is plane-1. Since a double-slit under consideration is polarisation independent therefore, polarisation entanglement does not contribute to ghost interference.  Polariser-1 and polariser-2 can be removed to make no polarisation measurement. A convex lens L_o focus photon-1 on a single photon detector. Detection of photon-1 at the detector projects quantum state of photon-1 onto a momentum state in a plane z=-s_1. In other words, this measurement projects photon-1 quantum state onto a quantum superposition of position states in a plane of the double-slit. This measurement does not reveal any which-path information at the double-slit. Interference pattern is produced in coincidence measurements of photons, where position of photon-2 is measured in a plane defined as an interference plane, which is same as  z=s_2 plane-2, located in path of photon-2. To obtain a quantum ghost interference, an imaging lens is removed and a camera detector surface is placed in the interference plane to detect position of photon-2. In another configuration, an imaging lens is placed such that its object plane corresponds to an interference plane and a corresponding image plane is further imaged by a telescope onto the camera. The latter configuration is preferable in experiments involving a long optical path.\n\nConsider a double-slit of slit separation d along x-axis at y=0. A transmission function of the double-slit can be written as A_T(x_1,y_1)= (δ(x_1-d/2)δ(y_1)+δ(x_1+d/2)δ(y_1))/√(2). Therefore, an amplitude of coincidence detection of photon-1 by the detector and photon-2 in the interference plane at a location (x_2, y_2) can be written as\n\n    A_12(x_2, y_2)= ∫^∞_-∞∫^∞_-∞A_T(x_1, y_1)\n       Φ(x_1,y_1, -s_1; x_2, y_2, s_2) dx_1dy_1\n\nHere, integration represents a projection onto a quantum superposition of position states of photon-1 in plane-1 containing a double-slit. Therefore, the probability of coincidence detection P_12(x_2, y_2)=|A_12(x_2,y_2)|^2 represents a quantum ghost interference. Quantum ghost interference patterns shown in  Fig. <ref> are obtained by solving Eq. <ref>, for a double-slit located  at z=-s_1=-1.33 m and an interference plane located at z=s_2=1 m. A slit separation of double-slit is d=2 mm and σ=3 mm. In Fig. <ref> (a), single slits of the double-slit are positioned at x_1=1 mm and x_1=-1 mm and in (b) single slits are positioned at y_1=1 mm and y_1=-1 mm. A quantum ghost interference pattern originates due to EPR-entanglement of Φ(x_1,y_1, -s_1; x_2, y_2, s_2).\n\n\n\n §.§ Quantum ghost imaging of a polarisation sensitive phase pattern: Theory\n\nTo  produce a quantum ghost image of a transparent polarisation sensitive phase pattern an imaging lens of focal length f is positioned such that the pattern is located in its object plane z=-s_1 at a distance u from  imaging lens, where u>f. Coincidence camera is positioned in an image plane of imaging lens located at a distance v from the lens. Imaging lens and pattern are positioned on opposite locations w.r.t. source as shown in Fig. <ref>.  Therefore, position of imaging lens from origin is s_2=u-s_1. Neither of the photons reveal information of the pattern therefore, a quantum ghost image is obtained by making correlated joint measurements on both photons.\n\nConsider, a cartesian coordinate (ξ,η)-plane, coinciding with a plane z=s_2 with origin on z-axis, where a thin imaging lens is positioned such that ξ-axis is parallel to x-axis and η-axis is parallel to y-axis. A polarisation sensitive phase pattern transforms the polarisation quantum state of photon-1 as a unitary transformation i.e. |H⟩_1↦ e^iϕ(x_1, y_1)|H⟩_1 and |V⟩_1↦|V⟩_1 at a position (x_1, y_1) on the pattern. Where ϕ(x_1, y_1) is an arbitrary position dependent phase shift introduced by the pattern. This transformation couples the polarisation entanglement with a position of photon-1 on the pattern. A quantum image state is defined as a quantum state that results in coincidence detection of photon-1 at a position (x_1, y_1) just after passing through the pattern and photon-2 at a position (x_2, y_2) in the image plane of imaging lens but without polarisation measurement.  A quantum image state can be written as\n\n\n    |Ψ⟩_I=c_I∫^∞_-∞∫^∞_-∞Φ(x_1,y_1, -s_1; ξ,η, s_2) a_p2(ξ,η) e^-ip/ℏ(ξ^2+η^2)/2 f\n        e^ip/ℏ((x_2-ξ)^2/2v+(y_2-η)^2/2 v)dξdη\n    1/√(2)(e^iϕ(x_1,y_1)|H⟩_1|V⟩_2-|V⟩_1|H⟩_2)\n\nwhich is succinctly written as |Ψ⟩_I= Φ_I(x_1, y_1; x_2, y_2) (e^iϕ(x_1,y_1)|H⟩_1|V⟩_2-|V⟩_1|H⟩_2)/√(2), where c_I is a constant, a_p2(ξ,η) is a transmission function of an aperture placed close to the imaging lens, e^-ip(ξ^2+η^2)/2fℏ is the phase shift term introduced by the imaging convex lens. After transmission through the lens, photon-2 propagates to the imaging plane where propagation from a position (ξ,η) to a position (x_2, y_2) is given by the term\ne^ip((x_2-ξ)^2+(y_2-η)^2)/2vℏ. For a circular lens of radius ρ without any additional aperture, the transmission aperture function a_p2(ξ,η) = 1 for ξ^2+η^2≤ρ^2 and zero otherwise.\n\nA quantum ghost image is obtained by correlating the joint measurements of polarisation and momentum of photon-1 in the object plane with measurements of polarisation and position of photon-2 in the image plane. Consider a diagonal polarisation basis for  photon-j (j=1 or 2) such that |d^+⟩_j=(|H⟩_j+|V⟩_j)/√(2) and |d^-⟩_j=(|H⟩_j-|V⟩_j)/√(2), where |d^+⟩_j, |d^-⟩_j represent linear polarisation states of photon-j with planes of polarisation at δ_j=+45^o and δ_j=-45^o w.r.t. x-axis, respectively.\nIf pass axes of polariser-1 and polariser-2 are oriented at δ_1=δ_2=-45^o then photon-1 is measured in a polarisation state  |d^-⟩_1 and photon-2 is measured in a polarisation state  |d^-⟩_2 after their detection. Therefore, from Eq. <ref> the probability of coincidence detection corresponding to a polarisation measurement outcome (|d^-⟩_1, |d^-⟩_2) can be calculated as\n\n\n    P_d^-_1, d^-_2(x_2,y_2)=|∫^∞_-∞∫^∞_-∞_2⟨ d^-|_1⟨ d^-|Ψ⟩_I a_p1(x_1,y_1)dx_1dy_1|^2\n\nwhich can be written as\n\n    P_d^-_1, d^-_2(x_2,y_2)=|∫^∞_-∞∫^∞_-∞ a_p1(x_1,y_1) Φ_I(x_1, y_1; x_2, y_2)\n     (1-e^iϕ(x_1, y_1)/2√(2))dx_1dy_1 |^2\n\nwhere a_p1(x_1,y_1) is the aperture transmission function of an aperture placed just after the pattern being imaged.\n\nSimilarly, if polarisers are aligned such that δ_1=+45^o and δ_2=-45^o for (|d^+⟩_1, |d^-⟩_2) measurement, then the probability of coincidence detection of photons can be written as\n\n    P_d^+_1, d^-_2(x_2, y_2)=|∫^∞_-∞∫^∞_-∞ a_p1(x_1,y_1)Φ_I(x_1, y_1; x_2, y_2)\n     (1+e^iϕ(x_1, y_1)/2√(2))dx_1dy_1|^2\n\n The coincidence detection probability represents a quantum ghost image of a polarisation sensitive phase pattern. Quantum  ghost images P_d^-_1, d^-_2(x_2,y_2) and P_d^+_1, d^-_2(x_2,y_2) are inverted w.r.t each other.\n\n\n\n §.§ Experiment\n\n\n\n\nA polarisation sensitive phase pattern under consideration is shown in Fig. <ref> (a), which is produced by SLM. A lighter region on the pattern introduces a phase shift ϕ(x_1,y_1)=π for horizontally polarised photon-1 and a darker region corresponds to ϕ(x_1,y_1)=0. After a transformation by the pattern i.e. |H⟩_1↦ e^iϕ(x_1, y_1)|H⟩_1 and |V⟩_1↦|V⟩_1, a polarisation entangled state of photons becomes |Ψ^-⟩_p=(|H⟩_1|V⟩_2-|V⟩_1|H⟩_2)/√(2) for ϕ(x_1,y_1)=0 and |Ψ^+⟩_p=-(|H⟩_1|V⟩_2+|V⟩_1|H⟩_2)/√(2) for ϕ(x_1,y_1)=π.  A schematic of experiment performed is shown in Fig. <ref>. Hyper-entangled photons are produced by type-II SPDC process in a beta-barium-borate (BBO) nonlinear anisotropic crystal. A broad beam diameter pump laser light of wavelength 405 nm is incident on the crystal, which is aligned to produce non-collinear degenerate 810 nm photons. Photons are hyper-entangled at the intersection of conical emission profiles of down converted photons. Intersection regions expand with distance from BBO crystal and width of each region is about 7 mm in a transverse plane at a distance 1.33 m from the crystal. EPR entanglement and polarisation entanglement are produced at the intersection regions. A compensation crystal is placed after the first BBO crystal to compensate for longitudinal and transverse walk-offs.  Compensation crystal is aligned parallel to the first crystal such that optic axes of both crystals are parallel to each other and both photons pass through the compensation crystal. A half wave-plate is inserted between the two crystals to interchange orthogonal linear polarisation states. Photon-1 of an entangled pair is incident on SLM close to a normal incidence, which produces a polarisation sensitive phase pattern. Difference between angle of reflection and angle of incidence on SLM is about 8^o. After passing through a convex lens L_o, polariser-1 and an optical bandpass filter of center wavelength 810 nm, photon-1 is detected by a single photon detector. Photon-2 never interacts with the pattern and it passes through an imaging convex lens. Imaging lens is positioned such that it produces an image of SLM surface onto the image plane as shown in Fig. <ref>. This image plane acts as an object for a telescope, which produces its image on ICCD camera. Photon-2 travels a longer optical distance as compared to photon-1 in order to provide time to ICCD camera to open its direct gate electronic shutter after receiving a trigger signal from single photon detector. ICCD camera direct gate shutter opening delay time is 20 ns after receiving a trigger signal. Optical distance of ICCD camera from BBO crystal is 17.83 m and an optical distance of SLM surface from ICCD camera is 19.16 m. Optical distance of SLM surface from BBO crystal is 1.33 m. Focal length of imaging lens is 1.5 m, this lens images SLM surface onto the image plane as shown in Fig. <ref> however, imaging lens distance from BBO crystal is same as its focal length to collimate non-interacting photons on the telescope, otherwise photon coincidence counts reduce considerably.\n\nTelescope consists of three convex lens system, where lens L_1 of focal length 40 cm and diameter 5 cm produces a real image of an image plane of the imaging lens. Lens L_2 of focal length 10 cm produces a virtual image of the real image produced by lens L_1. Lens L_3 of focal length f_3= 1 m is configured in a 2f_3 imaging configuration such that ICCD camera detector surface is placed at a distance 2 m from lens L_3 to image the virtual image produced by lens L_2. Since a virtual image is displaced by displacing lens L_2 therefore, a sharp image is produced on ICCD camera sensor surface if virtual image is located at a distance 2f_3 from lens L_3. In this configuration, only lens L_2 is displaced to image any plane under consideration. Polariser-2 is placed close to ICCD camera after the telescope. Polariser-1 is placed at a distance 22 cm from SLM as shown in Fig. <ref>.\n\nPolarisation entanglement part of the hyper-entangled state is characterised by violating Clauser, Horne, Shimony, Holt (CHSH) inequality i.e. 0<|S|<2 <cit.>. Experimentally measured value of parameter is S=-2.57. A polarisation sensitive phase pattern is shown in Fig. <ref> (a). A quantum ghost image of the pattern is constructed by measuring coincidence photon counts between single photon detector and different locations on ICCD camera. Prior to any quantum ghost image measurement, a coincidence background ghost image is captured on ICCD camera by imprinting a uniform polarisation sensitive phase pattern on SLM that leads to minimum coincidence photon counts for the same inclination of polarisers that is δ_1=δ_2=-45^o. This background image is subtracted from all subsequent images to obtain a quantum ghost image. A polarisation sensitive phase pattern is shown in Fig. <ref>(a), where a lighter region transforms the polarisation entangled state to |Ψ^+⟩_p and a darker region represents an identity transformation resulting same polarisation entangled state |Ψ^-⟩_p as produced by the source. A quantum ghost image of this polarisation sensitive phase pattern is shown in Fig. <ref> (b) for same inclination of pass axes of polarisers i.e. δ_1=δ_2=-45^o.  The quantum ghost image of the same pattern gets inverted as shown in Fig. <ref> (c), when pass axis of polariser-1 is inclined at δ_1=+45^o and pass axis of polariser-2 remains at same inclination, δ_2=-45^o. A coincidence background image and a coincidence image with the pattern under consideration are taken for 30 min time of exposure of ICCD camera under the direct gate operation in accumulation mode. In accumulation mode,  frames captured during the exposure time are accumulated. However, a frame can register photon-2 only if direct gate shutter is opened by the trigger signal during its acquisition. Negative coincidence counts regions in Fig. <ref> (b) and (c) are due to experimental fluctuations because each quantum ghost image is constructed by subtracting a background image from an image with the pattern. The quantum ghost image shown in Fig. <ref>(c) is an inverted image w.r.t. the quantum ghost image shown in Fig. <ref>(b).  Demagnification of each image is 0.87. Single photon-2 accumulation on ICCD camera without making any correlation with photon-1 measurements results in no image formation.\n\n\n\n§ CONCLUSION\n\nThis paper presented an experiment on quantum ghost imaging of a transparent polarisation sensitive phase pattern with EPR-polarisation hyper-entangled photons. Since the pattern is polarisation sensitive therefore, polarisation entanglement is incorporated  to detect a polarisation sensitive phase exhibited by the pattern. A quantum ghost image is a combined result of EPR entanglement and polarisation entanglement of photons.  Paper presented a detailed analysis of hyper-entanglement of photons, quantum ghost interference and quantum ghost imaging. The required hyper-entangled state is produced with type-II SPDC process in a BBO crystal. The experiment is performed with a gated ICCD single photon sensitive camera to capture coincidence ghost images. Each quantum ghost image is background corrected. Two joint measurements on each photon, which correspond to polarisation, momentum of photon-1 and polarisation, position of photon-2, are correlated to construct a quantum ghost image.\n\n\n\n§ METHODS\n\nHyper-entangled photon pairs are produced by Type-II degenerate SPDC process in a BBO crystal at 810 nm. This source configuration is different from the configuration used in a previously published quantum imaging experiment based on hyper-entangled photon pairs, where a hyper-entangled state consists of momentum entanglement and polarisation entanglement, which is produced at a very large distance from the source as described in Ref.<cit.>. In the present paper, hyper-entangled state consists of EPR-entanglement and polarisation entanglement, which is produced at the intersection of down converted cones. However, in the present source the beam size of the pump laser beam is approximately expanded by twenty times as compared to the source described in Ref.<cit.>. In this configuration, the integral given by Eq. <ref> cannot be approximated as given in the previous paper Ref.<cit.>.  EPR entanglement produces quantum ghost interference however, momentum entanglement cannot produce quantum ghost interference. EPR-entanglement and polarisation entanglement produce a quantum ghost image of the polarisation sensitive phase pattern. Typical pump laser power passing through the BBO crystal is 60 mW at 405 nm. A walk-off compensation crystal of half thickness is placed parallel to the first crystal and a half wave plate is placed between the two crystals to interchange orthogonal linear polarisation states.   Diameter of each intersection region of cones expands with distance from the crystal. The required EPR-polarisation hyper-entangled state is produced at the intersection regions. No image is observed for non-interacting photon accumulation on ICCD camera without correlating it with the interacting photon. In a coincidence measurement, the direct gate electronic shutter of ICCD camera is opened by a trigger pulse generated by the single photon detector after detection of an interacting photon. Direct gate shutter opening allows a detection of photon by the ICCD camera. Direct gate shutter remains open for the duration of trigger pulse which is 10 nsec. Single photon detector produces 2×10^4 trigger pulses per second. Therefore, the direct gate shutter opens 3.6×10^7 times in 30 min while camera is accumulating frames continuously.  A narrow time window and low photon pair generation rate allow a selective detection of an entangled pair of photons i.e. it significantly reduces the overlapping of detection events of a selected pair of photons with another pairs. Ghost images shown in Fig. <ref> correspond to accumulation of photon counts in the coincidence window for 30 min time of frame-accumulation on the ICCD camera. A separate background ghost image of a uniform pattern is taken under same conditions. Background image is subtracted from each image of a pattern under consideration to obtain its background corrected ghost image shown in Fig. <ref>. Image accumulation and background substraction are performed by the ICCD camera.\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n Mandip Singh acknowledges research funding by the Department of Science and Technology, Quantum Enabled\nScience and Technology grant for project No. Q.101 of theme title “Quantum Information Technologies with\nPhotonic Devices”, DST/ICPS/QuST/Theme-1/2019 (General).\n\n\n\n§ AUTHOR CONTRIBUTIONS\n\n MS setup the experiment. MK, AS and MS performed the experiment. MK, AS and VD took data. MS developed concept and theory. MS drawn diagrams and wrote the manuscript.\n\n\n\n\n\n\n§ COMPETING INTERESTS\n\n\nThe authors declare no competing interest.\n\n\n\n§ DATA AVAILABILITY STATEMENT\n\n\nAll data generated or analysed during this study are included in this published article.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}