{"entry_id": "http://arxiv.org/abs/2303.07106v2", "published": "20230313134257", "title": "Design, Control, and Motion Strategy of TRADY: Tilted-Rotor-Equipped Aerial Robot With Autonomous In-flight Assembly and Disassembly Ability", "authors": ["Junichiro Sugihara", "Takuzumi Nishio", "Keisuke Nagato", "Masayuki Nakao", "Moju Zhao"], "primary_category": "cs.RO", "categories": ["cs.RO"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDesign, Control, and Motion Strategy of TRADY: Tilted-Rotor-Equipped Aerial Robot With Autonomous In-flight Assembly and Disassembly Ability\n    Junichiro Sugihara,\n        Takuzumi Nishio,\n        Keisuke Nagato,\n        Masayuki Nakao,\n        and Moju Zhao\nJunichiro Sugihara, Keisuke Nagato, Masayuki Nakao, and\n        Moju Zhao (corresponding author) are with the Department of Mechanical-Engineering, The University of Tokyo, Bunkyo-ku, Tokyo 113-8656, Japan (e-mail:j-sugihara@jsk.imi.i.u-tokyo.ac.jp; chou@jsk.imi.i.u-tokyo.ac.jp; nagato@hnl.t.u-tokyo.ac.jp; nakao@hnl.t.u-tokyo.ac.jp).\n        \nTakuzumi Nishio is with the Department of Mechano-Infomatics, The University of Tokyo, Bunkyo-ku, Tokyo 113-8656, Japan (e-mail:nishio@jsk.imi.i.u-tokyo.ac.jp).\n\n\n    March 30, 2023\n==================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\n\nVarious types of aerial robots have been demonstrated in prior works\n with the intention of enhancing their maneuverability or manipulation\n capabilities. However, the problem remains in earlier researches that\n it is difficult to achieve both mobility and manipulation capability. This\n issue arises due to the fact that aerial robots with high mobility\n possess insufficient rotors to execute manipulation tasks, while\n aerial robots with manipulation ability are too large to achieve\n high mobility. To tackle this problem, we introduce in this article a\n novel aerial robot unit named TRADY. TRADY is a tilted-rotor-equipped\n aerial robot with autonomous in-flight assembly and disassembly\n capability. It can be autonomously combined and separated from another\n TRADY unit in the air, which alters the degree of control freedom of\n the aircraft by switching the control model between the under-actuated\n and fully-actuated models. To implement this system, we begin by\n introducing a novel design of the docking mechanism and an optimized\n rotor configuration. Additionally, we present the configuration of the\n control system, which enables the switching of controllers between\n under-actuated and fully-actuated modes in the air. We also include the\n state transition method, which compensates for discrete changes during\n the system switchover process. Furthermore, we introduce a new motion\n strategy for assembly/disassembly motion that incorporates recovery\n behavior from hazardous conditions. Finally, we evaluate the\n performance of our proposed platform through experiments, which\n demonstrated that TRADY is\n capable of successfully executing aerial assembly/disassembly motions\n with a rate of approximately 90%. Furthermore, we confirmed that in the assembly state,\n TRADY can utilize full-pose tracking, and it can generate more than\n nine times the torque of a single unit. To the best of our knowledge,\n this work represents the first time that a robot system has been\n developed that can perform both assembly and disassembly while\n seamlessly transitioning between fully-actuated and under-actuated\n models.\n\n\n\n\n\nAerial systems, mechanics and control, aerial assembly and disassembly,\n distributed control system.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n \nIn recent years, aerial robots have undergone\nsignificant development <cit.>, <cit.> and have proven to be useful for various\npractical applications. Compact aerial robots such as quadrotors with\nterrain-independent mobility have enabled\n\n \n various autonomous applications such as cinematography <cit.>,\ninspection <cit.>, disaster response <cit.>, and\nsurveillance <cit.>. Furthermore, to enhance mobility, numerous designs that\nenable robots to navigate through narrow spaces have been proposed, such\nas quadrotors with morphing capabilities that allow their airframe to\nshrink <cit.>. On the other hand, there has been a growing demand for aerial\nrobots to possess manipulation capabilities, which require larger\ncontrollable degrees of freedom (DoF) and available force and torque (wrench). As a\nsolution, more intricate and sizable aerial robots have been developed,\nincluding multirotors equipped with over six tiltable rotors enabling\nomni-directional control <cit.>, and arm-manipulator-installed multirotors\ncapable of interacting with the environment <cit.>.However, a significant issue in the conventional works is the inherent trade-off between\nmobility and manipulation capability. To clarify, High-mobility\nunder-actuated aerial robots often lack the necessary controllable DoF\nand available wrench to achieve manipulation tasks, whereas\nfully-actuated robots with manipulation capability often lack\ncompactness. To address this problem, some researchers have\nproposed a transformable multilink design <cit.> that enables robots to\nnavigate narrow spaces and perform manipulation tasks using their entire\nbody <cit.>. Nonetheless, these transformable aerial robots\nrequire a significant number of additional\nactuators, making them heavy, and even with transforming capability, it remains challenging\nto achieve the same maneuverability as a small quadrotor in a narrow\nspace with three-dimensional complexity.In this article, we present a solution to the aforementioned trade-off problem by introducing TRADY, a novel aerial robot platform that can perform aerial assembly\nand disassembly motion, as depicted in figure:trady_main (A), while changing\nits controllable DoF and available wrench. In its unitary state, TRADY\nis a compact under-actuated quadrotor, however, in its assembly state,\nit becomes a fully-actuated octorotor, enabling it to execute aerial\nmanipulation tasks as depicted in figure:trady_main (B).\n\n\n\n §.§ Related works\n\nTRADY is a type of modular aerial robot, and previous studies have\n developed several other modular aerial robots. In <cit.>, Naldi\n et al. introduce a single ducted-fan module, and in <cit.>, a\n tetrahedron-shaped quadrotor module consisting of four fractal\n single-rotor submodules is presented. Furthermore, in <cit.>, a\n modular quadrotor equipped with tilted rotors is proposed. These\n modular aerial robots can combine with one another and expand their\n degrees of freedom and wrench, however, <cit.> are currently not focused\n on self-assembly/disassembly. On the other hand, several aerial robots\n capable of self-assembly or self-disassembly have previously been developed. For\n instance, in <cit.>, <cit.>, a robot unit composed of wheels\n and rotors capable of docking on the ground and taking off afterwards\n is presented. Additionally, in <cit.>, a modular quadrotor with\n the capability of aerial self-assembly is proposed, followed by one\n with the ability of aerial self-disassembly proposed in\n <cit.>. However, the issue that remains is that the robot\n presented in <cit.>, <cit.> is restricted to\n assembly/disassembly on the ground, and mid-air assembly/disassembly are unfeasible,\n whereas <cit.>, <cit.> virtually specialize in\n either aerial assembly or aerial disassembly but not both. Futhermore, assembly or disassembly motion\n demonstrated in\n <cit.> are\n unaccompanied by the alternation of controllable DoF, implying that the\n robots are under the control of an under-actuated model in both the\n assembly and unitary states. The utilization instance\n of TRADY envisioned in this research comprises tasks illustrated in\n figure:trady_concept. To accomplish this, movement in a narrow\n space must be carried out in the unitary state, and during manipulation\n tasks, the\n units must assemble to extend the controllable DoF and wrench, then\n return to the unitary state afterwards. Therefore, the compatibility of\n aerial self-assembly and self-disassembly, and the consequent alteration of the\n controllable DoF, remain crucial unachieved issues that are\n necessary for realizing TRADY. In this study, we tackle this issue\n from the perspectives of design, control, and motion strategy.\n\nConcerning the design of the self-docking mechanism, various designs\nhave been previously presented. For example, in <cit.>,\nautonomous boats equipped with hook-string docking mechanisms are\nintroduced. In this system, the hooks of the male mechanism attach to\nthe loop of string on the female mechanism, and the female side winches\nthe loop of thread and the male mechanism together, thereby merging the\nmodules. While this mechanism works effectively on the water, the\ncoupling force is not sufficiently strong to be applicable to aerial\nsystems. On the other hand, in <cit.>, to achieve aerial docking, a\nquadrotor is enclosed in a rectangular frame equipped with permanent\nmagnets. While this mechanism can construct a highly rigid structure, it\nhas the disadvantage of being unable to release the coupling once it has\nbeen established. On the contrary, a quadrotor unit that can undock\nthrough the torque generated by the unit itself is developed in\n<cit.>. However, to achieve undocking capability, the docking mechanism is\nsignificantly downsized in comparison to the one used in <cit.>, and the\ndesign is not suitable for aerial docking. Furthermore, as the docking\ncan be released through the torque output of a unit, the strength of the\nmechanism becomes a bottleneck for available torque, making it arduous to execute\ntasks that necessitate high torque. As an alternative method for\nreleasing the magnetic coupling, the utilization of elastic energy is\nproposed in <cit.>. The mechanism proposed in <cit.> shortens the internal\nspring of the mechanism using an actuator, and releases it to generate\nrestoring force, thereby releasing the magnetic coupling. In the case of\nthis mechanism, it is possible to release high rigidity coupling by\nusing a spring with a high spring constant and a powerful\nactuator. However, pulling and detaching magnets in the translational\ndirection is an inefficient, resulting in the mechanism becoming\nextremely large. Furthermore, with the docking mechanism that uses\nmagnets, in addition to the method of detachment, attention should be\npaid to the magnetic interference from the external environment. When\nthe structure exposes the magnet to the outside as in [1], [2], although\nnormal flight is not a problem, magnetic interference from the\nsurroundings becomes a significant obstacle in manipulation tasks and\ninteraction with the external environment. Therefore, in this work, we introduce a novel\nhigh-rigidity docking mechanism, which consists of a powerful magnetic mechanism that can be switched\non and off by a low-torque motor and a movable peg, thus enabling both\naerial docking and undocking to be achieved. Furthermore, we ensure that\nthe magnets are not exposed to the outside during flight through\nappropriate structural design.\n\nRegarding rotor configuration, in order to expand the controllable DoF\nand available wrench through assembly and change the control model from\nan under-actuated model to a fully-actuated model, it is necessary to\nuse tilted rotors. As mentioned earlier, <cit.> has made it possible to\nachieve fully-actuated model control by combining four quadrotor units\nof different types with tilted rotors. In this case, the concept of the\nactuation ellipsoid is used to determine the appropriate rotor\nconfiguration. In this work, we propose a new rotor configuration\noptimization method that focuses not only on maximizing the performance\nin the assembly state, but also on achieving high-precision aerial\nself-assembly/disassembly motion. Additionally, in order to achieve\nsimplicity in the system, TRADY acheive fully-actuated model by docking\ntwo unit quadrotors with the same rotor configuration.\n\nSubsequently, regarding the controller, TRADY utilizes distinct controllers for\nthe assembly and unitary states. The aircraft in the assembly state is a\ntypical fully-actuated multirotor, which can employ a conventional hexarotor control\nmethod based on thrust allocation matrices, as presented in\n<cit.>, <cit.>. By means of this method, TRADY in\nthe assembly state is capable of controlling six DoF, which consist of\nforces and torques in all axes. On the other hand, TRADY in its unitary state\nis a tilted quadrotor that is controlled as a under-actuated model. In this\ncase, the controllable DoF are four: the z-direction\nforce and torque on all axes, but it is not possible to control the x\nand y-directional forces generated by the tilted rotors. Therefore, it is\nnecessary to suppress the generation of these horizontal forces through some\nmeans. While in <cit.>,\nwhich also uses a tilted quadrotor as a unit machine, the horizontal\nforces are suppressed solely through design method, in this work, we focuses on suppressing the\nhorizontal forces through both design and control method. Therefore, LQI\ncontrol is adopted for unit control, explicitly minimizing the\nhorizontal forces generated during flight. Another important point to\nconsider in the control of TRADY is the switching between under-actuated\nand fully-actuated models during aerial assembly/disassembly motion. When the control\nmodel is discretely changed during flight, the control of the vehicle\nbecomes unstable (e.g., the vehicle suddenly rising or falling) due to\nthe influence of model errors. The elimination of this instability is\ncrucial for achieving stable assembly/disassembly. Therefore, in this\nstudy, we introduce a novel method to eliminate this instability by applying\nour own transition processing during the control model switching. Finally, regarding motion strategy, several previous studies have\npresented strategies for self-assembly of robots. For instance, in\n<cit.>, a path planning method based on global optimization is employed to\nenable self-assembly of boats on water surfaces, while <cit.> utilizes vehicle\nguidance via gradient method for quadrotor self-assembly in\nmid-air. These strategy are efficacious in circumstances\nwhere the high positional accuracy of unit vehicles can be\nmaintained during the assembly motion. Nonetheless, when it comes to the\naerial assembly motion of unit vehicles that are furnished with tilted rotors,\nas employed in this study, the thrust of each unit interferes with one\nanother, resulting in unstable position control as the two units\napproach. Consequently, in this study, we assume the existence of\npositional errors and suggests a motion strategy that iteratively\napproaches until the assembly is successfully achieved,  while avoiding\ndangerous situations. This facilitates an autonomous and reliable\nassembly motion. Additionally, we extend the strategy to encompass\nself-disassembly, providing a comprehensive approach.\n\nTo sum up, the main contribution of this work can be summarized as\nfollows;\n\n\n \n \n  * We propose the design of docking mechanisms that combines strong\n       coupling and easy separation.\n \n  * We present the optimized rotor configuration to achieve controllability\n       with under-actuated model in the unitary state and with\n       fully-actuated model in the assembly state. Moreover, this rotor\n       configuration also takes into account the stability improvement\n       of aerial assembly/disassembly motion.\n \n  * We develop a control system that allows for switching between\n       control models and includes transition processing to compensate\n       for control instability during model switching.\n \n  * We introduce the motion strategy that enables autonomous and\n       stable aerial assembly/disassembly motion even in\n       situations where position control is unstable.\n \n \n\nAlthough we focus on the evaluation with two units, our methodology can be easily applied to more\nunits by installing both male and female docking mechanisms in a single\nunit. Furthermore, to the best of our knowledge, this is the first time\nto achieve the both self-assembly and self-dessembly with the same robot\nplatform in an autonomous manner, and also achieved the manipulation\ntask by switching between under-actuated and fully-actuated models.\n\n\n §.§ Notation\n\nFrom this section, nonbold lowercase symbols (e.g., m) represent\nscalars, nonbold uppercase symbols (e.g., R) represent sets or linear spaces, and\nbold symbols (e.g., u, Q) represent vectors or\nmatrices. Superscripts (e.g, ^{CoG}p)\nrepresent the frame in which the vector or matrics is expressed, and\nsubscripts represent the target frame or an axis, e.g.,\n^{ W}r_{ CoG } represents a\nvector point from { W} to { CoG}\nw.r.t. { W}, whereas u_x denotes the x component\nof the vector u.\n\n\n §.§ Organization\n\nThe remainder of this paper is organized as follows. The mechanical\ndesign including the design of docking mechanisms is presented in\nsec:mech_design, and the modeling of our\nrobot and optimized rotor configuration is introduced in\nsec:rotor_config. Next, the flight control and model switching method are\npresented in sec:control, followed by motion strategy in\nsec:motion_strategy. We then show the experimental result of\ntrajectory following flights, aerial assembly and disassembly, and\nobject manipulation tasks in sec:experiment before concluding\nin sec:conclusion.\n\n\n\n§ MECHANICAL DESIGN\n\nIn this section, we present the mechanical design of the proposed robot,\nTRADY. Initially, we provide an overview of the entire robot design and\nsubsequently expound upon the design of the docking mechanisms.\n\n\n §.§ Entire Robot Design\n\nIn this study, the minimum unit comprising TRADY is designed as a\nquadrotor unit. Each unit is equipped with a common rotor configuration,\nas well as either a male-side or female-side the mechanism at the\nsame position. Therefore, the overall structure of the device is\ndepicted in figure:whole_design.\n\n\n\n §.§ Docking Mechanism\n\nThe prerequisites for the design of a docking mechanism are twofold:\nfirstly, it should be capable of accomplishing both docking and\nundocking operations in the air, and secondly, it should possess\nsufficient rigidity to execute high-load tasks. Therefore, we propose a\nmethodology of coupling with a permanent magnet and movable pegs.\n\n\n  §.§.§ Female side\n\nAs shown in figure:female_mech, the main components of the female mechanism are a\npermanent magnet equipped with a magnetic switching mechanism and a\nmechanism called a drogue, which compensates for positioning\nerrors. The on-off switching of the magnetic force is realized by the principle\nillustrated in the cut model in figure:female_mech. In this mechanism, it is\npossible to interrupt the magnetic force by rotating one of the two\npermanent magnets 180deg using a servo motor. Since the two magnets do not directly touch each other, the force that\nhinders the rotation of the magnet is only friction with the housing,\nand rotation is easily possible with a low-torque servo motor. Through\nthe use of this magnet, restraint in the translational direction of the\ndocking mechanism is achieved.Furthermore, the drogue attached to the tip of the female mechanism is a\nmechanism adopted in autonomous aerial refueling systems for fighter\naircraft such as <cit.>, <cit.>,\nwhich compensates for control errors of the size corresponding to the\ndiameter of the mechanism. In this study, the radius of the drogue was\nset to 5cm in order to absorb errors within\n±2.5cm. Additionally, the gradient inside the drogue was\nempirically determined to be approximately 35deg. The drogue not\nonly compensates for position errors, but also has two additional\nfunctions. One is to improve rigidity by increasing the contact area,\nand the other is to prevent the influence of external magnetic forces by\ncovering the magnets.\n\n\n\n  §.§.§ Male side\n\nAs shown in figure:male_mech, the male mechanism is composed of an steel plate\nfor magnetic attraction and movable pegs. The movement of the peg is\nachieved using a slider-crank mechanism powered by a servo motor, and\nduring docking, the peg is inserted into the receptor of the female\nmechanism to provide confinement in the bending direction. The tip of\nthe mechanism is designed to closely adhere to the drogue of the female\nmechanism. The overall size of the docking mechanism is determined\nbased on the clearance that should be maintained between the rotors in\nthe assembly state.\n\n\n\n\n§ MODELING AND ROTOR CONFIGURATION\n\nIn this section, we introduce the kinematics and dynamics model of our\nrobot in the first place, followed by the thrust allocation. Then, we present the method of optimization of\nrotor configuration.\n\n\n §.§ Modeling\n\n\n\n\n\n\n\nThe kinematics model of TRADY is depicted in\nfigure:multirotor_model(A) and each quantities are difined as\nshown in table:multirotorparam. Since this model can be applied\nto multirotors with any number of rotors, the model of TRADY is\nrepresented by figure:multirotor_model with n = 4 in the unitary state, and with n = 8\nin the assembly state.Based on this kinematics model, the wrench-force\n^{CoG}f and torque\n^{CoG}τ )  can be written as\n\n\n    ^{CoG}f = ∑_i=1^nλ_i^{CoG}u_i,\n\n\n    ^{CoG}τ = ∑_i=1^nλ_i^{CoG}p_i×^{CoG}u_i+σ^{CoG}f,\n\nwhere {CoG} is the frame that have the origin at\nthe center-of-mass of the body.\nFrom (<ref>) and (<ref>), the\ntranslational and rotational dynamics of a multirotor unit are given by the Newton-Euler\nequation as followings:\n\n    M^{ W}r̈_{ CoG } =\n     ^{ W}R_{ CoG }^{CoG}f+\n     ([   0;   0; -Mg ]),\n\n\n    ^{CoG}I^{CoG}ω̇   =\n     ^{CoG}τ+σ^{CoG}f\n          -\n     ^{CoG}ω×^{CoG}I^{CoG}ω,\n\nwhere { W} frame represent the world coordinate system.\nThen, using (<ref>) and\n(<ref>), allocation from the thrust force λ\nto the resultant wrench can be given by following:\n\n    ([ ^{CoG}f; ^{CoG}τ ])\n     =\n     ([ Q_tran;  Q_rot ])\n     λ\n     =\n     Qλ,\n\nwhere\n\n    Q_tran = ( ^{CoG}u_1,^{CoG}u_2,⋯,^{CoG}u_n),\n\n\n    Q_rot = (^{CoG}v_1,^{CoG}v_2,⋯,^{CoG}v_n),\n\n\n    ^{CoG}v_i = ^{CoG}p_i×^{CoG}u_i.\n\nNote that the second term in (<ref>) is omitted for the\nremainder of the analysis because it is one order of magnitude smaller\nthan the first term in general.\n\n\n §.§ Thrust Allocation\n\n\n\n  §.§.§ In the Assembly State\n\nIn the assembly state, TRADY is fully-actuated, and the allocation matrics Q\nis full-rank. Therefore, we can gain MP pseudo-inverse\nmatrics ^#Q.\nGiven a desired wrench, the target thrust can be computed by following:\n\n    λ = ^#Q([ ^{CoG}f; ^{CoG}τ ]).\n\n\n\n  §.§.§ In the Unitary State\n\nIn the unitary\nstate, Q∈ R^6× 4 is rank deficient, and we need to adopt under-actuated model. As the conventional method, the control targets for\nunder-actuated model are f_z, τ_x, τ_y, and\nτ_z. Applying the control method illustrated in sec:control, we can\nachieve the hovering of a quadrotor unit with these four inputs.\nIn the case of a quadrotor with non-tilted rotors, because it does not produce\nf_x and f_y, desired thrusts are easily calcurated as following:\n\n    λ = ^#(^quadQ) ^t[ f_z τ_x τ_y τ_z ],\n\nwhere\n\n    ^quadQ = (\n         [ Q_tran,z;    Q_rot ]) ∈ R^4× 4 ,\n\nand Q_tran, z∈ R^1 × 4 is the third row vector\nof Q_tran.However, TRADY unit is a tilted quadrotor that produces translation forces\nf_x, f_y  and these are uncontrollable with\n(<ref>). Therefore,  assuming the existence of\nthe static thrust λ_s that enables hovering while suppressing the\ngeneration of f_x and f_y, we introduce a method to apply\n(<ref>) to the thrust\nallocation of tilted quadrotor by utilizing λ_s. In <cit.>, Zhao et al. use a tilted\ncoodinate system in order to obtain λ_s and we apply this\nidea to our work. Now, we introduce a new coodinate system {C} that has\nthe origin at the center-of-mass of body as shown in figure:multirotor_model(B). Furthermore, we define {C} to fulfill the following conditions:\n\n    Q_tran'λ_s = -mg,\n\n\n    Q_rot'λ_s = 0,\n\nwhere Q_tran', Q_rot' are allocation matrices defined\nin {C}.\n\n(<ref>), (<ref>)\nindicate that the direction of the resultant force due to\nλ_s coincides with the z-axis of\n{C}. In other word, by controlling the robot's attitude\nso that {C} is horizontal, it becomes possible to\nhover the robot without generating excess forces in the horizontal\ndirection. In this case, by using Q_tran' and Q_rot',\nthrust allocation can be achieved through (<ref>), similar to that\nof a non-tilt quadrotor. Therefore, we focus on deriving\nQ_tran', Q_rot', and {C}.Since both {C} and {CoG} have\norigins at the center-of-mass, from (<ref>),\nfollowing is also satisfied:\n\n    Q_rotλ_s = 0.\n\nAdditionally, regarding translation, following is valid from\n(<ref>):\n\n    F_z = mg,\n\nwhere F_z =  Q_transλ_s.\nThen, we difine the rotation matrics R_C that satisfies:\n\n    R_CF_z =^t[  0  0 mg ].\n\nIntegrating (<ref>),\n(<ref>), and (<ref>) we can gain follows:\n\n    R_C(\n      [ Q_tran;  Q_rot ])\n     λ_s\n     =\n     ^t[  0  0 mg  0  0  0 ] .\n\nComparing\n(<ref>) and (<ref>) with\n(<ref>), our discussion results in followings:\n\n    R_CQ_tran=Q_tran' ,\n\n\n    R_CQ_rot=Q_rot' .\n\nBecause (<ref>), (<ref>) mean that R_C\nis the rotation matrics that maps {CoG} to\n{C}, the conversion from {CoG} to\n{C} is easily calcurated with\nR_C. Furthermore, (<ref>) to (<ref>) suggest that if there exists\na Q that satisfies (<ref>) and\n(<ref>) for a given λ_s, it is\npossible to hover tilted quadrotor using that λ_s.\n\n\n §.§ Optimized Rotor Configuration\n\nThe TRADY rotor configuration must meet three prerequisites. Firstly, it\nmust enable fully-actuated model control in the assembly\nstate. Secondly, it should allow for under-actuated model control in the\nunitary state. Finally, it must attain the necessary flight properties\nrequired for aerial assembly/disassembly motion. Therefore, we propose a methodology to\noptimize the rotor configuration that satidsfies these conditions.\n\n  §.§.§ Fully-actuated Model Controllability\n\nInitially, we propose a technique for achieving fully-actuated model\ncontrol when TRADY is in the assembly state. As described in Equation 1,\nthe full rank of matrix Q is equivalent to fully-actuated\nmodel control, as Q can map L to an arbitrary wrench in real\nspace if it is full rank. However, each rotor has a limit of thrust\nforce, which can lead to instability of control due to weak resultant\nforce or torque in certain directions. Thus, rather than directly\nemploying algebraic methods to make Q full rank, we seek to\nmaximize the available force and torque region to ensure translational\nand rotational controllability in all axes. To accomplish this, a\nconcept of feasible control force convex polyhedron\n𝒱_ℱ, and torque convex polyhedron\n𝒱_𝒯 were introduced by <cit.>. These are\ndefined as follows:\n\n    𝒱_ℱ(U):={^{CoG}f∈ R^3| 0 ≤λ_i≤λ_max},\n\n\n    𝒱_𝒯(U):=\n      {^{CoG}τ∈R^3| 0≤λ_i≤λ_max} ,\n\nwhere the set of rotor direction vectors U is defined as\nU = [ u_1   ⋯ u_8;     ]. In addition, ^{CoG}f,\n^{CoG}τ are defined in\n(<ref>), (<ref>) and maximum thrust for\neach rotor in TRADY is denoted by λ_max, while the minimum\nthrust is established at 0, as we utilize unidirectional rotors.Then,  we define the values for the guaranteed minimum control force,\ndenoted as f_min, and the corresponding torque, represented by\nτ_min, in accordance with the subsequent equations are being\nsatisfied:\n\n    ^{CoG}f - m g≤ f_min ⇒ ^{CoG}f∈𝒱_ℱ,\n\n\n    ^{CoG}τ≤τ_min ⇒ ^{CoG}τ∈𝒱_𝒯.\nNote that our robot is controled under the premise that the roll and\npitch angles are proximate to zero. As such, we posit that the gravity\nforce is horizontal to the CoG frame, and we account for this force as\nan offset when defining the guaranteed control force.Therefore, by maximizing these f_min and τ_min, the guaranteed force and torque regions\ncan be maximized. Thus, we initially explicate the methodology for\ncomputing f_min.\nAs an example of feasible control force convex polyhedron which is depicted in\nfigure:convex, f_min is equal to the radius of the\ninscribed sphere of this polyhedron, and the same is true for\ntorque. Thereby, f_min is calculated by exploiting the distance d^f_ij(U), which is the length from\nthe origin to a plane of polyhedron  along its normal vector h^f_ij.\n\nThe calculation of d^f_ij(U) can be performed as following.\n\n    d_i j^f(U) =|∑_k=1^Nmax(0, λ_max ^th^f_ij^{CoG}u_k)\n      -\n       ^th^f_ijm\n      g|,\n\nwhere\n\n    h^f_ij =\n     ^{CoG}u_i×^{CoG}u_j/|^{CoG}u_i×^{CoG}u_j|\n                    .\n\nMoreover, as f_min corresponds to the radius of the inscribed sphere,\nwe may ascertain f_min in the following manner:\n\n    f_min=min _i, j d_i j^f .\n\nNote that, if f_min > 0, the robot can fly.Similarly, τ_min can be acquired by calculating d_i j^τ\nin the following manner.\n\n    d_i j^τ(U)=|∑_k=1^Nmax(0, λ_max ^th^τ_ij^{CoG}v_k)|,\n\n\n\n    τ_min=min _i, j d_i j^τ,\n\nwhere\n\n    h^τ_ij =\n     ^{CoG}v_i×^{CoG}v_j/|^{CoG}v_i×^{CoG}v_j|\n                    .\n\nTo sum up, the objective function to be maximized in this optimization of TRADY's rotor\nconfiguration is formulated as follows.\n\n\n\n\n  \n\n    S(U) =  w_1f_min + w_2τ_min,\n\nwhere w_1 and w_2 are the positive weights to balance between\nforce and torque.\nAdditionally, the constraints can be expressed as follows:\n\n    ∗ 1:       \n      f_min > 0,\n\n\n    ∗ 2:       τ_min > 0.\n\nAlthough our primary focus is on the assembled aircraft consisting of\ntwo quadrotor units, the maximization of S(U) within the constraints\ndescribed in (<ref>) and (<ref>) ensures the attainment of fully-actuated\nmodel control in aircraft composed of an arbitrary number of units.\n\n\n  §.§.§ Under-actuated Model Controllability\n\nSubsequently, we present the constraints for (<ref>) to enable TRADY\nto achieve stable flight in the unitary state. Firstly, as previously\nnoted in sec:introduction, the TRADY is composed of two quadrotor units, each\npossessing an identical rotor configuration. Consequently, the whole\nstructure can be illustrated as figure:unit_config(A), with a\nconstraint expressed as follows:\n\n    u_1 = u_5,  u_2 = u_6,  u_3 =\n      u_7,  u_4 = u_8 .\n\n\nAdditionally, as noted above, the prerequisite for stable flight of the units is that\nboth (<ref>) and (<ref>) are satisfied. Despite the presence of an\ninfinite number of combinations for {C} and\nλ_s, we assume that λ_s =\nλ_s ^t[ 1 1 1 1;   ], to\nensure even distribution of workload across each rotor. Consequently, an\nadditional constraint can be formulated as follows.\n\n    ∗ 3:       λ_sQ_trans ^t[ 1 1 1 1;   ] \n                                                 = mg,\n\n\n\n    ∗ 4:       λ_sQ_rot ^t[ 1 1 1 1;   ]\n                                                 = 0 .\n\n\n\n  §.§.§ Flight Characteristics for Aerial Assembly/Disassembly\n\nNext, we consider the flight characteristics required for aerial\nassembly/disassembly. Generally, quadrotors obtain translational\npropulsion by inclining their airframe. However, this inclination impedes\nparallel contact between two units during assembly motion. The coupling\nmechanism proposed in this study has a small contact area, which renders\nthis non-parallel relationship a hindrance to the assembly\nprocess.However, in the instance of the TRADY unit, its target\ncoordinate system is {C}, which is inclined with respect to\n{CoG}. Consequently, the airframe inclines during hovering, and\nconversely, it assumes a horizontal orientation during movement in a\nspecified direction. Hence, we establish a novel constraint for the optimization to regulate the tilted angle of {C} in such a way\nthat the airframe assumes a horizontal orientation when it accelerates along\nthe positive x-axis direction in figure:unit_config(B).Assuming\nthat the inclination angle during hovering is -γ as\nshown in figure:unit_config(C), the force exerted by the\nunit in the x-direction when it is in a horizontal state can be written as\nmgtanγ. Then the desired value of γ is\ncalculated as follows:\n\n    γ = -tan^-1(^desa/g),\n\nwhere ^desa is the target acceleration in the x-direction.\nConsequently, we introduce the following constraint condition for the\nrotation matrix R_C, to ensure that {C} tilts by -γ around the\ny-axis:\n\n    ∗ 5:       R_c = [\n    [  cos(-γ)        0  sin(-γ);        0        1        0; -sin(-γ)        0  cos(-γ);          ]] .\nTo sum up, the optimization problem for the rotor configuration can be\nsummarized as follows:\n\n    Umaximize       S(U)\n       subject to      ∗ 1∼∗ 5\n\n\n\n  §.§.§ Solver for Optimization Problem\n\nFinally, in order to solve the designed optimization problem, it is\nnecessary to choose an algorithm, but it is not always guaranteed that a\nsolution that satisfies all the set constraints exists. Therefore, we\nuse the  global optimization algorithm ISRES <cit.> that can find\nthe closest possible solution even if a perfect solution is not found. The optimized U obtained as a result of solving the\noptimization problem using the parameters shown in table:op_param and the\nguaranteed minimum force and torque in the unitary and assembly states\nare presented in table:op_result. Here, each u is represented by spherical\ncoordinate parameters α and β as shown in\nfigure:unit_config(B). Furthermore, the outcomes are rounded off to two significant digits. The obtained outcome reveals that the\noptimized rotor angles exhibit a symmetrical pattern. This occurrence\ncan be attributed to the constraints established in\n(<ref>) and (<ref>), as\nthese equations embody force and torque offsets.\nIn addition to this, it can be seen that both the minimum guaranteed force and torque become more than twice as\nhigh in the assembly state when using fully-actuated model compared to the\nunitary state.\n\n\n\n\n\n\n\n\n§ CONTROL\n\nFirstly, we outline the methodology for flight control, which\nincorporates fully-actuated model control for the unitary state and\nfully-actuated model control for the assembly state. Next, we propose a system switching\nstrategy to be executed during the docking or undocking process.\n\n\n §.§ Fully-actuated Flight Control\n\n\n\n\n  §.§.§ Position Control\n\nFor position control, a general PID controller is adopted. Thus, from (<ref>),\n(<ref>), the desired force and torque can be derived as\nfollowing:\n\n    f^des = m ^{ W}R_{ CoG }^-1(K_pe_r +K_i∫e_rdt\n                           +K_dė_̇ṙ),\n\n\nwhere e_r is a position error defined as e_r =\n^{ W }r^des_{ CoG } - ^{ W }r_{ CoG }, and\nK_p, K_i, K_d are gains for\ncontroller. Additionally, { C } is used instead of\n{ CoG } in the unitary state.In the assembly state, as shown in figure:a_fc, the obtained f^des from\n(<ref>) is allocated to the desired thrust by Q_trans.\n\n\n  §.§.§ Attitude Control\n\nNext, we explain attitude control. In the case of a fully-actuated\nmodel, it is possible to apply traditional PID control for attitude\ncontrol. Here, by using (<ref>), the desired torque can\nbe obtained as follows:\n\n    τ^des = ^{CoG}I(K_pe_α +K_i∫e_αdt\n      + K_dė_̇α̇) \n    \n       +\n      ^{CoG}ω× ^{CoG}I ^{CoG}ω,\n\nwhere e_α is an attitude error defined as e_α = ^{ W\n}α^des_{CoG} - ^{ W }α_{CoG} and\nK_p, K_i, K_d are gains for controller.\nThen, the desired torque τ^des obtained from attitude control is allocated into the\ndesired thrust for each rotor using the allocation matrix Q_rot\nas shown in figure:a_fc.\n\n\n §.§ Under-actuated Flight Control\n\n\n\n\n\n  §.§.§ Position Control\n\nThe position control for the underactuated model is developed using the\nmethodology presented in <cit.>, which involves determining the\ntarget force via conventional PID feedback loop and subsequently converting\nit to target roll and pitch angles. The target forces f^des_x and f^des_y can be\nobtained using (<ref>), followed by determining the\ntarget roll θ and\npitch ϕ as outlined below:\n\n    ^{ W}θ^des_{ C } =\n     atan^-1(-f_y, √(f^2_x+f^2_z)),\n\n\n    ^{ W}ϕ^des_{ C } =\n     atan^-1(f^2_x, f^2_z).\n\nThese target angles are achieved by attitude controller.Additionally, regarding the position control in z-direction, collctive thrust force f^des_z is calculated in\nthe following manner:\n\n    f^des_z = ^t(^{ W}R_{ C }b)f^des,\n\nwhere b is a unit vector ^t[[ 0 0 1;   ]].Then, using λ_s defined in\n(<ref>) and (<ref>),\nthe target thrust for z-directional control is calculated as follows:\n\n    λ^des_z = f^des_z/mgλ_s.\n\n\n\n  §.§.§ Attitude Control\n\nIn attitude control, to suppresse the uncontrollable horizontal forces\ndue to the tilted rotors, we adopt LQI control<cit.> which is a type of optimal control that derives control inputs that minimize the cost function. Therefore, by designing the cost function appropriately, various requirements can be met in addition to convergence speed. The state equation of posture control is described as follows:\n\n    ẋ = Ax+\n      Bλ+D( ^{ C }I^-1 ^{ C}ω× ^{ C }I ^{ C}ω), \n       y = Cx,\n\nwhere\n\n    x  =  ^t[[  e_x ė_̇ẋ  e_y ė_̇ẏ  e_z ė_̇ż ∫e_x ∫e_y ∫e_z ]], \n       e = α^des - α, \n       ė = α̇^des - α̇, \n       B =  ^t[[ 0_4×1   B_1 0_4×1   B_2 0_4×1   B_3 0_4×3;       ]], \n       [\n     [ B_1 B_2 B_3;     ]]\n      =  ^t(^{ C }I^-1Q_rot').\n\nNote that the target roll and pitch angle is ^{\nW}θ_{ C }, ^{\nW}ϕ_{ C } obtained from (<ref>) and (<ref>).\nIn regards to the cost function, this study designs a function with the\nobjective of improving convergence, suppressing the control input, and suppressing translational forces. In this case, the cost function is given as follows:\n\n    J = ∫_0^∞( ^txMx +  ^tλNλ)dt,\n\nwhere M and N are diagonal weight matrices. The first term\nin (<ref>) corresponds to the control output's norm,\nand minimizing this norm can enhance the convergence. Moreover,\nconcerning the second term in (<ref>), the method of defining N as follows has been proposed in <cit.>:\n\n    N = W_1 + Q_trans^T 'W_2Q_trans',\n\nwhere W_1 and W_2 are also diagonal weight\nmatrices. Then, the first term of (<ref>) creates a\nquadratic form ^tλNλ when substituted into (<ref>), corresponding to\nthe norm of control input. Therefore, by minimizing this term, the\ncontrol input can be suppressed. Furthermore, when the second term is\nsubstituted into (<ref>), the following equation is derived.\n\n\n    ^tλ ^tQ_trans'Q_trans'λ\n      =  ^tff = f^2.\n\nAs seen from (<ref>), the norm of translational\nforce is represented by the second term of (<ref>). Therefore, by employing the control input λ that minimizes the cost function\ndefined in (<ref>), stable attitude control of a unit\nequipped with tilted rotors can be achieved.\nBy solving the algebraic Riccati equations derived from\n(<ref>) and (<ref>), we obtain\nthe feedback gain K. Therefore, the desired\nλ is calculated as follows:\n\n    λ^des_rot = Kx+\n      ^#Q_rot' ^{\n      C}ω× ^{ C}I ^{\n      C}ω .\nFinally, in combination with the z axis position control, the final\noutput in the unitary state is ultimately calculated as follows:\n\n    λ^des = λ^des_z + λ^des_rot .\n\n\n\n\n §.§ System Switching\n\n\nWe present a methodology for system switching that is executed\nduring assembling and disassembling actions.\n\n\n  §.§.§ Overall Control System\n\nTo begin with, the overall\ncontrol system is designed, as depicted in figure:whole_system. The “Motion\nPlanner”, “Estimator”, and “Robot” sections adopt common processes in\nboth the assembly state and the unitary state. Conversely, the\n“Switching Section” serves as a partition that alternates between the\nassembly and unitary states. During the assembly state, the entire\nsystem is controlled by a distributed control system, while each unit\ncontrols its respective rotors based on a common robot model without\ncommunicating with one another.\nTherefore, the overall structure of the system remains unchanged between\nthe assembly state and the unitary state, with only the contents of the\n“Switching Section” being switched.\n\n\n  §.§.§ Transition Process\n\nNext, we explain the transition process that should be performed when\nswitching systems. The problem when switching the system is the model\nerror related to the inertia values and rotor performance of the\nrobot. In normal flight control of TRADY, model errors are compensated\nfor by the integral term of PID and LQI. In addition, there is no offset\nthrust based on default values in the gravity direction, and it is all\ncompensated for by the integral term. Model error compensation by\nintegral value is gradually performed while gradually increasing the\nrotor thrusts during takeoff, so it is generally completed until\nhovering.As an example, we consider the system switching during the assembly\naction. When switching the system, most control values are reset because\nthe controller is switched. However, as mentioned earlier, gravity\ncompensation is performed by the integral term, so only the integral\nterms are carried over in order to continue the flight. However, since\nthis integral term compensates for the model error of the robot in the\nunitary state, the model error in the assembly state is not compensated\nfor. Model errors that suddenly occur during flight, unlike during\ntakeoff, cause discrete increases or decreases in rotor thrusts, which\nhave a significant negative effect on control stability.\n\nTo address this issue, a method of gradually transitioning rotor thrusts\nwhile compensating for the model error of the assembly state model was\ndeveloped. Although it is impossible to predict each rotor thrust after\nmodel error compensation, the total weight of the system does not change\nbefore and after system switching, thereby the total thrust force acting in\nthe gravity direction after model error compensation can be said to be\nthe same as in the unitary state. Furthermore, since among each rotor thrust,\nthe proportion that works in the direction of gravity does not change,\nconsequently, the total thrust of all rotors can be said to be equal before and\nafter switching. Therefore, the influence of sudden model errors can be\nsuppressed by scaling the rotor thrusts output from the controller based\non the total thrust in the unitary state. However, it is necessary to\nreflect the influence of the control output in the assembly state,\nthereby the control output is scaled using the value obtained by\nsuperimposing the total thrust in these two states.Here, the total thrust in the unitary state is obtained using the total thrust\nimmediately before the system switch, and the total thrust in the\nassembly state is obtained using the real-time control output. Then, rotor thrusts during the transition is scaled as follows:\n\n    λ^des_trans =\n      \n      S_trans/\n      S_assemλ^des_assem,\n\n\n    S_trans =\n      W(t)S_assem+\n      (1- W(t)) S_unit,\n\nwhere S_assem is the total thrust in the assembly state defined as S_assem =\n∑_i=1^nλ^des_assem, i and S_unit is that in\nthe unitary state. Note that S_assem is a variable but S_unit is a constant because S_unit competed\nby the thrust at the moment of switching. Additionally, W(t) is the weight\nfunction used in the superimposing and it is desirable for it to\nsmoothly converge to 1. Therefore, W(t) is defined as follows:\n\n    W(t) = 1-1/at+1,\n\nwhere a is a constant and t is a variable representing time. Then, W(t) satisfies follows:\n\n    W(0) = 0, \n       lim_t →∞W(t) → 1 .\n\nTherefore, in (<ref>), initially the influence of S_unit is\ndominant, but gradually S_assem becomes dominant and ultimately λ_trans becomes\nindistinguishable from the normal output of the assembly state controller. Thus, as a result, even after the system switch, the rotor thrust\ntransitions smoothly. The variable a in (<ref>) determines the\nconvergence rate of the function, and in this work, it was empirically\nset to a = 0.9.\nIn this case, W(t) attains a value of 0.99 when t = 120. During actual\nimplementation, W(t) is refreshed at each control cycle with a frequency of\n0.025s. Consequently, W(t) achieves 0.99 after approximately 3s\nof real time have elapsed.To sum up, by utilizing the aforementioned methodology, it is possible to\naddress the discrete thrust changes caused by model errors during system\nswitching. This transition process occurs outside the controller, as\nillustrated in figure:a_fc and figure:u_fc, and can be regarded as a kind of\ndisturbance to the feedback loop. However, if this disturbance itself\nconverges sufficiently quickly, the overall system stability is\nultimately dependent on the stability of controllers. In the case of our\nmethod, the tuning of a in (<ref>) ensures the\nconvergence rate of the transition process, while the stability of the\nPID controller is achieved through the tuning of its gains, and the\nstability of the LQI controller is guaranteed by\n(<ref>). Therefore, the proposed transition process\nhas no impact on the stability of the feedback loop.\n\n\n\n§ MOTION STRATEGY\n\nIn this section, we introduce the motion strategy for executing\nassembly/disassembly motion in mid-air. Initially, we propose the\noverarching strategy, followed by an specific explication of each constituent.\n\n\n §.§ Overall Strategy\n\nAs explained in Section. <ref>, in aerial assembly/disassembly motions,\nthe two units come into extreme proximity, causing unstable flight. This\nmakes high-precision position control difficult. Therefore, a motion strategy is required that ensures the certainty of the motion under\nmultiple conditions, and executes it only if these conditions are\nmet. Then, in this study, we divide the target action into several\nstages and represent them as an Finite State Machine (FSM) as shown in figure:state_machine.\nIn this FSM, conditions are set to transition between states, and when two units fulfill them, the motion transitions to the next state.  By repeating this process, it becomes\npossible to autonomously perform aerial assembly/disassembly motion while avoiding\nhazardous conditions.\n\n\n\n §.§ Assembly Motion\n\nNow, we explain each state in the FSM, focusing on the assembly motion.\n\n\n  §.§.§ Standby State\n\nThis state is the initial\nstate of the FSM, where both units are guided towards their respective standby\npositions and yaw angles.\nThe female unit maintains its position and yaw angle at the start of\nassembly, while the male unit is guided to a position and yaw angle\nψ that\nsatisfies the following relationship:\n\n    ^{ F }r_{ M } =\n       ^t[\n       [ d^st    0    0 ]] , \n       ^{ F }ψ_{ M } = -π\n\nwhere{ F } represents the { C } frame\nof the female unit, while { M } represent that of the\nmale unit. Additionally, d^st is the desired distance between two\nunits' CoG. Note that the direction of each axis is the same as that shown in\nfigure:unit_config.Here, we define the following condition #1 with respect to the\nerrors in r_y, r_z, and ψ:\n\n    # 1:       (\n       [      ^{ F }r_y{ M }; ^{ F\n         }r_z{ M };       ^{ F }ψ_{ M };                     ])\n      ≤(\n       [ e^# 1_y; e^# 1_z; e^# 1_ψ;         ])\n\nwhere e^# 1_y,e^# 1_z,e^# 1_ψ are tolerable\nerrors. Condition # 1 is used as a criterion to determine if the\npositional relationship between the two units is safe. If the\nrelationship between the female unit and the male unit satisfies #\n1, the state transitions to the “Approach” state.\n\n\n  §.§.§ Approach State\n\nAt this state, the male unit moves towards the female unit, while the\nfemale unit maintains its position and angle. During the approach phase,\nif condition #\n1 is no longer met, the approach motion is interrupted and\nthe system transitions to the “Standby” state. By virtue of this process, it becomes possible to instantaneously recover from a hazardous positional state between the two units and continue with the assembly motion unimpeded.Here, we define the following condition # 2 with respect to the\nerrors in r_x, r_y, r_z, and ψ:\n\n    # 2:       (\n       [      ^{ F }r_x{ M };      ^{ F }r_y{ M }; ^{ F\n         }r_z{ M };       ^{ F }ψ_{ M };                     ])\n      ≤(\n       [ e^# 2_x; e^# 2_y; e^# 2_z; e^# 2_ψ;         ])\n\nwhere e^# 2_x,e^# 2_y,e^# 2_z,e^# 1_ψ are\ntolerable errors. Condition # 2 is used as a criterion to determine if\nthe two units are in a position where they can docking. If the condition # 2 is satisfied, the state transitions\nto the “Assembly” state.\n\n\n  §.§.§ Assembly State\n\nIn this state, initially, the docking mechanism is activated by\nturning on the magnet and inserting the pegs, and subsequently, the\nsystem is transitioned into the assembly mode. During the aforementioned movements, if condition # 2 is no longer met, the movement is halted and the state transitions to the “Approach” state.\n\n\n  §.§.§ Transition State\n\nIn this state, the process of transition presented in\nSection. <ref> is executed.\n\n\n §.§ Disassembly Motion\n\nIn the case of aerial disassembly, the system transitions from “Hovering” to\n“Transition,” and then proceeds to “Disassembly.” During “Disassembly,”\nthe coupling mechanism is released, allowing the two units to\nseparate. Unlike in assembly, positional control of the bodies is not\ncritical during disassembly, and therefore, there are no conditions that\nmust be satisfied for the state transitions.\n\n\n\n§ EXPERIMENT\n\nIn this section, we first describe the robot platform utilized in each\nexperiment. Next, we present the experimental results, which include the\nevaluation of flight stability in each state, aearil assembly and disassembly motion based on proposed control method and motion strategy, and object manipulation in the assembly state.\n\n\n §.§ Robot Platform\n\n\n\n  §.§.§ Hardware\n\n\nBased on the design proposed in sec:mech_design and sec:rotor_config, we introduce the\nhardware configuration illustrated in figure:hardware_config. The frame of the body is made of a 5mm\nCFRP plate, while the other parts are mainly made of PLA material. In\ndetermining the size of the entire body, we first determined the size of\nthe docking mechanism based on the rigidity required for the coupling\nportion and then selected the minimum body size that can accommodate the\ndocking mechanism.\n\nThe rotors are composed of 5 inch propellers (GEMFAN Hulkie 5055S-3) and\nbrushless motors (ARRIS S2205), driven by ESC (T-Motor F45A). Each rotor\nis tilted based on the optimized U in sec:rotor_config. With this\nconfiguration, each rotor exerts a thrust of approximately 1N-8N at a\nvoltage of 15V.\n\n\nFurthermore, an on-board PC (Khadas VIM4) and a flight controller called\nSpinal, which uses an STM32 microcontroller, are installed on the\nbody. The housing of the docking mechanism is made of PLA, and a servo\nmotor (KONDO KRS-3302) is installed on both the male and female\nsides. In addition, Arduino nano is used to control the servo motor.\n\n\nIn addition, a 2200mAh four-cell LiPo battery is used as the power\nsource. However, in some experiments, power is supplied from a\nbground-based stabilizing power source instead of a battery to enable\nemergency stop.\n\n\nFinally, table:hard_prop shows the characteristics of the robot.\n\n\n\n\n  §.§.§ Software\n\n\nNext, we introduce the communication system for proposed robot TRADY as\nshwon in figure:software_config. Firstly, the external PC executes\nmotion planning including the strategy for the assembly/disassembly\nmotion presented in sec:motion_strategy, and it outputs\nposition attitude commands.\nSubsequently, these commands are transmitted to the onboard PC through a\nWi-Fi network. Furthermore, the external motion capture system transmits\nthe positional state of the robot to the onboard PC. The onboard PC\nconsists of a robot model calculation, position estimator by Kalman\nfilter, and position controller. Afterward, the onboard PC transmits\ncommands to Arduino and Spinal with UART communication. Spinal also\nreceives self-attitude information from the IMU sensor and estimates the\nattitude of the robot with a Kalman filter. Target PWM is output from\nthe attitude controller based on the estimated attitude values and\ncommands from the onboard PC. Moreover, Arduino receives commands from the onboard PC and sends angle commands to the servo motors of the coupling mechanism.\n\n\n §.§ Flight stability\n\nWe first conduct a circular trajectory tracking flight experiment in\norder to verify the flight stability of both the unitary state and\nthe assembly state. In this experiment, a circular trajectory with a radius of\n0.5m at an altitude of 1m was adopted, and a robot circles\nthis obit twice in one minute. The result is shown\nin figure:circle_track and table:circle_track. Figure\n1 visualizes the tracking error, while table:circle_track shows\nthe Root Mean Squared Error (RMSE) from the trajectory for each state.\nFrom these results, it is found that both the under-actuated model\ncontrol in the unitary state and the fully-actuated model control in the\nassembly state are possible. The control accuracy is inferior in the\nunitary state compared to the assembly state, which is due\nto not only the under-actuated model control but also the large moment of\ninertia of the body despite its weight. However, the positional error\nwithin this range can be\ndealt with by the drogue on the female-side docking mechanism and the\nproposed motion strategy, thus not posing significant issues.\n\n\n\n\n\n §.§ In-flight assembly and disassembly\n\n\n\n  §.§.§ Reliability of Aerial Assembly/Disassembly\n\n To conduct an airborne coalescence experiment, the parameters in\n (<ref>) and (<ref>) must first be determined.\n The parameters e^#1_y, e^#1_z, e^#1_ψ in (<ref>) are the criteria for determining the\n dangerous state, and therefore, smaller values of these parameters will\n result in more reliable merging, but will also increase the time\n required to complete the merging. Since the parameters e^#2_x, e^#2_y, e^#2_z, e^#2_ψ in (<ref>)\n are the criteria for docking certainty, there is also a tradeoff\n between certainty and time required to adjust these parameters. In this\n study, these values were adjusted through experiments on actual\n equipment, and the final values were determined as shown in\n table:hash_cond.After determining the parameters, we conducted 15 experiments for\n both aerial assembly and disassembly. The results indicated a success\n rate of 86.7% (13 successful attempts) for assembly behavior and a\n 100% success rate (15 successful attempts) for disassembly\n behavior. In addition to this, the time required for the merging\n behavior ranged from 3s to 15s, and there was a large\n variation. In two failed assembly experiments, the docking mechanism\n became stuck in a part of the airframe, making it impossible to\n transit from the “Approach” state to the “Standby” state,\n necessitating an emergency stop of the robot. As a solution to this\n issue, covering the entire unit body with a spherical guard would allow\n avoidance of contact between the docking mechanism and the airframe.\n\n\n\n\n  §.§.§ Stability of System Switching\n\nNext, to evaluate the flight stability during the system switchover, we\nconducted in-flight assembly and disassembly experiments with and without\nthe thrust transition method proposed in\nSection. subsec:transition. First, for the aerial assembly, the\nresults with the transition process are shown in figure:assembly_trans, and the\nresults without the proposed thurst transition process are shown in\nfigure:assembly_notrans. In the event of an increase in rotor\nthrust during the system switch, the forces in the x and y directions\nare offset; however, significant effects are apparent in the control of\nthe z direction. Therefore, both figure:assembly_trans and figure:assembly_notrans include plots of\nrotor thrust displacement and z-directional position error.\n\n\nConcerning the case of transition processing, it can be\nobserved from figure:assembly_trans that stable aerial assembly and thrust\ntransitions are achieved. As shown in figure:assembly_trans(B) and (C), the total\nrotor thrust remains constant before and after the system switch, and\nthe subsequent ascent of robot is limited to approximately\n0.065m. Additionally, the control is rapidly stabilized following\nthe switchover. Note that, despite the transition process, there are still discrete changes in the\nthrust of each rotor. However, these changes are due to alterations in\nthe allocation of thrust to each rotor and not to model errors, and they\nhave a negligible adverse effect on control performance.\n\nOn the contrary, regarding the experiment without\ntransition processing, figure:assembly_notrans(B) shows that\nthe target rotor thrust changed abruptly due to model errors that occur\nduring the system switchover. The total rotor thrust increases by about 5N before and after the switchover, and for some rotors the\ntarget thrust greatly exceeds the upper thrust limit. As a result, the\nrobot rose about 0.39m at a stretch immediately after assembly as\nshow in figure:assembly_notrans(C), and\nunstable control continued after that.  These results indicate the efficacy of our proposed method for switching systems in\naerial assembly motion.Next, regarding aerial disassembly, figure:disassembly_trans\nillustrates the experimental result of aerial disassembly with proposed\ntransition process. Moreover, figure:disassembly_notrans illustrates the variation in\nrotor thrust before and after mid-air disassembly when the transition\nprocess was not applied. From these results, it was found that in aerial disassembly, it is\npossible to safely switch the system with or without transition\nprocessing. This is likely due to the fact that in the assembly state,\ndecentralized control is performed by two controllers, resulting in\nmodel errors equivalent to those of two aircraft. In contrast, in the\nunitary state, only model errors equivalent to those of one aircraft are\ngenerated. As a result, in the unitary state, the effect of system switching on thrust is\npresumed to be small.\n\n\n\n\n §.§ Peg Insertion\n\nNext, we conducted an experiment to verify the aerial object\nmanipulation ability in the assembly state. First, we conducted an\nexperiment to insert a diameter of 6mm peg into a diameter of 25mm pipe as an analogy to drilling and Pic-and-Place\ntasks.\n Due to the requirement of high position accuracy and independent\n control of translation and rotation for this task, the fully-actuated model\n control is necessary. Note that in this study, we focus on the control\n performance of the robot, and therefore, the task is performed by manual\n operation, not by automatic control based on motion planning. The\n experimental results are shown in figure:peg.From these results, it was demonstrated that the robot can be\n maneuvered with an error of approximately ±1cm. Furthermore, as shown in figure:peg(B),(C), the pitch angle of\n the robot was kept within approximately ± 1.5 degrees\n during movement and hovering, demonstrating translational control can\n be achieved while suppressing the impact on the attitude.\n\n\n\n §.§ Valve Opening\n\nFinally, to demonstrate the expansion of achievable torque through\nassembly of units, we conducted a valve opening experiment. An\nindustrial gate valve was used for the experiment, and end effectors\nfor valve operation was attached to the robot. These end effectors are\ncapable of passive expansion and contraction, and do not hinder\ntakeoff and landing. The results of the experiment are presented in\nfigure:peg. From these results, it was demonstrated that\nproposed robot TRADY\nis capable of stable valve opening operations in the air. figure:peg(B)\nshows that a maximum torque of 2.4Nm is required during task execution\n(actually, about 2.2Nm of torque is required to open this valve). Here,\nit can be seen that by assembling units, the torque performance is\nimproved by approximately nine times with respect to the yaw direction\ntorque that can be exerted in unit state, which is a maximum of\n0.28Nm. This is due to the fact that the size of the body has increased by\nassembling units and that torque realization using the horizontal\ncomponent of rotor thrusts is possible due to the fully-actuated model\ncontrol.\n\n\n\n\n§ CONCLUSION\n\nIn this study, we have developed the configuration of the quadrotor unit\nnamed TRADY that\npossesses the ability to engage in aerial self-assembly and\nself-disassembly. A noteworthy achievement of this work is that the\nrobot can perform both assembly and disassembly while seamlessly\ntransitioning between fully-actuated and under-actuated models. Building\nupon the proposed design, control methodology, and motion strategy, we\nconducted empirical experiments that demonstrated the robot's ability to\nperform stable assembly/disassembly movements, as well as execute\nvarious aerial manipulation tasks. During the assembly/disassembly\nexperiment, we established that the proposed robot can successfully\ncomplete assembly/disassembly movements at a rate of 90%, while also\nobserving that the proposed thrust transition method can suppress\ninstability during switching. Additionally, in the task\nexecution experiment, we determined that the robot in the assembly state\ncan exercise independent control over translation and rotation, while\nalso generating nine times the torque compared to the unitary state.The pivotal concern that remains in this study is that TRADY, while in\nthe assembly state, is fully-actuated but not omni-directional, which\nrestricts its ability to hover at a significantly tilted posture. As a\nfuture prospect, we intend to design a new docking mechanism equipped\nwith joints that will enable the robot to alter rotor directions after\nassembly. This will expand the robot's controllability in a more\nsignificant manner. Furthermore, expanding the system by utilizing three\nor more units remains a future challenge. In cases involving three or\nmore units, multiple combinations are possible, allowing for the\nselection of appropriate units based on the task at hand.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIEEEtran\n\n\n\n\n\n\n\n\n\n10\n\nurl@samestyle\n\n\n\n\n\n\n\n\nFloreano2015\nD. Floreano and R. J. Wood, “Science, technology and the future of small\n  autonomous drones,” Nature, vol. 521, pp. 460–466, 2015.\n\nkumar2012\nV. Kumar and N. Michael, “Opportunities and challenges with autonomous micro\n  aerial vehicles,” The International Journal of Robotics Research,\n  vol. 31, no. 11, pp. 1279–1291, 2012.\n\nBonatti2020\nR. Bonatti, Y. Zhang, S. Choudhury, W. Wang, and S. Scherer, “Autonomous drone\n  cinematographer: Using artistic principles to create smooth, safe,\n  occlusion-free trajectories for aerial filming,” in Proceedings of the\n  2018 international symposium on experimental robotics.1em plus 0.5em\n  minus 0.4emSpringer, 2020, pp. 119–129.\n\nSewer\nF. Chataigner, “Arsi: an aerial robot for sewer inspection.” Advances\n  in Robotics Research: From Lab to Market. Springer, Cham, 2020, pp.\n  249–274, 2020.\n\nMichael2012\nN. Michael, S. Shen, K. Mohta, Y. Mulgaonkar, V. Kumar, K. Nagatani, Y. Okada,\n  S. Kiribayashi, K. Otake, K. Yoshida, K. Ohno, E. Takeuchi, and S. Tadokoro,\n  “Collaborative mapping of an earthquake-damaged building via ground and\n  aerial robots,” Journal of Field Robotics, vol. 29, no. 5, pp.\n  832–841, 2012.\n\nDoitsidis2012\nL. Doitsidis, S. Weiss, A. Renzaglia, M. W. Achtelik, E. Kosmatopoulos,\n  R. Siegwart, and D. Scaramuzza, “Optimal surveillance coverage for teams of\n  micro aerial vehicles in gps-denied environments using onboard vision,”\n  Autonomous Robots, vol. 33, pp. 173–188, 2012.\n\nfigure_8\nY. Bai and S. Gururajan, “Evaluation of a baseline controller for autonomous\n  “figure-8” flights of a morphing geometry quadcopter: Flight performance,”\n  Drones, 2019.\n\nmorphing_quad\nD. Falanga, K. Kleber, S. Mintchev, D. Floreano, and D. Scaramuzza, “The\n  foldable drone: A morphing quadrotor that can squeeze and fly,” IEEE\n  Robotics and Automation Letters, vol. 4, no. 2, pp. 209–216, 2019.\n\norigami\nD. Yang, S. Mishra, D. M. Aukes, and W. Zhang, “Design, planning, and control\n  of an origami-inspired foldable quadrotor,” in 2019 American Control\n  Conference (ACC), 2019, pp. 2551–2556.\n\nn_zhao\nN. Zhao, Y. Luo, H. Deng, and Y. Shen, “The deformable quad-rotor: Design,\n  kinematics and dynamics characterization, and flight performance\n  validation,” in 2017 IEEE/RSJ International Conference on Intelligent\n  Robots and Systems (IROS), 2017, pp. 2391–2396.\n\nBucki\nN. Bucki, J. Tang, and M. W. Mueller, “Design and control of a\n  midair-reconfigurable quadcopter using unactuated hinges,” IEEE\n  Transactions on Robotics, vol. 39, no. 1, pp. 539–557, 2023.\n\nVoliro\n“The voliro omniorientational hexacopter: An agile and maneuverable\n  tiltable-rotor aerial vehicle,” IEEE Robotics and Automation\n  Magazine, vol. 25, pp. 34–44, 12 2018.\n\nkhamseh2018\nH. B. Khamseh, F. Janabi-Sharifi, and A. Abdessameud, “Aerial manipulation―a\n  literature survey,” Robotics and Autonomous Systems, vol. 107, pp.\n  221–235, 2018.\n\nMellinger2011\nD. Mellinger, Q. Lindsey, M. Shomin, and V. Kumar, “Design, modeling,\n  estimation and control for aerial grasping and manipulation,” in 2011\n  IEEE/RSJ International Conference on Intelligent Robots and Systems, 2011,\n  pp. 2668–2673.\n\nHeredia2014\nG. Heredia, A. Jimenez-Cano, I. Sanchez, D. Llorente, V. Vega, J. Braga,\n  J. Acosta, and A. Ollero, “Control of a multirotor outdoor aerial\n  manipulator,” in 2014 IEEE/RSJ International Conference on Intelligent\n  Robots and Systems, 2014, pp. 3417–3422.\n\nhydrus\nM. Zhao, K. Kawasaki, K. Okada, and M. Inaba, “Transformable multirotor with\n  two-dimensional multilinks: modeling, control, and motion planning for aerial\n  transformation,” Advanced Robotics, vol. 30, no. 13, pp. 825–845,\n  2016.\n\ndragon\nM. Zhao, F. Shi, T. Anzai, K. Okada, and M. Inaba, “Online motion planning for\n  deforming maneuvering and manipulation by multilinked aerial robot based on\n  differential kinematics,” IEEE Robotics and Automation Letters,\n  vol. 5, no. 2, pp. 1602–1609, 2020.\n\nLasdra\nH. Yang, S. Park, J. Lee, J. Ahn, D. Son, and D. Lee, “Lasdra: Large-size\n  aerial skeleton system with distributed rotor actuation,” in 2018 IEEE\n  International Conference on Robotics and Automation (ICRA), 2018, pp.\n  7017–7023.\n\nZhao2022\nM. Zhao, K. Okada, and M. Inaba, “Versatile articulated aerial robot dragon:\n  Aerial manipulation and grasping by vectorable thrust control,”\n  International Journal of Robotics Research, 2022.\n\nNaldi2015\nR. Naldi, F. Forte, A. Serrani, and L. Marconi, “Modeling and control of a\n  class of modular aerial robots combining under actuated and fully actuated\n  behavior,” IEEE Transactions on Control Systems Technology, vol. 23,\n  no. 5, pp. 1869–1885, 2015.\n\nGranger\nK. Garanger, J. Epps, and E. Feron, “Modeling and experimental validation of a\n  fractal tetrahedron uas assembly,” in 2020 IEEE Aerospace Conference,\n  2020, pp. 1–11.\n\nXu2021\nJ. Xu, D. S. D'Antonio, and D. Saldana, “H-modquad: Modular multi-rotors with\n  4, 5, and 6 controllable dof,” vol. 2021-May.1em plus 0.5em minus\n  0.4emInstitute of Electrical and Electronics Engineers Inc., 2021, pp.\n  190–196.\n\nFlightarray1\nR. Oung, A. Ramezani, and R. D'Andrea, “Feasibility of a distributed flight\n  array,” in Proceedings of the 48h IEEE Conference on Decision and\n  Control (CDC) held jointly with 2009 28th Chinese Control Conference, 2009,\n  pp. 3038–3044.\n\nFlightarray2\nR. Oung, F. Bourgault, M. Donovan, and R. D'Andrea, “The distributed flight\n  array,” in 2010 IEEE International Conference on Robotics and\n  Automation, 2010, pp. 601–607.\n\nSaldana2018\nD. Saldana, B. Gabrich, G. Li, M. Yim, and V. Kumar, “Modquad: The flying\n  modular structure that self-assembles in midair.”1em plus 0.5em minus\n  0.4emInstitute of Electrical and Electronics Engineers Inc., 9 2018,\n  pp. 691–698.\n\nmoddessemble\nD. Saldana, P. M. Gupta, and V. Kumar, “Design and control of aerial modules\n  for inflight self-disassembly,” IEEE Robotics and Automation Letters,\n  vol. 4, pp. 3402–3409, 10 2019.\n\nHara2014\nI. O'Hara, J. Paulos, J. Davey, N. Eckenstein, N. Doshi, T. Tosun, J. Greco,\n  J. Seo, M. Turpin, V. Kumar, and M. Yim, “Self-assembly of a swarm of\n  autonomous boats into floating structures,” in 2014 IEEE International\n  Conference on Robotics and Automation (ICRA), 2014, pp. 1234–1240.\n\nYanagimura\nK. Yanagimura, K. Ohno, Y. Okada, E. Takeuchi, and S. Tadokoro, “Hovering of\n  mav by using magnetic adhesion and winch mechanisms,” in 2014 IEEE\n  International Conference on Robotics and Automation (ICRA), 2014, pp.\n  6250–6257.\n\nRyll2016\nM. Ryll, D. Bicego, and A. Franchi, “Modeling and control of fast-hex: A\n  fully-actuated by synchronized-tilting hexarotor,” in 2016 IEEE/RSJ\n  International Conference on Intelligent Robots and Systems (IROS).1em\n  plus 0.5em minus 0.4emIEEE, 2016, pp. 1689–1694.\n\nPark2016\nS. Park, J. Her, J. Kim, and D. Lee, “Design, modeling and control of\n  omni-directional aerial robot,” vol. 2016-November.1em plus 0.5em\n  minus 0.4emInstitute of Electrical and Electronics Engineers Inc., 11\n  2016, pp. 1570–1575.\n\nTandale\nM. D. Tandale, R. Bowers, and J. Valasek, “Trajectory tracking controller for\n  vision-based probe and drogue autonomous aerial refueling,” Journal of\n  Guidance, Control, and Dynamics, vol. 29, no. 4, pp. 846–857, 2006.\n\nFRAVOLINI2004611\nM. L. Fravolini, A. Ficola, G. Campa, M. R. Napolitano, and B. Seanor,\n  “Modeling and control issues for autonomous aerial refueling for uavs using\n  a probe^^e2^^80^^93drogue refueling system,” Aerospace Science and\n  Technology, vol. 8, no. 7, pp. 611–618, 2004. [Online]. Available:\n  <https://www.sciencedirect.com/science/article/pii/S1270963804000744>\n\n\nsingularity\nM. Zhao, T. Anzai, K. Okada, K. Kawasaki, and M. Inaba, “Singularity-free\n  aerial deformation by two-dimensional multilinked aerial robot with 1-dof\np  vectorable propeller,” IEEE Robotics and Automation Letters, vol. 6,\n  pp. 1367–1374, 4 2021.\n\nConvex\nP. Bosscher, A. Riechel, and I. Ebert-Uphoff, “Wrench-feasible workspace\n  generation for cable-driven robots,” IEEE Transactions on Robotics,\n  vol. 22, no. 5, pp. 890–902, 2006.\n\nIsres\nN. Documentation, “Nlopt algorithms,”\n  <https://nlopt.readthedocs.io/en/latest/NLopt_Algorithms/#isres-improved-stochastic-ranking-evolution-strategy>.\n\nLee2010\nT. Lee, M. Leok, and N. H. McClamroch, “Geometric tracking control of a\n  quadrotor uav on se(3),” in 49th IEEE Conference on Decision and\n  Control (CDC), 2010, pp. 5420–5425.\n\nLQI\nP. Young and J. Willems, “An approach to the linear multivariable\n  servomechanism problem,” International Journal of Control, vol. 15,\n  06 1972.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}