{"entry_id": "http://arxiv.org/abs/2303.07102v1", "published": "20230313134121", "title": "Entanglement dynamics with string measurement operators", "authors": ["Giulia Piccitto", "Angelo Russomanno", "Davide Rossini"], "primary_category": "cond-mat.stat-mech", "categories": ["cond-mat.stat-mech", "quant-ph"], "text": "\n\n\n\n      Entanglement dynamics with string measurement operators\n\n\n\n\n\n\n\n\nGiulia Piccitto1⋆,\nAngelo Russomanno2, and\nDavide Rossini1\n\n\n\n\n\n\n\n1 Dipartimento di Fisica dell’Università di Pisa and INFN, \n\nLargo Pontecorvo 3, I-56127 Pisa, Italy\n\n\n2 Scuola Superiore Meridionale, Università di Napoli Federico II, \n\nLargo San Marcellino 10, I-80138 Napoli, Italy\n\n\n\n^⋆ giulia.piccitto@df.unipi.it\n\n\n\n\n\nMarch 30, 2023\n\n\n\n\n§ ABSTRACT\n\nWe explain how to apply a Gaussian-preserving operator to a fermionic Gaussian state. \nWe use this method to study the evolution of the entanglement entropy of an Ising spin chain following\na Lindblad dynamics with string measurement operators, focusing on the quantum-jump unraveling of such Lindbladian. \nWe find that the asymptotic entanglement entropy obeys an area law for finite-range string operators\nand a volume law for ranges of the string which scale with the system size. The same behavior is observed\nfor the measurement-only dynamics, suggesting that measurements can play a leading role in this context.\n\n\n\n1pt\nfancy\n1pt\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nUnderstanding the role of entanglement in quantum many-body systems is a subject under intensive study <cit.>. \nWhile the ground-state entanglement properties have been widely investigated and are relatively well understood,\nthere are still several open questions regarding the stabilization of quantum correlations during the non-equilibrium dynamics. \nBy exploiting a quasi-particle description it has been shown that in integrable systems, after a sudden quench, the entanglement entropy \nlinearly increases in time, and eventually settles to a stationary value which linearly scales with the system size (volume-law scaling) <cit.>.\nA similar volume-law scaling occurs in ergodic short-range systems <cit.>, while in the presence of a strong disorder\nthe situation is more involved, due to the appearance of many-body localization (see Ref. <cit.> for a review).\n\nA natural extension of the above scenario is for a quantum system coupled to an external environment,\na setup which is crucial to applications in quantum technologies and quantum computing,\nsince any experimental platform is subject to noise-induced decoherence <cit.>.\nIn the hypothesis of weak and Markovian coupling with the bath, a good modeling for this setup is to assume the evolution\nof the reduced density matrix of the system to be ruled by a master equation in a Lindblad form <cit.>. \nThe system-bath framework can be also interpreted as a process \nin which the environment behaves as a classical stochastic process performing random measurements on the quantum system <cit.>. \n\nThe outcome of any realization of this process is a pure-state stochastic quantum trajectory and\nthe density matrix obtained by averaging over such trajectories obeys a Lindblad-type dynamic evolution <cit.>.\n\nHere we are interested in the so-called measurement-induced phase transitions (MIPTs),\ni.e., in the possibility to develop discontinuities as in the asymptotic entanglement properties that emerge from the interplay\nbetween the unitary dynamics (typically generating entanglement) and the measurement processes (typically destroying it).\nThis kind of transitions have been first proposed and studied in unitary random circuits undergoing random measurements\n(see, e.g., Refs.<cit.> and citing references),\nwhich may display a transition between a phase in which the entanglement grows with the system size and another phase where it\nundergoes a saturation to a finite value (area-law scaling). Similarly, MIPTs may also arise in free-fermion random circuits with temporal randomness <cit.>, \nMajorana random circuits <cit.>, Dirac fermions <cit.>, and other Hamiltonian models undergoing\nrandom measurements at discrete times <cit.>. \nWhen measuring string operators, MIPTs can occur in the presence of a measurement-only dynamics, without the interplay with the Hamiltonian <cit.>.\n\nRecently, an increasing number of works have been focusing on MIPTs in systems described by quadratic Hamiltonians on a\nlattice <cit.>.\nOne of the reasons of this interest relies in the Gaussian structure of the states of such systems that,\nbeing entirely determined by two-point correlation functions, are suitable for a semi-analytical treatment up to large\nlattice sizes (of the order of hundreds of sites) <cit.>.\nIn particular, it has been found that the asymptotic volume-law scaling of the entanglement following\na unitary evolution <cit.> is unstable under local measurements,\nindependently of the measurement strength <cit.>, and a MIPT may emerge.\nFor example, the Ising chain exhibits a size-dependent crossover towards a subextensive or an area-law entanglement regime,\ndepending on the system parameters, as well as on the measurement rate\nand the type of unraveling <cit.>.\nIn the same context, a couple of recent works pointed out the importance of having long-range interactions to stabilize\nlarger amounts of entanglement, if the system undergoes random onsite measurements <cit.>.\n\nInspired by these latter findings, here we follow a complementary strategy and address the role of non-local\nstring measurement operators in the dynamics of entanglement for a quadratic Hamiltonian system. \nThe purpose of this paper is twofold. On the one hand, we collect and review all the technical details\nto implement the dynamics of Gaussian states in the presence of Gaussian-preserving measuring operators.\nOn the other hand, we discuss the effect of non-local measurement operators on the dynamics of the entanglement entropy,\nwhile keeping the Hamiltonian with short-range interactions.\n\nTo this aim, we implement a quantum-jump unraveling of the Lindblad dynamics <cit.>\nfor the Ising chain (mapped to the fermionic Kitaev chain)\nusing strings of Pauli matrices as Lindblad operators (mapped to non-local two-point fermionic operators).\nThe main result is that, when the string range r is comparable with the system size L, contrary to what happens in the presence\nof local jump operators, the measurement process can stabilize an asymptotic volume-law for the entanglement entropy.\nAs a consequence, a MIPT is conjectured as a function of r.\nQuite interestingly, the same qualitative conclusion applies if we switch off the Hamiltonian and consider\na measurement-only Lindblad dynamics induced by string operators, similarly to what has been studied in Ref. <cit.>\nfor measurement-only models with nonlocal measurements of Pauli strings.\n\nThe paper is organized as follows. \nIn Section <ref> we briefly review the theory of quadratic fermionic Hamiltonians on a lattice. \nIn Section <ref> and Appendix <ref> we present the technical details required to implement the dynamics of a Gaussian state\nunder the effect of Gaussian-preserving exponentials of quadratic operators.\nWe first set the general framework, and then shed light on the dynamical equations and on the normalization of the state. \nIn Section <ref> we apply such a machinery to string operators, a particular class of operators which\ngeneralize the one discussed in Ref. <cit.>. Subsequently, in Section <ref> we present and discuss\nnumerical results for the Ising chain with non-local string measurement operators.\nFinally, our conclusions are drawn in Section <ref>.\nThe other appendices contain some details on the quantum-jump measurement protocol (Appendix <ref>)\nand an alternative approach to determine the evolved state with the string operator (Appendix <ref>).\n\n\n\n\n\n§ FERMIONIC GAUSSIAN STATES\n\n\n\n\n\nWe consider a generic free-fermion system on a lattice with L sites, described by the quadratic Hamiltonian \n\n\n    Ĥ = ∑_i,j=1^L ( Q_i,j ĉ_i^†ĉ_j\n      + P_i,j ĉ_i^†ĉ_j^† + h.c.),\n\n\nwhere ĉ^(†)_j denotes the anticommuting annihilation (creation) operator on the j-th site.\nTo ensure the Hermiticity of Ĥ, the coefficient matrices obey Q^† = Q and P^T = - P.\n\nIn this context, a Gaussian state has the generic form [Hereafter we omit extrema\nin all the summations running from 1 to L.]\n\n\n    |ψ⟩ = 𝒩exp{1/2∑_p,q Z_p,q ĉ_p^† ĉ_q^†}|0⟩_ĉ,\n\nwith\n\n\n    Z = - ( u^†)^-1  v^† ,\n\n\nand 𝒩 a normalization constant. Here u and v are L× L matrices that obey the following symplectic unitarity conditions\n\n\n    u^†  u + v^†  v = I,      u   v^† + v^*   u^T = 0 ,\n\n\nwhere I denotes the L × L identity matrix. These conditions are equivalent to say that the matrix\n\n\n    = [   u v^*;   v u^* ]\n\n\nis unitary and preserves the fermionic anticommutation relations: In fact it defines a new set of fermionic anticommuting operators\n\n\n    γ̂_κ = ∑_j( u^*_j,κ ĉ_j + v^*_j,κ ĉ_j^†) ,\n\n\nthat enjoy the property\n\n\n    γ̂_κ|ψ⟩ = 0,     ∀ κ∈{1, …, L} ,\n\n\nmeaning that |ψ⟩ is the vacuum of the γ̂ fermions, |ψ⟩≡|0⟩_γ̂\n(the matrix  is the so-called Bogoliubov transformation. For more details see, e.g., Refs. <cit.>).\n\nWe remark that, because of the fermionic nature of the ĉ-operators, the matrix Z in Eq (<ref>)\nis antisymmetric, as can be proved by exploiting Eqs. (<ref>) <cit.>.\nIn this context, the Nambu spinor notation is useful.\nDefining Ψ̂≡ (ĉ_1, ⋯ , ĉ_L, ĉ^†_1, ⋯ , ĉ_L^†)^T, and\nΦ̂≡ (γ̂_1, ⋯ , γ̂_L, γ̂^†_1, ⋯ , γ̂_L^†)^T,\none can rewrite Eq. (<ref>) as\n\n\n    Φ̂= ^†Ψ̂ .\n\n\nThe state in Eq. (<ref>) is Gaussian, enjoys the Wick's theorem, and thus it is completely determined\nby two-point correlation functions. Using Eq. (<ref>) one can show\nthat these correlation functions have a simple expression in terms of the  matrix:\n\n    G_i,j≡⟨ĉ_i^† ĉ_j|=⟩[ v   v^†]_i,j,     \n      F_i,j≡⟨ĉ_i  ĉ_j|=⟩[ v   u^†]_i,j .\n\n\nAn important case where the state has the Gaussian form in Eq. (<ref>) is the ground state of the Hamiltonian (<ref>).\nThe Hamiltonian reads\n\n    Ĥ = 1/2 Ψ̂^† ℍ Ψ̂+ const. ,    with  ℍ = [      Q      P; -  P^* -  Q^* ].\n\nThe 2L × 2L Hermitian matrix ℍ is called the Bogoliubov-de Gennes Hamiltonian matrix,\nwhich can be diagonalized through the implementation of a Bogoliubov transformation  of the form (<ref>),\nsuch that ^-1 ℍ  = diag  [ ω_κ, -ω_κ ]_κ=1, ⋯, L.\nThe above transformation defines a new set of fermionic quasi-particles γ̂_κ [Eq. (<ref>)],\naccording to which the Hamiltonian of Eq. (<ref>) can be written as\n\n    Ĥ = ∑_κω_κγ̂_κ^†γ̂_κ + const.  .\n\nIts ground state is a Gaussian state of the form in Eq. (<ref>), that corresponds to the vacuum of the γ̂_κ operators [see Eq. (<ref>)]. \n\n\n\n\nWe note that the above formalism can be easily generalized to the case of time-varying coefficients Q_i,j(t)\nand P_i,j(t) in Eq. (<ref>), by admitting a time dependence of the Bogoliubov transformation matrix = (t).\nMoreover, as we shall see below in Section <ref>, the form of a generic Gaussian state Eq. (<ref>)\nis preserved by the application of the exponential of any operator quadratic in the ĉ fermions.\n\n\n\n\n§ EVOLVING GAUSSIAN STATES\n\n\n\nWe now discuss the evolution of a generic Gaussian state |ψ⟩ under the effect of an operator of the form \n\n\n\n    M̂(s) = ^ξ s Â,\n\t\nbeing s ∈ℝ, ξ = {1, i}, and\n\n    Â = ∑_i,j( D_i,j ĉ^†_i ĉ_j \n      + O_i,j ĉ^†_i ĉ_j^† + h.c.),\n\n\na generic Hermitian quadratic operator.\nFor simplicity of notations, we assume all coefficients in Â to be real, but our analysis can be easily generalized to the complex case.\n\nDue to the fermionic anticommutation rules, we have D^T = D, O^T = - O.\nNotice that, if ξ=i, the operator in Eqs. (<ref>) describes the real-time evolution according\nto a (pseudo)-Hamiltonian Â. On the other hand, if ξ=1, it describes an imaginary-time evolution\n(related to the construction of the thermal ensemble at inverse temperature β = 1/s),\nthat can be thought of as the analytic continuation of the purely imaginary evolution. \nAs discussed in Section <ref>, in some particular cases, the action played by such\nkind of operator on a given state can be intended as part of a measurement process.\n\nIn what follows we discuss how to evaluate, for any (real) symmetric Â operator,\nthe s-evolved state \n    |ψ(s)⟩ = M̂(s) |ψ⟩ ,\n taking as initial state |ψ⟩ a generic Gaussian state of the form (<ref>). In Appendix <ref> we show that, because of the quadratic structure of Â, the state |ψ(s)⟩ keeps the Gaussian form of Eq. (<ref>):\n\n\n    |ψ(s)⟩∝exp{1/2∑_p,q Z_p,q(s)  ĉ_p^† ĉ_q^†}|0⟩_ĉ,\n\n\nwith\n\n\n    Z(s) = -[ u^†(s) ]^-1  v^†(s)\n\n\nand u(s), v(s) submatrices of the s-evolved Bogoliubov matrix (s). In the next Subsection we are going to show how to evaluate the matrix (s) (an alternative derivation is provided in Appendix <ref>).  \n\n\n\n\n\n\n §.§ Bogoliubov matrix evolution\n\n\n\nTo characterize the evolved state |ψ(s)⟩, one only needs to know how the Bogoliubov matrix (s) evolves with M̂(s). \nExploiting the identity [ M̂(s) ]^-1 = M̂(-s), we can write \n\n    |ψ(s)⟩= M̂(s) |ψ⟩∝^𝒵̂(s)M̂(s) |0⟩_ĉ,\n\nwhere |ψ⟩ is a generic Gaussian state given by Eq. (<ref>). The operator\n\n    𝒵̂(s) = 1/2∑_p,q Z_p,q ĉ_p^†(s)  ĉ_q^†(s)\n\nis defined through the evolved fermions\n\n    ĉ_q^(†)(s) = M̂(s)  ĉ_q^(†) M̂(-s) ,\n\nobeying anticommutation relations {ĉ_q(s), ĉ_p^†(s) } = δ_p,q.\nNote that, for ξ=1, the transformation M̂(s) is not unitary and the conjugation operation does not commute with the evolution one, hence\nĉ_q^† (s) [ M̂(s) ĉ_q M̂(-s) ]^†. \nSince M̂(s) |0⟩_ĉ∝|0⟩_ĉ, to determine the evolved state, one has to calculate 𝒵̂(s). \nThis can be done by evaluating \n\n    ∂_s ĉ_q^(†)(s) = ξ M̂(s)  [ Â, ĉ_q^(†)]  M̂(-s).\n\nGiven the quadratic structure of the operator Â, the above commutators read \n\n  \n    [ Â, ĉ^†_q ]     =    -2∑_i (D_i,q ĉ_i^† + O_q,i ĉ_i),\n    [ Â, ĉ_q ]     =     -2∑_i (D_i,q ĉ_i + O_q,i ĉ_i^†).\n\n\nTherefore\n\n\n  \n    ∂_s ĉ_q^†(s)     =    - 2 ξ ∑_i  ( O_q,i ĉ_i(s) + D_i,q ĉ_i^†(s) ),\n    \n        ∂_s ĉ_q(s)     =     -2 ξ ∑_i  ( D_i,q ĉ_i(s) + O_q,i ĉ_i^†(s) ).\n\n  \n\n\nAt this point, we make the Ansatz that the fermionic operators depend on s only through a Bogoliubov-like matrix \n\n    Ψ̂(s) = (s)  Φ̂,   with  (s) = [ (s) (s); (s) (s) ] .\n\n\n\n\n\n\n\nThe expression for the submatrices of the (s) is given in Eq. (<ref>). \nNote that, while for ξ=i one has u̅^ev(s) = [u^ev(s)]^* and\nv̅^ev(s) = [v^ev(s)]^* (so that (s) is a true Bogoliubov transformation), in general this is not true. \n\n\nThe above Ansatz is equivalent to assume that the s-evolved state |ψ(s)⟩ is a Bogoliubov vacuum γ̂_μ(s)|ψ(s)⟩ = 0,  ∀μ. \nBy substituting this Ansatz in Eq. (<ref>), we obtain a set of differential equations for the elements of the evolved matrix:\n\n\n  \n  \n    ∂_s _q,μ(s)      =     -2 ξ ∑_i ( D_q,i _i,μ(s) + O_q,i _i,μ(s) ), \n    ∂_s _q,μ(s)     =     -2ξ ∑_i ( D_q,i _i,μ(s) + O_q,i _i,μ(s) ), \n    ∂_s _q,μ(s)      =    -2 ξ ∑_i ( D_q,i _i,μ(s) + O_q,i _i,μ(s) ), \n    ∂_s _q,μ(s)     =    -2 ξ ∑_i ( D_q,i _i,μ(s) + O_q,i _i,μ(s) ),\n\n\n\nwith the initial condition: _q,μ(0) = [_q,μ(0)]^*= u_q,μ, and _q,μ(0) = [_q,μ(0)]^* = v_q,μ. \nIn a compact form, these equations read\n\n    ∂_s (s) = -2  ξ 𝔸 (s),   with   𝔸 = [ - D - O;  -O - D ],\n\nbeing D^T = D, O^T = -O.\nThis leads to the formal solution\n\n    (s) = ^-2ξ𝔸s. [For s = it and Â = Ĥ, it returns the usual Hamiltonian time evolution of the system <cit.>.]\n\nThe matrix (s) is not a priori characterizing a fermionic state in that it should be unitary, to guarantee the normalization\nof the state, and should obey Eqs. (<ref>), to impose the anticommutation relations for the Ψ̂(s).\nWhile the former requirement is automatically fulfilled for ξ = i (because of the unitarity of the evolution operator),\nin the case ξ = 1 it must be forced by performing a QR-decomposition, as discussed in details in the next subsection. \nOnce the unitarity of the matrix is imposed, Eqs. (<ref>) are satisfied if the Bogoliubov matrix preserves\nthe symplectic structure of Eq. (<ref>), and this happens for Â being Hermitian. \n\nBy substituting the normalized s-evolved Bogoliubov matrix in Z(s) [cf. Eq. (<ref>)],\nwe obtain the expression for |ψ(s)⟩. If the above conditions are satisfied, this is a Gaussian fermionic state,\nas the one in Eq. (<ref>). A more detailed discussion about this point is provided in Appendix <ref>.\n\n\n\n\n §.§ QR decomposition\n\n\n\nWe now discuss how to restore the unitarity of the s-evolved Bogoliubov matrix (s), when considering a norm-non preserving evolution with ξ=1, \nthat is in general obtained by QR-decomposing the s-evolved Bogoliubov matrix (s).\nThis procedure keeps the Z(s) matrix in Eq. (<ref>) – and then the Gaussian state – invariant, as we are going to see below. Nevertheless, it is necessary to apply the known formulae <cit.> for evaluating the entanglement entropy and the local observables. \n\nThe QR-decomposition is a procedure that allows one to decompose a generic matrix as K=U_QR, with U_Q a unitary matrix and R an upper triangular one.\nIn what follows, we provide an argument to show that, if Â=Â^†, the unitary matrix obtained by QR-decomposing\nthe s-evolved Bogoliubov matrix (s) describes a fermionic state, i.e., it has the symplectic form of Eq. (<ref>). \n\nThe straightforward way would be to check it by construction, a procedure that requires some involved calculations.\nHere we choose a different strategy. Since R is positive definite (we have checked it numerically), the QR decomposition must be unique.\nTherefore, we assume U_Q to have the right structure and then we show that it exists a decomposition\nthat is compatible with this assumption.  \n\nLet us consider a symmetric operator Â defined in Eq. (<ref>) and the associated coefficient matrix 𝔸\ndefined in Eq. (<ref>). Because of the symmetries of D and O, we have that {D, O} = 0. [This simply follows\nfrom the fact that ({D, O})^† = - {D, O}. Being D and O real matrices, it implies that the anticommutator vanishes.]\nWe notice that  \n\n    𝔸^2n = [ X^2n    0;    0 X^2n ],        X^2 = D^2-O^2.\n\nBy exploiting the block diagonal form of Eq. (<ref>) and the identities\n\n    ∑_n=0^∞x^2n/(2n)! = cosh(x),     ∑_n=0^∞x^2n/(2n+1)! = sinh(x)/x,\n\nwe can write \n\n    ^-2ξ𝔸 s = ∑_n=0^∞[(-2 ξ𝔸 s)^2n/(2n)! + -2ξ𝔸 s  (-2 ξ𝔸 s)^2n/(2n+1)!]  = [ ch^+(s)   sh(s);  -sh(s) ch^-(s) ],\n\nwhere, for shortness of notation, we have posed \n\n    ch^±(s ) = I  cosh(-2ξ X s) ± D  sinh(-2 ξ X s)   X^-1,     sh(s ) = O  sinh(-2 ξ X s )   X^-1.\n\nNotice that [ch^±(s )]^† = ch^±(s ), while sh^†(s ) = - sh(s ).\nMoreover, since {D, O} = 0, we have [D, ch^±(s )] = [O, ch^±(s )] = 0 and [D, sh(s )] = [O, sh(s )] = 0. \nThis means that\n\n    [  u^ev(s) v̅^ev(s);  v^ev(s) u̅^ev(s) ]\n      = [     ch^+(s)   u + sh (s)   v  ch^+(s ) v^* + sh (s)   u^*;    - sh(s)   u + ch^-(s)   v -sh(s)   v^* + ch^-(s)   u^* ].\n\nWe can QR-decompose (s)\n\n    (s) = (s)  R(s) ,\n\nmaking the Ansatz that the (s) preserves the symplectic form of Eq. (<ref>), so that (<ref>) can be rewritten as\n\n    [  u^ev(s) v̅^ev(s);  v^ev(s) u̅^ev(s) ]\n    \t  = [   u(s) v^*(s);   v(s) u^*(s) ][ r_1(s) r_3(s);      0 r_2(s) ].\n\n\nIn what follows, we show that there exists a decomposition compatible with this Ansatz, by imposing Eq. (<ref>) and that, because of the unicity, it must be the only possible. Let us assume to have derived r_1(s) by construction.\nWe can explicitly write (s) = ^ev(s) R(s)^-1, exploiting the fact that the inverse of an upper block triangular matrix remains an upper block triangular matrix:\n\n    [   u(s) v^*(s);   v(s) u^*(s) ]\n      = [                        u^ev(s)   r_1^-1(s) u^ev(s)   r_3^-1(s) + v̅^ev(s)   r_2^-1(s);                        v^ev(s)   r_1^-1(s) v^ev(s)   r_3^-1(s) + v̅^ev(s)   r_2^-1(s) ].\n\n\nWe can substitute these expressions in Eq. (<ref>) to obtain\n\n    u^† u + v^† v  = [ r_2^T(s) ]^-1 ( [u̅^ev]^T(s)   u^ev(s) + [v̅^ev]^T(s)   v^ev(s) )  [ r_1(s) ]^-1 = I.\n\nSince [u̅^ev]^T(s)   u^ev(s) + [v̅^ev]^T(s)   v^ev(s)= I,\nthe above equation provides a relation between two of the blocks of the matrix R(s):\n\n    r_2(s) = [ r_1^T(s) ]^-1.\n\nBy imposing the second constraint in Eq. (<ref>), we find the relation for r_3(s) \n\n    r_3(s) = -r_1^T ([u^ev]^†(s)  v̅^ev(s) + [v^ev]^†(s)  u̅^ev(s))^-1( [u^ev]^†(s)   u^ev(s) + [v^ev]^†(s)   v^ev(s) ).\n\n  \nAs a last comment we notice that the matrix Z(s) in Eq. (<ref>) – and then the Gaussian state – are left invariant by the application of the QR decomposition:\n\n    Z(s) = [ u^† (s) ]^-1  v(s)^†\n      = {[ u^ev(s)   r_1^-1(s) ]^†}^-1 [ v^ev(s)   r_1^-1(s) ]^†\n      = { [ u^ev]^† (s) }^-1  [ v^ev]^†(s) .\n\n\n\n\n\n§ NUMBER-PRESERVING OPERATORS\n\n\n\nWe now consider a generic number-preserving operator \n\n    Â_ℐ, 𝒥 = ∑_i ∈ℐ∑_j ∈𝒥ĉ_i^†ĉ_j,\n\nwhere ℐ, 𝒥 are two sets of indices labeling certain sites on the system,\nand apply\n\n    = ^β\n\nto a Gaussian state. \n\nWe focus on this particular example of the theory presented in Section <ref>, since it generalizes\nthe construction discussed in Ref. <cit.>. \nBy exploiting the anticommutation relations, it is possible to show that ^n = α^n-1,\nwith α = |ℐ∩𝒥|. In fact \n\n    ^2     =    ∑_i, l ∈ℐ ∑_j, m ∈𝒥ĉ^†_i ĉ_j ĉ^†_l ĉ_m\n        = ∑_i, l ∈ℐ ∑_j, m ∈𝒥(ĉ^†_i ĉ_j δ_l,m+ ĉ_i^†ĉ_j ĉ_m ĉ^†_l) \n        =    ∑_i, l ∈ℐ ∑_j, m ∈𝒥[ ĉ^†_i ĉ_j δ_l,m+ 12ĉ_i^† (ĉ_j  ĉ_m +ĉ_m ĉ_j)ĉ^†_l] \n        = |ℐ∩𝒥|  ∑_i∈ℐ ∑_j∈𝒥ĉ^†_i ĉ_j,\n\nwhere the last equality holds, since j and m run in the same set.\nTherefore, if ℐ∩𝒥 = ∅, we have ^2 =0 and = 𝕀 +,\nwhere 𝕀 denotes the identity operator. Otherwise\n\n\n    = ∑_n=0^∞(β)^n/n!\n      = 𝕀 + (^αβ-1) /α.\n\n\nIn what follows, without loss of generality, we set β≡log(α+1)/α, so that = 𝕀 +\nreduces to that studied in Ref. <cit.> for ℐ = 𝒥 = {i}. As discussed in Appendix <ref>,\nthe application of such a  can be thought as the measurement step of a quantum-jump dynamics. \n\nWe want to evaluate the effect of this operator on a Gaussian state\n\n    |ψ⟩_≡|ψ⟩ = (𝕀 + )|ψ⟩ .\n \nFollowing the procedure discussed in Section <ref>, we write the evolved state as\n\n    |ψ⟩_∝exp{1/2∑_p,q Z_p,q k̂^†_p  k̂^†_q }|0⟩,\n\nwhere we introduced the transformed fermionic operators k̂_q^(†) =  ĉ_q^(†) ^-1.  \nBy exploiting the fact that ^-1 = 𝕀 - (α+1)^-1, we derive the exact expression of k̂^(†) \n\n  \n  \n    k̂_q^†    =     ĉ^†_q + ∑_j∈𝒥δ_q,j∑_i∈ℐĉ^†_i, \n    k̂_q     =    ĉ_q - (α+1)^-1∑_j∈𝒥δ_q,j∑_i∈ℐĉ_i.\n\n\nThis leads to the following expressions for the evolved Bogoliubov matrix:\n\n  \n    u_q,μ^ev       = u_q,μ - (α+1)^-1∑_j∈𝒥δ_q,j∑_i ∈ℐ u_i, μ,       u̅_q,μ^ev = u^*_q,μ + ∑_j∈𝒥δ_q,j∑_i ∈ℐ u^*_i, μ, \n    v̅_q,μ^ev = v^*_q,μ -(α+1)^-1∑_j∈𝒥δ_q,j∑_i ∈ℐ v^*_i, μ,        \n        v_q,μ^ev       = v_q,μ + ∑_j∈𝒥δ_q,j∑_i ∈ℐ v_i, μ.\n\n  \n\n\nAs discussed in Appendix <ref>, an alternative derivation can be obtained from the evolved antisymmetric matrix Z.\n\n\n\n\n\n §.§ Local operator\n\n\nThe above results can be applied straightforwardly to local (l) operators, as for the one\nused in Ref. <cit.>, ^l≡n̂_i = ĉ_i^†ĉ_i,\nsuch that ^l≡^log(2)Â^l = 𝕀 + ĉ_i^†ĉ_i.\nThe Bogoliubov matrix, evolves according to Eqs. (<ref>), which read\n\n  \n    u_q,μ^ev, l = (1 - δ_q,i/2) u_q,μ,      u̅^ev, l_q,μ = (1+δ_q,i) u^*_q,μ,\n       v̅^ev, l_q,μ = (1 - δ_q,i/2) v^*_q,μ,       v_q,μ^ev, l = (1+δ_q,i) v_q,μ.\n\n\nThis evolution is implemented by applying to the  a block-diagonal matrix  with entries _i+L, i+L = _i,i^-1 = 2\n(see Eq. (1) of Ref. <cit.>).\n\n\n\n\n\n §.§ Two-site operator\n\n\nWe now consider a non-local (nl) operator with support on two sites (ℐ=𝒥 = { i, j }):\n\n\n    ^nl = ( ĉ_i^† + ĉ_j^†) ( ĉ_i + ĉ_j) ,\n\n\nSince α = |ℐ∩𝒥| = 2, we have ^nl≡^log(3)/2Â^nl =  𝕀 + ^nl.\nWithout losing in generality, in the following we will focus on one dimensional systems and set j=i+r (with r>0). \n\nAs we shall see in the next Section, a measurement operator as the one in Eq. (<ref>) may unveil a richer physics than local ones.\nIn fact, in the spin-1/2 language, it corresponds to a string operator.\n\nThe evolved Bogoliubov matrix can be derived from Eqs. (<ref>) which, in this case, read\n\n  \n    u_q,μ^ev, nl    =     u_q,μ - 13(δ_q,i + δ_q,i+r)(u_i, μ + u_i+r, μ),\n    v̅^ev, nl_q,μ    =    v^*_q,μ - 13(δ_q,i + δ_q,i+r)(v^*_i, μ + v^*_i+r, μ),\n    u̅^ev, nl_q,μ    =    u^*_q,μ + (δ_q,i + δ_q,i+r)(u^*_i, μ + u^*_i+r, μ), \n    \n        v^ev, nl_q,μ    =     v_q,μ + (δ_q,i + δ_q,i+r)(v_i, μ + v_i+r, μ).\n\n\n\n\n\n\n\n§ QUANTUM JUMPS WITH STRING OPERATORS\n\n\n\nIn this section we use the machinery presented above to describe the evolution of a quantum Ising chain\nunder the effect of a quantum-jump dynamics generated by ^nl\n[cf. Eq. (<ref>) and below], with emphasis on the  evolution of the entanglement entropy. \n\nWe consider the Hamiltonian\n\n\n    Ĥ = -J ∑_j σ̂_j^x σ̂_j+1^x - h∑_j σ̂_j^z,\n\n\nwhere σ̂_j^α (α = x, y, z) are the usual spin-1/2 Pauli matrices acting on the j-th site,\nwhile J>0 denotes the ferromagnetic spin-spin coupling and h the transverse magnetic field.\nIn the thermodynamic limit, the ground state exhibits a zero-temperature continuous transition at |h/J|=1,\nseparating a paramagnetic (symmetric) phase, for |h/J| > 1,\nfrom a ferromagnetic (symmetry-broken) phase, for |h/J| < 1 <cit.>.\n\nThrough a Jordan-Wigner transformation <cit.>, the Ising model (<ref>) can be mapped into the so-called\nKitaev chain\n\n\n    Ĥ = -J∑_j( ĉ_j^†ĉ_j+1 + ĉ_j^†ĉ_j+1^† + h.c.)\n      - 2 h ∑_j ĉ^†_j ĉ_j .\n\n\nThis Hamiltonian is of the form (<ref>), with\n\n\n    Q_j,j = h,    Q_j, j+1 = Q_j+1, j = -J/2,       P_j, j+1 = - P_j+1, j = -J/2 .\n\n\nHereafter we work in units of ħ = 1, set J = 1 as the energy scale, and assume\nperiodic boundary conditions for fermions. \n\nWe implement the quantum-jump protocol described in Appendix <ref> on the fermionic model above,\nby initializing the system in the ground state of the Hamiltonian (<ref>)\nwith a given value of h and then Trotterizing the time evolution\nin steps δ t ∝ (4Nγ)^-1, to ensure convergence, being γ the strength of the measurements.\nThe emerging dynamics is one of the possible unravelings <cit.> of the Lindblad master equation <cit.>\n\n\n    ρ̇(t) = - i [ Ĥ, ρ(t) ] - γ∑_j ( ρ  - 12{, ρ}) ,\n\n\nbeing =(ĉ_j^† + ĉ_j+r^†)(ĉ_j + ĉ_j+r) the same operator as in Eq. (<ref>),\nwith i≡ j + r. [Note that, with our convention for the boundary conditions, we have ĉ^(†)_j+r≡ĉ^(†)_j+r-L for any j+r >L.]\n\nIn the spin language, this operator is a sum of strings of Pauli matrices, of length r:\n\n    =  ∏_k < jσ̂_k^z  σ̂_j^- ∏_k' < j+rσ̂_k'^z  σ̂_j+r^+\n      + ∏_k < j+rσ̂_k^z  σ̂_j+r^- ∏_k' < jσ̂_k'^z  σ̂_j^+\n      + 12( σ̂_j^z + σ̂_j+r^z -2 ) ,\n\nwith σ̂_j^± = σ̂_j^x ± i σ̂_j^y.\n\nHereafter, we refer to it as the string operator.\n\nWe point out that our framework is similar to the one presented in Ref. <cit.>, although with some important\nqualitative differences. The former is described by a random sequence\nof stabilizer-formalism measurements of Pauli string operators. These operators have a fixed range r and are taken from a random distribution of strings, located around different sites, and made of different sets of onsite Pauli operators. \n\nIn this work, in contrast, we are following an unraveling of the quantum master equation Eq. (<ref>).\nAs detailed in Appendix <ref>, we apply random quantum-jump measurements of string operators 𝕀+Â_j(r), located at different sites, but with the structure fixed as the one in Eq. (<ref>). This is sufficient to achieve\na measurement-induced nontrivial dynamics, with important consequences on the entanglement generation.\n\nIt is important to emphasize that the operators 𝕀+Â_j(r) have the exponential form given by Eqs. (<ref>) and (<ref>) (see also Sec. <ref>). In this way, the state keeps its Gaussian form under the application of the quantum jumps, and a numerical analysis of quite large system sizes is possible.\n\n\n\n\n §.§ Entanglement entropy\n\n\nLet us focus our attention on the entanglement entropy. Given a pure state |ψ⟩, there is an unambiguous way to quantify\n  its quantum correlations. We divide the system in two subchains, one with length ℓ and the other with length L-ℓ.\n  After evaluating the density matrix ρ_ℓ=Tr_L-ℓ[|ψ⟩⟨ψ|] reduced to the subsystem ℓ,\n  the entanglement entropy is quantified by its von Neumann entropy <cit.>:\n\n\n\n    S_ℓ [ρ_ℓ] = - ρ_ℓlogρ_ℓ .\n\n\nFor the Ising model we are discussing herewith, it is known that after, a sudden quench in a purely Hamiltonian dynamics, the entanglement entropy approaches a stationary value that increases linearly with ℓ, thus obeying a volume-law behavior <cit.>.\nAs discussed in Refs. <cit.>,\nthis dynamical volume law is generally destroyed by any arbitrary small local weak measurement process.\nIn this scenario, the asymptotic entanglement entropy is conjectured to exhibit either a logarithmic scaling or an area-law behavior,\ndepending on the strength of measurements and of the Hamiltonian parameters.\nWe are going to show that the situation is quite different for the case of the nonlocal operators defined in Eq. (<ref>).\n\nIn practice, to avoid spurious contributions from classical correlations, we evaluate Eq. (<ref>) on each stochastic quantum\ntrajectory |ψ_t⟩ (defined in Appendix <ref>), and then average over different stochastic\nrealizations. [For details on how to evaluate the von Neumann entropy of the reduced density matrix of Gaussian states\nsee, e.g., Ref. <cit.>.]\nFor simplicity of notation, we denote the ensemble-averaged entanglement entropy as\n\n    S_ℓ(t) ≡⟨⟨ S_ℓ[ρ_ℓ^stoch(t)] ⟩⟩,\n            ρ_ℓ^stoch(t)=Tr_L-ℓ[|ψ_t⟩⟨ψ_t|],\n\nand where the symbol ⟨⟨⋯⟩⟩ denotes the average\nover different stochastic realizations. We also define the asymptotic entanglement entropy as\n\n\n    S̅_ℓ = lim_T→∞∫_t^⋆^T dt' S_ℓ(t'). [\n      Ensemble-averaged entanglement entropies have then been obtained with N_ avg = 10^2 different quantum trajectories.\n      Subsequently, to perform time averages, we fix a given evolution time T and average in the interval t'∈ [0.7  T,   T].]\n\n\n We remark that, in all the simulations shown here, we keep fixed the partition to ℓ = L/4 and study the scaling with L.\nBelow we present two different scenarios:\nthe measurement-only dynamics (Section <ref>) and the full quantum-jump dynamics (Section <ref>).\n\n\n\n\n\n §.§ Measurement-only dynamics\n\n\n\n\n\nWe first neglect the Hamiltonian contribution, i.e., we implement the quantum-jump protocol\ndescribed in Appendix <ref> with Ĥ=0. \nThe Hamiltonian is only used to set the initial state as its ground state with h = 0.5.\nHowever, we have carefully checked that this choice does not affect the asymptotic values of S_ℓ(t), but only the transient\ndynamics. [Note that the perfectly paramagnetic state with spins pointing along the z direction (h=∞)\nis a dark state of the dissipation, therefore, initializing the system close to such state leads to slower convergence.]\nThe measurement-only dynamics allows to isolate the effects of measuring the string operators,\nwithout considering the interplay with the unitary dynamics.\n\nThe upper panels of Figure <ref> report the ensemble-averaged entanglement entropy S_ℓ(t)\nversus the rescaled time γ t, for three ranges of the string measurement operator:\nr = 1 (panel a), r = 4 (panel b), and r = L/2 (panel c), and for different system sizes L.\n\nFor r=1, the measurement-only dynamics\ncannot generate entanglement and the system stabilizes on a low-entangled asymptotic state. \n\nThis is confirmed by Fig. <ref>(d), that shows the behavior of the asymptotic entanglement entropy S_ℓ versus L,\nwhich tends to saturate to a constant value, thus obeying an area-law behavior. As expected, this result is analogous to the case\n  where onsite operators are measured <cit.>.\n\nWhen the correlation range of the dissipative string operator is increased, as for r=4, we may identify three regimes:\nthe short-time transient, the metastable plateau, and the asymptotic dynamics. \nAt short times the entanglement entropy [cf. inset of Fig. <ref>(b)] grows to reach a maximum,\nthat saturates  to a constant value for large L. \nThis is clarified by the red curve in Fig. <ref>(e), showing the maximum value of the entanglement entropy\nversus the system size (notice the logarithmic scale of the x-axis). \nAfter the initial transient, the entanglement entropy attains a metastable plateau where the entanglement entropy exhibits an area-law behavior\n[green curve in Fig. <ref>(e)]. Finally, in a time τ∼ L^2, the entanglement entropy approaches\na non-vanishing asymptotic value still obeying an area law [blue curve in Fig. <ref>(e)].\n\nThis scenario dramatically changes when r is forced to be a thermodynamic fraction of L (e.g., r = L/2): \nIn that case, the measurement-only dynamics leads to a stationary state, whose entanglement obeys a volume-law behavior.\nThis is clarified by Fig. <ref>(f), which shows the rescaled asymptotic entanglement entropy S̅_ℓ/L versus L^-1. In this plot, the saturation of S̅_ℓ/L to a finite value for L^-1→ 0 clearly suggests a linear growth S̅_ℓ∝ L for large system sizes.\n\n\n\n\n\n §.§ Effect of the Hamiltonian\n\n\n\n\n\nWe now switch on the Kitaev Hamiltonian Ĥ and follow the full quantum-jump dynamics for h=0.1, starting from\nthe ground state with h_i = 0.5. As for the case with no Hamiltonian, we have checked that the asymptotic values reached\nby the entanglement entropy are independent of h_i, while they may depend on h (although the qualitative behaviors\nwith L are unaffected by this choice).\n\nFigure <ref> displays S_ℓ(t) versus γ t (upper panels) and the asymptotic value S̅_ℓ versus L, \nfor the three ranges of r = 1 (left) r = 4 (middle), and r = L/2 (right).\n\nIn panel (a) we show the local case r=1. The long-time averaged entanglement entropy attains a stationary value which is almost\nindependent of L, as clearly visible from Fig. <ref>(d), thus reflecting an area-law behavior. Such value is generally\nlarger than the one obtained in the measurement-only dynamics, without the entangling action of Ĥ [compare with Fig. <ref>(a)].\n\nIn Fig. <ref>(b) we show the case r=4, which displays a convergence in time faster than that for a measurement-only dynamics\n[compare with Fig. <ref>(b)].  \nThe asymptotic data in Fig. <ref>(e) (x-axis in logarithmic scale)\nsuggest that S̅_ℓ initially grows sub-extensively with L, to eventually attain an area-law regime. \nPhysically, this can be understood by the fact that  for L much larger than r, the dissipation becomes effectively local and the extensive growth is destroyed.\n\nIn contrast with that, if the range r of the jump operator is comparable with the total size L, the measurements\n  can stabilize a volume-law scaling of the entanglement,\nas we can see in Fig. <ref>(c), that refers to r=L/2. Here S̅_ℓ increases in time\nand quickly attains an asymptotic value that follows a volume-law scaling [see the data in Fig. <ref>(f)\n  for S̅_ℓ/L versus L^-1, which display convergence to a finite value, in the L →∞ limit].\n\n\n\n\n\n§ CONCLUSIONS\n\n\n\nWe have unveiled some aspects of the entanglement-entropy dynamics of fermionic many-body Gaussian states,\nin the presence of a Gaussian-preserving evolution, with a special focus on the possible emergence of measurement-induced phase transitions in such systems. \nThe first part of the paper presents a detailed technical discussion on how to maintain and treat Gaussianity,\nwhen exponentials of quadratic fermion operators are applied to a Gaussian state.\nOur purpose is to provide the reader with a comprehensive guide to implement fermionic Gaussian evolutions\nand study the dynamics (not necessarily unitary) of such systems. \n\nAmong all the possible treatable evolutions, we focused on the quantum-jump unraveling of a Lindblad dynamics induced by\na particular class of quadratic fermion operators, having a simple definition in the fermionic\nlanguage, but a non-trivial string structure in terms of the Pauli matrices. We called them string operators. \n\nIn the second part of the paper, after having derived the equation of motions for a quantum-jump dynamics induced\nby the string operators, we have solved it for the quantum Ising chain, focusing on the time behavior of the entanglement entropy.\nOur main result is that the scaling of the entanglement entropy with the system size L strongly depends on the range r\nof the string operators.\n\nFor short strings (r finite), we see that the asymptotic entanglement entropy obeys an non-extensive scaling behavior.\n  In this case, the measurement operator is effectively local in space and thus it asymptotically destroys\nquantum correlations that may be generated by the unitary dynamics.\nFor string ranges comparable with the system size (r ∼ L), the measurement process may become highly entangling\nand is able to stabilize a volume-law scaling in the asymptotic entanglement entropy.\n\nRemarkably, the picture above is valid both for a measurement-only dynamics and for a dynamics where also the effect\nof a short-range Hamiltonian is considered. So, the measurement dynamics of the string operators is strong enough\nto induce different entanglement scalings by itself.\n\nA natural extension of our work could be to understand how the MIPT scenario would change in the mutual presence of\nunitary dynamics and long-range measurement operators (e.g., by considering some power-law decay\nof dissipators with the distance).\nIt would be also interesting to go beyond free-fermion models and address the role of interactions in the entanglement dynamics\nunder variable-range monitoring.\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe acknowledge fruitful discussions with V. Alba, M. Collura, R. Fazio, M. Schirò, and X. Turkeshi. \n\n\n\n\n\n\n\n  \nFunding information\nThis work has been partly funded by the Italian MIUR through PRIN Project No. 2017E44HRF.\n\n\n\n\n\n\n§ ROTATION TO THE DIAGONAL BASIS\n\n\n\nHere we discuss a different derivation of the s-evolved state |ψ(s)⟩=M̂(s)|ψ⟩, where |ψ⟩ is a generic Gaussian state [Eq. (<ref>)], and the M̂(s)=^ξ sÂ is defined in Eqs. (<ref>).\n\nThe operator Â [Eq. (<ref>)] is quadratic in the ĉ fermions and can be written compactly as Â = Ψ̂^†𝔸Ψ̂,\nwhere Ψ̂= (ĉ_1, ⋯ , ĉ_L, ĉ^†_1, ⋯ , ĉ_L^†)^T is the Nambu spinor\nassociated to the ĉ fermions and 𝔸 the Bogoliubov-de Gennes matrix associated to Â, as defined in Eq. (<ref>).\nThis matrix can be diagonalized by a Bogoliubov transformation 𝕎, such that\n\n\n    𝕎^†𝔸𝕎 = diag  [ϵ_ν, - ϵ_ν]_ν=1, ⋯, L ,   and  Â=∑_νϵ_ν(η̂_ν^†η̂_ν - η̂_νη̂_ν^†) .\n\n\nThe unitary matrix 𝕎 defines a new set of η̂ fermions, whose associated Nambu spinor is\nΘ̂≡ (η̂_1, ⋯, η̂_L, η̂^†_1, ⋯, η̂_L^†)^T = 𝕎^†Ψ̂. \n\nLet us now evaluate |ψ(s)⟩.\nWe remind that the initial state |ψ⟩ is is the vacuum of the γ̂ fermions,\n  defined through the Bogoliubov transformation in Eq. (<ref>):\nΦ̂= ^†Ψ̂, where Φ̂= (γ̂_1, ⋯ , γ̂_L, γ̂^†_1, ⋯ , γ̂_L^†)^T.\nThese fermions can be transformed into those diagonalizing 𝔸 by means of a rotation\t\n\n    Φ̂= ^† 𝕎 Θ̂= ℚ^† Θ̂,   being ℚ = [   u_η v_η^*;   v_η u_η^* ] .\n\n\nTherefore we have the relation\n\n\n    = 𝕎 ℚ ,\n\n\nwith  given in Eq. (<ref>). In the η̂ representation, the state (<ref>) takes the form\n\n\n    |ψ⟩∝exp{1/2∑_μ,ν Z_μ,ν^(η) η̂_μ^† η̂_ν^†}|0⟩_η̂,\n\n\nwith Z^(η) = -[ u_η^†]^-1  v_η^†.\n\nGoing on analogously as in Sec. <ref>, we can write the s-evolved state as\n\n\n    |ψ'⟩∝exp{1/2∑_μ,ν Z_μ,ν^(η) η̂^†_μ(s)  η̂^†_ν(s) }M̂(s)|0⟩_η̂ ,\n\nwith η̂^†_ν(s) ≡M̂(s)  η̂^†_ν M̂(-s). \nThe operator M̂(s) is number-preserving, therefore we can exploit the methods of Section <ref>. \nWe first notice that M̂(s) |0⟩_η∝|0⟩_η, in fact\n\n\n    ^ξ s∑_νϵ_ν(η̂_ν^†η̂_ν-η̂_νη̂_ν^†)|0⟩_η̂ = ^-ξ s∑_νϵ_ν|0⟩_η̂ ,\n\n\nbecause η̂_ν|0⟩_η̂=0, ∀ ν∈{1, …, L}. Then we notice that, since (η̂_ν^†η̂_ν)^n = η̂_ν^†η̂_ν (cf. Section <ref>), we have\n\n\n    M̂(± s) = ^±ξ s Â =    ^∓ξ s∑_νϵ_ν∏_ν[1+ ∑_n=1^∞(± 2 ξ sϵ_ν)^n/n!η̂_ν^†η̂_ν]\n    \n    \t =    ^∓ξ s∑_νϵ_ν∏_ν[1 + (^± 2 ξ s ϵ_ν -1 ) η̂_ν^†η̂_ν] ,\n\n\nwhere we have applied the diagonal form of Â, in Eq. (<ref>). Therefore, according to the fact that [ η̂_μ^†η̂_μ, η̂_ν^†] = δ_μ, νη̂_μ^†, we can write\n\n    η̂^†_ν(s)= [ 1 + (^2 ξ s ϵ_ν -1 )η̂_ν^†η̂_ν]  η̂_ν^†[ 1 + (^- 2 ξ s ϵ_ν -1 )η̂_ν^†η̂_ν] = ^2 ξ s ϵ_νη̂_ν^†.\n\n\nSubstituting into Eq. (<ref>) we get\n\n\n    |ψ(s)⟩∝exp{1/2∑_μ,νZ̃_μ,ν^(η) η̂^†_μ η̂^†_ν}|0⟩_η̂ ,   with Z̃^(η)_μ, ν≡ Z_μ,ν^(η) ^2ξ s(ϵ_μ+ϵ_ν).\n\n\nWe can also write Z̃^(η) = -[ u_η^ev^†(s) ]^-1v_η^ev^†(s), with\n\n\n    [ u_η^ev(s); v_η^ev(s) ] =[ ^-2ξ s ϵ        0;        0  ^2ξ s ϵ ][ u_η; v_η ],   being  ϵ = diag(ϵ_ν).\n\n\nAt this point, if ξ=1, we apply the QR decomposition to [ u_η^ev(s); v_η^ev(s) ],\nas explained in Sec. <ref>. In this way, the matrix Z̃^(η) remains unchanged, \nbut can be written as Z̃^(η)=-[ u_η^†(s) ]^-1v_η^†(s), with u_η(s), v_η(s)\nobeying the symplectic unitarity conditions Eq. (<ref>) and written as\n\n\n    [ u_η^ev(s); v_η^ev(s) ]=[ u_η(s); v_η(s) ] r_1 ,\n\n\nwith r_1 some upper triangular matrix L× L.\n\nWe have therefore reduced to the standard Gaussian form for the evolved state |ψ(s)⟩ in the η̂ representation, with the Z matrix  given by Z̃^(η)=-[ u_η^†(s) ]^-1v_η^†(s), and the symplectic unitary matrix\n\n    ℚ(s) = [   u_η(s) v_η^*(s);   v_η(s) u^*_η(s) ]\n\nproviding the set of fermionic operators γ̂_ν(s) annihilating |ψ(s)⟩\n[we have Φ̂(s) = ℚ^†(s)  Θ̂, with Φ̂(s) ≡ (γ̂_1(s), ⋯ , γ̂_L(s), γ̂^†_1(s), ⋯ , γ̂_L^†(s))^T].\n\nAt this point it is possible to come back to the ĉ representation. We can use Eq. (<ref>), and obtain the Bogoliubov matrix (s) [the one such that Φ̂(s) = 𝕌^†(s)Ψ̂] as (s) = 𝕎 ℚ(s). Applying 𝕎 on the left of both sides of Eq. (<ref>) and writing\n\n\n    (s) = [   u(s) v^*(s);   v(s) u^*(s) ] ,\n\n\nwe obtain\n\n\n    [ u(s); v(s) ]r_1 = ^-2ξ s 𝔸[ u; v ] .\n\n\n[To get this result, we used the relation (s) = 𝕎 ℚ(s), as well as Eqs. (<ref>), (<ref>), and (<ref>)]. The Z matrix of the evolved state in this representation is thus Z(s)=-[ u^†(s) ]^-1 v^†(s). Notice that Eq. (<ref>) is the same result of Eq. (<ref>), when the QR decomposition discussed in Sec. <ref> is applied. \n\n\nAs a last comment we point out that Eq. (<ref>) refers to the first two blocks of the Bogoliubov matrix  only. \nThis is consistent with the fact that, in the Nambu spinor notation, the degrees of freedom are doubled and there is some redundant information\nthat can be neglected. \n\n\n\n\n\n§ QUANTUM-JUMP PROTOCOL\n\n\n\nWe start from the following master equation in the Lindblad form:\n\n    ρ̇(t) = ℒ[ ρ(t) ] ≡\n      - i [ Ĥ, ρ(t) ] - γ∑_j ( m̂_j ρ m̂_j^† - 12{m̂_j^† m̂_j, ρ}),\n\nwhere ρ(t) is the density matrix describing the state of the system at time t and m̂_j^(†) are\nthe Lindblad jump operators, while ℒ denotes the Lindbladian superoperator acting on ρ. \nThe solution of Eq. (<ref>) is, in general, a mixed state that can be thought of as an average\nover many pure-state quantum trajectories of a suitable stochastic process. \nGiven a Lindbladian, there are many stochastic processes (or unravelings) that produce the same averaged density matrix <cit.>.\nAmong them, in this paper we focus on the so-called quantum-jump unraveling <cit.>, whose implementation is described below. \n\nWe define the non-Hermitian Hamiltonian\n\n    Ĥ_eff = Ĥ - iγ/2∑_j m̂_j^† m̂_j,\n\nthen we rewrite Eq. (<ref>) \n\n    ρ̇(t) = - i [ Ĥ_eff, ρ(t) ] - γ∑_j m̂_j ρ m̂_j^† .\n\nIn this form, the Lindblad dynamics ruled by Eq. (<ref>) can be interpreted as a deterministic\nnon-Hermitian time evolution of a pure quantum state |ψ_t⟩\ngenerated by Ĥ_eff, plus a stochastic part given by the possibility\nof applying m̂_j to the state |ψ_t⟩ [cf. the second term in the right-hand-side\n  of Eq. (<ref>)]. \nFor m̂_j Hermitian, this dynamics can be thought of as an occasional, yet abrupt, measurement process\nin which, at any time, the system has a chance to be POVM-measured <cit.>, i.e.,\n  to undergo the action of one of the operators m̂_j, taken from a distribution (see more details below).\n\n\nIn this framework, Eq. (<ref>) can be solved by implementing the following stochastic process.\nThe time evolution is discretized in time slices of step d t. Then, at each step:\n\n\n  * With probability π_j = γ⟨m̂^†_j  m̂_j|d⟩t, the jump operator is applied:\n  \n    |ψ_t+dt⟩↦m̂_j |ψ_t⟩/||m̂_j |ψ_t⟩||;\n\n\n  * With probability π = 1 -∑_j π_j the non-Hermitian evolution occurs:\n  \n    |ψ_t+dt⟩↦^-i  Ĥ_eff  dt |ψ_t⟩/||^-iĤ_eff  dt|ψ_t⟩||.\n\n\nNote that the Lindblad master equation in Eq. (<ref>) is invariant under a shift of the jump operators\nm̂_j ↦𝕀+m̂_j. In practice, one can implement the protocol described above with the Lindblad\noperators 𝕀+m̂_j (as we actually do in Sec. <ref>),\ninstead of m̂_j, and obtain the same averaged density matrix, although the single trajectories |ψ_t⟩\nmay behave differently.\n\nWe remark that, since the von Neumann entropy of Eq. (<ref>) quantifies the amount of genuine quantum correlations of a pure state,\nwe first evaluate it over the single pure-state quantum trajectory and then perform the ensemble averaging.\nIt is important to fix the order of the two operations of measuring and ensemble averaging, since they\nare commuting only for linear functions of the state ρ (as for expectation values of observables),\nbut not for quantities as the one in Eq. (<ref>).\nFor a more detailed discussion see, e.g., Refs. <cit.>. \n\n\n\n\n\n§ EVOLUTION OF THE STATE: A DIFFERENT DERIVATION\n\n\n\nIn this appendix we provide a different derivation of the analytic expression for the evolved state |ψ⟩_,\nby evaluating the operator 𝒵̂(1)= 1/2∑_p,q Z_p,q ĉ_p^†(1)  ĉ_q^†(1), in Eq. (<ref>).\nTo this purpose we notice that \n\n    [ , Ẑ] = 1/2∑_p,q∑_i∈ℐ(Z_p,𝒥δ_q,i + Z_q,𝒥δ_p,i)  ĉ^†_p  ĉ^†_q,\n\nwhere we have defined 𝒵̂ = 1/2∑_p,q Z_p,q ĉ_p^† ĉ_q^†\nand Z_p, 𝒥 = ∑_j∈𝒥  Z_p,j. \nConsequently [Ẑ, [,  Ẑ] ] = 0. This allows to write\n\n    ^Ẑ = ^Ẑ( + [ , Ẑ] ),\n\nthat, together with |0⟩ = |0⟩, leads to\n\n    |ψ⟩_ = 𝒩^Ẑ(𝕀 + [ , Ẑ] ) |0⟩.\n\nSince [ , Ẑ]^2 = 0, we can write exp{ [ , Ẑ ] } = 𝕀 + [ , Ẑ]\nand, therefore,\n\n    |ψ⟩_  = 𝒩^Ẑ^[ , Ẑ]|0⟩≡𝒩^Ẑ'|0⟩,\n\nbeing\n\n    Ẑ' = 1/2∑_i ∈ℐ∑_p,q[ Z_p,q +(Z_p,𝒥δ_q,i+Z_q,𝒥δ_p,i) ] ĉ^†_p  ĉ^†_q.\n\n\nFor the local case ^l in Subsec <ref>, the jumped state |ψ⟩_^l is described\nby the antisymmetric matrix [ Z^l]', with\n\n    [ Z^l]'_p,q = (1 + δ_q,i + δ_p,i)Z_p,q.\n\nOn the other hand, for the non-local case ^nl in Subsec. <ref>, the antisymmetric matrix [ Z^nl]' reads\n\n    [ Z^nl]'_p, q = Z_p, q + (δ_p,i + δ_p, i+r)(Z_i,q+Z_i+r, q).\n\n\n\n\n\n\n\n\n\n\n"}