{"entry_id": "http://arxiv.org/abs/2303.07099v1", "published": "20230313133945", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women's Ideological Spaces", "authors": ["Utkucan Balci", "Chen Ling", "Emiliano De Cristofaro", "Megan Squire", "Gianluca Stringhini", "Jeremy Blackburn"], "primary_category": "cs.CY", "categories": ["cs.CY", "cs.SI"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBeyond Fish and Bicycles: Exploring the Varieties of Online Women's Ideological Spaces\n    Utkucan Balcı^1, Chen Ling^2, Emiliano De Cristofaro^3,\nMegan Squire^4, Gianluca Stringhini^2, Jeremy Blackburn^1\n\n^1Binghamton University, ^2Boston University, ^3University College London, ^4SPLC\n    \n========================================================================================================================================================================================================\n\n\n\n\n  \n  The Internet has been instrumental in connecting under-represented and vulnerable groups of people.\n  Platforms built to foster social interaction and engagement have enabled historically disenfranchised groups to have a voice.\n  One such vulnerable group is women.\n  In this paper, we explore the diversity in online women's ideological spaces using a multi-dimensional approach.\n  We perform a large-scale, data-driven analysis of over 6M Reddit comments and submissions from 14 subreddits.\n  We elicit a diverse taxonomy of online women's ideological spaces, ranging from counterparts to the so-called Manosphere to Gender-Critical Feminism.\n  We then perform content analysis, finding meaningful differences across topics and communities.\n  Finally, we shed light on two platforms, ovarit.com and thepinkpill.co, where two toxic communities of online women's ideological spaces (Gender-Critical Feminism and Femcels) migrated after their ban on Reddit.\n\n  \n\n\n\n\n\n[1]Published in the Proceedings of the 15th ACM Web Science Conference 2023 (ACM WebSci 2023). Please cite the WebSci version.\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nWhile issues of misogyny and the LGBTQ+ community have been a part of public discourse for quite some time, the focus on gender, and specifically women, has become central. \nAlthough gender studies is a well-established field, discussions of gender identity have grown well beyond academic circles.\nIn particular, online communities focused on gender identity of women have emerged, birthing full-blown social movements.\n\nIn this paper, we perform the first large-scale, data-driven study of online women's ideological communities – i.e., communities that are focused on not just issues that women face but also what it means to be a woman.\nTo do so, we construct a dataset of over 6 million posts/comments from 14 women-oriented ideological subreddits.\nWe perform a data-driven analysis across several axes, focusing on identifying and understanding different subcommunities within our dataset.\n\nFirst, we identify women-oriented ideological subreddits and quantitatively derive a taxonomy from them, resulting in three clusters: 1) Mainstream Feminism, 2) Gender-Critical Feminism, and 3) Manosphere Analogs.[The Manosphere is, roughly speaking, a conglomerate of Web-based, mostly misogynist, movements focused on “men’s issues” <cit.>.]\n\nWe compare the user-base similarity of each community, finding similiarties between Gender-Critical Feminism (which became very popular a few months before being banned) and two Manosphere Analog communities, Femcels and WGTOW. \n\n\n\nWe then perform a quantitative topic analysis using Top2Vec, a model extracting semantic meaning from text. \nWe also analyze, qualitatively, a random sample of 100 posts from the various topics; this reveals how even discussions about mundane topics like clothing can serve to differentiate the communities.\nWe find that Mainstream Feminism is more focused on women's problems related to toxic masculinity; also, among Manosphere Analogs, the overall leaning of the posts of Female Dating Strategy, Femcels, and WGTOW are more similar to each other compared to Red Pill Women. \n\nFinally, we explore the effect of the deplatforming of two toxic communities in our dataset, Gender-Critical Feminism and Femcels.\nWe find that bans increased the toxicity of latter and decreased that of the former. \nThat said, deplatforming appears to have increased identity attacks in both communities.\n\n\n\n\n§ BACKGROUND & RELATED WORK\n\n\n\nGender-based ideologies and movements are much older than the Internet and social media.\nFirst-wave feminism dates back to the 19th century <cit.>, the transgender rights movement to the 1950s <cit.>, and the men's rights movement to 1970s <cit.>.\nAlthough there are studies to understand gendered online movements and communities <cit.>, these mostly lack a variety of online women's ideological spaces, prompting the need for a broader taxonomy. \n\nOnline Feminism.\nFeminism, in general, is defined as “the belief in social, economic, and political equality of the sexes <cit.>.”\nIn the past, studies on online feminism have predominantly examined the movement as a cohesive whole, without differentiating between its various branches or perspectives.\nPrevious studies have examined the use of hashtags on Twitter to gain insights into online feminist movements <cit.>.\nKhan and Golab <cit.> analyzed gendered movements on Reddit, focusing on r/Feminism, r/MensRights, and r/TheRedPill; they found that users of r/Feminism were more similar to those of the Men's Liberation Movement, a feminist ally, than users of r/MensRights and r/TheRedPill.\nSimilarly, Brattland <cit.> examined the information preferences of users on r/Feminism and r/MensRights using r/News to investigate the Brock Turner case, and found that only the former actively worked to combat rape culture.\nSimoes et al. <cit.> argue that online feminism and misogyny gain strength under similar online conditions.\n\nStudies examining feminist Facebook pages have found that they offer greater participation and empowerment to feminist activism, serving as a safe space <cit.>, and feminism is also linked to greater internal political efficacy <cit.>.\nMoreover, while feminism uses “trolling” to celebrate women's embodiment and sexuality and to engage with feminist values, feminists do not suppress debate when being trolled <cit.>.\n\nThese studies do not always distinguish between its various branches, even though prior research has identified a division within feminism based on either liberal versus radical or trans-inclusive versus trans-exclusive viewpoints <cit.>.\nGender-Critical Feminism (GCF), also derogatorily known as trans-exclusionary radical feminism (TERF), views transgender people's activism and visibility as a possible threat to women's rights and spaces due to their challenging of the binary understanding of sex and gender <cit.>.\nIn June 2020, Reddit banned r/GenderCritical in response to new hate speech rules, leading to the migration of r/GenderCritical to a Reddit-like platform called ovarit.com <cit.>.\nPrevious research used Twitter data to build classifiers to detect TERF hate groups on Twitter <cit.>.\nNonetheless, there has not been any large-scale, comprehensive study that analyzes and compares the more liberal, trans-inclusive side of feminism and the more radical, trans-exclusive side of feminism.\n\nManosphere “Analogs.”\nOne well-explored gender-based ideological space is a collection of men's ideological communities called “the Manosphere.”\nLilly <cit.> presented a taxonomy of the Manosphere by analyzing its subcultures, showing these communities view masculinity to be “in crisis,” constantly under attack by feminizing forces, and see feminism as hypocritical and repressive.   \nCommunities within the Manosphere exhibit disturbingly increased levels of toxicity, hate, and a proclivity for real-world violence <cit.>.\nThere is also a connection between them and the alt-right <cit.>.  \nThe alt-right has embraced the practice of describing women as “shield maidens” and “trad wives,” which serves to mask their underlying white supremacist ideology <cit.>.\n\nThe Manosphere, due to its nature, has a notably low participation rate among women <cit.>.\nNevertheless, its increasing popularity has led to the emergence of women's communities analogous to those in the Manosphere.\nOne example of these “Manosphere Analogs” is femcels (female involuntary celibates).\nAs the analog of incels, the women in this community cannot find a sexual or a romantic partner, and many share their experiences of living with a body that is deemed unappealing to men <cit.>.\nSimilar to other pilled ideologies, femcels refer to their “realization” about society as taking the pink pill <cit.>.\nIn January 2021, a femcel subreddit, r/Trufemcels, was banned on Reddit for violating the site's rules against promoting hate, leading to the community's migration to thepinkpill.co as an alternative <cit.>.\nAnother example is Red Pill Women (RPW).\nAs the analog of the Manosphere subculture The Red Pill <cit.>, most of the users in this community do not believe in gender equality, and they discuss house-wife duties, or supporting their alpha men <cit.>. \nEven though there are previous studies on RPW and femcels <cit.>, there have not been any large-scale studies focusing on them.\n\nThere are also understudied Manosphere Analog communities, or communities that have been covered in online journalistic articles, but only recently gained attention from the academic research community.\nOne such community is Female Dating Strategy (FDS), present on Reddit as r/FemaleDatingStrategy, and seemingly similar to a Manosphere subgroup called Pick Up Artists (PUA). \nLike PUA, FDS members objectify the opposite gender by approaching interactions as some kind of a game <cit.>.\nLing <cit.> examined a sample of r/FemaleDatingStrategy, considering it as a movement related to femcels, but we treat it as a distinct community due to their similarities to PUA.\nNotably, Ling identified parallels between femcel ideology and radical feminism.\nAnother study <cit.> found that Femcels and FDS use certain words in an analogous manner to Manosphere communities.\nAnother community is WGTOW (Women Going Their Own Way).\nAs the analog of Men Going Their Own Way (MGTOW), this community consists of women who aim to separate their lives with men, and they have gathered on r/wgtow on Reddit <cit.>.\n\n\n\n\n\n\n\n\n\n§ DATASET\n\n\n\nWhile previous research investigated various aspects of online women's ideological spaces (OWIS) <cit.>, a well-defined taxonomy is currently lacking, and certain communities within OWIS remain unexplored.\nTo address this gap, we select a variety of feminist and Manosphere Analog subreddits as seeds; then, we identify subreddits with a similar community structure (i.e., subreddits that are a part of OWIS).\n\n\n\n\n\n\n §.§ Identifying Women-Based Ideological Subreddits\n\nWe set out to build a compact cluster that includes all of our seed subreddits, which consist of women-based ideological subreddits covering many viewpoints (e.g., feminist and anti-feminist). \n\nFeminist Seed Subreddits.\nWe select r/Feminism, which is previously used in studies to represent feminism <cit.>, as well as r/GenderCritical.\nWhile GCF has a relatively toxic culture and has made alliances with non-feminist groups that share their anti-trans views <cit.>, it is a feminist community nevertheless.\nBy including both r/Feminism and r/GenderCritical as seeds, we aim to capture a wider portion of the OWIS spectrum.\n\n\n\nManosphere Analog Seed Subreddits.\nTo represent Female Dating Strategy, Femcels, Red Pill Women, and WGTOW, we choose r/FemaleDatingStrategy, r/Trufemcels, r/RedPillWomen, and r/wgtow, as their relationships to these communities are explained in Section <ref>.\n\n\n\nSubreddit Embeddings.\n\nTo identify the subreddits that belong to OWIS, we rely on pre-trained subreddit embeddings provided by Raymond et al. <cit.>, who build on <cit.> to train subreddit embeddings (aiming to explore the community structure of Reddit).\nThis embedding is trained with word2vecf <cit.>, using users as contexts and subreddits as words.\nThe training data consists of comments posted to the top 10,000 subreddits of 2019, which encompass 95.6% of all comments made that year (1.59 billion comments from 19.34 million users) <cit.>. \n\nWe opt for this embedding for three reasons:\n1) the seed subreddits we select were active between February 2019 (the first post of r/FemaleDatingStrategy) and June 2020 (the last post of r/GenderCritical before its ban), and 2019 accounts for almost two-thirds of this time period,\n2) of the six seed subreddits, five are among the 10,000 subreddits featured in this embedding, with the exception of r/wgtow,\nand 3) as we show in Section <ref>, the normalized user overlaps of each subreddit we identify later in this section exhibit a strong correlation with their corresponding normalized user overlaps from 2019.\n\n\nClustering.\nAfter applying dimensionality reduction with UMAP <cit.>, we perform agglomerative clustering <cit.>, which is hierarchical clustering that follows a bottom-up approach by merging the closest clusters at each step, with the number of clusters controlled by a parameter (k).\n\nWe start with k = 10 and increment it by 10 until we find the largest k that results in all of the seed subreddits appearing in the same cluster (i.e., while there is still a single, potential OWIS cluster).\nThis method produces 50 clusters, where the cluster containing our seed subreddits has a size of 284.\nUpon manual inspection, we find these subreddits cover a broader set of topics than just OWIS, including dating-related subreddits (e.g., r/Tinder, r/Bumble, r/dating_advice), self-improvement subreddits (r/selfimprovement, r/IWantToLearn, r/getdisciplined), men's ideological online spaces (e.g., r/TheredPill, r/GenderCriticalGuys, r/MensRights), and many general interest subreddits (r/AmItheAsshole, r/confession, r/offmychest).\nTo get a more compact cluster, we apply another step of clustering.\nWe use the same technique on the vectors of the subreddits of this cluster, starting from k = 1 and incrementing by one until we get the largest cluster that contains all seed subreddits.\nWith k = 7, we get 69 subreddits, most of which are gender-based ideological spaces or subreddits based on appearance (e.g., r/short, r/tall, r/amiugly).\nWe believe these subreddits are clustered with gender-based ideological spaces mainly because of their relations with Incel subreddits (e.g., r/shortcels).\n\nResults.\nTo extract women-based ideological subreddits, we manually examine the subreddits in this cluster in terms of names, titles, bios, and banners of these subreddits, choosing the ones that are clearly women-oriented according to our interpretation of the relevant literature (i.e., self-statements that they are women oriented or belong to a women-oriented community).\nOverall, we identify 15 women-based subreddits, but ultimately exclude two that are based on appearance (r/TallGirls and r/GirlsMirin), as we find no evidence of them being ideology related.\nIn the end, our dataset includes 14 subreddits, with 13 from the clustering, along with r/wgtow, a clear analog of MGTOW.\n\n\n\n\n\n\n §.§ Data Collection\n\nWe collect 6,876,566 posts (submissions + comments) from the 14 subreddits using the Pushshift API <cit.> between February 2008 and February 2022.\nTable <ref> reports the total number of posts, and the total number of authors, with the earliest and latest post dates of each subreddit.\nThe most popular subreddit is r/FemaleDatingStrategy with 1,763,702 posts, followed by r/GenderCritical with 1,629,169 posts, while r/wgtow is the smallest, with 35,644 posts.\n\nEthics.\nWe are aware that social media data can potentially reveal personal information. \nTo ensure that our research adheres to ethical principles, we adopt standard best practices <cit.>, including not attempting to further de-anonymize any author.\nAs our study solely employs publicly available data and does not involve interactions with participants, our institution does not consider it as human subjects research.\nHowever, to avoid targeting any user on the basis of their comments featured in our topic analysis, when presenting examples, we paraphrase text while preserving its original tone and context.\n\n\n\n\n\n\n§ USER ANALYSIS\n\n\n\nIn this section, we present our taxonomy of OWIS. \nThen, we analyze the activity and the user-bases of the communities we identify within the taxonomy.\n\n\n\n §.§ Creating an OWIS Taxonomy\n\n\nIn Section <ref>, we use agglomerative clustering to find a cluster that keeps all our seed subreddits by controlling the cluster size.\nNext, to create a taxonomy, we perform agglomerative clustering without controlling the cluster size to automatically find the communities of OWIS.  \nIn the end, we find three main clusters: \n1) Mainstream Feminism.\n2) Gender-Critical Feminism (GCF),\nand 3) Manosophere Analogs.\nFor the latter, rather than examining all the subreddits together, we split the cluster into their respective Manosphere Analog communities (Femcels, FDS, and RPW) while treating r/wgtow as its own community (due to being a direct analog of WGTOW) to allow for more fine-grained analysis.\n\nFigure <ref> presents our final taxonomy, which goes to complement Table <ref>.\nNote that Mainstream Feminist subreddits are the oldest, and have the most posts.\nAlso, due to being banned from Reddit, three of the five Femcel subreddits and all of the GCF subreddits most recent posts are in 2020 and 2021, about a year before the end of our dataset.\n\n\n\n\n\n\n §.§ Monthly User Activity\n\nTo understand the popularity of the communities over time, we look for their monthly user counts.\nFigure <ref> shows Mainstream Feminism is the most popular community for the majority of the time.\nWe find GCF has become the most popular community in 9 out of 10 months in their last year before their ban on Reddit. \nWe also see a sharp increase in FDS after its establishment, where they became the most popular community of September 2019.\nWe observe a trend of decrease in FDS starting after January 2021.\nAlthough the decrease in the monthly user counts of Femcels is naturally expected after three of their subreddits were banned on January 2021, we also see a decrease in this community after the ban on GCF subreddits.\nAs we explore it next, this can indicate an underlying relationship between the authors of GCF and Femcels.\nFor RPW, we see a relatively stable monthly user count, with an average of 616 monthly users.\nAs the smallest community, WGTOW has the fewest monthly users, averaging 114.\n\n\n\n\n\n §.§ User-Base Overlaps\n\nTo look deeper into the relationship between each community, we examine the user overlaps between each subreddit.\nSince there are different amounts of users in each community, following Squire's work <cit.>, we normalize the user overlaps with Bonacich's method <cit.>.\nFrom Figure <ref>, we see Mainstream Feminism has the least inter-community normalized user overlaps (mean: 0.35) compared to the other two communities with more than one subreddit, namely, GCF (mean: 0.77) and Femcels (mean:0.67).\nThis might be due to the subreddits of Mainstream Feminism appealing to more mainstream audiences than the other OWIS communities.\n\nWe find r/GenderCritical is less similar to r/Feminism compared to the two subreddits of Manosphere Analogs, r/PinkPillFeminism and r/wgtow.\nConsidering r/GenderCritical has a more normalized user overlap score with 6 out of 8 Manosphere Analog subreddits compared to any Mainstream Feminist subreddit, this might imply that GCF is a fringe feminist community.\n\nMoreover, RPW is more similar to Femcels and WGTOW compared to other communities.\nAlso, despite WGTOW having a 0.74 normalized user overlap with r/PinkpillFeminism (a Femcel subreddit), they are closer to FDS compared to their normalized mean overlaps with Femcel subreddits (0.62).\n\nSince we use subreddit embeddings from 2019 to create our taxonomy, we also check whether the user-base overlaps from 2019 correlate with our results.\nTo this end, we calculate Spearman correlation, finding it to be strong (ρ = 0.95, p < 0.01).\n\n\n\nTakeaways.\nMainstream Feminism, GCF, and Manosophere Analogs are the three main communities of OWIS.\nInterestingly, even though Mainstream Feminism was the most popular community of OWIS for most of the time, GCF overtook it closer to their ban on Reddit.\nWe also show that r/GenderCritical has more normalized user overlaps with 6 out of 8 Manosphere Analog subreddits compared to any of the Mainstream Feminist subreddits; this suggests an underlying relationship with GCF and some of the Manosphere Analogs.\n\n\n\n§ TOPIC ANALYSIS\n\n\n\nWe now we examine the main focus of each community by analyzing their most popular topics, which allows us to study, at scale, differences in discussion across the communities.\n\nTopic Modeling. We train a Top2Vec model to explore the most popular topics of the communities of OWIS.\nTop2Vec finds the topics of the documents by clustering their embedding vectors using UMAP and HDBSCAN <cit.>, where this intuition comes from the assumption of many semantically similar documents (in our case, posts on Reddit) are indicative of an underlying topic <cit.>.\nWe choose Top2Vec over “traditional” topic modeling techniques like LDA for three main reasons: \n1) Top2Vec does not ignore the ordering and semantics of words, and makes it possible to automatically find the number of topics <cit.>;\n2) It finds topics based on documents instead of words; and\n3) Its underlying techniques help us capture more specific topics, and yield a better intuition about each community. \n\nWhile training our model, we use default parameters, remove hyperlinks, and the posts from r/AutoModerator to avoid auto-moderation posts, and train a Doc2Vec <cit.> model from scratch to ensure unique vocabulary (e.g., slang) is captured.\n\nWe then conduct a more in-depth analysis of their popular topics by manually reviewing 100 sampled posts for the top 10 most frequently discussed topics in each community.\nWe remove at most one topic for each community if we consider it an outlier consisting of incoherent posts with basic replies to other posts or salutations.\n<ref>tab:feminism_top10,tab:gcf_top10,tab:fds_top10,tab:femcels_top10,tab:rpw_top10,tab:wgtow_top10 show the top 10 topics of each community.\n\n\n\n\n\n  \n\n\n\n\n  \n \nMainstream Feminism.\nWe observe that the posts in the sex conviction topic are generally oriented around discussions related to false accusations, e.g:\n\n  \n  Fake accusations are increasingly being used as a means of political manipulation.\n\n\nPosts in the career, kyriarchy (a term linked to patriarchy and refers to an individuals's status in different social categories <cit.>), and toxic masculinity topics are generally about women's disadvantages due to patriarchal and toxic-masculine mindsets, e.g.:\n\n  \n  Women get more college degrees but men dominate high-paying jobs.\n\n\n\nPosts in the elections topic are US presidential election oriented, focusing on Democratic candidates (e.g., Hillary Clinton and Bernie Sanders), \nwhile those in the sexual assault topic are generally about date rapes or discussions around intoxication and consent, e.g.:\n\n  \n  Sexual activity with a person unable to consent due to intoxication is considered rape.\n\n\nWe find two topics related to the Men's Right Activists (MRA) are among the top 10 topics of Mainstream Feminism.\nPosts in the MRA (Reddit) topic are generally about the Mainstream Feminist subreddits' tensions between MRAs, e.g.:\n\n  \n  It seems that r/mensrights has come here for a downvote brigade.\n\n\nWe also see discussions on MRA and feminism relationship in the MRA topic, with participation from both sides, e.g.:\n\n\n  \n  I hold the belief that if MRA and Feminists were to collaborate, it could be a highly effective path towards achieving equality.\n\n\nOverall, while certain Mainstream Feminist users oppose MRA on account of the toxic subgroups associated with the movement, there are others who advocate for strengthening the relationship between feminism and MRA as a means of advancing gender equality.\n\n\nAligning with feminist history <cit.>, the posts in the abortion topic are supportive of abortion rights.\nIn addition, the topic of fetuses in relation to abortion often involves ethical, moral, and legal debates, and the prevailing sentiment in these discussions tends to support the idea of abortion being permissible until a certain point in the pregnancy, e.g.:\n\n  \n  Once a fetus is considered a person, its right to live takes precedence over a woman's right to make choices regarding her own body, but prior to that, I have no objections.\n\n\n\n\nGender-Critical Feminism.\nSimilar to Mainstream Feminism, GCF mostly talks about US presidential election in the elections topic, with focusing on Democratic candidates.\n\n\nIn the bathroom access topic, GCF mostly talks about sharing the bathroom with transgender people and men.\nWe see many posts criticizing the idea of separating restrooms as “men's” and “others.”\nWhile there are some posts that approach the issue of bathroom access for transgender individuals with a sense of fairness and common sense, there are also posts that display transphobia on this matter, e.g.:\n\n\n  \n  Opposite sex in women's bathroom/locker is not acceptable. Regardless of how much they “pass”.\n\n\n\nFor trans-athletes, we see posts about the advantages trans-athletes might have in women's sports, with more leaning towards trans-exclusion compared to bathroom access, e.g.:\n\n\n  \n  The solution is not to allow them to participate in sports, rather they can seek employment in a different field.\n\n\n\nIn the clothing topic, we see many posts on gender-oriented discussions.\nEven though we see posts with positive viewpoints on wearing clothes associated with the opposite gender, we also encounter transphobic ones, e.g.:\n\n  \n  No one is really transgender. A man in a dress and wig is still not a woman. Men are not women.\n\n\nGCF mostly talks about bisexuality in the sexual orientation topic, where many posts have users identify themselves as bisexual.\nIn the leftism and sex work topics, we see support for leftism and opposition to sex work, as it aligns with the radical feminist perspective <cit.>.\n\nWe also find discussions related to autogynephilia, a controversial term used for defining male's tendency to sexually arouse by thinking of themselves as woman <cit.>.\nWe see many posts related to intersex individuals in the karyotype (an individual’s complete set of chromosomes <cit.>) topic.\nHowever, we again encounter many posts that approach the karyotypes in a transphobic manner, e.g.:\n\n  \n  Only those who were born with ambiguous genitalia and were misdiagnosed by physicians should be valued as trans women.\n\n\nAs yet another topic of discussion related to the potential challenges faced by transgender individuals, we find discussions related to gender dysphoria (a condition where individuals experience significant distress or discomfort due to a mismatch between their gender identity and the sex they were assigned at birth, or the physical characteristics associated with that sex <cit.>) in the respective topic.\n\n\nFemale Dating Strategy.\nTrue to their name, FDS's most popular topics are primarily oriented around dating and relationships.\n\nIn the dating apps, valentines day, jewelry, orgasm, blocking/unblocking, restaurants, and (red/green) flags topics, FDS share their romantic and sexual experiences.\nMany of the posts in these topics have leaning to categorize the partners based on their ability to provide, e.g.:  \n\n  \n  Gift giving in a romantic relationship signals feelings. A thoughtful gift is a green flag, a mediocre effort is yellow, and low effort is a red flag. \n\nWe see lots of acronym use, e.g., hvm for high-value males and lvx for low-value ex (partner) in posts, which can be a sign of a toxic culture of FDS.\nIn the housework topic, FDS mostly talk about not doing housework for their partners or letting their partners do the housework, e.g.:\n\n  \n  He is a LVM. He has driven his girlfriends away by expecting them to clean up after him, and his living space is always dirty.\n\n\nAs another indicator of FDS's toxicity, several posts stereotype ethnicities in the ethnicity topic, e.g.:\n\n  \n  It is harder for white men to be HV, compared to other races.\n\n\nIn the pets topic, many posts evaluate the partners of FDS users based on their approaches to pets/animals, e.g.:\n\n  \n  The way he treats cats worse compared to dogs indicates that he’s a misogynist.\n\n\n\n\n  \n\n  \n\n\nFemcels.\n\nWe find that the posts in  femcels/incels topic are centered around being a femcel, and opposed to incels, e.g.:\n\n  \n  Try to imagine valuing the opinions of incels.\n\n\nIn general, Femcels talk about their appearance more negatively than the other communities.\nIn the hair color and college topics, Femcels mostly share their experiences and give/seek advice.\nAdditionally, we observe that in the college topic, Femcels share their negative experiences, often attributing them to their appearance, e.g.:\n\n  \n  Even my sorority sisters wouldn't let me in on their group photos because of my look.\n\nThis can be related to the bullying and social rejection femcels typically face during their school and work lives <cit.>.\n\nWe also observe the impact of negative experiences faced by femcel users due to their appearance in various other topics, with many posts in the attractiveness, lookism, and loneliness topics in this direction, e.g.:\n\n  \n  I'm currently content with being a femcel, and I plan to use this time to work on improving my appearance to better align with societal norms.  \n\n\nFemcels use Stacy to define attractive women and Becky as women who can charm a partner even though she is not as attractive as Stacies <cit.>.\nMany posts in Stacies-Beckies are about defining “them”, e.g.:\n\n  \n  Stacies are very attractive (8-10 over 10), Beckies are 5-7, and the rest might be marked as femcels.\n\n\nSimilar to FDS, we find many posts stereotyping ethnicities instead of defining individuals, e.g.:\n\n  \n  Honestly, you're worse than blacks.\n\n\nFemcels converted an incel term, foid (deragotory term to indicate women are sub-human <cit.>), to “moid” to use it as the same meaning for men <cit.>.\nPosts in this topic are usually about complaints from “moids.”\n\nRed Pill Women.\nWe see discussions regarding TRP and being a RPW in The Red Pill and Red Pill Women topics.\nIn general, RPW users admire TRP, although many posts emphasize the differences between TRP and RPW, e.g.:\n\n  \n  We follow TRP ideology and use its theories and concepts to help achieve the goals related to women that are part of the red pill movement.\n\n\nWe see RPW sharing their experiences and giving each other advice in the emotions and relationships topics, with posts mentioning the term “plate,” a term used by TRP to define “using women only for sex” <cit.>, e.g.:\n\n  \n  Don't settle for being a plate to get commitment in hopes of obtaining commitment from someone, but it's not impossible for that commitment to happen either. \n \nIn the submissiveness topic, RPW discuss about being submissive, where they refer to their partners as “captains,” e.g.:\n\n  \n  I'm owned. My Captain has the authority to establish my position in the way that he decides, and I have given my consent to all of them with pleasure.\n\n\nIn contrast to GCF, RPW tends to focus primarily on femininity in their discussions regarding clothing.\nAlthough the cooking topic is primarily focused on sharing cooking recipes, a considerable number of posts emphasize that the authors are preparing meals for their husbands, partners, or “captains.”\nWe see posts in the engagement topic are discussions related to engagements/marriages.\nWe also find RPW classify males into alphas and betas, similar to the Manosphere <cit.>, while RPW talk about their education and give/seek advice in the respective topic, where we also see many posts related to the education degrees of the husbands/partners of RPW.\n\nWGTOW.\nPosts in the topics of WGTOW are mostly related to living a single lifestyle.\nIn the financial independence, renting, and financing topics, posts are mostly about being a WGTOW, emphasizing their struggles, e.g.:\n\n  \n  She advises me to be financially independent before considering marriage. She tried to be a good girl, but it did not work for her.\n\n\nIn the MGTOW/WGTOW topic, discussion is mainly about opposing MGTOW, and about being a WGTOW, e.g.:\n\n  \n  MGTOW have negative feelings towards women, while WGTOW have positive feelings towards women.\n\n\nIn the moderation topic, posts are generally about subreddit/user bans and discussions about subreddit mods, with posts about adopting a child as a part of the WGTOW lifestyle in the adoption topic.\n\nIn the evolution topic, discussions include justifying sexual instincts for the WGTOW lifestyle, e.g.:\n\n  \n  It's simply instinct to reproduce. Nobody likes to recognize that animal instincts have influence over them, so they make up ludicrous explanations to justify their basic desires.\n\n\nFinally, WGTOW users seem to share their experiences and thoughts with friendship, family, and plants topics.\n\n\n\n\nDocument Similarities.\nWe compare the general leaning of posts of each community by looking at the pairwise cosine similarities between the centroids of the Doc2Vec vectors of their posts (See Figure <ref>).\nGCF posts are most similar to Mainstream Feminism, while WGTOW ones are more than twice as similar to GCF compared to Mainstream Feminism.\n\nWe also find Femcels are most similar to FDS (cosine similarity: 0.54) and WGTOW (cosine similarity: 0.53) communities, whereas, FDS posts are most similar to Femcels. \nSimilar to Figure <ref>, we find low similarity between RPW and other Manosphere Analog communities.\n\nTakeaways.\nMainstream Feminism is arguably more focused on problems related to the patriarchy and toxic masculinity, while GCF also concentrates on issues related to transgender people, with some of them clearly crossing the threshold into transphobia.\nAligning with their user-base similarities (see Section <ref>), we find FDS, Femcels, and WGTOW are more similar to each other than RPW.\n\nAdditionally, while Femcels and WGTOW express opposition to their respective Manosphere counterparts, RPW expresses support for their analogs. \nThis is also evident in their posts, where RPW users express more admiration for the opposite sex, often due to traditional family roles, compared to the other Manosphere Analogs.\n\n\n\n\n\n\n\n\n§ TOXICITY ANALYSIS\n\n\n\nSince six subreddits from GCF and Femcels were banned due to hateful content, we set out to compare the differences in toxicity levels across the communities.\nRibeiro et al. <cit.> show that a Manosphere community, r/Incels, does not significantly increase their toxicity level after migrating to incels.co.\nWe also measure the differences in toxicity levels of GCF and Femcels before and after their migrations to their own platforms, namely, ovarit.com and thepinkpill.co.\nThese platforms have a similar structure to Reddit and refer to their “subreddits” as channels.\n\n\n\novarit.com.\nWe collect 658,962 posts between July 2020 and February 2022 using a custom crawler.\nTable <ref> reports the top 20 most popular channels of ovarit.com.\nGenderCritical is the most popular channel with 287,780 posts, which accounts for 43.6% of all posts of ovarit.com.\nWe also see many Radical Feminist/Gender-Critical Feminist (e.g., ItsAFetish) Reddit communities on this platform.\n\nthepinkpill.co.\nWe collect submissions (and their comments) between February 2021, the month this platform was founded, and February 2022.\nOverall, we gather 26,778 posts (submissions + comments) from 128 channels.\nAs reported in Table <ref>, TruFemcels is the most popular channel with 8,380 posts, which makes up 31.2% of all posts.\nWe also find other femcel subreddits (Vindicta, AskTrueFemcels, and PinkpillFeminism), and FemaleDatingStrategy among the top 20 channels.\nWGTOW and TheGlowUp are also on this platform, as the 23rd and 30th most popular channels, respectively.\nThis makes thepinkpill.co is not just a hub for Femcels, but also for the other Manosophere Analogs, except for RPW.\n\n  \n\n\n  \n\n\n\n\n\n\n\n\nMeasuring Toxicity Levels.\nWe use Google's Perspective API <cit.>, which relies on several machine learning models to measure abusive content prpoviding scores from 0 to 1, trained on millions of comments using multiple Internet sources <cit.>. \nEven though it is a widely used tool in the research community <cit.>, Perspective is not without limitations, with drawbacks including biases and the tendency to mislabel conversational patterns it has not been encountered during its training <cit.>.\n\nIn our analysis, we opt for the  model; we also use the  model, which measures negative or hateful content targeting someone because of their identity (see <cit.>).   \n\nFollowing Hoseini et al. <cit.>, we consider scores ≥ 0.8 as a high score.\nSince Ribeiro et al. did not measure the  scores of r/Incels and the platform they migrated (incels.co), we also measure their  scores, finding a slight increase (0.06% to 0.09%) after deplatforming.\nA 2-sample KS Test shows that the difference in distributions are statistically significant for each pair for each Perspective API model for each platform (p < 0.05 for all pairs, all p are adjusted for multiple testing using Benjamini-Hochberg method <cit.>).\n\n\n\n\nReddit.\nFigure <ref> plots the cumulative distributions of  and  scores of each community.\nFor both models, GCF tends to have higher scores than the other communities.\nWe find 12.6% of the posts of GCF have ≥ 0.5   score, followed by FDS (11%≥ 0.5) and Femcels (10.7%≥ 0.5).\nHowever, we find Femcels have the highest percentage of high  scores with 1.71% rate (GCF is second with 1.55% and WGTOW is third with 1.51%).\nFor , GCF has higher scores for both posts with ≥ 0.5 (24.2%) and ≥ 0.8 (4.63%).\nGCF is followed by WGTOW and Mainstream Feminism for scores ≥ 0.5 (14.6% and 14.1%), and Femcels and WGTOW for scores ≥ 0.8 (2.05% and 2.04%).\nWe also find RPW has the least tendency to post with high  and  scores compared to the other communities.\n\novarit.com.\nWe compare the  and  score distributions of the GenderCritical channel, the entire ovarit.com, subreddits of GCF, and r/GenderCritical – see Figure <ref>.\nWe find Reddit's GCF has a higher proportion of  scores for both ≥ 0.5 (12.6%) and ≥ 0.8 (1.55%).\nAlthough r/GenderCritical, the entire ovarit.com and its GenderCritical channel have relatively similar proportions for scores ≥ 0.5 (11.82%, 11.63%, and 11.83%) and ≥ 0.8 (1.32%, 1.28% and 1.22%).\nHowever, for  scores, ovarit.com and its GenderCritical have slightly more proportion of posts for scores ≥ 0.5 (25.65% and 25.60%) than Reddit's GCF and r/GenderCritical (24.25% and 24.21%).\nEven though ovarit.com's GenderCritical has the highest proportion of high  scores (4.64%), we find Reddit's GCF has a similar proportion (4.63%), followed by r/GenderCritical and the entire ovarit.com (4.45% and 4.14).\n\nthepinkpill.co.\nWe find  scores of thepinkpill.co and its TruFemcels channel are higher than Reddit's Femcels community and r/Trufemcels – see Figure <ref>.\nWhile more than 20% of the thepinkpill.co and TruFemcels have scores ≥ 0.5 (20.8% and 20.3%), this is 13.1% for r/Trufemcels, and 10.7% for Reddit's Femcels.\nFor high , thepinkpill.co and TruFemcels have a 3.3% and 3.2% ratio, while we find 2.1% for r/Trufemcels and 1.7% for Reddit's Femcels.\nOur findings show similar results to <cit.>, where another gender-based ideological community, Femcels, does not decrease its toxicity levels after their migration due to deplatforming. \nWe find thepinkpill.co has the highest proportion of  scores ≥ 0.5 with 22.7%, followed by TruFemcels (20.3%), r/Trufemcels (12.9%), and Reddit's Femcels (11.7%).\nThe exact order preserves for high  scores with 3.7%, 3.4%, 2.2%, 2.0% respectively.\n\nWhich identities do GCF and Femcels attack?\nGiven that the GCF and Femcels subreddits were banned from Reddit for engaging in hate speech and have the highest proportions of high  scores, we conduct an analysis to examine the entities targeted by these communities.\nAdditionally, we explore the entities targeted in ovarit.com and thepinkpill.co to gain insight into differences in their targeting behaviors following their deplatforming.\n\n\n\n\nNamed Entity Recognition.\nNext, we extract named entities using the en_core_web_lg model of the SpaCy library <cit.>, which has been trained on datasets like WordNet <cit.> and Common Crawl <cit.>.\nen_core_web_lg is a widely used tool in the research community <cit.>.\n\n\nTo gain a clearer understanding of the identities targeted by these communities, we narrow our focus to (named) entities that appear in posts more than 100 times on GCF and Femcels.\nFor ovarit.com and thepinkpill.co, we adjust these thresholds to account for the lower number of posts on the platforms to which these communities migrated.\nSpecifically, we scale the thresholds by the fraction of total posts on the migration platforms compared to the total number of posts on their respective origin communities, with keeping the minimum possible threshold as 10.\n\nTable <ref> reports the top 10 entities with high  scores for GCF, ovarit.com, Femcels, and thepinkpill.co.\nConsistent with the findings in Section <ref>, our analysis reveals that GCF predominantly targets transgender identities. \nWhile the entities “lesbians,” “lesbian,” and “WLW (Women Love Women)” may appear to suggest that GCF also targets lesbians, a closer examination of the posts containing these entities indicates that they are mainly associated with the conflict between trans-exclusionary lesbians and transgender individuals <cit.>, e.g.:\n\n  \n  A lot of transgender-women harass lesbians since they do not find the male body sexually attractive.\n\nWe also encounter transphobic attitudes in GCF posts that mention  “Grindr,” a popular LGBTIQ+ dating app.\nBesides transgender identities, GCF targets “Muslims,” “Mexicans,” and “Jews,” although the appearance of “Islamophobia” and “non-Muslim” may suggest that there is a polarization among GCF related to Islam.\n\nWe encounter a similar picture for ovarit.com, where the primary target of this platform is also transgender identities.\nHowever, unlike GCF, ovarit.com also targets “Bill Burr (comedian)” and “white” entities more frequently than “Mexicans” and “non-Muslim”.\nOur manual inspection on posts that include Bill Burr suggests that GCF targets the comedian due to his statements regarding the role of white women in black oppression <cit.>, which also explains the appearance of “white” in our results – e.g.:\n\n  \n  It's clear that Bill Burr doesn't give a shit about women of color and is simply trying to create conflict between women.\n\n\nOur findings for Femcels are consistent with those presented in Section <ref>, indicating that this community primarily directs its attacks towards ethnicities/identities, as evidenced by all the entities listed in Table <ref> being associated with either ethnicities (BBC, Jewish, White, Indians) or identities (Muslims, Muslim, Islam, Islamic, LGBT).\n\nOur analysis of thepinkpill.co reveals a similar pattern of targeting towards specific groups, such as “Muslims,” “Asians,” “Christians,” “Africans,” and “westerners”.\nOur examination of both Reddit and thepinkpill.co demonstrates that Muslims are the primary target for Femcels, e.g.:\n\n  \n  Ex-Muslims are the only good Muslims.\n\n\nOverall, deplatforming does not seem to have altered the set of identities that GCF and Femcels primarily target.\n\n\n\n\nTakeaways.\nCommunities that are banned from Reddit because of their toxic behavior (Femcels and GCF) are indeed the most toxic communities of OWIS.\nWe find a decrease in the proportion of high toxicity scores for GCF after their deplatforming.\nThis is somewhat in contrast with previous work on the Manosphere showing that the toxicity levels of incels do not decrease after their migration <cit.>. \nWe also find an increase in Femcels, GCF, and incels in terms of high identity attack scores after migrating to their new platforms.\nFinally, despite deplatforming, the groups of people mainly targeted by GCF and Femcels do not seem to have changed.\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n§ DISCUSSION & CONCLUSION\n\n\nThis paper present a data-driven analysis of online women's ideological spaces (OWIS).\nWe quantitatively derived a taxonomy of OWIS consisting of 14 subreddits, and analyzed over 6M comments along several axes.\nAmong other things, we found that Gender-Critical Feminism has user-base similarities with Femcels and Women Going Their Own Way, which might seems odd, but can be explained by Gender-Critical Feminism's roots in radical feminism, which is generally more “opposed” to men than other forms of feminism.\n\n\n\n\nGender-Critical Feminism and Femcels are the most toxic communities, which is in line with the fact that they were been banned from Reddit.\n\nWhen exploring their migrations to custom-built platforms upon being banned, we observe an increase in toxicity for Femcels, but not for Gender-Critical Feminism. \nWe also see an increase in identity attacks after migration for both GCF and Femcels, which is one of the specific behaviors that they were banned from Reddit for in the first place.\nSimilar to what previous work found with alt-right communities like r/The_Donald and Gab <cit.>, deplatforming is correlated with increases in negative behavior for GCF and Femcels.\n\n\n\n\n\nAcknowledgements.\nThis material is based upon work supported by the National Science Foundation under Grant No. IIS-2046590 and CNS-1942610.\nChen Ling was supported by the Meta Research PhD Fellowship Award.\n\n\n\n\n\n\nabbrv\n\n\n"}