{"entry_id": "http://arxiv.org/abs/2303.07098v1", "published": "20230313133810", "title": "Spatially resolved observations of outflows in the radio loud AGN of UGC 8782", "authors": ["Rogemar A. Riffel", "Rogério Riffel", "Marina Bianchin", "Thaisa Storchi-Bergmann", "Gabriel Luan Souza de Oliveira", "Nadia L. Zakamska"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA"], "text": "\n\nfirstpage–lastpage\nBeyond Fish and Bicycles: Exploring the Varieties of Online Women's Ideological Spaces\n    Utkucan Balcı^1, Chen Ling^2, Emiliano De Cristofaro^3,\nMegan Squire^4, Gianluca Stringhini^2, Jeremy Blackburn^1\n\n^1Binghamton University, ^2Boston University, ^3University College London, ^4SPLC\n    \n========================================================================================================================================================================================================\n\n\n\n\n\nWe use optical Integral Field Spectroscopy (IFU) to study the gas emission structure and kinematics in the inner 3.4×4.9 kpc^2 region of the galaxy UGC 8782 (3C 293), host of a radio loud Active Galactic Nucleus (AGN). The observations were performed with the GMOS-IFU on the Gemini North telescope, resulting in a spatial resolution of ∼725 pc at the distance of the galaxy. While the stars present ordered rotation following the orientation of the large scale disc, the gas shows  a disturbed kinematics. The emission-line profiles present two kinematic components: a narrow (σ≲200 km s^-1) component associated with the gas in the disc of the galaxy and a broad (σ≳200 km s^-1) component produced by gas outflows. Emission-line  ratio diagrams indicate that the gas in the disc is excited by the AGN radiation field, while the emission of the outflow includes additional contribution of shock excitation due to the interaction of the radio jet with the environment gas. Deviations from pure rotation, of up to 30 km s^-1, are observed in the disc component and likely produced by a previous merger event. The broad component is blueshifted by  ∼150-500 km s^-1 relative to the systemic velocity of the galaxy in all locations. We construct radial profiles of the mass outflow rate and kinetic power of the ionized gas outflows, which have the maximum values at ∼1 kpc from the nucleus with peak values of Ṁ_ out,Δ R=0.5±0.1 M_⊙ yr^-1 and K̇_ out,Δ R =(6.8±1.1)×10^41 erg s^-1. The kinetic coupling efficiency of these outflows are in the range of 1–3 per cent, indicating that they could be powerful enough to affect the star formation in the host galaxy as predicted by theoretical simulations. \n\n\n\n\n\n\ngalaxies: active –  galaxies: kinematics and dynamics – galaxies: individual: UGC 8782 (3C 293).\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nFeedback from active galactic nuclei (AGN) is claimed to play a major role in shaping massive galaxies, by quenching star formation and transforming them from star-forming to quiescent galaxies    <cit.>. \nA critical ingredient in the rapid quenching of star formation in AGN hosts are multi-phase gas outflows, which can push gas out of the galaxy or redistribute it, preventing it from collapsing to form stars. However, understanding the acceleration mechanisms of such outflows remains an important unknown piece of the galaxy evolution puzzle. This question can be addressed by spatially resolved observations of tracers of the multiple gas phases of AGN driven winds <cit.>. \n\n\n\nUsing a sample composed of all galaxies in the entire spectroscopic database of the Spitzer Space Telescope, <cit.> found that AGN hosts show a significant excess of H_2 emission compared to the expected emission from star formation in normal photo-dissociation regions. In a following up work, <cit.> cross-correlated the sample of <cit.> with the SDSS-III database. One important result of this work is that the excess of H_2 emission appears to be strongly related both to emission-line and kinematic shock diagnostics, such as [O i]λ6300 flux and velocity dispersion – as shown in Figure <ref>. These results suggest that the H_2 emission excess originates from wind-driven shocks in neutral and molecular gas <cit.>. These conclusions were based on single aperture spectra. Spatially resolved observations of the neutral and ionized gas emission can provide indirect information about the role of AGN winds in the production of the H_2 emission excess in the mid-IR.  \n\nIt is very difficult to accelerate dense clouds of molecular gas up to velocities high enough to escape galaxies without them being fragmented and the molecules dissociated by the intense radiation field of the AGN. Recent theoretical models suggest that molecules may be formed inside the wind, and their emission may be produced by shock heating of the gas <cit.>.  The CO emission is commonly used as a tracer of cold molecular (T ∼ 100 K) outflows in AGN hosts  <cit.>, while the hot molecular phase (T>1000 K) can be studied via the H_2 near-infrared emission lines <cit.>. Not much is known about the warm molecular phase (T ∼ 200 – 1000 K)  traced by the H_2 emission in the the mid-infrared,  which can be studied in a spatially resolved way only now with the JWST. As such observations are very time demanding, it is essential to choose carefully the objects to be studied. \n\nHere, we present optical integral field unit (IFU) observations of the central region of the galaxy UGC 8782, which are used to map the neutral and ionized gas emission structure and kinematics. This object was selected as a likely host of strong molecular outflow, by being among the galaxies with the highest values of H_2S(3)/PAHλ11.3μm, [O i]λ6300/Hα intensity line ratios and [O i]λ6300 velocity dispersion in the sample of <cit.>. It is identified by a circle in Fig. <ref> and direct observations of the warm molecular hydrogen emission will be obtained as part of an approved cycle 1 JWST proposal (Proposal 1928, PI: Riffel, R. A.). \n\n\nUGC 8782 (3C 293) at a redshift of z = 0.045 <cit.> is a radio loud source <cit.> with nuclear activity classified as a Low-Ionization Nuclear Emission Region <cit.>. Optical images reveal complex morphology with filamentary dust lanes at hundreds of parsecs and kpc scales, likely as a result of a merger event <cit.>. This galaxy presents a double-double radio source, with 200 kpc outer lobes oriented approximately along the northwest-southeast direction and  ∼4 kpc scale inner lobes along the east-west direction <cit.>.  Outflows from the nucleus of UGC 8782  were observed in neutral hydrogen, with velocities of up to 1400 km s^-1, coming from the western radio hotspot <cit.> and in ionized gas, but with the highest velocities, of up to 1000 km s^-1, co-spatial with the eastern radio knot, at the opposite side of the neutral gas outflows <cit.>. These outflows have been interpreted by the authors as being produced by the interaction of the radio jet with the interstellar medium.  <cit.> combined multi-frequency radio data of 3C 293, obtained with the International LOw Frequency ARray (LOFAR) telescope (ILT),  Multi-Element Radio Linked Interferometer Network (MERLIN) and Very Large Array (VLA), to map the spectral index over a broad frequency range. They found that the inner radio lobes are part of a young jet-dominated radio source strongly interacting with the interstellar medium, likely driven the ionized outflows mentioned above.\nBy comparing the spectral indices of the inner radio structure to that from the structures at larger scales, the authors conclude that 3C 293 underwent at least two episodes of nuclear activity.\n\n\nThis paper is organized as follows: Section 2 presents the observations and data reduction procedure, while Section 3 describes the emission line fitting and stellar kinematics measurements. The results are presented in Section 4 and discussed in Section 5, and Section 6 summarizes our conclusions.   We adopt a redshift based distance to UGC 8782 of 200 Mpc, for which 1 arcsec corresponds to ∼970 pc at the galaxy. \n \n \n\n\n \n\n§ OBSERVATIONS AND DATA REDUCTION\n\n \n UGC 8782 was observed on February 23, 2022 with the Gemini-North Multi Object Spectrograph <cit.> operating in the Integral Field Unit <cit.> mode, under the program code GN-2022A-Q-310 (PI: Riffel, R. A.). We used B600-G5323 grating and the one slit mode of the GMOS-IFU, which provides a field of view of 35×50. The observations of UGC 8782 were split into six exposures of 1200 sec, half centred at 6250Å and half at 5950Å, in order to account for the detector gaps. \n \n The data reduction was performed with the gemini.gmos package with the iraf software following the standard procedures for spectroscopic data, which includes the subtraction of the bias level, trimming and flat-field correction, background subtraction for each science data, quantum efficiency correction, sky subtraction and wavelength calibration. The lacos  algorithm <cit.> was used for cosmic rays removal and finally we performed the flux calibration, using observations of the standard star Feige 66 to construct the sensitivity function. The final data cubes for each individual exposure have an angular sampling of 01×01. \n \n The final data cube for  UGC 8782 was obtained by median combining the individual exposure data cubes using the peak of the continuum as reference for astrometry corrections among individual cubes. The final datacube covers the spectral region from 4650 to 7500 Å, which includes the most prominent optical emission lines seen in AGN spectra, from Hβ to [S ii]λ6731Å. The velocity resolution is ≈80  km s^-1 as estimated from the full width at half maximum (FWHM) of typical emission lines in the CuAr spectra used in the wavelength calibration and the angular resolution is ∼075 as estimated from the FWHM field stars in the UGC 8782 acquisition image, corresponding to the ∼725 pc at the distance of the galaxy.\n \n \n \n\n \n\n§ MEASUREMENTS\n\n \n\n\n §.§ Stellar Kinematics\n\n\nWe use the Penalized Pixel-Fitting (ppxf) method <cit.> to fit and subtract the stellar component from the observed spectra.   The code finds the best fit of the observed spectra by convolving template spectra with the Line of Sight Velocity Distribution (LOSVD) assumed to be reproduced by Gauss-Hermite series. We fit the whole spectral region, masking out regions of strong emission lines and use as spectral templates those from the MILES-HC library <cit.>, which has a similar spectral resolution of our GMOS data. We allow ppxf to include multiplicative fifth order polynomials to further adjust the continuum shape of the template to the observed spectra.  In addition, we use the clean parameter of ppxf to use the iterative sigma clipping method described in <cit.> to reject spectral pixels that deviates more than 3σ from the best fit, in order to exclude from the fit unmasked bad pixels, due to remaining sky lines and spurious features.\n\nThe output from the ppxf code includes measurements of the radial velocity (V_*) and stellar velocity dispersion (σ_*)  at each spaxel, which are used to construct two-dimensional maps presented in Fig.  <ref>.  In addition, we subtract the best fit model at each spaxel from the observed spectra in order to produce a data cube free of the stellar population component, which is used to measure the emission-line properties.\n\n\n\n §.§ Emission-line Fitting\n\n \n \n We use the ifscube package <cit.> to fit the observed emission-line  profiles  by Gaussian curves.  The fit is performed after the subtraction of the stellar component contribution from the observed spectra, and we allow the code to include two Gaussian curves (a narrow and a broad component) per emission line, as indicated by visual inspection of the spectra. \n We use the cubefit routine from the ifscube package and fit the following emission lines simultaneously: Hβ, [O iii] λλ4959,5007, [O i] λ6300, [N ii] λλ6548,6583, Hα and   [S ii] λλ6717,6731. Initial guesses of the Gaussian amplitude, centroid velocity, and velocity dispersion are provided to the code based on measurements of the nuclear spectrum using the splot iraf task, which are used to fit the nuclear spectrum. After a successful fit of the nuclear emission line profiles, the routine fits the surrounding spaxels following a radial spiral loop, using as initial guesses the best fit parameters obtained from successful fits of spaxels at distances smaller than 03 from the fitted spaxel, as defined by using the refit parameter. If the amplitude of one of the fitted Gaussians is smaller than three times the standard deviation of the nearby continuum, only one component is used. To account for possible remaining continuum emission, we also include 4th order polynomial, which is used to fit the continuum before the fitting of the emission lines. \n \n\n\n\nDuring the fit, we tied the velocity and velocity dispersion (σ) of emission lines produced from the same species (Hβ and Hα; [O iii] λ5007 and [O iii] λ4959; [N ii]λ6548 and [N ii]λ6583; [S ii]λ6717 and [S ii]λ6731) for each kinematic component. We also fixed the [O iii] λ5007/[O iii]λ4959 and [N ii]λ6583/[N ii]λ6548 intensity line ratios of each component to their theoretical values of 2.98 and 3.06, <cit.>, respectively. \n\n \n \n \n\n§ RESULTS\n\n \n \n\n §.§ Spatially Resolved Observations\n\n\n\nIn Fig. <ref> we present a large scale giy image of UGC 8782 (left panel) from Pan-STARRS data archive <cit.>, along with a continuum (middle panel) and a [N ii]+Hα narrow band (right panel) image obtained from the GMOS data cube.  The GMOS continuum image is obtained by computing the mean flux in a 100 Å window centred at 6100 Å. The blue dashed line shows the orientation of the galaxy's major axis <cit.>. The continuum distribution is elongated along the northeast–southwest direction, has a smaller PA (∼35^∘ East of North) than for  the large-scale disk, with a secondary extended structure observed to the west of the nucleus at ∼13. The [N ii]+Hα narrow band image is obtained by integrating the fluxes within a spectral window from 6500 to 6640 Å– including these lines – using the cube with the contribution of the stellar population component subtracted. Extended gas emission is observed along the major axis of the galaxy, with a similar distribution as observed in the continuum. However, the strongest emission is observed at a structure located at 13 west from the nucleus. \n\nFig. <ref> presents results for the stellar and gas kinematics and emission distributions. The stellar velocity field presents a velocity gradient consistent with the orientation of the major axis of the large scale disc of PA=50^∘ <cit.> with blueshifts seen to the southwest and redshifts to the northeast of the nucleus. The stellar velocity dispersion map presents  values in the range from 100 to 270 km s^-1 with a mean value of 205km s^-1 and standard deviation of 65 km s^-1. Thus, the observed stellar kinematics in UGC 8782 is consistent with the behaviour expected for a rotation disc with similar orientation of the large scale disc of the galaxy.\n\nThe emission-line flux distributions for the narrow component are elongated along the local stellar disk, following a similar orientation of that of the major axis of the continuum image, for all emission lines, as can be seen in the first column of Fig. <ref>. The corresponding velocity fields also present a similar velocity behaviour of that in the stellar velocity field, with blueshifts to the southwest and redshifts to the northeast. The gas velocity dispersion maps for the narrow component for all emission lines present values smaller than those observed for the stars, with values lower than 150 km s^-1 at most locations. The kinematics and emission structure of the narrow component is consistent with emission of gas in a rotating disc, similarly to that observed for the stars. The sightly larger velocity amplitude and smaller velocity dispersion values observed for the gas as compared to those of the stars can be explained by projection effects if the gas is located in a thin disc and the stars in a thicker distribution. \n \n\n\nThe broad component emission is extended mostly to the west of the nucleus for all emission lines. The emission peaks at ∼1 arcsec west of the nucleus are close to the border of a radio knot observed at 07 west. The centroid velocity of the broad component is blueshifted by about 200 km s^-1 and the σ maps present values of up to 400 km s^-1. The green contours overlaid to the Hα flux distribution and σ map for the broad component are from the 1360 MHz radio image obtained with the MERLIN array and presented by <cit.>. The highest fluxes for the broad components are observed co-spatially with the radio structure to the west and the highest velocity dispersion values are seen surrounding the western radio lobe, suggesting that the emission of the broad component is associated to the interaction of the radio jet with the ambient gas.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollowing <cit.>, we estimate the visual extinction (A_V) using the Hα/Hβ intensity line ratio, by\n\n    A_V = 7.22 log[(F_Hα/F_Hβ)_ obs/2.86],\n\nwhere (F_Hα/F_Hβ)_ obs is the observed  Hα/Hβ flux ratio, adopting the <cit.> extinction law and an intrinsic flux ratio of F_Hα/F_Hβ=2.86 for  H i case B recombination for an electron temperature of T_e = 10 000 K and electron density of N_e = 100 ^-3 <cit.>. The resulting maps for the narrow and broad line components are shown, respectively, in the top and bottom panels of Fig. <ref>.  The A_ V map for the narrow component shows values in the range from 0 to 3.5 mag, with the highest ones seen at the northwest side of the galaxy, co-spatial with the dust structure seen in the large scale image of Fig. <ref>. The mean value is ⟨ A_V⟩=2.7±0.1 mag. \nThe broad component in the Hβ emission line is detected only in a few spaxels and thus its resulting A_V map shows a limited spatial coverage.  The mean value for the broad component is ⟨ A_V⟩=1.7±0.4 mag.\n\n\nThe central panels of Fig. <ref> show the [S ii]λ6717/[S ii]λ6731 flux ratio maps for UGC 8782 for the narrow (top) and broad (bottom) components. For the narrow component, the lowest values of ∼ 0.9 are seen to the southwest of the nucleus, while the highest values of up to 1.6 are observed mostly to the northwest and north of the nucleus.  For the broad component, the lowest values of ∼ 0.9 are seen to the west of the nucleus, close to the tip of the radio jet, while higher values of up to 2.6 are seen to the south. The [S ii]λ6717/[S ii]λ6731 ratio can be used to estimate the electron density (N_e) for intensity line ratios in the range of ∼0.5–1.4 <cit.>. Higher  values of [S ii]λ6717/[S ii]λ6731 are produced in lower density gas, while lower ratios are associated to higher density clouds. \n\nTo estimate the electron density of the emitting gas for both kinematic components, we used the PyNeb python package <cit.> and assume an electron temperature of 1.5×10^4 K, a typical value observed in Seyfert nuclei <cit.>. The resulting N_e maps are shown in the right panels of Fig. <ref>. The map for the narrow component presents the highest values (>1700  cm^-3)  to the southwest of the nucleus and the lowest values (<200  cm^-3) to the northeast, and a mean value of ⟨ N_e⟩=607±27 cm^-3. Most locations with detection of the broad component in the [S ii] doublet present ratios larger than 1.4, where the relation between the line ratio and N_e becomes flat <cit.>. These regions correspond to very low densities (≲50  cm^-3). The highest densities (∼1600  cm^-3) are found close to the edge of the radio jet to the west of the nucleus and the mean value is ⟨ N_e⟩=740±72 cm^-3.\n\n\nEmission-line ratio diagrams can be used to identify the dominant gas ionization source in a galaxy. In the optical, the BPT <cit.> and WHAN <cit.> diagrams are commonly used for this purpose. In the top panels of Fig. <ref> we present the spatially resolved [O iii]λ5007/Hβ vs.  [N ii]λ6583/Hα BPT diagram using the fluxes of the narrow line component, as well as a colour coded excitation map (right). The gray regions in the excitation map correspond to locations where at least one line is not detected above the 3-σ threshold. Most spaxels with detected emission in all four lines show ratios in the regions occupied by Low-Ionization Nuclear Emission Regions (LINERs) and transition objects (TOs). The blue triangle shown in the BPT diagram corresponds to the nucleus, as obtained using the line fluxes computed within a circular aperture of 05 radius.  \nThe broad component of [O iii]λ5007 and Hβ is detected only in a few spaxels around the position of its emission peak (10 west of the nucleus) and thus we do not present its BPT diagram, but we compute the integrated fluxes within a 05 radius aperture centred at 10 west of the nucleus.  The ratios for the narrow and broad component integrated within this aperture are shown as a black square and a black star, respectively. \n\nThe WHAN diagrams for the narrow and broad components, are shown in the middle and bottom panels of Fig. <ref>, along with their corresponding excitation maps. The WHAN diagram is particularly useful to separate emission of gas ionized by an AGN – which results in Hα equivalent widths, EW_Hα>3Å – from those that can be attributed to  hot low-mass evolved stars (HOLMES) with EW_Hα<3Å  <cit.>.  The WHAN diagrams for  UGC 8782 show that most points are located in the regions occupied by AGNs, and emission of gas excited by HOLMES can be neglected.\n\n\n\nUGC 8782 presents [O i]λ6300 extended emission over most of the GMOS field of view (FoV). This emission line can be used as a tracer of shocks in neutral gas <cit.>. In Fig. <ref> we present plots of the [O i] velocity dispersion (σ_OI) versus the [O i]λ6300/Hα flux line ratio using measurements for the narrow (left panel) and broad (right panel) components. The narrow component presents 100  km s^-1≲σ_OI≲130  km s^-1 and  -1.0≲ log([O i]/Hα≲-0.3, while for the broad component the ranges of values are 290  km s^-1≲σ_OI≲330  km s^-1 and  -0.7≲ log([O i]/ Hα≲0.0.  The black points correspond to mean values computed within bins of 0.05 dex in  log [O i]λ6300/Hα, and the error bars represent the standard deviation of the velocity dispersion within each bin. \n\n\n \n\n §.§ Integrated spectra at selected positions\n\n\nPrevious observations of UGC 8782 revealed broad emission line components associated to the eastern radio jet, with higher velocities and much fainter emission, as compared to the broad components seen to the west of the nucleus <cit.>. These authors interpreted this result as the broad components originating from a bipolar outflow, driven by the radio jet. As shown in the previous section, we do not detect this eastern broad component above 3-σ noise level in individual spaxels, but there is some extended emission to the north of the nucleus as observed for Hα and [N ii]λ6583 emission lines (Fig. <ref>). In order to investigate the origin of the broad component, we have extracted individual spectra within circular apertures of 04 radius (comparable to the seeing of the observations) centred at four positions: A) the nucleus; B) the location of the western radio hotspot (Δα=-11; Δδ=01);  C) the location of the eastern radio hotspot (Δα=09; Δδ=00); D) 10 north of the nucleus and E) 10 south of the nucleus. The resulting spectra are shown as black dashed lines in Fig. <ref> and reveal the presence of broad line components in all locations, not only along the radio jet. We followed the same procedure described above and fitted each emission line by two Gaussian curves using the ifscube package, keeping the kinematics (velocity and σ) of the narrow and broad components tied, separately. The resulting models are shown in red in Fig. <ref> and the individual components are shown as green dotted and blue dashed-dotted lines, respectively. \n\nAs in <cit.> – who used optical integral-field spectrograph (OASIS) observations of UGC 8782  with the William Herschel Telescope (WHT) – we also find that the broad component emission in the western radio hotspot position is about one order of magnitude brighter than that in the eastern hotspot region. In addition, our GMOS data reveals broad component emission in regions perpendicular to the radio jet, as seen in the spectra extracted in regions to the north and to the south of the nucleus in Fig. <ref>. The broad component emission in these regions is stronger than those in the eastern radio hotspot location by a factor of 2, for example, when Hα line is considered. The broad component is blueshifted in all locations with velocities of  -450±48 km s^-1 for the nucleus, -200±57 km s^-1 (for the eastern hotspot), -175±30 km s^-1 (western hotspot),   -140±38 km s^-1 (10 south) and  -365±40 km s^-1 (10 north). The widths of the broad component are in the range 380-560 km s^-1, with the lowest value observed at the south of the nucleus and the highest at the eastern radio hotspot.\n\nIn addition, in Fig. <ref> we present the W_ 80 map for the Hα emission line. This parameter corresponds to the width of the line profile containing 80 per cent of its total flux and can be used to identify gas outflows which typically present W_ 80>500 km s^-1 observed in the [O iii]λ5007 emission line <cit.>. The W_ 80 map for UGC 8782 presents values larger than this threshold at several location surrounding the nucleus, with the highest values of up to 900 km s^-1 seen to the west of the nucleus along the radio jet. \n\n\n\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n \n<cit.> used optical integral field spectroscopy, obtained with the OASIS-IFU on the 4.2 meters William Hershel Telescope,  to study the gas kinematics in the inner 12×9 arcsec^2 of UGC 8782. Their observations covered the [N ii]+Hα and the [S ii] doublet emission lines with angular sampling ranging from 03×03 in the central regions to 36×27 in the outer regions. They detected a blueshifted broad component within the inner ≈ 2 arcsec along the east-west direction spanning the region between the inner radio lobes, slightly extended to the north of the nucleus. In addition, these authors analyse long-slit spectra along the positions angles 225^∘ and 93^∘, previously published by <cit.>, which show that the broad component is detected to distances of up to 5 kpc from the nucleus to both sides, along the radio jet.  Although <cit.> do not present emission-line flux maps, they mention in their work that the broad component presents much higher peak fluxes in regions to the west of the nucleus, as compared to regions to the east of it.  These authors interpret the broad component as being due to fast outflows driven by the radio jet, in an orientation such that the eastern side is approaching and the western side is receding. The \n eastern radio jet intercepts the disc, pushing the gas out and the radio jet creates a cocoon that disturbs the gas in all directions <cit.>.\n \n\n Here, we use higher quality  IFU data to further investigate the gas emission structure and kinematics. As in previous works, our GMOS data clearly reveal the presence of a narrow and a broad component, associated to gas emission from the disc and from the outflow. In the following, we will characterize both emission structures. \n\n\n\n\n §.§ Origin of the gas emission\n\n\nThe nuclear emission of UGC 8782 was previously classified as a LINER based on optical line ratios, and interpreted as being produced by shock excitation <cit.>. Our IFU data allow us to further investigate the origin of the gas emission, in a spatially resolved manner. The BPT diagram (Fig. <ref>) shows line ratios mostly in the region occupied by LINERs and transition objects, with the nuclear emission being consistent with a LINER-type ionization. At the location of the western radio hotspot, the line ratios for the narrow component are also consistent with a LINER-type ionization and for the broad component the observed line ratios are close to the borderline separating Seyferts and LINERs in the WHAN diagram, as defined in <cit.>.  These results are consistent with the classification of UGC 8782 as a host of an AGN, based on the plot of the PAH 6.2 μ m equivalent width (EW_ PAH 6.2 μ m) versus the H_2 S(3)/PAH 11.3 μ m intensity line ratio using Spitzer data <cit.>. \n\n\nAlthough the BPT and WHAN diagnostic diagrams are useful to separate photoionized gas by star forming regions, AGN and HOLMES, they are not sensitive to possible contributions from shocks <cit.>. The [O i]λ6300/Hα intensity line ratio is a well known tracer of shocks <cit.>. Shocks may be the dominant excitation mechanism of the [O i] emission if its velocity dispersion is larger than ∼150 km s^-1 and log [O i]λ6300/Hα≳ -1.0 <cit.>. The plots of σ_ OI  versus  log [O i]λ6300/Hα shown in Fig. <ref> reveal that, although log [O i]λ6300/Hα > -1.0 for the disc component, the velocity dispersion is low (100–130 kms^-1), suggesting that photoionization may be the be main mechanism in action. However, shocks with these velocities may also be able to excite the gas <cit.>. Indeed, an additional contribution of shocks cannot be discarded as a weak correlation (Pearson correlation coefficient R_P=0.14) is observed between [O i]λ6300/Hα and σ_ OI for the narrow component. The highest values of both parameters are observed in regions along the disc, outside the AGN ionization cone. This result is consistent with the detection of shock ionization by AGN winds in regions outside the AGN ionization structure, where shocked gas emission can be easily observed <cit.>, and with the detection of a broad component in the integrated spectra shown in  Fig. <ref>.  On the other hand, the broad outflow component shows much higher [O i]λ6300/Hα and σ_ OI and there is a stronger correlation between these two parameters (R_P=0.44), which suggests that shock excitation is important in the production of emission of the outflowing gas. \n\nThus, the main excitation mechanism of the gas in the disc may be photoionization by the central AGN of UGC 8782 as indicated by the observed emission line ratios and kinematics, with an additional contribution of shocks. On the other hand, the enhanced gas emission associated to radio hotspots, the observed intensity line ratios and the correlation between [O i]λ6300/Hα and σ_ OI indicate that shocks play an important role in the excitation of the gas in the outflow. \n\n\n\n\n\n §.§ The disc component\n\n\n\n\n\n\nThe gas velocity field for the disc component (Fig. <ref>) shows a clear rotation pattern for all emission lines, with the line of nodes oriented approximately along the orientation of the major axis of the galaxy's large scale disc <cit.>. This behaviour is similar to that observed for the stars (Fig. <ref>) and in cold molecular gas, traced by the CO emission <cit.>. However, deviation from pure rotation is also observed in the ionized gas, as a discontinuity in velocities seen at ∼1 arcsec northeast of the nucleus. In order to better constrain the gas kinematics, we use the kinemetry method <cit.> to model the gas velocity field from the Hα narrow component. This method is a generalization of the surface photometry technique and can be used to model the observed velocity field by a set of ellipses under the assumption that the velocity profile along each ellipse satisfies a cosine law, using the Fourier expansion technique <cit.>.  \n\n\nFig. <ref> shows, in the top panels, the observed Hα velocity field for the disc (narrow) component (left panel), the resulting best-fit model obtained by the kinemetry method (central  panel) and the residual map obtained by subtracting the model from the observed velocities (right-panel). The bottom-left panel shows the radial variation of the kinematic position angle (PA) of the major axis of the fitted ellipses (in black) and the photometric PA (in red) obtained by modeling the continuum image (Fig. <ref>) using the photutils package <cit.>. The bottom-central  and bottom-right panels show the harmonic coefficients k_1 and k_5/k_1, respectively. The k_1 term describes the velocity amplitude of bulk gas motions, while the  k_5/k_1 term quantifies higher-order deviations from pure rotation <cit.>.\n\nThe photometric and kinematic PA of the major axis of the ellipses approximately follow each other, with the highest offset of less than 10^∘ observed at ∼07 and at 15 from the nucleus. These discrepancies are observed at the same distances of a redshifted structure north of the nucleus and an excess of blueshifts to the north-west of it, observed in the velocity field. The position angle of the major axis changes from Ψ_0=∼20^∘ close to the nucleus to Ψ_0=∼50^∘ in the outer regions, becoming similar to the values derived for the large scale disc using images in different bands <cit.> and from the analysis of the kinematics of the cold gas <cit.>. The near side of the disc corresponds to the northwestern side of the galaxy, where obscuration is higher <cit.>. A higher extinction at the northwestern side of the galaxy is also confirmed by our GMOS data in a map for the ratio between the red and blue stellar continuum, resulting in higher values to the northwestern side of the disc.\n\n\nThe rotation curve (bottom central panel in Fig. <ref>) shows increasing velocity values outward from the nucleus, reaching a maximum value of ∼130 km s^-1. The  k_5/k_1 parameter shows values close to zero in the inner ∼1 arcsec, and growing outwards, reaching a maximum value of ∼0.15. This indicates that beyond the inner arcsec, the gas kinematics shows deviations that cannot be explained by regular rotation under the galaxy's gravitational potential. The residual map (top-right panel of Fig. <ref>) shows low values (≲30 km s^-1), but with a systematic pattern, supporting an additional kinematic component.  Redshifted regions are observed approximately along the minor axis of the galaxy, while blueshifted residuals are seen mainly along the major axis of the galaxy.  The complex gas kinematics observed in the disc component of UGC 8782 is likely produced by a merger event with a gas-rich galaxy, providing a gas reservoir to feed the central SMBH as suggested by previous studies <cit.>. \n\n\n\nWe can estimate the mass of ionized gas in the disc by \n\n    M_ ion=1.4 N_ e m_ p V f,\n\nwhere m_ p is the mass of the proton, N_ e is the electron density,  V is the volume of the emitting gas,  the 1.4 factor is included to account for the contribution of He, and f is the filling factor which can be obtained from\n\n\n    L_ Hα≈4π j_ Hα V f,\n\nwhere L_ Hα is the Hα luminosity and 4π j_ Hα/N_e^2=3.558×10^-25 erg  cm^-3 s^-1 assuming the case B H ii recombination for the low-density limit and an electron temperature of 10 000 K <cit.>. Replacing f from Eq. <ref> into Eq. <ref>, we obtain\n\n    M_ ion≈ 7×L_ Hα/N_ e.\n\n\nWe calculate  L_ Hα from the Hα fluxes for the disc component in each spaxel, after correcting them for extinction using the A_ V map from Fig. <ref> and the extinction law of <cit.>. For spaxels with no A_ V estimates, we use the mean A_ V value to correct the Hα flux. Using the N_ e values for the disc component and using their mean value in spaxels with no N_ e measurements, we obtain M_ ion=(1.1±0.4)×10^7 M⊙. The mass of ionized gas in the disc is about three orders of magnitude lower than the mass of cold gas in  UGC 8782, of 2.2×10^10 M_⊙  <cit.>. \n\n\n\n\n\n\n §.§ Properties of the outflows\n\n\n\nThe geometry of the multi-phase gas outflows in UGC 8782 is an intriguing question. Outflows in neutral gas are co-spatial with the western radio hotspot <cit.>, while previous studies of the ionized gas kinematics found that the highest velocity component arises from a region co-spatial with the eastern radio hotspot <cit.>. Shock-heated gas emission is detected in X-rays at the nucleus and inner radio jet, as well as in diffuse X-ray emission to the north and to the south of the nucleus <cit.>. The cold molecular counterpart of the outflows has not yet been detected, and IRAM Plateau de Bure interferometer observations of the CO emission give an upper limit of 7.1×10^8 M_⊙ for the mass of the cold gas outflow <cit.>. The eastern side of the inner radio jet is approaching us making an angle of ∼50^∘ with the line of sight <cit.>, consistent with the orientation of the galaxy \nsuch that the northwestern side is nearer to us. The inclination of the disk is i=50±5^∘ (relative to the plane of the sky) as obtained from ellipse fitting of the continuum image and consistent with the large scale disc <cit.>.\n\n<cit.> interpreted the ionized gas outflows in UGC 8782 as being driven by the radio jet, and a cocoon structure surrounding the radio jet disturbing the gas in the central region of the galaxy. They found that the outflows are detected in blueshifts on both sides of the nucleus, with higher velocities observed to the eastern side attributed to the interaction of the approaching (eastern side) radio jet with the ambient gas. As shown in Fig. <ref>, our GMOS data reveal the presence of a blueshifted broad component not only at the position of the radio hotspots but also from regions away of the radio structure. In addition, the velocities of the outflow are similar at locations co-spatial with the eastern and western radio hotspots.  As already noticed by <cit.>, the flux of the broad component at the eastern hotspot is very low and marginally detected in their data, leading to a high uncertainty in the velocity of the outflow. Indeed, the example of line fits shown by these authors in their Fig. 3 seems to  slightly overestimate the blue wing of the [S ii] lines leading to a higher inferred velocity, as compared to the most prominent outflow component detected at the location of the western radio hotspot. \n\n\nIn agreement with previous observations, our data also support a contribution of shock excitation of the gas in the outflow, as discussed above.  The close association between the enhanced emission structures seen in ionized gas with the radio structures indicates that the shocks are produced by jet-cloud interaction. From the spectra extracted on selected locations (Fig. <ref>) we find that the outflow component is blueshifted at all positions, with the highest velocity observed for the nucleus. The outflows are seen in blueshifts at all locations surrounding the nucleus if they are produced by the cocoon created by the radio jet <cit.>, with the enhanced emission to the western side of the galaxy being produced by the interaction of the radio jet with the ambient gas of the galaxy. Enhanced emission-line widths in regions perpendicularly to the radio jet have been observed in nearby Seyfert galaxies, but with centroid velocities close to the systemic velocity of the galaxies, and interpreted as being due to jets perturbing the gas in the disc <cit.>, equatorial outflows predicted by torus wind models <cit.> or due to much wider opening angle outflows as compared to the AGN ionization cones  <cit.>. The observed blueshifted velocities at all locations around the nucleus favor a scenario in which the ionized outflows in UGC 8782 present a spherical geometry, consistent with some theoretical predictions <cit.>.  \n\n\nTo compute the mass of ionized gas in the outflow, first we correct the flux of the Hα broad component at each spaxel using the A_V values (Fig. <ref>) for the broad component and the extinction law of <cit.>. For spaxels with no A_V estimations, we use its mean value. Then, we compute the mass of the gas in each spaxel using Eq. <ref> and the observed N_e values for the outflow from Fig. <ref> or its mean value for spaxels with no density measurements. Finally, we sum the mass contributions of all spaxels resulting in a mass of ionized gas in the outflow of M_ out=(3.3±1.1)×10^6 M_⊙. This value corresponds to about 25 per cent of the total mass of ionized gas in the central region of UGC 8782.\n\n\n\n\nWe estimate the mass-outflow rate and kinetic power of the ionized gas outflows within circular rings with width Δ R=03 centred at the nucleus by \n    \n    Ṁ_ out,Δ R=∑_iM^i_ out,Δ R V^i_ out,Δ R/Δ R,\n\n     and\n    \n    K̇_ out,Δ R=∑_iM^i_ out,Δ R (V^i_ out,Δ R)^3/2Δ R,\n\nwhere the sum is performed over velocity bins corresponding to the spectral sampling of the final data cube (∼45 km s^-1) with velocities in the range from -3000 to 3000 km s^-1, M^i_ out,Δ R  is the mass of ionized gas within the ring at the velocity channel i  and V^i_ out,Δ R corresponds to the absolute value of the velocity of the outflow.  We constructed velocity channel maps for the Hα outflow component, using a datacube constructed by subtracting the models of the stellar population contribution and of the narrow Hα component and the [N ii] emission lines. To compute the mass within each channel and radial bin, we adopt the mean electron density value for the outflow component.  Fig. <ref> presents the resulting radial profiles of mass-outflow rate (top panel) and kinetic power of the outflows (bottom panel). The error bars corresponds to the uncertainties propagated from the flux, velocity and electron density. The peaks of Ṁ_ out,Δ R and K̇_ out,Δ R occur at ∼1 arcsec, as expected by the enhanced emission at the location of the western radio hotspot, reaching values of 0.5±0.1 M_⊙ yr^-1 and (6.8±1.1)×10^41 erg s^-1, respectively. These are the lower limits because where there is ionized gas, there must be neutral gas as well because otherwise the clouds get over-ionized to a much higher ionization level than observed <cit.>. The peak mass outflow rate derived here is about 3 times larger than the value derived by <cit.>. This discrepancy is due to the different assumptions by these authors and in this work, and specifically due to the correction of the Hα fluxes for extinction, not performed in the previous work.  \nThe kinetic power of the outflows is about two orders of magnitude smaller than the kinetic power of the radio jets in UGC 8782, of 2-4×10^43 erg s^-1 <cit.>, consistent with a jet-driven outflow. \n\n\n\nWe estimate the AGN bolometric luminosity (L_ bol) from the [O iii]λ5007 luminosity by L_ bol=3500 L_ [O III] <cit.>. Using the integrated  [O iii]λ5007 luminosity, corrected by dust extinction the extinction law of <cit.>, we obtain L_ bol=(2.2±0.7)×10^43 erg s^-1. Using the relation of L_ bol with the Hα luminosity, L_ bol=2000 L_ Hα <cit.> the resulting bolometric luminosity is  L_ bol=(2.5±0.4)×10^43 erg s^-1.\nFinally, using the hard X-ray bolometric correction from <cit.> and the observed 2–10 keV flux from <cit.>, we obtain L_ bol≈7.2×10^43 erg s^-1. An advantage of using X-ray observations is that it is less sensitive to dust obscuration and to scattered or reprocessed emission than optical wavelengths, being a direct tracer of the AGN emission. \n\nThe kinetic power of the ionized outflows corresponds to ∼1–3 per cent of the bolometric luminosity of the AGN in UGC 8782, depending on the tracer used to estimate the bolometric luminosity.  This indicates that the ionized gas outflows could be powerful enough to suppress the star formation in the host galaxy as the  kinetic coupling efficiency of the outflow is larger than the minimum value required by simulations for AGN feedback to have an effective impact on the host galaxies <cit.>. In addition, the kinetic energy of the outflows represents less than 20 per cent of the total energy released by the outflow and the contribution from the other gas phases is expected to be non negligible. <cit.>. On the other hand, it is worth mentioning that the uncertainties in the outflow properties are usually high (up to two orders of magnitude), due to assumptions on their densities and geometry <cit.>. \n\n\n\n\n\n§ CONCLUSIONS\n\n\nWe used GMOS-IFU observations of the radio loud AGN host UGC 8782 at a spatial resolution of ∼725 pc to study the gas emission structure and kinematics in the inner 3.4×4.9 kpc^2 of the galaxy. Our main conclusions are:\n\n\n\n    \n  * The emitting gas presents high velocity dispersion as quantified by the W_ 80 maps, with values larger than 500 km s^-1 at several locations. The highest values are observed west (∼ 1 kpc) of the nucleus in regions co-spatial with the inner radio jet, indicating a jet-cloud interaction. \n    \n  * The profiles of each emission line are fitted by two Gaussian curves: a narrow (σ≲200 km s^-1) and a broad (σ≳200 km s^-1) component. The narrow component traces the emission of the gas in the galaxy disc, while the broad component is consistent with gas outflows.\n    \n  * The narrow component gas kinematics shows a pattern of disc rotation, similar to that of the stars. However, differences between the  observed Hα velocity field and a rotation disc model of up to 30 km s^-1 are also present,  likely associated to disturbed gas kinematics due to a previous galaxy merger process.\n    \n  * The broad component is blueshifted by ∼150-500 km s^-1 relative to the systemic velocity of the galaxy and has a velocity dispersion of up to σ≈400 km s^-1. This component is detected for individual spaxels mainly at locations to the west and north of the nucleus, but it is observed in integrated spectra at several locations surrounding the nucleus. \n    \n  * The BPT and WHAN diagnostic diagrams show that both disc and outflow components present values in the AGN region. Shock gas excitation is also supported for the outflow component by the enhanced emission co-spatial with the western radio hotspot and by a correlation between [O i]λ6300/Hα and σ_ OI, known shock tracers.\n    \n  * We estimate the mass outflow rate and kinetic power of the ionized gas outflows at different distances from the nucleus. The highest values of  these properties are observed at ∼1 kpc from the nucleus with values of Ṁ_ out,Δ R=0.5±0.1 M_⊙ yr^-1 and K̇_ out,Δ R =(6.8±1.1)×10^41 erg s^-1. The kinetic power of the outflows corresponds to 1–3 per cent of the AGN bolometric luminosity. \n    \n\n\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe thank to an anonymous referee for their constructive comments that helped improve this manuscript.\nBased on observations obtained at the Gemini Observatory, which is operated by the Association of Universities for Research in Astronomy, Inc., under a cooperative agreement with the NSF on behalf of the Gemini partnership: the National Science Foundation (United States), National Research Council (Canada), CONICYT (Chile), Ministerio de Ciencia, Tecnología e Innovación Productiva (Argentina), Ministério da Ciência, Tecnologia e Inovação (Brazil), and Korea Astronomy and Space Science Institute (Republic of Korea). \nThis research has made use of NASA's Astrophysics Data System Bibliographic Services. This research has made use of the NASA/IPAC Extragalactic Database (NED), which is operated by the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and Space Administration.\n R.A.R. acknowledges the support from Conselho Nacional de Desenvolvimento Científico e Tecnológico (CNPq)  and Fundação de Amparo à pesquisa do Estado do Rio Grande do Sul (FAPERGS).\n R.R. thanks to CNPq (Proj. 311223/2020-6,  304927/2017-1 and  400352/2016-8), FAPERGS (Proj. 16/2551-0000251-7 and 19/1750-2). M.B. and G.L.O thank to Coordenação de Aperfeiçoamento de Pessoal de Nível Superior (CAPES, Proj. 0001).\n\n\n\n\n§ DATA AVAILABILITY\n\nThe processed data used in this article will be shared on reasonable request to the corresponding author.\n\n\n\n\n\n\n\n\n\n\nmnras\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}