{"entry_id": "http://arxiv.org/abs/2303.07096v1", "published": "20230313133059", "title": "Prototype-based Embedding Network for Scene Graph Generation", "authors": ["Chaofan Zheng", "Xinyu Lyu", "Lianli Gao", "Bo Dai", "Jingkuan Song"], "primary_category": "cs.CV", "categories": ["cs.CV"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrototype-based Embedding Network for Scene Graph Generation\n    \nChaofan ZhengEqual contribution.\nXinyu Lyu^∗ \nLianli GaoCorresponding author. \nBo Dai\nJingkuan Song \n\n\n\n\n\n\n School of Computer Science and Engineering, \nUniversity of Electronic Science and Technology of China, China\n\n mailto:zheng_chaofan@foxmail.comzheng_chaofan@foxmail.com,\nmailto:lianli.gao@uestc.edu.cnlianli.gao@uestc.edu.cn\n\n\n    \n==================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCurrent Scene Graph Generation (SGG) methods explore contextual information to predict relationships among entity pairs.\nHowever, due to the diverse visual appearance of numerous possible subject-object combinations, \nthere is a large intra-class variation within each predicate category, , “man-eating-pizza, giraffe-eating-leaf”, \nand the severe inter-class similarity between different classes, , “man-holding-plate, man-eating-pizza”, in model's latent space. \nThe above challenges prevent current SGG methods from acquiring robust features for reliable relation prediction.\nIn this paper, we claim that the predicate's category-inherent semantics can serve as class-wise prototypes in the semantic space for relieving the challenges.\n\nTo the end, we propose the Prototype-based Embedding Network (PE-Net), which models entities/predicates with prototype-aligned compact and distinctive representations and thereby establishes matching between entity pairs and predicates in a common embedding space for relation recognition.\nMoreover, Prototype-guided Learning (PL) is introduced to help PE-Net efficiently learn such entity-predicate matching, and Prototype Regularization (PR) is devised to relieve the ambiguous entity-predicate matching caused by the predicate's semantic overlap.\nExtensive experiments demonstrate that our method gains superior relation recognition capability on SGG, achieving new state-of-the-art performances on both Visual Genome and Open Images datasets. The codes are available at\n<https://github.com/VL-Group/PENET>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nScene Graph Generation (SGG) is a fundamental computer vision task that involves detecting the entities and predicting their relationships in an image to generate a scene graph, where nodes indicate entities and edges indicate relationships between entity pairs. Such a graph-structured representation is helpful for downstream tasks such as Visual Question Answering <cit.>, Image Captioning <cit.>, and Image Retrieval <cit.>. \n\n\n\n\n\nExisting SGG models <cit.> typically start with an object detector that generates a set of entity proposals and corresponding features. Then, entity features are enhanced by exploring the contextual information taking advantage of message-passing modules. Finally, these refined entity features are used to predict pairwise relations. \nAlthough many works have made great efforts to explore the contextual information for robust relation recognition, they still suffer from biased-prediction problems, preferring common predicates (,“on”, “of”) instead of fine-grained ones (,“walking on”, “covering”).\n\nTo address the problem, various de-biasing frameworks <cit.> have been proposed to obtain balanced prediction results. \nWhile alleviating the long-tailed issue to some extent, most of them only achieve a trade-off between head and tail predicates.\nIn other words, they sacrifice the robust representations learned on head predicates for unworthy improvements in the tail ones <cit.>, which do not truly improve the model's holistic recognition ability for most of the relations.  \n\n\n\n\n\n\n\n\n\n\nThe origin of the issue lies in the fact that current SGG methods fail to capture compact and distinctive representations for relations. \nFor instance, as shown in Fig. <ref>, the relation representation, derived from Motifs' latent space, is heavily discrete and intersecting. \n\nHence, it makes existing SGG models hard to learn perfect decision boundaries for accurate predicate recognition. \nAccordingly, we summarize the issue as two challenges: large Intra-class variation within the same relation class and severe Inter-class similarity between different categories.\n\nIntra-class variation. The intra-class variation arises from the diverse appearance of entities and various subject-object combinations.\n\nSpecifically, entities' visual appearances change greatly even though they belong to the same class.\nThus, represented as the union feature containing subject and object entities, relation representations significantly vary with the appearances of entity instances, , various visual representations for “pizza” in Fig. <ref>(c) vs. Fig. <ref>(d).\nBesides, the numerous subject-object combinations of predicate instances further increase the variation within each predicate class, , “man-eating-pizza” vs. “giraffe-eating-leaf” in Fig. <ref>(c) and Fig. <ref>(e). \n\n\n\n\n\nInter-class similarity. The inter-class similarity of relations originates from similar-looking interactions but belongs to different predicate classes. For instance, as shown in Fig. <ref>(a) and Fig. <ref>(c), the similar visual appearance of interactions between “man-pizza” and “man-plate” make current SGG models hard to distinguish “eating” from “holding”, even if they are semantic irrelevant to each other.\n\nThe above challenges motivate us to study two problems:\n\n1) For the intra-class variation, how to capture category-inherent features, producing compact representations for entity/predicate instances from the same category.\n\n\n\n\nMoreover, 2) for the inter-class similarity, how to derive distinctive representations for effectively distinguishing similar-looking relation instances between different classes.  \n\n\n\nOur key intuition is that semantics is more reliable than visual appearance when modeling entities/predicates.\n\n\nIntuitively, although entities/predicates of the same class significantly vary in visual appearance, they all share the representative semantics, which can be easily captured from their class labels.\n\nDominated by the representative semantics, the representations of entities and predicates have smaller variations within their classes in the semantic space.\n\nBesides, the class-inherent semantics is discriminative enough for visual-similar instances between different categories. \n\n\n\n\n\nTherefore, in conjunction with the above analysis, modeling entities and predicates in the semantic space can provide highly compact and distinguishable representations against intra-class variation and inter-class similarity challenges.\n\n\n\n\n\n\n\n\n\nInspired by that, we propose a simple but effective method, Prototype-based Embedding Network (PE-Net), which produces compact and distinctive entity/predicate representations for relation recognition. \nTo achieve that, the PE-Net models entity and predicate instances with compact and distinguishable representations in the semantic space, which are closely aligned to their semantic prototypes.\nPractically, the prototype is defined as the representative embedding for a group of instances from the same entity/predicate class. \n\n\n\nThen, the PE-Net establishes matching between entity pairs (, subject-object (s, o)) and their corresponding predicates (p) for relation recognition \n\n(, ℱ(s, o) ≈p).\nBesides, a Prototype-guided Learning strategy (PL) is proposed to help PE-Net efficiently learn this entity-predicate matching. \n\nAdditionally, to alleviate the ambiguous entity-predicate matching caused by the semantic overlap between predicates (, “walking on” and “standing on”), Prototype Regularization (PR) is proposed to encourage inter-class separation between predicate prototypes for precise entity-predicate matching.\n\n\n\n\n\n\n\n\nFinally, we introduce two metrics, , Intra-class Variance (IV) and Intra-class to Inter-class Variance Ratio (IIVR), to measure the compactness and distinctiveness of entity/predicate representations, respectively.\n\n\n\n\nIn summary, the main contributions of our work are three folds:\n\n    \n    \n    \n  * We propose a simple yet effective method, , Prototype-based Embedding Network (PE-Net), which produces compact and distinctive entity/predicate representations and then establishes matching between entity pairs and predicates for relation recognition.\n    \n    \n  * Moreover, Prototype-guided Learning (PL) is introduced to help PE-Net efficiently learn such entity-predicate matching, and Prototype Regularization (PR) is devised to relieve the ambiguous entity-predicate matching caused by the predicate's semantic overlap.\n    \n    \n  * Evaluated on the Visual Genome and Open Images datasets, our method significantly increases the relation recognition ability for SGG, achieving new state-of-the-art performances.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ RELATED WORK\n\n\n\nWe categorize the related works of SGG into the following fields: Vanilla Scene Graph Generation Model and Unbiased Scene Graph Generation Framework. \n\nVanilla Scene Graph Generation Model. Numerous models have been proposed to solve the scene graph generation task from different perspectives in recent years. Early methods <cit.> attempted to detect objects and relations with independent networks, ignoring the rich contextual information. Afterward,  <cit.> firstly proves that the contextual information can significantly improve the relation prediction and hence introduces an iterative message-passing mechanism to refine the features of objects and relations.  <cit.> further emphasizes the importance of contextual information between objects and utilizes the BiLSTM to encode the object and edge contextual information. Moreover, to avoid suffering from noisy information during message passing, <cit.> and <cit.> design sparse structures to improve the model's context modeling capability. \nIn addition, prior knowledge is also helpful for relation prediction.  <cit.> explores the statistical patterns of object co-occurrence for refining relation predictions. Besides,  <cit.> encodes the commonsense knowledge into the model to improve the few-shot recognition ability. \nHowever, due to the imbalanced data distribution, the vanilla SGG models struggle to recognize the fine-grained tail predicates.\n\nUnbiased Scene Graph Generation Framework.\nRecently, various de-biasing SGG frameworks have been proposed to tackle the biased predictions problem.  <cit.> proposes a counterfactual causality method to remove the effect of context bias.  <cit.> constructs a hierarchical tree structure from the cognitive perspective to make the tail predicates receive more attention.  <cit.> compensates the disadvantages of over-sampling and under-sampling and proposes a bi-level sampling method.  <cit.> creates a balanced learning process by constructing a balanced predicate learning space and semantic adjustment.  <cit.> explicitly cleans the noisy annotations on the datasets to balance the data distribution.  <cit.> introduces a predicate lattice to figure out the fine-grained predicate pairs that are hard to distinguish. Despite alleviating the biased problem to some extent, these methods improve the prediction performance of tail predicates at the expense of head ones, which do not truly improve the model’s holistic recognition ability.\n\nOur work generates compact and distinctive entity/predicate representations by utilizing a prototype-based modeling method and cleverly-designed learning strategies, which achieves superior relation recognition performance on both head predicates and tail ones with a simple but effective framework. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ METHOD\n\n\n\n\n\n\n\nThe whole pipeline of our Prototype-based Relation Embedding (PE-Net) is illustrated in <ref>.\nFollowing the previous works <cit.>, we utilize an object detector (, Faster R-CNN <cit.>) to generate a set of entity proposals with corresponding features.\nMoreover, the features extracted from the union box between two entities are used to represent their corresponding predicates.\nGiven entity and predicate features, the Prototype-based Embedding Network (PE-Net)\n\nmodels subject (s), object (o), and predicate (p) instances with prototype-based compact and distinguishable representations.\nThen, the PE-Net matches subject-object pairs ((s, o)) with the corresponding predicates (, ℱ(s, o) ≈p) in the common embedding space for relation recognition.\nTo achieve that, we propose a Prototype-guided Learning (PL), to help PE-Net learn the entity-predicate matching. \nFurthermore, to relieve the ambiguous matching problem caused by the predicate's semantic overlap, Prototype Regularization (PR) is proposed to encourage inter-class distinction for accurate entity-predicate matching. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Prototype-based Embedding Network\n\n\nThe procedure of Prototype-based Embedding Network (PE-Net) can be divided into two steps: 1) Prototype-based Modeling for producing compact and distinctive entity and predicate representations. 2) Prototype-guided Entity-Predicate Matching for relation recognition.\n\nPrototype-based Modeling.\nThe Prototype-based Embedding Network (PE-Net) models entity/predicate instances with prototype-based compact and discriminative representations shown in Fig. <ref>.\n\nConcretely, the representations of subject (s), object (o), and predicate (p) are modeled below:\n\n    s    = 𝐖_s t_s + v_s, \n    o    = 𝐖_o t_o + v_o, \n    p    = 𝐖_p t_p + u_p,\n\nwhere 𝐖_𝐬, 𝐖_𝐨, and 𝐖_𝐩 are learnable parameters.\nMoreover, 𝐖_s t_s, 𝐖_o t_o and 𝐖_p t_p are the class-specific semantic prototypes obtained from their class labels' word embedding (GloVe <cit.>), , t_s, t_o and t_p. \nBased on the class-specific prototypes, the instance-varied semantic contents v_s, v_o and u_p are utilized to model the diversity of each instance from the same subject, object, and predicate class.\nPractically,  v_s are obtained as:\n\n    g_s    = σ(f((𝐖_𝐬t_s) ⊕ h(x_s))) \n    v_s    = g_s⊙ h(x_s),\n\nwhere f(·) is a fully connected layer, h(·) is the visual-to-semantic function used to transform the visual feature into semantic space, and ⊕ is the concatenation operation. Moreover, σ(·) is the sigmoid activation function, ⊙ is the element-wise product, and x_s is the visual features of subject instances from the detector.\nUtilizing the gate mechanism in <ref>, the class-irrelevant information is eliminated from the original visual feature x_s producing consistent representations within class. In addition, we derive v_o in the same way following <ref>. \n\nSimilarly, predicate's instance-varied semantic content u_p is defined as:\n\n    g_p    = σ( f( ℱ(s,o) ⊕ h(x_u)  )  ) \n    u_p    = g_p⊙ h(x_u),\n\nwhere x_u is the union feature of subject and object, and ℱ(·, ·) denotes the feature fusion function. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrototype-guided Entity-Predicate Matching.\nThen, for relation recognition, we match subject instance (s) and object instance (o) with the corresponding predicate instance (p) in the common semantic space.\nPractically, the entity-predicate matching is shown below:\n\n    ℱ(s, o) ≈p,\n\nwhere ℱ(s, o) is defined as: ReLU(s+o) - (s-o)^2.\n\nHowever, the predicate representation varies with the subject-object pair, which prevents PE-Net from efficiently learning the matching.\nTherefore, we perform an equivalent transformation on <ref>, deriving a deterministic matching objective as follows:\n\n    ℱ(s, o) - u_p≈𝐖_p t_p,\n\nwhere ℱ(s, o) - u_p is defined as relation representation r, which should be matched to its corresponding predicate prototype 𝐖_p t_p (represented as c in the following sections).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Prototype-guided Learning\n\n\n\nTo help PE-Net efficiently match relation representations with corresponding predicates in <ref>, we devise a learning strategy, , Prototype-guided Learning (PL), which makes relation representations close to their corresponding prototypes. In practice, PL consists of two constraints: cosine similarity and Euclidean distance.\n\nFirstly, we have to increase the cosine similarity between the relation representation r and its corresponding prototype c_t, which is implemented as the following loss function:\n\n    ℒ_e_sim =  -   logexp(⟨r, c_t⟩ / τ)/∑_j=0^Nexp(⟨r, c_j⟩ / τ),\n\nwhere · denotes the unitary operation, \nτ is a learnable temperature hyper-parameter, t is subscript for the ground truth class, and N is the number of predicate categories. \n\nSince the cosine similarity only considers angle-based relative distance, it may fail to make relation representations and corresponding prototypes close to each other in the Euclidean space.\nTo the end, we further impose the Euclidean distance constraint.\nIt encourages the relation representation r close to its corresponding prototypes c_t while keeping the distances with others in Euclidean space.\nPractically, we first calculate the distances between the relation representation r and each class prototype c_i obtaining the distances set G = { g_i}_i=0^N, where g_i is computed as:\n\n    g_i = r - c_i_2^2.\n\nThen, we sort the distance set B = G∖{g_t} (excluding g_t) in increasing order and obtain the sorted distance set as B' = {b'_i} _i = 0^N-1.\nFurthermore, the top k_1 smallest distances of B' are averaged as the distance g^- to negative prototypes:\n\n    g^- = 1/k_1∑_i=0^k_1-1 b'_i.\n\nTogether with the distance to the positive prototype g^+ = g_t, we further construct the triplet loss:\n\n    ℒ_e_euc = max(0, g^+ - g^- + γ_1),\n\nwhere γ_1 is a hyper-parameter to adjust the distance margins between relation representations and the negative prototypes.\n\n\n\n §.§ Prototype Regularization\n\nTo alleviate the ambiguous matching caused by the semantic overlap between predicates, we propose a Prototype Regularization (PR) to encourage inter-class separation by enlarging the distinction between prototypes for precise entity-predicate matching.\n\n\n\n\n\nCorrespondingly, according to the constraints imposed in <ref>, we first calculate the cosine similarity between predicate prototypes obtaining the similarity matrix as follows:\n\n    S = C·C^⊤ = (s_ij) ∈ℝ^(N+1) × (N+1),\n\nwhere C=[c_0; c_1;...; c_N] is the predicate prototype matrix, and\nC is obtained by normalizing the vectors in it. Moreover, s_ij represents the cosine similarity between prototype c_i and c_j.\n\nThen, we should reduce each pair of prototypes' cosine similarity to make them distinctive in the semantic space.\n\n\nTherefore, we introduce the l_2,1-norm of S and minimize it:\n\n    ℒ_r_sim = S_2,1= ∑_i=0^N√(∑_j=0^N s_ij^2).\n\n\n\nHowever, only regularized by the cosine similarity, some predicates are still not distinctive enough against others. Thus, we enlarge their distances in the Euclidean space for further distinction. \n\nTo achieve that, we calculate the Euclidean distance between two prototypes obtaining the distance matrix \nD = (d_ij) ∈ℝ^(N+1) × (N+1) with d_ij computed as:\n\n    d_ij = c_i - c_j_2^2,\n\nwhere d_ij indicates the Euclidean distance between prototype c_i and c_j.\n\n\n\n\n\n\nFor each prototype, we should distance it from others. \nTherefore, we sort the elements in each row of matrix D in increasing order, obtaining D' =  (d'_ij) ∈ℝ^(N+1) × (N+1), and select the top k_2 smallest values of each row to widen them:\n\n    d^-     = 1/(N+1)k_2∑_i=0^N∑_j=1^k_2 d'_ij, \n    ℒ_r_euc    = max (0, - d^- + γ_2),\n\nwhere γ_2 is another hyper-parameter used to adjust the distance margins.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Scene Graph Prediction\n\n\nDuring the training stage, the final loss function ℒ for our PE-Net is expressed as:\n\n    ℒ = ℒ_r_sim + ℒ_e_sim + ℒ_r_euc + ℒ_e_euc .\n\n\nDuring the testing stage, with the relation representation r, we choose the class of prototypes with the highest cosine similarity as the prediction result: \n\n    res_r = iarg max ({q_i | q_i = ⟨r, c_i⟩ / τ}),\n\nwhere q_i indicates the similarity between relation representation r and prototype c_i. \n\n\n\n\n§ EXPERIMENTS\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Datasets\n\n\nVisual Genome (VG).  The Visual Genome (VG) dataset consists of 108,077 images with average annotations of 38 objects and 22 relationships per image. In this paper, we adopt the most widely used split <cit.>, which contains the most frequent 150 object categories and 50 predicate categories.\nSpecifically, the dataset is divided into a training set with 70% of the images, a testing set with the remaining 30%, and 5k images from the training set for validation. \n\nOpen Images (OI).\nWe conduct experiments on Open Image V6 dataset, which has 126,368 images for training, and 1813 and 5322 images for validation and testing. It contains 301 object categories and 31 predicate categories. \n\n\n\n\n §.§ Evaluation Protocol\n\nVisual Genome (VG).\nWe evaluate our method on three sub-tasks, including Predicate Classification (PredCls), Scene Graph Classification (SGCls), and Scene Graph Detection (SGDet).\n\n\n\nFollowing the recent works <cit.>, we take Recall@K (R@K) and mean Recall@K (mR@K) as the primary evaluation metrics.\n\nMoreover, we also report the zero-shot Recall@K (zs-R@K) that measures the model's generalization in dealing with the unseen relation triplets during training. \n\n\n\n\nDue to the imbalanced data distribution of VG dataset, R@K focuses on the common predicates with abundant samples, and mR@K prefers the tail predicates.\nTherefore, we introduce the Mean@K (M@K), which averages the R@K and mR@K for evaluating the model's overall performance on SGG.\nIn addition, the Intra-class Variance (IV) and Intra-class to Inter-class Variance Ratio (IIVR) are introduced to measure the compactness and distinctiveness of entity/predicate representations. Intuitively, lower values of IV and IIVR indicate higher quality for representations. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Images (OI).\nFollowing the previous works <cit.>, we utilize the Recall@50 (R@50), weighted mean AP of relations (wmAP_rel), weighted mean AP of phrase (wmAP_phr) as the evaluation metrics. The score_wtd is calculated as:\nscore_wtd = 0.2 ×R@50 + 0.4 ×wmAP_rel + 0.4 ×wmAP_phr. \n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n §.§ Implementation Details\n\n\nFollowing the previous works <cit.>, we adopt the Faster R-CNN <cit.> with ResNeXt-101-FPN <cit.> provided by <cit.> to detect objects in the image. The parameters of the detector are frozen during training. \nIn particular, we set k_1, k_2, γ_1, and γ_2 as 10, 1, 1, and 7.\nAdditionally, the PE-Net is trained by an SGD optimizer with 60k iterations. The initial learning rate and the batch size are set to 10^-3 and 8. All experiments are implemented with PyTorch and trained with an NVIDIA GeForce RTX 3090 GPU. \n\n\n\n §.§ Comparisons with State-of-the-art Methods\n\n\n\nVisual Genome.\nTo evaluate PE-Net's capability on scene graph generation, we compare it with several state-of-the-art SGG methods on Visual Genome dataset under all three sub-tasks. The results are shown in <ref>. \n\n\n\n\n\n\nGenerally, our method achieves superior performance compared to other SGG models.\n\n\nConcretely, PE-Net(P) outperforms the VCTree by 7.5%, 6.5%, and 3.7% at mR@100 and by 2.7%, 0.7%, and 0.9% at R@100 on PredCls, SGCls, and SGDet.\nIt also outperforms the recent SGG model, RU-Net, by 0.5% and 1.2% at R@100 and mR@100 on PredCls.\nIn addition, the full PE-Net outperforms \n\nVCTree by 15.9%, 10.6%, 7.2%,  \nand RU-Net by 9.6%, 4.3%, 3.7%,\nat mR@100 on three subtasks, respectively. \nThe results demonstrate the effectiveness of our model.\n\n\n\n\n \n\nMoreover, to explore PE-Net's potential capability of solving the long-tail problem for SGG, we equip it with the advanced re-weighting method <cit.>.\n\nThen, we compare PE-Net-Reweight with Motifs <cit.> de-biased by several existing state-of-the-art de-biasing methods.\n\nThe results are summarized in <ref>.\nWe find that our PE-Net-Reweight pushes the performance on unbiased SGG to a new level.\n\nFor instance, compared with Motifs-GCL, we achieve an absolute performance advantage, outperforming it by 17.0%, 10.2%, and 8.9% at R@100 on PredCls, SGCls, and SGDet tasks, and by 2.5%, 1.7% at mR@100 on PredCls, SGCls tasks, respectively.\nBenefiting from the prototype-aligned distinctive representations, the PE-Net has the potential to tackle the biased problem in SGG.\n\n\nIn addition, we report the zero-shot recall results to verify the generalization of our method in handling the unseen relation triplets in the training set. \nAs shown in <ref>, our model outperforms the vanilla Motifs and VCTree by 15.53%, 5.40%, 3.49%, and 15.38%, 4.45%, 2.91% at zs-R@100 on PredCls, SGCls, and SGDet. \nAlthough TDE significantly improves the zero-shot performance by removing the effect of context bias, Motifs-TDE and VCTree-TDE are still surpassed by our PE-Net with 2.69%, 2.03%, 0.7%, and 3.29%, 2.53%, 0.4% on three tasks, respectively. \nWe owe the strength to the Prototype-based Modeling of our PE-Net, which models entity and predicate in the semantic space, significantly improving the model's analogical reasoning capability on unseen relation triplets.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Images.\nTo verify the generality of our method on different datasets, we conduct experiments on Open Images and present the results in <ref>. \nConsistent with the performance on VG, PE-Net also achieves competitive results on Open Images dataset.\nSpecifically, our method exceeds the BGNN with a large margin of 2.7% on average at four metrics, and outperforms RU-Net by 1.2%, 2.5%, and 1.4% at wmAP_rel, wmAP_phr, and score_wtd, respectively. \nIt powerfully confirms PE-Net's generalization on handling relation recognition under different data distributions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Measuring Representation Modeling of PE-Net\n\n\nTo certify the assumption that our PE-Net is capable of producing compact and distinctive representations for entity and predicate, we conduct both quantitative and qualitative studies in <ref> and <ref>, respectively.\nNotably, we only conduct experiments on the PredCls task, which eliminates the impact of entities' mis-classification made by detectors. \n\nQuantitative Analysis.\nTo quantitatively evaluate the quality of the entity's and predicate's representations (, degree of intra-class compactness and the inter-class distinctiveness), we evaluate and make comparisons between PE-Net and previous methods <cit.> with IV (Intra-class Variance) and IIVR (Intra-class to Inter-class Variance Ratio). Moreover, the experimental results are shown in <ref>.\n\n\n\n\n\n\n\n\n\n\n\n\nFirstly, our PE-Net yields more compact entity and predicate representations than previous methods, , 0.74 9.73 on IV-O and 1.06 1.41 on IV-R compared with Motifs. \n\nThat illustrates the effectiveness of our Prototype-based Modeling in PE-Net. \n\nAlso, the representations learned by our model are more distinguishable, , 0.24 1.93 on IIVR-O and 1.67 2.72 on IIVR-R compared with Motifs. \n\nWe owe it to the effectiveness of our PR, which significantly alleviates the ambiguous entity-predicate matching by encouraging predicate prototypes away from each other. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQualitative Analysis.\nFor an intuitive illustration of PE-Net's capability of yielding compact and distinguishable representations, we visualize the feature distribution of entities and predicates taking advantage of the t-SNE technique, shown in <ref>. \n\nComparing <ref>(a) with <ref>(b), we observe that PE-Net produces more compact and distinctive entity representations than Motifs, intuitively illustrating the advantages of modeling instances in the semantic space than from visual appearances. \n\n\nIn addition, the relation feature distribution of Motifs shown in <ref>(c) is of large intra-class variance and severe inter-class overlap. In this case, it is hard for SGG models to learn a perfect decision boundary for accurate relation recognition. \nOn the contrary, the relation representations learned by our PE-Net are of high-level inter-class distinctiveness and intra-class compactness, which intuitively demonstrates our method's superiority and explains why our method achieves excellent relation prediction performance.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Ablation Studies\n\n\n\n\n\nTo verify the effectiveness of each component of the proposed PE-Net, we conduct ablation studies on PL and PR under the VG dataset, and the results are summarized in <ref>. \nExp 1, PE-Net is trained without PL and PR, which directly uses a linear classifier to classify the relation representation defined in <ref>. \nExp 2, PE-Net is trained with PL, which discards the ℒ_r_sim and ℒ_r_euc in <ref>. \nExp 3, PE-Net is trained with both PL and PR, , <ref>.\n\n\n\n\nWhen constrained by PL in Exp 2, the model outperforms the baseline (, Exp 1) on all metrics under three sub-tasks (, 25.4% 20.0% at mR@100, and 70.1% 68.2% at R@100 on PredCls).\n\nThis verifies that PL effectively helps PE-Net to establish matching between entities and predicates for accurate relation recognition.\n\n\nFurthermore, after being integrated with PR in Exp 3, our PE-Net obtains significant gains on mR@K (, 33.8% 25.4% at mR@100 on PredCls), which demonstrates PR's effectiveness in enlarging the distinction between prototypes achieving reliable entity-predicate matching.\nHowever, we observe that the improvement of mR@K brings a slight drop at R@K. \nThat is because our model can reasonably classify some predicates (head classes) into their corresponding fine-grained ones (tail classes), , from “on” to “standing on/laying on/walking on”. And the drops of Recall on those head predicates are inevitable, which is also observed in fine-grained classification <cit.> and long-tailed tasks <cit.>.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Visualization Results\n\n\n\n\n\n\nTo verify that our proposed PE-Net is capable of making reliable relation recognition, we make a comparison between scene graphs generated by Motifs <cit.> (in purple) and our method (in green) in <ref>. \n\nIn the first example, our method predicts informative relations such as “car-parked on-street” and “building1-across-street” instead of “car-on-street” and “building1-near-street”.\nSimilarly, in the second example, our method generates fine-grained predicates, , “wearing” and “riding”.\nThese results demonstrate that our method has a stronger predicate recognition ability than Motifs,\nwhich generates accurate relations for comprehensive scene understanding.\n\n\n\n\n§ CONCLUSION\n  \nIn this work, we propose a novel Prototype-based Embedding Network (PE-Net), which produces compact and distinctive entity/predicate representations for SGG task. Towards this end, the PE-Net models entity and predicate instances with prototype-based representations and then matches entity pairs with predicates for relation recognition. Moreover, we propose a Prototype-guided Learning strategy (PL) and Prototype Regularization (PR) to help PE-Net efficiently learn entity-predicate matching. Finally, our method achieves new state-of-the-art performances on both Visual Genome and Open Images datasets, which demonstrates the effectiveness of our methods.\n\nBroader Impact and Limitations.\n\nOur work presents a powerful and efficient SGG method, which predicts relations between entities without message-passing module. The merit greatly reduces the computational complexity and enables SGG to be widely used in real-world applications, such as autonomous driving and intelligent robotics. However, our method is sensitive to the detector's recognition ability for entities, which limits its performance on SGCls and SGDet subtasks. Therefore, a more robust modeling method should be explored in further work.\n\nAcknowledgment.\n\nThis study is supported by grants from National Key R&D Program of China (2022YFC2009903/2022YFC2009900), the National Natural Science Foundation of China (Grant No. 62122018, No. 62020106008, No. 61772116, No. 61872064), Fok Ying-Tong Education Foundation(171106), SongShan Laboratory YYJC012022019, and Open Research Projects of Zhejiang Lab (No. 2019KD0AD01/011).\n\n\nieee_fullname\n\n\n\n"}