{"entry_id": "http://arxiv.org/abs/2303.07094v1", "published": "20230313132713", "title": "Probing generalized neutrino interactions with DUNE Near Detector", "authors": ["Pantelis Melas", "Dimitrios K. Papoulias", "Niki Saoulidou"], "primary_category": "hep-ph", "categories": ["hep-ph"], "text": " \n =1\n\n\n  \n\n\n\n\n\n\n\n\njustification   = raggedright, \nsinglelinecheck = false \n\n\n\n\n\n\n\n@subsection\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n0.3ex>-0.75em-1.1ex∼\n0.3ex<-0.75em-1.1ex∼\n\n#1\n    #1\n        SU(2)_L ⊗ SU(2)_R ⊗ U(1)_B-L\n        neutrinoless double beta decay \n        𝒞𝒫𝒞𝒫𝒯𝒫𝒯𝒞2𝒵_2Łℒet al.h.c.#1⟨ #1⟩#1 to #1 pt\n         lepton flavour violation lepton number violation CEνNS EνES \n        \n         \n        lepton flavour violation lepton number violating SU(3)_c ⊗ SU(2)_L ⊗ U(1)_YSU(3)_c ⊗ SU(3)_L ⊗ U(1)_XSU(3)_c ⊗ SU(3)_L ⊗ U(1)_X ⊗ U(1)_N\n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        21SU(3) ⊗ SU(2) ⊗ U(1)\n        #1#1#1#1#1#1#1#1#1#1\n        \n        \n        \n        unsrtpmelas@fnal.govdkpapoulias@phys.uoa.grNiki.Saoulidou@cern.ch\n        \n        We explore the prospects of constraining general non standard interactions involving light mediators through elastic neutrino-electron scattering events at the DUNE Near Detector (ND). We furthermore consider the special cases of light vector mediators in motivated models such as U(1)_B-L, U(1)_L_μ - L_τ, E_6 and left-right symmetry. The present analysis is based on detailed Monte Carlo simulations of the expected DUNE-ND signal taking into account detector resolution effects, realistic backgrounds as well as On-Axis and Off-Axis neutrino spectra. We show that the high intensity neutrino beam available at Fermilab can place competitive constraints surpassing those of low-energy neutrino searches and direct detection dark matter experiments.\n        Probing generalized neutrino interactions with DUNE Near Detector\n            N. Saoulidou\n            \n        =================================================================\n        \n        \n        \n        \n        \n        \n        \n        § INTRODUCTION\n        \n        \n        \n        \n        Neutrinos are currently the least understood among all particles in the Standard Model (SM). Contrary to the SM predictions, they are massive and mix with each other as suggested by the discovery of neutrino oscillations in propagation <cit.>. Unambiguously, this phenomenon stands out as the clearest evidence of neutrino physics beyond the SM, prompting intense efforts to underpin the ultimate origin of neutrino mass generation <cit.>. On the theoretical side, massive neutrinos are predicted in a wide class of theoretical models beyond the SM, ranging from simple scalar or fermionic extensions to extended gauge symmetries and Grand Unified Theories (GUT), see e.g. Ref. <cit.>.  Another common feature in such models is the existence of new intermediate  gauge bosons that lead to modifications of the electroweak gauge structure <cit.>.  Heavy vector bosons <cit.> have been extensively searched for in the light of LHC data <cit.>. They often lead to charged lepton flavor violating processes <cit.> as well as they induce novel neutrino interactions <cit.>.\n        New physics interactions involving massive neutrinos and new mediators may lead to significant alterations in astrophysical phenomena such as the evolution and cooling mechanism of massive stars <cit.> as well as in a modification of the recorded signal at highly sensitive terrestrial experiments <cit.>. Here we focus on the latter case. In particular we are interested to explore the attainable sensitivities of the Deep Underground Neutrino Detector (DUNE) <cit.> on various new physics scenarios using elastic neutrino electron scattering (EνES) events expected to be measured at the Near Detector (ND) facility.\n        \n        The  Liquid Argon detector i.e. the main component of the 75 ton DUNE-ND will be exposed to the world's most intense beam of high-energy ν_e, \n        ν̅_e, ν_μ, ν̅_μ produced by  the Long Baseline Neutrino Facility (LBNF) <cit.> at Fermilab.  It has been recently pointed out that  measurements will be a valuable tool for the determination of the neutrino flux at the GeV scale <cit.>.  For the DUNE setup in particular, through  measurements the flux normalization uncertainty can be reduced down to 2%, while the flux shape uncertainty can be reduced significantly <cit.>.  Moreover, the anticipated large exposure combined with the significantly improved background rejection capabilities, makes the ND complex to be a favorable facility for probing several physics opportunities <cit.>. This unique experimental setup has motivated a plethora of studies which considered various attractive physics scenarios within and beyond the SM. For instance, Ref. <cit.> explored the possibility to determine the weak mixing angle away from the Z^0-pole and found that a 2% precision is possible. Massive neutrinos imply that non-trivial electromagnetic neutrino interactions are possible and various such aspects were examined in Refs. <cit.>. Moreover, the existence of novel vector-type bosons  was analyzed in a series of recent works in the framework of different promising scenarios in which the new particles are contributing to <cit.> or produced via meson decays before in turn they decay to SM particles,  see e.g. Refs. <cit.>.  Finally, interesting scenarios leading to sub-GeV dark matter production via dark photon decays were explored in Refs. <cit.>, while a proposal for axion-like particles searches at the DUNE-ND was given in Ref. <cit.>. \n        \n        In this work, we first focus on the most general exotic neutrino interactions contributing to EνES and  examine their impact in the detectable signal at the DUNE-ND. In particular, we analyze the new physics effects that may occur in the presence of novel mediators predicted in the framework of neutrino generalized interactions (NGI) <cit.>. Thus, all possible Lorentz invariant interactions are taken into account in a model independent way <cit.>. Contrary to Ref. <cit.> which focused on NGIs with heavy mediators, here we consider light mediators which allows us to explore the explicit dependence of the mediator mass for the given NGI in question. Let us also note that while numerous studies analyzed  light mediators of vector-type previously (see e.g. Refs. <cit.>), in this work the axial-vector, scalar, pseudoscalar and tensor NGI contributions are examined for the first time. We then proceed our analysis by considering motivated scenarios leading to vector-type NGIs such as the U(1)_B-L and U(1)_L_μ - L_τ gauge symmetries, as recently done in Ref. <cit.>. Going one step further, the left-right (LR) symmetric model <cit.> as well as the different realizations of the string-inspired E_6 symmetry <cit.> are taken into consideration for the first time in the present work. For all the aforementioned cases we obtain the projected sensitivities of the DUNE-ND by paying special attention in performing realistic simulations of the detected signal taking into account  systematic effects as well as realistic backgrounds. We furthermore compare our extracted sensitivities with existing ones stemming from available experimental data from EνES (TEXONO <cit.>) and coherent elastic neutrino nucleus scattering–often called CEνNS–(COHERENT <cit.> and Dresden-II <cit.>) measurements as well as from solar neutrino experiments (Borexino <cit.>),  direct dark matter detection experiments (XENONnT <cit.> and LZ <cit.>) and high-energy colliders.\n        \n        The remainder of the paper has been organized as follows. First, in Sec. <ref> we describe the new physics scenarios considered in the present work and define the respective  cross sections within and beyond the SM. Then, in Sec. <ref> we describe our main procedure for simulating the EνES-induced signal at the DUNE-ND as well as our strategy for the extraction of sensitivities. Whenever necessary we also discuss the additional experiments taken into account. Next, in Sec. <ref> we discuss the results obtained in the present study, while in Sec. <ref> we summarize our main conclusions. Additional details are given in the Appendix.\n        \n        \n        \n        \n        § THEORETICAL FRAMEWORK\n        \n        \n        We now proceed  by introducing the various  interactions channels explored in the present work, for which the corresponding cross sections are given and the relevant model parameters are defined. After a brief description of the  well-known SM case our discussion will be mainly focused on the new physics contributions to  predicted in the framework of NGIs with light mediators. We then turn our attention to the implications of the heavy vector mediators predicted in the framework of unification models such as the E_6 and left-right symmetry. \n        \n        \n        \n        \n        \n        \n        \n        \n        \n         §.§ EνES through SM interaction Channel\n        \n        Within the context of the SM, EνES is a well-understood weak interaction process with a tree-level  differential cross section given by <cit.>\n        \n            [dσ_ν_α/d T_e]_SM =   G_F^2m_e/2π[(g_V + g_A)^2 +(g_V - g_A)^2(1-T_e/E_ν)^2 -(g_V^2-g_A^2)m_e T_e/E_ν^2]   ,\n        \n        where G_F is the Fermi constant, E_ν is the incoming neutrino energy, while m_e and T_e denote the electron mass and recoil energy, respectively. Here, g_V and g_A denote the flavor-dependent  vector and axial-vector couplings\n        \n        \n            g_V=-1/2+2sin^2θ_W + δ_α e,       g_A=-1/2+ δ_α e  ,\n        \n        with θ_W being the weak mixing angle for which we adopt the PDG value sin^2 θ_W =0.23857 as obtained in the MS renormalization scheme <cit.>. It is important to note that ν_e–e^- interactions receive contributions from both neutral-current and charged-current interactions, while ν_μ, τ–e^- interact via the neutral-current only. The Kronecker delta δ_ae in the definition of g_V accounts for this fact.  For the case of antineutrino scattering, the corresponding cross section is given by Eq.(<ref>) with the substitution g_A → - g_A. Finally let us stress that for the few GeV neutrino energy accessible  at DUNE, radiative corrections <cit.> amount to only few per mille corrections and hence they can be safely ignored, thus leaving the weak mixing angle as the only source of theoretical uncertainty.\n        \n        \n        \n        \n        \n         §.§ EνES through light novel mediators\n        \n         Neutrino nonstandard interactions (NSI) has become the subject of extensive research using both low- <cit.> and high-energy <cit.> neutrino scattering  as well as  oscillation <cit.> data (for motivations, UV complete models and several applications of NSI see e.g. <cit.>). While NSIs usually assume the existence of a new vector (or axial-vector) type mediator, the NGI framework considered in the present work accommodates a wider class of interactions below the electroweak symmetry breaking scale that arise from the Lagrangian <cit.>\n        \n            ℒ_NGI=G_F/√(2)∑_X=S, P, V, A, T \n            α=e,μ,τC_α,α^f,P[ν̅_αΓ^X L ν_α][f̅Γ_X P f]   .\n        \n        In the above Lagrangian, Γ_X= {1, iγ_5, γ_μ, γ_μγ_5, σ_μν} (with σ_μν=i/2[γ_μ,γ_ν]) which enables a phenomenological study of all possible Lorentz-invariant structures corresponding to  X= {S, P, V, A, T} interactions in a model-independent way. NGIs lead to corrections in both  (for f= {u,d}) <cit.> and  (for f=e) <cit.> cross sections. Here we focus on the latter. The dimensionless coefficients quantify the strength of the interaction X with respect to the Fermi constant through the relation C_α,α^f,P=(√(2)/G_F) (g_X^2/(q^2+m_X^2)),  while m_X and g_X denote the mass and coupling of the respective mediator. Since through  or   measurements only products of couplings  g_ν X g_f X can be probed,  for later convenience in our DUNE-based analysis we take the   coupling to be g_X = √(g_ν X g_e X). \n        \n        For sufficiently light vector and axial-vector  mediators, the corresponding differential cross sections are taken from the SM one given in Eq.(<ref>) and the replacement <cit.>\n        \n            g'_V/A=g_V/A+g_ν V/A· g_e V/A/2√(2)G_F(2m_e T_e + m_V/A^2)  .\n        \n        At this point, it should be stressed that the aforementioned general vector NGIs are not particularly interesting since they do not follow from anomaly-cancellation. We are thus motivated to emphasize their connection to well-known anomaly-free models such as those arising in the framework of extra U(1)_B-L or U(1)_L_μ - L_τ gauge symmetries. Interestingly in the former case,  the differential cross section is identical to the general vector NGI one described above, see e.g. the discussion of Refs. <cit.>. In the latter case instead,  contributions arise from the kinetic mixing induced at the one loop-level as described in Ref. <cit.>. Then, the corresponding vector coupling can be expressed in the form <cit.>\n        \n            g'_V=  g_V ±α_em/3 √(2)π G_Flog(m^2_τ/m_μ^2)g_ν V· g_e V/(2m_e T_e + m_V^2)  ,\n        \n        where the plus (minus) sign accounts for ν_τ(ν_μ) scattering off electrons, while for ν_e only SM interactions are allowed. Finally, the scalar, pseudoscalar and tensor cross sections can be cast in the form  <cit.>\n        \n            [dσ_ν_α/dT_e]_S =[g^2_ν S· g^2_eS/4π(2m_e T_e + m_S^2)^2]m_e^2 T_e/E_ν^2  ,\n        \n        \n            [dσ_ν_α/d T_e]_P = [  g^2_ν P· g^2_eP/8π(2m_e T_e + m_P^2)^2]m_e T_e^2/E_ν^2  ,\n        \n        \n            [dσ_ν_α/d T_e]_T =m_e· g^2_ν T· g^2_eT/2π(2m_e T_e + m_T^2)^2·[1+2(1-T_e/E_ν)+(1-T_e/E_ν)^2-m_e T_e/E_ν^2]  .\n        \n        We should finally stress that, unlike the X=V,A cases, for X=S,P,T  there is absence of interference with the SM cross section.\n        \n        \n        \n         §.§ Left-Right Symmetry\n        \n        \n        A  heavy neutral vector boson, Z^', occurs in models based in the SU(2))_L⊗ SU(2)_R⊗ U(1)_B-L gauge group <cit.>[ A charged gauge boson arises as well, however it is not relevant for the neutral-current interactions we are interested in the present work.]. As explained in Ref. <cit.> LR symmetric models are particularly appealing because of their  ability to incorporate parity violation alongside gauge symmetry breaking, rather than requiring manual intervention as in the SM.\n        Within the context of LR symmetry the  corresponding  differential cross sections are obtained from Eq.(<ref>) through the \n        substitutions g_L → f_L^LR and g_R → f_R^LR <cit.>\n        \n            f_L^L R=    𝒜 g_L + ℬ g_R  , \n            \n            f_R^L R=   𝒜 g_R + ℬ g_L  ,\n        \n        and the definitions\n        \n        \n            𝒜 = 1+sin^4 θ_W/1-2 sin^2 θ_Wγ  ,     ℬ =sin^2 θ_W (1-sin^2 θ_W)/1-2 sin^2 θ_Wγ  ,\n        \n        where γ=(M_Z^0 / M_Z^')^2 (Z^0 is the SM vector boson).\n        Note, that the left- and right-handed SM couplings g_L and g_R are related to the vector and axial-vector couplings defined in Eq.(<ref>) according to\n        \n        \n            g_L = g_V+g_A/2  ,      g_R = g_V-g_A/2.\n        \n        \n         §.§ E_6 models\n        \n        \n        Turning our attention to GUTs, we are intended to explore potential signatures–detectable at the DUNE-ND via  measurements–that could arise from the new interactions predicted in the presence of the primordial E_6 gauge symmetry. Being a rank-6 group, E_6 yields two novel neutral gauge bosons associated to the two new hypercharges, namely χ and ψ, which follow from the respective extra U(1) symmetries present in E_6/SO(10) and in SO(10)/SU(5), see e.g. Ref. <cit.>. The corresponding  quantum numbers for Y_χ and Y_ψ are listed in Table <ref>. As explained in Ref. <cit.>, in the low-energy\n          regime E_6 yields a single U(1) symmetry that is written as a combination of \n          U(1)_χ and U(1)_ψ symmetries.  Then, a one-parameter family of models is defined with hypercharge \n        \n        \n            Y_β =Y_χcosβ +Y_ψsinβ  ,\n        \n        where Q=T^3+ Y represents the charge operator. \n        \n        \n        The modifications to the SM  couplings that follow from the low-energy effective Lagrangian have been previously written as <cit.>\n        \n            f_L    = g_L+ ε_L  ,\n            \n            f_R    = g_R+ ε_R  ,\n        \n        where the new E_6-induced contributions take the form\n        \n        \n            ε_L=    2 γsin ^2θ_W(3 c_β/2 √(6)+s_β/3√(5/8))^2  , \n            ε_R=    2 γsin ^2θ_W(c_β/2 √(6)-s_β/3√(5/8))(3 c_β/2√(6)+s_β/3√(5/8))   ,\n        \n        while γ is defined as previously and the abbreviations c_β=cosβ, s_β=sinβ have been used. While any value of cosβ is allowed, here we will focus on the three most notable E_6 models i.e., the (χ, ψ, η ) model with    cosβ=(1, 0, √(3/8)) <cit.>. Notice that for cosβ = - √(5/32) a full cancellation occurs and  is not sensitive to E_6 models for this particular case.\n        \n        \n        \n        \n        § STATISTICAL ANALYSIS\n        \n        \n         §.§ Simulation of  signal at the DUNE-ND\n        \n        \n        Neglecting acceptance and resolution effects (see the discussion below) the expected event rates with respect to the electron recoil energy at DUNE-ND can be evaluated from the expression\n         \n        \n            [dN/d T_e ]_λ =t_run  N_e N_POT∑_α∫_E_ν^min^E_ν^maxdE_νdΦ_ν_α(E_ν)/dE_ν[dσ_ν_α/d T_e ]_λ ,\n        \n        where t_run and N_e stand for the total running period of the experiment and the number of electron targets at the 75 ton ^40Ar DUNE-ND, while dΦ_ν_α(E_ν)/dE_ν is the corresponding incoming neutrino flux for the different flavors ν_α taken from <cit.>. Here N_POT=1.1 × 20^21 denotes  the number of protons on target (POT) per year assuming a 120 GeV proton beam <cit.>. The lower integration limit is trivially obtained from the kinematics of the process and reads E_ν^min = ( T_e + √(T_e^2 + 2 m_e T_e))/2, while the upper limit corresponds to the endpoint of the incoming neutrino energy distribution. Finally, λ accounts for SM interactions as well as the various new physics interactions predicted within the context of NGI, or E_6 and LR symmetries. Following Ref. <cit.>, we consider a recoil energy threshold T_e^th=50 MeV and restrict our analysis in the range T_e^th≤ T_e ≤ T_e^max with T_e^max=20 GeV. For the various On-Axis and Off-Axis locations, example spectra as a function of the total electron energy E_e = T_e + m_e are shown in Figs. <ref> and <ref> which correspond to the neutrino and antineutrino modes, respectively. For the sake of comparison between the different NGIs X={S,P,V,A,T}, the differential event rates are presented as normalized distributions in order to make evident the various spectral shapes. Moreover, the upper (lower) panels are plotted assuming a small (large) mediator mass of m_X=10 MeV (m_X=1 GeV) from where a significant dependence on the mediator mass is found.\n        \n        \n        \n        \n        As recently pointed out in Ref. <cit.>, the main backgrounds coming from charged-current quasielastic (CCQE) neutrino scattering on LArTPC and π^0 missidentification can be vetoed by a cut on E_e θ_e^2 <cit.>, where θ_e denotes the scattering angle.  Therefore, in what follows we choose to express the  signal in terms of the quantity E_e θ_e^2.  From the kinematics of the process one has 1 - cosθ_e = m_e 1-y/E_e, where y= T_e/E_ν denotes the inelasticity which takes values in the range T_e^th/E_ν≤ y ≤ 1. Since  is forward peaked, the electron recoil energy can be expressed in terms of E_e θ_e^2 as T_e = E_ν(1 - E_e θ_e^2/2 m_e) with  E_e θ_e^2 < 2 m_e being an upper limit imposed by the kinematics of the process. Therefore, for the DUNE-ND it is more convenient to evaluate the expected neutrino signal in E_e θ_e^2 space  through the expression\n         \n        \n            [dN/d E_e θ_e^2]_λ =t_run  N_e N_POT∑_α∫_E_ν^min^E_ν^maxdE_νdΦ_ν_α(E_ν)/dE_ν[dσ_ν_α/d E_e θ_e^2 ]_λ ,\n        \n        where \n        \n            dσ_ν_α/d E_e θ_e^2  = E_ν/2 m_edσ_ν_α/d T_e |_T_e = E_ν(1 - E_e θ_e^2/2 m_e)  .\n        \n        We have verified that the effect of energy resolution σ_E_e/E_e = 10% / √(E_e/GeV) considered in Refs. <cit.> is negligible, in agreement with Ref. <cit.>, thus in our analysis only the effect of angular resolution will be considered.  On the other hand, regarding the scattering angle taking a usual Gaussian function can overestimate the smearing of the angular resolution, since the azimuthal angle is important when applying the smearing.  For this reason, the finite angular resolution of DUNE-ND is taken into account by following closely the procedure of Ref. <cit.>. Taking the neutrino beam to be in the ẑ direction and letting the true scattering angle to be θ_e^t, the true electron momentum vector is simply written as p̂^t_e=(sinθ_e^t  x̂,0,cosθ_e^t ẑ). The latter is related to the reconstructed momentum vector through the relation <cit.>\n        \n            p̂_e^reco=R_ŷ(θ_t)R_ẑ(ϕ_2)R_ŷ(θ_1)R_ŷ(-θ_e^t)p̂^t_e ,\n        \n        where R_î(α) denotes the rotation matrix about the axis î through the angle α, while the reconstructed angle θ_e^reco is given by θ_e^reco=cos^-1(ẑ·p̂_e^reco). The rotations are performed in order to have control on the smearing. In particular, R_ŷ(-θ_e^t) rotates the electron momentum in the z-axis. The next two rotations are performed to apply the smearing, first around the y-axis to modify the polar angle, and the second around the z-axis to modify the azimuth. The final rotation is performed to undo the first rotation. \n        \n        We calculate the reconstructed event spectrum based on the following procedure. First, we choose randomly the electron recoil T_e and initial neutrino E_ν energies in a given bin of (E_ν, T_e) from which we determine the values of the electron energy E_e and the true polar angle theta θ_e^t. Then, we calculate the true (E_e θ_e^2)^t event spectrum that corresponds to the given (E_ν, T_e) bin using Monte Carlo integration. For each bin, we furthermore evaluate the reconstructed electron momentum by performing the rotations given in Eq.(<ref>) as follows: for each θ_e^t, we choose a new angle θ_1 from a Gaussian distribution with σ_θ being the angular resolution, while a new angle ϕ_2  is randomly chosen from a uniform distribution within [0, 2π]. Then, we obtain the reconstructed angle θ_e^reco from which we construct the (E_e θ_e^2)^reco event spectrum in the given (E_ν, T_e) bin. We finally repeat the procedure for the other bins and sum up the individual event spectra.\n        \n        \n        \n        \n        \n        \n        Assuming purely SM interactions, the expected event spectra at DUNE-ND corresponding to the different On-Axis and Off-Axis locations are depicted as a function of the true (E_e θ_e^2)^t (blue) and reconstructed (E_e θ_e^2)^reco (red) in Fig. <ref>. The calculation assumes 1 yr in neutrino mode (solid lines) and 1 yr in antineutrino mode (dashed lines), while for each mode the detector is assumed to be located half time On-Axis with the rest time shared between the various Off-Axis locations. As can be seen from the plot, the effect of angular smearing is rather significant allowing the calculated event spectra to extend far beyond the physical cutoff E_e θ_e^2 < 2 m_e, as expected when resolution effects are ignored.[We have verified that our calculated event spectra are in excellent agreement with Ref. <cit.>.] From the calculated spectra, it can be deduced that the expected signal will be dominated by the On-Axis induced-events which amounts to 82% (81%) of the total signal for the case of neutrino (antineutrino) mode.   Unless otherwise mentioned, in the remainder of the paper the present calculations will always assume reconstruction only for the case of the scattering angle, while the superscript “reco\" is dropped for convenience.\n        For completeness, we also show the expected  event rates projected in the reconstructed scattering angle and reconstructed electron energy space in the left and right panel of Fig. <ref>, respectively. We find that most of the electrons will scatter within a forward cone with angle 10–20 mrad with respect to the incident neutrino beam, while their angular distribution will not extend beyond 150 mrad. Regarding the electron energy distribution, most of the scattered electron population will have E_e ≤ 5 GeV, while for energy E_e ≥ 10 GeV the expected  signal is practically zero. A comparison of the E_e θ_e^2, θ_e and E_e distributions between the different locations is given in the Appendix <ref>. \n        \n        \n        \n        \n        \n        Turning to beyond the SM scenarios, in Fig. <ref> we illustrate the expected NGI event spectra, calculated for the benchmark parameters g_X=5.7· 10^-5 and m_X=10 MeV. The pure SM spectra are superimposed for comparison. It is also interesting to notice the effect of destructive interference for the case of the axial interaction. If present, NGIs may induce spectral features which makes them particularly interesting. For instance, the shapes of the scalar and pseudoscalar spectra are characteristically different compared to those of the rest interactions, as shown in the left and right panels of Fig. <ref> assuming g_X=4.5· 10^-4 and m_X=150 keV. Interestingly–and unlike the previous case–for the latter benchmark point a constructive interference is found for both vector and axial vector cases.\n        \n        \n        \n        \n         §.§ Sensitivity analysis at DUNE-ND\n        \n        Having developed the necessary machinery for accurately simulating the expected event spectra we proceed by performing a sensitivity analysis of the physics scenarios in question with the goal to explore the attainable sensitivities at DUNE-ND.\n        To this purpose,  we rely on the following χ^2 function fitting simultaneously On-Axis and Off-Axis spectra and using shape and normalization information\n        \n        \n            χ^2 = 2 ∑_k = ν/ν̅ ∑_j= loc ∑_i=1^20[N^ijk_exp - N^ijk_obs  + N^ijk_obs logN^ijk_obs/N^ijk_exp] + ( α_1/σ_α_1)^2 + ( α_2/σ_α_2)^2   ,\n        \n        where the index i runs over the reconstructed E_e θ_e^2 bins for which we consider 20 evenly spaced values in the range [0, 10 m_e], while  j runs over the different On-Axis and Off-Axis locations of the ND i.e. {0,6,12,18,24,30} m, and finally k accounts for neutrino and antineutrino mode. Here, the expected number of events are taken to be N_exp = N_SM· (1+ α_1) + N_bkg· (1+α_2) with the background events being the sum of CCQE and missidentified π^0 events as N_bkg = N_π^0^missID + N_CCQE. For the observed events we consider the sum of SM and new physics  events namely N_new that we add to the background events. Note, that  N_new=N_SM + N_X(g_X, m_X)  for X=S,P,T since there is no interference between the interaction X and the SM, while for X=V,A, due to interference with the SM one has  N_new=N_X(g_X, m_X), i.e the SM contribution is included in N_X. Similarly, for the case of E_6 one has N_new=N_E_6(m_Z^', cosβ) while for left-right symmetry N_new=N_LR(m_Z^'). We furthermore consider two nuisance parameters α_1 and α_2 with σ_α_1=5% and σ_α_2= 10% to account for the normalization uncertainties of the DUNE neutrino flux and background, respectively.\n        \n        At this point we wish to devote a separate paragraph in order to discuss our current assumptions regarding the background event rates. Since we have not available background events corresponding to the various Off-Axis locations we simply rescale the On-Axis background rates by the exposure time, achieving a conservative estimate. While this approximation neglects the shape of the background events corresponding to Off-Axis locations, we however expect this to have a rather negligible impact on our sensitivities for the following reasons. First because our sensitivities are dominated by the On-Axis events, and second because we expect that shape uncertainties are indirectly accounted for in the rather large background normalization uncertainty.\n        \n        \n        \n         §.§ Other experiments\n        \n        \n          §.§.§ COHERENT\n           \n        \n        The COHERENT collaboration has measured  events on a 14.57 kg CsI <cit.> detector and on a 24 kg liquid argon (LAr) <cit.> detector, both located at the Spallation Neutron Source (SNS).\n        \n        At the SNS muon neutrinos are produced from pion decay at rest (π-DAR) π^+ →μ^+ + \n        ν_μ which are prompt with the beam, while delayed ν_e and ν̅_μ are generated from the subsequent muon decay μ^+ → e^+ + ν_e + ν̅_μ. We employ the Michel spectrum which adequately describes the neutrino distributions <cit.>.\n        \n        We simulate the event spectra for the CsI[For CsI, we consider the full data reported in 2021 <cit.>.] and LAr COHERENT detectors taking into account the detector specifications, systematic uncertainties and backgrounds[Namely, steady state backgrounds and beam related neutrons.] and we express our reconstructed signal using the time and energy binning reported by the corresponding data release (see Refs. <cit.>). In particular, for the CsI measurement we consider 11 time bins in the range [0,6] μ s and 9 energy bins expressed in photoelectrons (PE) in the range [0,60] PE. Similarly for the case of LAr we consider 10 time bins in the range [0,5] μ s and 12 energy bins expressed in units of electron equivalent energy in the range [0,120] keV_ee.\n        \n        An as realistic as possible sensitivity analysis is performed following the analysis strategy of Ref. <cit.>. Let us finally note that even though our results regarding COHERENT are mainly driven by the CsI data, we nonetheless perform a combined analysis of CsI+LAr data.\n        \n        \n          §.§.§ Dresden-II\n        \n        For the first time, a suggestive evidence of  was recently announced by the Dresden-II Collaboration using reactor antineutrinos  <cit.>. The experiment used a 3 kg germanium detector exposed to reactor antineutrinos emitted from the Dresden-II boiling water reactor, and collected data for an ON/OFF period corresponding to 96.4/25 days. Due to its close proximity to the reactor core the experiment is dominated by epithermal neutron backgrounds and electron capture peaks in ^71Ge. During the beam ON period a very strong preference over the background-only hypothesis was found in the data that is consistent with a CEνNS-induced signal in the low-energy measured spectrum, while the data collected during the beam OFF period are consistent with the null hypothesis. We consider the antineutrino spectrum from  Ref. <cit.> taking into account all the relevant fissible  isotopes, i.e., ^235U, ^238U, ^239Pu, ^242Pu  and ^238U(n, γ) as well as the natural abundances of Ge, as done in Ref. <cit.>. To simulate the background, we reproduce the background model parametrized in terms of seven free parameters as detailed in the supplemental material of Ref. <cit.>. Our simulated signal is then expressed in terms or reconstructed electron equivalent energy using 130 bins evenly distributed over the range [0.2,1.5] keV_ee.  Finally,  our statistical analysis proceeds through a simultaneous fit of background model parameters and new physics model parameters following Ref. <cit.>.\n        \n        \n        \n        \n        \n          §.§.§ TEXONO\n        \n        \n        \n        In the present work we also consider existing data of measured \n         events reported by the TEXONO collaboration <cit.>. The experiment observed  exploiting reactor antineutrinos emerged from the Kuo-Sheng Nuclear reactor using a 187 kg CsI(Tl) detector. \n        \n        Unlike the Dresden-II case, for the case od TEXONO we adop the reactor antineutrino energy distribution  from <cit.> for  E_ν> 2 MeV, while for E_ν < 2 MeV we consider the theoretical estimations from Ref. <cit.> and we finally assume an overall normalization of  6.4 × 10^12 cm^-2 s^-1.\n        \n        Our simulated signal is expressed in units of events/(kg· day · MeV) for which we consider 10 bins in the range [3,8] MeV following Ref. <cit.>, while our statistical analysis is based on the assumptions of Ref. <cit.>.\n        \n        \n        \n        \n        \n        § RESULTS AND DISCUSSION\n        \n        \n        We now turn to our statistical analysis, by first focusing on the NGI sensitivities. Figure <ref> illustrates the excluded regions at 90% C.L. after 7 yrs of neutrino data collection at DUNE-ND, for the various interactions X.  We have verified that the sensitivity remains essentially unchanged when a total running time of 5 yr (neutrino mode) + 5 yr (antineutrino mode) is assumed. To highlight the impact of angular resolution, the results are demonstrated for the case of ideal resolution (dashed lines) as well as for σ_θ = 1^o (solid lines), from where a slight reduction of the sensitivity reach  becomes evident. The depicted contours allow for a relative comparison of the expected sensitivity on the various NGIs from where it can be deduced that the least (most) constrained is the scalar (tensor) case. This is due to the fact that the scalar cross section is suppressed by a factor m_e T_e/E_ν^2 compared to the leading terms of either vector, axial vector or tensor cross sections. Similarly, the pseudoscalar interaction is suppressed by a factor T_e^2/E_ν^2 compared to the latter ones (the scalar is suppressed by a factor 2 m_e/T_e compared to the pseudoscalar case).  Before we proceed–and in connection to the background-related discussion made above–let us stress that we have furthermore checked that increasing the background by a factor two has no visible impact on the results.\n        \n        \n        \n        \n        \n        It is interesting to compare the attainable DUNE-ND sensitivities obtained in this work with existing constraints coming from further experimental probes. As pointed out in Ref. <cit.> for the case of  the general vector case discussed up to now is identical to the anomaly-free vector B-L scenario, thus in order to compare our present results we choose the latter. Then, in Fig. <ref> we show the limits for the case of vector B-L (top-left), U(1)_L_μ - L_τ  (top-right) gauge symmetric models and scalar (bottom) mediators  by superimposing existing limits from various experimental probes.  Specifically, we compare the DUNE-ND with low-energy neutrino experiments such as those looking for  like COHERENT <cit.> and solar neutrinos e.g. Borexino <cit.>. The COHERENT (combined CsI+LAr data) sensitivities for the vector B-L and scalar cases are taken from the analysis of Ref. <cit.> [Let us note that Ref. <cit.> obtained constraints for the general vector case, which here is recasted to the B-L case as follows: for m_V > 300 keV which corresponds to the CEνNS-induced region, the B-L COHERENT limit is roughly obtained from the general vector case reported in <cit.> through the shift g_B-L≈ 3 g_V, while for m_V < 300 keV corresponding to the low-energy EνES-induced region it holds  g_B-L = g_V. Finally the narrow region corresponding to destructive interference (see the left panels of Figs.8 and 10 in Ref. <cit.>) is irrelevant for B-L considered here.], while for the L_μ - L_τ scenario the sensitivities are extracted in the present work following the analysis of the latter study. Similarly, the XENONnT and LZ constraints for the vector and scalar cases are adapted from Ref. <cit.>, while the  L_μ - L_τ constraints are obtained for the first time in this work.[Projected sensitivities from futuristic measurements at direct dark matter detection experiments are reported in Ref. <cit.>.] Turning to solar neutrino analyses, for the vector B-L case the constraints are taken from Ref. <cit.> which performed a spectral analysis of Borexino Phase-II data, while the   L_μ - L_τ limits are taken from the analysis of  Ref. <cit.>. We furthermore show the corresponding limits obtained  from high energy collider data, recasted to the vector B-L case using the https://gitlab.com/philten/darkcastDarkcast software package.  Specifically, we illustrate limits from  electron beam-dump  experiments <cit.> as well as limits from ATLAS <cit.> extracted from dielectron resonance measurements. Also shown are existing B-L limits from  BaBar <cit.>, CMS <cit.> and LHCb <cit.> Dark Photon analyses. Regarding L_μ - L_τ, we include limits from BaBar <cit.>, CMS <cit.>, and ATLAS <cit.> obtained from 4 μ searches and LHCb <cit.>.[These limits are obtained from A^'→μ^+ μ^- and recasted to the L_μ - L_τ scenario.]  Finally the limits on (g-2)_μ are obtained based on the Appendix B of Ref. <cit.>.  As a general remark, it should  be stressed that in all cases, DUNE-ND is expected to place competitive constraints to those derived from low-energy solar, dark matter direct detection and  experiments and complementary to high energy colliders.\n        \n        A few comments are in order. The NGI cross section is enhanced significantly for low T_e, thus making the dark matter direct detection experiments favorable locations to probe the parameter space with very low masses m_X. Indeed, as can be seen from the plots, LZ and XENONnT dominate the limits for low mediator masses because of their very low-energy threshold detection capabilities. On the other hand, COHERENT dominates the limits in the parameter space for m_X >10 MeV. However, it is important to clarify that CEνNS-based limits such as those coming from COHERENT are extracted from nuclear recoil measurements, and therefore they apply only under the assumption of universal couplings between the mediators X=S,P,V,A,T and electrons g_e X or quarks g_q X. Thus, in the general case the DUNE-ND by  exploiting the highly intense LBNF beam–which peaks in the ballpark of few GeV neutrino energy–has the prospect to place the most stringent limits for m_X > 100 MeV up to few GeV.\n        It is also interesting to notice that for the special case of L_μ - L_τ symmetric model, DUNE-ND is expected to rule out the COHERENT limits with significant complementarity to LZ, XENONnT and Borexino. This is mainly because of the highly intense muon neutrino beams available at Fermilab. For the scalar case instead, the projected DUNE-ND sensitivities will not offer competitive sensitivities compared to direct dark matter detection experiments.\n         \n        \n        \n        \n        \n        \n        We are now turning our attention on exploring the sensitivity of DUNE-ND on LR and the various E_6 models. In this case, the phenomenological parameter of interest is the mediator mass entering through the parameter γ= (M_Z^0/M_Z^')^2. By performing a χ^2 analysis in the same spirit as previously, we obtain the sensitivity profiles depicted in the left panel of Fig. <ref>. As can be seen the least (most) stringent constraints on the mediator mass correspond to the  ψ (χ) case of E_6 symmetry. In the right panel of Fig. <ref> we demonstrate a comparison of the LR sensitivities between DUNE-ND and the other neutrino scattering experiments explored in the present study such as COHERENT, Dresden-II and TEXONO. We find that DUNE-ND will be able to place the most stringent constraint on Z^' mass.  Let us also note that for the case of  the relevant expressions for calculating the E_6 and LR contributions are given in the Appendix <ref>. \n        \n        In the lower panel of of Fig. <ref> we explore the full spectrum of E_6 models by allowing the value of cosβ to vary freely. The corresponding allowed areas extracted in the present work by analyzing the COHERENT, Dresden-II and TEXONO data are superimposed for comparison. Likewise the LR case, the projected DUNE-ND sensitivities are promising to improve by a factor ∼ 2 compared to those of the latter experiments. As can be seen there is a sharp sensitivity loss  for cosβ=- √(5/32) due to the cancellation involved in both  and  cross sections as explained previously. Moreover, the COHERENT and Dresden-II experiments have zero sensitivity on the ψ model since another cancellation is involved in the  cross section for cosβ=0 on the relevant couplings, see e.g.  Eqs.(<ref>), (<ref>) in Appendix <ref> and Ref. <cit.>. Hence, we conclude that DUNE-ND is not only expected to improve over previous constraints but at the same time it is clearly complementary to existing  measurements. Before closing, a summary of our results regarding the DUNE-ND sensitivity on E_6 and LR models along with a comparison with the rest neutrino experiments analyzed in the present work is given in Table. <ref>.\n        \n        \n        \n        \n        § CONCLUSIONS\n        \n        \n        In this work we have simulated EνES-induced signals in the context of model-independent NGIs that are expected to trigger the DUNE-ND. To this purpose, we performed Monte Carlo simulations of the reconstructed signal in E_e θ_e^2 space taking into account detector-specific effects such as angular resolution, systematic uncertainties and realistic backgrounds on the analysis of On-Axis and Off-Axis spectra. For the first time, we have examined the prospects of constraining light axial-vector, scalar, pseudoscalar and tensor mediators at the ND complex using  events. Moreover, we considered particular models such as those arising from U(1)_B-L,  U(1)_L_μ - L_τ, LR  and E_6 gauge symmetries. We have furthermore performed a comparison of the projected DUNE-ND sensitivities with additional experimental probes. In particular we considered the  data from the reactor neutrino experiment TEXONO,  data from COHERENT and Dresden-II, solar neutrino data from Borexino, low-energy data from direct dark matter detection experiments such as XENONnT and LZ as well as high-energy collider data. In all cases we find that by exploiting the intense LBNF neutrino beam in conjunction with the multi-ton Liquid Argon detector, DUNE-ND has promising prospects to constrain a considerable part of the parameter space in question, offering complementary results to low-energy neutrino and direct dark matter detection experiments. We finally conclude that future DUNE-ND data will offer a powerful tool for placing the most stringent constraints in the range m_X >100 MeV up to few GeV  regarding NGIs as well to improve the current bounds on the vector boson mass M_Z^' by a factor of two in the context of LR and E_6 symmetric models.\n        \n        \n        \n        § ACKNOWLEDGEMENTS\n         \n        We are indebted to Yuber F. Perez-Gonzalez for valuable discussions regarding the event rate reconstruction procedure. We also thank the authors of Ref. <cit.> for useful correspondence.\n        This work was supported by the Hellenic Foundation for Research and Innovation (H.F.R.I.) under the “3rd Call for H.F.R.I. Research Projects to support Post-Doctoral Researchers” (Project Number: 7036).\n        \n        \n        \n        \n        \n        § NORMALIZED PDF EVENT SPECTRA AT DUNE-ND\n        \n        \n        \n        \n        Figure <ref> shows the reconstructed SM  signal events as a function of the electron energy E_e (left), scattering angle θ_e (center) and  E_e θ^2 space (right), after 3.5 years of data collection in neutrino mode. The results are presented for the various On-Axis and Off-Axis locations, as done in Figs. <ref> and <ref> . However, here they are illustrated as  normalized PDFs in order to appreciate the spectral shape differences among the various detector locations. As expected, when projecting to E_e, the On-Axis (30 m) event spectra appear as having the wider (narrower) distribution since the On-Axis neutrino energy distribution peaks at higher energy. The opposite behavior is found in the scattering angle projected PDF spectra. The latter is  understood since the On-Axis event spectra are the most boosted ones, and therefore they will be detected with smaller scattering angles. Finally the E_e θ_e^2 projection appears as the combination of the E_e and θ_e distributions. \n        \n        \n        \n        \n        § RELEVANT EXPRESSIONS FOR CEΝNS\n        \n        \n        The SM  cross section in terms of the nuclear recoil energy T_A reads\n        \n            (d σ/dT_A)_SM = G_F^2 M/π𝒬_V^2 (1 - M T_A/2 E_ν^2)    ,\n        \n        with M being the nuclear mass, |𝔮⃗|= √(2 M T_A) denotes the magnitude of the three-momentum transfer and \n        𝒬_V is the vector weak charge written as\n        \n        \n            𝒬_V =  [ 2(g_u^L + g_u^R) + (g_d^L + g_d^R) ] Z F_Z(|𝔮⃗|^2)  + [ (g_u^L + g_u^R) +2(g_d^L + g_d^R) ] N  F_N(|𝔮⃗|^2)   .\n        \n        Here, F_Z(|𝔮⃗|^2) and F_N(|𝔮⃗|^2) are the nuclear form factors for protons and neutrons, respectively, while the vector weak charge 𝒬_V is expressed in terms of the P-handed couplings  for the quark q={u,d}  as\n        \n        \n            g_u^L =   ( 1/2-2/3sin^2 θ_W )    ,\n            \n            g_d^L =   ( -1/2+1/3sin^2 θ_W )   ,\n            \n            g_u^R =   (-2/3sin^2 θ_W )     ,\n            \n            g_d^R =   (1/3sin^2 θ_W )   .\n        \n        In the context of LR symmetry, the SM couplings g_q^P are substituted by the corresponding f_q^P as <cit.>\n        \n            f^L_u=   𝒜 g_u^L + ℬ g_u^R  , \n             \n            f^L_d=   𝒜 g_d^L + ℬ g_d^R  ,\n            \n            f^R_u=   𝒜 g_u^R + ℬ g_u^L  , \n             \n            f^R_d=   𝒜 g_d^R + ℬ g_d^L  ,\n        \n        where the 𝒜 and ℬ parameters are defined as in Eq.(<ref>).\n        \n        \n        For the case of the E_6 model, the SM  couplings are modified as follows\n        \n        \n            f_u^L =    g_u^L + ε_u^L   ,\n            \n            f_d^L =    g_d^L + ε_d^L   ,\n            \n            f_u^R =    g_u^R + ε_u^R   ,\n            \n            f_d^R =    g_d^R + ε_d^R   ,\n        \n        \n        where the new physics is encoded in the ε_q^P couplings according to <cit.>\n        \n            ε_u^L=   -4 γsin^2 θ_W (c_β/√(24)-s_β/3√(5/8))(3 c_β/2 √(24)+s_β/6√(5/8))   , \n            ε_d^R=   -8 γsin^2 θ_W (3 c_β/2 √(24)+s_β/6√(5/8))^2  , \n            \n            ε_d^L=   ε_u^L=-ε_u^R   .\n"}