{"entry_id": "http://arxiv.org/abs/2303.07088v1", "published": "20230313131743", "title": "Differential voltage analysis for battery manufacturing process control", "authors": ["Andrew Weng", "Jason B. Siegel", "Anna Stefanopoulou"], "primary_category": "eess.SY", "categories": ["eess.SY", "cs.SY"], "text": "\nHarris' criterion and Hardy inequalites on graphs\n    Marcel Schmidt\n    \n=================================================\n\n\n\n\n\nVoltage-based battery metrics are ubiquitous and essential in battery manufacturing diagnostics. They enable electrochemical “fingerprinting” of batteries at the end of the manufacturing line and are naturally scalable, since voltage data is already collected as part of the formation process which is the last step in battery manufacturing. Yet, despite their prevalence, interpretations of voltage-based metrics are often ambiguous and require expert judgment. In this work, we present a method for collecting and analyzing full cell near-equilibrium voltage curves for end-of-line manufacturing process control. The method builds on existing literature on differential voltage analysis (DVA or dV/dQ) by expanding the method formalism through the lens of reproducibility, interpretability, and automation. Our model revisions introduce several new derived metrics relevant to manufacturing process control, including lithium consumed during formation and the practical negative-to-positive ratio, which complement standard metrics such as positive and negative electrode capacities. To facilitate method reproducibility, we reformulate the model to account for the “inaccessible lithium problem” which quantifies the numerical differences between modeled versus true values for electrode capacities and stoichiometries. We finally outline key data collection considerations, including C-rate and charging direction for both full cell and half cell datasets, which may impact method reproducibility. This work highlights the opportunities for leveraging voltage-based electrochemical metrics for online battery manufacturing process control.\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nDecreasing the cost and environmental footprint of battery “gigafactories” worldwide relies on continuously improving the manufacturing process through data-driven process control. To place the scale of manufacturing data in context, consider a battery factory that supplies enough cells to produce one electric vehicle (EV) per minute <cit.>. Since the number of cells needed for each EV is on the order of hundreds for pouch cells and thousands for cylindrical cells, the cell production rate would need to exceed ∼100 cells per minute for pouch cells and ∼1,000 cells per minute for cylindrical cells. Every cell produced will generate voltage and current time-series data as part of the formation process, which is the last step of battery manufacturing when cells are charged for the very first time to create the solid electrolyte interphase (SEI) <cit.>.\n\nVoltage and current data from the battery formation process can be continuously and automatically collected, stored, and analyzed to develop smart manufacturing process specifications or tolerances, ensuring that all cells leaving the factory have a guarantee on performance, lifetime, and safety <cit.>. Using voltage-based measurements is appealing from a manufacturing standpoint since they can be measured using existing formation cyclers. This data may be directly collected as part of the formation protocol or immediately after the formation protocol completes but before the cells are taken off of the formation cyclers <cit.>. Thus, collecting voltage-based data bears no additional capital costs to a factory. Since the number of formation cyclers grows with the production volume, the voltage-based metrics will also naturally scale as factory throughput increases. \n\nWhen full cell voltage data is carefully collected and analyzed, they can be used to derive physically-interpretable, electrochemical metrics, or features, that provide insights into the thermodynamic and kinetic properties of the cell. A slow-rate (C/20) full cell voltage curve can, for example, be analyzed using incremental capacity analysis (ICA) <cit.> or differential voltage (dV/dQ) analysis <cit.> to understand thermodynamic cell properties such as active material losses and lithium inventory losses. The data can be collected immediately after the formation cycles complete. Unlike cell dissections and electrode harvesting, voltage-based analysis is non-destructive. The same cell that is analyzed in manufacturing can thus be tracked throughout its remaining life, either through accelerated cycle life testing in a lab or through fleet telemetry of real-world usage inside of an EV. The ability to establish an electrochemical “fingerprint” on the pristine cells immediately after manufacturing can help improve lifetime prediction models <cit.> which, in turn, be can be used to improve the manufacturing process.\n\nHowever, caution is needed when setting manufacturing specifications based on voltage-based data. Without careful data collection and interpretation, manufacturing tolerances may be set too tightly, increasing reject rates and lowering production throughput, or too loosely, which may increase production throughput in the short term but lead to lifetime and safety issues after years of usage in the field. Ultimately, manufacturing specifications must also be set based on an understanding of long-term consequences to performance, lifetime, or safety. The voltage-based electrochemical features can facilitate understanding trade-offs between production throughput and long-term reliability, but only if they are carefully designed and interpreted.\n\nWe note that voltage-based electrochemical features do not replace the need for more advanced end-of-line metrology methods in the factory, including X-ray <cit.> and ultrasonic imaging <cit.>, which may be necessary for catching non-electrochemical related cell defects. Rather, the voltage-based features complement root-cause analyses by providing basic electrochemical metrics about the system such as the as-manufactured electrode capacities, cyclable lithium inventory, and negative-to-positive ratio (NPR).\n\nCurrently, factories are not taking full advantage of voltage-based measurements at the end of line which may be relevant to long term cell lifetime and durability, partly owing to difficulties in data interpretation. Resolving the complex electrochemical details using full-cell voltage data alone is inherently challenging, since these measurements reflect a combination of thermodynamic and kinetic factors originating from nearly every cell component and their interactions with each other. These inherent difficulties are compounded by a general lack of clear literature guidance on best practices for collecting and analyzing voltage data. As a result, commonly reported electrochemical metrics derived from voltage data, such as modeled electrode capacities from dV/dQ analysis often differ in both data collection and analysis methods, limiting their interpretability and reproducibility. To overcome these challenges, recent work, such as those by <cit.> are essential for enabling reproducible extraction of electrochemical features derived from voltage data.\n\nThe goal of this work is thus to guide experimental and analysis considerations needed to enable reproducible voltage-based battery manufacturing diagnostics. To accomplish this, we revisit a popular analysis technique through the lens of battery manufacturing: the differential voltage analysis, or dV/dQ, model. We will detail the experimental and analysis considerations to facilitate data reproducibility and interpretability.\n\n\n\n§ A MANUFACTURING CASE STUDY\n\n\n\nHere, we showcase an example of how the differential voltage analysis method can be used for continuous monitoring of cell electrochemical features at the end of the manufacturing process. We highlight the various electrochemical metrics, or features, that can be extracted using the method and their significance for manufacturing process control. \n\nThe study consists of two cell batches made on the same manufacturing line and made using the same active materials ( positive electrode and graphite negative electrode). However, the two cell batches were made two years apart and differed in cell design parameters, including electrode loading targets and number of layers. Cells from the first batch, from <cit.>, had nominal capacities of 5.0 Ah and were built in 2018 (n=21). Cells from the second batch, from <cit.>, had nominal capacities of 2.37 Ah and were built in 2020 (n=40). For these cells, we restricted the cell population to those having full cell data collected at room temperature (RT) (n=20) to match the measurement conditions from <cit.>. A table comparing relevant design parameters is given in Table S1. We will refer to these two datasets as Mohtat2021 and Weng2021, respectively.\n\nFigure <ref> shows the general analysis workflow and lists the electrochemical features extracted by the model. In this example, full cell voltage data (V_full) was collected on every manufactured cell after the formation cycling completed (Section <ref>). Each dataset was analyzed using the differential voltage analysis model (Section <ref>). The model consisted of two pre-computed functions,  and , representing the positive and negative electrode near-equilibrium reference potential curves, respectively (Section <ref>). The same functions were used to analyze data from both Mohtat2021 and Weng2021, since the batches shared the same positive and negative electrode chemistries.\n\n\n\nThe differential voltage model was then used to extract electrochemical features which include positive and negative electrode capacities (Q̃_p, Q̃_n), the capacity of lithium available for cycling (Q̃_Li), the capacity of lithium lost to the SEI (Q̃_SEI), electrode lithium stoichiometries when the full cell is discharged (x̃_0, ỹ_0), and cell design information including the practical negative-to-positive capacity ratio (NPR_practical) and the excess negative electrode capacity (Q̃_n,excess). The `tildes' on each variable name indicate that they are estimates which may be different from the true parameters due to the “inaccessible lithium problem,” which will be further explained in Section <ref>. These extracted features can then be analyzed to determine whether machine parameter adjustments are needed in upstream manufacturing processes such as those in electrode coating or in electrolyte fill (E-fill). \n\nFigure <ref> show an example data visualization of the analysis outputs. An example model fitting result is also provided in Figure S1. Panel A uses box-and-whisker plots to compare compares several example metrics derived from the differential voltage analysis, including Q̃_p, Q̃_n, Q̃_SEI, and NPR_practical. The full-cell C/20 discharge capacity, Q_full, is also provided for reference. Since the Mohtat2021 and Weng2021 cells used different numbers of electrode sheets, all of the capacity values reported here have been normalized to the respective electrode areas, enabling a head-to-head comparison.\n\nThe following sections discusses how to interpret each group of features in the context of manufacturing process control.\n\n\n\n\n\n\n §.§ Monitoring Electrode Capacities and Loadings\n\n\n\nFigure <ref>A shows extracted values of positive and negative electrode capacities, Q̃_n and Q̃_p, for every cell in this study. In a manufacturing context, the availability of data on Q̃_n and Q̃_p on every batch of cells in production, without needing cell dissections, can help to identify deviations from electrode loading set-points, e.g. due to electrode processing variations. These electrode-level variations would be difficult to detect by relying on full cell capacity check data alone, since capacity variability at the electrode level may not manifest in full cell capacity checks (Section <ref>).\n\nWe also found that the Mohtat2021 cells had, on average, 16% higher positive electrode areal capacity and 17% higher negative electrode areal capacity compared to the Weng2021 cells. However, according to the cell design parameters (Table S1), Mohtat2021 cells should have only 7% higher positive electrode areal capacity and 9% higher negative electrode areal capacity based on differences in the active material loading targets. The gap between the the targeted and modeled capacities suggest that the as-built cells did not match their target loadings, and that electrode coating process parameters may need to be adjusted.\n\n\n\n §.§ Monitoring Lithium Consumed During Formation\n\n\n\nFigure <ref>A also compares the amount of lithium consumed during formation, Q̃_SEI, for all cells in this study. For the Mohtat2021 cells, the mean value was measured to be 0.35 mAh/cm^2, while the Weng2021 cells measured 0.12 mAh/cm^2. Mohtat2021 cells thus lost nearly three times more lithium during formation than compared to the Weng2021 cells. This result can be verified graphically by inspecting the voltage curve alignments from the fitting results which shows that the positive electrode is less lithiated at 0% SOC, reflecting the fact that extra lithium was irreversibly consumed to form the SEI and cannot return to the positive electrode on discharge (Figure S1). The increase in lithium consumption rate during the formation of the Mohtat2021 cells suggests a poorer quality of electrolyte or a less passivating negative electrode formulation. Note that both cell builds shared the same formation protocol, so differences in lithium consumption cannot be attributed to differences in the formation protocol. This example highlights a scenario in which the electrolyte filling process parameters may need to be inspected, or the quality of the electrolyte itself may need to be verified.\n\nThe increased lithium consumption in the Mohtat2021 cells also helps to explain why, although the Mohtat2021 cells had 16% higher positive electrode areal mass loading than the Weng2021 cells, the full cell capacities of the Mohtat2021 cells were only 3% higher on average. Thus, although the Mohtat2021 cells were designed with higher areal capacities than the Weng2021 cells, most of the benefits to full cell capacity were lost due the increased lithium consumption rate during formation.\n\n\n\n §.§ Measuring “Margin to Lithium Plating” Using the Practical NP Ratio\n\n\n\nSince the Mohtat2021 cells had consumed more lithium during formation compared to the Weng2021 cells, the Mohtat2021 negative electrodes will also be less lithiated when the full cell is charged to 100% SOC. The Mohtat2021 cells will therefore have a wider margin of negative electrode capacity before the negative electrode is fully lithiated and lithium plating begins to occur, a result that can be visually seen in Figure S1. Thus, Mohtat2021 cells should, in theory, be less prone to lithium plating compared to the Weng2021 cells. \n\nA metric that quantifies the capacity margin before lithium plating occurs is the negative to positive ratio (NPR). The differential voltage analysis provides such a metric, known as the practical NPR, or NPR_practical, which we develop in Section <ref>. The  for Mohtat2021 cells was measured to be 1.24, compared to 1.14 for the Weng2021 cells, confirming that the Mohtat2021 cells have a higher negative electrode capacity margin to protect against lithium plating. In order for the Weng2021 cells to achieve the same  as the Mohtat2021 cells, either the positive electrode loading target would need to decrease, or the negative electrode loading target would need to increase. \n\n\n\n §.§ Electrode Manufacturing Variability\n\n\n\nTurning to Figure <ref>B, we next show how the differential voltage analysis outputs can be used to identify differences in electrode manufacturing variability from batch to batch. We immediately see that Mohtat2021 cells showed higher variability in the full cell capacity. The histograms of Q̃_n and Q̃_p reveal that the origin of the higher full cell capacity variability stems from the positive electrode loading, not the negative electrode loading. In fact, the negative electrode loading for Weng2021 cells had higher variability compared to the Mohtat2021 cells, yet this increased variability did not manifest in the full cell capacity. This result is expected considering the fact that the practical NP ratio of all cells are greater than 1, and hence, variations in the negative electrode capacities will mainly manifest in the excess negative electrode capacity rather than the full cell capacity. Thus, to decrease the full cell capacity variability in the Mohtat2021 cells, the manufacturer should focus on tightening the variability in the cathode manufacturing process, not the anode manufacturing process.\n\n\n\n §.§ Parameter Correlations\n\n\nFigure <ref>B finally presents correlation plots between every individual output variable of the differential voltage analysis model. One application of studying correlations is to understand which electrode-level parameters correlate to full cell capacity and hence directly impacts measurable cell performance. The correlation matrix reveals that, within each batch of cells, the positive electrode capacity correlates to full cell capacity. However, the correlation breaks when comparing across different batches of cells since the Mohtat2021 consumed more lithium during formation (Section <ref>). This result highlights the reality that multiple cell manufacturing factors, including electrode loadings, lithium consumption during formation, and the negative electrode excess capacity, all play a role in determining the full cell capacity. Achieving a certain full cell capacity outcome therefore requires coordinated control across multiple manufacturing processes.\n\nIn summary, this section highlighted the utility of applying the differential voltage analysis method to extract electrochemical metrics at the end of the cell manufacturing line. These metrics can then be directly used to adjust process upstream manufacturing process parameters such as those in electrolyte manufacturing or electrolyte filling. All of the data presented in this section were directly outputted from the differential voltage method without needing any electrode-level degradation analysis. Since the method can run on data collected during battery formation, no additional work is necessary to extend the analysis to new cells coming off the manufacturing line, making the method highly scalable.\n\n\n\n\n\n§ DIFFERENTIAL VOLTAGE ANALYSIS METHOD\n\n\n\n\n\n §.§ Model Selection\n\n\nNear-equilibrium (i.e. slow-rate) full cell voltage curves have been widely used to understand dominant cell degradation modes such as loss of active material (LAM) and loss of lithium inventory (LLI) <cit.>. The appeal of these techniques is easy to appreciate: full cell data is easier and faster to collect than materials-level characterization data which often requires cell tear-down and electrode harvesting. Such types of analyses have been introduced under different names, including differential voltage analysis (DVA or dV/dQ) <cit.>, incremental capacity analysis (ICA) <cit.>, open-circuit voltage models <cit.>, and voltage-fitting analysis <cit.>. While all of these methods rely on full cell voltage curve data, their data analysis approaches are different. In differential voltage (or dV/dQ) methods, the voltage is differentiated with respect to capacity and plotted against capacity. The resulting data reveals peaks and troughs that can be attributed to either the positive or negative electrode. In incremental capacity (or ICA) methods, the capacity is differentiated with respect to voltage and plotted against voltage. The features observed from ICA are no longer linearly separable, but through careful data interpretation, distinct degradation modes can still be inferred <cit.>. Other variations of differential analysis have also been recently introduced which leverage signals such as expansion <cit.> and pressure <cit.>, but since these methods require measurements beyond full voltage, they are omitted from present consideration.\n\nSince the exact method for extracting the electrode-level parameters vary from author to author, comparing results across different papers is complicated. Notably, some authors use full cell data alone, assigning features of interest and graphically inferring degradation metrics such as lithium inventory and electrode capacity losses <cit.>, while others leverage half-cell “reference curves” <cit.> to build a model of the full cell voltage as a function of the electrode-level parameters <cit.>. \n\nIn a battery manufacturing context, a quantitative and reproducible voltage-based analysis method is needed. The method must be quantitative in order to resolve minute differences in manufacturing process parameters which could have large, long-term consequences to battery performance, lifetime and safety. The method must also be reproducible in order to scale. \n\nOut of all of the available voltage curve analysis methods, the “voltage fitting method”, documented by <cit.>, provides the best balance between mathematical rigor and interpretability. We therefore choose this method as the basis for extracting electrochemical features for manufacturing diagnostics. Note that, in this work, we use the words “differential voltage analysis” and “voltage fitting analysis” interchangeably since they refer to the same fundamental model construction.\n\n\n\n §.§ Model Formulation\n\n\n\nThe differential voltage model seeks to decompose the full cell near-equilibrium (i.e. open circuit) voltage curve into its constituent half-cell positive and negative potential curves vs Li/Li^+. The half-cell curves, also sometimes called “reference curves” <cit.>, then provide information about thermodynamic states of the cell, including positive and negative electrode capacities, positive and negative electrode lithium stoichiometries as a function of the full cell state of charge (SOC), and the capacity of cyclable lithium inventory.\n\n\n\nWe now proceed with a quantitative treatment of the model, using Figure <ref> as a visual guide. The fundamental state equation of the model is an assertion of voltage conservation between the half-cell near-equilibrium potentials and the full cell near-equilibrium potential given by\n\n\n    V_full(q) = (y) - (x),\n\n\nwhere V_full is the full cell near-equilibrium (i.e. open-circuit) voltage and  and  are the positive and negative electrode near-equilibrium potential curves versus Li/Li^+, respectively. q is a vector of capacities in the full cell domain and is related to the cell SOC, z ∈ [0,1], by the relation\n\n\n    z = q/Q_full\n\n\nwhere Q_full is the measured capacity of the full cell. x∈[0,1] and y∈[0,1] are vectors of lithium stoichiometries in the negative and positive electrodes, respectively. Note that x and y are sometimes also reported as θ_n and θ_p by other authors. The lithium stoichiometries are governed by the half-cell reactions\n\n\n    xLi^+ + xe^- + C_6 →Li_xC_6            (Negative, charging)\n    LiM→Li_yM + (1-y)Li^+ + (1-y)e^-           (Positive, charging),\n\n\nwhere the first reaction represents the intercalation of lithium into graphite, and the second reaction describes the release of lithium from any intercalation positive electrode such as (NMC), nickel cobalt aluminum (NCA), iron phosphate, etc. \n\nEquation <ref> assumes that both electrodes are at near-equilibrium, meaning that the current densities used to acquire the curves are sufficiently small so that over-potential contributions can be neglected. Note that while some authors attempt to use V_full to extract kinetic information such as resistance increase <cit.>, we focus our analysis on extracting only thermodynamic quantities to limit the number of modeled output parameters and improve solution uniqueness. To ensure negligible kinetic effects, V_full(q) must be collected at a sufficiently slow rate (see Section <ref>). The reference half-cell curves (y) and (x) may be obtained experimentally, e.g. via coin cell testing (see Section <ref>).\n\nThe terms in Equation <ref> can be mapped to a common, full capacity basis q. Charge conservation requires that this mapping be affine (linear plus an offset). We can therefore define the following basis transformation equations:\n\n\n    x(q)    = x_0 + q/Q_n\n    \n        y(q)    = y_0 - q/Q_p,\n\n\nwhere Q_n and Q_p are the total negative and positive electrode capacities, respectively, and (x_0,y_0) are the negative and positive electrode stoichiometries in the fully discharged state. These equations are derived under the boundary condition that q = 0 corresponds to the fully discharged state, with (x,y) = (x_0,y_0). Equations (<ref>, <ref>) can be inverted to obtain\n\n\n    q(x) = Q_n(x - x_0) \n    \n        q(y) = Q_p(y_0 - y),\n\n\nwhich can be used to map lithium stoichiometries to the shared capacity basis. Note that, under this construction, q is allowed to take on negative values. For example, when x=0, q = -Q_nx_0 < 0, according to Equation <ref>. Negative q values can be interpreted as “virtual capacities,” that is, capacity present in the electrodes but is inaccessible from the perspective of the full cell due to the full cell minimum voltage constraint. \n\nWe can also define a complementary set of variables describing the lithium stoichiometries in the fully-charged state, (x_100,y_100), which can be written as\n\n\n    x_100   = x_0 + Q_full/Q_n\n    \n        y_100   = y_0 - Q_full/Q_p.\n\n\nQ_full is a known quantity from the full cell data and is not considered to be a modeled parameter. Hence, (x_100,y_100) are not independent model parameters. \n\nIn summary, knowledge of four parameters\n\n\n    θ = {Q_n, Q_p, x_0, y_0}\n\n\nprovides a complete description of the model from Equation (<ref>). These parameters bear physical meaning, since (Q_n,Q_p) are related to the total electrode capacities and (x_0, y_0) predict lithium stoichiometry-dependent electrode potentials. These model parameters can then be used to derive additional electrochemical features relevant to battery manufacturing diagnostics, as will be described in Section <ref>. \n\nNote that the choice of model parameters are not unique. For example {Q_n, Q_p, x_100, y_100} is an equally valid set of parameters. For the remainder of this work, we will continue to use the {Q_n, Q_p, x_0, y_0} basis with the recognition that the model can always be reformulated using another set of four basis states using Equations (<ref>,<ref>).\n\nThe goal of the model is then to identify a unique combination of model parameters θ that provides the best fit against the measured voltage data. The optimization problem can be solved by implementing an error function\n\n\n    E(q : θ) = (y_0 - q(y)/Q_p) - (x_0 + q(x)/Q_n)_V_full(q) - V_meas(q),\n\n\nwhere V_meas(q) is the experimentally-measured full cell voltage curve and the domain of q is now restricted to the full-cell domain spanning (0,Q_full). The model returns an optimal parameter-set which minimizes an error function of the form\n\n\n    θ_opt = *argmin_θ∑_q(λ|E(q : θ)|^2 + (1-λ)|dE(q : θ)/dq|^2).\n\n\nThe first term inside the summation is the voltage error and the second term represents the differential voltage error. λ∈ [0,1] is a weight parameter, i.e. when λ=1, the contribution from the differential voltage signal is ignored. The optimization problem can be solved using standard non-linear least-squares solvers which are available in most scientific programming languages such as Python or Matlab. Note that, in Figure <ref>, plotted full cell voltage data corresponds to the modeled data, and the measured voltage data is omitted for simplicity. A real-world comparison of measured versus modeled full cell voltages is available in Figure S1. \n\nVariations the optimization method exist in the literature. For example, <cit.> set λ=1 and implemented additional constraints based on full cell voltage limits, i.e. V_max = (y_100) - (x_100) and V_min = (y_0) - (x_0). With this approach, the model-predicted full cell capacity is guaranteed to match the measured value. However, solution convergence becomes more challenging in the presence of these additional constraints which could make the solution space ill-conditioned. <cit.> included the differential voltage (dV/dQ) curves in the error function to assign preferential weight the phase transition features (Figure <ref>B) and to negate the effects of impedance mismatch between the full cell and coin cell form factors. However, these dV/dQ methods reported previously are generally not fully automated, often requiring manually adjusting model parameters through graphical user interfaces <cit.> and evaluating goodness-of-fit by visually inspecting peak alignments. Overall, a “one-size-fits-all“ optimization scheme is not known to exist yet. The specific details of the optimization may therefore need to be tuned to perform optimally for a given system.\n\n\n\n §.§ Model Extension: Accounting For the Inaccessible Lithium Problem\n\n\n\nSo far, we have laid the groundwork for the differential voltage analysis method. In this section, we outline a fundamental challenge with interpreting and reproducing model outputs known as the “inaccessible lithium problem.” This issue was alluded to by <cit.> and recently expanded upon by <cit.>. In this section, we first describe how this issue affects interpretation of the model outputs in a manufacturing context. We then propose corrections to the differential voltage analysis model to clarify the interpretation of the model outputs.\n\nThe “inaccessible lithium problem” is summarized as follows. The model state equation assumes that  and  are defined for the entire range of lithium stoichiometries spanning y∈[0,1] and x∈[0,1], respectively. Yet, half-cell potential curves are generally experimentally unattainable over the entire range of stoichiometries. For example, for layered oxide positive electrode systems such as NMC, full delithiation would render the host material thermodynamically unstable, impacting the reversibility of lithium intercalation reaction. Full lithiation of the layered oxide particles is also experimentally challenging due to massive kinetic limitations towards the fully lithiated state <cit.>. These kinetic limitations explain why it is so difficult to “fully discharge” a positive electrode half cell; even when discharging at small C-rates, the potential tends to rebound above 3V vs Li/Li^+ after resting. \n\nNear-equilibrium potential data on layered-oxide positive electrodes can only be feasibly obtained within a restricted stoichiometry window, which is determined by the voltage limits of coin cell data collection. Defining  and  as the minimum and maximum observable lithium stoichiometry in the positive electrode, it must be the case that > 0 and < 1. An analogous situation applies to the graphite negative electrode, with > 0 and < 1, though the resulting errors from assuming ≈ 0 and ≈ 1 are generally understood to be more benign, since lithium transport in graphite is generally more facile.\n\nTo proceed with the analysis, practitioners must either implicitly or explicitly assume that the tested range of potentials (e.g. 3.0V to 4.3V for layered oxide positive electrodes) correspond to the full range of lithium stoichiometries, i.e.\n\n\n    (, , , ) ≈ (0, 1, 0, 1),\n\n\nand proceed with the analysis method as described in Section <ref>. However, this simplification will lead to errors in the model outputs. To demonstrate the magnitude of this error, we compare the positive and negative electrode capacities calculated using differential voltage analysis from Section <ref> to the true electrode capacities, which can be calculated by combining the theoretical capacities with the cell design parameters, according to:\n\n\n    Q = m · f · n_faces· A · Q_theor,\n\n\nwhere Q is the electrode capacity in Ah, m is the electrode areal loading target in g/cm^2, f is the mass fraction of active material in the electrode, n_faces is the number of active electrode faces, A is the electrode area per face, excluding overhanging regions, in cm^2, and Q_theor is the theoretical capacity of the material in Ah/g. \n\nThe resulting calculations, summarized in Table <ref>, show that the estimated positive electrode capacity is only 54% to 55% of the true positive electrode capacity, while the estimated negative electrode capacity is 87% to 89% of the true negative electrode capacity. This result was demonstrated on both the <cit.> and the <cit.> datasets, suggesting some level of generality. The gross underestimation of positive electrode capacity can be primarily attributed to the fact that the layered oxide  positive electrode material used in these works retain significant lithium inventory even above the coin cell upper cut-off potential of 4.3V vs Li/Li^+, and consequently, ≫ 0.\n\n\n\nWe thus conclude that ignoring the inaccessible lithium problem (Equation <ref>) will likely lead to inaccurate reporting of true electrode capacities and stoichiometries, especially for layered oxide positive electrode materials such as NMC. This issue could affect the ability to directly use modeled electrode capacities to convert into electrode loadings using Equation <ref>. Unfortunately, the inaccessible lithium problem is a fundamental limitation of the coin cell data collection process used to initialize V_pos and V_neg in the model.\n\nKnowing that the inaccessible lithium problem can lead to large errors in the model outputs (x, y, Q_n, Q_p), we reformulate the model by defining `tilde' variables (x̃, ỹ, Q̃_n, Q̃_p), to represent estimated parameters. The state equation can then be re-written as:\n\n\n    V_full(q) = (ỹ) - (x̃)\n\n\nwhere \n\n\n    x̃(q)    = x̃_0 + q/Q̃_n\n    ỹ(q)    = ỹ_0 - q/Q̃_p.\n\n\nThis modified system is identical to the original system, but recognizes the fact that the modeled lithium stoichiometries and electrode capacities may, in general, be different from the true values which are not observable due to the limitations in coin cell data collection for  and . \n\nThe estimated parameters can then be related to the true parameters by the following relations:\n\n\n    Q̃_p    = Q_p(-) \n    Q̃_n    = Q_n(-) \n    ỹ_0 - ỹ_100   = y_0 - y_100/ - \n    x̃_0 - x̃_100   = x_0 - x_100/ - .\n\n\nThis system of equations has more unknowns than equations, highlighting the difficulty in recovering the true parameters from the model alone. Ideally, the true lithium stoichiometries may be experimentally measured, e.g. via inductively coupled plasma optical emission spectroscopy (ICP-OES) <cit.>. True capacities may also be calculated using information about the electrode design (Equation <ref>). Without more measurements, further assumptions are needed to fully resolve the estimated model parameters, e.g. x̃_100≈ x_100 and ỹ_0≈ y_0.\n\nDespite the data interpretation challenges introduced by the inaccessible lithium problem, we highlight several applications of the model outputs which remain unaffected by this problem. First, calculations of differences in electrode capacities are not affected. This is because the error terms in Equations <ref> and <ref> cancel when taking ratios of capacities. This fact explains why literature reports of losses of active material (LAM) and our analysis of electrode capacity loading differences from Section <ref> are still valid even though the inaccessible lithium problem may render absolute values of Q_n and Q_p inaccurate. Second, the inaccessible lithium problem also does not impact the process of searching for an optimal set of model parameters (Equation <ref>) since the domain for optimization is strictly only within the full cell capacity window, i.e. q ∈ (0, Q_full). Missing data beyond the limits of the observable full cell voltage data is therefore inconsequential to the optimization. \n\nOverall, the inaccessible lithium problem effectively introduces an optional post-processing step in which the model output parameters may be converted into true parameters using Equations <ref>, <ref>, <ref> and <ref>. This final step would require additional input not provided for by the differential voltage model. Yet, even without knowing the true model parameters, the estimated model outputs remain useful for estimating differences in parameters such as electrode capacities. The main contribution of the model extension, including the introduction of the tilde variables, is thus to clarify that the model outputs must be interpreted as estimates of the true values due to the limitations in constructing  and  from data.\n\n\n\n\n §.§ Extended Model Outputs for Manufacturing Diagnostics\n\n\n\nThis section defines and discusses several additional electrochemical features relevant for battery manufacturing process control: the lithium consumed during formation () the practical negative-to-positive ratio () and the total cyclable lithium inventory (). These features can be calculated directly from the optimized parameters of the modified model θ̃_opt = {Q̃_n, Q̃_p, x̃_0, ỹ_0}. In light of the previous discussion on the “inaccessible lithium problem”, we make a distinction between estimated model parameters, denoted with tildes, and true model parameters. To aid understanding, expressions in this section will be given for both true values and estimated values, where appropriate.\n\n\n\n  §.§.§ Lithium Consumed During Formation\n\n\nThe capacity of lithium consumed during formation, , is analogous to the first cycle Coulombic efficiency metric <cit.>, defined as ratio of discharge and charge capacity during formation. However, unlike Coulombic efficiency, which requires slow-rate charge-discharge cycles to calculate,  provides a consistent measure of lithium consumption even when the formation protocol consists of complex charge-discharge cycles involving multiple C-rates and partial SOC windows, as is the case with modern formation protocols <cit.>. Conveniently, since  can be obtained through the analysis of voltage data after formation completes, this metric enables the recovery of information about lithium consumed during formation even if formation data is missing.\n\nWe define the estimated capacity of lost lithium inventory due to formation, Q̃_SEI, as\n\n\n    Q̃_SEI   = q() - q() \n       = q(x̃ = 1) - q(ỹ = 0)\n\n\nThis formula can be understood by considering that, before formation, the positive electrode stoichiometry is at its highest value, y_max, since all of the cyclable lithium has not yet left the positive electrode. For the same reason, the negative electrode stoichiometry is at its lowest value, x_min. After formation completes, the lithium lost to the SEI will not return to the positive electrode during discharge, causing the highest possible stoichiometry value in the positive electrode to decrease by q() - q(). Equation <ref> can alternatively be interpreted as the capacity of unoccupied lithium sites in the positive electrode when the negative electrode is fully delithiated. \n\nWe note that the calculation assumes that the positive electrode voltage curve and capacity is unchanged during formation. Previous studies have shown that this assumption may not be true <cit.>, which would introduce another error contribution to this calculation which warrants further studies. From a manufacturing standpoint, if the positive electrode system is known to be the same from batch-to-batch, then  may still be used to detect differences in the SEI formation process. \n\n\n\n  §.§.§ Re-Interpreting the Negative to Positive Ratio\n\n\n\nThe negative to positive ratio (NPR) is a common term used in battery design and generally refers to the ratio of negative to positive electrode capacities. The optimization of NPR is sometimes referred to as `capacity balancing' <cit.>, not to be confused with the process of balancing series-connected cells. Conventional wisdom suggests that the NPR be must greater than one to prevent over-lithiation of the negative electrode during charging. Increasing NPR also implies less utilization of the negative electrode, which could be advantageous in silicon-containing systems where volume expansion is a major contributor to cycle life degradation <cit.>. However, increasing the NPR requires putting in more negative electrode active material into the cell without increasing usable energy content, which decreases the cell energy density. Adding more negative electrode loading could also increase the surface area for SEI reactions which could be detrimental to calendar life. The NPR is therefore a critical cell design metric that should be optimized and tracked during manufacturing.\n\nIn this section, we first review the most commonly-held definition of the NPR and identify some conceptual gaps preventing a clear interpretation of this metric. We then propose a revised, more practical definition of the NPR which enables a more physically-grounded assessment of the lithium plating risk. \n\nIssues With Conventional Definitions of NPR. To begin, consider a common definition of the NPR based on areal loadings and theoretical electrode capacities:\n\n\n    NPR_theor = m_nQ_n,theor/m_pQ_p,theor.\n\n\nIn this equation, m_n and m_p are the electrode active material mass loadings in grams, and Q_n,theor and Q_p,theor are the theoretical capacities in units of mAh/g. Applying this formula to the example |graphite systems from <cit.> and <cit.> yields calculated NPR values of 0.62 for Mohtat2021 and 0.63 for Weng2021 (Table <ref>). This result would suggest that these cells designs have undersized negative electrode capacities and are at risk for lithium plating. However, this assessment assumes that all of the theoretical capacity of the  positive electrode (279.5mAh/g) can be utilized, which is not true due to the inaccessible lithium problem (Section <ref>). This definition of NPR, while theoretically valid, is therefore not practically useful in a manufacturing context.\n\nRepeating the calculation but using the estimated values Q̃_n and Q̃_p to define\n\n\n    NPR_conventional = Q̃_n/Q̃_p\n\n\nleads to yet another definition of NPR found in literature. This definition partly excludes the inaccessible lithium in the positive electrode since Q̃_p and Q̃_n are bounded by observable potentials in the coin cell data used to construct  and , respectively. However, this definition remains ambiguous because the calculated value of NPR will change based on the choice of potential ranges chosen for the half-cell reference potential curves which can vary across different datasets. NPR definitions based on (Q̃_n, Q̃_p) therefore do not guarantee reproducibility across different authors and datasets.\n\nDefinition of Practical NPR. In this section, we develop a practically relevant and consistent definition of the NPR, which we call “Practical NPR.” We first return to the original motivation of comparing relative loadings of positive and negative electrode capacities from a cell design perspective, which is to determine whether the negative electrode will become over-lithiated when the cell is fully charged to 100% SOC. A sensible boundary condition is to set the NPR equal to unity if the negative electrode is completely lithiated when the full cell is at 100% SOC (i.e. x_100 = 1). An NPR greater than 1 would then indicate that there exists some excess negative electrode capacity at 100% SOC, which can serve as a margin to protect again lithium plating during charge. \n\nUnder this construction, we realize that a practical NPR definition must then be dependent on two factors: the voltage at which 100% SOC is defined, and how much lithium was consumed during formation. The voltage at which 100% SOC is defined becomes relevant since higher voltages requires more utilization of both the positive and the negative electrodes, thereby decreasing the excess negative electrode capacity. How much lithium was consumed during formation becomes relevant because more lithium consumed during formation decreases the negative electrode lithium stoichiometry in the fully charged state, x_100, which effectively increases the negative electrode excess capacity. In fact, since SEI formation continues over the life of the cell, x_100 will continue to decrease, which will effectively increase the negative electrode excess capacity over life. Loss of negative active material, on the other hand, could have the opposite effect by shrinking the negative electrode curve <cit.>.\n\nOverall, a practical NPR definition cannot be a static metric, but one which changes after formation and over the life of a cell based on the competition between different degradation modes such as lithium inventory loss and active material loss.\n\nGiven the above realizations, we now define the Practical NPR as\n\n\n    NPR_practical = 1 + Q̃_n,excess/Q_full,\n\n\nwhere\n\n\n    Q̃_n,excess   = q() - q(x_100)  \n       = q(x̃=1) - q(x̃_100)\n\n\nrepresents the measured excess capacity in the negative electrode when the cell is fully charged. The Practical NPR correctly accounts for the sensitivity to the full cell upper cutoff voltage window, where increasing voltage windows leads to decreasing NPRs (i.e. less protection against lithium plating). The definition is also sensitive to changes in the electrode stoichiometries (x_100) over life, and is therefore able to account for the increase in the Practical NPR over life as lithium loss shifts x_100 to lower values over life.\n\nApplying the Practical NPR definition to the dataset from Weng2021 and Mohtat2021 yields values of 1.14 and 1.24. This calculation shows that, after formation, the Mohtat2021 cells have more negative electrode excess capacity than the Weng2021 cells. The difference between the calculated practical NPRs can be attributed to more lithium consumed during formation for the Mohtat2021 cells (Section <ref>), which increased the negative excess capacity (Section <ref>). By contrast, none of the other definitions of NPR could distinguish this fact, since those definitions do not consider the lithium lost during formation.\n\nA summary comparison of different NPR calculation methodologies is provided by Table <ref>.\n\n\n\n\n\n  §.§.§ Total Cyclable Lithium Inventory\n\n\nThe total cyclable lithium inventory in the system is imperative to track over life, since lithium inventory depletion is a primary reason for capacity loss in standard lithium-ion batteries <cit.>. <cit.> proposed that the total cyclable lithium inventory can be accounted for from the equation \n\n\n    Q̃_Li = x̃_0Q̃_n + ỹ_0Q̃_p.\n\n\nIn this equation, the first term captures the lithium trapped in the negative electrode due to the full cell minimum voltage constraint. Meanwhile, the second term includes both the cyclable lithium within the full cell operating voltage window and the inventory of lithium above the full cell maximum voltage. To gain a deeper intuition into Equation (<ref>), we can rewrite the same equation on the basis of the shared capacity vector q as\n\n\n    Q̃_Li    = [q() - q(y_100)]_V > V_max + [q(y_100) - q(y_0)]_Cyclable + [q(y_0) - q()]_V < V_min\n        = q() - q().\n\n\nEquation <ref> shows that the total lithium inventory consists of three components: the lithium available in the positive electrode above the full cell upper cut-off voltage (first term), the lithium available within the full cell voltage window (second term), and the lithium available in the negative electrode below the full cell lower cut-off voltage (third term). Note that if ≈ 0 is assumed, then the third term drops out and Q_Li becomes simply a statement of the total lithium inventory remaining in the positive electrode after discounting for lithium lost to the SEI. By combining Equations (<ref>) and (<ref>), it can be verified that \n\n\n    Q̃_p = Q̃_Li + Q̃_SEI,\n\n\nwhich clarifies the fact that all of the lithium inventory in the system originates from the positive electrode.\n\n\n\n  §.§.§ Note on Degradation Diagnostics: From Absolute Capacities to Capacity Losses\n\n\nThe differential voltage analysis method may be repeated on full cell voltage datasets collected over the course of a cycle life or calendar aging test for the aged cell system. Taking {Q̃_n', Q̃_p', Q̃_Li'} to be model outputs from the aged cell, the following familiar quantities can be defined <cit.>:\n\n\n    = 1 - Q̃_n'/Q̃_n\n       = 1 - Q̃_p'/Q̃_p\n       = 1 - Q̃_Li'/Q̃_Li,\n\n\nwhere  is the loss of active material in the positive electrode,  is the loss of active material in the negative electrode, and  is the loss of lithium inventory. Conveniently, these equations are equally valid for both true model parameters (e.g. Q) and observed model parameters (e.g. Q̃), and therefore, the `inaccessible lithium problem' introduced in Section <ref> does not affect the numerical outcome of the study of capacity losses over the lifetime of a cell. \n\nFinally, we note that the definition of lithium inventory loss given by Equation <ref> does not provide any information on where the lithium is physically lost. It is generally understood that a primary pathway for lithium loss is through electrolyte reactions at the negative electrode to form the SEI. However, lithium can also be irreversibly trapped in the negative and positive electrodes due to electrical isolation of particles, which could occur either due to physical fracturing of active material particles <cit.> or islanding of entire particles due to loss of adhesion to the binder material <cit.>. A more general expression for the loss of lithium inventory can be expressed as the sum of lithium trapped in each component:\n\n\n    LLI = LLI_pos + LLI_neg + LLI_SEI + LLI_plating.\n\n\nIn this equation, the first two terms represent lithium trapped inside lithiated but electrically-isolated positive and negative electrode particles, the third term represents the lithium trapped in the negative electrode SEI <cit.>, and the last term represents dead lithium lost to lithium plating <cit.>. It is important to recognize that  differential voltage analysis analysis cannot be used to decompose  or LLI into their constituent parts. Differential voltage analysis thus only reveals the quantity of lithium lost without providing information about where the lithium was lost. This limitation is fundamental to the technique, since different breakdowns of  yield identical voltage features <cit.>. More advanced, materials-level characterization, will be needed to fully understand the sources of lithium loss.\n\n\n\n§ DISCUSSION\n\n\n\n\n §.§ Data Collection Considerations\n\n\n\nCollecting high-quality lab data is a starting point for ensuring that the differential voltage analysis results are reproducible. We therefore dedicate this section to discussing basic experimental considerations to enable reproducible differential voltage analysis for a given cell chemistry, using Figures <ref> and <ref> as guides.\n\n\n\n  §.§.§ Obtaining Full-Cell Near-Equilibrium Potential Curves\n\n\n\nDifferential voltage analysis requires the cell voltage curves to be collected at near-equilibrium conditions so that kinetic effects may be ignored. Without an assumption of near-equilibrium, Equation <ref> would require additional terms to capture overpotential effects, complicating the analysis. A natural question that follows is “at what C-rate does the voltage data needed to be collected at to constitute near-equilibrium conditions?” This question is especially salient in battery manufacturing contexts, where the speed of diagnostic tests need to be as fast as possible. \n\nIn work by previous authors, C-rates ranging between C/20 and C/30 are most commonly used to obtain voltage curves at near-equilibrium conditions. For example, <cit.> used C/25 curves for both differential voltage analysis and incremental capacity analysis, <cit.> used C/30 curves, and <cit.> used a fixed current value which translated into C-rates ranging between ∼C/10 and ∼C/30, depending on the cell type.\n\nUsing our own datasets, we studied the effect of C-rate on the shape of the voltage and differential voltage curves in Figure <ref>. Panel A shows an example charge dataset collected on an |graphite system, with C-rates ranging between 1C and C/100. The result shows that the C/20 charge rate achieves a capacity of 2.50Ah, which is within 1% of the capacity of 2.52Ah measured at C/100. The corresponding differential voltage curves, shown in Panel C, shows that the C/20 rate provides peak features that are closely aligned with the near-equilibrium limit at C/100. (Note that, in this panel, each line is offset by an arbitrary constant α for clarity.) Therefore, in our dataset, C/20 appeared to be a reasonable C-rate to capture a near-equilibrium condition.\n\nWhile C-rates ranging between C/20 and C/30 appear to provide viable input datasets for past work, this result may not always be true for all cell types in manufacturing. Notably, cells having higher energy densities may experience more kinetic limitations, and cells having larger form factors could experience more electrode-level lithium concentration heterogeneities. In both cases, even slower C-rates may be required to resolve the features in the differential voltage plots. Work by <cit.> further suggested that the performance of voltage fitting methods deteriorates at higher C-rates due to peak smearing. Overall, more work is needed to quantify the effect of C-rate on the analysis outputs as well as the generalizability of C-rate setpoints across different cell chemistries and cell designs.\n\nThe directionality of charge must also be considered. Figure <ref>B,D show that the voltage and dV/dQ features on discharge are, similar, but not identical, to those on charge. At C/100, the low-SOC peaks, which correspond to graphite features, appear to have sharper peaks on discharge. An additional peak also appears in the discharge data, which can be attributed to the graphite 2L staging reaction (see Figure <ref>C). Practically speaking, the presence of the charge-discharge asymmetry suggests that the differential analysis outputs may be different depending on whether the charge or discharge curves are used. The extent of these differences should be further studied, which we leave as future work.\n\n\n\n\n\n  §.§.§ Obtaining Half-Cell Near-Equilibrium Potential Curves\n\n\n\nElectrode near-equilibrium potential curves can either be obtained experimentally from scratch using coin cell testing <cit.> or downloaded from open-access databases such as LiionDB <cit.>. In either case, due caution is necessary for several reasons. \n\nFirst, the majority of datasets report half-cell potentials versus lithium stoichiometries, but since there is no common voltage range setting, different half-cell datasets will lead to different modeled outputs for electrode capacities and stoichiometries (see Section <ref>). \n\nSecond, the experimental procedures used to obtain the curves may differ, with some authors using continuous currents, while other authors obtaining `quasi-static', or `pseudo-OCV' curves, by combining data collected after some voltage period at each SOC, similar to the galvanostatic intermittent titration (GITT) technique <cit.>. While the latter method could theoretically provide a more accurate near-equilibrium potential curve, fewer data points are typically collected to ensure the test finishes within a reasonable time. As a result, some characteristic features related to phase transitions in the negative electrode (Figure <ref>C) may be lost <cit.>.\n\nA third reason for exercising caution when using half-cell data obtained from literature is that the current direction is sometimes not reported, yet current direction materially impacts the features seen in the voltage curves. Figure <ref> shows that the current direction influences the voltage (and differential voltage) features for both a graphite negative electrode (Panels A,C) and an  positive electrode (Panels B,D). At the negative electrode, a hysteresis gap between the lithiation and the delithiation curves exists, which persists across consecutive charge-discharge cycles. The characteristic differential voltage feature occurring at ∼2.3 Ah, corresponding to the stage 2 transition, is sharper and higher in magnitude in the lithiation direction. The staging reactions 2 through 4 are also distinctly different. In particular, the staging reaction 2L appears sharper on lithiation and the stage 4L reaction appears sharper on delithiation <cit.>.\n\nAt the positive electrode, a large kinetic limitation is observed at the end of the lithiation curve, causing the lithiation capacity to be measurably lower than the delithiation curve across multiple cycles. The observation of poor kinetics during lithiation of the positive electrode has been experimentally confirmed by <cit.> and thoroughly discussed in <cit.>. \nOverall, charge-discharge asymmetry exists at the material level for both the positive and the negative electrodes. For high-fidelity differential voltage analysis, the current direction used to obtain the electrode potential curves should be aligned against what is used for the full cell. Doing so will improve the model's ability to fully describe the full cell voltage curve using the electrode potential curves.\n\n\n\n\n\n  §.§.§ Data Logging Frequency and Data Smoothing\n\n\nThe data logging rate and filtering method will affect the smoothness of the collected voltage curves and its derivatives. It is generally recommended to over-sample than under-sample to minimize data loss. Noise in the over-sampled data can be overcome by post-processing the data using filtering methods. A common approach is to use a Savitzky-Golay filter <cit.> which is included as part of most scientific programming languages. Note, however, that the process of selecting filtering parameters, such as window size and polynomial order, may introduce distortions in the data, decreasing the reproducibility of modeled results <cit.>. To improve model reproducibility, more studies are needed to understand the degree to which data filtering strategies impact model outputs, which we leave as future work.\n\n\n\n §.§ Comments on Factory Deployment\n\n\n\nHere, we summarize how a battery manufacturer might deploy the differential voltage analysis method in the battery factory for online process control and quality control applications. We also highlight the remaining knowledge gaps that may prevent deployment today which warrant further research.\n\nEnabling the differential voltage analysis in manufacturing requires both half-cell and full-cell data collection. The half-cell data only needs to be collected once. The data, once vetted, can be stored as part of the model input parameters and be re-used to analyze all full cell data belonging to the same family of positive and negative electrode material sets, e.g. across multiple cell batches and production lines.\n\nThe largest barrier to method deployment is then in the acquisition of the full cell near-equilibrium data. As discussed previously, current methods for differential voltage analysis generally require around 20 hours in order to collect the full cell voltage trace. If the measurement method is to be deployed on every cell coming out of formation, then the production throughput will decrease. Considering that the industry trend is to decrease formation times <cit.>, any additional process that will make the total time on test longer may be untenable. \n\nTo improve the adoption of the method, we propose several pathways. First, rather than collecting the full cell voltage data after formation, the voltage data during the formation process itself may be processed for differential voltage analysis. To our knowledge, this method has yet been reported in academic literature, and is the subject of future work.\n\nSecond, a study should be conducted to understand the influence of higher C-rates on the modeled parameters. Historically, some of the challenges with differential voltage analysis arose in the analysis of aged cells, where the effective current density increases as the cell capacity decreases. For example, at 50% capacity retention, a “C/20” charge step would only take approximately 10 hours to complete since the C-rate is defined with respect to the nominal (pristine) cell capacity. In battery manufacturing, we are only concerned with studying the electrochemical state of the pristine cells without consideration for aging. Hence, the C-rates traditionally thought to be necessary to enable differential voltage analysis may be too conservative in a manufacturing context. A future study of the influence of C-rate on the modeled electrochemical parameters will provide some necessary guidance in this direction. \n\nFinally, not every cell may need to be fingerprinted. For example, retaining and measuring several dozen cells (out of hundreds of thousands built per day) could provide enough statistical information to track day-to-day changes in electrochemical process parameters. These measurements can still be made on formation equipment, and would only require a small, dedicated number of formation cyclers, to be withheld for this purpose. This partitioning method can also encourage the adoption of more advanced characterization methods such as computed tomography (CT) <cit.>, ultrasound imaging <cit.>, and strain measurements <cit.>. Measuring all of these parameters on the same cell could enable a more complete perspective on the cell electrochemical and mechanical state, enabling deeper insights. \n\n\n\n §.§ Improving Method Reproducibility\n\n\n\nBesides logistical challenges of deployment, another major and perhaps larger obstacle preventing adoption of the differential voltage method is the difficulties with implementation and interpretation of model outputs. These difficulties stem from a lack of literature guidance on a standard, rigorous method to implement the fitting model and an absence of understanding of how sensitive the model outputs are to small differences in input datasets, including both full cell and half cell data. This work sought to clarify the model interpretation by enabling a quantified understanding of model errors due to the inaccessible lithium problem (Section <ref>). We also discussed elementary data collection considerations needed to enable a working model (Section <ref>).\n\nSeveral avenues may be taken to further improve reproducibility of the electrochemical features derived from the differential voltage analysis method. First, model input sensitivities need to be better understood. This work introduced several input sensitivity considerations including C-rate and current direction (charge versus discharge). However, a discussion on sensitivity to temperature was not covered by this work. Moreover, a quantitative assessment of the input-output sensitivities have not yet been completed. A logical next step is thus to quantify model output differences due to these differences in model inputs. \n\nAnother important consideration involves understanding the optimizer's ability to find the optimal solution θ_opt. Reproducibility requires that there exists a global minimum value of the error function defined by Equation <ref> and that the optimizer can converge to this value. However, in general, neither condition is guaranteed since the objective function is, in general, non-convex. The solution uniqueness for the positive electrode parameters Q̃_p and y_0 may be especially challenging for NMC systems which are relatively featureless (Figure <ref>). Some past efforts have been made to understand how model output parameter uncertainty increased as the data collection voltage window decreased <cit.>. These studies should be expanded. A better understanding here will enable practitioners to quantify how much of the variability in model-predicted outputs, such as those shown in Figure <ref>, are due to true manufacturing variability versus model uncertainty.\n\nFinally, it must be recognized that all of the electrochemical features extracted using the differential voltage model are estimates of the true values (Section <ref>). Experimental verification of model-predicted outputs, such as positive electrode capacity, negative electrode capacity, lithium lost to SEI, cyclable lithium inventory, and negative to positive ratios, can be challenging to obtain, but may be necessary to obtain confidence in the model-predicted outcomes.\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\nThis work clarified how the differential voltage analysis method can be automated to improve online battery manufacturing process control. Using an example manufacturing dataset, we demonstrated how modeled outputs, such as positive and negative electrode capacities, lithium lost to form the SEI, and negative to positive ratios, can be used to gain insight into the sources and consequences of manufacturing variability. In our example, we found that the source of variability in full cell capacity for one batch of cells is due to variations in positive electrode loadings. We also detected a three-fold difference in the amount of lithium consumed consumed to the SEI between two different cell batches, a conclusion we were able to make without observing any data from the formation cycles or using any destructive analytical methods.\n\nTo facilitate adoption of the differential voltage analysis method in manufacturing, we detailed the mathematical formalism required to implement the method as well as the input data requirements. We extended the base model formulation to explicitly account for model parameter errors due to the inaccessible lithium problem. Using the reformulated model, we defined an expanded set of electrochemical features which included the lithium consumed during formation, the practical NP ratio, the excess negative electrode capacity, and the total cyclable lithium. When combined, these features provide a “fingerprint” of the electrochemical state of the pristine cell which can then be used to adjust parameters in various manufacturing steps including electrode manufacturing and the formation process.\n\nBesides clarifying the model implementation details, this work also recognized the importance of obtaining high-quality experimental data, which includes both full cell and half-cell data, to enable reproducible results. We identified several basic data collection considerations, including the C-rate, current direction (charge versus discharge), and data smoothing method, as being potential factors affecting model output reproducibility.\n\nWith an improved awareness of the nuances involved with model construction, model output interpretation, and data collection, the battery community can be better positioned to deploy the differential voltage analysis method in factories, driving continuous improvement in the battery manufacturing process.\n\n\n\n\n\n\n\n§ DATA AVAILABILITY\n\n\nThis study presented datasets from multiple works. The cell test dataset from <cit.> is available at <https://doi.org/10.7302/7tw1-kc35>. The cell test dataset from <cit.> are available for download at <https://doi.org/10.7302/pa3f-4w30>. All source code used to analyze the datasets and generate the plots are available at <https://github.com/wengandrew/dvdq>. The differential voltage analysis code was written in MATLAB. The data post-processing tools and data visualizations were developed in Python.\n\nunsrtnat\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}