{"entry_id": "http://arxiv.org/abs/2303.07087v1", "published": "20230313131428", "title": "Nonlinear heat transfer in tokamak fusion reactors", "authors": ["F. Michael Russell", "Juan F. R. Archilla", "José L. Más", "Rob Witty"], "primary_category": "physics.plasm-ph", "categories": ["physics.plasm-ph", "nlin.PS"], "text": "\n\n\n\n\n\n\n\nSchool of Computing and Engineering, University of Huddersfield, HD1 3DH, United Kingdom\n\n[Corresponding author: ]archilla@us.es\nGroup of Nonlinear Physics, Department of Applied Physics I, Universidad de\nSevilla, ETSI Informática,\n  Avda Reina Mercedes s/n, 41012-Sevilla, Spain\n\nGroup of Applied Nuclear Physics, Department of Applied Physics I, Universidad de\nSevilla, ETSI Informática,\n  Avda Reina Mercedes s/n, 41012-Sevilla, Spain\n\nTree-Meta Systems Ltd., Swindon, SN1 4BG, UK\n\n\n\n\nTokamak fusion reactors produce energetic He ions that penetrate surfaces less than 20 micron and neutrons that spread throughout the reactor. Experiments with similar swift He ions in heavy metals show that the vibronic coupling of nonlinear lattice excitations creates quasi-one dimensional mobile lattice excitations, called quodons, which are decoupled from phonons, move ballistically at near sonic speed and propagate easily in metals and insulators. They can couple to and transport electric charge, which allows their observation in experiments. They rapidly disperse heat throughout a reactor and carry charge through electrical insulators. It is predicted that at high output powers, quodons created by He ions and neutrons might adversely impact on cryogenic systems.\n  \n\n\n 63.20.Pw, \n  63.20.Ry,  \n05.45.-a,\t\n\n\n\n\nNonlinear heat transfer in tokamak fusion reactors\n    Rob Witty\n    March 30, 2023\n==================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nFusion of hydrogen isotopes deuterium and tritium produces 3.5 MeV He ions and 14 MeV neutrons.\nThe aim is to extract as much as possible of this energy to generate electrical power and generate tritium from the lithium isotope ^6Li by neutron capture.\nThe neutrons disperse their energy throughout the reactor, making it difficult to isolate and utilize their energy, leaving the He ions as the dominant source of energy for generation of electrical power. Inevitably, both will predominantly hit and penetrate metallic surfaces where they will lose energy by interactions with atoms as they propagate. It is the nature of these interactions that we examine here, especially the nonlinear interactions associated with very energetic particles.\n\nIt is well known that swift charged particles cause interstitials, ionization, plasmas and phonons when passing through a solid <cit.>.\nAll of these except phonons are highly localised to the path of the moving particle. Typically, a 3.5 MeV He ion penetrates less than 20 microns in a material, the heat generated spreading thereafter slowly by diffusion. The removal of heat from this thin layer can be increased by use of heat-pipes or liquid coolants.\n\nHowever, it has been known for several decades that essentially loss-free transport of kinetic energy is possible following nonlinear atomic interactions involving high energy particles in solids <cit.>. Evidence for this was found in previously unexplained linear, track-like, imperfections in crystals of the layered mineral muscovite <cit.>. Measurements on some of these tracks showed unique evidence of Rutherford scattering, consistent with positrons emitted from decay of ^40K atoms in the crystals <cit.>. Later, evidence for the transport of positive charge resulting from beta-emission also from ^40K, showed that the positive charge was carried by mobile, highly localized, nonlinear lattice excitations called quodons <cit.>. They are consequence of the vibronic coupling of the lattice nonlinear vibrations with an electron of hole  <cit.>.\n\n\n\n\nQuodons remained largely unknown because they occur only within a solid material and when neutral, or carry no charge, they are difficult to observe or detect. Only after they capture a charge can they be detected easily. The remarkable natural process for recording moving positive charges in muscovite enabled quodons to be studied in some detail. Fig. <ref> shows a thin slice of a crystal showing multiple fossil tracks created by a relativistic He ion as it slows down. The vast majority of very high energy particles at 5 km depth underground are neutrinos, which are not recorded, and muons. The muons can create swift protons but much fewer He ions. The rate of energy loss of heavier ions is so high that few manage a path of mm. The decoration on the main track shown is greater than that on singly charged particles. Hence, the track is most likely due to an He ion.\nThe fan-shaped tracks of lattice excitations are typically a few centimetres long. The true picture in three dimensions is like a bottle-brush.\n\nTime-of-flight measurements on quodons created by 4 MeV He ions indicate they move at slightly sub-sonic speed, of between 1 to 2 km/s, as discussed below. The recording process in muscovite operates only at temperatures exceeding 700 K, and some fossil tracks of quodons carrying a positive charge can exceed 0.40 m in length, limited by size of available crystals. This illustrates the stability of quodons against minor lattice defects and decoupling from phonons. This is also demonstrated by the ease with which quodons propagate through interfaces between different materials, often initially delayed by them annealing structure defects <cit.>.\n\n\nThe reality of mobile excitations capable of propagating orders of magnitude further than the stopping range of alpha particles was demonstrated in an experiment in which 5 MeV alphas bombarded, at near grazing incidence, a muscovite crystal edge in a vacuum causing atoms to be ejected from the opposite edge 7 mm distant from the irradiation edge <cit.>. Later was it shown that quodons can capture and carry for considerable distances a negative or positive charge at ambient temperatures without any applied voltage to drive the electric current <cit.>.\n\nOne reason for the difficulty of studying quodons is that they can propagate through electrical insulators, such as used in coaxial cables, thus short-circuiting to ground any charge they might carry <cit.>. Experiments must take this into account. The finding that quodons could exist and carry charge through electrical insulators, such as PTFE <cit.>, led to the development of the triple-filter technique, which enabled conduction-currents to be separated from quodon-currents <cit.>. For the first time, this enabled quodons to be studied in any material. Quodons created by alpha particles in the energy range 0.5 to 5 MeV were found to exist and propagate in metals, semiconductors and insulators, both inorganic and organic. Their fossil tracks in muscovite crystals shows they can be created by energetic collisions as low as 50 eV <cit.>.\n\n\n\n\n§ QUODON TIME OF FLIGHT EXPERIMENT\n\n\nThe approximate speed of quodons in various materials was examined by time-of-flight technique. Figure 2 shows the plot of quodon-current flowing through a copper wire following the start of irradiation with alpha particles at the time indicated by an arrow. The current was detected within 1 second of starting irradiation; it is limited by the shortest sampling rate of one second. Measurements on samples of iron and PTFE with much shorter flight paths gave the same shape of current plot, also limited by the sampling rate. The subsequent decrease in current is due to lack of free electrons available to be carried by the quodons not a decrease in the fluence of quodons, which stays constant. The speed of quodons in copper estimated in this way is of similar magnitude to the sonic speed of 2.3 km/s.\n\nMost quodons are neutral and they acquire an electric charge in the material and also from the alpha particles. The proof is that when the current stabilizes, it equals the fluence of the alphas multiplied by 2e <cit.>, but they are created at the same rate as during the peak current.\n\nBased on experiments with 5 MeV He ions, quodons can exist and propagate through 0.7 m of PTFE, 2 m of iron and 1.1 km of copper, the maximum lengths of samples dictated by limitations of the Faraday Box used <cit.>.  For the first time, we use these results to examine the possible consequences of the generation of quodons in prototype tokamak fusion reactors. For this purpose, we suppose that stable nonlinear lattice excitations, of whatever type of excitation, propagate ballistically at near sonic speed for distances comparable to prototype reactor structures. Since the aim of the reactors is to generate electricity, we examine the limiting case where all the energy of the alphas is deposited in metals. This ignores their energy spectrum from degradation in the plasma. We do this because, for given electrical power output, any reduction in the energy of the He ions leaving the plasma requires an increase in their numbers and thus of quodons.\n\n\n\n\n§ EFFECT OF QUODONS ON A TOKAMAK\n\n\nConsider a tokamak producing 500 MW of electrical power. Future designs of generators might achieve 45% thermal efficiency, needing near 1000 MW of heat. About 80% of this energy comes from neutrons and 20% from He ions <cit.>. \nIn existing designs both the He ions and the neutrons contribute to the creation of quodons. As quodons have both energy and momentum, the efficiency of creation of quodons depends on the atomic mass of the swift particle and the average atomic mass of irradiated material\n\nHence, quodons created by swift He ions will play a major role in transporting heat ballistically from irradiated materials. Experiments showed that quodons cannot propagate through a gas or vacuum. \n\n\n\n\nBased on experimental results <cit.> of irradiating samples of tantalum and tungsten with He ions, each He ion of 3.5 MeV hitting a heavy metal would generate at least 10^4 quodons, each of average energy about 1 eV. The experiments consists of recording the peak quodon current and the fluence of the alphas creating that current in different metals. Qualitatively, they are similar to Fig. <ref>.\n\nThe number of He ions required for 20% of 1 GW is approximately 3.5× 10^20 s^-1\n \n The total number of quodons generated per second at 500 MW power level is then ≃ 3.5×10^24\n \n Hence, the total power carried by quodons created by the He ions is  560 kW \n This is swept through both metals and insulators in the reactor body, causing a progressive rise in temperature of components. For comparison, the total refrigeration power at 4.5 K (helium) at ITER is ≃ 75 kW <cit.>. There is also installed a cooling power of 1300 kW at 80 K (nitrogen). However, as the quodons will get to coldest parts which are in a vacuum system they cannot escape and will dump their energy there. Therefore, it is needed only to consider the cooling power at near zero.\n \nThis simplistic calculation assumes the He ions interact and lose energy individually. In practice, the ions arrive at a location randomly, leading to a spectrum of quodon energies. As there is no know way to stop quodons or concentrate them locally to generate steam,\n \nwe conclude that commercial fusion powers might not be possible with current reactor designs. Here, only the kinetic or thermal energy carried by quodons is considered. Quodons also transport charge and have been shown to propagate through electrical insulators. The effect of quodon-currents on superconducting magnet systems is unknown. Preliminary studies have been made of how to degrade or reflect quodons in an attempt to screen critical components from the expected quodon flux.\n\n\n\n§ CONCLUSIONS\n\nExperiments have shown that irradiating solid materials with helium ions of up to 5 MeV creates mobile nonlinear lattice excitations, called quodons, that move ballistically. They are created by the vibronic coupling of nonlinear lattice vibrations. They can couple with electric charge and transport it, which makes it possible to measure them.\nThese quodons can propagate appreciable distances, of similar scale to components in fusion reactors, in contiguous materials at ambient temperatures. Propagating ballistically, they transport heat much faster than by conduction. They can transport heat through conventional thermal insulating materials as well as through metals. As the thermal power created by fusion devices increases towards commercial power levels, the quodons might lead to overloading of cryogenic systems. There is no known way to stop or exclude quodons from regions consisting of the same or different materials that are contiguous. More information is needed about the types and properties of nonlinear excitations created by swift particles. Use of the triple-filter-technique in time-of-flight measurements would enable separation of sub-sonic from super-sonic quodons for clarification of their properties and significance in fusion reactors. It any experimental work it is essential to minimize short-circuiting of quodon-currents through insulators.\n\n\n\n§ ACKNOWLEGMENTS\n\nFMR wishes to thank Chris Eilbeck, Leornor Cruzeiro and Larissa Brizhik for useful and enlightening discussions on both the dynamic and electronic aspects of quodon interactions with matter.\n\n\n\n§ FUNDING\n\nJFRA wishes to thank projects MICINN PID2019-109175GB-C22 and Junta de Andalucia US-1380977.\n\n\n\n"}