{"entry_id": "http://arxiv.org/abs/2303.07086v1", "published": "20230313131149", "title": "Non-radial oscillations and gravitational wave emission of hybrid neutron stars", "authors": ["Zi-Yue Zheng", "Ting-Ting Sun", "Huan Chen", "Jin-Biao Wei", "G. F. Burgio", "H. -J. Schulze"], "primary_category": "nucl-th", "categories": ["nucl-th", "astro-ph.HE", "gr-qc"], "text": "\n\n\n\n\n                     \n         \n                \n\n\n\n                 \n                \n\n\n\n\n\n\n\n#1 #1 \n#1 #1 \n#1 #1 \n\n\n    #1\n        #1\n    \n    \n    \n    pxe𝐞→εϕφλαω M_⊙M_max MeV km3 fm^-33 g/cm^3 MeV fm^-3τ_GWδϵx_p\n    UTF8gbsn\n    Email:huanchen@cug.edu.cn\n    School of Mathematics and Physics, China University of Geosciences,\n    Lumo Road 388, 430074 Wuhan, China\n    INFN Sezione di Catania, Dipartimento di Fisica,\n    Universitá di Catania, Via Santa Sofia 64, 95123 Catania, Italy\n    \n    We investigate non-radial oscillations of pure and hybrid neutron stars,\n    employing equations of state of nuclear matter\n    from Brueckner-Hartree-Fock theory,\n    and of quark matter from the Dyson-Schwinger quark model,\n    performing a Gibbs construction for the mixed phase in hybrid stars.\n    Characteristic differences between neutron-star and hybrid-star\n    g_1-mode oscillation frequencies, damping times, and gravitational wave strains \n    are pointed out. Prospects of observations are also discussed.\n    \n    \n    \n    \n    \n    Non-radial oscillations and gravitational wave emission\n    of hybrid neutron stars\n        H.-J. Schulze\n        March 30, 2023\n    ===============================================================================\n    \n    \n    \n    \n    § INTRODUCTION\n    \n    \n    The interior of a neutron star (NS) can reach several times\n    the nuclear saturation density ρ_0 ≃ 0.163.\n    Therefore, there might exist a phase transition to deconfined quark matter (QM)\n    in the NS core <cit.>.\n    In general, once the equation of state (EOS) of nuclear matter (NM) is known,\n    one can compute the structure and properties of NSs.\n    Unfortunately, so far,\n    due to the lack of exact computation\n    dealing with the nonperturbative strong interaction,\n    the EOS of high-density NM remains an open theoretical problem.\n    There are many theoretical models for the NS EOS\n    that can meet the observational and experimental constraints,\n    see, e.g., <cit.>\n    for a recent review.\n    For NM in the hadron phase,\n    popular EOSs are based on\n    relativistic mean field models <cit.>,\n    phenomenological models based on energy-density functional theory\n    with generalized Skyrme effective forces <cit.>,\n    Brueckner-Hartree-Fock (BHF) theory\n    <cit.>,\n    the variational method (APR) <cit.>,\n    the self-consistent Green's functions approach\n    <cit.>,\n    and chiral effective field theory \n    <cit.>.\n    For QM, EOSs are mainly obtained with\n    the MIT bag model <cit.>,\n    the Nambu-Jona-Lasinio model <cit.>,\n    the perturbative QCD <cit.>,\n    and the Dyson-Schwinger equations (DSEs)\n    <cit.>.\n    \n    To test the various theoretical models of NSs and hybrid stars (HSs),\n    we have to resort to observations.\n    The mass-radius relation is one of the most straightforward and\n    simple observables,\n    which can be theoretically obtained by solving the Tolman-Oppenheimer-Volkov\n    (TOV) equations combined with the EOS.\n    Recently, several observed pulsars with masses above two solar masses\n    <cit.>\n    put firm lower limits on the maximum mass of NSs.\n    Some theoretical analyses of the NS merger event GW170817\n    even deduce an upper limit on the maximum mass of about 2.2–2.3<cit.>,\n    albeit with large theoretical uncertainty.\n    In 2019, new constraints on the radius were provided by the NICER\n    (Neutron Star Interior Composition Explorer) mission,\n    which reported Bayesian parameter estimations of the mass and equatorial radius\n    of the millisecond pulsar PSR J0030+0451 <cit.>,\n    and recently on PSR J0740+6620 with mass 2.08_-0.07^+0.07<cit.>.\n    \n    However, it is hard to distinguish HSs and pure NSs\n    from the mass-radius relations,\n    since theoretically the differences between them are small,\n    and even masked by the uncertainties of pure NSs with various models\n    <cit.>.\n    Therefore, one needs other observables to reveal the interior of NSs.\n    \n    NSs are sources of electromagnetic waves in all wavelengths,\n    and also emitters of both continuous and inspiral gravitational waves (GWs).\n    In particular, when NSs experience violent processes such as accretions,\n    radial and non-radial oscillations, glitches, and even NS mergers\n    <cit.>,\n    they are expected to emit strong enough signals that can be observed.\n    \n    After the first direct observation of GWs from a binary black hole (BH) merger\n    <cit.>,\n    more and more GW signals were detected,\n    including NS mergers\n    <cit.>,\n    which has opened a new window on NS observation\n    by using GWs as probes of their internal structure.\n    \n    In our previous work <cit.> we investigated radial oscillations,\n    and found a clear difference of their frequencies between pure NSs and HSs.\n    The radial oscillation of NSs is the simplest oscillation mode\n    without direct GW radiation,\n    but might couple with and amplify GWs <cit.>\n    and modulate the short gamma ray burst (SGRB) <cit.>.\n    \n    On the contrary,\n    the non-radial oscillation (NRO) of a star can directly produce GW signals\n    <cit.>,\n    not only in NS mergers or supernova explosions.\n    Therefore, the study of NROs of isolated NSs\n    may provide us with direct and stable observations to understand\n    the structure and properties of high-density NM,\n    the strong interaction, and GWs.\n    In this work we further study the NROs of NSs,\n    specifically the quadrupole oscillations\n    which are stable sources of GW radiation.\n    \n    The theoretical study of NROs in general relativity\n    was first proposed by Thorne <cit.>.\n    After that,\n    a series of rigorous mathematical analyses were carried out\n    by Detweiler and Lindblom <cit.>,\n    whereas Chandrasekhar and Ferrari proposed a simpler calculation\n    and obtained some properties of NROs of compact stars <cit.>.\n    In recent years,\n    many investigations of NS NROs were carried out,\n    for example\n    <cit.>.\n    They show that some eigenfrequencies of the NROs of NSs\n    are within the sensitive range of some current detectors.\n    Theoretically, for a non-rotating NS,\n    the eigenmodes of oscillation are divided into\n    g mode, f mode, and p mode,\n    which indicate the various dominant restoring forces for the perturbations.\n    The g-mode eigenfrequencies are relatively small,\n    ∼ O(1 kHz),\n    and provide us with an appropriate observable.\n    The buoyancy acts as the g-mode restoring force\n    to bring disturbed fluid elements back into equilibrium,\n    and generally its frequency depends on the particle fraction gradient\n    and temperature <cit.>.\n    This effect is more intense in HSs than in pure NSs <cit.>.\n    Therefore, we can expect different characteristics of the g modes\n    between NSs and HSs,\n    and we will mainly focus on this mode.\n    \n    In this work, we adopt the BHF theory for NM,\n    which is based on realistic many-body forces that describe accurately\n    nucleon scattering data in free space and the properties of the deuteron.\n    Moreover, the BHF approach enables the derivation of the properties\n    of NM at nuclear saturation density\n    consistent with experiments\n    <cit.>.\n    For QM, we adopt the Dyson-Schwinger-equation quark model\n    <cit.>,\n    which can simultaneously address both confinement and\n    dynamical chiral symmetry breaking <cit.>.\n    We employ the Gibbs phase transition between the hadron and\n    deconfined quark phase <cit.>,\n    which determines a range of baryon densities\n    where hadron and quark phase coexist.\n    In this framework,\n    the maximum masses of the pure NSs and HSs fulfill the two-solar-mass constraint\n    <cit.>.\n    \n    This work is organized as follows.\n    In Sec. <ref> we briefly describe the formalism for the EOSs, i.e.,\n    the BHF theory for the hadron phase and the DSEs for the quark phase.\n    In Sec. <ref> we introduce the TOV and\n    the eigenvalue equations for the NROs of NSs.\n    Numerical results are given in Sec. <ref>,\n    and we draw the conclusions in Sec. <ref>.\n    We use natural units c=ħ=1 throughout the paper.\n    \n    \n    \n    \n    \n    § EQUATION OF STATE\n    \n    \n     §.§ Nuclear matter\n    \n    \n    The BHF many-body theory <cit.>\n    is used to describe the NM in the interior of NSs.\n    It can reproduce NM properties near the saturation density\n    with a quite good accuracy <cit.>.\n    We only provide here a brief overview of the formalism,\n    and refer to the various indicated references for full details.\n    The essential ingredient of this approach is the interaction matrix G,\n    which satisfies the following equations\n    \n      G(ρ,;E) = V + V  ∑_1,2|12⟩ (1-n_1)(1-n_2) ⟨12|/E - e_1-e_2 +i0 G(ρ,;E)  \n    and\n    \n     U_1(ρ,) = ∑_2 n_2\n     G(ρ,;e_1+e_2)12_a  ,\n    \n    where n_i(k) is a Fermi distribution,\n    ≡ρ_p/ρ is the proton fraction,\n    and ρ_p and ρ are the proton and the total nucleon number densities,\n    respectively.\n    E is the starting energy and\n    e_i(k) ≡ k^2/2m_i +  U_i(k) is the single-particle energy.\n    The multi-indices 1,2 denote in general momentum, isospin, and spin.\n    The energy density of NM can then be expressed as\n    \n        _N =\n        \n         ∑_1 n_1(k) ( k^2/2m_1 + 1/2U_1(k) )\n         .\n    \n    \n    Thus, the nucleon-nucleon interaction potential V is the only necessary input\n    in the calculation process.\n    In this work, we adopt the\n    Argonne V_18 (V18) <cit.>\n    and\n    Bonn-B (BOB) <cit.>\n    potentials,\n    supplemented with compatible microscopic three-body forces\n    <cit.>.\n    This is a common prescription adopted in the BHF approach,\n    and allows to reproduce correctly the saturation point\n    of symmetric NM and related properties.\n    \n    In order to obtain the EOS,\n    we impose cold, neutrino-free, charge neutral, and catalyzed matter\n    consisting of neutrons, protons, and leptons (e^-,μ^-)\n    in beta equilibrium due to weak interactions.\n    Therefore, the energy density of NM can be expressed as\n    (ρ_n,ρ_p,ρ_e,ρ_μ) =    \n     (ρ_nm_n+ρ_pm_p)  + _N(ρ_n,ρ_p)\n    \n       \n     + _e(ρ_e) + _μ(ρ_μ)\n     ,\n    \n    where _e,μ are the energy densities of electrons and muons,\n    and m_n,p are the masses of neutrons and protons, respectively.\n    \n    Furthermore, a quadratic dependence on the proton fraction\n    is well fulfilled\n    <cit.>,\n    _N(ρ_n,ρ_p) = _SNM(ρ)\n     + (1 - 2)^2 _sym(ρ)  ,\n    \n    being _sym(ρ) the symmetry energy density,\n    _sym(ρ) = _PNM(ρ) - _SNM(ρ)  .\n    \n    Therefore, for the treatment of beta-stable matter,\n    it is only necessary to calculate the energy densities for\n    symmetric nuclear matter (SNM) and pure neutron matter (PNM).\n    For practical use, we employ the convenient empirical parametrizations\n    given in Refs. <cit.>.  \n    We have shown in <cit.> that going beyond the parabolic approximation\n    affects the results for NS structure only in a very marginal way.\n    \n    The various chemical potentials\n    of the particle species i=n, p, e, μ\n    can be computed from the energy density, Eq. (<ref>),\n    μ_i = ∂/∂ρ_i ,\n    \n    and this allows to solve the equations for beta-equilibrium,\n    μ_p + μ_e    = μ_n ≡μ_B   ,\n     μ_e = μ_μ ,\n    \n    together with charge neutrality,\n    \n     ρ_p - ρ_e - ρ_μ≡ρ_C = 0  ,\n    \n    for the equilibrium composition ρ_i at fixed baryon density\n    ρ_B=ρ=ρ_p+ρ_n.\n    Finally the EOS is given by\n    \n     p() = ρ_B^2  d / d ρ_B(ρ_i(ρ_B))/ρ_B\n     = ρ_B   d /d ρ_B - \n     = ρ_B μ_B -  .\n    \n    \n    The BHF approach provides only the EOS for the bulk matter region\n    ρ≳ 0.13\n    without cluster formation, and therefore it has to be\n    joined with a low-density crust EOS.\n    In this paper we adopt the Shen2020 EOS <cit.>,\n    which belongs to the class of so-called unified EOSs,\n    and is frequently used\n    for the simulations of core-collapse supernova and NS mergers.\n    \n    \n    \n    We notice that the high-mass domain that we are mainly interested in,\n    is in any case hardly affected by the structure\n    of this low-density transition region <cit.>.\n    The choice of the crust model can influence the predictions of\n    radius and related deformability to a small extent,\n    of the order of 1% for R_1.4<cit.>,\n    which is negligible for our purpose.\n    Even neglecting the crust completely,\n    NS radius and deformability do not change dramatically <cit.>.\n    \n    Due to the absence of strict theoretical and observational constraints\n    on how to join the core and crust EOSs,\n    we use the simplest way,\n    a continuous transition\n    at the point with the same pressure and energy density.\n    The possible influence of the core-crust transition construction\n    on the NROs will be discussed in following.\n    \n    \n    \n    \n    \n     §.§ Quark matter\n    \n    \n    As in Ref. <cit.>,\n    we adopt the Dyson-Schwinger model (DSM) <cit.>\n    to describe the deconfined quark phase,\n    which provides a continuous approach to quantum chromodynamics (QCD).\n    The fundamental quantity of the DSM is the quark propagator S(p;μ)\n    at finite chemical potential μ,\n    which satisfies the Dyson-Schwinger equation\n        S(p;μ)^-1 = Z_2 [ i γ·p\n     + i γ_4(p_4 + iμ) + m_q ] + Σ(p;μ)  \n    with the renormalized self-energy expressed as\n    Σ(p;μ) = Z_1 g^2(μ) ∫d^4 q/(2π)^4 D_ρσ(k;μ)\n     ^a/2γ_ρ S(q;μ)\n    \n     ^a/2Γ_σ(q,p;μ)  ,\n    \n    where D_ρσ(k≡ p-q;μ) is the full gluon propagator,\n    Γ_σ(q,p;μ) is the full quark-gluon vertex, and\n    Z_1 and Z_2 are the quark-gluon vertex and quark wavefunction\n    renormalization constants.\n    Moreover, ^a are the Gell-Mann matrices,\n    and m_q is the current-quark bare mass.\n    Knowing the quark-gluon vertex and gluon propagator,\n    one can solve the equation and obtain the quark propagator.\n    In our work,\n    the so-called rainbow approximation and a\n    chemical-potential-modified Gaussian-type effective interaction\n    <cit.> are adopted,\n    see Ref. <cit.> for details.\n    \n    The EOS for cold QM is obtained following Refs. <cit.>.\n    The quark number density, pressure, and energy density\n    for each quark flavor at zero temperature can be obtained as\n    ρ_q(μ_q)    = 6∫d^4p/(2π)^4tr_D[-γ_4 S_q(p;μ_q) ]  ,\n    \n    \n      p_q(μ_q)    = p_q(μ_q,0) + ∫_μ_q,0^μ_q dμρ_q(μ)  ,\n    \n    _q(μ_q)    = -p_q(μ_q) + μ_q ρ_q(μ_q)  .\n    \n    The baryon chemical potential and total baryon number density\n    in the quark phase are\n       μ_B = μ_u + 2μ_d  ,\n    \n       ρ_B = ρ_u+ρ_d+ρ_s/3 ,\n    \n    and the total pressure and energy density are given\n    by summing contributions from all quark flavors\n    and those from electrons and muons.\n    The pressure of QM at zero density is determined by a\n    phenomenological bag constant <cit.>,\n    \n     B_DS = -∑_q=u,d,s p_q(μ_q,0)  ,\n    \n    which is set to 90<cit.>.\n    \n    The beta equilibrium and charge neutrality in the pure quark phase\n    are expressed as\n       μ_d = μ_u + μ_e = μ_u + μ_μ = μ_s  ,\n    \n       ρ_C = 2ρ_u-ρ_d-ρ_s/3 - ρ_e - ρ_μ = 0  .\n     \n    In this work we adopt the Gibbs construction <cit.>\n    for the phase transition between hadron phase and quark phase.\n    In combination with the respective beta-equilibrium conditions\n    Eqs. (<ref>) and (<ref>),\n    the chemical and mechanical equilibrium in the mixed phase are expressed as\n       μ_B,N = μ_B,Q ,\n    \n       μ_e,N = μ_e,Q ,\n    \n    \n      p_N(   μ_e,μ_B) = p_Q(μ_e,μ_B) = p_M(μ_e,μ_B)  ,\n    \n    where the subscripts “N\", “Q\", and “M\"\n    represent NM, QM, and the mixed phase, respectively.\n    In the mixed phase,\n    the local charge neutrality conditions Eqs. (<ref>) and (<ref>)\n    are replaced by the global condition\n    χρ_C,Q + (1-χ)ρ_C,N = 0  ,\n    \n    where χ is the volume fraction of QM in the mixed phase.\n    Consequently,\n    the baryon number density ρ_B,M and energy density _M\n    of the mixed phase can be determined as\n    ρ_B,M   = χρ_B,Q + (1-χ)ρ_B,N ,\n     \n    _M    = χ_Q + (1-χ)_N  .\n    \n    Specifically, in the Gibbs construction\n    the pressure and energy density in HSs\n    are continuous functions of the baryon density,\n    at variance with the Maxwell phase transition <cit.>.\n    \n    \n    \n    \n    \n    § NEUTRON STARS\n    \n    \n     §.§ Hydrostatic equilibrium structure\n    \n    Due to the strong gravitational field in NSs,\n    their structure and dynamical evolution are ruled\n    by the Einstein equation in general relativity,\n    \n     R_μν - 1/2g_μνR = 8π G T_μν ,\n    \n    where R_μν is the Ricci tensor,\n    R is the Ricci scalar, and\n    G is the gravitational constant.\n    The energy-momentum tensor is\n    \n     T_μν = pg_μν + (p+)u_μ u_ν ,\n    \n    where g_μν is the metric tensor,\n    p is the pressure,\n     is the energy density,\n    and u_μ is the four-velocity.\n    For simplicity, we consider static spherically symmetric stars,\n    described by the Schwarzschild metric\n    <cit.>\n    \n    The general static spherically-symmetric metric\n    which describes the geometry of a static NS can be written as\n    \n     ds^2 = e^ν(r)dt^2 - e^(r)dr^2\n     - r^2(dθ^2+sin^2θ dϕ^2)  ,\n    \n    where e^ν(r) and e^(r) are metric functions.\n    The TOV equations <cit.>\n    obtained from the Einstein field equation for the metric are\n    dp/dr   = G(+p)(m+4π r^3p)/r^2(2Gm/r-1) ,\n    \n    dm/dr   = 4π r^2 ,\n    \n    and the corresponding metric functions\n    \n     e^(r)   = (1-2Gm/r)^-1 ,\n    \n    ν(r)    =\n     -2G ∫_r^∞ dr' e^(r')/r'^2( m + 4π r'^3 p )  .\n    \n    The boundary conditions\n    m(r=0)=0, p(r=0)=p_c, and p(R)=0,\n    where p_c is the central pressure,\n    lead to equilibrium configurations in combination with the EOS of the NS matter,\n    thus obtaining radius R and mass M=m(R)\n    of a NS for a given central pressure or density.\n    \n    \n    \n    \n    \n     §.§ Non-radial oscillations\n    \n    \n    Thorne developed a complete theory for NROs of NSs\n    from the Einstein field equations <cit.>.\n    The perturbation of the fluid in the star is described\n    by the Lagrangian displacement vector ξ^ in terms of\n    the dimensionless perturbation functions W(r) and V(r),\n    ξ^r         = r e^-/2 W Y^l_m  e^i t ,\n    \n    ξ^θ   = -V ∂_θ Y^l_m  e^i t ,\n    \n    ξ^ϕ   = -(sinθ)^-2 V ∂_ϕ Y^l_m  e^i t ,\n    \n    where Y^l_m(θ,ϕ) are the usual spherical harmonics,\n    and the eigenvalue = 2π f is the frequency of the NRO.\n    The eigenfunctions W(r) and V(r) are determined by the pulsation equations.\n    The full NRO equations can be found in the literature\n    <cit.>.\n    \n    As we mainly focus on the g-mode oscillations,\n    in this work we consider the relativistic Cowling approximation,\n    which disregards the perturbations in the metric <cit.>.\n    The validity of the Cowling approximation has been confirmed in\n    Refs. <cit.>,\n    which find relatively small deviations of the g-mode oscillation frequencies\n    compared to the full solutions.\n    As for the other two modes,\n    this approximation yields about 10–30% accuracy\n    of the f-mode frequencies\n    and about 20% for the p mode.\n    \n    The oscillation equations in Cowling approximation are\n    \n     r dW/dr   = ( g/c_s^2 - 3 ) W\n     + e^/2( ^2 r^2/c_s^2 e^ν - l(l+1) ) V\n     ,\n    \n     r dV/dr   = e^/2( N^2/^2 - 1 ) W\n     + ( 2g + N^2 r^2/g e^ν- - 2 ) V  ,\n    \n    with g ≡ -r(dp/dr) / (p+),\n    and N being the Brunt-Väisälä (BV) frequency defined as\n    \n     N^2 ≡g^2/r^2( 1/c_e^2-1/c_s^2) e^ν- .\n    \n    In the Newtonian approximation N is the frequency of the perturbed\n    fluid elements forced by buoyancy to perform harmonic oscillations.\n    \n    The BV frequency depends on the difference of the inverse squared\n    equilibrium speed of sound c_e\n    and adiabatic speed of sound c_s,\n    caused by the deviation from beta-equilibrium during fast enough oscillations.\n    The former is defined as the derivative of the EOS in beta equilibrium,\n    \n     c_e^2 ≡dp/dr/d/dr = dp/d ,\n    \n    while,\n    assuming that all weak reactions are slow compared to the oscillation timescale,\n    the squared adiabatic speed of sound is\n    \n     c_s^2 ≡( ∂ p/∂)_S,Y_i\n     = Δ p/Δ ,\n    \n    where S and Y_i denote entropy and the particles fractions\n    affected by weak reactions, respectively.\n    It is related to the adiabatic index of the fluid,\n    γ = ( 1 + /p) c_s^2  ,\n    \n    which drives the response of the stellar material to pulsational perturbations.\n    \n    However, one should note that Eq. (<ref>) is only adequate\n    in the pure hadron/quark phases.\n    In the mixed phase,\n    one also needs to consider the transition between NM and QM,\n    as well as the independent expansion/contraction of NM/QM\n    during the oscillation.\n    The related conversion rate/time scale between hadron and quark phases\n    is still an open question,\n    and current calculations are model dependent.\n    Following the argument of <cit.>,\n    the preferred conversion timescale would be slow at the hadron-quark interface,\n    although a rapid timescale cannot be discarded <cit.>.\n    \n    Therefore, herein we neglect the phase transition\n    between NM and QM in the mixed phase,\n    keeping all particles fractions Y_i constant\n    in NM and QM separately.\n    Note that this means that the strong chemical equilibrium\n    between NM and QM is violated, i.e.,\n    the isospin chemical potentials in NM and QM are different during oscillations.\n    The volume fraction of QM in the mixed phase changes during the oscillation,\n    to keep the pressure equilibrium between NM and QM.\n    Accordingly, the squared adiabatic speed of sound in the mixed phase\n    is modified as <cit.>\n     c_s^-2 = χ''_Q + (1-χ')'_N - /p'-p ,\n    \n    where p and  are the pressure and energy density in beta-equilibrium,\n    p'=p+Δ p is the pressure during oscillations,\n    '_Q, '_N are the energy densities of QM and NM\n    during oscillations,\n    and χ' is determined by p'_Q=p'_N =p' during oscillations.\n    \n    In this work, we focus on the influence of the core on the NROs,\n    as in recent literature <cit.>.\n    For simplification,\n    we will make the approximation that c_s=c_e in the crust,\n    and correspondingly the BV frequency N_crust=0.\n    The influence of the crustal N on the core modes of NROs is small,\n    which will be discussed in the following section.\n    \n    In order to determine the eigenfrequencies of oscillation,\n    one also needs boundary conditions <cit.>, which,\n    in the NS center, are given by\n    \n     W(0) + lV(0) = 0  ,\n    \n    while at the outer surface of the star,\n    the Lagrangian perturbation of the pressure should vanish,\n    Δ p(R) = γ p\n     [ -e^-/2(rdW/dr + 3W) - l(l+1) V ](R) = 0  .\n    \n    Due to the homogeneousness of the oscillation equations\n    Eqs. (<ref>,<ref>),\n    one can impose arbitrarily\n    W(r=0)=1 and V(r=0)=-1/2\n    at the center.\n    Then integrating Eqs. (<ref>,<ref>)\n    from center to the surface with the boundary conditions\n    yields the discrete eigenfrequencies _i\n    and the eigenfunctions W_i,V_i.\n    For the quadrupole (l=2) oscillations of pure NSs and HSs,\n    they can be ordered as\n    _g_n<…<_g_1<_f<_p_1<…<_p_n,\n    where n is the number of nodes.\n    \n    \n    \n    \n    \n     §.§ GW damping time\n    \n    \n    The damping time of oscillations through GW emission is\n     = 2E/P_GW ,\n    \n    where E is the total energy stored in the oscillation,\n    and P_GW is the power of the GW radiation released by the mode.\n    \n    The energy per radial distance\n    of an eigenmode in Cowling approximation\n    is given by <cit.>dE/dr = ^2/2 (p+) e^(-ν)/2\n     r^4 [ W^2 + l(l+1)V^2 ]  ,\n    \n    and its power can be estimated as <cit.>\n     P_GW = G(l+1)(l+2)/8π (l-1)l[ 4π^l+1/(2l+1)!!∫_0^R dr  r^l+2]^2 ,\n    \n    where  is the Eulerian perturbation of the energy density,\n    in Cowling approximation given as <cit.> =     -(p+)\n     [ e^-/2(3W + r dW/dr) + l(l+1) V ]\n    \n       \n     - r d/dr e^-/2 W  .\n    \n    It has been pointed out <cit.>\n    that the different terms in this equation are of different signs\n    and tend to cancel each other,\n    which renders a reliable numerical evaluation very delicate.\n    We will come back to this problem later.\n    \n    The radiation power is related to the GW strain (metric perturbation),\n    which in quadrupole approximation and transverse-traceless (TT) gauge\n    is <cit.>\n     h_ij^TT(t,D) =\n     2G/DQ̈_ij^TT(t-D/c)  ,\n    \n    where i,j=1,2,3 are the indices in Cartesian coordinates,\n    D is the distance to the source,\n    G is the gravitational constant,\n    the two dots represent the second time derivative,\n    and the traceless quadrupole moment is\n    \n     Q_ij^TT(t) = ∫ d^3 (t,)\n     ( x_i x_j - 1/3δ_ij||^2 )  .\n    \n    The metric perturbation tensor can be decomposed as\n    𝐡^TT = h_+ _+ + h_×_× ,\n    \n    where _+ and _×\n    are the unit tensors of plus and cross polarization.\n    \n    In the case of a symmetric metric,\n    the cross polarization h_× is zero,\n    Q_ij has only diagonal components\n    Q_11 = Q_22 = -1/2 Q_33,\n    and the GW strain can be calculated by <cit.>\n     h_+ = 3Gsin^2/2DQ̈_33 ,\n    \n    where  is the inclination angle.\n    In this work, we choose sin=1.\n    After some derivation, Q̈_33 can be written as\n    Q̈_33   = | Q̈_33| e^-i t\n       = ∫ dr  r^2 sinθ dθ dϕ \n     r^2 (sin^2θ - 1/3)\n     d^2 /dt^2 ,\n    \n    and thus\n    |Q̈_33| =\n     4√(π/5)/3^2 ∫ dr  r^4 (r)  ,\n    \n    where  is given by Eq. (<ref>).\n    So the amplitude of the GW strain can be rewritten as\n    |h_+| = 3G|Q̈_33|/2D ,\n    \n    and depends, as the radiation power, on (r).\n    \n    \n    \n    \n    \n    § NUMERICAL RESULTS\n    \n    \n    \n     §.§ EOS and equilibrium structure of neutron stars\n    \n    \n    As discussed above, we use the BHF EOS with BOB or V18 potential\n    for the pure NM.\n    Regarding the QM EOS in HSs,\n    there is a free model parameter ,\n    which represents the strength of the\n    in-medium modification of the Gaussian-type effective interaction in the DSM.\n    Here we choose = 1,2 and = 1,1.5\n    in combination with the BHF BOB and V18 EOSs, respectively,\n    labeled as BOB/V18+DS,\n    to satisfy both the requirements of >2 and causality,\n    as discussed in detail in <cit.>.\n    \n    The energy density, squared equilibrium speed of sound,\n    and squared adiabatic speed of sound as functions of the pressure\n    are shown in Fig. <ref>.\n    The colors/types of curves refer to the different combinations\n    of BHF and DSM EOS.\n    The EOS of the mixed phase (broken lines) is generally softer\n    than that of the pure NM (solid lines),\n    whereas pure QM emerges at too high densities\n    that cannot be reached in HSs in our approach.\n    However, the QM onset density is strongly dependent on the theoretical model\n    adopted for the description of QM.\n    \n    We notice that both sound speeds in pure NM\n    become superluminal at high densities\n    (but quite close to the  configuration),\n    due to the non-relativistic character of the BHF theory.\n    However, in our model,\n    the phase transition to QM occurs always at lower density,\n    and consequently causality is never violated.\n    The equilibrium speed of sound c_e is particularly sensitive\n    to the composition of the matter.\n    One can find a small discontinuity at p≈5\n    due to the onset of muons\n    (hardly visible because of the scale),\n    and a sharp discontinuous drop at the phase transition point,\n    due to the appearance of QM.\n    Unlike c_e, the adiabatic speed of sound c_s is always continuous\n    with increasing pressure,\n    independently of the emergence of muons or quarks.\n    This is because it is defined with fixed particle composition, Eq. (<ref>).\n    Similar results were obtained in Ref. <cit.>,\n    using different NM and QM EOSs.\n    \n    In Fig. <ref> we show the difference of squared inverse sound speeds\n    1/c_e^2-1/c_s^2 as function of the baryon number density in NS matter.\n    This difference determines the profile of the local oscillation frequency,\n    i.e., the BV frequency, Eq. (<ref>).\n    As discussed above, we approximate c_s=c_e and N=0 in the crust,\n    therefore the difference is zero below the core-crust transition density.\n    In the core with the pure BHF EOS,\n    c_s and c_e increase with density,\n    and therefore 1/c_e^2-1/c_s^2 decreases.\n    There is a first spike around ρ_B ≃ 0.153\n    due to the muon onset,\n    and at larger densities a second much sharper spike due to the appearance of QM.\n    In the mixed phase the difference decreases and then increases again\n    when approaching the pure quark phase.\n    We stress that the (sharp) change of 1/c_e^2-1/c_s^2\n    is mainly due to the (sharp) change of c_e,\n    which is very sensitive to the change of particle species,\n    see Fig. <ref>.\n    \n    Furthermore we notice that,\n    whereas the differences in the purely hadronic phase become very small\n    and rapidly approach zero,\n    those in the mixed phase are larger and can rise very quickly.\n    This behavior already hints to larger values of the g-mode frequencies\n    and a strong dependence on the QM EOS\n    in hybrid stars compared to the purely hadronic stellar configurations.\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    The mass-radius relations of pure NSs and HSs with the various considered EOSs\n    are shown in Fig. <ref>.\n    The broken curve segments indicate the hybrid star branches.\n    One notes that the differences between HSs and pure NSs are even smaller\n    than the differences between pure NSs with different BHF EOSs.\n    Therefore, it is difficult to distinguish HSs from pure NSs\n    with only M(R) observations.\n    Within our model, pure QM matter does not appear in the core of HSs.\n    \n    All plotted EOSs\n    (in particular the V18 models)\n    fulfill the constraints from present observations on NS mass and radius,\n    in particular the recent mass-radius results of the NICER mission\n    for the pulsars J0030+0451 <cit.>\n    and J0740+6620 <cit.>.\n    The combined (strongly model-dependent) analysis\n    of both pulsars together with the GW170817 event observations\n    <cit.>\n    yields improved limits on the radius\n    R_2.08=12.35±0.75<cit.>,\n    but in particular on R_1.4, namely\n    12.45±0.65<cit.>, \n    11.94^+0.76_-0.87<cit.>, and\n    12.33^+0.76_-0.81 or\n    12.18^+0.56_-0.79<cit.>,\n    which are shown as horizontal black bars in the figure.\n    \n    The BHF V18 EOS is well compatible with these constraints\n    <cit.>,\n    and also its maximum mass ≈ 2.36\n    exceeds the currently known lower limits.\n    The BOB EOS is stiffer and allows a maximum mass of even 2.51.\n    Some theoretical analyses of the GW170817 event\n    indicate also an upper limit on the maximum mass\n    of ∼2.2–2.4<cit.>,\n    with which the V18 EOS would be compatible as well.\n    However, those are very model dependent,\n    in particular the still to-be-determined temperature dependence of the EOS\n    <cit.>.\n    \n    In Fig. <ref> we show the profiles of both the\n    equilibrium and adiabatic squared speed of sound,\n    and the BV frequency\n    in NSs with masses M=1.4, 2.0\n    for different EOSs.\n    The speed of sound generally increases from the crust to the center of the NS,\n    apart from the density region close to the pure quark phase or a sudden drop of c_e due to the onset of QM\n    (e.g., upper right panel),\n    which does not take place in the 1.4 configurations\n    shown in the left panels.\n    By definition, the BV frequency vanishes in the center\n    and increases towards the crust,\n    exhibiting sharp decreases at the phase transition point or when muons disappear.\n    We see that in the inner core of HSs,\n    the BV frequency is much larger than in pure NSs.\n    The BV frequency is a local property in NSs which cannot be observed directly,\n    but it is closely related to the global g-mode frequency.\n    Accordingly, one can consider the BV frequency and the g-mode oscillations\n    as useful probes of the appearance of QM.\n    We will discuss this in detail now.\n    \n    \n    \n    \n    \n     §.§ Non-radial oscillations of neutron stars\n    \n    \n    In this work, we investigate the quadrupole oscillations (l=2)\n    of both pure NSs and HSs.\n    For illustration,\n    we show some typical solutions\n    for the radial and tangential displacement perturbations\n    W(r) and V(r) in Fig. <ref> .\n    The left panels contain the results of four representative\n    f, g_1, g_2, and p_1 eigenmodes\n    of a 1.4 NS with the V18 EOS,\n    exhibiting the expected number of nodes,\n    whereas the right panel displays\n    the g_1 mode of 2.0 NSs with various EOSs.\n    In this case, for purely hadronic NSs (solid lines),\n    one can see quite similar oscillation amplitudes nearly independent\n    of the nuclear EOS,\n    whereas the amplitudes in HSs (broken lines) decrease more quickly\n    in the inner core and remain smaller in the outer layers.\n    Therefore, the oscillation in HSs occurs mainly in the inner core,\n    and might reveal information about the QM/mixed phase.\n    The W(r) eigenfunction exhibits a smooth behavior over the entire star's profile,\n    even at the radial distance corresponding to the mixed phase onset;\n    this is at variance with V(r),\n    which shows sudden kinks when QM appears.\n    \n    Now we turn to the discussion of the NRO frequencies in NSs and HSs,\n    for g, f, and p modes.\n    As known, they are classified according to the different restoring forces\n    acting in the fluid,\n    and are characterized by different frequencies.\n    In Fig. <ref>,\n    we show the NRO frequencies of NSs as functions of NS mass.\n    One can see that f_g_1 of pure NSs lies in the range 0.2–0.4 kHz,\n    and increases slowly with the NS mass.\n    The difference of the eigenfrequencies with BOB and V18 EOSs\n    is always about 0.1 kHz,\n    which is related to the corresponding difference of the BV frequencies,\n    Fig. <ref>,\n    and in particular to the different NS radii,\n    Fig. <ref>:\n    the smaller V18 star is oscillating faster.\n    The same qualitative correlations are observed for the HSs,\n    which exhibit much higher eigenfrequencies up to 0.9 kHz.\n    Therefore f_g_1 might be a good observable to distinguish HSs from pure NSs.\n    Again, our results are similar to those discussed in\n    Refs. <cit.>.\n    \n    Equivalent features are observed\n    for the much higher eigenfrequencies of f mode and p_1 mode,\n    above 2 kHz and 7 kHz, respectively.\n    But in this case,\n    the differences between HSs and pure NSs are not larger\n    than the difference between pure NSs with different models.\n    Therefore, they can not be used as good observables\n    to distinguish HSs from purely hadronic NSs.\n    \n    The eigenfrequencies of several representative modes\n    of NSs with M=1.4,2.0 and various EOSs\n    are also listed in Table <ref>.\n    One can see that the frequencies of higher-order g modes decrease\n    and those of higher-order p modes increase.\n    These results are qualitatively similar to those recently published in\n    Ref. <cit.>.\n    \n    \n    \n    \n     §.§ GW emission and damping of g_1 mode\n    \n    \n    In the previous section,\n    we have pointed out the significant difference of the g-mode frequencies\n    between massive NSs and HSs.\n    In the following, we investigate a closely related observable,\n    the damping time of oscillations through GW emission,\n    Eq. (<ref>).\n    Before illustrating the results,\n    we remind that three possible damping mechanisms can act on g-mode oscillations, i.e., relaxation toward chemical equilibrium,\n    viscous damping,\n    and damping due to emission of GWs.\n    In Ref. <cit.> damping times of the core g modes\n    (as well as of crustal discontinuity g modes)\n    of order 10^8–10^11s were obtained\n    (but are subject to delicate numerical cancellations).\n    Thus damping due to emission of GWs is very inefficient,\n    and the other mechanisms are dominant.\n    \n    Our results are shown in Fig. <ref>(a)\n    for g_1-mode oscillations with various EOSs\n    as a function of NS mass.\n    In the low-mass region (≲1.4),\n    we obtain also very large values of the damping time,\n    and even a divergence at certain masses.\n    This large value of  is due to the smallness of the integral\n    for the GW power, Eq. (<ref>),\n    caused by cancellations between the individual terms of Eq. (<ref>).\n    The integral represents a superposition of GWs emitted from perturbations\n    of the energy quadruple moment at different layers of the NS.\n    \n    \n    \n    \n    This is illustrated in Fig. (<ref>),\n    which shows the Eulerian perturbation\n    of the energy density, (r), Eq. (<ref>),\n    in 1.4 and 2.0 NSs.\n    Similar as the perturbation functions W(r) and V(r),\n    the perturbation of the energy (quadruple moment)\n    also has nodes at certain radii.\n    The sign flip of  represents a half-period difference\n    of the oscillation phase of the energy quadruple moment.\n    Therefore the GWs emitted from domains with different signs of \n    will interfere with each other,\n    which results in cancellations of the power output.\n    In our models, we obtain contributions\n    \n    of positive  in the inner core\n    and negative  in the outer layers\n    of the same order of magnitude.\n    As a result, we obtain large values of the damping time ,\n    and even a divergence at a certain mass.\n    We stress that the (small) values of the GW power are quite model dependent,\n    which could be greatly influenced by various approximations,\n    an so do the values of the damping time <cit.>.\n    \n    Fig. <ref>(b) shows that\n    for massive pure NSs the positive contribution in the inner core\n    \n    is dominant,\n    and thus the damping time in Fig. <ref>(a)\n    is about 10^6–10^8s (∼ days),\n    and decreases with the NS mass.\n    This means that the g_1 mode of a pure NS is likely\n    to be a stable and long-lasting source of GWs,\n    if no other very strong damping mechanisms dominate.\n    But for the hybrid stars,\n    the positive contributions of  in the inner core are much larger,\n    and the damping time decreases very quickly by several orders of magnitude\n    with respect to pure NSs.\n    \n    \n    Thus the behavior of the g_1-mode GW damping time\n    shows again a significant difference between HSs and pure NSs,\n    just like the frequencies.\n    \n    \n    \n    \n    \n    \n    The much smaller damping time of HSs indicates a much stronger GW strain\n    |h_+|, Eq. (<ref>).\n    This quantity depends on the oscillation amplitudes W and V.\n    Their normalization can be determined from the total energy E of oscillation\n    through Eq. (<ref>).\n    Choosing a typical energy scale E ∼ 10^51erg <cit.>\n    and a typical distance D ∼ 15Mpc (star in the Virgo cluster),\n    we show in Fig. <ref>(b)\n    the GW strain amplitude of NS and HS g_1-mode oscillations.\n    One can see that |h_+| for pure NSs with low masses is much lower,\n    with even a zero point,\n    which corresponds to the high damping time and its divergence in the upper panel.\n    For NSs with larger masses, |h_+| increases with the NS mass,\n    while for HSs the equivalent irregular behavior as for  is exhibited.\n    Therefore,\n    our results for both the damping time and the strain amplitude\n    suggest stronger GW g_1-mode radiation of HSs than pure NSs,\n    which could thus be good observables to distinguish them from each other.\n    \n    \n    \n    \n    \n     §.§ Prospects of observation\n    \n    \n    Some of these features are likely to be detected\n    by the next generation of GW detectors\n    <cit.>,\n    while the frequencies of f and p modes are not in the range of sensitivity\n    of current ground-based detectors.\n    Although the GW strain emitted by NSs in the Virgo cluster is only\n    of the order 10^-25,\n    a |h_+| of the order 10^-22\n    could be obtained for NSs in our galaxy (D∼10kpc),\n    which is within the detection ability of present GW detectors.\n    The minimum energy that should be released\n    to be detectable in present and planned GW observatories\n    can be estimated as <cit.>:\n    E_GW/ = 3.5 × 10^361+4 Q^2/4 Q^2S_n/1s( S/ND/10kpcf/1kHz)^2\n    \n    \n    \n    \n    \n     ,\n    \n    where\n    Q =π f is the quality factor,\n    S_n is the noise power spectral density of the detector,\n    \n    \n    and\n    S/N is the signal-to-noise ratio.\n    \n    Table <ref> lists some representative values,\n    for typical distances\n    D=10kpc (star in our galaxy)\n    and D=15Mpc (star in the Virgo cluster),\n    taking S/N = 8\n    and\n    S_n^1/2=2×10^-23s^1/2\n    (representative of Advanced LIGO-Virgo at ∼ kHz frequency <cit.>),\n    and S_n^1/2=10^-24s^1/2\n    (illustrative of the planned third-generation ground-based\n    Einstein Observatory at the same frequencies <cit.>).\n    Although the minimum detectable energy of NSs in the Virgo cluster\n    is of the order 10^52–10^53erg,\n    higher than the typical energy that can be released by a NRO g mode,\n    the threshold for stars in our galaxy is only 10^46–10^47erg,\n    much lower than this typical energy.\n    Therefore, those events could be detected by present and planned\n    GW observatories.\n    \n    \n    \n    \n    \n    § CONCLUSIONS\n    \n    \n    In this work we investigated non-radial quadrupole oscillations\n    of cold and isolated NSs,\n    including pure NSs and HSs.\n    We adopted the BHF theory for NM, the DSM for QM,\n    and the Gibbs construction for their phase transition.\n    Based on the equilibrium structure,\n    we solved the equations for the non-radial l=2 oscillations\n    within Cowling approximation,\n    and obtained the radial and tangential displacement perturbations in NSs\n    as well as the eigenfrequencies of g, f, and p modes for various EOSs.\n    \n    The emergence of QM influences strongly the two kinds of sound speed\n    and the BV frequencies in HSs,\n    and consequently their g-mode oscillations.\n    We find eigenfrequencies f_g_1∼ 300Hz for pure NSs,\n    which increase very slowly with the NS mass,\n    while those of HSs increase very quickly with NS mass,\n    reaching above 700Hz.\n    All these frequencies are in the sensitivity range\n    of current ground-based GW detectors.\n    This shows a clear difference of the g-mode frequency\n    between pure NSs and HSs,\n    which can thus be a good observable to distinguish them.\n    Such a difference is not obvious for the f and p modes.\n    The concurrent shorter g_1 damping times of HSs correspond\n    to larger GW strain and radiation power,\n    and thus easier detection than for pure NSs.\n    Estimates of the GW strain h_+ and minimum detectable energy E_GW\n    suggest that the GWs from the NRO g_1 mode of NSs/HSs in our galaxy\n    could be detected by present and planned detectors.\n    To sum up, the g_1 mode is the most suitable mode to\n    provide a window on the internal composition of the compact object.\n    \n    In this work we disregarded the contribution of the crust\n    to the g-mode oscillations\n    by using the approximation N_crust=0.\n    In Ref. <cit.> the coupling between core and crust NRO modes\n    has been carefully analyzed and their mutual interference was found\n    sufficiently small, i.e.,\n    the frequency and damping time of the core modes are only weakly influenced\n    by the crust contribution,\n    especially for high-mass stars.\n    We have confirmed this conclusion by calculations\n    involving the Shen EOS N_crust,\n    which will be the subject of a separate paper.\n    \n    The accurate computation of this feature requires in particular a careful\n    treatment of density discontinuities\n    due to changes of the chemical composition.\n    This might occur\n    inside the crust <cit.>,\n    at the core-crust boundary,\n    or at the critical point from HM to QM\n    with a Maxwell phase transition <cit.>.\n    The associated discontinuity g modes\n    might have similar frequencies as\n    and thus mix with the core modes <cit.>.\n    \n    Apart from cold isolated NSs,\n    quadrupole oscillations also occur in various newly born NSs,\n    after NS mergers or supernova explosions,\n    which are expected to be more energetic and easier observable.\n    In such newly born NSs,\n    one needs to consider more realistic environment effects,\n    such as the EOS at finite temperature\n    <cit.>,\n    the temperature/entropy distribution in NSs,\n    the neutrino trapping effects,\n    and also rotation.  \n    We leave these to future work.\n    \n    \n    \n    \n    \n    We acknowledge financial support from the National Natural Science Foundation of China - Grant No. 12205260.\n    \n    \n    Journal of Cosmology and Astroparticle PhysicsJCAPapsrev4-1\n    \n    \n    \n    \n    \n    \n    The oscillation equations in Cowling approximation are\n        -d/dr{γ p/r^2 e^ν/2[ e^-/2dW/dr + l(l+1) V ]}\n         \n     + [ e^ν/2/2d/dr( e^-/2/r^2dν/dr)\n     - ^2/r^2 e^(-ν)/2] (p+) W\n    \n         \n     -l(l+1)(p+) d/dr(e^ν/2) V/r^2 = 0  ,\n    \n        -^2 r^2 e^-ν (p+) V + l(l+1) γ p V\n    \n         \n     + γ p e^-/2dW/dr\n     + dp/dr e^-/2 W = 0  .\n"}