{"entry_id": "http://arxiv.org/abs/2303.07083v1", "published": "20230313130802", "title": "Exploring phonon-like interactions in one-dimensional Bose-Fermi mixtures", "authors": ["Axel Gagge", "Th. K. Mavrogordatos", "Jonas Larson"], "primary_category": "cond-mat.quant-gas", "categories": ["cond-mat.quant-gas", "quant-ph"], "text": "\n\n\n\nDepartment of Physics, Stockholm University, SE-106 91 Stockholm, Sweden\n\n  Department of Physics, Stockholm University, SE-106 91\n  Stockholm, Sweden\n  ICFO – Institut de Ciències Fotòniques, The Barcelona Institute of Science and Technology, 08860 Castelldefels (Barcelona), Spain\n\n[e-mail address: ]Jonas.Larson@fysik.su.se\nDepartment of Physics, Stockholm University, SE-106 91 Stockholm, Sweden\n\n\n\n\nWith the objective of simulating the physical behaviour of electrons moving in a dynamical background, we study a cold atomic Bose-Fermi mixture in an optical lattice potential felt only by the bosons. The bosons, assumed to be in the deep superfluid regime, inherit the periodicity of the optical lattice and subsequently act as a dynamical potential for the polarized fermions. Due to the atom-phonon interaction between the fermions and the condensate, the coupled system displays a Berezinskii-Kosterlitz-Thouless transition from a Luttinger liquid to a Peierls phase. For sufficiently strong Bose-Fermi interaction, however, the Peierls phase becomes unstable and is succeeded by either a collapsed or a separated phase. We find that the main role of the optical lattice amounts to stabilizing the Peierls phase. Furthermore, the presence of a confining harmonic trap leads to a rich physical behaviour beyond what is observed for either bosons or fermions separately trapped. In particular, for an attractive Bose-Fermi interaction, the insulating phase may develop a fermionic wedding-cake like configuration reflecting the dynamical nature of the underlying lattice potential. For repulsive interaction, on the other hand, we conclude that the trap destabilizes the Peierls phase and the two species separate. \n\n\n05.30.Rt, 42.50.Ct, 75.10.Kt\n\nExploring phonon-like interactions in one-dimensional Bose-Fermi mixtures\n    Jonas Larson\n    March 30, 2023\n=========================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nOver the past decades, we have witnessed a rampant growth of experimental methods devised to cool and control dilute gases. The attainment of Bose-Einstein condensates (BECs) <cit.> was soon to be followed by in-depth explorations of BEC dynamics in light-induced periodic potentials <cit.>, paving the way for the groundbreaking demonstration of the Mott-superfluid phase transition. This exemplary quantum phase transition was predicted by the Bose-Hubbard model <cit.> for an atomic gas loaded into an optical lattice <cit.>. Since then, trapped and cooled dilute atomic gases have developed into a versatile laboratory where quantum matter can be studied in a controlled and detailed fashion, and constitute one of the most promising platforms for the realization of analog quantum simulators <cit.>. \n\nMany of the open questions in the filed of quantum phase transitions – especially those revolving around the formation and characterization of exotic quantum phases of matter – cannot, however, be directly addressed by the Bose-Hubbard model per se. Even though the classical laser field forming the optical lattice is in principle dynamical, the back-action between the trapped particles (modelled as beam splitters) and the lattice is normally very weak <cit.>, and one may, to a very good approximation, treat the lattice as the outcome of applying a periodic static potential. Certainly, this approximation would be sufficient to emulate many paradigmatic lattice models. However, such classical potentials do not take into account any back-action between the lattice and the conducting matter, which we know is essential to explain several phenomena like the Peierls distortion <cit.> [see Figs. <ref> (a) and (b)] and superconductivity <cit.>. In solids, effects of that kind result from electron-phonon interactions emerging from the very nature of a dynamical lattice. \n\nThe assignment of tractable degrees of freedom to the lattice renders its description dynamical and enables the simulation of some analogue of phonon-like interactions. One possibility is to couple the atoms to the light field of an optical resonator <cit.>, where substantial Stark shifts are observed already in the presence of a few photons. However, in current experiments only a few modes of the resonator actively participate in the light-matter interaction, and it is therefore not possible to locally modify the dynamical lattice. One must instead turn to multi-mode cavities <cit.>, which still pose difficulties in reaching configurations similar to those encountered in real solids <cit.>. A viable alternative arises when we consider atoms directly interacting with an ionic crystal <cit.>. Here, harmonically trapped ions form a Wigner crystal, while additional neutral atoms move within this lattice. This ion-atom system bears obvious similarities to a real solid, albeit experimentally challenging. In fact, the crystalline structure is not necessary for exploring phonon-like interactions. In mixtures of different atomic species — either different atoms or different internal states of the same atomic species — the interplay between subsystems can lead to intriguing effects. \n\nAs for single atomic species, the use of Feshbach resonances allows experimenters to control the strength, and even the sign, of all involved interactions <cit.> in order to probe the resulting phase diagram. In mixtures of bosons and spin-polarized fermions (hereinafter referred to as BF mixtures), it is well known that an attractive BF interaction leads to a so-called pairing phase in the strongly correlated regime. This has been studied for weak BF interactions g_bf in one dimension (1D) <cit.>, as well as in two <cit.> and three dimensions <cit.>. The phase in question collapses if the interaction becomes too strong, resulting in a clumping of the atoms and breaking of the translational invariance. The effect of optical lattices on BF mixtures has also been investigated in <cit.>. For deep lattices and/or for very strong interaction, such systems can be described by a BF Hubbard model as they enter an insulating phase of composite fermions <cit.>. The physical behaviour is typically described within a Wannier-basis expansion for both species, where the bosons can be construed as agents of effective onsite energy shifts for the lighter fermions. The imposed approximations in such a scheme omit certain back-action between the two subsystems in comparison to the self-consistent analysis we employ here. \nIt is, nevertheless, still possible to encounter Peierls phases, supersolids, and charge density waves <cit.>. Furthermore, if the repulsive boson-boson interaction is weak, the system can enter a regime of phase separation where the bosons and fermions completely avoid each other <cit.>. \n\nOn the experimental front, an early study focused on how the coherence of an atomic condensate – held in place by a cubic optical lattice – is affected by the presence of fermionic atoms <cit.>. Quantum degeneracy for both bosons and fermions was attained in Ref. <cit.>, where the two species were treated on equal footing, a tendency followed in a series of subsequent papers <cit.>. Further experimental investigations have also considered the regime emerging for a condensate in weak contact with much lighter fermionic atoms <cit.>. Here, the fermions effectively induce a so-called Ruderman–Kittel–Kasuya–Yosida (RKKY) long-range boson-boson interaction <cit.>. For attractive Bose-Fermi interaction it was demonstrated that a self-sustained trap may emerge for those fermions located inside the bosonic condensate <cit.>, an effect which may as well lead to the formation of soliton trains <cit.>. The fermion-mediated spin-spin interaction in a spinor condensate has also been recently observed be means of microwave spectroscopy <cit.>.\n\n\n\nIn this article, we investigate a 1D atomic BF mixture where only the bosons are subject to an optical lattice. The motivation for considering such a situation is drawn from the resemblance to an actual solid – the optical lattice orders the bosons in a crystalline structure. Our spin-polarized fermions experience only the periodic potential arising from the boson atomic density but for no externally imposed static potential, with the occasional exception of a harmonic trap. A similar idea, although experimentally more challenging, was proposed in Ref. <cit.>, where the crystalline order for the bosons was established from a rapidly rotating condensate which created a triangular Abrikosov vortex lattice. We focus on the limit of a weak boson-boson (BB) interaction, and an optical lattice of amplitude ≤ 20 E_R (E_R is the recoil energy), where the bosonic gas is expected to form a superfluid, see Fig. <ref>(c). In this regime, we can work within a mean-field approximation for the condensed bosons, which act as a classical dynamical lattice felt by the fermions. The coupled system is solved self-consistently such that all back-action, at the mean-field level, is taken into account (without imposing, for intsance, any single-band nor tight-binding approximations). At this hybrid mean-field level, the mixture  displays a rich phase diagram. For strong BF interaction, with coupling rate g_bf, the system either experiences a collapse (g_bf≪0), in which the two species overlap and populate only a small fraction of the lattice, or a separation (g_bf≫0) where instead the two species avoid each other and populate different parts of the lattice. These are first-order transitions, even though the translational invariance is spontaneously broken in both cases. For a non-zero interaction beyond a critical coupling g_bf=g_c, an instability occurs such that the period of the state is different from that of the underlying lattice, e.g. for half filling a periodic doubling is found. The system then transitions from a Luttinger liquid (LL) phase into a Peierls phase via a Berezinskii-Kosterlitz-Thouless (BKT) transition. The Peierls phase manifests itself through a non-zero gap Δ_P at the Fermi wavenumber k_F, i.e. Δ_P ≠ 0 for g_bf beyond the critical interaction strength g_c. \n\nWe further present an analysis of the effects arising due to the presence of a confining harmonic trap. For sufficiently strong repulsive boson-fermion interaction it has already been shown that, at the mean-field level, the trap induces a separation of the two species <cit.>. This fact suggests ruling out a Peierls like phase when a trap breaks the translational invariance. Inside a trap, the atomic densities vary in space, which in a local density approximation translates to a local Fermi wavenumber. A spatially varying wavenumber has a direct impact on the phases, e.g. by smoothing the discontinuous transition between the (possible) Peierls and collapsed/separated phases. Naturally, the presence of a trap entails a larger number of involved wavenumbers and thereby a broadening of the Bragg peaks in a time-of-flight detection. In addition, we find that the interplay between the trap, the dynamical boson field, and the fermions results in an insulator baring a clear fermionic “wedding cake structure”, which differs from the density profile obtained for a static periodic potential. \n\nOur narrative is structured as follows. Sec. <ref> introduces the Bose-Fermi system and the model we employ for its description. There we also discuss some basic concepts and known results pertaining to the properties of the involved phases. The numerical methods are developed in Sec. <ref>, while the associated results are presented in Sec. <ref>, first for the translationally invariant case <ref>, and then in the presence of a harmonic trap  <ref>. Concluding remarks in Sec. <ref> close our paper out, while the two appendices present two possible paths to the derivation of effective model Hamiltonians taking quantum fluctuations into account for both species, alongside some details underlying the employed hybrid mean-field method.\n\n\n\n§ BACKGROUND: MODEL HAMILTONIAN AND PHASES\n\n\n\n\n\n §.§ The Hamiltonian\n \n\nWe consider a mixture of two atomic gases, one bosonic and one fermionic. By the use of a tight transverse confinement (in the sense of ω_⊥≫ω_∥), excited states of the transverse modes can be neglected and the low-energy physical description is quasi-one dimensional <cit.>. To begin with, we will take the gas to be of infinite extent in the longitudinal direction, and later consider the effect of a trap. We work with dimensionless quantities, where energies are scaled by the boson recoil energy, E_R = ħ^2 k^2 / 2 m_b with k the lattice wavenumber and m_b the atomic boson mass, such that half the optical lattice wavelength sets the characteristic length scale of the problem. The physical behaviour of such a system is captured by the Hamiltonian \n\n\n    [                                                              ℋ̂                                                               =     ∫ dx  ψ̂_b^†( - ∂^2/∂ x^2 + V_b(x) + g_b/2ψ̂_b^†ψ̂_b ) ψ̂_b;                                                                ;                                                                                                                                 +∫ dx   ψ̂_f^†( -1/r∂^2/∂ x^2 + V_f(x) + g_bfψ̂_b^†ψ̂_b ) ψ̂_f, ]\n\n\nwhere r = m_f/m_b is the mass ratio, g_b is the effective 1D boson-boson (BB) interaction strength, and g_bf is the effective 1D BF interaction strength. For the case discussed later, we will assume the bosons to be harmonically confined and subjected to an optical lattice, while the fermions will be harmonically confined but assumed to have a negligible interaction with the optical lattice, \n\n\n    V_b(x)     = 12ω_b^2 x^2 + V_0 sin^2(x), \n    \n    V_f(x)     = r 12ω_f^2 x^2.\n\n\nAt first we remove the harmonic confinement and keep only the periodic optical lattice. To let the lattice single the bosonic atoms out, the light frequency should be such that it is not quasi resonant with any of the dipole transitions – dictated by selection rules – of the fermionic atoms. The atomic field operators ψ̂_b,f(x) and ψ̂_b,f^†(x) obey the standard commutation relations for bosonic and fermionic creation and annihilation operators. Note that the Hamiltonian commutes with both particle number operators (α = b, f),\n\n\n    N̂_α = \n            ∫ dx  ψ̂_α^†(x) ψ̂_α(x).\n\n\nFor further use, we define the average linear density of bosons/fermions as \n\n\n    n̅_α = lim_L →∞1/L∫_-L/2^L/2 dx  ⟨ψ̂_α^†(x)  ψ̂_α(x) ⟩,\n\n\nand ν_α = n̅_α /π as the filling of bosons/fermions. \n\nIn this article, we will consider the bosonic gas to be dense enough to form a (quasi) condensed state, but not so dense that the interaction energy becomes dominant. In terms of the 1D and 3D scattering lengths a_s,1D and a_s,3D this implies \n\n\n    a_s,3D≪ξ≪ a_s,1D,\n\n\nwhere the healing length of the condensate is defined as ξ = (8 π a_s,3Dρ_b)^-1/2, with ρ_b the condensate density. Furthermore, our approximations are consistent with limiting out attention to optical lattice strengths satisfying V_0 ≲ 20 E_R. We take the fermions to be lighter than the bosons, i.e. r = m_f / m_b < 1, which is typically the case for the relevant experiments, e.g. for a Li^6-Li^7 mixture <cit.> one has r=0.86 and for a Li^6-Cs^133 mixture <cit.> one instead gets r ≈ 0.04. We will assume g_b > 0 but allow any sign and magnitude of g_bf. Both the BB and BF interactions should be possible to vary in the experiment be deploying Feshbach resonances <cit.> \n\n\n\n §.§ Pairing phase and Peierls instability\n \n\nFor low bosonic densities, the occurrence of a so-called pairing phase for BF mixtures with attractive BF interaction is well known. For weak interaction strength and light fermions, the development of modulated densities can be understood from the fact that the fermion-mediated long-range interaction between two bosons is an ultracold atomic analog to the RKKY interaction <cit.>. These spatial modulations of the boson density alter the potential landscape for the fermions, and subsequently instigate back-action between the two species. The spatial modulations will occur at the wavenumber 2 k_F if we assume a RKKY interaction from a “flat” background of fermions with a Fermi wavevector k_F. In  <cit.>, a 1D BF mixture without optical lattice was investigated using bosonization and a transition was identified between a two-component gapless LL phase and a gapped pairing phase with periodic density modulations. The transition was found to “flow” towards the BKT fixed point with the gap opening as \n\n\n    Δ∼exp(-1/√(|g_bf - g_c|))Θ(g_bf-g_c),\n\n\nwhere Θ(x) is the Heaviside step function, and g_c is the critical coupling. A study using discretization of the spatial coordinate and the numerical DMRG method also predicted a stable LL phase for small negative g_bf <cit.>. For repulsive interaction (g_bf > 0), the aforementioned studies found no pairing phase. However, in <cit.> a pairing phase was indeed reported upon employing the method of a random phase approximation. \n\nA gap opening at 2 k_F and the corresponding periodic modulation in the density are reminiscent of the Peierls distortion. As first demonstrated by Peierls <cit.>, a metal is unstable towards lattice distortions – a small displacement of the atoms. The phenomenon can be understood by treating the atomic displacements on the mean-field level in the well-known SSH model. Opening up a gap Δ_P in the fermion dispersion at the Fermi wavevector k_F, as depicted in Fig. <ref> (a), lowers the total energy and corresponds to a lattice modulation of wavenumber k_P = 2 k_F, sketched in Fig. <ref> (b). There are however also some discrepancies. The gap Δ_P was derived from a mean-field treatment of the ions, while the pairing gap Δ is the gap of excitations in the full quantum system. Still, it is interesting to observe that the gap in the SSH model also has an exponential form similar to (<ref>). Moreover, in the original work of Peierls the instability was demonstrated for any non-zero interaction <cit.>, while the effect of pairing arises as a consequence of a phase transition occurring at finite interaction strength.  \n\nAn optical lattice is, on intuitive grounds, expected to stabilize the pairing phase against a collapse, since it renders the bosons less mobile by generating a larger effective mass. On the other hand, using the same argument, the lattice may also extend a possible metallic phase to larger regions in the phase diagram. We may note that for BF mixtures where both species are subject to an optical lattice, it has been reported that the pairing phase appears for both repulsive as well as attractive BF interactions <cit.>. Furthermore, one could in principle expect a beating between the involved length scales, the Fermi wavenumber k_F and the optical lattice wavenumber k, that could, in principle, give rise to so-called Devil's staircase structures <cit.>. \n\nA last remark on the periodically modulated Peierls phase is in order. We have envisioned the boson superfluid as the agent creating a dynamical lattice for the fermions. We may consider the opposite viewpoint of a condensate living in a partially dynamic background. Within this perspective, the Peierls phase is reminiscent of a supersolid <cit.>, i.e. a superfluid state that has spontaneously broken the periodicity of the Hamiltonian. Somewhat similar scenarios have been studied in atomic condensates confined within optical resonators <cit.>. \n\n\n\n §.§ Stability of the Bose-Fermi mixture\n\n\nFor sufficiently strong BF interaction, the system is unstable towards long-wavelength fluctuations. The stability of BF mixtures without an optical lattice has already been investigated in e.g. <cit.>. Applying a hydrodynamic (mean-field) description of both fermions and bosons, a linear stability analysis yields the condition\n\n\n    n̅_f≥g_bf^2/2 g_f g_b,\n\n\nwhere g_f = π^2 / r. The fact that a high fermion density stabilizes the mixture is particular to the 1D case. Attractive interaction leads to a collapse of both species, while a repulsive interaction induces a phase separation where the bosons and fermions either avoid each other or lump together to form BF soliton mixtures <cit.>. More precisely, for repulsive boson-fermion interaction the bosons can form a dark soliton (density dip), filled by a bright fermionic soliton. For attractive interaction both species form a bright soliton. This is reminiscent of the Townes solitons predicted for electromagnetic waves <cit.>, and recently demonstrated in ultracold atomic Bose-Bose mixtures <cit.>. Soliton solutions are known to be unstable beyond the mean-field approach <cit.> but BF mixtures can form stable self-bound systems (e.g., in <cit.>,) which in 1D are stable within the mean-field approximation as well as to higher order <cit.>. In the course of our analysis, we will find out that an optical lattice increases the range of g_bf values for which the mixture is stable.\n\n\n\n§ METHODS\n\n\n\n\n §.§ A hybrid mean-field approximation\n\n\nTo investigate the pairing phase, we employ a “hybrid” approach that intertwines quantum and classical dynamics, an approach which has already been followed in <cit.>. We note that this method bears similarities to the mean-field approximation employed to derive the SSH model. It is also similar to the DFT method <cit.>. Due to the similarity with the SSH model, we will refer to the gapped phase in the hybrid approximation as the Peierls phase. For the ground state we adopt the ansatz \n\n\n    | Ψ⟩ = | ϕ_b ⟩⊗ | Ψ_f ⟩,\n\n\nwhere | Ψ_f ⟩ is a general state of N_f fermions, and | ψ_b ⟩ is a  (generalized) coherent state of the bosons satisfying <cit.>\n\n\n    ψ̂_b(x) | ψ_b ⟩ = ψ_b(x) |ψ_b ⟩,\n\n\nwith the complex variable ψ_b(x) called the condensate wavefunction or order parameter.  We assume the normalization ∫_0^L dx  |ψ_b(x)|^2 = 1 for a finite system and thereby factor out the total boson number N_b. If m_f / m_b = r ≪ 1, it is justified to assume an adiabatic approximation where the lighter fermions follow the heavier bosons. Under such conditions, any gauge potential <cit.>, characterizing non-adiabatic corrections and arising due to back-action between the condensate and the fermions, can be neglected. The fermionic part of the Hamiltonian can then be diagonalized while keeping the bosonic degrees of freedom fixed, thus acting as an “adiabatic potential”.  The approximation is equivalent to replacing the bosonic field operators by the condensate wavefunction in the Hamiltonian, yielding the hybrid operator\n\n\n    ℋ̂[ψ_b] = ℰ_b[ψ_b] + ∑_n ϵ_f,nψ̂_f,n^†ψ̂_f,n,\n\n\nwhere the mean-field energy functional of the bosonic part is\n\n\n    ℰ_b[ψ_b] = N_b ∫_0^L dx  ψ_b^* ( -∂^2/∂ x^2 + V_b + g_b N_b/2 |ψ_b|^2 ) ψ_b,\n\n\nand the second part is just the fermionic part of the Hamiltonian written in diagonal form, ϵ_f,n being the eigenvalues of the Hartree equation for the fermion orbitals, \n\n\n    ( -1/r∂^2/∂ x^2 + g_bf N_b |ψ_b|^2 ) ϕ_f,n = ϵ_f,nϕ_f,n.\n\n\nNote that the solution of this Hartree equation exhibits a functional dependence on the boson density, hence hereinafter we will write ϵ_f,n = ϵ_f,n[ψ_b]. From Eq. (<ref>), a nonlinear Schrödinger equation for ψ_b can be derived,\n\n\n    i ψ̇_b = ( -∂^2/∂ x^2 + V_b + g_b N_b |ψ_b|^2 + g_bf n_f ) ψ_b,\n\n\nwhere the expectation value of the fermion density can be calculated as\n\n\n    n_f(x) = ⟨ψ̂_f^†(x) ψ̂_f(x) ⟩ = ∑_n=1^N_f |ϕ_f,n(x)|^2.\n\n\nTo find the ground state, we resort to Eq. (<ref>) to numerically propagate an initial condensate wavefunction in imaginary time, employing the split-operator method <cit.>, which amounts to solving the eigenvalue problem (<ref>) at each time step. \n\nTo investigate the Peierls phase for a system of infinite extent, we will use the following prescription: Assume a filling ν_f = 1/2, so that we expect density modulations with a period of two sites. Since the modulations are commensurate with the optical lattice, the entire problem is periodic and the solutions of the Hartree equation are Bloch waves, with a reduced unit cell in reciprocal space due to the doubled periodicity in the Peierls phase. Again, for the system evolution we propagate in imaginary time, solving the Hartree equation at each time instant. The case of incommensurate fermion filling is interesting on its own, as it may lead to coexisting spatially separated regions of commensurable and incommensurate phases <cit.>. However, our method does not permit an incommensurate filling at present, hence we leave the problem aside for later investigation.\n\nFor the Peierls phase, we appeal to the same order parameter as in the SSH model, namely the energy gap of fermionic excitations above the Fermi surface,\n\n\n    Δ_P := lim_ϵ→ 0^+( E_f(k_F + ϵ) - E_f(k_F - ϵ) ),\n\n\nwhich in turn is identical to the gap of the hybrid Hamiltonian (<ref>). As we discuss in section <ref>, this quantity should approximate the excitation gap of the entire system.\n\n\n\n\n\n §.§ Thomas-Fermi approximation for the fermions\n\n\nTo detect the transition to the collapsed or separated phases, we resort to a Thomas-Fermi approximation for the fermions, as was done in <cit.>. We define a classical field ψ_f(x) = √(n_f(x)), called the Thomas-Fermi wavefunction, where n_f(x) is the ground state expectation value of the fermion density. The Thomas-Fermi energy functional is \n\n\n    ℰ[ψ_b, ψ_f] = ℰ_b[ψ_b] + ℰ_f[ψ_b, ψ_f]\n\n\nwhere the first term on the right is given by (<ref>) and the second by\n\n\n    [                                      ℰ_f[ψ_b, ψ_f]                                                  = N_f ∫ dx ( π^2 N_f^2/3 r |ψ_f|^6 + 1/r|∂ψ_f/∂ x|^2;                                                   ;                                                                                                                            + g_bf N_b |ψ_b|^2 |ψ_f|^2 ), ]\n\n\nagain assuming the normalization ∫ dx  |ψ_α|^2 = 1. Taking the functional derivative, we find an equation of a two-component Gross-Pitaevskii type, \n\n\n    [ i ∂_t ψ_b = ( -∂^2/∂ x^2 + V_OL + g_b N_b |ψ_b|^2 + g_bf N_f |ψ_f|^2 ) ψ_b,;                                                                            ; i ∂_t ψ_f = ( -1/r∂^2/∂ x^2 + π^2 N_f^2/r |ψ_f|^4 + g_bf N_b |ψ_b|^2 ) ψ_f. ]\n\n\nUsing again the split-operator method <cit.>, we then evolve an initial state in imaginary time to find the ground state. Due to the mass separation between the two species, one may argue that an adiabatic elimination of the fermion field should be justified. This would result in an effective bosonic model where the fermion mediated RKKY-like boson-boson interactions would appear. Such an approximation, however, has a negligible benefit to the numerical solution, whence we solve the full mean-field model expressed by Eqs. (<ref>).   \n\n\n\n\n\n§ RESULTS\n\n\n\n\n §.§ Translation-invariant BF mixture\n\n\nWe first focus on the periodic case in the absence of a trap, where we set V_trap = 0. This idealization represents the thermodynamic limit of the system, which is useful to study universal properties of the occurring phase transitions. A Bose-Fermi mixture with no lattice was studied in <cit.>, where it was reported that, for negative g_bf, a BKT transition separates a LL from a Peierls phase; the gap had the form of Eq. (<ref>).\n\nIn the upper two frames of Fig. <ref>, we depict the numerically extracted phase diagrams; frame (a) shows a region in the (g_bf, g_b) plane when keeping V_0 = 0 and r = 0.04 constant, while frame (b) displays a region in the (g_bf, V_0) plane for g_b = 0.4 and r = 0.04 constant. Both (a) and (b) show the region of stability of the Peierls phase towards collapse or separation (black solid lines), located via a calculation using the Thomas-Fermi approximation and compared to the mean-field prediction (<ref>) (black dotted lines). The transition is identified by detecting the discontinuity in the overlap between boson and fermion densities. The LL-to-Peierls transition (red solid lines) is calculated via the hybrid method, and the critical coupling g_c is obtained from a least square fit of the expression (<ref>) to the numerical data. From frame (a) we can conclude that the region of stability has an extent which abides by the inequality (<ref>), but more importantly that our method predicts a Peierls (i.e. pairing) phase for g_bf > 0, in disagreement with <cit.>. The reason for such a disparity could be simply attributed to the fact that the hybrid method entails the unphysical assumption that the solution is periodic, which makes the detection of a long-wavelength fluctuations difficult. From the literature on Bose-Fermi-Hubbard systems, where both gases are subject to an optical lattice, we however expect an optical lattice to stabilize the Peierls phase for repulsive interaction <cit.> and from frame (b) we infer that this is indeed the case: the optical lattice stabilizes the Peierls phase beyond the boundary set by condition (<ref>) for a homogeneous configuration. More precisely, the extent of this phase is growing with the optical lattice potential while the LL, collapsed, and separated phases are shrinking for the shown parameter ranges. Furthermore, the Peierls gap also grows with increasing lattice amplitude, meaning that it should be easier to observe in an experiment with a stronger optical lattice, provided the full system does not enter an insulating phase due to the inclusion of an optical lattice. \n\nTo illustrate the type of transition occurring between the LL and Peierls phases, Fig.Fig. <ref>(c) shows three examples of the Peierls gaps as a function of g_bf, for V_0 = 0, 4, and 8, keeping g_b = 0.4 constant. As demonstrated by the dotted curves, close to the critical value, the numerically extracted gaps fit very well the analytical expression (<ref>) for the gap of a BKT transition. Away from the critical point, there is a notable “knee” feature, which occurs when the bosons only populate every other site, and solely for V_0 ≠ 0. We have also studied the fermion one-particle density matrix for this state (not displayed) on either side of the knee. It displays an exponential decay, as we expect for a gapped system, however we find different density oscillations superimposed on top of each other in the Peierls phase. Beyond the knee, these oscillations vanish and the decay rate is increased, which we believe could signal the presence of a possible BF insulating phase. To confirm such statement one should preferably go beyond the hybrid mean-field ansatz. Fig. <ref>(d) displays the density of bosons and fermions within the unit cell, as a typical example for a particular point picked in the phase diagram: V_0 = 1, g_b = 0.4, and g_bf = -1. The doubling of the periodicity is in evidence. Contrary to most earlier studies, our method is capable of capturing both amplitude and phase modulations, however we only find modulations in amplitude. For the repulsive case, g_bf>0, the situation is similar to that shown in (d), but with the two densities being “out-of-phase” instead. \n\nIn order to experimentally probe the phase diagram, one must detect the order parameter or any other quantity capable of telling the different phases apart. The gap could, in principle, be extracted via pump-probe experiments <cit.>, while one could also imagine transport experiments to differentiate insulating and conduction phases, i.e. Peierls vs. LL. As will be evident in the next section, the trap induces a varying Fermi wave number k_F which makes the Peierls gap opening not that pronounced. In a time-of-flight detection, for instance, the Bragg peaks are smeared out, and the particular one corresponding to the gap is almost invisible. Hence, in a realistic setup, including the trap, time-of-flight measurements might not turn out to be the most optimal scheme. Instead, the onsite densities, which display alternating variations, could be accessed via single-site resolution detection <cit.>. This technique has been successfully implemented for cold fermionic gases, including even detection of higher order correlators <cit.>.\n\n\n\n §.§ BF mixture in a harmonic trap\n\n\nCurrent experiments rely on harmonic potentials for the attainment of sufficiently long trapping times. However, the trap may have a relatively small frequency yet still confine the atoms, such that the system locally experiences a periodic potential. To study these more realistic situations, we include a harmonic trap into our analysis, but still consider a very tight transverse confinement and consequently a quasi-1D configuration. \n\n\n\nWe have used the hybrid method to investigate the different phases in the aforementioned setup.  Figure <ref> presents the numerical results obtained for the densities – in the upper row we give the real-space densities and in the lower row the fermion density per site, which could be in principle accessed in an experiment as we mentioned in the last section. Depicted in the left column, we find a new insulating state which is not present in the translationally invariant system. We call this a wedding cake in analogy to the wedding cake-like structure found in the harmonically confined Bose-Hubbard model <cit.> but also in fermionic systems <cit.>. Here, the fermions form plateaus (“layers of the cake”) with an integer number of fermions per site. In the figure, there is a plateau of three fermions per site in the center of the trap, changing in a step-like fashion to two and finally one fermion per site as we move further out from the center. The wedding cake results from an interplay between kinetic, potential and interaction energies, and only appears when an optical lattice is present. It cannot be modelled using a local density approximation due to the abrupt changes in the density. \n\nIn the central column of Fig. <ref>, we detail the correspondence to the Peierls phase occurring in the absence of a trap. In general, the boson and fermion clouds form a region of a size determined by the trapping strength alongside the BB and BF interactions. The optical lattice leads to a spatial variation of the bosonic profile, imparted to the fermions via the BF interaction. The Friedel oscillations of the fermions in this potential are then imprinted on the bosons via the RKKY interaction. Because the Peierls phase is a compressible supersolid, the wavelength varies continuously over the width of the trap. Therefore, in the trapped system, the Peierls modulations are generally not commensurate with the lattice. These modulations may be detected using single-site addressing, leading to a spatial variation in density that cannot be attributed to the profile of the trap or that of the optical lattice. We note here that the beating between the fermion and the optical lattice wavenumbers may give rise to local commensurate-incommensurate transitions in which the fermionic wavenumber of an atomic density wave spatially adjusts to the optical lattice period <cit.>. \n\nFor any positive value of g_bf, and any strength of the optical lattice, we have found that the system phases separate. The rightmost column of Fig. <ref> shows the separated state, where the heaviest atoms occupy the center of the trap, surrounded by regions of the lighter species. Perhaps the most surprising feature of Fig. <ref> is the appearance of the wedding cake phase where we would expect a collapsed phase. The integer filling per site clearly indicates a fermionic Mott insulator state <cit.>. One way to investigate whether this instance is something more than a coincidence is to look at the off-diagonal elements of the one-particle density matrix, reading \n\n\n    ⟨ψ̂_f^†(x) ψ̂_f(x') ⟩ = ∑_n=0^N_fϕ_f,n^*(x) ϕ_f,n(x').\n\n\nAn isolating state is expected to have an exponentially decaying one-particle density matrix <cit.>.\n\nIn Fig. <ref>, we focus on a further comparison between the wedding cake (left column) and Peierls (right column) phases. In the upper row, we plot the fermion number per optical lattice site, while in the lower row, we display the corresponding one-body density matrix. We observe that the wedding cake is distinct by having an integer number of fermions per site. We have numerically verified that both phases are characterized by an exponential decay of the one-particle density matrix, which is typically what one expects for insulators. From the figure it is clear that this decay is much more pronounced for the wedding-cake state – deduced from the smallness of the non-diagonal matrix elements – a feature which in turn signals the opening of a more pronounced gap in the spectrum.  \n\n\n\n§ CONCLUDING REMARKS\n\n\nWe have investigated a dilute mixture of two gases, one fermionic and one bosonic. The gases are confined in a cylindrical trap so that the low-energy physical behaviour of the system is effectively one-dimensional. An optical lattice was considered in order to imprint a period structure onto the bosonic gas. We have focused on a weak optical lattice and a high density of bosons, such that the bosons form a condensate. \n\nWe confirmed that a Peierls instability, manifested via a BKT-type phase transition to a Peierls phase, persists when an optical lattice potential is applied solely to the bosons. Moreover, the presence of this phase was found to stabilize the system against collapse and separation, as well as to enhance the significance of the Peierls effect, a property which is highly desirable for experimental explorations of related phonon-like physics. The presence of the Peierls phase was confirmed upon developing and applying a hybrid mean-field method. It is interesting to note that such a method is able to reveal the BKT nature of the phase transition, as well as the similarity to the SSH model of the Peierls instability. The crucial scaling is captured by the method we have developed owing to the fact that we take the deformation of the Fermi surface into account, while we also retain the quantum degrees of freedom for the fermions albeit within an adiabatic approximation.\n\nThe natural step forwards would be to take quantum fluctuations of the boson degrees of freedom into account. This entails the development of a formulation and related numerical methods manifestly beyond any mean-field reduction, and to that aim we outline possible directions for deriving the corresponding many-body Hamiltonian in App. <ref> below. Another promising direction for future research concerns the investigation of fermion fillings incommensurate with the optical lattice as well as studying the quenched time-evolution problem of a single fermion in a dynamical bosonic potential. Furthermore, an interesting extension replaces the optical lattice with a BB mixture, using either trapped ions or dipole bosons. Finally, such systems could be analyzed in greater detail using matrix product states or bosonization techniques.\n\n\n\n\n\n§ ROUTES TOWARDS KNOWN QUANTUM MANY-BODY MODELS\n\n\nIn section <ref>, we reported on the presence of a Peierls phase at a hybrid mean-field level. We argue that this incorporates the pairing effect in a qualitative way. However, there are clear limitations with such an approach. Effectively, the model is a free fermion theory and as long as there is a finite Peierls gap, Δ≠0, we find a trivial insulator with exponentially decaying order. This is not what one expects from a BKT transition where one phase should exhibit algebraic decay. Furthermore, the classical field stemming from the boson condensation cannot build up quantum correlations with the fermions, while a quantum field can. To quantitatively analyze such situations one must go beyond mean-field. In this appendix we outline, without going into details, two possible approaches in order to derive effective Hamiltonians for which both species are treated quantum mechanically.\n\nIn <cit.>, the condensate wavefunction was calculated for zero interaction between the species, and subsequently Bogoliubov excitations around the mean-field response were taken into account, arising from a small interaction. Due to the presence of a deep external lattice potential in their model, a Hubbard-Holstein model is obtained which can be understood in terms of polarons. In our case, we instead find the fermion-phonon Hamiltonian\n\n\n    ℋ̂ =    ℋ̂_f + ∑_μω_μ∫ dx  ( M_μb̂_μ + M_μ^* b̂_μ^†) ρ̂_f \n        + g_bf∫ dx |ϕ_b|^2 ρ̂_f + ∑_μω_μb̂_μ^†b̂_μ,\n\n\nwhere\n\n\n    M_μ(x) = u_μ(x) - v_μ(x)\n\n\nare given in terms of the u_μ(x), v_μ(x) of the Bogoliubov transformation and ω_μ are the energies of the Bogoliubov modes. The third term will confine the fermions to their lowest Bloch band if the interaction is strong enough, and in this limit the model approaches the Hubbard-Holstein model of <cit.>. However, the approach above would have to be modified since it rests on the assumption that g_bf is weak. \n\n\n\nFor a deep optical lattice one could come up with another method: expand the boson field in the corresponding Wannier functions, w_j(x) localized at site j, as <cit.>\n\n\n    ψ̂_b(x)=∑_jâ_jw_j(x).\n\n\nIf we expand the fermion field as ψ̂_f(x)=∑_kĉ_ke^ikx and impose the single-band and tight-binding approximations, we arrive at the many-body Hamiltonian\n\n\n    ℋ̂_mb    = ℋ̂_BH +∑_kk^2/rĉ_k^†ĉ_k \n        +N̂_b∑_k,k'[D(k-k')ĉ_k^†ĉ_k'+h.c.],\n\n\nwhere\n\n\n    ℋ̂_BH    =-J∑_j(â_j^†â_j+1+h.c.) \n        +U/2∑_jn̂_j(n̂_j-1),\n\n\nis the Bose-Hubbard Hamiltonian, with J and U the tunneling rate and onsite interaction strengths, respectively, n̂_j=â_j^†â_j, and D(k-k') is the overlap integral (which is Gaussian in the harmonic approximation). Since N̂_b is preserved, the quadratic fermionic Hamiltonian can be readily diagonalized, and we find no back-action on the bosons due to the fermions. To incorporate such effects one would need to go beyond the single-band or tight-binding approximations. Alternatively, the approximations may be kept but other additional degrees of freedom should be introduced corresponding to the phonon modes. For heavy bosons one can follow the idea of <cit.> to allow a variation in the position of the centers, jπ, of the Wannier functions, but keeping the shape of the functions intact. Thus, we associate a quantized shift δ̂_j with each Wannier function, w_j(x)→ w_j(x-δ̂_j). Assuming small shifts δ̂ ̂x̂_j≪1 one may then expand to linear order in the shifts and derive an effective Fröhlich-like Hamiltonian <cit.>\n\n    ℋ̂_Fr=ℋ̂_mb+ℋ̂_BP+ℋ̂_FBP,\n\nwhere the boson-phonon interaction is given by\n\n    [                                 ℋ̂_BP                                     = -J_1∑_j(δ̂_j+1-δ̂_j)(â_j^†â_j+1+h.c.);                                      ;                                                                                        +U_1/2∑_jδ̂_jn̂_j(n̂_j-1). ]\n\nIf we introduce the local phonon annihilation/creation operators d̂_j/d̂_j^†, the phonon displacement is expressed as \n\n\n    δ̂_j=(d̂_j+d̂_j^†)/2,\n\n\nwhile the fermion-boson-phonon interaction term takes the form\n\n    ℋ̂_FBP=μN̂_d+∑_j∑_k,k'n̂_jD_1(k-k')δ̂_jĉ_k^†ĉ_k',\n\nwith the first term being the bare phonon energy  (μ is the characteristic frequency and N̂_d=∑_jd̂_h^†d̂_j). In principle, within the harmonic approximation, the coefficients J_1, U_1 and D_1 can be analytically determined. Both ℋ̂_BP and ℋ̂_FBP describe phonon-assisted tunneling, either between neighbouring lattice sites (bosons) or between different momentum modes (fermions). It may be noted that if g_bf=0, then D(k-k')=D_1(k-k')=0 and N̂_d=0 such that ℋ̂_BP=0. \n\n\n\n§ THE HYBRID MEAN-FIELD–QUANTUM METHOD\n\n\nIn this appendix we provide some further details about the employed hybrid mean-field ansatz. As already mentioned in section <ref>, a gap of the form (<ref>) opens up in the pairing phase. A superfluid of bosons is gapless and, to lowest order, is described by the condensate wavefunction ψ_b(x) – the mean-field order parameter. We define the generalized coherent state\n\n\n    |ψ_b⟩ = exp( ∫ dx  ψ_b(x) ψ̂_̂b̂^†(x) - h.c.) |0⟩,\n\n\nwhere |0⟩ is the bosonic vacuum. Taking the expectation value of the time-dependent Schrödinger equation, we obtain an effective hybrid Hamiltonian\n\n\n    ℋ̂_eff = ℰ_b[ψ_b] + ℋ̂_f[ψ_b] - i ψ_b∂_tψ_b,\n\n\nwhere the first term is given by (<ref>), the second term is\n\n\n    ℋ̂_f[ψ_b] = ∫ dx  ψ̂_f^†( -1/r∂^2/∂ x^2 + V_f + g_bf |ψ_b|^2 ) ψ̂_f,\n\n\nand the third term is the Berry connection <cit.>. We will assume the condensate to change slowly so that this term can be neglected. \n\nThe above is equivalent to a product-state ansatz for the ground state\n\n\n    |Ψ_0⟩ = |ψ_b⟩⊗|Ψ_f⟩,\n\n\nwhere |Ψ_f⟩ is a general fermion state of N_f fermions. Such an ansatz neglects any entanglement built between the bosons and fermion subsystems; correlations may actually arise within the non-condensed fraction of bosons and, more importantly, different configurations of the condensate may get entangled with the fermions. In general, such mixed quantum-classical dynamics is interesting in a much wider context in condensed matter physics, high-energy physics and quantum gravity, and has been investigated in detail in  <cit.>. In <cit.>, a multi-configurational mean-field approximation based on hybrid quantum-classical theory was developed, with the central  object being the quantum-classical distribution function – a map from the classical phase space to the set of quantum density operators, defined as\n\n\n    ρ̂(𝐪, 𝐩) = ∑_ijϱ_ij |Ψ_i⟩⟨Ψ_j | δ(𝐪 - 𝐪_ij) δ(𝐩 - 𝐩_ij),\n\n\nwhere 𝐪, 𝐩 are the classical generalized coordinates and momenta, and | ψ_i ⟩ is a basis state of the quantum subsystem. In this formalism, “non-diagonal” contributions correspond to the quantum subsystem generating a coupling between different trajectories of the classical subsystems. When considering only a single trajectory, the quantum-classical distribution function can be written as a single delta-function term,\n\n\n    ρ̂[ψ_b'] = |Ψ_f⟩⟨Ψ_f | δ[ψ_b - ψ_b'],\n\n\nwhere the brackets indicate a functional dependence. In other words, the system is represented by a single point in classical phase space, evolving with a quantum density matrix of a pure state. \n\nWe find the ground state of Ĥ_eff self-consistently first observing that it can be readily diagonalized by selecting  \n\n\n    ψ̂_f(x) = ∑_n ϕ_f,n(x) ψ̂_n,\n\n\nwhere the orbitals are solutions of the Hartree (single-particle) equation\n\n\n    ( -1/r∂^2/∂ x^2 + g_bf N_b |ψ_b|^2 ) ϕ_f,n = ϵ_f,nϕ_f,n.\n\n\nSecond, we define a non-linear Schrödinger equation for the condensate,\n\n\n    [                                                 i ψ̇_b                                                      =                                    δ/δψ_b^*Ψ_fĤ_effΨ_f;                                                       ;                                                                                                             = ( -∂^2/∂ x^2 + V_b + g_b N_b |ψ_b|^2 + g_bf n_f ) ψ_b, ]\n\n\nwhere\n\n\n    n_f(x) = Ψ_fψ̂_f^†(x) ψ̂_f(x)Ψ_f = ∑_n |ϕ_f,n(x)|^2\n\n\ndepends explicitly on the bosons through (<ref>). The ground state of (<ref>) is found from imaginary time propagation utilizing the split-operator method <cit.>. \n\nAs mentioned in section <ref>, the above method can also be easily adapted to study a translationally invariant system of infinite extent for fermion filling ν_f = 1/2. In this case, we assume a periodic solution ψ_b(x + 4 π) = ψ_b(x). The solutions of the Hartree equations are then Bloch waves e^i q x/2 u_f,n(q, x). Due to the assumed double periodicity of 4 π, the first Brillouin zone is halved and the fermionic filling is in direct correspondence to the edges of the Brillouin zone. It is straightforward to find the fermion density as the integral \n\n\n    n_f(x) = ∫_1BZ dq   |u_f,0(q, x)|^2.\n\n\nAnother important difference here is that we have to diagonalize the Bloch/Hartree equation for each quasi-momentum – in practice for a number of sampled values. Apart from these discrepancies between the two methods, the solution to Eq. (<ref>) is also found using imaginary time propagation.\n\n\nWe thank Maciej Lewenstein, Hannes Conners, and Christophe Salomon for helpful discussions and comments. We acknowledge financial support from VR-Vetenskapsrådet (The Swedish Research Council), and KAW (The Knut and Alice Wallenberg foundation). Th. K. M. acknowledges support from: ERC AdG NOQIA; Ministerio de Ciencia y Innovation Agencia Estatal de Investigaciones (PGC2018-097027-B-I00/10.13039/501100011033, CEX2019-000910-S/10.13039/501100011033, Plan National FIDEUA PID2019-106901GB-I00, FPI, QUANTERA MAQS PCI2019-111828-2, QUANTERA DYNAMITE PCI2022-132919, Proyectos de I+D+I “Retos Colaboración” QUSPIN RTC2019-007196-7); MICIIN with funding from European Union NextGenerationEU(PRTR-C17.I1) and by Generalitat de Catalunya; Fundació Cellex; Fundació Mir-Puig; Generalitat de Catalunya (European Social Fund FEDER and CERCA program, AGAUR Grant No. 2021 SGR 01452, QuantumCAT  U16-011424, co-funded by ERDF Operational Program of Catalonia 2014-2020); Barcelona Supercomputing Center MareNostrum (FI-2022-1-0042); EU Horizon 2020 FET-OPEN OPTOlogic (Grant No 899794); EU Horizon Europe Program (Grant Agreement 101080086 — NeQST), National Science Centre, Poland (Symfonia Grant No. 2016/20/W/ST4/00314); ICFO Internal “QuantumGaudi” project; European Union's Horizon 2020 research and innovation program under the Marie-Skłodowska-Curie grant agreement No 101029393 (STREDCH) and No 847648 (“La Caixa” Junior Leaders fellowships ID100010434: LCF/BQ/PI19/11690013, LCF/BQ/PI20/11760031, LCF/BQ/PR20/11770012, LCF/BQ/PR21/11840013). Views and opinions expressed in this work are, however, those of the author(s) only and do not necessarily reflect those of the European Union, European Climate, Infrastructure and Environment Executive Agency (CINEA), nor any other granting authority. Neither the European Union nor any granting authority can be held responsible for them.\n\n\n\nunsrtnat\n\n"}