{"entry_id": "http://arxiv.org/abs/2303.07082v1", "published": "20230313130727", "title": "Optimal Parameter Configurations for Sequential Optimization of Variational Quantum Eigensolver", "authors": ["Katsuhiro Endo", "Yuki Sato", "Rudy Raymond", "Kaito Wada", "Naoki Yamamoto", "Hiroshi C. Watanabe"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\n\n\n\n\n\nResearch Center for Computational Design of Advanced Functional Materials, National Institute of Advanced Industrial Science and Technology (AIST), 1-1-1 Umezono, Tsukuba, Ibaraki, 305-8568, Japan\nQuantum Computing Center, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\n\n\n\nToyota Central R & D Labs., Inc., Koraku Mori Building 10F, 1-4-14 Koraku, Bunkyo-ku, Tokyo 112-0004, Japan\nQuantum Computing Center, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\n\n\nIBM Quantum, IBM Japan, 19-21 Nihonbashi Hakozaki-cho, Chuo-ku, Tokyo 103-8510, Japan\nQuantum Computing Center, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\nDepartment of Computer Science, The University of Tokyo, 7-3-1, Hongo, Bunkyo-ku, Tokyo 113-0033, Japan\n\n\nDepartment of Applied Physics and Physico-Informatics, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\n\n\nQuantum Computing Center, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\nDepartment of Applied Physics and Physico-Informatics, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\n\n\n\n\n\n\nQuantum Computing Center, Keio University, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223-8522, Japan\n\n\n\nVariational Quantum Eigensolver (VQE) is a hybrid algorithm for finding the minimum eigenvalue/vector of a given Hamiltonian by optimizing a parametrized quantum circuit (PQC) using a classical computer. \nSequential optimization methods, which are often used in quantum circuit tensor networks, are popular for optimizing the parametrized gates of PQCs.  \nThis paper focuses on the case where the components to be optimized are single-qubit gates, in which the analytic optimization of a single-qubit gate is sequentially performed.\nThe analytical solution is given by diagonalization of a matrix whose elements are computed from the expectation values of observables specified by a set of predetermined parameters which we call the parameter configurations. \nIn this study, we first show that the optimization accuracy significantly depends on the choice of parameter configurations due to the statistical errors in the expectation values. \nWe then identify a metric that quantifies the optimization accuracy of a parameter configuration for all possible statistical errors, named configuration overhead/cost or C-cost.\nWe theoretically provide the lower bound of C-cost and show that, for the minimum size of parameter configurations, the lower bound is achieved if and only if the parameter configuration satisfies the so-called equiangular line condition.\nFinally, we provide numerical experiments demonstrating that the optimal parameter configuration exhibits the best result in several VQE problems.\nWe hope that this general statistical methodology will enhance the efficacy of sequential optimization of PQCs for solving practical problems with near-term quantum devices.\n\n\n\n\nOptimal Parameter Configurations for Sequential Optimization of Variational Quantum Eigensolver\n\n    Hiroshi C. Watanabe\n    March 30, 2023\n=================================================================================================\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nVariational Quantum Eigensolver (VQE) <cit.> \nis a classical-quantum hybrid algorithm implementable on near-term quantum devices, \nfor finding the minimum eigenvalue/vector of a given Hamiltonian; \nthe recipe is simply to prepare a parametrized quantum circuit (PQC) U(θ), also called ansatz, \nand then find a parameter θ that minimizes \n⟨ H ⟩ = \n⟨ψ|U(θ)^† H U(θ)|ψ⟩ with some initial \nstate |ψ⟩. \nNote that VQE is a class of the variational quantum algorithms (VQAs) \n<cit.>, where in general the cost is a non-linear \nfunction of the expectation values of some Hamiltonians. \nVQA has a wide range of applications, such as quantum chemical calculations <cit.>, combinatorial optimization <cit.>, and linear equation solvers <cit.>. \n\n\n\n\n\n\n\nThe core question is how to model the PQC U(θ) and how to minimize \n⟨ H ⟩ with some classical optimizer. \nThere have been extensive investigation on this problem <cit.>. \nIn particular, the sequential optimization method have been used in a variety \nof settings such as quantum circuit tensor-networks \n<cit.>, \nwhere θ corresponds to a set of local unitaries and they are sequentually \noptimized one by one. \nIn this paper, we focus on the special type of sequential optimization method developed \nin Refs. <cit.>. \nIn this framework, θ are the parameters characterizing the set of single-qubit \nrotation gates such as R_y(θ) = e^iθ Y (Y is the Pauli y \nmatrix) in the case of Rotosolve <cit.>. \nThen the sequential optimization method takes the strategy to exactly optimize \nthe single rotation gates one by one. \nFor example, consider the step where we optimize the R_y(θ) gate contained \nin the PQC shown in Fig. <ref> by minimizing the cost ⟨ H ⟩ \nas a function of θ. \nThe point is that, in this case, ⟨ H ⟩ must be of the form of a sinusoidal \nfunction with respect to θ, and thus the optimal θ_ opt can be exactly \ndetermined once we identify the sinusoidal function shown by the black curve in the figure. \nIn particular, as a nature of sinusoidal function, specifying the mean values of three \nobservables corresponding to the three points of θ allows us to exactly identify \n⟨ H ⟩; \nwe call the alignment of these three points of θ the parameter configuration. \nNote that, in the case of Free axis selection (Fraxis) <cit.> where the freedom of a single-qubit \nrotation gate is served by the rotation axis with fixed rotation angle in the Bloch sphere, \n⟨ H ⟩ takes the form of a quadratic function of a real normalized vector \nn=(x,y,z)^T, which can also be exactly minimized. \nThis setup was further generalized to Free Quaternion Selection (FQS) \n<cit.> so that the rotation angle can also be tuned; \nthen ⟨ H ⟩ takes the form of a quadratic function of a real normalized \nvector q=(w,x,y,z)^T. \nIn this case, as shown later, the mean values of 10 observables corresponding to 10 points \nof q identify ⟨ H ⟩; we also call this {q_1, …, q_10} \nthe parameter configuration. \n\n\n\n\nHowever, this optimization strategy relies on the critical assumption that the mean \nvalues of observables and accordingly ⟨ H ⟩ are exactly identified. \nIn reality, those mean values can only be approximately obtained as the average of \na finite number of measurement results; that is, practically there is always a \nstatistical error in ⟨ H ⟩. \nIn the above one-dimensional case, as illustrated in Fig. <ref>, the energy \ncurve, θ_opt, and consequently the minimum value of ⟨ H ⟩ may \nall largely fluctuate depending on the parameter configuration. \nHence the question is what is the best parameter configuration for achieving a small \nfluctuation of min⟨ H ⟩. \nIn the above one-dimensional case, we have an intuition that the best configuration might \nbe such that the three parameters are equally spaced (i.e., equidistant), as shown in the \nleft bottom of Fig. <ref>, which is indeed true as proven later. \nHowever, the general case is of course nontrivial; will we have such equidistant \nconfiguration in some sense, or some biased configuration would be the best? \n\n\n\n\n\n\n\n\n\n\nIn this paper, we develop the theory for determining the optimal parameter configuration. \nAs a preliminary result, in Sec. <ref>, we prove that, if the exact \nexpectation values are available without any statistical error, then we have analytical \nsolution of the best parameters achieving min⟨ H ⟩ (almost) without \nrespect to the parameter configuration for every method of \n<cit.>. \nThen, in Sec. <ref>, we give the most essential result providing the basis \nof the theory; that is, we derive the explicit form of the fluctuation of \nmin⟨ H ⟩ under statistical errors, with respect to the parameter \nconfiguration. \nThis enables us to introduce the C-cost (configuration cost/overhead), a useful metric for \ndetermining min⟨ H ⟩ and thereby providing us with the optimal \nparameter configuration. \nActually, Sec. <ref> gives numerical experiments to demonstrate that \nthe optimal parameter configurations obtained using C-cost yield the best result in \nthe sense of the statistical error of estimating ⟨ H ⟩. \n\n\n\nNotably, beyond such utilization for numerically determining the configuration, the \nC-cost satisfies several interesting mathematical properties, suggesting the relevance \nof this metric. \nThe first is that the lower bound of C-cost is 1; moreover, we prove that, for the \nminimum size of the parameter set, this bound is achievable if and only if the parameter \nconfiguration satisfies a geometric condition called the equiangular line condition, \nan important and beautiful mathematical concept in algebraic graph theory. Here, each parameter q corresponds to a line that passes the origin and q.\nThis condition rigorously supports our above-described intuition that it would be desirable \nfor the parameters to be equally spaced for the Rotosolve case shown in \nFig. <ref> or Fig. <ref>A; \nthis intuition holds for the case of Fraxis, showing that there is a unique parameter \nconfiguration (up to the global rotation) satisfying the equiangular line condition, \nas displayed in Fig. <ref>B. \nBut interestingly, this intuition does not apply to the most general FQS case due to the \nnon-existence of 10 equiangular lines in ℝ^4. \nThat is, the so-called Gerzon bounds <cit.>, Neumann theorem <cit.> \nand Haantjes bound <cit.> prove that \nthere does not exist a set of 10 lines satisfying the equiangular line condition in ℝ^4; the maximum number of such lines is 6. \n\n\nNevertheless, the C-cost is still useful in this case, as it gives us a means to numerically obtain \nthe optimal parameter configuration, which is displayed in Fig. <ref>C. \n\nFurthermore, if redundant measurements are allowed, there exists \nparameter configurations that achieves the theoretical lower bound of the C-cost, \none of which is illustrated in Fig. <ref>D. \n\n\n\nFinally, we note that equiangular lines in complex spaces are equivalent to symmetric, informationally complete (SIC) POVMs <cit.> whose properties have been much studied, e.g., it is conjectured that there is always a set of d^2 equiangular lines in ℂ^d <cit.> (it has been proven up to some large d theoretically and numerically). The SIC POVMs defined from such lines are informationally complete because the results of other measurements can be computed from those of the SIC POVMs. In this study, we obtain similar results connecting equiangular lines in real spaces with the variational quantum circuits using parametrized single-qubit gates.\n\n\n\n\n\n\n\n\n\n\n\n§ ENERGY MINIMIZATION WITH MATRIX FACTORIZATION\n \n\n\n\n\n\n §.§ Brief review of Rotosolve, Fraxis, and FQS\n\n\nFQS method <cit.> describes the procedure to completely characterize the energy landscape with respect to a single-qubit gate in a PQC.\n\nThe parametrized single-qubit gate, which we call FQS gate, is none other than the general single-qubit gate U^(4) expressed as <cit.>\n\n    U^(4)(q) = wI - xiX - yiY - ziZ =q·ς⃗,\n\nwhere the superscipt indicates the number of parameters: q=(w,x,y,z)^T∈ℝ^4 satisfying q^2=1.\nHere, i is the imaginary unit, I is the 2×2 identity matrix, and X, Y, Z are the Pauli matrices.\n\nς⃗=(ς_I,ς_X,ς_Y,ς_Z)^T denotes an extension of the Pauli matrices defined as\n\n    ς⃗=(I,-iX,-iY,-iZ)^T.\n\nThe dimension of the parameter q is four, but since the parameter q is constrained on the unit hyper-sphere, the degree of freedom of the parameter is three.\n\n\n\n\n\n\n\n\nIn Fraxis, the rotation angle is constrained to π, which corresponds to the case \nw=0 of Eq. (<ref>) as\n\n    U^(3)(n) = -xiX -yiY - ziZ,\n\nwhere the parameter of the gate is n=(x,y,z)^T such that n^2=1. \nWe term this U^(3) as Fraxis gate. \nThus, the Fraxis gate has two degrees of freedom.\n\n\n\nIn Rotosolve, the rotation axis is fixed and the rotation angle serves as the parameter.\nIn particular, Rx gate fixes the rotation axis to the x-axis; in the form \nof Eq. (<ref>), this corresponds to y=z=0 and thus\n\n    U^(2)(r) = wI - xiX,\n\nwhere the parameter of the gate is r=(w,x)^T such that r^2=1.\nThus, the degree of freedom of Rx gate is one. \nSimilarly, Ry and Rz gates are obtained by replacing X in Eq. (<ref>) \nwith Y and Z, respectively. \n\n\n\nIn what follows we use the most general FQS gate to describe the optimization \nalgorithm. \nThe sequential optimization method takes the strategy to update respective FQS gates \nin a coordinate-wise manner, where all parameters are fixed except for the focused FQS \ngate U^(4)( q). \nThe entire quantum circuit containing FQS gates is supposed to be the PQC \nV=∏_i U^(4)_i( q_i) W_i on the n-qubit system, where U^(4)_i is the ith FQS  gate and W_i is a fixed multi-qubit gate.\n\n\n\nNow, let V_1 and V_2 be the gates placed before and after the focused FQS gate U^(4)( q).\n\nThen, a density matrix ρ prepared by the PQC is expressed as \n\n    ρ = V_2 U^(4)(q) V_1ρ_ in V_1^†(U^(4)(q) )^† V_2^†,\n\nwhere ρ_ in is an input density matrix.\n\nThus, the expectation value ⟨ H ⟩ of given Hamiltonian H with respect \nto ρ is then \n\n    ⟨ H ⟩   =   HV_2 U^(4)(q) V_1ρ_ in V_1^†(U^(4)(q))^† V_2^†\n       =   H' U^(4)(q) ρ'_ in(U^(4)(q))^†,\n\nwhere \n\nH' = V_2^† H V_2 and ρ'_ in = V_1 ρ_ in V_1^†. \n\nSubstituting Eq. (<ref>) into Eq. (<ref>) yields\n\n    ⟨H|=⟩q^T G^(4)q,\n\nwhere G^(4) is a 4× 4 real-symmetric matrix:\n\n    G^(4) = [ G_II G_IX G_IY G_IZ; G_IX G_XX G_XY G_XZ; G_IY G_XY G_YY G_YZ; G_IZ G_XZ G_YZ G_ZZ ],\n\nand each element, G_μν (μ,ν=I,X,Y,Z), is defined by\n\n    G_μν=1/2ρ'_ in(ς_μ^† H'ς_ν+ς_ν^† H'ς_μ).\n\nThus the energy landscape with respect to the FQS gate is completely characterized by the matrix G^(4).\nBecause Eq. (<ref>) is a quadratic form with respect to the parameter q \nwith the constraint q^2=1, the eigenvector \np_1 associated with the lowest eigenvalue λ_1 of the matrix G^(4) minimizes the energy (<ref>); see Appendix <ref> for the details.\n\nIn the following, we call the matrix G^(4) FQS matrix. \nNote that the above result can be directly extended to the case of Fraxis and Rotosolve, in which case Eq. (<ref>) is replaced by \n\n\n    G^(3) = [ G_XX G_XY G_XZ; G_XY G_YY G_YZ; G_XZ G_YZ G_ZZ ],\n\nand\n\n    G^(2) = [ G_II G_IX; G_IX G_XX ],\n\nrespectively.\n\n\n\n\n\n §.§ FQS with arbitrary parameter configurations\n\n\n\n\n\n\nSince G^(4) is a real-symmetric matrix, we can expand Eq. (<ref>) as the following form:\n\n    ⟨ H ⟩   = G_II w^2\n        + G_XX x^2\n        + G_YY y^2\n        + G_ZZ z^2 \n       + 2 G_IX wx\n        + 2 G_IY wy\n        + 2 G_IZ wz \n       + 2 G_XY xy\n        + 2 G_XZ xz\n        + 2 G_YZ yz.\n\n\nEq. (<ref>) indicates that, if we know all the 10 coefficients  \n(G_II,...,G_YZ), we can exactly estimate the expectation ⟨ H ⟩ \nfor any parameter q. \n\nIn other words, only algebraic calculations on classical computers are required to find the parameters achieving the minimum expectation value for the target gate. \n\n\nTherefore, it is important to obtain the coefficients with as few measurements as \npossible. \nTo consider this problem, we define the function h^(4)(q) that outputs the \nnormalized vector (h^(4)(q)=1): \n\n    h^(4)(q) \n        =\n        (w^2, x^2, y^2, z^2, √(2)wx, √(2)wy, √(2)wz, √(2)xy, √(2)xz, √(2)yz)^T,\n\nand the vector g^(4)\n\n    g^(4)   =(\n        G_II,G_XX,G_YY,G_ZZ, \n       √(2)G_IX, \n        √(2)G_IY,\n        √(2)G_IZ,\n        √(2)G_XY,\n        √(2)G_XZ,\n        √(2)G_YZ)^T.\n\n\nThen, the relation between the parameter q and the expectation \n⟨ H ⟩ is expressed as \n\n    ⟨ H ⟩ = h^(4)(q)^T  g^(4).\n\n\n\n\nSuppose measurements with different parameters {q_1, ..., q_N} and the N expectation values of the measurement results b=(b_1, ..., b_N)^T were obtained,\nwe can also write the relations between the expectation values b and the coefficient vector g^(4) as \n\n    b = A^(4)g^(4),\n\nwhere the matrix A^(4)∈ℝ^N × 10 is\n\n    A^(4) = ( h^(4)(q_1), ..., h^(4)(q_N) )^T,\n\nthat encodes the information of the parameter configurations {q_1, ..., q_N}.\n\n\nIt is obvious, if N<10, g^(4) is not uniquely determined.\nHence, we suppose N≥ 10 throughout this paper.\nIf rank(A)=10, A^TA is invertible and there exists the generalized inverse of  A^+:=(A^TA)^-1A^T  <cit.>. \nAccordingly, we can obtain the vector g^(4) by exactly solving linear equations as\n\n    g^(4) = A^+b.\n\nIn other words, a single execution of FQS requires at least ten sets of the parameters and the corresponding observables.\nHowever, it may not necessarily be the case when input states and/or Hamiltonian has symmetry, which reduces the number of required measurements to construct G^(4) in Eq. (<ref>).\nWe also note that it is possible that rank(A)<10 if the rows of A are dependent on each other.\nHowever, it is plausible to exclude such situation, because the input parameters are controllable.\nHereafter, we suppose that all columns of A are independent of each other, equivalently, rank(A)=10. \n\nThe same argument is applicable to the Fraxis gate as\n\n    ⟨ H ⟩   =    G_XX x^2\n        + G_YY y^2\n        + G_ZZ z^2 \n           + 2 G_XY xy\n        + 2 G_XZ xz\n        + 2 G_YZ yz,\n     \n    h^(3)(n)\n           =    (x^2, y^2, z^2, √(2)xy, √(2)xz, √(2)yz)^T, \n    g^(3)   =    (G_XX,G_YY, G_ZZ,\n               √(2)G_XY, √(2)G_XZ, √(2)G_YZ)^T.\n\n\nLikewise, for Rx gates\n\n    ⟨ H ⟩   =    G_II w^2\n        + G_XX x^2\n        + 2 G_IX wx, \n    h^(2)(r)\n           =    (w^2, x^2, √(2)wx)^T,\n    g^(2)   =    (G_II, G_XX, √(2)G_IX)^T.\n \n\nThe minimum sizes of the parameter configuration required to construct G^(d) are d(d+1)/2, i.e., 6 in Fraxis (d=3) and 3 in Rotosolve (d=2).\nFor simplicity, we omit superscript d from G^(d), h^(d), and g^(d) for d=2,3,4 in the following sections and formulate them based on the FQS framework unless otherwise noted.\n\n\n\n\n\n\n§ CONFIGURATION COST WITH FINITE RUNS OF QUANTUM CIRCUITS\n\n\n\n\n §.§ Evaluation of the Parameter Configurations\n\n\n\nIf infinite number of measurements were allowed, there would be no estimation errors in the expectation values b, and the resulting vector g is exactly obtained as long as the matrix A is invertible. This allows for the exact evaluation of the optimal solution of the FQS matrix.\n\n\nIn this section, we quantitatively evaluate the error propagation from the shot noise in the expectation values b to the estimation of the minimum solution. \n\nAlthough we focus on the FQS for generality, it can be easily applied to other sequential quantum optimizers, Rotosolve and Fraxis.  \nSuppose a FQS matrix is estimated from N expectation values of an observable, which are obtained by independent measurements with different parameters {q_1, ..., q_N} assigned to the gate of interest.\n\nDue to the finite number of shots, the expectation values are no longer deterministic, but randomly distribute around the true values b^* obtained with infinite shots as \n\n    b = b^* + ϵ,\n\nwhere ϵ is the random variables reflecting the errors on the measurements.\n\nNote that the relation between b and  g is no longer valid under the finite measurement condition.\nAlternatively, we employed the least-square solution g\n\n    g = g̃minb-Ag̃^2 = (A^TA)^-1A^T b = A^+b,\n\nas a plausible estimate of g^*.\nApparently, Eq. (<ref>) has the same form as Eq. (<ref>), but the resulting vector g is an estimate of the true vector g^* in the context of maximum likelihood <cit.> and deviates from the ideal vector g^* due to errors for finite measurement.\n\n\n\n\nSubstituting Eq. (<ref>) into Eq. (<ref>), we get\n\n    g   = A^+ b\n       =A^+(b^*+ϵ) \n       =g^* + A^+ϵ,\n\nwhere the third equality follows g^*=A^+b^*. \nEq. (<ref>) implies the errors of the estimated coefficient vector g-g^*=A^+ϵ is amplified by the linear transformation A^+ from the shot errors ϵ.\n\nLet G be a FQS matrix generated from the estimated vector g with finite number of measurements. \n\nIn the below, we focus on the FQS procedure to estimate the minimum eigenvalue of G.\nHere, for convenience, we define the half-vectorization function vech: ℝ^4×4→ℝ^10\nsuch that\n\n    vech(G) =\n         (\n        G_II,\n        G_XX,\n        G_YY,\n        G_ZZ,\n        G_IX, \n        G_IY,\n        G_IZ,\n        G_XY,\n        G_XZ,\n        G_YZ)^T,\n\nwhere the order of elements corresponds to g.\nIn addition, the scaling matrix D is defined as\n\n    D = diag(1,1,1,1,√(2),√(2),√(2),√(2),√(2),√(2)).\n\nUsing these notations,\n\nwe have the following relations,\n\n    g=D vech(G)\n    ⇔ \n    G=vech^-1(D^-1g),\n\nwhere the function vech^-1 is a linear mapping as vech^-1(s+t)=vech^-1(s)+vech^-1(t) for s,t∈ℝ^10.\nAccordingly, G is expressed as \n\n    G = vech^-1(D^-1g) \n        = G^* +vech^-1(D^-1A^+ϵ),\n\nwhich implies that the  ideal FQS matrix G^*= vech^-1(D^-1A^+b^*) is perturbed by vech^-1(D^-1A^+ϵ).\n\n\nIn the following part, we quantitatively evaluate the matrix perturbation effect on the optimization result.\nLet λ_i^* and p_i^* be the ith lowest eigenvalue and the corresponding eigenvector of G^*. \nLikewise, λ_i(ϵ) and p_i(ϵ) are the ith lowest eigenvalue and its corresponding eigenvector of the estimated matrix G.\nFor quantitative evaluation of the perturbation, we suppose two metrics: (1) Var[λ_1(ϵ)], the variance of the estimated minimum value, and (2) 𝔼[Δ E], the mean error of the minimum expectation value using the estimated optimal parameters with infinite shot.\n\nHere, Δ E is the deviation of the expectation value with the estimated parameter set p_1 from the true minimum expectation value, defined as\n\n    Δ E = p_1^T G^*  p_1^ - p_1^*T G^*  p_1^*≥ 0,\n\nwhere the positivity of Δ E comes from the fact that the true parameter set p^*_1 gives the minimum value of the quadratic form.\nWe suppose that Var[λ_1(ϵ)] is a measure to verify the estimated energy λ_1 by one-time execution of FQS, while 𝔼[Δ E] is a measure to qualify the estimated parameter p_1.\nThroughout the following parts, for simplicity, we employed Var[λ_1] as the indicator of shot errors.\n(See Appendix <ref> for 𝔼[Δ E ])\n\n\nSince G is a 4× 4 symmetric matrix, it is represented by eigendecomposition as\n\n    G=P Λ P^T,\n\nwhere P=(p_1,...,p_4)^T and Λ = diag(λ_1,...,λ_4). \nFrom the first-order perturbation theory <cit.>, the minimum eigenvalue λ_1 of G is approximated as\n\n    λ_1 = λ_1^* + p_1^*Tvech^-1(D^-1A^+ϵ) p^*_1.\n\nThen, Var[λ_1] is evaluated as \n\n    Var[λ_1] = Var[p_1^*Tvech^-1(D^-1A^+ϵ) p^*_1].\n\n\nTo deal with Eq. (<ref>), we apply a simple model to the measurement errors ϵ satisfying as\n\n    𝔼[ϵ]=0,\n\n\n\n    𝔼 [ϵ_i ϵ_j] =\n        {[        0 for i≠ j;    σ^2/s  for i=j ]. ,\n\nwhere s denotes the number of measurement shots to evaluate an expectation value of observables and σ^2 is a part to specific to observables. \n\n\nIn addition, we assume the first eigenvector p_1 follows a uniform distribution on the unit sphere.\nBased on the models, Eq. (<ref>) can be further calculated as\n\n    Var[λ_1] = σ^2/sd(d+2) Tr[ (A^TA)^-1(1_d1_d^T+2I)],\n\n\n\n\n\n\nwhere d=dim(q) (4 for FQS, 3 for Fraxis and 2 for Rx) and 1_d∈ℝ^d(d+1)/2 is the vector that the first d elements are unity and the others are zero (e.g. 1_d=(1,1,1,1,0,0,0,0,0,0)^T for FQS).\nDerivation of Eq. (<ref>) is detailed in Appendix <ref>. \n\n\nSince we focus on the optimization performance,\nit is convenient to discuss the total number of shots required for an one-time optimization rather than the cost for evaluating an expectation value. \nSuppose the total shots for an one-time optimization is constant.\nLet s_min be the number of measurement shots to estimate an expectation value of the observable when N=N_min, where N_min:=d(d+1)/2 is the minimum size of the parameter configuration.\nFor a redundant parameter configuration N>N_min, the number of shots for evaluating an expectation value is s_minN_min/N.\nAs a result,\n\n    Var[λ_1] \n        = σ^2/s_min C(A),\n\nwhere we define the C-cost (Configuration cost), C(A), as\n\n\n\n\n\n    C(A):= N/N_mind(d+2) Tr[ (A^TA)^-1(1_d1_d^T+2I)].\n\n\n Equation (<ref>) indicates that Var[λ_1] is separable into the number of shots (s_min) dependent part and the parameter configuration dependent part i.e. a 50% reduction of C(A) is equivalent to doubling the number of shots.\nThe C-cost is a metric to estimate Var[λ_1] under the condition that the number of shots to optimize a single-qubit gate is constant.\n\nNow, the conditions for the minimum C(A) are of interest to minimize the estimation error. We rigorously give the lower bound of the C-cost as the following theorem (See Appendix <ref> for the proof of this theorem):\n\nFor the C-cost C(A) in Eq. (<ref>), C(A) ≥ 1 holds with equality if and only if the parameter configurations {q_i }_i=1^N satisfy \n    \n    A^TA = N/d(d+2) (1_d1_d^T + 2I).\n\n\nIn other words, the parameter configurations that satisfies Eq. (<ref>) is optimal with respect to efficiency.\nAlthough it may not be straightforward to find the optimal parameter sets that satisfy Eq. (<ref>),  in the case of minimum parameter set (N=N_min) a useful formula is available as the following corollary of Theorem <ref>.\n(See Appendix <ref> for the proof.)\n\n     \n    For the minimum number of parameters (N=N_min), the C-cost C(A) in Eq. (<ref>) is always C(A) ≥ 1 with equality if and only if the parameter configurations {q_i}_i=1^N satisfy\n    \n    |q_i·q_j| = 1/√(d+2)  (for  all  i≠ j).\n\n    \n\nThe equality condition in Corollary <ref> tells us that the parameters must be equiangular unit vectors.\nThis equiangular property is known as equiangular lines in real spaces <cit.>, which is equivalent to the algebraic graph theory of two-graphs <cit.>.  The existence of N_min = d(d+1)/2 equiangular lines in ℝ^d is known as the Gerzon bounds, and so far only shown to hold for d = 2, 3, 7, 23. For our optimal parameter configurations, only the cases of Rx and Fraxis gates (d=2, 3), there exists a unique set of N_min equiangular unit vectors (up to rotation) and such parameter configuration uniquely achieves the minimum value of C-cost C(A). The non-existence of such optimal parameter configuration for FQS gate (d = 4) is due to the non-existence of equiangular lines satisfying the condition of Corollary <ref>, which is attributed to Haantjes <cit.> and  Neumann in <cit.> (see also <cit.>).\n\n\n\n\n\n §.§ The Rotation Invariance of C-cost.\n \nThe C-cost C(A) in Eq. (<ref>) is invariant to rotation of all the parameter configurations. \nIn other words, a parameter configuration ( q_1,...,  q_K) and its rotated configuration (R q_1,..., R q_K) have the same value of the C-cost, where R is a rotation matrix ∈ℝ^d× d (R^TR=I). \nSee Appendix <ref> for the proof of rotation invariance.\nThis implies that, for any parameter q of a single-qubit gate of interest, there exists the optimal parameter configuration {q_i} such that q∈{q_i}.\nThis property allows for one reduction of the total number of measurements required in the matrix construction, i.e. reduced to two for Rotosolve, five for Fraxis, and nine for FQS by diverting the previous results to the subsequent gate update. The reduction for Rotosolve has been known before <cit.> but not for Fraxis and FQS. In each step of the sequential optimizations, the resulting cost value after the parameter update can be estimated without additional measurement.\nSince all parameters are fixed except for that of the target gate, this estimated cost can be regarded as one of the observable expectation value b_1 in the subsequent application, where the parameter q_1 of the next gate of interest is diverted from the previous application.\n\n\n\nThe detailed procedure is as follows; (1) Prepare an optimal parameter configuration {q^*}, the gate parameter set {q^(m)} for m = 1,⋯,M, and the temporal cost value ⟨H|(⟩{q^(m)}) where m and M denote the gate index and the total number of parametrized gates, respectively.\n(2) Finds a rotation matrix R such that q_1^*=R^Tq^(m) where the mth gate is of interest and sets b_1=⟨H|$⟩.\n(3) Measure the cost values with the parameter{R q_i^*}fori=2,⋯N_minsettingb_i=⟨H|(⟩Rq_i^*).\n(4) Construct the matrixGfromband{R q_i^*}(5) Diagonalise the matrix to estimate the new parameterq^(m)and the new cost⟨H|$⟩, which can be reused in the next iteration and go back to (2) until convergence.\nThe pseudo-code of this procedure is given in Algorithm <ref>.\n\n\n\n\n §.§ Optimal configurations\n \nThe minimum size of parameter configuration (N_min) for Rx, Fraxis, and FQS are 3, 6, and 10, respectively. \nAccording to Corollary <ref> \nin the case of the Rx gate, \nthe three equiangular vectors on a unit circle are trivially represented by q = [cos2/3π nθ, sin2/3π nθ]^T for n=0,± 1, that is, the vector angle Δθ=2π/3 (equivalently π/3) \nas shown in Figure <ref>A.\nIn contrast, the original parameter configuration proposed in Rotosolve <cit.> was Δθ=π/2, which resulted in C(A)=3/2.\n(It is worth noting that in <cit.> it is argued that arbitrary parameter configurations can be used due to the sine property of the expectation value but did not discuss the estimation accuracy dependent on the parameter configurations under the finite measurements.)\n\nTo achieve the same estimation accuracy, our optimal parameter configuration (Δθ= 2π/3) requires two-thirds as many shots as the original parameter configuration (Δθ=π/2). \n\nCorollary <ref> is also instrumental for Fraxis with d=3. It is also possible to find the equiangular formation of six unit vectors in 3D space.\nFigure <ref>B shows the unique optimal parameter configuration except for the rotational degrees of freedom, where they form a regular icosahedron.\nThe original parameter configuration of Fraxis has C(A) = 1.8 <cit.> (See Appendix <ref>). \nThus, the optimal configuration improves the estimation accuracy 1.8 times with the consistent number of shots.\n\nIn contrast, it was proved that N_min (=10) equiangular unit vectors cannot be placed in d (=4) dimensional Euclidean space.\nNamely, Corollary <ref> tells that there is no parameter configuration that satisfies C(A)=1 for N=10.\nIn addition, Corollary <ref> also implies that the minimum size of the parameter configuration (N=10) may not be the most efficient if the total number of shots are limited for a single FQS execution, although it is not straightforward to know the analytical minimum value and the corresponding parameter configurations.\n\n\n\nInstead, we searched the numerical solution by classical optimization, where C(A) is minimized based on the gradient descent method. \nSince the algorithm may lead to a local minimum solution, we repeated the algorithm independently 10^5 times starting from random initial configurations. \n\nFor N=10, we have obtained the same optimized C-cost value (C(A)≈ 1.033172) from all the initial configurations as far as our experimental trials, which implies that all simulations presumably reached to the global minimum.\nAlthough the obtained configurations were not numerically identical,\nwe found that they were attributed to a unique configuration just by reversal and rotational operations.\nSince the reversal of each parameter does not affect the expectation value (i.e., h(q)=h(-q)) and the uniform rotation of the parameter configuration gives the indentical value of the C-cost (See Sec. <ref>), \nall the configurations were equivalent, which seem to be optimal. \n\n\nFigure <ref>C shows the unique optimal parameter configurations for the FQS case.\nIn this figure, the parameter configurations are projected into 3-dimensional space by a stereographic projection. It means that extra 1D components that cannot be displayed are projected in the radial direction. \nSee Appendix <ref> for the parameter values of the optimal and other parameter configurations. \nFrom the parameter values of the (numerically obtained) optimal parameter configurations (Eq. (<ref>)), we can see the optimal parameter configurations has highly symmetrical structure; the first four parameters {q_1, ..., q_4} and its opposite {-q_1, ..., -q_4} constitute a regular cube in a hyperplane and the last six parameters {q_5, ..., q_10} constitute a regular octahedron in a hyperplane (its opposite also constitute another regular octahedron) as shown in Fig. <ref>.\n\n\nFor FQS, the original parameter configuration  has C(A) = 3.0 and the optimal parameter configurations estimated with numerical experiments is approximately C(A)≈ 1.033172.\nAnd thus, to achieve a certain accuracy, the optimal parameter configuration reduces the number of required shots 3 times than that of the original.\n\n\n\n\n\n\nLikewise, we also conducted the numerical optimization to find the optimal parameter configuration for redundant measurements with N=11, 12.\nAs a result, all the optimizations converged to a consistent value of C(A) within computational precision, which is consistent with the case of N=N_min. \nHowever, the optimal configurations are not necessarily unique, which is in contrast to N=N_min.\nWhile the obtained C(A) was ≈ 1.005390 for N=11,  C(A) was exactly converged to unity for N=12.\nIt is also notable that the optimal configurations of C(A)=1 for N=12 include the regular 24-cell polytope in 4-dimensional space as shown in Fig. <ref>D.\n\nTherefore, If the total number of shots for A matrix construction is constant, the optimal sizes of N are three for Rotosolve, six for Fraxis, and twelve for FQS.\n\n\nNext, we focus on the optimal N allowing the reduction of measurements exploiting the rotation invariance as mentioned in Sec. <ref>.\nAssuming a constant number of shots per gate, the measurement reduction modifies the relation between C(A) and s_min as \n\n\n    Var[λ_1^*] = σ^2/s_minN-1/NC(A).\n\nwhere the C-cost is apparently scaled by (N-1)/N.\nNote that this factor does not change the optimal N for Rotosolve and Fraxis.\nThus, \nit is most efficient to revert the estimated value in previous optimization to construct A and additionally execute two and five measurements for Rotosolve and Fraxis, respectively. \nIt is worth noting that Table. <ref> shows that\nthe optimal N for FQS is shifted from twelve to eleven by measurement reduction, although the difference is smaller than 1 %.  \nAltogether, under limitation of the total number of shots, it is most efficient to construct the matrix A by three-, six-, and twelve-type measurements for the expectation values\nin the beginning of Rotosolve, Fraxis, and FQS optimizations, respectively.\nIn contrast, during the sequential optimization, matrix A should be made by one estimation value from the previous step and two, five, and ten values from subsequent measurements of Rotosolve, Fraxis, and FQS, respectively.  \n\nIt should be also noted that this optimal condition may differ depending on the supposed condition of real devices.\nFor instance, if parallel computation is allowed, where a constant number of shots are available for evaluating an expectation value even though when N varies, C(A) would not be an appropriate metric because the assumption about the number of shot is not valid, and thus one should trivially employ as large N as as possible.\n\n\n\n\n\n§ EXPERIMENTS\n\nIn the following, we provide several experiments to numerically verify our proposed method on the condition of N=N_min.\n\n\n\n §.§ Estimation Accuracy of One-time Optimization with Different Parameter Configurations\n\n\nWe focused on the one-time optimization rather than an entire VQE processes.\nTo this end, we examined the averaged error of FQS between the exact minimum and the estimated minimum energies with limited number of shots for several parameter configurations.\nWe used the 2-qubit Hydrogen molecule-like Hamiltonian <cit.> defined as\n\n    H = I⊗ Z + Z⊗ I + X⊗ X\n\nin this experiment. \n\nWe use the 2-qubit ansatz in Fig. <ref>, where we applied the corresponding single-qubit gate representation of Rotosolve (=RzRy), Fraxis, and FQS methods to U_i.\nHere, the target gate to be optimized is U_2 for the FQS and Fraxis and the Ry gate in U_2 for the Rotosolve case. \nThe experiments were performed as the following procedure. \n(1) prepare 100 independent parameter configurations, where the parameters of all the gates were randomly initialized with uniform probability distribution, which was followed by 50 iterations of the steepest decent optimization using C(A) as a cost function.\n(2) evaluate A^+ and C(A) of the 100 parameter configurations.\n(3) randomly initialize the PQC in the state-random manner for the respective single-qubit gates <cit.>.\n(4) obtain b (and b^*) by the observable measurements based on the 100 parameter configurations,\nand evaluate FQS matrices G (and G^*) using the respective sets of A^+, b (and b^*).\n(5) execute FQS (Fraxis/Rotosolve) for G (and G^*) to obtain p (and p^*).\nWe repeat the procedure (3)–(5) 10^4 times and evaluate the averaged error ⟨Δ E ⟩ in Eq. (<ref>) for each parameter configuration.\nNote that we optimized the parameter configuration in process (1) above because the raw values of C(A) distributed beyond 10^4 otherwise.\nIn Fig. <ref>, we plotted 100 independent parameter configurations in C(A) vs. ⟨Δ E|$⟩ graph.\nBy definition,C(A)and⟨ΔE|$⟩  are metrics to qualify the estimated energy and the estimated parameter, respectively.  \nAlthough both the metrics are linked through the following equation, \n\n    N_min d/NC(A) + sd(d-1) /kσ^2𝔼[Δ E]  = Tr[(A^TA)^-1],\n\nthe concrete behaviors are not necessarily trivial because of dependency on A and the observable.\nHere, we confirmed that the energy errors ⟨Δ E|$⟩ are roughly proportional toC(A)for all the cases, and⟨ΔE|$⟩ is inversely proportional to the number of shots approximately.\nWe also found that the optimal parameter configuration (red) achieves the lowest error⟨Δ E|$⟩, indicating that the optimal parameter configurations are actually effective to minimize the estimation error.\nAlthough the magnitude of⟨ΔE|$⟩ in FQS is seemingly larger than that of Rotosolve, we note that it does not necessarily indicate the advantage of Rotosolve with respect to error suppression because the single gate expressibility is not comparable among the respective methods.\nFor instance, sequential Rotosolve applications of a series of three single-qubit gates are comparable to one-time FQS application.\nIn this case, however, it is not straightforward to compare them because of error propagation, which is beyond the present framework.\nIn the next section, instead, we examine the effect of the parameter configuration on the entire performance in comparison with the optimization methods.\n\n\n\n\n\n\n\n\n\n §.§ The Influence of the C-cost on VQE Performances\n\n\n\nWe investigate the effect of different parameter configurations on the results of VQE when we sequentially optimize single-qubit gates in quantum circuits by the framework of FQS <cit.>.\nWe employed the 5-qubit quantum Heisenberg model <cit.> defined as\n\n    H = J∑_i=1^5∑_σ=X,Y,Zσ_i σ_i+1\n        + h∑_i=1^5 Z_i\n\nwhere σ_i=I^⊗ i-1⊗σ⊗ I^⊗ 5-i(1≤ i≤ 5), σ_6=σ_1.\nWe herein set J=h=1.\nWe used a Cascading-block ansatz shown in Fig. <ref>, where the gates within the dashed lines are repeated L times.\nWe set L=1, 3, 5 in this experiment.\nAccording to the optimization method, we applied the respective single-qubit representations to U_i in the PQC.\nWe begin VQE with randomly initialize PQC in the state-random manner for respective single-qubit gates in the PQC.\nIn VQE, we sequentially applied Rotosolve/Fraxis/FQS to U_i in the order of subscripts in Fig. <ref>, i.e., from the top-left to the right bottom. \nWe term this procedure to update all gates in the PQC once as sweep. \nIn a single VQE run, we carried out 100 sweeps to obtained the estimated minimum eigenvalue E of the Hamiltonian.\nWe performed independent 100 VQE runs and plotted the error distribution Δ E := E - E^* for respective 100 trials in Fig. <ref>, where E^* is the exact minimum eigenvalue of the Hamiltonian.\nWe evaluated the resulting distributions using the number of shots to 100, 1000, 10000, and ∞ for two or three different parameter configurations (See Appendix <ref> for the specific parameter values). \nNote that we used a statevector for VQE with an infinite number of shots.\nFigure <ref> suggests that parameter configurations strongly affect the entire VQE performance and shows that the optimized parameter configuration (C(A)≃1) achieves the smallest errors on all the conditions with the finite numbers of shots. \nThe optimal parameter configuration works more effectively \nas the number of shots is smaller, which is in line with the analysis of the one-time application to a single-qubit gate in Fig. <ref>. \nIn addition, the impact of the parameter configuration on the VQE performance is not visible on shallow circuit and more distinct as the number of the layer increases.\nIn general, more expressive ansatz can potentially approximate the state of interest with higher precision.\nCorrespondingly, one has to increase the number of shots, because for accuracy ϵ, the number of required shots scales in 𝒪(1/ϵ^2). \nOtherwise, the enhanced expressibility by the circuit extension may not be highlighted.\nSince the gain of C(A) is equivalent to the increase of measurements, the optimal parameter configuration will be more beneficial as desired accuracy in VQE becomes higher.\n\nIn fact, FQS is superior to Rotosolve and Fraxis and the statevector simulation implies that FQS with ansatz of L=5 can potentially achieve the accuracy ϵ < 10^-2.\nHowever, it is less likely to reach this energy level with the 10000 shots which is a practical standard for the present quantum devices, i.e. IBM-Q device.\nThere, the parameter optimization assists VQE lowering the reachable energy level distinctively, although it is not the case for Rotosolve and Fraxis because the number of shots available are sufficient relative to their expressibility.\n\n\n\n\n§ CONCLUSIONS\n\nIn this work, we showed that the parameter configuration affects the performance of analytical optimization of a single-qubit gate. \nThis estimation error was quantified by the C-cost C(A), the variance of the estimated value of the cost function.\nWe theoretically proved that the lower bound of C(A) is unity.\nWe also showed that when the size of the parameter configuration is minimal, the C-cost becomes unity if and only if the parameter configuration satisfies the equiangular condition.\nExploiting this property, we found the optimal parameter configuration for Rotosolve and Fraxis.\nAlthough we revealed no parameter configuration of minimum size for FQS achieves C(A)=1, it turned out the parameter configuration of N=12 corresponding to the regular 24-cell polytope in the 4-dimensional space satisfies C(A)=1.\nIn addition, we also demonstrated how to reduce the number of measurements for matrix construction by making use of the rotation invariance of C(A). \nThen, the optimal parameter configurations exhibited the best results improving efficiency 1.5 times for Rotosolve, 1.8 times for Fraxis, and 3.0 times for FQS, when compared to the original parameters.\nAdditional numerical experiments showed that the parameter configuration affects the performance of not only the one-time optimization but also the entire VQE. \nWe also found that the parameter configuration is more instrumental to elicit the VQE performance as the ansatz becomes more expressive. \n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nR.R. would like to thank Prof. David Avis of Kyoto University for the discussion on equiangular lines. \nH.C.W. was supported by JSPS Grant Numbers 20K03885. \nN.Y. and H.C.W were supported by the MEXT Quantum Leap Flagship Program Grant Number JPMXS0118067285 and JPMXS0120319794.\n\n\n\n\n\n\n\n\n\n\n§ APPENDIX\n\n\n\n §.§ Free Quaternion Selection\n\n\n\nWe show the minimum value of Eq. (<ref>) is the minimum eigenvalue  λ_1 of G achieved when q = p_1 for the corresponding eigenvector p_1 of G. \n\n\n\n\n\n\n\n\n\n\n\n\n\nFor the Lagrange multiplier method, we first define a function, l(q,λ), corresponding the above optimization problem as\n\n    l(q,λ) = q^T G q - λ ( q^2 -1 ),\n\nwhere λ is a Lagrange multiplier.\nTaking the partial derivatives for l(q,λ) and setting them to zero, we can obtain\n\n\n\n\n\n\n    Gq = λq.\n\nThus, the candidates for the local minimum/maximum value of l(q,λ) and the solutions are the eigenvalues λ_i and its normalized eigenvectors p_i, respectively.\n\nSubstituting the normalized eigenvectors p_i into Eq. (<ref>), we get\n\n    ⟨ H ⟩ \n        \n        =p^T_i G p_i\n        =p^T_i (λ_i p_i)\n    \n        =λ_i,\n\nthis means the global minimum value of Eq. (<ref>) and its solution are given by the minimum eigenvalue λ_1 and the corresponding normalized eigenvector p_1.\n\n\n\n\n §.§ A proof on the sufficiency of independent unitary matrices for energy estimation\n\nIn Section <ref> we showed that exactly three, six, and ten circuit evaluations of linearly independent single-qubit gates at a particular single-qubit gate of a PQC to be optimized by, respectively, NFT/Rotosolve, Fraxis, and FQS, are sufficient to determine the energy landscape of the PQC with respect to the given Hamiltonian H. \nIn the case of NFT/Rotosolve, such circuit evaluations at arbitrary configurations are known from the sine property of the energy function but how to select the best parameter configurations was not discussed. \nOn the other hand, Fraxis and FQS require the single-qubit gate to be replaced by a fixed set of gates. \nFor example, using the FQS framework to optimize the gates of NFT/Rotosolve optimizing the R_X gate, the gate set is {I, X, 1/√(2)(I+X)} and the resulting expectation values are the elements of the matrix in Eq. (<ref>), i.e., G_II, G_XX, G_IX. \nSimilarly, in the case of Fraxis, the gate set is {X, Y, Z, 1/√(2)(X+Y), 1/√(2)(X+Z), 1/√(2)(Y+Z)} and the expectation values are those in Eq. (<ref>). \nIn the case of FQS, the gate set is the union of that of Fraxis with {I, 1/√(2)(I+X), 1/√(2)(I+Y), 1/√(2)(I+Z)} and the expectation values are those in Eq. (<ref>). \n\nHere, we provide a proof of the sufficiency by showing that we can uniquely identify the matrix in Eq. (<ref>) from running the PQC by replacing the single-qubit gate with ten arbitrary independent single-qubit gates parametrized by unit vectors q_1, …, q_10. The term independent will be explained later. \nFor simplicity, we only describe the proof for FQS but it should be clear that similar arguments can be used to prove the cases for NFT/Rotosolve and Fraxis. \n\nFrom Eq. (<ref>) and (<ref>), we know that with respect to the single-qubit gate parametrized by q_i ∈ℝ^k it holds that \n\n    <H>_i ≡ b_i    =   q_i^T G q_i\n       =   (q_i^T ⊗ q_i^T) (G),\n\nfor i = 1, …, m, where the second equality holds due to the “vec-trick” while (G) is the vectorization of the matrix G. \n\nBecause G is a symmetric k × k matrix, we can conclude that the degree of freedom of (G) ∈ℝ^k^2 is at most k(k+1)/2, i.e., 10 for FQS(k=4), 6 for Fraxis (k=3), and 3 for NFT/Rotosolve (k=2). In fact, there is one-to-one correspondence (linear transformations) between (G) and g in Eq. (<ref>). \nSimilarly, we can also confirm that the degree of freedom of q_i^T⊗q_i^T is also k(k+1)/2.\n\nLet Q be the matrix whose i-th row is q_i^T⊗q_i^T. We then obtain the following linear equality. \n\n    b = Q (G),\n\nwhere b∈ℝ^m for Q ∈ℝ^m× k^2. Due to its construction, the rank of Q is at most min(m, k(k+1)/2). For m ≤ k(k+1)/2, the rank of Q is exactly m if and only if q_i^T⊗q_i^T are linearly independent for i = 1,… m. Namely, the following equality holds if and only if α_i = 0 for all i. \n\n    ∑_i = 1^m α_i q_i^T⊗q_i^T = 0.\n\nWe call such q_i's as independent.     \n\nNow, we can argue that (G) is uniquely determined if (Q) is at least the degree of freedom of (G), which is at most k(k+1)/2. Such Q can be realized by selecting up to k(k+1)/2 independent q_i's. Suppose that (G) is of maximum degree of freedom but (Q) < k(k+1)/2. Then, there exists G' ≠0 such that Q (G') = 0. In such case, (G) is not uniquely determined because \n\n    Q (G) = Q ((G) + (G')) = 𝐛.\n\n\nThus, by selecting k(k+1)/2 independent unit vectors q_i ∈ℝ^k, we can uniquely determine (G) which then enables us to evaluate the expectation value of the given Hamiltonian when the corresponding single-qubit gate is replaced by arbitrary unitary gate. This implies that k(k+1)/2 arbitrary independent single-qubit gates are sufficient for FQS, Fraxis, and NFT/Rotosolve, each for k=4,3,2 respectively. When the dimension of (G) is exactly k(k+1)/2, as happened for some PQCs, the number k(k+1)/2 of arbitrary independent single-qubit gates is also a necessary condition.  \n\n\n\n\n §.§ Derivation of Analytical form of the Measures\n\n\n\n  §.§.§ Expectation value over an orthogonal basis\n\n\n\n\nWe show several equations that are useful for derivation of analytical form of the measures.\n\nLet Z ∈ℝ^d× d be a random symmetric matrix which \n\nsatisfies 𝔼[Z_ij] = 0 for all i,j. \nIndependently, let P=(p_1,...,p_d)^T ∈ℝ^d× d be a random orthogonal matrix (i.e., the matrix is uniformly sampled from the orthogonal group O(4)).\nThen, the following equations holds:\n\n    𝔼[p_i^*T Z p_j^*] \n        =   ∑_k,l𝔼[ (p_i^*)_k (p^*_j)_l Z_kl ]\n    \n        =   ∑_k,l𝔼[ (p_i^*)_k (p^*_j)_l ] 𝔼[ Z_kl ] \n    \n        =    0,\n\nand so,\n\n    Var[p_i^*T Z p_j^*]\n        =   𝔼[(p_i^*T Z p^*_j)^2]\n        - 𝔼[p_i^*T Z p^*_j]^2 \n    \n        =   𝔼[(p_i^*T Z p^*_j)^2].\n\n\nFor i=j,\n\n\n    Var[p_i^*T Z p_i^*]\n        =   𝔼[(∑_k,l (p_i)_k Z_kl (p_j)_l)^2] \n    \n        =   ∑_k,l,m,n𝔼[ (p_i)_k (p_i)_l (p_i)_m (p_i)_n ]𝔼[ Z_kl Z_mn ]\n    \n        =   ∑_k(=l)∑_m(=n≠ k)𝔼[ (p_i)_k^2 (p_i)_m^2] \n        𝔼[ Z_kk Z_mm ] \n       + ∑_k(=m)∑_l(=n≠ k)𝔼[ (p_i)_k^2 (p_i)_l^2] \n        𝔼[ Z_kl^2 ] \n       + ∑_k(=n)∑_l(=m≠ k)𝔼[ (p_i)_k^2 (p_i)_l^2] \n        𝔼[ Z_kl Z_lk ] \n       + ∑_k𝔼[ (p_i)_k^4] \n        𝔼[ Z_kk^2] \n    \n        =   ∑_k,l𝔼[ Z_kk Z_ll]+ 𝔼[ Z_kl^2] + 𝔼[ Z_kl Z_lk ]/d(d+2)\n    \n        =   ∑_k,l𝔼[ Z_kk Z_ll ]+ 2𝔼[ Z_kl^2]/d(d+2).\n\nFor the fourth equality, we employed the following relation. \n\n    𝔼[(x^T Z x)^2]\n        =    d(d+2) 𝔼 [ ( x^T/x Z x/x )^2 ],\n\nwhere x is a random vector in ℝ^d, which follows the d-dimensional multivariate standard normal distributions 𝒩(0,I), and x, Z are independent each other.\n\nTo evaluate Eq. (<ref>) for i j, we suppose another random vector y as x, but independent of x and Z.\n\n    𝔼[(x^T Z y)^2]\n        =   𝔼[(∑_i,j(x)_i Z_ij (y)_j)^2] \n    \n        =   𝔼[∑_i,j,s,t (x)_i (x)_s Z_ij Z_st (y)_j (y)_t]\n       \n        =   ∑_i,j,s,t𝔼[ (x)_i (x)_s ]𝔼[ (y)_j (y)_t ]𝔼[ Z_ij Z_st ] \n    \n    \n        =   ∑_i,j,s,tδ_j,sδ_i,t𝔼[ Z_ij Z_st ]\n        \n        =   ∑_i,j𝔼[ Z_ij^2 ].\n\nHere, we introduce two vectors as\n\n    y_∥ =  (y·x) /x^2 x,   y_⊥ = y - y_∥.\n\nUsing these vectors, we obtained the following relation,\n\n    𝔼[(x^T Z y)^2] \n        =   𝔼[(x^T Z (y_∥+y_⊥))^2]\n    \n        =   𝔼[(x^T Z y_∥)^2] +\n        𝔼[(x^T Z y_⊥)^2]\n       +\n        2𝔼[(x^T Z y_∥)(x^T Z y_⊥)]\n    \n        =   𝔼[(x^T Z y_∥)^2] +\n        𝔼[(x^T Z y_⊥)^2].\n\nFor the third equality, we use the probability distribution f satisfies\nf(x,y_∥,y_⊥)=f(x,y_∥,-y_⊥),\nand thus\n\n    𝔼[(x^T Z y_∥)(x^T Z y_⊥)] =\n           𝔼[(x^T Z y_∥)(x^T Z (-y_⊥))],\n\nequivalently,\n\n    𝔼[(x^T Z y_∥)(x^T Z y_⊥)] \n        =    0.\n\nOn the other hand, \n\n    𝔼[(p^*T_i Z p^*_j(≠ i))^2]\n        =   𝔼[(\n        x^T/x Z y_⊥/y_⊥)^2] \n    \n       =   1/𝔼[x^2]\n        𝔼[y_⊥^2]𝔼[(x^T Z y_⊥)^2]\n    \n       =   1/d(d-1)𝔼[(x^T Z y_⊥)^2]\n\nwhere we suppose that the probability distribution f satisfies f(x/x,y_⊥/y_⊥ )=f(p_i,p_j(≠ i)), a.e., 𝔼[x^2]=d and 𝔼[y_⊥^2]=d-1.\n\nIn addition the first term in Eq. (<ref>) \n\n    𝔼[(x^T Z y_∥)^2] \n        =   𝔼[x^2 y_∥^2(\n        x^T/x Z y_∥/y_∥)^2] \n        =   𝔼[x^2]𝔼[y_∥^2] \n        𝔼[(\n        x^T/x Z y_∥/y_∥)^2] \n    \n        =    d 𝔼[(p^*T_i Z p^*_i)^2 ] \n    \n        =   ∑_k,l𝔼[ Z_kk Z_ll ]+ 2𝔼[ Z_kl^2]/d+2.\n\nwhere the second equality arises from the independence of the random variables, and the third equality is based on \nx/x=y_∥/y_∥, f(x/x) \n= f(p_i), a.e., 𝔼[x^2]=d and 𝔼[y_∥^2]=1.\n\nFrom Eq. (<ref>)(<ref>)(<ref>)(<ref>), we finally obtain \n\n    Var[p_i^*T Z p^*_j(≠ i)]\n           =E[(p_i^*T Z p^*_j(≠ i))^2]\n       =∑_k,ld 𝔼[Z_kl^2]-𝔼[Z_kkZ_ll]/d(d-1)(d+2).\n\n\n\n\n  §.§.§ Derivation of analytical form of Var[λ(ε)]\n\n\n Using the noise model ⟨ϵ_i ⟩ = 0, ⟨ϵ_i ϵ_j ⟩ = σ^2 δ_i,j/s and the uniformly distributed model of the first eigenvector p_1^*. We show the analytical form of Var[λ_1(ϵ)] in Eq. (<ref>): \n\n    Var[λ_1(ϵ)] = Var[p_1^*Tvech^-1(D^-1A^+ϵ) p_1^*] .\n\nFor simplicity, we write Z=vech^-1(D^-1A^+ϵ).\nNote that Z is a symmetric matrix and satisfies 𝔼[Z]=O because 𝔼[D^-1A^+ϵ]=D^-1A^+𝔼[ϵ]=0. \nThus, using Appendix <ref>, \n\n    Var[p_1^*T Z p_1^*] = \n    ∑_i,j𝔼[ Z_ii Z_jj ]\n        + 2 𝔼[ Z_ij^2]\n        /d(d+2).\n\nThen, we deal with the first term ∑_i,j𝔼[ Z_ii Z_jj ] and the second term ∑_i,j𝔼[ Z_ij^2 ], separately.\nTo this end, we introduce some useful representations. \nWe note \nEq. (<ref>) can be rewritten as\n\n    <H> \n    \n           =    h(q)^T  g\n       =   (q^T⊗q^T) (G).\n\n\nHere q is the parameter of the target single-qubit gate, G is the FQS matrix, and : ℝ^d× d→ℝ^d^2 is the vectorization operator for matrices.\n\nNext, we introduce a linear transformation L∈ℝ^d^2 × d(d+1)/2 between the vector g and (G) in the Rx, the Fraxis, and the FQS gates as\n\n\n\n\n    L =[ 1 0 0; 0 0 c; 0 0 c; 0 1 0 ] , [ 1 0 0 0 0 0; 0 0 0 c 0 0; 0 0 0 0 c 0; 0 0 0 c 0 0; 0 1 0 0 0 0; 0 0 0 0 0 c; 0 0 0 0 c 0; 0 0 0 0 0 c; 0 0 1 0 0 0 ] , [ 1 0 0 0 0 0 0 0 0 0; 0 0 0 0 c 0 0 0 0 0; 0 0 0 0 0 c 0 0 0 0; 0 0 0 0 0 0 c 0 0 0; 0 0 0 0 c 0 0 0 0 0; 0 1 0 0 0 0 0 0 0 0; 0 0 0 0 0 0 0 c 0 0; 0 0 0 0 0 0 0 0 c 0; 0 0 0 0 0 c 0 0 0 0; 0 0 0 0 0 0 0 c 0 0; 0 0 1 0 0 0 0 0 0 0; 0 0 0 0 0 0 0 0 0 c; 0 0 0 0 0 0 c 0 0 0; 0 0 0 0 0 0 0 0 c 0; 0 0 0 0 0 0 0 0 0 c; 0 0 0 1 0 0 0 0 0 0 ],\n respectively, where c=1/√(2).\nNote that the transformation satisfies\n\n    L^T L \n           =    I, \n    (G) \n           =    L g,\n\nAnd so,\n\n    (q^T⊗q^T) L \n           =    h(q)^T.\n\nWe may also consider the inverse transformation of vectorization vec^-1: ℝ^d^2→ℝ^d× d as \n\n    ^-1(Lg) \n        = G   ∀g∈ℝ^d(d+1)/2,\n\nand vech^-1: ℝ^d^2→ℝ^d× d,\n\n    vech^-1(D^-1g)=G   ∀g∈ℝ^d(d+1)/2.\n\nThis leads to\n\n    Z = vech^-1(D^-1A^+ϵ) = vec^-1(LA^+ϵ).\n\nThen, the first term in Eq. (<ref>) is rewritten as\n\n    ∑_i,j𝔼[ Z_ii Z_jj ] \n       =   𝔼[ ∑_i,jvec^-1(LA^+ϵ)_iivec^-1(LA^+ϵ)_jj ]\n       =   𝔼[ ((I)^T LA^+ϵ)((I)^T LA^+ϵ)]\n       =   σ^2/s ((I)^T LA^+ ·(I)^T LA^+) \n       =   σ^2 /s(I)^T LA^+ (A^+)^T L^T (I)\n       =   σ^2/s1_d^T A^+ (A^+)^T1_d\n       =   σ^2/s1_d^T (A^TA)^-11_d\n\nwhere I is the identity matrix, and 1_d:=L^T (I) is the vector in ℝ^d(d+1)/2 whose first d elements is unity and the rest are zero.\nFor the sixth equality, we used the folloing relation,\n\n    A^+(A^+)^T   =    ((A^TA)^-1A^T)((A^TA)^-1A^T)^T \n       =    (A^TA)^-1 A^TA (A^TA)^-1\n       =    (A^TA)^-1.\n\n\nThe second term in Eq. (<ref>) is also rewritten as\n\n    ∑_i,j𝔼[Z_ij^2 ] \n       =   𝔼[ ∑_i,jvec^-1(LA^+ϵ)_ijvec^-1(LA^+ϵ)_ij ]\n       =   𝔼[ (LA^+ϵ)^T(LA^+ϵ)]\n       =   σ^2/sTr[(LA^+)^T(LA^+) ] \n       =   σ^2/sTr [A^+(A^+)^TL^TL]\n       =   σ^2/sTr [(A^TA)^-1],\n\n\nSummarizing Eqs. (<ref>),(<ref>),and (<ref>),\nVar[λ_1(ϵ)] is expressed as\n\n\n    Var[λ_1]\n       =σ^2/s d(d+2)(\n        1_d^T (A^TA)^-11_d +\n        2Tr[ (A^TA)^-1 ]) \n       = σ^2/sd(d+2)Tr[ (A^TA)^-1( 1_d 1_d^T + 2I)],\n\nwhere the following identity:\n\n    1_d^T (A^TA)^-11_d = Tr[(A^TA)^-11_d 1_d^T]\n\nis employed for the last equality.\n\n\n\n\n  §.§.§ Discussion of  for the perturbation effect\n\n\n\n\n\nUsing the second-order perturbation theory of matrix <cit.>, the energy error Δ E is approximated as \n\n    Δ E = ∑_i>1^d  (p_i^*Tvech^-1(D^-1A^+ϵ) p_1^* )^2 /λ_i^* - λ_1^* .\n\nNote that Eq. (<ref>) is not applicable when the lowest-energy eigenstate is degenerated. \nHowever, the following argument has been found to hold well experimentally. \nThis equation leads to:\n\n    𝔼[Δ E ] = 𝔼[\n        ∑_i>1^d  (p_i^*Tvech^-1(D^-1A^+ϵ) p_1^* )^2 /λ_i^* - λ_1^* ].\n\nHowever, unlike Var[p_1(ϵ)],\nthis measure also depends on the probability distribution f(λ_1^*,...,λ_d^*) of the eigenvalues of the matrix G.\nAssuming these eigenvalues are independent of each other, that is,\n\n    f(λ_1^*,...,λ_M^*) = ∏_i=1^d f(λ_i^*),\n\nand the matrix of the eigenvectors P=(p_1,...,p_d)^T is a random orthogonal,\nEq. (<ref>) can be written as\n\n    𝔼[Δ E ]\n        =   ∑_i>1^d\n        𝔼[\n        1/λ_i^* - λ_1^* ]\n        𝔼[\n        (p_i^*Tvech^-1(D^-1A^+ϵ) p_1^* )^2\n        ] \n    \n        =    k𝔼[\n        (p_2^*Tvech^-1(D^-1A^+ϵ) p_1^* )^2\n        ],\n\nwhere k := ∑_i>1^d 𝔼[ (λ_i^* - λ_1^*)^-1].\nThis means the measure 𝔼[Δ E ] can be evaluated with some modeling of the true FQS matrix G and the measurement errors ϵ.\n\nFor simplicity, we now write Z=vech^-1(D^-1A^+ϵ).\nFrom Eq.(<ref>) in Appendix <ref>\n, \n\n    𝔼[Δ E ]\n           =k∑_i,jd 𝔼[Z_ij^2]-𝔼[Z_iiZ_jj]/d(d-1)(d+2)\n       = kσ^2/sd(d-1)(d+2)\n        ×(d Tr[(A^TA)^-1]  -1_d^T (A^TA)^-11_d)\n       = kσ^2/sd(d-1)(d+2)\n        ×Tr[(A^TA)^-1(dI -1_d1_d^T)]\n\nIn addition, if C(A)=1, i.e. the case of theoretical lower bound, A^TA=N/d(d+2)(2I+1_d1_d^T) holds from Theorem <ref>. \nAs a result, we obtain\n\n    𝔼[Δ E ] =\n        kσ^2/s d(d+2) /4N,\n\nwhere we used the following relation,\n\n    Tr[(A^TA)^-1(dI -1_d1_d^T)] \n       = d(d+2)/NTr[(2I+1_d1_d^T)^-1(dI -1_d1_d^T)] \n       = d(d+2)/NTr[(1/2I-1/2(d+2)1_d1_d^T)(dI -1_d1_d^T)] \n       = d(d+2)/NTr[d/2I-1/21_d1_d^T] \n       = d(d+2)/Nd/2 (N_min-1) \n       =  d^2(d+2)^2 (d-1) /4N.\n\n\n\n\n\n\n\n §.§ Proof of Theorem <ref> and Corollary <ref>\n\n\nlemmaLemma\n\nIn this section, we first present useful lemmas to prove Theorem <ref> and its Corollary <ref> that allow for analytical calculation of the optimal bound of the C-cost. \n\nThe first lemma is trivial from the singular-value decomposition of a matrix A = UΣ V^T, where U, V are orthogonal matrices, and Σ is the diagonal matrix that contains the singular values of A. \n\nLet A be a real matrix. The multiset of non-zero eigenvalues of AA^T is the same as the multiset of non-zero eigenvalues of A^TA. \n\n\n\nLet A be a real symmetric matrix such that one of its eigenvalues is a and the rest are b's. Then, it holds that A = (a-b) uu^T + b I where u is the (normalized) eigenvector corresponding to the eigenvalue a.\n\n\n\nEasy by seeing that Au = a u, and Av = b v hold for every v which is orthogonal to u, i.e., v^T u = 0. \n\n\n\nLet A be an n× n positive definite matrix with the largest eigenvalue λ_max and the smallest eigenvalue λ_min such that κ = λ_max / λ_min. It is known that n^2/κ≤(A) (A^-1) ≤ n^2 κ holds with equality if and only if κ = 1, i.e., A = λ I for some λ > 0. We formalize this in the following lemma. \n\nAny positive-definite real symmetric matrix A∈ℝ^n× n satisfies A^-1≥ n^2A^-1 with equality if and only if A= λ I for λ > 0.\n\n\n\n\n\nWe now prove Theorem <ref> and its Corollary <ref> concerning lower bounds and its equality conditions for C-cost. \nHere we revisit Theorem <ref> for convenience.\n\n\n\nSuppose a single-qubit gate expressed by a parameter q in ℝ^d where |q|=1.\nLet {q_1, ⋯, q_N } be a parameter configuration and let A be the corresponding matrix A=[h(q_1),⋯,h(q_N)]^T in ℝ^N× N_min where N≥ N_ min≡ d(d+1)/2.\nThe C-cost C(A) defined as\n\n    C(A) \n           =N/N_mind(d+2) Tr[ (A^TA)^-1(1_d1_d^T+2I)]\n\nsatisfies C(A) ≥ 1 \nwith equality if and only if the parameter configuration {q_i } and A satisfy\n\n    A^TA = N/d(d+2) (1_d1_d^T + 2I).\n\n\n\n\n\nUsing the Woodbury matrix identity giving\n\n    ( 1_d 1_d^T + 2I )^-1 =  ( 1/2I - 1/2(d+2)1_d 1_d^T ),\n\nwe obtain the lower bound of Eq. (<ref>) as\n\n    (A^T A)^-1(1_d1_d^T + 2I) \n       =   ( (1_d1_d^T + 2I )^-1 (A^T A))^-1\n       =   ( 1/2A^T A - 1/2(d+2)1_d 1_d^T  A^T A)^-1\n       ≥    N_min^2 1/2A^T A - 1/2(d+2)1_d 1_d^T A^T A^-1\n       =   N_min d(d+2)/N\n\nwhere the inequality in the fourth line is derived by Lemma <ref>.\nTo obtain the last line, we use A^T A = A A^T = N and 1_d 1_d^T A^T A  = N as well as\n N_min = d(d+1)/2.\nTherefore, C(A)≥ 1.\n\nAccording to Lemma <ref>, the equality in the fourth line in Eq. (<ref>) is given as\n\n    1/2A^T A - 1/2(d+2)1_d 1_d^T A^T A\n        = λ I,\n\nwhere λ is a constant.\nTracing over both sides of Eq. (<ref>), we have\n\n    λ \n        = N/d(d+2).\n\nTherefore, C(A)=1 if and only if \n\n    A^T A = N/d(d+2)(1_d 1_d^T + 2I ).\n\n\n\n\n\n    For the minimum number of parameters (N=N_min),  \n    it holds that C(A) ≥ 1 with equality if and only if the parameter configurations {q_i}_i=1^N satisfy\n\n    |q_i·q_j| = 1/√(d+2)  (for  all  i≠ j).\n    \n\n\n\nWe show\nEq. (<ref>) is equivalent to Eq.(<ref>) if N=N_min.\nWe first show\n\n    A^T A    = N_min/d(d+2)(1_d 1_d^T + 2I ) \n    ⟹   \n        |q_i·q_j|    = 1/√((d+2))  (for  all  i≠ j) .\n\nRecall that  \nA = [h(q_1), ⋯, h(q_N) ]^T.\nIf N=N_min, both AA^T and A^TA lie in ℝ^N_min× N_min,\nA^TA=∑_i^N_minh(q_i) h(q_i)^T \nand so\n\n    ∑_i=1^N_minh(q_i) h(q_i)^T =N_min/d(d+2)(1_d 1_d^T + 2I )\n\nMultiplying both sides by 1_d from the right, we obtain  \n\n    ∑_i=1^N_minh(q_i) = N_min/d1_d,\n\nAccording to Lemma <ref>, A^T A and AA^T have the identical set of non-zero eigenvalues, i.e. one of eigenvalues is d+2 and the rest are 2.\nThen, using Lemma <ref>,\nA A^T can be expressed as\n\n    A A^T = N_min/d(d+2)(d vv^T + 2I ),\n\nwhere v∈ℝ^N_min is a unit vector.\nOn the other hand, \nthe (i,j)-component of AA^T has a relation \n\n    (AA^T)_ij=h(q_i)^T h(q_j) \n        = N_min/d(d+2)(d v_i v_j + 2 δ_ij).\n\nSumming Eq. (<ref>) over j from 1 to N_min and using h(q)^T 1_d=1 and Eq. (<ref>),  we obtain\n\n    v_j = 1/∑_i^N_min v_i.\n\nSince v is a unit vector, v = ±1_N_min / √(N_min), where 1_N_min∈ℝ^N_min is a vector whose all elements are 1.\nTherefore, \n\n    h(q_i)^T h(q_j) = 1/d+2,  for  i ≠ j.\n\nUsing the relation h(q_i)^T h(q_j) = (q_i ·q_j)^2, we obtain\n\n    | q_i ·q_j(≠ i) | = 1/√(d+2).\n\n\nNext, we prove that \n\n    |q_i·q_j| \n           = 1/√((d+2))  (for  all  i≠ j) \n    ⟹   \n        A^T A    =     \n        N/d(d+2)(1_d 1_d^T + 2I ) .\n\nUsing the relation h(q_i)^T h(q_j) = (q_i ·q_j)^2 and |q_i|^2=1 again, we obtain\n\n    h(q_i)^T h(q_j) = 1/d+2 + d+1/d+2δ_ij.\n\nSince h(q_i)^T h(q_j) is the (i, j)-component of A A^T, we can write\n\n    A A^T = N_min/d(d+2)( d/N_min1_N_min1_N_min^T + 2I ),\n\nbecause of N_min = d(d+1)/2.\nUsing Eq. (<ref>), Lemmas <ref> and <ref>, we can write A^T A as\n\n    A^T A = N_min/d(d+2)(d v' v'^T + 2I ),\n\nwhere v'=[v'_1, …, v'_N_min]^T is a unit vector.\nSince A^T A = ∑_i h(q_i) h(q_i)^T and ∀ i, h(q_i)^T 1_d = 1, multiplying Eq. (<ref>) by 1_d from the right side yields\n\n    ∑_i h(q_i) = N_min/d(d+2)( d v' v'^T 1_d + 2 1_d ).\n\nSumming Eq. (<ref>) over i and j from 1 to N_min, we obtain\n\n    ∑_i, jh(q_i)^T h(q_j) = N_min^2/d,\n\nwhich further yields\n\n    (1_d^T v')^2 = d,\n\nby substituting Eq. (<ref>) into Eq. (<ref>) and rearranging the resultant equation.\nSince 1_d  = √(d), Eq. (<ref>) means v' = ±1_d / √(d).\nTherefore, Eq. (<ref>) becomes\n\n    A^T A = N_min/d(d+2)( 1_d 1_d^T + 2I ),\n\nwhich is just the equality conditon of C(A) = 1.\n\n\n\n\n\n\n §.§ Proof of rotation invariance of C-cost\n\nHere, we prove the C-cost C(A) is invariant with respect to the parameter rotations as \n\n    C(A) = C(A_R),\n\nwhere the subscript R stands for the rotated parameter set.\nLet {q_1, q_2, ..., q_N } be the original parameter configuration.\nThen, a rotation matrix R ∈ SO(d) gives another parameter configutation { Rq_1, Rq_2, ..., Rq_N }.\nFor convenience, we define a matrix Q as\n    Q = ( q_1 ⊗q_1, q_2 ⊗q_2, ..., q_N ⊗q_N )^T.\n\nLikewise,\n\n    Q_R    =    ( (Rq_1) ⊗ (Rq_1), ..., (Rq_N) ⊗ (Rq_N) )^T \n       =    Q (R^T ⊗ R^T).\n\nUsing Eq. (<ref>) in Appendix <ref>, Q is linked to A as\n\n    AL^T = Q  and  A=QL.\n\nwhich implies Q encodes the parameter configurations as well as A.\nThus, the matrix A for the rotated parameter set is given as\n\n    A_R L^T = Q(R^T ⊗ R^T)  and  A_R=Q(R^T ⊗ R^T)L.\n\nFrom Eq. (<ref>) and (<ref>), the C-cost contains the Gram matrix A^TA.\nFor the rotated parameter set, the corresponding Gram matrix is given as\n\n    A_R^TA_R    =    L^T (R⊗ R) Q^T Q (R^T⊗ R^T) L \n       =    L^T (R⊗ R) L A^T A L^T (R^T⊗ R^T) L \n       =    R_L A^TA R_L^T,\n\nwhere we denote R_L:=L^T (R⊗ R) L.\n\nIn fact, the first and second terms of Eq. (<ref>) are independently invariant for parameter rotations as follows.\n\nFor the first term 1_d (A^TA)^-11_d^T (Eq. (<ref>)), the rotated version of the first term is expanded as\n\n    1_d^T (A^T_RA_R)^-11_d \n           =   1_d^T (R_L A^TA R_L^T)^-11_d \n       =    (R_L^-11_d)^T (A^TA)^-1 R_L^-11_d \n       =   1_d^T (A^TA)^-11_d,\n\nwhere we use the fact R_L^-11_d = 1_d, which is easily derived as\n\n    R_L1_d\n           =    L^T(R⊗ R) LL^T (I) \n       =    L^T LL^T (R⊗ R) (I) \n       =    L^T (R⊗ R) (I) \n       =    L^T (R I R^T) \n       =    L^T (I) \n       =   1_d,\n\nwhere we employed LL^T(R⊗ R)=(R⊗ R)LL^T and L^TL=I. \nThis equations implies the first term is rotation invariant.\n\n\nFor the second term Tr[ (A^TA)^-1 ] (Eq. (<ref>)), the rotated version of the second term is expanded as\n\n    Tr[ (A^T_RA_R)^-1 ]\n           =    Tr[  (R_L A^TA R_L^T)^-1 ] \n       =    Tr[ (A^TAR_L^TR_L)^-1 ] \n       =    Tr[ (A^TA)^-1 ]\n\nwhere for the second equality I = R_L^TR_L is employed, which is derived as\n\n    R_L^TR_L \n        =    L (R^T⊗ R^T) L L^T (R ⊗ R) L \n    \n        =    L^T L L^T(R⊗ R)(R^T ⊗ R^T) L \n    \n        =    L^T L L^T((RR^T)⊗ (RR^T)) L \n    \n        =     L^T L L^T L \n    \n        =    I,\n\nwhere we employed LL^T(R⊗ R)=(R⊗ R)LL^T and L^TL=I.\nThis equations implies the second term is rotation invariant.\nConsequently, the C-cost is rotation invariant, because both the two terms in the C-cost are rotation invariant. (𝔼[Δ E]  is also rotation invariant, because it is the weighted sum of these two terms.) □\n\n\n\n\n\n\n §.§ Comparison of our Parameters with the original methods.\n\nWe show the parameter values used as a sequential optimization in the main text as follows. The parameters are in no particular order.\n\n\n\n  §.§.§ Rx gate\n\nThe original parameter configuration for Rx gate \nr_1, r_2, r_3 proposed in <cit.> is represented as\n\n    [ r^T_1; r^T_2; r^T_3 ]\n         =\n        [         1         0;  cos(π/4)  sin(π/4);  cos(π/4) -sin(π/4) ].\n\n\nThe unique optimal parameter configuration for Rx gate with minimum number parameter set r_1, r_2, r_3 is analytically derived as \n\n    [ r^T_1; r^T_2; r^T_3 ]\n         =\n        [         1         0;  cos(π/3)  sin(π/3);  cos(π/3) -sin(π/3) ]\n\nand its arbitrary rotation and (individual) reversal.\n\n\n\n  §.§.§ Fraxis gate\n\nThe original parameter configuration for Fraxis gate \nn_1, n_2, ..., n_6 proposed in <cit.> is represented as\n\n    [ n^T_1; n^T_2; n^T_3; n^T_4; n^T_5; n^T_6 ]\n         = 1/√(2)[ √(2)    0    0;    0 √(2)    0;    0    0 √(2);    1    1    0;    1    0    1;    0    1    1 ].\n\n\nThe unique (up to arbitrary rotation and individual reversal) optimal parameter configuration for Fraxis gate with minimum number parameter set n_1, n_2, ..., n_6 is analytically derived as the vertices of icosahedron  \n\n    [ n^T_1; n^T_2; n^T_3; n^T_4; n^T_5; n^T_6 ]\n         =\n         1/√(1+φ^2)[  0  1  φ;  0  1 -φ;  1  φ  0;  1 -φ  0;  φ  0  1; -φ  0  1 ],\n\nwhere φ = 1+√(5)/2 is the golden ratio. \n\n\n\n  §.§.§ FQS gate\n\nThe original parameter configuration for FQS \nq_1, q_2, ..., q_10 proposed in <cit.> is represented as\n\n    [  q^T_1;  q^T_2;  q^T_3;  q^T_4;  q^T_5;  q^T_6;  q^T_7;  q^T_8;  q^T_9; q^T_10 ]\n         =\n         1/√(2)[ √(2)    0    0    0;    1   -1    0    0;    1    0   -1    0;    1    0    0   -1;    1    1    0    0;    1    0    1    0;    1    0    0    1;    0    1    1    0;    0    1    0    1;    0    0    1    1;      ].\n\n\nThe symmetric parameter configuration for FQS gate \nq_1, q_2, ..., q_10 which is only used for the experimental results in main text is represented as\n\n    [  q^T_1;  q^T_2;  q^T_3;  q^T_4;  q^T_5;  q^T_6;  q^T_7;  q^T_8;  q^T_9; q^T_10 ]\n         =\n         1/√(2)[ √(2)    0    0    0;    0 √(2)    0    0;    0    0 √(2)    0;    0    0    0 √(2);    1    1    0    0;    1    0    1    0;    1    0    0    1;    0    1    1    0;    0    1    0    1;    0    0    1    1;      ].\n\n\nThe unique optimal parameter configuration for FQS gate with minimum number parameter set q_1, q_2, ..., q_10 is numerically derived as \n\n    [  q^T_1;  q^T_2;  q^T_3;  q^T_4;  q^T_5;  q^T_6;  q^T_7;  q^T_8;  q^T_9; q^T_10 ]\n         =\n        [ a b b b; b a b b; b b a b; b b b a; c c d d; c d c d; c d d c; d c c d; d c d c; d d c c ]\n\nand its arbitrary rotation and (individual) reversal, where a=√(3)/2, b=-1/(2√(3)), and c^2 + d^2 = 1/2, where c ≈ 0.7049, d ≈ -0.0561.\n\n\n\n\n\n\n\n\n\n\n §.§ ΔE Distributions sampled with various parameter configurations\n\nIn the experiment in Sec. <ref>, we performed optimization of only one gate to investigate the estimation error of the target gate. \nIn the main text we shows only the case of U_2 (Ry gate in U_2 for Rotosolve case) as the target gate. \nIn this section we show another case, that is the case of the target gate is U_0 for the FQS and Fraxis case and the Ry gate of U_0 for the Rotosolve case. \n\n\nNote that the number of shot per circuit S is set to 10, 100, 1000 and the parameters of all the gates are initialized to random values and only the target gate is optimized. \nFig. <ref> shows the results of all the additional experiments. The title of each subplot tells the target gate and other settings. \n\n\n\n\n\n\n\n\n\n\n\n\n\n"}