{"entry_id": "http://arxiv.org/abs/2303.07081v1", "published": "20230313130640", "title": "Evolution of many-body systems under ancilla quantum measurements", "authors": ["Elmer V. H. Doggen", "Yuval Gefen", "Igor V. Gornyi", "Alexander D. Mirlin", "Dmitry G. Polyakov"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.dis-nn", "cond-mat.str-el"], "text": "\n\n\n\n[Corresponding author: ]elmer.doggen@kit.edu\n\n\n\nDepartment of Condensed Matter Physics, Weizmann Institute of Science, 7610001 Rehovot, Israel\n\n\n\nIoffe Institute, 194021 St. Petersburg, Russia\n\n\n\n\n\n\n\nWe explore the concept of implementing quantum measurements by coupling a many-body lattice system to an ancillary degree of freedom on which projective measurements are performed.\nWe analyze the effect of repeated (“stroboscopic”) measurements on the dynamical correlations of interacting hard-core bosons in a one-dimensional chain. An important distinctive ingredient of the protocol is the fact that the detector ancillas are not re-initialized after each measurement step. The detector thus maintains memory of the accumulated influence by the measured correlated system. Initially, we consider a model in which the ancilla is coupled to a single lattice site. This setup allows obtaining information about the system through Rabi oscillations in the ancillary degrees of freedom, modulated by the ancilla-system interaction. The statistics of quantum trajectories exhibits a “quantum-Zeno-valve effect” that occurs when the measurement becomes strong, with sharp branching between low and high entanglement. \nWe proceed by extending numerical simulations to the case of two ancillas and, then, to measurements on all sites. With this realistic measurement apparatus, we find evidence of a disentangling-entangling measurement-induced transition as was previously observed in more abstract models. The dynamics features a broad distribution of the entanglement entropy.\n\n\nEvolution of many-body systems under ancilla quantum measurements\n    Dmitry G. Polyakov\n    March 30, 2023\n=================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe concept of measurements in quantum systems has been a topic of great interest ever since the dawn of quantum mechanics, but the microscopic description of the dynamics of systems under the influence of measurements has remained a challenging problem <cit.>. In recent years, this problem has gained much attention particularly because of its relevance to the stability of quantum computing architectures <cit.> and to the goal of achieving “quantum supremacy” <cit.>. Furthermore, the physics of quantum measurements is closely connected with the study of open quantum systems <cit.>. It is also fundamentally relevant to understanding the link between the microscopic physics and the thermodynamics on macroscopic scales <cit.>.\n\nRecently, the notion of a measurement-induced entanglement transition—a dynamical phase transition driven by the strength or frequency of measurements—has been proposed <cit.>. Initially discussed in the context of quantum circuits <cit.>, the idea of measurement-induced transitions has been extended to non-interacting lattice fermions <cit.>, Dirac fermions <cit.>, the quantum Ising model <cit.>, the Sachdev-Ye-Kitaev model <cit.>, as well as a number of other integrable <cit.> and nonintegrable many-body systems <cit.>. Evidence of a measurement-induced transition has also been reported in trapped-ion <cit.> and superconducting <cit.> quantum-processor architectures. \n\nAn intriguing question is to what extent the essential properties of these measurement-induced transitions are universal <cit.>, and whether a sharp transition exists at all for specific models <cit.>. \nIn particular, it has been debated whether the main features of the transitions are sensitive to the system realization (e.g., quantum circuits vs. Hamiltonians with or without interactions) and to implementation of measurements or monitoring. This includes a distinction between the protocols comprising rare strong measurements and those with frequent (or continuous) weak measurements. These different classes of protocols may possess identical long-time dynamics at the level of averaged density matrix, yet the latter is inappropriate for studying entanglement dynamics.\nIt is worth noting that, in the vast majority of works in the field, either projective local measurements are employed, or an effective model of a continuous monitoring of the system's dynamics is introduced (typically formulated at the level of a stochastic Schrödinger equation).       \n\nA realistic description of the measurement process <cit.> requires a microscopic consideration of the joint evolution of the measured system and the detectors. In this situation, without resetting (re-initializing) the detectors, not only the backaction of measurement affects the systems, but also an inevitable accumulated feedback of the system on the detector can bias the next measurements. This may influence the classification of generalized measurements into strong- or weak-measurement classes, as the effective measurement strength depends on the system's state along the quantum trajectory. This type of “memory-effect” correlations is absent in conventional models implementing measurements or monitoring. The correlated dynamics in the physical realization of the coupled system-detector setup can therefore be expected to exhibit novel features. \n\nA possible interplay of various types of criticality and correlations in measured systems <cit.> is another important facet of the problem.\nIn this context, one may draw a certain analogy between a measurement-induced entanglement transition for a finite density of detectors and disorder-induced localization transition. At the same time, it is known that even a single impurity drastically affects the properties of one-dimensional correlated systems  <cit.>. For example, a weak impurity may cut a wire into two, suppressing transport, similar to localization. This calls for the consideration of the effect of a single detector on the correlated chain, especially when the detector (or a pair of detectors) is located near the bipartition cut that is used for the definition of entanglement.\nIn particular, it is tempting to look for some features characteristic of entanglement transitions already in models with a minimum number of detectors, which would shed more light on the nature of the true transition.\nFurthermore, one may expect that, in a realistic measurement setup, the ancilla-system coupling could be “renormalized” by the correlation in the main chain, similar to the Kane-Fisher impurity problem <cit.>, which in turn would affect the entanglement transition. \nThe above analogies with correlated wires with impurities serve as an additional motivation for our study. \n\nIn this work, we investigate the influence of measurements on quantum many-body lattice systems by coupling the system to ancillary degrees of freedom. The projective measurements are performed on the ancillary sites only. A distinguishing feature of our approach is that, after projecting the ancillary sites, the latter are not re-initialized for the next measurement cycle. The effect of the measurements on the dynamics of the “main\" system is mediated by interactions between it and the ancilla (“detector”), with no particle exchange between the two. Within the proposed framework, the dynamics of the system as a whole (main system plus ancilla) remains  closed, aside from the projections of the detector sites at fixed discrete intervals. The projections are effected through nonunitary operators that implement Born's rule, which is the only assumption we make about the nature of the measurement process. Furthermore, the feedback effect of the main system on the dynamics of ancillary degrees of freedom is automatically taken into account in the course of joint evolution between consecutive projections. \nThis procedure thus brings us a step closer to a realistic description of quantum measurements in interacting many-body systems, with the ancillary sites mimicking a “measurement apparatus.” As such, our protocol is applicable to an arbitrary many-body lattice system and can readily be adapted to current experimental settings of interest, including cold atoms, trapped ions, and superconducting qubits.\n\nWe first demonstrate the power of this approach by outlining how the “measured” site density of interacting hard-core bosons on a one-dimensional lattice can be reconstructed from the ancilla dynamics. \nNext, we investigate the effect of a measurement backaction on the density distribution and the entanglement entropy, for one and two sites coupled to the detectors. The feedback of the main system on the detectors gives rise to what we dub a “quantum-Zeno-valve effect” (involving a blockade of the ancilla dynamics), which occurs either when the stroboscopic-projection frequency is commensurate with the ancilla Rabi frequency or at strong system-detector coupling.   \nFinally, we analyze the dynamics of the system for a finite density of measured sites. We observe manifestations of a disentangling-entangling measurement-induced transition in the time- and system size-dependence of the entanglement entropy averaged over realizations of individual quantum trajectories. \nThe dynamics features a broad distribution of the\nentanglement entropy and density fluctuations. We thus provide evidence for a measurement-induced transition driven by the change of ancilla-system coupling in a correlated quantum system with a realistic measurement setup. \n\n\nThe paper is organized as follows. We formulate the model and specify the measurement protocol in Sec. <ref>. In Sec. <ref>, we outline the basic concept of “measuring” the main system by means of performing projections on the ancilla. In Sec. <ref>, we study the effect of backaction from repeated measurements with one or two ancillas, focusing on the density distribution and the entanglement entropy. Two different initial states of the main system are considered: a domain-wall state in Sec. <ref> and the ground state in Sec. <ref>. \nIn Sec. <ref>, we present results for the entanglement and density dynamics in a chain with all sites coupled to the detectors, with a particular focus on the disentangling-entangling transition.\nSection <ref> provides a summary and conclusions. Some of the technical details of performed numerical simulations and additional benchmarks are described in Appendices.\n\n\n\n\n§ MODEL, MEASUREMENT PROTOCOL, AND OBSERVABLES\n\n\n\n\n\n §.§ Model\n\n\nFor concreteness, we consider a model of hard-core bosons on a one-dimensional lattice at half filling. The Hamiltonian of the chain (main system) is given by\n\n    ℋ_s =  ∑_i=1^L-1[ -J/2(b_i^† b_i+1 + H.c.)  + Un̂_in̂_i+1],\n\nwhere b_i (b_i^†) annihilates (creates) a boson on site i, the lattice size is L, n̂_i ≡ b_i^† b_i denotes the density operator on site i, J is the strength of hopping between neighboring sites, and U is the strength of interaction between particles on neighboring sites. This model is equivalent, through the Jordan-Wigner transformation, to the XXZ Heisenberg chain, and its ground-state and dynamical properties have been studied extensively <cit.>.\n\n\n\n\nThe simplest setup with an ancilla is then realized when the ancilla is represented by a single pair of sites. Taking L to be even, we couple, by means of interaction, site L/2 of the main system and one of the sites of an ancillary pair, as illustrated in Fig. <ref>. The total Hamiltonian ℋ is then written as ℋ = ℋ_s + ℋ_a+ℋ_sa, where\n\n    ℋ_a =  -J/2( a_1^† a_2 + a_2^† a_1 )\n\ndescribes the ancilla and\n\n    ℋ_sa = M n̂_L/2 a^†_1 a_1\n\nthe coupling between the main system and ancilla. Here, a_1,2 (a^†_1,2) are the annihilation (creation) operators of hard-core bosons on ancilla sites 1 and 2, and M is the strength of interaction between the main system and the ancilla. \nNote that the choice of interaction in Eqs. (<ref>) and (<ref>) in the form of only particle-particle interaction breaks particle-hole symmetry of the model. Everywhere below, the intra-chain and chain-ancilla interaction is taken to be repulsive (U>0 and M>0). For simplicity we have also chosen, in Eq. (<ref>), the hopping strength in the ancilla to be the same as in the main system. \n\nIn what follows, we first study the basic setup with a single ancillary pair, as described above. We proceed by including a second ancillary pair, as shown in Fig. <ref>, permitting a more detailed understanding of the influence of measurements on the system.\nFinally, we employ this approach to the case where the ancillary sites are attached to every site of the chain, see Fig. <ref>. \n\n\n\n\n\n\n §.§ Ancilla measurement protocol\n\n\n\nWe perform projective density measurements on the lower ancilla site (the one connected to the main chain through interaction), periodically at an interval Δ T. Consider the case of a single ancilla (multiple ancillas are treated similarly). After each projection, the ancilla pair finds itself in a state with either the lower site occupied or the lower site empty, i.e., the whole system is then in the state  |Ψ⟩_10⊗ |1 0 ⟩ or |Ψ⟩_01⊗ |0 1⟩, respectively, where |10⟩ and |01⟩ denote the ancilla states, and |Ψ⟩_10 and |Ψ⟩_01 are the corresponding states of the main chain. Because of the backaction of the measurement onto the main chain, the states |Ψ⟩_10 and |Ψ⟩_01 are in general different. The probability of each outcome is determined by the Born rule according to the density n_a = ⟨ a_1^† a_1 ⟩. Note that the projection breaks both unitarity and integrability.\n\nWe model the projection as an instantaneous event. Importantly, the probability of a particular readout shown by the “measurement apparatus” (the ancilla pair) is dependent on the whole history of the measurement process. Indeed, because of the Born rule, the previous measurement results affect the dynamics in the main chain (backaction). This, in turn, affects the value of n_a at the time when the projection takes place (feedback), and so on. This backaction-feedback memory loop gives rise to system-ancilla correlations. In particular, a self-sustained “blockade” or “freezing\" of the ancilla dynamics may occur, resulting in an almost projective measurement of the system site, which leads to a quantum Zeno-like effect. Numerically, the unitary time evolution of the entire system—main chain plus ancilla(s)—is obtained using the time-dependent variational principle <cit.>, see Appendix <ref>.\nFor the model with ancillas attached to every site of the chain\n(Fig. <ref>), we move beyond exact simulations and utilize the full power of matrix-product-state (MPS) simulations, considering systems of up to 72 sites, including ancillary sites.\n\nIt is worth mentioning that the implementation of generalized measurements through coupling the system to ancillary degrees of freedom followed by their projections has deep roots in various contexts involving weak measurements (see, e.g., Refs. <cit.>). \nIn particular, this type of measurement allows one to associate the counting statistics <cit.> of discrete outcomes of ancilla projections with the properties of the system without strong backaction. Furthermore, these outcomes can be used in a feedback loop to control the system by active-decision making on further measurements or the unitary evolution (see, e.g., Refs. <cit.> and references therein).  \nMicroscopically, perhaps, the closest setup resembling ours was introduced in Refs. <cit.>, where a double-dot (“two-site”) system was electrostatically coupled to a point contact in a conducting channel (see also Refs. <cit.> for related setups). However, the roles of ancilla and system were interchanged in that setup compared to ours (cf. Ref. <cit.>): the transmission of the conducting channel was measured strongly, yielding the information about the occupation of the dot connected to it. \n\n\n\nIn a recent work <cit.>, a setup with ancillas was considered, in the context of measurement-induced transitions, for a quantum circuit. There are, however, essential differences between our framework and the one studied in Ref. <cit.>. A clear difference is that we deal with a Hamiltonian system undergoing real time evolution, and which respects particle number conservation. Another difference is in the dependence of the measurement outcome on the history of the system. As mentioned above, this dependence is an inherent property of our model. By contrast, a newly initialized (in a prescribed state) ancilla is introduced in Ref. <cit.> at every “time step” (at every layer of the quantum circuit), similarly to the steering protocols of Refs. <cit.>. \nThis is an important difference, particularly because adaptive feedback and “preselection” mechanism may prove essential, as argued in Refs. <cit.>, for observing a measurement-induced phase transition. In our framework, the feedback emerges “automatically”, through the mechanism of joint unitary evolution fixed by the Hamiltonian, with no re-initialization of the ancilla after the projections. This results in effective adaptive dynamics of the entire system. A further key difference with previous works is that we explore the density and entanglement dynamics in various setups, with one, two, and many detectors. \n\n\n\n\n\n\n\n\n\n §.§ Observables\n\n\n\nWe focus on the following observables: (i) the density distribution n_i(t) = ⟨ b_i^† b_i ⟩ (t) of bosons along the main chain, as a function of time t, (ii) the density n_a(t) = ⟨ a_1^† a_1 ⟩ (t) of the ancilla boson at the lower site (the one coupled to the main chain through the interaction with magnitude M), and (iii) the bipartite von Neumann entropy of entanglement S(t). The latter is defined as\n\n    S(t)  = -Tr( ρ_A lnρ_A ),   ρ_A = Tr_Bρ ,\n\nwhere ρ is the density matrix of the whole system, ρ_A is the reduced density matrix (Tr_B denotes a trace over subsystem B), and we place the bipartition between subsegments A and B of the system in the middle of the main chain. Note that for an ancilla, both its sites also belong to one of the subsystems A or B. Since the ancilla is entangled with the main chain during the unitary evolution between the projections, the ancillary degrees of freedom contribute to the value of S. \n\nFrom the density in the main chain n_i, we can obtain the particle imbalance:\n\n    ℐ = -L/4 + ∑_i=1^L/2⟨n̂_i ⟩.\n\nThis quantity measures the bipartite fluctuations with respect to a homogeneous distribution of particles in the main chain, so that ℐ = 0 corresponds to a homogeneous state, and ℐ = ± L/4 is a state where all particles are in the left (+) or right (-) side of the chain respectively. Recall that since we consider the main chain at half filling, there are L/2 bosons present there.\n\nAll three quantities (i)-(iii) are, in principle, directly measurable in experiment; the imbalance was considered for instance in Ref. <cit.> (defined in a slightly different way). The entanglement can also be measured in state-of-the-art experimental settings <cit.>. Within the framework outlined in Sec. <ref>, a measurement apparatus in the form of an ancilla pair can be efficiently used to “measure” the density distribution by means of projections performed only on the ancilla.  \n\n\n\n§ RABI OSCILLATIONS IN THE ANCILLA COUPLED TO THE MAIN CHAIN\n\n\n\n\nBefore moving on to study the effect of ancilla projections on the main system, let us outline the basic concept of gaining information about the main system from the dynamics of the ancilla. It is based on the use of the fact that the probability of projection to either “particle\" or “hole\" in the ancilla dynamics is controlled by the expectation value of the ancilla density n_a, introduced in Sec. <ref>, right before the moment of projection. Since the ancilla site at which the projection is made is coupled by particle-particle interaction to the chain, the unitary dynamics of n_a between consecutive projections provides information about the occupation of the chain site to which it is connected. In the following Sec. <ref>, we will proceed to analyze the effect of the ancilla on the main chain, as opposed to the effect of the main chain on the ancilla as we consider in this section.\n\nIn the absence of coupling between the ancilla and the main chain (M=0), the ancilla dynamics is that of a two-level system subjected to periodic projections. Specifically, the ancilla displays Rabi oscillations, with the frequency given by |J|, and is reset after each projection performed on the lower ancilla site in either the |1 0⟩ or |0 1⟩ state, after which the Rabi oscillations continue with the same frequency.\n\n\n\nFor M≠ 0, the interaction between the main chain and the ancilla modifies both the characteristic Rabi frequency and the oscillation amplitude. As an instructive simple example, consider the static mean-field approximation for the configuration of Fig. <ref>. In this approximation, the density operator n̂_L/2 for site L/2 in the Hamiltonian is replaced by its expectation value n = ⟨n̂_L/2⟩ and its time dependence is neglected. The ancilla boson then “feels” the time-independent potential Mn. \nThe Rabi frequency Ω for the oscillations of n_a(t) becomes\n\n    Ω = √(J^2+M^2n^2),\n\ngrowing as M is increased, while the amplitude A of the oscillations is reduced:\n\n    A =  1/2J^2/J^2+M^2n^2.\n\nNote that Eqs. (<ref>) and (<ref>) correctly reproduce the limit of M=0, giving, in particular, A=1/2 for the unperturbed two-level system. Henceforth we set ħ = 1, express energies in units where J=1, and time in units of 1/J.\n\n\n\nThe ancilla dynamics in the setup of Fig. <ref> (with the domain-wall initial state of the main chain) for 0<t<Δ T and various choices of M is shown in Fig. <ref>, with the colored lines denoting the numerical results obtained from a full simulation of the entire system (for the case of U=1) and the dashed lines corresponding to Eqs. (<ref>) and (<ref>), for the case of site L/2 fully occupied (n=1) at t=0. The case of M=5 demonstrates a very good agreement between the numerical data and the two-level mean-field approximation. This is because the ancilla site in the limit of M≫ 1 acts as a pinning “impurity\" for the main chain. The small-amplitude Rabi oscillations in the ancilla are then a weak fast-oscillating perturbation of the otherwise slow dynamics of the entire system (tunneling processes in the main chain that change the occupation of the pinning site are weak for large M, yielding no appreciable change of n for M=5 within the time interval Δ T in Fig. <ref>). For intermediate M (exemplified by the cases of M=1 and M=3), a noticeable deviation becomes apparent, resulting, apart from fluctuations around the mean-field solution, from the time evolution of n associated with a melting of the domain wall. Qualitatively, however, Eqs. (<ref>) and (<ref>), which become exact in the limits of both small and large M, capture well the leading time-dependent behavior in n_a(t) for arbitrary M.\n\nIt is worth noting that the expectation value of the ancilla density for M=3 in Fig. <ref> appears to be very close to 1 at the projection time t=Δ T =2, similarly to n_a for M=5, but in a sharp contrast to the case of M=1. This is because of an approximate resonant condition: ΩΔ T=2√(10)≃ 2π for M=3 and n=1. As a result, at the time of projection, the ancilla with an intermediate-strength coupling (M=3) is felt by the system as if the coupling would be extremely strong. In other words, the resonance condition makes the potential of the ancilla exerted on the bosons in the chain similar to the potential of a strong impurity. \nThe probability of having no potential for a quantum trajectory (a_1^† a_1 projected to 0) at t=Δ T vanishes upon approaching the exact resonance. This resonance is, however, in general broadened through the breakdown of the two-level approximation for the Rabi oscillations.\n\nThe dynamics in the chain breaks down the resonance condition by changing n in Eq. (<ref>). \nHowever, as discussed above, a strong impurity (either with M≫ 1 or in the resonant case) slows down this dynamics, resulting in repeated measurements of n=1 (i.e., the quantum Zeno effect). Only rarely the occupations may change for the resonant coupling, which immediately removes the pinning, thus opening the channel underneath the ancilla. \nThis behavior is reminiscent of the operation of a valve, hence we dub it the “quantum-Zeno-valve effect\" (see the detailed discussions of implications of this phenomenon in Sec. <ref> below).\n\nThe procedure involves an inherent trade-off. On the one hand, the longer Δ T, the stronger the effect of the interaction between the main system and the ancilla (the “measurement apparatus”). On the other hand, as Δ T increases, the effect of the main chain on the ancilla is averaged over a longer time interval. This means that if one endeavors to obtain information about the main chain through subsequent measurements of the ancilla, this information will then be “blurred” over the time window Δ T. In Fig. <ref>, this effect is seen through the increasing difference in time between the simulated curves and those for the static mean-field approximation of Eqs. (<ref>) and (<ref>). \n\nAnother effect of a similar kind concerns the strength of interaction M. The characteristic Rabi frequency increases with growing M, i.e., the effect of interaction on the ancilla dynamics becomes apparent at earlier times for larger M (Fig. <ref>). At the same time, the effect of the ancilla on the main chain also increases as M grows. In the limit of large M, the measurement of a particle at the ancilla site leads, as already mentioned above, to a complete freezing of dynamics in the main chain. Importantly, the backaction, like the projective measurement, is instantaneous and results in a “spooky action at a distance” at every site of the chain. In particular, the (expectation value of the) particle density at each site of the main chain changes discontinuously at each measurement step.\n\nBuilding on the preceding discussion, the remarkably simple setup with a two-level ancilla can be utilized to “measure” n in the main system through a subsequent determination of the ancilla dynamics. The interested reader is referred to Appendix <ref> for a proof-of-principle discussion concerning how such a measurement protocol might be effected in practice. In the following sections, we will focus on the effect of the ancilla projections on the main chain dynamics, and investigate possible signatures of a measurement-induced transition.\n\n\n\n§ EFFECT OF REPEATED, SPATIALLY LOCALIZED MEASUREMENTS ON THE MAIN CHAIN\n\n\n\nHaving discussed the basic concept of coupling an ancilla to a many-body Hamiltonian system in Sec. <ref>, we now turn to an analysis of the effect of projective ancilla measurements on the main chain, where said measurements are performed repeatedly with a given frequency. We initialize the detectors by placing a boson in the ancillary pair at the lower site, with the other site empty. For the main chain, we consider two different initial states, both with half filling (L/2 bosons). We first examine, in Sec. <ref>, the initial state in the form of a product state with a domain wall in the middle, such that the leftmost sites are fully occupied, as depicted in Fig. <ref>. \nThis initial state is especially convenient for exploring the effect of measurements on the relaxation of inhomogeneous density distribution, as characterized, in particular, by the particle imbalance, Eq. (<ref>).\nFor this initial state, the measurement is performed with a single ancillary pair. \n\nWe then proceed, in Sec. <ref>, to analyze the case where the initial state is the ground state of Eq. (<ref>) (with decoupled ancilla sites, M=0), and use a single ancilla, as well as two ancillary pairs at the neighboring sites of the main chain, as illustrated in Fig. <ref>.\nChoosing this initial state has the benefit that the system, in the absence of measurements, does not evolve and remains in its weakly entangled state, as opposed to the domain-wall initial state. This is particularly useful for studying the entanglement dynamics.\nThe setting with two ancillas illuminates the nature of the feedback between the detectors in setups with multiple ancillas.   \nFinally, in Sec. <ref>, we will attach the ancillary pairs to every site of the main chain, which will be again initialized in its ground state. \n\n\n\n\n\n\n\n\n §.§ Domain-wall initial state with a single ancilla\n \n\n\nWe begin by analyzing the observables in a single-ancilla setup of Fig. <ref>. Starting from the domain-wall state, we observe a nonmonotonic dependence on the coupling constant M for both the domain-wall melting rate and the rate at which the entanglement grows. This makes evident a competition between different measurement-induced effects. \n\nFor M=0 the dynamics is integrable, and the domain wall displays relatively slow melting dynamics, as shown for reference in Fig. <ref> in Appendix <ref>. This behavior is similar to that studied in Refs. <cit.> and thought to belong to the Kardar-Parisi-Zhang class (see Refs. <cit.> and references therein). \n\n\n\n  §.§.§ Effect of measurements on averaged properties\n\n\nAs M is increased, the melting dynamics first accelerates as a result of integrability breaking induced by measurements, which is exemplified by the case of M=1 in Fig. <ref>(a). Indeed, we observe in the right panel that the number of particles transported through the center of the system has reached a value of almost L/4 for t = 200, indicating the almost complete melting of the domain wall. Transport is therefore faster than in the uncoupled case M = 0.\nRepeated measurements on the ancilla for M=1 also increase the entanglement growth in the system quenched from the domain-wall state, compared to the case  \n[see Fig. <ref>(c)]. \nRecently, a similar measurement-induced enhancement of the entanglement growth in a Hamiltonian system was also found in the quantum Ising chain <cit.>. Note that the acceleration of the entanglement growth by switching on coupling of the main chain to ancilla at M=1 is due to the effect of repeated measurements, but not the effect of coupling as such, see Appendix <ref>.\n\n\nGenerally, in the limit of large M, strong coupling between the main chain and the ancilla overcomes the effect of integrability breaking and, as already discussed in Sec. <ref>, brings dynamics to a stop. Domain-wall melting is arrested in this limit, and the ancilla boson is prevented from tunneling to the upper ancilla site by forming a repulsively bound pair with the boson on the measured site in the main chain. Projective measurements of the ancilla site only very rarely destroy this correlated state (see discussion below). A trend towards the freezing of the system dynamics is apparent by comparing the cases of M=1 and M=5 in Fig. <ref>. Dynamics slows down for M=5 compared to M=1, as is attested by the results in Figs. <ref>(a), <ref>(b), and <ref>(c) for the particle density in the main chain, the particle density in the ancilla, and the entanglement entropy [see the thick black lines in Fig. <ref>(c) that depict the average over 40 quantum trajectories] respectively. When M is increased to M = 50, we find no appreciable melting of the domain wall or growth of the entropy (see Appendix <ref>).\n\n\nAside from the general trend of, first, an increase in the melting rate as M is increased to M ≈ 1, and, second, a slowing down as M is further increased to M ≫ 1, the dependence on M is more intricate. Specifically, dynamics of the system shows oscillatory behavior as a function of M between M∼ 1 and M→∞. This is because of a possible commensurability of the Rabi frequency in the ancilla and the measurement rate 2π/Δ T. Although the density oscillations in the ancilla for a given M are not exactly periodic, their spectral weight is peaked around a certain frequency, the existence of which derives from the static mean-field approximation discussed in Sec. <ref>. \nOne of the consequences of this effect is an enhanced likelihood of obtaining the same result for two consecutive projections if Δ T/2π is close to an integer of the inverse peak frequency. For instance, under this condition, if a projection in the ancilla yields 1 for the occupation of the lower ancilla site, then the Born rule for the next projection most likely also yields 1 (quantum Zeno effect). Thus, when the resonant condition is closely satisfied, the effective measurement strength is enhanced, suppressing dynamics. This is the case for M=3, as seen from Fig. <ref>, where dynamics for all three observables (n, n_a, and S) is distinctly slower for M=3 than for either M=1 or M=5.   \n\n\n\n\n\n  §.§.§ Fluctuations: trajectory branching and the quantum Zeno valve effect\n\n\nThe mechanism by which the dynamics of the entanglement entropy S, averaged over realizations, is suppressed with increasing M reveals itself when we study the evolution of the entropy for particular quantum trajectories. These results are shown in Fig. <ref>(c). For M=1, the picture of S resolved with respect to realizations is relatively featureless. \nFor individual quantum trajectories, the entropy grows gradually, without sharp acceleration at any point in time, and closely approaches the thermal value (the Page entropy) already on a timescale on the order of 10^2. The distribution of S over different quantum trajectories for M=1 is  rather sharply peaked at any given t, with fluctuations becoming smaller and smaller as S approaches the Page value. This forms a well-defined reference curve for the  (“thermalized”) behavior of the entropy. \n\n\nFluctuations between different realizations grow as a function of M. Of particular interest is the manner in which the fluctuations become more prominent for M=3, when the system, as discussed above, exhibits a resonance between the Rabi frequency in the ancilla and the measurement rate. As a striking feature of the realization-resolved entropy for M=3, a given quantum trajectory exhibits a slow growth of S, identical to many other trajectories, until the trajectory suddenly “branches off”—this process is visualized as kinks on the trajectories in Fig. <ref>(c)—and starts quickly trending towards a highly entangled state that evolves similar to a typical state for M = 1. The delay time t' at which the branching-off from the least entangled state occurs for M=3 is seen to be widely spread in Fig. <ref>(c) within the interval of observation.\n\n\n\n\nThe effect of quantum-trajectory branching can be understood by considering the probability of measuring a hole on the ancilla site. Since the system for M=3 is close to the resonance (see Sec. <ref> above) and the ancilla is prepared at t=0 in a state with n_a=1, ancilla projections under these conditions measure a particle during a long sequence of measurements. This explains the relatively slow (compared to the case M=1) growth of S for time scales much larger than Δ T. \nOnce a hole is measured, which is a rare event near the resonance, the domain wall starts to melt much more rapidly, which triggers the rapid growth of the entanglement entropy. There hence emerges a valve effect (“quantum-Zeno-valve effect\"), in which the measurement of a hole moves the system away from the resonance and the system never evolves back towards it. The quantum trajectories eventually all end up in a thermal state once they have moved away from the resonance.\n\nThe sharp branching-off of quantum trajectories, associated with the measurement of a hole in the ancilla, is in fact a more robust feature of the entanglement spreading in the setup with a domain wall, not necessarily related to the commensurability of the Rabi frequency and the measurement rate. Namely, it is a feature of the entanglement dynamics also for arbitrary M≫ 1. In this limit, however, the mechanism of branching is different compared to the resonant case. The amplitude of Rabi oscillations given by Eq. (<ref>) is for M≫ 1 strongly suppressed, so that the likelihood of measuring a hole is small irrespective of the resonant condition. This is illustrated in Fig. <ref>(c) by the behavior of individual quantum trajectories for M=5, which is qualitatively similar to that for M=3. Note, however, that for M = 5 a larger fraction of trajectories have moved towards a thermal-type state, compared to the resonant case M = 3.\n\nThe evolution of the behavior of S for individual trajectories as a function of M involves an interplay of the above two mechanisms of branching, which leads to a nonmonotonic dependence of a typical delay time t' on M. Namely, for M=5, it is much larger than for M=1, but substantially smaller than for M=3. More specifically, the distribution of t' over trajectories for given M is parameterized in Fig. <ref>(c) by plotting the evolution of S(t) for a series of representative trajectories, sorted by the entropy integrated over time within the interval of observation,\n\n    Ξ = ∫_0^t_fdt   S(t),\n\nfor the final time t_f = 200. For each M, we have shown the curves having the highest Ξ (purple line), the lowest (blue), and the median (green). We have also plotted the curves that correspond to Ξ higher than 25 (orange) and 75 (red) percent of curves respectively.\n\n\n\n\nFor M = 1, the characteristic t' is of the order of unity, but the delay is seen to dramatically increase by two orders of magnitude to t'∼ 10^2 for M = 3, with the median trajectory (green curve) branching off at t'≈ 175. No branching whatsoever occurs for M=3 within the interval of observation for the least entangled trajectories in the bottom 25th percentile. The fact that the typical delay time is so large for M=3 attests to the resonance as the prime reason for the delayed branching. For M = 5, the delay time for the median trajectory decreases, compared to M=3, to t'≈ 60, pointing to the suppression of Rabi oscillations as a mechanism of the delay. For very strong coupling, M = 50, no branching at all is observed within the time t_f=200, see Fig. <ref> in Appendix <ref>.\n\n\n\n\n\n §.§ Ground state as the initial state\n \n\n\nIn Sec. <ref>, we have considered the case of a single ancilla coupled to the main chain, initialized in a domain-wall state.\nLet us now turn to the case where the initial state is the ground state of the uncoupled system (M=0) with U = 1/4, as schematically depicted in Fig. <ref> for two ancillas. This initial state is homogeneous (aside from boundary effects), features power-law correlations of the Luttinger-liquid type, and a finite entanglement entropy that depends logarithmically on L <cit.>. A useful feature of this choice is that measurement-induced disentangling behavior of the system can be probed more easily, as the entanglement entropy then decreases with respect to that in the initial state <cit.>. Conversely, we shall find that the quantum-Zeno-valve effect is less pronounced in this case, since domain wall melting is initially constrained by dynamics at the domain wall only, while particles can more easily rearrange themselves starting from the half-filling delocalized ground state. This means that the dynamics also more easily moves away from the resonant condition as discussed in Sec. <ref>.\n\n\n\n  §.§.§ Single ancilla\n\n\nIn Fig. <ref>, we show results for the entropy dynamics for a single ancilla, when the main chain is initialized in the ground state. \nIn general, the qualitative behavior of the entropy is analogous to the case of the domain-wall initial condition (Sec. <ref>), see Fig. <ref>(c).\nFor M=1, the entropy quickly grows with relatively small  fluctuations that decrease with time. For intermediate coupling, M=5, the quantum-Zeno-valve effect is apparent in the form of a sharp branching-off from the low-entanglement curve with a broad distribution of time t'. \n\nFor very strong coupling, M=50, we observe a clear bimodal distribution of the entropy. Specifically, for about half of the quantum trajectories, the system quickly “thermalizes,” whereas the other half of trajectories stay at low entanglement close to that of the initial state. \nThis behavior can be understood as follows. \nThe initial quench—coupling the ancilla to the chain—introduces high energy M in the components of the wave function with n_L/2=1. After projecting the ancilla, this component survives in about half of trajectories. After this, a blockade occurs for these trajectories, in a full analogy with the case of the domain wall (where n_L/2=1 initially for all the trajectories), see Sec. <ref> and Fig. <ref>. The stability of such a “repulsive bound state” formed on the ancilla site and the chain site with i=L/2 is explained by the energy conservation constraint. Indeed, this highly excited state cannot easily decay, since M is much larger than the bandwidth.  \n\nWe conclude that for a single ancilla with sufficiently large M, independently of the initial state, thermalization is accompanied by a formation of a bimodal distribution of quantum trajectories. The trajectories show sharp branching-off from the low-entropy to the high-entropy class of states, with a broad distribution of branching times t'. \n\n\n\n\n\n\n\n\n  §.§.§ Two ancillas\n\n\nWith a view to ultimately connecting to the physics behind measurement-induced transitions <cit.> and as a step towards the finite density of measured sites (Sec. <ref>), we enhance the effect of measurements by considering now two ancilla pairs, one connected to site L/2 and the other to site L/2 + 1 in the middle of the chain (see Fig. <ref>). This setting also allows us to explore possible correlations, mediated by the dynamics of the main chain, between multiple ancillas. \nThe measurement part of the Hamiltonian is a straightforward generalization of Eqs. (<ref>) and (<ref>) with identical interaction (M) and hopping (J) constants for both ancilla pairs.\n\n\n\n\n\n\nIn the measurement protocol, a projective measurement is performed on the left ancilla pair (i = L/2) first, followed after an infinitesimal time interval by a projective measurement on the right one (i = L/2 + 1). In a sequence of repeated measurements, a “double salvo\" of such two measurements is separated from the next one by the time interval Δ T.\nAs in the domain-wall setup, the bipartite entanglement entropy S is computed with respect to partition in the middle of the main chain. Considering the quench from the ground state, we analyze statistics over a larger number of individual trajectories, namely about 300, compared to 40 in Sec. <ref>.\n\n\n\n\n\nThe numerical results for M = 1, 5, 50 in the double-ancilla setup of Fig. <ref> are shown in Fig. <ref>. For M=1, the entanglement dynamics for the quench from the ground state with two ancillas is very much similar to that for a single ancilla. Specifically, the entanglement entropy grows with time in a smooth manner, gradually evolving to the thermal value, with a rather narrow distribution of the entropy over individual quantum trajectories. The shape of the typical entropy curves here is similar to the curve in Figs. <ref>(c) and <ref> for M=1. \nThe trajectory-averaged ancilla density n_a  [Fig. <ref>(b)] quickly loses memory of the initial condition for M=1, fluctuating around the average n_a = 1/2, also similar to the single-ancilla case [Fig. <ref>(b)]. \n\n\n\n\n\nWhen coupling M becomes stronger, M=5, the distribution of entropy broadens in analogy with the case of a single ancilla. \nAt the same time, an essential difference is observed. Specifically, the entropy growth for individual quantum trajectories does not show sharp branching between the two well-defined types of behavior described by the low- and high-entanglement curves (compare the panels for M=5 in Fig. <ref> and Fig. <ref>). Instead, the growth follows individual curves that are characterized by a rather broad distribution without apparent bimodal features. This can be attributed to the mutual “interference” effect of the two ancillas, tending to blur the quantum-Zeno-valve phenomenon.\n\nAnother striking difference is the emergence of up-and-down jumps, about 0.5–1 in magnitude, visible in the quantum trajectories of the entropy for M=5 and M=50. They are the signature of measurement-induced fluctuations of the particle number in halves of the chain, as is evidenced by a comparison between the timing of the jumps in the entropy and the timing and position of the density fluctuations. Note that the size of the jumps is close to the contribution to the entanglement entropy associated with a single Bell pair: ln 2.\n\nFor M=50, the entropy behaves similarly to the single-ancilla case in that there are two classes of trajectories (with low and high entanglement). However, there are also clear differences. \nFirst, a smaller fraction of trajectories features high entanglement. This is because the blocking by two ancillas is more efficient, since it is operative when at least one particle occupies sites L/2 and L/2+1. \nThus, the averaged entropy is strongly suppressed for the case of two ancillas. This provides indication for a formation of a disentangling phase for many ancillas, as discuss below in Sec. <ref>.\n\n\n\n\nTo complete the statistical description of quantum trajectories, we consider the distribution of the entanglement entropy as a function of time. We characterize the distribution by the variance:\n\n    var_S(t) = 1/R∑_j=1^R [S_j(t) - S_avg(t)]^2,\n\nwhere R is the number of realizations and S_avg is the mean value of the entropy. The result is shown in Fig. <ref>, where a strong dependence on the coupling strength M is evident, with a crossover around M=4 from a narrow distribution to a wide one. The fluctuations of S are nonmonotonic in time, with an initial increase of the distribution width followed by a decrease, except for the largest values of M. The narrowing of the distribution can be attributed to more trajectories converging to the thermal state for large t. For M=25 and 50, this narrowing is not seen because only a few rare trajectories are strongly entangled.\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Density distribution in the main chain for two ancillas\n\n\nIn Fig. <ref>(a), we show the averaged density in the chain as a function of time. For M=1, we observe an initial suppression of the density at the sites coupled to the ancillas. This inhomogeneity is faded away with time. For strong coupling, M=50, a very different behavior is observed: the density is enhanced and this enhancement stays approximately constant within the observation time. This is a manifestation of a formation of a repulsive bound state, discussed above (for a single ancilla).   \n\n\n\n\nTo further illustrate this, we present the density dynamics on the least and the most entangled trajectories for various M in Fig. <ref>. \nThe panels for the least entangled states at M=5 and M=50 in Fig. <ref>(a) clearly demonstrate the emergence, as M is increased, of a stable blocking region, with at least one of the two sites connected to the ancilla staying occupied. By contrast, the most entangled trajectories feature chaotic dynamics with frequent occurrence of holes on these sites. Recall that holes do not interact with the ancilla in Eq. (<ref>), whereas a particle on the site coupled to the ancilla is pinned by strong interaction with the ancilla particle. This is much the same physics as pertinent to freezing-out of the system with the domain-wall initial state in the limit of large M. \n\nWe also observe that the dynamics of the density is correlated with the entanglement dynamics. As an example, \nthe one-to-one correspondence between the entropy jumps and the fluctuations of the particle number imbalance can be clearly seen by comparing the evolution of S on the least entangled trajectory for M=5 in Fig. <ref>(c) and the density fluctuation for M=5 on this trajectory in Fig. <ref>(a). The presence of spikes in the entropy curves for the double-ancilla setup, as opposed to the case of a single ancilla, again indicates the importance of correlation in the dynamics of multiple ancillas caused by their interaction with the same main chain in the course of joint unitary evolution.  \n\n\n\n\n\n\n§ MEASUREMENTS ON EVERY SITE\n\n\n\n\n\nWith the above detailed analysis of the previous cases with one and two ancillas, we are now in a position to proceed with the setup where each site of the main chain is coupled to an ancilla pair.\n\n\n\n\n §.§ Measurement protocol\n\n\nThe consideration of a finite density of ancillas allows us to study the ancilla-measurement approach in the context of entanglement transitions. As in Sec. <ref>, we initialize the main chain in the ground state with U = 1/4. We address system sizes up to L = 24, so that the total number of sites in the system is L_tot = 24 × 3 = 72. This means that we can no longer use an unrestricted bond dimension (i.e., exact numerical simulations) as before. We furthermore restrict our time window to t ∈ [0, 50] as the simulations become more computationally demanding.\n\n\n\n\n\nThe measurement protocol is now as follows. At each step Δ T, we perform projective measurements on all ancilla sites connected to the main chain, using the Born rule as before. These measurements are performed consecutively from left to right, so that each ancilla is projected at every measurement cycle, with an infinitesimal delay between the measurements on\nneighboring sites. \n\n\n\n\n §.§ Overview of entanglement dynamics\n\n\n\n\n\nIn the double-ancilla case, we observed that having two ancilla pairs in the system is not sufficient to reach a disentangled state for every trajectory, even for very large measurement strength M = 50. It is therefore of interest to see whether a disentangling phase forms in the limit of a large number of ancilla pairs. Furthermore, it is even more intriguing questions whether our setup yields an entanglement transition and what are then the properties of the entangling phase. In particular, while we observed a thermalizing (reaching nearly maximum entanglement) behavior for one and two ancillas with M=1, it is not obvious whether this behavior survives in the case of all sites coupled to ancillas. \n\n\n\nIn Fig. <ref>, we show the resulting dynamics of the entanglement entropy \nfor the chain length L=20 and various choices of M = 1, 3, 4, 5, 10.\nFor all values of M we see an initial growth of S at t≲ 10, induced by the quench. For longer times the dynamics for different couplings is very different. \nFor large measurement strength, M = 10, we observe that entanglement is suppressed on average, as shown by the thick black line, compared to entanglement in the initial state. The most entangled trajectory as quantified by Ξ (thin purple line), unlike the double-ancilla case, also exhibits suppressed entanglement. We have verified (result not shown) by comparing the cases of bond dimensions χ=128 and χ = 256 that the value of the average entropy in the large-M limit (M ≥ 5) is not dependent on the cutoff determined by the bond dimension. \n\nFor sufficiently weak measurements, M = 1, we observe a fast growth of entanglement with a quick saturation at the cutoff value. The entropy follows the curve that is almost identical in shape to those for the single- and double-ancilla setups at M=1, which approached the Page value proportional to the system size (see Sec. <ref>). Therefore, we expect that in this case the exact dynamics (which is numerically inaccessible for long times t≳ 15 due to strong entanglement growth) should closely approach the Page value indicated by the dotted black line. The clear difference in the entanglement dynamics for M=1 and M=10 strongly suggests an existence of a measurement-induced entanglement transition in between. \n\nLet us now inspect the entanglement dynamics for the intermediate values of M. The dynamics for M = 5 is very similar to the case M = 10, indicating that M=5 also belongs to the disentangling phase. For M=4, we observe a very weak increase of the entropy, which is followed by a saturation at a value that is only slightly larger than the initial one.  \nFor M = 3, there is a clear trend of increasing entropy with time, although the increase is much slower than for M=1.\nAt this value of M, we observe a dependence on the bond dimension χ at later times.\nThis consideration suggests that the entanglement transition takes place in the vicinity of M=4. To shed more light on this, we will consider the L-dependence of the entropy in Sec. <ref>. \n\nFor all values of M>1 in Fig. <ref>, we see a broad distribution of the entanglement entropy over quantum trajectories. \nAt the same time, no bimodality features are observed in these distributions. We argue that the bimodality that we encountered in the single- and two-ancilla cases (Sec. <ref>) is smeared by the interference of multiple ancillas in our implementation of measurements. \n\n\n\n\n\n\n\n\n §.§ System-size dependence of entropy and measurement-induced transition\n\n\n\n\nIn Fig. <ref>, we investigate the disentangling-entangling transition more closely by showing the behavior of the entropy as a function of time for various system sizes L = 8, 12, 16, 20, 24 for M = 1, 3, 4, 5. \nFor M = 1 (entangling phase) we observe a clear dependence on the system size. Furthermore, we observe a fast increase, approximately linear in time for t ≲ L, of the entropy towards its maximum value. For small systems (L=8, 12), this maximum is determined by the Page entropy and for larger system sizes (L ≥ 16) it is determined by the cutoff established by the bond dimension χ.\nThis implies that in this case the exact dynamics is reproduced up to times t≈ 15 for L ≥ 16. In view of the bond-dimension cutoff, the curves for L =16, 20, and 24 remain nearly identical in the whole considered time range. The saturation value increases approximately proportional to L for L= 8, 12, and 16. This indicates a volume-law dependence of the entanglement entropy. Weak fluctuations around the average, as seen in Fig. <ref>,\nlike in the single- and double-ancilla setups for M=1 (where the entropy reached the Page value), are also suggestive of volume-law behavior. A volume law for not too large M is consistent with earlier results on interacting Hamiltonian systems obtained with different implementations of measurements <cit.>. \n\nOn the other hand, for M = 5, the curves collapse within error bars for different L, a feature of area-law scaling. In the intermediate case M = 4, we observe a very weak growth with system size, just about distinguishable within error bars. This behavior can be potentially described as a logarithmic growth with a relatively small prefactor\n(which is still larger than that in the Luttinger-liquid ground state <cit.>). Alternatively, the weak L dependence here can, in principle, be attributed to finite-size corrections convergent to an area-law curve. More work is needed to distinguish between the two possibilities.\nNote that this value of M corresponds to the crossover scale identified in the previous section, associated with the width of the distribution of the entropy for different trajectories in the two-ancilla case (see Fig. <ref>).\nFor M=3, we observe a clear increase of the long-time value of entropy (note that the largest-L curves start to be slightly affected by the bond-dimension cutoff, as mentioned above). This supports the interpretation of M=3 belonging to the entangling phase. \n\nThis analysis confirms our above expectation \nthat the transition is located near M=4. A more precise determination of the critical measurement strength would necessitate larger system sizes, as well as a longer time window for the simulations. Likewise, unambiguously distinguishing a volume-law asymptotic behavior from a possible critical phase with logarithmically growing entanglement with a large prefactor is difficult in numerical simulations in view of system-size and finite-time limitations.\n\n\n\n\n\n\n\n §.§ Density fluctuations\n\n\nTo make a connection between the entropy and density dynamics, we also analyze the fluctuations in the particle density by considering the particle imbalance ℐ.\nAs before, this quantity measures the number of particles in the main chain that have moved from the right side of the system to the left side. We depict the dynamics in the bottom panels of Fig. <ref>. As might be expected, these fluctuations generally increase as a function of M, with the average state nonetheless being close to homogeneous density. \n\n\nFor the results in the disentangling phase, with M = 5 and M = 10, we find occasional “plateaus” in the imbalance, associated, in particular, with weakly entangled trajectories (thin blue lines in both upper and lower panels of Fig. <ref>). Such a plateau can be associated with weakly entangled trajectories corresponding to blocking regions in the two-ancilla case (see Fig. <ref>a). In the many-ancilla case, such a blocking region can occur at any point in the chain. This is illustrated by considering the trajectories corresponding to the weakest bipartite entanglement, as shown in Fig. <ref>. \n\n\nHere we again see a clear qualitative difference between the cases M = 3 (entangling phase) and M = 5 (disentangling phase). In the former case, the density in the main chain rarely approaches the fully polarized values corresponding to a particle or hole, but shows only moderate fluctuations around the half-filling density. For M = 5, however, one can observe polarized regions with strongly peaked density close to 1 and 0 (dark red and dark blue, respectively). The case M = 10 looks qualitatively similar to M = 5, supporting the observation that both cases correspond to the disentangling phase. We note that in these cases, the minimum entropy trajectories feature the blocking regions at the center of the chain, where the bipartition cut is located (as in the two-ancilla setup).\n\nThe above analysis demonstrates the capability of the method to detect the measurement-induced transition in a correlated many-body system.\nOur results provide further indications that measurement-induced transitions are a universal feature across a variety of measurement techniques, through employing a measurement protocol different from those conventionally used in this context. \n\n\n\n§ DISCUSSION AND CONCLUSIONS\n\n\n\nIn this paper, we have developed an implementation of a realistic measurement apparatus for generalized measurements on quantum many-body systems, based on the coupling of the system sites to ancillary degrees of freedom that are stroboscopically projected. Our protocol can be implemented in experimental setups with, e.g., ultracold atoms, trapped ions or superconducting qubits, and can be readily adapted to generalized measurements of observables other than density by adjusting the measurement part of the Hamiltonian (<ref>).\n\nWith this tool, we have studied the effect of projective measurements of the ancillary degrees of freedom on the dynamics of hard-core bosons in the “main” system. Our work complements previous numerical studies in the field of measurement-induced transitions by implementing the measurements in such a way that the effect on the system of interest is indirect, through the ancilla sites that are entangled with the system. In this sense, it is a more realistic description than the\napproaches that involve a direct measurement of observables of the\nsystem, or the approaches that mimic continuous monitoring through an ad hoc stochastic formalism. We have started with the setups where the system is coupled to a single or a double ancilla pair, and then explored the setup with all sites of the main chain coupled to ancillas.\n\nAnalysis of the density and entanglement dynamics in the single- and double-ancilla setups (Sec. <ref>) reveals a “quantum-Zeno-valve effect” for sufficiently strong coupling M between the ancilla and a site of the chain. This effects leads to long-lived quantum trajectories with very low entanglement corresponding to the blocking of the dynamics by a formation of a nearly bound state. This phenomenon is a manifestation of the interplay between the measurement backaction and the accumulated feedback of the measured system exerted on detectors in the absence of their reinitialization.  \n\nAs discussed in Secs. <ref> and <ref>, the single- and double-ancilla setups already feature certain signatures of the many-ancilla entanglement transition. \nSpecifically, we observe a crossover with increasing M between two distinct types of behavior. For relatively small M, represented by M=1, all the quantum trajectories correspond to fast thermalization, with entanglement entropy approaching its maximum value and weak fluctuations. On the other hand, for large M, we have observed a strong variance of entanglement entropy, with some trajectories exhibiting strong entanglement across the system and others having strongly suppressed entanglement in comparison to thermal, chaotic states. This feature persists even for strong coupling M = 50, implying that typical trajectories are not representative for the dynamics at large M. The crossover between these types of dynamics occurs around M=4. Applying only a single (or double) measurement is not sufficient to disentangle all trajectories; we always observe at least a few trajectories that are strongly entangled, even for a very large measurement strength. Therefore, we conclude that a genuine entanglement transition requires a finite density of ancilla pairs. \n\nWe have confirmed the existence of the transition explicitly in a setup where every site of the chain is measured, Sec. <ref>. We have observed entangling behavior for weak measurement strength and disentangling behavior for strong measurement strength. \nUsing matrix product states, we have studied the system sizes of up to L=24 sites in the main chain (ergo, 24 × 3 = 72 sites in the system as a whole). Analyzing the dependence of the entanglement entropy on time t and the system size L, we have found evidence of a transition for a measurement strength M ≈ 4. Remarkably, this is essentially the same value as was identified for the crossover in the setups with one or two ancillas. Our numerics provides indications of a volume-law entropy scaling in the entangling phase, which is in line with previous results on correlated chains, where different\nimplementations of measurements were employed <cit.>. Note that such a behavior is also typical for the entanglement transition in random quantum circuits <cit.>. \n\n\nOur work demonstrates the capability of the developed approach to capture the physics of measurement-induced entanglement transition in a realistic setup. It sheds more light on the nature of the entanglement transition, by disclosing the tomographic signatures of the transition in terms of quantum trajectories.\nMoreover, it reveals a high degree of  universality of the measurement-induced entanglement transition in correlated many-body systems with respect to implementation of measurements.\n\nTo conclude, let us list possible future directions opened by this work. \nBy considering an intermediate probability 0 < P < 1 of measuring the ancilla within a given measurement interval, one can enrich the  phase diagram of a measurement-induced transition. Furthermore, a quantitative analysis of the measurement-induced transition and associated critical behavior in our framework remains to be performed. In addition, it would be interesting to explore how the resetting of ancillas affects the entanglement transition. Another possible avenue for future work is that in the noninteracting case U = 0, the volume-law behavior was argued to be unstable in the archetype measurement protocols. It is interesting to study whether this statement holds for our measurement setup, where the interaction between ancillas and the chain site is inevitably present even for U=0.  \nFinally, the developed framework is expected to be valuable for applications in the context of quantum engineering and information processing, such as steering of quantum states. The present analysis may be adapted to many realistic interacting systems of interest, ranging from cold-atom or trapped-ion quantum simulators to superconducting qubit arrays. \n\n\n\n§ ACKNOWLEDGMENTS\n\n\n\nWe thank J. Behrends, C. Castelnovo, H. Perrin, I. Poboiko, P. Pöpperl, and A. Štrkalj for useful discussions. \nEVHD and IVG gratefully acknowledge collaboration with Oleg Yevtushenko at early stages of this work. \nThe work was supported by the Deutsche\nForschungsgemeinschaft (DFG): Project No. 277101999\n– TRR 183 (Project C01) and Grants No. EG 96/13-1 and No. GO 1405/6-1, by the Helmholtz International Fellow\n    Award, and by the Israel Binational Science Foundation\n    – National Science Foundation through award\n    DMR-2037654.\nThe simulations in this work have been performed using the  library, versions  and  <cit.>. We acknowledge support by the State of Baden-Württemberg through bwHPC.\n\nData availability.— Numerical data and source codes are available from the corresponding author upon reasonable request.\n\n\n\n\n\n§ NUMERICAL METHOD\n \n\n\n\n\nFor our simulations, we apply the procedure similar to the one outlined in Ref. <cit.>. That is, we use the time-dependent variational principle (TDVP) as applied to matrix product states (MPS) <cit.> to exactly compute the unitary evolution. The difference between the procedure outlined in Ref. <cit.> and the method used in this work, is that projections of the ancilla site are instantaneous. This is effected through the application of a strong imaginary on-site potential on the first ancilla site:\n\n    ℋ_proj = ± iA a_1^† a_1.\n\n\nThe dynamics is then computed over the time interval [0,η], resulting in imaginary-time propagation. In the limit A,η→∞, this results in a projection onto either the |01⟩ or |10⟩ state for the ancilla, depending on the sign ± in Eq. (<ref>). As explained in the main text, this sign is determined stochastically, by applying the Born rule to the ancilla density n_a. During this process, the original Hamiltonian is “switched off.” In the case where there is more than one ancilla pair, each projection is performed consecutively, starting from the left side of the main chain (i = 1).\n\nWe choose the numerical parameters A = 3 · 10^8 and η = 10^-6. Numerically, the procedure is subdivided into 10 smaller steps to improve stability. A larger value of η would provide a closer approximation of the projection (typically, we find a deviation of around 10^-4 in the ancilla density after projection); we choose a smaller value to reduce computational effort without significantly compromising accuracy.\n\n\nFor implementing the model using MPS, we map the system of the main chain plus the ancilla pairs onto a next-nearest-neighbor Hamiltonian, by “folding” the ancillary sites into the main chain. One can avoid introducing next-next-nearest neighbour terms by alternating the ancilla and main sites in the resulting one-dimensional chain—this structure facilitates the calculation. Note, however, that, because of this choice, it is not straightforward to find, e.g., multipartite entanglement involving the ancilla pair as one of the partitions. In the case of many ancillas (Sec. <ref>) there is not sufficient “space” to fold both ancilla sites into the main chain, and we do use a next-next-nearest neighbor Hamiltonian.\n\nWe observe that, for the cases of one and two ancillas studied in Sec. <ref>, there is no parameter range for which entanglement is strongly suppressed in all trajectories. Hence, there will be some trajectories poorly approximated in case the MPS is truncated. For that reason, we do not restrict the bond dimension of the MPS when dealing with one or two ancilla pairs; our approach then becomes equivalent to exact diagonalization and we are restricted to modest system sizes of ≈ 20 sites. Alternatively, one could post-select only those trajectories that have limited entanglement, keeping the maximum bond dimension, at the cost of losing information about the more entangled trajectories. This might be an interesting avenue for future work.\n\n For the case of ancillas coupled to every site (Sec. <ref>), the total number of sites in the whole system is up to 24 × 3 = 72. Obviously, an exact diagonalization is not possible any more.  Our analysis of the entanglement transition proceeds similarly to Ref. <cit.>. We perform the calculations with the bond dimensions χ=128 and 256. For sufficiently strong coupling to ancillas, M ≥ 4, all quantum trajectories exhibit suppressed entanglement, so that the truncation of the bond dimension to the lower-entanglement subspace does not influence the result. On the other hand, for weaker couplings, M ≤ 3, the bond-dimension truncation starts limiting the growth of the entanglement at long times, as pointed out in the main text.\n \n\n\n\n\n\n\n\n§ PROTOCOL FOR THE RECONSTRUCTION OF THE DENSITY IN THE MAIN CHAIN\n\n\n\n\nIn the main text, Sec. <ref>, we have discussed the effect of the main chain on the ancilla dynamics. As a “proof of concept,\" let us provide a demonstration of how one could infer the main chain density n_i from the ancilla dynamics coupled to the site i. For the same parameters as used in Fig. <ref>, we consider 100 measurement cycles, i.e., continue the runs up to time t = 200. For each cycle, we infer the density on the chain site connected to the ancilla by fitting Eqs. (<ref>) and (<ref>) to the ancilla density. Here, we only consider those cases where a particle was measured in the ancilla, separately for each measurement step. For sufficiently coupling strength M, this procedure provides remarkably good agreement to the true density (as numerically obtained from the full many-body wave function). For M = 3 and M = 5, the two curves match very closely, while for weaker measurement strength M = 1, in which case the two-level approximation does not work as well, the agreement is qualitative. Thus, the employed ancilla-based setup is indeed capable of measuring the true density in the chain.\n\n\n\nOf course, in a realistic experimental setting, we do not have direct access to the ancilla dynamics n_a(t) while measurements are not performed, as such measurements would necessarily be at least partially destructive and affect the ancilla dynamics itself. However, Fig. <ref> does clearly demonstrate that the information about the main chain density n_L/2 is strongly correlated to the ancilla density. Thus, it is in principle possible to obtain this information from projective measurements. One possible approach is to restrict the measurement interval Δ T in such a way that it is smaller than half a period of the ancilla Rabi oscillations for the non-measured case , leading to the simple criterion JΔ T < π. Then, a one-to-one mapping of n_a to n_L/2 can be constructed by cross-correlating the results of projective measurements for many different choices of M over several trajectories.\n\n\n\n\n\n§ DYNAMICS IN THE ABSENCE OF MEASUREMENTS\n\n\nIn the main text, we have discussed the case where the main chain of the system is coupled to one or more ancilla pairs with a nearest-neighbour interaction M, and projective measurements are “stroboscopically” performed at regular intervals Δ T. For the sake of comparison, it is useful to consider the cases where there is no interaction, and where there is coupling to ancilla but no measurement is performed on the ancilla. We will consider both cases in this Appendix.\n\n\n\n §.§ Uncoupled case\n \n\nLet us first compare the dynamics of the measured system to that in the “uncoupled” case without any interaction between the main chain and the ancilla, M = 0. We show the result in the left panel of Fig. <ref>, starting from the domain-wall initial state. In this case, the density evolution is believed to feature integrable Kardar-Parisi-Zhang dynamics <cit.>. Interestingly, in the finite-size setup, we observe multi-scale oscillations of the density, apparently related to the interference effects resulting from multiple bounces of the excitations from the boundaries in this integrable model. The analytical description of this phenomenon is, however, beyond the scope of this work. Comparing to the case of repeated measurements as shown in the main text (Sec. <ref>), we see that a finite ancilla-chain coupling M in a single-ancilla setup destroys the peculiar features of Kardar-Parisi-Zhang domain-wall melting by breaking the integrability of the system.\n\n\n\n\nTo provide a further benchmark, we have compared the integrable dynamics computed using our TDVP implementation at M = 0 (decoupled ancilla) to the dynamics obtained from the exact simulation of the main-chain dynamics only (i.e., no ancilla present) as obtained from a fully independent calculation using the  library <cit.>, finding an excellent agreement (result not shown).\n\n\n\n\n\n\n §.§ No ancilla projections\n\n\n\nIt is also useful to investigate the case where the system is quenched at t = 0, but no measurement is performed. Let us  consider the case of a single ancilla with the domain-wall initial condition. The results for M = 1 and M = 5 are shown in the middle and right panels of Fig. <ref>, the corresponding entropy dynamics is shown in Fig. <ref>, and the dynamics of the ancilla is shown in Fig. <ref>. Comparing the case of only this single quench to the case of repeated measurements (Fig. <ref> of the main text), we see dramatic differences. Indeed, in the absence of measurements, the state remains close its initial  form: the density distribution remains close to the domain-wall initial condition, the entropy stays well below the Page value, and the ancilla density n_a stays close to unity (well above 1/2). On the other hand, repeated measurements lead to thermalization that manifests itself in the entropy approaching the Page value, domain wall smearing, and the ancilla density relaxing towards 1/2 (cf. Fig. <ref>). This demonstrates that the physics studied in this paper is not just governed by the coupling to an ancilla but is rather induced by projective measurements of the ancilla degrees of freedom. \n\n\n\n\n\n\n\n\n§ ADDITIONAL DATA TO THE SINGLA-ANCILLA SETUP WITH A DOMAIN-WALL INITIAL STATE\n\n\n\nIn Sec. <ref>, we have studied the dynamics of the entanglement entropy and its fluctuations for the setup with one ancilla and a domain-wall initial state. In this Appendix, we provide additional numerical data for this setup. \n\nIn Fig. <ref>, the five least entangled trajectories, as quantified by the integrated entropy Ξ [Eq. (<ref>)], are displayed. \nFor the case of relatively weak measurement strength, M = 1, all curves are similar, with only minor fluctuations, and the least entangled trajectories are close to the average, as is also expected from the corresponding data in Fig. <ref>(c). For the resonant case M = 3, we see that all curves fall on top of each other, implying that the measurement results are identical for each of these trajectories. For a still stronger (and non-resonant) coupling, M = 5, all five trajectories are identical (and are characterized by a very small entropy) up to a time t ≈ 120, after which they start exhibiting branching off towards high entropy state. These three panels provide an additional manifestation of a distinct physics in the case of relatively weak (M=1), resonant (M=3), and strong off-resonant (M=5) couplings.\n\n\nWe also show in Fig. <ref> the entropy dynamics for the case M = 50 in the domain-wall setup. The data complement those shown in Fig. <ref>c for the same setup and M= 1, 3, and 5.  As pointed out in the main text, the dynamics here almost totally freezes for all trajectories since the Rabi oscillation amplitude approaches zero as M →∞ and a “nearly bound state” is formed. The domain wall is therefore robust up to very long times. This manifests itself in very low values of the entanglement entropy for all trajectories. \n\n\n\n\n\n \n\n\n\n\n\n"}