{"entry_id": "http://arxiv.org/abs/2303.07387v1", "published": "20230313180825", "title": "Searching for the sources of excess extragalactic dispersion of FRBs", "authors": ["Sunil Simha", "Khee-Gan Lee", "J. Xavier Prochaska", "Ilya S. Khrykin", "Yuxin Huang", "Nicolas Tejos", "Lachlan Marnoch", "Metin Ata", "Lucas Bernales", "Shivani Bhandari", "Jeff Cooke", "Adam T. Deller", "Suart Ryder", "Jielai Zhang"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA", "astro-ph.CO"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSunil Simha\nshassans@ucsc.edu\n\n\n\n0000-0003-3801-1496]Sunil Simha\nUniversity of California - Santa Cruz\n1156 High St.\nSanta Cruz, CA, USA 95064\n\n0000-0001-9299-5719]Khee-Gan Lee\nKavli IPMU (WPI), UTIAS, The University of Tokyo, Kashiwa, Chiba 277-8583, Japan\n\n0000-0002-7738-6875]J. Xavier Prochaska\nUniversity of California - Santa Cruz\n1156 High St.\nSanta Cruz, CA, USA 95064\nKavli IPMU (WPI), UTIAS, The University of Tokyo, Kashiwa, Chiba 277-8583, Japan\nDivision of Science, National Astronomical Observatory of Japan,\n2-21-1 Osawa, Mitaka, Tokyo 181-8588, Japan\n\n0000-0003-0574-7421]Ilya S. Khrykin\nKavli IPMU (WPI), UTIAS, The University of Tokyo, Kashiwa, Chiba 277-8583, Japan\n\n0000-0002-0298-8898]Yuxin Huang\nKavli IPMU (WPI), UTIAS, The University of Tokyo, Kashiwa, Chiba 277-8583, Japan\n\n0000-0002-1883-4252]Nicolas Tejos\nInstituto de Física, Pontificia Universidad Católica de Valparaíso, Casilla 4059, Valparaíso, Chile\n\n0000-0003-1483-0147]Lachlan Marnoch\nSchool of Mathematical and Physical Sciences, Macquarie University, NSW 2109, Australia\nCSIRO, Space and Astronomy, PO Box 76, Epping NSW 1710 Australia\nAstronomy, Astrophysics and Astrophotonics Research Centre, Macquarie University, Sydney, NSW 2109, Australia\nARC Centre of Excellence for All-Sky Astrophysics in 3 Dimensions (ASTRO 3D), Australia\n\n0000-0002-5934-9018]Metin Ata\n\nThe Oskar Klein Centre, Department of Physics, Stockholm University,  \n AlbaNova University Centre, SE 106 91 Stockholm, Sweden\n\n\n0009-0002-9608-9275]Lucas Bernales\nInstituto de Física, Pontificia Universidad Católica de Valparaíso, Casilla 4059, Valparaíso, Chile\n\n\n0000-0003-3460-506X]Shivani BhandariVeni fellow\nASTRON, Netherlands Institute for Radio Astronomy, Oude Hoogeveensedijk 4, 7991 PD\nDwingeloo, The Netherlands\nJoint institute for VLBI ERIC, \nOude Hoogeveensedijk 4, 7991 PD Dwingeloo, The Netherlands\n\n0000-0001-5703-2108]Jeff Cooke\nCentre for Astrophysics and Supercomputing, Swinburne University of Technology, Mail Number H29, PO Box 218, 31122, Hawthorn, VIC, Australia\nARC Centre of Excellence for All-Sky Astrophysics in 3 Dimensions (ASTRO 3D), Australia\nCSIRO, Space and Astronomy, PO Box 76, Epping NSW 1710 Australia\n\n0000-0001-9434-3837]Adam T.Deller\nCentre for Astrophysics and Supercomputing, Swinburne University of Technology, Mail Number H29, PO Box 218, 31122, Hawthorn, VIC, Australia\n\n0000-0003-4501-8100]Stuart D. Ryder\nSchool of Mathematical and Physical Sciences, Macquarie University, NSW 2109, Australia\nAstronomy, Astrophysics and Astrophotonics Research Centre, Macquarie University, Sydney, NSW 2109, Australia\n\n0000-0001-5310-4186]Jielai Zhang\nCentre for Astrophysics and Supercomputing, Swinburne University of Technology, Mail Number H29, PO Box 218, 31122, Hawthorn, VIC, Australia\nARC Centre of Excellence for Gravitational Wave Discovery (OzGrav), Australia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe FLIMFLAM survey is collecting spectroscopic data of field galaxies near fast radio burst (FRB) sightlines to constrain key parameters describing the distribution of matter in the Universe. In this work, we leverage the survey data to determine the source of the excess extragalactic dispersion measure (DM), compared to the Macquart relation estimate of four FRBs: , , , and . By modeling the gas distribution around the foreground galaxy halos and galaxy groups of the sightlines, we estimate , their contribution to the FRB dispersion measures. The  sightline shows a clear excess of foreground halos which contribute roughly 2/3^rd of the observed excess DM, thus implying a sightline that is baryon-dense.  shows a smaller but non-negligible foreground halo contribution, and further analysis of the IGM is necessary to ascertain the true cosmic contribution to its DM.  and  show negligible foreground contributions, implying a large host galaxy excess and/or progenitor environment excess.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n \n\nWith the advent of the concordance Lambda-Cold Dark Matter (Λ CDM) cosmological paradigm, there is now a comprehensive model for the large-scale structure of matter in the universe, and its formation under the influence of gravity is one of the key tests that is actively being researched. Cosmic microwave background (CMB) experiments <cit.> have precisely measured the contents of the universe and simulations have rendered clarity regading the time-evolution of structure beginning from primordial fluctuations <cit.>. In the current paradigm, dark matter forms the cosmic web, the large scale structure that includes voids, filaments, and dense halos and serves as scaffolding for the accretion of baryonic matter. \nIndeed, hydrodynamical simulations <cit.> have shown us that the ionized gas populates dark matter halos and also occupies the cosmic web filaments or the intergalactic medium (IGM), albeit in a much more diffuse state.\n\nThe low density of the IGM plasma has long challenged baryon census studies at z≲0.5. The Lyman alpha forest and UV absorption studies of metal ion tracers such as OVI and OVII are not sensitive to ∼40% of the IGM baryons <cit.> which reside is the hot (∼10^6 K), diffuse phase according to theory <cit.>. With existing facilities, very long-exposure X-ray observations  (multi-million seconds) are required to to detect the weak absorption expected from OVII tracers of the hot phase <cit.>. Alternatively, stacking the weak kinetic Sunyaev-Zeldovich signal between ≳10^6 galaxy pairs could reveal the gas in filaments <cit.>.\n\nIn the meantime, the serendipitous discovery of the first Fast Radio Burst (FRB) in archival data <cit.> has set in motion a series of paradigm-changing discoveries. FRBs are millisecond-duration radio transients whose origins are still widely debated. With improved radio detection techniques, over the last five years multiple FRBs have been localized in the sky with sub-arcsecond accuracy <cit.> and thus their radial distance could be confidently measured from their host galaxy redshifts (). FRBs pulses are dispersed by plasma during propagation and the extent of this effect is directly related to the integrated, line-of-sight free electron density (n_e). \nThis effect is quantified by the FRB Dispersion Measure () which is defined as:\n    \n    = ∫n_e/1+zdl    .\n\nHere, z is the cosmological redshift and dl is the distance element along the line-of-sight. \nAs  is an integral quantity, \nit may be represented as the sum \nof the electron reservoirs encountered \nduring propagation. i.e. \n\n    = ++ .\n\nHere,  is from the electrons within the Milky Way interstellar medium (ISM) and halo,  is from the counterpart structures in the host galaxy, and  is from the plasma in intervening halos and the diffuse IGM in the foreground, i.e. = +. <cit.> were the first to estimate  for a sample of localized FRBs and showed that it is correlated with . This was as expected of the current paradigm of cosmological expansion and the fraction of ionized baryons in the universe [Estimated by leveraging observational constraints on denser baryon reservoirs in the form of stars, remnants and neutral gas <cit.>.]. This proved directly that the “Missing” Baryons were not just found, but also that  could viably probe the diffuse plasma in the Universe. The community has largely adopted the moniker of the “Macquart relation\" to refer to the average , i.e. , versus .\n\nWhile the mean Macquart relation is well described by \ncosmology <cit.>, \nthere is expected to be scatter about at any given redshift\ndue to the inhomgeneity of cosmic structure.\nFor example, some FRB sightlines \nmay intersect the gas rich environments of intra galaxy cluster media while others may primarily intersect cosmic voids. \nFurthermore, galaxy feedback can influence the variance in gas density by distributing gas further out of gravitational wells \n<cit.>. Indeed, as we shall show in the subsequent section, one identifies a number of FRBs where estimates for  from nominal assumptions on  imply >. However, it is not evident a priori if the excess arises from foreground structure (i.e. intervening halos and IGM overdensities) or from an atypical host and progenitor environment. Our previous work <cit.> has introduced\na methdology to estimate the contribution from foreground halos. Here, we apply our analysis to four FRB sightlines with apparently high  values. Future application of such analyses on a statistical sample of FRBs\ncan inform us on the distribution of ionized gas within dark matter halos <cit.>.\n\nTo this end, we leverage the redshifts of galaxies collected as part of the FRB Line-of-Sight Ionization Measurement From Lightcone AAOmega Mapping  (FLIMFLAM) survey <cit.>. This redshift survey aims to study the foreground matter distribution along ∼30 FRB sightlines. The key results expected from the survey include constraints accurate to ∼10% on (1) the fraction of baryons in the universe in the diffuse IGM and (2) the fraction of baryons residing in circum-galactic halos that are in the ionized phase. In this redshift survey, spectroscopic redshifts \n and photometry of foreground galaxies within ∼1 degree of an FRB sightline are used to generate bespoke models of the line-of-sight ionized matter density tailored to individual lines-of-sight, which can then be compared with the DM from the FRB. Key reservoirs of said matter include intervening dark matter halos and the diffuse intergalactic medium (IGM). In this work, with a subset of the spectroscopic data collected, we investigate four excess  sightlines: , ,  and . These fields were targeted with the wide-field Anglo-Australian Telescope(AAT)/AAOmega and the Keck/LRIS and DEIMOS spectrographs.\n\nThis manuscript is outlined as follows: section <ref> describes the data collection and reduction. Section <ref> describes our intervening-galaxy-halo DM estimation procedure. Section <ref> describes the results and section <ref> discusses their implications. Throughout this work, unless otherwise specified, we assume a ΛCDM cosmology with Planck 2018 cosmological parameters <cit.>.\n\n\n\n§ DATA\n \n\n\n\n §.§ Sample selection\n\n\n\nAs described in the introduction, structure\nin the cosmic web is expected to produce a \nsignificant scatter in the Macquart relation due to sightline-to-sightline variation in the column density of intervening gas <cit.>. \nFigure <ref> is an updated plot showing the \nMacquart relation and data from the sample of CRAFT-localized FRBs published to date <cit.>. \nThe DM values shown in the plot correspond to \nestimates of the cosmic dispersion measures,\n\n\n    =  -  - /(1+z),\n\nwhere  is estimated as the sum of the ISM contribution () \ntaken from the NE2001 model <cit.>, and the halo contribution () which is assumed \nto be 40 . We do note that there is evidence pointing to highly variable Milky Way halo contribution, . i.e. σ()∼ 100. For example, <cit.> use X-ray absorption lines in quasar spectra from gas within the Milky Way CGM and constrain  along numerous sightlines. Though we did not find a matching absorption sightline from their dataset within 3 degrees of our FRBs we acknowledge the possibility of large . Studies such as <cit.> and <cit.> involving low  sightlines (≲ 100) place tighter constraints (=28-111). In this context, we concede our assumption for  is probably low but has little impact on our qualitative findings. \nFurthermore, for Figure <ref>,\nwe assume a median host \ncontribution of = 186. \nA primary goal of this paper is to distinguish between\nthese two scenarios, i.e. the excess arising from the foreground or the FRB host, along individual sightlines.\n\nThe blue shading visualizes the expected probability density of  at each redshift, \n, with an assumed feedback parameter F=0.31 <cit.>. \nThe long, low-probability tail\nin  to high  values is due to\nmassive halos of galaxy clusters and groups, which occasionally intersect a sightline. One sees that a sizable fraction of the FRB sample lies\nabove the Macquart relation, and a subset have  values \nat or beyond the 80th percentile of the expected distribution at their redshifts. Naively, assuming that our ansatz for is correct, one would expect only 20% (i.e. ∼4) of the sightlines on average above the 80th percentile for the sample size shown in the figure. However, we find 11.\n\nThe FRBs with > may\narise from higher host contributions than the assumed average\n(i.e. >) \nor a larger than average foreground contribution to\n, or both. \nOf the 11 FRBs with this apparent excess in , \n6 have been targeted in the FLIMFLAM survey and have both shallow, wide-field (m_r<20 mag within 1.1 deg radius around the FRB) AAT/AAOmega  spectroscopy, plus deeper, narrow-field spectra (m_r<23 within ∼5 arcmin radius) using the Keck/LRIS and Keck/DEIMOS instruments. One field, FRB20190608A was previously studied by <cit.> using redshift data from SDSS and KCWI integral-field unit observations. In a separate paper, we will use a slightly different methodology to analyze the foreground contribution to the well-studied high-DM source FRB20190520B (Lee et al., in prep). In this work, we present the foreground analysis of the other four fields: , ,  and . \nAll of these have  near or beyond the \n80th percentile in  as listed in\nTable <ref>.\n\n\n    \n\n\n\n §.§ Spectroscopic target selection\n\n\nField galaxies within a radius of 1.1 degrees of the sightlines were targeted using the fiber-fed AAOmega spectrograph on the 3.9m Anglo-Australian Telescope (AAT) at Siding Spring, Australia. For two fields ( and ), the fiber configurations were designed to target sources with m_r<19.4 mag that were well-resolved in the Pan-STARRS imaging, i.e. distinct from point sources. For fields and , the target criterion is m_r<19.2 mag and m_r<19.8 mag respectively that were well-resolved in DECam imaging from archival DESI Legacy Imaging Surveys data <cit.>. Due to unfavorable weather conditions, we were unable to observe the full roster of fiber configurations generated for , and so this field has sparser wide-field coverage than intended. We therefore supplement our spectroscopic data on this field from the SDSS database. Each fiber configuration was observed for  ∼1 hr in the 1x1 binning mode with the 570 nm dichroic, which split the light into red and blue components. The red camera used the 385R grating blazed at 720nm while the blue camera used the 580V grating and the blaze is set to 485nm. The red and blue spectra were reduced, coadded and combined using the 2dFDR version 6.2 based on python 2.7 kindly provided by the OzDES group <cit.>. \nWe used the MARZ <cit.> software to determine redshifts, which cross-correlates the input spectra with a set of templates and determines the best redshift. This was followed by a visual inspection to confirm the redshifts, with adjustments as necessary.\nFigure <ref> shows the histogram of redshifts obtained from the AAT for the fields analyzed in this paper. The spectroscopic success rate of the survey, which is defined by the fraction of the number of targets with secure redshift and the total number of the targets that were observed, is around 90%.\n\nIn addition, the FRB fields were targeted with the Keck DEIMOS and LRIS spectrographs in the multi-object spectroscopy mode. \n \nWe used Pan-STARRS r-band imaging to select m_r<23 mag galaxies (i.e. as before, rejecting point sources) within ∼5 arcmin of the sightline. To further limit sources to z≲0.3, we rejected sources that satisfy these color criteria based on our analysis of mock galaxy photometry <cit.>:\n\n    g-r     >0 \n    \n            r-i     >0.7 \n    \n            i     >20.5\n\n\nWith LRIS, multi-object slitmask-based spectroscopy of the target galaxies was performed. Our configuration was as follows: 600/7500 grating for the red-side, 600/4000 grism for the blue side and the 560D dichroic. All raw frames were binned 2x2. The LRIS observations were obtained only for the fields of  and  during a previous run and not all objects in the field could be covered due to limited time. The galaxies that were omitted were subsequently targeted with DEIMOS. All LRIS/DEIMOS spectra were reduced with v1.2 of the PypeIt package <cit.> package. We set a detection threshold of 3σ above the noise floor for object identification and forced detection for fainter objects using the slitmask information stored in the metadata of the raw frames. Our DEIMOS observations were obtained on a later run with the 600ZD grating and GG455 order blocking filter and 1x1 binning. Each mask configuration was observed for ∼50 min. Together, 95% of the candidate galaxies within 5 arcmin of the FRB were targeted.\n\n\n\nWe ignored the serendipitous spectra, i.e. spectra of non-targeted sources captured in our slits, as they generally had no discernible features for redshift assignment. We did not flux-calibrate the spectra as this is not necessary for redshift estimation from line features.\n\nAs with the AAT spectra, all reduced spectra from Keck were processed via MARZ <cit.> to determine redshifts, followed by a visual inspection. \nAs with the AAT data, of the targeted Keck spectra, >90% had good redshift assignments.\n\nIn the case of , <cit.> have presented MUSE IFU pointing of 0.67 hours with the Wide Field Mode (WFM) covering the 1×1 area around the FRB sightline. Of the 61 galaxies extracted from the stacked white light image (i.e. the image averaged over the spectral dimension), 7 were identified to be foreground sources.\n\nThe reduced spectra with their assigned redshifts are made available as a specDB <cit.> file [Available at this https://drive.google.com/drive/folders/1gVVwTAmiHJtFB_GD56hgmDylXHYbOTFS?usp=sharingGoogle Drive link]. This is an HDF5 file with the convenience functions from the specDB package for easy retrieval of data.\n\n\n\n §.§ Photometric data\n\n\nTo estimate foreground galaxy properties such as stellar mass, we fit the publicly available flux measurements with a spectral energy distribution (SED) model. To this end, we used the grizy photometry from the Pan-STARRS <cit.> catalog, W1, W2, W3, and W4 from the WISE All-Sky source catalog <cit.> and supplemented with the YJHKs photometry from the Vista Hemisphere Survey (VHS) catalog <cit.> where available. The details regarding the SED fitting procedure are elucidated in the following section.\n\n\n\n\n§ DM HALO ANALYSIS\n \n\n\nIn this section, we describe the methodology\nimplemented to estimate the dispersion measure\ncontributed from the halo of a galaxy or\ngroup of galaxies, .  \nWe refer to the summed quantity\nalong a given sightline as .\n\n\n\n §.§ Individual Halos\n\n\nOnce spectroscopic redshifts were assigned, the available photometry was fit with an SED using CIGALE <cit.>. We assumed a delayed-exponential star-formation history with no burst population, a synthetic stellar population prescribed by <cit.>, the <cit.> initial mass function (IMF), dust attenuation models from <cit.>, and dust emission templates from <cit.>, where the AGN fraction was capped at 20%. This provided an estimate of the stellar mass, , of the \nforeground galaxy at a given redshift .\n\nWe then translate  to galactic halo mass, , using the mean stellar to halo mass relation (SHMR) described by <cit.> at that . Subsequently,  were estimated using the <cit.> modified NFW halo profile model. We assumed that the total amount of baryons in the halo trace the cosmic mean (Ω_b/Ω_m).\nWe assumed the halo gas extends to one virial radius \n() and that 75% of the baryons are in the hot, ionized phase in the halo. This assumes that 25% of the baryons in the galaxy is in condensed forms <cit.>. While this fraction\nmay vary with halo properties <cit.> or assumptions on galaxy feedback <cit.>, we emphasize that this is a relatively conservative maximal model for the\nCGM of galaxies, i.e. one may consider the DM estimates as upper limits.\nAdopting this CGM model, we then integrate the dispersion\nmeasure of the gas at the observed \nimpact parameter  of the galaxy from the \nsightline determined from its redshift  and \nthe angular offset.\n\nThe uncertainties in the  estimation and the SHMR relation propagate into the  estimate. For each galaxy, we assumed that the log distribution at a given redshift was Gaussian with the mean and standard deviations obtained from CIGALE. Accounting for the error in the SHMR is more involved as it depends on both  and galaxy redshift. The SHMR is described in Equation 2 of <cit.> with 8 parameters. We took the best fit parameters and uncertainties from their Table 1 as the mean and standard deviations of the independent normal distributions that these parameters were sampled from. We ignored any co-variance in these fit parameters. From the log distributions, 1000 samples are drawn and the SHMR parameter space is sampled 1000 times for each log realization. Thus, for every galaxy, we produce 10^6 log realizations, and subsequently,  estimates. The mean and variance from these individual distributions are used when drawing our conclusions for the sightlines. \n\n\n\n §.§ Galaxy group contributions\n\n\nIt is important to account for galaxy groups or clusters, since the overall halo mass is typically much larger than the sum of the putative member masses if estimated individually.\nThis results in DM contributions much\ngreater than that estimated for individual\ngroup members.\nTo search for galaxy groups within the FLIMFLAM spectroscopic catalog, we make use of an anisotropic friends-of-friends (FoF) group finder that has previously been applied to SDSS galaxy survey data (; but see also ,). \nThis finder assumes a transverse linking length, , which varies as a function of redshift, z, in the following way:\n\n\n    (z) = d_LL,0[1 + a  arctan(z/z_*)],\n\nwhere d_LL,0 is the linking length at the initial redshift, whereas\na and z_* are parameters governing the redshift evolution. \nThis redshift-dependent linking length allows one, in principle, to account for the \ndeclining completeness of the galaxies with increasing redshift in a flux-limited spectroscopic survey.\nThe line-of-sight linking length, , is then set as a fixed multiple of ; \nthe ratio / is another free parameter for the group finder. \nTo determine the appropriate values for these free parameters, \nwe ran the group finder on the FLIMFLAM catalogs and manually iterated the free parameters of the group finder, while\n visually inspecting the resulting groups from the FLIMFLAM catalog in both the transverse and line-of-sight\ndimensions at each iteration.  \nOur criteria was to ensure the selection is not so permissive as to include cosmic web filament structures as part of the identified groups, while simultaneously not being so stringent as to omit the more massive groups at the high-redshift end where the data is typically sparser. We arrived at the following values for the group-finding in this paper:\n=0.2, a=0.75, z_*=0.1, and /=10.  \n\nTo limit ourselves to reasonably robust groups, we select for a minimum richness of N_gal≥ 5. Furthermore, we apply the same modified NFW profile model; limited still to one virial radius but scaled up to the group mass estimated as our fiducial model. In addition to the coordinates and redshift of each group center, the code also provides a halo mass estimate by applying the virial theorem on the projected group radius and velocity dispersion[The group catalogs generated for our fields are available at this https://drive.google.com/drive/folders/1gVVwTAmiHJtFB_GD56hgmDylXHYbOTFS?usp=sharingGoogle Drive link.].\n\n\n\n §.§ Halo Contributions\n\n\n\nWhile our analysis can provide estimates of  for individual sightlines, it is useful to compare them against a mean cosmic contribution from halos for any random sightline up to . One may produce a theoretical estimate of this as follows:\n\nAdopting the halo mass function (HMF) (using the implementation of <cit.>) and restricting ourselves to <10^16, we can estimate the total number of halos of each mass bin expected to intersect within 1  of each sightline. Using our baryon distribution model described in section <ref>, this can be translated to the average  along the sightline, i.e. . \n\nThis average represents an upper limit as we are considering halos more massive than those of galaxies.  monotonically increases with the halo mass up to which the HMF is integrated over (see Figure <ref>) but plateaus near ≈ 10^15. \nThis presumably reflects the low average probability of intersecting such massive, but rare, halos.\nChanging the model parameters that influence  \nhave similar effect on . e.g. increasing the assumed fraction of ionized baryons in the halo scales up both  and  by the same factor.\n\n\n\n\n\n\n\n\n§ RESULTS\n\n\n\nThe analysis described above was applied to each galaxy in each field, resulting in probability distributions for the  contribution of  individual galaxies and groups. The  value is then the straight sum along each \nsightline. Our findings from the analysis for each sightline described above are presented in this section. \n\nFigure <ref> is a visual summary of the individual fields. It highlights stars, background objects and foreground objects ≲3 arcmin of the FRBs on the \nr-band image of the field from Pan-STARRS. The foreground objects are colored by the average  contribution estimated for each of them.\n\n\n\n\n\n\n\n\n\n §.§ \n\n\nExamining Figure <ref>, one\nnotes multiple galaxies in the foreground field\nof  including several within \n≈ 30”.  These galaxies lie primarily\nat two redshifts: z= 0.10 and 0.21 and have\nestimated halo masses that yield significant\n contributions.\nThe galaxy with the smallest impact parameter \n(J121554.90-130121.95)\nwas found in the VLT/MUSE datacube \nand has a redshift of 0.08 yielding a \nprojected perpendicular distance of \n= 11 kpc <cit.>. \nEven though its mass estimate indicates it is a dwarf galaxy (= 10^8.5), its close proximity to the sightline leads to a substantial  contribution of 25. \n\nThe wide-field data from Keck/DEIMOS and LRIS show 110 foreground galaxies, and of these 17 show non-zero  contributions. \nTable <ref> lists the foreground galaxies and their mean  contributions [The full galaxy catalogs with their halo masses and  estimates for our fields are available at this https://drive.google.com/drive/folders/1gVVwTAmiHJtFB_GD56hgmDylXHYbOTFS?usp=sharingGoogle Drive link.].  \n\nWe do not find any group contribution when applying our fiducial halo gas model, which truncates at the virial radius, to the groups identified in this field.\nIf, however, one extended the model\nto two virial radii we estimate one of the groups \nwould give a 50 contribution. \nThis group is centered at RA/Dec of (184.1382405, -13.0107427) and z=0.111. The FRB sightline is at a transverse distance of 1.16 Mpc. With 20 member galaxies and a halo mass of 10^13.9, this group may potentially contribute to . We do not include this contribution in our  estimate but discuss the implications of doing so in Section <ref>.\n\nFigure <ref>a presents the\ncumulative sum of  with redshift\nand shows a total value of\n200 ± 45.\nThis exceeds by over 100 \nthe average estimated  \nfor the FRB redshift using the \nmethodology described in Section <ref>.\nFor this FRB, we infer that its \n exceeds  \nowing to an excess of foreground structure.\nWe return to this conclusion in the following\nsection.\n\n\n\n\n §.§ \n\nWhile  has the least significant excess value of  in our sample, we estimate that  \nthe foreground galaxies in the field of  \ncontribute significantly to , similar to .\nSpecifically, we \nestimate = 65 ± 20 which \nis \ncomparable to  at =0.161 (Fig. <ref>b). \n\nWe do not find any group contribution to  for this sightline; the closest group lies at\n4.6 Mpc transverse distance with a mass of only 10^13. \nAt over ∼10 virial radii from the sightline, this group has no plausible\ninfluence on the observed .\n\n\n\n\n §.§ \n\n\nAlthough this field exhibits a large number of\nforeground galaxies within 10' of the FRB \nincluding nearly 20 within 5' of the sightline,   \nwe estimate their contributions  \nto be nearly negligible. \nMany of these galaxies also have high, estimated\nhalo masses but their individual contributions\nare generally ≲ 1\n(Table <ref>).\nThis results from the\nthe large physical impact parameters;\nonly one has < 200 kpc \nfrom the sightline.\n\nWe estimate no group contribution to  for \nthis field, with the closest group being 860 kpc away with a mass of 10^11.7 (z=0.04).\nThis comparatively low-mass halo was detected as a group only by virtue of its low redshift (and hence small distance modulus).\n\n\n\n §.§ \n\n\nFrom our sample of four FRBs with \n>, \n is the most extreme outlier with more than 380 in excess of the average value at the  = 0.2145. \nRemarkably, as is evident from Figure <ref>b, \nwe do not find any foreground halos in close\nproximity to the sightline.\nAs such, \nthe total  estimate is very \nsmall \n\n\n(Figure <ref>b). \nThe galaxy with the largest  estimate\n(1.6 ) is over 400 kpc away and has a halo mass of 10^12.8. \nGiven the uncertainties in halo masses,\n is even consistent with 0, \ni.e. no intersections within one virial\nradius of any foreground halo.\n\n\nNot surprisingly,\nwe also find no contribution from the galaxy groups identified in this field.\nThe closest group lies at a distance of 2 Mpc. \n\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\n\nIn the previous section we presented our analysis of the foreground matter distribution along four sightlines, with focus on . We now discuss the implications of these results. The primary motivation of this paper was to explore the origin of apparent excess in  along FRB sightlines.\nTo place our results in this context, we construct an\nempirical model  for the four sightlines\nbased on our findings.  Specifically, define\n\n\n    =  +\n\nwhere  is given by\n\n\n    =  -\n\nwith  calculated as described in \nSection <ref> and all quantities\nare evaluated at .\nIn future analyses the FLIMFLAM survey will\nestimate  for individual fields with\nthe cosmic web reconstruction algorithm ARGO <cit.>,\nwhich is a Bayesian estimator for the matter density field given the foreground galaxy halo masses and 3D locations (i.e. their sky position and redshifts). \n\nOur  estimate\nassumes \nthe uncertainty in  (Table <ref>)\nand a 20% statistical uncertainty in based on numerical simulations <cit.>\nWe also emphasize that the assumed CGM model used to \nestimate  impacts  and therefore\n through Equation <ref>.\nThis sensitivity to the CGM model (here a systematic error)\nlies central to correlating  against\ngalactic halos and large-scale structure to constrain\nproperties of halo gas and the baryonic content of the\nIGM <cit.>.\nIn the current analysis, however, the CGM model\nhas less impact for decreases in  will\nbe compensated by an increase in .\n\nFigure <ref> presents cumulative\nestimates for  with redshift \nfor each field.  These are compared with \n at  and our values\nfor  using Equation <ref>.\nAs one may have anticipated, for the two fields with large  values\n(, ) are consistent with\n (see also Table <ref>).\nFor these two FRBs, we have empirical confirmation\nof the theoretical paradigm for , i.e. that\nits intrinsic scatter tracks the incidence of\nforeground structure.  These results lend further\nconfidence for future analyses leveraging  \nto resolve the cosmic web. Compared to the previously studied sightlines of FRB20190608A <cit.> and FRB20180924B <cit.>,  is the first that shows a significantly large contribution from foreground halos. As mentioned previously, such sightlines are expected to be rare <cit.>.\n\nOn the other hand,  the  estimates for\n and  do not even meet the average\n for these sources, much less the apparent\nexcess implied by .  \nThe shortfalls are ≈ 200\nand ≈ 425 respectively.\nEven accounting for uncertainty in our  and\n estimates, one cannot account for these differences\nwithin the ∼ 1σ uncertainties.\nThis suggests the observed excess is due to a higher\nthan average  component; we estimate\nthe rest-frame  values to be\n≈ 422\nand ≈ 665 respectively. These sightlines are remarkably similar to the that reported by <cit.> for FRB20190520B, implying a relatively low  compared to \nfor these sightlines. Future detection of such sightlines might be key to unravel the likely progenitor scenarios and in investigating how  depends on host galaxy properties.\n\nWe may further assess the likelihood of this conclusion\nas follows.  Adopting a lognormal PDF for  \nwith the parameters estimated by \n<cit.>,\nthe fraction of FRBs with  values in \nexcess of these estimates are 18% and 9% \nrespectively. The large  values can be attributed to a combination of the local progenitor environment and the host ISM. \n\nOne may search for signatures of a high  value\nfrom detailed studies of the host galaxies.\n arises in a low-mass (dwarf) galaxy with a \nlow star-formation rate <cit.>.\nIt is offset from the galaxy center by ≈ 3 kpc\nwhich exceeds the half-light radius.\nIn these regards, there is nothing apparent in the host\nproperties nor its inferred halo that would suggest\nsuch a large  value. <cit.> propose a possible scenario involving the FRB progenitor being embedded in the outflows of a hyper-accreting black hole and note that long-term, short-cadence observations of the FRB polarization may constrain such a model should the FRB repeat.\n\n on the other hand arises from a high-mass, high-star-formation-rate galaxy and is coincident with the disk of the host <cit.>. This implies a fraction of the  arises from the host ISM. For example, <cit.> estimated for FRB20190608B ∼90 for the host ISM contribution from the local H-alpha line emission measure. While <cit.> report slightly lower star-formation rate for the host of  than FRB20190608B, one can visually discern a higher disk inclination for the former and speculate a comparable if not higher  \nfor the ISM component. A dedicated optical follow-up study of the host with an integral-field unit, especially if one can resolve ≲ 1  kpc around the FRB, can help place upper limits on the ISM contribution. For all the four FRB host galaxies, if we applied our galaxy halo gas model and computed  as analyzed above, we estimate a contribution of ≲35 each.\n\nAs mentioned previously, a full IGM reconstruction analysis is necessary for a complete understanding of the foreground matter density, e.g. as done for FRB20190608B <cit.>. While we have established two of our fields have ∼, it is possible that the IGM reconstruction may reveal > and therefore lay tighter constraints on . With ∼30 sightlines, the FLIMFLAM survey will perform such analysis and render, as a useful by-product, a posterior distribution for . This distribution can serve as a prior to future FRB-based IGM tomography work as well as to constrain FRB progenitor channels.\n\n\n\n§ CONCLUSION\n\nTo summarize, we analyzed the galaxies in the foreground\nof four localized FRBs, whose estimated cosmic dispersion measure\n significantly exceeds the average at .\nImplementing the methodology detailed in Section <ref>,\nwe estimated the DM contribution of foreground galactic and group halos, , as summarized in Table <ref>.\nFor two fields, we found a high incidence of halos\nat close impact parameters to the sightline, such that\nthe  estimate matches or exceeds the average cosmic\nexpectation value, .\nFor the other two fields, the  estimate\nis less than 5  owing to the absence\nof foreground halos near the sightline. Our results reinforce the paradigm that FRBs can effectively probe foreground matter overdensities. That being said, one must exercise caution in accounting for plasma in the host galaxy and immediate FRB progenitor environment when studying matter distribution\nalong the sightline. Combined with <cit.>\nwe conclude FRBs with apparent high  \narise from both higher than average foreground structure\nand inferred higher host contributions, with nearly\nequal probability.\n\nThus the FLIMFLAM survey is ramping up efforts towards data collection and analysis. Future results are expected to lay robust constraints on the parameters describing foreground matter distribution as well as constrain  statistically.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe thank Elmo Tempel for kindly providing his group-finding software, and Chris Lidman for assistance with the\nOzDES data reduction pipeline for AAOmega.\nAuthors S.S., J.X.P.,  and N.T., \nas members of the Fast and Fortunate for FRB\nFollow-up team, acknowledge support from \nNSF grants AST-1911140, AST-1910471\nand AST-2206490. N.T. and L.B. acknowledge support by FONDECYT grant 11191217.\nWe acknowledge generous financial support from Kavli IPMU that made\nFLIMFLAM possible.\nKavli IPMU is supported by World Premier International Research Center Initiative (WPI), MEXT, Japan.\nBased on data acquired at the Anglo-Australian Telescope, under programs A/2020B/04, A/2021A/13, and O/2021A/3001. We acknowledge the traditional custodians of the land on which the AAT stands, the Gamilaraay people, and pay our respects to elders past and present.\n\n\nMARZ <cit.>,\nHMFEmulator <cit.>,\nspecDB <cit.>,\nCIGALE <cit.>,\nAstropy <cit.>,\nNumpy <cit.>,\nScipy <cit.>,\nMatplotlib <cit.>.\n\n\nThe Python scripts used to perform our analysis are available in our FRB GitHub repository (https://github.com/FRBs/FRB). \n\n\n\n\n\n\n\naasjournal\n\n\n\n\n\n\n\n\n\n\n"}