{"entry_id": "http://arxiv.org/abs/2303.07074v1", "published": "20230313125231", "title": "On Lyapunov functions for open Hegselmann-Krause dynamics", "authors": ["Renato Vizuete", "Paolo Frasca", "Elena Panteley"], "primary_category": "eess.SY", "categories": ["eess.SY", "cs.SI", "cs.SY", "math.OC"], "text": "\nSpatial Attention and Syntax Rule Enhanced Tree Decoder for Offline Handwritten Mathematical Expression Recognition\n    Zihao Lin1 Jinrong Li2 Fan Yang1Shuangping Huang13Xu Yang4\n\nJianmin Lin2Ming Yang2\n\n    March 30, 2023\n===================================================================================================================\n\n\n\n\n\n\n\n               \nIn this paper, we provide a formulation of an open Hegselmann-Krause (HK) dynamics where agents can join and leave the system during the interactions. We consider a stochastic framework where the time instants corresponding to arrivals and departures are determined by homogeneous Poisson processes. Then, we provide a survey of Lyapunov functions based on global and local disagreement, whose asymptotic behavior can be used to measure the impact of arrivals and departures. After proving analytical results on these Lyapunov functions in the open system, we illustrate them through numerical simulations in two scenarios characterized by a different number of expected agents.\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nHegselmann-Krause (HK) model is one of the most important opinion dynamics characterized by bounded confidence interactions <cit.>. For a population of n agents indexed in a set ={ 1,…,n}, each agent i in the network holds a real-valued opinion x_i∈ and interacts with other agents only if the difference between their opinions remain inside the confidence interval of the agent, determined by a specific threshold:\n\n    ẋ_i(t)=∑_j:| x_i(t)-x_j(t)|<1 (x_j(t)-x_i(t)),   for all   i∈ .\n\nSince its original formulation, several extensions of this dynamics have been considered to reproduce additional characteristics of more realistic social interactions. For instance, multidimensional dynamics has been formulated in   <cit.>,  heterogeneous threshold were studied in <cit.> and noisy states have been considered in <cit.>. However, changes in the set of agents have not yet been incorporated in the study of the HK dynamics. \n\nIn many social interactions, the group of individuals does not remain constant since new agents may join the system and others leave. This happens specially in interactions taking place over online platforms (Facebook, Twitter, etc.) where agents can connect and disconnect in an easy manner. A similar behavior has been observed at the level of communications networks for the control of connected vehicles <cit.>. The importance of these phenomena has been highlighted in <cit.> as an important feature that must be taken into account in the analysis of dynamic social interactions. \n\nA multi-agent system characterized by a time-varying set of agents is called open multi-agent system (OMAS), where replacements, arrivals and departures can occur <cit.>. Depending on the type of system, different approaches may be used for its analysis, including time-invariant finite superset <cit.>, multi-mode multi-dimensional systems <cit.>, or continuum of agents <cit.>, etc. \n\n\nOne of the most important challenges in the study of OMAS is the definition of the graph topology during arrivals and departures of agents. In this sense, the HK model avoids any ambiguity since the network topology is automatically defined based on the states of the agents. However, even if the graph topology is well defined, it remains another important question: How to analyze OMAS when the size of the system can change? To the best of our knowledge, there are no results to handle this type of systems. Due to the time-varying dimension, trajectories cannot be well defined due to the lost of the information (departures) and new information coming into the system (arrivals). Several approaches based on the use of scalar functions independent of the dimension of the system have been considered for the analysis of OMAS <cit.>. For relatively simple systems, the choice of this scalar function is evident, as in the case of consensus where the variance is a good measure of disagreement. Nevertheless, the choice is not straightforward for more complex dynamics. For general dynamical systems, Lyapunov functions appear as a potential tool to be used in OMAS. The problem then becomes to measure the changes on properties of the Lyapunov functions due to the arrivals and departures. In the case of the HK dynamics, several Lyapunov functions have been used for the analysis of stability and some of them have completely different behaviors, such that it is possible that only few of them are suitable for the analysis in the open scenario.   \n\n\nPreliminary works in an open HK model have only studied the particular case of replacements where the opinion of agents change abruptly to mimic dynamic groups <cit.>. Since the problem is highly complex and asymptotic properties cannot be ensured for the trajectories, most of the previous works rely on simulations of order parameters associated with the dynamics to evaluate the performance under replacements. Regarding stability, the authors in <cit.> have considered the addition of new agents only as perturbations to analyze the stability of existing clusters (connected components). \n\nIn this paper, we present a formulation of an open HK dynamics where agents can join and leave the system according to homogeneous Poisson processes, such that the size of the system is time-varying. Based on the characteristics of the HK dynamics, we propose Lyapunov functions for the analysis of the open system, that are formulated as alternative versions of well-known Lyapunov functions for the closed system (no arrivals and departures). We perform an analysis of these functions focused on three important properties: asymptotic value, continuity in time, and monotonicity in time. Finally, relying on numerical simulations we discuss the advantages and drawbacks of the Lyapunov functions in closed and open scenarios.\n\n\n\n  \nOutline. In Section <ref> we define the relevant Lyapunov functions and discuss their properties, while distinguishing between functions that measure global or local disagreement. In Section <ref> we extend the discussion to Open HK dynamics, by simulations. The final Section <ref> comments on the opportunities for future research.\n\n\n\n\n§ LYAPUNOV FUNCTIONS IN CLOSED HK DYNAMICS\n\n\nThe differential equation (<ref>) usually has no differentiable solutions (classical solutions) since the right-hand side of the equation can be discontinuous when the interaction topology changes, which can prevent x from being differentiable. For this reason, we consider Carathéodory solutions of (<ref>), which correspond to solutions of the integral equation:\n\n    x_i(t)=x_i(t_0)+∫_t_0^t ∑_j:| x_i(τ)-x_j(τ)|<1 (x_j(τ)-x_i(τ))    dτ,\n\nfor all i∈. The set of equilibria of (<ref>) is known to be\n \n    F={x∈ℝ^n: for every  (i,j)∈×,\n      either x_i=x_j or | x_i-x_j|≥ 1}\n\n and the following convergence result is available.\n\n\nFor almost every initial condition, there exists a solution for (<ref>) that converges to a limit x^*∈ F.\n\n\n\nIn this work, we consider that all the initial states of the agents x_i(t_0) belong to an interval [a,b]: due to the characteristics of the HK dynamics, they will remain inside this interval during the evolution of the dynamics.\n\nDue to the existence of temporary clusters in the HK dynamics, we will analyze two types of Lyapunov functions based on disagreement of the states: we refer to global disagreement when the states of the agents are compared with all the other agents in the system independently of the clusters, and local disagreement when the state of the agents are compared only with the states of the agents in the current clusters. \n\n\n\n §.§ Global disagreement functions\n\n\nIn this subsection, we consider Lyapunov functions that measure the disagreement among all the agents in the system. A natural candidate to measure the global disagreement is the variance, defined as:\n\n    U_0(x):=1n∑_i=1^n (x_i-x̅)^2,\n\nwhere x̅=1/n∑_i=1^n x_i is the average value. This function has been used to prove stability of the equilibria set (<ref>) in <cit.>. \n\n\n\n\nSimilarly to the variance, we can also define the disagreement function between all the agents of the system through the function:\n\n    V_0(x):=1n^2∑_i,j=1^n(x_i-x_j)^2.\n\nAdditionally, we introduce another classical Lyapunov function, which has been used in  <cit.>:\n\n    T_0(x):=12n∑_i=1^n x_i^2=1/2nx^2,\n\nwhere · denotes the Euclidean norm.\nEven if it might not be apparent that T_0(x) measures disagreement, it is formulated in terms of global information of the system and, as the following simple result shows, its behavior is equivalent to the functions (<ref>) and (<ref>). \n\n\n\n\nFor the Lyapunov functions (<ref>), (<ref>) and (<ref>), we have:\n\n    V_0(x)=2U_0(x)=4T_0(x)-2x̅^2.\n\n\n\n First, we find an equivalence between the functions U_0(x) and T_0(x):\n\n    U_0(x)\n           =1n∑_i=1^n(x_i^2-2x_ix̅+x̅^2)\n       =1n(∑_i=1^nx_i^2-2x̅∑_i=1^n x_i+∑_i=1^nx̅^2)\n       =1n(∑_i=1^nx_i^2-2(nx̅)x̅+nx̅^2)\n       =2T_0(x)-x̅^2.\n\nNext, we find an equivalence between the functions V_0(x) and U_0(x):\n\n    V_0(x)\n           =1n^2∑_i,j=1^n(x_i^2-2x_ix_j+x_j^2)\n       =1n^2(n∑_i=1^nx_i^2-2(∑_i=1^n x_i)(∑_j=1^n x_j)+n∑_j=1^nx_j^2)\n       =1n^2(2n∑_i=1^n x_i^2-2n^2x̅^2)\n       =2U_0(x),\n\nwhich yields the desired result. \n\nThe non-increase in time of U_0(x(t)) and T_0(x(t)) have been proved in <cit.> and <cit.> respectively. \n\n\n\nIn addition to the previous functions, we also introduce the following Lyapunov function that has been proposed in <cit.> for a generalized model of the HK dynamics:\n\n    W_0(x):=1/n^2∑_i,j:x_i-x_j<1x_i-x_j^2+∑_i,j:x_i-x_j≥ 11.\n\nThis function is composed by two sums, where the first sum measures the disagreement among the agents that interact, and the second sum counts the agents that do not interact. The first term is thus a measure of “local” disagreement: as such, it will be studied in the next section (where it will be denoted as V). The second term, however, renders it dependent on  global information and thus a measure of global disagreement. Function W_0(x(t)) is continuous but, unlike the previous functions in this section, W_0(x(t)) is not differentiable along the trajectories of (<ref>). Further properties of W_0 can be deduce from the properties of V studied below.\n\n\n\n §.§ Local disagreement functions\n\n\nOne of the main drawbacks on the use of Lyapunov functions based on global disagreement is that even if the functions are non-increasing, their asymptotic values are not zero when the system presents several clusters[In this paper, we call clusters the connected components of the graph associated to the HK dynamics.]. We can see this behavior by analyzing the function U_0(x(t)) whose asymptotic value is given by:\n\n    lim_t→∞ U_0(x(t))=1n∑_i=1^K n_i(k_i-1n∑_j=1^K n_jk_j )^2,\n\nwhere K is the final number of clusters, k_i is the final value of the agents in cluster i and n_i is the number of agents in the cluster i. In fact, we can observe that lim_t→∞U_0(x(t))=0 only when K=1, which means consensus of all the agents of the system, a not so common situation in the HK dynamics. Clearly, from Proposition <ref>, we conclude that the other two functions V_0 and T_0, do not converge to zero. Similarly, if at the end, we have agents in different clusters, the sum ∑_i,j:x_i-x_j≥ 11≠ 0 in the function W_0(x(t)).\n\n\nIn the context of OMAS, we would like to have functions converging to zero at least for a closed dynamics, such that any deviation from the zero value is due only to the impact of arrivals and departures. For this reason, we bring forward potential Lyapunov functions based on local disagreement.\n\n\n\n  §.§.§ Function V(x)\n\nFirst, let us consider a variant of the function V_0(x) by restricting the disagreement function V_0(x) to the set D={i,j:| x_i-x_j|<1}. Then, we define the function:\n\n    V(x):=1/n^2∑_i,j:| x_i-x_j|<1(x_i-x_j)^2.\n\nClearly V(x)≥ 0 and it can be shown <cit.> that along the trajectories x(t) of (<ref>)\n\n    V(x(t))=-1/nddtU_0(x(t)).\n\nSince from Theorem 2 in <cit.>, every solution x(t) converges to a limit x^*∈ F, then the function V(x(t)) converges to 0.\n\nThe function V(x(t)) can also be intuitively expressed as \n\n    V(x(t))=1/nx(t)^TL_tx(t),\n\nwhere L_t is the Laplacian of the interaction graph at time t, and its k-th derivative (on its domain of definition) can be obtained to be \n    d^(k)/dt^(k)V(x(t))=(-2)^k/nx(t)^TL_ t^k+1x(t).\n\n \n\n\n\nWe now consider the monotonicity properties of V(x(t)).\n\nWith the exception of a countable set of times, V(x(t)) is non-increasing.\n\n\nBetween the times at which a topology change occurs, we have a constant number of clusters m≤ n. For each cluster we can define a function:\n\n    V_0_ℓ(x)=∑_j,k=1^c_ℓ (x_j-x_k)^2,  ℓ∈{1,…,m},\n\nwhere c_ℓ is the number of agents in cluster ℓ. Then, the function V(x(t)) can be expressed as:\n\n    V(x(t))=1/n^2∑_ℓ=1^m V_0_ℓ(x(t))\n\nSince all functions V_0_ℓ(x(t)) are non-increasing (being, up to constants, disagreement functions (<ref>) restricted to the cluster), the proof is completed. \n\n\n\nUnlike function V_0(x(t)), function V(x(t)) can be discontinuous and also not monotonic in time, because of the changes in the topology. Indeed, this function can increase during the evolution of the HK dynamics due to the switching topology, as the following example shows. \n\nLet us consider three agents x_1, x_2, x_3 such that x_1<x_2<x_3, | x_1-x_2|<1, | x_3-x_2|<1 and | x_1-x_3| >1. In this case, agent x_1 is interacting only with agent x_2, while agent x_2 is interacting also with agent x_3. Next, we analyze the event characterized by | x_3-x_1|=1 and we denote by V(x(t^-)) the value of the function V(x(t)) before this event. In this case, the function V(x(t^-)) is given by:\n\n    V(x(t^-))=(x_1-x_2)^2+(x_2-x_1)^2+(x_2-x_3)^2+(x_3-x_2)^2.\n\nHowever, after the event, when agent x_3 is inside the range of agent x_1 and all the three agents are interacting, the function V(x(t^+)) is:\n\n    V(x(t^+))   =(x_1-x_2)^2+(x_1-x_3)^2+(x_2-x_1)^2\n          +(x_2-x_3)^2+(x_3-x_1)^2+(x_3-x_2)^2\n       =V(x(t^-))+(x_1-x_3)^2+(x_3-x_1)^2\n       =V(x(t^-))+2.\n\n\nMore generally, we have that when two agents begin to interact, a new edge is added to the interaction graph, and when two agents stop interacting, an edge is removed from the interaction graph. Therefore, the changes of V(x(t)) during switching events can be expressed as:\n\n    V(x(t^+))=V(x(t^-))+2(e_a-e_r),\n\nwhere e_a and e_r are the number of edges added and removed respectively during the switching event.\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Function U(x)\n\nFollowing the approach in <cit.>, we consider the spectral decomposition of the Laplacian matrix:\n\n    L=VΛ V^T.\n\nThe matrix V can be decomposed in two parts as V=[V_0,V_-] where the n× m and n×(n-m) matrices V_0 and V_- respectively, are constructed from eigenvectors corresponding to zero and negative eigenvalues respectively. Let us define the error as:\n\n    e(x):=V_-V_-^Tx,\n\nand the function:\n\n    U(x):=1ne(x)^Te(x).\n\n\n\n\nThe function U(x) is such that\n\n    U(x)=1n∑_i=1^n (x_i-x̅_i)^2,\n\nwhere x̅_i is the average of the states of the agents in the cluster to which x_i belongs. \n\n\n\nBy definition:\n\n    U(x)=1/nV_-V_-^Tx^TV_-V_-^Tx\n    =1/nx^TV_-V_-^TV_-V_-^Tx.\n\nWe use the properties V_-V_-^T=I_n-V_0V_0^T and V_-^TV_-=I_n-m to obtain:\n\n    U(x)=1/nx^TV_-I_n-mV_-^Tx\n        =1/n∑_i=1^nx_i^2-x^TΓ x,\n\nwhere Γ is a block matrix given by:\n\n    Γ=[ Γ_1   0   ⋯   0;   0 Γ_2   ⋯   0;   ⋮   ⋮   ⋱   ⋮;   0   0   ⋯ Γ_m ],\n\nand each block is a matrix of ones multiplied by 1/m_i where m_i is the size of the block (cluster). Then, we have:\n\n    U(x)   =1/n∑_i=1^n x_i^2-∑_j=1^m m_jx̅_j^2\n       =1/n∑_i=1^n x_i^2+∑_j=1^m (m_jx̅_j^2-2m_jx̅_j^2)\n       =1/n∑_i=1^n x_i^2+∑_i=1^n x̅_i^2-2∑_j=1^m x̅_j(m_jx̅_j)\n       =1/n∑_i=1^n x_i^2+∑_i=1^n x̅_i^2-2 ∑_i=1^nx̅_i x_i.\n\n\nBased on this result, \nwe can observe that the function U(x) is a variant of the classical Lyapunov function U_0(x) in which the average value is computed only among the agents belonging to the clusters of the system. \n\n\nWhen t→∞, the graph will be partitioned into clusters whose nodes satisfy the condition | x_i(t)-x_j(t) |<1. Since Theorem 2 in <cit.> implies that the agents in each cluster of the graph will reach consensus, we have that the value of the mean x̅_i will coincide with the value of all the agents in the cluster such that:\n\n    lim_t→∞ U(x(t))=0.\n\n\nIn the next proposition we provide an additional proof of the convergence of U(x(t)) based on its monotonicity in time.\n\n\n\n\n\n\nThe function U(x(t)) along the trajectories x(t) of dynamics (<ref>) is non-increasing for all t and\n\n    lim_t→∞U(x(t))=0.\n\n\nBefore presenting the proof of Proposition <ref>, we introduce the following lemma.\n\nLet a_1, a_2,…,a_n; b_1,b_2,…,b_n be real numbers such that b_1,b_2,…,b_n>0. Then\n\n    a_1^2b_1+a_2^2b_2+⋯+a_n^2b_n≥(a_1+a_2+⋯+a_n)^2b_1+b_2+⋯+b_n,\n\nwith equality if and only if\n\n    a_1b_1=a_2b_2=⋯=a_nb_n.\n\n\n\nLet us consider the function U(x(t)) between two possible switching times of dynamics (<ref>). In this case, the function corresponds to the variance of each cluster of the graph, which is non-increasing. Now, we examine the behavior of the function during the switching times. If the clusters remain the same during a switching time, then we have:\n\n    U(x(t^+))=U(x(t^-)).\n\nFor dynamics (<ref>), the order between agent opinions is preserved and if at some time instant the distance between two consecutive agent opinions x_i and x_i+1 is larger than or equal to 1, it remains so forever <cit.>. This implies that two different clusters cannot merge.\n\nNext, we analyze the case when a cluster with m agents is partitioned into k clusters during a switching time. Then, before the switching event, we get:\n\n    U(x(t^-))=U^0+∑_i=1^m(x_i-1/m∑_j=1^m x_j)^2=U^0+∑_i=1^m x_i^2-1/m(∑_i=1^m x_i)^2,\n\nwhere U^0 corresponds to the clusters without modification. After the switching event, we obtain:\n\n    U(x(t^+))=U^0+\n        ∑_i=1^m x_i^2-(1/m_1(∑_i=1^m_1 x_i)^2+⋯+1/m-m_k-1(∑_i=m_k-1+1^m x_i)^2).\n\nThen, by using Lemma <ref>, it holds:\n\n    1/m(∑_i=1^m x_i)^2≤1/m_1(∑_i=1^m_1 x_i)^2+⋯+1/m-m_k-1(∑_i=m_k-1+1^m x_i)^2,\n\nsuch that:\n\n    U(x(t^-))≥ U(x(t^+)).\n\nSince clusters are independent, if more than one cluster is partitioned during the same switching time, the inequality (<ref>) is valid for each cluster and (<ref>) is the only possible behavior for U(x(t)) during switching times. \n\n\n\n\n\nAn alternative proof of the limit of U(x(t)) can be given by using its derivative between switching times, which is negative if x(t)∉ F and zero otherwise:\n\n    d/dtU(x(t))=-nV(x(t))=-1/n∑_i,j:| x_i-x_j|<1(x_i-x_j)^2.\n\n\n(Edges in a cluster)\nUnlike the function V(x(t)), the addition and removal of edges between agents in the same cluster do not modify the value of the function U(x(t)).\n\n\n\n\n\n §.§ Comparison between functions\n\nTo summarize the arguments above, we report in Table <ref> the characteristics of the functions introduced in this work. Since U_0, V_0 and T_0 are equivalent as per Proposition <ref>, we only present the characteristics of U_0. In the perspective of studying the Open HK dynamics, the ideal Lyapunov functions should have the properties of being continuous, non-increasing, and converging to zero. Inspecting the table highlights that no available function satisfy this combination of properties.\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ LYAPUNOV FUNCTIONS IN OPEN HK DYNAMICS\n\n\nIn the open system, the dynamics in continuous time of the agents is characterized by (<ref>), and the additional changes are due to arrivals and departures, that generate a time-varying set of agents (t).\n\nWe say that an agent j∈(t^-) leaves the system at time t if:\n\n    (t^+)=(t^-)∖{j},\n\nwhere (t^-) is the set of agents before the departure and (t^+) is the set of agents after the departure of agent j. Thus, (t^+)=(t^-)-1.\n\n\n\nWe say that an agent j [The label of agent j is different from the labels of all the agents that have interacted in the system from time t_0 until time t.] joins the system at time t if:\n\n    (t^+)=(t^-)∪{j},\n\nwhere (t^-) is the set of agents before the arrival and (t^+) is the set of agents after the arrival of agent j. Thus, (t^+)=(t^-)+1.\n\n\nIn this open system, the solution of each agent x_i satisfies \n\n    x_i(t)=x_i(t_a_i)+∫_t_a_i^t ∑_j∈(τ):| x_i(τ)-x_j(τ)|<1 (x_j(τ)-x_i(τ))    dτ,\n\nfor all t∈t_a_i,t_d_i, where t_a_i and t_d_i are the time instants of the arrival and departure, respectively, of agent i. If agent i was already present at time t_0, we consider t_a_i=t_0. If agent i never leaves the system, we consider that the solution (<ref>) is valid for all t≥ t_a_i.\n\n\n\nTo analyze this open system, we consider a stochastic setting where the time instants corresponding to arrivals and departures are determined by homogeneous Poisson processes. Following an approach similar to <cit.>, we make the following assumptions about the occurrence of departures and arrivals.\n\n[Departure process]\nThe departure instant of an agent j is determined by a homogeneous Poisson process N_t^(j) with rate λ_d>0 associated with the agent. Thus, all the departure instants in the system are determined by a Poisson process N_t^(D) with rate λ_D(t)=λ_dn(t) [The global Poisson process N_t^(D) associated with all the arrivals is not homogeneous since the rate λ_D is time-varying.].  \n\n\n\n\n[Arrival process]\nThe arrival instants are determined by a homogeneous Poisson process N_t^(A) with rate λ_A>0. \nDuring an arrival, an agent j joins the system with a state x_j determined by a random variable Θ, which takes values according to a continuous distribution with  support in the interval [a,b], with mean m and variance σ^2.    \n\n\n\nIn OMAS, the size of the systems is time-varying and even if several Lyapunov functions can be used to prove stability of the HK dynamics, some of them may not be adequate to evaluate the impact of arrivals and departures. It is obvious that in OMAS, the Lyapunov functions cannot be continuous since when an agent joins or leaves the network, the energy of the system is abruptly modified, generating a jump (discontinuity). \n\n\n\n §.§ Simulations of Open HK dynamics\n\nWe perform numerical simulations of an open HK dynamics to evaluate the behavior of the Lyapunov functions subject to arrivals and departures.\nWe consider a system composed by n_0=10 agents whose initial values are drawn from a uniform distribution 𝒰[0,6]. For the closed system, the number of agents is constant (i.e., n(t)=n_0 for all t) and we compute the expected values of the Lyapunov functions U_0(x(t)), U(x(t)) and V(x(t)) considering 10000 realizations of the process. Then, we perform the simulations of an open HK dynamics with λ_A=5 and two different values of λ_d. From the theory of birth-death processes, the asymptotic value of the expected number of agents is given by <cit.>:\n\n    lim_t→∞n(t)=λ_A/λ_d.\n\nIn the first scenario, we choose λ_d=0.4, which gives us lim_t→∞n(t)=12.5, such that asymptotically, the expected number of agents is greater than the initial number n_0. In the second scenario, we use λ_d=0.62, which corresponds to lim_t→∞n(t)=8.06, such that we expect a smaller average number of agents in the long run. The expectation of the Lyapunov functions are again computed over 10000 realizations of the process.\n\n\n\n\n\n\n\n\n\nFig. <ref> presents the trajectories of the states for one realization in the first scenario with λ_d=0.4, where we can observe the instants of arrivals and departures of agents corresponding to the appearance of new trajectories and disappearance of current trajectories respectively. For this particular realization, 19 new agents join the system and 20 departures take place, such that the number of agents at the end of the time interval considered for the simulation is 9. The initial number of clusters is 2 but new clusters appear and merge during the evolution of the dynamics, generating 3 clusters at the end. It is clear that arrivals and departures modify the number of clusters in time depending on the interval [a,b] considered for the assignment of the initial states of the interacting agents.\n\nIn Fig. <ref>, we present the simulations of U_0(x(t)), U(x(t)) and V(x(t)) in a closed and open scenario. In the left plots, we present the functions corresponding to the realization of the process in Fig. <ref>, that is with λ_d=0.4. In the case of U_0(x(t)), the discontinuities of the function are due only to arrivals and departures, while in the case of U(x(t)) and V(x(t)), the discontinuities are due to both the openness and the changes in the clusters due to the HK dynamics. \nIn the right plots, the solid blue line corresponds to the simulation of the expectation of the Lyapunov functions in the closed system, the dashed red line corresponds to the simulation of the open system with λ_d=0.4 and the dash-dotted yellow line corresponds to the simulation with λ_d=0.62. \n\nSeveral observations can be made from these simulations.\nMost importantly, the Lyapunov functions based on local disagreement, U(x(t)) and V(x(t)), have non-zero asymptotic values due to the arrivals and departures in the open scenarios, in contrast to the closed scenario.  Hence, the derivation of upper bounds on their asymptotic values can be useful to evaluate the impact of arrivals and departures. \n\nIn the case of U_0(x(t)), instead, such an upper bound would not provide useful information, because a positive value of the function may correspond to a closed or an open system. \nPerhaps surprisingly, the asymptotic value of the Lyapunov function based on global disagreement U_0(x(t)), can be lower for open systems. This behavior is due to the fact that the arrival of agents may help to join different clusters of agents, decreasing the value of the variance U_0(x(t)) in the system. This fact is remarkable since usually the metrics associated with a system (e.g., order parameters, Lyapunov functions, mean squared errors) that are used to evaluate its performance, exhibit a worse behavior for a time-varying set of agents (see for instance <cit.>).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSIONS AND FUTURE WORK\n\n\nIn this paper, we introduced the problem of the HK dynamics in open multi-agent systems where agents may join and leave the network during the interactions. We formulated the problem using a stochastic setting where the arrivals and departures of agents are determined by Poisson processes. We considered several Lyapunov functions, based either on global or local disagreement, as potential tools for the analysis of this system. Finally, we provided numerical simulations for two different scenarios to show the relevance of the Lyapunov functions based on local disagreement to measure the impact of arrivals and departures in the HK dynamics.\nThe simulations corroborate the fact that functions based on local disagreement are promising tools to study bounded-confidence opinion dynamics in open systems.\n\nThe natural continuation of this work is the full analysis of the open HK system and, in particular, studying the asymptotic value of the Lyapunov functions through the derivation of appropriate upper bounds, depending on the arrival and departure processes. A further extension would be to analyze the performance of a social HK model where interactions are also restricted by a graph topology <cit.>, extended to the case of open systems. \n\n\nIEEEtran\n            \n\n\n\n"}