{"entry_id": "http://arxiv.org/abs/2303.09280v2", "published": "20230313124432", "title": "Topology optimization with physics-informed neural networks: application to noninvasive detection of hidden geometries", "authors": ["Saviz Mowlavi", "Ken Kamrin"], "primary_category": "cs.CE", "categories": ["cs.CE", "cs.AI", "cs.LG"], "text": "\n\nAPS/123-QED\n\n\n\n\n mowlavi@merl.com\nDepartment of Mechanical Engineering, MIT, Cambridge, MA 02139, USA\nMitsubishi Electric Research Laboratories, Cambridge, MA 02139, USA\n\n kkamrin@mit.edu\nDepartment of Mechanical Engineering, MIT, Cambridge, MA 02139, USA\n\n\n\nDetecting hidden geometrical structures from surface measurements under electromagnetic, acoustic, or mechanical loading is the goal of noninvasive imaging techniques in medical and industrial applications. Solving the inverse problem can be challenging due to the unknown topology and geometry, the sparsity of the data, and the complexity of the physical laws.\n\nPhysics-informed neural networks (PINNs) have shown promise as a simple-yet-powerful tool for problem inversion, but they have yet to be applied to general problems with a priori unknown topology.  \n\nHere, we introduce a topology optimization framework based on PINNs that solves geometry detection problems without prior knowledge of the number or types of shapes. We allow for arbitrary solution topology by representing the geometry using a material density field that approaches binary values thanks to a novel eikonal regularization. \nWe validate our framework by detecting the number, locations, and shapes of hidden voids and inclusions in linear and nonlinear elastic bodies using measurements of outer surface displacement from a single mechanical loading experiment.\n\nOur methodology opens a pathway for PINNs to solve various engineering problems targeting geometry optimization.\n\n\nTopology optimization with physics-informed neural networks: \n application to noninvasive detection of hidden geometries\n    Ken Kamrin\n    March 30, 2023\n========================================================================================================================\n\n\n\n\n\n\nNoninvasive detection of hidden geometries is desirable in countless applications including medical imaging and diagnosis <cit.>, nondestructive evaluation of materials <cit.>, and mine detection <cit.>. The goal is to infer the locations, and shapes of structures hidden inside a matrix from surface measurements of the response to an applied load such as a magnetic field <cit.>, an electric current <cit.>, or a mechanical traction <cit.>. \nIdentifying these internal boundaries from the measured data constitutes a challenging inverse problem due to the unknown topology, the large number of parameters required to describe arbitrary geometries <cit.>, the potential sparsity of the data, and the complexity of the underlying physical laws which usually take the form of linear or nonlinear partial differential equations (PDEs) <cit.>.\n\nIn recent years, physics-informed neural networks (PINNs) have emerged as a robust tool for problem inversion across disciplines and over a range of model complexity <cit.>. PINNs' ability to seamlessly blend measurement data or design objectives with governing PDEs in nontrivial geometries has enabled practitioners to solve easily a range of inverse problems involving identification or design of unknown properties in fields ranging from mechanics to optics and medicine <cit.>. Encouraged by these early successes, we introduce in this paper a general topology optimization (TO) framework to solve noninvasive geometry detection problems using PINNs, leveraging both the measurements and the governing PDEs. Building on the strength of PINNs, our approach is straightforward to implement regardless of the complexity of the physical model, produces accurate results using measurement data from a single experiment, and does not require a training dataset. To the best of our knowledge, the present work marks the first time that PINNs have been applied to problems involving a priori unknown topology and geometry.\n\nClassical approaches to solve geometry identification inverse problems tend to be complex as they combine traditional numerical solvers such as the finite-element or boundary-element method, adjoint techniques to evaluate the sensitivity of the error residual with respect to the shape or the topology, and gradient descent-based optimization algorithms to update the geometry at every iteration <cit.>. \nFurthermore, these techniques call for carefully chosen regularization schemes and do not always yield satisfactory results, especially in the presence of sparse measurements acquired by only one or a few sets of experiments. For example, in the mechanical loading case where \n\nvoids and inclusions in an elastic body are to be identified from measurements of surface displacement in response to a prescribed traction, past studies limit themselves to simple shapes like squares and circles or fail to find the right number of shapes <cit.>.\nAttempts to apply PINNs to geometry detection are in their infancy, so far restricted to cases where the number and shape-type of hidden voids or inclusions in an elastic structure are provided in advance <cit.>.\n\n\n\n\n\n\n\nOur PINN-based TO framework does not require any prior knowledge on the number and types of shapes. We allow for arbitrary solution topology by representing the geometry using a material density field equal to 0 in one phase and 1 in the other. The material density is parameterized through a neural network, which needs to be regularized in order to push the material density towards 0 or 1 values. Thus, one key ingredient in our framework is a novel eikonal regularization, inspired from fast-marching level-set methods <cit.> and neural signed distance functions <cit.>, that promotes a constant thickness of the interface region where the material density transitions between 0 and 1, leading to well-defined boundaries throughout the domain. \nThis eikonal regularization enters as an additional term in the standard PINN loss, which is then used to train the neural networks underlying the material density and physical quantities to yield a solution to the geometry detection problem.\n\nAs an illustration, we apply our framework to cases involving an elastic body under mechanical loading, and discover the topology, locations, and shapes of hidden structures for a variety of geometries and materials.\n\n\n\n\n\n§ RESULTS\n \n\n\n\n §.§ Problem formulation\n\n\nWe consider noninvasive geometry detection problems of the following form. Suppose we have a continuous body ℬ containing an unknown number of hidden voids or inclusions, with unknown shapes and at unknown locations within the body. The material properties are assumed to be known and homogeneous within the body and the inclusions. We then apply a certain type of loading (e.g. mechanical, thermal, acoustic, etc) on the body's external boundary ∂ℬ^ext, which produces a response within the body that can be described by a set of n physical quantities (e.g. displacements, stresses, temperature, etc). These physical quantities can be lumped into a vector field ψ : ℬ→ℝ^n and satisfy a known set of governing PDEs.\n\n\n\n \n The goal of the inverse problem is to identify the number, locations, and shapes of the voids or inclusions based on measurements along ∂ℬ^ext of some of the physical quantities contained in ψ.\n\nAs a concrete example, we consider two prototypical plane-strain elasticity inverse problems.\n\n\n\nIn the first case, a square elastic matrix with hidden voids or inclusions is pulled by a uniform traction P_o on two sides (Fig. <ref>a). The goal of the inverse problem is to identify the number, locations, and shapes of the voids or inclusions using discrete measurements of the displacement of the outer boundary of the matrix. In the second case, an elastic layer on top of a hidden rigid substrate is compressed from the top by a uniform pressure P_o, with periodic lateral boundary conditions (Fig. <ref>b). The goal is to identify the shape of the substrate using discrete measurements of the displacement of the top surface. For both cases, the constitutive properties of all materials are assumed to be known. We will consider two different types of constitutive laws: compressible linear elasticity, which characterizes the small deformation of any compressible elastic material, and incompressible nonlinear hyperelasticity, which models the large deformation of rubber-like materials. In the linear elastic case, there exists a unique solution to the inverse problem (see proof in Supplementary Information), making it well-suited to evaluating the accuracy of our TO framework.\n\nFollowing density-based TO methods <cit.>, we avoid any restriction on the number and shapes of hidden structures by parameterizing the geometry of the elastic body ℬ through a discrete-valued material density function ρ : Ω→{0,1}, where Ω is a global domain comprising both ℬ and the hidden voids or inclusions. The material density is defined to be equal to 1 in the elastic body ℬ and 0 in the voids or inclusions. \nThe physical quantities ψ can then be extended to the global domain Ω by introducing an explicit ρ-dependence in their governing PDEs, leading to equations of the form \n\n\n    𝐫(ψ(𝐱),ρ(𝐱))    = 0,   𝐱∈Ω, \n    𝐛(ψ(𝐱))    = 0,   𝐱∈∂Ω,\n\n\nwith known boundary conditions defined solely on the external boundary ∂Ω = ∂ℬ^ext. Note that the residual functions 𝐫 and 𝐛 may contain partial derivatives of ψ and ρ. The inverse problem is now to find the distribution of material density ρ in Ω so that the corresponding solution for ψ matches surface measurements ψ_i^m at discrete locations 𝐱_i ∈∂Ω^m ⊂∂Ω, that is,\n\n    ψ(𝐱_i) = ψ_i^m,   𝐱_i ∈∂Ω^m.\n\nIn practice, we might only measure select quantities in ψ at some of the locations, but we do not write so explicitly to avoid overloading the notation.\n\nFor the linear elasticity problem that we consider as an example, ψ = (𝐮,σ) where 𝐮(𝐱) and σ(𝐱) are displacement and stress fields, respectively, and the governing equations comprise equilibrium relations ∑_j∂σ_ij/∂ x_j = 0 and a constitutive law F(σ, ∇𝐮, ρ) = 0, both defined over Ω. The presence of ρ in the constitutive law specifies different material behaviors for the elastic solid phase and the void or rigid inclusion phase. The applied boundary conditions take the form 𝐮 = 𝐮̅ on ∂Ω_u and σ𝐧 = 𝐭̅ on ∂Ω_t, where ∂Ω_u and ∂Ω_t are partitions of the external boundary with applied displacements and applied tractions, respectively, and 𝐧 is the outward unit normal. In the case of the elastic layer, the outer boundary also comprises a portion ∂Ω_p with periodic boundary conditions on the displacement and traction. Finally, the requirement that the predictions for 𝐮 at the surface match the measurement data is expressed as 𝐮(𝐱_i) = 𝐮_i^m, 𝐱_i ∈∂Ω^m. See Methods for a detailed formulation of the governing equations and boundary conditions for all considered cases.\n\nSimilar to density-based TO methods <cit.>, we relax the binary constraint on the material density by allowing intermediate values of ρ between 0 and 1. This renders the problem amenable to gradient-based optimization, which underpins the PINN-based TO framework that we introduce in the next section. However, the challenge is to find an appropriate regularization mechanism that drives the optimized material distribution towards 0 and 1 rather than intermediate values devoid of physical meaning. As we will show in the discussion, common strategies employed in TO <cit.> do not yield satisfactory results in our PINN-based framework for geometry detection problems. Thus, we have developed a novel eikonal regularization scheme inspired from level-set methods and signed distance functions, which we will describe after presenting the general framework.\n\n\n\n\n\n §.§ General framework\n\n\n\n\n\n\n\nWe propose a TO framework based on PINNs for solving noninvasive geometry detection problems (Fig. <ref>). \n\nAt the core of the framework are several deep neural networks that approximate the physical quantities ψ(𝐱) describing the problem and the material density ρ(𝐱). For the physical quantities, each neural network maps the spatial location 𝐱 = (x_1,x_2) to one of the variables in ψ = (ψ_1, ⋯, ψ_n); this can be expressed as ψ_i = ψ̅_i(𝐱; θ_i) where ψ̅_i is the map defined by the ith neural network and its trainable parameters θ_i (see Methods).\n\n\nFor the material distribution, we first define a neural network with trainable parameters θ_ϕ that maps 𝐱 to a scalar variable ϕ = ϕ̅(𝐱; θ_ϕ). A sigmoid function is then applied to ϕ to yield ρ = sigmoid(ϕ/δ) = sigmoid(ϕ̅(𝐱; θ_ϕ)/δ), which we simply write as ρ = ρ̅(𝐱,θ_ϕ). This construction ensures that the material density ρ remains between 0 and 1, and δ is a transition length scale that we will comment on later. We define the phase transition to occur at ρ = 0.5 so that the zero level-set of ϕ delineates the boundary between the two material phases, hence ϕ is hereafter referred to as a level-set function <cit.>.\n\n\nWe now seek the parameters θ_ψ = {θ_1, …, θ_n} and θ_ϕ so that the neural network approximations for ψ(𝐱) and ρ(𝐱) satisfy the governing equations (<ref>) and applied boundary conditions (<ref>) while matching the surface measurements (<ref>). This is achieved by constructing a loss function of the form\n\n    ℒ(θ_ψ, θ_ϕ)    = λ_measℒ_meas(θ_ψ) + λ_govℒ_gov(θ_ψ, θ_ϕ) \n          + λ_regℒ_eik(θ_ϕ),\n\nwhere ℒ_meas and ℒ_gov measure the degree to which the neural network approximations do not satisfy the measurements and governing equations, respectively, ℒ_eik is a crucial regularization term that drives ρ towards 0 or 1 values and that we will explain below, and the λ's are scalar weights. The measurement loss takes the form\n\n    ℒ_meas(θ_ψ) = 1/|∂Ω^m|∑_𝐱_i ∈∂Ω^m |ψ̅(𝐱_i;θ_ψ)-ψ_i^m|^2,\n\nwhere |∂Ω^m| denotes the size of the set ∂Ω^m. A trivial modification of this expression is necessary in the case where only select quantities in ψ are measured. The governing equations loss takes the form\n\n    ℒ_gov(θ_ψ, θ_ϕ) = 1/|Ω^d|∑_𝐱_i ∈Ω^d |𝐫(ψ̅(𝐱_i;θ_ψ),ρ̅(𝐱_i;θ_ϕ))|^2,\n\nwhere Ω^d is a set of collocation points in Ω, and we use automatic differentiation to calculate in a mesh-free fashion the spatial derivatives contained in 𝐫. We design the architecture of our neural networks in such a way that they inherently satisfy the boundary conditions (see Methods, section “Detailed PINNs formulation”).\n\n\n\n\n\n\n\n\nFinally, the optimal parameters θ_ψ^* and θ_ϕ^* that solve the problem can be obtained by training the neural networks to minimize the loss (<ref>) using stochastic gradient descent-based optimization. The corresponding physical quantities ψ̅(𝐱;θ_ψ^*) will match the discrete surface measurements while satisfying the governing equations of the problem, while the corresponding material density ρ̅(𝐱;θ_ϕ^*) will reveal the number, locations, and shapes of the hidden voids or inclusions.\n\n\n\n §.§ Material density regularization\n\n\n\nWe now describe the key ingredient that ensures the success of our framework. As mentioned above, the main challenge is to promote the material density ρ(𝐱) to converge towards 0 or 1 away from the material phase boundaries, given by the zero level-set ϕ = 0. Moreover, we desire the thickness of the transition region along these boundaries, where ρ goes from 0 to 1, to be uniform everywhere in order to ensure consistency of physical laws across the interface (e.g. stress jumps). \n\nTo visualize what happens in the absence of regularization, consider a random instance of the neural network ϕ = ϕ̅(𝐱,θ_ϕ) (Fig. <ref>a, left) and the corresponding material distribution ρ = sigmoid(ϕ/δ) with δ = 0.01 (Fig. <ref>a, center).\n\n\n\nThe sigmoid transformation ensures that ρ never drops below 0 or exceeds 1, leading to large regions corresponding to one phase or the other. However, the thickness of the transition region where ρ goes from 0 to 1 is not everywhere uniform, resulting in large zones where ρ assumes nonphysical values between 0 and 1 (Fig. <ref>a, center). This behavior stems from the non-uniformity of the gradient norm |∇ϕ| along the material boundaries ϕ = 0, with small and large values of |∇ϕ| leading to wide and narrow transition regions, respectively (Fig. <ref>a, right).\n\nWe propose to regularize the material density by forcing the gradient norm |∇ϕ| to be unity in a narrow band Ω_eik of width w along the material boundaries defined by the zero level-set ϕ = 0. In this way, ϕ becomes a signed distance function to the material boundary in the narrow band, thereby constraining the gradient of ρ to be constant along the interface. To ensure that the narrow band covers the near-entirety of the transition region where ρ goes from 0 to 1, we choose w = 10 δ so that ρ = sigmoid(± w/2δ) = sigmoid(± 5) ≃ 0 or 1 along the edge of the narrow band. To illustrate the effect of such regularization, we consider the previous random instance of the neural network ϕ = ϕ̅(𝐱,θ_ϕ) and enforce the constraint |∇ϕ| = 1 in the narrow band Ω_eik along its zero level-set (Fig. <ref>b, left and right). The zero level-set is kept fixed to facilitate comparison with the unregularized case (Fig. <ref>a). With ϕ now behaving like a signed-distance function in the narrow band, a uniform transition thickness for ρ along all material boundaries is achieved, without large regions of intermediate density values (Fig. <ref>b, center).\n\nIn practice, we implement this regularization into our PINN-based TO framework by including an `eikonal' loss term ℒ_eik in (<ref>), which takes the form\n\n    ℒ_eik(θ_ϕ) = 1/|Ω_eik^d|∑_𝐱_i ∈Ω_eik^d(| ∇ϕ (𝐱_i)| - 1 )^2,\n\nwhere Ω_eik^d = {𝐱_i ∈Ω^d : |ϕ(𝐱_i)| < w/2}. The aim of this term is to penalize deviations away from the constraint |∇ϕ| = 1 in the narrow band Ω_eik of width w along the interface defined by the zero level-set ϕ = 0. Because finding the subset of collocation points 𝐱_i in Ω^d belonging to the true narrow band of width w at every step of the training process would be too expensive, we instead relax the domain over which the constraint |∇ϕ| = 1 is active by utilizing the subset Ω_eik^d of collocation points that satisfy |ϕ(𝐱_i)| < w/2. As the constraint |∇ϕ| = 1 is progressively better satisfied during the training process, Ω_eik^d will eventually overlap the true narrow band of width w along the zero level-set of ϕ (Fig. <ref>c). \n\nSince the constraint |∇ϕ| = 1 in the narrow band takes the form of an eikonal equation, we call this approach eikonal regularization. We emphasize that in contrast to recent works training neural networks to solve the eikonal equation <cit.>, our eikonal regularization does not force ϕ to vanish on a predefined boundary. Rather, the zero level-set of ϕ evolves freely during the training process in such a way that the corresponding material distribution ρ = sigmoid(ϕ/δ) and physical quantities ψ minimize the total loss (<ref>), eventually revealing the material boundaries delineating the hidden voids or inclusions. \n\n\n\n §.§ Setup of numerical experiments\n\n\n\nWe evaluate our TO framework on a range of challenging test cases involving different numbers and shapes of hidden structures and various materials (Methods, Tabs. <ref> and <ref>). As a substitute for real experiments, we use the finite-element method (FEM) software Abaqus to compute the deformed shape of the boundary of the elastic structure and generate the measurement data for each case (Methods, section “FEM simulations”). Using this measurement data, we run our TO framework to discover the number, locations, and shapes of the hidden voids or rigid inclusions (for implementation and training details, see Methods, section “Architecture and training details”). We then compare the obtained results with the ground truth — the voids or inclusions originally fed into Abaqus — to assess the efficacy of our framework.\n\n\n\n §.§ Elastic matrix experiments\n\n\n\n\n\n\n\nWe first apply our framework to cases involving a linear elastic matrix  (Fig. <ref>a) containing voids (cases 1, 3, 8, 10, 15, 17 in Methods, Tab. <ref>). As the various loss components are minimized during training (Fig. <ref>a), the material density ρ evolves and splits in a way that progressively reveals the number, locations, and shapes of the hidden voids (Extended Data Fig. <ref> and https://www.dropbox.com/s/tm26buzgn0w35s1/Movie1.mp4?dl=0Supplementary Movie 1), without advance knowledge of their topology. By the end of the training, the transition regions where the material density goes from 0 to 1 have uniform thickness along all internal boundaries (Fig. <ref>d), thanks to the eikonal regularization that encourages the level-set gradient ∇ϕ to have unit norm in a band along the material boundaries ϕ = 0 (Fig. <ref>b,c). The agreement between the final inferred shapes and the ground truth is remarkable, with our framework able to recover intricate details such as the three lobes and the concave surfaces of the star-shaped void (Fig. <ref>d, second from left), or the exact aspect ratio and location of a thin slit (Fig. <ref>d, third from left). The stress and strain fields of the deformed matrix are also obtained as a byproduct of the solution process (Extended Data Fig. <ref>).\n\nThe only case that is not completely identified is the U-shaped void (Fig. <ref>d, first from right), a result of the miniscule influence of the inner lobe on the outer surface displacements due to its low level of strain and stress (Extended Data Fig. <ref>). Finally, our framework maintains accurate results when reducing the number of surface measurement points or restricting measurements to a few surfaces (Extended Data Figs. <ref>-<ref>).\n\nNext, we consider cases involving linear elastic and rigid inclusions in the linear elastic matrix (cases 4, 5, 6, 11, 12, 13 in Methods, Tab. <ref>). Our framework successfully identifies the inclusions in almost all cases (Fig. <ref>e). Inferred displacements and stresses of the deformed matrix (Extended Data Fig. <ref>) confirm the intuition that voids or soft inclusions soften the matrix while stiff or rigid inclusions harden the matrix. The U-shaped soft and stiff elastic inclusions (Fig. <ref>e, second and third from right) are better detected by the framework than their void or rigid counterparts (Fig. <ref>d, first from right and Fig. <ref>e, first from right), since an elastic inclusion induces some strain and stress on the inner lobe (Extended Data Fig. <ref>).\n\nFinally, we consider cases involving a soft, incompressible Neo-Hookean hyperelastic matrix with the same void shapes considered previously (cases 2, 7, 9, 14, 16, 18 in Methods, Tab. <ref>). \nThe geometries are identified equally well (Fig. <ref>f) in this large deformation regime (Extended Data Fig. <ref>) as with linear elastic materials, which illustrates the ability of the framework to cope with nonlinear governing equations without any added complexity in the formulation or the implementation.\n\n\n\n §.§ Elastic layer experiments\n\n\n\nWe finally apply our framework to the periodic elastic layer (Fig. <ref>b), where a linear elastic material covers a hidden rigid substrate (cases 20, 21, 22 in Methods, Tab. <ref>).\n\n\n\nContrary to the matrix problem, this setup only provides access to measurements on the top surface, and the hidden geometry to be discovered is not completely surrounded by the elastic material. Our TO framework is nevertheless able to detect the correct depths and shapes of the hidden substrates (Fig. <ref>). This example demonstrates the versatility of the framework in adapting to various problem setups.\n\n\n\n§ DISCUSSION\n\n\n\n\n\n\nAs with any TO method relying on a material density field to parameterize the geometry, the success of our PINN-based framework hinges on the presence of an appropriate regularization mechanism to penalize intermediate density values. Although we have shown that our novel eikonal regularization leads to consistently accurate results, other regularization approaches have been employed in classical adjoint-based TO methods <cit.>. These include the total variation dimishing (TVD) regularization <cit.> that penalizes the L_1 norm of the density gradient ∇ρ, the explicit penalization regularization <cit.> that penalizes the integral over the domain of ρ (1-ρ), and the Solid Isotropic Material with Penalization (SIMP) approach <cit.> that relates material properties such as the shear modulus and the material density through a power-law with exponent p. The latter is the most popular regularization mechanism in structural optimization <cit.>. However, when implemented in our PINN-based framework for the detection of hidden geometries, these methods yield inferior results to the eikonal regularization (Fig. <ref>). Indeed, we compare all four approaches on a challenging test case involving a linear elastic rectangular matrix pulled from the top and bottom and containing soft inclusions in the shape of the letters M, I, and T (case 19, Tab. <ref>). The measurements consist of the displacement along the outer boundary, similar to the previous square matrix examples. We consider different values of the regularization weight λ_reg (for the eikonal, TVD and explicit penalization regularizations) and the exponent p (for the SIMP regularization), and solve the inverse problem using four random initializations of the neural networks in each case. Not only was the eikonal regularization the only one to find the right shapes, it did so over three orders of magnitude of λ_reg, demonstrating a desirable robustness with respect to λ_reg (Fig. <ref>).\n\n\n\n\n\n\nThanks to the flexibility of the PINN framework, adapting our approach to various scenarios involving partial information, three-dimensional geometries, or other types of noninvasive imaging experiments (e.g. using thermal <cit.>, acoustic <cit.>, electric <cit.>, or magnetic <cit.> loading) should be straightforward. As an illustration, we identify a hidden inclusion in a nonlinearly conducting matrix using partially unknown thermal loading (Supplementary Information), mimicking an inaccessible surface. This experiment reveals our method's ability to generate good results without further modifications even when the forward problem is ill-posed, which would require including the unknown boundary condition as an additional optimization variable in a classical adjoint-based approach.\n\nIn conclusion, we have presented a PINN-based TO framework with a novel eikonal regularization, which we have applied to the noninvasive detection of hidden inclusions. By representing the geometry through a material density field combined with a novel eikonal regularization, our framework is able to discover the number, shapes and locations of hidden structures, without any prior knowledge required regarding the number or the types of shapes to expect.\n\nFinally, the idea of parameterizing geometries of arbitrary topologies with a material density field regularized with the eikonal constraint opens a pathway for PINNs to be applied to a wide range of design optimization problems constrained by physical governing equations. These include, for instance, the design of lenses that achieve targeted optical properties <cit.> or the design of structures and metamaterials that exhibit desirable mechanical, acoustic, or thermal properties <cit.>.\n\n\n\n\n\n§ METHODS\n\n\n\n\n §.§ Governing equations\n\n\n\nThe two plane-strain elasticity inverse problems considered in this study (Fig. <ref>) are defined in a two-dimensional domain Ω⊂ℝ^2 formed by the union of the elastic body ℬ and the voids or inclusions. Denoting with 𝐱 = (x_1,x_2) ∈Ω the planar spatial coordinates, the hidden geometrical layout of voids or inclusions is characterized by a material density ρ(𝐱) equal to 1 in the body ℬ and 0 in the voids or inclusions.\n\n\n\n  §.§.§ Small-deformation linear elasticity\n \n\n\nWe first consider the case where the elastic body and inclusions consist of linear elastic materials, with Young's modulus E and Poisson's ratio ν for the body, and Young's modulus E̅ and Poisson's ratio ν̅ for the inclusions. Voids and rigid inclusions correspond to the limits E̅→ 0 and E̅→∞, respectively. The deformation of the elastic body containing the inclusions is described by a vector field ψ(𝐱) = (𝐮(𝐱), σ(𝐱)), where 𝐮(𝐱) is a planar displacement field with components u_i(𝐱) and σ(𝐱) is a Cauchy stress tensor with components σ_ij(𝐱). Indices i and j will hereafter always range from 1 to 2. \n\nThe governing PDEs comprise the equilibrium equations\n\n    ∑_j∂σ_ij/∂ x_j = 0,   𝐱∈Ω,\n\nas well as a linear elastic constitutive law F(σ, ∇𝐮, ρ) = 0 that we will express in two different but equivalent ways, depending on whether the inclusions are softer or stiffer than the matrix. For voids and soft inclusions, we consider the constitutive law in stress-strain form,\n\n    σ   = ρ[ λ tr (ϵ)  𝐈 + 2 μ ϵ], \n          (1 - ρ) [ λ̅ tr (ϵ)  𝐈 + 2 μ̅ ϵ],   𝐱∈Ω,\n\nwhere ϵ = (∇𝐮 + ∇𝐮^T)/2 is the infinitesimal strain tensor, tr(ϵ) denotes its trace, λ = E ν/(1+ν)(1-2ν) and μ = E/2(1+ν) are the Lamé constants of the body, and λ̅ = E̅ν̅/(1+ν̅)(1-2ν̅) and μ̅ = E̅/2(1+ν̅) are the Lamé constants of the inclusions. Notice that the case of voids, the stress vanishes in the ρ = 0 regions. For stiff and rigid inclusions, \n\nwe consider the constitutive law in the inverted strain-stress form\n\n    ϵ   = ρ[ 1+ν/Eσ - ν(1+ν)/E tr (σ)  𝐈] \n          (1-ρ) [ 1+ν̅/E̅σ - ν̅(1+ν̅)/E̅ tr (σ)  𝐈],   𝐱∈Ω,\n\nwhere tr(σ) is the trace of the stress tensor. This relation differs from the three-dimensional one due to the plane strain assumption. Notice that the case of rigid inclusions, the strain vanishes in the ρ = 0 regions.\n\n\n\n\n\n\n\n\n\n\n\nThe boundary conditions on ∂Ω and surface displacement measurement locations ∂Ω^m are different in the two problems. For the elastic matrix (Fig. <ref>a), the domain is Ω = [-0.5,0.5] × [-0.5,0.5] and the boundary conditions are\n\n\nσ(𝐱) 𝐧(𝐱)    = -P_o 𝐞_1,         𝐱 ∈{-0.5,0.5} ×[-0.5,0.5], \n\nσ(𝐱) 𝐧(𝐱)    = 0,         𝐱 ∈[-0.5,0.5] ×{-0.5,0.5}.\n \n\nThe measurement locations ∂Ω^m are distributed along the entire external boundary ∂Ω. In the case of the M, I, T inclusions (case 19, Tab. <ref>), the boundary conditions (<ref>) are changed to account for the fact that the matrix is pulled from the top and bottom boundaries and covers the domain Ω = [-1,1] × [-0.5,0.5]. For the elastic layer (Fig. <ref>b), the domain is Ω = [0,1] × [-0.5,0] and the boundary conditions are\n\n\nσ(𝐱) 𝐧(𝐱)    = -P_o 𝐞_2,          𝐱 ∈[0,1] ×{0}, \n\n𝐮    = 0,        𝐱 ∈[0,1] ×{-0.5},\n \n\nas well as periodic for the displacement and traction on 𝐱∈{0,1}× [-0.5,0]. The measurement locations ∂Ω^m are distributed along the top surface ∂Ω_t = [0,1] ×{0}.\n\nThe geometry identification problem that we solve can then be stated as follows. Given surface displacement measurements 𝐮_i^m at locations 𝐱_i ∈∂Ω^m, find the distribution of material density ρ in Ω such that the difference between the predicted and measured surface displacements vanish, that is,\n\n    𝐮(𝐱_i) = 𝐮_i^m,   𝐱_i ∈∂Ω^m.\n\nThe predicted displacement field must satisfy the equilibrium equation (<ref>), the constitutive relation (<ref>) or (<ref>), and the boundary conditions (<ref>) or (<ref>).\n\n\n\n  §.§.§ Large-deformation nonlinear hyperelasticity\n \n\n\nNext, we consider the case where the elastic body consists of an incompressible Neo-Hookean hyperelastic material with shear modulus μ.\nWe now have to distinguish between the reference (undeformed) and current (deformed) configurations. \nWe denote by 𝐱 = (x_1,x_2) ∈Ω and 𝐲 = (y_1,y_2) ∈Ω^* the coordinates in the reference and deformed configurations, respectively, with Ω^* the deformed image of Ω. \nThe displacement field 𝐮(𝐱) with components u_i(𝐱) moves an initial position 𝐱∈Ω into its current location 𝐲 = 𝐱 + 𝐮(𝐱) ∈Ω^*. \nIn order to formulate the governing equations and boundary conditions in the reference configuration Ω, we need to introduce the first Piola-Kirchhoff stress tensor 𝐒(𝐱) with components S_ij(𝐱). Unlike the Cauchy stress tensor, the first Piola-Kirchhoff stress tensor is defined in Ω and is not symmetric. The deformation of the elastic body is then described by the vector field ψ(𝐱) = (𝐮(𝐱), 𝐒(𝐱),p(𝐱)) defined over Ω, where p(𝐱) is a pressure field that serves to enforce the incompressibility constraint.\n\nThe equilibrium equations are\n\n    ∑_j∂ S_ij/∂ x_j = 0,   𝐱∈Ω,\n\nwhere the derivatives in ∇_𝐱 are taken with respect to the reference coordinates 𝐱. We only consider the presence of voids so that the nonlinear constitutive law F(𝐒, ∇_𝐱𝐮, p, ρ) = 0 is simply expressed as\n\n    𝐒 = ρ[ -p 𝐅^-T + μ𝐅],   𝐱∈Ω,\n\nwhere 𝐅(𝐱) = 𝐈 + ∇_𝐱𝐮(𝐱) is the deformation gradient tensor. Notice that the stress vanishes in the ρ = 0 regions. Finally, we have the incompressibility constraint\n\n    ρ[ (𝐅) - 1 ] = 0,   𝐱∈Ω,\n\nwhich turns itself off in the ρ = 0 regions since voids do not deform in a way that preserves volume.\n\nWe only treat the matrix problem (Fig. <ref>a) in this hyperelastic case. The domain is Ω = [-0.5,0.5] × [-0.5,0.5] and the boundary conditions are\n\n\n𝐒(𝐱) 𝐧_0(𝐱)    = -P_o 𝐞_1,         𝐱 ∈{-0.5,0.5} ×[-0.5,0.5], \n\n𝐒(𝐱) 𝐧_0(𝐱)    = 0,         𝐱 ∈[-0.5,0.5] ×{-0.5,0.5}.\n \n\nAs in the linear elastic case, the measurement locations ∂Ω^m are distributed along the entire external boundary ∂Ω.\n\nThe geometry identification problem can then be stated identically as in the linear elastic case. This time, the predicted displacement field must satisfy the equilibrium equation (<ref>), the constitutive relation (<ref>), the incompressibility condition (<ref>), and the boundary conditions (<ref>).\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Rescaling\n \n\n\nThe various physical quantities involved in the elasticity inverse problem span a wide range of scales; for instance, displacements may be orders of magnitude smaller than the length scale associated with the geometry. Thus, we rescale all physical quantities into nondimensional values of order one, as also done in <cit.>. Lengths are rescaled with the width L of the elastic matrix or elastic layer, tractions and stresses with the magnitude P_o of the applied traction at the boundaries, and displacements with the ratio L P_o / E, where E is the Young's modulus of the elastic material (in the hyperelastic case, we use the equivalent Young's modulus E = 3 μ, where μ is the shear modulus of the hyperelastic material). This rescaling is critical to enable the neural networks underlying our framework to handle elasticity problems across a wide range of material moduli and applied loads.\n\n\n\n §.§ Solution methodology\n\n\n\nHere, we describe in detail the application of our TO framework to the solution of the two plane-strain elasticity inverse problems formulated in the introduction. We will treat separately the small-deformation linear elasticity case and the large-deformation hyperelasticity case.\n\n\n\n  §.§.§ Small-deformation linear elasticity\n\n\nSince the problem is described by the physical quantities ψ = (u_1,u_2,σ_11,σ_22,σ_12), we introduce the neural network approximations\n\n\n    u_1(𝐱)    = u̅_1(𝐱; θ_1), \n    \n    u_2(𝐱)    = u̅_2(𝐱; θ_2), \n    σ_11(𝐱)    = σ̅_11(𝐱; θ_3), \n    σ_22(𝐱)    = σ̅_22(𝐱; θ_4), \n    σ_12(𝐱)    = σ̅_12(𝐱; θ_5), \n    ϕ(𝐱)    = ϕ̅(𝐱; θ_ϕ).\n \n\nThe last equation represents the level-set neural network, which defines the material density as ρ(𝐱) = ρ̅(𝐱;θ_ϕ) = sigmoid(ϕ̅(𝐱;θ_ϕ)/δ). We then formulate the loss function (<ref>) by specializing the loss term expressions presented in results section to the linear elasticity problem. Omitting the θ's for notational simplicity, we obtain\n\n\n    ℒ_meas(θ_ψ)    = 1/|∂Ω^m|∑_𝐱_i ∈∂Ω^m  |𝐮̅(𝐱_i) - 𝐮_i^m|^2, \n    ℒ_gov(θ_ψ, θ_ϕ)    = 1/|Ω^d|∑_𝐱_i ∈Ω^d |𝐫_eq(σ̅(𝐱_i))|^2 \n          + 1/|Ω^d|∑_𝐱_i ∈Ω^d |𝐫_cr(𝐮̅(𝐱_i),σ̅(𝐱_i),ρ̅(𝐱_i))|^2, \n    ℒ_eik(θ_ϕ)    = 1/|Ω_eik^d|∑_𝐱_i ∈Ω_eik^d(| ∇ϕ̅ (𝐱_i)| - 1 )^2,\n\n\nwhere 𝐮̅ = (u̅_1,u̅_2) and σ̅ has components σ̅_i,j, i,j=1,2. In (<ref>), the terms 𝐫_eq and 𝐫_cr refer to the residuals of the equilibrium equation (<ref>) and the constitutive relation (<ref>) or (<ref>). The eikonal loss term is problem-independent and therefore identical to (<ref>). \n\nWe note that instead of defining neural network approximations for the displacements and the stresses, we could define neural network approximations solely for the displacements, that is, ψ = (u_1,u_2). In this case, the loss term (<ref>) would only include the residual of the equilibrium equation (<ref>), in which the stress components would be directly expressed in terms of the displacements and the material distribution using the constitutive relation (<ref>). However, several recent studies <cit.> have shown that the mixed formulation adopted in the present work results in superior accuracy and training performance, which could partly be explained by the fact that only first-order derivatives of the neural network outputs are involved since the displacements and stresses are only differentiated to first oder in (<ref>) and (<ref>). In our case, the mixed formulation holds the additional advantage that it enables us to treat stiff and rigid inclusions using the inverted constitutive relation (<ref>) instead of (<ref>). Finally, the mixed formulation allows us to directly integrate both displacement and traction boundary conditions into the output of the neural network approximations, as we describe in the next paragraph.\n\nWe design the architecture of the neural networks in such a way that they inherently satisfy the boundary conditions, treating the latter as hard constraints <cit.>. For the elastic matrix, we do this through the transformations\n\n\n    u̅_1(𝐱; θ_1)    = u̅_1'(𝐱; θ_1), \n    u̅_2(𝐱; θ_2)    = u̅_2'(𝐱; θ_2), \n    σ̅_11(𝐱; θ_3)    = (x-0.5)(x+0.5)  σ̅_11'(𝐱; θ_3) + P_o, \n    σ̅_22(𝐱; θ_4)    = (y-0.5)(y+0.5)  σ̅_22'(𝐱; θ_4), \n    σ̅_12(𝐱; θ_5)    = (x-0.5)(x+0.5) ·\n          (y-0.5)(y+0.5)  σ̅_12'(𝐱; θ_5), \n    ϕ̅(𝐱; θ_ϕ)    = (x-0.5)(x+0.5) ·\n          (y-0.5)(y+0.5)  ϕ̅'(𝐱; θ_ϕ) + w,\n\n\nwhere the quantities with a prime denote the raw output of the neural network. In this way, the neural network approximations defined in (<ref>) obey by construction the boundary conditions (<ref>). Further, since we know that the elastic material is present all along the outer surface ∂Ω, we define ϕ̅ so that ϕ = w on ∂Ω, which ensures that ρ = sigmoid(ϕ/δ) ≃ 1 on ∂Ω (recall that w is such that sigmoid(w/2δ) ≃ 1). In the case of the M, I, T inclusions, these transformations are changed to reflect the fact that the matrix is wider and pulled from the top and bottom. For the periodic elastic layer, we introduce the transformations\n\n\n    u̅_1(𝐱; θ_1)    = (y+0.5)  u̅_1'(cos x, sin x, y; θ_1), \n    u̅_2(𝐱; θ_2)    = (y+0.5)  u̅_2'(cos x, sin x, y; θ_2), \n    σ̅_11(𝐱; θ_3)    = σ̅_11'(cos x, sin x, y; θ_3), \n    σ̅_22(𝐱; θ_4)    = y  σ̅_22'(cos x, sin x, y; θ_4) - P_o, \n    σ̅_12(𝐱; θ_5)    = y  σ̅_12'(cos x, sin x, y; θ_5), \n    ϕ̅(𝐱; θ_ϕ)    = y(y+0.5)  ϕ̅'(cos x, sin x, y; θ_ϕ) \n          + w(4y+1),\n\n\nso that the neural network approximations defined in (<ref>) obey by construction the boundary conditions (<ref>) and are periodic along the x direction. Further, since we know that the elastic material is present all along the top surface y = 0 and the rigid substrate is present all along the bottom surface y = -0.5, we define ϕ̅ so that ϕ = w for y = 0 and ϕ = -w for y=-0.5, which ensures that ρ = sigmoid(ϕ/δ) ≃ 1 for y = 0 and ρ≃ 0 for y=-0.5.\n\n\n\n  §.§.§ Large-deformation hyperelasticity\n\n\nThe problem is now described by the physical quantities ψ = (u_1,u_2,S_11,S_22,S_12,S_21,p). We therefore introduce the neural network approximations\n\n\n    u_1(𝐱)    = u̅_1(𝐱; θ_1), \n    \n    u_2(𝐱)    = u̅_2(𝐱; θ_2), \n    \n    S_11(𝐱)    = S̅_11(𝐱; θ_3), \n    \n    S_22(𝐱)    = S̅_22(𝐱; θ_4), \n    \n    S_12(𝐱)    = S̅_12(𝐱; θ_5), \n    \n    S_21(𝐱)    = S̅_21(𝐱; θ_6), \n    \n    p(𝐱)    = p̅(𝐱; θ_7), \n    ϕ(𝐱)    = ϕ̅(𝐱; θ_ϕ),\n \n\nand the material distribution is given by ρ(𝐱) = ρ̅(𝐱;θ_ϕ) = sigmoid(ϕ̅(𝐱;θ_ϕ)/δ). We then formulate the loss function (<ref>) by specializing the loss term expressions presented in Section <ref> to the linear elasticity problem, using the governing equations given in Appendix <ref>. Omitting the θ's for notational simplicity, we obtain\n\n\n    ℒ_meas(θ_ψ)    = 1/|∂Ω^m|∑_𝐱_i ∈∂Ω^m  |𝐮̅(𝐱_i) - 𝐮_i^m|^2, \n    ℒ_gov(θ_ψ, θ_ϕ)    = 1/|Ω^d|∑_𝐱_i ∈Ω^d |𝐫_eq(𝐒̅(𝐱_i))|^2 \n         + 1/|Ω^d|∑_𝐱_i ∈Ω^d |𝐫_cr(𝐮̅(𝐱_i),𝐒̅(𝐱_i),p̅(𝐱_i),ρ̅(𝐱_i))|^2 \n         + 1/|Ω^d|∑_𝐱_i ∈Ω^d |𝐫_inc(𝐮̅(𝐱_i),ρ̅(𝐱_i))|^2, \n    ℒ_eik(θ_ϕ)    = 1/|Ω_eik^d|∑_𝐱_i ∈Ω_eik^d(| ∇ϕ̅ (𝐱_i)| - 1 )^2,\n\n\nwhere 𝐮̅ = (u̅_1,u̅_2) and 𝐒̅ has components S̅_i,j, i,j=1,2. In (<ref>), the terms 𝐫_eq, 𝐫_cr, and 𝐫_inc refer to the residuals of the equilibrium equation (<ref>), the constitutive relation (<ref>), and the incompressibility constraint (<ref>). The eikonal loss term is problem-independent and therefore identical to (<ref>). \n\nAs in the linear elasticity case, we design the architecture of the neural networks in such a way that they inherently satisfy the boundary conditions. For the elastic matrix problem,\n\n\n    u̅_1(𝐱; θ_1)    = u̅_1'(𝐱; θ_1), \n    u̅_2(𝐱; θ_2)    = u̅_2'(𝐱; θ_2), \n    S̅_11(𝐱; θ_3)    = (x-0.5)(x+0.5)  S̅_11'(𝐱; θ_3) + P_o, \n    S̅_22(𝐱; θ_4)    = (y-0.5)(y+0.5)  S̅_22'(𝐱; θ_4), \n    S̅_12(𝐱; θ_5)    = (y-0.5)(y+0.5)  S̅_12'(𝐱; θ_5), \n    S̅_21(𝐱; θ_6)    = (x-0.5)(x+0.5)  S̅_21'(𝐱; θ_6), \n    p̅(𝐱; θ_7)    = p̅'(𝐱; θ_7), \n    ϕ̅(𝐱; θ_ϕ)    = (x-0.5)(x+0.5) ·\n          (y-0.5)(y+0.5)  ϕ̅'(𝐱; θ_ϕ) + w,\n\n\nwhere the quantities with a prime denote the raw output of the neural network. In this way, the neural network approximations defined in (<ref>) obey by construction the boundary conditions of the problem. As before, since we know that the elastic material is present all along the outer surface ∂Ω, we define ϕ̅ so that ϕ = w on ∂Ω, which ensures that ρ = sigmoid(ϕ/δ) ≃ 1 on ∂Ω.\n\n\n\n §.§ Architecture and training details\n\n\n\nHere, we provide implementation details regarding the architecture of the deep neural networks, the training procedure and corresponding parameter values.\n\n\n\n  §.§.§ Neural network architecture\n\n\n\nState variable fields of the form ψ(𝐱) are approximated using deep fully-connected neural networks that map the location 𝐱 to the corresponding value of ψ at that location. This map can be expressed as ψ(𝐱) = ψ̅(𝐱;θ), and is defined by the sequence of operations\n\n\n    𝐳^0    = 𝐱, \n    𝐳^k    = σ(𝐖^k 𝐳^k-1 + 𝐛^k),    1 ≤ k ≤ℓ-1, \n    ψ = 𝐳^ℓ   = 𝐖^ℓ𝐳^ℓ-1 + 𝐛^ℓ.\n\n\nThe input 𝐱 is propagated through ℓ layers, all of which (except the last) take the form of a linear operation composed with a nonlinear transformation. Each layer outputs a vector 𝐳^k ∈ℝ^q_k, where q_k is the number of `neurons', and is defined by a weight matrix 𝐖^k ∈ℝ^q_k × q_k-1, a bias vector 𝐛^k ∈ℝ^q_k, and a nonlinear activation function σ(·). Finally, the output of the last layer is assigned to ψ. The weight matrices and bias vectors, which parametrize the map from 𝐱 to ψ, form a set of trainable parameters θ = {𝐖^k,𝐛^k}_k=1^ℓ.\n\nThe choice of the nonlinear activation function σ(·) and the initialization procedure for the trainable parameters θ are both important factors in determining the performance of neural networks. While the tanh function has been a popular candidate in the context of PINNs <cit.>, recent works by Refs. <cit.> have shown that using sinusoidal activation functions can lead to improved training performance by promoting the emergence of small-scale features. In this work, we select the sinusoidal representation network (SIREN) architecture from Ref. <cit.>, which combines the use of the sine as an activation function with a specific way to initialize the trainable parameters θ that ensures that the distribution of the input to each sine activation function remains unchanged over successive layers. Specifically, each component of  𝐖^k is uniformly distributed between - √(6/q_k) and √(6/q_k) where q_k is the number of neurons in layer k, and 𝐛^k = 0, for k=1, …, ℓ. Further, the first layer of the SIREN architecture is 𝐳^1 = σ(ω_0 𝐖^1 𝐳^0 + 𝐛^1) instead of (<ref>), with the extra scalar ω_0 promoting higher-frequency content in the output.\n\n\n\n  §.§.§ Training procedure\n\n\nWe construct the total loss function (<ref>) and train the neural networks in TensorFlow 2. The training is performed using ADAM, a first-order gradient-descent-based algorithm with adaptive step size <cit.>. In each case, we repeat the training over four random initializations of the neural networks parameters and report the best results. Three tricks resulted in noticeably improved training performance and consistency:\n\n\n  * First, we found that pretraining the level-set neural network ϕ(𝐱) = ϕ̅(𝐱; θ_ϕ) in a standard supervised setting leads to much more consistent results over different initializations of the neural networks. During this pretraining step, carried out before the main optimization step in which all neural networks are trained to minimize the loss (<ref>), we minimize the mean-square error \n\n    ℒ_sup(θ_ϕ) = 1/|Ω^d|∑_𝐱_i ∈Ω^d |ϕ̅(𝐱_i; θ_ϕ) - ϕ_i |,\n\nwhere Ω^d is the same set of collocation points as in (<ref>), the supervised labels ϕ_i = |𝐱_i| - 0.25 for the elastic matrix, and ϕ_i = y_i + 0.25 for the elastic layer. The material density ρ̅(𝐱;θ_ϕ) = sigmoid(ϕ̅(𝐱;θ_ϕ)/δ) obtained at the end of this pretraining step is one outside a circle of radius 0.25 centered at the origin for the elastic matrix, and it is one above the horizontal line y = -0.25 for the elastic layer. This choice for the supervised labels is justified by the fact that ρ is known to be one along the outer boundary of the domain Ω for the elastic matrix, and it is known to be one (zero) along the top (bottom) boundary of Ω for the elastic layer. \n\n  * Second, during the main optimization in which all neural networks are trained to minimize the loss (<ref>), we evaluate the loss component ℒ_gov in (<ref>) using a different subset, or mini-batch, of residual points from Ω^d at every iteration. Such a mini-batching approach has been reported to improve the convergence of the PINN training process <cit.>, corroborating our own observations. In our case, we choose to divide the set Ω^d into 10 different mini-batches of size |Ω^d|/10, which are then employed sequentially to evaluate ℒ_gov during each subsequent gradient update\n\n\n    θ_ψ^k+1   = θ_ψ^k - α_ψ(k) ∇_θ_ψℒ(θ_ψ^k, θ_ϕ^k), \n    θ_ϕ^k+1   = θ_ϕ^k - α_ϕ(k) ∇_θ_ϕℒ(θ_ψ^k, θ_ϕ^k).\n \n\nAn epoch of training, which is defined as one complete pass through the whole set Ω^d, therefore consists of 10 gradient updates.\n\n  * Third, the initial nominal step size α_ψ governing the learning rate of the physical quantities neural networks is set to be 10 times larger than its counterpart α_ϕ governing the learning rate of the level-set neural network. This results in a separation of time scales between the rate of change of the physical quantities neural networks and that of the level-set neural network, which is motivated by the idea that physical quantities should be given time to adapt to a given geometry before the geometry itself changes.\n \n\n\n\n  §.§.§ Parameter values\n\n\nThe parameter values described below apply to all results presented in this paper.\n\n\n\n  * Neural network architecture. For all cases except the M, I, T inclusions (case 19, Tab. <ref>), we opted for neural networks with 4 hidden layers of 50 neurons each, which we found to be a good compromise between expressivity and training time. For the M, I, T inclusions, we used 6 hidden layers with 100 neurons each. Further, we choose ω_0 = 10 as the scalar appearing in the first layer of the SIREN architecture.\n\n  * Collocation and measurements points. In the square and rectangle elastic matrix problems, we consider that the boundary displacement is measured along each of the four external boundaries at 100 equally-spaced points, which amounts to |∂Ω^m| = 400. In the elastic layer problem, we consider that the boundary displacement is measured along the top boundary at 100 equally-spaced points, which amounts to |∂Ω^m| = 100. For both geometries except the M, I, T inclusions, the set of collocation points Ω^d consists of 10000 points distributed in Ω with a Latin Hypercube Sampling (LHS) strategy, yielding 10 mini-batches containing 1000 points each. For the M, I, T inclusions, Ω^d consists of 50000 points, yielding 50 mini-batches containing 1000 points each.\n\n  * Training parameters. The pretraining of the level-set neural network is carried out using the ADAM optimizer with nominal step size 10^-3 over 800 training epochs, employing the whole set Ω^d to compute the gradient of ℒ_sup at each update step. The main optimization, during which all neural networks are trained to minimize the total loss (<ref>), is carried out using the ADAM optimizer. For the matrix cases except the M, I, T inclusions, we use a total of 150k training epochs starting from a nominal step size 10^-4 for the level-set neural network and 10^-3 for the other neural networks. This step size is reduced to 10^-4 for all neural networks at 60k epochs, and again to 10^-5 at 120k epochs. The schedule is the same for the elastic layer cases, with the difference that we use a total of 200k training epochs. For the matrix case with the M, I, T inclusions, we use a total of 50k epochs (note that each epoch contains 5 times as many mini-batches as in the other cases) starting from a nominal step size 10^-4 for the level-set neural network and 10^-3 for the other neural networks. This step size is reduced to 10^-4 for all neural networks at 16k epochs, and again to 10^-5 at 40k epochs. Finally, the scalar weights in the loss (<ref>) are assigned the values λ_meas = 10, λ_gov = 1, and λ_reg = 1 for all cases. We also multiply the second term of ℒ_gov in (<ref>) and (<ref>) with a scalar weight λ_cr = 10.\n\n\n\n\n §.§ FEM simulations\n\n\n\nThe FEM simulations that provide the boundary displacement data and the ground truth are performed in the software Abaqus, using its Standard (implicit) solver. The list of all cases considered in provided in Tab. <ref> for the elastic matrix setup (Fig. <ref>a) and in Tab. <ref> for the periodic elastic layer setup (Fig. <ref>b). Every case is meshed using a linear density of 200 elements per unit length along each boundary, corresponding to between 25k to 80k total elements depending on domain size as well as number and shapes of voids or inclusions. We employ bilinear quadrilateral CPE4 plain-strain elements for the cases involving a linear elastic material, and their hybrid constant-pressure counterpart CPE4H for the cases involving a hyperelastic material. We apply a load P_o/E = 0.01 for the cases involving a linear elastic material, and a load P_o/E = 0.173 for the cases involving a hyperelastic material.\n\n\n\n\n\nabbrvnat\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}