{"entry_id": "http://arxiv.org/abs/2303.07066v1", "published": "20230313124140", "title": "The magnetic sensitivity of the (250-278nm) Fe II polarization spectrum", "authors": ["David Afonso Delgado", "Tanausú del Pino Alemán", "Javier Trujillo Bueno"], "primary_category": "astro-ph.SR", "categories": ["astro-ph.SR"], "text": "\n\n\n\ndafonso@iac.es\n\n\n\nInstituto de Astrofísica de Canarias, E-38205 La Laguna, Tenerife, Spain\nDepartamento de Astrofísica, Universidad de La Laguna, E-38206, La Laguna, Tenerife, Spain\n\nInstituto de Astrofísica de Canarias, E-38205 La Laguna, Tenerife, Spain\nDepartamento de Astrofísica, Universidad de La Laguna, E-38206, La Laguna, Tenerife, Spain\n\nInstituto de Astrofísica de Canarias, E-38205 La Laguna, Tenerife, Spain\nDepartamento de Astrofísica, Universidad de La Laguna, E-38206, La Laguna, Tenerife, Spain\nConsejo Superior de Investigaciones Científicas, Spain\n\n\n\nThis paper presents a theoretical investigation on the polarization and magnetic \nsensitivity of the near-ultraviolet (near-UV) solar spectral lines of Fe2 between 250 and 278 nm. \nIn recent years, UV spectropolarimetry has become \nkey to uncover the magnetism of the upper layers of the solar chromosphere. \nThe unprecedented data obtained by the CLASP2 \nsuborbital space experiment across the Mg2 h and k lines around 280 nm\nare a clear example of the capabilities of near-UV spectropolarimetry for the magnetic field \ndiagnostics throughout the whole solar chromosphere.\nRecent works have pointed out the possible complementary \ndiagnostic potential of the many Fe2 lines in \nthe unexplored spectral region between 250 and 278 nm, \nbut no quantitative analysis of the polarization \nand magnetic sensitivity of those spectral lines has been carried out yet. \nTo study the polarization signals in these spectral lines, \nwe create a comprehensive atomic model including \nall the atomic transitions resulting in strong spectral lines.\nWe then study the magnetic sensitivity of the linear and circular polarization profiles \nin a semi-empirical model representative of the quiet sun.\nWe present a selection of Fe2 spectral lines \nwith significant linear and circular polarization signals and evaluate \ntheir diagnostic capabilities by studying their formation heights and magnetic \nsensitivity through the action of the Hanle and Zeeman effects.\nWe conclude that when combined with the\nCLASP2 spectral region these Fe2 lines are of interest for the inference of magnetic fields\nthroughout the solar chromosphere, up to near the base of the corona.\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n \n\nSpectral lines encode information about the physical conditions of the emitting plasma. \nTherefore, the study of their formation in given models of the solar atmosphere \nis very important for reaching the goal of inferring its physical properties \nfrom the observed spectral line radiation.    \nIn particular, the linear and circular polarization profiles carry \ninformation about the magnetic field strength and geometry in the their region of formation.\nEven though the solar spectrum is populated by plenty of spectral lines forming everywhere\nin the solar atmosphere, it is in the ultraviolet (UV) \nregion of the spectrum where we find abundant spectral lines forming in the solar chromosphere\nand transition region. Determining the magnetic field in these \nregions of the upper solar atmosphere is of fundamental importance for understanding how the energy \nis transported from the underlying layers and dissipated in the chromosphere and the corona, where \nthe explosive events that can impact the heliosphere take place.\nFor these reasons, ultraviolet spectropolarimetry is increasingly recognized as a \nkey diagnostic tool for facilitating new breakthroughs in our empirical understanding of solar and stellar \nmagnetic fields<cit.>.\n\nThe Interface Region Imaging Spectrograph <cit.> mission is one of the main\nexamples of the relevance of UV spectroscopy for investigating \nthe upper layers of the solar atmosphere. IRIS has been in operation since 2013\nmeasuring the intensity profiles\nin several windows of the UV solar spectrum, including spectral lines such as\nMg2 h and k (279.6 and 280.3 nm), C2 (133.4/133.5 nm), or Si4 (139.4/140.3 nm).\nThe research exploiting the data provided by the IRIS \nmission has significantly improved our knowledge about \nthe solar chromosphere <cit.>.\n\nConcerning UV spectropolarimetry, the most recent relevant advances \nare the Chromospheric Lyman-Alpha SpectroPolarimeter\n<cit.>, which in 2015 observed\nthe intensity \nand linear polarization of the H1 Ly α line <cit.>, and the \nChromospheric LAyer SpectroPolarimeter <cit.>, which\nin 2019 acquired unprecedented spectropolarimetric data of the 279.2 - 280.7 nm \nnear-UV spectral region that contains the\nMg2 h and k lines and several other lines of great diagnostic interest \n<cit.>. \nThese suborbital space missions were motivated by a series of  \ntheoretical investigations <cit.>, \nwhich predicted that the polarization \nsignals are measurable and magnetically sensitive and showed the importance of \nthe effects of\npartial frequency redistribution (PRD),\nJ-state interference, and the joint action of the Hanle, Zeeman, and magneto-optical effects\non the linear polarization signals produced by scattering processes. \nMoreover, the analysis of the circular polarization profiles \nmeasured by CLASP2 in the resonance lines of Mg2 and Mn1\nallowed for the first mapping\nof the longitudinal component of the magnetic field from the photosphere to \nthe upper chromosphere, just below the transition region <cit.>.\n\nDespite all these novel advances, there are still many unexplored regions in the UV spectrum\nof the Sun. The polarization signals of the near-UV Fe2 spectral lines \nthat are located blueward of the CLASP2 spectral region\nhave been proposed\nas potentially useful for facilitating the exploration of chromospheric magnetism <cit.>. \nIn particular, in the 250 - 278 nm spectral window we can find many \nlines belonging to this ion, including a\n strong resonant multiplet at 260 nm. Due to the lack of spectroscopic or spectropolarimetric \n solar observations in this spectral region, previous works found in\n the literature are mainly focused on the study of the intensity spectrum\n of these spectral lines in other stars <cit.>\n or of other Fe2 spectral lines located in observed spectral regions,\n such as the small Fe2 emission line in the red wing of the Ca2 line at 369.94 nm \n <cit.>. Moreover, as far as we know, there are not theoretical\n investigations about the polarization signals of these spectral lines or about their magnetic\n sensitivity.\n \nIn this work we present the first detailed theoretical study \non the polarization and magnetic sensitivity of the Fe2 \nlines that are located in the 250 - 278 nm near-UV spectral region,\nas well as their suitability to infer magnetic fields in the solar atmosphere. In Sec. <ref> we introduce the methods and tools used \nin our radiative transfer modeling. The atomic model used in the calculation is\ndescribed in Sec. <ref>. In Sec. <ref> we show the\nresults of our modeling, including a selection of the most interesting spectral lines, following certain criteria,\nas well as an analysis of their magnetic sensitivity and suitability to infer magnetic fields in\nthe solar atmosphere. Finally,\npresent our conclusions in Sec. <ref>.\n\n\n\n\n\n\n§ FORMULATION OF THE PROBLEM\n \n\nTo study the formation and magnetic sensitivity of the Fe2 lines in the spectral window between 250 and 278 nm\nwe solve the problem of generation and transfer of polarized radiation in optically-thick magnetized plasmas out of local thermodynamic equilibrium (NLTE).\nThis problem is both non-local and non-linear, requiring the simultaneous solution of the atomic \nexcitation (populations of the atomic substates and quantum coherence between them)\n described by the statistical equilibrium equations (SEE) and of the\nradiation propagation throughout the atmosphere governed by the radiative transfer (RT) equations.\nWe solve this problem by applying the HanleRT code <cit.> to a 1D plane-parallel model of the solar atmosphere.\nWe have chosen the semi-empirical C model of the quiet Sun described in <cit.>.\n\n\nEven though PRD effects and quantum interference can have an impact\non the linear scattering polarization profiles <cit.>, we neglect both for\nthe following reasons: first, these effects are particularly relevant in the far wings of these spectral lines\nand, as we discuss in more detail in Sec. <ref>, in the near-UV region of the solar\nspectrum the effect of spectral line blanketing is\nnotably strong, masking the impact of these effects and making the use of the line wings for atmospheric\ndiagnostic extremely difficult. Second, including these physical ingredients has a significant computational\ncost, especially when considering the size of the atomic \nmodel needed to study all the spectral lines considered\nin this work. For these reasons, the calculations \nshown in this paper assume complete frequency \nredistribution (CRD) and neglect quantum interference between the substates pertaining to different \natomic levels, which are often good approximations to model the spectral line core.\n\n\n\n\n\n\n\n\n§ ATOMIC MODEL\n \n\n\n\n\nAs far as we know, there are not previous studies on the formation of the Fe2\npolarization profiles in the spectral window between 250 and 278 nm\nand, therefore, on the atomic model necessary to reliably\nmodel the polarization of all these spectral lines.\nConsequently, the first step is to build a suitable atomic model including all the\natomic transitions that could produce (or impact) any interesting polarization signal\nin the spectral region of interest.\n\n\nIn the solar chromosphere the iron atoms are mostly singly ionized, and, consequently, Fe2 \nis the dominant ion <cit.>.\nOur atomic model thus includes just the Fe2 levels and the ground level of Fe3.\nWe take the atomic level energies and the Einstein coefficients for spontaneous emission from the\nNIST database <cit.>.\nWe approximate the photoionization cross sections as hydrogenic <cit.>. The\nrates of ionizing inelastic collisions with electrons are\ncalculated using the approximation\nof <cit.>.\nThe rate of excitation due to inelastic collisions with electrons are calculated following <cit.> \nfor pairs of levels fulfilling the electric dipole selection rules, and\nfollowing <cit.> for pairs of levels that do not fulfill those selection rules.\nThe rate of depolarizing collisions with neutral hydrogen atoms are calculated assuming\nthe Van der Waals potential <cit.>. We neglect inelastic collisions with\nhydrogen atoms.\n\nIn our atomic model we only include those transitions with a spontaneous emission probability above\na certain threshold (A_ul≥ 10^6 s^-1), which can produce a significant (in terms of its depths in the emergent spectrum) spectral line. Moreover,\nonce we have\nsolved the self-consistent RT problem with the whole atomic model we then remove one third of the levels, the least\npopulated ones, as well as those not radiatively connected with any other atomic level. Using the reduced atomic model results in relative differences of no more than 5% at the center of the emergent intensity profiles for the spectral lines in the 250 – 280 nm range.\n\nOur atomic model to study the formation and polarization of the Fe2 spectral lines\nbetween 250 and 278 nm\nhas 453 Fe2 atomic levels (and the ground level of Fe3)\nand\n2225 radiative transitions.\nThe model is thus complete enough to ensure a reliable calculation of the population balance of the levels involved in\nthe formation of any of the spectral lines in the range between 250 and 280 nm.\n\nIn Fig. <ref>\nwe show the Grotrian diagram for the\ndescribed atomic model, including all the radiative transitions.\nThe red line in the diagram indicates\nthe resonant multiplet that produces a series of intense spectral lines around 260 nm.\nA detailed Grotrian diagram of this multiplet is shown in the  inset at the top-left corner of Fig. <ref>.\nThe blue and green lines highlight some spectral lines analyzed in detail\nin Secs. <ref> and <ref>.\n\n\n\n\n\nThe rates of inelastic collisions are critical for the population balance of the Fe2 atomic\nlevels <cit.>. To build our atomic model we use very rough approximations to these rates, what\ncan have a significant effect on the emergent Stokes profiles. \nIn order to study how the inelastic collisions\naffect the emergent profiles, we create a reduced Fe2 atomic model with 90 levels (including\nthe Fe3 ground level) and 113 radiative transitions, which can correctly model\nthe emergent intensity profiles of the resonant multiplet around 260 nm; \nthat is, it is able to reproduce the same emergent intensity profiles for these strong resonant lines\n(Fig. <ref>).\nUsing the reduced model, we perform different \nnumerical experiments in which we multiply the inelastic collisional \nrates between pairs of atomic levels fulfilling (not fulfilling) \nthe electric dipole selection rules with a factor Ω_A (Ω_F).\n\n\n\n\nDue to the lack of solar spectroscopic observations, it is not possible to compare our calculations with the solar spectrum at these wavelengths.\nWe have thus opted for a comparison with the\nflux of a solar analog star, α Cen A, a\nvery close G2V star <cit.>, the same spectral type than the Sun.\nWe compare the intensity flux profile of α Cen A[ This spectrum is available in The Advanced Spectral Library Project (ASTRAL, <https://archive.stsci.edu/prepds/astral/>). For further details see <cit.>]  observed with the Space Telescope Imaging Spectrograph <cit.> on board of the Hubble Space Telescope (HST) with calculations in the FAL-C model for different values of Ω_A and Ω_F (Fig. <ref>).\nThe first evident difference between\nthe theoretical and observed fluxes is the significantly diminished continuum intensity in the observation, showing considerably wider lines. \nThe large amount of spectral lines in the UV spectrum, \ncontributing to the opacity, produce the so called UV blanketing, \nwhich consistently reduces the intensity flux across the spectral region,\ngiving the impression of a much lower continuum and of wider spectral lines.\nConsequently, we focus our analysis to the core and near wings of the Fe2 spectral lines.\n\nWith the inelastic collisions given by the above-mentioned approximations \n(Ω_A=Ω_F=1.0; \nblue curve) the flux in the line core is significantly larger than the observed flux, with significant\nemission features in the near wings which are absent in the observation.\nWe find the best agreement when all the inelastic collisional rates are reduced by a factor of ten\n(Ω_A=Ω_F=0.1; red curve); the intensity flux at the line cores becomes remarkably similar to the \nobserved flux and the near wing emission features completely vanish (see bottom row of Fig. <ref>).\nOur atomic model is thus able to adequately\nreproduce the intensity flux of the most intense Fe2 atomic lines in the near-UV\nspectrum of a solar-like star.\n\n\n\n\n\n§ RESULTS\n \n\nWe use the atomic model described in Sec. <ref> to\nmodel the Stokes profiles of the Fe2 atomic lines in the UV spectral\nwindow between 250 and 278 nm.\nIn particular, we study their linear and circular polarization\nprofiles and their capability to uncover the magnetic fields of the solar atmosphere.\nFor this purpose, we perform RT calculations\nincluding scattering polarization and the Hanle and Zeeman effects \nassuming CRD. We study the fractional linear polarization signals\nfor a line-of-sight (LOS) near the solar limb\n(μ=cosθ=0.1, with θ the heliocentric angle).\nWe then impose different magnetic fields to investigate the magnetic sensitivity of their\nlinear polarization.\nFinally, we study the formation of Zeeman-induced circular polarization signals\nfor the disk center LOS.\nWe then study the suitability of the weak-field approximation (WFA) to infer the longitudinal\ncomponent of the magnetic field (B_L) from the circular polarization.\n\n\n\n §.§ Linear Polarization Signals.\n \n\n\n\nFig. <ref> shows the fractional linear polarization Q/I profile in the unmagnetized FAL-C model atmosphere for the spectral region\nof the Fe2 resonant multiplet around 260 nm for the LOS at μ=0.1 (see blue curve in Fig. <ref>).\nWhile some of the strongest lines, in terms of their absorption features in the intensity profile,\nhardly show any significant linear polarization signal (see\nlines at 259.914, 261.265, or 261.840 nm)\nothers exhibit relatively large signals\nshown in detail in the\nbottom panels of Fig. <ref>.\nThe colored background in Fig. <ref> shows the logarithm of the normalized contribution function for Stokes Q,\nwhich gives a measure of how much each height layer in the model atmosphere contributes, at each\nwavelength, to the linear polarization of the emergent radiation. The red\nand blue colors indicate positive or negative contributions, respectively.\nWe can conclude, from the contribution function, that the linear polarization at the line core of the\nlines shown in the figure is formed between the middle and upper chromosphere (above ≈ 1 Mm in the FAL-C model).\n\nWe have selected the spectral lines \nwith zero-field scattering polarization signals Q/I>0.2 % at the line core, and we have  \nanalyzed their magnetic sensitivity in order to determine which ones are suitable \nfor the diagnostics of chromospheric magnetic fields.\nIn the left panel of Fig. <ref>\nwe show the height where the optical depth is unity at the line center (which gives an idea of the region \nof formation) for the selected lines, as well as their Hanle critical field (B_H), their line center zero-field Q/I signal, and information about the blends with neighbor lines. The Hanle critical field\nis the magnetic field strength for which the Zeeman splitting equals the natural width of\nthe line <cit.>:\n\n\n    B_H = 1.137·10^-7/t_ lifeg ,\n\nwith t_ life and g\nthe radiative lifetime and Landé factor of the line level under consideration, respectively. Typically, \na spectral line is sensitive, via the Hanle effect, to magnetic fields with strengths between\napproximately 0.2B_H and 5B_H.\n\nTo characterize the blends with other spectral lines we compare the theoretical and observed fluxes\nfrom Fig. <ref> with a synthetic profile including all the transitions from the Kurucz\ndatabase in LTE <cit.>, similarly to the approach of <cit.>.\nThrough visual inspection, we look for any spectral line close enough \nto the selected Fe2  line to \naffect their profiles, and we classify them in three categories: no nearby blends (circles in\nFig. <ref>), a moderate blend in the wings, far enough from the line core (squares), \nor a significant blend close to the line core (diamonds). Many of the selected lines show a nearby blend but,\nin these cases, the line core (line region sensitive to the Hanle effect) should not be affected\nsignificantly.\n\nMost of the spectral lines in our selection form in the middle chromosphere (around 1.25 Mm in the FAL-C semi-empirical model). A\nrelatively small number of lines form in the lower chromosphere and near the FAL-C \ntemperature minimum\n(around 0.5 Mm). Moreover, several stronger lines form in the upper chromosphere (above around 1.8 Mm).\nThese latter transitions belong to\na resonant multiplet (260.017 and 262.907 nm) and\nthe metastable multiplets a^4D - z^4P^∘ (258.336 and 259.231 nm), a^4D - z^4D^∘ \n(274.035 nm), and a^4D - z^4F^∘ (274.730, 275.013 and 275.658 nm).\n\n\n\n\nMost of\nthe lines in our selection have critical Hanle fields below 50 G\nand, for those lines forming in the upper\nchromosphere, we always\nfind B_H<30 G. Consequently,\nthese spectral lines are thus expected to be sensitive to magnetic fields with strengths\nconsiderably smaller than 100 G and,\nfor those lines forming in the upper chromosphere, to magnetic fields around 20 G or less.\nThese magnetic field strengths are of the order we expect for the chromospheric magnetic field in\nthe quiet Sun and, therefore, these spectral lines seem to be good candidates to study the quiet Sun\nmagnetism in the upper chromosphere.\n\nTo actually study the magnetic sensitivity of these spectral lines, we have selected\nfive specific cases, choosing lines forming in different layers of the solar atmosphere \nand with different Hanle\ncritical fields. Table <ref> summarizes the atomic data of the five chosen transitions, also\nhighlighted in blue in the Grotrian diagram of Fig. <ref>.\nIn the FAL-C model we impose a horizontal magnetic field \n(θ_ B=90^∘, ϕ_ B=0, with θ_ B\nand ϕ_ B the polar and azimuthal angles \nof the magnetic field vector with respect to the local vertical)\nwith different strengths, and we compare the calculated  \nQ/I profiles of the radiation emerging at the μ=0.1 \nLOS (see Fig. <ref>): 0 (black), 10 (blue), 20 (green) and 50 G (red).\n\nccccc\n\nWavelength, level configuration and energy, Einstein coefficient for spontaneous emission,\nand critical Hanle magnetic field of the upper level for the spectral lines studied in\ndetail in Sec. <ref>.\n\nλ [nm]     Transition     \nEnergies [cm^-1]     A_ul [10^8 s^-1]     B_H^u [G] \n\n260.609      b^2D_3/2 - x^2D^ o_3/2              36 126 - 74 498      2.00     ∼40 \n\n252.257      c^2G_7/2 - w^2G^ o_7/2              33 501 - 73 143      2.60     ∼57 \n\n258.336      a^4D_3/2 - z^4P^ o_3/2           8 680 - 47 389      0.88     ∼20 \n\n262.908      a^6D_1/2 - z^6D^ o_3/2          977 - 39 013      0.87     ∼16 \n\n275.655      a^4D_7/2 - z^4F^ o_9/2           7 955 - 44 232      2.20     ∼22 \n\n\n\nThe background color in Fig. <ref> shows the logarithm of the normalized contribution function as in Fig. <ref>,\nwhat confirms that the linear polarization in this selection of lines form at different heights\nranging from a few hundred kilometers above the temperature minimum (>0.5 Mm) and the upper\nchromosphere (⪆1.7 Mm).\nFor the two metastable transitions at 260.608 and 252.257 nm (first and second panels in\nFig. <ref>) most of the contribution is localized in a relatively extense region in the middle\nchromosphere of the model. These two transition have B_H=40 and 50 G, respectively and, consequently,\na magnetic field of just 10 G already induces a significant depolarization of the line core\nlinear polarization. A magnetic field of 50 G already reduces the fractional linear polarization\nby  more than a factor ten.\n\n\n\nContrarily to the rest of the selected transitions,\nthe spectral line at 258.336 nm shows a strong negative fractional linear polarization\nsignal (radial polarization; see third panel of Fig.<ref>)\nof about -0.8 %.\n This line forms in a extense region of the upper chromosphere of the model and it has B_H≈20 G.\nConsequently, a 10 G magnetic field already more than halved the amplitude of the linear polarization\nand it is dramatically depolarized by a 50 G magnetic field.\n\nFinally, regarding the spectral lines\nat 262.908 and 275.655 nm, their line core linear polarization forms in a narrow area in the top of the FAL-C model's\nchromosphere (between 1.9 and 2.2 Mm and between 2.0 and 2.2 Mm, respectively).\nTheir critical Hanle fields are also relatively small (16 and 22 G, respectively), as evident\nfrom the strong depolarization induced by a magnetic field of 20 G (see fourth and fifth panels of\nFig. <ref>). Nevertheless, these lines are sensitive to magnetic fields with strengths of a few\ngauss, of the order of the typical magnetic field strengths expected in the upper chromosphere of\nthe quiet Sun. Moreover,\nnote that the chosen magnetic field geometry, namely horizontal with respect to the local vertical, \nis such that it maximizes the depolarization of the fractional linear polarization Q/I profiles.\n\n\n\n\n\n\n §.§ Circular Polarization Signals.\n \n\nWe now study the circular polarization profiles of the Fe2 UV lines and their\nsuitability to infer the longitudinal component of the magnetic field via the WFA.\n\nFor this purpose, we\ncalculate the fractional circular polarization profiles V/I\nfor a LOS at the disk center (μ=1), imposing in the FAL-C \nmodel a uniform vertical magnetic field of 50 G.\nWe show in the right panel of Fig. <ref> those lines with a circular polarization amplitude \nabove 0.5%, with the color of the marker indicating such amplitude and its size indicating the effective\nLandé factor (g_ eff) calculated assuming L-S coupling.\nAlthough the lobes of the circular polarization profiles typically sample the atmosphere at\nregions significantly below those sampled by the line cores, \nwe will use the height at which the line-center optical depth is unity to \nindicate the approximate height at which these profiles are formed.\n\nA total of 103 spectral lines show circular polarization signals\nlarger than 0.5 %. Most of these lines\nform between the upper photosphere and lower chromosphere.\nA considerable amount of Fe2 lines \nin the selection form in the middle and upper chromosphere, e.g.,\nthe transitions of the resonant multiplet a^6D - z^6D^∘.\n\n\n\n\nGiven the computational demands for solving the full NLTE RT problem, it is ideal to have\ninference methods that allow for a quick determination of the magnetic field without the need of\ncarrying out the NLTE modeling of the observations.\nThe WFA, if suitable, allows for the very quick determination of the longitudinal component\nof the magnetic field <cit.>.\nFor this approximation to be suitable, the line's Doppler width\n(Δλ_D) must be much larger than the magnetic Zeeman splitting between the atomic\nmagnetic sublevels (Δλ_B),\n\n\n    g_ effΔλ_B/Δλ_D << 1,\n\nwhere Δλ_B = 4.6686·10^-13Bλ_0^2 (with B in Gauss and λ_0 in Å) and Δλ_D = λ_0/c√(2kT/m + v_m^2) (with T and v_m\nthe temperature and turbulent velocity in the formation region of the line, with c the speed of light, \nk the Boltzmann constant, and m the mass of the atom). \nIn this way, we can roughly expect the WFA to be valid when the magnetic field strength is below the value \nwhich makes g_ effΔλ_B/Δλ_D = 0.1.\nFig. <ref> shows the maximum magnetic field strength for which this condition is fulfilled.\nThe included lines are those selected in the right panel of Fig. <ref>. \n\nFor those spectral lines whose line core forms between the middle and upper chromosphere \nthe WFA is valid, through the chosen criteria, for any magnetic field strength below\n500 G (except for the one spectral line at 262.245 nm). We can thus be confident that the WFA necessary condition is met both in quiet sun regions and in the weaker manifestations of active regions, such as plages.\n\nFor spectral lines originating between the upper photosphere and lower chromosphere we can distinguish two cases: spectral lines in which the WFA applicability condition is met for B_L<=200 G, and thus only applicable in quiet Sun regions, and spectral lines for which the applicability condition is B_L<=600 G, and thus it can also be applied in relatively weak active regions such as plages.\n\nccccc \n\nWavelength, level configuration  and energy, Einstein coefficient for spontaneous emission,\nand effective Landé factor for the spectral lines studied in detail in Sec. <ref>\n\n\nλ [nm]     Transition     Energies [cm^-1]     A_ul [10^7 s^-1]     g_ eff \n\n259.608             b^4F_9/2 - z^4H^ o_4            22 637 - 61 156      0.12     2.5 \n\n262.148      b^4F_4   - z^4G^ o_4            22 810 - 60 956      3.40     1.1 \n\n262.119      a^6D_3/2 - z^6D^ o_3/2      862 - 39 013      0.43     1.9 \n\n262.908      a^6D_1/2 - z^6D^ o_3/2      977 - 39 013      8.70     1.5 \n\n\n\nTo study in detail the actual applicability of the WFA to infer the longitudinal magnetic field, we select four\nspectral lines, relatively close in wavelength, and infer the magnetic field from a theoretical circular polarization profile\ncalculated in the FAL-C model imposing a certain magnetic field stratification.\nTable <ref> summarizes the atomic data of the four chosen transitions, also\nhighlighted in green in the Grotrian diagram\nof Fig. <ref>.\nAmong these spectral lines we \nfind two resonant transitions (262.119 and  262.908 nm) and two \ntransitions with metastable lower levels in the b^4F term (259.608 and 262.148 nm).\n\nThe dotted curves in the first and second column in Fig. <ref> show the fractional circular\npolarization profile of the radiation emerging from the FAL-C \nmodel in which we have added a longitudinal magnetic field\ndecreasing exponentially with height, from 200 G at the base of the photosphere to 40 G\nat the top of the chromosphere.\nThe colored background in the same panels show \nthe logarithm of the normalized contribution function for Stokes V, which gives\nan idea of the regions in the model atmosphere which contribute \nthe most to the emergent circular polarization profile\nat each wavelength.\nThe main contribution to the circular polarization of the spectral line at 259.608 nm comes from the\nphotosphere, below the temperature minimum. \nThe line at 262.147 nm forms at slightly larger heights, with significant contribution from the regions\njust above the temperature minimum.\nFinally, the contribution function of the \nresonance lines at 262.119 and 262.908 nm have their \npeak in the upper layers of the chromosphere, mainly \naround 1 Mm for the former, and even higher for the latter.\nThe colored curves show the WFA fit to the theoretical circular polarization profiles.\nBecause the contribution function of the 259.608 and 262.148 nm lines is more or less concentrated\nand coherent in sign at every wavelength, it is possible to find a good fit to the whole spectral range.\nThe profiles are fitted with a magnetic field of 178 and 150 G, respectively. In the model atmosphere,\nthese fields are found\nat heights ∼0.2 and ∼0.4 Mm, which correspond to\napproximately the middle of the region in the model with significant contribution function values (see colored\nbackground in the corresponding panels).\nFor the resonant lines at 262.119 and 262.908 nm, the contribution function is significantly more\nextended and it changes sign with height at some wavelengths. For this reason, it is not possible to find\na unique satisfactory fit to the whole spectral range (different regions of the profile are being affected\nby different magnetic fields, because they do not form \nin the same atmospheric region). We can fit the central\npart of the profiles with a magnetic field of 93 and 68 G for the two lines, respectively. These magnetic\nfields are found in the model atmosphere at heights ∼1 and ∼1.4 Mm, respectively, which also\ncorrespond to approximately those heights showing the largest value in the contribution function at the\nfitted wavelengths (see colored background in the corresponding panels). The WFA thus seem suitable for\nthe quick inference of the longitudinal magnetic field at different layers of the solar atmosphere by\ncombining the diagnostic of multiple Fe2 with different formation regions.\n\n\n\n\n\n\n\n\n§ SUMMARY AND CONCLUSIONS\n \n\nWe have theoretically investigated the formation of the intensity and polarization of the    \nFe2 spectral lines in the relatively unexplored 250 - 278 nm window of the near-UV solar spectrum.\nWe identified those lines for which we predict significant linear or\ncircular polarization signals and investigated their magnetic sensitivity, as well as their suitability\nto infer the magnetic field in the solar atmosphere.\n\nBy means of NLTE RT calculations in a semi-empirical model \nof the solar atmosphere, we have obtained the \nStokes profiles of the emergent spectral line radiation. To this end, we built\na model atom with all possible transitions of interest in the above mentioned spectral region. Due to the\nlack of solar observations in this region of the solar spectrum, we use the observed intensity flux\nof α Cen A (a solar-like star) in order to adjust one of \nthe most important and approximated parameters in our atomic\nmodel, namely the rate of inelastic collisions with electrons. We find that by reducing all these rates by\na factor ten we obtain a theoretical flux very similar to the α Cen A observation at the core of the\nFe2 resonant lines. It is important to emphasize that this region of the spectrum is severely\naffected by the so-called UV blanketing, which we cannot accurately include in our modeling, and that is\nevident when comparing the continuum level between the theoretical and observed flux profiles. While the\nimpact of the UV blanketing, a priori, limits the diagnostic capabilities of the weaker lines and the\nwings of the strongest lines, the metallicity of α Cen A is considerably larger than that of the Sun.\nTherefore the impact of UV blanketing is expected to be\nless significant in the solar spectrum than \nin α Cen A. Future solar observations\nin this spectral window will\n make possible to study in detail how the\n UV blanketing affects the conclusions of\nthis work and to further validate and improve\nthe atomic data for the modeling of the Fe2 spectral lines.\n\nMost of the stronger (in intensity) Fe2 lines do not\nshow remarkable linear polarization signals for a close to the limb LOS (μ=0.1). Nevertheless, there\nare numerous lines with predicted signals with amplitudes larger \nthan 0.2 %, and therefore we expect that they \ncan be observed with spectropolarimetric instrumentation similar to that of CLASP2.\nWe show the region of formation,\ncritical Hanle field, and information about blends for all these lines. Most of them form around the middle\nchromosphere, with some forming in the upper chromosphere. We study in detail the magnetic sensitivity of\nthe linear polarization of five of these lines, showing that those forming in the middle (upper) chromosphere\nare typically sensitive to magnetic fields with strength up to ∼50 G (∼20 G). These lines thus\nencode information about the expected weak magnetic fields in the chromosphere of the quiet Sun.\n\nWe find that, for a magnetic field strength of 50 G, more than a hundred Fe2 transitions\nare predicted to show circular polarization signals above 0.5%  strong enough to be able of use the WFA to reliably infer the longitudinal component of the magnetic field. We show the region of formation,\neffective Landé factor, and information about blends for all these lines. Most of them form in the upper\nphotosphere and lower chromosphere, with some of them forming in the upper chromosphere. \nWe estimate the\norder of magnitude of the magnetic field for which the WFA may not hold. \nWe find that, for the lines forming in the photosphere, these values are mostly between 200 and\n400 G, while in the middle and upper chromosphere the typical values are between 700 and 900 G.\nBy applying the WFA to the theoretical circular polarization profiles of four lines with different\nheights of formation we are able to recover \nthe magnetic field values of the imposed exponential stratification.\nWhen checking the height in the atmospheric model at which the inferred magnetic field is located, we can\nsee that they coincide with the information provided by the circular polarization contribution function\nregarding the region of formation of each of the selected spectral lines.\n\nThe narrower 279.2 - 280.7 nm spectral window of the CLASP2 suborbital space experiment includes several spectral lines of already demonstrated utility for diagnosing the magnetic field across the whole solar chromosphere, namely the Mg2 h and k lines and the resonance lines of Mn1. In addition, as we shall show in a forthcoming publication, it includes several other weaker spectral lines with measurable circular polarization signals in active region plages, such as two hitherto unexplored Fe2 lines. The circular polarization of these Fe2 lines provides information about the magnetic field which is complementary to the Mg2 and Mn1 lines in terms of the region of the atmosphere that they sample. All these  near-UV lines of the CLASP2 spectral region are very suitable to map the magnetic field from the lower to the upper chromosphere.\nNevertheless, the results of the present investigation on the magnetic sensitivity of the Fe2 lines in the 250 - 278 nm spectral region, especially the prediction that they should show measurable circular polarization signals and sample different layers of the solar chromosphere when suitably combined, lead us to conclude that including these lines would further help determine the magnetic field throughout the whole solar chromosphere.\n\n \n\n\n\n\n\nWe acknowledge the funding received from the European Research Council (ERC)\nunder the European Union's Horizon 2020 research and innovation programme (ERC\nAdvanced Grant agreement No 742265).\n\n\naasjournal\n\n\n"}