{"entry_id": "http://arxiv.org/abs/2303.07060v1", "published": "20230313122819", "title": "Parametric Estimation of Tempered Stable Laws", "authors": ["Till Massing"], "primary_category": "math.ST", "categories": ["math.ST", "math.PR", "stat.TH", "60E07, 60G51, 62F12, 62P20"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n \na]Till MassingFaculty of Economics, University of\nDuisburg-Essen, Universitätsstr. 12, 45117 Essen, Germany.\nE-Mail:\ntill.massing@uni-due.de\n\n\n\n\nParametric Estimation of Tempered Stable Laws\n    [\n    March 30, 2023\n=============================================\n\n\n\n\nTempered stable distributions are frequently used in financial applications (e.g., for option pricing) in which the tails of stable distributions would be too heavy. Given the non-explicit form of the probability density function, estimation relies on numerical algorithms as the fast Fourier transform which typically are time-consuming. We compare several parametric estimation methods such as the maximum likelihood method and different generalized method of moment approaches. We study large sample properties and derive consistency, asymptotic normality, and asymptotic efficiency results for our estimators. Additionally, we conduct simulation studies to analyze finite sample properties measured by the empirical bias and precision and compare computational costs. We cover relevant subclasses of tempered stable distributions such as the classical tempered stable distribution and the tempered stable subordinator. Moreover, we discuss the normal tempered stable distribution which arises by subordinating a Brownian motion with a tempered stable subordinator. Our financial applications to log returns of asset indices and to energy spot prices illustrate the benefits of tempered stable models.\n\n\n\n\n60E07;60G51;62F12;62P20\nactivate=true\n\n\n\n§ INTRODUCTION\n\n\nWe discuss parametric estimation methods for some well-known subclasses of tempered stable distributions. Estimation relies heavily on numerical methods as the probability density function is not given in closed form. This paper aims to compare available estimation methods both from an analytical as well as from a practical point of view. \n\nTempered stable distribution are relevant from both a theoretical perspective and in the context of financial applications. Since tempered stable distributions are infinitely divisible, they can be used as the underlying marginal distribution for tempered stable processes. They arise by tempering the measure of stable distributions with a suitable tempering function. Tempered stable distributions were introduced in <cit.>, where the associated process was called smoothly truncated flight, which itself is a generalization of Tweedie distributions <cit.>. Since then, tempered stable distributions have been generalized in several directions by mainly generalizing the class of tempering functions. <cit.> presents a general framework for tempered stable distributions which contain the parametric subclasses to be considered in this paper. Further developments are surveyed in <cit.>.\n\nThe three subclasses we consider in this paper are the tempered stable subordinator (a one-sided distribution with finite variation), the classical tempered stable distribution (with the classical exponential tempering), and the normal tempered stable distribution (which is a normal-variance mixture with a tempered stable subordinator). The CGMY distribution <cit.> is a well-known special case of the classical tempered stable distribution which was introduced to model log-returns of stock prices. Tempered stable distributions have frequently been used for financial applications <cit.>. Furthermore, <cit.> and <cit.> propose tempered stable distributions because the tails of tempered stable distributions are not too heavy for option pricing (contrary to stable distributions).\n\n Estimation methods for generalized tempered stable distributions are still an active area of research. We compare various well-established estimation methods in the literature. The first is the traditional maximum likelihood (ML) method, which works by numerical optimization and Fourier inversion, see <cit.>. <cit.> proves strong consistency of the maximum likelihood estimator (MLE). <cit.> propose moment methods which are easier and faster than the ML method. We also use the generalized method of moments estimator by <cit.> that is based on empirical characteristic functions and the generalized method of moments on a continuum of moment conditions by <cit.>. The latter method already turned out to be useful to estimate stable distributions, see <cit.>. Further available methods include the method of simulated quantiles <cit.>, and non- or semiparametric methods <cit.>.\n\nThis paper contributes to the literature in three ways. First, we derive asymptotic theory for the ML method and the generalized method of moments for the three classes of tempered stable distributions. More precisely, we prove asymptotic efficiency and asymptotic normality of the estimators by verifying the set of sufficient conditions. Second, we compare finite sample properties of the estimators in a Monte Carlo study. Third, we illustrate that tempered stable distributions are more suitable in financial applications than stable distributions because the tails of the latter are too heavy. For this, we study log-returns of three financial time series namely the S&P 500, the German DAX, and the German EEX electricity spot prices.\n\nThe remainder of this paper is organized as follows. Section <ref> presents formal definitions and properties of tempered stable distributions and their important subclasses. Section <ref> discusses the estimation strategies and states their general asymptotic results. Section <ref> contains our theoretical results. All proofs are relegated to the appendix. In Section <ref> we conduct a simulation study to analyze finite sample properties. We discuss financial applications in Section <ref>. Section <ref> concludes.\n\n\n\n§ TEMPERED STABLE DISTRIBUTIONS\n\n\nTo establish notation, we describe some general properties of tempered stable distributions and the considered special cases in this paper. Recall that by the Lévy-Khintchine formula every process can uniquely be described by its characteristic triple (a,B,Π), where a denotes the trend, B the diffusion matrix and Π the measure. Important special cases are so called stable (or α-stable) processes (see <cit.> or <cit.>). Stable processes in d dimensions are characterized by the measure\n\n    M( r,  u) = r^-1-α r σ( u),\n\nwhere α∈(0,2) and σ is a finite, non-zero measure on the (d-1)-dimensional unit sphere S^d-1. In one dimension the measure takes the form\n\n    M( r) = (δ_+/r^1+α1_(0,∞)(r)+δ_-/|r|^1+α1_(-∞,0)(r)) r,\n\nwith δ_+,δ_-≥0 s.t. (δ_+,δ_-)≠(0,0).\n\nTempered stable distributions arise by tempering the measure of a stable distribution by a tempering function. The measure of d-dimensional tempered stable measure with a general tempering function is\n\n    Q( r,  u) = r^-1-α q(r,u) r σ( u),\n\nwhere q:(0,∞)× S^d-1→ (0,∞) is a Borel function s.t. q(·,u) is completely monotone with lim_r→∞q(r,u)=0 for each u∈ S^d-1, i.e., (-1)^n∂^n/∂ r^nq(r,u)>0 for all r>0,u∈ S^d-1, n∈ℕ_0. It is called a proper tempered stable distribution if, in addition, lim_r↓0q(r,u)=1 for each u∈ S^d-1. <cit.> generalize tempered stable distributions by allowing q to only fulfill lim_r→0||q(r,·)-g(·)||_L^1(S^d-1,σ)=0 for some non-negative function g∈ L^1(S^d-1,σ). There are various ways of choosing q (see <cit.> for some examples). In this paper, we mainly focus on the exponential (or classical) tempering function where we apply an exponentially decreasing function. See the next subsections for details. For both stable and tempered stable distributions the diffusion matrix B is zero.\n\n\n\n §.§ Tempered stable subordinator\n\n\nThe first special case we discuss is the tempered stable subordinator (TSS). It is constructed from the stable subordinator which is a non-negative, increasing process with α-stable marginals. In this case, the stability parameter α needs to be in (0,1). Its measure is \n\n    δ/r^1+α1_(0,∞)(r) r,\n\nwhere δ>0 is a scale parameter. For exponential tempering, the measure of the TSS distribution is given by\n\n    Q_TSS( r)=e^-λ rδ/r^1+α1_(0,∞)(r) r,\n\nwhere λ>0 is the tempering parameter.\n\nLet Y∼ TSS(α,δ,λ) be a TSS distributed random variable. Using (<ref>) it is possible to derive the characteristic function of the TSS distribution, see <cit.> for a proof of\n\n    φ_TSS(t;θ):=𝔼_θ[e^itY]= exp(δΓ(-α)((λ-it)^α-λ^α)),\n\nwith parameter vector θ=(α,δ,λ).\n\nThe probability density function of tempered stable distributions is generally not available in closed form. For the TSS distribution we can make use of the identity\n\n    f_TSS(y;θ)=e^-λ y-λ^αδΓ(-α)f_S(α,δ)(y),\n\nwhere f_TSS(y;θ) denotes the density function of the TSS distribution, see <cit.>. S(α,δ) denotes the distribution of the α-stable subordinator with scale parameter δ and f_S(α,δ)(y) denotes its density, which is (except of a few special cases) not available in closed form. However, many software packages (like the stabledist or Tweedie packages in R) have fast computation routines based on series or integral representations. Combining such series representation with (<ref>) we obtain a series representation for the TSS distribution\n\n    f_TSS(y;θ)=e^-λ y-λ^αδΓ(-α)-1/π∑_k=1^∞(-1)^k/k!Γ(1+α k)Γ(1-α)^k(δ/α)^ky^-(1+α k)sin(απ k),\n\nsee <cit.>.\n\nThe estimation method in Section <ref> makes use of matching theoretical with empirical cumulants. Therefore, we state the cumulant generating function of the TSS distribution \n\n    ψ_TTS(t;θ)= δΓ(-α)((λ-t)^α-λ^α),\n\nfor t≤λ, derived in <cit.>. Thus, the m-th order cumulants κ_m=.^n/ t^nψ(t)|_t=0 are given by\n\n    κ_m=Γ(m-α)δ/λ^m-α,   m∈ℕ.\n\n\nSimulation, which we need in the Monte Carlo study, of TSS distributed random variates is straightforward by an acceptance-rejection algorithm, i.e., we first generate U∼𝒰(0,1) and V∼ S(α,δ). If U≤e^-λ V we set Y:=V, otherwise we repeat the first step, see <cit.>. For the generation of stable random numbers see, e.g., <cit.>. See <cit.> for the more efficient double rejection method.\n\n\n\n\n §.§ Classical tempered stable distribution\n\n\nSecond, we discuss one dimensional classical tempered stable (CTS) distributions. They are defined by their measure \n\n    Q_CTS( r)=(e^-λ_+rδ_+/r^1+α1_(0,∞)(r)+e^-λ_-|r|δ_-/|r|^1+α1_(-∞,0)(r)) r.\n\nα∈(0,2) is the stability parameter, δ_+,δ_->0 are scaling parameters, λ_+,λ_->0 are tempering parameters and μ is a location parameter. The indices + and - refer to the positive and negative parts of the distribution (centered around μ). We collect all parameters in the vector θ=(α,δ_+,δ_-,λ_+,λ_-,μ). Note that for the CTS distribution the parameter vector θ is different than for the TSS distribution.\n\nLet X∼ CTS(α,δ_+,δ_-,λ_+,λ_-,μ). The characteristic function is given by <cit.>\n\n    φ_CTS(t;θ):=𝔼_θ[e^itX]   =exp(itμ+δ_+Γ(-α)((λ_+-it)^α-λ_+^α+itαλ_+^α-1).\n        . +δ_-Γ(-α)((λ_-+it)^α-λ_-^α-itαλ_-^α-1)),\n\nfor all θ∈(0,2)×(0,∞)^4×ℝ such that α≠1. For θ_1=(1,δ_+,δ_-,λ_+,λ_-,μ) the characteristic function of the CTS distribution instead has the form\n\n    φ_CTS(t;θ)   =exp(itμ+δ_+((λ_+-it)log(1-it/λ_+)+it).\n        . +δ_-((λ_-+it)log(1+it/λ_-)-it)).\n\nNote that the characteristic function (and hence the density function) is discontinuous at α=1, which affects the compact domain for which asymptotic analysis is possible <cit.>.\n\nAs for the TSS distribution, the density function of the CTS distribution does not exist in closed form. Crucially, even a simple relationship with a stable density as for the TSS distribution in (<ref>) is not available. For numerical evaluations it is therefore necessary to rely on algorithms like the fast Fourier transform <cit.> applied to the characteristic function (<ref>).\n\nAs for the TSS distribution, we specify the cumulant generating function\n\n    ψ_CTS(t;θ)   = tμ+δ_+Γ(-α)((λ_+-t)^α-λ_+^α+tαλ_+^α-1)\n         +δ_-Γ(-α)((λ_-+t)^α-λ_-^α-tαλ_-^α-1),\n\nfor t∈[-λ_-,λ_+]. We use theoretical cumulants for cumulant matching below. The m-th order cumulants can be derived from (<ref>) and take the form\n\n    κ_m=Γ(m-α)δ_+/λ_+^m-α+(-1)^mΓ(m-α)δ_-/λ_-^m-α,\n\nfor m≥ 2 and κ_1=μ.\n\nTo explain a feasible simulation algorithm we first discuss the relationship between the CTS distribution and the TSS distribution of the previous subsection by introducing a related distribution. The relation to the CTS distribution will become apparent in the following.\nClosely related to the TSS distribution is the centered and totally positively skewed tempered stable distribution TS^'(α,δ,λ) which is defined by its characteristic function\n\n    exp(δΓ(-α)((λ-it)^α-λ^α+itαλ^α-1)),\n\nfor α∈(0,1)∪(1,2). For α∈(0,1), we have the relation that if Y∼ TSS(α,δ,λ), then Y-δΓ(1-α)λ^α-1∼ TS^'(α,δ,λ). In particular, \n\n    f_TS^'(y;α,δ,λ)=f_TSS(y-δΓ(1-α)λ^α-1;α,δ,λ).\n\nFor α∈(0,1)∪(1,2), we additionally have\n\n    f_TS^'(y;α,δ,λ)=e^-λ y-λ^αδ(α+1)Γ(-α)f_S(α,δ)(y-Γ(1-α)δλ^α-1),\n\nwhere S(α,δ) is the totally positively skewed stable distribution with measure δ r^-α-11_(0,∞)(r) r.\n\nUsing this, CTS distributed random variables can be constructed from totally positively skewed tempered stable random variables in the following way. Let Y_+∼ TS^'(α,δ_+,λ_+) and Y_-∼ TS^'(α,δ_-,λ_-) and μ∈ℝ. Then\n\n    X:= Y_+ - Y_- +μ∼ CTS(α,δ_+,δ_-,λ_+,λ_-,μ).\n\n\nSimulation of classical tempered stable variables therefore reduces to simulation of totally positively skewed tempered stable random variables. However, this is more involved than for the subordinator as the simple acceptance-rejection does not work for α∈(1,2). <cit.> present several remedies, e.g., a truncated series representation by <cit.>. We opt for the simulation approach of <cit.>, i.e., using an approximate acceptance-rejection algorithm which works as follows: first fix a number c>0. Second, simulate U∼𝒰(0,1) and V∼ S(α,δ). If U≤e^-λ (V+c) we set Y:=V -Γ(1-α) δλ^α-1, otherwise we return to the second step. The algorithm is not exact, i.e., Y TS^'(α,δ,λ). The number c controls the degree of approximation and also the acceptance rate. For c too small the approximation might not be sufficient. For large c the approximation improves; yet, the acceptance probability decreases and therefore the runtime elongates.\n\n\n\n\n §.§ Normal tempered stable distribution\n\nA further model for financial applications is the normal tempered stable (NTS) distribution. It is constructed as a classical normal variance mixture, see <cit.>. For this, let Y∼ TSS(α,δ,λ), with (α,δ,λ)∈(0,1)×(0,∞)^2. Let W∼ N(0,1) independent of Y and β,μ∈ℝ.\nSet\n\n    Z=√(Y)W+β Y+μ.\n\nThen, Z is NTS(θ) distributed, where for this case θ=(α,β,δ,λ,μ).\nWe can also obtain the NTS distribution by tempering a stable distribution. The corresponding tempering function can be found in <cit.>. Note that the tempering function is not completely monotone but is in the class of generalized tempered stable distributions of <cit.>.\n\nFor our parametrization, the characteristic function now takes the form\n\n    φ_NTS(t;θ)=E[e^itZ]= exp(itμ+δΓ(-α)((λ-itβ+t^2/2)^α-λ^α)).\n\nAs for the CTS distribution, the density function is not available in closed form and numerical computation relies on the FFT. \n\nAs cumulants do not have an easy pattern as for the other examples we omit them. We also do not propose a cumulant matching estimation method here.\n\nSimulation of NTS distributed random variables is easy given the TSS distribution and Brownian motion realizations by invoking (<ref>).\n\n\n\n§ ESTIMATION METHODS\n\nThis section discusses some parametric estimation strategies available in the literature. We apply these to the tempered stable distributions considered above and derive asymptotic efficiency and normality in the next section. In this section, we briefly present the methods and some known general asymptotic results. We state maintained assumptions in Appendix <ref>. Throughout this section let X be a random variable following one of the tempered stable distributions of Section <ref> and let f(x;θ) denote its density function, depending on the parameter vector θ. Also denote by\nφ_θ(t):=𝔼_θ[e^itX]\nits characteristic function, where 𝔼_θ is the expectation operator w.r.t. the data generating process indexed by θ. Let θ_0 be the unknown true parameter vector. In this paper, we only consider the case of an i.i.d. sample X_1,…,X_n with density function f(x;θ).\n\n\n\n §.§ Maximum likelihood estimation\n\n\nMaximum likelihood estimation is standard in the literature and frequently used, for example in <cit.>. We numerically maximize the log-likelihood function\n\n    ℓ(θ)=∑_j=1^nlog f(X_j;θ)\n\nw.r.t. θ.\n\nAs described in the preceding section, the density functions of our distributions are not available in closed form but either via a series representation (TSS) or via the Fourier inversion (CTS and NTS)\n\n    f(x;θ)=1/2π∫_ℝe^-itxφ_θ(t) t\n\nbased on the characteristic function φ_θ(t). In practice, we use the FFT algorithm to approximate (<ref>).\n\nAmong others <cit.> (which we here follow) proved the limiting behavior of the maximum likelihood estimator as given in the following proposition.\n\nUnder Assumption <ref> in Appendix <ref>, the ML estimator\n\n    θ̂_n,ML=_θ∈Θℓ(θ)\n\nis consistent and\n\n    n^1/2(θ̂_n,ML-θ_0)ℒ→N(0,I_θ_0^-1),\n\nas n→∞, where I_θ_0^-1 denotes the inverse of the Fisher information matrix.\n\n\n\n\n §.§ Generalized Method of Moments\n\n\nThe generalized method of moments (GMM) by <cit.> is suitable for estimating tempered stable laws. One approach to define moment conditions is to use the theoretical characteristic function φ_θ(t) of X.\nThe sample analogue for the realizations {X_j}_j=1,…,n is\n\n    φ̂_n(t)=1/n∑_j=1^n e^itX_j.\n\nWe form moment conditions\n\n    𝔼_θ_0[h(t,X_j;θ)]=0\n\nfor all t∈ℝ^d, where\n\n    h(t,X_j;θ)=e^itX_j-φ_θ(t).\n\nThe sample analogue is denoted by\n\n    ĥ_n(t;θ)=1/n∑_j=1^n h(t,X_j;θ)=φ̂_n(t)-φ_θ(t).\n\n\nWe now review some approaches on how to choose a set of t's to obtain appropriate moment conditions. One way is to to choose a finite grid {t_1,…,t_R}⊂ℝ. <cit.> show that the asymptotic variance of the estimator can be made arbitrarily close to the Cramér-Rao bound by selecting the grid sufficiently fine. However, as argued by <cit.>, the grid size must not be larger than the sample size. Otherwise, the problem becomes ill-posed since the asymptotic variance matrix of the moment conditions becomes singular. <cit.> generalize the empirical characteristic function GMM approach by introducing an estimator based on a continuum of moment conditions (CGMM). They derive that the asymptotic variance attains the Cramér-Rao bound. They solve the singularity issue of the asymptotic variance matrix by applying a suitable regularization. We discuss this approach in more detail below. For the case of the GMM estimator based on a discrete set of moment conditions, we follow <cit.> in the numerical computations and also use a regularization to make the scheme numerically stable. We use an equally spaced grid. Other suggestions can be found in <cit.>.\n\nNext, we describe the CGMM estimation method of <cit.> based on <cit.> and <cit.>. We start by introducing some notation. Let π be a probability density on ℝ and L^2(π) be the Hilbert space of complex valued functions such that\n\n    L^2(π)={f: ℝ→ℂ :  ∫|f(t)|^2π(t) t<∞}.\n\nThe inner product on L^2(π) is defined as\n\n    ⟨ f,g⟩_L^2(π)=∫ f(t) g(t)π(t) t\n\nand the norm on L^2(π) as\n\n    ||g||_L^2(π)^2=∫ |g(t)|^2π(t) t.\n\nLet K be the asymptotic variance-covariance operator associated with the moment functions h(t,X;θ). K is an integral operator that satisfies\n\n    K: L^2(π)   → L^2(π)\n     f   ↦ g, where g(s)=∫ k(s,t)f(t)π(t) t,\n\nwhere k(s,t) is a kernel given by\n\n    k(s,t)=𝔼_θ[h(s,X;θ)h(t,X;θ)].\n\nThen the efficient CGMM estimator is given by\n\n    θ̂=_θ⟨ K^-1ĥ_n(·;θ),ĥ_n(·;θ)⟩_L^2(π).\n\n\nThe above CGMM is non-feasible because we need an estimate K̂_n for K. It is possible to estimate (<ref>) with\n\n    k̂_n(s,t)=1/n∑_j=1^n(e^is^'X_j-φ̂_n(s))(e^it^'X_j-φ̂_n(t)).\n\nHowever, an empirical operator K̂_n with kernel function k̂_n(s,t) is non-invertible. Therefore, <cit.> estimate K^-1 by\n\n    K̂_n,γ_n^-1=(K̂_n^2+γ_n I)^-1K̂_n.\n\nγ_n is (depending on the sample size) a sequence of hyperparameters which allow K̂_n,γ_n^-1f to exist for all f∈ L^2(π) and to dampen the sensitivity of K̂_n,γ_n^-1f to variation in the input f.\nThen, the feasible CGMM estimator is given by\n\n    θ̂_n,CGMM(γ_n)=_θ⟨K̂_n,γ_n^-1ĥ_n(·;θ),ĥ_n(·;θ)⟩_L^2(π).\n\n\n<cit.> show that the CGMM estimator is consistent, asymptotically efficient and asymptotically normal (for stationary Markov processes) given a set of assumptions. An earlier version <cit.> proves the statement for i.i.d. data with a simpler set of assumptions. We use their assumptions and prove that the tempered stable distributions fulfill them. More precisely, in general the CGMM estimator satisfies the following asymptotic result.\n\nUnder the Assumptions <ref> in the Appendix, the CGMM estimator is consistent and\n\n    n^1/2(θ̂_n,CGMM(γ_n)-θ_0)ℒ→N(0,I_θ_0^-1),\n\nas n, γ_nn^1/2→∞ and γ_n→0, where I_θ_0^-1 denotes the inverse of the Fisher information matrix. \n\n\nIn practice, we require a reasonable choice of the regularization parameter γ_n. <cit.> derived the optimal estimator for γ_n. However, we choose for simplicity an ad-hoc method for selecting the regularization parameter as <cit.> found that the specific choice of the regularization parameter does not have a striking impact on the estimation precision in their simulations for the stable distribution.\n\n\n\n §.§ Cumulant matching\n\nWe also discuss a method of cumulants approach which follows <cit.>. They match empirical cumulants with their theoretical counterparts. We extend this by using 's () GMM framework. We call the approach generalized method of cumulants (GMC) to distinguish it from the GMM method using characteristic function moment conditions. However, it fits well into 's () framework allowing for standard asymptotic theory. It works as follows. Let\n\n    𝔼_θ_0[g(X;θ)]=0\n\ndenote the theoretical moment conditions and\n\n    1/n∑_j=1^ng(X_j;θ)=0\n\nthe empirical moment conditions. We build the function g by the relation between moments and cumulants given by\n\n    E(X)   =κ_1,\n    \n    E(X^2)   =κ_2+κ_1^2,\n    \n    E(X^3)   =κ_3+3κ_2κ_1+κ_1^3,\n    \n    E(X^4)   =κ_4+4κ_3κ_1+3κ_2^2+6κ_2κ_1^2+κ_1^4,\n       ⋮\n    \n    E(X^p)   =∑_m=1^p B_p,m(κ_1,…,κ_p-m+1),\n\nwhere B_p,m denote incomplete Bell polynomials. In particular for p moment conditions, we choose g(X;θ)=(g_1,…,g_p)^' to be\n\n    g_1   =X-κ_1,\n    \n    g_2   =X^2-κ_2-κ_1^2,\n       ⋮\n    \n    g_p   =X^p-∑_m=1^p B_p,m(κ_1,…,κ_p-m+1).\n\nHere, the theoretical cumulants κ_m for the TSS distribution are given in (<ref>) and, for the CTS distribution, given in (<ref>). For the NTS distribution cumulants do not have an easy-to-use pattern which is why we do not use this method for the NTS distribution. The asymptotic result then is the following proposition. The proof can be found in <cit.>.\n\n\nUnder the assumptions of <cit.> in Theorems 2.6 and 3.4, the GMC estimator\n\n    θ̂_n,GMC=_θ∈Θ(1/n∑_j=1^ng(X_j;θ))^'Ω̂^-1(1/n∑_j=1^ng(X_j;θ)),\n\nis a consistent for θ_0 and, moreover,\n\n    n^1/2(θ̂_n,GMC-θ_0)ℒ→N(0,(G^'Ω^-1G)^-1),\n\nwith G=.𝔼_θ[∂ g(X;θ)/∂θ]|_θ=θ_0, Ω=𝔼_θ_0[g(X;θ)g(X;θ)^'] and Ω̂^-1 is a consistent estimator of Ω^-1.\n\n\n\n\n\n\n\n§ ASYMPTOTIC RESULTS\n\n\nWe present our asymptotic results for the ML, the CGMM and the GMC estimation method. The GMM method of <cit.> has already been discussed to have problems with the singularity of the asymptotic covariance matrix. All proofs can be found in Appendix <ref>. We start with a theorem for the ML estimator. \n\nThe ML estimator θ̂_n,ML for θ_0∈int(Θ) of\n\n\n  (a) the TSS(α,δ,λ) distribution with θ=(α,δ,λ)∈Θ=[ε,1-ε]×[ε,M]^2,\n\n  (b) the TS'(α,δ,λ) distribution with θ=(α,δ,λ)∈Θ=([ε,1-ε]∪[1+ε,2-ε])×[ε,M]^2\n\n  (c) the CTS(α,δ_+,δ_-,λ_+,λ_-,μ) distribution with θ=(α,δ_+,δ_-,λ_+,λ_-,μ)∈Θ=([ε,1-ε]∪[1+ε,2-ε])×[ε,M]^4×[-M,M],\n\n  (d) the NTS(α,β,δ,λ,μ) distribution with θ=(α,β,δ,λ,μ)∈Θ=[ε,1-ε]×[-M,M]×[ε,M]^2×[-M,M],\n\nis consistent, asymptotically normal and asymptotically efficient as n→∞.\n\n<cit.> has already established strong consistency. Therefore, it only remains to show asymptotic normality and efficiency.\n\nWe next show that the CGMM also possesses the desired asymptotic properties for our tempered stable distributions.\n\nThe CGMM estimator θ̂_n,CGMM(γ_n) for θ_0∈int(Θ) of\n\n\n  (a) the TSS(α,δ,λ) distribution with θ=(α,δ,λ)∈Θ=[ε,1-ε]×[ε,M]^2,\n\n  (b) the TS'(α,δ,λ) distribution with θ=(α,δ,λ)∈Θ=([ε,1-ε]∪[1+ε,2-ε])×[ε,M]^2\n\n  (c) the CTS(α,δ_+,δ_-,λ_+,λ_-,μ) distribution with θ=(α,δ_+,δ_-,λ_+,λ_-,μ)∈Θ=([ε,1-ε]∪[1+ε,2-ε])×[ε,M]^4×[-M,M],\n\n  (d) the NTS(α,β,δ,λ,μ) distribution with θ=(α,β,δ,λ,μ)∈Θ=[ε,1-ε]×[-M,M]×[ε,M]^2×[-M,M],\n\nis consistent, asymptotically normal and asymptotically efficient as n→∞ and γ_nn^1/2→∞ and γ_n→0.\n\n\n<cit.> showed that the method of cumulant matching is locally consistent, i.e., the equations of the moment conditions do have a root which is unique in an open neighborhood by the implicit function theorem. However, the assumptions of Proposition <ref> require that the root is unique for the whole domain. We show that this does not hold by constructing counterexamples for a global inverse function theorem.\n\nThe GMC estimator θ̂_n,GMC is locally but not globally consistent (i.e., there may be multiple roots).\n\n\n\n\n§ MONTE CARLO STUDY\n\n\nIn this section, we compare empirical properties of the proposed estimators in a simulation study. In order to do so, we simulate n=100 and n=1000 random numbers distributed according to the distributions TSS(0.5, 1,1), CTS(1.5, 1,1,1,1,0), and NTS(0.5,0,1,1,0). We estimate the parameters using the ML, the GMM method according to <cit.>, the CGMM method according to <cit.>. For the TSS and CTS distributions we additionally compute the GMC estimator using three different numbers of moment conditions, i.e., the just-identified case (3 moment conditions for TSS, 6 moment conditions for CTS) and two overidentified cases (4 and 5 moment conditions for TSS, 7 and 8 moment conditions for CTS). We choose a regularization parameter 0.01 and a cut-off regularization <cit.> for GMM and a Tikhonov regularization for CGMM. Further details on computational settings are available upon request. The implemented routines will be published in an R package. We repeat the experiments in 10,000 independent Monte Carlo replications.\n\nTable <ref> shows empirical bias and empirical root mean squared errors (RMSE) (in parenthesis) for the TSS distribution for each of the parameters. In the last column, we display the average runtime for estimation in seconds. The striking difference is that while the GMM and the GMC estimation performs in less than a  second ML and CGMM need considerably more time to compute. As expected, the estimates are more precise for a larger sample. Importantly, all methods (except the MLE) suffer from a small sample size which implies that the algorithms run into boundary solutions (i.e., finding stability parameters close to zero). This implies a negative empirical bias for α. The ML estimator outperforms the other methods followed by CGMM. The GMC with 4 moment conditions also works fairly well, adding further moment conditions has no additional value.\n\n\n\nTable <ref> shows similar experimental results for the CTS distribution. Again, we report the empirical bias and the RMSE for each of the parameters. As expected, estimating 6 parameters is more demanding than estimating 3 as above. We see that for the GMC and GMM methods extremely high values of bias and RMSEs occur, which is due to rare extremely high parameter estimates. Therefore, we also compute the median absolute deviation from the true parameters, printed in square brackets. Generally, we observe that all methods fail to provide good estimates for 100 observations. In this case, the optimization algorithms find boundary solutions for many of the randomly drawn sets. Thus, the CTS distribution should only be used as a model if the sample size is not too small. The GMC and GMM methods also fail for 1000 observations for most of the Monte Carlo replications. For 1000 observations, the ML estimator performs better than the latter methods. However, it still has difficulties to estimate the stability index correctly in some instances. The CGMM method has the longest runtime but works fairly well especially compared with the other estimators. Boundary estimates rarely occur.\n\n\n\n\nTable <ref> presents the results for the NTS distribution. For this distribution, we only use the CGMM, the GMM and the ML methods. As before a larger sample is beneficial since small samples lead to boundary estimates. For example, the bias and RMSE for β are very large for the GMM method because of large outliers. As for the CTS above, the CGMM method seems to perform better than ML and much better than the GMM method, which performs poorly even for a larger sample.\n\n\n\nTo conclude, the CGMM works good for all three examples and is the only reliable estimator for the CTS distribution. Unfortunately, the runtime is quite lengthy as well as for the ML estimator, which finds boundary solutions more frequently. The GMM and GMC estimators only work for the TSS subordinator. Therefore, we recommend to use the CGMM estimator for the CTS and NTS distribution.\n\n\n\n§ APPLICATIONS\n\n\nWe discuss financial applications to motivate the use of tempered stable distributions. Tempered stable distributions have already been proposed to model log-returns of financial assets, see e.g., <cit.>. In the case of electricity markets, e.g., <cit.> models the evolution of electricity spot prices by a tempered stable driven Ornstein-Uhlenbeck process.  \n\nWe here analyze log-returns of three financial assets. We consider the S&P 500 index (2012-06-01 to 2022-05-31), the German DAX index (2012-06-01 to 2022-05-31), and base-load spot prices from the German power exchange EEX (2018-09-30 to 2022-05-31). We obtain daily data from Refinitiv's Eikon. Before modeling tempered stable distributions we perform some simple manipulations and fit preliminary models to clean the data. In this order, we first deseasonalize the data of the EEX regarding its weekly profile by applying a moving average filter, see <cit.>. Second, we exclude the rare cases of negative prices of the EEX. Next, we compute log-returns for the three indices (for the EEX we also omit all log-returns next to days with negative prices). Last, we fit GARCH(1,1) models (with normal errors) to each of the log-return series to remove stochastic volatility from the data which can mistakenly interpreted as evidence for heavy tailed distributions <cit.>. With this approach, we follow <cit.> who found that this quasi-MLE performs nearly identically as to a correctly specified MLE of a GARCH model with CTS or NTS distributed errors as in <cit.>.\n\nFigures <ref> to <ref> show the original time series (a), the (deseaonalized) log-returns (b), and the GARCH residuals (c). We observe in panels (b) that for each of the series of log-returns stochastic volatility is apparent. The GARCH residuals do not exhibit volatility clustering anymore. However, the residuals reveal skewness and heavy tails which is why we next fit tempered stable distributions to them.\n\n\n\n\n\n\n\n\nWe compare the CTS and the NTS distributions with a univariate stable distribution as a baseline model. Needless to say, there are plenty of other models for log-returns in the literature, e.g., generalized hyperbolic models (and their subclasses) by <cit.>, or finite mixture models <cit.>. For conciseness, we do not present them here but refer to the aforementioned references and <cit.> for a comparison. \n\nTo compare the goodness-of-fit we use the Kolmogorov-Smirnov (KS) and the Anderson-Darling (AD) statistics. Lower statistics indicate a better fit. It is known that the KS distance better reflects the fit around the center of the distribution while the AD statistics concentrates on the tails of the distributions <cit.>. Of course, the CTS and the NTS distributions have a larger number of parameters hence a better fit is to be expected. Therefore, we also compute the Akaike Information Criterion (AIC) and the Bayesian Information Criterion (BIC) to penalize large models to avoid overfitting. The penalization of larger models is higher for the BIC.\n\nFor brevity, we decide to only present estimates and plots obtained with the CGMM estimator. The reason for this choice is that it performed best in the simulation study in Section <ref>. Table <ref> shows parameter estimates for the three time series and the three distributions. Table <ref> presents KS, AD, AIC, and BIC statistics.\n\n\n\n\n\n\nFor the KS and AD statistics we observe a mixed pattern. For the S&P 500 the stable distribution is favored while for the DAX and EEX the CTS or NTS distributions have lower values. While in each case the NTS distribution has the lowest AIC, the stable distribution always has the lowest BIC. To visualize goodness-of-fit we moreover depict QQ-plots.\nFigures <ref>–<ref> plot sample quantiles versus theoretical quantiles for the different scenarios. The solid line is the reference line. We observe that, although in some cases the stable distribution has lower KS or AD statistics, the QQ-plots suggest that the tails of the stable distribution are too heavy. CTS and NTS distributions seem to provide a better fit.\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION AND FUTURE WORK\n\nThis paper derived asymptotic efficiency results for parametric estimation methods of the tempered stable subordinator, the classical exponentially tempered stable distribution and the normal tempered stable distribution. We conducted a Monte Carlo study to establish finite sample properties. It turned out that the GMM estimator with a continuum of moment conditions outperformed other methods. We discussed why tempered stable distributions are relevant in financial applications.\nAsymptotic results for other tempering functions or the derivation of a set of conditions to ensure asymptotic efficiency for general tempering function are subject of future work. \n\n\n\n§ ACKNOWLEDGEMENTS\n\nFinancial support of the German Research Foundation (Deutsche Forschungsgemeinschaft, DFG) via the project 455257011 is gratefully acknowledged.\n\nThe author is grateful to Christoph Hanck for valuable comments which helped to substantially improve this paper. Full responsibility is taken for\nall remaining errors.\n\n\nagsm\n\n\n\n\n\n§ APPENDIX: ASSUMPTIONS\n\n\n\n\n  (i) θ̂_n,ML is consistent for θ_0.\n\n  (ii) θ_0 is an interior point of Θ which is compact.\n\n  (iii) f(x;θ) is twice continuously differentiable and f(x;θ)>0 in a neighborhood 𝒩 of θ_0.\n\n  (iv) ∫sup_θ∈𝒩||∂ f(x;θ)/∂θ|| x<∞, ∫sup_θ∈𝒩||∂^2 f(x;θ)/∂θ∂θ^'|| x<∞.\n\n  (v) I_θ_0=.𝔼_θ[(∂log f(X;θ)/∂θ)(∂log f(X;θ)/∂θ)^']|_θ=θ_0 is positive definite.\n\n  (vi) 𝔼_θ[sup_θ∈𝒩||∂^2 log f(X;θ)/∂θ∂θ^'||]<∞.\n\n\n\n\n\n  (i) The observed data {x_1,…,x_n} are i.i.d. realizations of X which has values in ℝ^dand has p.d.f. f(x;θ) with θ∈Θ⊂ℝ^q and Θ is compact.\n\n  (ii) π is the p.d.f. of a distribution that is absolutely continuous with respect to the Lebesgue measure and strictly positive for all x∈ℝ^d\n\n  (iii) The equation\n\n    E_θ_0[e^it^'X]-φ_θ(t)=0 for all t∈ℝ^p, π-a.s.\n\nhas a unique solution θ_0 which is an interior point of Θ.\n\n  (iv) f(x;θ) is continuously differentiable with respect to θ on Θ.\n\n  (v) ∫sup_θ∈Θ||∂ f(x;θ)/∂θ|| x<∞.\n\n  (vi) I_θ_0=.𝔼_θ[(∂log f(X;θ)/∂θ)(∂log f(X;θ)/∂θ)^']|_θ=θ_0 is positive definite.\n\n\n\n\n\n\n\n§ APPENDIX: PROOFS\n\n\n\n\n\n  (a) We will follow <cit.> who proved asymptotic normality for stable distributions. Although he did not consider stable subordinators explicitly it is a corollary of his theorem. This is because (in his notation) the skewness parameter β is fixed at α and does not need to be estimated. Thus the proof for stable subordinators follows along his lines. We check the conditions of Assumption <ref>. We also call these regularity conditions throughout. <cit.> proved condition (i). (ii) Θ is compact by construction. The density function (<ref>) for the TSS distribution is twice continuously differentiable with respect to the parameters by the twice continuous differentiability of the density of the stable subordinator <cit.> which implies (iii). To show (iv), we make use of (<ref>) and bound the partial derivatives\n\n    |∂ f_TSS(y;θ)/∂ϑ|≤ C_θ· f_TSS(y;θ)+|∂ f_S(α,δ)(y)/∂α|,   ϑ=α,\n     f_TSS(y;θ)+|∂ f_S(α,δ)(y)/∂δ|,   ϑ=δ,\n     f_TSS(y;θ) +yf_TSS(y;θ),    ϑ=λ,\n\nwhere C_θ is a positive, finite constant which depends on θ but not on y. Because θ∈Θ which is compact and because C_θ can be taken to be continuous in θ which follows from (iii), C_θ can be bounded by a constant C. The result now follows by the regularity of the stable subordinator <cit.> and because the expected value of a TSS distribution exists. The second part of (iv) follows analogously. In order to show (v), we follow <cit.> and show the equivalent condition that for every θ∈Θ and for every a=(a_1,a_2,a_3)∈ℝ^3 the function\n\n    g(a,y)=a_1∂ f_TSS(y;θ)/∂α+a_2∂ f_TSS(y;θ)/∂δ+a_3∂ f_TSS(y;θ)/∂λ\n\nis identically 0 for all y if and only if a_1=a_2=a_3=0. g(a,y) is of the form ∫e^-iytϕ(a,t) t, where ϕ is a linear combination of derivatives of the TSS characteristic function given in (<ref>) and g(a,y)≡0 iff ϕ(a,y)≡0. The partials are\n\n    ϕ_1=∂φ_TSS(t;θ)/∂α   =φ_TSS(t;θ)δΓ(-α)(((λ-it)^αlog(λ-it)-λ^αlog(λ))-((λ-it)^α-λ^α)ψ(-α)),\n    ϕ_2=∂φ_TSS(t;θ)/∂δ   =φ_TSS(t;θ)Γ(-α)((λ-it)^α-λ^α),\n    ϕ_3=∂φ_TSS(t;θ)/∂λ   =φ_TSS(t;θ)δΓ(-α)(α(λ-it)^α-1-αλ^α-1),\n\nwhere ψ(x)=Γ^'(x)/Γ(x) denotes the digamma function. The characteristic function given in (<ref>) is non-zero for each t which implies that it is sufficient to study the latter terms of ϕ_1,ϕ_2,ϕ_3. ϕ_1 is a linear combination of ((λ-it)^αlog(λ-it)-λ^αlog(λ)) and ((λ-it)^α-λ^α), ϕ_2 is a multiple of ((λ-it)^α-λ^α), and ϕ_3 is a multiple of (α(λ-it)^α-1-αλ^α-1). \nSince ϕ_1 is the only linear combination with term (λ-it)^αlog(λ-it) it follows a_1=0. Therefore, it is necessary for ψ(x)=0 for all t that also a_2=a_3=0.\n\nTo show (vi), we recall that <cit.> proved the statement for the stable distribution. By (<ref>),\n\n    ∂^2/∂θ∂θ^'log f_TSS(y;θ)=∂^2/∂θ∂θ^'(-λ y-λ^αδΓ(-α))+∂^2/∂θ∂θ^'log f_S(α,δ)(y),\n\nwhich elements can be bounded in absolute value by a function C(y), independent of θ, which is bounded in any closed y-interval. Following <cit.>, it is therefore only necessary to study the behavior of C(y) at its limit points. <cit.> showed that for y→∞ the corresponding C(y) for the stable distribution is of the order O(log^2|y|). For y→0, we can follow his lines with the same arguments (deriving an absolutely continuous series). Hence, C(y) for the tempered stable subordinator is of order O(|y|).  \n\nThis implies that ∫_0^∞ C(y)f_TSS(y;θ) y<∞ for each θ∈Θ. \n\n\n  (b) The proof is analogously to (a) but replacing relation (<ref>) with (<ref>).\n\n\n  (c) Conditions (i) and (ii) work just as in (a). For (iii) and (iv), we use that by (<ref>)\n\n    f_CTS(x+μ;θ)=∫_-∞^∞f_+(x+y)f_-(y) y,\n\nwhere f_+ is the density of Y_+∼ TS^'(α,δ_+,λ_+) and Y_-∼ TS^'(α,δ_-,λ_-). This ensures (iii). In order to show (iv),\n\n    ∂ f_CTS(x;θ)/∂θ   =∂/∂θ∫_-∞^∞f_+(x+y-μ)f_-(y) y\n       =∫_-∞^∞∂/∂θ(f_+(x+y-μ)f_-(y)) y\n       =∫_-∞^∞(∂ f_+(x+y-μ)/∂θf_-(y)+∂ f_-(y)/∂θf_+(x+y-μ)) y.\n\nIn the second line we used the regularity of the TS' density derived in part (b) and the easy relation (<ref>). Hence,\n\n    ∫_-∞^∞sup_θ∈Θ||∂ f_CTS(x;θ)/∂θ|| x\n    ≤    ∫_-∞^∞∫_-∞^∞sup_θ∈Θ||∂ f_+(x+y-μ)/∂θf_-(y)|| y x\n    + ∫_-∞^∞∫_-∞^∞sup_θ∈Θ||∂ f_-(y)/∂θf_+(x+y-μ)|| y x\n    \n    =    ∫_-∞^∞∫_-∞^∞sup_θ∈Θ||∂ f_+(x+y-μ)/∂θf_-(y)|| x y\n    + ∫_-∞^∞∫_-∞^∞sup_θ∈Θ||∂ f_-(y)/∂θf_+(x+y-μ)|| x y\n    ≤    ∫_-∞^∞sup_θ∈Θ|f_-(y)|∫_-∞^∞sup_θ∈Θ||∂ f_+(x+y-μ)/∂θ|| x y + ∫_-∞^∞sup_θ∈Θ||∂ f_-(y)/∂θ||∫_-∞^∞sup_θ∈Θ|f_+(x+y-μ)| x y\n    \n    <    ∞,\n\nwhere we used Fubini's Theorem. The left inner integral in (<ref>) is finite by part (b) and of order O(log(x)x^-1-α). The right inner integral isof order O(x^-1-α). Therefore, both double integrals are finite. The second part of (iv) follows analogously. (v) follows analogously to part (a), in particular, if we again denote (ϕ_1,…,ϕ_6)^'=∂φ_CTS(t;θ)/∂θ we observe that ϕ_1 is the only linear combination with terms (λ_+-it)^αlog(λ_+-it) and (λ_-+it)^αlog(λ_-+it), which implies a_1=0. ϕ_2 is a linear combination of t and (λ_+-it)^α, ϕ_3 is a linear combination of t and (λ_-+it)^α, ϕ_4 is a linear combination of t and (λ_+-it)^α-1, ϕ_5 is a linear combination of t and (λ_-+it)^α-1, and ϕ_6 is a multiple of t. This implies a_2=a_3=a_4=a_5=0 and hence a_6=0. As in (a), we have to consider the limiting behavior of C(x) which is the function which bounds the elements of ∂^2/∂θ∂θ^'log f_CTS(x;θ) in absolute value. Because of the convolution property (<ref>), the tails behave as O(|x|) for x→±∞, which proves (vi).\n\n\n  (d) (i) and (ii) as above. For the remainder we use the subordination property of the NTS distribution, i.e.,\n\n    f_NTS(z;θ)=∫_0^∞f_N(z;μ+β y,y)f_TSS(y;α,δ,λ) y,\n\nwhere f_N(z;m,s^2) denotes the density of the normal distribution with mean m and variance s^2. Similarly to <cit.>, we can show that |∂ f_N(z;μ+β y,y)/∂μ|≤C/y and |∂ f_N(z;μ+β y,y)/∂β|≤ C for all θ∈Θ. Additionally, because |f_N(z;μ+β y,y)|≤C/y, we have for ϑ∈(α,δ,λ) that |∂ f_N(z;μ+β y,y)f_TSS(y;α,δ,λ)/∂ϑ|≤C/y|∂ f_TSS(y;α,δ,λ)/∂ϑ| such that\n\n    ∂ f_NTS(z;θ)/∂θ=∫_0^∞∂/∂θ(f_N(z;μ+β y,y)f_TSS(y;α,δ,λ)) y\n\nholds by property (iv) for the TSS distribution. (iv) follows analogously as in (c) because\n\n    ∫_-∞^∞sup_θ∈Θ||∂ f_NTS(z;θ)/∂θ|| z\n    ≤    ∫_-∞^∞∫_0^∞sup_θ∈Θ||∂/∂θ(f_N(z;μ+β y,y)f_TSS(y;α,δ,λ))|| y z\n    \n    =    ∫_0^∞∫_-∞^∞sup_θ∈Θ||∂/∂θ(f_N(z;μ+β y,y)f_TSS(y;α,δ,λ))|| z y.\n\nIn order to bound (<ref>), we discuss the partial derivatives separately. For ∂/∂ϑ, ϑ∈(α,δ,λ),\n\n    ∫_0^∞∫_-∞^∞sup_θ∈Θ||∂/∂ϑ(f_N(z;μ+β y,y)f_TSS(y;α,δ,λ))|| z y\n    ≤    ∫_0^∞sup_θ∈Θ||∂/∂ϑf_TSS(y;α,δ,λ)||∫_-∞^∞sup_θ∈Θ|f_N(z;μ+β y,y)| z y\n    ≤    C∫_0^∞1/√(y)sup_θ∈Θ||∂/∂ϑf_TSS(y;α,δ,λ)|| y\n    \n    <    ∞,\n\nby (<ref>) and by the regularity of the stable distribution. For ∂/∂μ, (<ref>) is bounded by\n\n    ∫_0^∞sup_θ∈Θ||f_TSS(y;α,δ,λ)||∫_-∞^∞sup_θ∈Θ||∂/∂μf_N(z;μ+β y,y)|| z y\n    ≤    C∫_0^∞1/ysup_θ∈Θ||f_TSS(y;α,δ,λ)|| y\n    \n    <    ∞,\n\nby the regularity of the normal distribution. For ∂/∂β,\n\n    ∫_0^∞sup_θ∈Θ||f_TSS(y;α,δ,λ)|∫_-∞^∞sup_θ∈Θ||∂/∂βf_N(z;μ+β y,y)|| z y\n    ≤    C∫_0^∞sup_θ∈Θ||f_TSS(y;α,δ,λ)|| y\n    \n    <    ∞.\n\nThe second part of (iv) follows analogously. (v) follows in a similar fashion as in (a) and (c).\n\n\n\n\n\n\n\n\n\n\nAs in (a)–(c), it is for (vi) enough to consider the behavior of C(z) for z→±∞, where C(z) is the function which bounds the elements of ∂^2/∂θ∂θ^'log f_NTS(z;θ) in absolute value. With the same arguments as above it holds that\n\n    ∂^2 f_NTS(z;θ)/∂θ∂θ'=∫_0^∞∂^2/∂θ∂θ'(f_N(z;μ+β y,y)e^-λ y-λ^αδΓ(-α)f_S(y;α,δ)) y.\n\nWe use that by the series representation for the parameter derivatives of <cit.> the second derivatives of the stable distribution are of order O(y^-α-1log(y)^2). Tedious computations thus yield that C(z)=O(z^2log(|z|)^2), which implies (iv).\n\n\n\n\nWe check the conditions of Assumption <ref> for the tempered stable subordinator. The other two cases follow analogously. (i) Θ is compact by construction and π is chosen in such a way that it fulfills (ii). (iii) holds because \n\n    exp(δΓ(-α)((λ-it)^α-λ^α))=exp(δ_0Γ(-α_0)((λ_0-it)^α_0-λ_0^α_0))\n\nhas to hold for each t which uniquely determines α=α_0,λ=λ_0 and thus also δ=δ_0. (iv)–(vi) have been shown in the proof of Theorem <ref>.\n\n\n\nThe crucial assumption for consistency of a GMC estimator is that W𝔼_θ_0[g(X_j;θ)]=0 only if θ=θ_0, where W is a positive definite matrix. (For the efficient GMC estimator we would choose W=Ω^-1.) <cit.> showed that cumulant matching for the CTS distribution this holds locally by the local inverse function theorem. A generalization to GMC is straightforward. However, we argue now why this only holds locally.\n\nConsider for simplicity the TSS distribution and three moment conditions. The argument carries over to the other cases. <cit.> proved the following version of the Hadamard-Caccioppoli global inverse function theorem: Let f:X→ Y be a local homeomorphism with X,Y path-connected Hausdorff spaces and Y is simply connected. Then f is a homeomorphism onto Y if and only if it is a proper function, i.e., the preimage f^-1(K) of any compact set K⊂ Y is compact. We will use the equivalent statement that whenever a sequence {x_n}⊆ X satisfies x_n→ x for some x∈∂ X then f(x_n)→ y for  y∈∂ Y, where ∂ X denotes the boundary of X.\n\nLet \n\n    f:(0,1)× (0,∞)×(0,∞)   → (0,∞)^3\n    θ   ↦ (Γ(1-α)δ/λ^1-α,Γ(2-α)δ/λ^2-α,Γ(3-α)δ/λ^3-α).\n\n<cit.> showed that f is a local homeomorphism. Obviously, X and Y are path-connected Hausdorff spaces and Y is simply connected. Take a sequence θ_n such that α_n→0 and δ_n≡δ,λ_n≡λ. This fulfills that θ_n→(-∞,1,∞)∈∂ X. However, f(θ_n)→(Γ(1)δ/λ,Γ(2)δ/λ^2,Γ(3)δ/λ^3)∉∂ Y. Therefore the local homeomorphism is not global.\n\n\n\nThe issue of global invertibility is not solved if we extend the possible parameter space of the index α to (-∞,1), which is technically possible to define distribution on this space <cit.>. In this case, we can construct a sequence such that α_n→-∞, δ_n≡1 and λ_n=Γ(1-α_n)^1/1-α_n. Thus, θ_n→∂ X, but, f(θ_n)→ (1,e,e^2)∉∂ Y.\n\n\n"}