{"entry_id": "http://arxiv.org/abs/2303.07059v1", "published": "20230313122746", "title": "Tracing chirality from molecular organization to triply-periodic network assemblies: Threading biaxial twist through block copolymer gyroids", "authors": ["Ishan Prasad", "Abhiram Reddy", "Gregory M. Grason"], "primary_category": "cond-mat.soft", "categories": ["cond-mat.soft", "cond-mat.mtrl-sci"], "text": "\n\n\n\n\n\n\nDepartment of Chemical Engineering, University of Massachusetts, Amherst, Massachusetts 01003, USA\n\n\n Department of Polymer Science and Engineering, University of Massachusetts, Amherst, Massachusetts 01003, USA \n\n\n\n\n Department of Polymer Science and Engineering, University of Massachusetts, Amherst, Massachusetts 01003, USA\n\n\n grason@umass.edu\n \n\n\n             \n\n\nChirality transfer from the level of molecular structure up to mesoscopic lengthscales of supramolecular morphologies is a broad and persistent theme in self-assembled soft materials, from  biological to synthetic matter.  Here, we analyze the mechanism of chirality transfer in a prototypical self-assembly system, block copolymers (BCPs), in particular, its impact on one of the most complex and functionally vital phases: the cubic, triply-periodic, gyroid network.  Motivated by recent experimental studies, we consider a self-consistent field model of ABC* triblock copolymers possessing an end-block of chain chemistry and examine the interplay between chirality at the scale of networks, in alternating double network phases, and the patterns of segmental order within tubular network domains.  We show that while segments in gyroids exhibit twist in both polar and nematic segmental order parameters, the magnitude of net nematic twist is generically much larger than polar twist, and more surprising, reverses handedness relative to the sense of polar order as well as the sense of dihedral twist of the network. Careful analysis of the intra-domain nematic order reveals that this unique chirality transfer mechanism relies on the strongly biaxial nature of segmental order in BCP networks and relates the biaxial twist to complex patterns of frame rotation of the principal directors in the intra-domain texture.  Finally, we show that this mechanism of twist reversal leads to chirality selection of alternating gyroid networks in ABC* triblocks, in the limit of very weak chirality . \n\n\n\nTracing chirality from molecular organization to triply-periodic network assemblies: \n \nThreading biaxial twist through block copolymer gyroids\n\n    Gregory M. Grason\n    March 30, 2023\n================================================================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nChirality transfer, from local interactions between constituents to complex and self-organized patterns of order on larger length scales, pervades material systems <cit.>, from chiral magnets <cit.> to biological <cit.> and synthetic <cit.> self-assemblies. Perhaps the simplest example is the cholesteric phase <cit.>, where non-centrosymmetric interactions of anisotropic subunits, such as rod-like mesogens or biopolymers, stabilize states of mean alignment in which a molecular director rotates helically along an axis perpendicular to itself.  Remarkably, the templating to orientation order (handedness and pitch of this rotation) is manifested at length scales several orders of magnitude larger than those molecular constituents.  In self-organized states with both positional and orientational order, like twist-grain boundary (SmC*) <cit.>, helical nanofilament <cit.> and blue phases <cit.>, the mechanisms and outcomes of chirality transfer are often far more complex owing to additional levels of hierarchy introduced in multiple, coupled order parameters. \n\nIn this article we describe the mechanisms of chirality transfer to triply periodic network phases of soft, self-assembling molecules, focusing on a particular example of block copolymer (BCP) melts <cit.>.  On one hand, BCPs provide a prototypical system for understanding self-assembly in a much broader class of supramolecular systems <cit.>.  Beyond this, the chemical versatility of BCPs <cit.> enables numerous routes to engineering nanostructured materials with controlled functions that rely on their complex self-assembled structures.\n\nEven in the absence of intrinsic chirality, triply-periodic networks <cit.> – like the double-gyroid (DG), double-diamond (DD), or double-primitive (DP) phases – are among the most structurally intricate and functionally vital states that form in BCPs and soft supramolecular systems more broadly.  Grossly speaking, these phases are composed of two networks of tubular domains that are divided by a slab-like matrix domain <cit.>, the undulating shape of which closely approximates a finite-thickness variant of the associated triply periodic minimal surface <cit.> (e.g. G or D minimal surfaces, respectively).  The tubular domains – of distinct chemical composition from the matrix region – connect in multi-valent junctions (e.g. 3- and 4-valent connections), with each single constituent network interlinking with its partner to form an intercatened double network <cit.>.  The unique combination of nanoscopic dimensions, polycontinuous topology, and triply periodic symmetries of self-assembled double networks imbue them with remarkable functionality<cit.>, from photonic architectures appearing in birds, beetles, and butterflies <cit.>, to hybrid plasmonic or photonic metamaterials <cit.>.  Notably the most exotic of these targeted properties, such as topologically-protected wave propagation and negative refraction, require control over the centrosymmetry of the networks, in other words, they require chirality at the network scale <cit.>.\n\n\n\n\nAmong the cubic double-network phases, gyroid networks possess a unique capacity for chirality, in that each constituent single-gyroid network is chiral <cit.>.  However, in the simplest case, i.e. linear AB diblock where the composition of each tubular network is the same (say, A-type), the stable DG phase is achiral with two enantiomeric single-gyroid domains arranged in an inversion-symmetric fashion according to the Ia3̅d symmetry <cit.>.  Introducing more components, such as linear ABC triblocks, opens up the possibility of breaking this “exchange symmetry” between network domains, leading to alternating double networks where one tubular network domain is A-type, its complement is C-type, both of which are divided by a B-type matrix <cit.>. Indeed, experimental <cit.> and theoretical <cit.> studies of ABC melts show windows of alternating DG (aDG), the morphology shown in Fig. <ref>, the chirality of this structure can be identified as right- or left-handed, according to the sense of dihedral rotation between the 3-fold axes of adjacent nodes in a single network domain <cit.>.  Although each tubular domain of the aDG is chiral at the mesoscopic network scale(with space group I4_1 3 2) nearly all triblock systems are achiral at the molecular level. Hence, for achiral BCP the chirality of the phase that forms is determined randomly via spontaneous symmetry breaking <cit.>, limiting possibilities to exploit the functional utility of the chiral variant of this complex nanostructure.  \n\nRecent experiments by Wang et al. <cit.> give evidence that the left- vs. right- symmetry is broken in triblocks possessing a chiral A- block (which we refer to as ABC* triblocks), in their case stereopure polylactide (PLLA). Depending on whether the polylactides are D- or L-type, the P(D/L)LA blocks have a preference to compose the single-gyroid domain of a particular handedness, in effect selecting the net chirality of the formed aDG from the chirality of the molecular constituents.  This observation raises a basic question: How does the left- vs. right-gyroid network symmetry couple to the organization of chiral chain segments within those domains?  \n\nPrior studies of chiral diblocks have shown the ability to transfer the chirality of a chain backbone to columnar phases, known as helical cylinder H* phase <cit.>.  These observations have been rationalized by the orientational self-consistent field (oSCF) theory of chiral diblocks, that couples the statistical confirmations of random walking BCPs with gradient free energy of chiral segments within nanophase-separated domains <cit.>.  This oSCF theory links the mesoscopic helicity of H* domains with the threading of handed cholesteric segment twist within the tubular domains of the chiral block, provided that the preference for chiral twist of those segments (i.e. the preferred inverse cholesteric pitch) is sufficiently strong <cit.>.  \n\nIn this article, we describe the mechanism of chirality transfer from the segment-scale to the mesoscale network chirality in this class of chiral ABC BCP based on the orientational self-consistent field  (oSCF) theory.  We show that segmental twist is most pronounced in the (tensorial) nematic order, and surprisingly, reverses the handedness of not only the polar segmental order but also the mesoscopic twist of the single-gyroid domain itself.  We show that this chirality reversal derives from unique features of twist in a biaxial order parameter field.  Finally, we show that the thermodynamics of the subdomain pattern of twist has the ability to select the equilibrium chirality of aDG phases of ABC* triblocks, even in the limit of weakly-anisotropic segmental interactions.\n\n\n\n\n\n§ SELF-CONSISTENT FIELD THEORY OF INTRA-DOMAIN SEGMENT TEXTURE\n\n\nWe begin by analyzing the intrinsic patterns of segmental order in alternating networks of ABC triblocks with isotropic interactions (see Appendix <ref> for details of oSCF theory). In this limit, the enthalpy of segment interactions is described by local coupling of purely scalar composition fields, ϕ_α( ), the volume fraction of type-α(=A,B,C) segments at , with a mean-field free energy of the standard Gaussian chain BCP form <cit.>,\n\n    F_ iso/k_B T = ρ_0 ∫ d^3 {χ_ABϕ_Aϕ_B  + χ_BCϕ_B  ϕ_C  + χ_ACϕ_A  ϕ_C  }\n      - ρ_0 V/N S [ϕ_A , ϕ_B , ϕ_C ] ,\n\nwhere ρ_0 is the segment density, N is the total segment number in chain, V is the total volume and χ_αβ is the Flory-Huggins parameter describing (scalar) interactions between α- and β-type segments. The inhomogeneous composition profiles in combination with the incompressibility constraint, ∑_αϕ_α () =1, lead self-consistently to spatially varying chemical potentials for segments that reduce the random-walk entropy of the total ρ_0 V/N chains in the system, encoded in the mean-field entropy functional S[ϕ_A , ϕ_B , ϕ_C ].  We consider a melt of ABC triblocks composed of N_α = f_α N α-type segments, where N is the total chain length.  We focus mainly on the case of symmetric end blocks f_A=f_C=(1-f_B)/2, equal segment lengths a in each block, and the possibility of segmental chirality only in the A block.   For given (scalar) interaction parameters and block lengths, self-consistent solutions of this isotropic model, eq. (<ref>), solve the equilibrium composition profiles as well as the end-distribution functions q^±(,n), which gives the partial statistical weight of random-walk chain segments diffusing from its respective A or C free ends to the n segment at position , from which the mean-field partition function of the entire chain is Z = ∫ d^3 q^+(,n)q^-(,n) <cit.>.  End-distributions determine not only the scalar composition profiles, ϕ_α() = V/N  Z∫_n∈α dn   q^+(,n)q^-(,n), but also mean-field orientational order parameters <cit.>:  the (vectorial) polar order, \n\n    p_α () = V a/N  Z∫_n∈α dn   J (n,)\n\nwhere J (n,) =  (q^+  q^- - q^-  q^+ )/6; and the (tensorial) nematic order,\n\n    Q_α () = Va^2/N  Z∫_n∈α dn ( K (n,) -  I/3 Tr[ K(n,)] ),\n\nwith the tensor elements K_ij=(q^+ ∂_i ∂_j q^-+q^- ∂_i ∂_j q^+ - ∂_i q^+ ∂_j q^- - ∂_i q^- ∂_j q^+)/60, where I is the identity and i,j,k are spatial indices [Here, we use the result for the large-N (Gaussian) limit of the freely-jointed chain model, which gives identical results for ϕ and p as the Edwards chain (a.k.a. Gaussian thread) model and only a different numerical prefactor for Q <cit.>].  Notably, spatially modulated phases imply anisotropy in the chain configurations, hence all ordered phases imply non-vanishing patterns of both polar and nematic order in the underlying segments, even in the absence of explicit segmental anisotropy.  While p_α () tracks the orientation of segments by distinguishing between the “head to tail” orientation of segments along the chain, the tensorial order parameter Q_α () tracks only the axis of segment alignment, as is familiar to molecular theories of liquid crystallinity <cit.>.\n\nHowever, because these order parameters encode distinct orientational symmetries (i.e. head-to-tail vs. axial orientation) they exhibit quite distinct spatial patterns and magnitudes, even in the same ordered morphology <cit.>.  Crudely speaking, the polar order tends to splay from the center of domains, roughly normally to the inter-material dividing surface (IMDS) between them.  Nematic order is far more complex, showing a narrow zone of tangential alignment at the IMDS as well as a director that shows predominantly normal alignment deep in the brush zone.  Even more significant is that intrinsic nematic order becomes biaxial in curved morphologies, exhibiting a secondary (minor) director field along the axis of convex curvature, in addition to principal normal alignment of the brush-like domains.  Given the coexistence of both types of order and the distinctions between their patterns, it is not a priori clear whether the thermodynamically relevant measure of segment chirality derives from polar or nematic order.  \n\n\n\n\n\n\n§ INTRINSIC TWIST OF ALTERNATING NETWORK DOMAINS: POLAR VS. NEMATIC\n\n\nWe compare the twist of both polar and nematic order parameters, of the A end block, defined in the case of liquid crystals as the lowest-order pseudo-scalar gradients of _A and _A <cit.>,\n\n    Tw_≡_A · (×_A) ;    Tw_≡_A · (×_A),\n\nFor the most commonly studied chiral texture, the uniaxial cholesteric, both Tw_ and Tw_ have a simple interpretation – the (+/-) sign indicates (right/left) handedness of the director winding and the magnitude is inversely proportional to the pitch <cit.>.  Here, we focus on the twist of end-block, A, segments composing a tubular network domain, but in Appendix <ref> we analyze an example of twist in matrix domains, as well as computational details.\n\nIn Fig. <ref>A-B, we compare the distributions of polar and nematic twist of the A-domain in three SCF-predicted alternating network phases of ABC triblocks, right- and left-handed aDG (denoted as aDG_ r and aDG_ l) and the alternating double-diamond (aDD), for the common parameters χ_ABN =χ_BCN =0.37χ_ACN=41 and f_A =f_C= 0.24.  First, we note from the spatial maps (projected on the AB IMDS) that there is a coexistence of regions of positive and negative twist (both polar and nematic) for all networks.  As the aDG_ r and aDG_ l are related by an inversion symmetry, local regions of positive twist on one structure map onto regions of negative twist on the corresponding (inverted) enantiomeric network domain.  \n\nFig. <ref>C plots the spatial average of the A segments of both types of twist as a function of segregation strength for all three networks.  First, we note that there is zero net twist in aDD, which derives from the fact that as a mirror symmetric structure, Fd3̅m, any local “patch” of positive segment twist maps onto an equivalent patch of negative segment twist.  For the chiral aDG domains, on the other hand, positive and negative twist do not balance, and each domain includes an enantiomeric excess of one sign of twist.  The net polar twist, which increases with inter-block segregation strength, is equal and opposite on the two aDG domains following the same sign of twist as the dihedral twist itself (i.e. ⟨ Tw_⟩ <0 in the left-handed network domain and vice versa).\n\nThe nematic twist is similarly non-zero and increasing with segregation strength for the chiral aDG domains. However, it exhibits two key differences from the polar twist.  First, the magnitude of the mean twist, when rescaling for the intrinsic dependencies on the characteristic chain dimension a N^1/2, is significantly greater for nematic order than for polar order.  Second, the net sign of nematic twist is reversed relative to the polar twist as well as relative to the sense of dihedral rotation of the gyroid network itself (i.e. ⟨ Tw_⟩ >0 in the left-handed network domain and vice versa).\n\n\n\nTo understand the stronger magnitude and reversed sense of nematic twist relative to polar, it is illustrative to consider the twist textures in cross-sections of the A-block domain strut of aDG_ l (the planar cut shown in Fig. <ref>C).  First, we note that polar order (Fig. <ref>A) tends to orient radially away from the strut axis in Appendix <ref>. To be more precise, as described previously <cit.> and analyzed in Appendix <ref>, polar order predominantly follows the gradients of segment composition, so that to a first approximate _A ∝  - ϕ_A, which can be expected purely on symmetry grounds for sufficiently weak segregation, and broadly due to the extension of chain trajectories normal to the IMDS.  Because × (ϕ_A) = 0, the polar twist is only non-zero if the polar director deviates from -ϕ_A.  As these deviations are evidently quite small (see Fig. <ref>), it follows that the degree of polar twist is vanishingly small in aDG domains, as well as for any other ordered BCP domain structure, in the absence of orientational segment interactions.\n\nFig. <ref>B shows the the spatial pattern of nematic twist in aDG_ l domain, for comparison. We note again the larger magnitude of scaled nematic twist, but also, and more striking, the spatial regions of local left- vs. right-handed twist in the strut cross-section have largely swapped places relative to polar twist.  For example, along the semi-major directions of the elliptical domain sections, the polar twist is negative (i.e. left-handed) following the dihedral twist of the domain.  In contrast, the semi-minor directions of the cross-section exhibit positive (i.e. right-handed) nematic twist.  We next consider the origins of this reversal of segmental twist.\n\n\n\n\n§ CHIRALITY REVERSAL VIA BIAXIAL TWIST\n\n\n\nThe nature of nematic twist in aDG domains is far more complex because segmental order is biaxial. Unlike biaxial nematic phases of mesogens <cit.>, here biaxiality derives from the anisotropically curved domain shapes realized by BCP packing <cit.>.  A biaxial order parameter <cit.> can be decomposed into the degree of alignment S along a major axis  and a weaker degree of alignment 0<R<S along a minor axis ⊥, where these directions correspond to the principal directions of _A with the largest two eigenvalues,\n\n    (_A)_ij = S (n_i n_j - 1/3δ_ij) + R (m_i m_j - 1/3δ_ij).\n\nNote that both the directors ( and ) and the order parameter magnitudes (S and R) can vary spatially according to the directions and degree of segmental alignment. Note also that the first two directors define a third axis ≡× [It is straightforward to show that the eigenvalues of _A are given by the projections into these principal directions:  (_A)_n n = (2S - R)/3; (_A)_m m = (2R - S)/3; and (_A)_l l = -(S+R)/3.].  Given this parameterization, the nematic twist can be split into three contributions (see Appendix <ref> for details) ,\n\n    Tw_ = S^2 · ( ×) + R^2 · (×) + 2S R [ (·∇) ] .\n\nThe first two terms represent the twist of the major and minor director, respectively, while the third term is unique to the biaxial textures (i.e. S and R are non-zero).  We refer to this as biaxial twist, and it measures the rate of rotation of major and minor directors along the mutually perpendicular co-director , as well as the degree of biaxial order.  \n\n\n\n\nFigure <ref>D-E plots the nematic twist and these three constituent components in the cross-section of the aDG_ l strut in the core of A domain (i.e. in the region ϕ_A ≥ 0.9).  Notably, the spatial pattern and sign of nematic twist follows closely to the polar twist, consistent with the fact that in the core of the domain, the principal nematic director aligns with the polar order parameter (as shown in Fig. <ref>B). Similar tendency of  to lock in orientation along composition gradients also implies a relatively weak measure of major twist, consistent with the vanishingly small magnitude of · (×) in Fig. <ref>E. On the other hand, While there is a reasonably strong degree of minor director twist, · (×), as shown in Fig. <ref>E, the magnitude of alignment in the minor direction is relatively weak (i.e. R^2≪ S^2) and the net contribution from minor twist is negligible.  Finally, the distribution of biaxial twist, in Fig. <ref>D, shows that it is of a substantially larger magnitude and reversed in sense of chirality from major and minor twist.  From Fig. <ref>E, we observe that the frame twist, [ (·∇) ], is comparable in magnitude to the twist of the minor director (with a reversed sense), but as this term is weighted by the product of the magnitude of major and minor axis alignment (i.e. S × R) it dominates the over minor twist.  Because the contribution from biaxial twist dominates over the negligible contributions from the major and minor twist, it sets the net nematic twist and accounts for the reversal of chirality in the nematic order of segments relative to the mesoscopic twist of the aDG networks themselves.\n\n\n\n\nThe geometry of biaxial twist can be illustrated in terms of the integral curves of the co-director , with the local twist corresponding to the frame rotation of  and  along these curves.  Fig. <ref>A shows one such curve within an A domain of aDG_l, which spans between dihedral nodes and winds, like a solenoid, around the strut.  Along these solenoidal trajectories, the rotation of the  and  frame experiences both left- and right-handed regions of twist, as highlighted in Fig. <ref>B, but notably, the degree of biaxiality, as measured by the product S × R also varies around this looping “orbit” as shown <ref>C.  The accumulated rotation of the frame (i.e. integrating the director frame twist along the curves) is plotted in Fig. <ref>D, for a series of varying radial distances r (mid-strut) of orbits relative to the strut. Notably, the frame rotation is net negative, consistent with the overall left-handed writhing of grossly helically winding around the left-handed network strut.  However, the biaxial order in these curves is relatively larger in regions of counter-rotating, right-handed, frame twist, which correspond to the red “top/bottom\" portions of the looping paths in Fig. <ref>A-B.  \n\nWe note that these counter-twisting regions correspond to the most eccentric regions of the elliptical cross-sections in Fig. <ref>, in other words, regions of highly anisotropic domain curvature.  As described previously <cit.>, anisotropic domain curvature is directly correlated with degree of biaxial segment order in BCP domains.  Hence, the co-location of counter-twist and enhanced biaxiality leads these “counter-revolutionary\" pockets of segmental order to dominate the net nematic twist in gyroidal networks, that is, they make left-handed network domains overall more favorable to right-handed twist. This bias of strong biaxiality in counter-twisting regions is evident in the 2-point histograms within the A domain of aDG_l showing the frequency of points as a function of both their frame twist, [ (·∇) ], and S × R. While points are apparently nearly evenly distributed between right- and left-handed frame twist, right-handed twist regions tend to skew towards larger biaxial order, biasing the product of these quantities (the biaxial twist) to positive (i.e. right-handed) values for a left-handed gyroid network domain. Overall, this analysis reveals how biaxiality, qualitatively and quantitatively, alters the nature of chiral organization, particularly in cases where the principal director is predominantly locked to the normals of iso-density in a SmA-like fashion.  \n\n\n\n\n§ THERMODYNAMICS OF ALTERNATING NETWORKS IN ABC* TRIBLOCKS: WEAK CHIRALITY\n\n\nWith the analysis for the intrinsic twist in ABC networks (i.e. with isotropic segment interactions) in mind, we consider the thermodynamic consequences for the coupling of self-assembly to segmental chirality in ABC* triblocks.  The dominance of nematic twist over the polar twist in aDG domains argues that the most significant anisotropic chiral interactions have nematic symmetry, and to a good approximation the effects of potentially polar interaction terms can be neglected. As such, the minimal free energy model includes the lowest gradients in _A familiar from the -tensor theories of chiral mesogens (e.g. blue phases) <cit.>,\n\n    F^*_ nem[ _A] = 1/4∫ d^3  x{ K_0 [ (∇·_A)_i ]^2  \n      + K_1  [(∇×_A)_ij+2 q_0 (_A)_ij]^2},\n\nwhere (∇·)_i=_j Q_ij, (∇×)_ij= ϵ_i l k_l Q_kj and summation over repeated indices is implied. Here K_0 and K_1 are elastic constants for divergence and curl of _A, which we set onto an equal value K = K_0 = K_1 for this study [Elastic constants for the tensor order parameter, K_0 and K_1, can be related to the standard Frank constants for the nematic director for splay, twist, and bend as well as gradients of S, for uniaxial textures. <cit.>]. Segmental chirality, q_0 ≠ 0, parameterizes the free energy preference for non-zero segment twist:  q_0 >0 corresponds to a preference for ⟨ Tw_⟩ <0, which is a  thermodynamic bias for left-handed cholesteric twist. Incorporating chiral (nematic) segment interactions leads to a total free energy that combines the (mean-field) enthalpy and entropy of the scalar BCP melt model, eq. (<ref>), with the chiral nematic gradient free energy of eq. (<ref>),\n\n    F_ tot = F_ iso +F^*_ nem .\n\nIn general, anisotropic segment interactions lead to a self-consistent coupling of random-walk chain configurations and the orientational order parameters, which take the form of self-consistent locally-aligning fields <cit.>. However, for the purposes of the present study, we restrict our attention to the limit of weakly-anisotropic segmental interactions. As described in Appendix <ref>, formally this limit corresponds to a thermodynamic expansion in the elastic constant K, where the lowest order term derives simply from computing chiral nematic gradient contribution in eq. (<ref>) above, from the intrinsic nematic texture, i.e. the biaxial state _A (K → 0), analyzed above in Figs. <ref>- <ref>.  \n\n\n\n\n\nTo assess the thermodynamic consequence of intrinsic twist on the assembly of alternating networks of ABC* triblocks, we consider two regions of the large parameter space of ABC triblocks <cit.>, in particular symmetric end-block composition (f_A=f_C), with unfrustrated interactions (χ_AB N = χ_BC N=0.37χ_AC N), for relatively weak (χ_AB N = 16) and intermediate (χ_AB N = 26) segregation strengths, and for a range of effective chiral coupling strengths q_0 (see Appendix <ref>). We first discuss the intermediate segregation, shown in Fig. <ref>A.  As in the case of purely scalar interactions, studied previously in ref.  <cit.>, with increasing mid-block fraction, we observe a sequence of alternating lamellar (Lam) to aDG - alternating (square) cylinder (aCyl) to alternating (BCC) spheres (aSph) phases.  However, it is important to note that for any q0 ≠ 0 the left vs. right aDG degeneracy is broken, and again, due to the predominance of biaxial twist in aDG domains, the thermodynamically selected network chirality is of the reversed handedness with respect to the sense of cholesteric segment twist preferred by same sign of q_0.  The expansion of the windows of stable chiral aDG phases relative to achiral competitors with increasing strength of segmental chirality q_0, is another notable effect which derives from the unique natural twist of segment packing in gyroidal domains, even in the absence of chirality in constituent segments themselves.  \n\nFig. <ref>B shows a similar composition-chirality plane for weaker segregation, as previously reported <cit.>, this regime includes a stability window of aDD intermediate to aDG and aSph.  Again, we note that outward tilt of aDG/aDD phase boundaries with increasing q_0. Given the appearance of a triple point between aDG_ r, aDG_ l and aDD in this phase diagram, it is interesting to note that Wang et al. observe that PI-PS-PLA with racemic lactic acid blocks form at aDD phase, while the stereopure (L or D type) PLA blocks lead to chiral aDG phases <cit.>.  This suggests that the experimental system may be similarly placed close to a triple point between these three phases, though it remains to be understood how to precisely map the magnitudes of chiral nematic free energy parameters onto this experimental system, and more generally, how the broader structure and stability of alternating diblock phases will vary as segmental interactions become larger. For sufficiently strong anisotropic and chiral interactions, it can be expected that the twist in segment packing alters the shape of the composition profiles themselves away from the intrinsic, or isotropic, SCF model predictions <cit.>.\n\n\n\n\n§ CONCLUSION\n\n\nIn summary, we have shown that chirality transfer in alternating network phases of BCPs falls into an unusual category. The preference for handed rotation at the molecular level (backbone orientation of chiral blocks) is a reverse sense of the thermodynamically selected mesoscopic twist of the cubic network (inter-node dihedral). The scenario relies on the fact that the twist of both the polar order parameter and the principal director of the nematic order parameter are screened by strong SmC-like anchoring to the scalar composition gradients. The residual, dominating twist, therefore, emerges from the strongly biaxial texture of segmental order in BCP gyroids, and its specific chiral gradients.  Notably this “anti-sense\" coupling to mesoscopic chirality of the network is also distinct from recently explored mechanisms of mesogenic packing and chirality transfer in gyroidal liquid crystal phases <cit.>, wherein the principal director is understood to co-rotate with the “easy” 70.5^∘ inter-nodal twist shown in Fig. <ref>.  \n\nWe also note that this mechanism of chirality transfer is distinct from previously studied mechanisms for BCP*s, notably for H* and DG phases of chiral diblocks <cit.>.  In those cases, in the absence of segmental chirality, the equilibrium phases are achiral. To overcome the entropic coupling that locks the director to composition gradients, the free energy gain for threading chiral segment packing must be sufficiently strong. This leads to a threshold value of q_0 below which the structure remains mesoscopically achiral; and above which it breaks inversion symmetry.  In this case, equilibrium alternating networks of ABC triblocks spontaneously break chiral symmetry. The preference for chiral segment packing needs to only tip the balance between otherwise thermodynamically degenerate enantiomeric phases. Hence, at the mean-field level, chirality transfer occurs in the limit of arbitrarily weak chiral strength. It remains to be studied, how the domain shapes of alternating networks are modified in the presence of strong nematic chiral couplings, which could, in principle, “unwind\" the handedness reversal effect studied here for weak chirality and would be consistent with the twist preferences of (polar) strongly chiral diblocks in the DG assemblies <cit.>.  If that were the case, it would suggest an even more complex scenario, where the left vs. right. handedness selection of network formed by the chiral block in alternating gyroids is itself a function of the chiral strength, switching from anti-chiral to homo-chiral transfer when going from weakly to strongly chiral BCP* systems.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nThe authors are grateful to E. Thomas, R.-M. Ho and R. Kamien for valuable discussions regarding this work, and further to C. Burke for input on resolution limits of intra-domain twist.  This research was supported by US AFOSR under Asian Office of Aerospace Research and Development Award 18IOA088.  Simulations where performed using the UMass Cluster at the Massachusetts Green High Performance Computing Center.\n\n\n\n\n\n\n§ ORIENTATIONAL SELF-CONSISTENT FIELD THEORY\n\n\n\nHere we summarize the key theoretical ingredients for the oSCF theories of ABC triblocks with generalized couplings between freely-jointed chain random walks and either polar or nematic orientational field interactions.  The complete details and derivations of this formalism can be found in refs. <cit.>.  Here, we describe only elements necessary to analyze chirality transfer in the limit of weakly anisotropic couplings. \n\nIn general, we consider mean-field interactions of the form described by local functions of the order parameters. For example, the standard (Flory-Huggins) model of chain mixtures includes an enthalpic free energy of interactions between unlike components in terms of overlap between scalar composition profiles, ϕ_α (), which for the case of ABC copolymers, this takes the form,\n\n    F_ scal[ ϕ_α () ] = ρ_0 ∫ d^3 {χ_ABϕ_A ϕ_B  +χ_BCϕ_B ϕ_C \n     +χ_CAϕ_C ϕ_A } .\n\nAdditionally, we consider the possibility of orientational interactions described by functionals of either vector (polar) or tensorial (nematic) form, F_ pol[  p_α () ] and F_ nem[  Q_α () ], respectively. Where these functionals depend on local values of the order parameters and their gradients. These orientational couplings give rise to self-consistent vectorial and tensorial fields, which are denoted as w_α and W_α respectively, representing the anisotropic interactions between chain segments at the mean-field level, and derive from the saddle point equations:\n\n    w_α, i ( x ) = ρ_0 δ F_ pol/δ p_α,i ( x ) ,\n\nand \n\n    W_α, ij ( x ) = ρ_0 δ F_ nem/δ Q_α,ij ( x ) ,\n\nwhere index α refers to chemical component (i.e. A, B, or C type) and i and j are spatial indices.  These anisotropic interaction fields bias the random-walk chain statistics through diffusion-like equations for the segment distributions, q^±( x, n), given respectively by, \n\n    ±∂ q^±/∂ n = 1/6[a ∇ - w_α ()]^2 q^± - ω_α( x ) q^±,       (polar)\n\nand \n\n    ±∂ q^±/∂ n = a^2/6∇^2 q^± -a^2/15∂_i [ W̃_α, ij( x) ∂_j q ]  - ω_α( x ) q^±,       (nematic) ,\n\nwhere W̃_ij = (W_ij-W_ji)/2- (δ_ij/3)  Tr  [  W] is the traceless, symmetric part of W_ij and ω_α( x ) is the self-consistent chemical potential fields that couple to the scalar composition profiles for component α.  The self-consistency conditions for the  ω_α ( x) fields follow from the standard saddle-point conditions relating to the functional derivatives δ F_ scal/δϕ_α ( x) and the incompressibility constraint, ∑_αϕ_α ( x ) =1.  As the anisotropic self-consistent fields bias the random walk statistics of chains, they couple to the mean-field orientational order parameters, providing a complete set of self-consistency conditions for the generalization of block copolymer melts to the case of anisotropic interactions:\n\n    p_α ( x) = V/6 N Z∫_n ∈α dn [ a  J (, n) - 2  w ( x) q^+ q^-] ,       (polar)\n\nand \n\n    Q_α () = V/N  Z∫_n∈α dn {a^2 (  K (, n) -  I/3 Tr[ K(, n)] ) \n     - 8 W̃( x) q^+ q^-},       (nematic)\n\nwhere J (, n) and K (, n) are vectorial and tensorial segment-flux operators defined in the main text.\n\nIn the limit where the anisotropy goes to zero (i.e. F_ pol→ 0 and F_ nem→ 0), the self-consistent vectorial and tensorial fields vanish.  In this case,  p_α Q_α derive only from spatial derivatives of q^±(n,), corresponding to the form of the “intrinsic” polar and nematic order parameters given in the main text eqs. (2) and (3).\n\nWe note that these intrinsic order parameters have an explicit dependence on N which can be deduced by considering the natural length scales of the microphase separation. The characteristic size of BCP domains scale with the r.m.s. size of an unperturbed Gaussian chain, N^1/2a, with an additional dependence on values of χ_αβ N and f_α.  This implies that all spatial variation in q^± occurs on a length scale that grows as N^1/2a.  Hence, spatial derivatives of the form that enter eqs. (2) and (3) in the main text are made dimensionless by multiplication by N^1/2a (i.e. ∂̅_i → N^1/2a ∂_i).  Recasting these derivative conditions in terms of reduced coordinates, it is clear that N^1/2 p_α and  N  Q_α are functions that only depend on χ_αβ N and f_α.  \n\n\n\n\n§ INTRINSIC ORDER PARAMETER AND TWIST\n\n\n\nTo evaluate the intrinsic order parameters, and the sub-domain patterns of twist, we compute the chain distribution functions q^±(n,) for ABC triblocks using the PSCF code <cit.>.  We then compute the polar and nematic order parameters using eqs. (<ref>) and (<ref>), and a finite-difference approximation to the spatial derivatives of q^±(n,) defined on the computational grid of the SCF solution.  \n\nPolar and nematic order parameters require spatial derivatives of q^±(n,) and the resolution of segment twist is another spatial derivative of the order parameter. Thus, converged oSCF solutions require especially high grid resolution, even beyond the demands for the free energy of standard SCF theory (i.e. isotropic Flory interactions) <cit.>. To determine the resolution limits of twist calculations we analyze the nematic twist (which requires higher resolution than polar twist) as a function of the grid resolution in Fig.  <ref>. We observe that nematic twist eventually converges with sufficiently large numbers of spatial grid points, in a way that increases with the segregation strength.  Fitting that limiting convergence to an asymptotic power law, we extrapolate to limiting values in the hypothetical infinite grid resolution limit. Results for Fig. <ref>C are based on 320^3 grid elements, while the phase diagrams, at much lower segregation strengths, are based on 192^3 spatial grids.  \n\n\n\n\nIn Fig. <ref>, we consider the mean nematic twist in all three domains of an aDG phase for the variable asymmetry between the end blocks for a fixed midblock fraction f_B=0.52.  This shows that when f_A ≠ f_C the matrix itself also develops a net chirality in segment twist.  Notably, the decreasing length relative length one of the two ends (say, the A block) leads to a transfer to the chirality of twist from the tubular domain to the matrix.  For example, when f_A < f_C the net twist of the matrix layer has the sign of the A domain twist, and this behavior inverts when f_A > f_C.\n\n\n\n\n\n\n§ ALIGNMENT OF POLAR AND NEMATIC DIRECTORS WITH COMPOSITION GRADIENTS\n\n\n\n\nRef.  <cit.> described the general “anatomy\" of the segmental order parameters of BCP domains in detail.  Here we focus on the relative alignment between polar order parameter and isocontours of segment composition for the A domain, composing a single gyroid domain of aDG.  The isocontours of density are normal to -∇ϕ_A/|∇ϕ_A|, and in Fig. <ref>A we plot the histogram of the dot product of p̂_A and these isocontour normals, showing that these directions are predominantly parallel.  The principal director of nematic order is in general more complex due to a strong tangential alignment effect that takes place at the IMDS.  However, as the interface between network A and matrix B is very narrow is well-segregated morphologies, this tangentially aligning zone makes up a small fraction of the morphology.  As a consequence polar, and principal directors of the nematic, are on average very well aligned, as shown in Fig. <ref>B.  \n\n\n\n\n\n§ DECOMPOSITION OF BIAXIAL TWIST\n\n\n\nWe decompose the twist of  a biaxial nematic order parameter parameterized by a principal director, , and biaxial director, , which are mutually perpendicular (i.e. ·=0), and the Q_ij tensor,\n\n    Q_ij =Q^n_ij+  Q^m_ij ,\n\nwhere,\n\n    Q^n_ij= S ( n_i n_j - δ_ij/3) ;  Q^m_ij= R ( m_i m_j - δ_ij/3) ,\n\nwhere magnitudes S and R, along with directors, may vary in space.  We can relate this description to the three principal eigenvalues of Q_ij,\n\n    λ_1 = 1/3 (2S - R) ;  λ_2 = 1/3 (2R - S) ;  λ_3 = -1/3 (S + R) .\n \nFrom this we compute the twist of the tensor OP,\n\n    Q·( × Q ) =  Tw_n+ Tw_m+ Q^n ·( × Q^m  )+ Q^m ·( × Q^n  ) ,\n\nwhere Tw_μ =  Q^μ·( × Q^μ ) is simply the twist of the principal or secondary (biaxial) director, e.g.\n\n    Tw_n = Q^n_ijϵ_jkℓ∂_k Q^n_ℓ i\n     =Q^n_ijϵ_jkℓ[ (∂_k S) ( n_ℓ n_i - δ_ℓ i/3)+ S(n_i ∂_k n_ℓ+n_ℓ∂_k n_i) ] \n    \n      = S(∂_k S) /3ϵ_jkℓ( n_ℓ n_j + δ_ℓ j/3) + 2S^2/3 n_j  ϵ_jkℓ∂_k n_ℓ\n     - S^2/3ϵ_jkℓ n_ℓ∂_k n_j = S^2 · (× )\n\n where we used the fact that terms that are symmetric in any two indices vanish when contracted with ϵ_jkℓ.  Note that the index μ = n, m refers to the principal or secondary component of Q.  Likewise, Tw_m =R^2  · (× ).  Notice that gradients of the OP magnitudes do not generate unaxial twist.  \n \nNow we examine the cross term, Q^m ·( × Q^n  ), beginning with the curl tensor,\n\n    ( × Q^n  )_ij = ϵ_jkℓ[ (∂_k S) ( n_ℓ n_i - δ_ℓ i/3)+ S(n_i ∂_k n_ℓ+n_ℓ∂_k n_i) ] ,\n\nWhen we contract the first term with Q^m_ij we get\n\n    R (∂_k S)   ϵ_jkℓ( m_i m_j - δ_ij/3)  ( n_ℓ n_i - δ_ℓ i/3) \n     = - R (∂_k S)  /3ϵ_jkℓ (n_ℓ n_j +m_ℓ m_j ) = 0\n\nwhere we have used · =0 and the symmetry of (n_ℓ n_j +m_ℓ m_j ) under the interchange of indices.  Now contracting Q^m_ij with the second term in the curl tensor ( × Q^n  )_ij\n\n    S R   ϵ_jkℓ( m_i m_j - δ_ij/3) n_i ∂_k n_ℓ= -S R/3ϵ_jkℓ n_j∂_k n_ℓ\n     =-S R/3· (× ) .\n\nContracting Q^m_ij with the third term in the curl tensor ( × Q^n  )_ij gives\n\n    S R   ϵ_jkℓ( m_i m_j - δ_ij/3) n_ℓ∂_k n_i \n     =S R [ m_i (∂_k n_i)    ϵ_jkℓ  m_j n_ℓ  - 1/3ϵ_jkℓ   n_ℓ∂_k n_j ] \n     = SR {·[ (·) ] + 1/3· (× ) } ,\n\nwhere\n\n    = × ,\n\nis the eigendirection of the smallest eigenvalue of Q.  Combining all three terms we have,\n\n    Q^m ·( × Q^n  ) =SR ·[ (·) ] .\n\nFor the other “cross twist\" term we have\n\n    Q^n ·( × Q^m  ) =SR n_i (∂_k m_i)    ϵ_jkℓ  n_j m_ℓ\n     = - SR ·[ (·) ] =  SR ·[ (·) ]  ,\n \nwhere we used the fact that ∂_i (·) =0 so, ·( ∂_i ) = -·( ∂_i ). \n\nThus, putting the pieces together we have three total terms in the OP twist,\n\n    Q·( × Q ) = S^2   · (× )+R^2  · (× )+ 2SR  ·[ (·) ]  .\n\n\n\n\n\n§ MEAN FIELD THERMODYNAMICS OF CHIRAL NEMATIC ABC* TRIBLOCK MELTS: WEAKLY-ANISOTROPIC LIMIT\n\n\n\n\nHere we derive the weakly-anisotropic limit of the chiral nematic model of ABC triblocks described in the main text, summarized by the gradient free energy expression in eq. (<ref>) (i.e. with chiral anisotropic mean-field interactions in A block only). Following the eq. (<ref>), we have the self-consistent tensorial field equation\n\n    W_A, ij ( x ) = ρ_0 δ F_ nem/δ Q_A, ij ( x ) \n     = ρ_0 K {-1/4∇^2 ( Q_A)_ij+2 q_0 (∇× Q_A)_ij+q_0^2 ( Q_A)_ij}\n\nwhere again we are considering the single constant approximation K_0=K_1=K.  \n\nWe now consider solutions of the self-consistent equations in the limit of weakly-anisotropic interactions, which is based on a thermodynamic perturbation expansion around the K → 0 limit, which is the case of the standard (purely scalar) SCF theory <cit.>, referred to here as the “intrinsic field” limit.  Following standard perturbation theory approaches, we denote the values of self-consistent fields g() as an expansion in powers of K,\n\n    g() = g^(0) () + K g^(1) () + K^2 g^(2) ()  …\n\nwhere g^(M)() describes the K^M order correction to the intrinsic field limit of the field  g().  Based on this definition and the form of eq. (<ref>), it is clear that intrinsic limit of tensorial self-consistent field vanishes, i.e. W_A^(0) = 0, where as all other self-consistent field quantities remain non-zero in this limit, most notably the nematic tensor field itself (i.e. Q_A^(0) is given by equation (3) in the main text).  The total free energy then has the form,\n\n    F = F^(0) + K/4∫ d^3 x { K_0 [ (∇· Q^(0)_A)_i ]^2 \n     + K_1  [(∇× Q_A^(0))_ij+2 q_0 ( Q_A^(0))_ij]^2} +  O(K^2)\n\nwith the second term corresponding to the lowest order non-vanishing correction to the intrinsic field limit due to anisotropic segment interactions.  Note that because the intrinsic limit is a saddle point with respect to the scalar fields, corrections to the free energy due to first-order corrections in ϕ_α and ω_α lead to corrections of the mean-field free energy at O(K^2). Therefore, in the limit of K → 0, we consider only the first-order contribution of anisotropy, as in eq. (<ref>), deriving from the chiral nematic gradient free energy of the intrinsic field Q^(0)_A.\n\nTo evaluate the free energies of competing morphologies in Fig. <ref>, we compute the intrinsic limit SCF solutions for competing phases for a variable range of domain periodicities centered around the equilibrium state (i.e. in the absence of anisotropic interactions).  We then evaluate the nematic order parameters of the A block and compute the gradient free energy contributions from eq. (<ref>).  Combining these with the isotropic mean free energies in eq. (<ref>), we minimize the total free energy over the domain periodicities, which may shift the equilibrium domain spacing by a few percent.  \n\n\n\n\n\n"}