{"entry_id": "http://arxiv.org/abs/2303.07058v1", "published": "20230313122741", "title": "The energetic particle environment of a GJ 436 b-like planet", "authors": ["D. Rodgers-Lee", "P. B. Rimmer", "A. A. Vidotto", "A. J. Louca", "A. M. Taylor", "A. L. Mesquita", "Y. Miguel", "O. Venot", "Ch. Helling", "P. Barth", "E. Lacy"], "primary_category": "astro-ph.EP", "categories": ["astro-ph.EP", "astro-ph.SR"], "text": "\n\nfirstpage–lastpage xxxx\nTracing chirality from molecular organization to triply-periodic network assemblies: \n \nThreading biaxial twist through block copolymer gyroids\n\n    Gregory M. Grason\n    Accepted xxxx xxxxxx xx. Received xxxx xxxxxx xx; in original form xxxx xxx xx\n================================================================================================================================================\n\n\n\n\n\n\nA key first step to constrain the impact of energetic particles in exoplanet atmospheres is to detect the chemical signature of ionisation due to stellar energetic particles and Galactic cosmic rays. We focus on GJ 436, a well-studied M dwarf with a warm Neptune-like exoplanet. We demonstrate how the maximum stellar energetic particle momentum can be estimated from the stellar X-ray luminosity. We model energetic particle transport through the atmosphere of a hypothetical exoplanet at orbital distances between a=0.01-0.2au from GJ 436, including GJ 436 b's orbital distance (0.028 au). For these distances we find that, at top-of-atmosphere, stellar energetic particles ionise molecular hydrogen at a rate of ζ_ StEP,H_2∼ 4×10^-10-2×10^-13 s^-1. In comparison, Galactic cosmic rays alone lead to ζ_ GCR, H_2∼2× 10^-20-10^-18 s^-1. At 10au we find that ionisation due to Galactic cosmic rays equals that of stellar energetic particles: ζ_ GCR,H_2 = ζ_ StEP,H_2∼ 7×10^-18 s^-1 for the top-of-atmosphere ionisation rate. At GJ 436 b's orbital distance, the maximum ion-pair production rate due to stellar energetic particles occurs at pressure P∼ 10^-3bar while Galactic cosmic rays dominate for P>10^2bar. These high pressures are similar to what is expected for a post-impact early Earth atmosphere. The results presented here will be used to quantify the chemical signatures of energetic particles in warm Neptune-like atmospheres.\n\n\n\n\nplanetary systems – planets and satellites: atmospheres – cosmic rays – methods: numerical – stars: low-mass – stars: winds, outflows\n\n\n\n\n§ INTRODUCTION\n\n\n\nSpectroscopic observations with JWST <cit.> and future dedicated exoplanet missions, such as Ariel <cit.>, will characterise the composition of exoplanet atmospheres. Chemical models have predicted that energetic particles lead to specific chemical signatures in exoplanet atmospheres, such as H_3O^+ for gas giants <cit.>. <cit.> produced synthetic JWST and Ariel transmission spectra of a sub-Neptune and showed that absorption due to H_3O^+ should be observable. The detection of such a chemical signature would be a key step to constrain the energetic particle fluxes impacting on planets outside the solar system. Here, we focus on modelling the fluxes of two types of energetic particles: stellar energetic particles from the host star (also known as stellar cosmic rays) and Galactic cosmic rays from the interstellar medium (ISM).   In the future, it may be possible to disentangle the effect of stellar energetic particles and Galactic cosmic rays by detecting chemical signatures of energetic particles for exoplanets at different orbital distances <cit.>.\n\nGalactic cosmic rays interact with, and their fluxes are suppressed by, the magnetised winds of low-mass stars (e.g. <cit.> for the Sun and <cit.> for solar-like stars). Previous studies have focused on calculating the Galactic cosmic ray fluxes in the habitable zone <cit.> and at the orbital distance of known exoplanets for a number of well-studied solar-type <cit.> and M dwarf stars <cit.>. \n\nHere, our aim is to combine the energetic particle transport through the stellar system with the subsequent transport through the exoplanet atmosphere. We relate the maximum energy of the stellar energetic particles accelerated by stellar flares to stellar magnetic field strength, following <cit.>, and show how this can be related to stellar X-ray luminosity. Previous studies  have investigated the distribution of stellar energetic particles in the Trappist-1 and AU Mic systems <cit.>. In the latter case, following a perturbation of the interplanetary medium by a coronal mass ejection (CME). Separately, the propagation, and chemical effect, of energetic particles through a number of Earth-like <cit.> and hot Jupiter/brown dwarf <cit.> atmospheres has been studied. \n\nHere, we focus on the environment of the warm Neptune exoplanet GJ 436 b. GJ 436 b is scheduled for JWST observations and is also an Ariel target <cit.>. We calculate the ionisation rate, ion-pair production rate and skin-depth equivalent dose rate due to energetic particles at different heights in the exoplanet atmosphere. In addition to studying GJ 436 b, we also investigate the effect of artificially changing the exoplanet's orbital distance on these quantities. The energetic particle ionisation rate is an important input for studying disequilibrium chemistry in exoplanet atmospheres, with chemical kinetic models such as ARGO <cit.>. Here, for simplicity, we do not account for the effect of planetary magnetic fields. However, planetary magnetic fields will reduce the energetic particle fluxes penetrating the exoplanet atmosphere <cit.>. \n\nThis study has been separated into two companion papers. This paper (Paper I) focuses on characterising the energetic particle environment of a GJ 436 b-like planet. The paper is structured as follows: Section <ref> introduces the models that are used for the energetic particle transport and in Section <ref> our results are presented. The discussion and conclusions are given in Sections <ref> and <ref>. Paper II () will focus on the chemical consequences of the energetic particles for this system.\n\n\n\n\n\n\n§ ENERGETIC PARTICLE SPECTRA\n\n\n\nWe consider the transport of both Galactic cosmic rays from the ISM and stellar energetic particles, described in Sections <ref> and <ref>. In this section we also describe our method to construct the stellar energetic particle spectra. Fig. <ref> shows a schematic of the system indicating the two sources of energetic particles. The exoplanet atmosphere profiles that we use are described in Section <ref>. Using these, we then model the energetic particle propagation through the exoplanet atmosphere, which is described in Section <ref>. \n\n\n\n\n\n §.§ Galactic cosmic ray fluxes\n\n\nThe Galactic cosmic ray fluxes throughout the GJ 436 system were previously calculated <cit.> using a diffusion-advection cosmic ray transport model <cit.>. The stellar wind velocity and magnetic field profile are important quantities to model the cosmic ray transport through the stellar system. The Galactic cosmic ray fluxes that we adopt here correspond to `Case A' from <cit.>, using the stellar wind properties from <cit.>. Fig. <ref> shows the differential intensity, j (i.e. the number of energetic particles per unit area, steradian, time and kinetic energy), as a function of energetic particle kinetic energy for the Galactic cosmic rays. The black line represents the Galactic cosmic ray fluxes at the orbital distance of GJ 436 b (∼0.03au). The coloured lines represent j at the different orbital distances between a=0.01-0.2au. For the temperature pressure profiles in Section <ref>, we focus on a range of orbital distances between a=0.01-0.2au in increments of 0.01 au. We select the Galactic cosmic ray fluxes from the cosmic ray transport model closest to these orbital distances. However, the cosmic ray transport uses a logarithmic grid and due to the model resolution some of the lines overlap. This occurs at larger orbital distances, for a>0.11 au in all but one case, where the fluxes are already very similar (see Fig. <ref>). Thus, the overlap will not affect our results significantly. The Galactic cosmic ray fluxes vary significantly for ≲ 10GeV energy cosmic rays depending on the orbital distance considered. The fluxes for ≲ 10GeV energy cosmic rays are also much smaller than the values observed at Earth <cit.> at all of the orbital distances considered here.\n\nCase A corresponds to a stellar wind model which is more magnetically-dominated than the more thermally-dominated wind <cit.>. Fig. 2 from <cit.> shows the stellar wind velocity and magnetic field profiles for Case A and B. For Case A, the surface stellar magnetic field adopted was B_⋆=4G, the stellar wind terminal velocity, v_∞, was found to be 1250 km s^-1 and the stellar mass loss rate was Ṁ_̇⋆̇=1.2× 10^-15M_⊙  yr^-1. The astrospheric size (R_ast), which determines how far the Galactic cosmic rays must travel through the stellar wind, was calculated using v_∞ and Ṁ_̇⋆̇ to be 33 au <cit.>.\n\nAnother important quantity for the transport model is the assumed Galactic cosmic ray spectrum outside of the astrosphere. A model fit to the local interstellar spectrum (LIS) for Galactic cosmic rays <cit.> from Voyager 1 data <cit.> was used as the boundary condition for these simulations. Finally, the assumed turbulence properties for the stellar wind are important by dictating the diffusion of the Galactic cosmic rays from the ISM through the astrosphere. For more details see <cit.>. \n\n\n\n §.§ Stellar energetic particle fluxes\n\n\nUnlike the LIS for Galactic cosmic rays, less is known about stellar energetic particle spectra. It is generally assumed that stars more active than the Sun will produce higher fluxes of stellar energetic particles <cit.>. The higher flux is expected due to the increased flare energies and flaring rate of active stars <cit.>.\n\nIt is also very likely for active stars that stellar energetic particles will be accelerated to higher energies than for the Sun. The Sun itself has been inferred to accelerate particles to GeV energies from γ-ray observations <cit.>. Considering the maximum energy that stellar energetic particles are accelerated to by their host star is important because the energy loss rate for energetic particles is energy dependent. The energy loss rate for GeV energy particles is much lower than for ∼MeV energy particles <cit.>. Thus, GeV energy particles are far more penetrating than ∼MeV energy particles and can, for instance, lead to showers of secondary particles that can reach the surface of a rocky exoplanet <cit.>.\n\nFollowing <cit.>, there are three quantities that we use to obtain a stellar energetic particle spectrum. These are (i) the power law index for the spectrum, (ii) the total energy available to produce stellar energetic particles and (iii) the maximum stellar energetic particle momentum (p_ max) before the spectrum decays exponentially. The power law index is set to be α=2 <cit.> such that dN/dp ∝ p^-αe^-p/p_ max, where N and p are the number and momentum of the particles, respectively. The total luminosity injected in stellar energetic particles (L_CR) that we adopt is 0.1P_SW, where P_SW=Ṁ_̇⋆̇v_∞^2/2 is the stellar wind kinetic power. This is in line with efficiency estimates from supernova remnants <cit.>. We calculate L_CR=6× 10^25 erg s^-1 for GJ 436 with Ṁ_̇⋆̇=1.2× 10^-15M_⊙  yr^-1 and v_∞=1250  km s^-1.\n\n\n\n  §.§.§ Maximum stellar energetic particle momentum\n\nIn <cit.>, the Hillas criterion <cit.> was used to estimate the maximum stellar energetic particle momentum that the Sun would have accelerated particles to in the past. The Hillas criterion posits that the maximum energy achieved by an accelerator is limited by the accelerator size, i.e. if the accelerated particle's Larmor radius is larger than the accelerator region it will escape. Using the Hillas criterion, the maximum momentum, p_max, of accelerated particles from a star can be expressed as \n\n\n    p_max/p_max,⊙ = ( β_⋆ B_⋆ R_⋆/β_⊙ B_⊙ R_⊙)\n\n\n\n\n\nwhere R_⊙ and R_⋆ are the solar and stellar radii, respectively.   B_⊙ and B_⋆ are the surface solar and stellar magnetic field strengths, respectively. B_⊙=1.3G and p_max,⊙=0.2GeV/c. The parameters β_⊙ and β_⋆ are the solar and stellar shock velocity in units of the speed of light, respectively. Here, we assume β_⋆∼β_⊙ as a first approximation. We consider flare accelerated particles injected at ∼1.4R_⋆ rather than particles accelerated by CMEs <cit.>. Eq. <ref> is the same as Eq. 7 from <cit.> for the Sun. The only difference is that R_⋆ is also included in Eq. <ref>.\n\nThe Zeeman Doppler Imaging (ZDI) technique has provided average large-scale stellar magnetic field strengths for hundreds of low-mass stars <cit.>. This technique has traditionally focused on active stars which generally have strong magnetic fields, best suited for the observations. However, transiting exoplanets are typically detected around less active stars because increased stellar activity, in the form of stellar spots, tends to obscure exoplanet signatures. Thus, the overlap between these samples is currently extremely limited and stellar magnetic field strengths for less active stars often must be estimated. For instance, <cit.> presented the relation between stellar X-ray luminosity (L_ X) and the large-scale magnetic flux (Φ) derived from a large sample of stars with ZDI maps, as \n\n\n    L_ X≈ 10^-13.7Φ^1.80± 0.20erg s^-1\n\n\nwhere Φ = 4π R_⋆^2⟨ |B|⟩ (Mx) and ⟨ |B|⟩ is the average large-scale magnetic field strength derived using the ZDI technique. Using Eq. <ref>, we can now re-write Eq. <ref> in terms of L_ X as\n\n\n    p_max/p_max,⊙   =   ( B_⋆ R_⋆^2/B_⊙ R_⊙^2 ) (R_⊙/R_⋆) = (Φ/Φ_⊙) (R_⊙/R_⋆) \n       =   ( L_ X,⋆/L_ X,⊙)^γ(R_⊙/R_⋆).\n\n\nwhere γ = 0.56^-0.06_+0.125. Thus, in the absence of a magnetic field strength measurement the maximum stellar energetic particle momentum can be estimated using the stellar X-ray luminosity. Here however, we have used B_⋆=4 G for GJ 436 to be consistent with <cit.>[As mentioned in <cit.>, B_⋆=4 G was chosen because the stellar wind model from <cit.> with this B_⋆ value predicts an X-ray luminosity that is consistent with what is observed for GJ 436.]. This results in p_ max=0.3GeV/c using Eq. <ref>. In comparison, using Eq. <ref>, we find p_ max = 0.1-0.7 GeV/c for L_ X,⊙ = 2.7× 10^26-4.7×10^27  erg s^-1 <cit.> with γ=0.56 and L_ X,⋆=5.7×10^26 erg s^-1 for GJ 436 <cit.>. \n\nWe construct the stellar energetic particle spectrum close to the surface of the star using the values motivated above for L_CR, α and p_ max. This spectrum is used in the energetic particle transport equation <cit.> to calculate the resulting differential intensity, j, as a function of orbital distance. Fig. <ref> shows j as a function of energetic particle kinetic energy for stellar energetic particles at different orbital distances. The black line represents the energetic particle fluxes at the orbital distance of GJ 436 b (∼0.03au). The coloured lines represent j at different orbital distances between a=0.01-0.2au in increments of 0.01 au. The stellar energetic particle fluxes vary significantly for ≲ 10GeV energy cosmic rays depending on the orbital distance considered. The stellar energetic particle fluxes are much higher than the Galactic cosmic ray fluxes at MeV energies (see Fig. <ref>). For ≳GeV energies the Galactic cosmic rays begin to dominate due to the exponential cut-off assumed for the stellar energetic particle spectrum; this is similar to what <cit.> found in their Fig. 4. For a more active/younger star than GJ 436 it would be reasonable to assume a higher cut-off energy, as motivated by Eq. <ref> which would result in stellar energetic particles dominating up to higher energies <cit.>. \n\nOther methods for estimating stellar energetic particle spectra use relationships between solar far-UV <cit.>, X-ray flare energy <cit.> or starspot size <cit.> and >10MeV proton flux. This is similar to our scaling of the overall spectra with stellar wind kinetic energy. The stellar energetic particle spectrum is normalised using these proton fluxes once a spectral shape has been selected. The shape of the spectrum is often based on a solar energetic particle event <cit.>, as adopted by <cit.> and <cit.> for instance, or the strongest ground level enhancement event measured on Earth <cit.>. This is the main difference between our model and those based on solar energetic particle events. The spectral shape obtained from our model depends on stellar magnetic field strength which varies from star to star.\n\nAs mentioned above, we consider flare accelerated particles rather than those from CMEs as stellar CME properties remain elusive <cit.>. However, <cit.> recently modelled the expected stellar energetic particle fluxes from a CME associated with a young solar-like star and found higher maximum particle energies for higher CME speeds. On the other hand, previous stellar wind simulations including CMEs <cit.> have suggested that strong solar-like CMEs may be suppressed by a large-scale dipole stellar magnetic field of 75 G which would affect the corresponding stellar energetic particle fluxes. <cit.> showed for the AU Mic system how the stellar energetic particle flux distribution reaching the planetary orbits is strongly altered by the passage of a CME. To complicate matters further, solar CME-CME interactions account for more than 25% of the major geomagnetic storms observed <cit.>. Using models, <cit.> suggest that successive CMEs can lead to extreme conditions at Earth. Thus, it would be expected that stellar CME-CME interactions will also affect the associated stellar energetic particle fluxes.\n\n\n\n §.§ Exoplanet atmosphere model\n\n\nThe exoplanet atmosphere density (n(z)) in units of cm^-3, is important for the propagation of the energetic particles through the exoplanet atmosphere. The 1D temperature pressure profiles for a Neptune-like planet in the GJ 436 system are found using the radiative transfer code HELIOS <cit.>. We assume an adiabatic atmosphere for pressures, P>1 bar[We have not included any internal temperature in the HELIOS models. Thus, taking into account that the radiative gradient is proportional to the planet luminosity, no adiabat will occur for our HELIOS models. Setting an internal temperature in HELIOS could not be done for the temperature pressure profiles considered due to non-convergence effects. We instead include an adiabat for P> 1 bar. This is a reasonable approximation given the uncertainties in internal temperatures and opacities for exoplanet atmospheres.]. The density is then calculated using the ideal gas law for the entire atmosphere. The profiles, shown in Fig. <ref>, are calculated for a Neptune-like planet at different orbital distances, a, ranging from 0.01-0.2 au in steps of 0.01 au which includes GJ 436 b's observed orbital distance (i.e. 0.028 au). \n\nThe required inputs for HELIOS are the planetary parameters (i.e. mass, radius and orbital distance), the opacities and chemical abundances of included species and the stellar spectrum. For the opacities we make use of the line lists from the DACE database <cit.> and we only take the most relevant species into account (i.e. CH_4, CN, CO, CO_2, H_2O, H_2S, NH_3, NaH, PH_3, SiO, TiO, and VO) considering solar elemental abundance <cit.> in chemical equilibrium  <cit.>. The stellar XUV spectrum is taken from the MUSCLES survey <cit.>. For higher wavelengths PHOENIX models were used and stitched to the XUV spectrum. The stellar and planetary parameters for the GJ 436 system are given in Table <ref>. For the HELIOS models where the planet had an orbital distance (period) <0.069 au (<10 days), the model assumed a tidally locked planet, with no heat-redistribution. Planets with orbital distances ≥ 0.069 au were not assumed to be tidally locked anymore and global heat-redistribution was included. The final temperature pressure profiles are averaged over the irradiated hemisphere.\n\n\n\n\n\n\n\n\n\n §.§ Energetic particle transport in exoplanet atmospheres\n\n\nThe energetic particle propagation through the exoplanet atmosphere is performed using a Monte Carlo model <cit.>. Here, we briefly outline the method which is described in detail in <cit.>. The model is based on the continuous slowing down approximation where the energetic particles travel through a column density, n(z)dz, of the exoplanet atmosphere. Here, we take 5× 10^5 particles to ensure that the fluctuations per energy bin are negligible. In order to calculate the energetic particle energy losses for each height element, dz, in the exoplanet atmosphere, each energetic particle is assigned two values: an individual kinetic energy, E, such that the energetic particle energies are normalised to match the top-of-atmosphere fluxes shown in Fig. <ref> and a random number, N, of uniform distribution between 0 and 1. The random number is compared with the energetic particle `optical depth', σ^ ion_ p,X n(z)dz, for the cell dz where σ^ ion_ p,X(E) is the ionisation cross section. The subscript `X' refers to the ionisation cross sections for H_2 and He from <cit.> and <cit.>. If N<σ^ ion_ p,X n(z)dz, the energetic particle collides and loses energy. This requires that σ_ max,X n(z)dz<1, where σ_ max,X is the maximum cross section value for H_2 and He. Following <cit.>, based on <cit.>, the average energy loss per collision, W, is given by W = 7.92E^0.082+4.76, where W and E have units of eV. For this model, we assume that the atmosphere is composed of 80% H_2 and 20% He. We have adopted the same expression for W for H_2 and He. This step is repeated for each height element and new random numbers are assigned. \n\nThe transport for stellar energetic particles and Galactic cosmic rays is treated separately. This is because if the fluxes are combined, the energetic particle flux is dominated by the stellar energetic particles and the high-energy Galactic cosmic rays are poorly sampled by the Monte Carlo method. \n\nIn our model we assume that the energetic particle fluxes are isotropically distributed at the top of the atmosphere, as shown in Fig. <ref>. We also do not account for the effect of a planetary magnetic field. First, a planetary magnetic field would act to deflect low-energy energetic particles towards the magnetic poles. Thus, the energetic particle fluxes would no longer be isotropically distributed at the top of the atmosphere and only particles with Larmor radii comparable to or larger than the planetary radius would penetrate the magnetosphere. Second, while diffusion tends to isotropise energetic particle fluxes, such as for Galactic cosmic rays, the stellar energetic particles are more influenced by advection processes at such small orbital distances <cit.>. Thus, for close-in exoplanets the stellar energetic particle fluxes may be higher on the side of the exoplanet facing the star which we do not account for in our model.\n\n\n\nThe quantities, presented in Section <ref>, relevant for chemical modelling of exoplanet atmospheres are the ionisation rate, ζ(s^-1), and the ion-pair production rate, Q = nζ ( cm^-3 s^-1). Following <cit.>, the ionisation rate of molecular hydrogen, ζ_ H_2, by protons is calculated from the energetic particle differential intensities, j(E), as:\n\n\n    ζ_ H_2 = 4π∫^E_ max_I( H_2) j(E)[1+ϕ(E)]σ^ ion_ p,H_2(E) dE\n\n\nwhere I(H_2)=15.603eV is the ionisation potential of H_2 and E_ max is the maximum energy of the energetic particle spectrum. The parameter, ϕ(E), is a correction factor that accounts for additional ionisation of H_2 by secondary electrons given by:\n\n\n    ϕ(E) = 1/σ^ ion_ p,H_2(E)∫^E_ e,max_I( H_2)1/σ^ ion_ p,H_2(E)dσ^ ion_ p,H_2(E)/dE_ e_P_ e(E,E_ e)σ^ ion_ e(E_ e) dE_ e,\n\nwhere E_ e (eV) is the secondary electron energy, σ^ ion_ e(E_ e) (cm^2) is the ionisation cross section of H_2 by electrons and P_ e(E,E_ e) is the probability density that a secondary electron with energy E_ e is produced as a result of an initial ionising proton of energy E. This probability density is represented in terms of the total ionisation cross-section (σ^ ion_ p,H_2(E), cm^2), and differential cross-section (dσ^ ion_ p,H_2(E)/dE_ e, cm^2 MeV^-1). From <cit.>,\n\n\n    dσ^ ion_ p,H_2(E)/dE_ e = A(E)/1+(E_ e/E_0)^2.1,\n\nwhere E_0=8.3eV. Given that, by definition:\n\n    ∫_0^∞ P_ e(E,E_ e) dE_ e = 1,\n \nA(E) can be expressed as A(E) = Cσ^ ion_ p,H_2(E) where the value of C is determined from numerical integration.\n\nIn addition to being important for chemical modelling, energetic particles will impact life on other planets leading to increased mutation rates <cit.>. The equivalent dose rate, Ḋ (Sv s^-1), which is the energy absorbed per unit time and mass, provides a measure of how damaging energetic particle fluxes are for life-forms. We estimate the skin-depth equivalent dose rate from primary protons as:\n\n    Ḋ∼ 2π W ∫^E_ max_E_ minE j(E)/R(E) dE\n  \nwhere W=2 is the radiation weighting factor for protons and R(E) ( g cm^-2) is the proton range in water[https://physics.nist.gov/PhysRefData/Star/Text/PSTAR.html.]. The quantity E j(E) in Eq. <ref> represents the particle number flux in an energy bin, dE. We have assumed that the energetic particles only impact from above. In Section <ref>, we present Ḋ in units of mSv day^-1.\n\n\n\n\n\n\n§ RESULTS\n\n\nHere we present our results for the energetic particle propagation in the atmosphere of a GJ 436 b-like planet at different orbital distances. Using the energetic particle fluxes (shown in Fig. <ref>) and the atmospheric profiles (Fig. <ref>), we calculate the ionisation rate (Section <ref>), the ion-pair production rate (Section <ref>) and the skin-depth equivalent dose rate (Section <ref>).\n\n\n\n\n\n §.§ Ionisation rates\n\n\nFig. <ref> shows ζ_ H_2 from Galactic cosmic rays (Fig. <ref>(a)) and stellar energetic particles (Fig. <ref>(b)) as a function of pressure for different orbital distances (a=0.01 - 0.2 au) with different coloured lines. The black line represents ζ_ H_2 at the orbital distance of GJ 436 b. The grey dotted line denotes P=1 bar. At the top of the atmosphere, ζ_ H_2 from Galactic cosmic rays varies by approximately two orders of magnitude ranging from ∼ 1.7 × 10^-20 - 10^-18  s^-1 between a=0.01-0.2au, shown in Fig. <ref>(a). In comparison, the LIS for Galactic cosmic ray protons results in a higher value of ζ_ H_2∼ 1.6 × 10^-17  s^-1 <cit.>. For the orbital distances considered in Fig. <ref>(a), the top-of-atmosphere ζ_ H_2 from Galactic cosmic rays is largest at the largest orbital distance of 0.2 au. This is because the Galactic cosmic ray fluxes are highest at the LIS values in the ISM which are then suppressed as they travel inwards through the stellar wind. The Galactic cosmic rays diffuse into the stellar system from the ISM. At the same time, the Galactic cosmic ray fluxes are suppressed by advection processes due to the expanding magnetised stellar wind. In Fig. <ref>(a), ζ_ H_2 starts to decrease rapidly between P∼ 10^-1-10^1 bar, depending on the orbital distance considered. This illustrates that the Galactic cosmic rays travel essentially unimpeded through the exoplanet atmosphere in regions where the density is relatively low (P≤10^-1bar). \n\nFor stellar energetic particles (Fig. <ref>(b)), ζ_ H_2 begins to decrease rapidly at P∼ 10^-3 bar. The top-of-atmosphere ζ_ H_2 values vary by approximately three orders of magnitude ranging from ∼ 2 × 10^-13 - 4× 10^-10  s^-1. In contrast to ζ_ H_2 from Galactic cosmic rays, the highest top-of-atmosphere ζ_ H_2 values for the stellar energetic particles are found at the smallest orbital distances. This is because the stellar energetic particles originate from a ∼point source close to the stellar surface, causing the fluxes to decrease with increasing orbital distance (Fig. <ref>) as they are advected by and diffuse through the stellar wind in our model. As mentioned above, the reverse is true for Galactic cosmic rays which have the lowest fluxes closest to the star (Fig. <ref>) as they originate from the ISM. The stellar energetic particle values for ζ_ H_2 decrease much more rapidly with increasing pressure than the Galactic cosmic ray values (compare the black lines from Figs. <ref>(a) and <ref>(b), for instance). This is because the stellar energetic particles are predominantly at ∼MeV energies which have a higher energy loss rate than ≳GeV energy cosmic rays. Thus, in the upper atmosphere stellar energetic particles dominate while in deeper parts (P≳ 100bar) Galactic cosmic rays are more important. Transmission spectroscopy with JWST and Ariel will likely probe regions between P∼ 10^-4-10^-1 bar for H_2-rich atmospheres <cit.>. \n\nThus, for the atmospheres and orbital distances (a=0.01-0.2au) that we consider here for the GJ 436 system, transmission spectroscopy with JWST and Ariel would probe regions where stellar energetic particles are more likely to impact the chemistry than Galactic cosmic rays (also see Section <ref> where the ion-pair production rates are discussed). While ionisation and dissociation by energetic particles, including photons, are likely the main sources of chemical disequilibrium in the upper atmosphere, vertical mixing and chemical quenching are likely the dominant sources of disequilibrium chemistry deeper in the atmosphere <cit.>. This trend will be dependent on the specific nature of the temperature profile. Cooler atmospheres, especially those of rocky planets, may have other sources of disequilibrium <cit.>. Very hot atmospheres may never experience chemical quenching <cit.>.\n\nThe total ζ_ H_2 from energetic particles as a function of pressure can be calculated by summing the individual ζ_ H_2 values shown in Fig. <ref> for Galactic cosmic rays and stellar energetic particles[Alternatively, the top-of-atmosphere energetic particle fluxes could have been summed. However, as described in Section <ref>, we treat the stellar energetic particle and Galactic cosmic ray transport separately.]. These ionisation rates can be used to study the energetic particle-induced chemistry in an exoplanet atmosphere, similar to <cit.>. <cit.> studied the hot Jupiter, HD 189733 b, orbiting its K dwarf host star at 0.031 au, similar to GJ 436 b's orbital distance of 0.028 au. As discussed in Section <ref>, the fact that the adopted stellar energetic particle spectra are different, in combination with the different temperature-pressure profiles, may result in different chemical tracers for energetic particles. The main difference in the stellar energetic particle spectra is that our spectra has more ∼GeV energy particles at 0.03 au, which penetrate further into an exoplanet atmosphere.\n\nAs shown in Fig. <ref>, the top-of-atmosphere values ζ_ H_2 values from stellar energetic particles are all larger than those due to Galactic cosmic rays for a=0.01-0.2au. However, at 10 au we find that the value of ζ_ H_2=7× 10^-18 s^-1 due to stellar energetic particles is the same as that obtained from Galactic cosmic rays. The Galactic cosmic ray fluxes, and the resulting ionisation rates, are highest at large orbital distances where they have travelled through relatively little of the stellar wind. Galactic cosmic rays from the ISM lose energy as they diffuse through the stellar wind. At the same time, stellar energetic particle fluxes decrease with distance from the star. \n\nThus, for an exoplanet at an orbital distance >10 au in the GJ 436 system it is more likely that any observable chemical signatures of energetic particles from the upper atmosphere will be due to Galactic cosmic rays rather than stellar energetic particles. Additionally, as mentioned above, the (higher energy) Galactic cosmic rays lose their energy less rapidly with increasing atmospheric pressure/density in comparison to the (lower energy) stellar energetic particles. This means, for an exoplanet at an orbital distance >10 au in the GJ 436 system, that Galactic cosmic rays will likely be the dominant source of ionisation due to energetic particles at all heights in the atmosphere. This should be true for many systems, as discussed in <cit.>, though the exact orbital distance where this occurs will be system-dependent due to different stellar wind conditions. For instance, Fig.3 of <cit.> shows the effect of assuming two different stellar wind models on the Galactic cosmic ray spectra at various orbital distances for the GJ 436 system. The difference between these stellar wind models is that for one model the wind is more magnetically-dominated (Case A adopted here), whereas the other is more thermally-dominated (Case B). Thus, the value of ζ_ H_2 from Galactic cosmic rays at 10 au would decrease somewhat if we had adopted the thermally-dominated stellar wind, largely due to the larger astrosphere resulting from this stellar wind model. For other systems which are dominated more by advective processes <cit.>, the difference in Galactic cosmic ray ζ_ H_2 values at large distances assuming different astrosphere sizes would be more significant.\n\n\n\n §.§ Ion-pair production rates\n\n\nThe ion-pair production rate, Q=nζ, convolves the number density of the exoplanet atmosphere with the ionisation rate. It gives an indication of where in the exoplanet atmosphere the energetic particles will be important for chemistry by creating the most ions. Thus, high Q values correspond to regions where the energetic particles should be most important. Fig. <ref> and <ref> show the ion-pair production rate, Q, as a function of pressure from Galactic cosmic rays and stellar energetic particles, respectively for different orbital distances. The maximum Galactic cosmic ray Q value occurs at P∼ 10-10^2bar (rightmost green line in Fig. <ref>). For stellar energetic particles instead, the maximum Q value occurs much higher in the atmosphere between  \nP∼ 10^-3-10^-2bar, with a much greater value (rightmost blue line). Here, we have ignored the diffusion of ions. \n\nFor comparison, Fig. <ref> shows the ion-pair production rate for Galactic cosmic rays (Q^ GCR, green dashed line) and stellar energetic particles (Q^ StEP, blue dot-dashed line) at the orbital distance of GJ 436 b as a function of pressure. The thin solid black line represents the combination of both. The blue shaded region illustrates where Q^ StEP>Q^ GCR and the green shaded region shows where Q^ GCR>Q^ StEP which occurs at ∼1 bar for GJ 436 b. The fact that Galactic cosmic rays are more important than stellar energetic particles at 10-10^3 bar is interesting because it has been suggested that a ∼10^2bar atmosphere is expected for a post-impact early Earth atmosphere <cit.>. This suggests that Galactic cosmic rays could have been the dominant ionisation source deep in the atmosphere at this time.\n\n<cit.> and <cit.> calculate the ion-pair production rate from Galactic cosmic rays and solar/stellar energetic particles for an Earth-like atmosphere and for Prox Cen b, respectively. Fig. 6 of <cit.> shows broadly the same behaviour as our results: Q^ GCR peaks at a lower  value than Q^ StEP, but occurs at a higher pressure/lower altitude. The main difference is that for our model atmosphere for GJ 436 b, Galactic cosmic rays dominate for a broad range of high pressures. The fact that our maximum Q^ StEP value peaks at ∼10^-3bar reflects that our assumed stellar energetic particle spectrum decays exponentially at a relatively low cosmic ray kinetic energy. For a more active star, we would expect the maximum Q^ StEP value to occur at a higher pressure. \n\nIn terms of the range of values for Q^ StEP and Q^ GCR, our peak Q^ GCR value is lower than that found in <cit.> which is reasonable since our top-of-atmosphere Galactic cosmic ray spectrum (Fig. <ref>) is reduced in comparison to values observed at Earth. Our peak Q^ StEP value lies between the maximum values found in <cit.> and <cit.> which is again consistent since our stellar energetic particle fluxes at ∼ 10-100MeV energies lie between those assumed for the Earth-like atmosphere and for Prox Cen b. Our stellar energetic particle fluxes are higher for GJ 436 b mainly because it orbits much closer to its star than the Earth orbits the Sun, while they are lower than for Prox Cen b. At the same time, it is complex to compare values since Q depends not only on the incident energetic particle fluxes but also on the density profile of the planetary atmosphere. Additionally, <cit.> include the effect of an Earth-like planetary magnetic field which introduces a low-energy particle cut-off, i.e. energetic particles below a certain energy (510 MeV in their case for latitudes of around 60^∘) cannot penetrate the planet's magnetosphere and do not contribute to Q. In this context, this indicates that our results represent the largest possible values for Q and that exoplanetary magnetic fields would generally result in a decrease of the values obtained for Q. It is likely that the Q^ StEP values would be more affected than Q^ GCR. This is because the top-of-atmosphere stellar energetic particle spectra are dominated by low-energy particles, whereas the peaks of the Galactic cosmic ray spectra occur closer to GeV energies (see Fig. <ref>).\n\n\n\n\n\n §.§ Skin-depth equivalent dose rates\n\n\nWhile warm Neptune exoplanets are not expected to be habitable we can calculate the skin-depth equivalent dose rate for these planets. In the future, the same procedure can be applied to stars like GJ 436 that could have terrestrial planets in their habitable zones. Fig. <ref> shows the skin-depth equivalent dose rate from energetic particles as a function of pressure for Galactic cosmic rays (green dashed line) and stellar energetic particles (blue dot dashed line) at a=0.2au, which is the inner edge of the habitable zone for the GJ 436 system. The thin black line represents the combination of both. The grey star and magenta pentagon represent the average equivalent dose rate at Earth's surface due to Galactic cosmic rays (9× 10^-4mSvday^-1, including however secondary electrons, muons and γ-rays) and background radiation sources (7× 10^-3mSvday^-1). Here we have used the temperature pressure profile at 0.2 au, described in Section <ref>, assuming the same planetary mass and radius as before.\n\nFor Galactic cosmic rays, the equivalent dose rate is approximately constant for P<1bar. Again in comparison to <cit.>, our maximum equivalent dose rates are lower (higher) for Galactic cosmic rays (stellar energetic particles). It is important to note that <cit.> consider a terrestrial planet atmosphere whereas we are still considering a hydrogen dominated atmosphere which affects the energetic particle transport in the exoplanet atmosphere. In turn, this will impact the dose rates that are calculated. \n\nFor these equivalent dose rates, and for chemical modelling that include our energetic particle ionisation rates, it is particularly important to consider how constant these rates would be in time. We discuss this further in Section <ref>. While indirect detections of exoplanetary magnetic fields remain challenging, Fig. 9 of <cit.> shows that the biological dose rate decreased significantly with increasing magnetic moments for two different atmospheric column depths. This indicates that our results represent an upper limit in the case that the exoplanet possesses a magnetic field.\n\n\n\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\n\n\n §.§ How continuous are stellar energetic particle fluxes?\n\n\nStellar energetic particle fluxes may vary on timescales of days, depending on stellar activity. Galactic cosmic ray fluxes are more likely to be approximately constant on these timescales. Instead, they vary with the solar cycle <cit.>, for instance, and will also vary on stellar evolutionary timescales <cit.>. Similar to <cit.>, we plot the flare rate as a function of the maximum momentum of the stellar energetic particles in Fig. <ref>. This is based on the relation between flare frequency and flare energy (dN/dE_ flare∝ E_ flare^b, where the power law index b varies from star to star). Flare energies are related to the stellar energetic particle maximum momenta via p_ max∼ E_ flare^1/2, normalised for ∼GeV energetic particle energies at E_ flare∼ 10^33erg and assuming that E_ flare∼ B_⋆^2 <cit.>. The underlying relation between flare rate and energy is plotted in Fig. <ref>.\n\nThe relation between flare rate and energy, and therefore the relation between flare rate and maximum stellar energetic particle momentum is unknown for GJ 436. Thus, in Fig. <ref>, we plot the flare rate versus maximum stellar energetic particle momentum for the Sun and a number of M dwarfs. In Fig. <ref>, the solid blue line is a fit to the solar flare frequency versus flare energy for a broad range of flare energies using solar observations and Kepler observations of superflares from solar-type stars <cit.>. The solid black line is 10 times the solar flare frequency fit (i.e. 10× E dN/dE_ flare, where dN/dE_ flare∝ E_ flare^-1.8) from <cit.>, which is what would be expected for a solar-type star with a rotation period between 5-10 days. The grey shaded region is ± 0.5dex of this value. The solid green line reflects a fit of the flare rate versus energy for an M dwarf with a rotation period of ∼27 days from <cit.> using TESS data. This M dwarf is selected because it is relatively similar to GJ 436 in terms of stellar effective temperature (3850 K) and has a relatively long rotation period. The grey dashed lines are a number of flare rate fits for M dwarfs with similar spectral types to GJ 436 but with unknown rotation periods <cit.>. \n\nUsing 10 times the solar flare rate, Fig. <ref> shows that the value of p_ max=0.3 GeV/c (kinetic energy of 50 MeV) assumed for GJ 436 corresponds to a flare rate of 0.04 day^-1, i.e. a flare capable of accelerating particles to this momentum occurs approximately every 25 days with E_ flare=3× 10^31erg (see Fig. <ref>). Considering the grey shaded region for the flare rate corresponds to a range of a flare every 7 or 72 days. \n\nWhile <cit.> suggest that the flare rates given by the dashed grey lines are likely to be associated with stars with P_ rot<10 days (in comparison to GJ 436 with P_ rot∼ 44days), it is interesting to note that the flare rate given by the solid green line is for an M dwarf with P_ rot∼ 27days. This rotation period is similar to the Sun's rotation period but with a flare rate 2 orders of magnitude larger than the Sun's. If GJ 436 had such an elevated flare rate, flares capable of accelerating particles to 50 MeV energies would occur approximately once per day. Fig. <ref> <cit.> also shows that the power law fit for the flare rate varies from star to star. Thus, determining stellar flare rates is important to understand how continuous stellar energetic particle fluxes of a certain energy are. Comparing flare rates with chemical recombination rates in the future would shed light on whether the chemistry in exoplanet atmospheres could reset between flares with associated stellar energetic particles.\n\n\n\n §.§ Connection to habitability\n\nUnderstanding exoplanet habitability, and detecting the signature of life as we know it from an exoplanet, is a key goal of modern astronomy. Energetic particles are one of the many factors thought to affect exoplanet habitability <cit.>. For instance, energetic particles can drive the formation of prebiotic molecules <cit.> that are important for the origin of life. On the other hand, high energetic particle fluxes may be detrimental to existing life by contributing to ozone depletion <cit.> which blocks harmful UV radiation reaching the surface of an Earth-like planet. Studying exoplanets that are not expected to be habitable (such as GJ 436 b), but that will be observed in greater numbers, can provide important information about the conditions present in other stellar systems.\n\nWhile hydrogen dominated gas giants are not generally thought to be conducive to life, <cit.> have suggested how life might survive in the cloud decks of these planets, and <cit.> have found unique biosignature gas compositions for microbial life as we know it in H_2-rich environments. Prebiotically relevant molecules, such as the amino acid glycine, may also form more easily on charged cloud particles <cit.>. <cit.> suggested muons (which are on-average spin-polarised) that reach Earth's surface could be responsible for the chirality of the DNA helix by interacting with biological molecules. In this context, it will be of interest in the future to calculate the muon fluxes associated with our (proton) energetic particle fluxes for a terrestrial planet. While genetic mutation rates are known to increase with increasing radiation dose <cit.>, it remains unclear what the ultimate effect of high radiation doses due to energetic particles would be on the development of life on another planet. Lifeforms that use radiation energy for metabolism <cit.> may dominate instead.\n\nIn our model, we have assumed that the top-of-atmosphere stellar energetic particle fluxes are isotropic. In reality, stellar energetic particles will travel along spiral flux tubes which would result in anisotropic top-of-atmosphere fluxes. This type of transport can be modelled with the focused transport equation, for instance <cit.>. For tidally locked planets, if the stellar energetic particle flux is not isotropic, one side of the atmosphere, facing toward the star, will likely receive more stellar energetic particles than the side facing away from the star. This angular dependence could affect the energetic particle environment and could introduce heterogeneous chemistry in the upper atmosphere, depending on chemical timescales and efficiency of atmospheric circulation. This could be explored by 3D models, and is outside the scope of this paper. An anisotropic energetic particle flux could also have implications for habitability. Again, exoplanetary magnetic fields will complicate the picture further. For instance, <cit.> considered the impact of an Earth-like magnetic field and indicated that <510 MeV energy particles were not able to penetrate an Earth-like magnetosphere at latitudes around 60^∘.\n\nThe atmospheres of the planets considered here are roughly analogous to the most extreme transient post-impact atmospheres predicted for the early Earth <cit.>. We can consider the energetic particle flux at different pressures as analogous particle radiation environments for a post-impact early Earth. If Earth post-impact had a 100 bar H_2 atmosphere, as proposed by <cit.>, then Galactic cosmic rays determine the surface irradiation environment, and the irradiation dose is much lower than if Earth post-impact had a relatively more tenuous atmosphere, at <10 bar. Then the irradiation is much more severe and due to stellar energetic particles. This is relevant for habitability around small cool stars, such as GJ 436, where the 0.2 au case is at the inner edge of the liquid water habitable zone of the system. This is also relevant for prebiotic chemistry driven by energetic particle-driven chemistry in aqueous solutions, either on the surface or in aerosols <cit.>.\n\n\n\n\n§ CONCLUSIONS\n\n\n\nIn this paper, we consider the effect of the stellar magnetic environment and planetary atmosphere on the energy dependence and intensity of energetic particles as applied to the well-studied M dwarf system, GJ 436. GJ 436 b is a warm Neptune planet orbiting at 0.028 au from its host star (scheduled for JWST observations and an Ariel target). We have coupled a stellar wind model with an energetic particle transport model for the large-scale stellar system. We have then propagated the top-of-atmosphere energetic particle fluxes through the atmosphere of a warm Neptune-like exoplanet at various orbital distances from GJ 436, using temperature pressure profiles from the radiative transport code HELIOS. \n\nWe consider two sources of energetic particles: Galactic cosmic rays and flare-accelerated stellar energetic particles. We show how the maximum momentum that the stellar energetic particles are accelerated to can be related to the stellar X-ray luminosity. Thus, our input stellar energetic particle spectrum reflects in some sense the activity of the star. To our knowledge, no other model relates the cut-off energy of the stellar energetic particle spectrum to a stellar property. The high energy cut-off is very important because the highest energy particles (i.e. GeV energies) are those that can reach the surface of an Earth-like planet, for instance. Our calculations have assumed that the stellar energetic particle fluxes are constant in time up to our calculated maximum stellar energetic particle momentum. These would be associated with a ∼10^31 erg flare which would occur once every ∼25 days assuming 10 times the solar flare rate for GJ 436.\n\nWe calculate top-of-atmosphere energetic particle fluxes as a function of star-planet separation. We also model the transport of energetic particles through a hydrogen-dominated gas giant atmosphere at orbital distances of a=0.01-0.2au. The peak top-of-atmosphere ionisation rate for Galactic cosmic rays is ∼ 10^6 times less than the peak ionisation rate for stellar energetic particles at orbital distances between a=0.01-0.2au. However, the stellar energetic particles do not penetrate as deep into the atmospheres. This is because for GJ 436, the stellar energetic particle spectrum that we adopt has a lower cutoff energy than for the Galactic cosmic rays. \n\nAt the orbital distance of GJ 436 b, we find that the ion-pair production rate, Q (cm^-3 s^-1), peaks at ∼ 100bar for Galactic cosmic rays and 10^-3bar for stellar energetic particles. We also estimate the skin-depth equivalent dose rate from the primary energetic particles as a function of height in the hydrogen-dominated atmospheres. Given the close-in orbital distance of the inner edge of GJ 436's habitable zone (0.2 au), the top-of-atmosphere equivalent dose rates that we calculate are substantial (10^4mSv day^-1). However, an important future step would be to study the effect of a planetary magnetic field on our results.\n\nThe stellar energetic particle fluxes decrease with distance from the star and we assume that they are isotropic at the top of the exoplanet atmosphere. At small orbital distances, the fluxes drop close to 1/r^2 as advection processes dominate. At the same time, the magnetised, expanding stellar wind suppresses Galactic cosmic ray fluxes, and so the greater the distance from the star, the more intense the Galactic cosmic ray spectrum. A future step would be to study the effect of anistropic stellar energetic particle fluxes as they travel along magnetic flux tubes.\n\nWe find that, at a distance of 10 au, the top-of-atmosphere molecular hydrogen ionisation rates from stellar energetic particles and Galactic cosmic rays are equal. Top-of-atmosphere ionisation by energetic particles is dominated by Galactic cosmic rays for a>10au. Ionisation by energetic particles at the top of the atmosphere is dominated by stellar energetic particles for a<10au. We anticipate that most of the ion chemistry will happen at P< 1 μbar, and so the ion chemistry will be determined by stellar energetic particles and UV photons for planets within 10 au based on the top-of-atmosphere ionisation rates that we found. Clouds might also form in GJ 436 b's atmosphere because of the low atmospheric temperatures. Their formation and its effects on the atmospheric structure and the chemistry are, however, neglected in this paper. The chemical consequences of these trends and specific predictions for ion-neutral chemistry will be discussed in more detail in Paper II <cit.>. \n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nDRL would like to acknowledge that this publication has emanated from research conducted with the financial support of Science Foundation Ireland under Grant number 21/PATH-S/9339. DRL, ALM and AAV acknowledge funding from the European Research Council (ERC) under the European Union's Horizon 2020 research and innovation programme (grant agreement No 817540, ASTROFLOW). DRL wishes to acknowledge the Irish Centre for High-End Computing (ICHEC) for the provision of computational facilities and support. Research reported in this publication was supported by the Royal Irish Academy. ChH acknowledges funding from the European Union H2020-MSCA-ITN-2019 under Grant Agreement no. 860470 (CHAMELEON). OV acknowledges funding from the ANR project `EXACT' (ANR-21-CE49-0008-01), from the Centre National d'Études Spatiales (CNES), and from the CNRS/INSU Programme National de Planétologie (PNP). PB acknowledges a St Leonard’s Interdisciplinary Doctoral Scholarship from the University of St Andrews. We would like to thank the referee for helpful comments which improved the manuscript.\n\n\n\n\n§ DATA AVAILABILITY\n\nThe output data underlying this article will be available via zenodo.org upon publication.\n\n\n\n\nmnras\n\n\n\n\n§ FLARE RATES\n\nSection <ref> discusses how continuous stellar energetic particle fluxes can be considered for GJ 436. Fig. <ref> relates the flare rate to a maximum stellar energetic particle momentum. This is based on the underlying relation between flare rate and flare energy which is plotted in Fig. <ref>. The solar flare rate is a fit to solar and stellar super-flare data from <cit.> with a flare frequency relation of dN/dE_ flare∝ E_ flare^-1.8. The grey shaded region surrounding the solid black line, representing 10 times the solar flare rate, is ± 0.5dex. While the flare rate for GJ 436 is unknown, given the maximum stellar energetic particle momentum that we assume, we indicated the frequency of flares accelerating to this momentum in Section <ref>.\n\n\n\n\n\n\n"}