{"entry_id": "http://arxiv.org/abs/2303.07052v1", "published": "20230313121758", "title": "Controlling Fractional Difference Equations Using Feedback", "authors": ["Divya D. Joshi", "Sachin Bhalekar", "Prashant M. Gade"], "primary_category": "math.DS", "categories": ["math.DS", "26A33, 39A30"], "text": "\nTracing chirality from molecular organization to triply-periodic network assemblies: \n \nThreading biaxial twist through block copolymer gyroids\n\n    Gregory M. Grason\n    Accepted xxxx xxxxxx xx. Received xxxx xxxxxx xx; in original form xxxx xxx xx\n================================================================================================================================================\n\n\n\n\n\n\n\n\n\n\n\tOne of the most popular methods of controlling dynamical systems is feedback. It can be used without acquiring detailed knowledge of the underlying system. In this work, we study the stability of fractional-order linear difference equations under feedback. The stability results are derived for an arbitrary feedback time τ. We study the cases of τ=1 and τ=2 in further detail. The extension to the stability of fixed points under feedback for nonlinear fractional order difference equations with fixed points x_*=0 is also carried out. \n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nDifferential Equations have been used for modeling various phenomena in natural sciences for a long time. This modeling helps us in understanding the physical phenomena and controlling them if necessary. The differential equations have been found useful in  modeling plethora \nof systems. They range from the spreading of diseases <cit.>, emotional self-regulation in romantic couples <cit.>, economic development and growth <cit.> to tumor growth <cit.>. This modeling is inadequate in certain systems and generalization is required. Fractional differential equations are the generalization of differential equations  for systems with memory. The order of fractional differential equations could be real or even complex. Even though fractional calculus has been around for more than 300 years, fractional differential equations are applied in real world situations only in the past few decades. We find the first mention of fractional derivatives by Leibniz\tand L'Hospital as early as 1695 but the very first definition of fractional derivative was introduced by Liouville and Riemann in the second half of the 19th century. Thereafter several eminent mathematicians like Caputo, Hadamard, Grunwald, Letnikov, Riesz, and others gave various definitions for fractional derivatives. This development in the field of calculus opened the door for many other fields where fractional differential equations are an essential part of mathematical modeling.\n\nThe systems defined by fractional differential equations are said to be non-local. The reason is that the future depends on its entire history. Thus, systems governed by fractional differential equations have long-term memory.  \nHence, fractional differential equations are ideal models for systems where memory plays an important role. Such systems are found in diverse fields. In the field of material science, fractional differential equations are used to define viscoelastic materials and their order determines the amount of viscosity and elasticity present in the materials <cit.>. Fractional order epidemic models of various diseases like COVID-19 <cit.>, Ebola <cit.>, HIV <cit.>, influenza A (H1N1) <cit.> have shown promising results that helped to understand, analyze and control the spread of these diseases. Seismological studies have shown that fractional order intensity measures for probabilistic seismic demand modeling applied to highway bridges have superior  performance  compared to  traditionally used intensity measures. This improved efficiency and proficiency, at the same time, maintaining practicality and sufficiency <cit.> for seismological applications. Several books have been devoted to applications of fractional calculus in real-life applications <cit.> and recent applications of fractional calculus in the field of science and engineering can be found in <cit.>. \n\nFractional order systems are different from integer order systems in several respects. However, they show phenomena observed in integer order systems such as chaotic or aperiodic behavior. In certain systems, chaos is not desired and several control\tschemes are designed to control the chaos. Two of the most popular control schemes are the Ott-Grebogi-Yorke method <cit.> and the Pyragas method <cit.>. For the first method, we need to know the stable and unstable manifold of the desired orbit.  For fractional order systems, the presence of such manifolds itself is a matter of debate <cit.>. The method that can be used without any detailed\tknowledge of the systems is the feedback method suggested by Pyragas. We study the possibility of controlling fixed points using feedback and show that the method indeed works in the fractional case as well.\n\nIn the case of systems with delay τ, the value of the current state depends on its value τ steps back. Such systems have applications both in modeling as well as control. Fractional differential equations with delay have found applications in control theory. Control theory deals with the control of dynamical systems, uses feedback in several cases and has wide applications. Controllers may be designed using a feedback mechanism. Here, the output of the system is fed back to the system through a controller to influence the behavior of the system and give the desired output. \n\nStability analysis of delay differential equation with control is carried out by Bhalekar <cit.>. Controllers have been designed for controlling the fractional ordered systems with input delay \t<cit.>. The stability of the Cournot duopoly model with distributed time delays is discussed by Culda et al. in <cit.>. The existence of chaotic behavior, stability, and its synchronization of fractional ordered systems with delay have been studied for several systems like the Ikeda system <cit.>, logistic system <cit.> and Chen system <cit.>. The ongoing scenario in the world demands newer and updated knowledge of the spreading of diseases and their controllability. As discussed earlier, fractional-order differential equations are used for modeling epidemiological problems. Certain realistic situations demand the introduction of a delay in resulting equations and could lead to better modeling and prediction. A rich dynamical behavior is obtained  for the infection model of fractional order with delay <cit.>.\n\nThe fractional differential equations with delay have been studied in various contexts. Rihan et al. investigated the fractional order model of the interactions of tumor cells and the immune systems with two different time delays. The stability of the solutions was observed to have improved and the model leads to various complex behaviors <cit.>. Alzahrani et al. studied the adverse effect of untimely or delayed reporting of infectious diseases more realistically by using fractional differential equations with delay <cit.>.  \n\nFractional difference equations are a relatively much less studied models. Difference equations are the discretized versions of differential equations. The study of fractional difference equations can be seen as an approach to studying fractional differential equations by the finite difference method. Furthermore, if an integer-order difference equation is generalized to a fractional-order one, then it is able to model the memory properties in the system. This is due to the non-local property of the fractional order difference operator. In this generalization, all the values of the system from an initial point are considered while evaluating the new value. These equations demand fewer computational resources and are simpler to code. The stability conditions for difference equations of fractional order and even complex order have already been obtained by <cit.>. Stability results of two-term fractional difference equations are proposed by Brandibur and Kaslik <cit.>. Stability conditions are crucial for studying the control and synchronization of the systems. For systems of complex order, we have numerically investigated a fractional difference equation along with a delay term which can be viewed as a controller <cit.>. We observed that the parameter range over which chaos is obtained is reduced on the introduction of delay term for the complex fractional Lozi map. This can be viewed as a control.  One of the simplest control is a case of a fixed point where the system gives steady output. Though the above work indicates that feedback can be useful for control in fractional order maps, we need rigorous analytic conditions for practical applications. \n\nThe theory of fractional finite differences is initiated by Lubich <cit.> and Miller and Ross <cit.>. The topic is further developed by Atici and coworkers <cit.>. The stability analysis of these equations is presented in <cit.>.\nThe chaotic systems of these kinds are employed in the image processing by Abdeljawad et al. <cit.>. Atici and Sengul introduced the fractional calculus of variations and derived the discrete Euler-Lagrange equation  <cit.>. A tumor-growth in cancer is modelled by using the nabla-fractional difference equations in <cit.>. Ouannas, Batiha and Pham <cit.> proposed the theory and applications of chaotic difference equations of fractional order. These systems are recently used to model COVID-19 <cit.>. Fractional order Mandelbrot set and Julia sets are studied in <cit.>.\n\nThis paper gives the stability analysis for stable fixed points for systems defined by fractional difference equations coupled with a delay term. The exact analysis is carried out for the linear system and is extended to the nonlinear maps. Stabilization or destabilization of fixed points of fractional order maps with feedback is studied. Because this is a discrete system, the control term can be added proportionally to the value at the previous time. This is unlike the differential equations studied above where the control term is within the integration and thus the control is also fractional order. This is a simpler and more practical case where the control at a given time depends on the value of variable τ steps back and not the entire history. We obtain the stability bounds for this system. The analysis is essentially for linear systems. However, we observe that the same analysis gives equally good stability bounds for nonlinear maps with appropriate linearization near the zero fixed point. In this work, we have considered the h- difference operator while defining the system. For simplicity, we have taken h=1. Therefore, τ has integer values. Fractional values of τ can be considered for h1.\n\nThe plan of the paper is as follows. We give essential definitions followed by the model. We carry out stability analysis of the fractional order difference equations with delay. We show that the stability conditions can be expressed in an equivalent matrix form. We study the cases τ=1 and τ=2 in greater detail. The case of large τ is also discussed briefly. Several examples are given for linear and nonlinear systems to corroborate our results with numerical evidence in various systems. \n\n\n\n§ PRELIMINARIES\n\nIn this section, we have given some basic definitions. Let h>0, a∈ℝ, (hℕ)_a = {a,a+h,a+2h,…} and ℕ_∘ = {0,1,2,…}. \n(see <cit.>)\n\tThe Z-transform of a sequence {y(n)}_n=0^∞ is a complex function given by\n\t\n    Y(z)=Z[y](z)=∑_k=0^∞ y(k) z^-k\n\n\twhere z ∈ℂ is a complex number for which the series converges absolutely. \n\n(see <cit.>)\n\tLet h > 0 ,  a ∈ℝ and \n\t(hℕ)_a = { a, a+h, a+2h, …}.\n\tFor a function x : (hℕ)_a →ℂ, \n\tthe forward h-difference operator is defined as \n\t\n    (Δ_h x)(t)=x(t+h)- x(t)/h,\n\n\twhere t\t∈ (hℕ)_a.\n\nThroughout this article, we take a = 0 and \nh = 1. We write Δ for Δ_1.\nNow, we generalize the fractional order operators \ndefined in [<cit.>].\n\n\tFor a function  x : (hℕ)_a →ℂ \n\tthe fractional h-sum of order \n\tα = u +ι v ∈ℂ, u>0 is given by\n\t\n    (_aΔ_h^-αx)(t) \n    \t\t= h^α/Γ(α)∑_s=0^nΓ(α+n-s)/Γ(n-s+1) x(a+sh),\n\n\twhere, t=a+(α+n)h,   n ∈ℕ_∘.\n\nFor h=1 and a=0\t, we have\n\n    (Δ^-αx)(t) \t   =   1/Γ(α)∑_s=0^nΓ(α+n-s)/Γ(n-s+1)x(s)\n       =   ∑_s=0^n(\n    \t[ n-s+α-1;     n-s;         ])\n    \tx(s).\n                         \nHere, we used the generalized binomial coefficient\n\n    (\n    \t[ μ; η;   ])\n    \t=Γ(μ+1)/Γ(η+1)Γ(μ-η+1),\n     μ ,η∈ℂ,  Re(μ)>0, and Re(η)>0.\n\nIf n ∈ ℕ_∘ then\n\n    (\n    \t[ μ; n ])\n    \t=(μ + 1)/n!Γ(μ-n+1)\n    \t=μ(μ-1)…(μ-n-1)/n!.\n\n\n\tFor n ∈ℕ_∘ and α=u+ι v ∈ℂ, u>0, we define\n\t\n    ϕ̃_α(n)=\n    \t\t(\n    \t\t[ n+α-1;     n;       ])\n    \t\t=(-1)^n\n    \t\t(\n    \t\t[ -α;  n ]).\n\n\nNote: The convolution ϕ̃_α*x of the sequences ϕ̃_α and x is defined as\n\n    (ϕ̃_α*x)(n)=∑_s=0^nϕ̃_α(n-s)x(s)\n\n\n    ∴ (Δ^-αx)(n)=(ϕ̃_α*x)(n)\n    .\n\n\n    ∴ Z(Δ^-αx)(n)=Z(ϕ̃(n))Z(x(n))\n    \n    \t=(1-z^-1)^-αX(z),\n\nwhere X is Z transform of x.\n(see <cit.>)\n\tThe time-shifting property shows how a change in the discrete function's time domain alters the Z-domain.\n\n\n    Z[x(k-n)]=z^-nX(z)\n\nProof:\nFrom Definition 2.1 we have,\n\n    X(z)=∑_k=0^∞x(k)z^-k.\n\nConsider k-n=m i.e., k=m+n. Thus, we write the z-transform equation as \n\n    Z[x(k-n)]=∑_k=0^∞x(k-n)z^-k\n    \n    \t=∑_m=0^∞x(m)z^-(m+n)\n    \n    \t=∑_m=0^∞x(m)z^-mz^-n\n    \n    \t=z^-n∑_m=0^∞x(m)z^-m\n    \n    \t=z^-nX(z)\n\n\n\tFor α∈ℂ, Re(α)>0,\n\t\n    Z(ϕ̃_α(t))=1/(1-z^-1)^α.\n\n\nProof: We have, \n\n    Z(ϕ̃_α(t))   =   ∑_j=0^∞ϕ̃_α(j)z^-j\n       =   ∑_j=0^∞(\n    \t[ j+α-1;     j ])z^-j\n       =   ∑_j=0^∞(-1)^j(\n    \t[ -α;  j ])z^-j\n       =   (1-z^-1)^-α.\n\nby using Newton's generalization of the Binomial Theorem. \n<cit.>.\n\n\n§ MODEL\n\nConsider the fractional order linear difference equation\n\n    x(t)=x_0+∑_j=0^t-1Γ(t-j+α-1)/Γ(α)Γ(t-j)(a-1)x(j).\n\nIn this paper, we study the stability analysis of a fractional difference equation (<ref>) coupled with a delay term. \n\n\n §.§ Modeling Equation\n\nIntroducing the delay term in the equation as bx(t-τ), we get\n\n    x(t)=b x(t-τ)+x_0+∑_j=0^t-1Γ(t-j+α-1)/Γ(α)Γ(t-j)((a-1)x(j)),\n\nwhere, b ∈ℝ and a ∈ℂ.\n\n    ∴\tx(t+1)-b x(t+1-τ)=x_0+(a-1)(ϕ̃_α*x)(t).\n\nTaking Z-transform on both sides, we get\n\n    zX(z)-zx_0-b z^(1-τ)X(z)    =   x_0/1-z^-1+(a-1)/(1-z^-1)^αX(z). \n    ∴\tX(z)(z-b z^(1-τ)-(a-1)/(1-z^-1)^α)   =   zx_0+x_0/1-z^-1,\n where |z|<1.\n\n\n §.§ Characteristic Equation\n\nFrom (<ref>), the characteristic equation of (<ref>) is\n\n    (z(1-z^-1)^α-b(1-z^-1)^αz^(1-τ)-(a-1))=0,\n\nwhere the condition |z|<1 should be satisfied. \nPutting z=e^(it), we get,\n\n    e^(it)(1-e^-it)^α-b(1-e^-it)^αe^(1-τ)it-(a-1)   =   0,  \n    i.e. \te^(it)(1-e^-it)^α-b(1-e^-it)^αe^(1-τ)it+1   =    a.\n\n\n\n §.§ Matrix Representation\n\nEquation (<ref>) can be represented equivalently as the following system\n\n    x(t)   =   x_0+∑_j=0^t-1Γ(t-j+α-1)/Γ(α)Γ(t-j)((a-1)x(j))+b y(t), y(t)=x(t-1)  for τ=1.\n    ∴ x(t+1)   =   x_0+(a-1)(ϕ̃_α*x)(t)+b y(t+1).\n\nTaking z-transform, we get\n\n    zX(z)-zx_0\t=x_0/1-z^-1+(a-1)/(1-z^-1)^αX(z)+b(zY(z)-zy_0), Y(z)=X(z)/z+x(-1).\n\n\n    ∴\tz(1-z^-1)^αX(z)-(a-1)X(z)-bz(1-z^-1)^αY(z) = x_0(1-z^-1)^α -1 +z(1-z^-1)^αx_0-bzy_0(1-z^-1)^α,\n\n\n    zY(z)-X(z)=zx(-1).\n    ∴[ z(1-z^-1)^α-(a-1)     -bz(1-z^-1)^α;                -1                 z ]\n    \t[ X(z); Y(z) ]\n    \t=0.\n    ∴\n    \t\tz(1-z^-1)^α-(a-1)     -bz(1-z^-1)^α\n    \n    \t\t-1     z\n    \t\n    \t=0.\n    i.e. \tz(1-z^-1)^α-b(1-z^-1)^α+1=a.\n\nThis is the equation for the model with τ=1.\nSimilarly, for τ=2 we get,\n\n    z(1-z^-1)^α-(a-1)     0     -bz(1-z^-1)^α\n    \n    \t\t-1     (z-1)+1     0\n    \n    \t\t0     -1     (z-1)+1\n    \t\n    \t=0.\n\nWe can generalize and write τ+1 dimensional determinant for delay τ  as follows.\n\n\n    z(1-z^-1)^α-(a-1)     0     0    …    -bz(1-z^-1)^α\n    \n    \t\t-1     (z-1)+1     0    …    0 \n    \n    \t\t0     -1     (z-1)+1     …    0 \n    ⋮   ⋱   ⋱   …   ⋮\n    \n    \t\t0    …    -1      (z-1)+1     0\n    \n    \t\t0     0    …    -1     (z-1)+1\n    \t\n    \t=0.\n\n\n\n\n §.§ Boundary curve\n\nSeparating real and imaginary parts of equation (<ref>), we get \n    Re(a)=2^α(sin(t/2))^α(cos(απ/2+t(1-α/2))-bcos(απ/2+t(1-τ-α/2) ))+1,\n \n    Im(a)=2^α(sin(t/2))^α(sin(απ/2+t(1-α/2))-bsin(απ/2+t(1-τ-α/2) )).\n\nTherefore, the parametric representation of the boundary condition is\n\n    β(t)=    {2^α(sin(t/2))^α(cos(απ/2+t(1-α/2))-bcos(απ/2+t(1-τ-α/2) ))+1, \n        2^α(sin(t/2))^α(sin(απ/2+t(1-α/2))-bsin(απ/2+t(1-τ-α/2) ))} ,\n\nfor t ∈ [0,2π] in the complex plane.\nIf the complex number a lies inside this anticlockwise oriented simple closed curve β(t) then the system (<ref>) will be asymptotically stable.\n\n\n §.§ Stability Analysis with τ=1\n\n\n\n\tConsider the delayed fractional order equation (<ref>) with τ=1. Let b=g_1(α), b=g_2(α) and b=g_4(α) be the bifurcation curves as shown in Figure <ref> in b α-plane which are the branches of the implicit curve\n\t\n    g(b,α)   =    bαcos(1/2(1+α)(π-arctan(R/S)))\n          -(-1+α)cos(1/2(π(1+α)-(-1+α)arctan(R/S)))\n          +sin(1/2(πα-(-3+α)arctan(R/S))),\n\n\twhere,\n\t\n    R=-1+α+bα-bα^2\n    \t\t\t-√((1+bα)^2(1-2α+4bα+α^2))/bα,\n\n\tand\n\t\n    S   =   -√(2)/bα(-(1+2(-1+b)b^2α^3\n    \t\t+b^2α^4+α^2-3b^2α^2-2α+2bα\n          +(1-α-bα+bα^2)(√((1+bα^2)\n    \t\t\t(1-2α+4bα+α^2)))))^1/2.\n\n\tFurthermore, define the curve b=g_3(α) as the straight line b=-1 in the b α-plane.\n\nWe have the following stability results:\n\n1. If b ∈ (-∞,g_4(α)) ∪ (g_1(α),∞),\nthen the system (<ref>) is unstable.\n\n2. If g_4(α)<b<g_3(α), then the boundary curve (<ref>)\nproduces three disjoint regions; two of which are stable and\none is unstable.\n\n3. If g_3(α)<b<g_2(α), then the boundary curve (<ref>)\ngenerates a bounded region which is a stable region for the system.\n\n4. If g_2(α)<b<g_1(α), then the single stable\nregion in case 3 gets divided into two regions; one is stable\nand the other is unstable.\n\n5. If b=g_2(α), then the curve (<ref>) is a smooth\ncurve and the inside part is stable.\n\n6. If b=g_3(α), then β(0)=β(π) and the\nstable region gets divided into two parts.\n\n7. If b=g_1(α) or b=g_4(α), then the curve\nβ  will have cusps.\n\nProof:\nThe boundary curve β(t) defined by (<ref>) is closed because the initial point β(0) has the same value as that of final point β(2π). If β(t) is simple and its orientation is anticlockwise (positive) then the bounded part inside this curve is the stable region for the system (<ref>). As the parameter values change, the simple closed curve β(t) transforms to the non-simple curve i.e. a curve containing multiple points. Therefore, the region bounded by the branch of the non-simple curve  β(t) with anticlockwise orientation is the required stable region for the system (<ref>).\n\n\nIt is observed that the formation of cusps in β(t) is responsible for the generation of multiple points (self-intersections).\nThus, the parameter values at which cusps are produced in β(t) are the points of bifurcation.\nAt the cuspidal point β(t_0), the curve β(t)=(x(t),y(t)) cannot have the derivative β'(t)=y'(t)/x'(t). Here, x(t) and y(t) are the coordinates of the curve β(t). In this case, lim_t→ t_0β'(t) can take either 0/0 or ∞/∞ form. It is observed that at initial point t=0, this limit takes ∞/∞ form. Therefore, the initial point β(0) is responsible for the bifurcations in some cases.\n\n\nTo check another possibility (i.e. 0/0 form), we solve the equations x'(t)=0 and y'(t)=0 simultaneously. We eliminate t between these equations and get a relation in the parameters b and α. This is carried out by\tsquaring and adding the equations x'(t)=0 and y'(t)=0. Now, we get the value of t as functions of b and α. Substituting this t value in the equation y'(t)=0, we get the implicit expression (<ref>).\n\nThis curve g(b,α)=0 has 3 branches viz b=g_1(α), b=g_2(α) and b=g_4(α)  as shown in Figure <ref>. Note that,  b=g_2(α) is the straight line b=1 in the b α-plane.\n\nFurthermore, the curve β(t) intersects itself at β(0) and β(π) as the parameter b passes through the value -1. At this intersection point β(0)=β(π), β'(t) does not exist at t=0,π and we have a bifurcation apart from cusps. Thus, b=-1 is also a bifurcation curve in the b-α plane. We denote it by b=g_3(α).\n\nIf the b value is above the curve b=g_1(α), the orientation of the boundary curve β(t) becomes clockwise and hence the system becomes\tunstable for the values of 'a' in the bounded as well as unbounded regions described by β(t).\n\nAs b passes through the curve b=g_1(α), the β(t) becomes multiple curves and generates stable and unstable bounded regions as shown in Figure <ref>.\tIf we keep on decreasing the value of b the unstable part becomes\tsmaller and vanishes at b=1. Note that β is smooth at t=0 for g_1(α)<b≤ g_2(α). If g_2(α)<b<g_3(α) then the β(t) is a simple closed curve with an anticlockwise orientation. Therefore, the region bounded by β(t) is the stable region and the unbounded part of the complex plane is the unstable region.\n\nAs we take the values of b between the curves b=g_3(α) and b=g_4(α), β(t) produces two stable and one unstable bounded regions as shown in the Figure <ref>.\tThe size of the unstable region increases if we decrease the value of b.\n\nAt the bifurcation curve b=g_4(α), the stable regions vanish completely and the β(t) becomes a simple closed curve with clockwise orientation. Thus, the system is completely unstable for b<g_3(α). This proves the result.\n\n\n\n\n §.§ Illustrative Examples\n\nIn this section, we provide corroborating evidence\nfor stability results obtained in the above section for τ=1\nand various values of b.\nWe study  various regions \nshown in Figure <ref>. \n\n\tLet us begin with the  region that lies above \n\tg_1(α). We take b=18.3 and \n\tα=0.1 (Figure <ref>). Here, we \n\tobserve a non-smooth curve β(t) with cusps on both \n\tends. The number a=-2  lies inside\n\tthe unstable region according to \n\tFigure <ref>  and\n\ta=(0.4+0.4ι) which lies outside the \n\tcurve, is unstable as well (Figure <ref>). \n\tThe system is unstable for any value of parameter a.\n\n\n\n\tNow consider the region between b=g_1(α) and b=g_2(α). \n\tConsider b=2 and α=0.5. Here, \tthe stability curve is divided into two parts (see Figure <ref>). Consider a system (<ref>) with a=-1.2.\tIt is inside the stable region and we get a stable trajectory as seen in Figure <ref> \t\tFor a=0.2, which lies in the unstable region \twe get an unstable solution (Figure \t<ref>). The solutions for the values of a lying outside the stability curve were checked and found unstable.\n\n\n\n\tOn the boundary b=g_2(α) which\tis described by b=1 for any α. Consider the stability curve for α=0.4 and b=1(see Figure <ref>). It generates a single region. The quantity a=0.5 inside the curve leads to a stable solution.\t\tFor a=-0.7ι outside the curve, an unstable solution is observed.\n\n\n\n\tFor b in the region between b=g_2(α) and b=g_3(α), a single stable region (Figure <ref>) is observed. For α=0.3 and b=0.1, the value a=0.3 is  inside this region and gives a stable solution (Figure <ref>). On the other hand, a=-0.4 lies outside the stable region and leads to an unstable solution (Figure <ref>).\n\n\n\n\tExamples with values of b on the boundary curves give \n\tlimiting cases. For example b=g_2(α)=1 is the limiting\n\tvalue of b at which a single stable region is observed and\n\tfor in the next region, we have one stable and one\n\tunstable region inside the stability curve.\n\t( See Example 3.3, 3.2). Similarly \n\tfor b=g_3(α)=-1 the values for t=0 and t=π\n\ttouch each on the real axis and we have \n\ttwo stable regions. For  \n\tb<g_3(α)=-1, we have 3 regions one of\n\twhich is unstable.\n\tConsider the stability curve for α=0.7 and b=-1 (see Figure <ref>). Stable trajectories are observed for a=1.1+0.5ι and a=1.3-0.8ι (Figure <ref> and <ref> respectively). We checked the stability of the parameter values lying outside the curve and verified that they are unstable. \n\n\n\n\tNow we consider region lying  between b=g_3(α) and b=g_4(α). The stability curve for α=0.2 and b=-3 is sketched as shown in Figure <ref>. The curve has three regions, two of which look identical due to symmetry with respect to the real axis. The system with a=(4+1.3ι) has a stable solution (see Figure <ref>). (Similarly, a=(4-1.3ι)  leads to a stable trajectory.) Thus these two regions have stable solutions. On the other hand, for a in the third region (say, a=2), we observe unstable trajectories (see Figure <ref>). It was checked that\tthe parameter values  a lying outside the stability curve lead to unstable solutions.\n\n\n\n\tThe last region lies below the curve b=g_4(α).\tConsider α=0.5 and b=-2.2, the curve β (see Figure <ref>) encloses  a single region. There are no stable values of a inside or outside the region. Consider a=1.5 and a=2.8. Both values\tlead to unstable trajectories (see Figure <ref> and <ref>, respectively). \n\n\t\n\n\n\n§ STABILITY RESULT FOR Τ=2\n\n\n\n\tNow consider the delayed fractional order equation (<ref>)\twith τ=2. The dynamics is richer and leads to five boundary curves that demarcate qualitatively different behaviors. Let b=g_j(α), j=1,2,⋯,5 be the bifurcation\t\tcurves in the b α-plane (cf. Figure <ref>) which are the branches of the implicit curve.\n\t\n    g(b,α)=   cos(1/2(πα-(-3+α)K))\n    \t\t\t-b(1+α)cos(1/2(πα-(3+α)K))\n    \t\t\t+bsin(1/2(1+α)(π-K))\n        +(α-1)sin(1/2(π(1+α)-(-1+α)K)),\n\n\twhere, K=arccos(-2+2α-α^2+b^2(2+2α+α^2)/2(-1+α+b^2(1+α))). \n\n\tFor any α∈(0,1), -1=g_5(α)<g_4(α)<g_3(α)<g_2(α)<g_1(α)=1.\n\t\n\nThe stability results for the system  (<ref>) with τ=2 are as follows:\n\n1. If b ∈ (-∞,g_5(α)) ∪ (g_1(α),∞),\nthen the system is unstable.\n\n2. If g_5(α)<b<g_4(α), then the boundary\ncurve β(t) generates four regions; of which the outer three are unstable\nand the central one is stable.\n\n3. If g_4(α)<b<g_3(α), then the number of\nunstable regions reduces to one while the number of\nthe stable region remains the same, i.e. one. The two unstable regions described in Case 2 merge with the stable region and hence the size of the stable region, in this case, is larger than that of in Case 2.\n\n4. If g_3(α)<b<g_2(α), then the region\nproduced by the boundary curve is a single closed curve\nwhich is stable.\n\n5. If g_2(α)<b<g_1(α), then the boundary\ncurve produces three regions, one stable and two unstable.\n\nNow we consider the boundary cases:\n\n1. If b=g_5(α)=-1, then the curve β(t) has\nthree regions and all the regions are unstable.\n\n2. If b=g_4(α), then the curve β(t) has\ntwo regions, a stable region with two cusps on the right\nside and an unstable region.\n\n3. If b=g_3(α), then the curve β(t) has\na single stable region with a cusp on the left side.\n\n4. If b=g_2(α), then the curve β(t) has\na single region that is stable and has two cusps.\n\n5. If b=g_1(α)=1, then the curve β(t) has\ntwo regions and both regions are unstable.\n\n\nProof:\n\nAs discussed in the proof of Theorem 3.1, as the parameter values change the simple closed curve β(t)=(x(t), y(t)) possesses multiple points and generates different bounded regions, in this case also. Among these, the regions with the anticlockwise oriented boundary are the stable ones. The multiple points are generated through the cusps.\n\nTo find the conditions for the 0/0 form of lim_t→ t_0β'(t), we solve x'(t)=0 and y'(t)=0 simultaneously.\nSquaring and adding these equations, we get\n\n\n    t=arccos(2(α-1)-α^2+b^2(α^2+2α+2)/2(b^2(1+α)+α-1))\n.\n\nSubstituting this value in the equation x'(t)=0, we get the expression for the existence of cusps in β(t) as equation (<ref>).\nThis implicit curve g(b,α) has 5 branches namely b=g_j(α), j=1,2,⋯,5 as shown in Figure <ref>.\nThese bifurcation curves produce 6 different regions labeled as A, B, C, D, E, and F of b- α plane (see Figure <ref>). We list our observations below:\n\n\nIf the point (b,α) belongs to the region A i.e., if b>g_1(α), the boundary curve β(t) is a simple closed curve with a clockwise orientation. Thus, the regions inside as well as outside β(t) are unstable.\n\nIn the region B, we have g_2(α)<b<g_1(α). Here, β(t) becomes a multiple curve and has two unstable and one stable bounded region. As b decreases in B, the range of stable region goes on increasing.\n\nIf g_3(α)<b<g_2(α) (i.e. region C), β(t) becomes\na simple closed curve with anticlockwise orientation. Thus the inside part of β(t) is the stable region and the outside part is unstable.\nAs the value of b goes on decreasing, the stable region gets stretched horizontally and  a cusp is formed for b=g_3(α).\n\nAs b is further reduced i.e., when g_4(α)<b<g_3(α) (i.e. region D),\tthe cusp on the boundary curve β(t) evolves into a loop-shaped structure\nof clockwise orientation  making β a multiple curve with one stable\nand one unstable region. As the value of b moves closer towards g_4(α),\nthe area of unstable regions increases. At the bifurcation curve b=g_4(α),\ntwo cusps are observed on the boundary curve β on the right side.\n\nIn region E (g_5(α)<b<g_4(α)),  both of the cusps on the right of β evolve into two unstable regions along with the previous\nunstable region on the left side. Thus, the boundary curve β(t) has 3 unstable regions and one stable region. Reducing the value of b further results in the reduction of the size of the stable region.\n\nWhen b reaches the bifurcation curve b=g_5(α), the stable region disappears completely, leaving the boundary curve β(t) with 3 unstable regions. These regions are unstable as a result of their clockwise orientation.\n\nIn region F, i.e. for b<g_5(α) the boundary curve has four bounded unstable regions with a clockwise orientation. Thus, below the bifurcation curve g_5(α), the system\tbecomes completely unstable for all values of a. \n\nAs in the case of τ=1, we have checked all the above results numerically.\n\n\n\n\n\n§ ASYMPTOTIC LIMIT OF LARGE DELAY\n\nWe observe that we can stabilize a larger range of a values with τ=1 compared to τ=2. The reason is that there are more routes to instability for larger τ. We now consider the system (<ref>) for higher τ values. Let us take τ=20,21,40 and 41 for α=0.2. The boundary curves β have been plotted for the values of b=-0.5 and b=0.5 in the figures <ref> (a) and (b) respectively. In both figures, the stable region is in the center and is surrounded by the spring-like structure. This spring-like structure has a clockwise orientation and thus it is unstable. On the real axis, the upper bound is one. The lower bound is indicated intersection of the stability curve with the real axis.\nThe lower bound of real stable a is at β(π) when τ is even and b is positive or τ is odd and b is negative. However, as we increase τ, the lower bound approaches β(π).  For a given τ, the stable region  depends slightly on whether τ is even or odd and the sign of b. This dependence reduces as we increase τ. The upper bound is fixed at t=0 for the boundary curve β(t), the lower bound approaches β(π). We find that for large τ, the stable range of a does not depend on the sign of b and is given by a=1+2^α(| b | -1).\n\nThe b-a curves plotted in the figures <ref> and <ref> can be used to determine the values of feedback coefficient b to get the maximum stable range. As τ increases the b-a curve reaches a limiting region. As mentioned above, the stable b-a region  is given by a=1 and a=1+2^α(| b | -1) as τ→∞. \n\nIn a control system, the feedback term can be selected according to the requirements of the systems. We see that the maximum range of asymptotically stable fixed points can be obtained in the case of τ=1. So, one can use τ=1 to maximize the range of asymptotically stable fixed points of the system. Large delay can be used if the system requires enhanced chaos.\n\n\n\n§ EFFICACY OF CONTROL FOR LARGE NEGATIVE MULTIPLIERS\n\nThe range of stable real value of a ranges from 1-2^α to 1 for system (<ref>). The real range for integer order difference equation is between -1 and 1. There is a reduction in the real range for fractional order maps. Now a=-7 is outside stable range for any 0<α≤1. The stability of system (<ref>) depends on the feedback coefficient ‘b’ and the delay ‘τ’. For b=0 , we have system (<ref>) without feedback. Figure <ref> shows stability curves for system (<ref>) with α=0.25,τ=1, b=0 (in black) and b=6 (in red). The point a=-7 lies outside the black stability curve. It is enclosed within small stable region of the red curve. We analyze the stability of this point in both cases. We iterate the systems for t=500 time-steps. For b=0 case, the trajectory diverges and the solution is unstable (see Figure <ref>(a)). For b=6 case, the trajectory asymptotically converges to zero and the solution is stable(see Figure <ref>(b)). Thus large negative multipliers can be stabilized with feedback for τ=1.\n\n\n\n\n\nFor the system (<ref>) with τ=2, the effect is less dramatic. Figure <ref> shows the stability curves for systems (<ref>) with α=0.5,τ=2, b=0 (in black) and b=-0.6 (in blue). In the first case b=0, the point a=-1.1 lies outside the black stability curve and has an unstable solution (see Figure <ref>(a)). In second case b=-0.6, the point a=-1.1 lies inside the blue stability curve and has a stable solution as seen in Figure <ref>(b).\n\n\n\nThus, it is possible to stabilize a larger range of parameter values for a fractional order system by adding a feedback term with delay (system (<ref>)). The case of τ =1 gives the maximum range of stability with appropriate b and is recommended for control.\n\n\n\n§ NONLINEAR MAPS\n\n\nConsider a fractional order map with a feedback control\n\n    x(t)=x_0 + bx(t-τ)+1/Γ(α)∑_j=1^tΓ(t-j+α)/Γ(t-j+1)[f(x(j-1))-x(j-1)].\n\n\n\tA steady-state solution of (<ref>) is called an equilibrium point. Thus, if x_* is an equilibrium point of (<ref>) then x_0=x_* implies x(t)=x_* for all t=1,2,⋯.\n\nNote that, the only equilibrium point of (<ref>) is x_*=0 when we have f(0)=0. Therefore, we consider the systems (<ref>) with equilibrium point x_*=0.\n\nIn a neighborhood of the point x_*=0, we have f(x)≈ f(x_*)+(x-x_*)f'(x_*)=a x, where a=f'(0). Thus, the local stability properties of the nonlinear system (<ref>) at x_*=0 are the same as those of the linear system (<ref>).\n\nWe consider only real values of a and b, in this case. Therefore, the stable region given by the curve β(t) defined by (<ref>) is bounded by the curves a=1, a=-2^α(1-b(-1)^τ) and the parametric curve a(t)=2^α(sin(t/2))^α(cos(απ/2+t(1-α/2))-sin(απ/2+t(1-α/2))(απ/2+t(1-τ-α/2) ))+1,\n\nb(t)=sin(απ/2+t(1-α/2))/sin(απ/2+t(1-τ-α/2)), t∈[0,2π] in the b-a plane. We denote these curves as b-a curves.\n\nThus, the system  (<ref>) can be controlled if the point (b,a) with a=f'(0) lies inside the region bounded by these curves.\nWe consider the nonlinear systems  (<ref>) of fractional order α and delay τ.\nThe fractional logistic map in this model is defined by the equation  (<ref>) with f(x)=λ x(1-x), where λ is a parameter and a=λ(1-2x_*)=λ.\n\nSimilarly, the fractional cubic map is  (<ref>) with f(x)=β x^3+(1-β)x, where a=3β x_*^2+(1-β)=1-β.\n\nFigure <ref> shows the stability regions of all these systems for the τ=1 for various values of α.\n\nWe iterate these maps for T time-steps where T is large and the equilibrium or asymptotic equilibrium point is assumed to be stable if the convergence is obtained within δ. We know the boundaries of the stable fixed point in the b-a-plane a for linear system. For a=f'(0), we observe that the (b,a) values for stable fixed point lie in the analytically obtained bounds for both τ=1 and τ=2. For τ=1, we have plotted (b,a) values in Figure <ref> for α=0.25,0.5,0.75. It is observed for all the stable zero fixed points of the logistic, and cubic maps lie within the stable region defined by the b-a curves.\n\nWe find that this b-a region indeed encloses the stability region and gives precise bounds. Thus if the stable equilibrium point is known, the required strength of feedback for which the equilibrium point is stabilized can be found. The uncontrolled case corresponds to b=0 and if we want to stabilize (or destabilize) the equilibrium point an appropriate value of b can be used and desired range of stability can be obtained.  We have studied α=0.25,0.5,0.75 and τ=1. For τ=1, the stability region decreases in size with an increasing α.\n\n\nFigure <ref> confirms that the stable fixed point of the fractional maps lies within the curve enclosed by the α dependent b-a curves. Similarly, for τ=2, stability regions can be obtained for various values of α.\tThe stable regions for the zero fixed point for logistic, and cubic map with fractional order α=0.5 and τ=2  lie within the stable region derived for linear case (see Figure <ref>).\n\n\n\nNow we consider the case of large τ. We consider the fractional logistic map defined by the equation (<ref>) with f(x)=λ x(1-x), where f'(0)=λ=a. We iterate this map for  T=6×10^4 and the equilibrium point is assumed to be asymptotically stable if convergence is obtained within δ=10^-7. Here, we consider α=0.75 and τ=100. The triangular stability region encloses the asymptotically stable fixed points for the fractional logistic map. This is the generalized stable region for large τ. From the Figure <ref> it is clear that  the range of stable region does not increase for any nonzero  value of b. It decreases with larger | b|. Thus, the large delay is not useful in stabilizing the fixed point  for the fractional system (<ref>) and\nthe best results are obtained with τ=1. However, as mentioned above, larger τ can be used to destabilize the stable system. \n\n\n\nThe control term in this model is a delay term with coefficient `b'. In figure <ref> (a) and (c), an increment in the range of nonzero stable fixed points can be seen. We observe that the proper selection of control parameter b results in an extension of the range of the stable fixed points of the system. The maximum range of the nonzero stable fixed points can be found with the help of the b-a curve for that particular α value the of fractional system. The range of the stability of nonzero fixed points is extended in presence of feedback. Preliminary numerical investigations indicate\tthat the above conditions are necessary but not sufficient for the\tstability of nonzero fixed points. Further analytic investigations are needed to find the stability of nonzero fixed points. Figures <ref> (b) and (d) show the time series of the system.\n\n\n\n\n§ DISCUSSION AND CONCLUSION\n\nFractional order systems with delay have been investigated in many contexts.\nIn neural networks, numerous works have been done. In <cit.>, stability conditions, and the existence of Hopf bifurcation for fractional order BAM neural network (FOBAMNN) with delay have been established. In <cit.>, FOBAMNN with four delays has been turned into two delays and a correlation between stability and delay term has been studied. Investigation of fractional order neural network with multiple leakage delay shows that both fractional order and time delay are very important in controlling the transient behaviors of the FONN devised in <cit.>. The stability of fractional order triangle multi-delayed neural networks has been studied in <cit.>. A comparative study of integer order and fractional order delayed BAM neural network shows increased stability region <cit.>. In <cit.>, sufficient conditions for different delays for ensuring stability and generation of Hopf bifurcation have been demonstrated. Stability and bifurcation of an isovalent version of a fractional-order stage-structured predator–prey system have been investigated in <cit.>. Global asymptotic stabilization of fractional-order memristor-based neural networks (FMNNs) with time delay can be achieved by adjusting two groups of parameters as illustrated in <cit.>. The analysis of fractional order Bloch equation with delay shows behaviors ranging from damped oscillations to oscillations with increasing amplitude for various values of delay <cit.>.  In this work, we carry out basic investigations in \nthe context of fractional order diffference equations.\n\nControl of chaos in dynamical systems is an important aspect of studies in the theory of dynamical systems from viewpoint of applications. In integer order differential and difference equations, it is a well-studied problem both experimentally and theoretically. One of the simplest control schemes is feedback and the Pyragas method is one such method with feedback delay control to stabilize the chaotic systems. In this work, we studied systems defined by fractional difference equations coupled with a delay term. The delay term acts as a control in this system. We give analytic conditions for the stability of the fixed point of these systems for the arbitrary delay. More detailed analysis is carried out for τ=1 and τ=2 followed by analysis for asymptotic limit. A detailed analysis is carried out for τ=1 and τ=2. We give all bifurcation curves. They are given by g(b,α). For real maps, we give the generalized stable regions for τ=1, τ=2 and in the asymptotic limit. Using g(b,α), we obtain the upper and lower bound of b for particular α for which the stable regions exist. The stability region of a system depends on the fractional order α, delay τ, and the control parameter b. For nonlinear map f(x), the zero  fixed point with slope 'a=f'(0)' in the same b-a range. The boundary curve (<ref>) may enclose stable and/or unstable region/s for multiple combinations of α, τ and b. The criterion for finding out the stable and unstable region is also given using the orientation of the curve. Finally, we have studied nonlinear systems with fixed point x_*=0. Thus the results apply to a broad range of systems and this is a practical scheme for control. Our analysis can be used to stabilize/destabilize the fractional order difference system by introducing the appropriate delay term. The chaotic systems can be stabilized by selecting the delay τ=1 whereas the stable system can be made unstable/chaotic by selecting a larger value for τ.\n\n\n\n\n\n§ ACKNOWLEDGEMENT\n\n\nPMG and DDJ thank DST-SERB for financial assistance (Ref. CRG/2020/003993).\n\nplain\n\n\n"}