{"entry_id": "http://arxiv.org/abs/2303.07051v1", "published": "20230313121554", "title": "Hamiltonian Simulation Via Qubitized Downfolding Using $4\\log N+2$ Qubits", "authors": ["Anirban Mukherjee"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\n\nm.anirban7@tcs.com\nTCS Incubation,India\n\n\nThis paper reports a quantum algorithm for simulating quantum chemical systems of N molecular orbitals(MOs) using 4log N +2 qubits. The number of multi-electron configurations scales exponentially with the number of MOs and is the primary bottleneck in calculating the energy of a many-electron system. This paper introduces qubitized Hamiltonian downfolding(QHD) by combining the techniques of qubitized quantum walks and Hamiltonian downfolding to reduce the active space dimension systematically. At each stage of QHD, the number of many-electron configurations is reduced by 1/4 by decoupling the molecular orbital (MO) farthest from the highest occupied MO (HOMO). The sequence of such downfolding steps enables us to scale towards the low-energy HOMO-LUMO window. For each stage of downfolding, we map the decoupling condition i.e., a many-body normal-ordered Bloch equation to a system of quadratic polynomial equations. These downfolding equations can be solved using the Levenberg-Marquadt Method (LMM). Each LMM step involves a Hessian inversion and comprises a quantum linear system problem(QLSP). We describe quantum circuits that block-encode the Hessian using qubitization oracles. Subsequently, we implement the Chebyshev expansion for Hessian inversion utilizing a sequence of qubitized quantum walks. Starting from an N-orbital system the gate complexity of each downfolding circuit scales as O(N^2log^2(1/ϵ)) and for downfolding all the MOs involve O(N^3/ϵ^2) oracle queries.\n\nHamiltonian Simulation Via Qubitized Downfolding Using 4log N+2 Qubits\n    Anirban Mukherjee\n    Accepted xxxx xxxxxx xx. Received xxxx xxxxxx xx; in original form xxxx xxx xx\n==================================================================================\n\nIntroduction- \nIn most problem of practical interest the\ncomputational bottleneck is finding the electronic energy\nas a function of the nuclei coordinates. If we can calculate a chemically accurate potential energy surface(PES) with lesser computational time it has direct implication for Molecular dynamics or Monte-Carlo simulations.\n\nTo formulate the electronic problem, we use the Born-Oppenheimer approximation: it allows the construction of the electronic Hamiltonian as a function of the nuclear coordinates. Both the one-electron and two-electron potentials namely h_ij and h_ijkl are N^2 and N^4 dimensional objects. The associated electronic Hamiltonian (H) is a massive object for N molecular orbitals that has a 2^2N× 2^2N matrix representation. The eigenvalues and eigenvectors of H describe a many-electron system's static and dynamic properties. However, the computational complexity for eigenvalue decomposition of H scales exponentially with N. An alternate way to solve the problem would be to construct effective Hamiltonians from H that act on a reduced space of orbitals.\nThe effective Hamiltonian is a lower-dimensional representation of the full many-body Hamiltonian H, which describes the physics of a reduced subspace. Constructing an effective Hamiltonian is a central goal in physics, with applications in the study of quantum phase transitions<cit.>, quantum chemistry simulations <cit.>. The concept of effective Hamiltonian emerges in a diverse set of many-body methods: many-body perturbation theory<cit.>, Scheiffer-Wolff transformation<cit.>, similarity transformation<cit.>, continuous unitary transformations<cit.>, Hamiltonian truncation<cit.>, Feshbach-Lowdin-Fano method<cit.>, multireference perturbation theory<cit.>, Hamiltonian Monte Carlo<cit.>, Numerical renormalization group <cit.>, Hamiltonian downfolding<cit.>.\nAnother approach for estimating energy is the quantum phase estimation algorithm based on Qubitization<cit.>. The time evolution operator used in phase estimation e^iHT is reconstructed using quantum signal processing <cit.> starting from the Quantum walk operator e^iarccos(H/||H||_1), ||H||_1 is the 1-norm of the Hamilonian.  In <cit.>, the authors present an efficient way of representing the Hamiltonian in a quantum circuit using double factorization and tensor hypercontraction. It substantially reduces quantum resource usage compared to single factorization and quantum phase estimation. However, the number of physical qubits and Toffoli gates required is still very high. \n In this work, we sytematically decouple Molecular orbital by  Hamiltonian downfolding. The many body Bloch equation embodies every similarity downfolding transformation step. We derive a system of polynomial equations from the Bloch equations for downfolding one-molecular orbital. We describe Quantum Circuits to facilitate solving the algebraic equation, which helps us construct a lower dimensional Hamiltonian with one MO less every downfolding step. The entire process gets repeated for every orbital downfolding, leading to a smaller dimensional Hamiltonian.\n In the methods section, we will showcase the QHD (Fig<ref>)and the resulting multireference coupled cluster equations. Further, we will lay out the expressions for the systematic RG flow of the effective Hamiltonian. Each downfolding transformation gets generated from a similarity operation, and its parameters get determined from the\nBloch equation. The Bloch equation embodies decoupling the primary space from the secondary space. The major result of this work is the closed-form analytical expressions of the state-universal\nmultireference coupled cluster equations obtained from the Bloch equation. We show that the similarity transformation mapping\nthe chemical system of N molecular orbitals to N-1 molecular orbitals gets determined by solving a rectangular system of multivariate quadratic polynomials with m = O(n^2)\npolynomials and n=N(N-1) parameters. We present a method for solving this system\nof equations using LMM. We replace one of the costliest steps in LMM, i.e., inverting the Hessian with Chebyshev's approach<cit.> implemented using\nqubitized quantum walks. Finally, in the results section, we obtain scaling relations for the no. of qubits, gate complexity, and the number of queries required to solve the Multireference downfolding equations. \nSystem Description- We consider a system of N-correlated Hartree-Fock(HF) MOs corresponding to a chemical system. Then the fermionic Fock-space Hamiltonian in MO basis is represented as,\n\n    H=∑_ijσh^1,(N)_ijf^†_iσf_jσ+∑_ijklσσ'h^2,(N)_ijklf^†_iσf^†_jσ'f_kσ'f_lσ,\n\nwhere h^1_ij is the one-electron tensors and h^2_ijkl is the two-electron interaction tensor. σ=↑/↓ represents the up and down spin orbitals.Energy Level Grouping of the HF-MO's\nThe HF MOs get grouped into virtual orbitals 𝒱, core orbitals 𝒞, and active space orbitals 𝒜. We specify the absolute energy difference of the HF MO's (labeled k's) from the HOMO(highest occupied molecular orbital) energy E_HOMO as ϵ_k=|E_i-E_HOMO|. The MO labels 1, 2, …, N are ordered with reference to the absolute energy differences as  ϵ_1≤ϵ_2≤...≤ϵ_N. If k∈𝒱 then within Hartree-Fock theory the MO is unoccupied n_k↑+n_k↓=0. If k ∈𝒞 then n_k↑+n_k↓=2. And if k ∈𝒜 then n_k↑+n_k↓=0, 1, 2\nHamiltonian downfolding scheme-With the above orbital ordering per their H.F. energy reference, we set the stage for systematically downfolding MOs starting from the highest energy MO's scaling down towards the low energy HOMO-LUMO(lowest unoccupied Molecular orbital) window. For decoupling the outermost orbital N∈𝒱 we partition the many-body Hilbert space ℋ^⊗2N into a primary space (P_(N)) and a secondary space (Q_(N)):\n\n    P_(N)   =   (1-n̂_N↑)(1-n̂_N↓)\n    \n    Q_(N)   =   n̂_N↑+n̂_N↓+n̂_N↑n̂_N↓\n\nHere n̂_kσ=f^†_kσf_kσ. Together P_(N)+Q_(N)=I^⊗ 2N comprise the complete Hilbert space. We seek a similarity transformation S_(N)=exp(η_(N)) generated by η_(N) such that the Bloch equation is satisfied,\n\n    Q_(N)S^-1_(N),kHS_(N),kP_(N)   =   ∑_j=1^mF_j(𝐡^(N),𝐭^(N)):Ê_j:= 0\n\nHere :Ê_j: represents the normal ordered Fermionic excitation operators and F_j(𝐡^(N),𝐭^(N)) represents the residuals. They comprise a vector 𝐅^(N).\nIf the generator η_(N) satisfies the linearization condition Q_(N)η_(N)P_(N)=η_(N)  then a linear representation of the similarity transform S_(N)=1+η_(N)  can be obtained. We motivate a choice \nfor η_(N) from the terms within the Hamiltonian block Q_(N)HP_(N) eq.(<ref>) that carries electronic excitation's between spaces P_(N) and Q_(N),\n\n    η_(N)   =   ∑_it^1,(N)_i(1-n̂_i-σ)f^†_Nσf_iσ\n       +   ∑_ijt^2,(N)_ijf^†_N↑f^†_N↓f_i↓f_j↑\n\nThe generator comprises of the singles excitation amplitudes t^1,(N)_i and doubles excitation amplitudes t^2,(N)_ij. \nWith the form for η_(N) above, both the linearization condition and the size consistency and extensivity condition are satisfied. We replace the form for η_(N) eq.(<ref>) into the Bloch equation eq.(<ref>) and normal-order (N.O.) the expressions for the fermionic operators. \nFor the Bloch equation eq.(<ref>) to be satisfied, the coefficients of the independent N.O. fermionic terms must vanish: singles excitation-(iσ→ Nσ), doubles excitations-((kσ,lσ)→ (jσ', Nσ)), paired doubles excitations-((i↑,j↓)→ (N↓, N↑)), triples excitations involving paired doubles((l'↑,k'↓,lσ)→(kσ, N↓, N↑)). As a result, the Bloch equation leads to the following multireference downfolding equations:\n\n    𝐀=(𝐭^1_𝐍·𝐡^1_𝐍)𝐭^1_𝐍-𝐡^1_𝐍=0\n          𝐁=[𝐡^1_𝐍⊗𝐭^1_𝐍+𝐠_N⊙𝐭^1_𝐍]⊗𝐭^1_𝐍-𝐡^2_𝐍=0\n          𝐂=𝐭^2_𝐍·𝐡^2_𝐍𝐍𝐭^2_𝐍-𝐡^1_𝐍⊗𝐭^1_𝐍-h^2_N-𝐡^2_𝐍𝐍=0\n          𝐃=(𝐭^2_𝐍⊙𝐡^2_𝐍𝐍)⊗𝐭^2_𝐍-𝐡^2_𝐍⊗𝐭^1_𝐍=0\n\nHere (𝐭^1_𝐍)_i=t^1,(N)_i is a n_1=(N-1)-length vector comprising the singles excitation amplitudes. 𝐭^2_𝐍 is a (N-1)^2-length vector comprised of doubles excitation amplitudes (𝐭^2_𝐍)_ab=t^2,(N)_ab. The vectors 𝐡^1_𝐍, 𝐡^2_𝐍 of dimensions (N-1) and (N-1)^3 comprise of one-electron tensors(𝐡^1_𝐍_i=h^1,(N)_i) and two-electron tensors((𝐡^2_𝐍)_ijk=h^2,(N)_Nijk) coupling Nth MO to other MO's. 𝐡^2_𝐍.𝐍. comprises all the two-electron tensor contributions ((𝐡^2_𝐍.𝐍.)_ij=h^2_NNij)that couples the paired excitation of the Nth MO with other spin orbitals. Here 𝐀⊗𝐁 denotes the tensor-product of two vectors whose elements are (𝐊⊗𝐋)_ij=K_iL_j. Here 𝐠_𝐍 is a (N-1)^2-element vector (𝐠_𝐍)_jk=𝐡_𝐣𝐤𝐍-𝐡_𝐣𝐍𝐤 comprising of two-electron vectors: (𝐡_𝐣𝐤𝐍-𝐡_𝐣𝐍𝐤)_i=h_ijkN-h_ijNk. The above equations, (⊙) represents the row-wise dot product. For the vector's 𝐠_𝐍 and  𝐭^1_𝐍 the elements of the row-wise dot product 𝐠_𝐍⊙𝐭^1_𝐍 is given by (𝐠_𝐍⊙𝐭^1_𝐍)_jk=(𝐡_𝐣𝐤𝐍-𝐡_𝐣𝐍𝐤)·𝐭^1_N. Similarly\nthe elements of row-wise dot product (𝐭^2_N⊙𝐡^2_NN)_ij=\n𝐭^2,(𝐍)_𝐢·𝐡^2_𝐍𝐍𝐣. Here (𝐭^2,(𝐍)_𝐢)_j=t^2,(N)_ij  and (𝐡^2_𝐍𝐍𝐣)_i=h^2_NNij represent the elements of double excitation amplitudes and two-electron tensor for the paired excitation respectively. \nThese downfolding equations eq.(<ref>)-(<ref>) correspond to a rectangular system of multi-variable quadratic polynomials. There are m=n^2/2-n(N-2) polynomial equations of n=N(N-1) parameters. The system of m equations are partitioned into four parts (A-D); we define the individual number m_A,m_B,m_C,m_D below: The equation system 𝐀(<ref>) comprises m_A=(N-1) elements, 𝐁(<ref>) comprises m_B=1/2(N-1)^2(N-2) elements, 𝐂(<ref>) comprises m_C=(N-1)^2 elements and eqs. 𝐃(<ref>) comprises m_D=1/2(N-1)^3(N-2).\nHamiltonian RG flow from Downfolding\nThe similarity transformation S_(N) on the starting Hamiltonian H_(N)=H leads to a renormalized Hamiltonian H_(N-1) in the primary space P_(N) with a self-similar form,\n\n    H_(N-1)   =   P_(N)S^-1_(N)H_(N)S_(N)P_(N)\n       =   (1-n̂_N↑)(1-n̂_N↓)[∑_ij=1,σ^N-1h^1,(N-1)_ijf^†_iσf_jσ\n       +   ∑_ijkl=1,\n    σσ'^N-1h^2,(N-1)_ijklf^†_iσf^†_jσ'f_kσ'f_lσ]\n\nThe one and two-electron tensors comprising the renormalized Hamiltonian H_(N-1) are related to the bare one and two-electron tensors in eq(<ref>) and the amplitudes t^1,(N) and t^2,(N) of the generator(η) eq(<ref>) as follows:\n\n    h_ij^1,(N-1)   =   h^1,(N)_ij+h^1,(N)_iNt^1,(N)_j\n    \n    h^2,(N-1)_ijkl   =   h^2,(N)_ijkl+h^2,(N)_ijkNt^1,(N)_l+δ_σ',-σh^2,(N)_ijNNt^2,(N)_kl     .\n\nThe effect of downfolding the electronic correlations coupling Q_(N) to P_(N) was to renormalize the one-electron eq.(<ref>) and two-electron interaction tensor contributions eq.(<ref>) in the primary space using the excitation amplitudes of the generator η eq.(<ref>). From the RG flow equation of the Hamiltonian H_(N-1) (eq.(<ref>)) we make two important observation: first the indexes in the one and two-electron tensors (h^1,(N-1_ij, h^2,(N-1)_ijkl) runs over MO indices 1 to N-1 i.e. leaving out the Nth MO. The Nth orbital gets decoupled with only an overall diagonal contribution. This remains true even if N∈𝒞  where P_(N)=n̂_↑n̂_↓ and for N∈𝒜 : P_(N)=n̂_↑n̂_↓ or (1-n̂_↑)(1-n̂_↓). However, in that case, the energetic contribution from the diagonal term may change. Second observation is that no new many-body excitation clusters are created. This results from the choice of η where paired doubles at the Nth MO get excited t^2,(N)_ij. The choice of η automatically terminates the hierarchy of the three-particle or higher-order clusters. Such a description allows the self-similar representation of the Hamiltonian to prevail. The next set of RG equations that describes the Hamiltonian coefficients for a system of N-2 MOs are derived from the N-1 MOs (<ref>), (<ref>). \nFlow towards diagonalization\nAfter s downfolding steps, we obtain a reduced Hamiltonian,\n\n    H_(s)   =   ∏_a=N,\n    σ=↑,↓^N-p(1-n̂_aσ)∏_a=N-p-1,\n    σ=↑,↓^N-s+1n̂_aσ[∑_ij=1,σ^N-sh^1,(N-s)_ijf^†_iσf_jσ\n       +   ∑_ijkl=1,\n    σσ'^N-sh^2,(N-s)_ijklf^†_iσf^†_jσ'f_kσ'f_lσ]  .\n\nAt the end of the RG flow, the ground state energy of the system and its electronic configuration can be directly read off from the Hamiltonian.\nTo obtain the excitation amplitudes used in the RG equation, we need to solve the Hamiltonian downfolding equations 𝐀-𝐃((<ref>)-(<ref>)). Solving this system of equations is the computational bottleneck of this approach. In the next section, we describe the LMM for solving the downfolding equations.Quantum algorithm for solving the Bloch equation   \n \nWe search for the solution to the downfolding equations eq.(<ref>)-(<ref>) using the Levenberg-Marquadt Method (LMM). For the kth step: with parameter vector t_k=(𝐭_𝐤^1,𝐭_𝐤^2)^T in ℛ^n and residual vector 𝐅_k=(𝐀,𝐁,𝐂,𝐃)^T in ℛ^m the LMM <cit.>  search direction d^k is given by,\n\n    d^k(t_k)=(ℍ_k)^-1J_k^T𝐅_k,\n\nwhere the Jacobian J_k,\n\n    J_k=[ (∇_𝐭^1_𝐤𝐀^T_k)^T                0; (∇_𝐭^1_𝐤𝐁^T_k)^T                0; (∇_𝐭^1_𝐤𝐂^T_k)^T (∇_𝐭^2_𝐤𝐂^T_k)^T; (∇_𝐭^1_𝐤𝐃^T_k)^T (∇_𝐭^2_𝐤𝐃^T_k)^T ] , .\n\nThe Hessian ℍ_k=(J^T_kJ_k+μ_k) where μ_k is a positive parameter. From the references <cit.> based on the convergence criterion (||J_k𝐅_k||<ϵ), we obtain the upper bound for the number of successful LMM updates,\n\n    N_Total<||J_0||^2||𝐅_0||^2/ϵ^2\n\nFor our system of equations we get ||F_0||^2=Nϵ_0^4f(𝐡^1_𝐍,𝐡^2_𝐍), assuming that the initial set of parameters t^1,(N)_i=ϵ_0 and t^2,(N)_ij=ϵ_0/4. Similarly the norm of the Jacobian ||J_0||^2=Nϵ_0^2g(𝐡^1_𝐍,𝐡^2_𝐍). With the above description of the LMM parameters, we find that the upper-bound of the total number of LMM iterations for the equations to converge with ||J_kF_k||<ϵ is N_Total=O(N^2/ϵ^2C).\nHere C=f(𝐡^1_𝐍,𝐡^2_𝐍)g(𝐡^1_𝐍,𝐡^2_𝐍) is a scalar function of the vectors 𝐡_1 and 𝐡_2 its value will depend on the chemical system under study. Note that at every LMM step a n× n Hessian matrix ℍ=(J_k^TJ_k+μ_k)  needs to be inverted. The classical computational complexity of inverting the matrix scales as N_ℍ^-1=O(n^3)=O(N^6). \nFrom above we identify that calculating ℍ_k^-1 is the computational bottleneck of the LMM method. \nBlock-encoding the Hessian in an Oracle\nWe will implement a Quantum algorithm-the Child's Quantum walk approach<cit.> for matrix inversion using Chebysyev Polynomials.\n To make the calculation amenable for a quantum computing approach we first embed the Jacobian in a 2^D=m+n+pad dimensional system.\nThe operation B_J,   \n\n    B_J=[ I_n√(μ)       0       0;       J     I_m       0;       0       0   I_pad ]\n\nNote that in the embedding B_J of J, we have suppressed the k-index of the LM method for both the Jacobian J and the parameter μ. The identity matrices are I_m, I_n, and I_p.We note that B_J is a d-sparse matrix where d=(n+1) as that is the maximum number of non-zero entries in a given row. Moving forward, we will implement a block-encoding framework for B_J and follow the procedure outlined for d-sparse matrices<cit.>. To the system of D/2=2log N qubits we add D/2+2 ancilla qubits(a's) |G⟩=|0⟩_a_1|0⟩_a_2|0⟩_a_3. Quantum registers a_1 and a_2 have one qubit each and quantum register a_3 involves D qubits. With this additional qubits we define the isometries (F_j is the set of column indices l∈ [d] with non-zero entries),    \n\n    T_1   =   ∑_j=1^2^D∑_p∈ F_jÔ^1_j|j⟩_s|p⟩_a_3|0⟩_a_2|0⟩_a_1⟨ 0|_a⟨ j|_s ,\n    \n    T_2   =   ∑_k=1^2^D∑_p ∈ F_kÔ^2_k|p⟩_s|k⟩_a_3|0⟩_a_2|0⟩_a_1⟨ 0|_a⟨ k|_s .\n\nThe oracles O^1_j and O^2_k are defined as,\n\n    Ô^1_j   =   ∑_p∈ F_jI_s⊗|p⟩_a_3⟨ p|_a_3⊗ I_a_2⊗ Y_a_1(θ_pj) ,\n    Ô^2_k   =   ∑_p∈ F_k|p⟩_s⟨ p|_s⊗ I_a_3⊗ Y_a_2(θ_kp)⊗ I_a_1,\n\nHere Y_a_1(θ_pj)=e^iarccos(θ_pjσ^y_a_1) does Pauli Rotation about Y axis with θ_pj=(B_J)_pj/d||B_J||_max . With the description of the isometries we can construct the unitary U_B_J=T_2^†T_1 such that,\n\n    ⟨ G|U_B_J|G⟩ = B_J/d||B_J||_max\n\nTo block-encode ℍ we now implement the oracle,\n\n    ⟨ G|C_ΠZ U_B_J^TU_B_JC_ΠZ|G⟩   =   Π_n B_J^TB_JΠ_n/(d||B_J||_max)^2\n       =   J_k^TJ_k+μ_k/(d||B_J||_max)^2\n\nwhere Π_n=[     I_n       0;       0 0_m+pad ]⊗ I_2^⊗ 2 and C_ΠZ is a single-ancilla controlled-Z rotation \n\n    C_ΠZ=|0⟩⟨ 0|⊗ I_2^⊗ (D+1)+|1⟩⟨ 1|⊗ (2Π_n-I_2^⊗ (D+1)) ,\n\non the (D+2)-qubit space. After successful block-encoding, we discuss the scaling formulas for quantum resources required for downfolding in the next section.\nResults\nFirstly we talk about the quantum resources required for block-encoding the Hessian; then, we estimate the number of queries required for Child's quantum walk. From there, we obtain the gate complexity for matrix inversion. Finally, we discuss the number of LMM iterations needed for convergence. \nThe gate complexity needed to perform a (d||B_J||_max,D/2+2,ϵ) block-encoding of ℍ is bounded by <cit.>,\n\n    N_ℍ   <   O(2log N+log^2.5(2N^2/ϵ(ℍ))) .\n\nNote in the above equation we have replaced the condition number κ of ℍ by its upper-bound κ<2/det(ℍ)<cit.>. The QLSP eq.(<ref>)(ℍ_kd^k(𝐭_k)=J_k^T𝐅_k) can be solved by a Chebyshev expansion of (ℍ^-1)<cit.>. The Chebyshev polynomials are implemented by constructing qubitized quantum walks with the oracle C_ΠZ U_B_J^TU_B_JC_ΠZ. From <cit.> we  obtain the gate complexity for calculating (ℍ_k)^-1, \n\n    N_ℍ^-1< O(4N^2/det(ℍ)^2log ^2(N/det(ℍ)ϵ))N_ℍ.\n\nNow we summarize our major result: to solve the downfolding equations for decoupling one molecular orbital, with accuracy ϵ for the LMM and ϵ' for the Hessian inversion requires O(N/ϵ^2) LMM queries to a qubitized quantum walk circuit with O(4log N) system+ancilla qubits. The Hessian matrix (ℍ) inversion circuit requires O(N^2/det(ℍ)log^2 (1/ϵ)) gates to be implemented.\nAcknowledgement The author would like to thank his collegeaus Vidyut Navelkar, CV Sridhar, Godfrey Claudin Matthias, Sayantan Pramanik, Ananthakrishna Gopal, Soumya Das, Sourav Chatterjee from TCS Incubation and Anil Sharma head of TCS incubation for their constructive feedback and support. The author would like to thank Manoj Nambiar, M.R. Nirmal, Shampa Sarkar, Arijit Roy from TCS Research. The author also will like to thank Geetha Srinivasan and Swadha Anand from the Life Sciences Business Unit at TCS. \nDeclaration The provisional specification for this work has been filed with the Indian Patent Office, Application No. 202221070912.\n\n\n10\n\nBabbushHartmut2018\nRyan Babbush, Craig Gidney, Dominic W. Berry, Nathan Wiebe, Jarrod McClean,\n  Alexandru Paler, Austin Fowler, and Hartmut Neven.\nEncoding electronic spectra in quantum circuits with linear t\n  complexity.\nPhys. Rev. X, 8:041015, Oct 2018.\n\nbauman_kowalski_2019\nNicholas P. Bauman, Eric J. Bylaska, Sriram Krishnamoorthy, Guang Hao Low,\n  Nathan Wiebe, Christopher E. Granade, Martin Roetteler, Matthias Troyer, and\n  Karol Kowalski.\nDownfolding of many-body hamiltonians using active-space models:\n  Extension of the sub-system embedding sub-algebras approach to unitary\n  coupled cluster formalisms.\nThe Journal of Chemical Physics, 151(1):014107, 2019.\n\nBerrySomma2015\nDominic W. Berry, Andrew M. Childs, Richard Cleve, Robin Kothari, and\n  Rolando D. Somma.\nSimulating hamiltonian dynamics with a truncated taylor series.\nPhys. Rev. Lett., 114:090502, Mar 2015.\n\nBerry2015\nDominic W. Berry, Andrew M. Childs, and Robin Kothari.\nHamiltonian simulation with nearly optimal dependence on all\n  parameters.\nIn 2015 IEEE 56th Annual Symposium on Foundations of Computer\n  Science. IEEE, October 2015.\n\nberry2015hamiltonian\nDominic W Berry, Andrew M Childs, and Robin Kothari.\nHamiltonian simulation with nearly optimal dependence on all\n  parameters.\nIn 2015 IEEE 56th annual symposium on foundations of computer\n  science, pages 792–809. IEEE, 2015.\n\nBravyi2011\nSergey Bravyi, David P. DiVincenzo, and Daniel Loss.\nSchrieffer–wolff transformation for quantum many-body\n  systems.\nAnnals of Physics, 326(10):2793–2826, October 2011.\n\nCapuzzi1996\nF. Capuzzi and C. Mahaux.\nProjection operator approach to the self-energy.\nAnnals of Physics, 245(1):147–208, January 1996.\n\nChaudhuri2005\nRajat K. Chaudhuri, Karl F. Freed, Gabriel Hose, Piotr Piecuch, Karol Kowalski,\n  Marta Włoch, Sudip Chattopadhyay, Debashis Mukherjee, Zoltán Rolik,\n  Ágnes Szabados, Gábor Tóth, and Péter R.\n  Surján.\nComparison of low-order multireference many-body perturbation\n  theories.\nThe Journal of Chemical Physics, 122(13):134105, April 2005.\n\nchilds2017quantum\nAndrew M Childs, Robin Kothari, and Rolando D Somma.\nQuantum algorithm for systems of linear equations with exponentially\n  improved dependence on precision.\nSIAM Journal on Computing, 46(6):1920–1950, 2017.\n\nosti_447586\nE Clementi.\nEffective hamiltonian and density funtionals in computational\n  chemistry.\n12 1996.\n\ncohen2021hamiltonian\nTimothy Cohen, Kara Farnsworth, Rachel Houtz, and Markus A. Luty.\nHamiltonian truncation effective theory, 2021.\n\nDomcke1991\nW. Domcke.\nTheory of resonance and threshold effects in electron-molecule\n  collisions: The projection-operator approach.\nPhysics Reports, 208(2):97–188, October 1991.\n\nguggenheimer1995simple\nHeinrich W Guggenheimer, Alan S Edelman, and Charles R Johnson.\nA simple estimate of the condition number of a linear system.\nThe College Mathematics Journal, 26(1):2–5, 1995.\n\nMotaoki2018\nMotoaki Hirayama, Youhei Yamaji, Takahiro Misawa, and Masatoshi Imada.\nAb initio effective hamiltonians for cuprate superconductors.\nPhys. Rev. B, 98:134501, Oct 2018.\n\nlee2021even\nJoonho Lee, Dominic W Berry, Craig Gidney, William J Huggins, Jarrod R McClean,\n  Nathan Wiebe, and Ryan Babbush.\nEven more efficient quantum computations of chemistry through tensor\n  hypercontraction.\nPRX Quantum, 2(3):030305, 2021.\n\nLow2019\nGuang Hao Low and Isaac L. Chuang.\nHamiltonian simulation by qubitization.\nQuantum, 3:163, July 2019.\n\nMartynChuang2021\nJohn M. Martyn, Zane M. Rossi, Andrew K. Tan, and Isaac L. Chuang.\nGrand unification of quantum algorithms.\nPRX Quantum, 2:040203, Dec 2021.\n\nMondalVary2020\nChandan Mondal, Siqi Xu, Jiangshan Lan, Xingbo Zhao, Yang Li, Dipankar\n  Chakrabarti, and James P. Vary.\nProton structure from a light-front hamiltonian.\nPhys. Rev. D, 102:016008, Jul 2020.\n\nMukherjee_2020_1\nAnirban Mukherjee and Siddhartha Lal.\nScaling theory for mott–hubbard transitions: I. t = 0\n  phase diagram of the 1/2-filled hubbard model.\nNew Journal of Physics, 22(6):063007, jun 2020.\n\nMukherjee_2020_2\nAnirban Mukherjee and Siddhartha Lal.\nScaling theory for mott–hubbard transitions-II: quantum\n  criticality of the doped mott insulator.\nNew Journal of Physics, 22(6):063008, jun 2020.\n\nNg1985\nBetty Ng and D. J. Newman.\nMany-body perturbation theory for effective hamiltonians using\n  nonorthogonal basis sets.\nThe Journal of Chemical Physics, 83(4):1758–1768, August 1985.\n\nPokhilko2020\nPavel Pokhilko and Anna I. Krylov.\nEffective hamiltonians derived from equation-of-motion\n  coupled-cluster wave functions: Theory and application to the hubbard and\n  heisenberg hamiltonians.\nThe Journal of Chemical Physics, 152(9):094108, March 2020.\n\nSachdev2007\nSubir Sachdev.\nQuantum phase transitions, December 2007.\n\nSchollwck2005\nU. Schollwöck.\nThe density-matrix renormalization group.\nReviews of Modern Physics, 77(1):259–315, April 2005.\n\nWolff1966\nJ. R. Schrieffer and P. A. Wolff.\nRelation between the anderson and kondo hamiltonians.\nPhys. Rev., 149:491–492, Sep 1966.\n\nSkomorowski2021\nWojciech Skomorowski and Anna I. Krylov.\nFeshbach–fano approach for calculation of auger decay\n  rates using equation-of-motion coupled-cluster wave functions. II.\n  numerical examples and benchmarks.\nThe Journal of Chemical Physics, 154(8):084125, February 2021.\n\nsuzuki1980convergent\nKenji Suzuki and Shyh Yuan Lee.\nConvergent theory for effective interaction in nuclei.\nProgress of Theoretical Physics, 64(6):2091–2106, 1980.\n\nsuzuki1983degenerate\nKenji Suzuki and Ryoji Okamoto.\nDegenerate perturbation theory in quantum mechanics.\nProgress of Theoretical Physics, 70(2):439–451, 1983.\n\nTenno2013\nSeiichiro Ten-no.\nStochastic determination of effective hamiltonian for the full\n  configuration interaction solution of quasi-degenerate electronic states.\nThe Journal of Chemical Physics, 138(16):164126, April 2013.\n\nueda2010global\nKenji Ueda, Nobuo Yamashita, et al.\nOn a global complexity bound of the levenberg-marquardt method.\nJ. Optim. Theory Appl., 147(3):443–453, 2010.\n\nWilson1975\nKenneth G. Wilson.\nThe renormalization group: Critical phenomena and the kondo problem.\nRev. Mod. Phys., 47:773–840, Oct 1975.\n\nzhao2016global\nRuixue Zhao and Jinyan Fan.\nGlobal complexity bound of the levenberg–marquardt method.\nOptimization Methods and Software, 31(4):805–814, 2016.\n\n\n\n"}