{"entry_id": "http://arxiv.org/abs/2303.07049v1", "published": "20230313121451", "title": "High-resolution He I 10830 Å narrowband imaging for precursors of chromospheric jets and their quasi-periodic properties", "authors": ["Ya Wang", "Qingmin Zhang", "Zhenxiang Hong", "Jinhua Shen", "Haisheng Ji", "Wenda Cao"], "primary_category": "astro-ph.SR", "categories": ["astro-ph.SR"], "text": "\n\n   \n\n   \n \n   1Key Laboratory of Dark Matter and Space Astronomy, Purple Mountain Observatory, CAS, Nanjing, 210023, People's Republic of China \n\n    2Xinjiang Astronomical Observatory, CAS, Urumqi, 830011, People's Republic of China \n\n     3Big Bear Solar Observatory, New Jersey Institue of Technology, Big Bear City, CA 92314, USA  \n\n                  wangya@pmo.ac.cn\n\n   \n   High-resolution He  I  10830 Å narrowband imaging for the precursor of chromospheric jets and the quasi periodic property\n   Y. Wang; Q. Zhang; Z. Hong, et al. \n \n\n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n   \nSolar jets are well-collimated plasma ejections in the solar atmosphere. They are prevalent in active regions, the quiet Sun, and even coronal holes. They display a range of temperatures, yet the nature of the cool components has not been fully investigated. In this paper, we show the existence of the precursors and quasi-periodic properties for two chromospheric jets, mainly utilizing the He i 10830 Å narrowband filtergrams taken by the Goode Solar Telescope (GST). The extreme ultraviolet (EUV) counterparts present during the eruption correspond to a blowout jet (jet 1) and a standard jet (jet 2), as observed by  the Atmospheric Imaging Assembly (AIA) on board the Solar Dynamic Observatory (SDO). The high-resolution He i 10830 Å observation captures a long-lasting precursor for jet 1, signified by a series of cool ejections. They are recurrent jet-like features with a quasi-period of about five minutes. On the other hand, the cool components of jet 2, recurrently accompanied by EUV emissions, present a quasi-periodic behavior with a period of about five minutes. Both the EUV brightening and He i 10830 Å absorption show that there was a precursor for jet 2 that occurred about five minutes before its onset. We propose that the precursor of jet 1 may be the consequence of chromospheric shock waves, since the five-minute oscillation from the photosphere can leak into the chromosphere and develop into shocks. Then, we find that the quasi-periodic behavior of the cool components of jet 2 may be related to magnetic reconnections modulated by the oscillation in the photosphere. \n\n \n\n   \n   High-resolution He  I  10830 Å narrowband imaging for chromospheric jets \n   High-resolution He  I  10830 Å narrowband imaging for precursors of chromospheric jets and their quasi-periodic properties\n    Ya Wang1; Qingmin Zhang1; Zhenxiang Hong1; Jinhua Shen2; Haisheng Ji1; Wenda Cao3\n    Received; accepted\n==========================================================================================================================\n\n\n\n\n\n\n§ INTRODUCTION\n \n \nJets are common in the solar atmosphere, occurring from the photosphere to the corona and featuring a range of temperature components  <cit.>. They are widely distributed in active regions, quiet regions <cit.>, and polar regions <cit.>. They are beams of plasma moving along an open magnetic field, usually associated with microflares, radio type III bursts, and so on. Jets could also occur in closed-field structures, such as loops <cit.>. Frequent jet activities are considered to be associated with coronal heating, the occurrence of coronal mass ejections (CMEs), filament oscillations, magnetohydrodynamic waves, solar wind, and other phenomena <cit.>. \n\n\nJets were  observed early as Hα surges from ground-based telescopes <cit.>. With space instruments, they have been observed in X-ray and EUV passbands, thus, they have been dubbed X-ray jets  <cit.> and EUV jets  <cit.>. With improved resolution, many small-scale jet-like events have been reported, such as spicules and dynamic fibrils, possibly formed in the similar mechanism as those of large-scale jets <cit.>. Recent high-resolution observations have revealed numerous transient, small-scale, collimated outflows, denoted as jetlets <cit.>, at the base of coronal plume. These so-called jetlets also have an important role in heating the upper atmosphere <cit.>. \n\n\nCoronal jets can be classified as standard jets and blowout jets <cit.>. These definitions have been given in terms of the morphological description of coronal jets observed by Solar-B pre-launch/X-ray Telescope (Hinode/XRT) <cit.>. Standard jets are typical anemone jets, with λ types or inverted-Y structures in morphology. They are generally interpreted as a small-scale magnetic bipole reconnecting with the ambient open magnetic field <cit.>. The standard jet model can be used to explain X-ray and EUV jets based on the atmospheric layer where the magnetic reconnection had occurred <cit.>. By comparison, blowout jets have mainly five characteristics <cit.>: (1) the core of magnetic arcades is highly sheared, highly deviating from the potential field; (2) an extra jet's spire; (3) magnetic lines that participate in the eruption process of the jet being in front of the magnetic arcades; (4) additional brightenings inside the arch base of jets besides the outside brightenings; and (5) usually accompanied by the eruption of a twisting mini-filament <cit.>. \n\n\nSolar jets are closely related to the evolution of local magnetic structures. Observations show that jets tend to occur above small opposite-polarity magnetic elements and regions of moving magnetic features <cit.>. In addition, a large number of jets are caused by mini-filament eruptions or micro-eruptions that may be triggered by magnetic reconnection, accompanied by magnetic field cancellation <cit.>. High-resolution observations that include magnetic field data are needed to resolve the fine processes for different kinds of jets.\n\n\nFlares, filament eruptions, and CMEs usually have precursors, such as transient small brightenings and the appearance of the so-called sigmoid magnetic structure <cit.>. To understand the mechanism of jets, observations of their early signatures are essential, such as satellite sunspots [The satellite sunspot is defined as polarity reversals near the edges of large-spot penumbrae .<cit.>]\n <cit.>, mini-filaments <cit.>, coronal bright points <cit.>, and micro-sigmoids <cit.>. Some studies show that the jets associated with satellite sunspots are often closely related to the converging and shearing motions of small opposite-polarity magnetic elements <cit.>. The blowout jets are thought to be driven by a mini-filament eruption, similar to those observed in large-scale filament or CME eruptions <cit.>. In addition, solar jets are also observed being ejected from coronal bright points and small-scale sigmoids, which resemble the large-scale coronal sigmoid being the progenitor of solar eruptions. However, all the early signatures mentioned above are signals from other features, rather than directly from the jets themselves. In this regard, high-resolution observations are strongly needed. As we will see in this paper, high-resolution observations at He i 10830 Å is capable of tracing the precursors of jet eruptions.\n\n \nSolar jets tend to recur in the same place <cit.>. Some of the recurrent jets exhibit a quasi-periodic behavior with periods ranging from several minutes to dozens of minutes. <cit.>. <cit.> analyzed several jets repeatedly occurred in the active region where a pre-existing magnetic flux was canceled by newly emerging flux with opposite flux. <cit.> found a correlation between recurring magnetic cancellation and X-ray jet emission. The recurrent jet emission was caused by chromospheric evaporation flows due to recurring magnetic reconnection. Recurrent jets can also be produced by some moving magnetic features <cit.>. In a previous paper, we discovered a periodic behavior of about five minutes for a small-scale jet, observed in the He i 10830 Å passband <cit.>. In addition, some micro-eruptions observed in the same passband also present a five-minute quasi-periodic behavior <cit.>.  High-resolution observations at He i 10830 Å have  rarely been used in studying solar jets. The results suggest that previously so-called recurrent EUV jets are related to the photospheric global oscillation if we consider their cool components to be better revealed by high-resolution imaging at 10830 Å.\n\n\n\n\nA subsequent question considers whether the five-minute oscillation generally exists in all chromospheric jets and whether it would depend on the type of jet. Furthermore, we asked how the oscillation in the photosphere might affect the chromospheric jets. Before these fundamental questions can be addressed, further studies are certainly needed. With the well-precessed high-resolution He i 10830 Å observations from GST, we selected two chromospheric jets so that we could study their precursors and quasi-periodic properties, and to find similarities among them. In Section 2, we briefly introduce the data and instruments. We present our observation and data analysis in Section 3. Our conclusions and discussions are presented in Section 4. \n\n\n\n\n§ DATA AND INSTRUMENTS\n \n\nThe data set includes narrowband filtergrams (bandpass: 0.5 Å) at He i 10830 Å and broadband filtergrams (bandpass: 10 Å) at TiO 7057 Å obtained from GST <cit.> at Big Bear Solar Observatory (BBSO) on July 22, 2011, observed by <cit.>. The He i 10830 Å data have a pixel size of ∼ 009, a cadence of ∼ 14 s, and a field of view (FOV) of 90×90. While the TiO 7057 Å data have a pixel size of ∼0036 and a cadence of ∼15 s. TiO images provide the photospheric features in the region of jets and can be used for coalignment.\n\n\nThe EUV/UV images were observed by the AIA <cit.> on board the SDO, with a pixel size of 0.6. AIA covers six EUV and two UV passbands, with a cadence of 12 s and 24 s, respectively. The magnetograms are obtained from the Helioseismic and Magnetic Imager <cit.> on board the SDO. The hmi.M_-45s data series provided us with full-disk magnetograms along the line of sight with a cadence of 45 s. \n The photospheric dopplergrams with a cadence of 45 seconds were provided by hmi.V_-45s data series.\n \n\nThe full-disk Hα images are obtained from the Global Oscillation Network Group <cit.>, with a pixel size of 1 and a cadence of about 1 minute. GONG has the ability to obtain nearly continuous observations of the Sun on the ground and includes six stations: Big Bear Solar Observatory, High Altitude Observatory, Learmonth Solar Observatory, Udaipur Solar Observatory, Instituto de Astrofísica de Canarias, and Cerro Tololo Interamerican Observatory. We made the alignment through the same features of the moss region based on the Hα and He ii 304 Å images from SDO/AIA.\n\n\nTo study small-scale jet events, a precise coalignment among the images of the photosphere, chromosphere, and corona is required. The He i 10830 Å line is optically thin in most quiet regions, which allows the photosphere to be visible as a background. This is a benefit for the coalignment between TiO and He i 10830 Å images. Meanwhile, the coalignment between TiO 7057 Å broadband images and SDO/HMI continuum images was performed by using the same characteristics from sunspots, pores, and bright granules. The remaining offset after coalignment is less than ∼05 <cit.>.\n\n\n\n\n§ OBSERVATION AND DATA ANALYSIS\n \n\nThe two jets occurred in the NOAA active region 11259. Fig. 1 gives an overview of the region of interest with a field of view (FOV) of 60×60. The red boxes  in panels (e1) and (e2) indicate the regions where the two jets occurred. White boxes roughly delineate the base boundaries of the two jets. The sunspot is dominated by a negative magnetic field, with some scattered positive polarity fields around it (panels d1 and d2). On the eastern side of the sunspot, there lies a EUV moss region (panel e2), where many periodic small-scale mass ejections of about five minutes, powered by magnetoacoustic oscillations, have been reported <cit.>. The two jets are located on the northern side of the sunspot.\n\n\n\n\n\n\n §.§ Jet1: Blowout jet and its precursor\n \nGST carried out the observation for jet 1 from 20:47:45 UT to 21:34:35 UT, on July 22, 2011. Fig. 2 (a) gives the He i 10830 Å image for jet 1. The EUV images in 131, 171, and 304 Å passbands are presented in Fig. 2 (c-e). The blowout jet has multiple hot ejections and consists of two strands as observed in EUV images. Their speeds are estimated as 62-77 km s^-1 and 122-128 km s^-1, for strands 1 and 2, respectively. The appearance of the jet, as observed in high-resolution He i 10830 Å images, consists of many thin threads that overall form the anemone-like morphology. Based on the EUV light curves given in Fig. 2 (L1), we find that there are two main eruptions about 10 minutes apart. EUV observations show that the jet started at ∼21:17:00 UT, and peaked at 21:21:36 and 21:31:20 UT, respectively. \n\n\nRemarkably, the chromospheric counterpart of the blowout jet possesses a rich precursor stage lasting at least 30 minutes as shown on the time profile of He i 10830 Å in Fig. 2 (L2) from ∼20:47 UT to ∼21:17 UT. The integrated intensity of He i 10830 Å has already started to descrease at 20:47 UT. The enhanced absorption indicates the overpopulation of triplet helium. As shown in Fig. 3 (a1-a5), the precursor presents recurrent jet-like structures.  For comparison, we observed only a mass of dark materials on the Hα images obtained from GONG in panels (b1-b5). Except for a brightening at 1600 Å and emission at 304 Å at ∼21:09:29 UT,  we found no other signals in all the EUV passbands from SDO/AIA during the precursor stage. \n\n\nThe corresponding animation displays the precursor stage clearly. The jet was preceded by slight disturbances observed on the integrated intensity curves of He i 10830 Å. There are five intermittent jet-like features (labeled as “1”-“5” in Fig. 2 (L1)) shown as enhanced absorptions. Each enhanced absorption corresponds to intensified ejections of cool materials around the whole jet region. The corresponding picture is given in Fig. 3 (a1-a5). We performed a Morlet wavelet analysis <cit.> for the detrended He i 10830 Å light curve to determine the period of oscillation (Fig. 4). The wavelet power spectra (Fig. 4c) show the dominant period of about five minutes that is above the 95% significance level.\n\n\nThe evolution and eruption of the blowout jet are shown in Figs. 5 and 6. The cool component is observed as a surge in Hα images. For this blowout jet, the cool component is formed in the middle of the two strands, which refer to the hot components of the jet. For comparison, the surge consists of two cool ejections observed at He ii 304 Å. The two cool ejections are also observed at He i 10830 Å, and one ejection experienced a lateral motion (Fig. 6 (a5)). We thus consider how these two cool ejections were formed. The high-resolution observation in He i 10830 Å passband shows that it is the result of an ejection of cool components from the lower atmosphere.\n\n\nIn the EUV passbands, this ejection is manifested as two strands at two different locations (Fig. 6), in agreement with the blowout jet model. However, in the He i 10830 Å counterpart, the jet behaves differently. The two-part structure is contained in one anemone-shaped structure with enhanced absorption. Until ∼21:34:20 UT, one ejection has a lateral expansion. At ∼21:28 UT, we observe small dark arcades emerging inside the anemone structure (Fig. 6 (a1)). The emerging was accompanied by brightenings in 1600 Å passband at the same location. The emerging arcades reconnect with the surrounding open magnetic field. The reconnection created a darkened cusp-shaped structure (Fig. 6 (a2)), which was expelled as a cool component along with the hot ejections in EUV images (Fig. 6 (c3-c5)), giving rise to strand 1. We find obvious material motions around the structure before the hot eruption. We believe that the magnetic field of the thin threads with enhanced absorption on the eastern side (pointed by red arrows) plays a part in the magnetic reconnection.  During the eruption, we observe brightenings in 1600 Å passband (Fig. 6 (b2-b3)) inside and outside the base of the jet, and even He i 10830 Å brightens at the footpoint. The ejection of the cool component looks like an eruption of a mini-filament in EUV counterparts. However, we see no filament before the eruption of the blowout jet in 304 Å images. The cool materials may come from the lower atmosphere brought up by the emerging magnetic arcades.\n\n\nIn addition, we found that strand 2 in the EUV images displays multiple ejections. It has a rotational motion and a lateral expansion at 21:32:20 and 21:34:20 UT, respectively, which can be seen in panels (c4-c5) of Fig. 6 and the corresponding animation. Following the lateral expansion of hot ejections, an extra cool ejection appeared in He i 10830 Å at 21:34:22 UT, as indicated by a white arrow in Fig. 6 (a5). In this evolutionary process, the enhanced absorption turns into emission, as observed as brightenings in front of the arch base of the jet (seen in Fig.6 (a1-a5)). Strand 2 was ejected faster, with a speed reaching more than 120 km s^-1.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Jet2: Standard jet and precursor\n \n\nThe second jet (jet 2) is shown in Fig. 7. The jet manifests itself as a EUV bright point with a size of about 2×2 in AIA images. The jet was caused by magnetic reconnection between an emerging granule-sized magnetic element and the ambient magnetic field as studied by <cit.>. Their time profiles of EUV passbands are presented in Fig. 7 (L1). We find that it is quasi-periodic and peaks at 17:42:00 UT. As shown in Fig. 7, the chromospheric jet observed at He i 10830 Å displays enhanced absorption. At the peak time, the morphology of the jet in He i 10830 Å images shows a domelike base with a distinct thin spire. It contains many thin and dark threads, and the width of a separated thread could be about 100 km as reported by <cit.>. Along the ejection labeled by slice 1 in panel (a), we made a time-distance diagram and obtained the speed of the ejection, measured as 119 km s^-1. \n\n\nFor the light curves of integrated intensities shown in Fig. 7 (L1-L2), the He i 10830 Å absorption valleys correspond to the emission peaks at 131, 171, and 304 Å passbands. Before the jet was initiated, the jet-like structure in He i 10830 Å images appeared as a precursor, as shown in Fig. 8 (a1). It corresponds to a valley on the lightcurve of He i 10830 Å passband at ∼17:36 UT in Fig. 7 (L2). The EUV counterpart is relatively weak, yet there appeared as a EUV bright point. This phenomenon is similar to the jet-like structure that occurred in the precursor phase of jet 1.  However, the precursor phase of jet 1 lasted for half an hour and it appeared only once for jet 2. It is worth noting that the precursor proceeds about five minutes before the eruption of jet 2.\n\n\n\nThe moments of enhanced absorption of the jet or emission of the integrated intensity from the bright point, judging from the absorption valleys or emission peaks, appear at 17:36:00, 17:42:00, 17:45:30, and 17:49:10 UT, which are labeled with numbers from “1” to “4.”  We give snapshots at the four moments above at He i 10830 Å, Hα, He ii 304 Å, and 94 Å, as shown in Fig. 8. With the four enhancements of the cool materials, the corresponding EUV bright point was observed, indicating that it was heated to millions of degrees. According to the standard jet model, the material ejection is caused by magnetic reconnection between an emerging arcade and the ambient magnetic field. We also performed a Morlet wavelet analysis of the He i 10830 Å light curve to determine the period of oscillation of jet 2 (Fig. 9a). The wavelet power spectrum (Fig. 9c) shows that the period of about five minutes is above the 95% significance level.\n\n\nTo  detect their quasi-periodic properties, the time profiles and wavelet power spectrums of the photospheric doppler velocity (when picking out the redshift one that is positive) over the jet region were obtained using the SDO/HMI dopplergrams with a cadence of 45 seconds. Both of the wavelet power spectrums (Fig. 10) during the precursor of jet 1 and the whole process of jet 2 show a period of about five minutes from ∼20:47:56 UT to ∼21:07 UT and 17:35:11 UT to ∼18:00 UT, respectively. In addition, we compared the phase differences between the photospheric doppler velocity  and chromospheric jets, with the result shown in Fig. 10 (c1 and c2). The phase differences are different for the two jets. For the precursor of jet 1, the photospheric doppler redshift velocity is ∼107 seconds ahead of the jet oscillation. However, for jet 2, the photospheric doppler velocity lagged behind the jet oscillation by ∼119 seconds. We note that valleys of the chromospheric oscillation observed at He i 10830 Å in Fig. 10 are the peak time of the jets in EUV passbands. On the other hand, the TiO images reflect the photospheric signal well. For the integrated intensity of TiO 7057 Å in the jet region, it presents a quasi-periodic osillation with a period of five minutes as well. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSIONS AND DISCUSSIONS\n \n\nIn this paper, we analyzed two jets of two different types with the well-processed high-resolution He i 10830 Å narrowband filtergrams taken by GST on July 22, 2011. Aided by EUV observations from AIA and photospheric velocity from HMI on board the SDO spacecraft, as well as the Hα images from the GONG, we studied the precursors, fine structures, multi-temperature components, and the quasi-periodic oscillation of the two jets with two different types. \n\n\nOur main conclusions for the two jets are as follows:\n   \n      \n  * The chromospheric jet 1, of which the EUV counterpart is a blowout jet, possesses a precursor phase that lasted half an hour. The precursor presents jet-like dark and thin threads that come upward recurrently in the region of the blowout jet. The precursor is direct jet phenomenon rather than other features, such as satellite sunspots, mini filaments, or mini-sigmoids.  In addition, we find that the precursor is quasi-periodic, with a period of about five minutes. We confirm the five-minute oscillation with both wavelet analysis to its light curve and visible inspection to the recurrent appearance of dark threads in He i 10830 Å images. During the precursor phase, there are few EUV emissions. Two strands in EUV images are observed during the eruption. One of them experiences a rotation motion and a lateral expansion. The cool materials observed as Hα surge experience a lateral motion and split into two cool ejections, which are also observed in He i 10830 and He ii 304 Å passbands.\n\n      \n      \n  * Jet 2 displays one enhanced absorption about five minutes before the eruption, which can also be regarded as the precursor of the jet. For its EUV counterpart, it presents a coronal bright point. We find a total of four enhanced absorptions in the available data range of He i 10830 Å, which also shows a quasi-periodic property with a period of about five minutes. The five-minute oscillation is confirmed with both wavelet analysis and image inspection.\n\n                 \n\n Our key finding is the detection of quasi-periodical oscillations with a characteristic\nperiod of about five minutes in the jet-like features that precede the jets.  <cit.> found that the vast majority of coronal jets (either single or recurrent) are preceded by slight precursor disturbances observed in the mean intensity, occurring several minutes before each intensive jet ejection. These authors considered these enhancements of brightness as precursors of coronal jets and detected quasi-periodical oscillations with characteristic periods from sub-minutes up to four minutes in the bright point brightness that precedes the jet eruption. <cit.> studied the pre-jet phase of the jets and found quasi-periodic intensity oscillations at their base. The quasi-periodic intensity oscillations have a period of between two and six minutes, and are reminiscent of acoustic or magnetohydrodynamic waves. The value that both jets have in common is their quasi-periodic property, with a period of about five minutes. With regard the possible mechanism of these oscillations, we  discuss them below. \n\n\nFor the precursor of jet 1, it appears to be similar to the periodicities and oscillations in jet-like observations, as previously reported by several authors <cit.>. \n   \n <cit.> and <cit.> reported that not all dynamic fibrils that belong to some kind of small-scale jet-like features on the disk show oscillations or recurrence, but a significant number of them do. Most of the power in dynamic fibrils possess periods between four and six minutes. <cit.> also suggested a similar period range in mottles in the enhanced network or weak plages. They suggested that the formation of dynamic fibrils is the result of chromospheric shock waves driven by convective flows and global oscillations in the photosphere and the convection zone.  The mechanism was initially proposed by <cit.>. Later, the rebound shock model <cit.> suggests that upward shocks are observed as recurrent jets.  In addition, in a stratified medium, a sudden disturbance can make the medium oscillate at a natural frequency close to the acoustic cut-off frequency \n<cit.>, which can nonlinearly develop into a sequence of upward shocks. These shocks may be observed as recurrent jets.  \n\n      \n The oscillatory power spectrum of the photospheric driver is dominated by the power at five minutes. The chromosphere filters out waves with periods that are longer than the local acoustic cutoff period. However, the acoustic cutoff depends on the inclination of the magnetic field. In the inclined field, for example, at the edge of a plage region, the photospheric five-minute wave can leak into the chromosphere along the inclined magnetic line, developing into shocks and forming jet-like features. This scenario can be used to interpret the periodic jet-like structure with a period of five minutes in the precursor phase of the blowout jet.\n\n\n      However,  the driving mechanism of the quasi-periodic property in solar jets is still a subject of debate. They may be different with respect to various magnetic topologies. For the standard jet (jet 2), the quasi-periodic oscillation occurred during the eruption of the jet and we observe brightenings in the EUV images simultaneously. These are the result of magnetic reconnection between magnetic arcades and ambient open magnetic field lines.  The quasi-periodic oscillation is more likely due to the magnetic reconnection process modulated by the five-minute oscillation in the photosphere. The quasi-periodic behavior indicates a modulation from p-mode oscillations to the reconnection, which has been modeled numerically by <cit.>.\n\n      \n        The difference in the phase delay between the photospheric doppler velocity and the ejection of the two jets may indicate different physical mechanisms. For jet 1, the proposed mechanism is based on the finding that the five-minute oscillation can leak into the chromosphere, developing into shocks and forming jet-like features; whereas for jet 2, the quasi-periodic behavior may indicate a modulation from the photospheric oscillation to the magnetic reconnection.\n\n      \n     On the other hand, it is interesting to discuss the property of the cool material located in the middle of the two hot strands of the blowout jet. It has been widely reported that the eruption of mini-filament triggers jets and numerous observations also have confirmed the result. With regard to our result,  we consider whether these cool materials are a mini-filament or cool components of the jets – or a mixture of them. We see no mini-filaments before the eruption of jet 1, at He 304 Å or Hα 6563 Å. This may be due to the limitation of  the spatial resolution. In the He 10830 Å passband, they present high-dynamic jet-like features with a periodicity of about five minutes. The formation of the cool ejection possibly shows up with the emerging magnetic arcades from below the photosphere. Thus, it is worth investigating what its appearance is in other wavelengths with high-resolution observations.\n\n      \n      In this paper, the analysis of five-minute oscillation of the chromospheric jets and their precursors is still limited to case studies. Further investigations of larger jet samples are needed to investigate whether a five-minute oscillation is a common phenomenon in solar jets when considering high-resolution observations from He i 10830 Å imaging and to find out how the oscillation in the photosphere affects these jets. \n\n      \n \n\nWe thank the anonymous referee for his/her constructive comments and suggestions. We thank the team of SDO/AIA and SDO/HMI for providing valuable data. The AIA and HMI data were downloaded via the Joint Science Operations Center. The Hα data from GONG is downloaded via Virtual Solar Observatory. \n\nThis work is supported by the National Key R&D program of China 2021YFA1600502 (2021YFA1600500). This work is supported by NSFC grants 12003072, 12173092, 12073081, 12273115, and 12273101. Y.W. is supported by the Youth Found of JiangSu No. BK20191108.  BBSO operation is supported by NJIT and US NSF AGS-1821294 grant. \n\n \naaStyle\n\n\n"}