{"entry_id": "http://arxiv.org/abs/2303.07047v1", "published": "20230313121326", "title": "Optimization of Velocity Ramps with Survival Analysis for Intersection Merge-Ins", "authors": ["Tim Puphal", "Malte Probst", "Yiyang Li", "Yosuke Sakamoto", "Julian Eggert"], "primary_category": "cs.AI", "categories": ["cs.AI", "cs.RO"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nOptimization of Velocity Ramps with Survival Analysis for Intersection Merge-Ins\n    Tim Puphal^1†, Malte Probst^1†, Yiyang Li^2, Yosuke Sakamoto^2 and Julian Eggert^1†\n^1 Honda Research Institute (HRI) Europe, \n\tCarl-Legien-Str. 30, 63073 Offenbach, Germany \n\n\tEmail: {tim.puphal, malte.probst, julian.eggert}@honda-ri.de \n\n\t^2 Honda Innovation Lab (HIL) Tokyo, Honda R&D Co., Ltd. 5-3-1 Akasaka, 107-6327 Tokyo, Japan \n\n\tEmail: {Yiyang_Li, Yosuke_Sakamoto}@n.t.rd.honda.co.jp \n\n\t† The authors contributed equally to this work\n    Received; accepted\n==============================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\n\nWe consider the problem of correct motion planning for \nT-intersection merge-ins of arbitrary geometry and vehicle density. A merge-in support system has to estimate the chances that a gap between two consecutive vehicles can be taken successfully. In contrast to previous models based on heuristic gap size rules, we present an approach which optimizes the integral risk of the situation using parametrized velocity ramps. It accounts for the risks from curves and all involved vehicles (front and rear on all paths) with a so-called survival analysis. For comparison, we also introduce a specially designed extension of the Intelligent Driver Model (IDM) for entering intersections.  We show in a quantitative statistical evaluation that the survival method provides advantages in terms of lower absolute risk (i.e., no crash happens) and better risk-utility tradeoff (i.e., making better use of appearing gaps). Furthermore, our approach generalizes to more complex situations with additional risk sources.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nMost Advanced Driver Assistance Systems (ADAS) enable semi-autonomous driving at low velocities in parking areas or at high velocities on highways, but not for moderate velocities in complex inner-city scenarios <cit.>. They are separably developed, only reactive and not predictive and do not adapt to the driver's needs. \nEspecially at intersections, the interplay of vehicles plays a dominant role and ADAS face a wide range of risk types (e.g. collision, curve, occlusion and traffic rules). \n\nThis requires an ADAS that employs behavior prediction for risk estimation and subsequently plans safe behaviors. It has to generalize over scenarios and holistically incorporate different risk sources.\n\nBy optimizing integral risk and benefit factors over the prediction horizon employing the survival analysis <cit.>, we compute trajectories consisting of velocity ramps on the ego path. \nThe performance of ROPT is evaluated for merge-ins at unsignalized T-intersections. Merge-in support systems have sequential planning requirements due to curve taking and multiple other vehicles. \nWe compare ROPT with an extended intersection version of the Intelligent Driver Model (IDM) <cit.> using a statistical analysis. Particularly, we look at mean trends of gap number and gap size as well as of minimum back and front distance for varying parameter values of the models. \n\nThe next Section <ref> gives an overview of related work focusing on the research community. The introduction of the Intersection IDM (IIDM) is divided into Section <ref> on longitudinal dynamics and Section <ref> on the lateral risk extension. We then explain more in detail ROPT's trajectory generation and optimization in Section <ref> and <ref>. Finally, Section <ref> shows the experiment setup together with results analysis and Section <ref> a summary and discussion for future developments.\n\n\n\n §.§ Related Work\n\n\nBesides the automotive domain, numerous approaches for motion planning exist in robotics and physics. A survey of state of the art was conducted in <cit.>. \nTraffic simulators are categorized into microscopic and macroscopic models. \nWhile microscopic models, such as IDM, treat each car's dynamics seperately, macroscopic models look at traffic density, flow and average velocity with fluid dynamic equations <cit.>. A subclass of microscopic models are cellular models, which discretize the time and space and thus work also well for larger road networks <cit.>. \n\nThe remaining planning methods are either using trajectory optimization or search algorithms. \nIn <cit.>, velocity profiles of trapezoidal shapes are optimized with Model Predictive Control (MPC) and then evaluated against their proximity to dynamic obstacles, their smoothness and speed. \n\nSupplementary, <cit.> evaluates besides the costs of the ego car, costs from the perspective of other cars to find a cooperative trajectory, which is applied to traffic scenes with priority orders. As a risk indicator, the Time-To-Collision (TTC) zone is used. Crossing of intersections can also be learned based on potential fields and the Levenberg-Marquardt method <cit.>. Especially for T-intersections, <cit.> obtain personal critical gaps with Maximum Likelihood estimation and give out recommendations of safe gaps ahead.   \n\nStandard search procedures find a path through static obstacle maps, but do not consider dynamic entities over time. For example <cit.> combine task planning with spatial exploration to detect free areas with circle-shaped spatial probability propagation. \nFor this reason, Optimal Reciprocal Collision Avoidance (ORCA) is applied in <cit.> to search the velocity instead of position space in all directions and retrieve a collision-free velocity vector. \n\nSimilarly, the authors of <cit.> connect velocities along obstacle tangent points in the path-time space under acceleration bounds. \n\n\n\n\n§ INTERSECTION IDM\n\n\n\n\n\n\n §.§ Basics and Curve Driving\n\n\nThe IDM <cit.> is a popular traffic model describing the dynamics of a leading and following vehicle pair driving along the same straight path. Its differential equation outputs a safe and efficient acceleration profile v̇_f for the follower\n\n\n    v̇_f = a(1-(v_f/v_c)^δ)_ -  a(d_0+v_fT/d+v_f(v_f-v_l)/2d√(ab))^2_.\n\n\nIn general, the follower approaches the cruising velocity v_c with the maximal acceleration a and acceleration exponent δ in the free term. However, once another vehicle is in front at a distance d with velocity v_l, the interaction term reduces v̇_f to reach a balance point defined by the minimal distance d_0 and time headway T. The contained reaction time can be set with the desired deceleration b.\n\nSimilar to <cit.>, we additionally account for curves in the path by searching for the next maximal curvature κ_ in a curve segment [κ_, κ_]. The resulting maximal lateral acceleration a_y leads to an altered desired velocity\n\n    v_c = √(a_y/κ_), if κ_ > κ_ and κ_ < κ_.\n\nHence, on sharp curve segments exceeding the threshold κ_, the follower will converge to lower v_f due to the free term. \n\n\n\n §.§ Lane Projection\n\n\n\nSince the IDM is suitable for the simulation of longitudinal scenarios, it is often used in freeways. To improve the applicability, lane-change decisions have been modeled in <cit.>. \nHere, the accelerations from the IDM  \nare compared between the driver to the leader and the follower on the current as well as the adjacent lane. If the acceleration gain of the driver is higher than the loss of his followers, a lane change is executed. We extend this idea for the crossing of intersections.\n\nFirst, we find the intersecting point between the current and other path and obtain the distance d_I of the driver to the point. At segments close to the intersection, the position of the driver is projected and shifted along d_I onto the other path. Then, we locate leading and following cars around this “hypothetical” driver. The IDM equations are taken for the driver relative to the leader and the follower relative to the driver to retrieve a_d and a_f, respectively. For the case of the current path, we assume constant acceleration for the follower a_f and a stop maneuver for the driver a_d. \nIf the incentive criterion \n\n    a_d - a_d_ + p(a_f - a_f)_  > Δ a_\n\nis not fulfilled, the driver performs a_d. \nOtherwise the driver crosses the intersection by using a_d. The politeness factor p and threshold Δ a_ modify the needed advantage at which the the driver will pass in front of the follower. \n\nWith the incentive criterion alone, it is possible that the follower crashes into the driver for small p. \nWe therefore check simultaneously the safety criterion  \n\n    a_f ≥ b_s\n\nwith a safe deceleration b_s. The resulting method is called the IIDM.\n\n\n\n§ RISK OPTIMIZATION METHOD\n\n\nIn each time step of the simulation, ROPT receives information about the current state of the environment. \nThis includes the latest measured position and velocity of all traffic participants as well as their associated future paths extracted from map data. The goal of ROPT is to predict an optimal velocity profile for the ego car along its path. The computation consists of three basic steps. Initially, a trajectory for each  other car is extrapolated over the prediction horizon.[ROPT uses a constant velocity assumption. However, it is also possible to use other methods, e.g. constant acceleration, or variants.] Second, a set of potential ego trajectories are created.  \nThird, one of the created ego trajectories is selected based on its integral risk (caused by curve and collision), utility (distance travelled) and comfort (strength and frequency of velocity change). Since we use an optimization algorithm for the trajectory generation, steps two and three are heavily intertwined. \n\n\n\n §.§ Trajectory Optimization\n\n\nFor scenarios with only one risk source (i.e., car following, curve driving and driving straight on an intersection), basic trajectory sampling methods are usually sufficient. Accordingly in previous research, the Foresighted Driver Model (FDM) <cit.> was developed. It samples via gradient descent an acceleration and deceleration profile and balances risk with utility to find correct ego behaviors.\n\n\nMerge-ins at intersections are however more complex scenarios in which the planned velocity profile has to obey maximum curve speed and match the speed of the traffic flow. The FDM would only converge to the local minimum from the curve risk. Here, it is necessary to generate a velocity profile that considers multiple spatio-temporal risk sources. \nIn a different approach, we incrementally constructed velocity paths through predictive risk maps with Rapidly-exploring Random Trees (RRT) <cit.>. It was proven to work in intersection scenarios with multiple other cars, but the step-wise evaluation makes it harder to constrain the convergence of the solution to specific simple trajectories.\n\nROPT therefore optimizes parametrized velocity profiles consisting of two consecutive acceleration and deceleration ramps (see left-hand side of Figure <ref>). A double-ramp profile is described by the end velocities of the first and second ramp v_r,1 and v_r,2 plus the start time of the second ramp s_r,2. Each ramp has a fixed duration s_d=[2.5]s, whereas the first ramp starts with the current velocity v_0. \n\n\nWe use the Nelder-Mead opimization algorithm <cit.>, a downhill simplex method that does not require gradient information. In each optimization iteration, the simple double-ramp velocity profile is converted into a trajectory, which in turn is evaluated for risk, utility and comfort (see Section <ref>). Trajectories that violate constraints on velocity or accleration are penalized. Since the Nelder-Mead optimization is a local search, it depends on the initial value of the parameters. Hence, ROPT simultaneously optimizes k trajectories, starting from different initial values v_r,1^j = v_r,2^j = v_r^j with j∈1,…,k and v_r^j evenly spaced in [[2]m/s,v_max].\nIf trajectory j was chosen in the previous time step, the optimization continues with its previous parameters. Additionally, it shifts the beginnings and ends of all ramps by an offset o that corresponds to the total time that the trajectory has been selected.[If the trajectory has been active for a duration equal to the ramp length (o=s_r), we insert a new ramp after ramp two if s_2<s_r or before ramp two otherwise.] In other words, if a planned trajectory is executed for multiple time steps, it is time-shifted and fine tuned in each step.\n\nIn addition to the optimized trajectries, ROPT samples three simple trajectories (see right-hand side of Figure <ref>): A constant velocity trajectory v_c = v_0, a stopping trajectory with the end point (s_b, v_b = 0) and an acceleration trajectory to the set speed v_a at the predicted time s_a. \n\n\n\n\n\n\n\n\n §.§ Trajectory Evaluation\n\n\n\n\n  §.§.§ Risk Prediction\n\n\n\nAn indicator for risk is the probability function P_crit(s;t,Δ t) that a critical event will happen from the current time t around a future time t+s during an interval of size Δ t. A compact risk measure R(t) then comprises the entire accumulated future risk contained in P_crit(s;t,Δ t), s∈[0,∞]. By also weighting P_crit(s;t,Δ t) with the predicted damage of the event D_crit(s;t,Δ t), \nwe obtain risk as the expected future severity. ROPT combines the Gaussian method <cit.> for the estimation of critical event probabilities with the survival analysis <cit.> to gain the overall risk.\nIn the following, we consider the situation evolution of an ego car (green) encountering another car (red) indexed with i=1,2 as depicted in Figure <ref>. \nThe car's future trajectories are predicted as in Section <ref>. \n\nIt cannot be assumed that the cars follow exactly the predicted trajectory. In reality, they undergo variations in speed and heading. Consequently, we model their respective spatial position with a normal distribution f_i.\nSince we predict the vehicles to drive along predefined paths, we furthermore define that the longitudinal uncertainty along the path is higher than the lateral uncertainty. \nIn this way, we obtain 2D ellipses that are specified by an uncertainty matrix Σ^'_i around the mean position vector μ_i with\n\n    μ_i = \n      [ μ_i,x; μ_i,y;       ],   Σ^'_i = \n      [ σ^2_i,lon         0;         0 σ^2_i,lat;           ] .\n\n\n\nA collision occurs if both cars coincide at the same position, which is analog to f_coll=f_1f_2. \nTo retrieve the product of two Gaussian functions, the uncertainties Σ^'_i have to be transformed into the same global coordinate system x,y according to\n\n    Σ_i = 𝐑Σ^'_i𝐑^T  and𝐑 = \n      [  cosα_i -sinα_i;  sinα_i  cosα_i;         ].\n\nThe collision probability is eventually given by spatially integrating f_coll over all positions \n\n\n\n    P_coll(s;t,Δ t) = |2π   (Σ_1+Σ_2)|^-1/2 * \n    exp{-1/2\n    (μ_2-μ_1)^T(Σ_1   +Σ_2)^-1\n    (μ_2-μ_1)}.\n\n \n\nDue to temporal uncertainty, the deviation of the real from the predicted trajectory differs with increasing prediction times. We extrapolate the kinematics of the current state to achieve trajectories. After a prediction step of size Δ s, their longitudinal position on the path l_i\nis shifted by Δ l_i and we get \n\n    l_i(s+1) = l_i(s) + Δ l_i = l_i(s) + v_i(s) Δ s\n\nwith velocities v_i.\nKnowing this, the growth of spatial uncertainty can be derived from a velocity uncertainty factor c_i using\n\n    σ_i,v(s+1) := σ_i,v(s) + c_i v_i(s) Δ s.\n\n\nThe probability for the ego car to drive off at sharp curves is formulated similarly. Here, we assume 1D circles with uncertainty σ_1 and look at the lateral acceleration \n\n    a_y(s) = √(0pt0.3cmκ v_1),\n\nwhich is influenced by the curvature of the road κ.\nWe then compare a_y with its maximal possible value a_y,max from vehicle dynamics constraints to retrieve\n\n\n\n\n\n\n\n    P_curv(s;t,Δ t) = 1/√(2πσ^2_1) exp{-max(a_y,max-|a_y|,0)^2/2σ_1^2}.\n\n\n\n\nIf |a_y| approaches a_y,max, the probability P_curv(s;t,Δ t) will thus increase.\n\n\n\nNext in the survival analysis, accident occurrences are modeled as a thresholding process based on Poisson-like event probabilities. \nA Poisson process is defined by a situation state-dependent total event rate τ^-1(z_t:t+s), which characterizes the mean time between events and consists of a critical event rate τ^-1_crit and a constant escape rate τ^-1_0 (comprising behavioral options that mitigate critical events). For τ^-1_crit, we consider collision risks represented by the single event rate τ_coll^-1 and the risk of losing control in curves τ^-1_curv which leads to\n\n    τ^-1(z_t:t+s)=τ^-1_0 + τ^-1_crit=τ^-1_0+τ^-1_coll+τ^-1_curv\n\nwith \n\n    τ_crit^-1(z_t:t+s) = P_crit(s;t,Δ t) / Δ t,\n\n\n    P_crit(s;t,Δ t) = P_coll(s;t,Δ t) + P_curv(s;t,Δ t).\n\n\n\n\n\nThe survival function indicates the probability that the vehicle will not be engaged in an event like an accident from t until t+s in compliance with\n\n    S(s;t,z_t:t+s)=exp{-∫_0^s τ^-1(z_t:t+s')   ds'}.\n\n\nIt has been empirically shown that human injury compared to the kinetic energy of the accident (proportional to velocity vectors 𝐯_i) has the behavior of a logistic function <cit.>. We postulate that the damage of the involved cars has the same qualitative relationship. Car-to-car collision and curve control loss damage is given by\n\n\n\n    D_coll(s;t,Δ t) = D_/1+{ k_ (𝐯_2 - 𝐯_1  - β_)  },\n\n\n    D_curv(s;t,Δ t) = D_/1+{ k_(𝐯_1  - β_)  },\n\n\n\nwhere the parameter k is the damage increase factor, β the damage midpoint and D_ the maximal damage.\nAs a result, we acquire the overall risk engaging in a future critical event by temporally integrating the term of probabilities, damages and survival function \n\n    R(t) = ∫_0^∞ (τ_coll^-1D_coll+τ_curv^-1D_curv)S  ds.\n \n\n\n\n\n  §.§.§ Utility and Comfort Prediction\n\nA driver tries to minimize the risk, but maximize his benefit as well. In ROPT, the considered benefit consists of the needed time to arrive at the goal and the comfort of the travel. The former is \ndefined by the velocity course of the ego car v_1 and the latter takes the acceleration and jerk profile a_1 and j_1 into account.[The double ramp parameters have limited influence in j_1. Here, polynoms as velocity profiles can be beneficial due to their property of continuity.] We weight the components with driver-specific constants b^t, b^c and b^j and compute the integral future benefit with\n\n    B(t)=∫_0^∞ (b^t |v_1|-b^c |a_1|- b^j |j_1|) S  ds.\n \nFor higher s, we also consider the survival function S in the evaluation. In this way, high-risk situations result into lower B(t).\n\nROPT finally evaluates for each generated trajectory the cost function\n\n\n    C(t) = R(t) - B(t)\n\nand executes the trajectory with the lowest C(t). For comparability, R(t) and B(t) have to be transformed into the same unit. Since the severity factors in R(t) require a monetarization, we use  for C(t).\n\n\n\n§ EXPERIMENTS\n\n\n\n\n §.§ Setup\n\nIn our simulation, IIDM and ROPT face the complex task of planning succesful merge-ins at T-intersections.  \nFigure <ref> illustrates the ego car waiting at the stop line, while other cars pass from left to right. We model the traffic as a Poisson distribution P(λ) with different intervals λ and count the number of missed gaps n_gap.[For continuous λ, we add a uniform random noise offset in the range of [[-0.5]s,[0.5]s].] If the gap size t_gap is large enough, the ego car needs to increase v until the maximum curve velocity and subsequently accelerate even further to match the velocity of the traffic flow.  \nThe angle of the right turn with [90]^∘ and the constant traffic speed with v_f=[10]m/s are chosen in a way that makes single-ramp trajectories only feasible for very large gaps of more than [100]m.\n\nBesides systematically changing λ which results in different traffic densities, we modify the politeness factor p of IIDM and the travel benefit b^t for ROPT to control the driving behavior.    \n\nFor every model and traffic setting, we then run several simulations (ca. 200) to ensure statistical significance. \nOnce the ego car advances past the stop line, the merge-in procedure has started and the encountered distances to the front d_front and rear vehicle d_back are recorded. \n\nIn the evaluation, we look at the mean minimal distances d̅_back,min and d̅_front,min, which indicate risk, as well as the mean utility indicators n̅_gap and t̅_gap.[Ideal environment conditions are assumed, in which position and velocity of the involved cars are synchronized and known without sensor errors.] \n\n\n\n \n\n\n §.§ Results\n\nFigure <ref> plots the distances d̅_back,min and d̅_front,min for IIDM with p  =  [0.5,4] and ROPT with b^t=[[0.1]/km,[10]/km]  \nfor different λ=[[2]s,[5]s]. \nAs expected, d̅_back,min decreases with lower λ for both models. Likewise, it declines with lower p or higher b^t. The ego car enters smaller gaps, where the rear car approaches more closely due to its excess speed.\nMore importantly, the lower bound for d̅_back,min over all runs (purple line) is always 0 in the case of the IIDM. Merge-ins cannot be performed properly with accidents happening in [37]% of the runs.[A crash or near-crash case is assumed, if the distance between two cars is less than [1]m.]\nThe reason can be identified in the simulation: At time step t_start, the IIDM decides to merge in based on the incentive criterion of Equation (<ref>). However due to the restricted curve speed, \nit cannot accelerate quickly enough in front of the follower. At some later time step t_end, the criterion becomes invalid and a brake is executed. \nIf the resulting stopping position is in the way of the crossing traffic, an accident occurs. \nIn contrast, the lower bound of ROPT stays above [15]m. ROPT does not expect any deceleration, but assumes constant velocity for the follower and yields consistently safe behavior.\n\nRegarding d̅_front,min, only runs with safe mergers are listed for IIDM (otherwise there is no notion of a back car). While d̅_front,min is approximately the same for IIDM and ROPT with different λ, it also  \ndescends with smaller p or bigger b^t. \n\n\n\nIn ROPT, bigger b^t lead to less weight on risk and earlier merge-in begins. With IIDM, d_front is usually constant. Equation (<ref>) does not consider the front car. Nevertheless, due to unsuccessful merge-in attempts at previous gaps, it is possible that the ego car has already advanced into the intersection.\n\nFigure <ref> pictures n̅_gap and t̅_gap with the same parameter variations.\n\nBoth models choose earlier gaps (less n̅_gap) based on willingness of driving into lower t̅_gap with decreasing p or increasing b^t. In general, IIDM has sharper slopes, because of its risk-proneness.    \n\nFor dense traffic settings (small λ), the models need to wait longer with higher n̅_gap and the taken gap has lower t̅_gap. In total, t̅_gap lies in between [4 - 7]s which are realistic critical gaps <cit.>.\n\n\n\n \n\n \n\n\n\n\n  §.§.§ Predictive IIDM\n\n\nWe saw that IIDM is unable to cope with merge-in scenarios. \nIt implicitly predicts the behavior of the driver and leading vehicle, but lacks a proper prediction of the follower. For this reason, we extend the IIDM further. In the spirit of ROPT, we explicitly extrapolate trajectories of other cars with constant velocity and the ego trajectory using Equations (<ref>) and (<ref>). At every predicted step, the criterions (<ref>) and (<ref>) are evaluated. Only if both hold true for the complete horizon, a merge-in is started.\n\n\nThe outputs of the predictive IIDM are shown in Figure <ref>. The lower bound for d̅_back,min approaches [14]m for p→0.5 , because b_safe is set to [-2]m/s^2 in the safety criterion. The courses of d̅_front,min are constant [7]m for different λ. Independent of p and λ, a safe behavior is achieved. Additionally, n̅_gap and t̅_gap are shifted to higher values and similar to ROPT.  \n\n\n\n\n\n\n\n\n\n  §.§.§ Discussion\n\nROPT distributes the available t_gap more to d_front than d_back, while keeping the absolute risk low (i.e . no crash happens) for varying b^t and λ. As opposed to this, IIDM is not able to cap the risk with its heuristics. The predictive IIDM generates safe behavior, but different p can only change its influence to d_back. This is undesirable, because in merge-ins the behavior of front cars is better manageable than back cars. Moreover, neither versions of IIDM can derive a continous acceleration course. They only switch between braking or following the front car. ROPT inherently possesses an explicit risk-utility tradeoff (i.e., making better use of t_gap). \n\nFor intersections of arbitrary geometry and traffic constellations, ROPT works out of the box due to its instantaneous adaptation using a full holistic predictive risk model. For instance, a crossing of X-intersections could be also handled in the predictive IIDM with additional go/no-go decisions. However, lateral risks are only considered shortly before the intersection and not afterwards. In complex interactions between the ego and multiple other cars, the combination of heuristics will potentially lead to unsafe behavior. \n\n\n\n\n\n\n\n\n§ CONCLUSION AND OUTLOOK\n\n\n\nIn this work, we outlined a longitudinal velocity planner along map geometries. ROPT alternates between trajectory generation and evaluation in an optimization cycle. Multiple double-ramp velocity profiles as well as fixed constant velocity, acceleration and deceleration trajectories are constructed. For the arising dynamic traffic scenario predictions, the integral risk, utility and comfort are calculated. ROPT infers curve and collision risks based on Gaussian probability estimation and a future risk accumulation with the survival analysis. \nThe cycle is repeated until the cost threshold is satisfied for each sample in the set and the velocity course with the lowest cost is chosen for execution.  \n\nAs a comparison, we extended the IDM for curve driving and intersection scenarios to obtain the IIDM. It uses a modified free term for maximal curvature adherence and lane change criterions altering the interaction term. \nIn simulations of right turning at T-intersections with several cross traffic densities, ROPT considers the risks properly in all parameter settings and distributes it to the two risk sources evenly. IIDM has qualitatively similar results but can yield crash cases in suboptimal configurations, because of if-then type behavior and improper prediction. We thus created the predictive IIDM, which applies the heuristics for all time steps and has no accidents but weak risk-utility tradeoff. \n\n\n \n\nOverall, ROPT is generalizable to more complex situations due to its holistic risk prediction. \n\n\nIn <cit.>, we modeled occlusion risks from buildings around intersections with virtual cars.\nIn future work, traffic elements at intersections (e.g. traffic lights or right-before-left) could be incorporated in a similar way. Otherwise, the ego car will not comply with special rule-based behaviors. \n\nThe survival method has been shown to detect collision risks early with few false positives <cit.>.\nNevertheless for high prediction horizons, the 2D Gaussians might cover opposite lanes when turning and project errors. It remains to be investigated, if the road curvatures are usable to create Gaussian Mixture Models (GMM) with bent shapes. \n\nVehicle dynamics are currently only modeled with a double integrator system in ROPT. For online application, physical steering models with delay of gas pedal to acceleration for the ego car and sensor models with noisy and late detected positions of other cars may be included as a pre-processing step. \nAt last, the weighting of risk against benefit depends on the driver type. We expect that self-adjustment of the corresponding parameters would yield a personalization of planned velocites.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENT\n\nThis work has been partially supported by the European Unions Horizon 2020 project VI-DAS, under the grant agreement number 690772. The authors would like to thank Fabian Müller for his support.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIEEEtran\n\n\n\n\n"}