{"entry_id": "http://arxiv.org/abs/2303.07045v1", "published": "20230313121222", "title": "Bayesian Approach to Micromechanical Parameter Identification Using Integrated Digital Image Correlation", "authors": ["Liya Gaynutdinova", "Ondřej Rokoš", "Jan Havelka", "Ivana Pultarová", "Jan Zeman"], "primary_category": "math.AP", "categories": ["math.AP"], "text": "\n\n\n\n\n\nCTU]L. Gaynutdinova\nliya.gaynutdinova@fsv.cvut.cz\nTUe]O. Rokoš\no.rokos@tue.nl\nCTU]J. Havelka\njan.havelka@fsv.cvut.cz\nCTU]I. Pultarová\nivana.pultarova@cvut.cz\nCTU]J. Zemancorrespondingauthor\njan.zeman@cvut.cz\n\n[CTU]Czech Technical University in Prague, 166 29 Prague 6, Thákurova 2077/7, Czech Republic\n[TUe]Eindhoven University of Technology, 5600 MB Eindhoven, P.O. Box 513, The Netherlands\n[correspondingauthor]Corresponding author.\n\n\nMicromechanical parameters are essential in understanding the behaviour of materials with a heterogeneous structure, which helps to predict complex physical processes such as delamination, cracks, and plasticity. However, identifying these parameters is challenging due to micro-macro length scale differences, required high resolution, and ambiguity in boundary conditions, among others. The Integrated Digital Image Correlation (IDIC) method, a state-of-the-art full-field deterministic approach to parameter identification, is widely used but suffers from high sensitivity to boundary data errors and is limited to identification of parameters within well-posed problems. This article proposes a Bayesian approach to micromechanical parameter identification which can resolve these issues, enabling the estimation of all micromechanical parameters and robust handling of boundary noise. To this end, the Metropolis–Hastings Algorithm (MHA) is employed to estimate probability distributions of bulk and shear moduli and boundary condition parameters using the Digital Image Correlation (DIC) method, considering a fibre-reinforced composite sample under plane strain assumption.  The performance and robustness of the MHA are compared to two versions of deterministic IDIC method, under artificially introduced random and systematic errors in kinematic boundary conditions. Although MHA is shown to be computationally more expensive and in certain cases less accurate than BE-IDIC, it offers significant advantages, in particular being able to optimize a large number of parameters while obtaining statistical characterization as well as insights into individual parameter relationships. The paper furthermore highlights the benefits of the non-normalised approach to parameter identification with MHA (leading, within deterministic IDIC, to an ill-posed formulation), which significantly improves the robustness in handling the boundary noise.\n\n\n\nIntegrated Digital Image Correlation, Virtual experiment, Micromechanics, Inverse methods, Metropolis–Hastings algorithm, Boundary Enriched IDIC\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nOften the only way of correctly interpreting the behavior of real materials with a heterogeneous structure is by observing them on a microscopic level, so we can account for strain localization, plasticity, delamination and cracks. The spatially heterogeneous character of these phenomena prompts the need for non-intrusive full-field measurement techniques in experimental mechanics. Digital imaging enabled the development of a highly accurate method called Digital Image Correlation (DIC) <cit.>, which is used to  assess the spatial transformation between two images. In practice, DIC is implemented as a computer program that automatically tracks regions of an object from one configuration to another, from which displacements can be inferred. Affordability and availability of the equipment and computer programs contributed to the popularity of this method <cit.>. \n\nDIC technique is often used as an input for identifying model parameters, typically material, leading to methods such as Integrated DIC (IDIC) <cit.>. The method relies on deterministic optimization of the least square difference between two or more images of a sample captured during an experiment, i.e., in the reference and a deformed configuration. This approach minimizes information losses and provides highly accurate results.\n\nIDIC, however, comes with a set of challenges, particularly when used in a multi-scale setting. First of all, it requires a mechanical model with suitable constitutive relations and boundary conditions. Because producing a test specimen on a sufficiently small scale is involved, and the manufacturing process itself may influence the microscopic parameters, it is highly preferential to use the actual (macro-scale) product in the measuring process. To capture the microstructural displacements, the size of a digital pixel associated with DIC must be sufficiently small, as well as of the applied speckle pattern <cit.>. While modern commercially available optical microscopes are able to provide high resolution, the problem lies in the fact that it is too time-consuming to scan the whole specimen with sufficient detail and then simulate it. For these reasons, only a subdomain of the specimen is typically scanned within a microscopic Field Of View (FOV), Ω_fov^m, see Fig. <ref>, within which a Microstructural Volume Element (MVE), Ω_mve^m, is considered and a microstructural IDIC\nmodel is constructed and correlated inside a microscopic Region Of Interest (ROI), Ω_roi^m. Although beneficial, this reduction brings a two-fold complication: (i) only material parameter ratios can be identified, because only Dirichlet boundary conditions are applied, and (ii) those boundary conditions are not know and have to be identified (from local deformations at the boundary of Ω_mve^m), since macroscopically applied boundary conditions (which are known) fall outside of the microscopic FOV, Ω_fov^m. A potential solution are “virtual boundaries” <cit.>, which, however, may not be suitable for highly heterogeneous microstructures. On the other hand, high accuracy in boundary conditions prescribed to the MVE model is crucial <cit.>, as even small errors may significantly deteriorate accuracy of the identified parameters.\n\n\n\nThe most accurate way to establish MVE boundary conditions, according to <cit.>, is to employ Global DIC (GDIC) <cit.>. In this method, the displacements are identified on the whole specimen and are subsequently interpolated as boundary conditions for the microstructural IDIC. In general, GDIC introduces: (i) kinematic smoothing effects when large elements or globally supported interpolation functions are used, and (ii) random errors when relatively small elements or locally supported interpolation functions are used. Because boundary conditions of the microstructure are kept fixed during the IDIC parameter identification procedure, the microstructural model has to compensate by adjusting its material parameters, causing the inaccurate identification of these parameters <cit.>. The approach proposed by <cit.>, referred to as the Boundary-Enriched IDIC (BE-IDIC), incorporates all Degrees Of Freedom (DOFs) associated with the virtual boundaries as IDIC DOFs. The method significantly improves accuracy of the identified parameters while maintaining robustness with respect to the image noise. Although the improved accuracy comes with a price of higher computational and memory requirements, the main weak point of microstructural IDIC/BE-IDIC is in dealing with the possible ill-posedness of the identification problem. For example, the choice of Dirichlet boundary conditions leads to infinite linearly dependent solutions for the material parameters. Because the aforementioned techniques rely on deterministic optimization methods, such as the Gauss–Newton algorithm, only material parameter ratios can be identified. This can typically be done by fixing one of the parameters to a predetermined value, which subsequently needs to be normalized <cit.>. \n\nThis article proposes a stochastic method for the parameter identification, namely the Metropolis–Hastings Algorithm (MHA), for the minimization process, while using the DIC as the measurement technique. In contrast to the described deterministic methods, stochastic inversion allows to infer probability distributions of the unknown model parameters instead of single values, treating each iteration as an experimental measurement. The Markov chain based method is also fit to overcome the ill-posedness of the inverse problem, because the sampling depends only on the prior distribution and the previous state.\n\nIn the next section the relevant background on DIC and deterministic approaches is given, followed by the description of the stochastic method in Section <ref>. Section <ref> describes the underlying mechanical model and employed virtual experiments. In Section <ref>, the MHA's sensitivity with respect to random and systematic errors in the boundary conditions are quantified and compared to IDIC. The following Section <ref> introduces the parametrization of applied boundary conditions, and the resulting MHA with boundary DOFs is compared to BE-IDIC. Section <ref> studies the behavior of the non-normalized MHA and compares it to the normalised version. The effect of the normalization choice in the BE-IDIC and the post-processing of the non-normalized MHA are also examined. The takeaways from the numerical experiments are finally summarized in the last section with the outlook on further research.\n\nThroughout this article, scalar variables are denoted using italic font, a, array variables using sans serif font, 𝗎, vectors and tensors are rendered in a boldface font, v or A, single contraction is denoted A·v = A_ijv_j, for a second-order tensor A and vector v, while ∇_0 denotes the gradient operator with respect to the reference configuration, ∇_0 v = ∂ v_j/∂ X_ie_ie_j, where e_i is a set of coordinate basis vectors. The hat (∙) denotes arbitrary admissible values, whereas the absence of hats indicates corresponding minimizers. \n\n\n\n§ DETERMINISTIC APPROACH TO PARAMETER IDENTIFICATION\n\nA mechanical test is considered, as outlined in Fig. <ref>. DIC is used to assess spatial transformations before and after the specimen is deformed. A region of a photographed domain is tracked between the images, which allows to infer the displacement field upon proper regularization <cit.>. A camera has a static FOV, Ω_fov^m, that contains the MVE, Ω_mve^m,—the sub-domain modelled with FEM—which in turn contains the Region of Interest (ROI), Ω_roi^m, which is used for correlating the images before and after deformation. Although the MVE and ROI may coincide, the camera's FOV is chosen such that the ROI (or MVE, if necessary) remains within it even after deformation. The images are stored as integer-valued arrays for both initial and deformed configuration, where each integer is associated with a pixel and denotes its brightness. \n\nThe goal is to identify the set of micromechanical material parameters, i.e., to find a vector λ∈ℝ^n_λ that minimizes the difference between the values in the reference image and in the corresponding material points in the deformed image in the least squares sense, i.e.,\n\n    λ∈λ∈ℝ^n_λmin  R_dic(λ).\n\nIn Eq. (<ref>), λ is a column matrix that stores the sought material parameters or kinematic DOFs at the boundary of MVE, ℝ^n_λ denotes an n_λ-dimensional real space, and R_dic is a non-convex cost function given as\n\n    R_dic(λ) = 1/2∫_Ω_roi[f(X) - g(X+u(X,λ))]^2 \n    dX,\n\nassuming that the brightness is conserved under this transformation. Here, u(X,λ) = [u_1(X,λ),u_2(X,λ)]^ T is an approximate displacement field depending on the set of parameters λ, X=[X_1,X_2]^ T∈ Ω_mve⊂ℝ^2 stores the material coordinates in the reference configuration, f(X) represents the initial image, whereas g(X+u(X,λ)) the deformed image mapped onto the initial configuration. \n\n\n\n §.§ Integrated Digital Image Correlation\n\n\nIDIC is a method initially proposed by <cit.> for experimental identification of parameters based on Eq. (<ref>). The displacement field u(X,λ)  is obtained by solving the response of the underlying mechanical system governed by\n\n    ∇_0 · P^ T( u( X,λ),λ)    =  0,       X∈Ω_mve,\n    u(X)    = u_∂Ω_mve(X),       X∈∂Ω_mve,\n\nwhere ∇_0 denotes the gradient operator in the reference configuration, P is the first Piola–Kirchhoff stress tensor, and u_∂Ω_mve is a prescribed displacement on the boundary ∂Ω_mve, see, e.g., <cit.> for more details on continuum mechanics. The solution is typically discretized with the Finite Element Method (FEM). To minimize the objective in Eq. (<ref>), the standard Gauss–Newton algorithm is used, requiring the sensitivity fields ∂ u( X,λ) / ∂λ_i, often obtained numerically through finite differentiation. \n\n\n\n §.§ Boundary Enriched Integrated Digital Image Correlation\n\nBE-IDIC is an IDIC methodology that considers material parameters λ_mat and the boundary displacements λ_kin as unknowns <cit.>, i.e., \n\n    λ= [λ_mat^ T,λ_kin^ T]^ T,\n\nwhere\n\n    λ_mat   = [G_1, K_1, …, G_N_mat, K_N_mat]^ T∈ℝ^2N_mat,\n    λ_kin   =  u_∂Ω_mve∈ℝ^N_kin,\n\nand where G_i, K_i are micromechanical constitutive parameters of the i-th phase of a herein assumed hyperelastic material model (cf. Section <ref> below), and u_∂Ω_mve is an array storing displacements of boundary nodes corresponding to chosen discretization of the boundary. The number of kinematic parameters can be very large, depending on the coarseness of this discretization. The cost functional R_dic(λ) of Eq. (<ref>) is then minimized following the standard procedure, i.e., using the Gauss-Newton method. Note that the number of required sensitivity fields has to be expanded according to the number of kinematic parameters, so the computational cost increases significantly. On the other hand, this method allows for a higher precision, especially when the boundary data is noisy <cit.>.\n\n\n\n§ STOCHASTIC APPROACH TO PARAMETER IDENTIFICATION\n\n\nThe deterministic IDIC approach is a relatively computationally inexpensive method that provides a single value for identified parameters, i.e., it is a deterministic method. On the other hand, obtaining precise enough MVE boundary conditions is a challenge on its own, and the method using GDIC to first identify boundary conditions with subsequent IDIC step <cit.> hence may be overly sensitive to the accuracy of the boundary conditions. This is mainly because the errors that occur during GDIC phase become fixed and cannot be corrected for in the subsequent IDIC step. \n\nFor successful identification, one should separate uncertainties into two basic groups <cit.>. The first group, called epistemic uncertainty, derives from lack of knowledge of the system or the environment. Material parameters and boundary conditions fall into this category in our case. This type of uncertainty is reducible by adding new information. That is, by performing more tests with parameters λ, one can obtain better estimates. The second group is called aleatory uncertainty, or simply variability, and is irreducible. It represents an inherent variation associated with the physical system or the environment under consideration. In our particular case, it corresponds to the image noise. It is important to distinguish both classes of uncertainties from errors—modelling inaccuracies stemming, e.g., from the assumed material models, identified geometry, FEM discretization, solution approximation, or GDIC interpolation.  \n\nBayesian probability has been used for epistemic uncertainty, and it takes a subjective view of probability as a measure of degree of belief in a hypothesis. Bayesian methods allow us to update the probabilities as we gather more data (Bayesian inference). The final answer to the parameter identification problem is then a posterior distribution, as opposed to a single value obtained from the deterministic methods. Additionally, working with prior parameter distributions regularizes ill-posed problems. This is why employing a stochastic method to the problem of parameter identification is potentially beneficial and has been already used in parameter identification of mechanical models, see, e.g., <cit.>.\n\n\n\n §.§ Parameter Estimation in Bayesian Statistics\n\nIn the Bayesian statistics, parameter estimation is done by testing numerous hypotheses. The data set will then consist of individual tests that result in images f( X) and g( X) ∈ [0, 255] observed in (virtual) experiments. Assuming that the brightness is conserved between two images and omitting the interpolation error, the following relation (called brightness conservation, or optical flow equation) holds\n\n    f(X) ≅ g(X+u(X,λ)),\n\nrecall also Eq. (<ref>) for the deterministic approach. In practice, we work with the discretized version of f and g, \nwhich we denote as real arrays f and g of N_p elements, representing individual pixels. Accounting for the measurement error (i.e., image noise) we have\n\n    f + η≅ g(λ) + ζ,\n\nwhere η and ζ are random vectors representing measurement errors, normally distributed with zero mean and variance σ_η^2, i.e., η, ζ∈ N(0,σ_η^2). \nEq. (<ref>) can be rewritten as\n\n    f≅ g(λ) + ξ,   ξ∈ N(0, 2σ_η^2).\n\nBecause the measurement errors mostly stem from the image noise, we set σ_η to be 1% of the dynamic range of f, g ∈ [0, 255] <cit.>. \n\nAccording to the Bayes' theorem, the posterior distribution π(λ) is proportional to\n\n    π(λ| f,  g) ∝π(λ_mat)π(λ_kin) π( f,  g|λ),\n\nwhere π(λ_mat) and π(λ_kin) are the prior distributions of the material and kinematic parameters, and π( f,  g|λ) is the likelihood function.  We choose the prior distribution for material parameters as a normal distribution N(λ̃_mat^1, σ^2_prior), i.e., \n\n    π(λ_mat) = 1/σ_prior^N_mat√((2π)^2N_mat)exp(-1/2·||λ_mat - λ̃_mat^1||_2^2/σ^2_prior),\n\nwhere λ̃_mat^1 is the initial guess and σ^2_prior represents our confidence in it. Note that this distribution can be adopted since the probability p(λ_mat < 0) is sufficiently small to not cause any numerical issues. For the kinematic parameters, we choose uniform prior distributions with the mean of λ̃_kin^1, λ̃_kin,n^1 ∈𝒰(λ̃^1_kin,n-e_bc, λ̃^1_kin,n+e_bc), i.e.,\n\n    π(λ_kin)=∏_n=1^N_kinπ(λ_kin,n),\n\n\n    π(λ_kin,n)=1/2e_bc   if  |λ_kin,n-λ̃_kin,n^1|≤ e_bc,\n    \n                                    0    otherwise,\n\nwhere e_bc is the assumed amplitude of the noise in the boundary conditions.\nThe likelihood  π( f,  g|λ) is then computed using the probability density function of the noise ξ from Eq. (<ref>) as\n\n    π( f,  g|λ) \n    = 1/(2σ_η)^N_p√(π^N_p)exp(-1/2·|| f -  g(λ)||_2^2/2σ_η^2),\n\nwhere N_p is the total number of pixels within ROI. Substituting Eqs. (<ref>)–(<ref>) into Eq. (<ref>) leads to the approximate posterior probability\n\n    π(λ| f,  g) = C π(λ_mat)π(λ_kin)π( f,  g|λ),\n\nwhere C is a suitable normalization constant. \n\n\n\n\n §.§ Metropolis–Hastings Algorithm\n\nThe problem (<ref>) has two distinctive sets of parameters: the material parameters λ_mat and boundary conditions λ_kin, recall Eq. (<ref>). We are primarily interested in the estimation of λ_mat, although λ_kin is important for the accuracy. To derive the marginal posterior distribution π(λ_mat| f,  g), and not the joint distribution π(λ_mat,λ_kin| f,  g), the Markov Chain Monte Carlo (MCMC) sampling is employed. The marginalization is performed as\n\n    π(λ_mat| f,  g)=∫_𝒟_kinπ(λ_mat,λ_kin| f,  g) dλ_kin,\n\nwhere 𝒟_kin is the domain of integration for λ_kin. To evaluate this integral, the Metropolis–Hastings Algorithm (MHA) is used.\n\nIn MHA, see <cit.> and Alg. 1, we start with an initial sample λ̃^i and set it as the current state λ^i=λ̃^i. Then each new proposal λ̃^i+1 is generated based on the proposal distribution q, which must be symmetric  in the sense that q(λ^i|λ̃^i+1) = q(λ̃^i+1|λ^i) for all λ^i, λ̃^i+1∈ℝ^M=2N_mat+N_kin. Typically, q is chosen as Gaussian, i.e., q ∈𝒩(λ^i, σ_q^2)^2N_mat+N_kin. Its variance σ_q^2, often referred to as the step size of the random walk, is chosen empirically such that the acceptance rate is around 30%. The newly proposed state λ̃^i+1  is accepted with the probability of min(1, p), where \n\n    p = π(λ̃^i+1| f,  g)/π(λ^i| f,  g).\n\nThis procedure \nis usually implemented by generating a uniformly distributed random variable κ∈𝒰(0,1). If κ<p, then λ̃^i+1 is accepted, i.e., λ^i+1=λ̃^i+1, otherwise λ̃^i+1 is rejected, i.e., λ^i+1=λ^i.\nContinuing this way, one obtains a sequence λ^j, j=1,2,…,N. After discarding the first N_0 elements (the so-called burn-in), we finally obtain approximation of the marginal (using Eq. (<ref>)) or joint posterior distributions of identified parameters λ as distributions of λ^j_m, j=N_0+1,…,N, for m=1,…,M = 2N_mat+N_kin.\n\n\n\n\n\n§ UNDERLYING MECHANICAL MODEL\n\n\n\n §.§ Geometry\n\nTo compare performance of the deterministic and stochastic identification procedures, a virtual experiment is performed on a specimen with prescribed material parameters λ_mat,ref. The specimen is assumed to occupy a full-scale domain Ω_dns, having the size of a 20×20 units of length, with a heterogeneous structure shown in Fig. <ref>. The microstructure consists of randomly distributed non-intersecting stiff circular inclusions with a diameter d=1 unit of length, and a surrounding compliant matrix. Although all geometric units and properties are dimensionless, they can be scaled to μm. \n\n\n\n §.§ Constitutive Model and Governing Equations\n\n\nThe material of the specimen is assumed to be nonlinear elastic. In particular, a compressible Neo–Hookean hyperelastic material is adopted, specified by the following elastic energy density \n\n    W_α(F) = 1/2G_α(I_1(F)-3)+1/2K_α(ln J(F))^2,\n\nwhere F = [I+∇_0 u(X)]^𝖳 is the deformation gradient tensor, ∇_0 u(X) is the gradient of the displacement field, J(F) = F, and I_1(F) = J^-2/3(C) is the first modified invariant of the right Cauchy–Green deformation tensor C = F^TF. Individual materials are distinguished by the subscript α, where α=1 corresponds to the matrix and α=2 to the inclusions. The prescribed values of the material parameters λ_mat, ref = [G_1, K_1, G_2, K_2] are presented in Tab. <ref>. Because Dirichlet boundary conditions are applied on the entire boundary of the MVE, ∂Ω_mve, the problem is ill-posed, and only material parameter ratios can be obtained. In the IDIC procedure, one of the material parameters therefore needs to be fixed to an arbitrary value (exact, in our case of virtual experiments) for normalization purposes. The remaining parameters can be identified relative to that reference value. The fixed material parameter can be estimated by other means, i.e., using a force-based mechanical test or reliable experimental sources. Note that such a normalization can be performed in multiple ways, influencing the resulting accuracy of the identification. In contrast to IDIC, MHA does not require such normalization, as will be discussed more extensively below in Section <ref>.\n\n\nThe first Piola–Kirchhoff stress tensor P, introduced in the considered governing Eq. (<ref>) of solid mechanical systems, now attains the form \n    P( u(X))=(1-χ(X)) ∂ W_1 ( F)/∂ F [I+∇_0 u(X)]^𝖳+χ(X) ∂ W_2 ( F)/∂ F [I+∇_0 u(X)]^𝖳,\n\nwhere χ(X) is an indicator function of the inclusions, i.e., χ=1 inside all inclusions and χ=0 inside the matrix. Note that the explicit dependence on the identified parameters λ has been dropped for brevity.\n\n\n\n §.§ Applied Boundary Conditions\n\nLet us denote each side of the boundary of Ω_dns, ∂Ω_dns =Γ, as Γ_i, i=1,…,4, see Fig. <ref>. Two virtual mechanical tests are considered, one to introduce tension and another to introduce shear. Both are referred to as Direct Numerical Simulations (DNS) and provide the reference for the mechanical behavior of the system. The displacements prescribed at the specimen’s boundary are \n\n    u(X)     = (F-I)X,       X∈Γ_2 ∪Γ_4,\n     F   = I + 0.1 e_1 ⊗e_1,       for tension, \n     F   = I + 0.1 e_2 ⊗e_1,       for shear,\n\nwhere e_1=[1,0]^ T and e_2=[0,1]^ T, while Γ_1, Γ_3 are left as free edges. \n\n\n\n §.§ Numerical Solution and Discretization\n\nThe solution of the mechanical problem in Eq. (<ref>) is determined using the standard non-linear FEM, adopting the Total Lagrangian formulation <cit.>. The evolution of the system is solved incrementally, using the Newton–Raphson algorithm. \n\nThe displacement field u(X,λ) is hence discretized as\n\n    u(X,λ) ≈∑_i=1^n_ u/2N_i(  X) u_i(λ),\n\nwhere n_ u denotes the total number of DOFs, N_i(X) are the standard FE shape functions, and u_i (λ) = [ u_1^i (λ), u_2^i (λ)]^ T∈ℝ^2 stores the horizontal and vertical displacements of an i-th node associated with a FE mesh. For later reference, these are stored in the array u = [ u^ T_1,…, u^ T_n_ u/2]^ T∈ℝ^n_ u. \n\nFor the FE solution, both Ω_dns and Ω_mve domains are discretized with the Gmsh mesh generator <cit.>, using quadratic isoparametric triangular elements with the three-point Gauss quadrature rule to approximate the integrals appearing in the weak form. All calculations were programmed and performed in MATLAB <cit.>, using an in-house FEM library for hyperelastic materials with computationally heavy parts implemented in external C/C++ mex files for efficiency reasons. For the DNS, the fine mesh shown in Fig. <ref> is used, whereas a coarser MVE triangulation is shown in Fig. <ref>. Because the reference Poisson’s ratios for both materials are significantly smaller than 0.5 (recall Tab. <ref>), and because deformations in the simulations are moderate, incompressibility issues do not occur. \n\n\n\nTo track the deformation in a real life experiment, a speckle pattern needs to be applied on the specimen <cit.>. The reference image f, representing the applied speckle pattern, has been adopted from <cit.>, shown in Fig. <ref>. Its resolution is 512×512 pixels inside FOV, which corresponds approximately to 340×340 pixels inside ROI, when ROI is set equal to MVE. The DNS displacements obtained from all mechanical tests are interpolated from the FE mesh to the regular image mesh by inversion of the elements' isoparametric maps, and the resulting displacement fields are used to map the deformed image g back into the reference configuration. The deformed image is then interpolated at the pixel positions using the bi-cubic polynomial interpolation <cit.>. \n\n\n\n§ ROBUSTNESS OF MHA WITH RESPECT TO FIXED ERRORS IN APPLIED BOUNDARY CONDITIONS\n\nThis section presents several experiments that quantify the robustness of the proposed MHA in comparison with the IDIC method <cit.> with respect to errors in the applied boundary conditions. The kinematic degrees of freedom λ_kin are fixed with an error, so the effect of the error on the material parameter identification can be directly observed. The systematic errors, like the smoothing of kinematic fields by the GDIC, are studied first, followed by the effect of the uncorrelated random noise, which is typically observed in the local DIC or the global DIC with a very fine discretization <cit.>.\n\n\n\n §.§ Sensitivity with Respect to Systematic Errors\n\nThe GDIC with a coarse interpolation can have a smoothing effect on the boundary conditions <cit.>. To quantify the effect of smoothed boundary conditions on the identification of the material parameters, the Dirichlet boundary conditions used in the identification are obtained by interpolating the DNS displacements at the nodal positions of the MVE boundary ∂Ω_mve, and the resulting exact displacement field is smoothed with a pillbox-shaped kernel h_ε as\n\n    ũ_dns(X) = ∫_Ω_dns u_dns(Y)h_ε(Y-X) dY,\n\nwhere ε≥ 0 is a dimension-less diameter  (normalized by the inclusion’s diameter d=1). The smoothing effect for the extreme kernel ε = 5 can be observed in Fig. <ref>. The smoothed data are then prescribed as the boundary conditions to the FEM MVE model, i.e., \n\n    u_mve(X) = ũ_dns(X),   X∈∂Ω_mve.\n \nIn Eq. (<ref>), ũ_dns(X),X∈∂Ω_mve, is a column of displacements of ũ_dns evaluated at the MVE boundary nodes. For easier implementation, the integral in Eq. (<ref>) is calculated at discrete pixel positions numerically, while the corresponding displacements at the MVE boundary are linearly interpolated. \nThe bulk modulus of the matrix K_1 is chosen as the normalization parameter in both IDIC as well as MHA, so it is fixed at its reference value. Therefore, the dimension of the MHA sampling is reduced only to the remaining material parameters λ_mat, so the sampling is performed in a three-dimensional space. The maximum number of steps for the MHA was set to N = 8 000 with 75% burn-in. The prior distributions for the material parameters were chosen as normal with mean values set to the initial guess 0.9λ_ref,i and variances σ_mat,prior^2 = 1. The step size σ_q was set as 1% of λ_ref,i/∑_j=1^Nλ_ref,jσ_mat,prior.\n\n\n\n\nFig. <ref> shows obtained results for the tension and shear tests from 50 Monte Carlo (MC) runs, and compares them to the IDIC method. Here we first observe that the MHA with fixed boundary conditions performs almost identically to the IDIC, when the modes of the resulting posterior distributions are compared with the IDIC values.  A slight difference between the MHA and IDIC can be observed in the bulk modulus of the inclusions K_2  in the shear test. The resulting MHA intervals within one standard deviation from the mean are invisible in the scale of the figure, their widths ranging from 5 ‰ to 1% of the identified value. Next, in accordance with previous observations, see <cit.>, smoothing of the boundary conditions has a considerable negative impact on the identification accuracy. We can therefore conclude that both approaches provide practically identical results for this particular test and show comparable accuracy and robustness.\n\n\n\n §.§ Random Errors in Applied Boundary Conditions\n\nThe GDIC can also introduce random errors to the boundary conditions, for too fine meshes. To quantify the effect of random noise in boundary conditions, the following test is performed. Uncorrelated random noise is superimposed on the exact boundary displacement, i.e., \n\n    u_mve(X) =  u_dns( X) + σ_bc Y∈∂Ω_dnsmax (|| u_dns(Y) ||_2) 𝒰(-0.5, 0.5),    X∈∂Ω_mve,\n\nwhere u_mve(X) is a vector that stores nodal displacements of the MVE boundary nodes, u_dns(Y) does the same for the DNS boundary nodes, 𝒰(-0.5, 0.5) is the corresponding column of independent and identically distributed random variables with a uniform distribution over [-0.5,0.5], and σ_bc∈ [0, 0.1] is the standard deviation of the prescribed random noise.\n\nAll three  material parameters are identified again for both the tensile and shear tests, using 50 MC realizations of the noise for each value of σ_bc. An example of boundary data with σ_bc=0.1 is shown in Fig. <ref>. The number of steps for the MHA is set to N = 8 000 with 75% burn-in, with the rest of hyper-parameters and prior parameter distributions set the same as in the previous example. The boundary conditions are kept fixed with K_1 used as the normalization parameter again.\n\n\n\n\n\nFor each of the resulting posterior distributions, the mode was again taken as the measure of the identified parameters and then averaged across all 50 realizations with the same noise amplitude. The derived mean values for all the material parameters are shown in Fig. <ref> with thick lines, while the standard deviations are superimposed over the mean values (dashed lines). Similarly to the previous example the confidence intervals for each iteration are negligible.\n\nFig. <ref> shows that the MHA (color lines) and the IDIC (black lines) again deliver almost identical results. The slight deviation for the values of σ_bc > 0.05 in the shear test can be explained by the insufficient convergence of the MHA for the given number of steps.\n\nWe conclude that the MHA with fixed errors in boundary conditions has the same robustness as the IDIC method, and that the error in boundary conditions has a significant effect on the values of the identified material parameters, especially in the shear test.\n\n\n\n§ MHA WITH RELAXED BOUNDARY CONDITIONS\n\nOne of the benefits of the MHA is that the number of sampled parameters can be increased to include boundary conditions with no direct additional computational effort, as compared to the case with fixed boundary conditions. A straightforward way to implement new DOFs is to set the boundary condition parameters λ_kin as displacements in the FE nodes along ∂Ω_mve. For the configuration described in Section <ref> (and used for all numerical experiments), this would mean adding extra 2 × 244 parameters, considering that 244 FE nodes (on a randomly generated domain) store displacements along the horizontal and vertical directions. We expect this approach to provide more accurate estimates for the material parameters, since it also minimizes the error in the boundary conditions. On the other hand, this approach is generally expected to introduce the so-called “curse of dimensionality” <cit.>. Even though calculating the solution of the mechanical system for each new sample requires the same computational effort for any number of the employed DOFs, the algorithm might require more steps to find the high probability region, as the number of sampled parameters grows. One way to address this problem is to reduce MHA sampling to manageable dimensions by approximating boundary conditions with some basis functions, e.g., using Fourier transform or Karhunen–Loève expansion, both widely used in signal enhancement <cit.>. However, the MHA sampling in the resulting spaces is not uniform and thus requires substantial additional tuning. That is why, for the purpose of this paper, a simple reduction of nodes in the FE basis was ultimately chosen, where only some of the existing DOFs on the boundary ∂Ω_mve were used to reduce the parameters' dimension. The rest of the parameters are dependent on those parameters (by interpolation). The initial MVE boundary mesh was constructed by assigning nodes at equal intervals with displacements interpolated from the DNS, and every n-th node is then used for the boundary approximation. The displacement error of the boundary condition is quantified as\n\n    ϵ^bc_rel = || u_mve^t(X)- u_dns(X)||_2/|| u_dns(X)||_2,   X∈∂Ω_mve,\n\nwhere u_mve^t(X) is the boundary approximation with 2× t DOFs, and u_dns(X) is the exact boundary displacement obtained by the DNS. \n\nThe boundary condition parameter λ_kin can be accordingly relaxed in the MHA sampling. The number of total employed kinematic DOFs was 2×61 (25%), 2×122 (50%), 2×183 (75%), and 2×244 (100%). To examine the MHA's robustness with respect to the noise in the initial applied boundary conditions, the initial guess of the kinematic parameter λ̃_kin^1 was assumed with an increasing noise amplitude σ̃_bc. The starting point for the material parameter λ_mat^1 was assumed as λ_ref,i, i=1,…,4, so the influence of the relaxed boundary conditions can be assessed.  The bulk modulus of the matrix K_1 was used as the normalization parameter. The prior distributions for the material parameters were again chosen as normal, with the mean values set to their reference value as the initial guess λ_ref,i, with the variances σ_mat,prior^2 = 1. The material parameter step size σ_q, i was set as 5‰ of λ_ref,i/∑_j=1^Nλ_ref,jσ_mat,prior. The prior distributions for the kinematic parameters were set as uniform according to Eq. (<ref>), where e_bc = 0.1 Y∈∂Ω_mvemax (|| u_dns(Y) ||_2) is the maximum possible error of the initial guess for the boundary node coordinate. The kinematic parameter step size was then chosen relative to the material parameter step size as 0.4% of ∑_i=1^Nσ_q, i. The total number of steps was set as N = 24 000 with 92% burn-in (chosen during post-processing) in all experiments for practicality. \n\n\n\n\n §.§ Tensile Test\n\nIn the tensile test (Fig. <ref>) the resulting error in the material parameters was decreased at least twofold for all the considered numbers of the kinematic DOFs, compared to the fixed boundary MHA (cf. Fig. <ref>; note also the difference in scale between the two figures). The starting boundary error still has a considerable negative impact on the overall accuracy. It should be noted that the chosen fixed number of steps of MHA, although relatively high, was insufficient, as the convergence was not reached in most of the random chains for the starting noise amplitude σ̃_bc≥ 0.04 in the experiments with the number of kinematic DOFs equal to 50, 75, and 100% of the total, and σ̃_bc≥ 0.06 for the 25% of the total kinematic DOFs.\n\n\n\nTo better illustrate the mutual influence of the material and kinematic parameters, each parameter's average relative error for a given step across all iterations is shown in Fig. <ref>. For brevity, we focus only on the cases with either minimum or maximum noise, with the relative number of kinematic nodes equal to 100% and 25%. For the material parameters the error is calculated as\n\n    ϵ^n,i_rel = λ_n^i-λ_n, ref/λ_n,ref,    n=1,…,n_mat,\n\nwhile for the kinematic DOFs as\n\n    ϵ^bc,i_rel = ||λ_kin^i-λ_kin,ref||_2/||λ_kin,ref||_2,\n\nwhere the hatted variables with index i denote i-th accepted sample. \n\nFor the zero starting noise in the boundary conditions, the material parameters in the experiment with the full number of DOFs converge very fast to a high-likelihood region close to the initialization point (i.e., to the reference material values, see Figs. <ref>, <ref>). The average error in the boundary conditions slightly grows throughout the experiment. This is caused by the numerical errors in the process, such as image interpolation.\nThe experiment with the reduced number of DOFs starts with a higher error in the boundary conditions due to the interpolation error, and after a period of linear growth stabilizes. The growth of the average error in the boundary conditions in this experiment coincides with the rapid spread in the material parameters that stabilize in local optima around the same time as the kinematic parameters. \n\n\n\nIn the experiment with the highest starting noise, σ̃_bc = 0.1, shown in Figs. <ref> and <ref>, the initial average boundary condition error is roughly the same in both cases with full and reduced number of kinematic DOFs. The higher regularity of the boundary, that results from the interpolation, has a different effect on each material parameter: while the highly correlated matrix and inclusions shear moduli G_1 and G_2 reach a higher interim error in the experiment with the full number of kinematic DOFs, the parameter K_2 on average stabilizes faster than for the reduced number of kinematic DOFs, although with a high variance between the chains. At first, the boundary error decreases faster for the reduced number of DOFs, but it starts increasing around the halfway of the total running time. The boundary error in the experiment with full boundary DOFs decreases linearly. It is unclear if it would show a similar behavior as its counterpart, as the error at the final (25 000th) step of the non-reduced problem was comparable  to the one observed  for the reduced system around the 12 500th step.\n\nFinally, all the converged chains from the above experiments (those with a lower amount of initial noise) are congregated to estimate the posterior probability density functions for the material parameters. Those, in turn, can be compared with the results obtained by the deterministic BE-IDIC method. In Figs. <ref> and <ref> it is shown that all the resulting posterior distributions are approximately normal, with the experiments with reduced number of boundary nodes resulting in a slightly narrower confidence intervals. Solutions provided by the deterministic method (denoted by black dots) tend to coincide with the modes of the histograms (or means of the estimated PDFs), except for the parameter K_2, where the average of the stochastic method is slightly closer to the true parameter value in both cases. \n\n\n\n\n\n §.§ Shear Test\n\nThe shear test behaves quite differently from the tensile test for all numbers of the kinematic DOFs, see Fig. <ref>. This test seems to have an overall low sensitivity to the bulk modulus of the inclusions K_2. The accuracy decreases for the rest of the material parameters as well. Nevertheless, Fig. <ref> shows that the average relative error in boundary conditions decreases at the same rate as for the analogous tensile experiments. \n\n\n\n\n\nFor the shear test, the histograms and estimated uni- and multi-variate posterior probability distributions obtained from the converged chains are shown in Figs. <ref> and <ref>. The reduced number of kinematic DOFs results in a higher systematic error than for the tensile test, as well as wider confidence intervals. The means of the posterior distributions are less accurate as the estimators of the material parameters than the solution obtained by the deterministic BE-IDIC method.\n\n\n\n\n\n§ APPLICATION IN ILL-POSED PROBLEMS\n\nAs was discussed earlier, the inverse problem with the Dirichlet boundary conditions requires one of the parameters to be fixed at its reference value, so the deterministic optimizers can only find the correct ratios of the material parameters. The choice of such normalization parameter influences the final accuracy of the identification <cit.>. This, however, is not necessary for the MHA, and the normalization can be done in the post-processing step. \nThe sampling can be performed in all four material parameter dimensions instead of three, with the same kinematic parameters if needed. To compare the accuracy of the identification between the ill-posed and the normalized problems, the results from the non-normalized MHA are also normalized in the post-processing step by the parameter K_1, which is not fixed at a given value this time, but is updated concurrently with the other parameters. All the other hyper-parameters remain the same, such as material and kinematic parameter step sizes and the prior distributions. After the same number of steps (24 000) and burn-in (92%), the identification accuracy of material parameters is generally much higher for the non-normalized MHA, see Figs. <ref> and <ref>, where convergence of all material parameters is achieved for a much higher starting noise in the same number of steps.\n\n\n\n §.§ Tensile Test\n\n\n\n\nThe convergence speed is higher for all the considered parameters, including the boundary conditions, where the minimum achieved average error is roughly two times smaller than in the normalized version of MHA, see Fig. <ref>.\n\n\n\nThe most interesting feature of the non-normalized MHA is that the posterior distributions can be obtained for all the parameters by choosing any of the remaining parameters as the normalization factor, as shown in Fig. <ref>, where the estimated posterior probability distribution resulting from the chosen normalization parameter is color-coded, as well as the points given by the deterministic BE-IDIC with the same choice for the fixed parameter. The probability density estimations for each of the parameters differ in bias and variance, based on the choice of the normalization parameter. Similarly to the normalized MHA, a relationship between the results of the deterministic method and the modes of the probability distributions can be observed, as they generally appear in the same order. Indeed, in practical applications, one might not have estimates for all the material parameters beforehand to be as free in the choice of the normalization. However, the parameter ratios can still be effectively established with the non-normalized MHA.\n\n\n\n\n\n §.§ Shear Test\n\n\n\n\nThe shear test continues to be not sensitive enough to correctly establish the parameter K_2 (see Fig. <ref>), even though the identification accuracy in other material parameters and boundary conditions increased significantly compared to the normalized version, as shown in Fig. <ref>. The resulting material parameter estimates have a wider confidence interval than in the tensile test, and at the same time the biases remain comparable to those of BE-IDIC, see Fig. <ref>. The distributions of the parameter K_2 are omitted because of the low sensitivity.\n\n\n\n\n\n\n\n§ SUMMARY AND CONCLUSIONS\n\nIn this contribution, the performance and the probabilistic robustness of the Metropolis–Hastings algorithm (MHA) is compared to the deterministic Integrated Digital Image Correlation (IDIC) method. To this end, a heterogeneous microstructural specimen with a random distribution of circular inclusions have been subjected to two virtual mechanical tests under plane strain conditions, one to primarily introduce tension, the other to introduce shear. The goal was to identify parameters of two distinct groups: materials and applied boundary conditions. The effect of errors in the applied boundary conditions was studied. First, the MHA that only identifies the material parameters with fixed boundary conditions was considered, and its sensitivity with respect to random and systematic errors in the boundary conditions was quantified and compared to the IDIC. MHA's parameter field was then expanded with two different ways of approximating the boundary conditions, and the method was compared to the Boundary Enriched IDIC (BE-IDIC). The experiments have shown a similar behavior of MHA with fixed boundary conditions to IDIC for both the systematic as well as random error in the applied boundary conditions.\n\nA possible way of reducing the dimensionality of the boundary condition parameters were suggested: substituting the employed discretization mesh on the boundary with a coarser one. The robustness test for the random error in the boundary conditions shown a higher convergence rate for the price of introducing a small systematic error in the material parameters.\n\nThe deterministic approach requires one of the material parameters to be fixed at the exact value, because the inverse problem with Dirichlet boundary conditions is inherently ill-posed. The benefit of the stochastic approach, on the other hand, is that this normalization, while possible, is unnecessary. It was shown that the non-normalized approach to the parameter identification, where none of the material parameters is fixed, converges faster and is more robust with respect to the initial boundary noise. As a result, this version of the algorithm was able to handle high-fidelity boundary conditions burdened with noise more efficiently than the normalized version. The material parameter estimates can then be obtained in the post-processing step from the material ratios established by MHA, which allows solving ill-posed or weakly conditioned structural optimization problems such as parameter identification in laminates <cit.>, where deterministic methods are not applicable. \n\nOverall, MHA with relaxed boundary conditions proved to be slightly less accurate and more computationally costly than BE-IDIC in finding the high probability region. However, both normalized and non-normalized versions of MHA can identify the material parameters with the accuracy similar to the deterministic methods in the tensile test. The irreducible errors in both the stochastic and deterministic method stem from the same source and affect the results almost equivalently. The stochastic approach was shown to have a few advantages: the relative ease of implementation (low number of hyper-parameters, usually set according to a rule-of-thumb), ability to optimize a large number of parameters that can also be dependent, as well as statistical data allowing more insight in the relationships between the parameters. The main downside is the high computational cost and lower precision than for the existing deterministic methods, which can be potentially remedied with an adaptive approach and the use of surrogate models.\n\n\n\n§ CREDIT AUTHOR STATEMENT\n\nLG: Methodology, Software, Investigation, Writing – Original Draft, Visualization; OR: Conceptualization, Methodology, Software, Resources, Writing – Review & Editing, Supervision; IP: Methodology, Writing – Review & Editing, Supervision; JH: Methodology, Software, Investigation, Writing – Review & Editing; JZ: Methodology, Writing – Review & Editing, Funding acquisition. \n\n\n\n§ ACKNOWLEDGEMENTS\n\nThis work received the support from the European Regional Development Fund (Center of Advanced Applied Sciences – CAAS, CZ 02.1.01/0.0/0.0/16 019/0000778 (I. Pultarová and L. Gaynutdinova)), the Czech Science Foundation (projects No. 22-35755K (L. Gaynutdinova) and No. 19-26143X (O. Rokoš, J. Havelka, and J. Zeman)), and the Student Grant Competition of CTU (projects No. SGS21/004/OHK1/1T/11 (I. Pultarová) and No. SGS23/002/OHK1/1T/11 (L. Gaynutdinova)). \n\n\n\n"}