{"entry_id": "http://arxiv.org/abs/2303.07042v1", "published": "20230313120540", "title": "Harmonic Field-based Provable Exploration of 3D Indoor Environments", "authors": ["Raksi Kopo", "Charalampos P. Bechlioulis", "Kostas J. Kyriakopoulos"], "primary_category": "cs.RO", "categories": ["cs.RO"], "text": "\nBayesian Approach to Micromechanical Parameter Identification Using Integrated Digital Image Correlation\n    [\n    Received; accepted\n========================================================================================================\n\n\n\nempty\nempty\n\n\n\n\n\n\nThis work presents a safe and efficient methodology for autonomous indoor exploration with aerial robots using Harmonic Potential Fields (HPF). The challenge of applying HPF in complex 3D environments rests on high computational load involved in solving the Laplace equation. To address this issue, the proposed solution utilizes the Fast Multiple accelerated Boundary Element Method with boundary values controlled to ensure both safety and convergence. The methodology is validated through simulations that demonstrate its efficiency, safety and convergence.\n\n\n\n\n \n\n\n\n\n\n§ INTRODUCTION\n\nAutonomous robotic exploration has a range of useful applications, including search and rescue missions, infrastructure inspection, and mapping. Robots operating autonomously can reduce the risks and costs associated with human exploration in hazardous and remote environments. Several methods have been developed aiming to address the autonomous exploration problem. A popular approach is maximizing the expected information gain <cit.>. In general, this involves finding the control action that minimizes a utility function, which encompasses the map's uncertainty, the uncertainty in the robot's position, and possibly a type of cost for executing the control action, usually the path length. In <cit.> Rapidly Random exploring Trees (RRT) path planning is introduced in information gain exploration. The authors in <cit.> use Frontier-based Exploration planning <cit.> for global exploration and the exploration method in <cit.> to improve the performance of the latter in larger environments.\n\nAn alternative approach utilizes Artificial Potential Fields (APF) in exploration. Compared to RRTs, which ensure probabilistic exploration, meaning full exploration given infinite time, APFs can ensure complete exploration if they are free of local minima. Furthermore, APFs can produce smooth trajectories and are inherently reactive. The two main approaches in constructing free of local minima APF are Navigation Functions <cit.> and Harmonic Potential Fields <cit.>. The former requires parameter tuning, while the latter is inherently free of local minima inside their domain of definition. The main drawbacks of such approaches are that they might require extraction of a closed form workspace representation from the probabilistic map or, in the case of HAPF, they can be computationally chalenging to calculate using conventional methods like Finite Elements or Finite Differences. These problems become more difficult in three dimensions due to more complex geometries and larger workspace volume. The method in <cit.> uses Fast Multiple Boundary Element Method (FastBEM) which significantly accelerates the calculation of the harmonic potential. In another work <cit.>, the author uses GPU-parallelised Finite Differences and devises an algorithm to eliminate the explored flat potential areas from future calculations.\n\nIn this work, we extend the results presented in <cit.> to three-dimensional complex indoor environments. The proposed exploration scheme guarantees complete exploration of such environments in finite time, while producing smooth and safe trajectories. We use Fast Multiple Boundary Element Method (FastBEM) to efficiently calculate the Harmonic Potential Field navigating the robot. Contrary to [11], we have developed algorithms for the removal of explored dead ends and robust boundary extraction, which further improve the exploration process. Finally, we demonstrate the effectiveness of our approach by testing it in a realistic indoor environment.\n\n\n\n\n§ PROBLEM FORMULATION\n\nThe initially unknown workspace W is a compact and connected subspace of ^3. The interior of W is the free space and its boundary can be considered as a union of disconnected closed surfaces with multiple handles. In most cases, there is only one surface if there are no floating or flying obstacles present. We assume that the robot has spherical sensing capabilities, meaning that its sensing space S(p) is composed of all line segments starting at the robot's position p=[x,y,z] with a length no greater than a specified range r and lying inside W. At a given time instance t, the explored space ε(t) is defined as the union of sensing spaces S(p) for all positions p along the path P(t) that the robot has traversed up to that time. More specifically, the explored space at a time instance t is defined as ε(t)=⋃_p∈ P(t) S(p), where P(t) is the path that the robot has traversed in time t.  The boundary of the explored space consists of two different sets: the occupied boundary ∂ε_o, which is comprised of parts of ∂ W and the free boundary parts ∂ε_f, which belong to the unoccupied space. The former remains the same while the latter is integrated into the interior of ε as the robot explores the workspace.\n\n\nProblem definition: Assuming a robot that obeys a single integrator kinematic model ṗ=u with initial position p(0)=p_0 ∈ intW, find a control law u=f(p,t,ε) that generates a path P(T), so that in finite time T>0 , ε(T)=W.\n\n\n\n§ METHODOLOGY\n\nThe central idea behind boundary value problem (BVP) exploration is to find a harmonic potential field φ(p) by solving the Laplace equation (<ref>), subject to boundary conditions that assign attractive potential unexplored frontiers and repulsive potential to boundaries corresponding to obstacles:\n\n\n    ∇^2φ(p)=0,\n\n  \n    ∂φ/∂ n=∇φ· n(q) =k(q), ∀ q∈∂ε\n\n\n\nwhere n(q) denotes the unit normal vector of ∂ε at q and k(q) is a given function that evaluates the directional derivative of φ(p) over the boundary ∂ε. \n \n\n For the boundary value problem (<ref>) with Neumann conditions (<ref>) to have a solution, the potential function must satisfy the compatibility constraint. This constraint states that the flux (flow) of the gradient field of φ across the boundary of the region must be equal to zero. \n\n    ∬_∂ε∇φ· n dS=0\n\n\n\nAn important property of harmonic functions, namely the maximum principle, states that a non-constant harmonic function cannot attain a maximum or minimum at an interior point of its domain. This implies that the values of a harmonic function in a bounded domain are bounded by its maximum and minimum values on the boundary. This makes harmonic potential fields suitable for autonomous navigation since the robot cannot be trapped in a local minimum.\n\n\n\n §.§ Fast Multi-pole Boundary Element Method\n\nThe method chosen to solve the Laplace equation is the Fast Multi-pole accelerated Boundary Element Method (FastBEM) developed in <cit.> which accelerates the conventional BEM and it is more efficient than Finite Element Method and Finite Difference Method in terms of computational time and memory requirements and for complex boundary geometries such as those of indoor environments. In conventional BEM <cit.> the boundary of the domain ∂ε is discretized and the boundary value problem (<ref>) is reformulated to boundary integral equations (<ref>) using Green's second identity and the fundamental solution. More specifically, the solution at a point p∈ε, inside the domain is expressed as a linear combination of the boundary values of the potential and its normal derivative:\n\n\n    φ (p)= H_p·φ̂-G_p·k̂\n    \nFor Neumann BVPs, the unknown boundary values of the potential, φ̂=[φ̂_1, φ̂_2, ..., φ̂_N]^T, depend linearly on the boundary values of its normal derivative, k̂=[k̂_1, k̂_2, ...,k̂_N]^T\n\n    φ̂= H^-1· G ·k̂\n\nwhere N is the number of boundary elements. The definitions of the 1× N vectors H_p, G_p and the N× N matrices H, G which contain the surface integrals of the fundamental solution and its normal derivative on each element can be found in <cit.>. The computational load of the Boundary Element Method primarily lies in assembling the BEM matrix H and solving the associated linear system. It is worth noting that the entries of H depend only on the geometry of the boundary, so if certain parts of the boundary do not change, the corresponding entries of the matrix are computed only once and reused, which reduces the computational effort significantly.\n\n In conventional BEM the computation of the matrix H requires O(N^2) operations and the solution of the system H·φ̂=G·k̂ using direct solvers requires O(N^3) operations. The main idea of FastBEM is to use iterative solvers with the Fast Multi-pole Method to accelerate the matrix-vector multiplication H·φ̂ in each iteration without ever forming the entire matrix H explicitly. The boundary elements are subdivided via an octree decomposition and the interactions among elements in conventional BEM are replaced by cell to cell interactions of the octree. Direct integration is performed only for the elements that are close to the source point whereas multi-pole  expansions are used for far away elements. This reduces the number of operations to O(N) decreasing dramatically the solution time. Moreover, the use of iterative solvers reduces significantly the memory requirements since the elements of H do not need to be explicitly stored.\n\n\n\n\n §.§ Occupancy Grid Mapping\n\nThe representation of the explored space ε is done through occupancy grid maps <cit.>. An occupancy probability value Pr(m) is assigned to each grid cell and updated using algorithms similar to those described in Chapter 9 of <cit.>, extended to three dimensions. Each point q∈∂ε inherits the probability of the cell that contains it, Pr(q)=Pr(m(q)), ∥ c-q∥_∞≤ m_r/2, where c denotes the center of cell m and m_r the cell size of the map in meters per cell. Defining an occupancy probability threshold a∈[0.5,1] we can classify each boundary point q∈∂ε as occupied or free and define the sets ∂ε_o and ∂ε_f as ∂ε_o={q∈∂ε: Pr(q)≥a} and ∂ε_f=∂ε∖∂ε_o.\n\n\n §.§ Velocity Control Law\n\nThe robot's velocity control law has the form:\n\n    u=-K_u· s·∇_pφ(p,k̂)\n\nwhere K_u is a scaling constant and s=S_R_1(d(p,∂ε)) denotes a function that asymptotically approaches zero as the robot approaches the boundary, for instance: \n\n    S_a(x)={[                 1,                x>a; 3(x/a)^2-2(x/a)^3,            0≤ x≤ a;                 0,               x<0.;                    ].\n\nBy the definition of S_R_1 we see that whenever the minimum euclidean distance d(p,∂ε) between the robot and the the boundary becomes less that a constant R_1, the robot will start slowing down.\n\n\n §.§ Construction of the Boundary Value Problem\n\nIn order to guarantee safety and complete exploration via (<ref>), as it will be shown later in the next section, the boundary values k̂ will track their desired target values k̂_t that will be designed in the sequel.\n\n\n  §.§.§ Target Boundary Values\n\nFirst, we will define k̂_t as:\n\n    k̂_t=k/k'_m I(q)k'(q).\n\n\nThe function k'(q) is defined using (<ref>) as:\n\n    k'={[ S_1-α(Pr(q)-α),         Pr(q)≥α;  -S_α(α-Pr(q)),         Pr(q)<α;                 ].\n\nand it assigns the appropriate sign to each target boundary value based on the probability occupancy Pr(q) of the corresponding boundary element at position q and the occupancy threshold α∈ [0.5, 1]. The function I(q) defined as\n\n    I(q)={[  ∬_∂ε_pk'dS,       q∈∂ε_p;             ; -∬_∂ε_nk'dS,       q∈∂ε_n;              ].\n\nis used to render the target boundary values compatible as shown in (<ref>) for the feasibility of the BVP solution. The sets ∂ε_p={q∈∂ε : k'(q)≥0} and ∂ε_n={q∈∂ε : k'(q)<0} correspond to the parts of the boundary where k' is positive and negative respectively.\nRegarding k and k'_m, it should be noted that k is a constant that specifies the maximum and minimum values of k̂_t and k'_m=max_q∈∂ε(∥k'(q)/I(q)∥).\n    \n\n\n\n  §.§.§ Boundary Value Control Law\n\nThe boundary values k̂ converge to the desired target values k̂_̂t̂ through the following control law:\n\n    k̇̂̇=(cμ+b_e)(k̂_t-k̂)  , k̂(0)=k̂_0\n\nThe parameters c and μ are defined as c=S_ϵ_w(∥∇_pφ-ϵ_1∥) and μ=S_μ_1(K_u s∥∇_pφ∥^2/∥∂φ/∂k̂(k̂_t-k̂)∥+ϵ_2) with ϵ_w, ϵ_1 and ϵ_2 small positive constants. The term c ensures that k̇̂̇→ 0 as the robot converges to a critical point of φ, whereas μ is used to adjust the rate with which the boundary values approach the target values. By specifying μ_1 > 9/8 we ensure that S_μ_1(x)<x, ∀ x > 0. The usefulness of this will become apparent in the next section. Regarding the term ∂φ/∂k̂=[∂φ/∂k̂_1, ∂φ/∂k̂_2..., ∂φ/∂k̂_N] in μ, we see that combining (<ref>) and (<ref>) we have φ = (H_p· H^-1· G-G_p)·k̂, therefore ∂φ/∂k̂=H_p· H^-1· G-G_p. Finally, b_e is defined as\n\n    b_e={[                     0, if  k̂(q) ≥0  ∀ q∈∂ε_o;                       ;                     1,              otherwise;                        ].\n\nand ensures that the potential becomes safe by increasing the convergence rate of k̂ to the desired target value k̂_t in case there exists an attractive occupied boundary, such as when a previously free part of the boundary is replaced by an obstacle during exploration.\n\n\n §.§ Proof of Safety and Complete Exploration\n\nIn this subsection, we state some useful theoretical results regarding the aforementioned control design.\n\n k̂_t is bounded and compatible.\n\n\n From the definition of k'_m it holds that\n    \n    k'_m≥∥k'(q)/I(q)∥⇒∥kk'(q)/k'_m I(q)∥≤k⇒ -k≤k̂_t≤k\n\n    therefore k̂_t is bounded. Also\n\n    ∬_∂εk̂_tdS=∬_∂εkk'(q)/k'_m I(q)dS=∬_∂ε_pkk'(q)/k'_m I(q)dS+∬_∂ε_nkk'(q)/k'_m I(q)dS\n\n    \n\n   \n    =k/k'_m ∬_∂ε_pk'dS∬_∂ε_pk'(q)dS-k/k'_m ∬_∂ε_nk'dS∬_∂ε_nk'(q)dS=k/k'_m-k/k'_m=0\n\n which completes the proof.\n\n\n Assuming that k̂ is compatible for t = 0, the adaptive law (<ref>) guarantees that k̂ will remain compatible and bounded for all time.   \n\n\n\n    Assume that k̂_i(t)=k̅ for some time  t ≥ 0. Then, k̇̂̇_i must be non-positive because it is proportional to k̂_t,i-k̂_i and k̂_t,i≤k thus, k̂_i cannot exceed k. Similarly, it holds that -k≤k̂_i. Therefore k̂ is bounded. Next, we denote as I_c the closed surface integral of k̂. For constant boundary elements\n   \n    I_c=∬_∂εk̂dS=∑_i=1^N A_i k̂_i=A·k̂\n where A=[A_1, A_2, ..., A_N] denotes the areas of each element. In case A_i=A_j, i≠ j then we remove the j-th elements from A and k̂ and replace k̂_i with k̂_i+k̂_j so that the new A is full column rank. Taking the derivative of I_c w.r.t. time we have\n\n    İ_̇ċ=Ȧ·k̂+A·k̇̂̇=Ȧ·k̂+A· (cμ+b_e)(k̂_t-k̂)\n \n    and from the compatibility of k̂_t, i.e., A·k̂_t=0, we obtain:\n    \n    İ_̇ċ=Ȧ·k̂-A·k̂(cμ+b_e)=[Ȧ·(A^T· A)^-1· A^T-(cμ+b_e)] A·k̂\n \n    \n    İ_̇ċ=[Ȧ·(A^T· A)^-1· A^T-(cμ+b_e)]I_c.\n\n    Therefore if k satisfies the compatibility condition, I_c=0, at t=0 then it satisfies it for all t≥0. Considering this, we choose k̂_0=k̂_t,0 as initial conditions for (<ref>). \n    \n\n\n    If the potential φ(p,k̂) is unsafe, the control law (<ref>) guarantees it will become safe in finite time.\n\n\nWhen the robot is using the potential field computed in the previous time step of the newly explored occupied boundary, ∂ε_o may have attractive potential rendering φ unsafe. In that case, b_e in (<ref>) is activated so that in finite time k̂ approaches the desired positive value k̂_t asymptotically and the potential field computed in the next step becomes safe eventually.\n\n\n\n    The function φ(p,k̂) is lower bounded.\n\n\n    Due to well-posedness of the boundary value problem φ(p,k̂) depends continuously on the boundary conditions k̂∈[-k,k],  ∀ p∈ε. The set [-k,k] is closed therefore by the extreme value theorem φ accepts a maximum and a minimum value in {(p,k̂)| k̂∈[-k,k]  and  p∈ε}. Therefore it is lower bounded.\n    \n\n\n    The robot's trajectory under control law (<ref>) is safe.\n\n\n    If φ is safe then all points in the occupied boundary are repulsive and collision avoidance is ensured. In case φ is not safe, it will become safe in finite time as p→∂ε_o, which means that the robot approaches the boundary asymptotically, therefore in the worst case the robot stops at the boundary. Assuming accurate sensing and that the updated potential field is computed as the robot moves, the occupied boundary becomes strictly repulsive and collision avoidance is ensured.  \n     \n\n\n\n Assuming b_e=0, the proposed robot control guarantees the full exploration of W in finite time from almost any initial configuration.\n\n\nBarbalat's lemma will be used to prove that dφ/dt→0 as t→∞. The following conditions must be satisfied: 1) φ has a finite limit as t→∞, and 2) dφ/dt is uniformly continuous w.r.t. time. For the first condition we showed that φ(p,k̂) is lower bounded and we need to show that dφ/dt≤0, where:\n\n    dφ/dt=∇_pφ·dp/dt+∂φ/∂k̂·dk̂/dt\n\n\n    dφ/dt≤-K_us∥∇_pφ∥^2+∥∂φ/∂k̂·(k̂_t-k̂)∥ cμ.\n\nFor μ_1>9/8 it holds that:\n\n    K_us∥∇_pφ∥^2/∥∂φ/∂k̂(k̂_t-k̂)∥+ε_2≥ S_μ_1(K_us∥∇_pφ∥^2/∥∂φ/∂k̂(k̂_t-k̂)∥+ε_2)\n\n\n    K_us∥∇_pφ∥^2≥ (∥∂φ/∂k̂(k̂_t-k̂)∥+ε_2)μ\n\n\n    K_us∥∇_pφ∥^2≥∥∂φ/∂k̂(k̂_t-k̂)∥ c μ\n\n\n    0≥-K_us∥∇_pφ∥^2+∥∂φ/∂k̂(k̂_t-k̂)∥ c μ.\n\nNext, we show that dφ/dt is uniformly continuous w.r.t. time. It suffices to show that dφ/dt is locally Lipschitz continuous since φ has been proven bounded.\nIn the first term of dφ/dt in (<ref>) , s is locally Lipschitz continuous and bounded between 0 and 1, ∇_pφ is real analytic and thus locally Lipschitz and bounded in ε. Therefore, the first term of dφ/dt is locally Lipschitz continuous as a product of locally Lipschitz continuous and bounded functions. Regarding the second term, it can be shown that it is continuous and has a piece-wise continuous first derivative, as a composition of such functions. Using the extreme value theorem, it can be shown that the derivative of the second term is bounded. Thus, using the mean value theorem it can be shown that the second term of dφ/dt is locally Lipschitz continuous. Consequently, dφ/dt is locally Lipschitz continuous.\n\nTherefore the conditions of Barbalat's lemma are fulfilled and the derivative of φ w.r.t. time converges to 0 as t→∞. By (<ref>) we see that dφ/dt→ 0 occurs in two cases: i) when the robot approaches the free boundary (s→0 and μ→0) and ii) when ∥∇_pφ∥→0 (c→0).\nThe second case, means that the robot converges to a critical point of φ which for a harmonic function is an unstable saddle. Therefore, the robot will move towards the free boundary of W and thus fully explore it in finite time.\n\n\n\n§ IMPLEMENTATION\n\n\n\n §.§ Boundary Extraction\n\nAfter obtaining the occupancy map of the explored workspace, we need to extract its boundary in form of a closed triangulated surface which is required by the BEM solver. In this implementation, we used 3D Delaunay triangulation <cit.> due to its computational efficiency and ability to produce the required closed surface. The implementation steps are given as follows:\n\n\n\n\n\n §.§ Dead End Closing\n\nGiven a generated map and trajectory, the goal of this algorithm is to remove the explored regions that the robot will not have to traverse again (i.e., areas with no unexplored free boundaries). To do this we need to identify boundary patches between the region to be removed and the remaining space. Once the region has been removed, the boundaries between the remaining space and the removed region are set to have an occupancy probability of 0.99, indicating that they are now considered occupied. For simplicity, the algorithm considers only one boundary patch at a time that separates the explored space into two distinct regions. In this implementation, we examine planar patches that intersect the trajectory and are perpendicular to it. Next, we provide the implementation steps of the algorithm and demonstrate the results from its application on the ”Maze\" environment in Figure <ref>. The figure shows the boundary of the explored space on the left and the boundary that is used in the Fast BEM solver after applying the dead end closing algorithm on the right.\n\n\n\n\n\n§ RESULTS\n\nIn this section, we present the simulation results from our implementation. The sensing and occupancy grid mapping were simulated using Matlab's Navigation Toolbox. The environments were designed in CAD software and imported as mesh files. All aforementioned algorithms where implemented in Matlab 2020b, except the Laplace solver which is provided in <cit.>. The controller parameter values that are used in the following simulations are shown in TABLE <ref>. We test our algorithm in two different environments shown in Figure <ref>. The first is a small corridor maze in order to demonstrate the performance of the dead end closing algorithm and the second is a more complex and larger environment representing a two story building with multiple rooms. \n\n\n\n\n\n\n §.§ Generated Maps and Trajectories\n\nThe generated maps and trajectories are shown in Figures <ref> and <ref> and the corresponding path lengths and exploration times in Table <ref>. We see that the robot has fully explored the testing environments in reasonable time and maintains a safe distance from the explored space's boundaries. Regarding the Corridor Maze environment, we see that the dead end closing algorithm helped reduce the total exploration time by a factor of 1.6. As for the two story building environment the robot was able to revisit the upper and lower floor to explore remaining space. This validates the completeness of the proposed exploration scheme for large and complex environments. Regarding the performance of FastBEM, the computation of the unknown boundary values in (<ref>) was conducted every 10 iterations or when the robot approached close to the free boundary and rose linearly from 2 sec for 2500 elements to 27 sec for 27000 elements for the two story building. For the corridor maze those numbers where lower than 6 sec and lower than 2 sec when we applied the dead end closing algorithm. The maximum computation time of the gradient ∇_pφ from (<ref>) per step was 0.2 and 0.12 sec for the Two-story and the Corridor Maze, respectively. For the latter, the dead end closing algorithm reduced the gradient computation time below 0.04 seconds.\n\n\n\n\n\n\n\n\n\n\n §.§ Comparison\n\nIn this subsection, we compare the performance of our algorithm with two other state-of-the-art algorithms: the receding horizon next best view planner (RH-NBVP) <cit.> and the frontier-based planner <cit.>, on the same indoor environment. In order to compensate for the narrower field of view used in <cit.>, which was [60^∘,90^∘] with a depth of 5 meters, we used a smaller sensing radius of 3 meters instead of 5 meters. Additionally, we lowered our map's resolution to 3 cells/m to ensure compatibility with the RH-NBVP's map resolution of 2.5 cells/m. The generated maps and trajectories for our algorithm are shown in Figure <ref> for two different starting positions, while those for the RH-NBVP and the frontier-based planner are shown in Figure <ref>. Regarding the exploration time, the overall time of the RH-NBVP was 501 seconds, the frontier-based planner was 470 seconds (on average), and our algorithm was faster than the other two algorithms, with 451 seconds and 371 seconds respectively for the two initial points. All approaches fully explored the environment, but the trajectories generated by our algorithm are smoother (smaller radius of curvature more than 0.45m), maintain a safe distance from the walls more than 0.35m and transverse every corridor of the environment. In contrast, the trajectories generated by the other approaches contain sharp turns, approach close to the walls (the minimum distance reached 0.05m) and do not extend evenly to all the corridors of the environment.\n\n\n\n\n\n\n\n§ CONCLUSIONS\n\nIn summary, this work presents a safe, smooth, efficient and provably complete method for 3D exploration of complex indoor environments. Furthermore, we proposed two algorithms for robust boundary extraction and for reduction of the boundary's size by removing explored dead ends automatically. The aforementioned properties were validated by simulation results in various types of environments. In comparison to two existing approaches, we showed that the proposed scheme outperforms them in terms of safety, trajectory smoothness and exploration time in a typical indoor environment. For future research, we aim at applying a faster GPU-based version of FMBEM in real experiments and extending the methodology to outdoor environments for tasks like inspection of structures.\n\n\n\nieeetran\n\n\n"}