{"entry_id": "http://arxiv.org/abs/2303.07361v1", "published": "20230313180001", "title": "Static Black Binaries in de Sitter", "authors": ["Oscar J. C. Dias", "Gary W. Gibbons", "Jorge E. Santos", "Benson Way"], "primary_category": "gr-qc", "categories": ["gr-qc", "astro-ph.HE", "hep-th"], "text": "\n\nAPS/123-QED\n\n\n\n\nojcd1r13@soton.ac.uk\nSTAG research centre & Mathematical Sciences, University of Southampton, Highfield Campus, UK\n\ngwg1@maths.cam.ac.uk\nDAMTP, Centre for Mathematical Sciences, University of Cambridge, Wilberforce Road, Cambridge CB3 0WA, UK\n\njss55@cam.ac.uk\nDAMTP, Centre for Mathematical Sciences, University of Cambridge, Wilberforce Road, Cambridge CB3 0WA, UK\n\nbenson@icc.ub.edu\nDepartament de Física Quàntica i Astrofísica, Institut de Ciències del Cosmos Universitat de Barcelona, Martí i Franquès, 1, E-08028 Barcelona, Spain\n\n\nWe construct the first four-dimensional multi-black hole solution of general relativity with a positive cosmological constant. The solution consists of two static black holes whose gravitational attraction is balanced by the cosmic expansion. These static binaries provide the first four-dimensional example of non-uniqueness in general relativity without matter.\n\n\nStatic Black Binaries in de Sitter\n    Benson Way\n    March 30, 2023\n==================================\n\n\n\n\n    Introduction.\n\n\nBlack holes are famously featureless.  This idea is embodied by the no-hair theorems, which state in essence that stationary black holes are uniquely characterized by their mass, angular momentum, and charge <cit.>.\n\nIt should be noted that there are many situations where black hole uniqueness, as we have expressed it, is known to be violated. A well-known example involves multi-horizon configurations of charged, extremal black holes <cit.>. Other examples include higher dimensions <cit.>, anti-de Sitter asymptotics <cit.>, or exotic matter like classical Yang-Mills fields, complex scalars and Proca fields <cit.>.\n\nAdditionally, there are some mathematical gaps in fully establishing black hole uniqueness, even in the more limited case of four-dimensional pure gravity in flat space.  Indeed, asymptotically flat multi-Kerr black holes, where their gravitational attraction might be balanced by spin-spin interactions, have not been ruled out (see e.g. \n<cit.> for attempted constructions that yield singular configurations). Though for static solutions, a classic theorem due to <cit.> precludes the existence of regular asymptotically flat multi black holes.\n\nDespite these (and potentially more) counterexamples, there is currently no experimental or observational evidence that black hole non-uniqueness can be realized in astrophysical or cosmological contexts. Indeed, the no-hair theorems are fully consistent with observational results from the LIGO consortium <cit.>. \n\nHowever, the no-hair theorems assume that spacetime is asymptotically flat, a feature which is violated in our universe at the longest scales by the presence of a cosmological constant <cit.>.  The resulting cosmic expansion might balance out the gravitational attraction of two or more black holes, allowing multiple black holes to exist in static equilibrium. Such a configuration would share the same mass and angular momentum as some single-horizon black hole and therefore serve as a more realistic counterexample to black hole uniqueness.\n\nThe aim of this Letter is to demonstrate that such a multi-horizon configuration indeed occurs within general relativity.  We will focus on the simplest case with two equal-mass black holes that do not rotate nor contain charge, but our results and methods can be straightforwardly generalized.  We will first show that these black binaries can be anticipated using intuition from Newton-Hooke theory, and then construct these solutions by solving the Einstein equation numerically. Finally, we study the properties of these binaries in detail.  \n\nOur results, along with physical intuition, suggest that the static de Sitter binaries are dynamically unstable.  Nevertheless, there remains a possibility that they can be stabilized with the introduction of charge or angular momentum.  We will comment on this and other matters in the conclusions.\n\nBefore we continue, we mention some closely related work.  Dynamical (i.e. out of equilibrium) multi-black holes in Einstein-Maxwell theory with a positive cosmological constant were found in <cit.>. The “rod-structure\" corresponding to our static binaries were anticipated and examined in detail in <cit.>.  In <cit.>, a novel mechanism for balancing multi-black holes was proposed. These constructions provide Ricci-flat, closed-form solutions for static binaries supported by expanding bubbles of nothing. Mechanically, these solutions behave similarly to the static binaries we find.\n\nFinally, we mention the mathematical papers <cit.>, which might seem to rule out the existence of static black binaries in de Sitter.  We will show that the assumptions made in <cit.> do not apply, and that (for technical reasons) this conclusion from <cit.> is not correct. \n\n\n\n\n    Newton-Hooke.\n\n\nLet us first set out to see if the aforementioned multi-black hole configurations are allowed within Newtonian gravity.  We adopt geometrized units in which c=G=k_B=ħ=1.\n\nConsider a configuration of N black holes with masses m_a, with a=1,…,N.  For the Newtonian approximation to be valid, we assume that the distances between the black holes are much larger than their masses.  We now include the effects of the cosmological constant Λ≡ 3/ℓ^2>0, where ℓ is the de Sitter length scale.  Accordingly, we assume that the entire configuration of black holes lies within a distance much smaller than ℓ and consider the Newton-Hooke equations of motion <cit.>\n\n    m_a d^2𝐱_a/dt^2-m_a 𝐱_a/ℓ^2=-∑_b≠ a^b=N m_a m_b(𝐱_a-𝐱_b)/|𝐱_a-𝐱_b|^3 ,\n\nwhere 𝐱_a are the positions of the black holes.\n\nStatic solutions exist when\n\n    𝐱_a/ℓ^2=∑_b≠ a^b=N m_b(𝐱_a-𝐱_b)/|𝐱_a-𝐱_b|^3 .\n\nSuch solutions are known  as central configurations and provide homothetic solutions of the Newtonian N-body problem which has applications to Newtonian cosmology. The equation (<ref>) can also be obtained from the Dmitriev-Zeldovich equations <cit.> by using the scale factor S(t) = e^t/ℓ, corresponding to a de Sitter background in “stead-state\" coordinates <cit.>. \n\nConsider a central configuration with two equal mass black holes aligned along the z axis and separated by a distance d.  That is, N=2, 𝐱_1=-𝐱_2=d/2 𝐞_z, and m_a=m_b=M.  Then (<ref>) imposes\n\n    d^3/ℓ^3=r_+/ℓ\n\nwhere r_+≡ 2M is the Schwarzschild radius.  \n\nThe requirements that the Newton-Hooke approximation should be valid and that the black holes are inside a single cosmological event horizon amount to\n\n    r_+≪ d ,    d≪ℓ  and   r_+≪ℓ .\n\nIf the distance between the black holes is given as in (<ref>), then we see that the first two conditions above are satisfied if we assume the third, i.e. if the black holes are small enough.  We therefore conclude that static de Sitter binaries with small black holes are consistent with Newton-Hooke theory. \n\nFor later use, we introduce the event horizon Hawking temperature T_+= (4 π r_+)^-1 and rewrite (<ref>) as\n\n    d/ℓ = 1/(4 πℓ T_+)^1/3 .\n\nWe will confirm that our numerical solutions to the Einstein equation satisfy this scaling in the appropriate limit. \n\n\n\n\n    Numerical construction.\n \nWe now construct static binaries in general relativity by numerically solving the Einstein equation with a positive cosmological constant:\n\n    R_ab=3/ℓ^2 g_ab ,\n\nwhere R_ab is the Ricci tensor and g_ab is the metric tensor. \n\nWe use the DeTurck method, first introduced for general relativity in <cit.> and reviewed in <cit.>.  This method provides a convenient way of addressing the issue of gauge invariance, which ultimately causes the Einstein equation (<ref>) to yield a set of ill-posed, non-elliptic PDEs. \n\nThe DeTurck method involves choosing any reference metric g̅ with the same symmetries and causal structure as the solution we seek.  In this case, our reference metric is static, contains two identical black holes, a cosmological horizon, and is axisymmetric.  There is therefore a discrete ℤ_2 symmetry, as well as two Killing vector fields k=∂/∂ t and m=∂/∂ϕ. We further assume that the black holes and cosmological horizon are Killing horizons generated by k.  Our specific choice of reference metric involves a combination of the Israel-Khan solution <cit.> and the static patch of de Sitter space.  Its design is detailed in the Supplementary Material. \n\nWe then write down the most general metric ansatz g that respects the desired symmetries and causal structure.  In this case, the metric ansatz depends non-trivially on two coordinates (i.e. it is cohomogeneity-two, and will yield two-dimensional PDEs).  \n\nWe then solve the Einstein-DeTurck equation\n\n    R_ab-∇_(aξ_b)=3/ℓ^2g_ab ,\n\nwhere ξ^a ≡ g^bc[Γ^a_bc(g)-Γ^a_bc(g̅)], and Γ(𝔤) is the metric-preserving Christoffel connection associated to a metric 𝔤.  Unlike the Einstein equation, the Einstein-DeTurck equation (<ref>) yields a set of elliptic PDEs <cit.>, which gives a well-posed boundary-value problem with appropriate physical boundary conditions.  \n\nThe Einstein-DeTurck equation (<ref>) is solved numerically.  One complication is that the integration domain contains five boundaries: the ℤ_2 reflection surface, two disconnected symmetry axes, the black hole horizons, and the cosmological horizon.  We handle this domain using patching techniques.  This and other numerical methods we use are described in <cit.> and detailed in the Supplementary Material.\n\nAfter solving (<ref>), we must verify that the solution actually solves the Einstein equation, i.e. that ξ=0, and is therefore not a Ricci soliton (for which ξ≠0).  Under many circumstances <cit.>, it can be proved that these unwanted Ricci solitons do not exist.  Unfortunately, the present case is not one of these circumstances. Indeed, with a positive cosmological constant, Ricci solitons are known to exist (see e.g. <cit.>). Nevertheless, ellipticity guarantees local uniqueness. That is, solutions with ξ=0 cannot be arbitrarily close to solutions with ξ≠0, and thus the norm ξ^aξ_a can be monitored to identify whether our numerical discretization converges in the continuum to a Ricci soliton or to a true solution of the Einstein equation. In the Supplementary Material, we provide ample evidence that the numerical solutions we construct are not Ricci solitons.\n\n\n\n\n    Results.\n Having numerical solutions corresponding to static black binaries in de Sitter, we can now describe their properties and compare the numerical results to Newton-Hooke theory when the latter is valid.  \n\nWe expect to find agreement with Newton-Hooke theory when the black holes become sufficiently small, or alternatively, when the black hole temperature becomes sufficiently large T_+ ℓ≫ 1. In FIG. <ref>, we provide a log-log plot of the proper distance between the horizons of the two black holes along the symmetry axis 𝒫_ϕ/ℓ, as a function of temperature 4 π T_+ℓ. The solid black line is the scaling (<ref>), and the blue dots are the numerical data. The agreement at large values of T_+ℓ shows the validity of the Newton-Hooke analysis and corroborates our numerical construction.\n\n\n\nWe have not managed to find solutions with large black holes (small 4π T_+ ℓ).  Because our solutions do not have regions of large curvature, there might be a “turning point\" to a new branch of solutions. A similar phenomenon occurs for localized Kaluza-Klein black holes when the black holes are large relative to the Kaluza-Klein circle <cit.>.  We leave the exploration of this region of parameter space for future work. \n\nLet us now discuss black hole thermodynamics. For a central configuration containing N black holes inside the static patch of de Sitter, the covariant phase space formalism <cit.> shows that the following form of the first law of black hole mechanics holds\n\n    ∑_i=1 ^NT^(i)_+  dS^(i)_+ = -T_c dS_c ,\n\nwhere T_c is the temperature of the cosmological horizon, and S_c is its entropy (i.e horizon area). T^(i)_+ and S_+^(i) are the same quantities, respectively, for the i-th black hole.  With N=2 and equal-mass black holes, we find\n\n    2 T_+  dS_+ = -T_c dS_c .\n\nWe have checked that our data satisfies this form of the first law to within 0.01%.\n\nFollowing <cit.>, we now consider the entropy, which must increase during time evolution.  The blue dots in FIG. <ref> show the entropy of the static binary as a function of the entropy S_c of the cosmological horizon.  The black curve shows the entropy for the single Schwarzschild-de Sitter black hole (also known as the Kottler black hole).  We see that for any given S_c, the single Schwarzschild black hole has higher entropy than the binary.  This indicates that the binary can evolve towards the single black hole but not the other way around.  The static black binary is therefore thermodynamically unstable. \n\nThe fact that (at least) two solutions exist for a given cosmological horizon entropy implies that the Schwarzschild-de Sitter black hole is not unique.  This is the first counterexample to the no-hair conjecture <cit.> for pure gravity with a positive cosmological constant. \n\n\n\n\nWe now comment on the uniqueness theorems for de Sitter black holes <cit.> which would, under certain assumptions, rule out the existence of static de Sitter binaries. In <cit.>, the level sets of the lapse function N≡√(-g_tt) are assumed to be surface forming.  In particular, this means that the level sets must consist only of 2D surfaces. In <cit.>, the set MAX(N)={x∈ℳ:N(x)=N_max}, where N_max is the maximum value of N in the manifold ℳ, is assumed to disconnect ℳ into an inner region ℳ_- and an outer region ℳ_+ with the same virtual mass.  Our static binaries do not satisfy either of these assumptions.  Indeed, in FIG. <ref> we show the level sets N in our domain of integration for a typical solution (all of our solutions show the same qualitative behavior). The coordinates (r,z) are defined in the Supplemental Material.  The cosmological horizon is represented by the outer solid black semicircle, the two black hole horizons are marked by solid magenta lines along the horizontal axis, and the inner and outer axes are given by the dashed horizontal line. Finally, the green square marks the location of the maximum of N in ℳ.  This maximum represents an S^1 on the manifold, which is not a 2D surface, and it also does not partition the manifold into two regions. Therefore, our static binaries fail to satisfy the assumptions in <cit.>.\n\nFinally, we comment on <cit.>. We believe that this work is not correct for a rather technical reason. Beginning with the Schwarzschild-de Sitter black hole, the authors in <cit.> argue that they can construct an asymptotically flat metric that is conformal to the original one, is topologically S^1× S^2 deprived of one point, and has zero ADM mass.  If that were true, the rigidity statement in the positive mass theorem  <cit.> would not only imply that the original metric is conformally flat, but also that S^1× S^2 with one point removed is diffeomorphic to ℝ^3, which is impossible.\n\n\n\n\n\n    Conclusions.\n We constructed the first example of a multi-black hole solution within general relativity with a positive cosmological constant and established that the leading behavior of these solutions agrees (for small black holes) with estimates from Newton-Hooke theory. Based on thermodynamic considerations, we argued that these solutions are thermodynamically unstable.  Because the configuration requires a delicate balance between gravitational attraction and cosmic expansion, we expect these solutions to also be dynamically unstable. \n\nWe have focused on the static configuration of two identical black holes, but our results and methods can be generalized.  First, consider the case where the black holes have different masses.  When one of the black holes is much smaller than the other, one can use the geodesic approximation to predict the existence of such a configuration. Indeed, one can easily confirm the existence of static orbits for timelike particles on a Schwarzschild-de Sitter black hole background, thus providing further evidence for the existence of this more general central configuration. Note that if <cit.> were correct, this asymmetric binary would also not exist.\n\nWe can also include rotation, which will introduce spin-spin interaction of the black holes.  This opens the possibility of continuous non-uniqueness.  Consider, for example, the case with two identical black holes rotating in opposite directions along the axis of symmetry.  This configuration will have vanishing total angular momentum, and will thus be in the same class as the Schwarzschild-de Sitter black hole. Work in this direction is underway.\n\nPerhaps more interestingly, because spin-spin interactions act on shorter length scales, they could provide a mechanism for stabilizing the binary. This possibility resembles the mechanism that provides stability for molecules.  Work in this direction is underway.\n\nWe could also consider central configurations containing N>2 static black holes in the static patch of de Sitter.  These configurations can show interesting properties within the Newton-Hooke approximation.  For instance, when N≥13, minimal energy central configurations do not lie on a regular polyhedron <cit.>.  We thus expect the equivalent property within general relativity.  The study of these configurations is within the reach of the numerical methods employed in this Letter.\n\n\n\nThe authors would like to thank Stefano Borghini, Lorenzo Mazzieri and Ryan Unger for valuable discussions and correspondence regarding <cit.>. J. E. S. would like to thank Jay Armas and Troels Harmark for mentioning this interesting problem to him in 2012 at the 28th Pacific Coast Gravity Meeting, held at University of California, Santa Barbara and Don Marolf for discussions on the microcanonical properties of black holes contained inside the static patch of de Sitter.  O. C. D. acknowledges financial support from the STFC “Particle Physics Grants Panel (PPGP) 2018\" Grant No. ST/T000775/1. J. E. S. has been partially supported by STFC consolidated grant ST/T000694/1.  B. W. would like to thank Roberto Emparan for fruitful discussions and acknowledges support from ERC Advanced Grant GravBHs-692951 and MEC grant FPA2016-76005-C2-2-P.  The authors acknowledge the use of the IRIDIS High Performance Computing Facility, and associated support services at the University of Southampton, for the completion of this work.\n\n\nutphys-modified\n\n\n\n\n\n\n\n\n\n\n§ SUPPLEMENTARY MATERIAL\n\n\n\n\n\n\n§ THE ISRAEL-KHAN SOLUTION\n\nThe Israel-Khan solution <cit.> is an exact solution that describes two asymptotically flat black holes separated by a conical strut.  Because it is an exact multi-horizon solution, it will be useful for our numerical construction of static de Sitter binaries. Here, we review this solution and describe some of its coordinate representations that we use. \n\nAside from the conical strut, the Israel-Khan spacetime is completely regular outside the horizons. Here, we are only concerned with the case where both black holes are equal.  The solution is often presented in Weyl coordinates:\n\n    s^2=ℓ^2[-f t^2+λ^2/f[h( r^2+ z^2)+r^2ϕ^2]] ,\n\nwhere\n\n    f=(k(R_++r_+)-(1-k)/k(R_++r_+)+(1-k))(k(R_-+r_-)-(1-k)/k(R_-+r_-)+(1-k)) ,\n\n\n    h   =(r^2+(z+1/k)(z+1)+R_+r_+/2R_+r_+)(r^2+(z-1/k)(z-1)+R_-r_-/2R_-r_-)\n           ×(r^2+z^2-1+r_+r_-/r^2+(z-1/k)(z+1)+r_+R_-)(r^2+z^2-(1/k^2)+R_+R_-/r^2+(z+1/k)(z-1)+R_+r_-) ,\n\nwith\n\n    R_±=√(r^2+(z±1/k)^2) ,     r_±=√(r^2+(z±1)^2) ,\n\nand where ℓ is an arbitrary length scale that we have introduced for later use in de Sitter. The solution is parametrized by λ∈(0,∞) and k∈(0,1).  The temperature of the black holes is given by\n\n    T = 1/2π4λ(1-k)/k(1+k) .\n\n\nA peculiarity of the Weyl form is that the axes and horizons of the solution are all located at r=0, and so is described as a “rod structure.\"  At r=0, the horizons lie in the regions z∈ (1,1/k) and z∈ (-1/k,-1), with the inner axis between the black holes in the region z∈(-1,1), and the outer axes in z∈(1/k,∞) and z∈(-∞,-1/k).  The inner axes contains a conical singularity which holds the two black holes apart.\n\nThe Weyl form is useful for obtaining this solution as it provides a means of simplifying the Einstein equation into an integrable form.  But in order to accommodate the rod structure, the coordinates cannot be smooth along the line r=0 (there are coordinate singularities at the “joints\" between rods), making the Weyl form ill-suited for our numerical purposes.\n\nWe therefore seek a coordinate transformation that maps the outer axes, inner axis, and horizons into a coordinate rectangle.  This can be accomplished by a conformal Schwarz-Christoffel transformation.  The standard formulas for this type of transformation will give mappings that use Jacobi Elliptic functions, but here we convert these functions to a more algebraic form.  The mappings we use are defined by\n\n    z=x√(2-x^2)√((1-y^2)^2+k^2y^2(2-y^2))/(1-y^2)^2+k^2x^2(2-x^2)y^2(2-y^2) ,     r=(1-x^2)√(1-k^2x^2(2-x^2))y√(2-y^2)(1-y^2)/(1-y^2)^2+k^2x^2(2-x^2)y^2(2-y^2) .\n\nLines of constant x and y, along with the rod structure of Israel-Khan are shown in FIG. <ref>.\n\n\nWith this coordinate transformation, the Israel-Khan solution takes the form\n\n    s^2=ℓ^2{-f t^2+λ^2/m^2 Δ_xy^2[w^2(4 x^2/(2-x^2)Δ_x+4 y^2/(2-y^2)Δ_y)+y^2(2-y^2)(1-y^2)^2ϕ^2]} ,\n\nwhere in these coordinates\n\n    f=(1-x^2)^2Δ_x m^2\n\nand\n\n    Δ_x=1-k^2x^2(2-x^2) ,    Δ_y=1-(1-k^2)y^2(2-y^2) ,    Δ_xy=(1-y^2)^2+k^2x^2(2-x^2)y^2(2-y^2) ,\n\n\n    w=k/(1+k)^2(1+√(Δ_y))^2 ,     m=k[1-(1-k)y^2(2-y^2)+√(Δ_y)]/(1-k)Δ_x(1-y^2)^2+(k+√(Δ_y))[Δ_x+(1-k)(√(Δ_xy)-1)] .\n\nThe horizons are at x=± 1, the inner axis is at y=0, and the outer axes are at y=1.  There is also a ℤ_2 symmetry about x=0.  All functions Δ_x, Δ_y, w, and m are smooth and positive definite in the domain.  Δ_xy vanishes at (x,y)=(0,1) (asymptotic infinity), and is positive and smooth otherwise.\n\nEventually, we wish to join the Israel-Khan solution with a de Sitter horizon.  In anticipation of doing so, we present the Israel-Khan solution in polar-Weyl coordinates defined by\n\n    z=ρξ√(2-ξ^2) ,     r=ρ(1-ξ^2) ,\n\nwhere the Israel-Khan solution takes the form\n\n    s^2=ℓ^2{-f t^2+λ^2h/f[ρ^2+ρ^2(4ξ^2/2-ξ^2+(1-ξ^2)^2/hϕ^2)]} ,\n\nwith f and h also transformed accordingly.  For later use, we find it convenient to express f and h as functions of ρ and z=ρξ√(2-ξ^2):\n\n    f=(k(R_++r_+)-(1-k)/k(R_++r_+)+(1-k))(k(R_-+r_-)-(1-k)/k(R_-+r_-)+(1-k)) ,\n\n\n    h   =(ρ^2+1k[1+(1+k)z]+R_+r_+/2R_+r_+)(ρ^2+1k[1-(1+k)z]+R_-r_-/2R_-r_-)\n           ×(ρ^2-1+r_+r_-/ρ^2-1k[1+(1-k)z]+r_+R_-)(ρ^2-(1/k^2)+R_+R_-/ρ^2-1k[1-(1-kz)]+R_+r_-) ,\n\nwith\n\n    R_±=√(ρ^2+1/k^2±2z/k) ,     r_±=√(ρ^2+1±2z) ,\n\nNote that h and f approach unity when ρ→∞, where the spacetime becomes asymptotically flat.\n\nFrom (<ref>) and (<ref>), we can derive an explicit coordinate transformation between the Schwarz-Christoffel (x,y) coordinates and the polar-Weyl (ρ,ξ) coordinates:\n\n\n    ρ   =√(y^2(2-y^2)+x^2(2-x^2)(1-y^2)^2)/√((1-y^2)^2+k^2x^2(2-x^2)y^2(2-y^2)) ,\n    ξ   =√(1-(1-x^2)y√(2-y^2)(1-y^2)√(1-k^2x^2(2-x^2))/√(y^2(2-y^2)+x^2(2-x^2)(1-y^2)^2)√((1-y^2)^2+k^2x^2(2-x^2)y^2(2-y^2))) .\n\n\nLike the original Weyl coordinates, these polar-Weyl coordinates are not smooth along ξ=± 1.  This will not be an issue for us as we will only use these coordinates in our numerical construction for sufficiently large ρ, where the coordinates are smooth.\n\n\n\n\n§ DESIGNING THE REFERENCE METRIC FOR EINSTEIN-DETURCK\n\nOur strategy for designing a reference metric for the Einstein-DeTurck problem (described in the main text) is to attach a de Sitter horizon to the Israel-Khan solution.  De Sitter space in four dimensions is most commonly written in the form\n\n    s^2=-(1-R^2/ℓ^2)τ^2+ R^2/1-R^2/ℓ^2+r^2(θ^2+sin^2θϕ^2) ,\n\nwhere ℓ is the de Sitter length scale.  De Sitter can also be written in isotropic coordinates with the transformation\n\n    R/ℓ=λρ/1+λ^2ρ^2/4 ,    sinθ=1-ξ^2 ,    τ=ℓ  t ,\n\nwhich yields\n\n    s^2=ℓ^2/g_+^2{-g_-^2 t^2+λ^2[ρ^2+ρ^2(4ξ^2/2-ξ^2+(1-ξ^2)^2ϕ^2)]} ,\n\nwhere\n\n    g_±=1±λ^2ρ^2/4 .\n\nIn these coordinates, the de Sitter horizon has a constant temperature of 1/2π.  λ is a gauge parameter that merely scales the radial coordinate ρ.  There is an origin at ρ=0, the de Sitter horizon is located at ρ=2/λ, there is an axis of symmetry at ξ=±1 and a ℤ_2 symmetry at ξ=0.\n\nThis form of de Sitter is suggestively close to the Israel-Khan solution in polar-Weyl form (<ref>).  Aside from some factors of f and h (which approach unity at large ρ), the only differences are that de Sitter in isotropic coordinates has an overall conformal factor of 1/g_+^2 and a factor of g_-^2 in the t^2 term whose zero defines the de Sitter horizon.  We will make use of these similarities in our construction.\n\nNow to begin engineering a reference metric, we make some slight modifications to the Israel-Khan solution (<ref>) and (<ref>):\n\n    s^2_ref   =ℓ^2/g_+^2{-fg_-^2 F  t^2+λ^2/m^2 Δ_xy^2[w^2(4 x^2/(2-x^2)Δ_x+4 y^2/(2-y^2)Δ_y)+y^2(2-y^2)(1-y^2)^2Sϕ^2]}\n       =ℓ^2/g_+^2{-fg_-^2 F  t^2+λ^2h/f[ρ^2+ρ^2(4ξ^2/2-ξ^2+(1-ξ^2)^2/hSϕ^2)]} .\n\nHere,\n\n    S=1-α(1-y^2)^2 ,\n\nwhere α is a new parameter, F is a complicated function that we will describe later in (<ref>), and equality between the first and second lines of (<ref>) (here and in the remainder of this section) is understood to be through the coordinate transformation (<ref>).  We will use (x,y) coordinates in the region near the black holes and inner axis, and the (ρ,ξ) coordinates near the cosmological horizon.\n\nWe only made three changes to the Israel-Khan solution to arrive at the reference metric (<ref>). The first is the inclusion of a conformal factor 1/g_+^2 to facilitate the matching to de Sitter.  The second is a factor of S in the ϕ^2 term, which we will use to remove the conical singularity in the inner axis by adjusting the parameter α.  The conical singularity is removed when α takes the value \n\n    α =(1-k)^2 (k^2+6 k+1)/(k+1)^4 .\n\nThe last change is a factor of g_-^2 F in the t^2 term which introduces a cosmological horizon.\n\nWe have freedom to choose the function F, but the choice is a delicate matter.  For numerical purposes, we wish for F to be smooth in (x,y) or (ρ,ξ) coordinates, depending on where the coordinates are being used.  The DeTurck method also requires that F be chosen to preserve the regularity of both the cosmological horizon and of the black hole horizons <cit.>.  That is, F must be positive definite and satisfy\n\n    F|_x=±1=1/g_-^2|_x=± 1 ,     F|_ρ=2/λ=h/f^2|_ρ=2/λ ,\n\nwhere we have chosen equality in the above instead of proportionality in order to preserve the de Sitter and Israel-Khan temperatures.\n\nIn order to make it easier to find a solution in a Newton-Raphson algorithm (see e.g. <cit.>), we should also choose F to match physical expectations in certain limits.  Specifically, we expect that when the cosmological horizon is large compared to other length scales (i.e. λ≪1), the spacetime near the cosmological horizon should approach de Sitter and the spacetime closer to the origin should be approximately described by the Israel-Khan solution (when α=0).  The cosmological horizon is already accommodated by the fact that f and h approach unity for large ρ.  That is, by requiring (<ref>), we already have F≈1 near the cosmological horizon ρ≈2/λ when λ is small.\n\nAs for near the origin, we add the requirement that\n\n    F|_y=0=1/g_-^2|_y=0 ,\n\nwhich is consistent with (<ref>).  If we set α=0, then when λ and ρ are small, g_±≈ 1, and the metric approaches that of the Israel-Khan solution as desired.\n\nAll of these requirements can be satisfied by choosing F to take the form\n\n    F=G/f+g_-^2G-fg_-^2G ,    with    G=ĥf̂(1-x^2)y^2(2-y^2)+g_-^2/(1-x^2)y^2(2-y^2)+g_-^4 ,\n\nwhere f̂ and ĥ are any smooth, positive definite functions that agree with f and h, respectively at ρ=2/λ.  To choose f̂ and ĥ, we first take the expressions for f and h as written in (<ref>) and (<ref>), and treat them as functions f(ρ,z) and h(ρ,z). We then set f̂(ρ,ξ)=f(2/λ,ρξ√(2-ξ^2)) and similarly for ĝ.  Note that we cannot use a choice like f̂(ρ,ξ)=f(2λ,2λξ√(2-ξ^2)) as it is not smooth in the (x,y) coordinates at x=0,y=1.\n\nThe entire Einstein-DeTurck reference metric is parametrized by k, λ, and α.  On the desired solution that is free of conical singularities, α is fixed according to (<ref>).  Because the de Sitter horizon temperature is held fixed, the only remaining physical parameter is the black hole horizon temperature, which is given by (<ref>).  Any k and λ that give the same black hole temperature are physically equivalent.  To collect all our numerical data, we have fixed λ=1/10 and used k to parametrize our solutions.  We have tried different values of λ, but after trial and error, this value generated the best numerical results.\n\n\n\n\n§ PATCHING AND NUMERICAL METHODS\n\nIn this section we explain how we partition the domain of integration using patching techniques (see e.g. <cit.>). As mentioned in the main text, the solution we seek contains five boundaries: the inner axis (∂_ϕ^ in), the black hole horizon (ℋ^+), the outer axis (∂_ϕ^ out), the cosmological horizon (ℋ^c) and the plane of ℤ_2 symmetry.\n\nWe numerically solve the Einstein-DeTurck equations with the boundary conditions of regularity at each of our five boundaries.  To do so, we use both the coordinates (ρ,ξ) and (x,y) of the preceding section. Near the black hole event horizon we use (x,y) coordinates, while near the cosmological horizon we use (ρ,ξ) coordinates. We used a total of three patches - I, II and III - with each of these having four boundaries: see FIG. <ref>. Patches I and II are defined in (x,y) coordinates, and patch III in (ρ,ξ) coordinates. The patching boundary between the patch I and II (dashed line in FIG. <ref>) is given by x=x_0 y√(2-y^2), with y∈(0,1). The patching boundary between patch II and patch III is simply given by ρ=ρ_0.\n\n\nFurthermore, we fix ρ_0 and x_0 through\n\n    ρ_0=2/3(2/λ-1/k)+1/k  and   x_0=1/2(1-√(1-√(1-1/k^2 ρ _0^2)))+√(1-√(1-1/k^2 ρ _0^2)) ,\n\nso that the only free parameters are k,λ, and α. Note that for non-singular solutions we require α to be given by (<ref>) and, as described in the end of the previous section, we fix λ=1/10 for numerical convenience.  We now apply the numerical methods detailed in <cit.>, and discretize each of our patches on a N× N Chebyshev-Gauss-Lobatto grid using transfinite interpolation and pseudospectral collocation, for a total grid size of (N+N+N)× N.  The discretized Newton-Raphson equation reduces to an iteration of linear matrix problems, which we solve by LU decomposition. To find the first solution (which is always the trickiest step of the Newton-Raphson method), we have set λ = 1/10, k=1/2 and used a Newton-Raphson algorithm with a judiciously chosen damping factor.  Additionally, we used what we call the “δ-trick\" as explained in section VII.A of <cit.>.\n\n\n\n§ CONVERGENCE TESTS\n\nIn this section, we show that the norm χ≡ξ^a ξ_a of the DeTurck vector vanishes in the continuum limit, as expected for a solution of the Einstein-DeTurck equation that is not a Ricci soliton (i.e. that is instead a true solution to the Einstein equation). Additionally, we find  exponential convergence, which is consistent with the use of pseudospectral collocation methods.\n\nLet χ^(N) be χ computed on a (3-patched) grid with (N+N+N)× N spectral collocation points. For concreteness we take k=1/2, λ=1/10 and α as given in (<ref>). In FIG. <ref> we show ‖χ^(N)‖_∞ as a function of N in a log-plot. The solid black line shows the best χ^2-fit to a straight line in the log-plot, and yields\n\n    f(N)=27.89409 - 0.79076 N .\n\nThe exponential trend is clear and confirms that the Einstein-DeTurck solution is converging to a true solution of the Einstein equation (and not to a Ricci soliton).\n\n"}