{"entry_id": "http://arxiv.org/abs/2303.07039v1", "published": "20230313120122", "title": "Time-Optimal Path Tracking for Cooperative Manipulators: A Convex Optimization Approach", "authors": ["Hamed Haghshenas", "Anders Hansson", "Mikael Norrlöf"], "primary_category": "cs.RO", "categories": ["cs.RO", "cs.SY", "eess.SY"], "text": "\n\n\n\t\n\n[t1]This work was supported in part by the Swedish Department of Education within the strategic research environment ELLIIT and in part by the Vinnova Competence Center LINK-SIC at Linköping University.\n\nfn1]Hamed Haghshenascor1\nhamed.haghshenas@liu.se\n\nfn1]Anders Hansson\nanders.g.hansson@liu.se\n\nfn2]Mikael Norrlöf\nmikael.norrlof@se.abb.com\n\n[cor1]Corresponding author\n\n[fn1]Hamed Haghshenas and Anders Hansson are with the Division of Automatic Control, Department of Electrical Engineering, Linköping University, 581-83 Linköping, Sweden.\n[fn2]Mikael Norrlöf is with ABB Robotics Division, 721-36 Västerås, Sweden.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis paper studies the time-optimal path tracking problem for a team of cooperating robotic manipulators carrying an object. \n\n\nConsidering the problem for rigidly grasped objects, we show that it can be cast as a convex optimization problem and solved efficiently with a guarantee of optimality.\n\n\n\nWhen formulating the problem, we avoid using a particular wrench distribution and exploit the full actuation available to the system.\n\n\nThen, we consider the problem for grasps using frictional forces and show that this problem also, under a force-closure grasp assumption, can be formulated as a convex optimization problem and solved efficiently and to optimality. To ensure a firm grasp, internal forces have been taken into account in this approach. \n\n\n\n\n\nPath tracking, time-optimal, cooperative manipulation, convex optimization, contact with friction.\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nRobotic systems are nowadays the key technology in a wide range of application domains, from construction, manufacturing and agriculture to search and rescue, and service robotics. The increasing demand for performance of robotic systems is often met by using multiple robots for a specific task. A team of cooperating robots outperforms the functionality of a single robot; like a human using two arms has an advantage over one using only one arm. \nWhen a task conducted by multiple robots involves manipulation of an object, the multi-robot system is said to perform a cooperative manipulation task.\nCooperative manipulation is an important capability for extending the domain of robotic applications. Typical examples include industrial manipulators manipulating large or heavy objects as well as transportation tasks conducted by multiple robots. \nOne particular subject that most applications have in common is path tracking. Path tracking is the second stage of the so-called decoupled approach <cit.>; an approach for solving motion planning problems. The first stage of the decoupled approach, known as path planning, determines a path while taking geometric aspects of the task and the environment into account, whereas the path tracking stage is concerned with the dynamic aspects of the robot and the task. In many robotic applications, the path is determined by the task and its specifications. Hence, assuming that a desired geometric path is given, the path tracking problem can be studied independently and is of value on its own.\n\nFor a wide range of robotic applications, it is desired to minimize the execution time of a task or some other criteria such as the energy consumed during the motion.\nFor example, robotic manipulators performing a variety of tasks are included in almost every production line, and there is an obvious relation between the execution time of the tasks and productivity.\nHence, time-optimal and in general optimal motion planning is of great significance for robotic systems. By optimizing the robots' motions while taking their dynamics into account, robots can fully exploit their capabilities.\n\nMotivated by these observations, this paper studies the time-optimal path tracking problem for a team of cooperating robotic manipulators. \nWe consider a scenario where an object is grasped by multiple manipulators.\nTime-optimal cooperative path tracking addresses the problem of moving the object along a predefined geometric path in minimum time, which requires realizing a velocity as high as possible along the path while satisfying the imposed constraints on the motion.\nNote that solving this problem gives the nominal trajectories. For online path tracking, the nominal, feedforward trajectories are combined with feedback in a control architecture such that robustness to uncertainties in model or environment is achieved (see e.g., <cit.>). Combining the feedforward trajectories with a feedback is beyond the scope of this work and our focus is on solving the time-optimal path tracking problem. \nMost of the works on the area of time-optimal path tracking are focused on a single manipulator. Contrary to the case of a single manipulator, a given time parameterization of the path in the case of cooperative manipulators may correspond to infinitely many possible torque profiles. One possible way to deal with this redundancy is to consider a predefined load distribution. It is however clear that this would give rise to slower trajectories than what can be obtained using the full actuation available to the system. Our goal in this paper is to extend the time-optimal path tracking to the case of cooperative manipulators so that it can optimally handle the actuation redundancy. \n\nThere are different methods for solving the time-optimal path tracking problem, most of which exploit the fact that the motion along a predetermined path can be described by a single parameter, called path coordinate and denoted by s, and its time derivatives <cit.>. \nThese approaches can basically be divided into three groups: numerical integration, dynamic programming, and convex optimization. \n\nThe numerical integration approach <cit.> is based on the Pontryagin maximum principle: the time-optimal velocity profile in the (s,ṡ) plane is known to be bang–bang and can be obtained by integrating successively the maximum and minimum accelerations s̈. \nThis requires finding the switch points between accelerating and decelerating segments, which constitutes a major implementation difficulty as well as the main cause of failure <cit.>. \n\nThis is because of the robustness issues associated with the so-called dynamic singularities which occur when the maximum velocity curve is nondifferentiable (see <cit.>).\nFurthermore, finding the switch points and computing the maximum velocity curve become computationally expensive for complex constraints with many inequalities <cit.>.\nThis approach is theoretically faster than the other two approaches, since it exploits the bang-bang structure of the problem. \n\nA limitation of this approach is that it is restricted to the time-optimal case.\n\n\nAn algorithm for handling of dynamic singularities for robots subject to joint velocity and acceleration constraints is presented in <cit.>. In <cit.>, a more general approach that can account for dynamic singularities resulting from second-order constraints together with an open-source implementation of the algorithm in C/Python is presented. In <cit.>, a complete and time-optimal algorithm based on numerical integration is proposed.\nIn <cit.>, an algorithm that solely treats jerk limits is proposed. \nThe numerical integration approach is extended to the case of redundantly actuated systems in <cit.>. \n\n\n\nAn object manipulated by several manipulators can be considered as a redundantly actuated system.\nIn their approach, they use the equations of motion of an open-chain system obtained by cutting the closed-chain system at some joints. This requires obtaining the dynamics of the open-chain system where the chain is cut. If the dynamic models of the manipulators are already available, obtaining the dynamics of another open-chain system can be an extra task. \n\nAlso, to compute the optimal accelerations at the singular points, one cannot use the analytical value suggested in <cit.> and has to search numerically for an approximate optimal acceleration. Furthermore, after obtaining the optimal parameterization, to obtain the torques at each actuated joint another optimization problem must be solved whose objective is specified by the user. \n\nThus, the approach proposed in <cit.> does not use the full actuation available to the system.\nCompared to that work, our approach exploits the full actuation available to the manipulators. Also, it is straightforward to impose constraints on the wrenches acting on the object in our approach, whereas in <cit.> it is not clear how to do this.\nTime-optimal path tracking for cooperative multi-manipulator systems was independently studied in <cit.> and <cit.> based on numerical integration, where linear programming was used to find the maximum acceleration and deceleration at a given point in the (s,ṡ) plane. However, since the algebraic form of extreme accelerations is not available from linear programming, they are not able to develop a systematic search scheme to find the switching points, and their proposed procedures give an approximation to the time-optimal trajectory.\n\n\n\n\nIn the dynamic programming approach, the problem is solved by dividing the (s,ṡ) plane into a grid and subsequently using dynamic programming (see <cit.>). One advantage of this method is the ability to account for a general form of the objective functions and constraints. \n\nThe main disadvantage of this approach is the high computational cost due to the need for solving a problem with a large number of variables.\nIn <cit.>, an algorithm which is capable of taking limits on joint jerks and torque rates into account is presented. Additionally, viscous friction is included in the dynamic model of the manipulator, which has been made possible by utilizing the idea of dynamic programming.\n\n\n\n\nThe convex optimization approach converts the original problem, which turns out to be an infinite-dimensional optimization problem, into a finite-dimensional one through discretization of the s-axis.\nOne of the early works using this approach is <cit.>, where it is shown that by exploiting a nonlinear change of variables, the time-optimal path tracking problem can be cast as a convex optimization problem and subsequently as a second-order cone program (SOCP). This allows for efficiently solving the problem by utilizing the wide variety of algorithms and software developed for convex optimization <cit.>. Furthermore, the convexity of the problem guarantees that any locally optimal solution is also a globally optimal one. \nThis approach has also the advantage that other objective functions such as energy or torque rate, can be incorporated.\nIt must be noted that the change of variables used in <cit.> has been known since at least 1985 (see e.g., <cit.>), although the resulting convexity of the problem was not noted back then.\nThe main disadvantage of the convex optimization approach is computational cost, which can be an order of magnitude greater than numerical integration-based approaches.\nTo reduce computational cost, <cit.> proposes an approach based on sequential linear programming. Further, <cit.> shows that using a special discretization scheme, the time-optimal velocity profile can be obtained by linear programming with the benefit of lower computation cost with respect to convex solvers.\n\nBecause of the advantages that the convex formulation offers, much work has been conducted to extend the range of applicability of these ideas to other problems such as path tracking for different types of vehicles as in <cit.>, or to include new types of constraints in the robot path tracking problem <cit.>. Similarly as in <cit.>, viscous friction which renders the problem nonconvex is not considered in the robot model in <cit.>. In this context, some works such as <cit.> and <cit.> have addressed the incorporation of the constraints that destroy the convexity of the problem. The work <cit.> incorporates speed dependent constraints into the problem and replaces the nonconvex constraints with their convex approximations to preserve the convexity of the problem, whereas the work <cit.> considers several robotic applications that result in nonconvex problems and employs sequential convex programming to solve the corresponding problem by writing the nonconvex constraints as differences of convex functions.  \nIn <cit.>, change rate of torque and voltage of the DC motor are incorporated. By introducing some new variables which are tight approximation of change rate of torque and motor voltage, the original nonconvex problem is formulated as an approximate convex optimization problem.\nThe work by <cit.> formulates the time-optimal path tracking problem for a dual-robot system as a nonconvex problem and solves an approximate problem using sequential convex programming.\nThe change of variables introduced in <cit.> is also used in other studies. In <cit.>, a two-step iterative learning algorithm for path tracking problem of a robotic manipulator is proposed which compensates for a possible model-plant mismatch and improves the tracking performance. \n\n\n\nFrom the mentioned approaches for solving the time-optimal path tracking problem, only the numerical integration approach has been applied to cooperative manipulators. As mentioned earlier, the works that use this method for cooperative manipulators either do not use the full actuation available to the system <cit.> or are not able to develop a systematic search for finding the switch points <cit.>. Additionally, this approach suffers from robustness issues associated with the dynamic singularities and is limited to the time-optimal case. Because of the advantages that the convex optimization approach offers, in this paper we use this method to solve the time-optimal path tracking problem for a team of cooperating manipulators. With the availability and maturity of SOCP solvers, this approach reliably and robustly solve the problem of interest. With this approach, it is also possible to incorporate objective functions other than time into the problem.\nFirst, we consider a scenario where an object is rigidly grasped by multiple manipulators. The rigid grasping assumption implies that the manipulators can apply forces and moments along all directions to the object. By exploiting the mentioned change of variables we show that this problem can be formulated as a convex optimization problem and subsequently as an SOCP. \nDue to multiple manipulators being involved in the manipulation task, there exists an infinite number of forces/moments exerted by the end-effectors that result in the same desired force/moment on the centre of mass of the object. \n\nThis redundancy is fully exploited in our formulation. Others (e.g., <cit.>) use specific force/moment distributions, also called wrench distribution, which result in suboptimal solutions.\n\n\n\n\n\n\nWe then relax the assumption on the rigid grasping and consider contacts with friction. \nThese types of contacts complicate the problem as each contact may only apply forces/moments that respect friction cone constraints to prevent slip, instead of arbitrary forces/moments associated with rigid contacts. \nWe show that this problem also, under a force-closure grasp assumption, can be formulated as a convex optimization problem.\n\n\nIn summary, the following are the contributions of this paper:\n\n\t\n  * The time-optimal path tracking problem for a team of cooperative manipulators rigidly grasping an object is formulated as a convex optimization problem.\n\t\n  * The results from the first contribution are extended to consider contacts with friction.\n\n    \n  * Our approach optimally handles the actuation redundancy and uses the full actuation available to the system.\n\n\nIn <cit.>, we have presented a preliminary study of the time-optimal path tracking problem for a particular setup comprised of two two-link planar manipulators with non-actuated end-effectors rigidly grasping a bar. Compared to that work where only two manipulators are involved and the object is a bar grasped at the two end points, in this paper we consider a general scenario with N generic manipulators and a generic object. Furthermore, a particular wrench distribution was assumed in <cit.>, whereas here we avoid using any wrench distribution. \n\n\n\n\nThe rest of this paper is organized as follows.\nSection <ref> presents some known results on time-optimal path tracking problem for a single manipulator.\nSection <ref> states the problem of interest. Section <ref> presents the modeling of the coupled kinematics and the dynamics of the manipulators and the object. Section <ref> studies the time-optimal cooperative path tracking problem with rigid contacts.\nSection <ref> extends the results in Section <ref> to consider contacts with friction.\nSection <ref> contains some simulation results.\nSection <ref> summarizes our findings and presents ideas for future work.\n\n\n\n\n\n\n\n§ PRELIMINARIES\n\n\n\nHere, we collect some known results about the time-optimal path tracking problem for a single manipulator that will be used in the rest of the paper. \n\n\n\n\n\n\n\n\nManipulator motion along a prescribed trajectory can be written as a function of a single parameter, s, either in task space <cit.> or in joint space <cit.>.\nGiven a prescribed geometric path q(s) in joint space, the joint velocities and accelerations can, using the chain rule, be written as\n\n\t\n    q̇(s)    = q'(s) ṡ, \n    q̈(s)    = q'(s) s̈ + q”(s) ṡ^2,\n\n\nwhere q'(s) = ∂ q(s)/∂ s, q”(s) = ∂^2q(s)/∂ s^2, ṡ = ds/dt and s̈ = d^2s/dt^2. It is shown in <cit.> that the time-optimal path tracking problem for a single robotic manipulator subject to lower and upper bounds on the torques, can be cast as the convex optimization problem\n\\beginmini![2]\n\t\n\t∫_0^11/√(b(s))ds\n\t\n\t\n\tτ(s)=m(s)a(s)+c(s)b(s)+g(s), \n\tb(0)=ṡ_0^2,\n\tb(1)=ṡ_T^2,\n\tb(s)≥0,\n\tb'(s)=2a(s),\n\tτ(s) ≤τ(s) ≤τ(s),\n\t∀s ∈[0,1],\n\\endmini!\nwhere the optimization variables in addition to joint torques, τ(s), are the acceleration and square of the speed along the path coordinate, i.e.,\n\n\t\n    a(s)    = s̈(t), \n    \n    \t\tb(s)    = ṡ(t)^2.\n \n\nThe key behind this result is to use the acceleration as a free variable, which can be accomplished by representing the joint velocities and accelerations as (<ref>), and substituting them in the equations of motion. \nThe constraint in (<ref>) shows the equations of motion of a single manipulator after this substitution and using (<ref>) as optimization variables. The change of integration variable from time t to s allows to write the objective function, i.e. the duration of the motion, as (<ref>).\n\nIn the above optimization problem, τ and τ are the lower and upper bounds on the joint torques, respectively, and can be functions of s, and ṡ_0 and ṡ_T are, respectively, the initial and final velocities along the path, usually chosen to be 0. In this problem, the inequalities are interpreted as component-wise inequalities.\nThe optimization problem in (<ref>) is convex since the objective function is convex in b(s), which follows from the fact that integration preserves convexity and that 1/√(b(s)) is convex in b(s), and since all the constraints are linear in the optimization variables. \nExtensions of the problem to incorporate other objective functions and constraints that preserve convexity can be found in <cit.>. In particular, it is shown that symmetric lower and upper bounds on the joint velocities can be translated into upper bounds on b(s). We denote this upper bound by b(s), and the corresponding constraint will be incorporated into the forthcoming optimization problems.\n\nThe convex optimization problem in (<ref>) is an infinite dimensional problem with infinitely many optimization variables and constraints. \nTherefore, the direct transcription method is employed and the problem in (<ref>) is formulated as a large sparse optimization problem in <cit.>. The resulting problem is finally transformed into an SOCP, which can be solved efficiently using dedicated solvers, such as MOSEK <cit.>. The reader is referred to <cit.> for more details. \n\n\n\n\n\n\n\n§ PROBLEM STATEMENT\n\nThis section addresses the problem of time-optimal path tracking for multiple cooperative manipulators rigidly grasping an object.\nConsider N fully actuated robotic manipulators, indexed by the set 𝒩 = {1, …, N}, rigidly grasping an object as in  <ref>. The rigidity assumption implies that the manipulators can exert forces and moments along all directions of the object. The objective is to minimize the traversal time required to move the object with a desired orientation along a prescribed geometric path subject to constraints on the joint torques and velocities. We assume that the prescribed geometric path is given for the centre of mass of the object, and that both the path and the object's orientation are given as functions of a scalar path coordinate s. \n\n\nWithout loss of generality, assume that the trajectory starts at t=0, ends at t=T, and that s(0)=0 ≤ s(t) ≤ s(T)=1. Furthermore, it is assumed that ṡ(t) ≥ 0, ∀ t ∈ [0,T]. In other words, we always move forward along the path. \n\n\n\n\nThroughout the paper, all quantities are expressed with respect to an inertial frame of reference {I} whenever the reference frame is not explicitly indicated by a superscript. \nLet {O} and {E_i} denote the reference frames attached to the object at the centre of mass and the ith end-effector, respectively.\nLet ϕ_ O(s) = [φ_ O(s), ϑ_ O(s), ψ_ O(s)]^T be the object's orientation in terms of a triplet of Euler angles. \n\n\n\n\n\n\nIn the following section, we present the modeling of the coupled kinematics and the dynamics of the manipulators and the object.\n\n\n\n\n\n\n\n\n\n\n§ KINEMATIC AND DYNAMIC MODELS\n\n\n\n §.§ Kinematics\n\nLet p_ O∈ℝ^3 be the position of the object's centre of mass. Let p_i ∈ℝ^3 and ϕ_i be the position and orientation of the ith end-effector, respectively. In view of  <ref>, one can see that the pose of the ith end-effector and the object's centre of mass are related by \n\n\t\n\t\n    p_i(s)    = p_ O(s) + p_i  O(s) = p_ O(s) + R_ E_i(s) p_i  O^ E_i, \n    ϕ_i(s)    = ϕ_ O(s) + ϕ_i  O,\n\n\nwhere p_i  O^ E_i and ϕ_i  O are the constant distance and orientation offsets between the reference frames {O} and {E_i}, respectively, and are considered to be known.\nThe 3× 3 matrix R_ E_i denotes the rotation matrix of the reference frame {E_i} with respect to {I}. \n\n\n\n\n\n\n\n\n §.§ Manipulator Dynamics\n\nThe equations of motion for the ith manipulator with n_i DOF and the joint variables q_i∈ℝ^n_i can be described by <cit.>\n\n    M_i(q_i)q̈_i+C_i(q_i,q̇_i)q̇_i+g_i(q_i)=τ_i - J_i(q_i)^T h_i,\n \nwhere τ_i∈ℝ^n_i are the joint torques, M_i(q_i) ∈ℝ^n_i × n_i is the positive definite inertia matrix, C_i(q_i,q̇_i) q̇_i∈ℝ^n_i × 1 is the vector of Coriolis and centrifugal forces, g_i(q_i) ∈ℝ^n_i is the vector of gravitational terms, J_i∈ℝ^6 × n_i is the ith manipulator's geometric Jacobian, and h_i∈ℝ^6 is the vector of generalized forces exerted by the ith end-effector on the object.\nA vector of generalized forces acting on a rigid body consists of a linear component (pure force) and an angular component (pure moment). We will refer to a force/moment pair as a wrench.\nIn (<ref>), the torques J_i^T(q_i) h_i are a portion of the actuation torques that is needed to balance the torques induced at the joints by the contact forces.\n\n\n\n\n\n\n\n\n\n §.§ Object Dynamics\n\nRegarding the object, the pose and the velocity of its centre of mass are denoted by x_ O = [p_ O^T, ϕ_ O^T]^T and v_ O = [ṗ_ O^T, ω_ O^T]^T, respectively, where ω_ O∈ℝ^3 is the object's angular velocity.\nThe following second-order dynamics, which is based on the Newton-Euler formulation can be considered for the object:\n\n    M_ O(x_ O)v̇_ O + C_ O(x_ O,ẋ_ O)v_ O + g_ O = h_ O,\n\nwhere \n\n\t\n    M_ O   = [   m I_3 0_3 × 3; 0_3 × 3    I_ O ], \n    \n    \t\tC_ O   = [      0_3 × 3      0_3 × 3;      0_3 × 3 S(ω_ O) I_ O ], \n    \n    \t\tg_ O   = [ - m g;   0_3 ],\n\n\nand where m is the mass of the object, g ∈ℝ^3 is the gravitational acceleration vector, I_ O∈ℝ^3 × 3 is the object's inertia tensor relative to the centre of mass when expressed in a frame parallel to {I} with origin at the centre of mass, and h_ O∈ℝ^6 is the wrench acting on the object's centre of mass. Here, S(·) is the skew-symmetric matrix operator performing the cross product, i.e., S(u)w = u × w for u,w ∈ℝ^3.\n\n\n\n\t\n\t\n\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n§ TIME-OPTIMAL COOPERATIVE PATH TACKING WITH RIGID CONTACTS\n\nIn this section, we show that the time-optimal path tracking problem for cooperative manipulators rigidly grasping an object can be cast as a convex optimization problem. \nThe first step is to rewrite the manipulator dynamics in terms of s̈, ṡ^2 and s.\n\nGiven p_ O(s) and ϕ_ O(s), the pose of each end-effector can be computed by (<ref>). Then, inverse kinematics can be employed to compute the corresponding joint variables as functions of the path coordinate s. Using the chain rule, the joint velocities and accelerations of the ith manipulator can be written as\n\n\t\n    q̇_i(s)    = q'_i(s) ṡ, \n    q̈_i(s)    = q'_i(s) s̈ + q”_i(s) ṡ^2,\n\n\nwhere q'_i(s) = ∂ q_i(s)/∂ s and q”_i(s) = ∂^2q_i(s)/∂ s^2. Substituting these expressions in (<ref>) yields the following expression for the equations of motion:\n\n    τ_i(s) = m_i(s) s̈ + c_i(s) ṡ^2 + g_i(s) + J_i(s)^T h_i(s),\n\nwhere\n\n\t\n    m_i(s)    = M_i(q_i(s)) q'_i(s), \n    \n    \t\tc_i(s)    = M_i(q_i(s)) q”_i(s) + C_i(q_i(s),q'_i(s)) q'_i(s),\n\n\nfor each i ∈𝒩.\n\nThe second step is to show that the object dynamics in (<ref>), similar to Equation <ref> can be written as a function of s̈, ṡ^2 and s. This allows us to use s̈ and ṡ^2 as optimization variables later. To this end, we start by writing the first- and the second-order time derivatives of the pose of the object's centre of mass as\n\n\t\n    ẋ_ O(s)    = x_ O'(s) ṡ, \n    ẍ_ O(s)    = x_ O'(s) s̈ + x_ O”(s) ṡ^2,\n \n\nrespectively, where x_ O'(s) = ∂ x_ O(s)/∂ s and x_ O”(s) = ∂^2x_ O(s)/∂ s^2.\nNext, we find the relationship between the velocity and the time derivative of the pose of the object's centre of mass. For this, we know that it is possible to find the relationship between the object's angular velocity ω_ O and its rotational velocity ϕ̇_ O for a given set of orientation angles <cit.>. Let T(ϕ_ O) be the transformation between these two velocities, i.e., ω_ O = T(ϕ_ O) ϕ̇_ O. Using this equation, the velocity of the object's centre of mass can be written as \n\n    v_ O(s) = T_ O(s) ẋ_ O(s),\n\nwhere\n\n    T_ O(s) = [        I_3    0_3 × 3;    0_3 × 3 T(ϕ_ O(s)) ].\n\nSubstituting (<ref>) into (<ref>) and its derivative, yields the following expressions for v_ O and v̇_ O, respectively:\n\n\t\n    v_ O(s)    = T_ O(s) x_ O'(s) ṡ, \n    v̇_ O(s)    = (∂ T_ O(s)/∂ s x_ O'(s)+T_ O(s) x_ O”(s))ṡ^2 \n          + T_ O(s) x_ O'(s) s̈.\n \n\nFinally, substituting (<ref>) and (<ref>) into (<ref>), an expression for the object dynamics can be obtained as follows:\n\n    m_ O(s)s̈ + c_ O(s)ṡ^2 + g_ O = h_ O(s),\n\nwhere \n\n\t\n    m_ O(s)    = M_ O(x_ O(s)) T_ O(s) x_ O'(s), \n    \n    \t\tc_ O(s)    = M_ O(x_ O(s)) ∂ T_ O(s)/∂ s x_ O'(s) \n          + M_ O(x_ O(s)) T_ O(s) x_ O”(s) \n          +  C_ O(x_ O(s),x_ O'(s)) T_ O(s) x_ O'(s).\n\n\n\nThe final step concerns the relationship between the wrench h_ O acting on the object's centre of mass and the wrenches h_i, i ∈𝒩 exerted by the end-effectors to the object at the grasping points. \nLet v_i = [ṗ_i^T, ω_i^T]^T be the velocity of the ith end-effector, where ω_i∈ℝ^3 is the angular velocity. Differentiation of (<ref>) together with the fact that ω_i = ω_ O due to the grasping rigidity, leads to \n\n    v_i(s) = J_ O_i(s) v_ O(s),   ∀ i ∈𝒩,\n\nwhere J_ O_i is called the object-to-agent Jacobian matrix, with\n\n    J_ O_i(s) = [           I_3 -S(p_i  O(s));       0_3 × 3           I_3 ],\n\n∀ i ∈𝒩, which is full-rank due to the grasp rigidity. The grasp matrix G ∈ℝ^6 × 6N is formed by stacking J_ O_i(s)^T, i ∈𝒩 as\n\n    G(s) = [J_ O_1(s)^T ⋯ J_ O_N(s)^T],\n\nand has full row rank. \nLet v(s) = [v_1(s)^T ⋯ v_N(s)^T]^T.\nEquation (<ref>) can now be written in the following form:\n\n    v(s) = G(s)^T v_ O(s).\n\nLet h = [h_1^T ⋯ h_N^T]^T. The kineto-statics duality <cit.> together with the grasp rigidity suggest that the wrenches h_ O and h_i, i ∈𝒩 are related by\n\n    h_ O(s)    = G(s) h(s)  \n       = ∑_i ∈𝒩^ G_i(s) h_i(s),\n\nwhere G_i is the ith block of the grasp matrix, i.e., G_i = J_ O_i^T.\n\nFinally, having the dynamic equations of the manipulators and the object written in terms of s̈, ṡ^2 and s, and having the relationship between the wrenches h_ O and h_i, i ∈𝒩, we are ready to present the convex formulation of the problem of interest.\nFrom the equations in (<ref>), (<ref>) and (<ref>) it can be seen that choosing a(s) = s̈ and b(s) = ṡ^2 together with h_ O(s) and h_i(s), τ_i(s), i ∈𝒩 as optimization variables, makes these equations, which enter as constraints in the optimization problem, linear in the optimization variables. \nThe objective function for our problem of interest is the same as (<ref>), which is convex in b(s). With the introduced optimization variables, the problem of interest can be cast as the following convex optimization problem:\n[2]\n\t\n\t∫_0^11/√(b(s))ds\n\t\n\tτ_i(s) = \n\t\tm_i(s)  a(s) + c_i(s) b(s) + g_i(s)        + J_i(s)^T h_i(s),  i ∈𝒩,\n\th_O(s) = m_O(s)a(s) + c_O(s)b(s) + g_O, \n\th_O(s) = ∑_i ∈𝒩^ G_i(s) h_i(s),\n\tb(0)=ṡ_0^2,   b(1)=ṡ_T^2,\n\top:general:convex\n\t\n\t0 ≤b(s) ≤b(s),\n\tb'(s)=2a(s),\n\tτ_i(s) ≤τ_i(s) ≤τ_i(s),  i ∈𝒩,\n\t∀s ∈[0,1],\n\nwith variables a, b, h_ O and τ_i, h_i, i ∈𝒩.\nIn (<ref>), τ_i and τ_i are the lower and upper bounds on the ith manipulator's joint torques, respectively. This problem can finally be reformulated as an SOCP using the direct transcription method and a procedure similar to the one used in <cit.>.\n\n\n\nNote that to consider all possible combinations of wrenches when finding the optimal solution, the relationship between the wrenches h_ O and h_i, i ∈𝒩 is intentionally kept as (<ref>), instead of solving (<ref>) for h_i, i ∈𝒩 and representing h_i, i ∈𝒩 based on a particular wrench distribution.\nFor a cooperative manipulation task, in general, there exists an infinite number of wrenches exerted by the end-effectors that result in the same desired wrench on the centre of mass of the object. This is due to multiple manipulators being involved in the manipulation task. \n\nWhen using a predefined wrench distribution, this redundancy is lost.\n\n\n\nOur approach uses the full actuation available to the system and optimally handles the actuation redundancy.\n\n\n\n\n\nCompared to a case where a particular wrench distribution is used, a smaller minimal traversal time is expected from our approach.\n\nA numerical comparison using some common wrench distributions is carried out and reported in Section <ref> which confirms this point.\n\n\n\n\n\n\n\n\n§ EXTENSION TO GRASPING WITH FRICTION\n\nIn this section we relax the assumption on the rigid grasping points. \nWe consider the problem stated in Section <ref>, but with a different type of grasp.\nIn particular, we assume that contacts between the manipulators and the object are of point contact with friction or soft-finger types.\nAlso, we assume a force-closure grasp, which will be defined later.\nFor grasps using frictional forces, a model for friction must be provided. For this purpose, we will use a simple model which is referred to as the Coulomb friction model. This model is an empirical model which states that the allowed force in the tangential directions to a surface is proportional to the applied force at the normal direction. The constant of proportionality which is referred to as the coefficient of friction, is determined by the materials that are in contact.\nA point contact with friction model is used when friction exists between the manipulator tip and the object, in which case forces can be exerted in\nany direction that is within the friction cone for the contact.\nFor a soft-finger contact, not only forces are allowed to be applied in a cone about the surface normal, but also torques about that normal <cit.>.\nThese types of contacts complicate the problem since each contact may only apply a wrench that respects friction cone constraints to prevent slip, instead of an arbitrary wrench associated with rigid contacts. \n\n\n\n\n\n\nWe start by describing the grasp.\nThe ith contact can be modeled using a wrench basis, B_ C_i∈ℝ^6× m_i, \nand a friction cone, FC_ C_i <cit.>. \nThe dimension of the wrench basis, m_i, indicates the\nnumber of independent forces/moments that can be applied by the contact.\nLet us consider the planar grasp shown in  <ref>, with point contacts with friction.\nFor convenience, the contact coordinate frame 𝒞_i, is chosen in such a way that its x-axis points in the direction of the inward surface normal at the point of contact. \nLet h_ C_i be the wrench applied at the ith contact point.\nWe represent this wrench with respect to a basis of directions which are consistent with the friction model:\n\n\n\n\n\n\n\n\n\n\n\n    h_ C_i   = B_ C_i f_ C_i\n       = [ 1 0 0 0 0 0; 0 1 0 0 0 0;   ]^T f_ C_i,    f_ C_i∈ FC_ C_i,\n\nwhere the friction cone for the ith contact is\n\n    FC_ C_i = { f= [ f_x  f_y  ]^T ∈ℝ^2 : | f_y | ≤μ f_x, f_x ≥ 0 },\n\nIn (<ref>), f_x and f_y are the normal and tangential force components, respectively, and μ > 0 is the coefficient of friction.\n\n\n\nFor a soft-finger contact with a coordinate frame where its x-axis points in the direction of the inward surface normal, the wrench basis and the friction cone are as follows:\n\n\t\n    B_ C_i = [ 1 0 0 0 0 0; 0 1 0 0 0 0; 0 0 1 0 0 0; 0 0 0 1 0 0;   ]^T, \n       FC_ C_i = \n         { f ∈ℝ^4 : √(f_y^2+f_z^2)≤μ f_x, f_x ≥ 0, | t_x | ≤γ f_x },\n\n\nwhere f= [ f_x , f_y , f_z , t_x  ]^T, and where γ > 0 is the coefficient of torsional friction.\n\nThe contact map, G̅_i ∈ℝ^6× m_i, is defined to be the linear map between the ith contact wrench represented with respect to B_ C_i, \n\nand the object wrench at the centre of mass:\n\n    G̅_i = G_i B_ C_i.\n\nWith this definition, the object wrench can be written as \n\n    h_ O = G̅ f_ C,     f_ C∈ FC,\n\nwhere \n\n    G̅ = [ G_1 B_ C_1⋯   G_N B_ C_N;                          ],\n\nis called grasp map, and where\n\n    f_ C   = [ f_ C_1^T  ⋯   f_ C_N^T;                        ]^T ∈ℝ^m, \n    \n    \tFC    = FC_ C_1×⋯× FC_ C_N⊂ℝ^m, \n    \n    \tm    = m_1 + ⋯ + m_N.\n\nThe full friction cone, FC, is the Cartesian product of all the friction cones.\nA grasp is completely described by the grasp map G̅ and the friction cone FC.\n\nWrenches in the null space of G̅ correspond to those wrenches that can be exerted at the contact points without resulting in a net wrench on the object. These are referred to as internal forces.\nFor collaborative manipulation with the mentioned types of contacts, it is critical to ensure that the object does not slip. To ensure this, each contact wrench must remain in the respective friction cone.\nInternal forces can be used to insure that contact wrenches satisfy friction cone constraints. Any given vector of contact wrenches can be brought into the friction cone by adding a sufficiently large wrench in the null space of G̅, if the condition N(G̅) ∩int(FC) ≠∅, where N(·) denotes the null space of a matrix and int(FC) is the interior of the friction cone, is satisfied <cit.>.\n\nIn order to be able to firmly grasp an object, it is desirable that internal forces exist and lie in the interior of the friction cone.\n\n\nIt is also desirable that any given wrench on the object can be achieved by an appropriate choice of contact wrenches lying in the friction cone. The mathematical characterization of this ability is G̅(FC)=ℝ^6, i.e., the grasp map G̅ should map the friction cone FC onto ℝ^6. This ability is linked to the ability of a grasp to resist any applied wrench, which is called force-closure. A grasp is a force-closure grasp if given any external wrench h_e ∈ℝ^6 applied to the object, there exist contact wrenches f_ C∈ FC such that G̅ f_ C = - h_e. It follows directly from this definition that a grasp is force-closure if and only if G̅(FC)=ℝ^6 <cit.>.\n\nIt is also shown in <cit.> that the existence of an internal force belonging to the interior of the friction cone is a necessary condition for a grasp to be force-closure.\n\nIn order to have a grasp with the two desirable properties mentioned above, i.e., existence of an internal force which belongs to the interior of the friction cone and G̅(FC)=ℝ^6, we assume that the grasp in our problem is a force-closure grasp. Constructing force-closure grasps is not the focus of this paper and the reader is referred to the related work on this subject, see e.g., <cit.>. One particularly simple method for the case of two contact points is proposed in <cit.>. A planar grasp with two point contacts with friction is force-closure if and only if the line connecting the contact points lies inside both friction cones. This result can be extended to the case of a spatial grasp with two soft-finger contacts.\n\nNow, we are ready to present the optimization problem associated with the problem of interest in this section. \n\nIn order to ensure that slipping does not occur, the friction cone constraints will enter as constraints in the optimization problem, and it can be seen from (<ref>) and (<ref>) that these constraints are convex. This follows from the fact that every norm on ℝ^n is convex <cit.>. In order to consider internal forces, we divide the wrench applied at the ith contact point into two parts: a motion-inducing part, denoted by h_ M_i, and a part associated with internal forces, denoted by h_ I_i. In other words, h_ C_i = h_ M_i + h_ I_i,  i ∈𝒩, where h_ I = [h_ I_1^T ⋯ h_ I_N^T]^T ∈ N(G). \nThe constraint on h_ I being in the null space of G can be written as ∑_i ∈𝒩^ G_i h_ I_i = 0.\nLet f_ M_i and f_ I_i be the contact wrenches corresponding to h_ M_i and h_ I_i, represented with respect to B_ C_i, respectively, i.e., h_ M_i = B_ C_i f_ M_i and h_ I_i = B_ C_i f_ I_i. As mentioned above, in order to have a firm grasp, it is desirable that the internal forces lie in the interior of the friction cone. The constraints f_ I_i∈int(FC_ C_i),  i ∈𝒩 will be added to the optimization problem for this purpose.\nNote that to prevent slip, f_ C_i = f_ M_i + f_ I_i must also respect the friction cone constraints.\nBy introducing h_ M_i, h_ I_i, f_ M_i and f_ I_i as additional optimization variables and with the discussed changes, the problem of interest in this section can be cast as the following convex optimization problem:\n[2]<b>\n\t\n\t∫_0^11/√(b(s))ds\n\t\n\tτ_i(s) = \n\t\tm_i(s)  a(s) + c_i(s) b(s) + g_i(s)        + J_i(s)^T (h_M_i(s) + h_I_i(s)),         i ∈𝒩, h_O(s) = m_O(s)a(s) + c_O(s)b(s) + g_O, \n\th_O(s) = ∑_i ∈𝒩^ G_i(s) (h_M_i(s) + h_I_i(s)),\n\t∑_i ∈𝒩^ G_i(s) h_I_i(s)= 0,\n\top:FC:convex\n\th_M_i = B_C_i f_M_i,   i ∈𝒩,\n\th_I_i = B_C_i f_I_i  i ∈𝒩,\n\t(f_M_i(s) + f_I_i(s)) ∈FC_C_i,   i ∈𝒩,\n\tf_I_i(s) ∈int(FC_C_i),   i ∈𝒩,\n\tb(0)=ṡ_0^2,   b(1)=ṡ_T^2,\n\n\n\t0 ≤b(s) ≤b(s),\n\tb'(s)=2a(s),\n\tτ_i(s) ≤τ_i(s) ≤τ_i(s),  i ∈𝒩,\n\t∀s ∈[0,1],\n\nwith variables a, b, h_ O and τ_i, h_ M_i, h_ I_i, f_ M_i, f_ I_i, i ∈𝒩.\nThis optimization problem is convex since the objective function and all the constraints are either linear or convex in the optimization variables. \nAgain, this problem can be reformulated as an SOCP after employing the direct transcription method.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ NUMERICAL SIMULATION\n\nIn this section, we provide some numerical simulations to illustrate the results. We start by presenting the simulation results for the case of rigid contacts.\n\n\n §.§ Rigid Contacts\n\nConsider the problem setup described in Section <ref> with two 6 DOF Stanford manipulators (see <cit.>,  2.25). Suppose the manipulators are located at [0  -1.4  0]^T and [0  1.4  0]^T in {I} and are placed in such a way that the rotation matrices of the base frames {B_i}, i=1,2, with respect to {I} are R_ B_1 = I_3 and R_ B_2= diag(-1,-1,1), where diag is the diagonal matrix with the vector elements as diagonal elements. Also, suppose that the manipulators are rigidly grasping a cuboid object of dimensions 0.07 × 0.07 × 0.4 m^3 and with mass 10 kg. We assume that the centre of mass of the object is located at its centroid.\nThe dynamic parameters used for the simulation are given in Tables <ref>-<ref>, where m_ij and l_ij denote the mass and the length of the jth link of the ith manipulator, respectively. \nWe assume that all links except the third one are cylindrical with radius of 0.12, 0.1, 0.06, 0.05, 0.05 (all in meter), respectively, and compute the inertia tensors accordingly. The third link is assumed to be a cuboid with equal length and width of size 0.12 m. \n\n\n\n\nThe desired path for the centre of mass of the object is given by\n\n    p_ O(s) = [ -0.3+1.2 s; sin(s-0.4);  0.4+0.6 s ].\n\nFor the orientation of the object, we have used \n\nZYZ angles\nϕ_ O(s) =[-0.5 s+0.2  0.5 sin(s)  -0.4]^T.\nWe assume that gravity acts along the negative z-axis.\n\n\n\n\n\n\n\nFor the simulation, the path coordinate s is discretized on 80 grid points.\nThe optimization problem is implemented and solved in SOCP form in MATLAB using the optimization modeling toolbox YALMIP <cit.>, and the solver MOSEK <cit.>. The simulation is performed on a laptop with a 2.6 GHz Intel Core i7-5600U processor.\n\nIn the approach presented in this paper we need to compute the partial derivatives q'_i(s) and q”_i(s) at the descretization points. Any method that can provide these partial derivatives can be used for this purpose. For a manipulator with 6 DOF, computing these derivatives analytically can be computationally expensive. In this simulation, we are using a numerical approach to compute q'_i(s) and q”_i(s) at the discretization points. \n\nThe approach presented in this paper results in a minimal traversal time of 0.422 sec for this simulation.\n <ref> shows the resulting joint torques or forces and the corresponding bounds for both manipulators as functions of the path coordinate s. The bounds are depicted in the same color as the joint torque or force, but with a dashed line. Once the optimization variables a and b are obtained, Equations (<ref>) and (<ref>) can be used to compute the joint velocities and accelerations, respectively.  <ref> shows the evolution of the joint velocities with respect to the path coordinate s for both manipulators, where the initial and the final velocities have been set to zero. The considered bounds on the joint velocities can be seen in the same figure and are depicted with dashed lines in the same color as each joint velocity.\n\n \n\nFrom the plots it can be seen that for every point along the path, either one of the joint torques/forces of the first or second manipulator is in saturation, or one of the joint velocities has reached its bound. \nThis is in line with the findings in the work by <cit.>, where it is shown that the minimum-time control for multiple manipulators requires that at least one of the actuators is always saturated on any finite time subinterval, while the rest of them adjust their torques so that other constraints on the motion are not violated.\n\nWe have also performed the simulation for different grid sizes to get an idea of computation time. Solver time and YALMIP time are reported in Table <ref> for grid sizes of K = 30, 100, 300, 1000. It can be seen that the increase in YALMIP time is greater than the increase in solver time.\n\n\n\nSince all possible combinations of wrenches are considered in our approach, a smaller minimal traversal time from our approach is expected compared to a case where a particular wrench distribution is used. For the purpose of comparison, we have carried out some simulations with the same setup described above but different path and orientation for the object and with wrench distributions borrowed from other works. The resulting minimal traversal times using the wrench distribution from <cit.>, <cit.> and <cit.>, denoted by Ref. 1, Ref. 2 and Ref. 3, respectively, together with the results for the rigid and the frictional (see next subsection) contacts are reported in Table <ref>. \nIn the simulations, the path coordinate s is discretized on 50 grid points.\nThe paths and the orientations that are used for this comparison can be seen in Tables <ref>-<ref>, where p_ O^x(s), p_ O^y(s) and p_ O^z(s) are the x, y and z components of the position of the object, respectively, and [φ_ O(s), ϑ_ O(s), ψ_ O(s)]^T is the object's orientation in terms of ZYZ Euler angles. \n\nThe considered bounds on joint torques and velocities are same as the ones in  <ref> and  <ref>. \n\n\nIn the tables, P.i refers to the ith path.\nAs expected, the obtained minimal traversal time using our approach in the case of rigid contacts is significantly smaller than other values where a particular wrench distributions is used. This is because our approach exploits the full actuation available to the system.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Contacts with Friction\n\nHere, we present the simulation results for the problem considered in Section <ref>. We consider the same simulation setup described in the previous subsection. \n\nThe considered grasp can be seen in  <ref>. We assume that\nthe contacts are soft-finger contacts and that the z-axes of the contact coordinate frames point in the direction of the inward surface normals.\n\nThe line connecting the two contact points lies inside the friction cones, and hence according to <cit.>, the grasp is force-closure. We have considered the coefficients of friction to be μ = 1 and λ = 1, where μ = 1 corresponds to a friction cone angle of 45°, i.e., the angle of the cone with respect to the surface normal. \nThe interior of the friction cone for the ith contact has been considered as \n\n    int   (FC_ C_i) = \n         { f ∈ℝ^4 : √(f_x^2+f_y^2)≤μ f_z - δ_1, f_z ≥ 0, | t_z | ≤γ f_z -δ_2 },\n\nwhere δ_1 and δ_2 are small positive numbers and f= [ f_x , f_y , f_z , t_z  ]^T.\nFor this simulation, we have chosen δ_1 = δ_2 = 0.5.\n\n <ref> and <ref> show the resulting joint torques/forces and joint velocities as functions of the path coordinate s, together with the considered bounds on them for both manipulators, respectively. The bounds are depicted in dashed lines.\nSimilar to the results from the case with rigid contacts, it can be seen that for every point along the path, either one of the joint torques or forces of the first or second manipulator is in saturation, or one of the joint velocities has reached its bound.\n\n \n\nThe simulation resulted in a minimal traversal time of 0.567 sec, which is greater that the minimal traversal time of the rigid contacts case. This is because of the additional constraints associated with friction cones that the contact forces must respect. \n\nComparison between the minimal traversal times of rigid and frictional contact cases for other paths and orientations of the object can be found in Table <ref>. It can be seen that in all cases, the result obtained for rigid contacts is smaller than the one for frictional contacts.\n\n\n\n\n\n\n\nAs mentioned earlier, in order to be able to firmly grasp an object, it is desirable that internal forces are present during the motion.\nFor the spatial grasp of  <ref>, internal forces are in the form of f_ I_1 =  [ 0 , 0 , α , β ]^T and f_ I_2 =  [ 0 , 0 , α , β ]^T, i.e., the force or the torque components of contact wrenches in the normal direction with equal magnitudes. For these wrenches to be in the interior of the friction cone, α must be positive, meaning that the forces in the normal direction are applied in the positive direction of z-axis at each contact point. In order to investigate the presence of internal forces in the obtained solution from the simulation, the components of the wrenches f_ C_1 and f_ C_2 in the normal direction are shown in  <ref>. \nThe force components for both contacts are shown in the upper plot and the torque components can be seen in the lower plot.\nInternal forces are the force or the torque components in the normal directions with equal magnitudes.\nThat is, the least of the two values of normal components for the forces. \nThis is shown by the black dashed line in the upper plot in  <ref>. \nNote that the obtained solution for the normal force components must be positive at every point along the path, since the wrenches must be in the interior of the friction cones. This is the case for the obtained solution and can be seen from the upper plot in  <ref>. For the torque components, if at a point along the path both torques have the same sign, then the least of the magnitudes of the two torques, will be part of the internal force. This can be seen by the black dashed line in the lower plot.\nThe tangential components of the contact wrenches are plotted in  <ref>.\nThis simulation result shows that the solution of the proposed optimization problem involves internal forces belonging to the interior of the friction cone during the whole motion, which is a desirable property since it ensures a firm grasp.\n\n\n\n\n\n\n\n§ CONCLUSION\n\nWe have formulated the time-optimal path tracking problem for a multi-manipulator system carrying an object as a convex optimization problem. Two types of contact were considered: rigid contacts and contacts with friction. Numerical simulations were carried out for both cases. From the simulation results in both cases, it was seen that for every point along the path, either one of the joint torques or forces of the first or second manipulator was in saturation, or one of the joint velocities had reached its bound. This is in line with the results that can be found in the literature about the structure of the minimum-time control for multiple cooperating manipulators.\nThe resulting minimal traversal time from our approach was compared to the simulation results from using a particular wrench distribution for different paths, where the wrench distributions were chosen from other studies. For each path, our approach resulted in a smaller minimal traversal time, since it considers all possible combinations of wrenches and exploits the full actuation available to the system.\nThe case with contacts with friction resulted in a greater minimal traversal time compared to the case with rigid contacts. This is because of the additional constraints associated with friction cones that the contact wrenches must respect in the case of contacts with friction. \nFurthermore, in the same case it was seen that the solution of the proposed optimization problem involves internal forces that lie in the interior of the friction cone during the whole motion, which is a desirable property for the purpose of having a firm grasp. In future work we plan to study the extension to mobile manipulators, where manipulators are mounted on a mobile platform. Extension to consider rolling contacts where grasping involves moving rather than fixed contact points is another possibility. \n\n\n\n\n\n\n\n\n\n§ DECLARATION OF COMPETING INTEREST\n\nThe authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.\n\n\nelsarticle-harv\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}