{"entry_id": "http://arxiv.org/abs/2303.07038v1", "published": "20230313115716", "title": "Compositeness of $T_{cc}$ and $X(3872)$ with decay and coupled-channel effects", "authors": ["Tomona Kinugawa", "Tetsuo Hyodo"], "primary_category": "hep-ph", "categories": ["hep-ph", "nucl-th"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[]kinugawa-tomona@ed.tmu.ac.jp\nDepartment of Physics, Tokyo Metropolitan University, Hachioji 192-0397, Japan\n\n[]hyodo@tmu.ac.jp\nDepartment of Physics, Tokyo Metropolitan University, Hachioji 192-0397, Japan\n\n\n\n\nThe compositeness of weakly bound states is discussed with the effective field theory from the viewpoint of the low-energy universality. We introduce a model with the coupling of the single-channel scattering to the bare state, and study the compositeness of the bound state by varying the bare state energy. In contrast to the naive expectation that the near-threshold states are dominated by the molecular structure, we demonstrate that a non-composite state can always be realized even with the small binding energy. At the same time, however, it is shown that a fine tuning is necessary to obtain the non-composite weakly bound state. In other words, the probability to find a model with the composite dominant state becomes larger with the decrease of the binding energy in accordance with the low-energy universality. For the application to the exotic hadrons, we then discuss the modification of the compositeness by the decay and coupled-channel effects. We quantitatively show that these contributions suppress the compositeness, because of the increase of the fraction of other components. Finally, as the examples of the near-threshold exotic hadrons, the structure of T_cc and X(3872) is studied by evaluating the compositeness. We find the importance of the coupled-channel and decay contributions for the structure of T_cc and X(3872), respectively. \n\n\n\n\n\n\nCompositeness of T_cc and X(3872) with decay and coupled-channel effects\n    Tetsuo Hyodo\n    March 30, 2023\n========================================================================\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nTo clarify the internal structure of exotic hadrons is one of the central aims of  hadron physics. \nThe recent observations of the candidates of the exotic hadrons in the heavy hadron sectors provide opportunities for intensive studies on the structure of hadrons <cit.>. The exotic hadrons are considered to have different internal structures from the ordinary hadrons with qqq or qq̅ as described in the quark models. \n \n\nIt is remarkable that many candidates of the exotic hadrons have been discovered near two-hadron thresholds.  For example, the tetraquark T_cc has been observed slightly below the threshold of D^0D^*+ in the T_cc→ D^0D^0π^+ decay by the LHCb collaboration in 2021 <cit.>. Its minimum quark content ccu̅d̅ indicates that T_cc is a genuine exotic state with charm C=+2. As a charmonium-like state with C=0, X(3872) has been observed near the D^0D̅^*0 threshold in the B^±→ K^±π^+π^-J/ψ decay in 2003 by the Belle Collaboration <cit.>. X(3872) is considered to be exotic because its mass is not in accordance with the corresponding energy predicted by the quark model <cit.>. \n\n\nAs the possible internal structures of the exotic hadrons, for example, the hadronic molecule states and the multi-quark states are considered. The hadronic molecule state is a loosely bound composite system of hadrons formed by the hadronic interactions, such as the deuteron. In contrast, the multiquark state is the compact state of at least four quarks. To reveal the internal structure of the exotic hadrons, many studies are actively performed from both the theoretical and experimental sides. \n \n\nThe molecular nature of the bound state can be quantitatively studied by using the compositeness <cit.>. The compositeness is defined as the probability to find the hadronic molecule component in the bound state. Theoretically, the compositeness can be evaluated either from the weak-binding relation <cit.> or from the residue of the pole of the scattering amplitude <cit.>. The internal structure of many hadrons has been studied by the compositeness <cit.>. The notion of the compositeness has also been applied to other systems, such as nuclei and atoms <cit.>.\n\n\nThe phenomena associated with the near-threshold states are governed by the low-energy universality <cit.>. \nFrom the universality argument, it is expected that the near-threshold states are dominated by the molecular component <cit.>. In fact, Ref. <cit.> shows that the s-wave bound states become completely composite in the weak-binding limit. A similar discussion has been given in the cluster phenomena in nuclear physics, such as the ground state of ^8Be and the ^12C Hoyle state <cit.>. From these discussions of the near-threshold states, one may naively expect that T_cc and X(3872) are the composite dominant states.\n\n\nHowever, the small binding energy is not the only characteristic feature of T_cc and X(3872). First, both T_cc and X(3872) decay strongly and have a finite decay width. Next, the threshold channel [D^0D^*+ for T_cc and D^0D^*0 for X(3872)] has an isospin partner [D^*0D^+ for T_cc and D^*-D^+ for X(3872)] at a slightly higher energy. These features are illustrated in Fig. <ref>. It is shown that these decay and coupled-channel contributions modify the compositeness of the bound state <cit.>. To understand the nature of T_cc and X(3872), we need to quantitatively evaluate the contributions from the decay and channel coupling to the compositeness.\n\n\n\n\nIn this work, we first demonstrate how the expectation of the molecular nature of the near-threshold states is realized in an explicit model calculation. We show that the shallow bound state can be elementary dominant only with a fine tuning of the model parameter. In most of the parameter region except for the fine-tuned case, the weakly bound state is composite dominant, as expected from the universality. To consider the realistic exotic hadrons, we then examine the effects of the decay and the coupled channel to the compositeness. We quantitatively evaluate the modification of the expectation from the universality by the decay and the coupled-channel effects. We finally apply the model to calculate the compositeness of T_cc and X(3872) to clarify the important effect for these states. \n\n\nThis paper is organized as follows. In Sec. <ref>, we introduce the effective field theory, and numerically calculate the compositeness to discuss the nature of the shallow bound state. We then consider the contributions of the four-point contact interaction, the decay and the channel coupling to the compositeness in Sec. <ref>. In Sec. <ref>, we estimate the compositeness of T_cc and X(3872) by focusing on the importance of the decay and the coupled-channel effects. A summary of this work is given in Sec. V.\n\n\n\n\n\n§ WEAKLY BOUND STATES AND LOW-ENERGY UNIVERSALITY\n\n\nIn this section, we discuss the composite nature of the weakly  bound states in relation to the low-energy universality. In Sec. <ref>, we first construct a simple scattering model with the nonrelativistic effective field theory where a bound state originates from the bare state. In Sec. <ref>, we then numerically compare the compositeness of typical and weakly bound states, and discuss the deviation from the expectation of the low-energy universality with a finite binding energy. We also examine the validity of the weak-binding relation in this model in Sec. <ref>.\n\n\n\n\n §.§ Effective field theory\n\n\n\n\nLet us introduce a nonrelativistic effective field theory to consider the compositeness of the bound state. We construct a model which describes the single-channel scattering of ψ_1 and ψ_2 coupled to the discrete state ϕ without the direct ψ_1 and ψ_2 interactions. The Hamiltonian is\n\n    ℋ_ free   =1/2m_1∇ψ_1^†·∇ψ_1+1/2m_2∇ψ_2^†·∇ψ_2\n          +1/2M∇ϕ^†·∇ϕ+ν_0ϕ^†ϕ, \n    \n    ℋ_ int   =g_0(ϕ^†ψ_1ψ_2+ψ^†_1ψ^†_2ϕ).\n\nHere m_1, m_2 and M are the masses of ψ_1, ψ_2 and the discrete (bare) state ϕ, respectively. ν_0 is the energy of the bare state ϕ measured from the ψ_1ψ_2 threshold, and g_0 is the bare coupling constant of the contact three point interaction. For the Hamiltonian in Eq. (<ref>) to be Hermitian, g_0 must be real. This model can also be regarded as the resonance model without the direct ψ_1ψ_2 interaction in Refs. <cit.>. \n\n\nIn this paper, we focus on the two-body scattering of ψ_1 and ψ_2. While we have no direct interactions in this model, the ψ_1ψ_2 scattering occurs through the intermediate ϕ state. Regarding the s-channel exchange of ϕ as the effective interaction V(k), we can derive the on-shell T-matrix T_ on(k) of the ψ_1ψ_2 scattering as a function of the on-shell momentum k from the Lippmann-Schwinger equation:\n\n    T_ on(k)   =V(k)+V(k)G(k)T_ on(k),\n    \n    \n    V(k)   =g_0^2/k^2/2μ-ν_0,\n    \n    \n    G(k)   =∫d^3q/(2π)^31/k^2/2μ-q^2/2μ+i0^+,\n\nwith the reduced mass of the ψ_1ψ_2 system μ=(1/m_1+1/m_2)^-1. Because V(k) does not depend on the off-shell momenta, the Lippmann-Schwinger equation reduces to an algebraic equation. At the same time, the absence of the angular dependence of the interaction V(k) leads to the s-wave scattering amplitude. To avoid the divergence of the q integration in the loop function G(k), a cutoff Λ is introduced as the upper applicable boundary of the momentum in the effective field theory <cit.>. In this case, regularized G(k) becomes\n\n    G(k)   =-μ/π^2[Λ+ikarctan(-Λ/ik)].\n\n\n\nThe scattering observables are expressed by the scattering amplitude f(k), which is related with the on-shell T-matrix T_ on(k) as f(k)=-μ/(2π)T_ on(k). From Eq. (<ref>), we obtain the scattering amplitude f(k) as\n\n    f(k)   =-μ/2π[k^2/2μ-ν_0/g_0^2+μ/π^2[Λ+ikarctan(-Λ/ik)]]^-1.\n\n\nFor the low-energy scatterings, the inverse of the scattering amplitude 1/f(k) is expanded in powers of the momentum k (the effective range expansion):\n\n    1/f(k)   =-1/a_0+r_e/2k^2+𝒪(k^4)-ik.\n\nThe scattering length a_0 and the effective range r_e are defined from the coefficients of the k^0 and k^2 terms in this expansion. By comparing Eq. (<ref>) with the scattering amplitude in Eq. (<ref>), we obtain the scattering length a_0 and the effective range r_e in this model:\n\n    a_0   =-[2πν_0/g_0^2μ-2/πΛ]^-1,\n    \n    \n    r_e   =-2π/g_0^2μ^2.\n\n We note that the effective range in Eq. (<ref>) is always negative because g_0^2≥ 0 for real g_0. This is the feature of the resonance model mentioned in Refs. <cit.>. \n\n\nSuppose that this model generates a bound state with the binding energy B. The bound state is expressed as the pole of the scattering amplitude, and therefore the eigenmomentum is obtained by solving the bound state condition f^-1(k)=0. The bound state pole appears in the complex momentum plane at k=iκ with κ=√(2μ B)>0. The composite nature of the bound state can be characterized by the compositeness X <cit.> defined as the weight of the scattering states in the bound state |Φ⟩:\n\n    X   =∫d^3k/(2π)^3|⟨k|Φ||⟩^2,\n\nwhere |k⟩ is the scattering eigenstate of the free Hamiltonian in Eq. (<ref>) with the momentum k. The compositeness X can be expressed by the effective interaction and the loop function as discussed in Ref. <cit.>:\n\n    X   =G'(-B,Λ)/G'(-B,Λ)-[V^-1(-B)]'.\n\nUsing this expression, we obtain X in this model from Eqs. (<ref>) and (<ref>):\n\n    X   =[1+π^2κ/g_0^2μ^2(arctan(Λ/κ)-Λ/κ/1+(Λ/κ)^2)^-1]^-1.\n\nWe define the elementarity Z as the overlap of the bound state |Φ⟩ with the bare state |ϕ⟩ which is the discrete eigenstate of the free Hamiltonian created by the bare ϕ field at rest:\n\n    Z=|⟨ϕ|Φ||⟩^2=-[V^-1(-B)]'/G'(-B,Λ)-[V^-1(-B)]'.\n\nNamely, the elementarity Z represents the fraction of the bare state component in the bound state. From the completeness relation with |ψ⟩ and |k⟩, we obtain Z+X=1, which can also be directly seen from  Eqs. (<ref>) and (<ref>).\n\n\nFor later convenience, here we introduce the typical energy scale E_ typ associated with the model. Because the cutoff Λ gives the momentum scale, we define E_ typ as\n\n    E_ typ=Λ^2/2μ.\n\nIf there is a bound state, the typical binding energy is expected to be B∼ E_ typ. If B≪ E_ typ, the state is regarded as a weakly bound state. To ensure that the bound state is in the applicable region of the model, we impose the condition B ≤ E_ typ.\n\n\n\n\n §.§ Numerical calculation\n\n\n\n\nIn this section, we numerically investigate the compositeness of bound states in the model given in Sec. <ref>. Before the concrete calculations, we summarize the relations among the model parameters. In principle, the model parameters, the bare state energy ν_0, the coupling constant g_0 and the cutoff Λ can be arbitrarily chosen. However, for a given binding energy B, the bound state condition f^-1(iκ)=0 leads to the expression of g_0^2 with other two parameters:\n\n    g_0^2(B;ν_0,Λ)   =π^2/μ(B+ν_0)[Λ-κarctan(Λ/κ)]^-1,\n\nwith κ=√(2μ B). Therefore, we can reduce one degree of freedom by fixing the binding energy B. In addition, when we work with dimensionless quantities using Λ, the result does not depend on the specific value of Λ.\n\n\nThe remaining dimensionless parameter ν_0/E_ typ cannot be determined in the framework of the effective field theory.[ν_0 is the energy of the discrete bare state and corresponds to the quark core state in the application to hadrons. The value of ν_0 may be estimated, for instance, by the constituent quark model. ] In this work, we vary ν_0/E_ typ within the allowed region to investigate the model dependence of the compositeness. The parameter region of ν_0/E_ typ is restricted as follows: (i) As we discussed below Eq. (<ref>), the bound state should satisfy the condition κ≤Λ, which leads to Λ-κarctan(Λ/κ)>0. Therefore, the sign of g_0^2 in Eq. (<ref>) coincides with the sign of B+ν_0. The coupling constant square g_0^2 should be positive in Eq. (<ref>) for the Hermitian Hamiltonian. Hence the lower boundary of ν_0/E_ typ is given by -B/E_ typ≤ν_0/E_ typ.[Strictly speaking, the point at ν_0=-B should be discussed with special care, because the coupling constant vanishes and hence the bound state pole decouples from the scattering amplitude <cit.>. It is shown that the compositeness behaves as X→ 1 (X→ 0) with g_0→ 0 for fixed B=0 (B≠ 0). This behavior is confirmed in the present model as we see below.] (ii) Because the effective field theory is applicable up to the energy scale E_ typ, the upper boundary of ν_0/E_ typ is given by E_ typ/E_ typ=1. In summary, the allowed ν_0/E_ typ region is determined as \n\n    -B/E_ typ≤ν_0/E_ typ≤ 1.\n\n\n\nIn Fig. <ref>, we plot the compositeness X as a function of normalized bare state energy ν_0/E_ typ.[Note that the compositeness X in Eq. (<ref>) depends implicitly on ν_0 through g_0^2 [see Eq. (<ref>)].] First, we focus on the solid line which represents X of a bound state with the typical binding energy B=E_ typ. For the most of the allowed region -1≤ν_0/E_ typ≤ 1, the compositeness X is smaller than 0.5. In other words, the bound state with B=E_ typ is elementary dominant for most of the ν_0/E_ typ region. Because the ν_0 dependence of the compositeness can be regarded as the model dependence, it is probable to obtain the bound state with X<0.5 in a randomly chosen model. It is consistent with a naive expectation for the model in Sec. <ref> because the origin of the bound state is the bare state ϕ which contributes to the elementarity. \n\n\nWe then discuss X of a weakly bound state. The dashed line in Fig. <ref> corresponds to the case with B=0.01E_ typ as a representative value of a small binding energy. In this case, the allowed region of ν_0/E_ typ in Eq. (<ref>) is -0.01≤ν_0/E_ typ≤ 1. In contrast to the typical bound state with B=E_ typ, X is larger than 0.5 for most of the allowed region of ν_0/E_ typ. Therefore, the weak-binding state is mostly composite dominant, even though the bound state originates from the bare state. When we focus on the ν_0∼ -B region, however, the compositeness of the shallow bound state is small. This is because the compositeness is fixed to be zero in the ν_0→ -B limit. This means that we can always generate an elementary dominant state by choosing the bare state energy appropriately. However, we need a fine tuning of ν_0 in the small region around ν_0∼ -B to realize an elementary dominant state. In summary, for shallow bound states, the probability to realize the composite dominant state is much higher than the elementary dominant case, although the latter possibility cannot be completely excluded. \n\n\nAt B=0, because the coupling constant in Eq. (<ref>) becomes finite (g_0^2=π^2 ν_0/(μΛ)), from Eq. (<ref>), X=1 holds in the whole region of 0≤ν_0/E_ typ≤ 1. Therefore, the plot of the compositeness in Fig. <ref> becomes the step function. This is understood from the low-energy universality <cit.>. It is known that the compositeness X becomes unity in the weak-binding limit B→ 0 (compositeness theorem) <cit.>. The present model also follows this model independent result. From the expectation of the low-energy universality, the microscopic details such as the value of ν_0 become irrelevant, and the same relation X=1 holds for all models in the B→ 0 limit. In contrast to the finite B≠ 0 case, the elementary dominant state cannot be generated with any ν_0. By gradually decreasing the binding energy from B=0.01E_ typ (dashed line in Fig. <ref>), the region of ν_0 with the elementary dominant state becomes smaller and finally vanishes. \n\n\nWe search for the critical binding energy B_ cr at which the fraction of the composite dominant and the elementary dominant region of ν_0/E_ typ is precisely half and half. From the numerical calculation, it turns out that B_ cr= 0.243E_ typ, and we plot the compositeness with B_ cr as the dotted line in Fig. <ref>. Namely, we expect that the composite dominant nature of the bound state becomes prominent for the state with B<B_ cr. We however note that B_ cr=0.243E_ typ is a value specific to the present model. The value depends on the choice of the regularization of the function G and the interaction Lagrangian.\n\n\nAs a common feature in all cases shown in Fig. <ref>, X increases with ν_0/E_ typ. We can analytically show this behavior from Eq. (<ref>) because g_0^2 monotonically increases with ν_0. In the ν_0→ -B limit, the compositeness X vanishes.[For ν_0<-B, the compositeness X becomes negative. This is because the norm of the bare state becomes negative for g_0^2<0 and the admixture of the negative norm bare state gives Z<0. However, here we do not consider such cases with non-Hermitian Hamiltonian as discussed above.]\nWhen g_0^2 increases, the bound state couples more strongly to the scattering states, and the contribution of the scattering states, and hence the compositeness X, becomes larger. This can also be  seen in the ν_0 dependence of X in Eq. (<ref>) mentioned above. In Ref. <cit.>, the authors discuss the nature of the bound state in the weak- and strong-coupling limits, and conclude that the bound state is elementary dominant (composite dominant) for the weak-coupling (the strong-coupling) case. Their result is consistent with our analysis of ν_0∼ -B and ν_0∼ E_ typ in Fig. <ref>. Because ν_0∼ -B (ν_0∼ E_ typ) corresponds to g_0∼ 0 (large g_0) as seen in Eq. (<ref>), states are elementary dominant with X∼ 0 (composite dominant with X∼ 1) in the weak-coupling (strong-coupling) case in our model.\n\n\n\n\nTo quantitatively discuss the probability to find a model with the composite dominant bound state, we define P_ comp as the fraction of ν_0/E_ typ region with X>0.5:\n\n    P_ comp   =1-ν_c/E_ typ/1+B/E_ typ,\n\nwhere ν_c is the value of ν_0 such that X=0.5[If X<0.5 in the whole ν_0 region, we set ν_c=E_ typ and hence P_ comp=0. In the B→ 0 limit, the compositeness is always unity and hence we define ν_c=-B such that P_ comp=1.]. The definition of ν_c for B=E_ typ is illustrated in Fig. <ref>. Because X is plotted in the region -B/E_ typ≤ν_0/E_ typ≤ 1, the denominator of Eq. (<ref>) corresponds to the length of the horizontal axis in Fig. <ref>. The numerator is expressed by the width of the shaded region. Thus, P_ comp in Eq. (<ref>) is defined as the ratio of the shaded region to the all allowed region of ν_0/E_ typ (the length of the horizontal axis). The explicit values for the cases shown in Fig. <ref> are found to be P_ comp=0.25 at B=E_ typ and P_ comp=0.88 at B=0.01E_ typ. Because B_ cr is defined so that the composite dominant case occupies the half of the whole ν_0/E_ typ region, we obtain P_ comp=0.5 at B=B_ cr.\n\n\nIn Fig. <ref>, we plot P_ comp by varying the normalized binding energy B/E_ typ. Small P_ comp at B/E_ typ∼ 1 monotonically increases to unity by decreasing the binding energy B. This shows that the probability to find a model with the composite dominant state is small for the typical bound states but gradually increases along with the reduction of the binding energy. In the small B region, P_ comp rapidly grows toward unity. At B=0, we have P_ comp=1; the bound state becomes completely composite dominant for any models as discussed above. Figure <ref> also shows that even when we slightly go away from the weak-binding limit B=0, it is expected that P_ comp is still close to unity. This suggests that it is probable to find the near-threshold composite dominant states with B≪ E_ typ. In fact, the weak-binding hadrons, nuclei and atoms studied in Ref. <cit.> are all composite dominant states.\n\n\n\n\n\n\n\n\n\n §.§ Weak-binding relation\n\n\n\nFinally, we discuss the validity of the weak-binding relation in this model. The weak-binding relation gives the compositeness X_ wb from the scattering length a_0 and the radius of the bound state R=1/κ as follows <cit.>\n\n    X_ wb   =X_ wb^c+𝒪(R_ typ/R), \n    \n    \n    X_ wb^c   =a_0/2R-a_0,\n      \n    R_ typ=max{1/Λ, |r_e|,...},\n\nwhere r_e is the effective range, R_ typ is the typical length scale of the system which is estimated as the maximum length scale expect for a_0, and X_ wb^c is the central value of the compositeness in the weak-binding relation. For a weakly bound state with R≫ R_ typ, we can neglect the correction terms 𝒪(R_ typ/R) in Eq. (<ref>). In this case, X_ wb≈ X_ wb^c is obtained only from the observables a_0 and R. Therefore, the weak-binding relation is a model independent method to estimate the compositeness of the shallow bound state. \n\n\nIn Fig. <ref>, we plot the compositeness X in this model [Eq. (<ref>)] and the central value of the compositeness from the weak-binding relation X_ wb^c in Eq. (<ref>). We use a_0 in Eq. (<ref>) and R in this model for the calculation of X_ wb^c. Panel (a) shows X (solid line) and X_ wb^c (dashed line) for the typical binding case B=E_ typ, and panel (b) for the weak-binding case B=0.01E_ typ. We see that the difference between X_ wb^c and X is significant for B=E_ typ in panel (a) while that for B=0.01E_ typ is at most 0.1 in panel (b). Therefore, the weak-binding relation gives a good estimation of the compositeness for the shallow bound state. It is remarkable that the weak-binding relation works to estimate X correctly even in the region ν_0∼ -B where X<0.5 in panel (b). In Ref. <cit.>, the validity of the weak-binding relation is demonstrated for composite dominant (X∼ 1) states with a shallow binding energy. In this work, we find that the weak-binding relation works also for shallow but elementary dominant bound states.\n\n\n\n\nIt is instructive to analytically show that the exact compositeness X coincides with the weak-binding one in Eq. (<ref>) in the small B limit. For a weakly bound state with B≪ E_ typ (κ≪Λ), the arctangent term in the loop function in Eq. (<ref>) can be approximated as\n\n    arctan(Λ/κ)   =π/2+𝒪(κ/Λ).\n\nUnder this approximation, the loop function G(iκ) becomes\n\n    G(iκ)≈-μ/π^2(Λ-π/2κ)\n       (B≪ E_ typ) ,\n\nand the scattering amplitude is given by\n\n    f(iκ)   ≈[2π/μ(κ^2/2μ+ν_0/g_0^2)-2Λ/π+κ]^-1   (B≪ E_ typ)\n    .\n\nNote that the approximation in Eq. (<ref>) is not valid for a large binding energy (κ >2Λ/π) where the square of the coupling constant becomes negative, g^2_0<0.\n\nFrom V and approximated G in Eq. (<ref>), the compositeness X in Eq. (<ref>) is given by\n\n    X≈[1+2π/Rμ^2g_0^2]^-1   (B≪ E_ typ).\n\nBy using the scattering length a_0 in Eq. (<ref>), the central value of the compositeness in Eq. (<ref>) is obtained as\n\n    X_ wb^c   =[2R(-2πν_0/g_0^2μ+2/πΛ)-1]^-1\n       =[2R(π/R^2g_0^2μ^2+1/R)-1]^-1\n       =[1+2π/Rμ^2g_0^2]^-1.\n\nIn the second line, we use the bound state condition from the scattering amplitude in Eq. (<ref>) written by R=1/κ:\n\n    -2π/μ(-κ^2/2μ-ν_0/g_0^2)-2Λ/π+κ   =0\n    ⇔2Λ/π-2πν_0/g_0^2μ=π/R^2g_0^2μ^2+1/R.\n\nFrom Eqs. (<ref>) and (<ref>), we show that the exact compositeness X reduces to the central value estimated by the weak-binding relation X_ wb^c in the small B limit. In Ref. <cit.>, it is shown that there are two origins of the deviation of estimated X_ wb^c from exact X. The first one comes from the higher order terms in the derivative of the loop function, and the second one from those in the effective range expansion of the residue of the bound state pole. The derivative of the approximated loop function in Eq. (<ref>) has only the leading order term, and hence the first deviation does not appear. Because the scattering amplitude in Eq. (<ref>) has no higher order terms of 𝒪(k^4), the second deviation does not arise. In this way, we explicitly show that all the deviations disappear in the B→ 0 limit and the estimation of the compositeness by the weak-binding relation becomes exact. In this context, it is worth noting the deviation of X_ wb^c from exact X in the scattering models discussed in Ref. <cit.>. In the zero-range model with the loop function in Eq. (<ref>), X=X_ wb^c can be shown because the inverse scattering amplitude is given up to 𝒪(k). In contrast, X deviates from X_ wb^c in the resonance model because the four-point contact interaction induces the higher order terms of 𝒪(k^4) in the effective range expansion. \n\n\n\n\n\n\n§ EFFECTS OF FOUR-POINT CONTACT INTERACTION, DECAY AND CHANNEL COUPLING\n\n\n\nAs mentioned in the introduction, the actual exotic hadrons have the finite decay width and the coupling to the additional scattering channel. One can also consider the direct interaction in the threshold channel which is absent in the model in Sec. <ref>. In this section, we consider the four-point contact interaction, decay and coupled-channel effect and show how these contributions modify the results in the previous section. In Sec. <ref>, we introduce the four-point contact interaction in addition to the model in the previous section, and study the contribution of the four-point interaction to the compositeness and low-energy universality. As in the same way, the decay contribution and coupled-channel contribution are discussed in <ref> and <ref>, respectively. \n\n\n\n\n §.§ Effect of four-point contact interaction\n\n\n\n\nIn this section, we investigate the effect of the direct  interaction of ψ_1 and ψ_2 in addition to the model in Sec. <ref>. For this purpose, we introduce the four-point contact interaction term with the coupling constant λ_0, and the interaction Hamiltonian in Eq. (<ref>) becomes\n\n    ℋ_ int   =λ_0(ψ_1^†ψ_2^†ψ_1ψ_2)+g_0(ϕ^†ψ_1ψ_2+ψ^†_1ψ^†_2ϕ).\n\nPositive λ_0>0 (negative λ_0<0) corresponds to a repulsive (attractive) interaction. Because of the addition of the contact interaction term, the effective interaction V(k) in Eq. (<ref>) as a function of the momentum k changes to \n\n    V(k)   =λ_0+g_0^2/k^2/2μ-ν_0,\n\nwhile the loop function G(k) in Eq. (<ref>) remains unchanged. The scattering amplitude f(k) is obtained as\n\n    f(k)   =-μ/2π[(λ_0+g_0^2/k^2/2μ-ν_0)^-1.\n         .+μ/π^2{Λ+ikarctan(-Λ/ik)}]^-1.\n\nAs in Sec. <ref>, we consider the bound state with the eigenmomentum k=iκ and the binding energy B=κ^2/(2μ). The compositeness X is calculated from V in Eq. (<ref>) and G in Eq. (<ref>):\n\n    X   =[1+g_0^2π^2κ/μ^2/(B+ν_0)^2(λ_0-g_0^2/B+ν_0)^2(arctan(Λ/κ)-Λ/κ/1+(Λ/κ)^2)]^-1.\n\n\n\nThe model parameters are the bare state energy ν_0, the cutoff Λ, and the coupling constants λ_0 and g_0. As in the model in Sec. <ref>, from the bound state condition f(iκ)^-1=0 with a fixed binding energy, g_0^2 is written in terms of the binding energy B and other morel parameters:\n\n    g_0^2(B; ν_0,λ_0,Λ)   =(B+ν_0)(π^2/μ/Λ-κarctan(Λ/κ)+λ_0).\n\nFurthermore, the use of the dimensionless parameters can absorb the Λ dependence. Therefore, the remaining parameters ν_0 and λ_0 are varied in the calculation of the compositeness. As in Sec. <ref>, we vary ν_0/E_ typ in the region -B/E_ typ≤ν_0≤ 1.\n\n\nWe now consider the relevant parameter region of λ_0. From Eq. (<ref>), we see that g_0^2 becomes negative for large negative λ_0. To avoid this problem, we introduce the lower boundary of λ_0 as λ_0^ b, which is determined by the condition g_0^2=0 in Eq. (<ref>):\n\n    λ^ b_0=-π^2/μ[Λ-κarctan(Λ/κ)]^-1.\n\nThus, λ_0 should be chosen in the allowed region -|λ_0^ b| ≤λ_0. Note that λ^ b_0 depends on the binding energy B=κ^2/(2μ).\n\n\nWe then determine the region of λ_0 for the numerical calculation. We define λ_0^ cr as the critical value of the attractive coupling constant which supports a bound state at B=0 without the bare state contribution:\n\n    λ^ cr_0=-π^2/μΛ.\n\nIn fact, with λ_0=λ^ cr_0 and g_0^2=0, the scattering amplitude in Eq. (<ref>) has a pole at B=κ=0. For a stronger attraction than λ_0^ cr, a bound state is formed only by the direct interaction. Because the formation of a bound state is a non-perturbative phenomenon, |λ_0^ cr| can be regarded as the representative strength of the strong coupling. To examine the weak to strong couplings for both repulsive and attractive interactions, we vary λ_0 in the region \n\n    -|λ_0^ cr|≤λ_0≤ |λ_0^ cr|.\n \nNote that the relation -|λ_0^ b|<-|λ_0^ cr| always holds since κarctan(κ/Λ)>0 for any κ>0. Thus, the condition -|λ_0^b|<λ_0 is guaranteed with Eq. (<ref>) \nfor any κ.\n\n\nTo observe the effect of the contact interaction with λ_0, we plot the compositeness X as a function of the normalized bare states energy ν_0/E_ typ for the weak-binding case B=0.01E_ typ in Fig. <ref>. The solid, dashed, and dotted lines express X with λ_0=0, λ_0=-|λ^ cr_0|, and λ_0=|λ^ cr_0|, respectively. As shown in Fig. <ref>, the repulsive interaction |λ^ cr_0|>0 decreases X and the attractive interaction -|λ^ cr_0|<0 increases X for fixed ν_0. \nTo understand this behavior, we consider the interaction mechanisms and their implication to the compositeness of the bound state. In the present model, the bound state is originated not only from the bare state pole but also from the attractive four-point interaction.\nAs discussed in Sec. <ref>, the bare pole term contributes to the elementarity Z. In contrast, \nthe attractive four-point interaction provides the composite bound state, and hence contributes to the compositeness X. With both the interactions, the compositeness of the bound state is determined by the interplay between the bare pole term proportional to g_0^2 and the direct interaction proportional to λ_0. Because the binding energy is chosen to satisfy -B< ν_0, Eq. (<ref>) indicates that g_0^2 increases with λ_0 for fixed B and ν_0.\nIntuitively, negative λ_0 (attractive four-point interaction) tends to increase the binding energy and hence the coupling to the bare pole term g_0^2 should be reduced to keep the binding energy unchanged. In contrast, g_0^2 increases to compensate the reduction of the binding energy by the repulsive four-point interaction with positive λ_0. This relation between g_0^2 and λ_0, together with the origin of the bound state discussed above, explains the behavior of the compositeness with respect to λ_0; the introduction of the repulsive (attractive) four-point interaction with positive (negative) λ_0 increases (decreases) g_0^2 and therefore the compositeness of the bound state X decreases (increases).\n\n\n\n\nThe λ_0 dependence of the compositeness can be visualized by plotting X as a function of the normalized  coupling constant λ_0/|λ_0^ cr| in Fig. <ref>. In this plot, we fix the bare state energy as ν_0=0.5E_ typ and we have checked that the qualitative result does not change for different values of ν_0. The solid line represents X for B=E_ typ, and the dashed line represents for B=0.01E_ typ. In both cases, X decreases with the increase of λ_0/|λ_0^ cr|, as discussed above. In Fig. <ref>, we see that the compositeness X depends on λ_0 more strongly for B=0.01E_ typ than that for B=E_ typ. This tendency originates in the structure of the bound state at λ_0=0; a stronger coupling g_0 is required to generate the deeper bound state with the same ν_0, as indicated by the smaller compositeness X for the typical bound state with B=E_ typ. The deeper bound state is less affected by the introduced four-point interaction\nand hence the λ_0 dependence becomes milder.\n\n\n\n\nFinally, in Fig. <ref>, we plot the fraction of composite dominant state P_ comp as a function of the normalized binding energy B/E_ typ to discuss the low-energy universality with λ_0 contribution. The solid line represents P_ comp with λ_0=0 (same as Fig. <ref>), the dashed line with λ_0=|λ_0^ cr|, and the dotted line with λ_0=-|λ_0^ cr|. For all the λ_0 cases, P_ comp decreases when the binding energy B increases. Because positive λ_0>0 (repulsive interaction) suppresses the compositeness and ν_c becomes smaller (see Fig. <ref>), P_ comp is also suppressed. In contrast, attractive interaction with negative λ_0<0 enhances P_ comp because it induces the increase of X and the decrease of ν_c in Fig. <ref>. At B=0, we see that P_ comp becomes unity for all λ_0 cases. This result indicates that the bound state becomes completely composite dominant in the B→ 0 limit even with the four-point interaction with any strength. It is consistent with the consequence of the low-energy universality. At the same time, the decrease rate of P_ comp depends on the strength of the four-point interaction λ_0. In other words, λ_0 dependence in Fig. <ref> expresses the model dependence of P_ comp away from the B→ 0 limit.\n\n\n\n\n\n\n\n §.§ Effect of decay\n\n\n\nBecause the exotic hadrons generally have a decay width, we consider the decay effect to the compositeness in this section. To concentrate on the decay effect, here we do not include the four-point interaction and set λ_0=0. The decay effect can be formally described in the effective field theory by introducing the decay channel in the energy region lower than the binding energy in addition to the threshold channel <cit.>. In this paper, we effectively introduce the decay effect by letting the coupling constant g_0 be a complex number in the Hamiltonian in Eq. (<ref>). Because the Hamiltonian is non-Hermitian, the the eigenenergy becomes complex as\n\n    E=-B-iΓ/2,\n\nwith the decay width Γ. In the presence of the decay width Γ, the square of the coupling constant g_0^2 in Eq. (<ref>) is \n \n    g_0^2   =π^2/μ(B+iΓ/2+ν_0)[Λ-κarctan(Λ/κ)]^-1,\n     \n    κ   = √(2μ (B+iΓ/2)) ,\n\nwhich is complex for Γ≠ 0.\n\n\nBy definition, the compositeness X and elementarity Z are complex for unstable states <cit.>. In fact, the compositeness X in this model, obtained with Eq. (<ref>), is not a real number with complex g_0^2 and κ for the finite Γ≠0 case. However, we cannot interpret complex X and Z as the probabilities as in the case of the bound state with real X and Z. To discuss the structure of unstable states, we need to introduce other real quantities which can be interpreted as the fraction of the composite (elementary) components instead of complex X (Z). Here we employ the quantities X̃ and Z̃ defined as\n\n    X̃   =|X|/|X|+|Z|,\n    \n    Z̃   =|Z|/|X|+|Z|,\n\nwhich are proposed in Ref. <cit.>. For stable states without the decay width, X̃ and Z̃ reduce to X and Z because |X|=X, |Z|=Z and X+Z=1. It is clear that X̃ and Z̃ satisfy the sum rule:\n\n    X̃+Z̃=1.\n\nIn addition, it follows from the definitions in Eqs. (<ref>) and (<ref>) that the relations 0≤X̃≤ 1 and 0≤Z̃≤ 1 hold. Therefore, we can regard X̃ and Z̃ as the probabilities to find the composite and elementary components in a wavefunction instead of complex X and Z. Hence we call X̃ and Z̃ the compositeness and the elementarity, respectively.\n\n\nTo observe the effect of the decay, in Fig. <ref>, we plot the compositeness X̃ by the solid lines as a function of the normalized bare state energy ν_0/E_ typ for various B and Γ. The panels (a) and (b) [(c) and (d)] correspond to the weak-binding (typical binding) case, and the panels (a) and (c) [(b) and (d)] represent the state with a narrow (broad) decay width. The bare state energy ν_0 is varied in the region -B/E_ typ≤ν_0/E_ typ≤ 1.  For comparison, the dashed lines represent the compositeness X̃ for the same B but with Γ=0 (same as the solid and dashed lines in Fig. <ref>).\n\nBy comparing the solid and dashed lines, we see that the effect of the decay width generally suppress the compositeness, while X̃ is enhanced at small ν_0∼ -B. Basically, the compositeness of the threshold channel decreases when the decay width is turned on because the coupling to the decay channel increases. This tendency becomes prominent especially in panel (b). The small ν_0 behavior is however governed by the compositeness at ν_0=-B. From Eqs. (<ref>) and (<ref>), without the decay effects, the compositeness becomes zero in the ν_0→ -B limit because g_0^2→ 0. On the other hand, with a finite width Γ≠ 0, g_0^2 does not vanish at ν_0=-B:\n\n    g_0^2(-ν_0+iΓ/2;ν_0,Λ)   =π^2/μ(-iΓ/2)[Λ-κarctan(Λ/κ)]^-1\n       ≠ 0.\n\nFrom Eq. (<ref>), the complex compositeness X becomes nonzero, and X̃ in Eq. (<ref>) becomes larger than zero. This explains the enhancement of X̃ at ν_0∼ -B. \n\n\n\n\nFurthermore, by comparing panels (a) and (c) with (b) and (d), we see that the ν_0 dependence of X̃ becomes smaller for larger decay width. It follows from Eq. (<ref>) that the ν_0 dependence of g_0^2 is negligible for |B+iΓ/2|≫ν_0. Therefore, X̃ is less dependent on ν_0, and the plot of X̃ becomes flat for larger Γ. For more quantitative discussion, let us analytically evaluate X̃ in the large decay width limit, Γ≫ E_ typ. Because ν_0 is varied in the -B≤ν_0≤ E_ typ region and the binding energy is restricted within B≲ E_ typ, the relations ν_0≪Γ and B≪Γ hold under the large width limit. Furthermore, because κ=√(2μ (B+iΓ/2))∼√(iμΓ) and Γ≫ E_ typ=Λ^2/(2μ), we find |κ|≫Λ in this limit. In this case, the coupling constant g_0^2 in Eq. (<ref>) behaves as \n\n    g_0^2   =3π^2κ^4/2μ^2Λ^3+…,\n\nfrom the expansion of arctan(Λ/κ) for |κ|≫Λ:\n\n    arctan(z)   =z-z^3/3+𝒪(z^5)   (|z|≪ 1).\n\nBy substituting Eq. (<ref>) into the compositeness in Eq. (<ref>) and expanding the terms in the parenthesis by Λ/κ, we obtain X for the large decay width limit as\n\n    X   =1/2+….\n\nBecause Z=1/2+…, X̃ is calculated as \n\n    X̃   =1/2+….\n\nTherefore, in the large width limit, X̃ approaches 1/2 for any ν_0 as expected from panels (b) and (d) in Fig. <ref>. It is worth noting that, in the large width limit Γ≫ E_ typ, the magnitude of the eigenenergy exceeds the applicable region of the model. Therefore, this formal limit should only be used to understand the behavior of X̃ with increasing Γ. \n\n\nTo study the decay effect with respect to the binding energy, we compare panel (a) with (c) where the eigenstates have the same decay width. The decay effect (deviation of X̃ with Γ≠ 0 from that with Γ=0) in panel (a) is sizable, whereas the effect in panel (c) is almost negligible. While the half width Γ/2=0.1E_ typ is larger than the binding energy B=0.01E_ typ in panel (a), the same decay width Γ/2=0.1E_ typ is smaller than B=E_ typ in panel (c). Therefore, we conclude that the deviation of X̃ by the decay effect is determined by the ratio of the binding energy to the decay width.\n\n\nTo discuss the low-energy universality, we define P_ comp as in Eq. (<ref>) but with X̃=0.5 as the determination of ν_c. In Fig. <ref>, we plot P_ comp as a function of the normalized binding energy B/E_ typ in the presence of the decay width. The solid line stands for P_ comp with Γ=0, the dashed line with Γ/2=0.1E_ typ, and the dotted line with Γ/2=E_ typ. By comparing the solid line with the dashed and dotted lines, we see that P_ comp decreases when the decay width increases. This reason is understood from the X̃ behavior in Fig. <ref>, where X̃ is suppressed by introducing the decay width and ν_c becomes large accordingly. Therefore, the decay effect makes P_ comp smaller than that for the stable states. From the B dependence in Fig. <ref>, the deviation of the dashed and dotted lines from the solid line becomes smaller in the large B region. Through the comparison of panels (a) and (b) with panels (c) and (d) in Fig. <ref>, the deviation of the compositeness with and without decay width becomes smaller for larger binding energy. In contrast, for B/E_ typ≲ 0.2 region in Fig. <ref>, the deviation of the dashed and dotted lines from the solid line becomes larger. This reason is shown in panels (a) and (c) in Fig. <ref>; for smaller B [panel (a)], there is a sizable change of ν_c while ν_c is almost unchanged for larger B [panel (c)]. At B=0, P_ comp≠ 1 with the finite decay width in contrast to the effect of the direct interaction in Fig. <ref>. With Γ≠ 0, κ and g_0^2 in Eq. (<ref>) are finite at B=0. Therefore, the relation X̃=1 does not hold with finite Γ even in the weak-binding limit B→ 0, and hence P_ comp<1.\n\n \n\n\n\n\n\n\n §.§ Effect of channel coupling\n\n\n\n\nIn the previous section, we have studied the decay effect which arises from the couplings to the lower energy channel than the threshold one. In this section, we consider the effect of the coupling to the higher energy channel. For this purpose, we introduce the scattering of Ψ_1 and Ψ_2 (channel 2) in addition to the ψ_1ψ_2 scattering (channel 1) in the free Hamiltonian in Eq. (<ref>):\n\n    ℋ_ free   =1/2m_1∇ψ_1^†·∇ψ_1+1/2m_2∇ψ_2^†·∇ψ_2\n         +1/2M_1∇Ψ_1^†·∇Ψ_1+1/2M_2∇Ψ_2^†·∇Ψ_2\n          +1/2M∇ϕ^†·∇ϕ+ω_1Ψ_1^†Ψ_1+ω_2Ψ_2^†Ψ_2+ν_0ϕ^†ϕ.\n\nwhere M_1 and M_2 are the masses of Ψ_1 and Ψ_2, ω_1 and ω_2 are the energies of Ψ_1 and Ψ_2 measured from the ψ_1ψ_2 threshold. Δω=ω_1+ω_2>0 is the threshold energy difference between channels 1 and 2. For the transition from channel 1 to channel 2, here we introduce the coupling of channel 2 and the bare state ϕ. We employ the same coupling constant g_0 with that for channel 1 and ϕ. The interaction Hamiltonian leads to\n\n    ℋ_ int   =g_0(ϕ^†ψ_1ψ_2+ψ^†_1ψ^†_2ϕ+ϕ^†Ψ_1Ψ_2+Ψ^†_1Ψ^†_2ϕ).\n\n \n\nWe now consider the on-shell T-matrix T_ on(k) of the coupled-channel scatterings. As in the single-channel case in Sec. <ref>, the scatterings occur through the effective interaction with the bare state ϕ exchange. In the coupled-channel scattering, T_ on(k), the effective interaction V(k) and the loop function G(k) are expressed by the matrices in the channel space. In this model, the on-shell T-matrix is given by\n\n    T_ on(k_1)   =V(k_1)+V(k_1)G(k_1)T_ on(k_1),\n    \n    V(k_1)   =[ v(k_1) v(k_1); v(k_1) v(k_1) ], \n    \n    \n    G(k_1)   =[      G_1(k_1)             0;             0 G_2(k_2(k_1)) ].\n\nHere each component of V(k) and G(k) is \n\n    v(k_1)   =g_0^2/k_1^2/2μ_1-ν_0,\n    \n    \n    G_i(k_i)\n       =-μ_i/π^2[Λ+ik_iarctan(-Λ/ik_i)],\n\nwhere the momentum of each channel at the energy E is\n\n    k_1   =√(2μ_1E),\n    \n    k_2(k_1)   =√(2μ_2(E-Δω))=√(μ_2/μ_1k_1^2-2μ_2Δω),\n\nwith μ_1=(1/m_1+1/m_2)^-1 and μ_2=(1/M_1+1/M_2)^-1. \n\n\nAs before, we assume that there is a bound state. The bound state condition for the coupled-channel scattering is given by (1-GV)=0. This leads to\n\n    E-ν_0-g_0^2(G_1(k_1)+G_2(k_2))=0,\n\nwith E=-B.\nBy solving this condition for g_0^2, we obtain the expression of g_0^2 as\n\n    g_0^2(B;ν_0,Λ)=-B+ν_0/G_1(iκ_1)+G_2(iκ_2),\n\nwith κ_1=√(2μ_1B) and κ_2=√(2μ_2(B+Δω))\n\n\nIn the coupled-channel scattering, the compositeness is defined for each channel as X_1 and X_2. X_i is interpreted as the probability to find channel i composite state in the bound state. As in the single-channel case, the compositeness X_1, X_2 and the elementarity Z=1-X_1-X_2 are calculated from the effective interaction in Eq. (<ref>) and the loop functions in Eq. (<ref>). As discussed in Ref. <cit.>, the expression of X_1 is obtained by replacing G→ G_1 and V^-1→ [v_ eff]^-1 in Eq. (<ref>), where v_ eff is the effective interaction in channel 1 obtained by eliminating the bare state and channel 2. In the present model, the effective interaction is <cit.>:\n\n    [v_ eff]^-1(k_1)   =1-G_2(k_2)v(k_1)/[1-G_2(k_2)v(k_1)]v(k_1)+G_2(k_2)v^2(k_1)\n       =v^-1(k_1)-G_2(k_2).\n\nThen the compositeness X_1 and X_2 are \n\n    X_1   =G'_1(iκ_1)/G'_1(iκ_1)+G'_2(iκ_2)-[v^-1]',\n    \n    \n    X_2   =G'_2(iκ_2)/G'_1(iκ_1)+G'_2(iκ_2)-[v^-1]',\n\nwhere κ_1=√(2μ_1B), κ_2=√(2μ_2(B+Δω)), and the derivatives of v^-1 and the loop functions G_1,G_2 are given by\n\n    [v^-1]'   =1/g_0^2,\n    \n    \n    G'_i(iκ_i)   =-μ_i^2/π^2κ_i(arctan(Λ/κ_i)-Λ/κ_i/1+(Λ/κ_i)^2),\n\nwith i=1 and 2.\n\n\nFor the numerical calculation, we can choose arbitrarily μ_1,2 and Δω by adjusting m_1,2, M_1,2 and ω_1,2. With the dimensionless parameters, the result only depends on the ratio of μ_1 and μ_2. In this section, to focus on the Δω dependence, we assume μ_1=μ_2. \n\n\nTo quantitatively study the contribution of the coupled channel, we plot the compositeness as a function of the normalized bare state energy ν_0/E_ typ in Fig. <ref>. The solid lines stand for X_1+X_2, the dotted lines for X_1. Therefore, the difference between the solid and dotted lines corresponds to X_2. To see the coupled-channel effect to the compositeness, we plot X in Eq. (<ref>) for single-channel case with same B and ν_0 by the dashed lines. Panels (a) and (b) [(c) and (d)] correspond to the weak-binding (typical binding) case, and panels (a) and (c) [(b) and (d)] show the results with small (large) threshold energy difference Δω. By comparing panels (a) with (b) and (c) with (d), we see that X_2 becomes smaller for larger threshold energy difference Δω. This is analytically explained by the behavior of X_2 in Eq. (<ref>) in the large Δω limit. When Δω→∞, κ_2 also goes to infinity. This induces that G'_2→ 0 in Eq. (<ref>) and X_2 becomes zero in Eq. (<ref>). Intuitively, this is because the channel 2 contribution vanishes when the threshold is infinitely far away.\n\n\nIn the opposite limit Δω→ 0, we can also analytically show that X_1=X_2, because κ_1=κ_2 and then G_1=G_2 under the assumption of this calculation with μ_1=μ_2, so Eq. (<ref>) becomes identical with Eq. (<ref>). This is because the bound state couples to both the channels with an equal weight. This behavior is reflected in panel (c), where Δω is negligibly smaller than B and the dotted line indicates about a half of the solid line.\nWe note that the ratio X_1/X_2 in the Δω→ 0 limit depends on the coupling strengths in channels 1 and 2. In this work, we obtain X_1/X_2=1 because the common coupling constant g_0 to both the channels is adopted in the interaction Lagrangian in Eq. (<ref>). With different coupling strengths for channels 1 and 2, we obtain the ratio X_1/X_2≠ 1 in the Δω→ 0 limit. \n\nIt is also observed in all panels in Fig. <ref> that the sum X_1+X_2 (the solid line) is close to X in the single-channel model (the dotted line). In our coupled-channel model, the bound state is formed by the dressing of the bare state through the coupling to the scattering states. The dressing induces the two-body composite component to the eigenstate and increases the compositeness. From a fixed bare state energy ν_0, we need the same amount of the dressing to obtain the bound state at E=-B, irrespective of the number of coupled channels. In the coupled-channel model, channels 1 and 2 work cooperatively to achieve the equivalent dressing with that in the single-channel model. In other words, the compositeness X_1+X_2∼ X represents the total amount needed to dress the bare state to the bound state.\n\n\n\n\nFor the multi-channel case, the low-energy universality indicates that the bound state is completely dominated by the threshold channel, namely, X_1=1, X_2=0, and Z=0 in the B→ 0 limit. To focus on the dominance of X_1, we define P_ comp in Eq. (<ref>) with ν_c which gives X_1=0.5 as the probability to find a model with the ψ_1ψ_2 composite dominant state. In Fig. <ref>, we plot P_ comp as a function of the normalized binding energy B/E_ typ for Δω=E_ typ (dashed line), Δω=10E_ typ (dotted line), and Δω→∞ (solid line) representing the single-channel case. By comparing three lines, we find that P_ comp is suppressed by a finite threshold energy difference Δω from the single-channel case at the same B, and the suppression becomes larger for smaller Δω. The reason for this is seen as the change of ν_c in panels (a) and (b) in Fig. <ref>; ν_c/E_ typ= 0.15 for Δω=E_ typ [panel (b)] changes to ν_c/E_ typ= 0.71 for Δω=0.01E_ typ [panel (a)] so that the fraction of the composite dominant region decreases. In Fig. <ref>, the dashed line becomes zero in the region B/E_ typ≥ 0.35, where the channel 1 compositeness X_1 is always smaller than 0.5 and there is no X_1 dominant region [see panel (d) in Fig. <ref>]. At B=0 in Fig. <ref>, P_ comp becomes unity even with the coupled-channel effect with finite Δω. For arbitrary Δω, one can always consider the small binding energy B such that B≪Δω. In this case, the bound state decouples from channel 2, and X_2 becomes zero as discussed above in the Δω→∞ limit. At the same time, the bound state is completely dominated by the composite component of the threshold channel, X_1→ 1. This is consistent with the consequence of the low-energy universality.\n\n\n\n\n\n\n§ APPLICATION TO T_CC AND X(3872)\n\n\nBased on the properties of the near-threshold states discussed so far in general cases, we now consider the application to hadron physics. As prominent examples of  weakly bound exotic hadrons, we discuss the nature of T_cc and X(3872) by calculating the compositeness with the effective field theory. As mentioned in the introduction (see Fig. <ref>), T_cc is observed slightly below the D^0D^*+ threshold, and the coupled channel of the isospin partner D^*0D^+ exists above the threshold channel. Similarly, X(3872) is the weakly bound state near the D^0D̅^*0 threshold, and couples to the D^+D^*- channel above the threshold. Both the states decay through the strong interaction. Therefore, to analyze the structure of T_cc and X(3872), we introduce both contributions of the decay and the channel coupling discussed in Sec. <ref>. \n\nAs mentioned in Sec. <ref>, for an unstable state, we need to introduce X̃ in Eq. (<ref>) as the compositeness because the complex compositeness is not interpreted as a probability. For the coupled-channel effect, we define X_1 and X_2 as the compositeness of the threshold and coupled channels, respectively, as in Sec. <ref>. To take into account both the decay and the coupled-channel contributions, we employ X̃_1 and X̃_2 proposed in Ref. <cit.>:\n\n    X̃_j   =|X_j|/∑_j|X_j|+|Z|,   (j=1,2).\n\nX̃_1 and X̃_2 can be interpreted as the probabilities to find the threshold and the coupled-channel components, respectively. \n\n\nFor the numerical calculation, the masses of the D mesons are taken from the Particle Data Group (PDG) <cit.>. We employ the binding energy and the decay width of T_cc from central values of the pole parameters in Ref. <cit.> and those of X(3872) from PDG <cit.>. We use the cutoff Λ=140∼ m_π MeV because π can be exchanged between the D mesons. In this case, the typical binding energy scales are obtained as E_ typ=10.13 MeV and E_ typ=10.14 MeV for the T_cc and X(3872) systems, respectively. \n\nThe coupled-channel and decay effects are characterized by the threshold energy difference Δω and the decay width Γ. In the T_cc case, the energy difference between the threshold channel and the coupled channel is Δω=1.41 MeV, and the decay width is Γ=0.048 MeV. In the X(3872) case, the energy difference is Δω=8.23 MeV, and the decay width is Γ=1.19 MeV. In this way, we have smaller threshold energy difference Δω and decay width Γ for T_cc, and larger Δω and Γ for X(3872) as shown in Fig. <ref>. \n\n\n\n\nIn Fig. <ref>, we plot the compositeness of T_cc [panel (a)] and X(3872) [panel (b)] as a function of the bare state energy ν_0. The solid lines represent X̃_1+X̃_2, and the dotted lines X̃_1. For comparison, we show by the dashed lines X̃_1+X̃_2 with artificially setting Γ=0. In panel (a), the solid line almost overlaps with the dashed line and the deviation of X̃_1+X̃_2 by the decay width is too small to observe. This is because X̃_1+X̃_2 of T_cc dose not change when the narrow decay width (0.048 MeV) is turned on. In contrast, in panel (b), we find a sizable deviation by the decay effect. Although the decay width of X(3872) (1.19 MeV) is small in hadron physics, it is nevertheless larger than the binding energy (0.04 MeV) and the magnitude of the decay effect reflects the ratio of the binding energy to the decay width as we discussed in Sec. <ref>. Next, we consider the effect of the channel coupling, indicated by the difference between the solid and dotted lines. In Fig. <ref>, we see that the difference between those lines is larger in panel (a) than in panel (b). In other words, the coupled-channel contribution X̃_2 of X(3872) is smaller than that of T_cc. This is because the channel-coupling effect is suppressed for X(3872) with the larger threshold energy difference in comparison with the T_cc case. \n\n\nThe concrete value of ν_0 cannot be determined in the effective field theory, unless other physical quantities (such as the scattering length) are given in addition to the eigenenergy. Alternatively, one can employ a specific model to estimate the value of ν_0. For example, the constituent quark model in Ref. <cit.> gives the bare energy of the four-quark state of T_cc as ν_0=7 MeV. From the estimated value of ν_0, one can read off the structure of T_cc and X(3872) from Fig. <ref>. \n\n\nIn summary, the molecular nature of states can be modified by both the decay and the coupled-channel effects even if the pole exists near the threshold, and we need to consider these effects for the quantitative discussion of the compositeness. In particular, the coupled-channel effect should be important for T_cc, and decay width for X(3872) as demonstrated in Fig. <ref>. In fact, the probability to find the model with the composite dominant state P_ comp is obtained as\n\n    P_ comp(T_cc)   =0.55,\n    \n    P_ comp[X(3872)]   =0.41.\n\nThis result shows that the substantial coupled-channel and decay effects can reduce the compositeness of T_cc and X(3872) and the molecular nature is not straightforwardly guaranteed, even though both the states exist within the 1 MeV region from the threshold.\n\n\n\n\n\n§ SUMMARY\n\n\n\n\nWe have discussed the structure of weakly-bound states from the viewpoint of the compositeness. Naively, the states near the two-body s-wave threshold are expected to have a molecule-type composite structure. In this paper, we explicitly demonstrate that it is always possible to construct a weakly-bound non-composite state, but only with a significant fine tuning in the system. In other words, the realization of the non-composite state near the threshold is probabilistically suppressed, in accordance with the low-energy universality. In addition, we quantitatively study how this universal nature of the near-threshold bound states can be modified by the various effects, and examine their implications to the structure of exotic hadrons.\n\n\nWe first construct an effective field theory model with a bare state coupled to a single two-body scattering channel, and evaluate the compositeness of the bound state in this model within the allowed parameter region. It is shown that the bound state in this model is usually an  elementary-dominant state originated from the bare state when the binding energy B is of the order of the typical energy scale of the system, B∼ E_ typ. However, if the binding energy is small (B≪ E_ typ), then the bound state has a high probability of being the composite-dominant state in the parameter region of the model. We quantitatively show that the probability of generating the composite dominant state gradually increases when B decreases, and finally approaches unity in the B→ 0 limit. \n\n\nWhile this simple model captures the essential features of the near-threshold bound states, there are various effects present in the application to the exotic hadrons. We thus generalize the above mentioned model by including the four-point contact interaction, the decay effect, and the coupling to the additional scattering channel. It is shown that the attractive (repulsive) four-point contact interaction increases (decreases) the compositeness of the bound state, because it helps to enhance (suppress) the generation of the molecule component. We show that the decay and coupled-channel effects decrease the compositeness, as they induce the contribution from the other components. The importance of the decay (coupled-channel) effect is characterized by the ratio of the decay width (the threshold energy difference) with respect to the real part of the eigenenergy. \n\n\nFinally, we consider the structure of T_cc and X(3872) in this perspective. It is known that T_cc and X(3872) appear close to the D^0D^*+ and D^0D̅^*0 thresholds, respectively, but both states have a finite decay width and a nearby coupled channel [D^*0D^+ for T_cc and D^+D^*- for X(3872)]. As expected from the small threshold energy difference in T_cc and the sizable decay width of X(3872), we show that the channel coupling to the D^*0D^+ (the decay effect) largely influences the compositeness of T_cc [X(3872)]. In other words, it is important to consider the coupling to D^*0D^+ (the decay effect) to quantitatively study the internal structure of T_cc [X(3872)]. In this way, we expect that the result of this work provides quantitative guidance to pin down the important effects for the discussion of the structure of near-threshold states. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis work has been supported in part by the Grants-in-Aid for Scientific Research from JSPS (Grants\nNo. JP22K03637 and \nNo. JP18H05402). \nThis work was supported by JST, the establishment of university\nfellowships towards the creation of science technology innovation, Grant No. JPMJFS2139.  \n\n\n\n\n\n\n"}