{"entry_id": "http://arxiv.org/abs/2303.07032v1", "published": "20230313114709", "title": "Efficient Light Propagation Algorithm using Quantum Computers", "authors": ["Chanaprom Cholsuk", "Siavash Davani", "Lorcan O. Conlon", "Tobias Vogl", "Falk Eilenberger"], "primary_category": "quant-ph", "categories": ["quant-ph", "physics.app-ph", "physics.comp-ph", "physics.optics"], "text": "\n\n\n\n\n\n\n\n\nchanaprom.cholsuk@uni-jena.de\nAbbe Center of Photonics, Institute of Applied Physics,\nFriedrich Schiller University Jena, 07745 Jena, Germany\n\n\n\nAbbe Center of Photonics, Institute of Applied Physics,\nFriedrich Schiller University Jena, 07745 Jena, Germany\nMax Planck School of Photonics, 07745 Jena, Germany\n\n\nCentre for Quantum Computation and Communication Technology, Department of Quantum Science, Australian National University, Canberra, ACT 2601, Australia\n\n\nAbbe Center of Photonics, Institute of Applied Physics,\nFriedrich Schiller University Jena, 07745 Jena, Germany\nFraunhofer Institute for Applied Optics and Precision Engineering IOF, 07745 Jena, Germany\n\n\nfalk.eilenberger@uni-jena.de\nAbbe Center of Photonics, Institute of Applied Physics,\nFriedrich Schiller University Jena, 07745 Jena, Germany\nMax Planck School of Photonics, 07745 Jena, Germany\nFraunhofer Institute for Applied Optics and Precision Engineering IOF, 07745 Jena, Germany\n\n\n             \n\n\nQuantum algorithms can potentially overcome the boundary of computationally hard problems. One of the cornerstones in modern optics is the beam propagation algorithm, facilitating the calculation of how waves with a particular dispersion relation propagate in time and space. This algorithm solves the wave propagation equation by Fourier transformation, multiplication with a transfer function, and subsequent back transformation. This transfer function is determined from the respective dispersion relation and can often be expanded as a polynomial. In the case of paraxial wave propagation in free space or picosecond pulse propagation, this expansion can be truncated after the quadratic term. The classical solution to the wave propagation requires 𝒪(N log N) computation steps, where N is the number of points into which the wave function is discretized. Here, we show that the propagation can be performed as a quantum algorithm with 𝒪((logN)^2)  single-controlled phase gates,  indicating exponentially reduced computational complexity. We herein demonstrate this quantum beam propagation method (QBPM) and perform such propagation in both one- and two-dimensional systems for the double-slit experiment and Gaussian beam propagation. We highlight the importance of the selection of suitable observables to retain the quantum advantage in the face of the statistical nature of the quantum measurement process, which leads to sampling errors that do not exist in classical solutions.\n\n\n\n\nEfficient Light Propagation Algorithm using Quantum Computers\n    Falk Eilenberger\n    March 30, 2023\n=============================================================\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nRecently major breakthroughs toward outstanding performance in computation, communication, and sensing by leveraging quantum properties have been demonstrated. Although many quantum systems are still under ongoing investigation <cit.>, quantum computers <cit.> have potentially performed tasks or measurements, that cannot be done classically, e.g., in quantum sensing <cit.>, quantum communication <cit.>, and interferometry <cit.>.\n\nQuantum algorithms in particular have been expedited to overcome the boundary of the problems unsolvable by classical computation <cit.> and also speed up  classical algorithms <cit.>. Recent accomplishments in wave physics have e.g. demonstrated quantum advantage for solving the Poisson equation <cit.>, computing the electromagnetic scattering cross sections <cit.>, and simulating non-classical interference phenomena <cit.>. Some of these have demonstrated exponential speedup over the best-known classical algorithms, highlighting the efficiency with which quantum algorithms can treat interference problems.\n\nAmong the most prominent quantum algorithms are those which leverage the quantum Fourier transform (QFT) <cit.> to efficiently convert between real space and Fourier space representations. These include quantum phase estimation (QPE) <cit.>, and Shor's algorithm <cit.> among many others. From a physical point of view, Fourier transformations are a particularly powerful tool to solve linear differential equations, such as those encountered in wave propagation. Hence, solving wave propagation problems in quantum computers is an active area of research, as can be seen from recent works, consisting of wave equations under Dirichlet and Neumann boundary conditions <cit.> and the single-particle Schrödinger equation with various potential barriers <cit.>.\n \nNevertheless, solving the wave propagation for modern optics remains unrealized so far. Unlike prior studies of wave propagation by quantum computers, we herein focus on solving wave propagation from the Helmholtz equation by implementing a Fourier transformation technique inspired by the classical beam propagation method (BPM). Classically, the BPM solves the Helmholtz equation by intermediate transfer of the wavefunction, which is discretized into N points in each dimension, into the Fourier domain using the Fast Fourier Transformation (FFT), the multiplication by a specific transfer function, and subsequent back transformation into real space. By implementing this procedure in quantum computers, we can exploit QFT and the here-demonstrated fast algorithm to implement the polynomial transfer functions to speed up the calculation.\n\nIn addition, in this work, the difference between classical and quantum algorithms is demonstrated and compared. It is shown that only n=log_2N qubits are required to store the complete wavefunction, and we propose a method to implement polynomial transfer functions of order k-th with 𝒪((logN)^k) operations efficiently using a gate-based quantum computation algorithm. This implies the generalization of our QBPM being able to apply for an arbitrary light propagation. For demonstration purposes, we used Qiskit <cit.> to implement the QBPM and simulated it in a noiseless environment, i.e. on a quantum computer simulator. We showcase paraxial wave propagation (k = 2), in both one and two-dimensional environments. That is, we simulated the double slit experiment for one-dimensional propagation and Gaussian beam propagation in two lateral dimensions.\n\n\n\n\n§ CLASSICAL WAVE PROPAGATION\n \nThe propagation of electromagnetic, monochromatic waves  in free space or in an isotropic media is described by the Helmholtz equation,\n\n    ∇^2 U(r,ω)+k^2(ω)U(r,ω) = 0,\n\nwhere U(r,ω) is an arbitrary field and k(ω) is a wave vector, which is based on some dispersion relation ω=ω(k). A typical problem in wave propagation is finding the solution of the wave field  U(r_⊥; z) given a specific wave frequency ω and a known initial value U_0(r_⊥) = U_0(r_⊥;z=0) defined along the transverse coordinates 𝐫_⊥, which are, 𝐫_⊥=x𝐞_x in case of one transverse dimension and  𝐫_⊥=x𝐞_x+y𝐞_y  in case of two.\n\nOne common approach for solving this problem is to first take the Fourier transform of the initial field with respect to the transverse coordinates <cit.> as depicted in Fig. <ref>. In case of a problem with one transverse dimension, this is given as: \n\n    Ũ_0(α)=1/2π∫_-∞^∞U_0(x)e^-iα xdx,\n\nwhere α is the transverse wave number in x direction.  To attain the propagated field in the frequency domain, we need to take the transfer function into account. If the transverse wave numbers are much smaller than the longitudinal wave numbers, i.e. α^2 ≪ k^2, the transfer function can be approximated by a quadratic polynomial, i.e.\n\n    H(α;z,k)    =     e^i√(k^2 - α^2)z\n       ≈    e^ikze^-iα^2/2kz.\n\nThe propagated field in the frequency domain is then given by\n\n    Ũ(α;z)≈Ũ_0(α)e^ikze^-iα^2/2kz,\n\nwhere the first exponent is just a fixed phase and can be ignored for many problems. Likewise, if we consider the dispersion of a temporal pulse, we can expand the dispersion relation into a Taylor series and truncate after the quadratic term, if the pulse is not too short (typically sub-picosecond) and the linear term can be removed by the introduction of a co-moving frame of reference. Finally, we take the inverse Fourier transform to obtain the propagated field in space U(x;z). The generalization of this to two or more transverse dimensions is straightforward.\n\nFor a numerical solution, we discretize the wavefunction U(x) on N equidistant points in space x_γ=γΔx with γ∈ [-N/2,...,0,1,...,N/2-1], such that U^(0)_γ=U_0(γΔx) where U^(0)_γ is the discretized wavefunction. N=2^n is usually selected as a power of two, consistent with the number of qubits n in the quantum algorithm. The Fourier transformation with the FFT algorithm requires 𝒪(N log(N)) steps and yields the discretized Fourier amplitudes Ũ^(0)_γ at the frequencies α_γ=γΔα, where Δα=2π/(NΔ x).\n\nThe solution then requires the multiplication of the transfer function for each discrete frequency H_γ=H(α_γ;z,k), which requires 𝒪(N) steps, yielding the Fourier amplitudes Ũ_γ(z)  and a subsequent application of the inverse FFT to calculate U_γ(z). The overall cost of applying the algorithm is thus 𝒪(N log(N)).\n\nIt should be noted that the algorithm does not find a perfect solution to the Helmholtz equation, because its discretization in real and Fourier spaces imply periodic boundary conditions in both spaces, yielding a non-vanishing discretization error. If an analytic solution I_Ref(x_γ;z), or any other reference solution for a particular initial field is known, we can measure the impact of the error on a wavefunction's intensity using e.g. a root-mean-square-error ϵ(z):\n\n    ϵ(z) = \n    √(∑_γ(I_Ref(x_γ;z)-I_γ(x_γ;z))^2/∑_γ I_Ref(x_γ;z)),\n\nwhere I_Ref(x_γ;z)=|U_Ref(x_γ;z)|^2 is the absolute value square of the analytic solution and I_γ(z)=|U_γ(x_γ;z)|^2 is the absolute value square of the numerically solved discrete solution.\n\nWe shall later see that the QBPM introduces random errors in the measurement process and hence ϵ(z) is a statistically distributed quantity in its own right. Its distribution can be sampled over many repetitions N_sim and described by its mean error μ=ϵ and the standard error σ=(ϵ^2-ϵ^2)^1/2.\n\n\n\n§ QUANTUM ALGORITHM FOR PROPAGATION\n \nTo formulate the quantum algorithm for the wave propagation discussed above, we map the classical BPM steps onto quantum gates. All procedures are illustrated in Fig. <ref>. The step-by-step derivation for our proposed algorithm is as follows.\n\n    \n  * Selection of qubits: we create a wavefunction |ψ⟩ from n=log N qubits, the state of which can be described by an arbitrary superposition of its computational basis states |γ⟩ with γ∈ [-N/2,...,0,1,...,N/2-1], which can be represented as a binary number γ= -a_n-12^n-1 + ∑_j=0^n-2a_j2^j composed of its binary digits a_j∈{0,1} using the two's complement to indicate negative values. Mapping the N point wavefunction onto the n qubits already entails exponential enhancement of memory efficiency.\n    \n  * Initialization: We represent the initial wavefunction U^(0)_γ as |ψ_0⟩=∑_γU^(0)_γ|γ⟩. An efficient solution to this problem is not subject to this work. For the frequently encountered case of Gaussian beams, we can, e.g., make use of the Kitaev-Webb algorithm <cit.>.\n    \n  * Fourier domain: We perform a QFT on |ψ_0⟩ transforming the state into |ψ̃_̃0̃⟩=∑_γŨ^(0)_γ|γ⟩. Note that γ now indicates the wave number index.\n    \n  * Second-order propagation: In the Fourier space, we need to multiply each Ũ^(0)_γ term with the transfer function e^-iα_γ^2/2kz=e^iϕγ^2 with ϕ=-2π^2 z/N^2Δ x^2k. This represents a phase shift, which only depends on the fixed value of ϕ and the square of the state index γ. An efficient implementation can be done by rewriting γ in its binary form. This leads to (See details in Supplementary Material S1):\n    \n    γ^2    =   ∑_j=0^n-14^ja_j\n            +∑_j=0^n-2∑_l=0^j-12^j+l+1a_ja_l - ∑_l=0^n-22^n+la_n-1a_l.\n\n    Note that j and l are qubit indices and that either a_j=1 or a_j=0 for all j.\n\nThis allows for an efficient implementation of the transfer function operator, as we note the summands of the first sum have the value 4^j under the condition that qubit j is in the |1⟩ state and zero otherwise. Likewise, all summands of the middle sum have the value 2^j+l+1 under the condition that the qubit-pair j and l are both in their |1⟩ state and zero otherwise. The last term is for two's complement and of identical structure.\n\nThe multiplication of the transfer operator Û can thus be decomposed into a series of phase gates and single-controlled phase gates, such that |ψ̃(z)⟩=Û|ψ̃_̃0̃⟩.\n\n    Û=∏_j=0^n-1P̂^j(-4^jϕ)∏_j=0^n-2∏_l=0^j-1P̂^jl(-2^j+l+1ϕ)∏_l=0^n-2P̂^(n-1)l(-2^n+lϕ).\n\nHere P̂^j(ϕ)=[       1       0;       0 exp(iϕ) ] acts on the |1⟩ state of the j-th qubit and likewise P̂^jl(ϕ) is the same but also controlled by qubit l.\n\n  * The calculation of the final state |ψ(z)⟩ is done by subsequent application of the inverse QFT (IQFT).\n\n\nBy measuring the final state, we collapse the field into a computational basis state with a probability of collapse being equal to the absolute value square of the wavefunction at this point in space, hence its intensity:\n   \n    p(x=x_γ)=|⟨γ||ψ(z)⟩|^2 ∝ I_γ(z).\n\nThis is equivalent to measuring a single photon in the final wavefield on a camera with N pixels. The complete intensity distribution can be sampled from a series of N_s “single photon clicks\", termed “shots\". If the intensity distribution is not required, but some other measurable is sought-after, then a different approach for measurement may be better suited.\n\nNote, however, that any kind of sampling induces a sampling error, with - as opposed to the discretization error - is statistical in nature. The impact of both types of error can hence be separated from an ensemble average by calculating the statistical features of the RMSE with a fixed number of shots N_s over many simulations N_sim. If the sample based estimator is unbiased then a mean error μ is indicative of the discretization error and the standard error σ is indicative of sampling noise.\n\nBoth QFT as well as the transfer function multiplication operation require 𝒪(n^2) operations, thus the entire calculations scales with  𝒪((log N)^2). As such, the QBPM is exponentially faster than the classical BPM algorithm.\n\nAlthough all above BPM and QBPM are derived based on the second-order approximation, it is crucial to note that our algorithm can also be applied for higher order polynomials α^k, as are required to e.g. model pulse propagation in dispersive media or to go beyond the paraxial approximation for large-angle wave propagation. A general formula can be found in the Supplementary Material S1 and it can be seen that the speedup is still maintained, as the scaling for these operations is 𝒪(n^k).\n\n\n\n§ ONE-DIMENSIONAL PROPAGATION\n \nWe now turn to implementing the above algorithm and presenting the double-slit experiment as a test case to validate the method's functionality and to investigate the relative impact of discretization error μ, which is a generic feature of the discretized solver, vs.  the sampling noise σ, which is a feature of the measurement procedure inherent in quantum computers.\n\nThe initial state was chosen as:\n\n    U_0(x) = 1/√(2w) \n                            1     |x-d/2|≤w/2,    |x+d/2|≤w/2\n    \n                            0    Otherwise.\n\nWhere the separation of the slits d is 0.5 mm, the width of each slit w = 0.1 mm, and the wavelength of the monochromatic light λ = 532 nm. The number of qubits is 15 qubits.\n\nThe intensity pattern at the output is a function of z and the analytical solution is <cit.>:\n\n    I_ref(x;z) = I_0\n        cos^2(πd/λsinθ)\n        ^2(πw/λsinθ),\n\nwhere tanθ=x/z and I_0 is the maximum intensity in the center.\n\n\n\n §.§ Simulated interference pattern and Error analysis\n\n\n\nWe now compare our quantum algorithm to the classical analytic solution for the double-slit experiment. As depicted in Fig. <ref>, we can see the result of the quantum simulation after different z propagation distances compared to the analytical solution. The result agrees well with the expected interference pattern.\n\nBoth discretization error μ and sampling error σ depend on the propagation distance z and the number of shots N_s. In Fig. <ref>(a), both are plotted as a function of the propagation distance. The result indicates that the discretization error increases linearly with the propagation distance, and that it is larger than the sampling error except for z=0. This is an important finding, as it naturally gives a rise to a selection rule for the number of shots N_s,max, beyond which a reduction of the shot noise will not improve overall precision, beyond the systematic discretization error.\n\nFor the given simulation, such a number can be estimated from the data shown in Fig. <ref>(b). While at z=0 the total error can be reduced with the inverse of the square root of N_s to an arbitrarily low value, a minimal error is evident for all z>0.  For all investigated distances this likely occurs in our simulation at N_s,max≈10^6. As a complete reconstruction of the absolute value of the wavefunction by means of sampling does not appear to be a suitable mode of operation for a quantum simulator anyway, a more systematic investigation of this boundary is not undertaken. \n\n\n\n\n§ TWO-DIMENSIONAL PROPAGATION\n \nIn addition to the simulation of one-dimensional propagation as demonstrated in Sec. <ref>, we herein extend our propagation algorithm to two-dimensional propagation and select a Gaussian beam propagation in free space as a case study.\n\n\n §.§ Computational model\n\n The wave function is initialized  by\n\n    U^(0)_γ,ζ = A_0e^-(x_γ-x_0)^2+(y_γ-y_0)^2/w_0^2,\n\nwhere A_0 is the normalization constant and w_0 is the beam waist. As such, here, α and β are discretized by 2πγ/Δ xN and 2πζ/Δ yN, accordingly. In this example, we define the width at focal plane (w_0) at 0.05 m, wavelength (λ) at 532 nm, the number of qubits in each direction set to 5 qubits (10 qubits total), and the Gaussian is centered at the domain's center, such that x_0=y_0=0.\n\nFor two-dimensional propagation, we can straightforwardly add one more coordinate into the circuit as the x and y coordinates are independent of each other.  This implies that all steps remain the same as those of the one-dimensional case, hence the quantum algorithm will be duplicated for the other axis as depicted in Fig. <ref>. It should be noted that the dimensional independence is a feature of the dimensional independence of diffraction and not of the quantum algorithm. However, it can be exploited here, even if the input is not independent in x- and y-directions.\n \nThe Gaussian beam is propagated with the propagating distance (z) as illustrated in Fig. <ref>. It is obvious that when z_r is larger, the Gaussian beam broadens, as expected.\n \n\n\n\n §.§ Observable and Error analysis\n\nAs opposed to the 1D-case, we here aim to highlight the impact of a well-selected observable on the number of shots N_s required for a good estimation of some observable. As a test case, we estimate the beam waist w(z) as shown in Eq. <ref> as a function of the propagation distance,\n\n    w_Q=∑_i=0^N-1∑_j=0^N-1((x_i-x_0)^2 + (y_j-y_0)^2 )P_ij,\n\nwhere x_i and y_j run from 0 to the position domain ranged N. Where at each position (x_i,y_j) we have measured the number of times the circuit collapses into this final state P_ij=N_ij/N_s. We compare it with the value obtained from classical discretized solution as shown below,\n\n    w_ref=∑_i=0^N-1∑_j=0^N-1((x_i-x_0)^2 + (y_j-y_0)^2 )|U_ij|^2,\n\nwhere |U_ij| is the absolute value of the wavefunction. As opposed to the last section we here reference against the discrete approximation; hence the difference ϵ=w_Q-w_ref is exclusively caused by the sampling error. Again, we measure the standard error σ_w=(ϵ^2-ϵ^2)^1/2. Both values depend on the number of shots N_s and the propagation distance z and have been determined from N_sim=100  independent simulations.\n\n\n\nWe now analyze the size of the standard error as a function of the propagation length and the number of shots. This data is displayed in  Fig. <ref>. The data indicates that only N_s=100 already allows for a very good sampling precision of the beam waist radius. If a better approximation is required then the number of shots can be increased, and we observe an increase in precision of  1/N_s. Larger propagation distances inherit the more considerable error, consistent with the 1D case. This shows that the fact, that quantum computers require sampling, does not systematically ill-affect the efficiency of the algorithm; if a sufficiently well-behaved measureable is required, which we argue is a common use case, a very moderate number of shots is sufficient for a good estimation of the measurable.\n\nNonetheless, as the propagation in the 2D case is more sophisticated than that in 1D, we also benchmarked our QBPM among four different cases, consisting of noisy quantum simulator, noiseless quantum simulator, classical discretized algorithm, and classical analytic solution to guarantee the accuracy of our algorithm. All of these comparisons agree well as can be seen in Supplementary Material S2.\n\n\n\n§ CONCLUSION\n \nWe have developed a quantum beam propagation algorithm based on the paraxial approximation. We show that our quantum algorithm can efficiently simulate beam propagation in both one and two dimensions by implementing only phase gates and controlled phase gates with an exponential speedup over the classical solution, based on the fast Fourier transformation. This allows for a low number of qubits and operations used for the propagation when compared with the classical counterpart. We also carry out a rigorous error analysis to give more insights into the role of the sampling error, which is a new source of errors, when quantum computers are used. We analyze two scenarios: the sampling of the absolute value squared of the wavefunction and find that the sampling error falls below the discretization error after only a few thousand shots N_s. In a second scenario, we only analyze a scalar measurable, in this case, the waist of a broadening gaussian beam. Here we find that a very good accuracy can be achieved with only a few hundred shots and hence the quantum advantage can be maintained for a broad range of scenarios.\n\nWe further argue that our work does not merely add one more algorithm to the toolbox of quantum simulation. Instead, it bridges the gap between Fourier optics and quantum computation and lays the foundation for quantum computers as a tool to efficiently simulate more complex problems in photonics, such as Boson sampling or spontaneous conversion in photonic nanostructures.\n\n\nThis work was funded by the Federal Ministry of Education and Research (BMBF) under grant numbers 13XP5053A (NanoscopeFutur-2D) and 13N16292 (ATOMIQS). The authors received funding from the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) - CRC NOA 1375, B3 and Projektnummer 445275953. This research was supported by the German Space Agency DLR with funds provided by the Federal Ministry for Economic Affairs and Climate Action BMWK under grant numbers 50WM2165 (QUICK3). C.C. acknowledges a Development and Promotion of Science and Technology Talents Project (DPST) scholarship by the Royal Thai Government. We acknowledge the use of IBM Quantum services for this work. The views expressed are those of the authors, and do not reflect the official policy or position of IBM or the IBM Quantum team.\n\n\n\n\n\n\n\n\n\n\n"}