{"entry_id": "http://arxiv.org/abs/2303.07363v1", "published": "20230313180001", "title": "Robust Higher-Order Hamiltonian Engineering for Quantum Sensing with Strongly Interacting Systems", "authors": ["Hengyun Zhou", "Leigh S. Martin", "Matthew Tyler", "Oksana Makarova", "Nathaniel Leitao", "Hongkun Park", "Mikhail D. Lukin"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.dis-nn"], "text": "\n\n\n\nDepartment of Physics, Harvard University, Cambridge, Massachusetts 02138, USA\nSchool of Engineering and Applied Sciences, Harvard University, Cambridge, Massachusetts 02138, USA\nDepartment of Chemistry and Chemical Biology, Harvard University, Cambridge, Massachusetts 02138, USA\n\n\n\n\n\n\nDynamical decoupling techniques constitute an integral part of many quantum sensing platforms, often leading to orders-of-magnitude improvements in coherence time and sensitivity. Most AC sensing sequences involve a periodic echo-like structure, in which the target signal is synchronized with the echo period. We show that for strongly interacting systems, this construction leads to a fundamental sensitivity limit associated with imperfect interaction decoupling. We present a simple physical picture demonstrating the origin of this limitation, and further formalize these considerations in terms of concise higher-order decoupling rules. We then show how these limitations can be surpassed by identifying a novel sequence building block, in which the signal period matches twice the echo period. Using these decoupling rules and the resulting sequence building block, we experimentally demonstrate significant improvements in dynamical decoupling timescales and magnetic field sensitivity, opening the door for new applications in quantum sensing and quantum many-body physics.\n\nRobust Higher-Order Hamiltonian Engineering for\n\nQuantum Sensing with Strongly Interacting Systems\n\n    Hengyun Zhou^1, Leigh S. Martin^1, Matthew Tyler^1, Oksana Makarova^1,2, Nathaniel Leitao^1, Hongkun Park^1,3, Mikhail D. Lukin^1\n    March 30, 2023\n=====================================================================================================================================\n\n\n\nIntroduction\nQuantum sensing utilizes quantum particles to probe the properties of the surrounding environment <cit.>. Recent advances in quantum sensing technologies have led to a host of new applications, including probes of magnetism in condensed matter systems <cit.>, nuclear magnetic resonance spectroscopy on the nanoscale <cit.>, as well as in-vivo temperature sensing <cit.>.\n\nKey to unlocking new sensing applications is improvements in metrological sensitivity.\n\nA common way to achieve this is to utilize dynamical decoupling sequences <cit.>, such as XY-8 for non-interacting spins <cit.> or DROID-60 for interacting spin systems <cit.>.\n\nSuch sequences typically consist of a train of spin echo pulses synchronized to the target AC field, as illustrated in Fig. <ref>, which help to isolate the spin system from environmental disorder and certain spin-spin interactions, while maintaining sensitivity to the target signal.\n\nWhile these techniques are already being actively used across a range of different experimental platforms, their ultimate performance and impact on quantum sensitivity limits are not yet fully understood.\n\nIn this Letter, we identify a fundamental limitation associated with the interplay  \nbetween interaction decoupling and sensing in existing pulse sequences, and propose and experimentally demonstrate a class of new pulse sequences that overcomes this limitation.\n\nMore specifically, we show that the full synchronization of the sensing signal with a spin echo building block inevitably contradicts the cancellation of higher-order terms in the effective Hamiltonian, which leads to a fundamental limit on the performance of all existing pulse sequences.\n\nTo circumvent this limitation, we develop a different paradigm for sensing, in which the target sensing signal period is synchronized with twice the spin echo period, allowing one to realize superior sensitivity in experiments.\n\nThis is achieved by developing concise decoupling rules for higher-order contributions to the effective Hamiltonian (see Fig. <ref> for an example), and using them to efficiently screen through large design spaces of pulse sequences.\n\nThis results in better pulse sequences for not only quantum sensing but also dynamical decoupling and Hamiltonian engineering, and we find significantly improved performance compared to the best known pulse sequences in the disorder-dominated regime of interacting spins <cit.>.\n\n\n\nLimits on AC quantum sensing based on conventional decoupling \nThe key idea of this work can be understood by considering a disordered, interacting many-body spin system, with the Hamiltonian given by\n\n    H   =H_signal(t)+H_dis+H_drive(t)+H_int\n       =B(t)∑_i S_i^z+∑_i h_i S_i^z+∑_i [Ω_x(t)S_i^x+Ω_y(t)S_i^y]\n       + ∑_ij[J^I_ij S_i^zS_j^z + J^H_ij(S_i^xS_j^x+S_i^yS_j^y+S_i^zS_j^z)].\n\nThis general form encompasses many physical systems, including dipole-dipole interactions, Rydberg atoms, and superexchange-interacting spins. Here, S_i^x,y,z are spin-1/2 operators, B(t) is the time-dependent sensing target field, h_i is the on-site disorder strength for spin i, Ω_x(t), Ω_y(t) are time-dependent global Rabi drive strengths for the pulse sequence, J_ij^I, J_ij^H are the Ising and Heisenberg interaction strengths between spins i, j.\n\nThe task of quantum sensing with such an interacting quantum many-body system involves the dual challenge of\n\n    \n  * Decoupling strong disorder and interactions as much as possible,\n    \n  * Maintaining maximal sensitivity to the target sensing field under these constraints.\n\n\nIn the interaction picture with respect to the applied drive pulses {P_k}, due to the secular nature of the Hamiltonian <cit.>, the Hamiltonian can be expressed purely in terms of a polynomial of the transformed S^z operator (the “frame\") at a given time, i.e.\n\n    H̃(t)   =H̃(S̃^z(t)),\n    S̃^z(t)   =(P_k-1⋯ P_1)^† S^z (P_k-1⋯P_1)=∑_μ F_μ,kS^μ,\n\nwhere the time t is in between the (k-1)-th and k-th pulse.\n\nFor pulse sequences composed of π/2 and π pulses, we denote these “toggling frame” transformations <cit.> pictorially in Fig. <ref>, where a yellow/green block in row μ=x,y,z, column k signifies F_μ,k=+1 or -1 respectively.\n\nUtilizing this representation, we now show that the conventional way of synchronizing the period of the sensing field with the spin echo period necessarily leads to residual first-order terms in the effective Hamiltonian that, in turn, limit the sensing performance. \n\nThese residual terms can be visualized by the “red dipoles\" in Fig. <ref>(a) for the existing sequence DROID-60, which point from a green block (-1) to a yellow block (+1), and by necessity do not cancel.\n\nSuch terms, present in most currently known AC sensing pulse sequences, result in a fundamental limitation for the sensing protocol.\n\nTo understand how these terms arise, we make use of the Magnus expansion <cit.>, which expresses the effective Hamiltonian over one Floquet period T of the pulse sequence as a series summation, with the leading order terms being\n\n    H^(0)   =1/T∫_0^T H̃(t_1)dt_1,\n    \n        H^(1)   =-i/2T∫_0^T dt_1∫_0^t_1dt_2[H̃(t_1),H̃(t_2)].\n\nThe zeroth-order contribution Eq. (<ref>) naturally suggests a spin echo structure, since disorder is cancelled when ∑_k F_μ,k=0 for each μ∈{x,y,z}, such that the positive and negative disorder contributions along each axis balance each other out.\n\nThis condition can be interpreted by associating, for each axis μ, a positive charge to a yellow block (+1) and a negative charge to a green block (-1). To cancel disorder,  the sum of charges along each axis must be 0.\nGeneralizing this analysis to higher-order terms (see Ref. <cit.> for more details), we focus on one particular first-order term in Eq. (<ref>), involving a commutator between on-site disorder and Heisenberg interactions.\n\nUnder pulse transformations, the disorder term transforms linearly with F_μ,k, while the Heisenberg term is invariant.\n\nConsequently, assuming ideal pulses, we find\n\n    H_dis,Heis^(1)   =-i/2T∑_μ,k(t_k-T/2)τ_k F_μ,k∑_i,j,l[h_i S_i^μ,J_jl^HS⃗_j·S⃗_l],\n\nwhere t_k and τ_k are the center time and duration of the k-th free evolution period, respectively.\n\nFocusing on the frame-dependent coefficients, we find that the contribution is \n\n    H_dis,Heis,μ^(1)∝∑_k (t_k-T/2) τ_k F_μ,k.\n\n\nEq. (<ref>) describes a sum of dipole moments, since it is the charge τ_k F_μ,k multiplied by the position t_k-T/2.\n\nThus, we conclude that cancelling the first order cross-term between disorder and Heisenberg interactions requires the sum of dipoles along each axis to cancel.\n\nIn light of this interpretation, we can re-examine the pulse sequences previously used for AC field sensing.\n\nIn Fig. <ref>(a), we show the recently-developed sequence for interacting spin systems <cit.>, DROID-60, and how its frames and target AC field are synchronized.\n\nAs one can see, the spins flip with the same periodicity as the external magnetic field, and the frames along each axis are always paired up to echo out disorder effects as rapidly as possible.\n\nThis immediately implies that for a given axis, the dipoles are always oriented in the same direction in order for the phase accumulation to coherently add, see the red arrows in Fig. <ref>(a).\n\nThus, with these pulse sequence structures, maintaining AC field sensitivity always comes at the expense of introducing first order imperfections, which will directly affect the coherence time and subsequently the sensitivity of the sequence.\n\nSystematic Higher-Order Sequence Design\nTo overcome this conflict, we start by systematically incorporating higher-order decoupling conditions (see Ref. <cit.> for a full derivation) into sequence design, resulting in dynamical decoupling sequences with much better coherence properties, but are not yet compatible with sensing.\n\nWe will then present a novel sequence building block (Fig. <ref>(b)) that respects the sensing constraints, which allows us to obtain maximal sensitivity to the target sensing field while retaining higher-order decoupling performance.\n\nWe focus on the regime where the on-site disorder is dominant over spin-spin interactions, as is typically the case for electronic spin ensembles <cit.>.\n\nWe numerically simulate the performance of dynamical decoupling pulse sequences designed with different numbers of decoupling rules imposed, using parameters drawn from the experimental system in Ref. <cit.>.\n\nWe simulate the decay of a polarized initial state along x̂, ŷ or ẑ after different numbers of repetitions of the full pulse sequence.\n\nThe fitted characteristic decay timescales after subtracting out any long-time plateaus (for example, due to residual disorder pinning) are histogrammed in Fig. <ref>(a) for different sequence design methods, highlighting the progressive improvement in performance as higher-order terms are included.\n\nWe start by randomly generating pulse sequences with 24 free evolution frames, where all zeroth-order robust Hamiltonian engineering rules (see Ref. <cit.>) have been included, but no higher-order rules, as illustrated by the blue bars in Fig. <ref>(a), resulting in a typical decay timescale on the order of 5 μs.\nNext, we enforce that various higher-order terms are zero (see Ref. <cit.>), with the most crucial ones being first-order cross-terms between disorder and Heisenberg interactions (the “dipole rule\" described above), as well as second-order terms originating purely from disorder.\n\nThis significantly reduces the sequence search space, allowing us to exhaustively search through pulse sequences up to length 24.\n\nThis extends the decay time out to the orange bars.\n\nCrucially, it removes the sequences that had relatively short decay times, revealing the longer lived ones.\nFinally, we apply a further layer of symmetrization to the pulse sequence, where the frame ordering is reversed and sign flipped in the second half of the sequence.\n\nThis further improves the decay times, as seen in the yellow distribution of Fig. <ref>(a), with a long tail extending to the right.\n\nThe longer timescales also imply that certain higher-order imperfections that may be dominant when performing general Hamiltonian engineering are also systematically removed.\n\nIn the inset of Fig. <ref>(a), we show a direct comparison between the previous best sequence in this parameter regime, DROID-60 <cit.>, designed with zeroth-order rules and the same symmetrization methods, and a new sequence DROID-R2D2 (Disorder RObust Interaction Decoupling - Robust To Disorder 2nd order) that accounts for higher-order rules.\n\nAs one can see, the best symmetrized higher-order pulse sequences show almost an order of magnitude improvement in decay time compared to prior sequences that only include zeroth-order terms (for the simulation parameters mentioned above, DROID-R2D2 has 1/e decay time 390 μs, compared to 64 μs for DROID-60).\n\nThis highlights the power of systematically including higher-order rules in the sequence design.\n\nSurpassing the AC Sensing Limit with Higher-Order Sequence Design\nAlthough incorporating higher-order decoupling conditions improves coherence times for dynamical decoupling, it does not fully overcome the conflict between sensing and interaction decoupling.\n\nThis is because as described above, when the spins flip with the same periodicity as the magnetic field, maintaining AC field sensitivity always results in residual first-order imperfections in the form of “dipole-rule\" violations in Eq. (<ref>).\n\nTo address this challenge, we devise a new strategy for the design of AC sensing pulse sequences that overcomes this conflict between sensing and decoupling.\n\nInstead of requiring the frame flips to be commensurate with the AC signal, the key idea is to design the frame flips to be at twice the rate of the AC signal.\n\nBy moving between frames on different axes, it is possible to continue to coherently accumulate phase for interaction-decoupling AC sensing sequences in this case.\n\n\n\nFig. <ref>(b) illustrates a representative sequence designed in this way, which we name DIRAC2 (DIsorder Robust AC sensing of period 2).\n\nIn this sequence, the yellow and green blocks for the frame matrix are lined up with positive and negative values of the target AC signal, respectively, indicating coherent phase addition and maximal sensitivity.\n\nIn addition, the dipoles along each axis cancel each other out, indicating that first-order disorder-Heisenberg interaction cross-terms mentioned in Eq. (<ref>) are fully suppressed.\n\nMoreover, the faster flipping rate of the frames relative to the AC signal has the added benefit that for the same target signal, this pulse sequence is more effective in decoupling time-varying noise, which can lead to further performance improvements.\n\nFinally, this sequence also incorporates a number of other higher-order considerations and symmetrizations described in the previous section to further boost performance.\nIndeed, in Fig. <ref>(b), we simulate the performance of different decoupling sequences with the same parameters as the preceding section, where we find that DIRAC2 can outperform the best known decoupling sequences for interacting spin ensembles (DROID-60) by an order of magnitude.\n\nExperimental Performance of Higher-Order Sequences\nTo verify the performance of our new methods, we experimentally implement these decoupling and sensing sequences in a high-density ensemble of nitrogen-vacancy (NV) centers in diamond, see Ref. <cit.> for more details of the experimental system.\nFirst, we compare the performance of our new dynamical decoupling sequence DROID-R2D2 against the previous best sequence DROID-60 in Fig. <ref>(a), where we prepare an x̂ initial state, decouple with either the DROID-60 or DROID-R2D2 sequence for a period of time, and measure the final polarization along the x̂ axis.\n\nThe total measurement window is held constant to normalize out charge dynamics and T_1 decay effects, and focus on decoupling performance.\n\nThe higher-order sequence DROID-R2D2 that we design here considerably outperforms the best known sequence DROID-60 (15 μs vs. 9 μs), although technical imperfections still limit the achievable coherence times to be shorter than simulations for both sequences.\n\nHaving shown that higher-order sequence design improves dynamical decoupling, let us now compare the performance of different sensing sequences.\n\nFor the comparison, we choose a target signal frequency of (2π)× 7 MHz, a π pulse time of 10 ns, and a free evolution time τ=61 ns for XY-8, DROID-60, τ=25 ns for DIRAC2, in order to synchronize the sequence and sensing signal.\n\nIn Fig. <ref>(b), we show the inverse sensitivity (the higher the better) for each of the sequences, as a function of the total phase accumulation time.\n\nThe sensitivities under optimal measurement conditions in this sample, i.e. the highest point on each curve, were η_XY-8=151± 2  nT/√(Hz) for the XY-8 sequence, η_DROID=90± 2  nT/√(Hz) for the DROID-60 sequence, and η_DIRAC=58± 4  nT/√(Hz) for the DIRAC2 sequence.\n\nThus, while DROID-60 outperforms the non-interacting sensing sequence XY-8, DIRAC2 achieves yet another significant improvement over DROID-60, achieving close to a factor of 3 improvement in sensitivity over the conventional sensing sequence XY-8.\n\nThis is because the combination of suppressed higher-order terms and faster decoupling results in longer coherence times, while maintaining a similar rotation rate under the target field.\n\n\n\n\nDiscussions and Outlook\nIn this work, we identified a key limitation of existing pulse sequences for dynamical-decoupling-based quantum sensing, and devised a novel higher-order Hamiltonian engineering method to overcome these limitations.\n\nWe implemented these sequences experimentally, resulting in significant improvements in AC magnetic field sensitivities using these techniques.\n\nThese gains in sensitivity can be immediately translated to nanoscale NMR experiments, as recently demonstrated with DROID-60 in Ref. <cit.>.\n\nIn addition to extending coherence times for sensing sequences, these techniques are also important in extending coherence times for dynamical decoupling and removing systematic artifacts when engineering desired target many-body Hamiltonians <cit.>.\n\nThe analytical insights developed here provide simple geometric intuitions for various higher-order decoupling rules, which significantly simplify the design and optimization process. We expect that our techniques can be readily extended to even higher-order contributions.\n\nMoreover, it will also be interesting to explore the application of these ideas to spin systems in other parameter regimes, such as Rydberg atoms <cit.>, nuclear magnetic resonance <cit.>, and trapped ions <cit.>, or higher spin systems <cit.>.\n\nFinally, our results provide an important tool for the reliable engineering of many-body Hamiltonians, free of higher-order artifacts, opening the door to exploration of exotic driven phases of matter and creation of entangled quantum states for quantum metrology <cit.>.\n\nAcknowledgements\nWe thank J. Choi, H. Gao, N. Maskara for helpful discussions. This work was supported in part by CUA, ARO MURI, DARPA DRINQS, Moore Foundation GBMF-4306, NSF PHY-1506284.\n\n\n\n"}