{"entry_id": "http://arxiv.org/abs/2303.07025v1", "published": "20230313114237", "title": "Experimental investigation of the effect of topological insulator on the magnetization dynamics of ferromagnetic metal: $BiSbTe_{1.5}Se_{1.5}$ and $Ni_{80}Fe_{20}$ heterostructure", "authors": ["Sayani Pal", "Soumik Aon", "Subhadip Manna", "Sambhu G Nath", "Kanav Sharma", "Chiranjib Mitra"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nCorresponding author:chiranjib@iiserkol.ac.in\n\n Indian Institute of Science Education and Research Kolkata,\n\n Mohanpur 741246, West Bengal, India\n\n \n\n\n\n             \n\n\nWe have studied ferromagnetic metal/topological insulator bilayer system to understand magnetization dynamics of ferromagnetic metal (FM) in contact with a topological insulator (TI). At magnetic resonance condition, the precessing magnetization in the metallic ferromagnet (Ni_80Fe_20) injects spin current into the topological insulator (BiSbTe_1.5Se_1.5), a phenomenon known as spin-pumping.  Due to the spin pumping effect, fast relaxation in the ferromagnet results in the broadening of ferromagnetic resonance linewidth (Δ H). We evaluated the parameters like effective Gilbert damping coefficient (α_eff), spin-mixing conductance (g_eff^↑↓) and spin current density (j_S^0) to confirm a successful spin injection due to spin-pumping into the BiSbTe_1.5Se_1.5 layer. TIs embody a spin-momentum locked surface state that span the bulk band-gap. It can act differently to the FM magnetization than the other normal metals. To probe the effect of topological surface state, a systematic low temperature study is crucial as surface state of TI dominates at lower temperatures. The exponential growth of Δ H for all different thickness combination of FM/TI bilayers and effective Gilbert damping coefficient (α_eff) with lowering temperature confirms the prediction that spin chemical bias generated from spin-pumping induces surface current in TI due to spin-momentum locking. The hump-like feature of magnetic anisotropy field (H_K)of the bilayer around 60K suggests that the decrease of interfacial in-plane magnetic anisotropy can result from exchange coupling between the TI surface state and the local moments of FM layer.\n\n\nValid PACS appear here\n                             \n\n                              \nExperimental investigation of the effect of topological insulator on the magnetization dynamics of ferromagnetic metal: BiSbTe_1.5Se_1.5 and Ni_80Fe_20 heterostructure\n    Sayani Pal, Soumik Aon, Subhadip Manna, Sambhu G Nath, Kanav Sharma & Chiranjib Mitra\n    March 30, 2023\n=======================================================================================================================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nSpintronics is one of the emerging fields that has witnessed remarkable progress on both fundamental and technological fronts over the past couple of decades. Phenomena like spin-orbit torque <cit.>, spin hall effect<cit.>, giant magnetoresistance <cit.>, tunnelling magnetoresistance <cit.>, domain wall motion <cit.> provide basics for applications in memory devices<cit.>, storage technology<cit.>, logic gates <cit.> and magnetic sensors <cit.>. These devices utilise the spin degrees of freedom of electron and their interaction with orbital moments through spin-orbit coupling. Complete knowledge on the process of generation, manipulation and detection of spin degrees of freedom or the spin current is essential for widespread applications in this field. If one focuses on the currently available spin current generation processes, spin-pumping <cit.> is definitely the most efficient method among them where the precessing magnetization of ferromagnetic (FM) layer in a ferromagnetic multilayer device injects spin current into the adjacent layer by transferring spin angular momentum. The concern now should be on spin pumping with new materials <cit.> having large spin torque, essential for significant spin-charge interconversion. Topological insulators (TI) are the new class of materials that have strong spin-orbit coupling (SOC) <cit.>, capable of exerting spin-orbit torque (SOT) to the magnetic moments of ferromagnet which is essential for spintronic applications<cit.>.\n\nThree-dimensional(3D) TIs have received considerable attention for several possibilities in many scientific arenas including spintronics <cit.>. 3D TIs have an insulating bulk with a narrow band gap and gapless two-dimensional (2D) spin polarized surface states. Conduction electrons on the surface state of TI behave as Dirac fermions whose direction of motion is uniquely specified by its spin direction due to spin-momentum locking <cit.>. There has been a significant development in the field of spin-transport phenomenon in FM/TI systems in recent years. Effect of spin pumping can be witnessed in the enhanced Gilbert damping coefficient (α_eff) value of the ferromagnet. The enhancement is governed by spin-torque parameter of the interface or the mixing conductance (g_eff^↑↓). Spin transfer at the interface is believed to be analogous to scattering in transport theory. Once the spin current reaches the TI layer, it starts loosing the spin polarization there due to spin diffusion. The mechanism of spin diffusion into TI should affect the magnetization of FM differently than normal metal because of the exotic nature of TI surface state. For a complete understanding of the effect TI surface state on FM magnetization dynamics, low temperature study is necessary because surface state of TI dominates at lower temperatures.\n\nIn this paper, we present the study of spin-pumping from Ni_80Fe_20 into BiSbTe_1.5Se_1.5. We confirm a successful spin injection into the BiSbTe_1.5Se_1.5 layer from the obtained values of the spin-transport parameters like α_eff, g_eff^↑↓ and spin current density (j_s^0) in our experiment. In low temperature measurements of FWHM and Gilbert damping coefficients we have witnessed exponential enhancement at lower temperatures which has a connection with the spin chemical bias induced surface current in TI. For further investigation of the effect of TI surface state on the FM magnetization we have done low-temperature measurements of effective magnetization and anisotropy field. The anisotropy field of in-plane magnetization shows a hump-like pattern around 60K and then decreases with further decrease in temperature. It supports the theory of exchange coupling between the TI surface state and FM layer which acts normal to the TI/FM interface.\n\n\n\n\n§ SAMPLE PREPARATION AND CHARACTERIZATION\n\nFor this particular work, we have prepared different thickness combinations of topological insulator(TI)/ferromagnet(FM) bilayer heterostructure. BiSbTe_1.5Se_1.5(BSTS) has been taken as the TI material and Permalloy(Ni_80Fe_20) has been used as the ferromagnetic material. BSTS thin films were grown on silicon (Si 111) substrate using pulsed laser deposition(PLD) technique <cit.>. The target material was prepared using 99.999% pure Bi, Sb, Te, and Se in a 1:1:1.5:1.5 stoichiometric ratio. The films were deposited through ablation of the target by a KrF excimer laser (248 nm, 25 ns pulsed width) at a low repetition rate of 1Hz and 1.2 J cm^-2 laser fluence keeping the substrate temperature fixed at 250^0 C and the chamber partial pressure at 0.5 mbar (base pressure 2 × 10^-5 mbar) with a continuous flow of Ar gas. After deposition, TI films were immediately transferred into the thermal evaporation chamber for ferromagnet deposition. Commercially available 99.995% pure permalloy (Ni_80Fe_20) pallets were used for deposition.  Py film was deposited <cit.> on top of TI film at a rate of 1.2Å (crystal monitor: Inficon SQM 160) keeping the chamber pressure fixed at 1× 10^-6 torr (base pressure 1× 10^-7 torr). For characterization of the films X-ray diffraction analysis (XRD), field emission scanning electron microscope (FE-SEM) imaging and atomic force microscopy (AFM) facilities have been used. X-ray reflectometry technique has been used for thickness measurements here. For convenience we are defining the BSTS of different thickness as follows: 10nm BSTS as BSTS1, 21nm BSTS as BSTS2, 28nm BSTS as BSTS3, 37nm BSTS as BSTS4.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n\n\n\n§ RESULTS AND DISCUSSION\n\n\n\n\n\nFor a systematic study of FM/TI bilayer system, we have done in-plane FMR measurements in reflection mode geometry using a short circuited CPW as shown in fig.<ref>. We have shown typical FMR signal at different microwave frequencies for Py(15nm)/BSTS1 sample in fig.<ref>a, frequency dependence of the field linewidth (Δ H vs. f) in fig.<ref>b and the resonance field (f vs H) in fig.<ref>c. These give us valuable information about the magnetization dynamics in ferromagnet which can be described within the framework proposed by Landau, Lifshitz and Gilbert, \n\n    dM⃗/dt=-γM⃗×H⃗_⃗e⃗f⃗f⃗ + α_eff/M_SM⃗×d M⃗/dt\n\nwhere, γ is the gyromagnetic ratio, M⃗ is the magnetization vector, M_S is the saturation magnetization, H_eff is the effective magnetic field which includes the external field, demagnetization and crystalline anisotropy field and α_eff is the effective Gilbert damping coefficient of the system.\nFor a given magnetic material at ferromagnetic resonance, the resonance field and frequency follows Kittel equation<cit.> given by,\n\n    f=γ/2π√((H+H_k)(H+H_k+4π M_eff))\n\nwhere H, H_k and 4π M_eff are the external applied field,  magnetic anisotropy field and effective magnetization respectively. We have obtained H_k and 4π M_eff for different FM/TI bilayer systems by fitting the Kittel equation to the f vs. H curve as shown in fig.<ref>c. The obtained 4π M_eff value contains saturation magnetization(4π M_s) and other anisotropic contributions. We can evaluate 4π M_s value by analysing the thickness dependent measurement of 4π M_eff of the FM layer. In the lower thickness region of the ferromagnetic thin films, 4π M_eff is inversely proportional to the film thickness and follows the equation<cit.>,\n\n    4π M_eff=4π M_s -2K_s/M_s d\n\nwhere K_S is the surface anisotropy constant and d is the thickness of the FM film.\nThe slope of the linear fit gives the anisotropy field contribution to 4π M_eff and the intercept gives the 4π M_s value as shown in fig.<ref>d. The 4π M_eff does not depend on the thickness variation of BSTS at room temperature. The 4π M_s value for bare Py and Py/BSTS bilayer sample is 10.7kOe and 8.48 kOe respectively. The K_s value have decreased from 0.092 ± 0.008 erg/cm^2 in bare Py film to 0.091 ± 0.015 erg/cm^2 in Py/BSTS2 bilayer. So interfacial anisotropy constant,K_i(=K_s^Py/TI-K_s^Py) for the Py/BSTS2 sample is -0.001 erg/cm^2. From the negative value of K_i we can ensure an in-plane magnetic anisotropy (IMA) in the Py/BSTS interface at room temperature. A detailed discussion of IMA has been provided in the last section where the temperature variation of H_k is discussed.\n\nThe damping coefficient can be determined by analysing the FMR linewidth (Δ H) at different frequencies. Δ H is the full linewidth at half maximum of the FMR absorption spectra. It contains both the intrinsic and extrinsic contributions to the damping. Linewidth due to intrinsic Gilbert damping(α_eff) is directly proportional to the resonance frequency(f) and follows the equation<cit.>,\n\n    Δ H=Δ H_0+(2πα_eff/γ) f\n\n\n\n\n\n\nHere Δ H_0 describes inhomogeneous linewidth broadening due to different extrinsic contributions like magnetic inhomogeneities, surface roughness and defects in the sample. We have evaluated the α_eff values by fitting the Δ H vs f curve for different FM/TI systems as shown in fig.<ref>b. This α_eff consists of Gilbert damping in the bulk ferromagnet(α_FM) and the enhanced damping(Δα_SP) resulting from spin pumping into the adjacent TI layer <cit.>.\n\n    α_eff=α_FM+Δα_SP\n\nIn FM/NM heterostructure, spin current arises in the non magnetic layer as FM magnetization precession pumps spin angular momentum into the NM layer and the spin chemical potential gradient due to spin flip relaxation in NM aids the spin angular momentum transfer. This cost of angular momentum in the magnetic layer is brought about by the rapid relaxation of magnetization precession which in turn is enabled by the resonance (FMR) condition, where the angular momentum transfer is maximum. The associated spin current is related to the rapidly decaying magnetisation precession (dM⃗/dt) which in turn exerts a further torque M⃗×d M⃗/dt that is related to the net spin current (I_S) into the FM. Thus the dynamics of magnetization in TI/FM bilayer system can be modelled <cit.> as follows by incorporating this additional torque term into the original LLG equation,\n\n    dM⃗/dt=-γM⃗×H⃗_eff + α_FMM⃗×d M⃗/dt +  γ/M_S VI⃗_S\n\nwhere\n\n    I⃗_S ∝M⃗×d M⃗/dt\n\nI_S is the net spin current (I_S^pump-I_S^back) pumped into the TI layer. I_S contains the FM magnetization precession induced spin pump current (I_S^pump) into the NM as well as the spin accumulation driven spin back flow current (I_S^back) into the FM. A non magnetic layer is not an ideal spin sink. So spin accumulation in the NM layer creates a non-equilibrium chemical potential imbalance near the interface which results I_S^back into the FM. The spin-back-flow current reduces the total spin-pump current generated by the magnetization precession.\n\nWe can extract the α_FM value from the total α_eff value by performing the FM thickness(t_FM) dependent measurement of α_eff for a particular thickness of the TI layer. α_eff varies linearly with the inverse thickness of the ferromagnet<cit.> as shown in the following equation,\n\n    α_eff=α_FM+gμ_B/4π M_s t_FM g_eff^↑↓\n and\n\n    Δα_SP=α_SP/t_FM=gμ_B/4π M_s t_FM g_eff^↑↓\n\nwhere, g,μ_B and g_eff^↑↓ are the g-factor, Bohr magneton and the effective spin mixing conductance respectively. The conductance parameter, g_eff^↑↓ governs the transport of spin current into the adjacent NM layer from FM and is proportional to the torque acting on the FM in the presence of spin accumulation in the NM layer. The derivation of g_eff^↑↓ is based on the magnetoelectronic circuit theory <cit.> for spin transport at the FM/NM interface. In fig <ref>a we can see the linear fit of α_eff vs t_FM^-1. In this heterostructure, damping coefficient value for all the different thicknesses of the Py got enhanced in comparison to our previously reported <cit.> α value for bare Py thin films where the obtained value of α was in the range of 0.004 to 0.008 . This clearly gives the evidence of spin injection into the BSTS layer from the Py layer due to spin pumping. Here the α_FM and α_SP values obtained for Py/BSSTS2 from the linear fit (Eq.<ref>) are 0.00639± 0.0009 and 0.15102± 0.0204 nm respectively. Using the 4π M_s value obtained from Eg.<ref> we can determine the g_eff^↑↓ value. We obtained  g_eff^↑↓=0.526× 10^19±0.071 × 10^19 m^-2 for the Py/BSTS bilayer film using Eq.<ref>. It is in the range of previously reported  g_eff^↑↓ value of other combination of ferromagnet and TI bilayer structures <cit.>. We can also calculate the spin current density(j_s^0) of the FM/TI heterostructure using the g_eff^↑↓ value in the following equation<cit.>:\n\n    j_s^0=g_eff^↑↓γ^2 h_m^2ħ[4π M_s γ+√((4π M_s)^2 γ^2+4ω^2)]/8πα^2[(4π M_s)^2γ^2+4γ^2]\n\nHere γ, h_m, ħ, ω, α are the gyromagnetic ratio, microwave magnetic field, Planck's constant, Larmour precession frequency and effective Gilbert damping parameter respectively. Using Eq.<ref> the j_s^0 value for Py/BSTS2 was calculated to be 0.978× 10^6± 0.133×10^6 Jm^-2 in our experiment. For this particular bilayer system of Py and BSTS2, the value of spin-mixing conductance and spin current density do not differ significantly from the other high SOC heavy metals <cit.>. But studies on CoFeB/BS by Jamali et al. found the g_eff^↑↓ and j_s^0 value to be in the range of 1.2-14× 10^19 m^-2 and 2.6-10× 10^6 Am^-2 respectively <cit.>. They suggest that the interfacial SOC can enhance the pumped surface current into the TI and depending upon the strength of SOC of the surface state one can get lager spin mixing conductance. There are not many theories which can explain the spin-pumping formalism that explicitly includes the SOC at the interface of FM/TI. We believe that in our case the spin injection into the TI layer is largely influenced by the interface.\n\n\n\n\nIn the next section, we report the TI thickness-dependent study of α_eff to understand how the surface and bulk of TI affect the magnetization damping of FM at room temperature. For non-magnetic metals (NM), α_eff in general increases exponentially with increasing NM thickness and then gets saturated after reaching a certain thickness value of NM. It can be described by the conventional spin diffusion theory <cit.> for FM/NM where the relaxation of spin current in the NM layer was assumed solely as a property of NM material. Later the theory was modified by including the FM/NM interfacial spin-orbit interaction (SOI) in the formulation. But a TI/FM heterostructure does not necessarily fit the equation proposed by Tserkovnyak et al. as the topological surface state (TSS) and bulk can influence the spin transfer mechanism differently than NM. One can see from fig.<ref>b that for bilayer structures of Py(15nm)/BSTS2(t) there is a sudden jump of α_eff from the α_FM value, 0.0074 and then with the thickness variation of TI layer in the range of 10nm to 37nm, α_eff increases slowly from 0.015 to 0.02. The TI thickness dependence of α_eff for Py(15nm)/BSTS(t) bilayer is almost linear. It indicates an efficient spin-sink nature of the TI bulk with increasing thickness at least at room temperature <cit.>.\n\nIn the final section, we have focused on low-temperature measurements to understand the effect of topological surface state on magnetization relaxation. We performed temperature dependent study of FMR linewidth (FWHM), enhanced Gilbert damping coefficient(α_eff), anisotropy field (H_k) and effective magnetization (4π M_eff). For different thickness combinations of Py/BSTS bilayer, we obtained the Δ H variation with temperature. It enhances exponentially with decreasing temperature that fits exp(-T/T_0) as shown in fig.<ref>. The characteristic temperatures for T_0 are 74.45± 6.89 K, 52.25± 3.61 K and 60.76± 4.46 K for Py(15nm)/BSTS3, Py(15nm)/BSTS2 and Py(20nm)/BSTS2 respectively. For bare Py(15nm) film, we can note that there is no significant variation in Δ H at low temperatures compared to the TI/FM bilayers <cit.>. For further understanding, the temperature variation of α_eff has also been studied for Py(20nm)/BSTS2 as shown in fig. <ref>b). From the enhancement of α_eff value for Py(20nm)/ BSTS2, the spin pumping effect is very evident even at room temperature. At low temperatures, the enhancement in α_eff is even more pronounced and increases exponentially with decreasing temperature. Comparing the afore-mentioned low temp behaviour of Δ H and α_eff with the resistivity vs. temperature data of BSTS2 we can say that the enhancement is most prominent at the lower temperature region where the surface state of TI starts to dominate. The low temperature behaviour of α_eff and Δ H is in line with the model given by Abdulahad et al. <cit.>. The spin chemical potential bias due to spin-pumping of FM can generate pure spin current into the bulk of TI and spin current along the surface of TI. The injected spin current subsequently gets converted into charge current  due to spin momentum locking property of the surface state of TI. We attribute the origin of exponential increase of α_eff and Δ H at lower temperature to the spin chemical potential bias induced surface current in TI. The increased surface current into the TI at lower temperature corresponds to the rapid relaxation of magnetization precession of FM which reflects in the exponential increase of FMR linewidth and damping constant of the ferromagnet.\n\nTo further investigate the effect of TI surface state on the magnetization of FM, we studied the temperature variation of 4π M_eff and H_k for Py(20nm)/BSTS2. In fig.<ref>a, 4π M_eff increases monotonically as saturation magnetization increases with lowering temperature, except for the temperature range of 130K to 50K. The anomaly in 4π M_eff is related to the anisotropy energy of the FM. It reflects in fig.<ref>b where we can see a hump-like feature of H_K in the same temperature region as that of 4π M_eff. The temperature variation of H_k is concomitant with the resistivity vs temperature behavior of the BSTS2 sample. At room temperature, there is an in-plane magnetic anisotropy (K_i=-0.0011erg/cm^2) that we already have evaluated from Eq.<ref> before. From the fig.<ref>b we can see that IMA increases with lowering temperature until a certain temperature (around 70K) is reached. As temperature goes down below 70K, the in-plane magnetic anisotropy (IMA) becomes weaker. The decrease in IMA can be justified with the argument proposed by Abdulahad et al. <cit.>. Several theoretical as well as experimental predictions confirm the existence of gapless topological surface states even after transition metal deposition on TI <cit.>. These surface states can couple with the local moments of the FM layer through exchange interaction without any long-range ferromagnetic order. According to model given by Abdulahad et al. this exchange coupling acts perpendicular to the TI surface. Due to the exchange interaction between the FM layer and TI surface state, the IMA can decrease at low temperatures where the surface state dominates and the surface state dominance of the TI can be witnessed in the same temperature region (fig.<ref>a) below which the IMA starts getting weaker.\n\n\n\n\n\n\n\n\n\n§ CONCLUSIONS\n\nIn summary, by measuring the parameters like enhanced Gilbert damping coefficient, spin mixing conductance and spin current density, we can conclude a significant spin pumping into BiSbTe_1.5Se_1.5 from Ni_80Fe_20. However, to understand the surface and/or bulk state contribution of TI, low temperature measurements were necessary as surface state dominates at low temperature that we have seen from resistivity vs temperature data of BSTS. Our experiment shows an exponential growth of FWHM and effective damping coefficient with decreasing temperature. The magnetic anisotropy field and effective magnetization show anomaly in a particular temperature region. Both the results are concomitant with the resistivity data of the TI sample, BSTS. From the low temperature data, we can conclude that a combined effect of spin-pumping induced surface current in TI and the exchange interaction between the surface state of TI and ferromagnetic layer are responsible for such behaviour of the heterostructure. Our results supports the model proposed in a previous literature by Abdulahad et al. \n \n\n\n§ ACKNOWLEDGEMENTS\n\nThe authors sincerely acknowledge the Ministry of Education, Government of India and Science and Engineering Research Board (SERB) (grant no: EMR/2016/007950), and Department of Science and Technology (grant no. DST/ICPS/Quest/2019/22)\nfor financial support. S.P. acknowledges the Department of Science and Technology(DST)-INSPIRE fellowship India, S. A. acknowledges the Ministry of Education of the Government of India, and S.M. acknowledges the Council Of Scientific and Industrial Research(CSIR), India, for research fellowship. The authors would like to thank Dr. Partha Mitra of the Department of Physics, Indian Institute of Science Education and Research Kolkata, for providing the lab facilities for sample deposition. The authors would like to acknowledge Prof. Anjan Barman of the Department of Physics, SN Bose National Centre for Basic Sciences for allowing thickness measurements using the XRR facility in their institute.\n\n\n\n\n\n\n\n40\n\n\nI1Žutić, I., Fabian, J. and Sarma, S.D., 2004. Spintronics: Fundamentals and applications. Reviews of modern physics, 76(2), p.323.\nI2Manchon, A. and Zhang, S., 2009. Theory of spin torque due to spin-orbit coupling. Physical Review B, 79(9), p.094422.\nI3Liu, L., Moriyama, T., Ralph, D.C. and Buhrman, R.A., 2011. Spin-torque ferromagnetic resonance induced by the spin Hall effect. Physical review letters, 106(3), p.036601.\nI4Xiao, J.Q., Jiang, J.S. and Chien, C.L., 1992. Giant magnetoresistance in nonmultilayer magnetic systems. Physical Review Letters, 68(25), p.3749.\nI5Sharma, M., Wang, S.X. and Nickel, J.H., 1999. Inversion of spin polarization and tunneling magnetoresistance in spin-dependent tunneling junctions. Physical Review Letters, 82(3), p.616.\nI6Ryu, K.S., Thomas, L., Yang, S.H. and Parkin, S., 2013. Chiral spin torque at magnetic domain walls. Nature nanotechnology, 8(7), pp.527-533.\nI7Sabpreet Bhatti, Rachid Sbiaa, Atsufumi Hirohata, Hideo Ohno, Shunsuke Fukami, S.N. Piramanayagam, Spintronics based random access memory: a review, Materials Today,\nVolume 20, Issue 9, 2017, Pages 530-548, ISSN 1369-7021,https://doi.org/10.1016/j.mattod.2017.07.007\nI8Yakout, S.M., 2020. Spintronics: future technology for new data storage and communication devices. Journal of Superconductivity and Novel Magnetism, 33(9), pp.2557-2580.\nI9Patil, S., Lyle, A., Harms, J., Lilja, D.J. and Wang, J.P., 2010, October. Spintronic logic gates for spintronic data using magnetic tunnel junctions. In 2010 IEEE International Conference on Computer Design (pp. 125-131). IEEE.\nI10Bertram, H.N., Safonov, V.L. and Jin, Z., 2002. Thermal magnetization noise, damping fundamentals, and mode analysis: application to a thin film GMR sensor. IEEE transactions on magnetics, 38(5), pp.2514-2519.\n\n\nI11Trier, F., Noël, P., Kim, J.V., Attané, J.P., Vila, L. and Bibes, M., 2022. Oxide spin-orbitronics: spin–charge interconversion and topological spin textures. Nature Reviews Materials, 7(4), pp.258-274.\nI12Ando, Y. and Shiraishi, M., 2017. Spin to charge interconversion phenomena in the interface and surface states. Journal of the Physical Society of Japan, 86(1), p.011001.\n\n\nI13Azevedo, A., Vilela-Leão, L.H., Rodríguez-Suárez, R.L., Santos, A.L. and Rezende, S.M., 2011. Spin pumping and anisotropic magnetoresistance voltages in magnetic bilayers: Theory and experiment. Physical review B, 83(14), p.144402.\nI14Taniguchi, T. and Imamura, H., 2008. Spin pumping in ferromagnetic multilayers. Modern Physics Letters B, 22(30), pp.2909-2929.\n\n\nI15Nan, T., Ralph, D.C., Tsymbal, E.Y. and Manchon, A., 2021. Emerging materials for spin–charge interconversion. APL Materials, 9(12), p.120401.\nI16Fan, Y., Upadhyaya, P., Kou, X., Lang, M., Takei, S., Wang, Z., Tang, J., He, L., Chang, L.T., Montazeri, M. and Yu, G., 2014. Magnetization switching through giant spin–orbit torque in a magnetically doped topological insulator heterostructure. Nature materials, 13(7), pp.699-704.\nI17Vila, M., Hsu, C.H., Garcia, J.H., Benítez, L.A., Waintal, X., Valenzuela, S.O., Pereira, V.M. and Roche, S., 2021. Low-symmetry topological materials for large charge-to-spin interconversion: The case of transition metal dichalcogenide monolayers. Physical Review Research, 3(4), p.043230.\nI18Fan, Y. and Wang, K.L., 2016, June. Spintronics based on topological insulators. In Spin (Vol. 6, No. 02, p. 1640001). World Scientific Publishing Company.\nI19Pesin, D. and MacDonald, A.H., 2012. Spintronics and pseudospintronics in graphene and topological insulators. Nature materials, 11(5), pp.409-416.\nI20Jiang, Z., Chang, C.Z., Masir, M.R., Tang, C., Xu, Y., Moodera, J.S., MacDonald, A.H. and Shi, J., 2016. Enhanced spin Seebeck effect signal due to spin-momentum locked topological surface states. Nature communications, 7(1), pp.1-7.\nI21Hasan, M.Z. and Kane, C.L., 2010. Colloquium: topological insulators. Reviews of modern physics, 82(4), p.3045.\nI22Fischer, M.H., Vaezi, A., Manchon, A. and Kim, E.A., 2016. Spin-torque generation in topological insulator based heterostructures. Physical Review B, 93(12), p.125303.\nI23Baker, A.A., Figueroa, A.I., Collins-McIntyre, L.J., Van Der Laan, G. and Hesjedal, T., 2015. Spin pumping in ferromagnet-topological insulator-ferromagnet heterostructures. Scientific reports, 5(1), pp.1-5.\nI24Wang, H., Kally, J., Lee, J.S., Liu, T., Chang, H., Hickey, D.R., Mkhoyan, K.A., Wu, M., Richardella, A. and Samarth, N., 2016. Surface-state-dominated spin-charge current conversion in topological-insulator–ferromagnetic-insulator heterostructures. Physical review letters, 117(7), p.076601.\nI25Xu, Y., Miotkowski, I., Liu, C., Tian, J., Nam, H., Alidoust, N., Hu, J., Shih, C.K., Hasan, M.Z. and Chen, Y.P., 2014. Observation of topological surface state quantum Hall effect in an intrinsic three-dimensional topological insulator. Nature Physics, 10(12), pp.956-963.\nI26Taskin, A.A., Ren, Z., Sasaki, S., Segawa, K. and Ando, Y., 2011. Observation of Dirac holes and electrons in a topological insulator. Physical Review Letters, 107(1), p.016801.\n\n\n\n\n\n\n\nS1Sarkar, J., Singh, S., Gopal, R.K. and Mitra, C., 2017. Evidence of robust metallic surface states on the surface of PLD grown poly-crystalline topological insulator thin-film. In Proceedings of the seventeenth international conference on thin films: abstracts.\nS2Pandey, A., Singh, S., Ghosh, B., Manna, S., Gopal, R.K. and Mitra, C., 2019. Pulsed laser deposition of highly c-axis oriented thin films of BSTS topological insulator. arXiv preprint arXiv:1910.08100.\nS3Pal, S., Aon, S., Manna, S. and Mitra, C., 2022. A short-circuited coplanar waveguide for low-temperature single-port VNA-FMR spectroscopy set-up to probe the magnetic properties of ferromagnetic thin films. arXiv preprint arXiv:2204.10596.\n\n\n\n\n\nKittelKittel C. On the theory of ferromagnetic resonance absorption. Physical review. 1948 Jan 15;73(2):155.\n\n\nM_sRuane WT, White SP, Brangham JT, Meng KY, Pelekhov DV, Yang FY, Hammel PC. Controlling and patterning the effective magnetization in Y3Fe5O12 thin films using ion irradiation. AIP Advances. 2018 May 8;8(5):056007.\n\n\ndampingZakeri K, Lindner J, Barsukov I, Meckenstock R, Farle M, Von Hörsten U, Wende H, Keune W, Rocker J, Kalarickal SS, Lenz K. Spin dynamics in ferromagnets: Gilbert damping and two-magnon scattering. Physical Review B. 2007 Sep 14;76(10):104416.\n\n\n\n1aUrban R, Woltersdorf G, Heinrich B. Gilbert damping in single and multilayer ultrathin films: Role of interfaces in nonlocal spin dynamics. Physical review letters. 2001 Nov 2;87(21):217204.\n1bAzzawi S, Ganguly A, Tokaç M, Rowan-Robinson RM, Sinha J, Hindmarch AT, Barman A, Atkinson D. Evolution of damping in ferromagnetic/nonmagnetic thin film bilayers as a function of nonmagnetic layer thickness. Physical Review B. 2016 Feb 1;93(5):054402.\nbra3Tserkovnyak, Y., Brataas, A. and Bauer, G.E., 2002. Enhanced Gilbert damping in thin ferromagnetic films. Physical review letters, 88(11), p.117601.\n\n\n2aMosendz O, Vlaminck V, Pearson JE, Fradin FY, Bauer GE, Bader SD, Hoffmann A. Detection and quantification of inverse spin Hall effect from spin pumping in permalloy/normal metal bilayers. Physical Review B. 2010 Dec 1;82(21):214403.\n\n\nbra1Brataas, A., Nazarov, Y.V. and Bauer, G.E., 2000. Finite-element theory of transport in ferromagnet–normal metal systems. Physical Review Letters, 84(11), p.2481.\nbra2Brataas, A., Nazarov, Y.V. and Bauer, G.E., 2001. Spin-transport in multi-terminal normal metal-ferromagnet systems with non-collinear magnetizations. The European Physical Journal B-Condensed Matter and Complex Systems, 22(1), pp.99-110.\n\n\nFM/TI1Mendes, J.B.S., Santos, O.A., Holanda, J., Loreto, R.P., De Araujo, C.I.L., Chang, C.Z., Moodera, J.S., Azevedo, A. and Rezende, S.M., 2017. Dirac-surface-state-dominated spin to charge current conversion in the topological insulator (Bi 0.22 Sb 0.78) 2 Te 3 films at room temperature. Physical Review B, 96(18), p.180415.\nFM/TI2Deorani, P., Son, J., Banerjee, K., Koirala, N., Brahlek, M., Oh, S. and Yang, H., 2014. Observation of inverse spin Hall effect in bismuth selenide. Physical Review B, 90(9), p.094403.\n\n\n3aAndo K, Takahashi S, Ieda J, Kajiwara Y, Nakayama H, Yoshino T, Harii K, Fujikawa Y, Matsuo M, Maekawa S, Saitoh E. Inverse spin-Hall effect induced by spin pumping in metallic system. Journal of applied physics. 2011 May 15;109(10):103913.\n3bWu CN, Lin YH, Fanchiang YT, Hung HY, Lin HY, Lin PH, Lin JG, Lee SF, Hong M, Kwo J. Strongly enhanced spin current in topological insulator/ferromagnetic metal heterostructures by spin pumping. Journal of Applied Physics. 2015 May 7;117(17):17D148.\n\n\n\nhm1Jhajhria, D., Behera, N., Pandya, D.K. and Chaudhary, S., 2019. Dependence of spin pumping in W/CoFeB heterostructures on the structural phase of tungsten. Physical Review B, 99(1), p.014430.\nhm2Ando, K. and Saitoh, E., 2010. Inverse spin-Hall effect in palladium at room temperature. Journal of Applied Physics, 108(11), p.113925.\nhm3Shaw, J.M., Nembach, H.T. and Silva, T.J., 2012. Determination of spin pumping as a source of linewidth in sputtered Co 90 Fe 10/Pd multilayers by use of broadband ferromagnetic resonance spectroscopy. Physical Review B, 85(5), p.054412.\nhm4Panda SN, Majumder S, Bhattacharyya A, Dutta S, Choudhury S, Barman A. Structural phase-dependent giant interfacial spin transparency in W/CoFeB thin-film heterostructures. ACS Applied Materials and Interfaces. 2021 Apr 22;13(17):20875-84.\n\n\njJamali, Mahdi, et al. \"Giant spin pumping and inverse spin Hall effect in the presence of surface and bulk spin-orbit coupling of topological insulator Bi2Se3.\" Nano letters 15.10 (2015): 7126-7132.\n\n\nbForos, J., Woltersdorf, G., Heinrich, B. and Brataas, A., 2005. Scattering of spin current injected in Pd (001). Journal of Applied Physics, 97(10), p.10A714.\n\n\nd1Tserkovnyak, Y., Brataas, A. and Bauer, G.E., 2002. Spin pumping and magnetization dynamics in metallic multilayers. Physical Review B, 66(22), p.224403.\nd2Boone, C.T., Nembach, H.T., Shaw, J.M. and Silva, T.J., 2013. Spin transport parameters in metallic multilayers determined by ferromagnetic resonance measurements of spin-pumping. Journal of Applied Physics, 113(15), p.153906.\n\n\nssBaker, A.A., Figueroa, A.I., Collins-McIntyre, L.J., Van Der Laan, G. and Hesjedal, T., 2015. Spin pumping in ferromagnet-topological insulator-ferromagnet heterostructures. Scientific reports, 5(1), p.7907.\n \n \n\ncs1Chen, K. and Zhang, S., 2015. Spin pumping in the presence of spin-orbit coupling. Physical review letters, 114(12), p.126602.\ncs2Liu, Y., Yuan, Z., Wesselink, R.J., Starikov, A.A. and Kelly, P.J., 2014. Interface enhancement of Gilbert damping from first principles. Physical review letters, 113(20), p.207202.\n\n \n\nTI1Abdulahad, F.B., Lin, J.H., Liou, Y., Chiu, W.K., Chang, L.J., Kao, M.Y., Liang, J.Z., Hung, D.S. and Lee, S.F., 2015. Spin chemical potential bias induced surface current evidenced by spin pumping into the topological insulator B i 2 T e 3. Physical Review B, 92(24), p.241304.\nTI2Shiomi, Y., Nomura, K., Kajiwara, Y., Eto, K., Novak, M., Segawa, K., Ando, Y. and Saitoh, E., 2014. Spin-electricity conversion induced by spin injection into topological insulators. Physical review letters, 113(19), p.196601.\nTI3Gupta, Sachin, et al. Japanese Journal of Applied Physics 57.2 (2017): 020302.\n\n\nTTSS1Ye, M., Eremeev, S.V., Kuroda, K., Krasovskii, E.E., Chulkov, E.V., Takeda, Y., Saitoh, Y., Okamoto, K., Zhu, S.Y., Miyamoto, K. and Arita, M., 2012. Quasiparticle interference on the surface of Bi 2 Se 3 induced by cobalt adatom in the absence of ferromagnetic ordering. Physical Review B, 85(20), p.205317.\nTTSS2Scholz, M.R., Sánchez-Barriga, J., Marchenko, D., Varykhalov, A., Volykhov, A., Yashina, L.V. and Rader, O., 2012. Tolerance of topological surface states towards magnetic moments: Fe on Bi 2 Se 3. Physical Review Letters, 108(25), p.256810.\n\n\n\nIPFanchiang, Y.T., Chen, K.H.M., Tseng, C.C., Chen, C.C., Cheng, C.K., Yang, S.R., Wu, C.N., Lee, S.F., Hong, M. and Kwo, J., 2018. Strongly exchange-coupled and surface-state-modulated magnetization dynamics in Bi2Se3/yttrium iron garnet heterostructures. Nature communications, 9(1), pp.1-9.\n\n\n"}