{"entry_id": "http://arxiv.org/abs/2303.07023v1", "published": "20230313114107", "title": "Strong, weak or no balance? Testing structural hypotheses against real networks", "authors": ["Anna Gallo", "Diego Garlaschelli", "Renaud Lambiotte", "Fabio Saracco", "Tiziano Squartini"], "primary_category": "physics.soc-ph", "categories": ["physics.soc-ph", "physics.data-an"], "text": "\n\n\n\n\nIMT School for Advanced Studies, Piazza San Francesco 19, 55100 Lucca (Italy)\nINdAM-GNAMPA Istituto Nazionale di Alta Matematica (Italy)\n\nIMT School for Advanced Studies, Piazza San Francesco 19, 55100 Lucca (Italy)\nINdAM-GNAMPA Istituto Nazionale di Alta Matematica (Italy)\nLorentz Institute for Theoretical Physics, University of Leiden, Niels Bohrweg 2, 2333 CA Leiden (The Netherlands)\n\nMathematical Institute, University of Oxford, Woodstock Road, OX2 6GG Oxford (United Kingdom)\n\n`Enrico Fermi' Research Center (CREF), Via Panisperna 89A, 00184 Rome (Italy)\nInstitute for Applied Computing `Mauro Picone' (IAC), National Research Council, Via dei Taurini 19, 00185 Rome (Italy)\nIMT School for Advanced Studies, Piazza San Francesco 19, 55100 Lucca (Italy)\n\nIMT School for Advanced Studies, Piazza San Francesco 19, 55100 Lucca (Italy)\nINdAM-GNAMPA Istituto Nazionale di Alta Matematica (Italy)\nInstitute for Advanced Study, University of Amsterdam, Oude Turfmarkt 145, 1012 GC Amsterdam (The Netherlands)\n\n\n\n\nThe abundance of data about social, economic and political relationships has opened an era in which social theories can be tested against empirical evidence, allowing human behaviour to be analyzed just as any other natural phenomenon. The present contribution focuses on balance theory, stating that social agents tend to avoid the formation of `unbalanced', or `frustrated', cycles, i.e. cycles with an odd number of negative links. Such a statement can be made statistically rigorous only after a comparison with a null model. Since the existing ones cannot account for the heterogeneity of individual actors, we, first, extend the Exponential Random Graphs framework to binary, undirected, signed networks with local constraints and, then, employ both homogeneous and heterogeneous benchmarks to compare the empirical abundance of short cycles with its expected value, on several, real-world systems. What emerges is that the level of balance in real-world networks crucially depends on (at least) three factors, i.e. the measure adopted to quantify it, the nature of the data, the null model employed for the analysis. As an example, the study of triangles reveals that homogeneous null models with global constraints tend to favour the weak version of balance theory, according to which only the triangle with one negative link should be under-represented in real, social and political networks; on the other hand, heterogeneous null models with local constraints tend to favour the strong version of balance theory, according to which also the triangle with all negative links should be under-represented in real, social networks. Biological networks, instead, are found to be significantly frustrated under any benchmark considered here.\n\n\n89.75.Fb; 89.65.-s; 02.50.Tt\n\nStrong, weak or no balance? Testing structural hypotheses against real networks\n    Tiziano Squartini\n    March 30, 2023\n===============================================================================\n\n\n\n\n\n§ I. INTRODUCTION\n\n\nNetwork theory has emerged as a powerful framework to model many different kinds of real-world systems, by representing their units as nodes and the interactions between them as links. Out of the many types of edges that have been considered so far, the signed one has recently seen its popularity revived <cit.>: the importance of the signed character of links lies in the possibility it offers to model positive as well as negative social interactions.\n\nFrom an historical perspective, the interest in the study of signed networks is rooted into the so-called balance theory (BT), firstly proposed by Heider <cit.> and further developed by Cartwright and Harary. The choice, pursued by the latter ones, of adopting signed graphs to model it led to the birth of the so-called structural balance theory <cit.> which has not only found application in the study of human relationships but also in that of biological, ecological and economic systems <cit.>.\n\nBT deals with the concept of balance: a complete, signed graph is said to be balanced if all its triads have an even number of negative edges, i.e. either zero (in this case, the three edges are all positive) or two (see Fig. <ref>). Informally speaking, the BT formalizes the principles `the friend of my friend is my friend' and `the enemy of my enemy is my friend'. Remarkably, the definition above leads to the so-called structure theorem, stating that a complete, signed graph is balanced if and only if its set of nodes can be partitioned into two, disjoint subsets whose intra-modular links are all positive and whose inter-modular links are all negative. In <cit.>, Cartwright and Harary extended the definition of balance to incomplete graphs, by including cycles whose length is larger than three: a (connected) network is said to be balanced when all cycles are positive, i.e. contain an even number of negative edges. Taken altogether, the results above constitute the so-called strong balance theory (SBT).\n\n\n\nThe framework of SBT has been extended by Davis in <cit.> where the concept of k-balanced networks is introduced: according to it, signed graphs whose set of nodes can be partitioned into k disjoint subsets with positive, intra-modular links and negative, inter-modular links are balanced. This generalized definition of balance leads to the formulation of the weak balance theory (WBT); according to it, the triad with all negative edges is balanced, since each node constitutes a group on its own and the links between these single-node clusters are negative (see Fig. <ref>).\n\nSeveral metrics to decide if signed networks are strongly or weakly balanced have been proposed. In <cit.>, the degree of balance of a network is quantified by the number of edges that need to be removed, or whose sign must be reversed, in order to obtain a network each cycle of which has an even number of negative links; in <cit.>, it is quantified by the number of balanced, closed walks (i.e. closed walks with an even number of negative links) that are present in the network; in <cit.> an incomplete, signed network is deemed as balanced if it is possible to fill in all its missing links to obtain a complete, balanced graph according to the SBT; in <cit.>, the authors define three, different levels of balance: at the micro-scale, involving triads, at the meso-scale, involving larger subgraphs, and at the macro-scale, involving the entire network. Other approaches have been adopted in <cit.>, where the problem is studied from a spectral perspective, and in <cit.>, where the problem is studied by employing concepts borrowed from statistical physics (the authors assign each signed triad an energy, claiming that the networks at the `lowest temperature' are those whose triangles have no negative edges).\n\nOther authors, instead, have focused on the complementary notion of balance, i.e. that of frustration, trying to quantify the extent to which signed networks are far from balance <cit.>: in <cit.>, the authors define the so-called balanced decomposition number, i.e. the (minimum) number of balanced groups into which nodes can be partitioned, and evaluate it by counting the (minimum) number of edges whose removal increases a network balance; in <cit.>, instead, the same index is evaluated by adopting the so-called switching signs method introduced in <cit.> and prescribing to count the (minimum) number of signs that must be reversed to balance a network; in <cit.>, the degree of (im)balance of a network is proxied by the magnitude of the smallest eigenvalue of the Laplacian matrix.\n\nEmpirical observations seem to point out that real-world, signed networks tend to be k-balanced, i.e. avoid establishing the patterns that are deemed as frustrated by the WBT: as an example, in <cit.>, the authors study a pair of online, social networks induced by the relationships between users, showing that their balance increases as the number of clusters into which nodes are partitioned is larger than two; in <cit.>, the authors notice that the weak formulation of the balance theory allows a better performance in predicting signs to be achieved.\n\nAny measure of balance (or frustration) is not meaningful by itself: in order to perform a statistically sound analysis, its empirical value must be compared with the outcome of a properly defined benchmark model, i.e. a reference model preserving some of the network properties while randomizing everything else. The far most common null model for signed graphs is the one keeping the positions of edges fixed while shuffling their signs <cit.>; in <cit.>, the authors implement the canonical variant of the aforementioned exercise, assigning signs by means of a Bernoulli distribution; in <cit.>, the authors define a null model for randomizing both the presence and the sign of links. More complex null models have been proposed as well: in <cit.>, the authors implement the signed version of the Local Rewiring Algorithm (at each step, two edges with the same sign are selected and rewired, to preserve the total number of signed links that are incident to each node); its canonical variant is implemented in <cit.>, where the Balanced Signed Chung-Lu model (BSCL) is proposed - although it constrains also the average number of signed triangles each edge is part of. Finally, in <cit.>, the definition of models constraining the structural properties of signed networks has been explored within the framework of the Exponential Random Graphs (ERG).\n\nOur contribution focuses on binary, undirected, signed networks, extending the ERG framework to include null models suitable for the analysis of signed graphs with `plus one', `minus one' and `zero' edges as well as those with just `plus one' and `minus one' edges. Afterwards, we employ them to inspect the statistical properties of the far most commonly studied patterns for this kind of analysis, i.e. triangles - the reasons behind this choice being, at least, two: 1) considering longer cycles is computationally expensive; 2) the contribution of short(er) cycles to frustration is argued to be more relevant than that of long(er) ones.\n\n\n\n§ II. FORMALISM AND BASIC QUANTITIES\n\n\nA signed graph is a graph where each edge can be positive, negative or missing. In what follows, however, we will focus on binary, undirected, signed networks: hence, each edge will be `plus one', `minus one' or `zero'. More formally, for any two nodes i and j, the corresponding entry of the adjacency matrix 𝐀 will be assumed to read a_ij=-1,0,+1 (with a_ij=a_ji, ∀ i<j). Since the total number of node-pairs is N(N-1)/2=N2 and any node-pair can be positively connected, negatively connected or disconnected, the total number of possible, binary, undirected, signed configurations (or, equivalently, the cardinality of the ensemble of binary, undirected, signed graphs) is |𝔸|=3^N2. To simplify the calculations, let us define the three functions of a generic entry, reading\n\n\n    a_ij^-=[a_ij=-1],   a_ij^0=[a_ij=0],   a_ij^+=[a_ij=+1]\n\nwhere we have employed the Iverson's brackets notation (see Appendix A for more details): these new variables are mutually exclusive, i.e. {a_ij^-,a_ij^0,a_ij^+}={(1,0,0),(0,1,0),(0,0,1)}, sum to 1, i.e. a_ij^-+a_ij^0+a_ij^+=1, and induce the definition of the matrices 𝐀^+ and 𝐀^- (see Appendix A for more details).\n\nThe number of positive and negative links can be, respectively, defined as\n\n\n    L^+=∑_i=1^N∑_j=1\n    (j>i)^Na_ij^+  and   L^-=∑_i=1^N∑_j=1\n    (j>i)^Na_ij^-;\n\nanalogously, the positive and negative degree of node i can be, respectively, defined as\n\n\n    k^+_i=∑_j=1\n    (j≠ i)^Na_ij^+  and   k^-_i=∑_j=1\n    (j≠ i)^Na_ij^-\n\n(naturally, 2L^+=∑_i=1^Nk_i^+ and 2L^-=∑_i=1^Nk_i^-). The advantage of adopting a definition based upon Iverson's brackets becomes evident when looking at the definitions above: each quantity is, now, computed on the corresponding, signed matrix whose entries are, by definition, positive; as a consequence, all quantities of interest are positive as well.\n\n\n\nLet us, now, focus on the signed triads (see Fig. <ref>), i.e. the quantities representing the starting point to verify the (strong and weak versions of the) balance theory. According to the BT, a social system tends to arrange itself into a configuration satisfying the principles `the friend of my friend is my friend', `the friend of my enemy is my enemy', `the enemy of my friend is my enemy', `the enemy of my enemy is my friend' <cit.>: the SBT formalizes them by stating that the overall network balance increases with the number of triangles having an even number of negative edges (said to be balanced or `positive' since the product of the edge sings is a `plus') and decreases with the number of triangles having an odd number of negative edges (said to be unbalanced or `negative' since the product of the edge sings is a `minus'); the WBT, on the other hand, considers the triangle with all, negative edges balanced as well.\n\nUpon considering that the row-by-column product of an arbitrary number of 𝐀^+ and 𝐀^- matrices allows us to count the abundance of closed walks whose signature matches the sequence of signs of the matrices - for example, the expression [𝐀^+𝐀^-𝐀^+]_ii counts the number of closed walks, whose length is 3 and whose signature is (+-+), starting from i and ending in i; the expression [𝐀^+𝐀^+𝐀^-𝐀^+]_ii=[(𝐀^+)^2𝐀^-𝐀^+]_ii counts the number of closed walks, whose length is 4 and whose signature is (++-+), starting from i and ending in i - the degree of balance of a network can be quantified upon calculating the abundance of (non-degenerate) triangles with an even number of negative links, i.e.\n\n\n    T^(+++)   =1/3∑_i=1^NT^(+++)_i=Tr[(𝐀^+)^3]/6,\n    \n    T^(+–)   =1/2∑_i=1^NT^(+–)_i=Tr[𝐀^+(𝐀^-)^2]/2;\n\nsimilarly, the degree of frustration of a network can be quantified upon calculating the abundance of (non-degenerate) triangles with an odd number of negative links, i.e.\n\n\n    T^(—)   =1/3∑_i=1^NT^(—)_i=Tr[(𝐀^-)^3]/6,\n    \n    T^(++-)   =1/2∑_i=1^NT^(++-)_i=Tr[(𝐀^+)^2𝐀^-]/2;\n\n(see Appendix B for more details).\n\nThe expressions provided above allow us to define several indices for quantifying the degree of balance of a network. According to the SBT, the total number of balanced patterns reads #_^sb=T^(+++)+T^(+–); equivalently, the total number of unbalanced patterns, according to the same variant of the BT, reads #_^su=T^(—)+T^(++-). Hence, the measure of `strong balance' reading\n\n\n    SBI=#_^sb/#_^sb+#_^su\n\nremains naturally defined, as well as the measure of `strong frustration' reading SFI=1-SBI. On the other hand, the total number of balanced patterns, according to the WBT, reads #_^wb=T^(+++)+T^(+–)+T^(—) while the total number of unbalanced patterns, according to the same variant of the BT, reads #_^wu=T^(++-). Hence, the measure of `weak balance' reading\n\n\n    WBI=#_^wb/#_^wb+#_^wu\n\nremains naturally defined, while the corresponding measure of `weak frustration' reads WFI=1-WBI.\n\nThe indices defined above quantify `unbalance' by measuring the abundance of locally frustrated patterns; one can define other indices of frustration, accounting for larger-scale structures: an example is provided by the `higher-order' frustration index reading\n\n\n    HOFI=L^+_∘+L^-_∙/L\n\nand measuring the percentage of `misplaced' links, i.e. the total number of positive links between communities, L^+_∘, plus the total number of negative links within communities, L^-_∙, divided by the total number of links, L (the formalism is adapted from the one proposed in <cit.>).\n\n\n\n§ III. RANDOMIZATION OF BINARY, UNDIRECTED, SIGNED GRAPHS\n\n\nLet us, now, generalize the ERG framework to accommodate models for studying binary, undirected, signed graphs: we will follow the analytical approach introduced in <cit.>, and further developed in <cit.>, aimed at individuating the functional form of a probability distribution induced by a bunch of empirical properties to be preserved on average. The aforementioned approach prescribes to carry out a constrained maximization of Shannon entropy\n\n\n    S=-∑_𝐀∈𝔸P(𝐀)ln P(𝐀)\n\nwhere the sum runs over the ensemble of |𝔸|=3^N2 binary, undirected, signed graphs a generic entry of which can assume the values -1, 0, +1.\n\nIn what follows, we will consider two classes of models, i.e. those keeping a network topology fixed and those letting the topology vary along with the edge signs: models belonging to the first class are better suited for studying systems where agents cannot choose `with whom' to interact but only `how', whereas models belonging to the second class are better suited for studying systems where agents can choose their neighbours as well <cit.>. Still, comparing the two types of recipes on the same configuration is instructive, as it allows the role played by signed constraints to be disentangled from the one played by non-signed constraints in shaping its structure.\n\n\n\n §.§ Signed Random Graph Model\n\n\nThe Signed Random Graph Model (SRGM) is induced by the Hamiltonian\n\n\n    H(𝐀)=α L^+(𝐀)+β L^-(𝐀)\n\ni.e. by the two, global constraints L^+(𝐀) and L^-(𝐀). According to the SRGM, each entry of a signed network is a random variable whose behaviour is described by the following finite scheme\n\n\n    a_ij∼[  -1   0  +1; p^- p^0 p^+ ]  ∀ i<j\n\nwith\n\n\n    p^-   ≡e^-β/1+e^-α+e^-β≡y/1+x+y,\n    \n    p^+   ≡e^-α/1+e^-α+e^-β≡x/1+x+y\n\nand p^0≡1-p^–p^+. In other words, a_ij obeys a generalized Bernoulli distribution whose probability coefficients are determined by the (Lagrange multipliers of the) imposed constraints (see Appendix C for more details): each positive link appears with probability p^+, each negative link appears with probability p^- and each missing link has a probability p^0.\n\nIn order to employ the SRGM for studying real-world networks, the parameters that define it need to be properly tuned: more specifically, one needs to ensure that ⟨ L^+⟩_SRGM=L^+(𝐀^*) and ⟨ L^-⟩_SRGM=L^-(𝐀^*), with the symbol 𝐀^* indicating the specific, empirical network under analysis. To this aim, one can maximize the likelihood function ℒ_SRGM(x,y)≡ln P_SRGM(𝐀^*|x,y) with respect to the unknown parameter(s) that define it <cit.>. Such a recipe leads us to find \n\n\n    p^+=2L^+(𝐀^*)/N(N-1),   p^-=2L^-(𝐀^*)/N(N-1)\n\nand p^0≡1-p^–p^+.\n\n\n\n §.§ Signed Random Graph Model with fixed topology\n\n\nThe way the SRGM has been defined allows a network topological structure to vary along with the edge signs. A variant of the SRGM that keeps the topology of the network under analysis fixed while (solely) randomizing the edge signs is, however, definable. The Hamiltonian inducing it reads, again, H(𝐀)=α L^+(𝐀)+β L^-(𝐀) but the role of random variables is played by the entries of the adjacency matrix corresponding to the connected pairs of nodes, i.e. the ones for which |a_ij|=1. Each of them obeys the finite scheme\n\n\n    a_ij∼[  -1  +1; p^- p^+ ]  ∀ i<j | |a_ij|=1\n\nwith\n\n\n    p^-   ≡e^-β/e^-α+e^-β≡y/x+y,\n    \n    p^+   ≡e^-α/e^-α+e^-β≡x/x+y;\n\nin other words, each entry for which |a_ij|=1 obeys a Bernoulli distribution whose probability coefficients are determined by the (Lagrange multipliers of the) imposed constraints (see Appendix C for more details): each existing link is assigned a `plus one' with probability p^+ and a `minus one' with probability p^-.\n\nThe maximization of the likelihood function ℒ_SRGM-FT(x,y)≡ln P_SRGM-FT(𝐀^*|x,y) with respect to the unknown parameter(s) that define it leads us to find \n\n\n    p^+=L^+(𝐀^*)/L(𝐀^*),   p^-=L^-(𝐀^*)/L(𝐀^*)\n\nwith L(𝐀^*) representing the (empirical) number of links characterizing the fixed topology under consideration.\n\nRemarkably, the SRGM and the SRGM-FT are related via the simple expression\n\n\n    P_SRGM(𝐀)=P_RGM(𝐀)· P_SRGM-FT(𝐀)\n\ninvolving the probability of the `usual' Random Graph Model (RGM) and stating that the probability of connecting any two nodes with, say, a positive link can be rewritten as the probability of connecting them with a link times the probability of assigning the latter a `plus one': in formulas, p^+_SRGM/p_RGM^+=p^+_SRGM-FT (see Appendix C for more details). Notice that if the network under analysis is completely connected, the SRGM and the SRGM-FT coincide.\n\nAlthough the recipes implemented in <cit.> and <cit.> are similar in spirit to the SRGM and the SRGM-FT, the rigorous derivation of both models is provided here for the first time, together with the proof that the latter is nothing but the conditional version of the former.\n\n\n\n §.§ Signed Configuration Model\n\n\nThe two, aforementioned versions of the SRGM are defined by constraints which are global in nature. Let us, now, consider a more refined null model, induced by constraints which, instead, are local. \n\nThe Signed Configuration Model (SCM) is induced by the Hamiltonian\n\n\n    H(𝐀)=∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)]\n\ni.e. by the two series of local constraints {k_i^+(𝐀)}_i=1^N and {k_i^-(𝐀)}_i=1^N. According to the SCM, each entry of a signed network is a random variable whose behaviour is described by the following finite scheme\n\n\n    a_ij∼[     -1      0     +1; p_ij^- p_ij^0 p_ij^+ ]  ∀ i<j\n\nwith\n\n\n    p_ij^-   ≡e^-(β_i+β_j)/1+e^-(α_i+α_j)+e^-(β_i+β_j)≡y_iy_j/1+x_ix_j+y_iy_j,\n    \n    p_ij^+   ≡e^-(α_i+α_j)/1+e^-(α_i+α_j)+e^-(β_i+β_j)≡x_ix_j/1+x_ix_j+y_iy_j\n\nand p_ij^0≡1-p_ij^–p_ij^+. In other words, a_ij obeys a generalized Bernoulli distribution whose probability coefficients are determined by the (Lagrange multipliers of the) imposed constraints (see Appendix C for more details): given any two nodes i and j, they are connected by a positive link with probability p_ij^+, by a negative link with probability p_ij^- and are disconnected with probability p_ij^0.\n\nIn order to tune the parameters defining the SCM to ensure that ⟨ k_i^+⟩_SCM=k_i^+(𝐀^*) and ⟨ k_i^-⟩_SCM=k_i^-(𝐀^*), ∀ i, let us maximize the likelihood function ℒ_SCM({x_i}_i=1^N,{y_i}_i=1^N)≡ln P_SCM(𝐀^*|{x_i}_i=1^N,{y_i}_i=1^N) with respect to the unknown parameter(s) that define it. Such a recipe leads us to find \n\n\n    k_i^+(𝐀^*)   =∑_j=1\n    (j≠ i)^Nx_ix_j/1+x_ix_j+y_iy_j=⟨ k_i^+⟩  ∀ i,\n    \n    k_i^-(𝐀^*)   =∑_j=1\n    (j≠ i)^Ny_iy_j/1+x_ix_j+y_iy_j=⟨ k_i^-⟩  ∀ i\n\na system that can be solved only numerically, e.g. following the guidelines provided in <cit.> (see Appendix D for more details). Whenever x_i≪1 and y_i≪1, ∀ i, the `sparse-case' approximation of the SCM holds true and one can simplify the expressions of the probability coefficients, by rewriting them in a factorized fashion, i.e. p_ij^+≃ x_ix_j and p_ij^-≃ y_iy_j, ∀ i<j. Such a manipulation leads us to find\n\n\n    p_ij^+≃k_i^+(𝐀^*)k_j^+(𝐀^*)/2L^+(𝐀^*),   p_ij^-≃k_i^-(𝐀^*)k_j^-(𝐀^*)/2L^-(𝐀^*)\n\na set of equations that is also known with the name of Signed Chung-Lu Model (SCLM).\n\nThe SCM has no precedents in the literature: while the model employed in <cit.> is microcanonical in nature, the variant considered in <cit.> is just an approximation of the proper, canonical one, whose derivation is provided here for the first time. Interestingly, the bipartite version of the SCM can be recovered as a special case of the Bipartite Score Configuration Model, proposed in <cit.>.\n\n\n\n §.§ Signed Configuration Model with fixed topology\n\n\nAs for the SRGM, a variant of the SCM that keeps the topology of the network under analysis fixed while (solely) randomizing the signs of the edges can be defined. Again, its Hamiltonian reads H(𝐀)=∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)] and the role of random variables is played by the entries of the adjacency matrix corresponding to connected pairs of nodes, i.e. the ones for which |a_ij|=1. Each of them obeys the finite scheme\n\n\n    a_ij∼[     -1     +1; p_ij^- p_ij^+ ]  ∀ i<j | |a_ij|=1\n\nwith\n\n\n    p_ij^-   ≡e^-(β_i+β_j)/e^-(α_i+α_j)+e^-(β_i+β_j)≡y_iy_j/x_ix_j+y_iy_j,\n    \n    p_ij^+   ≡e^-(α_i+α_j)/e^-(α_i+α_j)+e^-(β_i+β_j)≡x_ix_j/x_ix_j+y_iy_j;\n\nin other words, each entry for which |a_ij|=1 obeys a Bernoulli distribution whose probability coefficients are determined by the (Lagrange multipliers of the) imposed constraints (see Appendix C for more details): given any two, connected nodes i and j, their link is assigned a `plus one' with probability p_ij^+ and a `minus one' with probability p_ij^-.\n\n\n\nThe maximization of the likelihood function ℒ_SCM-FT({x_i}_i=1^N,{y_i}_i=1^N)≡ln P_SCM-FT(𝐀^*|{x_i}_i=1^N,{y_i}_i=1^N) with respect to the unknown parameter(s) that define it leads us to find \n\n\n    k_i^+(𝐀^*)   =∑_j=1\n    (j≠ i)^Nx_ix_j/x_ix_j+y_iy_j=⟨ k_i^+⟩  ∀ i,\n    \n    k_i^-(𝐀^*)   =∑_j=1\n    (j≠ i)^Ny_iy_j/x_ix_j+y_iy_j=⟨ k_i^-⟩  ∀ i\n\n(the formalism j≠ i is meant to indicate that the sums run over the connected pairs of nodes), a system that can be solved only numerically - again, along the guidelines provided in <cit.> (see Appendix D for more details).\n\nSimilarly to what has been observed for the SRGM and the SRGM-FT, the SCM and the SCM-FT are related via the simple expression\n\n\n    P_SCM(𝐀)=P_ICM(𝐀)· P_SCM-FT(𝐀)\n\ninvolving the probability of a Configuration Model (CM) whose coefficients are `induced' by the ones of the SCM - whence the acronym: in formulas, (p_ij^+)_SCM/(p_ij^+)_ICM=(p_ij^+)_SCM/[(p_ij^+)_SCM+(p_ij^-)_SCM]=(p_ij^+)_SCM-FT, for any pair of nodes (see Appendix C for more details). Notice that if the network under analysis is completely connected, the SCM and the SCM-FT coincide.\n\nThe SCM-FT has no precedents in the literature: its derivation is provided here for the first time together with the proof that it is nothing but the conditional version of the SCM.\n\nA summary of the null models introduced in the present section is provided in Table <ref>.\n\n\n\n§ IV. RESULTS\n\n\nLet us, now, employ our benchmarks to analyze a bunch of real-world networks (although many of them are induced by social relationships, we have also considered biological data).\n\nThe first dataset is the so-called `Correlates of Wars' (CoW) dataset <cit.>. It provides a picture of the international, political relationships across the years 1946-1997 and consists of 13 snapshots of 4 years each: a positive edge between any two countries indicates that they are allied, have a political agreement or are part of the same, governmental organization; conversely, a negative edge indicates that they are enemy, have a political disagreement or are part of different, governmental organizations (for more information about the CoW dataset, see <cit.>).\n\nThe second dataset collects information about the relationships among the ≃300.000 players of a massive multiplayer online game (MMOG) allowing users to experience alternative lives <cit.>. A positive edge between any two players indicates the existence of a friendship, an alliance, an economic relation; conversely, a negative edge indicates the existence of an enmity, a conflict, a fight. Since the network representing the MMOG dataset is directed, we have determined the signs of its undirected version by applying the following set of rules (allowing the total number of nodes to be preserved): +1·+1=+1; +1·-1=-1·+1=-1; -1·-1=-1; +1·0=0·+1=+1; -1·0=0·-1=-1.\n\nMoreover, we have considered the networks collected in <cit.> and analyzed in <cit.>, i.e. three, gene-regulatory ones (GRNs - E. Coli, Macrophage, Epidermal Growth Factor Receptor), three, socio-political ones (SPNs - N.G.H. Tribes, Senate US, Monastery) and two, financial ones (FNs - Bitcoin Alpha and Bitcoin OTC).\n\nFor what concerns the GRNs, each node of them represents a gene, with positive links indicating activating connections and negative links indicating inhibiting connections. Specifically, E. Coli collects data about a transcriptional network of the bacterium Escherichia Coli; Macrophage collects data about a blood cell that eliminates substances such as cancer cells, cellular debris and microbes; Epidermal Growth Factor Receptor collects data about the protein that is responsible for cell division and survival in epidermal tissues.\n\nFor what concerns the SPNs, N.G.H. Tribes collects data about New Guinean Highland Tribes - here, a positive (negative) link denotes alliance (rivalry) - Monastery corresponds to the last frame of Sampson's data about the relationships between novices in a monastery <cit.> - here, a positive (negative) link indicates a positive (negative) interaction - and Senate US collects data about the members of the 108th US Senate Congress - here, a positive (negative) link indicates trust/similar political opinions (distrust/different political opinions).\n\nLastly, the FNs are `who-trust-whom' networks of Bitcoin traders on an online platform: a positive (negative) link indicates trust (distrust) between users <cit.>. The networks representing the FNs are weighted, directed ones: hence, after having binarized them by replacing each positive (negative) weight with a +1 (-1), we have made them undirected by applying the same rules adopted for the MMOG dataset.\n\nFrom a purely empirical perspective, the vast majority of the networks considered here is characterized by a small link density c=2L/N(N-1) but a large percentage L^+/L of positive links. The connectance of the configurations constituting the CoW decreases from ≃0.2 to ≃0.1 and the percentage of positive links is steadily around ≃88%; on the other hand, the link density of the configurations constituting the MMOG is steadily around 0.003 and the percentage of positive links decreases from ≃98% to ≃60%. The GRNs have a link density ranging from ≃10^-3 to ≃10^-2 and a percentage of positive links ranging from ≃58% to ≃66%; the SPNs have the largest values of link density among the configurations in our basket, ranging from ≃0.3 to ≃0.5, and percentages of positive links ranging from ≃50% to ≃75%. Lastly, Bitcoin Alpha has a link density of ≃0.002 and a percentage of positive links of ≃90% while Bitcoin OTC has a link density of ≃0.001 and a percentage of positive links of ≃85%.\n\n\n\nIn order to test the validity of the balance theory in its two formulations, we need to compare the empirical abundance of the quantities defined in the previous sections with the one expected under (any of) our null models. To this aim, a very useful indicator is represented by the so-called z-score, reading z_m=[N_m(𝐀^*)-⟨ N_m⟩]/σ[N_m] where N_m(𝐀^*) is the empirical abundance of motif m as measured on 𝐀^*, ⟨ N_m⟩ is the expected abundance of motif m under the chosen null model and σ[N_m]=√(⟨ N_m^2⟩-⟨ N_m⟩^2) is the standard deviation of N_m under the same null model; z_m returns the number of standard deviations by which the empirical abundance of motif m differs from the expected one: a result |z_m|≤2 (|z_m|≤3) indicates that the empirical abundance of m is compatible with the one expected under the chosen null model at the 5% (1%) level of statistical significance; on the other hand, a result |z_m|>2 (|z_m|>3) indicates that the empirical abundance of m is not compatible with the one expected under the chosen null (at the aforementioned levels of statistical significance), which either under- or over-estimates it.\n\n\n\nThe calculation of our z-scores is carried out by numerically sampling the ensembles induced by our null models: as the entries of our adjacency matrix are treated as independent, random variables by each of them, the explicit generation of any 𝐀∈𝔸 can be carried out by drawing a real number u_ij∈ U[0,1] and posing a_ij=-1 if 0≤ u_ij≤ p_ij^-, a_ij=+1 if p_ij^-<u_ij<p_ij^-+p_ij^+ and a_ij=0 if p_ij^-+p_ij^+≤ u_ij≤ 1, ∀ i<j; in case we are considering models with fixed topology, the sampling algorithm becomes a_ij=-1 if 0≤ u_ij≤ p_ij^- and a_ij=+1 if p_ij^-<u_ij≤ 1, ∀ i<j.\n\nAs Fig. <ref> shows, the trends highlighted by the SRGM-FT support the WBT: in fact, the only, significantly over-estimated pattern is precisely the one deemed as frustrated by such a version of the BT whereas the empirical abundance of the triangle whose edges are all negative is always compatible with the one expected under such a null model; interestingly, also the empirical abundance of the triangle with two, negative edges is always compatible with the one expected under the SRGM-FT although its z-score is (basically always) smaller than the z-score of the purple motif. Conversely, the abundance of the triangle with three, positive edges is significantly under-estimated on both datasets.\n\nThe aforementioned results constitute the backbone of the narrative according to which the weak version of the BT is the one better supported by data <cit.>. A comparison with the trends highlighted by the SRGM, however, reveals such a conclusion to be only partially true: in fact, even if the pattern deemed as unbalanced by the WBT is often the one achieving the minimum z-score, some frustration persists once the topology is left to vary along with the edge signs. Again, the abundance of the triangle with three, positive edges is significantly under-estimated on both datasets - a tendency becoming more evident with time: when considering the CoW dataset, this result seems to mirror the increasingly peaceful environment established by world relationships; an analogous behaviour characterizes the triad with two, negative edges, on the MMOG dataset.\n\nThe results of our analysis on the SPNs lead to the same conclusion: as Fig. <ref> shows, the homogeneous null models (i.e. both the SRGM and the SRGM-FT) favour the WBT, by significantly over-estimating the pattern labeled as frustrated by it (i.e. the one corresponding to the triangle with a unique, negative link). Quite remarkably, biological networks show the opposite behaviour: in these cases, in fact, frustrated patterns are under-estimated by our homogeneous models, a result implying that the nodes belonging to the GRNs tend to arrange themselves into such configurations; even more remarkably, according to the SRGM-FT, they tend to avoid creating the triangular, balanced ones. Lastly, financial networks show a peculiar behaviour since their nodes avoid creating triangles with a unique, negative link but engage in significantly many triangles with all negative links.\n\nThe results of the analysis carried out in <cit.> suggest the SRGM-FT to be preferred to the SRGM as it provides a better explanation of empirical network structures. Fixing topology, however, does not represent the only solution to the problem: a viable alternative is that of considering a model such as the SCM, still letting the topology vary along with the edge signs but constraining a larger number of network properties. As Fig. <ref> shows, the predictions achieved under the SCM are much more accurate than the ones achieved under the SRGM: this is true for both datasets, as the z-scores decrease up to one order of magnitude; moreover, the empirical abundance of the triangular pattern with three, negative edges (one, negative edge) becomes fully compatible with the one predicted by the SCM, on the CoW dataset (on the MMOG dataset). Still, the motifs classified as balanced according to the SBT are always significantly under-estimated and the purple one is, now, significantly over-estimated on several snapshots of the MMOG dataset.\n\nInterestingly, while the formation of triads with an odd number of negative links is strongly disfavoured according to the SCM-FT, the same benchmark under-estimates the number of triads with an even number of negative links, an evidence fully supporting the SBT; while this is particularly evident for the MMOG dataset, it holds true only for the first half of the CoW dataset, the second one confirming that such a system tend to be balanced in a very strict sense (i.e. only the triangular pattern with three, positive edges is systematically under-estimated).\n\nThe results of our analysis on the SPNs and FNs (see Fig. <ref>) let us conclude that both the SCM and the SCM-FT (i.e. the heterogeneous null models) allow for an overall better explanation of the empirical patterns to be obtained; still, the results concerning the identity of the significant ones are quite dataset-dependent. In fact, while homogeneous models favour the WBT on all datasets, heterogeneous models explain the abundance of the two, unbalanced motifs on the Monastery dataset while favouring the WBT on the N.G.H. Tribes dataset and the SBT on the Senate US, the Bitcoin Alpha and the Bitcoin OTC datasets. Financial networks keep showing a peculiar behaviour since the motif with all negative links is `more disfavoured' than the one with a unique, negative link. Again, biological networks behave differently: in these cases, in fact, frustrated patterns are largely under-estimated by any benchmark; even more so, according to both the SRGM-FT and the SCM-FT, the nodes belonging to the GRNs tend to avoid creating the balanced ones.\n\n\n\nThe conclusions supported by our null models can be (at least partially) reconciled once the evolution of the z-scores of the strong and weak balance indices are inspected: as Fig. <ref> shows, once the percentage of unbalanced motifs is considered, frustration is over-estimated by all benchmarks. For what concerns the CoW dataset, the SCM is the model performing best in reproducing (the evolution of) the SFI although it competes with the SCM-FT in reproducing (the evolution of) the WFI, on some snapshots. For what concerns the MMOG dataset, the SCM competes with the SRGM in reproducing (the evolution of) the WFI but is outperformed by both the SRGM and the SCM-FT in reproducing (the evolution of) the SFI. As already pointed out, biological networks are characterized by a non-trivial level of frustration, an evidence leading to the conclusion that their self-organization principles are markedly different from the ones shaping social networks.\n\n\n\n\n\n§ IV. DISCUSSION\n\n\nSeveral conclusions can be drawn from our analysis.\n\nFirst, the validity of social theories such as the WBT and the SBT is both dataset-dependent and model-dependent: although each benchmark considered here over-estimates the percentage of frustrated patterns characterizing social networks (according to either variant of the balance theory), a more refined analysis reveals them to (strongly, in some cases) disagree on the specific kinds of motifs to be deemed as statistically significant.\n\n\n\nSecond, homogeneous benchmarks such as the SRGM and the SRGM-FT tend to favour the WBT, as the motif deemed as unbalanced by this variant of the theory is also the only one being significantly over-estimated by null models of the kind.\n\nThird, heterogeneous benchmarks such as the SCM and the SCM-FT tend to favour the SBT; in fact, although the empirical patterns are, now, explained much better (the most accurate predictions are those provided by the SCM and concerning the SFI and the WFI), the observations which happen not to be explained by null models of the kind are related to the motifs deemed as unbalanced by the SBT, i.e. the ones with an odd number of negative links - interestingly enough, the triadic motif with just one, negative link attains a z-score which is sistematically smaller than the one attained by the triadic motif with three, negative links.\n\nFourth, according to either variant of the BT, frustration evaluated by means of the percentage of unbalanced motifs is over-estimated by any benchmark. The study of the HOFI, however, returns a quite different picture: in fact, as Fig. <ref> shows, algorithms that disregard the information provided by the edge signs depict networks whose level of mesoscopic frustration is quite large. To better illustrate this point, let us carry out a comparative analysis of the mesoscale, structural organization of the bunch of years of the CoW dataset covering the period 1986-1989. On the one hand, maximizing Newman's modularity reveals a structure with six modules (interestingly, USSR and USA, together with their allies, belong to different communities); still, the value of the HOFI attained by such a partition is HOFI≃0.13, i.e. one order of magnitude larger than the value of the HOFI output by the algorithm designed to minimize it and described in Appendix E (in words, the algorithm is fed with the number of modules output by modularity and partitions nodes in order to minimize the number of positive links between communities and the number of negative links within communities).\n\nInterestingly, a more efficient way of recovering partitions with a lower level of frustration is that of running the Girvan-Newman (GN) algorithm <cit.> that ranks edges according to their betweenness and removes them in a top-down fashion. As it needs to be stopped when the desired number of modules is reached, it can be fed with the one output by modularity, i.e. six: upon doing so, the GN algorithm individuates a partition for which HOFI≃0.07. Such a result confirms the presence of correlations between purely structural and signed quantities (in fact, negative edges are among the ones with the largest values of betweenness centrality) that can be exploited to gain more insight about the organizing principles of signed networks.\n\n\n\n§ V. CONCLUSIONS\n\n\nOur work confirms that frustration is dependent on, at least, three factors: the measure adopted to quantify it, the nature of the data, the benchmark employed for the analysis.\n\nConcerning the first and the second point, it is interesting to notice that whereas natural networks tend to establish a significantly large number of triadic relationships with an odd number of negative links, social networks do not. Still, the extent to which this happens crucially depends on the model employed as a benchmark: the presence of two pairs of alternative properties (homogeneous VS heterogeneous; free-topology VS fixed-topology) allows four, different models to be definable. Generally speaking, adopting fixed-topology benchmarks seems to enhance the detection of frustration with the corresponding, homogeneous (heterogeneous) variant favouring the WBT (SBT). The first part of such a conclusion is in line with other findings (e.g. the results in <cit.>, where the authors evaluate the statistical significance of all, signed triads under the SRGM-FT, concluding that the WBT frames empirical patterns better than the SBT); its second part, instead, is a novel result of the present contribution, which has pointed out the importance of model selection for testing social theories on real-world systems.\n\nA behavioural explanation of the aforementioned results can be provided: agents that cannot choose with whom to interact but only `how' adopt a seemingly `intolerant' behaviour, strongly avoiding to engage in frustrated relationships; on the other hand, agents that are free to choose their neighbours seem to be more `tolerant', as they establish a significantly large number of patterns composed by entirely positive edges while accepting a potential, `residual' level of frustration.\n\nAt a structural level, the evidence that all z-scores provided by fixed-topology benchmarks are (in some cases, much) smaller than the ones provided by models letting the topology vary along with the edge signs suggests that shuffling the relatively few, negative links characterizing our datasets is enough to create (strongly disfavoured) structures that are unbalanced according to one of the variants of the BT.\n\nWhen frustration is measured as the percentage of unbalanced triangles, instead, all models considered in the present paper over-estimate it; still, datasets exist whose level of frustration is perfectly compatible with that predicted by the SCM, i.e. once the tendency of single nodes to establish connections is accounted for: an example is provided by the CoW dataset, for which we find z_SFI≃ z_WFI≲ 0.\n\nThis is no longer true when non-local definitions of frustration are inspected: an example is provided by the HOFI which is not optimized alongside modularity. A similar conclusion is reached in <cit.> where authors analyze cycles of any length via a spectral approach, finding that real-world networks are far from balance at higher-order scales. In <cit.>, the authors find that the frustration of the Slashdot dataset is minimum when the number of communities is two, in agreement with the SBT, while the frustration of the Epinions dataset is minimum when the number of communities is larger than two, in agreement with the WBT; here, we find the HOFI of the bunch of years of the CoW dataset covering the period 1986-1989 to be minimum when the number of modules equals two, in agreement with the SBT (as confirmed by several runs of the algorithm described in Appendix E, carried out by imposing an increasing number of modules).\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nThis work is supported by the European Union Horizon 2020 Program under the scheme `INFRAIA-01-2018-2019 - Integrating Activities for Advanced Communities', grant agreement n. 871042, `SoBigData++: European Integrated Infrastructure for Social Mining and Big Data Analytics'. DG acknowledges support from the Dutch Econophysics Foundation (Stichting Econophysics, Leiden, the Netherlands) and the Netherlands Organization for Scientific Research (NWO/OCW). RL acknowledges support from the EPSRC grants n. EP/V013068/1 and EP/V03474X/1. We also thank Michael Szell for sharing the Pardus dataset employed for the present analysis.\n\n\n\n\n\n\n\n\n\n§ APPENDIX A.\nREPRESENTING BINARY, UNDIRECTED, SIGNED NETWORKS\n\n\nThe three functions a_ij^-=[a_ij=-1], a_ij^0=[a_ij=0] and a_ij^+=[a_ij=+1] have been defined via the Iverson's brackets notation. Iverson's brackets work in a way that is reminiscent of the Heaviside step function, i.e. Θ[x]=[x>0]; in fact,\n\n\n    a_ij^-=[a_ij=-1]=\n    1,    if   a_ij=-1\n    \n    0,    if   a_ij=0,+1\n\n(i.e. a_ij^-=1 if a_ij<0 and zero otherwise),\n\n\n    a_ij^0=[a_ij=0]=\n    1,    if   a_ij=0\n    \n    0,    if   a_ij=-1,+1\n\n(i.e. a_ij^0=1 if a_ij=0 and zero otherwise),\n\n\n    a_ij^+=[a_ij=+1]=\n    1,    if   a_ij=+1\n    \n    0,    if   a_ij=-1,0\n\n(i.e. a_ij^+=1 if a_ij>0 and zero otherwise). The matrices 𝐀^+≡{a_ij^+}_i,j=1^N and 𝐀^-≡{a_ij^-}_i,j=1^N, thus, remain naturally defined.\n\n\n\n§ APPENDIX B.\nCOUNTING TRIANGLES ON BINARY, UNDIRECTED, SIGNED NETWORKS\n\n\nA well-known result states that the abundance of node-specific, unsigned triangles reads\n\n\n    2T_i   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ija_jka_ki=[𝐀𝐀𝐀]_ii=[𝐀]^3_ii  ∀ i;\n\nlet us, now, consider signed networks: the abundances of node-specific, signed triangles with an even number of negative links read\n\n\n    T_i^(+++)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^+a_jk^+a_ki^+/2=[𝐀^+𝐀^+𝐀^+]_ii/2=[𝐀^+]^3_ii/2  ∀ i,\n    \n    T_i^(-+-)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^-a_jk^+a_ki^-/2=[𝐀^-𝐀^+𝐀^-]_ii/2  ∀ i,\n    \n    T_i^(+–)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^+a_jk^-a_ki^-=[𝐀^+𝐀^-𝐀^-]_ii=[𝐀^+(𝐀^-)^2]_ii  ∀ i,\n    \n    T_i^(–+)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^-a_jk^-a_ki^+=[𝐀^-𝐀^-𝐀^+]_ii=[(𝐀^-)^2𝐀^+]_ii  ∀ i\n\nwhile the abundances of node-specific, signed triangles with an odd number of negative links read\n\n\n    T_i^(—)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^-a_jk^-a_ki^-/2=[𝐀^-𝐀^-𝐀^-]_ii/2=[𝐀^-]^3_ii/2  ∀ i,\n    \n    T_i^(+-+)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^+a_jk^-a_ki^+/2=[𝐀^+𝐀^-𝐀^+]_ii/2  ∀ i,\n    \n    T_i^(++-)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^+a_jk^+a_ki^-=[𝐀^+𝐀^+𝐀^-]_ii=[(𝐀^+)^2𝐀^-]_ii  ∀ i,\n    \n    T_i^(-++)   =∑_j=1\n    (j≠ i)^N∑_k=1\n    (k≠ i,j)^Na_ij^-a_jk^+a_ki^+=[𝐀^-𝐀^+𝐀^+]_ii=[𝐀^-(𝐀^+)^2]_ii  ∀ i.\n\n\nLet us, now, write the expressions for the total abundances of signed triangles with an even number of negative links:\n\n\n    T^(+++)   =1/3∑_i=1^NT^(+++)_i=1/6∑_i=1^N[𝐀^+𝐀^+𝐀^+]_ii=Tr[𝐀^+𝐀^+𝐀^+]/6=Tr[(𝐀^+)^3]/6,\n    \n    T^(-+-)   =1/2∑_i=1^NT^(-+-)_i=1/2∑_i=1^N[𝐀^-𝐀^+𝐀^-]_ii=Tr[𝐀^-𝐀^+𝐀^-]/2,\n    \n    T^(+–)   =1/2∑_i=1^NT^(+–)_i=1/2∑_i=1^N[𝐀^+𝐀^-𝐀^-]_ii=Tr[𝐀^+𝐀^-𝐀^-]/2=Tr[𝐀^+(𝐀^-)^2]/2,\n    \n    T^(–+)   =1/2∑_i=1^NT^(–+)_i=1/2∑_i=1^N[𝐀^-𝐀^-𝐀^+]_ii=Tr[𝐀^-𝐀^-𝐀^+]/2=Tr[(𝐀^-)^2𝐀^+]/2;\n\nanalogously, for the abundances of triangles with an odd number of negative links, reading\n\n\n    T^(—)   =1/3∑_i=1^NT^(—)_i=1/6∑_i=1^N[𝐀^-𝐀^-𝐀^-]_ii=Tr[𝐀^-𝐀^-𝐀^-]/6=Tr[(𝐀^-)^3]/6,\n    \n    T^(+-+)   =1/2∑_i=1^NT^(+-+)_i=1/2∑_i=1^N[𝐀^+𝐀^-𝐀^+]_ii=Tr[𝐀^+𝐀^-𝐀^+]/2,\n    \n    T^(++-)   =1/2∑_i=1^NT^(++-)_i=1/2∑_i=1^N[𝐀^+𝐀^+𝐀^-]_ii=Tr[𝐀^+𝐀^+𝐀^-]/2=Tr[(𝐀^+)^2𝐀^-]/2,\n    \n    T^(-++)   =1/2∑_i=1^NT^(-++)_i=1/2∑_i=1^N[𝐀^-𝐀^+𝐀^+]_ii=Tr[𝐀^-𝐀^+𝐀^+]/2=Tr[𝐀^-(𝐀^+)^2]/2\n\n(where each numeric factor avoids the corresponding pattern to be overcounted).\n\n\nSince the trace of a matrix is invariant under a cyclic permutation of the members of its argument, the following result holds true\n\n\n    Tr[𝐀^+𝐀^-𝐀^-]/2=Tr[𝐀^-𝐀^+𝐀^-]/2=Tr[𝐀^-𝐀^-𝐀^+]/2\n\nfurther implying that T^(+–)=T^(-+-)=T^(–+). As a consequence, the number of balanced patterns according to either variant of the BT can be defined in several, equivalent ways, i.e. #_^sb=T^(+++)+T^(+–)=T^(+++)+T^(-+-)=T^(+++)+T^(–+); analogously, #_^wb=T^(+++)+T^(+–)+T^(—)=T^(+++)+T^(-+-)+T^(—)=T^(+++)+T^(–+)+T^(—).\n\n\n\n§ APPENDIX C.\nPROBABILISTIC MODELS FOR BINARY, UNDIRECTED, SIGNED NETWORKS\n\n\nThe generalization of the ERG formalism for the analysis of binary, undirected, signed graphs rests upon the constrained maximization of Shannon entropy, i.e.\n\n\n    ℒ=S[P]-∑_i=0^Mθ_i[P(𝐀)C_i(𝐀)-⟨ C_i⟩]\n\nwhere S=-∑_𝐀∈𝔸P(𝐀)ln P(𝐀), C_0≡⟨ C_0⟩≡1 sums up the normalization condition and the remaining M-1 constraints represent proper, topological properties. Such an optimization procedure defines the expression\n\n\n    P(𝐀)=e^-H(𝐀)/Z=e^-H(𝐀)/∑_𝐀∈𝔸e^-H(𝐀)=e^-∑_i=1^Mθ_iC_i(𝐀)/∑_𝐀∈𝔸e^-∑_i=1^Mθ_iC_i(𝐀)\n\nthat can be made explicit only after a specific set of constraints has been chosen.\n\n\n\n §.§ Signed Random Graph Model\n\n\nThe first set of constraints we consider is represented by the properties L^+(𝐀) and L^-(𝐀). The Hamiltonian describing such a problem reads\n\n\n    H(𝐀)=α L^+(𝐀)+β L^-(𝐀);\n\nas a consequence, the partition function reads\n\n\n    Z   =∑_𝐀∈𝔸e^-H(𝐀)=∑_𝐀∈𝔸e^-α L^+(𝐀)-β L^-(𝐀)=∑_𝐀∈𝔸e^-∑_i=1^N∑_j(>i)=1^N(α a_ij^++β a_ij^-)=∑_𝐀∈𝔸∏_i=1^N∏_j=1\n    (j>i)^Ne^-α a_ij^+-β a_ij^-\n       =∏_i=1^N∏_j=1\n    (j>i)^N∑_a_ij=-1,0,1e^-α a_ij^+-β a_ij^-=∏_i=1^N∏_j=1\n    (j>i)^N(1+e^-α+e^-β)=(1+e^-α+e^-β)^N2\n\nand induces the expression\n\n\n    P_SRGM(𝐀)=e^-α L^+(𝐀)-β L^-(𝐀)/(1+e^-α+e^-β)^ N 2≡x^L^+(𝐀)y^L^-(𝐀)/(1+x+y)^ N 2≡(p^-)^L^-(p^0)^L^0(p^+)^L^+\n\nhaving posed p^-≡e^-β/1+e^-α+e^-β≡y/1+x+y, p^0≡1/1+e^-α+e^-β≡1/1+x+y and p^+≡e^-α/1+e^-α+e^-β≡x/1+x+y, where p^+ is the probability that any two nodes are linked by a positive edge, p^- is the probability that any two nodes are linked by a negative edge and p^0 is the probability that any two nodes are no linked at all. Hence, according to the SRGM, each entry of a signed network is a random variable following a generalized Bernoulli distribution, i.e. obeying the finite scheme\n\n\n    a_ij∼[  -1   0  +1; p^- p^0 p^+ ]  ∀ i<j;\n\nnotice that while the expected value of the random variable a_ij reads ⟨ a_ij⟩=p^+-p^-, its variance reads Var[a_ij]=p^-[1+(p^+-p^-)]+p^+[1-(p^+-p^-)]. As a consequence, any network belonging to 𝔸 is a collection of i.i.d. random variables and obeys the finite scheme\n\n\n    𝐀∼⊗[  -1   0  +1; p^- p^0 p^+ ]\n\ni.e. the directed product of the N2 finite schemes above.\n\n\nThe probability, under the SRGM, that a graph has exactly L^+ positive links and L^- negative links reads\n\n\n    P(L^-,L^+)=N2L^-,L^0,L^+(p^-)^L^-(p^0)^L^0(p^+)^L^+;\n\nin other words, it is a multinomial distribution, i.e. a generalization of the binomial distribution in case there are more than two, possible outcomes for each trial. The combinatorial factor\n\n\n    N2L^-,L^0,L^+=N2!/L^-!L^0!L^+!\n\nwith L^0=N2-L=N2-(L^-+L^+), is the (multinomial) coefficient counting the total number of ways L links (L^+ of which are positive and L^- of which are negative) can be placed among the node-pairs. Hence, Eq. (<ref>) also represents the total number of graphs with a given number of signed links.\n\nNaturally, it is possible to define the marginal random variables a_ij^+∼Ber(p^+) and a_ij^-∼Ber(p^-) which, in turn, induce the marginal probability distributions P(L^-)=Bin(N2,p^-), P(L^0)=Bin(N2,p^0) and P(L^+)=Bin(N2,p^+); from the latter ones, it follows that the total number of expected, positive links reads ⟨ L^+⟩=N2p^+ while the total number of expected, negative links reads ⟨ L^-⟩=N2p^-. Obviously, ⟨ L⟩=⟨ L^+⟩+⟨ L^-⟩=N2(p^-+p^+)≡N2p. In other words, it is possible to define a `traditional' Random Graph Model whose parameter is p≡ p(a_ij=-1)+p(a_ij=+1)=p^-+p^+.\n\n\n\n\nLet us, now, move to describe the behaviour of the degree. The probability, under the SRGM, that a node has exactly k^+ positive links and k^- negative links reads\n\n\n    P(k^-,k^+)=N-1k^-,k^0,k^+(p^-)^k^-(p^0)^k^0(p^+)^k^+;\n\nagain, it obeys a multinomial distribution. The combinatorial factor\n\n\n\n\n    N-1k^-,k^0,k^+=(N-1)!/k^-!k^0!k^+!\n\nwith k^0=(N-1)-k=(N-1)-(k^++k^-), is the (multinomial) coefficient counting the total number of ways k links (k^+ of which are positive and k^- of which are negative) can be placed among the N-1 node-pairs each node individuates. The marginal random variables a_ij^+∼Ber(p^+) and a_ij^-∼Ber(p^-) also induce the marginal probability distributions P(k^-)=Bin(N-1,p^-), P(k^0)=Bin(N-1,p^0) and P(k^+)=Bin(N-1,p^+); from the latter ones, it follows that the expected, positive degree reads ⟨ k^+⟩=(N-1)p^+ while the expected, negative degree reads ⟨ k^-⟩=(N-1)p^-. Obviously, ⟨ k⟩=⟨ k^+⟩+⟨ k^-⟩=(N-1)(p^-+p^+)≡(N-1)p.\n\n\nIn order to determine the parameters that define the SRGM, let us maximize the likelihood function \n\n\n    ℒ_SRGM(x,y)≡ln P_SRGM(𝐀^*|x,y)=L^+(𝐀^*)ln(x)+L^-(𝐀^*)ln(y)-N2ln(1+x+y)\n\nwith respect to x and y. Upon doing so, we obtain the pair of equations\n\n\n    ∂ℒ_SRGM(x,y)/∂ x=L^+(𝐀^*)/x-N21/1+x+y,  ∂ℒ_SRGM(x,y)/∂ y=L^-(𝐀^*)/y-N21/1+x+y;\n\nequating them to zero leads us to find L^+(𝐀^*)=N2x/1+x+y=N2p^+=⟨ L^+⟩ and L^-(𝐀^*)=N2y/1+x+y=N2p^-=⟨ L^-⟩, i.e. \n\n\n    p^+=2L^+(𝐀^*)/N(N-1),   p^-=2L^-(𝐀^*)/N(N-1).\n\n\nNaturally, p^0≡1-p^–p^+.\n\n\n\n §.§ Signed Random Graph Model with fixed topology\n\n\nLet us, again, consider the properties L^+(𝐀) and L^-(𝐀), to be satisfied by keeping a network topology fixed. The Hamiltonian describing such a problem still reads\n\n\n    H(𝐀)=α L^+(𝐀)+β L^-(𝐀)\n\nbut induces a partition function reading\n\n\n    Z=   ∑_𝐀≡𝐀^*e^-H(𝐀)=∑_𝐀≡𝐀^*e^-α L^+(𝐀)-β L^-(𝐀)=∑_𝐀≡𝐀^*e^-∑_i=1^N∑_j(>i)=1^N(α a_ij^++β a_ij^-)=∑_𝐀≡𝐀^*∏_i=1^N∏_j=1\n    (j>i)^Ne^-α a_ij^+-β a_ij^-\n    \n    =   ∏_i=1^N∏_j=1\n    (j>i)^N∑_a_ij=-1,1e^-α a_ij^+-β a_ij^-=∏_i=1^N∏_j=1\n    (j>i)^N(e^-α+e^-β)=(e^-α+e^-β)^L\n\nwhere the formalism j>i is meant to indicate the connected pairs of nodes. In other words, the support of the distribution becomes the set of node pairs i,j, with i<j, such that |a_ij|=1, inducing a set of admissible configurations whose cardinality amounts at 2^L. The expression above leads us to find\n\n\n\n\n    P_SRGM-FT(𝐀)=e^-α L^+(𝐀)-β L^-(𝐀)/(e^-α+e^-β)^L≡x^L^+(𝐀)y^L^-(𝐀)/(x+y)^L≡(p^-)^L^-(p^+)^L^+\n\nhaving posed p^-≡e^-β/e^-α+e^-β≡y/x+y and p^+≡e^-α/e^-α+e^-β≡x/x+y where p^+ is the probability that any two, connected nodes are linked by a positive edge and p^- is the probability that any two, connected nodes are linked by a negative edge. Hence, according to the SRGM-FT, each entry of a signed network such that |a_ij|=1 is a random variable following a Bernoulli distribution, i.e. obeying the finite scheme\n\n\n    a_ij∼[  -1  +1; p^- p^+ ]  ∀ i<j | |a_ij|=1.\n\n\n\n\nThe probability, under the SRGM-FT, that a graph has exactly L^+ positive links reads\n\n\n    P(L^+)=LL^+(p^-)^L^-(p^+)^L^+=LL^+(p^+)^L^+(1-p^+)^L-L^+\n\ni.e. it is a binomial distribution, with L indicating the total number of unsigned links. As a consequence, the total number of expected, positive links reads ⟨ L^+⟩=Lp^+; analogously, L^-∼Bin(L,p^-). Similarly, the probability, under the SRGM-FT, that node i establishes exactly k_i^+ positive links reads\n\n\n    P(k_i^+)=k_ik_i^+(p^-)^k_i^-(p^+)^k_i^+=k_ik_i^+(p^+)^k_i^+(1-p^-)^k_i-k_i^+;\n\nagain, it is a binomial distribution, with k_i indicating the unsigned degree of node i. As a consequence, the expected, positive degree of node i reads ⟨ k_i^+⟩=k_ip^+; analogously, k_i^-∼Bin(k_i,p^-).\n\n\nIn order to determine the parameters that define the SRGM-FT, let us maximize the likelihood function\n\n\n    ℒ_SRGM-FT(x,y)≡ln P_SRGM-FT(𝐀^*|x,y)=L^+(𝐀^*)ln(x)+L^-(𝐀^*)ln(y)-L(𝐀^*)ln(x+y)\n\nwith respect to x and y. Upon doing so, we obtain the pair of equations\n\n\n    ∂ℒ_SRGM-FT(x,y)/∂ x=L^+(𝐀^*)/x-L(𝐀^*)/x+y,  ∂ℒ_SRGM-FT(x,y)/∂ y=L^-(𝐀^*)/y-L(𝐀^*)/x+y;\n\nequating them to zero leads us to find L^+(𝐀^*)=L(𝐀^*)x/x+y=L(𝐀^*)p^+=⟨ L^+⟩ and L^-(𝐀^*)=L(𝐀^*)y/x+y=L(𝐀^*)p^-=⟨ L^-⟩, i.e. \n\n\n    p^+=L^+(𝐀^*)/L(𝐀^*),   p^-=L^-(𝐀^*)/L(𝐀^*).\n\n\n\n\n §.§ Signed Random Graph Model: free VS fixed topology\n\n\nIn order to clarify the relationship between the SRGM and the SRGM-FT, let us write\n\n\n    P_SRGM(𝐀)   =P_RGM(𝐀)· P_SRGM(𝐀)/P_RGM(𝐀)\n       =p^L(1-p)^N2-L·(p^-)^L^-(p^+)^L^+(1-p^–p^+)^N2-L^–L^+/p^L(1-p)^N2-L\n       =p^L(1-p)^N2-L·(p^-)^L^-(p^+)^L^+(1-p^–p^+)^N2-L^–L^+/p^L^-p^L^+(1-p)^N2-L^–L^+\n       =p^L(1-p)^N2-L·(p^-/p)^L^-(p^+/p)^L^+(1-p^–p^+/1-p)^N2-L^–L^+;\n\nsince the RGM induced by the SRGM satisfies the relationship p≡ p^-+p^+, one has that\n\n\n    P_SRGM(𝐀)   =p^L(1-p)^N2-L·(p^-/p)^L^-(p^+/p)^L^+\n       =P_RGM(𝐀)· P_SRGM-FT(𝐀)\n\nthe parameters defining the SRGM-FT being, now, p^-/p and p^+/p. Beside having have an intuitive meaning, i.e.\n\n\n    p^-/p   =p^-/p^-+p^+=P(`link' ∩ `link -')/P(`link')=P(`link -' | `link'),\n    p^+/p   =p^+/p^-+p^+=P(`link' ∩ `link +')/P(`link')=P(`link +' | `link')\n\nthese expressions are also consistent with the estimations of the parameters obtained via the likelihood maximization: in fact, \n\n\n    p^-/p   =p^-/p^-+p^+=2L^-/N(N-1)/2L^-/N(N-1)+2L^+/N(N-1)=2L^-/N(N-1)/2L/N(N-1)=L^-/L,\n    p^+/p   =p^+/p^-+p^+=2L^+/N(N-1)/2L^-/N(N-1)+2L^+/N(N-1)=2L^+/N(N-1)/2L/N(N-1)=L^+/L.\n\n\n\n\n §.§ Signed Configuration Model\n\n\nThe second set of constraints we consider is represented by the properties {k_i^+(𝐀)}_i=1^N and {k_i^-(𝐀)}_i=1^N. The Hamiltonian describing such a problem reads\n\n\n    H(𝐀)=∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)];\n\nas a consequence, the partition function reads\n\n\n    Z   =∑_𝐀∈𝔸e^-H(𝐀)=∑_𝐀∈𝔸e^-∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)]=∑_𝐀∈𝔸e^-∑_i=1^N∑_j(>i)=1^N[(α_i+α_j)a_ij^++(β_i+β_j)a_ij^-]\n       =∑_𝐀∈𝔸∏_i=1^N∏_j=1\n    (j>i)^Ne^-(α_i+α_j)a_ij^+-(β_i+β_j)a_ij^-=∏_i=1^N∏_j=1\n    (j>i)^N∑_a_ij=-1,0,1e^-(α_i+α_j)a_ij^+-(β_i+β_j)a_ij^-=∏_i=1^N∏_j=1\n    (j>i)^N(1+e^-(α_i+α_j)+e^-(β_i+β_j))\n\nand induces the expression\n\n\n    P_SCM(𝐀)=e^-∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)]/∏_i=1^N∏_j=1\n    (j>i)^N(1+e^-(α_i+α_j)+e^-(β_i+β_j))≡∏_i=1^Nx_i^k_i^+(𝐀)y_i^k_i^-(𝐀)/∏_i=1^N∏_j=1\n    (j>i)^N(1+x_ix_j+y_iy_j)≡∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-)^a_ij^-(p_ij^0)^a_ij^0(p_ij^+)^a_ij^+\n\nhaving posed p_ij^-≡e^-(β_i+β_j)/1+e^-(α_i+α_j)+e^-(β_i+β_j)≡y_iy_j/1+x_ix_j+y_iy_j, p_ij^0≡1/1+e^-(α_i+α_j)+e^-(β_i+β_j)≡1/1+x_ix_j+y_iy_j and p_ij^+≡e^-(α_i+α_j)/1+e^-(α_i+α_j)+e^-(β_i+β_j)≡x_ix_j/1+x_ix_j+y_iy_j, where p_ij^+ is the probability that nodes i and j are linked by a positive edge, p_ij^- is the probability that nodes i and j are linked by a negative edge and p_ij^0 is the probability that nodes i and j are no linked at all. Hence, according to the SCM, the generic entry of a signed network is a random variable following a generalized Bernoulli distribution, i.e. obeying the finite scheme\n\n\n    a_ij∼[     -1      0     +1; p_ij^- p_ij^0 p_ij^+ ]  ∀ i<j;\n\nas a consequence, any network belonging to 𝔸 is a collection of independent random variables, each one obeying the finite scheme\n\n\n    𝐀∼⊗[     -1      0     +1; p_ij^- p_ij^0 p_ij^+ ]\n\ni.e. the directed product of the N(N-1)/2=N2 finite schemes above.\n\n\nIn the case of the SCM, L^+ is a random variable obeying the Poisson-Binomial distribution that we indicate as PoissBin(N2,{p_ij^+}_i,j=1^N); analogously, L^-∼PoissBin(N2,{p_ij^-}_i,j=1^N). Similarly, k_i^+ is a random variable obeying the Poisson-Binomial distribution that we indicate as PoissBin(N-1,{p_ij^+}_j=1^N); analogously, k_i^-∼PoissBin(N-1,{p_ij^-}_j=1^N). Hence, the total number of expected, positive links reads ⟨ L^+⟩=∑_i=1^N∑_j(>i)=1^Np_ij^+ while the total number of expected, negative links reads ⟨ L^-⟩=∑_i=1^N∑_j(>i)=1^Np_ij^-; analogously, ⟨ k_i^+⟩=∑_j(≠ i)=1^Np_ij^+ and ⟨ k_i^-⟩=∑_j(≠ i)=1^Np_ij^-.\n\n\nIn order to determine the parameters that define the SCM, let us maximize the likelihood function\n\n\n    ℒ_SCM({x_i}_i=1^N,{y_i}_i=1^N)   ≡ln P_SCM(𝐀^*|{x_i}_i=1^N,{y_i}_i=1^N)\n       =∑_i=1^Nk_i^+(𝐀^*)ln(x_i)+∑_i=1^Nk_i^-(𝐀^*)ln(y_i)-∑_i=1^N∑_j=1\n    (j>i)^Nln(1+x_ix_j+y_iy_j)\n\nwith respect to x_i and y_i, ∀ i. Upon doing so, we obtain the system of equations\n\n\n    ∂ℒ_SCM({x_i}_i=1^N,{y_i}_i=1^N)/∂ x_i   =k_i^+(𝐀^*)/x_i-∑_j=1\n    (j≠ i)^Nx_j/1+x_ix_j+y_iy_j  ∀ i,\n    ∂ℒ_SCM({x_i}_i=1^N,{y_i}_i=1^N)/∂ y_i   =k_i^-(𝐀^*)/y_i-∑_j=1\n    (j≠ i)^Ny_j/1+x_ix_j+y_iy_j  ∀ i;\n\nequating them to zero leads us to find\n\n\n    k_i^+(𝐀^*)   =∑_j=1\n    (j≠ i)^Nx_ix_j/1+x_ix_j+y_iy_j=∑_j=1\n    (j≠ i)^Np_ij^+=⟨ k_i^+⟩  ∀ i,\n    \n    k_i^-(𝐀^*)   =∑_j=1\n    (j≠ i)^Ny_iy_j/1+x_ix_j+y_iy_j=∑_j=1\n    (j≠ i)^Np_ij^-=⟨ k_i^-⟩  ∀ i.\n\n\nAlthough the system above can be solved only numerically, particular conditions exist under which the equations constituting it can be approximated and solved explicitly. They are collectively named `sparse-case' approximation of the SCM and hold true whenever x_i≪1 and y_i≪1, ∀ i. In this case, one can pose p_ij^+≃ x_ix_j and p_ij^-≃ y_iy_j, ∀ i<j, which allow the equations above to be simplified as follows\n\n\n    k_i^+(𝐀^*)   ≃∑_j=1\n    (j≠ i)^Nx_ix_j  ∀ i,\n    \n    k_i^-(𝐀^*)   ≃∑_j=1\n    (j≠ i)^Ny_iy_j  ∀ i;\n\nthe latter ones induce the expressions x_i=k_i^+(𝐀^*)/∑_j=1^Nx_j=k_i^+(𝐀^*)/√(2L^+(𝐀^*)) and y_i=k_i^-(𝐀^*)/∑_j=1^Ny_j=k_i^-(𝐀^*)/√(2L^-(𝐀^*)), ∀ i, allowing us to find\n\n\n    p_ij^+≃k_i^+(𝐀^*)k_j^+(𝐀^*)/2L^+(𝐀^*),\n    \n    p_ij^-≃k_i^-(𝐀^*)k_j^-(𝐀^*)/2L^-(𝐀^*).\n\n\nThe system of equations above is also known with the name of Signed Chung-Lu Model (SCLM).\n\n\n\n §.§ Signed Configuration Model with fixed topology\n\n\nLet us, again, consider the properties {k_i^+(𝐀)}_i=1^N and {k_i^-(𝐀)}_i=1^N, to be satisfied by keeping a network topology fixed. The Hamiltonian describing such a problem still reads\n\n\n    H(𝐀)=∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)]\n\nbut induces a partition function reading \n\n\n    Z   =∑_𝐀∈𝔸e^-H(𝐀)=∑_𝐀∈𝔸e^-∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)]=∑_𝐀∈𝔸e^-∑_i=1^N∑_j(>i)=1^N[(α_i+α_j)a_ij^++(β_i+β_j)a_ij^-]\n       =∑_𝐀∈𝔸∏_i=1^N∏_j=1\n    (j>i)^Ne^-(α_i+α_j)a_ij^+-(β_i+β_j)a_ij^-=∏_i=1^N∏_j=1\n    (j>i)^N∑_a_ij=-1,1e^-(α_i+α_j)a_ij^+-(β_i+β_j)a_ij^-=∏_i=1^N∏_j=1\n    (j>i)^N(e^-(α_i+α_j)+e^-(β_i+β_j))\n\nwhere the formalism j>i is meant to indicate the connected pairs of nodes. The expression above induces the expression\n\n\n    P_SCM-FT(𝐀)=e^-∑_i=1^N[α_i k_i^+(𝐀)+β_i k_i^-(𝐀)]/∏_i=1^N∏_j=1\n    (j>i)^N(e^-(α_i+α_j)+e^-(β_i+β_j))≡∏_i=1^Nx_i^k_i^+(𝐀)y_i^k_i^-(𝐀)/∏_i=1^N∏_j=1\n    (j>i)^N(x_ix_j+y_iy_j)≡∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-)^a_ij^-(p_ij^+)^a_ij^+\n\nhaving posed p_ij^-≡e^-(β_i+β_j)/e^-(α_i+α_j)+e^-(β_i+β_j)≡y_iy_j/x_ix_j+y_iy_j and p_ij^+≡e^-(α_i+α_j)/e^-(α_i+α_j)+e^-(β_i+β_j)≡x_ix_j/x_ix_j+y_iy_j where p_ij^+ is the probability that nodes i and j are linked by a positive edge and p_ij^- is the probability that nodes i and j are linked by a negative edge. Hence, according to the SCM-FT, each entry of a signed network such that |a_ij|=1 is a random variable following a Bernoulli distribution, i.e. obeying the finite scheme\n\n\n    a_ij∼[     -1     +1; p_ij^- p_ij^+ ]  ∀ i<j | |a_ij|=1.\n\n\nIn the case of the SCM-FT, L^+ is a random variable obeying the Poisson-Binomial distribution that we indicate as PoissBin(L,{p_ij^+}_i,j=1^N); analogously, L^-∼PoissBin(L,{p_ij^-}_i,j=1^N). Similarly, k_i^+ is a random variable obeying the Poisson-Binomial distribution that we indicate as PoissBin(k_i,{p_ij^+}_j=1^N); analogously, k_i^-∼PoissBin(k_i,{p_ij^-}_j=1^N). Hence, the total number of expected, positive links reads ⟨ L^+⟩=∑_i=1^N∑_j(>i)=1^Np_ij^+ while the total number of expected, negative links reads ⟨ L^-⟩=∑_i=1^N∑_j(>i)=1^Np_ij^-; analogously, ⟨ k_i^+⟩=∑_j(≠ i)=1^Np_ij^+ and ⟨ k_i^-⟩=∑_j(≠ i)=1^Np_ij^-.\n\n\nIn order to determine the parameters that define the SCM-FT, let us maximize the likelihood function\n\n\n    ℒ_SCM-FT({x_i}_i=1^N,{y_i}_i=1^N)   ≡ln P_SCM-FT(𝐀^*|{x_i}_i=1^N,{y_i}_i=1^N)\n       =∑_i=1^Nk_i^+(𝐀^*)ln(x_i)+∑_i=1^Nk_i^-(𝐀^*)ln(y_i)-∑_i=1^N∑_j=1\n    (j>i)^Nln(x_ix_j+y_iy_j)\n\nwith respect to x_i and y_i, ∀ i. Upon doing so, we obtain the system of equations\n\n\n    ∂ℒ_SCM-FT({x_i}_i=1^N,{y_i}_i=1^N)/∂ x_i   =k_i^+(𝐀^*)/x_i-∑_j=1\n    (j≠ i)^Nx_j/x_ix_j+y_iy_j  ∀ i,\n    ∂ℒ_SCM-FT({x_i}_i=1^N,{y_i}_i=1^N)/∂ y_i   =k_i^-(𝐀^*)/y_i-∑_j=1\n    (j≠ i)^Ny_j/x_ix_j+y_iy_j  ∀ i;\n\nequating them to zero leads us to find\n\n\n    k_i^+(𝐀^*)   =∑_j=1\n    (j≠ i)^Nx_ix_j/x_ix_j+y_iy_j=∑_j=1\n    (j≠ i)^Np_ij^+=⟨ k_i^+⟩  ∀ i,\n    \n    k_i^-(𝐀^*)   =∑_j=1\n    (j≠ i)^Ny_iy_j/x_ix_j+y_iy_j=∑_j=1\n    (j≠ i)^Np_ij^-=⟨ k_i^-⟩  ∀ i.\n\n\nThe system above can be solved only numerically.\n\n\n\n §.§ Signed Configuration Model: free VS fixed topology\n\n\nIn order to clarify the relationship between the SCM and the SCM-FT, let us write\n\n\n    P_SCM(𝐀)   =P_FM(𝐀)· P_SCM(𝐀)/P_FM(𝐀)\n       =∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij(1-p_ij)^1-a_ij·∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-)^a_ij^-(p_ij^+)^a_ij^+(1-p_ij^–p_ij^+)^1-a_ij^–a_ij^+/∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij(1-p_ij)^1-a_ij\n       =∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij(1-p_ij)^1-a_ij·∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-)^a_ij^-(p_ij^+)^a_ij^+(1-p_ij^–p_ij^+)^1-a_ij^–a_ij^+/∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij^-+a_ij^+(1-p_ij)^1-a_ij^–a_ij^+\n       =∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij(1-p_ij)^1-a_ij·∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-/p_ij)^a_ij^-(p_ij^+/p_ij)^a_ij^+(1-p_ij^–p_ij^+/1-p_ij)^1-a_ij^–a_ij^+\n\nwhere P_FM(𝐀) indicates the probability distribution of a generic, factorizable (null) model. Upon requiring p_ij≡ p_ij^-+p_ij^+, we turn the FM into a Configuration Model (CM) whose coefficients are `induced' by the ones of the SCM (in fact, k_i(𝐀^*)=k_i^-(𝐀^*)+k_i^+(𝐀^*)=∑_j(≠ i)=1^Np_ij^-+∑_j(≠ i)=1^Np_ij^+=∑_j(≠ i)=1^N[p_ij^-+p_ij^+]=∑_j(≠ i)=1^Np_ij) and obtain\n\n\n    P_SCM(𝐀)   =∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij(1-p_ij)^1-a_ij·∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-/p_ij)^a_ij^-(p_ij^+/p_ij)^a_ij^+\n       =∏_i=1^N∏_j=1\n    (j>i)^Np_ij^a_ij(1-p_ij)^1-a_ij·∏_i=1^N∏_j=1\n    (j>i)^N(p_ij^-/p_ij)^a_ij^-(p_ij^+/p_ij)^a_ij^+\n\ni.e. an expression that is the product of two probability distributions. Let us start from the second one, whose parameters read\n\n\n    p_ij^-/p_ij   =p_ij^-/p_ij^-+p_ij^+=y_iy_j/(1+x_ix_j+y_iy_j)/x_ix_j/(1+x_ix_j+y_iy_j)+y_iy_j/(1+x_ix_j+y_iy_j)=y_iy_j/x_ix_j+y_iy_j,\n    p_ij^+/p_ij   =p_ij^+/p_ij^-+p_ij^+=x_ix_j/(1+x_ix_j+y_iy_j)/x_ix_j/(1+x_ix_j+y_iy_j)+y_iy_j/(1+x_ix_j+y_iy_j)=x_ix_j/x_ix_j+y_iy_j\n\nhence inducing the probability distribution of the SCM-FT, beside keeping the intuitive meaning made explicit by the expressions p_ij^-/p_ij=P(`link -' | `link') and p_ij^+/p_ij=P(`link +' | `link'). The first one, on the other hand, can be identified with the probability distribution of the `induced' CM:\n\n\n    p_ij=p_ij^-+p_ij^+   =y_iy_j/1+x_ix_j+y_iy_j+x_ix_j/1+x_ix_j+y_iy_j=y_iy_j+x_ix_j/1+x_ix_j+y_iy_j=\n       =𝐳_i·𝐳_j/1+𝐳_i·𝐳_j=|𝐳_i||𝐳_j|cosϕ_ij/1+|𝐳_i||𝐳_j|cosϕ_ij=√((x_i^2+y_i^2)cosϕ_ij)·√((x_j^2+y_j^2)cosϕ_ij)/1+√((x_i^2+y_i^2)cosϕ_ij)·√((x_j^2+y_j^2)cosϕ_ij)≡z_iz_jcosϕ_ij/1+z_iz_jcosϕ_ij\n\nwhere 𝐳_i≡(x_i,y_i) is the vector of fitnesses of node i, z_i≡|𝐳_i|=√((x_i^2+y_i^2)) is its modulus and cosϕ_ij is the cosinus of the angle between vectors 𝐳_i and 𝐳_j. As a consequence, we can write\n\n\n    P_SCM(𝐀)=P_ICM(𝐀)· P_SCM-FT(𝐀).\n\n\nNotice that when z_i=(x_i,0) and z_j=(x_j,0), cosϕ_ij=1 and p_ij=p_ij^+=x_ix_j/1+x_ix_j, i.e. the `induced' CM reduces to the proper CM: in this case, in fact, the information about signs is `redundant' as k_i(𝐀^*)=k_i^+(𝐀^*) and k_j(𝐀^*)=k_j^+(𝐀^*). On the other hand, when z_i=(x_i,0) and z_j=(0,y_j), cosϕ_ij=0 and p_ij=0, i.e. nodes i and j cannot be linked: in this case, in fact, k_i(𝐀^*)=k_i^+(𝐀^*) but k_j(𝐀^*)=k_j^-(𝐀^*), whence the impossibility of (consistently) attributing a sign to the edge between i and j.\n\n\n\n§ APPENDIX D.\nNUMERICAL OPTIMIZATION OF LIKELIHOOD FUNCTIONS\n\n\nIn order to numerically solve the systems of equations defining the SCM and the SCM-FT, we can follow the guidelines provided in <cit.>: more specifically, we will adapt the iterative recipe provided there to our (binary, undirected, signed) setting. First, let us consider the SCM whose system of equations can be rewritten as\n\n\n    x_i   =k_i^+(𝐀^*)/∑_j=1\n    (j≠ i)^Nx_j/1+x_ix_j+y_iy_j⟹ x_i^(n)=k_i^+(𝐀^*)/∑_j=1\n    (j≠ i)^Nx_j^(n-1)/1+x_i^(n-1)x_j^(n-1)+y_i^(n-1)y_j^(n-1)  ∀ i,\n    \n    y_i   =k_i^-(𝐀^*)/∑_j=1\n    (j≠ i)^Ny_j/1+x_ix_j+y_iy_j⟹ y_i^(n)=k_i^-(𝐀^*)/∑_j=1\n    (j≠ i)^Ny_j^(n-1)/1+x_i^(n-1)x_j^(n-1)+y_i^(n-1)y_j^(n-1)  ∀ i;\n\nanalogously, the system of equations defining the SCM-FT can be rewritten as \n\n\n    x_i   =k_i^+(𝐀^*)/∑_j=1\n    (j≠ i)^Nx_j/x_ix_j+y_iy_j⟹ x_i^(n)=k_i^+(𝐀^*)/∑_j=1\n    (j≠ i)^Nx_j^(n-1)/x_i^(n-1)x_j^(n-1)+y_i^(n-1)y_j^(n-1)  ∀ i,\n    \n    y_i   =k_i^-(𝐀^*)/∑_j=1\n    (j≠ i)^Ny_j/x_ix_j+y_iy_j⟹ y_i^(n)=k_i^-(𝐀^*)/∑_j=1\n    (j≠ i)^Ny_j^(n-1)/x_i^(n-1)x_j^(n-1)+y_i^(n-1)y_j^(n-1)  ∀ i.\n\n\nIn order for each iterative recipe to converge, an appropriate vector of initial conditions need to be chosen; here, we have opted the following ones: x_i=k_i^+(𝐀^*)/√(2L^+(𝐀^*)), ∀ i and y_i=k_i^-(𝐀^*)/√(2L^-(𝐀^*)), ∀ i. Besides, we have adopted two, different stopping criteria: the first one is a condition on the Euclidean norm of the vector of differences between the values of the parameters at subsequent iterations, i.e. ||Δθ⃗||_2=√(∑_i=1^N(Δθ_i)^2)≤10^-8; the second one is a condition on the maximum number of iterations of our iterative algorithm, set to 10^3.\n\nThe accuracy of our method in estimating the constraints has been evaluated by computing the maximum absolute error (MAE), defined as \n\n\n    MAE=max_i{|k_i^+(𝐀^*)-⟨ k_i^+⟩|, |k_i^-(𝐀^*)-⟨ k_i^-⟩|}\n\n(i.e. as the infinite norm of the difference between the vector of the empirical values of the constraints and the vector of their expected values) and the maximum relative error (MRE), defined as\n\n\n    MRE=max_i{|k_i^+(𝐀^*)-⟨ k_i^+⟩|/k_i^+(𝐀^*), |k_i^-(𝐀^*)⟨ k_i^-⟩|/k_i^-(𝐀^*)}\n\n(i.e. as the infinite norm of the relative difference between the vector of the empirical values of the constraints and the vector of their expected values).\n\nThe following tables sum up the time employed by our algorithm to converge as well as its accuracy in reproducing the constraints defining the SCM and the SCM-FT on each network considered in the present contribution. Overall, our method is fast and accurate: the numerical errors never exceed O(10^-1) and the time employed to achieve such an accuracy never exceeds minutes. To be noticed that the time required by our algorithm to solve the SCM is usually smaller than that required to solve the SCM-FT - although such a difference rises with the size of the considered configuration.\n\n\n\n\n\n\n\n\n\n\n\n§ APPENDIX E.\nINSPECTING HIGHER-ORDER FRUSTRATION ON SIGNED NETWORKS\n\n\nIn order to inspect the behaviour of frustration at the mesoscopic level, we have compared the partition induced by Newman's modularity maximization\n\n\n    Q=1/2L∑_i=1^N∑_j=1^N[a_ij-k_ik_j/2L]δ_c_ic_j\n\nwith the partition induced by the minimization of the `higher-order' frustration index reading\n\n\n    HOFI=L^+_∘+L^-_∙/L\n\nand measuring the percentage of `misplaced' links, i.e. the total number of positive links between communities, L^+_∘, plus the total number of negative links within communities, L^-_∙, divided by the total number of links, L.\n\nThe definition above aims at capturing the `philosophy' behind the concept of frustration, introduced by Heider, rephrased by the structure theorem (stating that a signed network is balanced if and only if its nodes can be partitioned into two subsets with the links within them being positive and the links between them being negative) and extended by Davis, whose definition allows the number of subsets to be larger than two.\n\nA frustration-based community detection algorithm where the number of blocks, say k, is fixed a priori, hence remains naturally defined (see below).\n\n\n\n\n\n\n\n\n\n"}