{"entry_id": "http://arxiv.org/abs/2303.07021v1", "published": "20230313113905", "title": "On the Inertial Rotational Brownian Motion of Arbitrarily Shaped Particles", "authors": ["Amitesh S. Jayaraman", "Jikai Ye", "Gregory S. Chirikjian"], "primary_category": "cond-mat.stat-mech", "categories": ["cond-mat.stat-mech", "math-ph", "math.MP"], "text": "\n\nAPS/123-QED\n\n\n\n\n\namiteshs@stanford.edu\n Department of Mechanical Engineering, Stanford University, CA 94305, USA\n\njikai.ye@nus.edu.sg\n\nDepartment of Mechanical Engineering, National University of Singapore, 117575, Singapore\n\n\nmpegre@nus.edu.sg\n\nDepartment of Mechanical Engineering, National University of Singapore, 117575, Singapore\n\n\n\n\n\n\n\n\n\n\n\nThis article reports the modeling of inertial rotational Brownian motion as an Ornstein-Uhlenbeck process evolving on the cotangent bundle of the rotation group, SO(3). The benefit of this approach and the use of a different parameterization of rotations allows the handling of particles with arbitrary shapes, without requiring any simplifying assumptions on the shape or the structure of the viscosity tensors. The resultant Fokker-Planck equation for the joint orientation and angular momentum probability distribution can be solved approximately using an `ansatz' Gaussian distribution in exponential coordinates.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn the Inertial Rotational Brownian Motion of Arbitrarily Shaped Particles\n    Gregory S. Chirikjian\n    March 30, 2023\n==========================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe study of rotational Brownian motion has more than 100 years of history, commencing with Debye's pioneering work <cit.> in 1913. Rotational Brownian motion, as opposed to translational Brownian motion, is the phenomenon observed when a three-dimensional body is subject to random torques—giving rise to a random trajectory on the group of rigid body rotations, SO(3). Despite the fact that research in this area commenced more than a century ago, rotational Brownian motion continues to be relevant in a variety of fields beyond soft matter and colloidal science, such as attitude estimation <cit.> and even exotic applications in astrophysics <cit.>. Debye had considered non-inertial rotational Brownian motion and Perrin <cit.> furthered this analysis by casting non-inertial rotational Brownian motion as a stochastic process on the rotation group SO(3).\n\nObtaining the joint orientation and angular velocity/momentum probability density for the inertial theory of rotational Brownian motion is a more challenging problem for arbitrary body geometries due to the presence of the nonlinear cross-product term in Euler's equations for rigid body motions. Many researchers have previously considered various approximations of the problem. Hubbard <cit.> for instance analyzed the rotational Brownian motion of spherical particles as dynamics evolving on the state space, SO(3)× so(3). However, his analysis is approximate as well and he performed an iterative solution of the resulting Fokker-Planck equations rather than a direct exact solution. Fixman <cit.> considered the dynamics over phase space, SO(3) × so^*(3), but his analysis is restricted to symmetric top-shaped particles. Finally, Coffey <cit.> considered Brownian motion in the phase space, i.e., SO(3)× so^*(3) for needle-shaped particles but does not solve the Fokker-Planck equations directly. \n\nThere has also been some research in the context of obtaining marginalized versions of the joint probability densities, i.e., Hubbard <cit.> has also considered the probability distribution over angular velocity alone for arbitrarily shaped particles—but the results are most accurate for small deviations from sphericity. Steele on the other hand <cit.> considers the probability distribution over orientation alone, but focuses primarily on a spherical particle. Ivanov <cit.> considers the probability distribution over orientation for arbitrarily shaped particles, with the Brownian motion process modeled as a random walk. \nFinally, Ford et. al., <cit.> derive orientational and angular velocity autocorrelation functions for asymmetric tops but assume that the viscous tensor and the inertia tensor are simultaneously diagonalizable; moreover, their expressions are derived by a perturbative expansion and are thus approximate. \nMoreover, they do not attempt to directly solve for the probability density function.\n\nThis paper considers the inertial rotational Brownian motion problem for an arbitrarily shaped three-dimensional rigid body, with no constraints on the structure of the viscosity tensor or moment of inertia. \nWe reformulate the inertial rotational Brownian motion as a stochastic process on the cotangent bundle group of SO(3).\nA small-time closed-form expression is derived for the probability density function (PDF) over orientation and angular momentum for the particle. \nThe parameters of the PDF are determined by an integration, which has an analytic expression in some cases and can be solved numerically in general.\n\n\n\n§  GOVERNING EQUATIONS\n\n\n\n\n §.§ Equations of Motion\n\nConsider a three-dimensional rigid body with the moment of inertia tensor I (in a body frame of reference). It is suspended in a fluid medium and at any point of time, its orientation is encoded by a three-dimensional rotation matrix, R∈ SO(3). The body frame angular velocity of the body is ω_R∈ℝ^3 and defined such that ω_R = (R^TṘ)^∨ where ∨ is a bijection converting elements from the Lie algebra of SO(3) to ℝ^3 (in other words, vectorizes 3× 3 skew-symmetric matrices). The angular momentum of the body is then ℓ = Iω_R.\n\nThis body is subject to both a viscous torque that is proportional to the angular velocity of the body, i.e. of the form Cω_R, as well as a random torque (in the context of Brownian motion, this arises from molecular collisions) η. The equation of motion is then the familiar Euler equation for angular momentum with random torque:\n\n    (ℓ̇ + I^-1ℓ×ℓ) = -CI^-1ℓ + η.\n\nWriting this as a stochastic differential equation by noting that η dt = B dW, where dW is a Wiener process increment with zero mean and variance dt, we have,\n\n    (ℓ̇ + I^-1ℓ×ℓ) dt = -CI^-1ℓ dt + B dW.\n\nNote that B controls the variance and `color' of the noise term. \nIn the non-inertial theory, the cross-product term I^-1ℓ×ℓ is assumed to be much smaller than the viscous torque CI^-1ℓ.\nThis is true when the viscosity of the fluid is relatively large and the particles are small.\nWe explain in Appendix I that these two terms can be of a comparable magnitude when the fluid is not viscous enough, e.g., in the air, where the inertial theory should apply.\n\nIn addition, since we are interested in obtaining the probability distribution over phase space (R,ℓ) we also have the following definition,\n\n    (R^TṘ)^∨ dt = I^-1ℓ dt.\n\nSimultaneously solving (<ref>) and (<ref>) we obtain the joint distribution f(R,ℓ;t) on phase space. In the following section, we describe the geometry of this phase space.\n\n\n\n §.§ Geometry of Phase Space\n\nFrom Hamiltonian dynamics, the phase space can be represented by the set of all orientation and angular momentum states that the body can occupy. We imbue an additional semi-direct product structure to this space so that we have a group SO(3)⋉ℝ^3 as the phase space on which the system evolves. From <cit.> we see that this is in fact the cotangent bundle group of SO(3). A group element, h(R,ℓ) ∈ SO(3)⋉ℝ^3 is constructed as,\n\n    h(R,ℓ) = (\n        [ R^T   ℓ; 0^T   1 ]).\n\nNote that we parameterize rotations with R^T instead of R (nevertheless, this group is simply a different parameterization of SE(3)).\n\nThe Lie algebra of SO(3)⋉ℝ^3 is six-dimensional, and can be expressed using the same orthonormal basis as se(3):\n\n    Ẽ_1 =\n        [  0  0  0  0;  0  0 -1  0;  0  1  0  0;  0  0  0  0 ],\n          Ẽ_2 =\n        [  0  0  1  0;  0  0  0  0; -1  0  0  0;  0  0  0  0 ],\n\n\n    Ẽ_3 =\n        [  0 -1  0  0;  1  0  0  0;  0  0  0  0;  0  0  0  0 ],\n          Ẽ_4 =\n        [ 0 0 0 1; 0 0 0 0; 0 0 0 0; 0 0 0 0 ],\n\n\n    Ẽ_5 =\n        [ 0 0 0 0; 0 0 0 1; 0 0 0 0; 0 0 0 0 ]  and  Ẽ_6 =\n        [ 0 0 0 0; 0 0 0 0; 0 0 0 1; 0 0 0 0 ].\n\nThe adjoint matrix of the group is [Ad(h)] and is given by,\n\n    [Ad(h)] = \n        [  R^T    𝕆; LR^T  R^T ],\n\nwhere L^∨ = ℓ. Moreover, the “little ad\" operator is given by [ad(X)] where X is in the Lie algebra of SO(3)⋉ℝ^3. If,\n\n    X = \n        [   Ω   v; 0^T   0 ],\n\nthen for V^∨ = v,\n\n    [ad(X)] = \n        [ Ω 𝕆; V Ω ].\n\nThe right and left Jacobians, 𝒥_L and 𝒥_R can be calculated as,\n\n    𝒥_r = \n        [ J_r(R^T)        𝕆;        𝕆        R ]  and  𝒥_l = \n        [  J_l(R^T)         𝕆; LJ_l(R^T)         𝕀 ],\n\nwhere J_r and J_l are the right and left Jacobians for SO(3) given as,\n\n    J_r(R(q)) = [(R^T∂ R/∂ q_1)^∨,⋯,(R^T∂ R/∂ q_3)^∨],\n\n\n    J_l(R(q)) = [(∂ R/∂ q_1 R^T)^∨,⋯,(∂ R/∂ q_3R^T)^∨].\n\nUsing the definitions for the left and right Jacobians, we can construct the left and right Lie derivatives for this group (where the summation is implied over repeated indices),\n\n    Ẽ^R_i u(h(q,ℓ))    = \n    \n    E^L_i u(h(q,ℓ))  (i, j = 1, 2, 3)\n    \n    \n    R_(i-3),j∂ũ/∂ℓ_j   (j = 1, 2, 3; i = 4, 5, 6)\n    Ẽ^L_i u(h(q,ℓ))    = \n    \n    E^R_i u(h(q,ℓ)) - ε_ijkℓ_j∂ũ/∂ l_k  (i,j,k = 1, 2, 3)\n    \n    \n    -∂ũ/∂ℓ_i-3  (i = 4, 5, 6)\n\nwhere h is parameterized by q for the rotation and ℓ for angular momentum and u(h(q,ℓ)) = ũ(q,ℓ). Also, ε_ijk is the Levi-Civita symbol. We use the formulae, E^R f = [J_r]^-T∂ u/∂q and E^L f = -[J_l]^-T∂ u/∂q, and, Ẽ^R f = [𝒥_R]^-T∂ u/∂ξ and Ẽ^L f = -[𝒥_L]^-T∂ u/∂ξ where ξ = [q^T,ℓ^T]^T.\n\n\n\n §.§ Ornstein-Uhlenbeck Process in SO(3)⋉ℝ^3\n\n\nWe observe that the left-hand side of the equations of motion (<ref>,<ref>) can be written as a component of (ḣh^-1)^∨ dt where h is given in (<ref>). Since,\n\n    (ḣh^-1)^∨ =\n        [        Ṙ^TR -Ṙ^TRℓ + ℓ̇;         0^T           0 ]^∨.\n\nand (Ṙ^TR)^∨ = -(R^TṘ)^∨ = -ω_R. This also implies that -Ṙ^TRℓ = ω_R×ℓ and we have,\n\n    (ḣh^-1)^∨ = \n        [       -ω_R; ℓ̇ + ω_R×ℓ ].\n\nComparing with (<ref>,<ref>) we see that,\n\n    (ḣh^-1)^∨ dt = -\n        [  I^-1ℓ; CI^-1ℓ ]  dt +\n        [ 𝕆 𝕆; 𝕆 B ]Ⓢ dw,\n\nwhich is a (left) stochastic differential equation evolving on SO(3)⋉ℝ^3; the Ⓢ makes it explicit that this is a Stratonovich equation. Notably, the troublesome cross-product term is absorbed into the definition of h, therefore, avoiding the need to deal with that term explicitly. Setting \n\n    m = \n    [  I^-1ℓ; CI^-1ℓ ]  and  B̃ = \n    [ 𝕆 𝕆; 𝕆 B ],\n\nthe Fokker-Planck equation for the probability density function u(h,t) on SO(3)^T⋉ℝ^3 is,\n\n    ∂ u/∂ t =- ∑_i = 1^6 E^L_i(m_i u) + 1/2∑_i,j = 1^6 (B̃B̃^T)_ijE^L_iE^L_j u.\n\nThe procedure to go from a stochastic differential equation evolving on a group to a corresponding Fokker-Planck equation is provided in detail in <cit.>. In coordinates ξ = [q^T,ℓ^T]^T, we express the equation in terms of ũ(ξ,t) = u(h(ξ),t) as,\n\n    ∂ũ/∂ t = -∑_i,j = 1^6 Q_ijẼ^L_i(ξ_j ũ) + 1/2∑_i,j = 1^6 (B̃B̃^T)_ijẼ^L_iẼ^L_j ũ,\n\nwhere Q is,\n\n    Q = \n        [     𝕆  I^-1;     𝕆 CI^-1 ],\n\ntherefore describing a degenerate Ornstein-Uhlenbeck process. The matrix Q has a maximum rank of 3, and therefore only 3 non-zero singular values.\n\n\n\n §.§ Maxwell-Boltzmann Limit\n\nThe limiting distribution at t→∞ is a Maxwell-Boltzmann distribution for angular momentum and a uniform distribution over orientation, i.e.,\n\n    u_∞(R,ℓ) = 1/Zexp(-1/2βℓ^TI^-1ℓ),\n\nwhich is known from thermodynamics. Here, β = 1/k_BT where k_B is the Boltzmann constant, and Z is the partition function to normalize the distribution over phase space. To ensure that this limiting distribution can be obtained we also need,\n\n    C+C^T = β BB^T,\n\nby the fluctuation-dissipation theorem. \nA proof using a non-parametric approach is provided in Appendix II.\nFor usual physical systems, this reduces to,\n\n    2C = β BB^T,\n\nbecause C is a symmetric matrix as per Onsager's reciprocity theorem <cit.>. \nNote that a similar relationship between a diffusion matrix and viscous matrix is derived in <cit.>.\nHowever, their diffusion matrix D_0 has a different physical meaning from the BB^T we are using here.\n\n\n\n§ SOLUTION METHODOLOGY AND RESULTS\n\nTo approximately solve the Fokker-Planck equation in (<ref>) we adapt the solution provided by Riksen in <cit.>. We consider the initial conditions of ũ(h,0) = δ_G(h) where δ_G(h) is the group Dirac delta function concentrated at the identity element (this implies that the particle has zero angular velocity at t = 0 and all orientations are defined with respect to the orientation at t = 0). If the probability distribution is sufficiently concentrated we can make the following approximation,\n\n    Ẽ^L_i ≈ - ∂/∂ξ_i,\n\nso that we have u(h,t) = ũ(ξ,t) for sufficiently small time t,\n\n    ∂ũ/∂ t = ∑_i,j = 1^6 Q_ij∂/∂ξ_i(ξ_j ũ) + 1/2∑_i,j = 1^6 (B̃B̃^T)_ij∂^2ũ/∂ξ_i∂ξ_j,\n\nwhich solves to yield a Gaussian with mean μ(t) = 0 and covariance Σ(t) that varies as,\n\n    Σ(t) = ∫_0^t [e^-Qτ]B̃B̃^T[e^-Qτ]^T dτ.\n\nAssuming that this is the solution on the Lie algebra we can construct the solution on the group as,\n\n    u(h,t) =1/(2π)^3|det Σ(t)|^1/2exp(-1/2[log^∨ h]^T Σ^-1(t)[log^∨ h]),\n\nwhere log is the matrix logarithm. Hence, we obtain a closed-form approximate solution for the joint probability distribution evolving in phase space. We also note that the group theoretic mean and covariance are defined as,\n\n    ∫_G log^∨(h ∘μ^-1) u(h,t) dh  ≐ 0,\n\nand,\n\n    Σ(t)  ≐ ∫_G [log^∨(h ∘μ^-1)][log^∨(h ∘μ^-1)]^T u(h,t) dh.\n\n\n\n\n\n\n\n\n §.§ Example: Diagonal and Isotropic Viscous Tensor\n\nConsider a body fixed frame that is oriented along the eigenvectors of the moment of inertia tensor I so that we have a diagonal moment of inertia tensor, I = diag(I_1,I_2,I_3). Then assume that the viscous tensor is of the form C = c𝕀 (i.e., diagonal and isotropic). The B̃ is also given as,\n\n    B̃ = \n        [  𝕆  𝕆;  𝕆 b𝕀 ],\n\nwhere 2c = β b^2 from (<ref>). Then, \n\n    Q = [                       𝕆 diag(1/I_1,1/I_2,1/I_3);                       𝕆 diag(c/I_1,c/I_2,c/I_3) ],\n\nso that,\n\n    Σ(t) = ∫_0^t [e^-Qτ]B̃B̃^T[e^-Qτ]^T dτ\n    \n        = [ σ_11(t) σ_12(t); σ_21(t) σ_22(t) ],\n\nwhere,\n\n    σ_11(t)    = b^2diag(σ_11(I_1;t),σ_11(I_2;t),σ_11(I_3;t))\n    σ_12(t)    = b^2diag(σ_12(I_1;t),σ_12(I_2;t),σ_12(I_3;t))\n    σ_21(t)    = b^2diag(σ_21(I_1;t),σ_21(I_2;t),σ_21(I_3;t))\n    σ_22(t)    = b^2diag(σ_22(I_1;t),σ_22(I_2;t),σ_22(I_3;t)),\n\nsuch that,\n\n    σ_11(I_i;t) = b^2/c^2(t - 3I_i/2c- I_i/2c(e^-2ct/I_i - 4e^-ct/I_i))\n       σ_12(I_i;t) = σ_21(I_i;t) = b^2/c(I_i/ce^-ct/I_i - I_i/2ce^-2ct/I_i - I_i/2c)\n       σ_22(I_i;t) = -I_i b^2/2c(e^-2ct/I_i-1).\n\nWe see that when we set I_i = 0 for i = 1, 2, 3, we obtain σ_11(t) = b^2 t/c^2 and σ_12(t) = σ_21(t) = σ_22(t) = 0. In fact, this is the solution obtained from a non-inertial theory as will be explored in the following section.\n\n\n  §.§.§ Comparison against non-inertial theory\n\nIn the non-inertial theory of rotational Brownian motion, the governing stochastic differential equation is of the form,\n\n    C (R^TṘ)^∨ dt    = BdW.\n\nThis yields the following Fokker-Planck equation for u(R,t),\n\n    ∂ u/∂ t =  1/2∑_i,j=1^3 D_ijE^R_iE^R_j u,\n\nfor D = C^-1BB^TC^-T, which is a drift-less diffusion on SO(3). If we consider the solution at small times (which can be approximated via covariance propagation <cit.>) and an initial condition of zero initial angular velocity, we obtain the following approximate solution:\n\n    u(R,t)    = 1/(2π)^3/2|Dt|^1/2exp(-1/2t[log^∨ R]^TD^-1[log^∨ R]).\n\nNoting that the covariance terms corresponding to the three-dimensional vector log^∨ R is σ_11 from (<ref>), we proceed to make a comparison with the results from the theory of inertial rotational Brownian motion. \nNow, if B = b𝕀 is the identity matrix and C = c𝕀, this gives Σ = Dt = b^2t/c^2𝕀. However, by setting I_1 = I_2 = I_3 = 0 in (<ref>), we obtain the same form for the orientational covariance σ_11(t) from (<ref>).\n\n\n\n  §.§.§ Spherical particles\n\nAs a special case, we consider a spherical particle, where I_1 = I_2 = I_3, to demonstrate the underlying ideas.\n\n\nAs ground truth, we compare against the covariance (the mean is always identity) obtained from an Itô-Gangolli integration of the governing stochastic differential equation in (<ref>). That is, we evolve an ensemble of i = 1,⋯,N particles on the group with time as follows with the following update over a time step dt:\n\n    h_i(t + dt) = exp(dX)∘ h_i(t),\n\nwhere dX^∨ is the right-hand side of (<ref>). A probability distribution can be constructed from these sample points as,\n\n    u_s(h,t) = 1/N∑_i=1^Nδ(h∘ h_i^-1(t)),\n\nand the sample covariance is,\n\n    Σ_s(t) = 1/N∑_i=1^N[log^∨ h_i(t)][log^∨ h_i(t)]^T.\n\nThe above assumes that the sample mean is identity at all times. This is seen as a reasonable approximation since numerically, the sample mean deviates from the identity with only a 3% error (measured by a relative Frobenius norm) for N = 30,000 particles. \n\nIn what follows, we assume N = 30,000 particles and compare the covariance obtained from the Ornstein-Uhlenbeck solution in (<ref>) with the sampled covariance for t = 3 units (and time step of dt = 1× 10^-3 units). Additionally, I = C = 𝕀 and β = 0.2 (the fluctuation-dissipation theorem sets the value of b = √(2/β)). Furthermore, we decompose the 6×6 covariance matrix into blocks of 3×3 matrices as,\n\n    Σ = \n        [   Σ_RR   Σ_Rℓ; Σ_Rℓ^T   Σ_ℓℓ ],\n\nwhere Σ_RR and Σ_ℓℓ are related to the covariance of the distribution once the distribution is marginalised over angular momenta and orientation respectively; Σ_Rℓ is the covariance for the coupling of the two variables. \n\nThe error between the covariance matrix obtained from the Ornstein-Uhlenbeck solution in (<ref>) and the sample covariance matrix is computed as,\n\n    Error(t) = ||Σ(t) - Σ_s(t)||_F/||Σ_s(t)||_F,\n\nwhere ||⋯||_F is the Frobenius norm. The evolution of this relative error with time is plotted in Figure <ref>. Notably, the error is small (order of 1%) till t≈ 0.6 units after which the error grows monotonically, and the approximation is no longer valid. \n\n\nSince for a sphere, all three covariance matrices can be expected to be multiples of 𝕀 (from (<ref>)), we now seek to compare the time-evolution for (co)variance Σ_RR, Σ_Rℓ and Σ_ℓℓ; that is, for a covariance Σ = k𝕀, we compare in terms of the scalar k.\nFor the sample covariance, we use the average of diagonal elements as k.\n\n\n  \nCovariance for orientations If the probability density for orientation for a non-inertial rotational Brownian motion is solved by covariance propagation, we obtain Σ_RR = tD𝕀 where D = b^2/c^2. \nWe also plot this solution along with that from the Ornstein-Uhlenbeck approximation (for inertial theory). Finally, from Section <ref> we know that the limiting orientational distribution is a uniform distribution in SO(3), i.e., u_∞(R) = 1/(8π^2) so that we have,\n\n    ∫_SO(3)1/8π^2 dg = 1/8π^2∫_0^2π∫_0^π∫_0^2πsinβ dα dβ dγ = 1,\n\nwhere the integral over SO(3) is decomposed to an integral over the ZYZ Euler angles (α,β,γ). The limiting covariance is then,\n\n    Σ_RR,∞ = 1/8π^2∫_G[log^∨ g][log^∨ g]^T dg.\n\nNow we parameterize g = g(q) in terms of exponential coordinates, i.e., g = exp(q^∧). In this parameterisation, \n    dg = 2(1 - cos||q||)/||q||^2 dq.\n Since q∈ℝ^3, we imagine decomposing the integral into an integration over a solid ball of radius r = ||q|| where 0≤ r < π. Then, letting the polar angle be θ, for 0≤θ < π, and the azimuthal angle be ϕ, for 0≤ϕ < 2π, we can write, q = [rcosϕsinθ,rsinϕsinθ,rcosθ]^T. Thus,\n\n    Σ_RR,∞   = 1/8π^2∫_0^π∫_0^2π∫_0^πqq^T 2(1 - cos r)sinθ dθ dϕ dr\n       = π^2 + 6/9𝕀.\n\nFigure <ref> is a plot comparing the (co)variance obtained from the Ornstein-Uhlenbeck solution in (<ref>) along with the corresponding term in the sample covariance. Additionally, the covariance from the non-inertial theory and that for the limiting uniform distribution (<ref>) are plotted. \n\n\nWe note that the covariance from the Ornstein-Uhlenbeck solution (<ref>) begins to deviate from the sample covariance after about t≈ 0.6 units. Numerically, this is when the covariance becomes large enough that a distribution in the ℝ^3 space spanned by the exponential parameterisation of orientation has sufficiently large volume outside the solid ball, ||log^∨ g|| < π for g ∈ SO(3). The curvature of SO(3), therefore, makes the small covariance assumption that motivated the Ornstein-Uhlenbeck solution invalid. This is true even of the non-inertial theory in Figure <ref> and thus, none of the propagation or Ornstein-Uhlenbeck solutions are able to recover the limiting uniform distribution (corresponding to thermal equilibrium).\n\n\n\n  \nCovariance for orientation-angular momentum coupling Figure <ref> depicts the time evolution of the coupling covariance, comparing the Ornstein-Uhlenbeck solution with the corresponding sample covariance.\n\nAt large times, the coupling (co)variance goes to zero, suggesting the decoupling between angular momentum and orientation, which is seen from the limiting Maxwell-Boltzmann solution in (<ref>).\n\n\n  \nCovariance for angular momentum In exponential coordinates, \n    log^∨ h = [          q; J_l^-1(q)ℓ ],\n\nwhere J_l is the left Jacobian for SO(3) for exponential coordinates <cit.>. Thus Σ_ℓℓ is taken to refer to the (co)variance associated with the vector y = J_l^-1(q)ℓ instead. \nUsing the Maxwell-Boltzmann distribution and the definition (<ref>), we can obtain that the time limit covariance for y is Σ_ℓℓ,∞=π^2+3/9β I.\nFigure <ref> depicts the time evolution for the covariance associated with angular momentum, comparing the Ornstein-Uhlenbeck solution with the corresponding sample covariance and the time limit covariance.\n\n\n\n\n§ CONCLUSIONS\n\n\nWe have provided a short-time closed-form expression of the probability density function on the phase space for an arbitrary-shaped particle undergoing an inertial rotational Brownian motion.\nThe phase space is described by the cotangent bundle group of SO(3).\nAn example, where the parameters of the PDF have an analytic expression, is shown and compared to the ground truth and the approximate solution of the non-inertial theory.\nFor more general cases, it is possible to use a numerical method to obtain the parameters and utilize the simple closed-form PDF to perform further calculations.\n\nOne possible future work is to fit a spline to connect the small-time solution with the steady-state Boltzmann distribution.\nIt requires an additional estimation of the relaxation time.\nAnother extension is to calculate the covariance matrix without using the approximation (<ref>).\nA possible approach is to estimate the time derivative of the covariance matrix (<ref>) using the Fokker-Planck equation on phase space (<ref>) and the Lie derivative approximations in Appendix III.\n\nAcknowledgements\nThis work was supported by NUS Startup  grants A-0009059-02-00 and A-0009059-03-00, National Research Foundation, Singapore, under its Medium Sized Centre Programme - Centre for Advanced Robotics Technology Innovation (CARTIN),  sub award A-0009428-08-00, and AME Programmatic Fund Project MARIO A-0008449-01-00.\n\n\n\n\n\n\n\n\n\n\n\n\n§ APPENDIX I\n\n\nIn this section, we give a real-world example where the viscous torque is comparable to the torque introduced by inertia.\nThe modeling details and numerical results are presented.\n\nAssume many Tobacco Mosaic Virus (TMV) particles are floating and rotating in the air subject to viscous torque and a random torque.\nA TMV particle is a long, stick-like particle, whose total length, inner, and outer diameter are 300 nm, 4 nm, and 18 nm respectively.\nIt is composed of coat proteins and a single-strand RNA molecule inside, with a total particle weight 3.94× 10^7 Da <cit.>.\nWe model a TMV particle as a solid ellipsoid with a major axis a=150 nm, two minor axes b=c=9 nm and mass M=3.94× 10^7   Da.\nThe viscous torque for a prolate ellipsoid is known <cit.>,\n\n    T^hyd=16/3πη d^3  ω / [ 1/2lna+d/a-d-ad/b^2],\n\nwhere η is the shear viscosity of the fluid and d=√(a^2-b^2).\nThe inertia tensor of an ellipsoid is (when the frame is aligned with the principle axes):\n\n    I=M/5[ b^2+c^2       0       0;       0 a^2+c^2       0;       0       0 a^2+b^2 ],\n\nwhere M is the total mass.\n\nThe long-term distribution of the angular velocity of these particles should be a Maxwell-Boltzmann distribution,\n\n    ũ_∞(ω) = 1/Zexp(-1/2k_B Tω^TI ω),\n\nfollowing the distribution of the angular momentum (<ref>).\n\nIf an angular velocity ω_0 is relatively “usual” for the distribution (<ref>), the value 1/2k_B Tω_0^TI ω_0 should not be too large.\nAssume an angular velocity takes the following form,\n\n    ω_0 = (ω_0,ω_0,ω_0)^T,\n\nwhich is illustrated in Figure <ref>.\nAssume the temperature T=300K. \nFor a “usual” angular velocity ω_0 that satisfies:\n\n    1/2k_B Tω_0^TI ω_0\n    =2,\n\nwe can obtain,\n\n    ω_0=√(2· 2k_B T / tr(I))=5.29× 10^6 rad/s\n\nusing (<ref>) and the parameters of a TMV particle.\nAt this temperature, the shear viscosity of air is η=1.86× 10^-5  Pa· s. \nThe viscous torque using (<ref>) is,\n\n    Cω_0=  [ -2.02× 10^-20; -2.02× 10^-20; -2.02× 10^-20 ] N· m,\n\nand the torque introduced by inertia is,\n\n    ω_0× (Iω_0)=\n    [ -7.10× 10^-37; -8.19× 10^-21; +8.19× 10^-21 ] N· m.\n\nIn this case, we see the viscous and inertial torques are of a comparable magnitude.\nSo when the distribution is approaching the limit distribution, a considerable amount of particles are influenced by both torques, where the inertial theory becomes important.\n\n\n\n§ APPENDIX II\n\n\nIn this section, we provide a proof for the relationship (<ref>) in a more general setting, where a deterministic force field is also present.\nThe proof is written for inertial rotational Brownian motion, while the proof for the non-inertial case follows the same way.\nBelow, we use the “∧” and “∨” operators, the basis of Lie algebra, and Lie derivative E^R_k of SO(3) defined in <cit.>.\nThe Einstein summation convention is also used to simplify equations.\n\nAssume a particle is rotating in a deterministic field V(R) with linear viscous torque and random torque. \nThe following stochastic differential equations on the direct product group SO(3)×ℝ^3 describes the movement of the particle:\n\n    dℓ=(ℓ̂ I^-1ℓ-E^R V - CI^-1ℓ)dt+Bdw, \n    \n        (R^T dR)^∨=I^-1ℓ dt,\n\nwhere ℓ=Iω is the angular momentum. \nWe also rewrite the cross-product term ℓ×(I^-1ℓ) as a matrix multiplication term ℓ̂I^-1ℓ using the property of skew-symmetric matrices. \nThe Lie derivative term stands for a vector E^R V=(E^R_1 V,  E^R_2 V,  E^R_3 V)^T.\nUsing the methodology in <cit.>, the corresponding Fokker-Planck equation on SO(3)×ℝ^3 is:\n\n    ∂ f/∂ t=-E^R_k(h_k^Rf)-∂/∂ℓ_k(h^ℓ_k f)+1/2(BB^T)_kl∂ ^2 f/∂ℓ_k ∂ℓ _l,\n\nwhere\n\n    h^ℓ =ℓ̂I^-1ℓ-E^RV-CI^-1ℓ,\n    h^R =I^-1ℓ.\n\nHere, we use the notation f(R,ℓ,t) to denote the distribution on the direct product group, so as to differentiate from the distribution u(h,t) on the cotangent bundle in the main text.\nWe proceed to prove the main theorem.\n\nThe solution f(R,ℓ,t) to the Fokker-Planck equation (<ref>) satisfies\n\n    lim_t→∞ f(R,ℓ,t)=1/Zexp(-β( 1/2ℓ^TI^-1ℓ+V(R) ) ),\n\nif and only if,\n\n    C+C^T=β BB^T.\n\n\n\nWhen the time is very large, the LHS of (<ref>) should approach zero.\nWe denote the RHS of (<ref>) as f_∞(R,ℓ) and substitute it into the RHS of (<ref>).\nThe first term is,\n\n    -E_k^R(h_k^Rf_∞)=-e_k^TI^-1ℓE^R_k f_∞,\n\nwhere e_k^TI^-1ℓ is a scalar and the subscript k is summed over.\nFor the second term, we first calculate ∂ h_k^ℓ/∂ℓ _k,\n\n    ∂ h^ℓ_k/∂ℓ_k   =∂/∂ℓ_k[ e^T_k(ℓ̂I^-1ℓ-E^RV-CI^-1ℓ) ] \n       =e^T_k(ê_kI^-1ℓ+ℓ̂ I^-1e_k-CI^-1e_k) \n       =e_k^T(ℓ̂ -C)I^-1e_k.\n\nNote that the term e^T_k ê_kI^-1ℓ vanishes because e^T_k ê_k=-(e_k ×e_k)^T.\nThe derivatives of f_∞ are: \n\n    E^R_kf_∞=-β (E^R_k V) f_∞\n    ∂ f_∞/∂ℓ_k=-βe_k^T I^-1ℓ f_∞\n    ∂ ^2 f_∞/∂ℓ_k ∂ℓ_l=(-βe_k^TI^-1e_l+β^2 ℓ^T(I^-Te_k e_l^TI^-1)ℓ )f_∞.\n\nThe fact that e_k^TI^-1ℓ=ℓ^TI^-Te_k is used above.\n\nSubstituting (<ref>), (<ref>), and (<ref>) into (<ref>) and removing f_∞, we have:\n\n    β (E^R_k V)e_k^TI^-1ℓ-e_k^T(ℓ̂ -C)I^-1e_k + β (e_k^T I^-1ℓ) h_k^ℓ\n     +1/2(BB^T)_kl(-βe_k^TI^-1e_l+β^2ℓ^T(I^-Te_k e_l^TI^-1)ℓ)=0  .\n\nThe first three terms can be organized as:\n\n    β (E^R_k V)e_k^TI^-1ℓ-e_k^T(ℓ̂ -C)I^-1e_k \n                + β (e_k^T I^-1ℓ) [e_k^T(ℓ̂ -C)I^-1ℓ-E^R_kV] \n    \n    =   e_k^TCI^-1e_k-e_k^T ℓ̂  I^-1e_k-βℓ^TI^-Te_ke_k^TCI^-1ℓ\n                 +βℓ^TI^-Te_k e_k^T ℓ̂  I^-1ℓ\n    \n    =   e_k^TCI^-1e_k-tr( ℓ̂  I^-1)-βℓ^TI^-TCI^-1ℓ\n    \n    =   e_k^TCI^-1e_k-βℓ^TI^-TCI^-1ℓ\n\nThe equation e_k^TI^-1ℓ=ℓ^TI^-Te_k is used in lines 1-2. \nIn line 2, the term e_k e_k^T equals the identity matrix when summed over.\nSo the cubic term is simplified to (I^-1ℓ)^Tℓ̂ I^-1ℓ=ω·(ℓ×ω) and vanishes.\nIn lines 3-4, we employ the fact that the trace of a skew-symmetric matrix multiplying a symmetric matrix is 0.\n\nFor (<ref>) to hold true, the constant term and the quadratic term should vanish for all ℓ. Substituting (<ref>) into (<ref>), the constant term is,\n\n    e_k^TCI^-1e_k-1/2β·(BB^T)_kle_k^TI^-1e_l \n    \n    =   tr((C-1/2β· BB^T)I^-1),\n\nand the quadratic term is,\n\n    -βℓ^TI^-TCI^-1ℓ+1/2(BB^T)_klβ^2ℓ^T(I^-Te_k e_l^TI^-1)ℓ\n    \n    =   ℓ^T(-β I^-TCI^-1 +1/2(BB^T)_klβ^2(I^-Te_k e_l^TI^-1))ℓ\n    \n    =   ℓ^T(-β I^-TCI^-1 +1/2β^2(I^-TBB^TI^-1))ℓ\n    \n    =    -β·ℓ^TI^-T(C-1/2β· BB^T)I^-1ℓ\n    \n    =    -β·ω^T(C-1/2β· BB^T)ω.\n\nThe only condition for both (<ref>) and (<ref>) to be zero is that C-1/2β· BB^T is a skew-symmetric matrix:\n\n    (C-1/2β· BB^T)=-(C-1/2β· BB^T)^T.\n\nSince BB^T is symmetric, the condition is equivalent to,\n\n    C+C^T=β· BB^T,\n\nwhich ends the proof.\n\n\n\n\n\n\n§ APPENDIX III\n\nIn this section, we provide some useful approximation formulas for the Lie derivative of the logarithm of a group element, i.e., \n\n    E^L_i x,  E^L_i(xx^T),  E_i^LE_j^L x,  E_i^L E_j^L(xx^T),\n       E^R_i x,  E^R_i(xx^T),  E_i^RE_j^R x,  E_i^R E_j^R(xx^T).\n\nwhere x(k)=[log^∨ k] is a vector-valued function of k∈G.\n\nThe BCH expansion for Z = log(e^Xe^Y) is,\n\n    Z = X + Y + 1/2[X,Y] + 1/12([X,[X,Y]] + [Y,[Y,X]]) +\n    + 1/48([Y,[X,[Y,X]]] + [X,[Y,[Y,X]]]) + ⋯,\n\nwhere [X,Y] = XY - YX and the subsequent terms involve at least five appearances of X or Y in the recursive Lie brackets (i.e., for instance [Y,[Y,[Y,[Y,X]]]]).\n\nWe first see that,\n\n    [log^∨(e^-tE_i∘ k)] - [log^∨ k] = -te_i - t/2ad_ix -\n    - t/12ad_Xad_Xe_i + 𝒪(t,||x||^4),\n\nand,\n\n    [log^∨(k ∘ e^tE_i)] - [log^∨ k] = te_i - t/2ad_ix +\n    + t/12ad_Xad_Xe_i + 𝒪(t,||x||^4).\n\n\nFrom here, we can see that,\n\n    E^L_ix   = lim_t→ 0([log^∨ (e^-tE_i∘ k)] - [log^∨ k]/t) \n       ≈ -e_i - 1/2ad_ix - 1/12ad_Xad_Xe_i + 𝒪(||x||^4),\n\nand,\n\n    E^R_ix   = lim_t→ 0([log^∨ (k∘ e^tE_i)] - [log^∨ k]/t) \n       ≈e_i - 1/2ad_ix + 1/12ad_Xad_Xe_i + 𝒪(||x||^4).\n\n\nTherefore, with an error of order 𝒪(||x||^3) we obtain,\n\n    E^L_i(xx^T)    ≈ -x(e_i + 1/2ad_ix)^T - (e_i + 1/2ad_ix)x^T\n       ≈ -xe^T_i - e_ix^T - 1/2xx^Tad_i^T - 1/2ad_ixx^T.\n\nSimilarly we have,\n\n    E^R_i(xx^T) = xe^T_i + e_ix^T - 1/2xx^Tad_i^T - 1/2ad_ixx^T.\n\n\nA term that we will appear is, E^L_iE^L_jx, which we can expand with an error of 𝒪(||x||^3) to obtain,\n\n    E^L_iE^L_jx≈1/2ad_j(e_i + 1/2ad_ix + 1/12ad_Xad_Xe_i) -\n    -  1/12E^L_i(ad_Xad_X)e_j\n\nSince ad_X is linear in x, to ensure that  E^L_iE^L_jx has an error of 𝒪(||x||^3), we can truncate the expansion of E^L_i(ad_X) with an error of 𝒪(||x||^2). Similarly,\n\n    E^R_iE^R_jx≈1/2ad_j(e_i - 1/2ad_ix + 1/12ad_Xad_Xe_i) +\n    + 1/12E^R_i(ad_Xad_X)e_j\n\n\nThe following is true by the product rule:\n\n    E^L_iE^L_j(xx^T) = (E^L_iE^L_jx)x^T + E^L_jxE^L_ix^T +\n    + E^L_ixE^L_jx^T + x(E^L_iE^L_jx^T),\n\nwhere the E^L_ix term has to be expanded with an error of 𝒪(||x||^3) but E^L_iE^L_jx only needs to have an error of 𝒪(||x||^2) in the expressions in the paper (since it is usually multiplied with another quantity of order 𝒪(||x||)). Likewise,\n\n    E^R_iE^R_j(xx^T) = (E^R_iE^R_jx)x^T + E^R_jxE^R_ix^T +\n    + E^R_ixE^R_jx^T + x(E^R_iE^R_jx^T),\n\n\nThe previous two expressions rely on knowing E^L_iad_X and E^R_iad_X with an error of at most 𝒪(||x||^2). We first note that,\n\n    ad(c_1X + c_2Y) = c_1ad(X) + c_2ad(Y),\n\nby linearity for two constants c_1 and c_2. This can also be seen by assuming an arbitrary Z such that ad(c_1X + c_2Y)Z = [c_1X+c_2Y,Z] = c_1[X,Z] + c_2[Y,Z] = c_1ad(X)Z + c_2ad(Y)Z = (c_1ad(X) + c_2ad(Y))Z. Since this holds for any Z, the above identity follows. Then,\n\n    E^L_i(ad_X)    = lim_t→ 0([ad(log(e^-tE_i∘ k))] - [ad(log k)]/t) \n       ≈ \n        -ad_i - 1/2ad_[E_i,X],\n\nand,\n\n    E^R_i(ad_X)    = lim_t→ 0([ad(log(k∘ e^tE_i))] - [ad(log k)]/t) \n       ≈ \n        ad_i - 1/2ad_[E_i,X].\n\nUsing these results we have, to an error of 𝒪(||x||^3),\n\n    E^L_iE^L_jx≈1/2ad_je_i + 1/4ad_jad_ix +\n    + 1/24ad_jad_Xad_Xe_i + 1/12(ad_iad_Xe_j + ad_Xad_ie_j)+\n    + 1/24(ad_[E_i,X]ad_Xe_j + ad_Xad_[E_i,X]e_j),\n\nand if we define P and S as the following collection of terms:\n\n    P = 1/2ad_je_ix^T + 1/4ad_jad_ixx^T +\n    +1/12(ad_iad_Xe_jx^T + ad_Xad_ie_jx^T),\n\n\n    S = e_ie_j^T + 1/2(e_ix^Tad_j^T + ad_ixe_j^T) +\n    + 1/4ad_ixx^Tad_j^T + 1/12(e_ie_j^Tad_X^Tad_X^T + ad_Xad_Xe_ie^T_j),\n\nwe would have,\n\n    E^L_iE^L_j(xx^T) ≈ P + P^T + S + S^T.\n\n\n\n\n"}