{"entry_id": "http://arxiv.org/abs/2303.07019v1", "published": "20230313113242", "title": "Crossover from Boltzmann to Wigner thermal transport in thermoelectric skutterudites", "authors": ["Enrico Di Lucente", "Michele Simoncelli", "Nicola Marzari"], "primary_category": "cond-mat.mtrl-sci", "categories": ["cond-mat.mtrl-sci"], "text": "\n\n\n\n\nTheory and Simulation of Materials (THEOS) and National Centre for Computational Design and Discovery of Novel Materials (MARVEL), École Polytechnique Fédérale de Lausanne, Lausanne 1015, Switzerland\n\nTCM Group, Cavendish Laboratory, University of Cambridge, 19 JJ Thomson Avenue, Cambridge, CB3 0HE UK\n\nTheory and Simulation of Materials (THEOS) and National Centre for Computational Design and Discovery of Novel Materials (MARVEL), École Polytechnique Fédérale de Lausanne, Lausanne 1015, Switzerland\nLaboratory for Materials Simulations, Paul Scherrer Institut, 5232 Villigen PSI, Switzerland\n\n\n\n\nSkutterudites are crystals with a cage-like structure that can be augmented with filler atoms (“rattlers”), usually leading to a reduction in thermal conductivity that can be exploited for thermoelectric applications. Here, we leverage the recently introduced Wigner formulation of thermal transport to elucidate the microscopic physics underlying heat conduction in skutterudites, showing that filler atoms can drive a crossover from the Boltzmann to the Wigner regimes of thermal transport, i.e., from particle-like conduction to wave-like tunnelling. At temperatures where the thermoelectric efficiency of skutterudites is largest, wave-like tunneling can become comparable to particle-like propagation. We define a Boltzmann deviation descriptor able to differentiate the two regimes and relate the competition between the two mechanisms to the materials' chemistry, providing a design strategy to select rattlers and identify optimal compositions for thermoelectric applications.\n\n\nCrossover from Boltzmann to Wigner thermal transport in thermoelectric skutterudites\n    Nicola Marzari\n    March 30, 2023\n====================================================================================\n\n\n\n\nHeat is a waste product of many and diverse energy intensive technologies, from vehicle exhausts in transportation to nuclear and natural gas power plants production, to large-scale manufacturing. Ongoing research is focused on finding strategies to convert such waste heat into electricity, and thermoelectric materials are among the most promising candidates <cit.> for this task, and for augmenting sustainable energy supplies in the near future. The thermoelectric figure of merit reaches a record value of 3.1 at 783 K in polycrystalline SnSe <cit.>, even greater than the value obtained for single crystals <cit.> due to enhanced scattering. While many efforts have focused on designing materials with enhanced thermoelectric performance <cit.>, understanding how to maximise energy-conversion efficiency by decreasing thermal conductivity has been hindered by the lack of a microscopic theory capturing the mechanisms of heat conduction in poor thermal conductors. Fittingly, the recently developed Wigner formulation of thermal transport <cit.> allows to describe heat conduction in anharmonic crystals and in solids with ultralow or glass-like conductivity; this is exactly the case of thermoelectrics. The Wigner formulation offers a comprehensive approach to describe heat transport across different regimes, covering on the same footing harmonic “Boltzmann crystals”, anharmonic “Wigner crystals” and amorphous solids and glasses. A Boltzmann crystal is characterized by phonon interband spacings much larger than the phonon linewidths; in Boltzmann crystals particle-like heat conduction dominates <cit.> and the Peierls-Boltzmann transport equation <cit.> describes accurately thermal conductivity <cit.>. In amorphous solids and glasses wave-like tunneling dominates and the Wigner formulation recovers the Allen-Feldman formulation <cit.> accounting also for anharmonicity  <cit.>. Last, Wigner crystals can be considered as the intermediate regime between the first two and are characterized by interband spacings which are comparable to phonon linewidths. The Peierls-Boltzmann equation fails to describe the wave-like contributions <cit.> in materials with ultralow thermal conductivity, that are captured by the Wigner transport equation <cit.>.\n\nAmong others, skutterudites have been extensively studied for their possible applications in thermoelectrics <cit.>showing both high electrical and low thermal conductivities. The cage-like structure of skutterudites is a critical feature for thermoelectricity <cit.>: the voids present in the structure can be occupied by loosely bound atoms (“fillers” or “rattlers”) that can reduce thermal conductivity and enhance the thermoelectric figure of merit <cit.>.\n\nHowever, the interpretation of filler vibrations remain controversial <cit.>; here, we aim to clarify the fundamental mechanisms behind the reduction of thermal conductivity – and thus the related thermoelectric performance – applying the Wigner transport equation and its resulting lattice thermal conductivity κ^αβ_tot:\n\n\n    0.98!κ^αβ_tot=κ^αβ_P, SMA+1/(2π)^3_BZ∑_s s'ω(q)_s+ω(q)_s'/4[C(q)_s/ω(q)_s+C(q)_s'/ω(q)_s']v^α(q)_s,s'v^β(q)_s',s1/2[Γ(q)_s+Γ(q)_s']/[ω(q)_s'-ω(q)_s]^2+1/4[Γ(q)_s+Γ(q)_s']^2 d^3q,\n\n\nwhere ω(q)_s is the angular frequency of a phonon having wavevector q and mode s, C(q)_s=ħ^2ω^2(q)_s/k_BT^2N̅(q)_s[N̅(q)_s+1] is the specific heat of that phonon population, N̅(q)_s is the equilibrium Bose-Einstein distribution at temperature T, v^α(q)__s,s' and v^β(q)__s,s' are the cartesian components of the velocity operator, which generalizes the concept of group velocity, and Γ(q)_s=1/τ(q)_s is the phonon linewidth of a phonon with lifetime τ(q)_s. The symbol BZ in Eq. (<ref>) represents an integral over the Brillouin zone. κ^αβ_P, SMA in Eq. (<ref>) is the Peierls-Boltzmann particle-like conductivity, which is driven by phonon-phonon scattering in the single-mode relaxation time approximation (SMA). The additional Wigner term in Eq. (<ref>) is a positive-definite tensor (κ^αβ_C) emerging from the phase “coherences” between pairs of phonon eigenstates; i.e., from the wave-tunneling between two nondegenerate bands (s s') <cit.>. In order to explore the relative strength of the particle-like and wave-like heat-conduction mechanisms, we study three different families of skutterudites, where we compute from first-principles (see Supplementary Information (SI) <cit.> for details) all the quantities needed to evaluate Eq. (<ref>) for unfilled FeSb3, CoSb3 and IrSb3, and for the filled compounds RFe4Sb12 (R = Ba, Ca, Nd, Yb), RCo4Sb12 (R = I, In, La, Yb) and RIr4Sb12 (R = Yb).\n\nWe note, in passing, that skutterudites contain elements for which DFT+U <cit.> might improve upon self-interaction errors for localized electrons <cit.>;\nthese aspects are discussed in the SI <cit.>.\n\nThe resulting thermal conductivities, together with their good agreement with the available experimental data, are shown in Fig. <ref> in the temperature range from 100 to 800 K. By focusing on the high-performance high-temperature regime (T≥600K) and comparing κ_P and κ_C, it is clearly seen how unfilled skutterudites behave as Boltzmann crystals, displaying dominant particle-like conduction. Moreover, in the high-temperature region, κ≃κ_P∝ T^-1, as predicted by the Peierls-Boltzmann equation <cit.>. On the other hand, for filled skutterudites, the behaviour is that of a Wigner crystal, with a milder decay of κ_tot as also observed for many highly anharmonic crystals <cit.>. We highlight how Yb-filled materials show a stronger Wigner-crystal behavior, i.e. κ_P∼κ_C, while for BaFe4Sb12 the behaviour is more similar to that of a Boltzmann crystal, i.e. κ_P>κ_C. It is worth noting that some experimental measurements show an increase in conductivity at very high temperatures (≥700 K); this could be understood as driven by radiative and electronic heat transfer <cit.>, unrelated to the increase in coherences' conductivity. At high temperatures, radiative effects on thermal transports are expected to be important because radiative thermal conductivity should increase as T^3 <cit.>, while in semiconductors the electronic contribution can be important when, as temperature rises, electrons are excited to the conduction band <cit.>.\n\nIn order to elucidate the physics underlying the low thermal conductivity of efficient thermoelectric skutterudites, we make a comparison between phonon lifetimes and average phonon interband spacing Δω_avg=ω_max/3N_at (ω_max being the maximum phonon frequency and N_at the number of atoms in the primitive cell) <cit.>, to describe how much each phonon contributes to the wave-like vs. the particle-like conduction mechanisms. As shown in Ref. <cit.>, the ratio between the two is approximately equivalent to the ratio between the phonon linewidth and the average phonon interband spacing,\n\n    κ_C^avg(q)_s/κ_P^avg(q)_s≃Γ(q)_s/Δω_avg=1/τ(q)_sΔω_avg.\n\nFrom this one can define the Wigner limit in time τ^ω=1/Δω_avg, that determines the crossover from a regime of dominant particle-like conduction to one of dominant wave-like conduction. \n\nIn Fig. <ref> we show the distribution τ(q)_s of the phonon lifetimes as a function of the energy ħω(q)_s for the unfilled (upper panels) and Yb-filled (lower panels) skutterudites at 800 K. Phonons above the Wigner limit in time (i.e. with τ(q)_s>τ^ω) contribute mainly to particle-like conductivity, while phonons below this limit (i.e. with τ(q)_s<τ^ω) contribute mainly to the wave-like conductivity. We note that in all the compounds studied <cit.> the phonon lifetimes sit well above the Ioffe-Regel limit in time τ^IR=ω^-1 <cit.> (dashed-purple), confirming that phonons in these materials are well defined quasi particles and that the Wigner formulation is valid <cit.>. If this were not the case, then full spectral function approaches <cit.> would be required. The clouds of phonon lifetimes in Fig. <ref> remain distinctly above the Wigner limit for the unfilled compounds, while they are centered around the Wigner limit for the Yb-filled compounds. This allows to identify the crossover from the Boltzmann-crystal behaviour of unfilled skutterudites to the Wigner-crystal behaviour of Yb-filled ones, where phonon coherences become significant. Moreover, Fig. <ref> also shows the atom-resolved energies and lifetimes (see Eqs. 3 and 4 of SI <cit.>), indicating how, in general, different atoms contribute to different regions of the distribution. We see that Yb fillers drive the characteristic lifetimes towards the Wigner limit in time, while the characteristic energies of the Ir/Co/Fe atoms, and of Sb are only slightly shifted higher. Given a certain phonon lifetime, the frequency associated to the filler is significantly lower than that of the other atom types in the structure, suggesting that indeed Yb behaves like a rattler <cit.>.\nThese findings extend those discussed in Ref. <cit.>, where it was suggested that fillers interact with the host matrix coherently, albeit without resolving the single-atom contributions in the energy-lifetime distribution. In fact, the present analysis shows how filling with Yb lowers all the lifetimes, not only those of the filler itself.\n\nThen, we want to describe how each chemical species that composes the skutterudite structure influences the relative strengths of κ_P and κ_C. Since the Boltzmann or Wigner crystal behaviour is regulated by the competition between the phonon lifetimes and the Wigner limit in time <cit.> (see Eq.  (<ref>)), we introduce a Boltzmann deviation descriptor (B) defined as the inverse of the product between the skutterudite characteristic lifetime – i.e. the Matthiessen' sum of the average lifetimes resolved on atom types (see SI <cit.> for details) – and the average phonon interband spacing <cit.>:\n\n    B=1/τ̅Δω_avg=\n    1/τ^UΔω_avg ,    with  τ^U=τ_Mτ_Sb/τ_M+τ_Sb\n    1/τ^FΔω_avg ,    with  τ^F=τ_Rτ_Mτ_Sb/τ_Rτ_M+τ_Rτ_Sb+τ_Mτ_Sb,\n\nwhere τ̅ is the average lifetime <cit.>, F and U superscripts symbolize filled and unfilled skutterudites, R the rattler, and M the Ir/Co/Fe metal. \n\nIn the upper panel of Fig. <ref> we show the correlation between κ_P/κ_C and B at 800 K. Interestingly, we find to a good approximation the power relation: κ_P/κ_C≃ B^-3/4. It can be shown analytically <cit.> that for a constant DOS, κ_P/κ_C=B^-1; so, we can attribute the -3/4 exponent (<1) to the fact that the real DOS is not constant. Finally, we want to understand how skutterudites' chemistry comes into play in discriminating the ability of the filler atom to move inside the cage and how this is related to B.\n\nThe mean-square displacement (MSD) is often used in the literature to describe vibrating systems characterized by loosely bound atoms with long and elongated bonds <cit.>. From this follows that the ratio between the MSD of the filler atom (MSD_R) and that of the cage atoms (MSD_Sb) can be used to quantify the relative effect of the filler atom's vibrations in the host structure. On the other hand, the ratio between the filler-cage atoms distance and the average bond length of the structure keeps track of the nature of the chemical bond, i.e., the effective distance along which the filler can move.\n\nWe can then define a heuristic parameter that describes how the relative structural oscillations of the filler atom vary depending on the length of the chemical bonds it affects:\n\n    η=MSD_R/MSD_Sbd_Sb-R/d_avg,\n\nwhere d_Sb-R is the distance between the filler atom and the atoms of the cage and d_avg is the average bond length of the structure.\n\nIn the lower panel of Fig. <ref> we show the distribution of B obtained for each of the materials studied. This confirms the trend obtained for κ_P/κ_C in the upper panel of Fig. <ref>, and validates numerically the predictions from Eq. (<ref>). Most importanly, η (used for the color scale) allows to connect the physics behind Wigner heat transport to the chemistry of the skutterudites: the larger the B, the larger η. This underscores how B is proportional to the rattling motion of the filler, quantified by MSD_R, and is therefore able to distinguish between optimal filler atoms for the reduction of κ_tot from those for which the thermal behavior remains similar to that of unfilled skutterudites. E.g., the filled skutterudite BaFe4Sb12 behaves very close to a Boltzmann crystal, since its η is significantly lower than that of the other filled skutterudites. We also observe that a rescaling of the filler's atomic weight translates into negligible changes of κ_tot, thus confirming that thermal transport is determined by bonding chemistry <cit.>. In the end, it is worth noting that only the MSDs (harmonic properties) and the crystal chemical bonds enter the definition of η, and thus already at this level it might be possible to predict the degree of Wigner behavior of a thermoelectric material. Since harmonic properties are much less computationally demanding than anharmonic ones, one could screen for thermoelectric materials with a strong wave-like contribution to conductivity through the descriptor η, at least for cage-like materials showing rattling motion.\n\nIn conclusion, we have used the Wigner formulation of thermal transport to investigate the microscopic physics underlying heat conduction in skutterudites, showing a crossover from Boltzmann to Wigner thermal transport when filling with, e.g., Yb atoms. Unfilled skutterudites behave as Boltzmann crystals, while filled ones change behavior from Boltzmann to Wigner depending on the filler atom and its bonding properties. We showed that, given the same host structure, the materials displaying the lowest conductivity are precisely those in which the κ_P/κ_C ratio between particle-like and wave-like contributions is larger. We also elucidated how the degree of Wigner heat conduction is correlated to the relative motion between the filler atom and the cage; the latter being dependent on the chemical composition of the skutterudite structure. This study paves the way for the identification of the most suitable chemical compositions to engineer new and efficient cage-like thermoelectric materials. \n\nThis research was supported by the Swiss National Science Foundation (SNSF), through Grant No. CRSII5_189924 (“Hydronics” project).\n\n\napsrev4-1\n\n56\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[Snyder and Toberer(2008)]snyder2008complex\n  author author G. J. Snyder and author E. S. Toberer, @noop  journal journal\n  Nature materials volume 7, pages 105\n  (year 2008)NoStop\n[Zhou et al.(2021)Zhou,\n  Lee, Yu, Byun, Luo, Lee, Ge, Lee,\n  Chen, Lee et al.]zhou2021polycrystalline\n  author author C. Zhou, author Y. K. Lee,\n  author Y. Yu, author\n  S. Byun, author Z.-Z. Luo, author H. Lee, author B. Ge, author Y.-L. Lee,\n  author X. Chen, author\n  J. Y. Lee,  et al., @noop \n  journal journal Nature materials volume 20, pages 1378 (year\n  2021)NoStop\n[Zhao et al.(2014)Zhao,\n  Lo, Zhang, Sun, Tan, Uher, Wolverton, Dravid, and Kanatzidis]zhao2014ultralow\n  author author L.-D. Zhao, author S.-H. Lo,\n  author Y. Zhang, author H. Sun, author\n  G. Tan, author C. Uher, author C. Wolverton, author V. P. Dravid,  and author M. G. Kanatzidis, @noop  journal journal\n  nature volume 508, pages 373\n  (year 2014)NoStop\n[Rowe(2018)]rowe2018crc\n  author author D. M. Rowe, @noop  title CRC handbook of\n  thermoelectrics (publisher CRC press, year\n  2018)NoStop\n[Slack and Hussain(1991)]slack1991maximum\n  author author G. A. Slack and author M. A. Hussain, @noop  journal journal\n  Journal of applied physics volume 70, pages 2694 (year 1991)NoStop\n[Simoncelli et al.(2019)Simoncelli, Marzari, and Mauri]simoncelli2019unified\n  author author M. Simoncelli, author N. Marzari,\n   and author F. Mauri,  @noop  journal journal Nature Physics  volume 15, pages 809 (year\n  2019)NoStop\n[Simoncelli et al.(2022a)Simoncelli, Marzari, and Mauri]simoncelli2021wigner\n  author author M. Simoncelli, author N. Marzari,\n   and author F. Mauri,  @noop  journal journal Physical Review\n  X volume 12, pages 041011 (year 2022a)NoStop\n[Simoncelli et al.(2020)Simoncelli, Marzari, and Cepellotti]simoncelli2020generalization\n  author author M. Simoncelli, author N. Marzari,\n   and author A. Cepellotti,  @noop  journal journal Physical Review\n  X volume 10, pages 011019 (year 2020)NoStop\n[Peierls(1929)]peierls1929kinetischen\n  author author R. Peierls, @noop  journal journal\n  Annalen der Physik volume 395, pages\n  1055 (year 1929)NoStop\n[Peierls and Peierls(1955)]peierls1955quantum\n  author author R. Peierls and author R. E. Peierls, @noop  title Quantum theory of\n  solids (publisher Oxford University Press, year\n  1955)NoStop\n[Garg et al.(2011)Garg,\n  Bonini, Kozinsky, and Marzari]garg2011role\n  author author J. Garg, author N. Bonini,\n  author B. Kozinsky,  and  author N. Marzari, @noop\n   journal journal Physical review letters  volume 106, pages 045901 (year 2011)NoStop\n[Broido et al.(2007)Broido,\n  Malorny, Birner, Mingo, and  Stewart]broido2007intrinsic\n  author author D. A. Broido, author M. Malorny,\n  author G. Birner, author N. Mingo,  and author\n  D. Stewart, @noop  journal journal Applied Physics Letters volume 91, pages 231922 (year\n  2007)NoStop\n[Allen and Feldman(1993)]allen1993thermal\n  author author P. B. Allen and author J. L. Feldman, @noop  journal journal\n  Physical Review B volume 48, pages\n  12581 (year 1993)NoStop\n[Simoncelli et al.(2022b)Simoncelli, Mauri, and Marzari]simoncelli2022thermal\n  author author M. Simoncelli, author F. Mauri,   and author N. Marzari,  @noop  journal journal arXiv preprint\n  arXiv:2209.11201  (year 2022b)NoStop\n[Donadio and Galli(2009)]donadio2009atomistic\n  author author D. Donadio and author G. Galli, @noop  journal journal\n  Physical review letters volume 102, pages 195901 (year 2009)NoStop\n[Li and Mingo(2015)]li2015ultralow\n  author author W. Li and author N. Mingo,  @noop  journal journal Physical Review\n  B volume 91, pages 144304 (year 2015)NoStop\n[Weathers et al.(2017)Weathers, Carrete, DeGrave, Higgins, Moore, Kim, Mingo,\n  Jin, and Shi]weathers2017glass\n  author author A. Weathers, author J. Carrete,\n  author J. P. DeGrave, author J. M. Higgins, author\n  A. L. Moore, author\n  J. Kim, author N. Mingo, author S. Jin,  and author L. Shi, @noop  journal journal Physical Review B volume 96, pages 214202 (year 2017)NoStop\n[Zhu and Ertekin(2019)]zhu2019mixed\n  author author T. Zhu and author E. Ertekin,  @noop  journal journal Energy &\n  Environmental Science volume 12, pages\n  216 (year 2019)NoStop\n[Bauer et al.(2002)Bauer,\n  Paul, Della Mea, Hilscher,\n  Michor, Reissner, Steiner,\n  Grytsiv, Rogl, Scheidt et al.]bauer2002crystal\n  author author E. Bauer, author C. Paul,\n  author M. Della Mea, author G. Hilscher, author\n  H. Michor, author M. Reissner, author W. Steiner, author A. Grytsiv, author P. Rogl, author E. Scheidt,  et al., @noop  journal journal Physical Review B volume 66, pages 214421 (year 2002)NoStop\n[Zong et al.(2017)Zong,\n  Hanus, Dylla, Tang,\n  Liao, Zhang, Snyder, and  Chen]zong2017skutterudite\n  author author P.-a. Zong, author R. Hanus,\n  author M. Dylla, author Y. Tang, author\n  J. Liao, author Q. Zhang, author G. J.  Snyder,  and author L. Chen, @noop  journal journal Energy & Environmental Science volume\n  10, pages 183 (year 2017)NoStop\n[Kanatzidis et al.(2012)Kanatzidis, Hogan, and Mahanti]kanatzidis2003chemistry\n  author author M. G. Kanatzidis, author T. Hogan,   and author S. Mahanti,  @noop  title Chemistry, physics, and materials\n  science of thermoelectric materials: beyond bismuth telluride (publisher Springer Science & Business Media, year\n  2012)NoStop\n[Uher(2016)]uher2016materials\n  author author C. Uher, @noop  title Materials aspect of\n  thermoelectricity (publisher CRC press, year\n  2016)NoStop\n[Tritt(2000)]tritt2000recent\n  author author T. Tritt, @noop  title Recent trends in\n  thermoelectric materials research, part two (publisher\n  Academic Press, year 2000)NoStop\n[Qiu et al.(2011)Qiu,\n  Yang, Liu, Shi, Huang, Snyder, Zhang, and Chen]qiu2011\n  author author P. Qiu, author J. Yang, author R. Liu, author\n  X. Shi, author X. Huang, author G. Snyder, author W. Zhang,  and author L. Chen, @noop  journal journal Journal of Applied Physics volume 109,  pages 063713 (year 2011)NoStop\n[Stokes et al.(1998)Stokes,\n  Ehrlich, and Nolas]CoSb3_tc_1\n  author author K. L. Stokes, author A. Ehrlich,   and author G. Nolas,  @noop  journal journal MRS Online\n  Proceedings Library Archive volume 545 (year 1998)NoStop\n[Kawaharada et al.(2001)Kawaharada, Kurosaki, Uno, and  Yamanaka]CoSb3_tc_2\n  author author Y. Kawaharada, author K. Kurosaki, author M. Uno,   and author S. Yamanaka,  @noop  journal journal Journal of alloys\n  and compounds volume 315, pages 193\n  (year 2001)NoStop\n[Li et al.(2014)Li,\n  Xu, Zhang, Duan,\n  Yan, Yang, and Tian]ICo4Sb12_1\n  author author X. Li, author B. Xu, author L. Zhang, author\n  F. Duan, author X. Yan, author J. Yang,  and author Y. Tian,  @noop  journal journal Journal of alloys\n  and compounds volume 615, pages 177\n  (year 2014)NoStop\n[Zhang et al.(2015)Zhang,\n  Xu, Li, Duan, Yan, and Tian]ICo4Sb12_2\n  author author L. Zhang, author B. Xu, author X. Li, author\n  F. Duan, author X. Yan,  and author Y. Tian, @noop  journal journal Materials Letters volume 139, pages 249 (year 2015)NoStop\n[Mallik et al.(2009)Mallik,\n  Stiewe, Karpinski, Hassdorf,  and Müller]mallik2009thermoelectric\n  author author R. C. Mallik, author C. Stiewe,\n  author G. Karpinski, author R. Hassdorf,  and author E. Müller, @noop \n  journal journal Journal of electronic materials  volume 38, pages 1337 (year\n  2009)NoStop\n[Nolas et al.(1998)Nolas,\n  Cohn, and Slack]nolas1998effect\n  author author G. S. Nolas, author J. Cohn,  and  author G. Slack, @noop \n  journal journal Physical Review B volume 58, pages 164 (year\n  1998)NoStop\n[Mohamed Bashir(2017)]mohamed2017thermoelectric\n  author author A. B. Mohamed Bashir, title Thermoelectric properties of\n  LaCo4Sb12 skutterudite materials by addition of Al, In, Ni & Te/Mohamed\n  Bashir Ali Bashir, @noop  Ph.D. thesis, school\n  University of Malaya (year 2017)NoStop\n[Nolas et al.(2000)Nolas,\n  Kaeser, Littleton IV, and Tritt]nolas2000high\n  author author G. Nolas, author M. Kaeser,\n  author R. Littleton IV,  and  author T. Tritt, @noop \n  journal journal Applied Physics Letters  volume 77, pages 1855 (year\n  2000)NoStop\n[Wang et al.(2016)Wang,\n  Salvador, Yang, Wei,\n  Duan, and Yang]wang2016high\n  author author S. Wang, author J. R. Salvador,\n  author J. Yang, author\n  P. Wei, author B. Duan,  and author J. Yang, @noop  journal journal NPG Asia Materials volume 8, pages e285 (year 2016)NoStop\n[Nolas et al.(1996)Nolas,\n  Slack, Morelli, Tritt, and  Ehrlich]IrSb3_1\n  author author G. Nolas, author G. Slack,\n  author D. Morelli, author T. Tritt,  and author\n  A. Ehrlich, @noop  journal journal Journal of Applied Physics volume 79, pages 4002 (year\n  1996)NoStop\n[Slack and Tsoukala(1994)]slack1994\n  author author G. A. Slack and author V. G. Tsoukala, @noop  journal journal\n  Journal of Applied Physics volume 76, pages 1665 (year 1994)NoStop\n[Sun and Allen(2010)]sun2010lattice\n  author author T. Sun and author P. B. Allen, @noop  journal journal\n  Physical Review B volume 82, pages\n  224305 (year 2010)NoStop\n[Keppens et al.(1998)Keppens, Mandrus, Sales, Chakoumakos, Dai, Coldea, Maple, Gajewski, Freeman, and  Bennington]keppens1998localized\n  author author V. Keppens, author D. Mandrus,\n  author B. C. Sales, author B. Chakoumakos, author\n  P. Dai, author R. Coldea, author M. Maple, author D. Gajewski, author E. Freeman,  and author S. Bennington, @noop  journal\n  journal Nature volume 395, pages 876 (year 1998)NoStop\n[Feldman et al.(2000)Feldman, Singh, Mazin, Mandrus, and Sales]feldman2000lattice\n  author author J. Feldman, author D. Singh,\n  author I. Mazin, author D. Mandrus,  and author B. Sales, @noop \n  journal journal Physical Review B volume 61, pages R9209 (year\n  2000)NoStop\n[Rossi(2011)]rossi2011theory\n  author author F. Rossi, @noop  title Theory of semiconductor\n  quantum devices: microscopic modeling and simulation strategies (publisher Springer Science & Business Media, year\n  2011)NoStop\n[Iotti et al.(2005)Iotti,\n  Ciancio, and Rossi]iotti2005quantum\n  author author R. C. Iotti, author E. Ciancio,   and author F. Rossi,  @noop  journal journal Physical Review\n  B volume 72, pages 125347 (year 2005)NoStop\n[sup()]supplementary\n  @noop  journal See Supplementary Information at (link)  NoStop\n[Ioffe and Regel(1960)]ioffe1960non\n  journal   author author A. Ioffe and author A. Regel, @noop  journal journal Prog. Semicond volume 4, pages 237 (year 1960)NoStop\n[Anisimov et al.(1991)Anisimov, Zaanen, and Andersen]anisimov1991band\n  author author V. I. Anisimov, author J. Zaanen,   and author O. K. Andersen,  @noop  journal journal Physical Review\n  B volume 44, pages 943 (year 1991)NoStop\n[Anisimov et al.(1997)Anisimov, Aryasetiawan, and Lichtenstein]anisimov1997first\n  author author V. I. Anisimov, author F. Aryasetiawan,  and author A. Lichtenstein, @noop  journal journal\n  Journal of Physics: Condensed Matter volume 9,  pages 767 (year 1997)NoStop\n[Dudarev et al.(1998)Dudarev, Botton, Savrasov, Humphreys, and Sutton]dudarev1998electron\n  author author S. Dudarev, author G. Botton,\n  author S. Savrasov, author C. Humphreys,  and author A. Sutton, @noop \n  journal journal Physical Review B volume 57, pages 1505 (year\n  1998)NoStop\n[Di Lucente and Marzari(2023)]DiLucente_FeSb3\n  author author E. Di Lucente and author N. Marzari, @noop  journal journal\n  Manuscript in Preparation  (year 2023)NoStop\n[Kulik et al.(2006)Kulik,\n  Cococcioni, Scherlis, and Marzari]kulik2006density\n  author author H. J. Kulik, author M. Cococcioni,\n  author D. A. Scherlis,  and  author N. Marzari, @noop\n   journal journal Physical Review Letters  volume 97, pages 103001 (year 2006)NoStop\n[Shenogin et al.(2009)Shenogin, Bodapati, Keblinski, and  McGaughey]shenogin2009predicting\n  author author S. Shenogin, author A. Bodapati,\n  author P. Keblinski,  and  author A. J. McGaughey,  @noop  journal journal Journal of Applied\n  Physics volume 105, pages 034906\n  (year 2009)NoStop\n[Cahill et al.(1992)Cahill,\n  Watson, and Pohl]cahill1992lower\n  author author D. G. Cahill, author S. K. Watson,\n   and author R. O. Pohl,  @noop  journal journal Physical Review\n  B volume 46, pages 6131 (year 1992)NoStop\n[Howell et al.(2020)Howell,\n  Mengüç, Daun, and Siegel]howell2020thermal\n  author author J. R. Howell, author M. P. Mengüç, author K. Daun,  and author R. Siegel, @noop  title Thermal radiation heat\n  transfer (publisher CRC press, year\n  2020)NoStop\n[Ziman(1972)]ziman1972principles\n  author author J. M. Ziman, @noop  title Principles of the Theory\n  of Solids (publisher Cambridge university press, year 1972)NoStop\n[Keppler et al.(2008)Keppler, Dubrovinsky, Narygina, and  Kantor]keppler2008optical\n  author author H. Keppler, author L. S. Dubrovinsky, author O. Narygina,  and author I. Kantor, @noop  journal journal\n  Science volume 322, pages 1529\n  (year 2008)NoStop\n[Dangić et al.(2021)Dangić, Hellman, Fahy, and  Savić]dangic2021origin\n  author author Đ. Dangić, author O. Hellman,\n  author S. Fahy,  and author I. Savić, @noop \n  journal journal npj Computational Materials  volume 7, pages 1 (year\n  2021)NoStop\n[Caldarelli et al.(2022)Caldarelli, Simoncelli, Marzari,\n  Mauri, and Benfatto]caldarelli2022many\n  author author G. Caldarelli, author M. Simoncelli, author N. Marzari,\n  author F. Mauri,  and author L. Benfatto, @noop \n  journal journal arXiv preprint arXiv:2202.02246   (year 2022)NoStop\n[Feng et al.(2020)Feng,\n  Fu, Zhang, and Singh]feng2020characterization\n  author author Z. Feng, author Y. Fu, author Y. Zhang,  and author\n  D. J. Singh, @noop  journal journal Physical Review B volume 101, pages 064301 (year\n  2020)NoStop\n[Sales et al.(2000)Sales,\n  Chakoumakos, and Mandrus]sales2000thermoelectric\n  author author B. Sales, author B. Chakoumakos,\n   and author D. Mandrus,  @noop  journal journal Physical Review\n  B volume 61, pages 2475 (year 2000)NoStop\n\n\n\n\n\n\n"}