{"entry_id": "http://arxiv.org/abs/2303.07018v1", "published": "20230313112936", "title": "Readout of quantum devices with a sideband microwave interferometer immune to systematic noise", "authors": ["N. Crescini", "E. G. Kelly", "G. Salis", "A. Fuhrer"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\n\n\t[Present address: ]Univ.Grenoble Alpes, CNRS, Grenoble INP, Institut Néel, 38000 Grenoble, France\n\t\n\tIBM Research Europe, Säumerstrasse 4, 8803 Rüschlikon, Switzerland\n\t\n\n\t\n\tIBM Research Europe, Säumerstrasse 4, 8803 Rüschlikon, Switzerland\n\n\n\tgsa@zurich.ibm.com\n\tIBM Research Europe, Säumerstrasse 4, 8803 Rüschlikon, Switzerland\n\t\n\n\t\n\tIBM Research Europe, Säumerstrasse 4, 8803 Rüschlikon, Switzerland\n\n \nThe accuracy of microwave measurements is not only critical for applications in telecommunication and radar, but also for future quantum computers. Qubit technologies such as superconducting qubits or spin qubits require detecting minuscule signals, typically achieved by reflecting a microwave tone off a resonator that is coupled to the qubit. Noise from cabling and amplification, e.g. from temperature variations, can be detrimental to readout fidelity. \nWe present an approach to detect phase and amplitude changes of a device under test based on the differential measurement of microwave tones generated by two first-order sidebands of a carrier signal. The two microwave tones are sent through the same cable to the measured device that exhibits a narrow-band response for one sideband and leaves the other unaffected. The reflected sidebands are interfered by down-conversion with the carrier. By choosing amplitude and phases of the sidebands, suppression of either common amplitude or common phase noise can be achieved, allowing for fast, stable measurements of frequency shifts and quality factors of resonators.\nTest measurements were performed on NbN superconducting resonators at 25 mK to calibrate and characterise the experimental setup, and to study time-dependent fluctuations of their resonance frequency.\n\n\nReadout of quantum devices with a sideband microwave interferometer immune to systematic noise\n    A. Fuhrer\n    March 30, 2023\n==============================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nInterferometric measurements are among the most sensitive and well studied in experimental physics. Their application ranges from fundamental physics and metrology to quantum information <cit.>, and they are of transversal interest for many other fields of research <cit.>. In an optical interferometer, the probe and reference laser beams follow distinct paths and their interference is indicative of relative variations between the two paths, see Fig. <ref>(a). Microwave interferometers can also be realized in this way <cit.> and were used to measure frequency variations of devices such as resonators <cit.>. For qubit readout in solid state quantum processors <cit.> or to measure frequency variations and noise in resonators used for kinetic inductance detectors <cit.>, standard single side band (SSB) detection is employed to convert a variation of the microwave signal to baseband. In that scheme, a modulation signal is up- and down-converted in frequency allowing for sensitive measurements at high frequency with relatively inexpensive baseband instrumentation.\n\n\n\nOne of the advantages of interferometric measurements is their insensitivity to common mode noise or long-term drifts common to both interfering paths. Measurements where the two paths are likely to experience differential noise – e.g. when a microwave signal senses a sample in a cryostat and is then referenced to a carrier signal routed outside the cryostat – cannot benefit from this suppression, and the signal will be affected by variations in temperature, losses of microwave components or amplification noise specific to one path.\n\nHere, we demonstrate how the two paths of an interferometer in the microwave domain can be substituted by two different frequencies, thus using a bichromatic signal along the same physical path (e. g. the same cable going into and out of a cryostat). In this case a relative phase or amplitude shift between the two microwave tones produces the desired signal, whereas noise in amplitude or phase common to the two tones can be suppressed. \n\nThe basic idea to separate the two interfering signals in the frequency domain is shown in Fig. <ref>(b). Our approach is based on sideband modulation of a carrier signal, and is thus referred to as a sideband microwave interferometer (SMI).\nWe describe the implementation and characterisation of the SMI, provide a theoretical model and experimentally verify the suppression of common-mode phase noise and amplitude noise at two different operation points of the interferometer. The setup is then used to probe the response of a coplanar waveguide resonator at millikelvin temperatures,\nallowing rapid microwave measurements of fluctuations of the resonator's frequency and quality factor induced by two-level-systems (TLSs). \nThe experiment is implemented with a signal generator, a splitter, two mixers, and a lock-in amplifier. \nThe bandwidth is limited by the shortest lock-in integration time, and in the present case can extend up to tens of MHz, allowing for the measurement of fast variations although at the expense of the detection sensitivity.\n\nIn the following Section we provide a detailed explanation of the measurement scheme and its experimental implementation. Section <ref> shows the operation of the SMI, and characterization of its noise suppression properties. In Section <ref> we conclude and provide perspectives on improvements with which we plan to advance our scheme.\n\n\n\n\n§ MEASUREMENT SCHEME\n\n\nThe general idea [see Fig. <ref>(b)] is to modulate a microwave carrier signal to generate two sidebands. These are reflected off or transmitted through a device under test, and then demodulated to make them interfere. In contrast to conventional SSB detection <cit.>, the interference allows for the detection of relative phase or amplitude changes between the two sidebands, which can be exploited to get a first-order suppression of the common-mode noise introduced e. g. in the cable by thermal expansion or vibrations. For instance, one sideband can be tuned to the frequency of a resonator and be used as a probe, while the other one may lie several linewidths away, acting as a reference. \nThe parameters of the SMI can be tuned to obtain an output signal that is proportional to a constructive or destructive interference of the two reflected or transmitted sidebands, thus reducing either common-mode phase or amplitude noise.\n\nThe definitions of the various frequencies used in this work are reported in Table <ref> in Appendix <ref>, and are hereafter used to detail the theoretical description of this method.\n    \n\n\nFig. <ref> shows the setup used in this work. The carrier signal proportional to e^iω_0 t is modulated in an IQ mixer with I and Q signals a_1e^iω_s t + iα_1 and a_2e^iω_s t + iα_2 generated by a lock-in amplifier. This creates two first-order sidebands at frequencies ω_1,2=ω_0±ω_s. The amplitudes and phases of the two sidebands can be selected by setting the modulation parameters a_1, a_2, α_1 and α_2. \nMore specifically, the sidebands are proportional to a_1 e^iω_1t + iα_1-a_2 e^iω_1t + iα_2 and a_1 e^iω_2t - iα_1+a_2e^iω_2t - iα_2. \n\nIn our case the signal is then attenuated in multiple steps (by a total of 90 dB) and sent to a coplanar waveguide resonator in a dilution refridgerator. The reflected signal is amplified by a low-noise cryogenic amplifier (LNA) at 4 K. A second amplification stage at room temperature further increases the signal strength resulting in a combined amplification of 70 dB. The output signal is then down-converted by mixing it with the carrier signal e^i ω_0 t + iδ at a second mixer (accounting for a phase difference δ of the carrier signal between the two mixers). The output of the latter is finally measured using the lock-in amplifier yielding in-phase and quadrature components x and y.\n\nFor simplicity we assume that the device under test only affects the signal at frequency ω_1, in this sense the two sidebands can be referred to as probe (ω_1) and reference (ω_2). We assume that the device under test shifts the phase of the probe sideband by ϕ and reduces its amplitude by a factor ξ. Neglecting the terms that oscillate with 2ω_0, the output signal of the SMI that is measured by the lock-in amplifier is\n\n    s_out(t)     = a_1 e^iω_s t+iα_1+iδ + ξ a_1 e^iω_s t + iα_1 + iϕ - iδ\n        + a_2 e^iω_s t + iα_2 + iδ - ξ a_2 e^iω_s t + iα_2 + iϕ - iδ.\n\n\n\n\nThe in-phase and quadrature components of the terms oscillating at ω_s in Eq. (<ref>) are visualized in Fig. <ref>(a). The total signal can be understood as two interfering terms, b_1 e^iβ_1=a_1 e^iα_1+iδ+a_2 e^iα_2 + iδ and  b_2 e^iβ_2=ξ e^i ϕ(a_1 e^iα_1 - iδ-a_2 e^iα_2 - iδ). The amplitudes b_1 and b_2 are given by\n\n\n    b_1^2=a_1^2+a_2^2+2a_1a_2cos(α_1-α_2)\n\nand\n\n    b_2^2=ξ^2(a_1^2+a_2^2-2a_1a_2cos(α_1-α_2)).\n\n\nBy tuning the parameters of the modulation signals (a_1, α_1, a_2, α_2 and δ) we can achieve identical amplitudes for the two interfering terms, b_1 = b_2, and an arbitrary phase β_1 - β_2 between them. The parameters for same amplitudes are found by equating Eq. <ref> with Eq. <ref>, yielding the condition cos(α_1-α_2)= (ξ^2-1)(a_1^2+a_2^2)/((1+ξ^2)(2a_1a_2)). The phase β_1 - β_2 can be tuned by adapting a_1, a_2 and either α_1 - α_2 or δ.\n\nThere are two phases of specific interest, geometrically illustrated in Fig. <ref>(b): for β_1 - β_2=0, we achieve constructive interference, and common mode phase noise at the two sideband frequencies is suppressed. For β_1 - β_2=π, we achieve destructive interference, where common noise in the amplitude of the two sidebands is canceled. For both, destructive and constructive interference, the signal demodulated by the lock-in amplifier senses ξ and ϕ, in a similar way as in conventional SSB detection schemes, but here with the added advantage of suppressed common-mode noise.\n\n\n\n\n\n§ TEST AND CALIBRATION OF THE SIDEBAND INTERFEROMETER\n\n\n\n\n\n §.§ Phase and amplitude noise rejection\n\n\nTo verify the predicted common-mode amplitude-noise and phase-noise rejection, we use the interferometric scheme reported in Fig. <ref> but replace the resonator with a variable attenuator and a variable phase shifter. We determine the optimal rejection points for both noise sources by applying either a controlled attenuation or a controlled phase shift to the up-converted signal. In Fig. <ref>, we compare the magnitude of noise sensitivity Δ S = √(Δ x^2 + Δ y^2) as a function of varying a_2 and α_2 (at fixed a_1 of 10 mV  and α_1 of 330 degrees). Δ x and Δ y correspond to the changes of the I and Q components x and y of the demodulated signal when varying the common-mode amplitude by one percent or the common-mode phase by 0.01 rad. The detailed experimental setup is presented in Appendix  <ref>. \n\nCommon amplitude noise is suppressed at x=y=0.0 mV [see Fig. <ref>(a)] as predicted in Sec. <ref> and because of destructive interference of the two sidebands. We reach this point at a_2 = 43.7 mV   and α_2=246.4. The linecut of Δ S versus x at y=0.0 mV in Fig. <ref>(c) shows that Δ S linearly decreases towards the rejection point. Similiarly, the common-mode phase noise [see Fig. <ref>(b)] is linearly suppressed towards its rejection point at x=1.7 mV and y=0.0 mV, see Fig. <ref>(d). This point corresponds to  a_2 = 23.2 mV and α_2 = 57.2. The values in Figs. <ref>(c) and (d) can be compared to the noise sensitivity at the SSB configuration [a_2=11 mV and α_2=61, crosses in Fig. <ref>(a) and (b)], where Δ S is 7.6 μ V for both one percent of amplitude noise or 0.01 rad of common-mode phase change. These results quantitatively demonstrate that the SMI can to first order suppress either form of common-mode noise by adjusting amplitude and phase of the two lock-in outputs. We expect that the ultimate limit of such suppression is given by the stability of phases and amplitudes of the lock-in outputs and by that of the carrier signals used for the up- and down-conversion.\n\n\n\n §.§ Resonator measurements\n\n\n\n\nTo test the interferometer, we use a high kinetic inductance coplanar waveguide resonator in a hanger geometry, fabricated from a thin film of sputtered NbN with a nominal thickness of 10 nm on an intrinsic silicon substrate.\nThe resonator has a length of 2 mm. Its resonance frequency is f_r=6.16 GHz, the loaded and coupling quality factors are Q_l ≃ 8.0 × 10^3 and Q_c≃9.8 × 10^3, and the resonator has an impedance Z_r ≃ 316 Ω. Since the low-power internal quality factor is of order Q_i≃5×10^4, the resonator is overcoupled. Measurements are performed at 25 mK, the base temperature of a dilution refrigerator. The reader is referred to the appendices for more details, which show the measured probe signal (microwave output) of the SMI and the phase and amplitude response of the resonator under study.\n\nIf the frequency of the probe sideband is set to the resonator's center frequency ω_r/2π, a small variation of ω_r by δ_r≪γ_r mostly affects the phase ϕ of the reflected sideband. Here, γ_r is the resonator linewidth. With the SMI probing at a fixed frequency, only frequency shifts δ_r < γ_r can be resolved. For larger δ_r≫γ_r, the signal exceeds the measurement bandwidth (MBW) and changes in ϕ or ξ become very small.\n\n\n    \n To determine absolute frequency shifts of the resonator, it is necessary to relate the SMI signal to the resonance lineshape. The latter is obtained from SSB spectroscopy by sweeping the frequency of the carrier ω_0 in an interval ≃γ_r, with ω_1 close to the resonator frequency, and independently with a vector network analyzer (VNA). In Fig. <ref> this is shown together with the signal where the SMI is tuned to the amplitude-noise suppression point at ω_1=ω_r (orange curve). Note that the electrical phase delay (i.e. a background phase component linearly varying with frequency) leads to a circular (elliptical) background signal in the SSB (SMI) configuration, respectively. \nIf probed on resonance, small shifts of the resonator frequency affect mostly the phase ϕ of the reflected probe sideband, whereas variations in the quality factor change the reflected amplitude ξ, changing the SMI signal in the orthogonal direction in the IQ (x, y) plane of the demodulated signal. In Fig. <ref> we indicate the calculated SMI signal for a resonator with reduced internal quality factor (red square) and with a shifted resonance frequency (green diamond).\n\n\n\n §.§ Study of resonator noise\n\n\nNoise in microwave resonators usually originates from the presence of TLSs in amorphous materials or interfaces  of these devices <cit.>. Due to the relevance for improving coherence of quantum devices, this is the object of an intense research activity <cit.>.\nTechniques that track frequency fluctuations <cit.> can shed light on the properties of TLSs <cit.>, and have brought on new possibilities for studying their distribution, origin and stability <cit.>.\nIn this context the SMI, that allows suppression of common mode noise, can be a powerful tool to gain further insights into the underlying TLS physics.\n\n\n\nWith the SMI tuned to the amplitude noise rejection point, we have measured resonator frequency noise fluctuations for more than 11 hours at a time and an example trace is reported in Fig. <ref>(a). Frequency fluctuations of the resonator were obtained from the SMI signal using a calibration as discussed in Section <ref> and using a linear interpolation between SMI phase and resonator frequency. The detected noise increases by more than a factor of 100 with respect to the signal measured off resonance, and is thus dominated by the resonator's fluctuations. The average photon occupation number was calculated using <cit.>\n\n    ⟨ n ⟩ = E_r/ħω_r = 2/ħω_r^2Q_l^2/Q_c50 Ω/Z_rP_in,\n\nwhere P_in is the input power of the on-resonance sideband. In this measurement the resonator is studied with ⟨ n ⟩≃ 8.\nThe sampling frequency is set to 100 Hz and the lock-in integration time is 10 ms. \n\n\nThe time trace of the resonator frequency shown in Fig. <ref>(a) displays clear random telegraph signals (see inset) typically associated with TLSs noise.  \nThe histogram (b), spectral density (c) and Allen deviation (d) put a slightly different spotlight on the TLSs properties. The histogram (b) of the time trace in (a) can be fit with three shifted Gaussians. This seems to indicate that a few slow TLSs dominate the disturbance of the resonator and lead to three large characteristic frequency shifts. In an ensemble of TLSs, a few near resonant fluctuators can be more strongly coupled to the resonator <cit.> giving rise to such discrete offsets. \nThe noise spectrum √(S_p) in (c) is obtained through a Fourier transform of the time trace after subtracting offsets and by application of a moving average in the frequency domain. Here, we expect to see an ensemble of TLSs show up as the typical S_p = a_p/f dependence (dashed line). There are two obvious deviations from this behavior in the data. Above 10 Hz we see that the noise is suppressed due to the measurement bandwidth limited by the lock-in integration time (brown shading). At around 20 mHz we find more noise than expected from the 1/f background. We argue that this is due to a characteristic timescale of the dominant TLSs that contribute to an additional broad peak in the spectrum <cit.>. A comparison with the 400 s inset in (a) shows that the switching frequency of the dominant TLS is compatible with this value. Another, complementary way of visualizing this, is the Allan deviation σ_f(τ) shown in Fig. <ref>(d). The Allan deviation for a a_p/f power spectrum should be constant at a level of σ_f(τ) = √(2ln2  a_p) (dashed line). We again find a peak centered around τ =1/(2π 20 mHz) ≈ 8 s and a reduction of the noise at small τ. \nWe also studied the dependence of these noise spectra and Allan deviations down to photon numbers ⟨ n ⟩ < 0.1 where white noise dominates the spectrum for frequencies >0.2 Hz and the low frequency fluctuation amplitude of the resonator increases to  a_p = 4.0·10^6 Hz^2 (see Appendix <ref>). These findings are in agreement with previously reported results, e. g. <cit.>.\n\nThis shows that the application of the SMI to the study of TLS noise is promising. The fact that variations in frequency and Q value of the resonator lead to orthogonal signals in the SMI readout (see Fig. <ref>) can be used to simultaneously track both frequency and quality factor shifts of a quantum device <cit.>. This allows the study of noise correlations in these two values, something that we will explore in a forthcoming work.\n\n\n\n§ CONCLUSIONS AND PERSPECTIVES\n\n\nWe describe and operate a microwave interferometer based on the modulation of a carrier resulting in two sidebands, which are used as probe and reference signals.\nThis setup measures relative phase or amplitude shifts between the probe and reference, therefore selectively eliminating common mode noise and enabling long-term stability in quantum device characterization.\nWe test our scheme by adding controlled common phase and amplitude variations which demonstrate the scheme's resilience to systematic noise. We use the SMI for the readout of a superconducting resonator at millikelvin temperatures, and measure its frequency noise induced by nearby TLS fluctuators. \n\nThe ultimate sensitivity that can be reached with this setup is not thoroughly addressed in this work, but will be the subject of future analysis. A critically coupled resonator could be read out at lower power with the same signal-to-noise ratio. Exploiting this, one could test a resonator's noise with a much lower photon number ⟨ n ⟩ or increase the MBW to study higher frequency noise.\nIn the case of frequency shifts that exceed the linewidth of the resonator, a feedback loop with a PID controller could be implemented via software in the lock-in amplifier, in order to track the resonance frequency and extend the MBW of the present experiment. This addition does not necessarily reduce signal bandwidth, as the PID could be integrated digitally in the lock-in.\n\nIn the present work the potential of the SMI is demonstrated in a study of TLS noise affecting a coplanar-waveguide resonator, but we stress that its application is far more general. For instance, the properties of the SMI can be leveraged for the readout of qubits at lower power and reduced sensitivity to systematic sources of noise such as slow drifts induced by temperature fluctuations. Instead of using the two sidebands as probe and reference, the principle of sideband interference can be extended by using both sidebands as a probe e.g. of two different resonators each coupled to a qubit. This could enable parity readout of the two qubits with reduced common-mode noise.\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nThe authors would like to thank the Cleanroom Operations Team of the Binnig and Rohrer Nanotechnology Center (BRNC) for their help and support. We are also grateful to Stephan Paredes and Peter Müller for the experimental help, and to Clemens Müller, Giuseppe Ruoso and Leonardo Massai for fruitful discussions.\nWe gratefully acknowledge funding from Swiss National Science Foundation under grant number 200021_188752 and by the NCCR SPIN, funded by the SNSF under grant number 51NF40-180604.\n\n\n\n\n§ ADDITIONAL EXPERIMENTAL DETAILS\n\n\nIn the main text there are several frequency quantities and abbreviations which are important to tell apart. Table <ref> sums them up and lists their name, symbol, a short description and their value. The first group of rows are frequencies and frequency shifts of the interferometer signals and of the resonator, while the second, separated by a line, describes the bandwidths of the readout system.\n\n\n\nThe spectrum of the microwave signal that is used to probe the resonator is shown in Fig. <ref>(a), which is also helpful to frame the quantities described in the text and in Table <ref>. Fig. <ref>(b) shows the resonator response measured with a VNA.\nThe left sideband is on-resonance with ω_r, and thus interacts with the resonator, while the right sideband remains unaffected. The signal at the carrier frequency ω_0 is suppressed by roughly five orders of magnitude.\nThis is obtained with a carrier power ≃ 15 dBm and frequency ω_0/2π≃ 6.16 GHz, while the modulation amplitudes a_1, a_2 are of order 50 mV and frequencies are ω_s/2π≃ 10 MHz. The IQ mixer is balanced with DC offsets in order to minimise the amplitude of the carrier at the microwave output by more than four orders of magnitude.\nThis signal is gradually attenuated by -91 dB and sent to the resonator. \n\n\n\n\n\n§ EXPERIMENTAL SETUP FOR DEMONSTRATION OF PHASE AND AMPLITUDE NOISE REJECTION\n\n\n\n\nThe experimental setup for the demonstration of phase and amplitude noise rejection found in Sec. <ref> is displayed in Fig. <ref>. A voltage-controlled variable attenuator and a variable phase shifter were placed in series after the microwave output of the IQ mixer. A DC block was used to prevent any DC leakage from the IQ mixer that would affect the value of either attenuation or phase arising from these components. An isolator was placed after each component to prevent the formation of standing waves.\n\nFor the common-mode phase noise measurements, attenuation arising from the phase shifter was calibrated using a single sideband configuration. A small voltage-dependent attenuation of the phase shifter was compensated with the variable attenuator. A common-mode amplitude variation was achieved by varying both amplitudes a_1 and a_2 of the signals coming from the lock-in amplifier. \n\nThe different working points in the IQ plane as displayed in Fig. <ref> were obtained for different amplitudes  a_2 ranging from 0 mV to 80 mV and phases α_2 from 0 to 360 of the Q-input of the IQ mixer for fixed amplitude  a_1 = 10 mV and fixed phase α_1. \n\n\n\n§ POWER DEPENDENCE OF RESONATOR NOISE\n\n\nWe studied the frequency noise of the resonator for different probing powers and otherwise same parameters as in the main text. The resulting noise spectral densities (SD) and Allan deviations are shown in Fig. <ref>.\nThe measurements reported in the main text are (a) and (d), both showing excellent agreement with the expected 1/f behavior up to a timescale of several hours. The reduced probing power, used in (b), (e), (c) and (f), decreases the signal-to-noise ratio of the interferometer, therefore measurement noise (white noise) starts to dominate over the one from the resonator.\nFor both measurements at weaker probing power the Allan deviation shows a slope closer to -0.5 (green dashed line) at small τ values which is expected for white noise.\n\n\n\n\n\n§ GUIDE OF OPERATION\n\n\nHere, we detail a practical guide to setup an interferometric readout like the one described in this work. In this context, Fig. <ref> is taken as a reference.\n\n    \n  * Take a microwave source and tune its frequency (carrier) ω_0 close to the one of the DUT.\n    \n  * The carrier is then split, and the two outputs are connected to the LO ports of an IQ mixer and a down-conversion mixer. In the former, the in-phase and quadrature inputs are wired to two low-frequency oscillators which create sidebands and have the same frequency ω_1=ω_2 (but tunable phase α_1 and α_2 and amplitude a_1 and a_2).\nIn our setup these are the reference outputs of the lock-in amplifier and can therefore also be used for phase-sensitive detection of the down converted output signal of the SMI. The amplitude of the probe signal can be varied by changing a_1 and a_2, or by attenuating the entire input signal.\n    \n  * At this point, using similar initial values of the two amplitudes and phases, it is convenient to connect the resulting signal to a spectrum analyser and check the sidebands. The DC offsets of the low-frequency oscillators can eliminate the residual carrier at ω_0 by balancing the mixing, and yield a spectrum like the one of Fig. <ref>(a).\nThis is the input signal that is sent to the DUT, so one should take care that only one sideband is on-resonance with the spectral features of the DUT. The output signal of the SMI is down-converted in the second mixer, and its phase and amplitude detected with the lock-in amplifier.\n    \n  * With this the setup is fully wired, and measurements can commence.\nThe first thing to test is that one sideband is actually on resonance with the DUT, which can be done for example by sweeping ω_0 and resolving the spectral features of the DUT on the lock-in output. This spectroscopic measurement can also be fit to the resonator lineshape (measured e. g. with a VNA) to calibrate the system. Once the resonance of the DUT is found, the amplitude-noise rejection configuration is simply obtained by tweaking a_2 and α_2 to get a zero in the amplitude √(x^2+y^2) of the output signal, as is shown in Fig. <ref>(a).\nBefore starting measurements, the input signal is checked again and the mixer re-balanced such as to account for intermittent adjustments of the oscillator's parameters.\n\nThe interferometer is ready to measure in the amplitude-noise rejection configuration. The simplest way to switch to phase-noise rejection requires a phase-shifter between the splitter and the LO (carrier or local oscillator) input of the down-conversion mixer. The interferometer can be configured to the amplitude-noise rejection following the previous procedure, and by applying a phase shift of π one ends up in the phase-noise rejection configuration.\n\napsrev4-2\n\n\n"}