{"entry_id": "http://arxiv.org/abs/2303.07017v2", "published": "20230313112742", "title": "O'Grady tenfolds as moduli spaces of sheaves", "authors": ["Camilla Felisetti", "Franco Giovenzana", "Annalisa Grossi"], "primary_category": "math.AG", "categories": ["math.AG", "14J42, 14E07 (14J50)"], "text": "\n\nReadout of quantum devices with a sideband microwave interferometer immune to systematic noise\n    A. Fuhrer\n    March 30, 2023\n==============================================================================================\n\n\t\nWe give a lattice-theoretic characterization for a manifold of  type to be birational to some moduli space of (twisted) sheaves on a K3 surface. We apply it to the Li–Pertusi–Zhao variety of  type associated to any smooth cubic fourfold. Moreover we determine when a birational transformation is induced by an automorphism of the K3 surface and we use this to classify all induced birational symplectic involutions.\n\n\n\n\n\n\n§ INTRODUCTION\n\nTo know birational models of irreducible holomorphic symplectic (ihs) manifolds is a significant stage towards the full comprehension of their geometry.\n Throughout the paper we refer to ihs manifolds deformation equivalent to the O'Grady ten dimensional example as ihs manifolds of  type. \n \n \n \n Many examples of ihs manifolds are realized as moduli spaces of sheaves on abelian or K3 surfaces. \n The O'Grady examples are symplectic resolutions of these moduli spaces and form a codimension 3 locus in the space of deformations of ihs manifolds of  type. For this reason, given any such manifold it is then natural to investigate when it is birational to a moduli space of sheaves. \n The first motivation for this paper was to provide an answer to this question.\n \n As it is well known, the geometry of an ihs manifold X is encoded in its second integral cohomology group H^2(X,ℤ). This group is torsion free and carries a symmetric non-degenerate bilinear form, called the Beauville–Bogomolov–Fujiki form, which induces a lattice structure on it.\n The first main result of the paper provides an answer to this question via a lattice-theoretic characterization. To this end, similarly to the already existing terminology <cit.> we introduce the lattice-theoretic notion of numerical moduli space (see <ref>).\n[<ref>]\nLet (X,η) be a marked pair of  type. The following conditions are equivalent:\n\n    \n  * There exists a K3 surface S, a Mukai vector v=2w where w is a primitive Mukai vector of square 2, and a v-generic polarization θ on S such that X is birational to ;\n    \n  * The manifold X is a numerical moduli space.\n\n\n\nWhile this extends analogous results for the other known deformation types of ihs manifolds <cit.>, the theory of moduli spaces of sheaves on K3 surfaces developed into considering also their twisted analogues.\nOriginally, the motivation for generalization to twisted K3 surfaces was\nthe existence of coarse moduli spaces. However, it has become more and more clear that allowing twists has quite unexpected applications (see for example <cit.> for further details).\nIn <ref> we then consider the twisted picture and extend the above result to this setting. \n\nLater we consider the ihs manifold of  type X_Y defined by Li, Pertusi, and Zhao (LPZ) which is associated to a smooth cubic fourfold Y <cit.>.\nWe are able to provide a purely lattice-theoretic characterization for X_Y to be birational to a moduli space of sheaves on a (possibly twisted) K3 surface, providing a new proof of <cit.>.\n[<ref> and <ref>]\nLet X_Y be an LPZ-variety associated to a smooth cubic fourfold Y. The following conditions are equivalent.\n\n\n  * The cubic fourfold Y lies in the Hassett divisor 𝒞_d with d satisfying (**) (resp. (**')).\n\n  * The LPZ-variety X_Y is a (resp. twisted) numerical moduli space.\n\n\nThe same question for Fano varieties of lines of cubic fourfolds and for the so called Lehn–Lehn–Sorger–van Straten symplectic eightfolds has been previously answered in <cit.> and <cit.>. \n\nOnce we know under which conditions an ihs manifold of  type is birational to a moduli space of sheaves on a K3 surface S, it is then natural to investigate which birational transformations are induced by an automorphism of S (see <ref>). To this end we introduce the notion of numerically induced birational transformations (see <ref>), which is a characterization in terms of their action on the second integral cohomology lattice.\n\n[<ref>]\nLet (X,η) be a smooth marked pair of  type and let G⊂Bir(X) be a finite subgroup. If G is a numerically induced group of birational transformations, then there exists a K3 surface S with an injective group homomorphism G↪Aut(S), a G-invariant Mukai vector v and a v-generic polarization θ on S such that X is birational to  and G⊂Bir(X) is an induced group of birational transformations. \n\n\n\nFor what concerns symplectic actions on  type manifolds we know that the unique symplectic regular automorphism of finite order is the identity <cit.>, and symplectic birational involutions are classified <cit.>. Lattice-theoretic constraints for nonsymplectic automorphisms of  type are treated in <cit.>. Nonsymplectic involutions will be treated in <cit.>, and so far nothing is known for higher order actions. Applying our criterion we show that there exists a unique induced birational symplectic involution on an ihs manifold of  type. More precisely we give the following characterization. \n\n[<ref>]\nLet (X, η) be a marked pair of  type. Assume that X is a numerical moduli space and let φ∈(X) be a birational symplectic involution. Then φ is induced if and only if\n\n    H^2(X,ℤ)^φ≅^⊕3⊕_8(-2) ⊕_2(-1)   and H^2(X,ℤ)_φ≅_8(-2).\n\n\n\n\n\n\n\n §.§ Outline of the paper\n\nIn <ref> we recall some preliminary results about lattice theory and briefly describe the lattice structure of the second cohomology group of an ihs manifold. In <ref> we specialize to manifolds of  type: after describing their construction and properties, we state and prove <ref>. In <ref> we provide a generalization of it to the twisted case.\nIn <ref> we apply the birationality criteria of <ref> and <ref> to the LPZ variety. Finally in <ref> we examine birational transformations of  type to determine which ones are induced. \n\n\n\n §.§ Acknowledgements\n\nThe authors wish to thank Luca Giovenzana and Giovanni Mongardi for useful discussions.\n C.F. was partially supported by PRIN \"Moduli spaces and Birational Classifications\". F.G. and A.G. were supported by the DFG through the research grant Le 3093/3-2.\nAll authors are supported by INDAM GNSAGA. \n\n\n\n§ PRELIMINARIES IN LATTICE THEORY\n\nIn this section we recall some basic facts of lattice theory for irreducible holomorphic symplectic manifolds, focusing on the special case of  type. \n\n\n\n §.§ Abstract lattices\n\n A lattice  is a free finite rank ℤ-module with a non-degenerate symmetric bilinear form \n\n    ·×   →ℤ\n    \n    (e,f)    ↦ e· f.\n\n\nWith an abuse of notation we denote e· e simply by e^2. Moreover, we say that the lattice  is even if e^2 is even for any element e ∈ and we denote the determinant, the rank and the signature of the lattice  by (), () and () respectively.  \n\nGiven a lattice , we define the dual lattice of  to be the lattice ^∨_ℤ(,ℤ). The dual lattice can be characterized uniquely as \n\n    ^∨={ x∈⊗ℚ| x· y∈ℤ for all y∈}.\n\n\n\nGiven e∈, we define the divisibility of e in  is\n\n    (e,)gcd{e· f| f∈}.\n\n\n\nOne can show that the quotient A_^∨/ is a finite group, called discriminant group of , of order |()|. We say that a lattice  is unimodular if A_ is trivial.\n\n\nWe denote the unique unimodular even indefinite rank 2 lattice by . Moreover the symbols _n,_n,_n denote the positive definite ADE lattices of rank n. The notation [m] for some m∈ℤ indicates a rank 1 lattice generated by a vector of square m. \n\nFor any lattice  we denote by (n) the lattice with the same structure as  as a ℤ-module and quadratic form multiplied by n.\n\n\nWhenever we have a lattice , we can consider a subgroup G⊂ O() of isometries on . We denote by ^G the invariant sublattice of  with respect to the action of G, and by _G (^G)^⊥ its orthogonal complement in , which is called coinvariant sublattice.\n\n\n\n  §.§.§ Hodge structure on \n Given a lattice  with a weight 2 Hodge structure, i.e. a decomposition \n\n    _ℂ⊗_ℤℂ=_ℂ^2,0⊕_ℂ^1,1⊕_ℂ^0,2,\n\nwith _ℂ^2,0≅_ℂ^0,2 and _ℂ^1,1≅_ℂ^1,1, \n\nwe will denote by \n\n    ^1,1_ℂ^1,1∩,\n\nand refer to it as the (1,1) - part of the lattice .\n\nAn embedding of lattices 𝐌↪ is called primitive if the group /𝐌 is torsion free. In this setting we denote by 𝐌^⊥ the orthogonal complement of 𝐌 in  with respect to the bilinear form on .\n\n\n\nLet 𝐌 be a lattice endowed with a weight 2 Hodge structure. An embedding of lattices 𝐌↪ is called Hodge embedding if it is primitive and  is endowed with a weight 2 Hodge structure defined as follows:\n\n    _ℂ^2,0=𝐌_ℂ^2,0,   _ℂ^1,1=(𝐌^1,1⊕𝐌^⊥)⊗ℂ,  _ℂ^0,2=𝐌_ℂ^0,2.\n\nMoreover if  has already a Hodge structure on it, we say that the Hodge embedding 𝐌↪ is compatible if the Hodge structure induced by 𝐌 is the one of .\n\n\n\n\n §.§ Lattice structure of irreducible holomorphic symplectic manidolds\n\nSuppose X is an irreducible holomorphic symplectic manifold of complex dimension 2n. The second integral cohomology group has a well defined lattice structure: in fact is a torsion free ℤ-module of finite rank endowed with a symmetric bilinear form (-,-)_X, called the Beauville-Bogomolov-Fujiki form, which satisfies the following equality for any α∈ H^2(X,ℤ):\n\n    ∫_Xα^2n= c_X(α,α)^n_X,\n\nfor some unique positive rational constant, called the Fujiki constant (see for example <cit.>, <cit.>).\n\nNote that both the Beauville–Bogomolov–Fujiki form and the Fujiki constant are invariant up to deformation. \n\n\n\n\n  §.§.§ Lattice of O'Grady 10 type manifolds\n\n\nA marked pair of  type is pair (X,η) where X is an irreducible holomorphic symplectic manifold  type and η H^2(X,ℤ) → is a fixed isometry of lattices. In what follows, we denote by  the isometry class of H^2(X,ℤ), which is well defined in view of <ref>.\nIn <cit.> Rapagnetta shows that  is isometric to\n\n    ^⊕ 3⊕_8(-1)^⊕ 2⊕_2(-1),\n\nwhich is an even lattice of rank 24 and signature (3,21).\n\nMoreover, being the second cohomology group of a compact Kähler manifold,  is endowed with a natural weight 2 Hodge structure, whose Hodge numbers are deformation invariant.\n\nIn particular, if (X,η) is a marked pair of  type, the integral lattice ^1,1 is called the Néron–Severi lattice of X and it is denoted by (X). Its orthogonal complement is called trascendental lattice and it is denoted by (X).\n\n\n§ MODULI SPACES OF SHEAVES OF O'GRADY 10 TYPE\n\n\nIn his seminal paper <cit.>, O'Grady discovers a new 10-dimensional ihs manifold not deformation equivalent to a Hilbert scheme of K3 or a generelized Kummer variety. The example arises as a symplectic resolution of a moduli space of sheaves on a K3 surface with fixed numerical constraints.\nIn <ref> and in <ref> we recall the original construction and its generalizations, focusing also on the lattice-theoretic point of view. In <ref> we are finally ready to state and prove criteria to determine if a manifold of  type is birational to a moduli space of sheaves on a K3 surface. \n\n\n §.§ The Mukai lattice\n\n\nLet S be a K3 surface. We denote by H(S,ℤ) the even integral cohomology of S, that is \n\n    H(S,ℤ)=H^2*(S,ℤ)=H^0(S,ℤ)⊕ H^2(S,ℤ)⊕ H^4(S,ℤ).\n\nWe can put a symmetric bilinear pairing on it, called the Mukai pairing, in the following way:\n\n    H(S,ℤ)×H(S,ℤ)   →ℤ\n    \n    (r_1,l_1,s_1),(r_2,l_2,s_2)    ↦ -r_1s_2+l_1l_2-r_2s_1\n\nwith r_i∈ H^0(S,ℤ), l_i∈ H^2(S,ℤ) and s_i∈ H^4(S,ℤ).\n\nThe lattice H(S,ℤ) together with the Mukai pairing is referred to as the Mukai lattice and it is isometric to ^⊕ 4⊕_8(-1)^⊕ 4.\nIn what follows, any element v∈H(S,ℤ) will represented by a triple v=(v_0,v_1,v_2) with v_i∈ H^i(S) and will be called Mukai vector.\n\nThe natural Hodge structure on H^2(S,ℤ) can be extended to a weight 2 Hodge structure on H(S,ℤ) by setting H_ℂ^2,0(S) H^2,0_ℂ(S) (resp. H_ℂ^0,2(S) H_ℂ^0,2(S)) and\n\n    H^1,1_ℂ(S) H^0(S,ℂ)⊕ H_ℂ^1,1(S)⊕ H^4(S,ℂ).\n\nFor any Mukai vector v∈H(S,ℤ) the orthogonal sublattice with respect to the Mukai pairing  \n\n    v^⊥={w∈H(S,ℤ)| (v,w)=0}⊆H(S,ℤ)\n\ninherits a weight 2 Hodge structure from H(S,ℤ) in an obvious fashion.\n\nMoreover, given a coherent sheaf ℱ on S, we can naturally associate a Mukai vector to it by setting\n\n    v(ℱ)(rank (ℱ), c_1(ℱ),c_1(ℱ)^2/2 -c_2(ℱ) + rank(ℱ))∈H(S,ℤ).\n\nBy construction, v(ℱ)=(r,l,s) is of (1,1)-type and it satisfies one of the following relations:\n\n\n  * r>0;\n\n  * r=0 and l≠ 0 with l effective;\n\n  * r=l=0 and s>0.\n\n\n A nonzero vector v∈H(S,ℤ) satisfying v^2≥ 2 and one of the conditions above is called positive Mukai vector.\n\n\n\n\n §.§ Moduli spaces of sheaves of  type\n\nGiven a Mukai vector v and a v-generic polarization θ, we can consider the moduli spaces  of θ-semistable sheaves on S with Mukai vector v.\n\nMore generally we consider Mukai vectors v of type v=mw where m∈ℕ and w∈H(S,ℤ) is some primitive Mukai vector. It is well known that that if ≠∅ then  is smooth of dimension v^2+2 and carries a symplectic form <cit.>. Indeed Mukai shows <cit.> that when v is a primitive Mukai vector then  is an IHS manifold.\n\n Let S be a K3 surface, v be a primitive Mukai vector\nand θ be a v-generic polarization. Then = and if v^2≥ -2, then  is a irreducible holomorphic symplectic manifold of dimension v^2+2=2n, which is deformation equivalent to the n-th Hilbert scheme of a K3 surface. Moreover there is a Hodge isometry between v^⊥≅ H^2(,ℤ).\n\n\nWhen v is not primitive  can be singular with a holomorphic symplectic form on its smooth locus. It is then natural to investigate under which conditions  admits a symplectic resolution of singularities, namely a resolution carrying a holomorphic symplectic form which extends the holomorphic symplectic form on the smooth locus of .\nO'Grady starts from this consideration and proves that the moduli space ℳ_10 with v=(2,0,-2), admits a symplectic resolution ℳ_10 which is \na irreducible holomorphic symplectic manifold of dimension 10 and second Betti number 24. This latter condition implies in particular that  cannot be deformation equivalent to a Hilbert scheme, so we have a new deformation class of ihs manifolds. \n\nWe say that an ihs manifold X is of  type if it is deformation equivalent to the O'Grady 10 dimensional example ℳ_10.\n \n\nThe construction has been later generalized by Perego and Rapagnetta <cit.> allowing different types of Mukai vectors and polarizations. More precisely, Perego and Rapagnetta introduce the concept of OLS-triple (S,v,θ) where S is a K3 surface, v is a Mukai vector and θ a v-generic polarization (see <cit.>). \nThey prove that whenever (S,v,θ) is an OLS-triple, then the moduli space  admits a symplectic resolution  which is of  type.\n\nLet (S,v,θ) be an OLS-triple. The resolution  of the moduli space  is an irreducible holomorphic symplectic manifold which is deformation equivalent to ℳ_10.\n\nConsider a holomorphic symplectic manifold X of  type.\nThe second integral cohomology group of irreducible holomorphic symplectic manifolds is endowed with a lattice structure. \nMoreover Perego and Rapagnetta describe the weight 2 Hodge structure on H^2(,ℤ).\n\nLet (S,v,θ) be an OLS-triple. Then the pullback π^*:H^2(,ℤ)→ H^2(,ℤ) via the resolution map is injective, so that H^2(,ℤ) admits a pure weight 2 Hodge structure and a lattice structure induced by restricting the Beauville-Bogomolov-Fujiki form on H^2(,ℤ).\nMoreover there is an isometry of Hodge structures \n\n    H^2(,ℤ)≅ v^⊥⊂ H^2(,ℤ).\n\n\n\nFinally they show that the class E∈ H^2(,ℤ) of the exceptional divisor has square 6 and divisibility 3. Moreover we have the following theorem.\n\nKeep the notation as above. There exists a finite index embedding\n\n    v^⊥⊕ℤE↪ H^2(,ℤ).\n\n\n\n\n §.§ Birationality criteria for OG10 type manifolds\n\n\nWe provide an entirely lattice-theoretic criterion to determine when a manifold X of  type is birational to a moduli space  of sheaves  on a - possibly twisted - K3 surface S, where (S,v, θ) is an OLS-triple as described in <ref>.\n\n\nLet (X,η) be a projective marked pair of  type, where η H^2(X,ℤ)→ is a fixed marking. We say that X is a numerical moduli space of  type if there exists a primitive class σ∈^1,1 such that \n\n\n  * σ^2=-6 and (σ,)=3,\n\n  * the Hodge embedding σ^⊥_↪_24 embeds a copy of  in _24^1,1 as a direct summand.\n\n\nWe are now in a position to state our birationality criterion.\n\nLet (X,η) be a marked pair of  type. The following conditions are equivalent:\n\n    \n  * There exists a K3 surface S, a Mukai vector v=2w where w is a primitive Mukai vector of square 2 and a v-generic polarization θ on S such that X is birational to ;\n    \n  * The manifold X is a numerical moduli space.\n\n\n\nSuppose Φ:X is a birational morphism. Then the induced isometry Φ^*: H^2(,ℤ)→ H^2(X,ℤ) is an isometry of Hodge structures.\nRecall that the manifold  is obtained as a symplectic resolution of singularities of the moduli space . \n\nNote that the class of the exceptional divisor E∈ H^2(,ℤ) is primitive of (1,1) type, of square -6 and divisibility 3. Moreover, by <cit.>, we have that E^⊥≅ H^2(,ℤ) and there exists a Hodge embedding H^2(,ℤ)↪H(S,ℤ)≅_24.\nLet σ:=Φ^*E. We want to prove that X is a numerical moduli space: since Φ^* is an isometry of Hodge structures, condition (a) in <ref> is satisfied. \nFor condition (b), observe that the composition\n\n    σ^⊥E^⊥≅ H^2(,ℤ)↪H(S,ℤ)≅_24≅^⊕ 4⊕_8(-1)^⊕ 2\n\nis a compatible Hodge embedding. We conclude by noticing that the vectors (1,0,0) and (0,0,1) in H(S,ℤ) lie in the image of this embedding and generate a copy of  inside H(S,ℤ)^1,1≅_24^1,1. \nThus X is a numerical moduli space.\n\nFor the other direction, since X is a numerical moduli space, there exists a class σ∈^1,1 such that σ^2=-6 and (σ,)=3, and a Hodge isometry σ^⊥_↪_24 such that _24^1,1 contains a copy of  as a direct summand.\n\nObserve that the lattice σ^⊥_ is isometric to the lattice ^⊕ 3⊕_8(-1)^⊕ 2⊕ [-2], so that setting \n\n    w:=(σ^⊥_)^⊥__24,\n\nwe have that w^2=2. Note that, by definition, [w] is a sublattice of _24 and it is of (1,1) type. Moreover, by construction, we have\n\n    w^⊥__24≅^⊕ 3⊕_8(-1)^⊕ 2⊕ [-2]≅σ^⊥_\n\nso sgn(w^⊥__24)=sgn(σ^⊥_)=(3,20). Moreover the projectivity of X implies the positive part of the signature of NS(X)≅^1,1 is equal to 1.\nSince the class σ has negative square, the positive part of sgn((σ^⊥_)^1,1) is equal to the positive part of the signature of ^1,1, which is 1. \n\nHence, the lattices _24^1,1 and (σ^⊥_)^1,1⊕ [w] have the same signature: in particular the positive part of sgn(_24^1,1) is equal to 2.\n\n\n\nBy hypothesis\n\n    _24^1,1≅⊕T\n\nfor some even lattice T of signature (1,-).\nBy Torelli theorem for K3 surfaces, there exists a K3 surface S such that NS(S)≅T. Setting v=2w, we can always choose a positive generator θ which is a  v-generic polarization on S. \nNow, by <cit.> since w^2=2 then either w or -w is a positive Mukai vector, hence we may assume that (S,v,θ) is an OLS-triple.\nBy <cit.> there exists a Hodge isometry\n\n    H^2(,ℤ)≅ v^⊥⊂_24,\n\nwhere the orthogonal complement of v is computed with respect to the Mukai pairing.\nThe singular moduli space  admits a symplectic resolution  with exceptional divisor E∈ H^2(,ℤ) such that E has divisibility 3 and E^2=-6.\n\nWe want to show that X is birational to  by showing that there exists a Hodge isometry between H^2(X,ℤ) and H^2(,ℤ) \nIn fact, when such an isometry exists, birationality is implied by the maximality of ^2() for  type manifolds, see <cit.> and <cit.>.\n\nObserve that we have a Hodge isometry\n\n    α: H^2(,ℤ)⊕ℤ E≅σ^⊥⊕σ\n \nand two finite index embeddings\n\n    H^2(,ℤ)⊕ℤ E    i H^2(,ℤ)\n    σ^⊥⊕σ   j H^2(X,ℤ).\n\nWe want to lift the Hodge isometry α to a Hodge isometry β:H^2(,ℤ)≅ H^2(X,ℤ). To do that, we look closer at the embeddings i and j above.\nIndeed we have that \n\n    H^2(,ℤ)⊕ℤ≅^⊕ 3⊕_8(-1)^⊕ 2⊕[-2]⊕ [-6]\n\nand it embeds in \n    H^2(,ℤ)≅^⊕ 3⊕_8(-1)^⊕ 2⊕_2(-1)\n\nvia the identity on the first two factor, which correspond to the unimodular part.\n\nTo define i we need to give a map between the lattices [-2]⊕[-6] and _2(-1). Let {a,b} be a set of generators of [-2]⊕[-6] such that, in this basis, the lattice pairing has associated gram matrix ([ -2  0;  0 -6 ]). Likewise, let {a,b} be generators of _2(-1) such that the lattice pairing has the form ([ -2  1;  1 -2 ]).\nThen we set \n\n    i(a)   =c+d,\n    \n        i(b)   =c-d.\n\nIn the same way, we can define the embedding j:σ^⊥⊕σ↪ H^2(X,ℤ), by setting a'=α(a) and b'=α(b) and c' and d' so that the associated matrix for the pairing on _2(-1)⊂ H^2(X,ℤ) is ([ -2  1;  1 -2 ]).\nWe can now define β as follows: on the unimodular part we set β to be the identity, while on _2(-1) we have\n\n    β(2c)=β(i(a+b))=j(α(a+b))=j(a'+b')=j(a')+j(b')=c'+d'+c-d'=2c,\n\nthus we can set β(c):=c' and likewise β(d):=d'.\nThen β is a Hodge isometry by construction and we conclude the proof.\n\n\n\n\n§ MODULI SPACES OF TWISTED SHEAVES OF O'GRADY 10 TYPE\n\nHere we recall basic facts about twisted K3 surfaces and extend the results of <ref>. For more details on twisted K3 surfaces we refer to <cit.>.\n\nA twisted K3 surface is a pair (S, α) where S is a K3 surface and α is a Brauer class α∈(S) ≅ H^2(S,𝒪_S^*). \n\n Choosing a lift B ∈ H^2(S, ℚ) of α under the natural morphism H^2(S, ℚ) →(S) induced by the exponential sequence allows one to introduce a natural Hodge structure H(S,α,ℤ) of weight two associated with (S,α). As a lattice, this is just H(S, ℤ) ≅ H^0(S,ℤ)⊕ H^2(S,ℤ) ⊕ H^4(S,ℤ), but the (2, 0) - part is now given by \n    H^2,0 (S,α, ℤ) ℂ(ω + ω∧ B)\n where 0 ≠ω∈ H^2,0(S). This defines a Hodge structure by setting \n \n    H^0,2(S,α)H^2,0,   H^1,1(S, α) (H^2,0(S, α)⊕H^0,2(S,α))^⊥\n where orthogonality is with respect to the Mukai pairing. Although the definition depends on the choice of B, the Hodge structures induced by two different lifts B and B' of the same Brauer class α are Hodge isometric <cit.>.\n\nWe have a well defined notion of coherent sheaf on a twisted K3 surface (S,α), given by replacing identity by α in the cocycle condition, see <cit.>.\n\n\nThe twisted version of the derived global Torelli theorem is the statement that the bounded derived categories of twisted coherent sheaves on (S,α) and (S',α') are equivalent if and only if there exists a Hodge isometry H(S, α, ℤ) ≅H(S', α', ℤ) preserving the natural orientation of the four positive directions, see <cit.> and <cit.>:\n\n    D^b(S,α) ≅ D^b(S', α') ⇔∃ H(S, α, ℤ) ≅H(S', α', ℤ)  oriented Hodge isometry.\n\n\n \nWe now want to generalise our criterion to the case of moduli space of sheaves  on a twisted K3 surface (S,α). \nWe start by giving the definition of twisted numerical moduli space. \n\nLet (X,η) be a projective marked pair of  type, where η H^2(X,ℤ)→ is a fixed marking. We say that X is a twisted numerical moduli space of  type if there exists a primitive class σ∈^1,1 such that \n\n\n  * σ^2=-6 and (σ,)=3,\n\n  * the Hodge embedding σ^⊥_↪_24 embeds a copy of (n) in _24^1,1 as a direct summand for some positive n∈ℕ.\n\n\n\nWe can prove an analogue version of <ref> for the twisted case.\n\n\nLet (X,η) be a marked pair of  type. The following conditions are equivalent:\n\n    \n  * There exists a twisted K3 surface (S,α), a non-primitive Mukai vector v=2w  and a v-generic polarization θ on S such that X is birational to ;\n    \n  * The manifold X is a twisted numerical moduli space.\n\n\n\nAs before, suppose X is birational to a symplectic resolution  of a moduli space  for some twisted K3 surface S(α), a non-primitive Mukai vector v=2w and a v-generic polarization θ on S. Then we have a Hodge isometry\n\n    H^2(X,ℤ)≅ H^2(,ℤ),\n\nsuch that H^2(,ℤ) embeds in H^2(,ℤ) as the orthogonal complement of the exceptional divisor E, which is of divisibility 3 and square -6. \nMoreover, there is a compatible Hodge embedding \n    H^2(,ℤ)↪H(S(α),ℤ)≅_24,\n\nwhere H(S,α,ℤ)≅_24 is endowed with the Hodge structured described in <ref>.\nLet σ be the image of E under the isometry (<ref>): then σ is of (1,1) type, has divisibility 3 in  and σ^2=-6.\n\nWe want to prove that the Hodge embedding σ^⊥_↪_24 embeds in _24^1,1 a copy of (n) as a direct summand. \nTo this end, observe that the composition\n\n    σ^⊥→E^⊥≅ H^2(,ℤ)↪H(S(α),ℤ)≅_24≅^⊕ 4⊕_8(-1)^⊕ 2\n\ndefines a compatible Hodge embedding. \nLet B∈ H^2(S,ℚ) be such that exp(B)=α. Note that the vectors n(1,B,B^2) and (0,0,1) generate a copy of (n) in H((S,α),ℤ)^1,1≅_24^1,1 as (<ref>) is a compatible Hodge embedding.\n\nFor the other direction we know that there exits σ∈^1,1 of square -6 and divisibility 3 such that σ^⊥_↪_24 embeds a copy of (n) in _24^1,1.\nLet e_n,f_n be the standard isotropic generators of (n). Choosing n minimal, we can assume that e_n= e is primitive in _24. Hence we can complete e to a copy of =⟨ e, f⟩ such that there is an orthogonal decomposition \n\n    _24≅⊕𝐑.\n\nWith respect to such decomposition the second basis vector f_n of  (n) can be written as \n\n    f_n=γ+nf+ke,\n\nfor some γ∈𝐑 and k∈ℤ.\n\nSimilarly, a generator of the (2,0)-part of the Hodge structure on _24 induced by σ^⊥ is orthogonal to e and hence is of the form ω+le with ω∈𝐑⊗ℂ and l∈ℤ. However, it is also orthogonal to f_n, so we have that \n\n    γ·ω+nl=0.\n\nSetting B=-γn we have that \n\n    ω+le=ω+B∧ω,\n\nwhere B∧ω stands for (B·ω)e.\nBy the surjectivity of the period map there exists a twisted K3 surface (S,α) with α=exp(B), such that H^2(S,ℤ)≅𝐑, identifying H^2,0(S)=⟨ω⟩.\nObserve that the above construction defines an Hodge isometry between H(S,α,ℤ) and _24 with the Hodge structure induced by the Hodge embedding σ^⊥↪_24.\n\n\nWe consider w ∈H(S,α,θ) such that under the above isometry \n    [w]≅ (σ^⊥_)^⊥__24.\n\nBy construction w^2=2 and either w or -w is a positive Mukai vector.\nIf we take v=2w we can embed\n\n    H^2(,ℤ) ≅ v^⊥_H↪_24.\n\nAgain, note that  admits a symplectic resolution  whose exceptional divisor E has square -6 and divisibility 3 and \n\n    [E]^⊥_H^2(M̃)≅ H^2(,ℤ).\n\nTo construct the isometry between H^2(X,ℤ) and H^2(,ℤ) we proceed as in <ref>.\n\n\n\n\n\n§ BIRATIONALITY CRITERIA FOR THE LI-PERTUSI-ZHAO VARIETY\n\n\nWe now give an application of <ref> and <ref> in the case of the  type variety defined by Li, Pertusi and Zhao associated to a smooth cubic fourfold <cit.>. We first recall briefly the construction and the main properties of this variety.\n\nGiven a smooth cubic fourfold Y one defines the Kuznetsov component as \n\n    _Y := ⟨_Y, _Y(1), _Y(2) ⟩^⊥⊂ D^b(Y)\n\nwhich is a triangulated subcategory with many properties in common with the derived category of a K3 surface. Its topological K-theory\n\n    (_Y) := ⟨ [_Y],[_Y(1)], [_Y(2)] ⟩^⊥⊂(Y)\n\nis a lattice endowed with the restriction of the Euler form on (Y). It has a natural pure Hodge structure of weight 2 obtained by pulling back the one from the cohomology of Y, see <cit.>.\nFor any smooth cubic fourfold the lattice (_Y) contains two distinguished Hodge classes defined as λ_i := [_L(i)]  for i=1,2,\nwhere L is a line on Y and (Y) → (_Y) is the projection. In particular, by <cit.> we have\n\n    ⟨λ_1,λ_2⟩≅_2\n\nand the Mukai vector v(_Y) → H^*(Y, ℚ) restricts to an isomorphism\n\n    ⟨λ_1,λ_2⟩^⊥≅ H^4_  (Y, ℤ).\n\nIn <cit.> Li, Pertusi and Zhao showed that there exists a Bridgeland stability condition σ for which the moduli space \n    X_Y:=M_σ(2(λ_1+λ_2),_Y)\n of semistable objects in _Y with fixed numerical invariant 2(λ_1+λ_2)∈(_Y) is a singular projective variety. Its singular locus consists of objects in ^2(M_σ(λ_1+λ_2,_Y)) which lie naturally inside the bigger moduli space. The Li-Pertusi-Zhao (LPZ) variety X̃_Y is constructed as a symplectic resolution of singularities of X_Y, obtained by blowing-up X_Y along its  singular locus. In particular, X_Y is a Hyperkähler manifold of OG10 type.\nCrucial property for us is that <cit.>\n\n    (_Y)⊇⟨λ_1+ λ_2⟩^⊥≅ H^2 (X_Y, ℤ)\n\n\nLet :=H^2(X_Y,ℤ)  and let σ∈^1,1 be the class of the exceptional divisor of the blow-up X_Y→ X_Y. By <cit.>, we know that σ^2=-6 and (σ,L)=3.\n\nIn the following we denote by 𝒞 the moduli space of smooth cubic fourfolds and by 𝒞_d the irreducible Hassett divisor consisting of special cubic fourfolds of discriminant d. These are cubic fourfolds which have a primitively embedded rank 2 lattice K⊂ H^2,2(Y, ℤ) containing the square of the hyperplane section, such that the Gram matrix of K has discriminant d. Recall that 𝒞_d is non-empty if and only if d>6 and d≡ 0,2  6 (see <cit.>).\nWe consider the following two properties for d:\n\n    [                                                                         (**):                                           d  divides 2n^2+2n+2  for some n∈ℤ;;                                                                        (**'): in the prime factorization of d2, primes p ≡ 2,3  appear with even exponents. ]\n\n\nBy <cit.>, condition (**) is equivalent to the existence of an associated K3 surface, in the sense that for if Y∈𝒞_d with d satisfying (**), then there exists a polarised K3 surface S with a Hodge isometry\n\n    H^2_ (S, ℤ) ≃ K^⊥⊂ H^4(Y,ℤ).\n\nSimilarly, the condition (**') is equivalent to the existence of an associated twisted K3 surface.\nAlso, both conditions can be rephrased in purely lattice theoretic terms (see, <cit.>) as follows.\nFor any primitive vector v∈⟨λ_1,λ_2⟩^⊥_≅_2^⊥_\nwe define\n\n    L_v(_2⊕ℤv)^sat\n\nto be the saturation of _2⊕ℤv inside (𝒜_Y).\nBy <cit.>, one has\n\n    d satisfies (**)⇔   ∃ v_d∈_2^⊥ such that L_d:=L_v_d has discriminant  d \n           and ↪ L_d  primitively,\n\n\n    d satisfies (**')⇔   ∃ v_d∈_2^⊥ such that L_d:=L_v_d has discriminant  d \n           and (n) ↪ L_d  for some n∈ℕ.\n\n\n\n\n\n\n\n\n\nLet X_Y be an LPZ-variety associated to a smooth cubic fourfold Y. The following conditions are equivalent.\n\n\n  * The cubic fourfold Y lies in the Hassett divisor 𝒞_d with d satisfying (**).\n\n  * The LPZ-variety X_Y is a numerical moduli space.\n\n\n\nWe start from showing (i)⇒ (ii). Given the resolution π:X_Y→ X_Y we denote by σ the class of the exceptional divisor. The pullback π^* embeds H^2(X_Y,ℤ) in H^2(X_Y,ℤ). In particular\n\n    π^*H^2(X_Y,ℤ)=σ^⊥.\n\nWe have a Hodge embedding\n\n    σ^⊥j(𝒜_Y)≅Λ_24\n\nsuch that \n\n    j(σ^⊥)=j(π^*H^2(X_Y,ℤ))=⟨λ_1+λ_2⟩^⊥_.\n\nMoreover we have a Hodge embedding j':H^4(Y,ℤ)_prim(-1)→(𝒜_Y),\nwhere the Hodge structure of H^4(Y,ℤ)_prim has a Tate twist decreasing weight by (-1,-1) and \n\n    j'(H^4(Y,ℤ)_prim)=⟨λ_1,λ_2⟩^⊥.\n\nBy hypothesis and (<ref>), there exists v_d∈ H^4(Y,ℤ)_prim of type (2,2) such that the saturation L_d of \n    ⟨λ_1,λ_2,j'(v_d)⟩⊂(𝒜_Y)≅_24\n\ncontains a copy of  primitively. Moreover, note that by construction L_d is contained in the (1,1)-part. \nThe claim now follows by observing that, since j and j' are compatible Hodge embeddings, the Hodge structure on _24 induced by σ^⊥j_24 is the same as the one induced by the isomorphism _24≅(𝒜_Y).\n\nWe now show (ii)⇒ (i). Let X_Y be the LPZ variety associated with the cubic fourfold Y. We have the following diagram:\n\n\n\n⟨λ_1,λ_2⟩^⊥_≅H^4(Y,ℤ)_(-1) [d, hook] [r, hook]     (𝒜_Y) \n\n⟨λ_1+λ_2⟩^⊥_≅H^2(X_Y,ℤ)≅σ^⊥_H^2(X_Y) [r, hook]                     H^2(X_Y,ℤ)\n\n\n\nwhere the horizontal isomorphisms are given by the Hodge embeddings j and j'.\nIn terms of abstract lattices the above diagram reads as: \n\n\n\n⟨λ_1,λ_2⟩^⊥__24≅^⊕2⊕_8(-1)^⊕2 ⊕_2(-1) [d, hook] [r, hook]     _24\n\n⟨λ_1+λ_2⟩^⊥__24≅^⊕3⊕_8(-1)^⊕2 ⊕[-2] [r, hook]                     ^⊕3 ⊕_8(-1)^⊕2 ⊕_2(-1) .\n\n\n\nBy assumption the lattice _24^1,1 contains a copy of  as a direct summand. Since the orthogonal complement of σ^⊥_H^2(X_Y)⊂_24 is generated by a positive class of (1,1) type, we have that\n\n\n    ((σ^⊥)^1,1)≥ 1,\n\nas σ^⊥ must contain a negative class of  inside _24^1,1.\nMoreover σ^⊥=⟨λ_1+λ_2⟩^⊥ contains the (1,1) class λ_1 - λ_2 which is of positive square, hence \n\n    ((σ^⊥)^1,1)≥ 2.\n\nWe deduce that ρ(X_Y) ≥ 2 and by the diagrams above \n    ρ(Y)_:= (H^2,2(Y,ℤ)_) ≥ 1,\n which means that the cubic fourfold Y belongs to a Hassett divisor 𝒞_d for some d ∈ℕ. \n\n\nWe now show that d satisfies the (**) condition, i.e. that there exists a primitive vector v_d∈ H^2,2(Y,ℤ)_ associated to d such that L_d:=⟨λ_1, λ_2, v_d ⟩^sat contains primitively a copy of . \n\nNote that since ( ⟨λ_1,λ_2 ⟩^⊥__24 )^1,1 is equal to  H^2,2(Y, ℤ)_(-1), which is negative definite, then the lattice ( ⟨λ_1,λ_2 ⟩^⊥__24 )^1,1∩ is generated by a negative class that we call v_d.\n\n\n\n\n\nWe now need to show that L_d contains a copy of  primitively. To do so, observe that the copy of  in _24^1,1 intersects the lattice _2 generated by λ_1 and λ_2.\nIn fact \n_24^1,1⊇⟨λ_1,λ_2⟩⊕ H^2,2(Y,ℤ)_≅_2⊕ H^2,2(Y,ℤ)_.\nSince H^2,2(Y,ℤ)_ is negative definite, it follows that ∩_2 has rank 1 and it is generated by a positive element. \nSince  is unimodular, the embedding ↪ L_d is primitive.\n\n\n\nNow, the result by F.Giovenzana, L.Giovenzana and Onorati <cit.> is a straightforward consequence of <ref> and <ref>.\n Keep the notation as above. The following conditions are equivalent.\n\n\n  * The cubic fourfold Y lies in the Hassett divisor 𝒞_d with d satisfying (**).\n\n  * There exists a K3 surface S, a non-primitive Mukai vector v=2w  and a v-generic polarization θ on S such that X_Y is birational to .\n\n\n\n\n\nLet X_Y be an LPZ-variety associated to a smooth cubic fourfold Y. The following conditions are equivalent.\n\n\n  * The cubic fourfold Y lies in the Hassett divisor 𝒞_d with d satisfying (**').\n\n  * The LPZ-variety X_Y is a twisted numerical moduli space.\n\n\n\nThe proof is identical to that in <ref> provided that one replaces  with (n).\n\n\nWe are now able to state a result analogous to <ref> in the twisted case, which was conjectured in <cit.> and proved with the additional assumption that the map between X_Y and  preserves the stratification of the singular locus <cit.>. \nOur criterion allows to circumvent this issue by looking just at the lattice theoretic setting.\n\n Keep the notation as above. The following conditions are equivalent.\n\n\n  * The cubic fourfold Y lies in the Hassett divisor 𝒞_d with d satisfying (**').\n\n  * There exists a twisted K3 surface (S,α), a non-primitive Mukai vector v=2w  and a v-generic polarization θ on S such that X_Y is birational to .\n\n\n\n\n\n§ NUMERICALLY INDUCED BIRATIONAL TRANSFORMATIONS\n\nBy <ref>, we know that if X is a numerical moduli space there exists a K3 surface S, together with a Mukai vector v and a polarization θ such that X is birational to . We now want to investigate which birational transformations of X come from automorphisms of the K3 surface S.\nTo do that, let us give two preliminary definitions. Then in <ref> we consider symplectic birational involutions and determine the induced ones. \n\n\nLet (X,η) be a marked pair of  type and let be G⊂Bir(X) be a finite subgroup of birational transformations of X. \nThe group G is called an induced group of birational transformations if there exists a K3 surface S with an injective group homomorphism i G↪Aut(S), a G-invariant Mukai vector v∈H(S,ℤ)^G and a v-generic polarization θ on S such that the action induced by G on  via i coincides with given action of G on X.\n\n\n\n\nLet X be a smooth irreducible holomorphic symplectic manifold of  type and let η H^2(X,ℤ)→ be a fixed marking. \nA finite group G⊂Bir(X) of birational transformations is called a numerically induced group of birational transformations if there exists a class\nσ∈NS(X) such that σ^2=-6 and (σ,)=3 such that:\n\n    \n  (i) σ is G-invariant;\n    \n  (ii) Given the Hodge embedding σ^⊥↪_24, the induced action of G on _24 is such that the (1,1) part of the invariant lattice (_24)^G contains  as a direct summand.\n\n\n\n Observe that if X admits a finite subgroup G⊆(X) which is numerically induced, then X is automatically a numerical moduli space.\n\n\nIn what follows we give all statements assuming G⊆Bir(X). If the statements hold true for G⊆(X), then G will be called an (numerically) induced group of automorphisms.\n\n\n\n\n\nIf φ∈(S) is an automorphism of the K3 surface S, v ∈H(S,ℤ)\nis a φ-invariant Mukai vector on S, and θ is a φ-invariant polarization on S, then φ\ninduces an automorphism on . Moreover the automorphism is numerically induced.\n\n\nFrom the definition of stability, if a sheaf ℱ is θ-stable then φ^*ℱ is θ-stable as we an see in <cit.>. For this reason we have a regular automorphism φ̂ of . Then the singular locus of  is preserved by φ̂ and so we get an automorphism φ̃ of φ̂ on the blow-up . We call σ the class of the exceptional divisor which is fixed by the induced action. Moreover,\ndue to the primitive embedding \nσ^⊥ = H^2(, ℤ) ↪H(S,ℤ) ≅_24\nthe induced action of φ on σ^⊥ induces an action on H(S,ℤ) ≅_24 which is the same action induced by φ on H(S,ℤ). Moreover the sublattice H^0\n(S,ℤ) ⊕ H^4\n(S,ℤ)≅ is preserved by the action of φ̃ and it is contained in the (1, 1) part\nof the lattice _24. \n\n\n\nIn the assumption of <ref>, we ask that the polarization θ∈(S) is φ-invariant, so that the automorphism of the K3 surface induces an automorphism of . Note that this condition is never verified for a nontrivial symplectic automorphism of S according to the result of <cit.>. On the other hand the case of induced nonsymplectic involutions will be the subject of an upcoming paper <cit.>.\nIf θ is not φ-invariant we show in <ref> that we get at least a birational self map of . \n\n\nBefore giving the next proposition, recall that so far we have considered moduli spaces of sheaves on K3 surfaces, referring to Gieseker moduli spaces. In particular we consider a generalization, namely moduli spaces of Bridgeland semistable objects. In particular we recall some results about the birational geometry of these moduli spaces. Fix S a projective K3 surface, Bridgeland constructed stability conditions on D^b(S) and these form a complex manifold denoted by (S).  The latter has a wall and chamber decomposition, for which any moduli space of Bridgeland semistable objects with a fixed Mukai vector v=2v_0 of O'Grady type is a singular projective symplectic variety which admits a symplectic resolution of singularities, which is an irreducible holomorphic symplectic manifold of  type. For any such moduli space the natural stratification of the singular locus is given by\n\n    M_v_0⊂^2 M_v_0⊂ M_v.\n\nWe recall the following result.\n\nIn the setting above we have:\n\n    \n  * For any stability condition τ from a distinct chamber of (S) any τ semistable object is Gieseker semistable. We call this the Gieseker chamber. \n    \n  * Let τ, τ'∈(S) be generic and v∈H(S,ℤ) be a Mukai vector of O'Grady type, then there exists a birational map ψ M_v(S,τ) M_v(S,τ'), which is stratum preserving in the sense that ψ is defined on the generic point of each stratum of the singular locus of M_v(S,τ) and maps it to the generic point of the M_v(S,τ').\n\n\n\n\nIf φ∈(S) is an automorphism of the K3 surface S, v ∈H(S,ℤ)\nis a φ-invariant Mukai vector on S, and θ is a polarization on S, then φ\ninduces a birational transformation on . Moreover the birational transformation is numerically induced.\n\n\nLet τ be a Bridgeland stability condition in the Gieseker chamber. If a sheaf ℱ is θ-stable, then it is τ-stable and φ^*ℱ is φ^*(τ)-stable. For this reason we have an isomorphism  φ̂ M_v(S,τ) M_v(S,φ^*(τ)) which maps the singular locus isomorphically to the singular locus. Composing φ̂ with the birational stratum preserving transformation M_v (S,φ^*(τ)) M_v(S,τ) provided by <ref>, we get a birational self-transformation φ of M_v(S,τ). As φ preserves the singular locus, it lifts to a birational self-transformation of the smooth irreducible holomorphic symplectic manifold M_v(S,τ)=, that we call again φ̃, which preserves the exceptional divisor, whose class we call σ. Moreover we have the primitive embedding \nσ^⊥ = H^2(, ℤ) ↪H(S,ℤ) ≅_24 and\nthe induced action of φ on σ^⊥ induces an action on H(S,ℤ) ≅_24 which is the same action induced by φ on H(S,ℤ). Moreover the sublattice H^0\n(S,ℤ) ⊕ H^4\n(S,ℤ)≅ is preserved by the action of φ̃ and it is contained in the (1, 1) part\nof the lattice _24. \n\n\n\n\nLet (X,η) be a smooth marked pair of  type and let G⊂Bir(X) be a finite subgroup. If G is a numerically induced group of birational transformations, then there exists a K3 surface S with an injective group homomorphism G↪Aut(S), a G-invariant Mukai vector v and a v-generic polarization θ on S such that X is birational to  and G⊂Bir(X) is an induced group of birational transformations. \n\n\n\nWe first consider the case when G is symplectic. Then the transcendental lattice 𝐓(X) is contained inside ^G. Since G is numerically induced, there exists a class σ∈NS(X) with σ^2=-6 and (σ,)=3 which is G invariant. \nWe consider the Hodge embedding σ^⊥_↪_24 and we call w the generator of the orthogonal complement of the image of σ^⊥_ inside _24.\nWe can extend the action of G on _24 in a way such that the action on the orthogonal complement of σ^⊥_ in _24 is trivial.\nNote that, by construction, w is of (1,1) type and it is fixed by the induced action of G on _24. Moreover by assumption we have that \n\n    (_24)^G=⊕T\n\nwith  contained in the (1,1) part of the Hodge structure of (_24)^G.\nSince σ is G-invariant then _G=(σ^⊥_)=(_24)_G, then _G↪_24 and _G^⊥__24= _24^G=⊕𝐓.\nThe embedding _G↪_24 respects the action of G, i.e. _G=(_24)_G and (_24)^G=(_G)^⊥__24=⊕𝐓, then we have that the embedding _G ↪_24 can be decomposed in _G φ^⊕3⊕_8(-1)^⊕ 2↪_24, where φ is a compatible Hodge embedding and by construction _G^⊥_^⊕3⊕_8(-1)^⊕2 =𝐓. Since _G is of (1,1)-type then φ(_G) ⊆ (^⊕3⊕_8(-1)^⊕2)^1,1. The lattice ^⊕3⊕_8(-1)^⊕2 has an Hodge structure hence, by Torelli for K3 surfaces, there exists a K3 surface S such that H^2(S,ℤ) is Hodge isometric to ^⊕3⊕_8(-1)^⊕ 2.\nMoreover the action induced by G on H^2(S,ℤ) is a Hodge isometry since by construction H^2(S,ℤ)_G=_G and H^2(S,ℤ)^G=𝐓. Furthermore the induced action of G on H^2(S,ℤ) is a monodromy operator due to the maximality of the monodromy group of a K3 surface in the group of isometries, and the coinvariant lattice H^2(S, ℤ)_G does not contain wall divisors for the K3 surface, i.e. vectors of square -2. In fact the coinvariant lattice H^2(S,ℤ)_G is isometric to the coinvariant lattice _G with respect to the induced action of G⊂(X) on the second integral cohomology lattice of the manifold of  type, hence it does not contain prime exceptional divisors, hence by the characterization of prime exceptional divisors for manifolds of  type it contains any vectors of square -2. We apply <cit.> and we conclude that G ⊆(S). Since w was invariant by construction, by <ref> we have that X is birational to  where v=2w is a Mukai vector on S and v^2=(2w)^2=8. Moreover the induced action of G ⊆(S) on H^2(, ℤ) coincide by construction with the given action of G on H^2(X,ℤ)=  which is the action we started with. We deduce that G⊂(X) is an induced group of birational transformations.\n\n\nNow, since σ and w are G-invariant then the bL _G=(^G)^⊥ is isomorphic and Hodge isometric to \n\n    _G≅ (σ^⊥_)_G≅ (Λ_24)_G.\n\nNow, given Λ_24 with the Hodge structure induced by σ^⊥, by Torelli theorem there exists a K3 surface S such that H̃(S,ℤ) is Hodge isometric to Λ_24. \nSince the bL _G embeds in Λ_24 by (<ref>), it also embeds in H̃(S,ℤ). \nAs a result we can write \n\n    H̃(S,ℤ)   ≅Λ_24⊃(Λ_24)_G⊕ (Λ_24)^G = _G⊕⊕T\n    H̃(S,ℤ)   ≅ H^2(S,ℤ)⊕,\n\nwith both copies of  in the (1,1) part. Comparing the two equations, we can define a Hodge embedding _G↪ H^2(S,ℤ) by sending  in the first equation in the copy of  in the second one, _G to (Λ_24)_G as in (<ref>) and T in its image under the finite index embedding of (Λ_24)_G⊕ (Λ_24)^G inside Λ_24. Since all the maps involved are Hodge isometries, we have that (_G)^⊥_H^2 is Hodge isometric to T.\n\nConsider as before w  = (σ^⊥_)^⊥_Λ_24=[2] and take v=2w ∈H̃(S,ℤ)≅Λ_24 as  Mukai vector on S. By construction, X is a numerical moduli space and by <ref> it is birational to the moduli space . Moreover, the vector v is fixed by the induced action of G on Λ_24.\n\n\nNow, observe that element of G induces an isometry of Hodge structures on H^2(X,ℤ) and hence on \n    v^⊥≅ U^⊕3⊕ E_8(-1)^⊕2⊕ [-2]⊃ H^2(S,ℤ).\n\n\nWe are now left with proving that G is an induced group of birational transformation, i.e. that we have an embedding i:G↪ Aut(S) such that the induced action of G on H^2(S,ℤ) via i coincides with the given action of G on H^2(X,ℤ).\n\nLet g∈ G and let f_g be the induced isometry on H^2(S,ℤ). Up to changing signs, we have that f_g∈ O^+(H^2(S,ℤ),q)=Mon^2(S): if f_g preservers a Kähler class then by add reference: there exists a unique element h_g∈ Aut(S) such that h_g^*=f_g.[Maybe it is worth adding the definition of h_g^* in the introduction or in a preliminary section.]\nNow, if G acts in a symplectic way, we have that f_g preserves a Kähler class if and only if the coinvariant bL H^2(S,ℤ)_f_g does not contain any wall divisors for S (i.e. elements in NS(X) of square -2).\nBy addref, when X is of OG_10 type, we have that the square -2 vectors are contained in the set of prime exceptional divisor.\nSince G⊂ Bir(X), by add ref, we have that _G⊃ H^2(S,ℤ)_f_g does not contain any prime exceptional divisor. \nAs a result f_g preserves a Kähler class and so we have the desired embedding i:G↪ Aut(S).\n\n\nNow the group G⊂ Aut(S) is a group of automorphisms of S and since by construction the Mukai vector v is preserved, then by (versione analoga della prop 3.5 e della remark 3.6 del mio paper per OG10) we have an induced group of birational transformations on . The induced action on the second integral cohomology of  is the action we started with.\n\n\nNow we assume that every non-trivial element of G has a non-symplectic action and without loss of generality we can assume that ^G=(X). As before we have that (_24)^G= ⊕T and we can consider the K3 surface associated to the Hodge structure induced on ^⊥⊂_24.\nAgain by <ref> X is birational to a moduli space of sheaves on S. The group G is a group of Hodge isometries of S preserving T=(S): in particular it preserves all Kähler classes and we can conclude as in the symplectic case.\n\n\nSuppose now that G is any numerically induced group of birational transformations and let G_s be its symplectic part. Considering the action of G_s we obtain a K3 surface S as in the first step with G_s⊂(S).  We can extend this action to an action of G by applying the second step to the quotient group Ĝ G/G_s.\n\n\n\n\n\n\n\n\n\n\n §.§ Induced involutions\n\nIn this section we give an application of the criterion about induced automorphisms given in  <ref>. The lattice-theoretic criterion that we prove allows to determine if a birational transformation of a manifold of  type which is at least\nbirational to , is induced by an automorphism of the K3 surface S. More precisely, by <cit.> we know that there are no regular symplectic involutions on a manifold of  type, while by <cit.> we have a lattice-theoretic classification of birational symplectic involutions.\nWe consider the classification of symplectic birational involutions on manifolds of  type given in <cit.>, where the authors take a manifold of  type,\na fixed marking η H^2(X,ℤ) → of X, and classify invariant and coinvariant\nsublattices, denoted by H^2(X,ℤ)_+ ≅^G and H^2(X,ℤ)_- ≅_G respectively. More precisely, they classify the images of symplectic birational involutions with respect to the representation\nmap\n\n    η_*(X)    → O()\n    \n    f    ↦η∘ f^*∘η^-1.\n\nWe prove that there exists a unique induced birational symplectic involution on a manifold of  type and we give the following characterization in terms of its lattice-theoretic behaviour. \n\n\nIf the action is induced then the action on the discriminant group is trivial. Indeed it is enough to note that a generator of the discriminant group A_ is the class [σ/3] where σ is the class of the exceptional divisor.\n\n\nLet (X, η) be a marked pair of  type. Assume that X is a numerical moduli space and let φ∈(X) be a birational symplectic involution. Then φ is induced if and only if\n\n    H^2(X,ℤ)^φ≅^⊕3⊕_8(-2) ⊕_2(-1)   and H^2(X,ℤ)_φ≅_8(-2).\n\n\n\nIf φ is an induced symplectic birational transformation, then by <ref> we have that φ is numerically induced. In <cit.> we have a classification of symplectic birational involutions on manifolds of  type. As the action of an induced automorphism on the discriminant is trivial, we deduce that the H^2(X,ℤ)^φ is either ^⊕3⊕_8(-2) ⊕_2(-1) or _6(-2)⊕(2)^⊕2⊕[2]⊕ [-2]. We can exclude the latter thanks to our criterion, let us explain how. Indeed, if the action is induced, then it is numerically induced, in particular there exists a primitive invariant class σ of square -6 and divisibility 3, but this is a contradiction as any element in _6(-2)⊕(2)^⊕2⊕[2]⊕ [-2] has even divisibility.\n\nFor the converse, let φ be a birational symplectic involution with \n    H^2(X,ℤ)^φ= ^⊕3⊕_8(-2) ⊕_2(-1) and  H^2(X,ℤ)_φ≅_8(-2).\n\nWe first prove that φ is numerically induced.\nSince X is a numerical moduli space then there exists a class σ∈(X) with σ^2=-6 and (σ,)=3 such that, given the Hodge embedding σ^⊥↪_24, then _24^1,1 contains  as a direct summand. Observe that such copy of  must be contained in H^2(X,ℤ)^φ as there is no way to realize  as a sublattice of _8(-2).\nMoreover, since H^2(X,ℤ)_φ≅_8(-2) does not contain any divisibility 3 class, then σ must lie in H^2(X,ℤ)^φ i.e. it is invariant and φ is thus numerically induced.\nThe result now follows from <ref>.\n\n\n\nThe general projective manifold of  type with an induced birational symplectic involution has the following integral Hodge structure:\n\n    H^2(X,ℤ)_φ⊆(X) ≅_8(-2) ⊕ [-6] ⊕\n    (X) ≅_8(-2) ⊕^⊕2⊕ [-2] ⊆ H^2(X,ℤ)^φ.\n\nThe birational symplectic involution is induced by a Nikulin involution on a K3 surface S such that (S) ≅_8(-2) ⊕ℤ L where L^2=2.\n\nSince the involution is symplectic, the Néron–Severi contains the coinvariant lattice. Moreover, by <ref> the involution is numerically induced, so that the Néron–Severi must contain an invariant class σ of square -6 and divisibility 3. By <ref> the invariant (1,1) part of the induced action of φ on _24, with respect to the Hodge embedding σ^⊥↪_24, contains a copy of  as a direct summand. Then this copy of  must be contained in σ^⊥ thus we get (X)=_8(-2) ⊕ [-6] ⊕.\n\nReferring to the construction of <ref> X is birational to a moduli space on a K3 surface S and we have the following Hodge isometry H(S,ℤ)≅_24. The Néron–Severi of S is isometric to the (1,1) part of the orthogonal complement of H^0(S,ℤ)⊕ H^4(S,ℤ)≅ in _24. The claim follows because we have the finite index embedding σ^⊥⊕ [2] ⊂_24, where 2 is of type (1,1) and (σ^⊥)^1,1≅_8(-2) ⊕. It is known that K3 surfaces with this Néron–Severi lattice and such an action have a Nikulin involution and they are described in <cit.>.\n\n\namsplain\n\n"}