{"entry_id": "http://arxiv.org/abs/2303.07013v1", "published": "20230313112047", "title": "Initial Result of Heliocentric Distance Dependence of Zodiacal Light Observed by Hayabusa2#", "authors": ["Kohji Tsumura", "Shuji Matsuura", "Kei Sano", "Takahiro Iwata", "Kohji Takimoto", "Manabu Yamada", "Tomokatsu Morota", "Toru Kouyama", "Masahiko Hayakawa", "Yasuhiro Yokota", "Eri Tatsumi", "Moe Matsuoka", "Naoya Sakatani", "Rie Honda", "Shingo Kameda", "Hidehiko Suzuki", "Yuichiro Cho", "Kazuo Yoshioka", "Kazunori Ogawa", "Kei Shirai", "Hirotaka Sawada", "Seiji Sugita"], "primary_category": "astro-ph.EP", "categories": ["astro-ph.EP"], "text": "\n\n\n\n\n\nFull Paper\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  addressref=aff1,                   \n  corref=aff1,                       \n\n  email=ktsumura@tcu.ac.jp   \n]K.Ts.Kohji Tsumura\n\n\n  addressref=aff2,\n  email=matsuura.shuji@kwansei.ac.jp\n]S.M.Shuji Matsuura\n\n\n  addressref=aff3,\n  email=sano.kei288@mail.kyutech.jp\n]K.Sa.Kei Sano\n\n\n  addressref=aff4,\n  email=iwata.takahiro@jaxa.jp\n]T.I.Takahiro Iwata\n\n\n  addressref=aff3,\n  email=takimoto.koji670@mail.kyutech.jp\n]K.Ta.Kohji Takimoto\n\n\n  addressref=aff5,\n  email=manabu@perc.it-chiba.ac.jp\n]M.Y.Manabu Yamada\n\n\n  addressref=aff6,\n  email=morota@eps.s.u-tokyo.ac.jp\n]T.M.Tomokatsu Morota\n\n\n  addressref=aff7,\n  email=t.kouyama@aist.go.jp\n]T.K.Toru Kouyama\n\n\n  addressref=aff4,\n  email=hayakawa@planeta.sci.isas.jaxa.jp\n]M.H.Masahiko Hayakawa\n\n\n  addressref=aff4,\n  email=yokota@planeta.sci.isas.jaxa.jp\n]Y.Y.Yasuhiro Yokota\n\n\n  addressref=aff8,\n  email=etatsumi-ext@iac.es\n]E.T.Eri Tatsumi\n\n\n  addressref=aff9,\n  email=moe.matsuoka@aist.go.jp\n]M.M.Moe Matsuoka\n\n\n  addressref=aff4,\n  email=sakatani.naoya@jaxa.jp\n]N.S.Naoya Sakatani\n\n\n  addressref=aff10,\n  email=honda.rie.ha@ehime-u.ac.jp\n]R.H.Rie Honda\n\n\n  addressref=aff11,\n  email=kameda@rikkyo.ac.jp\n]S.K.Shingo Kameda\n\n\n  addressref=aff12,\n  email=suzuhide@meiji.ac.jp\n]H.Su.Hidehiko Suzuki\n\n\n  addressref=aff6,\n  email=cho@eps.s.u-tokyo.ac.jp\n]Y.C.Yuichiro Cho\n\n\n  addressref=aff13,\n  email=kazuo.yoshioka@edu.k.u-tokyo.ac.jp\n]K.Y.Kazuo Yoshioka\n\n\n  addressref=aff14,\n  email=ogawa.kazunori@jaxa.jp\n]K.O.Kazunori Ogawa\n\n\n  addressref=aff15,\n  email=kei.shirai@penguin.kobe-u.ac.jp\n]K.Sh.Kei Shirai\n\n\n  addressref=aff4,\n  email=sawada.hirotaka@jaxa.jp\n]H.Sa.Hirotaka Sawada\n\n\n  addressref=aff6,\n  email=sugita@eps.s.u-tokyo.ac.jp\n]S.S.Seiji Sugita\n\n\n\n\n\n\n\n\n\n[id=aff1]\n  Department of Natural Sciences, Faculty of Science and Engineering,             \n  Tokyo City University,          \n  158-8557\n  Tokyo,                              \n  Japan                                    \n\n\n[id=aff2]\n  Department of Physics, School of Science and Technology,\n  Kwansei Gakuin University,\n  669-1337\n  Hyogo,\n  Japan\n\n\n[id=aff3]\n  Department of Space Systems Engineering, School of Engineering,\n  Kyushu Institute of Technology,\n  804-8550\n  Fukuoka,\n  Japan\n\n\n[id=aff4]\n  Institute of Space and Astronautical Science,\n  Japan Aerospace Exploration Agency,\n  252-5210\n  Kanagawa,\n  Japan\n\n\n[id=aff5]\n  Planetary Exploration Research Center,\n  Chiba Institute of Technology,\n  275-0016\n  Chiba,\n  Japan\n\n\n[id=aff6]\n  Department of Earth and Planetary Science,\n  University of Tokyo,\n  113-0033\n  Tokyo,\n  Japan\n\n\n[id=aff7]\n  Digital Architecture Research Center,\n  National Institute of Advanced Industrial Science and Technology,\n  135-0064\n  Tokyo,\n  Japan\n\n\n[id=aff8]\n  nstituto de Astrofisica de Canarias,\n  University of La Laguna,\n  Tenerife,\n  Spain\n\n\n[id=aff9]\n  Geological Survey of Japan,\n  National Institute of Advanced Industrial Science and Technology,\n  305-8567\n  Ibaraki,\n  Japan\n\n\n[id=aff10]\n  Center for Data Science,\n  Ehime University,\n  790-8577\n  Ehime,\n  Japan\n\n\n[id=aff11]\n  Rikkyo University,\n  171-8501\n  Tokyo,\n  Japan\n\n\n[id=aff12]\n  Meiji University,\n  214-8571\n  Kanagawa,\n  Japan\n\n\n[id=aff13]\n  Department of Complexity Science and Engineering,\n  University of Tokyo,\n  277-8561\n  Chiba,\n  Japan\n\n\n[id=aff14]\n  JAXA Space Exploration Center,\n  Japan Aerospace Exploration Agency,\n  252-5210\n  Kanagawa,\n  Japan\n\n\n[id=aff15]\n  Kobe University,\n  657-8501\n  Hyogo,\n  Japan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nThe zodiacal light (ZL) is sunlight scattered by interplanetary dust (IPD) in the optical wavelengths.\nThe spatial distribution of IPD in the Solar system may hold an important key \nto understanding the evolution of the Solar system and material transportation within it.\nThe IPD number density can be expressed as n(r) ∼ r^-α,\nand the result of α∼ 1.3 was obtained by the previous observations from the interplanetary space by Helios 1/2 and Pioneer 10/11 in the 1970s and 1980s.\nHowever, no direct measurements of α based on the ZL observation from the interplanetary space outside the Earth's orbit have been conducted since then.\nHere we introduce the initial result of the ZL radial profile at optical wavelengths observed at 0.76-1.06 au by ONC-T with Hayabusa2# mission in 2021-2022.\nThe obtained ZL brightness is well reproduced by the model brightness, but there is a small excess of the observed ZL brightness over the model brightness at around 0.9 au.\nThe obtained radial power-law index is α = 1.30 ± 0.08, which is consistent with the previous results based on the ZL observations.\nThe dominant uncertainty source in α arises from the uncertainty in the Diffuse Galactic Light estimation.\n\n\n\n\n\n\n\n\n\n\n\nzodiacal light\ninterplanetary dust\nHayabusa2#\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGraphical Abstract\n\n\n\n    < g r a p h i c s >\n \n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nThe zodiacal light (ZL) is sunlight scattered by interplanetary dust (IPD) at optical wavelengths and is a major constituent of celestial diffuse brightness.\nContinuous supply of IPD is necessary for sustaining the diffuse brightness because IPD is removed from the Solar System due to the Poynting-Robertson (PR) effect and the radiation pressure from the Sun <cit.>.\nPossible sources for this supply are asteroid collisions <cit.>, cometary ejections <cit.>, \nand Mars <cit.>, but the relative ratios of the contributions from these sources are still unknown.\nThus, observational constraints that can tell the difference among these sources are important for better understanding the origin and characteristics of IPD and how planetary and exoplanetary systems evolve with time <cit.>.\n\nHistorically, extensive ZL observations were conducted from ground-based telescopes at high-altitude sites in the 1960s and 1970s <cit.>,\nbut the accuracy of these ZL observations is limited due to atmospheric emission.\nSpace-based platforms eliminate atmospheric contaminations and provide precise ZL measurements\n<cit.>.\nZL is the only sky brightness component that is not fixed on the celestial sphere.\nIn general, ZL is smoothly distributed and its small-scale spatial structures are only at the level of a few percent owing to the smooth spatial distribution of IPD as a smooth cloud <cit.>.\nThe symmetry plane of the smooth cloud is slightly inclined to the ecliptic plane because of the Jovian orbit.\nSeasonal variations of ZL occur for an Earth-based observer due to the orbital motion of the Earth,\nwhich changes the heliocentric distance and the position of the observer with respect to the symmetry plane.\nA detailed IPD distribution model was established based on the seasonal variation of ZL <cit.>.\n\nThe number density (n) of IPD is presumed to be of a form separable into radial and vertical terms;\n\n    n(r, β) = n_0(r/r_0)^-α f(β)\n\nwhere n_0 is the reference of IPD number density in the symmetric plane at the heliocentric distance r_0, \nand f(β) denotes the vertical distribution as a function of an elevation angle  β from the symmetry plane <cit.>.\nThe assumption that the vertical distribution of IPD depending only on β is induced by the fact that the PR effect does not affect the orbital inclination of particles as they spiral into the Sun.\nThe radial power-law is induced by the radial distribution expected for particles under the influence of the PR effect, which results in α =1 for dust bound in a circular orbit <cit.>.\nWhen dust size is reduced by the sublimation near the Sun,\nsuch smaller dust particles are expelled from the Solar system by radiation pressures as β-meteoroids <cit.>. \nThe radial profile of β-meteoroids is expected as α =2 <cit.>.\nThe relative ratio of these two components remains an open issue and may hold an important key for understanding the evolution of the IPD distribution <cit.>.\n\nThe ZL brightness I_ZL is modeled as the integral of scattered sunlight along the line of sight;\n\n    I_ZL = ∫ F_⊙(r)  n(r) A Φ(θ) dl\n\nwhere F_⊙(r) ∼ r^-2 is the Solar flux at the distance r from the Sun, A is the albedo of the IPD, Φ(θ) is the phase function at scattering angle θ,\nand dl indicates the direction of the line of sight.\nIf the scattering properties (size and albedo) of IPD do not change significantly with heliocentric distance,\nthe heliocentric dependence of ZL on the symmetry plane can be described as I_ZL∼ r^-(α +1).\n\nDirect observations of the radial power-law index α based on ZL observations were conducted by spacecraft outside Earth's orbit in the 1970s and 1980s.\nPioneer 10/11 observations of ZL at 1-3.3 au gave α =1-1.5.\nMore specifically, a single power-law model with α∼ 1 with a cutoff near 3.3 au gives the best fit to the observation data,\nand a 2-component model with α∼ 1.5 and increased IPD in the asteroid belt can satisfactorily fit the data equally well <cit.>.\nHelios 1/2 observations of ZL at 0.3-1 au gave α =1.3 ± 0.05 at 0.3-1 au;\nα = 1.35 gives a better fit for small Solar elongations (<50 ^∘), and α = 1.25 is more appropriate for large Solar elongations (>100 ^∘) <cit.>.\nAfter these missions, ZL observations outside Earth's orbit by spacecraft have not been conducted, \nalthough the Japanese Venus orbiter Akatsuki tried to observe ZL, but it could not detect ZL due to insufficient cooling of the sensor <cit.>.\n\nSome IPD distribution models were developed based on the observations of the all-sky ZL brightness and its seasonal variation from the geocentric orbit.\nIn particular, α = 1.34 ± 0.022 <cit.> and α = 1.22 <cit.> were obtained based on the observations by Cosmic Background Explorer (COBE),\nand α = 1.59 ± 0.02 was obtained based on the observations by AKARI <cit.>.\nThese observations of ZL are conducted from 1 au, so the accuracy of determining α is worse than direct observations from interplanetary space.\n\nThe value of α has also been determined based on the observations of inner ZL or F-corona.\nBased on the observations of inner ZL by Clementine from the lunar orbit while the Sun was in eclipse behind the Moon, α = 1.45 ± 0.05 was obtained <cit.>.\nA value of α from 1.31 to 1.35 was obtained based on F-corona at elongations ranging from 0.07 to 0.45 au from the Sun \nobserved by Solar TErrestrial RElations Observatory-A (STEREO-A) orbiting the Sun at approximately 1 au <cit.>.\nIn addition, α = 1.31 was obtained by F-corona ranging from 0.1 to 0.4 au observed by Parker Solar Probe (PSP) when it passes perihelion at 0.16-0.25 au <cit.>.\nThese results are limited to dust distributions close to the Sun.\n\nThis paper introduces the IPD distribution based on the ZL observation at 0.76-1.06 au by Hayabusa2# mission performed in 2021-2022.\nThis is the first successful observation of ZL from outside the Earth's orbit in the last 40 years.\n\n\n\n\n\n§ DATA ACQUISITION AND REDUCTION\n\n\n\n §.§ Hayabusa2# overview\n\nHayabusa2 is the second Japanese asteroid sample-return mission.\nThe Hayabusa2 spacecraft was launched in December 2014 and successfully arrived at asteroid (162173) Ryugu in June 2018.\nAfter extensive scientific observations for ∼1.5 years, it departed from Ryugu in November 2019\nand successfully brought the capsule containing Ryugu samples back to the Earth in December 2020 <cit.>. \nWith the successful main mission of the sample return, \nan extended mission named as Hayabusa2# (SHARP; Small Hazardous Asteroid Reconnaissance Probe) started to explore new asteroids;\na fly-by of (98943) 2001 CC21 in July 2026 and a rendezvous with 1998 KY26 in July 2031 <cit.>.\nSome scientific observations including ZL observation are conducted during this long cruising phase <cit.>.\n\nThe Optical Navigation Camera (ONC) onboard Hayabusa2 consists of one telescopic camera (ONC-T) and two wide-angle view cameras (ONC-W1/W2) <cit.>,\nand it was used for both global and local high-resolution optical observations of Ryugu <cit.>.\nONC has been carefully calibrated before and after the launch, and it is in a good condition after the contact with the Ryugu surface during the two touchdowns for sampling.\nONC-T is used for ZL observations in this study.\nThe field-of-view of ONC-T is 6.27 × 6.27 deg^2 covered with a 1024 × 1024 pixels region of a CCD detecter <cit.>.\nThe longest exposure time of ONC-T is 178 sec which is used for the ZL observation in this study.\nONC-T has a wheel system that rotates seven color bandpass filters and one wide clear filter (a panchromatic glass window).\nWe used the wide-band filter (λ = 612 nm and Δλ = 448 nm, see Figure <ref>) for ZL observation \nwith v-band filter (λ = 550 nm and Δλ = 28 nm) for stray light subtraction (see Section <ref>).\n\n\n\n\n\n\n\n\n\n\n\n §.§ Observation Fields\n\nHayabusa2 spacecraft flies in an elliptical orbit over a range of 0.76-1.06 au before the Earth swing-by on December 2027 as shown in Figure <ref> and <ref> <cit.>.\nThe spacecraft holds an attitude in which the Solar array paddle (+Z direction) points toward the Sun during this period,\nand ZL observations are conducted during periods when the ion engines are not in operation.\nSince ONC-T points toward -Z direction, ZL is observed toward the antisolar direction.\nThis is an advantage of our ZL observations over past observations because previous ZL observations in the interplanetary space were made at various Solar elongation angles, \nmaking it difficult to distinguish whether ZL changes were due to the changes of heliocentric distance or Solar elongation.\nIn our ZL observations, the change in ZL brightness due to Solar elongation is minimized by observing ZL with nearly constant Solar elongation (see Table <ref>).\n\nStray light occurs when sunlight hits the radiator to cool the detector of ONC-T from a certain range of directions <cit.>.\nThus, ZL observation needs to be conducted in a “stray light avoidance attitude”, in which -X side and +Y side of the spacecraft are illuminated by the Sun.\nFor this reason, the actual directions of ZL observations are shifted from the antisolar direction by ∼10 degrees.\nTable <ref> summarize the observed fields and the position of the spacecraft when the observations were conducted.\n\n\nWhen observable direction (antisolar direction) is pointed toward the Galactic plane or Galactic center, \nthis period is not suitable for ZL observations because the Galactic brightness is too strong for ZL observation (see Section <ref> and <ref>).\nThus, unsuitable ZL observation periods were set when the antisolar direction is pointing toward (1) Galactic latitude < 20^∘ (blue in Figures <ref> and <ref>)\nor (2) Galactic longitude < 20^∘ (green in Figures <ref> and <ref>).\nZL observations were made approximately once a month during the time suitable for ZL observations (red in Figures <ref> and <ref>).\n\n\n\n\n\n §.§ Acquired Images\n \nThe ONC-T detector has a 1024 × 1024 pixels imaging region, and two 16 × 1024 pixels masked regions called “optical black” on both sides as dark references <cit.>. \nThe two optical black images are combined and treated as one 32 × 1024 pixels optical black image.\nRaw images acquired by ONC-T are processed in a sequence of steps to calibrate the image data. \nIn this work, we used L2a level images, which are raw FITS images with header information containing the spacecraft system housekeeping data and ONC status data \n(the temperatures of the detector, lens system, and electronics, as well as the voltages of the electronics, etc.) <cit.>.\nThe signal of each pixel is shown in the unit of 16-bit digital numbers (DN).\n\nOne data set of the ZL observation includes one bias image (B), three wide-band images (W_i, i=1-3), two v-band images (V_j, j=1-2), \nand their respective optical black images (Bb, Wb_i, and Vb_j) as shown in Figure <ref>.\nFor the ZL observations on 2021-11-29, 2021-12-06, 2021-12-28, 2022-01-24, and 2022-02-14, two data sets were acquired for monitoring stability of ONC-T sensitivity after ONC-T turned-on as a part of calibration operations.\n\n\n\n\n\n §.§ Dark Current Subtraction\n  \nDark current subtraction is essential for the measurements of diffuse radiations, such as ZL.\nIn our data set, the dark current for each image is estimated from the dark image, which is made by the optical black image minus a bias image (Wb_i-Bb and Vb_j-Bb).\nThen, a histogram of the dark image is created, and its peak position is taken as the dark current value of that image.\nThe histogram of the dark image is fitted by a Gaussian function.\nBy finding the peak position of the histogram, we found the mode of the dark image.\nBy this Gaussian fitting procedure, bad pixels, such as leakage of light from the imaging region into the masked region or hot pixels caused by cosmic-ray hitting, are eliminated.\nThe obtained dark current values of wide-band and v-band images are expressed as Dark(Wb_i-Bb) and Dark(Vb_j-Bb), respectively.\nAs an example of the first bias-subtracted optical black image Wb_1-Bb taken on 2022-08-29, \nthe dark current of this image was derived as Dark(Wb_1-Bb) = 5.92 DN from the peak position of the histogram of the optical black image Wb_1-Bb, as shown in Figure <ref>.\n\nNext, the obtained dark current and the bias image are subtracted from the sky image, \nyielding three wide-band subtracted images and two v-band subtracted images in one data set.\nFor the wide-band images, a single redacted image (W) was generated from three subtracted images by taking the median of each pixel:\n\n    W = median[W_i - (B + Dark(Wb_i -Bb))].\n\nThis median procedure removes many hot pixels caused by cosmic-ray hitting.\nSince there are only two v-band images, the median procedure cannot be taken.\nA single redacted image (V) was generated by taking the minimum of each pixel to reduce hot pixels by cosmic-ray hitting:\n\n    V = min[V_i - (B + Dark(Vb_i -Bb))].\n\n\n\n\n\n §.§ Stray Light subtraction\n \nSince stray light occurs in ONC-T images when the spacecraft is in a certain attitude <cit.>, \nall ZL observations were conducted in a stray light avoidance attitude.\nHowever, weak stray light still remains even when a stray light avoidance attitude is taken.\nFigures <ref>a and <ref>b are the redacted images of wide-band (W) and v-band (V) on 2021-08-23, respectively, \nshowing that the stray light patterns can be seen clearly in these images.\nIt is known that the intensity and pattern of the stray light are irrespective of filter selection <cit.>.\nThus, the v-band image (V) is subtracted as a reference frame of the stray light from the wide-band image (W) to remove the remaining stray light as shown in Figures <ref>c and <ref>d.\nSince the signal of ZL in v-band image is estimated to be less than 1 DN, there is little impact on the scientific analysis of ZL due to this stray light removal procedure.\n\nAn additional stray light pattern was found in the data obtained on 2022-01-24 and 2022-02-14 as shown in Figure <ref>.\nBecause this stray light appears only in the wide-band image, it cannot be removed by the v-band subtraction procedure.\nThe source of this additional stray light is considered to be light scattered at the inner wall of the entrance hole of the ONC-T's hood, \nwhich is indicated by the shape of the stray light (circular pattern).\nFor this reason, data from these two days were excluded from subsequent analyses.\n\n\n\n\n §.§ Flat Field Correction\n  \nThe stray light subtracted image (W-V) clearly shows the limb-darkening pattern (Figures <ref>c and <ref>d), \nwhich is the same pattern as the flat-field image (Figure <ref>e) <cit.>.\nThis fact means that the detector is uniformly illuminated from the front of the optics, showing that the sky brightness is certainly detected by ONC-T.\nThis limb-darkening pattern is corrected by dividing the image with the normalized flat-field image as shown in Figure <ref>f.\nSince the flat-field image of wide-band has not been created, we used the flat-field image of v-band instead.\nThe wavelength dependence of the flat-field image is negligible because the detector is identical for both bands.\nThe obtained image after the flat-field correction (SKY) is the final reducted image of the sky used for scientific analysis:\n\n    SKY = (W - V) / flat.\n\n\n\n\n\n\n\n\n\n\n §.§ Sensitivity Calibration Using Stars\n \nAfter the two touchdown operations to the asteroid Ryugu, degradation of ONC-T sensitivity has been reported <cit.>.\nThus, the sensitivity of ONC-T in our data is monitored and calibrated using field stars in our images.\nIn this sensitivity calibration, we used not the SKY image but the W/flat image \nbecause bright stars used in this calibration process are detected in both wide-band and v-band.\nThus v-band flux for the bright stars was subtracted in the SKY image.\nAlthough the W/flat image includes the stray light described in Section <ref>, it can be removed by the aperture photometry procedure described below. \n\nThe sensitivity calibration procedure for the wide-band is as follows.\nFirst, the astrometry of the images is solved by the distribution of the stars with the astrometry calculation code Astrometry.net <cit.>.\nNext, bright stars in the image are matched to the Gaia Data Release 3 (DR3) catalog <cit.>.\nThis catalog is suitable for our data set because the wavelength coverage of Gaia's G-band, \nwhich is the unfiltered, white-light photometric band, is similar to our wide-band on ONC-T (Figure <ref>). \nThe Gaia DR3 catalog contains around 1.806 × 10^9 sources with a limiting magnitude of about G ∼ 21 mag with uncertainties of ∼0.3 mmag for G<13 mag, \n1 mmag at G=17 mag, and 6 mmag at G=20 mag.\nWe selected stars that meet the following criteria;\n\n   \n  * The selected stars are in the region of stray light intensity in the V image less than 20 DN,\n   \n  * The selected stars are in the region of normalized flat-field value greater than 0.8, \n   \n  * The selected stars have flux between 6th and 9th AB magnitude in G-band in the Gaia DR3 catalog. \n\nCriteria (<ref>) and (<ref>) are to reduce the uncertainty caused by the reduction process of stray light subtraction and flat-field correction.\nThe fraction of the area satisfying both criteria (<ref>) and (<ref>) is approximately 44% of the total detector area at the center region of the detector.\nCriteria (<ref>) is to reduce the uncertainty of the photometry by selecting stars that have sufficient signal but are not saturated.\nThe detector of ONC-T is known to be linear up to ∼3000 DN with <1% deviation <cit.>,\nand a signal value of even the brightest pixel in the image of 6th magnitude star is approximately within this range.\n\n\n\nFor aperture photometry, a box region of 41×41 pixels centered on the selected star is cut out,\nand this box region is divided into the central star region and a surrounding background region as shown in Figure <ref>.\nThe radius of the circle to cut out the star at the center is adjusted according to the G-band brightness of this star in the catalog.\nNext, all pixels greater than 20 DN are masked considering them to be other astronomical objects (stars and galaxies) or hot pixels owing to cosmic-ray hitting,\nand additional masks were applied by a σ-clipping procedure to remove the remaining bright pixels.\nThen, all the masked images were examined by eye, and the remaining bad pixels were additionally masked.\nSubsequently, the background brightness and its noise are calculated by taking an average and standard deviation of the masked background region,\nand the background brightness is subtracted from the star region.\nThe flux of the central star is then calculated by taking a sum of the masked and background-subtracted star region,\nand its uncertainty is estimated based on the background noise.\nFigure <ref> shows the relation between the G-band flux of the selected stars in the catalog and their detected signal on the 2022-12-12 data.\nA good linear relation between them is found in all the observed data, and the sensitivity in [(DN/sec)/(W/m^2/μm/sr))] unit is obtained by taking the ratio of them.\n\n\n\nFigure <ref> (left) shows the obtained sensitivity calculated from our observed data as a function of time.\nThe sensitivity obtained after the return to the Earth <cit.> is also shown.\nThis figure shows that the degradation of the sensitivity has been stopped and has remained almost constant since the return to the Earth.\nThe average and standard deviation of the sensitivities after the σ-clipping procedure is 16095 ± 490 [(DN/sec)/(W/m^2/μm/sr))] (red solid and dashed lines in Figure <ref> left), which is applied to all data to obtain the sky brightness of the wide-band.\nThe standard deviation of the sensitivities is treated as a systematic uncertainty (see Section <ref>).\n\nThe same sensitivity calibration procedure was applied to the v-band data (V/flat images) to check the consistency of the result \nbecause the wide-band data and v-band data share the same detector.\nGaia does not have the V-band filter but it has the blue band (BP) and the red band (RP), \nand the V-band magnitude can be estimated by the BP and RP magnitudes <cit.>.\nIn the selection of stars for the v-band calibration, conditions (<ref>) and (<ref>) are the same as for the wide-band calibration, \nand in condition (<ref>), stars brighter than 8th mag in the converted V-band are selected.\nFigure <ref> (right) shows the sensitivity profile of v-band, and we confirmed that the sensitivity remained constant in our dataset.\nThe obtained sensitivity and its 1σ uncertainty of the v-band is 906 ± 37 [(DN/sec)/(W/m^2/μm/sr))].\n\n\n\n\n\n §.§ Point Spread Function\n \nThe template of the point spread function (PSF) of the ONC-T wide-band image was made by adding the images of several bright stars.\nFirst, as suitable images for making the PSF template, we selected 56 objects with G-band magnitude between 6th mag and 8th mag\nthat have clean stellar images with few bad pixels or without other objects around them.\nThen, these images were aligned with 0.1 pixel resolution and added together to obtain the PSF template.\nFigure <ref> shows the obtained PSF template and its radial profile with 0.1 pixel resolution.\nThe full-width half maximum (FWHM) of the PSF is 2.00 pixels, which is consistent with the previous measurements <cit.>.\n\n\n\n\n\n\n §.§ Sky Brightness\n \nThe sky brightness is obtained as the signal value of blank pixels in the SKY image.\nThe same histogram method used to determine the dark current described in Section <ref> is applied to determine the sky brightness from the SKY image\nbecause the number of pixels observing the blank sky is much larger than those observing stars and galaxies.\nFigure <ref> shows the histogram of the SKY image and its best-fit Gaussian curve on the 2022-10-17 data.\nThe sky brightness is obtained as the peak position of the Gaussian curve, and its 1σ error estimates of the peak position is treated as statistic uncertainty of the sky brightness.\nThe obtained sky brightness in DN unit was converted to λ I_λ in nW/m^2/sr unit by applying the calibration factor obtained in Section <ref>.\nBy this procedure, the systematic uncertainty of the calibration factor is transferred to the systematic uncertainty of the sky brightness.\nTable <ref> summarizes the obtained sky brightness and its statistic and systematic uncertainties.\n\n\n\n\n\n\n\n\n\n\n §.§ Limiting Magnitude\n \nIt is important to know the limiting magnitude in our observed images because we need to mask the detected stars to derive the diffuse brightness of the sky.\nAs shown in Figure <ref>, the histogram of the SKY image has a side lobe caused by the detected stars in the images, which exceeds the best-fit Gaussian curve.\nThe width (σ) of the Gaussian means the standard deviation of the fluctuation of the sky brightness, and \nthe limiting magnitude is defined as the brightness of stars when three pixels in the center of the PSF  (Figure <ref>) of this star exceed the +2σ of the sky deviation.\nThe uncertainty of determining the limiting magnitude is set to be 1 DN, which is equivalent to approximately 0.2 mag uncertainty of the limiting magnitude.\nThe limiting magnitude of each image and its uncertainty are summarized in Table <ref>. \n\nStars brighter than the limiting magnitude were extracted from the Gaia DR3 catalog (see Section <ref>), \nconvolved with the PSF (see Section <ref>), and distributed in the image to create a Gaia bright star image as shown in Figure <ref> (b).\nThe distribution of stars in this Gaia bright star image reproduces well the distribution of the detected stars in the observed image by ONC-T (Figure <ref> (a)), \nindicating the validity of the detection limits determined by the method described above.\nThe Gaia bright star image is used as a stellar mask to conceal stars when ZL is obtained (see Section <ref>).\n\n\n\n\n\n\n§ BACKGROUND SUBTRACTION\n\n\n\n §.§ Integrated Star Light\n\nStars fainter than the limiting magnitude are not detected as point sources in the observed image, \nbut the sum of the light from those undetected stars, called the Integrated Star Light (ISL), contributes to the sky brightness.\nTherefore, ISL should be estimated and subtracted from the sky brightness to obtain ZL.\n\nThe ISL image for each field was made by stars darker than the limiting magnitude extracted from the Gaia DR3 catalog as shown in Figure <ref> (c).\nThe average brightness of each ISL image and its 1σ statistic uncertainty are summarized in Table <ref>.\nSince the ISL in the optical wavelength is saturated by adding stars up to 20 mag <cit.>, the depth of the Gaia DR3 catalog is sufficient.\nThe photometric uncertainty in the catalog is negligible compared with the uncertainty of the limiting magnitude of ONC-T.\n \n\n\n\n\n §.§ Diffuse Galactic Light\n\nThe Diffuse Galactic Light (DGL) comprises scattered starlight by interstellar dust in our Galaxy <cit.>,\nwhich should be also subtracted from the sky brightness to obtain ZL.\nA commonly used method to estimate DGL is to use the correlation with the thermal emission from the interstellar dust at far-infrared.\nThe intensity map at λ =100 μm, which is a reprocessed composite of the COBE and IRAS maps (SFD map <cit.>),\nis commonly used as the template for interstellar dust distribution.\n\n    DGL  = νβ_λ·  d(Glat) · I_ SFD\n\nwhere DGL is the DGL brightness expressed as λ I_λ in nW/m^2/sr, I_ SFD is the far-infrared intensity at 100 μm from SFD map in MJy/sr,\nd(Glat) is a geometric function at a Galactic latitude (Glat), and νβ_λ is the DGL correlation factor shown in [(nW/m^2/sr)/(MJy/sr)].\nAs described in <cit.>, the geometric function is computed as\n\n    d(Glat) = d_0 (1-1.1g√(sin |Glat|))\n\nwhere d_0 is a normalizing parameter at Glat = 25 deg <cit.> and g is  the asymmetry factor of the scattering phase function <cit.>.\n\nThis DGL correlation factor at optical and near-infrared wavelengths is derived from many previous works <cit.>,\nbut the results are split into two.\nRecently, the values of νβ_λ = 3.54 ± 0.91 [(nW/m^2/sr)/(MJy/sr)], d_0 = 1.76, and g = 0.61 are reported from the result by the Long-Range Reconnaissance Imager (LORRI) on New Horizons obtained at 10-50 au from the Sun where ZL is negligible <cit.>.\nThe bandpass of LORRI is also similar to that of wide-band of ONC-T (Figure <ref>).\nHowever, this DGL estimate is about 5-10 times smaller than many previous results.\nFor example, the values of νβ_λ = 21.0 ± 0.9 [(nW/m^2/sr)/(MJy/sr)] and d(Glat)=1 (the geometric function is not considered) at 0.65 μm were obtained \nbased on the observations with the Hubble Space Telescope (HST) <cit.>.\nIn this work, the average of these two DGL estimates is adopted as the representative DGL estimate, \nand the difference between them is treated as a systematic uncertainty.\n\n\n\nIn addition, the spatial resolution of the SFD map (6.1 arcmin) is insufficient relative to our data of ONC-T (22 arcsec).\nTherefore, we used the far-infrared all-sky diffuse map based on AKARI all-sky survey <cit.> in this study.\nBecause these AKARI all-sky diffuse maps cover wider wavelength ranges with finer spatial resolution and better signal-to-noise ratio than the SFD map,\nAKARI all-sky diffuse maps can be a new template for the DGL estimations, replacing the SFD map as the de facto standard.\nIn this study, we used the AKARI Wide-S (λ =90 μm) map, whose spatial resolution is ∼ 1.3 arcmin. \nOne difference between these maps is that the point sources are not removed from the AKARI Wide-S map, \nwhereas the point sources are removed from the SFD map.\nTherefore, we masked all point sources included in the AKARI Far-Infrared Bright Source Catalogue Version 2 <cit.>.\nFigure <ref> compares the SFD map (left) and AKARI Wide-S map (center) on 2022-08-23 field, \nshowing that AKARI Wide-S map has better spatial resolution than the SFD map.\n\nThe publicly available AKARI Wide-S map has a remainder of ZL subtraction \nbecause only the smooth cloud component of ZL is subtracted from the raw data and other ZL components, such as the asteroidal dust bands, are not subtracted <cit.>.\nThe contribution from the unsubtracted ZL components is recognizable in the Wide-S map at the low ecliptic latitude region, where we study in this work.\nA good linear correlation between the SFD map and the AKARI Wide-S map is known <cit.>, \nbut AKARI Wide-S map at low ecliptic latitudes shows deviations from the linear correlation owing to the residual of the ZL subtraction.\nTherefore, we used the data that the other ZL components are additionally subtracted from the public AKARI Wide-S map based on the ZL asteroidal dust band model <cit.>.\nWe confirmed the good correlation between the SFD map and the additionally ZL-subtracted AKARI Wide-S map as shown in Figure <ref> (right),\n\n    I_ SFD=  a × I_ Wide-S +c\n\nwhere I_ Wide-S is the far-infrared intensity from AKARI Wide-S map in MJy/sr, and a and c are the fitting parameters.\nWe obtained a = 1.54 ± 0.05 and c = -1.20 ± 0.14 MJy/sr in our observation fields, which are consistent with the result based on the all-sky data <cit.>.\nWe converted the AKARI Wide-S maps in our observations fields to the DGL images using the equations (<ref>) and (<ref>).\nAnother issue in the AKARI Wide-S map is the sky coverage.\nAKARI all-sky map has >99 % coverage of the whole sky, but our observation fields contain the data missing regions.\nTherefore, SFD data is applied to the missing regions in the AKARI Wide-S map.\nThe averaged DGL brightness and its statistic and systematic uncertainties are summarized in Table <ref>.\nThe average brightness of the converted AKARI Wide-S map matches well with the brightness of the SFD map.\n\n\n\n\n §.§ Extragalactic Background Light\n\nThe Extragalactic Background Light (EBL) arises from integrated emissions from the first-star production era to the present day.\nRecent observations show that the measured EBL at optical and near-infrared has an excess over the cumulative light from galaxies <cit.>, meaning that there are unknown light sources in the universe. \nThe light sources for this excess is still under discussion, but some candidates are proposed such as\nintra-halo light <cit.>, primordial black holes on the collapse of the first halos <cit.>, decaying hypothetical particles <cit.>, \nnearby black holes observed as faint compact objects <cit.>, and warm-hot intergalactic medium <cit.>.\nWe adopted EBL(λ I_λ) = 21.98 ± 1.83 nW/m^2/sr at λ = 0.44-0.87 μm observed by LORRI/New Horizons <cit.>, \nand this value of EBL is subtracted to obtain the ZL brightness.\n\n\n\n §.§ Zodiacal Light\n \nZL is obtained by subtracting background emissions from observed sky brightness:\n\n    ZL  = SKY - ISL - DGL - EBL\n\nFirst, we subtracted the ISL image (Section <ref>), DGL image (Section <ref>), and EBL (Section <ref>) from the SKY image (Section <ref>) to obtain the ZL image, and the detected stars in the ZL image are concealed by the mask image (Section <ref>).\nAs shown in Figure <ref> (d), this masking procedure works well for almost all stars although the periphery of some brightest stars are not masked perfectly and are smeared out.\nThen, a histogram of the area where flat > 0.5 and stray light < 20 DN (see Section <ref>) was created for each masked ZL image, \nand its peak position and its 1σ error estimate were regarded as the brightness and its statistic uncertainties of ZL (Figure <ref>).\nThe systematic uncertainty of ZL comes from the systematic uncertainties of calibration and DGL.\nComparing the histograms of the masked ZL image (Figure <ref>) with the SKY image (Figure <ref>), \nthe excess of the side lobe over the Gaussian is reduced thanks to the stellar masking.\nThere is still a small excess owing to the smeared periphery of brightest stars and some hot pixels by cosmic-ray hitting,\nbut this small excess has little effect to obtain the peak position of the Gaussian \nbecause the Gaussian fitting was performed on data within +2σ range from the peak (red dashed line in Figure <ref>).\nThe obtained ZL and its uncertainties are summarized in Table <ref> and shown in Figure <ref> (black). \n\n\n\n\n\n\n\n§ DISCUSSION\n\n\n\n §.§ Absolute ZL brightness\n \nThe obtained ZL brightness is compared with the model brightness.\nThe precise ZL model (Kelsall model) was developed based on the observations of the all-sky ZL brightness by COBE at infrared wavelengths <cit.>.\nThe shortest wavelength of ZL brightness that can be calculated with this model is 1.25 μm, which is out of the wide-band of ONC-T used in this study.\nHowever, ZL at both 1.25 μm and optical wavelength (ONC-T wide-band) is the scattered sunlight component, and the spectral shape is the same irrespective of ecliptic latitude <cit.>.\nTherefore, the model ZL brightness at 1.25 μm observed from the Hayabusa2 position was calculated using the ZodiPy code <cit.>,\nand then ZL brightness at the optical wavelength (ONC-T wide-band) was estimated by extrapolating from 1.25 μm using the Solar spectrum <cit.>\nas shown in Figure <ref> (red).\nThe Gegenschein appears in the antisolar direction, and the Kelsall model does not include the Gegenschein.\nHowever, our observed fields are shifted from the antisolar direction by ∼10 deg (see Table <ref>), where the Gegenschein is negligible <cit.>.\nOur obtained ZL brightness is well reproduced by the extrapolated model brightness, which shows the assumption that the Solar spectrum used for extrapolation is reasonable.\nThere are small excesses of the observed ZL brightness over the model brightness at around 0.9 au.\nThis structure may be real, but cannot be concluded at this point due to the paucity of data points. \nVerification through the accumulation of data from future observations is necessary.\n\n\n\n\n §.§ Field Variance Correction\n \nSince each ZL brightness was obtained at different ecliptic latitudes and Solar elongations, \na correction of the field variance is necessary to obtain the radial profile of ZL by comparing them under the same conditions.\nThis field variance correction was conducted based on the Kelsall model.\nWe calculated the seasonal average of ZL model brightness toward the antisolar direction on the ecliptic plane at various heliocentric distances as shown in Figure <ref> (left, red). \nThe radial power-law index of this calculated ZL model brightness is α = 1.34 because this value is used in the Kelsall model.\nThis ZL brightness toward the antisolar direction was compared with the ZL model brightness toward the observation fields by ONC-T (Figure <ref> left, black).\nThe ratios of these two ZL model brightness at each position were multiplied by the observed ZL brightness as correction factors to obtain the ZL brightness toward the antisolar direction on the ecliptic plane (Figure <ref> right).\nThe correction factors are summarized in Table <ref>. \n\n\n\n\n\n\n\n\n\n §.§ Dependence on Heliocentric Distance\n \nBased on the corrected ZL brightness, the radial power-law index α is calculated by the following method.\nThe ZL brightness has two types of uncertainties; statistic uncertainty and systematic uncertainty.\nStatistical uncertainties appear randomly for each data, while systematic uncertainties appear with a certain tendency for each data.\nOur data contain two types of systematic uncertainties, one due to calibration (see section <ref>) and the other due to DGL (see section <ref>).\nTherefore, we calculated the radial power-law index α for a total of 3 × 3 cases (three cases for calibration uncertainty and three cases for DGL uncertainty).\nTable <ref> shows the obtained values of α for each systematic uncertainty case.\nAs seen in Table <ref>, calibration uncertainty does not have a significant impact on the values of α since the data points only go up and down overall. \nOn the other hand, DGL uncertainty has a significant impact on the values of α.\nFrom these values, we obtain α =  1.30 ± 0.08 as the final result.\nFigure <ref> shows the radial profile of ZL and the best-fit power-law function.\nAgain, the excess structure at ∼0.9 μm can be seen in Figure <ref>.\n\n\n\n\n\nTable <ref> compares our obtained value of α with previous results, and our result is consistent with previous results.\nSince it is difficult to determine the radial profile of the IPD density by the ZL observations from the geocentric orbit or F-corona observations, \ndirect observations of the ZL radial profile in the interplanetary space outside the Earth's orbit are more reliable.\nOur observation is the first successful observation of ZL in the interplanetary space in 40 years since Helios 1/2 and Pioneer 10/11.\nIn addition, ZL intensity varies with both the heliocentric distance and Solar elongation, \nand both of them have varied in the previous observations by Helios 1/2 and Pioneer 10/11.\nOn the other hand, we made our observations in the anti-solar direction (Solar elongation ∼180 deg),\nso we can impose changes in ZL brightness on changes in heliocentric distance.\n\nThe values of α greater than 1 are obtained by all the ZL observations, \nalthough α =1 is expected if the orbital evolution of the IPD is dominated by the PR effect <cit.>.\nThis is caused by the dust production by the collision of dust particles <cit.>, dust supply by comets around 1 au <cit.>,\nthe finiteness of the dust cloud <cit.>, or heliocentric dependence of local albedo of IPD <cit.>.\nIn fact, the heliocentric distance dependence of local albedo of IPD of r^-0.3 ± 0.1 was reported <cit.>, \nwhich explains α being greater than 1 partially.\n\nThe IPD falling on the sun due to the PR effect decrease in size owing to evaporation,\nand then such small IPD is blown away by radiation pressures as β-meteoroids.\nThe radial profile of the β-meteoroids is expected α =2,\nand recent in-situ direct counting of impact flux of IPD experienced by PSP shows α = 2 at 0.17-0.7 au <cit.>.\nOn the other hand, reddening <cit.> and polarization <cit.> of the ZL spectrum indicate that the majority of IPD seen as ZL is large (>1 μm),\nand smaller-sized IPD does not contribute much to ZL but they exist <cit.>.\nTherefore, the value of α = 2 is obtained by the IPD impact counting method sensitive to small IPD,\nbut α between 1 and 2 was obtained by ZL observations sensitive to larger IPD.\nThe small dust particles become hotter than the larger particles <cit.>,\nand the hot component in the thermal emission from IPD was found by the mid-infrared spectroscopy at λ = 3-6 μm <cit.>.\nTherefore, the value of α∼ 2 would be obtained when we conduct ZL observation at λ = 3-6 μm outside the Earth's orbit\nbecause small dust particles with high temperatures are mainly observed in this wavelength range.\n\n\n\n\n\n §.§ Future Observations\n\nSince the ZL observation at 0.7-1 au by Hayabusa2# will continue until the Earth swing-by at the end of 2027, the accuracy of the result will be improved through observation data accumulation.\nIn particular, the excess structure at ∼0.9 μm needs to be verified by accumulating data through continued observations in this phase.\nAfter the second Earth swing-by in 2028, the Hayabusa2 spacecraft will fly an orbit in the 1-1.5 au range <cit.>, \nso we can obtain the radial profile in the outer region.\n\nBefore this orbital change of Hayabusa2#, we have a chance to observe the radial profile of ZL by the Martian Moons eXploration (MMX),\nwhich is the Japanese sample-return mission of the Martin satellite, Phobos <cit.>.\nMMX is scheduled for launch in 2024 and arrival on Mars in 2025, and we are proposing to conduct the simultaneous multi-wavelength (350-1000 nm) ZL observation \nduring this cruising phase by the Optical RadiOmeter composed of CHromatic Imagers (OROCHI) on MMX <cit.>.\n\nIn addition, we are developing the EXo-Zodiacal Infrared Telescope (EXZIT) with the aim of installing it on a spacecraft to Jupiter or farther <cit.>.\nIf we could realize it, we can observe the radial profile of ZL at 1-5 au and the EBL without the ZL foreground at above 3 au.\nWe are also considering adding mid-infrared capabilities to EXZIT, which would allow us to examine our prediction of α∼ 2 index of the ZL radial profile owing to the small particles.\n\n\n\n\n§ SUMMARY\n\nThe ZL brightness at optical wavelengths at 0.76-1.06 au was observed with ONC-T on Hayabusa2# mission.\nA small excess of the observed ZL brightness over the model brightness at around 0.9 au was detected, \nbut whether this structure is realistic or not cannot be determined at this stage due to the paucity of data points.\nThe obtained radial power-law index is α = 1.30 ± 0.08, and the uncertainty in this estimate is dominated by the uncertainty due to the DGL estimation.\nThis result is consistent with the other previous result based on ZL observations.\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nThe Hayabusa2 spacecraft was developed and built under the leadership of the Japan Aerospace Exploration Agency (JAXA), \nwith contributions from the German Aerospace Center (DLR) and the Centre National d'études Spatiales (CNES), \nand in collaboration with NASA, Nagoya Univ., The Univ. of Tokyo, National Astronomical Observatory of Japan (NAOJ), Univ. of Aizu,\nKobe Univ., and other universities, institutes, and companies in Japan.\nThis work has made use of data obtained with AKARI, a JAXA project with the participation of the European Space Agency (ESA).\nThis work also has made use of data from the ESA mission Gaia (<https://www.cosmos.esa.int/gaia>), \nprocessed by the Gaia Data Processing and Analysis Consortium (DPAC, <https://www.cosmos.esa.int/web/gaia/dpac/consortium>). \nFunding for the DPAC has been provided by national institutions, in particular, the institutions participating in the Gaia Multilateral Agreement.\nThis research has made use of the VizieR catalogue access tool, CDS, Strasbourg, France (DOI : 10.26093/cds/vizier). \nThe original description of the VizieR service was published in <cit.>.\nThe authors thank Takafumi Ootsubo (NAOJ) for providing the ZL-subtracted AKARI Wide-S data,\nand Teresa Symons (University of California, Irvine) and Michael Zemcov (Rochester Institute of Technology) for discussion on DGL estimate based on New Horizons.\n\n\n\n§ FUNDING\n\nK. Tsumura is supported by JSPS KAKENHI Grant Number 20H04744 and Tokyo City University Prioritized Studies.\n\n\n\n§ ABBREVIATIONS\n\nCNES: Centre National d'études Spatiales;\nCOBE: Cosmic Background Explorer;\nDARTS: Data Archives and Transmission System;\nDGL: Diffuse Galactic light;\nDN: digital number;\nDPAC: Data Processing and Analysis Consortium;\nDR: Data release;\nEBL: Extragalactic Background Light;\nESA: European Space Agency;\nEXZIT: Exo-Zodiacal Infrared Telescope;\nFWHM: Full-width half maximum;\nHST: Hubble Space Telescope;\nIPD: Interplanetary dust;\nISL: Integrated star light;\nJAXA: Japan Aerospace Exploration Agency;\nLORRI: Long-Range Reconnaissance Imager;\nMMX: Martian Moons eXploration;\nNAOJ: National Astronomical Observatory of Japan;\nONC: Optical Navigation Camera;\nOROCHI: Optical RadiOmeter composed of CHromatic Imagers;\nPR effect: Poynting-Robertson effect;\nPSF: Point spread function;\nPSP: Parker Solar Probe;\nSTEREO: Solar TErrestrial RElations Observatory;\nZL: Zodiacal light.\n\n\n\n§ AVAILABILITY OF DATA AND MATERIALS\n\nThe raw datasets of this study will be made available in the Hayabusa2 Science Data Archives on the Data Archives and Transmission System (DARTS) repository, \nat <https://www.darts.isas.jaxa.jp/planet/project/hayabusa2/>.\nThe analyzed datasets of this study are available from the corresponding author upon reasonable request.\n\n\n\n\n§ COMPETING INTERESTS\n\nNo competing interest is declared.\n\n\n\n\n§ AUTHORS' CONTRIBUTIONS\n\nK.Ts. analyzed the data and wrote the manuscript. \nS.M., K.Sa., T.I., and K.Ta. contributed to the data analysis.\nM.Y., T.M., T.K., M.H., Y.Y., E.T., M.M., N.S., R.H., S.K., H.Su., K.Y., Y.C., K.O., K.Sh., H.Sa., and S.S. contributed to ONC data acquisitions and reduction. \nM.Y. contributed to preparing the operation sequence for the ZL observations.\nAll authors discussed the results and approved the final manuscript.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nvancouver \n      \n\n\n\n\nlabel\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}