{"entry_id": "http://arxiv.org/abs/2303.07357v1", "published": "20230313180000", "title": "Localizing The First Interstellar Meteor With Seismometer Data", "authors": ["Amir Siraj", "Abraham Loeb"], "primary_category": "astro-ph.EP", "categories": ["astro-ph.EP"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\namir.siraj@cfa.harvard.edu, aloeb@cfa.harvard.edu\n\n\nDepartment of Astronomy, Harvard University, 60 Garden Street, Cambridge, MA 02138, USA\n\n\nDepartment of Astronomy, Harvard University, 60 Garden Street, Cambridge, MA 02138, USA\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe first meter-scale interstellar meteor (IM1) was detected by US government sensors in 2014, identified as an interstellar object candidate in 2019, and confirmed by the Department of Defense (DoD) in 2022. We use data from a nearby seismometer to localize the fireball to a 1   km^2 region within the 10^2   km^2 zone allowed by the precision of the DoD-provided coordinates. The improved localization is of great importance for a forthcoming expedition to retrieve the meteor fragments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe first interstellar meteor (IM1), CNEOS[<https://cneos.jpl.nasa.gov/>] 2014-01-08, was detected by U.S. Department of Defense (DoD) sensors through the light that it emitted as it burned up in the Earth's atmosphere off of the coast of Papua New Guinea in 2014 <cit.>. The material strength of IM1 appears to be higher than all other 272 meteors in the CNEOS catalog <cit.>. A forthcoming expedition aims to recover fragments from the ocean floor with an expedition to Papua New Guinea <cit.>. The area associated with the DoD-reported localization box for the fireball is ∼ 10^2   km^2, but given practical constraints the expedition can only search an area of order ∼ 1   km^2. Hence, it is crucial to improve the precision of the fireball localization. In this Letter, we use data from a nearby seismometer, AU MANU, to set new constraints on the fireball location.\n\n\n\n§ METHOD OF CALCULATION\n\n\nWe use the National Weather Service's Global Ensemble Forecast System model atmospheric profile (pressure as a function of temperature) for the DoD-reported fireball location, (-1.3^∘, 147.6^∘) at the time 2014-01-08 17:05:34 (private communication, Tim Gallaudet & Steve Levine, April 27, 2022). We compute the sequential altitude differences as dz = H(dP/P), where H = (RT/g) is the scale height, R is the gas constant, g is the gravitational acceleration, T is the temperature as a function of pressure P, and dP are the sequential pressure differences. The sound speed as a function of temperature is given by, v_a = 331.3   m   s^-1  [1 + (T/546.3   C)]. For this particular atmospheric profile, the sound speed as a function of altitude z can be expressed as, v_a = (347.2 - 1.861 z/km)   m   s^-1.\n\n\n\n\n\nThe geometric setup is shown in Figure <ref> and the AU MANU seismic signal (with the three directions of the seismometer added in quadrature, and the overall signal normalized to unity) is displayed in Figure <ref>. There are two distinct packets of acoustic energy. The onset of the first packet is unclear, likely due to electrophonic noise that typically occurs simultaneously with fireballs, as well as the contribution from the fireball's light rapidly heating up the water beneath it, resulting in pressure waves that travel through the water, or a combination of the water and the ground, to the seismometer. However, there does appear to be a marked increase in the magnitude of the signal after about a delay of 40   s, to a level comparable to that of the second packet. The light from the fireball carries ≲ 10% of the energy <cit.>, so it should not produce a seismic signal comparable to the purely acoustic second packet. As a result, we place a simple and conservative constraint: the first sound waves from the fireball (traveling along the fastest path) should arrive sometime before 40   s. The fastest path would correspond to travel directly down through the air column, directly down through the water column, and horizontally through the ground, since the speed of sound in the ground exceeds the speed of sound in water and air. For the second packet, we require the first arrival of air-mediated sound waves from the fireball to occur at a delay of 270 - 282   s, the green region in Figure <ref> corresponding to where the signal rises above the noise threshold. This implies sound waves traversing the shortest path in between the blast and the seismometer, a distance of √(r^2 + z^2), where z is the altitude of the fireball above the ocean surface and r is the horizontal separation of the fireball from the seismometer. Similarly, we require the peak amplitude of the air-mediated sound waves to occur at a delay of 296 - 304   s (within the orange region), corresponding to the apparent peak in the signal. To first order, this should correspond to sound waves that traveled a distance of roughly r + (z / √(2)) in the air, since r ≫ z (note that we use this approximation for the analytical derivation, but then verify the fit numerically).  \n\nFor the signal:\n\n    Air   speed:     v_a = (347.2 - 1.861 z/km)   m   s^-1\n    Ground   arrival:    z/v_a + 1.7   km/v_w + r/v_g < 40   s\n    Air   arrival:     270   s < √(r^2 + z^2)/v_a < 282   s\n    Air   maximum:     296   s < r + z/√(2)/v_a < 304   s,\n\nwhere v_w ∼ 1.5   km   s^-1 is the speed of sound in water <cit.> and v_g ∼ 6   km   s^-1 is the speed of sound in the ground[<http://www.columbia.edu/ vjd1/earth_int.htm>]. Solving this system of equations yields a ground distance of r ≈ 93.5 ± 0.5   km and altitude of z ≈ 7.4 ± 0.4   km. \n\n\n\n\n\nWe then use a numerical procedure to check if the derived values for r and z correctly describe the shape of the second packet. The procedure imagines the blast from the fireball as a singular spherical wave emitted z = 7.4 ± 0.4   km above a point ocean surface r = 93.5 ± 0.5   km away from the AU MANU seismometer, traveling at v_a = 334   m   s^-1. The spherical wave intersects the ocean surface at times t > (z/v_a) in circles with radii r_circ = arccos[(z/(v_a t))], carrying a fraction of the blast energy corresponding to the fraction of the spherical blast wave contacting the ocean surface, f ∝ (2 π r_circdr_circ)/(4 π r^2). We assume an angle-independent reflection coefficient and the amplitude does not matter for the probability distribution in Figure <ref>, given the arbitrary normalization. The procedure then considers each point on each ocean surface circle re-radiating, using the distance from the point to the AU MANU seismometer, s, to derive the additional travel time (s / v_a) and the additional reduction in flux of (4 π s^-2). For each possible path, the travel time from the fireball to the point on the ocean surface, and from the point on the ocean surface to the AU MANU seismometer, are summed, and the relative flux delivered to the AU MANU seismometer is tabulated. This allows the relative fluxes for all paths with arrival times within each time bin to be summed. The result is the relative amplitude for the simulated signal, assuming perfect reflection and no transmission losses, as a function of time. The simulated second packet provides an excellent match to the rise, peak, and tail of the actual second packet, displayed in Figure <ref>. This match confirms the blast location parameters derived using Equations (<ref>) - (<ref>). \n\n\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\nThe locations reported by the DoD in the CNEOS catalog are rounded to the tenths place in longitude and latitude. This suggests that the reported location, (-1.3^∘, 147.6^∘), corresponds to a square connecting (-1.35^∘, 147.65^∘), (-1.35^∘, 147.55^∘), (-1.25^∘, 147.55^∘), and (-1.25^∘, 147.55^∘). The area of this region is ∼ 10^2   km^2. The acoustic localization described here implies a distance of 93.5 ± 0.5   km from the AU MANU seismometer at (-2.0432^∘, 147.366196^∘), and overlaps with the DoD-provided location only within a ∼ 1   km^2 triangle connecting (-1.25^∘, 147.65^∘), (-1.25^∘, 147.632^∘), and (-1.256^∘, 147.65^∘). This reduces the uncertainty in the location of the fireball by a factor of ∼ 10^2 in terms of area. This reduction in the geographic uncertainty of the IM1 fireball improves the search efficiency in the forthcoming ocean expedition to recover its fragments <cit.>. In addition, the direction in which the IM1 was traveling through the atmosphere fortuitously aligns with the distance constraint derived here, due to the serendipitous location of the AU MANU seismometer. This is beneficial for the ocean expedition search, as the fragments are expected to fall along the extrapolated post-fireball ground track trajectory of the meteor <cit.>.\n\nWhile the DoD-provided fireball altitude of 18.7   km implied a peak ram pressure of ∼ 2 × 10^2   MPa <cit.>, the altitude of 7.4 ± 0.4   km derived here implies a significantly higher ram pressure of (8 ± 0.4) × 10^2  MPa. If this altitude corresponded to the last of the three bursts observed in the light curve, then it would imply a ram pressure of (4.7 ± 0.3) × 10^2  MPa. As a result, the acoustic localization described here raises the estimate of the strength of the object by a factor of 2 - 4, which is notable since IM1 was already the toughest meteor in the CNEOS catalog by a significant margin <cit.>, and given that typical iron meteors have material strengths of ∼ 50   MPa <cit.>.\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nWe thank Tim Gallaudet and Steve Levine for providing crucial meteorological data used in this work. This work was supported in part by a grant from the Breakthrough Prize Foundation and by research funds from the Galileo Project at Harvard University. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\naasjournal\n\n\n\n\n\n\n\n\n\n\n"}