{"entry_id": "http://arxiv.org/abs/2303.07006v1", "published": "20230313110149", "title": "Inelastic Exponentiation and Classical Gravitational Scattering at One Loop", "authors": ["Alessandro Georgoudis", "Carlo Heissenberg", "Ingrid Vazquez-Holm"], "primary_category": "hep-th", "categories": ["hep-th", "gr-qc", "hep-ph"], "text": "\n\nAppendix\n    Mengchao He\n    March 30, 2023\n==================\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION AND SUMMARY OF RESULTS\n\n\n\n\nRecent years have witnessed renewed efforts in the study of two-body systems undergoing classical gravitational collisions, motivated by the ultimate objective of providing increasingly accurate waveform templates for gravitational wave detection <cit.>.\nWhile at first sight counterintuitive, scattering-amplitude methods borrowed from collider physics <cit.> have proven to be powerful tools for describing such systems and providing state-of-the-art predictions in the Post-Minkowskian (PM) regime, when the two colliding objects are sufficiently far apart and interact weakly <cit.>. \nInteractions between astrophysical black holes or neutron stars involved in such collisions are indeed classical, since their typical quantum wavelength is much smaller than the length scale associated to the gravitational curvature they induce, a statement that for black holes of mass M translates to GM^2/ħ≫1. This inequality, which is of course amply satisfied by such objects, signals, however, a breakdown of conventional perturbation theory, since the effective coupling to gravity is not small. Therefore scattering amplitudes, which are organized as a weak-coupling G-expansion, must  actually be supplemented with a nonperturbative principle in order to correctly capture the classical limit. \n\nOne such guiding principle, which is also familiar from the non-relativistic WKB approximation, is that in the classical limit the S-matrix should be dominated by the exponential e^2iδ of a large phase 2δ, which plays the role of a large action in units of ħ. For the elastic 2→2 amplitude this resummation is known as the eikonal exponentiation and the eikonal phase, or the closely related radial action, has been employed to extract from the amplitude the deflection angle(s) for two-body collisions up to 4PM order <cit.>.\nThe nonperturbative nature of the problem manifests itself at each loop order via “superclassical” or “iteration” terms, contributions that scale with higher powers of the large ratio GM^2/ħ, or, for short, of ħ^-1. The eikonal exponentiation dictates how such spurious terms should be subtracted, by matching with the power series expansion of the exponential, and fixes all ambiguities associated to possible remainders, providing a direct connection to the impulse and to the deflection angle via a saddle point approximation <cit.>. \n\nHowever, by focusing on the elastic 2→2 amplitude, the conventional eikonal framework fails to capture possible subtractions associated to inelastic channels. For instance the infrared (IR) divergent imaginary part in the 3PM eikonal signals the fact that at 𝒪(G^3) an inelastic 3-particle channel involving the two massive states and a graviton opens up, and the standard eikonal exponentiation does not capture it.\nThis problem has been studied and solved in <cit.>, the basic idea being that, in a more comprehensive framework, the eikonal should be promoted to the exponential of i times a suitable Hermitian operator that is able to appropriately combine all needed channels. The approach of Ref. <cit.> is to apply this principle to the full S-matrix, writing S = e^iN with N^†= N and building N-matrix elements out of  conventional scattering amplitudes, which are of course T-matrix elements with S = 1 + iT.\n\nA complementary approach is provided by the formalism first introduced by Kosower, Maybee and O'Connell (KMOC) <cit.> and later developed in Refs. <cit.>. This framework is based on the principle that, after identifying a well-defined classical observable O associated to the collision, its expectation value in the final state dictated by the S-matrix, ⟨in| S^† O S |in⟩ (minus its expectation in the initial state ⟨in| O |in⟩ if nonzero) will be free of superclassical terms and thus possesses a well-defined classical limit. The state |in⟩ models the two incoming massive particles with given impact parameter(s) via an appropriate superposition of plane-wave states built with suitable wave-packets, whose details become immaterial after the cancellation of superclassical terms.\n\nIn this paper, we explore further the exponentiation in the classical limit and the connection between amplitudes and classical observables. We focus on the 2→3 amplitude for the scattering of two minimally-coupled massive scalars plus the emission of a single graviton in General Relativity, whose loop expansion reads 𝒜^μν=𝒜_0^μν+𝒜_1^μν+⋯, or, pictorially,\n\n    [draw, ultra thick, blue] (-4.5,2.2)–(-1.5,2.2);\n    \t [draw, ultra thick, green!60!black] (-4.5,.8)–(-1.5,.8);\n    \t [draw, red] (-3,1.5)–(-1.5,1.5);\n    \t[white, very thick] (-3,1.5) ellipse (.7 and 1);\n    \t[pattern=north west lines, very thick] (-3,1.5) ellipse (.7 and 1);\n     \n    =\n      [draw, ultra thick, blue] (-4.5,2.2)–(-1.5,2.2);\n    \t\t [draw, ultra thick, green!60!black] (-4.5,.8)–(-1.5,.8);\n    \t\t [draw, red] (-3,1.5)–(-1.5,1.5);\n    \t\t[black!20!white, thick] (-3,1.5) ellipse (.7 and 1);\n    \t\t[thick] (-3,1.5) ellipse (.7 and 1);\n    \t \n    +\n      [draw, ultra thick, blue] (-4.5,2.2)–(-1.5,2.2);\n    \t\t [draw, ultra thick, green!60!black] (-4.5,.8)–(-1.5,.8);\n    \t\t [draw, red] (-3,1.5)–(-1.5,1.5);\n    \t\t[black!20!white, thick] (-3,1.5) ellipse (.7 and 1);\n    \t\t[thick] (-3,1.5) ellipse (.7 and 1);\n    \t\t[white, thick] (-3,1.5) ellipse (.3 and .4);\n    \t\t[pattern=none, thick] (-3,1.5) ellipse (.3 and .4);\n    \t \n    +⋯\n\nand discuss the calculation of its 1-loop part, 𝒜_1^μν, starting from the integrand provided in Ref. <cit.>. We focus on the non-analytic terms in the near-forward limit, whereby the transferred momentum and the emitted graviton's momentum are simultaneously taken to be small, 𝒪 (ħ), in comparison with the particles' masses, 𝒪 (ħ^0). To this end we apply the method of regions and restrict our attention to the soft region, in which the loop momentum assigned to the exchanged gravitons is also small, 𝒪 (ħ). We employ dimensional regularization, letting ϵ= 4-D/2, and express the result as a Laurent expansion around ϵ=0.\n\nThe calculation of 𝒜_1^μν in the soft region constitutes one of the main new results of this work, and represents a first step in generalizing the studies of graviton emissions during collisions of ultrarelativistic or massless objects <cit.> to the case of massive objects with generic velocities. The amplitude 𝒜_1^μν, as expected, involves both superclassical, 𝒪 (ħ^-2), and classical, 𝒪 (ħ^-1), contributions, for each of which we calculate both infrared (IR) divergent and finite terms. For the IR divergent pieces, we find complete agreement with the well-known exponential pattern <cit.> according to which IR divergences in a given one-loop amplitude are equal to a one-loop-exact divergent factor 𝒲 times the tree-level amplitude with the same external states <cit.>.\n\nIn the Weinberg limit, in which the emitted graviton's frequency becomes very small, k^μ∼𝒪(λ) with λ→0, the one-loop amplitude 𝒜_1^μν must also exhibit 𝒪(λ^-1) terms whose form is completely fixed by the leading soft graviton theorem <cit.> as the factor ℱ^μν = √(8π G)∑_n p_n^μ p_n^ν / (p_n· k) times the 2→2 one-loop amplitude without graviton emissions. This 1/λ pole is a frequency-space manifestation of the memory effect <cit.>. Comparing with the results available from the literature <cit.>, we find perfect agreeement with this prediction, reproducing in particular the terms arising from the 2PM deflection encoded in one-loop 2→2 “triangle” contributions, i.e. from the sub-leading eikonal phase 2δ_1.\nMoreover, exploiting the conventional exponentiation of the 2→2 amplitude, this factorization allows us to check the inelastic exponentiation of Refs. <cit.> to leading order in the soft limit. Throughout the paper, we focus on emitted gravitons with positive frequencies, so that we do not include in our analysis  terms with support localized at ω=0 in frequency space, which are associated to static effects in time domain (see e.g. <cit.> for their concrete appearance in the tree-level expressions). The inclusion of such terms has been discussed in <cit.> and can be typically performed by means an appropriate dressing of the initial and final states with a modified Weinberg factor √(8π G)∑_n p_n^μ p_n^ν / (p_n· k-i0).\n\nAfter constructing the appropriate subtractions dictated by the N-matrix formalism <cit.>, we calculate the 2→3, N-matrix element ℬ_1^μν  from the amplitude 𝒜_1^μν. In this way we obtain a purely classical object, ℬ_1^μν, which is also real and free of IR divergences. \nIndeed, by comparing the operator power series N = -ilog(1+iT) = T - i/2T^2+ ⋯ and the unitarity constraint i(T^†-T) = T^† T, it is easy to see that, at one loop, the operator exponentiation of <cit.> boils down to simply dropping the imaginary parts of the amplitude, i.e. to subtracting its unitarity cuts, 2Im𝒜_1^μν = ∑(cuts). For the process under considerations, there are four distinct channels, which we depict in Table <ref>.\n\n\nTwo of them, often referred to as s and s', involve cutting an intermediate state with two massive particles, and we shall call them collectively “S-channel”. We find that the subtraction of the S-channel is actually enough to get rid of all superclassical terms. This is in accordance with Refs. <cit.>, since this subtraction in momentum space is equivalent in b-space to the subtraction of 2iδ_0 𝒜̃_0^μν. Indeed, since this cut contributes schematically via +i/2(S-channel) to the amplitude and each of the two diagrams in the first line of Table <ref> contributes as 2δ_0 𝒜̃_0^μν in b-space, it is crucial to consider both diagrams in order to get the right combinatoric factor in front. \n\nThe remaining two cuts in Table <ref>, s_1 and s_2, instead involve an intermediate state with a massive particle and a graviton, in which the latter re-scatters against the massive line in the gravitational analog of a Compton process. For this reason, we may call them collectively “C-channel”.\nAlbeit classical as far as the ħ scaling is concerned, the C-channel involves an infrared divergence and its subtraction is crucial in order to make the resulting ℬ_1^μν (real and) finite as ϵ→0.\n\nThe amplitude 𝒜_1^μν, and the N-matrix element ℬ_1^μν, encode the dynamical information needed  in order to evaluate the 𝒪(G^3) corrections to asymptotic value of the metric fluctuation far away from the collision, which provide the next order in the PM expansion compared to the results of Refs. <cit.>. For this reason we investigate the construction of the associated KMOC kernel, i.e. the object whose Fourier transform from q-space to b-space provides the waveform in frequency domain. \nWe find that this kernel is not simply given by iℬ_1^μν, as perhaps expected. Rather, it equals iℬ_1^μν plus 12 times the IR divergent C-channel cuts. By its very nature, the associated IR pole in 1/ϵ can be exponentiated to a q-independent phase, amounting to a (divergent) shift of the origin of the observer's retarded time, at the price of introducing a logarithm involving an unspecified scale in the finite part. Neither the phase nor this logarithm appear in the energy-momentum spectra, and could as such be considered “harmless”.\nThe appearance of potentially ambiguous logarithms in the waveform, as a result of the long-range nature of the gravitational force, is a known issue and is often fixed by the appropriate treatment of so-called tail or rescattering effects <cit.>. We leave further investigations of this issue for future work, together with the calculation of the (b-space) waveform and with a comparison with subleading logλ-corrected soft theorems <cit.>, which are also intimately related with long-range corrections to the asyptotic interactions.\n\nThe paper is organized as follows.\nIn Section <ref> we present our conventions for dealing with the external states of the scattering, illustrating a useful choice of variables and polarizations, while more details on them are available in Appendix <ref>. In Section <ref> we discuss the classical limit and how focusing on the soft region  simplifies the integration. We list the corresponding 9 independent master integrals in Appendix <ref> and in the file . Section <ref> is devoted to illustrating our result for the amplitude, which is collected in computer-readable format in the file , discussing the consistency checks offered by the exponentiation of IR divergences and from factorization in the soft limit. We also discuss the implications of unitarity and the subtraction of superclassical iterations, explicitly proving the leading constraint coming from the inelastic exponentiation. The tree-level amplitudes needed to perform such checks are presented in Appendix <ref>.\nIn Section <ref>, we discuss the calculation of the gravitational field, of the associated spectrum and of the asymptotic waveform, before presenting a summary of our conclusions and a prospect of possible future directions in Section <ref>.\n\n\n\n  \n*Conventions: We employ the mostly-plus signature, η_μν = diag(-,+,+,+). All momenta are regarded as formally outgoing, so that p_3, p_4 and k are the physical momenta of the final states of the scattering, while p_1 and p_2 are minus the physical momenta of the initial states.\n\n\n\n  \n*Note added: While working on this project we became aware of independent progress by \nRefs. <cit.>, whose scope partly overlaps with our analysis.\nThese groups' work was also presented as a series of seminars <cit.> at the “QCD Meets Gravity 2022” conference.\n\n\n\n\n§ KINEMATICS\n\n\n\nWe consider the scattering of two massive objects with masses m_1 (depicted with a thick blue line) and m_2 (thick green line) and the emission of a graviton (thin red line),\n\n    𝒜^μν = \t[scale=1]\n    \t\t\t[<-] (-4.8,5.17)–(-4.2,5.17);\n    \t\t\t[<-] (-1,5.15)–(-1.6,5.15);\n    \t\t\t[<-] (-1,3.15)–(-1.6,3.15);\n    \t\t\t[<-] (-1,.85)–(-1.6,.85);\n    \t\t\t[<-] (-4.8,.83)–(-4.2,.83);\n    \t\t\t[<-] (-2.85,1.7)–(-2.85,2.4);\n    \t\t\t[<-] (-2.85,4.3)–(-2.85,3.6);\n    \t\t\t [draw, ultra thick, blue] (-5,5)–(-3,5)–(-1,5);\n    \t\t\t [draw, ultra thick, color=green!60!black] (-5,1)–(-3,1)–(-1,1);\n    \t\t\t [draw, color=red] (-3,3)–(-1,3);\n    \t\t\t [draw] (-3,1)–(-3,5);\n    \t\t\t[dashed] (-3,3) ellipse (1.3 and 2.3);\n    \t\t\t at (-1,3)[below]k;\n    \t\t\t at (-5,5)[left]p_1;\n    \t\t\t at (-5,1)[left]p_2;\n    \t\t\t at (-1,5)[right]p_4;\n    \t\t\t at (-1,1)[right]p_3;\n    \t\t\t at (-2.8,4)[right]q_1;\n    \t\t\t at (-2.8,2)[right]q_2;\n\nwith \n\n    p_1^2 = p_4^2 = -m_1^2 ,    \n    \tp_2^2 = p_3^2 = -m_2^2 ,    \n    \tk^2 = 0 .\n\nThe figure in (<ref>) is meant to help remembering the definition of the “transferred momenta” q_1, q_2,\n\n    q_1 = p_1+p_4 ,    \n    \tq_2 = p_2+p_3 ,    \n    \tq_1+q_2+k=0\n\nand does not represent an actual topology.\nLet us begin by discussing a useful choice of variables.\n\n\n\n §.§ Physical variables\n\n\nWe let\n\n    p_1^μ=-m̅_1 u_1^μ+q_1^μ/2  ,      p_4^μ = m̅_1 u_1^μ + q_1^μ/2 \n       p_2^μ=-m̅_2 u_2^μ +q_2^μ/2  ,      p_3^μ = m̅_2 u_2^μ + q_2^μ/2\n\nwith \n\n    u_1^2 = -1 = u_2^2 ,    \n    \ty=-u_1· u_2≥1.\n\nIn this way,\n\n    u_1· q_1 = 0 ,     u_2· q_2=0 ,\n\nand\n\n    m̅_1^2 = m_1^2 + q_1^2/4,     m̅_2^2 = m_2^2 + q_2^2/4 .\n\nThe momentum transfers q_1^μ and q_2^μ are not independent because of momentum conservation  (<ref>) and of the mass-shell condition k^2=0, \nwhich implies\n\n    q_1· q_2 = -1/2(q_1^2+q_2^2) .\n\nFive independent invariant Lorentz products can be taken as follows: \n\n    y = -u_1· u_2 ,    ω_1= u_1· q_2 ,    ω_2=u_2· q_1 ,    \n    \tq_1^2 ,    \n    \tq_2^2 .\n\n\nThe variable y is the relative Lorentz factor of two observers with four-velocities u_1^μ, u_2^μ. Letting v̅ denote the velocity of the former as seen from the rest frame of the latter (or vice-versa),\n\n    y = 1/√(1-v̅^2) .\n  \nUsing (<ref>), we see that ω_1 and ω_2 are the frequency of the graviton measured by these two observers,\n\n    ω_1= -u_1· k≥ 0 ,    ω_2= -u_2· k≥ 0 .\n\n\nIn order to simplify square roots that frequently appear in the calculations, it is convenient to define the following dimensionless variables\n\n    x = y-√(y^2-1) ,    \n    \tw_1 = ω_1+√(ω_1^2+q_2^2)/q_2 ,    \n    \tw_2 = ω_2+√(ω_2^2+q_1^2)/q_1 ,\n\nwith the inverse relations given by\n\n    y = 1/2(x+1/x),    ω_1= q_2/2(w_1- 1/w_1),    ω_2= q_1/2(w_2-1/w_2)\n\nso that they obey the inequalities\n\n    0<x≤ 1 ,    \n    \tw_1≥1 ,    \n    \tw_2≥1 .\n\nThe limit x→ 0 corresponds to the high-energy (ultrarelativistic) regime and x→ 1 to the low-energy one. \n\n\n\n §.§ Polarization tensor\n\n\n\nIt is convenient to contract the amplitude with an appropriate polarization tensor, which we can build as follows.\nWe start from a vector \n\n    ε^μ = c_1 u_1^μ + c_2 u_2^μ + d_1 q_1^μ + d_2 q_2^μ\n\nwith generic coefficients c_1, c_2, d_1, d_2.\nWe solve the transversality condition,\n\n    k^με_μ = - (q_1+q_2)^με_μ = 0 ,\n\nby letting\n\n    d_1 = d_+ - d_- ,     d_2 = d_+ + d_- ,    \n    \td_- = c_1 ω_1 + c_2 ω_2/q_1^2-q_2^2 .\n\n\nWe then define the polarization tensor\n\n    ε^μν = ε^με^ν .\n\nThis transverse, thanks to (<ref>). It can be also made traceless and related to more standard choices of graviton polarizations as detailed in Appendix <ref>. \nWe introduce the symbol\n\n    𝒜_1^ = ε_μ𝒜_1^μνε_ν\n\nto denote the contracted amplitude.\nDefining\n\n    ε̂^μ   = ε^μ - d_+ (q_1+q_2)^μ=  ε^μ  + d_+ k^μ ,\n\ngauge invariance requires that we can freely replace ε^μ with ε̂^μ\n\n    𝒜_1 = ε̂_μ𝒜_1^μνε̂_ν .\n\nThe new polarization vector (<ref>) is independent of d_+, which thus constitutes a free parameter that ought to drop out from the final expression. This serves as a very useful cross-check of the calculations.\n\n\n\n\n§ CLASSICAL LIMIT AND INTEGRATION\n\n\n\nLet us spell out the decomposition of our amplitude in the classical or near-forward limit. \nIn this regime the momentum transfers q_1, q_2 are taken to be simultaneously small with respect to the masses of the incoming particles, or, equivalently, the masses are taken to be large with respect to the exchanged momenta. We can therefore use a common scaling parameter as a bookkeeping device for the associated power counting. We shall use ħ for this bookkeeping purpose and define the scaling by\n\n    q_1,2∼𝒪(ħ) ,    m̅_1,2∼ u_1,2∼𝒪(ħ^0 ) ,    ε∼𝒪(ħ^0) ,    ħ→ 0 .\n\nWe emphasize again that (<ref>) only serves to keep track of powers of the transferred momenta and does not refer to the actual dependence of the amplitude on the Planck constant after restoring standard units <cit.>. \nWe shall also scale the integrated momentum  ℓ associated to exchanged gravitons in the same way as the exchanged momenta q_1,2,\n\n    ℓ∼𝒪(ħ) .\n \nThis enforces the expansion for the loop integrals in the soft region, which is the appropriate one to capture all the non-analytic dependence on q_1, q_2 in the amplitude.\nFrom Eq. (<ref>), it also follows that\n\n    k∼𝒪(ħ) ,    \n    \tc_1,2∼𝒪(ħ^0) ,    \n    \td_1,2∼𝒪(ħ^-1) ,\n\nwhere c_1,2 and d_1,2 are the decomposition coefficients in (<ref>).\n\nWe follow the numbering of the 24 topologies, 𝒢_j with j=1,…,24, associated to the integrand numerators given in Ref. <cit.>, which are depicted in Table <ref>\n\nand can be grouped into five families as in Table <ref>.\n\nAs we shall discuss in the Subsection <ref>, all integrals belonging to the P, P', M and M' families can be mapped to a collection of linearized pentagon integrals.\nThe 5 integrals of the quantum family are manifestly associated to intermediate processes, like creation of black-hole-/anti-black-hole pairs, which ought be disregarded in the classical limit, and indeed the associated integrals vanish in the soft region.\nIn this way, the 16 master integrals in Table <ref> below suffice to decompose the integrand via Integration By Parts and to evaluate the resulting integrals relevant for our purposes.\n\nEach of the 16 numerators belonging the  P, P', M and M' families should be multiplied by the appropriate propagators dictated by its diagram, and summed over the 8 independent permutations \n\n    P_8 = {σ_1, σ_2, σ_3, σ_4, σ_2σ_3, σ_3σ_4, σ_2σ_4,σ_2σ_3σ_4\n    \t}\n\ngenerated by the following ones,\n\n\t\n  σ_1: The trivial transformation (identity element).\n\t\n  σ_2: The permutation interchanging the endpoints of the blue line in Eq. (<ref>), sending u_1^μ↦  -u_1^μ and correspondingly[In principle also x↦-x corresponds to changing the sign of y, but the transformation in (<ref>) is the one that leaves √(y^2-1)=12(x+1x) invariant. For the same reason, one discards w_1↦-w_1.]\n\t\n    y ↦  -y ,    ω_1→ -ω_1 ;    \n    \t\tx ↦ -1/x ,\n    \t\t     w_1 ↦1/w_1 .\n\n\t\n  σ_3: The permutation interchanging the endpoints of the green line in Eq. (<ref>), sending u_2^μ↦  -u_2^μ and correspondingly\n\t\n    y ↦  -y ,    ω_2↦ -ω_2 ;\n    \t\t    \n    \t\tx ↦ -1/x ,     w_2 ↦1/w_2 .\n\n\t\n  σ_4: Particle-interchange symmetry, which corresponds to replacing the blue line with the green one and vicevesa, and to interchanging all particle labels 1↔2.\n\nOf course, these operations should be performed while leaving ε^μ in Eq. (<ref>) invariant. For this reason, after expanding it as in (<ref>), one should compensate for the transformations of the basis vectors by also sending  c_1↦ -c_1 (resp. c_2↦ -c_2) when performing σ_2 (resp. σ_3) and by sending c_1↔ c_2, d_1 ↔ d_2 when performing σ_4. Moreover, each diagram should only be summed over its nontrivial permutations. Equivalently, when summing over the whole P_8, each diagram should be supplied with the appropriate symmetry factor s_i accounting for the fact that a subset of the permutations may leave it invariant. Massless bubble diagrams 𝒢_20, 𝒢_23 carry an additional factor of 1/2 due to the freedom of relabeling the loop momentum.\n\nAfter evaluating the integrals in each family using the integration measure\n\n    ∫_ℓ=\n    \te^γ_E ϵ∫d^4-2ϵℓ/iπ^2-ϵ\n\nand summing over the allowed permutations, the last step is to multiply by the overall normalization factor 𝒩 given by\n\n    𝒩 = e^-γ_Eϵμ^2ϵ/(4π)^2-ϵ(32π G)^5/2 = 𝒩_4  μ̅^2ϵ ,    𝒩_4 = (32π G)^5/2/(4π)^2 ,    μ̅^2= 4π e^-γ_Eμ^2  ,\n\nwith μ an arbitrary energy scale introduced by dimensional regularization.\nAll in all, we may summarize this construction as follows,\n\n    𝒜_1 = 𝒩∑_j=1^24∫_ℓ∑_σ∈ P_8σ[s_j 𝒢_j/den_j].\n\n\n\n\n §.§ Mapping to the pentagon family\n\n\n\nIn the limit (<ref>), with an appropriate choice of loop momentum routing, all integrals in the pentagon family can be mapped to the following collection of integrals\n\n    I_i_1,i_2,i_3,i_4,i_5\n    \t=\n    \t∫_ℓ1/(2 u_1·ℓ)^i_1(-2u_2·ℓ)^i_2(ℓ^2)^i_3 ((ℓ+q_2)^2)^i_4((ℓ-q_1)^2)^i_5 .\n\nIn Eq. (<ref>) and in the following, the -i0 prescription is left implicit for brevity.\nThe family (<ref>) is obtained from the conventional scalar pentagon with two massive lines (the momentum flows clockwise in the loop and, as in Eq. (<ref>), the external momenta are all outgoing)\n\n    [draw, ultra thick, green!60!black] (-2,0)–(2,0);\n    \t\t\t [draw, ultra thick, blue] (-2,3)–(2,3);\n    \t\t\t [draw,thin] (-1.5,0)–(-1.5,3);\n    \t\t\t [draw,thin] (1.5,0)–(1.5,3);\n    \t\t\t [draw,thin] (1.5,1.5)–(2,1.5);\n    \t\t\t at (2,1.5)[right]k;\n    \t\t\t at (-1.5,1.5)[left]ℓ;\n    \t\t\t at (0,3)[below]-p_1+ℓ;\n    \t\t\t at (0,0)[above]p_2+ℓ;\n    \t\t\t at (1.5,2.5)[right]ℓ-q_1;\n    \t\t\t at (1.5,0.5)[right]ℓ+q_2;\n\nby linearizing the two massive propagators and factoring out m̅_1, m̅_2:\n\n    1/(ℓ-p_1)^2+m_1   = 1/-2p_1·ℓ+ℓ^2= 1/2m̅_1 u_1·ℓ +ℓ^2-q_1^2 = 1/m̅_11/(2u_1·ℓ) + 𝒪(ħ^0) ,\n    1/(ℓ+p_2)^2+m_2   = 1/2p_2·ℓ+ℓ^2= 1/-2m̅_2 u_2·ℓ +ℓ^2+q_2^2 = 1/m̅_21/(-2u_2·ℓ) + 𝒪(ħ^0) .\n\nIn our conventions, the sign of each propagator is fixed due to the -i0 prescription, e.g.\n\n    1/(-2u_2·ℓ) = 1/-2u_2·ℓ-i0 ,      - 1/(2u_2·ℓ)  = - 1/2u_2·ℓ-i0 ,\n\nso that\n\n    1/(-2u_2·ℓ)+1/(2u_2·ℓ) = 2iπδ(2u_2·ℓ) .\n\nA basis of for the family of integrals (<ref>), which determine all the others via Integration By Parts (IBP), can be obtained using  <cit.> and is given by the 16 elements in Table <ref> (although 7 of them can be deduced from the remaining 9 by using σ_4).\nUsing  <cit.> and dimensional shift identities <cit.>, we have found the values of all such master integrals up to transcendental weight 2. We present our results in Appendix <ref> in the Euclidean region, and discuss their analytic continuation to the physical one in the Subsection <ref>.\n\n\nIt turns out that the pentagon prime, mushroom and mushroom prime families can be also mapped to the integrals (<ref>) in the limit (<ref>), by suitably decomposing the linearized propagators into partial fractions and applying symmetry transformations.\nLet us discuss this step in detail focusing on a prototypical integral for each family, with propagators raised to the first power. Generalizing this procedure to any other positive power is straightforward.\nA typical integral of the pentagon prime family takes the form\n\n    [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t\t [draw,thin] (.5,.97)–(.5,.03);\n    \t\t\t [draw,thin] (-.5,.97)–(-.5,.03);\n    \t\t\t [draw,thin] (0,.03)–(0,.3);\n    \t\t\t at (-.5,.5)[left]ℓ;\n    \t\t→\n    \tI^(P') \n    =∫_ℓ1/(2u_1·ℓ)(-2u_2·ℓ)(-2u_2·ℓ+2ω_2)ℓ^2(ℓ-q_1)^2\n\nand decomposing the second and third propagator into partial fractions leads to\n\n    I^(P') = 1/2ω_2∫_ℓ1/(2u_1·ℓ)(-2u_2·ℓ)ℓ^2(ℓ-q_1^2) - 1/2ω_2∫_ℓ1/(2u_1·ℓ)(-2u_2·ℓ+2ω_2)ℓ^2(ℓ-q_1)^2 .\n\nWe can change integration variable in the second integral, letting ℓ→ q_1-ℓ, and obtain\n\n    I^(P') = 1/2ω_2∫_ℓ1/(2u_1·ℓ)(-2u_2·ℓ)ℓ^2(ℓ-q_1^2) - 1/2ω_2∫_ℓ1/(-2u_1·ℓ)(2u_2·ℓ)ℓ^2(ℓ-q_1)^2 .\n\nThe two integrals do not simply cancel against each other, due to (<ref>), (<ref>), but we can map them to the family (<ref>) by applying permutations σ_2 and σ_3 to the second one,\n\n    I^(P') = 1/2ω_2  I_1,1,1,0,1- 1/2ω_2 σ_2σ_3 I_1,1,1,0,1 .\n\nFor a typical integral of the mushroom family,[For the diagram in the figure 1/(2u_2·ℓ) would actually be raised to the second power.]\n\n    [draw, ultra thick, green!60!black] (-.65,0)–(0,.98)–(.65,0);\n    \t\t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t\t [draw,thin] (.5,.17)–(-.5,.17);\n    \t\t\t [draw,thin] (.3,.58)–(.55,.58);\n    \t\t\t at (0,0)ℓ;\n    \t\t→\n    \tI^(M) = ∫_ℓ1/(2u_2·ℓ)(2u_2·ℓ-2ω_2)ℓ^2\n\nwe have\n\n    I^(M) = - 1/2ω_2∫_ℓ1/(2u_2·ℓ)ℓ^2 + 1/2ω_2∫_ℓ1/(2u_2·ℓ-2ω_2)ℓ^2 .\n\nNoting that the first integral on the right-hand side is scaleless, and sending ℓ→ q_1-ℓ in the second one, we find\n\n    I^(M) = 1/2ω_2 I_0,1,0,0,1 .\n\nFinally, a typical mushroom prime integral takes the form\n\n    [draw, ultra thick, green!60!black] (-.65,0)–(0,.98)–(.65,0);\n    \t\t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t\t [draw,thin] (.5,.17)–(-.5,.17);\n    \t\t\t [draw,thin] (0,-.1)–(0,.17);\n    \t\t\t at (-.4,.6)[left]ℓ+p_3;\n    \t\t→\n    \tI^(M') = ∫_ℓ1/(2u_2·ℓ)(2u_2·ℓ-2ω_2)(ℓ-q_1)^2(ℓ+q_2)^2 ,\n\nand leads to the following partial fractions\n\n    I^(M') = - 1/2ω_2∫_ℓ1/(2u_2·ℓ)(ℓ-q_1)^2(ℓ+q_2)^2 +  1/2ω_2∫_ℓ1/(2u_2·ℓ-2ω_2)(ℓ-q_1)^2(ℓ+q_2)^2 .\n\nPerforming the permutation σ_3 in the first integral and sending ℓ→ q_1-q_2-ℓ in the second one,\n\n    I^(M') = -1/2ω_2 σ_3I_0,1,0,1,1 +  1/2ω_2 I_0,1,0,1,1 .\n \nLet us comment that, since one is ultimately summing over all allowed permutations (<ref>) to build the full integrand from the 19 diagrams in Table <ref>, it is not strictly necessary to apply σ_2σ_3 as in (<ref>) and σ_3 as in (<ref>). One can also first treat the two contributions to each equation as separate objects, perform the IBP reduction and mapping to the master integrals only for the appropriate permutation, and then perform all 8 permutations on the result.\n\n\n\n §.§ Euclidean variables and analytic continuation\n\n\n\nThe amplitude is the boundary value of an analytic function which develops branch cuts when its variables are located in the physical region. For this reason it is convenient to introduce complex variables y_E, ω_1E, ω_2E such that the physical region corresponds to setting\n\n    y_E =- y-i0 ,    ω_1E=-ω_1-i0 ,    ω_2E=-ω_2-i0 ,\n\nwith y, ω_1, ω_2 the invariant products defined in Eq. (<ref>).\nThe new variables allow for manifestly real expressions of the master integrals (<ref>) when they are taken in the Euclidean region, defined by\n\n    y_E≥1 ,    ω_1E≥ 0 ,    ω_2E≥0 .\n\nWe similarly define new rationalized variables according to\n\n    x_E = y_E+ √(y_E^2-1) ,    \n    \tw_1E = √(ω_1E^2+q_2^2)+ω_1E/q_2 ,    \n    \tw_2 = √(ω_2E^2+q_1^2)+ω_2E/q_1 ,\n\nso that\n\n    y_E = 1/2(x_E+1/x_E),    ω_1E= q_2/2(w_1E-1/w_1E),    ω_2E= q_1/2(w_2E-1/w_2E).\n\nThe rationalized variables fall in the physical region when\n\n    x_E = -x+i0 ,    \n    \tw_1E = -w_1-i0 ,    \n    \tw_2E = -w_2-i0 ,\n\nwith x, w_1, w_2 as in Eq. (<ref>).\nThe conditions (<ref>) defining the Euclidean region instead translate to the following ones in terms of the rationalized variables,\n\n    x_E≥1 ,    \n    \tw_1E≥1 ,    \n    \tw_2E≥ 1 .\n\n\nMapping back to the physical variables discussed in Subsection <ref> via (<ref>), (<ref>), one encounters branch singularities when the variables fall in the physical region. We have expressed our  master integrals (see Appendix <ref>) in terms of the  analytic functions\n\n    log x_E ,  log(x_E-1) ,  log w_1E ,  log(w_1E± 1) ,  log w_2E ,  log(w_2E± 1) ,\n\nand\n\n    Li_2(±1/x_E),    Li_2(±1/w_1E),    Li_2(±1/w_2E)\n\nso that their expressions are manifestly real in the Euclidea region (<ref>).\nWe then perform the analytic continuation back to the physical region (<ref>) by letting\n\n    log x_E     →log x + i q_I π ,\n    log w_1E   →log w_1  - i q_O π ,\n    log w_2E   →log w_2  - i q_A π ,\n\nwhere we have kept all analytic continuations in principle arbitrary.\nWe find that, consistently with the i0 prescriptions in (<ref>) or equivalently by demanding consistency with the exponentiation of infrared divergences (see Subsection <ref>), \n\n    q_I = q_O = q_A = +1 .\n\nThe sign of the i0 prescription q_I for x_E matches the elastic calculation in <cit.> where for instance in the double box solution log x_E →log x +iπ.\nThe elementary choices made in (<ref>) then resolve all other branch ambiguities upon reducing the analytic continuation of the dilogarithms to those of conventional logarithms via\n\n    Li_2(1/z) = - Li_2(z) - π^2/6 - 1/2(log (-z))^2 ,\n\nwhich holds whenever z doesn't belong to the positive real axis.\n\n\n\n\n§ STRUCTURE OF THE AMPLITUDE IN THE CLASSICAL LIMIT\n\n\n\nLooking at the integrand obtained by combining the diagrams in Table <ref>, we find the following structure in the limit (<ref>), (<ref>) (including the scaling of the measure element d^4ℓ),\n\n    𝒜_1^ = 𝒜_1^[-3] + 𝒜_1^[-2] + 𝒜_1^[-1] + 𝒪(ħ^0) ,\n\nwhere\n\n    𝒜^[-j]∼𝒪(ħ^-j) .\n\nWe expand each coefficient for small ϵ=4-D/2, defining\n\n    𝒜_1^[-j] = μ̅^2ϵ[𝒜_1^[-j,-2]/ϵ^2 + 𝒜_1^[-j,-1]/ϵ  + 𝒜_1^[-j,0] + 𝒪(ϵ)].\n\nThe first (second) index within square brackets thus refers to the  ħ (resp. ϵ) scaling.\n\nAfter inputting the values of the master integrals, we find that (for nonzero graviton frequencies)\n\n    𝒜_1^[-3] = 𝒪(ϵ) .\n\nThis cancellation is expected because it mirrors a similar one occurring for the tree-level amplitude 𝒜_0, whose classical limit also naively goes like ħ^-3 (and it indeed involves terms localized at zero frequency at that order), while its actual scaling is ħ^-2 in our present conventions. Eq. (<ref>) also serves a nontrivial check of the symmetry factors because it relies on s_3 = 2s_1 and on s_6+s_24=s_11+s_14. \nWe also find that the coefficient of the double pole in ϵ vanishes,\n\n    𝒜_1^[-j,-2]=0 ,     j=2,1 .\n\nFor instance, both 𝒢_2, 𝒢_4 and 𝒢_9 would naively diverge like 1/ϵ^2 to order 𝒪(ħ^-2), but thanks to the transversality condition (<ref>) such divergences cancel between 𝒢_2 and 𝒢_9, and separately in 𝒢_4. This serves as a cross check that s_2=s_9. This cancellation is also expected on general grounds <cit.> as we shall discuss more in detail shortly.\n\nTaking into account the vanishing of these coefficients, we find the following structure of the amplitude in the classical limit,  \n\n    𝒜_1 = μ̅^2ϵ{[𝒜_1^[-2,-1]/ϵ + 𝒜_1^[-2,0]] + [𝒜_1^[-1,-1]/ϵ + 𝒜_1^[-1,0]]\n    + 𝒪(ϵ)+𝒪(ħ^0) }.\n\nThe functions 𝒜_1^[-2,-1], 𝒜_1^[-2,0], 𝒜_1^[-1,-1], 𝒜_1^[-1,0] constitute the main results of the present work and are all provided in the ancillary files in attachment, where for convenience we collect their expressions after dividing by 𝒩_4 defined in (<ref>).\nWe have checked that our expressions for the classical terms, 𝒜_1^[-1,-1] and 𝒜_1^[-1,0], agree with the results of Ref. <cit.> on numerical points, up to an  overall sign.\nIn its turn, this also ensures agreement with the results of Ref. <cit.>.\nThe remainder of this section is devoted to the discussion and illustration of Eq. (<ref>).\n\nWe find that the coefficients of the ϵ^-1 poles, 𝒜_1^[-2,-1], 𝒜_1^[-1,-1], are in complete agreement with the prediction obtained from the exponentiation of infrared divergences, which fixes them in terms of the tree-level  five-point amplitude 𝒜_0 times a universal factor <cit.>. The combinations 𝒜_1^[-2,-1]/𝒩_4 and 𝒜_1^[-1,-1]/𝒩_4 have uniform transcendental weight 1, i.e. they are rational functions of the invariants x, w_1, w_2 in (<ref>), q_1 and q_2 times iπ.\nFor all terms displayed in (<ref>), we also find agreement with Weinberg's soft theorem <cit.>, which dictates that, as the frequency of the graviton tends to zero, their most singular term must reduce to a universal factor times the one-loop four-point amplitude 𝒜_1^(4).\nMoreover, the “superclassical” terms 𝒜_1^[-2,-1], 𝒜_1^[-2,0], as well as 𝒜_1^[-1,-1] and the terms proportional to the imaginary unit in 𝒜_1^[-1,0], when written in terms of c_1 and c_2, arise from the cuts of the amplitude exactly as predicted by unitarity.\n\nThe terms that do not multiply the imaginary unit in 𝒜_1^[-1,0]/𝒩_4 have uniform transcendental weight 2. When expressed in terms of \n    log x ,    log(1± x) ,    log w_1,2 ,    log(w_1,2± 1) ,    log(q_1,2)\n \nand \n\n    Li_2(x) ,    Li_2(1/w_1,2) ,\n\nall dependence on the logarithms and dilogarithms drops out in such terms, so that they reduce to rational functions of the invariants x, w_1, w_2 in (<ref>), q_1 and q_2 times π^2. After this simplification, the structure of this piece is thus analogous to that of the 𝒪(ħ^-1) in the elastic 2→2 amplitude at one loop (Eq. (<ref>) below).\n\nThe terms that multiply the imaginary unit in 𝒜_1^[-1,0]/𝒩_4 (and similarly the combination  𝒜_1^[-2,0]/𝒩_4), instead, can have transcendental weight either 2, i.e. reduce to rational functions times the logarithms (<ref>) times iπ, or 1, i.e. reduce to rational functions times iπ.\nSchematically,\n\n    𝒜_1^[-1,0]/𝒩_4 = π^2 \n    \tQ(x,w_1,w_2,q_1,q_2)\n    \t+\n    \tiπ[\n    \t∑_j (log x_j)  R_j(x,w_1,w_2,q_1,q_2)\n    \t+\n    \tS(x,w_1,w_2,q_1,q_2)\n    \t]\n\nwhere Q, R_j and S are real, rational functions of the invariants and log x_j are the logarithms (<ref>).\n\n\n\n §.§ Exponentiation of infrared divergences\n\n\n\nInfrared divergences in gravity amplitudes follow a simple exponential patter first clarified by Weinberg <cit.> (see also <cit.>), \n\n    𝒜_α→β = e^𝒲_α→β [𝒜_α→β]_ IR finite\n\nwith 𝒲_α→β an infrared-divergent, one-loop-exact exponent whose expression in terms of the states α, β takes a universal form.\nAccordingly, the infrared divergences of any one-loop five-point amplitude are equal to\n\n    𝒲 = G/2πϵ∑_n,m=1^5 w_nm\n\ntimes the tree-level five-point amplitude with the same external states.\nWhen the 5 particles are massive, letting (η_n is +1 if n is outgoing and -1 if n is incoming)\n\n    ζ_nm = - η_n η_m p_n· p_m > 0   ,\n\nwe have\n\n    w_nm = ζ_nm^2- 12  m_n^2m_m^2/√(ζ_nm^2-m_n^2m_m^2)[\n    \tη_nη_m \n    \tlogζ_nm+√(ζ_nm^2-m_n^2m_m^2)/ζ_nm-√(ζ_nm^2-m_n^2m_m^2)\n    \t- iπη_nm]\n\nwhere η_nm = +1 provided n≠ m and n and m are both outgoing or both incoming, and vanishes otherwise.\nMoreover w_nn = m_n^2/2.\nWhen m_5→0 and p_5→ k, the function 𝒲 is smooth and reduces to\n\n    𝒲 = G/2πϵ∑_n,m=1^4 w_nm  + G/2πϵ∑_n=1^42(-p_n· k)[log4(p_n· k)^2/Λ^2 m_n^2-iπη_n5]\n\nwith Λ an arbitrary energy scale.\nOne can explicitly check this by taking the limit in (<ref>) and by using momentum conservation\n\n    p_1+p_2+p_4+p_4 = -k\n\nto show that a potentially dangerous log m_5 cancels out, leaving behind an arbitrary reference scale Λ in the logarithm in (<ref>).\nAll in all, this dictates the IR divergences of our amplitude,\n\n    𝒜_1 = 𝒲𝒜_0 + 𝒪(ϵ^0) ,\n\nwith 𝒜_0 = ε_μ𝒜_0^μνε_ν the tree-level five-point amplitude (<ref>). In particular, (<ref>) predicts that no double pole 1/ϵ^2 should occur and Eq. (<ref>) is consistent with this prediction.\n\nWe checked that, expanding to leading and subleading\norder in ħ, \n\n    𝒲 = 𝒲^[0] +\n    \t𝒲^[1] + 𝒪(ħ^2) ,\n\nwhere\n\n    𝒲^[0]\n    \t=\n    \t-i  2G m̅_1 m̅_2 (y ^2-12)/ϵ √(y ^2-1) ,\n    \t    𝒲^[1] = - i G/ϵ  (m̅_1 ω_1+ m̅_2 ω_2) .\n\nTherefore, to this order in ħ, the Weinberg exponent is purely imaginary. 𝒲^[0] is a divergent phase arising from soft graviton exchanges between lines 1-2 and 3-4 while 𝒲^[1] arises from those between the outgoing graviton line and lines 3, 4. \nThe other ingredient is the tree-level five-point amplitude, which in the classical limit is given by \n𝒜_0 = 𝒜_0^[-2] + 𝒪(ħ^0) as in (<ref>) <cit.>.\nNote the lack of 𝒪(ħ^-1) corrections to this leading 𝒪(ħ^-2) result, as discussed below Eq (<ref>).\nConsistently with these general facts, we checked that our result (<ref>) obeys\n\n    1/ϵ 𝒜_1^[-2,-1] = \n    \t𝒲^[0]𝒜_0^[-2] ,    1/ϵ 𝒜_1^[-1,-1] = \n    \t𝒲^[1]𝒜_0^[-2] .\n\n\n\n\n §.§ Factorization in the soft limit\n\n\n\nIn the limit\n\n    k ∼𝒪(λ)  ,    λ→0 ,\n\nthe one-loop five-point amplitude 𝒜_1^μν must factorize according to the Weinberg soft graviton theorem <cit.> as\n\n    ℱ^μν = √(8π G) ∑_n=1^4 p_n^μ p_n^ν/p_n· k∼𝒪(λ^-1)\n\ntimes the one-loop four-point amplitude 𝒜_1^(4),\n\n    𝒜_1 = ℱ 𝒜_1^(4) + 𝒪(λ^0) ,\n\nwhere  ℱ = ε_μℱ^μνε_ν in analogy with (<ref>).\nThe limit (<ref>) is best taken after performing the decomposition in Eq. (<ref>) and following, introducing also the exchanged momentum\n\n    q = 1/2(q_1-q_2) ,\n\nwhose decomposition reads\n\n    q^μ = -ω_1/2ǔ_1^μ + ω_2/2ǔ_2^μ + q_⊥^μ .\n\nThe limit (<ref>) should then be understood for fixed u_1, u_2 and q_⊥^μ, so that\n\n    u_1,2∼𝒪(λ^0) ,    \n    \tq_⊥∼𝒪(λ^0) ,    \n    \ty ∼𝒪(λ^0) ,    ω_1,2∼𝒪(λ)\n\nand to leading order\n\n    q_1,2^2 =q^2  + 𝒪(λ)= q^2_⊥ + 𝒪(λ) ,\n    \t    \n    \tq_2^2-q_1^2 = 2 k· q + 𝒪(λ^2) = 2 k_⊥· q_⊥ +  𝒪(λ^2) .\n\nTo leading order in this limit, the five-point kinematics (<ref>) reduces to the four-point one introduced in Ref. <cit.>,\n\n    p_1^μ=-m̅_1 u_1^μ+q_⊥^μ/2  ,      p_4^μ = m̅_1 u_1^μ + q_⊥^μ/2 \n       p_2^μ=-m̅_2 u_2^μ - q_⊥^μ/2  ,      p_3^μ = m̅_2 u_2^μ - q_⊥^μ/2\n\nwith \n\n    u_1,2· q_⊥ = 0 ,    m̅_1^2 = m_1^2 + q_⊥^2/4,     m̅_2^2 = m_2^2 + q_⊥^2/4 .\n\n\nBoth sides of the factorization (<ref>) should be expanded in the near-forward limit (<ref>) in order to be applied to our results.\nOne finds the following near-forward limit for the Weinberg factor <cit.>,\n\n    ℱ = ℱ^[0]  + 𝒪(ħ^2)\n    \t ,    ℱ^[0] \n    \t=\n    \t𝒪_α q^α\n\nwith\n\n    𝒪_α\n    \t=\n    \t√(8π G)  ( ω_1 (u_2·ε)- ω_2 (u_1·ε )) (2 ω_1ω_2 ε_α + k_αω_2 (u_1·ε)+ k_αω_1 (u_2·ε))/ω_1^2ω_2^2 .\n\nNote the absence of 𝒪(ħ^1) corrections in (<ref>).\nFor the other ingredient of (<ref>), the one-loop four-point amplitude, one has instead <cit.>\n\n    𝒜_1^(4) = 𝒜_1^(4)[-2] + 𝒜_1^(4)[-1] + 𝒪(ħ^0)\n\nwith the 𝒪(ħ^-2) term 𝒜_1^(4)[-2]=1ϵ𝒜_1^(4)[-2,-1]+𝒜_1^(4)[-2,0]+𝒪(ϵ) given by \n\n    𝒜_1^(4)[-2] = \n    \tμ̅^2ϵ i  32 π  G^2 m̅_1^3 m̅_2^3   (y^2-12-2 ϵ)^2/√(y^2-1)e^γ_E ϵΓ (ϵ +1) Γ (-ϵ )^2/(q^2)^1+ϵΓ (-2 ϵ )\n\nfor generic ϵ, while we will only need the 𝒪(ħ^-1) term 𝒜_1^(4)[-1]=𝒜_1^(4)[-1,0]+𝒪(ϵ) to leading order in ϵ,\n\n    𝒜_1^(4)[-1,0] = 6 π^2 G^2  m̅_1^2 m̅_2^2 (5 y^2-1) (m̅_1+m̅_2)/q .\n\nEq. (<ref>) then translates into the following relations\n\n    𝒜_1^[-2] = ℱ^[0]𝒜_1^(4)[-2]+𝒪(λ^0) ,    𝒜_1^[-1] = ℱ^[0]𝒜_1^(4)[-1]+𝒪(λ^0) ,\n\nwhich can be also expanded for small ϵ. \n\nOf course, the soft limit of the 1/ϵ terms, \n\n    1/ϵ 𝒜_1^[-2,-1] = ℱ^[0]𝒜_1^(4)[-2,-1]+𝒪(λ^0) ,    1/ϵ 𝒜_1^[-1,-1] = 𝒪(λ^0)\n    \t ,\n\nis already captured by the exponentiation of infrared divergences discussed in Subsection <ref>. \nIf one considers the soft limit of Eq. (<ref>) and takes into account that the tree-level amplitude obeys the Weinberg theorem, 𝒜_0^[-2] = ℱ^[0]𝒜_0^(4) + 𝒪(λ^0), then (<ref>) becomes equivalent to (<ref>), because 𝒜_1^(4) also obeys the factorization of infrared divergences. For the 𝒪(ħ^-2) term, this dictates 1ϵ𝒜_1^(4)[-2,-1] = 𝒲^[0]𝒜_0^(4), i.e. (see e.g. Eq. (3.52) of <cit.>)\n\n    1/ϵ 𝒜_1^(4)[-2,-1] = 64 G^2 m̅_1^3 m̅_2^3/ϵ q^2(\n    \ty^2-12\n    \t)^2\n    \t-i π/√(y^2-1) .\n\nFor the 𝒪(ħ^-1) terms in (<ref>), the absence of a Weinberg pole ∼ 1/λ is also ensured by (<ref>) because 𝒲^[1] carries an extra power of λ.\n \n\nConstraints on the soft limit of 𝒜_1 independent of the exponentiation of infrared divergences instead involve the finite parts,\n\n    𝒜_1^[-2,0] = ℱ^[0]𝒜_1^(4)[-2,0]+𝒪(λ^0) ,    𝒜_1^[-1,0] = ℱ^[0]𝒜_1^(4)[-1,0] +𝒪(λ^0) .\n\nWe have checked that our results are consistent with these constraints.\nIt is instructive to see how they translate to impact-parameter space, by letting\n\n    FT[𝒜^(4)] = \t𝒜̃^(4)(b) = ∫𝒜^(4)(q)  2πδ(2m̅_1u_1· q) 2πδ(2m̅_2u_2· q)  e^ib· qd^Dq/(2π)^D ,\n\nwhere the 2→2 amplitude (see (<ref>), (<ref>) for the tree level) obeys the eikonal exponentiation <cit.>\n\n    𝒜̃^(4)_0 = 2δ_0 ,    𝒜̃^(4)_1 = i (2δ_0)^2/2 + 2δ_1 .\n\nSince we work to leading order in the soft limit, we can apply the same Fourier transform (<ref>) to the 2→3 amplitude as well, finding that (<ref>) translates to\n\n    𝒜̃_1^[-2] = 2δ_0  𝒪^α Q^1PM_α +𝒪(λ^0) ,    𝒜̃_1^[-1] = -i𝒪^α Q^2PM_α +𝒪(λ^0) ,\n\nwere we have used that FT[q^α( ⋯)]=-i∂_b^αFT[ ⋯] and the relation between the impulse and the eikonal phase up to 2PM,\n\n    Q_α = ∂ 2δ/∂ b^α ,    \n    \t2δ= 2δ_0 + 2δ_1+𝒪(G^3) ,    \n    \tQ= Q^1PM+ Q^2PM+𝒪(G^3) .\n\nOf course the soft theorem also holds for the tree-level amplitude, and one has\n\n    𝒜_0^[-2] = 𝒪^α q_α𝒜_0^(4)+𝒪(λ^0) ,\n    \t    𝒜̃_0^[-2] = -i 𝒪^α Q^1PM_α+𝒪(λ^0) .\n\nCombining (<ref>) and (<ref>) provides a check of the leading inelastic exponentiation of the one-loop level amplitude in b-space, to first order in the soft limit\n\n    𝒜̃_1^[-2] = 2iδ_0  𝒜̃_0^[-2] +𝒪(λ^0) ,\n\nwhereby the “superclassical” term of the one-loop inelastic amplitude factorizes in terms of the elastic tree-level amplitude times the inelastic one in b-space. \nMoreover, the relations (<ref>) can be seen as a manifestation order by order in G of the non-perturbative pattern discussed in <cit.> according to which the soft dressing governing the soft theorem/memory effect for processes with generic deflections can be obtained from the Weinberg factor (<ref>) by replacing  the perturbative momentum transfer q^α with the classical impulse Q^α given by (<ref>).\n\n\n\n §.§ Imaginary parts and unitarity\n\n\n\nThe “superclassical” contributions[The discussion of real and imaginary parts of the amplitude should be performed by either stripping off the polarization tensor, which has both real and imaginary parts in our case, or by keeping it while disregarding factors of “i” arising from it.] 𝒜_1^μν[-2,-1], 𝒜_1^μν[-2,0] are purely imaginary and, by unitarity, they must correspond to appropriate intermediate states for the 2→3 process under consideration. We find that they are equal to the the sum of two processes where one “cuts” two intermediate massive states, which we may term “S-channel” by analogy with the situation at four points,\n\n    μ̅^2ϵ[\n    \t1/ϵ 𝒜_1^μν[-2,-1]+ 𝒜_1^μν[-2,0]] = \n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-1,1.5)–(-.32,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\n    \t+\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-3,1.5)–(-2.1,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-1.3,1.5) ellipse (.5 and .8);\n\nThe first process on the right-hand side is obtained by gluing together a tree-level 2→2 amplitude 𝒜_0^(4) involving four massive states (<ref>) and a tree-level 2→3 amplitude 𝒜_0 for the inelastic process under consideration (<ref>).\nThe second process formally corresponds to a 2→3 amplitude glued together with a partially disconnected 3→3 one, in which the graviton line simply “passes through” the second blob, so that in practice it corresponds to gluing together 𝒜_0^(4) and 𝒜_0 in the opposite order. Equivalently, it can be obtained from the first one by applying the permutation σ_2σ_3, which flips ω_1, ω_2 and leaves y unaltered.\n\nWe have checked Eq. (<ref>) in two ways. First, by leaving the signs of the analytic continuations arbitrary as in (<ref>), i.e. without imposing (<ref>), one sees that the left-hand side of (<ref>) is only sensitive to q_I, the sign of the analytic continuation of y, which is the invariant associated to propagation in the S-channel. More precisely, denoting by f(q_I,q_O,q_A) this generalized version of the amplitude obtained by leaving the three signs of the analytic continuations arbitrary, the left-hand side of (<ref>) coincides with the S-channel discontinuity \n\n    Disc_S f \n    \t\t= 1/8  [f(+1,+1,+1)+f(+1,+1,-1)+f(+1,-1,+1)    +f(+1,-1,-1)\n    \n    \t\t-f(-1,+1,+1)-f(-1,+1,-1)-f(-1,-1,+1)    -f(-1,-1,-1)\n    \t\t].\n\nSecond, we have explicitly constructed the integrand for the right-hand side of (<ref>) by gluing together 𝒜_0^(4) and 𝒜_0 (for completeness, we provide their explicit expressions in Appendix <ref>) in the classical limit and performed the integration over phase space via reverse unitarity <cit.>. This amounts to treating the Lorentz-invariant phase space delta functions like formal propagators, performing the IBP reduction while dropping all integrals that do not possess the cut (<ref>), and lastly substituting the master integrals with 2 times their imaginary parts obtained by applying Disc_S as defined by (<ref>) (i.e. the imaginary parts associated to their S-channel discontinuities).\n\nThe purely imaginary term 𝒜_1^μν[-1,-1] and the imaginary part of 𝒜_1^μν[-1,0] arise instead due to intermediate processes whereby one cuts a massive line and a graviton line. Since these cuts are built using the “Compton” amplitude (<ref>) involving two massive states and two gravitons, together with the tree-level 2→3 amplitude 𝒜_0, we may term these “C-channel” cuts,\n\n    μ̅^2ϵ[\n    \t1/ϵ𝒜_1^μν[-1,-1] + i Im𝒜_1^μν[-1,0]] = \n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-2.1,1);\n    \t\t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t\t[thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t\n    \t+\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-2.1,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.25) ellipse (.45 and .55);\n    \t\t\t[thick] (-1.3,1.25) ellipse (.45 and .55);\n\nOnce again these processes can be also thought of as 2→3 amplitudes glued with partially disconnected 3→3 ones.\nWe have checked (<ref>) in the same two ways as for (<ref>), both by calculating the discontinuity of the  f(q_I,q_O,q_A) with respect to q_O (and separately q_A), and by building the integrand for the cuts and evaluating it via reverse unitarity.[For this check, we find that the trace condition (<ref>) plays an important role.]  \n\n\nCombining (<ref>) with (<ref>), we reconstruct the complete unitarity relation for the one-loop amplitude,\n\n    2Im [draw, ultra thick, blue] (-4.5,2.2)–(-1.5,2.2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4.5,.8)–(-1.5,.8);\n    \t\t\t [draw, red] (-3,1.5)–(-1.5,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.7 and 1);\n    \t\t\t[thick] (-3,1.5) ellipse (.7 and 1);\n    \t\t\t[white, thick] (-3,1.5) ellipse (.3 and .4);\n    \t\t\t[pattern=none, thick] (-3,1.5) ellipse (.3 and .4);\n    \t\t   = [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t [draw, red] (-1,1.5)–(-.32,1.5);\n    \t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[black!20!white, thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t[thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\n    +\n      [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t [draw, red] (-3,1.5)–(-2.1,1.5);\n    \t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[black!20!white, thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t[thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\n       \n    + [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t [draw, ultra thick, green!60!black] (-4,1)–(-2.1,1);\n    \t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[black!20!white, thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t[thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\n    +\n     [draw, ultra thick, blue] (-4,2)–(-2.1,2);\n    \t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t[black!20!white, thick] (-1.3,1.25) ellipse (.45 and .55);\n    \t\t[thick] (-1.3,1.25) ellipse (.45 and .55);\n\n\n\n\n §.§ Removing superclassical iterations\n\n\n \nWe follow Ref. <cit.> and consider the operator N linked to the S-matrix by\n\n    S = 1+i T = e^iN ,     N = -i log(1+iT) = T - i T^2/2+⋯ .\n\nAs usual, we define their matrix elements by stripping a momentum-conserving delta function,\n\n    ⟨β | T |α⟩= (2π)^D δ^(D)(P_α+P_β) 𝒜_α→β ,\n        ⟨β | N |α⟩= (2π)^D δ^(D)(P_α+P_β) ℬ_α→β ,\n\nwhere 𝒜_α→β are the conventional scattering amplitudes.\nFrom (<ref>), one trivially obtains \n\n    ℬ_0^μν = 𝒜_0^μν\n\nat tree level. Going to the next order and\ninserting a complete set of free intermediate states to resolve the terms involving T^2, one  finds\n\n    ℬ_1^μν\n    \t=\n    \t𝒜_1^μν   \n    \t-\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-1,1.5)–(-.32,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\n    \t-\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-3,1.5)–(-2.1,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-1.3,1.5) ellipse (.5 and .8);\n    \t\t\n       \n    \t-\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-2.1,1);\n    \t\t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t\t[thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t\n    \t-\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-2.1,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.25) ellipse (.45 and .55);\n    \t\t\t[thick] (-1.3,1.25) ellipse (.45 and .55);\n\nIn view of the unitarity relation (<ref>), all imaginary parts of 𝒜_1^μν cancel out and one is left with the real and IR-finite result\n\n    ℬ_1^μν = Re𝒜_1^μν = Re𝒜_1^μν[-1,0] + 𝒪(ϵ) + 𝒪(ħ^0)  .\n\nIn fact, the subtractions in the first line of (<ref>) are enough in order to remove all 𝒪(ħ^-2) “superclassical” terms, while as already discussed the ones in the second line are 𝒪(ħ^-1). Both types of subtractions involve imaginary infrared divergences, the ones in the first line being associated to 𝒲^[0], i.e. to soft-graviton exchanges between massive lines, and the ones in the second line being associated to 𝒲^[1], i.e. soft-graviton exchanges between the graviton and an outgoing massive line, as also suggested by the respective figures.\nLetting ℬ_1 = ε_μℬ_1^μνε_ν, as already mentioned, ℬ_1/𝒩_4 has uniform transcendental weight 2 and takes the form of π^2  multiplying a rational function of the invariants.\n\nLet us conclude this section by commenting on the parity properties of ℬ_1\nunder the transformation[As already mentioned, also w_1,2↦-w_1,2 corresponds to changing the sign of ω_1,2, but the transformation in (<ref>) is the one that leaves √(ω_1,2^2+q_2,1^2)=q_2,12(w_1,2+1w_1,2) invariant.]\n\n    ω_1,2↦ -ω_1,2 ,    \n    \tw_1,2↦1/w_1,2 .\n\n We find that\n \n    ℬ_1 = ℬ_1E + ℬ_1O ,\n\nwith ℬ_1E (resp. ℬ_1O) even (odd) under (<ref>).\nIn particular, the odd piece is equal to an x-dependent function times iπ times the coefficient of the ħ^-1ϵ^-1 pole\n\n    ℬ_1O\n    \t=\n    \t2 x^4 (x^2-3)/(x^2-1)^3\n    \t(i π) 𝒜_1^[-1,-1]\n    \t=\n    \t(\n    \t1-\n    \ty (y^2-3/2)/(y^2-1)^3/2)\n    \t(i π) 𝒜_1^[-1,-1] .\n\nTime-reversal-odd terms in the finite real part thus arise from the analytic continuation of logarithms left behind by the 1/ϵ in the imaginary part. This mechanism is highly reminiscent of how radiation reaction enters the eikonal phase at two loops <cit.> (see also <cit.>).\n\n\n\n\n\n§ GRAVITATIONAL FIELD, SPECTRUM AND WAVEFORM\n\n\n\nFollowing Refs. <cit.>, let us model the initial state of the collision by \n\n    | in⟩ = |1⟩⊗ |2⟩ ,\n\nwith\n\n    |1⟩   =∫ 2πδ(p_1^2+m_1^2) θ(-p_1^0) d^Dp_1/(2π)^D φ_1(-p_1)  e^ib_1· p_1|-p_1⟩\n    \n    \t|2⟩   =\n    \t∫ 2πδ(p_2^2+m_2^2) θ(-p_2^0) d^Dp_2/(2π)^D φ_2(-p_2) e^ib_2· p_2|-p_2⟩\n\nin terms of wavepackets φ_1,2 and impact parameters b_1, b_2.\nWe can then take the expectation value of the graviton field\n\n    H_μν(x) = ∫_k [\n    \te^ik· x a_μν(k)\n    \t+\n    \te^-ik· x a^†_μν(k)\n    \t]\n    \t,    ∫_k=\n    \t ∫ 2πδ(k^2) θ(k^0)\n    \td^Dk/(2π)^D ,\n\nin the state obtained by applying the S matrix (<ref>),\n\n    |out⟩  = S |in⟩ .\n\nWe denote this expectation by (“c.c” stands for “complex conjugate”)\n\n    g_μν(x)-η_μν/√(32π G)\n    \t=\n    \th_μν(x) = ⟨out | H_μν(x) |out⟩\n    \t=\n    \t∫_k\n    \te^ik· x⟨out|a_μν(k)|out⟩\n    \t+(c.c.) .\n\nDefining the Fourier transform by the generalization of (<ref>) to the 2→3 kinematics,\n\n    FT[\n    \tf^μν]\n    \t=\n    \tf̃^μν   =\n    \t∫d^Dq_1/(2π)^Dd^Dq_2/(2π)^D (2π)^Dδ^(D)(q_1+q_2+k) \n       ×\n    \t2πδ(2m̅_1 u_1· q_1)2πδ(2m̅_2 u_2· q_2)\n    \te^ib_1· q_1+ib_2· q_2 f^μν\n\nand introducing a shorthand notation for the wavepacket average\n\n    ⟨ f ⟩ = ∫∏_j=1,2 2πδ(p̅_j^2+ m̅_j^2) θ(p̅_j^0) d^D p̅_j/(2π)^D φ_j(p̅_j- 12 q_j) φ_j^∗(p̅_j+ 12 q_j)  f ,\n\nwe find\n\n    h_μν(x)\n    \t=\n    \t∫_k[\n    \te^ik· x \n    \ti\n    \tFT⟨  W_μν⟩]\n    \t+\n    \tc.c. ,    \n    \tW^μν = W_0^μν + W_1^μν\n\nwhere \n\n    W_0^μν   = ℬ_0^μν  =𝒜_0^μν ,\n    \n    \tW_1^μν   =\n    \tℬ_1^μν \n    \t+\n    \t\ti/2 [draw, ultra thick, blue] (-4,2)–(-.3,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-2.1,1);\n    \t\t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t\t[thick] (-1.3,1.75) ellipse (.45 and .55);\n    \t\t\n    \t+\n    \ti/2 [draw, ultra thick, blue] (-4,2)–(-2.1,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-.3,1);\n    \t\t\t [draw, red] (-3,1.5)–(-.3,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[black!20!white, thick] (-1.3,1.25) ellipse (.45 and .55);\n    \t\t\t[thick] (-1.3,1.25) ellipse (.45 and .55);\n\nNotably, although ℬ_0 and ℬ_1 are real and finite, the two infrared divergent C-channel cuts have “reappeared” in the loop-level result for the KMOC kernel,[From now on, we drop the explicit wavepacket average, and neglect the difference between, say m̅_1,2 and m_1,2, since superclassical terms have all been subtracted out.]\n\n    W_1^μν\n    \t=\n    \tℬ_1^μν\n    \t-i\n    \tμ̅^2ϵG/ϵ (m_1ω_1+m_2ω_2)ℬ_0^μν\n    \t+i\n    \tIm𝒜_1^μν[-1,0]\n    \t+𝒪(ϵ)\n\nwhere we have used that the infrared divergence is proportional to the tree-level result by (<ref>) and (<ref>).\nBy exponentiating it, we may also rewrite W^μν in the following way\n\n    W^μν = e^-iG/ϵ(m_1ω_1+m_2ω_2)[\n    ℬ_0^μν\n    +\n    ℬ_1^μν\n    +i\n    ℳ_1^μν]\n    +𝒪(ϵ) + 𝒪(G^7/2)\n\nin terms of the infrared-finite object\n\n    ℳ_1^μν\n    \t=\n    \tG(m_1ω_1+m_2ω_2)\n    \tℬ_0^μνlogμ̅^2\n    \t+\n    \tIm𝒜_1^μν[-1,0] .\n\nAs usual, the factorization of an infrared-divergent scale has left behind the logarithm of an arbitrary scale, and one can verify that such logμ̅^2 terms neatly combine with the leftover log q_1,2^2 terms in Im𝒜_1^μν[-1,0] to reconstruct logarithms of dimensionless quantities.\n\nLet us now turn to the spectral rate,\n\n    dρ̃= |W̃|^2 θ(k^0) 2πδ(k^2) d^4k/(2π)^4 ,\n\nwhere omitting the μν indices stands for contraction according to\n\n    |W|^2 = W̃^μν( η_μρη_νσ - 1/2 η_μνη_ρσ) W̃^ρσ∗ .\n\nThen it is clear that, although W^μν in (<ref>) has an IR-divergent phase, the spectrum is free from infrared divergences, since this overall phase cancels out, and retaining terms up to 𝒪(G^4),\n\n    |W̃|^2 =  ℬ̃_0^∗∘ℬ̃_0 + (ℬ̃_0^∗ ℬ̃_1 + ℬ̃_1^∗ ℬ̃_0) -i (ℬ̃_0^∗ ℳ̃_1 - ℳ̃_1^∗ ℬ̃_0) + 𝒪(G^5) .\n\nIn principle this cancellation could leave behind ambiguities associated to the logμ̅^2 terms in (<ref>), (<ref>).\nTo see why this is not the case, let us denote by\n\n    E(k) = G( m_1 ω_1 + m_2 ω_2)\n \nthe combination appearing in the logμ̅^2 terms, which is insensitive to the Fourier transform (<ref>).\nTerms of type ℬ_0  E logμ̅^2 in the imaginary part ℳ_1 of waveform kernel enter the spectral rate via\n\n    ℬ̃_0^∗ℬ̃_0 E(k) logμ̅^2 - E(k)ℬ̃_0 ℬ̃_0^∗logμ̅^2 = 0 .\n\nIn this way, we see that the logμ̅^2 terms in (<ref>) do not contribute to the spectral rate and a fortiori to the energy emission spectrum.\n\nOne then considers a detector with four-velocity t^μ placed at a spatial distance r from the scattering event in the angular direction characterized by the null vector n̂^μ, so that\n\n    x^μ = u  t^μ + r n̂^ν ,    n̂· t=-1 ,\n\nand takes the asymptotic limit\n\n    r→∞ ,    \n    \tu,n̂^μ fixed.\n\nIn this limit, the asymptotic field (<ref>) takes the form <cit.>\n\n    h_μν(x)\n    \t∼∫_0^∞ω^-ϵ/(ir)^1-ϵ\n    \te^-iλ u(i\n    \t W̃_μν|_k= λn̂)\n    \tdλ/2(2π)^2-ϵ\n    \t+\n    \t(c.c.) ,\n\nso that using (<ref>)\n\n    h^μν(x)\n    \t∼∫_0^∞ω^-ϵ/(ir)^1-ϵ\n    \te^-iω(u-G/ϵ (m_1 u_1+m_2u_2)·n̂) i\n    \t[\n    \tℬ̃^μν_0\n    \t+\n    \tℬ̃^μν_1\n    \t+\n    \ti\n    \tℳ̃^μν_1\n    \t]_k= λn̂dω/2(2π)^2-ϵ\n    \t+\n    \t(c.c.).\n\nIn this way, the classical information extracted from the one-loop amplitude can be used to build the 𝒪(G^3) corrections to the asymptotic metric fluctuation √(32π G) h_μν, and its IR-divergent phase can be formally reabsorbed via a redefinition of the detector's retarded time.\n\n\n\n§ CONCLUSIONS AND OUTLOOK\n\n\n\nIn this paper we calculated the 2→3 amplitude for the collision of two massive scalars and the emission of a graviton.\nWe focused on the near-forward regime, where the exchanged momenta are small, 𝒪(ħ), compared to the masses, and on the soft region in which the loop momentum associated to the exchanged gravitons is of the same order. This allowed us to perform the integration  of the integrand first obtained in Ref. <cit.>, calculating the result up to and including 𝒪(ħ^-1) and 𝒪(ϵ^0).\nThe result passes nontrivial consistency checks. It displays the appropriate structure of IR divergences predicted by Ref. <cit.> as well as the correct factorization in the soft limit <cit.>.\nAfter checking that the operator version of the eikonal exponentiation <cit.> indeed works as expected and produces a classical, real and finite matrix element for the “eikonal”, or more precisely N-operator <cit.>, we sketched the calculation of the asymptotic waveform and spectral emission rates.\nWe derived an expression for such quantities, showed that the spectra are free of ambiguities, while the waveform itself is affected by an IR divergent phase or, once such an irrelevant phase is discarded, by the presence of the logarithm of an arbitrary scale.\n \nThe appearance of logarithms of (seemingly) arbitrary parameters left behind by infrared divergences in waveform calculations is usually cured  by the inclusion of hereditary or “tail” terms <cit.>. We leave further investigations of this point for future work. \nAnother interesting issue to which we plan to return is the comparison with subleading log-corrected soft theorems <cit.>, which are also intimately related to tail effects and to the long-range nature of the gravitational force in four spacetime dimensions. In analogy with the tree-level case, such checks will likely require to first obtain sufficient analytic control of the b-space expression of the waveform. More generally, but also in connection with the issue of infrared divergences, which here we removed by following the exponentiation <cit.>, it will be interesting to investigate how our results fit within the broader program of the eikonal operator and to understand whether an improved operator formalism is actually able to directly provide an infrared finite answer, possibly fixing the associated scale ambiguity.\nOf course, for all such open issues, extremely valuable guidance will come from  comparisons with the available PN results (see e.g. Ref. <cit.> and references therein).\n\nIn the spirit of reverse-unitarity applications for classical gravitational scattering <cit.>, our result can be useful for verifying and extending calculations of radiative observables to 𝒪(G^4), including emitted energy-momentum <cit.> and angular momentum (see Refs. <cit.> for the analogous 𝒪(G^3) results).\nIn this work we focused on the ω>0 portion of the graviton spectrum, although of course interesting phenomena are associated with static effects <cit.> and require taking into account terms localized at ω=0. Such additional contributions can be typically included by means of suitable dressed states, and are likely to be important in order to correctly account for angular momentum losses.\n\n\n\n §.§ Acknowledgements\n\nWe would like to thank Francesco Alessio, Paolo Di Vecchia, Kays Haddad, Martijn Hidding, Henrik Johansson, Stephen Naculich, Ben Page, Rodolfo Russo, Augusto Sagnotti, Fei Teng, and Gabriele Veneziano\nfor very useful discussions.\nThe research of CH is supported by the\nKnut and Alice Wallenberg Foundation under grant KAW 2018.0116. Nordita is\npartially supported by Nordforsk.\n\n\n\n\n\n§ MORE ON THE KINEMATICS AND ON THE POLARIZATION TENSOR\n\n\n\nIt this appendix, we complement the material presented in Sections <ref> and <ref> concerning the properties of the kinematic variables and of the polarization tensor employed in the text.\nIntroducing the dual vectors\n\n    ǔ_1^μ= y u_2^μ-u_1^μ/y^2-1 ,    ǔ_2^μ= y u_1^μ-u_2^μ/y^2-1 ,\n\nso that u_i·ǔ_j=-δ_ij for i,j=1,2, we can decompose\n\n    k^μ= ω_1 ǔ_1^μ + ω_2 ǔ_2^μ +  k_⊥^μ\n\nwith k_⊥· u_i=0 and similarly\n\n    q_1^μ= -ω_2 ǔ_2^μ + q_1⊥^μ ,    \n    \tq_2^μ= -ω_1 ǔ_1^μ + q_2⊥^μ ,    \n    \tq_1⊥^μ + \tq_2⊥^μ+ \tk_⊥^μ=0\n\nwhere we used (<ref>).\nThe condition k^2=0 then takes the following form\n\n    k_⊥^2 = -ω_1^2+2yω_1ω_2-ω_2^2/y^2-1≥ 0 ,\n\nwhile q_1^2 and q_2^2 read\n\n    q_1^2 = ω_2^2/y^2-1 + q_1⊥^2 ≥ q_1⊥^2 ≥ 0 ,    \n    \tq_2^2 = ω_1^2/y^2-1 + q_2⊥^2 ≥ q_2⊥^2 ≥ 0 .\n\nThe relations (<ref>), (<ref>) imply that\n\n    1/y+√(y^2-1)≤ω_1/ω_2≤ y+√(y^2-1) ,\n    \t    \n    \tq_1^2 ≥ω_2^2/y^2-1 ,     q_2^2 ≥ω_1^2/y^2-1 .\n\nIn addition, the Schwarz inequality (q_1⊥· q_2⊥)^2≤ q_1⊥^2 q_2⊥^2 is equivalent to\n\n    𝒮 = (y^2-1) (q_1^2-q_2^2)^2-4 y ω_1 ω_2 (q_1^2+q_2^2)+4 ω_1^2q_1^2+4 ω_2^2 q_2^2+4  ω_1^2ω_2^2 ≤ 0 .\n\n\nThe vector (<ref>) can be rewritten as follows, after imposing the transversality condition (<ref>),\n\n    ε^μ = c_1 ξ_1^μ + c_2 ξ_2^μ + d_+ (q_1^μ + q_2^μ)\n\nin terms of the two transverse vectors\n\n    ξ_1^μ = u_1^μ - ω_1 q_1^μ-q_2^μ/q_1^2-q_2^2 ,    ξ_2^μ = u_2^μ - ω_2 q_1^μ-q_2^μ/q_1^2-q_2^2 .\n\nThe vectors k^μ, ξ_1^μ, ξ_2^μ form a basis of the space of vectors ξ^μ such that k·ξ = 0. All such vectors, except for those aligned with k^μ, are spacelike, as can be easily seen by going to a frame where k^μ = (κ,0,0,κ), where ξ^t=ξ^z and therefore ξ^2 = (ξ^x)^2+(ξ^y)^2≥ 0.\nWe can thus introduce \n\n    |ξ_1| = √(ξ_1^2)≥ 0 ,    \n    \t|ξ_1| = √(ξ_2^2)≥ 0 ,    Δ = 1 - (ξ_1·ξ_2)^2/ξ_1^2ξ_2^2≥ 0 ,\n\nwhere the very last relation is the standard Cauchy–Schwarz inequality. Explicitly,  \n\n    ξ_1^2 = -1 + 4 ω_1^2 q_1^2/(q_1^2-q_2^2)^2 ,  ξ_1·ξ_2 = -y + 2 ω_1ω_2/(q_1^2-q_2^2)^2 (q_1^2+q_2^2) ,  ξ_2^2 = -1 + 4 ω_2^2 q_2^2/(q_1^2-q_2^2)^2\n\nand (cf. Eq. (<ref>))\n\n    -Δ ξ_1^2 ξ_2^2= \n    \ty^2-1 + 4(ω_1^2 q_1^2+ω_2^2 q_2^2)-4 y ω_1ω_2(q_1^2+q_2^2)+4 ω_1^2ω_2^2/(q_1^2-q_2^2)^2≤ 0 .\n\n\nThe polarization tensor (<ref>) can be made traceless by imposing\n\n    ε_με^μ = ξ_1^2 c_1^2  + 2 (ξ_2·ξ_2)c_1 c_2  +  ξ_2^2 c_2^2= 0 ,\n\nwhich we can solve by allowing c_1 and c_2 to take complex values and letting\n\n    |ξ_1| c_1 = [-(ξ_1·ξ_2)/|ξ_1| |ξ_2| + i √(Δ)] |ξ_2| c_2 ,\n\nor equivalently\n\n    |ξ_1| c_1 = i  e^iφ_12 |ξ_2| c_2 ,    φ_12 = arcsin(ξ_1·ξ_2)/|ξ_1| |ξ_2| .\n\nOne can identify\n\n    ε^μ = 1/√(2)(ε_1^μ+ i ε_2^ν) ,\n\nin terms of real orthonormal vectors ε_1^μ, ε_2^μ,\n\n    ε_i·ε_j=δ_ij ,     i,j=1,2 ,\n \nafter imposing the normalization condition \n\n    ε^∗·ε \n    \t=\n    \tξ_1^2\n    \t|c_1|^2 \n    \t+\n    \t(ξ_1 ·ξ_2)\n    \t(c_1^∗ c_2 + c_2^∗ c_1)  \n    \t+\n    \tξ_2^2\n    \t|c_2|^2 \n    \t=\n    \t1 ,\n\nthat is,\n\n    |ξ_1| |c_1| = 1/√(2Δ) = |ξ_2| |c_2| .\n\nBuilding the standard real polarization tensors,\n\n    ε_+^μν = ε_1^με_1^ν-ε_2^με_2^ν/√(2) ,    ε_×^μν = ε_1^με_2^ν+ε_1^νε_2^μ/√(2) ,\n\nthe identification is\n\n    √(2) Reε^μν = ε_+^μν ,    √(2) Imε^μν =  ε_×^μν .\n\nIn the main body of the text, we mostly work without explicitly imposing the trace constraint (<ref>) and the normalization conditions (<ref>), treating c_1 and c_2 as formally independent.\nIn order to obtain 𝒜_1^μν from (<ref>), one ought to first impose (<ref>), (<ref>) and then build\n\n    𝒜_1^μν = ε^μ (ε^∗_α𝒜_1^αβε_β^∗)ε^ν\n    \t+\n    \tε^∗μ (ε_α𝒜_1^αβε_β)ε^∗ν .\n \n\n\n\n§ MASTER INTEGRALS\n\n\nIn this appendix, we present the master integrals that we have used in order to perform the integration of the one-loop amplitude presented in the main text.\nAs is clear from the drawings in Table <ref>, it is enough to provide the expressions for 9 of them, since the remaining 7 are obtained by interchanging all labels 1 and 2, i.e. applying the permutation σ_4. We also collect their expressions in the ancillary file .\n\n    I_0,0,1,1,0=\t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t (0,.97) to[out=-60, in=60] (0,.03);\n    \t\t (0,.97) to[out=240, in=120] (0,.03);\n    \t\t (0,.97)–(.7,.5);\n    \t= 1/ +2 - 2 q_2+/12(48-π^2-48 q_2+24 q_2^2 ) +𝒪(ϵ)\n\n\n\n\n    I_1,0,0,1,0\n    =\t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(-.5,.5)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(-.5,.5)–(.65,1);\n    \t\t [draw,thin] (.5,.95)–(.7,.5);\n    \t\t (-.5,.5) to[out=-15, in=240] (.5,.95); \n    \t\n    = 1/q_2(w_1E^2-1)/2 w_1E\n       + q_2 (w_1E^2-1)/w_1E (w_1E-1-1 -w_1E +1 + w_1E +q_2)  \n       + q_2 (w_1E^2-1)/24 w_1E (48 + 5 π^2+ 24(w_1E-1 -2 -w_1E +1 + w_1E +q_2) \n       × (-1 +w_1E -w_1E +1 + w_1E + q_2)) +𝒪(ϵ^2)\n\n\n\n\n    I_0,1,1,1,0\n    \t=\t\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t [draw,thin] (0,.97)–(.5,.03);\n    \t\t [draw,thin] (0,.97)–(-.5,.03);\n    \t\t [draw,thin] (0,.97)–(.7,.5);\n    \t= π^2/2 q_2 +𝒪(ϵ)\n\nThe integrals I_0,0,1,1,0, I_1,0,0,1,0 and I_0,1,1,1,0 can be in fact evaluated in generic D=4-2ϵ with elementary methods. However, we opted to present their expansion for small ϵ in the form which is ready-to-use for the analytic continuation discussed in Section <ref>.\n\n    I_1,0,1,1,0\n    \t=\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t [draw,thin] (.5,.97)–(0,.03);\n    \t\t [draw,thin] (-.5,.97)–(0,.03);\n    \t\t [draw,thin] (.5,.97)–(.7,.5);\n    \t= 2 w_1 E( π^2+6 -1/w_1E +6 1/w_1E+3 w_1E^2 )/3 q_2 (1 + w_1E^2) \n    +𝒪(ϵ)\n\n\n\n\n    I_1,1,0,1,0=\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(-.5,.5)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(-.5,.5)–(.65,1);\n    \t\t [draw,thin] (.5,.95)–(.5,.037);\n    \t\t [draw,thin] (.5,.95)–(.7,.5);\n    \t = 1/x_E x_E/(x_E^2-1)^2\n       + x_E/6(x_E^2-1)^2 (π^2-12-1/x_E-121/x_E -6 x_E( 2 -1 + w_1E. \n        -. 2 w_1E +2 1 + w_1E - 2 -1 + x_E+3 x_E-1 + x_E +2q_2) )\n    \t\n       +𝒪(ϵ)\n\n\n\n\n    I_1,0,1,1,1\n    \t=\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t [draw,thin] (.5,.97)–(0,.03);\n    \t\t [draw,thin] (-.5,.97)–(0,.03);\n    \t\t [draw,thin] (.25,.5)–(.7,.5);\n    \t=1/^2 w_2E/2 q_2 q_1^2 (-1 + w_1E^2)\n       + 1/w_1E/ q_2 q_1^2 (-1 + w_1E^2)( -w_1E-1+w_1E -1+w_1E+ q_2-2 q_1) \n       +  w_1E/8 q_2 q_1^2 (-1 + w_1E^2)(-π^2 + 8 -1 + w_1E^2 +8 ( w_1E -1 + w_1E). \n       .\n    ×( w_1E - 1 + w_1E + 2 q_2 - 4 q_1) . \n       . -16 -1 + w_1E(w_1E -1 + w_1E.  . \n       . .+q_2 -2 q_1)+ 64q_1^2 +8q_2(-3 q_2 + 4 q_1^2 -q_2^2) . \n       .-32 q_1q_2 (q_1^2 - q_2^2) +16q_2^2/q_1^2)  \n    +𝒪(ϵ)\n\n\n\n\n    I_1,1,0,1,1=\t\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(-.5,.5)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(-.5,.5)–(.65,1);\n    \t\t [draw,thin] (.5,.95)–(.5,.035);\n    \t\t [draw,thin] (.5,.5)–(.7,.5);\n    \t= 1/^2w_1Ew_2E/q_1q_2 (-1 + w_1E^2) (-1 + w_2E^2)\n       - 1/w_1Ew_2E/q_1q_2 (-1 + w_1E^2) (-1 + w_2E^2)(-1 + w_1E -w_1E. \n       .+ 1 + w_1E + -1 + w_2E - \n    \tw_2E + 1 + w_2E +q_1 +q_2) \n        +w_1Ew_2E/12 q_1q_2 (-1 + w_1E^2) (-1 + w_2E^2)(- 7π^2-12 x_E^2+24 (log (q_1)+log (w_2E-1)\n    \t\n       -log (w_2E)+log (w_2E+1)) (log (q_2)+log (w_1E-1)-log (w_1E)+log (w_1E+1)) )\n    \t\n       +𝒪(ϵ)\n\n\n\n\n    I_1,1,1,1,0=\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t [draw,thin] (.5,.97)–(.5,.03);\n    \t\t [draw,thin] (-.5,.97)–(-.5,.03);\n    \t\t [draw,thin] (.5,.97)–(.7,.5);\n    \t= \n    -x_E log (x_E)/q_2^2 (x_E^2-1) ϵ\n       +\n    x_E/6 q_2^2 (x_E^2-1)[\n    -12 Li_2(1/x_E)-12 Li_2(-1/x_E) \n       +6 log (x_E) (2 (log (q_2)+log (x_E+1))-2 log (w_1E-1)+2 log (w_1E) \n       -2 log (w_1E+1)+2 log (x_E-1)-3 log (x_E))+π ^2\n    ]+𝒪(ϵ)\n\n\n\n\n    I_1,1,1,1,1\n    \t=\t\t\t\t  \n    \t[baseline=([yshift=-0.5ex]current bounding box.center),scale=1,node/.style=draw,shape=circle,fill=black,scale=0.4]\n    \t\t [draw, ultra thick, green!60!black] (-.65,0)–(.65,0);\n    \t\t [draw, ultra thick, blue] (-.65,1)–(.65,1);\n    \t\t [draw,thin] (.5,.97)–(.5,.03);\n    \t\t [draw,thin] (-.5,.97)–(-.5,.03);\n    \t\t [draw,thin] (.5,.5)–(.7,.5);\n    \t= c_2/ϵ^2+ c_1/ϵ+c_0+𝒪(ϵ) .\n\nWe have obtained c_2, c_1 and c_0 by means of dimension shifting identities (see e.g. <cit.>). These express the 6-dimensional pentagon I_1,1,1,1,1^6D, which is finite, as a linear combination of 4-dimensional pentagon and box integrals. Since I_1,1,1,1,1^6D only involves objects of transcendental weight 3, it can only contribute to the 𝒪(ϵ) part of I_1,1,1,1,1 in D=4-2ϵ. Therefore, the “ansatz coefficients” c_2, c_1 and c_0 can be fixed in terms of the box integrals already provided in the previous equations.\n\n\n\n§ TREE-LEVEL AMPLITUDES\n\n\n\nIn this appendix we collect the tree level amplitudes that are useful in order to perform various checks on the 2→3 one-loop amplitude calculated in the text. We start from the tree-level 2→2 amplitude 𝒜_0^(4) involving four massive states,\n\n    𝒜_0^(4)\n    \t\t=\n    \t\t [draw, ultra thick, blue] (-4,2)–(-2,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-2,1);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\n    =\n    4 π  G m̅_1^2 m̅_2^2 (8 y^2 (ϵ -1)+4)/q^2 (ϵ -1)-4 π  G (m̅_1^2+m̅_2^2)/ϵ -1+π  G q^2 (3-2 ϵ )/ϵ -1 .\n\nThe 2→3 tree level amplitude 𝒜_0^μν involving four massive states and a graviton can be written as follows as the sum of a piece obtained form the double copy minus a piece only including the dilaton exchanges,\n\n    𝒜_0^μν\n    \t=\n    \t [draw, ultra thick, blue] (-4,2)–(-2,2);\n    \t\t\t [draw, ultra thick, green!60!black] (-4,1)–(-2,1);\n    \t\t\t [draw, red] (-3,1.5)–(-2,1.5);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\n    =\n    𝒜_dc^μν - 𝒜_dil^μν ,\n\nwhere <cit.>\n\n    𝒜_dc^μν    =2(8 π G_N)^3/2{(p_4 p_2)(p_3 p_1)(p_4^μ/p_4 k-p_3^μ/p_3 k)(p_2^ν/p_2 k-p_1^ν/p_1 k)+4 q_1^2 q_2^2. \n       ×[q_1^μ(p_1 p_2)-p_2^μ(p_1 k)+p_1^μ(p_2 k)/q_1^2 q_2^2-p_3^μ/2 p_3 k(p_1 p_2/q_1^2+1/2)+p_4^μ/2 p_4 k(p_1 p_2/q_2^2+1/2)] \n       .×[q_1^ν(p_4 p_3)-p_3^ν(p_4 k)+p_4^ν(p_3 k)/q_1^2 q_2^2+p_1^ν/2 p_1 k(p_4 p_3/q_2^2+1/2)-p_2^ν/2 p_2 k(p_4 p_3/q_1^2+1/2)]}\n\nand\n\n    𝒜_dil^μν/√(2) (π G)^3/2\n    \t=\n    \t4 (q_1^2-q_2^2) q_1^μ q_1^ν(4 m̅_1^2-q_1^2) (q_2^2-4 m̅_2^2)/q_2^2 (ϵ -1) (-4 ω _1 m̅_1+q_1^2-q_2^2) (4 ω _1 m̅_1+q_1^2-q_2^2)\n       +\n    \t4 (q_1^2-q_2^2) q_2^μ q_2^ν(q_1^2-4 m̅_1^2) (q_2^2-4 m̅_2^2)/q_1^2 (ϵ -1) (-4 ω _2 m̅_2+q_1^2-q_2^2) (4 ω _2 m̅_2+q_1^2-q_2^2)\n       \n    \t-32 ω _2 m̅_2^2 (q_1^2-4 m̅_1^2) (4 m̅_2^2-q_2^2) q_1^(μu_2^ν)/q_1^2 (ϵ -1) (-4 ω _2 m̅_2+q_1^2-q_2^2) (4 ω _2 m̅_2+q_1^2-q_2^2)\n       \n    \t-32 ω _1 m̅_1^2 (4 m̅_1^2-q_1^2) (q_2^2-4 m̅_2^2) u_1^(μq_2^ν)/q_2^2 (ϵ -1) (-4 ω _1 m̅_1+q_1^2-q_2^2) (4 ω _1 m̅_1+q_1^2-q_2^2)\n       \n    \t-16 (q_1^2-q_2^2) m̅_1^2 u_1^μ u_2^ν(4 m̅_1^2-q_1^2) (q_2^2-4 m̅_2^2)/q_2^2 (ϵ -1) (-4 ω _1 m̅_1+q_1^2-q_2^2) (4 ω _1 m̅_1+q_1^2-q_2^2)\n       \n    \t+16 (q_1^2-q_2^2) m̅_2^2 u_2^μ u_2^ν(q_1^2-4 m̅_1^2) (4 m̅_2^2-q_2^2)/q_1^2 (ϵ -1) (-4 ω _2 m̅_2+q_1^2-q_2^2) (4 ω _2 m̅_2+q_1^2-q_2^2)\n       (q_1^2+q_2^2) (q_1^2-4 m̅_1^2) (q_2^2-4 m̅_2^2) η^μν/q_1^2 q_2^2 (ϵ -1)\n    -q_1^(μq_2^ν)/q_1^2 q_2^22 (q_1^2-4 m̅_1^2) (q_2^2-4 m̅_2^2) P_q_1q_2/\n    \t\t (ϵ -1) Q_q_1q_2\n\nwith A^(μB^ν) = A^μ B^ν + A^ν B^μ,\n\n    P_q_1q_2   =\n    \t2 q_1^4 (8 ω _1^2 m̅_1^2-8 ω _2^2 m̅_2^2+3 q_2^4)+(q_2^4-16 ω _1^2 m̅_1^2) (16 ω _2^2 m̅_2^2+q_2^4)+q_1^8-4 q_2^2 q_1^6-4 q_2^6 q_1^2 ,\n    \n    \tQ_q_1q_2   \n    \t=\n    \t(-4 ω _1 m̅_1+q_1^2-q_2^2) (4 ω _1 m̅_1+q_1^2-q_2^2) (-4 ω _2 m̅_2+q_1^2-q_2^2) (4 ω _2 m̅_2+q_1^2-q_2^2).\n\nThe last ingredient is the “Compton” amplitude for the scattering of a graviton and a massive particle <cit.>\n\n    𝒜^C_ρσ, αβ\n    \t=\n    \t [draw, ultra thick, blue] (-4,2)–(-2,2);\n    \t\t\t [draw, thin, red] (-4,1)–(-2,1);\n    \t\t\t[black!20!white, thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t[thick] (-3,1.5) ellipse (.5 and .8);\n    \t\t\t at (-4,2)[left]k_1;\n    \t\t\t at (-2,2)[right]k_2;\n    \t\t\t at (-4,1)[left](ρσ) r_1;\n    \t\t\t at (-2,1)[right]r_2 (αβ);\n\nwhich reads\n\n    𝒜^C_ρσ, αβ=2 κ^2 r_1·(k_1+r_2) r_1· k_1/r_1· r_2\n       ×[(k_1+r_2)^ρ k_1^α/r_1·(k_1+r_2)-(k_1+r_1)^α k_1^ρ/k_1 · r_1+η^ρα][(k_1+r_2)^σ k_1^β/r_1 ·(k_1+r_2)-(k_1+r_1)^β k_1^σ/k_1 · r_1+η^σβ].\n\n\nBoth 𝒜_dc^μν, 𝒜_dil^μν and 𝒜_C^ρσ,αβ are gauge invariant,\n\n    𝒜_dc^μνk_μ = 0 ,    𝒜_dil^μνk_μ= 0 ,    𝒜_C^ρσ,αβr_1ρ=0=𝒜_C^ρσ,αβr_2α=0\n\nand can be glued into cuts by replacing the transverse-traceless projector Π^μν,ρσ over intermediate graviton states via\n\n    Π^μν,ρσ→1/2(\n    \tη^μρη^νσ\n    \t+\n    \tη^μση^νρ\n    \t-\n    \t1/1-ϵ η^μνη^ρσ).\n\nIt is easy to see that, provided the gravitons have nonzero frequency,\n\n    𝒜_ρσ,αβ^C = 𝒜_ρσ,αβ^C[0] + 𝒪(ħ)\n\nin the limit (<ref>). The tree-level 2→2 amplitude (<ref>) behaves as ħ^-2 to leading order, and only receives corrections analytic in q^2,\n\n    𝒜_0^(4) = 𝒜_0^(4)[-2] + (analytic in q^2) .\n\nThese corrections become short-range terms the Fourier transform (<ref>) and are thus completely irrelevant to our analysis.\nThe tree-level 2→3 amplitude (<ref>) also behaves as ħ^-2 to leading order,\n\n    𝒜_0^μν = 𝒜_0^μν[-2] + 𝒪(ħ^0)\n\nand is free of ħ^-1 corrections. The property (<ref>) holds thanks to the choice of variables (<ref>), (<ref>) discussed in Subsection <ref>. \n\nThe leading order 𝒜_0^μν[-2] coincides with the one given in <cit.>.\n\n\n\n\n\n10\n\t\n\tDamgaard:2021ipf\n\tP. H. Damgaard, L. Planté, and P. Vanhove, “On an exponential\n\t\trepresentation of the gravitational S-matrix,”\n\thttp://dx.doi.org/10.1007/JHEP11(2021)213JHEP 11 (2021)\n\t\t213, http://arxiv.org/abs/2107.12891arXiv:2107.12891\n\t\t\t[hep-th].\n\t\n\tCristofoli:2021jas\n\tA. Cristofoli, R. Gonzo, N. Moynihan, D. O'Connell, A. Ross, M. Sergola, and\n\tC. D. White, “The Uncertainty Principle and Classical Amplitudes,”\n\thttp://arxiv.org/abs/2112.07556arXiv:2112.07556 [hep-th].\n\t\n\tDiVecchia:2022piu\n\tP. Di Vecchia, C. Heissenberg, R. Russo, and G. Veneziano, “Classical\n\t\tGravitational Observables from the Eikonal Operator,”\n\thttp://arxiv.org/abs/2210.12118arXiv:2210.12118 [hep-th].\n\t\n\tLIGOScientific:2021djp\n\tLIGO Scientific, VIRGO, KAGRA Collaboration, R. Abbott et al.,\n\t“GWTC-3: Compact Binary Coalescences Observed by LIGO and Virgo During the\n\t\tSecond Part of the Third Observing Run,”\n\thttp://arxiv.org/abs/2111.03606arXiv:2111.03606 [gr-qc].\n\t\n\tBuonanno:2022pgc\n\tA. Buonanno, M. Khalil, D. O'Connell, R. Roiban, M. P. Solon, and M. Zeng,\n\t“Snowmass White Paper: Gravitational Waves and Scattering Amplitudes,” in\n\t2022 Snowmass Summer Study.\n\t4, 2022.\n\thttp://arxiv.org/abs/2204.05194arXiv:2204.05194\n\t\t\t[hep-th].\n\t\n\tKawai:1985xq\n\tH. Kawai, D. C. Lewellen, and S. H. H. Tye, “A Relation Between Tree\n\t\tAmplitudes of Closed and Open Strings,”\n\thttp://dx.doi.org/10.1016/0550-3213(86)90362-7Nucl. Phys. B\n\t\t269 (1986)  1–23.\n\t\n\tBern:1994zx\n\tZ. Bern, L. J. Dixon, D. C. Dunbar, and D. A. Kosower, “One loop n point\n\t\tgauge theory amplitudes, unitarity and collinear limits,”\n\thttp://dx.doi.org/10.1016/0550-3213(94)90179-1Nucl. Phys. B\n\t\t425 (1994)  217–260, http://arxiv.org/abs/hep-ph/9403226arXiv:hep-ph/9403226.\n\t\n\tBern:1994cg\n\tZ. Bern, L. J. Dixon, D. C. Dunbar, and D. A. Kosower, “Fusing gauge theory\n\t\ttree amplitudes into loop amplitudes,”\n\thttp://dx.doi.org/10.1016/0550-3213(94)00488-ZNucl. Phys. B\n\t\t435 (1995)  59–101, http://arxiv.org/abs/hep-ph/9409265arXiv:hep-ph/9409265.\n\t\n\tBern:1995db\n\tZ. Bern and A. G. Morgan, “Massive loop amplitudes from unitarity,”\n\thttp://dx.doi.org/10.1016/0550-3213(96)00078-8Nucl. Phys. B\n\t\t467 (1996)  479–509, http://arxiv.org/abs/hep-ph/9511336arXiv:hep-ph/9511336.\n\t\n\tBern:1998ug\n\tZ. Bern, L. J. Dixon, D. C. Dunbar, M. Perelstein, and J. S. Rozowsky, “On\n\t\tthe relationship between Yang-Mills theory and gravity and its implication\n\t\tfor ultraviolet divergences,”\n\thttp://dx.doi.org/10.1016/S0550-3213(98)00420-9Nucl. Phys. B530 (1998)  401–456,\n\thttp://arxiv.org/abs/hep-th/9802162arXiv:hep-th/9802162\n\t\t\t[hep-th].\n\t\n\t\n\tBern:2008qj\n\tZ. Bern, J. J. M. Carrasco, and H. Johansson, “New Relations for Gauge-Theory\n\t\tAmplitudes,” http://dx.doi.org/10.1103/PhysRevD.78.085011Phys.\n\t\t\tRev. D 78 (2008)  085011, http://arxiv.org/abs/0805.3993arXiv:0805.3993 [hep-ph].\n\t\n\tBern:2010ue\n\tZ. Bern, J. J. M. Carrasco, and H. Johansson, “Perturbative Quantum Gravity\n\t\tas a Double Copy of Gauge Theory,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.105.061602Phys. Rev.\n\t\t\tLett. 105 (2010)  061602, http://arxiv.org/abs/1004.0476arXiv:1004.0476 [hep-th].\n\t\n\tBjerrum-Bohr:2018xdl\n\tN. E. J. Bjerrum-Bohr, P. H. Damgaard, G. Festuccia, L. Planté, and\n\tP. Vanhove, “General Relativity from Scattering Amplitudes,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.121.171601Phys. Rev.\n\t\t\tLett. 121 (2018) no. 17, 171601,\n\thttp://arxiv.org/abs/1806.04920arXiv:1806.04920 [hep-th].\n\t\n\t\n\tCheung:2018wkq\n\tC. Cheung, I. Z. Rothstein, and M. P. Solon, “From Scattering Amplitudes to\n\t\tClassical Potentials in the Post-Minkowskian Expansion,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.121.251101Phys. Rev.\n\t\t\tLett. 121 (2018) no. 25, 251101,\n\thttp://arxiv.org/abs/1808.02489arXiv:1808.02489 [hep-th].\n\t\n\t\n\tBern:2019nnu\n\tZ. Bern, C. Cheung, R. Roiban, C.-H. Shen, M. P. Solon, and M. Zeng,\n\t“Scattering Amplitudes and the Conservative Hamiltonian for Binary Systems\n\t\tat Third Post-Minkowskian Order,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.122.201603Phys. Rev.\n\t\t\tLett. 122 (2019) no. 20, 201603,\n\thttp://arxiv.org/abs/1901.04424arXiv:1901.04424 [hep-th].\n\t\n\t\n\tBern:2019crd\n\tZ. Bern, C. Cheung, R. Roiban, C.-H. Shen, M. P. Solon, and M. Zeng, “Black\n\t\tHole Binary Dynamics from the Double Copy and Effective Theory,”\n\thttp://dx.doi.org/10.1007/JHEP10(2019)206JHEP 10 (2019)\n\t\t206, http://arxiv.org/abs/1908.01493arXiv:1908.01493\n\t\t\t[hep-th].\n\t\n\tBern:2021dqo\n\tZ. Bern, J. Parra-Martinez, R. Roiban, M. S. Ruf, C.-H. Shen, M. P. Solon, and\n\tM. Zeng, “Scattering Amplitudes and Conservative Binary Dynamics at O(G^4),” http://dx.doi.org/10.1103/PhysRevLett.126.171601Phys. Rev. Lett. 126 (2021) no. 17, 171601,\n\thttp://arxiv.org/abs/2101.07254arXiv:2101.07254 [hep-th].\n\t\n\tBern:2021yeh\n\tZ. Bern, J. Parra-Martinez, R. Roiban, M. S. Ruf, C.-H. Shen, M. P. Solon, and\n\tM. Zeng, “Scattering Amplitudes, the Tail Effect, and Conservative Binary\n\t\tDynamics at O(G^4),”\n\thttp://dx.doi.org/10.1103/PhysRevLett.128.161103Phys. Rev.\n\t\t\tLett. 128 (2022) no. 16, 161103,\n\thttp://arxiv.org/abs/2112.10750arXiv:2112.10750 [hep-th].\n\t\n\tKabat:1992tb\n\tD. N. Kabat and M. Ortiz, “Eikonal quantum gravity and Planckian\n\t\tscattering,” http://dx.doi.org/10.1016/0550-3213(92)90627-NNucl. Phys. B388 (1992)  570–592,\n\thttp://arxiv.org/abs/hep-th/9203082arXiv:hep-th/9203082\n\t\t\t[hep-th].\n\t\n\t\n\tAkhoury:2013yua\n\tR. Akhoury, R. Saotome, and G. Sterman, “High Energy Scattering in\n\t\tPerturbative Quantum Gravity at Next to Leading Power,”\n\thttp://arxiv.org/abs/1308.5204arXiv:1308.5204 [hep-th].\n\t\n\t\n\tKoemansCollado:2019ggb\n\tA. Koemans Collado, P. Di Vecchia, and R. Russo, “Revisiting the second\n\t\tpost-Minkowskian eikonal and the dynamics of binary black holes,”\n\thttp://dx.doi.org/10.1103/PhysRevD.100.066028Phys. Rev. D 100 (2019) no. 6, 066028, http://arxiv.org/abs/1904.02667arXiv:1904.02667 [hep-th].\n\t\n\tCheung:2020gyp\n\tC. Cheung and M. P. Solon, “Classical gravitational scattering at 𝒪(G^3) from Feynman diagrams,”\n\thttp://dx.doi.org/10.1007/JHEP06(2020)144JHEP 06 (2020)\n\t\t144, http://arxiv.org/abs/2003.08351arXiv:2003.08351\n\t\t\t[hep-th].\n\t\n\tDiVecchia:2020ymx\n\tP. Di Vecchia, C. Heissenberg, R. Russo, and G. Veneziano, “Universality of\n\t\tultra-relativistic gravitational scattering,”\n\thttp://dx.doi.org/10.1016/j.physletb.2020.135924Phys. Lett. B\n\t\t811 (2020)  135924, http://arxiv.org/abs/2008.12743arXiv:2008.12743 [hep-th].\n\t\n\tAccettulliHuber:2020oou\n\tM. Accettulli Huber, A. Brandhuber, S. De Angelis, and G. Travaglini,\n\t“Eikonal phase matrix, deflection angle and time delay in effective field\n\t\ttheories of gravity,”\n\thttp://dx.doi.org/10.1103/PhysRevD.102.046014Phys. Rev. D 102 (2020) no. 4, 046014, http://arxiv.org/abs/2006.02375arXiv:2006.02375 [hep-th].\n\t\n\tDiVecchia:2021ndb\n\tP. Di Vecchia, C. Heissenberg, R. Russo, and G. Veneziano, “Radiation\n\t\tReaction from Soft Theorems,”\n\thttp://dx.doi.org/10.1016/j.physletb.2021.136379Phys. Lett. B\n\t\t818 (2021)  136379, http://arxiv.org/abs/2101.05772arXiv:2101.05772 [hep-th].\n\t\n\tDiVecchia:2021bdo\n\tP. Di Vecchia, C. Heissenberg, R. Russo, and G. Veneziano, “The eikonal\n\t\tapproach to gravitational scattering and radiation at 𝒪(G^3),” http://dx.doi.org/10.1007/JHEP07(2021)169JHEP\n\t\t07 (2021)  169, http://arxiv.org/abs/2104.03256arXiv:2104.03256 [hep-th].\n\t\n\tBrandhuber:2021kpo\n\tA. Brandhuber, G. Chen, G. Travaglini, and C. Wen, “A new gauge-invariant\n\t\tdouble copy for heavy-mass effective theory,”\n\thttp://dx.doi.org/10.1007/JHEP07(2021)047JHEP 07 (2021)\n\t\t047, http://arxiv.org/abs/2104.11206arXiv:2104.11206\n\t\t\t[hep-th].\n\t\n\tHeissenberg:2021tzo\n\tC. Heissenberg, “Infrared divergences and the eikonal exponentiation,”\n\thttp://dx.doi.org/10.1103/PhysRevD.104.046016Phys. Rev. D 104 (2021) no. 4, 046016, http://arxiv.org/abs/2105.04594arXiv:2105.04594 [hep-th].\n\t\n\tBjerrum-Bohr:2021vuf\n\tN. E. J. Bjerrum-Bohr, P. H. Damgaard, L. Planté, and P. Vanhove,\n\t“Classical gravity from loop amplitudes,”\n\thttp://dx.doi.org/10.1103/PhysRevD.104.026009Phys. Rev. D 104 (2021) no. 2, 026009, http://arxiv.org/abs/2104.04510arXiv:2104.04510 [hep-th].\n\t\n\tBjerrum-Bohr:2021din\n\tN. E. J. Bjerrum-Bohr, P. H. Damgaard, L. Planté, and P. Vanhove, “The\n\t\tamplitude for classical gravitational scattering at third Post-Minkowskian\n\t\torder,” http://dx.doi.org/10.1007/JHEP08(2021)172JHEP 08 (2021)  172, http://arxiv.org/abs/2105.05218arXiv:2105.05218 [hep-th].\n\t\n\tBrandhuber:2021eyq\n\tA. Brandhuber, G. Chen, G. Travaglini, and C. Wen, “Classical gravitational\n\t\tscattering from a gauge-invariant double copy,”\n\thttp://dx.doi.org/10.1007/JHEP10(2021)118JHEP 10 (2021)\n\t\t118, http://arxiv.org/abs/2108.04216arXiv:2108.04216\n\t\t\t[hep-th].\n\t\n\tDiVecchia:2022nna\n\tP. Di Vecchia, C. Heissenberg, R. Russo, and G. Veneziano, “The eikonal\n\t\toperator at arbitrary velocities I: the soft-radiation limit,”\n\thttp://dx.doi.org/10.1007/JHEP07(2022)039JHEP 07 (2022)\n\t\t039, http://arxiv.org/abs/2204.02378arXiv:2204.02378\n\t\t\t[hep-th].\n\t\n\tAmati:1987uf\n\tD. Amati, M. Ciafaloni, and G. Veneziano, “Classical and Quantum Gravity\n\t\tEffects from Planckian Energy Superstring Collisions,”\n\thttp://dx.doi.org/10.1142/S0217751X88000710Int. J. Mod. Phys.\n\t\tA3 (1988)  1615–1661.\n\t\n\t\n\tAmati:1987wq\n\tD. Amati, M. Ciafaloni, and G. Veneziano, “Superstring Collisions at\n\t\tPlanckian Energies,”\n\thttp://dx.doi.org/10.1016/0370-2693(87)90346-7Phys. Lett. B197 (1987)  81.\n\t\n\t\n\tAmati:1990xe\n\tD. Amati, M. Ciafaloni, and G. Veneziano, “Higher Order Gravitational\n\t\tDeflection and Soft Bremsstrahlung in Planckian Energy Superstring\n\t\tCollisions,”\n\thttp://dx.doi.org/10.1016/0550-3213(90)90375-NNucl. Phys. B347 (1990)  550–580.\n\t\n\t\n\tAmati:1992zb\n\tD. Amati, M. Ciafaloni, and G. Veneziano, “Planckian scattering beyond the\n\t\tsemiclassical approximation,”\n\thttp://dx.doi.org/10.1016/0370-2693(92)91366-HPhys. Lett. B289 (1992)  87–91.\n\t\n\t\n\tAmati:1993tb\n\tD. Amati, M. Ciafaloni, and G. Veneziano, “Effective action and all order\n\t\tgravitational eikonal at Planckian energies,”\n\thttp://dx.doi.org/10.1016/0550-3213(93)90367-XNucl. Phys. B403 (1993)  707–724.\n\t\n\t\n\tCiafaloni:2014esa\n\tM. Ciafaloni and D. Colferai, “Rescattering corrections and self-consistent\n\t\tmetric in Planckian scattering,”\n\thttp://dx.doi.org/10.1007/JHEP10(2014)085JHEP 1410 (2014)\n\t\t85,\n\thttp://arxiv.org/abs/1406.6540arXiv:1406.6540 [hep-th].\n\t\n\t\n\tKosower:2018adc\n\tD. A. Kosower, B. Maybee, and D. O'Connell, “Amplitudes, Observables, and\n\t\tClassical Scattering,”\n\thttp://dx.doi.org/10.1007/JHEP02(2019)137JHEP 02 (2019)\n\t\t137,\n\thttp://arxiv.org/abs/1811.10950arXiv:1811.10950 [hep-th].\n\t\n\t\n\tHerrmann:2021lqe\n\tE. Herrmann, J. Parra-Martinez, M. S. Ruf, and M. Zeng, “Gravitational\n\t\tBremsstrahlung from Reverse Unitarity,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.126.201602Phys. Rev.\n\t\t\tLett. 126 (2021) no. 20, 201602,\n\thttp://arxiv.org/abs/2101.07255arXiv:2101.07255 [hep-th].\n\t\n\tHerrmann:2021tct\n\tE. Herrmann, J. Parra-Martinez, M. S. Ruf, and M. Zeng, “Radiative classical\n\t\tgravitational observables at 𝒪(G^3) from scattering\n\t\tamplitudes,” http://dx.doi.org/10.1007/JHEP10(2021)148JHEP\n\t\t10 (2021)  148, http://arxiv.org/abs/2104.03957arXiv:2104.03957 [hep-th].\n\t\n\tCristofoli:2021vyo\n\tA. Cristofoli, R. Gonzo, D. A. Kosower, and D. O'Connell, “Waveforms from\n\t\tamplitudes,” http://dx.doi.org/10.1103/PhysRevD.106.056007Phys. Rev. D 106 (2022) no. 5, 056007,\n\thttp://arxiv.org/abs/2107.10193arXiv:2107.10193 [hep-th].\n\t\n\tBritto:2021pud\n\tR. Britto, R. Gonzo, and G. R. Jehu, “Graviton particle statistics and\n\t\tcoherent states from classical scattering amplitudes,”\n\thttp://dx.doi.org/10.1007/JHEP03(2022)214JHEP 03 (2022)\n\t\t214, http://arxiv.org/abs/2112.07036arXiv:2112.07036\n\t\t\t[hep-th].\n\t\n\tAdamo:2022rmp\n\tT. Adamo, A. Cristofoli, and A. Ilderton, “Classical physics from amplitudes\n\t\ton curved backgrounds,”\n\thttp://dx.doi.org/10.1007/JHEP08(2022)281JHEP 08 (2022)\n\t\t281, http://arxiv.org/abs/2203.13785arXiv:2203.13785\n\t\t\t[hep-th].\n\t\n\tAdamo:2022qci\n\tT. Adamo, A. Cristofoli, A. Ilderton, and S. Klisch, “All-order waveforms\n\t\tfrom amplitudes,” http://arxiv.org/abs/2210.04696arXiv:2210.04696 [hep-th].\n\t\n\tCarrasco:2021bmu\n\tJ. J. M. Carrasco and I. A. Vazquez-Holm, “Extracting Einstein from the\n\t\tloop-level double-copy,”\n\thttp://dx.doi.org/10.1007/JHEP11(2021)088JHEP 11 (2021)\n\t\t088, http://arxiv.org/abs/2108.06798arXiv:2108.06798\n\t\t\t[hep-th].\n\t\n\tCiafaloni:2015xsr\n\tM. Ciafaloni, D. Colferai, F. Coradeschi, and G. Veneziano, “Unified limiting\n\t\tform of graviton radiation at extreme energies,”\n\thttp://dx.doi.org/10.1103/PhysRevD.93.044052Phys. Rev. D93 (2016) no. 4, 044052,\n\thttp://arxiv.org/abs/1512.00281arXiv:1512.00281 [hep-th].\n\t\n\t\n\tCiafaloni:2018uwe\n\tM. Ciafaloni, D. Colferai, and G. Veneziano, “Infrared features of\n\t\tgravitational scattering and radiation in the eikonal approach,”\n\thttp://dx.doi.org/10.1103/PhysRevD.99.066008Phys. Rev. D99 (2019) no. 6, 066008,\n\thttp://arxiv.org/abs/1812.08137arXiv:1812.08137 [hep-th].\n\t\n\t\n\tAddazi:2019mjh\n\tA. Addazi, M. Bianchi, and G. Veneziano, “Soft gravitational radiation from\n\t\tultra-relativistic collisions at sub- and sub-sub-leading order,”\n\thttp://dx.doi.org/10.1007/JHEP05(2019)050JHEP 05 (2019)\n\t\t050,\n\thttp://arxiv.org/abs/1901.10986arXiv:1901.10986 [hep-th].\n\t\n\t\n\tWeinberg:1965nx\n\tS. Weinberg, “Infrared photons and gravitons,”\n\thttp://dx.doi.org/10.1103/PhysRev.140.B516Phys. Rev. 140\n\t\t(1965)  B516–B524.\n\t\n\t\n\tLuna:2017dtq\n\tA. Luna, I. Nicholson, D. O'Connell, and C. D. White, “Inelastic Black Hole\n\t\tScattering from Charged Scalar Amplitudes,”\n\thttp://dx.doi.org/10.1007/JHEP03(2018)044JHEP 03 (2018)\n\t\t044, http://arxiv.org/abs/1711.03901arXiv:1711.03901\n\t\t\t[hep-th].\n\t\n\tWeinberg:1964ew\n\tS. Weinberg, “Photons and Gravitons in S-Matrix Theory: Derivation of\n\t\tCharge Conservation and Equality of Gravitational and Inertial Mass,”\n\thttp://dx.doi.org/10.1103/PhysRev.135.B1049Phys. Rev. 135\n\t\t(1964)  B1049–B1056.\n\t\n\tStrominger:2014pwa\n\tA. Strominger and A. Zhiboedov, “Gravitational Memory, BMS Supertranslations\n\t\tand Soft Theorems,” http://dx.doi.org/10.1007/JHEP01(2016)086JHEP 01 (2016)  086, http://arxiv.org/abs/1411.5745arXiv:1411.5745 [hep-th].\n\t\n\tStrominger:2017zoo\n\tA. Strominger, Lectures on the Infrared Structure of Gravity and Gauge\n\t\t\tTheory.\n\tPrinceton University Press, 2018.\n\t<https://arxiv.org/abs/1703.05448>.\n\t\n\tCristofoli:2020uzm\n\tA. Cristofoli, P. H. Damgaard, P. Di Vecchia, and C. Heissenberg,\n\t“Second-order Post-Minkowskian scattering in arbitrary dimensions,”\n\thttp://dx.doi.org/10.1007/JHEP07(2020)122JHEP 07 (2020)\n\t\t122, http://arxiv.org/abs/2003.10274arXiv:2003.10274\n\t\t\t[hep-th].\n\t\n\tMougiakakos:2021ckm\n\tS. Mougiakakos, M. M. Riva, and F. Vernizzi, “Gravitational Bremsstrahlung in\n\t\tthe post-Minkowskian effective field theory,”\n\thttp://dx.doi.org/10.1103/PhysRevD.104.024041Phys. Rev. D 104 (2021) no. 2, 024041, http://arxiv.org/abs/2102.08339arXiv:2102.08339 [gr-qc].\n\t\n\tRiva:2021vnj\n\tM. M. Riva and F. Vernizzi, “Radiated momentum in the post-Minkowskian\n\t\tworldline approach via reverse unitarity,”\n\thttp://dx.doi.org/10.1007/JHEP11(2021)228JHEP 11 (2021)\n\t\t228, http://arxiv.org/abs/2110.10140arXiv:2110.10140\n\t\t\t[hep-th].\n\t\n\tManohar:2022dea\n\tA. V. Manohar, A. K. Ridgway, and C.-H. Shen, “Radiated Angular Momentum and\n\t\tDissipative Effects in Classical Scattering,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.129.121601Phys. Rev.\n\t\t\tLett. 129 (2022) no. 12, 121601,\n\thttp://arxiv.org/abs/2203.04283arXiv:2203.04283 [hep-th].\n\t\n\tDiVecchia:2022owy\n\tP. Di Vecchia, C. Heissenberg, and R. Russo, “Angular momentum of\n\t\tzero-frequency gravitons,”\n\thttp://dx.doi.org/10.1007/JHEP08(2022)172JHEP 08 (2022)\n\t\t172, http://arxiv.org/abs/2203.11915arXiv:2203.11915\n\t\t\t[hep-th].\n\t\n\tJakobsen:2021smu\n\tG. U. Jakobsen, G. Mogull, J. Plefka, and J. Steinhoff, “Classical\n\t\tGravitational Bremsstrahlung from a Worldline Quantum Field Theory,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.126.201103Phys. Rev.\n\t\t\tLett. 126 (2021) no. 20, 201103,\n\thttp://arxiv.org/abs/2101.12688arXiv:2101.12688 [gr-qc].\n\t\n\tBlanchet:1992br\n\tL. Blanchet and T. Damour, “Hereditary effects in gravitational radiation,”\n\thttp://dx.doi.org/10.1103/PhysRevD.46.4304Phys. Rev. D 46\n\t\t(1992)  4304–4319.\n\t\n\tBlanchet:1993ec\n\tL. Blanchet and G. Schaefer, “Gravitational wave tails and binary star\n\t\tsystems,” http://dx.doi.org/10.1088/0264-9381/10/12/026Class.\n\t\t\tQuant. Grav. 10 (1993)  2699–2721.\n\t\n\tBlanchet:2013haa\n\tL. Blanchet, “Gravitational Radiation from Post-Newtonian Sources and\n\t\tInspiralling Compact Binaries,”\n\thttp://dx.doi.org/10.12942/lrr-2014-2Living Rev. Rel. 17\n\t\t(2014)  2, http://arxiv.org/abs/1310.1528arXiv:1310.1528\n\t\t\t[gr-qc].\n\t\n\tBini:2022enm\n\tD. Bini, T. Damour, and A. Geralico, “Radiated momentum in gravitational\n\t\ttwo-body scattering including time-asymmetric effects,”\n\thttp://arxiv.org/abs/2210.07165arXiv:2210.07165 [gr-qc].\n\t\n\tLaddha:2018vbn\n\tA. Laddha and A. Sen, “Observational Signature of the Logarithmic Terms in\n\t\tthe Soft Graviton Theorem,”\n\thttp://dx.doi.org/10.1103/PhysRevD.100.024009Phys. Rev. D100 (2019) no. 2, 024009,\n\thttp://arxiv.org/abs/1806.01872arXiv:1806.01872 [hep-th].\n\t\n\t\n\tSahoo:2018lxl\n\tB. Sahoo and A. Sen, “Classical and Quantum Results on Logarithmic Terms in\n\t\tthe Soft Theorem in Four Dimensions,”\n\thttp://dx.doi.org/10.1007/JHEP02(2019)086JHEP 02 (2019)\n\t\t086,\n\thttp://arxiv.org/abs/1808.03288arXiv:1808.03288 [hep-th].\n\t\n\t\n\tSaha:2019tub\n\tA. P. Saha, B. Sahoo, and A. Sen, “Proof of the classical soft graviton\n\t\ttheorem in D = 4,” http://dx.doi.org/10.1007/JHEP06(2020)153JHEP 06 (2020)  153, http://arxiv.org/abs/1912.06413arXiv:1912.06413 [hep-th].\n\t\n\tSahoo:2021ctw\n\tB. Sahoo and A. Sen, “Classical soft graviton theorem rewritten,”\n\thttp://dx.doi.org/10.1007/JHEP01(2022)077JHEP 01 (2022)\n\t\t077, http://arxiv.org/abs/2105.08739arXiv:2105.08739\n\t\t\t[hep-th].\n\t\n\tBrandhuber:2023hhy\n\tA. Brandhuber, G. R. Brown, G. Chen, S. De Angelis, J. Gowdy, and\n\tG. Travaglini, “One-loop Gravitational Bremsstrahlung and Waveforms from a\n\t\tHeavy-Mass Effective Field Theory,”\n\thttp://arxiv.org/abs/2303.06111arXiv:2303.06111 [hep-th].\n\t\n\tDonal   Co\n\tA. Elkhidir, D. O'Connell, M. Sergola, and I. Vazquez-Holm, “Radiation and\n\treaction at one loop.” To appear.\n\t\n\tHerderschee:2023fxh\n\tA. Herderschee, R. Roiban, and F. Teng, “The Sub-Leading Scattering Waveform\n\t\tfrom Amplitudes,” http://arxiv.org/abs/2303.06112arXiv:2303.06112 [hep-th].\n\t\n\tBrownTalk\n\tG. Brown, “Gravitational bremsstrahlung from a heavy-mass effective field\n\t\ttheory.”\n\t<https://indico.phys.ethz.ch/event/22/contributions/193/attachments/140/201/Graham\n\t\n\tRoibanTalk\n\tR. Roiban, “Gravitational waves through the Amplitudes lens.”\n\t<https://indico.phys.ethz.ch/event/22/contributions/142/attachments/142/223/Roiban_Talk.pdf>.\n\t\n\tSergolaTalk\n\tM. Sergola, “Radiation and reaction at one loop.”\n\t<https://indico.phys.ethz.ch/event/22/contributions/219/attachments/171/244/matteo\n\t\n\tLee:2012cn\n\tR. N. Lee, “Presenting LiteRed: a tool for the Loop InTEgrals REDuction,”\n\thttp://arxiv.org/abs/1212.2685arXiv:1212.2685 [hep-ph].\n\t\n\tLee:2013mka\n\tR. N. Lee, “LiteRed 1.4: a powerful tool for reduction of multiloop\n\t\tintegrals,” http://dx.doi.org/10.1088/1742-6596/523/1/012059J.\n\t\t\tPhys. Conf. Ser. 523 (2014)  012059,\n\thttp://arxiv.org/abs/1310.1145arXiv:1310.1145 [hep-ph].\n\t\n\tPanzer:2014caa\n\tE. Panzer, “Algorithms for the symbolic integration of hyperlogarithms with\n\t\tapplications to Feynman integrals,”\n\thttp://dx.doi.org/10.1016/j.cpc.2014.10.019Comput. Phys.\n\t\t\tCommun. 188 (2015)  148–166,\n\thttp://arxiv.org/abs/1403.3385arXiv:1403.3385 [hep-th].\n\t\n\tTarasov:1996br\n\tO. V. Tarasov, “Connection between Feynman integrals having different values\n\t\tof the space-time dimension,”\n\thttp://dx.doi.org/10.1103/PhysRevD.54.6479Phys. Rev. D 54\n\t\t(1996)  6479–6490, http://arxiv.org/abs/hep-th/9606018arXiv:hep-th/9606018.\n\t\n\tLee:2009dh\n\tR. N. Lee, “Space-time dimensionality D as complex variable: Calculating loop\n\t\tintegrals using dimensional recurrence relation and analytical properties\n\t\twith respect to D,”\n\thttp://dx.doi.org/10.1016/j.nuclphysb.2009.12.025Nucl. Phys. B\n\t\t830 (2010)  474–492, http://arxiv.org/abs/0911.0252arXiv:0911.0252 [hep-ph].\n\t\n\tLee:2010wea\n\tR. N. Lee, “Calculating multiloop integrals using dimensional recurrence\n\t\trelation and D-analyticity,”\n\thttp://dx.doi.org/10.1016/j.nuclphysbps.2010.08.032Nucl. Phys. B\n\t\t\tProc. Suppl. 205-206 (2010)  135–140,\n\thttp://arxiv.org/abs/1007.2256arXiv:1007.2256 [hep-ph].\n\t\n\tWare:2013zja\n\tJ. Ware, R. Saotome, and R. Akhoury, “Construction of an asymptotic S matrix\n\t\tfor perturbative quantum gravity,”\n\thttp://dx.doi.org/10.1007/JHEP10(2013)159JHEP 10 (2013)\n\t\t159, http://arxiv.org/abs/1308.6285arXiv:1308.6285 [hep-th].\n\t\n\tGoldberger:2016iau\n\tW. D. Goldberger and A. K. Ridgway, “Radiation and the classical double copy\n\t\tfor color charges,”\n\thttp://dx.doi.org/10.1103/PhysRevD.95.125010Phys. Rev. D 95 (2017) no. 12, 125010, http://arxiv.org/abs/1611.03493arXiv:1611.03493 [hep-th].\n\t\n\tJakobsen:2021lvp\n\tG. U. Jakobsen, G. Mogull, J. Plefka, and J. Steinhoff, “Gravitational\n\t\tBremsstrahlung and Hidden Supersymmetry of Spinning Bodies,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.128.011101Phys. Rev.\n\t\t\tLett. 128 (2022) no. 1, 011101,\n\thttp://arxiv.org/abs/2106.10256arXiv:2106.10256 [hep-th].\n\t\n\tParra-Martinez:2020dzs\n\tJ. Parra-Martinez, M. S. Ruf, and M. Zeng, “Extremal black hole scattering at\n\t\t𝒪(G^3): graviton dominance, eikonal exponentiation, and\n\t\tdifferential equations,”\n\thttp://dx.doi.org/10.1007/JHEP11(2020)023JHEP 11 (2020)\n\t\t023, http://arxiv.org/abs/2005.04236arXiv:2005.04236\n\t\t\t[hep-th].\n\t\n\tAnastasiou:2002qz\n\tC. Anastasiou, L. J. Dixon, and K. Melnikov, “NLO Higgs boson rapidity\n\t\tdistributions at hadron colliders,”\n\thttp://dx.doi.org/10.1016/S0920-5632(03)80168-8Nucl. Phys. B\n\t\t\tProc. Suppl. 116 (2003)  193–197,\n\thttp://arxiv.org/abs/hep-ph/0211141arXiv:hep-ph/0211141.\n\t\n\tAnastasiou:2002yz\n\tC. Anastasiou and K. Melnikov, “Higgs boson production at hadron colliders in\n\t\tNNLO QCD,” http://dx.doi.org/10.1016/S0550-3213(02)00837-4Nucl. Phys. B 646 (2002)  220–256,\n\thttp://arxiv.org/abs/hep-ph/0207004arXiv:hep-ph/0207004.\n\t\n\tAnastasiou:2003yy\n\tC. Anastasiou, L. J. Dixon, K. Melnikov, and F. Petriello, “Dilepton rapidity\n\t\tdistribution in the Drell-Yan process at NNLO in QCD,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.91.182002Phys. Rev. Lett.\n\t\t91 (2003)  182002, http://arxiv.org/abs/hep-ph/0306192arXiv:hep-ph/0306192.\n\t\n\tAnastasiou:2015yha\n\tC. Anastasiou, C. Duhr, F. Dulat, E. Furlan, F. Herzog, and B. Mistlberger,\n\t“Soft expansion of double-real-virtual corrections to Higgs production at\n\t\tN^3LO,” http://dx.doi.org/10.1007/JHEP08(2015)051JHEP\n\t\t08 (2015)  051, http://arxiv.org/abs/1505.04110arXiv:1505.04110 [hep-ph].\n\t\n\tDonnay:2022ijr\n\tL. Donnay, E. Esmaeili, and C. Heissenberg, “p-Forms on the Celestial\n\t\tSphere,” http://arxiv.org/abs/2212.03060arXiv:2212.03060\n\t\t\t[hep-th].\n\t\n\tDlapa:2021npj\n\tC. Dlapa, G. Kälin, Z. Liu, and R. A. Porto, “Dynamics of binary systems to\n\t\tfourth Post-Minkowskian order from the effective field theory approach,”\n\thttp://dx.doi.org/10.1016/j.physletb.2022.137203Phys. Lett. B\n\t\t831 (2022)  137203, http://arxiv.org/abs/2106.08276arXiv:2106.08276 [hep-th].\n\t\n\tMougiakakos:2022sic\n\tS. Mougiakakos, M. M. Riva, and F. Vernizzi, “Gravitational Bremsstrahlung\n\t\twith Tidal Effects in the Post-Minkowskian Expansion,”\n\thttp://dx.doi.org/10.1103/PhysRevLett.129.121101Phys. Rev.\n\t\t\tLett. 129 (2022) no. 12, 121101,\n\thttp://arxiv.org/abs/2204.06556arXiv:2204.06556 [hep-th].\n\t\n\tRiva:2022fru\n\tM. M. Riva, F. Vernizzi, and L. K. Wong, “Gravitational bremsstrahlung from\n\t\tspinning binaries in the post-Minkowskian expansion,”\n\thttp://dx.doi.org/10.1103/PhysRevD.106.044013Phys. Rev. D 106 (2022) no. 4, 044013, http://arxiv.org/abs/2205.15295arXiv:2205.15295 [hep-th].\n\t\n\tHeissenberg:2022tsn\n\tC. Heissenberg, “Angular Momentum Loss Due to Tidal Effects in the\n\t\tPost-Minkowskian Expansion,” http://arxiv.org/abs/2210.15689arXiv:2210.15689 [hep-th].\n\t\n\tDlapa:2022lmu\n\tC. Dlapa, G. Kälin, Z. Liu, J. Neef, and R. A. Porto, “Radiation Reaction\n\t\tand Gravitational Waves at Fourth Post-Minkowskian Order,”\n\thttp://arxiv.org/abs/2210.05541arXiv:2210.05541 [hep-th].\n\t\n\tDamour:2020tta\n\tT. Damour, “Radiative contribution to classical gravitational scattering at\n\t\tthe third order in G,”\n\thttp://dx.doi.org/10.1103/PhysRevD.102.124008Phys. Rev. D 102 (2020) no. 12, 124008, http://arxiv.org/abs/2010.01641arXiv:2010.01641 [gr-qc].\n\t\n\n\n\n>>"}