{"entry_id": "http://arxiv.org/abs/2303.07004v1", "published": "20230313110126", "title": "Incommensurable matter-wave jets in quasi-1D geometry", "authors": ["Tadej Mežnaršič", "Rok Žitko", "Katja Gosar", "Katja Arh", "Matevž Jug", "Erik Zupanič", "Peter Jeglič"], "primary_category": "cond-mat.quant-gas", "categories": ["cond-mat.quant-gas", "nlin.PS", "physics.atom-ph", "quant-ph"], "text": "\n\n\n\n\n[]tadej.meznarsic@ijs.si\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\n\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\n\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\nFaculty of mathematics and physics, University of Ljubljana, Jadranska 19, SI-1000 Ljubljana, Slovenia\n\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\nFaculty of mathematics and physics, University of Ljubljana, Jadranska 19, SI-1000 Ljubljana, Slovenia\n\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\nFaculty of mathematics and physics, University of Ljubljana, Jadranska 19, SI-1000 Ljubljana, Slovenia\n\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\n[]peter.jeglic@ijs.si\nJožef Stefan Institute, Jamova 39, SI-1000 Ljubljana, Slovenia\n\n\n\n\n\n\nWe experimentally show spontaneous formation of incommensurable “golden” 1+√(5)/2 matter-wave jets in a Bose-Einstein condensate (BEC) subjected to single frequency interaction modulation.\nWe study the formation of higher order jets and corresponding incommensurable density waves in quasi one dimensional (1D) geometry with the help of numerical 1D Gross-Pitaevskii equation simulation.\nWe explore the process of jet formation for a large range of modulation amplitudes and frequencies and present a phase diagram for jet formation. \n\n\nIncommensurable matter-wave jets in quasi-1D geometry\n    Peter Jeglič\n    March 30, 2023\n=====================================================\n\n\n\nIncommensurability is encountered aperiodic crystals with incommensurable phases <cit.>, charge and spin structures <cit.>, twisted moiré bilayer experiments <cit.> with Hofstadter butterfly energy structure <cit.> and surface layers <cit.>.\nIn the context of cold atoms, incommensurable optical lattices have been used to study wavefunction localization phenomena in disordered potentials within the Aubry-André model <cit.>.\n\nIn this Letter we experimentally show spontaneous formation of incommensurable density waves inside a BEC confined in a quasi one-dimensional (1D) potential evidenced via the emission of matter-wave jets.\nPrevious studies of matter-wave jets in two dimensions have revealed the formation of density waves inside the condensate prior to the emission of jets and explained the process of formation of higher-order jets <cit.>. \nWe expand on our previous experiments with matter-wave jets in a quasi-1D potential <cit.> by experimentally and numerically exploring the formation of  incommensurable “golden” jets and other higher-order jets in a quasi-1D BEC under a single-frequency interaction modulation. \n\n\n\n\nWe start by preparing a BEC in a crossed dipole trap, from which we release it into a channel with radial frequency ω_r =  [2π· 90]Hz. \nSimultaneously, we change the interaction between the atoms to a_dc close to zero via a Feshbach resonance <cit.>.\nTo induce the emission of matter-wave jets, we modulate the magnetic field and therefore the interaction between the atoms as a(t) = a_dc + a_acsin (ω t) for time t_p, where a_ac and ω are the amplitude and the frequency of the modulation, respectively  <cit.>.\nWe leave them to evolve for t_e in the channel and then take an absorption picture after a [15]ms time-of-flight.\nIn addition to previously observed jets of first (J1) and second order (J2) <cit.>, we observe two pairs of jets with dimensionless velocities \n\n    u_G2 = v_G2/v_0 =  ±1±√(5)/2,\n\nwhere v_0 = √(ħω / m) is the velocity of the first-order jets (J1), ħ is the reduced Planck constant, and m is the mass of an atom. \nWe name these “golden jets” (G2) for their golden ratio relative velocities.\nThe irrational velocity ratio between first order and golden jets implies the existence of two incommensurable density waves inside the condensate prior to jet emission.\nFig. <ref>(a) shows three experimental realizations of golden jets.\nTheir origin can be understood from the conservation of energy\nmv_1^2/2 + mv_2^2/2 + ħω = mv_1^' 2/2 + mv_2^' 2/2, and momentum: mv_1 + mv_2 = mv_1^' + mv_2^',\nwhere v_i (v_i^') are the initial (final) velocities of the atoms.\nA pair of atoms in J1 is formed from a pair of colliding atoms from the original condensate (J0) by absorbing one quantum of energy from the modulating magnetic field.\nSimilarly, a pair J0-J2 forms from a pair of J1 atoms with the same velocity and a pair G2-G2 from a pair J0-J1.\nIn general the final velocities of the resulting jets are \n\n    u^'_1,2 = (u_1 + u_2) ±√((u_1-u_2)^2 + 4)/2,\n\nwhere u_1,2 are the initial velocities of the atom pair.\nWith each absorbed photon the number of possible jets increases.\nBy the number of photons that an atom in a jet has absorbed we define the order of the jets: the initial BEC is zeroth order, J1 are first order, J2, G2 and others that form from them are second order and so on, see Fig. <ref>(b) and Table <ref>.\nThe  total number of jets increases as a double exponential with order, going as 1, 3, 11, 109, 11605,, and can be approximately calculated as 1.7949^2^n (from the fit up to n=4, where n is the order).\n\n\n\n\nWhile J1 and J2 are quite easily observed in the experiment, G2 appear very rarely and we haven't been able to observe jets with relative velocity ±√(2) (D2, the other second order jets).\nAs can be seen in Fig. <ref>(a) the golden jets are not necessarily symmetric around J0 and change in each experimental run despite the symmetry of involved processes.\nWe attribute this to the asymmetry in the initial BEC which fluctuates between experimental runs.\nTo  understand why these jets are so difficult to observe we need to consider the Hamiltonian for the jet formation process.\nWe write it in the rotating frame without the fast varying terms <cit.>\n\n    H = ħν∑_𝐪_1,𝐪_2,Δ𝐪( \n     a_𝐪_1 + Δ𝐪^† a_𝐪_2 - Δ𝐪^† a_𝐪_1 a_𝐪_2 + h.c.),\n\nwhere ν = 2πħ a_ac/mV (V is the condensate volume) and a_𝐪 (a_𝐪^†) is the annihilation (creation) operator of an atom with momentum ħ𝐪.\nThe Hamiltonian takes into account only resonant terms, assumes photon operators to be C-numbers and the condensate to be non-depleting (Bogoliubov approx.) (see <cit.>). \n\nWe can approximate the initial time evolution of jets with momentum ħ𝐪 by taking the first non-zero derivative \nn_𝐪^(j) = (i/ħ) [H,n_𝐪^(j-1)] \n, n_𝐪^(1) = (i/ħ) [H,n_𝐪]\nof the expected value of its number operator \n⟨ n_𝐪|=⟩⟨ a_𝐪^† a_𝐪|$⟩, wherejis the order of the derivative.\nThe results for the first and second order jets are presented in Table <ref>.\nFor a realistic experimental valueN_0=4000it is clear that G2 grows much slower than J1 and J2, with D2 even farther behind.\n\n\n\n \n\nDue to the rarity of golden jets in the experiments we turn to numerical simulations of 1D Gross-Pitaevskii equation (GPE) to better understand the conditions for their formation.\nLike in our previous work <cit.>, we start with a soliton as the initial state and modulate the interaction parameterk(t) = k_dc+k_acsin(ωt)for a timet_p = 8πwith different frequenciesωand amplitudesk_ac.\nWe leave the wavefunction to evolve fort_eand look at the density profilen(x)=|ψ(x)|^2.\nIn the simulations, timetis given in units1/ω_r,ωin unitsω_r, interatomic interaction ask=Na/a_rand distances in unitsa_r = √(ħ/mω_r).\n \nAn example of the final density profile can be seen in Fig. <ref>(a) where all visible jets are marked.\nIn contrast with the experiment, we observe additional jets of third order J3 and G3 which form from J2-J2 and J1-J2 pairs, respectively (see Table <ref>).\nBecause J2 are so prominent in the simulations (compared to the experiment) we almost always observe G2, G3, and J3 together.\nTo quantify the size of jets, we calculate the integrals over a fixed interval around each peak in the density profile, which gives the fraction of the atoms in jets of each order (total integral is normalized,∫|ψ(x)|^2 dx = 1).\nThe fraction in the central peak J0 only starts decreasing after the threshold amplitude for J1 formation is reached, as can be seen in Fig. <ref>(b).\nThe J1 first increases steeply with amplitude and then levels out due to J0 depletion and losses to the higher-order processes.\nIt can be seen that only the first order has a sharp threshold (Fig. <ref>(b)), while the higher orders increase smoothly from zero once the first order exists (Fig. <ref>(c)).\nD2 are not observed even in simulations due to the onset of a wide background\nat high amplitudes needed to create them (discussed below).\n\nWhen we combine the integrals for the whole simulated region, we can construct a phase diagram with distinct regions in which different jets are visible, as shown in Fig. <ref>(a).\nWe declare that a new region begins when the integral for the next jet exceeds 0.002.\nWe choose this value so that it is smaller than the integral of the jets at high modulation amplitudes and much larger than the noise in the simulation.\nAs the amplitudek_acincreases, additional jets are enabled and we transition into a new region.\nAs discussed above the transitions are actually continuous and not discrete, except from the “no jets” to the “J1” region.\n\n\n\n\nFig. <ref>(b) shows the final profiles for a fixed frequencyω= 12.\nThe onset of J1, J2 and other jets can be clearly seen as the modulation amplitude increases.\nFor very high amplitudes the discrete jets start disappearing in the increasingly uniform background of a multitude of higher order jets.\nThe observed spread from the single momentum mode to a wide momentum distribution resembles the generation of supercontinua in nonlinear optical media, where various instabilities cause an initially narrow frequency spectrum to disperse into a wide continuum <cit.>.\nThe boundary for the supercontinuum can be determined from the median of the final density profilen(x).\nIt stays close to zero when we only have discrete jets and when it increases beyond 0.00025 we say that it transitioned into the supercontinuum region (of course the transition is actually gradual, the threshold value was chosen to be above numerical noise and visually without separate jets.\nThe threshold boundary for J1 formation is proportional toω^1/2, as previously reported <cit.>.\nThe fits to lower boundaries for J2 and J3 regions also giveω^1/2dependences, while the boundaries for golden jets (G2+G3) and the supercontinuum region go as∼ω^0.8.\n\nTo find the reason for the absence of the supercontinuum in the experiment, we must look at what the simulation does not take into account.\nAs we increase the amplitude in the experiment, the number of atoms in J0 and J1 starts decreasing and the incoherent background between the jets becomes stronger, as seen in Fig. <ref>.\nHowever, these do not appear to be signs of a supercontinuum, but are more likely due to partial collapses of the BEC, evidenced by the decreased total number of atoms observed.\nThe cause of the collapses are probably the strong attractive interactions the BEC is subjected to during the modulation.\nThe momentum distribution of the incoherent background also remains of the same width for increasing amplitude and does not increase beyond the position of J2 jets as the supercontinuum would.\nAtom losses and increased fraction of incoherent background, formed by the excited atoms that are not part of the jets <cit.>, both absent from the simulation, decrease the effective modulation amplitude preventing the supercontinuum from forming.\n\n\n\n\nIn this work we explored the spontaneous formation of higher-order jets inside the BEC in a quasi-1D geometry  experimentally and with simulations. \nWe explain the selectivity of the formation of second order jets and therefore the scarcity of less probable incommensurable modes in the experiment.\nNumerically, we explore the jet formation for a wide range of modulation frequencies and amplitudes, resulting in a phase diagram of possible jets, while also uncovering an unexpected supercontinuum region. \nThe supercontinuum likely arises due to the double-exponential growth of the number of possible modes, while the wavenumber only grows linearly, resulting in a densely populated momentum space.\nThe supercontinuum is potentially experimentally observable if the three-body losses and the incoherent background could be reduced, by increasing the radial trapping frequency, making the system more 1D.\nIn multispecies experiments the incommensurable density waves inside one species could be used as a disordered potential for the other species, if the jets are prevented from escaping the trap (provided there exist appropriate Feshbach resonances).\nThis would eliminate the need for an external disordered potential and even a regular lattice that is usually needed to capture impurities, which act as a source of disorder  <cit.>.\n\n\n\nWe thank Cheng Chin and Matjaž Gomilšek for helpful discussions.\nWe would also like to thank Samo Beguš and Davorin Kotnik for their help with electronics.\nThis work was supported by the Slovenian Research Agency (research core Grants No. P1-0125, No. P1-0099 and P1-0416, and research projects No. J2-8191 and No. J2-2514).\n\napsrev4-2"}