{"entry_id": "http://arxiv.org/abs/2303.07002v1", "published": "20230313105946", "title": "The Localized Union-of-Balls Bifiltration", "authors": ["Michael Kerber", "Matthias Söls"], "primary_category": "cs.CG", "categories": ["cs.CG", "math.AT"], "text": "\n\n\n\nReview on the Feasibility of Adversarial Evasion Attacks and Defenses \n for Network Intrusion Detection Systems\n    [\n    March 30, 2023\n===============================================================================================================\n\n\n\n\n \nWe propose an extension of the classical union-of-balls filtration\nof persistent homology: fixing a point q, we focus our attention\nto a ball centered at q whose radius is controlled by a second\nscale parameter. We discuss an absolute variant, where the union\nis just restricted to the q-ball, and a relative variant where \nthe homology of the q-ball relative to its boundary is considered.\nInterestingly, these natural constructions lead to bifiltered\nsimplicial complexes which are not k-critical for any finite k.\nNevertheless, we demonstrate that these bifiltrations can be computed\nexactly and efficiently, and we provide a prototypical implementation\nusing the CGAL library. \nWe also argue that \nsome of the recent algorithmic advances for 2-parameter persistence\n(which usually assume k-criticality for some finite k)\ncarry over to the ∞-critical case.\n\n\n\n\n§ INTRODUCTION\n\n\nIn the past years, the theory of multi-parameter persistent homology\nhas gained increasing popularity. This theory extends the theory \nof (single-parameter) persistent homology by filtering a data set\nwith several scale parameters and observing how the topological properties\nchange when altering the ensemble of parameters. \nMost standard examples\n\n\ndefine two scale parameters, where the first one is based on the distance\nwithin the data set and the second one on its local density.\nThe motivation for that choice is an increased robustness against outliers\nin the data set.\n\n\n\n    Localized bifiltrations.\n\n\nWe suggest a different type of bifiltration where the second parameter controls\nthe locality of the data. Let P be a finite set of data points in Euclidean space\n^d and q∈^d a further point that we call the center.\nFor two real values s,r≥ 0, we define\n\n    L_s,r=(⋃_p∈ P B_s(p))∩ B_r(q)\n\nwhere B_α(x) is the ball of radius √(α) centered at x (taking the square root\nis not standard, but will be convenient later). In other words,\nwe consider the union of balls around the data points (as in many applications\nof persistent homology), but we limit attention to a neighborhood around the center.\nIt is immediate that L_s,r⊆ L_s',r' for s≤ s' and r≤ r'\nso L:=(L_s,r)_s,r≥ 0 is a nested sequence of spaces. \nWe define the collection of spaces L to be the absolute localized bifiltration, see Figure <ref> for an illustration.\nThe goal of this paper is to compute a combinatorial representation\nof this bifiltration: a bifiltration of simplicial complexes\nwhich is homotopy equivalent to the absolute localized bifiltration\nat every choice (s,r) of parameters.\n\nAlternatively, we consider the variant where all points of L_s,r\non the boundary of B_r(q) are identified (see Figure <ref>). This version gives rise to a bifiltration that we call\nthe relative localized bifiltration.\nThis sometimes reveals more local information around q\n(as in Figure <ref>)\nand is more frequently used in applications (see related work below).\nAgain, we are asking for an equivalent simplicial description.\n\n\n\n\n\nAn interesting feature of these localized bifiltrations is that \ntopological changes arise along curves in the two-dimensional parameter space spanned by s and r. \nThe perhaps simplest example is obtained by setting d=1, q=0 and P={1}. Then, L_s,r≠∅\nif and only if r+s≥ 1. Hence, the empty and non-empty regions\nare separated by a line in the parameter space.\nThis implies that any equivalent simplicial bifiltration is \n∞-critical, meaning that there\nis no integer k for which it is k-critical. See Figure <ref> for an illustration of k-criticality.\n\n\n\n\n\n\n\nGiven that ∞-critical simplicial bifiltrations are obtained from such a simple construction, we pose the question whether such bifiltrations allow for an efficient algorithmic treatment.\nIn this paper, we focus on the first step, the generation of such bifiltrations.\nThis requires to compute, for every simplex its entry curve, that is,\nthe boundary between the region of the parameter space where the simplex\nis present and where it is not present (see Figure <ref>).\nA natural idea might be to reduce to the k-critical case, approximating the entry curve by\na staircase with k steps (a sequence of horizontal and vertical segments).\nHowever, to ensure an accurate approximation,\nthe value of k might be quite high which complicates the algorithmic treatment and introduces\nanother parameter to the problem.\nAlso, resorting to an approximation is unsatisfying, especially for the generation step which\nis only the first step in the computational pipeline: while a discretization might suffice\nfor many tasks, it restricts the possibilities of subsequent steps. We therefore advocate\nthe computation of an exact representation instead.\n\n\n\n    Contributions.\n\n\nWe give algorithms to compute absolute and relative localized bifiltrations exactly\nand efficiently. The entry time of every simplex into the bifiltration is described by a curve in the 2-dimensional\nparameter space that consists of line segments and parabolic arcs.\n\nIn the absolute case, a simplicial bifiltration is obtained \nusing alpha complexes (also known as Delaunay complexes) and the Persistent Nerve Theorem. \nTo determine the entry curve\nof a (Delaunay) simplex, we solve a convex minimization problem on the dual Voronoi polytope\nparameterized in s. We show that the solutions yield a polygonal chain\nwithin the Voronoi polytope, and every line segment translates to one arc\nof the entry curve in the parameter space. We also describe an efficient\nalgorithm to compute the entry curves of all simplices\nin amortized constant time per simplex.\n\nIn the relative case, we use a variant of the Persistent Nerve Theorem for pairs.\nHowever, the Voronoi partition does not satisfy the prerequisites of this Nerve theorem;\nwe show how\nto subdivide the Voronoi cells for planar inputs to overcome this problem.\nThe entry curves of simplices are determined\nby the same convex optimization problem as in the absolute case, but now asking\nfor a maximal solution, and can be treated with similar methods.\n\nWe provide a prototypical implementation[<https://bitbucket.org/mkerber/demo_absolute_2d/src/master/>] \nof the absolute case in the plane,\nbased on the Cgal library. This software allows us to visualize\nthe entry curves of localized bifiltrations and serves as a starting point\nfor subsequent algorithmic studies of ∞-critical bifiltrations.\nWe argue that an algorithmic treatment is in reach by showing that barcode\ntemplates of such bifiltrations are computable with the same strategy \nas in the 1-critical case.\n\n\n\n    Related work.\n\n\nApplying the homology functor with field coefficients to absolute (relative) localized bifiltrations leads to persistence modules which we call absolute (relative) localized persistence modules. \nHorizontal and vertical slices of the relative localized persistence module are known as persistent local homology (PLH) modules in literature, see the survey <cit.>. \n\nA persistent version of local homology was first considered by Bendich et al. <cit.> to infer the local homology of a stratified space given by a point cloud. Their PLH modules are defined via extended persistence diagrams <cit.> and the inherent two parameters (s and r in our notation) are taken into account through vineyards <cit.>.\nThe study of stratified spaces with the help of PLH is continued in <cit.>, where points of stratified spaces are clustered into same strata. In <cit.> and <cit.>, PLH modules are computed with modified alpha complexes. Skraba and Wang <cit.> define two variants of PLH and show how both of them can be computed via approximations by Vietoris-Rips complexes. A further application is given by Ahmed, Fasy and Wenk who define a PLH based distance on graphs used for road network comparison <cit.>. \n\nThe work mentioned above relies on relative versions of PLH. A persistence module similar to a horizontal slice of an absolute localized persistence module is used by Stolz <cit.> for outlier robust landmark selection. Von Rohrscheidt and Rieck <cit.> consider (samples of) tri-persistence modules to measure how far a given neighborhood of a point is from being Euclidean to obtain the \"manifoldness\" of point clouds. These tri-persistence modules are obtained by removing the open ball B^o_t(q) from L_s,r. PLH modules of a filtration (L_s,r∩∂ B_r(q))_s≥ 0 in combination with multi-scale local principal component analysis are used in <cit.> to extract relevant features for machine learning from a data set. Other applications of variants of persistent local (co)homology include <cit.>, <cit.> and <cit.>. \n\nOur work suggests bifiltrations for multi-parameter persistence. Other natural constructions of bifiltrations resulting from point-set inputs\nare the density-Rips bifiltration <cit.>, the degree-Rips bifiltration <cit.>\nand the multi-cover filtration <cit.>; \nsee <cit.> for a comparison of these approaches in terms of stability properties.\nIn all these approaches, the second scale parameter models the density of a point,\nwhich is different from our approach where it rather models the locality with respect to a point q.\n\nComputational questions in multi-parameter persistence have received a lot of attention recently,\nincluding algorithms for visualization <cit.>, decomposition <cit.>,\ncompression <cit.> and distances <cit.>.\nIn all aforementioned approaches, the input is assumed to be a simplicial bifiltration that is at least k-critical\n(and usually even 1-critical), so none of these algorithms is readily applicable to the filtrations\ncomputed in this work.\n\nThe ∞-critical bifiltrations appearing in our work yield persistence modules that fulfill the tameness conditions of Miller<cit.>. In <cit.> the foundations to vastly generalize the aforementioned k-critical setting are laid. However, it is of rather theoretical nature and in contrast, we propose an inital setup for a concrete algorithmic treatment which might be followed along the suggested route in <cit.> (see Section 20).\n\n\n\n§ THE ABSOLUTE CASE\n\n\n\nWe need the following concepts to formally state our problem:\nFor s,r∈, we write (s,r)≤ (s',r') if s≤ s' and r≤ r'.\nA bifiltration is a collection of topological spaces X:=(X_s,r)_s,r≥ 0\nsuch that X_s,r⊆ X_s',r' whenever (s,r)≤ (s',r').\nA bifiltration is finite simplicial if each X_s,r is a subcomplex\nof some simplicial complex .\n\nA map of bifiltrations ϕ:X→ Y \nis a collection of continuous maps (ϕ_s,r:X_s,r→ Y_s,r)_s,r≥ 0\nthat commute with the inclusion maps of X and Y. Two bifiltrations are equivalent\nif there is a map ϕ:X→ Y such that each ϕ_s,r gives a homotopy equivalence (i.e., there exists a map ψ:Y→ X\nwith each ψ_s,r being a homotopy inverse to ϕ_s,r).\n\nFor a finite point set P in ^d, called sites from now on, and a center point q∈^d (not necessarily a site), \nwe consider the bifiltration L defined by\n\n\n    L_s,r=(⋃_p∈ P B_s(p))∩ B_r(q)\n\n\nwith B_s(p) the set of points in distance at most √(s) from p.\nOur goal is to compute a finite simplicial bifiltration that is equivalent to L.\n\n\n\n    Localized alpha complexes.\n\n\nThe filtration L_s,∞ is the union-of-balls filtration,\none of the standard filtration types in persistent homology (with one parameter).\nIt is also well-known that alpha complexes <cit.>\nprovide a practically feasible way of computing an equivalent simplicial representation\n(at least if d is small). We summarize this technique next; the only difference\nis that we localize the alpha complexes with respect to B_r(q), which introduces\na second parameter but results in no theoretical problem:\n\nFor a site p, its Voronoi region is the set of points\nin ^d for which p is a closest site:\n\n    (p):={x∈^d|x-p≤x-p' ∀ p'∈ P}.\n\n\nEvery (p) is closed and convex. The restricted cover _s,r:={U_s,r(p)| p∈ P} is given by\n\n\n    U_s,r(p):=B_s(p)∩ B_r(q)∩(p).\n\n\nFor every s,r≥ 0, we have that ⋃_p∈ P U_s,r(p)=L_s,r. The localized alpha complex\nis the nerve of _s,r, that is, \nthe abstract simplicial complex that encodes the intersection pattern of the restricted cover elements:\n\n\n    A_s,r:= _s,r= {{p_0,…,p_k}⊆ P| U_s,r(p_0)∩…∩ U_s,r(p_k)≠∅}.\n\n\nSee Figure <ref> for an illustration.\nAll U_s,r(p) are closed and convex, and U_s,r(p)⊆ U_s',r'(p) for (s,r)≤ (s',r').\nWith these conditions, the Persistent Nerve Theorem <cit.> ensures that\nthere is a homotopy equivalence between L_s,r and A_s,r for every s,r≥ 0, and moreover, these\nhomotopy equivalences commute with the inclusion maps of L_s,r and A_s,r.\nHence, the bifiltrations are equivalent. \n\n\n\nAssuming that the sites are in generic position, that is, not more than k+2 sites lie on a common k-dimensional\nsphere for 1≤ k≤ d-1, the complexes A_s,r are subcomplexes of the Delaunay triangulation of P,\nwhose size is known to be at most O(n^⌈ d/2⌉) <cit.> and which can be computed efficiently, especially\nin dimensions 2 and 3<cit.>.\n\n\n\n    Entry curves.\n\n\nWe further specify what it means to “compute” the finite simplicial bifiltration A:\ncomputing the Delaunay triangulation of P yields all simplices belonging to A.\nFor each simplex σ∈ A, we want to compute an explicit representation of\nits active region, defined as\n\n    R_σ:={(s,t)∈^2|σ∈ A_s,r}.\n\nThe active region is closed under ≤ in ^2, meaning that\nif (x,y)∈ R_σ, the whole upper-right quadrant anchored at (x,y) also belongs to R_σ.\nWe call the boundary of the active region the entry curve of σ. See Figure <ref>\nfor an illustration of a family of entry curves.\n\n\n\nTo understand the structure of the entry curve, we define for σ=(p_0,…,p_k)\nthe polytope V_σ:=(p_0)∩…∩(p_k). Then, letting p be some point of σ, we have that\nσ∈ A_s,r if and only if V_σ∩ B_s(p)∩ B_r(q)≠∅.\nSince V_σ is convex, there is a unique point p̂∈ V_σ as well as q̂∈ V_σ with minimal distance to p as well as q.\nWe write s_0:=p-p̂^2, s_1:=p-q̂^2\nand r_1:=q-q̂^2.\n\n\nThe active region R_σ lies in the half-plane s≥ s_0.\nMoreover, restricted to the half-plane s≥ s_1, R_σ\nis bounded by the line r=r_1, that is, the area above that line\nis in R_σ and the area below the line is not.\n\n\nThe first part follows because by definition, for s<s_0, the intersection V_σ∩ B_s(p)\nis empty. Likewise, for r<r_1, the intersection V_σ∩ B_r(q) is empty, so R_σ\nis contained in the half-plane r≥ r_1.\nMoreover, for s≥ s_1, the point q̂ lies in V_σ∩ B_s(p), so the intersection\nV_σ∩ B_s(p)∩ B_r(q) is non-empty if and only if q̂∈ B_r(q), which\nis equivalent to r≥ r_1.\n\n\nIt remains to compute the entry curve in the s-range [s_0,s_1].\nFor that, we want to compute for each such s, what is the minimal r-value for which\nV_σ∩ B_s(p)∩ B_r(q)≠∅.\nThis minimal r-value, in turn, is simply the distance of q to the set V_σ∩ B_s(p).\nWe will study this geometric problem in the next subsection; the solution will give us a\nparameterization of the boundary of the active region R_σ by line segments and parabolic arcs.\n\n\n\n    Minimizing paths.\n\n\nSlightly generalizing the setup of the previous paragraph, \nlet p,q∈^d, and let V be a closed convex polytope in ^d, that is, the intersection\nof finitely many closed half-spaces in ^d. Let p̂,q̂ be the points in V with minimal distance to p\nand q, respectively. Note that p=p̂ is possible if p∈ V, and p̂∈∂ V otherwise. This holds likewise for q. We set s_0:=p-p̂^2 and s_1:=p-q̂^2. For any s∈ [s_0,s_1],\nthe intersection V∩ B_s(p) is not empty, and we let γ_s denote the point in that intersection\nthat is closest to q. See Figure <ref> for an illustration of the case d=2.\nThe proofs of the next two statements are elementary and only exploit convexity of V and that consequently,\nthe distance function to q restricted to V has only one local minimum.\nThe proofs are in Appendix <ref>.\n\n\n\n\n\nWe have that p-γ_s^2=s. In particular, the function p-γ_s^2 is\nstrictly increasing for s∈ [s_0,s_1]. \n\n\n\n\n\nThe function γ: [s_0,s_1]→^d, s↦γ_s is continuous and injective.\n\n\nIt follows that γ defines a path in ^d which we call the minimizing path for (V,p,q).\nA minimizing path in the plane is displayed in Figure <ref> (in blue).\nBecause of the following lemma, we henceforth assume wlog that we only consider instances (V,p,q) where V is full-dimensional.\nThe statement follows easily by the Pythagorean Theorem – see Appendix <ref>.\n\n\n\n\nLet V be a polytope in ^d contained in an affine subspace W. Let p,q∈^d and p',q'\nbe the orthogonal projections of p and q to W, respectively. Then, the minimizing path of (V,p,q)\nequals the minimizing path of (V,p',q') up to a shift in the parameterization.\n\n\nA face of a convex polytope V is the intersection of V with a hyperplane H\nsuch that all of V lies in one of the closed half-spaces induced by H.\n\n\nLet γ be the minimizing path of (V,p,q) and let F be a face of V. \nThen, γ∩ F, the part of γ that runs along F, is a subset of the minimizing path of (F,p,q).\n\n\nLet x be a point on γ∩ F. By definition, x=γ_s for some s, that is, x is the closest point to q\nin V∩ B_s(p). Since F⊆ V, x is also the closest point to q in F∩ B_s(p), so x lies on \nthe minimizing path of F.\n\n\nBy the Face Lemma, we know that the part of the minimizing path of (V,p,q) that runs along ∂ V coincides\nwith the minimizing paths of its faces. It remains to understand the minimizing\npath in the interior of V. The central concept to understand this sub-path is the following simple definition:\n\n\nThe bridge of (V,p,q) is the (possibly empty) line segment V∩pq,\nwhere pq is the line segment of p and q.\n\n\n\nLet γ denote the minimizing path of (V,p,q).\nThen, the bridge is a subset of γ. Moreover, every point on γ that does not belong to the bridge lies on ∂ V.\n\n\nFix a point x on the bridge and let s:=x-p^2. It is simple to verify that s∈ [s_0,s_1].\nWe argue that x=γ_s: indeed, the point x is the closest point to q in B_s(p) (as it lies on pq),\nand since it also lies in V, it minimizes the distance to q for the subset V∩ B_s(p). That proves\nthe first part. \n\nFor the second part, assume for a contradiction the existence of a point y=γ_s for some s∈ [s_0,s_1]\nthat is in the interior of V, but not on the bridge. Since y must lie on the boundary of V∩ B_s(p), and is not on ∂ V,\nit must lie in the interior of some spherical patch of ∂ B_s(p). The distance function to q, restricted to the (d-1)-dimensional \nsphere ∂ B_s(p)\nhas no local minimum except at the intersection of pq with the boundary, but since y does not lie on the bridge,\nit is not that minimizing point. Hence, moving in some direction along the spherical patch\ndecreases the distance to q, contradicting the assumption that y=γ_s.\n\n\nThe Bridge Lemma tells us that the minimizing path runs through the interior of V at most along a single line segment, the bridge; before and after the bridge, it might have sub-paths on the boundary. Figure <ref> gives an example\nwhere all three sub-paths are present.\n\n\n\nThe minimizing path of (V,p,q) is a simple path starting at p̂ and ending at q̂,\nand every point on the path lies on the bridge of some face of V.\nIn particular, the path is a polygonal chain.\n\n\nIt is clear that the path goes from p̂ to q̂ and is simple because γ is injective.\nSince every point x on the path lies in the relative interior of some face F, the Face Lemma implies that\nx lies on the minimizing path of (F,p',q') (with p', q' the projections in the subspace of F),\nand the Bridge lemma implies that x lies on the bridge of F. Hence, the path is contained\nin a union of finitely many line segments, and therefore is a polygonal path.\n\n\n\n\n\n    Algorithm.\n\n\nLet σ be a Delaunay simplex, V its Voronoi polytope, and p\none of the closest sites. We follow the natural approach to compute the\nminimizing path for (V,p,q) first. Then, for every line segment ab\non the minimizing path, we use the parameterization\n\n    s=p-((1-t)a+tb)^2          r=q-((1-t)a+tb)^2,\n\nwhich for t∈ [0,1] yields a branch of the entry curve.\nBoth s and r are quadratic\npolynomials in t, therefore the resulting curve is a parabola or line – see Appendix <ref> for a simple proof.\n\nTo compute the minimizing path, we outline the construction\nand defer details to Appendix <ref>:\nwe compute the points p̂ and q̂\nwhich are the start- and endpoint of that path.\nThen we compute the bridges of V and of all its\nfaces. This yields a collection of line segments\nand we compute the induced graph whose vertices are endpoints of bridges\n(in this graph, bridges can be split into sub-segments if the endpoint\nof another bridge lies in the interior). This graph can be directed\nsuch that the distance to p increases along every edge.\nIn this graph, we walk from p̂ to q̂ to compute the minimizing\npath; the only required predicate is to determine the next edge to follow\nat a vertex x. This is the edge\nalong which the distance to q drops the most\nwhich can be easily determined by\nevaluating the gradient of the (squared) distance function to q\nrestricted to the outgoing edges.\n\nWe sketch the complexity analysis of this algorithm,\nagain defering to Appendix <ref> for details:\nLet N be the size of the Delaunay triangulation.\nComputing all bridges over all Delaunay simplices is linear in N.\nWriting f for the number of faces of V, the graph constructed for V\nconsists of f bridges. Since bridges do not (properly) cross,\nthe constructed graph for V has still O(f) edges, and the traversal\nto find the minimizing path is done in O(f) as well.\nThis immediately yields the complexity bound.\n\n\n\nLet P be n points in general position in ^d where d is constant.\nLet N be the size of the Delaunay triangulation of P.\nWe can compute the entry curves of all Delaunay simplices in time \nO(N).\n\n\n\n\n\n§ IMPLEMENTATION\n\n\n\nWe have implemented the case of absolute localized bifiltrations in the plane\nusing the Cgal library. Our code computes the Delaunay triangulation <cit.>\nand computes the minimizing path for each simplex, using a simplified\nalgorithm for the plane. \nFor the minimizing path of a Delaunay vertex, we refer to Figure <ref> for an illustration:\nThe path is obtained by \nstarting in p and following the bridge until the boundary is hit. The path must continue in one of the two\ndirections along the boundary and follows the boundary until q̂ is met (see the red path in Fig. <ref>). The decision on which direction\nto follow can be answered by projecting q to the supporting line of the boundary segment that is hit by the bridge \nand going towards that projection point q' (the bridge might also hit the boundary in a vertex; we ignore\nthis degenerate case in our prototype).\n\nAll geometric predicates required for this implementation are readily available in the geometric kernel of Cgal <cit.>.\nFor the absolute, planar problem, it was possible to work exclusively with the Delaunay triangulation,\navoiding the explicit construction of the Voronoi polytope, but this will probably not be possible for other variants.\nIn either case, the exact geometric computation paradigm of Cgal guarantees that the obtained parameterization\nis an exact representation of the simplicial bifiltration for the input data.\n\n\n\n\n\n§ THE RELATIVE CASE\n\n\n\n\n\n    Relative localized bifiltrations.\n \n\nTo better fit the situation studied in this section, we re-define (s,r)≤ (s',r') if s≤ s' and r≥ r'. \nWith this poset, we can define bifiltrations, finite simplicial bifiltrations, and equivalence in an analogous way as in Section <ref>.\nWe extend these notions to pairs:\nA bifiltration of pairs is a collection of pairs of topological spaces (or simplicial complexes) (X,A):=(X_s,r,A_s,r)_s,r≥ 0 such that X and A are bifiltrations\nand A_s,r⊆ X_s,r. We have a finite simplicial bifiltration of pairs if X is a finite simplicial bifiltration,\nand A_s,r is a subcomplex of X_s,r (which implies that also A is finite simplicial).\nWe call two bifiltrations of pairs (X,A) and (Y,B) equivalent if there is an equivalence ϕ:X→ Y such that \nthe restriction maps (ϕ|_A_s,r)_s,r≥ 0 yield an equivalence of A and B.\n\nFor a finite point set P, a center q and s,r≥ 0, set L_s=⋃_p∈ P B_s(p) for the union of balls\nand rq for the open ball around the center. Then the relative localized bifiltration is the following collection of pairs of spaces\n\n    := (L_s,L_s∖rq)_s,r≥ 0.\n\nIndeed, it can be checked easily that this construction yields a bifiltration of spaces (notice the contravariance in the r-parameter).\nOur computational task is to find a finite simplicial bifiltration of pairs equivalent to it.\n\nWhat is the significance of this bifiltration? Note first that in general, a pair of bifiltrations (X,A) induces\na (relative) persistence module (H_n(X_s,r,A_s,r))_s,r≥ 0, leading to\n\n    H_n()=(H_n(L_s,L_s∖rq))_s,r≥ 0,\n\nwhich we call the localized relative persistence module. \nBy excision and the fact that all pairs are “good pairs” <cit.>, \nwe have isomorphisms <cit.>\n\n    H_n(L_s,L_s∖rq)≅ H_n(L_s∩ B_r(q),L_s ∩∂ B_r(q))≅H̃_n(L_s∩ B_r(q)/ (L_s ∩∂ B_r(q)))\n\nwith H̃ denoting reduced homology. These isomorphisms imply that the relative localized persistence module corresponds point-wise to the space considered\nin Figure <ref> (right). Moreover, the excision isomorphism commutes with the inclusion maps L_s⊆ L_s' for s≤ s'\nwhich implies that the rows of the localized relative persistence module (with fixed r) are isomorphic to the module\n(H_n(L_s∩ B_r(q),L_s ∩∂ B_r(q)))_s≥ 0\nwhich was studied in <cit.>,<cit.>, <cit.>. Also the columns of the bifiltration (with s fixed) have been studied earlier in <cit.>.\nHence, the localized relative bifiltration encodes both types of modules of local persistent homology studied in previous work (see Appendix <ref> for a summary of basic notions).\n\nWe also remark that the computation of the relative localized persistence module can easily be reduced to the case of absolute homology\nvia the well-known coning construction <cit.>, yielding isomorphisms\nH_n(X,A)≅H̃_n(X∪ω∗ A)\nfor pairs of topological spaces (X,A) with ω denoting a new vertex. These isomorphisms are functorial, yielding\nan isomorphism between the relative persistence module of a pair of bifiltrations and the absolute persistence module of a bifiltration (using reduced homology).\nMoreover, if the pair (X,A) is finite simplicial, so is X∪ω∗ A.\n\n\n\n    Nerves of pairs.\n\n\nTo obtain an equivalent pair of finite simplicial complexes, we will define suitable covers for L_s and L_s∖rq\nand construct the corresponding nerve complexes. For a (compact) topological space X, a cover _X of closed sets is good\nif the intersection of any subset of cover elements of _X is empty or contractible. In particular, a closed convex cover (as used in Section <ref>)\nis good because convex sets are contractible, and a non-empty intersection of convex sets is convex.\n\nFor a pair (X,A) of spaces with A⊆ X closed, a closed cover _X of X induces a cover _A of A by restricting every cover element to A.\nWe say that the cover _X is good for the pair (X,A) if _X and _A are both good covers. With this definition, we obtain the following\nversion of the Persistent Nerve Theorem; it follows directly from the results of <cit.>\nand we summarize the argument in Appendix <ref>.\n\n \n\t\n\tLet A⊆ X ⊆ℝ^d and _X be a good cover for the pair (X,A). Then the spaces X and _X\nare equivalent via a map ϕ:X→ _X,\nand the restriction map of ϕ to A yields a homotopy equivalence of A and _A.\nMoreover, the map ϕ is functorial which means that if X⊆ X' and A⊆ A', the cover _X' is obtained by enlarging each\nelement of _X (or leaving it unchanged) and is a good cover for the pair (X',A'), then the maps ϕ and ϕ' commute with the inclusion maps X→ X' and \n_X→ _X', and the restricted maps to A and A' commute\nwith the inclusion maps A→ A' and _A→ _A'.\n\n\nThis (rather bulky) theorem implies the following simple corollary in our situation: If we can find a filtration of (good) covers _s for the union of balls L_s,\nsuch that for every r≥ 0, the induced cover _s,r on L_s∖qr is a good cover, then the pair (Nrv _s,Nrv _s,r)_s,r≥ 0\nis a finite simplicial bifiltration of pairs equivalent to the localized relative bifiltration.\n\n\n\n    A good cover in the plane.\n\n\nA natural attempt to construct a good cover for (L_s,L_s∖rq) would be to consider the cover induced by the Voronoi regions of P,\nnamely {(p)∩ B_s(p) | p ∈ P},\nsimilar as in Section <ref>.\nWhile this cover is good for L_s, it is not good for the pair, because the removal of an (open) ball can lead to non-contractible cover elements and intersections;\nFigure <ref> illustrates several problems.\n\n\n\nWhile the Voronoi cover itself does not work, we show that after suitably subdividing the Voronoi cells into convex pieces,\nthe induced cover is good for the pair (L_s,L_s∖rq).\nWe will give the construction and will informally explain en passant why it removes all obstructions for being good\nthat are visible in Figure <ref>.\n\nThe construction has two parts: first, we split the Voronoi cell (p) that contains q into two pieces,\nby cutting along the line pq (we assume for simplicity that q lies in the interior of some Voronoi cell).\nThis initial cut ensures in particular that q does not lie in the interior of a cover set anymore; this is \na necessary condition because otherwise, removing a sufficiently small open ball rq\nyields a non-simply connected set in the induced cover for L_s∖rq (compare\nradius r_1 in Figure <ref>). This cut also avoids\nconfigurations where (p)∩ B_s(p) gets disconnected because B_r(q) is touching B_s(p)\nfrom the inside; we refer to the proof of Lemma <ref> in Appendix <ref> for details.\n\nTo understand the second part of the construction,\nwe call a line segment or ray e problematic if\nthe distance function to q, restricted to e,\nhas a local minimum in the interior of e.\nThis is equivalent to the property that the orthogonal\nprojection of q on the supporting line of the segment lies on e.\nObserve in Figure <ref> that both for radius r_2\nand r_3, the issue comes from a problematic edge (for r_2, the edge between V_1 and V_2\nis problematic, for r_3, the edge between V_2 and V_3 is problematic).\n\nIn the second part of the construction, we go over all problematic edges in the Voronoi diagram of P.\nFor every such edge e, let q̂ denote the orthogonal projection of q on that edge. \nThe line segment qq̂ cuts through one of the polygons P incident to e,\nand we cut P using this line segment into two parts. This ends the description of the subdivision.\nWe denote the set of 2-dimensional polygons obtained as S_2(P,q).\nSee Figure <ref> for an illustration. Note that the cuts introduced here\ncut every problematic edge into two non-problematic sub-edges\nand also avoids that a polygon gets disconnected when removing B_r(q).\n\n\n\n\nImportantly, all cuts introduced are line segments on lines through q. This implies that no two of the cuts\ncan cross.  Moreover, no edge arising from a cut can be problematic. This leads to the following theorem,\nwhose complete proof is given in Appendix <ref>\n\n\n\nThe cover {L_s∩ V| V∈ S_2(P,q)} is good for (L_s,L_s∖rq)_s,r≥ 0.\n\n\nEvery cut increases the number of polygons by one, and the number\nof edges by at most 3. Since we introduce at most one cut per Voronoi edge, plus one initial cut,\nthe complexity of the subdivision is O(n). \n\n\n\n\n\n    Entry curves.\n\n\nIt is left to compute the entry curves of every simplex in the nerve induced by S_2(P,q).\nThe described method generalizes also to higher dimensions assuming a subdivision inducing a good cover\nis available, but we keep the description planar for simplicity.\nIn this case, every simplex σ represents a polygon, edge, or vertex of the planar subdivision defined by S_2(P,q),\nwhich we denote by V.\nNote that σ has two entry curves: one for L_s and one for L_s∖rq.\nThe former is simple to describe: since L_s does not depend on r, the entry curve is determined by the line\nof the form s=p-p̂^2, with p a closest site to V and p̂ the closest point to p in V.\n\nFor L_s∖rq, we fix s and search for the largest r such that B_s(p)∩ V∖rq\nis not empty. This is equivalent to finding the point on V∩ B_s(p) with maximal distance to q,\nwhich is the opposite problem to what was considered in Section <ref>.\nFor brevity, we restrict the discussion to the case of bounded polytopes V, postponing\nthe (straight-forward) extension to unbounded polytopes to Appendix <ref>.\nWe set q^∗ as a point in V with maximal distance to q, s_0:=p-p̂^2 \nand s_1:=p-q^∗^2. For s∈ [s_0,s_1], we define Γ_s to be a point with maximal\ndistance to q in the set V∩ B_s(p).\n\n\n\n\nThe maximizing problem is not as well-behaved as the minimization problem:\nfor general polytopes V, the point Γ_s might not be unique, and there can be discontinuities in the image of Γ; \nsee Figure <ref> for an example.\nHowever, such problems are caused by local extrema on the boundary\nof B_s(p)∩ V which can be excluded for the polytopes of S_2(P,q). Hence,\nwe can define the maximizing curve Γ:[s_0,s_1]→Γ_s and infer (proof in Appendix):\n\n\n\nFor V∈ S_2(P,q), the point Γ_s is unique and the curve Γ is continuous.\n\n\nThe structure of the curve Γ is similar to its minimizing counterpart γ. The Dimension Reduction\nLemma and the Face Lemma also hold for Γ, with identical proofs. We define the anti-bridge\nas the intersection of V with the ray emanating from p in the direction -pq (see Figure <ref>).\nWith that, we obtain the statement that the anti-bridge is part of Γ, and the rest of Γ lies\non ∂ V, with an analogue proof as for the bridge lemma. This leads to\n\n\n\n\n\n\nThe maximizing path Γ is a subset of the union of all anti-bridges over all faces of V. In particular,\nit is a polygonal chain.\n\n\nThe theorem also infers a way to compute the entry curve of σ\nconstructing and traversing a graph obtained by anti-bridges. We omit further details which are analogous to the minimization case, and yield the same bound as in Theorem <ref>.\n\n\n\n§ BARCODE TEMPLATES FOR INFINITY-CRITICAL BIFILTRATIONS\n\n\nWe demonstrate in this section that representing a bifiltration via non-linear entry curves\ndoes not prevent an efficient algorithmic treatment. We focus on the case of the\ncomputation of barcode templates as introduced by Lesnick and Wright <cit.>.\nThe idea is as follows: restricting a bifiltration to a line of positive slope (called a slice)\ngives a filtration in one parameter, and hence a persistence barcode. While we cannot associate a persistence barcode\nto the bifiltration <cit.>, the collection of barcodes over all slices yields\na wealth of information about the bifiltration. The software library RIVET[<https://rivet.readthedocs.io/en/latest/index.html#>]\nprovides a visualization of these sliced barcodes for finite simplicial bifiltrations. To speed up the visualization step,\nRIVET precomputes all combinatorial barcodes, that is, it clusters slices together on which the simplices enter the filtration\nin the same order – it is well-known that the barcode combinatorially only depends on this order, not the concrete critical values.\nThe barcode template is then, roughly speaking, the collection of all these combinatorial barcodes.\nBarcode templates have also been used for exact computations of the matching distance of bifiltrations <cit.>.\n\nAll aforementioned approaches assume the bifiltration to be 1-critical, which means in our notation that the active region\nof every simplex σ\nis the upper-right quadrant of a point v_σ∈^2.\nWe argue that this restriction is unnecessary: indeed, the combinatorial barcode is determined by the order in which the slice\nintersects the entry curves of all simplices. For a finite set M of points in ℝ^2, a non-vertical line partitions M into (M_↑,M_↓,M_on),\ndenoting the points above the line, below the line, and on the line, respectively.\n\n\nLet I denote the set of intersection points of pairs of entry curves. If two slices have the same partition of I, they have the same\ncombinatorial barcode.\n\n\nLet ℓ_1, ℓ_2 be slices with different barcodes. This means, that there is at least one pair of simplices (σ,τ)\nfor which the entry curves are intersected in a different order. When continuously transforming ℓ_1 into ℓ_2, we therefore\nhave to cross an intersection point of these entry curves, and hence the partition changes.\n\n\nUsing standard point-line duality <cit.> which is known to preserve above/below orders of points and lines,\nwe obtain at once:\n\n\nLet dual(I) be the line arrangement obtained by the dual of all points in I. Every region of this arrangement\nis dual to a set of slices with the same combinatorial barcode.\n\n\nWe mention that this result generalizes the well-studied 1-critical case: \nthe entry curve of every σ consists of a vertical and a horizontal ray emanating\nfrom a point v_σ in this case, and the curves of σ and τ intersect in the join of v_σ and v_τ.\nHence I is the union of all pairwise joins of the critical values of all vertices.\n\nComputationally, the only complication consists in computing the intersection points of the entry curves, which have a more\ncomplicated structure than in the 1-critical case. However, if the curves are semi-algebraic\n(and of small degree), as in the case studied in this paper, computing these intersection\npoints is feasible and efficient software is available <cit.>.\n\n\n\n\n§ CONCLUSION\n\n\nLocalized persistence modules are, on the one hand, a suitable set of examples \nfor further algorithmic work in the pipeline of ∞-critical multi-parameter\npersistence. On the other hand, because one-dimensional sub-modules\nof the module have been considered in the context of applications,\nwe hope that the module itself can be of use in applied contexts.\n\nThere are many natural follow-up questions for our work: most directly,\nthe only obstacle to extend our relative approach in higher dimensions\nis the subdivision scheme which is currently only proved for ^2.\nAnother future task is the implementation of our approaches beyond\nthe absolute case in the plane. Such implementations are well in-reach,\ngiven that all underlying geometric primitives are provided\nby the Cgal library.\n\nOne aspect we have not touched upon is stability. \nA natural assumption is that if P and P' as well as the centers q and q' \nare -close in the L_∞-distance, then the localized bifiltrations\nfor (P,q) and (P',q') are -interleaved <cit.>. \nThis claim is true (and straight-forward to prove) if we re-define the notion B_α(x)\nto be ball of radius α around x (instead of √(α)\nas in this work). While our non-standard notion for balls prevents us from \nmaking this claim, we point out that it simplifies the description of the\nentry curves. In the standard notion, the parameterization \nin (<ref>) in Section <ref> \nwould involve square roots and therefore does not yield parabolic arcs. We decided\nto favor the simplicity of the entry curves in this work.\n\nWe hope that our initial efforts will result in an algorithmic\ntreatment of multi-parameter persistence that can cope with ∞-critical\nfiltrations with comparable efficiency as in the 1-parameter case.\nA natural next question is whether minimal presentations\nof ∞-critical filtrations can be computed efficiently,\ngeneralizing the recent approaches from <cit.>.\n\nLocalizing the union-of-balls filtration in a center yields more fine-grained\ninformation about the point set in the vicinity of the center. We pose the\nquestion whether and how this information can be leveraged in the numerous\napplication domains of topological data analysis. We speculate that even in\nsituations where the data set does not contain a canonical center location,\nconsidering a sample of centers and analyzing the ensemble of localized\nbifiltrations yields a more discriminative topological proxy then\nthe union-of-balls filtration.\n\n\n\n\n\n\n\n\n§ MISSING PROOFS\n\n\n\n\n\n    Proof of Lemma <ref>.\n\n\nNote first that the statement is true for s=s_1 by definition.\nAlso by definition, γ_s∈ B_s(p), so p-γ_s^2≤ s. Assume for a contradiction that p-γ_s^2<s\nfor some s∈ [s_0,s_1). This implies that γ_s lies in the interior of B_s(p) so\nthere exists an >0 small enough, such that B_(γ_s)⊂ B_s(p), and therefore also\nB_(γ_s)∩ V ⊂ B_s(p)∩ V. However, the distance function to q,\nrestricted to V has no local minimum except at q̂ because of convexity,\nand γ_s≠q̂ for s<s_1. Therefore, there exists a point in B_(γ_s)∩ V that is closer to q\nthan γ_s, contradicting the definition of γ_s.\n\n\n\n\n    Proof of Lemma <ref>.\n\n\nFor continuity, consider a sequence (s_n)_n∈ that converges to s.\nThe sequence (γ_s_n) is bounded because every γ_s lies in B_s_1(p).\nIt hence suffices to show that any accumulation point of the sequence (γ_s_n)\nequals γ_s.\n\nSo, consider an accumulation point x∈^d and assume for a contradiction that x≠γ_s. \nLet (t_n) denote a subsequence\nof (s_n) such that (γ_t_n) converges to x. Since all γ_t_n\nlie in V, and V is closed, it follows that x∈ V. Moreover, since p-γ_t_n^2=t_n\nby the previous lemma and because the squared distance function to p is continuous, we\nhave that p-x^2=s. Hence, x∈ V∩ B_s(p). Since γ_s∈ V∩ B_s(p) as well,\nby convexity, the line segment xγ_s lies in that set too. Notice that the squared distance function\nto p restricted to segments has no local maximum, thus the squared distance to p is strictly smaller than\ns throughout the interior of xγ_s.\n\nSince the closest point to q in V∩ B_s(p) is unique and x≠γ_s is assumed, we have\nthat q-x^2>q-γ_s^2. The continuity of the distance function implies that there exist\nneighborhoods U_x around x and U_γ_s around γ_s such that the distance from q to\nany point in U_x is strictly greater than the distance from q to any point in U_γ_s.\nPick a point y∈ U_γ_s∩ xγ_s. As said before, its squared distance to p is s'<s.\nOn the other hand, since the γ_t_n converge to x and t_n converge to s, we can find\nsome m∈ such that s'<t_m and γ_t_m lies in U_x. By definition, γ_t_m\nis the closest point to q in V∩ B_t_m(p). But y lies in V∩ B_s'(p)⊆ V∩ B_t_m(p)\nas well, and its distance to q is smaller, a contradiction. This proves the the continuity.\nInjectivity follows directly from the previous lemma.\n\n\n\n    Proof of Lemma <ref>.\n\nBy the Pythagorean Theorem, the point minimizing the distance to q also minimizes the distance to q',\nimplying that the minimizing paths of (V,p,q) and (V,p,q') are the same. Furthermore, with δ:=√(p-p'),\nwe have that V∩ B_s(p)=V∩ B_s-δ(p'). Hence, the minimizing paths of (V,p,q') and (V,p',q')\ndiffer only in a parameter shift by δ.\n\n\n\n    Proof of Theorem <ref>.\n\n\nWe use the notation of <cit.>. According to their Definition 1.2, in the category\nof covered spaces, there is a morphism (A,U_A)→ (X,U_X). This gives rise to the following\ncommutative diagram of spaces\n\n\n    A [hookrightarrow]d   [swap]lρ^(A)_SBlowup(U_A) rρ^(A)_N[hookrightarrow]d   Nrv (U_A)[hookrightarrow]d\n    \n    X    [swap]lρ^(X)_SBlowup(U_X) rρ^(X)_N   Nrv (U_X)\n\nwhere Blowup(X) is the blowup complex of the cover, which can be thought of as a product space of the space X and the nerve Nrv(U_X),\nand ρ_S, ρ_N are the canonical projection maps. \nBecause the vertical arrows are inclusions, it follows that ρ^(A)_S is the restriction of ρ^(X)_S to A, and the same holds\nfor the ρ_N maps.\nSince the covers U_A and U_X are both good, the maps ρ_N are homotopy equivalences\n(Thm 5.9, part 2a in <cit.>). Moreover, our covers are “sufficiently nice” to guarantee all prerequisites of Corollary 5.16 in <cit.>,\ncertifying that also the maps ρ_S are homotopy equivalences. Finally, taking the homotopy inverse τ^(X)_S to ρ^(X)_S, we can observe\nat once that its restriction to A is a homotopy inverse to ρ^(A)_S. The same holds for the homotopy inverse of ρ^(X)_N, proving the first part\nof the theorem. The functoriality follows from exactly the same diagram and argumentation, using the morphisms between the covered spaces (X,U_X)→ (X',U_X')\nand (A,U_A)→ (A',U_A'), respectively.\n\n\n\n\n    Proof of Theorem <ref>.\n\n\nThe major technical result required is that for any polygon in S_2(P,q), no\nadditional local extrema appear when intersecting with L_s.\n\n\n\nFor each polygon V∈ S_2(P,q), if V∩ L_s≠∅, the distance function to q restricted to the boundary of V∩ L_s \ncontains only one local minimum. Consequently, it contains also only one local maximum, and the set\n\n    ∂(V∩ L_s)∖rq\n\nis empty or connected for every r≥ 0.\n\n\nWith that statement, it is simple to prove that the cover induced by S_2(P,q) is good for the pair (L_s,L_s∖rq):\nFirst of all, it is clearly good for L_s since all induced cover elements are convex.\nFor L_s∖rq, the intersection of two cover elements is a subset of the intersection of two polygons in S_2(P,q).\nBy our construction, no such edge has a local minimum of the distance function in its interior, implying that removing rq\nleaves a connected line segment as intersection, implying that the intersection of two cover elements is contractible.\nHigher-order intersections happen only in points which is good too.\n\nWe are left to argue that each cover element is contractible. So, fix V∈ S_2(P,q) and consider, for (s,r) fixed,\nthe induced cover element V∩ L_s∖rq.  \nEvery point in this set is path-connected to a point of ∂(V∩ L_s) that is not in rq,\njust by moving in the direction opposite to q until the boundary is hit. Lemma <ref> certifies\nthat all these boundary points are connected to each other, implying that the cover element is connected.\n\nIt remains to show that every cover element is simply connected. Indeed, V∩ L_s is simply connected,\nand the only possibility to change this would be if rq would entirely lie with V.\nHowever, the initial cut in the construction of S_2(P,q) makes sure that q is not in\nthe interior of any polygon. This completes the proof of Theorem <ref>;\nit is only left to show Lemma <ref>.\n\n\nWe first observe that V∩ L_s=V∩ B_s(p) for a (unique) site p\nbecause V is subset of a Voronoi region of some site p. Hence, ∂(V∩ B_s(p)) consists\nof line segments which are part of ∂ V and circular arcs that belong to B_s(p). Clearly,\nthe value γ_s, which is defined as the (unique) point in minimal distance to q, lies on the boundary\n(otherwise, q would be inside V which is excluded by the construction of S_2(P,q)) and is a local minimum.\nWe argue that there is no other local minimum.\n\nAssume that x is a local minimum on ∂(V∩ B_s(p)).\nLet r:=q-x^2. There are three cases for the location of x which all lead to the conclusion that x=γ_s:\n\n\n  * x lies in the interior of a line segment e of ∂ V. This implies that x is the projection of q on the Voronoi edge e'\nthat contains e, and this edge is problematic by definition. By construction, a cut is performed at x, for the polygon adjacent to V\nthat is closer to q. Because x lies in the interior of a line segment of ∂ V by assumption, V must be the polygon\nfurther away from q. But that implies that x is the only intersection point of B_r(q) and V, and so, x=γ_s.\n\n  * x lies at a vertex of ∂ (V∩ B_s(p)). There are two sub-cases: if x is a point where two line segments meet (with an angle\nof less than π), then B_r(q) can only touch V in x if x is the only point in the intersection of V and B_r(q).\nThis means again that x=γ_s. If x is a point where a line segment and a circular arc of B_s(p) meet, the angle\nbetween the line segment and the tangent of the circle in x is necessarily smaller than π, and the same argument applies.\n\n  * The last case is that x lies in the interior of a circular arc of B_s(p).\nNote that the line pq intersects B_s(p) in two points, and the\nonly possible location of a local minimum is the intersection point closer to q. Now, if q lies inside B_s(p), this\nimplies that q is closer to p than x, and since x lies in the Voronoi region of p, so does q. It follows\nthat V arose from the Voronoi region that contains q, and the initial cut of S_2(P,q) has cut that region using the\nline pq. This is a contradiction to the assumption that x lies in the interior of a circular arc.\nHence, q lies on or outside B_s(p), and thus x lies on the line segment pq. Therefore, x lies on the\nbridge of (V,p,q), and the Bridge lemma implies that x=γ_s.\n\n\nThis proves the first part of the Lemma. Since the ∂(V∩ B_s(p)) is homeomorphic to a circle, two local maxima\nwould imply two local minima, contradicting the first part. Finally, since ∂(V∩ L_s)∖rq\nis simply a superlevel set of the distance function, two components would imply the existence of two local maxima,\none in each component.\n\n\n\n\n\n    Proof of Lemma <ref>.\n\n\nThe following two properties of V∈ S_2(P,q) are direct consequences of Lemma <ref>.\n\n\nThe furthest point to q on V∩ B_s(p) is unique.\n\n\nNote first that every furthest point must necessarily be on the boundary, and is also a furthest point on the boundary.\nIf there were two distinct furthest points, they are in particular local maxima of the distance function to q\non the boundary, which contradicts Lemma <ref>.\n\n\n\nThe distance to q has no local maximum except at q^∗.\n\n\nAssume that there is a second local maximum. Again, both that maximum and q^∗ are also local maxima on the boundary.\nFor s large enough, this implies that the two points are also local maxima of V∩ B_s(p), again\ncontradicting Lemma <ref>.\n\n\nRe-inspecting the proof of Lemma <ref>, the second lemma lets us invoke\nthe analogous argument to prove that p-Γ_s^2=s for all s such that p-p̂^2≤ s≤p-q^∗^2.\nThe first lemma guarantees that the proof of Lemma <ref> is valid also for the maximizing path Γ.\n\n\n\n\n\n§ COMPUTATIONAL DETAILS\n\n\n\n\n\n    Building bridges.\n\n\nWe have given a point set P⊂^d, a Delaunay simplex σ={p_0,…,p_k} and a q∈^d\nwith d a constant. We write V for the intersection of the Voronoi regions of p_0,…,p_k. We set p:=p_0 and\nwant to construct the bridge of (V,p,q).\n\nFirst, we compute the projections p' and q' of p and q to the subspace S that supports V. This can be done by iteratively projecting\nto bisector hyperplanes (p,p_1),…,(p,p_k) in O(k)=O(d)=O(1) time.\nV is the intersection of half-spaces in S, and they can be easily obtained\nthrough the co-facets of σ: If {p_0,…,p_k,p_k+1} is a co-facet,\nthe corresponding half-space is bounded by the intersection of the bisector of p and p_k+1 and contains p.\n\nLet f=f_σ be the number of co-facets of σ. To compute the bridge,\nwe parameterize the line through p' and q' via tp'+(1-t)q'\nand compute  for every bounding half-space of V its intersection\nwith the p'q'-line (which requires to compute the intersection of the line\nwith the bounding hyperplane in S). This yields a parameter range\n(∞,t_0] or [t_0,∞), and the intersection of all these\nranges yields an interval [t_1,t_2] which we intersect with [0,1]\nto obtain the bridge. This costs O(f) time.\n\nHence, with N the number of simplices in the Delaunay triangulation,\nthe total cost to compute all bridges is\n\n    ∑_σ∈Del(P) O(f_σ) = O(∑_σ∈Del(P)#{co-facets of σ})=O(∑_σ∈Del(P)#{facets of σ})\n       =O(∑_σ∈Del(P) (d+1))=O(N).\n\n\n\n\n    Details on graph construction.\n\n\nAgain, let V be a Voronoi polytope. \nWe construct a graph G whose vertices are the endpoints of bridges of faces of V\nand whose edges are induced by the bridges. \nNote that a bridge runs through the interior of a face except at its endpoints.\nSince the interiors of faces are disjoint, it follows that two\nbridges cannot cross. \nHowever, the endpoint\nof a bridge b_1 can lie in the interior of another bridge b_2, so \na bridge might contribute several edges to G. In this case, we say that\nthe b_1 splits b_2. Every split increases the number of\nedges by one. We argue that a bridge can, however, only be split \nat most 2^d+1 times, which is a constant as d is constant.\nIndeed, the bridge of a polytope\nW' can only split the bridge of W if W' is a co-face of W.\nBut the number of co-faces of W is at most 2^d+1\nbecause W is a Voronoi polytope given by k≤ d+1\nsites {p_1,…,p_k}, and each co-facet is given by a subset of these sites.\n\nThe algorithm to compute G is then straight-forward: \nLet σ be the Delaunay simplex that corresponds to V.\nFor every co-face τ of σ in the Delaunay complex,\nwe split its bridge by iterating over all faces of τ that\nare co-faces of σ and check whether one of the bridge endpoints\nlies on the bridge of τ. If so, we split that bridge accordingly.\nAfter having finished splitting the bridge of τ, we add the resulting\nsubdivided bridge segments into G. By the analysis above, with\nm the number of faces of V, constructing G has a complexity of O(m).\n\n\n\n    Details on computing the minimizing path.\n\n\nGiven the graph G as above for V, we compute the minimizing path for\n(V,p,q). We first consider G as directed, such that along every edge,\nthe distance to q is decreasing. By definition and the Structure Theorem (Theorem <ref>), the minimizing path must be\na directed path along G. \n\nWe first compute the starting point p̂ of the path.\nThis point is a vertex of G: by the Structure Theorem, it is contained \nin some bridge, and it cannot lie in the interior of that bridge because\nthen, moving along the bridge towards p would yield\na point in V with smaller distance to p, contradicting the minimality\nof p̂. Hence we can find p̂ in O(m) time, with\nm the number of faces of V, by just computing\nthe distance to p for each vertex of G and taking the minimum.\nThe same argument shows that also q̂ can be computed in O(m) time.\n\nTo construct the minimizing path, we simply walk along edges of G\nstarting from p̂ until we encounter q̂. At every vertex x\non this path, we have to decide \nwhich outgoing edge defines the minimizing path.\nFor each outgoing edge, the squared distance to q decreases, \nand the minimizing\npath follows the edge where the squared distance has the steepest decrease.\nThis can be easily determined by the derivative: For each outgoing edge e,\nlet ℓ be the line supporting the edge. The squared distance function\nto q along ℓ is a quadratic function, so its derivative is a line.\nWe evaluate the derivative at x for all outgoing edges\nand follow the edge with the smallest derivative. If two or more\nderivatives are equal, we choose the edge with smallest second derivative\n(which is a constant). Note that no two edges can have equal first\nand second derivative, \nas this would imply that the squared distance to q \nremains constant, contradicting the uniqueness of the minimizing path.\n\nThe complexity of finding the next edge is then proportional\nto the number of outgoing edges. Since every edge is considered at most in\none step of the walk, the complexity of computing the minimizing path\nis bounded by O(m).\n \nPutting everything together, we need O(N) time (with N the number \nof Delaunay simplices) to compute the bridges and O(m_σ)\ntime for computing the minimizing path for σ, with m_σ \nthe number of co-faces of σ. Hence the total complexity is\n\n\n    O(N)+∑_σ∈Del(P) O(m_σ) = O(N+∑_σ∈Del(P)#{co-faces of σ})\n       =O(N+∑_σ∈Del(P)#{faces of σ})=O(N+ N· 2^d+1)=O(N).\n\n\n\n\n\n\n\n\n    Γ_s for unbounded polygons.\n\n\nIf V is unbounded, q^∗, the furthest point from q in V, does not exist. Instead, it is simple to see\nthat q-Γ_s→∞ for s→∞. Hence, unlike in the absolute case and unlike in the case of bounded polygons,\nthe entry curve does not become constant eventually, but contains a non-constant arc towards ∞ in s-direction.\n\nNevertheless, the curve Γ remains a continuous injective curve also in this case, and the Structure\nTheorem (Theorem <ref>)\nholds also in this case with identical proof, except that the polygonal chain contains one ray.\nThis ray is either the anti-bridge, if an infinite part of it lies in V, or it is a part of an unbounded\nboundary edge of V. The parameterization of the ray is then given as in \n(<ref>) from Section <ref>, with a\nthe starting point of the ray, b any further point of the ray, and t ranging in [0,∞).\nThis still yields a ray or (unbounded) parabolic arc.\n\n\n\n§ PARAMETERIZED CURVES\n\n\n\nThe goal of this section is to prove:\n\n\nLet p,q,a,b be points in ^d. Then the parameterized curve\n\n    s   =p-((1-t)a+tb)^2\n    \n    r   =q-((1-t)a+tb)^2\n\nwith t∈ [0,1] is the arc of a parabola or of a line.\n\n\n\nRewriting the parameterization in vector form, we obtain\n\n    ([ s; r ])=u t^2 + v t + w\n\nwith u,v,w∈^2. If u and v are lineary dependent, we obtain\nthe equation of a line, as one can easily check. Otherwise,\nthere is an affine transformation that maps (u,v) to (e_1,e_2),\nand after a suitable translation, the parameterization is\n\n    ([ s; r ])=e_1 t^2 + e_2 t=([ t^2;   t ])\n\nwhich is a parabola. The proof is completed by noting that affine transformations map parabolas to parabolas <cit.>.\n\n\n\n\n\n\n§ HOMOLOGY\n\n\n\n\n\n    Relative homology.\n\n\nGiven a topological space X and a subspace A⊆ X, the induced boundary maps on quotient chain groups ∂_n: C_n(X)/C_n(A)→ C_n-1(X)/C_n-1(A) yield a chain complex with relative homology groups H_n(X,A):=ker(∂_n) / im(∂_n+1). Thus, while considering relative homology, one \"ignores\" the subspace A in some sense. \n\nThere is a connection between relative and absolute homology which greatly increases one's intuition: If A is a nonempty closed subspace of X that is a deformation retract of some neighborhood in X, then the pair of spaces (X,A) is called a good pair. For good pairs it holds that H_n(X,A)≅H̃_n(X/A). (see e.g. <cit.> for details). \n\n\n\n    Local homology.\n\n\nGiven a point q∈ X, the n-dimensional local homology group of X at q is defined to be the relative homology group H_n(X,X ∖ q). These groups study the local topological structure of X near q. Assuming that single points are closed in X, excision yields H_n(X,X∖ q) ≅ H_n(U,U∖ q) for any open neighborhood U of q <cit.>. Further, notice that if X is a m-dimensional manifold then the local homology groups are trivial for n≠ m <cit.>. See <cit.> for an algorithm to detect dimensions of manifolds sampled by point clouds. \n\n\n\n    Persistent local homology modules.\n\n\nTo account for the influence of noise, a persistent version of local homology was introduced in <cit.>. This concept was adapted by Skraba and Wang <cit.> where two types of persistence modules got studied. Before giving the definitions, remember some notation: As before, P⊂ℝ^d is a finite set of points, L_s=⋃_p∈ PB_s(p) and q is the center. For s<s', r>r' and all maps induced by inclusion, a persistent local homology module of r-type is given by the diagram \n\n    ⋯→ H_n(L_s,L_s∖ B^o_r(q))→ H_n(L_s,L_s∖ B^o_r'(q)) →⋯,\n\none of s-type by\n\n    ⋯→ H_n(L_s∩ B_r(q),L_s∩∂ B_r(q))→ H_n(L_s'∩ B_r(q),L_s'∩∂ B_r(q) ).\n\n\nTwo scenarios are studied here: in case of r-type modules one fixes the offsets L_s and varies the scope of locality, whereas for s-type modules the shape gets thickened inside a fixed radius ball. \n\nA connection to classical local homology groups is given by the following direct limits <cit.>. H_n(L_s,L_s∖ q)=lim_r→ 0H_n(L_s,L_s∖ B^o_r(q))=lim_r→ 0H_n(L_s∩ B_r(q),L_s∩∂ B_r(q)).\n\n\n\n\n\n"}