{"entry_id": "http://arxiv.org/abs/2303.06998v1", "published": "20230313105402", "title": "On detecting the trivial rational $3$-tangle", "authors": ["Bo-hyun Kwon"], "primary_category": "math.GT", "categories": ["math.GT", "57K10"], "text": "\n=12pt\n\n\n\n\nOn detecting the trivial rational 3-tangle\n    Bo-hyun Kwon\n    Monday, March 13,  2023\n==========================================\n\n \nAn important issue in classifying the rational 3-tangle is how to know whether or not the given tangle is the trivial rational 3-tangle called ∞-tangle. The author<cit.> provided a certain algorithm to detect the ∞-tangle. In this paper, we give a much simpler method to detect the ∞-tangle by using the bridge arc replacement. We hope that this method can help  prove many application problems such as a classification of 3-bridge knots.\n\n\n\n\n§ INTRODUCTION\n\n\nA classification of rational 2-tangle is provided by  Conway <cit.> in 1970. It is a perfect classification of them since he had shown that each rational 2-tangle is presented by the corresponding rational number. The author <cit.> gave an algorithm to classify the rational 3-tangles. Unfortunately, the algorithm is not enough to classify the rational 3-tangle completely since it is only used to distinguish  given two rational 3-tangles not assigning them to a certain natural group. The main part of the algorithm is to show whether or not the modified rational 3-tangle from the given two rational 3-tangles is the trivial rational 3-tangle called  the ∞-tangle. There is a basic way to detect ∞-tangle by the fundamental group argument, but the algorithm is much better than the traditional way. In this paper, we provide a new method to detect ∞-tangle.\n\n \n\n\n\n\n§ THE TRIVIAL RATIONAL 3-TANGLE, Ε\n\n\n  \n \nConsider an ordered pair T=(B,ϵ=ϵ_1∪ϵ_2∪ϵ_3) as in Figure <ref>, where B is the unit 3-ball.\nThis trivial rational 3-tangle  in  B is called an ∞ tangle  or ϵ.\n Let E_1,E_2 and E_3 be the three  pairwise disjoint, non-parallel compressing disks in B-ϵ as in Figure <ref>.\nThen E_1,E_2 and E_3 separate B into four components. Let H_i  be the component which contains ϵ_i and H=cl(B-(H_1∪ H_2∪ H_3)), where cl(*) means that the closure of *.\nLet E_i' be the 2-punctured disk in Σ_0,6 so that ∂ E_i'=∂ E_i and E_i∪ E_i' bounds the ball H_i in B.\nLet  E=E_1∪ E_2∪ E_3,  E'=E_1'∪ E_2'∪ E_3' and ∂ E=∂ E'=∂ E_1∪∂ E_2∪∂ E_3. Let Σ_0,6=∂ B-ϵ and P=cl(Σ_0,6-(E')) which is a pair of pants.\n\n\n\n\n§ BRIDGE ARC REPLACEMENT\n\n\n Let τ=τ_1∪τ_2∪τ_3 be a rational 3-tangle in B, where τ_i be a properly embedded arc in B.  A  disk D in B is called a bridge disk if D^∘∩τ=∅ and ∂ D=τ_i∪β and τ_i∩β=∂τ_i for some i∈{1,2,3}, where β is a simple arc in S^2 so that β^∘∩τ=∅. The simple arc β in Σ_0,6 is called a bridge arc if  it cobounds a bridge disk with a component of τ. We note that there is a collection of  disjoint three bridge arcs for a rational 3-tangle. However, we also note that the collection is not unique (up to isotopy)  for the same rational 3-tangle. Actually, there are infinitely many different bridge arcs for the same string of the rational 3-tangle. We say that the simple closed curve γ is obtained from the bridge arc β if the boundary of a small regular neighborhood of β in Σ_0,6 is isotopic to γ.\n \n\nLet β_1 and β_2 be two disjoint  bridge arcs on Σ_0,6 of (B,τ), where τ is a rational 3-tangle in B. Let β_3 be an arc connecting the two remaining punctures on Σ_0,6 which is disjoint with β_1∪β_2. Then γ_3 is also a bridge arc on  Σ_0,6 of (B,τ).\n\n\nWe first claim that there are two disjoint bridge disks so that each of them contains the bridge arcs β_1 and β_2 respectively. We take a bridge disk  bounded by the union of β_1 and a string of τ. Then cut B along the bridge disk and open it along the two cut disks to have a rational 2-tangle. Since β_2 is disjoint with β_1, we can take a bridge disk bounded by β_2 and a string of the obtained rational 2-tangle. We glue the two cut disks back to have the original rational 3-tangle. This implies the existence of two disjoint bridge disks satisfying the condition. Moreover, from the rational 2-tangle, if we cut the tangle along the bridge disk bounded by β_2 and a string then we have a rational 1-tangle. It is clear that any arc connecting the two endpoint of the 1-tangle on Σ_0,2 without intersecting the opened two disks along the bridge disks cobounds a bridge disk in the 3-ball containing the rational 1-tangle. By gluing the two pairs of bridge disks back, we can guarantee the lemma above.\n\n\n\n Let {β_1,β_2,β_3} be a collection of  disjoint three bridge arcs on Σ_0,6 for T=(B,τ). Now, we consider the subarcs of β:=β_1∪β_2∪β_3 in P.\n We assume that there is no bigon so that one of the sides is a subarc of β in P. If there is a such bigon then we can isotope the subarc to vanish the bigon. We say that β is \ndense in P if  none of two adjacent endpoints of the component of β in ∂ P belongs to the same β_i for i=1,2,3. We assume that there are at least two successive adjacent  endpoints of the components of β in ∂ P contained in the same β_i to not satisfy the definition of dense as in Figure <ref>. We note that two of the successive endpoints connect the puncture directly without passing through the other successive endpoints. Let c_1 and c_2 be the two subarc of β_i explained above. We define the two directions (+) and (-) as in the first diagram of Figure <ref>.  \nIf the two punctures appear when the two subarcs go to the opposite direction  we take the new  arc instead of β_i as in the second diagram of Figure <ref>. By Lemma <ref>, the new arc is also a bridge arc. Moreover, it also clear that the newly selected bridge arc is disjoint with β-β_i.  Similarly, if the two punctures appear when they go to  the same direction as in the third diagram, we take the new bridge arc which is disjoint with the remaining two bridge arcs as in the fourth diagram of Figure <ref>.\n This procedure is called the bridge arc replacement, briefly 𝐁𝐑. \n \n \n \n Let {β_1,β_2,β_3} be a collection of disjoint three bridge arcs on Σ_0,6 of T=(B,τ). Then there exist a collection of disjoint three bridge arcs {β_1',β_2',β_3'} on Σ_0,6 of T which is dense in P.\n \n \nBy repeating the procedure 𝐁𝐑, we would get the collection which is dense in P since 𝐁𝐑 reduces the number of endpoints if the collection is not dense and the number of endpoints are finite.\n \n We claim that the procedure BR can detect the ∞-tangle. The following theorem would cover two of the three possible cases.\n \n\nLet ℬ={β_1,β_2,β_3} be a collection of disjoint three bridge arcs on Σ_0,6 of T=(B,ϵ) which is dense in P. Then ℬ is unique up to isotopy. Especially, the three simple closed curves obtained from {β_1,β_2,β_3} respectively are ∂ E_1,∂ E_2,∂ E_3 up to isotopy.\n\n\n\nWe note that if a simple closed curve obtained from β_i is isotopic to ∂ E_j  then β_i is the straight arc connecting the two punctures in E_j' up to isotopy.\nWe first assume that two of the simple closed curves obtained from {β_1,β_2,β_3} are isotopic to ∂ E_i and ∂ E_j for i≠ j. Then we have the first diagram in Figure <ref>. It is clear that the remaining bridge arc is also isotopic to the straight arc connecting the two punctures in E_k' if the collection is dense in P.\nSecondly, we assume that one of them is isotopic to ∂ E_i for some i. Then we have the second diagram of Figure <ref>. We note that it is impossible to have a wave in terms of ∂ E if the collection is dense in P in this case. This implies that there is no wave. So, every simple closed curves obtained from {β_1,β_2,β_3} are isotopic to one of ∂ E_j for j=1,2,3. \n\nFor the last case, we assume that none of them is isotopic to ∂ E_i for some i. In order to prove the last case, we use the arguments when we made the algorithm to classify rational 3-tangles.\n\n\n §.§  Dehn's parametrization of a simple closed curve in Σ_0,6\n\n\n\n\n\n\nLet γ be a simple closed curve in Σ_0,6. Assume that γ meets ∂ E_i. Then we can isotope γ so that it meets with ∂ E_i  in a special subarc ω_i of ∂ E_i only. We call ω_i the window in ∂ E_i.Then γ has  parallel arcs which are the same type in P. Let l_ij be the arc type of them as in Figure <ref> which is called the standard arc type. (Refer to <cit.>.) Let x_ij be the number of parallel arcs of the type l_ij which is called the weight of l_ij for γ. There is a relation between x_ij and the geometric intersection number |γ∩ω_s| as follows.\n[<cit.>]\nLet I_s=|γ∩ω_s|, where  s∈{1,2,3}. Then I_s   determine x_ij.\nEspecially, if x_ii>0 for some i, then x_ij = I_j, x_ik = I_k\nand x_ii = I_i-I_j-I_k 2. Also, if x_ii=0  for all i, then x_ij=I_i+I_j-I_k 2 for distinct i,j,k. \n\n We note that γ can be determined by x_ij and the patterns in E_i'. So, we can parametrize  γ  in Σ_0,6 as follows. \n\n\n\n\n\n  [Special case of Dehn's Theorem  <cit.>]\nThere is a parametrization of closed essential 1-manifolds in Σ_0,6 by ordered sequences of nine parameters (p_1,q_1,t_1,p_2 ,q_2,t_2,p_3,q_3,t_3).\n (where p_i,q_i∈ℤ^+∪{0} and t_i∈ℤ for i=1,2,3.), where  2p_i=I_i  and 2p_i=J_i. \n\n\n\nIn the diagrams in Figure <ref>, E_i” is the inner two punctured disk in E_i' to have only parallel arcs. Then  q_i and t_i determine all the arc types and weights of them in E_i' by determining the connecting pattern between b_i and s_j. \n\n\nWe are dealing with the simple arc instead of the simple closed curve for proving the main theorem.\nWe note that the  argument in this section is in terms of simple closed curves not a simple arc. The simple closed curves obtained from the simple arcs can be parameterized by the argument in this section. Moreover,  a simple arc β_i is a bridge arc if and only if γ_i obtained from β_i bounds a compressing disk in B-ϵ.  So, we can discuss the all argument in terms of simple arcs instead of simple closed curves if we consider the exceptional  arc types having a puncture as one of the endpoints of them. \n\n\n\n\n\n\n\n\n\n\n\n§ STANDARD DIAGRAM AND THE PROOF OF THE LAST CASE\n\n\n\nRecall that {β_1,β_2,β_3} is a collection of disjoint bridge arcs on Σ_0,6 for T=(B,ϵ). \n  In order to analyse β_i, we set Σ_0,6 with the three disjoint non-parallel simple closed curves ∂ E_1, ∂ E_2 and ∂ E_3.  Let P'=∂ B-(∪_i=1^2 E_i”).\nNow, take equators e_i for each E_i” as in Figure <ref>. Then e_i divides E_i” into E_i”^+ and E_i”^- as in Figure <ref>. We note that ∂ E_i is isotopic to ∂ E_i” for i=1,2,3. Now, we introduce a lemma which helps us to realize β in a certain formed diagram called standard diagram. \n [Lemma 6.1 in <cit.>]\n Let N be a compressing disk in B-ϵ and h be the homeomorphism obtained from the clockwise half Dehn twist supported on N' which is the 2-punctured disk in Σ_0,6 so that ∂ N=∂ N' . Then a simple closed curve δ bounds a compressing disk in B-ϵ if and only if  h(δ) bounds a compressing disk in B^3-ϵ. \n \n   \nWe note that Lemma <ref> implies that a simple arc β_i is a bridge arc in B-ϵ if and only if h(β_i) is a bridge arc in B-ϵ.\n\n\n\n \n \n\n\n \nLet γ_i be the simple closed curve obtained from β_i which can be parametrized by an ordered sequence of integers (p_1,q_1,t_1,p_2,q_2,t_2 ,p_3,q_3,t_3).\nWe now investigate the  simple closed curve γ_i' (it may be in a different isotopy class in Σ_0,6) so that every component of γ_i'∩ P' is isotopic to one of the given real arc types  in P' of one of the two diagrams as in Figure <ref> by taking a properly chosen t_i' instead of t_i by the following lemma.\n\n[Lemma 8.2 in <cit.>]\nSuppose that γ is parametrized by (p_1,q_1,t_1,p_2,q_2,t_2,p_3,q_3,t_3) and it has l_11 arc type in P.\nThen there exist simple closed curves γ' which is parameterized by (p_1,q_1,t_1',p_2,q_2,t_2',p_3,q_3,t_3') for some t_i'∈ℤ\nso that all components of γ'∩ P' are isotopic to one of the arcs in the  diagram.\n\n\nWe say that a simple closed curve γ is in standard position if all componet of γ∩ P' are isotopic to one of the arcs in the diagram of Figure <ref>. The diagram in Figure <ref> is called standard diagram.\nLet β_i' be the simple arc so that γ_i' is the simple closed curve obtained from β_i'.  We note that the components of β_i'∩ P' are also carried by the arc types in the standard diagram. In order to see this, it is enough to investigate the component in P' which connects the puncture in E_i” directly as in Figure <ref>. We note that γ has the two components (a) and (b) and β has the component (b') which is parallel to the component (b). \nThe original lemma  is for a simple closed curve not a multiple of simple closed curves. However, there is no difference between a simple closed curve and multiple simple closed curves when we apply the above lemma. It works for β'=β_1'∪β_2'∪β_3' as well. We  note that the changes of the twisting number t_i would preserve the density since the half Dehn twist along E_i” just rotate  the position of the all endpoints on ∂ E_i” by 180^∘.\nWe also note that the trivial rational 3-tangle ϵ in B is preserved when we apply the half Dehn twists supported on N' defined in Lemma <ref>. For  additional modifications of β, we consider the following two lemmas and the theorem.\n\n\n\n[Lemma 9.1 in <cit.>]\n If A is a compressing disk in B^3-ϵ, then  (δ_1δ_2^-1)^± 1(∂ A) also bounds a compressing disk in B^3-ϵ. (where δ_1 and δ_2 are the clockwise half Dehn twists supported on two punctured disks C_1 and C_2 respectively as in Figure <ref>.)\n\n\n\n\n[Lemma 9.2 in <cit.>]\nSuppose that A is a compressing disk in B^3-ϵ. Let δ_3 be the counter clockwise half Dehn twist supported on the 2-punctured disk E_4' as in Figure <ref>.\nThen δ_3(∂ A) also bounds a compressing disk δ_3(A) in B^3-ϵ.\n\n\n\n \n[Theorem 9.3 in <cit.>]\nSuppose that A is a compressing disk in B^3-ϵ and ∂ A  is in standard position in P'.\nThen one of the half Dehn twists  (δ_1δ_2^-1)^± 1 and δ_3^± 1 reduces the minimal intersection number of ∂ A with ∂ E.\n\n \nThe following lemma is the main idea to prove the last case of the main theorem.\n \n  Let {β_1,β_2,β_3} be the collection of  disjoint simple arcs which are bridge arcs in B-ϵ. We assume that β=β_1∪β_2∪β_3 is in standard position and all of them have a wave in terms of ∂ E”. Then, there exist two adjacent endpoints of β∩ P' in ∂ E_i”  for some i which belong to the same β_j for j=1,2,3.\n \n \n\n \n \n    \n   \n\n\n By the assumption that all of β_i have a wave,  without loss of generality, we assume that β has  subarcs of type 1 or type 3 as in the first diagram of Figure <ref> and Figure <ref>. By applying the  homeomorphism δ_3 in Lemma <ref> to β, we can remove the subarcs of type 2 as in the second diagram of Figure <ref> and Figure <ref> respectively.  Let m_k be the weights of each type k. In the second diagram of Figure <ref>, we note that A=m_2, B=m_3-m_2 and C=m_10+m_11.\n In the right diagram of Figure <ref>, we have  A=m_2 and B=m_3-m_2. Also,  in the bottom diagram of Figure <ref>, we have A=m_2-m_3, B=m_3 and C=m_2,D=m_1-m_2, E=m_7_2+m_3-m_2, where 7_2 is lower track of the type 7's in the standard diagram.  For the detail of this weight changes  in Figure <ref> and Figure <ref>, refer to Theorem 9.3 in <cit.>. We note that the homeomorphism in each  step reduces the total weight of the subarcs in P' by Theorem <ref>.\n\n \n  We claim that the collection of the new bridge arcs is dense in P'. In order to show the claim for the case described in Figure <ref>, consider the diagrams in Figure <ref>. It is enough to investigate the pattern of endpoints in ∂ E_1” since the endpoints in ∂ E_2” and ∂ E_3” are fixed. Since β is dense in P', the depicted two adjacent arcs in the three positions (1),(2) and (3) should be a part of distinct bridge arcs. This implies that the right diagram does not violate the rule to satisfy the density as well. It is not difficult to see that the other adjacent endpoints in ∂ E_1” except the indicated adjacent endpoints by the parallel arcs also keep the rule for the density since the patterns are the same with the previous corresponding patterns.\n   \n  \n  \n  Similarly, we note that the collections of the modified bridge arcs described in Figure <ref> are dense by Figure <ref>.  Finally, we would get the four diagrams as in Figure <ref> which do not have the type 2.  First, we assume that both of m_1 and m_3 are positive as in the diagram (A). Then, there is two adjacent endpoints in ∂ E_1” since the two punctures in E_1” should be the two endpoints of the same β_i for some i=1,2,3. \n  \n\n \n \nFor the rest of the cases, we apply a multiple of the homeomorphism (δ_1^-1δ_2)^± 1 to have a simpler diagram as follows. For the diagram (B), we apply a multiple of the homeomorphism (δ_1^-1δ_2) to have the rightmost diagram in Figure <ref>.  We note that the homeomorphism (δ_1^-1δ_2) preserves the density.\n  \n \n \n  \n  \n \n  \n  \n\n\n \n Now, consider the cases (C) and (D). Since the cases are symmetric, it is enough to figure out the case (D).  We apply the homeomorphism (δ_1^-1δ_2) to the diagram (D) until we get the rightmost diagrams   in Figure <ref>.  We  note that the homeomorphism (δ_1^-1δ_2) preserves the density as in Figure <ref>. If we have the diagram having the rightmost two diagrams, the diagram has the type 2. We repeat the procedure to remove the type 2. We note that the procedure preserves the density. Since the total weights of the subarcs in P' is finite and the procedures mentioned in this proof reduce the total weights, we eventually get a collection of bridge arcs so that at least one of them is isotopic to the straight arc connecting the two punctures in E_i” for some i∈{1,2,3}. So, it is enough to consider  the diagrams right before the final diagram. Then we have the two diagrams (a) and (b) as in Figure <ref> if we ignore symmetric cases. We note that if we apply (δ_1^-1δ_2) to the diagram (a) then we have the bridge arc which connects the two punctures in E_3”. Also, we apply δ_3^-1 to the diagram (b) then we have the bridge arc which connects the two punctures in E_1”.\nIn (a), assume that β_1 is isotopic to the red arc connecting the two punctures in E_1”. Since β_2 and β_3 also have a wave, it is clear that there are two adjacent endpoints in ∂ E_2” which belong to the same β_j for some j=2,3. Similarly, in (b), there are two adjacent endpoints in ∂ E_2” which belong to the same β_j for some j=2,3. This implies that either δ_3^±1 or \n  (δ_1^-1δ_2)^± 1 cannot preserve the density. This violates the argument above.\n\n \n \n Now, we can complete the proof of Theorem <ref>.\n\nBy Lemma <ref>, it is not possible to have a collection of disjoint three bridge arcs so that at least one of them has a wave. Therefore, if β is dense in P' then none of β_i has a wave. This implies that the collection of the bridge arcs should be isotopic to the collection of ∂ E_1,∂ E_2 and ∂ E_3.\n\n\n\n\n \n\n \n\n§ ACKNOWLEDGEMENTS\n\n\n This research was supported by Basic Science Research Program through the National Research Foundation of Korea (NRF)  funded by the the Ministry of Education (NRF-2020R1I1A1A01052279 and NRF-2020R1A2C1A01009184)\n1\n \n  \n0 J. Conway, An enumeration of knots and links, and some of their algebraic properties,\nin Computational Problems in Abstract Algebra (Pergamon, Oxford, Press, 1970),\npp. 329–358.\n1 B. Kwon, An algorithm to classify rational 3-tangles,\n  J. Knot Theory Ramifications 24 (2015), no. 1, 1550004 (62 pages).\n\n\n 4 R. C. Penner; J. L. Harer Combinatorics of Train Tracks, Annals of Mathematics Studies No. 125, Princeton University Press, Princeton, NJ, 1992. xii+216 pp. \n  \n\n\n\n\n\n"}