{"entry_id": "http://arxiv.org/abs/2303.06996v2", "published": "20230313105206", "title": "Coherent THz Spin Dynamics in Antiferromagnets Beyond the Macrospin Approximation", "authors": ["F. Formisano", "T. T. Gareev", "D. I. Khusyainov", "A. E. Fedianin", "R. M. Dubrovin", "P. P. Syrnikov", "D. Afanasiev", "R. V. Pisarev", "A. M. Kalashnikova", "J. H. Mentink", "A. V. Kimel"], "primary_category": "cond-mat.str-el", "categories": ["cond-mat.str-el"], "text": "\n\n\n\n\n\n\n     Institute for Molecules and Materials, Radboud University, 6525 AJ Nijmegen, The Netherlands\n     \n\n     Institute for Molecules and Materials, Radboud University, 6525 AJ Nijmegen, The Netherlands\n\n\n     Institute for Molecules and Materials, Radboud University, 6525 AJ Nijmegen, The Netherlands\n\n\n     Ioffe Institute, Russian Academy of Sciences, 194021 St. Petersburg, Russia\n     \n\n     Ioffe Institute, Russian Academy of Sciences, 194021 St. Petersburg, Russia\n\n\n     Ioffe Institute, Russian Academy of Sciences, 194021 St. Petersburg, Russia\n\n\n     Institute for Molecules and Materials, Radboud University, 6525 AJ Nijmegen, The Netherlands\n\n\nIoffe Institute, Russian Academy of Sciences, 194021 St. Petersburg, Russia\n\n\nIoffe Institute, Russian Academy of Sciences, 194021 St. Petersburg, Russia\n\n     Institute for Molecules and Materials, Radboud University, 6525 AJ Nijmegen, The Netherlands\n\n\naleksei.kimel@ru.nl\nInstitute for Molecules and Materials, Radboud University, 6525 AJ Nijmegen, The Netherlands\n\n\n\n\nControlled generation of coherent spin waves with the highest possible frequencies and the shortest possible wavelengths is a cornerstone of spintronics and magnonics.\nHere, using the Heisenberg antiferromagnet , we demonstrate that laser-induced THz spin dynamics corresponding to pairs of the mutually coherent counter propagating spin waves with the wavevectors up to the edge of the Brillouin zone cannot be understood in the terms of magnetization and antiferromagnetic vectors, conventionally  used to describe spin waves in the classical macrospin approximation.\nInstead, we propose to model such a spin dynamics using the spin correlations function.\nWe derive quantum-mechanical equation of motion for the latter and emphasize that unlike the magnetization and the antiferromagnetic vectors the spin correlations in antiferromagnets do not have an inertia.\n\n\n\nCoherent THz Spin Dynamics in Antiferromagnets \nBeyond the Macrospin Approximation\n    A. V. Kimel 0000-0002-0709-042X\n    March 30, 2023\n==================================================================================\n\n\n\nRevealing and understanding the efficient routes for excitation of coherent spin waves with the shortest possible wavelength and the highest achievable frequency is among the major challenges of today's spintronics, magnonics and magnetic data storage <cit.>.\nAmong magnetic materials, antiferromagnets have the highest eigenfrequencies of spin dynamics in the THz range, which is a significant advantage for becoming a crucial ingredient of ultra-high speed spintronic devices <cit.>. \nIt has been experimentally and theoretically demonstrated that ultrashort laser pulses can be employed for generation of coherent spin waves in practically all classes of magnetically ordered materials <cit.>. \nThe wavelength of the optically excited spin wave is, in principle, defined by the size of the illuminated volume, and it can be further decreased by introducing inhomogeneities <cit.>.\nHowever, spin waves thus generated will still have frequencies and wavevectors close to the center of the Brillouin zone.\nAn appealing alternative approach for generation of spin waves with larger k-vectors is based on concomitant excitation of the two counter propagating waves <cit.>.\nIn antiferromagnets, such mutually coupled pairs of spin waves excited over the whole Brillouin zone form a so-called two-magnon mode, which couples to light via Raman scattering <cit.>, and can be triggered by ultrashort laser pulses <cit.>.\n\n\nUntil now the macrospin approximation, which neglects individual spins and treats a magnet as a continuous medium, has been fundamental to understanding spin dynamics.\nUsing such an approximation the simpliest two-sublattice antiferromagnet can be modelled as two antiferromagnetically coupled ferromagnets with oppositely directed magnetizations |𝐌_1| = |𝐌_2| = M_0, the dimensionless antiferromagnetic vector 𝐋 = (𝐌_1 - 𝐌_2)/2M_0 and the net magnetization 𝐌 = (𝐌_1 + 𝐌_2)/2M_0. \nPropagation of an antiferromagnetic spin wave with the wavevector 𝐤 and the angular frequency Ω_𝐤 in this approximation is described as spatio-temporal variations of the orientations and lengths of L and M. \nIt is clear that upon decreasing the wavelength and approaching the edge of the Brillouin zone, the macrospin approximation should eventually fail. \nDespite this fact, the breakdown has not been examined for experimentally observed laser-induced spin dynamics of antiferromagnets until now.\n\nHere using the example of the Heisenberg antiferromagnet , we demonstrate that spin dynamics corresponding to mutually coherent and counter-propagating spin waves with large wavevectors cannot be understood if the light-spin interaction is modelled in the conventional terms of the macroscopic magnetization 𝐌 and antiferromagnetic vector 𝐋. \nInstead, we propose to model such spin dynamics using spin correlations.\nWe derive the equation of motion for the latter and demonstrate \n that unlike the macrospin 𝐌 and 𝐋 parameters, the spin correlations in antiferromagnets do not have an inertia. \nIt means that there is an optimal pulse duration for excitation of the spin correlation dynamics, while the macrospin dynamics in antiferromagnet can be excited impulsively even by an infinitesimally short pulse. \n\nFor demonstration of the failure of the macrospin approximation it was crucial to choose a material, where the orientation of the macroscopic antiferromagnetic vector 𝐋 is distinctly different from the main crystallographic axes.\nHere we select the cubic fluoroperovskite insulator  (point group m3m), which is very close to the isotropic 3D Heisenberg antiferromagnet below the Néel temperature T_N=83 K <cit.>. \nThe spins (S=5/2) of the Mn^2+ ions form two equivalent magnetic sublattices with oppositely directed magnetizations.\nIt is known that this crystal has very weak magnetic anisotropy which aligns the antiferromagnetic vector 𝐋 along one of the ⟨111⟩ directions <cit.>, as shown in Fig. <ref>(b).\nThe two-magnon mode in RbMnF3 is well known from the spontaneous Raman scattering experiments [Fig. <ref>(a)] and has the E_g symmetry and a frequency 4 THz at low temperature <cit.>.\n \nTo excite coherent spin dynamics corresponding to the two-magnon mode, we perform femtosecond two-color magneto-optical pump-probe experiment in the transmission geometry as shown in Fig. <ref>(c).\nThe laser pulses with duration 45 fs and central photon energy 1.55 eV were emitted by the Ti:Sapphire regenerative amplifier at a repetition rate of 1 kHz and were split into pump and probe (ħω_pr=1.55 eV) beams with an energy per pulse ratio of 10:1.\nThe pump pulses were tuned by an optical parametric amplifier (OPA) to a central \nphoton energy ħω_p = 1.03 eV and a fluence of 1.2 mJ/cm^2 and then were focused normally onto the sample surface into a spot with a diameter of 500 μm. \nThe pump and probe pulses were linearly polarized at angles α and β with respect to the x[100] axis, respectively. \nThe angles were controlled by half-wave plates.\nFor experiments, the 620 μm-thick slab sample with 5×5 mm^2 area was cut perpendicular to the cubic z[001] axis from a single crystal of  grown by the Czochralski method and polished to achieve the optical quality of its surfaces.\nThe projection of the antiferromagnetic vector 𝐋 on the sample xy plane makes an angle of 45^∘ with the x axis, as shown in Fig. <ref>(c).\nThe sample was placed in the continuous flow cryostat and cooled by liquid helium.\nIn general, the spin dynamics triggered by an intense pump pulse induces in the sample a certain type of an optical anisotropy <cit.>.\nThe latter is detected by measuring ellipticity of the polarization of the initially linearly polarized probe pulse upon transmission through the sample.\nMeasuring the ellipticity of the probe polarization as a function of time delay Δt between pump and probe pulses employing a balance detection scheme, we are aiming to deduce information about pump-induced spin dynamics.\n\n\n\nFigure <ref>(a) shows a temporal evolution of the pump-induced ellipticity in the antiferromagnetic phase of .\nPump and probe pulses were linearly polarized at angles α=0^∘ and β=45^∘. \nOne can clearly distinguish oscillations damped within a few ps.\nThe Fourier spectra of the time trace for T=5 K reveals a clear resonance at 4 THz. \nThe frequency and the amplitude of these oscillations decreased upon heating up to T_N, as can be seen in Figs. <ref>(b) and <ref>(c), respectively.\nThe observed frequency and its temperature behavior are in fair agreement with those of the two-magnon mode obtained in the spontaneous Raman scattering experiments <cit.>.\nMore particularly, the detected two-magnon mode corresponds to a simultaneous excitation of pairs of mutually coherent spin waves with opposite wavevectors throughout the whole Brillouin zone dominated by the waves with the shortest wavelengths and the highest frequencies Ω_π/a, as shown in Fig. <ref>(a) <cit.>.\nThus, we can confidently conclude that the experimentally detected oscillations correspond to the spin dynamics originating from the two spin waves with opposite wavevectors at the edges of the Brillouin zone. \n\nTo comprehend the observed spin dynamics, we performed measurements of the pump-induced ellipticity at various angles of the pump α and probe β polarizations at T=5 K [Fig. <ref>].\nThe most pronounced oscillations of the probe ellipticity are observed when the pump polarization is along the crystallographic x and y axes (α = 0, 90^∘) and probe polarization is at the angle β = 45^∘, 135^∘. \nMoreover, it is clearly seen that the phase of the two-magnon oscillations is shifted by π when either pump or probe polarization is rotated by 90^∘ as shown in Figs. <ref>(a) and <ref>(b), respectively.\nTo grasp further insights, we carried out two series of experiments for fixed pump (α=0^∘) and rotated probe (β=0^∘…360^∘) polarization and for fixed probe (β=45^∘) and rotated pump (α=0^∘…360^∘) polarizations.\nOne can see that the signed Fourier amplitudes of the obtained waveforms for the rotated pump and probe polarizations are fairly well described by cos2α and sin2β, as shown in Figs. <ref>(c) and <ref>(d), respectively.\n\n\n\nIn contrast to earlier reported results of ultrafast spin dynamics, the observed polarization dependencies cannot be explained in terms of the macroscopic magnetization 𝐌 and antiferromagnetic vector 𝐋.\nIn particular, spin dynamics which corresponds to two mutually coherent counter-propagating spin waves in isostructural antiferromagnetic fluoroperovskite  <cit.> was explained in terms of the antiferromagnetic vector 𝐋 with oscillating length.\nIn  𝐋 is along one of the main crystallographic axes, while in the case of , the projection of 𝐋 on the xy sample plane is rotated over 45^∘ from the x and y axes. \nNevertheless, the pump polarization dependences are exactly the same in the both antiferromagnets.\nMoreover, as the maximum signal in  is observed when the probe is initially polarized along or perpendicular to the projection of 𝐋 on the sample plane, the corresponding optical anisotropy does not originate from the oscillations of the length of 𝐋.\n\nTo describe the observed polarization dependencies of the laser-driven two-magnon mode, we have to go beyond the classical macrospin approach.\nWe assume the antiferromagnetic Heisenberg exchange interaction with free energy Ĥ_0 = J ∑_δĈ(δ), where J is the exchange coupling constant between the nearest neighbor magnetic ions, δ is the vector between them. For a cubic crystal, Ĉ(δ)=2∑_i𝐒̂(𝐫_i) 𝐒̂(𝐫_i+δ) is the spin correlation along δ, and 𝐫_i is a vector to i site <cit.>. \nThe electric field 𝐄=(E^x,E^y,E^z) of light propagating along the z axis and polarized in the xy plane perturbs the Hamiltonian according to the phenomenological expression <cit.>\n\n    ΔĤ   = A(ω_p) [ (E^x δ^x )^2  Ĉ(δ^x) + (E^y δ^y )^2 Ĉ(δ^y)],\n\nwhere A(ω) δ^νδ^νĈ(δ^ν) is proportional to the dielectric permittivity at frequency ω.\n\n\nTo derive the equation for the dynamics of spin correlations, we consider small transverse spin-deflections with respect to the colinear antiferromagnetic ground state. It is convenient to represent these spin deflections in reciprocal space, since spin correlations for different bonds are not independent: [Ĉ_i(δ^ν),Ĉ_j(δ^μ)]≠δ_ijδ_νμ, with δ_ij being a Kronecker delta. \nIndeed, spin correlations can share the same spin operator, for example 𝐒̂(𝐫_i+δ^ν)=𝐒̂(𝐫_j+δ^μ). \nThis means that, for example, perturbation of exchange bonds along the x axis also triggers dynamics of spin correlations along the y and z axes. \nAlthough the spin correlation itself is a scalar, not all components of the spin correlation feature the same dynamics. Analogous to the antiferromagnetic vector 𝐋, we therefore write the different components of the spin correlation as a vector 𝐂̂_𝐤=(Ĉ_𝐤^(1),Ĉ_𝐤^(2),Ĉ_𝐤^(3)), where\n\n    Ĉ^(1)_𝐤   =1/2S(Ŝ^X_𝐤Ŝ^X_-𝐤+Ŝ^Y_𝐤Ŝ^Y_-𝐤),\n    Ĉ^(2)_𝐤   =1/2S(Ŝ^X_𝐤Ŝ^Y_-𝐤-Ŝ^Y_𝐤Ŝ^X_-𝐤),\n    Ĉ^(3)_𝐤   =1/4S((Ŝ^X_𝐤)^2+(Ŝ^Y_𝐤)^2 + (Ŝ^X_-𝐤)^2 + (Ŝ^Y_-𝐤)^2  + 2S),\n\nwith X,Y being mutually orthogonal components perpendicular to the spin quantization axis denoted by Z.\nHere we kept only the leading order, i.e., quadratic spin deflections <cit.> and static terms ∝ -S^2 are omitted. Note that in equilibrium, ⟨Ĉ^(2)_𝐤⟩ =0, but it can be nonzero during dynamics. In terms of the vector components, the leading order deflections to the full correlation are given by\n\n    Ĉ_𝐤(δ^ν)=4S(Ĉ^(3)_𝐤+cos (k^νδ^ν)Ĉ^(1)_𝐤),\n\nwhich shows that the correlation function features terms not present in the dynamics of Δ L^Z∝∑_𝐤⟨Ĉ^(3)_𝐤⟩ <cit.>, where ⟨…⟩ denotes averaging. \nFrom the commutations relations for the spin operators, it follows that the vector 𝐂̂_𝐤 satisfies the cross product in hyperbolic space, 𝐂̂_𝐤×𝐂̂_𝐤=iħ𝐂̂_𝐤, featuring a minus sign for the terms in the Ĉ^(3)_𝐤 component as compared to the ordinary cross product <cit.>.\nHence, from Heisenberg equations of motion the dynamics of the correlations in reciprocal space is determined by\n\n    ħ∂𝐂̂_𝐤/∂ t - 𝐂̂_𝐤×(-∂Ĥ_𝐤/∂𝐂̂_𝐤)=0,\n\nwhere\n\n    Ĥ_𝐤= (J +A(ω_p) (E^x δ^x )^2 )Ĉ_𝐤(δ^x)\n            + (J +A(ω_p) (E^y δ^y )^2 )Ĉ_𝐤(δ^y)\n    + J Ĉ_𝐤(δ^z).\n\nSolving this equation of motion for the impulsive perturbation ΔĤ gives precession of 𝐂̂_𝐤 with the dominating frequency ≈ 2 z J S/ħ (z=6 is the number of nearest neighbors), which corresponds to the frequency of the two-magnon mode <cit.>. Thus, we derived the equation of motion for spin correlations which describes the dynamics of this parameter, in agreement with our and previously reported experiments. It is worth noting, that, unlike M and L in antiferromagnets <cit.>, the dynamics of spin correlation is described by the differential equation of the first order and hence the spin correlations do not show inertia.\n\nFrom Eq. (<ref>), we see that the polarization dependence of the pump-induced spin correlations is dictated by the light-induced perturbations of the effective fields -∂Ĥ_𝐤/∂𝐂̂_𝐤. \nIn the Supplementary information <cit.> we demonstrate that for the experimental geometry considered one then obtains a polarization dependence ∝cos2α, in agreement with what is observed experimentally, as seen in Fig. <ref>(d). \nPhenomenologically, this polarization dependence can be understood as follows. \nFrom Eq. (<ref>) one sees that an inequality E^ν≠ 0 gives ∂ΔĤ/∂Ĉ(δ^ν)≠ 0. \nIt means that pumping the antiferromagnet by a laser pulse polarized along one of the main crystallographic axes brings the system out of the thermodynamic equilibrium, and finding the new equilibrium will result in a change of the spin correlations. \nSuch changes in the spin correlation functions contribute to the dielectric permittivity as Δε^μν=∂^2⟨ΔĤ⟩/∂ E^ν∂ E^μ, which may lead to a pump-induced anisotropy ε^xx-ε^yy≠0 in the initially optically isotropic cubic system. \nFor the m3m point group, we obtain the pump-induced change of the dielectric permittivity ε^xx-ε^yy=2gE^2cos2α, where g=ξ^xxxx-ξ^yyxx, and ξ is the phenomenological polar tensor <cit.>. \nIn the range of low absorption, such pump-induced change of the dielectric permittivity results in ellipticity of the probe pulse which obeys sin2β dependence on the incoming probe polarization, observed in the experiment [Fig. <ref>(d)].\nHence the model based on spin correlation reproduces the experimental observation in terms of symmetry of excitation and detection. \n\nFurthermore, the model correctly describes the linear dependence of the effect on the pump pulse fluence [Fig. <ref>(d)].\nThis is in contrast to the macrospin approximation. \nIndeed, the spin wave frequencies Ω_𝐤 are much less than those of the pump photons ω_1 and ω_2 [see Fig. <ref>(a)].\nHence, in the lowest order, a light-induced torque acting on 𝐌 or 𝐋 and exciting a spin wave is quadratic with respect to the electric field of the pump pulse <cit.>.\nAs the spin wave wavevectors k≈π/a are much larger than the wavevector of light q≈0, they can be detected only in pairs such that 𝐤-𝐤=𝐪≈ 0. Therefore, the signal detected by the probe pulse should be quadratic with respect to the pump intensity.  \n\nIn our model [Eqs. (<ref>,<ref>)], when the electric field of light is along one of the main crystallographic axis, it off-resonantly excites virtual charge transfer transitions between Mn^2+ and F^1- ions and, thus, effectively changes the exchange interaction between Mn^2+ spins <cit.>.\nAs a result, the spin correlation function Ĉ(δ) is impulsively altered along the corresponding crystallographic axis.\nIn the following, the spin correlation function along this axis will oscillate at the frequency of two-magnon mode which is defined by the energy of the exchange interaction taking twice.\nMoreover, the correlations along the two other axes are affected as well, since different correlations can comprise the same spins. \nObeying the energy conservation law, spin correlations along the two other crystallographic axes oscillate with the opposite phase, and total amplitude along all three axes equals to zero.\nNaturally, such kind of dynamics cannot be comprehended in terms of a macrospins 𝐋 and 𝐌, which do not distinguish anisotropic changes of spin-spin coupling.\nDespite this fact, the dynamics manifests itself in the modulation of the symmetric part of the dielectric permittivity and thus is probed by measuring dynamic linear birefringence (for details see <cit.>).\nThe maximum amplitude of the detected signal is observed when the electric field of the exciting pulse is along the directions linking nearest magnetic neighbors, which in a cubic crystal coincide with the main crystallographic axes.\nIn accordance with the experimental observations, if light induces and probes the dynamics of spin correlation, the observable will be proportional to the pump pulse intensity.\n\nIn conclusion, we have demonstrated a regime of ultrafast spin dynamics in antiferromagnetic , where the models based on macrospin approximation, i.e. macroscopic antiferromagnetic vector and the net magnetization, fail.\nInstead, we propose to describe the regime in terms of the spin correlation function, derive the corresponding equations of motion, and reveal that, unlike the macrospins, the spin correlation function in antiferromagnets does not possess inertia.\nThe latter yields that there is an optimum in the pump pulse duration for the excitation of spin correlations dynamics with the highest amplitude, which is in contrast to the impulsive character of the excitation of spin waves with small wavevectors in antiferromagnets <cit.>.\nIn contrast to macrospin models, the spin correlation function is capable to describe adequately response to an anisotropic perturbation of short-scale spin-spin exchange coupling by a polarized laser pulse and also reveals the effect of the latter on the optical properties of the medium.\nOur experimental and theoretical findings open up novel prospective for ultrafast antiferromagnetic spintronics and magnonics governed by laws different from the macrospin approximation.\n\nWe are grateful to A.K. Zvezdin, V.N. Gridnev, A.I. Nikitchenko, D. Bossini, H. Hedayat, and P.H.M. van Loosdrecht for fruitful discussions, S. Semin, and C. Berkhout for technical support.\nJ. H. M. acknowledges funding  by the Shell-NWO/FOM-initiative “Computational sciences for energy research” of Shell and Chemical Sciences, Earth and Life Sciences, Physical Sciences, FOM, and STW,  European Research Council under ERC Grant Agreement No. 856538 (3D-MAGiC), and Horizon Europe project No. 101070290 (NIMFEIA).\nThe work of T. T. G. was funded by European Union's Horizon 2020 research and innovation program under the Marie Skłodowska-Curie Grant Agreement No. 861300 (COMRAD). \nR. M. D. acknowledges support of RSF (Grant No. 22-72-00025).\nA. M. K. acknowledges support from RFBR (Grant No. 19-52-12065).\n\nAuthor contributions: A.V.K., A.M.K. and J.H.M conceptualized the work; F.F. and R.M.D designed and performed the first experiments; T.T.G, D.I.Kh. and D.A. upgraded the design and conducted the experiments described in the paper; A.E.F. and J.H.M. developed the theoretical model; R.M.D., P.P.S. and R.V.P. prepared and characterized the sample; T.T.G, D.I.Kh. and R.M.D. analyzed the data; A.V.K. led the project.\nAll authors contributed to discussions and writing the manuscript.\n\n\n\n\n\n"}