{"entry_id": "http://arxiv.org/abs/2303.06995v1", "published": "20230313105105", "title": "Tuning Elastic Properties of Metallic Nanoparticles by Shape Controlling: From Atomistic to Continuous Models", "authors": ["Matteo Erbi", "Hakim Amara", "Riccardo Gatti"], "primary_category": "cond-mat.mtrl-sci", "categories": ["cond-mat.mtrl-sci", "physics.class-ph"], "text": "\n\n\n\n\nLaboratoire d'Etude des Microstructures, ONERA-CNRS, UMR104, Université Paris-Saclay, BP 72, Châtillon Cedex, 92322, France\n\n\nhakim.amara@onera.fr\nLaboratoire d'Etude des Microstructures, ONERA-CNRS, UMR104, Université Paris-Saclay, BP 72, Châtillon Cedex, 92322, France\nUniversité de Paris, Laboratoire Matériaux et Phénomènes Quantiques (MPQ), F-75013, Paris, France\n\n\nriccardo.gatti@onera.fr\nLaboratoire d'Etude des Microstructures, ONERA-CNRS, UMR104, Université Paris-Saclay, BP 72, Châtillon Cedex, 92322, France\n\n\n\n\n \nUnderstanding and mastering the mechanical properties of metallic nanoparticles is crucial for their use in a wide range of applications. In this context, we use atomic-scale (Molecular Dynamics) and continuous (Finite Elements) calculations to investigate in details gold nanoparticles under deformation. By combining these two approaches, we show that the elastic properties of such nano-objects are driven by their size but, above all, by their shape. This outcome was achieved by introducing a descriptor in the analysis of our results enabling to distinguish among the different nanoparticle shapes studied in the present work.\nIn addition, other transition-metal nanoparticles have been considered (copper and platinum) using the aforementioned approach. The same strong dependence of the elastic properties with the shape was revealed, thus highlighting the universal character of our achievements. \n\n\n\n\n\nTuning Elastic Properties of Metallic Nanoparticles by Shape Controlling: \n\nFrom Atomistic to Continuous Models\n    Riccardo Gatti\n    March 30, 2023\n===============================================================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nMetallic nanoparticles (NPs) are fascinating objects with unique properties that differ significantly from their bulk counterparts due to their high surface area to volume ratio. Consequently, many nanoparticle-based technology approaches are foreseen in different fields such as catalysis, medical or optics applications <cit.>. However, NPs can be subjected to mechanical constraints, whatever their domain of use, leading to structural modifications or even irreversible changes that can drastically  affect their intended application <cit.>. In this context, understanding the structural modifications of small-sized metallic NPs induced by elastic deformations is crucial. Yet, this must be adressed by taking into account that the physics at the nanoscale is particular, especially for NPs whose diameter is smaller than around 10 nm. Typical examples include the dependence on the size of the melting temperature <cit.> or surface energy <cit.> in case of pure NPs as well as the order-disorder transition temperature for bimetallic nanoalloys <cit.>. \n\nRegarding the mechanical properties of metallic materials, an increase in strength is commonly observed when the characteristic microstructural length scale is reduced <cit.>. This mainly concerns systems with a minimal size of the order of a hundred nanometers where three regimes have been highlighted In case of plastic deformations: the nanometer regime (∼ 100 nm and below), an intermediate regime (between 100 nm and approximately 1 μ m), and a bulk-like regime <cit.>. However, the study of the mechanical properties of NPs of a few nanometers is much more complex. From an experimental point of view, in situ Transmission Electron Microscopy nanoindentation is a suitable tool for addressing this issue as it provides real-time monitoring of the deformation <cit.>. Although powerful, these techniques are rather cumbersome limiting their use for systematic studies and often require a numerical support. Indeed, different theoretical models based on analytical calculations have been proposed to characterize the structural properties of NPs under elastic deformation <cit.>. Despite being attractive on a purely formal point of view, these models are not really adapted to NPs since they do not take explicitly into account their finite shape i.e. the prevalent role of the surfaces, the vertices and the edges that lead to specific structural properties. More specifically, the nature of the different surface sites should not be ignored, especially since as the size decreases, the contribution of facets, which are predominant for large dimensions, decreases in favour of vertices and edges. In order to obtain an atomic-scale view, in which the surface sites are clearly treated, computer simulations are generally considered very useful tools to investigate the mechanical properties of NPs. Among the possible techniques <cit.>, molecular dynamics (MD) simulations are the most widespread as they enable to precisely characterize the elastic and plastic mechanisms of NPs under deformation whose sizes are close to the experiments <cit.>. \n\nSurprisingly, there is no exhaustive study regarding the effects of size and shape on the elastic properties of NPs. Most of the previously published works concerned uniaxial compression along a specific orientation for fairly large NPs (above 10 nm) whose shape is rarely observed (cubic, spherical, truncated spherical, ...). However, these studies are incomplete to better understand and predict the properties of metallic NPs under elastic deformation. To address this issue, different sizes (ranging from 4 to 25 nm) and shapes (truncated-cube, cubo-octahedra and Wulff) of NPs, close to those experimentally observed, are investigated using complementary approaches, i.e. MD and Finite elements (FE). Thanks to these approaches, the elastic deformations during nanoindentation along the (111) and (001) facets are analyzed. NPs of three different metal (Au,Cu,Pt) will be considered to draw conclusions as general as possible.\n\n\n\n§ METHODOLOGY\n\n\n\n\n\n §.§ Nanoparticles\n\n\nNanoparticles are systems of finite size that cannot be considered as simple fragments of a crystalline solid thus adopting structural arrangements that differ from the those of bulk <cit.>. In this context, Wulff established a well known rule to describe the equilibrium forms of  free polyhedral crystals <cit.> that has been extended to supported systems <cit.>. Among all the possible identified structures, we focus our study on morphologies that are observed experimentally , i.e. truncated cube, cuboctahedral and Wulff shapes (see Fig. <ref>a). Note that the particular case of icosahedral NPs, common for small aggregates, is not considered here since the icosahedral arrangement is unstable for particles larger than 4-5 nanometers.\n\n \n\nAs seen in Fig. <ref>b, the shapes addressed in the present work are based on the face-centered cubic (FCC) lattice, leading to the presence of outer facets of (111) and (001) orientations. To highlight size effects, NPs with diameters (d) ranging from 4 to 25 nm range (around 10^2  to 10^6 atoms, respectively) are taken into account. More precisely, d is defined as following: \n\n    d = 2 ·(3V_eff/4π)^1/3\n\nwith V_eff being the effective volume of a sphere equal to the exact volume of the considered nanoparticle. The size is strictly related to the number of atoms of the NP and allows us a more methodical study of different shapes at same size. Lastly, different transition metal elements (Au, Cu and Pt) are considered to generalize as much as possible our conclusions on the elastic properties. \n\n\nIn the following, the NPs deformation procedure using plane indenters (see Fig. <ref>c) is detailed from atomistic and continuous approaches. \n\n\n\n\n §.§ Atomistic calculations - Molecular Dynamics\n\n\nThe MD simulations are carried out using the open source Large-scale Atomic/Molecular Massively Parallel Simulators (LAMMPS) package <cit.>. To study nano-indentation of NPs,  we apply the methodology successfully adopted in Ref. <cit.>. In this study, we explore Au, Cu and Pt NPs at the atomic level by using a specific N-body inter-atomic potential derived from the second moment approximation of the tight-binding scheme (TB-SMA). <cit.> \n\n\n\nThe accuracy of TB-SMA models depends critically on the validity of the database to which the parameters of the potentials are fitted. Here, we summarize only the crucial points of the TB-SMA potential and refer the reader to the Ref. <cit.> for more details. In particular, the parameters of the TB-SMA potentials are obtained by fitting on the experimental values of the lattice parameter, the cohesive energy, and the elastic moduli (bulk modulus and the two shear moduli) for a FCC structure as seen in Table <ref>. Such approach is then perfectly adapted to deal with large systems (∼1000 to 10000 atoms) and to reproduce the main energetic properties of transition and noble metals. Using this approach, it is interesting to note that we are able to distinguish the different surface sites, i.e. vertices, edges and facets. Obviously, with increasing size the contribution of the vertices and edges, which are preponderant for small sizes, decreases in favour of the facets.\n\n\n\n\nTo model NPs  compression via the nanoindentation procedure, the Verlet algorithm with a timestep of 1 fs combined with the Nose-Hoover thermostat at 0.01 K is used for the integration of equations of motion in the NVT canonical ensemble.  The size of the supercell in the all directions is large enough to avoid artefacts due to interaction between images caused by periodic boundary conditions. Prior to compression, the NPs are relaxed at 0.01 K until convergence of the total energy (a relative error of ϵ_r = 10^-5 has been considered) to get the equilibrium configuration. As seen in Fig. <ref>c, the indenter and substrate are simulated with two rigid infinite planes, parallel to the (001) or (111) facet of the NP. The effect of an indenter is implemented by introducing in the MD simulation fictitious repulsive forces to be integrated. In the present simulations, we used a quadratic repulsive force: F(r) = -K (r-R)^2 with K = 1000 eV.Å^-3 and R corresponding to the indenter position in agreement with previous works <cit.>. During the simulation we use two moving indenters (bottom and top plane in Fig. <ref>c), each of them applying a strain rate of about 3· 10^7s^-1 which corresponds to an indenter velocity of roughly  0.06 to 0.6 m.s^-1  As stated in the Ref. <cit.>, the velocity has to be less than the speed of sound in the considered material to allow the atoms to reorganise before a new displacement is imposed.\n\n\n\n\n §.§ Continuous modeling - Finite Element\n\n\nIn our continuous approach, indentation has been modeled using FE method assuming a linear elastic material. Within this framework, the stress acting on a system is directly proportional to its deformation and can be expressed by the Hooke's law so that σ = E ·ϵ, where σ and ϵ are, respectively, the second order stress and strain tensor and E is the elastic constant third order tensor. In FE calculations, the linear elastic problem can be solved by computing the mechanical equilibrium, using the Hooke's law, in a discrete domain (here the NP), imposing the proper boundary conditions. In this study, we used an open source FE code named FEniCS <cit.> where second order partial differential equations and a variational approach are adapted to handle a linear elastic problem. The continuous domain is discretised in a three dimensional mesh, where the solution, the displacement field, is computed at the nodes (see Fig. <ref>a). It is worth noting that the generation of an accurate mesh is a fundamental step for obtaining results comparable with atomistic simulations. With this purpose, the meshes are refined until the results converge by means of a linear iterative solver. Similar to atomic-scale MD studies, a displacement is applied as a boundary conditions, to mimic a rigid indenter, at the top surface of the NP while the bottom surface is fixed. A non uniform mesh is generated with more points on the regions near the contact surfaces (i.e. the top and the bottom surfaces), where more heterogeneous stress field is expected, as seen in Fig. <ref>a. Moreover, the resolution of the continuous equations implies to consider the proper elastic constants of the studied system.  In this case, the cubic symmetry of the bulk FCC crystal imposes that only three independent elastic constants are expected (c_11, c_12 and c_44). To ensure consistency with the MD simulations, the values considered here are those calculated at the atomic scale from the TB-SMA potentials (see Table <ref>), using anisotropic formulation of the Hooke's law.\n\n\n\n\n§ GOLD NANOPARTICLES\n\n\nThe elastic properties of gold NPs calculated by the two previous approaches are now compared macroscopically and locally. First, the true stress true strain curves are investigated to identify the overall mechanical properties. In a second step, the stress maps are calculated to have a local insight of the elastic deformations of NPs. \n\n\n\n\n §.§ Stress - strain curves\n\n\nWe first examine the mechanical response of NPs under deformation by means of stress-strain curves. Figure <ref> shows a typical example of this analysis for a given size and shape of Au NP. \n\n \n\n \n\nRegarding the MD simulations, the characteristics common to all the calculated results show two main regimes. During the very early stages of the loading, the stress variation is initially linear corresponding to an elastic regime. Then, the stress has a peak value, which defines the yield point corresponding to the largest stress that the NP can handle. Above this point, a meaningful reduction of the stress is noticed, which indicates that the plastic deformation has been activated. More precisely, the emergence of plasticity in NPs results from the heterogeneous nucleation of dislocations from the contact surfaces <cit.>. In the case of FE calculations, it can be noticed that only the elastic part is probed since FE formulation is based on the Hooke's law (see Fig. <ref>). By focusing on the initial deformation process, elastic properties can be extracted. To this purpose, it is therefore necessary to determine a macroscopic quantity to analyze the global behavior of the NP under elastic deformation. As done in previous works <cit.>, we define an average value named the true stress compression equal to the ratio between the force applied by the indenter and the surface contact area (A). At the atomic level, A is not a well defined concept. As a result, many approaches exist but all of them follow the same recipe <cit.>. Firstly, we need to identify the atoms in contact with the indenter. In our case, all atoms at a distance lower than 1 Å from the considered indenter. It is noteworthy that no significant differences are reported by slightly varying this parameter. Then, A is determined by computing a Delaunay triangulation of the points defined by the coordinates of atom centers at each indenter displacement. Consequently, the true stress strain in MD calculations can be obtained, since the indenter position is a known quantity. From FE calculations, the true strain stress is an easy accessible data. The only difficulty lays in the force calculation which is not straightforward and this has to be done by computing the reaction force generated by the NP  on the surface where the displacement is imposed. \n\n\nTo highlight elastic size effect, the mechanical responses of  NPs of different diameters d are considered. Figure <ref> depicts the stress-strain curves of a small (d=4 nm) and larger (d=18 nm) Wulff NPs nanoindented with plane indenter on the (001) and (111) facets. In the case of MD simulations, deviation from linearity in the elastic regime is observed for the small NP as seen in Fig. <ref>a. This trend is found for all particles below 5-6 nm in agreement with previous calculations <cit.> where the influence of surfaces on the mechanical behavior inside small NPs is emphasized. For the larger NPs, a linear trend is observed in the elastic regime until plastic deformation, whatever the facet considered (see Fig. <ref>b). Obviously, finite elements fail to reproduce the deviation from the linear regime observed for small particles (intrinsically, no deviation from linearity can be observed). In contrast, the agreement between MD and finite elements for larger particles is quite remarkable proving that a linear elasticity framework can be used to model mechanical properties at the nanoscale. Besides, plastic behaviour can be noticed in MD results:  the critical yield stress (σ_C) can be extracted since it corresponds to the maximum value before a drop, corresponding to dislocation nucleation events. As already discussed in <cit.>, increasing the NPs size implies a reduction in the critical stress according to the following equation: σ_C = α· d^-B where α and B are fitted values. We found that for the (001) and (111) facets, B is equal to 0.461 and 0.523, respectively. The second value is in good agreement with the 0.530 ± 0.013 found by Feruz et al. for Wulff structure <cit.>. Note that so far only (111) facets were considered in the literature. Hence, we show here that this size-dependent strength can also be extended to (001) facets. A more detailed analysis on the onset of plasticity in FCC metal NPs will be presented in a future work.\n\n\n\n\n\nTo better analyse the elastic behaviour of NPs, effective Young modulus (E_eff i.e. Δσ /Δϵ ) are extracted from the stress-strain curves for all NP sizes. The results for indentation on both facets are presented in Fig. <ref>. Above 5 nm, it can be observed that MD and FE calculations provide very similar results with extremely low errors. This is not so surprising for large particles since finite elements reproduce the elastic domain very well as revealed in Fig. <ref>b. For smaller particles, it is clear that the deviation from linearity already discussed in Fig. <ref>b is not reproduced with FE calculations. Furthermore, the parameter E_eff is also difficult to be defined for small Nps. For this reason an error bar is introduced that consider different possible linear fit for the elastic part of a given nanoparticle stress-strain curve. Due to the deviation from linearity using MD calculations, E_eff values for small NP have larger error bars than the large ones. Nevertheless, when comparing results from FE and MD calculations even for small NPs, the global slope of the curve is rather correct enabling to get effective Young modulus values in agreement between both approaches.  As the size of the nanoparticles increase the value of the effective Young modulus for both (001) and (111) indentation converges to a plateau <cit.>. while the E_eff^(111) is larger than E_eff^(001), as expected in anisotropic media (E^(111) > E^(001) for bulk),  the value of the plateau depends on the shape of the NP, as it will be highlighted in section <ref>.\n\n\n\n\n\n\n §.§ Stress Map\n\n\nIn the previous section we discussed the mechanical properties of NPs from a global point view   via the stress-strain curve. Here we want to analyse local elastic properties, by the means of stress maps, comparing MD and FE outcomes. In order to highlight the similarities between the two simulation approaches, the surface contraction peculiar to transition metals <cit.> reproduced in atomistic simulations is neglected. Therefore, we took as reference state (no stress in the NP) the atomic positions after relaxation steps. Concerning the FE approach, the displacement fields is computed at each node of the mesh for an imposed indentation depth. From this displacement field, the stress is computed and by interpolation is projected on the mesh nodes. Obviously, the mesh size is crucial to achieve robust results. Therefore, the mesh was refined until the convergence of stress values. In Fig. <ref>, the stress distributions obtained from MD and FE calculations are presented in case of small (6 nm) and large (20 nm) NPs. This corresponds to nanoindentations on a (001) facet (on the left) and on a (111) facet (on the right) at 2.5% strain, in a linear regime. Concerning the (001) indentation, stress is concentrated in two conical regions, close to the plane indenters. For all the components of the stress field, the maximum value is observed at the corners as already discussed in <cit.>. If we observe the ZZ component, the stress field is negative due to the compression imposed by the applied loading and we can notice that with the presence of free surfaces, the stress decrease rapidly moving from the top or the bottom surface to the center of the nanoparticle. Remarkably, FE and MD calculations give very similar results for both NP sizes: the values for stress tensor components computed with the two approaches are very close, with differences less than 5 %. Such common features were also obtained for a nano-indentation on the (111) facets, for any particle sizes and shapes. The only dissimilarity with (001) indentation is that the stress distribution is more homogeneous in the z direction. This is because the plane indenters has a larger contact area, indeed for Wulff structures (111) surfaces are wider then (001). \n\n\nStudying nanoindentation of a Wulff Au nanoparticle, we have shown both finite elements and atomistic simulations are perfectly adapted to capture the elastic properties on both a local (stess map) and a global (stress-strain curve) viewpoint. The agreement betwween the two different approaches is good, notably for NPs with diameter above 5 nm. It is then tempting to think that such features are mainly driven by the shape of the particle and not by atomistic features such as the presence of specific surface sites (edges, vertices and surface arrangement).\n\n\n\n§  SHAPE EFFECTS\n\n\nTo  highlight  shape  effect on the elastic properties,  the  mechanical  responses  of different Au NPs  are considered. In Fig. <ref>, the calculated effective Young modulus for various NP shape as a function of size are presented. \n\n\n\nFirst, we can notice that the general observation of section <ref> for Wulff shape NPs are valid also for truncated-octahedra and truncated cubes: for NPs larger than 5 nm the value of E_eff converge to a plateau and no visible size effect is observed. In the case of the truncated-octahedron, there is a stronger variation of the E_eff values for small size NPs (<5 nm) in MD calculations, from ∼ 200 to ∼ 175 GPa. For larger particles, E_eff reaches a constant value around 175 GPa. Again, FE approach is not able to reproduce such a size dependence, suggesting that the role of specific surface sites cannot be neglected in small NPs.\nOn the other hand, the agreement between FE and MD for larger particles is quite remarkable. More interestingly, a strong shape effect is observed in Fig. <ref>, where the E_eff plateau value changes depending on the shape. Indeed, wide differences are obtained ranging from ∼ 50 GPa (truncated cube) to ∼ 175 GPa (truncated octahedra). To further emphasise the observed shape effect, we introduce a descriptor G to classify the shape of the NPs with respect to the ratio between (001) and (111) facets:\n\n    G=8 · A_(111)/6· A_(001),\n \nwhere A_(111) and A_(001) are the area of the (111) and (001) facets, respectively. The factors 8 and 6 correspond to the number of free surfaces. \n\n\n\nFrom this descriptor, it is then possible to clearly distinguish the different shapes considered in our study (see Fig. <ref>). Moreover, two limiting cases are also identified: the cube and the octahedron with G=0 and G=∞, respectively. At a given NP size (here 20 nm), Fig. <ref>b depicts the variation of the effective Young modulus for different shapes. Again, a very good agreement is found between FE and MD calculations. A maximum difference of about 4% is revealed and corresponds to  the truncated-cube shapes. Such deviation is due to the non linearity of the stress-strain curves in approaching a cubic system (for cubes a very large elastic deformation of about 10 %  is observed before the plastic onset, so non-linear behaviour is observed in MD simulations).  \n\n\n\nVery interestingly, a significant variation of the order of 200 GPa can be observed between the two limiting shapes. This considerable effect illustrates that the influence of the NP shapes on the elastic properties is huge for a 20 nm nanoparticle. \n\n\nTo generalize, E_eff computed values in function of  different shapes (G descriptor) and of NP sizes ranging from 4 to 25 nm is presented in Fig. <ref> in a bi-dimensional map for MD simulations (left panel) for FE simulation (right panel). On one hand, no size effect is identified (above 5nm). Indeed, the variation of the E_eff with the size of the NP is negligible, never exceeding few GPa for a given NP shape. On the other hand, significant variation of the effective young's modulus are remarked with NP shape. From truncated-cube to truncated-octahedron structures, a difference of about 150 GPa on the effective young's modulus is reported. Here again, we can note that the agreement between the atomistic and finite element calculations is remarkable whatever the shape and size of the NP.\n\n\nAll the results presented so far concern nano-indentation on (001) facets. Meanwhile, the same conclusions have been achieved by investigating the deformation mechanisms on (111) facets (see Sec. I. of the Supplemental Materials). It is important to stress that our analysis show that the shape, not the size, of the gold NPs has a wide impact on its macroscopic measured elastic properties. \n\n\n\n§ GENERALIZATION TO OTHER SYSTEMS\n\n\nIn the previous sections, the investigations were focused on gold NPs. To generalize our conclusions, the analysis of the elastic properties of NPs has been extended to other metals, such as Cu and Pt. The calculated effective Young modulus are presented in Fig. <ref> for different sizes and shapes in case of Au, Co and Pt by imposing nanoindentation on (001) facets. More results can be found in Sec. II and III of the Supplemental Materials for Cu and Pt, respectively. \n\n\n\nWhatever the material considered, we first see that the finite elements reproduce the atomistic calculations for NP sizes exceeding 5 nm. For smaller diameters, the differences are fairly notable for Cu and Pt (<40 GPa ) but minor for Au NPs (<15 GPa). Beyond this limit, no size effect is reported with a constant value for E_eff. More interestingly, it can be seen that the elastic properties vary strongly with the shape of the particle. As shown in Fig. <ref>b, significant variations of the elastic properties are highlighted whatever the transition metals. Indeed, E_eff varies of hundreds of GPa moving from small value to large value of G. For the nanoindentation of the (111) facet, the same trend is observed, and the same conclusions can be drawn for Cu and Pt, as seen in Sec. IV and V of the Supplemental Materials, respectively.\n\n\n\n§ CONCLUSION\n\n\nIn this work, we have presented an extensive study on elastic deformations of metallic nanoparticles with different shapes and sizes, imposing a mechanical loading via nano-indentation on (001) and (111) facets. By combining atomistic and continuous calculations, no size effect is revealed for nanoparticles with a diameter of larger than 5 nm. More interestingly, we have shown that the elastic properties of NPs are highly driven by the shape of the particle, finding that the ratio between  (111) and (001) is a suitable descriptor to address this shape dependence. These results were achieved by nanoindenting Au, Cu and Pt NPs, showing that our conclusion can be applied to different transition metal nanoparticles. Thanks to this study, we can state that controlling the shape of nanoparticles can be viable path for the engineering of a new class of nano-objects with unique and targeted mechanical properties. \n\n\n\n\n§ SUPPLEMENTAL MATERIAL : \nTUNING ELASTIC PROPERTIES OF METALLIC NANOPARTICLES BY SHAPE CONTROLLING: \n\nFROM ATOMISTIC TO CONTINUOUS MODELS\n\n\nSec. I. Elastic properties of Au nanoparticles under (111) deformation\n\n\nAll the results concerning the elastic properties of gold nanoparticles for nanoindentation on (111) facets are presented in the Fig. <ref>, <ref> and <ref>. \n\n\n\n\n\n\n\n\n\n\n\n\nSec. II. Elastic properties of Cu nanoparticles under (001) deformation\n\n\nMore results concerning the elastic properties of Copper nanoparticles for nanoindentation on (001) facets are presented in the Fig. <ref> and <ref>. \n\n\n\n\n\n\n\n\n\nSec. III. Elastic properties of Pt nanoparticles under (001) deformation \n\n\nMore results concerning the elastic properties of Platinum nanoparticles for nanoindentation on (001) facets are presented in the Fig. <ref> and <ref>. \n\n\n\n\n\n\n\n\n\nSec. IV. Elastic properties of Cu nanoparticles under (111) deformation\n\n\nAll the results concerning the elastic properties of Cu nanoparticles for nanoindentation on (111) facets are presented in the Fig. <ref> and <ref> \n\n\n\n\n\n\n\n\nSec. V. Elastic properties of Pt nanoparticles under (111) deformation\n\n\nAll the results concerning the elastic properties of Pt nanoparticles for nanoindentation on (111) facets are presented in the Fig. <ref> and <ref> \n\n\n\n\n\n\n\n\n\nH.A. thanks C. Ricolleau for fruitful discussions. \n\n\n\n38\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[He et al.(2018)He,\n  Zhang, Tang, Sun,\n  Zhang, and Sun]He2018\n  author author L.-B. He, author L. Zhang, author L.-P. Tang, author\n  J. Sun, author Q.-B. Zhang,  and author L.-T. Sun, title title Novel behaviors/properties of nanometals induced by surface\n  effects, 10.1016/j.mtnano.2018.04.006 journal journal Mater. Today Nano. volume 1, pages 8–21 (year\n  2018)NoStop\n[Guo et al.(2013)Guo,\n  Xie, and Luo]Guo2013\n  author author D. Guo, author G. Xie,  and  author J. Luo, title title Mechanical properties of nanoparticles:\n  basics and applications, 10.1088/0022-3727/47/1/013001\n  journal journal J. Phys. D: Appl. Phys.  volume 47, pages 013001 (year 2013)NoStop\n[Buffat and Borel(1976)]Buffat1976\n  author author Ph. Buffat and author J-P. Borel, title title Size effect on\n  the melting temperature of gold particles, 10.1103/PhysRevA.13.2287 journal journal Phys.\n  Rev. A volume 13, pages 2287–2298\n  (year 1976)NoStop\n[Amara et al.(2022)Amara,\n  Nelayah, Creuze, Chmielewski,\n  Alloyeau, Ricolleau, and Legrand]Amara2022\n  author author H. Amara, author J. Nelayah,\n  author J. Creuze, author A. Chmielewski, author\n  D. Alloyeau, author\n  C. Ricolleau,  and author\n  B. Legrand, title title Effect of size on the surface energy of noble metal\n  nanoparticles from analytical and numerical approaches, 10.1103/PhysRevB.105.165403 journal journal\n  Phys. Rev. B volume 105, pages\n  165403 (year 2022)NoStop\n[Alloyeau et al.(2009)Alloyeau, Ricolleau, Mottet, Oikawa, Langlois, Le Bouar, Braidy, and Loiseau]Alloyeau2009\n  author author D. Alloyeau, author C. Ricolleau,\n  author C. Mottet, author T. Oikawa, author\n  C. Langlois, author\n  Y. Le Bouar, author\n  N. Braidy,  and author\n  A. Loiseau, title title Size and shape effects on the order-disorder phase\n  transition in CoPt nanoparticles. 10.1038/nmat2574\n  journal journal Nat. Mater. volume 8, pages 940–6 (year\n  2009)NoStop\n[Uchic et al.(2004)Uchic,\n  Dimiduk, Florando, and Nix]Uchic2004\n  author author M. D. Uchic, author D. M. Dimiduk,\n  author J. N. Florando,  and  author W. D. Nix, title title Sample dimensions influence strength and\n  crystal plasticity, 10.1126/science.1098993 journal journal Science volume\n  305, pages 986–989 (year 2004)NoStop\n[Wu et al.(2005)Wu,\n  Heidelberg, and Boland]Wu2005\n  author author B. Wu, author A. Heidelberg,   and author J. J. Boland,  title title Mechanical properties of\n  ultrahigh-strength gold nanowires, 10.1038/nmat1403\n  journal journal Nat. Mater. volume 4, pages 525–529 (year\n  2005)NoStop\n[Kraft et al.(2010)Kraft,\n  Gruber, Mönig, and Weygand]Kraft2010\n  author author O. Kraft, author P. A. Gruber,\n  author R. Mönig,  and  author D. Weygand, title title Plasticity in confined dimensions,  10.1146/annurev-matsci-082908-145409 journal\n  journal Annu. Rev. Mater. Res. volume\n  40, pages 293–317 (year 2010)NoStop\n[Deneen et al.(2006)Deneen,\n  Mook, Minor, Gerberich, and  Carter]Deneen2006\n  author author J. Deneen, author W. M. Mook,\n  author A. Minor, author W. W. Gerberich,  and author C. B. Carter, title\n  title In situ deformation of silicon nanospheres,  10.1007/s10853-006-0085-9 journal journal J. Mater. Sci. volume 41, pages 4477–4483 (year 2006)NoStop\n[Carlton and Ferreira(2012)]Carlton2012\n  author author C.E. Carlton and author P.J. Ferreira, title title In situ tem\n  nanoindentation of nanoparticles, https://doi.org/10.1016/j.micron.2012.03.002 journal journal Micron volume 43, pages\n  1134–1139 (year 2012)NoStop\n[Legros(2014)]Legros2014\n  author author M. Legros, title title In situ\n  mechanical TEM: Seeing and measuring under stress with electrons, https://doi.org/10.1016/j.crhy.2014.02.002 journal\n  journal C. R. Phys. volume 15,  pages 224–240 (year 2014)NoStop\n[de la Rosa Abad et al.(2021)de la Rosa Abad, Londoño Calderon, Bringa, Soldano, Paz, Santiago, Mejía-Rosales, Yacamán,  and Mariscal]Abad2021\n  author author J. A. de la Rosa Abad, author A. Londoño Calderon, author E. M.  Bringa, author G. J.  Soldano, author S. A.  Paz, author U. Santiago, author S. J. Mejía-Rosales, author M. J. Yacamán,  and author M. M. Mariscal, title title Soft or hard?\n  investigating the deformation mechanisms of Au-Pd and Pd nanocubes\n  under compression: An experimental and molecular dynamics study, 10.1021/acs.jpcc.1c07685 journal journal J. Phys. Chem. C volume 125, pages 25298–25306 (year 2021)NoStop\n[Cuenot et al.(2004)Cuenot,\n  Frétigny, Demoustier-Champagne, and  Nysten]Cuenot2004\n  author author S. Cuenot, author C. Frétigny,\n  author S. Demoustier-Champagne,   and author B. Nysten,  title title Surface tension effect on\n  the mechanical properties of nanomaterials measured by atomic force\n  microscopy, 10.1103/PhysRevB.69.165410 journal journal Phys. Rev. B volume\n  69, pages 165410 (year 2004)NoStop\n[Shaat(2019)]Shaat2019\n  author author M. Shaat, title title Size-dependence\n  of young's modulus and poisson's ratio: Effects of material dispersion,  https://doi.org/10.1016/j.mechmat.2019.03.012 journal journal Mech. Mater. volume\n  133, pages 111–119 (year 2019)NoStop\n[Cherian et al.(2010)Cherian, Gerard, Mahadevan, Cuong, and Maezono]Cherian2010\n  author author R. Cherian, author C. Gerard,\n  author P. Mahadevan, author Nguyen Thanh Cuong,  and  author Ryo Maezono, title title Size dependence of the bulk modulus of\n  semiconductor nanocrystals from first-principles calculations, 10.1103/PhysRevB.82.235321 journal journal Phys. Rev. B volume 82, pages 235321 (year 2010)NoStop\n[Pizzagalli(2020)]Pizzagalli2020\n  author author L. Pizzagalli, title title\n  Finite-temperature mechanical properties of nanostructures with\n  first-principles accuracy, 10.1103/PhysRevB.102.094102\n  journal journal Phys. Rev. B volume 102, pages 094102 (year\n  2020)NoStop\n[Amodeo and Pizzagalli(2021)]Amodeo2021\n  author author J. Amodeo and author L. Pizzagalli, title title Modeling the\n  mechanical properties of nanoparticles: a review, 10.5802/crphys.70 journal journal C. R. Phys.  volume 22, pages 35–66 (year 2021)NoStop\n[Mordehai et al.(2011)Mordehai, Lee, Backes, Srolovitz, Nix, and Rabkin]Mordehai2011\n  author author D. Mordehai, author S. W. Lee,\n  author B. Backes, author D. J. Srolovitz, author\n  W. D. Nix,  and author\n  E. Rabkin, title title Size effect in compression of single-crystal gold\n  microparticles, 10.1016/j.actamat.2011.04.057\n  journal journal Acta Mater. volume 59, pages 5202–5215 (year\n  2011)NoStop\n[Feruz and Mordehai(2016)]Feruz2016\n  author author Y. Feruz and author D. Mordehai, title title Towards a\n  universal size-dependent strength of face-centered cubic nanoparticles,  10.1016/j.actamat.2015.10.027 journal\n  journal Acta Mater. volume 103,  pages 433–441 (year 2016)NoStop\n[Kilymis et al.(2018)Kilymis, Gérard, Amodeo,\n  Waghmare, and Pizzagalli]Kilymis2018\n  author author D. Kilymis, author C. Gérard, author J. Amodeo, author U. V. Waghmare,  and author L. Pizzagalli, title title Uniaxial\n  compression of silicon nanoparticles: An atomistic study on the shape and\n  size effects, 10.1016/j.actamat.2018.07.063 journal journal Acta Mater. volume\n  158, pages 155–166 (year 2018)NoStop\n[de la Rosa Abad et al.(2023)de la Rosa Abad, Bringa, Mejía-Rosales, and Mariscal]Abad2023\n  author author J. A. de la Rosa Abad, author E. M. Bringa, author S. J. Mejía-Rosales,  and author M. M.  Mariscal, title title\n  On the mechanical response in nanoalloys: the case of NiCo, 10.1039/D2FD00111J journal journal\n  Faraday Discuss. volume 242, pages\n  23–34 (year 2023)NoStop\n[Henry(2005)]Henry2005\n  author author C. R. Henry, title title Morphology of\n  supported nanoparticles, 10.1016/j.progsurf.2005.09.004\n  journal journal Progr. Surf. Sci. volume 80, pages 92–116 (year\n  2005)NoStop\n[Wulff(1901)]wulff1901\n  author author G. Wulff, title title Zur Frage der\n  Geschwindigkeit des Wachsthums und der Auflösung der Krystallflächen,  https://doi.org/10.1524/zkri.1901.34.1.449 journal journal Z. Kristallogr. volume\n  34, pages 449 (year 1901)NoStop\n[Kaischew(1952)]Kaischew1952\n  author author R. Kaischew, @noop  title Arbeitstagung\n  Festkörper Physik (publisher Dresden, year\n  1952) p. pages 81NoStop\n[Plimpton(1995)]Plimpton1995\n  author author S. Plimpton, title title Fast parallel\n  algorithms for short-range molecular dynamics, https://doi.org/10.1006/jcph.1995.1039 journal journal J. Comput. Phys. volume 117, pages 1–19 (year 1995)NoStop\n[Roy et al.(2019)Roy,\n  Gatti, Devincre, and Mordehai]Roy2019\n  author author S. Roy, author R. Gatti, author B. Devincre,  and author D. Mordehai, title\n  title A multiscale study of the size-effect in\n  nanoindentation of Au nanoparticles, 10.1016/j.commatsci.2019.02.013 journal journal\n  Comput. Mater. Sci. volume 162, pages\n  47–59 (year 2019)NoStop\n[Ducastelle(1970)]Ducastelle1970\n  author author F. Ducastelle, title title Module\n  élastique des métaux de transition, https://doi.org/10.1051/jphys:019700031011-120105500 journal\n  journal J. Phys. (Paris) volume 31,  pages 1055 (year 1970)NoStop\n[Rosato et al.(1989)Rosato,\n  Guillopé, and Legrand]Rosato1989\n  author author V. Rosato, author M. Guillopé,\n   and author B. Legrand,  title title Thermodynamical and\n  structural properties of f.c.c. transition metals using a simple\n  tight-binding model, DOI: 10.1080/01418618908205062\n  journal journal Philos. Mag. A volume 59, pages 321 (year\n  1989)NoStop\n[Kittel(1995)]Kittel1995\n  author author C. Kittel, @noop  title Introduction to Solid\n  State Physics (publisher Wiley, New York, year\n  1995)NoStop\n[Simmons and Wang(1971)]Simmons1971\n  author author G. Simmons and author H. Wang,  @noop  title Single Crystal Elastic Constants and\n  Calculated Aggregates Properties (publisher MIT,\n  Cambridge, year 1971)NoStop\n[Delfour et al.(2009)Delfour, Creuze, and Legrand]Delfour2009\n  author author L. Delfour, author J. Creuze,   and author B. Legrand,  title title Exotic behavior of the outer\n  shell of bimetallic nanoalloys, 10.1103/PhysRevLett.103.205701 journal journal\n  Phys. Rev. Lett. volume 103, pages\n  205701 (year 2009)NoStop\n[Chmielewski et al.(2018)Chmielewski, Nelayah, Amara, Creuze, Alloyeau, Wang, and Ricolleau]Chmielewski2018\n  author author A. Chmielewski, author J. Nelayah, author H. Amara,\n  author J. Creuze, author D. Alloyeau, author\n  G. Wang,  and author\n  C. Ricolleau, title title Direct Measurement of the Surface Energy of Bimetallic\n  Nanoparticles: Evidence of Vegard's Rulelike Dependence, 10.1103/PhysRevLett.120.025901 journal journal\n  Phys. Rev. Lett. volume 120, pages\n  025901 (year 2018)NoStop\n[Front and Mottet(2021)]Front2021\n  author author A. Front and author C. Mottet,  title title Stress effect on segregation\n  and ordering in Pt-Ag nanoalloys, 10.1088/1361-648x/abe07a journal journal J.\n  Phys.: Condens. Matter volume 33, pages\n  154006 (year 2021)NoStop\n[Alnæs et al.(2015)Alnæs, Blechta, Hake, Johansson, Kehlet, Logg, Richardson, Ring, Rognes, and  Wells]Fenics\n  author author M. S. Alnæs, author J. Blechta,\n  author J. Hake, author\n  A. Johansson, author\n  B. Kehlet, author A. Logg, author C. Richardson, author J. Ring,\n  author M. E. Rognes,  and  author G. N. Wells, title title The FEniCS Project Version 1.5,  10.11588/ans.2015.100.20553 journal journal Archive of Numerical Software volume\n  3, pages 9–23 (year 2015)NoStop\n[Jacobs and Martini(2017)]Jacobs2017\n  author author T. D. B.  Jacobs and author A. Martini, title title Measuring and Understanding Contact Area at the Nanoscale: A\n  Review, 10.1115/1.4038130 journal\n  journal Appl. Mech. Rev. volume 69,  pages 060802 (year 2017)NoStop\n[Amodeo and Lizoul(2017)]Amodeo2017\n  author author J. Amodeo and author K. Lizoul, title title Mechanical\n  properties and dislocation nucleation in nanocrystals with blunt edges,  https://doi.org/10.1016/j.matdes.2017.09.009 journal journal Mater. Des. volume\n  135, pages 223–231 (year 2017)NoStop\n[Armstrong and Peukert(2012)]Armstrong2012\n  author author P. Armstrong and author W. Peukert, title title Size effects in\n  the elastic deformation behavior of metallic nanoparticles, 10.1007/s11051-012-1288-4 journal journal J. Nanopart. Res. volume 14 (year 2012), 10.1007/s11051-012-1288-4NoStop\n[Gupta(1981)]Gupta1981\n  author author R. P. Gupta, title title Lattice\n  relaxation at a metal surface, 10.1103/PhysRevB.23.6265\n  journal journal Phys. Rev. B volume 23, pages 6265–6270 (year\n  1981)NoStop\n\n"}