{"entry_id": "http://arxiv.org/abs/2303.06993v1", "published": "20230313104925", "title": "Actor-Critic learning for mean-field control in continuous time", "authors": ["Noufel Frikha", "Maximilien Germain", "Mathieu Laurière", "Huyên Pham", "Xuanye Song"], "primary_category": "stat.ML", "categories": ["stat.ML", "math.OC"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nequationsection\n\n\n\n\n\n \n\n\n \n \n \n\n\n\n\n\n\n\n\n\nshowonlyrefs\n\n\n\n\n\nfit,matrix,chains,positioning,decorations.pathreplacing,arrows\n\n\nshowonlyrefs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nletterpaper, \nleft=   30 mm,\nright=  20 mm,\ntop=    45 mm,\nbottom= 45 mm,\n\n\n \n^⊺\n\n▸\n\n \n\n\n\n\n#1#2#1#22mu#1#2\n\n\n\n\n\n∑\n∏\n∫\n/\ninf\nsup\nlim\nlim inf\nlim sup\nmax\nmin\nClp\n1̱1\n\n\n\n\n\n\nA\n\n𝔸\n𝕀\nℕ\nℝ\nŁ𝕃\n𝕄\nℤ\n𝔼\n𝔽\n𝔾\nℙ\nℚ\n𝔻\n𝕋\n𝕏\n𝕊\n𝕌\n\n\n𝐏_\nM\nϵ \nπ \nR \np \nπ \nR \nF \nf̃ \nd \nW \nV \nν \nA \nu \nâ \nα \n \n𝔞 \n𝔣 \na \nb \nf \nd \nḍ \n\n\nU\nM\nf̂\nf̂\nD\n\n_#1#1ess sup  \n\n_#1#1argmin  \n_#1#1argmax  \n\n\nA\nB\nC\nD\nE\nF\nG\nH\nI\nK\nL\nP\nR\nΠ\nM\nN\nO\nS\nT\nU\nV\nW\nX\nY\nZ\n\n\n\n\nε\n\n\n \n\n\n#1∂#1∂t\n#1∂#1∂s\n#1∂^2 #1∂s^2\n#1∂#1∂y\n#1∂^2 #1∂y^2\n#1∂^2 #1∂s ∂y\n#1∂#1∂k\n#1∂#1∂p\n#1∂^2 #1∂k^2\n#1∂^2 #1∂p^2\n#1∂^2 #1∂k ∂y\n#1∂^2 #1∂k ∂p\n#1∂^2 #1∂y ∂p\n\n#1(<ref>)\n\n\nN\nX\nP\nQ\n\np\nx\ns\nc\na\nf\ng\nq\nα\nπ\n\nξ\n\n\n\n\nıI\nT\n\nNT\nS\n\n\n\nX\nC\ne\nx\ny\nb\nn\ns\nw\nN\nσ\n\ng\ni\np\nc\nr\nv\nf\nΓ\n\nm\nD\n\n\nm \n\n𝔞 \na \nb \n𝔟\n𝔲 \nu \nḍ \n𝔰 \np \ns \nσ \nσ \ny \n𝔶 \nz \n𝔷 \n𝔖 \nS \n\nπ \nπ \nJ \n𝔍 \nG \n𝔊 \nV \n\n\n\n\n\n \n\n    #1\n        0.0 -0.055 -0.08 0.07 #1#1#1#1#1#1#1#1#1#1#1#1TheoremTheorem[section]\n        DefinitionDefinition[section]\n        PropositionProposition[section]\n        AssumptionAssumption[section]\n        LemmaLemma[section]\n        CorollaryCorollary[section]\n        RemarkRemark[section]\n        ExampleExample[section]\n        equationsectionActor-Critic learning  for mean-field control in continuous time\n            Noufel FRIKHA[CES, UMR 8174,  Université Paris 1 Panthéon Sorbonne, mailto: Noufel.Frikha at univ-paris1.fr Noufel.Frikha at univ-paris1.fr]   Maximilien GERMAIN[LPSM,  Université Paris Cité, mailto: maximilien.germain at gmail.commaximilien.germain at gmail.com]   Mathieu LAURIERE[NYU Shanghai, mailto: mathieu(dot)lauriere at nyu.edumathieu.lauriere at nyu.edu]\n           Huyên PHAM[ LPSM,  Université Paris Cité,   mailto:pham at lpsm.parispham at lpsm.paris; This author  is supported by  the BNP-PAR Chair “Futures of Quantitative Finance\", \n        and by FiME, Laboratoire de Finance des Marchés de l'Energie, and the “Finance and Sustainable Development” EDF - CACIB Chair]   Xuanye SONG[LPSM,  Université Paris Cité,   mailto:pham at lpsm.parisxsong at lpsm.paris;]\n            March 30, 2023\n        ============================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n        \n        \n        We study policy gradient for mean-field control in continuous time in a  reinforcement learning setting. By considering randomised policies with entropy regularisation, we derive a gradient expectation representation of the value function, which is amenable to actor-critic type  algorithms, \n        where the value functions and the policies are learnt alternately based on observation samples of the state  and model-free estimation of the population state distribution, either by offline or online learning.  \n        In the linear-quadratic mean-field framework, we obtain an exact parametrisation of the actor and critic functions defined on the Wasserstein space. Finally, we illustrate the results of our algorithms with some numerical experiments on  concrete examples. \n        \n         Keywords: Mean-field control, reinforcement learning, policy gradient, linear-quadratic, actor-critic algorithms.   \n        \n        \n        \n        \n        § INTRODUCTION\n         Mean-field control (MFC in short),  also called  McKean-Vlasov  (MKV in short) control problem  is concerned with the study of  large population models  of interacting agents who are cooperative and act for collective welfare according to a center of decision (or social planner).  \n        It has attracted a growing interest over the last years with the emergence of mean-field game, and there is now a large literature on the theory and its various applications in  economics/finance, population dynamics, social sciences and herd behavior. We refer to the seminal two-volume monograph <cit.>-<cit.> for a detailed treatment of the topic. \n        \n        \n        Mean-field control problems lead to infinite dimensional problems in the Wasserstein space of probability measures, and analytical solutions are rarely available. It is then crucial to design efficient numerical schemes for solving such problems, and in the past few years, several works have proposed numerical methods in a model-based setting based \n        either on forward-backward SDE characterisation of MKV from Pontryagin maximum principle, or Master Bellman equation from dynamic programming, and often relying on suitable class of neural networks, see e.g.  <cit.>,  <cit.>,  <cit.>, <cit.>, <cit.>, <cit.>. \n        \n        The question of learning solutions to MFC in a model-free setting, i.e. when the environment (model coefficients) is unknown, has recently attracted attention, see <cit.>, <cit.>,  <cit.>, and this is precisely the purpose of  Reinforcement learning (RL):  learn optimal control  by trial and error, i.e., repeatedly try \n        policy, observe the state, receive and evaluate the reward, and improve the policy.  There are two main approaches in RL: (i) Q-learning based on dynamic programming, and (ii)  Policy gradient  based on parametrisation of policies, and a key feature in RL is the  exploration of the unknown \n        environment  to  broaden search space, which can be achieved  via randomised policies. RL is a very active branch of machine learning and we refer to the second edition of the monograph <cit.> for an overview of this field. \n        \n        Most algorithms in RL are  limited to discrete-time frameworks for  Markov decision processes (MDP) or mean-field MDP, and the study of RL in continuous time has been recently initiated in <cit.>, <cit.>, <cit.> for controlled diffusion processes.  \n        In line with these works, we provide in this paper a theoretical treatment of policy gradient methods for MFC  in continuous time and state/action space by relying on stochastic calculus that has been recently developed for MKV equations.  Our main theoretical result is to obtain a policy gradient representation for value function with \n        randomised parametric policies and entropy regularisers for encouraging exploration. Based on this representation, we design model-free actor critic algorithms involving either the whole trajectories of the state (off-line learning), or the current and next state (online learning).  In the mean-field context, a key issue is to handle the population state distribution, which is an input of the policy (actor) and value function (critic), and instead of assuming that we have at disposal a simulator of the state distribution as in <cit.>, we estimate it in a model-free manner as in <cit.>, which is more suitable for real-world applications. We next study the linear quadratic (LQ) case for which we derive explicit solutions, and this can be used for proposing an exact parametrisation of the critic and actor functions that is incorporated in  stochastic gradient  when updating the policies and value functions.  The explicit solutions in the LQ setting  are served as benchmarks for the numerical results of our algorithms in two examples. \n        \n        \n        The rest of the paper is organized as follows. In Section <ref>, we formulate the mean-field control problem in continuous-time with randomised policies and entropy regularisers, and state the partial differential equation (PDE) characterisation of the value function in the Wasserstein space.  We develop in Section <ref> policy gradient methods by establishing a policy gradient representation, and its implication for actor-critic algorithms.  Section <ref> is devoted to the linear-quadratic setting, and we present in Section <ref> numerical results on two examples to illustrate the accuracy of our algorithms.  Finally, proofs of the policy gradient theorem are detailed in Appendix \n        <ref>, while the derivation of the explicit solution in the LQ case is shown in Appendix <ref>. \n        \n        \n        \n         Notations.\n        \n        \n        \n        \n        \n        The scalar product between two vectors x and y is denoted by x · y, and | · | is  the Euclidian norm.  \n        Given two matrices M=(M_ij) and N=(N_ij), we denote by M:N=Tr(M N)=∑_i,j M_ij N_ij its inner product, and by |M| the Frobenius norm of M. \n        Here  is the transpose matrice operator. \n        Let =(_i_1i_2i_3)∈^d_1× d_2× d_3 be  a tensor of order 3. For p=1,2,3, the p-mode product of   with a vector b=(b_i)∈^d_p, is denoted by ∙_p b, and it is a tensor of order 2, i.e. a matrix \n        \n        defined elementwise as \n        ( ∙_1 b)_i_2i_3    =  ∑_i_1=1^d_1 M_i_1i_2i_3 b_i_1,  ( ∙_2 b)_i_1i_3   =  ∑_i_2=1^d_2  M_i_1i_2i_3 b_i_2,  ( ∙_3 b)_i_1i_2   =  ∑_i_3=1^d_3 M_i_1i_2i_3 b_i_3.  \n         \n        The p-mode product of a 3-th order tensor M∈^d_1× d_2× d_3 with a matrix B=(B_ij)∈^d_p× d, also denoted by M∙_p B,  is a 3-th order \n         tensor \n         \n         defined elementwise as\n        (M∙_1 B )_ℓ i_2i_3     = ∑_i_1 =1^d_1 M_i_1i_2i_3 B_i_1ℓ,   (M∙_2 B )_i_1ℓ i_3  = ∑_i_2 =1^d_2 M_i_1i_2i_3 B_i_2ℓ\n        ( ∙_3 B)_i_1i_2ℓ    =  ∑_i_3=1^d_3 M_i_1i_2i_3 B_i_3ℓ. \n        \n        Finally, the tensor contraction (or partial trace) of a 3-th order tensor M∈^d_1× d_2× d_3 whose dimensions d_p and d_q are equal is denoted as Tr_p,qM. This tensor contraction is a tensor of order 1, i.e. a vector, defined elementwise as \n        (Tr_1,2M)_i_3 =  ∑_ℓ=1^d_1 M_ℓℓ i_3,  (Tr_1,3M)_i_2 =  ∑_ℓ=1^d_1 M_ℓ i_2 ℓ,  (Tr_2,3M)_i_1 =  ∑_ℓ=1^d_2 M_i_1 ℓℓ.\n        \n         \n        \n        \n        \n        \n        \n        § EXPLORATORY FORMULATION OF MEAN-FIELD CONTROL\n         \n        \n        \n        Let us  consider a mean-field control problem where the ^d-valued controlled state  process X=X^α  is governed by the dynamics\n        \n            X̣_s    =    b(X_s,_X_s,α_s) ṣ  + σ(X_s,_X_s,α_s) Ẉ_s,      s ≥ 0,\n         \n        with W a standard p-dimensional Brownian motion on a  probability space (Ω,,) equipped with the filtration =(_t)_t≥ 0 generated by W, and augmented with a σ-algebra  rich enough to support a uniformly distributed random variable \n        independent of W. The control α=(α_t)_t  is an -progressively measurable  process with α_t representing the action of the agent at time t, and valued in the action space A⊂^q.  Here, _X_t denotes the marginal law of X_t, \n        _2(^d) is the Wasserstein space of probability measures μ with a finite second order moment, i.e., M_2(μ):=(∫ |x|^2 μ(x̣))^1 2<∞,  \n        equipped with the Wasserstein distance _2, and the coefficient b  (resp. σ) is a measurable  function from ^d×_2(^d)× A into ^d (resp. ^d× p).  \n        \n        \n        Throughout the paper, we make the standard Lipschitz assumptions on the coefficients b and σ to ensure the existence and uniqueness of a strong solution  \n        to the stochastic differential equation (SDE in short) (<ref>) given any initial condition ξ with law μ∈_2(^d). \n        \n        \n        \n        \n        \n        The objective of a mean-field  control problem on finite horizon T<∞, is\n        \n        to minimize over the control α an expected total cost of the form\n        \n            [ ∫_0^T e^-β s  f(X_s,_X_s,α_s) ṣ + e^-β T g(X_T,_X_T) ].\n         \n        Here f is a running cost function defined on ^d×_2(^d)× A, while g is a terminal cost function on ^d×_2(^d), and β∈_+ is a given discount factor. In a model-based setting, i.e., when the coefficients b, σ, and the functions f, g are known, the solution to MFC control problem can be characterised by a forward backward SDE arising from the maximum principle (see <cit.>,  or by a Master  Bellman equation arsing from dynamic programming principle (see <cit.>). Moreover,  the optimisation over -progressively measurable process α (open-loop control), \n        or feedback (also called closed-loop) controls α, i.e., in the form α_t=π(t,X_t,_X_t), 0≤ t≤ T,  for some deterministic policy π, i.e., a  measurable function π:[0,T]×^d×_2(^d)→A,  yields the same value function. \n         \n         \n         In a model-free reinforcement learning (RL)  setting, when the coefficients are unknown, the agent can  only rely on observation samples of state and reward in order to learn the optimal strategy. This is achieved by  trial and error where the agent tries a policy, receive and evaluate the reward and then improve performance \n         by repeating this procedure. A critical issue in reinforcement learning when the environment is unknown, is  exploration in order to broaden search space, and a key and now common idea is to use  randomised (or stochastic) policies: in a mean-field setting,  this is defined by a probability  transition kernel from \n         [0,T]×^d×_2(^d) into A, i.e., a measurable function π:(t,x,μ)∈[0,T]×^d×_2(^d)↦π(.|t,x,μ)∈(A), the set of probability measures on A. \n         We then say that the process α=(α_t)_t  is a randomised feedback control generated from a stochastic  policy π, denoted by α∼π, if at each time t, the action α_t is sampled from the probability distribution π(.|t,X_t,_X_t). Note that the sampling is drawn at each time \n         from the σ-algebra  rich enough to support a uniformly distributed random variable independent of W. More precisely,  it is defined as follows: given a probability transition kernel  π, one can associate a measurable function ϕ_π:[0,T]×^d×_2(^d)× [0,1]→A such that \n         the law of ϕ_π(t,x,μ,U) is π(.|t,x,μ) where U is an uniform random variable on [0,1].  We would then naturally define the control process by α_t=ϕ_π(t,X_t,_X_t,U_t), 0≤ t≤ T,  \n         for a collection of -measurable i.i.d. uniform random variables (U_t)_t,  but this raises some measurability issues as \n         (t,ω)↦U_t(ω) is not jointly measurable in the usual product space ([0,T]×Ω,_[0,T]⊗,ṭ⊗).  To cope these issues, one can use the notion of Fubini extension, see  <cit.>. We consider an atomless  probability space ([0,T],,ρ) extending the usual Lebesgue measure interval space \n         ([0,T],_[0,T],ṭ), and a rich Fubini extension ([0,T]×Ω,⊠,ρ⊠) of the product space  ([0,T]×Ω,⊗,ρ⊗). Then, from Theorem 1 in <cit.>, there exists a ⊠-measurable map :[0,T]×Ω→[0,1] such that the random variables \n         U_t=(t,.) are essentially pairwise independent, and uniformly distributed on [0,1]. Denote by  the filtration generated by (W,), and consider the controlled process governed by \n         \n            X̣_s    =    b(X_s,_X_s,α_s) ṣ + σ(X_s,_X_s,α_s) Ẉ_s,\n        \n         where α_t=ϕ_π(t,X_t,_X_t,U_t)∼π(.|t,X_t,_X_t), 0≤ t≤ T, is -progressively measurable.  Here, to alleviate notations, we write ρ(ṭ)≡ṭ. \n        \n        \n        \n        Moreover, in order to encourage exploration of randomised policies, we shall substract entropy regularisers to the cost term, as adopted in the recent works by <cit.>, <cit.>, by considering the Shannon differential entropy defined as\n        (π(.|t,x,μ))     :=     - ∫_A log p(t,x,μ,a) π(ạ|t,x,μ), \n          \n        by assuming that π(.|t,x,μ) admits a density p(t,x,μ,.) with respect to some measure ν on A. \n        The goal of the social planner is now to minimise over randomised policies π the cost \n        \n            J(π)    =  _α∼π[ ∫_0^T e^-β s[  f(X_s,_X_s,α_s) -  λ( π(.|s,X_s,_X_s) )  ] ṣ   +   e^-β T g(X_T,_X_T) ],\n        \n        where λ≥0 is a  temperature parameter on exploration.  Here, the notation in _α∼π[.]  means that the expectation operator is taken when the randomised feedback control α is generated from the stochastic policy π, and X=X^α is driven by the dynamics (<ref>). \n        \n        \n        \n        Let us now introduce the dynamic Markovian version of the above mean-field problem. \n        \n        Given a stochastic policy π, an initial time-state-distribution triple (t,x,μ)∈[0,T]×^d×_2(^d), and ξ∈L^2(_t;^d) (the set of square-integrable _t-measurable random variables valued in ^d) with distribution law μ (ξ∼μ),  we consider the decoupled  state processes {X_s^t,ξ,t≤ s≤ T} and {X_s^t,x,ξ,t≤ s≤ T} given by \n        \n            X_s^t,ξ   = ξ + ∫_t^s b(X_r^t,ξ,_X_r^t,ξ,α_r)  ṛ + ∫_t^s σ(X_r^t,ξ,_X_r^t,ξ,α_r)  Ẉ_r,    \n            \n            X_s^t,x, μ   = x + ∫_t^s b(X_r^t,x, μ,_X_r^t,ξ,α_r) ṛ + ∫_t^s σ(X_r^t,x, μ,_X_r^t,ξ,α_r)  Ẉ_r,    t ≤ s ≤ T,\n        \n        where α is a randomised feedback control generated from π, i.e.,  α_s is sampled at each time s from π(.|s,X_s^t,x, μ,_X_s^t,ξ) (here, to alleviate notations, we omit the dependence  of X^t,ξ and X^t,x, μ in α∼π). \n        We make the standard Lipschitz regularity assumptions on the coefficients b and σ to ensure the existence and uniqueness of a strong solution   to  (<ref>) given any initial condition t, ξ, x.  \n        By weak uniqueness, it follows that the law of the process (X_s^t, ξ)_s∈ [t, T] given by the unique solution to the first SDE in (<ref>) only depends upon ξ through its law μ. It thus makes sense to consider (_X_s^t,ξ)_s∈ [t, T] as a function of μ without specifying the choice of the random variable ξ that has μ as distribution. In particular, for any 0≤ t≤ s≤ T, the random variable X_s^t,x,μ depends on \n        ξ only through its law μ. As a consequence, we can define the cost value function of the stochastic policy π as the function defined on [0,T]×^d×_2(^d) by \n        \n            V^π(t,x,μ)    =  _α∼π[ ∫_t^T e^-β (s-t)[  f(X_s^t,x, μ, _X_s^t,ξ,α_s) -  λ( π(.|s,X_s^t,x,μ,_X_s^t,ξ) ) ]  ṣ\n                +    e^-β (T-t) g(X_T^t,x, μ,_X_T^t,ξ) ].\n         \n        Since X_s^t, ξ, ξ = X_s^t, ξ a.s., the initial cost  value in (<ref>) when starting from some initial random state ξ∈L^2(;^d) with law μ is equal to  J(π)=_ξ∼μ[V^π(0,ξ,μ)]. \n         \n         \n         \n         We complete this section by characterizing the cost value function V^π, for a given stochastic policy π, in terms of a linear parabolic partial differential equation (PDE) of mean-field type stated in the strip [0,T] ×ℝ^d ×𝒫_2(ℝ^d). We first introduce the coefficients associated to the dynamics and the value function, given a stochastic policy π, namely\n          \n         b_π(t,x,μ)   =  ∫_A b(x,μ, a)   π(ạ|t,x,μ),       Σ_π(t,x,μ)   =  ∫_A (σσ)(x,μ,a) π(ạ|t, x,μ), \n        \n         f_π(t,x,μ)   =  ∫_A f(x, μ, a) π(ạ|t,x,μ),         E_π(t,x,μ)   =    - ∫_A log p(t,x,μ,a) π(ạ|t,x,μ),\n         \n         and let σ_π := Σ_π^1/2.\n         \n         \n         \n        \n        \n         \n         \n        Before presenting the regularity assumptions, we introduce some notations regarding the Wasserstein derivative (also called L-derivative) of a real-valued smooth map U defined on _2(^d). We follow the common practice of denoting by ∂_μ U(μ)(v) ∈^d the Wasserstein derivative of U with respect μ evaluated at (μ, v) ∈_2(^d) ×^d. Its ith coordinate is denoted by ∂^i_μ U(μ)(v). We will also work with higher order derivatives. For a positive integer n, a multi-index λ of {1, ⋯, d}, a n-tuple of multi-indices γ=(γ_1, ⋯, γ_n) of {1, ⋯, d} and v = (v_1, ⋯, v_n)∈ (ℝ^d)^n, we denote by ∂_μ^λU(μ)(v) the derivative ∂^λ_n_μ[⋯ [∂^λ_1_μ U(μ)](v_1)⋯](v_n). If v↦∂_μ^λU(μ)(v) is smooth, we write  ∂^γ_v∂_μ^λU(μ)(v) for the derivative ∂^γ_n_v_n⋯∂^γ_1_v_1∂_μ^λU(μ)(v).\n        \n        We will often deal with maps that depend on additional time and space variables. In particular, we will work with the two spaces 𝒞^2, 2(^d ×_2(^d)) and 𝒞^1, 2, 2([0,T] ×^d ×_2(^d)) and refer the reader to <cit.> Chapter 5 for more details. \n        \n        Having these notations at hand, we make the following regularity assumptions on the coefficients b_π , σ_π, the cost functions f_π, g and the Shannon differential entropy E_π. Below, π:[0,T] ×ℝ^d ×𝒫_2(ℝ^d) →𝒫(A) is a fixed stochastic policy.\n        \n         \n         \n         \n          (i) For any h ∈{ b^i_π, σ_π^i, j, i=1, ⋯, d, j = 1, ⋯, p}, the following derivatives\n        \n            ∂_x h(t, x, μ),  ∂^2_x h(t, x, μ),  ∂_μ h(t, x, μ)(v),  ∂_v [∂_μ h(t, x, μ)](v),\n         exist for any (t, x, v, μ) ∈ [0,T] × (^d)^2 ×_2(^d), are bounded and locally Lipschitz continuous with respect to x, μ, v uniformly in t∈ [0,T]. Moreover, h(t, .) is at most of linear growth, uniformly in t∈ [0,T], namely, there exists C<∞ such that for all t, x, μ\n            |h(t, x, μ)| ≤ C (1+ |x| + M_2(μ)).\n        \n          (ii) For any t∈ [0,T], f_π (t, .),   E_π(t, .),   g ∈𝒞^2,2(ℝ^d ×_2(ℝ^d)).\n         \n          (iii) There exists some constant C< ∞, such that for any (t, x, v,μ)∈[0,T]×(^d)^2×_2(^d), \n         \n            |f_π (t, x, μ)| + |E_π(t, x, μ)| + |g(x, μ)| ≤ C (1 + |x|^2 + M_2(μ)^q),\n        \n            | ∂_x f_π (t, x, μ)| + |∂_x E_π(t, x, μ)| + |∂_x g(x, μ)| ≤ C (1+ |x| + M_2(μ)^q),\n        \n            | ∂_μ f_π (t, x, μ)(v) | + |∂_μ E_π(t, x, μ)(v)| + |∂_μ g(x, μ)(v)| ≤ C (1+ |x| + |v| + M_2(μ)^q),\n        \n            | ∂_v [∂_μ f_π (t, x, μ)](v) |+      | ∂^2_x f_π (t, x, μ)| +  |∂_v [∂_μ E_π(t, x, μ)](v)| + |∂^2_x E_π(t, x, μ)| \n                + |∂_v [∂_μ g(x, μ)](v)|  + |∂^2_x g(x, μ)| ≤ C (1+ M_2(μ)^q),\n         for some q≥ 0.\n         \n         It is readily seen from the integral form of b_π, Σ_π, f_π, E_π that if for any a ∈ A, the functions (x, μ) ↦ b(x, μ, a), σ(x, μ, a),   f(x, μ, a) and the density (x, μ) ↦ p(t, x, μ, a) of the probability measure π(ạ|t,x,μ) are smooth with derivatives satisfying some adequate estimates then Assumption 2.1 is satisfied. In particular, this will be the case when the coefficients b, σ are linear functions and f together with g are quadratic functions of the variables of x, ∫_^d z μ(ẓ) and a and if p is a Gaussian density with a smooth mean and a time-dependent covariance-matrix as in the linear quadratic framework, see Section <ref>. \n         \n         \n         \n        \n         \n        \n         \n         \n         \n        We now have the following PDE characterisation of the cost value function V^π.\n        \n         \n         \n          \n         Under Assumption <ref>, the function V^π defined by (<ref>) belongs to C^1,2, 2([0,T]×^d×_2(^d)) and satisfies the following linear parabolic PDE\n         \n            _π[V^π](t,x,μ) + (f_π -  λ E_π)(t,x,μ) = 0,    (t, x, μ) ∈ [0,T)×^d×_2(^d),\n         with the terminal condition V^π(T,x,μ)=g(x,μ), where \n        \n         _π is the operator defined by \n         \n         _π[φ](t,x,μ) \n            =    - βφ(t, x, μ) + ∂_tφ(t,x,μ) \n        \n         +  b_π(t,x,μ) · D_xφ(t,x,μ) +  1/2Σ_π(t,x,μ) : D_x^2 φ(t,x,μ)  \n                +   _ξ∼μ[   b_π(t,ξ,μ) ·∂_μφ(t,x,μ)(ξ) + 1/2Σ_π(t,ξ,μ) : ∂_υ∂_μφ(t,x,μ)(ξ)    ].\n         \n        \n        \n        \n        \n         \n         In particular, the above result indicates that provided the coefficients b_π, Σ_π, the functions f_π, E_π and the terminal condition g are smooth with derivatives satisfying some appropriate estimates, the solution V^π to the Kolmogorov PDE (<ref>) is smooth. In this sense, it preserves the regularity of the terminal condition.\n         \n         However, one can weaken the regularity assumption on the terminal condition (and actually of the coefficients themselves) by benefiting from the smoothness of the underlying fundamental solution (or the transition density of the associated stochastic process) under some additional non-degeneracy assumption. We refer e.g. to <cit.>, <cit.>, <cit.> in the uniformly elliptic diffusion setting and to <cit.> in the case of non-degenerate stable driven SDE.\n           Proof.  See Appendix <ref>\n        \n        § POLICY GRADIENT METHOD\n        \n        \n        \n        \n        We now consider a parametric family of randomised policies π_θ, with densities p_θ, θ∈Θ, Θ being a non-empty open subset of ^D, for some positive integer D, \n        and denote by (θ)=J(π_θ) the associated cost function, viewed as a function of the parameters θ, recalling that J is defined by (<ref>). The principle of  \n        policy gradient method is to minimize  over θ the function (θ) by stochastic gradient descent  algorithm. In our RL setting, we aim to derive a probabilistic representation of the gradient function  ∇_θ(θ) that does not involve model coefficients \n        b,σ, but only observation samples of state X_t, state distribution _X_t, and rewards f_t:=f(X_t,_X_t,α_t), g_T:=g(X_T,_X_T) when taking decision α∼π_θ. \n        \n        \n        \n        \n         §.§ Policy gradient representation\n        \n         \n         \n        \n        We make the following assumptions on the parametric family of randomised policy and coefficients.\n        \n        \n        \n          (i) For any h ∈{ b^i_π_θ, σ_π_θ^i, j, f_π_θ, E_π_θ, g, i=1, ⋯, d, j = 1, ⋯, p}, any multi-indices α, β, λ of {1, ⋯, d} such that 0≤ |α| ≤ 2, 0≤ |β| ≤ 1, λ being of length n, 0≤ n ≤ 2, any n-tuple of multi-indices γ=(γ_1, ⋯, γ_n) with 0≤ |γ_1| + ⋯ + |γ_n|≤ 2, denoting by h_θ(t, x, μ) the value of h at (θ, t, x, μ), the following derivatives \n            ∂^β_θ∂_x^α∂^γ_v∂^λ_μ h_θ(t, x, μ)(v),  ∂_x^α∂^β_θ∂^γ_v∂^λ_μ h_θ(t, x, μ)(v),  ∂^α_x∂^γ_v∂^β_θ∂^λ_μ h_θ(t, x, μ)(v),  ∂^α_x∂^γ_v∂^λ_μ∂^β_θ  h_θ(t, x, μ)(v), \n               ∂^γ_v∂^α_x∂^λ_μ∂^β_θ  h_θ(t, x, μ)(v), ∂^γ_v∂^λ_μ∂^α_x∂^β_θ  h_θ(t, x, μ)(v),  ∂^γ_v∂^λ_μ∂^β_θ∂^α_x h_θ(t, x, μ)(v), ∂^γ_v∂^β_θ∂^λ_μ∂^α_x h_θ(t, x, μ)(v), \n               ∂^β_θ∂^γ_v∂^λ_μ∂^α_x h_θ(t, x, μ)(v), ∂^γ_v∂^β_θ∂^α_x∂^λ_μ   h_θ(t, x, μ)(v),\n             ∂^γ_v∂^α_x∂^β_θ∂^λ_μ   h_θ(t, x, μ)(v), ∂^β_θ∂^α_x∂^γ_v∂^λ_μ   h_θ(t, x, μ)(v),\n         exist for any (t,θ, x, v, μ) ∈  [0,T] ×Θ× (ℝ^d)^n+1×_2(ℝ^d) and are locally Lipschitz continuous with respect to θ, x, μ, v uniformly in t∈ [0,T][Hence, according to Clairaut's theorem, these partial derivatives are equal.]. Moreover, if h= b^i_π_θ or σ_π_θ^i, j, the aforementioned derivatives of order greater or equal to one are bounded.\n        \n          (ii)  The estimates of Assumption <ref>(iii)  are satisfied for the family of policies {π_θ, θ∈Θ}, locally uniformly in θ, i.e. for any θ∈𝒦, 𝒦 being any compact subset of Θ. Additionally, there exists some constant C< ∞, such that for any h∈{f_π_θ, E_π_θ}, any (t, μ, x) ∈ [0,T] ×_2(ℝ^d) ×ℝ^d, any v= (v_1, v_2) ∈ (ℝ^d)^2, any θ∈𝒦, 𝒦 being any compact subset of Θ, any multi-index λ, |λ| =2, any multi-index λ=(λ_1, λ_2) of {1, ⋯, d}, any couple of multi-indices γ=(γ_1, γ_2)\n            | ∂_θ h_θ (t, x, μ)|  ≤ C (1 + |x|^2 + M_2(μ)^q),\n        \n            | ∂_θ∂_x h_θ (t, x, μ)|  + |∂_x g(x, μ)| ≤ C (1+ |x| + M_2(μ)^q),\n        \n            | ∂_θ∂_μ h_θ (t, x, μ)(v_1) | + | ∂_μ∂_x h_θ (t, x, μ)(v_1) | + | ∂_μ∂_x g ( x, μ)(v_1) |≤ C (1+ |x| + |v_1| + M_2(μ)^q),\n        \n            | ∂_θ∂_v_1∂_μ h_θ (t, x, μ)(v_1) |+   | ∂_θ∂^2_x h_θ (t, x, μ)| +    | ∂_μ∂^2_x h_θ (t, x, μ)(v_1)| + | ∂_v^γ∂^λ_μ h_θ(t, x, μ)(v)|  \n                + |∂_v_1∂_μ g(x, μ)(v_1)|  + |∂^2_x g(x, μ)| + | ∂_v^γ∂^λ_μ g(t, x, μ)(v)|≤ C (1+ M_2(μ)^q),\n         for some q≥ 0.\n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        As shown in Appendix <ref>, Assumption <ref> guarantees that the derivatives (t, θ, x, μ, v)↦∂_θ∂_t _θ(t, x, μ), \n        ∂_θ_θ(t, x, μ), ∂_θ∂_x_θ(t, x, μ), ∂_θ∂_μ_θ(t, x, μ)(v),  ∂_θ∂^2_x_θ(t, x, μ), ∂_θ∂_v∂_μ_θ(t, x, μ)(v), where _θ(t, x, μ):=V^π_θ(t, x, μ) defined by (<ref>) with π=π_θ, exist, are continuous and satisfy suitable growth conditions. \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        We then  let ∇_θ(θ)=[_θ(0, ξ, μ)] where _θ(t, x, μ) := ∇_θ_θ(t, x, μ).  The main result of this section provides a probabilistic representation of the gradient function _θ. \n        \n         \n        Suppose that Assumption <ref> holds. Assume moreover that for any t, x, μ, a, the map Θ∋θ↦ p_θ(t, x, μ, a) is differentiable with a derivative satisfying the following estimates: for some constant C<∞ and some q≥0, for any (t,x, μ) ∈ [0,T] ×^d ×_\n        2(^d) and any compact subset 𝒦⊂Θ.\n        \n            ∫_Asup_θ∈𝒦   { | ∇_θ p_θ(t, x, μ, a)| ( |b(x, μ, a)| + |(σσ)^(x, μ, a)| \n                   + |f(x, μ, a)| + |log(p_θ(t, x, μ, a))|) }ν(ạ) < ∞,\n         and\n        \n            ∫_A     | ∇_θlog(p_θ(t, x, μ, a))|^2 |σ(x, μ, a)|^2   p_θ(t, x, μ, a)  ν(ạ) ≤ C (1+ |x|^q + M_2(μ)^q).\n        \n        \n        Then, it holds \n        \n            _θ(t,x,μ)     =  _α∼π_θ[ ∫_t^T e^-β(s-t)∇_θlog p_θ(s,X_s^t,x,μ,_X_s^t,ξ,α_s) {_θ(s,X_s^t,x,μ,_X_s^t,ξ) \n                 +  [  f(X_s^t,x,μ,_X_s^t,ξ,α_s) +  λlog p_θ(s,X_s^t,x,μ,_X_s^t,ξ,α_s)  - β_θ(s,X_s^t,x,μ,_X_s^t,ξ)  ] ṣ}\n                +  ∫_t^T  e^-β(s-t)_θ[_θ](s,X_s^t, x,μ,_X_s^t,ξ)   ṣ],\n         \n        for any (t,x,μ, θ)∈[0,T]×^d×_2(^d) ×Θ and ξ∼μ, where _θ is the operator defined by \n        \n            _θ[φ](t,x,μ)    =  _ξ∼μ[ ∇_θ  b_θ(t,ξ,μ) ∂_μφ(t,x,μ)(ξ) \n                  + 1/2 tr_1,2( ∇_θΣ_θ(t,ξ,μ) ∙_1 ∂_υ∂_μφ(t,x,μ)(ξ))   ],\n        \n         and we set b_θ(t,x,μ)=∫_A b(x,μ,a)  π_θ(ạ|t,x,μ), Σ_θ(t,x,μ)   =  ∫_A (σσ)(x,μ,a)  π_θ(ạ|t,x,μ). Here ∇_θΣ_θ=(∂Σ_θ^ij/∂θ_k)_i,j,k∈^d× d× D is a tensor of order 3, and we used the product tensor notations ∙_1  recalled in the introduction.  \n        [On the martingale property of the policy gradient] \n        \n        Notice that for any function B on [0,T]×^d×_2(^d) (called baseline function), we have for all 0≤ t≤ s≤ T, \n        _α∼π_θ[ ∇_θlog p_θ(s,X_s^t,x,ξ,_X_s^t,ξ,α_s) B(s,X_s^t,x,ξ,_X_s^t,ξ) ]    =    0. \n        \n        Indeed, \n              _α∼π_θ[ ∇_θlog p_θ(s,X_s^t,x,ξ,_X_s^t,ξ,α_s) B(s,X_s^t,x,ξ) | X_s^t,x,ξ]  \n           =    B(s,X_s^t,x,ξ,_X_s^t,ξ) ∫_A ∇_θlog p_θ(s,X_s^t,x,ξ,_X_s^t,ξ,a) π_θ(ạ| s,X_s^t,x,ξ,_X_s^t,ξ)   \n           =    B(s,X_s^t,x,ξ,_X_s^t,ξ) ∇_θ∫_A π_θ(ạ| s,X_s^t,x,ξ,_X_s^t,ξ)   =   0. \n        \n        The representation in Theorem <ref> also means that the process \n        \n            { e^-β(s-t)_θ(s,X_s^t,x,μ,_X_s^t,ξ) + ∫_t^s  e^-β(r-t)∇_θlog p_θ(r,X_r^t,x,μ,_X_r^t,ξ,α_r) {_θ(r,X_r^t,x,μ,_X_r^t,ξ)  \n                 +  [  f(X_r^t,x,μ,_X_r^t,ξ,α_r) +  λlog p_θ(r,X_r^t,x,μ,_X_r^t,ξ,α_r) - β_θ(r,X_r^t,x,μ,_X_r^t,ξ)   ] ṛ}\n                 + ∫_t^s e^-β(r-t)_θ[_θ](r,X_r^t,x,μ,_X_r^t,ξ)   ṛ,   t ≤ s ≤ T}\n         \n        is a martingale, for any given α∼π_θ. \n         Proof. See Appendix <ref>\n        \n        \n        \n        \n        \n        In the next section, we show how the probabilistic representation formula of the gradient function _θ provided by Theorem <ref> can be used to design two actor-critic algorithms for learning optimal cost function and randomised policy by relying on samples of the actions, states and state distributions. \n        \n        \n         \n        \n        \n        \n        \n        \n        \n        \n         §.§ Actor-critic Algorithms\n        \n        \n         \n        Actor-critic (AC) methods combine policy gradient (PG) and performance evaluation (PE).  Compared to most existing works on RL for mean-field problems, mainly based on Q-learning (see e.g. <cit.>, <cit.>, <cit.>)\n        we do not assume that the agent (the social planner) has at disposal a simulator for the state distribution, but instead will estimate the distribution of the population from the observation of the state of the representative player and by updating the distribution along repeated episodes. More precisely, for each episode i=1,2,…,N,  from the observation of the state X_t_k^i of a representative player i  at time t_k, we update the state distribution according to\n        \n            μ_t_k^i    =    (1-ρ^i_S) μ_t_k^i-1 + ρ^i_S δ_X_t_k^i,\n         \n        where (ρ^i_S)_i is a sequence of learning parameters in (0,1), e.g. ρ^i_S=1/i. It is expected from the propagation of chaos,  that when the number of episodes  N goes to infinity, μ_t_k^N converge to the limiting distribution _X_t_k of the population. \n        Notice that a similar estimation procedure was  recently proposed in <cit.> in the context of a  MFC control problem in discrete time with finite state and action spaces over an infinite horizon.  \n        \n        \n        In addition to the family of randomised policies (t,x,μ)↦π_θ(ạ|t,x,μ)=p_θ(t,x,μ)ν(ạ), with parameter θ, we are given a family of  functions (t,x,μ)↦^η(t,x,μ) on [0,T]×^d×_2(^d), with parameter η, aiming to approximate the optimal cost value function. \n        AC algorithm is then updating alternately the two parameters to find the optimal pair (θ^*,η^*), hence determining the approximate optimal randomised policy and the associated cost value function.  On the one hand, \n        the loss function in the PE step  for learning ^η, for fixed policy π_θ,  is based on the martingale formulation of the process\n        { e^-β t^η(t,X_t^x,μ,_X_t^ξ) + ∫_0^t  e^-β r[  f(X_r^x, μ,_X_r^ξ,α_r)  +  λlog p_θ(r,X_r^x,μ,_X_r^ξ,α_r)  ] ṛ,   0 ≤ t ≤ T}, \n        \n        and on the other hand, the objective (here a cost) function in the PG step  for learning π_θ, for fixed ^η, is based on the martingale formulation of the process\n        \n            { e^-β t_θ(t,X_t^x,μ,_X_t^ξ) + ∫_0^t  e^-β r∇_θlog p_θ(r,X_r^x,μ,_X_r^ξ,α_r) [ ^η(r,X_r^x,μ,_X_r^ξ)  \n                 +  (  f(X_r^x,μ,_X_r^ξ,α_r)  +  λlog p_θ(r,X_r^x,μ,_X_r^ξ,α_r) - β^η(r,X_r^x,μ,_X_r^ξ) ) ṛ] \n                +  _θ[^η](r,X_r^x,μ,_X_r^ξ)   ṛ,   0 ≤ t ≤ T}.\n         \n        Here, we denote X^x,μ=X^0,x,μ  (resp. X^ξ=X^0,ξ) when the initial time of the flow is t=0.  \n        We emphasise that these loss functions are minimised by training samples of the state trajectories X_t^x_0,ξ, actions α∼π_θ,  estimation μ_t of _X_t^ξ according to (<ref>), and observation of the associated running and terminal costs. \n        \n        \n        \n        We  first develop  AC algorithms in the offline setting where all  state trajectories are sampled. In this case, given θ, the proposed loss function for the PE step is\n        \n        L^PE(η)    =   _α∼π_θ[ ∫_0^T | e^-β(T-t) g(X_T,_X_T) \n                + ∫_t^T e^-β(r-t)[ f(X_r,_X_r,α_r) +  λlog p_θ(r,X_r^,_X_r^,α_r)] ṛ - ^η(t,X_t,_X_t) |^2 ṭ],\n         which leads, after  time discretisation of [0,T] on the grid {t_k = k Δ t, k=0,…,n},  \n        and by applying stochastic gradient descent (SGD) with learning rate ρ_E,  to the following update rule: \n        η   ←   η + ρ_E ∑_k=0^n-1( e^-β(n-k)Δ t g_t_n   + ∑_ℓ=k^n-1  e^-β(ℓ-k)Δ t[ f_t_ℓ +  λlog p_θ(t_ℓ,X_t_ℓ,μ_t_ℓ,α_t_ℓ)] Δ t \n                -  ^η(t_k,X_t_k,μ_t_k) ) ∇_η^η(t_k,X_t_k,μ_t_k) Δ t, \n        \n        where we set   f_t_ℓ=f(X_t_ℓ,_X_t_ℓ,α_t_ℓ), as the output running cost at time t_ℓ, for an input state X_t_l, action α_t_ℓ,   ℓ=0,…,n-1,   \n        and g_T=g(X_T,_X_T) the terminal cost for an input X_T.  \n        Given η, the learning in the PG step relies on the gradient representation (<ref>), and (after time discretisation) leads to the update rule\n        θ   ←   θ -  ρ_G Ĝ_θ, \n          Ĝ_θ    =    ∑_k=0^n-1 e^-β t_k∇_θlog p_θ(t_k,X_t_k,μ_t_k,α_t_k) [ ^η(t_k+1,X_t_k+1,μ_t_k+1) - ^η(t_k,X_t_k,μ_t_k) \n               +  ( f_t_k    +  λlog p_θ(t_k,X_t_k,μ_t_k,α_t_k)    - β^η(t_k,X_t_k,μ_t_k)  ) Δ t ]   +  _θ[^η](t_k,X_t_k,μ_t_k)   Δ t.  \n        \n        The pseudo-code is described in Algorithm <ref>. \n        \n        \n        [H] \n        \n         Input data: Number of episodes N, number of mesh time-grid n (↔ time step Δ t=T/n), learning rates  ρ_S^i, ρ_E^i, ρ_G^i for the state distribution, PE and PG estimation, and function of the number of episodes i. \n        Parameter λ for entropy regularisation. \n        Functional forms ^η of cost value function,  p_θ of density policies. \n        \n         Initialisation: μ_t_k: state distribution on ^d, for k=0,…,N,  parameters η, θ. \n        \n        each episode i=1,…,NInitialise state X_0∼μ_0\n        k=0,…,n-1Update state distribution: μ_t_k←(1-ρ_S^i) μ_t_k + ρ_S^i δ_X_t_k\n        \n        Generate action α_t_k∼π_θ(.|t_k,X_t_k,μ_t_k)\n        \n        Observe (e.g. by environment simulator) state X_t_k+1 and cost f_t_k\n        \n        If k=n-1, update terminal state distribution: μ_t_n←(1-ρ_S) μ_t_n + ρ_S δ_X_t_n, and observe terminal cost g_t_n\n        k←k+1Compute\n        Δ_η   =   ∑_k=0^n-1( e^-β(n-k)Δ t  g_t_n   + ∑_ℓ=k^n-1 e^-β(ℓ-k)Δ t[ f_t_ℓ  +  λlog p_θ(t_ℓ,X_t_ℓ,μ_t_ℓ,α_t_ℓ)] Δ t \n                -  ^η(t_k,X_t_k,μ_t_k) ) ∇_η^η(t_k,X_t_k,μ_t_k) Δ t \n        Ĝ_θ    =    ∑_k=0^n-1 e^-β t_k∇_θlog p_θ(t_k,X_t_k,μ_t_k,α_t_k) [ ^η(t_k+1,X_t_k+1,μ_t_k+1) - ^η(t_k,X_t_k,μ_t_k) \n               +  ( f_t_k   +  λlog p_θ(t_k,X_t_k,μ_t_k,α_t_k) - β^η(t_k,X_t_k,μ_t_k)  ) Δ t ]   +  _θ[^η](t_k,X_t_k,μ_t_k)   Δ t.  \n        \n        Critic Update: η←η + ρ_E^i Δ _η;  Actor Update: θ←θ  -   ρ_G^i Ĝ_θ Return: ^η, π_θOffline actor-critic mean-field algorithm  \n        \n        \n        \n        \n        We next develop AC algorithm for online setting where only past sample trajectory is available, and so the parameters (θ,η) are updated in real-time incrementally. In this case, given a policy π_θ, we consider  at each time step t_k, k=0,…,n-1, a loss function for  PE  \n        given by \n        \n        L_t_k^PE(η)    =   _α∼π_θ[ |  ^η(t_k+1,X_t_k+1,_X_t_k+1)  - ^η(t_k,X_t_k,_X_t_k) \n               +  ( f(X_t_k,_X_t_k,α_t_k)   +   λlog p_θ(t_k,X_t_k,_X_t_k,α_t_k)  - β^η(t_k,X_t_k,_X_t_k)) Δ t |^2 ].\n        \n        Concerning PG, we note that when θ is an optimal parameter, we should have _θ=0.  Therefore, from the martingale condition in (<ref>), this suggests to find θ such that at any time  t_k, k=0,…,n-1_α∼π_θ{∇_θlog p_θ(t_k,X_t_k,_X_t_k,α_t_k)  [ ^η(t_k+1,X_t_k+1,_X_t_k+1)  - ^η(t_k,X_t_k,_X_t_k)        \n        \n          +  ( f(X_t_k,_X_t_k,α_t_k)   +  λlog p_θ(t_k,X_t_k,_X_t_k,α_t_k) - β^η(t_k,X_t_k,_X_t_k)  ) Δ t   ] + _θ[^η](t_k,X_t_k,μ_t_k)   Δ t }      \n          \n           =  0.       \n        The pseudo-code is described in Algorithm <ref>. \n        \n        \n        \n        [H] \n        \n         Input data: Number of episodes N, number of mesh time-grid n (↔ time step Δ t=T/n), learning rates  ρ_S^i, ρ_E^i, ρ_G^i for the state distribution, PE and PG estimation, and function of the number of episodes i.  Parameter λ for entropy regularisation. \n        Functional forms ^η of cost value function,  p_θ of density policies. \n        \n         Initialisation: μ_t_k: state distribution on ^d, for k=0,…,n,  parameters η, θ. \n        \n        each episode i=1,…,NInitialise state X_0∼μ_0\n        k=0,…,n-1Update state distribution: μ_t_k←(1-ρ_S^i) μ_t_k + ρ_S^i δ_X_t_k\n        \n        Generate action α_t_k∼π_θ(.|t_k,X_t_k,μ_t_k)\n        \n        Observe (e.g. by environment simulator) state X_t_k+1 and cost  f_t_k\n        \n        If k=n-1, update terminal state distribution: μ_t_k+1←(1-ρ_S^i) μ_t_k+1 + ρ_S^i δ_X_t_k+1, and observe terminal cost g_t_k+1\n        \n        \n        Compute\n        δ_η   =   ^η(t_k+1,X_t_k+1,μ_t_k+1) - ^η(t_k,X_t_k,μ_t_k)   \n                   +  (   f_t_k  +  λlog p_θ(t_k,X_t_k,μ_t_k,α_t_k)  - β^η(t_k,X_t_k,μ_t_k)  ) Δ t     \n        Δ_η   =   δ_η∇_η^η(t_k,X_t_k,μ_t_k) \n        Δ_θ   =   δ_η∇_θlog p_θ(t_k,X_t_k,μ_t_k,α_t_k) +   _θ[^η](t_k,X_t_k,μ_t_k)  Δ t, \n        \n        with the constraint that when k=n-1,  ^η(t_k+1,X_t_k+1,μ_t_k+1)=g_t_k+1.\n        \n        Critic Update: η←η + ρ_E^i Δ _η;  Actor Update: θ←θ -  ρ_G^i  Δ_θ\n        k←k+1 Return: ^η, π_θOnline actor-critic mean-field algorithm  [About the choice of actor and critic parametric functions]  \n        In the Actor-critic algorithms, we have to specify a parametric family of  randomised policies π_θ, and  a parametric family of critic functions ^η. In general, for critic functions, one can consider cylindrical neural network functions in the form\n        \n            ^η(t,x,μ)    = Ψ(t,x, <φ,μ>),    (t,x,μ) ∈ [0,T]×^d×_2(^d),\n         \n        where Ψ is a feedforward neural network from [0,T]×^d×^k into , and φ is another feedforward neural network from ^d into ^k (called latent space), and we use the notation \n        <ϕ,μ>:=∫ϕ(x)μ(x̣).  The set of parameters η is the union of the parameter sets for the two  neural networks Ψ and φ. \n        This choice is motivated by the density property of the set of cylindrical functions, i.e. functions in the form  (<ref>) with continuous functions Ψ and φ, with respect to continuous functions on [0,T]×^d×_2(^d) as  shown  in <cit.>, \n        and the universal approximation property  of feedforward neural networks on finite-dimensional space, see <cit.>. \n        \n        Concerning the policies, notice that when the temperature parameter  for exploration λ is zero, the optimal policy is of pure (non randomised)  feedback form as a function of (t,x,μ). When \n        λ>0, the optimal policy is in general truly randomised, and the larger is λ, the larger is the exploration in the sense that the variance of the randomised policy increases.  We can  then take for the parametric family of randomised policies,  for example Gaussian distributions: \n        \n        π_θ(.|t,x,μ)     =   ( (t,x,μ); ϑ(λ) ), \n        \n        where  is a cylindrical neural network function on [0,T]×^d×_2(^d) valued in A⊂^m, and ϑ(.) is a given symmetric matrix-valued function, nondecreasing w.r.t. λ, with ϑ(λ) positive-definite for λ>0, and ϑ(0)=0. \n        \n        In some particular mean-field models, we may know  a priori the structural form of the optimal value function and optimal randomised policy, and this suggests alternately some specific form for the parametric family of actor and critic functions. This is typically the case of the linear quadratic model, as presented in the next section. \n        \n        \n        \n        The above actor-critic algorithms involve the computation of the term _θ[^η] at each time t_k, and along the observed state X_t_k and estimated state distribution μ_t_k. This additional term, compared to the actor-critic algorithms designed in <cit.>  for standard stochastic control without mean-field interaction, involves the operator _θ defined in (<ref>).  In the separable form case, namely when the coefficients of the mean-field process are in the form\n        \n        b(x,μ,a)   =  (x,μ) +  C(a),        (σσ)(x,μ,a)   =  Σ(x,μ) + F(a), \n        \n        where C and F are known functions from A into ^d, resp. ^d× d, we notice that \n        ∇_θ b_θ(t,x,μ)     =    ∇_θ C_θ(t,x,μ),       C_θ(t,x,μ)   :=  ∫ C(a)   π_θ(ạ|t,x,μ), \n        \n        ∇_θΣ_θ(t,x,μ)     =    ∇_θ F_θ(t,x,μ),         F_θ(t,x,μ)   :=  ∫  F(a)   π_θ(ạ|t,x,μ), \n        \n        \n        are known functions,  and consequently  also the function _θ[^η].  Another important case where the term _θ[^η] is a known computable function is given in the linear quadratic framework as presented in the next section. \n        \n        \n        \n        \n        § THE LINEAR QUADRATIC CASE\n         \n        \n        \n        We focus on  the important class of MFC control problem with linear state dynamics and quadratic reward, namely \n        \n            b(x,μ,a)   =    B x + B̅μ̅+  C a,    σ(x,μ,a)   =  γ + D x + D̅μ̅+ Fa,  \n            \n            f(x,μ,a)   =   x Qx + μ̅Q̅μ̅+ a N a  + 2a Ix + 2aI̅μ̅+  2M.x + 2H.a, \n            \n            g(x,μ)   =   x P x + μ̅P̅μ̅+ 2L.x,\n         \n        for (x,μ,a)∈^d×_2(^d)×^m, where we denote by μ̅=∫ x μ(x̣),  B, B̅, D, D̅ are constant matrices in ^d× d, C, F are constant matrices in ^d× m, γ is a constant in ^d, \n        N is a  symmetric matrix in _+^m, I, I̅∈^m× d,  Q, Q̅, P, P̅ are  symmetric matrices in  ^d,  with Q≥0, P≥0, \n        \n        \n        \n        \n        M, L∈^d, H∈^m. \n        \n        In this case,  the optimal value function to this LQ MFC problem with entropy regularisation when minimizing over randomised controls a functional cost as in (<ref>),   is given by \n        \n            v(t,x,μ)    =   (x - μ̅) K(t) (x-μ̅) + μ̅Λ(t)μ̅+ 2 Y(t).x + R(t),\n         \n        where K (valued in ^d), Λ (valued in ^d), Y valued in ^d, and R valued in , are solutions to a system of ordinary differential equations on [0,T] given in (<ref>). \n        Moreover,  the optimal randomised control is of feedback form with  Gaussian distribution:\n        π^*(.|t,x,μ)     =     ( - S(t)^-1(  U(t) x + (W(t) - U(t))μ̅+ O(t) ); λ/2 S(t)^-1), \n        \n        where \n        \n        S(t)   =   N + F K(t) F,        O(t)   =    H + C Y(t)  + F K(t) γ\n        \n        U(t)   =   I + C K(t) + F K(t) D,         W(t)   =   I + I̅ + C Λ(t) + F K(t) (D + D̅). \n        \n        This is an extension of  the mean-field LQ control without entropy and control randomization, and the proof that adapts arguments in <cit.> is reported in Appendix <ref>. \n        \n        \n        K̇ + KB + B K + D K D + Q        \n        \n        -   (I+ F KD + C K)(N + F K F)^-1(I+ F KD + C K)    =     0,       t ∈ [0,T],  \n        \n        K(T)    =     P,  \n        Λ̇+ Λ(B+B̅) + (B+B̅)Λ + (D+D̅)Λ (D+D̅) + Q + Q̅      \n        \n        -    (I+ I̅+ F K(D+D̅) + CΛ)(N + F K F)^-1 (I + I̅ + F K(D+D̅) + CΛ)    =    0,    t ∈ [0,T], \n        Λ(T)    =    P + P̅,  \n        Ẏ + (B + B̅) Y + (D+D̅) K γ + M       \n        \n         -    ( I+ I̅+  F K(D+D̅) + CΛ)(N + F KF)^-1(H + F Kγ + C Y)     =    0,    t ∈ [0,T], \n        \n        Y(T)    =    L,  \n        Ṙ + γ K γ  - (H + F Kγ + C Y)(N + F KF)^-1(H + F Kγ + C Y)       \n        \n        -   λ m/2log(2π)-λ/2log|λ/2det(N+F K(t) F)|   =    0,      t ∈ [0,T],  \n        \n        R(T)    =    0. \n        \n        Moreover, the optimal randomised is in feedback form: π_t^*(ạ)=π̂(ạ | t,X_t^*,_X_t^*) with Gaussian distribution\n        π^*(.| t,x,μ)    =    (  - S_t^-1(U_t  x + (V_t-U_t) μ̅+ O_t)  ;  λ/2 S_t^-1),\n        \n        where \n        \n        S_t  =    N+F K(t) F,         O_t  =    H+ F K(t)γ +C Y(t),  \n        \n        U_t  =    I+F K(t)D +C K(t),        V_t  =  I+I̅+F K(t)(D+D̅) +CΛ(t). \n        \n        \n         \n         \n         \n        \n        In a RL setting, the coefficients of the LQ model (<ref>)\n        are unknown, thus  K, Λ, Y, and R cannot be solved from the system of ODEs, and S, O, U, and W are also unknown.  We shall then employ our RL algorithms to solve the LQ problem in a model-free setting. \n        In view of the above structure of the optimal value function and randomised policy, we parametrise the cost  value function by \n        \n            ^η(t,x,μ)    =   (x - μ̅) K^η(t) (x-μ̅) + μ̅Λ^η(t)μ̅+ 2 Y^η(t).x + R^η(t),\n         \n        for some parametric functions K^η, Λ^η, Y^η, R^η on [0,T], with parameters η∈^p. On the other hand, we parametrise the randomised policies by \n        \n            π_θ(.|t,x,μ)    =  (  ϕ_1^θ(t) x + ϕ_2^θ(t)μ̅+ ϕ_3^θ(t); Σ^θ(t) ),\n         \n        for some parametric functions ϕ_1^θ,ϕ_2^θ,ϕ_3^θ,Σ^θ on [0,T], with parameter θ∈^q. \n        \n        The parametric functions  K^η, Λ^η, Y^η, R^η, and  ϕ_1^θ,ϕ_2^θ,ϕ_3^θ,Σ^θ, could be  in general neural networks on [0,T], but depending on the examples, we could take more specific forms, as discussed in the next section. \n        \n        \n        For parametrisation of the cost  value function and randomised policies as in (<ref>), (<ref>), we  see that \n        ∂_μ^η(t,x,μ)(x')    =   \n         -2 K^η(t)(x-μ̅) + 2 Λημ̅,   ∂_x'∂_μ^η(t,x,μ)(x') = 0,  \n        ∇_θ b_θ(t,x,μ)     =      C ∇_θϕ_1^θ(t) ∙_2 x + C ∇_θϕ_2^θ(t) ∙_2  μ̅+ C ∇_θϕ_3^θ(t)\n        \n        and then  \n        _θ[^η](t,x,μ)    =    2  [ (∇_θϕ_1^θ(t) + ∇_θϕ_2^θ(t)) ∙_2  μ̅+ ∇_θϕ_3^θ(t) ] C( - K^η(t)(x-μ̅) +  Λ^ημ̅),\n        \n        which only involves, up to the knowledge of C, known functions of (t,x,μ). Notice also that when ϕ_1^θ=-ϕ_2^θ, and ϕ_3^θ≡0 (see below  the example of mean-field systemic risk), then _θ[^η]≡0. \n        \n        \n        \n        \n        § NUMERICAL EXAMPLES\n        \n        \n         §.§ Example 1: mean-field systemic risk\n        \n        \n        \n         We consider a mean-field model of systemic risk introduced in <cit.>. This fits into a LQ MFC with \n         B̅ = -  B > 0,   C=1,  γ > 0,   D = D̅ = F = 0 \n        \n        I = - I̅ >0,    Q + Q̅ = 0,    N = 1/2,   M=H=L=0,   P + P̅ = 0,\n         \n        and Q≥2I^2. We also take X_0 ∼(0,1). In this case, the solution to the system of ODEs (<ref>)  yields the analytic expression: \n        \n        K(t)    =    - 1/2[ B̅ + 2I - √(Δ)√(Δ)sinh(√(Δ)(T-t))  + (B̅ + 2I  + 2P) cosh (√(Δ)(T-t))/√(Δ)cosh(√(Δ)(T-t))  + \n        (B̅ + 2I + 2P) sinh (√(Δ)(T-t))], \n        \n        R(t)    =   γ^2/2ln[ cosh (√(Δ)(T-t)) + B̅ + 2I  + 2P/√(Δ)sinh (√(Δ)(T-t)) ] - γ^2/2 (B̅ + 2I)(T-t) \n               -λ (T-t)/2log(2πλ)\n        \n        with √(Δ)=√((B̅+2I)^2  + 2Q -  4I^2),  and Λ=Y=0, while the optimal randomised policy is given by\n        π̂(.|t,x,μ)    =   ( ϕ(t)(x - μ̅) ; λ),    ϕ(t)   =    -2(K(t) + I). \n        \n         \n        \n        In view of these expressions, we shall use  critic function as\n        ^η(t,x,μ)    =    K^η(t)  (x - μ̅)^2  + R^η(t), \n        \n        for some parametric functions K^η and R^η on [0,T] with parameters η, and actor functions as \n        π_θ(.|t,x,μ)    =   (  ϕ^θ(t) (x -μ̅); λ),  \n          log p_θ(t,x,μ,a)     =     - 1/2log(2πλ) - \n        |a - ϕ^θ(t)(x-μ̅)|^2/2λ,\n        \n        for some parametric function ϕ^θ on [0,T] with parameter θ.   As shown in Section <ref>, we notice that _θ[^η]=0. \n        \n        \n        We shall test with two choices of parametric functions: \n        \n          *  Exact parametrisation:\n            K^η(t)   =     - 1/2[ η_3  - η_1 sinh(η_1(T-t))  + η_2  cosh (η_1(T-t))/cosh(η_1(T-t))  + \n            η_2  sinh (η_1(T-t))], \n            \n            R^η(t)   =  η_4 ln[ cosh (η_1(T-t)) + η_2  sinh (η_1(T-t)) ] -  η_3 η_4(T-t) -λ (T-t)/2log(2πλ) \n            ϕ^θ(t)    =  θ_3  - θ_1 sinh(θ_1(T-t))  + θ_2  cosh (θ_1(T-t))/cosh(θ_1(T-t))  + \n            θ_2  sinh (θ_1(T-t)),\n        \n        with parameters η=(η_1,η_2,η_3,η_4)∈_+^4, and θ=(θ_1,θ_2,θ_3)∈_+^3, so that the optimal solution in the model-based case corresponds to \n        η_1^*=√(Δ), η_2^*=B̅ + 2I  + 2P, η_3^*=B̅ + 2I, η_4^*=γ^2/2, and θ_1^*=√(Δ), θ_2^*=B̅ + 2I  + 2P, θ_3^*=B̅. \n        \n          *  Neural networks:  for K^η, R^η and ϕ^θ, with time input. \n        \n        Compute for i=1,…,4, \n        ∂ K^η/∂η_i  =  ,   ∂ R^η/∂η_i  =  ∂_η_1 K^η(t)    =    -1/2[η_1(T-t)( [sinh(η_1(T-t))+η_2cosh(η_1(T-t))/cosh(η_1(T-t))+η_2sinh(η_1(T-t))]^2-1) \n               -  sinh(η_1(T-t))+η_2cosh(η_1(T-t))/cosh(η_1(T-t))+η_2sinh(η_1(T-t))], \n        ∂_η_2K^η (t)    =   η_1/2 [ cosh(η_1(T-t))+η_2sinh(η_1(T-t)) ]^2,   ∂_η_3K^η (t) =  -1/2,  ∂_η_4K^η (t) = 0, \n        ∂_η_1R^η(t)    =   η_4 (T-t) sinh(η_1(T-t))+η_2cosh(η_1(T-t))/cosh(η_1(T-t))+η_2sinh(η_1(T-t))\n        ∂_η_2R^η(t)    =   η_4sinh(η_1(T-t))/cosh(η_1(T-t))+η_2sinh(η_1(T-t)),   ∂_η_3R^η(t) = -η_4(T-t), \n        ∂_η_4R^η(t)    =   ln[ cosh (η_1(T-t)) + η_2  sinh (η_1(T-t)) ] -η_3(T-t),  \n        \n        and so  ∂^η/∂η_i=∂ K^η/∂η_i(x-μ̅)^2 + ∂ R^η/∂η_i. \n        \n        \n        For the randomised policies, we use the following parametrisation\n        π^θ(.|t,x,μ)    =   (  ϕ^θ(t) (x -μ̅); λ),  \n          log p_θ(t,x,μ,a)     =     - 1/2log(2πλ) - \n        |a - ϕ^θ(t)(x-μ̅)|^2/2λ. \n        \n        with parameter θ=(θ_1,θ_2,θ_3)∈_+^3, and \n        ϕ^θ(t)    =   θ_3  - θ_1 sinh(θ_1(T-t))  + θ_2  cosh (θ_1(T-t))/cosh(θ_1(T-t))  + \n        θ_2  sinh (θ_1(T-t)).\n        Compute ∂ϕ^θ/∂θ_i, and then ∂log p_θ/∂θ_i  for i=1,…,3.\n        ∂_θ_1ϕ^θ (t)    =   θ_1(T-t) [ (sinh(θ_1(T-t))+θ_2cosh(θ_1(T-t))/cosh(θ_1(T-t))+θ_2sinh(θ_1(T-t)))^2-1] \n                -  sinh(θ_1(T-t))+θ_2cosh(θ_1(T-t))/cosh(θ_1(T-t))+θ_2sinh(θ_1(T-t))∂_θ_2ϕ^θ (t)    =    -θ_1/(cosh(θ_1(T-t))+θ_2sinh(θ_1(T-t)))^2,  ∂_θ_3ϕ^θ (t) = 1\n        \n        and\n        ∇_θlog p_θ(t,x,μ,a)    =   (a-ϕ^θ(t)(x-μ̅))(x-μ̅)/λ∇_θϕ^θ(t).\n        \n        \n         \n         \n        \n        We implement our actor-critic algorithms with a simulator of X for coefficients equal to\n        \n        T = 1,  γ = 1,  B̅ = - B = 0.6,    I=0.4,   P=Q=1,  \n        \n        \n        \n        \n         The simulator for  X is  based on the real mean-field model:\n        X̣_t    =   ( B̅([X_t] -  X_t) + α_t ) ṭ + γẈ_t. \n        \n        Since α∼π^θ, we note that [α_t]=ϕ^θ(t)([X_t] - [μ̅_t])=0.  We deduce that under such α, [X_t]=0, hence [X_t]=[X_0].  From the above mean-field dynamics of X, we deduce that \n        \n        X_t_k+1 - [X_0]    =     e^-B̅Δ t (X_t_k - [X_0]) +   α_t_k(   1 - e^-B̅Δ t/B̅) + γ∫_t_k^t_k+1 e^-B̅(t_k+1 - s)Ẉ_s \n           ≃    e^BΔ t (X_t_k - [X_0]) +   α_t_k(   1 - e^-B̅Δ t/B̅) + γ e^-B̅Δ tΔ W_t_k. \n        \n        The cost is simulated according to\n        \n        f_t_k   =    Q(X_t_k - [X_0])^2 + 1/2α_t_k^2 + 2 α_t_k I (X_t_k - [X_0]),    g_T   =   P (X_T - [X_0])^2. \n        \n        \n        \n        \n        We first present the numerical results of our offline Algorithm <ref> when using the exact parametrisation  (<ref>).  The derivatives  w.r.t. to  η of K^η, R^η, hence of ^η, as well as the derivative w.r.t. θ of log p_θ have explicit analytic expressions that are implemented in \n        the updating rule of the actor-critic algorithm. \n        \n        Here we used the following parameters:  the learning rates (ρ_S, ρ_E, ρ_G) were taken as ρ_S=0.2 constant, ρ_E = (0.2,0.2,0.1,0.5) until iteration 500, then (2.0,1.0,2.0,1.0) until iteration 1500 and then (0.5,0.5,0.5,0.5), whereas ρ_G = (0.1,0.1,0.1) until iteration 1500, then (0.05,0.05,0.05); \n        \n        \n        \n        \n        \n         \n        Here we used the following parameters: \n        μ_t_k was initialized at 0; the number of episodes was N=2100; the time horizon was T=1 and the time step Δ t= 0.02. The values of the model parameters were as described above.\n        The learning rates (ρ_S, ρ_E, ρ_G) and λ were taken as ρ_S=0.2 constant, and at iteration i, \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n            ρ_E(i) = \n                \n                        (0.01,0.1,0.01,0.2)  if  i ≤ 500\n                        \n            \n                        (0.1,0.1,0.1,0.1)  if  500 < i ≤ 21000\n                  ρ_G(i) = \n                \n                        (0.03,0.05,0.03)  if  i ≤ 7000\n                        \n            \n                        (0.01,0.01,0.01)  if  7000 < i ≤ 10000\n                        \n            \n                        (0.005,0.01,0.005)   if  10000 < i ≤ 14000\n                        \n                        \n                        \n            \n                        (0.002,0.002,0.002)    if  17000 < i ≤ 21000\n        \n        and\n        \n            λ(i) = \n                \n                    0.1  if  i ≤ 8000, \n            \n                    0.01  if  8000 < i ≤ 14000, \n            \n                    0.001  if  14000 < i   ≤ 21000\n        \n        Moreover, after i=14000 iterations, we also increase the size of the minibatch from 20 to 40. \n        In Table <ref>, we give the learnt parameters for the critic and actor functions, to be compared wih \n        the exact value of the  parameters.  \n        \n        \n        \n        \n         In Figure <ref>, we see that, even though the parameters η and θ (shown with full lines) are slightly different from the true optimal values (shown in dashed lines), the functions K, R and ϕ are matched almost perfectly. \n        \n        \n        \n         \n        We also display one realization of the control and of the cost. These are based on evaluating the control and the cumulative cost along one trajectory of the state. We first simulate 10^4 realizations of a Brownian motion. Based on this, we generate trajectories for one 10^4 population of agents using the learnt control and one population of 10^4 agents using the optimal control. For the population that uses the learnt control, the control is given by the mean of the actor, namely, ϕ^θ(t) (x -μ̅). In the dynamics, the cost and the control, the mean field term is replaced by the empirical mean of the corresponding population at the current time. We can see that the trajectories of control (resp. cost) are very similar. \n        \n        \n         \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n         \n        \n        \n         Next, we present in Figure <ref> and  Figure <ref>  the numerical results of our online Algorithm <ref> when using neural networks. In this case, the derivatives  w.r.t. to  η of K^η, R^η, hence of ^η, as well as the derivative w.r.t. θ of log p_θ \n         are computed by automatic differentiation. \n         We use neural networks with 3 hidden layers, 10 neurons per layer and tanh activation functions. We take n=30, N=15000 iterations, batch size 500 (10000 for the law estimation in the simulator), constant learning rates 10^-3, except ω_S = 1.  \n          We change λ along episodes: λ=0.1 for the first 3334 ones, then 0.01 for the next 3333 ones, then 0.001 until the end.\n         \n         \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n          §.§.§ Programmation\n        \n        Under the LQ MFC conditions above, we define \n        \n            J(θ)   =𝔼_α∼π^θ[∫_0^T(f(X_s,_X_s,α_s)+λlog (p_s^θ(α_s)))ds+g(X_T,_X_T)]\n               =𝔼_α∼π^θ[∫_0^T (QX_s^2+Q̅X̅_s^2+α_s^2/2+2Iα_s X_s+2I̅α_sX̅_s+λlog(p_s^θ(α_s)))ds+PX_T^2+P̅X̅_T^2]\n               =𝔼_α∼π^θ[∫_0^T (Q(X_s^2-X̅_s^2)+α_s^2/2+2Iα_s (X_s-X̅_s)+λlog(p_s^θ(α_s)))ds+P(X_T^2-X̅_T^2)]\n        \n        where the dynamic of the controlled process {X_t}:\n            dX_s=(B(X_s-X̅_s)+α_s)ds+γ dW_s\n        \n        then \n        \n            dX̅_s=α̅_sds\n        \n        and p_t^θ(a) is the density function of π^θ(·|t,X_t,_X_t)=𝒩(ϕ^θ(t)(X_t-X̅_t);λ) defined above.\n        Hence\n        \n            J(θ)=[∫_0^T (Q+(ϕ^θ(s))^2/2+2Iϕ^θ(s))(X_s-X̅_s)^2ds+P(X_T-X̅_T)^2-λ T/2log(2πλ)]\n        \n            =∫_0^T (Q+(ϕ^θ(s))^2/2+2Iϕ^θ(s))Var(X_s)ds+PVar(X_T)-λ T/2log(2πλ)\n        \n        Cause \n        \n            d(X_s-X̅_s)=(B(X_s-X̅_s)+(α_s-α̅_s))ds+γ dW_s\n        \n        we have\n        \n            Var(X_s)=[(X_s-X̅_s)^2]=γ^2 s\n        \n        Therefore\n        \n            J(θ)=∫_0^Tγ^2(Q+(ϕ^θ(s))^2/2+2Iϕ^θ(s))sds+Pγ^2T-λ T/2log(2πλ)\n        \n        with \n        \n            ∂_θ_iJ(θ)=∫_0^T γ^2(ϕ^θ(s)∂_θ_iϕ^θ(s)+2I∂\n            _θ_iϕ^θ(s))sds\n        \n        \n        Then, we compute the gradient of {ϕ^θ}:\n            ∂_θ_1ϕ^θ (t)=θ_1(T-t)((sinh(θ_1(T-t))+θ_2cosh(θ_1(T-t))/cosh(θ_1(T-t))+θ_2sinh(θ_1(T-t)))^2-1)-sinh(θ_1(T-t))+θ_2cosh(θ_1(T-t))/cosh(θ_1(T-t))+θ_2sinh(θ_1(T-t))\n        \n            ∂_θ_2ϕ^θ (t)=-θ_1/(cosh(θ_1(T-t))+θ_2sinh(θ_1(T-t)))^2\n        \n            ∂_θ_3ϕ^θ (t)=1\n        \n        \n        \n        \n        \n        Finally, we test  in Table <ref> the learnt policies \n        from the exact and NN parametrisation by computing the associated initial expected social costs.  \n        We simulate 10 populations, each consisting of 10^4 agents. All the agents use the control function with the parameters learnt by the algorithm. For the dynamics, the cost and the control, the mean field term is replaced by the empirical mean of the corresponding population at the present time step. For each population, we compute the social cost. We then average over the 10 populations in order to get a Monte Carlo estimate of the social cost. We report in the table the value of this average social cost, the standard deviation over the 10 populations, and the relative error between the average social cost and the optimal cost computed by the formula K^η^*_0  Var(X_0) +R^η^*_0 with the optimal parameter η^*. \n        \n        \n        \n        \n         \n        \n        \n        \n        \n        \n        \n         §.§ Example 2: mean-variance problem\n        \n        \n        \n        We consider the celebrated Markowitz portfolio selection problem: minimize over the amount α  invested  in a stock driven by a Black-Scholes model with rate of return C, and constant volatility F>0, the \n        risk of the terminal wealth X_T measured by the mean-variance criterion: \n        \n        P  Var(X_T) - [X_T],\n        \n        where P>0 is the risk aversion of the investor. This  is a particular case of  the LQ MFC with \n        \n        B = B̅ = 0,  γ = D = D̅ = 0,   \n        \n        Q=Q̅=N=I=I̅=M=H =0,    P + P̅ = 0,   L=-1/2. \n        \n        \n        In this case, the solution to the system of ODEs (<ref>)  gives the analytic expression: \n        \n        K(t)    =    P exp( - C^2/F^2(T-t) ),    Y(t)   =   -1/2, \n        \n        R(t)     =    1/4P[ 1 - exp(  C^2/F^2(T-t) )  ] -λ(T-t)/2log(πλ/PF^2)-λ C^2/4F^2(T-t)^2,  \n        Λ=0, while the optimal randomised  policy is given by \n        \n            π̂(.|t,x,μ)     =  ( ϕ(t) (x  - μ̅) + ϕ_3(t) ;  λϑ(t)  ) \n                 ϕ(t)   =    - C/F^2,   ϕ_3^θ(t)   =  C/2F^2 P e^C^2/F^2(T-t),   ϑ(t)   =  1/2F^2 P  e^C^2/F^2(T-t).\n         \n        \n        In  a model-free setting,  the volatility F>0 of the stock price is unknown, while the risk aversion parameter P>0 is usually known and  fixed by the investor, and  we assume here that the rate of return C>0 is known. \n        In view of the above expressions, we shall use  critic function as\n        ^η(t,x,μ)    =    K^η(t)  (x - μ̅)^2  + R^η(t), \n        \n        for some parametric functions K^η and R^η on [0,T] with parameters η, and actor functions as \n        π_θ(.|t,x,μ)    =   (  ϕ^θ(t) (x -μ̅) + ϕ_3^θ; λϑ^θ(t)  ),  \n          log p_θ(t,x,μ,a)     =     - 1/2log(2πλϑ^θ(t)) - \n        |a - ϕ^θ(t)(x-μ̅)- ϕ_3^θ(t) |^2/2λ,\n        \n        for some parametric functions ϕ^θ, ϕ_3^θ, and ϑ^θ>0 on [0,T] with parameter θ.  Given such  family of parametric actor/critic functions, we have \n         _θ[^η](t,x,μ)      =    \n        -  2  C K^η(t)(x-μ̅)  ∇_θϕ_3^θ(t). \n         \n        We shall test with two choices of parametric functions: \n        \n          *  Exact parametrisation:\n            K^η(t)    =     P e^-η(T-t), \n            \n            R^η(t)   =  1/4P[  1 - e^η(T-t)]-λ(T-t)/2log(πηλ/C^2P)-λη/4(T-t)^2 \n            ϕ^θ(t)   =      -C θ,   ϕ_3^θ(t)   =  Cθ/2P  e^C^2θ(T-t),  ϑ^θ(t)   =  θ/2P e^C^2θ(T-t),\n         \n        with parameters η∈(0,∞), θ∈, so that the optimal solution in the model-based case corresponds to \n        η^*=C^2/F^2,  and θ^*=1/F^2. \n        \n          *  Neural networks:  for K^η, R^η,  ϕ^θ, ϕ_3^θ and ϑ^θ  with time input. \n        \n        \n        This suggests to use a parametrisation of the performance value function as \n        ^η(t,x,μ)    =    K^η(t)(x- μ̅)^2   - x +  R^η(t),\n        \n        with \n        \n        η∈(0,∞) and \n        \n        K^η(t)    =    P e^-η(T-t),    R^η(t)   =  1/4P[ - e^η(T-t) + 1]-λ(T-t)/2log(πηλ/C^2P)-λη/4(T-t)^2,  \n        \n        \n        and a parametrisation for the randomised policies as \n        π^θ(.|t,x,μ)    =   (  - C θ (x -μ̅-  1/2P  e^C^2 θ(T-t) );  λθ/2P   e^C^2θ(T-t)), \n        \n         log p_θ(t,x,μ,a)    =    - 1/2log(2πλθ/2P) - 1/2 C^2  θ(T-t)  \n                 -  | a + C θ (x -μ̅-  1/2P  e^C^2 θ(T-t) ) |^2/λθ P  e^- C^2 θ(T-t), \n        \n        \n        \n        with parameter θ∈(0,∞). \n        \n        This corresponds to ϕ_1^θ=-ϕ_2^θ (=-Cθ), \n        ϕ_3^θ(t)    =   Cθ/2P  e^C^2θ(T-t),\n        \n        \n        \n        \n        \n         \n         \n         \n         \n          \n        \n         Remark:  When using neural networks approximation, we take\n         π^θ(.|t,x,μ)    =   ( ϕ^θ(t) (x-μ̅) + ϕ_3^θ(t); λΣ^θ(t) ),   \n         log p_θ(t,x,μ,a)    =    - 1/2log(2πλΣ^θ(t) ) -   | a -  ϕ^θ(t) (x -μ̅) -  ϕ_3^θ(t)  |^2/2λΣ^θ(t).\n         \n         We also have \n         _θ[^η](t,x,μ)      =    \n        -  2  C K_η(t)(x-μ̅)  ∇_θϕ_3^θ(t). \n         \n        Compare the learned NN ϕ^θ, ϕ_3^θ and Σ^θ with the true values:\n         ϕ^θ  =   - C/F^2,   ϕ_3^θ(t)   =  C/2PF^2exp(  C^2/F^2(T-t) ),   Σ^θ(t)   =  1/2PF^2exp(  C^2/F^2(T-t) ),\n         Compute ∇_η K^η, ∇ R^η, then ∇_η^η, ∇_θlog p_θ, and \n        implement and compare to the results in <cit.>, <cit.>.  \n        \n        \n        \n        ∇_η K^η(t) = -P(T-t)e^-η(T-t),  ∇_η R^η(t) =  - T-t/4Pe^η(T-t)-λ(T-t)/2η-λ/4(T-t)^2\n        \n        and so \n        \n            ∇_η^η(t)    = ∇_η K^η(t)(x-μ̅)^2+∇_η R^η(t)\n                =  -P(T-t)e^-η(T-t)(x-μ̅)^2  - T-t/4Pe^η(T-t)-λ(T-t)/2η-λ/4(T-t)^2\n        \n        Moreover, \n        ∇_θlog p_θ(t,x,μ,a)    =     -1/2θ-1/2C^2(T-t)-2(a+CF_θ(t))Cθ∇_θ F_θ(t) -(a+CF_θ(t))^2/λθ^2Pe^-C^2θ(T-t)\n                   +  (a+CF_θ(t))^2/λθPC^2(T-t)e^-C^2θ(T-t)\n        where \n        \n        F_θ(t)    =   θ(x-μ̅-1/2Pe^C^2θ(T-t)),   ∇_θ F_θ(t)   =   x-μ̅-1+θ C^2(T-t)/2Pe^C^2θ(T-t).\n        \n        \n          \n         We implement our algorithms with a simulator of X for different values of (C,F).  The simulator of X is based on the time discretization of the wealth process\n        \n        \n        \n        \n            X_t_k+1   =    X_t_k + C α_t_kΔ t + F α_t_kΔ W_t_k,    k=0,…,n-1,\n        \n        with  α∼π_θ. Since  [α_t]=ϕ_3^θ(t), we have \n        _α∼π_θ[X_T]    =    X_0  + C ∑_k=0^n-1ϕ_3^θ(t_k) Δ t,  \n        \n        and the terminal cost is computed with \n        \n        g_T     =     P(X_T - _α∼π_θ[X_T])^2 - X_T.\n        \n        The Sharpe ratio associated to a strategy α∼π_θ is given by \n        \n        S^θ   =   _α∼π_θ[X_T] - X_0/√( Var_α∼π_θ(X_T))  =   C ∑_k=0^n-1ϕ_3^θ(t_k) Δ t/√( Var_α∼π_θ(X_T)). \n        \n        The variance of the wealth  can be estimated by Monte-Carlo sampling X_T when α∼π_θ, or  can be explicitly computed as follows:\n        \n        by setting Y_t=X_t - _α∼π_θ[X_t], we get by Itô's formula: \n        _α∼π_θ[Y_t^2]    =   ( 2 C _α∼π_θ[Y_tα_t] + F^2 [α_t^2] ) ṭ.  \n        \n        Since α_t∼π^θ(.|t,X_t,_α∼π_θ[X_t])=( ϕ^θ(t) Y_t  + ϕ_3^θ(t); λϑ^θ(t) ), we have\n        [α_t^2]    =   λϑ^θ(t) +  |ϕ_3^θ(t)|^2 + |ϕ^θ(t)|^2 [Y_t^2],     \n        _α∼π_θ[Y_t α_t]    =   [Y_t ( ϕ^θ(t) Y_t  + ϕ_3^θ(t) ) ]   =  ϕ^θ(t) [Y_t^2], \n        \n        and so \n        _α∼π_θ[Y_t^2]    =   [   ϕ^θ(t)(2 C + F^2 ϕ^θ(t) )  [Y_t^2] + F^2(  λϑ^θ(t) +  |ϕ_3^θ(t)|^2 ) ] ṭ.  \n        \n        We deduce that\n        \n            Var_α∼π_θ(X_T)    =    e^∫_0^T ϕ^θ(t)(2 C + F^2 ϕ^θ(t) ) ṭ∫_0^T  e^- ∫_0^t ϕ^θ(s)(2 C + F^2 ϕ^θ(s)) ṣ  F^2(  λϑ^θ(t) +  |ϕ_3^θ(t)|^2 ) ṭ.\n         \n        We shall compare   the Sharpe ratio when following the learned  strategy α∼π_θ, and the optimal one which is given by \n        \n        S^*    =   exp(C^2/F^2T)  -1/√(2 λ P T +  exp(C^2/F^2T)  -1 ). \n        \n        \n        \n        \n        We first  present the numerical results of our offline Algorithm <ref> when using the exact parametrisation (<ref>). \n        The derivatives  w.r.t. to  η of K^η, R^η, hence of ^η, as well as the derivative w.r.t. θ of log p_θ, and _θ[^η]  have explicit analytic expressions that are implemented in \n        the updating rule of the actor-critic algorithm.  Moreover, the Sharpe ratio when α∼π_θ is analytically expressed as \n        \n        S^θ   =   e^C^2θ T - 1 /2P/√(F^2λ(1-e^C^2θ T(F^2θ -1))/2C^2P(1-F^2θ)+e^C^2 F^2|θ|^2 T-1/4P^2 ) . \n        \n        \n        \n        Here we used the following parameters:  the learning rates (ρ_S, ρ_E, ρ_G) were taken as (0.3,0.5,0.5) until iteration 13500, and then (ρ_E, ρ_G) were decreased to (0.1,0.1); moreover, to avoid instabilities we have truncated the norm of the updates to 0.1 and 0.5 respectively; μ_t_k was initialized at 1; the number of episodes was N=2500; the time horizon was T=0.2 and the time step Δ t= 0.01. The values of the model parameters were as described above with C=0.3, F=0.1, P=1. In Figure <ref>, we see that, even though the parameters η and θ (shown with full lines) are slightly different from the true optimal values (shown in dashed lines), the functions K, R, ϕ and ϕ_3 are matched almost perfectly.\n        \n        \n        Mathieu: TODO: present the table. Vary λ.   \n        \n        \n        \n        \n        Next, we present in Figure <ref> and Figure <ref> the numerical results of our online Algorithm <ref> when using neural networks. In this case, the derivatives  w.r.t. to  η of K^η, R^η, hence of ^η, as well as the derivative w.r.t. θ of log p_θ \n         are computed by automatic differentiation. \n         We use neural networks with 3 hidden layers, with 10 neurons per layer and tanh activation functions. n=30, N=10000 iterations, batch size 300 (10000 for the law estimation in the simulator), constant learning rates 10^-3, except ω_S = 1. \n        We change λ along episodes: λ=0.1 for the first 3334 ones, then 0.01 for the first 3333 ones, then 0.001 until the end.\n         \n         \n        \n         §.§ Example 2: optimal trading\n        \n        \n        \n        We consider an optimal trading problem where the inventory is governed by \n        X̣_t    =   α_t ṭ + γẈ_t, \n        \n        and we aim to minimize over randomised trading rate α∼π the cost functional\n        [ ∫_0^T α_t^2 + 2 H α_t  - λ(π_t) ṭ + P  Var(X_T) ]. \n        \n        where γ>0, H>0 is the transaction price per trading,  P>0 is a risk aversion parameter, and λ>0 is the temperature parameter.  \n        This model fits into the LQ framework, and the solution to the system of ODEs (<ref>) is given by \n        \n        \n        \n        \n        \n        K(t)     =  P/1 + P(T-t),           R(t)   =  γ^2 log (1 + P(T-t)) - (H^2 + λ/2log( πλ) ) (T-t),\n        Λ=Y≡0, \n        while the optimal randomised policy is given by \n        π̂(•|t,x,μ)    ∼   (  - K(t) (x - μ̅)  - H; λ/2). \n        \n        \n        \n        In a RL setting, the coefficients σ, H and P are unknown, and we use critic function as\n        ^η(t,x,μ)    =    K^η(t)  (x - μ̅)^2  + R^η(t), \n        \n        for some parametric functions K^η and R^η on [0,T] with parameters η, and actor functions as \n        π_θ(.|t,x,μ)    =   (  ϕ^θ(t) (x -μ̅) + ϕ_3^θ(t); λ/2),  \n          log p_θ(t,x,μ,a)     =     - 1/2log(πλ) - \n        |a - ϕ^θ(t)(x-μ̅)- ϕ_3^θ(t) |^2/λ,\n        \n        for some parametric functions ϕ^θ, ϕ_3^θ  on [0,T] with parameter θ.  Given such  family of parametric actor/critic functions, we have \n         _θ[^η](t,x,μ)      =    \n        -  2  C K^η(t)(x-μ̅)  ∇_θϕ_3^θ(t). \n         \n        We shall test with two choices of parametric functions: \n        \n          *  Exact parametrisation:\n            K^η(t)    =  η_1/1 + η_1(T-t)\n            \n            R^η(t)   =  η_2  log (1 + η_1(T-t)) - ( η_3  + λ/2log( πλ) ) (T-t)\n            ϕ^θ(t)   =      - θ_1/1 + θ_1(T-t),   ϕ_3^θ(t)   =    -  θ_2,\n         \n        with parameters η=(η_1,η_2,η_3)∈(0,∞)^3, θ=(θ_1,θ_2)∈(0,∞)^2, so that the optimal solution in the model-based case corresponds to \n        (η_1^*,η_2^*,η_3^*)=(P,γ^2,H^2),  and (θ_1^*,θ_2^*)=(P,H).    \n        \n          *  Neural networks:  for K^η, R^η,  ϕ^θ, and ϕ_3^θ  with time input.  Actually, we take for ϕ_3^θ a constant function. \n        \n        \n         \n         \n        \n        \n        \n        \n        We first  present the numerical results of our offline Algorithm <ref> when using the exact parametrisation (<ref>). \n        The derivatives  w.r.t. to  η of K^η, R^η, hence of ^η, as well as the derivative w.r.t. θ of log p_θ, and _θ[^η]  have explicit analytic expressions that are implemented in \n        the updating rule of the actor-critic algorithm. \n        Here we used the following parameters: the learning rates (ρ_S, ρ_E, ρ_G) and λ were taken as ρ_S=0.2 constant,\n         and at iteration i,\n         \n            ρ_E(i) = \n                \n                        (0.05,0.05,0.05)  if  i ≤ 8000\n                        \n            \n                        (0.05,0.05,0.01)  if  8000 < i ≤ 20000\n                  ρ_G(i) = \n                \n                        (0.005,0.005)  if  i ≤ 8000\n                        \n            \n                        (0.001,0.001)  if  8000 < i ≤ 13000\n                        \n            \n                        (0.0005,0.0005)  if  8000 < i ≤ 13000\n        \n        and\n        \n            λ(i) = \n                \n                    0.1  if  i ≤ 8000, \n            \n                    0.01  if  8000 < i ≤ 13000 \n            \n                    0.001  if  13000 < i ≤ 20000\n        μ_t_k was initialized at 0; the number of episodes was N=20000; the time horizon was T=1 and the time step Δ t= 0.02. The values of the model parameters are: P=3, H=2, γ=1, and X_0 ∼(1,1).\n        \n        \n        In Table <ref>, we give the learnt parameters for the critic and actor function to be compared with the exact values, when using the learnt policy with learnt empirical distribution from the algorithm.  \n        \n        \n        \n        \n        \n         \n        In Figure <ref>, we see that the parameters and, hence, the functions K, R and ϕ are matched almost perfectly. We also display one realization of the control and of the cost. These are based on evaluating the control and the cumulative cost along one trajectory of the state. We first simulate 10^4 realizations of a Brownian motion. Based on this, we generate trajectories for one 10^4 population of agents using the learnt control and one population of 10^4 agents using the optimal control. For the population that uses the learnt control, the control is given by the mean of the actor, namely, ϕ^θ(t) (x -μ̅) + ϕ_3^θ(t). In the dynamics, the cost and the control, the mean field term is replaced by the empirical mean of the the corresponding population at the current time. We can see that the trajectories of control (resp. cost) are very similar. \n        \n        \n        \n        \n        \n        Next, we present in Figure <ref> and Figure <ref> the numerical results of our online Algorithm <ref> when using neural networks. In this case, the derivatives  w.r.t. to  η of K^η, R^η, hence of ^η, as well as the derivative w.r.t. θ of log p_θ \n         are computed by automatic differentiation. \n        We use neural networks with 3 hidden layers,  10 neurons per layer and tanh activation functions. We take n=30, N=15000 iterations, batch size 300 (10000 for the law estimation in the simulator), constant learning rates 10^-3, except ω_S = 1. \n        Again, we change λ along episodes: λ=0.1 for the second 3334 ones, then 0.01 for the next 3333 ones, then 0.001 until the end.\n        \n        \n         \n        \n        \n        Finally, we test in Table <ref> the learnt policies from the exact and NN parametrisation by computing the associated initial expected social costs. \n        We simulate 10 populations, each consisting of 10^4 agents. All the agents use the control function with the parameters learnt by the algorithm. For the dynamics, the cost and the control, the mean field term is replaced by the empirical mean of the corresponding population at the present time step. For each population, we compute the social cost. We then average over the 10 populations in order to get a Monte Carlo estimate of the social cost. We report in the table the value of this average social cost, the standard deviation over the 10 populations, and the relative error between the average social cost and the optimal cost computed by the formula K^η^*_0  Var(X_0) +R^η^*_0 with the optimal parameter η^*. \n        \n        \n        \n        \n        \n         \n         \n        \n        \n        \n        \n        \n        \n        \n         §.§ A min/max linear quadratic mean-field control problem\n        \n        \n        We consider a mean-field model in which the dynamics is linear and the running cost is quadratic in the position, the control and the expectation of the position. The terminal cost  encourages to be close to one of two targets. This type of model is inspired by the min-LQG problem of <cit.>. More precisely, the controlled McKean-Vlasov dynamics  on  is given by \n        \n            X̣_t    =  [  B X_t + B̅[X_t] +   α_t ]   ṭ +  γ Ẉ_t , \n               X_0 ∼μ_0,\n        \n        for some constants B,B̅∈, and a control α valued in A=, \n        \n        \n        \n         \n        \n        \n        \n        \n        while  the running and terminal costs are given by \n        \n            f(x,μ,a)    =  1/2( Q x^2 + Q̅ (x -  μ̅)^2 + N a^2 ), \n                      g(x)   =  min{  |x - ζ_1 |^2, | x - ζ_2 |^2 },\n         \n        for some non-negative constants Q, Q̅, N, and two real numbers ζ_1 and ζ_2.  \n        \n        \n        For this model, there is no explicit solution, and we even don't know the structural form of the optimal value function and optimal randomised policy.  In a RL setting, and as suggested in Remark <ref>, we shall use critic functions in the cylindrical  form\n        ^η(t,x,μ)    =   Ψ_η(t,x,<φ_η,μ>),    (t,x,μ) ∈ [0,T]××_2(), \n        \n        with feedforward neural networks functions Ψ_η(t,x,y) from  [0,T]××^k into , and φ_η(x) from   into ^k, \n        and actor functions as \n        π_θ(.|t,x,μ)    =   (   _θ(t,x,μ) ; λ),  \n          log p_θ(t,x,μ,a)     =     - 1/2log(2πλ) - \n        |a - _θ(t,x,μ) |^2/2λ,\n        \n        with cylindrical neural network functions _θ from [0,T]××_2() into . In this case, we have \n        ∇_θ b_θ(t,x,μ)   =  ∇_θ_θ(t,x,μ),        ∇_θΣ_θ(t,x,μ)   =   0, \n        ∂_μ^η(t,x,μ)(.)    =     D_y Ψ_η(t,x,<φ_η,μ>) · D_x φ_η(.),        \n        and so \n        _θ[^η](t,x,μ)    =   _ξ∼μ[ ∇_θ_θ(t,ξ,μ)   D_y Ψ_η(t,x,<φ_η,μ>) · D_x φ_η(ξ) ]. \n        Implement such _θ[^η](t,x,μ) in the algorithm,  and simulate X with the following parameters as in our previous DeepSet paper:\n         \n         B = B̅ = 0,    Q = 0,  Q̅ = N = 1,    T = 0.5,\n         X_0∼(x_0,ϑ_0^2) with \n         \n          * γ=0.3, x_0=1, ϑ_0=0.2\n          * γ=0.3, x_0=0.625, ϑ_0=√(0.2)\n          * γ=0.5, x_0=0.625, ϑ_0=√(0.2)Faire les même graphes que pour les deux précédents exemples\n        \n        § SOME EXTENSIONS AND VARIATIONS\n        \n        \n         §.§ Infinite horizon\n        \n        \n        \n        Given a (stationary) randomised policy  π(.|x,μ) with density a∈A↦p(x,μ,a) on A, the performance value function to the MFC on infinite horizon with entropy regularisation  is formulated as \n        \n        J(x,μ;π)    =   _α∼π[ ∫_0^∞ e^-β t(  f(X_t^x,ξ,_X_t^ξ,α_t) - λ p(X_t^x,ξ,_X_t^ξ,α_t) )  ṭ], \n        \n        where β>0 is a discount factor. \n        \n        We are then  given a family of randomised policies (x,μ)↦π_θ(ạ|x,μ)=p_θ(x,μ)ν(ạ), with parameter θ,  a family of  functions (x,μ)↦^η(x,μ) on ^d×_2(^d), with parameter η, aiming to approximate the optimal performance value function. \n        The AC algorithm is then updating alternatively the two parameters to find the optimal pair (θ^*,η^*):  on the one hand,  for fixed policy π_θ,  we rely  on the martingale formulation of the process\n        { e^-β t^η(X_t^x_0,ξ,_X_t^ξ) + ∫_0^t e^-β r[  f(X_r^x_0,ξ,_X_r^ξ,α_r)  - λlog p_θ(X_r^x_0,ξ,_X_r^ξ,α_r)  ] ṛ,   t ≥ 0 }, \n        \n        and on the other hand, for fixed ^η,  on the martingale formulation of the process\n        \n            {∫_0^t  e^-β r∇_θlog p_θ(X_r^x_0,ξ,_X_r^ξ,α_r) [ ^η(X_r^x_0,ξ,_X_r^ξ) - β^η(X_r^x_0,ξ,_X_r^ξ)  \n                 +  (  f(X_r^x_0,ξ,_X_r^ξ,α_r) -λ - λlog p_θ(X_r^x_0,ξ,_X_r^ξ,α_r)  ) ṛ],   0 ≤ t ≤ T},\n         \n        for the parameter θ which vanishes the gradient of the performance value function. \n        \n        \n        \n        \n        \n        This suggests the following pseudo-code for online AC: \n        \n        \n        [H] \n        \n         Input data: Mesh time size Δ t, number of time steps n, Number of episodes N, learning rate ρ_S^i, ρ_E^i, ρ_G^i for the state distribution, PE and PG estimation, and function of the number of episodes i. \n        Parameter λ for entropy regularisation. \n        Functional forms ^η of performance value function,  p_θ of density policies. \n        \n         Initialisation: μ_t_k: state distribution on ^d, for k=0,…,n,  parameters η, θ. \n        \n        each episode i=1,…,NInitialise state X_0∼μ_0\n        k=0,…,n-1Update state distribution: μ_t_k←(1-ρ_S^i) μ_t_k + ρ_S^i δ_X_t_k\n        \n        Generate action α_t_k∼π_θ(.|X_t_k,μ_t_k)\n        \n        Observe (e.g. by environment simulator) state X_t_k+1 and reward f_t_k\n         \n        Compute\n        δ_η   =   ^η(X_t_k+1,μ_t_k+1)  - ^η(X_t_k,μ_t_k) - β^η(X_t_k,μ_t_k)  Δ t  \n                   +    f_t_kΔ t  - λlog p_θ(X_t_k,μ_t_k,α_t_k) Δ t  \n        Δ_η   =   δ_η∇_η^η(X_t_k,μ_t_k) \n        Δ_θ   =     e^-β t_k∇_θlog p_θ(X_t_k,μ_t_k,α_t_k) [ δ_η - λΔ t ],  \n        \n         \n        Critic Update: η←η + ρ_E^i Δ _η\n        \n        Actor Update: θ←θ + ρ_G^i Δ_θ\n        k←k+1 Return: ^η, π_θOnline actor-critic mean-field algorithm (infinite horizon)  \n        \n        \n          \n        Linear Quadratic case. In the LQ case on infinite horizon,  the optimal value function take the form \n        \n            v(x,μ)    =   (x - μ̅) K (x-μ̅) + μ̅Λμ̅+ 2 Y.x + R,\n         \n        for some constants  K in ^d, Λ in ^d, Y in ^d, and R in , solution to a system of algebraic Riccati equations, namely\n        \n        -β K  + KB + B K + D K D + Q        \n        \n        -   (I+ F KD + C K)(N + F K F)^-1(I+ F KD + C K)    =     0,    \n        \n        - βΛ + Λ(B+B̅) + (B+B̅)Λ + (D+D̅)Λ (D+D̅) + Q + Q̅      \n        \n        -    (I+ I̅+ F K(D+D̅) + CΛ)(N + F K F)^-1 (I + I̅ + F K(D+D̅) + CΛ)    =    0,   \n        \n        - β   Y + (B + B̅) Y + (D+D̅) K γ + M       \n        \n         -    ( I+ I̅+  F K(D+D̅) + CΛ)(N + F KF)^-1(H + F Kγ + C Y)     =    0,   \n        \n         - β   R + γ K γ  - (H + F Kγ + C Y)(N + F KF)^-1(H + F Kγ + C Y)       \n        \n         -   λ m/2log(2π)-λ/2log|λ/2det(N+F K F)|   =    0,    \n        \n        while  the optimal randomised policy  is a gaussian distribution given by \n        π̂(.| t,x,μ)    =    (  - S^-1(U  x + (V -U) μ̅+ O )  ;  λ/2 S^-1),\n        \n        where \n        \n        S  =    N+F K  F,           O   =     H+ F K γ +C Y,    \n        \n        U   =     I+F KD +C K ,           V   =    I+I̅+F K(D+D̅) +CΛ.\n        \n        \n        \n        It is then natural to use a parametrisation of the performance value function as \n        ^η(x,μ)    =    (x - μ̅)η_1 (x-μ̅) + μ̅η_2μ̅+  η_3.x + η_4, \n        \n        with parameter  η=(η_1,η_2,η_3,η_4)∈^d×^d×^d×, and a parametrisation of the randomised policies as\n        π^θ(.|x,μ)    =   (  θ_1x +  θ_2μ̅+ θ_3; θ_4 ),\n        \n        with parameter θ=(θ_1,θ_2,θ_3,θ_4)∈^m× d×^m× d×^m×_+^m. \n        \n        \n        \n        \n         §.§ Common noise\n        \n        \n        \n        The controlled dynamics is driven by \n        \n            X̣_s    =    b(X_s,^0_X_s,α_s) ṣ  + σ(X_s,^0_X_s,α_s) Ẉ_s + σ_0(X_s,^0_X_s,α_s) Ẉ^0_s ,\n         \n        where there is an additional q-dimensional Brownian motion W^0 called common noise, σ_0 is a measurable function from ^d×_2(^d)× A into ^d× q, and _X_t^0 denotes the conditional law of X_t given  W^0. \n        Given a parametric randomised policy π_θ(.|t,x,μ)  with density a∈A↦p_θ(t,x,μ,a) on A, the associated performance value function to the MFC with common noise  on finite horizon with entropy regularisation  is formulated as \n        \n        J_θ(t,x,μ)    =   _α∼π_θ[ ∫_t^T  e^-β(s-t)(  f(X_s^t,x,ξ,^0_X_s^t,ξ,α_s) - λ p_θ(s,X_s^t,x,ξ,^0_X_s^t,ξ,α_s) )  ṣ\n                +   e^-β(T-t)  g(X_T^t,x,ξ,^0_X_T^t,ξ)  ].  \n        \n        \n        \n        By means of Itô's formula for conditional flow of probability measures, we show that the function J_θ is solution  to the PDE on [0,T]×^d×_2(^d)\n            ∫_A { - β J_θ(t,x,μ) +   ^a[J_θ](t,x,μ) + f(x,μ,a) -λlog p_θ(t,x,μ,a) }π_θ(ạ|t,x,μ)   =    0,\n         \n         with terminal condition: J_θ(T,x,μ)=g(x,μ),  and where  ^a is the operator defined  by\n        ^a [φ](t,x,μ)    =   φ(t,x,μ) +  b(x,μ,a).D_xφ(t,x,μ) +  1/2 tr((σσ+σ_0σ_0)(x,μ,a) D_x^2 φ(t,x,μ)) \n                +   _ξ∼μ[   b(ξ,μ,a).∂_μφ(t,x,μ)(ξ) + 1/2 tr((σσ+σ_0σ_0)(ξ,μ,a) ∂_x∂_μφ(t,x,μ)(ξ))   ] \n               +  _(ξ,ξ')∼μ⊗μ[  1/2 tr( σ_0(ξ,μ,a)σ_0(ξ',μ,a) ∂^2_μφ(t,x,μ)(ξ,ξ'))   ].  \n        \n        \n        \n        \n        By following similar arguments as in paragraph <ref>, we obtain the gradient representation of the performance value function:\n        \n            ∇_θ J_θ(t,x,μ)     =  _α∼π_θ[ ∫_t^T e^-β(s-t)∇_θlog p_θ(s,X_s^t,x,ξ,^0_X_s^t,ξ,α_s) {J̣_θ(s,X_s^t,x,ξ,^0_X_s^t,ξ) \n                - β  J_θ(s,X_s^t,x,ξ,^0_X_s^t,ξ)  +  [  f(X_s^t,x,ξ,^0_X_s^t,ξ,α_s) -λ(1+ log p_θ(s,X_s^t,x,ξ,^0_X_s^t,ξ,α_s) ) ] ṣ}.\n         \n        Therefore, the AC algorithms in the common noise case have the same pseudo-codes as in the no common noise case (up to the discount factor β that we have added here).  \n        \n        \n         \n        \n        § LINEAR QUADRATIC MEAN-FIELD CONTROL WITH ENTROPY REGULARISATION\n        \n        \n        \n        We extend these results to the case of randomised controls, α_t∼π_t(ạ)=p_t(a) ạ, with -adapted (A)-valued process (π_t) with densities p_t, and with entropy regularisation.\n        \n            J(π)=_α∼π[∫_0^T (f(X_t,ℙ_X_t,α_t)+λlog(p_t(α_t)))dt+g(X_T,ℙ_X_T)]\n         \n        where the dynamics of the controlled process is given by\n        \n            dX^π_t=b(X^π_t,ℙ_X^π_t,α_t)dt+σ(X^π_t,ℙ_X^π_t,α_t)dW_t\n         with α_t∼π_t(da)=p_t(a)da and b,σ,f,g defined above.\n        \n        In order to simplify the notations, we denote X_t=X^π_t and X̅_t=𝔼[X^π_t]\n        \n        We minimize over the randomised controls:\n        \n            sup_πJ(π)\n        \n        To specify it,\n        \n            J(π)=_α∼π[∫_0^T (X_t Q X_t+X̅_tQ̅X̅_t+α_t Nα_t+2α_t I X_t+2α_tI̅X̅_t+2M X_t+2Hα_t+λlog(p(α_t)))dt\n        \n            +X_T P X_T+X̅_TP̅X̅_T+2L X_T]\n         \n        where\n        \n            dX_t=(BX_t+B̅X̅_t+Cα_t)dt+(γ+DX_t+D̅X̅_t+Fα_t)dW_t\n        \n        Let {𝒱^π_t,t∈[0,T],π∈𝒫(^m)} be a family of 𝔽-adapted processes in the form 𝒱^π_t=v(t,X^π_t,ℙ_X^π_t) for some 𝔽-adapted random field {v(t,x,μ),t∈[0,T],x∈ℝ^d,μ∈𝒫_2(ℝ^d)} satisfying\n        \n            v(t,x,μ)≤ C(χ_t+| x|^2+|μ̅|^2),t∈[0,T],x∈ℝ^d,μ∈𝒫_2(ℝ^d)\n        \n        for some positive constant C and nonnegative process χ with sup_t∈[0,T][|χ_t|]<+∞ and such that\n        \n          (i)v(T,x,μ)=g(x,μ),x∈ℝ^d,μ∈𝒫_2(ℝ^d)\n          (ii)the map t∈[0,T]↦_α∼π[𝒮^π_t], with 𝒮^π_t=𝒱^π_t+∫_0^t (X_s Q X_s+X̅_sQ̅X̅_s+α_s N α_s  + 2α_s I X_s + 2α_sI̅X̅_s +  2M X_s + 2Hα_s+λlog(p_s(α_s)))ds is nondecreasing for all π∈𝒫(^m) with π_t(da)=p_t(a)da\n          (iii)the map t∈[0,T]↦_α∼π[𝒮^π_t] is constant for some π^*∈𝒫(^m) with π^*_t(da)=p^*_t(a)da\n        Then, π^* is an optimal randomised control and _α∼π^*[v(0,X_0,ℙ_X_0)] is the value of the randomised LQMKV control problem:\n        \n            V_0=_α∼π^*[v(0,X_0,ℙ_X_0)]=J(π^*)\n        Step 1 We infer a candidate for the random field {v(t,x,μ),t∈[0,T],x∈ℝ^d,μ∈𝒫_2(ℝ^d)} in the form \n        \n            v(t,x,μ)=(x-μ̅) K(t)(x-μ̅)+μ̅Λ(t)μ̅+2Y(t) x+R(t)\n        Step 2 For π∈𝒫(^m) and t∈[0,T], with 𝒮^π_t defined above, we have\n        \n            d_α∼π[𝒮^π_t]=_α∼π[𝒟^π_t]dt\n         for some 𝔽-adapted processes 𝒟^π with \n        \n            _α∼π[𝒟^π_t]=_α∼π[ X_t Q X_t+X̅_tQ̅X̅_t+α_t N α_t + 2α_t I X_t + 2α_tI̅X̅_t +  2M X_t + 2Hα_t+λlog(p_t(α_t))]\n        \n            +d/dt𝔼_α∼π[v(t,X_t,ℙ_X_t)]\n        Step 3  To find an optimal control π^* such that _α∼π^*[𝒟^π^*_t]=0 and this implies that [𝒟^π_t]≥ 0, ∀π∈𝒫(𝒜) and then the property (ii).\n        \n        In fact, defining \n            w(t,x,x̅)=(x-x̅) K(t)(x-x̅)+x̅Λ(t)x̅+2Y(t) x+R(t)\n         we have\n        \n            v(t,X_t,ℙ_X_t)=w(t,X_t,X̅_t)=(X_t-X̅_t) K(t)(X_t-X̅_t)+X̅_tΛ(t)X̅_t+2Y(t) X_t+R(t)\n        \n        Using the Itô's formula, we have\n        \n            dv(t,X_t,ℙ_X_t)=[(X_t-X̅_t)K̇(t)(X_t-X̅_t)+X̅_tΛ̇(t)X̅_t+2Ẏ(t) X_t+Ṙ(t)]dt+\n        \n            ((X_t-X̅_t) K(t)+Y(t))dX_t+(dX_t)(K(t)(X_t-X̅_t) K(t)+Y(t))\n        \n            +(-(X_t-X̅_t) K(t)+X̅_tΛ(t))dX̅_t+(dX̅_t) (-K(t)(X_t-X̅_t)+Λ(t)X̅_t)+Tr(K(t)d⟨ X,X⟩_t)\n        \n            =[(X_t-X̅_t)K̇(t)(X_t-X̅_t)+X̅_tΛ̇(t)X̅_t+2Ẏ(t) X_t+Ṙ(t)]dt+\n        \n            ((X_t-X̅_t) K(t)+Y(t))dX_t+(dX_t)(K(t)(X_t-X̅_t) K(t)+Y(t))\n        \n            +(-(X_t-X̅_t) K(t)+X̅_tΛ(t))dX̅_t+(dX̅_t) (-K(t)(X_t-X̅_t)+Λ(t)X̅_t)\n        \n            +(γ+DX_t+D̅X̅_t+Fα_t) K(t)(γ+DX_t+D̅X̅_t+Fα_t)dt\n        \n        Since\n        \n            dX_t=(BX_t+B̅X̅_t+Cα_t)dt+(γ+DX_t+D̅X̅_t+Fα_t)dW_t\n        \n        and denoting α̅_t=𝔼[α_t]\n        we get\n        \n            dX̅_t=((B+B̅)X̅_t+Cα̅_t)dt\n        \n        Noticing that \n            𝔼_α∼π[(-(X_t-X̅_t) K(t)+X̅_tΛ(t))dX̅_t]=_α∼π[X̅_tΛ(t)((B+B̅)X̅_t+Cα̅_t)]dt\n        \n            =_α∼π[X̅_tΛ(t)((B+B̅)X̅_t+Cα_t)]dt\n        \n        Hence\n        \n            d/dt_α∼π[v(t,X_t,ℙ_X_t)]=_α∼π[(X_t-X̅_t)K̇(t)(X_t-X̅_t)+X̅_tΛ̇(t)X̅_t+2Ẏ(t) X_t+Ṙ(t)\n        \n            +((X_t-X̅_t) K(t)+Y(t))(BX_t+B̅X̅_t+Cα_t)+(BX_t+B̅X̅_t+Cα_t)(K(t)(X_t-X̅_t)+Y(t))\n        \n            +X̅_tΛ(t)((B+B̅)X̅_t+Cα_t)+((B+B̅)X̅_t+Cα_t)Λ(t)X̅_t\n        \n            +(γ+DX_t+D̅X̅_t+Fα_t) K(t)(γ+DX_t+D̅X̅_t+Fα_t)]\n        \n        Hence\n        \n            𝔼_α∼π[𝒟^π_t]=_α∼π[(X_t-X̅_t)(Q+K̇(t)+K(t)B+BK(t)+D K(t) D)(X_t-X̅_t)\n        \n            +X̅_t(Q+Q̅+Λ̇(t)+Λ(t)(B+B̅)+(B+B̅)Λ(t)+(D+D̅) K(t)(D+D̅))X̅_t\n        \n            +2(M+Ẏ(t)+(B+B̅) Y(t)+(D+D̅) K(t)γ) X_t+Ṙ(t)+γ K(t)γ\n        \n            +α_t (N+F K(t) F) α_t+2α_t(I+C K(t)+F K(t)D)X_t+2α_t(I̅-C K(t)+CΛ(t)+F K(t)D̅)X̅_t\n        \n            +2( H+C Y(t)+F K(t)γ)α_t+λlog(p_t(α_t))]\n        \n            =[(X_t-X̅_t)(Q+K̇(t)+2K(t)B+D K(t) D)(X_t-X̅_t)\n        \n            +X̅_t(Q+Q̅+Λ̇(t)+2Λ(t)(B+B̅)+(D+D̅) K(t)(D+D̅))X̅_t\n        \n            +2(M+Ẏ(t)+(B+B̅) Y(t)+(D+D̅) K(t)γ) X_t+Ṙ(t)+γ K(t)γ\n        \n            +∫_^m(a (N+F K(t) F) a+2a(I+C K(t)+F K(t)D)X_t+2a(I̅-C K(t)+CΛ(t)+F K(t)D̅)X̅_t\n        \n            +2( H+C Y(t)+F K(t)γ) a+λlog(p_t(a)))p_t(a)da]\n        \n        Denoting\n        \n            S_t=N+F K(t) F\n        \n            U_t=I+C K(t)+F K(t)D\n        \n            V_t=I+I̅+CΛ(t)+F K(t)(D+D̅)\n        \n            O_t=H+C Y(t)+F K(t)γ\n        \n        the optimal control π^*_t(da)=p_t^*(a)da minimizes \n            ∫_^m(a S_t a+2aU_tX_t+2a(V_t-U_t)X̅_t+2O_t a+λlog(p_t(a)))p_t(a)da\n        λ>0 For the minimization problem \n        \n            inf_p>0,∫_^mp(a)da=1∫_^m(f(a)+λlog(p(a)))p(a)da\n         the solution is \n        \n            p^*(a)=exp(-1/λf(a))/∫_^mexp(-1/λf(a))da\n        Proof\n        In order to solve the optimization problem with constraints, we consider the Lagrange method with a multiplier β, that is\n        \n            inf_p>0,β∫_^m(f(a)+λlog(p(a)))p(a)da-β(∫_^mp(a)da-1)=inf_p>0,β∫_^m(f(a)+λlog(p(a))-β)p(a)da+β\n        \n        For inf_p>0∫_^m(f(a)+λlog(p(a))-β)p(a)da we minimize it point-wisely.\n         Considering \n            F(p;β)=(f(a)+λlog p-β)p\n        \n            ∂/∂ pF(p;β)=f(a)+λlog p^*-β+λ\n        \n        and \n            ∂^2/∂^2 pF(p;β)=λ/p>0\n        \n        Hence the solution (p^*,β^*) must satisfy for all a∈^m,\n        \n            ∂/∂ pF(p^*(a);β^*)=f(a)+λlog p^*(a)-β^*+λ=0\n            ∫_^mp^*(a)da=1\n        \n        Finally we obtain \n        \n            p^*(a)=exp(-1/λf(a))/∫_^mexp(-1/λf(a))da\n        \n        \n        According to this lemma, the optimal control is given by\n        \n            p_t^*(a)=exp(-1/λ(a S_t a+2a U_tX_t+2a(V_t-U_t)X̅_t+2O_t a))/∫_^mexp(-1/λ(a S_t a+2a U_tX_t+2a(V_t-U_t)X̅_t+2O_t a))da\n        \n        it is the gaussian distrubution with\n        \n            π_t^*=𝒩(·|-S_t^-1(U_tX_t+(V_t-U_t)X̅_t+O_t),λ/2S_t^-1)\n        \n        Hence\n        \n            ∫_^m(a S_t a+2a U_tX_t+2a(V_t-U_t)X̅_t+2O_t a+λlog(p_t^*(a)))p_t^*(a)da\n        \n            =-(U_tX_t+(V_t-U_t)X̅_t+O_t) S_t^-1(U_tX_t+(V_t-U_t)X̅_t+O_t)-λ m/2log(2π)-λ/2log|λ/2det(S_t)|\n        \n        and\n        \n            𝔼[∫_^m(a S_t a+2a U_tX_t+2a(V_t-U_t)X̅_t+2O_t a+λlog(p_t^*(a)))p_t^*(a)da]\n        \n            =-𝔼[(X_t-X̅_t) U_t S_t^-1U_t(X_t-X̅_t)+X̅_t V_t S_t^-1 V_tX̅_t+2O_t S_t^-1V_t X_t+O_t S_t^-1O_t]-λ m/2log(2π)-λ/2log|λ/2det(S_t)|\n        \n        then {K(t)},{Λ(t)},{Y(t)},{R(t)} satisfy the following equations:\n        \n            K̇(t)+Q+K(t)B+B K(t)+D K(t) D\n               -(I+C K(t)+F K(t) D) (N+F K(t) F)^-1(I+C K(t)+F K(t) D)=0\n               K(T)=P\n               Λ̇(t)+Q+Q̅+Λ(t)(B+B̅)+(B+B̅)Λ(t)+(D+D̅) K(t)(D+D̅)\n               -(I+I̅+CΛ(t)+F K(t)(D+D̅)(N+F K(t) F)^-1(I+I̅+CΛ(t)+F K(t)(D+D̅)=0\n               Λ(T)=P+P̅\n               Ẏ(t)+M+(B+B̅) Y(t)+(D+D̅) K(t)γ\n               -(H+C Y(t)+F K(t)γ)(N+F K(t) F)^-1(I+I̅+CΛ(t)+F K(t)(D+D̅)=0\n               Y(T)=L\n               Ṙ(t)+γ K(t)γ-(H+C Y(t)+F K(t)γ)(N+F K(t) F)^-1(H+C Y(t)+F K(t)γ)\n               -λ m/2log(2π)-λ/2log|λ/2det(N+F K(t) F)|=0\n               R(T)=0\n         \n        \n        § PROOFS OF SOME REPRESENTATION RESULTS\n        \n        \n         §.§ Proof of Proposition <ref>\n        Step 1: For a fixed policy π, we introduce the non-linear McKean-Vlasov SDE with dynamics\n        \n            X̃^t, ξ_s = ξ + ∫_t^s  b_π(r,X̃^t, ξ_r,_X̃^t, ξ_r)  ṛ + ∫_t^s σ_π(r,X̃^t, ξ_r,_X̃^t, ξ_r) Ẉ_r,\n         recalling that σ_π=Σ_π^1/2, as well as its associated decoupled SDE with dynamics\n        \n            X̃^t, x, μ_s = x + ∫_t^s  b_π(r,X̃^t, x, μ_r,_X̃^t, ξ_r)  ṛ + ∫_t^s σ_π(r,X̃^t, x, μ_r,_X̃^t, ξ_r) Ẉ_r.\n        \n        Under Assumption <ref>(i), the coefficients b_π and σ_π are Lipschitz-continuous and with at most linear growth with respect to the variable x and μ locally uniformly in time. Hence, the SDEs (<ref>)-(<ref>) admit a unique strong solution.\n        \n        Denoting by  the probability measure on 𝒞([0, ∞), ^d) (the space of continuous functions defined on [0,∞) taking values in ^d) induced by the unique solution to the SDE (<ref>) and by (t) its marginal at time t, its infinitesimal generator is given by\n        \n            ℒ̃^π_tφ(x)     = ∑_i=1^d ∫_A b_i( x, (t), a)  π(ạ| t, x, (t)) ∂_x_iφ(x) \n                  +  1/2∑_i,j=1^d ∫_A (σσ)_i, j(x, (t), a)   π(ạ| t, x, (t)) ∂^2_x_i, x_jφ(x).\n        \n        Now, coming back to the dynamics of the McKean-Vlasov SDE (<ref>), we importantly point out that since at each time s, the action α_s is sampled from the probability distribution π(.|s, X^t, ξ_s, _X_s^t, ξ) independently of W, the infinitesimal generator at time t of (<ref>) is exactly given by ℒ̃^π_t. Hence, it follows from the uniqueness of the martingale problem associated to ℒ̃^π that X^t, ξ and X̃^t, ξ have the same law [This was formally shown by law of large numbers in <cit.> in the standard diffusion case.].\n        \n        We thus conclude that V^π can be written as \n        \n            V^π(t, x,μ)    =  _[ ∫_t^T e^-β (s-t)  (f_π-λ E_π)(s,X̃_s^t,x,μ,_X̃_s^t,ξ)   ṣ\n            +    e^-β (T-t) g(X̃_T^t, x, μ,_X̃_T^t,ξ) ].\n        \n        Step 2: We know, see e.g. <cit.> or <cit.>, that Assumption <ref>(i) guarantees the existence of  a modification of X̃^t, x, μ such that:\n         \n          *  The map x↦X̃_s^t, x, ξ is ℙ-a.s. twice continuously differentiable, \n         \n          *   for any x∈ℝ^d,  0≤ t≤ s, and any p≥1, the map  𝒫_2(ℝ^d) ∋μ↦X̃_s^t, x, μ∈ L^p(ℙ) is differentiable and the map ℝ^d ∋ v ↦∂_μX̃_s^t, x, μ(v) ∈ L^p(ℙ) is differentiable,\n         \n          *  for any p≥1, the derivatives (t, x, μ, v) ↦∂_x X̃_s^t, x, μ, ∂_x^2 X̃_s^t, x, μ, ∂_μX̃_s^t, x, μ(v), ∂_v [∂_μX̃_s^t, x, μ](v) ∈ L^p(ℙ) are continuous.\n         \n        Moreover, the following estimates hold for n=1,2 and any p≥1\n            sup_0≤ t ≤ s ≤ T, (x,v) ∈ (ℝ^d)^2, μ∈_2(ℝ^d){∂_x^n X̃_s^t, x, μ_L^p(ℙ) + ∂_μX̃_s^t, x, μ(v) _L^p(ℙ) +  ∂_v ∂_μX̃_s^t, x, μ(v) _L^p(ℙ)} < ∞.\n        \n        \n        We thus deduce that the functions x↦ f_π(s,X̃_s^t,x,μ,_X̃_s^t,ξ),    E_π(s,X̃_s^t, x,μ,_X̃_s^t,ξ),   g(X̃_T^t, x, μ,_X̃_T^t,ξ) are ℙ-a.s. twice continuously differentiable with derivatives that belong to L^p(ℙ), for any p≥1, uniformly in x, μ and t∈ [0,s]. The dominated convergence theorem eventually guarantees that x↦ V^π (t, x, μ) is twice continuously differentiable with\n        \n            ∂_x_i V^π(t, x, μ)    =  _[ ∫_t^T e^-β (s-t)∑_k=1^d  ∂_x_k (f_π-λ E_π)(s,X̃_s^t, x,μ,_X̃_s^t,ξ)   ∂_x_i (X̃_s^t, x, μ)^k  ṣ\n                +    e^-β (T-t)∑_k=1^d ∂_x_k g(X̃_T^t, x, μ,_X̃_T^t,ξ)  ∂_x_i (X̃_T^t, x, μ)^k ],\n         and\n        \n            ∂^2_x_i, x_j V^π(t, x, μ)    =  _[ ∫_t^T e^-β (s-t)∑_k, ℓ=1^d ∂^2_x_k, x_ℓ (f_π-λ E_π)(s,X̃_s^t, x,μ,_X̃_s^t,ξ)   ∂_x_i (X̃_s^t, x, μ)^k  ∂_x_j (X̃_s^t, x, μ)^ℓṣ\n                 +    e^-β (T-t)∑_k, ℓ=1^d ∂^2_x_k, x_ℓ g(X̃_T^t, x, μ,_X̃_T^t,ξ)  ∂_x_i (X̃_T^t, x, μ)^k  ∂_x_j (X̃_T^t, x, μ)^ℓ\n                + ∫_t^T e^-β (s-t)∑_k=1^d  ∂_x_k (f_π-λ E_π)(s,X̃_s^t, x,μ,_X̃_s^t,ξ)   ∂^2_x_i, x_j (X̃_s^t, x, μ)^k   ṣ\n                  +    e^-β (T-t)∑_k=1^d ∂_x_k g(X̃_T^t, x, μ,_X̃_T^t,ξ)  ∂^2_x_i, x_j (X̃_T^t, x, μ)^k  ].\n        \n        It follows from the above expression and again the dominated convergence theorem that (t, x, μ) ↦∂_x_i V^π(t, x, μ), ∂^2_x_i, x_j V^π(t, x, μ) are continuous.\n        \n        Similarly, note that under the current assumption, the functions μ↦ h(t,X̃_s^t, x, μ,_X̃_s^t,ξ), g(X̃_T^t, x, μ,_X̃_T^t,ξ), where h ∈{   f_π, E_π}, are L-differentiable with derivatives satisfying\n        \n            ∂^i_μ [h(s,X̃_s^t, x,μ,_X̃_s^t,ξ)](v)     = ∑_k=1^d ∂_x_k h(s,X̃_s^t, x,μ,_X̃_s^t,ξ) ∂^i_μ [(X̃_s^t, x,μ)^k](v) \n                  +𝔼[ ∑_k=1^d ∂^k_μ h(s, X̃_s^t, x,μ, _X̃_s^t,ξ)(X_s^t, v, μ) ∂_x_i (X_s^t, v, μ)^k]  \n                  + ∫_ℝ^d𝔼[∑_k=1^d ∂^k_μ h(s,X̃_s^t, x,μ, _X̃_s^t,ξ)(X_s^t, x', μ) ∂^i_μ [(X_s^t, x', μ)^k](v) ]  μ(x̣'), \n            ∂^i_μ [g(X̃_T^t, x, μ,_X̃_T^t,ξ)](v)     =  ∑_k=1^d ∂_x_k g(X̃_T^t, x,μ,_X̃_T^t,ξ) ∂^i_μ [(X̃_T^t, x,μ)^k](v)\n                  + 𝔼[ ∑_k=1^d ∂^k_μ g(X̃_T^t, x,μ, _X̃_T^t,ξ)(X_T^t, v, μ) ∂_x_i (X_T^t, v, μ)^k ]  \n                  + ∫_ℝ^d𝔼[∑_k=1^d ∂^k_μ g(X̃_T^t, x,μ, _X̃_T^t,ξ)(X_T^t, x', μ) ∂^i_μ [(X_T^t, x', μ)^k] (v) ]  μ(x̣'),\n         where (X_s^t, x, μ)_s∈ [t, T] stands for a copy of (X̃^t, x, μ_s)_s ∈ [t, T] defined on a copy (Ω, ℱ, ℙ) of the original probability space (Ω, ℱ, ℙ). Under Assumption <ref>, it follows from the above identities that (t, x, μ, v) ↦∂_μ [h(s,X̃_s^t, x,μ,_X̃_s^t,ξ)](v) ,  ∂_μ [g(X̃_T^t, x, μ,_X̃_T^t,ξ)](v) ∈ L^p(ℙ), p≥1, are continuous and satisfy\n        \n            |∂_μ [h(s,X̃_s^t, x, μ, _X̃_s^t,ξ)](v) |   ≤ K (1+ |X̃_s^t, x, μ| + |v| + M_2( _X̃_s^t,ξ)^q) (1+ |∂_μX̃^t, x, μ_s(v)| ) \n               ≤ K (1+ |X̃_s^t, x,μ| + |v| + M_2(μ)^q) (1+ |∂_μX̃^t, x, μ_s(v)| ),\n         and\n        \n            | ∂_μ [g(X̃_T^t, x, μ,_X̃_T^t,ξ)](v) |    ≤ K (1 + |X̃_T^t, x,μ| + |v| + M_2( _X̃_T^t,ξ)^q) (1+ |∂_μX̃^t, x, μ_T(v)| )\n               ≤ K (1+ |X̃_T^t, x,μ| + |v| + M_2(μ)^q) (1+ |∂_μX̃^t, x, μ_T(v)| ),\n         where we used the fact that M_2( _X̃_s^t,ξ) ≤ K(1+M_2(μ)), for any s∈ [t, T], for the last inequality. Similarly, it follows from (<ref>) and the dominated convergence theorem that v↦∂_μ [h(t,X̃_s^t, x, μ,_X̃_s^t,ξ)](v), ∂_μ [g(X̃_T^t, x, μ,_X̃_T^t,ξ)](v) are continuously differentiable with derivatives being continuous with respect to their entries and satisfying\n        \n            | ∂_v ∂_μ [h(s,X̃_s^t, x,μ, _X̃_s^t,ξ)](v) |   ≤  K (1+ |X̃_s^t, x, μ| + |v| + M_2(μ)^q),\n            \n            | ∂_v ∂_μ [g(X̃_T^t, x, μ,_X̃_T^t,ξ)](v) |    ≤ K (1+ |X̃_T^t, x, μ| + |v| + M_2(μ)^q).\n        \n        \n        Coming back to (<ref>) and using the above estimates together with the dominated convergence theorem allows to conclude that μ↦ V^π(t, x, μ) is L-differentiable and that v↦∂_μ V^π(t, x, μ)(v) is differentiable. Moreover, both derivatives ∂_μ V^π(t, x, μ)(v), ∂_v ∂_μ V^π(t, x, μ)(v) are continuous with respect to their entries and satisfy\n        \n            sup_t ∈ [0,T]{ | ∂_μ V^π(t, x, μ)(v)| + |∂_v ∂_μ V^π(t, x, μ)(v)| }≤ K (1+ |x| +|v| + M_2(μ)^q).\n        \n        We thus conclude that V^π∈𝒞^0, 2, 2([0,T] ×ℝ^d ×_2(ℝ^d)).\n        \n        Step 3:  Let us now prove that (t, x, μ) ↦ V^π(t, x, μ) ∈𝒞^1, 2, 2([0,T] ×ℝ^d ×_2(ℝ^d)). From the Markov property satisfied by the SDE (<ref>), stemming from its strong well-posedness, for any 0≤ h ≤ t, the following relation is satisfied\n        \n            V^π(t-h, x, μ)     =  e^-β h𝔼[ ∫_t-h^t e^-β (s-t)   (f_π-λ E_π)(s,X̃_s^t-h, x, μ,_X̃_s^t-h, ξ)   ṣ] \n                  + e^-β h𝔼[ V^π(t, X̃_t^t-h, x, μ, ℙ_X̃_t^t-h, ξ)].\n        \n        Now, combining the fact that V^π(t, .) ∈𝒞^2, 2(ℝ^d ×_2(ℝ^d)) with (<ref>) guarantees that one may apply Itô's rule, see e.g. Proposition 5.102 <cit.>. We thus obtain\n        \n            h^-1 (V^π(t-h, x, μ)      -V^π(t, x, μ)) \n                =  e^-β h h^-1∫_t-h^t e^-β (s-t)𝔼[ (f_π-λ E_π)(s,X̃_s^t-h, x,μ,_X̃_s^t-h, ξ)  ] ṣ\n                  + e^-β h h^-1𝔼[ V^π(t, X̃_t^t-h, x, μ, ℙ_X̃_t^t-h, ξ) - V^π(t, x, μ)]\n                  + h^-1 (e^-β h - 1) V^π(t, x, μ)\n                = e^-β h h^-1∫_t-h^t e^-β (s-t)𝔼[ (f_π-λ E_π)(s,X̃_s^t-h, x,μ,_X̃_s^t-h, ξ)    ] ṣ\n                  + e^-β h h^-1∫_t-h^t𝔼[[V^π](t, X̃_s^t-h, x, μ, ℙ_X̃_s^t-h, ξ)] ṣ\n                  + h^-1 (e^-β h - 1) V^π(t, x, μ),\n        \n        where\n         \n         _π[φ](t, x,μ) \n            =      b_π(t, x, μ) · D_xφ(t, x, μ) +  1/2Σ_π(t, x, μ) : D_x^2 φ(t, x, μ)  \n                +   _ξ∼μ[   b_π(t,ξ,μ) ·∂_μφ(t, x, μ)(ξ) + 1/2Σ_π(t, ξ, μ) : ∂_υ∂_μφ(t, x, μ)(ξ)    ].\n         \n        Letting h↓ 0 in (<ref>), from the continuity and quadratic growth of f_π, E_π as well as the continuity of [V^π](t,.), we deduce that t↦ V^π(t, x, μ) is left-differentiable on (0,T). Still from the continuity of  f_π, E_π and [V^π], we eventually conclude that it is differentiable on [0,T) with a derivative satisfying\n        \n            ∂_t V^π(t, x, μ) - β V^π(t, x, μ) +  _π[V^π](t, x,μ) +  (f_π-λ E_π)(t, x, μ) = 0.\n        \n        The proof is now complete.\n        \n        \n        \n        \n        \n        \n         §.§ Differentiability of the parametric critic function\n         \n        \n        \n        \n        \n        Under the standard assumption that the coefficients b_π_θ(t, .),  σ_π_θ(t, .) are Lipschitz-continuous on ℝ^d ×_2(ℝ^d) uniformly in t∈ [0,T] and θ∈Θ, the system of SDEs (<ref>) admits a unique strong solution when α∼π_θ. We will denote by (X_s^t, ξ(θ), X_s^t, x, ξ(θ)) the solution taken at time s. We will also use the more compact notation\n         \n            X_s^t,ξ(θ)    = ξ + ∫_t^s ∑_j=0^p g^j_θ(r, X_r^t, ξ(θ), _X_r^t, ξ(θ))  Ẉ^j_r    \n            \n            X_s^t, x,μ(θ)    = x + ∫_t^s ∑_j=0^p g^j_θ(r, X_r^t, x, μ(θ), _X_r^t, ξ(θ))  Ẉ^j_r,    t ≤ s ≤ T,\n         with g^0_θ(t, x, μ) = b_π_θ(t, x, μ), g^j_θ(t, x, μ) = σ^., j_π_θ(t, x, μ), Ẉ_r = ( Ẉ_r^0, ⋯, Ẉ_r^p) with Ẉ^0_r = ṛ.\n        \n        \n        \n        Under Assumption <ref>, the derivatives (t, θ, x, μ, v) ↦∂_θ∂_xX̃_s^t, x, μ(θ), ∂_x∂_θX̃_s^t, x, μ(θ), ∂_θ∂^2_xX̃_s^t, x, μ(θ), ∂^2_x∂_θX̃_s^t, x, μ(θ), ∂_θ [∂_μX̃_s^t, x, μ(θ)](v), ∂_μ∂_θX̃_s^t, x, μ(θ)(v), ∂_θ∂_v[∂_μX̃_s^t, x, μ(θ)](v), \n        ∂_v [∂_μ∂_θX̃_s^t, x, μ(θ)](v)∈L^p(ℙ) exist and are locally Lipschitz continuous for all p≥1. \n        \n        \n        \n        \n        \n        \n        \n        \n        \n         Proof. The proof of the existence and continuity of the derivatives of the flow X_s^t, x, ξ(θ) with respect to the parameters x, μ, v and θ is rather standard but quite mechanical and actually follows similar lines of reasonings as those employed for the proof of Theorem 3.2 in <cit.>. We thus omit it.  \n        \n        \n        \n        With the same notations as Lemma <ref>, under Assumption <ref>, taking h_θ = f_π_θ, E_π_θ or g(x, μ), we deduce from the above result that the derivatives (t, θ, x, μ, v) ↦∂_θ∂_x [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))], ∂_x∂_θ [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))], ∂_θ∂_μ  [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))](v), ∂_μ∂_θ  [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))](v), ∂_θ∂_v∂_μ [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))](v),  ∂_v∂_μ∂_θ [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))](v)∈ L^p(ℙ), for any p ≥1 and any 0≤ t≤ s ≤ T, exist and are continuous. For instance, standard computations give \n            ∂_θ_l∂_x_i    [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))] \n                = ∑_j=1^d ∂_θ_l∂_x_j h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ)) ∂_x_i (X̃_s^t, x, μ(θ))^j\n                  + ∑_j,k=1^d ∂^2_x_j, x_k h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ)) ∂_x_i (X̃_s^t, x, ξ(θ))^j  ∂_θ_l (X̃_s^t, x, μ(θ))^k \n                  +  ∑_j, k=1^d 𝔼[ [∂_μ∂_x_j h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))]_k(X_s^t, μ(θ)) ∂_θ_l (X_s^t, ξ(θ))^k ] ∂_x_i (X̃_s^t, x, μ(θ))^j\n                  + ∑_j=1^d ∂_x_j h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ)) ∂_θ_l∂_x_i (X̃_s^t, x, μ(θ))^j\n         and \n          \n            ∂_θ_l∂^i_μ    [h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))](v) \n                = ∑_j = 1^d ∂_θ_l∂_x_j h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ)) ∂^i_μ (X̃_s^t, x, μ(θ))^j\n                  + ∑_j,k =1^d ∂^2_x_j, x_k h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ)) ∂^i_μ (X̃_s^t, x, μ(θ))^j  ∂_θ_l (X̃_s^t, x, μ(θ))^k \n                  + ∑_j,k =1^d 𝔼[ [∂_μ∂_x_j h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))]_k(X_s^t, ξ(θ)) ∂_θ_l (X_s^t, ξ(θ))^k ] ∂^i_μ (X̃_s^t, x, μ(θ))^j\n                   + ∑_j=1^d ∂_x_j h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ)) ∂_θ_l∂^i_μ (X̃_s^t, x, μ(θ))^j\n                  + ∑_j=1^d 𝔼[ ∂_θ_l∂^j_μ h_θ(s, X̃_s^t, x,μ(θ), _X̃_s^t,ξ(θ))(X_s^t, v, μ(θ)) ∂_v_i (X_s^t, v, μ(θ))^j ]  \n                  + ∑_j, k=1^d 𝔼[ ∂_x_k∂^j_μ h_θ(s, X̃_s^t, x,μ(θ), _X̃_s^t,ξ(θ))(X_s^t, v, μ(θ)) ∂_v_i (X_s^t, v, μ(θ))^j ] ∂_θ_l (X̃_s^t, x, μ)^k \n                  + ∑_j, k=1^d   𝔼𝔼̌[ ∂^k_μ∂^j_μ h_θ(s,X̃_s^t, x,μ(θ), _X̃_s^t,ξ(θ))(X_s^t, v, μ(θ), X̌_s^t, ξ(θ)) ∂_v_i (X_s^t, v, μ(θ))^j∂_θ_l (X̌_s^t, ξ(θ))^k ]  \n                  + ∑_j, k =1^d   𝔼[ ∂_v_k∂^j_μ h_θ(s, X̃_s^t, x,μ(θ), _X̃_s^t,ξ(θ))(X_s^t, v, μ(θ)) ∂_v_i (X_s^t, v, μ(θ))^j∂_θ_l (X_s^t, v, μ(θ))^k ]  \n                  + ∑_j=1^d 𝔼[  ∂^j_μ h_θ(s, X̃_s^t, x,μ(θ), _X̃_s^t,ξ(θ))(X_s^t, v, μ(θ)) ∂_θ_l∂_v_i (X_s^t, v, μ(θ))^j ]\n                  + ∑_j=1^d ∫_ℝ^d 𝔼[∂_θ_l∂^j_μ h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))(X_s^t, x', μ(θ)) ∂^i_μ (X_s^t, x', μ(θ))^j(v) ]  μ(x̣') \n                  +  ∑_j, k=1^d ∫_ℝ^d 𝔼[∂_x_k∂^j_μ h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))(X_s^t, x', μ(θ)) ∂_θ_l (X̃_s^t, x, μ(θ))^k∂^i_μ (X_s^t, x', μ(θ))^j(v) ]  μ(x̣')\n                  + ∑_j, k=1^d ∫_ℝ^d 𝔼𝔼̌[ ∂^k_μ∂^j_μ h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))(X_s^t, x', μ(θ), X̌_s^t, ξ(θ)) ∂^i_μ (X_s^t, x', μ(θ))^j(v) ∂_θ_l (X̌_s^t, ξ(θ))^k]  μ(x̣')\n                  + ∑_j, k=1^d ∫_ℝ^d 𝔼[ ∂_v_k∂^j_μ h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))(X_s^t, x', μ(θ)) ∂_θ_l (X_s^t, x', μ(θ))^k ∂^i_μ (X_s^t, x', μ(θ))^j(v) ]  μ(x̣')\n                  + ∑_j=1^d ∫_ℝ^d 𝔼[  ∂^j_μ h_θ(s, X̃_s^t, x, μ(θ), _X̃_s^t, ξ(θ))(X_s^t, x', μ(θ)) ∂_θ_l∂^i_μ (X_s^t, x', μ(θ))^j(v)]  μ(x̣').\n        \n        \n        In the above identity, X̌^t,  ξ_s(θ) stands for a random variable independent of (X̃^t, x, μ_s, X_s^t, v, μ, X_s^t, x', μ) with the same law as X̃_s^t, ξ.\n         \n        Then, starting from the expression of _θ in (<ref>) (with π=π_θ), the dominated convergence theorem guarantees that the derivatives (t, θ, x, μ, v) ↦∂_θ∂_x_θ(t, x, μ), ∂_x∂_θ_θ(t, x, μ), ∂_θ∂^2_x_θ(t, x, μ), ∂^2_x∂_θ_θ(t, x, μ), ∂_θ∂_μ_θ(t, x, μ)(v), ∂_μ∂_θ_θ(t, x, μ)(v), ∂_θ∂_v∂_μ_θ(t, x, μ)(v), ∂_v∂_μ∂_θ_θ(t, x, μ)(v) exist and are locally Lipschitz continuous. Hence, from Clairaut's theorem, we deduce that ∂_θ∂_x_θ(t, x, μ) = ∂_x∂_θ_θ(t, x, μ), ∂_θ∂^2_x_θ(t, x, μ) = ∂^2_x∂_θ_θ(t, x, μ), ∂_θ∂_μ_θ(t, x, μ)(v) = ∂_μ∂_θ_θ(t, x, μ)(v) and ∂_θ∂_v∂_μ_θ(t, x, μ)(v) = ∂_v∂_μ∂_θ_θ(t, x, μ)(v) for all t, x, μ, θ, v.\n        \n        Moreover, from Assumption <ref> and Lemma <ref>, there exist q and C such that for any t, x, μ, v and any θ∈𝒦, 𝒦 being a compact subset of Θ\n            |∂_θ_θ(t, x, μ)| ≤ C(1 + |x|^2 + M_2(μ)^q),\n        \n            |∂_θ∂_x_θ(t, x, μ)| + |∂_θ∂_μ_θ(t, x, μ)(v)|  ≤ C ( 1+ |x| + |v|+ M_2(μ)^q),\n         and\n        \n            |∂_θ∂^2_x_θ(t, x, μ)| + |∂_θ∂_v∂_μ_θ(t, x, μ)(v)|  ≤ C ( 1+ |v| + M_2(μ)^q).\n        \n        \n        \n        Now, differentiating with respect to θ both sides of (<ref>), we deduce that θ↦∂_t _θ(t, x, μ) is differentiable with a derivative ∂_θ∂_t _θ(t, x, μ) being continuous with respect to t, x, μ, θ. Also, taking π=π_θ and differentiating with respect to θ both sides of the identity of (<ref>) (using Lemma <ref> together with the estimates (<ref>), (<ref>), (<ref>) and the dominated convergence theorem to differentiate the right-hand side therein) and then passing to the limit as h↓ 0, we get that t↦∂_θ_θ(t, x, μ) is differentiable with a derivative ∂_t ∂_θ_θ(t, x, μ) being continuous with respect to t, x, μ, θ.  We thus conclude that the two derivatives ∂_θ∂_t _θ(t, x, μ) and ∂_t ∂_θ_θ(t, x, μ) coincide for all t, x, μ, θ.\n        \n        \n        \n        \n        \n         §.§ Proof of Theorem <ref>\n        Step 1: We start from the PDE characterisation of _θ in Proposition <ref> that we write as \n        \n            ∫_A  {_θ^a[_θ](t,x,μ) + f(x,μ,a) +  λlog p_θ(t,x,μ,a) } π_θ(ạ|t,x,μ)    =    0,\n         \n        where \n        _θ^a[φ](t,x,μ)     =    - βφ(t,x,μ)  + ∂_tφ(t,x,μ)  +  b(x,μ,a) · D_xφ(t,x,μ) +  1/2σσ(x,μ,a) : D_x^2 φ(t,x,μ)  \n                +   _ξ∼μ[   b_θ(t,ξ,μ) ·∂_μφ(t,x,μ)(ξ) + 1/2Σ_θ(t,ξ,μ) : ∂_υ∂_μφ(t,x,μ)(ξ)    ],\n          recalling that b_θ(t,x,μ)=∫_A b(x,μ,a)  π_θ(ạ|t,x,μ), Σ_θ(t,x,μ)   =  ∫_A (σσ)(x,μ,a)  π_θ(ạ|t,x,μ).  \n        \n        For any fixed t, x, μ, we now differentiate w.r.t. θ∈Θ both sides of (<ref>) to get a new system of linear PDEs satisfied by _θ.\n        In particular, using the identity\n        \n            ∇_θ[_θ^a[_θ](t,x,μ)] = _θ^a[_θ](t,x,μ) +   _θ[_θ](t,x,μ),\n         together with (<ref>) and the dominated convergence theorem, we get\n        \n            ∫_A {_θ^a[_θ](t,x,μ)  +   _θ[_θ](t,x,μ) \n            \n             +   [ _θ^a[_θ](t,x,μ) + f(x,μ,a) +  λlog p_θ(t,x,μ,a) ]  ∇_θlog p_θ(t,x,μ,a)  }π_θ(ạ|t,x,μ)    =   0,\n         with terminal condition _θ(T,x,μ)=0.\n        \n        \n        \n        \n        \n        \n        \n        Note that we have used the fact that \n        ∫_A ∇_θlog p_θ(t,x,μ,a)  π_θ(ạ|t,x,μ)     =   ∇_θ∫_A π_θ(ạ|t,x,μ)    =   0,  \n        \n        and  the above PDE is a system of D equations, where  _θ^a[_θ] denotes the operator applied to each component of the ^D-valued function _θ. \n        Step 2: Denote by \n        \n            F̃_θ(t,x,μ,a)    =  {_θ^a[_θ](t,x, μ) + f(x,μ,a) + λlog p_θ(t,x,μ,a) }∇_θlog p_θ(t,x,μ,a) \n                    +  _θ[_θ](t,x,μ),\n        \n        and\n        f̃_π_θ(t,x,μ)    =   ∫_AF̃_θ(t,x,μ,a)  π_θ(ạ|t,x,μ),\n         so that the linear PDE (<ref>) satisfied by _θ now writes \n        _π_θ[_θ](t,x,μ)  +  f̃_π_θ(t,x,μ)    =    0,\n        \n         with terminal condition _θ(T,x,μ)=0. Observe that the above PDE is similar to (<ref>). In order to obtain the announced probabilistic representation formula, we first apply the chain rule formula on the strip [t, T] ×^d×_2(^d), see e.g. Proposition 5.102 in <cit.>, to (e^-β s_θ(s, X_s^t,x, μ,_X_s^t, ξ))_s ∈ [t, T] using the estimates (<ref>) and (<ref>). We thus obtain\n        \n            d(e^-β s_θ(s, X_s^t,x, μ,_X_s^t, ξ))     = - e^-β sf̃_π_θ(s, X_s^t,x,μ,_X_s^t,ξ)  ṣ\n                + e^-β s∂_x _θ(s,  X_s^t, x, μ,_X_s^t, ξ)σ_π_θ(X_s^t, x, μ, _X_s^t,ξ) Ẉ_s.\n        \n        \n        Observe that (<ref>) together with the fact that for any θ∈^D, |σ_π_θ(x, μ)| ≤ C(1+|x|+M_2(μ)), for some constant C, directly yields that the stochastic integral is a square integrable martingale. Hence, integrating from t to T both sides of the above and using the facts that _θ(T,x,μ)=0 and ℙ_X_s^t, ξ = ℙ_X_s^t, ξ, ℙ_X_s^t, x, μ = ℙ_X_s^t, x, μ , we eventually deduce\n        \n            _θ(t,x,μ)    =  _α∼π_θ[ ∫_t^T  e^-β(s-t)F̃_θ(s, X_s^t,x,μ,_ X_s^t,ξ, α_s)   ṣ].\n        Step 3: On the other hand,  applying again the chain rule formula to _θ(s,X_s^t,x,μ,_X_s^t,ξ), when  α∼π_θ, see e.g. Proposition 5.102 in <cit.>, we have \n        \n        _θ(s, X_s^t,x,μ, _ X_s^t,ξ) \n        \n           =   \n        ( ^α_s_θ[_θ](s, X_s^t, x, μ, _ X^t, ξ_s)  + β_θ(s, X_s^t,x,μ,_ X_s^t,ξ) )  ṣ\n                  +  \n        D_x  _θ(s, X_s^t,x,μ,_ X_s^t,ξ)σ( X_s^t,x,μ,_ X_s^t,ξ, α_s)  Ẉ_s,    t ≤ s ≤ T,  \n        \n        and thus by definition of F̃_θ\n            ∫_t^T  e^-β(s-t)F̃_θ(s, X_s^t,x,μ,_ X_s^t,ξ, α_s)   ṣ\n                =  ∫_t^T e^-β(s-t)∇_θlog(p_θ(s,  X_s^t, x, μ, _ X_s^t, ξ, α_s)) (_θ(s,  X_s^t, x, μ, _X_s^t, ξ) - β_θ(s,  X_s^t, x, μ, _ X_s^t, ξ) \n                  + _θ[_θ](s,X_s^t, x, μ, _X_s^t, ξ) )  ṣ\n                + ∫_t^T  e^-β(s-t)∇_θlog(p_θ(s,  X_s^t, x, μ, _ X_s^t, ξ, α_s)) ( f(X_s^t,x,μ,_ X_s^t,ξ, α_s) + λlog(p_θ (s,  X_s^t, x, μ, _ X_s^t, ξ, α_s) )   )  ṣ\n                - ∫_t^T e^-β(s-t)∇_θlog(p_θ(s,  X_s^t, x, μ, _ X_s^t, ξ, α_s))    D_x  _θ(s, X_s^t,x,μ,_ X_s^t,ξ)σ( X_s^t,x,μ,_ X_s^t,ξ, α_s)    Ẉ_s.\n        \n        \n        Note that (<ref>) as well as the bound |D_x V_θ(s, x, μ)|≤ C(1+|x|+|μ|^q), for some q≥0, directly deduced from the identity (<ref>) and Assumption <ref>, guarantees that the stochastic integral appearing in the right-hand side of the above identity is a square integrable martingale. Hence, taking expectation in both sides of the above identity eventually yields\n        \n        \n            G_θ(t,x,μ)     :=  _α∼π_θ[ ∫_t^T  e^-β(s-t)∇_θlog p_θ(s,X_s^t,x,μ,_X_s^t,ξ,α_s) {_θ(s,X_s^t,x,μ,_X_s^t,ξ) \n                 +  [  f(X_s^t,x,μ,_X_s^t,ξ,α_s) +  λlog p_θ(s,X_s^t,x,μ,_X_s^t,ξ,α_s)  - β_θ(s,X_s^t,x,μ,_X_s^t,ξ) ] ṣ}\n                +  ∫_t^T e^-β(s-t)_θ[_θ](s,X_s^t,x,μ,_X_s^t,ξ)   ṣ].\n        \n        \n        \n        \n         \n        \n        \n        This proves the announced probabilistic representation formula for G_θ. \n        \n        \n        § LINEAR QUADRATIC MEAN-FIELD CONTROL WITH RANDOMISED CONTROLS AND ENTROPY REGULARISATION\n         \n        \n        \n        A  stochastic policy is  a probability  transition kernel from [0,T]×^d×_2(^d) into A=^m, i.e., a  measurable function π:(t,x,μ)∈[0,T]×^d×_2(^d)↦π(.|t,x,μ)∈(^m).  We denote by Π the set of stochastic policies \n        π with densities p  with respect to the Lebesgue measure on ^m: π( ạ |t,x,μ)=p(t,x,μ,a)ạ.  \n        We say that the process α=(α_t)_t  is a randomised feedback control generated from a stochastic  policy π∈Π, denoted by α∼π, if at each time t, the action α_t is sampled (according to the σ-algebra ) \n        from the probability distribution π(.|t,X_t,_X_t). The dynamics X=X^α follows a linear mean-field dynamics with coefficients b(x,μ,a)=b̅(x,μ̅,a),   σ(x,μ,a)=σ̅(x,μ̅,a) in the form\n        b̅(x,x̅,a)   =    B x + B̅x̅ +  C a,    σ̅(x,x̅,a)   =  γ + D x + D̅x̅ + Fa, \n        \n        for (x,μ,x̅,a)∈^d×_2(^d)×^d×^m, where we denote by μ̅=∫ x μ(x̣),  B, B̅, D, D̅ are constant matrices in ^d× d, C, F are constant matrices in ^d× m, γ is a constant in ^d.  \n        \n        Given a stochastic policy π∈Π, we consider the functional cost V^π with entropy regulariser defined in (<ref>) with quadratic functions f(x,μ,a)=f̅(x,μ̅,a) and g(x,μ)=g̅(x,μ̅):\n        f̅(x,x̅,a)   =   x Qx + x̅Q̅x̅  + a N a  + 2a Ix + 2aI̅x̅ +  2M.x + 2H.a, \n        g̅(x,x̅)   =   x P x + x̅P̅x̅ + 2L.x,\n        \n        where N is a  symmetric matrix in _+^m, I, I̅∈^m× d,  Q, Q̅, P, P̅ are  symmetric matrices in  ^d,  \n        \n        \n        \n        \n        \n        M, L∈^d, H∈^m, assumed to satisfy the conditions: \n        \n        \n         (H1) (i) There exists δ>0 s.t. \n        \n        N  ≥ δ I_m,    P    ≥  0,    Q  - I N^-1I  ≥  0.  \n        \n        or (ii)  n=m=1, I=0, F≠0, Q≥0,  P>0. \n        \n        \n         (H2) (i) There exists δ>0 s.t. \n        \n        N  ≥ δ I_m,    P + P̅ ≥  0,    (Q + Q̅)  -  (I + I̅) N^-1 (I + I̅)  ≥  0.  \n        \n        or (ii)  I+I̅=0, F≠0,  Q + Q̅≥0,  P+P̅≥0, P>0. \n        \n        \n        \n        \n        \n        \n        \n        The solution to the LQ mean-field control problem with entropy regulariser is then given by the following theorem:\n        \n        \n        \n        Let Assumptions  (H1)- (H2) hold. Then, the value function is equal to \n        \n        v(t,x,μ)   :=  inf_π∈Π V^π(t,x,μ)    =     (x-μ̅) K(t)(x-μ̅)+μ̅Λ(t)μ̅+2Y(t) x+R(t),\n        \n        for (t,x,μ)∈[0,T]×^d×_2(^d), where  the quadruple (K,Λ,Y,R) valued in (_+^d,_+^d,^d,) is solution on [0,T] to the system of Riccati equations:\n        \n            K̇(t) - β K(t) +Q+K(t)B+B K(t)+D K(t) D \n                       -(I+C K(t)+F K(t) D) (N+F K(t) F)^-1(I+C K(t)+F K(t) D)      =   0,  \n            \n                       Λ̇(t) -βΛ(t) + Q̂ +Λ(t)B̂ +B̂Λ(t)+D̂ K(t)D̂\n                - (Î +CΛ(t)+F K(t)D̂)(N+F K(t) F)^-1(Î +CΛ(t)+F K(t)D̂)   =   0  \n            \n                       Ẏ(t) -β Y(t) +M+B̂ Y(t)+ D̂ K(t)γ\n                -(Î +CΛ(t)+F K(t) D̂)(N+F K(t) F)^-1(H+C Y(t)+F K(t)γ)    =   0\n            \n            \n                       Ṙ(t)  -β R(t)  +γ K(t)γ  +  λ m/2log(2π)-λ/2log|λ/2 det(N+F K(t) F)|\n                -(H+C Y(t)+F K(t)γ)(N+F K(t) F)^-1(H+C Y(t)+F K(t)γ)    =   0\n        \n        with the terminal condition (K(T),Λ(T),Y(T),R(T))=(P,P̂,L,0), where we set Î:=I+I̅, B̂:=B+B̅, D̂:=D+D̅,  \n        Q̂:=Q + Q̅, P̂:=P+P̅.  \n        \n        Moreover, the optimal stochastic policy follows a Gaussian distribution: \n        \n            π^*(.|t,x,μ)     =   ( - S(t)^-1(  U(t) x + (Û(t) - U(t))μ̅+ O(t) ); λ/2 S(t)^-1),\n         \n        where we set \n        \n        S(t)   :=   N + F K(t) F,        O(t)   :=    H + C Y(t)  + F K(t) γ\n        \n        U(t)   :=   I + C K(t) + F K(t) D,        Û(t)   :=  Î  + C Λ(t) + F K(t) D̂. \n        \n        Conditions  (H1) and  (H2) ensure the existence and uniqueness of a solution (K,Λ) to the matrix Riccati equation in (<ref>) satisfying K≥0, Λ≥0 (hence S(t)^-1 is well-defined). Given (K,Λ), the equations for \n        (Y,R)  are simply linear ODEs. \n        \n        \n        Let ^r be the set of _2(^m)-valued -adapted processes π=(π_t)_t with densities p=(p_t)_t w.r.t. to the Lebesque measure: π_t(ạ)=p_t(a) ạ.   \n        We say that an ^m-valued  process α=(α_t)_t  is a randomised (open-loop) control generated from π∈^r, denoted by α∼π, if at each time t, the decision α_t is sampled from the probability distribution π_t.  \n        \n        We then consider the problem of minimizing over randomised controls α∼π∈^r the cost functional with entropy regulariser \n        \n        J(π)    =   _α∼π[ ∫_0^T e^-β t(  f(X_t,_X_t,α_t)  + λ∫_^mlog p_t(a) ạ)  ṭ +  e^-β T g(X_T,_X_T) ], \n        \n        where the process X=X^α follows a linear mean-field dynamics, and f, g are quadratic cost functions, namely: \n        \n            b(x,μ,a)   =    B x + B̅μ̅+  C a,    σ(x,μ,a)   =  γ + D x + D̅μ̅+ Fa,  \n            \n            f(x,μ,a)   =   x Qx + μ̅Q̅μ̅+ a N a  + 2a Ix + 2aI̅μ̅+  2M.x + 2H.a, \n            \n            g(x,μ)   =   x P x + μ̅P̅μ̅+ 2L.x,\n         \n        for (x,μ,a)∈^d×_2(^d)×^m, where we denote by μ̅=∫ x μ(x̣),  B, B̅, D, D̅ are constant matrices in ^d× d, C, F are constant matrices in ^d× m, γ is a constant in ^d, \n        N is a  symmetric matrix in _+^m, I, I̅∈^m× d,  Q, Q̅, P, P̅ are  symmetric matrices in  ^d,  with Q≥0, P≥0, \n        \n        \n        \n        \n        M, L∈^d, H∈^m. \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n         Proof of Theorem <ref>.  We adapt the arguments in  <cit.> to our case with randomised controls and entropy regulariser.  \n        \n         Step 1. Let us consider the function defined on [0,T]×^d×_2(^d) by w(t,x,μ)=w̅(t,x,μ̅), where w̅ is defined on [0,T]×^d×^d by \n        w̅(t,x,x̅)    =    (x-x̅) K(t)(x-x̅)+x̅Λ(t)x̅+2Y(t) x+R(t),\n        \n        for some functions (to be determined later)  K, Λ, Y and R on [0,T], and valued on _+^d, _+^d, ^d, and .  Fix (t_0,x_0,μ_0)∈[0,T]×^d×_2(^d), and ξ_0∈L^2(_t_0;^d)∼μ_0.   Given π∈Π with density p,  and a randomised control α∼π, we consider the process \n        _t^α   :=     e^-β(t-t_0)w̅(t,X_t^t_0,x_0,μ_0,X̅_t^t_0,μ_0) + ∫_t_0^t e^-β(s-t_0)[  f̅(X_s^t_0,x_0,μ_0,X̅_s^t_0,μ_0,α_s)   \n               +  λ∫_^m(log_t(a) ) _t(a) ạ\n        ]  ṣ,    \n        \n        for t_0≤ t ≤ T, where we set _t(a)=p(t,X_t^t_0,x_0,μ_0,_X_t^t_0,ξ_0,a), and \n        X̅_t^t_0,μ_0:=_α∼π[X_t^t_0,ξ_0] which follows the dynamics:\n        \n        d X̅_t    =   ( B̂X̅_t  + C α̅_t) ṭ, \n        \n        with α̅_t:=_α∼π[α_t]. \n        \n         Step 2.  We apply Itô's formula to _t^α for α∼π, and take the expectation to get\n        \n            _α∼π[_t^α]    =    e^-β(t-t_0)_α∼π[_t^α] ṭ,\n         \n        with \n        _t^α   =     - βw̅(t,X_t,X̅_t) + /ṭ_α∼π[w̅(t,X_t,X̅_t)] + f̅(X_t,X̅_t,α_t)   + λ∫_^m (log_t(a)) _t(a) ạ,\n        \n        where we omit the dependence on t_0,x_0,μ_0 of X and X̅ to alleviate notations.  By applying Itô's formula to w̅(t,X_t,X̅_t), recalling the quadratic forms of w̅, f̅, and using the linear dynamics of X and X̅, we obtain similarly as in <cit.> (after careful but straightforward computations): \n        \n            _α∼π[_t^α]    =     _α∼π[  \n            (X_t-X̅_t)(K̇(t) - β K(t) + Q  +K(t)B+B K(t)+D K(t) D)(X_t-X̅_t)  \n                 +  X̅_t( Λ̇(t) - βΛ(t) + Q̂ +  Λ(t) B̂ + B̂Λ(t)+ D̂ K(t)D̂)X̅_t  \n                 +   2(Ẏ(t) - β Y(t) + M  + B̂ Y(t)+D̂ K(t)γ) X_t +  Ṙ(t) - β R(t) +γ K(t)γ\n                 +  α_t S(t) α_t +  2α_t(  U(t) (X_t - X̅_t)  +   Û(t) X̅_t + O(t) )  +  λ∫_^m (log_t(a)) _t(a) ạ] \n              =     _α∼π[  \n            (X_t-X̅_t)(K̇(t) - β K(t) + Q  +K(t)B+B K(t)+D K(t) D)(X_t-X̅_t)  \n                 +  X̅_t( Λ̇(t) - βΛ(t) + Q̂ +  Λ(t) B̂ + B̂Λ(t)+ D̂ K(t)D̂)X̅_t  \n                 +   2(Ẏ(t) - β Y(t) + M  + B̂ Y(t)+D̂ K(t)γ) X_t +  Ṙ(t) - β R(t) +γ K(t)γ\n               \n              +  ∫_^m [ ϕ_t(a) +  λlog_t(a) ] _t(a) ạ],\n         \n        where we used in the last equality the fact that α∼π, and set  ϕ_t(a):=a S(t) a  +  2 a χ_t with \n        χ_t:=U(t) (X_t - X̅_t)  +   Û(t) X̅_t + O(t). \n        \n        \n        \n         Step 3.  Let ϕ be a quadratic function on ^m: ϕ(a)=a S a + 2 aχ  for some positive-definite matrix S∈_+^m, and χ∈^m, and denote by  \n        _2(^m) the set of square integrable density functions on ^m, i.e., the set of nonnegative measurable functions  on ^m s.t. ∫_^m(a) ạ=1, and ∫_^m |a|^2 (a) ạ<∞.  Let us consider the cost functional on _2(^m) defined by\n        \n        C_ϕ()     :=    ∫_^m [ ϕ(a) + λlog(a) ] (a) ạ. \n        \n        Then, the minimizer of C_ϕ is achieved with ^*∈_2(^m) given by \n        \n            ^*(a)    =  exp(-1/λϕ(a) )/∫_^mexp(-1/λϕ(a) ) ạ,    a ∈^m.\n         \n        Indeed, by considering the Lagrangian function associated to  this  minimization problem \n        \n        L_ϕ(,ν)    =    C_ϕ() - ν( ∫_^m(a)ạ - 1 )   =  ∫_^m[ ϕ(a) + λlog(a) - ν] (a) ạ   +   ν, \n        \n        for (,ν)∈_2(^m)×, we see that the minimization over  is obtained pointwisely, i.e. inside the integral over a∈^m, hence leading to the first-order equations: \n        \n            ϕ(a) + λlog^*(a) - ν^* +  λ  =    0,    a ∈^m,  \n            ∫_a ∈^m^*(a) ạ  =   1.\n         \n        This yields the expression of ^* in (<ref>), which is  actually the density of  a Gaussian distribution \n        \n            π^*    =  ( - S^-1χ; λ/2 S^-1).\n         \n        The infimum of C_ϕ is then equal to \n        \n            inf_∈_2(^m) C_ϕ()    =    C_ϕ(^*)   =    - χ S^-1χ  - λ m/2log(2π)-λ/2log|λ/2det(S)|.\n        \n         Step 4.  Notice that under  (H1), the matrix  S(t)=N+F K(t) F is positive-definite for K≥0,  and _t(.)∈_2(^m) a.s. for t∈[t_0,T]. \n        From (<ref>) and (<ref>), we then have for all π∈Π, \n        \n            _α∼π[_t^α]  \n              =     _α∼π[  \n            (X_t-X̅_t)(K̇(t) - β K(t) + Q  +K(t)B+B K(t)+D K(t) D)(X_t-X̅_t)  \n                 +  X̅_t( Λ̇(t) - βΛ(t) + Q̂ +  Λ(t) B̂ + B̂Λ(t)+ D̂ K(t)D̂)X̅_t  \n                 +   2(Ẏ(t) - β Y(t) + M  + B̂ Y(t)+D̂ K(t)γ) X_t +  Ṙ(t) - β R(t) +γ K(t)γ\n                 +   C_ϕ_t(_t) ] \n             ≥    _α∼π[  \n            (X_t-X̅_t)(K̇(t) - β K(t) + Q  +K(t)B+B K(t)+D K(t) D   - U(t) S(t)^-1 U(t) )(X_t-X̅_t)  \n                 +  X̅_t( Λ̇(t) - βΛ(t) + Q̂ +  Λ(t) B̂ + B̂Λ(t)+ D̂ K(t)D̂  - Û(t) S(t)^-1Û(t)  )X̅_t  \n                 +   2(Ẏ(t) - β Y(t) + M  + B̂ Y(t)+D̂ K(t)γ  - O(t) S(t)^-1Û(t) ) X_t \n                 +  Ṙ(t) - β R(t) +γ K(t)γ - O(t) S(t)^-1O(t) - λ m/2log(2π)-λ/2log|λ/2det(S(t))|.\n         \n        Therefore, by taking (K,Λ,Y,R) solution to (<ref>), we  see that the r.h.s. of (<ref>) vanishes, which means that for all π∈Π, _α∼π[_t^α]≥0.  Moreover, from (<ref>), the equality in (<ref>) holds true for the choice of π^*∈Π as defined in \n        (<ref>), and thus\n        inf_π∈Π_α∼π[_t^α]    =   _α∼π^*[_t^α]   =   0,     t ∈ [t_0,T]. \n         \n        From (<ref>), this means that the function t↦_α∼π[_t^α] is nondecreasing on [t_0,T] for any π∈Π, and constant on [t_0,T] for π=π^*. By definition of ^α, V^π,  and noting that w̅(T,x,x̅)=g̅(x,x̅) from the terminal condition on (K,Λ,Y,R),  \n        it follows  that \n        \n            w(t_0,x_0,μ_0)   =  w̅(t_0,x_0,μ̅_0)   =  _α∼π[S_t_0^α]     ≤ _α∼π[S_T^α]   =   V^π(t_0,x_0,μ_0),\n         \n        for any π∈Π, with equality   in (<ref>) for π=π^*.  We conclude that \n        inf_π∈Π V^π(t_0,x_0,μ_0)     =     V^π^* (t_0,x_0,μ_0)   =    w(t_0,x_0,μ_0) \n           =    (x_0-μ̅_̅0̅) K(t_0)(x_0-μ̅_̅0̅)+μ̅_̅0̅Λ(t_0)μ̅_̅0̅+2Y(t_0) x_0+R(t_0). \n        plain\n"}