{"entry_id": "http://arxiv.org/abs/2303.06990v1", "published": "20230313104416", "title": "Randomness-free Test of Non-classicality and An Experimental Quantum Advantage in Correlated Coin Tossing", "authors": ["Zhonghua Ma", "Markus Rambach", "Kaumudibikash Goswami", "Some Sankar Bhattacharya", "Manik Banik", "Jacquiline Romero"], "primary_category": "quant-ph", "categories": ["quant-ph", "physics.optics"], "text": "\n\n\n\n\nAustralian Research Council Centre of Excellence for Engineered Quantum Systems & School of Mathematics and Physics, University of Queensland, QLD 4072, Australia.\n\n\nAustralian Research Council Centre of Excellence for Engineered Quantum Systems & School of Mathematics and Physics, University of Queensland, QLD 4072, Australia.\n\n\ngoswami.kaumudibikash@gmail.com\nQICI Quantum Information and Computation Initiative, Department of Computer Science, University of Hong Kong\n\n\nsomesankar@gmail.com\nInternational Centre for Theory of Quantum Technologies, University of Gdansk, Wita Stwosza 63, 80-308 Gdansk, Poland\n\n\nDepartment of Physics of Complex Systems, S.N. Bose National Center for Basic Sciences, Block JD, Sector III, Salt Lake, Kolkata 700106, India.\n\n\nAustralian Research Council Centre of Excellence for Engineered Quantum Systems & School of Mathematics and Physics, University of Queensland, QLD 4072, Australia.\n\n\nQuantum entanglement leads to non-classical correlations certifiable through Bell tests. These tests require seed randomness—which is often costly and vulnerable to loopholes—for choosing the local measurements performed on different parts of a multipartite quantum system. We implement a technique of detecting the non-classicality of correlations that does not require seed randomness. Our test is semi-device-independent and requires only prior knowledge of the dimension of the parts. By producing specific correlated coins from pairs of photons entangled in their transverse spatial modes we also experimentally show a novel quantum advantage in correlated coin tossing. We establish the advantage by showing that the correlated coin state we obtain cannot be derived from any two 2-level classical correlated coins. The quantum advantage requires performing qubit trine positive operator value measures (POVMs) on each part of the entangled pair, thus also certifying such POVMs in a semi-device-independent manner. We firmly establish a quantum advantage in generating shared randomness which will be important for future multi-party quantum communications.\n\n\n\n\n\n\n\n\n\n\nRandomness-free Test of Non-classicality and\n An Experimental Quantum Advantage in Correlated Coin Tossing\n    Jacquiline Romero\n    March 30, 2023\n==========================================================================================================\n\n\n\n§ INTRODUCTION\n\n\nCorrelations play an integral role in information processing be it classical or quantum. Nature presents us with composite systems consisting of correlations among multiple subsystems, that cannot be explained if the subsystems are separable <cit.>. Characterizing such non-classical correlations have been central to quantum theory. Aside from testing Bell inequalities, recent developments in quantum technology provide us with the tools to detect non-classicality of correlations either as a pseudo-telepathy game <cit.> or in a communication task assisted by those correlations <cit.>. Both cases involve randomizing over the choice of inputs (measurement settings in the first case and preparation and measurement in the second case). In this work, we implement a new technique of detecting non-classical correlations, which does not require costly seed randomness for inputs. As a trade-off the experimenter is required to know only an upper bound to the dimension of the subsystems in use, hence the technique is semi-device-independent. Besides foundational interest, this new tool paves way for a cost-effective characterization of non-classical resources in quantum information and computation. \n\nWe follow an operational approach by considering the task of generating shared randomness between two distant parties. Shared randomness (SR), also known as public/correlated randomness (as opposed to private randomness <cit.>) can be thought of as a joint probability distribution over random variables shared between two distant parties, that cannot be factorized. A well-known quantifier for such correlations is the mutual information, which serves as a  bonafide measure for the distant parties agreeing on a string of measurement outcomes, given a common source <cit.>. Based on this quantity, shared randomness has been established as a useful resource in a number of tasks—privacy amplification, simultaneous message passing, simulation of noisy classical and quantum channels, secret sharing, simulation of quantum correlations, and Bayesian game theory, to name a few <cit.>. Generation of this resource from some physical system is, therefore, a question of utmost practical relevance. In an operational theory, SR, between two distant parties, can be obtained from a bipartite system prepared in some correlated state. In practice, the two parties could each be given a part of a correlated pair of classical or quantum coins which they could use for “coin-tossing\". Each party performs a local operation on their respective parts of the composite system which results in correlated outcomes and hence SR.\n\nHere we demonstrate an experimental quantum advantage in generating SR between two parties. Particularly, we show that a two-qubit system prepared in a maximally entangled state can yield some desired SR, that otherwise is not possible to  obtain from the corresponding classical system – two 2-level correlated classical coins which we call two-2-coin. This in turn establishes a non-classical feature of the two-qubit system which distinguishes it from its classical counterpart. Importantly, in our case, a single measurement – positive operator value measure (POVM) – is performed on each part of the entangled pair. Therefore, unlike Bell tests (see <cit.>), no randomization over the choice of local measurements is required for establishing this non-classicality. In the experiment, we use transverse-mode entangled photon pairs produced via degenerate spontaneous parametric down-conversion method as the two-qubit system. As it turns out the advantage is established through the payoff of a game played between two distant parties, which is different from mutual information between the random variables possessed by spatially separated parties <cit.>. The payoff is upper bounded by a threshold value when the parties share a two-2-coin state, whereas a better payoff can be obtained from a two-qubit singlet state even when the state is noisy. The resulting quantum advantage demands generalized measurements, viz. POVMs <cit.> on the local parts of the shared entangled state as it is not possible through local projective measurements, a.k.a. von Neumann measurements <cit.>, and then local post-processing of the outcome statistics. Payoff superseding the classical threshold value ensures that the measurements are not projective, and thus establishes a semi-device-independent test of generalized measurement.  \n\n\n\n\n§ PRELIMINARIES\n\nThe operational utility of SR can be understood within the framework of resource theory. This resource theoretic framework, in fact, finds successful application in quantifying a variety of quantum resources (see <cit.> and references therein). The methodology of this highly versatile framework starts with partitioning the states into two disjoint groups:  resource-free states and resourceful states. Based on natural restrictions placed on physical systems, a collection of operations is identified as free, which keeps the set of free states invariant. The framework then introduces the concept of resource monotones that put a quantitative order among the resourceful states. \n\nSources of two random variables X and Y held by two distant parties, Alice and Bob, will not yield any SR whenever the joint probability distribution is in the product form, i.e., P(X,Y)=P(X)P(Y); here P(Z)≡{p(z) | p(z)≥0 & ∑_z∈ Z p(z)=1} denotes a probability distribution on Z. On the other hand, the joint source produces a nonzero amount of shared randomness when the distribution cannot be written as a product. The amount of SR can be faithfully quantified by the entropic function called mutual information, I(X:Y):=H(X)+H(Y)-H(X,Y); where H(Z):=-∑ p(z)log_2p(z) denotes the Shannon entropy associated with the source P(Z) <cit.>. A source P(Z) can be converted into a different one P^'(Z^') by a stochastic map S^Z→ Z^', which can be represented as a |Z^'|×|Z| matrix having non-negative real elements with the entries in each column adding up to unity <cit.>. While constructing the resource theory of SR, the free operations on a bipartite source P(X,Y) are given by the product of stochastic maps applied on the individual parts, i.e., instead of a general stochastic matrix of the form S^XY→ X^' Y^' only product of local stochastic matrices S^X→ X^' and S^Y→ Y^' are allowed as free. For convenience,  the free operations can be represented as a tensor product, S^X→ X^'⊗ S^Y→ Y^' <cit.>.\n\nPhysically SR can be obtained from a composite system prepared in some correlated state which is shared between distant parties. Alice and Bob perform local operations on their respective parts of the composite state resulting in random but correlated outcomes. Within the framework of generalized probability theory, the state space of such a bipartite system is described by Ω_A⊗Ω_B, where Ω_K denotes the marginal state space <cit.>. For instance, the state space of d-level classical system is the d-simplex, a convex set  embedded in ℝ^d-1 having d number of extremal points. A coin-tossing experiment corresponds to the case d=2, and leads to the state space ℭ^2≡{(p(h),p(t))^T | p(h),p(t)≥0 & p(h)+p(t)=1}; p(h) and p(t) respectively denote the probability of obtaining outcome `head'  and `tail'. The state space ℭ(2)≡ℭ^2_A⊗ℭ^2_B of two-2-coin shared between Alice and Bob is given by ℭ(2)≡{(p(hh),p(ht),p(th),p(tt))^T | p(ij)≥0, ∀ i,j∈{h,t}, & ∑_i,jp(ij)=1}. The quantum analogue of two-2-coin is a two-qubit system associated with the Hilbert space ℂ^2_A⊗ℂ^2_B, and the corresponding state space is given by 𝒟(ℂ^2_A⊗ℂ^2_B); where 𝒟(ℍ) denotes the set of density operators acting on the Hilbert space ℍ. From a quantum state, ρ_AB∈𝒟(ℂ^2_A⊗ℂ^2_B), Alice and Bob can generate shared randomness by performing local measurements on their respective parts (see Fig. <ref>). \n\n\n\n\n\n\nGeneralizing the notion of ℭ(2), the state space of a two-d-coin is defined as, ℭ(d)≡{(p(11),p(12),⋯,p(dd))^T | p(ij)≥0, ∀ i,j∈{1,⋯,d}, & ∑_i,jp(ij)=1}. By ΘC(2→ d) we denote the set of two-d-coin states that can be obtained from the set of two-2-coin states ℭ(2) by applying free local stochastic maps S_A/B^2→ d on Alice's and Bob's part of the states. Similarly, ΘQ(2→ d) denotes the set of two-d-coin states obtained by performing d-outcome local measurements on Alice's and Bob's parts of the bipartite quantum states 𝒟(ℂ^2_A⊗ℂ^2_B). We are now in a position to present our first result as stated in the following proposition (proof  deferred to the Appendix). \n\nFor every d≥3, ΘC(2→ d)⊆ΘQ(2→ d)⊊ℭ(d), whereas ΘQ(2→ 2)=ℭ(2)=ΘC(2→ 2). \n \nAs evident from this Proposition, a quantum advantage in SR generation is possible if we consider the generation of a higher dimensional correlated coin state starting from a lower dimensional correlated coin state. More particularly, a proper set inclusion relation ΘC(2→ d)⊊ΘQ(2→ d) for some d≥ 3 establishes a quantum advantage in correlated coin state generation, which we aim to experimentally establish through a game introduced in <cit.>.\n\n\n\n§ NON-MONOPOLIZING SOCIAL SUBSIDY GAME\n \nThe game 𝔾(n) involves two employees, Alice and Bob, working in an organization. There are n different restaurants {r_1,⋯, r_n} where the employees can choose to buy their daily drink. The organization follows a reimbursement policy to pay back the bill. For this, each day’s bills of Alice and Bob are collected for a log to calculate the joint probability P(ij) that Alice visits restaurant r_i  while Bob visits restaurant r_j restaurant. Alice and Bob are reimbursed only if they end up going to different restaurants, i.e., r_i≠ r_j. At the same time, the game requires minimising the chance of one restaurant being boycotted, which would happen if Alice and Bob frequent two different but fixed restaurants. Hence we define the payoff as, $ℛ(n) =$min_i≠ j P(ij) to ensure that trade is distributed among all the restaurants. The employees are non-communicating. However, they possess a bipartite state with subsystems described by two-level systems and choose strategies with the help of free operations and accordingly try to maximize their payoff. If no restriction is put on the amount of SR, then both Alice and Bob can obtain the maximum payoff ℛ_max(n)=1/(n^2-n) <cit.>. The situation becomes interesting if restrictions are imposed on the amount of SR. Let, ℛ^ℭ(m)_max(n) denotes the maximum payoff achieved in 𝔾(n) when the parties are allowed to share a two-m-coin. For a pair (m,n) with m<n, the cases ℛ^ℭ(m)_max(n)<ℛ_max(n) open up a scope for quantum advantage.\n\n\n\n\n§ QUANTUM ADVANTAGE IN CORRELATED COIN TOSSING\n \nPerfect success of 𝔾(3) game requires Alice and Bob to share a coin 𝒞_ac(3):=1/6(0,1,1,1,0,1,1,1,0)^T∈ℭ(3). As it turns out this particular coin cannot be generated from any of the coin states in ℭ(2) by applying free operations, and the optimal payoff Alice and Bob can ensure with a ℭ(2) coin is ℛ^ℭ(2)_max(3)=1/8<1/6=ℛ_max(3) (see Appendix).\n\nWhen allowed to share a two-qubit state Alice and Bob can start their protocol by sharing a noisy singlet state \n\n    𝒲_p:=p|ψ^-⟩⟨ψ^-|+(1-p)𝐈_2/2⊗𝐈_2/2,  p∈[0,1];\n\nwhere |ψ^-⟩:=1/√(2)(|0⟩⊗|1⟩-|1⟩⊗|0⟩) with {|0⟩,|1⟩} denoting the eigenstates of Pauli σ_z operator. Both of them perform the trine POVM \n\n    ℳ≡{e_i   :=1/3(𝐈_2+n̂_i.σ)}:  n̂_i:=(sinθ_i,0,cosθ_i)^T,\n         θ_1=0, θ_2=2π/3, θ_3=4π/3,\n\non their respective qubits. This results in a shared coin state 𝒞_p(3):=(f_p,s_p,s_p,s_p,f_p,s_p,s_p,s_p,f_p)^T∈ℭ(3), with f_p:=(1-p)/9, s_p:=(2+p)/18. Manifestly, this amounts to a payoff \n\n    ℛ_p(3):=min_i≠ jP(ij)=(2+p)/18,\n\nif Alice and Bob visit the i^th restaurant when the i^th outcome clicks in their respective measurements. A quantum advantage is ensured whenever ℛ_p(3)>1/8. As it turns out quantum states 𝒲_p∈𝒟(ℂ^2⊗ℂ^2) becomes advantageous over the classical two-2-coin states ℭ(2) in playing the 𝔾(3) game whenever p>1/4, with perfect entangled state yielding the perfect success <cit.>. \n\nIn view of an adversarial scenario, one may consider a third party Eve, and ask: is it possible for Eve to obtain information about P(X,Y), the joint probability distribution of the random variables X and Y, which are outcomes of Alice's and Bob's measurements? The answer to such a question definitely depends on the computational power of Eve and the constraints on the system shared between Alice and Bob.  For the case where Alice and Bob achieve perfect success in the 𝔾(3) it is not possible for Eve to obtain information about P(X,Y), provided that Eve's power is restricted to process quantum systems only and Alice's and Bob's local subsystems' dimension are bounded from above (in our case dim=2). This follows from the observation that perfect success necessitates a maximally entangled two-qubit state to be shared between Alice and Bob, which cannot be correlated even classically with a third party. However, a general answer to the question of security in this setting for arbitrary success probability ℛ_p(3)>1/8, we leave as a question for future research.\n\n\n\n§ EXPERIMENT\n \nThe quantum coin used in the experiment is a pair of photons entangled in their transverse spatial modes produced via degenerate spontaneous parametric downconversion (SPDC) <cit.>.\nWe show our experimental schematic in Fig. <ref>. \nA 405-nm continuous wave ultraviolet laser is incident on a 5-mm thick beta-barium borate (BBO) crystal (after passing through a pair of lenses of focal length 50 mm to control collimation, L1 and L2). \nWhile passing through the crystal, a UV photon is probabilistically downconverted to a pair of infrared photons of the wavelength of 810 nm. \nWe block the remaining UV photons by a long-pass filter (LP) and separately image the infrared photons to two spatial light modulators (SLM1 and SLM2) by the combination of lenses L3 (f=150 mm), L4 (f=300 mm) and the beam splitter (BS). \nThe SPDC process conserves optical orbital angular momentum (OAM), denoted by ℓ which can take on any integer value, and hence is theoretically infinite-dimensional (in practice, the apertures in the experiment limit the dimensionality). We use the SLMs to project the entangled state onto the qubit space with ℓ = ±3, i.e. the Bell state |ψ^+⟩ with |0⟩≡|ℓ=-3⟩ and |1⟩≡|ℓ=3⟩.\n\nChoosing a value for |ℓ| is a trade-off between the high extinction of the two qubit states and high coincidence count rates.\nAs the number of measurements is limited to nine settings in our experiment, we prioritised higher extinction, while compensating for lower rates with longer integration times.\nThe amplitude of the individual contributions of the two-qubit state is balanced via angle tuning of the BBO crystal <cit.>.\n\nWe implement each element Π_i of the trine POVM of Eq.(<ref>) by programming an appropriate hologram onto the SLMs. The photons reflected from the SLM are coupled to single-mode fibres via lenses L5 and L6. The single-mode fibres are then connected to high-efficiency superconducting nanowire single-photon detectors (SNSPDs). The probability of a party going to a particular restaurant is proportional to the probability of the outcomes of the POVM which can then be obtained from photon counts. To get the joint probability, we record the coincidence count (C_ij) between Alice's ith and Bob's jth measurement outcome.  This is done via a time-tagging module (TT20, Swabian Instruments) by integrating for 3600 seconds per data point. We normalise the coincidence counts to evaluate the joint probability P(ij) for Alice and Bob going to the i^th and j^th restaurant, i.e., P(ij)=C_ij/∑_i,jC_ij and evaluate the payoff of Eq. (<ref>).\n\n\nThe entangled photons produced by SPDC are in the state |ψ^+⟩, which turns out to be the |ψ^-⟩ state when applied σ_z-rotation to one of the photons. Alternatively, we program the hologram for measuring σ_z Π_i σ_z for one of the photons, where Π_i's are the POVM-elements as defined in Eq.(<ref>). In the same manner, for the noisy case where the quantum coin is in the noisy state of Eq. (<ref>), instead of generating 𝒲_p, we add the noise to the measurements. The state 𝒲_p signifies that one of the subsystems of the singlet state |ψ^-⟩ undergoes a depolarising channel of strength p, i.e., the state remains unchanged with a probability (1+3p)/4 or undergoes any of the three Pauli rotations, each with a probability (1-p)/4. In our experiment, we introduce this depolarising channel in the measurement settings by implementing the POVM-elements Π_i's affected by the noise. This can be done by measuring {Π_i} with a probability of (1+3p)/4 and measuring {σ_j Π_i σ_j} with a probability of (1-p)/4, where {σ_j} represent the Pauli operations. Experimentally we implement this noisy POVM by performing a weighted time average on the relevant measurements. For a total acquisition time of T, we measure {Π_i} for a time duration of T(1+3p)/4 and measure {σ_j Π_i σ_j} for a time duration of T(1-p)/4 each. Thus the temporal degree of freedom is used as pointers for the Kraus-operators of the depolarising channel, and time-averaging erases this pointer information leading to a statistical mixture of the Kraus-operators <cit.>. \n\n\nResults obtained in the experiment are depicted in Fig. <ref>. \nThe payoffs from the probabilities obtained from our experiment are all above the classical limit of 0.125 (dashed green line) for p>0.6, with the highest value being 0.150±0.003 obtained for the noiseless case.  The experimental payoffs as a function of the noise (denoted by the depolarisation strength p are given by the blue dots.  The ideal payoffs are given by the dash-dotted orange line (i.e. if we have a perfect maximally entangled state for the correlated coins, and perfect POVMs). The discrepancies between the experiment and the ideal case can be accounted for by our imperfect entangled state, the purple solid line is the expected payoff given the entangled state that we obtained from SPDC (with 97.0% fidelity to |ψ^+⟩ and purity of 95.2%). Nevertheless, our experiment firmly establishes a quantum advantage in correlated coin-tossing even with a significant amount of noise. Apart from establishing the advantage in genrating shared randomness our experiment also has another interesting implication as it constitutes a semi-device independent certification of non-projective measurement.\n\n\n\n§ SEMI-DEVICE INDEPENDENT CERTIFICATION OF NON-PROJECTIVE MEASUREMENTS\n \nA quantum measurement is most generally described by a POVM, which is a collection of positive semidefinite operators {e_i}_i=1^k, with ∑_ie_i=𝐈_d, where 𝐈_d is the identity operator acting on the Hilbert space ℂ^d associated with the system <cit.>. Projective measurements are special cases, where the e_i's correspond to mutually orthogonal projectors π_i's. For a qubit, such a measurement can have only two outcomes: {π_i:=|ψ_i⟩⟨ψ_i| | ⟨ψ_i|ψ_j⟩=δ_ij   i,j=0,1}. A k-outcome POVM {e_i}_i=1^k will be called projective simulable if the outcome probabilities of the POVM elements can be obtained by coarse-graining the outcome probabilities of some d-outcome projective measurement for any d<k, i.e., ∀ i∈[1,k], e_i=∑_j P_ijπ_j, with {π_j}_j∈[1,d] being a d-outcome projective measurement and {P_ij}_i denoting probability distributions. For instance, the unsharp qubit measurement σ_n̂(λ)≡{1/2(𝐈_2±λn̂.σ) | λ∈(0,1)} can be simulated through the projective measurement σ_n̂≡{1/2(𝐈_2±n̂.σ)}, since 1/2(𝐈_2±λn̂.σ)=1+λ/4(𝐈_2±n̂.σ)+1-λ/4(𝐈_2∓n̂.σ) <cit.>. Not all POVMs are projective simulable and such measurements are known to be useful for a number of information-theoretic tasks <cit.>. Our non-monopolizing social subsidy game provides a way to semi-device independent certification of such qubit measurements. Denoting the set of all qubit projective simulable measurements as 𝔓𝔖(2), the result is formally stated as the following proposition. \nThe maximum payoff ℛ_max^𝔓𝔖(2)(3) of the game G(3), achievable when the players are restricted to perform measurement from the set 𝔓𝔖(2), is upper bounded by ℛ_max^ℭ(2)(3).\n\nThe claim of Proposition <ref> follows from the fact that given dimension d of the local sub-systems, the joint outcome probabilities obtained from any arbitrary quantum state and projective measurement are the diagonal elements of the density matrix (the state) when written in the same basis as the projective measurement. Thus the same statistics can also be obtained from a classically correlated (diagonal) state and measurement on the computational basis. \n\nA payoff higher than the maximum classical payoff, therefore, certifies that the qubit measurements performed by the players are not projective simulable <cit.>. We highlight that this certification technique is semi-device- independent, with the experimenter requiring only the knowledge of the local dimension (in this case d=2) of the state shared between them. As shown in <cit.> certification of POVM is possible even in a device-independent manner. However, Such a device-independent certification  demands a violation of suitably designed Bell-type inequality, and hence requires each of the parties involved in the Bell test to randomly perform incompatible measurements on their part of the shared system. Note that the technique of <cit.> is a detection of non-projective measurement only if subsystem dimension d=2, which is further guaranteed by a CHSH violation. In contrast, our semi-device-independent scheme requires a single measurement device for each of the parties, getting rid of the seed randomness in inputs to the measurement devices.  \n\n\n\n§ DISCUSSIONS\n\n\nTests of the quantum nature of physical systems are complicated by the requirement of randomness in the inputs to such tests. For example, the true randomness that quantum systems are known to exhibit can only be certified in a device-independent manner using Bell's theorem <cit.>, which in turn needs true randomness (however small) in the inputs <cit.>– at least qualitatively the argument is circular. The quantum advantage for shared randomness processing that we experimentally demonstrate in this paper is important as it provides a way to test non-classical correlations without the need for true randomness—the only test of this kind. Our method certifying both non-classical correlations and generalised measurements is semi-device-independent, requiring only knowledge of the dimensionality of the subsystem.   We show that a two-qubit system prepared in a maximally entangled state can yield some desired correlated coin state that is  impossible to obtain from any two 2-level correlated classical coins, leading to a higher payoff in our two-party game.  \n\nIn contrast to the advantage in randomness processing demonstrated in <cit.> which involves the probability distribution of one random variable, our work focuses on a new kind of quantum advantage in generating shared randomness between two distant parties, involving two random variables and their joint probability distributions.  This latter quantum advantage will find use in distributed computational tasks, as in the example of the game we show here. Our work sets the stage for further studies of quantum advantage in multiparty shared randomness processing for qubits or even higher-dimensional systems. Given that randomness processing is an important computational primitive, we envision our work will be useful for information processing in future quantum networks. \n \n\n\nAcknowledgements–\nWe thank Valerio Scarani for helpful discussions. SSB acknowledges support from the Foundation for Polish Science (IRAP project, ICTQT, contract no. MAB/2018/5, co-financed by EU within Smart Growth Operational Programme). This research was supported by the Australian Research Council Centre of Excellence for Engineered Quantum Systems (EQUS, CE170100009) and Discovery Project (DP200102273). MB acknowledges funding from the National Mission in Interdisciplinary Cyber-Physical systems from the Department of Science and Technology through the I-HUB Quantum Technology Foundation (Grant no: I-HUB/PDF/2021-22/008),  support through the research grant of INSPIRE Faculty fellowship from the Department of Science and Technology, Government of India, and the start-up research grant from SERB, Department of Science and Technology (Grant no: SRG/2021/000267). JR is supported by a Westpac Bicentennial Foundation Research Fellowship.\n\n\n\n\n§ APPENDIX\n\n\n\n\n§ (A) PROOF OF PROPOSITION <REF>\n\n\n\nFirst, note that both ΘC(2→ d) and ΘQ(2→ d) consist of valid probability vectors in ℭ(d), by definition. Second, to show that ΘC(2→ d)⊆ΘQ(2→ d), we need to show that for every choice of classically correlated coin states in ℭ^2 and stochastic map S_A^2→ d and S_B^2→ d for Alice and Bob respectively, there exist two-qubit states in 𝔔(2) and d outcome qubit POVMs such that the final joint probability of Alice's and Bob's outcomes are the same in both cases. \n\nLet us denote an arbitrary state in ℭ(2) as a column vector\n\n    𝒞(2)   =(a_00,a_01,a_10,a_11)^T,\n    \n    a_ij≥ 0,    ∀ i,j∈{0,1}, & ∑_i,j a_ij=1,\n\nand stochastic matrices \n\n    S_A^2→ d=(P_k,i)_k= 0,…,d-1 \n     i=0,1,    S_B^2→ d=(Q_l,j)_l= 0,…,d-1 \n     j=0,1,\n     \n    P_k,i,Q_l,j≥0,  ∑_kP_ki=1=∑_lQ_lj.\n \n The resulting coin state is given by,\n \n    𝒞'(d)=S_A^2→ d⊗ S_B^2→ d [𝒞(2)].\n\nThe proof is by construction: the two-d-coin state 𝒞'(d) can also be obtained from the operators \n \n    ρ=∑_i,j=0,1a_ij|ij⟩⟨ ij|,               \n       e_A^k=∑_iP_k,i|i⟩⟨ i|,      e_B^l=∑_jP_l,j|j⟩⟨ j|,\n      𝒞'(d)=(Tr[ρ (e_A^k⊗ e_B^l)])_k,l.\n\n Now it only remains to show that ρ is a valid two qubit state and {e_A^k}_k=0^d-1 and {e_B^l}_k=0^d-1 are valid POVMs. First, we observe that Eq. (<ref>) implies that ρ≥0 (positive semi-definite), and Tr[ρ]=∑_i,j a_ij=1 (unit trace). From Eq. (<ref>) we have, e_A^k≥0, e_B^l≥0 for all k,l={0,…,d-1} (positivity) and ∑_ke_A^k=∑_k∑_iP_k,i|i⟩⟨ i|=∑_i(∑_kP_k,i)|i⟩⟨ i|=∑_i|i⟩⟨ i|=𝕀 (normalization). Similarly, ∑_le_B^l=∑_l∑_jP_l,j|j⟩⟨ j|=∑_j(∑_lP_l,j)|j⟩⟨ j|=∑_j|j⟩⟨ j|=𝕀. Hence, this construction leads to the fact that all d-outcome joint outcome probabilities obtained by Alice and Bob, when accessing a classical source of shared randomness of local dimension 2, can also be obtained with a two-qubit state and d-outcome POVMs.      \n\n\n\n\n§ (B) PLAYING THE GAME 𝔾(3) WITH A ℭ(2) COIN\n\nWe will first show that the game 𝔾(3) can not be perfectly won if Alice and Bob share any of the two-2-coin state from the set ℭ(2). As already discussed in the main manuscript, the perfect winning strategy in 𝔾(3) game demands Alice and Bob to share the coin state 𝒞_ac(3)∈ℭ(3). Our aim is to show that the coin state 𝒞_ac(3) does not belong to the set ΘC(2→ 3), a subset of ℭ(3) that can be obtained from the set of two-2-coin states ℭ(2) by applying free local stochastic maps S_A/B^2→ 3 on Alice's and Bob's part of the states. Let they start with an arbitrary state in ℭ(2): \n\n    𝒞(2)   =(a_00,a_01,a_10,a_11)^T,\n    \n    a_ij≥ 0,    ∀ i,j∈{0,1}, & ∑_i,j a_ij=1.\n\nAlice and Bob apply the following local stochastic maps on their respective part of the coin state,\n\n    S_A^2→ 3=\n      [ [ P_00 P_01; P_10 P_11; P_20 P_21 ]],    S_B^2→ 3=\n      [ [ Q_00 Q_01; Q_10 Q_11; Q_20 Q_21;      ]];\n     \n    P_ij,Q_ij≥0,  ∑_iP_ij=1=∑_iQ_ij.\n\nThe resulting coin state is given by,\n\n    𝒞'(3)= S_A^2→ 3⊗ S_B^2→ 3 [𝒞(2)].\n\nComparing the state in Eq. (<ref>) with 𝒞_ac(3):=1/6(0,1,1,1,0,1,1,1,0)^T, we obtain the following equations\n\n\n\n    a_00 P_00 Q_00 + a_10 P_01 Q_00 + a_01 P_00 Q_01 + a_11 P_01 Q_01   = 0,\n    \n      a_00 P_10 Q_10 + a_10 P_11 Q_10 + a_01 P_10 Q_11 + a_11 P_11 Q_11   = 0, \n    \n      a_00 P_20 Q_20 + \n      a_10 P_21 Q_20 + \n      a_01 P_20 Q_21 + a_11 P_21 Q_21   = 0, \n    \n      a_00 P_00 Q_10 + a_10 P_01 Q_10 + a_01 P_00 Q_11 + a_11 P_01 Q_11   = 1/6, \n    \n      a_00 P_00 Q_20 + a_10 P_01 Q_20 + a_01 P_00 Q_21 + a_11 P_01 Q_21   = 1/6, \n    \n      a_00 P_10 Q_00 + a_10 P_11 Q_00 + a_01 P_10 Q_01 + a_11 P_11 Q_01   = 1/6, \n    \n      a_00 P_10 Q_20 + a_10 P_11 Q_20 + a_01 P_10 Q_21 + a_11 P_11 Q_21   = 1/6,\n    \n      a_00 P_20 Q_00 + a_10 P_21 Q_00 + a_01 P_20 Q_01 + a_11 P_21 Q_01   = 1/6, \n    \n      a_00 P_20 Q_10 + a_10 P_21 Q_10 + a_01 P_20 Q_11 + a_11 P_21 Q_11   = 1/6.\n\n\nNow the following cases are possible:\n\n\n  Case (A): Let us assume a_ij≠ 0 for all i,j. From Eq. (<ref>) we must have the following minimum sets of parameters with zero value:\n\n    (A0): {P_00,P_01}=0,     (A1): {Q_00,Q_01}=0.\n\nCondition (A0) contradicts Eq. (<ref>) since it implies that the right-hand side of Eq. (<ref>) is zero. Similarly, conditions (A1) contradicts Eq. (<ref>).\n\n  Case (B): Let us assume a_00=0 and a_ij≠ 0 for ij≠ 00. From Eq. (<ref>) we must have the following:\n\n    (B0): {P_00,P_01}=0,     (B1): {P_01,Q_01}=0.\n\nSame as the previous case, Condition (B0) contradicts Eq. (<ref>). From Eq. (<ref>), Condition (B1) implies P_21=P_11=1/2. Now Eq. (<ref>) along with this condition implies \n\n    (B2): {Q_10,Q_11}=0.\n\nFinally, condition (B2) contradicts Eq. (<ref>).\n\n  Case (C): Let us assume a_00=a_01=0 and a_10,a_11≠ 0. From Eq. (<ref>) and (<ref>) we must have the following:\n\n    (C0): {P_01,P_11}=0,     (C1): {P_01,Q_10,Q_11}=0.\n\nBoth Conditions (C0) and (C1) contradicts Eq. (<ref>). \n\n  Case (D): Let us assume a_00=a_01=a_10=0 and a_11≠ 0. From Eq. (<ref>) and (<ref>) we must have the following:\n\n    (D0): {P_01,P_11}=0,     (D1): {Q_01,Q_11}=0,\n     (D2): {P_01,Q_11}=0,     (D3): {P_11,Q_01}=0.\n\nBoth Conditions (D0) and (D1) contradicts Eq. (<ref>). Condition (D2) contradicts (<ref>). Similarly, Condition (D3) contradicts (<ref>). \n\nThus in every case, we find a contradiction to the set of Equations (<ref>-<ref>), leading to the fact that the game 𝔾(3) can not be perfectly won if Alice and Bob share any of the two-2-coin state from the set ℭ(2). \n\nA natural question is given a two-2-coin what will be the maximum success probability achievable in the game 𝔾(3). As shown in <cit.>, this boils down to solving the following optimization problem.  Given\na two-2-coin, 𝒞(2)≡ (p(11), p(12), p(21 , p(22))^T, Alice and Bob can obtain a two-3-coin states 𝒞(3)≡ q(11), q(12),q(13), q(21 , q(22),q(23),q(31),q(32),q(33))^T by applying local stochastic maps 𝒮_A^2→3 and 𝒮_B^2→3 on their respective part of the two-2-coin, and aim to maximize the payoff in 𝔾(3) game, i.e.,\n\n    ℛ_max^ℭ(2)(3)   =  q(i≠j)\n             𝒞(2)∈ℭ(2)\n             𝒮_A^2→3⊗𝒮_B^2→3\n             q(i≠j)≤ q(i^'≠j^')\n              i≠i^'  j≠j^'\n\nAs it turns out, the maximum payoff Alice and Bob can achieve is 1/8. One possible optimal classical strategy is the following: Alice and Bob start with a shared coin 𝒞_α(2):=(α,0,0,α)^T∈ℭ(2), with α=1/2; and apply local stochastic maps S^2→3_A=[ 0 α α; α 0 α ]^T and S^2→3_B=[ α 0 α; 0 α α ]^T on their respective parts. This results in the following ℭ(3) coin \n\n    [[   0 1/2; 1/2   0; 1/2 1/2 ]⊗[ 1/2   0;   0 1/2; 1/2 1/2 ]][ 1/2;   0;   0; 1/2 ]=1/8[ 0; 1; 1; 1; 0; 1; 1; 1; 2 ],\n\nwhich assures the payoff ℛ^ℭ(2)_max(3)=1/8.\n\n99\nEinstein1935 A. Einstein, B. Podolsky, and N. Rosen; Can Quantum-Mechanical Description of Physical Reality Be Considered Complete?\nhttps://doi.org/10.1103/PhysRev.47.777Phys. Rev. 47, 777 (1935).\n\nSchrodinger1936 E. Schrödinger; Probability relations between separated systems, \nhttps://doi:10.1017/s0305004100019137Math. Proc. Camb. Philos. Soc. 32, 446 (1936).\n\nBell1966 J. S. Bell; On the Problem of Hidden Variables in Quantum Mechanics,\nhttps://doi.org/10.1103/RevModPhys.38.447Rev. Mod. Phys. 38, 447 (1966).\n\nClauser1969 J. F. Clauser, M. A. Horne, A. Shimony, and R. A. Holt; Proposed Experiment to Test Local Hidden-Variable Theories,\nhttps://doi.org/10.1103/PhysRevLett.23.880Phys. Rev. Lett. 23, 880 (1969).\n\nAspect1982 A. Aspect, J. Dalibard, and G. Roger; Experimental Test of Bell's Inequalities Using Time-Varying Analyzers,\nhttps://doi.org/10.1103/PhysRevLett.49.1804Phys. Rev. Lett. 49, 1804 (1982).\n\nPan1998 J-W Pan, D. Bouwmeester, H. Weinfurter, and A. Zeilinger; Experimental Entanglement Swapping: Entangling Photons That Never Interacted,\nhttps://doi.org/10.1103/PhysRevLett.80.3891Phys. Rev. Lett. 80, 3891 (1998).\n\nBrassard1999 G. Brassard, R. Cleve, and A. Tapp; Cost of Exactly Simulating Quantum Entanglement with Classical Communication,\nhttps://doi.org/10.1103/PhysRevLett.83.1874Phys. Rev. Lett. 83, 1874 (1999).\n\nBrunner2014 N. Brunner, D. Cavalcanti, S. Pironio, V. Scarani, and S. Wehner; Bell nonlocality,\nhttps://doi.org/10.1103/RevModPhys.86.419Rev. Mod. Phys. 86, 419 (2014).\n\nPawlowski2009 M. Pawłowski, T. Paterek, D. Kaszlikowski, V. Scarani, A. Winter, and M. Żukowski, Information causality as a physical principle,\nhttps://doi.org/10.1038/nature08400Nature 461, 1101 (2009).\n\nPawlowski2010 M. Pawłowski and M. Żukowski; Entanglement-assisted random access codes,\nhttps://doi.org/10.1103/PhysRevA.81.042326Phys. Rev. A 81, 042326 (2010).\n\nFischer2020 O. Fischer, R. Oshman, and U. Zwick; Public vs. private randomness in simultaneous multi-party communication complexity; \nhttps://doi.org/10.1016/j.tcs.2018.04.032Theor. Comput. Sci. 810, 72 (2020).\n\n\nBogdanov2011 A. Bogdanov and E. Mossel; On Extracting Common Random Bits From Correlated Sources; https://doi.org/10.1109/TIT.2011.2134067IEEE Trans. Inf. Theory 57, 6351-6355 (2011).\n\nGhazi2018 Badih Ghazi and T.S. Jayram; Resource-Efficient Common Randomness and Secret-Key Schemes; https://doi.org/10.1137/1.9781611975031.120Proceedings of the 2018 Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), Pages 1834-1853 (2018).\n\nMaurer1993 U. M. Maurer; Secret key agreement by public discussion from common information; https://doi.org/10.1109/18.256484IEEE Trans. Inf. Theory 39, 733-742 (1993).\n\nBennett1988 C. H. Bennett, G. Brassard, and J. Robert; Privacy amplification by public discussion, \nhttps://doi.org/10.1137/0217014SIAM Journal on Computing 17, 210 (1988).\n\nBennett1995 C.H. Bennett, G. Brassard, C. Crepeau, and U.M. Maurer, Generalized privacy amplification,\nhttps://doi.org/10.1109/18.476316IEEE Trans. Inf. Theory 41, 1915 (1995).\n\nNewman1996 I. Newman and M. Szegedy; Public vs. private coin flips in one round communication games (extended abstract), STOC '96: Proceedings of the twenty-eighth annual ACM symposium on Theory of Computing, \nhttps://doi.org/10.1145/237814.238004Pages 561–570 (1996).\n\nBabai L. Babai and P.G. Kimmel, Randomized simultaneous messages: solution of a problem of yao in communication complexity, Proceedings of Computational Complexity, \nhttps://doi.org/10.1109/CCC.1997.61231920^th Annual IEEE Conference, pp. 239-246 (1997).\n\nAhlswede1993 R. Ahlswede and I. Csiszar, Common randomness in information theory and cryptography. I. secret sharing,\nhttps://doi.org/10.1109/18.243431IEEE Trans. Inf. Theory 39, 1121 (1993).\n\nToner2003 B. F. Toner and D. Bacon, Communication cost of simulating bell correlations, \nhttps://doi.org/10.1103/PhysRevLett.91.187904Phys. Rev. Lett. 91, 187904 (2003).\n\nAumann1987 R. J. Aumann, Correlated equilibrium as an expression of bayesian rationality,\nhttps://doi.org/10.2307/1911154Econometrica 55, 1 (1987).\n\nCubitt11 T. S. Cubitt, D. Leung, W. Matthews, A. Winter; Zero-error channel capacity and simulation assisted by non-local correlations,\nhttps://doi.org/10.1109/TIT.2011.2159047\nIEEE Trans. Info. Theory 57, 5509 (2011).\n\nBennett14 C. H. Bennett, I. Devetak, A. W. Harrow, P. W. Shor, A.Winter; Quantum Reverse Shannon Theorem, \nhttps://doi.org/10.1109/TIT.2014.2309968IEEE Trans. Inf. Theory 60, 2926 (2014).\n\nBrunner2013 N. Brunner and N. Linden, Connection between bell nonlocality and bayesian game theory,\nhttps://doi.org/10.1038/ncomms3057Nat. Commun. 4, 2057 (2013).\n\nRoy2016 A. Roy, A. Mukherjee, T. Guha, S. Ghosh, S. S. Bhattacharya, and M. Banik; Nonlocal correlations: Fair and unfair strategies in bayesian games,\nhttps://doi.org/10.1103/PhysRevA.94.032120Phys. Rev. A 94, 032120 (2016).\n\nBanik2019 M. Banik, S. S. Bhattacharya, N. Ganguly, T. Guha, A. Mukherjee, A. Rai, and A. Roy,  Two-qubit pure entanglement as optimal social welfare resource in bayesian game, \nhttps://doi.org/10.22331/q-2019-09-09-185Quantum 3, 185 (2019).\n\nCanonne2017 C. L. Canonne, V. Guruswami, R. Meka, and M. Sudan; Communication with imperfectly shared randomness, https://doi.org/10.1109/TIT.2017.2734103IEEE Trans. Inf. Theory 63, 6799 (2017).\n\nPatra2022 R. K. Patra, S. Gopalkrishna Naik, E. P. Lobo, S. Sen, T. Guha, S. S. Bhattacharya, M. Alimuddin, M. Banik; Classical superdense coding and communication advantage of a single quantum,\nhttps://doi.org/10.48550/arXiv.2202.06796arXiv:2202.06796 [quant-ph].\n\nHall2010 M. J. W. Hall; Local Deterministic Model of Singlet State Correlations Based on Relaxing Measurement Independence,\nhttps://doi.org/10.1103/PhysRevLett.105.250404Phys. Rev. Lett. 105, 250404 (2010).\n\nBarrett2011 J. Barrett and N. Gisin; How Much Measurement Independence Is Needed to Demonstrate Nonlocality?\nhttps://doi.org/10.1103/PhysRevLett.106.100406Phys. Rev. Lett. 106, 100406 (2011).\n\nBanik2013(1) M. Banik; Lack of measurement independence can simulate quantum correlations even when signaling can not,\nhttps://doi.org/10.1103/PhysRevA.88.032118Phys. Rev. A 88, 032118 (2013).\n\nGuha2021 T. Guha, M. Alimuddin, S. Rout, A. Mukherjee, S. S. Bhattacharya, and M. Banik; Quantum Advantage for Shared Randomness Generation,\nhttps://doi.org/10.22331/q-2021-10-27-569Quantum 5, 569 (2021).\n\nKraus1983 K. Kraus; https://doi.org/10.1007/3-540-12732-1States, Effects, and Operations Fundamental Notions of Quantum Theory,\nedited by K. Kraus, A. Böhm, J. D. Dollard, and W. H. Wootters (Springer Berlin\nHeidelberg, 1983).\n\nBusch1986 P. Busch; Unsharp reality and joint measurements for spin observables, \nhttps://doi.org/10.1103/PhysRevD.33.2253Phys. Rev. D 33, 2253 (1986).\n\nPeres1995  A. Peres; Quantum Theory: Concepts and Methods, Kluwer Academic Publishers 1995); ISBN 0-7923-2549-4.\n\nChitambar2019 E. Chitambar and G. Gour; Quantum resource theories, \nhttps://doi.org/10.1103/RevModPhys.91.025001Rev. Mod. Phys. 91, 025001 (2019).\n\nCover2006 T. M. Cover and J. A. Thomas; Elements of Information Theory (2 ed.), Wiley (2006).\n\nMarkov2003 Markov Chains. In: Applied Probability and Queues. Stochastic Modelling and Applied Probability, \nhttps://doi.org/10.1007/0-387-21525-5_1vol 51. Springer, New York, NY (2003). \n\nBarrett2007 J. Barrett; Information processing in generalized probabilistic theories,\nhttps://doi.org/10.1103/PhysRevA.75.032304Phys. Rev. A 75, 032304 (2007).\n\nMairOAM A. Mair, A. Vaziri, G. Weihs and A. Zeilinger; Entanglement of the orbital angular momentum states of photons, https://doi.org/10.1038/35085529Nature 412, 313 (2001).\n\nRomero2012 J. Romero and D. Giovannini and S. Franke-Arnold and S. M. Barnett and M. J. Padgett; Increasing the dimension in high-dimensional two-photon orbital angular momentum entanglement, https://doi.org/10.1103/PhysRevA.86.012334Physical Review A 7, 012334 (2012).\n\nShaham_controllable_depol A. Shaham and H. S. Eisenberg; Realizing controllable depolarization in photonic quantum-information channels, https://doi.org/10.1103/PhysRevA.83.022303Phys. Rev. A 83, 022303 (2010).\n\nBusch1995  P. Busch, M. Grabowski, and P. J. Lahti; Operational\nQuantum Physics (Springer, Berlin, 1995); P. Busch, P. J. Lahti, P. Mittelstaedt; The Quantum Theory of Measurement: 2 (Lecture Notes in Physics Monographs) (2013).\n\nBanik2013 M. Banik, Md. R. Gazi, S. Ghosh, and G. Kar; Degree of complementarity determines the nonlocality in quantum mechanics,\nhttps://doi.org/10.1103/PhysRevA.87.052125Phys. Rev. A 87, 052125 (2013).\n\nIvanovic87 I. D. Ivanovic; How to differentiate between nonorthogonal states, https://doi.org/10.1016/0375-9601(87)90222-2Phys. Lett. A 123, 257 (1987).\n\nPeres88 A. Peres; How to differentiate between nonorthogonal states, https://doi.org/10.1016/0375-9601(88)91034-1Phys. Lett. A 128, 19 (1988).\n\nVertesi10 T. Vértesi and E. Bene; Two-qubit Bell inequality for which positive operator-valued measurements are relevant, https://doi.org/10.1103/PhysRevA.82.062115Phys. Rev. A 82, 062115 (2010).\n\nAcin16 A. Acín, S. Pironio, T. Vértesi, and P. Wittek; Optimal randomness certification from one entangled bit, \nhttps://doi.org/10.1103/PhysRevA.93.040102Phys. Rev. A 93, 040102 (2016).\n\nDiMario M. T. DiMario and F. E. Becerra;  Demonstration of optimal non-projective measurement of binary coherent states with photon counting, https://doi.org/10.1038/s41534-022-00595-3npj Quantum Inf 8, 84 (2022).\n\nSSB S. S. Bhattacharya, S. Rout, and P Horodecki, In preparation.\n\nGomez16 E. S. Gómez, S. Gómez, P. González, G. Cañas, J. F. Barra, A. Delgado, G. B. Xavier, A. Cabello, M. Kleinmann, T. Vértesi, and G. Lima; Device-Independent Certification of a Nonprojective Qubit Measurement, \nhttps://doi.org/10.1103/PhysRevLett.117.260401Phys. Rev. Lett. 117, 260401 (2016).\n\nJennewein2000 T. Jennewein, U. Achleitner, G. Weihs, H. Weinfurter, and A. Zeilinger; A fast and compact quantum random number generator,\nhttps://doi.org/10.1063/1.1150518Rev. Sci. Instrum. 71, 1675 (2000).\n\nStefanov2000 A. Stefanov, N. Gisin, O. Guinnard, L. Guinnard, and H. Zbinden; Optical quantum random number generator,\nhttps://doi.org/10.1080/09500340008233380J. Mod. Opt. 47, 595 (2000).\n\nPironio2010 S. Pironio, A. Acín, S. Massar, A. Boyer de la Giroday, D. N. Matsukevich, P. Maunz, S. Olmschenk, D. Hayes, L. Luo, T. A. Manning, and C. Monroe; Random numbers certified by Bell’s theorem,\nhttps://doi.org/10.1038/nature09008Nature 464, 1021 (2010).\n\n\nPutz2014 Pütz, Gilles, Rosset, Denis, Barnea, Tomer Jack, Liang, Yeong-Cherng and Gisin, Nicolas; Arbitrarily Small Amount of Measurement Independence Is Sufficient to Manifest Quantum Nonlocality, https://link.aps.org/doi/10.1103/PhysRevLett.113.190402Phys. Rev. Lett. 113, 190402 (2014).\n\nColbeck2012 R. Colbeck and R. Renner; Free randomness can be amplified,\nhttps://doi.org/10.1038/nphys2300Nat. Phys. 8, 450 (2012). \n\nDale2015 H. Dale, D. Jennings, T. Rudolph; Provable quantum advantage in randomness processing,\nhttps://doi.org/10.1038/ncomms9203Nat. Commun. 6, 8203 (2015).\n\nPatel2019 R. B. Patel, T. Rudolph, and G. J. Pryde; An Experimental Quantum Bernoulli Factory, \nhttps://doi.org/10.1126/sciadv.aau6668Sci. Adv. 5, eaau6668 (2019).\n\n\n\n\n"}