{"entry_id": "http://arxiv.org/abs/2303.06989v1", "published": "20230313104341", "title": "Fabrication of Nb and MoGe SQUID-on-tip probes by magnetron sputtering", "authors": ["G. Romagnoli", "E. Marchiori", "K. Bagani", "M. Poggio"], "primary_category": "cond-mat.supr-con", "categories": ["cond-mat.supr-con", "cond-mat.mes-hall"], "text": "\n\n\n   We demonstrate the fabrication of scanning superconducting quantum interference devices (SQUIDs) on the apex of sharp quartz scanning probes – known as SQUID-on-tip probes – using conventional magnetron sputtering. We produce and characterize SQUID-on-tips made of both Nb and MoGe with effective diameters ranging from 50 to 80 nm, magnetic flux noise down to 300Φ_0/√(), and operating fields as high as 2.5. Compared to the SQUID-on-tip fabrication techniques used until now, including thermal evaporation and collimated sputtering, this simplified method facilitates experimentation with different materials, potentially expanding the functionality and operating conditions of these sensitive nanometer-scale scanning probes.\n\n\n\n\n\n Department of Physics, University of Basel, 4056     Basel, Switzerland\n Department of Physics, University of Basel, 4056     Basel, Switzerland\n Department of Physics, University of Basel, 4056     Basel, Switzerland\n Department of Physics, University of\n  Basel, 4056 Basel, Switzerland Swiss Nanoscience\n  Institute, University of Basel, 4056 Basel, Switzerland\nmartino.poggio@unibas.ch\nFabrication of Nb and MoGe SQUID-on-tip probes by magnetron sputtering\n    M. Poggio\n    March 30, 2023\n======================================================================\n\n\n\nScanning superconducting quantum interference device (SQUID) microscopy (SSM) is among the most sensitive and least invasive methods for imaging subtle magnetic field patterns near a sample surface <cit.>. In recent years, SSM has been used to study microscopic properties of superconducting devices <cit.>, nanomagnets <cit.>, magnetic oxides <cit.>, two-dimensional materials <cit.>, quantum wells <cit.>, and topological states matter <cit.>. In general, in order to allow for both high spatial resolution and high sensitivity magnetic imaging, the probe must be miniaturized and brought as close to the sample as possible, while retaining high flux sensitivity. A number of strategies for realizing such SSM probes exist, including techniques based on planar lithography <cit.>, focused ion beam patterning of a cantilever coated with a superconducting film <cit.>, and self-aligned deposition on a quartz pipette <cit.>. The latter technique, used to produce a so-called SQUID-on-tip, combines the smallest SQUID sensors, down to 39nm in diameter, with the highest magnetic flux sensitivity <cit.>. In addition, they have been demonstrated to operate under magnetic fields up to 5 <cit.> and are excellent probes of local dissipation, due to the exquisite temperature sensitivity of the SQUID's Josephson junctions (JJs) <cit.>.  \n\nThese probes were first fabricated in 2010 by thermally evaporating Al on the apex of a pulled quartz capillary according to a three-step self-aligned deposition method pioneered by Finkler et al. <cit.>. In 2014, Vasyukov et al. realized Pb devices with diameters of 46nm and flux noise of 50nΦ_0/√() <cit.>. The fabrication process relies on directional vapor deposition techniques, such as thermal or electron beam evaporation. Because of fractionation, this type of evaporation is unsuitable for depositing alloys, limiting the resulting SQUID-on-tip probes to the elemental superconductors. Despite the excellent properties of such SQUID-on-tip probes, most consist of a thin superconducting film of, e.g., Pb, In, or Sn, which rapidly oxidizes under ambient conditions <cit.>. This reactivity complicates the mounting, handling, and storage of these probes, making them difficult to use and limiting their widespread adoption. In addition, the high surface mobility of these materials requires cryogenic cooling of the pulled capillary during thermal evaporation in order to limit island formation. SQUID-on-tip probes made of ambient-stable Nb have been fabricated using electron beam evaporation by Vasyukov et al. <cit.> without cryogenic cooling of the capillary. In this process, an additional aluminum oxide buffer layer was deposited on the quartz capillary to prevent contamination of the Nb film. Although these probes are more robust than SQUID-on-tip probes of other elemental superconductors, the evaporated Nb devices exhibit significantly higher magnetic flux noise of 3.6Φ_0/√().\n\nIn 2019, Bagani et al. demonstrated a SQUID-on-tip made of a superconducting alloy, MoRe, using a fabrication technique based on collimated magnetron sputtering <cit.>. Magnetron sputtering allows for the high-quality deposition of a wide range of superconducting materials beyond elemental superconductors, including alloys and multilayer structures. To impose directionality on the typically isotropic deposition of conventional magnetron sputtering, the sputtering source is enclosed in a small chamber equipped with a narrow slit. Ar gas is introduced into the small chamber, while the main chamber is kept in an ultrahigh-vacuum (UHV). Sputtered material, along with Ar gas, is forced through the narrow slit due to the pressure difference, resulting in collimated deposition. Although collimation is achieved, a large sputtering rate is required in the small chamber to achieve a useful flux of material from the slit. After just a few depositions, this large rate can lead to electrical shorting of the sputtering source, due to material flaking. As a result, regular opening and cleaning of the small chamber is required, which is detrimental to the achievable vacuum and, ultimately, the quality of the deposited film.\n\n\n\nHere, we demonstrate the fabrication of SQUID-on-tip probes via a simplified magnetron sputtering process, which does not require an additional collimation chamber. Rather, directional deposition is achieved via an appropriately designed tip holder. This solution reduces the required opening of the sputtering chamber, substantially improves film quality, and allows for the exploration of superconducting materials for SQUID-on-tip fabrication. We demonstrate the process by fabricating Nb and MoGe SQUID-on-tip probes, which are less than 100 in diameter, have magnetic flux noise down to 300Φ_0/√(), and operate in fields as high as 2.5. Both the Nb and MoGe probes are stable in ambient conditions, allowing for easy handling and mounting.\n\nWe fabricate SQUID-on-tip probes by depositing a superconducting film onto pulled quartz capillaries. The capillaries, which have an outside diameter of 1 and an inside diameter of 0.4 (Friedrich & Dimmock Inc.), are designed with four grooves, which are equally spaced around the external circumference. Once pulled by a laser-puller (Sutter Instrument P-2000/G), the outer diameter of the sharp tip can be less than 100. As illustrated in Fig. <ref> (d), the grooves are preserved throughout the pulling process and help to define the pattern of the subsequently deposited superconducting film. Even though only two grooves are required for the two superconducting leads, four grooves help to preserve the capillary's circular geometry.\n\nPrior to superconducting film deposition, capillaries are mounted in an electron-beam evaporator, in which a horizontal Ti/Au (2/5) strip is deposited at a distance of 350 from the apex of each tip using a shadow mask. In a finished SQUID-on-tip, this metallic strip works as a resistive shunt of 4–10Ω bridging the two superconducting electrodes, suppressing undesirable hysteresis, and protecting the device from electrostatic discharge during handling.\n\nNext, each capillary is mounted in a dedicated UHV magnetron sputtering system with a in situ rotatable holder and two commercial sputtering sources (AJA A320). The main chamber is pumped out and baked to reach a base pressure of approximately 2d-9. During deposition, a continuous flow of 30sccm Ar gas is supplied to the main chamber, maintaining a constant pressure of 3.5d-3 with less than 70 of DC power required. In this work, the sputtering targets used are Nb (99.99%), Mo_0.79Ge_0.21 (99.95%), and Ti (99.95%). \n\nThe rotatable capillary holder is located approximately 80 from the sputtering target surface and its shape, illustrated in Fig. <ref> (a)-(c), has a considerable impact on the coating process. The plasma generated during the sputtering process, also known as an electrically conducting fluid, bends towards protruding conducting surfaces due to the locally deformed electric potential. The 1 to 2 wide slots machined into the holder are designed to direct the sputtered material onto either one of the two sides or onto the tip of the capillary, depending on the holder's orientation with respect to the sputtering source. As illustrated in Fig. <ref> (a)-(b), in the first two depositions of the process, the holder is oriented such that the capillary is tilted ± 120 from the direction of the sputtering source; in this way, one of its sides is exposed to the plasma represented in purple. These two depositions form the leads of the SQUID. The third deposition, carried out with the tip of the capillary pointing at and exposed to the sputtering source, is shown in Fig. <ref> (c) and produces the SQUID loop at the apex of the capillary.\n\nIn addition to exploiting the directional deposition imposed by the capillary holder, the grooved quartz capillaries favor the formation of a well-defined gap between the two superconducting leads <cit.>. Moreover, the grooves assist in the formation of the two narrow constrictions that form weak-link Josephson junctions – and therefore the SQUID – at the apex of the capillary. \n\nUsing this process, we fabricate both Nb and MoGe SQUID-on-tip probes, which are realized by depositing 25–30 and 35–40 of material at a rate of 3/ in each of the three deposition steps, respectively. The Nb devices also include a 3 base layer of Ti to avoid contamination from the quartz capillary, as well as a 3 capping layer to protect from oxidation. A resulting Nb SQUID-on-tip probe is shown in a scanning electron micrograph (SEM) in Fig. <ref> (e), with a geometrical diameter of 55.\n\n\n\nThe current-voltage characteristics of Nb and MoGe SQUID-on-tip probes are measured at 4.2 and shown in Fig. <ref> at different magnetic fields applied along the probe axis. The electrical circuit used for characterization, illustrated in the inset of Fig. <ref> (b), consists of a voltage source in series with a large bias resistor of 6.1Ω, providing a bias current I_bias = V_b/R_b. A small shunt resistance R_s=3Ω≪ R_b provides an effective bias voltage to the SQUID-on-tip. R_p quantifies the parasitic resistance of the wires and contacts, while R_sh is the resistance of the Ti/Au shunt bridging the superconducting electrodes close to the apex of the tip. The current through the SQUID-on-tip, I_SOT, is measured using a cryogenic SQUID series array amplifier (Magnicon), and the voltage across the SQUID-on-tip, V_SOT, is obtained from V_b according to the electronic circuit.\n\nIn Fig. <ref>(a) and (b), plots of the current as a function of the voltage across the Nb and MoGe SQUID-on-tip probes show the amplitude of the critical current at different applied fields. The current increases until its critical point where the SQUID switches to a non-zero voltage state.\nFor non-hysteretic probe characteristics, i.e. overdamped behavior, the Stewart-McCumber parameter β_c=2π I_cR^2C/Φ_0 has to be less than unity, where I_c is the critical current, R is the normal state resistance, C the self-capacitance of the JJ, and Φ_0 is the flux quantum. We estimate β_c by determining the retrapping current, which we measure by decreasing the applied bias current from the normal state back to the superconducting state. Both probes show slightly overdamped behavior with β_c^Nb≈ 0.93 and β_c^MoGe≈ 0.87, with a critical current I_c of 70 and 48 at zero applied field, respectively.\n\nFig. <ref>(c) and (d) show the quantum interference patterns of the Nb and MoGe SQUID-on-tip probes. From the magnetic-field periodicity of the modulation patterns, we calculate effective SQUID diameters of d=2√(Φ_0/πΔ B) = 48 and 74, for the Nb and MoGe devices, respectively. From these patterns, we also calculate the magnetic response ∂ I_SOT/∂ B of both SQUID-on-tip as a function of bias current I_bias and applied magnetic field B, shown in Fig <ref> (e) and (f). The Nb interference pattern shows a sinusoidal shape and a large modulation depth of I_c(B), resulting in a large magnetic response over a wide field range. The MoGe pattern is less ideal, showing a smaller modulation depth of I_c(B) and consequently a smaller magnetic response, because of the high kinetic inductance of the MoGe film. For optimal SQUID characteristics, the screening parameter β_L=2LI_c/Φ_0 must be close to unity, where L is the inductance of the SQUID loop. Assuming symmetric JJs, we estimate from the modulation of I_c the screening parameter β_L for Nb and MoGe SQUID-on-tips: β_L^Nb≈ 0.66 and β_L^MoGe≈ 2.75. The SQUID loop inductance L=L_g+L_K comprises the geometrical inductance L_g of the SQUID loop and the kinetic inductance L_K. Due to the small loop size, the geometrical contribution can be neglected, while the kinetic contribution depends mostly on the material properties and film thickness. Improving the magnetic response of the MoGe SQUID-on-tip probe would require a superior film quality, potentially realized by annealing the device, which can reduce its kinetic inductance and therefore increase the modulation depth of I_c(B).\n\nThe high magnetic response even at large applied magnetic fields of  2 distinguishes these probes from planar scanning SQUID probes <cit.>, making them particularly useful for measuring high-field condensed matter phenomena.  The geometry of the SQUID-on-tip allows operation in large applied fields, due to the mostly in-plane field experienced by the superconducting leads <cit.>.\nThe Nb SQUID-on-tip presents an extended operation range of 2.5 in comparison to previously reported Nb SQUID-on-tip of 1 range <cit.>. The thin Ti base and capping layers likely lead to the formation of a NbTi alloy, which contributes to a larger H_c2 than expected from a pure Nb thin film. MoGe SQUID-on-tip shows persistent oscillations with a good magnetic response up to 2 and reduced response from there up to 3. The asymmetry in the magnetic response in positive and negative applied fields is due to two weak-link Josephson junctions of slightly different sizes. The MoGe SQUID-on-tip presents a higher magnetic response than the previously reported annealed MoRe SQUID-on-tip of similar loop size <cit.>, however, with reduced applied field operation range.\n\n\n\nThe magnetic flux and field spectral densities of a Nb SQUID-on-tip with effective diameter of 48 are shown in Fig. <ref>(a). They are determined at fixed V_b and at the indicated magnetic fields by measuring the current noise of the probe and taking into account the magnetic response shown in Fig. <ref>(e), as well as the effective SQUID loop area for the flux noise. At lower frequencies the spectrum is dominated by 1/f-noise. In the white noise regime above 10, the magnetic field noise reaches a minimum value of S_B^1/2= 340/√(), which corresponds to a magnetic flux noise of S_Φ^1/2=S_B^1/2(π r^2)= 300Φ_0/√() in low fields. This value is one order of magnitude better than the one previously reported for a Nb SQUID-on-tip <cit.>, likely due to the improved quality of the sputtered versus the evaporated film. At high applied magnetic fields, there is a slight decrease in performance with S_Φ^1/2= 600Φ_0/√(). For some nanometer-scale imaging applications, such as the mapping of defect spins or of weakly magnetic samples, it is important to quantify the spin sensitivity of the probes. In the case of a spin in the center of the SQUID loop oriented perpendicular to it, the spin noise is estimated by S_n^1/2=S_Φ^1/2r/r_e, where r_e is the classical electronic radius <cit.>. From the spectral density of the spin noise, we obtain the limit for spin sensitivity: for the Nb SQUID-on-tip, a base value of S_n^1/2= 2.7μ_B/√() is measured in low fields and 6.6μ_B/√() in higher fields.\n\nThe spectral density of the 74 MoGe SQUID-on-tip in Fig <ref>(b) shows a magnetic field noise of S_B^1/2= 800/√(), corresponding to a magnetic flux noise of S_Φ^1/2= 1.6Φ_0/√() in low applied field, and 3Φ_0/√() in higher fields. The spin noise for MoGe is found to be from S_n^1/2= 20 to 35μ_B/√(), which is comparable to the values reported for the annealed MoRe SQUID-on-tip <cit.>. \n\nWe demonstrate a simplified fabrication of SQUID-on-tip probes made of elemental and composite materials, including multilayered structures, using magnetron sputtering deposition. The technique, which relies on a specially designed deposition holder and grooved capillaries, enabled the fabrication of a Nb SQUID-on-tip with sub-100-nm loop size, improved magnetic flux sensitivity of 300Φ_0/√(), and critical field up to over 2.5 (H_c2), likely due to the Ti base and cap layers. The fabricated devices are robust to ambient conditions, which make them easy to handle and mount. The technique should ease the fabrication of SQUID-on-tip devices from a variety of superconducting alloys and multilayers extending the critical temperature and field capabilities of these probes and facilitating their application to nanometer-scale magnetic and thermal imaging.\n\nWe thank Sascha Martin and his team in the machine workshop of the\nPhysics Department at the University of Basel.  We acknowledge the\nsupport of the Canton Aargau; the Swiss National Science\nFoundation via Project Grant No. 200020-159893 and Sinergia Grant\nNanoskyrmionics (Grant No. CRSII5-171003); the European Commission under H2020 FETOpengrant \"FIBsuperProbes\" (Grant No. 892427); and the University of Basel via Universität Basel Forschungsfonds (Project No. 4637580).\n\nThe authors have no conflicts to disclose.\n\nThe data that support the findings of this study are available from\nthe corresponding author upon reasonable request.\n\n\n\n\n\n\n\n\n\n\n\n20\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[Marchiori et al.(2022)Marchiori, Ceccarelli, Rossi, Lorenzelli, Degen, and Poggio]marchiori_nanoscale_2022\n  author author E. Marchiori, author L. Ceccarelli, author N. Rossi,\n  author L. Lorenzelli, author C. L. Degen, and author M. Poggio, title\n  title Nanoscale magnetic field imaging for 2D\n  materials, https://doi.org/10.1038/s42254-021-00380-9 journal journal Nature Reviews Physics volume 4, pages 49–60 (year\n  2022)NoStop\n[Embon et al.(2015)Embon,\n  Anahory, Suhov, Halbertal,\n  Cuppens, Yakovenko, Uri,\n  Myasoedov, Rappaport, Huber,\n  Gurevich, and Zeldov]embon_Pinning_2015\n  author author L. Embon, author Y. Anahory,\n  author A. Suhov, author D. Halbertal, author\n  J. Cuppens, author A. Yakovenko, author A. Uri, author Y. Myasoedov, author M. L. Rappaport, author M. E. Huber, author A. Gurevich,  and author E. Zeldov,  title title Probing dynamics and pinning\n  of single vortices in superconductors at nanometer scales, https://doi.org/10.1038/srep07598 journal journal Scientific Reports volume 5, pages 7598 (year 2015)NoStop\n[Ceccarelli et al.(2019)Ceccarelli, Vasyukov, Wyss, Romagnoli, Rossi, Moser, and  Poggio]ceccarelli_imaging_2019\n  author author L. Ceccarelli, author D. Vasyukov, author M. Wyss,\n  author G. Romagnoli, author N. Rossi, author\n  L. Moser, and author\n  M. Poggio, title title Imaging pinning and expulsion of individual\n  superconducting vortices in amorphous MoSi thin films, https://doi.org/10.1103/PhysRevB.100.104504 journal journal Physical Review B volume 100, pages 104504 (year 2019)NoStop\n[Vasyukov et al.(2018)Vasyukov, Ceccarelli, Wyss, Gross, Schwarb, Mehlin, Rossi, Tütüncüoglu, Heimbach,\n  Zamani, Kovács, Fontcuberta i Morral, Grundler, and Poggio]vasyukov_nanotube_2018\n  author author D. Vasyukov, author L. Ceccarelli, author M. Wyss,\n  author B. Gross, author A. Schwarb, author\n  A. Mehlin, author N. Rossi, author G. Tütüncüoglu, author\n  F. Heimbach, author\n  R. R. Zamani, author\n  A. Kovács, author\n  A. Fontcuberta i Morral, author\n  D. Grundler, and author\n  M. Poggio, title title Imaging stray magnetic field of individual ferromagnetic\n  nanotubes, https://doi.org/10.1021/acs.nanolett.7b04386\n  journal journal Nano Letters volume 18, pages 964–970 (year\n  2018)NoStop\n[Persky and Kalisky(2018)]persky_oxide_2018\n  author author E. Persky and author B. Kalisky, title title Scanning\n  SQUID view of oxide interfaces, https://doi.org/10.1002/adma.201706653 journal journal Advanced Materials volume 30, pages 1706653 (year 2018)NoStop\n[Uri et al.(2020a)Uri, Grover, Cao, Crosse,\n  Bagani, Rodan-Legrain, Myasoedov, Watanabe, Taniguchi,\n  Moon, Koshino, Jarillo-Herrero, and Zeldov]uriMappingTwist2020\n  author author A. Uri, author S. Grover,\n  author Y. Cao, author\n  J. A. Crosse, author\n  K. Bagani, author D. Rodan-Legrain, author Y. Myasoedov, author K. Watanabe, author T. Taniguchi, author P. Moon, author M. Koshino, author P. Jarillo-Herrero, and author E. Zeldov, title title\n  Mapping the twist-angle disorder and Landau levels in magic-angle\n  graphene, https://doi.org/10.1038/s41586-020-2255-3 journal journal Nature volume 581,  pages 47–52 (year 2020a)NoStop\n[Tschirhart et al.(2021)Tschirhart, Serlin, Polshyn, Shragai, Xia, Zhu, Zhang,\n  Watanabe, Taniguchi, Huber,  and Young]tschirhartImagingOrbitalFerromag2021\n  author author C. L. Tschirhart, author M. Serlin,\n  author H. Polshyn, author A. Shragai, author\n  Z. Xia, author J. Zhu, author Y. Zhang, author K. Watanabe,\n  author T. Taniguchi, author M. E. Huber, and author A. F. Young, title\n  title Imaging orbital ferromagnetism in a moiré\n  Chern insulator, https://doi.org/10.1126/science.abd3190\n  journal journal Science volume 372, pages 1323–1327 (year\n  2021)NoStop\n[Spanton et al.(2014)Spanton, Nowack, Du, Sullivan, Du, and Moler]spanton_EdgeCurrent_2014\n  author author E. M. Spanton, author K. C. Nowack,\n  author L. Du, author\n  G. Sullivan, author\n  R.-R. Du, and author\n  K. A. Moler, title title Images of edge current in InAs/GaSb quantum\n  wells, https://doi.org/10.1103/PhysRevLett.113.026804 journal journal Physical Review Letters volume 113, pages 026804 (year\n  2014)NoStop\n[Nowack et al.(2013)Nowack,\n  Spanton, Baenninger, König, Kirtley, Kalisky, Ames, Leubner, Brüne, Buhmann, Molenkamp, Goldhaber-Gordon,  and Moler]nowackImagingCurrentsHgTe2013\n  author author K. C. Nowack, author E. M. Spanton,\n  author M. Baenninger, author M. König, author\n  J. R. Kirtley, author\n  B. Kalisky, author C. Ames, author P. Leubner, author C. Brüne,\n  author H. Buhmann, author L. W. Molenkamp, author\n  D. Goldhaber-Gordon, and author K. A. Moler, title\n  title Imaging currents in HgTe quantum wells in\n  the quantum spin Hall regime, https://doi.org/10.1038/nmat3682 journal journal\n  Nature Materials volume 12, pages\n  787–791 (year 2013)NoStop\n[Uri et al.(2020b)Uri, Kim, Bagani, Lewandowski, Grover, Auerbach,\n  Lachman, Myasoedov, Taniguchi, Watanabe, Smet, and  Zeldov]uri_quantumHall_2020\n  author author A. Uri, author Y. Kim, author K. Bagani, author\n  C. K. Lewandowski, author\n  S. Grover, author N. Auerbach, author E. O.  Lachman, author Y. Myasoedov, author T. Taniguchi, author K. Watanabe,\n  author J. Smet, and author E. Zeldov, title\n  title Nanoscale imaging of equilibrium quantum\n  Hall edge currents and of the magnetic monopole response in graphene,  https://doi.org/10.1038/s41567-019-0713-3 journal\n  journal Nature Physics volume 16,  pages 164–170 (year\n  2020b)NoStop\n[Kirtley et al.(2016)Kirtley, Paulius, Rosenberg, Palmstrom, Holland, Spanton, Schiessl, Jermain, Gibbons, Fung, Huber, Ralph, Ketchen, Gibson, and Moler]Kirtley_2016\n  author author J. R. Kirtley, author L. Paulius,\n  author A. J. Rosenberg, author J. C. Palmstrom, author\n  C. M. Holland, author\n  E. M. Spanton, author\n  D. Schiessl, author\n  C. L. Jermain, author\n  J. Gibbons, author Y.-K.-K. Fung, author M. E.  Huber, author D. C. Ralph, author M. B. Ketchen,\n  author G. W. Gibson, and  author K. A. Moler, title title Scanning SQUID susceptometers with\n  sub-micron spatial resolution, https://doi.org/10.1063/1.4961982\n  journal journal Review of Scientific\n  Instruments volume 87, pages 093702\n  (year 2016)NoStop\n[Wyss et al.(2022)Wyss,\n  Bagani, Jetter, Marchiori,\n  Vervelaki, Gross, Ridderbos,\n  Gliga, Schönenberger, and Poggio]wyss_magnetic_2021\n  author author M. Wyss, author K. Bagani,\n  author D. Jetter, author E. Marchiori, author\n  A. Vervelaki, author\n  B. Gross, author J. Ridderbos, author S. Gliga, author C. Schönenberger, and author\n  M. Poggio, title title Magnetic, thermal, and topographic imaging with a\n  nanometer-scale SQUID-on-lever scanning probe, https://doi.org/10.1103/PhysRevApplied.17.034002 journal\n  journal Physical Review Applied volume\n  17, pages 034002 (year 2022)NoStop\n[Finkler et al.(2010)Finkler, Segev, Myasoedov, Rappaport, Ne'eman, Vasyukov, Zeldov, Huber, Martin, and Yacoby]finkler_self-aligned_2010\n  author author A. Finkler, author Y. Segev,\n  author Y. Myasoedov, author M. L. Rappaport, author\n  L. Ne'eman, author D. Vasyukov, author E. Zeldov, author M. E.  Huber, author J. Martin, and author A. Yacoby, title title Self-aligned\n  nanoscale SQUID on a tip, https://doi.org/10.1021/nl100009r\n  journal journal Nano Letters volume 10, pages 1046–1049 (year\n  2010)NoStop\n[Anahory et al.(2020)Anahory, Naren, Lachman, Sinai, Uri, Embon, Yaakobi,\n  Myasoedov, Huber, Klajn,  and Zeldov]anahory_squid–tip_2020\n  author author Y. Anahory, author H. R. Naren,\n  author E. O. Lachman, author S. B. Sinai, author\n  A. Uri, author L. Embon, author E. Yaakobi, author Y. Myasoedov, author M. E.  Huber, author R. Klajn, and author E. Zeldov, title title SQUID-on-tip\n  with single-electron spin sensitivity for high-field and ultra-low\n  temperature nanomagnetic imaging, https://doi.org/10.1039/C9NR08578E journal journal Nanoscale volume 12, pages\n  3174–3182 (year 2020)NoStop\n[Bagani et al.(2019)Bagani,\n  Sarkar, Uri, Rappaport,\n  Huber, Zeldov, and Myasoedov]bagani_sputtered_2019\n  author author K. Bagani, author J. Sarkar,\n  author A. Uri, author\n  M. L. Rappaport, author\n  M. E. Huber, author\n  E. Zeldov, and author\n  Y. Myasoedov, title title Sputtered Mo_66Re_34 SQUID-on-tip for\n  high-field magnetic and thermal nanoimaging, https://doi.org/10.1103/PhysRevApplied.12.044062 journal\n  journal Physical Review Applied volume\n  12, pages 044062 (year 2019)NoStop\n[Halbertal et al.(2016)Halbertal, Cuppens, Shalom, Embon, Shadmi, Anahory, Naren, Sarkar, Uri, Ronen,\n  Myasoedov, Levitov, Joselevich, Geim, and Zeldov]halbertal_nanoscale_2016\n  author author D. Halbertal, author J. Cuppens,\n  author M. B. Shalom, author L. Embon, author\n  N. Shadmi, author Y. Anahory, author H. R.  Naren, author J. Sarkar, author A. Uri,\n  author Y. Ronen, author Y. Myasoedov, author\n  L. S. Levitov, author\n  E. Joselevich, author\n  A. K. Geim, and author\n  E. Zeldov, title title Nanoscale thermal imaging of dissipation in quantum\n  systems, https://doi.org/10.1038/nature19843 journal journal Nature volume 539,  pages 407–410 (year 2016)NoStop\n[Vasyukov et al.(2013)Vasyukov, Anahory, Embon, Halbertal, Cuppens, Neeman, Finkler, Segev, Myasoedov, Rappaport, Huber, and Zeldov]vasyukov_scanning_2013\n  author author D. Vasyukov, author Y. Anahory,\n  author L. Embon, author D. Halbertal, author\n  J. Cuppens, author L. Neeman, author A. Finkler, author Y. Segev, author Y. Myasoedov, author M. L.  Rappaport, author M. E.  Huber, and author E. Zeldov, title title\n  A scanning superconducting quantum interference device with single electron\n  spin sensitivity, https://doi.org/10.1038/nnano.2013.169\n  journal journal Nature Nanotechnology volume 8, pages 639–644 (year\n  2013)NoStop\n[Lam, Clem, and Yang(2011)]LamNanoscaleSQUIDOperating2011\n  author author S. K. H.  Lam, author J. R. Clem, and author W. Yang,  title title A\n  nanoscale SQUID operating at high magnetic fields, https://doi.org/10.1088/0957-4484/22/45/455501 journal\n  journal Nanotechnology volume 22,  pages 455501 (year 2011)NoStop\n[Chen et al.(2010)Chen,\n  Wernsdorfer, Lampropoulos, Christou, and Chiorescu]chenOnchipSQUIDhighfields2010\n  author author L. Chen, author W. Wernsdorfer,\n  author C. Lampropoulos, author G. Christou, and author I. Chiorescu, title\n  title On-chip SQUID\n  measurements in the presence of high magnetic fields, https://doi.org/10.1088/0957-4484/21/40/405504 journal\n  journal Nanotechnology volume 21,  pages 405504 (year 2010)NoStop\n[Ketchen et al.(1989)Ketchen, Awschalom, Gallagher,\n  Kleinsasser, Sandstrom, Rozen, and Bumble]Ketchen_1989\n  author author M. Ketchen, author D. Awschalom,\n  author W. Gallagher, author A. Kleinsasser, author\n  R. Sandstrom, author\n  J. Rozen, and author\n  B. Bumble, title title Design, fabrication, and performance of integrated\n  miniature SQUID susceptometers, https://doi.org/10.1109/20.92513 journal journal\n  IEEE Transactions on Magnetics volume 25,  pages 1212–1215 (year 1989)NoStop\n\n\n\n"}