{"entry_id": "http://arxiv.org/abs/2303.06985v1", "published": "20230313103548", "title": "Fermionic quantum processing with programmable neutral atom arrays", "authors": ["Daniel González-Cuadra", "Dolev Bluvstein", "Marcin Kalinowski", "Raphael Kaubruegger", "Nishad Maskara", "Piero Naldesi", "Torsten V. Zache", "Adam M. Kaufman", "Mikhail D. Lukin", "Hannes Pichler", "Benoît Vermersch", "Jun Ye", "Peter Zoller"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.quant-gas", "cond-mat.str-el", "hep-lat"], "text": "\n\n\n\n\n\nInstitute for Theoretical Physics, University of Innsbruck, 6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences,\n6020 Innsbruck, Austria\n\nDepartment of Physics, Harvard University, Cambridge, MA 02138, USA\n\nDepartment of Physics, Harvard University, Cambridge, MA 02138, USA\n\nInstitute for Theoretical Physics, University of Innsbruck, 6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences,\n6020 Innsbruck, Austria\n\nDepartment of Physics, Harvard University, Cambridge, MA 02138, USA\n\nInstitute for Theoretical Physics, University of Innsbruck, 6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences,\n6020 Innsbruck, Austria\n\nInstitute for Theoretical Physics, University of Innsbruck, 6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences,\n6020 Innsbruck, Austria\n\nDepartment of Physics, University of Colorado, Boulder, Colorado 80309, USA\nJILA, University of Colorado and National Institute of Standards and Technology, Boulder, Colorado 80309, USA\n\nDepartment of Physics, Harvard University, Cambridge, MA 02138, USA\n\nInstitute for Theoretical Physics, University of Innsbruck, 6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences,\n6020 Innsbruck, Austria\n\nUniversité Grenoble Alpes, CNRS, Laboratoire de Physique et Modélisation des Milieux Condensés (LPMMC), Grenoble 38000, France\n\nDepartment of Physics, University of Colorado, Boulder, Colorado 80309, USA\nJILA, University of Colorado and National Institute of Standards and Technology, Boulder, Colorado 80309, USA\n\nInstitute for Theoretical Physics, University of Innsbruck, 6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences,\n6020 Innsbruck, Austria\n\n\nSimulating the properties of many-body fermionic systems is an outstanding computational challenge relevant to material science, quantum chemistry, and particle physics. Although qubit-based quantum computers can potentially tackle this problem more efficiently than classical devices, encoding non-local fermionic statistics introduces an overhead in the required resources, limiting their applicability on near-term architectures. In this work, we present a fermionic quantum processor, where fermionic models are locally encoded in a fermionic register and simulated in a hardware-efficient manner using fermionic gates. We consider in particular fermionic atoms in programmable tweezer arrays and develop different protocols to implement non-local tunneling gates, guaranteeing Fermi statistics at the hardware level. We use this gate set, together with Rydberg-mediated interaction gates, to find efficient circuit decompositions for digital and variational quantum simulation algorithms, illustrated here for molecular energy estimation. Finally, we consider a combined fermion-qubit architecture, where both the motional and internal degrees of freedom of the atoms are harnessed to efficiently implement quantum phase estimation, as well as to simulate lattice gauge theory dynamics.\n\n\nFermionic quantum processing with programmable neutral atom arrays\n    P. Zoller\n    March 30, 2023\n==================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nThe study of strongly correlated fermionic systems lies at the core of some of the most interesting problems in modern physics.\nThese include profound questions regarding the inner workings of the universe, such as the physics of quark-gluon plasmas <cit.>, as well as technologically pressing challenges in material science and quantum chemistry, from high-temperature superconductivity <cit.> to nitrogen fixation <cit.>. The defining feature of fermionic many-body systems is the fundamental indistinguishability of their constituents, which dictates the anti-symmetry of the wavefunction and the corresponding quantum statistics. Importantly, this indistinguishabilty gives rise to the so-called sign problem, which severely limits the applicability of many numerical approaches, such as Monte Carlo methods, highlighting the innate difficulty of solving fermionic many-body problems on classical computers <cit.>.\n\nOne of the most promising alternatives to address these problems is provided by quantum computers <cit.>.\nTraditionally, quantum computing involves distinguishable spin-1/2 particles, where quantum information is stored in superposition states of qubit registers, and processed by the action of quantum gates. The quantum statistics of fermions needs to be encoded in such qubit-based devices on a software level, which incurs overhead in circuit depths <cit.> or qubit numbers <cit.>.\nThis presents a substantial challenge for current experiments where noise limits gate and readout fidelities. Although this approach has been applied to simple fermionic  models from quantum chemistry <cit.>, condensed-matter <cit.> and particle physics <cit.>, using quantum processors based on superconducting circuits or trapped ions, experimental studies have so far been restricted to small system sizes.\n\nNeutral atom systems provide a route to bypass this issue and construct quantum devices where fermionic statistics are built-in on a hardware level. The natural indistinguishability of atoms, which come as bosons or fermions, is for instance leveraged in celebrated analog quantum simulations of Hubbard models in optical lattices <cit.>. Recently, optical tweezers have emerged as powerful tools to trap and manipulate neutral atoms with an unprecedented level of programmability and scalability <cit.>. So far, these systems have, however, mainly been used to realize spin models with distinguishable constituents <cit.>, where each atomic position is pinned to a specific tweezer, internal electronic or nuclear spin states are used to represent qubit states, and interactions between these qubits are implemented using highly-excited Rydberg states.\n\nIn this work, we envision the next-generation of such tweezer setups, where not only the internal but also the external degrees of freedom are coherently controlled, and fully integrated in the quantum processing architecture. This is a crucial prerequisite for capitalizing on the indistinguishability of (fermionic) atoms, which requires the possibility for their center-of-mass wave functions to overlap, e.g., by coherently delocalizing atoms across tweezers. Remarkably, this motional control has already been demonstrated in pioneering proof-of-principle experiments with tweezer pairs and double-well potentials <cit.>. Below, we describe a blueprint of the elements required for such a fermionic quantum processor <cit.>, where both quantum hardware and software are co-designed to efficiently simulate fermionic models. \nMore precisely, we describe protocols for the basic set of fermionic quantum gates, including, apart from Rydberg-mediated interacting gates, digital tunneling gates (or `fermionic beam splitters') implemented through Merge or Shuttle protocols.\nWhile the present work focuses on a setup with   tweezer arrays, we note alternative setups involving optical lattices, as developed originally in the context of bosonic atoms <cit.>. We exemplify our proposal for concrete atomic systems, and discuss the requirements and experimental challenges for their physical implementation. Furthermore, we provide illustrative examples of application of such a fermionic quantum processor in the context of digital quantum simulation for quantum chemistry and for lattice gauge theories (LGT), where we use this fermionic gate set to find efficient circuit decompositions and demonstrate considerable depth reductions compared to traditional qubit-based approaches.\n\n\n\n\n\n§ HARDWIRED FERMI STATISTICS\n\nWe consider fermionic atoms in an array of microtraps that represent the fermionic quantum register [Fig. <ref>(a)]. We write c^_j,σ (c_j,σ^†) for the annihilation (creation) operator of atoms on lattice site j, which we assume to be prepared in the trap ground state, and σ labeling internal atomic states [qudits <cit.>]. The quantum state of the quantum register comprising N atoms occupying L microtraps will thus be a quantum superposition of all possible configurations. To be concrete, we will illustrate the quantum gate set, including in particular digital tunneling gates, for spinless fermions, i.e., dropping the index σ for the moment. In this case, the state of the quantum register is given by a superposition of Fock states |n_1,…,n_L⟩, where n_j=0,1 is the atomic occupation, and ∑_j=1^Ln_j=N. In the last section, we consider again spinful fermions and work with a combined fermion-qubit register to encode more general models, which are not purely fermionic, such as LGTs.\n\n\n\nIn the context of quantum simulation (QS) of many-body systems <cit.>, we are interested in particle-number conserving unitaries acting on this register <cit.>, which can be constructed using the gate set \n\n    ℬ𝒦 = {e^iπ/4n_i, e^iπ n_in_j, e^iπ/4(c^†_i c^_j + H.c.)},\n\nas shown by Bravyi and Kitaev <cit.>. \nAs we demonstrate in the next section, the circuit depth required to simulate fermionic models can be considerably shortened by considering instead the more general set , where \n\n    𝒰^( int)_i, j(θ)    ≡ e^-iθ  n_i n_j ,\n    𝒰^ (t)_i,j(θ⃗)    ≡ e^-i[θ_1/2(e^-iθ_2c^†_i c^_j + H.c.) + θ_3/2(n_i - n_j)]\n\nare generalized interaction (int) and tunneling (t) gates, respectively [Fig. <ref>(a)], and θ⃗ = (θ_1,θ_2,θ_3).\nIn the context of qubit-based quantum computation, where single-qubit rotations together with one entangling interaction gate are sufficient to achieve universality <cit.>, fermionic degrees of freedom first need to be encoded into qubits using, e.g., a Jordan-Wigner (JW) transformation <cit.>. Tunneling gates, required to simulate many-body fermionic systems, can be implemented in the case of a JW encoding using 𝒪(L) entangling gates <cit.>.\nFermionic atoms trapped in the motional ground state of optical tweezers offer the unique possibility to avoid this overhead by implementing the gate set 𝒢 directly. Specifically, the tunneling gate, 𝒰^ (t)_i,j(θ⃗), can be realized using different approaches that  exploit the capability of dynamically rearranging the tweezer positions, two of which we discuss now in more detail.\n\nThe Merge approach realizes the tunneling gate by temporarily bringing the two tweezers i and j so close together that atoms can tunnel between the corresponding lowest vibrational states [see Fig. <ref>(a)], as it has been demonstrated in recent experiments <cit.>. More generally, one may fully merge (and subsequently separate) the tweezer pair using custom designed merging and splitting protocols. The gate parameters θ⃗ can in either case be completely controlled by the tweezer parameters and the details of the merging protocol, such as the tweezer depths, the time-dependent distance of the tweezer minima, and the duration of this coupling process. In practice, these can be determined via optimal control techniques for given target tunnel parameters θ⃗, and allow gate execution on timescales set by the inverse trapping frequency of the tweezers. This approach is therefore natural for light \natoms, such as Lithium, where relatively small trap depths are sufficient for large trap frequencies.\n\nThe Shuttle approach offers an alternative way to realize the tunnel gate, which is based on the capability to realize state-dependent optical potentials <cit.>, and is thus naturally suited for alkaline-earth atoms. We therefore illustrate this idea for the specific example of ^87 Sr, a fermionic isotope of strontium with nuclear spin I = 9/2 below and in Fig <ref>. The central idea is to use two sets of tweezers: a set of static storage traps, whose occupations define the fermionic register, and a set of transport traps, which serve as a “shuttle” for atoms. Crucially, the wavelength of the storage and transport tweezers is chosen such that they trap two different internal states of an atom, respectively. For instance, for ^87 Sr, one can trap the state ^1 S_0 <cit.> in the storage tweezers, and independently trap the clock state ^3 P_0 <cit.> in transport tweezers, reminiscent of the collisional entangling quantum gate with spin-dependent lattices for bosonic atoms <cit.>. \nHere, we extend these ideas and design a fermionic shuttle that implements the tunneling gate 𝒰^ (t)_i,j(θ⃗). Importantly, when a storage and transport tweezer overlap and their potential shapes match, atoms can be coherently transferred or coherently split between the two tweezers simply by using laser pulses that implement internal rotations R_i(θ⃗) = e^-i[θ_1/2( cos θ_2 X+  sin θ_2 Y) + θ_3/2 Z], where X, Y and Z are Pauli matrices acting on the atomic subspace spanned by ^1S_0 and ^3P_0.\nUsing this mechanism, one can construct the full tunneling gate, 𝒰^ (t)_i,j(θ⃗), as follows [see also Fig. <ref>(b)]: (1) we first bring a transport tweezer to a storage site i and perform a π-pulse rotation, i.e. , (2) after which we move the transport tweezer to site j. (3) We then perform a second pulse R_j(θ⃗^*), with θ⃗^* = (θ_1,θ_2 + π/2, θ_3), (4), bring the transport tweezer back to site i, and (5) finally undo the initial π-pulse. \nWe note that both the Shuttle and the Merge approach can be fully parallelized. We comment on potential error sources for both approaches in a separate section below.\n\nIn these setups, the interaction gate 𝒰^ (int)_i,j(θ) is essentially equivalent to a standard qubit entangling gate that has \nalready been implemented for alkaline <cit.> as well as alkaline-earth atoms <cit.> using the Rydberg blockade mechanism. To realize it, we first rearrange the tweezers hosting the modes i and j and bring them to a distance that lies within the Rydberg blockade radius. We then drive the atoms with a laser that couples the atoms internal state to a Rydberg state. Owing to the Rydberg blockade mechanism, properly chosen laser pulses result in a unitary e^iϕ_01(n_i + n_j) + i ϕ_11n_i n_j <cit.>. The phases ϕ_01/11 depend on the shape of the Rydberg laser pulse <cit.> and choosing ϕ_11 = 2ϕ_01 - θ provides the desired interaction gate up to the single-particle phase shift ϕ_01.\nWe note that resonantly coupling the atom to the untrapped Rydberg state could create excitations in the trap, which should be suppressed to preserve the atom's indistinguishability. We note that these effects can be reduced by trapping the atoms also in the Rydberg state <cit.>. Alternatively, one can work in the dressed-Rydberg regime, where decay from the Rydberg state is suppressed and interactions become independent of distance, thus avoiding the repulsive forces between atoms. Below, we will discuss these together with other experimental challenges, including several strategies to mitigate the dominant error sources.\n\n\n\n§ FERMIONIC QUANTUM CIRCUITS\n\nNow we employ the set of fermionic gates 𝒢 to construct the quantum circuits required for QS of fermionic systems. Let us first focus on purely fermionic Hamiltonians, which we generalize below to fermion-boson models relevant to high-energy physics. To be explicit, we consider the particle-number-conserving fermionic Hamiltonian:\n\n\n    ℋ    = \n    ∑_ij   \n    h_ij^(1) \n    c^†_i c^_j + \n    ∑_ijkl \n    h_ijkl^(2) \n    c^†_i c^†_j c^_k c^_l\n\nwith complex parameters h_ij^(1) and h_ijkl^(2).\nThis Hamiltonian is frequently used both in condensed matter <cit.> and quantum chemistry <cit.>, where the indices can denote either the position of electrons in a solid-state crystal or the orbitals of a molecule, respectively. Many QS algorithms use as subroutines unitary operations obtained from exponentiating each term in the Hamiltonian. Apart from the tunneling and interaction gates introduced above, these include density-dependent tunneling (dt) as well as pair-tunneling (pt) processes,\n\n    𝒰^ (dt)_ijk(θ_1, θ_2)    ≡ e^-i θ_1 (e^-iθ_2 c_i^†n_jc^_k + H.c.), \n    𝒰^ (pt)_i,j,k,l(θ_1, θ_2)    ≡ e^-i θ_1 (e^-iθ_2c_i^†c_j^†c^_k c^_l + H.c.).\n\n\n\n\nFor both (<ref>) and (<ref>), we derived a specific decomposition in terms of the gate set 𝒢, which are shown in Figs. <ref>(a) and (b), respectively. Both decompositions have a constant circuit depth of 5 gates and are exact and optimal.\nThis provides a clear advantage in terms of depth with respect to the circuit obtained using e.g. JW transformations <cit.>, as well as with approximate decompositions based on the universal ℬ𝒦 set [<ref>]. Moreover, note that the all-to-all connectivity of atom arrays plays a crucial point in the case of quantum chemistry, where the presence of non-local terms in (<ref>) introduces further overhead for architectures with only nearest-neighbor gates <cit.>.\n\nThese fermionic quantum circuits can then be used as precompiled subroutines, carrying over the polynomial saving of resources to the full QS algorithm. For instance, the real-time evolution under Hamiltonian (<ref>) can be simulated by a first-order Trotter expansion <cit.>,\n\n    e^-iℋt≈[∏_i,j𝒰^ (t)_i,j(h^(1)_i,jδ t,0,0)∏_i,j,k,l𝒰^ (pt)_i,j,k,l(h^(2)_i,j,k,lδ t,0)]^t/δ t,\n\nwhere δ t is the Trotter time and the local gates can be applied in parallel across the system. \nAnother application are hybrid quantum-classical algorithms such as the variational quantum eigensolver (VQE) <cit.>, used in particular to find the ground-state energy of molecules using near-term devices, where 𝒰^ (pt)_i,j,k,l(θ, π/2) allows us to construct variational states that are both hardware-efficient <cit.> and so-called “chemically-inspired” <cit.>. This includes the disentangled unitary coupled cluster ansatz <cit.>, |ψ(θ⃗)⟩ = U(θ⃗)|ψ_ HF⟩,  with \n\n    U(θ⃗) = ∏_i,α𝒰^ (t)_i,α(θ^(1)_iα, π/2, 0)∏_i,j,α,β𝒰^ (pt)_i,j,α,β(θ^(2)_ijαβ, π/2),\n\nwhere the products run over occupied (i, j) and virtual (α, β) modes with respect to the initial Hartree-Fock product state |ψ_ HF⟩. The energy functional E(θ⃗) = ⟨ψ(θ⃗)|ℋ|ψ⃗(θ⃗)⟩, which is then classically minimized, can be also efficiently constructed in our fermionic processor, by first applying randomized tunneling gates followed by measurements in the occupation basis <cit.>.\n\nWe illustrate our approach for the LiH molecule. We calculate the energy difference δ E ≡ E_ exp(θ⃗^*) - E_0, where θ⃗^* are the optimal variational parameters that minimize E(θ⃗), E_ exp is obtained by evaluating the latter in the presence of experimental errors and E_0 is the exact ground-state energy [We consider the LiH molecule at a fixed interatomic distance of 1.45 Å in the Born-Oppenheimer approximation, with two electrons and four active orbitals. The Hamiltonian parameters h^(1)_i,j and h^(2)_i,j,k,l are calculated using OpenFermion <cit.>.]. The variational circuit U(θ⃗) is depicted in Fig. <ref>(d), and Fig. <ref>(e) shows the average δ E for random fluctuations in the trapping frequency and tweezer positions (Methods), providing an estimate on the required precision to reach chemical accuracy. Note that δ E can be reduced by lowering the tweezer depth, as well as by increasing the pulse intensity to reduce the implementation time, and the full protocol including tweezer transport can be further improved using optimal control <cit.>. \n\nA detailed study for larger molecules using more advanced algorithms such as ADAPT-VQE <cit.>, where the advantage of fermionic processing compared to qubit-based protocols is expected to grow with the number of orbitals, will be included in a separate work <cit.>.\n\n\n\n\n\n§ FERMION-QUBIT ARCHITECTURE\n\nWe now consider spinful fermionic atoms, combining the fermionic register and fermion gates introduced above with a more standard qubit-based architecture. This allows us to encode both qubit ancillas and fermionic modes locally, leading to efficient implementations of more advance QS algorithms such as quantum phase estimation (QPE)<cit.>, as well as to simulate boson-fermion models such as LGTs in a hardware-efficient manner.\n\nTo be specific, we illustrate the architecture using again Sr as an example. Qubit ancillas can be readily included by considering two hyperfine levels of ^1S_0 [Fig. <ref>(a)], where one level, denoted |1̃⟩, is decoupled from the ^3P_0 clock manifold by a magnetic field, and therefore behaves similar to |0⟩ for gates in 𝒢. Rotations R̃ between the states |1̃⟩ and |1⟩  can be implemented through microwave frequencies [Fig. <ref>(a)], enlarging the gate set to 𝒢̃, including both 𝒢 and R̃. In the fermion-qubit register, the same type of atoms can either encode a qubit ancilla or a fermionic mode. In the case of QPE, the energy of ℋ can be estimated by applying a Trotter time evolution under the terms in ℋ controlled by an ancilla, with a precision that grows with the number of ancillas <cit.>. As an example, we show in Fig. <ref>(a) a fermion-qubit circuit associated to a controlled density-dependent hopping process, and other controlled operations can be decomposed similarly in terms of our fermionic gate set. We note that this decomposition requires the three-body gate C_i𝒰^ (int)_j,k(π) = |1̃⟩⟨1̃|⊗𝕀 + |1⟩⟨1|⊗𝒰^ (int)_j,k(π), which can be directly implemented using the Rydberg blockade mechanism <cit.>.\n\nFinally, the fermion-qubit architecture allows us to go beyond purely fermionic models, and consider for instance LGTs, where fermions are coupled to dynamical (bosonic) gauge fields. Consider for simplicity a ℤ_2 LGT described by the Hamiltonian\n\n    ℋ = λ_E∑_⟨ x, y ⟩σ^x_⟨ x, y ⟩ + λ_B∑_□σ^z_□\n       +λ_J∑_⟨ x, y ⟩(c^†_xσ^z_⟨ x, y ⟩c^_y + H.c.) + λ_m ∑_x (-1)^s_xn_x,\n\nwhere fermion and spin operators, representing matter and gauge degrees of freedom, respectively, act on the sites x and links ⟨ x, y ⟩ of a D-dimensional lattice. The first row in (<ref>) contains the pure-gauge dynamics, including four-body plaquette operators σ^z_□ acting with σ^z_⟨ x, y ⟩ on each link around a plaquette □ [Fig. <ref>(b)], while the second one includes gauge-matter interactions. The Hamiltonian is invariant under local ℤ_2  transformation, i.e. ℋ = 𝒱^†_x ℋ𝒱_x ∀ x, with 𝒱_x = (-1)^n_x∏_yσ^x_⟨ x, y ⟩. \n\nApart from serving as simplified models to study fermionic confinement <cit.>, ℤ_2 LGTs emerge in condensed-matter systems <cit.>, displaying strongly-correlated phenomena such as high-Tc superconductivity <cit.>, topological order <cit.> and unconventional dynamics <cit.>. For D>1, the model presents a sign problem away from half-filling and can not be solved efficiently using classical methods. The corresponding real-time dynamics can be efficiently simulated using quantum devices <cit.> through e.g. a first-order Trotter expansion. In our fermion-qubit architecture, the gate set 𝒢̃ allows us to construct Trotter steps [shown in Fig. <ref>(b)] with a constant circuit depth <cit.>, thanks to the local structure of (<ref>), the possibility to parallelize fermionic gates and the lack of JW strings. The above protocol can be generalized to non-abelian gauge fields, required to address the full Standard Model of particle physics, by further extending it to a fermion-qudit architecture <cit.>, which will be presented in detail in a separate work <cit.>.\n\n\n\n§ EXPERIMENTAL CHALLENGES AND CONSIDERATIONS\n\n\nWe finish by discussing in more detail some of the experimental challenges that should be overcome to build a fermionic quantum processor, including the main error sources for the gates discussed above, as well as different strategies to minimize them. The experimental setup for our proposed fermionic quantum processor is similar to existing reconfigurable tweezer platforms with high-fidelity Rydberg gates <cit.>; however, the main new challenge will be coherently controlling the motional degrees of freedom. This introduces new pathways for decoherence, primarily coming from leakage out of the \nfermionic register (i.e., heating to motional excited states) and dephasing from inhomogeneity between different tweezer sites.\n\nLeakage, or heating, out of the motional ground state can arise from state preparation errors, scattering by the tweezer, pulsing the traps off for the Rydberg gate, and from moving the atoms; we argue here that all of these effects can be greatly suppressed. \nFirst, heating from tweezer scattering is negligible for sufficiently large detunings.\nBy utilizing tight radial and axial confinement, 3D motional ground state preparation has been realized at levels of ≈ 95% <cit.>. However, by “spilling out” all motional excited states, we can convert the motional ground state occupancy to nearly 100% provided we can nondestructively check for atom presence, which can be done directly using an ancilla atom and a high-fidelity Rydberg gate to check for atom presence <cit.>. \n\nConsider for example the 50 kHz trap depth for the Lithium tweezers, relevant for the Merge gate, used in <cit.>, which would give 0.03 Hz scattering rate and an even smaller heating rate due to the Lamb-Dicke parameter. Pulsing the trap off during the Rydberg gate could cause heating, but the probability of transitioning to higher motional states will be roughly (ω t)^2 / 4, where ω = 2π× 15 kHz is the trap frequency <cit.> and t ≈ 100 ns is the implementation time required for 99.9% fidelity gates. This probability then evaluates to < 10^-4 per gate, and so does not contribute significantly compared to a 99.9% gate fidelity. Finally, moving the atoms can cause heating and, as a conservative estimate, we utilize the heating rates calculated in <cit.>. If the atoms are placed relatively close together, at a distance of several micrometers, then for the move to be 99.9-99.99% fidelity each move has to be ≈ 500  μs. This can be significantly speed-up using optimal control <cit.>.\n\n\nIn general, we expect that trap inhomogeneities will be the dominant source of dephasing for degrees of freedom coherently encoded in motional states.\nWith a Rydberg gate fidelity of ∼ 99.9% we would like to perform ∼ 1000 operations, where in general the tweezer geometry is reconfigured between each round. If it takes ∼ 500 μs to move atoms between gates, that sets the total operation time of ∼ 500 ms. For  the example of Lithium-6, a trap depth of 50 kHz and a reasonable standard deviation between tweezers of 0.2% leads to a coherence time of T^*_2 ≈ 2 ms, which is only enough time for ≈ 4 moves. Note that this is for shallow trap depths of Lithium-6, a light atom, and that this effect will be even more exacerbated for heavier atoms like strontium, where larger trap depths (laser intensities) are required for the same trap frequencies.\n\n\n\n\nWhenever there is static inhomogeneity in a system, such as positional trap-depth dependence, the natural approach is to perform a motional echo procedure <cit.>. \nWe can permute around the various tweezer positions\nso that all atoms acquire the same average phase due to the positional trap depth dependence.\nFirst, consider two tweezers with unequal trap intensities and thus unequal energies at the bottom of the trap, as depicted in Fig. <ref>(a). Due to the different energies, the atoms at these sites experience dephasing. However, this effect can be canceled out by repeatedly swapping the tweezer positions after each application of the tunneling gate (see Methods for details). In Fig. <ref>(b), we illustrate this idea by simulating the\nFloquet evolution of a 1D chain with nearest-neighbor hopping (Methods). The results show that performing the echo procedure allows us to extend the useful simulation time by two orders of magnitude. In practice, the inhomogeneities might not be exactly static, in which case the echo needs to be applied at a rate faster than that timescale. We also note that there could potentially be other methods to design robust sequences of tunnel gates. For example, circuits could be precompiled in order to minimize the number of necessary swap operations while taking into account the specific distribution of spatial coherence. \n\nIn addition, trap inhomogeneities could be further reduced by storing the atoms in state-dependent optical lattices in combination with tweezers, which could be used to move the atoms to the desired position in order to apply the corresponding gates <cit.>. In this architecture, the Merge gate could be implemented using superlattices, by first placing the atoms in double wells <cit.>, while the Shuttle gate could be implemented by using the lattice and tweezers as storage and transport potentials, respectively.\n\nFinally, for the Shuttle gate based on alkaline-earth atoms like strontium as discussed above, additional error sources include phase shifts and losses during step (3) of the protocol due to elastic and inelastic collisions, respectively, between atoms in the ^3 P_0 and ^1 S_0 states. The former are of the order of a few kHz for ^87Sr <cit.>, and should be removed by an appropriate calibration or measured and compensated by additional phase shift gates. Inelastic collisions are even smaller <cit.> than typical Rabi frequencies and can therefore be safely neglected. \nFinally, we note that the optical potentials for the storage and transport tweezers need to match to properly transfer atoms between them, and fluctuations in the tweezer location and laser intensity will lead to imperfect transfer processes (Methods). The effect of such fluctuations is taken into account in the variational preparation of a simple molecule, illustrated in Figure <ref>. \n\n\n\n§ CONCLUSIONS AND OUTLOOK\n\nWe presented a fermionic quantum processor based on fermionic atoms trapped in tweezer arrays, and showed how to locally encode and quantum simulate fermionic models in a hardware-efficient manner. We illustrated  the advantages of our approach with respect to qubit-based devices for VQE and QPE in quantum chemistry, as well as for Trotter time evolution of gauge theories. We note that the proposed hardware can be used to run more advance and potentially new fermionic quantum algorithms, further optimizing the required resources and facilitating the reach of quantum advantage in the near term. The fermionic gate set could also be extended to include particle non-conserving processes, using e.g. atom reservoirs, allowing to implement error correction protocols, which we plan to investigate in the future.\n\n\n\n§ METHODS\n\n\n\n\n §.§ Error model for VQE\n\nWe exemplify the fermionic quantum simulation of the LiH molecule using VQE, where we consider in particular the tunneling gate implemented using the Shuttle\n protocol in strontium. We consider optical tweezers generated by laser fields with the following intensity profile in the radial r and longitudinal z directions,\n\n    I(r, z) = I_0(w_0/w_z)e^-2(r / w_z)^2,\n\nwith w_z = w_0√(1 + (z / z_R)^2), where w_0 and z_R = π w_0^2/λ are the waist and Rayleigh length of the tweezer, respectively, and λ is the laser (trapping) wavelength. For a properly chosen wavelength, the latter gives rise to an AC Stark shift on a neutral atom, leading to an optical potential V(r, z) = - Re(α) / (2ϵ_0 c) I(r, z), where α is the atom polarizability for the corresponding energy level, ϵ_0 is the permittivity of free space, and c is the speed of light. The trapping potential V(r, z) can be approximated around its minimum using a second-order Taylor expansion, leading to the following harmonic potential,\n\n    V(r, z) = V_0 + 1/2 m ω_r^2 r^2 + 1/2 m ω_z^2 z^2,\n\nwhere V_0 ≡ V(0, 0), m is the mass of the atom and the frequencies are given by ω_r = √(4V_0/(mw_0^2)) and ω_z = √(2V_0/(mz_R^2)). For typical experimental parameters these frequencies are related by ω_r /ω_z ≈ 10.  Here we consider random fluctuations both in the frequencies ω_r and ω_z and in the relative position between tweezers, given by δ r and δ z, following all these parameters independent Gaussian distributions.\n\nThese experimental fluctuations introduce errors in the fermionic quantum gates, since they lead to imperfect rotations between the storage (S) and transport (P) tweezers. In particular, both the Rabi coupling and the detuning of a give pulse are modified due to the imperfect overlap between the wavefunctions, Ω(δ r, δ z) = Ω_0 f(δ r, δ z) and Δ(δ r, δ z) = Δ_0 f(δ r, δ z), with\n\n    f(δ r, δ z) = ∫ d r  d z   2π r  ψ^*_S(r, z) ψ^_P(r +δ r, z + δ z),\n\nwhere we consider Gaussian wavefunctions for the ground state of the harmonic potential (<ref>),\n\n    ψ_S/P(r, z) = e^- (r / 2r_ zp)^2/(2 π r_ zp)^1/4e^- (z / 2z_ zp)^2/(2 π z_ zp)^1/4,\n\nwith zero-point fluctuations given by r_ zp = 1 / √(2mω_r) and z_ zp = 1 / √(2mω_z). Moreover, fluctuations in the trap frequency lead to a non-zero difference between the trap depths, δ V_0 = V^S_0 - V^P_0, introducing an extra unwanted detuning, Δ̃ = Δ + δ V_0, giving rise to an extra angle δ V_0 τ for Z rotations, where τ is the pulse time.\n\n\n\n\n §.§ Motional echo scheme\n\n\nThe positional trap-depth dependence leading to a static dephasing can be mitigated by an appropriate echo procedure. Due to the positional nature of this noise, the natural approach is to ensure that each fermionic register spends equal time at each tweezer site and, on average, experiences the same disorder pattern. The key insight is that, once the evolution is digital, the atom i does not need to always reside in the tweezer site i. That is, we can permute the atoms around the various tweezer positions either by moving them around or introducing swap operations, which effectively change which atom resides in which tweezer. \n\nAs described in the text, the dephasing between the two tweezers coming from different trap depths can be canceled out by repeatedly swapping the tweezer positions after each application of the tunneling gate. In a many-body context, the atoms need to be shuffled in an ergodic fashion such that they can spend equal time at every tweezer site; since this process is deterministic it is easy to keep track of the orbital labels in the classical experimental software.\n\n\nThis approach is particularly simple in a 1D chain with periodic boundary conditions [Fig. <ref>(b) inset]. \nHere, the two sublattices of tweezers, labeled with even and odd numbers, will sequentially translate by one site in space after every tunneling gate. This results in each orbital spending the same amount of time at each position and, moreover, experiencing the same history of trap depths as the neighboring site, up to boundary conditions, which further improves the echo performance. More concretely, during the t-th timestep, the i-th atom resides in the σ_t(i)-th tweezer. Since the inhomogeniety is (to first order) static, but varies from tweezer to tweezer, this can be modelled via a time-dependent disorder Hamiltonian D_t = ∑_x h_σ_t(x)n̂_x.\n\nThe effective dynamics is captured by alternating disorder evolution and target evolution. Moving into an interaction picture with respect to the disorder, and assuming each moving step takes time τ, the hopping terms c_i^† c_j become dressed as\n\n    (c_i^† c_j)(t)    = e^-i τ∑_t' ≤ t (h_σ_t'(j) - h_σ_t'(i)) c_i^† c_j,\n\nwhere j = i+1,\nFor the cyclic-shift strategy depicted in the inset of Fig. <ref>(b) we have σ_t(x) = (x - t)  L, where L is the length of the chain. Here the noise between the two sites becomes time-correlated (between Floquet rounds), σ_t+1(i+1) = σ_t(i) and the relative accumulated disorder is\n\n    ∑_t' ≤ t (h_σ_t'(i+1) - h_σ_t'(i)) = h_σ_0(i+1) - h_σ_t(i),\n\nwhich implies that the phase noise on the hopping term t_ij remains bounded for all time. Compare this to the situation when no echo is performed where the relative phase grows linearly in time. We note the special nature of this echo procedure, which is intrinsically linked to spatial positions of the traps and cannot be performed by applying global operations, in contrast to the typical echo sequences present in spin systems.\n\nA similar effect occurs in the disorder cancellation strategy using swaps, since if two sites x_1 and x_2 interact at time-step t, then σ_t(x_1) = σ_t+1(x_2) and σ_t(x_2) = σ_t+1(x_1).\n\nThe results shown in Fig. <ref>(b) were obtained by simulating 100 tweezers with 20 atoms in a 1D ring configuration evolving under a nearest-neighbor tunneling Hamiltonian with the hopping rate J=1 and the time step τ=0.13, using free-fermion methods. The Hamiltonian evolution is split into two parallel Floquet rounds and a Gaussian phase disorder with σ_θ = 0.035 is applied between each round.\n\n\n\n\nWe thank I. Bloch for comments on the manuscript, and discussion of the advantages of hybrid tweezer-optical lattice platforms. \nWork at Innsbruck was supported by\nthe US Air Force Office of Scientific Research (AFOSR) via IOE Grant No. FA9550-19-1-7044 LASCEM, the European Union’s Horizon 2020 research and innovation program under Grant Agreement No. 101079862 (PASQuanS2), by the Simons Collaboration on Ultra-Quantum Matter, which is a grant from the Simons Foundation (651440, P.Z.), and by  ERC Starting grant QARA (101041435, H.P.).\nWork at JILA is supported by NSF QLCI OMA-2016244 and NIST.\nB.V. and P.N. acknowledge funding from the Austrian Science Foundation (FWF, P 32597 N). \nWork at Grenoble is supported by the French National Research Agency via the JCJC project QRand (ANR-20-CE47-0005), and via the research programs EPIQ (ANR-22-PETQ-0007, Plan France 2030), and QUBITAF (ANR-22-PETQ-0004, Plan France 2030). Work at Harvard was supported by the US Department of Energy (DE-SC0021013 and DOE Quantum Systems Accelerator Center, contract number 7568717), the National Science Foundation, and the Center for Ultracold Atoms. D.B. acknowledges support from the NSF Graduate Research\nFellowship Program (grant DGE1745303) and The Fannie and John Hertz Foundation. N.M. acknowledges support from the Department of Energy Computational Science Graduate Fellowship under Award Number DE-SC0021110.\n\n\n\n"}