{"entry_id": "http://arxiv.org/abs/2303.06983v2", "published": "20230313103333", "title": "Measuring the environment of a Cs qubit with dynamical decoupling sequences", "authors": ["Sabrina Burgardt", "Simon B. Jäger", "Julian Feß", "Silvia Hiebel", "Imke Schneider", "Artur Widera"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.quant-gas", "physics.atom-ph"], "text": "\n\nAPS/123-QED\n\n\n\n\n\n\n\n\n\nwidera@rptu.de\n\n  Department of Physics and Research Center OPTIMAS, University of Kaiserslautern-Landau, Erwin-Schrödinger-Straße 46, D-67663 Kaiserslautern, Germany\n\n\n             \n\n\nWe report the experimental implementation of dynamical decoupling on a small, non-interacting ensemble of up to 25 optically trapped, neutral Cs atoms.\nThe qubit consists of the two magnetic-insensitive Cs clock states |F=3, m_F=0⟩ and |F=4, m_F=0⟩, which are coupled by microwave radiation.\nWe observe a significant enhancement of the coherence time when employing Carr-Purcell-Meiboom-Gill (CPMG) dynamical decoupling.\nA CPMG sequence with ten refocusing pulses increases the coherence time of 16.2(9)  by more than one order of magnitude to 178(2). \nIn addition, we make use of the filter function formalism and utilize the CPMG sequence to measure the background noise floor affecting the qubit coherence, finding a power-law noise spectrum 1/ω^α with α = 0.89(2).\nThis finding is in very good agreement with an independent measurement of the noise in the intensity of the trapping laser.\nMoreover, the measured coherence evolutions also exhibit signatures of low-frequency noise originating at distinct frequencies. \nOur findings point toward noise spectroscopy of engineered atomic baths through single-atom dynamical decoupling in a system of individual Cs impurities immersed in an ultracold ^87Rb bath. \n\n\nMeasuring the environment of a Cs qubit with dynamical decoupling sequences\n    Artur Widera\n    March 30, 2023\n===========================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nThe tremendous progress in manipulating and measuring ultracold quantum gases makes them a versatile platform for quantum technologies. \nElectric and magnetic field control enable the precise creation of quantum superpositions for targeted applications in quantum computing <cit.>, quantum simulation <cit.>, and quantum sensing <cit.>.\nIn all these applications, information is stored in the relative phase of such a quantum superposition in so-called quantum bits (qubits).\nThese coherent superpositions, however, are usually very fragile because they are sensitive to external perturbations.\nIn particular, even in highly specialized labs, quantum systems cannot be perfectly isolated from their environment, which will lead to dissipation and eventually to decoherence, i.e., the decay of a pure quantum state into a statistical mixture. \nIn this regard, the reduction of decoherence and the extension of coherence times is a prime challenge in quantum science which will enable the broad applications of quantum technologies.\n\nOne of the main sources of decoherence is dephasing caused by time-dependent (classical) fluctuations.\nIt is known that such dephasing can, in principle, be reversed by so-called dynamical decoupling, a coherent control-pulse method that was originally developed in\nthe field of solid-state physics.\nThe primary purpose of dynamical decoupling is the effective reduction of the coupling between the qubit and a mostly generic environment by a sequence of pulses. \nThese single <cit.> and multi-pulse sequences <cit.> have already been used to extend coherence in various physical systems, ranging from spin ensembles <cit.>, semiconductor quantum dots <cit.>, nitrogen-vacancy centers in diamond <cit.>, superconducting qubits <cit.>, ensembles of ultracold atoms and ions <cit.> to the limit of single atoms and ions <cit.>. \nConsequently, many key characteristics and possible causes of qubit decoherence in ultracold atomic systems have already been discussed and explained in various experimental and theoretical works <cit.>.\n\nRemarkably, such sequences cannot only be utilized to partially reverse the decoherence dynamics but also to perform noise spectroscopy, i.e., to measure details of the coupled, unknown degrees of freedom of the environment <cit.>.\nThis first appears to be counter-intuitive since sensing is usually more effective if the coupling between the probe and the measurement object is strong. \nThe idea of noise spectroscopy through dynamical decoupling, by contrast, is the modification of the spectral properties of the qubit which probes the environmental noise spectrum in different frequency ranges.\nWhile one could expect that the measurement of all environmental effects is a hopeless task, the most relevant effects can be directly extracted from the detailed knowledge of the qubit's dynamics. \nThis creates the possibility to recover details of the environment by controlling and measuring the qubit's time evolution.\nFrom a fundamental point of view, the dynamical driving of the qubit can be used for the creation of correlated states between the environmental and the qubit's degrees of freedom, closely related to spin-boson <cit.>, polaron <cit.>, and Kondo physics <cit.>. \nFrom a more practical point of view, the gained knowledge about the environment can be utilized to improve the experiment by applying optimized sequences tailored to the situation in the lab. \n\nIn this paper, we exploit the dynamical decoupling method to determine essential properties of the environmental noise spectrum affecting the qubit coherence in a small ensemble of optically trapped, neutral ^133Cs atoms.  \nWe use the two magnetic-insensitive Zeeman levels |F=3, m_F=0⟩ and |F=4, m_F=0⟩ of the 6 S_1/2 ground state as qubit states and couple them by microwave radiation.\nSuch atoms have been immersed into an ultracold atomic gas recently <cit.> for probing coherence and dephasing dynamics of individual Cs impurities beyond the effect of electromagnetic fields.\nIn this work, we demonstrate how dynamical qubit control can give access to essential properties of a coupled environment.\nOur results represent a subsequent stepping stone towards utilizing the Cs qubit as a quantum probe for correlated environments consisting of interacting quantum particles.\n\nThe paper is structured as follows. \nSec. <ref> comprises a description of the experimental setup and a detailed characterization of the qubit. \nIn Sec. <ref>, we introduce the theoretical description of the dynamically driven qubit in a decohering environment.\nThen, in Sec. <ref>, we  present the experimental realization of the dynamical decoupling sequence and a comparison to theory. \nAfter that, we conclude our results in Sec. <ref> and provide a brief outlook. \n\n\n\n§ EXPERIMENTAL SYSTEM\n\n\n\n §.§ Experimental setup\n\nA schematic overview of the trapping geometry in our experimental setup is given in Fig. <ref>.\n\nThe preparation of the Cs atoms is a three-stage process.\nFirst, about 50 Cs atoms are captured in a high-gradient magneto-optical trap and loaded into a crossed optical dipole trap formed by the intersection of two  1064 laser beams.\nSubsequently, the Cs atoms are further cooled to a temperature of T_Cs = 5.9(3) using degenerate Raman sideband cooling (see Refs. <cit.> for additional information on the temperature measurement).\nIn addition to the cooling effect, Raman cooling optically pumps the Cs atoms to the absolute ground state |F=3, m_F=3⟩.\nThe Cs atoms are then transferred to the magnetic-insensitive state |F=3, m_F=0⟩ by four successive microwave Landau-Zener sweeps <cit.>. \nWe remove residual Cs atoms that are not in |F=3, m_F=0⟩ from the trap by a subsequent cleaning scheme, which is based on the spin selective readout in Ref. <cit.> and consists of a combination of microwave Landau-Zener sweeps and resonant laser pulses.\nThis preparation process eventually leaves about 15 to 25 Cs atoms in the desired state |F=3, m_F=0⟩ and, at most, two Cs atoms in states |F=3, m_F ≠ 0⟩ <cit.>.\nIn the last step, a one-dimensional optical lattice formed by two counter-propagating 790 laser beams is used as a conveyor belt to transport the Cs atoms to a second crossed optical dipole trap located at an axial distance of about 208.\nHere, a coherent superposition of the Cs clock states is prepared, as explained in the subsequent section below, and the dynamical decoupling sequence is applied.\nImportantly, the Cs atoms are always trapped in the static optical lattice during the sequence. \nThe lattice creates a repulsive potential for the Cs atoms along the horizontal direction and thereby freezes the atoms' position in this dimension. This results in trapping frequencies of ω_ax = 2 π×60.7 and ω_rad = 2 π×694 in the axial and the radial direction, respectively. \nMoreover, it ensures that Cs-Cs interactions are negligible since, at most, one Cs atom can be trapped in each lattice site.\nAt the end of each dynamical decoupling sequence, a resonant laser pulse removes all Cs atoms in |F=4⟩  from the trap, and the optical lattice is used for spatially-resolved fluorescence imaging of Cs atoms in |F=3, m_F=0⟩. \n\n\n\n §.§ Qubit characterization\n\nWe start with a detailed characterization of the qubit transition before providing information about the dynamical decoupling sequence in Sec. <ref>.\nFor all measurements shown in the following, the external magnetic field at the atoms' position is calibrated to a value of 198.5 (see Appendix <ref> for further details on the magnetic field calibration).\n\nThe qubit's transition frequency is measured using microwave spectroscopy, taking care to avoid power broadening.\nThe corresponding resonant Rabi frequency Ω_R = 2 π×619(2) is independently measured, and Fig. <ref>(a) shows the spectrum of a microwave square pulse with τ = 725 duration. \nThe signal follows the typical shape of the spectrum of a Fourier-limited square pulse \n\n    N_Cs(δν_0) = A Ω_R^2/Ω^2sin^2 (Ωτ/2) + C,\n\nwhere Ω^2 = 4 π^2 (δν_0 - δν_0, res)^2 + Ω_R^2, and A  and C are the amplitude and the offset of the fit, respectively.\n\nThe peak frequency is shifted from the exact atomic resonance frequency ν_0 = 9.192 631 77 by δν_0, res= -133(12). \nThe two main contributions to this shift are the differential light shift δ_DT of the trapping field and the quadratic Zeeman shift δ_B. We find that the measured shift is in good agreement with the expected shift δν_0, theo= -123 calculated from experimental trapping parameters and the Breit-Rabi formula.\n\nFor dynamical decoupling sequences with multiple pulses, the pulse durations are  important timescales determining the duration of the sequences and must be short compared to all other experimental timescales.\nWe achieve for all dynamical decoupling measurements a resonant Rabi frequency of Ω_R = 2 π×21.14(4) [Fig. <ref>(b)], which corresponds to a π-pulse duration of τ_π = 23.65.\nThe Cs clock transition chosen is electric-dipole forbidden so that the excited state is long-lived, and T_1 decay occurs on the timescale of seconds and will therefore be neglected.  \nAnother important timescale is the lifetime of the Cs atoms in the optical lattice, which is limited by heating due to the relative phase noise between the two laser beams to about 685(81).   \nMoreover, a sufficient timescale separation between coherence time and π-pulse duration is required for realizing multi-pulse \nsequences.\nTo measure the coherence time in the absence of dynamical decoupling, we apply a Ramsey sequence consisting of two microwave π/2-pulses with variable sequence length T [Fig. <ref>(c)]. \nThe microwave frequency  is set to the unperturbed transition frequency ν_0, i.e., detuned by approximately 133 from the actual qubit resonance so that several fringes can be observed within the decay time. \nHowever, the pulses can still be approximated as near-resonant, as the detuning is much smaller than the bare Rabi frequency.\nFor such a sequence, the expected population dynamics can be described by\n\n    N_Cs(T) = A/2[1 - cos(2π |δν_0, res| T) e^ -(T/τ̃_c)^2] + C,\n\nwhere A and C are the amplitude and offset of the fit. \nPreviously, this functional behavior was a heuristic assumption that describes accurately the dynamics of the experiment. \nLater in this paper, in Sec. <ref>, we will provide a justification of this formula which is a consequence of the measured noise spectrum.  \nWe fit Eq. (<ref>) to our data in Fig. <ref>(c) and find a frequency shift of |δν_0, res|= 136.8(8), close to the frequency shift measured through microwave spectroscopy, and a coherence time of τ̃_c = 15.7(7).\nA detailed study on inhomogeneous and homogeneous dephasing effects causing decoherence in an ensemble of Cs atoms confined by a far-off-resonant standing-wave optical dipole trap can be found in Ref. <cit.>. \nInhomogeneous dephasing is mainly caused by inhomogeneous differential light shifts originating from the thermal motion of the atoms in the trapping potential, which lead to slightly different resonance frequencies among the ensemble.\nThe effect of this dephasing mechanism can be reversed by applying a spin-echo sequence comprising an additional π-pulse between the two Ramsey π/2-pulses. \nHomogeneous dephasing effects, instead, lead to homogeneous, time-dependent fluctuations of the transition frequency among the ensemble. \nThe main causes of homogeneous dephasing in our experimental setup are intensity fluctuations of the dipole trap laser and heating of the atoms (e.g., due to relative phase noise between the two lattice laser beams). \nFluctuating magnetic fields are another source of broadening which is, however, far less pronounced because of the use of magnetic-field-insensitive states. \nAdditional homogeneous dephasing sources, that play a minor role in our experimental setup, are the pointing instability of the dipole trap laser and imperfections of microwave pulses. \nDephasing caused by homogeneous broadening cannot be simply reversed by the spin-echo sequence.\nHere, we need to apply dynamical decoupling sequences, which extend the spin-echo scheme by using multiple π-pulses, to compensate for noise originating at different frequencies. \nThe theoretical background for this is presented in the following section.\n\n\n\n§ QUBIT COHERENCE IN A NOISY ENVIRONMENT\n\n We use a semiclassical model to describe the dynamics of the driven qubit coupled to environmental noise <cit.>. \n Hereby, we study the dynamics of the density matrix ρ̂ of the qubit, which is governed by the von Neumann equation\n\n    ∂ρ̂/∂ t=1/iħ[Ĥ,ρ̂].\n\nThe corresponding Hamiltonian is \n\n    Ĥ=ħΩ(t)/2σ̂_x+ħβ(t)/2σ̂_z,\n\nand reported in the frame rotating with the qubit eigenfrequency. \nHere, we have introduced the Pauli matrices σ̂_i with i=x,y,z of the two qubit states |F=3, m_F=0⟩ and |F=4, m_F=0⟩. \n\nThe driving of this qubit is described by the coherent, time-dependent Rabi frequency Ω(t). \nThe influence of the environment is encoded in fluctuations described by the stochastic process β(t). \nWe assume that this noise has a vanishing mean, ⟨β(t)⟩=0, and is determined by the time-correlation function C(t-t^')=⟨β(t)β(t^')⟩. The expectation values are taken over noise realizations.\nThe stochastic fluctuations are characterized by the noise spectrum\n\n    S(ω)=∫_-∞^∞ dt^' e^-iω t^' C(t^').\n\nIn our description, we have neglected noise-driven spin flips, which are expected to be relevant only on timescales much longer than we describe in the following. \nMoreover, in this work, we will consider a spectral density of the form \n\n    S(ω)=S_0/|ω|^α,\n\nwith a positive real number S_0>0 and a positive real exponent α>0, describing an algebraic decay of the spectral density. \nThis spectral density describes a variety of noise processes in various physical scenarios including 1/f-noise.\n\nSimilar to Ref. <cit.>, we derive a master equation which is valid in the weak coupling approximation. \nFor this, we transform into a frame which is rotating with the driving field Ω(t), with ϱ̂=Ûρ̂Û^† and Û(t)=exp(iΦ(t)σ̂_x/2), Φ(t)=∫_0^tdt^' Ω(t^'). \nThe dynamics of ϱ̂ is then governed by the master equation\n\n    ∂ϱ̂(t)/∂ t=-∫_0^tdt^' C(t-t^')/4{[Ĵ(t),Ĵ(t^')ϱ̂(t)]+h.c.},\n\nwhere we introduced Ĵ(t)=Û(t)σ̂_zÛ^†(t). \nThis master equation can be mapped to the Bloch equations for the polarization p=(p_x,p_y,p_z)^T=Tr[σϱ̂], with σ=(σ̂_x,σ̂_y,σ̂_z)^T. The Bloch equations are given by\n\n    d p/dt=-∫_0^t dt^' C(t-t^') M(t, t^') p(t)\n\nwith the matrix elements of M(t, t^')\n\n    M_xx=   cos[Φ(t)]cos[Φ(t^')]+sin[Φ(t)]sin[Φ(t^')],\n    \n    M_yy=   cos[Φ(t)]cos[Φ(t^')],\n    \n    M_yz=   -cos[Φ(t)]sin[Φ(t^')],\n    \n    M_zy=   -sin[Φ(t)]cos[Φ(t^')],\n    \n    M_zz=   sin[Φ(t)]sin[Φ(t^')].\n\nAll other matrix elements are equal to zero. We will consider the case where Ω(t) is a series of δ-shaped π-pulses applied at times t_j, described by Ω(t)=∑_j=1^Nπδ(t-t_j). \nIn this case, we find that sin(Φ)=0 for all times. \nThe initial state in this protocol is obtained after applying a π/2-pulse to the ground state. \nTherefore, the initial state is polarized in the y direction such that our initial conditions are p_x(0)=0, p_y(0)=1, p_z(0)=0. \nWith these initial conditions, we can solve Eq. (<ref>) and find p_x(T)=0, p_y(T)=V(T), p_z(T)=0, where T is the total integration time and where we have introduced the visibility\n\n    V(T)=e^-χ(T).\n The visibility is determined by the coherence integral \n\n    χ(T) = T^2/2π∫_0^∞ dω  S(ω) g(ω, T)\n\nand the filter function\n\n    g(ω,T)=   1/T^2|∫_0^T dt^' e^iω t^'cos[Φ(t^')]|^2 .\n\nFor the sequence of π-pulses, we obtain\n\n    g_N(ω, T) = | 1 + (-1)^1+N e^i ω T + 2 ∑_j=1^N (-1)^j e^i ω t_j|^2/(ω T)^2.\n\nUntil now, we have neither specified the instances t_j for the π-pulses nor the total integration time T. \nIn fact, the result given in Eq. (<ref>) is general and can be used for an arbitrary sequence of π-pulses. \nIn this paper, we employ the N-Carr-Purcell-Meiboom-Gill (N-CPMG) sequence, whose π-pulses are applied at times t_j = (2j-1)T/(2N) <cit.>, and the 1-CPMG sequence corresponds to the spin-echo sequence.\nThis pulse sequence consists of temporally equidistant π-pulses where the first pulse is applied at time t_1=T/(2N) and the last pulse at t_N=T-T/(2N) [see Fig. <ref>(a)].\nThe choice of the CPMG sequence enables a very efficient decoupling from noise with a spectrum S(ω) given by Eq. (<ref>), especially if we consider no high-frequency cut-off <cit.>.\n\nThis results from the filter function g_N(ω, T), which is shown in Fig. <ref>(b) for different N-CPMG sequences and a fixed sequence length T. \nThe filter functions' peaks shift to higher frequencies as the number of π-pulses is increased, resulting in different frequency ranges of the noise spectrum contributing to decoherence [Eq. (<ref>)]. Consequently, since the spectral density S(ω) [Eq. (<ref>)] is decreasing with ω, we obtain a lower total decoherence for an increasing number N of π-pulses.\nWe mention, however, that we could also have chosen another pulse sequence such as the Uhrig sequence <cit.> which would show a similar performance in reducing the decoherence.\n\nBesides the decoupling from noise, this band-pass filter property of g_N(ω, T) can also be exploited to perform noise spectroscopy.  \nHere, we vary the number N of π-pulses and the sequence length T such that the filter function samples the environmental noise spectrum S(ω). \nFrom the measured decoherence signal, we can then reconstruct the spectrum. \nTo demonstrate this, we first use that the sum in Eq. (<ref>) for the N-CPMG sequences can be written with the help of a geometric series\n\n    g_N(u)=|1+(-1)^1+Ne^iu+2e^iu/(2N)(-1)^Ne^iu-1e^iu/N+1|^2/u^2.\n\nHere, we have used that the expression of g_N(ω,T) for the N-CPMG sequence only depends on u=ω T. \nThe expression (<ref>) exhibits for large N a sharp peak whenever u=(2k+1)Nπ, where the denominator in the absolute value vanishes. \nFor large N, we can approximate the filter function as an infinite series \n\n    g_N(u) ≈∑_k=0^∞4/[(2k+1)π]^2sinc^2(u-(2k+1)Nπ/2),\n\nwith the introduction of sinc(x)=sin(x)/x. \nSince the slope of the spectral density Eq. (<ref>) is decreasing, and the appearing sinc functions in Eq. (<ref>) evaluate the noise spectrum at larger and larger frequencies, we can exchange in Eq. (<ref>) sinc^2(x)≈πδ(x) in the large N limit. \nWith this approximation, we can derive from Eq. (<ref>) the following formula\n\n    χ_N(T) ≈(T/τ_c)^1+α,\n\nwhere we have defined the coherence time\n\n    τ_c= N^α/(1+α)τ_1,\n\nusing\n\n    τ_1={4S_0π^-2-α[1-2^-2-α]ζ(2+α)}^-1/(1+α),\n\nand the Riemann ζ function ζ(s)=∑_n=1^∞ 1/n^s. This finding is in agreement with Ref. <cit.>.\n\nEquation (<ref>) shows that the exponent α can directly be inferred from the visibility V(T) <cit.>. \nThe latter exhibits an exponential behavior where the exponent of the argument is 1+α, determined by the algebraic behavior of the spectral density. \nMoreover, the coherence time τ_c [Eq. (<ref>)] is algebraically growing with the number N of pulses.  \nThis increasing coherence time can be understood by the shift of the filter function's peak towards higher frequencies for an increasing number N of π-pulses [see Eq. (<ref>) and Fig. <ref>(b)]. \nThe latter leads to a reduction in the net integrated noise and thereby to an enhancement of the coherence time.\nThe exponent of the growth is α/(1+α) which is monotonically increasing with increasing α. \nTherefore, the noise reduction is more pronounced if the noise spectrum decays faster. For α→∞, the coherence time is increasing linearly with N.\n\n\n\n§  N-CPMG MEASUREMENTS\n\nIn the experiment, the effect of a N-CPMG sequence on the coherence time is investigated by tracking the visibility of Ramsey fringes for different sequence lengths T. \nTo measure a Ramsey fringe for fixed T, we scan the phase φ of the second π/2-pulse from -185 to 185 in 10 steps and measure the Cs population in |F=3, m_F=0⟩ (Figs. <ref>(a) and <ref>(c), see Appendix <ref> for details on the normalization).\nWe fit a sinusoidal function <cit.>\n\n    P(T, φ) = a sin^2 (- π/360φ + π/360Φ) + c\n\nto the data, where a, c and Φ are the amplitude, the offset, and the free phase of the fit, respectively.\nThe fringe visibility is defined as \n\n    V(T) = P_max-P_min/P_max + P_min = a/a + 2c.\n\nEach data point in Fig. <ref>(c) is an average of typically 12 to 15 experimental runs resulting in a total measurement time of about 18 to 24 for each N-CPMG sequence.\nFigure <ref> shows the measured visibility evolution for different numbers of π-pulses ranging from N=0 to N=10. \n\nThe data points predict, in general, a decaying dynamics of the visibility, which is slower for a larger number N of π-pulses. \nTo get a more quantitative access to this data, we fit \n\n    V(T) = V_0   e^-χ_N (T) + b.\n\nto the measured visibility. \nFor the calculation of χ_N, we calculate the coherence integral in Eq. (<ref>) with the expected form of the spectral density in Eq. (<ref>) and the filter function given by Eq. (<ref>) for every number N of π-pulses. This assures that we also take into account small-N effects which are not present in the analytical result shown in Eq. (<ref>). Importantly, each N-CPMG data set owns its specific amplitude V_0 and offset b. \nIn contrast, the parameters S_0 and α are global fitting parameters shared among all N-CPMG data sets. \nThe fits are visible as the solid lines in Fig. <ref> and agree well with the data points. \nFrom our fit, we find an exponent α = 0.89(2) and the value S_0=1288(122)^1-α. \n\nIn addition, we can also extract the coherence time τ_c, which is defined as exp[-χ_N(τ_c)]=1/e, from these fits. \nThe values τ_c are shown in Fig. <ref> as data points in a color scheme that matches the one used for the visibility data shown in Fig. <ref> (N=0 black, N=1 green, etc.).\n\nIn the absence of dynamical decoupling (N=0), we find a coherence time of τ_c = 16.2(9).\nThis value is in agreement with the coherence time of τ̃_c = 15.7(7) obtained by fitting the population dynamics in Fig. <ref>(c) with Eq. (<ref>). \nWe want to underline that we have assumed a heuristic decay with exp[-(T/τ̃_c)^2] in Eq. (<ref>).\nTo validate this assumption, we can now compare this decay to the analytical result in Eq. (<ref>) which predicts a decay with exp[-(T/τ_c)^1+α] ≈exp[-(T/τ_c)^1.89].\nConsequently, the accurate result obtained from Eq. (<ref>) can be explained by the exponent α=0.89(2) which is close to one. For a growing number N of π-pulses, we obtain an increasing coherence time.  \nIn particular, we find for the maximum value of N=10 a coherence time of τ_c=178(2), which corresponds to an enhancement of more than one order of magnitude when compared to the N=0 case. \nTo compare these results with analytical estimates, we have calculated Eq. (<ref>) from the fitted value of α and S_0. \nThe result is shown as solid gray line in Fig. <ref> and agrees better for larger numbers of π-pulses. \nThe analytical estimate predicts an algebraic growth with N^α/(1+α)≈ N^0.47. Compared to the theory, the experimental results also suggest that the observed coherence time can be further extended by adding more π-pulses to the CPMG sequence since the Ramsey fringe visibility doesn't drop significantly. \nThis also implies that imperfections in the π-pulses play a minor role in our system.\nThe maximum number of π-pulses is eventually limited by the minimum pulse duration and the maximum sequence length. The former is determined by the available Rabi frequencies and the latter is constrained by the lifetime of the Cs atoms in the optical lattice. \n\nIn contrast to the strictly monotonous decaying fits visible in Fig. <ref>, our experimental data also show narrow dips in the visibility for N ≥ 6. These dips are highlighted in the insets of Fig. <ref>\nfor N=6,8,10. We expect that these dips originate from several resonances in the noise spectrum. In fact, already a single resonance gives rise to the appearance of multiple dips in the visibility. This can be seen by considering a spectral density\n\n    S(ω)=S_1e^-(ω-ω_0)^2/(2Δω^2)\n\nwhich describes phenomenologically a resonance at ω_0 with a finite width of Δω. \nUsing Eq. (<ref>) and Eq. (<ref>) in Eq. (<ref>), we expect multiple dips at times T_k(N)=(2k+1)Nπ/ω_0 for k=0,1,2,…. \nThis makes it very difficult to determine from the experimental data whether the dips result from different resonances or from a single resonance. \nIn particular, we could assume that the two dips in Fig. <ref>\nfor N=8 found at T_a and T_b with T_a≈120 and\nT_b≈200 originate from the same resonance ω_0. \nIn addition, if they correspond to neighboring dips, we can assume T_b/T_a=(2k+3)/(2k+1) which can be compared to the data, T_b/T_a≈1.67. \nThis suggests that k=1 is a good fit with T_b=T_2(N=8) and T_a=T_1(N=8). \nFrom this, we can estimate the frequency which is approximately ω_0≈ 2π×100. \n\nIn order to identify dominant contributions to the experimentally determined noise spectrum S(ω), we investigate common effects, such as intensity fluctuations of the dipole trap laser and magnetic field fluctuations, that have already been seen to cause homogeneous dephasing in ultracold atomic systems <cit.>.\nThe intensity fluctuations are measured by shining the trapping light of the horizontal dipole trap onto a fast photodiode. \nWe record the photodiode voltage as a function of time and calculate the power spectral density (PSD) S_DT of our discrete-time signal. In Fig. <ref>(a), S_DT is visible as the red curve.\n\nThe resulting PSD S_DT comprises two noise components\n\n    S_DT (ω) = S_PLNω^α̃+ S_WN,\n\nwhere the first component describes power-law noise with a characteristic, positive exponent α̃ and the second component describes white noise with a constant power spectral density S_WN.\nWe use Eq. (<ref>) as a fit model for our data in Fig. <ref>(a) and find an exponent α̃ = 0.8904(2). This fit is visible as black solid line in Fig. <ref>(a) and agrees very well with S_DT. \nImportantly, the fitted exponent coincides with α = 0.89(2) obtained from the measured visibility evolutions. \nThis suggests that the dominant contribution to the dephasing of the qubit originates from noise in the laser intensity which generates the dipole trap. Moreover, previously, we have estimated that some of the dips in the visibility data originate from a resonance of S(ω) at ω_0≈ 2π×100. Remarkably, a resonance at ω_0 is found in S_DT and can therefore explain such features in the visibility.\n\nTo quantify the magnetic field fluctuations, we cannot directly measure the fluctuations outside of the vacuum system because they differ from the fluctuations at the atoms' position.  \nInstead, we record the current through the magnetic field coils as a function of time and calculate the PSD of the signal. The resulting PSD, S_B, is shown as brown curve in Fig. <ref>(b).  Fundamentally different from S_DT, the PSD S_B is rather flat with no clear decay. \nSuch a noise spectrum would result in a very different evolution of the visibility. \nTherefore, we conclude that the background noise floor inferred from the measured coherence evolution is mainly caused by intensity fluctuations of the trapping light and not by magnetic field fluctuations. This finding highlights the magnetic-insensitivity of the two Cs clock states which have been used as stable qubit states. \n\n\n\n\n§ CONCLUSION AND OUTLOOK\n\nIn conclusion, we have studied the dynamics of a noise-coupled qubit realized in ^133Cs under the effect of dynamical driving. \nHereby, we have focused on a dynamical decoupling protocol, in particular the CPMG pulse sequence, that has increased the coherence time of the qubit by an order of magnitude. \nMoreover, from the visibility data, we were able to analyze properties of the environmental noise spectrum including its algebraic decay. \nFrom this, we have calculated analytical estimates for the coherence time which are in good agreement with the measured data. \nTo find the origin of the noise affecting the qubit dynamics, we have measured the PSDs determining the noise spectra of the dipole trap laser intensity and the magnetic field. \nWith these, we could show that the main noise source originates from the trapping laser intensity while magnetic field fluctuations play only a minor role. \nThe latter originates from the magnetic-insensitivity of the used qubit states. \nRemarkably, the algebraic decay obtained from the visibility data is in excellent agreement with the algebraic decay found in the PSD of the dipole trap laser intensity. \nThis highlights the ability to measure spectral properties of the environment with a dynamical probe. \n\nIn future work, we will investigate the dynamics of the ^133Cs qubit when it is coupled to a bosonic environment of ^87Rb atoms. \nThe qubit dynamics could then be analyzed to potentially measure properties of an interacting environment. \nThis is the next step towards the implementation of a single ^133Cs qubit as a versatile, nondestructive quantum probe for noise spectroscopy of engineered atomic baths. \nAn important prerequisite for this is that the lifetime of the qubit without the bosonic bath exceeds the lifetime in the presence of the ^87Rb atoms.\nBy comparing typical lifetimes obtained for the mixture <cit.>, τ_c,Rb≈1, which are one order of magnitude shorter than the shortest lifetime obtained in this paper, τ_c = 16.2(9), we conclude that this requirement is fulfilled.\nThis will enable the distinction of dynamical features emerging from, e.g., noise in the dipole trap laser intensity and features emerging from the bosonic ^87Rb bath.\n\nBesides its potential as a quantum sensor, this setup can also be used to explore the entanglement dynamics of the Cs qubit with the surrounding ^87Rb bath under dynamical driving. \nThis creates the possibility to study non-equilibrium phenomena in quantum many-body systems closely connected to spin-boson and polaron physics. \nAdditionally, it will be interesting to investigate the possibility of tailoring the qubit-bath coupling with periodic driving which opens the door to quantum-state engineering in open quantum systems.\n\n\nThis work was supported by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) via the Collaborative Research Centers SFB/TR185 (Project No. 277625399).\nS.B. acknowledges funding by Studienstiftung des deutschen Volkes.\n\n\napsrev4-2\n\n\n\n\n\n\n§ MAGNETIC FIELD CALIBRATION\n\nWe employ microwave spectroscopy on the |F=1,m_F=0⟩→|F=2,m_F=1⟩ transition of the ^87Rb ground state to precisely calibrate the magnetic field B_exp at the atoms' positions by compensating for the contributions B_bg of ambient fields.\nThe Rb atoms are trapped in the second crossed optical dipole trap and are initially prepared in the |F=1, m_F=0⟩ state.\nThe microwave frequency is fixed to the expected transition frequency given by the Breit-Rabi formula for the desired field magnitude B_exp=198.5, neglecting the small differential light shift δ_DT = 39 of the trapping field.\nWe vary the externally applied magnetic field B_coil, and thereby also the transition frequency of the Rb atoms, and probe the excited state population by standard absorption imaging using a time-of-flight measurement [Fig. <ref>(a)].\n\nThe microwave pulse duration τ = 243.9 is chosen such that full population transfer occurs as soon as the resonance condition B_coil+B_bg=B_exp is fulfilled.\nThe signal follows the typical shape of the spectrum of a Fourier-limited square pulse \n\n    N_Rb(B_coil) = A Ω_R^2/Ω^2sin^2 (Ωτ/2) + C,\n\nwhere Ω^2 = Δ^2 + Ω_R^2, Δ = 2 π× (B_coil - B_coil,res) ×0.7 in the limit of small magnetic fields and A  and C are the amplitude and the offset of the fit, respectively.\nNotably, the resonant Rabi frequency Ω_R = 2 π×2.180(5) is measured independently [Fig. <ref>(b)] so that A, C, and B_coil,res are the only free parameters of the fit.\n\n\n\n§ NORMALIZATION OF THE RAMSEY FRINGES\n\nThe Ramsey fringes with total Cs atom number [Fig. <ref>(a)] need to be normalized to calculate the fringe visibility according to Eq. (<ref>).\n\nWe rescale the data for a given number N of π-pulses and pulse sequence length T according to\n\n    P(T, φ) = N_Cs(T, φ)/N_Cs, tot(T),\n\nwhere the total number of Cs atoms contributing to the signal N_Cs, tot(T) depends on T due to the finite lifetime of the atoms in the optical lattice.\nFor each data set with a fixed number N of π-pulses, the total atom number N_Cs, tot(T) is deduced from two additional measurements.\nFirst, we extract the maximal number of Cs atoms contributing to the signal N_Cs,0 from a Ramsey fringe with N=0 π-pulses and shortest possible pulse sequence length T=27 [Fig. <ref>(b)]. \nSecond, we measure the lifetime  τ_LT of the Cs atoms in the optical lattice by monitoring the Cs atom number as a function of the pulse sequence length T without applying microwave radiation [Fig. <ref>(c)].\nWe find typical lifetimes between τ_LT = 539(37) and τ_LT = 831(72).\nThe total atom number, which sets the scaling factor for the normalization, is then given by\n\n    N_Cs, tot(T) = N_Cs,0exp(-T / τ_LT).\n\n"}