{"entry_id": "http://arxiv.org/abs/2303.06977v1", "published": "20230313102422", "title": "Topological dynamical quantum phase transition in a quantum skyrmion phase", "authors": ["Vipin Vijayan", "L. Chotorlishvili", "A. Ernst", "S. S. P. Parkin", "M. I. Katsnelson", "S. K. Mishra"], "primary_category": "cond-mat.str-el", "categories": ["cond-mat.str-el", "quant-ph"], "text": "\n\n\n\n\n\n\n\nDepartment of Physics, Indian Institute of Technology (Banaras Hindu University)\n\n\nDepartment of Physics and Medical Engineering, Rzeszów University of Technology, 35-959 Rzeszów, Poland\n\n\nMax Planck Institute of Microstructure Physics, Weinberg 2, D-06120 Halle, Germany\nInstitute for Theoretical Physics, Johannes Kepler University, Altenberger Straße 69, 4040 Linz, Austria\n\n\nMax Planck Institute of Microstructure Physics, Weinberg 2, D-06120 Halle, Germany\n\n\nRadboud University, Institute for Molecules and Materials, Heyendaalseweg 135, 6525AJ Nijmegen, Netherlands\n\n\n\nDepartment of Physics, Indian Institute of Technology (Banaras Hindu University)\n\n\n\n\n\n\n  Quantum skyrmionic phase is modelled in a 2D helical spin lattice.\n  This topological skyrmionic phase retains its nature in a large\n  parameter space before moving to a ferromagnetic phase. Next\n  nearest-neighbour interaction improves the stability and it also causes a shift of the\n  topological phase in the parameter space.  Nonanalytic behaviour of\n  the rate function observed, when the system which is initially in a\n  quantum skyrmion phase is quenched to a trivial quantum\n  ferromagnetic phase, indicates a dynamical quantum phase\n  transition. Dynamical quantum phase transition is absent when the\n  system initially in a skyrmion phase is quenched to a helical phase.\n\n\nTopological dynamical quantum phase transition in a quantum skyrmion phase\n    S. K. Mishra\n    March 30, 2023\n==========================================================================\n\n\n\nProgresses made in the last decade in controlling matter at quantum\nlevels allow access to real-time dynamics of closed quantum\nmany-body systems realisable\n<cit.>. This progress lifted the border\nbetween experimentally feasible physical reality and model\nsystems. Ultra-cold atoms in\noptical lattices and trapped ions are examples in which such dynamical phenomena \n were observed in real-time. Nowadays, we have full access to the real-time dynamics of\nquantum many-body and finite systems, either isolated or coupled to\nthe Markovian or non-Markovian environment. The experiments with THz\npulses in solids\n<cit.>, high magnetic\nfield pulse experiments <cit.>etc. are also\ndevelopments in recent past which can be aided by theoretical\nunderstanding of dynamical properties of the corresponding quantum\nsystems especially the study of the evolution of the system after a\nsudden change in its parameter or a quantum quench. When we talk about\nchanging the parameter of a system, the first thing that pops up in\nour mind is the term phase transition. Phase transitions are the\npoints in the parameter space of a system around which a small change\nin the control parameter manifests a drastic change to its\ncharacteristics. In a classical/thermal phase transition, the thermal\nfluctuations cause the destruction of long-range ordering and\nfacilitate the phase transition. But when we study the changes of the\nparameters at zero temperature or ground states the characteristics of\nthe phase transition become purely quantum, because here the phase\ntransition is facilitated by quantum fluctuations instead of thermal\nfluctuations. Such phase transitions are known as quantum phase\ntransitions. Equilibrium quantum phase transitions(EQPT) are studied\nextensively but we have a lesser understanding of quantum systems out\nof equilibrium. In order to theoretically aid the experimental\ndevelopments mentioned earlier we need to understand the dynamical\nquantum phase transitions(DQPT). Recent experimental developments\nidentified a signature of dynamical behaviour after a quench in a\nHaldane-like system <cit.>. Experiments with\ntrapped ions were able to directly observe DQPTs\n<cit.>. The theoretical inspiration for the\nDQPT can be extracted from Lee-Yang theorem, Fisher zero's and\naccompanying analysis. (For more details refer to <cit.>) \n\n\nFrom Lee-Yang analysis  <cit.> one can\narrive at the conclusion that for a partition function of external\nfields (like magnetic field), which also depended on the temperature\nT as Z(T), when zeros exist and have a positive real value then\neach of those roots corresponds to nonanalyticity in the free energy,\ni.e., phase transition. Fisher extended this analysis\nconsidering partition functions with complex temperature z instead\nof T, Z(z). When Fisher's zeros of Z(z) overlap with the real\naxis it produces nonanalyticities or phase transitions, however, no\nsuch overlaps is observed in the course of an EQPT. The real values of\nFisher's zeros correspond to a different kind of phase transition,\nnamely DQPT <cit.>. Using these\nanalyses essence of DQPTs can be explained briefly as follows\n<cit.>:  \n\nShort-lived non-equilibrium phase transitions accompanied with\na nonanalytic behaviour of physical quantities as a function of time\nis a characteristic feature of DQPTs  <cit.>. To study this we utilise a quantity\n𝒢 the Loschmidt amplitude as a function of time t, given as\n\n    𝒢(t)=⟨ψ_0| e^-iĤ t|ψ_0⟩.\n\nIn a sense, it plays the same role in the study of states out-of-equilibrium as \nthe partition function Z=Tr(e^-βĤ) in thermodynamic\nequilibrium case. Here Ĥ is the Hamiltonian of the system and\nβ is the inverse temperature and ψ_0 is the initial state\nof the system. Here Z can be seen as the kind of partition function\nconsidered by Lee and Yang(with inverse temperature in place of\ntemperature, still the conclusions of the analysis holds). And in the\nexponent term of 𝒢(t) if we take (it) as the complex\ntemperature, 𝒢 behaves like partition function of complex\ntemperature considered by Fisher. \n\nAnother quantity of interest is the rate function of the return\nprobability, Eq. <ref> (hereinafter\nreferred to as rate function) which is analogous to the thermodynamic\nfree energy. As discussed earlier during a phase transition the\nthermodynamic free energy, F=-ln(Z)/β, turns out to be a\nnonanalytic function of a control parameter. Based on the analogy we\nestablished so far, we expect to see a nonanalytic behaviour on\nℒ when there is a DQPT, since it is a dynamical analogue\nof thermodynamic free energy. The rate function is given as:\n\n    ℒ(t)=-lim_N→∞1/Nln|𝒢(t)|^2,\n\nwhere N is the number of degrees of freedom of the system.\n\n\n\nDQPT is intensively studied during the last decade\n<cit.>.\nIn the present work we are interested in the interplay between\ntopology and DQPTs considering the quantum skyrmion\n<cit.>. The scientific community is still\nfascinated about topological states of matter even though it has been\nover four decades since the discovery of the Quantum Hall state, the\nfirst discovered topological state <cit.>. Topologically\ndistinct states or topological states are those states, which are\nclassified based on a certain invariant <cit.>.\nSuch states are said to be identical when we can move from one state\nto another by applying continuous smooth deformations(deformations\nwhich do not close the bulk energy gap) without changing the value of\nthe invariant <cit.>. When the system shows this\nkind of resistance to deformation we say that it is topologically\nprotected. Conventional states, which are earlier believed to be the\nsame may become topologically distinct. We discover this only when the\naccompanying physical behaviour is detected, like in the case of the\nQuantum Hall effect.\n\nIn the past few decades, scientists discovered many topological\nmaterials and states like topological insulators\n<cit.>, topological\ncrystaline insulators <cit.>,\ntopological semi-metals <cit.>\netc. This classification is based on the behaviour of the corresponding\nband Hamiltonians in the reciprocal state. There are also nontrivial\ntopological objects determined by their characteristics in real space\nsuch as various types of topological defects in condensed matter\n<cit.>.\n\n\nMagnetic skyrmions are among the most popular types of topological\ndefects studied now. Skyrmions are particular examples of solitons\nthat can be informally defined as localized waves with a stable shape\n(for more accurate definition and detailed discussion see e.g.\n<cit.>). They are related to\npeculiar localized non-colinear magnetic textures within magnetic systems\n<cit.>. Skyrmions\nare promised to be potential information carriers for the next\ngeneration of spintronic devices <cit.>. New\nstudies suggest macroscopic skyrmion qubits design suitable for\nquantum computing technology controlling the helicity and dynamics of\nthe skyrmions through electric fields <cit.>.\n\nHelicity arises due to the peculiar non-collinear orientation of spins\nin helical spin systems(magnets) like skyrmions. In conventional\nmagnets spins align either parallel or anti-parallel, i.e. spins\nare collinear. Helicity is a measure of how much the spins are rotated\nabout a reference direction and its orientation. \n\nThese developments make the study of the dynamics of quantum skyrmions demanding.\n\nThe formation of magnetic order in spin systems depends\non different factors and competing interactions.\nA ferromagnetic or an\nantiferromagnetic spin order is a relatively simpler case.\n\nFormation of non-colinear magnetic textures is mainly fueled either by\ncompeting nearest-neighbor ferromagnetic and next nearest-neighbor\nantiferromagnetic or asymmetric exchange interactions termed as\nDzyaloshinskii–Moriya interaction (DMI). In most cases, the DMI is the\ndominant mechanism forming non-conventional magnetic textures\n<cit.>.\n\nRecently, the quantum analog of magnetic skyrmions has been suggested\nand studied\n<cit.>. However,\ncontrary to the classical skyrmion the quantum skyrmion is not\ntopologically stable in a rigorous sense. Qualitatively, it is not\nprotected with respect to the quantum tunneling to the topologically\ntrivial vacuum state. At the same time, it presents a quantum spin\nstate with quite a special character reminiscent of its topologically\nprotected classical analog. Here we use the words \"topological phase\"\nfor the case of quantum skyrmions in this, not completely rigorous but\nintuitively clear, sense. To better understand the nature of this\nstate we studied its real-time dynamical properties.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUnlike skyrmions,\n<cit.>\nhelical magnetic textures do not possess a topological invariant and a\ntopological protection. Any classification of 2D helical phases is\ndifficult, even properties of quantum skyrmions are not well explored.\nRecent attempts to discover quantum skyrmions show a certain degree of\nsuccess. Lohani et.al. <cit.> and Gauyacq et.al. <cit.> could identify magnetization\npatterns of a quantum skyrmion but topological protection of skyrmion\nphase was not explored. Sotnikov et.al. used a quantum scalar\nchirality to identify a topological\nprotection<cit.>.\n\n\n\n\nSiegl et.al. using\ntopological index and winding parameters, were able to identify a\nskyrmion phase and quantify its stability\n<cit.>. All these works could only find a skyrmionic\nphase in the ground state.  In the present work, we investigate\nthe stability of quantum skyrmions in higher excited levels as well.\n\n\nAn important question is the strength of the DM\ninteraction. DMI can be determined in experiments or\n  calculated accurately from first-principles <cit.>.   Our\ninterest is focused on materials with large DMI:\n<cit.>.\nIn recent experimental works H. Yang et.al\n<cit.> has shown that magnetic films sandwiched\nbetween nonmagnetic layers exhibit DMI with an electrically tunable\nstrength, i.e., Co films sandwiched between nonmagnetic\nlayers or MgO/Fe/Pt. The value of DMI in such materials\nlinearly increases with the applied external electric field\nD=D_0+g_MEE, where D_0 is the intrinsic DMI part, g_ME is\nthe magnetoelectric coupling and E is the external electric\nfield. Enhanced DMI can formally reach the order of exchange\ninteraction for a large electric field. The dynamic control of\nintrinsic magnetic interactions by varying the strength of a\nhigh-frequency laser field allows further enhancing of the ratio\nbetween DMI and exchange interaction constants\n<cit.>.\nThe idea relies on the fact that DMI and exchange interaction are both\nbased on hopping processes and that time-periodic fields renormalize\nthe electronic tunneling, leading to the effective rescaled DMI and\nexchange constants D≈4tΔ/U_0-U and\nJ≈4t^2/Ω^2(U_0-U). Here Δ describes the\nRashba spin-orbit coupling, t denotes the hopping amplitude, U_0-U\nis the gain in the Coulomb energy due to the electron displacement,\nand Ω is the frequency of the laser field.  Because of the\nfactor 1/Ω^2, the high-frequency laser field can substantially\nreduce the rescaled exchange constant to achieve the condition D>J.\nIn order to study Helical-Skyrmionic-Ferromagnetic phases we consider\nan array of spins formed in a triangular lattice. The spins are\narranged in such a way that it has a six-fold rotation symmetry (see\nFig. <ref>), also with periodic boundary conditions (PBC)\nit possesses translation symmetry.  The Hamiltonian of the system has\nthe form: \n\n    Ĥ=B∑_i 𝐒̂_̂î^̂ẑ+J_1∑_⟨ i,j⟩𝐒̂_̂î𝐒̂_̂ĵ+   J_2∑_⟨⟨ i,j⟩⟩𝐒̂_̂î𝐒̂_̂ĵ\n    \n     +∑_i<jD_i,j[𝐒̂_̂î×𝐒̂_̂ĵ],\n\n\nwhere summation in single brackets is taken over the nearest neighbors\nand in double brackets over the next-nearest-neighbors, B is an\nexternal magnetic field, and the DMI vector D is aligned\nperpendicular to the bond between lattice sites i and j, see inset\nof Fig. (<ref>). The direction of DMI vectors is chosen to\nensure that the six-fold rotation symmetry holds. We note that in\nhelical multiferroic insulators, the parameter D is an effect of the\nmagnetoelectric coupling g_ME with an external electric field E,\ni.e., D=g_MEE. Thus, the strength of the DMI term can be\ncontrolled externally <cit.>. Here we consider\nboth J_1(a ferromagnetic nearest neighbor exchange) and J_2 (an\nanti-ferromagnetic next nearest neighbor exchange) interactions along\nwith the DMI.\n\n\nAn array of spins read along with the above Hamiltonian with a\nspecific parameter set forms a quantum skyrmion. The nearest-neighbor\nferromagnetic J_1 term encourages colinear spin orientation while\nDMI term compels non-colinear spin texture. These two competing\ninteractions form classical skyrmions stabilized by the applied\nmagnetic field. Below we show that adding even small next nearest\nneighbor antiferromagnetic Heisenberg term J_2 improves the\nstability of quantum skyrmion structures. In general, it is well-known\nthat the J_2 term leads to the spin frustration and formation of\nantiferromagnetic classical skyrmions <cit.>\nHowever, quantum skyrmion structures are quite specific as compared to\nclassical skyrmions. In particular, quantum skyrmions do not possess\ncontinuous magnetic texture and topological charge. Therefore to infer\nthe quantum skyrmion state, we exploit another tool, such as scalar\nchirality.  The energy levels of the system Eq.(<ref>)\nshow a six-fold degeneracy even at very high magnetic field values. We\ncalculated the expectation values considering maximally mixed state of\nthese degenerate states with equal probability.\n\n\nWe used spin correlation functions to characterise quantum non-trivial\nmagnetic structures. In particular, we explore the Fourier transform\nof the longitudinal spin correlation function\nG_(q)=1N∑_ijG_(r_ij)exp(-iqr_ij),\nwhere N is the number of spins and the correlation function is given\nby\n\n    G_(r_ij)=1/Z∑_n⟨ n|Ŝ_i^zŜ_j^z| n⟩exp(-β E_n).\n\nwhere E_ns are the eigenvalues of the Hamiltonian of the system and\nr_ij is the distance between the lattice sites i and j.\n\n\nTopologically protected systems like skyrmions tend to show resistance\nto a deformation in its\nconfiguration<cit.>. Throughout\nthis work an applied magnetic field is considered as a cause of\ndeformation. In Fig. <ref>(A) and\nFig. <ref>(B) panels are arranged in the increasing\norder of applied magnetic field from left to\nright. Fig. <ref>(A) shows that the local\nmagnetisation is uniform and increasing magnetic field causes the\nlocal magnetisation to increase in the direction of the field. This\nobservation fails to identify any magnetic textures in the\nsystem. Fig. <ref>(B), multiple intensity spots\n(Bragg peaks) observed for nonzero q(Fourier conjugate of r\nor wave vector in reciprocal space) confirms formation of the quantum\nnon-trivial magnetic texture <cit.>.  This\nquantity could distinguish between helical and ferromagnetic phases\nbut it fails to identify skyrmionic phase within the helical phase. So\nwe require another quantifier that can trace out the skyrmion phase\nfrom helical and ferromagnetic phases.\n\nScalar chirality <cit.>\n\n    C_Ψ =𝒩/π⟨Ŝ_1[ Ŝ_2×Ŝ_3] ⟩.\n\nis considered as a distinguishing property of a helical spin\nsystem. When the chirality has a non-zero value we say that the system\nis in a helical phase. It is proposed that chirality can distinguish\nquantum skyrmion phase from other phases of the system\n<cit.>. \n\nIn this equation 𝒩 is the number of non-overlapping elementary triangular\npatches covering the lattice. Three adjacent spins form a\npatch. The scalar chirality for any of these three adjacent spin\ncombinations is the same, because of the translational and\nrotational symmetries of the lattice.\n\nIn Fig. <ref>(C) from B=0D to B=0.46D chirality\nincreases almost steadily. In this region no two deformed states have\nsame chirality value, therefore, all those states are topologically\nnon-identical. From B=0.46D till B=0.86D the plateau of scalar\nchirality implies that all the states in this region have a common\ntopological invariant and we call them topologically identical phase\nor simply topological phase. After crossing B=0.86D the system\nbriefly falls back to a helical phase. It is represented by a dip in\nchirality. Then around B=1.0D the system goes to the trivial\nferromagnetic phase indicated by zeros of scalar chirality.\n\nHere we notice that the scalar chirality is again invariant for the\nferromagnetic phase. So we may say that ferromagnetic phases are also\ntopologically identical. But that is too trivial to be worthy of any\nmention. \n\n\nIn Fig. <ref>(C) The magnetisation\ngraph is telling us that for the region where we have plateau in\nchirality the magnetisation is not same for any two states i.e.,\nthe system is in fact undergoing deformation during the constant\nchirality plateau also. \n\n\nThe phase diagram (Fig. <ref>(D)) shows that for\nnon zero J_2 the invariance of scalar chirality extends for larger\nvalues of the applied magnetic field compared to J_2=0. The skyrmion\nphase is embedded into the helical phase. For a larger value of the\ninteraction parameter J_2, the system retains the skyrmion phase for\na longer range of applied magnetic field. We studied the scalar\nchirality not only in the ground state but also in several excited\nstates. We see that the skyrmion state survives in first and second\nexcited states as well as a certain degree of topological invariance\ncan be seen in higher excited states, see\nFig. <ref>. When J_2=0D we arrive at the\nresults from O. M. Sotnikov et. al. <cit.>. For higher values of\nJ_2(J_2>0.35D) the plateau gets distorted. \n\n\n\n\nHere we\nshow that an important information about helical and quantum skyrmion\nphases can be obtained from the analyses of topological DQPTs. Namely,\nwhen quenching the system from a quantum skyrmion to a\ntopologically trivial phase, we observe a characteristic signature\nof a DQPT as a nonanalyticity in the rate function.  On the other hand,\na quench between a skyrmion and a helix does\nnot lead to a DQPT.\n\nLet the system be prepared in the ground state |ψ_0⟩ of\nthe Hamiltonian Ĥ_0=Ĥ(λ_0). At t=0 the parameter\nλ is quenched to a new value Ĥ(λ_f) and the initial\nwave function is evolved to a new state\n|ψ(t)⟩=e^-iĤ t|ψ_0⟩ under this new\nHamiltonian. In order to describe the DQPT we study the Loschmidt\namplitude (return amplitude) and the rate function, in the\nthermodynamic limit\n<cit.>.\n\n\n\nOur primary interest concerns DQPTs between a quantum skyrmion phase\nand a trivial phase. The quench protocol applied on a topological\nphase to a trivial (skyrmion to ferromagnet) phase produced a\nnonanalytic behaviour of the rate function with respect to time.  The\nresult is plotted in Fig. <ref>(A). On the other hand, when\nswitching between a skyrmionic phase to a helical phase, we do not\nobserve any DQPT. We can confirm this from the lack of nonanalytic\nbehaviour of the rate function when plotted against time in\nFig. <ref>(B). Here we looked for nonanalyticity with\ndifferent values of the parameter B but we could not find any. The\npresence of nonanalyticity in the former case can be explained by a\nsharp and discontinuous transition of C_ψ from\nskyrmionic to trivial phase in Fig. <ref>(C). Similarly the lack of nonanalyticity in the later case is\ndue to the smooth and continuous transition of C_ψ\nfrom helical to skyrmionic phase. From Fig. <ref>(A) the\ncritical exponent α = 0.7020 ± 0.0233 around t_c =\n9.66. The value turned out to be very close to this for other\ncritical points as well (see supplementary methods for details\n<cit.>, see, also, references <cit.> therein). Further study is required with larger system\nsizes(L=3i(i+1)+1,   i=3,   4,  5,  ...) in order to comment on\nthe universality of the critical exponent that we calculated.\n\n\nWe have computational limitations to analyzing finite-size effects and\nartifacts of a particular quantum skyrmion state in our\nsystem. However, we performed the study of the finite-size effects\nusing another quantum skyrmion state obtained for a slightly different\nmodel in <cit.>. The results of the calculations\nare shown in <cit.>. We see the same trend for this case\nalso, i. e., non-analytic singularities in the rate function\nduring the dynamical quantum phase transition between the skyrmion and\nFM phases. Thus obtained results are pretty universal and apply to any\nquantum skyrmion. The reason for the universal effect is the\northogonality of quantum skyrmion and FM states. This argument is\nvalid for any quantum skyrmion independently of its size.\n\n\nApart from this, we achieved a significant improvement of the\ntopological phase stability with our model compared to the previous\nworks\n<cit.>. We\nnote that within a skyrmionic phase a larger J_2 value gives a\ntopological phase protection against a larger range of applied\nmagnetic fields. At high values of J_2 the topological invariance is\ndestroyed. This result tells us that the key for tunability and\nimproved stability of quantum skyrmions can be the interaction\nparameter, this may be useful when choosing the material to realise\nskyrmions for experiments. This kind of model is realized in Pd/Fe/Ir(111) system with Co surrounded edges\n<cit.>. Also nanoscale skyrmions are reported at room\ntemperature with large DMI interaction in Ir/CoFeB/MgO systems\n<cit.>.\n\nIn conclusion, the quantum skyrmion model proposed above shows\nsignificant improvement in topological protection. In the said model\nwe identified a robust DQPT when quench protocol is applied from a\nskyrmionic state to a ferromagnetic state. Robust DQPTs accompany many\ninteresting properties.  An interesting direction is to look for the\nconnection between entanglement dynamics and DQPTs in a skyrmionic\nphase. Certain systems have reported to show an enhanced entanglement\nentropy around critical points of DQPTs <cit.>.\n\n\n\n§ ACKNOWLEDGEMENT\n\n\nWe would like to sincerely thank O. M. Sotnikov for discussion related\nto the initial stage of this work. We acknowledge National\nSupercomputing Mission (NSM) for providing computing resources of\n‘PARAM Shivay’ at Indian Institute of Technology (BHU), Varanasi,\nwhich is implemented by C-DAC and supported by the Ministry of\nElectronics and Information Technology (MeitY) and Department of\nScience and Technology (DST), Government of India.  A.E. acknowledges\nfunding by Fonds zur Förderung der wissenschaftlichen Forschung (FWF)\ngrant I 5384. The work of MIK is supported by European Research\nCouncil via Synergy Grant 854843 - FASTCORR. SKM acknowledges Science\nand Engineering Research Board, Department of Science and Technology,\nIndia for support under Core Research Grant CRG/2021/007095.\n\n\n\n\napsrev4-1\n\n\n\n"}