{"entry_id": "http://arxiv.org/abs/2303.06974v1", "published": "20230313101927", "title": "Reduced uncertainties up to 43\\% on the Hubble constant and the matter density with the SNe Ia with a new statistical analysis", "authors": ["Maria Giovanna Dainotti", "Giada Bargiacchi", "Shigehiro Nagataki", "Malgorzata Bogdan", "Salvatore Capozziello"], "primary_category": "astro-ph.CO", "categories": ["astro-ph.CO", "astro-ph.HE"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFirst and second authors share the same contribution.\nCorresponding author, maria.dainotti@nao.ac.jp\nNational Astronomical Observatory of Japan, 2 Chome-21-1 Osawa, Mitaka, Tokyo 181-8588, Japan\nThe Graduate University for Advanced Studies, SOKENDAI, Shonankokusaimura, Hayama, Miura District, Kanagawa 240-0193, Japan\nSpace Science Institute, 4765 Walnut St, Suite B, 80301 Boulder, CO, USA\n\nScuola Superiore Meridionale,\n                Largo S. Marcellino 10,\n                80138, Napoli, Italy\nIstituto Nazionale di Fisica Nucleare (INFN), Sez. di Napoli,\n                Complesso Univ. Monte S. Angelo, Via Cinthia 9,\n                80126, Napoli, Italy\n                \nInterdisciplinary Theoretical & Mathematical Science Program, RIKEN (iTHEMS), 2-1 Hirosawa, Wako, Saitama, Japan 351-0198\nRIKEN Cluster for Pioneering Research, Astrophysical Big Bang Laboratory (ABBL), 2-1 Hirosawa, Wako, Saitama, Japan 351-0198\nAstrophysical Big Bang Group (ABBG), Okinawa Institute of Science and Technology Graduate University (OIST),\n1919-1 Tancha, Okinawa, Japan 904-0495\n\n University of Wroclaw, plac Grunwaldzki 2/4, Wroclaw, Lower Silesia Province, 50-384, Poland\nDepartment of Statistics, Lund University, Box 117, SE-221 00 Lund, Sweden\n\nScuola Superiore Meridionale, \n                Largo S. Marcellino 10,\n                80138, Napoli, Italy\nIstituto Nazionale di Fisica Nucleare (INFN), Sez. di Napoli,\n                Complesso Univ. Monte S. Angelo, Via Cinthia 9,\n                80126, Napoli, Italy\nDipartimento di Fisica \"E. Pancini\" , Universitá degli Studi di  Napoli \"Federico II\"\n\n                Complesso Univ. Monte S. Angelo, Via Cinthia 9\n                80126, Napoli, Italy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nType Ia Supernovae (SNe Ia) are considered the most reliable standard candles and they have played an invaluable role in cosmology since the discovery of the Universe's accelerated expansion. During the last decades, the SNe Ia samples have been improved in number, redshift coverage, calibration methodology, and systematics treatment. These efforts led to the most recent “Pantheon\" (2018) and “Pantheon +\" (2022) releases, which enable to constrain cosmological parameters more precisely than previous samples. In this era of precision cosmology, the community strives to find new ways to reduce uncertainties on cosmological parameters. \nTo this end, we start our investigation even from the likelihood assumption of Gaussianity, implicitly used in this domain. Indeed, the usual practise involves constraining parameters through a Gaussian distance moduli likelihood. This method relies on the implicit assumption that the difference between the distance moduli measured and the ones expected from the cosmological model is Gaussianly distributed. In this work, we test this hypothesis for both the Pantheon and Pantheon + releases. We find that in both cases this requirement is not fulfilled and the actual underlying distributions are a logistic and a Student's t distribution for the Pantheon and Pantheon + data, respectively. When we apply these new likelihoods fitting a flat ΛCDM model, we significantly reduce the uncertainties on Ω_M and H_0 of ∼ 40 %. This boosts the SNe Ia power in constraining cosmological parameters, thus representing a huge step forward to shed light on the current debated tensions in cosmology.\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nThe most accredited Universe parametrization is the ΛCDM model <cit.>, which includes a cold dark matter (CDM) component and a cosmological constant Λ <cit.>, as suggested by the Universe accelerated expansion<cit.>. Predictions from this scenario are compatible with the cosmic microwave background <cit.>, the baryon acoustic oscillations <cit.>, and SNe Ia. Nevertheless, the ΛCDM model suffers from theoretical and observational shortcomings: the cosmological constant problem <cit.>, the fine-tuning, the origin and properties of dark energy, and the Hubble constant (H_0) tension, the discrepancy between the H_0 value obtained from the Planck data of the CMB within a flat ΛCDM model (H_0 = 67.4 ± 0.5   km s^-1 Mpc^-1, ), and the local H_0 from SNe Ia and Cepheids (H_0 = 73.04 ± 1.04   km s^-1 Mpc^-1, ). This discrepancy varies from 4.4 to 6 σ when different samples are considered <cit.>.\nTime-delay and strong lensing from quasars <cit.> provide a value close to SNe Ia, while cosmic chronometers favor the CMB H_0 <cit.>. Instead, quasars <cit.>, the Tip of the Red-Giant Branch <cit.>, and Gamma-ray bursts <cit.>, hint at a H_0 value halfway between these two.\nSo, the H_0 tension remains an open question. One way to better highlight the tension is to reduce H_0 uncertainty.\nTowards this goal, we have questioned the Gaussianity assumption on the likelihood traditionally used for SNe Ia. The common practise of constraining cosmological parameters with a Gaussian distance moduli likelihood, L_Gauss, relies on the implicit assumption that the difference between the distance moduli, μ, measured and expected from a cosmological model, normalized to the uncertainty, is normally distributed. We investigate this assumption, for the Pantheon <cit.> and Pantheon + <cit.> samples. \n\n\n\nSection <ref> introduces the SNe Ia samples. Section <ref> presents the Gaussianity tests, and the implementation of new likelihoods in cosmological fits in the flat ΛCDM model. In Section <ref>, we describe the results. In Section <ref> we draw our conclusions.\n\n\n\n\n§ METHODOLOGY\n\n\n\n\n\n §.§ Data\n\n\nWe use the “Pantheon\" <cit.> and the “Pantheon +\" <cit.> samples. \nThe first includes 1048 sources in the redshift range z=0.01 - 2.26, \nthe latter counts 1701 SNe Ia from 18 different surveys in the range z=0.001 - 2.26. \n\n\n\n\n\n\n\n\n §.§ The distance moduli\n\n\n\n\n\nTo apply SNe Ia as cosmological tools, we compute the difference between the observed and the theoretical distance moduli, μ.\n\n The observed μ is\n\n    μ_obs = m_B - M + α x_1 - β c + Δ_M + Δ_B\n\nwhere m_B is the B-band overall amplitude, x_1 the stretch parameter, c the color, α and β the coefﬁcients of the relation of luminosity with x_1 and c, respectively, M the fiducial B-band absolute magnitude of a SN with x_1 = 0 and c=0, Δ_M and Δ_B the corrections on the distance accounting for host-galaxy mass and biases, \nrespectively <cit.>.  SNe Ia alone cannot determine H_0, as it is degenerate with M\n\n<cit.>.\n\nNevertheless, H_0 can be derived by fixing M.\nUsually, Cepheids are used to determine M <cit.>. <cit.> fix M=-19.35, \nimplying H_0 = 70  km s^-1 Mpc^-1 <cit.>. <cit.> obtain M = -19.253 ± 0.027 and H_0 = 73.04 ± 1.04   km s^-1 Mpc^-1 combining 42 SNe Ia with a sample of Cepheids hosted by the same galaxies. This value of M is assumed to compute μ for the Pantheon +. \nThe theoretical μ, assuming a flat ΛCDM model \nis <cit.>:\n\n\n\n\n\n\n    μ_th = 5  log_10  d_l (Mpc) + 25 = 5   (1+z_hel) c/H_0 ∫^z_HD_0d z'/√(Ω_M (1+z)^3 + (1- Ω_M)) + 25\n\nwhere d_l is the luminosity distance, c the light speed, Ω_M the current matter density, z_hel the redshift in the heliocentric frame, and z_HD the redshift corrected for CMB dipole motion and peculiar velocity. \n\n\n\n\n\n\nIn <cit.> for the evaluation  of cosmological parameters the χ^2 is defined as \n\n    χ^2=Δμ^T C^-1Δμ\n\nwhere Δμ = μ_obs - μ_th and C is the uncertainty matrix built as C= D_stat + C_sys, with D_stat the diagonal matrix with statistical errors and C_sys the systematic covariance matrix, both provided by SNe Ia releases \n<cit.>. \n\n\n\n \n\n\n\n\n\n §.§ The Gaussianity assumption in the likelihood\n\n\n\n\nWe investigate if the argument Δ_μ/σ_μ of the likelihood of SNe Ia distance moduli (L) in the Pantheon and Pantheon + fulfills the Gaussianity condition within a flat ΛCDM model with Ω_M = 0.3 and H_0 = 70  km s^-1 Mpc^-1.\nWe indicate with σ_μ the uncertainty on μ.\nTo this end, we apply several methods to test if  Δμ/σ_μ is normally distributed. We have applied all the tests to all individual data points of Δ_μ/σ_μ and not in bins. \nμ_obs in Equation (<ref>) is taken \nfrom <cit.>\n\nand <cit.>\n\n, while μ_th is specified in Eq. (<ref>). When the likelihood is Gaussian there is the implicit assumption that the residual, the argument in the formula of the likelihood (Δμ/σ_μ in Eq. (<ref>)), must be Gaussian. Moreover, the discussion about Gaussianity in the large structure analysis has been already treated in <cit.> along with the impact of the Gaussian assumption on cosmological parameters.\n\nWe apply the Anderson-Darling <cit.> and Shapiro-Wilk <cit.> normality tests, and we compute skewness and kurtosis of the distributions, the skewness <cit.>, the kurtosis <cit.> and a test that combines both features <cit.> [These analyses are performed with the scipy Python package.].  \nThe Anderson-Darling and Shapiro-Wilk tests determine whether a data sample is drawn from the Gaussian distribution, and they are frequently applied in the literature (e.g.  in astrophysics and  in statistics).\nAn important property of these tests is their consistency: they can identify any small deviation\nfrom normality, if the sample size is large enough <cit.>. Therefore, the larger the sample size, the more these tests tend to reject the null hypothesis of normal distribution <cit.>, even in case of very small deviations from Gaussianity\nsuch as in presence of ties caused by limited measurement precision (i.e. the number of decimals). \nThis weakness limits the applicability of the Anderson-Darling and Shapiro-Wilk tests.\n\n\n\n\nThus, we include investigations on skewness and kurtosis. The skewness is the third standardized moment and measures the asymmetry of the distribution as it identifies extreme values in one tail versus the other. The kurtosis is the fourth standardized moment and measures extreme values in both tails: large kurtosis corresponds to more populated tails than the ones of a Gaussian distribution, small kurtosis to less populated tails than the ones of a Gaussian distribution. \nA normal distribution has skewness and kurtosis equal to zero[We consider Fisher’s definition of kurtosis, in which 3 is subtracted from the result to give 0 for a normal distribution.].\n\n\n\n\n\nFurthermore, we apply the “skewness+kurtosis\" test, which contemporaneously checks departures of skewness and kurtosis from Gaussians. These complementary methods are crucial to obtain reliable results.\n\n\n\n\n\n §.§ Fit with the new likelihoods\n\n\n\nSince the tests described above fail (Sec. <ref>), we further extend our analysis. First, we fit the Δμ/σ_μ values  \nto find the best-fit distribution.\nThe found distribution is used in L (L_new) instead of the Gaussian probability distribution function (PDF).\nThus, we fit the flat ΛCDM model with the D'Agostini method <cit.> using L_new and considering these cases: H_0 fixed and Ω_M free, Ω_M fixed and H_0 free, and both parameters free. \nWe impose wide uniform priors 0 ≤Ω_M ≤ 1 and 50  km s^-1 Mpc^-1≤ H_0 ≤ 100  km s^-1 Mpc^-1 to guarantee that the parameter's space is explored in all physical regions.\n\nWe then repeat the fit with L_Gauss, thus comparing the outcomes.\n\n\n\n\n\n\n\nFurther, we test how the cosmological constraints vary if we change the assumptions on the fixed parameter in the cases of one free parameter. \n\n\nWe consider Ω_M = 0.30 and Ω_M = 0.34, respectively from <cit.> and <cit.>.\n\nWe investigate H_0 = 73.04  km s^-1 Mpc^-1 from <cit.>, and H_0 = 70  km s^-1 Mpc^-1 based on <cit.> \nand chosen arbitrarily <cit.>.\n\n\n\nWe compare our H_0 with the ones from Pantheon (P), Pantheon + (P+), and the CMB, by computing the z-score (ζ), a method to evaluate the statistical distance between a value and its reference value. ζ is defined as ζ= |H_0,i - H_0,our|/ √(σ^2_H_0,i + σ^2_H_0,our) where i is one of the three H_0 reference values with its 1 σ uncertainty. H_0,our and σ_H_0,our are the H_0 and its 1 σ error obtained in our computations. In Table <ref> ζ_CMB is calculated referred to H_0 = 67.4 ± 0.5  km s^-1 Mpc^-1, ζ_P compared to H_0 = 70.00 ± 0.13  km s^-1 Mpc^-1, and ζ_P+ with respect to H_0 = 73.04 ± 1.04  km s^-1 Mpc^-1.\n\n\n\n\n§ RESULTS\n\n\n\n\n\n §.§ Gaussianity tests results\n\n\n\nBoth SNe Ia samples do not pass neither the Anderson-Darling nor the Shapiro-Wilk tests.\n\n\n\n\nGiven the limits of these methods, we compute the skewness and kurtosis of the Δμ normalized distributions. The Pantheon sample has skewness = -0.19 and kurtosis = 0.69\n\n, while the Pantheon + presents the same skewness, but\n\nkurtosis = 4.2 (see Fig. <ref>). Neither of the samples passes the skewness, kurtosis and “skewness+kurtosis\" tests.\n\nWe also verify that these results are independent on the assumed Ω_M and H_0.\n\n\nUnexpectedly, the Gaussianity implicit assumption for SNe Ia (Δμ)/σ_μ <cit.> is not statistically legitimated and it should be checked for each SNe Ia sample used. \n\n\n\n §.§ New best-fit distributions\n\n\n\nThus, the Δμ distributions are not well-fitted by the Gaussian PDF\n\n\n\n    PDF_Gaussian = 1/√(2  π) σ  e^-1/2(x- x̂/σ)^2=1/√(2  π) σ  e^-1/2χ^2\n\nwhere x̂ is the mean, σ is the standard deviation, x -x̂=Δμ and χ^2 is the same defined in Eq. (<ref>).\nHence, we fit the Δμ histograms (see Sec. <ref>) obtaining as the best fit for the Pantheon sample a logistic distribution, with the following PDF\n\n\n    PDF_logistic = e^-(x-x̂)/s/s  (1+ e^-(x-x̂)/s)^2\n\nwhere  s is scale and the variance σ^2 is σ^2 = (s^2  π^2)/3. \nLeft panel of Fig. <ref> shows the best-fit distributions normalized with the uncertainties on the singular SNe Ia, σ_μ, of the logistic with x̂= -0.004 and s=0.08 (orange) and the Gaussian with x̂=0.0007 and σ= 0.14 (green). \n\nThe best fit for the Pantheon + is a Student's t-distribution, for which the generalized PDF is\n\n\n    PDF_student = Γ(ν +1/2)/√(ν π)  s  Γ(ν/2) [1 + ((x- x̂)/s)^2/ν]^-ν +1/2\n\nwhere Γ is the gamma function, ν are the degrees of freedom, and σ^2 = (s^2  ν) / (ν -2). \n\n\n\nThe best-fit distributions of the Student's t with x̂= 0.1, s=0.12, and ν = 3.8 (orange) and the Gaussian with x̂=0.096 and σ= 0.19 (green) are shown in the right panel of Fig. <ref> where the distribution is normalized with the SNe Ia uncertainties, σ_μ (Eq. (<ref>)).\n\n\n\n\n\n\n\nWe have proved that the logistic for the Pantheon and the Student-T distribution for the Pantheon + are favoured against the Gaussian distributions with the Bayesian Information Criterion (BIC). We used for comparison the table in <cit.> to distinguish among the most favoured models. We have used the definition of 2log_e(B_10), where the Bayes factor B_10=e^((BIC_0-BIC_1)/2) <cit.>, B_0 is the reference model (the Gaussian), and B_1 is the alternative model (either the logistic or the T-student distribution). Thus, 2log_e(B10)=BIC_0-BIC_1=Δ_BIC. We found Δ_BIC,Pantheon=6 showing strong evidence for the Logistic against the Gaussian distribution, and Δ_BIC,Pantheon+=134 showing very strong evidence for the T-Student against the Gaussian for the Pantheon+. By definition, for 6 ≤Δ_BIC≤ 10 the evidence against the null hypothesis (the Gaussian being the favorite the model) is strong, when Δ_BIC>10 the evidence against the null hypothesis is very strong.\n Moreover, we have proved the goodness of the fits with the Anderson-Darling one-sample test. The results yield a probability value that the fit is not randomly drawn, p=0.96 for the Pantheon sample for the logistic distribution, and p=0.86 for the Pantheon + for the Student-T distribution.\n\n\n\n\n §.§ Cosmology with the Gaussians and new likelihoods\n\n\n \n\n\nUsing L_new, we fit the flat ΛCDM model on the Pantheon and Pantheon + samples (see Section <ref>). Table <ref> reports the best-fit values with 68% confidence level. Panels (b) and (f) of Figs. <ref> and <ref> and panel (b) of Fig. <ref> show the corner plots from the logistic L (L_logistic), while panels (d) and (h) of Figs. <ref> and <ref> and panel (d) of Fig. <ref> the ones from the Student's t L (L_Student). For the Student's t, we treat ν as free parameter.\n\n\n\n\n\n\n\n\nThe results of the fit of the flat ΛCDM model with L_Gauss are shown in Table <ref> and\n\n\nin panels (a), (c), (e), and (g) of Figs. <ref> and <ref> and panels (a) and (c) of Fig. <ref>.\n\n\nConsidering the Pantheon sample, the cosmological parameters obtained with L_Gauss and L_logistic are compatible in 1 σ, except for Ω_M when H_0 = 73.04  km s^-1 Mpc^-1, that shows a 2-3  σ discrepancy. \n\nConcerning the uncertainties,\n\nL_logistic shows significantly tighter constraints when both Ω_M and H_0 are free parameters: the errors on Ω_M and H_0 are reduced by 43 % (from 0.021 to 0.012) and 41 % (from 0.34 to 0.20), respectively. Same conclusions are drawn for the Pantheon +. The only difference is that\n\nthe 3  σ discrepancy in Ω_M emerges when H_0 = 70   km s^-1 Mpc^-1.\n\n\nThis can be ascribed to the H_0 = 73.04   km s^-1 Mpc^-1 assumed for Pantheon +.\n\n\nThe use of L_Student reduces the errors on Ω_M and H_0, when both are free parameters, by 42 % (from 0.019 to 0.011) and 33 % (from 0.24 to 0.16), respectively.\nFurther, <cit.> reported Ω_M = 0.315 ± 0.007. Thus, the discrepancy with the values in Table <ref>, when Ω_M and H_0 are free, increases using L_new due to the reduced errors. Quantitatively, L_logistic shows a 2 σ discrepancy compared to 1 σ of L_Gauss, while L_Student increases the discrepancy from 2 to 3 σ.\n\n\n\nOur analysis also reveals interesting trends when comparing the cosmological results from the two SNe Ia samples, independently on the L considered. With Pantheon, we recover Ω_M = 0.3 and H_0 = 70   km s^-1 Mpc^-1, as in <cit.>, except when assuming Ω_M =0.34 and H_0 = 73.04   km s^-1 Mpc^-1. \n\n\n\nConversely, with Pantheon +, we recover Ω_M = 0.35 and H_0 = 73  km s^-1 Mpc^-1 as in <cit.> and <cit.>, except when fixing H_0 = 70  km s^-1 Mpc^-1.\n\n\n\n\nThe significant shifts in Ω_M\nshow how strongly the choice of \n\nM (and thus H_0) used to compute μ affects the cosmological results.\n\nWe have performed reverse engineering reasoning: we have used the same distance moduli provided by <cit.> and <cit.> by using the covariance matrix which include both statistics and systematic uncertainties.\nWhen we do a parameter survey of H_0 with the uniform priors 50  km s^-1 Mpc^-1 < H_0 < 100  km s^-1 Mpc^-1, we have not renormalized the Pantheon data and Pantheon + data with a different M value. Thus, if the true value of the data would have led naturally to H_0= 70  km s^-1 Mpc^-1 the values of M would have even weighed more towards the initially fixed value of H_0= 70  km s^-1 Mpc^-1. This is not the case. \n We have used the same assumption on H_0 used in <cit.> and in <cit.>. Thus, if there was no hidden selection selection biases or redshift evolution at play, we should have recovered the values of the assumption for Ω_M. However, when we fix this value of H_0 we have a varying Ω_M as an inherent evidence of an evolving trend in H_0 already extensively discussed in <cit.> for which <cit.> have further provided a theoretical explanation.\nThis trend of Ω_M (also discussed in ) can be either the consequence that we are forcing the value of H_0 to be fixed while an evolving trend is present in the data or that there is an inherent crisis of the ΛCDM model that brings to an evolving trend of Ω_M. \nAnother possibility is that there are selection biases or evolutionary effects at play which are still unclear. \nThe difference in the trend of Ω_M and H_0 could be due to the fact that in the local Universe we do not see a dependence on Ω_M and H_0 which instead is revealed at high-z. Anyhow, regardless of the physical meaning and the explanation such a trend is revealed in the data and is important to highlight the impact associated with the quantification of the H_0 tension.\nThe evolving trend of H_0 is shown also in <cit.> with H(z) and additional data samples for the SNe Ia.\n\n\n\n\nAdditionally, we compute ζ (see Sec. <ref>) for each cosmological computation (Table <ref>).\n\nThe high ζ_P values (∼ 20) when calculated for the Pantheon + sample may depend on the smaller error on the reference value H_0 = 70.00 ± 0.13  km s^-1 Mpc^-1 compared to the errors of the reference values pertinent to ζ_CMB and ζ_P+.\nζ_P+ is always ∼ 3 when computed for Pantheon; ζ_CMB is higher for Pantheon + (ζ_CMB∼ 12) than Pantheon (ζ_CMB∼ 5) as the H_0 value in <cit.> is more discrepant from the one derived from CMB compared to the H_0 in <cit.>.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSIONS\n\n\n\nWe investigated the Gaussianity assumption on the μ of Pantheon <cit.> and Pantheon + <cit.> of SNe Ia. We show that this assumption, usually implicitly assumed, is not fulfilled.\n\n\n\n\n\n\n\n\n\n\nThe logistic and the Student's t distributions are the ones that best-fit Pantheon and Pantheon +, respectively (see Fig. <ref>).\n\n\n\n\n\n\n\n\nThe L_logistic and L_Student, used to fit respectively the Pantheon and Pantheon + samples, with a flat ΛCDM model with\n\n\nboth Ω_M and H_0 free parameters, significantly reduce the uncertainties on these parameters.\nL_logistic reduces the uncertainties on Ω_M and H_0 by 43 % (from 0.021 to 0.012) and 41 % (from 0.34 to 0.20), respectively, while L_Student reduces the error on Ω_M and H_0 by 42 % (from 0.019 to 0.011) and 33 % (from 0.24 to 0.16), respectively. \n\nOur results steadily demonstrate that choosing the actual distribution for each SNe Ia sample is key to substantially improving the constraints on cosmological parameters.\n\n\n\n \n\n\n\n\n\n\n\n\nIn conclusion, we show\nfor the first time\nthat Δμ of Pantheon and Pantheon + does not verify the Gaussianity assumption. This unexpected result has a significant repercussion on the SNe Ia cosmology, the approach implicitly assumed in SNe Ia cosmology, and future SNe Ia collections for which the Gaussianity assumption will have to be carefully inspected.\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nThis study uses data from <https://github.com/dscolnic/Pantheon> and <https://github.com/PantheonPlusSH0ES>.\nGB acknowledges Scuola Superiore Meridionale, for supporting her visit at NAOJ, Division of Science. MGD acknowledges NAOJ. SN acknowledges JSPS KAKENHI (A: 19H00693), Interdisciplinary Theoretical and Mathematical Sciences Program (iTHEMS), and the Pioneering Program of RIKEN for Evolution of Matter in the Universe (r-EMU). We thank E. Lusso, G. Risaliti and E. Nardini for the interesting discussion. \n\n\n\n\n\nTo further test the reliability of our results we have generated mock data for the redshift, the distance moduli, μ, assuming a given cosmology, and the uncertainties on the distance moduli, σ_μ_i for both Pantheon (1048 mock data) and Pantheon + (1701 mock data) samples by extracting random values from their actual distributions for the redshift, and σ_μ_i.\nWe here show that the observed redshift distribution for the Pantheon sample is a Mixture Gaussian distribution between a Normal distribution with mean=0.2 and standard deviation σ=0.13, and a Γ distribution with the shape parameter 6.3 and a scale of 0.1, see the upper left panel of Fig. <ref>. For the Pantheon+ we still have a Gaussian Mixture distribution between a Normal with mean=0.12 and σ=0.11 and a log Normal with a mean of -0.66 and σ=0.38, see the upper right panel of Fig. <ref>.\n\n\n\n\n\n \n \n  \n\n\n   \n\n\nWe have then checked that the distribution of the mock sample for μ/σ_μ for the Pantheon sample obtained from the mock redshift distribution resembling the observed sample is still a logistic distribution and for the Pantheon+ sample is still a T-student distribution. The lower left and right panels of Fig. <ref> show the best-fit distributions of μ/σ_μ superimposed in orange to the differential distributions for the Pantheon and Pantheon+ samples, respectively. As a comparison for both panels we have also shown the corresponding Gaussian fit in green in both panels.  \nWe have computed the μ with the theoretical formula in Equ. <ref> assuming a given cosmological model in the flat ΛCDM model. Specifically, we have tested three cases: Ω_M=0.3 and H_0=70  km s^-1 Mpc^-1, Ω_M=0.8 and H_0=65  km s^-1 Mpc^-1, and Ω_M=0.1 and H_0=80  km s^-1 Mpc^-1.\nWe fit the mock data leaving both Ω_M and H_0 free to vary both with the Gaussian and the Logistic likelihood, see the upper and lower panels of Fig. <ref>, respectively, for Pantheon SNe Ia. We fit the Gaussian and the Student T likelihoods for Pantheon + SNe Ia again leaving both Ω_M and H_0 free to vary, see the upper and lower panels of Fig. <ref>, respectively. As it is shown in the figures all results with the observed distributions are confirmed by the results obtained with the mock samples.\n\n\n          \n\n\n\n\naasjournal\n\n"}