{"entry_id": "http://arxiv.org/abs/2303.06973v1", "published": "20230313101755", "title": "Catalog of noninteracting tight-binding models in one dimension with two energy bands", "authors": ["Edward McCann"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall", "cond-mat.dis-nn"], "text": "\n\n\n\n\ned.mccann@lancaster.ac.uk\nPhysics Department, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n\n\nWe classify Hermitian tight-binding models describing noninteracting electrons on a one-dimensional periodic lattice with two energy bands. To do this, we write a generalized Rice-Mele model with two orbitals per unit cell, including all possible complex-valued long-range hoppings consistent with Hermicity. We then apply different forms of time-reversal, charge-conjugation and chiral symmetry in order to constrain the parameters, resulting in an array of possible models in different symmetry classes. For each symmetry class, we define a single, canonical form of the Hamiltonian and identify models that are related to the canonical form by an off-diagonal unitary transformation in the atomic basis. The models have either symmorphic or nonsymmorphic nonspatial symmetries (time T, chiral and charge-conjugation).\nThe nonsymmorphic category separates into two types of state of matter: an insulator with a ℤ_2 topological index in the absence of nonsymmorphic time-reversal symmetry or, in the presence of nonsymmorphic time-reversal symmetry, a metallic state. The latter is an instance of Kramer's degeneracy with one degeneracy point in the Brillouin zone as opposed to no degeneracy points in symmorphic systems with T^2 = 1 and two in symmorphic systems with T^2 = - 1.\n\n\nCatalog of noninteracting tight-binding models in one dimension with two energy bands\n    Edward McCann\n    March 30, 2023\n=====================================================================================\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe study of the topological properties of materials according to the ten-fold way classification of nonspatial symmetries (time-reversal, charge-conjugation and chiral) <cit.> has expanded to include materials with nonsymmorphic crystal symmetries <cit.> which combine a nonprimitive lattice translation with either a mirror reflection or a rotation <cit.>. \nRecently, nonprimitive lattice translations have been incorporated into nonsymmorphic nonspatial symmetries <cit.>. A particular example is that of three-dimensional antiferromagnetic topological insulators with nonsymmorphic magnetic symmetry <cit.> (i.e., nonsymmorphic time-reversal symmetry).\n\nIn one dimension, the Su-Schrieffer-Heeger (SSH) model <cit.> is probably the simplest example of a topological insulator <cit.> and, as such, it has been studied extensively <cit.> and realized experimentally in different platforms <cit.>.\nThe SSH model has alternating hopping strengths and may be considered as a particular phase of the Rice-Mele model <cit.> which has alternating onsite energies as well as alternating hopping strengths. Surprisingly, it was recently shown that a phase of the Rice-Mele model which has alternating onsite energies but constant hopping strengths, the charge-density-wave (CDW) model <cit.>, is an example of a system exhibiting nonsymmorphic chiral symmetry.\n\nIt is natural to wonder how many different symmetry classes may be realized in minimal models (one-dimensional models with only two energy bands), to determine the form of such models in the atomic basis, and, particularly, to ask whether it is possible to find further examples with nonsymmorphic nonspatial symmetries including nonsymmorphic time-reversal symmetry.\nIn this paper, we answer these questions by writing down a generalized Rice-Mele model with two electronic orbitals per unit cell, including all possible complex-valued long-range hoppings consistent with Hermicity. \nWe then apply different forms of nonspatial symmetries in order to constrain the parameters, resulting in an array of possible models in different symmetry classes.\nWithin random matrix theory <cit.>, it is common to write generic matrices representing symmetry classes <cit.> and this is also possible with continuous Dirac Hamiltonians <cit.>.\nHere, we focus on tight-binding models in both position and reciprocal space.\n\nOur results are summarized in Table <ref>. The first column indicates the Cartan label of the symmetry class taken from the ten-fold way classification <cit.>.\nColumns labeled T^2, C^2, S^2 show the form of time-reversal, charge-conjugation and chiral symmetry, respectively, where a zero indicates an absence of symmetry and `NS' indicates a nonsymmorphic symmetry.\nFor systems with nonsymmorphic symmetries, we adopt the classification of Ref. <cit.> whereby the symmetry class is assigned by neglecting the nonsymmorphic symmetries (as if `NS' were replaced by a zero), and, subsequently, the nonsymmorphic symmetries are used to subdivide the symmetry classes. This is why there are three (sub)classes with nonsymmorphic symmetry labeled as class A.\n\nThe column labeled `No.' in Table <ref> indicates the number of distinct models in the symmetry class. We consider distinct models to be related by off-diagonal unitary transformations (from the atomic basis), whereas models related by diagonal gauge transformations are not considered to be distinct. For example, the three distinct models in the BDI class are well known: the SSH model <cit.>, the Creutz model <cit.> and the Shockley sp orbital model <cit.>.\nThe number of models in each class may be deduced simply by considering possible combinations of Pauli spin matrices, as described later.\nAlthough there are distinct models within a typical symmetry class, they may be related by unitary transformations and, thus, it is possible to write them all in a single `canonical' form <cit.> as indicated in the column `Canonical'. For classes with chiral symmetry, the canonical form is written in the basis in which the chiral symmetry operator is diagonal <cit.>, which we refer to as the `chiral' basis.\n\nThe final column in Table <ref> shows the state of matter of members of the symmetry class,\nand Fig. <ref> shows representative band structures for classes with time-reversal, charge-conjugation and chiral symmetry.\nFor two energy bands E_± (k), chiral symmetry imposes \nE_±(k) = - E_∓(k) and time-reversal symmetry imposes\nE_±(-k) = E_±(k), Fig. <ref>.\nThe states of matter agree with predictions of the tenfold way classification for the symmorphic models <cit.> and with the classification of Ref. <cit.> for nonsymmorphic models.\nExceptions are the symmorphic DIII and the nonsymmorphic D class which we find are both gapless due to the presence of time-reversal symmetry with Kramer's degeneracy and only two orbitals, as opposed to a four-orbital Bogoliubov de Gennes representation <cit.>. With two bands, there are also not enough degrees of freedom to realize the CII (chiral symplectic) symmetry class <cit.>.\n\nTable <ref> shows that the nonsymmorphic category separates into only two types of state of matter: an insulator with a ℤ_2 topological index <cit.> in the absence of nonsymmorphic time-reversal symmetry or, in the presence of nonsymmorphic time-reversal symmetry, a metallic state <cit.>. The latter is an instance of Kramer's degeneracy with one degeneracy point in the Brillouin zone, Fig. <ref>(d), (f), as opposed to no degeneracy points in symmorphic systems with T^2 = 1 and two in symmorphic systems with T^2 = - 1, Fig. <ref>(e).\n\nIn Section <ref> we describe the generalized Rice-Mele model <cit.> which is a periodic tight-binding model with two orbitals per unit cell. We consider a time-independent and Hermitian Hamiltonian describing noninteracting fermions and excluding superconducting pairing. In the main text, we describe nearest-neighbor coupling, but we generalize to include hoppings of all ranges in Appendix <ref>. Section <ref> describes the symmetries that are applied to the generalized Rice-Mele model in order to constrain the parameter values and identify models within each symmetry class.\nThe rest of the paper considers each symmetry class in turn, with symmorphic models with chiral symmetry in Section <ref> and without chiral symmetry in Section <ref>.\nNonsymmorphic models with chiral symmetry are discussed in Section <ref>, those without chiral symmetry in Section <ref>.\nThe paper ends with a brief conclusion, Section <ref>.\nAppendix <ref> discusses the role of spatial-inversion symmetry, which is not the focus of the classification in the main text.\n\n\n\n\n\n§ METHODOLOGY\n\n\n\n\n §.§ Generalized Rice-Mele model\n\n\n\n\n\n\nIn position space for a system of J atoms with open boundary conditions, we consider a generalized Rice-Mele model <cit.> Hamiltonian, Fig. <ref>, as a J × J Hermitian matrix in a basis of atomic orbitals,\n\n    H =[        ϵ_0 + u      v e^i ϕ_v  t_AA e^i ϕ_AA    t_3 e^i ϕ_3;      ve^-i ϕ_v         ϵ_0 -u       we^i ϕ_w   t_BBe^i ϕ_BB; t_AA e^-i ϕ_AA      we^-i ϕ_w        ϵ_0 + u      v e^i ϕ_v;    t_3e^-i ϕ_3  t_BBe^-i ϕ_BB      ve^-i ϕ_v         ϵ_0 -u;                ] ,\n\nwhere we write the matrix for just J = 4 atoms.\nAs in the usual Rice-Mele model <cit.>, there are alternating onsite energies parameterized by u and alternating nearest-neighbor hoppings v and w. In addition, we include a uniform contribution ϵ_0 to the onsite energy, next-nearest couplings t_AA and t_BB, and third-nearest coupling t_3. All parameters, other than the onsite energies ϵ_0 ± u, are complex, with phases explicitly written in Eq. (<ref>).\n\nThere are two different orbitals per unit cell, labeled A and B. With lattice constant a, we consider an A orbital to be separated by distance s from the next B orbital to the right, which is then separated by distance a-s from the next A to the right, Fig. <ref>.\nThe Bloch Hamiltonian in k space written in the type II or `canonical' representation <cit.> with A and B Bloch orbitals is\n\n\n    H (k,s)    =   · d  (k,s) , \n    \n    d_0 (k,s)    =   ϵ_0 + t_AAcos (ka + ϕ_AA) + t_BBcos (ka + ϕ_BB) , \n    \n    d_x (k,s)    =    v cos (ks + ϕ_v) + w cos [k(a-s) + ϕ_w] \n               + t_3 cos [k(a+s) + ϕ_3] , \n    \n    d_y (k,s)    =    - v sin (ks + ϕ_v) + w sin [k(a-s) + ϕ_w] \n               - t_3 sin [k(a+s) + ϕ_3] , \n    \n    d_z (k,s)    =    u + t_AAcos (ka + ϕ_AA) - t_BBcos (ka + ϕ_BB) ,\n\nwith = (I,σ_x,σ_y,σ_z) and d = (d_0,d_x,d_y,d_z), where σ_i are Pauli matrices and I is the 2 × 2 identity matrix.\nWe can write\n\n    H (k,s) = U (k,s) H (k,0) U^† (k,s) ,\n\nwhere\n\n    U (k,s) = [  e^iks/2        0;        0 e^-iks/2 ] ,\n\nand H (k,0) coincides with the Hamiltonian written in the type I or `periodic' representation <cit.>\n\nOur aim is to describe all models with nearest-neighbor coupling. We include next-nearest couplings t_AA and t_BB, and third-nearest coupling t_3 because they become nearest-neighbor in the limit of intracell spacing s=0. We consider only 0 ≤ s ≤ a/2 without loss of generality, so do not include third-nearest coupling between an A orbital and the second B orbital to its left. Note, however, that it is straightforward to include all orders of coupling as described in Appendix <ref>.\n\nThe Hamiltonian (<ref>) in position space does not explicitly depend on the distances a and s although, in a real physical system, one would expect the values of the tight-binding parameters to depend on the distances a and s. However, we are not interested in the numerical values of the parameters, but general constraints on the existence of their real and imaginary parts. Thus, we treat the generalized Rice-Mele model as a toy model with no contraints initially on the values of the tight-binding parameters other than that the Hamiltonian is Hermitian and, in particular, the tight-binding parameters are considered to be independent of a and s.\nIn general, the generalized Rice-Mele model, Eqs. (<ref>,<ref>), does not satisfy spatial inversion, chiral, time-reversal, or charge-conjugation symmetry; we apply chiral, time-reversal, or charge-conjugation symmetry in order to place some further constraints on the tight-binding parameters.\nWe nominally describe spinless electrons, although the cases with time-reversal symmetry T^2 = -1 may be interpreted as describing spinful electrons, Sections <ref> and <ref>.\n\n\n\n §.§ Symmetries\n\n\nWe consider the non-spatial symmetries of chiral symmetry (S), time-reversal symmetry (T), and charge-conjugation symmetry (C).\nIn k space, they are expressed as\n\n    chiral:    U_S^† (k,s) H (k,s) U_S (k,s)    =    - H (k,s) , \n    time:    U_T^† (k,s) H^∗ (k,s) U_T (k,s)    =    H (-k,s) , \n    charge:    U_C^† (k,s) H^∗ (k,s) U_C (k,s)    =    - H (-k,s) , \n    space:    U_P^† (k,s) H (k,s) U_P (k,s)    =    H (-k,s) ,\n\nwhere U_S, U_T, U_C, and U_P are unitary matrices with\n\n    U_S (k,s) U_S (k,s)     =    I , \n    \n    U_T (k,s) U_T^∗ (-k,s)     =   ± I , \n    \n    U_C (k,s) U_C^∗ (-k,s)     =   ± I .\n\nThese three conditions are written in shorthand as S^2 = 1, T^2 = ± 1, and C^2 = ± 1.\nThe operators are related as U_S (k,s) =U_C^∗ (k,s) U_T (-k,s) <cit.>.\n\nIn addition to the three non-spatial symmetries, we also include spatial-inversion symmetry (P) for completeness. Although it is not our focus, many of the models we discuss will satisfy spatial-inversion symmetry <cit.>, and we describe it in more detail in Appendix <ref>.\nUsing the unitary transformation (<ref>,<ref>) relating H(k,s) to H(k,0), we can write\n\n    U_S (k,s)    =    U(k,s) U_S (k,0) U^† (k,s) , \n    \n    U_T (k,s)    =    U^† (k,s) U_T (k,0) U (k,s) , \n    \n    U_C (k,s)    =    U^† (k,s) U_C (k,0) U (k,s) , \n    \n    U_P (k,s)    =    U (k,s) U_P (k,0) U (k,s) .\n\nNote that the different forms of these transformations are due to the presence or absence of complex conjugation and inversion of k in the definitions of the symmetries, Eqs. (<ref>)-(<ref>).\n\nGiven an energy eigenvalue equation H(k,s) ψ_± (k,s) = E_±(k) ψ_± (k,s) for two energy bands E_±(k) and eigenstates ψ_± (k,s), the effect of the symmetries is\n\n    chiral:      E_±(k)    =    - E_∓(k) , \n    time:      E_±(-k)    =    E_±(k) , \n    charge:      E_±(-k)    =    - E_∓(k) , \n    space:      E_±(-k)    =    E_±(k) .\n\n\nFor symmorphic models, symmetry operators U_S, U_T, U_C, U_P, when present, are independent of k for intracell distance s=0 (or, equivalently, when using the type I or `periodic' representation <cit.>). For nonsymmorphic symmetries, the symmetry operators are independent of k for intracell distance s=a/2 because this implicitly takes into account a spatial translation by half of the unit cell a;\nwhen transformed back to s=0 using Eqs. (<ref>)-(<ref>), they acquire a k dependence.\nFor the two band models we consider, the k independent symmetry operators may be represented as either Pauli matrices or the identity matrix, as appropriate <cit.>.\nApplication of chiral symmetry requires d_0 and one of the other components, d_i for i=x, y, or z, to be zero whereas time-reversal and charge-conjugation symmetries require each component of the d vector to be either even or odd functions of the wave vector k.\n\nIn position space, the symmetry operations are written as\n\n    chiral:   𝒮^† H 𝒮   =    - H ,   𝒮𝒮 = I , \n    time:   𝒯^† H^∗𝒯   =    H ,   𝒯𝒯^∗ = ± I , \n    charge:   𝒞^† H^∗𝒞   =    - H ,   𝒞𝒞^∗ = ± I , \n    space:   𝒫^† H 𝒫   =    H ,\n\nwhere 𝒮, 𝒯, 𝒞, and 𝒫 are unitary matrices, and 𝒮 =𝒯^∗𝒞.\nFor systems with symmorphic symmetries, 𝒮, 𝒯, 𝒞 act locally within a unit cell and may be represented by J × J matrices S_x, S_y or S_z, acting in the atomic basis as\n\n    S_x = [ 0 1 0 0 ⋯ 0 0; 1 0 0 0 ⋯ 0 0; 0 0 0 1 ⋯ 0 0; 0 0 1 0 ⋯ 0 0; ⋮ ⋮ ⋮ ⋮ ⋮ ⋮ ⋮; 0 0 0 0 ⋯ 0 1; 0 0 0 0 ⋯ 1 0;   ] .\n\n\n    S_y = [  0 -i  0  0  ⋯  0  0;  i  0  0  0  ⋯  0  0;  0  0  0 -i  ⋯  0  0;  0  0  i  0  ⋯  0  0;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮;  0  0  0  0  ⋯  0 -i;  0  0  0  0  ⋯  i  0;    ] ,\n\n\n    S_z = [  1  0  0  ⋯  0  0;  0 -1  0  ⋯  0  0;  0  0  1  ⋯  0  0;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮;  0  0  0  ⋯  1  0;  0  0  0  ⋯  0 -1;    ] .\n\nOperations 𝒯 and 𝒞 may also be represented by a J × J identity matrix, I.\nWhen representing chiral symmetry 𝒮, operator S_z (or σ_z in k space) is usually referred to as sublattice symmetry.\nNote that we refer to chiral symmetry as any unitary operator 𝒮 satisfying Eq. (<ref>), and, in the atomic basis, this may include S_x or S_y as well as S_z. In these cases (when symmorphic), it is possible to perform a unitary transformation from the atomic basis to the chiral basis in which 𝒮 is represented by S_z.\n\nSpatial inversion symmetry (parity) 𝒫 is non-local and may be represented by J × J matrices P_x, P_y, P_z, or P_I, where\n\n    P_x = [ 0 0 0 ⋯ 0 1; 0 0 0 ⋯ 1 0; ⋮ ⋮ ⋮ ⋮ ⋮ ⋮; 0 0 1 ⋯ 0 0; 0 1 0 ⋯ 0 0; 1 0 0 ⋯ 0 0 ] ,\n\n\n    P_y = [  0  0  0  ⋯  0  1;  0  0  0  ⋯ -1  0;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮;  0  0 -1  ⋯  0  0;  0  1  0  ⋯  0  0; -1  0  0  ⋯  0  0 ] ,\n\n\n    P_z = [  0  0  0  0  ⋯  1  0;  0  0  0  0  ⋯  0 -1;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮;  0  0  1  0  ⋯  0  0;  0  0  0 -1  ⋯  0  0;  1  0  0  0  ⋯  0  0;  0 -1  0  0  ⋯  0  0 ] ,\n\n\n    P_I = [ 0 0 0 0 ⋯ 1 0; 0 0 0 0 ⋯ 0 1; ⋮ ⋮ ⋮ ⋮ ⋮ ⋮ ⋮; 0 0 1 0 ⋯ 0 0; 0 0 0 1 ⋯ 0 0; 1 0 0 0 ⋯ 0 0; 0 1 0 0 ⋯ 0 0 ] .\n\n\nNonsymmorphic symmetry involves a translation T_a/2 <cit.> by the atomic spacing a/2,\n\n    T_a/2 = [ 0 1 0 0 ⋯ 0 0; 0 0 1 0 ⋯ 0 0; 0 0 0 1 ⋯ 0 0; 0 0 0 0 ⋯ 0 0; ⋮ ⋮ ⋮ ⋮ ⋮ ⋮ ⋮; 0 0 0 0 ⋯ 0 1; 1 0 0 0 ⋯ 0 0;   ] .\n\nIt could also be expressed as a matrix product T_a/2 S_z of sublattice symmetry S_z (<ref>) with T_a/2,\n\n    T_a/2 S_z = [  0 -1  0  0  ⋯  0  0;  0  0  1  0  ⋯  0  0;  0  0  0 -1  ⋯  0  0;  0  0  0  0  ⋯  0  0;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮  ⋮;  0  0  0  0  ⋯  0  1;  1  0  0  0  ⋯  0  0;    ] ,\n\nwhere T_a/2 S_z is written for an odd number of atoms, J.\nThese two possibilities correspond to σ_x or σ_y, respectively, in k space.\n\n\n\n\n\nFor symmorphic models in position space, symmetries generally only hold for an even number of atoms, J, unless the matrix representing the symmetry is diagonal. An example is the SSH model <cit.> for which time-reversal (I), charge-conjugation (S_z), and chiral (S_z) symmetry are all diagonal, so they hold for an odd number of atoms; spatial inversion symmetry (P_x) does not hold in the SSH model for an odd number of atoms, however.\nFor nonsymmorphic models in position space, nonspatial symmetries are represented either by nonsymmorphic operations, T_a/2 or T_a/2 S_z, or by diagonal ones, I or S_z (e.g. it is possible to combine symmorphic time with nonsymmorphic charge-conjugation and chiral symmetries). Thus, they nominally apply to systems with either even or odd numbers of atoms, except that, in both instances, the ends of a system with open boundary conditions break the nonsymmorphic symmetry <cit.>.\nSpatial inversion symmetry for nonsymmorphic models in position space is represented by P_x or P_y, and its presence, for a given symmetry class, depends on whether the number of atoms is even or odd as indicated in Table <ref>.\n\nSymmorphic models are labeled H_S,n^(i,j,ℓ) where n indicates the Cartan label of the symmetry class, Table <ref>. Index i = I,x,y,z indicates the form of time-reversal symmetry as either the identity matrix (I) in both k and position space, or a Pauli spin matrix σ_i in k space and matrix S_i in position space; likewise index j = I,x,y,z for charge-conjugation symmetry\nand ℓ = x,y,z for chiral symmetry (for which the unit matrix is not possible).\nNonsymmorphic models are labeled H_NS,n^(i,j,ℓ) where n indicates the Cartan label and index i = I,x,y,z indicates the form of time-reversal symmetry as either the identity matrix (I) in both k and position space, Pauli spin matrix σ_x in k space and matrix T_a/2 in position space, Pauli spin matrix σ_y in k space and matrix T_a/2S_z in position space, or Pauli spin matrix σ_z in k space and matrix S_z in position space; likewise index j = I,x,y,z for charge-conjugation symmetry, and index ℓ = x,y,z for chiral symmetry (for which the unit matrix is not possible).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ SYMMORPHIC MODELS WITH CHIRAL SYMMETRY\n\n\n\n\n §.§ Symmetry class AIII with T^2 = 0, C^2 = 0, S^2 = 1\n\n\nAll versions of chiral symmetry require d_0 = 0. From Eq. (<ref>), this may be satisfied with ϵ_0 = 0, t_BB = - t_AA and ϕ_BB = ϕ_AA. Hence, with d_0 = 0, we consider\n\n    H (k,s)    =   · d  (k,s) , \n     \n    d_x (k,s)    =    v cos (ks + ϕ_v) + w cos [k(a-s) + ϕ_w] \n               + t_3 cos [k(a+s) + ϕ_3] , \n    \n    d_y (k,s)    =    - v sin (ks + ϕ_v) + w sin [k(a-s) + ϕ_w] \n               - t_3 sin [k(a+s) + ϕ_3] , \n    \n    d_z (k,s)    =    u + 2t_AAcos (ka + ϕ_AA)  ,\n\nwith d = (0,d_x,d_y,d_z).\n\nWe begin by considering models with symmorphic chiral symmetry only (i.e., generally no time-reversal or charge-conjugation symmetry) which belong to the AIII (chiral unitary) symmetry class.\nTo identify such models, we determine the cases for which H(k,0) satisfies chiral symmetry (<ref>) with U_S (k,0) being independent of k. We find there are three such models, corresponding to U_S (k,0) = σ_z, σ_y, or σ_x, and denoted H_S,AIII^(0,0,z), H_S,AIII^(0,0,y), H_S,AIII^(0,0,x), respectively, Fig. <ref>.\nThe values of the tight-binding parameters for each model are summarized in Table <ref>.\nNote that we could consider a more general form of chiral symmetry with U_S (k,s=0) consisting of a linear combination of Pauli matrices, but this would lead to a more constrained version of the Hamiltonians that we already consider, so we exclude this possibility\n\nThe three models, H_S,AIII^(0,0,i), i = x,y,z, are distinct in the atomic basis, but they are all equivalent after a similarity transformation into the chiral basis, i.e., the basis in which the chiral operator is Ũ_S (k,0) = σ_z in k space. For each model we identify the unitary operator R for which the similarity transformation may be expressed as\n\n    H̃_S,AIII^(0,0,i) (k,0) = R^† H_S,AIII^(0,0,i)(k,0) R ≡·d̃ ,\n\nso that the Hamiltonian H̃_S,AIII^(0,0,i) (k,0) is written in the canonical form where d̃_x and d̃_y are represented by the Fourier series of arbitrary, real 2π periodic functions (with d̃_z = 0), as shown in Table <ref>.\nThis canonical form has chiral symmetry Ũ_S (k,0) = σ_z in k space (S_z in position space).\nTable <ref> shows how the tight-binding parameters of the three models correspond to x_n, x̃_n, y_n, ỹ_n of the canonical form, Table <ref>.\nEnergies eigenvalues are E_±(k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally an insulator.\nSince spatial-inversion symmetry is broken, the spectrum generally isn't an even function of k.\nAs d̃_x and d̃_y are arbitrary, real 2π periodic functions,\nthe path of the d̃ vector in the d̃_x-d̃_y plane defines an integer ℤ winding number, in agreement with expectations from the tenfold way classification <cit.>. We describe the winding number in more detail in Section <ref>.\n\nIn the following, we briefly describe each model, H_S,AIII^(0,0,i), i = x,y,z, in more detail.\nChiral symmetry U_S (k,0) = σ_z demands that d_z (k,0) = 0. For arbitrary k, this requires u=0 and t_AA = 0, yielding H_S,AIII^(0,0,z) (k,s) = · d^(z) (k,s) where\n\n    d_x^(z) (k,s)    =    v cos (ks + ϕ_v) + w cos [k(a-s) + ϕ_w] \n               + t_3 cos [k(a+s) + ϕ_3] , \n    \n    d_y^(z) (k,s)    =    - v sin (ks + ϕ_v) + w sin [k(a-s) + ϕ_w] \n                - t_3 sin [k(a+s) + ϕ_3] , \n    \n    d_z^(z) (k,s)    =    0 .\n\nThis can be viewed as a generalized version of the SSH model <cit.>: arbitrary, complex A-B hoppings are allowed as long as all A-A or B-B hoppings are absent, as shown schematically in Fig. <ref>(a) for intracell spacing s=0.\nIt is an unusual case because U_S (k,s) = σ_z is independent of k for all intracell spacing s, including s ≠ 0.\nIn position space, chiral symmetry is given by S_z, Eq. (<ref>).\nNote that we include hopping t_3 because, for s=0, it is a nearest-neighbor hopping, Fig. <ref>(a) (and the generalization to longer-range hopping is straightforward, Appendix <ref>). In the absence of t_3 or longer range hoppings, i.e., with only v̅ = ve^iϕ_v and w̅ = we^iϕ_w, then it is possible to gauge away the phases ϕ_v and ϕ_w <cit.>, giving the conventional SSH model in symmetry class BDI, Fig. <ref>(b).\n\nChiral symmetry U_S (k,0) = σ_y demands that d_y = 0.\nThis can be achieved with ϕ_v = 0, t_3 = w and ϕ_3 = ϕ_w,\nyielding H_S,AIII^(0,0,y) (k,0) = · d^(y) (k,0) where\n\n    d_x^(y) (k,0)    =    v + 2 w cos (ka + ϕ_w) , \n    \n    d_y^(y) (k,0)    =    0 , \n    \n    d_z^(y) (k,0)    =    u + 2t_AAcos (ka + ϕ_AA) .\n\nThis can be viewed as a generalized version of the Creutz ladder <cit.>, Fig. <ref>(c). Note that it is possible to find H_S,AIII^(0,0,y) (k,s) for arbitrary s using the unitary transformation (<ref>).\nThis can be transformed to the canonical form, Table <ref>, with parameters given in Table <ref> using R=R_y R_r, where\n\n    R_y = 1/√(2)[  1  1;  i -i ] ,\n\nand R_r = diag (1,i). Here, R_y transforms to the chiral basis and R_r rotates the d_x-d_y plane around the d_z axis.\nIn the atomic basis in position space, a transformation to the chiral basis is\nH̃_S,AIII^(0,0,y) = ℛ_r^†ℛ_y^† H_S,AIII^(0,0,y)ℛ_y ℛ_r\nwhere\n\n    ℛ_y =1/√(2)[  1  1  0  0  0  ⋯;  i -i  0  0  0  ⋯;  0  0  1  1  0  ⋯;  0  0  i -i  0  ⋯;  0  0  0  0  1  ⋯;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋱ ] ,\n\nand ℛ_r = diag (1,i,1,i,1,i,…).\nWith this transformation, H̃_S,AIII^(0,0,y) is of the same general (canonical) form as H_S,AIII^(0,0,z).\n\nChiral symmetry U_S (k,0) = σ_x demands that d_x = 0 which can be achieved with ϕ_v = π/2, t_3 = - w and ϕ_3 = ϕ_w,\nyielding H_S,AIII^(0,0,x) (k,0) = · d^(x) (k,0) where\n\n    d_x^(x) (k,0)    =    0 , \n    \n    d_y^(x) (k,0)    =    - v + 2 w sin (ka + ϕ_w) , \n    \n    d_z^(x) (k,0)    =    u + 2t_AAcos (ka + ϕ_AA) .\n\nThis can be viewed as a generalized version of the Shockley sp orbital model <cit.>, Fig. <ref>(e).\nIt can be transformed to the canonical form, Table <ref>, with parameters given in Table <ref> using R=R_x, where\n\n    R_x = 1/√(2)[  1  1;  1 -1 ] .\n\nIn the atomic basis in position space, a transformation to the chiral basis is\nH̃_S,AIII^(0,0,x) = ℛ_x^† H_S,AIII^(0,0,x)ℛ_x\nwhere\n\n    ℛ_x =1/√(2)[  1  1  0  0  0  ⋯;  1 -1  0  0  0  ⋯;  0  0  1  1  0  ⋯;  0  0  1 -1  0  ⋯;  0  0  0  0  1  ⋯;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋱ ] .\n\nWith this transformation, H̃_S,AIII^(0,0,x) is of the same general (canonical) form as H_S,AIII^(0,0,z).\n\n\n\n\n §.§ Symmetry class BDI with T^2=1, C^2=1, S^2=1\n\n\nWe apply time-reversal symmetry (<ref>) to the three models with chiral symmetry described in Section <ref>.\nWe consider U_T (k,0) to be independent of k, and this means that \nU_T (k,0) = I, σ_x or σ_z (for which T^2 = +1), or U_T (k,0) = σ_y (for which T^2 = -1).\nThen, with definite chiral symmetry and time-reversal symmetry, we determine the form of charge-conjugation symmetry U_C using U_S (k,0) =U_C^∗ (k,0) U_T (-k,0), where C^2 = ± 1.\nWe then group models in the same symmetry class together, beginning with the BDI (chiral orthogonal) class, T^2 = 1, C^2 = 1,  S^2 = 1.\n\nIn this class, the canonical form of the Bloch Hamiltonian H̃_S,BDI (k,0) = ·d̃\nis given in Table <ref> where d̃_x is represented as an even-in-k 2π periodic function, \nd̃_y is an odd 2π periodic function,\nand d̃_z = 0,\nwhere parameters x_n and ỹ_n are real.\nNote that a form with d̃_x odd and d̃_y even is equivalent <cit.>, because it is related by a rotation of the d̃_x-d̃_y axes about d̃_z.\nRef. <cit.> expressed the SSH model in an equivalent form with d̃_x + i d̃_y written as a complex Fourier series.\nThe canonical form has time-reversal symmetry U_T (k,0) = I, charge-conjugation symmetry U_C (k,0) = σ_z, and chiral symmetry U_S (k,0) = σ_z.\n\n\n\n\n\n\nEnergy eigenvalues are E_± (k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally an insulator, Fig. <ref>(a).\nThe path of the d̃ vector in the d̃_x-d̃_y plane defines an integer ℤ winding number W, in agreement with expectations from the tenfold way classification <cit.>.\nAs a hypothetical example, Fig. <ref>(a) shows the band structure when the system is dominated by second order terms x_2, ỹ_2 in the canonical form, Table <ref>, and Fig. <ref>(b) shows the corresponding path of the d̃ vector with a winding number of W = 2.\n\nIn position space, one can set S = S_x, S_y, or S_z with T = I, S_x, or S_z and C = I, S_x, or S_z, and search for combinations of them; there are only six possibilities because T≠ S_y, C≠ S_y, Table <ref>.\nOf these, three are related by diagonal gauge transformations as seen by multiplying two of S, T, or C by S_z (which is diagonal).\nThe three remaining distinct models have all been discussed widely in previous literature: H_S,BDI^(I,z,z) is the SSH model <cit.>, H_S,BDI^(x,z,y) is the Creutz ladder <cit.>, and H_S,BDI^(I,x,x) is the Shockley sp orbital model <cit.>, as shown schematically in Fig. <ref>. They are distinct in the sense that the unitary transformation from the atomic basis to the canonical form, Table <ref>, is off-diagonal (<ref>,<ref>).\n\nThe three models related by diagonal gauge transformations correspond to an additional version of each of the distinct three such that their A-B hopping parameters are imaginary rather than real, Table <ref>.\nFormally, the diagonal transformation in the atomic basis in position space has a period of 2a,\n\n    ℛ_i =[  1  0  0  0  0  ⋯;  0 -i  0  0  0  ⋯;  0  0 -1  0  0  ⋯;  0  0  0  i  0  ⋯;  0  0  0  0  1  ⋯;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋱ ] ,\n\nso that H_S,BDI^(z,I,z) = ℛ_i^† H_S,BDI^(I,z,z)ℛ_i, with a flip of sign of t_3, etc.\n\nTable <ref> shows how the tight-binding parameters of the models correspond to x_n, ỹ_n of the canonical form, Table <ref>. Since each model consists of nearest-neighbor only, x_n = ỹ_n = 0 for n ≥ 2, the winding number W can only take two values (0 or 1) <cit.>.\nIn terms of the canonical form, Table <ref>, it is given by\n\n    W = \n    0     |x_0| > 2 |x_1| , \n    \n    1     |x_0| < 2 |x_1| ,\n\nand the system is gapless if |x_0| = 2 |x_1|.\nExpressions for x_0, x_1 in terms of tight-binding parameters for different models may be read off Table <ref>. For example, for the SSH model, H_S,BDI^(I,z,z), then W = 1 if |v| < |w+t_3|.\nIt is straightforward to generalize the models to longer range hoppings, as described in Appendix <ref>, and terms beyond nearest-neighbor hopping in the SSH model have been described previously <cit.>.\nNote that the spinless Kitaev chain <cit.> also belongs to the BDI symmetry class, but we do not discuss it here because superconducting pairing is not included in the generalized Rice-Mele model (<ref>,<ref>).\n\nIn the atomic basis in position space, edge states will be located on different atomic sites in the three models. Given an eigenstate ψ_SSH of the SSH model, H_S,BDI^(I,z,z), a corresponding state in the Creutz ladder, H_S,BDI^(x,z,y), is ℛ_y ℛ_r ψ_SSH and in the Shockley sp orbital model, H_S,BDI^(I,x,x), it is ℛ_x ψ_SSH.\nThe SSH model is usually considered for t_3 =0, which, according to Table <ref>, is equivalent to t_AA = w in the Creutz ladder and t_AA = -w in the Shockley sp orbital model. Then, in the fully dimerized limit of v=0, one can see from Fig. <ref>(b) that there will be an edge state fully localized on the left most A atom in the SSH model <cit.>. Owing to the off-diagonal transformations to the bases of the other models, such a state will be shared equally between the left-most A and left-most B atom in the same limit of the Creutz ladder (v=0) and the Shockley sp orbital model (u=0), Fig. <ref>(d) and (f).\n\nAs an illustration, Fig. <ref>(c) shows the energy levels in position space of the SSH model, H_S,BDI^(I,z,z), as a function of parameter t_3^' with t_3 = t_5 = 0. With these choices, parameters of the canonical form are x_0 = 2v, x_1 = ỹ_1 = w and x_2 = ỹ_2 = t_3^'. With w=1 and v=0.2, then there is a phase transition from winding number W=2 for t_3^' >1 to W=1 for t_3^' < 1. As shown in Fig. <ref>(c) and (d), these phases support four zero-energy edge states for t_3^' >1 and two zero-energy edge states for t_3^' < 1.\n\n\n\n\n\n\n\n\n\n §.§ Symmetry class DIII with T^2=-1, C^2=1, S^2=1\n\n\nModels with chiral symmetry S^2=1, time T^2=-1, and charge conjugation C^2=1 are in the DIII symmetry class which is usually associated with a Bogoliubov de Gennes Hamiltonian.\nThis symmetry class must have time T = S_y. There are three possibilities for chiral symmetry, S= S_x, S_y, or S_z, giving three models, Table <ref>. However, multiplying S and C by S_z shows that one of them is trivially related to another by a diagonal gauge transformation.\nThus, there are two distinct models (H_S,DIII^(y,x,z) and H_S,DIII^(y,z,x)) as shown schematically in Fig. <ref>. They are distinct in the sense that the unitary transformation relating them is off-diagonal.\nModel H_S,DIII^(y,z,x) has an additional version H_S,DIII^(y,I,y) that is the one related by a trivial, diagonal transformation such that its A-B hopping parameters are imaginary rather than real, Table <ref>.\n\nIn this class, the canonical form of the Bloch Hamiltonian H̃_sym (k,0) = ·d̃\nis where both d̃_x and d̃_y are represented by odd-in-k 2π periodic functions, Table <ref>,\nparameters x̃_n and ỹ_n are real, and d̃_z (k,0) = 0.\nTable <ref> shows how the tight-binding parameters of the three models correspond to x̃_n, ỹ_n of the canonical form, Table <ref>. Since each model consists of nearest-neighbor only, x̃_n = ỹ_n = 0 for n ≥ 2, although it is straightforward to generalize to longer range hoppings, as described in Appendix <ref>.\n\nEnergy eigenvalues are E_± (k) = ±√(d̃_x^2 + d̃_y^2). Owing to Kramer's degeneracy (with T^2=-1), states at k=0 and k= ±π/a are degenerate because these k values are time-reversal invariant. As there are only two bands and the bands are degenerate, the system is gapless, Fig. <ref>(e).\n\nAs a representative of this symmetry class, let us briefly discuss H_S,DIII^(y,x,z), Fig. <ref>(a).\nWith only nearest-neighbor coupling, ± we^± iϕ_w, the model is simply two disconnected linear chains; higher-order hopping is required to couple the chains, Table <ref>.\nAs time T^2 = -1, the A atoms can be considered as spin-up electrons and the B atoms as spin-down electrons, with the coupling (± we^± iϕ_w) describing spin-orbit coupling <cit.> between them,\n\n    H_S,DIII^(y,x,z) (k,0) = [                  0 -2iwe^iϕ_wsin (ka); 2iwe^-iϕ_wsin (ka)                  0 ] .\n\nOwing to the presence of chiral symmetry, there is no coupling between spins of the same orientation (A-A or B-B) here, however it has been taken into account previously <cit.> as d_0 (k,0) = 2t cos (ka) for nearest-neighbor A-A and B-B hopping with parameter t = t_AA = t_BB.\n\n\n\n\n\n\n\n\n §.§ Symmetry class CI with T^2=1, C^2=-1, S^2=1\n\n\nModels with chiral symmetry S^2=1, time T^2=1, and charge conjugation C^2=-1 are in the CI symmetry class which is usually associated with a Bogoliubov de Gennes Hamiltonian.\nIn this class, the canonical form of the Bloch Hamiltonian H̃_sym (k,0) = ·d̃\nis where both d̃_x and d̃_y are represented by even-in-k 2π periodic functions, Table <ref>,\nparameters x_n and y_n are real, and d̃_z (k,0) = 0.\n\nEnergy eigenvalues are E_± (k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally an insulator, Fig. <ref>(c).\nIn agreement with expectations from the tenfold way classification <cit.>, it is topologically trivial.\nAs a hypothetical example, Fig. <ref>(a) shows the band structure for typical parameter values using the canonical form, Table <ref>, and Fig. <ref>(b) shows the corresponding path of the d̃ vector in the d̃_x-d̃_y plane. It traces an open path for -π < ka ≤ 0 and then reverses along the same path for 0 < ka ≤π to end at the original starting point.\nNote the dips in the band structure at ka ≈±π/2 arising from higher-order terms in the canonical form, Table <ref>, which would result in van Hove singularities in the density of states.\n\nThis symmetry class must have charge conjugation C = S_y. There are three possibilities for chiral symmetry, S= S_x, S_y, or S_z, giving three models, Table <ref>. However, multiplying S and T by S_z shows that one of them is trivially related by a diagonal gauge transformation.\nThus, there are two distinct models (H_S,CI^(x,y,z) and H_S,CI^(I,y,y)) as shown schematically in Fig. <ref>. They are distinct in the sense that the unitary transformation relating them is off-diagonal.\nModel H_S,CI^(I,y,y) has an additional version H_S,CI^(z,y,x) that is the one related by a trivial, diagonal transformation such that its A-B hopping parameters are imaginary rather than real, Table <ref>. Table <ref> shows how the tight-binding parameters of the three models correspond to x_n, y_n of the canonical form, Table <ref>. Since each model consists of nearest-neighbor only, x_n = y_n = 0 for n ≥ 2, although it is straightforward to generalize to longer range hoppings, as described in Appendix <ref>.\n\nAlthough we only consider systems with two energy bands, these models fall into a Bogoliubov de Gennes symmetry class (CI) which nominally has four components. In Ref. <cit.>, the generic 4 × 4 Hamiltonian representing class CI is actually block diagonal with a single 2 × 2 block representing spin-up electrons and spin-down holes (say). Comparison with the form of H_S,CI^(I,y,y) shows that we may interpret the chain of A atoms (with onsite energies -u and A-A hopping t_AA) as mimicking the spin-up electrons and the chain of B atoms (with onsite energies u and B-B hopping -t_AA) as mimicking the spin-down holes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ SYMMORPHIC MODELS WITHOUT CHIRAL SYMMETRY\n\n\n\n\n\n §.§ Symmetry class A with T^2 = 0, C^2 = 0, S^2 = 0\n\n\nWe now consider symmorphic models without chiral symmetry. Symmetry class A is described by the generalized Rice-Mele model Eqs. (<ref>,<ref>), and the corresponding expression with tight-binding parameters of all ranges is given in Eqs.(<ref>)-(<ref>). For intracell spacing s=0, Eq. (<ref>) shows that, without any symmetry constraints, each component of the d vector at s=0 may be written as an arbitrary real Fourier series of a 2π-periodic function.\nEnergies eigenvalues are E_±(k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2), and the system is generally an insulator.\nSince time-reversal and spatial-inversion symmetries are absent, the spectrum generally isn't an even function of k.\n\nWe write the canonical form for this class as H_sym,A (k,s) = ·d̃ (k,s) where\n\n    d̃_0 (k,0)    =   a_0/2 + ∑_n=1^∞[ a_n cos (kna) + ã_nsin (kna) ]  , \n    d̃_x (k,0)    =   x_0/2 + ∑_n=1^∞[ x_ncos (kna) + x̃_nsin (kna) ]  , \n    d̃_y (k,0)    =   y_0/2 + ∑_n=1^∞[ y_ncos (kna) + ỹ_nsin (kna) ]  , \n    d̃_z (k,0)    =   z_0/2 + ∑_n=1^∞[  z_ncos (kna) + z̃_nsin (kna)  ]  ,\n\nwhere all the parameters are real. This canonical form expresses the fact that, without any symmetry constraints, each component of the d vector may be written as an arbitrary real Fourier series of a 2π-periodic function of ka.\nWith nearest-neighbor parameters only, the parameters from the canonical form (<ref>)-(<ref>) may be read from Eqs. (<ref>,<ref>), e.g. a_0 = 2 ϵ_0, z_0 = 2u, wherein parameters of second order or above are zero due to the nearest-neighbor approximation.\n\n\n\n\n\n §.§ Symmetry class AI with T^2 = 1, C^2 = 0, S^2 = 0\n\n\nModels with time-reversal symmetry T^2 = 1, but no charge-conjugation or chiral symmetry are in the AI (orthogonal) class.\nThere are three possibilities, T= I, S_x, or S_z, giving three models, Table <ref>.\nHowever, multiplying T by S_z shows that one of them is trivially related to another by a diagonal gauge transformation.\nThus, there are two distinct models (H_S,AI^(I,0,0) and H_S,AI^(x,0,0)) as shown schematically in Fig. <ref>. They are distinct in the sense that the unitary transformation relating them is off-diagonal.\nModel H_S,AI^(I,0,0) has an additional version H_S,AI^(z,0,0) such that its A-B hopping parameters are imaginary rather than real, Table <ref>.\n\nThe canonical form for this class, Table <ref>, may be written as for class A with d̃_0 (k,0), d̃_x (k,0), and d̃_z (k,0) as even functions of k, and d̃_y (k,0) odd, i.e., set ã_n = x̃_n = y_n = z̃_n = 0 in Eqs. (<ref>)-(<ref>).\nThen, time reversal symmetry is given by T= I.\nRelations of the tight-binding parameters for each model to the canonical form are given in Table <ref>, where H_S,AI^(x,0,0) is rotated by R_y^-1 and H_S,AI^(z,0,0) is rotated by R_y.\nEnergies eigenvalues are E_±(k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2), and the system is generally an insulator.\nWith time-reversal symmetry, the spectrum is an even function of k.\n\n\n\n §.§ Symmetry class AII with T^2 = -1, C^2 = 0, S^2 = 0\n\n\nModels with time-reversal symmetry T^2 = -1, but no charge-conjugation or chiral symmetry are in the AII (symplectic) class.\nThere are is only one possibility, T= S_y, giving H_S,AII^(y,0,0), Table <ref> and Fig. <ref>(e).\nThe canonical form for this class, Table <ref>, may be written as for class A with d̃_0 (k,0) as an even function of k, and d̃_x (k,0), d̃_y (k,0), d̃_z (k,0) as odd functions, i.e., set ã_n = x_n = y_n = z_n = 0 in Eqs. (<ref>)-(<ref>).\nRelations of the tight-binding parameters for H_S,AII^(y,0,0) to the canonical form are given in Table <ref>.\nEnergies eigenvalues are E_±(k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2). Owing to Kramer's degeneracy (with T^2=-1), states at k=0 and k= ±π/a are degenerate because these k values are time-reversal invariant. As there are only two bands and the bands are degenerate, the system is gapless.\n\n\n\n\n\n\n\n\n\n\n §.§ Symmetry class D with T^2 = 0, C^2 = 1, S^2 = 0\n\n\nModels with charge-conjugation symmetry C^2 = 1, but no time-reversal or chiral symmetry are in the D class.\nThere are three possibilities, C= I, S_x, or S_z, giving three models, Table <ref>.\nHowever, multiplying C by S_z shows that one of them is trivially related to another by a diagonal gauge transformation.\nThus, there are two distinct models (H_S,D^(0,x,0) and H_S,D^(0,z,0)) as shown schematically in Fig. <ref>. They are distinct in the sense that the unitary transformation relating them is off-diagonal.\nModel H_S,D^(0,z,0) has an additional version H_S,D^(0,I,0) such that its A-B hopping parameters are imaginary rather than real, Table <ref>.\n\nThe canonical form for this class, Table <ref>, may be written as for class A with d̃_z (k,0) as an even function of k, and d̃_0 (k,0),  d̃_x (k,0), and d̃_y (k,0) as odd functions, i.e., set a_n = x_n = y_n = z̃_n = 0 in Eqs. (<ref>)-(<ref>).\nThen, charge-conjugation symmetry is given by C= S_x.\nRelations of the tight-binding parameters for each model to the canonical form are given in Table <ref>, where H_S,D^(0,z,0) is rotated by R_x and H_S,D^(0,I,0) is rotated by R_y.\nEnergy eigenvalues are E_±(k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2) and the system is generally an insulator.\nWith charge-conjugation symmetry, E_±(-k) = - E_∓(k).\n\nDespite the absence of chiral symmetry, the constraint of charge-conjugation symmetry protects a ℤ_2 topological index <cit.> in class D in accord with predictions of the tenfold way classification <cit.>.\nIt may be interpreted in terms of the three-dimensional path of (d̃_x, d̃_y, d̃_z ) for -π < ka ≤π <cit.>. With the canonical form, Table <ref>, components d̃_x and d̃_y are odd functions of a 2π-periodic function. Thus, the closed path begins and ends on either the north or south pole of the Bloch sphere, d̃_z (-π) = d̃_z (π) = z_0/2 + ∑_n=1^∞ (-1)^n z_n, and it is also at either the north or south pole at k=0, d̃_z (0) = z_0/2 + ∑_n=1^∞ z_n.\nThe ℤ_2 topological index, ν_2, may be defined <cit.> as \n\n    ν_2 = \n    0    sgn [ d̃_z (π) ] = sgn [  d̃_z (0) ] , \n    \n    1    sgn [ d̃_z (π) ] = - sgn [ d̃_z (0) ] .\n\nThis can be written in terms of the canonical form including all orders of hopping using the expression for d̃_z,\n\n    ν_2 = \n    0     |z_0/2 + ∑_m=1^∞ z_2m| > |∑_m=0^∞ z_2m+1| , \n    \n    1     |z_0/2 + ∑_m=1^∞ z_2m| < |∑_m=0^∞ z_2m+1| ,\n\nFor nearest-neighbor terms only (first order), the expression for ν_2 simplifies as\n\n    ν_2 = \n    0     |z_0| > 2 |z_1| , \n    \n    1     |z_0| < 2 |z_1| ,\n\nand the system is gapless if |z_0| = 2 |z_1|.\nExpressions for z_0 and z_1 in terms of tight-binding parameters for different models may be read off Table <ref>. For example, for H_S,D^(0,x,0), then ν_2 = 1 if |u| <  |2t_AAcosϕ_AA|.\n\nAs an illustration, Fig. <ref>(a) shows the energy levels in position space of model H_S,D^(0,x,0), as a function of phase ϕ_AA with u = √(2), t_AA = 1, w=1, and ϕ_w = π/4. With these choices, the index ν_2 = 1 if |cosϕ_AA | > 1 / √(2), i.e., for 0 < ϕ_AA < π/4, 3π/4 < ϕ_AA < 5π/4 and 7π/4 < ϕ_AA < 2π. As shown in Fig. <ref>, this phase supports two zero energy edge states as opposed to none for ν_2 = 0.\nThe edge states have weight on both the A and B sites, unlike the SSH model, Fig. <ref>(d).\nNote that this model doesn't have chiral symmetry, so d_0 ≠ 0, and the whole spectrum tends to oscillate with ϕ_AA, Fig. <ref>(a).\n\n\n\n\n\n §.§ Symmetry class C with T^2 = 0, C^2 = -1, S^2 = 0\n\n\nModels with charge-conjugation symmetry C^2 = -1, but no time-reversal or chiral symmetry are in the C class.\nThere is only one possibility, C= S_y, giving H_S,C^(0,y,0), Table <ref> and Fig.<ref>(f).\nThe canonical form for this class, Table <ref>, may be written as for class A with d̃_0 (k,0) as an odd function of k, and d̃_x (k,0), d̃_y (k,0), d̃_z (k,0) as even functions, i.e., set a_n = x̃_n = ỹ_n = z̃_n = 0 in Eqs. (<ref>)-(<ref>).\nRelations of the tight-binding parameters for H_S,C^(0,y,0) to the canonical form are given in Table <ref>.\nEnergy eigenvalues are E_±(k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2).\nThe system is generally an insulator and, with charge-conjugation symmetry, E_±(-k) = - E_∓(k).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ NONSYMMORPHIC MODELS WITH CHIRAL SYMMETRY\n\n\n\n\n §.§ Nonsymmorphic symmetry class A with T^2 = 0, C^2 = 0, S^2 = NS\n\n\nThe two possibilities for a nonsymmorphic nonspatial symmetry, T_a/2  and  T_a/2 S_z, suggest that there are two possible models with nonsymmorphic chiral symmetry (only), Table <ref>. However, they are related by a trivial, diagonal gauge transformation because S_z is diagonal; thus, there is only one distinct model in subclass A with S^2 = NS.\n\nThe models written in the atomic basis may be identified explicitly using the generalized Rice-Mele Hamiltonian (<ref>) with d_0 = 0.\nFor the Bloch Hamiltonian H(k,s), nonsymmorphic chiral symmetry corresponds to cases for which H(k,a/2) satisfies chiral symmetry (<ref>) with U_S (k,a/2) being independent of k. In principle, there are three such models, corresponding to U_S (k,a/2) = σ_z, σ_y, or σ_x. \nHowever, chiral symmetry U_S (k,s) = σ_z is independent of the intracell spacing s because it and U (k,s), Eq.(<ref>), are diagonal. Thus, U_S (k,s) = σ_z is included as symmorphic chiral symmetry yielding H_S,AIII^(0,0,z) (k,s), the generalized SSH model.\nThus, there are two general nonsymmorphic models:\nH_NS,A^(0,0,y) with U_S (k,a/2) = σ_y in k space and T_a/2 S_z in position space, H_NS,A^(0,0,x) with U_S (k,a/2) = σ_x and T_a/2.\nThe values of the tight-binding parameters for each model are summarized in Table <ref>.\n\nConsidering one of these models in position space with an even number of atoms and periodic boundary conditions (thus, satisfying chiral symmetry), then, when we change to the chiral basis, the resulting Hamiltonian is block diagonal, with 2 × 2 blocks, but it is no longer a periodic lattice (with a period of a); this is why analysis of the generalized Rice-Mele model with U_S (k,a/2) = σ_z is unable to realise a nonsymmorphic model.\n\nAlthough the symmetry operators for intracell spacing s=a/2 are independent of k, they acquire k dependences when written for zero intracell spacing s=0 (or, equivalently, when written in the type I or `periodic' representation <cit.>) according to Eqs. (<ref>)-(<ref>).\nFor example, for H_NS,A^(0,0,y), U_S (k,a/2) = σ_y translates as\n\n    U_S (k,0) = [           0 -i e^-ika/2;   i e^ika/2             ] .\n\n\nThe canonical form H_NS,A (k,a/2) = ·d̃ of the Hamiltonian is given in Table <ref> with d̃_z (k,a/2) = 0. Component d̃_x is an arbitrary, real 2π periodic function of ka whereas d̃_y has a period of 4π <cit.>.\nIn the canonical form, chiral symmetry is given by σ_z.\nModel H_NS,A^(0,0,y) (k,a/2) can be transformed to the canonical form, Table <ref>, using R=R_y, Eq. (<ref>), and H_NS,A^(0,0,x) (k,a/2) can be transformed to the canonical form using R=R_x, Eq. (<ref>).\nThe canonical form in Table <ref> is written for intracell spacing s=a/2, but it may be written for s=0 using the unitary transformation Eqs. (<ref>,<ref>).\nIn terms of tight-binding parameters, nonsymmorphic models (Tables <ref> and <ref>) have definite relationships between nearest-neighbor hopping parameters w and v (generalizing to t_2n+1^' and t_2n+1 for hoppings of arbitrary order, Appendix <ref>). \nSymmorphic models (Tables <ref> and <ref>) either have no particular relation between different hopping parameters or third-nearest neighbor hopping t_3 is related to next-nearest hopping w (generalizing to t_2n+1 and t_2n-1^' for hoppings of arbitrary order, Appendix <ref>). \n\nIn this symmetry class, energy eigenvalues are given by E_±(k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally an insulator.\nSince time-reversal and spatial-inversion symmetries are absent, the spectrum generally isn't an even function of k, but chiral symmetry imposes E_±(k) = - E_∓(k).\nAs d̃_y at s=a/2 has a period of 4π, the path of the d̃ vector in the d̃_x-d̃_y plane is not closed and it is not possible to define a winding number. However, it is possible to identify a ℤ_2 topological index μ_2 <cit.> by counting whether the number of times the trajectory crosses the negative d̃_x axis is even (μ_2=0) or odd (μ_2=1) for 0 ≤ ka < 2 π.\nThe end point of the trajectory must have the same d̃_x value as the start point, and a negated value of d̃_y. Thus, it is impossible to change the ℤ_2 topological index by adiabatically changing parameters in order to move the start and end points or to adjust the trajectory, as long as the origin is avoided.\n\nFor nearest-neighbor terms only (x_0, x_1, x̃_1, β_0, and β̃_0 only), an expression for the ℤ_2 topological index, μ_2, may be found by examining the sign of d̃_x at the point when \nd̃_y = 0 (i.e., when β_0 cos (ka/2) + β̃_0 sin (ka/2) = 0). This gives\n\n    μ_2    =   \n    0     f  > 0 , \n    \n    1     f < 0 ,\n    \n    \n    f    =   x_0/2 (β_0^2 + β̃_0^2) - x_1 (β_0^2 - β̃_0^2) - 2 x̃_1 β_0 β̃_0 ,\n\nand the system is gapless if f = 0.\nExpressions for the parameters x_0, x_1, x̃_1, β_0, and β̃_0 in terms of tight-binding parameters for the two models may be read off Table <ref>.\nFor example, for H_NS,A^(0,0,y), then μ_2 = 1 if u < 2t_AAcos (ϕ_AA - 2 ϕ_v).\nThe ℤ_2 topological index, μ_2, is discussed in more detail in Section <ref>.\n\nAs stated above, there is only one distinct model because H_NS,A^(0,0,y) and H_NS,A^(0,0,x) are related by a diagonal transformation in the atomic basis in position space,\nH_NS,A^(0,0,x) = ℛ_d H_NS,A^(0,0,y)ℛ_d, \nwhere the transformation has period 2a,\n\n    ℛ_d =[  1  0  0  0  0  ⋯;  0  1  0  0  0  ⋯;  0  0 -1  0  0  ⋯;  0  0  0 -1  0  ⋯;  0  0  0  0  1  ⋯;  ⋮  ⋮  ⋮  ⋮  ⋮  ⋱ ] ,\n\nand this may require reversing the sign of some parameters (e.g. t_AA).\nThus, in terms of models which are distinguished by off-diagonal transformations in the atomic basis, there is actually only one, H_NS,A^(0,0,y), which is sketched in Fig. <ref>(a).\n\nThis model, H_NS,A^(0,0,y), can be viewed as a generalized version of the CDW model <cit.> with alternating onsite energies and constant nearest-neighbor hopping v̅ = v exp(i ϕ_v). Second-nearest neighbor hopping (if included) also alternates as t̅_AA = t_AAexp(i ϕ_AA) for A-A hopping and -t̅_AA = - t_AAexp(i ϕ_AA) for B-B hopping. It may be generalized to include arbitrary-range hoppings, Table <ref>.\n\n\n\n\n\n\n\n\n §.§ Nonsymmorphic symmetry class AI with T^2 = 1, C^2 = NS, S^2 = NS\n\n\nWe now consider nonsymmorphic chiral symmetry in systems with charge-conjugation C and time-reversal T symmetries, too.\nIf chiral symmetry S is nonsymmorphic, then one (and only one) of C and T must be, too.\nIf we consider that S and C are nonsymmorphic, each described by T_a/2  or  T_a/2 S_z, then there are four possibilities, Table <ref>, with T being symmorphic (T^2 = 1) for each of them.\nHowever, only one of these is distinct as can be seen by multiplying the symmetry operators by S_z.\n\nTo identify models in the atomic basis corresponding to each of these possibilities, we apply time-reversal symmetry (<ref>) to the models with chiral symmetry described in Section <ref>.\nFor the Bloch Hamiltonian, we consider U_T (k,a/2) to be independent of k, i.e. U_T (k,a/2) = I, σ_x,  σ_y or σ_z.\nThen, with definite chiral symmetry and time-reversal symmetry, we determine the form of charge-conjugation symmetry U_C using U_S (k,a/2) =U_C^∗ (k,a/2) U_T (-k,a/2).\nThus, the four models with T=1, C= NS, S= NS (label `NS' indicates nonsymmorphic) are listed in Table <ref>.\nIn this class, the canonical form of the Bloch Hamiltonian H̃_NS,AI (k,a/2) = ·d̃ can be written as in Table <ref> with d̃_z (k,a/2) = 0.\nValues of the tight-binding parameters of each model in terms of the parameters of the canonical form are given in Table <ref>.\n\nEnergy eigenvalues are E_± (k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally an insulator, Fig. <ref>(b).\nAs described in Section <ref>, d̃_y (k,a/2) has a period of 4π and it is not possible to define a winding number, but there is a ℤ_2 topological index μ_2 <cit.>. This is defined by counting whether the number of times the trajectory crosses the negative d̃_x axis is even (μ_2=0) or odd (μ_2=1) for 0 ≤ ka < 2 π. An example is shown with band structure in Fig. <ref>(a), where we note that the higher-order terms in the canonical form, Table <ref>, produce strong features in the band structure at ka ≈±π/2 which would result in van Hove singularities in the density of states.\nThe path of the corresponding d̃ vector is in Fig. <ref>(b) showing the trajectory crossing the negative d̃_x axis once, indicating a ℤ_2 topological index of value μ_2 = 1 for this choice of parameters. The canonical form, Table <ref>, shows that d̃_y (π/a,a/2) = 0 so the path must cross the d̃_x axis at k = π/a. The end point of the trajectory must have the same d̃_x value as the start point, and a negated value of d̃_y. With these constraints, it is impossible to change the ℤ_2 topological index by adiabatically changing parameters in order to move the start and end points or to adjust the trajectory, as long as the origin is avoided.\nFor nearest-neighbor terms only (x_0, x_1 and β_0 only), the ℤ_2 topological index, μ_2, may be simplified as\n\n    μ_2 = \n    0     x_0 > 2 x_1 , \n    \n    1     x_0 < 2 x_1 ,\n\nand the system is gapless if x_0 = 2 x_1.\nExpressions for x_0, x_1 in terms of tight-binding parameters for different models may be read off Table <ref>. For example, for H_NS,AI^(I,y,y), then μ_2 = 1 if u < 2t_AA.\n\n\n\n\n\n\nThe one distinct model, H_NS,AI^(I,y,y), is the CDW model <cit.> with alternating onsite energies and constant nearest-neighbor hopping v, Fig. <ref>(a).\nSecond-nearest neighbor hopping (if included) also alternates as t_AA for A-A hopping and - t_AA for B-B hopping.\nFor the nonsymmorphic cases, the Bloch Hamiltonian is not 2π periodic in ka, and there is ambiguiity in the choice of the canonical form, Table <ref>: here, we have chosen a `cosine' representation d̃_y (k,a/2) = ∑_n=0^∞ p_n cos[ ka (n+1/2 ) ], but it is equally valid to choose a `sine' representation d̃_y (k,a/2) = ∑_n=0^∞p̃_n sin[ ka (n+1/2 ) ] as the two are related by the diagonal, gauge transformation R_d, Eq. (<ref>), in position space.\nFig. <ref>(b) shows the model schematically in position space after the transformation R_d  H_NS,AI^(I,y,y) R_d, and the transformation introduces alternating nearest-neighbor hopping ± v (this is equivalent to model H_NS,AI^(I,x,x)).\nOn Fourier transforming to k space, the original model, Fig. <ref>(a), yields the cosine representation,\nE_cos (k) = ±√([u + 2t_AAcos(ka)]^2 + [2vcos(ka/2)]^2), as plotted in Fig. <ref>(c).\nHowever, the transformed model, Fig. <ref>(b), gives the sine representation,\nE_sine (k) = ±√([u - 2t_AAcos(ka)]^2 - [2vsin(ka/2)]^2), as plotted in Fig. <ref>(e).\nThe two representations describe the same physical states\nE_sine (k + π /a) = E_cos (k)\nas can be seen by the fact they both give the same spectrum upon zone folding at ka = ±π/2, Fig. <ref>(d).\n\nIn this symmetry class, both chiral symmetry S and charge-conjugation C are nonsymmorphic, Table <ref>, and one may wonder whether this symmetry class has C^2 = 1 or C^2 = -1. There are models (H_NS,AI^(I,x,x) and H_NS,AI^(z,x,y)) where C = σ_x in k space and C = T_a/2 in position space. Hence C^2 = T_a/2^2 = T_a is not the identity matrix as such but describes translation by a unit cell (of length a) which is a symmetry of the lattice. However, there are also models (H_NS,AI^(I,y,y) and H_NS,AI^(z,y,x)) where C = σ_y in k space and C = T_a/2 S_z in position space. Since T_a/2 and S_z anticommute, then C^2 = T_a/2 S_z T_a/2 S_z = - T_a/2^2 = - T_a. So, there appears to be both cases (C^2 = 1 or C^2 = -1), even though, as described above, all four models are equivalent (related by diagonal gauge transformations).\n\nThus, we choose to identify this symmetry (sub)class by C^2 = NS rather than C^2 = 1 or C^2 = -1.\nNote that the apparent ambiguity (C^2 = 1 or C^2 = -1) is recognised as ambiguity in the sign, ϵ_σ, of a product of symmetry operators in the classification of Ref. <cit.>, and the classification does not depend on such ambiguity.\nIn the next section, we describe a similar situation with nonsymmorphic time-reversal symmetry, and show how the two apparently contradicting cases (of T^2 = 1 and T^2 = -1) give a consistent implementation of Kramer's degeneracy.\n\n\n\n\n\n\n\n\n\n §.§ Nonsymmorphic symmetry class D with T^2=NS, C^2 = 1, S^2 = NS\n\n\nIf we now choose S and T to be nonsymmorphic, each described by T_a/2  or  T_a/2 S_z, then there are also four possibilities, Table <ref>, with C being symmorphic (C^2 = 1) for each of them.\nAgain, one of these (e.g. H_NS,D^(x,z,y)) is distinct as can be seen by multiplying the symmetry operators by S_z.\nModel H_NS,D^(x,z,y), Fig. <ref>(a), has real nearest-neighbor hopping v, but imaginary and alternating second-neighbor hopping ± i t_AA.\n\nThe canonical form of the Bloch Hamiltonian H̃_NS,D (k,a/2) = ·d̃ is given in Table <ref> with d̃_z (k,a/2) = 0.\nValues of the tight-binding parameters of each model in terms of the parameters of the canonical form are given in Table <ref>.\nEnergy eigenvalues are E_± (k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally gapless, Fig. <ref>(d).\n\nHere, we have chosen the `cosine' representation d̃_y (k,a/2) = ∑_n=0^∞ p_n cos[ ka (n+1/2 ) ], but it is equally valid to choose a `sine' representation d̃_y (k,a/2) = ∑_n=0^∞p̃_n sin[ ka (n+1/2 ) ] as the two are related by the diagonal, gauge transformation R_d, Eq. (<ref>), in position space.\nFig. <ref>(b) shows the model schematically in position space after the transformation R_d  H_NS,D^(x,z,y) R_d, and the transformation introduces alternating nearest-neighbor hopping ± v (this is equivalent to model H_NS,D^(y,z,x)).\nOn Fourier transforming to k space, the original model, Fig. <ref>(a), yields the cosine representation,\nE_cos (k) = ±√(4t_AA^2sin^2(ka) + 4v^2cos^2(ka/2)), as plotted in Fig. <ref>(c).\nHowever, the transformed model, Fig. <ref>(b), gives the sine representation,\nE_sine (k) = ±√(4t_AA^2sin^2(ka) + 4v^2sin^2(ka/2)), as plotted in Fig. <ref>(e).\nThe two representations describe the same physical states\nE_sine (k + π /a) = E_cos (k)\nas can be seen by the fact they both give the same spectrum upon zone folding at ka = ±π/2, Fig. <ref>(d).\n\n\n\n\n\nIn each of the band plots, Fig. <ref>(c), (d), (e), there is a single degeneracy point in the spectrum <cit.>, and the system is gapless. We find that Kramer's degeneracy does not hold in general (most states are not degenerate with their time-reversed pair), but there is a single point which is doubly degenerate.\nTo show this, let us briefly summarise the argument for Kramer's degeneracy.\nWe denote the time-reversal operator as T(k) = U_T (k) K where U_T (k) ≡ U_T (k,s=0) is a unitary operator and K is the complex conjugation operator. We explicitly include the possiblity of k dependence and consider zero intracell separation s=0.\nThen, for two states | ψ (k) ⟩ and | ϕ (k) ⟩,\n\n    ⟨ T(k) ψ (k) | T(k) ϕ (k) ⟩   =   ⟨ U_T (k) ψ^∗ (k) | U_T (k) ϕ^∗ (k) ⟩ , \n       =   ⟨ψ^∗ (k) | U_T^† (k) U_T (k) ϕ^∗ (k) ⟩ , \n       =   ⟨ϕ (k) | ψ (k) ⟩ ,\n\nusing U_T^† (k) U_T (k) = I and ⟨ψ | ϕ⟩^∗ = ⟨ϕ | ψ⟩.\nSubstituting ϕ (k) ≡ T(k) ψ (k) into Eq. (<ref>),\n\n    ⟨ T(k) ψ (k) | ψ (k) ⟩ = \n    ⟨ T(k) ψ (k) | T^2(k) ψ (k) ⟩ .\n\nThe right side may be written as\n\n    ⟨ T(k) ψ (k) |  T^2(k) ψ (k) ⟩\n       =   ⟨ T(k) ψ (k) | U_T (k) U_T^∗ (k) ψ (k) ⟩ .\n\nIf U_T (k) U_T^∗ (k) = - I,\nthen\n\n    ⟨ T(k) ψ (k) |  T^2(k) ψ (k) ⟩\n    = - ⟨ T(k) ψ (k) | ψ (k) ⟩ .\n\nComparison with Eq. (<ref>) requires that\n\n    U_T (k) U_T^∗ (k) = - I   ⇒  ⟨ T(k) ψ (k) | ψ (k) ⟩ = 0 .\n\nThis means that every state has an orthogonal time-reversed partner which is at the same energy, and that k values that are time-reversal invariant are points of degeneracy.\n\nNote that there is a subtle difference between the requirement (<ref>) on the operator to represent time reversal, U_T (k) U_T^∗ (-k)  = ± I, and the requirement (<ref>) for Kramer's degeneracy, U_T (k) U_T^∗ (k) = - I.\nIn the symmorphic symmetry classes AII and DIII, U_T (k) = σ_y is independent of k, and U_T U_T^∗ = - I. Thus, every state has a degenerate partner, and there are degeneracy points at time-reversal invariant k values (k=0 and k= ±π/a).\n\nWhen time is nonsymmorphic, U_T (k) is dependent on k; while U_T (k) U_T^∗ (-k)  = ± I for all k, Kramer's degeneracy U_T (k) U_T^∗ (k) = - I is only satisfied for certain k values.\nThe form of U_T (k) depends on the representation of the nonsymmorphic terms in the d̃ vector. For the cosine representation, U_T (k,a/2) = σ_x and Eq. (<ref>) shows that\n\n    U_T (k)    =   [        0  e^ika/2; e^-ika/2        0 ] , \n    ⇒    \n    U_T (k) U_T^∗ (k)    =   [  e^ika      0;      0 e^-ika ] ,\n\nso this is equal to -1 for ka=±π only; this is the location of the degeneracy point in Fig. <ref>(c).\n\nFor the sine representation, U_T (k,a/2) = σ_y and\n\n    U_T (k)    =   [          0 -i e^ika/2; i e^-ika/2          0 ] , \n    ⇒    \n    U_T (k) U_T^∗ (k)    =   [  - e^ika        0;        0 - e^-ika ] ,\n\nso this is equal to -1 for k = 0 only, Fig. <ref>(e).\nRegardless of the representation (e.g. see Fig. <ref>(d) for the zone-folded band structure), Kramer's degeneracy of the nonsymmorphic time-reversal symmetry dictates that there is one degeneracy point as opposed to none in the symmorphic case with T^2 = 1 and two in the symmorphic case with T^2 = - 1.\n\n\n\n\n\n\n\n\n\n\n §.§ Nonsymmorphic symmetry class AIII with T^2=NS, C^2=NS, S^2=1\n\n\nFinally, we can choose C and T to be nonsymmorphic, each described by T_a/2  or  T_a/2 S_z. In this case there are only two possibilities, Table <ref>, because 𝒮 = I is not possible; for both possibilities 𝒮 = S_z (S^2=1).\nAgain, only one model is distinct, e.g. H_NS,AIII^(x,y,z), Fig. <ref>(b).\nTo find the form of the models in position space, with 𝒮 = S_z, we begin by considering the generalized SSH Bloch Hamiltonian H_S,AIII^(0,0,z) (k,s) and apply time-reversal symmetry, considering U_T (k,a/2) to be independent of k.\n\nThe canonical form of the Bloch Hamiltonian H̃_NS,AIII (k,a/2) = ·d̃ with d̃_z (k,a/2) = 0 is given in Table <ref>, which is the cosine represenation. Note that the sine representation would have\nd̃_x (k,a/2) = ∑_n=0^∞α̃_n sin[ ka (n+1/2 ) ] and d̃_y (k,a/2) = ∑_n=0^∞β̃_n sin[ ka (n+1/2 ) ].\nEnergy eigenvalues are E_± (k) = ±√(d̃_x^2 + d̃_y^2), and the system is generally gapless, Fig. <ref>(f), due to nonsymmorphic time-reversal symmetry and Kramer's degeneracy, as described in Section <ref>.\n\n\n\n§ NONSYMMORPHIC MODELS WITHOUT CHIRAL SYMMETRY\n\n\n\n\n §.§ Nonsymmorphic symmetry class A with T^2=NS, C^2 =0, S^2 = 0\n\n\nTo explicitly confirm that the presence of a single degeneracy point is due to\nKramer's degeneracy with nonsymmorphic time-reversal symmetry, we construct a model with nonsymmorphic time-reversal symmetry only, i.e. no chiral, charge-conjugation or spatial inversion symmetry.\nWe begin from the full model with d_0 ≠ 0, Eqs. (<ref>,<ref>) and set the intracell spacing s=a/2.\n\nWe can choose U_T (k,a/2) = σ_x (𝒯 = T_a/2 in position space) yielding the cosine representation and model\nH_NS,A^(x,0,0), Table <ref>,\nor U_T (k,a/2) = σ_y (𝒯 = T_a/2 S_z) giving the sine representation and model H_NS,A^(y,0,0).\nOnly one of these is distinct, e.g. H_NS,A^(x,0,0), because H_NS,A^(y,0,0) is related to it by the diagonal transformation ℛ_i, Eq. (<ref>). Model H_NS,A^(x,0,0) is shown schematically in Fig. <ref>(c).\n\nFor the canonical form, we use the cosine representation, Table <ref>.\nTable <ref> shows values of the tight-binding parameters for the two models and the corresponding values of the parameters a_n, α_n, β_n, and z̃_n of the canonical form, Table <ref>.\nBand energies are E_± (k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2).\nOwing to the nonsymmorphic time-reversal symmetry and Kramer's degeneracy, there is a single degeneracy point\n(at ka = π in the canonical form, Table <ref>).\n\n\n\n §.§ Nonsymmorphic symmetry class A with T^2=0, C^2 =NS, S^2 = 0\n\n\nTo complete the description of nonsymmorphic models, we conclude with models having nonsymmorphic charge-conjugation symmetry (only).\nAgain, we begin from the full model with d_0 ≠ 0, Eqs. (<ref>,<ref>) and set the intracell spacing s=a/2.\nWe can choose U_C (k,a/2) = σ_y (𝒞 = T_a/2 S_z in position space) yielding the cosine representation and model\nH_NS,A^(0,y,0), Table <ref>, or U_C (k,a/2) = σ_x (𝒞 = T_a/2) giving the sine representation and model H_NS,A^(0,x,0).\nOnly one of these is distinct, e.g. H_NS,A^(0,y,0), because H_NS,A^(0,x,0) is related to it by the diagonal transformation ℛ_i, Eq. (<ref>). Model H_NS,A^(0,y,0) is shown schematically in Fig. <ref>(d).\n\nFor the canonical form, we use the cosine representation, Table <ref>.\nTable <ref> shows values of the tight-binding parameters for the two models and the corresponding values of the parameters ã_n, α_n, β_n, and z_n of the canonical form, Table <ref>.\nBand energies are E_± (k) = d̃_0 ±√(d̃_x^2 + d̃_y^2 + d̃_z^2), and the form of d̃_z shows that this is generally insulating.\n\nK theory predicts <cit.> that this class has a ℤ_2 topological index even in the absence of time-reversal or chiral symmetry.\nThe description of the ℤ_2 index in the presence of nonsymmorphic chiral symmetry <cit.>, discussed in Sections <ref> and <ref>, may be generalized to the canonical form, Table <ref>. Now, we consider the trajectory for 0 ≤ ka < 2 π in three-dimensional space with Cartesian axes d̃_x, d̃_y, d̃_z, and count whether the number of times the trajectory crosses the negative d̃_z axis is even (μ_2=0) or odd (μ_2=1).\nThe ℤ_2 index may be defined because of contraints on the trajectory as described by the canonical form, Table <ref>: \nd̃_x (π/a,a/2) = d̃_y (π/a,a/2) = 0 so the path must cross the d̃_z axis at k = π/a; the end point of the trajectory must have the same d̃_z value as the start point, with negated values of d̃_x and d̃_y. With these constraints, it is impossible to change the ℤ_2 index by adiabatically changing parameters in order to move the start and end points or to adjust the trajectory, as long as the origin is avoided.\nFor nearest-neighbor terms only (z_0, z_1, α_0 and β_0 only), the ℤ_2 topological index, μ_2, may be simplified as\n\n    μ_2 = \n    0     z_0 > 2 z_1 , \n    \n    1     z_0 < 2 z_1 ,\n\nand the system is gapless if z_0 = 2 z_1. Expressions for z_0, z_1 in terms of tight-binding parameters for the two models may be read off Table <ref>. For example, for H_NS,A^(0,y,0), then μ_2 = 1 if u < 2 t_AAcosϕ_AA.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\nWe considered noninteracting, one-dimensional tight-binding models on a periodic lattice with two energy bands.\nFor each symmetry class, Table <ref>, we identified distinct models in the atomic basis in position space and showed that they may be written in a unified canonical form.\nGenerally, states of matter were found to be in agreement with predictions of the tenfold way classification for the symmorphic models <cit.> and with the classification of Ref. <cit.> for nonsymmorphic models.\nExceptions arise because we only consider systems with two bands: they are the symmorphic DIII and the nonsymmorphic D class which we find are both gapless due to the presence of time-reversal symmetry with Kramer's degeneracy. With two bands, there are also not enough degrees of freedom to realize the CII (chiral symplectic) symmetry class <cit.>.\nIn principle, however, our approach could be extended to include more than two orbitals per unit cell or to incorporate superconducting pairing, yielding a four-orbital Bogoliubov de Gennes representation.\n\nWe described models with nonsymmorphic nonspatial symmetries and found that they separate into only two types of state of matter: an insulator with a ℤ_2 topological index <cit.> in the absence of nonsymmorphic time-reversal symmetry or, in the presence of nonsymmorphic time-reversal symmetry, a metallic state <cit.>.\nThe models identified in the atomic basis in position space provide a recipe for experimental realization of examples of each symmetry group in a relatively simple way with only two orbitals per cell, and there are a variety of different platforms for physical synthesis of one-dimensional tight-binding models including engineered atomic lattices <cit.> and cold atoms in optical lattices <cit.>.\n\nAll relevant data presented in this paper can be accessed <cit.>.\n\n\n\nThe author thanks S. T. Carr, C. Y. Leung, A. Romito and H. Schomerus for helpful discussions.\n\n\n\n\n\n\n\n\n\n\n\n\n§ LONG-RANGE HOPPINGS\n\n\nWe generalize the Rice-Mele model (<ref>) to include all possible long-range couplings,\n\n    d_0 (k,s)    =   ϵ_0 + ∑_n=1^∞[ t_2ncos (nka + ϕ_2n ) \n           + t_2n^'cos (nka + ϕ_2n^' ) ] , \n    \n    d_x (k,s)    =   ∑_n=0^∞[ t_2n+1cos [k (na + s) + ϕ_2n+1] \n            + t_2n+1^'cos [ k((n+1)a - s) + ϕ_2n+1^'] ] , \n    \n    d_y (k,s)    =   ∑_n=0^∞[ - t_2n+1sin [k (na + s) + ϕ_2n+1] \n            + t_2n+1^'sin [ k((n+1)a - s) + ϕ_2n+1^'] ] , \n    \n    d_z (k,s)    =    u + ∑_n=1^∞[ t_2ncos (nka + ϕ_2n )\n    \n           - t_2n^'cos (nka + ϕ_2n^' ) ] ,\n\nwhere t_2n and t_2n^' are A-A and B-B hoppings with phases ϕ_2n and ϕ_2n^', t_2n+1 and t_2n+1^' are A-B hoppings with phases ϕ_2n+1 and ϕ_2n+1^', for integer n.\nIn terms of the nearest-neighbor parameters in the main text, t_2 = t_AA, t_2^' = t_BB, ϕ_2 = ϕ_AA, ϕ_2^' = ϕ_BB, t_1 = v, t_1^' = w, ϕ_1 = ϕ_v, ϕ_1^' = ϕ_w.\nFor symmorphic models without chiral symmetry, application of time-reversal or charge-conjugation symmetry requires that each component d_i is an even or odd function of k at s=0, resulting in the same models as described in the main text with all hoppings as listed in Table <ref>. For nonsymmorphic models without chiral symmetry, we consider intracell spacing s=a/2, and they are listed in Table <ref>.\n\nChiral symmetry imposes d_0=0 and one of the other components must be zero, too.\nWith d_0 = 0, then ϵ_0 = 0, t_2n^' = - t_2n and ϕ_2n^' = ϕ_2n.\nThen, for symmorphic models, we consider s=0 and simplify as\n\n    d_x (k,0)    =    v cosϕ_v + ∑_n=1^∞[ t_2n+1cos (kna  + ϕ_2n+1) \n               + t_2n-1^'cos ( kna + ϕ_2n-1^') ] , \n    \n    d_y (k,0)    =    - v sinϕ_v + ∑_n=1^∞[ - t_2n+1sin (kna  + ϕ_2n+1) \n               + t_2n-1^'sin ( kna + ϕ_2n-1^') ] , \n    \n    d_z (k,0)    =    u + 2 ∑_n=1^∞ t_2ncos (nka + ϕ_2n ) ,\n\nusing t_1 = v and ϕ_1 = ϕ_v. Applying chiral and time-reversal symmetries introduces constraints on the parameters giving the models discussed in the main text for nearest-neighbor hopping and listed in Table <ref> including all long-range hoppings. \nFor nonsymmorphic models, we consider s=a/2 and simplify as\n\n    d_x (k,a/2)    =   ∑_n=0^∞[ t_2n+1cos (ka[n+12]  + ϕ_2n+1) \n             + t_2n+1^'cos ( ka[n+12] + ϕ_2n+1^') ] , \n    \n    d_y (k,a/2)    =   ∑_n=0^∞[ - t_2n+1sin (ka[n+12]  + ϕ_2n+1) \n             + t_2n+1^'sin ( ka[n+12] + ϕ_2n+1^') ] , \n    \n    d_z (k,a/2)    =    u + 2 ∑_n=1^∞ t_2ncos (nka + ϕ_2n ) .\n\nAgain, application of chiral and time-reversal symmetries introduces constraints on the parameters giving the models discussed in the main text for nearest-neighbor hopping and listed in Table <ref> including all long-range hoppings. \n\n\n\n§ SPATIAL-INVERSION SYMMETRY AND QUANTIZED ZAK PHASE\n\n\nThe catalog of tight-binding models in the main text, Table <ref>, is based on the ten-fold way classification of nonspatial symmetries (time-reversal, charge-conjugation and chiral) <cit.>  . An alternative approach is to classify models based on spatial-inversion symmetry <cit.> as described by Eq. (<ref>).\nWe consider the generalized Rice-Mele model, Eqs. (<ref>,<ref>,<ref>,<ref>), and apply spatial-inversion symmetry in the form of U_P = I, σ_x,  σ_y,  or σ_z. This forces the individual components of the d vector to be either even or odd with respect to k.\n\nWith intracell spacing s=0, there are four models, denoted H_S,A^(U_P=i) for i = I, σ_x,  σ_y,  or σ_z with parameters listed in Table <ref>. In position space, these models satisfy spatial inversion (<ref>) with 𝒫 = P_I, P_x, P_y, or P_z, respectively, for an even number of atoms, J.\nFor model H_S,A^(U_P=I) with U_P=I, all four components of the d vector are even with respect to k. Apart from component d_0, this is the same as class C with U_C^2 = -1 described in the main text, Table <ref>. Hence, as with class C, H_S,A^(U_P=I) will be an insulator with a single phase only.\n\nOf the three models H_S,A^(U_P=i) for i = σ_x,  σ_y, or σ_z, only two of them (H_S,A^(U_P=σ_x) and H_S,A^(U_P=σ_z)) are distinct in the atomic basis because H_S,A^(U_P=σ_y) is a version of H_S,A^(U_P=σ_x) with imaginary A-B coupling parameters and is thus related to it by a diagonal gauge transformation.\nWith these models, component d_0 is an even function of k, one of the other components is also even and the other two are odd. They may be rotated into the same canonical form using rotations such as R_x or R_y. Apart from component d_0, they have the same form as class D with U_C^2 = 1 described in the main text, Table <ref>. Like class D, they are insulators with a ℤ_2 topological index. In the context of one-dimensional systems with spatial inversion symmetry, the ℤ_2 index is Zak phase quantized to either 0 or π <cit.>.\n\nWith intracell spacing s=a/2, application of U_P = σ_x or σ_y just reproduces models H_S,A^(U_P=σ_x) and H_S,A^(U_P=σ_y) discussed above.\nApplication of U_P = I or σ_z produces two models denoted H_NS,A^(U_P=I) and H_NS,A^(U_P=σ_z), with tight-binding parameters listed in Table <ref>.\nIn position space, these models satisfy spatial inversion (<ref>) with 𝒫 = P_x (for U_T = I) or P_y (for U_T = σ_z), for an odd number of atoms, J. We label these models as `NS' even though the symmetry is not nonsymmorphic, because the form of the Hamiltonian is similar to that of the nonsymmorphic ones, i.e., they also have definite relationships between hoppings t_2n+1^' and t_2n+1, Table <ref>.\nOnly one of these models is distinct, H_NS,A^(U_P=I), because H_NS,A^(U_P=σ_z) is related to it by the diagonal transformation ℛ_d, Eq. (<ref>).\nApart from component d_0 (which is even), H_NS,A^(U_P=I) has the same form as class A with U_C^2 = NS described in the main text, Table <ref>. Like this class, H_NS,A^(U_P=I) describes an insulator with a ℤ_2 topological index (the quantized Zak phase).\n\nOne can subsequently refine the classification by applying time-reversal or charge-conjugation symmetry which will also place requirements on components of the d vector to be even or odd functions of k. In situations where these constraints clash with those of spatial-inversion symmetry, the component must be set equal to zero.\nWith time-reversal symmetry, the resulting models would be like those with chiral symmetry but with d_0 ≠ 0.\nFor example, applying U_T = I to model H_S,A^(U_P=σ_x) requires d_z =0 with d_x being even and d_y odd, similar to class BDI, Table <ref> (with d_0 ≠ 0).\n\n\n99\n\nwigner51\nE. P. Wigner,\nProc. Camb. Philos. Soc. 47, 790 (1951).\n\nwigner58\nE. P. Wigner,\nAnn. Math. 67, 325 (1958).\n\ndyson62a\nF. J. Dyson,\nJ. Math. Phys. 3, 140 (1962).\n\ngade93\nR. Gade,\nNucl. Phys. B 398, 499 (1993).\n\nverbaarschot93\nJ. J. M. Verbaarschot and I. Zahed,\nPhys. Rev. Lett. 70, 3852 (1993).\n\nverbaarschot94\nJ. Verbaarschot,\nPhys. Rev. Lett. 72, 2531 (1994).\n\naltland97\nA. Altland and M. R. Zirnbauer,\nPhys. Rev. B 55, 1142 (1997).\n\nschnyder08\nA. P. Schnyder, S. Ryu, A. Furusaki, and A. W. W. Ludwig,\nPhys. Rev. B 78, 195125 (2008).\n\nkitaev09\nA. Kitaev, \nAIP Conf. Proc. 1134, 22 (2009).\n\nryu10\nS. Ryu, A. P. Schnyder, A. Furusaki, and A. W. W. Ludwig,\nNew J. Phys. 12, 065010 (2010).\n\nchiu16\nC.-K.Chiu, J. C. Y. Teo, A. P. Schnyder, and S. Ryu,\nRev. Mod. Phys. 88, 035005 (2016).\n\nliu14\nC.-X. Liu, R.-X. Zhang, and B. K. VanLeeuwen,\nPhys. Rev. B 90, 085304 (2014).\n\nshiozaki14\nK. Shiozaki and M. Sato,\nPhys. Rev. B 90, 165114 (2014).\n\nyoung15\nS. M. Young and C. L. Kane,\nPhys. Rev. Lett. 115, 126803 (2015).\n\nwang16\nZ. Wang, A. Alexandradinata, R. J. Cava, and B. A. Bernevig,\nNature 532, 189 (2016).\n\nshiozaki16\nK. Shiozaki, M. Sato, and K. Gomi,\nPhys. Rev. B 93, 195413 (2016).\n\nkruthoff17\nJ. Kruthoff, J. de Boer, J. van Wezel, C. L. Kane, and R.-J. Slager,\nPhys. Rev. X 7, 041069 (2017).\n\nherrera22\nM. A. J. Herrera and D. Bercioux,\nCommun. Phys. 6, 42 (2023).\n\nlax74\nM. Lax,\nSymmetry principles in solid state and molecular physics\n(Wiley-Interscience, 1974).\n\nmong10\nR. S. K. Mong, A. M. Essin, and J. E. Moore,\nPhys. Rev. A 81, 245209 (2010).\n\notrokov19\nM. M. Otrokov et al.,\nNature 576, 416 (2019).\n\ngong19\nY. Gong et al.,\nChin. Phys. Lett. 36, 076801 (2019).\n\nzhang19\nD. Zhang, M. Shi, T. Zhu, D. Xing, H. Zhang, and J. Wang,\nPhys. Rev. Lett. 122, 206401 (2019).\n\nniu20\nC. Niu, H. Wang, N. Mao, B. Huang, Y. Mokrousov, and Y. Dai,\nPhys. Rev. Lett. 124, 066401 (2020).\n\nfang15\nC. Fang and L. Fu,\nPhys. Rev. B 91, 161105(R) (2015).\n\nshiozaki15\nK. Shiozaki, M. Sato, and K. Gomi, \nPhys. Rev. B 91, 155120 (2015).\n\nzhao16\nY. X. Zhao and A. P. Schnyder,\nPhys. Rev. B 94, 195109 (2016).\n\narkinstall17\nJ. Arkinstall, M. H. Teimourpour, L. Feng, R. El-Ganainy, and H. Schomerus,\nPhys. Rev. B 95, 165109 (2017).\n\nmarques19\nA. M. Marques and R. G. Dias,\nPhys. Rev. B 100, 041104(R) (2019).\n\nbrzezicki20\nW. Brzezicki and T. Hyart,\nPhys. Rev. B 101, 235113 (2020).\n\nallen22\nR. E. J. Allen, H. V. Gibbons, A. M. Sherlock, H. R. M. Stanfield, and E. McCann, Phys. Rev. B 106, 165409 (2022).\n\nyang22\nY. Yang, H. C. Po, V. Liu, J. D. Joannopoulos, L. Fu, and M. Soljačić,\nPhys. Rev. B 106, L161108 (2022).\n\nssh79\nW. P. Su, J. R. Schrieffer, and A. J. Heeger,\nPhys. Rev. Lett. 42, 1698 (1979).\n\nssh80\nW. P. Su, J. R. Schrieffer, and A. J. Heeger,\nPhys. Rev. B 22, 2099 (1980).\n\nhasan10\nM. Z. Hasan and C. L. Kane\nRev. Mod. Phys. 82, 3045 (2010).\n\nasboth16\nJ. K. Asbóth, L. Oroszlány, and A. Pályi,\nA Short Course on Topological Insulators\n(Springer, Switzerland, 2016).\n\ncayssol21\nJ. Cayssol and J.-N. Fuchs,\nJ. Phys. Mater. 4, 034007 (2021).\n\ntakayama80\nH. Takayama, Y. R. Lin-Liu, and K. Maki,\nPhys. Rev. B 21, 2388 (1980).\n\nkivelson83\nS. Kivelson,\nPhys. Rev. B 28, 2653 (1983).\n\nfulga11\nI. C. Fulga, F. Hassler, A. R. Akhmerov, and C. W. J. Beenakker,\nPhys. Rev. B 83, 155429 (2011).\n\nchen11\nK. T. Chen and P. A. Lee,\nPhys. Rev. B 84, 113111 (2011).\n\ngangadharaiah12\nS. Gangadharaiah, L. Trifunovic, and D. Loss,\nPhys. Rev. Lett. 108, 136803 (2012).\n\npershoguba12\nS. S. Pershoguba and V. M. Yakovenko,\nPhys. Rev. B 86, 075304 (2012).\n\nli14\nL. Li, Z. Xu, and S. Chen,\nPhys. Rev. B 89, 085111 (2014).\n\nguo16\nH.-M. Guo,\nSci. China Phys. Mech. 59, 637401 (2016).\n\nvelasco17\nC. G. Velasco and B. Paredes,\nPhys. Rev. Lett. 119, 115301 (2017).\n\nbercioux17\nD. Bercioux, O. Dutta, and E. Rico,\nAnn. Phys. 529, 1600262 (2017).\n\nrhim17\nJ.-W. Rhim, J. Behrends, and J. H. Bardarson,\nPhys. Rev. B 95, 035421 (2017).\n\nrhim18\nJ.-W. Rhim, J. H. Bardarson, and R.-J. Slager,\nPhys. Rev. B 97, 115143 (2018).\n\nliu18\nT. Liu and H. Guo,\nPhys. Lett. A 382, 3287 (2018).\n\nmunoz18\nF. Munoz, F. Pinilla, J. Mella, and M. I. Molina,\nSci. Rep. 8, 17330 (2018).\n\nperezgonzalez19\nB. Pérez-González, M. Bello, Á. Gómez-León, and G. Platero,\nPhys. Rev. B 99, 035146 (2019).\n\nchen20\nB.-H. Chen and D.-W. Chiou,\nPhys. Lett. A 384, 126168 (2020).\n\nscollon20\nM. Scollon and M. P. Kennett,\nPhys. Rev. B 101, 144204 (2020).\n\npletyukhov20\nM. Pletyukhov, D. M. Kennes, K. Piasotski, J. Klinovaja, D. Loss, and H. Schoeller,\nPhys. Rev. Research 2, 033345 (2020).\n\nlin20\nY.-T. Lin, D. M. Kennes, M. Pletyukhov, C. S. Weber, H. Schoeller, and V. Meden,\nPhys. Rev. B 102, 085122 (2020).\n\nvanmiert20\nG. van Miert and C. Ortix,\nnpj Quantum Mater. 5, 63 (2020).\n\nhan20\nS.-H. Han, S.-G. Jeong, S.-W. Kim, T.-H. Kim, and S. Cheon,\nPhys. Rev. B 102, 235411 (2020).\n\nchen21\nH.-T. Chen, C.-H. Chang, and H.-c. Kao,\nChin. J. Phys. 72, 50 (2021).\n\nfuchs21\nJ.-N. Fuchs and F. Piéchon,\nPhys. Rev. B 104, 235428 (2021).\n\nkim12\nT.-H. Kim and H. W. Yeom,\nPhys. Rev. Lett. 109, 246802 (2012).\n\ncheon15\nS. Cheon, T.-H. Kim, S.-H. Lee, and H. W. Yeom,\nScience 350, 182 (2015).\n\nshim15\nH. Shim, G. Lee, J.-M. Hyun, and H. Kim,\nNew J. Phys. 17, 093026 (2015).\n\nkim17\nT.-H. Kim, S. Cheon, and H. W. Yeom,\nNat. Phys. 13, 444 (2017).\n\ndrost17\nR. Drost, T. Ojanen, A. Harju, and P. Liljeroth, \nNat. Phys. 13, 668 (2017).\n\nlee19\nG. Lee, H. Shim, J.-M. Hyun, and H. Kim,\nPhys. Rev. Lett. 122, 016102 (2019).\n\nhuda20\nM. N. Huda, S. Kezilebieke, T. Ojanen, R. Drost, and P. Liljeroth,\nnpj Quantum Mater. 5, 17 (2020).\n\nkiczynski22\nM. Kiczynski, S. K. Gorman, H. Geng, M. B. Donnelly, Y. Chung, Y. He, J. G. Keizer, and M. Y. Simmons,\nNature 606, 694 (2022).\n\natala13\nM. Atala, M. Aidelsburger, J. T. Barreiro, D. Abanin, T. Kitagawa, E. Demler, and I. Bloch,\nNat. Phys. 9, 795 (2013).\n\nprzysiezna15\nA. Przysiezna, O. Dutta, and J. Zakrzewski,\nNew J. Phys. 17, 013018 (2015).\n\nmeier16\nE. J. Meier, F. A. An, and B. Gadway,\nNat. Commun. 7, 13986 (2016).\n\nmeier18\nE. J. Meier, F. A. An, A. Dauphin, M. Maffei, P. Massignan, T. L. Hughes, and B. Gadway,\nScience 362, 929 (2018).\n\ncooper19\nN. R. Cooper, J. Dalibard, and I. B. Spielman,\nRev. Mod. Phys. 91, 015005 (2019).\n\nkang2020\nJ. H. Kang, J. H. Han, and Y Shin,\nNew J. Phys. 22, 013023 (2020).\n\nricemele82\nM. J. Rice and E. J. Mele,\nPhys. Rev. Lett. 49, 1455 (1982).\n\ncreutz99\nM. Creutz,\nPhys. Rev. Lett. 83, 2636 (1999).\n\nshockley39\nW. Shockley,\nPhys. Rev. 56, 317 (1939).\n\nvanderbilt93\nD. Vanderbilt and R. D. King-Smith,\nPhys. Rev. B 48, 4442 (1993).\n\ncanonicalnote\nFor each symmetry class, we can write all models in the same canonical form using unitary transformations. In some cases, the canonical form is not unique, e.g. for class BDI, Table <ref>, we have chosen d̃_x even and d̃_y odd, but one could also choose d̃_x odd and d̃_y even. For nonsymmorphic systems, there is a `cosine' or a `sine' representation, as described in the main text: this corresponds to the occasional ambiguity in the sign, ϵ_σ, of a product of symmetry operators in Ref. <cit.>.\n\nbudich13\nJ. C. Budich and E. Ardonne,\nPhys. Rev. B 88, 134523 (2013).\n\nli16\nL. Li, C. Yang, and S. Chen,\nEur. Phys. J. B 89, 195 (2016).\n\nmatveeva22\nP. Matveeva, T. Hewitt, D. Liu, K. Reddy, D. Gutman, and S. T. Carr,\nPhys. Rev. B 107, 075422 (2023).\n\nbena09\nC. Bena and G. Montambaux,\nNew J. Phys. 11, 095003 (2009).\n\nsymmetrynotes\nThe condition U_S (k,s) =U_C^∗ (k,s) U_T (-k,s) may sometimes yield irrelevant additional factors (e.g. of `i') appearing as products with the Pauli spin matrices; we neglect such factors.\n\nkitaev01\nA. Y. Kitaev,\nPhys.-Usp. 44, 131 (2001).\n\nbychkovrashba84\nY. A. Bychkov and E. I. Rashba,\nJ. Phys. C 17, 6039 (1984).\n\nmii14\nT. Mii, N. Shima, K. Kano, and K. Makoshi,\nJ. Phys. Soc. Jpn. 83, 064706 (2014).\n\nhughes11\nT. L. Hughes, E. Prodan, and B. A. Bernevig,\nPhys. Rev. B 83, 245132 (2011).\n\nzak89\nJ. Zak,\nPhys. Rev. Lett. 62, 2747 (1989).\n\ndatanote\nhttps://doi.org/10.17635/lancaster/researchdata/597https://doi.org/10.17635/lancaster/researchdata/597\n\n\n\n"}