{"entry_id": "http://arxiv.org/abs/2303.06962v1", "published": "20230313100446", "title": "Near-Field Beam Training of Intelligent Reflecting Surface: A Novel Two-Layer Codebook", "authors": ["Tao Wang", "Jie Lv", "Haonan Tong", "Changchuan Yin"], "primary_category": "cs.IT", "categories": ["cs.IT", "eess.SP", "math.IT"], "text": "\n \n\n\n\n\n\n\nNear-Field Beam Training of Intelligent Reflecting Surface: A Novel Two-Layer Codebook\n    \nTao Wanghttps://orcid.org/0000-0002-8695-5400\n    < g r a p h i c s >\n, \nJie Lvhttps://orcid.org/0000-0001-9028-6986\n    < g r a p h i c s >\n, \nHaonan Tonghttps://orcid.org/0000-0002-1835-4769\n    < g r a p h i c s >\n, and \nChangchuan Yinhttps://orcid.org/0000-0001-8969-1431\n    < g r a p h i c s >\n, Senior Member IEEE\nThe authors are with the School of Information and Communication Engineering, Beijing University of Posts and Telecommunications, Beijing 100876, China. (e-mail: taowang@bupt.edu.cn; ccyin@bupt.edu.cn).\n\n    March 30, 2023\n=================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\n\n\n\n\n\n\n\n\nempty\nempty\n\n\n\n\nThis paper investigates the codebook based near-field beam training of Intelligent Reflecting Surface (IRS). In the considered model, near-field beam training should be performed to focus the signals at the location of user equipment (UE) to obtain the prominent IRS array gain. However, existing codebook schemes can not realize low training overhead and high receiving power, simultaneously.\nTo tackle this issue, a novel two-layer codebook is proposed. Specifically, the layer-1 codebook is designed based on the omnidirectivity of random-phase beam pattern, which estimates the UE distance with training overhead equivalent to that of a DFT codeword. Then, based on the estimated distance of UE, the layer-2 codebook is generated to scan the candidate locations of UE, and finally obtain the optimal codeword for IRS beamforming. Numerical results show that, compared with the benchmarks, the proposed codebook scheme makes more accurate estimation of UE distances and angles, achieving higher date rate, yet with a smaller training overhead.\n\n\n\n\n\nIntelligent Reflecting Surface, near-field beam training, codebook design.\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n[lines=2]INTELLIGENT Reflecting Surface (IRS) is expected to be one of the key technologies of the next-generation wireless networks, with the great potential of modifying the wireless channel in a cost-effective and energy-efficient way<cit.>. Owing to its nature in terms of signal reflection, IRS requires a large-scale implementation to capture enough amount of energy and achieve a significant beamforming gain<cit.>. For this reason, it has been proposed to deploy extremely large-scale IRS to enhance the wireless communications <cit.>. However, the application of large-scale IRS results in a large Rayleigh distance R_ tra[R_ tra = 2D^2/λ, where D, λ represent the size of IRS, and the carrier wavelength, respectively.], which makes the user equipment (UE) locate in the near-field region of IRS. \nThis trend has been elaborated in our previous work <cit.>, which reveals that the near-field situations will be common in IRS assisted wireless systems.\n\nThe beam training design in near-field situations has new challenges, including the deterioration of the training accuracy and the drastic increase of the training overhead, which have been addressed in the literature<cit.>. Specifically, the near-field channel is studied in <cit.> where a polar-domain (angle plus distance) channel model is proposed, showing that near-field beamforming should focus the transmitted signals at the location of UE. By contrast, traditional far-field beamforming, e.g., DFT codebook based beamforming, only tries to match the angle of UE, thus causing significant decrease of the training accuracy in the near-field situations of IRS. \nTo address this issue, our previous work in <cit.> intuitively adds a distance-domain beam training after the DFT codebook based beam training, which outperforms the DFT codebook scheme. Besides, a polar-domain codebook dedicated to the near-field channel is proposed in <cit.>, wherein the polar-domain channel space is properly sampled based on compressed sensing theory, and the exhaustive beam search strategy in adopted. To further reduce the prohibitively beam training overhead of <cit.>, a two-phase beam training method is proposed in <cit.>, wherein the candidate angles of UE are obtained from the DFT-codebook based beam searching in the first phase, then a shortlisted polar-domain codewords of <cit.> is adopted to estimated the UE distance in the second phase.\n\nHowever, we find that the near-field beam patterns under far-field beamforming get broadened in the very near-field region, which is named the beam broadening effect in this paper. In this case, the accuracy of DFT-codebook based angle estimation can not be guaranteed, causing performance deterioration of the current near-field IRS codebook schemes <cit.>.\n\nMotivated by above, we propose a novel two-layer codebook to realize both low training overhead and high IRS array gain. The key contributions are summarized as follows.\n\n\n\n  * Based on the considered model of IRS-assisted near-field wireless system, the problem caused by using far-field beamforming in the near-field region is elaborated.\n\n\n  * To realize both low training overhead and high IRS array gain, a novel two-layer codebook scheme is proposed. Specifically, the layer-1 codebook is composed of several independent random-phase vectors, which are performed to generate an omnidirectional IRS beam for the estimation of UE distance. Then, the layer-2 codebook is generated based on the estimated distance of UE in the first layer, which searches the candidate locations of UE and finally obtains the optimal\ncodeword for IRS beamforming.\n\n\n  * Numerical results show that, compared to the benchmarks, the proposed codebook makes more accurate estimations of the distances and angles of UE, achieving higher data rate, yet with a smaller training overhead.\n\n\n\nThe rest of this paper is organized as follows. The system model is illustrated in Section II. \nIn Section III, based on the observation of the the near-field beam patterns, a novel two-layer IRS codebook is proposed and analyzed theoretically. Extensive numerical results are given in Section IV. Finally, conclusions are drawn in Section V.\n\n\n\t\n\n\n\n\n§ SYSTEM MODEL AND RELATED CONCEPTS\n\nAs shown in Fig. <ref>, we consider the downlink beam training of an IRS-assisted narrow-band wireless system, where an M-antenna base station (BS) serves a single-antenna UE with the aid of an N-element uniform linear array (ULA) IRS[The ULA IRS is adopted for ease of analysis. However, by using random-phase vectors for the layer-1 codebook and considering the spatial angles of two-dimensional DFT codebook for layer-2 codebook, see Section III, the proposed scheme can be readily extended to UPA IRS.] of λ/2 spacing. The UE is located in the near-field region of the IRS. Due to the occlusion, it is assumed that only the BS-IRS-UE link is viable. \n\nWithout loss of generality, the IRS is placed on the x-axis with its center on the origin. The coordinate of the n-th IRS element is given by ((n-N+1/2)λ/2, 0), where N is assumed even.\nThe coordinate of UE is given by (dsinθ, dcosθ), where θ and d denote the angle and distance of UE with reference to the origin. The distance between the n-th IRS element and UE, denoted by d_n, is derived as\n\n    d_n(θ, d) = √((dsinθ-(n-N+1/2)λ/2)^2+(dcosθ)^2).\n\n\n\n\n §.§ Signal Model\n\nThe incident signals at IRS are denoted by f = [ a_1e^jω_1, a_2e^jω_2, ⋯, a_Ne^jω_N]^Ts, where a_n, ω_n denote the amplitude and phase of the incident signal at the n-th IRS element. s denotes the unit modulus transmitted signal. Considering the fixed and known deployment of BS and IRS, the BS-IRS channel, e.g., the geometry based channel model, is assumed fixed and known. So given the precoding vector of BS, e.g., the angle-domain precoding, f is known[For other BS-IRS channel settings, the design of the BS precoding during IRS beam training is an interesting topic, but left for our future work.].\nNow, the received signal of UE can be represented as\n\n    y    = hΦf+z,\n\nwhere z ∼𝒞𝒩(0, σ^2) denotes the received noise. Φ=diag( e^jφ_1, ⋯, e^jφ_N) denotes the adjustable phase shifts introduced by the IRS. h∈ℂ^1× N denotes the near-field IRS-UE channel, which is modeled as <cit.>\n  \n    [h]_n  = √(G^ U A^ U G^ I/4π d_n^2)e^j2π d_n/λ,\n\n where G^ U, A^ U, G^ I denote the receiving gain of UE antenna, the effective aperture of UE antenna, and the reflecting gain of IRS elements, respectively.\n Substituting (<ref>) into (<ref>), \n\n\n\n\n\n\n\nthe received signal power is represented as\n \n    P_ r =    |∑_n=1^N√(G^ U A^ U G^ I/4π d_n^2)a_ne^j(φ_n+ω_n+2π d_n/λ)|^2.\n\nThe achievable rate is given by \n \n    R =   log_2(1+P_r/σ^2).\n\n\n\n\n §.§ Near-Field and Far-Field IRS Beamforming\n\nThe near-field IRS beamforming should be performed as <cit.>\n\n    φ^near_n(θ,d) = -(ω_n + 2π d_n/λ),  n = 1, ⋯, N,\n\nso that the in-phase superposition of signals from all IRS elements is achieved at the location of UE. Since ω_n is known, the optimal Φ is only determined by d_n. Therefore, according to (<ref>), the location of UE should be obtained to perform the optimal near-field IRS beamforming.\nBy contrast, the far-field IRS beamforming is performed as\n\n    φ^far_n(θ) = -ω_n-π(n-1)sinθ,  n = 1, ⋯, N.\n\n\nComparing (<ref>) and (<ref>), it is observed that the far-field beamforming induces phase errors, which inevitably leads to the decrease of the IRS array gain.\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ PROPOSED TWO-LAYER NEAR-FIELD IRS CODEBOOK\n\nIn this section, based on the observation of the near-field beam patterns, we propose a novel two-layer IRS codebook. \n\ndefinitionDefinition\n\n\nThe near-field beam pattern is defined as the normalized signal power measured on the circle around the IRS center, where the radius of the circle equals the UE distance d.\n\n \nSimilar to the derivation of (<ref>), the normalized near-field beam pattern is represented as\n\n    P_ pat(φ_n,θ^')    = |∑_n=1^N√(G^ U A^ U G^ I/4π d_n^'2)a_n e^j(φ_n+ω_n+2π d_n^'/λ)|^2/|∑_n=1^N√(G^ U A^ U G^ I/4π d_n^'2)a_n|^2\n       = |∑_n=1^N1/d_n^'\n    e^j(φ_n+ω_n+2π d_n^'/λ)|^2/|∑_n=1^N1/d_n^'|^2,\n\nwhere a_n are assumed the same without loss of generality. θ^' denotes the angle of the measurement point, d^'_n(θ^', d) denotes the distance between the n-th IRS element and the measurement point.\nThe near-field beam patterns under near-field and far-field beamforming can be obtained by substituting the φ_n in (<ref>) with φ^near_n(θ,d) and φ^far_n(θ), respectively, which are shown in Fig. <ref> with θ = 0^∘,  20^∘,  40^∘,  60^∘ and d = 6 m, under the system setup with D = 1.28m, N = 256, and λ = 0.01m. \n \n\nObservation 1 (beam broadening effect). In Fig. <ref>, the near-field beam patterns under far-field beamforming get broadened and lose the single peak characteristic, which is called the beam broadening effect in this paper. In this case, the accuracy of the angle estimation under far-field beam sweeping<cit.> can not be guaranteed, resulting in performance degradation, as shown in the numerical results of this paper. \nBy contrast, the near-field beam patterns under near-field beamforming maintain the single peak characteristic, which means that if the UE distance d is provided, the UE angle θ can be accurately estimated through the near-field beam sweeping.\nInspired by this observation, a novel codebook based two-layer beam training scheme is proposed to estimate d and θ, successively.\n\nTo estimate d, we make the following approximation of equation (<ref>),\n\n    [h]_n≈√(G^ U A^ U G^ I/4π d^2)_be^j2π d_n/λ,\n\n where d_n, n = 1, ⋯, N are approximated as d to calculate the amplitude whose abbreviation is b.\n To determine when this approximation holds, we compute the distance differential from the IRS elements to UE between the center and the edge of the IRS. For the sake of argument, suppose θ = 0, however the analysis can be generalized to arbitrary UE angles. With the equal-distance approximation in (<ref>), the signal from each IRS element travels the same distance, d, to UE. But actually at the edge of the IRS it has traveled the distance √(d^2 + D^2/4). The error ratio of the approximation is d-√(d^2 + D^2/4)/√(d^2 + D^2/4).\n  \n\nThe trend of the error ratio is shown in Fig. 3. It can be seen that the error caused by the equal-distance approximation are relatively small. With e.g., D = 1.5 m, d = 5 m, this is about 1.14% and should have a minor impact. \nWith (<ref>), the equation (<ref>) can be approximated as\n \n    P_ r≈ b^2 |∑_n=1^Na_ne^j(φ_n+ω_n+2π d_n/λ)|^2.\n\n\n\n\n §.§ Layer-1 Codebook\n\nThe proposed layer-1 codebook consists of C random-phase IRS beamforming vectors, denoted as\n\n    [ e^jμ_c,1, e^jμ_c,2, ⋯,e^jμ_c,N],  c = 1,⋯,C,\n\nwhere μ_c,ni.i.d∼U(0,2π), ∀ n∈{1, 2, ⋯, N}, c ∈{1, 2, ⋯, C}.\nThose C beamforming vectors are designed to perform within the tine period of one traditional codeword, e.g., a DFT\ncodeword, to generate a cumulative omnidirectional beam. According to (<ref>), the average received signal power is \n\n\n\n    P_ r   = 1/C∑_c=1^Cb^2|∑_n=1^Na_ne^j(μ_c,n+ω_n+2π d_n/λ^ζ_c,n)|^2_Q_c,\n\nwhere Q_c denotes the received signal power under the c-th codeword. ζ_c,n denotes the phase of the received signal from the n-th IRS element under the c-th codeword.\n\nlemmaLemma[]\n\n\nFor any UE location (θ, d), when C→+∞,\n\n    P_ r∼𝒩(b^2∑_n=1^Na_n^2, ∑_1≤ i < j≤ N 2a_i^2a_j^2b^4/C),\n \nand the unbiased estimation of d is\n\n    d̂   = √(G^ U A^ UG^ I∑_n=1^Na_n^2/4πP_ r).\n\n\n\n\nFor a specific (θ, d), d_n and ω_n are fixed because of the fixed deployment of BS and IRS. According to (<ref>),\n\n    Q_c/b^2   = |∑_n=1^N a_ne^jζ_c,n|^2\n       = |∑_n=1^Na_n(cosζ_c,n +isinζ_c,n)|^2\n       = (∑_n=1^Na_ncosζ_c,n)^2 +(∑_n=1^Na_nsinζ_c,n)^2\n       = ∑_n=1^Na_n^2+\n    2(∑_1≤ i < j≤ N a_ia_jcos(ζ_c,i-ζ_c,j)_N(N-1)/2 items).\n\nSince μ_c,ni.i.d∼U(0,2π), we have ζ_c,ni.i.d∼U(0,2π), and ζ_c,i-ζ_c,ji.i.d∼U(0,2π), i≠ j. Therefore, cos(ζ_c,i-ζ_c,j), ∀ 1≤ i < j≤ N, c ∈{1, 2, ⋯, C} are independent and identically distributed, with mean 0 and variance 0.5. So the mean and variance of Q_c are b^2∑_n=1^Na_n^2 and b^4∑_1≤ i < j≤ N 2a_i^2a_j^2, respectively. \nTherefore when C→+∞, (<ref>) can be obtained based on the central limit law, thus proving the beam omnidirectivity of the proposed layer-1 codebook. The unbiased estimation of l can be derived as (<ref>) by substituting (<ref>) into (<ref>).\n\n\nSimilar to (<ref>), the near-field beam patterns generated by the layer-1 codebook is represented as\n\n    P_ pat(μ_c,n,θ^')    = \n    1/C∑_c=1^C|∑_n=1^N1/d_n^'\n    e^j(μ_c,n+ω_n+2π d_n^'/λ)|^2/|∑_n=1^N1/d_n^'|^2,\n\nwhich is shown in Fig. <ref> with C = 100, 500, 2000, respectively. The setup is the same as that in Fig. <ref> with D = 1.28m, N = 256, and λ = 0.01m. The theoretical random-phase beam pattern for C→+∞ is also shown. Fig. <ref> shows that as C increases, the mean value of the beam patterns remains the same, while the fluctuation of the beam patterns diminishes, which is in accordance with the conclusion in equation (<ref>).\n\n \n\nremarkRemark\n\n\nIn practice, The C beamforming vectors in layer-1 codebook can be pre-stored in the IRS controller, e.g., Field Programmable Gate Array (FPGA) controller, and performed within the time period of one traditional codeword, e.g., a DFT codeword, by means of phase switching at nanosecond level <cit.>. So the training overhead of layer-1 codebook is equivalent to that of only one DFT beam scan. Then, UE measures the average received power during this period for the distance estimation of (<ref>). Equation\n(<ref>) shows the variance of P_ r is inversely proportional to C, therefore, C can be increased to enhance the omnidirectivity of the random-phase IRS beam and improve the accuracy of d̂.\n\n\n\n\n\n\n\n\n\n §.§ Layer-2 Codebook\n\nThe layer-2 codebook is designed to search for the UE angle based on the estimated UE distance, d̂, in the first layer. According to the compressed sensing based analysis in <cit.>, the spatial angles corresponding to the DFT codebook are adopted as the candidate UE angles, which are represented as\n\n    θ_m = arcsin2m-N-1/N, m = 1, 2, …, N.\n \nThe candidate UE locations are denoted as (θ_m, d̂), m = 1, 2, …, N. The layer-2 codebook composed of N codewords is generated by substituting (θ_m, d̂) into (<ref>), and (<ref>) into (<ref>), which are finally represented as\n\n    [ e^-j(ω_1 + 2π d_1(θ_m,d̂)/λ), ⋯,e^-j(ω_N + 2π d_n(θ_m,d̂)/λ)],m = 1, …, N.\n \nThe N layer-2 codewords should be performed one by one to generate N beams with focus on the N candidate UE locations, respectively. Then, UE measures the received power of each beam and reports the beam index corresponding to the maximal received power, which indicates the estimated UE location and the optimal IRS codeword. The procedure of the proposed two-layer beam training scheme are summarized in Algorithm <ref>.\n\n\n\n\n\n\n\n\n\n\nSince only 1 omnidirectional IRS beam is generated by layer-1 codebook, and N beams are generated by layer-2 codebook, the overall training overhead of the proposed codebook is given by T^(pro) = 1+N, which is only 1 more than that of the DFT codebook, T^(DFT) = N.\nBesides, it is obvious that T^(pro) is much smaller than the training overhead of the exhaustive-search based polar-domain codebook<cit.>, T^(ex) = NS, and that of the two-phase codebook<cit.>, T^(2P) = N+KS, where S and K denote the number of the candidate UE distances, and the number of the shortlisted candidate UE angles, respectively. To further reduce the overhead of the proposed layer-2 codebook, multi-beam and hierarchical strategy <cit.> can be adopted, which is left for our future work.\n\n\n\n\n\n\n§ NUMERICAL RESULTS\n\n\n\n\nWe conduct a Monte-Carlo simulation, where the channel model in Section II-A is adopted, whose parameters are shown in Table <ref>. The reference SNR of the IRS assisted system is defined as SNR = N a^2 A^ U/4π d^2 σ^2, where a_n^2, n = 1, 2, …, N are assumed the same and denoted as a, and the noise power is set as -94 dBm (corresponding to the bandwidth of 100 MHz). The achievable rate is given by equation (<ref>). Besides, the number of the independent channel realizations for each result point is set as 1000. Four benchmark schemes are adopted: 1) perfect-CSI based beamforming, which gives the upper bound of rate performance; 2) exhaustive search based polar-domain codebook with S = 8 <cit.>; 3) two-phase codebook with K = 3, S = 8 <cit.>; 4) DFT codebook. \n\nFigs. 5-7 show the effects of SNR on the distance estimation error, the angle estimation error, and the achievable rate, where d = 4 m and θ randomly distributed in [-60^∘, 60^∘) are adopted. Several observations are made as follows. First, compared with the polar-domain codebook in <cit.> and the two-phase codebook in <cit.>, the proposed codebook brings the least estimation errors of the UE distance and angle, thus achieving better performance in terms of the achievable rate. Second, the training overhead of the proposed codebook is obviously smaller than that of <cit.> and <cit.>, (i.e., 201 versus 1600 and 224). Moreover, it is observed that the proposed codebook significant outperforms the DFT codebook under different SNRs, yet with similar training overhead, (i.e., 201 versus 200). Besides, the distance estimation error decreases as C increases, which is in accordance with the conclusion in equation (<ref>).\nIn addition, it can be seen that the distance estimation error of the proposed codebook rises in the very low SNR regime, causing certain performance degradation. This problem can be readily solved by increasing the transmitted signal power or the training overhead of the proposed layer-1 codebook, (e.g., increasing the training overhead from 1 to 10 brings 10 dB increase of the average received signal power).\n\n\n\n\n\n\n\n\n\nWe finally show the effects of UE distance d on the distance estimation error, the angle estimation error, and the achievable rate in Figs. 8-10, where a = 0.05 mW and θ randomly distributed in [-60^∘, 60^∘) are adopted. \nFirst in the short range (i.e., 1-10 m), it is observed that the proposed codebook makes accurate estimation of UE distance and angle, while the polar-domain codebook and the two-phase codebook schemes bring significant estimation errors, which is due to the beam broadening effect in the near-field region, thus causing obvious decrease in terms the achievable rate in this range. \nSecond in the long range (i.e., 10-60 m), on one hand, the distance estimation error of the proposed codebook increases with the UE distance, which is due to the decrease of SNR. On the other hand, the distance estimation error of the polar-domain codebook and the two-phase codebook increase quiet sharply, which is because that the number of distance samples is limited and with the non-uniform distance sampling method, the distance estimation is always +∞ in the long-distance range. \nMoreover, the performance of the proposed codebook outperforms those of the benchmarks and is very close to the perfect CSI beamforming under different UE distances, which is due to the limited angle-domain sample step and the existence of noise.  \nLast, the achievable rates of all codebook schemes monotonically decrease with the user distance due to the more severe path-loss and all the schemes achieve the same rate performance when UE distance is sufficiently large to meet the far-field assumption.\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\nIn this paper, to achieve an IRS near-field beam training with both low overhead and high achievable rate across the near-field region, we propose a novel two-layer codebook scheme. The proposed codebook is inspired from the characteristics of the near-field beam patterns under near-field/far-field/random-phase beamforming, which can efficiently estimate the distance and angle of UE.\nThe effectiveness and overhead of the proposed codebook are analyzed to demonstrate its superiority over the benchmarks. Numerical results show that, compared with the benchmarks, the proposed codebook makes more accurate estimation of the UE distances and angles, realizing achievable rate close to the upper bound across the near-field region, yet with a smaller training overhead.\n\n\n\n\nIEEEbib\n\n"}