{"entry_id": "http://arxiv.org/abs/2303.06961v1", "published": "20230313100312", "title": "Observational constraints on non-minimally coupled curvature-matter models of gravity from the analysis of Pantheon data", "authors": ["Biswajit Jana", "Anirban Chatterjee", "Kumar Ravi", "Abhijit Bandyopadhyay"], "primary_category": "gr-qc", "categories": ["gr-qc"], "text": "\n\n\n\n\n\n1]Biswajit Janavijnanachaitanya2020@gmail.com \n2]Anirban Chatterjee Corresponding Author: anirbanc@iitk.ac.in\n1]Kumar Ravi cimplyravi@gmail.com\n1]Abhijit Bandyopadhyayabhijit.phy@gm.rkmvu.ac.in\n[1]Ramakrishna Mission Vivekananda Educational and Research Institute, \nBelur Math, Howrah 711202, India\n[2]Indian Institute of Technology Kanpur, Kanpur 208016, India\n\nObservational constraints on non-minimally coupled curvature-matter models of gravity from the analysis of Pantheon data\n    [\n    March 30, 2023\n========================================================================================================================\n\n\n\n  \n\nWe considered non-minimally coupled curvature-matter models of gravity in a FRW universe filled with perfect fluid and investigated its cosmological implications in the light of Pantheon compilation of 1048 Supernovae Ia data points along with 54 data points from Observed Hubble Data. The non-minimal curvature-matter coupling has been introduced by adding a term ∫[λ R^n ℒ_m] √(-g)d^4x to the usual action for Einstein gravity involving the Einstein Hilbert action and minimally coupled matter action.\nWe investigate the observational constraints on the non-minimal models by choosing two different kinds of parametrization of fluid-pressure profiles using a dimensionless parameter k. The interplay of the three parameters λ,n,k plays a pivotal role in testing the consistency of non-minimally coupled fluid-curvature scenarios with the observed data.  We found there exist large domains in the (λ,n,k)-parameter space for which models with non-minimal curvature-matter mixing stand as viable cosmological models reproducing the observed features of late-time cosmic evolution. We also commented on the possibility of `gravitationally induced particle creation' in the context of SNe Ia data. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nObservation of type Ia Supernovae (SNe Ia) events\nand their luminosity distance and redshift measurements by  Riess et.al. <cit.> and Perlmutter et.al.  \n<cit.> have independently confirmed\nthat present universe is in an accelerated state\nof expansion and a  transition from a \ndecelerated to the current accelerated phase happened during \nits late time phase of evolution.\nThe reason for this late-time cosmic acceleration is attributed to a hypothetical unclustered form of energy, called \n`Dark Energy' (DE), which has become \na general label for the late time cosmic acceleration.\nOn the other hand, observations of rotation curves of spiral galaxies <cit.>, \ngravitational lensing <cit.>,\nBullet Cluster <cit.>  and other colliding \nclusters provide evidence in favour of \nexistence of non-luminous matter called `Dark Matter' (DM) in the universe. Such matter \nindirectly manifest their existence only through gravitational interactions.\nExperiments like WMAP <cit.> and Planck <cit.> \nhave revealed that   dark energy (DE) and dark matter (DM) together \ncontribute ∼ 96% of total energy density of the present-day universe, \nwith  ∼69%  and ∼27% as their respective shares.  \nThe rest of the 4% contribution comes from radiation and baryonic matter.    \n\n \n  \nTo support  his theory of the static universe, Einstein\n initially considered a cosmological constant term Λ g_μν  in the geometric part of his field equations of general relativity, but later discarded it, in favour of Hubble's observation of expanding universe. However, with the discovery of late-time cosmic acceleration \nin the later part of last century,\nthe cosmological constant term again   came  under the spotlight \nbecause of its  potential to provide a straight-way solution to\nEinstein's field equation resulting in an accelerated expansion.   \nThe corresponding phenomenological model that fits the observed features  \nof cosmic acceleration is called\nΛ-CDM model, where CDM refers to cold dark matter content of the present universe.\nUnfortunately, the Λ-CDM model is plagued with the coincidence problem <cit.> and the fine-tuning problem <cit.>. These limitations\nmotivate investigation of other models to account for dark energy.\nOne class of such models\nare field theoretic models of dark energy involving\nmodification of energy-momentum tensor in the Einstein's field\nequations due to presence of a field as one content of the \nuniverse, other than matter and radiation. Such class of models\ninclude both quintessence   <cit.>,\nand k-essence   <cit.> models of scalar fields. Another class of models involve  modification of the\ngeometric part of Einstein's equations, i.e. the Einstein-Hilbert action\nin order to address issue of late time cosmic acceleration. Such models include \nf(R) gravity models, scalar-tensor theories, Gauss-Bonnet gravity, and braneworld models of dark energy <cit.>. In most of these scenarios, the  universe is considered to\nbe homogeneous and isotropic at large scales, with\nits metric described by the Friedmann-Robertson-Walker (FRW) metric\nspecified by a time-dependent scale factor a(t) and a curvature constant K.\nThere also exist approaches,\nwhere an inhomogeneous universe, described by a perturbed FRW metric,\nhas been considered as the spacetime background. \n\n\n\n \n\n\nIn this article, we examine a model of the universe \nwith its content as  \nan ideal hypothetical fluid, characterised by\nits energy-density (ρ) and pressure (p), \nwhich is non-minimally coupled\nto the spacetime curvature.\nThe non-minimal curvature-matter coupling has been introduced\nby adding a term  ∫ d^4x √(-g)λ R^n  L_m to the usual action for Einstein gravity involving the\nEinstein Hilbert action and minimally coupled matter action.\nR is the Ricci Scalar and L_m (referred to as\nmatter Lagrangian)   \nis the Lagrangian of the hypothetical fluid. \nThe coupling constant (λ) and the power (n) \nof R in the  non-minimal  coupling term, are\nconsidered as the parameters of the model.\nWe explored the constraints on these parameters  \nfrom the combined analysis of\n  Pantheon compilation of 1048 SNe Ia data points <cit.>, \n and 54 data\npoints  from Observed Hubble data <cit.>.\n\n\n\n\n\n\n\n \n\n\nIn the general framework of non-minimal models, the \ngeometric part of Einstein's equation is altered  \nby modifying the Einstein-Hilbert action to ∫ d^4x √(-g) f(R),\nreplacing R by a general function f(R) \n<cit.>. \nIn the context of  modified f(R) theories of\ngravity, it has been   shown in <cit.> that,\nthe covariant derivative of energy-momentum tensor is non-vanishing  \n(∇_μT^μν≠ 0),\nwhen a f(R)-L_m (curvature-matter) coupling is present \nin the theory which may cause a departure from geodesic motion  manifesting\nexistence of a  new force. Consequences of such models in \nstellar equilibrium  have been investigated in \n<cit.>. An equivalence between\na suitable scalar theory and  the generic model with\nnon-minimal coupling between curvature and matter \nhave been established in <cit.>.\nA  viability criterion to avoid instabilities in such models has\nbeen derived in  <cit.>. \nThe effect of curvature-matter couplings on the dynamics   of particles\nand fields have been analysed in <cit.>. \nIn <cit.>, \nit has   been argued that the choice\nL_m = p, (p being the pressure\nof the matter fluid) is a `natural' one  for the matter of Lagrangian density,\nas it reproduces the equations of hydrodynamics of perfect fluid\nand in the context of curvature-matter coupling such choices result in\nvanishing of the extra force. However,  \nthere may be some other choices resulting in vanishing the extra force (see  <cit.> for references).  In this work\nwe have used L_m = p \nand in the framework of our considerations \nthe field\nequations following from the total action involving\nS_ non-minimal establish connection\nbetween a(t), ρ(t), p(t) through their time derivatives and various other\nfunctions like the Hubble function H(t) and the Ricci scalar R(t).\nWe exploit these equations\nfor investigating\nconstraints on non-minimal models from the analysis of observed data.\n \n\n\nUsing a model-independent construction\nof Hubble's function H in terms of redshift z\nwithout invoking any specific cosmological models,\nwe obtained the dependence of  Hubble's \nparameter H on z from the analysis of\nthe SNe Ia data (Pantheon + OHD). We used the FRW scale factor a\nto be normalised to unity at \npresent epoch (z=0).  Using the relation 1/a = 1+z,\nthe temporal behaviour of cosmological quantities\nexpressed in terms of  z \n  may be equivalently expressed in terms of a or \n  another dimensionless time parameter \nchosen as τ≡ln a, which we used in our analysis.\nExploiting the profile of the Hubble's parameter for the redshift domain accessible in the SNe Ia observations, obtained from the analysis of cosmological data set, we obtain the time profile of FRW scale factor a and its higher-order derivatives ȧ and ä.  This also enables us to express temporal behaviour of the Ricci scalar R and its time derivatives which are involved in our analysis.\n\n\n\n \n\n\nTo investigate the observational constraints on models\nwith non-minimal  curvature-matter couplings (specified\nin terms of parameters λ and n in this paper),\nwe considered two different types of fluid pressure models\nwith temporal behaviour of pressure p modelled as p ∼ e^ak (exponential model) \nand p ∼ a^k (power law model) where k is a dimensionless parameter.\nConsequently  the three parameters (λ,n,k) \nappear in the evolution equations and control\nthe model-based computations of ρ and p.\nUsing the observational inputs from SNe Ia data, \nwe obtained  the regions in the model parameter space (λ,n,k),\nfor which the computed energy density (ρ)  of the fluid\nremains positive for all time during the late time phase of evolution.\nThis is an essential requirement for viability\nof cosmological models.  We have also seen that there\nexist a small range of parameter values around (λ = -0.1, n = 0.2, k = 1)\n for which the computed temporal profiles of ρ and p \n mimic the corresponding profiles obtained from the analysis\nof the data using Λ-CDM model in the context of usual minimal coupling scenario.\n\n \n \n \n \nThe non-vanishing covariant derivative of the energy-momentum tensor in the context\nof non-minimally coupled curvature-matter scenarios implies an exchange of energy\nbetween curvature and matter sectors.\nWe computed \nthe rate of the energy exchange for different benchmark values\nof the model parameters (λ,n,k)  \nand found a monotonous decrease in the absolute value of the \nenergy exchange rate as time approaches towards the present epoch.\nThis  implies that the \nrate of exchange of energy between the two sectors\nis more significant during relatively early phases of late-time cosmic\nevolution.\nThe cosmological implications of\ncurvature-matter coupling scenarios from the viewpoint of thermodynamics, have been investigated in\n<cit.>. There it has been shown that\ncurvature-matter coupling may be responsible for generation of a large amount of\ncomoving  entropy during late-time evolutionary\nphase of the universe leading  to a possible interpretation of\nthe exchange of energy between curvature and matter sector \nin terms of gravitationally induced particle creation in FRW universe.\nWe have shown from the analysis of SNe Ia data that, for some values of the\nmodel parameters (λ,n,k) possibility of such an interpretation is always allowed. \n\n\n\n   \n  \n  \n\n\nRest of the paper is arranged in the following manner.\nIn  Sec. <ref> we   discussed the framework of\nnon-minimally coupled f(R) model  in the context of a flat FRW universe \nand obtained the corresponding generic modified evolution\n equations of the universe in presence of non-minimal curvature-matter coupling. \nWe choose two different types of fluid-pressure models,\nand obtained the equations corresponding to each of the models.\n In Sec. <ref> we discussed the  methodology of analysis of Pantheon + OHD \n data sets for obtaining temporal \n behaviour of different relevant cosmological\nquantities during the late-time phase of cosmic evolution.\nIn Sec. <ref> we presented  the constraints on model parameters λ, \nk and n obtained\nby using the results extracted from the analysis of the observed data \nand discussed the results.\nWe summarize the conclusions of the paper in Sec. <ref>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n§ THEORETICAL FRAMEWORK OF CURVATURE-MATTER COUPLING SCENARIO\n\n\nIn the framework of  modified  theories of gravity with non-minimal\ncurvature-matter coupling, the action may be written in the form \n<cit.> \n\n\n    S    =   ∫[1  2f_1(R)+[1+λ\n    f_2(R)] L_m] √(-g) d^4x ,\n\n\nwhere, f_1(R) and f_2(R), in general,  are two arbitrary functions \nof the Ricci scalar R and L_m is the  Lagrangian\ndensity for matter. g is the determinant of the spacetime metric tensor g_μν\nand λ is a constant representing\nthe strength of the non-minimal coupling between curvature term f_2(R)\nand matter lagrangian L_m.\nFollowing the approach of metric formalism in the context of the modified\ntheories of gravity, the\nvariation of  the action with respect to \nthe field g_μν yields the modified field equations as \n\n\n    F_1R_μν-1 2f_1g_μν-∇_μ∇_ν\n    F_1+g_μν□ F_1    =    (1+λ f_2)T_μν -2λ F_2 L_m R_μν\n           + 2λ(∇_μ∇_ν-g_μν□) L_m F_2  ,\n\n\nwhere we put 8π G = 1 (G = Gravitational Constant), F_i = df_i/dR (i=1,2)  and \nT_μν is the matter energy-momentum tensor  given by \n\n\n    T_μν=-2 √(-g)δ(√(-g)\n    L_m)δ(g^μν) .\n\n\n\nIn this article, we  investigated the scenario of non-minimal coupling\nbetween curvature and matter with geometric part of field equation\ndriven by pure Einstein gravity i.e. with f_1(R)=R\nand considered the matter part to be non-minimally coupled (with coupling\nstrength λ) to curvature through the function f_2(R) = R^n \n(where, n is some constant).\nIn this model, the matter part of the universe is\ndescribed by a perfect fluid \ncharacterised by energy density ρ and pressure p.  \nFollowing the comprehensive discussion in  <cit.>,\nwe assume ℒ_m = p, which is a `natural choice' for\nLagrangian density for perfect fluids, which correctly\nreproduces the hydrodynamical equations for a perfect fluid.\nThis particular choice has interesting consequences in the \nanalysis of curvature-matter coupling scenarios implying\nvanishing of extra force owing\nto departure from motion along the geodesic which may arise due to \nnon-vanishing covariant derivative of T_μν in the context of\ncurvature-matter coupling <cit.>. There are, however, other\nchoices of ℒ_m investigated in <cit.>. \nTo summarise our considerations for the present analysis, we have chosen \n f_1(R) =R,  f_2(R) = R^n, F_2(R) = nR^n-1,   L_m = p. For such choices\nthe Eq.(<ref>) can be expressed as,\n\n\n    R_μν- 1 2Rg_μν   =    \n    (1+λ R^n)T_μν -2λ (nR^n-1) pR_μν\n     +2λ(∇_μ∇_ν-g_μν□)p(nR^n-1)\n\n\nThe energy density ρ and pressure p of the fluid are respectively obtained from `00' and `ii' components\nof the energy-momentum tensor T_μν. The `00' component of Eq. (<ref>) is \n\n\n    R_00 - 1 2Rg_00   =    \n    (1+λ R^n)T_00 -2λ p (nR^n-1)R_00 \n    - 6λ H (ṗnR^n-1 + pn(n-1)R^n-2Ṙ) .\n\n\nFor a FRW spacetime background the above equation takes a form which after some rearrangements may be written as \n\n\n    ρ   =   1/1+λ R^n[3H^2 +6nλ{(n-1)HR^n-2Ṙ -  (H^2 + Ḣ)R^n-1}p +6nλ HR^n-1ṗ]\n\n\nOn the other hand, the  `ii'-component of Eq. (<ref>) is\n\n\n    R_11- 1 2Rg_11   =    \n    (1+λ R^n)T_11 -2λ pnR^n-1R_11 + 2λ(∇_1\n    ∇_1 -g_11□)(pnR^n-1)  ,\n\n\nwhich in the FRW spacetime background takes the form\n\n\n    - (2Ḣ + 3H^2)    =   [(1+λ R^n -2λ nR^n-1 (Ḣ + 3H^2) +4n(n-1)λ H R^n-2Ṙ\n           +2λ{n(n-1)(n-2)R^n-3Ṙ^2 +n(n-1)R^n-2R̈}]p \n           +4nλ{ HR^n-1 + (n-1)R^n-2Ṙ}ṗ +2nλ R^n-1p̈\n\n\nIn the framework of curvature-matter coupling in FRW spacetime background \nEqs.   (<ref>) and (<ref>) are the master equations. \nNote that the Eqs.  (<ref>) and (<ref>) involve time derivatives of the pressure of\nthe fluid which is a consequence of the non-minimal curvature-matter coupling. \nSetting the non-minimal coupling constant λ = 0, in the master equations we retrieve the\nusual Friedmann equations which do not contain any derivative term of pressure. \n\n\n\n  \nTo investigate the observational constraints on such  \ncurvature-matter coupling models, we \nconsidered two types of fluid pressure models with \nspecific temporal profile of the fluid pressure.\nIn  FRW background, we choose to express the modelled temporal profiles\nof the fluid pressure in terms of the FRW scale factor. \nWe discuss below the two models, referred  to as exponential  and  power-law models as per the nature of \ndependences of the pressure on the scale factor in the corresponding models. \n\n\n\n\n\n\n\n\n\nExponential model : In this model we take the fluid pressure p as p=p_0exp(ak), where k is a dimensionless\nparameter and  p_0 is a constant having the dimension of pressure. p_0e^k gives the pressure of \nthe fluid at present epoch a=1, in this model. We then have ṗ = kpȧ and p̈ = k^2pȧ^2 + kpä. \nUsing ṗ = kpȧ   in Eq. (<ref>) \n we may express the energy density for a given value of λ,n,k and pressure p\ncorresponding to this model as\n\n\n    ρ(t;λ,n,k)    =   1/1+λ R^n[3H^2 +6nλ{(n-1)HR^n-2Ṙ -  (H^2 + Ḣ)R^n-1 +kHR^n-1ȧ}p ]\n\n\nNote that the above equation also implies dependence of the ρ(t;λ,n,k)\non the parameter p_0 due to occurrence of the pressure term p=p_0exp(ak) in the\nright hand side of the Eq. (<ref>). But note that, we may use the\n  equation (<ref>) with  ṗ = kpȧ and p̈ = k^2pȧ^2 + kpä to express the pressure p = p_0exp(ak) as \n\n\n    p(t;λ,n,k)    =   - (2Ḣ + 3H^2) [(1+λ R^n -2λ nR^n-1 (Ḣ + 3H^2) +4n(n-1)λ H R^n-2Ṙ\n           +2λ{n(n-1)(n-2)R^n-3Ṙ^2 +n(n-1)R^n-2R̈}\n           +4nλ k { HR^n-1 + (n-1)R^n-2Ṙ}ȧ +2nλ k R^n-1(kȧ^2 + ä)]^-1\n \n\nWe may now use this expression (<ref>) for p in Eq. (<ref>)\nto get rid of its explicit p_0 dependence in it so that, ρ(t;n,k,λ) in Eq. (<ref>)\nis   computable at any t for  any given choice  of parameter set\n(n,k,λ).\n\n \n \n \n  \n\nPower-law model :\nIn this model we take   p=p_0 a^k, where k is again a dimensionless constant and \np_0 is a constant, which in this model gives the value of pressure at present epoch (a=1).\nHere we thus have ṗ=kpH and p̈=p(k^2H^2+kḢ).\nUsing  ṗ=kpH  in   \nEq. (<ref>) \nwe may similarly express the energy density for a given set of values of λ,n,k \nand pressure p as\n\n\n    ρ(t;λ,n,k)     =   1/1+λ R^n[3H^2 +6nλ{(n-1)HR^n-2Ṙ -  (H^2 + Ḣ)R^n-1 +kH^2R^n-1}p ]\n\n\nHere also, to get rid of the parameter p_0 which appears in the pressure term p=p_0a^k in \nthe right hand side, we exploit the\nequation (<ref>) with  ṗ = kpȧ and \np̈ = k^2pȧ^2 + kpä to express the instantaneous values of \npressure p = p_0a^k in terms of parameters  (n, k, λ)\nas \n\n\n    p(t;λ,n,k)    =    - (2Ḣ + 3H^2) [(1+λ R^n -2λ nR^n-1 (Ḣ + 3H^2) +4n(n-1)λ H R^n-2Ṙ\n           +2λ{n(n-1)(n-2)R^n-3Ṙ^2 +n(n-1)R^n-2R̈}\n           +4nλ{ HR^n-1 + (n-1)R^n-2Ṙ}kH +2nλ R^n-1(k^2H^2+kḢ)]^-1\n\n\nand use this expression for pressure p in Eq. (<ref>)\nto evaluate instantaneous value of energy density\nfor any given set of parameters (λ,n,k).\n\n \n \nApart from the model parameters (λ,n,k), the expressions\nfor ρ and p (in both exponential and power law models) involve\nother cosmological parameters - the FRW scale factor a, its time derivatives, the Hubble parameter H and its time \nderivatives, the Ricci scalar R (= 12H^2 + 6Ḣ) and its time derivatives.\nWe have obtained the temporal behaviour of all these cosmological quantities \nduring the late time phase of the cosmic evolution from a combined analysis of recently\nreleased Pantheon (SNe Ia) data. The accessible range of red-shift corresponding to Pantheon data set is 0 ≤ z ≤ 2.3 which\ncorresponds to a cosmic time domain 0.23 ≤ t ≤ 1, where t is normalised to\nunity at the present epoch. Using the time dependences of the said cosmological\nquantities as extracted from the observed data, we   obtained the\ntemporal behaviour of the energy density and pressure of the fluid\nfor both exponential and power law models using Eqs. (<ref>), (<ref>),  (<ref>) and  (<ref>). \nWe obtained range of values of \nparameters (λ,n,k) for which the evaluated values of energy density function ρ(t;λ,n,k),\nremains positive at all time. The reach of the recent SNe Ia data accommodates within itself the scenario of matter-curvature non-minimal coupling,\nfor the constrained values of the model parameters. \n\n\n\n\n\n\n\n\n\n\n§ OBTAINING CONSTRAINTS ON THE COSMOLOGICAL QUANTITIES FROM COMBINED ANALYSIS OF PANTHEON AND OBSERVED HUBBLE DATA\n\n \nThe cosmological data from Supernovae Ia observation provides\ninformation about late time cosmic evolution of the universe.\nIn this section we briefly outline the technical details of the analysis of the \nobservational\ndata which involves Pantheon  (SNe Ia) data involving 1048\ndata points and Observed Hubble Data (OHD) involving 54 data points  \n<cit.> and discussed\nhow we finally extracted the temporal behaviour of\nthe FRW scale factor a and its derivatives which are essential\ningredients for constraining the non-minimally coupled matter-curvature\nmodels as discussed in Sec. <ref>.\n\n\n\nThe SNe Ia data provides an estimation of luminosity distances (d_L)\nat the redshift values  (z) corresponding to different  SNe Ia events.\nThe `Pantheon Sample’ <cit.> \nis a compilation of the subset of 279 PS1 SNe Ia data points\n(over a redshift range 0.03 < z < 0.68) along with useful compilations of SNe Ia data\n from SDSS <cit.>, SNLS <cit.>, various low-z <cit.>, and HST samples  <cit.> \n  to form the largest combined sample of SNe Ia consisting of a total of 1048 SNe Ia  over the redshift range\n0.01 < z < 2.3. We have used the above mentioned data samples to construct\nthe Hubble function H(z)  without invoking any specific cosmological models.\nFor such a model-independent construction, we use   Padé approximant\nof order (2,1)  <cit.> for luminosity distance function,\nwhich is a closed-form parametrization of the  luminosity distance in terms\nof the redshift expressed as\n\n\n    d_L (z,α, β) = c/H_0( z(1+α z)/1+β z)\n\n\nwhere c is the speed of light and H_0 is the value of the Hubble parameter at the \npresent epoch which may be defined through a dimensionless quantity h\nby H_0 = 100 h km s^-1 Mpc^-1. \nα and β are the parameters to be determined from \ncosmological data.\nThe  Pantheon sample of 1048 data points provide\nthe redshift, apparent magnitude (m) at maximum brightness of the SNe Ia events, \nand also the covariance and correlations among the  different data points.\nThe observed data at any redshift z_i\n is expressed through the distance modulus μ_ obs(z_i)\n which is given in terms of the absolute magnitude M\n and observed apparent magnitudes m_ obs(z_i) by\n the relation\n\n\n    μ_ obs(z_i)    =    m_ obs(z_i) - M\n\n\nThe form of the  \ndistance modulus μ_ th(z,α,β) corresponding to the assumed parametric form of d_L(z,α,β) given\nEq. (<ref>) may be obtained by using the expression\n\n\n    μ_ th(z,α,β)\n       =   \n    5log_10[H_0 d_L(z,α,β)/c] + μ_0\n    = 5log_10[z(1+α z)/1+β z] + μ_0 ,\n\n\nwhere μ_0 = 42.38 - 5log_10h. Computing   μ_ th(z_i,α,β) - μ_ obs(z_i) for the data points i, we may find the\nχ^2-function for the SN-data set defined by the relation\n\n\n    χ^2_0 \n       =   ∑_i,j=1^N \n    [μ_ th(z_i,α,β) - μ_ obs(z_i)]\n    C^-1_ij[μ_ th(z_j,α,β) - μ_ obs(z_j)] ,\n\n\nwhere, N = 1048 is the total number of data points considered and C is the covariance matrix of the data as released in <cit.>, which includes both statistical and\nsystematic uncertainties. Using Eqs. (<ref>) and (<ref>), the quantities μ_ th  - μ_ obs appearing in Eq. (<ref>) may be expressed as\n\n\n    [μ_ th(z_i,α,β) - μ_ obs(z_i)]   =   \n    5log_10[z_i(1+α z_i)/1+β z_i] - m_ obs(z_i) + M^'\n\n\nwhere M^'≡μ_0 + M = 42.38 - 5log_10h + M. \nSince the Pantheon   data set comprises of apparent \nmagnitudes only so this data-set alone cannot constrain H_0.\nThe parameter H_0 (= 100 h km s^-1 Mpc^-1)  enters in    \nthe χ^2 function through the parameter M^'. \nMarginalising over the parameter M^', called the  nuisance parameter, we define \nan appropriate χ^2 function for this data set <cit.> as\n\n\n    χ^2_ SN   =    -2ln∫_-∞^∞exp[-1/2χ^2_0(α,β,M^')] dM^'\n\n\nwhich may be put in the following form\n\n\n    χ^2_ SN   =    P  - Q^2/R + ln (R/2π)\n\n\nwhere P = (m_ obs - m_ th)^TC^-1(m_ obs - m_ th),\nQ = (m_ obs - m_ th)^T C^-11 and \nR = 1^T C^-11.\nHere (m_ obs - m_ th)\nrepresents a column matrix of the residuals with i^ th entry as [m_ th(z_i,α,β) - m_ obs(z_i)] and \n(m_ obs - m_ th)^T denotes the corresponding transposed matrix.\nm_ obs(z_i) is the observed value of apparent magnitude at redshift z_i\nand corresponding theoretical value m_ th(z) is given by the formula\nm_ th(z) = 5log_10[z(1+α z)/1+β z] + 25.\nThe symbol 1 represents a column array of ones of same length as\nm_ obs.\n\n\n \nIn our analysis we have also used 31 redshift vs Hubble parameter\ndata points from chronometer \nobservations <cit.> and 23 data points from the line of sight \nBaryonic Acoustic Oscillations(BAO) data <cit.>. For a cosmological  model-independent construction of the Hubble parameter, we use the expression\n\n\n    H(z,α,β) = [1/cd/dz{d_L(z,α,β)/(1+z)}]^-1\n\n\nwhere d_L(z,α,β) is as given in Eq. (<ref>).\nThe residual for the Observed Hubble data involving total 54 data points\nfitting is given by\n\n\n    χ^2_ OHD   =   ∑_i=1^54[ H(z_i,α,β) - H_ obs(z_i)/σ_i]^2,\n\n\nwhere H_ obs(z_i), σ_i give the observed\nvalue of Hubble parameter and its corresponding uncertainty\nat redshift z_i\ncorresponding to the i^ th data point of OHD data set.\n\n\n \nTo get estimates of the parameters H_0, α, β along with their uncertainties, we perform  a\nMarkov chain Monte Carlo (MCMC) Bayesian parameter estimation\nusing a uniform prior to all the parameters.\nWe used the python packages, available in\nthe public domain, emcee <cit.> \nand   GetDist <cit.> for generating\n MCMC samples and for plotting posterior distributions of H_0, α, and β  respectively. After performing  \nvarious tests for the independence, convergence of the MCMC samples and thinning of the samples accordingly, we get following estimates from\nthe combined analysis of Pantheon data and OHD. In Fig. <ref>\nwe presented the posterior distribution plot of H_0, α, and β\nwhich depicts the corresponding  \n1σ, 2σ and 3σ uncertainties for these parameters.\n\n\n    α = 1.23^+0.06_-0.05,  β = 0.45^+0.03_-0.03 ,    and    H_0 = 68.31^+1.03_-1.03 .\n\n\n\n\n\nThe obtained best-fit values of the parameters α, β and H_0\nalong with their respective uncertainties are then exploited to compute the \nredshift dependences (temporal profiles) of the \nHubble parameter H and the normalised Ricci Scalar  R/H_0^2 making\nuse of Eqs. (<ref>) and R = 12H^2 + 6Ḣ.\nWe have shown the plots of H and R/H_0^2 vs z respectively in the left and right panels of  Fig. <ref>.\nThe solid lines in  Fig. <ref> correspond to the best-fit curve of each figure.\nThe 1σ and 3σ uncertainties in the obtained dependences are also shown by\ndashed lines. \n\n \n\n \n \n \n \n  \n\nThe profile  of the H(z) function, thus extracted from the analysis of the observational data,\nmay further be used to compute the temporal behaviour of the FRW scale factor a(t) \nand its time derivatives\nȧ and ä. The steps for this computation are briefly outlined below. \nThe FRW scale factor a is normalised to unity\nat the present epoch (z=0) and is \nrelated to redshift by the relation 1/a = 1+z. Since H = ȧ/a, \nthis corresponds to dt = -dz/(1+z)H(z) which on integration gives \n\n\n    t(z)/t_0   =    1 - 1/ t_0∫_z^0 dz'/(1+z')H(z')\n\n\nwhere t_0 denotes the present epoch which is also normalised to unity at \npresent epoch (t_0=1). Using the values of H(z) corresponding\nto the H(z) profile as depicted in left panel of Fig. <ref>,\nwe numerically compute the integral  in the right hand side of Eq. (<ref>). \nUsing the Eqs. (<ref>) and the equation  1/a = 1+z,\nwe may numerically compute simultaneous\nvalues of a and t at any given redshift z which amounts to\nobtaining values of a(t)-vs-t  eliminating z from  the two equations.\nThis leads to extraction of the temporal behaviour of the scale factor a(t) from the observational data\nfor the late time domain of the cosmic evolution accessible through Supernova Ia observations.\n \n\n\n\n\n\nTo perform this, we vary z  from zero (present\nepoch) to ∼ 2.4 (i.e. within the domain of z relevant for Pantheon data set)  \nin small steps (Δ z = 0.01). We numerically compute value of the  integral in Eq. (<ref>)\n and also the value of a(z) ≡\n1/(1+z)  at each z-step,  \nto obtain the sets of values (t(z), a(z)) at  each step.\nUsing the normalisation of scale factor a(t) as a=1\nat present epoch (z=0 or t=1) we found \nthat, the  range 0<z<2.3 corresponds \nto t-range: 1 > t(z) >0.23. Values of\n (t(z), a(z)) over the domain 0<z<2.3 provides\n temporal behaviour of scale factor over the time range 0.23<t<1. \n Using the obtained profile of a(t), we also obtain a profile\n of ȧ(t) and ä(t) using direct numerical differentiation techniques.\n We have shown the plots of the profiles a(t),  ȧ(t) and ä(t)\n respectively in the left, middle and right panels of Fig. <ref>.\nThe appearance of a minima at t∼ 0.53 in the time-profile of ȧ (middle panel)\nor  equivalently, the corresponding  change of sign of ä in the plots of right panel figure\nclearly signifies the\ntransition from decelerated to an accelerated phase of expansion\nduring the late time of cosmic evolution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ RESULTS AND DISCUSSION\n\n \nIn this section we present the results regarding the observational constraints on\nnon-minimally coupled curvature-matter models for two types of\nfluid pressure scenarios - the exponential and power law profiles as discussed in\nSec. <ref>. The energy density of the fluid\nin the context of the two scenarios are given by \nEq. (<ref>) and Eq. (<ref>)\nrespectively. The temporal behaviour of the energy \ndensity ρ(t; n,k,λ) \nhas been expressed \nas a function of cosmological quantities like a,ȧ,H,R \netc. and involving\nthe dimensionless parameters n, k, λ. Temporal profile of \nthe cosmological quantities during the late time phase of the cosmic \nevolution have been extracted from observational data and \npresented in Sec. <ref>.\nThe constant λ gives the strength of the non-minimal\ncoupling between matter and curvature sector. The parameter  k  is   \ninvolved in the\nmodelling of fluid pressure and n denotes the power \nof the gravity term (f_2(R) = R^n)\nthat is coupled to the matter lagrangian. The energy density of a fluid\nalways being a positive quantity, the constraints  \non parameters (n,k,λ) \nfor such models come from imposition of the constraint \nρ(t; n,k,λ) >0 for all t, where ρ at any t is evaluated \nwith the values of cosmological quantities (a,ȧ,H,R) \nat that t as obtained\nfrom the analysis of observational data. \n\n\n\n\nWe presented the observational constraints on the parameters (λ,n,k) \nby depicting the allowed area of the k-n parameter space for certain chosen\nvalues of the coupling parameter λ. We presented the\nresults for both the fluid pressure models (exponential and power law) for four\nbenchmark values: λ = -0.1, 0.1, 1, 10. We scanned a portion of \nthe k-n parameter space corresponding to the ranges: \n-20⩽ k ⩽ 20 and -10⩽ n ⩽ 10. The allowed\nregions in the parameter space,\n which correspond to ρ >0, are shown\nby shaded regions  in Fig. <ref>. The left and right panels of the figure \ncorrespond to the parameter space constraints obtained for\nexponential and power-law fluid-pressure models respectively.\nWe observe from Fig. <ref> that, for both classes of fluid pressure\nmodels, a wide region of the explored portion of the parameter space is\nallowed which in turn implies that the Supernova Ia data (Pantheon) and Observed Hubble data\nrobustly allows non-minimally coupled matter-curvature\nscenarios. However for negative values of λ,\n the positive values of the n (which is the power\nof R in the   matter-curvature coupling term) gets severely constrained.\n\n\n \n\n\nIn Eqs. (<ref>) and  (<ref>) \nwe have also expressed the temporal profile\nof the fluid pressure p(t, λ,n,k) \nfor exponential and power law models respectively. \nTo see the time evolution of energy density \nand pressure in the context of\nnon-minimally coupled matter-curvature scenarios \nwe have shown the plots  of the temporal profile\nof energy density and pressure for both fluid  models in Fig. <ref> for\ncertain benchmark values of the parameter set \n(λ,n,k) chosen from the allowed\ndomains corresponding to both fluid models.\n\n \n\n\nFor convenience, we use a dimensionless time parameter τ \ndefined as τ = ln a \nto show the time profile of the energy density and pressure in Fig. <ref>.\nThe late-time domain of cosmic evolution is accessible in \nSNe Ia observations of Pantheon\nsample corresponds to the range -1.18 ≤τ≤ 0 with τ = 0 corresponding\nto the present epoch (a=1). We also normalise \nthe energy density ρ(τ) and pressure\np(τ) by the energy density value at present epoch ρ_0 to get rid of dimensions\nand plotted ρ(τ)/ρ_0 and p(τ)/ρ_0  as a function of τ for\ndifferent choices of the parameters k,n,λ.\nIn the left (right) panel of Fig. <ref> we showed\nthese plots for  ρ(τ)/ρ_0 and p(τ)/ρ_0 and for the \nexponential (power law) model. All the curves are shown in \nFig. <ref> correspond to k=1.\nThe 4-curves in each of plots correspond to 4 different choices of the set\n(λ,n) viz. (0.1, 1), (1,1), (10,1), (-0.1,0.2), all of \nwhich are well within the observationally allowed region of parameter values for \neach of the models as depicted in Fig. <ref>. \nFor comparison, in these plots, we also showed the best-fit (solid curve) and 3σ uncertainties\n(shaded region) of\nthe energy density and pressure profiles that result \nfrom usual analysis of observational data corresponding \nto the Λ-CDM model.   \n\n\n\n\n\nWe see from Fig. <ref> that, for  exponential and power law-models\nthe energy density and pressure profiles corresponding\nto parameter values (λ = -0.1, n=0.2, k=1) \nremains mostly well within the 3σ region\nof the corresponding quantities as extracted from the observation.\nFor other 3 sets of parameter values (λ,n,k) considered here, viz.\n (0.1, 1,1), (1,1,1), (10,1,1), the energy density curves\n are outside the corresponding 3σ range obtained from observation.\nA close look\nat the plots of pressure profile for exponential and power law models\nin Fig. <ref> reveals that the fluid pressure profile\nfor exponential model also\nlies almost entirely within its 3σ observed limits, for \nthe full range of time (τ) accessible in SNe Ia observations,\nwhile for power law models,  \nthe corresponding curve is outside\nthe 3σ observed limits  for a small temporal regime during\na relatively earlier part of late-time cosmic evolution. \n Therefore, non-minimally\ncoupled matter-curvature scenarios with fluid pressure modelled as\np  ∼ e^ak \nmimics the outcome\nof the Λ-CDM model in terms of energy density and pressure profiles\n within their 3σ limits,\nfor the model parameters taking values in the close proximity\nof the values λ = -0.1, n = 0.2, k = 1. We may mention here,\nthat the Λ-CDM model which, though fits the data well, is plagued with\nthe coincidence and fine-tuning problems, whereas the models with \nnon-minimally\ncoupled matter-curvature scenarios are free from such problems.\n\n\n \n\n\n\n\n\n\n\n\n\nIn the light of the above results we also\ninvestigated the issue  of  energy transfer between curvature and fluid sectors\nowing to the considered non-minimal coupling between them.\nFor the non-minimally coupled curvature-fluid models considered in this article,\n the energy-balance equation takes the form  <cit.>,\n\n\n    ∇^μT_μν    =    λ F_2(R)/1 + λ f_2(R)(g_μνℒ_m - T_μν)∇^μ R\n\n\nFor an ideal fluid with energy density ρ and pressure p in FRW spacetime background\nand with ℒ_m = p as considered in the work,  \nthe ν=0 component of Eq. (<ref>) takes the form\n\n\n    ρ̇ + 3H(ρ + p)    =      - λ F_2(R)/1 + λ f_2(R)(  p + ρ)Ṙ ≡  Q\n\n\n Note that,\nin absence of any non-minimal coupling (λ = 0), the above \nenergy balance equation reduces to usual continuity equation ρ̇ + 3H(ρ + p) = 0\nof   FRW universe.\nThe term Q on right hand side of Eq. (<ref>) is a measure of\nrate of energy exchange between matter and curvature sectors.\nIn the context of Eq. (<ref>)  we may mention that,\nthermodynamical implications of curvature-matter coupling scenarios at cosmological scales have been investigated\nin <cit.>, where from the perspective of\nthermodynamics of open systems,\nthe  energy balance equation (<ref>) has been interpreted  \nto describe  particle creation in FRW universe. Such an interpretation\nrequires   referring  to the term -Q/3H as the creation pressure p_c\nassociated with the particle creation,  so as to cast \nthe energy balance equation in the form  ρ̇ + 3 H (ρ + p + p_c) = 0, with \ncreation pressure subject to the constraint that p_c ≡ -Q/3H <0, implying\nthe requirement that Q always remains positive. \n\n \n\n\n\n\nIn the context of non-minimally coupled curvature-fluid models considered here with\n  f_2(R) = R^n,\n  we may write down the expression for the time profile of the Q-function from Eq. (<ref>) \ncorresponding to the parameter set (λ,n,k) as \n\n    Q(t;n,k,λ)    =    -λ n R^n-1/1 + λ R^n[  p(t;λ,n,k) + ρ(t;λ,n,k)]Ṙ\n\n\nwhere the energy density   \nρ(t;λ,n,k) and fluid pressure \np(t;λ,n,k) profiles corresponding to both exponential and power law models\nare given by Eqs.  (<ref>) - (<ref>).\nWe use Eq. (<ref>) to compute the function Q(t;λ,n,k) for given\nchoices of λ,n,k.\nTime dependences\nof cosmological parameters viz. a, H, R etc., as extracted from observed data\nare  instrumental\nin the determination of  the  temporal profile of Q.\nIn Fig. <ref>\nwe have shown the time dependence of   Q for both exponential (left panel)\nand power law (right panel) models by plotting Q(τ)/ρ_0 vs τ for the\nsame 4 benchmark values of parameters (λ,n,k) as taken earlier.\n\n\n\n \n\nWe observe from Fig. <ref> that, \ncorresponding to the benchmark cases with n=1 (i.e. f_2(R)=R) and \nk=1 (which correspond to p ∼ e^a for exponential model \nand p ∼ a for power law model), \nQ(τ) remains always positive.\nSo, certain domains of   (λ,n,k) parameter space \nof non-minimally coupled matter-curvature models are allowed\nfrom the combined analysis of Pantheon data and OHD,\nfor which the possibility of \ninterpreting the energy balance equation in terms of particle creation <cit.> \nremains open.\nOn the other hand, the estimation of Q(τ) for parameter values\n(λ = -0.1,n=0.2,k=1), (which  mimics\nenergy density and pressure profiles obtained from the data analysis with Λ-CDM\nmodel  as explained earlier) gives negative values of Q for the entire time\nrange probed in SNe Ia observations. \nWe also observe from Fig. <ref> that,\nthe absolute value of the rate of\nenergy transfer between curvature and matter sector \nand hence the effect of the considered non-minimal coupling,\nmonotonically decreases as time approaches towards the present epoch. \n \n\n \n\n  \n \n \n \n \n\n\n\n§ CONCLUSION\n\n \nIn this work we considered \nnon-minimally coupled curvature-matter models\nof gravity and investigated its cosmological implications \nin the light of  luminosity distance and redshift measurements\nof Supernova Ia events.\nThe non-minimal curvature-matter coupling has been introduced\nby adding  \na term ∫[λ R^n ℒ_m] √(-g)d^4x to the\nusual action for Einstein's gravity involving the\nEinstein Hilbert action and minimally coupled matter action.\nThe parameters λ and   n   fix the strength and\nnature of the non-minimal coupling.\nTo explore consequences of such non-minimal couplings  \nin relation to evolutionary aspects of the universe at large scales,\nwe considered homogeneous and isotropic spacetime geometry\nof the expanding universe described by a\nflat FRW metric involving the time dependent scale factor a(t). \nThe matter content of\nthe universe is modelled as a perfect fluid \ncharacterised by energy density ρ(t)\nand pressure p(t) and chosen\n the form of matter Lagrangian as ℒ_m = p. Such a choice for  Lagrangian density correctly reproduces the hydrodynamical equations for the perfect fluid and also may cause to vanish the extra force owing to departure from motion along the geodesic arising from a non-vanishing covariant derivative of energy-momentum tensor in coupled scenarios. For such considerations, the field equations corresponding to the modified action containing non-minimal term take forms exhibiting connection between\nthe a(t),ρ(t),p(t) through \ntheir time derivatives and various other functions \nlike the Hubble function H(t), the Ricci scalar R(t).\nThe functions H(t) and R(t) are however  directly related\nto the scale factor a(t) and its derivatives.\nThe evolution equations also involve the parameters λ and n\nrelated to the curvature-matter coupling and the minimal coupling scenario\ncorresponds to λ = 0, for which the equations reduce\nto the   Friedman equations.  \nUnlike Friedman's equations, \ntheir corresponding analogues which govern \nthe evolutionary dynamics \nin presence of non-minimal curvature-matter coupling,\ninvolves time derivatives of fluid pressure p. \nWe investigate the observational constraints on \nthe non-minimal models choosing two different ansatzes for\np(t) referred to in the paper as the `exponential model'\nand `power law model', where the temporal profile of the\nfluid pressure has been\nparametrized in terms of a dimensionless parameter k\nas p ∼ e^ka and p ∼ a^k respectively. \nConsequently, in the context of this work,\nthe interplay of the three parameters\n(λ,n,k) plays a pivotal role in testing the consistency\nof non-minimally coupled fluid-curvature scenarios\nwith the observed data.\n\n \n \n \n\nFrom a comprehensive analysis of \n Pantheon compilation of 1048 SNe Ia data points, \nand 54 data points on measurement of Hubble parameter from OHD,\nwe obtained time dependences of the relevant cosmological\nparameters a(t),H(t),R(t) and  their time derivatives over\nthe late time phase of cosmic evolution.\nTaking into account all these information and using the evolution\nequations for non-minimally coupled scenarios,\nwe numerically computed the energy density ρ(t,λ,n,k) and pressure p(t,λ,n,k)\nprofiles for different values of (λ,n,k) thoroughly scanning\na portion of the parameter space: [-0.1 ⩽λ⩽ 10 ; -10 ⩽ n ⩽ 10;\n-20 ⩽ k ⩽ 10]. \nWe also obtained and presented in Fig. <ref>, \nthe regions in the parameter space corresponding to\nparameter values  giving ρ(t,λ,n,k) > 0 for all t which is a \ntrivial but essential\nrequirement for viability of cosmological models.\nWe found there exist  large domains in the\n(λ,n,k)-parameter space for which models with non-minimal \ncurvature-matter  mixing\nstand  as  viable cosmological models  reproducing \nthe observed features of late time  cosmic evolution.\nWe have also seen that there exist a small range of parameter values around\n(λ = -0.1,n=0.2,k=1) for which the computed temporal profiles of\nρ and p mimic the  corresponding profiles obtained from\nthe analysis of the data using Λ-CDM model \nin the context of usual minimal coupling scenario. \n\n\nThe energy-momentum tensor has a non-vanishing covariant derivative \n(∇^μ T_μν≠ 0) in the realm of non-minimally coupled curvature-matter\nscenarios and this implies \nexchange of energy between curvature and matter sectors. \nWe found that, the absolute\nvalue of the rate of energy transfer between the two sectors  \nmonotonically decreases as time approaches towards the\npresent epoch.\nThis  dynamics of energy exchange may be expressed \nby an equation portraying the energy balance between the two sectors\nin FRW background \nas ρ̇ + 3H(ρ + p + p_c) = 0, with the function p_c(t) (multiplied by 3H) \nproviding a measure of the  rate of energy transfer owing to the non-minimal\ncoupling between curvature and matter.\nFrom the perspective of thermodynamics of open systems, as extensively discussed  in \n <cit.>,\ncurvature-matter coupling allows   production of \na substantial amount of comoving\nentropy during late time evolutionary phase of the universe. This opens up\nthe possibility to interpret the energy-balance equation describing\nparticle creation in FRW universe, with  p_c realised as  \nthe (creation) pressure related to the particle creation. Such an interpretation\nhowever requires p_c to be negative. Our investigation shows,\nthere exist values of model parameters (λ,n,k), \nfor which the requirement p_c<0 (for all time) is met.\nThus the `particle creation' interpretation of energy balance equation\nin non-minimally coupled curvature-matter scenarios\nremains an open possibility in the context of SNe Ia data. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \nAcknowledgement A.C. would like to thank Indian Institute of Technology, Kanpur for supporting this work by means of Institute Post-Doctoral Fellowship (Ref.No.DF/PDF197/2020-IITK/970). \n \n\n101\n\n\t\t\nref:Riess98   \n A. G. Riess et al. [Supernova Search Team],\n  \n  Astron. J.  116, 1009 (1998)\n  doi:10.1086/300499\n  [astro-ph/9805201].\n\nref:Perlmutter \nS. Perlmutter et al. [Supernova Cosmology Project Collaboration],\n  \n  Astrophys. J.  517, 565 (1999)\n  doi:10.1086/307221\n  [astro-ph/9812133].\n\n\n\nSofue:2000jx \n  Y. Sofue and V. Rubin,\n  Ann. Rev. Astron. Astrophys.  39, 137 (2001).\n\nBartelmann:1999yn \n  M. Bartelmann and P. Schneider,\n  Phys. Rept.  340, 291 (2001).\n  \nClowe:2003tk \n D. Clowe, A. Gonzalez and M. Markevitch\n Astrophys. J.  604, 596 (2004).\n\n \nHinshaw:2008kr\nG. Hinshaw et al. [WMAP],\n\nAstrophys. J. Suppl. 180 (2009), 225-245\ndoi:10.1088/0067-0049/180/2/225\n[arXiv:0803.0732 [astro-ph]].\n\t\t\n\t\t\t\t\n\t\t\nAde:2013zuv\nP. A. R. Ade et al. [Planck],\n\nAstron. Astrophys. 571 (2014), A16\ndoi:10.1051/0004-6361/201321591\n[arXiv:1303.5076 [astro-ph.CO]].\n\n\n\n\nZlatev:1998tr\nI. Zlatev, L. M. Wang and P. J. Steinhardt,\n\nPhys. Rev. Lett. 82 (1999), 896-899\ndoi:10.1103/PhysRevLett.82.896\n[arXiv:astro-ph/9807002 [astro-ph]]\n\n\n\n\n\n\n\nMartin:2012bt\nJ. Martin,\n\nComptes Rendus Physique 13 (2012), 566-665\ndoi:10.1016/j.crhy.2012.04.008\n[arXiv:1205.3365 [astro-ph.CO]].\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\nPeccei:1987mm\nR. D. Peccei, J. Sola and C. Wetterich,\n\nPhys. Lett. B 195 (1987), 183-190\ndoi:10.1016/0370-2693(87)91191-9\n\t\t\nFord:1987de\nL. H. Ford,\n\nPhys. Rev. D 35 (1987), 2339\ndoi:10.1103/PhysRevD.35.2339\n\t\t\nPeebles:2002gy\nP. J. E. Peebles and B. Ratra,\n\nRev. Mod. Phys. 75 (2003), 559-606\ndoi:10.1103/RevModPhys.75.559\n[arXiv:astro-ph/0207347 [astro-ph]].\n\t\t\nNishioka:1992sg\nT. Nishioka and Y. Fujii,\n\nPhys. Rev. D 45 (1992), 2140-2143\ndoi:10.1103/PhysRevD.45.2140\n\t\t\nFerreira:1997au\nP. G. Ferreira and M. Joyce,\n\nPhys. Rev. Lett. 79 (1997), 4740-4743\ndoi:10.1103/PhysRevLett.79.4740\n[arXiv:astro-ph/9707286 [astro-ph]].\n\t\t\nFerreira:1997hj\nP. G. Ferreira and M. Joyce,\n\nPhys. Rev. D 58 (1998), 023503\ndoi:10.1103/PhysRevD.58.023503\n[arXiv:astro-ph/9711102 [astro-ph]]\n\t\t\nCaldwell:1997ii\nR. R. Caldwell, R. Dave and P. J. Steinhardt,\n\nPhys. Rev. Lett. 80 (1998), 1582-1585\ndoi:10.1103/PhysRevLett.80.1582\n[arXiv:astro-ph/9708069 [astro-ph]].\n\t\t\nCarroll:1998zi\nS. M. Carroll,\n\nPhys. Rev. Lett. 81 (1998), 3067-3070\ndoi:10.1103/PhysRevLett.81.3067\n[arXiv:astro-ph/9806099 [astro-ph]]\n\t\t\nCopeland:1997et\nE. J. Copeland, A. R. Liddle and D. Wands,\n\nPhys. Rev. D 57 (1998), 4686-4690\ndoi:10.1103/PhysRevD.57.4686\n[arXiv:gr-qc/9711068 [gr-qc]].\n\n\n\n\t\t\n\n\nFang:2014qga\nW. Fang, H. Tu, Y. Li, J. Huang and C. Shu,\n\nPhys. Rev. D 89 (2014) no.12, 123514\ndoi:10.1103/PhysRevD.89.123514\n[arXiv:1406.0128 [gr-qc]].\n\n\t\t\n\t\t\nArmendarizPicon:1999rj\nC. Armendariz-Picon, T. Damour and V. F. Mukhanov,\n\nPhys. Lett. B 458 (1999), 209-218\ndoi:10.1016/S0370-2693(99)00603-6\n[arXiv:hep-th/9904075 [hep-th]]\n\t\t\nArmendarizPicon:2000ah\nC. Armendariz-Picon, V. F. Mukhanov and P. J. Steinhardt,\n\nPhys. Rev. D 63 (2001), 103510\ndoi:10.1103/PhysRevD.63.103510\n[arXiv:astro-ph/0006373 [astro-ph]]\n\t\t\nArmendarizPicon:2000dh\nC. Armendariz-Picon, V. F. Mukhanov and P. J. Steinhardt,\n\nPhys. Rev. Lett. 85 (2000), 4438-4441\ndoi:10.1103/PhysRevLett.85.4438\n[arXiv:astro-ph/0004134 [astro-ph]]\n\t\t\nArmendarizPicon:2005nz\nC. Armendariz-Picon and E. A. Lim,\n\nJCAP 08 (2005), 007\ndoi:10.1088/1475-7516/2005/08/007\n[arXiv:astro-ph/0505207 [astro-ph]]\n\t\t\nChiba:1999ka\nT. Chiba, T. Okabe and M. Yamaguchi,\n\nPhys. Rev. D 62 (2000), 023511\ndoi:10.1103/PhysRevD.62.023511\n[arXiv:astro-ph/9912463 [astro-ph]]\n\t\t\nArkaniHamed:2003uy\nN. Arkani-Hamed, H. C. Cheng, M. A. Luty and S. Mukohyama,\n\nJHEP 05 (2004), 074\ndoi:10.1088/1126-6708/2004/05/074\n[arXiv:hep-th/0312099 [hep-th]]\n\t\t\nCaldwell:1999ew\nR. R. Caldwell,\n\nPhys. Lett. B 545 (2002), 23-29\ndoi:10.1016/S0370-2693(02)02589-3\n[arXiv:astro-ph/9908168 [astro-ph]]\n\n\n\nfr1 S.  Capozziello,  Int. J. Mod. Phys. D11, 483  (2002);\nS.  Capozziello, V.  F.  Cardone, S.  Carloni, and A.  Troisi, Int. J. Mod. Phys. D12, 1969 (2003);\n;\n S. Nojiri and S. D. Odintsov,\n  Phys. Rev. D 68, 123512 (2003);\n   S. Nojiri and S. D. Odintsov,\n  Phys. Rept.  505, 59 (2011);\n  S. Nojiri, S. D. Odintsov and V. K. Oikonomou,\n   Phys. Rept.  692, 1 (2017) \n\nPan-STARRS1:2017jku\nD. M. Scolnic et al. [Pan-STARRS1],\n\nAstrophys. J. 859 (2018) no.2, 101\ndoi:10.3847/1538-4357/aab9bb\n[arXiv:1710.00845 [astro-ph.CO]]\n\n\nBlake\nBlake C et al. 2012 Mon. Not. R. Astron. Soc. 425 405–14\n\nChuang\nChuang C-H and Wang Y 2013 Mon. Not. R. Astron. Soc. 435 255–62\n\nFont-Ribera\nFont-Ribera A et al. 2014 J. Cosmol. Astropart. Phys. JCAP05(2014)027\n\nDelubac\nDelubac T et al. 2015 Astron. Astrophys. 574 A59\n\nBautista\nBautista J E et al. 2017 Astron. Astrophys. 603 A12\n\n\n\n\n\n\n\n\n\n\n\n\nBertolami:2008ab\nO. Bertolami, F. S. N. Lobo and J. Paramos,\n\nPhys. Rev. D 78, 064036 (2008)\ndoi:10.1103/PhysRevD.78.064036\n[arXiv:0806.4434 [gr-qc]]\n\nSchutz:1970\nB. F. Schutz, Phys. Rev. D 2, 2762 (1970)\n\nBrown:1993\nJ. D. Brown, Class. Quantum Gravity 10, 1579 (1993)\n\n\n\n\n\n\n\n\n\nBertolami:2007\nO. Bertolami, C. G. Boehmer, T. Harko and F. S. N.\nLobo, Phys. Rev. D 75, 104016 (2007)\n\n\nBertolami:2007vu\nO. Bertolami and J. Paramos,\n\nPhys. Rev. D 77 (2008), 084018\ndoi:10.1103/PhysRevD.77.084018\n[arXiv:0709.3988 [astro-ph]]\n\n\nSotiriou:2008dh\nT. P. Sotiriou,\n\nPhys. Lett. B 664 (2008), 225-228\ndoi:10.1016/j.physletb.2008.05.050\n[arXiv:0805.1160 [gr-qc]]\n\n\n\n\nBertolami:2008im\nO. Bertolami and J. Paramos,\n\nClass. Quant. Grav. 25 (2008), 245017\ndoi:10.1088/0264-9381/25/24/245017\n[arXiv:0805.1241 [gr-qc]]\n\nFaraoni:2007sn\nV. Faraoni,\n\nPhys. Rev. D 76 (2007), 127501\ndoi:10.1103/PhysRevD.76.127501\n[arXiv:0710.1291 [gr-qc]]\n\nSotiriou:2008it\nT. P. Sotiriou and V. Faraoni,\n\nClass. Quant. Grav. 25 (2008), 205002\ndoi:10.1088/0264-9381/25/20/205002\n[arXiv:0805.1249 [gr-qc]]\n\n\nHawking:1973\nS. W. Hawking and G.F.R. Ellis, The Large Scale Struc-\nture of Spacetime, (Cambridge University Press, Cam-\nbridge 1973)\n\n\nHarko:2015pma\nT. Harko, F. S. N. Lobo, J. P. Mimoso and D. Pavón,\n\nEur. Phys. J. C 75 (2015), 386\ndoi:10.1140/epjc/s10052-015-3620-5\n[arXiv:1508.02511 [gr-qc]]\n\n\nHarko:2014pqa\nT. Harko,\n\nPhys. Rev. D 90 (2014) no.4, 044067\ndoi:10.1103/PhysRevD.90.044067\n[arXiv:1408.3465 [gr-qc]]\n\nMoraes:2016mlp\nP. H. R. S. Moraes, R. A. C. Correa and G. Ribeiro,\n\nEur. Phys. J. C 78 (2018) no.3, 192\ndoi:10.1140/epjc/s10052-018-5655-x\n[arXiv:1606.07045 [gr-qc]]\n\n\n\n\n\n\n\nFrieman:2007mr\nJ. A. Frieman, B. Bassett, A. Becker, C. Choi, D. Cinabro, D. F. DeJongh, D. L. Depoy, M. Doi, P. M. Garnavich and C. J. Hogan, et al.\n\nAstron. J. 135 (2008), 338-347\ndoi:10.1088/0004-6256/135/1/338\n[arXiv:0708.2749 [astro-ph]]\n\nSNLS:2005qlf\nP. Astier et al. [SNLS],\n\nAstron. Astrophys. 447 (2006), 31-48\ndoi:10.1051/0004-6361:20054185\n[arXiv:astro-ph/0510447 [astro-ph]]\n\ncFa\nM. Hicken et al.,\n\nApJ 700 (2009), 331\ndoi: 10.1088/0004-637X/700/1/331\n[arXiv:0901.4787]\n\nRiess:2006fw\nA. G. Riess, L. G. Strolger, S. Casertano, H. C. Ferguson, B. Mobasher, B. Gold, P. J. Challis, A. V. Filippenko, S. Jha and W. Li, et al.\n\nAstrophys. J. 659 (2007), 98-121\ndoi:10.1086/510378\n[arXiv:astro-ph/0611572 [astro-ph]]\n\n\n\n\n\n\nG.A. Baker\nG.A. Baker Jr. and P. Graves-Morris, Pade Approximants, Cambridge University Press (1996).\n\nAbhi2012\nA. Bandyopadhyay, D. Gangopadhyay, A. Moulik, Eur. Phys. J. C 72, 1943 (2012)\n\nWei\nWei J-J 2018 Model-independent curvature determination from gravitational-wave standard sirens\nand cosmic chronometers Astrophys. J. 868 29\n\n\nForeman\nForeman-Mackey D, Hogg D W, Lang D and Goodman J 2013 Publ. Astron. Soc. Pac. 125 306–12\n\n\n\n\nLewis\nLewis A 2019 GetDist: a Python package for analysing Monte Carlo samples (arXiv:1910.13970\n[astro-ph.IM])\n\n\n\n\n\n\n"}