{"entry_id": "http://arxiv.org/abs/2303.06960v1", "published": "20230313100129", "title": "Compressible turbulence in the interstellar medium: New insights from a high-resolution supersonic turbulence simulation", "authors": ["Renaud Ferrand", "Sébastien Galtier", "Fouad Sahraoui", "Christoph Federrath"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA", "astro-ph.SR", "physics.flu-dyn"], "text": "\n\n\n\n\n\n\n\n#1#1 \n#1#1\n#1#1 \n\n\nu\n\n\n    #1#2#1#2#10#10,4pt 0 -0\n             -0,2pt 0,3pt 0 \n        renaud.ferrand@lpp.polytechnique.fr^1 Laboratoire de Physique des Plasmas, CNRS, École polytechnique, Université Paris-Saclay, Sorbonne Université, Observatoire de Paris-Meudon, F-91128 Palaiseau Cedex, France^2 Institut Universitaire de France (IUF)^3 Research School of Astronomy and Astrophysics, Australian National University, Canberra, ACT 2611, Australia\n        \n        The role of supersonic turbulence in structuring the interstellar medium (ISM) remains an unsettled question. Here, this problem is investigated using a new\n        exact law of compressible isothermal hydrodynamic turbulence, which involves two-point correlations in physical space. The new law is shown to have a compact expression that contains a single flux term reminiscent of the incompressible case and a source term with a simple expression whose sign is given by the divergence of the velocity. \n        The law is then used to investigate the properties of such a turbulence at integral Mach number 4 produced by a massive numerical simulation \n        with a grid resolution of 10,048^3 points. \n        The flux (resp. source) term was found to have positive (resp. negative) contribution to the total energy cascade rate, which is interpreted as a direct cascade amplified by compression, while their sum is constant in the inertial range. Using a local (in space) analysis it is shown that the source is mainly driven by filamentary structures in which the flux is negligible. Taking positive defined correlations reveals the existence of different turbulent regimes separated by the sonic scale, which determines the scale over which the non-negligible source modifies the scaling of the flux. Our study provides new insight into the dynamics and structures of supersonic interstellar turbulence. \n        \n        Compressible turbulence in the interstellar medium: New insights from a high-resolution supersonic turbulence simulation\n            R. Ferrand1, S. Galtier1,2, F. Sahraoui1 and C. Federrath3\n            March 30, 2023\n        ========================================================================================================================\n        \n        \n        \n        \n        § INTRODUCTION\n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        Understanding turbulent space and astrophysical plasmas is an ongoing physical challenge that drove a lot of attention through the recent years. As these plasmas are present in a wide range of astrophysical media, from the Earth's magnetosphere to distant star-forming clouds, being able to properly describe them would allow us to make significant progress in understanding the physics controlling the shape and evolution of these media. Among these recent findings, it has been shown that the introduction of compressibility in magnetohydrodynamic (MHD) and Hall-MHD models of space plasmas leads to a higher estimate of the mean dissipation rate of total energy (used as a proxy for measuring plasma heating) <cit.> compared to the incompressible case <cit.>. \n        For the interstellar medium (ISM) where observations indicate that turbulence is supersonic <cit.>, numerical simulations performed in the framework of compressible (isothermal) HD <cit.> have shown the presence of filaments that resemble the structures observed in the ISM <cit.>. It was found that incompressible predictions can be restored in some cases if one considers the density-weighted fluid velocity ρ^1/3 instead of the simple velocity <cit.>, a behavior that can be understood dimensionally with an exact law <cit.>. \n        \n        What makes this kind of study difficult is that the mechanisms governing fluid turbulence are still not fully understood. \n        Due to its chaotic nature, the favored way of studying turbulence is to resort to a statistical approach allowing for the use of specific tools <cit.>, such as exact laws. \n        Kolmogorov was among the pioneers in this field with his so-called four-fifth law <cit.>, an exact relation for homogeneous incompressible isotropic hydrodynamic (HD) turbulence that paved the way to new advances in the study of nonlinear physics. \n        This statistical law allows one to express the mean rate of kinetic energy transfer per unit volume as a function of a two-point third-order longitudinal structure function in the limit of a high Reynolds number. \n        In the wake of Kolmogorov's work, several other exact laws were derived for HD <cit.>, quasi-geostrophic flows <cit.>, thin elastic plates <cit.> or plasmas <cit.>. \n        The influence of compressibility being important for the description of space and astrophysical plasmas, efforts have been made during the last years to derive exact laws for compressible turbulence in HD <cit.> and magnetohydrodynamics (MHD) <cit.>. \n        \n        In the quest of exact laws for compressible turbulence, the complexity may increase significantly <cit.>. \n        It is therefore relevant to ask whether it is possible to find a compact form of these laws that reveals the most salient feature of turbulence. \n        <cit.> recently showed that several different – yet equivalent – exact laws can be derived for Hall MHD, with some being more compact and easier to compute and interpret. Following the same method, it is the first main goal of this paper to demonstrate that such a compact form – called hereafter the generalized Kolmogorov law  – exists in isothermal compressible HD turbulence. In the second part, this new relation is used to study such a turbulence, at integral Mach number 4, using a massive numerical simulation with a grid resolution of 10,048^3 points <cit.>. We proceed to a global computation of the law on the whole system and to a local computation along filamentary structures. Our analysis reveals supersonic turbulence properties that can be used to better understand ISM turbulence and star formation <cit.>.\n        \n        Section <ref> contains the main steps of the derivation of the new exact law for compressible HD turbulence, along with a first theoretical interpretation. In section <ref> we apply this model to our numerical simulation and expose the results obtained. These results are discussed in section <ref> and we give an overall conclusion in section <ref> in the context of ISM turbulence and star formation.\n        \n        \n        \n        \n        § GENERALIZED KOLMOGOROV LAW\n        \n        \n        Our analysis is based on the compressible HD equations \n        \n            _t ρ + ∇· (ρ )    =    0   ,  \n            ∂_t (ρ )+ ∇· (ρ)    =    - ∇ P \n            +  d +  f  ,\n        \n        where ρ is the density, P the pressure, d≡μΔ + (μ / 3) ∇θ the dissipation, θ≡∇· the dilatation, μ the coefficient of viscosity, and f a stationary homogeneous external force assumed to act on \n        large scales. The system is closed with the isothermal equation of state P= c^2_s ρ with c_s the sound speed, assumed to be constant (In practice we only use the density in the numerical code and set c_s = 1.)\n        \n        The energy equation takes the form \n        \n            _t ⟨ E ⟩ = ⟨· d⟩ + ⟨· f⟩  ,\n        \n        with ⟨ ⟩ an ensemble average, E=ρ u^2 / 2 + ρ e the total energy, e=c_s^2 ln(ρ/ρ_0) the internal energy \n        (ρ_0 = ⟨ρ⟩ is the average density), ⟨· f⟩ = ε the mean rate of total energy injection \n        into the system, and ⟨· d⟩ = - μ⟨ (∇×)^2 ⟩ - 4  3μ⟨θ^2 ⟩. \n        \n        We define  the spatial increment connecting two points x and x' as x' =  x+ and, for any given field ξ, ξ(x) ≡ξ and ξ(x') ≡ξ'.\n        We follow the same idea as <cit.> and <cit.> and search for a dynamical equation of a structure function for the fluctuating energy:\n        ⟨ S⟩   = ⟨δ̅ρ (δ)^2 + δρδ e ⟩  ,\n        \n        where for any given field ξ, δξ≡ξ'-ξ and δ̅ξ≡ (ξ+ξ')/2. The use of this structure function represents the main difference between this approach and the one of <cit.>. Developing S leads to \n        \n            ⟨ S⟩   =    2⟨ E ⟩ - 2⟨δ̅ρ·' ⟩ - ⟨ρ'e + ρ e' ⟩\n                  + 1/2⟨ρ u'^2 + ρ' u^2 ⟩  .\n        \n        Therefore, finding the temporal evolution of S is akin to finding the temporal evolution of every term on the RHS of Eq. (<ref>).\n        \n        The rest of the derivation is similar to the one given in <cit.>. Most of the terms have been derived in <cit.>, therefore we only give the details for the calculation of the new term ⟨ρ u'^2 ⟩ (from which the symmetric contribution can be obtained immediately). \n        We obtain the following expressions:\n        ∂_t ⟨ρ·' ⟩   =   ∇_·⟨ - ρ (·') δ + P ' - ρ e' ⟩ + ⟨ρθ'  (·') ⟩ + ⟨' · d + ' · f + ρ/ρ'· ( d' +  f') ⟩ , \n        ∂_t ⟨ρ e' ⟩   =   ∇_·⟨ - ρ e' δ - P ' ⟩ + ⟨ρ e' θ' ⟩  , \n        ∂_t ⟨ρ u'^2 ⟩   =   ⟨ 2 ρ' ·∂_t ' + u'^2 ∂_t ρ⟩ \n        = ⟨ - ' ·∇' (ρ u'^2) - 2 ρρ'' ·∇' P' ⟩ \n        + ∇_·⟨ρ u'^2 ⟩ \n        + ⟨ 2 ρρ'' · d' + 2 ρρ'' · f'⟩\n           =   ∇_·⟨ -ρ u'^2 ' + ρ u'^2 ⟩ + ⟨ρ u'^2 θ' \n        -2ρρ'' ·∇' P' ⟩ \n        + ⟨ 2 ρρ'' · d' + 2 ρρ'' · f'⟩  , \n        where ∇_ is the derivative along the  direction. The combination of the different contributions gives after simplification,\n        _t ⟨ S⟩   =      2_t ⟨ E ⟩ - ∇_·⟨δ̅ρ (δ)^2 δ⟩ \n        + 1  2⟨ (ρθ' + ρ' θ) (δ )^2 ⟩\n               -F - D   , \n        with, by definition,\n        \n        F    ≡   ⟨· f' + ' · f + ρρ'· f' + ρ' ρ' · f. \n              . - ρ' ρ· f  - ρρ'' · f'⟩  , \n        \n        D    ≡   ⟨· d' + ' · d + ρρ'· d' + ρ' ρ' · d. \n              . - ρ' ρ· d - ρρ'' · d'⟩  . \n        \n        The stationarity assumption leads to the cancellation of the term on the LHS and the energy term on the RHS of Eq. (<ref>). \n        In this situation, all the energy injected by the forcing must necessarily be dissipated at the same rate ε, so that we have the relationship ε = ⟨· f⟩ = -⟨· d⟩. The content of the forcing and dissipative terms F and D can then be broken down into three parts: first, since the forcing is assumed to act on large scales only, its variations across the simulation domain should remain small. Thus, forcing cross-terms like · f' are expected to behave like · f=ε so we may write (see <cit.>)\n        ⟨· f' + ' · f + ρρ'· f' + ρ' ρ' · f⟩≃ 4 ε  .\n        \n        Second, the stationarity assumption states that mean forcing and dissipation should balance each-other with · f=-· d=ε, leading to \n        ⟨ρ' ρ· f + ρρ'' · f'  +\n        ρ' ρ· d + ρρ'' · d'⟩≃ 0   .\n        \n        Third, as the dissipation is assumed to act on small scales only dissipative cross-terms such as · d' are expected to be uncorrelated and of null statistical mean, hence (limit of small μ)\n        ⟨· d' + ' · d + ρρ'· d' + ρ' ρ' · d⟩≃ 0   . \n        \n        With these different estimates, the generalized Kolmogorov law for three-dimensional compressible isothermal turbulence reads\n        \n        - 4 ε = ∇_·⟨δ̅ρ (δ)^2 δ⟩  \n        - 1  2⟨ (ρθ' + ρ' θ) (δ )^2 ⟩  . \n        Expression (<ref>) is the first main result of this paper. This compact law is valid for homogeneous – but not necessarily isotropic – \n        turbulence. As explained above, to derive this expression we have assumed the existence of an inertial range where the forcing and the \n        dissipation are negligible <cit.>. The expression found is much simpler than the one proposed in <cit.> because \n        (i) the flux, F≡⟨δ̅ρ (δ)^2 δ⟩, is constructed as a single term that resembles its incompressible \n        version (that we recover by taking δ̅ρ = ρ_0, with ρ_0 a constant mass density), and (ii) the source is simply written as\n        S ≡ - (1/2) ⟨ (ρθ' + ρ' θ) (δ )^2 ⟩. It is a purely compressible term, which goes to zero when the \n        incompressible limit is taken; then, we recover the original form of the well-known four-third law <cit.>. \n        The sign of S is directly given by the sign of the dilatation: when the flow is mainly in a phase of dilatation (θ>0) the source is negative, \n        whereas in a phase of compression (θ<0) the source is positive. \n        We can also see that the source tends to zero on small scales along with the (δ u)^2 factor, as (ρθ' + ρ' θ) remains finite as ℓ goes to zero. This contrasts with the flux term that can still have a non-trivial contribution because of the –derivative introducing a 1/ℓ scaling. \n        A natural scale below which the source would be negligible is the sonic scale, i.e., the scale where the turbulence transitions from supersonic to subsonic <cit.>.\n        Finally, note that expression (<ref>) is Galilean invariant as the primitive equations (<ref>)–(<ref>). \n        \n        The generalized Kolmogorov law can be interpreted as if we had an effective cascade driven only by the flux term -4 ε_ eff≡∇_· F (such that ε_ eff=ε+S/4) that involves the usual energy injection/dissipation rate (ε) known in incompressible theory and a new purely compressible component (source) that reflects contraction and dilatation of the turbulent structures. If we assume that the cascade driven by the flux term is direct (i.e., ε_ eff>0) then a dilatation (compression) will tend to oppose (sustain) the energy cascade, preventing (enforcing) the formation of smaller structures. Furthermore, the dilatation of the structures (S<0) can annihilate the cascade to small scales (if ε=-S/4) or even reverse it (if ε+S/4<0) leading to the formation of large-scale structures via an inverse cascade. Note, however, that if S is scale dependent then compressible turbulence is not characterized by constant energy flux solutions as in incompressible theory <cit.>. As we will see below, the numerical simulation will be very useful to go further in our  interpretation. \n        \n        \n        \n        \n        \n        § NUMERICAL SIMULATION\n        \n        \n        In this section the exact law (<ref>) derived above is used to investigate supersonic turbulence produced by a massive numerical simulation with a grid resolution of 10,048^3 points and at Mach number 4. The Mach number is defined as ℳ=σ_v / c_s with σ_v the velocity dispersion at the main forcing scale L/2 and L the simulation side length. The simulation was performed using a modified version of the FLASH code <cit.>, solving the isothermal compressible HD equations in a triply periodic box. \n        Following the methods in <cit.> the simulation uses a naturally mixed driving (ζ=0.5) with an Ornstein-Uhlenbeck process acting on large scales. \n        The forcing amplitude is a paraboloid spanning k = 1..3, peaking at k = 2 and reaching zero at both k = 1 and k = 3, where the wavenumber k is in units of 2π/L. Thus, the forcing acts on scales larger than L/3 which are well above the ones we study in this paper. The data used here are 7 snapshots of the 10,048^3 simulation, sampled at a resolution of 2,512^3, of the density and the three components of the velocity field, taken at 2, 3, 4, 5, 6, 7 and 8 turbulence turnover times T (downsampling the data eases its handling without affecting the results reported in this paper). Fig. <ref> shows through rms Mach number and minimum and maximum densities that statistics for both velocity and density have converged after 2 turnover times, indicating that the simulation has reached a statistically stationary state <cit.>, hence the use of snapshots for times t ≥ 2T.\n        \n        \n        \n        For each snapshot the two terms of the exact law are computed along the three main axes x, y and z, and then averaged spatially \n        over the full box. The four signals obtained for different turnover times were eventually averaged to obtain the result displayed in Fig.<ref>.\n        \n        \n        First, we see that the mean rate of energy injection/dissipation ε (in red) is approximately constant over more than a decade. \n        This observation indicates that the assumptions made to derive the law are well satisfied on these scales of the simulation. \n        The changes in ε observed on larger scales will be discussed in the next section in light of subsequent observations.\n        Second, we see that the contribution of the flux term (in blue) is significantly higher than ε which means that the source (in green) brings a correction to its contribution with an opposite sign, which is confirmed by the green dashed curve. \n        For a better interpretation we can make a distinction between ε and ε_ eff introduced above, i.e., the energy transferred between scales through the usual (incompressible) turbulence cascade driven by the flux term, in which case we have ε = ε_ eff. Here, we see that ε < ε_ eff with a non-negligible contribution from the source. \n        This behavior contrasts with the one reported from direct numerical simulations of subsonic (compressible) MHD turbulence, where the overall contribution of the non-flux terms was found to be negligible with respect to the flux term <cit.>. Note that in space plasma data, where it is not always possible to measure precisely the source <cit.>, the variation of ε^IHD in the inertial range may indicate the presence of non-negligible compressible effects, especially in media where density fluctuations are high <cit.>.\n         \n        \n        We further investigate the properties of this supersonic simulation in order to understand the origin of the source contribution and its influence on turbulence. As we have seen above, the source is globally positive which reflects the dominance of compression. \n        Therefore, for a given snapshot we searched for the grid point of minimal dilatation θ (maximum contraction of the fluid). \n        In Fig. <ref> we show a slice of the data cube containing this point in the (yz) plane (other slices along (xy) or (xz) containing this point give a similar qualitative behavior). More precisely, we show the density-dilatation (top) and the modulus of the vorticity w = ∇× (bottom). \n        These cuts reveal the existence of turbulent filamentary structures (elongated dark red structures for ρθ) in which both |θ| and | w| are up to several orders of magnitude higher than in the rest of the plane. A zoom on such structures is shown in Fig. <ref>.\n        These structures are typically delimited by very thin boundaries of strong contraction (dark blue lines for ρθ) in which a high turbulent activity with many vorticity tubes is observed. \n        It is thought that the density-dilatation and the vorticity highlight the turbulence structures better than the previously used quantities θ and ρ<cit.>, which are less relevant to investigate the physics involved in the generalized Kolmogorov law.\n        \n        Regions with high density-dilatation are expected to drive most of the (average) source term. \n        We therefore selected a sample of these regions (filaments) in which the mean density was high, and computed the source and flux term for increments along the main orientation of the filamentary structure. The results obtained were then averaged over the selected samples. \n        In Fig. <ref> we show the result for a given filamentary structure and a “blank\" region of weaker activity (top), and an average over 8 filamentary structures (bottom). \n        For all these filaments we observe a similar trend: the source is dominant, positive and increases with spatial lag of the increments until it reaches approximately the sonic scale  ℓ_s ≃ 0.01235 L, the scale where the scale-dependent Mach number is ℳ(ℓ_s/L)=1  (see <cit.> for the original determination of ℓ_s in these simulations). \n        The flux term does not have a constant sign but remains negligible with respect to the source on most scales.\n        We note that, because of the sample size effect, the interpretation of the largest scales of the structures are subject to caution.\n        A comparison with a blank region gives a quite different result: the values of both the flux and the source terms are up to five orders of magnitude lower than their counterparts in filamentary structures. One should note that we only evaluate here the specific contribution of small pieces of the flow. Consequently one would not expect to retrieve any form of theoretical scaling predicted by the exact law, which would only apply to the full statistical average on the whole simulation domain.\n        \n        We complement our analysis by taking the absolute value of the flux and the source before performing their statistical averages.\n        Therefore, we define F̃ = ⟨δ̅ρ (δ)^2 |δ| ⟩ and\n        S̃ = 1  2⟨ |ρθ' + ρ' θ| (δ )^2 ⟩ and compute them on the entire simulation domain at a given time. These two quantities represent the total activity due to the flux and the source respectively, disregarding the sign of the local contributions and so the direction of the resulting turbulent cascade (direct or inverse). Note that, again, these results do not have to comply to any theoretical prediction brought by the exact law, as the terms computed here are not the ones forming the exact law per se. Yet, the non-signed quantities have the advantage of converging faster than their signed counterpart, and can lend some information about the mechanisms dominating on different scales.\n        The results are reported in Fig. <ref>. First, a clear power law S̃∼ℓ^1/2 emerges over two decades for the compressible source. \n        \n        By equalizing dimensionally the flux term and the source, we find δ u ∼ℓ^1/2 (we do not include the density that appears as a local average and not as a pure fluctuating quantity). This scaling is actually compatible with the one reported in <cit.> on supersonic scales using the second-order structure function (which is positive definite and therefore comparable to our calculation using absolute values), while a classical (incompressible) scaling  δ u ∼ℓ^1/3 was approximately found on subsonic scales. Note that the supersonic law is dimensionally compatible with the velocity spectrum E^u∼ k^-2, a scaling often attributed to a purely compressible (Burgers) turbulence <cit.>. In the framework of the generalized Kolmogorov law we see, however, that the change of slope reported previously can find a precise origin: it marks a transition towards a regime/scale where the absolute activity of the source becomes non-negligible. \n        Second, we see that the modified flux exhibits a plateau on small scales, as expected for a subsonic turbulent cascade mainly driven by the flux, which means that most of the energy transiting in either direction through these scales is transfered by a flux-driven process. A transition appears around the sonic scale above which the flux starts to drop: this behavior can be attributed to the dominance of the compressible source activity on supersonic scales.\n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        § DISCUSSION\n        \n        \n        Based on a single simulation, realized however at an unprecedented spatial resolution, some conclusions can be drawn. \n        By directly applying the new exact law derived analytically to the data we found that the amplitude of the source in the turbulent filamentary structures (Fig. <ref>) is much higher (up to two orders of magnitude) than when it is computed on the whole simulation (Fig. <ref>). \n        As the overall turbulent activity is less intense in the other regions we can conclude that these filaments drive the global behavior of S. On the contrary, it has been impossible to identify a recurring behavior in specific parts of the system for the flux term as we did for the source.\n        \n        At intermediate, transonic scales both the flux and the source contributions reach a peak. Furthermore the sign of S in both the global and local computations is positive, leading to a value of ε_ eff higher than ε, which is fixed externally by the forcing. \n        We thus suggest that the energy cascade in supersonic HD turbulence reaches its maximum efficiency (i.e. ε_ eff is maximal) around the transition from the subsonic to supersonic regimes.\n        This efficiency decreases with scales such that ε_ eff tends to be closer to ε on subsonic scales where S becomes sub-dominant. On supersonic scales, however, the exact law shows a decrease in the energy cascade rate ε, which is no longer constant. \n        \n        Since the law is exact under several assumptions, that means that at least one of them is not verified. For example we cannot exclude a non-local \n        effect of the forcing that would modify the scaling law mostly on large scales. \n        An anomalous dissipation on supersonic scales originating from the irregularities of the fields, which is not accounted for in our theory, could also contribute to the energy budget <cit.>.\n        \n        On the other hand, Fig. <ref> shows that the total, non-signed activity of the compressible source grows higher than the one of the flux: this suggests that density-dilatation acts strongly on supersonic scales, but in such a way that local contributions of opposite signs cancel each others in the scope of the exact law. This strong compressible activity, coupled to the flux activity becoming non-constant at supersonic scales, suggests a transition between two regimes around the sonic scale: a subsonic turbulent cascade driven by both the compressible flux and the source, and a highly compressible regime at supersonic scales which does not feature a conservative cascade. The vorticity distribution shown in Fig. <ref> reinforces this interpretation since stronger vorticity is only observed inside the small-scale turbulent structures. Similar conclusions were drawn by <cit.> who reported for subsonic and transonic simulations that pressure-dilatation acts essentially on large scales, whereas at small scales, below a transitional “conversion” scale range, a conservative cascade appears. Here we shed a new light onto those findings using a different approach that helps better understand how various mechanisms shape supersonic turbulence. \n        \n        \n        \n        \n        \n        \n        A spectral analysis of the velocity field u (not shown in this paper) reveals the existence of two distinct power-law scalings, separated roughly by the sonic scale. On supersonic scales the scaling is close to k^-2 , which is usually attributed to Burgers turbulence <cit.> ; on subsonic scales the scaling becomes close to k^-3/2 which is compatible with a theory of weak acoustic turbulence <cit.>. This brings another evidence of the existence of two distinct regimes at supersonic and subsonic scales, respectively a more shock-driven compressible regime and a (possibly acoustic) turbulent regime. If we assume that the cascade rate computed here is representative of (if not identical to) the energy dissipation rate in the system, the observation that cascade/dissipation rate peaks near the sonic scale (Fig. <ref>) where turbulence transitions from shock-like (k^-2) to fluctuation/vortex-like (k^-3/2) dominated regimes would be an indication of strong shock dissipation at that scale.\n        \n        It is interesting to note that using a model of acoustic turbulence with weak shocks at Mach number close to unity, <cit.> reported that a scaling relation similar to the incompressible Kolmogorov law could be retrieved for a modified energy cascade rate. In the framework of said model, our scaling relation (<ref>) still holds considering a similar modified energy cascade rate. This remark with the previous one  mean that sub-sonic turbulence could be composed of a mixture of weak shocks, acoustic waves and vortices.\n         \n        \n        \n        A final remark can be made about the exact law: given the high resolution of the simulation one would expect the energy cascade rate to form a steady plateau over more than one decade. This small inertial range may be attributed to two possible effects not included in our exact law (<ref>): i) non-local effects due to the large-scale forcing; ii)  additional local dissipation (in the supersonic range) through shocks/discontinuities  <cit.>, since our exact law assumes smoothness of the turbulent fields. This shortcoming calls for a new theory of compressible HD turbulence where such singular fields and non local effects due to large scale forcing can be accounted for, and which would be very relevant to supersonic turbulence. In addition, it would be interesting to investigate the question of intermittency in supersonic turbulence by evaluating separately the contributions of the flux and the source. Such theories are beyond the scope of this paper and are left to future studies.\n        \n        \n        \n        § CONCLUSION\n        \n        \n        The theory developed in this paper and applied to high resolution numerical simulations allows us to gain deep insight into supersonic ISM turbulence. The filamentary structures observed in the ISM seem to be characterized by a universal thickness of the order of the sonic scale <cit.>. Their shape is supposed to be mainly due to HD turbulence and to be little affected by other factors such as gravity or magnetic fields <cit.>. These studies associated with our work suggest that this universality could be explained by the existence of the two distinct regimes reported here: \n        i) a supersonic regime dominated by shock-like structures where the energy cascade rate ε is not constant; ii) a subsonic regime with a lower and mainly constant ε where vortices (and acoustic waves) are produced and in which a classic conservative cascade is formed. \n        In between, the transonic scales where turbulence reaches its peak of effective energy transfer would correspond to the size \n        of the filaments. Our interpretation is thus that filaments are stuck on the smallest scale of the supersonic regime, which is the sonic scale, while the weaker subsonic cascade produces vorticity tubes on smaller scales. \n        \n        Applications of the law to more complete simulations, featuring for instance gravitational forces or magnetic fields, would help refine this interpretation and may provide new clues on the interplay between ISM turbulence and the problem of star formation <cit.>. \n        For example, <cit.> were able for the first time to observationally derive the fractions of momentum density contained in the solenoidal and compressive modes of turbulence. It was in the Orion B molecular cloud where the mean Mach number is ∼ 6. They showed that the compressive modes are dominant in regions with a high star formation rate (as predicted in <cit.>). According to our analysis the source term is the dominant component of compressible turbulence inside filaments. \n        Future work that would directly link the formalism of exact laws (and thus the source and flux terms) to the star formation rate could significantly advance our understanding of how turbulence controls the formation of structures on different scales in the ISM.\n        \n        \n        We thank the anonymous referee for their valuable suggestions, which helped to improve this work. C. F. acknowledges funding provided by the Australian Research Council (Discovery Project DP170100603 and Future Fellowship FT180100495), and the Australia-Germany Joint Research Cooperation Scheme (UA-DAAD). We further acknowledge high-performance computing resources provided by the Leibniz Rechenzentrum and the Gauss Centre for Supercomputing (grants pr32lo, pr48pi and GCS Large-scale project 10391), the Australian National Computational Infrastructure (grant ek9) in the framework of the National Computational Merit Allocation Scheme and the ANU Merit Allocation Scheme. The simulation software FLASH was in part developed by the DOE-supported Flash Center for Computational Science at the University of Chicago.\n        \n        aasjournal\n"}