{"entry_id": "http://arxiv.org/abs/2303.06957v1", "published": "20230313095258", "title": "Multi-agent Distributed Model Predictive Control with Connectivity Constraint", "authors": ["Andrea Carron", "Danilo Saccani", "Lorenzo Fagiano", "Melanie N. Zeilinger"], "primary_category": "cs.MA", "categories": ["cs.MA", "math.OC"], "text": "\n\n\n \n\n\nThis research has been supported by the Italian Ministry of University and Research (MIUR) under the PRIN 2017 grant n. 201732RS94 “Systems of Tethered Multicopters”.\n\n\n\nFirst]Andrea Carron \nSecond]Danilo Saccani \nSecond]Lorenzo Fagiano\nFirst]Melanie N. Zeilinger \n\n[First]Institute for Dynamic Systems and Control, ETH Zurich, Switzerland. (email {carrona, mzeilinger}@ethz.ch)\n[Second]Dipartimento di Elettronica, Informazione e Bioingegneria, Politecnico di Milano, Piazza Leonardo da Vinci 32, Milano, Italy. (email: {danilo.saccani, lorenzo.fagiano}@polimi.it) \n\n                \nIn cooperative multi-agent robotic systems, coordination is necessary in order to complete a given task. Important examples include search and rescue, operations in hazardous environments, and environmental monitoring. Coordination, in turn, requires simultaneous satisfaction of safety critical constraints, in the form of state and input constraints, and a connectivity constraint, in order to ensure that at every time instant there exists a communication path between every pair of agents in the network. In this work, we present a model predictive controller that tackles the problem of performing multi-agent coordination while simultaneously satisfying safety critical and connectivity constraints. The former is formulated in the form of state and input constraints and the latter as a  constraint on the second smallest eigenvalue of the associated communication graph Laplacian matrix, also known as Fiedler eigenvalue, which enforces the connectivity of the communication network. We propose a sequential quadratic programming formulation to solve the associated optimization problem that is amenable to distributed optimization, making the proposed solution suitable for control of multi-agent robotics systems relying on local computation. Finally, the effectiveness of the algorithm is highlighted with a numerical simulation.\n\n\n\nControl under communication constraints (nonlinearity); \nNonlinear cooperative control; \nCoordination of multiple vehicle systems;\nMulti-agent systems;\nNonlinear predictive control;\nNetworked systems;\n\n\n\n\n\n\n§ INTRODUCTION\n\nIn the last two decades, many applications employed cooperative multi-agent setups, for example, environmental monitoring, search and rescue operations and exploration of unknown environments.\n\n\nCompared to single-agent setups, multi-robot systems can solve certain tasks faster and more robustly, moreover some tasks can just not be solved by a single agent. \n\nHowever, to successfully deploy a multi-agent system, it is necessary to simultaneously guarantee safety and communication network connectivity, <cit.>. The former is commonly formulated in the form of satisfaction of safety critical state constraints, like collision avoidance with obstacles and other agents. The latter requires the existence of a multi-hop communication path between each pair of agents in the communication network. In most distributed multi-agent problems, connectivity is usually assumed rather than enforced, see for example <cit.>. However, the loss of connectivity can lead to the failure of the controller as information cannot propagate throughout the whole network. Guaranteeing connectivity in multi-robot systems is particularly challenging due to the time-varying nature of the communication network that depends on the agents relative positions. \n\nContributions: In this work, we propose a multi-agent model predictive controller (MPC) for tracking that can simultaneously guarantee satisfaction of safety critical and connectivity constraints. The latter is enforced by imposing a constraint on the second smallest eigenvalue of the Laplacian matrix. The proposed controller maintains the MPC theoretical results of closed-loop constraint satisfaction and convergence. Moreover, we propose a Sequential Quadratic Programming (SQP) reformulation of the original nonlinear optimal control problem that is amenable to distributed implementation, i.e., it relies on local communication. \n\n\nRelated Work:\nIn the last decades, model predictive control received a considerable attention thanks to its capability of systematically handling state and input constraints.  The application of MPC to control multi-agent and distributed systems has also been widely studied, see for example <cit.> and <cit.>. While there is a variety of techniques, the approach most relevant to this paper is the work presented by <cit.> and <cit.>, where the authors present a tracking MPC formulation for nonlinear constrained systems.\n\n<cit.> were among the first to consider connectivity in a control problem. The work introduces the concept of geometric robust connectivity, which however, in the examples presented induces unwanted chattering behavior of the agents' inputs. Alternative approaches for formation control have been presented in <cit.>, but they enforce the maintenance of local connections, which can be very restrictive. An alternative approach, based on enforcing connectivity on the adjacency matrix, is introduced in <cit.>, however, the resulting controller cannot be computed using only local information. The successful idea of using the Fiedler eigenvalue, see <cit.>, to preserve connectivity is introduced in <cit.>. In <cit.>, the authors make direct use of the Fiedler eigenvalue, while in <cit.>, the authors exploit the determinant of the reduced Laplacian. Applications of the two proposed methods to the problem of formation control and rendezvous problems, as well as the integration of radio signal strength maps are considered in <cit.>. In <cit.>, a more efficient distributed method for computing the Fiedler eigenvalue is presented, and in <cit.>, the authors introduce two connectivity maintenance algorithms for Lagrangian and port-Hamiltonian non-linear systems, respectively. Finally, we refer the readers to <cit.>  for a unified framework for connectivity maintenance. To the best of authors' knowledge, this is the first work where connectivity is imposed as constraint using an optimization-based control framework. Moreover, while some of the aforementioned approaches provide heuristics to satisfy constraints, to the best of the authors' knowledge none of the previous results provide formal guarantees. \n\n\nThe remainder of the paper is organized as follows. In Section <ref>, we introduce the problem setup. Section <ref> and <ref> describe the proposed method and an SQP-based solution for the resulting optimization problem, respectively. In Section <ref>, we validate the controller with numerical simulations. Finally, Section <ref> concludes the paper. \n\n\n\n\n§ PROBLEM FORMULATION\n\n\nThis section introduces the agents dynamics and their constraints, as well as the communication assumptions. Finally, we formally introduce the problem we aim to solve.\n\n\n §.§ Agents Dynamics and Constraints\n\nWe consider a swarm of M agents, each of them modeled as a non-linear time-invariant dynamical system of the form\n\n    x_i(k+1) = f_i(x_i(k),u_i(k)), \n       p_i(k) = C_ix_i(k),\n\nwhere x_i ∈ℝ^n_i, u_i ∈ℝ^m_i, and p_i ∈ℝ^o_i are the state, input, and position of agent i, respectively. In most robotics applications, the position vector is either 2 or 3-dimensional, i.e., o_i = 2 or 3. Let us denote with (x̅_i,  u̅_i) an equilibrium of system (<ref>), and we assume that each agent is able to measure its own state x_i.\nLet us consider, without loss of generality, that the position of the system p_i is at the top of the state vector x_i and introduce the operator ψ (p_i) = [p_i^T,0, …, 0]^T∈ℝ^n_i that generates a vector of the dimension of x_i with first entry, corresponding to the position p_i of the i-th robot.\n\n\nThe agents' dynamics (<ref>) are position invariant, i.e. ∀ p_j ∈ℝ^o_i, x_i, u_i,  f_i(x_i+ψ(p_j),u_i)=x_i(k+1)+ψ(p_j).\n\nAssumption <ref> is in particular satisfied when the position is the output of an integrator and no forces or moments depend on it, which is a standard condition in many ground and aerial robots. The state and input variables are constrained to lie within the following sets\n\n    x_i ∈𝕏_i,   u_i ∈𝕌_i.\n\nFinally, by stacking the state of each agent in a vector and similarly for the inputs, we obtain the swarm state x=col_i∈M x_i and input u=col_i∈M u_i.\n\n\n\n §.§ Communication Network and Generalized Connectivity\n\nIn the proposed setup, agent i can communicate  with spatially close neighbours, i.e., all agents contained within a set _i (p_i), centered at the agent's position p_i:  ψ(p_i) ∈𝕏_i. For example, assume that agents i and j have a communication set _l(p_l)={q:p_l - q_2 ≤ d }, with l∈{i,j} and d > 0 being their maximum communication range. Thus, the agents are able to communicate if and only if p_i - p_j_2 ≤ d.\nThe communication network is defined as an undirected and time-varying communication graph (k)=(, (k)), where the set of nodes ∈M represents the agents in the network, and the set of edges (k) ⊂× contains the pairs of agents {i,j}, which can communicate with each other at time k. (k) can change over time as the edges depend on the agents' relative position. The set of neighbors of node i, including i itself, is denoted by N_i = {i}∪{j | {i,j}∈(k)}⊆. The state of the agent i  with the state of its neighbours is denoted x_N_i. To include possible interactions between neighbouring subsystems we consider also the following coupling state constraint: \n\n    c(x_N_i) ≤ 0.\n\nConstraint (<ref>) is left purposely general since it can represent any coupling between neighbouring subsystems. A typical example in multi-robot systems is collision avoidance between neighbours.\n\nThe Laplacian matrix L∈ℝ^M × M of a graph  is defined as L = D - A, where A is the adjacency matrix and D is the degree matrix of the graph. The adjacency matrix A ∈ℝ^M × M is a square symmetric matrix with elements A_ij≥ 0 such that A_ij = 0 if {i, j}∉(k), A_ii = 0, and A_ij >0 otherwise. The matrix D ∈ℝ^M × M is a diagonal matrix where D_ii = ∑_j=1^M A_ij.\nA graph is said to be connected if there is a sequence of edges between any pair of vertices. A measure for the graph connectivity is given by the second smallest eigenvalue λ_2 of the Laplacian matrix L of the graph , also called the Fiedler eigenvalue or connectivity eigenvalue, see for example <cit.>. When the graph  is connected, the connectivity eigenvalue λ_2 is strictly positive, i.e.,\n\n    λ_2(L) > 0.\n \nMaking the adjacency matrix A dependent on the agents' state x_i may lead to a loss of connectivity in specific scenarios. We define a smooth function ϕ(x_i,x_j) such that ϕ(x_i,x_j) > 0 if and only if p_i - p_j_2 ≤ d and ϕ(x_i,x_j) = 0 otherwise. The function ϕ(x_i,x_j) is used to weigh the inter-agent links in the adjacency matrix, i.e., by setting A_ij = ϕ(x_i,x_j). The connectivity condition (<ref>) thus becomes state dependent\n\n    λ_2(L(x)) > 0.\n\nCondition (<ref>) is often referred to as generalized connectivity, see <cit.>. \n\nIn the next sections, we will make use of the following result, providing that both eigenvalues and eigenvectors of the Laplacian matrix L are differentiable under the following assumption:\n \nThe second smallest eigenvalue λ_2(L(x)) of the graph Laplacian matrix is simple ∀ k≥ 0.\n\n(Theorem 1 in <cit.>) \n    Let Assumption <ref> hold, and let X_0 be a real symmetric n× n matrix. Let v_0 be a normalized eigenvector associated with a simple eigenvalue λ_0 of X_0. Then a real-valued function λ and a vector function v exist for all X in some neighbourhood 𝒩(X_0)∈ℝ^n× n of X_0, such that:\n    \n    λ(X_0)=λ_0,     v(X_0)=v_0,\n\n    and\n    \n    Xv=λ v,      v^Tv=1,     X∈𝒩(X_0).\n\n    Moreover, the functions λ and v are ∞ times differentiable on 𝒩(X_0), and the differentials at X_0 are:\n    \n    dλ = v_0^T(dX)v_0\n\n    and\n    \n    dv=(λ_0 I_n-X_0)^+(dX)v_0\n\n    where X^+ denotes the Moore-Penrose inverse of matrix X and I_n denotes the n-by-n identity matrix.\n\n\nIn order for λ and v to be differentiable at X_0 we require that λ_0 is simple, but this does not exclude the possibility of multiplicities among the remaining n-1 eigenvalues of X_0. This assumption is usually implicitly considered in approaches for connectivity maintenance, see for example <cit.>. In our simulations, this assumption is always verified; however, to formally guarantee the assumption, it can also be enforced through a nonlinear constraint in the proposed FHOCP.\n\n\n\n §.§ Problem Statement\n\nBased on the defined setup, the problem addressed in this paper is formally stated in the following. \n\n \nConsider a swarm of M robots with dynamics (<ref>) and subject to constraints (<ref>), (<ref>). The agents' initial condition x(0) = x_0 satisfies the generalized connectivity condition λ_2(L(x_0)) > 0. Given M reference targets r = [r_1, …, r_M]^T, such that λ_2(L([ψ(r_1), …, ψ(r_M)]^T)) > 0, determine control inputs u such that generalized connectivity condition (<ref>) and constraints (<ref>) are satisfied at all times k>0 and, if feasible, lim_k→∞ p(k) - r_2 → 0.\n\n\n\n\n\n§ MPC WITH CONNECTIVITY CONSTRAINT\n\n\nIn this section, we introduce a method to solve Problem <ref> that simultaneously takes into account the non-linear dynamics of the agents (<ref>), state and input constraints (<ref>) and (<ref>), and the connectivity constraint (<ref>). To this aim, we propose a nonlinear tracking MPC inspired by the work in <cit.>, where an artificial reference is considered as an additional decision variable. Problem (<ref>) is cast as the following Finite Horizon Optimal Control Problem (FHOCP), where x(j|k) denotes the open-loop prediction of the variable x at time j+k predicted at time k.\n\n    \n    min_U,x̅,u̅,r̅  ∑_i=1^MJ_i(x,U_i,x̅_i,u̅_i,r_i,r̅_i)\n       subject to: \n        x_i(0|k)=x_i(k) \n        x_i(j+1|k)=f_i(x_i(j|k),u_i(j|k))       ∀ j∈ℕ_0^N-1\n        p_i(j|k)=C_i x_i(j|k)       ∀ j∈ℕ_0^N\n       x̅_i = f_i(x̅_i,u̅_i)\n        x_i(N|k)=x̅_i  \n       r̅_i = C_i x̅_i \n        x_i(j|k)∈𝕏_i       ∀ j∈ℕ_0^N\n        c(x_N_i(j|k))≤ 0       ∀ j∈ℕ_0^N\n        u_i(j|k)∈𝕌_i       ∀ j∈ℕ_0^N-1\n       λ_2(L(x(j|k))) >0       ∀ j∈ℕ_0^N\n       ∀ i∈ℕ_1^M,\n\n\nwhere U_i is the input sequence of agent i over a prediction horizon N ∈ℕ, U=col_i∈{1,…,M} U_i the vector containing all the input sequences, J_i is the cost function of agent i, which depends on input, state, reference and artificial reference of agent i, and ℕ_i^j indicates the integers from i to j. Constraints (<ref>)-(<ref>)\nrepresent the initial condition and dynamics of the system, constraints (<ref>)-(<ref>) pertain to state and input, (<ref>) is the terminal constraint, and (<ref>) the connectivity one. \n\nNotice that Problem (<ref>) couples the agents via constraint (<ref>), which couples neighbouring agents, and connectivity constraint (<ref>), which couples the state of all the agents in the system. Since coupling constraints of the form (<ref>) have been widely addressed in the distributed MPC literature, see for example <cit.>, we will mainly focus on how to treat the connectivity constraint (<ref>) in the following.\n\nThe different ingredients defining the FHOCP (<ref>) are described in the following subsections.\n\n\n\n  §.§.§ Cost Function\n\nGiven the reference r_i for each agent, the cost function considered in (<ref>) is defined as\n\n    J_i(x,U,x̅_i,u̅_i,r_i,r̅_i)) = ∑_j=1^N-1 l_i(x_i,(j|k)-x̅_i,u_i,(j|k)-u̅_i)+ \n     +l_i,N(r̅_i-r_i),\n\nwhere l_i(·,·):ℝ^n_i×ℝ^m_i→ℝ is the stage cost function and l_i,N(·):ℝ^o_i→ℝ is an offset cost that weighs the distance between the final position of the predicted trajectory, i.e., the artificial reference, and the reference r_i. Let us consider the following standard assumption, see <cit.>, on the stage and offset cost.\n \nConsider the cost function (<ref>). The stage cost function l_i(·,·) is positive definite, and the offset cost l_i,N(·) is a positive definite, convex subdifferentiable function.\n\n\n\n\n\n\n\n\n\n  §.§.§ Connectivity Constraint\n\nAs mentioned in Section <ref>, defining the adjacency matrix A via the weight function ϕ(x_i,x_j) renders the connectivity condition state-dependent. We consider continuously differentiable functions ϕ, allowing us to compute the Jacobian and Hessian with of the Laplacian L with respect to the state, ultimately needed to solve the optimization problem.\nAs an example, in <cit.>, the following position-dependent function has been considered:\n\n    ϕ(p_i,p_j)=e^-p_i-p_j _2^2 / 2σ^2,\n\nwhere σ is a scalar parameter computed such that e^-ρ_c^2 / 2σ^2=ϵ, with ϵ being a (small) user-defined threshold and ρ_c a communication radius. \nAlternatively, other bounded continuously differentiable functions can be considered, for example\n\n    ϕ(p_i,p_j)=-0.5 tanh(τp_i-p_j_2 -τρ_c)+0.5,\n\nwhere τ is a user-defined parameter that allows to tune the slope of the function depending on the communication radius ρ_c.\nThe strict inequality imposed by constraint (<ref>) cannot be directly implemented in a nonlinear programming (NLP) solver. A common approach is to tighten the constraint.\nTo this aim, let us consider an arbitrary small minimum value of the Fiedler eigenvalue λ_2 >0 and let us impose λ_2(L(x_(j|k))) ≥λ_2 instead of constraint (<ref>).\n\n\n\n\n\n\n  §.§.§ Terminal Ingredients\n\nSince, especially for nonlinear systems, the design of a (possibly time-varying) terminal region can be particularly challenging, in this work, we consider a terminal equality constraint corresponding to a steady-state (see (<ref>)). \nThere are many alternatives that can enlarge the domain of attraction of the approach at the cost of increased complexity in the definition of the terminal ingredients, see e.g. the work proposed by <cit.>. However, including the connectivity constraint in the computation of terminal ingredients is non trivial problem, and it is left as an open research direction.\n\n\n\n  §.§.§ Theoretical analysis\n\n\nBefore stating the results of the proposed approach, let us consider the following assumption.\n\n\n\n\n \nFor the given initial condition x_i(0) ∀ i ∈1,…,M, there exists a vector of input sequences U of length N∈ℕ that generates an obstacle free trajectory, preserves the connectivity constraints (<ref>), and allows each agent to reach the reference r_i.\n\nAssumption <ref> implies that there exists a sequence of inputs sequences that allows the system to reach the target without violating the constraints. In case the target is not reachable, the proposed formulation allows to reach the closest reachable steady state, for more details see <cit.>.\n\nThe following proposition summarizes the theoretical guarantees of the proposed MPC control scheme. \n \nLet Assumptions <ref>, <ref> and  <ref> hold, and assume that the FHOCP (<ref>) at time k = 0\nis feasible.\nThen, problem (<ref>) is recursively feasible and, by selecting a prediction horizon N≥N, the system controlled by solving the FHOCP (<ref>) in a receding horizon fashion, \n\nconverges to the reference r while satisfying the generalized connectivity condition (<ref>) and constraints (<ref>) and (<ref>), ∀ k≥0.\n\nIn the following, we provide a sketch of the proof of this result.\n\nThe aforestated result comes directly from the use of the terminal equality constraint (<ref>) and classic arguments from MPC theory, see for example <cit.>.\nThe proof is divided in two parts; first we show that problem (<ref>) is recursively feasible and then, we show that under Assumptions  <ref>, <ref> and  <ref> the system's position converges to the target. \n\nRecursive feasibility: As standard in MPC (see e.g., <cit.>), given a feasible solution of the FHOCP (<ref>) at time k denoted as U_i^*(k)={u_i^*(0|k),…\n…,u_i^*(N-1|k)} we can define the following candidate solution at time k+1: Û_i(k+1)={u_i^*(1|k),…,u_i^*(N-1|k),u̅_i^*} leading to the candidate state trajectories X̂_i(k+1)={x_i^*(1|k),…,x_i^*(N-1|k), x̅^*_i}, ∀ i ∈ℕ_1^M.\nIt is easy to show that the candidate trajectory is a feasible solution for problem (<ref>), thanks to the state and connectivity constraint satisfaction of the terminal equality constraint (see constraints (<ref>) (<ref>), (<ref>) and  (<ref>)) and thanks to the invariance of the steady-state x̅_i under the terminal steady-state control action u̅_i.\n\n\nConvergence: \nUnder Assumptions <ref> and <ref>, thanks to the results on the convergence of tracking MPC in <cit.>, the state converges to the target, i.e., lim_k→∞p(k) -r _2→ 0.\n\n\n\nNote that the results presented in Proposition <ref> remain valid also in the presence of a time-varying reference r, thanks to the offset cost in (<ref>), as shown in <cit.>.\n\n\n\n§ DISTRIBUTED SQP-BASED SOLUTION\n\n\nThe FHOCP (<ref>) is an NLP due to the nonlinearities introduced by the system dynamics (<ref>) and the nonlinear constraint (<ref>). \nAddressing the problem in a centralized way would require communicating the state of all agents to a single unit, and then computing the solution and sending back the optimizer in real-time. This may be impractical in many cases, due to delays and limited computation capabilities. To avoid the use of a central-unit, we propose an SQP-based solution, for more details see <cit.>, that is amenable to distributed optimization. \n\nIn order to obtain the SQP formulation, we first write the FHOCP (<ref>) as\n\n    \n    min_z      f_NLP(z)               \n    s.t.:   \n                 g(z)=0,        \n        h(z)≤ 0,  \n        -λ_2(L(z))+λ_2≤ 0 ,\n\n\nwhere z is the optimization variable that includes both state and input. \nIt can be noticed that we have highlighted constraint (<ref>) in (<ref>). In this section, we aim to show how the gradient of the connectivity constraint and the related term of the Hessian of the Lagrangian, which will be better defined in the following paragraph, can be analytically computed.\n\nSequential quadratic programming computes a solution to (<ref>)\nby iteratively solving quadratic programs that locally approximate the original NLP at the current solution estimate ẑ_j. At each iteration, the solution Δ z of the quadratic subproblem\n\n    \n    min_Δ z  ∇   f_NLP(ẑ_j)^TΔ z + 1/2Δ z^T HΔ z \n    s.t.:   \n                 g(ẑ_j)+∇ g(ẑ_j)Δ z=0,  \n        h(ẑ_j)+∇ h(ẑ_j) Δ z≤ 0,  \n        -λ_2(L(ẑ_j))+λ_2-. ∂λ_2(L(ẑ_j))/∂ z|_ẑ_jΔ z≤ 0 ,\n\n\nis used to update the current solution estimate, where ∇ f_NLP, ∇ g and ∇ h denote the gradients of f_NLP, g and h, respectively. In the above optimization problem, the matrix H denotes the Hessian of the Lagrangian L of (<ref>), where L is defined as\n\n    L(z,μ^g,μ^h,μ^λ) = f_NLP(z)+μ^g^T g(z)+μ^h^T h(z)-μ^λλ_2(L(z)),\n\nand μ^g,μ^h, and μ^λ are the Lagrange multipliers.\nThe Hessian, in general, can be approximated, e.g. with Broyden–Fletcher-Goldfarb–Shanno (BFGS) algorithm, \n see <cit.>, or exactly computed. Also the gradients required to solve (<ref>), can be analytically or numerically computed. In this paper, we provide a result that shows how the gradient and the Hessian of the Lagrangian term related to the connectivity constraint (<ref>) can be analytically computed by exploiting Theorem <ref>. In fact, according to (<ref>), we can write:\n\n\n    ∂λ_2 /∂ x_i = v_2^T ∂ L/∂ x_i v_2 = ∑_j∈N_i∂ A_ij/∂ x_i (v_2^i-v_2^j),\n\nwhere v_2^i is the i-th entry of the eigenvector v associated with the second smallest eigenvalue λ_2 of the Laplacian L. \n\nFurthermore, by differentiating a second time (<ref>), we obtain that \n\n\n\n\n\n\nthe second derivative of the Fiedler eigenvalue with respect to the state x can be written as:\n\n    ∂^2λ_2/∂ x_ix_j=\n        [\n            ∂ v_2/∂ x_j]^T\n        [\n            ∂ L/∂ x_iv_2\n            ]+\n        v_2^T (\n        ∂^2 L/∂ x_i x_j)\n        v_2+\n        v_2^T\n        ∂ L/∂ x_i∂ v_2/∂ x_j,\n\nwhere ∂ v_2/∂ x_i is derived by (<ref>).\n\nIn the following, we show that the QP-subproblem (<ref>) maintains the graph structure inherited from the communication network, and thus can be solved using distributed optimization techniques, such as the Alternating Direction Method of Multipliers (ADMM) (see <cit.>). \nIn the original problem (<ref>), the coupling among neighbouring agents is imposed by constraints (<ref>) and (<ref>), i.e., the coupling state constraint and the connectivity constraint. By definition, the first only couples neighbouring agents, and thus also its linearization in (<ref>) preserves the same sparsity pattern imposed by the communication network. Regarding the connectivity constraint, it is possible to write (<ref>) such that it only depends on local information. In fact, the smallest eigenvalue λ_2 of the Laplacian matrix L and the associated eigenvector v_2 can be computed in a distributed fashion by following the approach proposed in <cit.>, which makes use of a modified power-iteration method. Finally, the Jacobian (<ref>) and Hessian (<ref>) of the second smallest eigenvalue of the Laplacian only depend on local information. In particular for the Jacobian, it is possible to see that the summation in (<ref>) runs only over the neighbouring agents thus requiring only local information. The Hessian computation in (<ref>) comprises three terms. The computation of the first and third terms require only local information as they involve a multiplication with the derivative of the Laplacian with respect to the state of agent i. The same argument holds for the second term as it involves the second derivative of the Laplacian with respect to the state of agent i and j.\n\nTo conclude, the SQP-based algorithm to solve optimization problem (<ref>) is summarized in Algorithm <ref>.\n\n\n\n\nIn Algorithm <ref>, the parameter α_j is determined in order to produce a sufficient decrease in a merit function that combines the objective with measures of constraint violation, see <cit.>, to avoid steps that reduces the objective function but increases the violation of the constraints.\n\nIn general, the Hessian of the Lagrangian L may not be positive definite. However, to guarantee the convergence of the SQP-based algorithm, it is necessary that the obtained approximation of H is positive definite. When this is not the case, there exists various approaches to find a positive definite approximation, see for example <cit.>.\n\n\n\n\n\n\n\n\n§ NUMERICAL EXAMPLE\n\n\nWe provide two numerical examples to show the effectiveness of the proposed approach. The simulations are performed in MATLAB^ on a Quad-Core Intel Core i7 (2.8 GHz, 16 GB) machine under MS Windows, using CasADI to compute the derivative needed to define the QP (<ref>) and  to solve each iteration of the SQP.\nFor both examples, we consider a swarm of vehicles, each one described by the following non-linear time-invariant dynamics:\n\n    x_i(k+1)    = f(x(k),u(k)), \n    [ p_x_i(k+1); p_y_i(k+1);   θ_i(k+1);  γ_i (k+1) ]    = (\n        \n        p_x_i(k)+T_s cos(θ_i(k))v_i(k)\n        \n    \n        p_y_i(k)+T_s sin(θ_i(k))v_i(k)\n        \n    θ_i(k) + T_s v_i(k)/Ltan(γ_i(k))\n    γ_i(k)+T_s δ_i(k)\n        ),\n    \n         p_i(k)    = Cx_i(k),\n\nwhere T_s=0.1 is the sampling time, L=0.005 is the wheelbase of the agent, p_xi, p_yi represent the position of the agent, θ_i the yaw angle and γ_i the steering angle.  The input of the system is represented by the commanded velocity v_i and steering rate δ_i.\nThe yaw angle of each agent is constrained to be within the set [-π, π], while the steering angle γ_i∈[-π/2, π/2], defining the set of state constraints 𝕏_i.\nThe velocity of each agent is instead limited in the range [-4, 4] m/s and the steering rate |δ_i|≤1, defining the set of input constraints 𝕌_i.\nEach agent has a circular communication set _i(p_i)={q:p_i - q_2 ≤ρ_c } with a communication radius ρ_c=2 m. To define the adjacency matrix, we consider the following function ϕ(p_i,p_j)=-0.5tanh(10p_i - q_2-10ρ_c)+0.5.\nFurthermore, to avoid collisions between different agents, we consider an obstacle avoidance constraint in the FHOCP, by setting as forbidden area a ball with \ndiameter ρ_a = 1 m around the agent position.\nThus, we impose the collision avoidance constraint p_i - p_j_2 ≥ρ_a. \n\n\nAs a first example, we present a scenario where a swarm of M=10 agents has to cross the workspace, while avoiding collisions with other agents and with a circular obstacle centered at ξ_o and of radius ρ_o , see Fig. <ref>.\nThus, we consider the following FHOCP\n\n    \n    min_U,x̅,u̅,r̅  ∑_i=1^M J_i(x,U,x̅_i,u̅_i,r̅_i,r_i) \n    \n                subject to: \n        x_i(0|k)=x_i(k),  \n        x_i(j+1|k)=f(x_i(k|t),u_i(k|t)),       ∀ j ∈ℕ_0^N-1, \n        x_i(j|k)∈𝕏_i,       ∀ j ∈ℕ_0^N, \n        u_i(j|k)∈𝕌_i,       ∀ j ∈ℕ_0^N-1, \n       p_i(j|k)-ξ_o _2≥(ρ_a/2+ρ_a/2),       ∀ j ∈ℕ_0^N, \n        ||p_i(j|k)-p_l(j|k) ||_2≥ρ_a,  ∀ l ∈N_i,       ∀ j ∈ℕ_0^N,   \n       x̅_i = f(x̅_i,u̅_i),\n        x_i(N|k)=x̅_i,   u̅_i ∈𝕌_i\n       r̅_i = C x̅_i, \n       λ_2(L(x))≥ 0.1, \n       ∀ i ∈ℕ_1^M,\n\n\nthe considered tracking cost function is\n\n    J_i(x,U,x̅_i,u̅_i,r̅_i,r_i)=∑_j=1^N-1|x_i(j|k)-x̅_i|_Q+\n    \n        +|u_i(j|k)-u̅_i|_R  +|r̅_i-r_i|_Q_2,\n\nwhere Q=I_4, R=0.5  I_2, Q_2=5  I_4 and the selected prediction horizon is N=10.\nThe obtained NLP, is solved with Algorithm <ref>. Fig. <ref> shows the closed-loop trajectories of the agents applying the control law obtained by solving (<ref>), either when constraint (<ref>) is implemented (Fig. <ref>) or without (Fig. <ref>).\n\nThe value of the Fiedler eigenvalue λ_2(L(x)) during the two simulations is shown in Fig. <ref>. The red line shows the behaviour of the eigenvalue when the connectivity constraint (<ref>) is not implemented. As it can be noticed, when the red agent in Fig. <ref> circumnavigates the obstacle, \n\nthe eigenvalue drops to 0 meaning that the graph is disconnected and the network has no connectivity. The blue line, instead, depicts the value of λ_2(L(x)) when constraint (<ref>) is implemented. As it can be noticed in Fig. <ref>, in this case, the red agent reduces its velocity and circumnavigates the obstacle on the other side to keep communication with the rest of the swarm.\n\n\n\nThe second scenario, shown in Fig. <ref>, represents a leader-follower approach where M=4 agents are considered.\nThe leader, depicted as a red triangle in Fig. <ref>, follows a time-varying reference r_1 that drives the leader through a series of obstacles. To this aim, the cost function of problem (<ref>) is replaced with the following one:\n\n    J(x_1,U,x̅_1,u̅_1,r̅_1,r_1) = ∑_j=1^N-1|x_1(j|k)-x̅_1|_Q+\n    +|u_1(j|k)-u̅_1|_R \n        +|r̅_1-r_1|_Q_2.\n\nFig. <ref> shows the simulation at time k=0,15, 25 and 40. The communication graph is highlighted in blue. It can be noticed that the connectivity constraint (<ref>) forces the follower agents to follow the leader to maintain the communication.\n\n\n\n§ CONCLUSIONS\n\n\nThis paper presented a multi-agent model predictive controller able to enforce network connectivity by imposing a constraint on the connectivity eigenvalue while guaranteeing input and state constraint satisfaction. To implement the proposed approach based on only local computation, we propose a SQP reformulation of the original nonlinear optimal control problem. Numerical simulations show the effectiveness of the approach.\n\n             \n"}