{"entry_id": "http://arxiv.org/abs/2303.06951v1", "published": "20230313094348", "title": "A generative model to synthetize spatio-temporal dynamics of biomolecules in cells", "authors": ["Lisa Balsollier", "Frédéric Lavancier", "Jean Salamero", "Charles Kervrann"], "primary_category": "q-bio.SC", "categories": ["q-bio.SC", "stat.AP"], "text": "\n\n\n\n#1 1\n\n\n\n\n\n\n\n\n1,2,3]Lisa Balsollier\n1]Frédéric Lavancier\n2,3]Jean Salamero\n2,3]Charles Kervrann\n\n[1]LMJL, UMR 6629 CNRS, Nantes Université, F-44322 Nantes, France\n[2]SERPICO Project-Team, Centre Inria de l’Université de Rennes, F-35042 Rennes Cedex, France\n[3]Institut Curie, UMR CNRS 144, PSL Research University, Sorbonne Universités, F-75005 Paris, France\n\n\n \n\nA generative model to synthetize  spatio-temporal dynamics of biomolecules in cells\n    [\n    \n===================================================================================\n\n\n\n\n\n\n\n\n\n\n Generators of space-time dynamics in bioimaging have become essential to build ground truth datasets for image processing algorithm\nevaluation such as biomolecule detectors and trackers, as well as to generate training\ndatasets for deep learning algorithms. In this contribution, we leverage a stochastic model, called birth-death-move (BDM) point process, in order to generate joint dynamics of biomolecules in cells. This approach is very flexible and allows us to model a system of particles in motion, possibly in interaction, that can each possibly switch from a motion regime (e.g. Brownian) to another (e.g. a directed motion), along with the appearance over time of new trajectories and their death after some lifetime, all of these features possibly depending on the current spatial configuration of all existing particles. We explain how to specify all characteristics of a BDM model, with many practical examples that are relevant for bioimaging applications. Based on real fluorescence microscopy datasets, we finally calibrate our model to mimic the joint dynamics of Langerin and Rab11 proteins near the plasma membrane. We show that the resulting synthetic sequences exhibit comparable features as those observed in real microscopy image  sequences.\n\n\n\nKeywords:  Simulation and Image Synthesis, Intracellular dynamics and Molecular Motion, Fluorescence Microscopy, Birth-death-move process, Spatial Statistics.\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nA long-term goal in fundamental biology is to decipher\nthe spatio-temporal dynamic coordination and organization of interacting molecules within\nmolecular complexes at the single cell level.\nThis includes the characterization of intracellular dynamics, which is essential to a better understanding of fundamental mechanisms like membrane\ntransport. To that end, dedicated\nimage analysis methods have been developed to process challenging temporal series of\n2D-3D images acquired by fluorescence microscopy, see for instance <cit.>. \n\nIn this context,  mathematical and biophysical models are indispensable  to decode the traffic flows of biomolecules. They constitue crucial prior motion models in most particle tracking procedures <cit.>, and they  are needed to carry out simulations in order to, for instance,  evaluate the performance of image analysis algorithms and train complex models like supervised deep neural networks  <cit.>.\nIn past years, stochastic models for individual trajectories of particles have been introduced, allowing for Brownian, confined or directed motions with variable velocities within the cell \n <cit.>, and possibly supported along a cytoskeleton network <cit.>.\nHowever, these modelling approaches hardly represent the collective motion of particles and\nglobal biomolecule trafficking. The latter should ideally  include possible interactions between biomolecules, in particular between different types of proteins, giving raise to the colocalisation phenomena observed  in several applications <cit.>. \nIt should also be able to generate the lifetime of each trajectory, its spatial distribution and its starting time  during the simulated image sequences.\n\n\nWe propose in this contribution to leverage a tailored  stochastic model introduced  in <cit.>, which is able to generate the aforementioned features. This so-called birth-death-move (BDM) spatial point process is a flexible model for the dynamics of a system of particles (here a group of biomolecules), that move over time, while some new particles may appear in the cell and some existing particles may disappear. \nWe further add the possibility for each particle to be marked by a given label, e.g. among different possible labeled proteins and/or different types of motion regimes, and this mark may change over time, e.g. \n a particle may switch from one regime (e.g. Brownian) to another (e.g. subdiffusive).  This switch of a mark  is sometimes called a “mutation” in the literature, but we prefer here to use the term “transformation” to avoid misunderstanding with a genuine biological mutation. Moreover the trajectories can be driven by any continuous Markov diffusion model, that includes all models  for individual trajectories previously considered in the literature, and some interactions may be introduced so that colocalization phenomena can be generated.  The intensity of births, that govern the waiting time before the next appearance of a new particle, may depend on the current configuration of particles, and similarly for the intensity of deaths. For instance, we may design that the more biomolecules in the cell there are, the higher the death intensity is, implying a rapid  disappearance. Some spatial effects may also be taken into account, in order to create distinct motion regimes in some regions of the cell, or to encourage some spatial regions for the appearance of a new particle, e.g. nearby some existing particles due to colocalization. \n \n \n \n\n\n\n\n\nThe remainder of the paper is organized as follows. In Section <ref>, we give the precise  definition of our stochastic process, and we in particular list all ingredients needed to fully specify the model. An iterative construction  is presented in Section <ref>, clarifying how the dynamics proceeds, and an effective simulation algorithm is formally detailed in the appendix and made available online. In Section <ref>, we provide numerous examples for the specifications of the model, that we think are relevant for many real biomolecules dynamics. \nIn Section <ref>, we demonstrate the potential of our generator by focusing on the joint dynamics of Langerin and Rab11 proteins being involved in membrane trafficking. Our approach starts by the inspection of a real dataset in order to choose and calibrate judiciously the different parameters of the BDM model. This dataset consists of a sequence of images acquired by 3D multi-angle TIRF (total internal reflection fluorescence) microscopy technique <cit.>, depicting the locations of Langerin and Rab11 proteins   close to\nthe plasma membrane of the cell, specifically over a distance of  1 μm in the z-axis. After some post-processing, the sequence shows a set of trajectories for both type of proteins, that follow different motion regimes, are spatially distributed within the cell in a specific way, and occur at different periods during the sequence, which is in perfect line with the dynamics of a BDM process. \nThe observed trajectories for the Langerin channel are depicted on the leftmost plot of Figure <ref>. \n We compute a set of descriptors from this dataset in order to calibrate the parameters of our stochastic process, but also to create some benchmark features for the assessment of our synthetic sequences. Finally, in Section <ref>, we generate several simulated sequences and show that they exhibit comparable features as those observed in the real sequence. An example of generated trajectories is displayed in the rightmost plot of Figure <ref>.\n\nSupplementary materials, including the Python code for simulation, the raw data and some further simulated sequences, are available in our online GitHub repository at <https://github.com/balsollier-lisa/BDM-generator-for-bioimaging>.\n\n\n\n\n\n\n\n§ THE MATHEMATICAL MODEL\n\n\n\n\n §.§ Heuristic and notations\n\nIn order to mimic the dynamics of biomolecules, we consider a multitype birth-death-move process with mutations, denoted by (_t)_t≥0.This process is a generalisation of birth-death-move processes, as introduced in <cit.>. In the following, to avoid misunderstanding we rather use the term “transformation” instead of “mutation”, as explained in Section <ref>. This section describes the spatio-temporal dynamics of (_t)_t≥0 and introduces some notation. \n\n\n\nAt each time t, _t is a collection of particles located in a bounded set Λ of ^d. \nEach particle is assigned a mark that represents a certain feature. We denote by  the collection of possible marks.\nThrough time, the particles move  (possibly depending on their associated mark and  in interaction with each other) and three sudden changes may occur, that we call “jumps”:\n\n\n  * a “birth”: a new particle, assigned with a mark, may appear;\n\n  * a “death”: an existing particle may disappear;\n\n  * a “transformation”: the mark of an existing particle may change.\n\n\n\n\n\nExample: In our biological application treated in Section <ref>, Λ represents a cell in dimension d=2 or d=3. We observe inside this cell two types of particles, associated to Langerin and Rab11 proteins, and  each of them moves according to three different possible regimes: Brownian, superdiffusive or subdiffusive. For this example, each particle is therefore marked out of 6 possibilities, whether it is associated to Langerin (L) or Rab11 (R), and depending on its motion regime (1 to 3), so that ={ (L,1),(L,2),(L,3), (R,1),(R,2),(R,3)}. Through time, each particle moves independently of the others according to its motion regime and eventually a new particle may appear, an existing one may disappear, and the motion regime of some particles may change. \n\n\n\nWe denote by n(_t) the number of particles at time t. Each particle x_i∈_t, for i=1,…,n(_t), is decomposed as x_i=(z_i,m_i) where z_i∈Λ stands for its position while m_i∈ denotes its mark. Accordingly we have _t∈  (Λ×)^n(_t). (Strictly speaking the ordering of particles in _t does not matter,  because  any permutation of particles  leads to the same collection of particles. We choose in this paper to bypass this nuance and use the same notation as if _t was a vector a particles, even it is actually a set of particles.)   Since the number of particles changes over time, the stochastic process (_t)_t≥0 takes its values in the space \n\n    E=⋃_n∈  (Λ×)^n.\n\nTo stress the fact that _t is not a simple value but encodes the positions and marks of a system of particles, we will say that this system at time t is in configuration _t. \n\n\n\nTo fully specify the dynamics of (_t)_t≥ 0, we need the following ingredients: \n \n \n  * A system of equations (Move) that rules the way each particle of _t moves continuously between two jumps. We will typically consider a system of stochastic differential equations acting on the position of each particle, possibly depending on their associated mark and  in interaction with the other particles;\n\n \n  * Three continuous bounded functions β, δ and τ from E to [0,∞), called  birth, death and transformation intensity functions respectively, that govern the waiting times before a new birth, a new death and a new transformation. At each time t, we may interpret β(_t)dt as the probability that a birth occurs in the interval [t, t+dt], given that the system of particles is in the configuration  _t,  and similarly for δ and τ. \n \n \n  * Three transition probability functions that indicate how each jump occurs: \n \n \n  * p^β((z,m)|): probability density function that the birth occurs at the position z with the mark m, given that there is a birth and that the system of particles is in configuration  at the birth time;\n \n  * p^δ(x_i|), for x_i∈: probability that the death concerns the particle x_i in , given that there is a death and that the system of particles is in configuration  at the death time;\n \n  * p^τ((z_i,m_i),m|), for (z_i,m_i)∈: probability that the particle x_i=(z_i,m_i) in  changes its mark and that this transformation leads to the new mark m≠ m_i, given that there is a transformation  and that the system of particles is in configuration  at the transformation time.\n\n \n\n\n\nWe provide in Section <ref> some examples for the choice of these characteristics. \nFinally, we will denote by T_1,T_2,… the jump times of the process and we agree that T_0=0. \n\n\n\n\n\n\n\n\n §.§ Algorithmic construction\n\n\nAssume we are given the characteristics of the process (_t)_t≥ 0 as introduced in the previous section, that are the system of equations (Move), the intensity functions β, δ, τ, and the transition probability functions p^β, p^δ, p^τ. \nThen, starting from an initial configuration _0 at time T_0=0, we  construct iteratively the process in the time interval  [0,T] as follows.  Here we set α=β+δ+τ to be the total intensity of jumps. \n\n    \n  * Generate n(_0) continuous trajectories as solutions of (Move) in the interval [0,T-T_0], given the initial conditions _0. Denote (_t)_t∈[0,T-T_0] these trajectories. \n    \n  * By flipping a coin, test whether the jump time T_1 occurs after T (this is with probability p) or before T (this is with probability 1-p), where\n    \n    p=exp(-∫_0^T-T_0α(_u)d u).\n\n    \n      \n  * If T_1>T, then _t= _t-T_0 for all t∈ [T_0,T], which completes the simulation. \n      \n  * Otherwise, we continue by generating T_1 in [T_0,T] and the associated jump as in the following.\n      \n    \n  * Generate T_1-T_0, given that T_1<T, according to the probability distribution\n    \n    (T_1-T_0<t| T_1<T)=1/1-p(1-exp(-∫_0^t α(_u)d u)),   0<t<T-T_0.\n\nThe process until the time T_1 is then given by the generated trajectories, i.e.\n     \n    (_t)_T_0≤ t< T_1=(_t-T_0)_T_0≤  t< T_1.\n\n     \n   \n  * Draw which kind of jump occurs at T_1 (we denote  by _T_1^- the configuration of the process just before the jump, which is _T_1-T_0 by continuity of (_t)):\n   \n   \n  * this is a birth with probability β(_T_1^-)/ α(_T_1^-); \n   \n  * this is a death with probability δ(_T_1^-)/ α(_T_1^-);\n   \n  * this is a transformation with probability τ(_T_1^-)/ α(_T_1^-).\n   \n   \n     \n   \n    \n  * Generate the jump at t=T_1 to get _T_1 as follows:\n     \n   \n  * if this is a birth, generate the new particle x=(z,m) according to the probability density function p^β((z,m)|_T_1^-). Then set _T_1=_T_1^-∪ (z,m);\n \n  * if this is a death, draw which particle x_i∈_T_1^- to delete according to the probability p^δ(x_i|_T_1^-), for i=1,…,n(_T_1^-). Then  set _T_1=_T_1^-∖ x_i;\n \n  * if this is a transformation, draw which particle x_i=(z_i,m_i)∈_T_1^- is transformed and generate its transformation  according to p^τ((z_i,m_i),m|_T_1^-), for i=1,…,n(_T_1^-). Then  set _T_1=(_T_1^-∖ (z_i,m_i)) ∪ (z_i,m).\n   \n   \n   \n   \n  * Back to step 1 with T_0← T_1 and _0←_T_1 in order to generate the new trajectories starting from _T_1 and the next jump time T_2, and so on. \n\n   \n\n\nIn the first step of the above construction,  the trajectories are generated up to the final time T. It is however very likely that the next jump occurs much before T so that it would be sufficient and computationally more efficient to generate these trajectories on a shorter time interval. We provide in Appendix a formal algorithm of simulation of _t for t∈[0,T], following the above construction and including the latter idea. This algorithm has been implemented in Python and is available in our GitHub repository. \n\nFrom a theoretical side, note that the specific exponential form of the probability distribution of the inter-jump waiting time in step 3 is necessary to imply the interpretation of β, δ and τ explained in the previous section. \nThis exponential form also implies that (_t)_t≥ 0 is a Markov process, meaning that its future dynamics only depends on its present configuration. We refer to <cit.> for more details about these theoretical aspects. \n\n\n\n\n\n §.§ Exemplified specifications of the model\n\n\n\n\n\n  §.§.§ The inter-jumps motion\n\n\nRecall that during an inter-jump period, the process (_t) has a constant cardinality n=n(_t) and the marks of all its particles remain constant. We denote by (_t) a system of n such particles (z_i,t,m_i), for i=1,…,n, where z_i,t∈Λ represents the position of the i-th particle at time t and m_i∈ is its constant mark, that is\n\n    _t=((z_1,t,m_1),⋯,(z_n,t,m_n)).\n\nIn agreement with the construction of the previous section, the inter-jump trajectory of each particle of (_t) will coincide with the n trajectories of (_t) during this period. \n\nAs a general example, we assume that (_t) follows the following system of stochastic differential equation, starting at t=0 at the configuration 𝐲_0∈ (Λ×)^n,\n\n    (Move):  {[ d z_i,t=v_i(t,_t)d t +σ_i(t,_t)d B_i,t,                       t≥ 0,    i=1,…,n,;                                 _0=𝐲_0,                                         ].\n \nwhere the drift functions v_i take their values in ^d,  the diffusion σ_i are non-negative functions, and (B_i,t), i=1,…,n, are n independent standard Brownian motions in ^d. Here,  𝐲_0, v_i and σ_i are free parameters to be chosen. \n\nSome conditions on the drift and diffusion functions are necessary to ensure the existence and unicity of the solution of (Move). This holds  for instance if these functions are Lipschitz <cit.>, a condition met for the following examples. In addition, since each particle is supposed to evolve in the bounded set Λ of ^d, we need in practice to force the trajectories of (Move) to stay in Λ. This may be achieved by reflecting the trajectories at the boundary of Λ. \n\nIn its general form,  (Move) allows the motion of each particle to depend on its mark, but also on the position and mark of the other particles (that are part of  _t). We detail several examples below, that may be realistic for biological applications.\n\n\n\n\n\n\nbrownian Example <ref>(Brownian motions): \n If v_i(t,_t)=0 and σ_i(t,_t)=σ (for σ>0) is constant, then each particle follows a Brownian motion with the same diffusion coefficient σ, independently of the other particles.\n\n\n\nspatial diffusion Example <ref>(spatially varying diffusion coefficients): \n If v_i(t,_t)=0 and σ_i(t,_t)=σ_m_i(z_i,t), where σ_m_i is a positive fonction defined on Λ, then each particle follows an independent diffusive motion, where the diffusive coefficient depends on the associated mark and may vary in space. For instance, assume that Λ=Λ_1∪Λ_2 with Λ_1∩Λ_2=∅ and that  for m∈,\n\n    σ_m(z)=σ_1,m   if    z∈Λ_1, \n    σ_2,m   if    z∈Λ_2,\n\nwhere  σ_1,m>0, σ_2,m>0. Then each particle with mark m follows locally in Λ_1 a Brownian motion with diffusion coefficient \n  σ_1,m and  locally in Λ_2 a Brownian motion with diffusion coefficient \n  σ_2,m. Note that as such, σ_m is not Lipschitz and it needs to be smooth so as to fit the theoretical setting. This may be achieved by taking the convolution of σ_m by a bump function. \n  \n  \n\n\nsuper sub Example <ref>(superdiffusive and subdiffusive motions): \nIf v_i(t,_t)=v_m_i(z_i,t) and σ_i(t,_t)=σ_m_i, where v_m_i is defined on Λ and σ_m_i>0, then each particle evolves independently of each other with a drift and a diffusion coefficient that depend on its mark. This example includes the superdiffusive case considered in \n<cit.> when v_m_i(z)=v_m_i is a constant drift. It also includes the Ornstein-Uhlenbeck dynamics, also considered in <cit.>, when v_m_i(z_i,t)= -λ_m_i(z_i,t-z_i,0), where λ_m_i>0 can be interpreted as a force of attraction towards the initial position z_i,0, leading to a confined trajectory.\n\n\n\ninteracting Example <ref>(interacting particles): \n In this example, we show how we can include interactions between the particles through a Langevin dynamics. To do so, we introduce, for m,m'∈, pairwise interaction functions Φ_m,m', as considered in statistical physics:  For  r>0,  Φ_m,m'(r) represents the pairwise interaction between a particle with mark m and a particle with mark m' at a distance r apart. If Φ_m,m'(r)=0, there is no interaction, if  Φ_m,m'(r)>0 there is inhibition between the two particles at distance r, and if  Φ_m,m'(r)<0 there is attraction. Examples of inhibitive  interaction functions can be found in <cit.>. The (overdamped) Langevin dynamics associated to these interactions reads as (Move) with σ_i(t,_t)=σ_m_i, σ_m_i>0, and \n\n    v_i(t,_t)=-∑_j≠ i∇Φ_m_i,m_j(z_i,t-z_j,t),\n\nwhere ∇ denotes the Gradient operator. \nAccordingly, each particle moves in a direction that tend to decrease the value of the pairwise interaction function with the other particles. \n\n\n\n\ncoloc move Example <ref>(colocalized particles): \nAssume that some particles, say with mark m, are thought to be  colocalized with particles having the mark m̃. This means that we expect the former to be localised nearby the latter and to follow approximately the same motion. Specifically, to let the particle i with mark m be colocalized with the particle j with mark m̃, we may simply define z_i,t=z_j,t+σ_i B_i,t, t>0,  where B_i,t is a standard Brownian motion in ^d representing the deviation of the trajectory  i around the trajectory  j, and σ_i>0 quantifies the strength of this deviation. Here z_j,t may be defined as in the previous examples, for instance as the typical trajectory of a particle with mark m̃.  \n\n\n\n\n  §.§.§ The intensity functions\n\n\nRecall that the intensity functions β, δ and τ rule the waiting times until the next birth, death and transformation, respectively. Heuristically, the probability that a birth occurs in the time interval [t,t+dt] given that the particles are in configuration _t is β(_t)dt, and similarly for δ and τ. \nAs a consequence these probabilities may evolve over time according to the configuration of particles, making for instance a death more likely to happen when there are many particles or a high concentration of them in some  region, due to competition. We provide some natural examples below. For each example, any of β, δ or τ can be set similarly, even if we focus only on one of them.\n\n\n\nconstant intensity Example <ref>(constant intensities): \nThe simplest situation is when the intensity functions are constant, for instance β(_t)=β with β>0. Then births appear at a constant rate and we can expect that in average β×(s-t) new particles appear during the interval [s,t]. \n\n\n\n\ncardinality intensity Example <ref>(intensities depending on the cardinality): \nIf δ(_t)=δ n(_t), with δ>0, then the more particles there are, the more deaths we observe. This is a natural situation when each particle is thought to have a constant death rate δ, so that the total death intensity for the system of particles at time t is just the sum of them, that is  δ n(_t). \n\n\n\nspatial intensity Example <ref>(spatially varying intensities): \nAssume that the mark of a particle (say its motion regime) has more chance to change in some region of Λ than another, then the transformation intensity τ may reflect this dependency. Let for instance Λ=Λ_1∪Λ_2 with Λ_1∩Λ_2=∅ and define τ(_t)=τ_1 n_1(_t) + τ_2 n_2(_t) where τ_1<τ_2 and n_1(_t) (resp. n_2(_t)) denotes the number of particles in Λ_1 (resp. in Λ_2). Then for a given cardinality n(_t), the more proportion of particles  in Λ_2, the more transformations happen. Note that in order to be rigorous, we should consider a continuous version of τ, which can be achieved by convolution with a bump function. \n\n\n\n\ncoloc intensity Example <ref>(transformation due to colocalization): \nAssume that some m-particles (that are the particles with mark m) can be colocalized with some m̃-particles. Assume in addition that the particles are assigned a second mark  that encodes their motion regime (e.g. diffuse, subdiffusive or superdiffusive). Eventually, during the dynamics of particles,  a  non-colocolized m-particle may become colocolized with a m̃-particle, meaning that it becomes D-close to a m̃-particle, where D is some prescribed colocalization distance. If so, we may expect that the motion regime of the m-particle becomes similar as the m̃-particle, so that a transformation must occur. Let n_D,m,m̃(_t) be the number of D-close pairs of particles with marks m and m̃, whose motion regimes are different. Then we may define τ(_t)=τ n_D,m,m̃(_t), for some τ>0, so that a transformation (of motion regime here) is very likely to occur when the aforementioned situation happen. Note that  if τ is large, such transformation will quickly happen as soon as n_D,m,m̃(_t)=1, and so n_D,m,m̃(_t)>1 will be unlikely to be observed. Here again a smooth version of τ can be introduced by convolution to ensure its continuity. \n\n\n\n\n\n\n\n  §.§.§ The transition probability functions\n\n\nWe detail examples for the three possible transitions, in order below: births, deaths and transformations. \n\nFor the births, remember that p^β((z,m)|) denotes the probability density function (pdf) that a particle appears at the position z with the mark m, given that the system of particles are in configuration . To set this probability, two approaches are possible: \n\n\n  * First drawing the mark m of the new particle with respect to some probability p^β(m|), then the position of the new particle given its mark according to some pdf p^β(z|,m). This leads to the decomposition p^β((z,m)|)=p^β(m|)p^β(z|,m).\n\n  * First generating the position of the new particle with respect to some pdf p^β(z|), then its mark m given the position with probability p^β(m|,z). This leads to the decomposition p^β((z,m)|)=p^β(z|)p^β(m|,z).\n\n\n\n\n\nunif births Example <ref>(uniform births): \n This is the simple example where the births do not depend on the environment, are uniform in space and the marks are drawn with respect to some prescribed probabilities p_m, where ∑_m∈ p_m=1. The two above approaches then coincide with p^β(m|)=p^β(m|,z)=p_m\n and p^β(z|,m)= p^β(z|) = 1/|Λ| for z∈Λ.\n\n\n\n\ncoloc births Example <ref>(colocalized births): \n We adopt here the first approach above. We first draw the marks independently of the environment by setting p^β(m|)=p_m with ∑_m∈ p_m=1, as in the previous example. Second, in order to generate the position of a new m-particle, thought to be colocalized with the m̃-particles, we may use a mixture of isotropic normal distribution, centered at each m̃-particle, with deviation σ>0. Denoting by ñ() the number of m̃-particles in  and z̃_i their positions (i=1,…,ñ()), this means that \n\n    p^β(z|,m)= 1/ñ()∑_i=1^ñ()1/(σ√(2π))^dexp(-z-z̃_i/2σ^2).\n\nNote that to be rigorous p^β(z|,m) should be restricted to Λ with a proper normalisation, otherwise some particles might be generated outside Λ. We omit these details. \n\n\n\n\nspatial births Example <ref>(spatially dependent new marks): \n We may adopt the second approach by first generating a uniform position for the new particle, i.e. p^β(z|)= 1/|Λ| for z∈Λ, and second by drawing the mark according to the generated position. Let for instance Λ=Λ_1∪Λ_2 with Λ_1∩Λ_2=∅ and set \n\n    p^β(m|,z)= p_1,m   if    z∈Λ_1, \n     p_2,m   if    z∈Λ_2,\n\nwhere ∑_m∈ p_1,m=∑_m∈ p_2,m=1. Then depending on the position, the distribution of the marks may be different. \n\n\n\nWe  now focus on the death transition, namely  the probability p^δ(x_i|), for x_i∈,  that the particle x_i in  disappears when there is a death. \n\n\n\nunif deaths Example <ref>(uniform deaths): \nThe simplest example is when a death occurs uniformly over the existing particles, that is p^δ(x_i|)=1/n() for i=1,…,n().\n\n\n\n\ncompetition deaths Example <ref>(deaths due to competition): \nWe may imagine that, due to competition,  a particle is more likely to disappear if there are too many neighbours around it. Let n_D(x_i) be the number of neighbouring particles around x_i within distance D>0. To take into account the competition at distance D>0, we may define p^δ(x_i|)=n_D(x_i)/∑_j=1^n() n_D(x_j). Similarly, if relevant, we may count the number of neighbours of a certain mark only. \n\n\n\n\n\nFinally, we focus on p^τ((z_i,m_i),m|), for (z_i,m_i)∈, which is the probability that the particle x_i=(z_i,m_i) in  changes its mark from m_i to m≠ m_i,  when a transformation happens. Similarly as for the birth transition probability, it is natural to decompose this probability as \n\n    p^τ((z_i,m_i),m|)=p^τ((z_i,m_i)|)p^τ(m|,(z_i,m_i)),\n \nwhere p^τ((z_i,m_i)|) represents the probability to choose the particle (z_i,m_i) in the configuration  , in order to change its mark, and p^τ(m|,(z_i,m_i)) is the probability to choose the new mark m given that the transformed particle is located at z_i with mark m_i.\n\n\n\nindep transfo Example <ref>(transformations independent on the environment): \nA typical situation is when the particle to transform is drawn uniformly over the existing particles, that is p^τ((z_i,m_i)|)=1/n(), and the transformation is carried out independently on the environment, according to a transition matrix with entries p_m,m'≥ 0, m,m'∈, representing the probability to be transformed from mark m to mark m'. Here, for all m∈, we assume p_m,m=0 in order to ensure a genuine transformation, and of course ∑_m'∈p_m,m'=1. With this formalism, we thus have p^τ(m|,(z_i,m_i))=p_m_i,m. \n\n\n\n\nspatial transfo Example <ref>(spatially dependent transformations): \nTo make the previous example spatially dependent,\nintroduce p_m(z), a pdf in Λ representing the locations in Λ where a particle with mark m is more or less likely to be transformed. Then we may set \n\n    p^τ((z_i,m_i)|)=n_i()/n()p_m_i(z_i)/∑_j=1^n_i() p_m_i(z_j^(m_i)) ,\n \nwhere n_i() denotes the number of particles with marks m_i in  and z_j^(m_i), j=1,…,n_i(), their positions. In this expression n_i()/n() is a weight accounting for the prevalence of mark m_i in  and the sum in the denominator is a normalisation so that the probabilities sum to 1. Note that if p_m(z) is the uniform pdf on Λ, then we recover the uniform distribution p^τ((z_i,m_i)|)=1/n(). Furthermore, once the particle is chosen as above, we may apply a spatially dependent transformation as follows. Let  Λ=Λ_1∪Λ_2 with Λ_1∩Λ_2=∅ and let two different transition matrices with respective entries p^(1)_m,m' and p^(2)_m,m', for m,m'∈. Then we may set\n \n    p^τ(m|,(z_i,m_i))= p^(1)_m_i,m   if    z_i∈Λ_1, \n      p^(2)_m_i,m   if    z_i∈Λ_2.\n\nAccordingly, the transformation does not follow the same distribution,  whether the chosen particle to be transformed is located in Λ_1 or Λ_2.\n\n\n\n\ncoloc transfo Example <ref>(transformation due to colocalization): \nAssume that we are in the same situation as in Example <ref> where m-particles can be colocalized to m̃-particles. We assume like in this example that a transformation occurs if n_D,m,m̃(_t)≥ 1, where n_D,m,m̃(_t) denotes  the number of D-close pairs of particles with marks m and m̃, whose motion regimes are different. Then, when a transformation happens, we may choose the m-particle to be transformed uniformly over those m-particles that are D-close to a m̃-particle with a different motion regime. Then the transformation makes the motion regime of the selected m-particle similar as the motion regime of its closest m̃-particle. \n\n\n\n\n\n\n\n\n\n§ APPLICATION TO THE JOINT DYNAMICS OF LANGERIN/RAB11 PROTEINS\n\n\n\n §.§ Description of the dataset\n\n\n\n\nThe dataset we consider comes from the observation by a 3D multi-angle TIRF (total internal reflection fluorescence) microscopy technique  of the intracellular trafficking of\nm-Cherry Langerin and GFP Rab11 proteins in a RPE1 living cell <cit.>, specifically projected along the z-axis onto the 2D plane close to the plasma membrane.  This provides a 2D image sequence of 1199 frames, each lasting 140 ms and showing the simultaneous locations of the two types of proteins. The two images at the top of Figure <ref> depict the first frame of the raw sequence for the Langerin fluorescent channel and the Rab11 fluorescent channel, respectively, recorded simultaneously using a dual-view optical device.  Note that the cell adheres on a fibronectin micropattern, which constrains intracellular constituents such as cytoskeleton elements and gives a reproducible shape, explaining the “umbrella” shape of the cell. \nThese raw sequences are post-processed following <cit.>, then each bright spot is represented by a single point, and we apply the  U-track algorithm <cit.> to estimate particle trajectories. The bottom images of Figure <ref> show the  resulting  trajectories for the  Langerin channel and the Rab11 channel, respectively. These trajectories have been further analysed by the method developed in <cit.> to classify them into three diffusion regimes: Brownian, superdiffusive and subdiffusive, which corresponds to the blue, red and green colors, respectively,  in Figure <ref>.\n\n\n\n\n\nTo be more specific in the analysis of all trajectories, we fit three parametric models to each of them, following <cit.>, depending on their regime:\n\n\n  * For a Brownian regime (in blue): a Brownian motion, \n\n  * for a superdiffusive regime (in red): a Brownian motion with constant drift,\n\n  * for a subdiffusive regime (in green): an Ornstein-Uhlenbeck process. \n\n Each trajectory has its individual parameters (see Examples <ref> and <ref>), estimated by maximum likelihood. Furthermore, some trajectories may change from one regime to another, which corresponds  to a “transformation” in the BDM model that will be specified in the next section. \n\nFigure <ref> summarises different features of the obtained trajectories for the Langerin sequence (the same characteristics have been analysed for the Rab11 sequence, but are not detailed here). \nThe histograms at the bottom display the duration of all trajectories (in frames), according to their regime. We can observe that the (blue) Brownian  and (red) superdiffusive trajectories have quite a short lifetime in average, in comparison with the subdiffusive trajectories (in green). The top-right boxplots represent the distribution of the number of particles per frame, according to their regime: there is a majority of Brownian motions, followed by subdiffusive motions and a minority of superdiffusive motions. Finally, \nthe top-left circular histogram aims at depicting the orientation of the drift vectors for the superdiffusive (red) trajectories. Specifically, for this plot, we have recorded the deviation of the drift angle (in degrees) with respect to the direction towards the center of the cell. For instance this deviation is 0^∘ if the drift goes towards the center, and 180^∘ if it goes in the opposite direction. It appears from this plot that most deviation angles are around 0^∘ or  180^∘, meaning that the red trajectories mainly move in a radial direction going to (or starting from) the center of the cell.  \n\n\n\n\nThe above descriptors will be helpful to calibrate the parameters of the BDM model in the next section and they will also serve as benchmarks to evaluate the quality of our simulations. However it is important to keep in mind that they come with some approximations and errors induced by imperfect tracking algorithms. In particular, no trajectory can last less than 10 frames in the data, which is a minimal length of detection for our tracking method. It is also clear in the bottom plots of Figure <ref>, that some directed (superdiffusive) trajectories appear wrongly in blue, which can be explained by the multiple testing procedure of <cit.> that aims at minimizing the number of false positives (that are bad green or bad red trajectories) to the detriment of possibly too many false negatives (that are wrong blue trajectories). \n\n\n\nConcerning the births and deaths of trajectories, we summarize in Table <ref> their total numbers observed in the real-dataset, according to the type of proteins and motion regime. The number of regime transformations is in turn given in Table <ref> for the Langerin proteins. For the Rab11 proteins, only one switching from a Brownian motion to a subdiffusive motion was observed during the sequence. \n \n \n\n\n\n\n\n\n\nTo address in detail these jumps dynamics, we leverage the study carried out for the same dataset in <cit.>, where it has been concluded that for each type of proteins and motion regimes, the birth intensity is constant, like in Example <ref>, while the death intensity is proportional to the number of existing particles, like in  Example <ref>. Given the small number of observed motion regime transformations,  its intensity can also be considered as constant. Concerning the transition probability functions, the deaths occur uniformly over all existing particles, like in Example <ref>. As to the birth transition, there is no reason to choose another density than the uniform distribution over the cell for the Rab11 proteins (Example <ref>). But due to colocalization (as observed for this dataset in <cit.>), the birth density for the Langerin positive structures can be approximated by a mixture between a uniform distribution, for 93% of the Langerin births, and a colocalized density around the existing Rab11 vesicles, like in Example <ref>, for 7% of the Langerin births. These proportions, along with the other parameters, have been estimated by maximum likelihood. \n\n\n\n\n\n §.§ Simulation of synthetic sequences\n\n\n\n\n  §.§.§ Model parameters setting\n\nBased on the data analysis of the previous section, we are now in position to specify all characteristics of the BDM process with transformations presented in Section <ref>, so as to mimic the joint dynamics of Langerin/Rab11 proteins within a cell. \nTo make the connection with the theoretical notation, the region of interest Λ represents the cell in dimension d=2. Each particle in Λ will be marked by a label from the set \n={ (L,1),(L,2),(L,3), (R,1),(R,2),(R,3)}, where L stands for the Langerin proteins, R for the Rab11 proteins, and the number 1,2 or 3 indicates the motion regime of the particle: Brownian, superdiffusive or subdiffusive, respectively. \n\nConcerning the motion of each trajectory, it follows the regime indicated by its mark and is in agreement with the observed trajectories from the real-dataset detailed in the previous section, see also Examples <ref> and <ref>:\n\n \n  * For a Brownian motion, we draw the diffusion coefficient according to the empirical distribution of the diffusion coefficients estimated from the Brownian motions of the real-dataset, for the same type of proteins (L or R);\n \n  * For a superdiffusive motion, we generate a Brownian motion with constant drift, with the same strategy for the choice of the diffusion coefficient, and where the drift vector is chosen as follows: it is by default oriented towards the center of the cell, this orientation being subjected to a deviation drawn from the empirical distribution depicted in the top-left circular histogram of Figure <ref>. In addition, its norm is drawn from the empirical distribution of the drift norms observed from the real-dataset. Here again, each set of parameters is distinct for the Langerin and Rab11 proteins;\n \n  * For a subdiffusive motion, we generate an Ornstein-Uhlenbeck process with diffusion coefficient 0.4 for all particles (which is the average from the real-dataset), and parameter λ=5.96 for the Langerin proteins, and λ=7.41 for the Rab11 proteins. \n\nIn these values, the unit is pixels, and one pixel is 160× 160 nm^2 in our images. \n\n\n\nConcerning the intensity functions, we set the birth intensity and the transformation intensity to constant values, as concluded from the real-data analysis. In agreement with Table <ref>,  the total birth intensity can be estimated by β()=1248/167.86=7.43, whatever the configuration  of particles is, because 1248 is the total number of observed births and 167.86 is the total time length of the sequence (in seconds). Similarly we set τ()=16/167.86=0.095 since 16 transformations have been observed in the real sequence. For the death intensity, for each mark m∈, we let it proportional to the number of particles, that is δ_m n_m(), where n_m() is the number of particles with mark m in the configuration  and δ_m has been estimated from the real-dataset as follows: \n    δ_m = 0.17 if m=(L,1), \n    δ_m =0.14 if m=(L,2),\n    δ_m =0.07 if m=(L,3), \n    δ_m =0.21 if m=(R,1),\n    δ_m =0.25 if m=(R,2),\nand     δ_m =0.08 if m=(R,3). The total death intensity for the configuration  of particles is then δ()=∑_m∈δ_m n_m().\n\nFinally we set the transition probability functions as follows. For the death transition, the probability to kill the particle x_i=(z_i,m_i) in the configuration   is set to \n\n    p^δ((z_i,m_i)|)=δ_m_i/δ(),\n\nwhich means that we first draw the mark m with probability δ_m n_m() /δ() and then the particle uniformly among all existing particles with mark m. For the transformation transition, we first select the type of proteins to transform with probability 15/16 for Langerin and 1/16 for Rab11, in line with the transformations rates observed in the real-sequence, second we choose a particle uniformly among all existing particles of this type, and third, as in Example <ref>, we apply a regime transformation with respect to the following transition matrix (from the regime in rows to the regime in columns):\n\n    1   2   3 \n    1     0    1/4   3/4  \n    2     1/2   0     1/2 \n    3     1     0   0 .\n\nThis matrix is in agreement with Table <ref> concerning the Langerin proteins, where we have added some possible transitions from regime 1 to 2, and from regime 2 to 1, that appear to us likely to occur, even if they were not observed in the (quite rare) transformations in the real-sequence. The same transition matrix has been set for the Rab11 proteins, since there is not enough observed transformations in the real-sequence (only one) to design a finer choice. \n\nIt remains to set the birth transition probability. First, we select the type of protein to create with probability 747/1248 for the Langerin proteins and 501/1248 for the Rab11 proteins, following  Table <ref>. If the selected type is Rab11, then it is generated uniformly in the cell with regime 1 with probability 0.784, 2 with probability 0.048 and 3 with probability 0.168, which corresponds to the relative proportion of births of each regime over all births for the real Rab11 sequence. If the selected type is Langerin, then we flip a coin for colocalization with probability p=0.07. If there is no colocalization, then the new Langerin protein is generated uniformly in the cell with \n\nregime 1 with probability 0.807, 2 with probability 0.104\nand 3 with probability 0.088 (the observed relative proportions of births). If there is colocalization, then the new Langerin protein is generated around an existing Rab11 protein according to the density (<ref>) in Example <ref>, where by maximum likelihood estimation σ=1.1. In this case, the regime of the new Langerin protein and its drift vector for a superdiffusive motion are similar as the those of its colocalized Rab11 protein. \n\n\n\n\n\n  §.§.§ Analysis of resulting simulations\n\n\n\nWe have generated 100 sequences following the model of the previous section, during the same time length as the real-sequence of Section <ref>, that is 167.86s for 1199 frames.  Some descriptors concerning the generated Langerin trajectories coming from two simulated sequences are depicted in Figures <ref> and <ref>, that are to be compared with the similar outputs of  the real-data in Figures <ref> and <ref>. The results for other simulated sequences can be seen in our GitHub repository. We have also summarized the mean number of births and deaths over the 100 simulated sequences in Table <ref>, to be compared with Table <ref>.  \nBoth graphical and quantitative results demonstrate that our generator is able to create a joint dynamics with comparable features as those observed in the real-data sequence. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION AND PERSPECTIVES\n\n\nWe have leveraged an original stochastic model, namely a multitype birth-death-move process with transformations, in order to generate realistic image sequences of biomolecules dynamics within a cell. \nThis stochastic process not only models the individual trajectory of particles, but it is also able to generate the appearance (i.e., birth), disappearance (i.e., death) and regime switching (i.e., transformation) of each trajectory over time, the occurence of which possibly depending on the configuration of the existing particles (e.g. their numbers). The model is very flexible and is specified thanks to three sets of parameters: 1) a system describing the set of trajectories (typically a system of stochastic differential equations); 2) the intensity functions, ruling the waiting time before a new appearance, a disappearance or a switching; 3) the transition probability functions, driving where a new particle appears when there is a birth, which particle disappears when there is a death, and which particle switches its regime (and how) when there is a transformation. Numerous examples of these model specifications have been detailed. We demonstrated the relevance of this approach by generating realistic image sequences of the joint dynamics of  Langerin/Rab11 proteins within a cell, based on a preliminary data-based analysis in order to finely calibrate the model.\n\nSince the model is very flexible, an important step is the choice of model characteristics and parameters. In order to improve our approach, a deeper empirical study based from many image sequences might help calibrating robustly the model.  Once the parameters are fitted, the generation of an image sequence is quite fast: about one minute on an regular laptop for the generation of 2000 frames containing each about 70 trajectories in interaction. In an effort to generate even more realistic image sequences, we may consider to blur the system of generated particles using the point spread function, and to add some noise and background. In relation, additional features could be computed from both the real-image sequence and the synthetic ones in order to strengthen the quality assessment  of the generator. \n\n\n\n\n§ APPENDIX: ALGORITHM FOR SIMULATION\n\n\n\nWe provide in this appendix a formal algorithm to simulate a birth-death-move process with mutations (or transformations), following the construction of Section <ref>. It is a refinement of the algorithm introduced in <cit.> for a birth-death-move process (without transformations). \nThe idea is to generate the inter-jump move on a small time length Δ, then to test whether a jump has occurred during this period (this is with probability p in the following Algorithm <ref>). If so, we generate the jump time and the jump. If not, we continue the simulation of the inter-jump move on a further time length Δ,  test whether a jump has occurred, and so on. The algorithm is valid  whatever Δ>0 is, but an efficient choice is to  set a small value for Δ. Its implementation is available in our GitHub repository. \n\n We let as in Section <ref> α=β+δ+τ and T_0=0. We denote in Algorithm <ref> _T_j^- the configuration just before the jump time T_j.\nIn order to run Algorithms <ref> and <ref>, we need the following inputs:\n\n\n  * T>0: final time of simulation;\n\n\n  * _0∈ E: initial configuration of particles;\n\n\n  * Δ>0: small time length for piecewise simulation;\n\n\n  * β, δ, τ: intensity functions of births, deaths and transformations;\n\n\n  * p^β, p^δ, p^τ: transition probability for a birth, a death and a transformation;\n\n\n  * Algo.Move(𝐲_0,Δ): algorithm that returns, for 𝐲_0∈ E and Δ>0,  n(𝐲_0)  trajectories on [0,Δ] following the system of SDEs (Move) with initial configuration 𝐲_0.\n\n\n\n\n\n\n\n\n  \n  \n  \n acm \n\n\n\n"}