{"entry_id": "http://arxiv.org/abs/2303.06950v1", "published": "20230313093519", "title": "Reconfigurable Distributed Antennas and Reflecting Surface (RDARS): A New Architecture for Wireless Communications", "authors": ["Chengzhi Ma", "Xi Yang", "Jintao Wang", "Guanghua Yang", "Shaodan Ma"], "primary_category": "cs.IT", "categories": ["cs.IT", "eess.SP", "math.IT"], "text": "\n\n    \n\n\n\n\n\n\n\n\nReconfigurable Distributed Antennas and Reflecting Surface (RDARS): A New Architecture for Wireless Communications \n    Chengzhi Ma,\n        Xi Yang,\n        Jintao Wang,\n        Guanghua Yang,\n        and Shaodan Ma, Senior Member, IEEE\n        \nC. Ma, J. Wang and S. Ma are with the State Key Laboratory of Internet of Things for Smart City and the Department\nof Electrical and Computer Engineering, University of Macau, Macao SAR, China (e-mails: yc07499@um.edu.mo; \nwang.jintao@connect.um.edu.mo;\nshaodanma@um.edu.mo).\nX. Yang is with the Shanghai Key Laboratory of Multidimensional Information Processing, East China Normal University, Shanghai 200241, China (e-mail: xyang@cee.ecnu.edu.cn).\nG. Yang is with the School of Intelligent Systems Science and Engineering and GBA and B&R International Joint Research Center for Smart Logistics, Jinan University, Zhuhai 519070, China (e-mail: ghyang@jnu.edu.cn).\n\n    \n============================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\nReconfigurable intelligent surfaces (RISs) have drawn much attention recently for their appealing advantages in shaping wireless channels to improve the spectral and energy efficiencies of wireless communications. However, conventional fully-passive RISs generally suffer from the so-called “multiplicative fading” effect and necessitate a large number of passive reflecting units to provide satisfying performance, which thereby limits RISs' practicability and manufacturability. In this paper, a novel architecture of “Reconfigurable Distributed Antennas and Reflecting Surfaces (RDARS)” is first proposed to overcome this limitation from the “multiplicative fading” effect. Specifically, unlike existing active RIS variants, \n\nRDARS inherits the low-cost and low-energy-consumption benefits of fully-passive RISs by default configuring all the elements as passive to perform the reflection mode. On the other hand, based on the design of the additional direct-through state,\n\nany element of the RDARS can be dynamically programmed to connect with the base station (BS) via fibers and perform the connected mode as remote distributed antennas of the BS to receive signals. Consequently, \n\na controllable trade-off between the reflection gain and the distribution gain can be achieved via RDARS at the BS. To unveil the system behavior of the RDARS-aided system, we analyze the received signal-to-noise ratio (SNR) under maximum ratio combining (MRC) at BS.\n\nClosed-form outage probability and ergodic achievable rate are also provided and are verified through extensive simulations. To demonstrate the superiority of the proposed RDARS, we further compare the performance of RDARS with the fully-passive RIS-aided systems under different system settings, and experiments are carried out using a prototype of RDARS with a total number of 256 elements. Experiment results revealed that, compared to the fully-passive RIS,\n\nan extra 76% throughput improvement could be achieved by deploying RDARS with only three elements performing connected mode. This thus confirms the effectiveness of the proposed RDARS and envisions it as a promising candidate for future 6G wireless systems.  \n\n\n\n\nReconfigurable distributed antennas and reflecting surfaces (RDARS), reconfigurable intelligent surfaces (RIS), distributed antenna systems (DAS), outage probability, ergodic achievable rate.\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n    \n    The development of 5G cellular systems accelerates the invention of new technologies to meet high-demand communications needs, including massive multiple-input multiple-out (massive MIMO), ultra-dense network (UDN), and millimeter wave (mmWave) communication, to name a few<cit.>. The success of 5G commercial deployment has motivated both industry and academia to look for new disruptive technologies to achieve unprecedented requirements aiming at ubiquitous coverage, ultra high-rate throughput, and so on <cit.>. To accomplish these ambitious goals, reconfigurable intelligent surface (RIS), also known as intelligent reflecting surface (IRS), has been proposed as a promising technology to extend the coverage while maintaining a low cost and energy consumption for improving spectrum efficiency (SE) and energy efficiency (EE) of the communication network <cit.>. Specifically, RIS is a planar array that is composed of a large number of passive elements, where each of them imposes an independent phase shift on the incident signals. By smartly tuning the phase shifts, the wireless propagation environment becomes controllable and programmable, which thus provides an extra degree of freedom to optimize communication performance. \n    Thanks to the above advantages, RIS has been widely investigated w.r.t. its fundamental performance limits <cit.>, channel modeling <cit.> as well as prototype implementation <cit.>. In particular, in <cit.>, the joint active and passive beamforming design for a RIS-aided system is proposed, and the asymptotic performance of RIS passive beamforming with an infinitely large number of reflecting elements is presented, where the \"squared power gain\" brought by deploying RIS is unveiled. Also, it is shown that even with discrete phase shifts, through proper optimization, the RIS is still capable of boosting system performance<cit.>.\n    Moreover, as demonstrated in <cit.>, 26 dB power gain is introduced by the RIS prototype with 1100 elements working at 5.8 GHz. Though RIS has revealed its ability to extend the coverage area by creating an extra link between the source-destination when the direct link is blocked. A large number of reflecting elements is generally needed for RIS to achieve the same performance even with ideal phase-shifting as compared to other technologies, e.g., decode-and-forward (DF) relaying <cit.>. The reason lies in the fact that the channel gain of the RIS reflective link suffers from the “multiplicative fading” effect, i.e., the equivalent channel gain of the transmitter-RIS-receiver link is the product of the transmitter-RIS and RIS-receiver channel gains <cit.>. Therefore, the path loss over the RIS reflective link may be high due to the \"multiplicative fading\", which limits the practical contribution of RIS. Moreover, the fully passive nature of conventional RIS imposes challenges in channel estimations since the number of channel coefficients to be estimated scales linearly with the product of the numbers of antennas at the BS, UE and the elements on RIS <cit.>. Even with the proper design of the channel estimation schemes and leveraging the channel characteristics, e.g., sparsity, the pilot overhead is still large and becomes unaffordable when deploying a large number of passive elements for performance enhancement<cit.>. To overcome these challenges, several variants of RIS architectures are proposed, namely, active RIS, hybrid relay-reflecting intelligent surface (HR-RIS), and so on <cit.>. In particular, different from fully-passive RIS, the elements of active RIS are integrated with amplifiers to amplify the incident signal. Instead of enabling all the elements with the capability to amplify the signal, the HR-RIS proposed replacing only a few passive elements with active ones to relay the signal. To some extent, these variants can partially compensate for the “multiplicative fading” effect by introducing active elements for amplifying or relaying. However, they also introduce additional power consumption and require a much more complicated implementation of the surface. Moreover, the practicability and manufacturability of these variants are still debatable.\n\n    To amend the aforementioned limitations of fully-passive RIS while maintaining its appealing advantages, we start to think outside the box and revisit the successful technologies proposed in communication society in the past to gain inspiration. While RIS is recognized as a promising technology to combat signal blockages and extend the coverage area, the effort toward dealing with coverage problems is not new. Among all of them, one of the successful and revolutionary examples is the Distributed Antenna System (DAS) <cit.>. In DAS, instead of deploying co-located antennas in the base station (BS), antenna modules are geographically distributed and connected to a central processor by fiber or coaxial cable.[Here, antenna modules refer to entities with sophisticated signal processing capabilities and energy-demanding components, e.g., RF chains and power amplifiers.  ] In this way, DAS enables the efficient utilization of space resources by potentially shorting the distance between BS and users and also providing extra spatial diversity. Though the original DAS is introduced to cover the blind spots in wireless communications <cit.>, studies have also identified its potential in improving system energy efficiency and system capacity <cit.>. However, to acquire a satisfactory distributed antenna gain with DAS, many distributed antenna modules should be well allocated in the entire cell, and large antenna arrays are preferred to be deployed in each module to obtain sufficient antenna gain and alleviate interference. This undoubtedly introduces tremendous hardware cost and energy consumption, thus limiting its applications.\n\n    Motivated by DAS, a natural question arises: \n    Can we introduce the concepts of DAS into the current passive RIS architecture to boost the system performance while still maintaining RIS's low-cost and low-energy consumption advantages?\n    In this paper, we propose, for the first time, a novel “Reconfigurable Distributed Antennas and Reflecting Surfaces (RDARS),”  and present both theoretical analysis and experiment results to answer this question. \n    The main contributions of this paper can be summarized as follows:\n        \n            \n  * We propose a novel RDARS architecture, which preserves the appealing advantages of both DAS and the fully-passive RIS. Specifically, each element of RDARS can be dynamically programmed to perform either two modes, i.e., reflect signals as a conventional fully-passive RIS element under reflection mode or perform as a remote antenna for BS to receive signals under connected mode. By introducing the connected mode, the “multiplicative fading” effect in conventional RIS-aided systems can be well compensated without extra power and hardware complexity for amplifying or relaying at the surface. Moreover, a controllable trade-off between the reflection gain and the distribution gain can be achieved via RDARS at the BS.\n            \n            \n  * We analyze the performance of the RDARS-aided system under MRC. Closed-form expressions for bounds of ergodic achievable rate and outage probability are provided. Besides, by setting all elements at RDARS as reflection mode or connected mode, existing results for fully-passive RIS-aided systems or DAS consisting of two distributed antenna sets can be regarded as special cases of our proposed RDARS-aided system.    \n            \n            \n  * We investigate the impacts of the number of elements performing different modes and the deployment location of RDARS on its performance. Furthermore, to unveil the superiority of the proposed RDARS, we compare the outage probability and the ergodic achievable rate of RDARS with the fully-passive RIS under various scenarios via extensive simulation results.\n            \n            \n  * We conduct practical experiments to compare the performance of the proposed RDARS and the passive RIS (with all the elements on RDARS performing reflection mode) by establishing an RDARS-aided communication system prototype. The experiment results demonstrate the superiority of the proposed RDARS in terms of performance gain and manufacturability.   \n        \n        \n    The rest of the paper is orginized as follows. In Section II and In Section III, we propose the idea of the RDARS architecture and the system model of the RDARS-aided system. Then the performance of RDARS-aided system is analyzed in Section IV. Simulation results are given in Section V, followed by experimental results in Section VI. Further discussion and conclusion are drawn in Section VII and VIII.\n    \n    Notations: Throughout the paper, numbers, vectors, and matrices are denoted by lower-case, bold-face lower-case, and bold-face upper-case letters, respectively. (·)^T, (·)^H denote the transpose and conjugate transpose of a matrix or vector. diag(𝐯) denotes a diagonal matrix with each diagonal element being the corresponding element in 𝐯. Furthermore, |·| denotes modulus of complex number, and 𝔼[·] represent the expected value of a random variable.\n    \n\n\n\n§ PROPOSED RDARS\n\n\n    The architecture of the RDARS-aided system is presented in Fig. 1. The total number of elements in RDARS is N, and each element can switch between two modes, namely, the reflection mode and the connected mode. The RDARS controller can dynamically configure the specific mode of each element. When working under reflection mode, the elements work as passive reflecting units similar to the elements in fully-passive RIS. When working under connected mode, the elements act as a remote antenna connected to the BS via dedicated wires or fibers and can receive the incoming wireless signal. Denote the number of elements working on connected mode as a. Then, for a = 0, the RDARS-aided system becomes a fully-passive RIS-aided system; for a = N, the RDARS-aided system can be interpreted as a DAS which has two distributed antenna sets, and one set has N antennas located at a remote place while the other set of antennas is deployed at the BS <cit.>. To maintain the appealing advantages of fully-passive RIS, we only consider the case where the number of elements performing connected mode is very small, i.e., a << N.\n\n    To better characterize the configuration of this architecture, we introduce a diagonal indicating matrix 𝐀, i.e., 𝐀 is a diagonal matrix with element 𝐀(i,i) ∈{0,1}. Specifically, 𝐀(i,i) = 1 means the i^th element works at connected mode, while 𝐀(j,j) = 0 indicates that the j^th element operates at reflection mode, i.e., the j^th element can only alter the phase of incoming signals.\n    Let 𝐯 = [v_1, ⋯, v_N] denote the RDARS reflection-coefficient vector where  v_i = e^jθ_i, ∀ i, and θ_i is the phase shift the i^th element will induce.\n    \n    As such, the equivalent RDARS reflection-coefficient matrix can be modeled as (𝐈-𝐀) diag(𝐯). \n\n    Unlike active RIS <cit.> or HR-RIS <cit.>, which requires additional reflection-type amplifiers for elements,\n    the realization of the element of RDARS \n    can be built merely upon phase-shift circuits with a slight modification without much additional hardware complexity. However, the detailed implementation of RDARS is out of the scope of this paper. We focus on presenting the idea of the RDARS architecture, analyzing the performance, and further demonstrating its superiority with simulation and experiment results.\n\n    \n\n\n\n\n§ SYSTEM MODEL\n\n    In this paper, we consider RDARS-aided uplink communications where an RDARS is deployed to assist the communications from the user equipment (UE) to the BS. To gain more insight into the system performance of this novel architecture, we consider single-antenna UE and single-antenna BS. The channels between UE-BS, RDARS-BS, and UE-RDARS are all i.i.d. Rayleigh channel, i.e.,  h_UB∼𝒞𝒩(0, ρ_UB^2)  ∈ℂ, 𝐡_RB∼𝒞𝒩(0,ρ_RB^2𝐈_N) ∈ℂ^N× 1 and 𝐡_UR∼𝒞𝒩(0, ρ_UR^2𝐈_N) ∈ℂ^N× 1, where 𝒞𝒩(·,·) denote the complex univariate or multivariate Gaussian distribution.\n\n    \n\n §.§ Signal Model\n\n    \n    Armed with the notation of indicating matrix 𝐀, the received signal y ∈ℂ from the single antenna of BS and the received signal 𝐮∈ℂ^N × 1 from the a elements acting with connected mode at the RDARS can be expressed as[Here we only consider single-bounce signal reflected by the passive reflecting units since the multi-bounce signal has much small power and thus is omitted here <cit.>.]\n         \n    [ y^T𝐮^T ]^T_∈ℂ^(1+N) × 1\n                    \n                    \n                    \n                    \n                    \n                    \n                    \n                    \n                    \n                       =\n                    [ h_UB + \n                        𝐡_RB^H𝐁𝐡_UR ^ ∈ℂ^1 × 1;                                     𝐀𝐡_UR_∈ℂ^N × 1 ]_∈ℂ^(1+N) × 1x_∈ℂ \n                    +\n                    [ n_BS; 𝐀𝐧_R ]_∈ℂ^(1+N) × 1 \n                    = \n                    𝐡 x + 𝐧\n\nwhere x ∈ℂ is the signal transmitted from the UE to BS with total power 𝔼[|x|^2] ≤ P. n_BS∼𝒞𝒩(0, σ_BS^2) is the additive white Gaussian noise (AWGN) received at BS. 𝐀𝐧_R is the equivalent noise vector, i.e., [𝐀𝐧_R]_i ∼𝒞𝒩(0, σ_R^2), ∀𝐀(i,i) ≠ 0. It should be noted that if the 𝐀(i,i) = 0, then [𝐀𝐧_R]_i = 0. Since the received signal is jointly processed at BS and advanced technology can be applied to pre-process signal, we assume the noises at RDARS and BS have equal power after some basic pre-processing, i.e., σ_BS = σ_R = σ.\nAlso, 𝐁 in (<ref>) is defined as\n𝐁 = (𝐈 - 𝐀) diag(𝐯) to simplify the notation. By defining 𝐡 as the equivalent channel as above, the whole system can be regarded as a special SIMO system.\n\nTo effectively combine the received signal, the maximum-ratio-combining (MRC), which is a low-complexity combining scheme, is adopted in this paper. As such, the signal after MRC is written as\n    \n    𝐡^H[ y^T 𝐮^T ]^T_∈ℂ^(1+N) × 1   =\n                    𝐡^H𝐡 x + 𝐡^H𝐧 .\n\nAccordingly, with some simple algebra manipulation, the received SNR γ is given by\n    \n    γ   =\n            γ ( | h_UB + 𝐡_RB^H𝐁𝐡_UR |^2 + 𝐡_UR^H𝐀^H𝐀𝐡_UR ) ,\n\n    where γ = P/σ^2 is the transmit SNR. It is clear that the indicator matrix 𝐀 and the reflection coefficient vector 𝐯 affect the value of γ.\n    Some insightful observations can be found by considering different system parameter configurations as follows:\n    \n        \n  * When a = 0 (or 𝐀 = 0_N), \n    γ becomes the received SNR of a fully-passive RIS-aided SISO system with a direct link <cit.>.\n        \n  * When a = N (or 𝐀 = 𝐈_N),\n    γ is the received SNR of a DAS with two distributed antenna sets where one set is the home-based station with one antenna and the other deployed at the remote RDARS consists of N co-located antennas <cit.>.\n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n       The optimal phase shift for the passive reflecting units with perfect channel state information (CSI) at BS in the above system setup can be obtained in closed-form as:\n        \n    θ_i =  arg (h_UB) - arg( h_RB,i  h_UR,i ) ,\n                ∀𝐀(i,i) = 0,\n\n    where v_i = exp(jθ_i), and arg(·) retrieves the phase of the input complex number. Also, h_RB,i and h_UR,i are the i^th element of the channel vectors 𝐡_RB and 𝐡_UR, respectively.\n    \n    \n        The proof can be obtained by leveraging the triangle inequality similar to <cit.> thus omitted here for brevity.\n    \n    It is clear that the optimal phase shift design for elements performing reflection mode is the same as the traditional RIS system<cit.>. This indicates that the optimal phase shift design for the above RDARS-aided system does not require additional complexity in phase shift design in this system setup.\n\n    \n    \n    With optimal phase shift, the received SNR can be further formulated as\n    \n    γ \n            =\n            γ [ (|h_UB| +  ∑_i=1^N(1-a_i)|h_RB,i||h_UR,i| )^2 \n            + 𝐡_UR^H𝐀^H𝐀𝐡_UR )   ],\n\n    where a_i = 𝐀(i,i).\n    Here we define (|h_UB| + |𝐡_RB^H𝐁𝐡_UR| )^2 as the reflection gain provided by elements in RDARS performing reflection mode similar to the conventional fully-passive RIS-aided system, while 𝐡_UR^H𝐀^H𝐀𝐡_UR as the distribution gain provided by the elements in RDARS working under connected mode.\n    It can be deduced that the reflection gain of RDARS should be smaller or equal (when a = 0) to the conventional fully-passive RIS-aided systems. However, with the introduced distribution gain, the proposed RDARS is anticipated to greatly outperform the corresponding fully-passive RIS-aided systems.\n    To fully uncover the benefits of the proposed RDARS, we conduct the performance analysis by first analyzing the distribution of γ, comparing the received signal power of RDARS-aided systems with that of traditional fully-passive RIS-aided systems, and deriving closed-form expressions for ergodic achievable rate and outage probability in the following section.\n\n    \n\n§ PERFORMANCE ANALYSIS\n\n    We assume the BS has perfect CSI and the passive reflecting units on RDARS are able to alter the signal with continuous phase shifts. Hence, the results obtained under these assumptions serve as performance upper bounds. \n    To fully unveil the potential of RDARS, we consider the optimal phase shifts configuration for elements performing reflection mode, i.e., θ_i =  arg (h_UB) - arg( h_RB,i  h_UR,i ) ,\n    ∀𝐀(i,i) = 0, and then derive the distribution of γ for a given indicating matrix 𝐀.[\n    For simplicity, we consider given indicating matrix 𝐀 for analysis. However, the design of 𝐀 provides an extra degree of freedom in optimization for RDARS-aided systems and will be our future research direction.]\n    It can be seen from (<ref>) that γ involves the sum of random variables (RVs). In particular, the reflection gain in γ provided by the passive reflecting units and the direct link involves the square of the sum of RVs, i.e., (|h_UB| +  ∑_i=1^N(1-a_i)|h_RB,i||h_UR,i| )^2. Therefore, obtaining the exact distribution of γ involves multiple integrals, convolution, and transformation of RVs and thus makes  γ intractable.   \n    To obtain more insight into γ and acquire a tractable analytical expression for the distribution of γ to reveal the system behavior, we resort to moment matching based approximation. Specifically, by approximating γ as a Gamma RV via matching their first and second moments, i.e., 𝔼[γ] and 𝔼[γ^2], the result is formalized in the following Theorem.\n    \n        With the optimal phase shift configuration, the distribution of γ given an indicator matrix 𝐀 can be approximated as\n            \n    γ approx∼Γ(k,\n                    p\n                    ),\n \n        with shape and scale parameters obtained as\n        \n    k = 𝔼[γ]^2/𝔼[γ^2] - 𝔼[γ]^2,             p = 𝔼[γ^2] - 𝔼[γ]^2/𝔼[γ],\n\n        where the first and second moments of γ, i.e., 𝔼[γ] and 𝔼[γ^2], can be evaluated as\n        \n    𝔼[γ]  \n                   =\n                γ[\n                N^2 \n                        (\n                        π^2/16ρ_UI^2ρ_IB^2\n                        )\n                        +\n                        ρ_UI^2ρ_IB^2 \n                        ( \n                        N(1 - π^2/8a^2 - π^2/16) + π^2/16(a^2 + a - 1)\n                        ) \n       +\n                        ρ_UBρ_UIρ_IB(\n                        π/4√(π)(N-a)\n                        )\n                        +\n                        aρ_UI^2 + ρ_UB^2 ],\n\n\n        \n    𝔼[γ^2]\n            =\n            γ^2 𝔼[ ( (γ_1 + γ_2)^2 + γ_3)^2 ], \n       =\n            γ [2ρ_UB^4 + ρ_UB^2 *((N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2)\n            +\n            2* 3/4√(π)ρ_UB^3 *((N-a) π/4ρ_URρ_RB) \n       + ρ_UB^2 *((N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2) \n            +\n            C_4 ρ_UR^4ρ_RB^4 +\n            2*1/2√(π)ρ_UB *(C_3 ρ_UR^3 ρ_RB^3) \n       +\n            2*3/4√(π)ρ_UB^3        * ((N-a) π/4ρ_URρ_RB) \n            +\n            2*1/2√(π)ρ_UB*(C_3 ρ_UR^3 ρ_RB^3) \n       + \n            4*ρ_UB^2* ((N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2) \n            +\n            2*ρ_UB^2 *a ρ_UR^2 \n       + 2 ((N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2) a ρ_UR^2 \n            +\n            4 1/2√(π)ρ_UB (N-a) π/4ρ_URρ_RB  a ρ_UR^2 + a(a+1) ρ_UR^4\n            ].\n\n    \n    \n        The proof can be found in Appendix A.\n    \n    \n    The Gamma moments matching is shown to be accurate by well capturing the probability mass of γ. This has been validated by the simulation results in Section 5.\n    Moreover, the average received power after MRC combining P_RDARS can be obtained as\n        \n    P_RDARS = P [ ρ_UB^2 +    (N-a) π/4√(π)ρ_UBρ_URρ_RB\n       + (N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2 + aρ_UR^2 ].\n  \n    Note that P_RDARS covers the existing results for the conventional RIS-aided SISO systems (a=0) with or without (ρ_UB^2 ≠ 0 or ρ_UB^2 = 0) direct link as special cases <cit.>.\n    It can also be seen that P_RDARS is affected by the large-scale channel parameters as well as the total number of elements N and the number of elements performing connected mode a. As such, to unveil the benefits of the proposed RDARS, we compare the average received power of the RDARS-aided system with that of the conventional RIS-aided system and determine the condition under which the RDARS-aided system performs better than the conventional RIS-aided system in terms of the average received power in the following theorem.\n\n    \n        Regardless of the number of elements performing connected mode a (∀ a ≤ N and a>0), the RDARS-aided system will provide higher average received power than the corresponding conventional RIS-aided system if the following condition is satisfied:\n        \n        \n        \n    N < 16/π^2(1/ρ_RB^2 -1) + 1 - 4√(π)/πρ_UB/ρ_RBρ_UR .\n \n     \n    \n        The received powers of the RDARS-aided system and the RIS-aided system are obtained as\n    \n    P_RDARS   = P [ ρ_UB^2 +    (N-a) π/4√(π)ρ_UBρ_URρ_RB\n       + (N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2 + aρ_UR^2 ],  \n    \n                P_RIS   = P [ ρ_UB^2 + Nπ/4√(π)ρ_UBρ_URρ_RB \n                + (N)(1+ π^2/16(N-1)) ρ_UR^2ρ_RB^2].\n\n    Let P_RDARS> P_RIS, we have\n\n    \n    N < 8/π^2(1/ρ_RB^2 -1) + a+1/2 - 2√(π)/πρ_UB/ρ_RBρ_UR.\n\n    Since a ≤ N, the right-hand-side (RHS) of (<ref>) should be greater than a. As a result, we have the condition for a as\n    \n    a < 16/π^2(1/ρ_RB^2 -1) + 1 - 4√(π)/πρ_UB/ρ_RBρ_UR.\n\n    Plugging (<ref>) into the RHS of (<ref>), we have (<ref>). Thus we complete the proof. \n    \n    \n    Moreover, when the direct link between the user and BS is blocked (i.e., ρ_UB^2 = 0), we have the following corollary.\n    \n        The RDARS-aided system (without a direct link) will provide higher average received power as compared to the corresponding conventional RIS-aided system (without a direct link), regardless of the number of elements performing connected mode a (∀ a ≤ N and a>0), if the following condition of the total number of elements N is satisfied:\n        \n        \n        \n    N < 16/π^2(1/ρ_RB^2 -1) + 1 .\n\n    \n    \n        By setting ρ_UB^2 = 0 in (<ref>), the result is obtained. \n    \n    From Theorem <ref> and Corollary <ref>, the condition that the RDARS-aided system outperforms the corresponding conventional RIS-aided system involves an upper bound of N for any given a. This can be interpreted by comparing the reflection gain and distribution gain: When N is extremely large, the reflection gain will dominate for a given transmit power P. Since the reflection gain of the RDARS-aided system is less than the RIS-aided system given an exact total number of N, the corresponding conventional RIS-aided system will perform slightly better than the RDARS-aided system. However, for a practical number of N, the reflection gain is much smaller due to the “multiplicative fading” effect and thus becomes subordinate when a direct link exists <cit.>. In addition, since there is an extra distribution gain in the RDARS-aided system, a point where the average received powers of these two systems are equal to each other should exist. This thus leads to the above upper bounds. \n\n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    Moreover, it should be noted that the average received power of the RDARS-aided system is always higher or equal (when a=N) to DAS which has no aid of passive reflecting units. This can be easily proved by inspecting (<ref>) with ρ_RB=0 and finding that the average received power of the RDARS-aided system has more positive terms than that of the DAS (under the assumption of a ≤ N).\n \n\n    \n\n §.§ Outage probability\n\n    Since the SNR γ is approximated as Gamma RV, the closed-form outage probability, which is defined as  P_o(x) = Pr(γ < x), can be obtained as\n        \n    P_o(x) \n                   = γ(k,x/p)/Γ(k) \n                =\n                (x/p)^k/kΓ(k)_1F_1 (k,k+1,-x/p) ,\n \n    where _1F_1(·,·,·) is the confluent hypergeometric function of the first kind <cit.>.\n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n\n §.§ Ergodic Achievable Rate\n\n        Here we present the closed-form ergodic achievable rate and its upper bounds to provide insights.\n        \n\n  §.§.§ Gamma Moment Matching\n\n            Since γ is approximated as a Gamma RV, the closed-form ergodic achievable rate can be obtained as\n        \n    R\n                   = 𝔼[(log_2(1+γ))]\n                \n                \n                \n                \n                =\n                1/Γ(k)ln(2) \n                H_3, 2^1, 3[\n                p  |  \n                        \n                            (1,1) ,    (1,1) ,    (-k+1,1) \n    \n                            (1,1) ,    (0,1)\n                        ] ,\n\n        where \n        \n    H(z) = H_p, q^m, n[\n                    p  |  \n                        \n                            (a_i,A_i)_1,p\n    \n                            (b_i,B_i)_1,q],\n\n        is the Fox's H-function (FHF) defined via the Mellin-Barnes type integral <cit.>.\n        \n        Define 1/pγ = y, we have\n        \n    R \n                   =\n                ∫_0^∞log_2(1+γ) f_γ(γ) dγ, =\n                1/Γ(k)∫_0^∞ y^k-2log_2(1+py)  y   exp(-y) dy .\n\n        Then by expressing log_2(1+py) and y exp(-y) as FHF, we have\n        \n    R \n                =\n                1/Γ(k) ln(2)\n                ∫_0^∞ y^k-2 \n                H_2, 2^1, 2[\n                    py  |  \n                        \n                            (1,1)     (1,1) \n    \n                            (1,1)     (0,1)\n                        ]\n                            H_0, 1^1, 0[\n                    y  |  \n                        –\n    \n                            (1,1)\n                        ]\n                dy.\n\n        By using the integral involving the product of two FHFs from <cit.>, we obtain (<ref>).\n        \n\n        \n\n  §.§.§ Upper bound\n\n        Though the ergodic achievable rate using (<ref>) is accurate which has been verified by the simulation results, calculating the FHF still involves high computational complexity and also hinders the extraction of meaningful insights. As such, we derive the upper bound for the ergodic achievable rate by using Jensen's inequalities as follows: \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n        \n    𝔼[(log_2(1+γ))] \n             ≤ log_2(1+𝔼[γ]) = \n             R^U.\n\n        \n        \n        \n        \n        Hence, by applying the first and second moments of γ given by (<ref>) and (<ref>), the upper bound R^U obtained\n        as\n            \n    R^U =  log_2 [     1\n                    + \n                    N^2 \n                    (\n                    π^2/16ρ_UI^2ρ_IB^2\n                    )\n                    +\n                    ρ_UI^2ρ_IB^2 \n                    ( \n                    N(1 - π^2/8a^2 - π^2/16) + π^2/16(a^2 + a - 1)\n                    ) \n       +\n                    ρ_UBρ_UIρ_IB(\n                    π/4√(π)(N-a)\n                    )\n                    +\n                    aρ_UI^2 + ρ_UB^2\n                     ].\n\n        \n        \n        \n        \n        \n    \n        It can be seen that the upper bound R^U in (<ref>) is scaling up with N^2. Though this is obtained for a limited number of N, the result coincides with the power scaling law for conventional RIS <cit.>. \n        This indicates that the RDARS-aided system (using MRC) and the corresponding RIS-aided system perform similarly in the asymptotic regime (with optimal phase shifts), i.e., N →∞. However, as compared to the recently proposed active RIS-aided system <cit.>[The performance of HR-RIS has not been thoroughly investigated yet <cit.>. Therefore, we only mention active RIS as a representative variant.], where the SNR only scales linearly with N in the asymptotic regime due to the additional noises introduced by the use of active components, the RDARS-aided system is still scaling up with N^2 without additional power for amplification.\n        Moreover, as shown in Theorem <ref> and the simulation results provided in Section 5, the RDARS-aided system will perform better than the RIS-aided system for the practical number of N by compensating the “multiplicative fading” effect with distribution gain provided by the elements performing connected mode.  These emphasize the practical application value of the proposed RDARS architecture.\n    \n\n    \n\n    \n        \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n\n§ SIMULATION RESULTS\n\n\n    In this section, numerical results are presented to validate the effectiveness of the proposed architecture and the correctness of the corresponding analysis. To fully unveil the superiority of the proposed architecture, the optimal phase shift as in (<ref>)  for passive reflecting units is adopted for both RDARS and RIS-aided systems. The system layout used in this paper is similar to <cit.>, i.e., the BS and the UE are located at points (0,0) and (90,0), respectively, as shown in Fig. 2. The parameter h is chosen to be 10 m (if not specified otherwise), whereas d is varied across simulations. The distance-dependent path loss model is considered and is given by L(d) = C_0 (d/D_0)^-α,\n        \n        \n        \n    where C_0 is the path loss at the reference distance D_0 = 1 m, d denotes the link distance, and α represents the path loss exponent. The path loss exponent of UE-RDARS(RIS) is set to be α_UR  = 2.1 while the path loss exponent of RDARS(RIS)-BS will be specified later to study its effects on the system performance. Due to the relatively large distance between the UE-BS link, we set the path loss exponent α_UB = 3.2.  All the theoretical results are verified via Monte-Carlo simulations, with each running 30000 channel realizations.  Furthermore, we set γ = 60 dB (or P = -20 dBm and σ^2 = -80 dBm when comparing the average received power) and C_0 = -30 dB unless specified. In the following, we first verify the correctness of the analysis in Section IV and then study the performance of the proposed RDARS-aided system under various system setups.\n\n    \n\n    \n\n §.§ Verification of Analysis\n\n    In this subsection, we first validate the accuracy of the proposed approximation and bounds by comparing the result of Theorem 2 in (<ref>), the outage probability in (<ref>), and the ergodic achievable rate in (<ref>) and (<ref>) with the Monte-Carlo simulation results. Note that we set d = 20 m and α_RB = 2.2, while the parameters N and a are specified in each figure.\n\n    In Fig. 3, the PDFs of γ using Monte-Carlo simulations and the proposed analytical approximation are presented. It is clear that the approximation proposed in Theorem 1 is valid for different settings of a. Also, the proposed approximation becomes more accurate with an increasing number of a as shown in Fig. 3.(a)-Fig. 3.(d) (and Fig. 3.(e)-Fig. 3.(h)).\n    This is because the distribution gain becomes dominant with the increasing a.\n    \n \n    Next, in Fig. 4, the outage probability versus the outage threshold with different system settings is presented. Consistently to Fig. 3, the analytical approximation becomes more and more accurate with the increase of a under various numbers of N. Though some mismatches between the approximation and the simulated results exist in the tail of the outage probability, the derived approximation still provides a good fit by capturing most of the probability mass of γ <cit.>. \n    \n    Finally, in Fig. 5, the ergodic achievable rate versus the total number of elements N (Fig. 5.(a), Fig. 5.(b)) and transmit power (Fig. 5.(c), Fig. 5.(d)) with the different number of a are presented. For thorough comparison, the lower bound based on the method from <cit.> is also provided. It is observed that the proposed ergodic achievable rate approximation (<ref>) matches well with the simulation results under various settings for both scenarios with and without a direct link. Moreover, the lower <cit.> and the upper bounds (<ref>) become tighter as a increases. \n\n         \n\n    \n\n    \n    \n    \n    \n\n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n\n\n\n\n    \n\n §.§ Comparison between RDARS and RIS\n\n    \n    In this subsection, we first validate the proposed theorem and corollary in Section IV, which determine the condition when RDARS outperforms the conventional RIS in different system setups. Then, we investigate the impact of the deployment location of RDARS and compare it with the conventional fully-passive RIS-aided system. Finally, the outage probability and ergodic achievable rate achieved by the RDARS-aided system are compared with that of the corresponding RIS-aided system to unveil the superiority of the proposed RDARS.\n\n    \n\n  §.§.§ Is RDARS promising?\n\n    First, we verify the condition presented in Theorem <ref>. Since (<ref>) is valid regardless of the number of elements performing connected mode, we choose two representative scenarios, i.e., a = 1 and a = N, to verify Theorem <ref>.\n    Intuitively, using a large value of d generally results in small ρ_RB, and thus the condition of N in (<ref>) becomes large. To ease the computation burden, we set d = 10 m, h = 10 m, and ρ_RB = 2 in Fig. 6.\n    To highlight the correctness of our analysis, instead of calculating the difference of average received powers between the RDARS-aided system and the conventional RIS-aided system, we plot the difference of the average SNR[Here, the average SNR refers to 𝔼[γ] where the expectation is taken w.r.t. different channel realizations. Therefore, we have 𝔼[γ_RDARS] = P_RDARS/σ^2 which does not affect our analysis.], i.e., 𝔼[γ_RDARS] - 𝔼[γ_RIS] versus the total number of N for a = 1 and a = N as shown in Fig. 6.\n    It can be seen that the difference of the average SNR between the RDARS-aided and the RIS-aided systems is positively large for small N and decreases with the number of N. The SNR difference approaches zero with N ≈ 4800 when a = 1 and N ≈ 9700 when a = N. This coincides with the results obtained by directly calculating (<ref>) and  (<ref>), which are 9713 and 4857 as presented in TABLE 1 and TABLE 2.\n\n    \n\n\n    \n    \n    \n    \n    \n    \n    \n\n    \n    \t\n\n\n     \n\n     \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n  \n\n    \n    Moreover, since the large-scale channel coefficient is affected by the distance d and the path loss exponent α_RB, the condition of N for the required number of elements of RIS to outperform RDARS in terms of average received power is also influenced by d and α_RB. For fixed a, larger values of d and α_RB lead to larger 1/ρ_RB^2 and consequently make 1/ρ_RB^2 dominate in (<ref>) and (<ref>), thus calling for more elements in RIS to achieve comparable performance to RDARS. Also, for fixed d and α_RB (or equivalently, fixed ρ_RB), the condition of N only increases linearly with a, which thus confirms the correctness of (<ref>). Notably, as shown in TABLEs 1 and 2, the required N is generally large, e.g., N≥ 4000. Thus we can conclude that for most of the practical number of N, deploying RDARS will provide more benefits than the conventional RIS-aided system in terms of the average received power.\n\n    In Fig. 7, the average received power for the RDARS(RIS)-aided system versus BS-RDARS(RIS) horizontal distance is presented with N = 256. It is obvious that the RDARS-aided system significantly outperforms the RIS-aided system with different d in the above system setup. \n    Note that the average received power of the RDARS-aided and the RIS-aided systems varies differently with the BS-RDARS(RIS) horizontal distance when N and a are fixed. For example, defining P_RDARS(d) ( or P_RIS(d) ) as the average received power for RDARS-aided system (or RIS-aided system) along d, we have P_RDARS(30) < P_RDARS(60) and P_RIS(30) ≈ P_RIS(60) when the other parameters are fixed.\n    Research in <cit.> has pointed out that deployment of RIS generally should be either near the BS or UE to boost the system performance, and the average received power provided by RIS is almost symmetrical about the midpoint of the position of UE and BS when considering single-user scenarios as in <cit.>. \n    However, as demonstrated in Fig. 7, for a moderate size of the surface (i.e., having a limited number of total elements, e.g., N = 256 in our setting), a large performance gain can be achieved by deploying RDARS near the UE via the obtained distribution gain. Nonetheless, if d is extremely large (i.e., RDARS is far from the receiver (BS) ), the cost for connecting the elements performing  connected mode with BS may be unaffordable.\n    \n    Fortunately, as shown in Fig. 7, deploying RDARS near the BS (or receiver side) still seems like a promising choice as it also provides substantial gain over conventional RIS-aided systems and has an acceptable cost for connecting elements performing connected mode on RDARS at the meantime. \n    \n    \n    \n    \n\n    \n    \n    \n    \n\n\n\n    \n\n        \n   \n\n  §.§.§ Outage Probability\n\n   \n    Here, we investigate the outage probability of the RDARS-aided and the RIS-aided systems under different RDARS(RIS) locations. We set d = 30 m and d =45 m in Fig. 8.(a) and Fig. 8.(b), respectively.\n    As can be seen from Fig. 8.(a) and Fig. 8.(b), for fixed a, the SNR to achieve the same outage probability of the RDARS-aided system decreases with the increasing N thanks to the increasing reflection gain brought by the passive units of RDARS. \n    \n\n    \n    \n    Besides, when comparing the RDARS-aided and the conventional RIS-aided systems with N = 256 in Fig. 8, a substantial SNR improvement can be achieved with only one element on RDARS performing connected mode, i.e., the 4 dB and 8 dB SNR gains are attained at the outage probability of 0.1 for d = 30, 45 m, respectively.    \n    It can also be observed that the gain introduced by increasing the number of elements performing connected mode exhibits a diminishing marginal effect when the total number of elements N is large. \n    \n    \n    This indicates that the performance enhancement may be fulfilled by programming only a few elements in RDARS to perform connected mode.\n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n\n\n\n   \n\n  §.§.§ Ergodic Achievable Rate\n\n\n   \n   In Fig. 9.(a), the ergodic achievable rate versus the total number of elements N for both RIS and RADRS-aided systems with different a is presented. Here we set γ = 60 dB and α_RB = 2.2, and the scenario where the RIS and the RDARS are both deployed near the receiver (BS) for lowering the cost of connection for elements performing connected mode, i.e., d = 30 m, is considered. As compared to the traditional RIS-aided system, the RDARS-aided system brings 0.8, 1.5, 1.9 bps/Hz rate improvements with only 1, 2, 3 elements performing connected mode, respectively, when N = 256.  \n   Note that the rate gain provided by RDARS also vanishes with the increasing N as shown in Fig. 9.(a). This is because the reflection gain will become dominant for relatively large N, and from Remark 2, the ergodic achievable rate of the RDARS-aided system (using MRC combiner) and the conventional RIS-aided system perform similarly in the asymptotic regime of N under optimal phase shift configurations. \n   It is worth mentioning that, although the passive reflecting elements for RIS are designed in sub-wavelength size, achieving a satisfying performance with a RIS-aided system usually requires a large N and thus may result in an overall large size reflecting surface <cit.>. In contrast, by replacing RIS with RDARS, the total size of the surface can be greatly reduced, which makes it more flexible and convenient to be deployed on the surface of walls or buildings to assist practical communications. \n   \n   In Fig. 9.(b), we compare the ergodic achievable rate versus the transmit power for both RIS and RDARS-aided systems with different N and a. It is clear that the RDARS with 3, 2, 1 elements performing connected mode brings 11, 10, 6 dB gains, respectively, to obtain the 6 bps/Hz ergodic achievable rate as compared to the conventional RIS-aided system. This thereby demonstrates the superiority of RDARS in saving the transmit power.\n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n\n\n\n    \n\n§ EXPERIMENTAL RESULT\n\n    \n    In this section, experiment results are presented using a fabricated prototype of RDARS to verify the performance of this proof-of-concept.\n    Fig. 10 presents the picture of the proposed RDARS-aided wireless communication system. The system is composed of one transmitter (UE), one receiver (BS), and one RDARS. Both the transmitter and receiver consist of a computer, a Universal Software Radio Peripheral (USRP), and an antenna.[Note that only one antenna is connected to the USRP at the receiver (BS) as shown in Fig. 10.(b).] The detailed system parameters are presented in TABLE 3.\n\n     \n    \n    Specifically, the RDARS is made of 16 unit cells per column and per row, i.e., 16× 16=256 total elements. Each element of RDARS has 2-bit phase resolution when performing reflection mode, and will switch to the connected mode when has been programmed and cable is connected to its port in advance at the back of the surface as shown in Fig. 11.(b). The mode and the phase shift of each element can be dynamically and independently controlled by the RDARS controller with a total 512-bit control signal delivered through the control link using User Datagram Protocol (UDP).  \n\n    \n\n    \n\n\n\n\n    \n\n\n     \n    \n    Since this experiment aims to verify the proposed architecture's effectiveness, we mainly focus on the performance comparison of the RDARS-aided and the conventional RIS-aided systems under the same system configurations. \n    As shown in Fig. 10.(c), RDARS is deployed to assist in uplink communication between UE and BS in a relatively static scenario.\n    \n    \n    \n    Since the RDARS is designed to have a Uniform Planer Array (UPA) form, the optimal phase shift  is determined by searching through the codebook and finding the codeword that gives the maximum received power, as mentioned in<cit.>.\n    \n    \n    Once determined, the optimal phase shift is fixed for all schemes during the experiment conducted in a short time period for a fair comparison. \n\n    The experimental results are presented in Table 4 with three performance metrics, i.e., the received SNR[\n    Here the received SNR refers to the symbol SNR in dB for the given sequance of IQ samples and is calculated based on Error-Vector-Magnitude (EVM), i.e.,  SNR [dB] = -20 log_10(EVM).], the data transmission throughput, and the block error rate (BLER). The throughput improvement in Table 4 is calculated between the RDARS-aided and the RIS-aided systems based on the optimal phase shift. One example of the throughput measurements in the experiments is shown in Fig. 12 for clear illustration. As seen from Table 4, for optimal phase shift design, when RIS is deployed, the throughput is improved, i.e., from 2.5 Mbps to 15.0 Mbps. The received SNR is improved by 0.76 dB, i.e., from 10.09 dB to 10.85 dB, and the BLER is reduced by 46%, i.e., from 0.911% to 0.451%. This validated the positive impact of RIS in improving the system performance to a certain extent.\n    However, compared to RIS, RDARS is shown to greatly improve system performance as clearly demonstrated in Table 4, e.g., the RDARS with three elements performing connected mode brought a 76% throughput improvement, i.e., from 15.0 Mbps to 26.4 Mbps, as compared to the RIS-aided system. Also, the received SNR is improved by 2.26 dB, i.e., from 10.85 dB to 13.11 dB, and the BLER is reduced by 41.7%, i.e., from 45.1% to 3.4%. \n    This demonstrates the superiority of RDARS by well compensating the “multiplicative fading\" effect. Notably, the gain introduced by increasing the number of elements performing connected mode shows a diminishing marginal effect, e.g., 4.4 Mbps and 1 Mbps throughput improvement from a = 1 to a = 2 and from a = 2 to a = 3, respectively. This indicates that for practical deployment of RDARS, only a few elements performing connected mode are sufficient to greatly improve performance with moderate cost.\n\n    The experiment results have validated the effectiveness of the proposed RDARS, and its potential in assisting wireless communications systems by greatly boosting the performance as compared to RIS.\n    In fact, in the conventional fully-passive RIS setting, a control link is needed for delivering the control signal for phase shift design. Though our prototype adopts two separate links for RDARS-controller (or RIS-controller by setting all the elements under reflection mode) and the connection of elements performing connected mode with BS (using dedicated cable), we envision that these two links could be integrated together.\n    Research in <cit.> has pointed out that the design of the RIS phase shift based on statistical CSI can provide similar gain as compared to instantaneous CSI. As such, the phase shift information delivery through the controller only needs to be updated on a large-time scale where the remaining time block could be utilized to deliver the signal received at elements performing connected mode on RDARS. This could potentially boost the performance of the RDARS-aided system in terms of achievable rate further.\n\n    \n    \n    \n    \n\n\n     \n\n    \n\n§ FURTHER DISCUSSION\n\n\n    From the numerical and experiment results, we reveal the effectiveness of the proposed RDARS architecture. However, the potential of RDARS is far beyond what is mentioned in this paper. For example, obtaining global CSI is possible with RDARS whereas only cascaded CSI is available for conventional RIS <cit.>. In fact, the proposed channel estimation methods for “semi-passive RIS” could be utilized as a potential channel estimation scheme for the RDARS-assisted system<cit.>. It should be noted that the original “semi-passive RIS” was proposed merely for channel estimation and the received pilot signals were mainly processed locally on RIS with low-cost signal processing units, this may limit the estimation accuracy. On the contrary, the RDARS-assisted system has the freedom to jointly process signals at BS with more advanced signal processing units while still maintaining low-cost and low-energy-consumption for RDARS.\n    Also, though we focus on unveiling the positive impact of RDARS-aided uplink communication in this paper, RDARS has the potential to assist downlink communication, e.g., the joint active and passive beamforming design for the antenna at BS, the elements acting as remote antennas at RDARS, and the elements performing reflection mode on RDARS.\n    As such, it is worthy of further unveiling the potential of RDARS in various scenarios and combining RDARS with other advanced technologies for future wireless communications.\n\n    \n        \n    \n\n§ CONCLUSION\n\n\n    This paper proposed the architecture of “Reconfigurable distributed antennas and reflecting surfaces (RDARS)” to overcome the “multiplicative fading” effect, one of the bottlenecks of the conventional fully-passive RIS. Specifically, the elements of RDARS can perform either reflection mode, which acts as passive reflecting units, or connected mode, which performs as remote antennas for BS collecting signal.\n    Therefore, with joint processing of signals at the receiver, a significant gain can be achieved with the controllable trade-off between the reflection gain and the distribution gain in an RDARS-aided system. To characterize the performance of the proposed RDARS-aided system, we analyzed the received SNR under MRC with the system configuration of SISO. Closed-form expressions of outage probability and ergodic achievable rate were also derived. Moreover, the performance of the RDARS-aided and the fully-passive RIS-aided systems was compared under various system parameters to unveil the superiority of the RDARS-aided systems. Finally, to demonstrate the practicability and manufacturability of the proposed RDARS, we conducted experiments by establishing an RDARS prototype. Both simulation and experimental results confirmed the effectiveness of the proposed RDARS architecture, thus envisioning RDARS as a promising candidate for future 6G wireless systems.\n   \n   \n\n\n    \n    \n        \n    \n\n§ THE FIRST AND THE SECOND MOMENTS OF Γ\n\n        Recall that γ = γ ( (γ_1 + γ_2)^2 + γ_3 ),\n    \n    \n    \n    \n    \n    \n    \n    where we define γ_1 = |h_UB|, γ_2 = ∑_i=1^N(1-a_i)|h_RB,i||h_UR,i|, and γ_3 = 𝐡_UR^H𝐀^H𝐀𝐡_UR.\n        \n        \n        \n        \n        \n    To obtain the first and second moments of γ, we need the following statistical information: the first to the fourth moments of γ_1, γ_2, and the first and the second moments of γ_3.\n    To simplify the notation, we define x_i=(1-a_i)|h_UR,i||h_RB,i|. \n    Below we derive the aforementioned required statistics.\n\n    \n    \n\n §.§ γ_1\n\n    The first to fourth moments of h_UB can be easily obtained as 𝔼[γ_1] = 1/2√(π)ρ_UB, 𝔼[γ_1^2] =   ρ_UB^2, 𝔼[γ_1^3] = 3/4√(π)ρ_UB^3 and 𝔼[γ_1^4] =  2ρ_UB^4.\n\n    \n    \n\n §.§ γ_2\n\n    \n     \n\n  §.§.§ 𝔼[γ_2]\n\n        \n    𝔼[γ_2]\n                   =\n                ∑_i=1^N(1-a_i) 𝔼[|h_UR,i|] 𝔼[|h_RB,i|]=\n                (N-a) π/4ρ_URρ_RB.\n\n\n    \n    \n    \n\n  §.§.§ 𝔼[γ_2^2]\n\n        \n        \n    𝔼[γ_2^2] \n                =\n                𝔼[∑_i=1^N (1-a_i)^2 |h_UR,i|^2 |h_RB,i|^2 \n                + \n                 ∑_i ≠ j^N (1-a_i) (1-a_j) |h_UR,i| |h_RB,i| |h_UR,j| |h_RB,j|], \n       =\n                (N-a)(1+ π^2/16(N-a-1)) ρ_UR^2ρ_RB^2.\n\n\n    \n    \n\n  §.§.§ 𝔼[γ_2^3]\n\n    \n     \n    𝔼[γ_2^3] \n                \n                \n                   =\n                𝔼[∑_i=1^N x_i^3 + ∑_i≠ j^N x_i^2 x_j + ∑_i ≠ j ≠ k^N x_i x_j x_k ],\n\n    \n    we have 𝔼[∑_i=1^N x_i^3] = (N-a) 9/16πρ_UR^3 ρ_RB^3, 𝔼[∑_i≠ j^N x_i^2 x_j] = C_3^1C_N-a^2C_2^11/4πρ_UR^3 ρ_RB^3, and 𝔼 [∑_i ≠ j ≠ k^N x_i x_j x_k] = =C_N-a^3C_3^1C_2^11/64π^3 ρ_UR^3 ρ_RB^3 where C_N^M = N!/M!(N-M)!.\n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n\n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Therefore we have \n        \n    𝔼 [γ_2^3] \n                \n                \n                \n                \n                \n                \n                   =\n                C_3 ρ_UR^3 ρ_RB^3,\n\n\n        where C_3 = (N-a) 9/16π +\n            3(N-a)(N-a-1) 1/4π  +\n            (N-a)(N-a-1)(N-a-2)  1/64π^3.\n            \n        \n        \n        \n        \n        \n        \n        \n    \n\n    \n    \n\n  §.§.§ 𝔼[γ_2^4]\n\n\n    \n    𝔼[γ_2^4]\n               = 𝔼[\n            ∑_i=1^N x_i^4 \n            + ∑_i ≠ j^N x_i^3 x_j^1 \n            + ∑_i ≠ j^N x_i^2 x_j^2 \n            + ∑_i ≠ j ≠ k ^N x_i^2 x_j x_l\n            + ∑_i ≠ j ≠ k ≠ l^N x_i^2 x_j^2 x_k^2 x_l^2 ],\n\n    We have 𝔼 [ ∑_i=1^N x_i^4]  = 4(N-a) ρ_UR^4ρ_RB^4, 𝔼 [ ∑_i ≠ j^N x_i^3 x_j^1] = C_4^1C_N-a^2C_2^19/64π^2ρ_UR^4ρ_RB^4, 𝔼 [ ∑_i ≠ j^N x_i^2 x_j^2] =  C_4^2C_N-a^2ρ_UR^4ρ_RB^4, 𝔼[∑_i ≠ j ≠ k ^N x_i^2 x_j x_l] = C_N-a^3C_4^2C_3^1C_2^1C_2^1π^2/16ρ_UR^4ρ_RB^4, and 𝔼 [ ∑_i ≠ j ≠ k ≠ l^N x_i x_j x_k x_l] = C_N-a^4C_4^1C_3^1C_2^11/256π^4ρ_UR^4ρ_RB^4.\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Thus it yields \n            \n    𝔼 [γ_2^4] = C_4 ρ_UR^4ρ_RB^4,\n\n    where  C_4 = 4(N-a) + 9/16(N - a)(N-a-1) π^2 + 3 (N-a) (N-a-1) + 6(N-a)(N-a-1)(N-a-2) π^2/16 + 1/256(N-a)(N-a-1)(N-a-2)(N-a-3) π^4.\n    \n    \n    \n    \n    \n    \n    \n        \n\n    \n\n §.§ γ_3\n\n    \n    𝐡_UI^H𝐀^H𝐀𝐡_UI   =\n            ∑_i=1^N a_i^2 |h_UR,i|^2 =\n            ∑_i=1^N a_i^2 y_i ,\n\n    where a_i = 𝐀(i,i) and y_i = |h_UR,i|^2. Note that y_i/1/2ρ_UI^2 follows Chi-square distribution with two degrees of freedom, i.e., y_i/1/2ρ_UR^2 ∼χ^2(2). And y_i = ρ_UR^2/2y_i/1/2ρ_UR^2 follows Gamma distribution, i.e., y_i ∼Γ(1, ρ_UR^2). Therefore we have 𝐡_UR^H𝐀^H𝐀𝐡_UR∼Γ(a, ρ_UR^2), and the first and second moments are obtained as\n    𝔼[γ_3] = \n            𝔼[𝐡_UR^H𝐀^H𝐀𝐡_UR] = a ρ_UR^2, \n    𝔼[γ_3^2] = 𝔼[(𝐡_UR^H𝐀^H𝐀𝐡_UR)^2] =\n            ∑_i=1^N a_i^2 𝔼[|h_UR,i|^4] + \n            ∑_i ≠ j^N a_i a_j 𝔼[|h_UR,i|^2] 𝔼[|h_UR,j|^2] = a(a+1) ρ_UR^4\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    Armed with the above statistics, the first and second moments of γ are derived.\n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n     \n   \n        \n    \n\n\n\n\n\n        \n    \n\n    \nIEEEtran\n\n    \n         \n\n    \n\n"}