{"entry_id": "http://arxiv.org/abs/2303.06939v1", "published": "20230313091456", "title": "Topological and disorder corrections to the transverse Wiedemann-Franz law and Mott relation in kagome magnets", "authors": ["Xiao-Bin Qiang", "Z. Z. Du", "Hai-Zhou Lu", "X. C. Xie"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall"], "text": "\n\n\n\n\n\n\n\nShenzhen Institute for Quantum Science and Engineering and Department of Physics, Southern University of Science and Technology (SUSTech), Shenzhen 518055, China\nQuantum Science Center of Guangdong-Hong Kong-Macao Greater Bay Area (Guangdong), Shenzhen 518045, China\nShenzhen Key Laboratory of Quantum Science and Engineering, Shenzhen 518055, China\nInternational Quantum Academy, Shenzhen 518048, China\n\n\nShenzhen Institute for Quantum Science and Engineering and Department of Physics, Southern University of Science and Technology (SUSTech), Shenzhen 518055, China\nShenzhen Key Laboratory of Quantum Science and Engineering, Shenzhen 518055, China\nInternational Quantum Academy, Shenzhen 518048, China\n\n\n\nCorresponding author: luhz@sustech.edu.cn\n\nShenzhen Institute for Quantum Science and Engineering and Department of Physics, Southern University of Science and Technology (SUSTech), Shenzhen 518055, China\nQuantum Science Center of Guangdong-Hong Kong-Macao Greater Bay Area (Guangdong), Shenzhen 518045, China\nShenzhen Key Laboratory of Quantum Science and Engineering, Shenzhen 518055, China\nInternational Quantum Academy, Shenzhen 518048, China\n\n\n\nInternational Center for Quantum Materials, School of Physics, Peking University, Beijing 100871, China\nCollaborative Innovation Center of Quantum Matter, Beijing 100871, China\nCAS Center for Excellence in Topological Quantum Computation,\nUniversity of Chinese Academy of Sciences, Beijing 100190, China\n\n\n\n\n\n\n\nThe Wiedemann-Franz law and Mott relation are textbook paradigms on the ratios of the thermal and thermoelectric conductivities to electrical conductivity, respectively. Deviations from them usually reveal insights for intriguing phases of matter. The recent topological kagome magnets TbMn_6Sn_6 and Mn_3Ge show confusingly opposite derivations in the Hall measurement. We calculate the topological and disorder corrections to the Wiedemann-Franz law and Mott relation for the Hall responses in topological kagome magnets. The calculation indicates the dominance of the topological correction in the experiments. More importantly, we derive analytic correction formulas, which can universally capture the two opposite experiments with the chemical potential as the only parameter and will be a powerful guidance for future explorations on the magnetic topological matter.\n\n\n\nTopological and disorder corrections to the transverse Wiedemann-Franz law and Mott relation in kagome magnets\n    X. C. Xie\n    March 30, 2023\n==============================================================================================================\n\n\n\n\nIn most metals, the ratio between the thermal conductivity κ and electric conductivity σ is characterized by the Wiedemann-Franz law κ/σ=L_0T <cit.>, where T is the temperature and the Lorentz number\n\n    L_0=(π k_B/e)^2/3\n\nis composed of the elementary charge e and the Boltzmann constant k_B.\nThe deviations from them usually provide insights for exotic phases of matter, such as in non-Fermi liquids and hydrodynamics <cit.>.\nRecently, the thermoelectric and thermal transports have become promising tools to probe topological phases of matter <cit.>.\nIn particular, topological magnets have attracted tremendous interest because of their outstanding electromagnetic conversion abilities for potential device applications <cit.>.\nThe latest experiments on the topological kagome magnets TbMn_6Sn_6 <cit.> and Mn_3Ge <cit.> show confusingly opposite deviations from the Wiedemann-Franz law in the Hall measurements [Fig. <ref> (b)], raising questions on their microscopic mechanisms. In particular, disorder and topology could both play sophisticated roles in the anomalous Hall transport <cit.>, but their contributions and competition remain unclear in these experiments.\n\n\n\n\n\nIn this Letter, we calculate the ratios\nof thermal Hall conductivity κ_xy\nand thermoelectric Hall (Nernst) conductivity\nα_xy to the electric Hall conductivity σ_xy [Fig. <ref> (a)].\nBeyond the previous works, we take into account the disorder contribution and topological contribution on same footing. By comparing the calculation with the experiments, we find that\nthe topological contribution may dominate in the experiments. More importantly, we can derive the analytic formulas for the corrections to the Wiedemann-Franz law (κ/σ) and Mott relation (α=-e L_0T ∂σ/∂μ, where μ is the chemical potential), with the help of the Dirac model that carry the topological and magnetic properties of the topological kagome magnets [Fig. <ref>].\nThe analytic formulas  depend not explicitly on the model details, but only on the chemical potential, implying the universal nature of the corrections.\nOur analytic formulas can reproduce both the negative and positive derivations from the classical Wiedemann-Franz law [Fig. <ref> (b)], as well as the tendencies in the Mott relation\n[Fig. <ref>(c)] in the experiments, with the same chemical potential in each experiment. These formulas will be helpful for further explorations on the electric, thermoelectric, and thermal transports in topological magnets.\n\n\n\n\n\n\nDespite the sophisticated magnetic structures of the topological kagome magnets, in the metallic phase as those in the experiments <cit.>, the magnon <cit.> and phonon <cit.> degrees of freedom are inactive in the thermal transport. Therefore, the electronic, thermoelectric, and thermal transports are fairly described by the electronic Hamiltonian. The electronic structure of TbMn_6Sn_6 can be described by the 2D massive Dirac model, which has been confirmed by the spectroscopic measurement <cit.>. The electronic structure of non-colinear antiferromagnet Mn_3Ge [Fig. <ref>(c)] <cit.> is the Weyl semimetal <cit.>, which can be viewed as layers of coupled 2D massive Dirac models <cit.>. More importantly, the massive Dirac model can describe two of the most important characteristics of the topological kagome magnets, i.e., time-reversal symmetry breaking and topological properties. More importantly, later we will see that κ_xy^in/σ_xy^in and α_xy^in/σ_xy^in in Eqs. (<ref>) and (<ref>) do not depend on the model details.\n\n\n\n\n\n\nThe electric, thermoelectric (Nernst coefficient), and thermal Hall conductivities can\nbe expressed in an organized form\n\n    σ_xy^χ=-e^2/h𝒞_0^χ, α_xy^χ=k_B e/h𝒞_1^χ, κ_xy^χ=-k_B^2 T/h𝒞_2^χ,\n\nwhere h is the Planck constant and the coefficient 𝒞_n^χ (see <cit.> for details) can be expressed as\n\n    𝒞_n^χ=∫ dε[χ](ε-μ/k_B T)^n(-∂ f^0/∂ε),\n\nhere ε is the energy, μ is the chemical potential, and f^0=1/(e^(ε-μ)/k_BT+1) is the Fermi distribution function. The kernel function χ denotes different mechanisms in the anomalous transport, including the topological contribution revealed in the seminal works <cit.> and disorder contribution <cit.>. For the topological contribution, χ^in=2π∑_l Ω_l^zf_l^0, where l=(𝐤,n) stands for the quantum numbers (momentum, band index), Ω^z_l is the z component of the Berry curvature of band n with the definition Ω_l= i∇_𝐤×⟨ψ_n|∇_𝐤ψ_n⟩.\nThe Berry curvature can be understood as the “magnetic field\" in the parameter space, as a result of the geometric structure of the quantum states <cit.>, and is found critical in understanding the anomalous Hall effect <cit.>, topological magnetoresistance <cit.>, and thermal transport <cit.>.\nFor the 2D Dirac model ℋ= v(k_xσ_x+k_yσ_y)+mσ_z, Ω_±^z=∓ mv^2/(2ε_+^3), where the band dispersions are ε_±(k)=±[ v^2(k_x^2+k_y^2)+m^2]^1/2, v is the model parameter, σ_x,y,z are Pauli matrices, and m is the band gap.\n\n\n\n\nThe main results of this work are the analytic formulas for the topological contributions κ_xy^in/σ_xy^in (the Wiedemann-Franz law of the Hall signals) and α_xy^in/σ_xy^in, which can reproduce two opposite types of experiments of the topological kagome magnets. By performing the Sommerfeld expansion of the transport coefficients (Eqs. <ref>) with respect to the energy scale of temperature (up to σ∝ (k_BT)^4, α∝ (k_BT)^4, κ∝ (k_BT)^4), we obtain the analytic expression for the ratio κ_xy^in/σ_xy^in\n\n    κ_xy^in/σ_xy^in   =   15μ^2/π^2+21(k_BT)^2/15μ^2/π^2+5(k_BT)^2+7π^2(k_BT)^4/μ^2L_0 T,\n\nwhere the Lorentz number L_0=(π k_B/e)^2/3, the chemical potential μ is measured from the center of the gap. This formula can be simplified in two limits <cit.>\n\n    κ_xy^in/σ_xy^in={   (1+16π^2/15k_B^2T^2/μ^2)L_0T,      μ≫μ_c;\n       (1+π^2/3k_B^2T^2/μ^2)^-1L_0T,     μ≪μ_c,\n       .\n\nwhere the critical chemical potential is found as μ_c=√(7)π k_BT/4 (at which κ_xy^in/σ_xy^in recovers the classical value L_0T). The μ≫μ_c limit of Eq. (<ref>) has been used to fit the positive deviation in the experiment of TbMn_6Sn_6 <cit.>, but only the new formula Eq. (<ref>) can give both the positive and negative deviations in Fig. <ref>.\n\n\n\nSimilar to the classical Mott relation <cit.>, we also get the relation between the thermoelectric and the electric Hall coefficients\n\n    α_xy^in/σ_xy^in=(μ/e+π^2/3k_B^2 T^2/eμ)^-1L_0T.\n\nNote that the formulas are independent of the model parameters but solely depend on μ, i.e. the position of the chemical potential.\nThis is reasonable because the model details are cancelled as the quantities on the denominator and numerator of the ratios both depends on the model parameters, such as the band gap m. In this sense, the ratios are more intrinsic and universal.\n\nTo test Eqs. (<ref>) and (<ref>), we use μ as the only parameter to fit the experimental data from Refs. <cit.>.\nFigs. <ref> (b) and (c) show a good agreement between the experiments and our analytic formulas for κ_xy^in/σ_xy^in and α_xy^in/σ_xy^in as functions of temperature T. In particular, we use μ=0.11 eV to fit the data of TbMn_6Sn_6, very close to the measured μ=0.13± 0.004 eV in the experiment <cit.>. We stress that the fitting parameter μ is the same for κ_xy^in/σ_xy^in and α_xy^in/σ_xy^in for the same experiment in the comparison. Constrained by the Sommerfeld expansion, our formulas in Eqs. (<ref>) and (<ref>) are valid for temperatures below the Fermi temperature T_F=μ/k_B, which is more than 1000 K for the high chemical potentials in the experiments. Nevertheless, there is a derivation from the formula above 300 K.\n\n\nIt is reasonable to employ the formulas, because the electronic behaviors of the topological kagome magnet TbMn_6Sn_6 <cit.>\nand the non-colinear antiferromagnet Mn_3Ge <cit.> can be reduced to the 2D massive Dirac model [Fig. <ref>].\nThe description of Mn_3Ge by the 2D model is further supported by considering a 3D tilted massless Weyl cone <cit.> ℋ=s(v 𝐤·σ+tk_z), where v is the model parameter, and s=± 1 labels the chirality of a single node. The tilt term tk_z is necessary to cover more general case, and we assume t/v≪ 1 to get the analytical result. This model can well describe the Weyl semimetal phase in the bulk Mn_3Ge <cit.>. We find that there is no deviation from the Wiedemann-Franz law and Mott relation when both the topology and disorder contributions are taken into account for the tilted massless Weyl cone (Details can be found in <cit.>), additionally justifying that the 2D model is a better description for the layered structure of Mn_3Ge.\n\n\n\n\n\n\nUp to now, we only consider the topological correction. However, disorder in real materials can contribute to the anomalous transport <cit.>. We use the Boltzmann kinetics to account for the disorder contribution, which is widely used in explaining magneto-transport <cit.> and nonlinear transport <cit.>. To have analytic results, we consider a δ-correlated disorder model V̂_imp=∑_i V_i δ(𝐫-𝐑_i) with the randomly distributed vector R_i and the disorder strength V_i satisfying the second-order correlation ⟨ V_i^2⟩_dis=V_0^2 and third-order correlation⟨ V_i^3⟩_dis=V_1^3. This model can well describe the elastic scattering (even the electron-phonon scattering approximately below the Debye temperature <cit.>). After a lengthy calculation <cit.>, we find the kernel functions for the disorder contributions, including the side-jump, extrinsic skew-scattering, and intrinsic skew-scattering parts, respectively,\n\n    χ^sj=2m(ε^2-m^2)/ε(ε^2+3m^2),\n       χ^sk,1=V_1^3/n_iV_0^4m(ε^2-m^2)^2/(ε^2+3m^2)^2,\n       χ^sk,2=3m(ε^2-m^2)^2/2ε(ε^2+3m^2)^2.\n\nBy substituting χ's into Eq. (<ref>), we can have the total contribution that includes the topological and disorder contributions for all transport coefficients, as well as the ratios κ_xy^tot/σ_xy^tot and α_xy^tot/σ_xy^tot.\n\n\nInterestingly, in the presence of the disorder contribution, up to the leading-order (σ∝ (k_BT)^0, α∝ (k_BT)^2, κ∝ (k_BT)^2) Sommerfeld expansion of Eq. (<ref>), the ratios can recover\nthe classical Wiedemann-Franz law and Mott relation, i.e., (check <cit.> for details)\n\n\n    κ_xy^in(0)+κ_xy^dis(0)   =L_0 T [σ_xy^in(0)+σ_xy^dis(0)],\n    α_xy^in(0)+α_xy^dis(0)   = -e L_0T ∂/∂μ[σ_xy^in(0)+σ_xy^dis(0)],\n\nwhere the superscript (0) means leading-order and dis(0) includes the leading-order side-jump and skew-scattering contributions.\n\n\n\n\n\nTo fully examine the disorder correction, we numerically evaluate κ_xy^tot/σ_xy^tot and α_xy^tot/σ_xy^tot by using Eqs. (<ref>) and (<ref>) for different values of m and μ. As shown in [Figs. <ref> (a)-(b)], both κ_xy^tot/σ_xy^tot and α_xy^tot/σ_xy^tot show the m dependence, which is different when there is only the topological contribution. We adopt the value m=0.017 eV for the TbMn_6Sn_6 <cit.>, i.e., black curves in [Figs. <ref> (c)-(d)]. It can be seen that the topological and total contribution show different behaviors. For κ_xy/σ_xy, the total contribution show almost only negative correction to the Wiedemann-Franz law, unable to describe the positive deviation in the TbMn_6Sn_6 experiment <cit.>. Similarly, if we include the disorder contribution, the total correction to the\nα_xy/σ_xy is also not consistent with the experiment <cit.>. These results imply that the topological contribution is dominant in these topological kagome magnet experiments so far <cit.>.\n\n\n\n\n\n\n\n\nTo see if the above results based on the 2D Dirac model can be generalized to 3D, we also use a 3D Dirac model to calculate the topological correction to κ_xy^in/σ_xy^in and α_xy^in/σ_xy^in <cit.>\n\n\n    ℋ=v 𝐤·α+(m-bk^2)β+Mσ_0⊗σ_z,\n\nwhere v, m, b, and M are model parameters, α_i=σ_x⊗σ_i and β=σ_z⊗σ_0 are Dirac matrices, 𝐤=(k_x,k_y,k_z) is the wavevector with k=|𝐤|.\nWhen the parameters mb>0, this model can characterize a magnetic topological insulator. The last term is the Zeeman energy that describes magnetism, which\nbreaks time-reversal symmetry to unveil the hidden Berry curvature, as seen in inset of Fig. <ref> (d).\n\n\n\n\n\nIn Fig. <ref>, we present the numerical results of κ_xy^in/σ_xy^in and α_xy^in/σ_xy^in for the 3D Dirac model in Eq. (<ref>), which show similar temperature and chemical potential dependences to those described by the 2D Dirac model and in the experiments. Specifically, the violation of the classical Wiedemann-Franz law becomes stronger as the chemical potential approaches the band edge and as temperature is increased, and κ_xy^in/σ_xy^in is below and above the classical value, respectively, as the chemical potential is very close to and moves away from the band edge.\nThese numerical results of 3D Dirac model show that our analytical formulas based on the 2D Dirac model could be a qualitative tool to study the topological corrections to the Wiedemann-Franz law and Mott relation in the topological magnets.\n\nTo conclude, we analytically and numerically calculated the corrections to the  Wiedemann-Franz law and Mott relation for topological kagome magnets, by treating the topological correction and disorder correction on same footing. By comparing our results with the recent experiments with opposite behaviors, we show the dominance of the topological correction from the Berry curvature in the experiments. More importantly, our analytic formulas for the topological correction will be an useful tool to explore the emergent topological magnets.\n\n\nWe thank Jia-Xin Yin for helpful discussions. This work was supported by the National\nKey R&D Program of China (2020YFA0308900), \nInnovation Program for Quantum Science and Technology (2021ZD0302400),\nthe National Natural Science Foundation of China (11925402),\nthe National Basic Research Program of China (2015CB921102), the Strategic Priority Research Program of Chinese Academy of Sciences (XDB28000000),\nGuangdong province (2020KCXTD001 and 2016ZT06D348), \n\nand the Science, Technology and Innovation Commission of Shenzhen Municipality (ZDSYS20170303165926217, JAY20170412152620376, and KYTDPT20181011104202253). The numerical calculations were supported by Center for Computational Science and Engineering of SUSTech.\n\n\n\n\n\n"}