{"entry_id": "http://arxiv.org/abs/2303.06933v1", "published": "20230313085659", "title": "Distributionally Robust Chance-Constrained Optimization for Hierarchical UAV-based MEC", "authors": ["Can Cui", "Ziye Jia", "Chao Dong", "Zhuang Ling", "Jiahao You", "Qihui Wu"], "primary_category": "cs.NI", "categories": ["cs.NI", "eess.SP"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nDistributionally Robust Chance-Constrained Optimization for Hierarchical UAV-based MEC\n    \n\tCan Cui^†, Ziye Jia^†, Chao Dong^†, Zhuang Ling^∗, Jiahao You^† and Qihui Wu^†\n\n\t^†The Key Laboratory of Dynamic Cognitive System of Electromagnetic Spectrum Space, Ministry of Industry and Information Technology, Nanjing University of Aeronautics and Astronautics, Nanjing, Jiangsu, 210016, China\n\n\t\t^∗College of Communication Engineering, Jilin University, Changchun, Jilin, 130012, China.\n\n\t\t{cuican020619, jiaziye, dch, yjiahao, wuqihui}@nuaa.edu.cn, lingzhuang@jlu.edu.cn\n\t\n\n    March 30, 2023\n=====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\nempty \n\nempty\n\nMulti-access edge computing (MEC) is regarded as a promising technology in the sixth-generation communication. However, the antenna gain is always affected by the environment when unmanned aerial vehicles (UAVs) are served as MEC platforms, resulting in unexpected channel errors. In order to deal with the problem and reduce the power consumption in the UAV-based MEC, we jointly optimize the access scheme and power allocation in the hierarchical UAV-based MEC. Specifically, UAVs are deployed in the lower layer to collect data from ground users. Moreover, a UAV with powerful computation ability is deployed in the upper layer to assist with computing. The goal is to guarantee the quality of service and minimize the total power consumption. We consider the errors caused by various perturbations in realistic circumstances and formulate a distributionally robust chance-constrained optimization problem with an uncertainty set. The problem with chance constraints is intractable. To tackle this issue, we utilize the conditional value-at-risk method to reformulate the problem into a semidefinite programming form. Then, a joint algorithm for access scheme and power allocation is designed. Finally, we conduct simulations to demonstrate the efficiency of the proposed algorithm.\n\n\n\n\tUnmanned aerial vehicles, multi-access edge computing, distributionally robust optimization, conditional value-at-risk.\n\n\n\n\n\n§ INTRODUCTION\n\n[lines=2]Due to the rapid development of smart devices and artificial intelligence, there exist a growing number of application data to be processed, which is an outstanding characteristic in the sixth generation of communication system <cit.>. Besides, an emergent architecture, multi-access edge computing (MEC), becomes prevalent in recent years, which contributes to reducing the system delay and improving the quality of service (QoS) <cit.>. Furthermore, unmanned aerial vehicles (UAVs) are well known due to the easy deployment and flexible\nmovement, which attract tremendous attentions in both academics and industries. UAVs can serve as communication relay nodes, mobile base stations (BSs), as well as computing platforms for MEC <cit.>, <cit.>. However, since there exist uncertain environmental factors such as wind, temperature, and airflow, the gains of UAVs are under uncertainty sets due to the environmental factors. For instance, the effect of wind results in the fluctuation of transmission gain within a certain range, and the extreme temperature leads to transmission gain errors. The effects of such unpredictable errors cannot be ignored in practical applications.\n\nAs illustrated that UAV-enabled MEC system can provide benefits for energy-efficient task offloading, there exist a couple of related works <cit.>. For example, <cit.> studies a UAV-based mobile cloud computing system to minimize total energy consumption. In <cit.>, Zeng et al. propose an algorithm to maximize the throughput by jointly optimizing the trajectory of the UAV swarm along with the transmit power. <cit.> presents a UAV-assisted MEC for task offloading which is solved with a deep reinforcement learning method. In <cit.>, a response delay optimization algorithm is suggested for the deployment of UAVs as well as MEC servers. However, the uncertain errors of transmission gains are ignored or described as a certain distribution in the aforementioned works, which are not realistic in the practical environment. As above, in this paper, we consider the errors without distribution information to minimize the total power consumption in the hierarchical UAV-based MEC. Since there exist unpredictable parameters such as gain errors, which are in an uncertainty set, the proposed optimization problem is still intractable. Hence, a distibutionally robust optimization (DRO) problem considering the uncertainty of gains is further proposed to deal with this issue.\n\nBoth the stochastic programming and robust optimization can be applied to uncertain optimization problems, and the distribution information of random parameters is necessary, which cannot be obtained in some scenarios<cit.>, <cit.>. However, DRO can be implemented without such detailed statistical information and provide more conservative solutions <cit.>. Besides, without distribution information on the uncertainty, the DRO problems are usually computationally-prohibitive. One approach to solving the DRO problem utilizes the conditional value-at-risk (CVaR) with limited statistical information <cit.>, <cit.>. Utilizing CVaR with historical data, we formulate the chance-constrained problem into a semidefinite programming (SDP) form, which can be handled with feasible solutions <cit.>. In this paper, we build the uncertainty set for the error parameters with historical data, enabling more practical applications. Accordingly, the system model can be formulated as a DRO problem and solved via the CVaR mechanism.\n\t\nIn detail, we propose a hierarchical UAV-assisted MEC system to complete data processing and transmit data back to the ground station. The system is applicable to many real scenarios, such as real-time monitoring and disaster rescue for remote areas short of BS coverage <cit.>,<cit.>. Note that the UAVs are always constrained by energy, the total power consumption should be optimized, and the QoS of users also should be guaranteed. Taking into account the errors from antenna gains, we propose a chance-constrained problem with the uncertainty set and handle it by the CVaR mechanism. The main contributions of our work are summarized as follows.\n\n\t\n\t\n  * A hierarchical UAV-based MEC system is proposed, including the lower-layer UAVs to collect data and the upper-layer UAV for relay. Besides, both layers of UAVs are equipped with computation resources for MEC. Furthermore, the gain uncertainty from transceivers is considered for practical scenarios, and we present a corresponding system model to minimize the total power consumption under such uncertainty.\n\t\n\t\n  * The problem is formulated with an uncertainty set for transceiver gain errors, and to handle this issue, we propose a DRO-based mechanism, which is non-convex. Then, we approximate the chance constraints by the CVaR method and reformulate the issue into a tractable SDP form.\n\t\n\t\n  * To deal with the reformulated SDP problem, we present an algorithm to jointly optimize both the access scheme and power allocation. Finally, we conduct simulations to evaluate the performance of the proposed algorithm, and the results verify the effectiveness.\n\n\nThe rest of this paper is organized as follows. Section <ref> presents the system model and corresponding problem formulation. Section <ref> employs the CVaR-based mechanism to reformulate the original problem with chance constraints into a SDP form, and the corresponding algorithm is designed. Simulation results and the analyses are provided in Section <ref>. Finally, conclusions are drawn in Section <ref>.\n\n\n§ SYSTEM MODEL AND PROBLEM FROMULATION\n\nIn this paper, we consider a hierarchical UAV-assisted MEC system, in which lower-layer UAVs are deployed to collect and compute the data produced by ground users and transmit them back to the BS. Due to the limited computation resources of UAVs, a UAV with strong computing ability is deployed in the upper layer to handle the compute-intensive tasks. Lower-layer UAVs can complete the computation tasks locally and transmit the results to the BS, or transmit the data to the upper-layer UAV for further computation to reduce power consumption. Then, the upper-layer UAV transmits the processed results to the ground BS. The hierarchical UAV-based MEC scenario is shown in Fig. <ref>.\n\n\n §.§ System Model\n\n\n\n  §.§.§ Communication Model\n\nIn this subsection, the communication model of UAV-to-UAV and UAV-to-BS is investigated. We utilize 𝒩={1,2,…,i,…,N} to indicate the set of UAVs of the lower layer. Let p^d_i denote the transmit power of i-th lower-layer UAV. g_i denotes the i-th UAV transceiver antenna gain and B_i indicates the bandwidth. Consequently, the data transmission rate from the i-th UAV in the lower layer to the upper-layer UAV or the BS is expressed as:\n\n    r_i=B_ilog_2(1+γ_ip^d_i|g_i|^2/σ_s^2),∀ i∈{1,2,…,N},\n\nwhere σ_s^2 is the variance of white Gaussian noise with a mean value of 0. γ_i is the path loss related to the distance between i-th lower-layer UAV and upper-layer UAV, or between i-th lower-layer UAV and BS.\n\nWe assume the data transmission adopts the orthogonal multiple access technology in this system, so the interference between different data can be ignored. Moreover, only one powerful UAV is considered in the upper layer.\n\nLet B_h denote the bandwidth of the upper-layer UAV. p^d_h is the transmit power, g_h denotes the transceiver antenna gain of the UAV hovering in the upper layer, and γ_h represents the path loss. According to the Shannon formula, the data transmission rate of the upper layer UAV towards the BS is calculated as:\n\n    r_h=B_hlog_2(1+γ_hp^d_h|g_h|^2/σ_s^2).\n\n\n\n\n\n\nWe assume L_i represents the data length transmitted by the i-th UAV. x_i∈{0,1} is a binary indicator for computing mode. x_i=1 represents the i-th UAV transmits the users' data to the upper-layer UAV for further computation, and x_i=0 denotes the i-th UAV computes collected data locally and transmit them back to the BS.\n\nBased on the above formulas, we can obtain the transmission delay as follows:\n\n    t_i^d=L_i/r_i,∀ i∈{1,2,…,N},\n\nand \n\n    t_h^d=∑_i^N x_i L_i/r_h,\n\nwhere t_i^d denotes the transmission delay of the i-th UAV in the lower layer, and t_h^d is the transmission delay of the upper-layer UAV, respectively. Further, the total transmission power p_r^d of UAVs in the lower layer is\n\n    p_r^d=∑_i=1^Np_i^d.\n\n\n\n  §.§.§ Uncertainty Model\n\nTake into account the transceiver antenna gain errors influenced by the environmental factors denoted as Δ g_i and Δ g_h, i.e.,\n    g_i=g_i+Δ g_i,∀ i∈{1,2,…,N},\n\nand\n    g_h=g_h+Δ g_h,\n\nwhere g_i and g_h indicate the theoretical antenna transmission gain of the i-th lower-layer UAV and upper-layer UAV, respectively. Similarly, Δg_i and Δg_h represent the antenna gain errors produced by actual environmental impacts. The estimation error Δg_i and Δg_h are assumed to follow an unknown distribution ℙ with mean 𝔼_ℙ(Δ g_i)=μ_i and 𝔼_ℙ(Δ g_h)=μ_h, as well as the variance 𝔻_ℙ(Δ g_i)=σ_i^2 and 𝔻_ℙ(Δ g_h)=σ_h^2, respectively. Uncertainty set 𝒫 reprensents for all possible probability distributions of Δg_i and Δg_h, i.e., ℙ∈𝒫.\n\n\n  §.§.§ Computation Model\n\n\nLet variable c_i represent the complexity of the computing tasks processed by the i-th UAV. η_i and η_h denote the computational power consumption coefficient of the i-th lower-layer UAV and the upper-layer UAV, respectively, which represent the power required to calculate the data of each cycle. Then we can formulate the computation power of i-th lower-layer UAV and the upper-layer UAV as:\n    p_i^c=η_ic_i,∀ i∈{1,2,…,N},\n\nand \n    p_h^c=η_h∑_i=1^N x_ic_i.\n\n\nWith the above formulations we can obtain the total computation power consumption of UAVs in the lower layers as:\n\n    p_r^c=∑_i=1^N (1-x_i)p_i^c.\n\n\n\n\n  §.§.§ Power Consumption\n\nAccording to the above discussion, ignoring the power required for UAV hovering and flying, which is a constant value, the total power is expressed as:\n\n    P_total=p_r^d+p_h^d+p_r^c+p_h^c.\n\n\n\n\n §.§ Problem Formulation\n\nIn this part, we focus on reducing the total power in the system for a better service. The target is to minimize P_total by jointly optimizing the UAV access scheme and power allocation when the QoS meets users' demands. Hence, the problem is formulated as\n\n    P0:\t   min_x_i,p_i^d,p_h^d P_total, \n       s.t.  𝐶1: 𝐏𝐫{t_i^d≤ t_i,max^d}≥α_1,∀ i,\n           𝐶2: 𝐏𝐫{t_h^d≤ t_h,max^d}≥α_2, \n           𝐶3: 0≤∑_i=1^N x_i≤ m,\n           𝐶4: x_i∈{0,1},∀ i,\n           𝐶5: p_i^d≥0,∀ i,\n           𝐶6: p_h^d≥0,\n\nwhere 𝐶1 and 𝐶2 are the chance constraints, indicating that the transmission delays of UAVs are constrained in a probabilistic manner. In other words, the delays should not be larger than the tolerable delay t_i,max^d and t_h,max^d with probabilities of α_1 and α_2 at a minimum, respectively. Futhermore, α_1, α_2 ∈ (0,1). 𝐶3 denotes that the upper-layer UAV with powerful computation ability can at most access 𝑚 UAVs at the same time. 𝐶4 denotes 𝑥_𝑖 is a binary variable. 𝐶5 and 𝐶6 guarantee that p_i^d and p_h^d are non-negative continuous variables.\n\nDue to the chance contraints (<ref>) and (<ref>), the transmission delay t_i^d and t_h^d in P0 are difficult to obtain. However, there exists one effective way to handle the problem with distributionally robust method. Specifically, let ℙ∈𝒫inf represent the lower bound of the probability under the probability distribution ℙ, and (<ref>) and (<ref>) can be rewritten by:\n\n    ℙ∈𝒫inf  𝐏𝐫_ℙ{t_i^d≤ t_i,max^d}≥α_1, ∀ i∈{1,2,…,N},\n\nand\n\n    ℙ∈𝒫inf  𝐏𝐫_ℙ{t_h^d≤ t_h,max^d}≥α_2 ,\n\nrespectively, which are distributionally robust chance constraints (DRCCs).\n\n\n\n§ REFORMULATION AND ALGORITHM\n\nSince the DRCC problems (<ref>) and (<ref>) are intractable with the uncertainty set, in this section, we employ the CVaR mechanism to handle the issue and then design an algorithm to obtain the final solution.\n\n\n §.§ CVaR Based Mechanism\n\nGenerally, the value-at-risk (VaR) of a variable u with the safety factor α is defined as the minimal value of v, and u is no more than v at a possibility of α <cit.>, i.e.,\n\n    VaR_α(u)=min{v|P(u ≤ v) ≥α}.\n\n\nIt is noted that VaR is non-convex and discontinuous. Based on VaR, we can consequently propose the definition of CVaR, which is defined as the conditional expectation of u when u ≥ VaR_α(u), i.e.,\n\n    CVaR_α(u)=E[u|u≥ VaR_α(u)].\n\n\nThe relationship between VaR and CVaR is shown in Fig. <ref>. It is obvious that CVaR_α(u)≥ VaR_α(u) <cit.>. Furthermore, CVaR is a conservative approximate estimation of loss, which is robust. As is proposed in <cit.>, for a given measurable loss function φ(ξ): ℝ^k →ℝ, CVaR under the safety factor α concerning the probability distribution ℙ on ℝ^k is expressed as:\n\n\n    ℙ-CVaR_α(φ(ξ))=β∈ℝinf{β+1/1-α𝔼_ℙ[max(0,φ(ξ)-β)]}.\n\n\nAs is shown in Fig. <ref>, according to the definition, we can then obtain the following formula:\n\n    ℙ{φ(ξ)≤ℙ-CVaR_α(φ(ξ))}≥α.\n\n\nAs above, the CVaR constraint can be formed as:\n\n    ℙ∈𝒫sup  ℙ-CVaR_α(φ(ξ))≤0, ∀ℙ∈𝒫⇔\n    ℙ∈𝒫inf  ℙ{φ(ξ)≤0}≥α.\n\nFormula (<ref>) represents that the conservative approximation of DRCC on the right side can be constituted by the CVaR constraint on the left side. In other words, CVaR represents a convex function of the random parameter. Then, we can reformulate the CVaR constraint into a tractable SDP form.\n\nLemma 1: Let φ(ξ)=ξ^⊤Θξ+θ^⊤ξ+θ^0 for Θ∈𝕊^k, θ∈ℝ^k, and θ^0∈𝐑, and then, the worst-case CVaR ℙ∈𝒫sup  ℙ-CVaR_α(φ(ξ)) can be rewritten into a tractable SDP as follows:\n\n    inf  β+1/1-α⟨Ω,H⟩,\n    s.t.     H∈𝕊^k+1,   β∈ℝ,\n       H≽0,\n       H-[Θ   1/2θ\n    1/2θ^⊤   θ^0-β\n    ]≽0,\n\nwhere Ω=[Σ+μμ^⊤   μ\nμ^⊤    1\n], Σ∈𝕊^k is the covariance of the random vector ξ, and μ∈ℝ^k is the mean matrix. Furthermore, H is an auxiliary matrix and β is an auxiliary variable. ⟨Ω,H⟩=Tr (ΩH) represents the trace scalar product. H≽0 represents that the matrix H is positive semidefinite<cit.>.\n\nTherefore, according to Lemma 1, we transform the DRO into the form of SDP by the CVaR mechanism, which is a tractable and computationally efficient approximation technique. This form can be regarded as an extension of linear programming, and the effectiveness of this solution is proved in previous works <cit.>.\n\n\n §.§ Problem Reformulation\n\nAs for (<ref>), a DRCC problem, the first-order Taylor expansion of the loss function is\n\n    φ(ξ_1)=L_iσ_s^2-B_iγ_ip^d_it_i,max^dξ_1^2,\n\nwhere ξ_1 denotes the random parameter |g_i|.\n\nCVaR can construct a convex approximation for the chance constraints. According to Lemma 1, we transform (<ref>) into a SDP problem, i.e.,\n\n    inf  β_1+1/1-α_1⟨Ω_1,H_1⟩≤0,\n    s.t.     H_1∈𝕊^2,   β_1∈ℝ,\n       H_1≽0,\n       H_1-[\n    \t\t\t-B_iγ_ip_i^dt_i,max^d     0\n    \n    \t\t\t0    L_iσ_s^2-β_1\n    ]≽0,\n\nwhere H_1 and β_1 are both auxiliary variables. Let μ_g_i=g_i+μ_i present the mean of g_i, we have\n\n    Ω_1=[σ_i^2+μ_g_iμ_g_i^⊤   μ_g_i\n    μ_g_i^⊤    1\n    ].\n\n\nLikewise, let ξ_2 denote the random parameter |g_h|, and the loss function in (<ref>) can be rewritten as:\n\n    φ(ξ_2)=∑_i=1^N x_iL_iσ_s^2-B_hγ_hp^d_ht_h,max^dξ_2^2,\n\nwhich can be further presented in a SDP form, i.e.,\n\n    inf  β_2+1/1-α_2⟨Ω_2,H_2⟩≤0,\n    s.t.     H_2∈𝕊^2,   β_2∈ℝ,\n       H_2≽0,\n       H_2-[\n    \t\t\t-B_hγ_hp^d_ht_h,max^d     0\n    \n    \t\t\t0    ∑_i=1^Nx_iL_iσ_s^2-β_2\n    ]≽0.\n\nSimilarly, H_2 is the auxiliary matrix, and β_2 is the auxiliary variable for the CVaR constraint. μ_g_h=g_h+μ_h is the mean value of g_h. Then we obtain\n\n    Ω_2=[σ_h^2+μ_g_hμ_g_h^⊤   μ_g_h\n    μ_g_h^⊤    1\n    ].\n\n\nFinally, based on above discussions, the chance-constrained problem (<ref>) under the uncertainty set can be reformulated into a SDP form, i.e.,\n\n    P1:     min_x_i,p^d_i,p^d_h,\n    H_1,H_2,β_1,β_2P_total,\n       𝐬.𝐭.  (<ref>)-(<ref>), (<ref>), (<ref>),\n       ∀ i∈{1,2,…,N},\n\nwhich is still non-convex with the binary variable x_i, and continuous variables p^d_i and p^d_h. The problem is in the form of mixed integer non-linear programming. To tackle with this problem, we design a joint optimization algorithm on access scheme and power allocation, as shown in Algorithm <ref>.\n\n\n §.§ Algorithm Design\n\nIt is observed that due to the two decision variables x and p^d, problem P1 is still non-convex. To solve this problem, we divide it into two subproblems. The first subproblem is concerning the access scheme x, and the second subproblem is related to the transmission power allocation plan p^d.\n\nAs shown in step 2 of Algorithm <ref>, in the first subproblem, an initial value p^d is assumed to minimize the computation power consumption and ensure the access scheme, i.e., x. In other words, the lower-layer UAVs make a choice to complete the computation work locally or transform it to the upper-layer UAV based on the task complexity. The problem with integers is solved by MOSEK. Then, in the second subproblem, according to the access scheme x^* that is obtained in step 2, we can further substitute it to solve the transmission power allocation program. Specifically, the subproblem can be tackled by fixing the access scheme, i.e., x^*. Then, in step 3 of Algorithm <ref>, the transmission power is allocated and variables p^d_i as well as p^d_h are obtained. Repeat the process until the solutions of two subproblems converge. The final result, i.e., the total power consumption P_total in the hierarchical UAV-assisted MEC system, can be figured out as optval.\n\n\n\n§ SIMULATION RESULTS\n\nNumeral simulations are conducted to evaluate the performance of the proposed algorithm. Briefly speaking, the data lengths are assumed to range from 40kbits to 60kbits. B_i and B_h are assumed as 10MHz and 10MHz, respectively. The task complexities range from 40kcycles to 100kcycles. The CPU computational power consumption coefficient η_i is 5×10^-6cycles/W, and η_h is 10^-6cycles/W. Antenna gains |g_i| and |g_h| are 5. The mean value of errors is 0 and the variance is 0.01 for all. Furthermore, noise σ_s^2 is assumed as 10^-12W. The safety factors are α_1=0.95 and α_2=0.95.\n\nTo verify the effectiveness and feasibility, we compare the results of the CVaR method and non-robust method without uncertainty errors Δg_i and Δg_h. In detail, Fig. <ref> shows the performance of two methods in total power v.s. the number of lower-layer UAVs. As the number of lower-layer UAVs increases, the total power consumption of the MEC system increase as well. It can be explained that as the scale of the whole problem becomes larger, the users' data collected are larger to be computed and transmitted. Comparing the results of the two methods, it is observed the power consumption in the CVaR method is smaller than that in the non-robust method. It is explained that there is a tolerance in the CVaR method, so that the transmission power of each UAV can be reduced within the tolerant range. Moreover, different from the non-robust method, which optimizes the problems under the perfect assumption which is apparently inconsistent with the real circumstance, the designed algorithm takes into account the uncertainties in reality and is applicable to the real situation.\n\n\n\n\nFig. <ref> shows the individual transmission power of each lower-layer UAV when there exist six UAVs in the lower layer. We compare the result with the non-robust method. For tasks varying in data length, it demonstrates that the CVaR method performs better in transmission power consumption. The conclusion can be drawn that the proposed method, which is considered in a more realistic world, can obtain a better result than that in the ideal situation. Specifically, considering the errors between the real situation and the ideal situation, the designed algorithm only needs to obtain the mean and variance of the gain errors from the historical data, instead of obtaining the true distribution or probability function of the errors. The experimental results verify the effectiveness of the proposed joint optimization algorithm on access scheme and power allocation.\n\nIn Fig. <ref>, we investigate the performance of total power consumption, i,e., the corresponding system power v.s. lower-layer UAV numbers for different maximum transmission delays. It depicts the influence of the maximum tolerance on the total power. With the increment of maximum delay to be satisfied, the transmission power consumption reduces. It is accounted for the fact that transmission rates become lower for all UAVs when the tolerance transmission delay increases.\n\n\n\n\n§ CONCLUSIONS\n\nIn this paper, we study a hierarchical UAV-assisted MEC scenario to optimize the power consumption. To tackle with the potential uncertainty impacted by environmental factors, which is not ignorable in practical circumstances, a DRO problem based on the uncertainty set is proposed. Then, with the CVaR mechanism, the original problem is reformulated into a SDP form. To jointly optimize the reformulation on the access scheme and power allocation, we further design an algorithm to handle it and obtain the final solution. By conducting simulation experiments, the robustness and feasibility of the proposed algorithm compared with the non-robust method are verified.\nIEEEtran\n\n"}