{"entry_id": "http://arxiv.org/abs/2303.06932v1", "published": "20230313085512", "title": "Homotopy equivalent boundaries of cube complexes", "authors": ["Talia Fernós", "David Futer", "Mark Hagen"], "primary_category": "math.GT", "categories": ["math.GT", "math.GR", "math.MG", "51F99 (Primary) 20F65 (Secondary)"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nmatrix\nmatrix,shapes,backgrounds\n\n\n\n\n\n\n\n\n\n\n\n\n.tifpng.png`convert #1 `dirname #1`/`basename #1 .tif`.png\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\ncom\n\nyes\n\n\n        [t]1in[footnote]\n\n\n\nyes\n\n\n\n\n\n\nequationsection\n\ncl\n\n\ntheorem[equation]Theorem\n*theorem'Main Theorem\n*theoremnnTheorem\nquestion[equation]Question\nquestions[equation]Question\nprop[equation]Proposition\nreductionReduction\nclaim[equation]Claim\n*clamClaim\ncor[equation]Corollary\nlemma[equation]Lemma\n*GromovGromov's Lemma\nthmiTheorem\n\n*namedtheorem\n\nnamed[1]\n\ndefinition\ndefinition[equation]Definition\n*remRemark\nremark[equation]Remark\nconvention[equation]Convention\nexample[equation]Example\nfacts[equation]Facts\n\n\n\n\n\n\n(\n    [\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Mathematics and Statistics Dept., University of North Carolina at Greensboro, Greensboro, NC 27412, USAt_fernos@uncg.eduDept. of Mathematics, Temple University, Philadelphia, PA 19122, USAdfuter@temple.eduSchool of Mathematics, University of Bristol, Bristol BS8 1UG, UKmarkfhagen@posteo.net\n    A finite-dimensional CAT(0) cube complex X is equipped with several well-studied boundaries. These include the \n    Tits boundaryX (which depends on the CAT(0) metric), the Roller boundaryX (which \n    depends only on the combinatorial structure), and the simplicial boundaryX (which also depends only on the combinatorial structure). We use a partial order on a certain quotient of \n    X to define a simplicial Roller boundary  X. Then, we show that X, X, and X are all homotopy equivalent, (X)–equivariantly up to \n    homotopy. As an application, we deduce that the perturbations of the CAT(0) metric introduced by Qing do not affect the equivariant homotopy type of the Tits boundary. Along the way, we develop a \n    self-contained exposition providing a dictionary among different perspectives on cube complexes.\n    Homotopy equivalent boundaries of cube complexes\n        Mark Hagen\n        March 30, 2023\n    ================================================\n    \n    \n    \n    § INTRODUCTION\n    \n    \n    CAT(0) cube complexes, which exist in many guises in discrete mathematics (see e.g. <cit.>), were introduced into \n    group theory by Gromov <cit.> and have since taken on a central role in that field.  As \n    combinatorial objects, CAT(0) cube complexes are ubiquitous due to their flexible, functorial construction from set-theoretic data <cit.>.  This has led to an \n    industry of cubulating groups, i.e. \n    constructing group actions on CAT(0) cube complexes in order to transfer  information from the highly organized cubical structure to the group.  Probably the best known application of this method is the resolution of the virtual \n    Haken and virtual fibering conjectures in 3–manifold theory <cit.>.\n    \n    The utility of CAT(0) cube complexes comes from the fact that they simultaneously exhibit several types of structures.  They have an organized combinatorial structure coming from their hyperplanes/half-spaces; this is closely \n    related to the very tractable geometry of their 1–skeleta, which are median graphs<cit.>.  On the other \n    hand, endowing the complex with the piecewise-Euclidean metric in which cubes are Euclidean unit cubes, one gets a CAT(0) \n    space.  So, in studying CAT(0) cube complexes, and groups acting on them, one has a wide variety of tools.\n    \n    This paper is about the interplay between the CAT(0) and combinatorial structures, at the level of boundaries.    \n    We construe the term “boundary” broadly: we include not just  spaces arising as frontiers of injections into compact spaces, \n     but also other spaces encoding some sort of behavior at infinity or large-scale asymptotic structure, such as the Tits boundary. \n    \n    \n    \n    \n    \n     §.§ A plethora of boundaries\n     \n    CAT(0) cube complexes have several natural boundaries, each encoding different information, and each defined in terms \n    of either the CAT(0) metric structure or the combinatorial structure coming from the hyperplanes.  Fixing a \n    finite-dimensional CAT(0) cube complex X, one has the following list of boundaries:\n    \n      *  The visual boundaryX. \n          The visual boundary can be defined for any CAT(0) space; see \n    <cit.>.  Points are asymptotic equivalence \n    classes of CAT(0) geodesic rays. The visual topology is defined in such a way \n    that, roughly speaking, rays that fellow-travel for a long time are close.  When X is locally finite, X∪ X is \n    a compactification of X.  While it is a very useful object, we do not study the visual boundary in this paper.\n    \n    \n      *  The Tits boundaryX.  As with X, the points in X correspond to asymptotic equivalence classes of CAT(0) \n    geodesic rays, but the topology is finer than the visual topology.  Specifically, we equip X with the Tits \n    metric: by taking a supremum of angles between rays\n     one obtains the angle metric, and the \n    induced length metric is the Tits metric, which is CAT(1); see <cit.>.  The Tits boundary encodes much of the \n    geometry of a CAT(0) space; for example, spherical join decompositions of the Tits boundary correspond to product \n    decompositions of the space <cit.>.  Although X is in general not compact even when X is \n    proper, it is  of interest for  other reasons, such as encoding “partial flat regions” in X. For example, endpoints \n    of axes of rank-one isometries are isolated points, while flats in X yield spheres in X.  We recall the definition \n    of X in Definition <ref>.\n    \n    \n      *  The simplicial boundaryX, from <cit.>, is an analogue \n    of the Tits boundary depending on the hyperplane structure, rather than on the CAT(0) metric.  The idea is that certain sets \n    of hyperplanes — termed unidirectional boundary sets (hereafter, UBSes) — identify “ways of approaching infinity in X.”  Containment of UBSes (modulo finite differences) gives a partial order on \n    UBSes, and this order gives rise to a simplicial complex X (see Definition <ref>).  Here are three helpful examples. First, the simplicial boundary of a tree (or, more generally, of a δ–hyperbolic cube complex) is a discrete set \n    of 0–simplices. Second, the simplicial boundary of the standard square tiling of [0,∞)^2 is a 1–simplex, whose 0–simplices correspond to the sub-UBSes consisting of the vertical hyperplanes \n    and the horizontal hyperplanes. Third,  the staircase obtained from this square tiling by considering only the cubes below some increasing, unbounded function also has simplicial boundary a \n    1–simplex. (See Figure <ref>.) The maximal simplices of X encode such “generalized orthants” (namely, convex hulls of ℓ^1–geodesic rays) in X in roughly the same way that the Tits boundary encodes “partial flats.”\n    \n    The \n    simplicial boundary has been used to study quasi-isometry invariants like divergence<cit.> and \n    thickness<cit.> for groups acting on cube complexes, and has been generalized in the context of \n    median spaces<cit.> as a tool for proving a Tits alternative for groups acting on such spaces.\n    \n    \n    \n    \n      *  The Roller boundaryX gives another way of compactifying X, using the half-space structure associated to the hyperplanes.\n      Each hyperplane ĥ of X has two complementary components, called half-spaces, h and h^*, which induce a two-sided partition of \n    X^(0).  Each vertex x∈ X is completely determined by specifying the collection of half-spaces that contain it.  This gives an injective map X^(0)→ 2^ℌ, where \n    ℌ denotes the set of half-spaces.  The closure of the image of X^(0) in the Tychonoff topology is the Roller compactificationX, and X=X∖ X^(0) is the \n    Roller boundary of X. (See Definition <ref>.) \n    \n    \n    Of the boundaries of X that are defined in terms of the cubical structure only, the Roller boundary is perhaps the most well-studied. It has been used to prove a variety of results about CAT(0) \n    cube complexes and groups acting on them.\n    \n    For example, the Roller boundary plays a key role in the proof that irreducible lattices in _2×_2 always \n    have global fixed points in any action on a CAT(0) cube complex, while reducible actions always admit proper cocompact \n    actions on CAT(0) cube complexes <cit.>. \n    \n    Nevo and Sageev identified the Roller boundary as a model for the Furstenberg–Poisson boundary of a cocompact lattice in \n    (X)<cit.>.  Fernós generalized this result  \n     to groups acting properly and non-elementarily on finite dimensional X, and also proved a Tits alternative \n    <cit.>.   The same paper identifies an important subset of the Roller boundary: the regular points, \n    which \n    correspond to “hyperbolic” directions in various senses.  \n    \n    In particular,  the set of regular points with the induced \n    topology is (X)–equivariantly homeomorphic with the boundary of the (hyperbolic) contact graph<cit.>.  The set of regular points is used in <cit.> to find rank-one isometries under more \n    general conditions than in previous \n    work <cit.>.  The method in <cit.> is to use convergence of random walks to regular points to \n    deduce the existence of regular elements without assuming that the ambient group is a lattice.\n    \n    The set of regular points also features in the proof of marked length spectrum rigidity <cit.>, \n    and was independently identified by Kar and Sageev, who used it to study property P_naive and hence \n    C^*–simplicity for cubulated \n    groups <cit.>.  Finally, the Roller boundary has recently been generalized in the context of median spaces \n    <cit.>.\n    \n      \n      \n      *  The simplicial Roller boundaryX is constructed as follows.\n         The Roller boundary X carries a natural equivalence relation, first introduced \n     by Guralnik <cit.>, where two points \n    are equivalent if they differ on finitely many half-spaces.  The equivalence classes, called Roller classes, play a fundamental role in this paper.  Part of the reason for this is that the set of Roller \n    classes carries a natural partial order, which admits several equivalent useful characterizations (see Lemma <ref>).  The simplicial Roller boundaryX is the simplicial \n    complex realizing this partial order (see Definition <ref>).  \n    \n    In this paper, we build on earlier work relating Roller classes to CAT(0) geodesic rays.  Specifically, Guralnik in <cit.> recognized that each equivalence class of CAT(0) geodesic rays  determines a \n    Roller class.  Conversely, in <cit.>, it is shown that each Roller class determines a subset of the Tits boundary which admits a canonical circumcenter.  These observations \n    are crucial for our arguments: Definition <ref> depends on the latter and Definition <ref> is based on the former.\n    \n    We also note that X is isomorphic to the \n     combinatorial boundary defined and studied by Genevois <cit.>. In that work, he explains that the combinatorial boundary is isomorphic to the \n    face-poset of a naturally-defined subcomplex of X<cit.> and is isomorphic to X<cit.>.  (More precisely, Genevois' work yields the map  from Corollary <ref> below, although <cit.> does not \n    explicitly mention a homotopy equivalence.)  \n    \n    \n    For each of these boundaries, the action of the group (X) of cubical automorphisms of X extends to an action on the \n    boundary preserving its structure. The actions on X and X are by homeomorphisms, the action on X is by isometries of the Tits metric, and the actions on X and X are by simplicial automorphisms.\n    \n    The definitions of the simplicial boundary and the simplicial Roller boundary are conceptually similar. Part of the work \n    in this paper is making that similarity precise, by establishing a correspondence between Roller classes and equivalence \n    classes of UBSes. This line of work culminates in Corollary <ref>, which gives explicit maps between X and a \n    natural subcomplex of X. These maps are (X)–equivariant homotopy equivalences, although in general they are \n    not simplicial isomorphisms.  Then, in Proposition <ref>, we upgrade this to a homotopy equivalence \n    between X and the whole of X.\n    \n    One glimpse of a relationship between X and X comes from UBSes associated to geodesic rays. Given a geodesic ray α→ X, in either the CAT(0) metric or the combinatorial metric, the set of hyperplanes crossing α (denoted (α)) is always a UBS. A UBS  is called ℓ^1–visible (resp. ℓ^2–visible) if it is has finite symmetric difference with (α) for a combinatorial (resp. CAT(0)) geodesic α. Figure <ref> shows examples of both ℓ^1–invisible and ℓ^2–invisible UBSes. Despite those caveats, ℓ^2–visible UBSes provide a way to map points of X to classes in X; a similar construction also provides a map to X. \n    \n    \n    \n     §.§ Main result\n      Our main theorem relates X, X, and  X via maps that are (X)–equivariant up to homotopy.  \n    It helps to introduce the following terminology.  \n    \n    \n    Suppose \n    that A,B are topological spaces with a group G acting on both spaces by homeomorphisms.  A map f  A → B is called a\n    a  homotopy equivalence \n    if f is a homotopy equivalence, and furthermore  g∘ f and f∘ g are \n    homotopic for every g∈ G.  If such an f exists, we say that A,B are  homotopy equivalent.\n    \n    \n    It is immediate to check that the property of being  homotopy equivalent is an equivalence relation. \n    Indeed, the composition of two  homotopy equivalences is a  homotopy equivalence. Furthermore, any homotopy inverse of a  homotopy equivalence is itself a\n     homotopy equivalence. \n    \n    \n    \n    Let X be a finite-dimensional CAT(0) cube complex.  Then \n    we have the following commutative diagram of  homotopy equivalences between boundaries of X:\n    \n    \n      X       ^       X  \n       _      _   \n          _ X      \n    In particular, the spaces X, X, X are all  homotopy equivalent, where X is equipped with the metric topology and X, X are equipped with either the \n    metric or the weak topology.\n    \n    \n    In the above diagram, the letter S stands for Simplicial, the letter R for Roller-simplicial, and the letter T \n    for Tits.  The map  is an  homotopy equivalence from the simplicial boundary to the Tits \n    boundary, and similarly for the other two.  The map  is provided by Corollary <ref>, and the \n    map  comes from Proposition <ref>.  The map  is just the composition =∘.\n    \n    Some intuition behind the theorem can be gleaned from the following simplified situation. A cube complex X is called fully visible if every UBS is ℓ^1–visible. \n     When X is fully visible, UBSes correspond to combinatorial \n    orthants in X (i.e. products of combinatorial geodesic rays) <cit.>, and Theorem <ref> can be understood as relating \n    combinatorial orthants to CAT(0) orthants. See <cit.>, where a proof is sketched that the simplicial and \n    Tits \n    boundaries are homotopy equivalent under the restrictive hypothesis of full visibility.  However, \n     full visibility is a very strong and somewhat mysterious hypothesis: it is not known to hold even if X \n    admits a proper cocompact group action <cit.>. Thus \n    Theorem <ref> is more satisfying (and difficult) because it does not assume this restrictive hypothesis. In order to prove the theorem, we have \n    to understand combinatorial convex hulls of CAT(0) geodesic rays, which is a much more delicate affair when one is not \n    simply assuming that these hulls can be taken to contain Euclidean orthants.\n    \n    Theorem <ref> also motivates the introduction of several new technical tools for relating the geometry of CAT(0) geodesic rays to the combinatorics of hyperplanes. We believe that these tools, explained in Section <ref>, are of independent interest.\n    \n    \n    \n    \n      \n    \n     §.§ Invariance of CAT(0) boundaries for cubulated groups\n    \n    A group G is called CAT(0) if there is a proper CAT(0) space X on which G acts \n    geometrically (properly and cocompactly).  Multiple CAT(0) spaces might admit a geometric G–action and witness that G is a CAT(0) group.  Since we are often \n    interested in invariants of the group itself, it is natural to look for features of the geometry of X that  depend \n    only on G.  For instance, in the context of a Gromov hyperbolic group G, recall that all hyperbolic groups with a geometric G–action have Gromov boundaries that are G–equivariantly homeomorphic. So one might wonder whether a similar result might hold for CAT(0) groups that are not hyperbolic.\n    \n    A famous result of Croke and Kleiner  <cit.>, on \n    which we elaborate more below, shows that this is not the case.  Explicitly, they considered the right-angled Artin group\n    \n        G=⟨ a,b,c,d : [a,b],[b,c],[c,d]⟩,\n    \n    whose Cayley 2-complex X_π/2 is a CAT(0) square complex. The subscript π/2 emphasizes the angles at the corners of the 2–cells. Viewing the 2–cells as Euclidean squares with \n    side length 1, we obtain a CAT(0) space where G acts geometrically.  Croke \n    and Kleiner deformed the squares of X into rhombi that have angles α and π - α, producing a perturbed \n    CAT(0) metric X_α,\n    and showed that this perturbation changes the homeomorphism type of the visual boundary X_α. Subsequently, Wilson\n    <cit.> showed that the visual boundaries of X_α and X_β are homeomorphic only if the angles satisfy \n    α=β, hence these perturbations produce  uncountably many homeomorphism types of boundaries.  Further examples are \n    provided by Mooney <cit.>, who exhibited CAT(0) knot groups G \n    admitting uncountably many geometric actions on CAT(0) spaces, all with different visual boundaries.  Hosaka <cit.> \n    has given some conditions on G,X,Y implying that there is an equivariant homeomorphism X→ Y \n    continuously extending the quasi-isometry X→ Y coming from orbit maps, but the preceding examples show that any such \n    condition will be hard to satisfy.\n    \n    So, one has to look for weaker results or less refined invariants, or ask slightly different questions.  This has stimulated \n    a great deal of work in various directions.  \n    \n    In the context of 2–dimensional CAT(0) complexes, there are more positive results obtained by replacing the visual \n    boundary X by the Tits boundary X, and passing to a natural subspace.  Specifically, the core of X is the union of \n    all embedded circles in X. \n     Xie <cit.> showed that if G acts \n    geometrically on CAT(0) 2–complexes X and Y, then the Tits boundaries X and Y have homeomorphic cores.\n    (This is weaker than Xie's actual statement; compare <cit.>.)   In the Croke–Kleiner example, the core is a G–invariant connected \n    component, while the rest of the Tits boundary consists of uncountably many isolated points and arcs.  \n    \n    There is a closely related result due to Qing, which inspired us to consider cuboid complexes in the present paper.  \n    Another way to perturb the CAT(0) metric on a CAT(0) cube complex X is to leave the angles alone, but to vary the lengths \n    of the edges in such a way that \n    edges intersecting a common  hyperplane are given equal length. In this perturbation, each cube becomes a Euclidean box \n    called a cuboid.  The resulting path metric is still CAT(0), at least when there are uniform upper and lower bounds \n    on \n    the edge-lengths. In particular, this happens when some group G acts on X with \n    finitely many orbits of hyperplanes, and the edge-lengths are assigned G–equivariantly.   We explain the details in \n    Section <ref>,  \n    where we define a G–admissible hyperplane rescaling in Definition <ref> and  show in \n    Lemma <ref> that the resulting path-metric space (X,^ρ_X) \n    is CAT(0) and G continues to act by isometries.  Cuboid complexes have been studied by various authors, including Beyrer \n    and Fioravanti <cit.>.\n    \n    Qing <cit.> studied the visual boundary of the CAT(0) cuboid metric under perturbation of the edge-lengths. She showed that \n    the visual boundaries of the CAT(0) cuboid complexes obtained from the  Croke–Kleiner complex X_π/2 are all \n    homeomorphic. More germane to the present paper, Qing also showed that the Tits boundaries of the rescaled cuboid complexes \n    are homeomorphic, but that no  equivariant homeomorphism exists.  (Roughly, the cores of any two such Tits boundaries are \n    homeomorphic by the result of Xie mentioned above. Via a cardinality argument, Qing extends the \n    homeomorphism over the whole boundary by sending isolated points/arcs to isolated points/arcs.  But this extension cannot be \n    done equivariantly because equivariance forces some isolated points to be sent to isolated arcs and vice versa.)  We will \n    return to cuboid complexes shortly.\n    \n    There are other results about homeomorphism type as a CAT(0) group invariant for certain classes of CAT(0) groups.  For \n    example, Bowers and Ruane <cit.> showed that if G is a product of a hyperbolic CAT(0) group and \n    ^D, then the visual boundaries of the CAT(0) spaces X and Y with a geometric G–action are equivariantly homeomorphic. However, this equivariant homeomorphism need not come from a continuous extension of a quasi-isometry X → Y.  Later, Ruane  <cit.> extended this result to the case where G is \n    a CAT(0) direct product of two non-elementary hyperbolic groups. \n    \n    Around the same time, Buyalo studied groups of the form G=π_1(S)×ℤ, where S is a hyperbolic surface <cit.>. He constructed two distinct geometric G–actions on ℍ^2× and showed that while the two copies of ℍ^2× are G–equivariantly quasi-isometric, the Tits boundaries do not admit any G–equivariant quasi-isometry. \n    \n    Since we are interested in G–equivariant results, it makes sense to seek more general positive results by replacing homeomorphism with a coarser equivalence relation.  This \n    has been a successful idea: Bestvina <cit.> proved that torsion-free CAT(0) groups have a well-defined visual \n    boundary up to shape-equivalence. \n    This was generalized by Ontaneda <cit.>, whose result removes the “torsion-free” \n    hypothesis.\n    \n    \n    Homotopy equivalence is a finer equivalence relation than shape equivalence.  Might there be some result guaranteeing that the \n    homotopy type of the Tits boundary of X is to some extent independent of the choice of the CAT(0) space X, even if we \n    allow only homotopy equivalences between boundaries that respect the G–action in the appropriate sense? One precise version of this question appears below as Question <ref>.\n    \n    \n    Motivated by Qing's results about perturbing the metric on a CAT(0) cube complex by changing edge lengths, we consider the \n    situation where G acts on the finite-dimensional CAT(0) cube complex X, and study the Tits boundaries of the CAT(0) spaces \n    that result from G–equivariantly replacing cubes by cuboids.  Now, the hyperplane combinatorics, and hence the simplicial \n    and Roller boundaries, are unaffected by this change.  And, for the unperturbed X, Theorem <ref> tells us \n    that the homotopy type of the Tits boundary is really a feature of the hyperplane combinatorics.  So, in order to conclude \n    that the homotopy type of the Tits boundary is unaffected by such perturbations of the CAT(0) metric, we just need to know \n    that Theorem <ref> holds for cuboid complexes as well as cube complexes.  \n    Indeed, we show:\n    \n    \n    \n     Let X be a finite-dimensional CAT(0) cube complex and let G be a group acting by automorphisms on X. Let (X,^ρ_X) be the CAT(0) cuboid complex obtained \n    from a G–admissible hyperplane rescaling of X.  Then the original Tits boundary X, the perturbed Tits boundary (X,^ρ_X),  the simplicial boundary X, and the simplicial Roller boundary X are \n    all  homotopy equivalent. \n    \n    \n    The proof of this result only requires minor modifications to the proof of Theorem <ref>,\n    essentially because convexity of \n    half-spaces and the \n    metric product structure \n    of hyperplane carriers persist in the CAT(0) cuboid \n    metric ^ρ_X.\n    These small modifications  are described in \n    Sections <ref>, <ref>,  and <ref>. \n    \n    The theorem implies, in particular, that if X admits a geometric action by a group G, then the  homotopy type of \n    the Tits boundary is unaffected by replacing the standard CAT(0) metric (where all edge lengths are 1) with a \n    cuboid metric obtained by rescaling edges G–equivariantly. This is perhaps evidence in favor of the possibility that the \n    results of Bestvina and Ontaneda about shape equivalence of visual boundaries <cit.> can be strengthened to results about  \n    homotopy equivalence if one instead uses the Tits boundary:\n    \n    \n    For which CAT(0) groups G is it the case that any two CAT(0) spaces X,Y on which G acts geometrically have  \n    homotopy equivalent Tits boundaries?\n    \n    If G acts geometrically on CAT(0) cube complexes X,Y, are the simplicial boundaries of X,Y \n    homotopy equivalent?\n    \n    \n     §.§ Quasiflats\n    \n    A remarkable theorem of Huang <cit.> says that if X is a d–dimensional CAT(0) cube complex, then any quasi-isometric embedding ^d→ X has image that is \n    Hausdorff-close to a finite union of cubical orthants, i.e. a convex subcomplex that splits as the product of rays.  This statement is important for the study of quasi-isometric rigidity in cubical groups, and it is natural to want to strengthen the \n    statement to cover quasi-isometric embeddings ^d→ X, where d is the largest dimension for which such a map exists, but X is allowed to be larger than d (although still \n    finite).  Natural examples where this strenthened form of Huang's theorem is useful include right-angled Coxeter groups.\n    \n    We believe that Theorem <ref> could be used as an ingredient in proving such a result.  Very roughly, the homotopy equivalence X→ X can be used to \n    produce, given a singular d–cycle z in X, a simplicial d–cycle z' in X represented by a finite collection of standard orthants in X.  By the latter, we mean there is a \n    finite collection of d–simplices in X whose union S carries z'.  The proof of Theorem <ref>,\n    specifically Proposition <ref> and the nerve arguments in Sections <ref> and <ref>,\n    should provide enough metric control on the map S→ X \n    to invoke a result of Kleiner–Lang <cit.> to deduce the strengthened quasiflats theorem.  \n    Given that the \n    strengthened quasiflats theorem has recently been established by \n    Bowditch <cit.> and independently Huang–Kleiner–Stadler <cit.>, we have decided not \n    to pursue the matter in this paper.\n    \n    \n    \n    \n    \n     §.§ Ingredients of our proof\n    \n    \n    As mentioned above, our primary goal is to elucidate the relationships among three boundaries: the simplicial boundary X, the simplicial Roller boundary X, and the Tits boundary X. \n    \n    The first two boundaries that we study are combinatorial in nature. The primary difference is that the central objects in X are sequences of hyperplanes, whereas the central objects in X are sequences of half-spaces. After developing a number of lemmas that translate between the two contexts, we prove the following result:\n    \n    Corollary <ref>\n    The barycentric subdivision of X contains a canonical, (X)–invariant subcomplex X. There are (X)–equivariant \n     simplicial maps X→ X and X →  X, with the following properties:\n    \n      * X→ X is  surjective.\n    \n      * X →  X  is an injective section of .  \n    \n      *  is a homotopy \n    equivalence with homotopy inverse  .\n    \n    \n     In fact, all of X deformation retracts to X in an \n     (X)–equivariant \n     way. See Remark <ref>.\n    \n    In contrast to the the two combinatorial boundaries, the Tits boundary X is  inherently linked to the geometry of the CAT(0) metric on X.\n    To relate the Tits boundary to the other two boundaries, we need to combinatorialize it: that is, we need to cover X by a certain collection of open sets, and then study the nerve of the \n    corresponding covering. Similarly, we cover each of X and X by simplicial subcomplexes, and study the resulting nerves. We will use two different versions of the nerve theorem to \n    show that a topological space (such as one of our boundaries) is homotopy equivalent to the nerve of a covering. The Open Nerve Theorem <ref> deals with open coverings and is \n    originally due to Borsuk <cit.>. The Simplicial Nerve Theorem <ref> deals with coverings by simplical complexes and is originally due to Björner \n    <cit.>. In fact, since Theorem <ref> is a G–equivariant statement, we need equivariant versions of both theorems, which have not previously appeared in the literature \n    to our knowledge. Consequently, Section <ref> contains self-contained proofs of both theorems. \n    \n    \n    \n    A central object in our construction of nerves is the Tits boundary realization of a Roller class, or point in  the Roller boundary (see Definitions <ref>, <ref><ref> \n    ). In <cit.>, a Roller class v, yields a convex, visually compact subset of the Tits boundary X. Employing the work of Caprace–Lytchak <cit.> and \n    Balser–Lytchak <cit.>, this set has radius at most π/2 and\n    a canonical circumcenter (v). A first approach might be to use these compacta to provide the 0–skeleton of a nerve for X that will be homotopy equivalent to X. However, \n    several issues arise. First, these associated convex closed sets must be made smaller so that their overlaps can be controlled. This is achieved by considering points in the Roller boundary versus \n    their classes.\n    \n    Secondly, the issue of ℓ^2–visibility, or rather invisibility must be addressed. A Roller class, (respectively a UBS) is ℓ^2–visible if it is the intersection (respectively union) of the deep half-spaces (respectively hyperplanes) naturally associated to a CAT(0) geodesic ray α.  As Figure <ref> shows, some Roller classes are not ℓ^2–visible, and invisible classes cause headaches when trying to connect this data to the Tits boundary. In particular, if v is an invisible Roller class, then we will have Q(v) = Q(w) for any Roller class w < v.\n    To confront this challenge, we have to find a single  class which is maximal among the visible Roller classes represented by rays with endpoints in Q(v). Proving the existence of such a maximal class requires finding a single geodesic ray that is diagonal, in the sense that its convex hull is the union of the convex hulls of two geodesic rays.\n    In particular, we need the following statement, which is of independent interest:\n      \n      \n     Proposition <ref>\n    Let α, β be CAT(0) geodesic rays with α(0) = β(0) ∈ X^(0).\n    Suppose that (α)∪(β) is commensurate \n    with a UBS.  Then a=α(∞) and b=β(∞) are joined by a unique geodesic \n    g in X. Furthermore, any interior point c of g is represented by a CAT(0) geodesic ray γ \n    such that (γ)  = (α)∪(β).\n    \n      \n    \n    Next, \n    we consider maps between X and X that  relate these boundaries.\n     The first of these maps, called ψ X → X, \n     is fairly easy to describe. A Tits point a ∈ X is represented by a CAT(0) geodesic ray α and  the intersection of half-spaces which are “deep\" yields a (principal) Roller class ψ(a).  \n     See Definition <ref> and Lemma <ref>. The reverse map  φ X → X is somewhat more delicate: given a Roller class v, we start with the circumcenter (v) ∈ Q(v) and then perturb (v) to a nearby point φ(v) that has slightly better properties. \n     See Definition <ref> and Proposition <ref> for details, and note that the perturbation uses Proposition <ref> in a crucial way. The upshot is that φ is a section of ψ on exactly the ℓ^2–visible classes: we have v = ψ(φ(v)) if and only if v is ℓ^2–visible (Lemma <ref>). \n    \n     \n    We can now construct nerves and prove results about them. We begin by defining the set (X) of all visible Roller classes that are maximal among all ℓ^2–visible classes. Then, we construct a simplicial complex _T whose vertex set is (X), with simplices corresponding to collections of Roller classes v_i whose Tits boundary realizations Q(v_i) all intersect. We check that this is indeed the nerve of a cover of X (Corollary <ref>). Then, we prove:\n    \n    Theorem <ref>\n    There is an  homotopy equivalence from  the simplicial complex _T to X. \n    \n    The proof of Theorem <ref> requires an open thickening. The sets Q(v) are closed (in fact, compact), and we do not have a version of the Nerve Theorem for closed covers. Thus we thicken up each compact set Q(v) to an open set U(v), in such a way that the intersection pattern of the open cover {U(v) :v∈(X) } is the same as that of the closed cover {Q(v):v∈(X)}. The thickening procedure involves some delicate CAT(0) geometry; see Proposition <ref>. As a result, we obtain an open cover of X whose nerve is isomorphic to the nerve of the closed cover, namely _T. Now, the Equivariant Open Nerve Theorem <ref> gives an  homotopy equivalence _T → X.\n     \n    There are two reasons why the  homotopy equivalence in Theorem <ref> is not (X)–equivariant. First, the Equivariant Open Nerve Theorem <ref> does not provide (X)–equivariance on the nose. Second, while the collection of Tits boundary realizations Q(v_i) is (X)–equivariant, the perturbed circumcenter map φ might not be. For these reasons,  homotopy equivalence is the strongest form of invariance that we can guarantee.\n     \n     In  Section <ref>, we use all of the above results  to complete the proof of Theorem <ref>. We already have an open cover of X whose nerve is _T. \n    Working in X, we focus attention on a subcomplex X whose vertex set corresponds to the ℓ^2–visible Roller classes, and then construct a cover of X by finite \n    simplicial complexes {Σ_v : v ∈ X}. It is not too hard to check that the nerve _ of this cover is isomorphic to _T, which implies that X and \n    X  are  homotopy equivalent (Proposition <ref>). To complete the construction of an  homotopy equivalence X → X, we build an  deformation retraction  ^ X → X; see Proposition <ref>. While the construction of this retraction is \n    mostly combinatorial, it relies on CAT(0) geometry and the perturbed circumcenter map φ at one crucial step.\n     \n    \n    Finally,  the homotopy equivalence X → X is morally very similar to the simplicial map X→ X constructed in\n     Corollary <ref>. To make the argument precise, we construct isomorphic nerves of simplicial covers of \n     X and X and apply the Equivariant Simplicial Nerve Theorem <ref> one final time.\n    \n    \n    \n    \n     §.§ Expository content\n    \n    Part of our goal in this paper is to provide exposition of varying aspects of cubical theory. \n     CAT(0) cube complexes are ubiquitous objects that have been well-studied in many different guises. Accordingly, there are several different \n    viewpoints, and various important technical statements are stated and proved in a variety of different ways throughout the literature.  Therefore, we have endeavored to give a self-contained \n    discussion of CAT(0) cube complexes combining some of these viewpoints.  \n    \n    Also, throughout the paper, we make heavy use of the nerve theorem, for both open and simplicial covers. Results of this sort were originally proved by Borsuk <cit.>, and are now widely used in many slightly different forms.  To the best of our knowledge, the existing literature does not contain a version of the nerve theorem for covers of simplicial complexes by locally infinite families of subcomplexes, with a conclusion that provides equivariance with respect to group actions on the input data.\n    Since we could not find a written account of such a result, we have given self-contained proofs (based on arguments in <cit.>) in Section <ref>.\n    \n    \n    \n     §.§ Section Breakdown\n    \n    Section <ref> establishes some language about simplicial complexes and proves equivariant versions of two nerve theorems.  Section <ref> is devoted to background on CAT(0) cube complexes and the Roller boundary.  In \n    Section <ref>, we discuss CAT(0) cuboid complexes coming from an admissible rescaling of the hyperplanes.  Section <ref> introduces the simplicial Roller \n    boundary. In Section <ref>, we introduce UBSes and the simplicial boundary, and relate these to Roller classes and the simplicial Roller boundary.  In Section <ref>, \n    we introduce the Tits boundary and prove some technical results relating CAT(0) geodesic rays to Roller classes and UBSes.  We apply these in Section <ref> to analyze the \n    realizations of Roller classes in the Tits boundary.  These results are in turn used in Section <ref> to prove that the Tits boundary is homotopy equivalent to a \n    simplicial complex _T arising as the nerve of the covering by open sets associated to certain Roller classes.  In Section <ref>, we realize this nerve as the nerve of a covering of the \n    simplicial Roller boundary by subcomplexes associated to Roller classes, and deduce Theorems <ref> and <ref>.  \n    \n    See Table <ref> for a summary of the notation used in this paper.\n    \n    \n    \n    \n     §.§ Acknowledgments\n    \n    We are grateful to Craig Guilbault, Jingyin Huang, Dan Ramras, and Kim Ruane for some helpful \n    discussions. \n    We thank the organizers of the conference “Nonpositively curved groups on the Mediterranean” in May of 2018,  where the three of us began collaborating as a unit.\n    Fernós was partially supported by NSF grant DMS–2005640.\n    Futer was partially supported by NSF grant DMS–1907708.\n    Hagen was partially supported by EPSRC New Investigator Award EP/R042187/1.\n    \n    \n    \n    § SIMPLICIAL COMPLEXES AND NERVE THEOREMS\n    \n    Throughout the paper, we will make use of simplicial complexes and assume that the reader is familiar with these objects.  \n    For clarity, we recall the definition and describe two topologies on a simplicial complex.\n    Then, in Section <ref>, we prove two group-equivariant homotopy equivalence theorems about nerves of covers.\n    \n    A k–simplex is the set \n    \n        σ={a_0e_0+⋯+a_ke_k  | ∑_i=0^ka_k=1 and a_i≥ 0 for all i},\n    \n    where e_0,…,e_k are the standard basis vectors in ^k+1.  A face of σ is a j–simplex \n    obtained by restricting all but j–many \n      of the a_i to 0.  Note that σ has a CW complex structure where the 0–cells \n    are the 0–dimensional faces and, more generally, the j–cells are the j–dimensional faces.\n    \n    A simplicial complex is a CW complex  whose closed cells are simplices, such that\n    \n      *  each (closed) simplex is embedded in , and\n         \n      *  if σ,τ are simplices, then σ∩τ is either empty or a face of both σ and \n    τ.  In particular, simplices with the same 0–skeleton are equal.\n    \n    We often refer to 0–simplices of  as vertices and 1–simplices as edges.   \n    \n    As a CW complex,  is endowed with the weak topology:\n    \n    \n        Let  be a simplicial complex. The weak topology𝒯_w on   is characterized by the property that a set C ⊂ is closed if and only if C ∩σ \n    is closed for every simplex σ⊂.  \n    \n    \n    \n    \n    In some of the arguments in this section, it will be more convenient to work with the metric topology on the simplicial complex .  \n    \n    \n    \n     Let  be a simplicial complex.  Let V be the real vector space consisting of functions f ^(0)→ such that f(v)≠ 0 for finitely many v∈^(0).  \n     Then there is a \n    canonical inclusion ^(0)↪ V, where every vertex v ∈^(0) maps to the corresponding Dirac function δ_v ∈ V.  This map extends affinely over \n    simplices endowed with barycentric coordinates to give an inclusion ↪ V. \n    \n    Equip V with the ℓ^2 norm \n        f^2=∑_v∈^(0)f^2(v),\n     which is well-defined since every f∈ V is finitely supported.  The restriction of the resulting metric topology on V \n    to the subspace  is the metric topology on , denoted 𝒯_m.\n    \n    \n    The metric topology is coarser than the weak topology, hence the identity map 𝕀_ (,𝒯_w)→(,𝒯_m) is always continuous. When a simplicial complex \n     is locally infinite, the inverse map (,𝒯_m)→(,𝒯_w) is not continuous.  However, Dowker proved  that 𝕀_ is a homotopy equivalence even when \n     is locally infinite <cit.>. \n     Since our interest is in the homotopy type of , Dowker's theorem will be very useful.\n    \n    \n    Unless stated otherwise, a simplicial complex  is presumed to have the weak topology 𝒯_w. The metric topology will only be needed in Lemma <ref> and Theorem <ref>, and never afterward.\n    \n    \n    \n    Some of the simplicial complexes used later will  arise from partially ordered sets, as follows.\n    \n    \n    Given a partially ordered set (P,≤), there is a simplicial complex S in which the k–simplices are \n    the (k+1)–chains in (P,≤), and the face relation is determined by containment of chains.  We call S the simplicial realization of the partially ordered set \n    (P,≤). \n    \n    \n    In several other places, we will work with simplicial complexes arising as nerves of coverings of topological spaces:\n    \n    \n     Let Y be a topological space and let 𝒰={Y_i}_i∈ I be a covering of Y, i.e. a family of subsets with Y=⋃_i∈ IY_i.  The nerve of 𝒰 is the simplicial \n    complex  with a vertex v_i for each Y_i, and with \n    an n–simplex spanned by v_i_0,…,v_i_n whenever\n    ⋂_j=0^nY_i_j≠∅.  \n    \n    \n    Note that we have defined nerves for arbitrary coverings of arbitrary topological spaces.  In practice, we will restrict Y and 𝒰: either Y is a paracompact space and \n    𝒰 is an open covering, or Y is itself a simplicial complex and 𝒰 is a covering by subcomplexes.  These assumptions provide the settings for the nerve theorems, which relate the homotopy type of Y to that of the nerve of 𝒰.\n    \n    \n    \n     §.§ Equivariant nerve theorems\n    \n    \n    In this section, we prove two flavors of nerve theorem that are needed in our proofs of homotopy equivalence. Theorem <ref> is a group-equivariant version of the classical nerve theorem for open coverings, originally due to Borsuk <cit.>. Similarly, Theorem <ref> is an equivariant version of the nerve theorem for simplicial complexes, which is due to Björner <cit.>.\n    \n    \n    We need the following standard fact:\n    \n    \n     Let Y be a topological space and   a simplicial complex  endowed with the metric topology. \n     Let \n    f_0,f_1  Y→ (,𝒯_m) be continuous maps.  Suppose that, for all y∈ Y, \n    there exists a closed simplex σ of  such that \n    f_0(y), f_1(y)∈σ.  Then f_0 and f_1 are homotopic via a straight line homotopy.\n    \n    By abuse of notation, we identify  with the embedding ↪ V described in Definition <ref>. Then f_0, f_1  Y → V are continuous functions. For y ∈ Y and t ∈ [0,1], define the affine combination f_t(y) = \n    (1-t)f_0(y) + t f_1(y). Then \n    (y,t) ↦ f_t(y) is a continuous mapping from Y × [0,1] to V. Furthermore, for every y ∈ Y, the image f_t(y) = (1-t)f_0(y) + t f_1(y) belongs to the same simplex σ⊂ that contains f_0(y) and f_1(y). Thus we get a straight line homotopy f_t  Y →.\n    \n    Let Y be a paracompact space, on which a group G acts by homeomorphisms.  Let I be a set equipped with a left G–action, and let \n    ={Y_i}_i∈ I be an open covering of Y with the following properties:\n    \n      * gY_i=Y_gi for all g∈ G and i∈ I;\n         \n      *  for any finite F⊂ I, the intersection ⋂_i∈ FY_i is either empty or \n    contractible.\n    \n    Let  be the nerve of the covering .  \n    \n    Then G acts on  by simplicial automorphisms, and there is \n    a  homotopy equivalence f  Y→(,𝒯_m).\n    Consequently, there is also a \n      homotopy equivalence Y→ (,𝒯_w).\n    \n    If the G–action is trivial, this result is the classical nerve theorem, proved for instance in Hatcher <cit.>.\n    We adapt Hatcher's line of argument, accounting for the G–action where necessary.  Until we say otherwise, at the very end of the proof, the nerve  will be equipped with the metric \n    topology 𝒯_m.\n    \n    Simplices comprising the nerve:  Let ℱ be the set of \n    finite subsets F⊂ I \n    such that ⋂_i∈ FY_i≠∅.  Then, by Definition <ref>, every finite set F ∈ℱ can be canonically identified with the set of vertices of a simplex σ(F) ⊂.\n    The partial order on ℱ given by set inclusion corresponds to the face relation on .\n    The action of G on   induces an action on ℱ, hence a simplicial action on .\n    \n    The space Y and its quotient maps:  Let σ= σ(F) be a simplex \n    of , corresponding to a finite set F ∈ℱ. \n    Let U_F = ⋂_i ∈ F Y_i, a contractible open set, and consider the product U_F ×σ(F) ⊂ Y ×. Then, define\n    \n        Y = ⋃_F ∈ℱ( U_F ×σ(F) )  ⊂  Y ×.\n    \n     The diagonal G–action on Y × induces a G–action on Y.\n    The projections from Y × to its factors restrict to G–equivariant projection maps\n    \n        p  Y → Y,      q  Y →.\n    The homotopy equivalence Y →:  \n     Given a point x ∈ contained in the interior of a simplex σ(F), the fiber  q^-1(x) = U_F ×{x} is contractible by hypothesis.  Thus, by <cit.>, \n    the projection q  Y → is a homotopy equivalence.\n    \n    The fiber p^-1(y):\n    Fix y∈ Y, and consider the fiber \n    p^-1(y). Let (y,x) ∈ p^-1(y) ⊂ Y ×. Let σ(F) be a simplex of  containing x = q(y,x). The vertices of σ correspond to the elements of F, hence to subsets Y_i for i ∈ F.\n    We endow σ(F) with barycentric coordinates, so that\n     x = ∑_i ∈ Fβ_i Y_i where ∑β_i = 1. Thus\n     \n        p^-1(y) = {(y,  ∑_i ∈ Fβ_i Y_i )   |   y ∈ U_F , F ∈ℱ} = {y}×Σ_y\n    \n    for a simplicial subcomplex Σ_y ⊂. Since the projection p  Y → Y is G–equivariant, we have\n    \n        {gy}× g Σ_y   =   g (  {y}×Σ_y )   =   g p^-1(y) = p^-1(gy)   =  {gy}×Σ_gy,\n    \n    and in particular g Σ_y = Σ_gy.\n    \n    \n    For any pair of points x,x' ∈Σ_y, belonging to simplices σ(F), σ(F') of , we have y ∈ U_F ∩ U_F' = U_F ∪ F'. Thus there is also a simplex σ(F ∪ F') containing both σ(F) and σ(F') as faces. It follows that x,x' are connected by an affine line segment in the common simplex σ(F ∪ F'). \n    In other words, Σ_y is convex.\n    \n    \n    The section s  Y → Y:  \n    Since Y is paracompact, there is a partition of unity {ϕ_α}_α∈ A subordinate to = {Y_i}_i ∈ I. That is,\n     for each α∈ A, we have (ϕ_α)  ⊂ Y_i(α) for some i(α) ∈ I.\n      Given y∈ Y, let A(y) = {α∈ A : y ∈(ϕ_α) }, a finite set.\n    Then, define\n    \n        f(y) = ∑_α∈ A(y)ϕ_α (y) Y_i (α) ∈ Σ_y\n            and    \n        s(y) = ( y, f(y) )\n          ∈  \n        p^-1(y) .\n     \n    We will eventually show that f  Y → is the homotopy equivalence claimed in the theorem statement. For now, we focus on s.\n    \n    Checking that s is a homotopy inverse of p:\n    Since s(y) ∈ p^-1(y), we have p ∘ s = id_Y by construction.\n    We claim that the other composition s ∘ p is homotopic to id_ Y. \n    To prove this, consider the following pair of functions from  Y →:\n    \n        q_0(y,x) = q(y,x) = x,      q_1(y,x) = f(y).\n    \n    For every pair (y, x) ∈ Y, the image points x = q_0(y,x) and x' = q_1(y,x)  = f(y) are both contained in Σ_y. Above, we have checked both image points x,x' are contained in a common simplex σ(F ∪ F') ⊂Σ_y ⊂. Recall that we are working with the metric topology on . Thus, by Lemma <ref>, q_0 is homotopic to q_1 via a straight line homotopy q_t.  For every y, this straight-line homotopy runs through Σ_y.\n    \n    We can now define a homotopy h_t  Y → Y × as follows:\n    \n        h_t(y,x) = (y, q_t(y,x)).\n    \n    Observe that p ∘ h_t is continuous because p ∘ h_t(y,x) = y, and q ∘ h_t is continuous because q ∘ h_t(y,x) = q_t(y,x). Thus, by the universal property of the product topology, h_t is continuous.\n    Restricting t to be 0 or 1 gives\n    \n        h_0(y,x) = (y, q_0(y,x)) = (y,x),    h_1(y,x) = (y, q_1(y,x)) = (y, f(y)) = s∘ p(y,x).\n    \n    In fact, for every (y,x), the path t ↦ q_t(y,x) has image in Σ_y, hence\n    h_t(y,x) has image in {y}×Σ_y ⊂ Y. Thus h_t is a homotopy from s∘ p to id_ Y, and s is a homotopy inverse of p.\n    \n     \n    A  homotopy equivalence:  Thus far, we have homotopy equivalences s  Y→ Y and q  Y→.  Hence the composition f = q∘ s  Y → is a homotopy equivalence as well.  \n    \n    It remains to check that f is a  homotopy equivalence. Recall from above that for every y ∈ Y and  g ∈ G, we have f(y) ∈Σ_y, hence gf(y) ∈ gΣ_y = Σ_gy. Similarly, we have f(gy) ∈Σ_gy. Thus both f(gy) and gf(y) lie in Σ_gy, and we have already checked that every pair of points of Σ_gy belong to a common simplex of . \n    Thus Lemma <ref> says that the maps gf and fg are homotopic for every g ∈ G, hence f   Y → (,𝒯_m) is a  homotopy equivalence, as claimed in the statement of the theorem.\n    \n    Conclusion for the weak topology:  This follows since 𝕀_ (,𝒯_w)→(,𝒯_m) is G–equivariant and is a homotopy equivalence by <cit.>.\n    \n    \n    We are now finished with having the metric topology on our nerves, \n    and work only with the weak topology in the remainder of the paper.\n    \n    \n    The following result is stated (without the group action) as \n    <cit.>.  The proof given there assumes that = {Σ_i} is a locally finite cover, and then \n    mentions that the general case requires a slightly different argument.\n    (See Ramras <cit.> for a sketch of how the argument might go.)\n      Since we need the conclusion in the case where \n    {Σ_i} might be locally infinite, and since we need to adapt the proof slightly to account for the group action, we write down a proof using Theorem <ref>.  \n    \n    \n    \n    \n    Let Y be a simplicial complex, and let G be a group \n    acting on Y by simplicial automorphisms.   Let I be a set equipped with a left G–action, and let \n    ={Σ_i}_i∈ I be a covering of Y by subcomplexes, with the following properties:\n    \n      * g Σ_i = Σ_gi for all g∈ G and i∈ I;\n         \n      *  for any finite F⊂ I, the intersection ⋂_i∈ FΣ_i is either empty or \n    contractible.\n    \n    Let  be the nerve of the covering . \n    Then there is a \n     homotopy equivalence f  Y→ (,𝒯_w).\n    \n    Let Y' be the barycentric subdivision of Y. We think of Y and Y' as the same underlying topological space, with different simplicial structures. \n    \n    Every subcomplex Σ⊂ Y be viewed as a subcomplex of Y'. Indeed, Σ⊂ Y is a full subcomplex of Y', in the following sense: for every simplex τ⊂ Y' whose vertices belong to Σ, it follows that τ⊂Σ. This holds because the vertices of τ correspond to simplices of Y; if these vertices belong to Σ, then so do the corresponding cells of Y, hence τ⊂Σ.\n    \n    Complementary complexes and open neighborhoods: \n    For a subcomplex Σ⊂ Y, \n    define the complementary complex T_Σ to be the union of all closed simplices of Y' disjoint from Σ. Then T_Σ is also a full subcomplex of Y'. Indeed, consider a simplex τ⊂ Y' whose vertices are disjoint from Σ. Then τ∩Σ cannot contain any faces of τ, hence τ∩Σ = ∅. Since T_Σ is a subcomplex of Y', it is closed (in the weak topology).\n    \n    Given a subcomplex Σ⊂ Y, we define an open neighborhood U_Σ = Y ∖ T_Σ. Thus U_Σ is the union of all the open simplices of Y' whose closures intersect Σ. \n    \n    \n    For every subcomplex Σ_i, where i ∈ I, we write U_i = U_Σ_i.  Observe that U_g i=gU_i for all g∈ G and i ∈ I. We will prove the theorem by replacing the subcomplex cover = {Σ_i }_i ∈ I by the open cover\n    = { U_i }_i ∈ I.\n    \n    Same nerve: Let Σ_α and Σ_β be a pair of subcomplexes of Y, not necessarily belonging to . We claim that Σ_α∩Σ_β = ∅ if and only if U_Σ_α∩ U_Σ_β = ∅. The “if” direction is obvious. For the “only if” direction, suppose that Σ_α∩Σ_β = ∅. Then T_Σ_α∪ T_Σ_β = T_Σ_α∩Σ_β = T_∅ = Y', hence U_Σ_α∩ U_Σ_β = ∅, as desired.\n    \n    Now, let F ⊂ I be a finite set. By induction on |F|, combined with the argument of the above paragraph, we see that \n    ⋂_i∈ FΣ_i = ∅ if and only if ⋂_i∈ F U_Σ_i = ∅. Hence the open cover = { U_i }_i ∈ I and the subcomplex cover = {Σ_i }_i ∈ I have the same nerve .\n    \n    Same homotopy type: For every subcomplex Σ⊂ Y, we claim that the open neighborhood U_Σ deformation retracts to Σ. This is a standard fact about simplicial complexes, proved e.g. in Munkres <cit.>. The proof constructs a straight-line homotopy in every simplex σ⊂ Y' that belongs to neither Σ nor T_Σ. The proof uses the fullness of Σ and T_Σ in Y', but does not depend on any finiteness properties of these complexes.\n    \n    Now, let F ⊂ I be a finite set such that ⋂_i∈ FΣ_i ≠∅. Define Σ_F = ⋂_i∈ FΣ_i, and recall that by hypothesis, Σ_F is contractible. Since U_Σ_F =  ⋂_i∈ F U_Σ_i, and U_Σ_F deformation retracts to Σ_F, it follows that ⋂_i∈ F U_i = ⋂_i∈ F U_Σ_i is also contractible.\n    \n    Conclusion: By a theorem of Bourgin <cit.>, the simplicial complex Y is paracompact (with the weak topology 𝒯_w).\n    We have shown that the open cover = { U_i }_i ∈ I and the subcomplex cover = {Σ_i }_i ∈ I have the same nerve . We have checked that U_g i=gU_i for all g∈ G and i ∈ I. Furthermore, for every finite set F ⊂ I, the intersection ⋂_i∈ F U_i is either empty or contractible. Thus, by Theorem <ref>, we have a  homotopy equivalence f  Y→ (,𝒯_w).\n    \n    \n    § CUBE COMPLEXES AND THE ROLLER BOUNDARY\n    \n    \n    This section recalls some background about CAT(0) cube complexes and their Roller boundaries. Many facts about CAT(0) cube \n    complexes, median graphs, wallspaces, and related structures occur in various \n     places in the literature, in many equivalent \n    guises. We have endeavored to connect some of the perspectives, in part because we will need to use these connections in the sequel. We refer the reader to <cit.> and <cit.> for more background.  \n    \n    \n    \n     §.§ CAT(0) cube complexes and metrics\n    \n    A cube is a copy of a Euclidean unit cube [-1/2,1/2]^n for 0≤ n<∞.  A face of \n    [-1/2,1/2]^n is a subspace obtained by restricting some of the coordinates to ±1/2.  A cube \n    complex is a CW complex whose cells are cubes and whose attaching maps restrict to isometries on faces.  A cube complex \n    with embedded cubes is nonpositively curved if, for all vertices v and all edges e_1,…,e_k incident to v such that \n    e_i,e_j span a 2–cube for all i≠ j, we have that e_1,…,e_k span a unique k–cube. \n     If X is \n    nonpositively-curved and simply connected, then X is a CAT(0) cube complex.  The dimension of X, denoted X, is the \n    supremum of the dimensions of cubes of X.\n    \n    Throughout this paper, X will denote a finite-dimensional CAT(0) cube complex.   We let (X) denote the group of \n    cellular automorphisms of X.  We do not assume that X is locally finite. \n    \n    The cube complex X carries a metric _X such that (X,_X) is a CAT(0) space, the restriction of _X to \n    each cube is the Euclidean metric on a unit cube, and each cube is geodesically convex (see <cit.>). \n     We refer to _X as the ℓ^2 metric or the CAT(0) metric on X.  \n     \n    One can view X^(1) as a graph whose vertices are the 0–cubes and whose edges are the 1–cubes.  (We \n    often refer to 0–cubes as vertices of X, and 1–cubes as edges.)  We let d_1 denote the ℓ^1 metric on the \n    vertex set X^(0), which is the restriction of the usual graph metric on X^(1). We refer to d_1 as the combinatorial metric on X^(0). A combinatorial geodesic between x,y ∈ X^(0) is an edge path in X^(1) that realizes d_1(x,y).\n    \n    \n    \n    \n     §.§ Hyperplanes, half-spaces, crossing, and separation\n    \n    \n    Let [- 1/2, 1/2]^n be an n-dimensional cube. A midcube of [- 1/2, 1/2]^n is the subset obtained by restricting one coordinate to be 0.\n    \n    A hyperplane of a CAT(0) cube complex X is a connected subset whose intersection with each cube is either a midcube \n    of that cube, or empty. The open 1/2–neighborhood of a hyperplane ĥ in the metric d_X is denoted N(ĥ) is called the \n     open \n    hyperplane carrier of ĥ. It is known that every open carrier N(ĥ) is geodesically convex in d_X. Furthermore, X ∖ N(ĥ) consists of two connected components, each of which is also convex\n     <cit.>.\n     \n     A component of X ∖ N(ĥ) is called a CAT(0) half-space. \n     The intersection of one of these components with the vertex set X^(0) is called a vertex half-space. \n     \n     The two vertex half-spaces associated to a hyperplane ĥ are denoted h, h^*. Note that ĥ^*= ĥ.\n     Given a vertex half-space h,  the corresponding CAT(0) half-space is the union of all cubes of X whose vertices lie in h.\n     We will use the unmodified term half-space to mean either a CAT(0) half-space or a vertex half-space when the meaning is clear from context. \n    \n    \n     \n     The collection of all vertex half-spaces is denoted by , or (X) if we wish to specify the space X.    \n     If h∈, then h^* = X^(0)∖ h is exactly the complementary half-space associated to the same hyperplane \n    ĥ.\n    \n    The collection of all hyperplanes of X is denoted  (for “walls”). \n     Generally speaking, calligraphic letters denote collections of hyperplanes, while gothic letters denote collections of  \n    half-spaces.\n    There is a two-to-one map →, namely h ↦ĥ. Given a subset 𝒮⊂, an orientation on 𝒮 is a choice of a lift 𝒮→. \n    \n    \n     \n    A  pair of half-spaces h,k∈ are called transverse (denoted h⋔ k) if the four intersections h∩ \n    k, h∩ k^*, h^*∩  k and h^*∩ k^* are nonempty. In terms of the underlying hyperplanes ĥ and k̂, \n    transversality is equivalent to the condition that ĥ≠k̂ and ĥ∩k̂≠∅. In this case, \n    we also write ĥ⋔k̂.  We sometimes say that transverse hyperplanes cross.  \n    \n    Given subsets A,B⊂ X, we say that ĥseparatesA,B if, up to relabelling the half-spaces associated to \n    ĥ, we have A⊂ h and B⊂ h^*.  We will usually be interested in situations where A,B are subcomplexes, sets \n    of vertices, or hyperplanes, in which case this notion is equivalent to another notion of separation:  namely that A,B lie in distinct components of X ∖ĥ.  Later in the paper, we will occasionally use the \n    latter notion when we need to talk about points in N(ĥ) being separated by ĥ.  (Elsewhere in the literature, \n    e.g. <cit.>, the half-spaces associated to ĥ are defined to be the components of X ∖ĥ, or sometimes \n    their closures.  This small difference in viewpoint is usually irrelevant.)\n    \n    \n    If e is an edge, i.e. a 1–cube,  of X, then there is a unique hyperplane ĥ separating the two vertices of e.  \n    We say that ĥ is dual toe, and vice versa.  Note that  ĥ is the unique hyperplane intersecting e.  \n    More generally, if k≥ 0 and c is a k–cube, then there are exactly k hyperplanes intersecting c.  These \n    hyperplanes pairwise cross, and their intersection contains the barycenter of c.  We say that c is dual to this \n    family of hyperplanes.  Any set of k pairwise-crossing hyperplanes is dual to at least one k–cube.  In particular, \n    X bounds the cardinality of any set of pairwise crossing hyperplanes in X.\n    \n    For any points x,y ∈ X, define (x,y) to be the set of hyperplanes separating x from y.  If x,y∈ X^(0), \n    then an edge path γ from x to y is a geodesic in X^(1) if and only if γ never crosses the same hyperplane twice. Consequently,\n     \n        _1(x,y)=|(x,y)|.\n    \n    In view of this, the following standard lemma relates the metrics _X and _1. See Caprace and \n    Sageev <cit.> or Hagen <cit.> for proofs.\n    \n    \n    There are constants λ_0 ≥ 1, λ_1 ≥ 0, depending on X, such that the following holds. For any pair \n    of points x, y ∈ X,\n    \n        1/λ_0 d_X(x,y) - λ_1 ≤ |(x,y)| ≤λ_0 d_X(x,y) + λ_1.\n    \n    \n    \n    For an arbitrary set B ⊂ X, let (B) be the union of all (x,y) for all x,y ∈ B.  In practice, we will \n    often be interested in the following special cases.  First, if B is a hyperplane, then (B) coincides with the set of hyperplanes\n    ĥ that cross B.  If B is a convex subcomplex (see Definition <ref>), then (B) coincides with the set of ĥ with ĥ∩ \n    B≠∅.  If B is a combinatorial geodesic in X^(1), then, because of the above characterization of _1, the set \n    (B) is the set of hyperplanes dual to edges of B, or equivalently the set of hyperplanes intersecting B, or \n    equivalently the set of hyperplanes separating the endpoints of B.\n    \n    \n    \n    One can extend the ℓ^1 metric  on X^(0) to all of X as follows. On a single cube c, let d_1 |_c × c→ be the standard ℓ^1 metric. This can be extended to a path-metric on all of X by concatenating paths in individual cubes. Miesch <cit.> showed that this procedure gives a geodesic path metric on X that extends the graph metric on X^(1). With this extended definition, d_1 becomes bilipschitz to d_X, with the Lipschitz constant λ_0 depending only on (X).\n    \n    \n     §.§ The Roller boundary X\n    \n    Next, we define the Roller boundary and Roller compactification of X. \n    \n    \n    Every vertex v∈ X^(0) defines the collection _v^+= {h∈: v∈ h} of half-spaces containing v.  Going \n    in the opposite direction, the collection _v^+ uniquely determines v:\n    \n        ⋂_h ∈_v^+ h = {v}.\n    \n    \n    We endow the set 2^ with the product topology, which is compact by Tychonoff's theorem. Recall that a basis for this \n    topology consists of cylinder sets defined by the property that finitely many coordinates (i.e. finitely many half-spaces)  take a specified value (0 \n    or 1). Cylinder sets are both open and closed.\n    \n    There is a continuous one-to-one map X^(0)↪ 2^ defined by v↦_v^+. (In fact,  \n    X^(0) is homeomorphic to its image if and only if X is locally compact. We will not need this fact.)\n    \n    \n    The Roller Compactification of X^(0), denoted by X̃ or X̃(), \n    is the closure of the image of X^(0) in 2^ℌ. \n    The Roller Boundary of X is  X = X̃∖ X^(0). \n    \n    \n    Recall that (X) is the group of cubical automorphisms of X. We observe that the action of (X) extends to a \n    continuous action on X̃ and therefore on X.\n    \n    Let h ∈(X). The extension of h to X̃ is defined to be the intersection in 2^ between X̃ and \n    the cylinder set corresponding to h. \n     It is straightforward to check that the extensions of h and h^* form a partition \n    of  X̃. We think of the extensions of h and h^* as complementary (vertex) half-spaces in X̃. By a slight abuse of \n    notation, we use the same symbol h to refer to both a half-space in X and its extension in X̃.\n    \n    By the above discussion of the topology on 2^ℌ, the basic open sets in X̃ are intersections between X̃ and \n    cylinder sets. Therefore, every basis set is a finite intersections of (extended) half-spaces.\n    \n    \n    \n    The duality between points and half-spaces in X, described above, extends to all of X̃ = X^(0)∪ X.\n    Let y ∈X̃, and let _y^+ be the set of extended half-spaces that contain y. Then y and _y^+ determine \n    one another:\n    \n        ⋂_h ∈_y^+ h = { y }.\n    \n    \n    Chatterji and Niblo <cit.>, and independently Nica <cit.>, extended Sageev's construction \n    <cit.> to prove the following.\n    \n    \n    Let ' ⊂(X) be an involution-invariant collection of half-spaces. Then ' determines a CAT(0) cube \n    complex X(') and the Roller compactification X̃(').  In particular, X((X)) = X.\n    \n    \n    \n    If  x ∈ X^(0), the corresponding set _x^+ ∈ 2^ satisfies the descending chain condition: any \n    decreasing sequence of elements of _x^+ is eventually constant. On the other hand, the collection of half-spaces _y^+ corresponding to a boundary point y \n    ∈ X will fail the descending chain condition. Namely, for y∈X̃ we have that y∈ X if and only if \n    there exists a sequence {h_n}_n∈⊂_y^+ such that h_n+1⊊ h_n for each n∈.\n    \n    \n    \n    \n    \n     §.§ Convexity, intervals, and medians\n    \n    Here, we discuss the related notions of convexity and intervals in X and X̃. Since we are interested in two different metrics on X, there are several distinct definitions of convexity (ℓ^1 geodesic convexity, cubical convexity, interval convexity) that turn out to be equivalent for cubical subcomplexes of X.\n    \n    We then introduce a median operation on X̃ and its restriction to X.\n    \n    \n    \n    \n    A set A ⊂ X^(0) is called vertex-convex if it is the intersection of vertex half-spaces in \n    X. For a set S ⊂ X^(0), the vertex convex hull of S is the intersection of all vertex-convex sets containing S, or equivalently the  intersection of all vertex half-spaces containing S.\n    \n    A subcomplex C ⊂ X is called cubically convex \n    if it is the intersection of CAT(0) half-spaces. For a set S ⊂ X, the cubical convex hull, denoted (S), is the intersection of all cubically convex sets containing S, or equivalently the  intersection of all CAT(0) half-spaces containing S. We remark that for subcomplexes of X, this definition coincides with geodesic convexity in the CAT(0) metric d_X; see <cit.> and  <cit.>.\n    \n    \n    Observe that if C is a full subcomplex of X (meaning, C contains a cube c whenever it contains the 0–skeleton of c), then C is cubically convex whenever C^(0) is vertex–convex. For this reason, we can use the two notions of convexity interchangeably when referring to full subcomplexes. \n    \n    \n    Given x,y ∈ X^(0), define the (vertex) interval(x,y) to be vertex convex hull of {x, y}. Define the cubical interval(x,y) to be the cubical convex hull of {x, y}. \n    \n    \n    Observe that (x,y) is a full, convex subcomplex, and is the union of all the cubes whose vertex sets are contained in (x,y). In addition, ^(1)(x,y) is the union of all of the combinatorial geodesics from x to y. In fact, intervals can be used to characterize convexity as follows:\n    \n    \n    A set A ⊂ X^(0) is vertex-convex if and only if the following holds: for all x,y ∈ A, the interval (x,y) ⊂ A.\n    \n    A subcomplex C ⊂ X is cubically convex if and only if the following holds: for all x,y ∈ C^(0), the cubical interval (x,y) ⊂ C.\n    \n    Suppose C is a cubically convex subcomplex and x,y ∈ C. Since (x,y) is the intersection of all convex subcomplexes containing x,y, and C is one such set, we have (x,y) ⊂ C. \n    \n    Toward the converse, suppose that C is interval-convex, meaning (x,y) ⊂ C for every pair x,y. We wish to prove that C is convex.\n    \n    We claim the following: for every  hyperplane ĥ that intersects C and is dual to an edge e with endpoints x,y such that x ∈ C, the other endpoint y belongs to C as well. This can be shown as follows. Since ĥ intersects C, there is an edge e' ⊂ C that is dual to ĥ. Let x', y' be the endpoints of e', such that x and x' are on the same side of ĥ. Then (x,y') = (x,x') ⊔ĥ = ĥ⊔(y,y'). In particular, there exists a combinatorial geodesic from x to y' whose initial edge is e. Since C is interval-convex, this proves the claim.\n    \n    We can now show that C is cubically convex. Suppose z ∈ X^(0)∖ C. Let γ⊂ X^(0) be a shortest combinatorial geodesic from z to C, and let x be the terminus of γ, and let e be the last edge of γ. Since the next-to-last vertex of γ is not in C, the above claim implies that the hyperplane ĥ dual to e is disjoint from C, and separates C from z. Thus C is contained in a CAT(0) half-space disjoint from z. Since z was arbitrary, it follows that C is cubically convex.\n    \n    The proof for vertex-convex subsets is identical, up to replacing all the appropriate sets by their 0–skeleta.\n    \n    \n    Our next goal is to extend the notion of convexity to X̃. \n    It turns out that in X̃, the correct definition of convexity begins with intervals. After developing some definitions and tools, we will eventually prove  a generalization of Lemma <ref> to X̃, using a very different argument.\n    \n    \n    Given x,y ∈X̃, define the interval(x,y) to be the intersection of all (extended, vertex) half-spaces that \n    contain both x and y.  Equivalently, \n    \n        (x,y) = { z ∈X̃  :  ^+_z ⊃ ( ^+_x∩^+_y) }.\n    \n    A nonempty set A ⊂X̃ is called convex if it contains (x,y) for all x, y \n    ∈ A.  \n    \n    \n    As a very particular case, half-spaces and hence also their intersections are convex in X̃.\n    \n    Observe that for x,y ∈ X^(0), the interval (x,y) will in fact be contained in X^(0), and coincides with the previous definition of (x,y). Consequently, X^(0) is convex in X̃. By Lemma <ref>, any vertex-convex subset of X^(0) is also convex in X̃.\n    \n    Since X̃⊂ 2^(X) is by definition a set of vertices, we do not define convex subcomplexes of X̃.\n    \n    \n    As in <cit.>, the fact that X̃ is a median space is captured by the following property: for every x,y,z ∈X̃ there is a unique point m = m(x,y,z) ∈X̃ such that \n    \n        {m}= (x,y) ∩(y,z) ∩(x,z).\n    \n    This unique point m = m(x,y,z) is called the  median of x, y, \n    and z. \n    We will not need the general definition of an (extended) median metric space; \n    the only property of medians that we will need is  that m X̃×X̃×X̃→X̃ satisfies (<ref>). \n    In terms of half-spaces, we have:\n    \n        ^+_m = (^+_x ∩^+_y) ∪ (^+_y∩^+_z)∪ ( ^+_x ∩^+_z).\n    \n    Since intervals between points in X^(0) are contained in X^(0), we see that m(x,y,z)∈ X^(0) if \n    x,y,z∈ X^(0).  So, the median m on X̃ restricts to a median m on X^(0).  The point m(x,y,z) is the unique \n    vertex m for which any two of x,y,z can be joined by a geodesic in X^(1) passing through m. In other words, we also get an analogue of  (<ref>) with (·,·) replaced by (·, ·):\n    \n        {m}= (x,y) ∩(y,z) ∩(x,z)\n          for   x,y,z∈ X^(0).\n    \n    \n    \n     In fact, a graph with \n    this property — called a median graph— is always the 1–skeleton of a uniquely determined CAT(0) cube \n    complex <cit.>.  \n    \n    \n     §.§ Lifting decompositions and convexity\n    \n    \n    \n    A set of half-spaces 𝔰⊂ is called consistent if the following two conditions hold: if h∈𝔰 then h^*∉𝔰, and if k ⊃ h ∈𝔰 then k∈𝔰. Given a \n    subset ' ⊂, a lifting decomposition for ' is a consistent set of half-spaces \n    𝔰⊂∖' such that = '⊔𝔰⊔𝔰^*. \n    Lifting decompositions do not necessarily exist, and are not necessarily unique.\n     \n    Lifting decompositions naturally occur in the following way. Consider a set A ⊂X̃. Analogous to _x^+,  we \n    define a set _A^+ = {h∈ : A⊂ h} of half-spaces that contain A, and observe that _A^+ is \n    consistent. Define _A^- = (_A^+)^* to be the set of half-spaces disjoint from A, and finally a set  \n    \n        _A = {h∈ : A∩ h ≠∅,   A∩ h^*≠∅}\n    \n     of half-spaces that cut A. Then we get a lifting decomposition = _A ⊔_A^+ ⊔_A^-, \n    where 𝔰 = _A^+.\n    \n    \n    \n     Observe that if A⊂ B, then _B^+ ⊂_A^+. \n    \n    \n    Given points x,y ∈X̃, let (x,y)= _x^+ _y^+ denote \n    the set of half-spaces that separate x from y. \n     More generally, given two disjoint convex sets A,B⊂X̃, let (A,B)= _A^+ _B^+ denote \n    the set of half-spaces that separate A from B. \n    \n    In an analogous fashion, we generalize the definition of (x,y) from Section <ref> to convex subsets A, \n    B ⊂X̃. For subsets of this form, (A,B) = (A,B) consists of all the hyperplanes that \n    separate A from B. \n    We also extend the\n     ℓ^1 metric on X^(0) to X̃, where \n    d_1(x,y) = | (x,y) | = 1/2 | _x^+ _y^+| is allowed to take the value ∞.\n    \n     The following result says that lifting decompositions are in one-to-one correspondence with Roller-closed subcomplexes of \n    X̃. \n    \n    \n       \n    \n    \n     \n    The following are true:\n    \n      *  Suppose that '⊂(X). If there exists a lifting decomposition \n    𝔰 for ', then there is a d_1–isometric\n     embedding X̃(') ↪X̃ induced from the map 2^'↪ 2^(X) where U \n    ↦ U⊔𝔰. The image of this embedding is \n    \n    \n        ⋂_h∈𝔰 h⊂X̃.\n    \n    \n      *  Similarly, if 𝔰⊂(X) is a consistent set of half-spaces, then, \n    setting _𝔰 = \n    (X)∖(𝔰⊔𝔰^*) we get an isometric embedding \n    X̃(_𝔰) ↪X̃, obtained as above, onto\n    \n    \n        ⋂_h∈𝔰 h⊂X̃.\n    \n    \n      *  The set 𝔰 satisfies the descending chain condition if and only if the image of \n    X(_𝔰) is in X. \n    \n    Furthermore, if the set 𝔰 is G–invariant, for some group G≤(X), then, with the restricted action on \n    the image, the above natural embeddings are  G–equivariant.\n    \n    \n    This result is a slightly strengthened version of  <cit.>. See also <cit.> for a \n    very similar statement.\n    \n    \n    We remark that  \n    Proposition <ref> includes the possibility that 𝔰=∅ and hence ⊔∅⊔∅ is a legitimate lifting decomposition of . In this case, recall that an intersection over an empty collection of sets is everything, i.e. ⋂_h∈∅ h= X̃. \n    \n    \n    Suppose that there is a lifting decomposition 𝔰 for  '. Then, since s ∩ s^* = ∅ \n    and = '⊔ s ⊔ s^*, we deduce that ' = ∖( s⊔ s^*) \n    is involution invariant. \n    \n    Next, we claim that ' ⊂ has a property called tightly nested, meaning that  for every pair h,k∈', \n    and for every ℓ∈ with h⊂ℓ⊂ k, we have ℓ∈'. Assume, for a contradiction, that \n    h,k∈', and ℓ∈ with h⊂ℓ⊂ k, but \n    ℓ∉'. Then (up to replacing the three half-spaces with their complements) we may assume that ℓ∈𝔰. But then k∈𝔰, a contradiction. \n    \n    With the verification that ' is involution invariant and tightly nested, our hypotheses imply those of  <cit.>. \n    Now, conclusions <ref>–<ref> follow from that lemma.\n    \n    Finally, the conclusion about G–invariance follows because the embeddings are canonically determined by the associated \n    half-spaces.\n    \n    In Proposition <ref>, the  isometric embeddings of X̃(') and X̃(_𝔰) restrict to \n    isometric embeddings of X(') and X(_𝔰), respectively. \n    Although X is typically not closed, the images under the isometric embedding of  X(') and X(_𝔰)  always lie in X. Indeed, recall from the discussion following Theorem \n    <ref> that a point belongs to the Roller boundary if and only if there is an infinite descending chain  of \n    half-spaces containing the point in question. Hence, if U has an infinite descending chain, then so does U⊔ \n    s. \n    \n    \n    \n    As a first application of Proposition <ref>, we will prove a generalization of Lemma <ref> to X̃. Observe that a naive generalization of  Lemma <ref> does not hold, because X is (interval) convex in X̃ by Definition <ref>, but is not an intersection of extended half-spaces. However, the following lemma says that a closed, convex set in X̃ is always an intersection of extended half-spaces.\n    \n    \n    Let A ⊂X̃ be a convex set. Then the Roller closure A in X̃\n     is the image of X̃(_A) under the embedding of Proposition <ref>, and\n     \n        A = ⋂_h ∈_A^+ h = ⋂_A ⊂ h h.\n    \n    Observe that _A^+ is a consistent set of half-spaces. Thus Proposition <ref>.<ref> gives an embedding X̃(_A) ↪X̃ whose image is\n     \n        W =  ⋂_A ⊂ h h = ⋂_h ∈_A^+ h =  ⋂_h ∈_Ã^+ h.\n    \n    Here, the first equality is the definition of W, the second equality is the definition of _A^+, and the third equality holds because half-spaces are closed, meaning _A^+=_Ã^+.\n     \n    It remains to show that A = W. The inclusion A⊂ W is obvious, because A⊂ h for every h ∈_Ã^+. To prove the reverse inclusion, suppose for a contradiction that there is a point  y ∈ W ∖Ã. Since X̃∖Ã\n    is open, there is a basic open neighborhood of y of the form ⋂_i=1^n h_i, such that \n    \n        y ∈( ⋂_i=1^n h_i ) ⊂X̃∖Ã.\n    \n    Therefore, A ⊂ h_1^*∪⋯∪ h_n^*. Without  loss of generality, assume that n is minimal  in the sense that \n    for each j =1, …, n there is a point \n    \n        a_j ∈ A∖(⋃_j ≠ i=1^n h_i^* ) = A ∩(⋂_j ≠ i=1^n h_i ).\n    \n    One crucial observation is that n≥ 2: otherwise, if A ⊂ h_1^*, then h_1 ∩ W = ∅, but we know that y ∈ h_1 ∩ W.\n    \n    \n    Now, define p = m(y,a_1, a_2). Recall that (a_1,a_2)⊂ A, because A is convex. By the definition of medians, we have \n    \n        p ∈(a_1,a_2)⊂ A,     \n        p ∈(y, a_1) ⊂(⋂_j =2^n h_i ),\n             \n        p ∈(y, a_2) ⊂ h_1.\n    \n    Consequently, we have p ∈ A ∩( ⋂_i =1^n h_i )= ∅, a contradiction.\n    Thus A = W.\n    \n    \n     §.§ Gates and bridges\n    \n    A very useful property of a convex subset A⊂ X^(0) is the existence of a gate map_A  X→ A; this is \n    a well-known notion, see e.g. <cit.> and the citations therein.  Metrically, \n    _A  X^(0)→ A^(0) is just closest-point projection, but gates can be characterized entirely in terms of the median \n    (see e.g. <cit.> and citations therein).  Since we saw that X̃ has a median satisfying (<ref>), convex \n    subsets of X̃ do similarly admit gates.  This is the content of  \n    Proposition <ref>, which has the advantage of showing an important relationship between \n    gates and walls.\n    \n    Recall that (x,Y) is the set of hyperplanes separating x from Y, where Y⊂X̃ is convex. \n    \n    \n    \n     Let C⊂X̃ be closed and convex. There is a unique projection _CX̃ C such that for any x∈X̃ we have \n     \n        (x,_C(x)) = (x,C).\n    \n    Let = _C⊔_C^+ ⊔_C^- be the lifting decomposition associated to C.  The map \n    2^→ 2^_C defined by U↦ U∖ (_C^+ ⊔_C^-) restricts to a surjection X̃X̃(_C). \n    Next, Proposition <ref> gives an embedding  X̃(_C) →X̃, namely V ↦ V ⊔_C^+.\n    Composing the surjection X̃X̃(_C) with the embedding X̃(_C) →X̃ yields a map _C X̃→X̃. The image _C(X̃) is C since, by Lemma <ref>, the image of the embedding X̃(_C)→X̃ is exactly C=C.\n    \n    To prove the equality in the statement, first observe that (x,C) ⊂(x,_C(x)) because _C(x) ∈ C. For the opposite inclusion, consider a hyperplane ĥ∈(x,_C(x)), and choose an orientation h ∈_x^+. By the definition of _C, we have\n    \n        __C(x)^+ = (_x^+ ∖_C^-) ∪_C^+.\n    \n    Since h ∈_x^+ ∖__C(x)^+, we must have h ∈_C^-, hence ĥ∈(x,C). Thus (x,C) = (x,_C(x)).\n    \n    Finally, for x ∈ C, we must have x = _C(x) because (x,_C(x)) = (x,C) = ∅. Thus _C is indeed a projection to C.\n    \n    \n    Note that _C restricts to the identity on C.  We call _C the gate map to C, which is consistent \n    with the terminology used in the theory of median spaces because of the following lemma:\n    \n    \n    Let _C be the map from Proposition <ref>.  Then for all x∈X̃ and y∈ C, we have \n    m(x,y,_C(x))=_C(x).  In particular, _C(x) ∈⋂_y ∈ C(x,y).\n    \n    By Proposition <ref> and the fact that y∈ C, we have (x,_C(x))⊂(x,y), so \n    (x,_C(x))⊂(x,y).  So, _C(x)∈(x,y)∩(x,_C(x))∩(y,_C(x)), hence m=_C(x).\n    \n    \n    The above lemma has two corollaries. First, we can characterize medians in terms of projections:\n    \n    \n    Suppose that x,y,z ∈ X^(0). Then _(x,y)(z)=m(x,y,z). \n    \n    By\n    Lemma <ref>, we have _(x,y)(z)  ∈(x,z) and _(x,y)(z) ∈(y,z).  On the \n    other hand, _(x,y)(z)∈(x,y) by definition.  So, by (<ref>), we get  \n    _(x,y)(z)=m(x,y,z).\n    \n    \n    Second, Lemma <ref> allows us to project from X to convex subcomplexes of X.\n    \n    \n    Let A ⊂ X be a convex subcomplex. Then, for all x ∈ X^(0), we have _A (x) ∈ A. Consequently, we get a projection _A = _A X^(0)→ A^(0).\n    \n    Let x ∈ X^(0) and y ∈ A^(0). By Lemma <ref>, we have _A(x) ∈(x,y) ⊂ X^(0). But A∩ X^(0) = A^(0).\n    \n    In fact, it is possible to extend _A over higher-dimensional cubes to \n    get a map _A  X→ A. This is done as follows (see also <cit.>).  First let e be a 1–cube of X joining 0–cubes x,y and dual to a hyperplane ĥ.  From \n    Proposition <ref>, one has the following: if ĥ does not cross A, then _A(x)=_A(y), and, otherwise, _A(x) and _A(y) are joined by an edge e̅⊂ A dual \n    to ĥ.  \n    \n    In the former case, _A extends over e by sending every point to _A(x)=_A(y); in the latter case, we extend by declaring _A  e→e̅ to be the obvious \n    isometry. \n    \n    Now, if c is a d–cube for d≥ 2, then for some s∈{0,…,d}, there are 1–cubes e_1,…,e_s⊂ c that span an s–cube c' and have the property that the \n    hyperplanes ĥ_1,…,ĥ_s respectively dual to e_1,…,e_s are precisely the hyperplanes intersecting both c and A.  (The case s=0 corresponds to the situation where no \n    hyperplane intersecting c intersects A, and c' is an arbitrary 0–cube of c.)  So for 1≤ i≤ s, we have that e̅_i=_A(e_i) is a 1–cube of A dual to ĥ_i, and the \n    1–cubes e̅_1,…,e̅_s span an s–cube c̅'.  We extend _A over c' using the obvious cubical isometry c'→c̅' extending the map _A on 1–cubes.  By \n    construction, for each v∈ c^(0), there is a unique 0–cube v'∈ c' such that _A(v)=_A(v'), the assignment v↦ v' extends to a cubical map c→ c' (collapsing the \n    hyperplanes not in {ĥ_1,…,ĥ_s}), and composing this with _A:c'→ A gives the (extended) gate map _A:c→ A.  Note that c'⊂ c is only unique up to parallelism, \n    but any two allowable choices of c' give the same map c→ A.  \n    \n    \n    \n    We conclude that gates enjoy the following properties: \n    \n    \n    Let A⊂ X be a convex subcomplex.  Then:\n    \n      *  For all x,y∈ X, we have (_A(x),_A(y))=(x,y)∩(A), and (x,_A(x))=(x,A).\n      *  The map _A is 1–lipschitz on X^(0) with the d_1 metric and the CAT(0) \n    metric d_X.\n    \n    For 0–cubes, the first part of conclusion <ref> appears in various places in the literature; see e.g. <cit.>, or one can deduce it easily from \n    Proposition <ref>.  The second part of the first assertion (again for 0–cubes) restates Proposition <ref>.  The generalization of <ref> to arbitrary points in X \n    follows immediately from the corresponding assertion for 0–cubes, together with the construction in Remark <ref>. \n    \n    Finally, <ref> implies the first part of <ref>, since _1(x,y)=|(x,y)| for \n    0–cubes x,y.  For the second part, first note that the restriction of π_A to each cube is 1–lipschitz for the \n    CAT(0) metric, since it factors as the natural projection of the cube onto one of its faces (which is lipschitz for the \n    Euclidean metric) composed with an isometric embedding.  Now, fix x,y∈ X and let γ be the CAT(0) geodesic joining \n    them, which decomposes as a finite concatenation of geodesics, each lying in a single cube.  Each such geodesic is mapped to \n    a path whose length has not increased, so π_A∘γ is a path from π_A(x) to π_A(y) of length at most \n    _X(x,y), as required.\n    \n    \n    The following standard application of gates is often called the bridge lemma.  \n    \n    \n    \n    Let I,J⊂ X be convex subcomplexes.  Let _I  X → I and _J  X→ J be the gate maps.  Then the following hold:\n     \n      * _I(J) and _J(I) are convex subcomplexes.\n         \n      * (_I(J))=(_J(I))=(I)∩(J).\n         \n      *  The map _I _J(I)→_I(J) is an isomorphism of CAT(0) cube complexes.\n         \n      *  The cubical convex hull  (_I(J)∪_J(I)) is a CAT(0) cube complex isomorphic to _J(I)×(x,_J(x)) for any vertex x∈_I(J).\n    \n      *  If I∩ J≠∅, then _I(J)=_J(I)=I∩ J, and (I∩ J)=(I)∩𝒲(J).\n     \n         This can be assembled from results in the literature in various ways.  For example, the first statement is part \n    of <cit.>; the second and last statements follow from <cit.>.  The \n    third follows from <cit.>.  For the fourth, see <cit.> or <cit.>.\n    \n    \n     §.§ Facing tuples and properness\n    \n    A facing k–tuple of hyperplanes is a set {ĥ_1,…,ĥ_k} of hyperplanes such that, for each i≤ \n    k, we can choose a half-space h_i such that h_i∩ h_j=∅ for i≠ j.  We are often particularly interested in \n    facing triples, since many of the subcomplexes of X considered later in the paper will be CAT(0) cube complexes that do \n    not contain facing triples.\n    \n    One useful application of the notion of a facing tuple is the following lemma, which in practice will be used to guarantee \n    properness of certain subcomplexes of X.  See <cit.> for a more detailed discussion. See also <cit.> for a related result,  where X is required to  isometrically  embed into ^D for some D.\n    \n    \n    \n    Let X be a CAT(0) cube complex of dimension D<∞.   Suppose that there exists T such that X does not contain a \n    facing T–tuple.  Then  (X,_X) is a \n    proper CAT(0) space.\n    \n    Let R≥ 0 and let B be a ball of radius R in X (with respect to the CAT(0) metric _X).  Let (B) be the set of hyperplanes intersecting B.\n    \n    We say that hyperplanes ĥ_1,…,ĥ_n in (B) form a chain if (up to relabelling), each\n    ĥ_i separates ĥ_i-1 from ĥ_i+1 for 2≤ i≤ n-1.\n    \n    We claim that there exists N, depending only on D and R,  such that any chain in (B) has cardinality at most \n    N. Indeed, if ĥ_1,…,ĥ_n is a chain, then any edge dual to ĥ_1 lies at ℓ^1 distance at least \n    n-2 from any edge dual to ĥ_n. Now,  Lemma <ref> implies there exists N (depending only on D and R) such that n>N implies that \n    _X(ĥ_1,ĥ_n)>2R.  This is impossible, since ĥ_1,ĥ_n intersect a common R–ball.\n    \n    On the other hand, <cit.> provides a constant K=K(D,T) such that any finite set \n    ℱ⊂(B) must contain a chain of length at least |ℱ|/K.  So, |(B)|≤ KN.\n    \n    Let (B) be the cubical convex hull of B. \n      The set of hyperplanes of the CAT(0) cube complex (B) is 𝒲(B), which we have just shown is finite.  Hence (B) is a compact CAT(0) cube complex, and hence proper.  Since B↪ X is an isometric embedding (with respect to CAT(0) metrics), B is a ball in (B), and is therefore \n    compact.  This completes the proof.\n    \n    \n    The use of the above lemma will be the following.  Given x∈ X^(0) and y∈ X, we can consider the interval \n    (x,y) in X̃.  The intersection (x,y)∩ X is a vertex-convex set, which is the 0–skeleton of a uniquely \n    determined convex subcomplex A.  Note that (A)=(x,y).  This \n    infinite set of hyperplanes cannot contain a facing triple.  Hence, Lemma <ref> shows that A is \n    proper.  We will need this in the proof of Lemma <ref>, to arrange for a sequence of CAT(0) geodesic segments in A to converge uniformly on compact sets to a CAT(0) \n    geodesic ray.  In this way, we avoid a blanket hypothesis that X is proper. \n    \n    Note that we therefore only use a special case of the lemma, namely properness of cubical intervals.  Properness of intervals follows from a much stronger statement: intervals endowed with the ℓ_1 metric  isometrically embed into ^(X) (i.e. are Euclidean). It follows that intervals are proper in the CAT(0) metric, since the two metrics are bilipschitz.  This \n    embedding  into ^(X) goes back at least to <cit.>. This embedding is closely related to <cit.>, which bounds the cardinality of facing tuples in Euclidean CAT(0) cube \n    complexes, which include, but are more general than, cubical intervals.  \n    \n    \n    \n    \n     §.§ Combinatorial Geodesic Rays\n    \n    \n    Next, we develop some basic facts about combinatorial geodesics in CAT(0) cube complexes that will be needed when we relate different types of boundaries.\n    \n    \n     A map γ [0, ∞)→ X^(1) is said to be a combinatorial geodesic ray if γ() ⊂ X^(0) and for each \n    n,m ∈ we have  d_1(γ(n), γ(m) ) = |n-m| and γ is an isometry on each interval [n, n+1]. \n    \n     Let γ [0,∞)→ X be a combinatorial geodesic ray. There exists a unique point  y∈ X such that γ(n) →  y\n    in X̃ as n →∞. \n    \n    \n    In the sequel, we will write y = γ(∞) to mean γ(n) →  y.\n    \n    \n    \n    Consider the set\n    \n        D(γ) = {h∈: γ([N,∞)∩)⊂ h for some  N∈}.\n     \n    This is clearly a consistent choice of half-spaces. We claim that for each h∈, either h or h^* belongs to \n    D(γ).\n    Indeed, up to replacing h by h^*, there must be a monotonic sequence n_k→∞ such that γ(n_k) ∈ h. Since h is \n    convex, it follows that γ([n_1,∞)∩) ⊂ h.\n    \n    Now, define C = \n    ⋂_ h ∈ D(γ) h. We claim that C consists of exactly one point. Note that C ≠∅ because \n    it is a nested intersection of compact sets in X̃. On the other hand, if x,x' ∈ C are distinct points, then consider \n    a \n    half-space h such that x ∈ h and x' ∈ h^*. This half-space must satisfy both h ∈ D(γ) and h^* ∈ D(γ), a contradiction. Thus \n    C = {y}, as desired.\n    \n     For every x∈ X^(0) and every y ∈ X, there is a combinatorial geodesic ray γ [0,∞) → X such that γ(0) = \n    x and γ(∞) =  y. \n    \n    \n    The proof of Lemma <ref> is modeled on the construction of normal cubed paths, introduced by Niblo and Reeves in <cit.>.\n    \n    \n    Without loss of generality, let us assume that X̃= (x,y), that is, (X) = _x^+_y^+. \n    The collection of half-spaces _x^+∖_y^+ is partially ordered by set inclusion. Consider h, k ∈_x^+∖_y^+. Since x∈ h∩ k and y∈ h^*∩ k^*, the possible relations between h and k are: h⊂ k or k⊂ \n    h or h⋔ k. In other words, incomparable elements are transverse. In particular, all minimal elements of \n    _x^+∖_y^+ must be pairwise transverse.  By finite dimensionality, the set M_1 of minimal elements is \n    finite.  Let x_1 be the vertex obtained by replacing every h ∈ M_1 by h^*, that is, _x_1^+= \n    (_x^+∖ M_1)∪ M_1^*, a clearly consistent and total choice of half-spaces. In other words, x_1 is \n    diagonally across from x in the unique maximal cube containing x in the vertex interval (x, y). \n    \n    Proceeding by induction, suppose that x_n-1 has been defined. \n    Let M_n be the set of minimal elements of  _x_n-1^+ ∖_y^+.\n    \n    Let x_n be the vertex obtained by replacing every h ∈ M_n by h^*, corresponding to the half-space interval _x_n^+= (_x_n-1^+∖ M_n)∪ M_n^*.\n    \n    Observing that M_k^*∩ M_j = ∅ for j < k,\n    we conclude that \n    \n        _x_n^+= ( _x^+∖⋓j=1n-1 M_j ) ∪( ⋓j=1n-1 M_j^*).\n    \n    \n    Fix k<m ∈. We claim that for any integer ℓ∈  [k, m], x_ℓ lies on every geodesic path from x_k to \n    x_m.\n    Equivalently, we claim that\n    the median of x_k, x_ℓ, and x_m is x_ℓ. Recall that this will be the case if every half-space \n    containing x_k and x_m also contains x_ℓ. This containment can be established as follows\n    \n        _x_k^+ ∩_x_m^+     = ( _x^+ ∖⋓j=1m-1 M_j )∪( ⋓j=1k-1M_j^* ) \n           ⊂( _x^+ ∖⋓j=1ℓ-1 M_j ) ∪( ⋓j=1ℓ-1M_j^* ) = \n        _x_ℓ^+.\n    \n    This proves the claim.\n    \n    Set x_0=x and choose an edge-geodesic γ_k  [0, d(x_k-1, x_k)] →(x_k-1, x_k) from x_k-1 to x_k. Finally, define γ as the infinite\n    concatenation γ_1  γ_2 ⋯. Then, by construction, γ(∞) =  y.\n    \n    \n    We will discuss further properties of combinatorial geodesic rays in Section <ref>.\n    \n    \n    \n    § CUBOID COMPLEXES WITH MODIFIED CAT(0) METRICS\n    \n    \n    A cuboid is a box of the form [0,a_1] ×…× [0,a_n] ⊂^n. \n    In this section, we describe a way to modify the metric on a\n    finite-dimensional CAT(0) cube complex X to produce a new CAT(0) space whose cells are cuboids rather than cubes.   Our \n    results relating the Tits boundary and simplicial boundary of a CAT(0) cube \n    complex will carry over to this context with small changes to some proofs, which we will indicate in the relevant places.\n    \n    The reader only interested in CAT(0) cube complexes with the standard CAT(0) metric can safely skip this section, apart from the statements of Lemmas <ref> and <ref>. \n    Those lemmas are cuboid generalizations of standard results in the literature, namely <cit.> and <cit.>. Thus, in the standard metric, one can substitute those results from the literature for the lemmas of this section.\n    \n    \n    \n    Let X be a finite-dimensional CAT(0) cube complex and let G →(X) be a group acting on X by cubical automorphisms.  Let \n     be the set of hyperplanes in X. \n    \n    \n    A hyperplane rescaling \n     of X is a map ρ→ (0,∞). The rescaling is called G–admissible \n    if it is G–invariant, and in addition we have m_ρ=inf_ĥ∈ρ(ĥ)>0 and M_ρ=sup_ĥ∈ρ(ĥ)<∞.\n    \n    \n    Let ρ be a G–admissible hyperplane rescaling of X.  Fix a cube c of X.  For each hyperplane ĥ_i \n    intersecting c, let ρ_i=ρ(ĥ_i).  Regarding c as an isometric \n    copy of ∏_i[0,ρ_i], with the Euclidean metric, let d_X^ρ be the resulting piecewise-Euclidean path metric on \n    X.\n    \n      The following result is a special case of a theorem of Bowditch <cit.>, but we are able to give a direct proof. \n    \n    \n    Suppose that G acts on X by cubical automorphisms, and let ρ be a G–admissible hyperplane rescaling of X.  Then \n    (X,d_X^ρ) is a CAT(0) space, and the \n    action of G on (X,d_X^ρ) is by isometries.\n    \n    Let x ∈ X be an arbitrary point. Then the link of x in (X,^ρ_X) \n    is isometric to the link of x  in (X,d_X), and is hence a CAT(1) space. Since the amount of rescaling in bounded, there is a small ϵ depending on x and ρ such that the \n    ϵ–balls about x in the two metrics are (abstractly) isometric. Thus (X, d_X^ρ) is locally CAT(0). Recalling that X is contractible (the homeomorphism type has not changed), we \n    conclude that (X, d_X^ρ) is globally CAT(0) by Cartan–Hadamard theorem <cit.>. \n    \n     Since ρ is G–equivariant, G takes cuboids to d_X^ρ–isometric cuboids, \n    hence G acts by isometries.  \n    \n    \n    One can also prove Lemma <ref> using a result of Bridson and Haefliger <cit.>. Our proof is essentially the same argument, but the cubical structure allows us to assume bounded rescaling rather than\n    finitely many shapes.\n    \n    \n    \n    Consider a finite-dimensional CAT(0) cube complex X, a group G acting on X by cubical automorphisms, and a G–admissible hyperplane rescaling \n    ρ of X. We say that the CAT(0) metric \n    d_X^ρ from Lemma <ref> is a CAT(0) cuboid metric on X, and (X,d_X^ρ) is a CAT(0) \n    cuboid complex.\n    \n    Suppose that G acts on X by cubical automorphisms, and let ρ be a G–admissible hyperplane rescaling of X. Define (X^ρ) ⊂(X) to be the automorphism group of the rescaled complex (X,d_X^ρ). By construction, the representation G →(X) has image in \n    (X^ρ). \n    \n    Every cubically convex subcomplex Y ⊂ X is also geodesically convex in the rescaled metric d_X^ρ.\n    In particular, every CAT(0) half-space (k) is convex in d_X^ρ.\n    \n    By Definition <ref>, a cubically convex subcomplex is an intersection of CAT(0) half-spaces. Since any intersection of d_X^ρ–convex sets will be d_X^ρ–convex, it suffices to prove that CAT(0) half-spaces are d_X^ρ–convex.\n    \n    Now, let k ∈(X), and let (k) be the the corresponding CAT(0) half-space. Observe that (k) is a CAT(0) cube complex in its own right with half-space structure (k) = {h∈: \n    h⋔ k}. Let G_k= _G(k) which then acts by isometries on ((k)). Clearly the restriction \n    ρ|_(k) is G_k–admissible. By Lemma <ref> we have ((k), \n    d^ρ|(k)_(k)) is a CAT(0) space, so that\n    \n        d_X^ρ|_(k) = d^ρ|_(k)_(k).\n    \n    \n    Therefore, the identity inclusion (h) ↪ X is isometric with respect to this new CAT(0) metric, and in \n    particular (k) is d_X^ρ–convex. \n    \n     \n     The following result is a generalization of <cit.> for CAT(0) cuboid complexes.\n    \n    \n    \n    Let X be a CAT(0) cube complex and let ρ be a G–admissible hyperplane rescaling.  Suppose that (X) =𝒲_1⊔_2, where ĥ,v̂ cross whenever ĥ∈_1,v̂∈_2.  \n    \n    Then X=X_1× X_2 (as a product cube complex), where X_1 and X_2 are CAT(0) cube complexes dual to _1 and _2.  \n    \n    Letting p_i  X→ X_i denote the natural projection, \n    for i∈{1,2}, the map p_i induces a bijection on the sets of hyperplanes such that the preimages of the hyperplanes in \n    X_i are the hyperplanes in _i.  \n    \n    Moreover, restricting ρ \n     to _i, we obtain rescaled CAT(0) metrics ^ρ_X_i such that (X_i,^ρ_X_i) is a CAT(0) \n    cuboid complex and we have\n    \n        ^ρ_X(x,y)=√(^ρ_X_1(p_1(x),p_1(y))^2+^ρ_X_2(p_2(x),p_2(y))^2)\n     \n     for all x,y∈ X. \n    \n    The statement about X decomposing as a product cube complex follows from <cit.> and the \n    discussion in <cit.> preceding it.  So, it remains to prove the \n    statement about rescaled CAT(0) metrics.\n    \n    Admissibility of the rescalings on X_1,X_2 follows from admissibility of ρ and the fact that p_i is a \n    restriction quotient in the sense of <cit.>, meaning it sends \n    hyperplanes to hyperplanes.  So, Lemma <ref> makes each (X_i,^ρ_X_i) a CAT(0) cuboid \n    complex.\n    \n    We now verify the metric statement.  Let x,y∈ X.  Let α be the ^ρ_X–geodesic from x=(p_1(x),p_2(x)) \n    to y=(p_1(y),p_2(y)).  Let β be the ^ρ_X–geodesic from \n    (p_1(x),p_2(y)) to (p_1(x),p_2(x)), and let γ be the ^ρ_X–geodesic from (p_1(y),p_2(y)) to (p_1(x),p_2(y)).  So, \n    αγβ is a geodesic triangle.  \n    \n    Note that every point on β has the form (p_1(x),z) and every point on γ has the form (z,p_2(y)), because the \n    p_i are restriction quotients and therefore have convex fibers by \n    Lemma <ref>.  In particular, β=^ρ_X_2(p_2(x),p_2(y)) and \n    γ=^ρ_X_1(p_1(x),p_1(y)) and p_1,p_2 are respectively isometries on γ \n    and β.  Moreover, the Alexandrov angle (see Definition <ref>) formed by β and γ at their common point is π/2.  Perform the \n    same construction with (p_1(x),p_2(y)) replaced by (p_1(y),p_2(x)).  This \n    yields a geodesic quadrilateral in (X, ^ρ_X), with all angles π/2, two adjacent sides having length \n    ^ρ_X_2(p_2(x),p_2(y)) and ^ρ_X_1(p_1(x),p_1(y)), and x and y as opposite \n    corners.  The Flat Quadrilateral Theorem (<cit.>) now implies that \n    \n        ^ρ_X(x,y)=√(^ρ_X_1(p_1(x),p_1(y))^2+^ρ_X_2(p_2(x),p_2(y))^2),\n    \n    as required.\n    \n    \n    We also need the following standard lemma.  In the context of CAT(0) cube complexes, this is <cit.>.  We state it here for cuboid complexes.  The proof \n    from <cit.> goes through with tiny changes that we indicate below.\n    \n    \n     Let X be a D–dimensional CAT(0) cube complex and let ρ be a G–admissible hyperplane rescaling.  Let (X,d^ρ_X) be the resulting CAT(0) cuboid complex.  Let \n    γ [0,∞)→ X be a geodesic ray for the metric d^ρ_X, with γ(0)∈ X^(0).  Then X contains a combinatorial geodesic ray α in X^(1) such that \n    α(0)=γ(0) and such that α fellow-travels with γ at distance depending only on D and ρ.\n    \n    The proof from <cit.> works with almost no change.  First, <cit.> is about the combinatorial structure of X only, which does not change \n    when we rescale edges to pass from the CAT(0) metric d_X to the CAT(0) metric d_X^ρ.  The proof of <cit.>  needs this lemma, plus CAT(0) convexity of \n    half-spaces, which continues to hold in view of Corollary <ref>.  The proof of <cit.> produces a combinatorial ray α such that each \n    point of α lies in a common cube as a point of γ, and vice versa.  Hence the two rays fellow travel at CAT(0) distance bounded by the diameter of a cube.  In the metric d_X, this is \n    bounded in terms of D; in the metric d_X^ρ, this is bounded in terms of D and the constant M_ρ from Definition <ref>, as required by the statement.\n    \n    \n    Since d_X and d_X^ρ are path-metrics, and for each cube c of X, the standard CAT(0) metric d_X on c is bilipschitz \n    to the restriction of d_X^ρ (with constant depending only on the rescaling constant), the identity map \n    (X,d_X)→(X,d_X^ρ) is bilipschitz.  Combining this fact with Lemma <ref> yields a version of Lemma <ref> for the rescaled metric d_X^ρ:\n    \n    \n    There are constants λ_0^ρ≥ 1, λ_1^ρ≥ 0, depending on X and ρ, such that the following holds. For any pair \n    of points x, y ∈ X,\n    \n        1/λ_0^ρ  d_X^ρ(x,y) - λ_1^ρ≤ |(x,y)| ≤λ_0^ρ  d_X^ρ(x,y) + λ_1^ρ.\n    \n    \n    In a similar fashion, by Remark <ref>, there is a bilipschitz relationship between (X, d_X^ρ) and (X, d_1).\n    \n    \n    \n    § THE  SIMPLICIAL ROLLER BOUNDARY X\n    \n    In this section, we discuss one of the main objects in the paper: the simplicial Roller boundary.\n    \n    \n    \n    Let x,y ∈X̃.  Recall that (x,y) = _x^+  _y^+ is the set of half-spaces that separate x from y. We say that x is commensurate to y, and write x∼ y, if  |(x,y)|< ∞.  \n    Observe that X^(0) forms a single commensurability class in X̃. Commensurability classes contained in  X = \n    X̃∖ X^(0) are also called Roller classes.\n    \n     The Guralnik quotient of the Roller Boundary is X =  X / ∼,  the set of commensurability \n    classes of points in the Roller boundary <cit.>. We shall often implicitly consider elements [x]∈ X as \n    subsets [x]⊂X̃. \n    \n    \n     \n    In most cases,  the quotient topology on X =  X / ∼ is not Hausdorff (in  fact, it does not even \n    satisfy the T_1 axiom). We think of X as only a set, without a topology. In \n    Definition <ref>, we will use a partial order on X to define a simplicial complex X with far nicer topological properties.\n    \n    \n    Following <cit.>,  we  say a set S⊂ is non-terminating if S contains no minimal elements: \n    given any half-space h∈ S, there is a half-space k⊊ h with k∈ S. \n    \n    \n    \n    Let C ⊂ X be a closed, convex set. The following are equivalent:\n    \n      *  There is a point y∈∂ X such that C= [̃ỹ]̃.\n    \n      *  There exists k≤ (X) and a family (h^1_m)_m≥ 0, (h_m^2)_m≥ 0,…, (h_m^k)_m≥ 0 of descending chains of  half-spaces  such that \n    \n        C =⋂_i=1^k⋂_m≥ 0h_m^i.\n    \n      * C is a union of Roller classes.\n    \n      *  The set of half-spaces _C^+ is non-terminating.\n    \n    We will prove <ref>⇒<ref>⇒<ref>⇒<ref> and <ref>⇔<ref>. \n    \n    The claim that <ref> implies <ref>  is a restatement of <cit.>.\n    \n    \n    \n    \n    \n    \n    To prove that <ref> implies <ref>,\n    assume that y ∈ C = ⋂_i=1^k⋂_m≥ 0h_m^i and y' ∼ y\n    meaning that  |(y, y')|< ∞. \n    Since _y^+ ∖_y'^+ is finite, it follows that there exists an N for which h_m^i ∈_y'^+ (i.e. y'∈ h_m^i) for each m≥ N and i=1, …, k.\n    That is to say, \n    \n        y'∈⋂_i=1^k⋂_m≥ Nh_m^i= ⋂_i=1^k⋂_m≥ 0h_m^i = C.\n    \n    \n    To prove\n    <ref> implies <ref>,\n    suppose that C is  a union of Roller classes. \n    Let _C be the collection of half-spaces that cut C.  By Theorem <ref>, there is an associated cube complex X(_C). \n    Since C is closed and convex, Proposition <ref> and Lemma <ref> give an embedding i_C X̃(_C)↪X̃ whose image is C, and furthermore\n    C= ⋂_h∈_C^+h.\n    \n    \n    Let y_0 ∈ X(_C)^(0) and note that [̃ỹ_̃0̃]̃= X̃(_C).   Let  y=i_C(y_0)∈ C and note that i_C([y_0]) ⊂ [y], hence C=i_C([̃ỹ_̃0̃]̃) ⊂[̃ỹ]̃.  Since C is a union of equivalence classes, we have [y]⊂ C. Since C is closed, we have that [̃ỹ]̃⊂ C and hence C= [̃ỹ]̃.\n     \n    \n    \n    \n    To prove <ref> implies <ref>,\n    suppose  there exists a minimal half-space h_0∈_C^+. We claim that _C^+∖{h_0} is consistent. Indeed, if h∈_C^+∖{h_0} then h^*∉_C^+∖{h_0}. If h⊂ k then k∈_C^+, and since h_0 is minimal, h_0≠ k so k∈_C^+∖{h_0}. \n    \n    We may therefore consider the CAT(0) cube complex associated to _C ⊔{h_0, h_0^*}. Fix y, y' ∈ X(_C ⊔{h_0, h_0^*}) such that y∈ h_0 and y'∈ h_0^*. Then, by Proposition <ref>  there is a unique point ỹ∈ C associated to the total and consistent choice of half-spaces \n        {h∈_C: y∈ h}⊔_C^+.\n     Similarly, there is a unique point ỹ'∈ X∖ C associated to \n        {h∈_C: y'∈ h}⊔{h_0^*}⊔ (_C^+∖{h_0}).\n    \n    By construction, |(ỹ, ỹ')| = 2, hence C is not a union of Roller classes. \n    \n    \n    \n    Finally, to prove <ref> implies <ref>, suppose that C is not a union of Roller classes. Then there are commensurate elements \n    y∈ C and  y' ∈ X ∖ C. Convexity means \n    \n        C = ⋂_h∈_C^+h,\n    \n    hence there is a half-space h∈_C^+ with y∈ C ⊂ h and y'∉ h. Under the assumption that \n    |(y,y')|<∞, we may choose a minimal such h and conclude that _C^+ fails to be non-terminating. \n    \n    Given a closed, convex set C satisfying \n    one of the equivalent conditions of Lemma <ref>, the class [y] whose closure is C is called the principal class of C. Compare Guralnik <cit.>. \n    \n    Let [x],[y] ⊂ X be Roller classes. \n    We define a partial order on X by setting [x] ≤ [y] whenever _[x]^+ ⊂_[y]^+, or equivalently _[̃x̃]̃^+ ⊂_[y]^+.\n    \n    \n    The following result is essentially a corollary of Lemma <ref>.\n    \n    \n     For Roller classes [x],[y] ⊂ X, the following are equivalent:\n     \n      * [x] ≤ [y]\n      * _[x]^+ ⊂_[y]^+\n      * [y]⊂[̃x̃]̃\n      * [y]∩[̃x̃]̃≠∅\n    \n    Conditions <ref> and <ref> are equivalent by Definition <ref>.  Since _[x]^+ =_[̃x̃]̃^+, by Lemma <ref>, Remark <ref> implies that <ref> and <ref> are equivalent. Next, <ref> trivially implies <ref>. Finally, <ref> implies <ref> by Lemma <ref>.\n    \n    The simplicial Roller boundaryX is the simplicial realization of the partial order of Definition <ref>. That is: vertices of X correspond to points of X, or equivalently Roller classes in X. Simplices in  X correspond to totally ordered chains of Roller classes. \n    \n    Observe that the action of (X) on X preserves commensurability classes and the order ≤, yielding a bijective action  on X and a simplicial action on X.\n    \n    The characterization of Lemma <ref>.<ref> implies that any simplex in X has k ≤ X vertices, hence X≤ X-1.\n    \n    \n    § THE SIMPLICIAL BOUNDARY\n    \n    \n    In this section, we recall the definition of the simplicial boundary ∂_ X<cit.>; see Definition <ref>. Then, we \n    develop some connections between ∂_ X, the Roller boundary X, and the simplicial Roller boundary X. See Theorem <ref> and Corollary <ref> for the most top-level statement. The lemmas used to prove those top-level results will be extensively used in later sections.\n    \n    \n    \n     §.§ Unidirectional boundary sets\n     \n    Recall that  is the set of half-spaces of X and  is the set of hyperplanes of X. In this section, we mainly focus on collections of hyperplanes.\n    \n    \n    A  triple  h_1, h_2, h_3 ∈ is called a facing triple if  their complements h_1^*, h_2^*, h_3^* are \n    pairwise disjoint. Similarly, a triple of hyperplanes ĥ_1, ĥ_2, ĥ_3 ∈ is called a facing \n    triple if there exists a choice of orientation such that h_1, h_2, h_3 form a facing triple.\n    \n    \n    Caprace and Sageev  <cit.> showed that  in a non-elementary\n     essential CAT(0) cube complex, given any half-space h∈ there exist half-spaces k, ℓ∈ such that {h,k,ℓ} is a facing triple. \n    \n    \n    \n    A collection  of hyperplanes 𝒮⊂ is called unidirectional if for every ĥ∈𝒮, at most one side of ĥ contains infinitely many other elements of 𝒮. \n    \n    A collection 𝒮⊂ is called inseparable if whenever ĥ, k̂∈𝒮 and ℓ̂ is a hyperplane that separates ĥ and k̂, then ℓ̂∈𝒮. This is closely related to the “tightly nested” condition in Proposition <ref>.\n    \n     A set ⊂ is a unidirectional boundary set (abbreviated UBS) if it is infinite, unidirectional, inseparable, and does not contain a facing triple. \n      \n    Let  and 𝒱 be UBSes.  Define a relation ≼ where ≼𝒱 if all but finitely many elements of  lie in\n    𝒱.  Say that  and  are commensurate (denoted ∼)  if ≼ and ≼.\n    \n    The relation ≼ on UBSes descends to a\n    partial order on commensurability classes of UBSes. We say that  is minimal if its commensurability class is minimal — that is, if  ≼ implies ∼. Similarly, we say that  is maximal if ≼' implies ∼'.\n    \n    For disjoint subsets A, B ⊂X̃, let (A, B) be the set of hyperplanes separating A from B.\n     It is straightforward to check that (A, B) is inseparable and does not contain a facing triple. Furthermore, if A⊂ X then (A, B) is unidirectional.  If, in addition, B⊂ X, then (A, B) is infinite. Under these last two conditions, we conclude that (A, B) = (A, B) is a UBS. Compare Lemma <ref>.\n     \n    Let  be a UBS. We say that  is pruned if every hyperplane ĥ∈ has exactly one associated half-space h containing infinitely many elements of . In this situation, we call \n    h the  canonical orientation of ĥ or the canonical half-space associated to ĥ.\n    \n    Let  be a UBS. Then  contains a canonical pruned sub-UBS ' ⊂ that is commensurate to .\n    \n    Let F_ be the set the hyperplanes of  with the property that both associated half-spaces contain finitely many elements of . We claim that F_ is finite.\n    To see this, let ĥ_1, …, ĥ_D be a maximal family of pairwise transverse hyperplanes in F_. This family is finite because D ≤ X. For any ĥ∈ F_∖{ĥ_1, …, ĥ_D} there is at least one i for which ĥ is parallel (i.e. not transverse) to ĥ_i. By the definition of F_,  there are finitely many hyperplanes in  parallel to each ĥ_i,\n     hence F_ is finite. \n     \n     Now, define ' = ∖ F_. By construction, every ĥ∈' has exactly one associated half-space containing infinitely many elements of , hence infinitely many elements of ' as well.\n     \n    We claim that ' is a UBS. Since F_ is finite, it follows that ' is infinite. Unidirectionality and the lack of facing triples are properties that pass to subsets of , hence to '.  Next, suppose that ĥ, k̂∈' with ℓ̂ in between. Since ĥ, k̂∈ and  is inseparable, observe that ℓ̂∈. But\n    ℓ̂∉ F_, because ĥ, k̂ both bound half-spaces containing infinitely many elements of . We conclude that ℓ̂∈', verifying that ' is a UBS. Since  and ' differ by finitely many hyperplanes, they are commensurate.\n    \n    \n    \n    Hagen proved that every (commensurability class of) UBS  decomposes in a well-defined fashion into a disjoint union of minimal UBSes.\n    The following is a restatement of <cit.> and <cit.>.\n    \n    \n    Let  be a UBS. Then there is a decomposition ∼_i=1^k _i, where:\n    \n      *  each _i is a minimal UBS;\n      \n      *  any UBS ⊂ is commensurate with the disjoint union of some of the _i;\n      \n      *  if 1≤ j < i ≤ k, then every hyperplane in _i crosses all but finitely many of the hyperplanes in _j.\n     \n    Consequently, there are finitely many commensurability classes of UBSes ≼.\n    \n    \n    Lemma <ref> enables the following definition.\n    \n    \n    \n    \n    For a UBS , the dimension of  is the number k appearing in the decomposition of Lemma <ref>. This is an invariant of the commensurability class.\n    An immediate consequence of Lemma <ref>.<ref> is that () ≤ (X).\n    \n    The simplicial boundaryX is the following simplicial complex.  For each commensurability class of a UBS \n    , there is a (k-1)–simplex σ_, where k is the dimension of the class of .  The face relation is defined \n    as follows: σ_ is a face of σ_ if and only if ≼.  \n    \n    \n    Note that X has a vertex for each commensurability class of a minimal UBS. Furthermore, a finite collection of \n    vertices spans a maximal simplex if and only if the union of the corresponding minimal UBSes is commensurate with a maximal UBS. However, there can exist non-maximal simplices that do not correspond \n    to a UBS; see Example <ref>. For this reason, X is not the simplicial realization of the partial order ≼.\n    \n    \n    Observe that (X) acts on UBSes in a way that preserves  the ≼ relation, and hence preserves commensurability. Thus (X) acts simplicially on X.\n    \n    \n    \n    \n     §.§ Minimal and dominant UBSes\n    \n    Next, we establish some structural results about minimal UBSes. \n    Given a set S consisting of hyperplanes, the inseparable closure of S, denoted S,\n     is the intersection of all inseparable sets containing S. \n    \n    \n    Let ⊂(X) be a minimal UBS.  Then there exists an infinite descending chain {h_n : n ∈}⊂ with ĥ_n ∈, such that ∼{ĥ_n:n∈}.\n    \n    \n    Conversely, for every descending chain {h_n : n ∈}⊂, there exists N≥ 0 such that {ĥ_n:n≥ N} is a minimal UBS.\n    \n    Let  be a minimal UBS.  Let  {h_n : n ∈}⊂ be a descending chain such that {ĥ_n}⊂, which exists because  is infinite, unidirectional, contains no facing triple, and \n    contains no infinite collection of pairwise-crossing hyperplanes.  Let ' = {ĥ_n} be the inseparable closure of {ĥ_n}. Since  is \n    inseparable, we have '⊂ by the definition of the inseparable closure.   Note that ' is a UBS (compare the proof of <cit.> or <cit.>).  Since '⊂ and  is minimal, we have '∼, which \n    proves the first assertion of the lemma.\n    \n    Now we prove the second assertion.  For each m≥ 0, let C_m={h_n:n≥ m} and let C_m be its inseparable closure.  As before, each C_m is a UBS.  Note that C_m⊂C_m' whenever m≥ m'.  In particular, C_m≼C_m' for m' ≥ m.  So, by Lemma <ref>, there exists M≥ 0 such that C_m∼C_M for all \n    m≥ M.  Hence, if m≥ M and {k_i} is any descending chain of half-spaces corresponding to hyperplanes in C_M, then there exists I≥ 0 such that {k̂_i : i≥ I}⊂ C_m.  This implies that C_M is commensurate with {k̂_i :i ≥ 0}, by, for example <cit.>. See also the proof of <cit.>.    \n    \n    Now let ⊂ C_M be a minimal UBS, which exists by <cit.>.  By the first part of the lemma,  is commensurate with the inseparable closure of some chain contained in \n    C_M.  By the preceding paragraph, C_M∼, so C_M is minimal, as required.\n    \n    Lemma <ref> has been generalized to the setting of median spaces by Fioravanti <cit.>. In fact, the same result of Fioravanti also generalizes \n    many other basic facts about UBSes, such as <cit.>.  \n    \n    The second assertion of Lemma <ref> corrects a slight misstatement in <cit.>: it is \n    true that minimal UBSes are commensurate with inseparable closures of chains, but inseparable closures of chains need not be minimal; one might first need to pass to a (cofinite) sub-chain (see \n    e.g. <cit.> and the paragraph following).  We emphasize that this does not affect the use \n    of <cit.> in <cit.>, because what's being used is the (correct) statement that, up to \n    commensurability, minimal UBSes arise \n    as inseparable closures of chains.\n    \n    In this paper, we primarily use the first assertion of Lemma <ref>, in conjunction \n    with Lemma <ref>, to decompose a UBS  as a disjoint union of minimal UBSes (up to commensurability), \n    each of which has the additional property that it is the \n    inseparable closure of a chain.\n    \n    \n    \n    \n    The following consequence of Lemma <ref> neatly sums up the special properties of chains whose inseparable \n    closures are minimal UBSes:\n    \n    \n    \n    Let {h_n:n≥ 0} be an infinite descending chain of half-spaces.  For each m≥ 0, let _m be the inseparable closure of {ĥ_n:n≥ m}.  Then the following are equivalent:\n    \n      *  The UBS _m is minimal for all m≥ 0.\n     \n      * _m∼_0 for all m≥ 0.\n    \n    In particular, if _0 is minimal, then _0∼_m for all m≥ 0.\n    \n    Since _m≼_0 for all m, the first statement immediately implies the second.  For the reverse direction, Lemma <ref> provides M≥ 0 such that _m is minimal for m≥ \n    M.  If the second assertion holds, it then follows that the first must also.  \n    \n    Following Corollary <ref>,  for the rest of this subsection we shall refer to a sequence of disjoint hyperplanes {ĥ_n } whose inseparable closure is a minimal UBS\n     as a chain of hyperplanes.\n    \n     \n     In particular, a chain of hyperplanes {ĥ_n }_n≥ 0 defines a descending chain of half-spaces { h_n }_n≥ 0.  A descending chain of half-spaces { h_n }_n≥ 0 has the \n    property that for all sufficiently large N, the sequence {ĥ_n }_n≥ N  is a chain of hyperplanes, in view of Lemma <ref>. \n    \n    \n    \n    Let  be a UBS. A hyperplane ĥ∈ is called dominant for  if ĥ = ĥ_0 is the base of a chain of hyperplanes { h_n }⊂ such that ĥ \n    crosses all but finitely many hyperplanes in ∖{ h_n }. \n    \n    \n    \n     Recall that by definition of a chain of hyperplanes, {h_n } is a minimal UBS. See Figure <ref> for an example. \n    By Lemma <ref>, the inseparable closure { h_n }  is commensurate to some minimal UBS _i in the decomposition ∼_i=1^k _i of that lemma. Furthermore, _i \n    is unique: since a dominant hyperplane ĥ∈ is the base of a chain in _i, then ĥ must intersect all but finitely many hyperplanes of _j (for j ≠ i), hence ĥ \n    cannot be disjoint from a chain in _j.\n    \n    \n    We also observe that if  is minimal and pruned, then every hyperplane of  is vacuously dominant.\n    \n    \n    \n    \n    \n    The following lemma is only stated in the special case where (X) is already a UBS. In practice, we will apply Lemma <ref> to convex subcomplexes (such as the convex hull of a geodesic ray) where this hypothesis holds.\n    \n    \n     Suppose that = (X)\n      is a pruned UBS of dimension k.  Then  contains minimal UBSes 𝒟_d ,…, 𝒟_k such that the following hold: \n     \n      * Each 𝒟_i is a set of dominant hyperplanes for , and all but finitely many dominant hyperplanes belong to ⋃_i = d^k 𝒟_i.\n      \n      * For each i∈{d, …, k} and each ĥ_0 ∈𝒟_i, there is a chain {ĥ_n \n    }_n≥0⊂𝒟_i such that 𝒟_i is commensurate with {ĥ_n },  the \n    inseparable closure of the chain.\n    \n      *  For any such chain {ĥ_n }, there is N > 0, such that for all n ≥ N, we have \n    \n        (ĥ_n+1)∖𝒟_i⊂(ĥ_n)∖𝒟_i.\n     Furthermore, for all n \n    ≥ 0, we have \n    \n        |(ĥ_n)-(ĥ_n+1)|<∞.\n    \n      *  For every hyperplane û∈, there exists ∈∈{d,…,k} and a dominant hyperplane ĥ∈𝒟_i such that ĥ lies in the canonical \n    half-space \n    associated to û. \n     \n    \n    We will not use item (<ref>) later in the paper, but we record it as a potentially useful fact about UBSes.\n    \n    \n    By Lemma <ref>, there is a decomposition ∼_i=1^k_i, with an ordering such that for j < i, every hyperplane in _i crosses all but finitely many of the hyperplanes in _j. The ordering is only partially determined: if every hyperplane in _i crosses all but finitely many hyperplanes in _i+1, then we can \n    reverse the order of _i,_i+1 while keeping the conclusion of Lemma <ref>.<ref>.  Let d be the smallest index i such that _i can be placed at the top of the order in such a decomposition.\n    \n    \n    Now, fix an index i ≥ d. \n    By Lemma <ref>, _i is commensurate with 𝒟_i = {ĥ_n}, where \n    {ĥ_n}⊂_i is a chain. Thus 𝒟_i ∼_i is a minimal UBS.\n    \n    We claim that every ĥ∈𝒟_i is dominant. \n     Given ĥ∈𝒟_i and the canonical associated half-space h (recall Definition <ref>), there exists N≥ 0 such that ĥ_N ⊂ h. \n     Thus ĥ is the base of the infinite chain {ĥ,ĥ_N,ĥ_N+1,⋯}. Furthermore, ĥ∈𝒟_i ⊂_i intersects all but finitely many hyperplanes in _j \n    for j ≠ i, because we have chosen an index i ≥ d. Thus ĥ is dominant by Definition <ref>.\n     Thus we have found dominant minimal UBSes 𝒟_d,…,𝒟_k satisfying conclusions <ref> and \n    <ref>.\n    \n    Now we verify assertion <ref>. Fix i ≥ d and let ĥ,ĥ'∈𝒟_i.  Since the \n    minimal UBS 𝒟_i is the inseparable closure of a chain, ĥ,ĥ' both cross finitely many hyperplanes in 𝒟_i.  Indeed, if 𝒲(ĥ)∩𝒟_i is infinite, it must contain a chain of hyperplanes whose inseparable closure 𝒟' belongs to 𝒟_i, and is contained in \n    𝒲(ĥ) since the latter is inseparable.  Since 𝒟_i is minimal, 𝒟'∼𝒟_i.  Hence 𝒲(ĥ) contains all but finitely many elements of 𝒟_i;  since ĥ∈𝒟_i, this contradicts that 𝒟_i is the inseparable closure of a chain.  Thus 𝒲(ĥ)∩𝒟_i is finite.  Moreover, since 𝒟_i \n    is dominant, ĥ,ĥ' both cross all but finitely many hyperplanes of ∖𝒟_i, and we can therefore conclude that \n    \n        |(ĥ)(ĥ')|<∞.\n    \n    \n    So,  it suffices to show that, for all sufficiently large n,  we have (ĥ_n+1)∖𝒟_i⊂(ĥ_n)∖𝒟_i.\n    \n    If this doesn't hold, then  for infinitely many n we can find a hyperplane û_n∉𝒟_i that crosses \n    ĥ_n+1 but not \n    ĥ_n; note that û_n does not separate any two elements of our chain since û_n∉𝒟_i.  Since there are no facing \n    triples, û_n \n    crosses ĥ_m for \n    m≥ n+1. \n       Since the collection of violating \n    hyperplanes {û_n} is infinite and contains no hyperplanes crossing ĥ_0, dominance of ĥ_0 is \n    therefore \n    contradicted.  Thus there exists N such that (ĥ_n+1)∖𝒟_i⊂(ĥ_n)∖𝒟_i for n≥ N, establishing <ref>.\n    \n    We now prove assertion <ref>.  Let û∈ be a hyperplane, and let u be the  canonical \n    half-space associated to û. Given the fixed decomposition ∼_i=1^k_i, let i be the \n    largest index such that\n    u contains a chain of hyperplanes in , whose inseparable closure _i' is commensurate to some _i. Such an i exists because  is pruned. We claim that i ≥ d. This claim implies \n    that u contains infinitely many hyperplanes of 𝒟_i, which will suffice to prove the lemma.\n    \n    Suppose for a contradiction that i < d. Fix v̂∈_i', and consider a minimal UBS _j for j > i. If any hyperplane in _j fails to cross v̂, then it fails to cross û, \n    hence u contains a chain in _j, contradicting the maximality of i. See Figure <ref>.\n    \n    \n    \n    \n    Furthermore, since v̂∈_i, it must cross all but finitely many hyperplanes of _ℓ for ℓ < i by \n    Lemma <ref>.<ref>. Thus v̂ crosses all but finitely many hyperplanes of ∖_i', hence v̂ is dominant. Since v̂∈_i' was \n    arbitrary, this shows that i ≥ d by the definition of d.\n    \n    \n     §.§ Connections between X and X\n    \n    The next several lemmas develop tools for comparing the Roller boundary and the simplicial boundary. \n    \n    \n    \n    \n    Let ⊂(X) be a  UBS, and let ' ∼ be a pruned UBS commensurate to . For every ĥ∈', let \n    h ∈(X̃) be the canonical orientation of ĥ,  that is,  the (extended, vertex) half-space  containing \n    infinitely many hyperplanes \n    of '. \n    \n    The umbraỸ_ associated to  is \n    \n        Ỹ_ = ⋂_ĥ∈' h ⊂X̃.\n    \n    By Definition <ref>, the umbra Ỹ_ is a convex subset of X, one may think of it as the Roller realization of the UBS . In Lemma <ref>, we will show that  Ỹ_ satisfies the equivalent conditions of Lemma <ref>. Then, Y_ will denote the principal class of Ỹ_: that is, the unique Roller class whose closure is Ỹ_.\n    \n    Let ⊂(X) be a UBS. Then the umbra Ỹ_ associated to  is a nonempty subset of X.\n    Furthermore, \n     \n      *  If ∼ then Ỹ_ = Ỹ_. \n    \n      *  If ∼_1∪⋯∪_N for some UBSes _1, …,_N then \n        Ỹ_ = ⋂_i=1^NỸ__i.\n    \n    Let ' be the pruned UBS commensurate to . As in Definition <ref>, let h be the canonical orientation of every ĥ∈', and define  𝔘' = {h : ĥ∈' }⊂. Then\n     Ỹ_:= ⋂_h∈𝔘'h. \n      \n     Since X̃ is compact, to show that Ỹ_ is not empty, it is sufficient to show that 𝔘' has the  finite \n    intersection property. By the Helly property for half-spaces <cit.> this is equivalent \n    to showing that every pair of half-spaces h,k ∈𝔘' has nonempty intersection. But a disjoint pair \n    h, k∈𝔘'  contradicts the unidirectionality of ', as both sides of ĥ would contain infinitely many elements  of '. \n    \n    Using the same argument, we observe that for every h∈𝔘' there is an infinite descending chain { h_n } with h_0 = h and h_n∈𝔘'. Indeed, fix h∈𝔘'. Since ' is pruned, there are infinitely many hyperplanes in ' contained in h. Since ' is unidirectional, k̂⊂ h and k̂∈' implies k ⊂ h. Applying induction, we find the infinite descending chain. Thus Ỹ_⊂ X.\n    \n    We now turn to the commensurability class of . Suppose that  is a UBS commensurate to . Since commensurability is an equivalence relation, we conclude that ' and ' are commensurate as well. Let 𝔙' = {h : ĥ∈' }⊂ be the set of canonical half-spaces associated to '.\n    \n    \n    We claim that 𝔘' and 𝔙' are also commensurate. Since the map taking half-spaces to hyperplanes is 2-to-1, it suffices to show that under this map, the set 𝔘'∖𝔙'  has image in the finite set '∖', and vice versa. Let h∈𝔘'∖𝔙'. Then ĥ∈'. By definition of 𝔘', we know that the set {k̂∈: k̂⊂ h} is infinite. The commensurability of  and  implies that {k̂∈: k̂⊂ h} is infinite as well. But h∉', hence it must be the case that ĥ∉'. \n    \n    \n    To see that Ỹ_= Ỹ_ it is sufficient to  show that if h∈𝔘'  then there is k∈'∩𝔘' with k⊂ h. But this is immediate. As was proved above, for any h∈𝔘' there is an infinite descending chain { h_n }⊂𝔘' with h_0 = h. Since 𝔘' and 𝔙' are commensurate, for N sufficiently large, we must have that h_N∈𝔙'.\n    \n    \n    \n    \n    Finally, the construction above makes it clear that  if  is commesurate to _1∪⋯∪_N for some  UBSes \n    _1, …,_N then Ỹ_ = ⋂_i=1^NỸ__i. \n    \n    For every UBS , there is a Roller class Z ⊂ X such that Ỹ_ = Z̃. Furthermore, the assignment ↦ Z = Y_ is (X)–equivariant.\n    \n    By Lemmas <ref> and <ref>,  is commensurate to a UBS =_i=1^k_i, where _i = {ĥ_n^i} for a descending chain of half-spaces { h_n^i }. Note that every _i is pruned. Thus\n    \n        Ỹ_ =  ⋂_1≤ i ≤ kỸ__i = ⋂_1≤ i ≤ k  ⋂_ĥ∈_i h = ⋂_1≤ i ≤ k  ⋂_n ∈ h_n^i.\n    \n    Here, the first equality holds by Lemma <ref>, the second equality holds by Definition <ref>, and the third equality holds because the hyperplanes added in the inseparable closure do not affect the intersection. By Lemma <ref>, a set of this form is the closure of a unique (principal) Roller class Y_. \n    \n    We observe that the above construction is independent of the choice of  descending chains with the desired properties, and hence the map ↦ Y_ is (X)–equivariant.\n    \n    Let x∈ X^(0) and let Y ⊂ X be a convex set. Then the set of separating hyperplanes (x,Y)= (x,_Y(x)) is a pruned UBS.  \n    If x'∈ X^(0), then \n    (x',Y) ∼(x,Y). Finally, (x,[y])∼(x,y) for every y∈ X. \n    \n    We begin by showing that  :=(x,Y) is a UBS.  Recall that (x,Y) is the set of hyperplanes associated to _x^+ _Y^+. Since x ∈ X^(0), it follows that _x^+ satisfies the descending chain condition and since Y⊂ X, it follows that _Y^+=_Ỹ^+ \n    has an infinite descending chain. Hence,  is unidirectional and infinite. Since =(x,Y) is an interval, it follows that it is inseparable and does not contain a facing triple, hence  is a UBS. The fact that (x,Y)= (x,_Y(x)) follows from Proposition <ref> and shows that  is pruned.  \n    \n    Let x,x' ∈ X^(0). We claim that (x,Y) (x',Y) ⊂(x,x').  By symmetry, it suffices to observe that  a hyperplane ĥ separating x from Y but not x' from Y necessarily separates x from x'. Since the cardinality of (x,x')  is the distance d(x,x')<∞, we conclude that the two UBSes are commensurate. \n     \n    Finally, fix y∈∂ X. We show that (x,[y])∼(x,y). Proposition <ref> says that (x,[y]) = (x,_[y](x)), which implies that (x,[y]) ∪(_[y](x), y)= (x,y). But _[y](x) ∈ [y] by definition, hence  | (_[y](x),y) | < ∞, completing the proof. \n    \n    Let  Y ∈ X be a Roller class, and fix a basepoint x ∈ X^(0). Following Lemma <ref>, we call (x,Y) a UBS representing the class Y, and denote it _Y. Since the commensurability class [_Y] is independent of x, by Lemma <ref>, we do not include the basepoint x in the notation _Y.\n    \n    It follows immediately that the assignment Y ↦ [ _Y ] is (X)–equivariant.\n    \n    \n    \n    With this notation in place, we  conclude:\n    \n    \n    Fix x∈ X^(0) and Y∈ X. Then  Y = Y__Y. In particular,  every Roller class arises as the principal class of the umbra of some UBS.\n    \n    Since _Y = (x,Y) is a UBS, by Lemma <ref> it is commensurate to _i=1^k  {ĥ_n^i} for descending chains { h_n^i }, hence Equation (<ref>) gives\n    \n        Ỹ__Y =  ⋂_1≤ i ≤ k  ⋂_n ∈ h_n^i.\n    \n     By construction, Ỹ⊂ h_n^i for every ĥ_n^i ∈_i, hence Ỹ⊂Ỹ__Y.\n    \n    As in Lemma <ref>, let  Y__Y  denote  the principal Roller class of Ỹ__Y. \n     We claim that Y = Y__Y. So far, we have shown that Y__Y≤ Y in the partial order of Lemma <ref> and so we are left to show that Y≤ Y__Y. To this end, we fix a half-space h∈ with Y ⊂ h and now show that  Y__Y⊂ h. \n    \n    Let x'∈ h^* ∩ X^(0) and set '_Y = (x',Y). Observe that ĥ∈'_Y by construction. Then by Lemma <ref> we have that '_Y is a pruned UBS commensurate to _Y and so Lemma <ref> implies Ỹ__Y=Ỹ_'_Y. Finally, by Definition <ref> we have that Y__Y⊂Ỹ__Y⊂ h. \n    \n    Let γ⊂ X be a geodesic ray, in either the CAT(0) or combinatorial metric. Let  (γ) be the collection of hyperplanes intersecting γ, which is a UBS by  <cit.>.\n     If  is a UBS and ∼𝒲(γ) for some combinatorial geodesic ray γ, we say that the class of  is ℓ^1–visible. \n    Let Y ∈ X. Then, for any x ∈ X^(0) and any y ∈ Y, Lemma <ref> provides a combinatorial geodesic ray γ such that γ(0)=x and γ(∞) =  y ∈ Y. By Definition <ref> and Lemma <ref>, we have \n    \n        (γ) = (x, y) ∼(x, [y]) = (x, [̃ỹ]̃).\n    \n    \n    Furthermore, by Lemma <ref>, the commensurability class [(γ)]= [_Y] does not depend on the choice of x ∈ X^(0) and  y ∈ Y.  In particular, every UBS representing a class Y is ℓ^1–visible.\n    \n    Let  be a UBS.  Let y∈Ỹ_ and let γ be a combinatorial geodesic in X such that \n    γ(∞) = y. \n     Then ≼(γ).  In particular, if  is maximal, then ∼(γ).\n    \n    As in Lemma <ref>,  is commensurate to _i=1^k _i, where the _i are minimal and _i = {ĥ_n^i} for a descending chain of half-spaces { h_n^i }. Thus \n    Equation (<ref>) gives\n    \n        Ỹ_ =  ⋂_1≤ i ≤ kỸ__i = ⋂_1≤ i ≤ k  ⋂_ĥ∈_i h = ⋂_1≤ i ≤ k  ⋂_n ∈ h_n^i.\n    \n    Since γ(m) → y ∈Ỹ_, we must have y ∈ h_n^i for every i and every n. At the same time, since the sequence { h_n^i } is a descending chain for each i, we have that x = γ(0)\n    ∉ h_n^i for sufficiently large n. Thus all but finitely many hyperplanes ĥ_n^i belong to (x,y)=(γ). The inseparable closure of this cofinite subset of {ĥ_n^i} must belong \n    to (γ), and by minimality of _i and Corollary <ref>, it follows that all but finitely many elements of each _i belong to W(γ).\n    \n    Let  be a maximal UBS. Then, for every y ∈  Y_, there is a combinatorial geodesic γ limiting to y, such that ∼(γ). In particular, the commensurability class [] is ℓ^1–visible.\n    \n    Let y ∈ Y_. By Lemma <ref>, there is a combinatorial geodesic ray γ limiting to y.  By  \n    Lemma <ref>, we have ∼(γ). Thus, by Definition <ref>,  is ℓ^1–visible.\n    \n    \n    In Corollary <ref>, the conclusion that [] is visible was previously shown by Hagen <cit.>. The above proof, using the Roller \n    boundary viewpoint, is considerably simpler.\n    \n    \n    \n    \n     §.§ Order-preserving maps\n    \n    Recall from Definitions <ref> and <ref> that the partial order ≤ on Roller classes is set containment of the associated sets of half-spaces, while the partial order ≼ on commensurability classes of UBSes  is set containment up to commensurability. \n    The following theorem says that these partial orders are closely related.\n    \n    \n    \n    Let 𝒰ℬ𝒮(X) be the collection of commensurability classes of UBSes in X. Then there are (X)–equivariant functions \n    𝒰ℬ𝒮(X) → X and X →𝒰ℬ𝒮(X), with the following properties.\n    \n      *  The assignment [] ↦ Y_ is order-preserving and onto.\n    \n      *  The assignment Y ↦ [_Y] is an order-preserving section of .\n    \n      *  restricts to a bijection between the set of  ≼–maximal classes of UBSes and the set of ≤–maximal Roller classes, with inverse .\n    \n    \n    The notation  stands for “Roller to unidirectional,” while  stands for “unidirectional to Roller.” This is inspired from the classical notation denoting the collection of maps from a set A to a set B as B^A.\n    \n    \n    To prove <ref>, let  be a UBS. By Lemma <ref>, there is a well-defined Roller class Y_ such that the\n     umbra Ỹ_ is the Roller closure of Y_. By \n    Lemma <ref>, Y_ only depends on the commensurability class []. Hence the assignment [] ↦ Y_ gives a well-defined function  \n    𝒰ℬ𝒮(X) → X. This function  is (X)–equivariant by Lemma <ref>, and onto by Corollary <ref>. \n    \n    Next, we check that  respects the ordering. Lemma <ref> implies that if\n     ≼𝒱, then\n    Y_𝒱⊂Y_, hence the\n    Roller classes satisfy\n    Y_≤ Y_𝒱 by Lemma <ref>. Thus  is order-preserving, proving <ref>.\n    \n    \n    \n    To prove <ref>, let Y ∈ X. By Definition <ref>, there is a well-defined commensurability class of UBS representing Y, namely [_Y] = (Y) ∈𝒰ℬ𝒮(X). Thus  is well-defined. Equivariance also follows from Definition <ref>. Next, observe that\n    \n        ∘(Y) = ([_Y]) = Y__Y = Y,\n    \n     where the last equality follows from Corollary <ref>. Thus  is a section of .\n    \n    To check that  is order-preserving, let Y, Z be Roller classes with Y ≤ Z. By  Lemma <ref>, this means Z⊂Y.  Fix a base vertex x∈ X^(0).  By Lemma <ref>, there exist \n    combinatorial geodesic rays γ_y, γ_z, originating at x, such that γ_y(∞) =  y∈ Y and γ_z(∞) =  \n    z ∈ Z.  Now, Remark <ref> says that \n    \n        _Y∼(x,Y) ⊂(x,Z) ∼_Z,\n    \n    hence [_Y] ≼ [_Z], as desired.\n    \n    \n    \n    To prove <ref>, let  be a maximal UBS. Choose a point y ∈ Y_ = ([]). By Corollary <ref>, there is a combinatorial geodesic ray γ limiting to y, such that ∼(γ). Thus, by Remark <ref>, we have\n    \n        [] = [(γ)] = [_Y_] = (Y_) = ∘([]).\n    \n    Thus the restriction of  to maximal classes in 𝒰ℬ𝒮(X) is invertible, and in particular bijective.\n    \n    Equation (<ref>) also shows that  sends maximal classes in 𝒰ℬ𝒮(X)  to maximal classes in X. Indeed, suppose that [] is maximal but ([]) = Y_ < Z for some Roller class Z. Then we would have [] = (Y_) < (Z), contradicting the maximality of . That  sends maximal classes to maximal classes is checked in the same way.\n    \n    \n    The following example shows that  can fail to be injective.\n    \n    \n     Consider the standard 1/8th-plane staircase, corresponding to squares whose  vertices (x,y) satisfy x≥ y≥ 0. In \n    this case, there are exactly 2 equivalence classes of minimal UBS, corresponding to vertical hyperplanes _V and horizontal \n    hyperplanes _H. These are almost transverse, hence _H_V  ∪_H. However, [_H] = ([_V  ∪_H]). Thus  is not injective.\n    \n    \n    \n    On the other hand, the following corollary shows that  is finite-to-one.\n    \n    \n    Let Y ∈ X be a Roller class. Then there are finitely many other Roller classes Z such that Z ≤ Y.\n    \n    For each Z ≤ Y, Theorem <ref>.<ref> says that (Z) ≼(Y). Furthermore,  is injective.\n    By Lemma <ref>, there are only finitely many commensurability classes  [] ≼(Y). Thus there are finitely many Z ≤ Y. \n    Let ( X)' be the barycentric subdivision of X. Recall from Definition <ref> that\n    X is the union of simplices corresponding to commensurability classes\n    of UBSes. However, a simplex of X may have proper faces that do not come from commensurability\n    classes, as illustrated in Example <ref> below.  Hence, a vertex of ( X)' might fail to be \n    associated to a UBS commensurability class. \n    \n    Let X be the simplicial realization of the partial order ≼ on 𝒰ℬ𝒮(X). Then X naturally embeds into ( X)'. By the above paragraph, this embedding is not \n    in general onto.\n    \n    \n    The following example, constructed by Dan Guralnik and Alessandra Iozzi, illustrates a subtlety in the definition of X which shows the difference between X and X.\n    \n    \n    [Weird faces of simplices of X]\n    Let X be the 3–dimensional \n    CAT(0) cube complex given by the following data:\n    \n      *  The set of hyperplanes has the form (X) = {B_i}_i ≥0⊔{S_j}_j≥0⊔{D_k}_k ≥0.  \n      *  For each \n    A∈{B,S,D} and each n≥1, the hyperplanes A_n±1 are separated by A_n.\n    \n      * B_i crosses S_j if and only if i ≥ j.\n    \n      * S_j crosses D_k if and only if j ≥ k.\n    \n      * B_i crosses D_k if and only if i ≥ k.\n    \n      *  If i < j < k, then S_j separates B_i from D_k.\n    \n    Part of X is shown in Figure <ref>.  \n    \n    \n    Then X is a single 2–simplex represented by the UBS \n    {B_i}_i ≥0∪{S_j}_j≥0∪{D_k}_k ≥0.  The 0–simplices are represented by the minimal UBSes \n    {B_i}, {S_j}, {D_k}.  The sets {B_i}∪{S_j} and {S_j}∪{D_k} are UBSes representing 1–simplices, \n    but {B_i}∪{D_k} is not a UBS, because it is not inseparable (consider the last bullet).  The complex X is therefore obtained from \n    the barycentric subdivision of the 2–simplex by deleting all of the cells that contain a vertex at the barycenter of {B_i}∪{D_k}.\n    \n    \n    \n     We remark that by <cit.>, a face of a simplex of X can only fail to correspond to a commensurability class of UBSes when one of the 0–simplices of that face is\n     ℓ^1–invisible.\n    \n    \n    Having passed from X to X, Theorem <ref> has the following corollary.\n    \n    \n    The order-preserving maps  and  of Theorem <ref> induce (X)–equivariant simplicial maps X→ X and X →  X, as follows:\n    \n      * X→ X is  surjective.\n    \n      * X →  X  is an injective section of .  \n    \n      *  is a homotopy \n    equivalence with homotopy inverse  .\n    \n     By definition, X is the simplicial realization of the partial order ≤ on X.  Similarly, X is the simplicial realization of the partial order \n    ≼ on 𝒰ℬ𝒮(X).  So, the first two enumerated assertions follow from \n    Theorem <ref>.  \n    \n    To prove <ref>, let Y be a Roller class.  Let [𝒱]∈ ()^-1(Y).  Then Y_𝒱=Y__Y.  By \n    Remark <ref> and Lemma <ref>, we have 𝒱≼_Y.\n    \n    Using the notation Y for the 0–simplex of X corresponding to the Roller class Y, we have just shown that ^-1(Y) is a subcomplex of X spanned by \n    0–simplices adjacent or equal to the 0–simplex [_Y], so ^-1(Y) is topologically a \n    cone.  In particular, ^-1(Y) is contractible.  Quillen's fiber theorem (see e.g. <cit.>) implies that  is a homotopy equivalence, such that any section is a homotopy inverse. In particular,  is a homotopy inverse of .\n    \n    The preceding corollary provides an explicit (X)–equivariant homotopy equivalence X→ X.  Furthermore, it is possible, although somewhat tedious, to construct an explicit, \n    (X)–equivariant homotopy equivalence X→  X.  Composing these maps gives\n    a homotopy equivalence X → X, which is (X)–equivariant on the nose.\n    This is slightly stronger than Proposition <ref>, which asserts that X and \n    X are  homotopy equivalent.  We have chosen a different proof of Proposition <ref> that is somewhat shorter, relying on the nerve theorem, and only yielding \n    (X)–equivariance up to homotopy.  Our ultimate goal is to relate the homotopy type of X and X to that of the Tits boundary X, and in any case our homotopy equivalence X→ X, provided by Theorem <ref>, is only equivariant up to homotopy. \n    \n    \n    § THE TITS BOUNDARY\n    \n    \n    In this section, we recall the definition of the Tits boundary X, and establish some \n    connections between points on the Tits boundary and UBSes. The main result of this section, Proposition <ref>, is a technical result about combining UBSes that will be crucial in the next section.\n    \n    In this section, we will work extensively with the CAT(0) metric d_X on the cube complex X, hence most half-spaces considered here are CAT(0) half-spaces.  Recall from Section <ref> that if ĥ is a hyperplane with open carrier N(ĥ),\n    the two vertex half-spaces associated to  ĥ are denoted h, h^*. The two CAT(0) half-spaces associated to ĥ are the cubical convex hulls (h) and (h^*), respectively. \n    Observe that \n     (h) and (h^*) are exactly the components of X ∖ N(ĥ). \n    \n    \n    \n    The Tits boundary of X, denoted X, is the set of equivalence classes of CAT(0) geodesic rays  in \n    X, where rays γ,γ' are equivalent if the Hausdorff distance between them is finite.  As a set, X coincides with the visual boundary of X.\n    \n    We endow X with a metric, as follows.\n    Given CAT(0) geodesic rays α,β [0,∞)→ X with α(0)=β(0)=x, the Alexandrov angle formed by α,β at x is \n    \n        ∠_x(α,β)=cos^-1(lim_t,t'→0_X(α(t), β(t'))^2-t^2-(t')^2/2tt')\n    \n    In other words, ∠_x(α,β) is computed by applying the law of cosines to a triangle with sides along α and β, and then taking a limit as the triangle shrinks.\n    Let a = [α] ∈ X and b = [β] ∈ X be the the equivalence classes of α,β respectively.  Following  <cit.>, we define\n    \n        ∠_T(a,b) = ∠_T([α],[β])\n        :=sup_x∈ X∠_x(α_x,β_x),\n    \n     where α_x,β_x are the rays emanating from x and representing \n    a,b respectively.  Then ∠_T induces a length metric d_T on X in the standard way, making it a CAT(1) \n    space. See <cit.>. We always equip X with the metric _T. By <cit.>, the automorphism group \n    (X) acts on X by isometries.\n    \n    \n    We remark that the original definition of the Alexandrov angle <cit.> is somewhat more involved. In our setting, since X is a CAT(0) space, <cit.> says the limit in (<ref>)  exists and is equal to the Alexandrov angle in the original definition. Compare <cit.>.\n    \n    Definition <ref> has the following generalization to the cuboid setting.\n    \n    \n    \n    Fix a group G acting on X by cubical automorphisms, as well as a G–admissible hyperplane rescaling ρ, as in Definition <ref>.\n    Then the cuboid metric d_X^ρ is still a CAT(0) metric by Lemma <ref>. Applying Definition <ref> to the CAT(0) space (X, d_X^ρ), we obtain the cuboid Tits boundary^ρ X = (X, d_X^ρ), with an associated CAT(1) metric d_T^ρ. \n    The restricted automorphism group (X^ρ) acts on ^ρ X by isometries. Since ρ is a G–admissible rescaling, we have G ⊂(X^ρ) by Definition <ref>, hence ^ρ X still admits a G–action.\n    \n    \n    All of the results of this section extend to a cuboid metric d_X^ρ. See Remarks <ref>, <ref>, and <ref> for details.\n    \n    Throughout this section, we use Greek letters α, β, γ to denote geodesic rays, and the corresponding Roman letters a,b,c to denote equivalence classes. We write a = [α] = α(∞) to denote the endpoint of α in X.\n    \n    \n    \n    \n    \n     §.§ Deep sets\n    \n    Every point of the Tits boundary has an associated deep set of half-spaces.\n    \n    \n    Let a∈ X, and\n    let α [0,∞)→ X be a CAT(0) geodesic representing a. We define the deep set\n        D_a = {h∈ :  for all  R>0  there is  t_R>0  s.t. 𝒩_R( α[t_R,∞)) ⊂(h) }.\n    \n    It is immediate to check that the definition does not depend on the representative geodesic α. If h ∈ D_a, we say that h is deep for a.\n    \n    Let α [0,∞)→ X be a CAT(0) geodesic ray with α(0) ∈ X^(0), and let ĥ∈(α). Then the following hold:\n    \n      *  Define f(t) = d_X(α(t), ĥ), and let t_0 = α^-1(ĥ). Then, for \n    t_0 ≤ s ≤ t, we have\n    \n        f(t)-f(s) ≥ A_0 · (t-s),\n    \n    where A_0 > 0,  and A_0 may depend on ĥ and α but not on s,t.\n    \n      *  The hyperplane ĥ has a deep half-space h ∈ D_a.\n    \n    Consequently, (α) is a pruned UBS. \n    \n    By <cit.>, f is a convex, 1–Lipschitz function.   \n    By convexity, f has left and right derivatives at every point in (0,∞), and these are non-decreasing.  Since f is Lipschitz and convex,  the left and right \n    derivatives coincide almost everywhere, hence f' is well-defined almost everywhere, and\n    non-decreasing at all points where it is defined.\n    \n    Let t_0 = α^-1(ĥ). Since the carrier N(ĥ) ≅ĥ× (-1/2, 1/2) is an ℓ^2 product and α(t_0) ∈ĥ lies on the midcube of a cube, there \n    is an initial segment of α after crossing ĥ on which f(t) is an increasing linear function. Therefore, f'(t) = f'(t_0) = A_0 > 0 on this segment. (In fact, f'(t_0) = sinθ_0, \n    where θ_0 is the angle between α and ĥ in the ℓ^2 metric on a cube.) Hence f'(t) ≥ A_0 for all t≥ t_0 at which f'(t) is defined. Since f is Lipschitz, it \n    follows that for all t_0≤ s≤ t, we have \n    \n        f(t)-f(s)=∫^t_sf'(z)  dz ≥ A_0·(t-s),\n    \n    proving <ref>. \n    \n    Now, <ref> immediately implies <ref>.\n    The conclusion that (α) is pruned is then immediate from Definition <ref>.\n    \n    \n    The following lemma is a strengthening of <cit.>. While <cit.> proves that D_a contains an infinite descending chain, we prove the stronger statement that D_a is non-terminating.\n    \n    \n    For a point a ∈ X, define Ỹ_a = ⋂_h∈ D_a h. Then D_a and Ỹ_a have the following properties:\n    \n      * D_a is consistent, and therefore D_a = ^+_Ỹ_a. \n    \n      *  Every half-space h_0 ∈ D_a belongs to a descending chain {h_0, h_1, …}⊂ D_a. Furthermore, if ĥ_0 ∈(α) for a ray α∈ a, then ĥ_n ∈(α) for all n.\n    \n      * Ỹ_a⊂ X is the closure of a (unique, principal) Roller class Y_a.\n    \n    The consistency of D_a is immediate from the definition. Thus, by Proposition <ref>.<ref>, we obtain D_a = ^+_Ỹ_a. This proves <ref>.\n    \n    To prove <ref>, let h_0 ∈ D_a.  By <cit.>,  there exists a geodesic \n    ray α representing a such that α(0) ∈ h_0^*. Since h_0 ∈ D_a, Definition <ref> implies that \n    α must deviate arbitrarily far from ĥ_0.\n    Thus, by Lemma <ref>, a point α(t) for large t has the property that |(α(t), y)| ≥ 1 for \n    every y ∈ N(ĥ_0). Now,  Proposition <ref> says that there is at least one hyperplane ĥ_1 separating \n    α(t) from N(ĥ_0). Observe that ĥ_1 ∈(α) by construction, and orient ĥ_1 by choosing the \n    half-space h_1 ⊂ h_0. Now, Lemma <ref> says that h_1 ∈ D_a. Continuing inductively, we obtain \n    a descending chain {h_0, h_1, …}⊂ D_a where ĥ_n ∈(α) for all n, proving \n    <ref>.\n    \n    \n    By <ref>,  D_a = ^+_Ỹ_a is consistent, and by  <ref>, D_a contains an infinite descending chain. Thus Ỹ_a  = ⋂_h∈ D_a h is a convex, nonempty subset of X.  Since D_a is non-terminating by  <ref>, Lemma <ref> implies\n     that Ỹ_D_a is the closure of a principal Roller class Y_a ∈ X. (Compare Definition <ref>.) This proves <ref>.\n     \n    The previous lemmas generalize readily to a cuboid metric d_X^ρ. Indeed, Lemma <ref> generalizes because because hyperplane carriers are still ℓ^2 products, and because <cit.> works in any CAT(0) space.\n    Similarly, Lemma <ref> generalizes because <cit.> works in every CAT(0) space and, because d_X^ρ is quasi-isometric to the ℓ^1–metric on X^(0). \n    \n    \n     §.§ CAT(0) rays and their UBSes\n    \n    Given a CAT(0) geodesic ray γ in X, starting at a point of X^(0), recall that  (γ) denotes the set of \n    hyperplanes h that intersect γ.  It is easy to see (cf. <cit.>) that \n    (γ) is a UBS.\n    \n    \n    \n    \n    Throughout this subsection, fix a,b∈ X and let α, β be CAT(0) geodesic rays representing a and b, respectively. We can assume that  α(0)=β(0) = x ∈ X^(0).\n    \n    The following lemma says that when (α)∪(β) has finite symmetric difference with a UBS, it actually is a UBS. \n    Several subsequent lemmas build toward Proposition <ref>, which will show that (α)∪(β) is in fact a UBS associated to a ray γ.\n    \n    \n    Suppose that (α)∪(β) is commensurate with a UBS. \n    Define 𝒜=(α) ∖(β) and ℬ=(β) ∖(α) and  𝒞=(α)∩(β).\n    Then\n    \n      *  Each of 𝒜,ℬ is infinite or empty.\n     \n      *  Every element of 𝒜 crosses every element of ℬ.\n      \n      * (α) ∪(β) = 𝒜⊔ℬ⊔𝒞 is a UBS.\n    \n    \n    Let = (α) ∪(β). Since  is commensurate with a UBS by hypothesis, it must be infinite and unidirectional. We \n    will check the other properties of a UBS at the end of the proof.\n    \n    \n    By Lemma <ref>, every hyperplane ĥ = ĥ_0 ∈(α) corresponds to a deep half-space h_0 ∈ D_a, and  by Lemma <ref>, h_0 is the start of a descending chain {h_0, h_1, …}⊂ D_a, where h_n ∈(α) for every n. Similarly, every hyperplane k_0 ∈(β) defines a descending chain {k_0, k_1, …}⊂ D_b, where k_m ∈(β) for every m.\n    \n     If 𝒜 = (α) ∖(β) ≠∅, then any hyperplane ĥ_0 ∈𝒜 defines a chain  {ĥ_0, ĥ_1, …}⊂(α), as above. Furthermore, ĥ_0 separates every ĥ_n from β. Thus ĥ_n ∈𝒜, and 𝒜 is infinite. Similarly, ℬ must be empty or infinite, proving  <ref>.\n    \n    Next, suppose for a contradiction that ĥ_0 ∈𝒜 is disjoint from k̂_0 ∈ℬ. Then the deep half-spaces h_0 ∈ D_a and k_0 ∈ D_b are also disjoint. But then the disjoint chains {ĥ_n}⊂(α) and {k̂_m }⊂(β) contradict the fact that = (α) ∪(β) is unidirectional. This proves  <ref>.\n    \n    \n    Finally, we show that  is a UBS. We have already checked that  is infinite and unidirectional.\n    To check inseparability, suppose that ℓ̂ is a hyperplane of X that separates ĥ, k̂∈. Since we already know that (α) and (β) are inseparable, it suffices to check the case that ĥ∈𝒜 and k̂∈ℬ. But then ĥ and k̂ must cross by <ref>, a contradiction. Similarly, since (α) and (β) contain no facing triples, any potential facing triple in  must contain at least one hyperplane  ĥ∈𝒜 and at least one hyperplane  k̂∈ℬ. But then ĥ and k̂ must cross, hence  cannot contain any facing triples. Thus  is a UBS, proving <ref>.\n    \n    \n    Recall from Definition <ref> that given a UBS , we have the umbra Ỹ_⊂X̃.\n    Following Proposition <ref>, let _Y_ = _Ỹ_X̃→ Y_ be the gate projection to Ỹ_.\n    \n    \n    Suppose α and β are geodesic rays starting at x∈ X^(0), and that = (α)∪(β) is commensurate with a UBS. Then = (x, _Y_(x)). \n    \n    Since the geodesic rays start at the vertex x, Lemma <ref> says that  all the hyperplanes they cross are deep, i.e.  (x,Y_a) =(α) and (x,Y_b)= (β), hence = (x,Y_a)∪(x,Y_b). In addition, Lemma <ref> says that  is a UBS.\n    \n    \n    Now, Lemma <ref> gives  Ỹ_= Ỹ_a  ∩Ỹ_b, and in particular _Ỹ_^+ = D_a∪ D_b. By Lemma <ref> and\n      Remark <ref>, we have \n     (x, Ỹ_)=(x, Y_)= (x, _Y_(x)). \n    We must show that this UBS equals  = (x,Y_a)∪(x,Y_b).\n     To this end we have by Proposition <ref>:\n     \n        __Y_a(x)^+    =    [_x^+∖ D_a^*]∪ D_a,\n        __Y_b(x)^+    =    [_x^+∖ D_b^*]∪ D_b,\n        __Y_(x)^+    =    [_x^+∖ (D_a^*∪ D_b^*)]∪ (D_a∪ D_b).\n    \n    Then a standard Venn diagram argument shows that \n    \n        _x^+∖__Y_(x)^+    =    _x^+∖( [_x^+∖ (D_a^*∪ D_b^*)]∪ (D_a∪ D_b)\n        )\n        \n           =   ( _x^+∩ (D_a^*∪ D_b^*) ) ∖(D_a∪ D_b).\n    \n    The set of hyperplanes on the left-hand side is (x, _Y_(x)), while the set of hyperplanes on the right-hand side is (x,Y_a)∪(x,Y_b).\n    \n     Suppose that (α)∪(β) is commensurate with a UBS.  Then d_T(a,b)≤π/2.\n    \n    We will show that π/2 is an upper bound on the Alexandrov angle between rays representing a,b based at an arbitrary point, and then \n    use (<ref>).  The bound will be produced by finding a convex subspace, \n    isometric to a Euclidean cube, which has one corner at the basepoint and which contains nontrivial initial segments of the \n    rays.\n    \n    Angle bound at a vertex:  Let y∈ X be an arbitrary vertex.  Let α',β' be CAT(0) geodesic rays \n    emanating from y and representing a,b respectively (so, α is asymptotic to α' and β is asymptotic to \n    β').  Let =(α)∪(β), and let '=(α')∪𝒲(β').  Then  is commensurate to ', and hence commensurate to a UBS.  \n    Lemma <ref> then implies that ' is actually a UBS.\n    \n    Now let X_y⊂ X be the cubical convex hull of α'∪β'.  Then the set of hyperplanes crossing X_y is \n    exactly '.  Moreover, by Lemma <ref>, there exists a point y̅ in the Roller boundary \n    such that ' is precisely the set of hyperplanes separating y from y̅.\n    \n    Let ◃ be the partial order on ' defined by declaring that ĥ◃ĥ' if the hyperplane ĥ \n    separates y from ĥ'.  Since every hyperplane of X_y separates y from y̅, any hyperplanes ĥ,ĥ'∈' are either ◃–comparable, or they cross.\n    \n    Note that if ĥ∈' is dual to a 1–cube of X_y incident to y, then ĥ is ◃–minimal.  \n    Hence the set '_min of ◃–minimal hyperplanes is nonempty. Since ◃–incomparable hyperplanes cross, '_min is a \n    set of pairwise-crossing hyperplanes of X.  Since X_y is convex and every hyperplane in ' crosses X_y, we \n    have a cube C ⊂ X_y such that the hyperplanes crossing C are exactly those in '_min.\n    \n    Note y∈ C.  Also note that any cube C' of X_y with y∈ C' satisfies C'⊂ C.  Thus any nontrivial \n    CAT(0) geodesic segment in X_y emanating from y has a nontrivial initial subsegment  lying in C.  In \n    particular, α' and β' have nontrivial initial segments lying in C.  Since the ambient CAT(0) metric restricts \n    to the Euclidean metric on the cube C, the Alexandrov angle made by α',β' at y satisfies\n    \n        ∠_y(α',β')=lim_t,t'→0∠_y(α'(t),β'(t))≤π/2,\n    \n    because any two segments in a cube emanating from a common corner make an angle at most π/2.\n    \n    Angle bound at arbitrary points:  We now bound the angle made by rays representing a,b and emanating from \n    non-vertex points, by an identical argument taking place in an appropriate cubical subdivision of X.  Let y∈ X be an \n    arbitrary point.  Perform a cubical subdivision of X to obtain a CAT(0) cuboid complex X' in which y is a vertex, so that\n    the CAT(0) cuboid metric coincides with the original metric on X.  \n    \n    More precisely, for each hyperplane ĥ, identify its carrier with ĥ×[-1/2,1/2].  For each ĥ \n    such that y∈ĥ×(-1/2,1/2), let ϵ_ĥ be such that y∈ĥ×{ϵ_ĥ}.  The (geodesically convex) subspace ĥ×{ϵ_ĥ} has a natural cubical structure with an n–cube \n    for each (n+1)–cube intersecting ĥ.  We subdivide X so that the cubes of ĥ×{ϵ_ĥ} are \n    subdivided cubes whose edges are segments in X whose lengths are inherited from X.  The result is a cuboid complex X' such that \n    the identity map X→ X' is an isometry in the CAT(0) metric, preserves the median, and sends y to a vertex.  Since the \n    hyperplanes of X' are parallel copies of hyperplanes of X, the set of hyperplanes of X' that cross α∪β \n    continues to be a UBS, so Lemma <ref> still applies. (Compare Remark <ref>.) We can thus argue exactly as before to see that \n    ∠_y(α',β')≤π/2.\n    \n    Conclusion:  We have shown that, for all y∈ X, letting α',β' be the rays based at y and \n    representing a,b respectively, we have ∠_y(α',β')≤π/2.  Taking the supremum over all y∈ X, as in (<ref>), we see \n    that the angular metric satisfies ∠_T(a,b)≤π/2.  Now, \n    Definition <ref> gives _T(a,b)≤π/2, as required.\n    \n    Lemmas <ref> and <ref> extend immediately to the cuboid setting, because they use only hyperplane combinatorics and prior lemmas. The above proof of \n    Lemma <ref> also extends to cuboids, because it uses prior lemmas combined with CAT(0) geometry. Indeed, the above argument uses cuboids in combination \n    with Remark <ref> to prove the desired angle bound for arbitrary basepoints in X. The key conceptual reason why the argument works for cuboids is that every pair of geodesic segments \n    in a cuboid,  emanating from a corner, meets at angle at most π/2. \n    \n    The reliance on cuboids to prove the desired result for cubes can be avoided, as follows. First, prove the angle bound at a vertex of X, exactly as above. Then, let X' be the cubical subdivision \n    of X, and observe that the CAT(0) geodesics in X' are exactly the same as those in X. (See e.g. <cit.>.) Thus the same argument proves the angle bound at \n    every vertex of X'. \n    \n    Continuing to subdivide by induction, we obtain a set V_∞⊂ X of points that are vertices of the subdivision at some (and hence all subsequent) stages.  Note that V_∞ intersects \n    each of the original cubes of X in a dense subset, and in particular contains all the original vertices.  The desired angle bound holds when the rays in question are based at any point in \n    V_∞.  Now, fixing a,b∈ X, we can consider the function x↦∠_x(α,β), where α,β are the rays representing a,b and starting at x.  This function need \n    not be continuous on X (it is upper semicontinuous <cit.>), but it can be shown to be continuous on each open cube of X (of any dimension).  Since it is \n    bounded above by π/2 on a dense subset of each such cube, we conclude that sup_x∠_x(α,β)=∠_T(a,b)≤π/2.\n    \n    Finally, observe that the statement and proof of Lemma <ref> fail completely if we modify the angles of the cubes, precisely because two segments emanating from a vertex of a parallelogram might meet at a large angle.\n    \n    \n    \n    Our main goal in this section is to show that if α,β are geodesic rays with common initial point, and (α)∪(β) is a UBS, then any \n    geodesic ray γ representing an interior point on the Tits geodesic from α(∞) to β(∞) must cross all the hyperplanes in (α)∪(β).  Before proving this in Proposition <ref>, we will need a few auxiliary results,  starting with a corollary of Lemma <ref>.\n    \n    \n    \n    \n    Suppose that = (α)∪(β) is a UBS. Let Y be the cubical convex hull of α∪β. Let γ [0,∞)→ X be a CAT(0) geodesic ray with γ(0)=α(0)=β(0).  Suppose that γ is contained in Y and crosses every dominant hyperplane in .  Then γ crosses every \n    hyperplane in .\n    \n    This follows immediately from \n    Lemma <ref>.<ref> applied to = (Y).\n    \n    \n    Next, we study angles at which rays cross dominant hyperplanes. \n    \n    \n     Let α be a CAT(0) geodesic ray with α(0)∈ \n    X^(0).  Then there exists κ>0 such that the following holds.  Let 𝒟_d,⋯,𝒟_k⊂(α) be the dominant minimal UBSes provided by applying Lemma <ref> to 𝒲(α), and let i∈{d,…,k}.  Then 𝒟_i contains a chain {û_n}_n≥0 of hyperplanes such \n    that 𝒟_i is commensurate with the inseparable closure of {û_n}_n≥ 0, and \n    \n        ∠_y_n(α,û_n)≥κ\n    \n    for all n≥ 0, where y_n is the point α∩û_n.\n    \n    Recall from Lemma <ref> that (α) is a pruned UBS. Thus Lemma <ref> applies to (α).\n    \n    Now, fix i∈{d,…,k}.  \n    Lemma <ref> says that 𝒟_i={ĥ_m}_m≥0, where\n    each ĥ_m is dominant. This means each ĥ_m crosses all but finitely many hyperplanes in 𝒲(α) ∖𝒟_i.  \n    \n    The divergence f(t) of α from ĥ_0:  Define f(t) = _X(α(t),ĥ_0), and \n    let T_0 = α^-1(ĥ_0). By Lemma <ref>.<ref>, there is a constant A_0 > 0 (depending on ĥ_0 but not s,t) such that\n    \n        f(t)-f(s) ≥ A_0·(t-s)\n    \n    for all T_0≤ s≤ t.\n    \n    Hyperplane count:  We wish to produce a constant C such that any length–C subpath of α \n    crosses an element of 𝒟_i.\n    \n    Let s_0≥ T_0 be sufficiently large that α([0,s_0)) crosses all of the finitely many hyperplanes in 𝒲(α) ∖𝒟_i not crossing ĥ_0.  Suppose that s_0≤ s≤ t.  Then all hyperplanes crossing α([s,t]) either cross ĥ_0 or belong to 𝒟_i.  \n    Assume that α([s,t]) does not cross any element of 𝒟_i.  \n    \n    Let H_st = (α([s,t])) denote the cubical convex hull of α([s,t]).  There may be hyperplanes crossing H_st that do not cross α([s,t]), because α(s),α(t) need \n    not be vertices. However, we can bound the number of such hyperplanes as follows.  Let 𝒲_bad⊂𝒲(H_st)⊂𝒲(α) be the set of hyperplanes \n    that cross H_st but do not cross \n    α([s,t]).  Note that 𝒲(H_st) inherits a partial order from 𝒲(α), by restricting the partial order ◃ from the proof of \n    Lemma <ref>.  \n    Suppose that ĥ∈𝒲(H_st) is neither ◃–maximal nor ◃–minimal in 𝒲(H_st).  Then there exist û,v̂∈𝒲(H_st) such that \n    ĥ separates û from v̂.  By the definition of the convex hull, ĥ cannot separate û or v̂ from α([s,t]), so ĥ must cross α([s,t]).  Thus \n    every hyperplane in 𝒲_bad is ◃–minimal or ◃–maximal.  Since incomparable hyperplanes have to cross, we conclude that |𝒲_bad|≤ \n    2(X), hence there are at most D=2 X hyperplanes that cross H_st but not α([s,t]).\n    The rest of the \n    hyperplanes crossing H_st must cross ĥ_0, since they cross α([s,t]), and we have chosen s ≥ s_0 and assumed 𝒲(α([s,t]))∩𝒟_i=∅.\n    \n     \n     \n    Consider the CAT(0) closest-point projections p  X→ĥ_0 and q  X→ H_st.\n    By <cit.>,  the d_X–convex hull of p(H_st)∪ \n    q(ĥ_0) is isometric to p(H_st)× [0,_X(ĥ_0,H_st)], where p(H_st)  is identified with p(H_st) ×{ 0 }, and q(ĥ_0) is identified with p(H_st) ×{_X(ĥ_0,H_st)}.\n    By <cit.>, the hyperplanes that cross q(ĥ_0) are precisely those that \n    cross ĥ_0 and H_st.  So, there are at most D hyperplanes crossing H_st but not q(ĥ_0).  By \n    Lemma <ref>, the points α(s),α(t) are thus both within distance λ_0D+λ_1 of \n    points in q(ĥ_0), where λ_0D+λ_1 depends only on D. Thus\n    \n        _X(α(t),ĥ_0)  ≤ λ_0D+λ_1+_X(H_st,ĥ_0)  ≤ λ_0 D+λ_1+_X(α(s),ĥ_0).\n      In other words, since  s,t≥ s_0 ≥ T_0, we have shown\n    \n        A_0(t-s) ≤ f(t)-f(s)≤λ_0D+λ_1.\n    \n    Thus, for any 0≤ s≤ t (without assuming s ≥ s_0), we get \n    \n        t-s≤λ_0D+λ_1/A_0+ s_0.\n    \n    \n    \n    Letting C=  λ_0 D+λ_1/A_0 + s_0+1, we have shown that any subsegment of α of \n    length at least C crosses an element of 𝒟_i.  \n    \n    Hence, for any 0≤ s≤ t, we have that α([s,t]) \n    crosses at least ⌊ (t-s)/C⌋ elements of 𝒟_i.  \n    \n    Big angle hyperplanes:  Let σ be a subsegment of α.  Consider the hyperplanes in 𝒟_i \n    crossing σ.  Any two such hyperplanes are either disjoint or not, and any collection of pairwise crossing \n    hyperplanes has size at most X.  So, if there are more than (3, X+1) hyperplanes in 𝒟_i crossing σ, then there are \n    three disjoint such hyperplanes, where ( ·, ·) denotes the Ramsey number.  Hence, if σ has length |σ|=C·(3, X+1)+1, \n    then σ crosses three disjoint hyperplanes û,v̂,ŵ∈𝒟_i.  Without loss of generality, \n    say v̂ separates û,ŵ.  Hence α∩ N(v̂) is a subpath of α lying between the points \n    α∩û and α∩ŵ∈σ, so \n    \n        |α∩ N(v̂)|≤ C·(3, X+1)+1=L.\n    \n    Note that L is independent of the hyperplane v̂. Indeed, L depends on A_0,λ_0,λ_1,s_0, and hence is determined by X, the hyperplane ĥ_0 and the geodesic α.  \n    Now, using the fact that N(v̂) is isometric to a product\n     of the form v̂×(-1/2,1/2), we see that\n    \n        ∠_α∩v̂(v̂,α)≥sin^-1(1L),\n    \n    which we denote by κ.  \n    \n    Since we can do the above procedure for infinitely many disjoint length–L segments in α, we find infinitely many \n    hyperplanes in 𝒟_i making an angle at least κ with α.  Since any infinite subset of a UBS contains \n    a chain, we thus have a chain {û_n}_n≥ 0⊂𝒟_i with this property.  Finally, the inseparable \n    closure of {û_n}_n≥ 0 is a UBS contained in 𝒟_i, and hence commensurate with 𝒟_i since \n    𝒟_i is minimal.  This verifies the statement for the given 𝒟_i, and we conclude by replacing κ \n    with the minimal κ for the various i∈{d,…,k}.\n    \n    Extending Lemma <ref> to a cuboid metric d_X^ρ requires a bit of care. The above proof relies on \n     some results of of Huang <cit.>, which are written in the context of a cube complex with finitely many isometry types of cells. This hypothesis may fail in (X, d_X^ρ). \n    Fortunately, we only need to use Huang's results in a finite cuboid complex, namely the convex hull of H_st∪ p(H_st), where H_st is itself finite and p is a certain CAT(0) \n    projection. Thus Huang's results <cit.> apply to the subcomplex we need. \n     \n    Some constants in the proof would need to be adjusted for the cuboid metric.  The constants λ_0, λ_1 of Lemma <ref>, used in the definition of C, would have to be replaced \n    by the constants λ_0^ρ, λ_1^ρ of Lemma <ref>. \n    In the constant sin^-1(1/L), the numerator 1 is the thickness of a hyperplane carrier, and would have to be replaced by the minimal thickness of a hyperplane carrier in  the metric \n    d_X^ρ.\n    \n    \n    Now we can prove the main result of this section.\n    \n    \n    \n    Let α, β be CAT(0) geodesic rays with α(0) = β(0) ∈ X^(0).\n    Suppose that (α)∪(β) is commensurate \n    with a UBS.  Then a=α(∞) and b=β(∞) are joined by a unique geodesic \n    g in X. Furthermore, any interior point c of g is represented by a CAT(0) geodesic ray γ \n    such that (γ)  = (α)∪(β).\n    \n     By Lemma <ref>, we have \n    _T(a,b)≤π/2, so the CAT(1) space X contains a \n    unique geodesic g from a to b.  This proves the first assertion of the lemma. \n    \n    Let c ∈ X be an interior point of g.  Let γ be the unique CAT(0) geodesic ray starting at α(0) and \n    representing c.  We need to show that (γ)=𝒲(α)∪(β). \n    \n    Working in the convex hull of α∪β:  Let Y be the \n    cubical convex hull of α∪β. We claim that g lies in Y⊂ X.  Indeed, \n    applying Lemma <ref> inside of Y shows that a,b can be joined by a unique geodesic g' in \n    Y.  Since the Tits distance in Y from a to b depends only on {_Y(α(t),β(t)):t≥ 0} and \n    _Y(α(t),β(t))=_X(α(t),β(t)) by convexity of Y, we have that g' is a geodesic of X.   Since \n    g' has length less than π, it is the unique geodesic in X from a to b, i.e. g=g' and g lies in Y. \n    \n    For the rest of the proof, we work entirely in Y.\n    \n    For any y∈ Y, we can choose rays α_y,β_y with α_y(0)=β_y(0)=y and α_y(∞)=a,β_y(∞)=b, and note that the cubical convex hull Y_y of \n    α_y∪β_y is contained in Y, and crosses all but finitely many of the hyperplanes crossing Y.  By convexity, Y_y= Y.  So, when convenient, we can move the basepoint.\n    \n    What we will actually verify:  The plan is as follows.  Let ĥ be a hyperplane of Y that is dominant in the UBS = (Y) = (α) ∪(β).  We will show that c∉ĥ.  Since the \n    shallow side of any hyperplane in Y is contained in a neighborhood of that hyperplane, it follows that γ must cross ĥ.  Once we show that γ crosses every dominant hyperplane, \n    Corollary <ref> will then imply that γ crosses every hyperplane, i.e. (γ)=(α)∪(β), as required.  So, it remains to argue that \n    c∉ĥ when ĥ is a dominant hyperplane.\n    \n    Initial segments of α and β inside a cube:  For each r≥ 0, let y_r=α(r).  Let α_y_r and β_y_r be geodesics asymptotic to α and β, defined as above.  Note that Y_y_r⊂ Y \n    contains a ray based at y_r and representing each element of Y.  As in the proof of Lemma <ref>, there is a single cube C_y_r⊂ Y_y_r, with y_r∈ \n    C_y_r, such that any ray in Y_y_r emanating from y_r has a nontrivial initial segment in C_y_r.  \n    \n    Let α'_y_r,β'_y_r,γ'_y_r be the maximal (nontrivial) segments of α_y_r,β_y_r,γ_y_r that lie in C_y_r.  Then the Alexandrov angle between any two of the rays \n    α_y_r,β_y_r,γ_y_r at y_r is just the Euclidean angle in C_y_r between the corresponding segments.\n    \n    By <cit.>, ∠_y_r(α_y_r,β_y_r) converges to ∠_T(a,b) = _T(a,b), where the equality follows from\n    Lemma <ref> because the distance is less than π.\n    \n    Angle computation:  Let ĥ be a dominant hyperplane in .  By Lemma <ref>,  we \n    can assume that ĥ∈𝒟, where 𝒟 = 𝒟_j is a minimal UBS consisting of dominant hyperplanes. Since 𝒟⊂(α) ∪(β) is a minimal UBS, we must have either 𝒟≼(α) or 𝒟≼(β). We assume without loss of generality that 𝒟≼(α).\n    \n    \n    Note that every hyperplane in 𝒟 is dominant in (α), because any hyperplane crossing all but \n    finitely many hyperplanes in ∖𝒟 crosses all but finitely many hyperplanes in 𝒲(α) ∖𝒟.  We now apply Lemma <ref> to (α) and 𝒟 to produce \n    a constant κ and a chain  {ĥ_n }⊂𝒟 whose inseparable closure is 𝒟 and whose (necessarily dominant) \n    hyperplanes all cross α at an angle at least κ:\n    \n        ∠_y_n(α_y_n,ĥ_n)≥κ,\n    \n    where y_n=ĥ_n∩α and \n    α_y_n is the sub-ray of α emanating from y_n.  \n    Since all but finitely many of the ĥ_n lie on the deep side of ĥ, it suffices to show that γ crosses ĥ_n for sufficiently large n. As explained above, it suffices to show that c ∉ĥ_n for sufficiently large n.\n    \n    \n    Let β_y_n be the ray emanating from y_n and \n    asymptotic to β.  \n    Working in the cube C_y_n constructed above, we have that the segment α_y_n' makes a Euclidean angle at least κ with the midcube M_n = C_y_n∩ĥ_n.  Meanwhile, \n    the segment β_y_n' makes some angle θ≥ 0 with M_n.  \n    See Figure <ref>.\n    \n    Let s∈(0,1) be such that _T(a,c)=s·_T(a,b) and _T(c,b)=(1-s)·_T(a,b).  Such an s exists since c is an interior point of the Tits geodesic g from a to b.\n    \n    \n    \n    \n    Let η_n ⊂ C_y_n be the maximal segment that emanates from y_n and makes an angle s·∠_y_n(α_y_n',β_y_n') with α_y_n' and and \n    angle (1-s)·∠_y_n(α_y_n',β_y_n') with β_y_n'.  Then there exists κ_1= (1-s) κ >0 such that ∠_y_n(η_n,\n    M_n) ≥κ_1. Crucially, κ_1 is  independent of n.  On the other hand, as \n    n →∞, we have convergent sequences\n    \n        ∠_y_n (α_y_n',β_y_n')    →_T(a,b), \n        ∠_y_n (α_y_n',γ_y_n')    →_T(a,c) = s ·_T(a,b), \n        ∠_y_n (β_y_n',γ_y_n')    →_T(b,c) = (1-s) ·_T(a,b),\n    \n    Thus,  for all sufficiently large n, \n    \n        ∠_y_n(η_n,γ_y_n')<κ_1/2,\n    \n    so by the triangle inequality for Alexandrov angles, ∠_y_n(γ'_n,M_n) > κ_1/2 >0.  Hence the ray γ_y_n is not contained in ĥ_n and, since its initial \n    point is in ĥ_n, we thus have c∉ĥ_n.  This completes the proof.\n    \n    \n    \n    \n    We observe that the proof of Proposition <ref> extends to the cuboid setting with minimal effort. The proof of that lemma combines prior results and the local Euclidean geometry of a \n    cube; all of the local arguments work equally well in a rescaled cuboid. \n    \n    \n    \n    § CONNECTIONS BETWEEN TITS AND ROLLER BOUNDARIES\n    \n    \n    \n    In this section, we establish some important connections between X and X. Every Roller class v ∈ X is assigned a \n    canonical CAT(1)–convex  Tits boundary realizationQ(v) ⊂ X.\n    We define a pair of maps ψ X → X and φ X → X  that will play a major role in the proof of our main theorem. See Proposition <ref> for the properties of Q(v) and Proposition <ref> for  the relationship between φ and ψ. \n    \n    Toward the end of this section, we focus on ℓ^2–visible Roller classes, namely all v ∈ X\n     such that ψ∘φ(v) = v. \n    In Section <ref>, we will use the visible Roller classes to construct a closed covering of X that is compatible with a covering of a large part of X, denoted X.\n    \n    All of the results of this section extend with minimal effort to a cuboid metric d_X^ρ obtained via a G–admissible hyperplane rescaling (recall Definitions <ref> and <ref>). This extension is described in Section <ref>.\n    \n    \n    \n    Given a ∈ X, define ψ(a) = Y_a ∈ X to be the Roller class Y_a constructed in Lemma <ref>. That is, ψ(a) is the principal Roller class of the  intersection of half-spaces in the deep set  D_a. \n    \n    \n    \n    Our definition of ψ generalizes Guralnik's boundary decomposition map <cit.>, because X agrees as a set with the visual boundary _ X.\n    \n    \n    \n    \n    \n    \n    Let a = [α] ∈ X. Let (α) be the UBS consisting of hyperplanes crossing the geodesic α. Then ψ(a) = Y_a = Y_(α).\n    \n    By Lemma <ref> we have that D_a= _Ỹ_a^+ and Y_a ∈ X. Fix x∈ X^(0). By definition,  D_a∖_x^+ = (x,Y_a) =  (x,[y]) for any y ∈ Y_a. Finally by  Lemma  <ref>(x,[y])∼(x,y). \n    \n    By Lemma <ref>, there is a combinatorial geodesic α'  [0,∞) → X with α'(0) = x and α'(∞) =  y.  By Remark <ref>, we have (α')= (x,y). \n    \n    Now, Lemma <ref> implies that α and α' can be chosen to lie at finite Hausdorff distance. Thus α and α' cross the same hyperplanes, \n    except possibly for \n    finitely many. In symbols,\n     (α') ∼(α). By Lemma <ref>, we conclude that Y_a = Y_(α).\n    \n    \n     §.§ Tits boundary realizations\n    \n    Defining a map φ X → X that serves as a partial inverse to ψ takes considerably more effort. As a first step, we will define a Tits boundary realizationQ(v) associated to a Roller class v.\n    \n    A family ℱ of subsets of X is called filtering if for every E,F∈ℱ there is a D∈ℱ such that D⊂ E∩ F. For example, for y∈ X,  the family \n    \n        ℱ :={(h_1)∩⋯∩(h_n)   :   h_1, …, h_n∈_y^+, n∈}\n     \n    is a filtering family of closed convex subspaces. \n    \n    The following theorem combines results of Caprace–Lytchak <cit.> and Balser–Lytchak <cit.>.\n    \n    \n    Let {X_i}_i∈ I be a filtering family of closed convex subsets of a finite-dimensional CAT(0) space X. If the \n    intersection ⋂_i∈ I X_i is empty, then the intersection ⋂_i∈ I X_i of their \n    boundaries is nonempty, and furthermore ⋂_i∈ I X_i has intrinsic radius at most π/2 and therefore a canonical circumcenter.  \n    \n    \n    Next, we present two definitions that will turn out to be equivalent (compare Lemma <ref>). The first of these definitions appears in <cit.>.\n    \n    \n    Let y∈ X. Define Q(y)=⋂_h∈_y^+(h). Note that Q(y) ≠∅ by Theorem <ref>.\n    We call Q(y) the Tits boundary realization of y.\n    \n    Let x∈ X^(0) and let y∈ X.    Recall that (x,y)⊂X̃ is the vertex interval between x and y, so \n    that (x,y)∩ X is a vertex–convex subset of X^(0).  Generalizing Definition <ref>, let (x,y) be the union of all of the cubes in X \n    whose 0–skeleta lie in (x,y)∩ X.\n    Then (x,y) is a convex subcomplex of X, \n    and hence has a well-defined Tits boundary naturally embedded in X.  We define  Q'(y)=(x,y).\n    \n    \n    In fact, the two definitions are equivalent: \n    \n    \n    Let y∈ X and let x,x'∈ X^(0).  Then:\n    \n      * (x,y)=(x',y), \n    hence Q'(y) is well-defined.\n     \n      * Q(y)=Q'(y).\n     \n      *  If y∼ y', then Q'(y)=Q'(y') and Q(y)=Q(y').\n    \n     To prove conclusion <ref>, observe that (x,y) and (x',y) lie at \n    Hausdorff distance bounded by _1(x,x'). Hence (x,y) and (x',y) have the same \n    Tits boundary.\n    \n    \n    Next, we consider conclusion <ref>.  For any given vertex half-space h∈_y^+, \n    let (h) be the \n    associated CAT(0) half-space containing y.  By <ref>, we can assume that x∈(h).  \n    Hence (x,y)⊂(h), so Q'(y)=(x,y)⊂(h). Therefore Q'(y)⊂ Q(y).\n    \n    For the reverse inclusion, suppose q∉ Q'(y).  Then there is a CAT(0) half-space (h) such that 𝒥(x,y) ⊂(h) and q ∉(h). (To find such a half-space, let γ be any CAT(0) geodesic ray \n    representing q. Since γ leaves every finite neighborhood of (x,y), it must cross a hyperplane ĥ \n    disjoint from (x,y).) The associated vertex half-space h satisfies h∈_y^+ but q ∉(h). By Definition <ref>, it follows that q ∉ Q(y).  Hence Q(y)⊂ Q'(y).\n    \n    Finally, consider conclusion <ref>. If y ∼ y', the Hausdorff distance from \n    (x,y) to (x,y') is bounded by _1(y,y') < ∞. Using <ref>, we obtain\n    \n        Q(y) = Q'(y) = (x,y) = (x,y') = Q'(y') = Q(y').\n    \n    \n    \n    Following Theorem <ref> and Lemma <ref>, we can make the following definition.\n    \n    \n    Let v ∈ X be a Roller class. Define Q(v) = Q(y) for any representative element y ∈ v.  \n    The reader can think of Q(y) according to either Definition <ref> or Definition <ref>.  We call\n     Q(v) the Tits boundary realization of the Roller class v.\n     \n    Observe that the collection of half-spaces ℌ_y^+ containing y has empty intersection in X. Thus, by  Theorem <ref>, \n    Q(v)  has a canonical circumcenter. We define χ(v) ∈ X to be the circumcenter of Q(v). \n    \n    For every v ∈ X and every g ∈(X), we have Q(gv) = gQ(v) and (gv) = g (v). Furthermore, Q(v) and Q(gv) have the same intrinsic radius.\n    \n    Let y∈ X, and let v=[y]. Then, for every h ∈_y^+, the map g gives an isometry from (h)  to (gh). Thus g  Q(v) → Q(gv) is an isometry, hence Q(v) and Q(gv) have the same intrinsic radius. By Theorem <ref>, (v) and (gv) are uniquely determined by the geometry of Q(v) and Q(gv), respectively, hence (gv) = g (v).\n    \n    \n    \n    Consider a Roller class v∈ X. We say that a combinatorial geodesic  ray γ in Xrepresentsv if \n    γ(∞) = y ∈ v, or equivalently if \n    the UBS (γ) represents the class v.   Setting x = γ(0), observe that (x,y) is the \n    cubical convex hull of γ, and (γ) = (x,y) is exactly the collection of hyperplanes crossing \n    (x,y). This leads to\n    \n    \n    \n    Let v∈ X be a Roller class and let a∈ Q(v).  Then ψ(a)≤ v.  \n    \n    Let γ be a combinatorial geodesic ray representing v, with γ(0) = x and  γ(∞) = y ∈ v. Then  \n    the cubical convex hull of γ, namely (x,y), is also CAT(0) geodesically convex. Since a∈ Q(v) = 𝒥(x,y) by Lemma <ref>,\n    we may choose a CAT(0) geodesic α  representing a such that α⊂(x,y).  Then (α) \n    ⊂(γ) = (x,y).  Thus every hyperplane crossing α crosses (x,y) and hence γ.   \n    Hence ψ(a)≤ v.\n    \n    In Definition <ref>, we will define a map φ X→ X with the property that φ(v)∈ Q(v) for each Roller \n    class v. This map will be defined by slightly perturbing the circumcenter (v).  In view of Lemma <ref>, we \n    will have ψ(φ(v))≤ v.\n    \n    Let v,w∈ X satisfy w≤ v.  Then Q(w)⊂ Q(v).\n    \n    Fix a basepoint x_0∈ X^(0) and let γ_v,γ_w be combinatorial geodesic rays emanating from x_0 and \n    representing v,w respectively.  Since w≤ v, Theorem <ref>.<ref> says that 𝒲(γ_w)≼(γ_v).  Without moving x_0, we can replace γ_w by its image under the gate map to the \n    cubical convex hull of γ_v, \n    ensuring that 𝒲(γ_w)⊂(γ_v).  Hence, setting y_w = γ_w(∞) ∈ w and y_v = γ_v(∞) ∈ v, the \n    cubical convex hulls of these geodesics satisfy (x_0,y_w)⊂(x_0,y_v).  Taking \n    boundaries and applying Lemma <ref> gives  Q(w)⊂ \n    Q(v).\n    \n    \n     §.§ Diameter, intrinsic radius, and Tits-convexity of Q(v)\n    \n    Let v ∈ X be a Roller class. Recall that Q(v) is the intersection of the Tits boundaries of the half-spaces corresponding to a representative element of v. We will need the following properties of  Q(v):\n    \n    \n    For any Roller class v, the Tits boundary realization Q(v) has the following properties:\n    \n      * Q(v) has diameter at most π/2.\n         \n      * Q(v) is Tits–convex.\n         \n      * Q(v) is contractible in the Tits metric topology and compact in the visual topology.\n         \n      * Q(v) has intrinsic radius r_v<π/2. \n         \n      * Q(v) ⊂B̃_T((v), r_v).\n    \n     Let v be an arbitrary Roller class and x_0 ∈ X^(0) an arbitrary basepoint. Let γ be a combinatorial geodesic ray based at x_0 and representing v. Let H= H(x_0,v,γ) denote the cubical convex hull of γ. Then, for an arbitrary point y ∈ [y] = v, the cubical hull H and the interval (x_0, y) lie within bounded Hausdorff distance of each other.  Thus, by \n    Lemma <ref>, Q(v) is equal to the closed subset H  = (x_0, y) ⊂ X.\n    \n     Diameter: \n    To bound _T(Q(v)), let a,b∈ \n    Q(v).  Represent a,b by CAT(0) rays α,β with initial point x_0. Note that α, β⊂ H because H is a convex subcomplex.  Then (α),(β) \n    are both subsets of (γ), which is a UBS representing v.  So, 𝒲(α)∪(β) ⊂(γ).  Now, (α)∪(β) is \n    infinite.  Moreover, (α)∪(β) is unidirectional and contains no facing triple, since (γ) has those properties.  Thus 𝒲(α)∪(β) is a UBS, hence Lemma <ref> \n    implies _T(a,b)≤π/2.\n    \n    Convexity:  Since H=H(x_0,v,γ)↪ X is an isometric embedding in the CAT(0) \n    metric, the \n    inclusion H=Q(v)↪ X is a Tits-metric isometric embedding.  Indeed, let a,b∈ \n    Q(v) be represented by CAT(0) rays α,β⊂ H with initial point x_0. Since \n    Q(v) has diameter less than π, we have _T(a,b)=∠(a,b) by  \n    <cit.>.  \n    Since α, β⊂ H, the angle ∠_T(a,b) is \n    determined entirely by \n    the set {_X(α(t),β(t))}_t≥ 0, by <cit.>).  By convexity of H, this set coincides with \n    {_H(α(t),β(t))}_t≥ 0.  Hence the Tits distance from a to b measured in X \n    is the same \n    as the Tits distance measured in H=Q(v).\n    \n    Now, Q(v) contains a unique geodesic joining a,b.  Since this geodesic realizes \n    the distance from a to \n    b in X, this shows that Q(v) is Tits-convex.\n    \n    Intrinsic radius:  Since Q(v) is a CAT(1) space of \n    diameter less than π, the intrinsic radius r_v satisfies r_v<diam Q(v), by <cit.>.  Since diam Q(v)≤π/2, we have r_v<π/2, proving \n    assertion <ref>.  \n    Now, observe that Q(v) ⊂B̃_T((v), r_v) by Definition <ref> and Theorem <ref>, proving <ref>.\n    \n    Topological properties:  Since Q(v) is a uniquely geodesic CAT(1) space, a standard straight-line homotopy allows one to deformation retract Q(v) to \n    a single point. Thus Q(v) is contractible.\n    \n    Finally, recall from Lemma <ref> (and from earlier in this proof) that Q(v) = (x_0,y) for an arbitrary point  \n    y ∈ [y] = v.  By Lemma <ref>, the subcomplex (x_0, y) is proper, hence Q(v) is compact in the visual topology.  (The visual topology is defined in <cit.>, where it is called the cone topology.)\n    \n    \n     §.§ Visibility and perturbing the circumcenter\n    \n    Recall the (X)–equivariant circumcenter map \n     X → X, mentioned in Corollary <ref>.\n    In this subsection, we perturb   to obtain a map φ X→ X with slightly nicer \n    properties.  First, like , the map φ will have the property that φ(v)∈ Q(v) for each Roller class \n    v, and hence ψ(φ(v))≤ v.  Compare Remark <ref>.\n    \n    We will define φ so that Roller classes v for which ψ(φ(v))=v are exactly those for which there is some \n    CAT(0) geodesic ray representing v. (Note that a combinatorial geodesic exists for every v, but a CAT(0) geodesic is not guaranteed.) Later, we will work with only such Roller classes, which we term \n    ℓ^2–visible; see Definition <ref>. \n    See also Lemma <ref> for several equivalent characterizations of visibility. While the map φ is not guaranteed to be equivariant, the set of ℓ^2–visible Roller classes \n    will still be invariant.\n    \n    The following example illustrates the point that (v) can lie in Q(w)⊊ Q(v) for some w<v. \n    \n    \n    Consider the cone of ℝ^3 cut out by the planes z=0, z=y, and z=x, and let X be the union of all cubes (in the standard cubical tiling of ℝ^3) contained in this cone. Then X has four classes, described in coordinates as u=[(∞, 0, 0)], u'=[(0, ∞, 0)], w = [(∞, ∞, 0)], and v = [(∞, ∞, ∞)], all of which are represented by ℓ^2 geodesic rays. Furthermore, Q(v) = Q(∞, ∞, ∞) =  X is isometric to an isosceles triangle of S^2 whose base has length π/2 and whose height is arctan(1/√(2)). The base of the triangle is Q(w) = Q(∞, ∞, 0).\n    See Figure <ref>.\n    \n    \n    \n    \n    First, observe that (w) is the midpoint of the geodesic segment Q(w). Next, we claim that (v) = (w). To see this, let β be the altitude from (w) to the the apex of Q(v). Because Q(v) has a reflective symmetry in β, its circumcenter must be contained in β. In addition, since len(β) = arctan(1/√(2)) < π/4, any point b ∈β must have distance less than π/4 to the apex but distance at least π/4 to the two endpoints of Q(w). Thus (w) = (v) even though w<v and Q(w)⊊ Q(v).\n    \n    \n    The\n    phenomenon of Example <ref> will be inconvenient later. To remedy this problem, we will define \n    φ(v) by perturbing (v) slightly, to get a point in the interior of Q(v) that retains the property that \n    all of Q(v) is contained in the r_v–neighborhood of φ(v) for some r_v<π/2.  (This latter property will \n    also be necessary later.)\n    \n    To achieve this, we need some preliminary discussion and lemmas.  \n    \n    \n    \n    For every Roller class v,  there is a unique Roller class M_v ∈ψ(Q(v)) that is maximal among all Roller classes in ψ(Q(v)). Furthermore Q(M_v)=Q(v).\n    \n    If w∈ψ(Q(v)), then w=ψ(a) for some a∈ Q(v), so w≤ v by Lemma <ref>.  \n    Since there is a bound on the length of ≤–chains, it follows that ψ(Q(v)) contains ≤–maximal elements.\n    \n    Suppose that m,m'∈ψ(Q(v)) are ≤–maximal.  Let a,a'∈ Q(v) be such that \n    ψ(a)=m and ψ(a')=m'.  Let α,α' be CAT(0) geodesic rays in X representing a,a' \n    respectively, chosen so that α(0)=α'(0). Then _m ∼(α) and _m'∼(α'). \n     Since m,m'≤ v, Theorem <ref> gives\n     𝒲(α) ≼_v and (α') ≼_v, hence\n    W(α)∪(α') is commensurate with a UBS by Lemma <ref>. Thus, by Proposition <ref>, there exists \n    a CAT(0) geodesic ray β with (β)  = (α)∪𝒲(α').  By construction, \n    \n        m ≤ψ(β(∞))≤ v,      m' ≤ψ(β(∞))≤ v\n    \n     where the first inequality for m or m' is strict if \n    m≠ m'. So, β(∞)∈ Q(v) by Lemma <ref> and the second inequality.  Hence the \n    first inequality contradicts the maximality of m,m' in ψ(Q(v)), unless m=m'.  This proves \n    the uniqueness of a maximal element M_v.\n    \n    Next, M_v≤ v, so Q(M_v)⊂ Q(v) by Lemma <ref>.  On the other hand, if a∈ \n    Q(v), then ψ(a)∈ψ(Q(v)), so ψ(a)≤ M_v.  Hence a∈ Q(ψ(a))⊂ Q(M_v) by \n    Lemma <ref>. Thus Q(v)⊂ Q(M_v), and we conclude  that Q(v) = Q(M_v).\n    \n    \n    For a Roller class v, define Q_0(v) = Q(v) ∖⋃_u < M_v Q(u).\n    \n    \n    \n    Let v,w be Roller classes, and let a ∈ Q(v). Then a ∈ Q_0(v) if and only if ψ(a)= M_v.\n    \n    Furthermore, if Q(v) = Q(w), then M_v=M_w and Q_0(v)=Q_0(w).\n    \n    First, suppose  that a ∈ Q_0(v). Then ψ(a) ≤ M_v by the definition of M_v. If ψ(a) = u < M_v, then a ∈ Q(u), contradicting the definition of Q_0(v). Thus ψ(a) = M_v, as desired.\n    \n    Conversely, suppose that ψ(a)=M_v.  If a∈ Q(u) for some u<M_v, then \n    ψ(a)≤ u by Lemma <ref>, so ψ(a)<M_v, a contradiction.  Hence a∈ Q_0(v). \n    \n    \n    Finally, suppose Q(v) = Q(w). Then Lemma <ref> says that M_v = M_w is the unique maximal element of ψ(Q(v)) = ψ(Q(w)).\n    Thus, by the above equivalence, Q_0(v)=Q_0(w).\n    \n    Let v be a Roller class. Then  Q_0(v) contains points arbitrarily close to (v) in the Tits metric. \n    \n    By Lemma <ref>, there is a point a ∈ Q(v)  such that ψ(a) = M_v.\n    By Lemma <ref>, we have a ∈ Q_0(v).\n    Let g be the geodesic in X from a to \n    b = (v).  By Proposition <ref>.(<ref>), g lies in Q(v).\n     For any ϵ>0, choose c ∈ g so that 0 < _T(c,(v))<ϵ.  We will show c ∈ Q_0(v).\n     \n    By Proposition <ref>, the Tits points a,b,c are represented by CAT(0) geodesic rays α, β, γ such that (γ) = (α) ∪(β) ⊃(α). Thus, by Lemma <ref>, we have ψ(c) = Y_(γ)⊂ Y_(α) = ψ(a).\n    By Lemma <ref>, we have ψ(c) ≥ψ(a) = M_v, hence ψ(c) = M_v by the maximality of M_v.\n    Therefore, c ∈ Q_0(v) by Lemma <ref>.\n    \n    Let v be a Roller class, and fix Q = Q(v). Let r<π/2 be the intrinsic radius of Q. Using Lemma <ref>, choose p_Q∈ \n    Q_0(v) such that d_T(p_Q,(v))≤π/4 -r/2. We call p_Q the pseudocenter of Q, and denote it φ(v).\n    \n    Using Lemma <ref>, we ensure that φ(v) = φ(w) = p_Q for every Roller class w such that Q(w) = Q(v) = Q.\n    \n    \n    In the following proposition we collect the facts about the pseudocenter map \n    φ that will be needed later, in conjunction with Lemma <ref> and the definition of \n    φ.\n    \n    \n         The pseudocenter map φ has the following properties.  Let v∈ X.  Then:\n         \n      * φ(v)∈ Q(v).\n      * ψ(φ(v))≤ v.\n      * Q(v)=Q(ψ(φ(v))).\n      *  If Q(w)=Q(v), then φ(w)=φ(v). \n         Assertion <ref> holds by construction, and, together with Lemma <ref>, implies \n    assertion <ref>.  Since φ(v)∈ Q_0(v), we have ψ(φ(v))=M_v by Lemma <ref>, and Q(v)=Q(M_v) by \n    Lemma <ref>, yielding assertion <ref>.  Assertion <ref> follows from the \n    definition of φ and Lemma <ref>.\n    \n    \n    We can now define (ℓ^2)–visible Roller classes:\n    \n    \n    Let v∈ X.  Then v is ℓ^2–visible if v∈ψ( X). Let \n    (X) = ψ( X) denote the set of visible Roller classes. Observe that (X) stabilizes (X), because the map ψ is (X)–equivariant.\n    \n    Let v∈ X. Then the following are equivalent:\n    \n      * v is ℓ^2–visible.\n    \n      *  There exists a CAT(0) geodesic ray α such that (α) represents v.\n    \n      * v = M_v.\n    \n      * v = ψ(φ(v)).\n    \n    To begin with, we have <ref>⇔<ref> by Lemma <ref>.\n    \n    For <ref>⇒<ref>,  let α be a CAT(0) geodesic ray such that 𝒲(α) represents v. Let a = α(∞) ∈ X. \n    \n    Then, by Lemma <ref>, we have ψ(a) = v.  Now, recall from Lemma <ref> that M_v is \n    maximal among all Roller classes in ψ(Q(v)). By \n    Lemma <ref>, every class w ∈ψ(Q(v)) satisfies w ≤ v, hence M_v ≤ v.  On the other hand, v = \n    ψ(a) ∈ψ(Q(v)), hence v ≤ M_v by the maximality of M_v. Thus v = M_v.\n    \n    For <ref>⇒<ref>, suppose v = M_v.  By Definition <ref>, we have \n    φ(v) ∈ Q_0(v). Thus, by Lemma <ref>, we have ψ(φ(v)) = M_v = v.\n    \n    For <ref>⇒<ref>, suppose v = ψ(φ(v)). \n    Then φ(v) ∈ Q_0(v) ⊂ Q(v). \n    Choose a CAT(0) geodesic ray α representing φ(v).   The associated UBS (α) represents the \n    class ψ(φ(v)) = v.\n    \n    Let v∈ X be a ≤–minimal Roller class.  Then v is ℓ^2–visible.\n    \n    Lemma <ref> gives v≥ψ(φ(v)).  By \n    minimality of v, we thus have v=ψ(φ(v)).\n    \n    \n     §.§ Cuboid generalization\n    \n    Here, we explain how to generalize the results of this section to a cuboid metric d_X^ρ. A reader who is only interested in cube complexes with the standard ℓ^1 and ℓ^2 metrics is invited to skip ahead to Section <ref>. \n    \n    For the duration of this subsection, fix a G–admissible hyperplane rescaling ρ (Definition <ref>) and the resulting cuboid metric d_X^ρ. Recall that the cuboid Tits boundary ^ρ X = (X, d_X^ρ) was defined in Definition <ref>. All of the constructions and results involving ^ρ X will be invariant under the restricted automorphism group (X^ρ) of Definition <ref>.\n    \n    To start, we can define a map ψ^ρ^ρ X → X exactly as in Definition <ref>. Generalizing Lemma <ref>, we can characterize ψ^ρ(a) = ψ^ρ([α]) as the principal class of the umbra of a UBS representing a ray α:\n    \n        ψ^ρ(a) = ψ^ρ([α]) = Y_(α).\n    \n    This characterization holds because the proof of Lemma <ref> works for ψ^ρ: its proof combines previous lemmas and combinatorial properties of hyperplane sets. \n    \n    Now, consider a point y ∈ X. Since (X, d_X^ρ) is a CAT(0) space and the collection of half-spaces _y^+ is a filtering family, we can define the Tits boundary realization Q^ρ(y) exactly as in Definition <ref>. Following Lemma <ref>, whose proof extends to cuboids because cubical half-spaces are convex in d_X^ρ, we learn that the boundary realization Q^ρ(y) is also the boundary of a cubical interval, and depends only on the Roller class v = [y]. Thus we may define a Tits-convex set  Q^ρ(v) and its circumcenter χ^ρ(v), as in Definition <ref>. Following Corollary <ref>, both  Q^ρ(v) and χ^ρ(v) are invariant under the restricted automorphism group  (X^ρ).\n    \n    The partial order properties of the Tits boundary realization Q(v) that are proved in Lemmas <ref> and  <ref> still hold for Q^ρ(v), because the proofs of those results are essentially combinatorial.\n    The features of Q(v) described in  Proposition <ref> also hold for Q^ρ(v), because the proof of the Proposition uses prior results and the convexity of the cubical convex hull of a geodesic ray.\n    \n    \n    Next, Section <ref> contains several results about perturbing the circumcenter (v) ∈ Q(v) to a pseudocenter φ(v). The definition of the pseudocenter φ(v) is enabled by Lemmas <ref>, <ref>, and <ref>. All of these lemmas generalize immediately to the cuboid setting, because their proofs are essentially a top-level assembly of prior results. Thus we may generalize Definition <ref> to define a pseudocenter φ^ρ(v) ∈ Q^ρ(v). This pseudocenter φ^ρ(v) has all of the properties described in Proposition <ref>, because the proof of that proposition merely assembles previously established results.\n    \n    Finally, Definition <ref> generalizes immediately to define ^ρ(X) = ψ^ρ (^ρ X), the set of Roller classes that are visible after the rescaling ρ. Since ψ^ρ is ^ρ(X)–equivariant, the set ^ρ(X) is ^ρ(X)–equivariant as well. Lemmas <ref> and <ref> generalize immediately to the cuboid setting, because their proofs are top-level assemblies of previous lemmas.\n    \n    \n    \n    In Definition <ref>, the set (X) = ψ( X) is defined in terms of the CAT(0) metric on X.  When \n    we change the metric on X using a G–admissible rescaling ρ, there is no a priori reason to expect (X) \n    = ψ( X) to coincide with ^ρ(X) = ψ^ρ (^ρ X).  Instead, our whole argument simply goes \n    through for whichever of (X) or ^ρ(X) we are considering.\n    \n    In fact, it turns out that (X)=^ρ(X). Since we do not use this fact in any proofs, we only sketch a proof.  Let v∈(X) \n    be a visible Roller class, and let α:[0,∞)→ X be a CAT(0) geodesic ray for the metric _X with 𝒲(α) representing v.  We will produce a geodesic ray β for the CAT(0) metric _X^ρ, satisfying \n    𝒲(α)=𝒲(β), from which it follows that v∈^ρ(X).  This shows \n    (X)⊆^ρ(X), and a symmetric argument gives the reverse inclusion.\n    \n    Since cubical convexity of subcomplexes is independent of which CAT(0) metric we consider, we assume for convenience that \n    X is the cubical convex hull of α, i.e. 𝒲(α)=𝒲(X).\n    \n    First, use Lemma <ref> to produce chains {ĥ_n^1}_n,⋯,{ĥ^k_n}_n of dominant \n    hyperplanes such that there exists a constant C≥ 0 with the property that, for all j≤ k, any subpath of α \n    of length at least C crosses ĥ^j_n for some n.  The lemma allows us to choose these to be dominant hyperplanes in \n    the UBS 𝒲(α); therefore, if we construct a _X^ρ–geodesic β that crosses each h_n^j, then \n    by Lemma <ref>, we get 𝒲(α)=𝒲(β).\n    \n    By admissibility of the rescaling, there exists m≥ 1 such that the identity map (X,_X)→(X,_X^ρ) is \n    m–bilipschitz.  Since X is the convex hull of α and contains no facing triples, Lemma <ref> guarantees properness of \n    (X,_X) and implies properness of (X,_X^ρ).  Thus, letting β_t \n    be the _X^ρ–geodesic from α(0) to α(t), and letting t tend to infinity, the β_t subconverge \n    uniformly on compact sets to a _X^ρ–geodesic β with β(0)=α(0).\n    \n    Fix j≤ k.  Now, for any t, the hyperplanes crossing β_t are exactly those crossing α([0,t]).  Indeed, \n    any hyperplane separating α(0),α(t) crosses β_t, and any hyperplane crossing β_t does so in a single \n    point (and hence separates α(0),α(t)), since β_t is a _X^ρ–geodesic.  In particular, \n    α([0,t]) crosses h_1^j,…,h_N_t^j, where N_t=⌊ t/C⌋.  Hence β_t crosses the same \n    hyperplanes while having _X^ρ–length at most mt.  From this one deduces the following: there exists L such \n    that for all n, and all sufficiently large t, the path β_t crosses h^1_1,…,h^1_n and intersects each of \n    those carriers in a subpath of length at most L.  In other words, there is a uniform bound on how long each β_t can \n    fellow-travel any of the ĥ_n^j, whence β cannot be parallel to a ray in any ĥ^n_j.  This implies that \n    β must cross ĥ^j_n for all j,n, and hence, as explained above, 𝒲(β)=𝒲(α) and \n    v∈^ρ(X).\n    \n    Looking ahead to Definition <ref>,  the above argument also shows that (X) = ^ρ(X) for any \n    admissible rescaling ρ. In the next section, we will heavily use (X) to construct open and closed coverings of \n    X, so that the nerves of those coverings can be used to prove homotopy equivalence. In an analogous fashion, we will \n    use ^ρ(X) to construct open and closed coverings of ^ρ X.   One can then apply Lemma <ref> \n    and Lemma <ref> to show that the nerves of the coverings of X coincide with the nerves of the \n    corresponding coverings of ^ρ X, and one can use Lemma <ref> to see that the covering of \n    X coming from visible Roller classes of X coincides with the corresponding covering constructed using \n    visible classes of X^ρ.  However, as we mentioned, the cuboid version of our argument does not rely on this; one \n    instead just substitutes ^ρ(X) for (X) everywhere, and runs all the arguments.     \n    \n    \n    § OPEN AND CLOSED COVERINGS OF X\n    \n    In this section, we study the closed covering of X by the sets Q(v) corresponding to maximal  ℓ^2–visible Roller classes (see Definition <ref>). Our goal, achieved in Theorem <ref>, is to show that X is homotopy equivalent to the nerve _T of this cover.\n    \n    \n    Let (X) denote the set of Roller classes v such that:\n    \n      * v is ℓ^2–visible;\n         \n      *  if w is visible and v≤ w, then w=v.\n    \n    \n    The plan for this section is as follows. We will first show that {Q(v):v∈(X)} is a closed covering of X.  Then, we will thicken each closed set Q(v) to an open set U(v), in \n    such a way that the intersection pattern of the open cover {U(v) :v∈(X) } is the same as that of the closed cover {Q(v):v∈(X)}.  Then we will apply the Nerve Theorem to \n    conclude that X is homotopy equivalent to the nerves of these covers.\n    \n    The main result of this section is Theorem <ref>. Section <ref> is about the initial closed covering.  Section <ref> describes the thickening procedure. Section <ref> describes how to generalize these results to a cuboid metric d_X^ρ.\n    \n    \n    \n    \n     §.§ The closed covering\n    \n    The maximal visible Tits boundary realizations Q(v) provide a closed covering of the Tits boundary. We use this covering to define a nerve, as follows.\n    \n    \n    Let 𝒩_T be the simplicial complex with vertex set  (X), where vertices v_0,…,v_n∈(X) span an n–simplex if and only if ⋂_i=0^nQ(v_i)≠∅.\n    \n    Let v∈ X.  Then  there exists w∈(X) with φ(v)∈ Q(w).  \n    Hence \n    {Q(v):v∈(X)} covers X.\n    \n    Note that ψ( φ(v)) ∈(X), by Definition <ref>.\n    Hence there exists w∈(X) such that ψφ(v) ≤ w.  \n    \n    By Lemma <ref>, φ(v) ∈ Q(ψφ(v))⊂ Q(w).\n    \n    Now, given a point a∈ X, we can apply the above argument to v=ψ(a).  Then, for some w∈(X), Lemma <ref> implies\n    \n        a∈ Q(ψ(a))=Q(ψφψ(a))  ⊂ Q(w) .\n    \n    Hence {Q(v):v∈(X)} covers \n    X.\n    \n    Let v,w∈(X).  Then Q(v)=Q(w) if and only if v=w. In particular, the assignment v ↦ Q(v) gives a bijection from (X) to its image.\n    \n    Suppose Q(v) = Q(w). Then Proposition <ref>.<ref> implies φ(v)=φ(w). By visibility and Lemma <ref>, we have ψφ(v)=v and ψφ(w)=w, hence v=w.\n    \n    \n    Now, Lemmas <ref> and <ref> combine to yield:\n    \n    𝒩_T is the nerve of the covering of X by the collection of closed sets {Q(v):v∈(X)}.\n    \n    \n     §.§ The open covering\n    \n    The goal of this subsection is to thicken up the closed sets Q(v) for v ∈(X) to be open sets U(v), such that the \n    intersection pattern of the U(v) is the same as that of the Q(v). This is needed since the Nerve \n    Theorem <ref> works for open covers only.\n    \n    \n    \n    Let v,w∈(X) be points such that Q(v)∩ Q(w)=∅. Then\n     _T(Q(v),Q(w))> ϵ_0, where ϵ_0 > 0 is a constant depending only on X.\n     \n    Let a∈ Q(v) and b∈ Q(w).  By definition, a∈ Q(ψ(a)).  Since \n    v≥ψ(a), we have Q(ψ(a))⊂ Q(v) and \n    similarly Q(ψ(b))⊂ Q(w), by Lemma <ref>. Since we have assumed Q(v)∩ Q(w)=∅, it follows that  Q(ψ(a))∩ \n    Q(ψ(b))=∅.\n    \n    Choose CAT(0) geodesic rays α,β such that \n    α(0)=β(0) ∈ X^(0) and α(∞)=a, β(∞)=b.\n    \n    Since X is finite-dimensional, Lemma <ref> provides  ℓ^1 geodesic rays \n    α̅, β̅ with common basepoint α(0)=β(0), that lie at \n    uniformly bounded  Hausdorff distance from α,β respectively.\n    Note that \n    (α) ∼(α̅) and (β) ∼(β̅).\n    \n    We claim that (α̅)∩𝒲(β̅) is finite. Suppose not. By Lemma <ref>, Q(ψ(a)) = _α̅, where _α̅ = (α̅(0), α̅(∞))  is the cubical convex hull of α̅. Similarly, \n    Q(ψ(b)) = _β̅.\n    \n    Since C=_α̅∩_β̅≠∅, we have\n    (C) = (α̅)∩(β̅) by Lemma <ref>.<ref>.\n    Now _α̅ is a proper CAT(0) space, by Lemma <ref>. Thus C is also a proper CAT(0) space, hence |(C)| = ∞ implies C is unbounded and \n    C is a nonempty subspace of Q(ψ(a)).  Similarly, C is a nonempty subspace of Q(ψ(b)).  Thus C  ⊂ Q(ψ(a)) ∩ Q(ψ(b)) = ∅, a contradiction. This proves the claim.\n    \n    Since (α) ∼(α̅) and (β) ∼(β̅), we may define\n     N = |(α) ∩(β)| < ∞. Recall that α(0) = β(0).\n    Then, for all t ≥ 0, we have\n    \n        | ( α(t) , β(t) ) | ≥ | ( α(t) , α(0))| + |(β(0), β(t) ) | - 2N.\n    \n    Applying Lemma <ref> to both sides gives\n    \n        λ_0 · d_X(α(t), β(t) )+ λ_1 ≥(  t/λ_0 - λ_1 ) + (  t/λ_0 - λ_1 ) - 2N = 2t/λ_0 - 2(N + λ_1).\n    \n    Here, λ_0 ≥ 1 and λ_1 are constants depending only on X. Taking limits gives \n        lim_t→∞_X(α(t),β(t))/2t≥1/λ_0^2.\n      \n    \n    By <cit.>, we thus have  sin(∠_T(a,b)/2)≥1/λ_0^2.  Now,\n    \n        _T(a,b) ≥∠_T(a,b)  ≥sin^-1(1/λ_0^2) >1/λ_0^2.\n      \n    Setting  ϵ_0 = 1/λ_0^2  completes the proof.\n    \n    \n    In the next lemma, we show that, given a collection of Roller classes, the intersection of the associated Tits boundary realizations \n    coincides with the Tits boundary of the intersection of the convex hulls of the corresponding CAT(0) geodesic rays.\n    \n    \n    Let v_1, …, v_k ∈(X) be Roller classes. Then there exist convex subcomplexes \n     _1, …, _k ⊂ X such that the following holds. Each _i is the cubical convex hull \n    of a CAT(0) geodesic ray γ_i, with a common basepoint.\n     Furthermore,\n    for every subset J ⊂{1, …, k}, we have ⋂_i ∈ J Q(v_i) = (⋂_i∈ \n    J_i).\n    \n    Fix a basepoint x∈ X^(0).  For 1≤ i≤ k, let _v_i X→ v_i be the gate map of Proposition <ref>, and let y_i= _v_i (x). \n    Let _i=(x,y_i) be the \n    convex subcomplex of X determined by the vertex \n    interval between x and y_i as in Definition <ref>. Then (_i) = (x, y_i) = (x,v_i), where the last equality holds by Proposition <ref>.\n     By Lemma <ref>, Q(v_i)=_i.\n    \n    For each i, let γ_i be a CAT(0) geodesic ray that emanates from x and represents \n    φ(v_i). \n    We want to show that _i = (γ_i), the cubical convex hull of γ_i.\n    \n    First, we claim that (γ_i) ⊂_i. Since _i is convex in the CAT(0) metric d_X, it contains a CAT(0) geodesic from every point in the interior to every point on the boundary. In particular, it contains the unique CAT(0) geodesic γ_i from γ_i(0) = x∈_i to \n    γ_i (∞)  ∈ Q(v_i) = _i. Thus γ_i ⊂_i. Since _i is cubically convex, it follows that (γ_i) ⊂_i.\n    \n    \n    Next, we claim that _i ⊂(γ_i), or equivalently (_i) ⊂(γ_i).  Since γ_i(0)=x ∈_i, any hyperplane ĥ∈(𝒥_i) ∖𝒲(γ_i) would separate the entire ray γ_i from \n    the entire class v_i, contradicting that ψ(γ_i(∞))=ψ(φ(v_i))=v_i, where the second equality  holds by visibility and Lemma <ref>.  Hence (_i) ⊂(γ_i), \n    and we conclude that _i = (γ_i).\n    \n    Finally, consider an arbitrary subset  J ⊂{1, …, k}. The inclusion (⋂_i∈ \n    J_i) ⊂⋂_i∈ IQ(v_i) is immediate. For the other inclusion, \n    let \n    b ∈⋂_i∈ JQ(v_i). Then each convex set _i contains the unique CAT(0) ray β starting at \n    x and ending at b.\n    Thus β⊂⋂_i∈ J_i, hence b ∈(⋂_i∈ \n    J_i).\n    \n    The following related statement about ℓ^1 geodesics can be proved by an easier analogue of the proof of Lemma <ref>.\n    \n    Let v_1, …, v_k be arbitrary Roller classes. Then there exist convex subcomplexes  _1, …, 𝒥_k (defined in exactly the same way, namely  _i=(x,  _v_i (x)) such that each  (_i) is a UBS representing \n    v_i. Furthermore, each _i is the cubical \n    convex hull of a combinatorial geodesic, with a common basepoint. The intersection ⋂_i _i itself has the \n    property that ( ⋂_i _i) = ⋂_i ( _i). In particular, if \n    ( ⋂_i _i) is infinite, then it is an ℓ^1–visible UBS.\n    \n    \n    The next lemma is crucial.  We will later replace the closed covering of X by Tits boundary realizations with an open covering, by \n    slightly thickening each Tits realization.  The lemma says, roughly, that for a collection of Tits boundary realizations corresponding to a \n    simplex in the nerve of the closed covering, any point in the intersection of small ϵ–neighborhoods of the Tits boundary realizations is still in \n    a f(ϵ)–neighborhood of the intersection of the Tits boundary realizations.\n    \n    \n    There exists a constant ϵ_1>0, depending on (X), and a function f  (0,ϵ_1)→(0,π/2) such that lim_ϵ→ 0 f(ϵ) = 0 and \n    such that the following holds.  Fix ϵ∈(0,ϵ_1) and let v_0,…,v_k∈(X) satisfy \n    ⋂_i=0^kQ(v_i)≠∅.  For every a∈ X such that _T(a,Q(v_i)) ≤ϵ for all \n    i, there is a point b ∈⋂_i=0^kQ(v_i) such that\n    _T(a, b) ≤ f(ϵ).\n    \n    We begin by defining the constant ϵ_1 and the function f  (0,ϵ_1)→(0,π/2). Let \n    λ_0, λ_1 be the constants of Lemma <ref>, which depend only on (X). Define K = 4 λ_0^2  (X). Then, we set \n    \n        ϵ_1 = 4/5K,     \n        f(ϵ)  = cos^-1(1 - K ϵ) ≤cos^-1 (15) < π2.\n    \n    The bound f(ϵ) ≤cos^-1(1/5) holds because K ϵ < K ϵ_1 = 4/5. The property lim_ϵ→ 0 f(ϵ) = 0 is now immediate.\n    \n    Plan of the proof.\n    Let v_0,…,v_k∈(X) be Roller classes such that \n    ⋂_i=0^kQ(v_i)≠∅.\n    By Lemma <ref>, there exist convex subcomplexes _0,…,_k such that ⋂_i = 0^k Q(v_i)=(⋂_i= 0^k _i). Choose  a basepoint x ∈⋂_i= 0^k _i. \n    \n    Fix ϵ < ϵ_1, and let a∈ X be a point such that _T(a,Q(v_i)) ≤ϵ for all i. Let α[0,∞)→ X be a CAT(0) geodesic ray, such that α(0) = x and α(∞) = a. To prove the lemma, we will find a point b∈⋂_i=0^kQ(v_i) such that d_T(a, b) ≤  f(ϵ).\n    \n    We locate the point b using gate projections. Let X →⋂_i=1^k _i be the gate map.\n     For t ≥ 0, let x_t = (α(t)). Since ⋂_i=0^k_i is a finite-dimensional CAT(0) \n    cube complex with no facing triple of hyperplanes, it is  proper by \n    Lemma <ref>. We will check that the sequence {x_t}_t∈ is unbounded.\n      Thus the segments joining x_0 to the elements of {x_t}_t∈ \n    subconverge uniformly on compact sets to a CAT(0) geodesic ray representing some point b∈⋂_i=0^k Q(v_i).\n    \n    To prove that d_T(a, b) ≤ f(ϵ), we will estimate the Alexandrov angle at x = α(0) between α(t) and x_t. In order to do this, we will control the number of hyperplanes that separate α(t) from ⋂_i=0^k _i. \n    \n    Main hyperplane estimate. For each t ≥ 0, let (t) be the set of hyperplanes that separate α(t) from \n    ⋂_i=0^k_i. We will prove the following double-sided estimate for all large t:\n    \n        1/λ_0_X(α(t),x_t) - λ_1 ≤| (t)|≤(X)  (λ_0 · 2 t ϵ + λ_1) + D,\n    \n    where D is a constant independent of t.\n    \n    The lower bound of (<ref>) is straightforward.  By Lemma <ref>, the gate map X→⋂_i = 0^k _i  is characterized by the property that a \n    hyperplane ĥ separates \n        α(t) from x_t = (α(t)) if and only if ĥ separates α(t) from ⋂_i=0^k_i.  \n       In other words, (t) = (α(t), x_t).\n         Hence Lemma <ref> gives\n    \n        1/λ_0 d_X(α(t),x_t) - λ_1 ≤ |(t)| ,\n    \n    as desired. By contrast, the upper bound requires some hyperplane combinatorics.\n    \n    \n    Hyperplane sets. \n    For each i, let ℬ_i(t) be the set of hyperplanes that separate α(t) \n    from _i.  Note that (t)⊃⋃_i=0^kℬ_i(t). We claim that (t)=⋃_i=0^kℬ_i(t).\n    \n    Suppose that ĥ∈(t) ∖⋃_i=0^kℬ_i(t).  Then ĥ crosses each _i, so by a standard cubical \n    convexity argument, ĥ crosses ⋂_i=0^k_i and hence cannot separate any point from ⋂_i=0^k_i.  This is \n    a contradiction, and thus (t)=⋃_i=0^kℬ_i(t). \n    \n    Let 𝒜_0(t)=ℬ_0(t). For i ≥ 1, let 𝒜_i(t)=ℬ_i(t) ∖⋃_j < i𝒜_j(t).  Then the \n    sets 𝒜_0(t),…,𝒜_k(t) are pairwise disjoint, and their union is (t).  For each i, let 𝒜_i = ⋃_t ≥ 0𝒜_i(t).\n    Observe that every 𝒜_i is inseparable, by definition. \n    Furthermore, 𝒜_i is unidirectional. Indeed, 𝒜_i ⊂ℬ_i =  ⋃_t ≥ 0ℬ_i(t), and ℬ_i separates _i from the tail of the ray \n    α. Unidirectionality passes to subsets, hence 𝒜_i is unidirectional.\n     Consequently 𝒜_i is either finite or a UBS.\n    \n    \n    \n    \n    Let J⊂{0,…,k} be the set of i such that 𝒜_i is a UBS. Observe that 𝒜_i  ∩𝒜_j = ∅ for i ≠ j and _i ∈ J𝒜_i ⊂(α), which is itself a UBS. Thus, by Lemma <ref>, we have |J| ≤(X).\n     We define D = ∑_i ∉ J | 𝒜_i |. \n    \n    The upper bound of (<ref>). \n    Next, we will use the decomposition (t) = _i=1^k 𝒜_i(t) to prove the upper bound  of (<ref>).\n    \n    For each i ∈{0, …, k}, let ξ_i be a ray in _i issuing from x = α(0), such that ξ_i(∞) is a closest point in \n    Q(v_i) = _i to a.  \n    Now, for all i and all t, any hyperplane ĥ∈𝒜_i(t) separates α(t) from _i and hence separates α(t) from \n    ξ_i(t).  Thus Lemma <ref> gives\n    \n        |𝒜_i(t)| ≤ |(α(t),ξ_i(t))| ≤λ_0 · d_X (α(t), ξ_i(t)) + λ_1.\n     \n    \n    Now, by <cit.>, for any δ>0 there exists t_0 such that for all t>t_0, \n    we have _X(α(t),ξ_i(t))≤ t(2sinϵ/2+δ).  Since ϵ is independent of t, it follows that \n    for all sufficiently large t,  we have \n    \n        _X(α(t),ξ_i(t))≤ 4tsinϵ2 < 2 t ϵ.\n      \n    \n    \n    Summing |𝒜_i(t)| over all i  gives\n    \n        | (t) |    = ∑_i∈ J|𝒜_i(t)| + ∑_i∉ J|𝒜_i(t)| \n           ≤∑_i ∈ J( λ_0 · d_X (α(t), ξ_i(t)) + λ_1 ) + ∑_i ∉ J | 𝒜_i | \n           ≤  |J| (λ_0 · 2 t ϵ + λ_1) + D,\n    \n    which proves (<ref>) because |J| ≤(X). \n    \n    \n    Angle estimate.\n    Let x=α(0).  Set A = _X(α(0), α(t))=t (latter equality since α is a geodesic), and B = _X(α(0), x_t), and C = _X(α(t), x_t).  Let θ̅_t \n    be the Euclidean angle at the vertex corresponding to x in the Euclidean comparison triangle with sides of length A,B,C, i.e. the comparison angle between α(t) and x_t at x.  Let \n    θ_t be the Alexandrov angle at x = α(0) between x_t and α(t), so that θ_t≤θ̅_t.   \n    \n    We can estimate θ̅_t using the law of cosines, starting with an estimate of C. Multiplying every term of (<ref>) by λ_0 and choosing t sufficiently large yields\n    \n        C = d_X(α(t), x_t) ≤ 4 λ_0^2 (X) ·ϵ t = K ϵ t.\n    \n    Meanwhile, B can be estimated as follows:\n    \n        t(1-K ϵ) \n         ≤_X(α(0),α(t))-_X(α(t),x_t))\n        ≤_X(α(0),x_t) = B ≤ t.\n    \n    Here, the first inequality is by (<ref>), the second inequality is the triangle inequality, and the final inequality \n    holds because the projection  is 1–Lipschitz for the CAT(0) metric by Lemma <ref>.  \n    \n    \n    \n    By  the cosine law and the CAT(0) inequality, we have\n    \n    \n        2 AB cos(θ_t) ≥ 2AB cos(θ̅_t)=A^2 + B^2 - C^2.\n    \n    The equality is the cosine law applied to the Euclidean comparison triangle, and the inequality holds for the corresponding CAT(0) triangle.  We are interested in the former, since we will need a \n    bound on θ̅_t (which will incidentally bound θ_t).\n    Substituting the bounds (<ref>) and (<ref>) into the cosine law shows that for all large t, we have\n    \n        2t^2cosθ̅_t  ≥  t^2+t^2(1-K ϵ)^2- t^2 (Kϵ)^2,\n    \n    which simplifies to\n    cosθ̅_t ≥ \n    1-K ϵ. Since we have chosen ϵ∈ (0, 45K ), this ensures that θ̅_t is a small angle; more precisely θ̅_t ≤cos^-1( 1- K ϵ).\n    \n    Conclusion. \n    Since K ϵ < 4/5, equation (<ref>) implies \n    d_X(α(0), x_t) ≥ (1-K ϵ) t > 1/5 t.\n    Thus the sequence {x_t}_t∈ is unbounded,\n    and some subsequence converges to a point b∈⋂_i=0^kQ(v_i), as mentioned above.\n    By <cit.>, which relates the Tits angle ∠(a,b) to the Euclidean comparison angles θ̅_t, we have \n    \n        ∠(a,b)≤liminf_t→∞θ̅_t ≤cos^-1 (1 - K ϵ) = f(ϵ).\n    \n    Since we have already checked that f(ϵ) < π/2, this ensures  \n     ∠(a,b) ≤ f(ϵ)<π/2.  In particular, _T(a,b)=∠(a,b) ≤ f(ϵ).\n    \n    \n    \n    Recall from Proposition <ref>.(<ref>),(<ref>) that for each v∈(X), there is a radius r_v<π/2 such that Q(v) is contained in the closed ball \n    B̃_T((v), r_v) in the Tits metric.\n    \n    \n    Let ϵ_0 be the constant of Lemma <ref>. Let f  (0, ϵ_1) → be the function from Lemma <ref>.  Since lim_ϵ→ 0 f(ϵ) = 0, that lemma allows us to \n    choose a constant ϵ_2 < ϵ_1, depending  only on (X), so that f(ϵ)+ϵ≤ϵ_0 whenever \n    ϵ≤ϵ_2.  \n    For each Roller class w, define a thickening constantϵ(w) = min{ϵ_0/2 ,ϵ_2, r_w/4} > 0.\n    \n    Since the constants ϵ_0, ϵ_2 depend only on (X), and the intrinsic radius r_w depends only on the (X)–orbit of w by Corollary <ref>,\n    it follows that ϵ(w) itself depends only on the the (X)–orbit of w.\n    \n    For every v∈(X), there exists a subset U(v)⊂ X such that the following \n    hold:\n    \n      * Q(v)⊂ U(v)⊂𝒩_ϵ(v)(Q(v));\n      * U(v) has diameter less than 3π/4; \n     \n      * U(v) is open;\n      * U(v) is convex and contractible;\n     \n      * U(gv) = gU(v) for all g ∈(X).\n    \n    Let Y be the Euclidean cone on X, with cone-point denoted 0.  \n    By <cit.>, the usual cone metric _Y on Y has the \n    property that (Y,_Y) is a CAT(0) geodesic space.  We use the notation ν_δ(A) to denote the open δ–neighborhood of a set A ⊂ Y in this CAT(0) metric.\n    \n    We identify X \n    with the unit sphere about 0 in Y. We also set Q = Q(v) for simplicity of notation. Recall from Proposition <ref>.(<ref>) that the intrinsic radius of Q is r_v \n    ∈ [0, π/2).\n    \n    The convex sub-cone Z = Z(v):  Let Z⊂ Y be the subspace arising as the union of all rays in Y \n    emanating from 0 and passing through Q⊂ X.  We claim that \n    Z is convex in (Y,_Y).  Indeed, let x,y∈ Z. Then x,y \n    respectively lie on rays α_x,α_y emanating from 0 and intersecting Q \n    in points x',y'.  By <cit.>, the rays α_x,α_y determine a convex sector S ⊂ Y \n    intersecting X in the unique Tits geodesic from x' to y', which lies in \n    Q by Tits convexity of Q.  Hence S lies in Z, and thus so does \n    the _Y–geodesic from x to y, since x,y∈ S.\n    \n    The horoball B = B(v):  Let  c=(v) be the circumcenter of Q = Q(v). Let α =α_c be the parametrized geodesic ray in Y such that α(0)=0 and α(1)=c.  Let p  Y→ be the associated \n    horofunction, defined by \n    \n        p(y)=lim_s→∞[_Y(α(s),y)-s] .\n     \n    Let \n    t_0=cos r_v, which is positive since r_v∈[0,π/2).\n    \n    Let B = B(v)=p^-1((-∞,-t_0]).  Recall from e.g. <cit.> that B is a convex \n    subset of Y.  Let K(v)=B∩ Z. See Figure <ref>.\n    \n    \n    Q lies in K(v):  We claim that Q⊂ K(v).  Since Q is the unit sphere in Z by the definition of Y and Z, \n    it suffices to show that Q⊂ B.  To that end, fix q∈ Q, and observe that \n    _Y(q,0)=1.  Let s≫ 0 and consider the convex Euclidean triangle in Y with vertices at 0,q,α(s).  The angle in this triangle at 0 is denoted \n    θ, and we note that θ≤ r_v.  From the cosine law, we obtain \n    _Y(q,α(s))^2=s^2+1-2scosθ.  Hence \n    \n        p(q)=lim_s→∞[√(s^2+1-2scosθ)-s]=-cosθ≤ - cos r_v = - t_0.\n    \n    Thus, by the definition of B, we have q∈ B, as \n    required.  Since Z∩ X=Q, we have in fact shown that K(v)∩ \n    X=Q. \n    \n    K(v) satisfies d(0,K(v)) = t_0:  We claim that K(v) is disjoint from the open t_0–ball in Y about \n    0.  Indeed, let b∈ K(v).  Then p(b)≤ -t_0.  Hence, for any fixed \n    δ>0, and any sufficiently large s>0, we have \n    _Y(b,α(s))<s-t_0+δ.  By the triangle inequality, s≤_Y(0,b)+s-t_0+δ, i.e. _Y(0,b)>t_0-δ.  Hence \n    _Y(b,0)≥ t_0, as required.  At the same time, α = α_c is a parametrized geodesic ray and α(t_0) is a point of K(v) at distance exactly t_0 from 0, hence d(0,K_v) = t_0.\n    \n    \n    The projection ϖ and the open set U'(v):  Let ϖ:Y ∖{0}→ X be the radial projection. Recall that ν_ρ(0) is the open ρ–neighborhood of 0. \n    We claim that for every 0 < ρ≤ 1, the restriction of ϖ to  Y ∖ν_ρ(0) is 1/ρ–Lipschitz. Indeed,  by <cit.>, it suffices to check this claim on a sector of ^2. In polar coordinates on ^2, the distance element ds satisfies ds^2 = dr^2 + r^2 dθ^2, hence the projection ϖ rescales ds by a factor of at most r^-1, hence ϖ is 1/ρ–Lipschitz when r ≥ρ. \n    \n    Recall the constant ϵ(v) defined in Definition <ref>, and define a positive constant \n    \n        ϵ' = ϵ'(v) = ϵ(v) /1 + ϵ(v) t_0 ∈ (0, t_0),\n          which satisfies  ϵ'/t_0 - ϵ' = ϵ(v).\n    \n    Let U'(v) = ν_ϵ' (K(v)) be the open ϵ'–neighborhood \n    of K(v) in Y.  Since K(v) = B ∩ Z is convex and Y is CAT(0), it follows that U'(v) is convex. Furthermore, U'(v) is open and disjoint from the ball of radius t_0 - ϵ' about \n    0.  See Figure <ref>.\n    \n    Definition and properties of U(v):\n    Let U(v)=ϖ(U'(v))⊂ X. We claim that this has all of the properties claimed in the lemma statement. First, since Q(v) ⊂ K(v) by construction, and ϖ is the identity map on X ⊂ Y, it follows that Q(v) = ϖ(K(v))⊂ U(v).\n    On the other hand, since d(0, U'(v)) ≥ t_0 - ϵ',  the projection ϖ is 1/(t_0 - ϵ')–Lipschitz on U'(v). Therefore, (<ref>) implies\n    \n        U(v) = ϖ(ν_ϵ' (K(v)) ) ⊂ν_ϵ(v) (ϖ(K(v))) =  ν_ϵ(v) (Q(v)),\n    \n    proving the first bullet of the lemma.\n    \n    Second, recall from Definition <ref> that ϵ(v) ≤ r_v / 4. Thus Proposition <ref>.(<ref>) implies\n    \n        (U(v)) ≤(Q(v)) + 2ϵ(v) ≤π/2 + r_v/2 < π/2 + π/4 = 3π/4.\n    \n    \n    Third, observe that ϖ is an open map.  Indeed, \n    Y ∖{0} is homeomorphic to X×(0,∞), and ϖ is \n    projection to the first factor, which is an open map. Thus U(v) = ϖ(U'(v)) is open.\n    \n    Fourth, it follows from <cit.> and the convexity of U'(v)  that U(v) is convex in X. Since U(v) has diameter less than π, it is uniquely geodesic, hence contractible.\n    \n    Fifth, observe that all of the ingredients in the definition of U(v) are (X)–equivariant. Indeed, the intrinsic radius r_v is invariant under (X), hence the number t_0 = cos(r_v) is as well. Thus the definitions of the sub-cone Z(v), the horoball B(v), and the set K(v) = Z(v) ∩ B(v) are all (X)–equivariant. The constant ϵ'(v), defined in (<ref>) is invariant under (X), because both t_0 and ϵ(v) are. It follows that U(v) = ϖ(ν_ϵ' (K(v)) ) is also (X)–equivariant.\n    \n    \n    Recall that in Section <ref>, we have defined a simplicial complex 𝒩_T.\n    By Corollary <ref>, 𝒩_T coincides with the nerve of the cover of X by the closed sets Q(v)  for v ∈ (X). By Lemmas <ref> and <ref>,  the open sets U(v) for v ∈ (X) also cover X. \n    \n    By analogy with Definition <ref>, we define a simplicial complex 𝒞_T with vertex set X, where vertices v_0, …, v_n ∈ X span an n–simplex if and only if ⋂_i=0^n U(v_i)≠∅.\n    The content of the following lemma is that 𝒞_T is isomorphic to 𝒩_T.\n     \n    \n    \n    \n    For Roller classes v_0, …,v_n ∈(X), we have ⋂_i=0^n U(v_i)≠∅ if and only if \n    ⋂_i=0^n Q(v_i)≠∅. Consequently, the identity map (X) →(X) induces an (X)–equivariant simplicial isomorphism 𝒞_T  →𝒩_T.\n    \n    Observe that ⋂_i=0^n Q(v_i)≠∅ trivially implies ⋂_i=0^n U(v_i)≠∅. \n    For the other direction, we assume ⋂_i=0^n U(v_i) ≠∅ and aim to show ⋂_i=0^n Q(v_i)≠∅. \n    \n    We will argue by induction on n. \n    \n     In the base case, n=1, suppose that U(v_0) ∩ U(v_1) ≠∅. Since U(v_i) ⊂𝒩_ϵ(v_i)(Q(v_i)), and ϵ(v_i) ≤ϵ_0/2 by Definition <ref>, it follows that there are points a_i ∈ Q(v_i) such that d_T(a_0, a_1) < ϵ_0. But then Lemma <ref> implies Q(v_0) ∩ Q(v_1) ≠∅, proving the base case.\n    \n    For the inductive step, assume that ⋂_i=0^n U(v_i) ≠∅ and\n    ⋂_i=0^n-1Q(v_i)≠∅. We claim that there is a Roller class w ∈(X) such that ⋂_i=0^n-1Q(v_i)=Q(w).\n    \n    By Lemma <ref>, we have convex subcomplexes _0, …, _n-1⊂ X, such that Q(v_i) = _i \n    and ⋂_i=0^n-1Q(v_i) = ⋂_i=0^n-1_i. By Lemma <ref>, the hyperplane \n    collection (_i) is a UBS. Furthermore, since each _i is convex, we have (⋂_i) \n    = ⋂(_i), which is a UBS because ⋂_i is unbounded. By Lemma <ref>, the \n    UBS (⋂_i) represents a Roller class w', which means that  \n    Q(w') =  ⋂_i=0^n-1_i = ⋂_i=0^n-1Q(v_i). Now, we let w = ψ(φ(w')). Then \n    Definition <ref> says that w ∈(X), and Proposition <ref>.<ref> says that \n    Q(w) = Q(w') = ⋂_i=0^n-1Q(v_i), proving the Claim.\n    \n    Next, we claim that Q(v_n)∩ Q(w) ≠∅. Since Q(w) = ⋂_i=0^n-1Q(v_i), this will complete the inductive step and prove the Lemma.\n    \n    Suppose for a contradiction that Q(v_n)∩ Q(w) = ∅. Then, by Lemma <ref>, we have\n    _T(Q(v_n),Q(w))>ϵ_0.  Let ϵ_2 be as in Definition <ref>.\n    Fix a∈⋂_i=0^n U(v_i) ⊂⋂_i=0^n𝒩_ϵ(v_i)(Q(v_i)), which ensures that _T(a,Q(v_n))<ϵ_2.  Since ϵ(v_i) ≤ϵ_2 for each v_i,  \n    Lemma <ref> implies _T(a,Q(w))<f(ϵ_2).  \n    Thus _T(Q(v_n),Q(w))<ϵ_2+f(ϵ_2) ≤ϵ_0, a contradiction.  This proves the Claim and the equivalence ⋂_i=0^n Q(v_i)≠∅⇔⋂_i=0^n U(v_i)≠∅.\n    \n    This gives the simplicial isomorphism 𝒞_T →𝒩_T. This isomorphism is (X)–equivariant, by Corollary <ref> \n    and Proposition <ref>.\n    \n    \n     §.§ Homotopy equivalence of X and 𝒩_T\n    \n    There is an  homotopy equivalence from  the simplicial complex 𝒩_T to X. \n    By Corollary <ref>, 𝒩_T is the nerve of the covering of X by the closed sets Q(v), where v varies over \n    (X).\n    \n    By Proposition <ref>, X admits an open covering { U(v) : v∈(X) }, with each U(v) a \n    convex, uniquely geodesic subspace of X.  Hence, if v_0,…,v_n∈(X), then either \n    ⋂_i=0^nU(v_i)=∅, or ⋂_i=0^nU(v_i) is contractible. Let ℒ_T be the nerve of this open covering. By the Equivariant Open Nerve Theorem <ref>,\n    there is an  homotopy equivalence ℒ_T → X.\n    \n    As above, let 𝒞_T be the simplicial complex with one vertex for each v∈(X), with v_0,…,v_n spanning an \n    n–simplex whenever ⋂_i=0^nU(v_i)≠∅.  Note that 𝒞_T is not necessarily isomorphic to ℒ_T, since we may have U(v_i)=U(v_j) for some pair v_i,v_j with i≠ j.  But 𝒞_T is \n    homotopy-equivalent to ℒ_T, which can be seen as follows.  The (X)–equivariant assignment \n    v↦ U(v) (i.e. the surjection 𝒞_T^(0)→ℒ_T^(0)) determines an equivariant simplicial map 𝒞_T →ℒ_T such that the preimage of each 0–simplex U(v) is the full subcomplex of 𝒞_T spanned by the set of w \n    with \n    U(v)=U(w).  Since any finite set of such w span a simplex of 𝒞_T, this preimage is contractible: it is \n    homeomorphic to the cone on the link of any of its vertices.  Hence the map 𝒞_T →ℒ_T is a homotopy \n    equivalence, by Quillen's fiber theorem (see e.g. <cit.>).\n    \n    To conclude, recall that by Lemma <ref>, we have an equivariant simplicial isomorphism 𝒞_T →𝒩_T. Hence we have a chain of  homotopy equivalences\n    \n        𝒩_T  𝒞_T ℒ_T  X.\n    \n    \n     §.§ Cuboid generalization\n    \n    \n    All of the results of this section have a straightforward generalization to the cuboid setting. In the following description, we refer to the notation introduced in Section <ref>.\n    \n    Definition <ref> generalizes immediately to give a set of maximal ℓ^2 visible Roller classes, namely ^ρ(X) ⊂^ρ(X). Following Definition <ref>, we get a simplicial complex _T^ρ with vertex set ^ρ(X), where vertices v_0, …, v_n span an n–simplex if and only if ⋂_i=1^n Q^ρ(v_i) ≠∅. Then, Lemmas <ref> and <ref> generalize immediately because their proofs are assembled from the results of Section <ref>, and we have already checked that those results generalize to cuboids. Thus Corollary <ref> generalizes as well, and we learn that _T^ρ is the covering of ^ρ X by the closed sets {Q^ρ(v) : v ∈^ρ(X) }.\n    \n    (Recall that Remark <ref> outlined an argument that (X) = ^ρ(X) for every admissible rescaling \n    ρ. It follows that (X) = ^ρ(X) as well.  The nerves _T and _T^ρ can then be \n    shown to coincide, as mentioned in Remark <ref>. However, we do not use this.)\n    \n    Moving ahead to Section <ref>, the results generalize as follows. The existence statement of Lemma <ref> extends, with the modification that the constant ϵ_0 depends on (X) and ρ. This is because the proof of Lemma <ref> uses the constants λ_0, λ_1 of Lemma <ref>, which needs to be replaced by the constants λ_0^ρ, λ_1^ρ of Lemma <ref>. Lemma <ref> extends to cuboids as well, because the proof of that lemma uses combinatorial arguments in combination with the d_X^ρ–convexity of cubical convex hulls.\n    Similarly, Lemma <ref> extends: its proof works perfectly well in the cuboid metric d_X^ρ, once we substitute Lemma <ref> for Lemma <ref>. As above, the outputs of that lemma depend on both (X) and ρ. Combining these ingredients, we can follow Definition <ref> to define a thickening constant ϵ^ρ(w) > 0 for every Roller class w. This constant depends only ρ and the ^ρ(X)–orbit of w.\n    \n    Proposition <ref> extends verbatim to cuboids. Indeed, its proof is a CAT(0) argument that takes place in the Euclidean cone on X, which works equally well in the Euclidean cone on ^ρ X. (The proof also uses Proposition <ref>, which works for cuboids.) At the end of the lemma, we get a collection of open sets U^ρ(v) for v ∈^ρ(X), which is invariant under ^ρ(X).\n    \n    By analogy with Definition <ref>, we define a simplicial complex 𝒞_T^ρ, where the simplices are defined by intersection patterns of the open sets U(v_i) for v_i ∈^ρ(X). Now, Lemma <ref> extends verbatim to give an ^ρ(X)–equivariant simplicial isomorphism 𝒞_T^ρ→_T^ρ. The proof of Theorem <ref> also extends verbatim, because all of its ingredients extend. Thus we obtain the following cuboid extension of \n    Theorem <ref>:\n    \n    \n    Let ρ be a G–admissible hyperplane rescaling of X. Then there is a  homotopy homotopy equivalence _T^ρ→^ρ X. \n    \n    \n    § PROOF OF THE MAIN THEOREMS\n    \n    \n     In this section, we prove Theorem <ref>, which was stated in the Introduction. That is, we construct the following commutative diagram of  homotopy equivalences:\n     X       ^       X  \n       _      _   \n          _ X      \n    \n    The homotopy equivalence X → X will be proved in Proposition <ref>, while the homotopy equivalence X → X will be proved in Corollary <ref>. At the end of the section, we check that all of the arguments extend to cuboids, proving Theorem <ref>.\n    \n    To prove Corollary <ref>, we first study a subcomplex of X.  \n    \n    \n    Let X be the  subcomplex of X consisting of all simplices corresponding to chains \n    v_0≤⋯≤ \n    v_n such that v_i∈(X) for 0≤ i≤ n. \n    \n    For each v∈(X), let Σ_v be the connected subcomplex of X consisting of all simplices \n    corresponding to \n    chains v_0≤⋯≤ v_n for which:\n    \n      *  each v_i∈(X);\n         \n      * v_n = v.\n    \n    \n     §.§ Closed cover of X\n    \n    \n    Next, we show that the complexes Σ_v yield a closed covering of X, and use this covering to build a nerve.\n    \n    \n    The set {Σ_v:v∈(X)} is a closed covering of X.  Moreover, for all \n    v,v_0,…,v_n∈(X), we have the following:\n    \n      * Σ_v is finite.\n         \n      * Σ_v_i=Σ_v_j only if v_i=v_j.\n         \n      * ⋂_i=0^nΣ_v_i is either empty or contractible.\n         \n      *  For every g ∈(X), we have g Σ_v = Σ_gv.\n    \n    Let w ∈(X).  Then there exists v ∈(X) with w ≤ v, and hence w ∈Σ_v^(0).  Thus \n    {Σ_v:v∈(X)} is a closed covering of X.\n    \n    Let v be a (visible) Roller class. By Corollary <ref>, there are finitely many other classes w such that w ≤ v. This proves \n    assertion <ref>. \n    \n    \n    \n    Now suppose that v_i,v_j are (visible) Roller classes satisfying Σ_v_i=Σ_v_j.  Since v_j ∈Σ_v_i, \n    we have v_j≤ v_i.  Likewise, v_i ≤ v_j.  Hence v_i=v_j, proving assertion <ref>.\n    \n    Next, let v_0,…,v_n∈(X) and suppose that ⋂_i=0^nΣ_v_i≠∅.  First, note that \n    Σ_v_i=v_i L_v_i, where L_v_i (the link of v_i in Σ_v_i) is a subcomplex of X and  denotes the simplicial \n    join operation.   Hence Σ_v_i is topologically a cone, and is thus contractible.\n    \n    For each i, let 𝒱_i be a UBS representing v_i (recall Definition <ref>).  Then \n    ⋂_i=0^n𝒱_i is unidirectional and contains no facing triple, since those properties hold for each 𝒱_i and are inherited by subsets.  Second, ⋂_i=0^n𝒱_i is inseparable, because each 𝒱_i is.\n    \n    Now, if u ∈⋂_i=0^nΣ_v_i is a 0–simplex, then u ≤ v_i for all i, so \n    u is represented by a UBS of the form ≼⋂_i=0^n𝒱_i.  \n    Hence ⋂_i=0^n𝒱_i is infinite. Combined with the above discussion, this shows that \n    ⋂_i=0^n𝒱_i is a UBS.  Let v be the corresponding Roller class. Since ≼⋂_i=0𝒱_i, we have u ≤ v.  \n    \n    Since each such u is ℓ_2–visible, the set of visible Roller classes w with w≤ v is nonempty.  Hence there is a unique Roller class m such that m≤ v, and m \n    is ℓ_2–visible, and m is ≤–maximal with those properties, by Lemma <ref> and Definition <ref>.  Since each u∈⋂_i=0^nΣ_v_i satisfies u≤ m∈ X, there is a subcomplex L⊂ X such that ⋂_i=0^nΣ_v_i=m⋆ L, so ⋂_i=0^nΣ_v_i is contractible in X.\n    \n    \n    Finally, statement <ref> follows from the equivariance of (X) and the partial order ≤.\n    \n    Let 𝒩_ be the nerve of the closed covering {Σ_v:v∈(X)} of X.  By \n    Lemma <ref>.<ref>, 𝒩_ has vertex-set (X), \n    and v_0,…,v_n span an n–simplex if and only if \n    ⋂_i=0^nΣ_v_i≠∅. By \n    Lemma <ref>.<ref>, (X) acts by simplicial automorphisms on 𝒩_.\n    \n    Let v_0,…,v_n∈(X).  Then \n    \n        ⋂_i=0^nΣ_v_i≠∅ ⇔ ⋂_i=0^nQ(v_i)≠∅.\n    \n    Consequently, there is an (X)–equivariant simplicial isomorphism 𝒩_→𝒩_T.\n    \n    Suppose that there exists a∈⋂_i=0^nQ(v_i).  Then Lemma <ref> says ψ(a) ≤ v_i for all i.  Hence, by Definition <ref>, we have ψ(a)∈Σ_v_i for all i.  \n    \n    Conversely, suppose that there exists a vertex (i.e. a Roller class) w∈⋂_i=0^nΣ_v_i.  Then w ≤ v_i \n    for all i, by definition.  Hence, by Lemma <ref>, Q(w)⊂ Q(v_i) for all i, from which it \n    follows that φ(w)∈⋂_i=0^nQ(v_i). \n    \n    Finally, the simplicial isomorphism 𝒩_→𝒩_T comes from identifying the 0–skeleta of 𝒩_  and 𝒩_T with (X).\n    \n    \n     §.§ Homotopy equivalence between X and X\n    \n    We can now assemble the proof that X is homotopy equivalent to X. We do this in two propositions:\n    \n    \n    \n    There is an  homotopy equivalence  X → X.\n    \n    Consider the covering {Σ_v:v∈(X)} of X by the subcomplexes Σ_v, coming from \n    Lemma <ref>.  By Definition <ref>, the nerve of this cover is  \n    𝒩_.  By Lemma <ref>.<ref>, the intersection of any finite \n    collection of the Σ_v is either empty or contractible.  \n    Hence, by the Equivariant Simplicial Nerve Theorem <ref>, there is an  homotopy equivalence X →𝒩_.\n    \n    By Lemma <ref>, there is a simplicial isomorphism 𝒩_→𝒩_T. Finally, by Theorem <ref>, there is an  homotopy equivalence 𝒩_T → X. \n    Putting it all together, we obtain a chain of  homotopy equivalences\n    \n        X 𝒩_𝒩_T   X.\n    \n    The inclusion X ↪ X is an (X)–equivariant homotopy equivalence. Its homotopy inverse is an  deformation retraction X → X.\n    \n    First, observe that since X is (X)–invariant by Definition <ref>, and the set (X) is (X)–invariant by Definition <ref>, the inclusion  X ↪ X is (X)–equivariant.\n    \n    In the remainder of the proof, we will construct a deformation retraction X → \n    X that serves as a homotopy inverse to the inclusion X ↪ X. \n    \n    Let w be an invisible Roller class (viewed as a 0–simplex of X). \n     By Lemma <ref>, w is not minimal, so there exists a \n    minimal Roller class m with m < w.  Let n(w)≥1 be the maximum length of a \n    chain of the form m < ⋯ < w with m a minimal Roller class. \n    \n    Let D be the maximal number such that there exists an invisible Roller class w with n(w)=D. By \n    Remark <ref>, every simplex in X has at most X vertices, hence D ≤ X.\n    \n    \n    Let I_n be the set of invisible Roller classes v with n(v)=n.\n    Then \n    \n        ( X)^(0)= ( X)^(0)⊔_n=1^ DI_n.\n      \n    Let ( X)_0= X.  For 1≤ N≤  D, let ( X)_N be the subcomplex spanned by \n    ( X)^(0)⊔_n=1^NI_n, so\n    \n        X = ( X)_0 ⊂( X)_1⊂⋯⊂( X)_D= X.\n    \n    \n    Given a Roller class w and a positive integer n ≤ D, define the open starst_n(w) to be the union of {w} and all of the \n    open simplices of ( X)_n whose \n    closures contain w.  Let St_n(w) be the union of all (closed) simplices of \n    ( X)_n containing w.  Define the  (downward) linkL_n(w)=St_n(w) ∖ st_n(w).\n    \n    \n    For w ∈  I_n, we have L_n(w) ⊂ ( X)_n-1.\n    \n    \n    Let w∈ I_n ⊂ ( X)_n.  Let σ be a maximal simplex of ( X)_n \n    containing w and lying in ( X)_n.  Let v_0<⋯<v_m be the \n    corresponding chain, with w=v_i for some i.  Since n(w)=n, the chain \n    v_0 <⋯<v_i has length at most n. \n    \n    First, consider v_j for j<i.  If v_j is visible, then v_j∈( X)_0⊂( X)_n-1.  If \n    v_j is invisible, then since v_0 <⋯ < v_j is a chain of length less than \n    n, and σ is maximal, n(v_j)<n, hence v_j∈( X)_n-1.  \n    \n    Next, consider v_j for j>i.  If v_j is visible, then v_j∈( X)_0⊂( X)_n-1.  If \n    v_j is invisible, then v_j∉I_n, since there is a chain \n    v_0 <⋯< v_j of length more than n = n(v_i), which would contradict the containment σ⊂ ( X)_n.\n    \n    Hence the simplex σ' corresponding to the chain \n    v_0<⋯<v_i-1<v_i+1<⋯ <v_m lies in ( X)_n-1.  \n    This proves the claim.\n    \n    Contractibility of links:  Now, fix w ∈  I_n. We will show that L_n(w) is \n    contractible.  Establishing this involves several claims, leading up to Claim <ref>.\n    \n    \n    For a minimal Roller class with m∈ L_n(w), let St(m) = ⋃_n St_n(m) denote the star of m in X.  Then:\n    \n      * L_n(w)∩ St(m) is topologically a cone with cone-point m.\n         \n      * L_n(w) is the union of the subcomplexes L_n(w)∩ St(m), as m varies over  the finitely many minimal Roller classes with \n    m ≤ w.\n    \n    \n    Let L(m) denote the link of m in X. Then, by definition, St(m) decomposes as a join: St(m)=m  L(m).  Moreover, m∈ L_n(w), so \n    \n        L_n(w)∩ St(m)=  L_n(w) ∩ (m  L(m)) = m (L_n(w)∩ L(m)),\n    \n     which proves the first assertion.\n    \n    By Corollary <ref>, there are finitely many minimal Roller classes m ≤ w. For each such m, we clearly have L_n(w)∩ St(m)⊂ L_n(w).  Conversely, if v∈ L_n(w), \n    then there exists a minimal class m such that m ≤ v and m ≤ w, hence v∈ L_n(w)∩ St(m).  This proves  the claim.\n    \n    \n    \n    Let m_0, …, m_k be distinct minimal Roller classes with m_i < w for all i.  Then ⋂_i=0^k St(m_i) ∩ L_n(w) is  topologically a cone, and is in particular nonempty.\n    \n    \n    By \n    Lemma <ref>, each m_i is ℓ^2–visible, so we can choose CAT(0) geodesic rays ξ_i:[0,∞)→ X such \n    that ξ_i(0)=ξ_j(0) for all i, and such that ξ_i(∞)=φ(m_i) for each i.  \n    For each i, define ℳ_i=(ξ_i), a UBS representing m_i.\n    Since m_i is minimal \n    for all i, Lemma <ref> implies the intersection ℳ_i∩ℳ_j is finite whenever i ≠ j.  \n    Moving the common basepoint ξ_1(0) = … = ξ_k(0) ensures that ℳ_i∩ℳ_j=∅ for all i \n    ≠ j, and that each ℳ_i is the inseparable closure of an infinite descending chain.  Indeed, by moving the \n    basepoint across each of the finitely many hyperplanes appearing in some ℳ_i∩ℳ_j, we arrange the \n    first property, and the inseparable closure property holds by Lemma <ref>, Lemma <ref>, \n    and minimality of the m_i.\n    \n    Let 𝒜 be a UBS representing w. Since m_i ≤ w for all i, we have ℳ_i ≼𝒜 for each i.\n    Thus it is readily checked that ⋃_i=0^kℳ_i is a UBS. \n    \n    Consider a pair of indices i≠ j. Then since ⋃_i=0^kℳ_i is unidirectional and ℳ_i ∩ℳ_j = ∅,  \n    any pair of hyperplanes  ĥ_i ∈ℳ_i and ĥ_j ∈ℳ_j must cross. Indeed, ĥ_i ≠ĥ_j, and ĥ_i is the base of a \n    chain in _i, and ĥ_j is the base of a chain in _j.  If ĥ_i, ĥ_j did not cross, then the union of this pair of chains \n    would violate unidirectionality of _i∩_j. \n    \n    Thus, by Lemma <ref>, the convex hull of \n    ⋃_i=0^kξ_i is isometric to ∏_i=0^kY_i, where Y_i is the \n    cubical convex hull of ξ_i.  For each t>0, let x_t be the image of (ξ_0(t),…,ξ_k(t)) under the isometric \n    embedding ∏_i=0^kY_i→ X.  Then segments joining the basepoint to the points x_t converge uniformly on compact sets to a geodesic ray representing a point b∈ X with the property \n    that ψ(b)=u is \n    represented by = _i=0^kℳ_i.  Hence u is visible by Definition <ref>.  Moreover, m_i ≤ u ≤ w \n    for all i. To complete the proof of the claim, we will show that u is the promised cone point of ⋂_i=0^k St(m_i) ∩ L_n(w).\n    \n    For each i, the fact that  m_i ≤ u implies u∈ St(m_i).  On the other hand, u≠ w since u is visible but w is \n    not.  Thus u < w, so u∈ L_n(w).  Thus far, we have shown that ⋂_i=0^k St(m_i) ∩ L_n(w) ≠∅. \n    Now, suppose v∈ L_n(w)∩ St(m_i) for all i.  To complete the claim, we must show that u and v are ≤–comparable. By definition, m_i ≤ v for all i, hence ℳ_i ≼ for all i, where  is a UBS representing . Therefore, = _i=0^kℳ_i ≼, which implies u ≤ v. Thus ⋂_i=0^k St(m_i) ∩ L_n(w) is a cone with cone point u, completing Claim <ref>.\n    \n    \n    L_n(w) is contractible. \n    \n    \n    By Claim <ref>, L_n(w) is a finite union of subcomplexes L_n(w)∩ St(m), where m varies over the minimal \n    Roller classes satisfying m ≤ w.  By Claim <ref>, any collection of the L_n(w)∩ St(m) \n    intersect in a contractible subcomplex.  Hence, by the Simplicial Nerve Theorem <ref>, \n    L_n(w) is homotopy equivalent to the nerve of this covering. (We do not need to check equivariance at this step.) But, since any collection of the L_n(w)∩ St(m) \n    have nonempty intersection, this nerve is a finite \n    simplex and thus contractible.  Hence L_n(w) is contractible.\n    \n    \n    \n    Conclusion:  We have shown that the following hold for 1≤ \n    n≤ D:\n    \n      *  Claim <ref> says that for each vertex v∈( X)_n ∖ ( X)_n-1, the link in ( X)_n of \n    v is contained in ( X)_n-1;\n    \n      *  Claim <ref> says that for each vertex v∈( X)_n ∖ ( X)_n-1, the link in ( X)_n of \n    v is contractible.\n    \n    The first fact says that the open stars st_n(v) of the vertices \n    v∈( X)_n ∖ ( X)_n-1 are pairwise disjoint.  Together with the second \n    fact, this implies that ( X)_n is homotopy equivalent to \n    \n        ( X)_n-1  =   ( X)_n ∖( ⋃_v∈( X)_n^(0)∖ ( X)_n-1^(0)st_n(v) ).\n    \n    It follows that we can independently deformation retract the various open stars st_n(v) to the corresponding links L_n(v) to get a deformation retraction ( X)_n→( X)_n-1 that is a homotopy inverse for the inclusion.\n    Composing these retractions (for 1≤ n≤ D) gives the desired deformation retraction X → X. \n    \n    Finally, recall from the discussion after Definition <ref> that every homotopy inverse of a (X)–equivariant inclusion X → X  is itself an  homotopy equivalence. Thus we have an  deformation retraction X → X.\n    \n    \n    \n    Combining Propositions <ref> and <ref> gives a proof of half of Theorem <ref>.\n    \n    \n    \n    There is an  homotopy equivalence X → X.\n    \n    \n     §.§ Homotopy equivalence between X and X\n    \n    \n    \n    The following proposition proves the homotopy equivalence of the simplicial boundary and the simplicial Roller boundary, completing the proof of Theorem <ref>.\n    \n    \n    There is an  homotopy equivalence X → X.\n    \n    Let σ be a maximal simplex of X, corresponding to a class [_σ] ∈𝒰ℬ𝒮(X). Then, by Theorem <ref>, v_σ = ([_σ]) is a maximal Roller class.\n    \n    Let 𝒜 be the nerve of the covering of X by  maximal simplices.  Now, since any \n    collection of maximal simplices intersect in ∅ or a simplex, and simplices are contractible, \n    the Equivariant Simplicial Nerve Theorem <ref>\n    provides an  homotopy equivalence X →𝒜.\n    \n    Now, for each maximal Roller class v, consider the subcomplex Υ_v of X consisting of all simplices \n    corresponding to chains in which v is the maximal element.  Note that the set of such Υ_v is a cover of X.  \n    \n    A simpler version of the proof of Lemma <ref> implies that for all finite collections \n    { v_1,…, v_n } of maximal Roller classes, ⋂_i=1^nΥ_v_i is empty or contractible.  Indeed, suppose this \n    intersection is nonempty.  Exactly as in the proof of Lemma <ref>, each v_i corresponds \n    to a commensurability class [𝒱_i] of UBSes whose intersection is a UBS 𝒱, which in turn determines a \n    ≤–maximal Roller class v such that v≤ v_i for all i.  As in Lemma <ref>, \n    this implies that ⋂_i=1^nΥ_v_i is a cone with cone-point v.  (In the context of \n    Lemma <ref>, there is an additional step to check that v is visible, but that is \n    unnecessary here since we are working in all of X rather than in ^∢ X.)\n    \n    Let ℬ be the nerve of the covering of \n    X by the subcomplexes Υ_v, as v varies over the maximal Roller classes. Observe that the assignment v ↦Υ_v is a bijection from the set of maximal Roller classes to ℬ^(0). By Theorem <ref>, as above, there is an  homotopy equivalence X →ℬ.\n    \n    \n    To conclude, we will show that 𝒜 and ℬ are equivariantly isomorphic.  The vertex set of 𝒜 is the set of maximal simplices \n    σ of X, so we may define a function f 𝒜^(0)→ℬ^(0) via the composition\n    \n        σ↦ [_σ] ↦ v_σ↦Υ_v_σ,\n    \n    where the middle arrow is the equivariant map  of Theorem <ref>.  Since both σ and v_σ are maximal by definition, the map f is a bijection by Theorem <ref>.<ref>. Every arrow is (X)–equivariant by construction.\n    \n    \n    To extend f to a simplicial isomorphism f 𝒜→ℬ, it suffices to check that for all maximal simplices \n    σ_0,…,σ_n of X, we have ⋂_i=0^nσ_i≠∅ if and only if \n    ⋂_i=0^nΥ_v_σ_i≠∅; that this is sufficient follows since 𝒜 is the nerve of the covering of X by maximal simplices and ℬ is the nerve \n    of the covering of X by the subcomplexes Υ_v.  \n    \n    Suppose that ⋂_i=0^nσ_i≠∅.  Let 𝒱_i be a UBS representing σ_i.  So, 𝒱_i also represents the corresponding Roller class f(σ_i).  Let \n    𝒱=⋂_i=0^n𝒱_i, and note that 𝒱 is infinite.  Then by Remark <ref>, 𝒱 is an ℓ^1–visible UBS. Hence \n    𝒱 represents a Roller class w such that w≤ v_σ_i for all i.  Thus \n    ⋂_i=0^nΥ_v_σ_i contains w.  The converse is similar.  Hence f extends to an isomorphism, and \n    it follows that \n    \n        X 𝒜ℬ X\n    \n    is an  homotopy equivalence.\n    \n    \n     §.§ Cuboid generalization\n     We can now conclude the proof of \n    Theorem <ref>.\n    \n    \n    Let G be a group acting on X by cubical automorphisms, and let ρ be a G–admissible rescaling of X, with rescaled metric d_X^ρ. Recall from Definition <ref> that the action of G factors through ^ρ(X). In Section <ref>, we have checked that all of the constructions and results about the Tits boundary X also apply to ^ρ X, the Tits boundary of the rescaled metric (X, d_X^ρ), in a G–equivariant way.\n    \n    In Section <ref>, we have checked that the constructions of open and closed nerves for X also work for ^ρ X. In particular, by Theorem <ref>, there is a  homotopy equivalence between ^ρ X and the nerve\n     _T^ρ of the closed cover  {Q^ρ(v) : v ∈^ρ(X)}.\n     \n    Now, we inspect the results of this section. In Lemma <ref>, one simply needs to replace (X) by ^ρ(X) and (X) by ^ρ(X); the same exact proof then applies. \n    In Definition <ref>, replacing (X) by ^ρ(X) yields a nerve _^ρ. Then the proof of Lemma <ref> extends verbatim to give an ^ρ(X)–equivariant simplicial isomorphism _^ρ→_T^ρ. Proposition <ref> extends verbatim, because its proof is a top-level assembly of previous results. Similarly, Proposition <ref> extends immediately to cuboids, because its proof is a topological argument about simplicial complexes. (The proof of Proposition <ref> does use several lemmas from Sections <ref> and <ref>, particularly in Claim <ref>, but all of those lemmas have been extended to cuboids. Compare Remark <ref>.) Combining the cuboid versions of Propositions <ref> and <ref> gives a  homotopy equivalence X →^ρ X.\n    \n    Finally, note that the  homotopy equivalence X → X established in Proposition <ref> is also a  homotopy equivalence, because G acts by cubical automorphisms. Thus we have both of the  homotopy equivalences claimed in the theorem.\n    amsalpha"}