{"entry_id": "http://arxiv.org/abs/2303.06930v1", "published": "20230313085347", "title": "Twin Contrastive Learning with Noisy Labels", "authors": ["Zhizhong Huang", "Junping Zhang", "Hongming Shan"], "primary_category": "cs.CV", "categories": ["cs.CV", "cs.AI"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTwin Contrastive Learning with Noisy Labels\n\n    Zhizhong Huang^1    Junping Zhang^1    Hongming Shan^2,3Corresponding author\n\n\n^1 Shanghai Key Lab of Intelligent Information Processing, School of Computer Science,\n\nFudan University, Shanghai 200433, China\n\n^2 Institute of Science and Technology for Brain-inspired Intelligence and MOE Frontiers Center \nfor Brain Science,  Fudan University, Shanghai 200433, China\n\n^3 Shanghai Center for Brain Science and Brain-inspired Technology, Shanghai 200031, China\n\n{zzhuang19, jpzhang, hmshan}@fudan.edu.cn\n\n    March 30, 2023\n==========================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\nLearning from noisy data is a challenging task that significantly degenerates the model performance.\nIn this paper, we present , a novel twin contrastive learning model to learn robust representations and handle noisy labels for classification.\nSpecifically, we construct a Gaussian mixture model (GMM) over the representations by injecting the supervised model predictions into GMM to link label-free latent variables in GMM with label-noisy annotations.\nThen, detects the examples with wrong labels as the out-of-distribution examples by another two-component GMM, taking into account the data distribution.\nWe further propose a cross-supervision with an entropy regularization loss that bootstraps the true targets from model predictions\nto handle the noisy labels.\nAs a result, can learn discriminative representations aligned with estimated labels through mixup and contrastive learning.\nExtensive experimental results on several standard benchmarks and real-world datasets demonstrate the superior performance of . In particular, achieves 7.5% improvements on CIFAR-10 with 90% noisy label—an extremely noisy scenario. \nThe source code is available at <https://github.com/Hzzone/TCL>.\n\n\n\n\n§ INTRODUCTION\n\nDeep neural networks have shown exciting performance for classification tasks <cit.>. Their success largely results from the large-scale curated datasets with clean human annotations, such as CIFAR-10 <cit.> and ImageNet <cit.>, in which the annotation process, however, is tedious and cumbersome. In contrast, one can easily obtain datasets with some noisy annotations—from online shopping websites <cit.>, crowdsourcing <cit.>, or Wikipedia <cit.>—for training a classification neural network. Unfortunately, the mislabelled data are prone to significantly degrade the performance of deep neural networks. Therefore, there is considerable interest in training noise-robust classification networks in recent years <cit.>.\n\nTo mitigate the influence of noisy labels, most of the methods in  literature propose the robust loss functions <cit.>, reduce the weights of noisy labels <cit.>, or correct the noisy labels <cit.>.\nIn particular, label correction methods have shown great potential for better performance on the dataset with a high noise ratio. Typically, they correct the labels by using the combination of noisy labels and model predictions <cit.>, which usually require an essential iterative sample selection process <cit.>. \nFor example, Arazo  <cit.> uses the small-loss trick to carry out sample selection and correct labels via the weighted combination.\nIn recent years, contrastive learning has shown promising results in handling noisy labels <cit.>. They usually leverage contrastive learning to learn discriminative representations, and then clean the labels <cit.> or construct the positive pairs by introducing the information of nearest neighbors in the embedding space. However, using the nearest neighbors only considers the label noise within a small neighborhood, which is sub-optimal and cannot handle extreme label noise scenarios, as the neighboring examples may also be mislabeled at the same time. \n\nTo address this issue, this paper presents , a novel twin contrastive learning model that explores the label-free unsupervised representations and label-noisy annotations for learning from noisy labels.\nSpecifically, we leverage contrastive learning to learn discriminative image representations in an unsupervised manner and construct a Gaussian mixture model (GMM) over its representations. Unlike unsupervised GMM, links the label-free GMM and  label-noisy annotations by replacing the latent variable of GMM with the model predictions for updating the parameters of GMM.\nThen, benefitting from the learned data distribution, we propose to formulate label noise detection as an out-of-distribution (OOD) problem, utilizing another two-component GMM to model the samples with clean and wrong labels. The merit of the proposed OOD label noise detection is to take the full data distribution into account, which is robust to the neighborhood with strong label noise.\nFurthermore, we propose a bootstrap cross-supervision with an entropy regulation loss to reduce the impact of wrong labels, in which the true labels of the samples with wrong labels are estimated from another data augmentation.\nLast, to further learn robust representations, we leverage contrastive learning and Mixup techniques to inject the structural knowledge of classes into the embedding space, which helps align the representations with estimated labels.\n\nThe contributions are summarized as follows:\n\n\n\n  * We present , a novel twin contrastive learning model that explores the label-free GMM for unsupervised representations and label-noisy annotations for learning from noisy labels. \n\n\n  * We propose a novel OOD label noise detection method by modeling the data distribution, which excels at handling extremely noisy scenarios.\n\n\n  * We propose an effective cross-supervision, which can bootstrap the true targets with an entropy loss to regularize the model.\n\n\n  * Experimental results on several benchmark datasets and real-world datasets demonstrate that our method outperforms the existing state-of-the-art methods by a significant margin. In particular, we achieve 7.5% improvements in extremely noisy scenarios.\n\n\n\n\n§ RELATED WORK\n\n\n\n  \nContrastive learning.\nContrastive learning methods <cit.> have shown promising results for both representation learning and downstream tasks. The popular loss function is InfoNCE loss <cit.>, which can pull together the data augmentations from the same example and push away the other negative examples. MoCo <cit.> uses a memory queue to store the consistent representations. SimCLR <cit.> optimizes InfoNCE within mini-batch and has found some effective training tricks, , data augmentation.\nHowever, as unsupervised learning, they mainly focus on inducing transferable representations for the downstream tasks instead of training with noisy annotations. Although supervised contrastive learning <cit.> can improve the representations by human labels, it harms the performance when label noise exists <cit.>.\n\n\n\n  \nLearning with noisy labels.\nMost of the methods in literature mitigate the label noise by robust loss functions <cit.>, noise transition matrix <cit.>, sample selection <cit.>, and label correction <cit.>. In particular, label correction methods have shown promising results than other methods.\nArazo  <cit.> applied a mixture model to the losses of each sample to distinguish the noisy and clean labels, inspired by the fact that the noisy samples have a higher loss during the early epochs of training.\nSimilarly, DivideMix <cit.> employs two networks to perform the sample selection for each other and applies the semi-supervised learning technique where the targets are computed from the average predictions of different data augmentations.\nDue to the success of contrastive learning, many attempts have been made to improve the robustness of classification tasks by combining the advantages of contrastive learning. Zheltonozhskii  <cit.> used contrastive learning to pre-train the classification model. MOIT <cit.> quantifies this agreement between feature representation and original label to identify mislabeled samples by utilizing a k-nearest neighbor (k-NN) search. RRL <cit.> performs label cleaning by two thresholds on the soft label, which is calculated from the predictions of previous epochs and its nearest neighbors. Sel-CL <cit.> leverages the nearest neighbors to select confident pairs for supervised contrastive learning <cit.>.\n\nUnlike existing methods <cit.> that detect the wrong labels within the neighborhood, formulates the wrong labels as the out-of-distribution examples by modeling the data distribution of representations learned by contrastive learning. In addition, we propose a cross-supervision with entropy regularization to better estimate the true labels and handle the noisy labels.\n\n\n\n\n\n§ THE PROPOSED \n\n\nEach image in dataset 𝒟={x_i}_i=1^N associates with an annotation y∈{1, 2,…, K}. In practice, some examples may be mislabeled. We aim to train a classification network, p_θ(y|x) = g(x;θ) ∈ℝ^K, that is resistant to the noisy labels in training data, and generalizes well on the clean testing data.\nFig. <ref> illustrates the framework of our proposed . \n\n\n\n  \nOverview.\nIn the context of our framework, f(·) and g(·) share the same backbone and have additional individual heads to output representations and class predictions from two random and one mixup data augmentations. Afterward, there are four components in , including (i) modeling the data distribution via a GMM in Sec. <ref> from the model predictions and representations; (ii) detecting the examples with wrong labels as out-of-distribution samples in Sec. <ref>; (iii) cross-supervision by bootstrapping the true targets in Sec. <ref>; and (iv) learning robust representations through contrastive learning and mixup in Sec. <ref>.\n\n\n\n §.§ Modeling Data Distribution\n\n\nGiven the image dataset consisting of N images, we opt to model the distribution of x over its representation v = f(x) via a spherical Gaussian mixture model (GMM).\nAfter introducing discrete latent variables z∈{1, 2,…, K} that determine the assignment of observations to mixture components, the unsupervised GMM can be defined as\n\n    p(v )    = ∑_k=1^K p(v, z=k) \n       =∑_k=1^K p(z=k) 𝒩(v | μ_k, σ_k).\n\nwhere μ_k is the mean and σ_k a scalar deviation.\nIf we assume that the latent variables z are uniform distributed, that is, p(z=k) = 1/K, we can define the posterior probability that assigns x_i to k-th cluster:\n\n    γ_ik=p(z_i=k|x_i)∝𝒩(x_i|μ_k,σ_k).\n\nIn an ideal scenario where all the samples have clean labels y∈{1, 2,…, K}, the discrete latent variables z would be identical to the annotation y, and the parameters μ_k, σ_k and latent variable z can be solved through a standard Expectation-Maximization (EM) algorithm <cit.>.\n\nHowever, in practice, the labels are often noisy and the latent variable z, estimated in an unsupervised manner, has nothing to do with the label y. Therefore, we are interested in connecting latent variable z, estimated in an unsupervised fashion  ( label-free), and the available annotations y, label-noisy, for the task of learning from noisy labels. \n\nTo link them together, we propose to inject the model predictions p_θ(y_i = k|x_i), learned from noisy labels, into the latent variables z. Specifically, we propose to replace the unsupervised assignment p(z_i=k|x_i) with noisy-supervised assignment p_θ(y_i=k|x_i). As a result, we can connect the latent variable z with the label y, and thus use the noisy supervision to guide the update of the parameters of GMM. In particular, the update of the GMM parameters becomes\n\n    μ_k    = norm(∑_i p_θ(y_i = k|x_i) v_i/∑_i p_θ(y_i = k|x_i)),\n         \n    σ_k    = ∑_i p_θ(y_i = k|x_i) (v_i - μ_k)(v_i - μ_k)/∑_i p_θ(y_i = k|x_i),\n\nwhere norm(·) is ℓ_2-normalization such that μ_k_2=1.\n\n\n\n\n §.§ Out-Of-Distribution Label Noise Detection\n\n\n\nPrevious works <cit.> typically detect the wrong labels within the neighborhood, that is, using the information from nearest neighbors. It is limited as the neighboring examples are usually mislabeled at the same time. To address this issue, we propose to formulate label noise detection as to detect the out-of-distribution examples.\n\nAfter building the connection between the latent variables z and labels y, we are able to detect the sample with wrong labels through the posterior probability in Eq. (<ref>). We implement it as a  normalized version to take into account the intra-cluster distance, which allows for detecting the samples with likely wrong labels:\n\n    γ_ik=exp(- (v_i-μ_k)(v_i-μ_k) / 2σ_k)/∑_k exp(- (v_i-μ_k)(v_i-μ_k) / 2σ_k).\n\nSince ℓ_2-normalization has been applied to both embeddings v and the cluster centers μ_k, yielding (v-μ_k)(v-μ_k)=2-2vμ_k. Therefore, we can re-write Eq. (<ref>) as:\n\n    γ_ik   =p(z_i=k|x_i)\n       =exp(v_iμ_k / σ_k) / ∑_k exp(v_iμ_k/σ_k).\n\n\nOnce built the GMM over the distribution of representations, we propose to formulate the conventional noisy label detection problem  as out-of-distribution sample detection problem. Our idea is that the samples with clean labels should have the same cluster indices after linking the cluster index and class label. Specifically, given one particular class y=k, the samples within this class can be divided into two types: in-distribution samples with clean labels, and out-of-distribution samples with wrong labels. Therefore, we define the following conditional probability to measure the probability of one sample with clean label:\n\n    γ_y=z|i   =p(y_i=z_i|x_i)\n       =exp(v_iμ_z_i / σ_z_i) / ∑_k exp(v_iμ_k/σ_k).\n\nAlthough Eqs. (<ref>) and (<ref>) share similar calculations, they have different meanings. Eq. (<ref>) calculates the probability of one example belonging to k-th cluster while Eq. (<ref>) the probability of one example having clean label—that is, y_i=z_i. Therefore, the probability of one example having the wrong label can be written as γ_y≠ z|i= p(y_i≠ z_i|x_i) = 1 - p(y_i=z_i|x_i). \n\nFurthermore, instead of setting a human-tuned threshold for γ_y=z|i, we opt to employ another two-component GMM following <cit.> to automatically estimate the clean probability γ_y=z|i for each example. Similar to the definition of GMM in Eq. (<ref>), this two-components GMM is defined as follows:\n\n    p(γ_y=z|i)=∑_c=0^1p(γ_y=z|i, c) = ∑_c=0^1 p(c)p(γ_y=z|i| c),\n\nwhere c is the new introduced latent variable: c=1 indicates the cluster of clean labels with higher mean value and vice versus c=0. After modeling the GMM over the probability of one example having clean labels, γ_y=z|i, we are able to infer the posterior probability of one example having clean labels through the two-component GMM.\n\n\n\n §.§ Cross-supervision with Entropy Regularization\n\n\nAfter the label noise detection, the next important step is to estimate the true targets by correcting the wrong label to reduce its impact, called label correction.\nPrevious works usually perform label correction using the temporal ensembling <cit.> or from the model predictions <cit.> before mixup augmentation without back-propagation.\n\nleverages a similar idea to bootstrap the targets through the convex combination of its noisy labels and the predictions from the model itself:\n\n    t^(1)_i = w_i y_i + (1 - w_i) g(x^(1)_i)\n    t^(2)_i = w_i y_i + (1 - w_i) g(x^(2)_i) \n        ,\n\nwhere g(x^(1)_i) and g(x^(2)_i) are the predictions of two augmentations, y_i the noisy one-hot label, and w_i∈[0, 1] represents the posterior probability as p(c=1|γ_y=z|i) from the two-component GMM defined in Eq. (<ref>). When computing Eq. (<ref>), we stop the gradient from g to avoid the model predictions collapsed into a constant, inspired by <cit.>.\n\nGuided by the corrected labels t_i, we swap two augmentations to compute the classification loss twice, leading to the bootstrap cross supervision, formulated as:\n\n    ℒ_cross = ℓ(g(x_i^(1)), t^(2)_i) + ℓ(g(x_i^(2)), t^(1)_i),\n\nwhere ℓ is the cross-entropy loss. This loss makes the predictions of the model from two data augmentations close to corrected labels from each other. In a sense, if w_i=0, the model is encouraged for consistent class predictions between different data augmentations, otherwise w_i=1 it is supervised by the clean labels.\n\nIn addition, we leverage an additional entropy regularization loss on the predictions within a mini-batch ℬ:\n\n    ℒ_reg   = - ℍ(1/|ℬ|∑_x∈ℬ  g(x)) +1/|ℬ|∑_x∈ℬℍ(g(x)),\n\nwhere ℍ(·) is the entropy of predictions <cit.>. The first term can avoid the predictions collapsing into a single class by maximizing the entropy of average predictions.\nThe second term is the minimum entropy regularization to encourage the model to have high confidence for predictions, which was previously studied in semi-supervised learning literature <cit.>.\n\nAlthough both using the model predictions, we would emphasize that the cross-supervision in is different to <cit.> in three aspects: (i) both x^(1)_i and x^(2)_i are involved in back-propagation; (ii) the strong augmentation <cit.> used to estimate the true targets can prevent the overfitting of estimated targets; and (iii) employs two entropy regularization terms to avoid the model collapse to one class.\n\nThe final classification loss is given as follows:\n\n    ℒ_cls = ℒ_cross + ℒ_reg.\n\n\n\n\n §.§ Learning Robust Representations\n\n\nTo model the data distribution that is robust to noisy labels, we leverage contrastive learning to learn the representations of images. Specifically,\ncontrastive learning performs instance-wise discrimination <cit.> using the InfoNCE loss <cit.> to enforce the model outputting similar embeddings for the images with semantic preserving perturbations.\nFormally, the contrastive loss is defined as follows:\n\n    ℒ_ctr = -logexp( f(x^(1)) f(x^(2)) / τ)/∑_x∈𝒮exp(f(x^(1)) f(x) / τ),\n\nwhere τ is the temperature and 𝒮 is the ℬ except x^(1). x^(1) and x^(2) are two\naugmentations of x.\nIntuitively, InfoNCE loss aims to pull together the positive pair (x^(1), x^(2)) from two different augmentations of the same instance, and push them away from negative examples of other instances. Consequently, it can encourage discriminative representations in a pure unsupervised, or label-free manner.\n\nAlthough beneficial in modeling latent representations, contrastive learning cannot introduce compact classes without using the true labels. Since the label y is noisy, we leverage Mixup <cit.> to improve within-class compactness, which has been shown its effectiveness against label noise in literature <cit.>. Specifically,\na mixup training pair (x^(m)_i, t̅^(m)_i) is linearly interpolated between (x_i, t̅_i) and (x_j, t̅_j) under a control coefficient λ∼Beta(α,α):\n\n    x^(m)_i = λx_i + (1 - λ) x_j,\n    t̅^(m)_i = λt̅_i + (1 - λ) t̅_j,\n\nwhere x_j is randomly selected within a mini-batch, and t̅_i=(t^(1)_i+t^(2)_i)/2 is the average of estimated true labels of two data augmentations. Intuitively, we can inject the structural knowledge of classes into the embedding space learned by contrastive learning. This loss can be written as:\n\n    ℒ_align = ℓ(g(x^(m)_i), t̅^(m)_i) + ℓ(p(z|x^(m)_i), t̅^(m)_i),\n\nwhere the second term can align the representations with estimated labels. In a sense, ℒ_align regularizes classification network g and encourages f to learn compact and well-separated representations.\nFurthermore, we would point out two differences between and <cit.>, although both using mixup to boost the representations. First, <cit.> does not explicitly model the data distribution p(z|x^(m)_i) like . Second, has leveraged the full training dataset via the corrected label t̅^(m)_i instead of a subset of clean examples in <cit.>, which leads to stronger robustness of over <cit.> on extreme high label noise ratios.\n\n\n\n §.§ Training and inference\n\n\n\n\n\nThe overall training objective is to minimize the sum of all losses:\n\n    ℒ = ℒ_cls + ℒ_ctr + ℒ_align.\n\nWe find that a simple summation of all losses works well for all datasets and noise levels, which indicates the strong generalization of the proposed method. During inference, the data augmentations are disabled and the class predictions are obtained by argmax_k p_θ(k |𝐱).\n\nThe training algorithm of the proposed method is shown in Alg. <ref>. In a sense, the architecture of our method leads to an EM-like algorithm: (1) the E-step updates {(μ_k, σ_k)}_k=1^K for , and {w_i}_i=1^N for each sample in 𝒟 to form the true targets with the predictions from another data augmentations, and (2) the M-step optimizes the model parameters by Eq. (<ref>) to better fit those estimated targets.\nTherefore, the convergence of can be theoretically guaranteed, following the standard EM algorithm. \n\n\n\n§ EXPERIMENTS\n\n\nIn this section, we conduct experiments on multiple benchmark datasets with simulated and real-world label noises. We strictly follow the experimental settings in previous literature <cit.> for fair comparisons.\n\n\n\n §.§ Experiments on simulated datasets\n\n\n\n\n  \nDatasets. \nFollowing <cit.>, we validate our method on CIFAR-10/100 <cit.>, which contains 50K and 10K images with size 32× 32 for training and testing, respectively. We leave 5K images from the training set as the validation set for hyperparameter tuning, then train the model on the full training set for fair comparisons.\nTwo types of label noise are simulated: symmetric and asymmetric label noise. Symmetric noise randomly assigns the labels of the training set to random labels with predefined percentages, a.k.a, noise ratio, which includes 20%, 50%, 80%, and 90% on two datasets in this paper. Asymmetric noise takes into account the class semantic information, and the labels are only changed to similar classes (, truck → automobile). Here, only experiments on the CIFAR-10 dataset with 40% noise ratio for asymmetric noise are conducted; otherwise, the classes with above 50% label noise cannot be distinguished.\n\n\n\n\n\n\n\n\n  \nTraining details. \nSame as previous works <cit.>, we use a PreAct ResNet-18 <cit.> as the encoder. We adopt SGD optimizer to train our model with a momentum of 0.9, a weight decay of 0.001, and a batch size of 256 for 200 epochs. The learning rate are linearly warmed up to 0.03 for 20 epochs and decayed with the cosine schedule.\nThe data augmentations of <cit.> are applied to two views (ResizedCrop, ColorJitter, and etc). Only crop and horizontal flip are employed for mixup. Both projection and classification heads are a two-layer MLP with the dimension 128 and the number of classes. The temperature τ of contrastive loss and the α of mixup are 0.25 and 1. The settings are shared for all experiments, which are significantly different from <cit.> that adopt specific configurations for different datasets and even for different noise ratios/types.\n\n\n\n  \nQuantitative results.\nTable <ref> presents the the comparisons with existing state-of-the-art methods. Our method yields competitive performance on low noise ratios, but promising improvements over recent methods on extreme noise ratios and the most challenging CIFAR-100 dataset with 100 classes. In particular, with 90% label noise, there are 7.5% and 5.7% improvements on for CIFAR-10 and CIFAR-100, respectively. We stress that the hyperparameters are consistent for different noise ratios/types. In practical scenarios, the noise ratio for a particular dataset is unknown, so it is hard to tune the hyper-parameters for better performance. Therefore, these results indicate the strong generalization ability of our method regardless of noise ratios/types.\n\nFor fair comparisons, following <cit.>, we performed extra experiments on fine-tuning the classification network for 70 epochs with the detected clean samples and mixup augmentation, termed TCL+. Table <ref> shows that under low label noise (below 50%), TCL+ achieves significant improvements over TCL and outperforms the recent state-of-the-art methods. The benefits from the detected clean subset and longer training, which can fully utilize the useful supervision signals from labeled examples.\n\n\nIn Appendix <ref>, we also perform the k-NN classification over the learned representations, which indicates that our method has maintained meaningful representations better than the pure unsupervised learning model.\nIn Appendix <ref>, we provide more experimental results and analysis on asymmetric label noise and imbalance data.\n\n\n\n\n\n\n  \nQualitative results. Figs. <ref>(a) and (b) visualize the learned representations with extremely high noise ratio, demonstrating that our method can produce distinct structures of learned representations with meaningful semantic information. Especially, Fig. <ref>(b) presents the samples with noisy labels in the embedding space, in which the label noise can be accurately detected by our proposed method. In addition, by visualizing the histogram of p(y=z|x) for the training set in Fig. <ref>(c), we confirm that the proposed method can effectively distinguish the samples noisy and clean labels.\nWe visualize the validation accuracy across training in Fig. <ref>(d). As expected, performs stable even with the extreme 90% label noise.\n\n\n\n §.§ Ablation study\n\n\nWe conduct ablation studies to validate our motivation and design with the following baselines, and the results are shown in Table <ref>.\n\n\n\n  *  Baseline.  We start the baseline method by removing the proposed noisy label detection and bootstrap cross-supervision, where the model is directly guided by noisy labels.  As expected, the performance significantly degrades for the extremely high noise ratio (, 90%).\n\n\n\n  *  Label Noise Detection.  We assess the effectiveness of different detection methods including the cross-entropy loss <cit.>, k-NN search <cit.>, and our out-of-distribution (OOD) detection. For fair comparisons, the predictions from the images before mixup are employed as the true labels in Eq. (<ref>).\nObviously, the label noise detection has alleviated the degeneration to some degree (Exp. <ref>), where our method consistently outperforms other baselines.\nFig. <ref> visualizes their AUCs across training.\nThe proposed OOD detection is better at distinguishing clean and wrong labels. Thanks to the representations learned by contrastive learning, k-NN search performs better than cross-entropy loss. However, it is limited due to the use of the original labels to detect noisy ones, while our method constructs a GMM using the model predictions.\n\n\n\n\n  *  Target Estimation.  Another key component is the cross-supervision that bootstraps the true targets from the predictions of another data augmentation. We replace it with the temporal ensembling <cit.>, where the hyperparameters are set as suggested by <cit.>. Furthermore, Exp. <ref> estimates true targets from the images before mixup <cit.>. The results suggest that our bootstrap cross-supervision has shown strong robustness on 90% label noise.\n\n\n\n\n  *  Without ℒ_reg.  We remove ℒ_reg and the results indicate that it plays an important role, especially on extremely high label noise. Removing each term in ℒ_reg obtains similar results. We argue that ℒ_reg works in two aspects: 1) it can avoid the model collapse which outputs single classes, and 2) it can encourage the model to have high confidence for the predictions, which has shown its effectiveness for unlabeled data in semi-supervised learning.\n\n  *  Without ℒ_align.  We remove ℒ_align and the performance has decreased, as expected, but is still more promising than other baselines. ℒ_align has leveraged mixup augmentation to regularize both classification and representation learning. Appendix <ref> shows the evaluation of k-NN classification, demonstrating that ℒ_align can also greatly improve the learned representations.\n\n  *  Contrastive Framework.  We implement into another contrastive framework for representation learning, , MoCo <cit.>. Based on the MoCo framework, our method has achieved more improvements in various experiments, which benefits from a large number of negative examples in the memory queue and a moving-averaged encoder (we set the queue size and the factor of moving-average to 4,096 and 0.99, respectively).\n\n\n\n\n\n\n\n\n  \nHyperparameters.\nWe evaluate the most essential hyperparameters  to our design, including the temperature τ for contrastive loss and update frequency for on CIFAR-10 with 90% symmetric noise. Here, the update frequency denotes how may epochs that we update the parameters of , {(μ_k, σ_k)}_k=1^K and {w_i}_i=1^N.\nFig. <ref> shows that our method is robust to different choices of hyperparameters.\nEven though updates for every 32 epochs, our method has still performed well, which indicates that the computational cost can be significantly reduced.\n\n\n\n §.§ Results on real-world datasets\n\n\n\n\n  \nDatasets and training details. \nWe validate our method on two real-word noisy datasets: WebVision <cit.> and Clothing1M <cit.>. Webvision contains millions of noisily-labeled images collected from the web using the keywords of ImageNet ILSVRC12 <cit.>. Following the convension <cit.>, we conducted experiments on the first 50 classes of the Google image subset, termed WebVision (mini) and evaluated on both WebVision and ImageNet validation set. Clothing1M consists of 14 kinds of images\ncollected from online shopping websites. Only the noisy training set is used in our experiments.\nWe used a batch size of 256 on 4 GPUs, and trained a ResNet-50 for 40 epochs (without warm-up) on Clothing1M and a ResNet-18 for 130 epochs (warm-up 10 epochs) on WebVision, respectively. Following <cit.>, for Clothing1M, the encoder is initialized with ImageNet pre-trained weights, the initial learning rate is 0.01, and 256 mini-batches are sampled as one epoch. Other hyper-parameters are kept to be the same without further tuning.\n\n\n\n  \nQuantitative results. \nTables <ref> and <ref> present the results on WebVision and Clothing1M datasets. Our method outperforms state-of-the-art methods on both datasets, demonstrating its superior performance in handling real-world noisy datasets. We note that after checking the Clothing1M dataset, there are still lots of mislabeled images in the testing set. Therefore, the results on Clothing1M may not be such reliable as other datasets to evaluate the true performance of different methods.\n\n\n\n\n\n\n§ CONCLUSION\n\nIn this paper, we introduced , a novel twin contrastive learning model for learning from noisy labels. By connecting the label-free latent variables and label-noisy annotations, can effectively detect the label noise and accurately estimate the true labels. \nExtensive experiments on both simulated and real-world datasets have demonstrated the superior performance of than existing state-of-the-art methods. \nIn particular, achieves 7.5% performance improvement under extremely 90% noise ratio.\nIn the future, we will improve with semantic information for low noise ratios and explore dynamically updating the GMM.\n\n\n\nieee_fullname\n\n10=-1pt\n\n    arazo2019unsupervised\n    Eric Arazo, Diego Ortego, Paul Albert, Noel O’Connor, and Kevin McGuinness.\n    Unsupervised label noise modeling and loss correction.\n    In International Conference on Machine Learning, pages\n      312–321. PMLR, 2019.\n    \n    chen2019understanding\n    Pengfei Chen, Ben Ben Liao, Guangyong Chen, and Shengyu Zhang.\n    Understanding and utilizing deep neural networks trained with noisy\n      labels.\n    In International Conference on Machine Learning, pages\n      1062–1070. PMLR, 2019.\n    \n    chen2020simple\n    Ting Chen, Simon Kornblith, Mohammad Norouzi, and Geoffrey Hinton.\n    A simple framework for contrastive learning of visual\n      representations.\n    In International Conference on Machine Learning, pages\n      1597–1607. PMLR, 2020.\n    \n    chen2021exploring\n    Xinlei Chen and Kaiming He.\n    Exploring simple Siamese representation learning.\n    In Proceedings of the IEEE/CVF Conference on Computer Vision and\n      Pattern Recognition, pages 15750–15758, 2021.\n    \n    dempster1977maximum\n    Arthur P Dempster, Nan M Laird, and Donald B Rubin.\n    Maximum likelihood from incomplete data via the EM algorithm.\n    Journal of the Royal Statistical Society: Series B\n      (Methodological), 39(1):1–22, 1977.\n    \n    deng2009imagenet\n    Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei.\n    ImageNet: A large-scale hierarchical image database.\n    In 2009 IEEE Conference on Computer Vision and Pattern\n      Recognition, pages 248–255. Ieee, 2009.\n    \n    ghosh2017robust\n    Aritra Ghosh, Himanshu Kumar, and PS Sastry.\n    Robust loss functions under label noise for deep neural networks.\n    In Proceedings of the AAAI Conference on Artificial\n      Intelligence, 2017.\n    \n    goldberger2016training\n    Jacob Goldberger and Ehud Ben-Reuven.\n    Training deep neural-networks using a noise adaptation layer.\n    In International Conference on Learning Representations, 2017.\n    \n    grandvalet2004semi\n    Yves Grandvalet and Yoshua Bengio.\n    Semi-supervised learning by entropy minimization.\n    In Advances in Neural Information Processing Systems, 2004.\n    \n    grill2020bootstrap\n    Jean-Bastien Grill, Florian Strub, Florent Altché, Corentin Tallec,\n      Pierre H Richemond, Elena Buchatskaya, Carl Doersch, Bernardo Avila Pires,\n      Zhaohan Daniel Guo, Mohammad Gheshlaghi Azar, et al.\n    Bootstrap your own latent: A new approach to self-supervised\n      learning.\n    In Advances in Neural Information Processing Systems, 2020.\n    \n    han2018co\n    Bo Han, Quanming Yao, Xingrui Yu, Gang Niu, Miao Xu, Weihua Hu, Ivor Tsang, and\n      Masashi Sugiyama.\n    Co-teaching: Robust training of deep neural networks with extremely\n      noisy labels.\n    In Advances in Neural Information Processing Systems,\n      volume 31, 2018.\n    \n    he2020momentum\n    Kaiming He, Haoqi Fan, Yuxin Wu, Saining Xie, and Ross Girshick.\n    Momentum contrast for unsupervised visual representation learning.\n    In Proceedings of the IEEE/CVF Conference on Computer Vision and\n      Pattern Recognition, pages 9729–9738, 2020.\n    \n    he2016deep\n    Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun.\n    Deep residual learning for image recognition.\n    In Proceedings of the IEEE Conference on Computer Vision and\n      Pattern Recognition, pages 770–778, 2016.\n    \n    he2016identity\n    Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun.\n    Identity mappings in deep residual networks.\n    In European Conference on Computer Vision, pages 630–645.\n      Springer, 2016.\n    \n    jiang2020beyond\n    Lu Jiang, Di Huang, Mason Liu, and Weilong Yang.\n    Beyond synthetic noise: Deep learning on controlled noisy labels.\n    In International Conference on Machine Learning, 2020.\n    \n    jiang2018mentornet\n    Lu Jiang, Zhengyuan Zhou, Thomas Leung, Li-Jia Li, and Li Fei-Fei.\n    MentorNet: Learning data-driven curriculum for very deep neural\n      networks on corrupted labels.\n    In International Conference on Machine Learning, 2018.\n    \n    khosla2020supervised\n    Prannay Khosla, Piotr Teterwak, Chen Wang, Aaron Sarna, Yonglong Tian, Phillip\n      Isola, Aaron Maschinot, Ce Liu, and Dilip Krishnan.\n    Supervised contrastive learning.\n    In Advances in Neural Information Processing Systems, 2020.\n    \n    kim2021fine\n    Taehyeon Kim, Jongwoo Ko, JinHwan Choi, Se-Young Yun, et al.\n    Fine samples for learning with noisy labels.\n    In Advances in Neural Information Processing Systems, 2021.\n    \n    krizhevsky2009learning\n    Alex Krizhevsky, Geoffrey Hinton, et al.\n    Learning multiple layers of features from tiny images.\n    2009.\n    \n    li2020dividemix\n    Junnan Li, Richard Socher, and Steven CH Hoi.\n    Dividemix: Learning with noisy labels as semi-supervised learning.\n    In International Conference on Learning Representations, 2020.\n    \n    li2021learning\n    Junnan Li, Caiming Xiong, and Steven CH Hoi.\n    Learning from noisy data with robust representation learning.\n    In Proceedings of the IEEE/CVF International Conference on\n      Computer Vision, pages 9485–9494, 2021.\n    \n    li2020mopro\n    Junnan Li, Caiming Xiong, and Steven CH Hoi.\n    Mopro: Webly supervised learning with momentum prototypes.\n    In International Conference on Learning Representations, 2021.\n    \n    li2022selective\n    Shikun Li, Xiaobo Xia, Shiming Ge, and Tongliang Liu.\n    Selective-supervised contrastive learning with noisy labels.\n    In Proceedings of the IEEE/CVF Conference on Computer Vision and\n      Pattern Recognition, pages 316–325, 2022.\n    \n    li2017webvision\n    Wen Li, Limin Wang, Wei Li, Eirikur Agustsson, and Luc Van Gool.\n    Webvision database: Visual learning and understanding from web data.\n    arXiv preprint arXiv:1708.02862, 2017.\n    \n    liu2020early\n    Sheng Liu, Jonathan Niles-Weed, Narges Razavian, and Carlos Fernandez-Granda.\n    Early-learning regularization prevents memorization of noisy labels.\n    In Advances in Neural Information Processing Systems, 2020.\n    \n    ma2018dimensionality\n    Xingjun Ma, Yisen Wang, Michael E Houle, Shuo Zhou, Sarah Erfani, Shutao Xia,\n      Sudanthi Wijewickrema, and James Bailey.\n    Dimensionality-driven learning with noisy labels.\n    In International Conference on Machine Learning, pages\n      3355–3364. PMLR, 2018.\n    \n    malach2017decoupling\n    Eran Malach and Shai Shalev-Shwartz.\n    Decoupling “when to update\" from “how to update\".\n    In Advances in Neural Information Processing Systems, 2017.\n    \n    oord2018representation\n    Aaron van den Oord, Yazhe Li, and Oriol Vinyals.\n    Representation learning with contrastive predictive coding.\n    arXiv preprint arXiv:1807.03748, 2018.\n    \n    ortego2021multi\n    Diego Ortego, Eric Arazo, Paul Albert, Noel E O'Connor, and Kevin McGuinness.\n    Multi-objective interpolation training for robustness to label noise.\n    In Proceedings of the IEEE/CVF Conference on Computer Vision and\n      Pattern Recognition, pages 6606–6615, 2021.\n    \n    patrini2017making\n    Giorgio Patrini, Alessandro Rozza, Aditya Krishna Menon, Richard Nock, and\n      Lizhen Qu.\n    Making deep neural networks robust to label noise: A loss correction\n      approach.\n    In Proceedings of the IEEE Conference on Computer Vision and\n      Pattern Recognition, 2017.\n    \n    reed2014training\n    Scott Reed, Honglak Lee, Dragomir Anguelov, Christian Szegedy, Dumitru Erhan,\n      and Andrew Rabinovich.\n    Training deep neural networks on noisy labels with bootstrapping.\n    arXiv preprint arXiv:1412.6596, 2014.\n    \n    Rothe-IJCV-2018\n    Rasmus Rothe, Radu Timofte, and Luc Van Gool.\n    Deep expectation of real and apparent age from a single image without\n      facial landmarks.\n    International Journal of Computer Vision, 126(2-4):144–157,\n      2018.\n    \n    shannon2001mathematical\n    Claude Elwood Shannon.\n    A mathematical theory of communication.\n    The Bell system technical journal, 27(3):379–423, 1948.\n    \n    tanaka2018joint\n    Daiki Tanaka, Daiki Ikami, Toshihiko Yamasaki, and Kiyoharu Aizawa.\n    Joint optimization framework for learning with noisy labels.\n    In Proceedings of the IEEE Conference on Computer Vision and\n      Pattern Recognition, pages 5552–5560, 2018.\n    \n    tanno2019learning\n    Ryutaro Tanno, Ardavan Saeedi, Swami Sankaranarayanan, Daniel C Alexander, and\n      Nathan Silberman.\n    Learning from noisy labels by regularized estimation of annotator\n      confusion.\n    In Proceedings of the IEEE/CVF Conference on Computer Vision and\n      Pattern Recognition, pages 11244–11253, 2019.\n    \n    wang2019imae\n    Xinshao Wang, Yang Hua, Elyor Kodirov, and Neil M Robertson.\n    IMAE for noise-robust learning: Mean absolute error does not treat\n      examples equally and gradient magnitude's variance matters.\n    arXiv preprint arXiv:1903.12141, 2019.\n    \n    wang2019symmetric\n    Yisen Wang, Xingjun Ma, Zaiyi Chen, Yuan Luo, Jinfeng Yi, and James Bailey.\n    Symmetric cross entropy for robust learning with noisy labels.\n    In Proceedings of the IEEE/CVF International Conference on\n      Computer Vision, pages 322–330, 2019.\n    \n    wu2018unsupervised\n    Zhirong Wu, Yuanjun Xiong, Stella X Yu, and Dahua Lin.\n    Unsupervised feature learning via non-parametric instance\n      discrimination.\n    In Proceedings of the IEEE Conference on Computer Vision and\n      Pattern Recognition, pages 3733–3742, 2018.\n    \n    xia2019anchor\n    Xiaobo Xia, Tongliang Liu, Nannan Wang, Bo Han, Chen Gong, Gang Niu, and\n      Masashi Sugiyama.\n    Are anchor points really indispensable in label-noise learning?\n    In Advances in Neural Information Processing Systems, 2019.\n    \n    xiao2015learning\n    Tong Xiao, Tian Xia, Yi Yang, Chang Huang, and Xiaogang Wang.\n    Learning from massive noisy labeled data for image classification.\n    In Proceedings of the IEEE Conference on Computer Vision and\n      Pattern Recognition, pages 2691–2699, 2015.\n    \n    xu2019l_dmi\n    Yilun Xu, Peng Cao, Yuqing Kong, and Yizhou Wang.\n    L_DMI: A novel information-theoretic loss function for training\n      deep nets robust to label noise.\n    In Advances in Neural Information Processing Systems, 2019.\n    \n    yan2014learning\n    Yan Yan, Rómer Rosales, Glenn Fung, Ramanathan Subramanian, and Jennifer\n      Dy.\n    Learning from multiple annotators with varying expertise.\n    Machine Learning, 95(3):291–327, 2014.\n    \n    yi2019probabilistic\n    Kun Yi and Jianxin Wu.\n    Probabilistic end-to-end noise correction for learning with noisy\n      labels.\n    In Proceedings of the IEEE/CVF Conference on Computer Vision and\n      Pattern Recognition, pages 7017–7025, 2019.\n    \n    yu2019does\n    Xingrui Yu, Bo Han, Jiangchao Yao, Gang Niu, Ivor Tsang, and Masashi Sugiyama.\n    How does disagreement help generalization against label corruption?\n    In International Conference on Machine Learning, pages\n      7164–7173. PMLR, 2019.\n    \n    yu2018learning\n    Xiyu Yu, Tongliang Liu, Mingming Gong, and Dacheng Tao.\n    Learning with biased complementary labels.\n    In Proceedings of the European Conference on Computer Vision,\n      pages 68–83, 2018.\n    \n    zhang2017mixup\n    Hongyi Zhang, Moustapha Cisse, Yann N Dauphin, and David Lopez-Paz.\n    mixup: Beyond empirical risk minimization.\n    In International Conference on Learning Representations, 2018.\n    \n    zhang2018generalized\n    Zhilu Zhang and Mert Sabuncu.\n    Generalized cross entropy loss for training deep neural networks with\n      noisy labels.\n    In Advances in Neural Information Processing Systems, 2018.\n    \n    zheltonozhskii2022contrast\n    Evgenii Zheltonozhskii, Chaim Baskin, Avi Mendelson, Alex M Bronstein, and Or\n      Litany.\n    Contrast to divide: Self-supervised pre-training for learning with\n      noisy labels.\n    In Proceedings of the IEEE/CVF Winter Conference on Applications\n      of Computer Vision, pages 1657–1667, 2022.\n    \n    \n\n\n\n\n\n\n\ntocsectionAppendix\nequationsection\n\n\n \n\n\n\n§ K-NN EVALUATION\n\n\n\nWe perform the k-NN classification over the learned representations with k=200.\nFor comparisons, we removed all proposed components and reported the performance on the representations learned in a pure unsupervised manner. The clean labels are involved in testing but excluded in the training phase.\nThe results are shown in Tables <ref> and <ref>.\n\nThe representations learned by our method have consistently outperformed the unsupervised learning, regardless of label noise with different ratios. These results indicate that our method has maintained meaningful representations better than the pure unsupervised learning model.\n\n\n\n\n\n\n\n§ ASYMMETRIC LABEL NOISE\n\n\n\nTable <ref> shows the results of TCL and TCL+ for CIFAR-10/100 under different asymmetric ratios following <cit.>, where our method has consistently outperformed the competitors.\n\nWe note that, unlike symmetric label noise, the classes with above 50% asymmetric label noise cannot be distinguished, which makes 40% becomes the most extreme scenario. In addition, we found that the asymmetric label noise would make the dataset imbalance, where the assumption of uniform distribution in Sec. <ref> does not hold.\n\nHere, we employ the class imbalance ratio r=max({N_z}_z=1^K)/min({N_z}_z=1^K) used in long-tailed learning to measure whether the label distribution is uniform, where K and N_z are the numbers of classes and samples in z-th class, respectively. \nThe lower r is, the more uniform the distribution becomes. \nFor CIFAR-10 under the extreme high asymmetric label noise (40%), r=2.40; that is, the asymmetric label noise makes the dataset non-uniform.\nHowever, TCL can still achieve pleasing performance on non-uniform datasets, which suggests that TCL can effectively detect those mislabeled samples to form a uniform distribution.\nSpecifically, for those clean samples (clean probability w_i>0.5), r=1.37, which is much more balanced over noisy labels.\n\n\n"}