{"entry_id": "http://arxiv.org/abs/2303.06929v1", "published": "20230313084723", "title": "Magnetic dynamics from intrinsic spin-orbit torques in non-collinear anti-ferromagnets", "authors": ["Yiyuan Chen", "Z. Z. Du", "Hai-Zhou Lu", "X. C. Xie"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall"], "text": "\n\n\n\n\n\n\nShenzhen Institute for Quantum Science and Engineering and Department of Physics, Southern University of Science and Technology (SUSTech), Shenzhen 518055, China\nQuantum Science Center of Guangdong-Hong Kong-Macao Greater Bay Area (Guangdong), Shenzhen 518045, China\nShenzhen Key Laboratory of Quantum Science and Engineering, Shenzhen 518055, China\nInternational Quantum Academy, Shenzhen 518048, China\n\n\nShenzhen Institute for Quantum Science and Engineering and Department of Physics, Southern University of Science and Technology (SUSTech), Shenzhen 518055, China\nShenzhen Key Laboratory of Quantum Science and Engineering, Shenzhen 518055, China\nInternational Quantum Academy, Shenzhen 518048, China\n\n\nCorresponding author: luhz@sustech.edu.cn\nShenzhen Institute for Quantum Science and Engineering and Department of Physics, Southern University of Science and Technology (SUSTech), Shenzhen 518055, China\nQuantum Science Center of Guangdong-Hong Kong-Macao Greater Bay Area (Guangdong), Shenzhen 518045, China\nShenzhen Key Laboratory of Quantum Science and Engineering, Shenzhen 518055, China\nInternational Quantum Academy, Shenzhen 518048, China\n\n\n\nInternational Center for Quantum Materials, School of Physics, Peking University, Beijing100871, China\nInstitute for Nanoelectronic Devices and Quantum Computing, Fudan University, Shanghai 200433, China\nHefei National Laboratory, Hefei 230088, China\n\n\n\n\n\n\nUsing a pure electric current to control kagome non-collinear anti-ferromagnets is expected to be superior to ferromagnets and 𝒫𝒯-symmetric anti-ferromagnets in information storage and processing. However, a full description of the magnetic dynamics of the non-collinear anti-ferromagnetism driven by a pure electric current is still lacking, in particular, on intrinsic (i.e., without using external magnetic fields or external spin currents) spin-orbit torques.\nIn this work, by assembling multiple microscopic models and theoretical approaches, we self-consistently describe the relations among the electronic structure, magnetic structure, spin accumulations, and intrinsic spin-orbit torques, in the magnetic dynamics\nof a non-collinear anti-ferromagnet driven by a pure electric current. Our calculation can yield a critical current density comparable with those in the experiments. The full description will be helpful for future applications of non-collinear anti-ferromagnets.\n\n\nMagnetic dynamics from intrinsic spin-orbit torques in non-collinear anti-ferromagnets\n    X. C. Xie\n    March 30, 2023\n======================================================================================\n\n\n\nIntroduction -\nAnti-ferromagnets have been expected to replace the ferromagnets in information storage and processing, because they are robust against perturbations guaranteed by their zero stray field and have higher energy scale for ultrafast performance. However, it is hard to read out ordinary 𝒫𝒯-symmetric anti-ferromagnets (i.e., ↑↓↑↓...) because of their weak magnetization. Recently, kagome non-collinear anti-ferromagnets (Fig. <ref>) have attracted increasing attention, because they have strong anomalous Hall, Nernst, and magneto-optical Kerr effects <cit.> to serve as readout signals.\n\n\n\n\n\nUsing only pure electric current to manipulate the kagome anti-ferromagnets can greatly facilitate device applications <cit.>. Nevertheless, so far the theories mainly focus on their anomalous <cit.> and spin <cit.> Hall effects, and their magnetic dynamics driven by the extrinsic mechanisms, i.e., through spin currents injected from a proximate heavy metal assisted by a magnetic field <cit.>. A theory that fully describes the magnetic dynamics driven by a pure electric current is still lacking, in particular, on their intrinsic spin-orbit torques.\n\n\n\nIn this Letter, we theoretically show how a kagome non-collinear anti-ferromagnet can be manipulated by the intrinsic spin-orbit torques from the spin accumulations induced by a pure electric current, following the microscopic mechanism below.\n\n    Pure      Spin      Intrinsic      Magnetic\n    electric   ⇒   accumu   ⇒   spin-orbit   ⇒   dynamics\n    current      -lation      torque      of moments\n\n\n\n\nWe self-consistently calculate the electronic structure, magnetic\nstructure, spin accumulations, and intrinsic spin-orbit torques. Our calculation can yield a critical current density comparable with those in the experiments (Fig. <ref>).\nThe theory not only describes the magnetic dynamics of the kagome non-collinear anti-ferromagnet but also provides a complete simulation that will be helpful for future applications.\n\n\n\n\n\n\n\n\nIntrinsic spin-orbit torques -  First, we present the spin-orbit torques from the spin accumulations induced by the pure electric current. A typical non-collinear anti-ferromagnet can be illustrated by Mn_3Sn, which is formed by stacked bilayers along the c axis (the y axis here). One layer (denoted as A, inverted triangle in Fig. <ref>) in the bilayer is the inversion of the other (B, triangle in Fig. <ref>).\nEach layer is composed of a Mn kagome lattice and a Sn hexagonal lattice. In the unit cell of the Mn lattice, the magnetic moments of the three Mn atoms are rotated with respect to each other by nearly 120^∘, forming a non-collinear anti-ferromagnetic structure (more details in Sec. S1 of <cit.>).\nThe unit moment 𝐦_a on Mn atom a is governed by <cit.>\n\n    H_m   =   2∑_ab[J_m𝐦_a·𝐦_b+Dŷ·(𝐦_a×𝐦_b)]\n          -K∑_a(𝐞̂_a·𝐦_a)^2,\n\nwhere a,b∈{1,2,3} index the three Mn atoms in the unit cell, the first summation runs over the combinations ab∈{12,23,31},\nD measures the Dzyaloshinskii-Moriya interaction, and J_m measures the nearest neighbour exchange interaction. The D and J_m terms describe a perfect triangular non-collinear anti-ferromagnetic structure with exact 120^∘ between the Mn magnetic moments.\nThe anisotropy K term\nbreaks the in-plane U(1) symmetry and leads to six stable positions to which the magnetic structure tends to relax <cit.> [see Fig. <ref> (a)-(b)], 𝐞̂_a represents the anisotropic axis for 𝐦_a. For a successful switching, the injected current has to be above a critical value to exert enough spin-orbit torques to overcome the six stable positions. \n\n\nThe dynamics of the magnetic moments 𝐦_a is described by the Landau-Lifshitz-Gilbert equation (Sec. S2A of <cit.>)\n\n    (1+α^2)𝐦̇_a   =   |γ|/M_S𝐦_a×δ H_m/δ𝐦_a+𝐓_a\n          +α𝐦_a×(|γ|/M_S𝐦_a×δ H_m/δ𝐦_a+𝐓_a),\n\nwhere γ (<0) is the gyromagnetic ratio of the electron, α denotes the Gilbert damping coefficient,\nthe saturation moment of a Mn atom M_S=3μ_B with μ_B the Bohr magneton,\nand 𝐓_a is the spin-orbit torques induced by the electric current. Different from the extrinsic damp-like spin-orbit torques <cit.>\n𝐓_a∼𝐦_a×(𝐦_a×𝐬),\nwhich depicts the torques caused by externally injected spin currents with a uniform spin 𝐬,\nwe can show that the exchange interactions between the Mn moments and current-induced spin accumulations (Sec. S2B of <cit.>) naturally give the intrinsic field-like spin-orbit torques <cit.>\n\n    𝐓_a= 2|γ|J_sdV_U/M_Sħ𝐦_a×𝐬̃_a,\n\nwhere J_sd is the exchange interaction between the Mn moments and itinerary electron spins, V_U is the volume of the unit cell, and inter-layer anti-ferromagnetic interactions (e.g., 1-2' and 1-3') tend to synchronize the diagonal moments (i.e., 1 and 1') on two layers, so we use the averaged local spin accumulation density 𝐬̃_a=(𝐬_a+𝐬_a')/2.\nWith the help of the linear-response theory <cit.> (Derivations in Sec. S3 of <cit.>), the local spin accumulation density on Mn atom a\ninduced by a pure electric current along the x direction are found to have two parts (d for diagonal and od for off-diagonal matrix elements of the operators v and σ)\n\n    𝐬_a^d   =   eħ/2Vτ E_x∑_ν,𝐤∂ f_ν/∂ϵ_νv_νν^xσ_νν^a, \n    𝐬_a^od   =   eħ^2/2VE_x∑_μ≠ν,𝐤 (f_μ-f_ν)Im[v_μν^xσ_νμ^a/(ϵ_μ-ϵ_ν)^2] ,\n\nwhere the current density j_x injected along the x direction enters as an electric field\n\n    E_x=m^*/ e^2 n_3Dτ j_x,\n\ne=-1.6× 10^-19 Coulomb, m^* is the effective mass, n_3D is the carrier density, τ is the relaxation time, V is the volume of the system, f is the Fermi-Dirac distribution function, σ^a=(σ_x^a,σ_y^a,σ_z^a) are the Pauli matrices for the local spin density on Mn atom a, ϵ and v are the energy and group velocity operators, ν and μ label the energy bands, described by an s-d model (Sec. S4 of <cit.>)\n\n    H_sd   =   J_sd∑_i,a,n,n'𝐦_a·σ_nn'c^†_ianc^_ian'+H_e,\n\nwhere J_sd is the exchange interaction between the Mn moments (a∈{1,2,3,1',2',3'}) and spins of itinerary electrons (n∈{↑,↓}),\nand i indexes the unit cell. So far, the definite form of the itinerary electron part H_e is still under debate <cit.>.\n\n\n\nRequirement of parity symmetry breaking - Nevertheless, H_e\ncan be constructed, following the requirement of parity symmetry breaking, for the reason as follows. A parity operation transforms the current (a radial vector) to the opposite direction while leaves the Mn moments (axial vectors) invariant, which means that an opposite current could also lead to the same final state of the Mn moments, so there is no one-to-one deterministic relation between the current direction and magnetizations of the Mn moments under parity symmetry [Fig. <ref> (b)]. This can also be seen from a symmetry analysis of Eq. (<ref>) and (<ref>) (Sec. S5 of <cit.>).\n\nGuided by the requirement of parity symmetry breaking, H_e can be modelled in terms of a 2D Rashba model or a tilted 3D Weyl model. The 2D model is suitable for the interfaces of multi-domain devices while the 3D model can reproduce the Weyl-semimetal electronic structure <cit.>.\nThe 2D Rashba model reads <cit.>\n\n    H_e^R   =   λ_R∑_⟨ ia,jb⟩ nn'𝐢(𝐲̂×𝐝̂_ia,jb)·σ_nn'c^†_ianc^_jbn'\n          +t∑_⟨ ia,jb⟩ nc^†_ianc^_jbn,\n\nwhere c_ian^† (c_ian) is the creation (annihilation) operator of the electron on Mn atom a∈{1,2,3,1',2',3'} in unit cell i with spin n∈{↑,↓}, σ is the Pauli matrices of electrons, λ_R measures the Rashba-type spin-orbit coupling, 𝐝̂_ia,jb is the unit vector from site ia to jb, and t is the hopping. The 2D Rashba model breaks parity symmetry\nand couples the electric current to spin degree of freedom. Based on the previously-proposed 3D Weyl model <cit.>, we also add a y-direction linear momentum term (Δ_p) to break parity symmetry\n\n    H_e^W   =   ∑_⟨ ia,jb⟩∥c^†_iat_ia,jbc^_jb+∑_⟨ ia,jb⟩⊥c^†_iat'^_ia,jbc^_jb\n           +Δ_p∑_⟨ ia,jb⟩𝐢sgn(𝐲̂·𝐝̂_ia,jb)c^†_iac^_jb,\n\nwhere c_ia=(c_ia↑,c_ia↓)^T, ∥ and ⊥ distinguish the intra-layer and inter-layer nearest neighbor sites, t_ia,jb = t exp[±𝐢α_1σ_y/2], with + for ab∈{12, 23, 31, 1'2', 2'3', 3'1'} and - for ab∈{21, 31, 13, 2'1', 3'2', 1'3'}, t'_ia,jb=t exp[-𝐢/2sgn(𝐝̂_ia,jb·𝐲̂) α_2 (cosθ𝐝̂^∥_ia,jb+sinθ𝐲̂)·σ]. α_1, α_2, and θ are the model parameters. \n\n\n\n\n\n\n\n\n\nPrecession and nutation intrinsic torques - The parity symmetry breaking reduces the symmetries from E,P,TC_2y,TPC_2y of the perfect 120^∘ non-collinear anti-ferromagnetic structure to E,TC_2y for the 2D Rashba model, and from  {E|0},{P|0},T{C_2y|τ_y},T{PC_2y|τ_y}\n to {E|0},T{PC_2y|τ_y} for the 3D Weyl model, where E, P, T are the identical, inversion, time-reversal operations, respectively, C_2y is the two-fold rotation around the y axis (perpendicular to the kagome plane), and τ_y is the translation along the y axis for half lattice constant c/2.\n The different symmetries lead to different cases of the opposite spin accumulations that cancel with each other\n on the diagonal Mn atoms (e.g., 1 and 1' in Fig. <ref>), as listed in TAB. <ref> (details in Sec. S5 of <cit.>).\nTherefore, for the 2D Rashba model, the non-zero diagonal term of spin accumulations are in-plane and non-zero off-diagonal term of spin accumulations are out-of-plane; for the 3D Weyl model, the non-zero diagonal term of spin accumulations are out-of-plane and non-zero off-diagonal term of spin accumulations are in-plane.\nThe orientations of the spin accumulations lead to two types of intrinsic spin-orbit torques, i.e., precession and nutation.\nThe out-of-plane spin accumulations (in the y direction) provide the precession torques\n𝐦_a×𝐬̃_a and the in-plane spin accumulations (in the x-z plane) provide the nutation torques 𝐦_a×(𝐦_a×𝐬̃_a) in the Landau-Lifshitz-Gilbert equation [Eq. (<ref>)], as shown in Fig. <ref> (c).\n\n\n\nComplete simulation of magnetic dynamics - To show how the pure electric current switch the magnetic structure of the kagome non-colllinear anti-ferromagnet, we perform numerical simulations, as shown in Fig. <ref>, measured by the magnetic moment angle φ_2 of the Mn atom 2 in the unit cell.\nAs the current along the +x (-x) direction is turned on and above a critical current density, the magnetic structure can be driven to the fully-polarized position at φ_2=π/2 (φ_2=-π/2). As the current is turned off, the magnetic structure relaxes to the nearest one of the 6 stable positions.\n\nOur simulation reveals many microscopic details. (i) During the switching, the magnetic structure tends to maintain the in-plane 120^∘ triangular texture because the current-induced spin-orbit torques are much weaker than the effective fields maintaining the magnetic structure.\n(ii) The spin accumulations induce nutation and precession torques in different directions for different Mn atoms. As we can see in Fig. <ref> (c), the torques on each Mn atom form a spiral torque that rotates the whole 120^∘ structure and guides it to a fully-polarized position. At the fully-polarized position, the spin-orbit torques are balanced, guaranteed by an additional symmetry TPC_2x for the 2D Rashba model and T{C_2x|0} for the 3D Weyl models, respectively (details in Sec. S6 of <cit.>).\n(iii) We can assume that the Mn atoms feel different fields locally produced by the spin accumulations. This assumption can yield a critical current density comparable to those in the experiments.\nOtherwise, we can assume that the Mn atoms feel the same field collectively (like those in the extrinsic mechanism, where the torques are from spin currents injected from a heavy metal), but the critical current density has to be about three orders larger. \n\n\n\n\n\n\n\n\n^†Yiyuan Chen and Z. Z. Du contribute to the work equally.\nWe thank helpful discussions with Kaiyou Wang. This work was supported by the National Key R&D Program of China (2022YFA1403700), Innovation Program for Quantum Science and Technology (2021ZD0302400), the National Natural Science Foundation of China (11925402), \nGuangdong province (2020KCXTD001 and 2016ZT06D348),\n\nand the Science, Technology and Innovation Commission of Shenzhen Municipality (ZDSYS20170303165926217, JAY20170412152620376, and KYTDPT20181011104202253). The numerical calculations were supported by Center for Computational Science and Engineering of SUSTech.\n\n\napsrev4-1-etal-title_6authors\n\n\n\n\n"}