{"entry_id": "http://arxiv.org/abs/2303.07386v1", "published": "20230313180603", "title": "Speed limits and locality in many-body quantum dynamics", "authors": ["Chi-Fang Chen", "Andrew Lucas", "Chao Yin"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.quant-gas", "math-ph", "math.MP"], "text": "\n\nevery axis legend/.append style=at=(1.02,1),anchor=north west\n\n\n\ncalc, arrows\nequationsection\n   \ntheor\ntheorsection\n   \ntheor[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white\n   []\n   \n   \nexam[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white\n   []\n   \n   \n   corol[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white\n   []\n   \n   \n   prop[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white\n   []\n   \n   \n      lma[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white\n   []\n   \n\n    defn[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white\n   []\n   \n   \n   theorNB[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white,nobreak=true\n   []\n   \n   \n   corolNB[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white,nobreak=true\n   []\n   \n   \n   propNB[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white,nobreak=true\n   []\n   \n   \n      lmaNB[1][]\n theor\n  #1\n  \n     frametitle=\n         \n   \n  \n     frametitle=\n         \n   \n   innertopmargin=0pt,linecolor=, frametitlerule=false,\n             linewidth=1pt, backgroundcolor=!15!white, topline=true, frametitlebackgroundcolor=!15!white,nobreak=true\n   []\n   \n   \n\n\n\n\n\nfancy\n\n\n\n\n[C] \n\n\n    (, 0) node[text width = , right]  easter egg;\n\n\n\n\n    (0.5, -3) node[text width = ] ;\n\n\n    (0.5, 0.1) node[text width=] ;\n     (0.5, -0.5) node[text width=] ^𝖺;\n     (0.5, -1.0) node[text width=] ^𝖻;\n\n\n    (0, -13.15) node[right, text width=0.5] ;\n     (, -13.1) node[left] ;\n\n\n    [very thick, color=] (0.0, -5.75) – (0.99, -5.75);\n     (0.12, -6.25) node[left] ;\n     (0.53, -6) node[below, text width=0.8, text justified]   \n    We review the mathematical speed limits on quantum information processing in many-body systems. After the proof of the Lieb-Robinson Theorem in 1972, the past two decades have seen substantial developments in its application to other questions, such as the simulatability of quantum systems on classical or quantum computers, the generation of entanglement, and even the properties of ground states of gapped systems.  Moreover, Lieb-Robinson bounds have been extended in non-trivial ways, to demonstrate speed limits in systems with power-law interactions or interacting bosons, and even to prove notions of locality that arise in cartoon models for quantum gravity with all-to-all interactions.  We overview the progress which has occurred, highlight the most promising results and techniques, and discuss some central outstanding questions which remain open. To help bring newcomers to the field up to speed, we provide self-contained proofs of the field's most essential results.\n     ;\n\n\n\n\n\n\n\n    [very thick, color=] (0.0, -5.75) – (0.99, -5.75);\n\n\n\n\n§ \n\n  \n   \n  0pt\n  [remember picture]\n\t(0.2, 0) node[right]  ;\n\t[color=]  (0,0.37) rectangle (-0.7, -0.37);\n\t(0.0, 0) node[left, fill=]  ;\n       \n  \n*\n\n§ \n0pt20pt5pt\n\n\n\n\n\n§ INTRODUCTION\n\nWe are all familiar with the idea that there are “speed limits\" on physical dynamical processes.  For example, in special relativity, no two parties can send information faster than the speed of light c. This simple observation allows us to reconcile our notion of causality with Einstein's observation that there is no absolute time.  Consider events A and B separated (to one observer, in flat spacetime) by time Δt = t_B- t_A and distance Δr = |𝐱_B-𝐱_A|.  If Δt>0 for this observer, then all observers will find (in their own frame) \n\n    Δt^'>0  if and only if  Δr < cΔt.\n It is no stretch to say that this speed limit on information underpins our confidence in the theory of relativity, and thus in our understanding of the universe. \n\nOf course, for more “human scale\" problems, often the speed of light is effectively infinite: c≈∞.  Still, there can be important emergent speed limits on information transmission.  For example, auditory signals propagate at v_sound∼ 10^-6c.  Listening to an orchestra, it is not important that some information content of the music might in principle be transmitted at the speed of light c, because the medium through which information is transmitted is subject to a stricter non-relativistic speed limit.\n\nThis review article discusses how such stricter non-relativistic speed limits arise in quantum many-body systems.  One way this can arise is when the system is effectively described by a model of particles interacting on a lattice, which is nearly always the appropriate description of a many-body system in condensed matter or atomic physics.  On the lattice, non-interacting particles have dispersion relations with the schematic form ϵ(k) ∼ J cos (ka), where J is an energy scale and a is the lattice spacing.  The velocity of information is bounded by \n    v_group = 1/ħsup_k | ∂ϵ/∂ k| ∼Ja/ħ.\n\nIn typical condensed matter systems, this velocity is roughly 10^-3c ≲ v_group≲ 10^-2c.\n\nThe particular focus of this review is on the remarkable fact that one can prove such speed limits in a huge number of physically realistic lattice models (and, with caveats, in some continuum settings as well!).  Because the relevant literature intersects heavily with physics, mathematics, and quantum information, much of the review may be more formal and precise than a typical physics review article.  However, the subject does not require intense training in modern mathematics, but rather the creative use of simple mathematics which should be familiar to any physicist who has studied quantum mechanics. We will begin gently and guide the reader through the formal proofs of central results in the field while highlighting some more technical but important extensions in recent years, which will almost always be stated without (a full) proof.  \n\nWe remark in passing that sometimes the phrase “quantum speed limit\" is used to refer to the Heisenberg energy-time uncertainty principle <cit.>: namely, if we look at the solution to some time-independent Schrödinger equation \n    |ψ(t)⟩ = ∑_α c_αe^-iE_α t/ħ|α⟩,\n\nwith |α⟩ the eigenstates of a Hamiltonian, we can show that if ΔE is the largest difference between two E_αs represented in the above sum, |ψ(t)⟩ and |ψ(0)⟩ cannot be orthogonal before a time \n    Δt ≳ħ/ΔE.\n\nThe purpose of our review is to explain why even in the thermodynamic limit when ΔE →∞ is extensively large, there are still meaningful notions of “speed limits\" deriving from spatial locality.\n\n\nFor the remainder of the introduction, we tell a historical story that places work on Lieb-Robinson bounds into its broader context; starting in Section <ref>, we begin our formal but friendly tour through the mathematical physics of quantum speed limits.\n\n\n\n §.§ The EPR paradox\n\nProbably the first serious consideration of information propagation in quantum mechanics was in the classic paper <cit.> by Einstein, Podolsky, and Rosen.  The resulting EPR paradox goes as follows:  suppose Alice and Bob have two qubits prepared in a Bell pair <cit.>: the wave function of their “universe\" is \n    |ψ⟩ = |0⟩_ A|0⟩_ B+ |1⟩_ A|1⟩_ B/√(2)\n\nwhere |0⟩,|1⟩ represent the up and down states (in the z-direction) of a (two-level) spin-1/2 system (i.e. qubit), and A/ B denote the qubit held by Alice/Bob.   Now suppose Alice measures her qubit to be |0⟩.  No matter how far Bob is from Alice, instantly Bob's qubit is also |0⟩.   EPR believed this must communicate information, and thus quantum mechanics was not compatible with relativity and locality. \n\nActually, no information has been communicated in this process.  In particular, Bob and Alice only know their measurements agree (and confirm the state was |ψ⟩) after sending classical signals to each other announcing their measurement outcomes: these classical signals travel at most at the speed of light c.[They must also do this experiment many times to confirm that |ψ⟩ was entangled (while outcomes may differ, they always agree)!]  EPR's “paradox\" is fully compatible with relativity and locality.\n\n\n\n §.§ The Lieb-Robinson Theorem\n\nTo further constrain quantum mechanics via locality, we now claim that the Bell state |ψ⟩ is not easy to prepare.  As made precise in Section <ref>, suppose Alice and Bob are separated by distance L with two unentangled qubits |00⟩, then if \n    e^-iHt|00⟩⊗ |rest⟩ = |ψ⟩⊗ |rest^'⟩,\n\nwith “rest\" denoting any additional qubits in the universe. Then, in any lattice model the evolution time t must obey \n    t ≥L/v_LR,\n\nwhere v_LR – the Lieb-Robinson velocity – is an L,t-independent constant.  This bound holds even in a non-relativistic spin chain where c=∞.  Intuitively, v_LR∼ Ja/ħ as in (<ref>).\n\nThe way the Lieb-Robinson Theorem is stated, as we will do when we prove it in Section <ref>, is not in terms of such a Bell pair experiment.  In 1972, Lieb and Robinson instead thought more abstractly <cit.>, in terms of the operator norms of commutators of Heisenberg-evolved operators.  They proved that for any local spin model, there exists a constant μ >0 such that\n\n    ‖ [A(t),B]‖≤e^μ (v_LRt-L)\n\nwhere A,B denote Pauli matrices of Alice and Bob respectively, and A(t) = e^iHtAe^-iHt.  In Section <ref> we will, in some detail, explain the connection between this abstract bound, and the concrete constraint on preparing a Bell pair (along with many other entangled states!).  In a nutshell, only when the commutator is large O(1) can a Bell pair be formed out of |00⟩, which implies (<ref>).\n\n\n\n §.§ Applications of the Lieb-Robinson bound\n\nThe broader physics and quantum information community only seemed to become aware of the Lieb-Robinson Theorem in the past two decades.  Perhaps the most immediate reason why the Lieb-Robinson bound became better known is that in a beautiful pair of papers <cit.>, it was shown that the Lieb-Robinson bound implies the finite correlation length of any gapped ground state.  This took a curious fact about the dynamics of Heisenberg-evolved operators, and connected it to a completely different kind of question, of broad and independent interest in the quantum matter community (Section <ref>)!\n\nThe story above focuses on the ground state properties of a many-body quantum system.  But, over the past two decades, an increasingly large fraction of the theoretical physics community has begun to focus on the dynamics of large quantum systems.  Some of this focus has arisen due to developments such as a theory of many-body localization <cit.>, quantum scars <cit.>, or prethermalization (discussed in Section <ref>), which suggest that dynamics can be more complicated than textbook hydrodynamics[Yet even this subject is undergoing a revival of interest! See, e.g., the review <cit.>.].  Just as much has arisen out of the rapid and impressive developments in experimental quantum simulation  (and the baby steps toward quantum information processing and computation in the lab).   In a quantum simulator, one often studies highly excited states and, in principle, desires control over much of Hilbert space – not merely the ground state!  Lieb-Robinson bounds then limit how quickly interesting operations can be done (using unitary quantum mechanics alone) in such a simulator.  The consequences of a Lieb-Robinson bound on information spreading and correlations have been observed in actual experiments on cold atomic gases <cit.>.  \n\nLooking forward, if someday a large-scale quantum computer is built, Lieb-Robinson bounds provide very non-trivial constraints on how efficiently such a computer could operate.  When laying out physical qubits in a two-dimensional chip, one cannot perform quantum state transfer at the speed of light c – the effect is limited by the emergent Lieb-Robinson velocity! The implications of Lieb-Robinson bounds on the resources required to prepare interesting entangled states will be discussed at length in Section <ref>.\n\nLastly, the increase in classical computational power has been enormous since 1972, and papers now routinely use numerical simulation to model complex quantum dynamics, at least in small systems and at short times; in recent years, researchers have begun to consider potential usage of a quantum computer for the same task. In Section <ref>, we explain how the Lieb-Robinson Theorem gives guarantees for classical simulations accuracy, and, at the same, gives rise to provably efficient quantum algorithms.   \n\nThe increased attention to Lieb-Robinson bounds has also led to significant developments and extensions of the original Lieb-Robinson bounds to new settings.  Indeed, an unfortunate reality is that many-body quantum systems realized in the lab usually do not merely consist of spins interacting with nearest neighbors.  Charged particles interact with 1/r interactions, dipolar objects have 1/r^3 interactions, and even genuinely neutral objects have 1/r^6 van der Waals interactions. For many years, there was a theoretical effort to extend the Lieb-Robinson Theorem to systems with power-law interactions; this recently-resolved question will be the focus of Section <ref>.  Many other systems have interacting bosonic degrees of freedom, which introduces an additional subtlety (Section <ref>).  \n\nLastly, there is a profound (and not fully understood) connection between the physics captured by Lieb-Robinson bounds and the holographic theory of quantum gravity.  We will briefly describe this story in Section <ref>.   It is likely that a full resolution of these questions will require powerful generalizations of Lieb-Robinson bounds to other “norms for operator\"; we will explain this perspective in detail in Section <ref>.\n\n\n\n §.§ Outline\n\nOur review is organized into roughly two parts.   In the first part, we introduce more basic content, focusing on minimal lattice models with nearest-neighbor interactions and finite-dimensional Hilbert spaces, to give the reader a sense of the broad scope and implications of Lieb-Robinson bounds.  Section <ref> gives a lightning review of useful mathematical definitions, propositions, and conventions.  Section <ref> motivates and proves a standard Lieb-Robinson bound for dynamics on a lattice.  The next three sections all provide key applications of this technique to different problems: the simulatability of quantum dynamics (Section <ref>), bounds on entanglement and correlations (Section <ref>), and the proof that ground states of one-dimensional gapped systems have area law entanglement (Section <ref>).\nWe also include discussions of bounds on thermalization in Section <ref>, although this is a less developed area of the field.\n\nThe second part of the review focuses on more recent extensions of the Lieb-Robinson bound away from local spin models.  In Section <ref>, we introduce the notion of quantum operator growth and the Frobenius light cone, which have become of recent interest in studies of chaotic many-body dynamics (but prove mathematically interesting as well). Section <ref> describes all-to-all interacting systems, with no strict spatial locality, but still a “computer science\" notion of k-locality (which can be used to constrain operator growth and chaos).   Section <ref> describes the extension of Lieb-Robinson bounds to systems with power-law interactions, while Section <ref> extends Lieb-Robinson bounds to systems at a finite charge or energy density, and to certain bosonic systems. Lastly, our final section describes our perspective on important open problems.\n\nEarlier reviews that discuss locality bounds include <cit.>, including their tests in experiment <cit.>. Other recent reviews <cit.> discuss many-body chaos and operator growth. Our review is complementary: we provide a self-contained introduction to this subject (which can appear rather formidable to an outsider!), but also illustrate, with some depth, how the Lieb-Robinson bounds can be applied very broadly. We have found, working in this field, that often one mathematical technique will find surprising applications to multiple types of problems previously thought unrelated.  We hope that our review, organized around a few key mathematical results and their many applications, will inspire future scientists and mathematicians to uncover new results, for many years to come.\n\n\n\n§ MATHEMATICAL PRELIMINARIES\n\nWe begin by reviewing our conventions and important mathematical facts.  The reader may skim this section and refer to it as appropriate throughout the review.\n\n\n §.§ Notation\n\nThe prevailing notation is summarized by the following, admittedly scattered, collection of facts and definitions.\n\nWe denote the complex numbers by ℂ, the real numbers by ℝ, the non-negative real numbers by ℝ^+ = { t∈ℝ : t≥ 0}, and the integers by ℤ  (non-negative ones by ℤ^+). Sets, subsets, and parties (Alice/Bob) will always be denoted with uppercase serif font: 𝖠,𝖡, etc. The complement of a subset A is denoted as 𝖠^c, which consists of all elements not in 𝖠.  (The set of all elements that should be considered will be clear from the context.)\n\n\nWe use roman/upright font ,  , , to denote mathematical constants (such as = √(-1)). Variable names which are problem-specific will be italic (e.g. site/vertex i in a lattice/graph).  States in quantum mechanics are described by vectors in a Hilbert space (denoted with ℋ); this Hilbert space will mostly be finite-dimensional.  Vectors in Hilbert space are described in Dirac's bra-ket notation: |a⟩ or |ψ⟩.  Note that we will always use lower-case letters for their arguments.  Uppercase italic letters (A, B) are reserved for operators on a quantum Hilbert space, which one can often think of as matrices.  We will reserve the letter I for the identity operator: \n    I|ψ⟩ = |ψ⟩,\n\nwhile H is reserved for the Hamiltonian acting on a quantum system, generating time-evolution via the Schrödinger equation: \n    H(t)|ψ(t)⟩ = id/dt|ψ(t)⟩.\n\nHere and henceforth, we set ħ=1.  An entry of matrix A will be denoted as A_ij = ⟨ i|A|j⟩.\n\nSometimes, it is useful to think of the operators acting on ℋ as vectors themselves.  Mathematically this can be stated as follows: the set of linear transformations, which is denoted as End(ℋ), is itself a vector space.[The “End\" stands for endomorphism, which is a mathematical generalization of the notion of linear transformation to more complicated structures.] When we wish to highlight this fact (starting in Section <ref>), we will use bra-ket notation with parentheses to write down operators: for example, we write A as |A).  This notation is especially useful when we wish to use the natural notion of Hilbert-Schmidt inner product on this space: \n    (A|B):= (A^† B)/[I].\n\nThe symbol := denotes “the left-hand side of this expression is defined by the right\"; the symbol =: would mean the right is defined by the left.\nIn Section <ref>, we will find it useful to consider alternative inner products on this space.  Lastly, in the Heisenberg picture of quantum mechanics, the Schrödinger equation (<ref>) generalizes to \n    d/dt|A) = ℒ|A),\n\nwith the Liouvillian ℒ defined as \n    [H, A ]=: |A).\n\n Without using this bra-ket notation and assuming H is time-independent, we can integrate (<ref>) to find\n\n    A(t):= ^ H tA ^- H t = e^ℒtA.\n\nIt is almost always the case in this review that a result derived for t-independent H also holds for t-dependent H; so we will often write (<ref>) even when the result does hold for t-dependent H (where e^-iHt becomes a time-ordered path integral).[In the mathematics literature one often finds the notation A(t) = τ_t(A); we stick to the physics notation A(t).]\n In general, we will denote “super-operators\" (transformations on the space of operators) by curly fonts 𝒜,ℬ, etc.\n\nWe use D to denote the dimension of a finite-dimensional Hilbert space (often this will be exponentially large in the number of qubits or degrees of freedom N). The spatial dimension is denoted by d (defined below), which is never particularly large.\n\nExpectation values in quantum mechanics may be denoted with the following shorthand notation: with states, A_ψ :=⟨ψ|A|ψ⟩, while with density matrices, A_ρ := (ρ A ). The symbol 𝔼[⋯] will denote expectation value with respect to a classical probability distribution, not a quantum state, while ℙ[⋯] will denote the classical probability of an event.\n\nWe say that f(x) = O(g(x)) if there is a constant c<∞ such that |f(x)| ≤ c |g(x)| for all x and that  f(x) = Ω(g(x)) if there is a constant c >0 such that |f(x)| ≥ c |g(x)| for all x.\n\n\n\n §.§ Qubits\n\nWe will often discuss qubits: two-level systems with states |0⟩ and |1⟩. We define the Pauli matrices \n\n    X    = |0⟩⟨ 1| + |1⟩⟨ 0|, \n    \n        Y    = -i|0⟩⟨ 1| + i |1⟩⟨ 0|,\n    \n        Z    = |0⟩⟨ 0| - |1⟩⟨ 1|.\n\nOf course, the Hilbert space is often the tensor product of N two-level systems (so the Hilbert space has dimension D=2^N).  The most general operator on this system is the tensor product of the operators on each of the N two-level systems.  On a single two-level system, the most general operator can be expanded in the Pauli basis: A=a_0 I + a_1 X + a_2 Y + a_3 Z, where all coefficients a_is are real if and only if A is Hermitian.  Therefore we conclude that the most general operator on the 2^N-dimensional Hilbert space is a sum of 4^N different possible Pauli strings.   Denoting (I,X,Y,Z)  = X^a for a=0,…,3: \n    A = ∑_a_1⋯ a_N = 0^3 A_a_1⋯ a_N X^a_1⊗⋯⊗ X^a_N,   or   |A) = ∑_a_1⋯ a_N = 0^3 A_a_1⋯ a_N |a_1⋯ a_N).\n\nThe following fact will prove very useful in Section <ref>: \n \nUsing the inner product (<ref>), \n    (a_1^'⋯ a_N^'| a_1⋯ a_N) = 𝕀(a_1^'=a_1,…, a_N^'=a_N).\n\n\nThe symbol 𝕀[⋯] denotes the indicator function, which is 1 if its argument is true, and 0 if its argument is false. As is standard, we will denote with X_i^a the Pauli matrix X^a acting on qubit i, tensored with identity I on all other qubits.\n\n\n\n §.§ Graphs and local Hamiltonians\n\nMany-body quantum systems are interesting precisely because the Hamiltonian is usually expressible in a simple way. For most of this review, we will focus on Hamiltonians between N qubits that can be expressed as \n    H(t) = ∑_i=1^N ∑_a=1^3 h_i^a(t) X_i^a + ∑_i<j = 1^N ∑_a,b=1^3 h_ij^ab(t)X_i^a X_j^b.\n\nBecause H contains terms that have at most two non-identity Paulis at a time, we call H 2-local.\n\nEach 2-local Hamiltonian can be naturally described via an undirected graph 𝖦=(𝖵,𝖤), where 𝖵 is a vertex set and 𝖤 is a collection of two element subsets of 𝖵.  We place a qubit (or more generally, a degree of freedom) on each vertex v∈𝖵; we place an edge { u,v}∈𝖤 if and only if h^ab_uv(t)  0 for some a,b and t (except for in Section <ref>).  In many physics problems, one actually has a graph 𝖦 which is pre-specified - only couplings between certain qubits are permitted, so it will be natural for us to describe notions of locality and Lieb-Robinson bounds in terms of graphs.  A useful notation is to keep track of what edges are adjacent to each vertex: for v∈𝖵,\n\n    ∂ v = { e∈𝖤 : v∈ e}⊂𝖤.\n \nMore generally, for any set 𝖠⊆𝖵, \n    ∂𝖠 = { e∈𝖤: |e∩𝖠|=1}\n\ncontains the edges that connect vertices in 𝖠 to those outside of 𝖠.\nThe Manhattan distance (for us, just “distance\") 𝖽(u,v) on a graph is defined as the fewest number of edges that can be traversed to get between any two vertices. This distance measure obeys the triangle inequality: \n    𝖽(u,v) ≥𝖽(u,w) + 𝖽(w,v),    for any  w∈𝖵.\n\nThe diameter of a set 𝖲⊆𝖵 is defined as \n    diam(𝖲) = max_u,v∈𝖲𝖽(u,v).\n\nWe say that the graph is d-dimensional (as measured by constant C>0) if \n    |{ u∈𝖵 : 𝖽(u,v)≤ r}| ≤ 1+Cr^d,\n\nfor any v∈𝖵; this is, of course, satisfied by the d-dimensional lattice ℤ^d with nearest-neighbor connectivity. \n\nNaturally, one may consider k-local Hamiltonians where each of the interaction terms is k-local (e.g., X_1X_2X_3 is a 3-local term). Physically, we often take k as constant independent of the system size N.  We will not focus too much on k-local Hamiltonians in this review: many of the techniques we have described for k=2 generalize somewhat straightforwardly. We think an elegant way to generalize what is described in this review to k-local problems is the factor graph construction: see <cit.> for details.\n\n\n\n §.§ Operator norms and identities\n\n\nOperator dynamics involve complicated, high-dimensional objects. Nevertheless, we may capture its sizes using prevailing choices of matrix norms. The operator norm\n\n    A   := sup_|ψ⟩, |ϕ⟩⟨ϕ|A|ψ⟩/√(⟨ϕ|ϕ|⟨%s|%s⟩⟩ψ|ψ)\n\ncontrols the matrix element between any possible states and is equivalent to the maximal singular value; the Frobenius norm \nis the root-mean-square of singular values\n\n    A_F   := √((A^†A)/(I))\n\nwhich corresponds to its strength on random states (see (<ref>)).\nIntuitively, the operator norm and Frobenius norm respectively capture the strength of the operator over the worst and average inputs states. Naturally, the above are special cases of the Schatten p-norms at p=∞ and p=2\n\n    A_p    := \n        (((A^†A)^p/2)/[I])^1/p  for each  1 ≤ p ≤∞.\n\nIn the above, we have normalized all norms such that I_p = 1 as it appears natural in our discussions. Perhaps the most useful fact about these norms is the triangle inequality:\n    A+B_p≤A_p+B_p\n and Hölder's inequality. \n\nFor any square matrices A and B, we have\n\n    AB_r ≤A_pB_q   whenever  1/r = 1/p+ 1/q.\n\n\nIn particular, setting p=∞ yields the submultiplicativty of operator norm AB_r ≤A·B_r. \n\nFurther, since our operator is defined on a Hilbert space with a tensor product structure, it is often helpful to think about projection superoperators that isolate components of the operator according to locality. \n  \n\nFor any set A, define the projection superoperator ℙ_𝖠 that annihilates operators acting trivially on A by \n    ℙ_𝖠|a_1⋯ a_N) := 𝕀(a_j 0,  for some j∈𝖠) |a_1⋯ a_N).\n\nAlternatively, let\n\n    ℙ_𝖠:= ℐ - ℙ_𝖠^c,   then  ℙ_𝖠 A = A   if and only if   A = A_𝖠⊗ I_𝖠^c\n\nwhere  is the identity super-operator. We will say “operator A is supported on set A” or “operator A acts non-trivially only on set A” if ℙ_𝖠 A = A. \n\nIt is worth distinguishing the functionality of the two super-projectors. The super-projector ℙ_𝖠 isolates the components of the operator that do not vanish in commutators (Section <ref>); for any operator A supported on 𝖠 and any operator B, we have \n    [A,B]= [A,ℙ_𝖠B].\n\nNicely, this superoperator cannot increase any Schatten norm by too much.\n\n\n\n    The projection ℙ_𝖠 at most increases the Schatten p-norm by \n\n    ℙ_𝖠B _p≤ 2 B_p.\n\nIn particular, it is an actual orthogonal projector in the Hilbert-Schmidt inner product such that\n\n    ℙ_𝖠B _F≤B_F.\n\n\nThe super-projector ℙ_𝖲 has an elegant representation in terms of Haar averages: \n\nFor any set 𝖲 and operator A, we can present the super-projector as \n\n    ℙ_𝖲A=∫ [d U]_𝖲^c U^† A U,\n\nwhere [d U]_𝖲^c is the Haar measure for unitaries supported on set 𝖲^c. By the triangle inequality,\n\n    ℙ_𝖲A _p≤A_p.\n\n\n\nThe following identity will prove immensely useful for us when we prove Lieb-Robinson bounds:\n    \nFor any square matrices A and B of the same dimension, \n    e^(A+B)t  = e^At + ∫_0^t ds e^(A+B)(t-s)Be^As.\n\n\n\nCall the right hand side C(t), and observe that dC/dt = (A+B)C.  Explicitly evaluating the right-hand side, we find C(0)=I.  Then, solving the differential equation leads to (<ref>).\n\n\n\n\n §.§ Remark on C^*-algebras\n\nIn the mathematics literature, one often discusses Lieb-Robinson bounds using the formalism of C^*-algebras.  In a nutshell, the idea is that in an unbounded graph (e.g., 𝖵=ℤ: the one-dimensional lattice!), many-body states are not precisely defined, yet local operators are.   E.g. it is not possible to specify the state |⋯ 000⋯⟩ and always correctly set the boundary conditions at infinity; however, we can always discuss local operators, such as Pauli matrices X_j acting on site j∈𝖵, whether or not 𝖵 is a finite set.  \n\nC^*-algebras provide a rigorous language <cit.> for discussing the objects that do have precise definitions: bounded operators O which are supported on finite subsets of a (possibly infinite) vertex set 𝖵.   The key observation is that commutators of bounded local operators are also bounded local operators: this closure, and the fact that time translation is generated by commutators with a local Hamiltonian, suggests that C^*-algebras are a rigorous way to discuss the limit of infinite system size.    We feel, however, that this mathematical structure often distracts from the crucial intuition and ingredients behind making powerful Lieb-Robinson bounds relevant to concrete physics problems, and will not focus on it in this review.  \n\n\n\n§ LIEB-ROBINSON BOUNDS\n\nWe now turn to the core section of this review, where we introduce the famous Lieb-Robinson Theorem. Assuming only spatial locality, the Lieb-Robinson bounds constrain a large class of many-body quantum dynamics. Though it will take many pages to fully show it, these Lieb-Robinson bounds are remarkably versatile, especially since exact dynamics of many-body Hamiltonians are generally analytically intractable and problem-specific.  In contrast, Lieb-Robinson bounds allow us to make statements about all local systems.\n\n\n\n §.§ Warm-up: particle on a line\n\n\n Before we dive into the many-body problem, it is instructive to consider a single-particle problem on a 1d lattice (r ∈ℤ) with the Hamiltonian \n    H = -h∑_r∈ℤ( |r⟩⟨ r+1| + |r⟩⟨ r-1| ).\n\nThis is essentially a discrete-space Schrodinger equation, or in computer science literature, the (continuous-time) quantum walk <cit.>.\nWe are interested in the Schrödinger picture wave function (presented in the |r⟩ basis) \n    ψ(r,t) := ⟨ r| e^-iHt|0⟩  for   r∈ℤ^+, t∈ℝ^+.\n\nThe amplitude (squared) gives us the probability of the particle being on site r. The time evolution can be rewritten in the form of Schrödinger equation by inserting a complete basis:\n\n    d/dtψ(r,t)    = ⟨r| -  H ^- H t|0⟩ =∑_r'⟨r| -  H |r'⟩⟨r'|^- H t|0⟩ = -∑_r' H_rr'ψ(r',t).\n\nThere are many approaches to solving this problem. One is to Taylor expand in time t:\n\n    e^-iHt|0⟩   = |0⟩ - iht [ |-1⟩ + |1⟩] - (ht)^2/2[ |-2⟩ + 2|0⟩ + |2⟩] + i(ht)^3/6[ |-3⟩ + 3|-1⟩ +3|1⟩ + |3⟩] + ⋯.\n\nThe coefficients in the above expression – at each order in t – are binomial coefficients, equivalent to those that count the number of random walks analogous to a random walk (Figure <ref>).   However, if we are interested in ψ(r,t), the interference between terms at different orders can, a priori, be important:\n\n    ψ(r,t) = (-iht)^r/r! + r+21(-iht)^r+2/(r+2)!+⋯.\n\nFor this particular problem, we can find the exact solution of the oscillatory sum via exact diagonalization (<ref>). However, in the spirit of a Lieb-Robinson bound, let us only look for an inequality.  Then the argument can greatly simplify.  We take absolute values around the Schrödinger equation (<ref>):\n\n    d/dtψ(r,t)   ≤∑_r'H_rr'ψ(r',t).\n\nFor this system of ordinary differential inequalities with initial conditions, Gronwall's Lemma solves it by exponentiation:\n\n    ψ(r,t)≤∑_r' (^A t )_rr'ψ(r',0)=  ⟨r|^A t|0⟩  where   A_rr' = H_rr'≥ 0.\n\n Intuitively, this inequality amounts to ignoring the phases in the Schrödinger equation and just adding up all of the terms in (<ref>) coherently. This also explicitly reduces the bound to a combinatorial problem defined by the weighted adjacency matrix A_rr' (which is entry-wise positive). The exponential conveniently generates all paths connecting sites 0 to r:\n\n    ⟨r|^A t|0⟩   = ∑_ℓ = 0^∞(h|t|)^ℓ/ℓ!·#(paths from 0 to r with length ℓ)\n        = ∑_m=0^∞(ht)^r+2m/(r+2m)!r+2mm≤(2ht)^r/r!·∑_m=0^∞(2ht)^2mr!/(r+2m)!≤(2ht)^r/r!^2ht/r.\n\nThe second line gives precisely the coefficients of Pascal's triangle (<ref>) without phases; the inequality uses the following convenient bound on binomial coefficients and then that (r+2m)!/r! ≥ r^2m to obtain the exponential:\n\nFor positive integers a>b ≥ 0, we have\n\n    ab≤ 2^a.\n    \n \nTo further simplify, apply Stirling's approximation for the factorial (this will be suitably strong throughout the paper).\n[Stirling's approximation]\nFor non-negative integers ℓ≥ 0, we have\n\n    (ℓ/e)^ℓ  < ℓ!.\n\n\n  We deduce that \n    |ψ(r,t)| ≤(2eht/r)^r ^2ht/r.\n\nIn other words, we obtain an emergent speed limit:  asymptotically, the particle cannot travel faster than the speed \n    v_LR = 2eh   for   r →∞.\n\nWe are calling this emergent velocity v_LR, in analogy with the Lieb-Robinson velocities we will soon introduce. From the single-particle problem to the many-body problem, we will see the Lieb-Robinson bounds have a similar combinatorial flavor: counting (weighted) paths on the lattice. Since the exact dynamics of the many-body evolution now has exponentially larger dimensions and is thus much harder to solve, the bounds that generalize our argument above can become much more important!\n\n\nBefore we move on, let us comment on the tightness of these naive bounds. The reader may find the triangle inequality approach “wasteful\" – perhaps one can do a better counting to get a smaller v_LR? In Section <ref>, we will refine this approach by further utilizing the probabilistic interpretation (constraints) of |C(r,t)|^2, and show that this is indeed possible.\n\nFor concreteness, let us now compare with the exact diagonalization results; \nthe eigenvectors of the Hamiltonian H are the non-normalized plane wave states \n    |k⟩ := ∑_r∈ℤe^ikr|r⟩,\nwith eigenvalues \n    H|k⟩ = E_k |k⟩  where   E_k = -2hcos(k).\n\nThe maximal group velocity in the problem is \n    ∂ E_k/∂ k = 2hsin k ≤ 2h < v_LR.\n\nHow can anything travel faster than the fastest particle in the system?  We will return to this issue in Section <ref>; for now, we simply remark that our estimate's r-dependence is so tight that we cannot improve on the factor e in (<ref>), although the factor of 2 can be removed using the methods of Section <ref>: see (<ref>) and nearby discussion for more.\nMoreover, we can solve the problem exactly using these eigenstates.  Define the Fourier transform  \n    ψ̃(k,t) := ∑_re^ikrψ(r,t).\n\nUsing the Schrödinger equation, we find \n    ∂_t ψ̃(k,t) = 2ihcos(k)ψ̃(k,t),\n\nwhich can be solved given our initial condition \n    ψ̃(k,t) = e^2iht cos k.\n\nRewrite in terms of the n^th order Bessel function J_n\n    ψ(r,t) = ∫_0^2dk/2e^-ikrψ̃(k,t) = (-i)^ℓJ_r(2ht).\n\nUsing the Bessel function asymptotics, we confirm (<ref>) when t ≪ r. \n\n\n\n §.§ Lieb-Robinson bounds\n\nNow, let us turn to many-body quantum mechanics.  Unlike above, it will now prove more natural to discuss the time evolution of operators, rather than states.  The reason was described in Section <ref>: in the thermodynamic (large particle number limit), a quantum state is an extremely complicated object.   Not only does this make it annoying to discuss, but it also makes it fragile:  small local perturbations can completely orthogonalize a quantum state <cit.>.   For example, if |θ⟩ = cosθ |0⟩ + sinθ |1⟩,  \n    ⟨ 0⋯ 0|θ⋯θ⟩ = cos^Nθ\n\nif there are N qubits, even though |θ⋯θ⟩ is obtained from |0⋯ 0⟩ by a simple sequence of N single-qubit rotations.  As this is the type of perturbation that will arise in quantum mechanics when we look at time evolution generated by unitary e^-iHt, we will need a different notion of locality.  \n\nWith operator growth, we find such a notion:  a local operator is robust to all but the perturbations that arise near its starting location.  This follows from the trivial (but extremely important) fact that: \nIf a quantum many-body system is defined on set 𝖵, and 𝖠,𝖡⊂𝖵 obey 𝖠∩𝖡=∅, then operators A and B, which act non-trivially only on qudits in 𝖠 and 𝖡 respectively, commute:  [A,B]=0.\n  \nHence, Lieb-Robinson bounds will capture the dynamics of operators.  In particular, we will evaluate commutators of the form [A(t),B].  By this proposition, the commutator is not zero (as an operator) only when A(t) has grown enough to act non-trivially (not as the identity) in 𝖡. Formally, we often consider the following quantity\n\n    C_𝖠𝖡(t) :=  sup_A, B : ‖ A‖ =‖ B‖ =1‖[A(t),B]‖  for any sets  𝖠,𝖡⊂𝖵.\n\n\n\n  §.§.§ Warm-up: one-dimensional chain\n\n\n\n\nIt is instructive to begin by studying a one-dimensional spin chain with  nearest-neighbor interactions.  In the language of Section <ref>, this is a 2-local Hamiltonian with interaction graph 𝖦 = (𝖵,𝖤), with 𝖵=ℤ and 𝖤 = {{ n,n+1}: n∈𝖵}.  One could write, assuming that the interactions have bounded norms,\n\n    H = ∑_r∈𝖵 H_r,r+1 = ∑_e∈𝖤 H_e   such that  H_e≤ h.\n\nWe will calculate the commutator between different operators at different times:\n\n    C_0r(t) :=  sup_A_0, B_r : ‖ A_0‖ =‖ B_r‖ =1‖[A_0(t),B_r]‖/2  where   A_0(t):= ^ H tA_0^- H t.\n\n This commutator, albeit abstract, bounds numerous interesting tasks, as we show in Section <ref>: roughly speaking, it tells us the extent to which a perturbation at site r can modify an observable at site 0 after time t.  Bounding C_0r(t) becomes more complicated than the single-particle case. Naively, let us try Talyor-expanding the Heisenberg evolution \n\n    ^ H tA_0^- H t = A_0+     [H_0,1, A_0]t+  [H_-1,0, A_0]t - ∑_e_2,e_1[H_e_2, [H_e_1, A_0]]t^2/2!+⋯.\n\n\nIndeed, the leading order Taylor expansion tells us that the operator only grows “one step further\" (as in Figure <ref>) as a consequence of the spatial locality of the Hamiltonian. However, the high-order terms include all possible chains of non-vanishing commutators, which grows factorially fast because – unlike for a single particle – the operator acts on more sites as we commute with H more times, and any of these terms can cause a non-vanishing commutator at a later order.  For example, the following fourth-order term is allowed: [H_1,2,[H_-1,0,[H_1,2,[H_0,1,A_0]]]].    Directly taking absolute values of (<ref>) will give a divergent sum[This is explicitly seen by considering imaginary time evolution, as in ^β HA_0^-β H.  Here the commutator expansion is genuinely less controlled <cit.>.  A very weak notion of locality is only known in 1d spin chains <cit.>.] at constant time t= O(1).   \n\nThe key to obtaining the Lieb-Robinson Theorem is unitarity.  Indeed, because of the factors of i in the exponential, many of the terms in (<ref>) will destructively interfere with each other.  In Section <ref>, we will quantitatively use the intuition that Heisenberg operator dynamics amounts to a rotation in a high-dimensional space: in this picture, it is particularly intuitive that many of the terms in (<ref>) are just “internal rotations\" of the operator, that cannot contribute to the commutator C_0r(t).  Yet this picture is better suited for the Frobenius light cone, which is a slightly different object than C_0r(t) (see Section <ref>).\nTherefore, a bound on identifying which terms we can prove interfere requires some care. The key insight is to use unitarity to move some of the time evolution onto the operator B_r.  Defining \n    H_r := ∑_e∈𝖤 : e∋ rH_e = H_r,r+1 + H_r-1,r,\n\nwe find that\n\n    ‖ [A_0(t+ϵ),B_r]‖ =  ‖ [A_0(t),B_r(-ϵ)]‖   ≤‖ [A_0(t),B_r] -iϵ  [A_0(t),[H_r,B_r]]‖ + O(ϵ^2) \n       ≤‖ [A_0(t), B_r] +  iϵ [[A_0(t),B_r ],H_r] +iϵ  [[H_r,A_0(t)], B_r]   ‖ + O(ϵ^2) \n       ≤‖ [A_0(t), B_r] +iϵe^-iϵ H_r  [[H_r,A_0(t)], B_r] e^iϵ H_r‖ + O(ϵ^2) \n       ≤‖ [A_0(t), B_r]‖ + 2ϵ∑_e∈𝖤 : e∋ r‖ H_e ‖‖ [A_0(t),B'_e]‖  + O(ϵ^2).\n\nThe first inequality Taylor-expands the Heisenberg equation of motion, using that the commutator [H,B_r] can only survive if a term H_e in H overlaps with site r (r∈ e). The second inequality uses the Jacobi identity, while the third line conjugates the argument of the norm by an overall unitary to cancel the second term in the second line.  This unitary rotation only causes additional errors at O(ϵ^2).  The fourth line uses the triangle inequality, along with ‖ B_r‖=1 and the definition\n\n    B'_e := H_e / ‖ H_e‖  such that  ‖ B'_e‖=1.\n\nRemarkably, we see that at order O(ϵ), we have found a kind of “recursive\" relation: the bound on C_0r(t) reduces to a system of differential inequalities.   Upon taking ϵ→ 0 and defining sup_A_0 = B'_e = 1‖ [A_0(t),B'_e]‖ = C_0e(t) a la (<ref>), we find that \n\n    d/dt C_0r(t)    ≤ 2h∑_e: r∈ e  C_0e(t),\n    \n       d/dt C_0e(t)    ≤ 2h∑_e ∩ e' ∅, e  e' C_0e'(t).\n\nIntuitively, the growth of bound C_0r is bounded by C_0e: this nearly coincides with the single-particle recursion (<ref>) except that the intermediate bounds are in terms of commutators C_0e.  In fact, for our warm-up one-dimensional model, this is not a big deal, since \n    d/dt C_0,{ r,r+1}≤ 2h [ C_0,{ r-1,r} + C_0,{ r+1,r+2}];\n\nhowever, the manipulations of (<ref>) will hold for general graphs too, so we keep (<ref>) general. \n\nWe can explicitly integrate (<ref>), which is basically identical to (<ref>).  However, due to the relation (<ref>) between C_0e and C_0r, we will multiply by an overall factor of 2 in our final bound to account for the two terms in (<ref>).  Following the derivation of (<ref>), we find that\n\n    C_0r(t) ≤(4ht)^r/r!^4ht/r.\n\nNote that there is a factor of 4h instead of 2h, which arises from the extra factor of 2 coming from the fourth line of (<ref>), which itself comes from bounding the size of a commutator. \n\nIn retrospect, it is perhaps surprising that the commutator growth of a many-body quantum system, like a single-particle system, is controlled by counting over paths (instead of branching trees)!  We will make this picture even sharper in Section <ref>.\n\nAt late times, the Lieb-Robinson bounds become very weak.  Indeed, in the argument above, it is always true that \n    ‖ [A_0(t),B_r]‖≤ 2 ‖ A_0(t)‖‖ B_r‖≤ 2,\n\nSo Lieb-Robinson bounds are obviously best used outside the “light cone\" (defined by where we know that C_0r(t)<1.\n\n\n\n  §.§.§ Lieb-Robinson bounds on general graphs\n\nAs we have already noted, the manipulations in (<ref>) apply to 2-local Hamiltonians on graph 𝖦=(𝖵,𝖤) with arbitrary connectivity.  With a slight generalization to our derivation above, allowing the operators A and B to have support in sets 𝖠⊂𝖵 and 𝖡⊂𝖵,  we obtain the following theorem: \n[Lieb-Robinson bound on a general graph <cit.>]\nFor a 2-local Hamiltonian on graph 𝖦=(𝖵,𝖤), we have that\n\n    C_(t) ≤∑_ℓ = 0^∞(2|t|)^ℓ/ℓ!∑_paths Γ\n    Γ = ℓ∏_j=1^ℓ‖ H_Γ_j‖.\n\nEach path Γ=Γ_1,⋯,Γ_ℓ of length ℓ is a sequence of edges Γ_j∈𝖤 from the set =: Γ_0 to the set =:Γ_ℓ+1, satisfying the connectivity rule \n    Γ_j ∩Γ_j+1≠∅,  Γ_j ≠Γ_j+1,  ∀ j=0,⋯,ℓ,\n\nFurther, defining a symmetric real matrix indexed on 𝖵: \n\n    h_uv := {[    H_{u,v},        u≠ v; ∑_wH_{u,w},         u=v ].,\n\nwe find that\n\n    C_𝖠𝖡(t) ≤∑_u∈𝖠,v∈𝖡^2|t|h_uv.\n\n\n\n\n\n(<ref>) is derived identically to our calculation in Section <ref>, so we focus on deriving (<ref>) as a simplification of (<ref>). Since the sum over u,v in (<ref>) comes straightforwardly from considering all the initial and final points in 𝖠 and 𝖡, let us focus on Taylor expanding the exponentiated matrix exp[2h|t|]_uv, and confirming that it includes all terms in (<ref>) beginning and ending at fixed vertices: \n\n    ^2|t|h_uv   = ∑_ℓ=0^∞(2|t|)^ℓ/ℓ!∑_ u_1,⋯, u_ℓ'∈𝖵: \n     u≠ u_1, u_1≠ u_2, ⋯, u_ℓ'≠ v ∑_p_0,⋯,p_ℓ'∈ℤ_≥ 0: \n     p_0+⋯+p_ℓ'+1=ℓ-ℓ'-1 h_uu^p_0 h_uu_1h_u_1u_1^p_1 h_u_1u_2⋯ h_u_ℓ'u_ℓ'^p_ℓ' h_u_ℓ' v h_vv^p_ℓ'+1\n       = ∑_ℓ=0^∞(2|t|)^ℓ/ℓ!∑_ u_1,⋯, u_ℓ'∈𝖵: \n     u≠ u_1, u_1≠ u_2, ⋯, u_ℓ'≠ v ∑_p_0,⋯,p_ℓ'∈ℤ_≥ 0: \n     p_0+⋯+p_ℓ'=ℓ-ℓ'-1∏_j'=0^ℓ'+1∑_w≠ u_j' h_u_j'w^p_j' h_u_j'u_j'+1,\n\nwhere u_0:=u and u_ℓ'+1:=v.\nWe need to verify that each term in (<ref>) is included in (<ref>). For each Γ satisfying (<ref>), assign a vertex {u'_j}=Γ_j∩Γ_j+1 to each edge Γ_j that grows the path further. For two neighboring edges, we have two possibilities: either u'_j-1=u'_j or u'_j-1≠ u'_j. Γ_j looks like a branch for the previous case, and a part of the “core\" path for the latter case, as shown in Figure <ref>. The sequence (Γ_0,…, Γ_ℓ+1) then corresponds to (u,…,u, u_1,…, u_1, u_2,…, u_ℓ',… ,u_ℓ',v…,v), where u_j' appears p_j'+1 multiple times with ∑_j' p_j'=ℓ-ℓ'-1, and the subsequence (u',u'_1,⋯,u'_ℓ',v) obeys u'_j-1 u'_j.  The label (u',u'_1,⋯,u'_ℓ',v) and (p_0,⋯,p_ℓ'+1) then corresponds precisely to the second and the third sum in (<ref>). Thus it remains to verify for a fixed label, \n    ∏_j'=0^ℓ'+1∑_w≠ u_j' h_u_j'w^p_j' h_u_j'u_j'+1≥∑_paths Γ corresponding to\n     (u,u_1,⋯,u_ℓ') and  (p_0,⋯,p_ℓ')∏_j=1^ℓ‖ H_Γ_j‖.\n \nThis holds because we can always write any Γ included in the right-hand side as \n    Γ = u,w_01,…, u, w_0 i_p_0, uu_1, u_1w_11, …, u_1, w_1 i_p_1, u_1u_2, …u_ℓ'v, { vw_ℓ^'+1,1} ,…,\n\nwhere u_1w_11, ⋯, u_1, w_1 i_p_1 for example, are branches hanging at vertex u_1.  The left-hand side of (<ref>) includes all such terms, but overcounts them because, e.g., we are allowed to include the sum h_u_j'^2 on the left-hand side of (<ref>) in a term with p_j'=2, but on the right-hand side of (<ref>) we cannot count the same edge twice in a row.\n\n\n\n  §.§.§ Examples\n\n\n\nWe will improve the bound in Theorem <ref> and thus (<ref>) in Section <ref>, such that the diagonal elements of h_uv can actually be eliminated. However, Theorem <ref> is already useful (although not tight) in many examples, as we show here. We will drop the absolute value for time t for notational simplicity.\n\n\nSuppose the graph 𝖦 has bounded degree g, i.e., each vertex connects to at most g edges. If H_e≤ h for any e∈𝖤, then for two vertices u,v of distance r=𝖽(u,v) and a constant 0<K<∞, \n    C_uv(t) ≤  K(4(g-1)ht)^r/r!.\n\n\n\nWe relax the sum in (<ref>) by not demanding the path ends at the fixed vertex v:\n\n    C_uv(t)    ≤∑_ℓ = 0^∞(2ht)^ℓ/ℓ!·#(paths Γ starting from u with length ℓ) \n       ≤∑_ℓ = r^∞(2ht)^ℓ/ℓ! (2g-2)^ℓ = (4(g-1)ht)^r/r!∑_ℓ'=0^∞(4(g-1)ht)^ℓ' r!/(r+ℓ')!\n       ≤(4(g-1)ht)^r/r!^4(g-1)ht/r.\n\nThe second line uses the fact that each edge connects to at most 2g-2 other edges. The last two lines use manipulations analogous to the derivation of (<ref>).  Lastly, we fix the constant K by noting that if (g-1)ht ≫ r, our bound is loose anyway.  Since C_uv(t) ≤ 2, we can therefore follow the argument around (<ref>) to replace ^4(g-1)ht/r by some finite constant K.\n\n\nProposition <ref> reduces to the calculation of Section <ref> by taking g=2 (which is a one-dimensional lattice with nearest-neighbor interactions), and implies that for a general graph, information propagates under a speed limit proportional to the degree. This scaling is saturated, for example, by translational-invariant free fermions in a g/2-dimensional lattice. \n\n[Converting factorial to exponential decay]\nThe tail bound of form (vt)^r/r! is often relaxed to an exponential C^μ (vt-r) (with a μ-dependent prefactor C), where μ can be chosen to be arbitrarily large for sufficiently small t.  This follows by considering the following chain of inequalities: for r>1 \n    (ct)^r/r!≤e^-μ r( e^μ ct)^r/r!≤e^-μ r∑_n=1^∞( e^μ ct)^n/n! = e^-μ r(e^μ vt-1).\n\nfor constant v=μ^-1e^μ c. The exponential tail bound is both easier to work with when a Lieb-Robinson bound is an intermediate step in a calculation (see many examples in later sections), but is also useful because it allows us to consider exponentially-decaying interactions.  This often arises when one calculates an effective Hamiltonian in the intermediate stages of another proof (see e.g., the discussion in Section <ref>).\n\n\nOften, it is desirable to have a good Lieb-Robinson bound for Hamiltonians that have exponentially decaying interactions and are not strictly local.  A strong bound of this kind is given in Theorem <ref>, as we will use more sophisticated techniques to streamline the proof.  Here we show how to prove such a bound when the vertices 𝖠 and 𝖡 both consist of a single vertex:\n[Lieb-Robinson bound with exponentially decaying tails]\n\nLet a,b∈𝖵.  For a spatially local Hamiltonian H=∑_𝖲⊂𝖵 H_𝖲 on a graph 𝖵 in d spatial dimensions, suppose that for any u∈𝖵, \n    ∑_𝖲∋ uH_𝖲^μ'  ( diam(𝖲)-1)≤ h <∞.\n\nWe choose to define H_𝖲 0 only for connected sets 𝖲; this means that terms in H_𝖲 may not act non-trivially on all sites within 𝖲.\nThen for any 0<μ<μ', there exist constants c,v>0 such that for any disjoint ,⊂𝖵, \n    C_ab(t) ≤ c e^-μ𝖽(a,b)(e^μ vt -1).\n\n\n\n Lieb-Robinson bounds for exponentially decaying interactions are discussed in <cit.>.  We start with the following observation: for any μ < μ' and α>d, there exists a constant h^' such that  \n    h^'e^-μ (𝖽(i,j)-1)/𝖽(i,j)^α≥∑_𝖲 :{ i,j}⊆𝖲‖ H_𝖲‖.\n\nMoreover, for any two sites i,j in the vertex set 𝖵, \n    ∑_k∈𝖵∖{ i,j}e^-μ( 𝖽(i,k)-1)/𝖽(i,k)^αe^-μ ( 𝖽(k,j)-1)/𝖽(k,j)^α≤∑_k∈𝖵∖{ i,j}e^-μ (𝖽(i,j)-2)/𝖽(i,k)^α𝖽(j,k)^α≤ K e^-μ( 𝖽(i,j)-1)/𝖽(i,j)^α\n\nfor some constant 0<K<∞.  This latter fact follows from the fact that on a d-dimensional lattice, the sum over k converges rapidly at large distances as ∫dr r^d-1-2α, while at short distances only O(n^d) sites obey the product 𝖽(i,k)𝖽(k,j) ≥ n𝖽(i,j).  We have also used the triangle inequality (<ref>).\n\nUsing these facts, we now follow (<ref>) to write (here a ∈𝖲_1 and b∈𝖲_ℓ is implicit):\n\n    C_ab(t)    ≤∑_ℓ=1^∞t^ℓ/ℓ!∑_Γ of length ℓ∏_j=1^ℓ‖ H_Γ_j‖≤∑_ℓ=1^∞t^ℓ/ℓ!∑_𝖲_1: a∈𝖲_1∑_𝖲_2 : 𝖲_1 ∩𝖲_2 ∅⋯∑_𝖲_ℓ : 𝖲_ℓ-1∩𝖲_ℓ∅  2 ‖ H_𝖲_1‖· 2‖ H_𝖲_2‖⋯ 2‖ H_𝖲_ℓ‖\n       ≤∑_ℓ=1^∞(2t)^ℓ/ℓ!∑_v_1∈𝖵∑_𝖲_1: { a,v_1}⊂𝖲_1∑_v_2∈𝖵∑_𝖲_2: { v_1,v_2}⊂𝖲_2⋯∑_𝖲_ℓ-1: \n    { v_ℓ-2,v_ℓ-1}⊂𝖲_ℓ-1∑_𝖲_ℓ: { v_ℓ-1,b}⊂𝖲_ℓ‖ H_𝖲_1‖·‖ H_𝖲_2‖⋯‖ H_𝖲_ℓ‖\n       ≤∑_ℓ=1^∞(2t)^ℓ/ℓ![ ∑_v_1∈𝖵∑_𝖲_1: { a,v_1}⊂𝖲_1∑_v_2∈𝖵∑_𝖲_2: { v_1,v_2}⊂𝖲_2⋯∑_𝖲_ℓ-1: \n    { v_ℓ-2,v_ℓ-1}⊂𝖲_ℓ-1‖ H_𝖲_1‖⋯‖ H_𝖲_ℓ-1‖] h^'e^-μ𝖽(b,v_ℓ-1)-1)/𝖽(b,v_ℓ-1)^α\n       ≤∑_ℓ=1^∞(2h^' te^μ)^ℓ/ℓ!∑_v_1,…, v_ℓ-1∈𝖵e^-μ (𝖽(a,v_1)+⋯ + 𝖽(v_ℓ-1,b)/𝖽(a,v_1)^α⋯𝖽(v_ℓ-1,b)^α≤1/Ke^-μ𝖽(a,b)/𝖽(a,b)^α∑_ℓ=1^∞(2Kh^' te^μ)^ℓ/ℓ!.\n\nIn the second line above, we perform the sum over set 𝖲_ℓ by first fixing a vertex v_ℓ-1∈𝖲_ℓ-1, and then summing over all sets including that site and b; we can similarly sum over all intermediate sets by including a site v_j ∈𝖲_j∩𝖲_j+1.  Note that since this choice may not be unique, this line is an overestimate in general.  We do this because now we can carry out the sum over 𝖲_ℓ using (<ref>): this is shown in the third line.  In the fourth line, we iterate this argument to reduce the sum to the intermediate vertices v_1,…, v_ℓ-1, which are then bounded using (<ref>). We have also used  the triangle inequality on distances in the exponential.  Since 𝖽(a,b)≥ 1, we obtain (<ref>). \n\n\n\n\n §.§ Self-avoiding paths\n\nIn this section, we describe a simple yet powerful improvement of the proof technique of Theorem <ref>, based on the notion of self-avoiding or irreducible paths.\n\n\n  §.§.§ General results\n\nIn Theorem <ref>, we summed over all “paths\" of couplings H_e, including those paths that grow branches or backtrack (see Figure <ref>). In fact, a sharper bound is possible by “ignoring\" these “branches\" in Figure <ref>.  One can show that we only need to account for the self-avoiding (originally called irreducible) paths <cit.> in Figure <ref>.\n[Summing over self-avoiding paths <cit.>]\nTheorem <ref> can be improved to \n\n    C_𝖠𝖡(t) ≤∑_ℓ = 0^∞(2|t|)^ℓ/ℓ!∑_self-avoiding paths Γ\n    Γ = ℓ ∏_j=1^ℓ‖ H_Γ_j‖\n\nwhere each path Γ is a sequence of Hamiltonian terms H_Γ_j from the set 𝖠 to the set 𝖡, subject to the connectivity rule \n    Γ_i ∩Γ_j =∅ if |i-j| > 1.\n\n\n\n\nThe proof of Theorem <ref> is more intricate, and we only provide a sketch of the construction <cit.>. The key idea is to artfully manipulate the exponential: resumming most terms into new exponentials, and keeping only terms that contribute to operator growth.  The “irreducible path\" is named as the path for which if a single “irreducible coupling\" was dropped, the final commutator would vanish. This resummation is achieved via the following identity:\n\n    [B,A(t)]     = _𝖡^ t|A) = _𝖡∑_self-avoiding paths Γ⋯\n       ⋯ ∫_t<t_ℓ<⋯ <t_1\n    ℓ = Γdt_1⋯dt_ℓ e^ℒ(t-t_ℓ)ℒ_Γ_ℓe^ℒ_ℓ-1 (t_ℓ-t_ℓ-1)ℒ_Γ_ℓ-1⋯e^ℒ_1(t_2-t_1)ℒ_Γ_1e^ℒ_0t_1 |A)\n\n for appropriately chosen intermediate unitaries e^ℒ_ℓ-1 (t_ℓ-t_ℓ-1) (depending on the path Γ). Remarkably, each term in the Taylor expansion of ^ t is accounted for in exactly one self-avoiding path. With this identity at hand, we immediately see that the unitaries (containing fictitious terms) do not contribute to commutator growth after employing the triangle inequality: after all, ‖e^ℒ_j (t_j+1-t_j) A'‖ = ‖ A'‖ for any operator A'.\n\n[Irreducible path bounds for the one-dimensional line, and trees]\nFor the 1d nearest neighbor spin chain (<ref>), there is a unique irreducible path between any two points (since the graph has no cycles (a.k.a. loops) in it).  Hence, Theorem <ref> implies \n\n    C_0r(t) ≤(2h|t|)^r/r!.\n\nThis matches exactly the leading order Taylor expansion, without the higher-order terms in time t.   A similar result holds whenever the graph 𝖦 is a tree.\n\nThe following corollary follows straightforwardly from the proof of Theorem <ref>, and is useful since it bounds not only a particular commutator but also the part of the operator that can grow far away at all. \n[Lieb-Robinson bound for operator to expand]\n\nDenote \n    𝖢_r := { v∈𝖵 : 𝖽(v,𝖠) ≥ r}.\n\nThen for a spatially 2-local Hamiltonian on a graph 𝖵 with O(1) maximal degree, there exist O(1) constants 0<c,u<∞ such that \n    C_𝖠𝖢_r(t) ≤ c (ut)^r/r!.\n\n\nTo prove this result, one simply sums over all irreducible paths of length ≤ r, which are required to hit any vertex in 𝖢_r. The restriction to self-avoiding paths that Theorem <ref> allows is only quantitatively important in spatially local systems but becomes qualitatively crucial in random all-to-all models (Section <ref>) and power-law interacting systems (Section <ref>).  It also helps in the proof of the following result, which is of high value in the literature:\n\n[Lieb-Robinson bound with exponentially decaying tails]\n\nFor H defined as in Theorem <ref>, for any 0<μ < μ^',\nthere exists constants c,v>0 such that for any disjoint ,∈𝖵, \n    C_(t) ≤ c ·min(|∂|,|∂|)e^-μ𝖽(,)(e^μ vt -1).\n\n\n\nSince we have already discussed how to handle exponentially decaying interactions in Theorem <ref>, we explain here how to get the area prefactor min(|∂𝖠|,|∂𝖡|) in (<ref>).  Any self-avoiding path from 𝖠 to 𝖡 must start by intersecting some site near the boundary ∂𝖠.  For exponentially decaying interactions, the number of such paths can contribute a total weight proportional to |∂𝖠|. Once we pick the first term in the irreducible path of Theorem <ref>, then we can use Corollary <ref> to get the factor of e^-μ𝖽(𝖠,𝖡) in (<ref>).\n\n \n\n\n  §.§.§ Optimizing over equivalence classes\n\n\nSometimes in these generalizations, it proves valuable not to choose “self-avoiding paths\" in the way that we have defined above: so long as one can find any exact identity of the form (<ref>), the strategy of Theorem <ref> can be applied.  So far in the literature, this relies on finding an efficient notion of equivalence class on the set of all possible sequences of ℒ_e.  To highlight some ways that this equivalence class construction can be used, let us give two simple examples.\n\n\n[1d transverse-field Ising model]\nThe transverse field Ising model \n    H = -∑_r∈ℤ[J X_rX_r+1 + hZ_r]\n\nis a standard integrable model with a storied history <cit.>.  Naively applying the Lieb-Robinson bound of Theorem <ref> to this problem, one arrives at \n    v_LR≲ J.\n\nHowever, one can do better <cit.>. The actual sequence of coefficients that must occur to grow an operator to the right is [hZ_2,[JX_1X_2,[hZ_1,[JX_0X_1,…,]]]], since all the J terms commute.\nOur equivalence class could simply require that the irreducible coefficients in the sequence correspond to both the J and h terms above, and this leads to \n    v_LR≲√(Jh).\n\nOf course, we could simply drop the J terms if J≫ h: the irreducible terms in the sequence of (<ref>) could amount to hX_1,hX_2,….  This choice leads to \n    v_LR≲ h.\n  Clearly, there is a lot of creativity in the equivalence class construction!  \n\nThis example suggests it can be important to consider which operators in the Hamiltonian commute with other terms.  While this point was highlighted in <cit.>, they did not use the factor graph and equivalence class-based construction of <cit.>. Marrying these two approaches would be fruitful.\n\n[1d disordered spin chain]\nConsider a Hamiltonian of the form (<ref>), but now where the magnitudes h_r = ‖ H_r,r+1‖ are strongly varying from one site to the next <cit.>.  Assume for simplicity that the h_r are independent and identically distributed.    In this case, we should generalize Example <ref> and look for the weakest links between any two sites we wish to send signals between.  In general, the nature of v_LR on very large distances will depend on the distribution of J_rs. Suppose for example that we know the cumulative distribution function \n    F(h) = ℙ[|h_r| ≤ h].\n\nChoosing our equivalence classes to only include the couplings where h_r ≤ h_* for any h_*, we can bound (in the thermodynamic limit) the Lieb-Robinson velocity by: \n    v_LR≤ 2e×inf_h_*h_*/F(h_*).\n\nNotice that v_LR=0 if F(h_*) ∼ h_*^α for α<1, which happens when the probability density for small h_r diverges.\n\n\nTheorem <ref> has recently been generalized to get stronger bounds on the range/size of operators; such a technical achievement is important in proving tighter Lieb-Robinson bounds in problems with decaying interactions <cit.>.\n\n\n\n §.§ Generalization to open systems\n\nIt is straightforward to find Lieb-Robinson bounds in open quantum systems <cit.>.  We present a modern version reminiscent of Theorem <ref>:\n[ Lieb-Robinson bounds for open systems]\n\nFor local Lindbladian ℒ (i.e., generator of a completely positive unital map), defined on a graph analogous to Theorem <ref>,\n\n    C_𝖠𝖡(t) ≤∑_ℓ = 0^∞(|t|)^ℓ/ℓ!∑_self-avoiding paths Γ\n    Γ = ℓ ∏_j=1^ℓ‖ℒ_Γ_j‖_∞-∞\n\nwhere the super-operator norm is defined by\n\n    ‖ℒ‖_∞-∞: = sup_O [O]/O.\n\n  \n In an open quantum system, the intermediate terms are not unitary but still satisfy ‖e^ℒ_k t‖_∞-∞≤ 1 <cit.>: the proof of Theorem <ref> immediately generalizes to open systems!  The weaker Lieb-Robinson bounds discussed in Section <ref> can then also be derived for open systems by just replacing 2‖ H_e‖ with ‖ℒ_e‖_∞-∞ as appropriate.  It is also straightforward to extend these results to k-local Hamiltonians that couple more than two sites simultaneously.\n\n\n\n§ BOUNDS ON SIMULATABILITY\n\nA general Hamiltonian evolution requires exponentiating a large matrix. Nevertheless, exploiting locality, Lieb-Robinson bounds provide a rigorous starting point for studying the complexity of simulating many-body quantum systems on a classical computer and a quantum computer. In this section, we discuss this issue, along with many interesting extensions of Lieb-Robinson bounds that arise from this perspective.\n\n\n\n\n §.§ Lieb-Robinson bounds and local approximations for dynamics\n \nTo guide our discussion, we consider classically simulating the value of a local observable A supported in finite set 𝖠, given an initial state ρ.  In particular, we ask what is the expected value of A after a later time t: in the Heisenberg picture, this is equal to [ ρ A(t)]. At t = 0, this reduces to the marginal _𝖠[ρ_𝖠 A], where \n    ρ_𝖠 = _𝖠^cρ\n\nis the reduced density matrix of ρ on subset 𝖠.  If we know how to calculate ρ_𝖠 efficiently (which we often will), then we will classically evaluate _𝖠[ρ_𝖠 A] on a computer, which requires far fewer classical bits of memory.  As time evolves (t > 0), intuitively,  Lieb-Robinson bounds tell us that the operator A(t) will not have grown too large at small times t – if it had, then commutators C_𝖠𝖡(t) would be large for sets 𝖡 far from 𝖠.  Hence for small t, the calculation of [ ρ A(t)] should also be tractable.\n\n\n\n  §.§.§ Local approximants\n\n\nIn this section, we discuss how to formally relate the bounds on commutators to the classical simulatability implied above. In many contexts, the local approximation form of Lieb-Robinson bounds are both conceptually and technically more powerful (e.g., when the Hamiltonian has a power-law decaying tail: see Theorem <ref>).\n\nFor any operator A and vertex subset 𝖲⊂𝖵,\n\n    ℙ_𝖲A-A≤sup_B_𝖲^c =1[A, B_𝖲^c]≤ 2ℙ_𝖲A-A.\n\nRecall the definition of ℙ_𝖲 in (<ref>).\n\n\n\nThe first inequality uses the Haar integral representation (Proposition <ref>) where [d U]_𝖲 denotes the Haar measure of unitaries on set 𝖲\n\n    A - ℙ_𝖲A = ‖∫ [d U]_𝖲 (A-U^† A U)‖≤∫ [d U]_𝖲·[A,U]≤sup_B_𝖲 =1[A, B_𝖲]\n\nand applies the commutator bound for each U. The second inequality uses that\n    [A, B_𝖲] = [A-ℙ_𝖲A , B_𝖲]≤ 2A-ℙ_𝖲A\n\nfor any operator B_𝖲 with B_𝖲=1. This is the advertised result.\n\n For the task for obtaining the local marginal, _𝖠[ρ_𝖠 A], we additionally require an explicit, calculable form of the local approximation; this will also help implement the unitary dynamics efficiently on a gate-based quantum computer (Section <ref>).  We can already see how to do this by tracing back to Corollary <ref>, which we illustrate again in the following example:\n \n[Local approximation error on a 1d spin chain]\n\nConsider the Example of Section <ref>. Decompose the Hamiltonian H = H_r-1,r + (H_≤ r-1 + H_≥ r). Consider the dynamics according to a restrcted Hamiltonian Ã(t) = ^_≤ r -1 t A.  Here by construction, \n    ℙ_≤ r-1Ã(t) = Ã(t),\n\nalthough Ã(t) ℙ_≤ r-1 A(t) in general.  Still, we see that\n\n    A(t) - Ã(t)   ≤∫_0^tds _r-1,r^_≤ r-1 s A≤∫_0^tds   2h (2hs)^r-1/(r-1)!\n    = (2ht)^r/r!.\n\nThe first inequality uses Duhamel's identity (Proposition <ref>) for = _r-1,r + (_≤ r-1 + _≥ r)\n\n    A(t)    = ∫_0^t ds ^ (t-s)_r-1,r^_≤ r-1 s  A + ^_≤ r-1 t A\n\nand the unitary invariance of the operator norm.\nThe second inequality expands _r-1,r^_≤ r-1 s A into a sum over self-avoiding paths (Theorem <ref>).    \n\n\nThe local approximation holds more generally.  For any Hamiltonian, we define\n\n\n    H_𝖡   := ℙ_𝖡 H   for each set  𝖡\n    \n        H_𝖡:𝖢   := H_𝖡∪𝖢 - H_𝖡 - H_𝖢  for any disjoint sets  𝖡  and  𝖢.\n\n\n\nFor a spatially local Hamiltonian in d spatial dimensions, any regions B with complement C:= B^c, and any operator A supported on A, there exist constants μ,v, c>0 such that\n\n    ^ ( H_ B + H_ C + H_B : C )t A ^- ( H_ B + H_ C + H_B : C )t - ^- H_ B t A ^ H_ B t≤ \n                c ·∂ AAe^-μ d(A,C)(e^μ v|t| -1).\n\n\nIndeed, the error term is reminiscent of the original Lieb-Robinson bound (Theorem <ref>).   It is straightforward to generalize this result to any case where a Lieb-Robinson bound (<ref>) holds (but with an additional surface area term due to time integration).\n\nBy Duhamel's identity,\n\n    ^(_𝖡 + _𝖢 + _𝖡 : 𝖢)s A - ^_𝖡 s A   = ∫_0^t ds ^(_𝖡 + _𝖢 + _𝖡 : 𝖢)(t-s)_𝖡 : 𝖢^_𝖡 sA  \n       ≤∑_ℓ = 0^∞(2|t|)^ℓ/ℓ!∑_self-avoiding paths Γ: 𝖠→𝖢\n    Γ = ℓ∏_j=1^ℓ‖ H_Γ_j‖.\n\nThe last inequality is the observation that any path from set 𝖠 to set 𝖢 must contain a term in 𝖡:𝖢. The conversion from factorial form to exponential form is analogous to Theorem <ref>.\n\n\n\n\n  §.§.§ Classical simulation with controlled error\n \nBy approximating A(t) by an operator with strictly local support, we can efficiently simulate the expectation of local observables at short times.\n\n\nConsider a d-dimensional lattice and local operators A, B with A=1, B=1 acting on small set R with R= O(1). Consider the correlation function ⟨ A(t)B⟩_ρ_0:=tr[ρ_0A(t)B] and suppose the marginals _ S^c[ ρ_0] can be obtained at cost ^O( S). \nThen, for any ϵ>0, there exists a classical algorithm that outputs the local expectation ⟨ A(t) B⟩_ρ_0 up to error ϵ with \n\n    (classical memory and runtime)≤exp( O(vt+1/μlogc/ϵμ v)^d).\n\n\n\nBy Proposition <ref>, the Heisenberg evolution A(t) can be approximated by a strictly local Ã(t), that is evolved by the true dynamics restricted to the set of vertices S within distance L: \n\n    |⟨ A(t)B⟩_ρ_0-⟨Ã(t)B⟩_ρ_0|≤A(t)-Ã(t)B≤c/μ ve^μ (vt-L).\n\nError ϵ is guaranteed by choosing L to be sufficiently large:[A better error dependence is possible by using a stronger Lieb-Robinson bound with factorial decay.] \n    L=vt+1/μlogc/ϵμ v.\n\nThe expectation _ S[ρ_ SÃ(t)B] can be evaluated by standard linear-algebra manipulation (exact diagonalization and matrix multiplication) at cost (2^(L^D)), which is the advertised result.\n\n\n\n\n §.§ Quantum algorithms for Hamiltonian simulation\n\n\nNow, suppose we want to simulate the expectation [ρ O(t)] on a quantum computer, given some initial state ρ for a longer time t. The task boils down to Hamiltonian simulation <cit.>, that is, to approximate the true unitary evolution by a product of simple unitaries\n\n    U = ^- H t≈ V = g_1⋯ g_G.\n\nA Hamiltonian simulation algorithm must achieve the desired accuracy with minimal cost. For simplicity, one may quantify the accuracy by the spectral norm of the difference\n\n    U-V≤ϵ\n\nwhich guarantees accurate simulation of any input state with any observable\n[ O (Uρ U^† - Vρ V^†) ] ≤ 2 ϵO. The cost is often calculated in terms of the number of gates. Such Hamiltonian simulation algorithms have numerous applications in quantum chemistry <cit.> and materials science <cit.>.\n\nIn this review, we focus on how accurate simulations can be when H itself is a spatially local Hamiltonian, as we can then apply a Lieb-Robinson bound to try and prove that the simulation can be done efficiently. Just as in the classical setting, it makes sense that evolution generated by a spatially local Hamiltonian should be approximated efficiently by only local gates within the Lieb-Robinson light cone. The technical question is how to patch local evolution together to approximate continuous time dynamics well.  After all, in a local circuit, there is an exact light cone: information cannot be sent farther than the depth of the circuit (see Section <ref>).\n\nA first attempt by <cit.> is to cut the systems into non-interacting pieces, and then put the interaction back via the interaction picture, which we briefly review: \n\n\nSuppose the Hamiltonian consists of two terms H = H_0+ V. Then, \n\n    ^ H t = ^∫^t_0 V(s) ds·^ H_0 t  where   V(s) := ^ H_0 s V ^- H_0 s.\n\nHere 𝒯 denotes the time-ordered exponential.\n\n\n\n\n\nNow, suppose our system is a spatially local Hamiltonian. We may take V to be the interaction H_ B: C between two regions B,  C and H_0 to be H_ B+H_ C. Then, we expect the unitary ^∫^t_0 V(s) ds to be a quasi-local (by Proposition <ref>). One may iterate the above to cut the system into quasi-local patches, giving a quantum algorithm for simulation of spatially local Hamiltonian. The main issue with this approach is implementing the interaction picture, since the time-ordered integrals will be only quasi-local, and therefore expensive to simulate by brute force (such as directly using the Solovay-Kitaev algorithm <cit.>, whose costs generally scale with the Hilbert space dimension).\n\nThe more recent HHKL algorithm <cit.> currently serves as the state-of-the-art method for quantum simulation of spatially local Hamiltonian dynamics. Its core idea is to split the unitary evolution using back-and-forth local evolutions that circumvent the explicit interaction picture, achieved via the following lemma:\n[Patching local evolution operators without the interaction picture]\n\nFor a local Hamiltonian supported on disjoint sets A,  B , C, with 𝖽(𝖠,𝖡) = 𝖽(𝖢,𝖡) =1 but 𝖽(𝖠,𝖢)>1, and for constant time t = O(1), there is a constant μ >0 such that\n\n    ^ H_ A B C t  - ^ H_ A B t^- H_ B t^ H_ B C t≤( ^-μ𝖽(𝖠,𝖢)H_ A: BSupp(H_ A: B))\n\nwhere H_ A B:= ℙ_ A  BH and H_ A: B := H_ A B - H_ A - H_B are defined  in (<ref>) and (<ref>), and Supp(H_𝖠:𝖡) is the set on which H_𝖠:𝖡) acts non-trivially.\n\nIndeed, if the Hamiltonian is commuting, the equality holds; in the non-commuting case, the error is exponentially small in the distance between region 𝖠 and 𝖢. The terms H_ A: B and Supp(H_ A: B) scale only with the surface area and merely contribute a polylogarithmic overhead for algorithmic cost.\n\nWe begin with an elementary identity\n\n    ^ H_ A B C t  - ^ H_ A B t^- H_ B t^ H_ B C t = (^ H_ A B C t^- H_ B C t -^ H_ A B t^- H_ B t) ·^ H_ B C t.\n\nThe first term can be expanded in the interaction picture by isolating the terms cutting 𝖠 and 𝖡: \n\n    ^ H_ A B C t^- H_ B C t   = V ^ H_ A t^ H_ B C t·^- H_ B C t = V ^ H_ A t\n    ^ H_ A B t^- H_ B t   = V' ^ H_ A t\n\nwhere \n\n    V    :=exp( ∫_0^t d s^ (H_ A+H_ B C) sH_ A: B^- (H_ A+H_ B C) s)\n    \n     V'    :=  exp(∫_0^t d s^ (H_ A+H_ B) sH_ A: B^- (H_ A+H_ B) s).\n\nTherefore,\n\n    ^ H_ A B C t  - ^ H_ A B t^- H_ B t^ H_ B C t   ≤ V - V'\n       ≤∫_0^t ds ^ (H_ A+H_ B C) sH_ A: B^- (H_ A+H_ B C) s - ^ (H_ A+H_ B) sH_ A: B^-( H_ A+H_ B) s\n       ≤O( ^-μ𝖽(𝖠,𝖢)H_ A: BSupp(H_ A: B)).\n\nThe second inequality applies a telescoping sum over the time-ordered exponential. The second inequality uses Proposition <ref> and integrates over constant time t=O(1). This is the advertised result.\n\n\nRecursively using the above gives the HHKL algorithm for d-dimensional lattices (Figure <ref>). \n[The HHKL algorithm <cit.>]\nA spatially local Hamiltonian on a L×⋯ L = L^d lattice in d spatial dimensions can be simulated for time t up to ϵ error in spectral norm using \n\n    gate complexity  O(t L^d polylog(tL^d/ϵ))   and depth  O(T polylog(tL^d/ϵ)).\n\n\nThe gate complexity is essentially (up to the polylogarithmic corrections) the space-time volume of the evolution, coinciding with our physical intuition. A matching lower bound (up to polylogarithmic factors) is known by constructing a family of time-dependent circuits <cit.>. \n\n\n\n\n\n\n§ BOUNDS ON ENTANGLEMENT DYNAMICS AND CORRELATIONS\n\nNow, we use Lieb-Robinson bounds on commutators of local operators to derive (in many cases) optimal bounds on the speed with which various information-theoretic tasks (such as entanglement generation or quantum correlation/entanglement generation) can be performed. \n\n\n\n §.§ Information signaling and quantum state transfer\n\nWe start from perhaps the most directly relatable task: transmitting a qubit of quantum information across some distance in a many-body system.  A particularly explicit example is to perform state transfer during a single logical qubit initially stored on site i is stored on site f after the protocol: see (<ref>) below.  The following proposition shows that a quantum state can be transferred no faster than the Lieb-Robinson velocity v.\n\n \n\nConsider the initial state and final state of the form \n\n    |Ψ_i(α,β)⟩   :=  ( α|0⟩_i + β|1⟩_i ) ⊗|ψ_-i⟩  ,\n    |Ψ_f(α,β)⟩   :=  |ψ_-f⟩⊗( α|0⟩_f + β|1⟩_f ),\n\n\nwhere |ψ_-i⟩ and |ψ_-f⟩ are both arbitrary states on all qubits except i and f, respectively, and α^2+β^2  =  1. Then, for any unitary U,\n\n    U|Ψ_i(α,β)⟩  =  |Ψ_f(α,β)⟩  implies  ‖ U^† X_f U   Z_i‖   = 2 .\n\n\n\n\nApplying the commutator (<ref>) to the initial state (<ref>) involves two parts: \n\n    U^† X_f U Z_i   |Ψ_i(α,β)⟩   =  U^† X_f U  |Ψ_i(α,-β)⟩  =  U^† X_f  |Ψ_f(α,-β)⟩   =  U^†|Ψ_f(-β,α)⟩  =  |Ψ_i(-β,α)⟩\n    \n        Z_i U^† X_f U  |Ψ_i(α,β)⟩   =  Z_i U^† X_f  |Ψ_f(α,β)⟩  =  Z_i U^†|Ψ_f(β,α)⟩   = Z_i  |Ψ_i(β,α)⟩   =  -|Ψ_i(-β,α)⟩  ,\n\nand subtracting the second line from the first gives the commutator\n\n    U^† X_f U    Z_i |Ψ_i(α,β)⟩   =   2  |Ψ_i(-β,α)⟩\n\nwhich implies that U^†  X_f  U    Z_i  ≥  2. On the other hand, \n\n    U^† X_f U Z_i≤  2  U^† X_f U Z_i  =  2,\n\nwhich follows from\n\n    AB=AB-BA≤AB+BA≤ 2 AB  .\n\nThe upper and lower bounds on U^†  X_f  U    Z_i imply (<ref>).\n\nThis relates directly to Lieb-Robinson bounds since if the protocol U came from continuous time evolution with some local time-dependent Hamiltonian H(t), for time t≲ r/v with r the distance between i and f, then a Lieb-Robinson bound will forbid (<ref>) from being true. \n\nBy transmitting a qubit, an agent at i can send a bit of classical message to an agent at f.  Thus, sending quantum information is no faster than sending classical information. On the other hand, one may wonder if sending classical information could be strictly faster, by some protocol that encodes the classical bit into a quantum state in some more complicated way and then sends it via quantum dynamics. The answer is no since classical information also propagates no faster than the Lieb-Robinson velocity. This is summarized by:\n[Information signaling bounded by Lieb-Robinson (informal version) <cit.>]\n    Suppose the Lieb-Robinson bound (<ref>) holds. Then information (both quantum and classical) travels at a speed upper bounded by the Lieb-Robinson velocity v. \n\nRef. <cit.> uses the Holevo capacity to quantify the classical information, which is beyond the scope of this review. Here we give an intuitive argument on why Theorem <ref> should hold, generalizing the idea of Proposition <ref>.\n\nConsider Alice and Bob sitting at space-time points (x_i,0) and (x_f,t) respectively. The system starts in the state ρ_0 at time 0 when Alice accesses the system locally at site i.  It then undergoes local dynamics via unitary U until time t, when Bob tries to receive the information at site f. All correlations Bob can measure are captured by the reduced density matrix ρ_f at site f: \n    ρ_f = _{ f}^c[ Uρ_0 U^†].\n\nIf ρ_f does not depend much on what Alice did at (x_i,0), then Bob effectively cannot retrieve information. For example, suppose Alice has a bit of classical information 0 or 1 at time 0, and she either does nothing to the system if the bit is 0, or flips the spin (applies unitary X_i at time 0) if the bit is 1. Then the final state at t is either Uρ_0 U^† or UX_iρ_0 X_i U^† based on the classical bit of Alice. Although these two states may be drastically different globally, they are indistinguishable locally for Bob at f if this site is far from i. Indeed, for any operator B_f on f, its expectation value differs between the two states by an amount\n\n    [B_fUρ_0 U^† - UX_iρ_0 X_i U^†] = [ρ_0B_f(t)-X_i B_f(t) X_i] ≤B_f(t)X_i.\n\nThus if r≳ vt, the right hand side is vanishingly small for any B_f, meaning that the two states are “close to each other locally\" and Bob cannot distinguish them. In other words, in order to communicate information, the local “perturbation” by Alice's gate X_i should be able to reach Bob at time t.  The Lieb-Robinson bound tells us how quickly that can happen.\n\n\n §.§ Entanglement dynamics\n\n\nConsider a system made out of two subsystems 𝖠 and B with Hilbert space ℋ=ℋ_ A⊗ℋ_ B. For any unitary U acting on ℋ, one can ask how much it can grow local operators in one subsystem to the other. According to previous sections, one way to quantify this is to study _ B A, where A is some operator supported in A, and  is the evolution superoperator \n    A := U A U^†.\n \nNote that our choice is different than Heisenberg evolution U^† A U for later convenience. In this section, we ask how much entanglement U generates between the two parties A and B, and connect this to a Lieb-Robinson bound.\n\nFirst, to quantify entanglement, consider the Rényi entropy for any pure state |ψ⟩∈ℋ and any 0 ≤α≤ +∞\n    S_α(|ψ⟩) := 1/1-αlnρ_ A^α  where  ρ_ A=_ B |ψ⟩⟨ψ|.\n\nIn particular, we recover the von Neumann entropy at α→ 1 \n    S_1(|ψ⟩) := -(ρ_ Alnρ_ A).\n\nThe entropy S_α(|ψ⟩) is decreasing function of α such that \n    α_1 ≤α_2   implies   S_α_1(|ψ⟩) ≥ S_α_2(|ψ⟩).\n\nIn the following proposition, we show that the speed of generating the second Rényi entropy S_2 is bounded by operator growth. \n\nConsider a unitary U_ A B acting systems A B and an operator A in the form \n\n    A = |ψ_ A⟩⟨ψ_ A|⊗ I_𝖡.\n\nThen, we have \n\n    _ B_ A B A ≥ 1-^-S_2(|ψ_f⟩)/2  where  |ψ_f⟩ := U_ A B|ψ_ A⟩⊗|ψ_ B⟩\n\nfor arbitrary |ψ_ B⟩.\n\n\nAs a result, U_ AB cannot generate O(1) entanglement measured by the second Rényi entropy starting from any product state |ψ⟩ = |ψ_A⟩⊗|ψ_B⟩, unless there is a local operator A that grows sufficiently to the other party by U_ AB: _ B_ AB A=O(1). Operator growth bounds then bound the generation of all Rényi entropies S_α with α≥ 2, according to (<ref>). The bound (<ref>) is loose in the situation where U_ AB is the SWAP operation between A and B: No entanglement is generated although operators are moved around. In \nthis case, one can bound _ A_ B_ A B A instead, which we leave as an exercise. Namely, in order to generate entanglement, a local operator needs to become nonlocal instead of just swapping to the other subsystem.\n\n\nFor any bipartite system A,  B with dimensions D_ A,D_ B, consider the Schmidt decomposition of the final state |ψ_f⟩ \n    |ψ_f⟩ = ∑_j=1^min(D_ A,D_ B)√(p_j) |j⟩_ A⊗ |j⟩_ B  where  ∑^min(D_ A,D_ B)_j=1 p_j =1\n\nfor some orthonormal basis {|j⟩}_ A, {|j⟩}_ B of A and B. In this basis, we expand the evolved operator as \n    _ AB A = _ B_ AB A +  ∑_ i,j=1 ^D_ A T_ij|i⟩⟨j|_⊗ I_ B  where   T_ij = 1/D_ B⟨i|_ A_ (_ AB A) |j⟩_ A.\n\nThen, rearrange and take the operator norm to obtain\n\n    _ B_ AB A≥⟨ψ_f | _ B_ AB A |ψ_f⟩≥ 1 - ∑_j=1^D_ A p_j T_jj≥ 1 - √(∑_j=1^D_ A p_j^2)√(∑_j=1^D_ AT_jj^2)≥ 1-^-S_2(|ψ_f⟩)/2.\n\nThe second inequality uses _ AB A |ψ_f⟩ = |ψ_f⟩. The third is Cauchy-Schwartz. The last inequality uses the definition of second Rényi entropy (<ref>) and that\n\n    ∑_j=1^D_ AT_jj^2 ≤∑_ i,j=1 ^D_ AT_ij^2 ≤ D_ A∑_ i,j=1 ^D_ A T_ij|i⟩⟨j|_⊗ I_ B_F^2 ≤ D_ A_ AB A_ F^2=D_ A A_ F^2 = 1,\n\nwhich concludes the proof.\n\n\n\n\n\n  §.§.§ von Neumann entanglement outside the Lieb-Robinson light cone\n\nThere are two other potential directions to improve Proposition <ref>. Are α<2 Rényi entropies also bounded by operator growth?  Do tighter measures of operator growth, like Frobenius norm _ B_ AB A_ F, also bound entanglement generation? We give partial negative answers to these questions using explicit counterexamples. \n\n[Generating large von Neumann entanglement with little operator growth]\nConsider two systems A,  B with dimension  A= B=D and local basis {|j⟩}^D-1_0. Consider the unitary U_ AB=U_2⊕ I_D^2-2, where the nontrivial part U_2 is a 2× 2 matrix \n    U_2 = ([ √(1-ϵ)  -√(ϵ);   √(ϵ) √(1-ϵ) ])   acting on  |00⟩, |diag⟩.\n We require that 0<ϵ<1 and define the “diagonal” state to be \n    |diag⟩ = 1/√(D-1)∑_j=1^D-1 |jj⟩.\n\nThen, at large D ≫ 1 and at a constantly small ϵ >0, the unitary U_ AB generates arbitary large von Neumann entropy \n    S_1(U_ AB|00⟩)=Ω(ϵln D)\n\nyet for any local operator A, \n    _ B_ AB A≤AO(√(ϵ)).\n\n\nSimply put, the diagonal state |diag⟩ has lots of von Neumann entanglement despite being one-dimensional.\n\nTo prove (<ref>), observe that U_ AB is close to identity I: U_ AB-I≤O(√(ϵ)). Therefore, \n    _ B_ AB A = _ B (U_ AB AU_ AB^†-A)   ≤U_ AB  A U_ AB^†- A \n       ≤(U_ AB-I) A  U_ AB^† +  A  (U_ AB^†-I)≤ A O(√(ϵ)).\n\nBut (<ref>) leads to \n    U_ AB|00⟩   = √(1-ϵ)|00⟩ + √(ϵ/D-1)∑_j=1^D-1 |jj⟩, \n     S_1(U_ AB|00⟩)    = -(1-ϵ)ln(1-ϵ) + ϵlnD-1/ϵ=Ω(ϵln D)\n\nwhich verifies (<ref>).\n\n\nGiven the above example, as well as Example <ref>, any improvement of Proposition <ref> should only involve S_α with 1<α≤ 2, and operator p-norms with p>2.  Such a generalization seems to be an open problem.  See also <cit.> for further remarks on discrepancies between operator growth and entanglement generation.\n\n\n\n  §.§.§ Entanglement generation bounds from interaction strength\n\n\nIn this section, we briefly discuss entanglement generation bounds independently of Lieb-Robinson bounds, as these are of great importance on their own. Suppose systems 𝖠 and 𝖡 have limited bipartite interaction. Can we bound the rate of bipartite entanglement growth? Here, the spatial locality is not the pronounced structure but rather the bipartition of the system.\n\n\nMore precisely, suppose we begin with a pure state |ψ⟩_𝖠𝖡, and we are free to operate any unitary operator on either set 𝖠 or 𝖡. The goal is to bound the growth rate of entanglement entropy given bipartite interactions H_𝖠𝖡. The answer to this question is thoroughly addressed in a series of works <cit.>; here, we provide an elementary argument and state the sharpest result. A technical difficulty is that the sets  and  can have arbitrarily large dimensions and arbitrary entanglement structure; a resource theoretical approach appears natural for addressing this.\n\n\n    Any 2-qubit Hamiltonian evolution ^ H can be implemented using (H)- bits of bipartite entanglement entropy.\n\n\nFurther, since bipartite entanglement is non-increasing under local operations and classical communication (LOCC) (see Section <ref>), internal dynamics in  and  cannot increase the entanglement further:\n[Limited interaction means limited entanglement]\nAny 2-qubit Hamiltonian evolution ^ H_ij acting on a bipartite pure state |ψ⟩_ A  B for i ∈𝖠, j∈𝖡 can at most generate (H_ij) bits of bipartite entanglement entropy between systems 𝖠,𝖡.\n\n\nFor any systems 𝖠,𝖡 and for all initial pure states, suppose the global Hamiltonian takes the form H_𝖺𝖻+ H_𝖠 +H_𝖡 where 𝖺⊂𝖠, 𝖻⊂𝖡. Then, the bipartite von Neumann entanglement rate is bounded\nby\n\n    dS_1/dt≤ 8 H_𝖺𝖻log [min ((𝖠),(𝖡))].\n\n\nSee Section <ref> for an application to the entanglement rate in power-law interacting systems.\n\n\n §.§ Connected correlation functions\n\n\nSuppose we start from a “short-range correlated” state |ψ⟩ such as a product state on all qudits. How long does it take for two remote regions A and B to become correlated? Unlike Proposition <ref>, the correlation between the two parties A and B is not bounded by the commutator quantity C_ A B: operators in one party do not need to grow to the other in order to build up correlation. In fact, A and B can be maximally entangled (by sharing | A|=| B| pairs of Bell states) even if C_ A B=0! As one example, in a 1d spin chain with A={1} and B={2L}, consider a protocol that first locally prepares a Bell pair on sites {L,L+1} out of a product state, and then transfers the two qubits left and right to 1 and 2L respectively (using SWAP gates for example). In the final state, 1 and 2L share a Bell pair and are maximally entangled. However, a local operator A_1, after the Heisenberg evolution that is backward in time, only grows “halfway” to site L+1. Similarly, B_2L only extends to L.\n\nIn the above example, two regions of distance 2L can be correlated after time t≈ L/v. This suggests that the “correlation speed” is bounded by 2v instead of v. Indeed, this will be proven in Theorem <ref>. Prior to that, we need to first quantify a useful notion of correlation. \n\n\nDefine the connected correlation function for a state |ψ⟩ \n    _ψ( A, B) := max_A, B≤ 1A B_ψ -  A _ψB_ψ,\n\nwhere A,B are Hermitian operators acting on systems A and B.\nThen, the connected correlation satisfies \n    0≤_ψ( A, B) ≤ 1.\n\n\nIndeed, if ψ is a product state between A and B in the sense that _( A∪ B)^c|ψ⟩⟨ψ| = ρ_ A⊗ρ̃_ B, then _ψ( A, B)=0; otherwise, if A and B are maximally correlated by a Bell state ψ, then _ψ( A, B)=1. More generally, _ψ( A, B) measures how correlated A and B are, including both classical and quantum-mechanical correlation. \n\n\nThe first inequality _ψ( A, B)≥ 0 is trivial by choosing A=B=0 and that the maximum must be larger. To prove _ψ( A, B) ≤ 1, it suffices to show \n    A B_ψ -  A _ψB_ψ≤ 1\n\nfor any Hermitian operators A,B obeying A, B≤ 1. To see this, consider Hermitian operators \n    Ã = A -  A _ψ,   B̃ = B-  B _ψ\n\n\nThen, we get \n    A B_ψ -  A _ψB_ψ^2 = ÃB̃_ψ^2    ≤Ã^2_ψB̃^2_ψ\n       = A^2_ψ-A_ψ^2B^2_ψ-B_ψ^2 ≤A^2_ψB^2_ψ≤ 1.\n\nThe first inequality is Cauchy-Schwatz ⟨ψ_2|ψ_1|⟩^2 ≤⟨ψ_2|ψ_2|⟩^2⟨ψ_1|ψ_1|⟩^2. This implies (<ref>), which concludes the proof.\n\n\n\n[Bounds on correlation generation <cit.>]\n\nSuppose the initial state |ψ⟩ has a finite correlation length ξ defined by \n    _ψ( A, B) ≤c̃∂ A+∂ B^-d( A, B)/ξ,   ∀ A, B.\n\nIf the Lieb-Robinson bound (<ref>) holds with constant μ, v, then after time t, the final state |ψ_f⟩=U|ψ⟩ roughly has correlation length 2vt+ξ. More precisely, for any two subsets A, B with \n    𝖽( A, B)>2vt,\n\nthe connected correlation is exponentially suppressed \n    _ψ_f( A, B) ≤ (c+c̃) ∂ A+∂ Bexp-𝖽( A, B)-2vt/ξ+2μ^-1.\n\n\n\n\nIn the Heisenberg picture, correlation in the final state is equivalent to correlation of evolved operators in the initial state, namely \n    _ψ_f( A, B) = max_A, B≤ 1A B_ψ_f -  A _ψ_fB_ψ_f = max_A, B≤ 1A(t) B(t)_ψ -  A(t) _ψB(t)_ψ.\n\nDefine 𝖱( A,r)={i∈𝖵: 𝖽(i, A)≤ r} (and similarly for 𝖱( B,r)) with a tunable parameter r<d( A, B)/2. According to (<ref>) and Proposition <ref>, there exists an operator Ã supported in 𝖱( A,r) (and B̃ in 𝖱( B,r) such that \n    A(t)-Ã≤ c∂ A^-μ(r-vt),   B(t)-B̃≤ c∂ B^-μ(r-vt).\n\nThen, the correlation function in (<ref>) is \n    A(t) B(t)_ψ -  A(t) _ψB(t)_ψ   = A(t) [B(t)-B̃]_ψ -  A(t) _ψB(t)-B̃_ψ\n            +  [A(t)-Ã]B̃_ψ -  A(t)-Ã_ψB̃_ψ + ÃB̃_ψ - Ã_ψB̃_ψ\n       ≤B(t)-B̃ + A(t)-ÃB̃ + _ψ(𝖱( A,r),𝖱( B,r)) \n       ≤ c ∂ A+∂ B^-μ(r-vt) + c̃∂ A+∂ B^-𝖽( A, B)-2r/ξ.\n\nThe third line uses (<ref>) and the fact that correlation is proportional to the norms of each operator, due to the linearity of Cor and Proposition <ref>. The last line uses \n    B̃= B(t)-ℙ_𝖱(𝖡,r)B(t)≤B(t)=1\n\ntogether with (<ref>) and (<ref>). We choose r such that the two terms in (<ref>) are comparable: \n    r= 𝖽( A, B)+ξμ vt/2+ξμ∈vt, 1/2𝖽( A, B) ,\n\nwhich implies that \n    μ· (r-vt) = 𝖽( A, B)-2r/ξ\n\nusing (<ref>). We plug r into (<ref>) and take maximum over 𝖠,𝖡 in (<ref>) to conclude the proof.\n\n\n\n\n\n §.§ Measurement-enhanced protocols\n\nTheorem <ref> bounds the total correlation generated between two faraway regions due to time evolution. This correlation can be either quantum or classical; indeed quantum correlation is also generated by the Bell pair preparation protocol discussed (Section <ref>). \n\nThe distinction between classical and quantum correlation becomes extremely important, however, when one considers quantum dynamics with local measurements and active feedback.  Here, classical information can propagate through the “experimentalist” who performs projective measurements and applies local unitaries based on those measurements.  Since the experimentalist may only be limited by Einstein's speed of light c→∞, we should effectively consider this communication of classical information to be instantaneous.  Does this classical communication, combined with projective measurement, allow us to beat the Lieb-Robinson bound?\n\nIt may seem that the answer is obviously yes.  For example, after a measurement done at site 1, one can immediately apply a gate to site L≫ 1 that depends on the previous measurement outcome. Moreover, a local measurement is able to collapse the global quantum state, and one can apply gates adaptively based on outcomes of arbitrarily faraway measurements. \n\nHowever, the situation is exactly like the EPR paradox discussed in the Introduction. If no measurement outcomes are used for feedback, local measurements are just local completely positive trace-preserving (CPTP) maps that do not propagate information. As discussed in Theorem <ref>, Lieb-Robinson bounds also hold in open quantum systems <cit.>; one can interpret an open quantum system as one that is measured, while the measurement outcome is discarded and averaged over.\n\nWhat if measurement outcomes are used to adjust the unitary dynamics adaptively? For concreteness, consider the task of teleporting a quantum state from one end (site 1) to the other (site N=L+1) in a 1d spin chain. First, one should avoid directly measuring site 1 because the state would collapse and destroy the quantum information. Instead, site 1 needs to interact with its neighbors before some measurement is done. Thus the task depends on what the initial state is on sites 2,⋯,N.  If the sites 2 and N share a Bell pair, one can perform the following standard teleportation protocol <cit.> that takes O(1) operations.\n\n[Standard teleportation protocol]\n\nSuppose the initial state on the three relevant qubits 1,2,N is \n    |ψ⟩   = (α|0⟩ + β|1⟩)_1⊗1/√(2) (|00⟩+|11⟩)_2N\n       = 1/2 (|00⟩+|11⟩)_12⊗ (α|0⟩ + β|1⟩)_N + 1/2 (|01⟩+|10⟩)_12⊗ (α|1⟩ + β|0⟩)_N \n       + 1/2 (|01⟩-|10⟩)_12⊗ (α|1⟩ - β|0⟩)_N + 1/2 (|00⟩-|11⟩)_12⊗ (α|0⟩ - β|1⟩)_N,\n\nwhere we have expanded in the Bell-basis on 1 and 2. The first step of this protocol is to measure 1 and 2 in the Bell basis, so that the state collapses to one of the four terms above.  This can be done by measuring the commuting operators X_1X_2 and Z_1Z_2. If the measurement outcome is 1/√(2) (|00⟩+|11⟩)_12, and this classical information is transferred to an agent Bob at N, then Bob knows the state is already the honest qubit Alice at site 1 wants to transfer. If Bob knows that the measurement outcome is 1/√(2) (|01⟩+|10⟩)_12 instead, he can use an X gate on N to “correct” the state because X(α|1⟩ + β|0⟩)_N = (α|0⟩ + β|1⟩)_N. This correctability holds for the other two outcomes as well, so based on the transferred classical information about the measurement outcome, the state is honestly transferred from 1 to N deterministically, after error correction has been applied.\n\nA long-range Bell pair is consumed in the above process, which is itself hard to generate if the initial state is a product state. Starting from short-range entangled states and/or product states, it is then expected that teleportation requires large resources that scale with L.\n\n\nAs it turns out, however, such Bell pairs can be efficiently prepared using measurement-enhanced teleportation protocols that operate in constant time. This is, for example, behind the theory of measurement-based quantum computation <cit.>. Applying the identity gate on qubit on 1, in MBQC, amounts to teleporting qubit 1 to L by pure measurements.  MBQC is, in its simplest avatar, based on the cluster state which can be prepared in constant depth.  An easier version of this idea to understand is the \nquantum repeater <cit.>, or entanglement-swapping teleportation\nprotocol (ESTP) <cit.>, which teleports a qubit to distance \n    L≈ (2M+1)T,\n  \nusing T layers of unitary gates and M local measurements. Fig. <ref>(a) gives an example of L=15,T=5,M=2, where the spin chain is divided into M+1=3 parts, each of length roughly L/3. In the leftmost part, the quantum state |ψ⟩ is simply transported by SWAP gates. In each of the other parts, a Bell pair in the middle is generated and then transported to the two ends of the part by SWAP gates. Then a Bell-basis measurement is performed in each shaded area that connects adjacent parts, and all outcomes are collected to decide the error-correction unitary ℛ that recovers |ψ⟩ at the rightmost site. Conceptually, one can think of this as a cascade of standard teleportation protocols in Example <ref>, which first transfers |ψ⟩ from site A_1 to A_2 by measuring A_1,B_1, and then from site A_2 to the final site by measuring A_2,B_2.\n\n\n\n\nOne can use (<ref>) to make a tradeoff between unitary dynamics and measurements in a quantum teleportation protocol. Is (<ref>) the best one can achieve in all possible protocols with M measurements and unitary dynamics of time T? <cit.> gives a positive answer by extending Lieb-Robinson bounds to this setting of quantum dynamics with measurements. The idea comes from examining the ESTP in the operator language. Fig. <ref>(b) shows how the final logical operator X_N is evolved in the Heisenberg picture (backward in time). Since the protocol can be schematically written as 𝒲= U, which does measurements  and applies an adaptive gate  in the end, X_N is first evolved to ^†^† X_N =X_N Z_A_1Z_A_2 acting on the measurement sites A_1,A_2. Then these two “seeds” together with X_N, will grow into light cones due to the circuit dynamics U. In order to teleport the quantum information, the evolved operators 𝒲^† X_N 𝒲=U^†^†^† X_N  U and 𝒲^† Z_N 𝒲 need to commute on all sites except 1. This turns out to require that the light cones not only need to touch site 1, but also need to overlap with their neighboring light cones, which makes (<ref>) optimal. This is formalized by the following Theorem.\n\n[Speed limit in quantum dynamics with measurements (informal version)]\nConsider a teleportation protocol that starts from a product state of all qubits, and teleports a qubit to distance L using measurements in M local regions and unitary dynamics of time T. The unitary dynamics is generated by a time-dependent Hamiltonian H(t) that may depend on previous measurement outcomes. The measurement regions are also allowed to be adaptive. If the pure unitary dynamics generated by H(t) has Lieb-Robinson velocity v, then there exist constants M_0,T_0 that do not depend on L,M,T, such that \n    L≤ v(2M+M_0)(T+T_0).\n\n\n\nAlthough we refer to <cit.> for the detailed proof, we would like to mention one key idea called Stinespring dilation <cit.>. To be specific, any quantum channel, like the dynamics with measurement and feedback, is equivalent to a unitary channel on a “dilated” Hilbert space ℋ_dil=ℋ_phys⊗ℋ_ss. Here ℋ_phys is the physical Hilbert space, while ℋ_ss is composed of ancilla Stinespring qubits that record the measurement outcomes. This justifies our previous notations like 𝒲= U. The above Theorem then comes from applying the Lieb-Robinson methods to this dilated unitary dynamics.   The theorem makes clear that not only the act of measurement, but also subsequent error correction, is required to beat a Lieb-Robinson bound; see also <cit.>.\n\nTheorem <ref> also has various generalizations and applications <cit.>. To name a few, the initial state can be generalized to all states with short-range entanglement. If one wants to teleport Q≫ 1 qubits to distance L with Hamiltonian dynamics of time T, although M measurement regions satisfying (<ref>) suffice, the number of measurements done M' should scale with Q such that \n    L≲ 2vTM'/Q+1,\n \n(with a technical caveat that measurement locations do not depend on measurement outcomes).  \nBeyond quantum state transfer, (<ref>) also bounds the resources needed for preparing long-range entangled states, including long-range Bell pairs, error correcting code states  <cit.>, the GHZ state (<ref>), W state (<ref>), and spin-squeezed states <cit.>.  This theorem also has strong implications on the ease with which many tasks, such as preparing highly entangled quantum states, can be achieved using hybrid protocols involving both unitary dynamics and measurement.  This has been a subject of intense recent interest <cit.>.\n\n\n\n§ GROUND STATES OF GAPPED SYSTEMS\n\nSo far, we have only applied the Lieb-Robinson bounds to dynamics. Remarkably, we will see that this temporal bound also implies spatial bounds for properties of gapped systems. Historically, analyzing the ground states of gapped systems using Lieb-Robinson bounds <cit.> was what popularized the Lieb-Robinson Theorem in the broader physics community.\n\nThis section assumes that the lattice Hamiltonian H is time-independent, with a Lieb-Robinson bound given by (<ref>).\nWithout loss of generality, we also assume the Hamiltonian is non-negative H≥ 0 with ground energy zero;\nthe ground subspace projector P_0 satisfies HP_0 = 0. As a crucial assumption, we impose the existence of a spectral gap Δ>0 above the ground states.\n\n\n\n §.§ Exponential clustering of gapped ground states\n\nWe define the connected correlation for any ground state |ψ⟩ such that P_0|ψ⟩ = |ψ⟩ as follows\n\n    Cor_ψ( A,B) :=   max_A, B≤ 1 ⟨ AB ⟩_ψ - 1/2[⟨ AP_0B ⟩_ψ + ⟨ B P_0 A ⟩_ψ], \n     =   max_A, B≤ 1 ∑_ϕ:E_ϕ≥Δ⟨ A |ϕ⟩⟨ϕ| B⟩_ψ + 1/2⟨ AP_0B ⟩_ψ -1/2⟨ B P_0 A ⟩_ψ,\n \nwhere ·_ψ :=⟨ψ|·|ψ⟩, A,B are operators acting in subsystem A,B respectively. The second line exposes the excited states |ϕ⟩ with energy E_ϕ≥Δ. Technically, the above definition is not equivalent to (<ref>): They coincide if the ground state is unique P_0=|ψ⟩⟨ψ|. However, if the ground subspace is degenerate, a ground state may have long-range correlations, i.e., ( A,B) does not decay with the distance between A and B. For example, consider the Greenberger–Horne–Zeilinger (GHZ) state <cit.> \n    |ψ⟩=| GHZ⟩:=1/√(2)| 0⟩ + | 1⟩,\n  \nwhere | 0⟩ is the product state where all sites are in state 0 (analogously for | 1⟩). |ψ⟩ is a ground state of the Ising Hamiltonian H=∑_⟨ij|⟩Z_i Z_j, and is highly entangled. However, Cor_ψ( A,B) defined above vanishes as long as A and B do not overlap. \n\nThe following theorem generalizes the above example to arbitrary gapped ground states: the connected correlations Cor_ψ( A,B) decay exponentially in the distance. \n\n[Exponential clustering of gapped ground states <cit.>]\nSuppose the Lieb-Robinson bound (<ref>) holds for the Hamiltonian H with gap Δ, and ground state energy 0. Then, for any ground state |ψ⟩ and any ϵ∈ (0,1), \n    Cor_ψ( A, B) ≤(1+ √(2/πeϵ)cμ v/Δ) e^-(1-ϵ)μ𝖽( A,B).\n\n\n\nTo bound the connected correlations with Lieb-Robinson bounds, one begin with expanding the commutator in the eigenbasis of H\n\n    ⟨ [A(t), B]⟩_ψ   = ⟨ A(t) B⟩_ψ - ⟨  BA(t)⟩_ψ\n       = ⟨ AP_0B ⟩_ψ - ⟨ B P_0 A ⟩_ψ+ ∑_ϕ:E_ϕ≥Δe^-itE_ϕ⟨ A |ϕ⟩⟨ϕ| B⟩_ψ - e^itE_ϕ⟨  B|ϕ⟩⟨ϕ|A⟩_ψ.\n\nThe second line uses the assumption that the ground state has zero energy P_0A(t)P_0=P_0AP_0. \n\nThe insight that converts temporal bounds (Lieb-Robinson) to spatial bounds (decay of correlation) is spectral filtering <cit.>: consider a kernel function K(t) whose Fourier transform is denoted by \n\n    K̂(E) = ∫^∞_-∞ t   K(t) ^- tE,\n\nwith normalization \n    K̂(0)=∫^∞_-∞dt   K(t) = 1/2.\n\nThen, we may approximate the connected correlation by the weighted time-integral of (<ref>)\n    Cor_ψ( A, B) = max_A, B≤ 1[ ⟨  B𝒦_-A⟩_ψ - ⟨ A 𝒦_+ B⟩_ψ + ∫^∞_-∞K(t)⟨ [A(t), B]⟩_ψdt]\n\nwith “error” operators \n    𝒦_+    :=∑_ϕ:E_ϕ≥Δ(K̂(E_ϕ)-1)|ϕ⟩⟨ϕ|,\n    𝒦_-   :=∑_ϕ:E_ϕ≥ΔK̂(-E_ϕ)|ϕ⟩⟨ϕ|.\n\n\nTo proceed, we impose two requirements for the kernel K(t).  (1) The Fourier transform approximates a step function:\n    \n    K̂(E) ≈\n            1  if   E≥Δ\n    \n            0  if   E≤ -Δ.\n\n    This ensures both error operators 𝒦_+ and 𝒦_- are small.\n  (2) The kernel K(t) decays sufficiently fast at large |t|, so that the last term in (<ref>) is tightly bounded.\nOur choice is the Gaussian filter with tunable variance \n    K(t) =i/2πlim_ϵ^'→ 0+e^-α t^2/t+iϵ^'.\n\n Indeed, it decays exponentially, and satisfies (<ref>). Furthermore, one can calculate its Fourier transform: \n[Fourier transform of the error function]\nIf Erf(x):=2/√(π)∫^x_0dξ e^-ξ^2 is the error function,\n\n    K̂(E) = 1/2(1+Erf(E/2√(α)))= {\n            1+ O(e^-E^2/4α),      (E>0), \n    O(e^-E^2/4α),      (E<0). \n        .\n\n\nConsequently, the norm of operators 𝒦_+ and 𝒦_- are both bounded by e^-Δ^2/4α/2. Together with  (<ref>), we can bound the connected correlation \n    Cor_ψ( A,B)    ≤e^-Δ^2/4α +ce^-μ𝖽( A,B)∫^∞_-∞|K(t)| (e^μ v|t| -1)dt \n       =e^-Δ^2/4α +cμ v/πe^-μ𝖽( A,B)∫^∞_0 e^μ vte^-α t^2dt ≤e^-Δ^2/4α +cμ v/πe^-μ𝖽( A,B)√(π/α)\n       = (1+ 2cμ v/√(π)Δ√(μ𝖽( A,B))) e^-μ𝖽( A,B)≤(1+ √(2/πeϵ)cμ v/Δ) e^-(1-ϵ)μ𝖽( A,B).\n\nThe second line's inequality uses the elementary bound e^x-1≤ xe^x for x≥ 0. The last line optimizes the tunable parameter \n    α = Δ^2/4μ𝖽( A,B)\n\nand used the estimate √(2eϵ x)e^-x≤e^-(1-ϵ)x for x≥ 0 and ϵ>0. This is the advertised result.\n\n\n\n\n §.§ Local properties of gapped systems\n\n\nTheorem <ref> on exponential clustering implies that in a (unique) gapped ground state, a region A does not have much correlation with faraway vertices. Then A basically correlates with A^ c only via the vertices near the boundary ∂ A, so one naturally conjectures that the entanglement entropy of A is bounded by an area law \n    S_ A =  O∂ A.\n\nThis area law is proven <cit.> for general 1D gapped systems originally by Hastings, using Lieb-Robinson techniques. With refinements <cit.> afterward, the result is summarized as follows. \n[Area law of 1D gapped ground states <cit.>] \nConsider a chain of q-dimensional qudits with a unique ground state that has a gap Δ. Then the entanglement entropy across any cut is bounded by Olog^3 q/Δ.\n\nThe gap condition is explicitly used in the proof, which we omit here.[Gapless states generically do not have area laws: e.g. a lattice regularization of a conformal field theory <cit.>.] On the other hand, any state in 1D satisfying the exponential clustering condition is proven to obey an area law <cit.>, so an area law for 1D gapped ground states directly follows Theorem <ref>, if one does not care about the scaling of the entanglement with the gap, etc. As an application, Theorem <ref> guarantees that 1D gapped ground states can be faithfully approximated by matrix product states (MPSs) with bound dimension sublinear in N <cit.>, in contrast to exp(N) for general states. Based on the MPS representation, efficient classical algorithms have been developed for calculating the ground state and its properties. For example, the heuristic algorithm called density matrix renormalization group (DMRG) had been widely used <cit.>; a closely related algorithm with provable guarantees was later proposed <cit.>.\n\nIn higher dimensions, the area law (<ref>) is an important open problem. We refer to the literature <cit.> on recent progress, for example, a proof for 2D frustration-free systems <cit.>. For general graphs, see <cit.> for a counterexample that violates (<ref>) explicitly.\n\nInstead of assuming a gap for a single Hamiltonian H, one can consider a family of Hamiltonians {H(s):0≤ s≤ 1}    \nwith the local terms in H(s) depending on s continuously. We assume the ground states have a gap lower bounded by Δ for the entire family of Hamiltonian H(s). This assumption is common in condensed matter settings, where one says that two H belong to the same phase of matter if and only if this interpolation exists. Intuitively, ground state properties of two Hamiltonians are qualitatively the same if they are in the same phase, so one can study solvable points in the phase space, and generalize results to the whole phase. \n\nRemarkably, the above intuition can be made rigorous. As proven in <cit.>, the ground state subspace (defined by projectors P(0) and P(1)) of H(0) and H(1) are connected by a quasi-local unitary U \n    P(1) = U P(0) U^†.\n\nHere U is quasi-local in the sense that it is generated by a finite-time evolution of some sufficiently local (time-dependent) Hamiltonian H̃ (where local terms decay exponentially with the support size). Local operators are mapped to local operators by U due to Lieb-Robinson bound, so the local properties of P(0) and P(1) are smoothly connected. Moreover, H̃ acts nontrivially only near places where H(s) changes with s. This implies that the ground states locally only depend on terms in H that lie in the neighborhood of that local region, dubbed “local perturbations perturb locally”. The quasi-local unitary U is called “quasi-adiabatic continuation (evolution)”, and has many other applications <cit.>, including a rigorous proof of quantization of Hall conductance <cit.>.\n\nAbove, we have seen the consequences of locality assuming the gap condition. Perhaps surprisingly, Lieb-Robinson bounds also play an important role in deciding whether a Hamiltonian is gapped or not (more precisely, how large the gap is), despite the fact that this spectral gap problem is undecidable in general <cit.>. In fact, the revisiting of such bounds originates from such a problem. In 1961, Lieb, Schultz, and Mattis (LSM) proved that a periodic chain of half-integer spins cannot have a Ω(1) gap above the ground state <cit.>. Hastings generalized this LSM theorem to higher dimensions using the quasi-adiabatic continuation method:\n[Lieb-Schultz-Mattis theorem in higher dimensions <cit.>] \nConsider a local Hamiltonian H on a finite-dimensional lattice. Suppose there is one direction of length L, along which H is translational invariant with periodic boundary conditions. Suppose the total number of vertices N= poly(L). Let H have a conserved charge Q and ground state |ψ⟩. If the ground state filling factor ⟨ψ|Q|ψ⟩/L is not an integer, then the gap between |ψ⟩ and the first excited state is bounded by \n    Δ =  Olog L/L.\n\n\n\nOn the other hand, Lieb-Robinson techniques are also used to prove an Ω(1) gap for some H that is close to a gapped H_0. To be specific, consider H=H_0+V where V is an extensive sum of local terms each of order ϵ≪Δ. The naive perturbation theory typically diverges for this many-body setting, and the gap is not stable in general. For example, the gap closes already at ϵ∼ 1/N when perturbing the Ising Hamiltonian H_0=-∑_⟨ij|⟩Z_i Z_j by a magnetic field V=ϵ∑_i Z_i. It is then a remarkable fact that for frustration-free H_0 with local topological order, the gap is provably stable <cit.>. \n\n\n\n\n\n§ BOUNDS ON THERMALIZATION\n\nIn this section, we return to bounds on dynamics.  In particular, we will describe the extent to which Lieb-Robinson bounds can give meaningful constraints on the thermalization time scales <cit.> observed in local correlation functions. Results in this area are more limited, and overall this is an interesting area for further exploration; we will highlight what is known.\n\n\n\n §.§ Relaxation times of local observables\n\nConsider a quantum system in initial mixed state ρ evolved under Hamiltonian H. On physical grounds, we expect equilibration of local observable A after some time t_thermal such that \n\n    [ρ A(t_thermal)] ≈[ρ_thermal A].\n\n\nCan we bound this thermalization time t_thermal based on Lieb-Robinson bounds? Assuming a Hamiltonian of the form (<ref>), we have \n    [ρ A(t)]-[ρ A(0)]   ≤A(t)-A(0) = ∫^t_0 d s ^ sH [H, A]^- sH\n       ≤ t[H,A]≤ tA∑_e∈𝖤:e∩𝖠≠∅H_e.\n\nAllowing ρ to be locally perturbed away from equilibrium, so that | [ρ A] - [ρ_thermalA]| ∼A, we obtain \n    t_thermal≳∑_e∈𝖤:e∩𝖠≠∅H_e^-1.\n\nThis also holds for relaxation of time-ordered correlation functions [ρ A(t)B(0)], because one can insert the B(0) in the left-hand side of (<ref>), with the result unchanged assuming B=1.\n\nAs a simple generalization, suppose H=H_0+V where H_0 does not yield thermal dynamics. We bound thermalization by the local norm of V alone, which is useful when V is a weak perturbation <cit.>.\n\nConsider a perturbed local Hamiltonian H=H_0+V on a d-dimensional lattice. If H_0 obeys the Lieb-Robinson bounds(<ref>), then \n    [ρ A(t)]-[ρ^t _0 A]≤ c_ thermalAV_ local |𝖠|tvt+c'_ thermal^D,\n\nwhere _0:= [H_0,·], and \n    V_ local=max_j ∈𝖵∑_e∈𝖤: e∋ jV_e,\n \nis the local norm of V. The quantities c_ thermal,c'_ thermal are O(1) constants determined by c,μ and the lattice geometry.\n\n\nWe use the Duhamel identity, similarly to (<ref>):\n\n    [ρ A(t)]-[ρ^t _0 A]   ≤∫^t_0 d s ^ sH [V, ^(t-s) _0A]^- sH≤∫^t_0 d s [V, ^s _0A].\n\nIf ^s _0A is supported in a set 𝖲, then \n    [V, ^s _0A]≤AV_ local|𝖲|.\n \nFrom (<ref>) and its relation to the support of an evolved operator in Proposition <ref>, we know that the dominant part Ã(s) of ^s _0A is supported in a set 𝖲 containing vertices no farther than vs+c'_ thermal to the original set 𝖠: \n    ^s _0A = Ã(s)+ ∑_r=⌊ vs+c'_ thermal⌋+1Ã_r,\n\nwhere Ã_r has support no farther than r to the original set 𝖠. Here the constant c'_ thermal is chosen such that [V, ∑_r Ã_r]≤∑_r [V, Ã_r] is smaller than the main contribution [V, Ã(s)], which is possible because the volume increases polynomially with r, while Ã_r decays exponentially. Then (<ref>) becomes \n    [ρ A(t)]-[ρ^t _0 A]   ≤∫^t_0 d s  2[V, Ã(s)]≤∫^t_0 d s AV_ local |𝖠|c̃_ thermal (vs+c'_ thermal)^D \n       ≤ c_ thermalAV_ local |𝖠|tvt+c'_ thermal^D.\n\nHere we have used the fact that 𝖲 (support of Ã(s)) has the largest volume if 𝖠 is a set of faraway vertices, where each vertex grows to a ball of radius vs+c'_ thermal.\n\n\nProposition <ref> implies a bound t_ thermal≳V_ local^1/D+1 if the unperturbed dynamics [ρ^t _0 A] is far from the equilibrium of H.   We do not expect this bound to be tight; in somewhat more specialized settings, stronger bounds (Corollary <ref>) can be found.  In general, it is important to find stronger bounds on thermalization.\n\nUp to now we only bounded the local thermalization process. If the initial state is inhomogeneous with respect to some conserved charge, thermalization is slower. Transport is, firstly, bounded by the Lieb-Robinson velocity v, so if the length scale of the initial inhomogeneity is L, we have \n    t_ global thermal≳ L/v.\n\nIn usual systems however, this is a serious underestimate of the thermalization time scale, even accessible via local correlation functions.  If in particular there is a single conserved quantity (usually energy, e.g. whenever H is time-independent), then that quantity will relax diffusively to equilibrium, meaning that in practice t_ global thermal≳ L^2 <cit.> for finite-range interactions.\n\nThe bounds we have described thus far are rather “simple\" in that we simply pointed out that thermalization of local correlation functions is constrained by operator growth! A difficult open is to prove bounds on the nature of decay more generally.  For example, it seems reasonable that if one takes the thermodynamic limit of N→∞ interacting degrees of freedom, we might expect that for any local operator A,\n    sup_t≥ t_0lim_N→∞⟨ A(t)A(0)⟩≥  C e^-γ t_0\n\nfor some non-negative constants C and γ.  This would rule out in particular that correlation functions can decay as e^-t^2.   The physical intuition for this is that in typical many-body quantum systems, there are poles in the lower half of the complex plane in the Green's functions for operator A (see e.g. <cit.>).   Any such pole would lead to at best a finite γ (with hydrodynamic poles leading to algebraic decay).   However, a proof of the finiteness of γ (in the thermodynamic limit N→∞) and a constraint on γ in terms of local coupling constants remains an open problem, as far as we know.\n\n\n\n §.§ Prethermalization\n\nIn some cases, we can achieve far stronger results than Proposition <ref>. To see how this is possible, we describe a classic example of a slowly thermalizing system: the Fermi-Hubbard model, with Hamiltonian H=H_0+V, where \n    H_0 = Δ∑_i∈𝖵 n_i,↑n_i,↓,    V = ϵ∑_{ i,j}∈𝖤∑_σ=↑, ↓ c^†_j,σ c_i,σ.\n\nHere c_i,σ is the annihilation operator for a fermion of spin σ∈{↑,↓} at site i∈𝖵.   Consider the limit where ϵ→ 0 while Δ stays finite.  In this limit, the ground state H=0 becomes highly degenerate: the states of finite energy (Δ,2Δ,…) correspond to those where two fermions of opposite spin sit on the same site.  We call such an excitation a doublon, and a singly-occupied site a singleton.  \n\nSuppose that we create one doublon excitation in a sea of singletons: how long will it take to decay, if ϵ is very small (but not exactly 0)?\nIf ϵ≪Δ, Fermi's golden rule suggests we cannot simply split it into two singletons.  Fermions hopping on a lattice have a bandwidth: their maximal kinetic energy is ∼ϵ≪Δ. There can therefore be no way, via Fermi's golden rule, to spontaneously decay into just two energetic singletons.  We must instead look for a much higher order process, where the doublon splits and then virtually transfers its energy Δ into the increased kinetic energy of k_* ∼Δ/ϵ singletons.  In perturbation theory, this will require at least k_* powers of the perturbation V, meaning that the doublon decay rate is expected to be <cit.>\n\n    1/t_doublon decay∼ϵ(ϵ/Δ)^ϵ/Δ.\n\n\nAn exponential bound t_doublon decay∼exp[Δ/ϵ] was rigorously proved in <cit.>. The proof uses the fact that H_0 is trivially diagonalizable, and extends to Floquet systems and to other settings where H_0 (or its Floquet generalization) is solvable <cit.>.\n\nThe intuitive argument we gave above seems to only rely on the existence of a gap in H_0. Thus one expects a general robustness result for all H_0 with a many-body gap.  Indeed, there is a long history of the study of false vacuum decay <cit.>, wherein local correlation functions appear consistent with ground states of a degenerate H_0, even when the true Hamiltonian H=H_0+V consists of a perturbation that has closed the gap.  One often takes, e.g., H_0 to have a ferromagnetic ground state, while V is a symmetry-breaking field that selects one of the degenerate vacua as the true ground state.\n\nHowever, as we have already explained at the beginning of Section <ref>, any robustness of a false vacuum cannot arise from the local robustness of eigenstates of H.  A notion of spatial locality and Lieb-Robinson bound will play an important role in any proof.  The strongest known bound on prethermalization is:\n\n[Prethermalization of gapped systems (slightly informal) <cit.>]\nLet H_0 be a spatially local Hamiltonian in D spatial dimensions, with a gap Δ in the many-body spectrum.  Let H=H_0+V, with ‖ V‖_local = ϵ, as defined in (<ref>). Then, there exists a quasilocal unitary U, a Hamiltonian H_* and an operator V_* such that \n\n    U^† (H_0+V)U=  H_* + V_*\n\nand for any single-site operator A \n    ‖ U^† A U-A‖ = O(ϵ/Δ).\n\nIn particular, the Hamiltonian H_* is block diagonal between the eigenstates of H_0 above and below the gap. The operator satisfies\n\n    ‖ V_*‖_local≤1/t_*  where   t_* ∼1/ϵexp[ c(Δ/ϵ)^a ]\n \nfor any a<1/(2D-1) and some 0<c<∞. \nThe unitary can be written as \n    U = 𝒯exp[∫_0^T   dt Ĥ(t)]\n\nfor T=O(ϵ) and Ĥ(t) quasilocal in the sense that \n    ∑_𝖲⊂𝖵‖Ĥ_𝖲(t) ‖e^diam(𝖲)^α = O(1)   for any   0<α<1.\n\n\n\n\nIn other words, there exists some effective Hamiltonian H_* that effectively describes the dynamics of local correlation functions for times t≪ t_*.  For example, if we start in one of the degenerate ground states of H_0, |0⟩, \n    | ⟨ 0| (U^† A U)(t) |0⟩ - ⟨ 0|A(t)|0⟩| ≤‖ U^† A U - A ‖≲ϵ,\n\nmeaning that\n\n    ⟨ 0|A(t)|0⟩≈⟨ 0| U^†e^iH_*tAe^-iH_*tU|0⟩ + ‖ V_*‖_localt.\n\nIf A acts in a trivial way on the ground states, but non-trivially on typical low-energy states, then we see that up to error O(ϵ), ⟨ 0|A(t)|0⟩ will evolve very slowly away from its ground state value. For a non-perturbatively long time, it will appear from ⟨ A⟩ as if the system is in one of its ground states, even if the perturbation has added a finite energy density to the state!  This proves, therefore, that false vacuum decay is non-perturbatively slow.\n\nTo formalize the intuition about a mismatch of energy scales between H_0 and V causing prethermalization, one needs to do perturbation theory in a rigorous way. A convenient technique, used in <cit.>, is the Schrieffer-Wolff transformation <cit.>.  Note that this proof strategy is similar in spirit to the proof of the Kolmogorov-Arnold-Moser Theorem <cit.>.\n\nStarting from the original H=H_0+V_1 with V_1=V, we first look for a quasi-local unitary U_1=^A_1 that block-diagonalizes the system among the gapped subspaces of H_0 at order ϵ^1. Note that we do not want a unitary that block-diagonalizes the system completely, as it cannot be quasilocal due to the orthogonality catastrophe <cit.>. More precisely, we look for anti-Hermitian A_1 = O(ϵ) obeying \n    ^-A_1(H_0+V_1)^A_1 = H_0 + V_1 + [H_0, A_1] + O(ϵ^2).\n\nWe demand that for some D_2, block-diagonal betewen the high/low energy subspaces of H_0: \n    V_1 + [H_0, A_1] = D_2.\n\nA_1 is not uniquely determined by (<ref>), but one solution suffices. \n\nFor commuting H_0 like (<ref>), A_1 and D_2 can be found easily in the eigenstate representation of H_0. For example, in (<ref>), H_0 has integer spectrum 0,Δ,2Δ,…, and one can choose <cit.> \n    D_2   =Δ/2π∫_0^2π/Δdt e^itH_0V_1e^-itH_0, \n    \n        A_1    = -i∫_0^2π/Δdt 1-Δ t/2πe^itH_0V_1e^-itH_0.\n\nBy the evolution of H_0 in (<ref>), each local term of V_1 grows larger in support, but remains strictly local because H_0 is commuting. \n\nFor general H_0, a solution similar to (<ref>) still holds.  One finds a filter function w(t) with compact Fourier transform <cit.>, which decays reasonably quickly as  w(t) ∼e^-|t|/log^2 |t| at large |t|, and chooses <cit.> \n    D_2 ∼∫_-∞^∞dt   w(t) e^itH_0V_1e^-iH_0.\n \nThe matrix elements ⟨ E| D_2 |E^'⟩ between eigenstates of H_0 are proportional to the Fourier transform of w(t):  w(E-E^'); hence our filter function with compact Fourier transform enforces D_2 being block-diagonal across the gap.\nHowever, terms in D_2 (and A_1) are no longer strictly local, and one needs to invoke a special Lieb-Robinson bound <cit.> to control how large they can become. With A_1 chosen to satisfy (<ref>), we have rotated the Hamiltonian by U_1 to H_0 + D_2+V_2, where V_2∼ϵ^2 is the last term in (<ref>). At this second step, we wish to further block-diagonalize the Hamiltonian, using a quasi-local unitary U_2=^A_2 that is determined similar to (<ref>).  One again needs to invoke locality and Lieb-Robinson bounds to show that U_2 is still quasi-local. This process can be iterated up to some optimal order k_*∼ (Δ/ϵ)^a, where the range of operators has become so large that further Schrieffer-Wolff transformations do not decrease the local strength of V_k anymore. At this optimal order, (<ref>) is achieved with H_* = H_0+D_k_* and an exponentially small V_* = V_k_*.\n\n\n Based on (<ref>), there is a hierarchy of how strongly t_* depends on ϵ. First, (<ref>) always holds trivially with U=I and t_*=1/ϵ, so the first nontrivial result would be t_*∼ϵ^-k_* for some finite k_*>1 using finite-order perturbation theory <cit.>.  Usually Fermi's golden rule implies that t_*∼ϵ^-2.  \n \n In integrable models, one can define a decay time in an alternative fashion to (<ref>).  While perturbing away from such integrability typically gives rise to t_*∼ϵ^-2 governed by Fermi golden rule <cit.>, there are exceptions with t_*∼ϵ^-2k for k>1 <cit.>. \n\nThere are even cases with infinite-time stability (t_*=∞), such as frustration-free ground states with local topological order <cit.>. The toric code <cit.> is the classic example of such a state. Intuitively, topological order guarantees a macroscopic code distance in the language of quantum error correction: any operator of size smaller than system length neither couples nor distinguishes different low-energy sectors that encode quantum information. Thus perturbation theory converges up to d_ code-th order, and the remaining V_* vanishes in the thermodynamic limit. In addition to preserving the gap, the energy splitting in the ground subspace is also then exponentially small, making such models robust quantum memories at zero temperature. Although we believe the frustration-free condition is a technical issue rather than being physical, Theorem <ref> is currently the best bound for frustrated systems.\n\nOn general grounds, one might have expected the prethermalization time to scale as \n    t_thermal∼exp[(Δ/ϵ)^d ]\n\nin d spatial dimensions, since this is the energy barrier one needs to overcome to tunnel out of the false vacuum <cit.>.  A rigorous proof of this result would likely require something beyond a Lieb-Robinson bound to control the validity of the Schrieffer-Wolff transformation, and this is an interesting open problem.\n\n\n§ QUANTUM WALK BOUNDS AND THE FROBENIUS LIGHT CONE\n\n\nSo far, we have discussed a notion of light cone inspired by Lieb-Robinson bounds on operator norms of commutators, such as ‖ [A_0(t),B_r]‖ = C(r,t).\nThese bounds have been popular because they hold for all matrix elements of the commutator: therefore, if a Lieb-Robinson bound exists, it serves as a versatile subroutine whenever a notion of locality is needed.  \n\nHowever, there are many physical settings where one does not want a Lieb-Robinson-like bound, but rather something different.   For example, suppose we wish to calculate a retarded Green's function in some finite temperature many-body system: \n    G^R_AB(r,t) := i/Z(β)tr( e^-β H [A_r(t),B_0]),\n\nwhere Z(β) := tr(e^-β H) is the thermal partition function. \n\nEspecially if temperature T is very small (or inverse temperature β=1/T large compared to couplings in H), quite often G^R_AB will vanish outside of a light cone with an apparent temperature-dependent velocity.  By definition, this temperature dependence cannot be captured by a Lieb-Robinson bound, as the single Lieb-Robinson bounds must accommodate all states.\n\nTherefore, it is desirable to incorporate the initial state dependence into a Lieb-Robinsonb bound. For the most part, this is an open problem in mathematical physics, with preliminary progress just beginning.  The simplest context where many rigorous results – which are notably stronger than optimal Lieb-Robinson bounds – appear is when studying the Frobenius norm of a commutator: (<ref>). This should not be a surprise: the Lieb-Robinson bounds must hold for all matrix elements of an operator, while the Frobenius norm simply bounds the average magnitude of a matrix element between any states in Hilbert space.  What is more non-trivial is the qualitatively new methods for bounding the Frobenius norm, which can both be applied to physically relevant problems and give us new and helpful insight into the bottlenecks of the underlying quantum dynamics.  \n\nIn this section, we will review this Frobenius light cone in our usual context: systems with local interactions on a lattice.  In later sections, we will show that it is the Frobenius approach to bounding commutators that can have elegant generalizations to more challenging problems, including systems with power-law interactions (Section <ref>) or bosons (Section <ref>).\n\n\n\n §.§ Quantum walk of a single particle on the line\n\nWe begin by revisiting the toy problem of Section <ref>; as before, we wish to bound C(r,t) = ⟨ r|e^-iHt|0⟩.  This time, we will not try to think of this problem combinatorially.  Instead, we observe that |C(r,t)|^2 represents the classical probability of measuring the particle on site r at time t.  Our strategy – and more generally, the strategy of existing “quantum walk bounds\" – will be to bound this probability distribution directly, using methods of classical probability theory, as an indirect way of saying something useful about the underlying quantum dynamics.\n\nBefore we explain how such a quantum walk bound could be found, let us emphasize why this shift in perspective should be quite useful.  In the combinatorial approach that underlies the simplest Lieb-Robinson bounds, we found in (<ref>) that C(r,t) was bounded by a sum over all paths. \nSomewhat annoyingly in this formula, C(0,t) > 1 once t>0.  Now of course this is merely an artifact of us trying to express C(r,t) in some elegant way – physically |C(0,t)|^2≤ 1, as it is the probability of measuring the particle on site 0.  Still, when we derived a  bound on C(r,t) at time t, it depended on our bound at time t-Δt.  The overcounting that we are doing is not innocuous – it is “corrupting\" our bound for all later time, artificially inflating the values of all C(r,t).  Might it be leading to an overestimate of the velocity of the “light cone\" outside of which C(r,t) is exponentially small?\n\nTo understand whether this concern is justified, we seek a formalism in which (perhaps indirectly) we are assured that C(r,t) remains the coefficients of some normalized wave function.  Yet this is somewhat awkward since it is |C(r,t)|^2 which represents the probabilities.  The strategy which has been used so far is to solve this problem by not bounding C(r,t) directly, but rather by bounding the expectation values of operators on the Hilbert space.  Suppose we define \n    F := ∑_r∈ℤ F_r |r⟩⟨ r|;\n\nthen \n    ⟨ F(t)⟩ = ⟨ψ(t)|F|ψ(t)⟩ = ∑_r∈ℤ F_r |C(r,t)|^2.\n\nSince F is diagonal in the position basis of interest, ⟨ F⟩ can be interpreted using classical probability theory as simply the average value of the random variable F_r.  But now we can efficiently bound \n    d/dt⟨ F(t)⟩ = ⟨i[H,F]⟩.\n\nWhile at this point there are a variety of strategies that one could use, two common ones are to seek functions F where it can be proved that for some constant c>0 \n    |⟨i[H,F]⟩ |≤ c   or   |⟨i[H,F]⟩ |≤ c ⟨ F⟩.\n\nIn this section, we will focus on this latter possibility, which leads to tighter bounds – the strategies for dealing with the former are quite similar.\n\nObserve that one choice[We might really wish to use b|r|, not br, in the exponent, but this choice will simplify a few equations and the approach's merits are more easily revealed.] satisfying (<ref>) is \n    F_r = e^br  for constant   b>0.\n\nIndeed, \n    |⟨i [H,F]⟩|    ≤|h∑_r(iψ̅_r ψ_r+1 - iψ̅_r+1ψ_r)(e^b(r+1) - e^br) | \n       ≤ h(e^b/2-e^-b/2) ∑_r (|ψ_r|^2 e^br  + |ψ_r+1|^2e^b(r+1)) \n       = 4h sinhb/2∑_r |ψ_r|^2 e^br\n        = 4hsinhb/2⟨ F⟩.\n\nThe second inequality uses Cauchy-Schwartz (e.g.) \n    iψ̅_r ψ_r+1e^b(r+1) = iψ̅_r e^br/2ψ_r+1e^b(r+1)/2e^b/2≤e^b/2·1/2[ |iψ̅_r e^br/2|^2 + |ψ_r+1e^b(r+1)|^2 ].\n\nNow, since F_r≥ 0 is a non-negative operator, and |ψ_r|^2 is a well-posed classical probability distribution, we can invoke Markov's inequality: \n    ℙ[particle is at x≥ x_0 at time t] = ∑_r=x_0^∞ |ψ_r(t)|^2 ≤⟨ F(t)⟩/F_x_0.\n\nHere and below ℙ[⋯] is used to denote the probability of an event arising, and we use this notation (rather than the expected value of a quantum observable) to highlight the close mathematical connections to probability theory.  Combining (<ref>), (<ref>), and (<ref>), we can now choose the optimal value for the parameter b to get the tightest possible bound on the velocity of the particle: \n    ℙ[particle is at x≥ x_0 at time t] \n        ≤exp[-bx_0(1-4ht/x_0sinh (b/2)/b) ].\n \nSince sinh(b)/b ≥ 1, we conclude that we should take b→ 0 to get the strongest possible light cone bound.  Our bound is exponentially small when 2ht ≤ x_0, implying that the velocity of the particle is \n    v ≤ 2h.\n\nThis is tighter than what we could find using our Lieb-Robinson combinatorics in (<ref>).   This velocity admits a natural physical interpretation: it is the largest possible group velocity of a particle in the system: see (<ref>).\n\nWe call this approach the “quantum walk\" approach to bounding dynamics since we aim to use (as much as possible) the unitarity of the quantum dynamics to constrain the quantum walk of the wave function.  In the many-body setting, this problem can of course become much more complicated, but we will describe a few examples (F ansatzes) where this method has been used to tightly bound quantum dynamics.  This approach has also been employed in the literature on continuous-space Lieb-Robinson bounds (Section <ref>).\n\n\n\n §.§ Operator growth and operator size\n\nWe now turn to the many-body problem. As explained in Section <ref>, a critical difference between our single-particle warm-up and the many-body problem is operator dynamics appear more natural than state dynamics. Indeed, we have already seen that local operators evolve “slowly\" (at least for short times) under local Hamiltonian dynamics.  This was the key insight behind our derivation of a Lieb-Robinson bound in Section <ref>.   And in recent years, capturing the growth of local operators – beyond the Lieb-Robinson bound – has become a question of particular interest among physicists.  There are a few (related) reasons why.  Firstly, the Lieb-Robinson bounds capture the “worst case\" speed of information, but it may be the case that in typical states signals propagate much more slowly.  We will see that this is strikingly the case in systems with power-law interactions in Section <ref>.   Secondly, the growth of operators has been conjectured to be related to the emergence of geometry and gravity via the AdS/CFT correspondence in string theory: we will discuss such theories in Section <ref>.  Thirdly, typical experiments probe thermal correlation functions and so often times we are only interested in the behavior of the commutator [A(t),B] averaged over (exponentially) many states.\n\nIf the Lieb-Robinson bounds are too specialized, we can try alternatively to study the opposite limit where we only ask about the typical behavior of a commutator.  Indeed, suppose we want to know: how large should we expect [A(t),B] | φ^'⟩ to be for randomly chosen state |φ⟩? As usual in probability theory, it is easier to study the square of this object, where the averaging becomes simple: denoting C=[A(t),B] for simplicity, along with a finite-dimensional Hilbert space, \n \n    𝔼_φ[ C|φ⟩^2] = 𝔼_φtr( C^† C |φ⟩⟨φ|)=tr(C^† C)/tr(I).\n\nHere we have used 𝔼_φ to denote expectation over the Haar measure[Concenptually we often take the “random\" average over the Haar measure. However, one only needs a much weaker randomness 𝔼_φ|φ⟩⟨φ| = I/[I] for (<ref>).] .   Note that the final object in (<ref>) is the Frobenius norm, introduced in (<ref>).  Hence, the Frobenius norm of C will tell us about the size of typical matrix elements of C.\n\nIn a system with a many-body Hilbert space, there is a particularly valuable way to think about this Frobenius norm. Using the elementary properties in Section <ref>, we notice two key facts.   Firstly, if we expand an operator into the |a_1⋯ a_N) basis, the coefficients (a_1⋯ a_N|A) can be thought of as the elements of an “operator wave function\", which (by Proposition <ref>) will be normalized just as a usual quantum wave function. In particular, observe that \n\nLet |A(t)) = e^ℒt|A) for some Hamiltonian =  [· ,H]. Then \n    (A(t)|A(t)) = (A|A).\n\n\n\nTake the time derivative \n    d/dt (A(t)|A(t)) = (A(t)|ℒ^† + ℒ|A(t)) = 0,\n\nusing ℒ^† = -ℒ, which follows from the cyclic trace identity.\n\n\n\nSecondly, we will make heavy of the super-projector _A (Definition <ref>) instead of commutators; recall \n\n    [A,B]= [A,ℙ_𝖠B].\n\nThis statement holds irrespective of a Frobenius light cone, and indeed such notation was used in <cit.>. However, this notation of projection is particularly nice when working with the Frobenius inner product, as ℙ can be thought of as an explicit projection matrix! Therefore, we have the intuitive picture of the “light cone\" for operator growth as associated with a small operator exploring the intersection of increasingly many ℙ_j hyperplanes for sites j: see Figure <ref>.\n\n\n\nA crude way to capture how much an operator has grown (which has become an object of some study in its own right) is the operator size.  Define the superoperator \n    𝒮|a_1⋯ a_N) = [∑_j=1^N 𝕀(a_j 0) ]|a_1⋯ a_N).\n\nThus, 𝒮 counts the number of sites on which a given Pauli string is not the identity.  As a superoperator, size can act non-trivially on a complicated operator (just as not all wave functions are eigenstates of a general Hermitian operator).   But we often care about the average size of an operator: (A|𝒮|A).  The average size of an operator is, fortunately, related to the typical size of commutator matrix elements: \n\nFor a quantum system with N qubits,\n\n    (A|𝒮|A) = 1/8∑_j=1^N ∑_a=1^3 ([A,X_j^a]|[A,X_j^a]).\n\n\nHence, the average size of operator A measures the Frobenius norm of an average commutator of A with a single-site Pauli. While this proposition is for qubit degrees of freedom, for appropriate changes in constant factors it also holds for qudits.  Notice the absence of spatial locality in the problem; often notions of operator size are most relevant in problems without a notion of spatial locality.  We will discuss much more about operator size and why it was studied in Section <ref>.\n\n\n\n\n §.§ Many-body quantum walk bounds\n\n\n\nIn this section, we describe a strategy to efficiently bound Frobenius light cones dubbed the “many-body quantum walk\" in <cit.>.  This technique is very similar to one which has been developed independently in the mathematics literature (see e.g. <cit.>), though the notation is rather different.  The key idea is that since the Frobenius norm is simply the length of the “operator\" in the “operator Hilbert space\", we can follow our technique from Section <ref>. \n\nIn particular, suppose we want to bound ‖ [A_0(t),B_r]‖_F – this can only happen if the operator string |A(t)) contains terms that act non-trivially on site r.\n\n\nLet ℙ_r:=ℙ_{r}. Then, the following inequality holds: \n    4(A_0(t)|ℙ_r|A_0(t)) ·B_r^2 ≥‖ [A_0(t),B_r]‖_F^2.\n\n\n\nThis follows from Hölder's inequality (Proposition <ref>):\n\n    ‖ [A_0(t),B_r]‖_F = ‖ [_r A_0(t),B_r]‖_F≤ 2 B_r‖_r A_0(t) ‖_F,\n\nwhich squares to (<ref>). \n\n\n\n\n  §.§.§ Frobenius bounds on general graphs\n\n\nNow that we have related the Frobenius light cone to the expectation value of ℙ_r, it remains to bound (A_0(t)|ℙ_r|A_0(t)).  This is very similar to what we did in Section <ref>, except that ℙ_r is not the projection onto a single state. \n\n[Frobenius bound on a graph of bounded degree] \nIn the model studied in Example <ref>, \n\n    (A_0(t)|ℙ_v|A_0(t)) ≤e^v_Bt-𝖽(v,0)\n\nwhere the butterfly velocity v_B, which characterizes the Frobenius light cone, is defined as \n    v_B=2h min_b>0b^-1[d+^-b+(d-1)^b].\n\n \n\nWe follow the strategy of Section <ref>.  Define \n    ℱ = ∑_v∈𝖵e^b𝖽(v,0)ℙ_v.\n\nNow consider the time derivative\n\n    d/dt (A|e^-ℒtℱe^ℒt|A) = -(A(t)| [ℒ,ℱ]|A(t)) = -∑_v∈𝖵e^b𝖽(v,0)  (A(t)|[ℒ,ℙ_v]|A(t)).\n\nThe only terms that survive the commutator [ℒ,ℙ_v] are those where either ℒ annihilates the non-trivial operator on site v, or creates one:  \n    [ℒ,ℙ_v] = (I-ℙ_v)ℒℙ_v - ℙ_vℒ(I-ℙ_v) = ∑_e∈∂ v [ℒ_e,ℙ_v].\n\nSo (<ref>) becomes \n    d/dt (A|e^-ℒtℱe^ℒt|A)    =-∑_e={u,v}∈𝖤  (A(t)|[ℒ_e,e^b𝖽(v,0)ℙ_v+ e^b𝖽(u,0)ℙ_u]|A(t)) \n       = ∑_e={u,v}∈𝖤e^b𝖽(v,0) (A(t)| (_v _e (1-_v) _u - _u (1-_v)_e _v)|A(t)) + (u↔ v)\n\nHere in the second line, we have used (<ref>) where (I-ℙ_v)ℒ_eℙ_v, for example, gets an extra factor ℙ_u in front because otherwise ℒ_e just annihilates the identity operator.\n\nIf we define \n    a_v(t) := √((A(t)|ℙ_v|A(t))),\n\nthen observe that for e={ u,v}:\n    (A(t)| _v _e (1-_v) _u|A(t))≤ a_ua_v · 2‖ H_e‖≤(a_u^2+a_v^2) ·‖ H_e‖.\n\nThen \n    d/dt (A|e^-ℒtℱe^ℒt|A)    ≤ 2h ∑_e={u,v}∈𝖤^b 𝖽_u+^b 𝖽_v(a_u^2+a_v^2) \n        = 2h ∑_v∈𝖵 a_v^2 ∑_u:𝖽(u,v)=1^b 𝖽_u+^b 𝖽_v\n       ≤ 2h ∑_v∈𝖵 a_v^2 ^b 𝖽_v (d+^-b+(d-1)^b) \n        = 2h(d+^-b+(d-1)^b)  (A|e^-ℒtℱe^ℒt|A).\n\nIn the second line's inequality, we have assumed the worst case where v has only one neighbor u that is closer to the initial vertex 0; all other d-1 neighbors are farther. Exponentiating (<ref>) gives (<ref>).\n\n\n\n\n  §.§.§ One dimension\n\n\nIn one dimension, we can get much stronger bounds by thinking only about the right most site on which an operator acts.  Let us define the projector \n    ℚ_r|{ a_i}) = 𝕀[a_j=0  if j>r, a_r  0 ] |{ a_i}).\n\nHence ℚ_r projects onto the rightmost site on which an operator acts (Figure <ref>). Observe that if we define for any operator |A(t)), \n    |ψ_r(t)|^2 = (A(t)|ℚ_r|A(t)),\n\nthen a simple modification of the proof of Theorem <ref>, upon defining \n    ℱ = ∑_r e^brℚ_r,\n\nexactly reproduces the calculation in Section <ref>.  In particular, we find that in one-dimensional models with nearest neighbor hopping (as in Example <ref>), \n    v_B≤ 4 max_e∈𝖤‖ H_e ‖.\n\nThis suggests that there may indeed be a qualitative difference between Frobenius and Lieb-Robinson light cones.\n\n\nWe don't know whether there is any one-dimensional model for which the Lieb-Robinson velocity 2eh ≥ v_LR>v_B.  In fact, upon careful inspection, we can find the velocity 2eh in our Frobenius light cone bound!  Suppose that r ≫ 4ht, and choose the value of b which minimizes (<ref>), where h should multiply by 2 for the many-body case.  One finds that \n    (A(t)|ℚ_r|A(t)) ≲exp[ -2r logr/2eht].\n\nThe only difference between this bound and our earlier Lieb-Robinson bound in Example <ref> is the additional 2 in the exponential.  This arises from the inner product in (A(t)|ℚ_r|A(t)) – the coefficient of t^r/r! is squared when evaluating the Frobenius light cone.\n\n\n\n\n\n §.§ Entanglement and the Frobenius light cone\n\nWe have seen in Section <ref> that von Neumann entanglement generation could be large even when operator growth is small (outside the Lieb-Robinson light cone).  One might, however, presume that the Frobenius light cone might be closely related to the second Rényi entropy (<ref>), due to the fact that \n    (ρ|ℙ_𝖠|ρ) = e^-S_2(𝖠).\n\nIndeed, <cit.> discuss how entanglement generation generally appears slower than operator growth; this is also the case in random circuit models (Section <ref>). However, the following counterexample shows that operator growth may not always precede  entanglement generation.\n[Generating a maximally entangled state with little Frobenius operator growth]\nConsider the same setting as Example <ref> with \nϵ=1-1/D. Then, \n    U|00⟩ = 1/√(D)∑_j=0^D-1 |jj⟩,\n\nis maximally entangled. Yet for any local operator A, its evolution A=U A U^† satisfies \n    _ B  A _ F≤ A _ FO(D^-1).\n\n\nAlthough this is a somewhat tedious calculation, we produce it in full since it has not appeared in the literature before (to our knowledge). \n\n Since (<ref>) comes from the direct calculation, we focus on proving (<ref>). Because (1-_ B) is much easier to compute than _ B, we use the equivalence between (<ref>) and \n    (1-_ B)   A _ F≥ A _ F [1-O(D^-1)].\n\nLet {T_J}_J=0^D^2-1 be a normalized operator basis of A, so that the superoperator (1-_ B) can be represented as a matrix _J_1 J: \n    (1-_ B)  T_J_1 = ∑_J_J_1J T_J.\n\n(<ref>) is then further equivalent to the statement that the eigenvalues of  are all of the form 1-O(D^-1).\n\nWe choose T_J to be the matrix-element operators |j⟩⟨ j'|, and denote each J by a pair (j,j'). We prove that the matrix  has the following structure: (1) if j≠ j', \n    _J,jj' = [1-O(D^-2)] 𝕀(J=jj').\n\n(2) If j≠ 0, \n    _j_1 j'_1,jj = 𝕀(j_1=j_1^')[ [1-O(D^-1)] 𝕀(j_1=j) + O(D^-2)].\n\nFor now, assume these properties are true; we now show that eig=1-O(D^-1), and thus (<ref>). As a result of (<ref>),  is diagonal outside the subspace (j,j):j=0,⋯,D-1, with the diagonal entries being 1-O(D^-2). Thus, it remains to verify whether the sub-matrix ^'_j_1j := _j_1j_1,jj  has 1-O(D^-1) eigenvalues. According to (<ref>), the diagonals of ^'_j_1j are also 1-O(D^-1), while the off-diagonals are O(D^-2). Then any eigenvalue of '_j_1j is indeed 1-O(D^-1), from the Gershgorin circle theorem <cit.>.\n\nLastly, we verify (<ref>) and (<ref>) explicitly. U acts on states by (<ref>) and \n    U|jj⟩   = (I-| diag⟩⟨ diag|) |jj⟩ + -√(1-1/D)|00⟩ + √(1/D)| diag⟩⟨ diag | jj |⟩\n       = |jj⟩ +  O(D^-1/2) |00⟩ +  O(D^-1)∑_j'≠ 0|j'j'⟩,\n\nfor j≠ 0. Then the action on T_jj' (j≠ j') is \n    |j⟩⟨ j'|⊗∑_i|i⟩⟨ i|    = |j⟩⟨ j'|⊗∑_i|i⟩⟨ i| + (𝒰-ℐ) [|jj⟩⟨j'j| + |jj'⟩⟨j'j'|] \n       = |j⟩⟨ j'|⊗∑_i|i⟩⟨ i| +  [(U-I)|jj⟩⟨j'j| + |jj'⟩⟨j'j'|(U^† -I)],\n\nwhere we have used ⟨j'j|U^† = ⟨j'j| for example in the second line.\nWhen acting further with 1-ℙ_ B, the first term is unchanged, while only the O(D^-1) |jj⟩ term of (U-I)|jj⟩ survives (j' similarly), so the result is proportional to T_jj': \n\n    (1-ℙ_ B)|j⟩⟨ j'|  = |j⟩⟨ j'|  1+  O(D^-1) 1/D_ B(|j⟩⟨j|)  = |j⟩⟨ j'|  1+  O(D^-2).\n\n\nTherefore (<ref>) holds. Similar arguments also show that the diagonal elements of the sub-matrix '_j_1j is 1- O (D^-1), so what remains is to prove its off-diagonals are O(D^-2). Similar to (<ref>), \n    T_jj = ⋯ + U |jj⟩⟨jj| U^† = ⋯ + α_j |jj⟩ +  O(D^-1/2) ∑_i≠ j|ii⟩α_j ⟨jj| +  O(D^-1/2) ∑_i≠ j⟨ii|,\n\nwhere ⋯ only contributes to diagonals, and we have combined (<ref>) and (<ref>). After expanding the product and project by 1-ℙ_ B, the cross terms |ii⟩⟨i'i'| (i≠ i') are eliminated. Furthermore, |jj⟩⟨jj| only contributes to diagonals, so off-diagonals only come from O(D^-1)∑_i |ii⟩⟨ii|, which gain an extra O(D^-1) similar to (<ref>). Thus the off-diagonals are indeed O(D^-2).\n\n\n\n\n §.§ Hamiltonians with random coefficients\n\nIn Section <ref>, we will encounter Hamiltonians with random coefficients, such as the Sachdev-Ye-Kitaev model. Applying the deterministic bounds for random Hamiltonian often yields unphysical results:  in practice, operator growth is “incoherent”, but the Lieb-Robinson bounds use the triangle inequality throughout, which adds terms “coherently”. Capturing the effects of classical (external) randomness in the Hamiltonian in an operator growth bound has recently become possible.  And, remarkably, it will turn out that these methods are often valuable even when there is no intrinsic randomness in the problem!\n\n\n\n  §.§.§ Matrix concentration bounds\n\nWe present an instructive example that captures the essential problems with Lieb-Robinson bounds when we are interested in typical state behavior <cit.>.  Consider\n\n    H = Z_1 + ⋯ + Z_N,\n\nwhere each Pauli Z_i is supported on qubit i. The “size” of this matrix depends on the question of interest. The spectral (infinity) norm gives the largest eigenvalue in magnitude:\n\n    Z_1 + ⋯ +Z_N = N.\n\nThe Frobenius norm gives the average magnitude of eigenvalues:\n\n    Z_1 + ⋯ + Z_NF = √(N).\n\nIn other words, the worst case is qualitatively different from the average case. In fact, in this problem, the eigenvalue distribution is equivalent to the probability distribution of a sum of independent random variables S_N:= x_1+⋯+x_N each drawn from the Rademacher distribution ℙ(x_i=1)=ℙ(x_i=-1)=1/2. \nNow, we may call a concentration inequality to describe how rarely the random variable deviates from its expectation\n\n    ℙ( λ_i ≥ϵ) ≡ℙ( S_N ≥ϵ) ≤^-ϵ^2/2N.\n\nTherefore, the typical magnitude of eigenvalues λ= O(√(N)) ≪ N is much smaller than the extreme eigenvalues. \nThis simple example illustrates that the “size” of high-dimensional objects could behave quite differently depending on the norm; this distinction could lead to drastically different implications (e.g., in power-law interacting systems in Section <ref>).\n\nTo derive concentration for more complicated matrix functions, we highlight a family of recursive inequalities for their Schatten p-norms, which proved extremely versatile.\n\nConsider matrices A, B ∈(_i⊗_j) that satisfy the so-called non-commutative martingale condition \n    _i(B) = 0  and   A= A_j⊗ I_i.\n\nThen, for p ≥ 2, \n\n    ‖ A + B‖_p^2≤‖ A ‖_p^2  + (p-1)‖ B‖_p^2.\n\n\nRemarkably, the martingale condition is compatible with a wide range of matrices beyond independent sums. At the same time, uniform smoothness delivers sum-of-squares behavior (analogous to independent sums) that contrasts with the triangle inequality, which is linear\n\n    A+B≤A+B.\n\nThis difference underpins the essential distinction between the worst and typical cases. \n\nFor random Hamiltonians, the flavor of the problem changes slightly; we can think of adding independent Gaussian coefficients in our guiding example\n\n    H = g_1 Z_1 + ⋯ + g_N Z_N.\n\nThe Gaussian coefficient (i.e., external randomness) requires the following version of uniform smoothness regarding the expected p-norm A_p:= ([ A_p^p ] )^1/p that will allow us to control the spectral norm by setting p ≳log( H)∼ N. \n\n \nConsider random matrices A, B of the same size that satisfy\n[A|B] = 0. When 2 ≤ p,\n\n    A+B_p^2 ≤A_p^2  + (p-1)B_p^2 .\n\n\nCompared with Proposition <ref>, the above contains both classical randomness (the expectation) and quantum randomness (the trace), which is especially suitable for matrices with random coefficients. Historically, uniform smoothness (both Proposition <ref> and Proposition <ref>) is a descendant of the scalar two-point inequality or Bonami's inequality <cit.>, which features in, e.g., Boolean analysis <cit.>. The matrix version was first derived <cit.> and later rewritten in the above form, leading to simple derivations of matrix concentration for martingales <cit.>. We expect these robust inequalities to find applications in numerous quantum information settings, by exploiting the tensor product structure of the Hilbert space or by the random coefficients: e.g. when studying power-law interacting systems in Section <ref>, Trotter error <cit.>, dynamics with random Hamiltonians in Section <ref>, or randomized quantum simulation <cit.>.\n\n\n\n  §.§.§ Bounds based on self-avoiding paths\n\nCombining matrix concentration inequalities (Section <ref>) with the self-avoiding path (Section <ref>) yields operator growth bounds for random Hamiltonians in the Frobenius norm.\n\n[Operator growth bounds for random time-independent Hamiltonian <cit.>]\n\nConsider a random time-independent 2-local Hamiltonian where the terms H_e are independent for e∈𝖤,  zero mean: [H_e] =0, and bounded almost surely: H_e≤ b_e.\nThen, for any normalized operators A=B = 1 supported on subsets 𝖠 and 𝖡 respectively, the Frobenius norm of the commutator can be bounded by a weighted incoherent sum over self-avoiding paths of interactions Γ={Γ_ℓ,…,Γ_1}, as in (<ref>):\n\n    [ [A(t), B ] F^2 ]≤ 4∑_self-avoiding paths Γ ∫_t<t_ℓ<⋯ <t_1\n    ℓ = Γdt_ℓ⋯dt_1 ∏_1≤ k≤ℓ(e^β_k(t_k+1-t_k)8 b_Γ_k^2/β_k)\n\nwhere β_k = β (Γ_ℓ,⋯,Γ_k) are tunable parameters that can depend on the path and t_ℓ+1:=t. \n\nCompared with the deterministic bounds (Theorem <ref>), the expression above has interaction strengths appearing in squares b_X^2, entailing the incoherence across different terms. The tunable parameters β_k are slightly distracting, but a convenient choice often suffices. The above bound naturally extends to the case with p-norms which leads to sharper concentration (Section <ref>) and Brownian circuits where the randomness is both spatial and temporal <cit.>.\n\n\n\n\n\n§ SYSTEMS WITH ALL-TO-ALL INTERACTIONS AND HOLOGRAPHIC QUANTUM GRAVITY\n\nIn this section, we will turn to the study of Hamiltonians that can include few-body interactions between a small number of the N total degrees of freedom at a time.   In particular, we will often focus on k-local models of the form \n    H = ∑_j=1^k ∑_i_1<i_2<⋯ < i_k h^a_1⋯ a_k_i_1⋯ i_k(t) X_i_1^a_1⋯ X_i_k^a_k\n\nthat couple together N qubits.  Here we assume that each h^a_1⋯ a_k_i_1⋯ i_k(t) = O(1).   Such models are the extreme opposite of the spatially local models we have studied thus far, and their study will lead to the ultimate limits on what quantum systems can achieve using few-body interactions.  There is hope that a future quantum computer might be able to implement such generic kinds of models (at the cost of many local qubits used for teleportation, as in Section <ref>), although one may also wish to use photons <cit.> or trapped ions <cit.> to realize non-local couplings.  However (<ref>) is achieved, we come across interesting theoretical questions both in quantum information and, interestingly enough, in high energy physics.  In this section, we will describe how Lieb-Robinson and Frobenius bounds can be generalized to such systems, despite the lack of spatial locality.\n\n\n\n §.§ Fast state preparation\n\n\nWe first discuss preparing globally entanglement many-body states from product states. We consider the GHZ state | GHZ⟩ (<ref>) and the W state <cit.> \n    | W⟩ := 1/√(N)|10⋯ 0⟩ + |010⋯ 0⟩ + ⋯ + |0⋯ 01⟩,\n\nas two examples. The fastest protocols, to our knowledge, are the following:\n\n[A O(1)-time GHZ state preparation protocol]\nThe Hamiltonian \n    H = (I-Z_1) ∑_j=2^N (I-X_j),\n\nprepares GHZ state in time t=π/4, starting from |+⟩_1⊗| 0⟩_2⋯ N where |+⟩=(|0⟩+|1⟩)/√(2).\n\n\nObserve that \n    | GHZ⟩ = U_1N⋯ U_13U_12|+⟩_1⊗| 0⟩_2⋯ N,\n\nwhere \n    U_1j = ^-π/4(I-Z_1)(I-X_j),\n\nis the controlled-NOT (CNOT) gate on qubit 1 and j. Since all U_1js commute, they combine to U_1N⋯ U_13U_12=^-π H/4 with H given in (<ref>).\n\n\n[A O(N^-1/2)-time W state preparation protocol <cit.>]\nConsider Hamiltonian \n    H =  X^-_1 ∑_j=2^N X^+_j + ( H.c.),\n\nwhere X^± := (X± Y)/2.\nStarting from |1⟩_1⊗| 0⟩_2⋯ N, we obtain the W state after time t=1/√(N-1)arccos(1/√(N)).\n\n\n\nBy direct calculation, \n    H|1⟩_1⊗| 0⟩_2⋯ N   = |0⟩_1⊗∑_j=2^N X^+_j | 0⟩_2⋯ N = √(N-1)|0⟩_1⊗| W⟩_2⋯ N, \n       H|0⟩_1⊗| W⟩_2⋯ N   = -|1⟩_1⊗∑_j=2^N X^-_j | W⟩_2⋯ N = -√(N-1)|1⟩_1⊗| 0⟩_2⋯ N.\n\nThus, H/√(N-1) acts as the Pauli Y matrix in |1⟩_1⊗| 0⟩_2⋯ N, |0⟩_1⊗| W⟩_2⋯ N. Since for a 2-level system \n    ^-θ Y|0⟩ = cosθ|0⟩ + sinθ|1⟩,\n\nwe choose √(N-1)t = θ = arccos(1/√(N)) so that \n    ^- t H|1⟩_1⊗| 0⟩_2⋯ N = 1/√(N)|1⟩_1⊗| 0⟩_2⋯ N + √(N-1/N)|0⟩_1⊗| W⟩_2⋯ N = |W⟩,\n\nwhich indeed prepares the W-state.\n\n\nSee <cit.> for another GHZ protocol with O(1) time. \nIt is an open question whether the above protocols are asymptotically optimal in terms of the N scaling of time t. There is a separation between them and the best-known lower bound. For example, the operator growth bound on entanglement generation in Proposition <ref> yields t=Ω(1/N) for preparing GHZ. The following Proposition achieves a log N factor improvement by assuming a local qubit of information (instead of a single product state) is encoded in the N-qubit repetition code:\n\n    U α|0⟩ +β|1⟩_1 ⊗| 0⟩_2,⋯,N = α| 0⟩ + β| 1⟩,\n\nNote that Example <ref> fulfills this condition.\n\n\n\nFor any H of the form (<ref>), if U=^- t H prepares GHZ in the sense of (<ref>), then \n    t=Ωlog N/N.\n\n\n\n\nWe prove for 2-local Hamiltonians.  Similar to Proposition <ref>, we have \n    ‖ U X_1 U^† Z_2‖   = 2,\n\nbecause U X_1 U^† and Z_2 are logical operators for the repetition code. Note that (<ref>) holds for any Z_j, while only one Z_j≠ 1 is sufficient to yield our bound. \n\nWe want to utilize Theorem <ref> since (<ref>) implies C_12(t)=1. The matrix h defined by (<ref>) takes the form h=a J + b N I, where a,b are O(1) constants, and J is the N-by-N matrix with all elements equal to 1. Note that we do not need b=-1/N from the self-avoiding path techniques in Section <ref>, since it does not change the final scaling. \nThe matrix h can be easily diagonalized: it has eigenvalue aN+bN for the state |ψ⟩=1,⋯,1^ T/√(N), and eigenvalue bN for all other orthogonal states. Then Theorem <ref> yields \n    C_12(t) ≤^2th_12 = ^2t(a+b)N⟨2|ψ|⟨%s|%s⟩⟩ψ|1 + ^2tbN⟨2|(I-|ψ⟩⟨ψ|)|1|=⟩1/N^2t(a+b)N-^2tbN,\n\nwhich implies that (<ref>) holds whenever C_12(t)=1, as it must be to prepare the GHZ state. Here we have used the smallness of ⟨2|ψ|=⟩⟨ψ|1|=⟩1/√(N) to get the extra log N factor.\n\n\nA stronger bound t=Ω(N^-1/2) holds for Frobenius norm growth <cit.>, in comparison to the operator norm growth (<ref>). However, it is not obvious such operator growth should be relevant for state preparation.  While naively, the logical X_1 must grow to X_1⋯ X_N after time evolution, it only must have such a long Pauli string on states stabilized by Z_1Z_2, etc., meaning that we could have X_1(t) = X_1⋯ X_N 1+Z_1Z_2/2⋯ + ⋯ which has exponentially small Frobenius weight.  Making progress on this question is an important open problem.\n\nFinally, one can also consider circuit models (instead of Hamiltonian models) with all-to-all connectivity. Assuming each qubit is acted on by at most one local gate at each time step (i.e., do not parallelize overlapping yet commuting gates as in Example <ref>), the depth of the circuit needs to be Ω(log N) for preparing any state that is globally entangled. The reason is simply that each qubit needs to build up correlation with all other qubits, yet the strict light cone is restricted in qubits of number exponential in depth. Θ(log N)-depth circuits are known for GHZ and W states. GHZ is prepared simply by inductively applying CNOT gates to double the qubits sharing the GHZ. The W state can be prepared in a similar fashion <cit.>. We refer to the literature <cit.> for further discussions.\n\n\n\n §.§ Lyapunov exponents, quantum chaos, and operator growth\n\nIn the previous section, we discussed models with all-to-all interactions as valuable for the fast preparation of interesting entangled states; however, the Hamiltonians involved are not thermodynamically extensive: ‖ H‖∼ N^k for a k-local Hamiltonian. In this section, we will describe random models with all-to-all Hamiltonians, but which are thermodynamically extensive: ‖ H‖ = O(N).  As we will see, this does not simply mean dividing by N^k-1 in (<ref>). \n\nA paradigmatic model to study is the Sachdev-Ye-Kitaev (SYK) model <cit.> of N-interacting Majorana fermions: N operators chosen to obey the anti-commutation relation[There is a simple way, the Jordan Wigner transform, to present 2N Majorana fermion operators in terms of Pauli matrices: X_1 = ψ_1, Y_1 = ψ_2, Z_1 X_2 = ψ_3, …, Z_1⋯ Z_N-1Y_N = ψ_2N.  Note however that a Hamiltonian which is k-local in terms of Majorana fermions may be N-local written in terms of Pauli matrices.  We will not spell out in this review, but it is straightforward to show that all of the notions of locality, operator size etc., continue to make sense in a Hamiltonian written in terms of Majorana fermions.] \n    {ψ_i, ψ_j} = 2𝕀(i=j).\n\nWe then consider the random Hamiltonian \n    H = ^q/2/N^(q-1)/2∑_i_1<i_2<⋯ <i_q J_i_1⋯ i_qψ_i_1⋯ψ_i_q,\n\nwhere J_i_1⋯ i_q are independent and identically distributed (i.i.d.) random variables with variance \n\n    𝔼[J_i_1⋯ i_q^2 ] = 1/2q([ N-1; q-1 ])^-1.\n\nNote that the model is chosen so that the maximal and minimal eigenvalues of H scale linearly with N (thermodynamic extensivity) <cit.>.\n\nThe fast scrambling conjecture <cit.> asserts that the time it takes for an operator to “grow large\" scales should as ∼log N. A cartoon model for this conjecture comes from considering random circuit dynamics (Section <ref>), in which we apply one interaction term in each discrete time step.  In the first interaction, a single Majorana fermion grows as \n    ψ_1 → [ψ_1⋯ψ_q, ψ_1] = ψ_2 ⋯ψ_q.\n\nThe operator has grown from size 1 to size q-1, because the Hamiltonian involves q Majorana fermions.  In the next time step, each of these q-1 seeds can also grow into q-1 new fermions, and so on; after discrete time t∈ℤ^+, we then estimate that size∼ (q-1)^t, and the time it takes for the size to scale as N is then t∼log N <cit.>.\n\nThere is a remarkable analogy between this cartoon of operator growth, and classical chaos, where one studies some number of degrees of freedom x_j(t) governed by deterministic equations, one often finds that \n    ∂ x_i(t)/∂ x_j(0)∼e^λ_L t,\n\nwhere the exponent λ_L is called the Lyapunov exponent.  While we caution that this exponential growth can also arise from saddle point instabilities <cit.>, it is often associated with the onset of chaotic and irregular behavior (often known as the butterfly effect).  In quantum mechanics, it was first noted a long time ago <cit.> that there is a natural analogy between ∂ x(t)/∂ x(0) and a commutator [x(t),p(0)] (here p denotes the momentum operator).   In recent years, this analogy has been extended to discrete systems via the study of  out-of-time-ordered correlators (OTOC) at infinite temperature between two small operators A_i and B_j, acting on single qubits i and j: \n    [A_i(t),B_j]_F^2=([A_i(t),B_j]^†[A_i(t),B_j]) /(I)≤1/Ne^λ_Lt.\n\nThis correlation function is called out-of-time-ordered because, in ordinary many-body quantum physics, one usually studies either time-ordered or anti-time-ordered correlation functions (e.g. when studying linear response in thermal systems).  To actually evaluate the correlation function in (<ref>) in an “experiment\", one needs to evolve both forwards and backward in time when evaluating ⟨ψ | A_i(t)B_jA_i(t)B_j |ψ⟩ in any state |ψ⟩.  As such, these are not physically accessible correlation functions in most experiments, although nuclear magnetic resonance has been able to achieve such a task for a long time (usually in the study of fairly simple Hamiltonians) <cit.>: see also <cit.> for some recent experimental proposals and progress.  Nevertheless, they have been of some interest in the past decade, as we will discuss more in Section <ref>.\n\nIndeed, we have already seen OTOCs in Section <ref> as a natural probe of the Frobenius light cone.  Is it possible that there is a sharper analogy between classical chaos, and exponential growth of OTOCs? We have already seen in (<ref>) that in local quantum systems, OTOC growth may be algebraic:  [A_0(t),B_r] ∼ t^2r, rather than exponential.  Therefore, genuine exponential growth in OTOCs should only be expected in special circumstances.  One such setting is in systems with either a semiclassical degree of freedom, such as an infinite-dimensional boson, or a large-S spin model <cit.>: see <cit.> for some rigorous results on engineered models of fast scramblers <cit.>.  Alternatively, one can study systems with all-to-all interactions among N finite-dimensional systems, such as Majorana fermions or qubits, e.g. SYK. To the extent that there is an honest period of exponential growth in out-of-time-ordered correlators in local models, it is likely only the case when there are perturbatively weak interactions in quantum field theory <cit.>; see also the cartoon circuit model of <cit.>.\n\nIn systems involving all-to-all interactions between N local degrees of freedom, we will define the Lyapunov exponent in quantum mechanics as the growth rate of operator size:[Note that relative to the classical definition, there is a factor of 2 mismatch.  In the quantum chaos literature, however, the normalization here is fairly standard.] \n\n    (A(t)|𝒮|A(t)) ≈e^λ_Lt,     (1≪λ_Lt ≪log N ).\n\nUsing Proposition <ref>, we can relate this to the typical value of an OTOC between A and a randomly chosen single-site operator.\n\nLet us now return to the SYK model (<ref>). From the proof of Proposition <ref>, we find \n    ({ψ_1(t),ψ_2}^2) ≤1/N(exp[c N^(q-1)/2 t ] -1 ).\n\nBecause the exponent scales with N, we cannot prove the fast scrambling conjecture for the SYK model. This is due to the requirement that H be extensive for typical states, in contrast to the Lieb-Robinson bound (which assumes worst-case scaling of ‖ H‖, and is saturated only by commuting Hamiltonians). Microscopic calculations, in contrast, do find a finite Lyapunov exponent <cit.>. New techniques have been developed to describe operator growth in such systems by incorporating concentration bounds from probability theory <cit.>.  \n[(Heuristic statement) Fast Scrambling bound]\nFor fixed q and sufficiently large N, there exists a constant c=O(1) such that (<ref>) holds for times \n    |t| < c log N.\n\nTherefore, the Lyapunov exponent is constant λ_L=O(1).\n\n\nThe first proof was done by brute force combinatorics first in <cit.>, and later by more elegant methods for general random Hamiltonians in <cit.>.  Both proofs rely heavily on the notion of concentration bounds for random systems, while <cit.> also introduced matrix concentration methods (Section <ref>) for many-body Hamiltonians. The latter was stated in Section <ref>.\n\nTo give some brief conceptual intuition, one can think of the Lyapunov exponent as being finite because the growth of operator size is at best exponential (as in our cartoon above).  A way to make this rigorous is to show that <cit.> \n    ‖ℚ_s ℒℚ_s^'‖≤λ_Lmax(s,s^')/q-2𝕀(|s-s^'|<q-2).\n\nwhere ℚ_s = 𝕀(𝒮=s) is the projection onto operators of size s, and λ_L=O(1).  One shows that (<ref>) holds with extremely high probability in the SYK model, demonstrating non-perturbatively the scaling obtained diagrammatically in <cit.>.  If (<ref>) holds, then we find that \n    d/dt(A(t)|𝒮|A(t)) = (A(t)|[𝒮,ℒ]|A(t)) ≤λ_L (A(t)|  𝒮 | A(t)).\n\nSolving this differential inequality leads to (<ref>).\n\n\nIn general, the proof of <cit.> relies on the randomness of the coupling constants in order to get strong bounds on λ_L.   In the less rigorous physics literature, the randomness of coupling constants can be thought of as helping to organize an expansion of calculations in terms of Feynman diagrams, with dangerous loop diagrams suppressed at large N.   There are also non-random quantum systems where this same diagrammatic suppression can occur.  A particularly relevant example is in matrix quantum mechanics, which is relevant to holography since the matrix degrees of freedom represent the start and end points of open strings on brane stacks <cit.>.   A recent “cartoon matrix model\" <cit.> has also confirmed that such models exhibit analogs of Theorem <ref>.\n\nThere is a notion of “Krylov complexity\" which has been introduced <cit.>, that also appears to compute the Lyapunov exponent λ_L, yet appears distinct from operator size.\n\n\n\n §.§ Random quantum dynamics\n\nIn this section, we briefly review a particularly simple limit of operator dynamics where the problem has random spacetime evolution.   In this case, the problem of operator growth reduces to a completely classical problem.\n\nThe minimal model for operator growth is the random unitary circuit <cit.>.   We will focus on the dynamics in a model with nearest-neighbor interactions in one spatial dimension, but the discussion straightforwardly generalizes to arbitrary graphs.  As shown in Figure <ref>, we consider time evolution in discrete time steps: U=⋯ U(2)U(1), where \n\n    U(1)    = U_12(1)U_34(1)⋯ , \n    \n        U(2)    = U_23(2)U_45(2)⋯,\n\n\nand so on.  Here U_ij denotes a 2-local randomly chosen unitary matrix acting on sites i and j. We choose – at every time step – the U_ij from the Haar distribution, which means that we choose a unitary matrix uniformly from all possible choices.  The key is that since every unitary shows up exactly once, it is easy to perform time averages.\n\n\n\nTo see how, let us further restrict to the case where each site has a single qubit on it. Let us consider how a Pauli matrix X_1 grows under the first time evolution U(1): \n    U(1)^† X_1 U(1)    =  U_12^† U_34^†⋯ X_1 ⋯ U_34U_12= U_12^† X_1 U_12\n       = ∑_a_1=1^3 c_a_1X_1^a_1 + ∑_a_2=1^3 c_a_2X_2^a_2 + ∑_a_1,a_2=1^3 c_a_1a_2X_1^a_1X_2^a_2.\n \nSince X_1 is local, the only unitary that evolves it non-trivially is U_12.  If U_12 is Haar random, all operators acting on the set { 1,2} that square to I are equally likely: in particular, this means that \n    𝔼[c_a_1^2] = 𝔼[c_a_1^2] = 𝔼[c_a_1a_2^2] = 1/15,\n\nwhile any two coefficients are uncorrelated.\n\nIt is helpful to adopt a “super-superoperator\" picture in which \n    𝒰(0)|X_1] = ∑_a_1,a_1^'=1^3 c_a_1c_a_1^' |X_1^a_1)(X_1^a_1^'| + ⋯,\n\nsince in this picture it is easy to average over U_12: \n    𝔼[ |X_1(1)] ] = 1/15(∑_a=1^3 (|X_1^a)(X_1^a| + |X_2^a)(X_2^a| ) + ∑_a,b=1^3 |X_1^aX_2^b)(X_1^aX_2^b|  ).\n\nThe only terms that show up in this average are “diagonal\" in a Pauli basis, meaning that the resulting dynamics can be mapped to a classical stochastic process, essentially corresponding to what sites have a non-trivial Pauli on them.  This allows for large-scale numerical simulations of the resulting dynamics.  Note that when one considers non-Haar random dynamics, such as dynamics constrained by a conservation law, there is no longer a simple picture for operator dynamics in general <cit.>, as the coefficients c become correlated and off-diagonal terms in (<ref>) cannot be ignored.\n\nRandom unitary circuits are useful as toy models for a broad range of problems, as they often illustrate more general phenomena.  One such phenomenon that we have already encountered is a discrepancy between a Lieb-Robinson light cone and a Frobenius light cone.  In units of lattice spacing, the Lieb-Robinson velocity in the circuit of Figure <ref> is v_LR=1, since in principle there exists a circuit where X_1 evolves to X_1⋯ X_L at discrete time t=L-1.  However, in a typical circuit, one finds the operator is supported with overwhelming probability inside a smaller domain <cit.>: this corresponds to a butterfly velocity (see Section <ref>) v_B<1.  In these models, v_B can (in 1d) be analytically computed.\n\n\nIt is straightforward to extend this discussion to continuous time dynamics.  In this case, as one example, one considers a Brownian Hamiltonian of the form \n    H(t) = ∑_e∈𝖤h_e(t)A_e(t),\n\nwhere A_e is an operator acting on edge e, while the couplings h_e(t) are taken to be (usually) Gaussian white noise obeying: \n    𝔼[h_e(t)h_e^'(t^')] = δ_ee^'δ(t-t^').\n\nIn this case, again one finds that the operator growth problem reduces to a classical continuous-time Markov process: see e.g. <cit.>. \n\n\n\n §.§ Possible connections to quantum gravity and black holes\n\nWe now briefly discuss the historical origin of the interest in quantum operator growth and many-body chaos.   While the observation that OTOCs should probe chaos was first noticed many decades ago <cit.>, the OTOC became a much more intensely studied object when it was noticed to possibly relate to quantum theories of gravity.\n\nA bit of background is in order.  About 25 years ago, it was first noticed <cit.> that certain quantum field theories (QFT) which arise in string theory appear to admit a description in terms of gravity in one higher dimension.  It is widely believed (albeit an open conjecture) that this holographic duality provides our first explicit model of quantum gravity, and quantum black holes: see <cit.> for a review on the subject.  Here, we will focus on a peculiar aspect of the duality:  a black hole in the gravity theory is related to a thermal state in the QFT.  Suppose, from the gravity side, we toss in a small particle into the black hole.  In the QFT, this is interpreted as applying a spatially local operator such as A_i.  Under time evolution in the QFT, we expect that A_i(t) becomes a large size operator as discussed above, while in the gravity picture, the particle is falling towards the black hole horizon <cit.>.  It was therefore proposed in <cit.> that there must be a relation between the particle motion in gravity and operator size; this conjecture has some evidence for it in SYK <cit.> but remains open more generally.   See <cit.> for related ideas about the black hole interior and quantum complexity.\n\nFor the purposes of this review, the key feature of this story is that black hole states are finite temperature states – in fact, the temperature T ≪ J must actually be very low compared to any microscopic energy scale J appearing in the Hamiltonian!  If T∼ J, the black hole becomes large enough that it is not believed any semiclassical description of gravity exists.  This is parametrically the opposite regime of the one studied in Section <ref>, where rigorous results on Lyapunov exponents are known.  At finite temperature, it is believed that OTOCs of the form \n    (√(ρ) [A_i(t),B_j]^†√(ρ) [A_i(t),B_j]) ≲1/Ne^2 T t\n\nhave a Lyapunov exponent λ_L≤ 2 T <cit.>.  While it seems many physicists believe that this conjecture is proven, the “proof\" relies on crucial (but reasonable) assumptions about typical thermal/chaotic systems which are not proven.   In our view, it would be extremely valuable to prove a bound on the Lyapunov exponent at finite temperature, assuming only k-locality of the Hamiltonian.   Such an achievement would have key implications for quantum gravity since it is known that the holographic models of semiclassical gravity actually saturate the conjectured bound on the Lyapunov exponent <cit.>.  A rigorous proof of this bound would imply at least one sense in which black holes are the “fastest scramblers\" – more explicitly, they would be the quantum systems that can most effectively scramble information contained in a local operator A_i into a non-local operator A_i(t).  We expect a rigorous proof of any such bound to be an extreme challenge; Section <ref> describes the limited results known to us in finite temperature models.\n\nWhile we have focused on a particular class of random k-local Hamiltonians in this review, we emphasize that there has been a large literature on OTOCs and operator growth <cit.> in spatially local Hamiltonians as well, including via holographic duality <cit.> and “SYK chains\" <cit.>.\n\n\n\n§ SYSTEMS WITH POWER-LAW INTERACTIONS\n\n\nWhile the celebrated Lieb-Robinson bounds have found profound applications in the past decades, one fundamental caveat is that many physical systems are not, strictly speaking, local but with a power-law decay tail (Table <ref>).\n\n\nFor simplicity, our discussion will focus on models defined on some d-dimensional graph of vertex set 𝖵 (Section <ref>).   However, we emphasize that the interactions will not only couple sites connected by an edge of the graph.  For this section only, we define a Hamiltonian with two-body (2-local) interactions to have power-law interactions of exponent ≤α whenever \n    H = ∑_i j∈𝖵 h_ij(t) H_ij\n\nsuch that \n    h_ij(t) ≤C/𝖽(i,j)^α\n\nwhere H_ij acts non-trivially only on sites i and j, with ‖ H_ij‖ = 1, and 0<C<∞ is an absolute constant.\nWhen we say that a system has power-law interactions of exponent α, we mean that α is the largest possible exponent for which this definition holds.\n\n\n\n\n\n\n §.§ Lieb-Robinson light cone\n\nWhile an understanding of quantum dynamics with power-law interactions will thus be relevant for a broad range of physical systems and quantum information processing platforms, it is surprisingly challenging to reasonably extend the Lieb-Robinson Theorem to power-law interacting systems. Let us briefly review the history of bounds on the commutator ‖ [A_0(t),B_r]‖ := C(r,t), between two local operators separated by a distance r.  In 2005, it was shown <cit.> that for any α>d, we have\n    C(r,t) ≤ C_0e^λ t-1/r^α.\n\nThe proof essentially follows that of Theorem <ref>.\nSince C(r,t) ∼ 1 when t∼log r, we say that this system is bounded by a “logarithmic light cone\". Consequently, we can disprove that, e.g., a Bell pair can be created between sites separated by distance r before this time. Such a bound is no tighter than what we saw for systems with all-to-all interactions!   A decade later, <cit.> found a much tighter bound:  for α>2d, we have\n    C(r,t) ≤ C_0 (t/r^κ)^β,\n \nwhere β>0 and 0<κ<1 are constants depending on α, d (see the references for the precise values). These bounds demonstrated an exponential improvement, but do not yield a linear light for any large values of α.\n\nIn the past four years, the shape of the “light cone\" has been essentially tightly established <cit.>, as summarized below.\n[Lieb-Robinson bounds for power-law interacting systems]\n\nConsider r,t large with t/r^min(1,α-2d) fixed.  For α>2d+1, the shape of the light cone is linear <cit.> \n    C(r,t) ≤C/(r-v_LRt)^α\n \nFor 2d<α<2d+1, one instead finds an algebraic light cone <cit.> \n    C(r,t) ≤ C_0 (t/r^α-2d)^β.\n\nThe constants C_0, β, v_LR depend only on α, d. If d<α<2d, then the shape of the light cone is polylogarithmic, as bounded by  (<ref>).\n\nThe proofs of these results are exceedingly technical and take up a few hundred pages. Very briefly, the sharpest results of <cit.> implement a multiscale decomposition of the unitary, which relies on alternating two technical ingredients, one in space and one in time: spatially, one adds interaction with longer ranges via the interaction picture; temporally, one connects short-time Lieb-Robinson bounds into long-time Lieb-Robinson bounds. In contrast, the naive recursive Lieb-Robinson bounds in terms of summing over paths (Theorem <ref>), albeit simple, seem to lose some essential physics of the power-law interaction system.\n\nIn 1D, a much shorter alternative proof is possible <cit.> (and historically precedes the sharpest results in Theorem <ref>); this requires regrouping the Hamiltonian by scales and expanding the exponential into a carefully chosen interaction picture (as a variant of the self-avoiding path construction in Theorem <ref>). Unfortunately, this approach does not seem to generalize to higher dimensions.\n\n\n\n §.§ Frobenius light cone\n\n\nThe Frobenius light cone in power-law interacting systems  qualitatively differs from the Lieb-Robinson bounds <cit.>: see Figure <ref>. This means that quantum dynamics in power-law interaction systems drastically depends on whether one considers the fine-tuned (worst-case) or random (average-case) states; there are even regimes where the distinction is exponentially large!\n\n\n\nRight now, the complete shape of the Frobenius is only fully understood in d=1:\n[Frobenius bounds for 1d power-law interacting systems <cit.>]\nFor d=1, α >1, and any δ >0, we have\n\n    ‖ [A_0,B_r] ‖_F≥δ  requires   |t| ≥δ^2 C ×{[   r/ln r      α>2; r/ln^2 r   α =  2;    r^α-1    1<α<2 ].\n\nwhere the constant 0<C<∞ depends only on α.\n\nConcretely, we see the transition to the algebraic light cone (α =2) is distinct from the Lieb-Robinson bounds (α= 3). In higher-dimension (d≥ 2), the critical value for this transition remains unknown, but is conjectured to be d+1.  However, we do at least know that the possibility for exponentially fast scrambling (a la Section <ref>) is forbidden until α=d:\n\n[Algebraic Frobenius bounds for power-law interacting systems <cit.>]\nFor any α >d,\n\n    ‖ [A_0,B_r] ‖_F≤ C ( t/r^κ)^β\n\n where the constants 0<C <∞,   0<κ <1, 0<β depend only on α, d. \n\n\nAnother setting where the (conjectured, in d>1) Frobenius light cone is reached is when studying single-particle quantum walks (which also apply to free fermion models), where single-particle hopping rates are suppressed by power-law decay with distance:   \nConsider a single-particle walk on a d-dimensional lattice with power-law interactions, generated by \n    H(t) = ∑_u,v∈𝖵 h_uv(t)|u⟩⟨ v|\n\nwhere the matrix h_uv(t) is Hermitian and obeys (<ref>). Then for any ϵ>0, so long as α>d, there exist constants 0<v_sp,K<∞ such that \n    |⟨ u|e^-iHt|v⟩| ≤Kt/(𝖽(u,v)-v_spt)^α-d-ϵ\n\nat sufficiently short time.  For α<d+1, we may take v_sp=0.\n\n\n\n\n §.§ Applications\n\nAs we have emphasized in this review, Lieb-Robinson bounds constrain the minimal time required for various practical tasks.  An important question becomes whether these bounds can ever be saturated.  Remarkably, it turns out to be the case for many of the bounds in this section!  Hence we know that these bounds are optimal.  \n\nIn particular, it is possible <cit.> to use power-law interactions to prepare GHZ states (<ref>) at the maximal rate allowed by Theorem <ref>. The algorithm is an iterative process (<ref>), with the parameters of the algorithm (such as the number of clusters and number of iterations) chosen efficiently, so as to essentially saturate the limit allowed by Theorem <ref>.\n[Optimal state transfer protocol with power-law interactions <cit.>]\nThe shapes of the light cone in Theorem <ref> are achieved by the state transfer protocols <cit.>.\n\n\n\n\n\n[Fast W-state preparation with power-law interactions <cit.>]\nThe basic strategy is to use a free-fermion quantum walk, with all-to-all interactions of power-law strength between sets B_n of increasing size D_n ∼ 2^n leading to a W-state expanding from one bubble to the next: see Figure <ref>.  In the n^th time step, the Hamiltonian takes the form of \n    H = ∑_u ∈ B_n,v∈ B_n+1-B_n1/D_n+1^α(c^†_u c_v + c_v^† c_u )\n  At each time step, due to constructive interference, the time to grow a W-state in B_n into a W state in B_n+1 scales as \n    τ_n ∼ D_n+1^α-d,\n\nmeaning that the total runtime of the algorithm scales as R^min(1,α-d).  For α>d+1, nearest neighbor hopping algorithms can be employed as an alternative.  Note that this quantum walk thus also asymptotically saturates Proposition <ref>.  Two interesting features of this protocol are that it leads to efficient transmission of multiple qubits (with only √(m) increased runtime needed to send m qubits), and that it is robust to certain kinds of coherent errors in the protocol <cit.>.\n\n\n\n\nBoth the GHZ and W state preparation algorithms can be used to perform state transfer, by simply reversing the unitary protocol that generates it, but “ending\" on a site on the other side of the domain.  An earlier state transfer protocol based on power-law interactions is given in <cit.>.\n\n\nIn addition to preparing a particular entangled state, one may seek to generate as much bipartite entanglement as possible between two regions exploiting power-law interaction. Naturally, one strategy is to repeat single-qubit state transfer <cit.>, which turns out to be optimal using resource theory arguments (Section <ref>).\n[Optimal generation of bipartite entanglement with power-law interactions]\nIn a d-dimensional model with power-law interactions of exponent α, generating the maximally entangled state between two adjacent cubes with side length r takes time at least <cit.>\n    t = Ω(r^min(1,α-d)),\n\nstarting from an arbitrary initial state without bipartite entanglement. This is asymptotically saturated (up to sub-algebraic corrections) by sequentially sending 1-qubit at a time using the protocol of <cit.>. \n\nThe above is a direct application of bipartite entanglement generating bounds (Proposition <ref>) by summing over all interactions.\n\nRecent work <cit.> has also discussed bounds on correlations and entanglement in gapped ground states of systems with power-law interactions.  Some results on prethermal behavior in power-law interacting systems can be found in <cit.>.\n\n\n\n\n§ BOUNDS AT FINITE ENERGY AND FINITE DENSITY\n\n\nThe Frobenius light cone perspective is closely related to the study of dynamics at finite charge density or finite energy density.  Indeed, while any formal Lieb-Robinson bound would hold for any state at low energy (e.g.), we usually anticipate a much stronger bound holding in practice.  In this section, we will describe a variety of methods that are used to try and provide stronger bounds on dynamics at low temperature or low density.\n\n\n §.§ Dynamics at low charge density\n\nWe begin with a discussion of dynamics in a system of  N qubits governed by time evolution that commutes with the total Z-spin (or magnetization): \n    Q = ∑_i=1^N 1+Z_i/2 = ∑_i=1^N n_i.\n  If time evolution is generated by a continuous Hamiltonian, \n    [H(t),Q] = 0.\n\nNote that in this section it will be more convenient for us to define n_i=0,1 rather than Z_i = -1,1.  \n\n\n\n  §.§.§ Formalism for low-density quantum walk bounds\n\n\nWe are interested in “low density\" states, or those where ⟨ Q⟩≪ N.  While it follows from (<ref>) that Q is exactly conserved if we restrict the Hilbert space to states with Q “particles\", the Hilbert space does not have a product space structure.  Notions like operator size become challenging to define, and more importantly, it is far from obvious how to exploit the low-density nature of the state to derive an improvement on a Lieb-Robinson-like light cone, restricted to such a low-density state.\n\nFor low-density states, the situation seems relatively mild, due to the following proposition: \n\nConsider the “grand canonical\" density matrix \n    ρ = e^-μ Q×normalization.\n\nIn the N→∞ limit, correlation functions tr(ρ A) of operators A that can only create or destroy O(1) particles are determined by states at density \n    n̅ = Q/N = 1/1+e^μ.\n\nThe allowed family of A includes all local k-point functions for fixed k.\n\n\nSince ρ is diagonal in the n_i basis, this proposition is a statement about the probability that a state is drawn from ρ has a given density of particles n = Q/N?  From the form of ρ, the probability that we would draw n_i=1 is independent and identically distributed with respect to any n_j (j i).  Using a modification of (<ref>), we find:\n\n    ℙ[ | Q/N-n̅| > c/√(N)] < exp[ - c^2/2n̅(1-n̅)].\n\nWe say that ρ concentrates on states of density n̅.\n\n\nThis proposition is very helpful because it turns out to be quite natural to calculate expectation values with ρ using a mild modification of the formalism of Section <ref>.  In particular, using the density matrix (<ref>), consider redefining the operator inner product (<ref>) to <cit.> \n    (A|B) = tr(√(ρ) A^†√(ρ) B).\n\nThis inner product concentrates in the thermodynamic limit onto states at density n̅.  \n\nRef. <cit.> proposed a natural generalization of operator size to a (low-density) system.  Defining the operators \n    c_i = | 0⟩⟨ 1|_i   and    c_i^† = |1⟩⟨ 0|_i,\n\n\nwe notice that the space of operators is \n    End(ℬ) = span( { I, c_i, c_i^†, n_i }^⊗ N).\n\nThere is then a natural definition of operator size: \n    𝒮 = ∑_j=1^N 𝒮_j,\n\nwhere on a single site \n    𝒮|I) = 0|I),   𝒮|c) = |c),   𝒮|c^†) = |c^†),   𝒮|ñ) = 2|ñ),\n\nwhere \n    |ñ) := |n) - n̅ |I).\n\nSince n=c^† c, one can think of this 𝒮 as counting the number of c and c^† in an operator string.  |ñ) is defined to be orthogonal to the identity, which is why we have subtracted off its average.\nNote that this definition does not reproduce, when μ=0, the standard definition of operator size: the Pauli Z has “twice\" the length of X or Y, at μ=0.  After a short calculation, one finds that \n    (I|I)    = 1, \n    \n        (c_i|c_i)    = (c_i^† | c_i^†) = e^μ/2n̅ = √(n̅ (1-n̅)), \n    \n        (ñ_i |ñ_i)    = n̅ (1-n̅).\n\nWhen n̅≪ 1, one can heuristically think that the inner product of an operator A of size s has an inner product (A|A) ∼n̅^s/2. \n\n\n\n  §.§.§ Operator growth and decay\n\n\nWith these definitions, we are now ready to discuss two useful results that allow us to generalize the many-body quantum walk bounds to low-density systems. \n\nUnder the inner product (<ref>) and charge-conserving dynamics, (A(t)|A(t)) = (A|A).\n\nThe proof of this follows immediately from (<ref>) and Proposition <ref>.    The Lyapunov exponent λ_L can be defined for the μ-dependent notion of size, analogously to Section <ref>.  We then find:\n[Bounds on Lyapunov exponent at finite density]\nFor some 0<C<∞, in a model subject to the assumptions of Theorem <ref>, together with (<ref>),  \n    λ_L≤ C √(n̅).\n\n\n \nThe idea is rather similar to Theorem <ref>: we expand \n    |A) = ∑_s |A_s)\n\ninto operators of fixed size: 𝒮|A_s)=s|A_s), such that \n    d/dt(A(t)|𝒮|A(t)) = (A(t)|[𝒮,ℒ]|A(t)) = ∑_s_1<s_22(s_2-s_1)× (A_s_2(t)|i[H,A_s_1(t)]).\n\nThe key observations are that: (1) using antisymmetry of ℒ we can always do this, and (2), as this inner product vanishes unless [H,A_s_1] has size s_2>s_1, we can bound (under similar k-locality assumptions to Theorem <ref>): \n    (A_s_2(t)|i[H,A_s_1(t)]) ≤ Cs_1 ×[n̅ (1-n̅)]^(s_2-s_1)/4×√((A_s_2|A_s_2)(A_s_1|A_s_1)).\n\nThe constant C will be related by a constant prefactor to the value at n̅=0, but due to the fact that the analog of Pauli Z has both size-0 and size-2 components under our current counting, it may have quantitative (though not qualitative) n̅ dependence.  The new factor of interest in (<ref>) is the n̅^(s_2-s_1)/4 scaling.   The reason we have this prefactor is that the inner product (A_s_2(t)|i[H,A_s_1(t)]) is between two operators of size s_2, whereas (A_s_1|A_s_1) is normalized to a size s_1 operator, so we need additional factors from (<ref>).\n\nLastly, due to [H,Q]=0, if [A,Q] = kA, then [A(t),Q]=kA(t).   In particular, this means that under time evolution, we can only modify A by operators that do not contribute an odd number of “c or c^†\", as defined in (<ref>). Therefore, in (<ref>), we must have s_2-s_1 ∈ 2ℤ^+.  The smallest value that can contribute to the Lyapunov exponent is s_2-s_1=2.  Hence we obtain (<ref>).\n\n\nThe fact that λ_L must vanish at low density is qualitatively similar to the proposal of <cit.> that dynamics must slow down at low temperature, although it is far from clear how to generalize this argument to finite temperature states.  Using the same technique, one can prove the following corollary, which states that in typical states, the time it takes for a single-particle operator to decay into a many-particle operator is slow.  This is reminiscent of a conjecture of <cit.> about the slow decay of “small operators\" in finite temperature dynamics. \n[Decay time bound at finite density]\nFor times t < τ = C n̅^-1/2, the time evolution of a size-1 operator (“creation/annihilation operator\"), is well approximated by single-particle dynamics.  Namely, if 𝒮|A)=|A), then there exists |B(t)) = 𝒮|B(t)) such that  for t<τ, (A(t)|B(t)) ≥1/2√((A|A)(B|B)).\n\nUsing Fermi's Golden Rule, we might expect to have the stronger scaling τ∼n̅^-1, but such a result has not yet been proved in generality (as far as we know).  Intuitively, this scaling would then be optimal, since a particle traveling at constant velocity (see the next subsetion) will encounter another particle in a time ∼n̅^-1, at which point we expect single-particle correlation functions to decay.\n\n\n\n  §.§.§ Butterfly velocity\n\nOne might expect that, similarly to how the Lyapunov exponent decreases with increasing n̅, the butterfly velocity also decreases as v_B∼n̅.  Indeed this is expected on heuristic grounds <cit.>.  However, we emphasize that this is quite non-trivial to prove (in fact an outstanding question). The challenge can be seen by considering just one particle (the Q=1 subspace). In this setting, the quantum dynamics reduces to a single particle quantum walk, which we have seen has a finite velocity in Section <ref>.  So there cannot, in a strict sense, be any bound on signal propagation at low density where the velocity vanishes with n̅.\n\nWhat was conjectured in <cit.> is that for short times τ≲n̅^-1, an operator indeed behaves as if it propagates in this Q=1 Hilbert space, with a finite velocity.  After t∼τ, however, the operator grows more complex, and destructive interference sets in between operators of different sizes, in such a way that the effective operator growth front propagates with a velocity v_B∼n̅.  It would be interesting if this can be shown rigorously in any context.  The fact that there is a fast velocity for operator growth at short times, and a slow velocity at late times, poses a challenge to attempts <cit.> to universally bound diffusion constants in terms of v_B and λ_L.\n\n\n\n\n §.§ Models of interacting bosons\n\n\nWe now turn to a very similar story, where we study the dynamics of interacting bosons.  Starting for the moment with a single boson, the Hilbert space is that of the quantum harmonic oscillator, labeled by an infinite tower of states |n⟩, for n∈ℤ^+.  We define the operators \n    b|n⟩   := √(n)|n-1⟩, \n    \n        b^† |n⟩   := √(n+1)|n+1⟩.\n\n\nNext, we consider an interacting boson model on a graph 𝖦=(𝖵,𝖤).   On every vertex of the graph, we consider a bosonic Hilbert space as above.  The creation and annihilation operators obey \n    [b_u,b^†_v] = 𝕀(u=v).\n\nFor convenience, we will restrict our study to (time-dependent) Hamiltonians of the form \n    H(t) = ∑_{ u,v}∈𝖤 J_uv(t) (b^†_u b_v + b^†_v b_u) + ∑_v∈𝖵f(b^†_v b_v),\n\nwhere f is an arbitrary function.  The results we describe below can be generalized to slightly more complex H; for pedagogy, we stick to the above.   However, the essential features of (<ref>) are that: (1) only one boson can move at a time, and (2) the energy in f will in general be unbounded; however it only depends on the boson number operator b^†_v b_v.   For u v, we have [b^†_u b_u, b^†_v b_v] = 0, so the interaction terms in the Hamiltonian commute.  (<ref>) generalizes the classic Bose-Hubbard model <cit.>, in which J_uv=J does not depend on time, while for some constant U, \n    f(n) = Un(n-1).\n\n\nEven with these restrictions, however, it is non-trivial to imagine a Lieb-Robinson bound for such a problem.  Every single operator in (<ref>) is unbounded in operator norm, so the conventional proof of a Lieb-Robinson bound as in Section <ref> will not work.  Moreover, there is a physical construction <cit.> that leads to propagating velocity v∼n̅, if n̅ is the mean number of bosons per site in the system.  Therefore, for some time, Lieb-Robinson bounds with bosons were only found in quite restrictive settings, such as classical models <cit.>, harmonic (non-interacting) models or models with bounded interaction strength <cit.>, or models with a bounded boson number <cit.>.  \n \n\nRecently, the nature of Lieb-Robinson light cones in interacting boson models has been rigorously established.  A nearly linear light cone was presented in <cit.>, while the exact linear light cone (in a sense described below) was proved in <cit.>.  The proofs of all results are rather involved so we leave them to the literature, and just highlight the conclusions here with some prototypical examples.\n\n[Linear light cone for interacting bosons in typical states]\nLet A_u and B_v denote local operators consisting of a finite number of raising and lowering operators, acting on single sites u,v∈𝖵.  Then for some constants 0<C,v,a<∞, <cit.> \n    (√(ρ)[A_u(t),B_v]^†√(ρ)[A_u(t),B_v]) ≤ C (vt/r)^ar\n\nWhen A_u and B_v are single boson creation or annihilation operators, there exist 0<c_1,2<∞ such that \n    v ≤ c_1 + c_2 n̅.\n\nThis scaling is known to be asymptotically optimal <cit.>.\n\n\n\n[Lieb-Robinson light cone in finite density states in one dimension]\nConsider two arbitrary states |ψ_1,2⟩ of bosons on a one-dimensional lattice, restricted to the form \n    |ψ_1,2⟩ = ∑_n_i = 0^M c_1,2(𝐧) |⋯ n_1n_2⋯⟩\n\nNamely, there are in the initial state, no more than M bosons on any given site.   Then for any M and some 0<C,v,a<∞ which can depend on M, <cit.> \n    |⟨ψ_1|[A_u(t),B_v]|ψ_2⟩ | ≤ C (vt/r)^ar .\n\nAll matrix elements of commutators are small in one dimension.\n\n\nOne can prove, as a consequence of this theorem, that gapped ground states have exponential correlations <cit.>, and that bosons are not too much more difficult to simulate than spins, at low density.  However, the analogy between the locality in the Bose-Hubbard model and in interacting spin models does not persist in higher dimensional settings.  \n\n\n[No Lieb-Robinson light cone beyond one dimension <cit.>] \nThere exist states |ψ_1,2⟩ of the form (<ref>), and time-dependent H of the form (<ref>), on a d-dimensional lattice (d>1), for which |⟨ψ_1|[A_u(t),B_v]|ψ_2⟩ | ≥ 1 for r=bt^d, for O(1) constant b.  Hence, there is an effective velocity v_eff∼ t^d-1.  However, up to logarithmic corrections, one cannot find any protocol for which v_eff is faster. \n\n\nThe basic idea behind this theorem is to imagine propagating information in the x_1-direction, and starting with a state with one boson on every site at time t=0.  For time 0<t<T/2, we pile up bosons in x_1=const. planes, as much as possible, along the axis x_2=⋯ = x_d=0.  At time T/2, we have ∼ T^d-1 bosons on every site.  Then we use the protocol of <cit.> (see (<ref>)) to send signals at a speed v∼ T^d-1 along the x_1-axis.  However, it is also known that while “signals\" can be sent very quickly in higher dimensions, a large number of bosons cannot be: \n[No fast particle transport (informal) <cit.>]\nLet 𝖱⊂𝖵 have diameter r.  Then in any state with N bosons in region 𝖱 at t=0, the time τ needed to move a finite fraction (e.g. N/2 bosons) out of 𝖱 obeys τ≥ Cr for some 0<C<∞. \n\n\nEven in one dimension, it is known that the finite speed limit at low density arises only due to the particular nature of the Hamiltonian (<ref>).  One way to violate any Lieb-Robinson-like bound is to include number-conservation-violating terms such as b_i^† b_i+1^† + H.c. <cit.>, which can cause the effective velocity to grow exponentially with time: v∼exp(t).   But even if we conserve number, a density-dependent hopping term f_i(n_i+n_i+1) b_i^† b_i+1+H.c.) will destroy many notions of locality.  Recall for example that with f=1, the time it would take to get from a state where all bosons are piled up on the left end of a 1d chain (|n0⋯ 0⟩), to a state where they are all piled up on the right (|0⋯ 0n⟩) would scale with the length of the chain, and independently of n.  However, by simply choosing f_i=n_i+n_i+1, we can make the time arbitrarily small by decreasing n.  We expect that using similar strategies to Theorem <ref>, especially in higher dimensions, one will find little remains of a notion of locality once the interacting terms incorporate boson hopping.\n\nLastly, we remark that special Lieb-Robinson bounds have been derived <cit.> for Hamiltonians of the schematic form \n    H = b^† b + b A + b^† A^†\n\nwhere A is a k-local many-body operator, and b is the boson annihilation operator.  One can generalize to multipole boson modes as well. Such Hamiltonians  arise when modeling trapped ion crystals <cit.>.  \n\n\n\n §.§ Lieb-Robinson bounds in continuous space at finite energy\n\nNow, we turn to bounds that only hold at finite energy (density).   This is an extremely hard problem, albeit one of significant physical importance.   We begin by briefly reviewing the efforts to extend the Lieb-Robinson Theorem into the continuum.   This literature has mainly remained restricted to the mathematics community <cit.>; however, we will give an intuitive sketch of the ideas in the context of the one-dimensional Schrödinger equation (which seems to us to capture the essence of many of the ideas developed there).  The key insight is, as we explain shortly, such bounds are only plausible at finite energy.  Hence, this provides a nice gateway into the study of bounds on finite temperature dynamics more generally.  We will avoid technical discussions of functional spaces and smoothness, which are of course discussed at length by mathematicians, and focus on aspects of the literature that seem relevant for finite-dimensional quantum systems as well.   \n\nWe now prove the following theorem, which represents the minimal model of a continuum Lieb-Robinson-style bound, applicable to the motion of a single particle.\n[Continuous space Lieb-Robinson bound at low energy]\n\nConsider the time-independent Hamiltonian operator \n    H = -1/2∂_x^2 + V(x)  such that   V(x) ≥ 0   .\n\nDefine a projector onto low-energy states \n    ℙ_E := 𝕀(H ≤ E ).\n Then, \n    ‖ℙ_E [H,x] ℙ_E ‖≤√(2E),\n\nand for any state obeying |ψ⟩ = ℙ_E|ψ⟩, \n    ⟨ψ| e^iHt x e^-iHt|ψ⟩≤⟨ψ | x | ψ⟩ + √(2E)t.\n\n\n\nSince H does not depend on time, [e^iHt,ℙ_E]=0, so (<ref>) follows immediately from (<ref>).   To prove (<ref>), observe that \n    [H,x] = -1/2[∂_x^2, x] + [V(x),x] = -∂_x.\n\nNow using (<ref>), we see that (for any normalized states ⟨φ|φ⟩ = ⟨φ^' | φ^'⟩ = 1): \n    | ⟨φ | ℙ_E ∂_x ℙ_E|φ^'⟩|^2 ≤⟨φ | ℙ_E ∂_x ℙ_E^2 ∂_x^†ℙ_E|φ⟩≤⟨φ | ℙ_E (- ∂_x^2) ℙ_E|φ⟩   = ⟨φ| ℙ_E (2(H-V))ℙ_E|φ⟩\n       ≤ 2⟨φ|ℙ_EHℙ_E|φ⟩≤ 2E.\n\nSince we have bounded the largest possible matrix element of ℙ_E[H,x]ℙ_E, we obtain (<ref>).  \n\n\nWhat this theorem implies is that, if we can restrict to low energy states, there is a Lieb-Robinson-like bound that depends on energy E.  Note that in the present proof, we have assumed V does not depend on time t.  This assumption was important to ensure that the potential does not inject energy into the system.[It is likely that certain time-dependent potentials are mild, however: see e.g. <cit.> for a nonlinear Schrödinger equation where an effective time-dependent potential does not qualitatively change the nature of (<ref>).]  We also note (but do not show) that by studying ⟨ψ| e^ax(t) |ψ⟩ using quantum walk techniques, we find that |ψ(t)⟩ must be exponentially localized in space.\n\nThis bound has been generalized to higher dimensions and more recently to a weakly nonlinear Schrödinger equation <cit.>.  This technique can also be straightforwardly extended to certain many-body fermion models <cit.>, similar to the Bose-Hubbard model.\n\n\n\n §.§ Butterfly velocity and finite temperature bounds\n\nAn idealistic goal would be to generalize Theorem <ref> to many-body systems.  Of course in principle this is possible formally: one could study for example a first-quantized model of N particles interacting on a lattice, or in the continuum, and apply this bound.  However, there is a crucial problem.   If we have N particles interacting on the line, then E∼ N in a physically reasonable state (e.g. one drawn from the finite temperature ensemble, with high probability).   Our energy-dependent velocity bound would then diverge in the thermodynamic limit.  This problem arises because we cannot rule out the possibility that all of the energy in the system is dumped into a single particle's kinetic energy, which then can propagate very fast.  \n\nWhile this scenario is almost certainly unphysical, ruling it out has been a mathematical challenge.  It is noted in <cit.>, following earlier work <cit.> on particle transport in the Bose-Hubbard model, that if one asks about average particle velocity, this effect disappears and one can show that the typical particle cannot move faster than allowed by the average energy per particle.\n\nConjecturing, however, that one can achieve this goal of finding an energy-dependent velocity bound in many-body systems, what should we expect to find?  We conjecture that the correct bound would be of the form \n    ‖ℙ_E [H,x_i]ℙ_E ‖≲ v_B≈ Tξ,\n\nwhere T is the temperature and ξ is the thermal correlation length.    For single-particle motion, we can “derive\" (<ref>) from Theorem <ref> as follows: the energy E of the particle is roughly the temperature T, while the thermal correlation length ξ∼ 1/⟨ |∂_x|⟩∼ 1/√(T).  In lattice models, this scaling of ξ can be derived rigorously using a Chebyshev expansion <cit.> of the thermal density matrix e^-β H <cit.>.   \n\nFor single particle motion, (<ref>) was proved in <cit.> subject to some rather special constraints on H.  Roughly speaking, suppose one has H ∼∂_x^z, where z=2,4,6,… is an even integer.  Then one expects \n    ξ∼ T^-1/z.\n\nUsing methods analogous to the proof of Theorem <ref>, <cit.> has demonstrated a family of spatially inhomogeneous lattice and continuum models where (<ref>) can be derived with (<ref>).   Using non-rigorous methods, this scaling has been demonstrated for the dynamics of free fermions in <cit.>, and in holographic models (see Section <ref>) of quantum matter <cit.>.\n\nWe believe that (<ref>) is quite intuitive: at low temperatures, one might expect an effective description of the dynamics with a Hamiltonian where local terms have energy of at most T: the price we must pay is that this effective Hamiltonian will be non-local on a scale set by the thermal correlation length ξ.\n\nNote that the thermal correlation length ξ has been bounded to always be less than T^-1 in local lattice models with a finite-dimensional local Hilbert space dimension <cit.>; unfortunately, with this scaling, (<ref>) simply reproduces the Lieb-Robinson bound.  Indeed, the proof that ξ≲ T^-1 uses Lieb-Robinson bounds! Other recent work <cit.> has studied entanglement in thermal states.  It is possible that these methods could be helpful in proving rigorous bounds on the butterfly velocity.\n\nThe authors of <cit.> have taken a somewhat different attempt to bound the butterfly velocity; however, their approach is not known to reproduce the desired scaling of (<ref>).\n\n\n\n§ OPEN PROBLEMS\n\nWe have given a fairly detailed overview of Lieb-Robinson bounds, along with their known extensions and applications.  Now, we conclude  with a brief discussion and recap of interesting open problems and directions.\n\n(1) As discussed in Section <ref>, we do not know how to bound the decay times of simple correlation functions.  Solving this problem may lead to qualitatively new methods for locality bounds in quantum dynamics, and seems like an important issue to address in the near future.\n\n(2) As we just discussed, bounds on finite temperature dynamics are both notoriously difficult (as are statements about even equilibrium properties such as entanglement!), yet they have been the inspiration for many of the important developments in this field in recent years.  We hope that it is possible to generalize the Frobenius light cones described in Section <ref> to generic finite temperature Hamiltonian systems, but this is likely to be an extraordinary challenge.  A particularly motivating problem would be a proof of the chaos bound of <cit.> in all-to-all interacting models, without ergodicity assumptions (see also <cit.>).\n\n(3) It is not known how to prepare the W state (<ref>) as quickly as the GHZ state (<ref>), using both unitary dynamics and local measurement.  We expect that it is provably harder to prepare W states.  Whether or not a clever application of Lieb-Robinson bounds can prove this result or one needs a more fine-grained bound on multipartite entanglement, is an important open problem.  More generally, we expect that deeper incorporation of Lieb-Robinson bounds into error-corrected quantum dynamics with measurement can be a fruitful endeavor.\n\n(4) It would be interesting if the techniques of Section <ref> can rigorously address actively debated questions about the existence and robustness of many-body localization <cit.>.\n\n(5) There is rather extensive literature on quantum walks <cit.>.  Sometimes, this literature makes deep connections to the classical theory of random walks and Markov chains <cit.>, although certain notions such as hitting time have been delicate to extend to the quantum setting.  It might be fruitful to revisit some of these questions with the recent developments of Section <ref> in mind.\n\n\n(6) Recent work <cit.> uses cluster decomposition techniques (more well-known in equilibrium statistical mechanics) to study quantum dynamics.  Combining these techniques with Lieb-Robinson bounds may be a fruitful direction for future research.\n\n(7) Preparing squeezed states <cit.> is notoriously difficult in experiments, and we expect that Lieb-Robinson bounds, and the corresponding notions of locality, could help find efficient ways to generate highly squeezed states, likely using error correction as part of the protocol <cit.>.\n\n(8) The linear-to-algebraic transition in the Frobenius light cone for power-law interactions (Section <ref>) remains open for d≥ 2 dimensions.\n\n(9) Understanding whether there are any more general classes of interacting boson models where sharp Lieb-Robinson bounds can be derived in thermodynamically reasonable states is an important problem, especially since many future quantum computers (whose operation speed might be constrained by a Lieb-Robinson light cone) will contain bosonic degrees of freedom.\n\ntocsectionAcknowledgments\n\n\n§ ACKNOWLEDGMENTS\n\nThis work was supported in part by a Research Fellowship from the Alfred P. Sloan Foundation under Grant FG-2020-13795 (AL), and by the U.S. Air Force Office of Scientific Research under Grant FA9550-21-1-0195 (AL, CY).\n\n\n\n\n \nJHEP\ntocsectionReferences\n\n\n\n\n"}