{"entry_id": "http://arxiv.org/abs/2303.07343v1", "published": "20230313175943", "title": "Building Krylov complexity from circuit complexity", "authors": ["Chenwei Lv", "Ren Zhang", "Qi Zhou"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.quant-gas", "cond-mat.str-el", "hep-th"], "text": "\n\n\n \nThey contribute equally to this work.\n Department of Physics and Astronomy, Purdue University, West Lafayette, IN, 47907, USA\n\n \nThey contribute equally to this work.\nSchool of Physics, Xi'an Jiaotong University, Xi'an, Shaanxi 710049\n\n\n\nzhou753@purdue.edu\nDepartment of Physics and Astronomy, Purdue University, West Lafayette, IN, 47907, USA\nPurdue Quantum Science and Engineering Institute, Purdue University, West Lafayette, IN 47907, USA\n\n\n\nKrylov complexity has emerged as a new probe of operator growth in a wide range of non-equilibrium quantum dynamics. However, a fundamental issue remains in such studies: the definition of the distance between basis states in Krylov space is ambiguous. \nHere, we show that Krylov complexity can be rigorously established from circuit complexity when dynamical symmetries exist. \nWhereas circuit complexity characterizes the geodesic distance in a multi-dimensional operator space, Krylov complexity measures the height of the final operator in a particular direction. \nThe geometric representation of circuit complexity thus unambiguously designates the distance between basis states in Krylov space. \nThis geometric approach also applies to time-dependent Liouvillian superoperators, where a single Krylov complexity is no longer sufficient. \nMultiple Krylov complexity may be exploited jointly to fully describe operator dynamics. \n\nBuilding Krylov complexity from circuit complexity\n    Qi Zhou\n    March 30, 2023\n==================================================\n\n\n\nIn the past few years, significant progress has been made in the study of non-equilibrium quantum phenomena, ranging from eigenstate thermalization to  quantum information scrambling <cit.>. \nA central task of these studies is to explore how local quantum information spreads to the vastly large degree of freedom in a many-body system <cit.>. \nSome commonly used theoretical tools include the out-of-time-order correlator and Loschmidt echoes, among the many others <cit.>. \nKrylov (K-) complexity has recently been introduced as a new probe of quantum information spreading in non-equilibrium dynamics <cit.>. \nIn the Heisenberg picture, a local operator may evolve into a non-local one in quantum dynamics. K-complexity traces such operator size growth and thus provides physicists with deep insights to many fundamental questions in non-equilibrium dynamics <cit.>.    \n\nThe study of K-complexity is based on the Lanczos algorithm <cit.>. \nIn the Heisenberg picture, an operator is denoted by 𝒪̂(t)=∑_m,n𝒪_mn|m⟩⟨n|, where t is the time, |m⟩ is a set of orthogonal eigenstates and 𝒪_mn are the matrix elements. 𝒪̂(t) may be regarded as a state in the operator space and thus can be denoted as |𝒪(t))≡∑_m,n𝒪_mn|m⟩⊗|n⟩. \nUsing the Krylov basis |𝒪_n), an ordered set of mutual orthogonal operators,   \n\n    |𝒪(t))=∑_n ϕ_n(t)|𝒪_n),\n \nwhere |𝒪_0)=|𝒪(t=0)). |𝒪_n≠0) is generated by commutators of 𝒪̂_0 and Ĥ recursively using the Lanczos algorithm. \nFor instance, |𝒪_1)=b_1^-1|[H,𝒪_0]), where the normalization constant b_1 is introduced such that (𝒪_n|𝒪_n)=(𝒪_0|𝒪_0). \nThe inner product in operator space is defined as (A|B)=(A^† B).\nThe other Krylov basis states are defined recursively by |𝒪_n)=b_n^-1(|[H,𝒪_n-1])-b_n-1|𝒪_n-2)). \nK-complexity is defined as \n\n    C_K(t)=∑_n n|ϕ_n(t)|^2,\n\nwhich can be viewed as the expectation value of the Krylov operator \n\n    K̂_𝒪=∑_n n |𝒪_n)(𝒪_n|.\n\nIntuitively, Eq.(<ref>) describes the mean width of a wavepacket in the Krylov space and thus quantitatively measures how the size of the operator increases as time goes by. \nWhereas it was hypothesized that C_K has the fastest growth in a chaotic system <cit.>, recent studies have shown that similar behaviors of C_K may arise in non-chaotic systems <cit.>.   \n\nDespite the exciting development in the study of K-complexity, a fundamental question remains. \nThe Lanczos algorithm only provides an ordered Krylov basis but does not supply a distance among them.  \nTo obtain the operator size described by Eq.(<ref>), |𝒪_n) are assumed to be equally spaced. \nAs such, any quantitative results of K-complexity are built upon the choice that the distance between |𝒪_n) and |𝒪_0) has been chosen as n. \nIn practice, substituting n by any other function h(n) shall change all results of K-complexity. \nAt a more fundamental level, without prior knowledge of the geometry of the operator space, any choice of the distance between |O_n) could be regarded as ambiguous. \nIt is thus desirable to define K-complexity rigorously by specifying the geometry of the Krylov space where |𝒪_n) live.  \n\nHere, we show K-complexity can be systematically established from circuit (C-) complexity, a concept that originated from quantum computation and is now being widely used in many other areas including high energy physics and condensed matter physics <cit.>. \nIn quantum computation, C-complexity describes the smallest number of gates to reach a target state from a reference state. \nIt can be visualized using Nielsen's geometric approach, which provides a metric for operators such that C-complexity is given by the geodesic in the space of circuits <cit.>. \nCompared to other definitions of the metric in operator space, such as the trace distance <cit.>, a unique advantage of circuit complexity is that the distance between operators has a clear physical interpretation. \nA longer(shorter) path corresponds to more (less) gates required to evolve from one operator to the other.  \nApplying circuit complexity to non-equilibrium quantum dynamics, it can be understood as the shortest time to reach a desired state and thus allows experimentalists to optimize quantum controls <cit.>.   \n\nWe have found that K-complexity measures the height of the time-dependent operator along a particular direction in the operator space. \nFor instance, in systems with SU(2) symmetry, the metric of all operators involved in quantum dynamics forms a sphere. \nAs shown in Fig. <ref> (A), the initial operator |𝒪(0)) is placed at the south pole.  \nThe length of a trajectory starting from the south pole along a big circle provides us with the circuit complexity. \nProjecting this trajectory to the z-axis, the K-complexity is the height of the final operator measured from the south pole. \nOur results also show that the distance between Krylov basis states is rigorously determined by the circuit complexity. \nHere, the Krylov basis states correspond to strips along latitudes on the sphere. \nSuch a distance turns out to be variable once it becomes easier or more difficult to change the operators in some directions in the operator space. \n\nWe note that the geometric interpretation of K-complexity has recently been studied in an elegant work by Caputa et al <cit.>. \nIt was argued that the K-complexity corresponds to the area of a certain region, using the Fubini-Study metric to define the metric of the operator space <cit.>.\nCompared to such an inner product of operators, the physical meaning of C-complexity used here is more clear in quantum dynamics. \nWe find that it is more appropriate to interpret K-complexity as a length rather than an area. \nFurthermore, our approach applies to time-dependent Liouvillian\nsuperoperators, a largely unexplored problem in the study of K-complexity. \nAs we will show, it requires multiple K-complexity to fully describe the operator growth in the most generic case where Liouvillian\nsuperoperators are time-dependent.\n\nIn the operator space, the Heisenberg equation of motion is recast into a similar form as the Schrödinger equation,\n\n    -i∂_t|𝒪(t))=ℒ̂|𝒪(t)).\n\nwhere the Liouvillian superoperator becomes ℒ̂=Ĥ⊗𝕀̂-𝕀̂⊗Ĥ^T.\nWhen a dynamical symmetry exists, this equation has simple analytical solutions. \nFor instance, when ℒ̂ is written as ℒ̂=B𝒮̂_x,\n\n    𝒮̂_x=∑_n=0^2ℓ-1 b_n|𝒪_n+1)(𝒪_n|+ h.c.\n\nwhere b_n= √((n+1)(2ℓ-n)), 2ℓ is an integer denoting the total number of Krylov basis states, and B is a constant. \nOne can define 𝒮̂^+=∑_n b_n|𝒪_n+1)(𝒪_n| and 𝒮̂^-=∑_n b_n|𝒪_n)(𝒪_n+1|. 𝒦̂_𝒪 and 𝒮̂^± provide three generators of SU(2), as recognized by Caputa et al <cit.>. \n\n    [𝒦̂_𝒪,𝒮̂^±]=±𝒮̂^±,   [𝒮̂^+,𝒮̂^-]=2(𝒦̂_𝒪-ℓ).\n\nThis dynamical symmetry can be easily seen by noting that Eq.(<ref>) corresponds to the spin operator 𝒮̂_x of a total spin-ℓ, 𝒮̂_y=(𝒮̂^+-𝒮̂^-)/(2 i) and 𝒮̂_z=𝒦̂_𝒪-ℓ, and the constant B corresponds to the strength of the magnetic field acting on the spin. Eq.(<ref>) thus can be viewed as the Schrödinger equation for a spin-ℓ subject to a constant magnetic field in the x-direction. Alternatively,  ϕ(t) in Eq.(<ref>) can be regarded as the time-dependent wavefunction in a lattice model where the tunneling amplitude is denoted by b_n.\n\nFor Liouvillians with dynamical symmetry, the propagator \n𝒰̂=𝒯e^i∫ℒ̂dt, where 𝒯 is the time-ordering operator, can be parameterized using the generators of the symmetry group in the same manner as the evolution of a quantum state. For SU(2), \n\n    𝒰̂=e^iψ𝒮̂_ze^iθ𝒮̂_xe^iφ𝒮̂_z.\n\nIt evolves the initial operator |𝒪(0)) to a generalized coherent state |𝒪(t))=𝒰̂|𝒪(0))=|𝒞_θ,φ,ψ) <cit.>. \nEq.(<ref>) allows us to define circuit complexity and its underlying geometry. \n\nIn the most generic case, the Liouvillian superoperator in Eq. <ref> is given by ℒ̂=B_x𝒮̂_x+B_y\n𝒮̂_y+B_z𝒮̂_z. \nThe operator dynamics thus can be viewed as the evolution of a spin-ℓ subject to a magnetic field B⃗(t)=(B_x, B_y, B_z). \nThe circuit complexity denotes the shortest time to reach a target state under the constraint that the strength of the magnetic field is fixed, i.e., |B⃗|=√(B_x^2+B_y^2+B_z^2)≡ B <cit.>. \nThis amounts to fixing the metric of the operator space  <cit.>,\n\n    ds^2=ℓ^2 dt^2(B_x^2+B_y^2+B_z^2).\n\nNoting that d𝒰̂𝒰̂^-1=i ℒ̂ dt, equations (<ref>)\nshows that dθ, dψ and dφ are determined by B⃗. Using Tr(Ŝ_iŜ_j^†)=δ_i,j, B_i=x,y,z can be expressed in terms of ψ, θ, φ, dψ, dθ and dφ.\nIn the content of circuit complexity, it amounts to defining a cost function F^2=ℓ^2 Tr(d𝒰̂𝒰̂^-1(d𝒰̂𝒰̂^-1)^† ) <cit.>.\nSubstituting such expressions to Eq.(<ref>), we obtain the following metric\n\n    ds^2= ℓ^2(dθ^2+dψ^2+dφ^2+2cos(θ)dφ dψ).\n\nThis is the metric of a 3-sphere. \n\nWe note that Eq.(<ref>) can be understood as an expansion of the coherent state using  |𝒪_n), which plays the roles of eigenstates of 𝒮̂_z in the usual spin problem.\nTo be explicit, \n\n    ϕ_n(t)=e^-iℓ (φ+ψ)cos^2ℓ(θ/2)√((2ℓ)!/n!(2ℓ-n)!)μ^n,\n\nwhere μ=itan(θ/2)e^iψ.\nAs such, φ controls the global phase, ψ denotes the relative phase between ϕ_n.\nAnd θ determines the amplitude distribution of |ϕ_n|^2. \nVery often, two operators with the same global phase can be identified as the same one. \nAs such, the state C-complexity is defined as the minimum of C-complexity to the final state with different φ but the same ψ and θ. \nSince Eq. <ref> is a quadratic form of dφ, extremizing Eq. <ref> by setting dφ=-cos(θ)dψ reduces a 3-sphere to a 2-sphere \n\n    ds^2= ℓ^2(dθ^2+sin^2(θ)dψ^2).\n\nEach point on the 2-sphere is equivalent to a coherent state |𝒞'_θ,ψ)≡|𝒞_θ,ψ,0). \nSince the geodesics of a 2-sphere are big circles, the state C-complexity could be visualized as the length of the arc along a big circle connecting the initial and the final operators, or equivalently, the polar angle θ, as shown in Fig. <ref>. \n\nSince |𝒞'_θ,ψ) form an overcomplete basis, we could expand |𝒪_n) using |𝒞'_θ,ψ),\n\n    |𝒪_n)=2ℓ+1/4π∫sin(θ) dθ dψ f_n(θ,ψ)|𝒞'_θ,ψ),\n\nin the same manner as expanding the eigenstates of 𝒮̂_z using spin coherent states, where |f_n(θ,ψ)|^2=|ϕ^*_n|^2_φ=0 is centered around θ_n=arccos(1-n/ℓ). \nThis is precisely the Husimi Q-representation of |𝒪_n)(𝒪_n| using the coherent state of operators <cit.>.\nOn the 2-sphere, |𝒪_0) and |𝒪_2ℓ) are placed at the south and the north poles, respectively.   \nEach other |𝒪_n≠ 0) corresponds to a strip along a latitude with a finite width. \nThe projection of the strip to the z-axis is equally spaced and the height of the strip measured from the south pole linearly increases with n. \nIn other words, each |𝒪_n) can be assigned a unique coordinate on the z-axis, n. \nThis is directly a consequence of the metric tensor in Eq.(<ref>). We conclude that once the metric of the operator space is fixed in the study of C-complexity, the distance between basis states in the Krylov space is uniquely determined. \n\nSince the weight of |𝒪(t)) in |𝒪_n) is given by |ϕ_n(t)|^2, K-complexity defined in Eq.(<ref>) could be viewed as the height of |𝒪(t)) measured from the south pole, in the same manner as the expectation value of 𝒮̂_z of a spin. \nThis is the physical meaning of K-complexity in the geometric representation of C-complexity. For the dynamics generated by ℒ̂=B𝒮̂_x in Eq.(<ref>), the evolution of the operator is equivalent to a spin processing about the x-axis. \nThe state C-complexity, which equals the polar angle θ, grows linearly as a function of time, C=ℓθ(t)=ℓ Bt. \nK-complexity, the height of the final operator is equivalent to the average value of 𝒮̂_z of a spin, C_K=ℓ-ℓcos(B t). \n\nThe same discussions apply to SU(1,1), where b_n in Eq. <ref> is replaced by √((n+1)(2k+n)), and k is the Bargmann index, a counterpart of ℓ in SU(2). \nThe state C-complexity could be visualized using a hyperbolic surface embedded in Minkowski space. \nAs shown in Fig. <ref>(B), each point on the hyperbolic surface is an SU(1,1) coherent state in the operator space,\n\n    |C_θ,ψ')=e^ikψ/cosh^2k(θ/2)∑_n √(Γ(2k+n)/Γ(2k)n!)μ̃^n|𝒪_n)\n\nwhere μ̃=itanh(θ/2)e^iψ.\nC is the length of the arc connecting the initial and final operators on the hyperbolic surface and grows linearly as a function of time, C=kBt. The Krylov basis states again correspond to strips on this surface. \nOn the z-axis, |𝒪_n) are equally spaced, and C_K is the height of the final operator measured from the initial operator placed at the bottom of the hyperbolic surface. \nWhen C-complexity grows linearly, the height of the final operator grows exponentially. \nThis provides a geometric interpretation of the exponentially growing K-complexity,\n\n    C_K(t)= kcosh(B t)-k.\n\n\n\n\n\n\nThe metric of operator space, for instance, the 2-sphere in Eq.(<ref>), depends on ds defined in Eq.(<ref>). \nIn the study of C-complexity, it is known that the metric of the operator space could  change if a different ds is used. \nPhysically, this originates from that it may be easier (or more difficult) to implement certain gates than others <cit.>. \nFor instance, in SU(2), one may choose\n\n    ds^2=ℓ^2 dt^2(B_x^2+B_y^2+λ^2B_z^2).\n\nλ>1 (λ<1)  means that it is more difficult (easier) to implement the gate in the z-direction ℒ̂_z. An alternative understanding is that one seeks the least time to access the target state under a different constraint. \nThe new choice means that √(B_x^2+B_y^2+λ^2B_z^2) other than |B| is fixed. The metric of the operator space becomes \n\n    ds^2=   ℓ^2(dθ^2+dψ^2+dφ^2+2cos(θ)dφ dψ)\n       +ℓ^2(λ^2-1)(cos(θ)dφ+dψ)^2.\n\nWhen λ=1, it reduces to the previous result of a 3-sphere in Eq.(<ref>). \n\nThe state C-complexity is obtained by minimizing the above metric, \n\n    dφ=-λ^2cos(θ)/1+(λ^2-1)cos^2(θ)dψ.\n\nWe obtain \n\n    ds^2= ℓ^2(dθ^2+λ^2sin^2(θ)/1+(λ^2-1)cos^2(θ)dψ^2).\n\nWhen λ=1, Eq.(<ref>) reduces to the previous result of a 2-sphere in Eq.(<ref>). \nWhen λ≠ 1, Eq.(<ref>) describes a deformed sphere, as shown in Fig. <ref>A. \nThe height of a point on the sphere with a polar angle θ measured from the south pole now becomes\n\n    h(θ)=ℓ∫_0^θ√(1-cos^2(θ')/(λ^-2sin^2(θ')+cos^2(θ'))^3)dθ'\n\nWhen λ≠ 1, the Krylov basis states |𝒪_n) are no longer equally spaced. \nC_K(t) in Eq. (<ref>) needs to be modified such that it gives rise to the height of the final operator |𝒪(t)),\n\n    C_K(t)=∑_n h(θ_n) |ϕ_n(t)|^2.\n\nAs a result, the time dependence of C_K changes, as shown in Fig. <ref>B. \n\n\n\n\n\nOur geometric approach also applies to time-dependent Liouvillian superoperators. \nThe simplest case is a quantum quench, where the dynamics is determined by ℒ̂ and ℒ̂' before and after t^*, respectively. \nFor instance, in the case of SU(2),  ℒ̂=B𝒮̂_x (ℒ̂'=B𝒮̂_z) when  t<t^* (t>t^*). \nThe trajectory on the 2-sphere is no longer along the longitude but the latitude when t>t^*. \nFor simplicity, we consider only undeformed spheres. \nThe generalization to λ≠ 1 is straightforward. \nThough the operator 𝒪(t) is still evolving, C_K remains a constant and thus cannot capture the quantum dynamics when t>t^*. \nThis can be simply seen from the definition of C_K in Eq.(<ref>), in which only the amplitude of ϕ_n is included. \nNevertheless, the relative phase between ϕ_n must be included, since the full dynamics happens on a 2-sphere and the polar angle ψ of this 2-sphere is precisely the relative phase between ϕ_n. \nState C-complexity C that fully exploits the metric of a 2-sphere can naturally capture the dynamics under an arbitrary time-dependent Liouvillian superoperator. \nFor instance, the shortest path connecting the initial and final operators in this quench dynamics is along another longitude, as shown in Fig. <ref>A. \nApparently, this path can be accessed using another time-independent Liouvillian superoperator ℒ̂”=B𝒮̂_y.\n\nSince a single K-complexity is no longer sufficient when the Liouvillian superoperator is time-dependent, multiple K-complexity may be used. \nIn SU(2), we can define another set of Krylov basis states,\n\n    |𝒪'_n)=e^-iπ𝒮̂_y/2 |𝒪_n),\n\nwhich play the same role as eigenstates of 𝒮̂_x in a spin problem. \nOn the 2-sphere, |𝒪'_n) corresponds to another set of strips, as shown in Fig. <ref>A. \nCorrespondingly, |𝒪(t)) may be expanded using  |𝒪'_n) as |𝒪(t))=∑_nϕ'_n(t)|𝒪'_n), and another K-complexity is defined C_K'=∑_n n|ϕ'_n|^2.\nAs shown in Fig.<ref>B, when t<t^*, C_K increases with increasing t while C_K' remains unchanged. \nAfter t>t^*, whereas C_K stops growing, C_K' begins to change. \nAs such, at any time t, C_K and C_K' could jointly determine |𝒪(t)) on the 2-sphere, in the same manner as uniquely determining a spin on the Bloch sphere using the expectation values of both Ŝ_z and Ŝ_x in spin tomography <cit.>. \nSimilar results can be straightforwardly obtained for SU(1,1). \n\n\n\n\n\n\nIn conclusion, we have shown that K-complexity can be rigorously established from C-complexity in the presence of dynamical symmetry. \nOur method provides a clear geometrical picture and physical meaning of K-complexity. \nOur results can be generalized to other symmetry groups, which are expected to bring even richer physics bridging geometry and quantum information spreading in non-equilibrium dynamics.  \n\nQ.Z. acknowledges useful discussions with Pawel Caputa.\nThis work is supported by DOE DE-SC0019202, and the U.S. Department of Energy, Office of Science through the Quantum Science Center (QSC), a National Quantum Information Science Research Center. \nRZ is supported by NSFC (Grant No.12074307) and National Key R&D Program of China (Grant No. 2018YFA0307601).\n\n\n\n\n\n\n\n\n\n\n\n\n41\n    fxundefined [1]\n     ifx#1\n    \n    fnum [1]\n     #1firstoftwo\n     secondoftwo\n     \n    fx [1]\n     #1firstoftwo\n     secondoftwo\n     \n    \n    \n    \n    \n    \n    noop [0]secondoftwo\n    \n    ref[1]@startlink#1@href\n    href[1]#1@endlink\n    anitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\n    startlink[1]\n    endlink[0]\n    \n    rl [1]href #1\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    @bib@innerbibempty\n    \n    [Polkovnikov et al.(2011)Polkovnikov, Sengupta, Silva, and      Vengalattore]Nonequilibrium2011\n      author author A. Polkovnikov, author K. Sengupta, author A. Silva,       and author M. Vengalattore,      title title Colloquium: Nonequilibrium dynamics of\n      closed interacting quantum systems, /10.1103/RevModPhys.83.863 journal journal Rev. Mod. Phys. volume 83, pages 863 (year 2011)NoStop\n    [Altman(2015)]Altman2015\n      author author E. Altman, title title Non equilibrium quantum\n      dynamics in ultra-cold quantum gases, @noop  journal\n      journal arXiv preprint arXiv:1512.00870  (year\n      2015)NoStop\n    [Heyl et al.(2013)Heyl,\n      Polkovnikov, and Kehrein]Heyl2013\n      author author M. Heyl, author A. Polkovnikov,       and author S. Kehrein,      title title Dynamical quantum phase transitions in\n      the transverse-field Ising model, /10.1103/PhysRevLett.110.135704 journal journal Phys. Rev. Lett. volume 110, pages 135704 (year 2013)NoStop\n    [Heyl(2018)]Heyl2018\n      author author M. Heyl, title title Dynamical quantum phase\n      transitions: a review, /10.1088/1361-6633/aaaf9a\n      journal journal Reports on Progress in Physics      volume 81, pages 054001 (year 2018)NoStop\n      [Maldacena(1999)]Maldacena1999\n      author author J. Maldacena, title title The large-N limit of\n      superconformal field theories and supergravity, /10.1023/A:1026654312961 journal journal\n      International Journal of Theoretical Physics volume\n      38, pages 1113 (year 1999)NoStop\n    [D'Alessio et al.(2016)D'Alessio, Kafri, Polkovnikov, and Rigol]DAlessio2016\n      author author L. D'Alessio, author Y. Kafri, author A. Polkovnikov,  and author M. Rigol, title title From\n      quantum chaos and eigenstate thermalization to statistical mechanics and\n      thermodynamics, /10.1080/00018732.2016.1198134 journal journal Advances in Physics volume 65, pages 239 (year 2016)NoStop\n    [Maldacena et al.(2016)Maldacena, Shenker, and Stanford]Maldacena2016\n      author author J. Maldacena, author S. H. Shenker,  and author D. Stanford, title title A bound on chaos,      /10.1007/jhep08(2016)106 journal journal Journal of High Energy Physics volume\n      2016 (year 2016), 10.1007/jhep08(2016)106NoStop\n    [Hartnoll et al.(2018)Hartnoll, Lucas, and Sachdev]Hartnoll2018\n      author author S. A. Hartnoll, author A. Lucas,       and author S. Sachdev,      @noop  title Holographic quantum matter      (publisher MIT press, year 2018)NoStop\n    [Sekino and Susskind(2008)]Sekino2008\n      author author Y. Sekino and author L. Susskind, title title Fast scramblers,      /10.1088/1126-6708/2008/10/065 journal\n      journal Journal of High Energy Physics volume 2008, pages 065 (year\n      2008)NoStop\n    [Lashkari et al.(2013)Lashkari, Stanford, Hastings, Osborne, and Hayden]Lashkari2013\n      author author N. Lashkari, author D. Stanford,\n      author M. Hastings, author T. Osborne,  and author P. Hayden, title\n      title Towards the fast scrambling conjecture, /10.1007/jhep04(2013)022 journal journal\n      Journal of High Energy Physics volume 2013\n      (year 2013), 10.1007/jhep04(2013)022NoStop\n    [Shenker and Stanford(2014)]Shenker2014\n      author author S. H. Shenker and author D. Stanford, title title Black holes and the\n      butterfly effect, /10.1007/jhep03(2014)067 journal journal Journal of High Energy Physics volume 2014 (year 2014),      10.1007/jhep03(2014)067NoStop\n    [Swingle(2018)]Swingle2018\n      author author B. Swingle, title title Unscrambling the physics\n      of out-of-time-order correlators, /10.1038/s41567-018-0295-5 journal journal Nature Physics volume 14, pages 988 (year 2018)NoStop\n    [Roberts et al.(2018)Roberts, Stanford, and Streicher]Roberts2018\n      author author D. A. Roberts, author D. Stanford,       and author A. Streicher,      title title Operator growth in the SYK model,      /10.1007/jhep06(2018)122 journal journal Journal of High Energy Physics volume\n      2018 (year 2018), 10.1007/jhep06(2018)122NoStop\n    [Magán(2018)]Magn2018\n      author author J. M. Magán, title title Black holes,\n      complexity and quantum chaos, /10.1007/jhep09(2018)043\n      journal journal Journal of High Energy Physics      volume 2018 (year 2018),      10.1007/jhep09(2018)043NoStop\n    [Qi and Streicher(2019)]Qi2019\n      author author X.-L. Qi and author A. Streicher,      title title Quantum epidemiology: operator growth,\n      thermal effects, and SYK, /10.1007/jhep08(2019)012\n      journal journal Journal of High Energy Physics      volume 2019 (year 2019),      10.1007/jhep08(2019)012NoStop\n    [Yan et al.(2020)Yan,\n      Cincio, and Zurek]Zurek2020\n      author author B. Yan, author L. Cincio,  and      author W. H. Zurek, title title Information scrambling and Loschmidt echo,      /10.1103/PhysRevLett.124.160603 journal\n      journal Phys. Rev. Lett. volume 124,      pages 160603 (year 2020)NoStop\n    [Ali et al.(2020)Ali,\n      Bhattacharyya, Haque, Kim,\n      Moynihan, and Murugan]ChaosComplexity2020\n      author author T. Ali, author A. Bhattacharyya,\n      author S. S. Haque, author E. H. Kim, author\n      N. Moynihan,  and author\n      J. Murugan, title title Chaos and complexity in quantum mechanics, /10.1103/PhysRevD.101.026021 journal journal Phys. Rev. D volume 101, pages 026021 (year 2020)NoStop\n    [Magán and Simón(2020)]Magn2020\n      author author J. M. Magán and author J. Simón, title title On operator growth\n      and emergent Poincaré symmetries, /10.1007/jhep05(2020)071 journal journal\n      Journal of High Energy Physics volume 2020\n      (year 2020), 10.1007/jhep05(2020)071NoStop\n    [Parker et al.(2019)Parker,\n      Cao, Avdoshkin, Scaffidi,      and Altman]Altman2019\n      author author D. E. Parker, author X. Cao,\n      author A. Avdoshkin, author T. Scaffidi,  and author E. Altman, title\n      title A universal operator growth hypothesis, /10.1103/PhysRevX.9.041017 journal journal Phys. Rev. X volume 9, pages\n      041017 (year 2019)NoStop\n    [Dymarsky and Smolkin(2021)]Dymarsky2021\n      author author A. Dymarsky and author M. Smolkin, title title Krylov complexity in\n      conformal field theory, /10.1103/PhysRevD.104.L081702\n      journal journal Phys. Rev. D volume 104, pages L081702 (year\n      2021)NoStop\n    [Rabinovici et al.(2021)Rabinovici, Sánchez-Garrido, Shir,      and Sonner]Rabinovici2021\n      author author E. Rabinovici, author A. Sánchez-Garrido, author R. Shir,  and author J. Sonner, title title Operator complexity: a\n      journey to the edge of Krylov space, /10.1007/jhep06(2021)062 journal journal\n      Journal of High Energy Physics volume 2021\n      (year 2021), 10.1007/jhep06(2021)062NoStop\n    [Bhattacharjee et al.(2022)Bhattacharjee, Cao, Nandy, and      Pathak]Bhattacharjee2022\n      author author B. Bhattacharjee, author X. Cao,\n      author P. Nandy,  and author T. Pathak, title\n      title Krylov complexity in saddle-dominated scrambling, /10.1007/jhep05(2022)174 journal journal\n      Journal of High Energy Physics volume 2022\n      (year 2022), 10.1007/jhep05(2022)174NoStop\n    [Caputa et al.(2022)Caputa,\n      Magan, and Patramanis]Caputa2022\n      author author P. Caputa, author J. M. Magan,       and author D. Patramanis,      title title Geometry of Krylov complexity,      /10.1103/PhysRevResearch.4.013041 journal journal \n      Physical Review Research volume 4, pages 013041\n      (year 2022)NoStop\n      [Rabinovici et al.(2022)Rabinovici, Sánchez-Garrido, Shir,      and Sonner]Rabinovici2022\n      author author E. Rabinovici, author A. Sánchez-Garrido, author R. Shir,  and author J. Sonner, title title Krylov complexity from\n      integrability to chaos, /10.1007/jhep07(2022)151\n      journal journal Journal of High Energy Physics      volume 2022 (year 2022),      10.1007/jhep07(2022)151NoStop\n    [Liu et al.(2022)Liu,\n      Tang, and Zhai]Zhai2022\n      author author C. Liu, author H. Tang,  and      author H. Zhai, title title Krylov complexity in open quantum systems,      @noop  journal journal arXiv preprint\n      arXiv:2207.13603  (year 2022)NoStop\n    [Balasubramanian et al.(2022)Balasubramanian, Caputa, Magan, and      Wu]Vijay2022\n      author author V. Balasubramanian, author P. Caputa, author J. M. Magan,       and author Q. Wu, title title Quantum chaos and the complexity of spread of\n      states, /10.1103/PhysRevD.106.046007 journal\n      journal Phys. Rev. D volume 106,      pages 046007 (year 2022)NoStop\n    [Lanczos(1950)]Lanczos1950\n      author author C. Lanczos, title title An iteration method for\n      the solution of the eigenvalue problem of linear differential and integral\n      operators, /10.6028/jres.045.026 journal\n      journal Journal of Research of the National Bureau of\n      Standards volume 45, pages 255\n      (year 1950)NoStop\n    [Nielsen et al.(2006)Nielsen, Dowling, Gu, and Doherty]Nielsen2006\n      author author M. A. Nielsen, author M. R. Dowling, author M. Gu,  and      author A. C. Doherty,      title title Quantum computation as geometry,      /10.1126/science.1121541 journal journal Science volume 311, pages\n      1133 (year 2006)NoStop\n    [Jefferson and Myers(2017)]Jefferson2017\n      author author R. A. Jefferson and author R. C. Myers, title title Circuit complexity in\n      quantum field theory, /10.1007/jhep10(2017)107 journal journal Journal of High Energy Physics volume 2017 (year 2017),      10.1007/jhep10(2017)107NoStop\n    [Chapman et al.(2018)Chapman, Heller, Marrochio, and      Pastawski]Chapman2018\n      author author S. Chapman, author M. P. Heller,\n      author H. Marrochio,  and      author F. Pastawski, title title Toward a definition of complexity for quantum\n      field theory states, /10.1103/PhysRevLett.120.121602\n      journal journal Phys. Rev. Lett. volume 120, pages 121602 (year\n      2018)NoStop\n    [Guo et al.(2018)Guo,\n      Hernandez, Myers, and Ruan]Guo2018\n      author author M. Guo, author J. Hernandez,\n      author R. C. Myers,  and      author S.-M. Ruan, title title Circuit complexity for coherent states, /10.1007/jhep10(2018)011 journal journal\n      Journal of High Energy Physics volume 2018\n      (year 2018), 10.1007/jhep10(2018)011NoStop\n    [Chapman et al.(2019)Chapman, Eisert, Hackl, Heller, Jefferson, Marrochio, and      Myers]Chapman2019\n      author author S. Chapman, author J. Eisert,\n      author L. Hackl, author M. P. Heller, author\n      R. Jefferson, author\n      H. Marrochio,  and author\n      R. C. Myers, title title Complexity and entanglement for thermofield double states, /10.21468/scipostphys.6.3.034 journal journal SciPost Physics volume 6 (year 2019), 10.21468/scipostphys.6.3.034NoStop\n    [Brown and Susskind(2019)]Susskind2019\n      author author A. R. Brown and author L. Susskind, title title Complexity geometry of a\n      single qubit, /10.1103/PhysRevD.100.046020 journal journal Phys. Rev. D volume\n      100, pages 046020 (year 2019)NoStop\n    [Wilde(2013)]Wilde2013\n      author author M. M. Wilde, @noop  title Quantum information\n      theory (publisher Cambridge University Press, year 2013)NoStop\n    [Lv and Zhou(2022)]Zhou2022\n      author author C. Lv and author Q. Zhou,      title title Emergent spacetimes from Hermitian and\n      non-Hermitian quantum dynamics, @noop  journal\n      journal arXiv preprint arXiv:2205.07429  (year\n      2022)NoStop\n    [Kolodrubetz et al.(2017)Kolodrubetz, Sels, Mehta, and      Polkovnikov]QuantumMetric2017\n      author author M. Kolodrubetz, author D. Sels,\n      author P. Mehta,  and author A. Polkovnikov, title title Geometry and non-adiabatic response in quantum and\n      classical systems, /10.1016/j.physrep.2017.07.001\n      journal journal Physics Reports volume 697, pages 1 (year\n      2017)NoStop\n    [Tan et al.(2019)Tan,\n      Zhang, Yang, Chu,\n      Zhu, Li, Yang, Song, Han, Li, Dong,\n      Yu, Yan, Zhu, and      Yu]QuantumMetric2019\n      author author X. Tan, author D.-W. Zhang,\n      author Z. Yang, author\n      J. Chu, author Y.-Q. Zhu, author D. Li, author X. Yang, author S. Song, author Z. Han, author\n      Z. Li, author Y. Dong, author H.-F.      Yu, author H. Yan, author S.-L. Zhu,  and      author Y. Yu, title title Experimental measurement of the quantum metric\n      tensor and related topological phase transition with a superconducting\n      qubit, /10.1103/PhysRevLett.122.210401 journal journal Phys. Rev. Lett. volume 122, pages 210401 (year\n      2019)NoStop\n    [Gianfrate et al.(2020)Gianfrate, Bleu, Dominici, Ardizzone, Giorgi, Ballarini, Lerario, West, Pfeiffer, Solnyshkov, Sanvitto, and Malpuech]QuantumMetric2020\n      author author A. Gianfrate, author O. Bleu,\n      author L. Dominici, author V. Ardizzone, author\n      M. D. Giorgi, author\n      D. Ballarini, author\n      G. Lerario, author K. W. West, author L. N.      Pfeiffer, author D. D.      Solnyshkov, author D. Sanvitto,  and author G. Malpuech, title title\n      Measurement of the quantum geometric tensor and of the anomalous Hall\n      drift, /10.1038/s41586-020-1989-2 journal\n      journal Nature volume 578, pages 381 (year 2020)NoStop\n      [Zhang et al.(1990)Zhang,\n        Feng, and Gilmore]Gilmore1990\n        author author W.-M. Zhang, author D. H. Feng,         and author R. Gilmore,        title title Coherent states: Theory and some\n        applications, /10.1103/RevModPhys.62.867 journal journal Rev. Mod. Phys. volume\n        62, pages 867 (year 1990)NoStop\n    [Bengtsson and Życzkowski(2017)]Bengtsson2017\n      author author I. Bengtsson and author K. Życzkowski, @noop  title Geometry of\n      quantum states: an introduction to quantum entanglement (publisher Cambridge university press, year\n      2017)NoStop\n    [Gale et al.(1968)Gale,\n      Guth, and Trammell]tomography2\n      author author W. Gale, author E. Guth,  and      author G. T. Trammell,      title title Determination of the quantum state by\n      measurements, /10.1103/PhysRev.165.1434 journal journal Phys. Rev. volume\n      165, pages 1434 (year 1968)NoStop\n    \n    \n\n"}