{"entry_id": "http://arxiv.org/abs/2303.06913v1", "published": "20230313082404", "title": "Dynamical Bose-Hubbard model for entanglement generation and storing", "authors": ["Maciej Kościelski"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.quant-gas"], "text": "\n\n\tEffects of Nb Doping on the Charge-Density Wave and Electronic Correlations in the Kagome Metal Cs(V_1-xNb_x)_3Sb_5\n    Hai-Hu Wen\n    March 30, 2023\n===================================================================================================================\n\n\n\n\t \n\n\t\tThis work presents a theoretical study of a protocol for dynamical generation and storage of the durable, highly entangled Greenberger-Horne-Zeilinger (GHZ) state in a system composed of bosonic atoms loaded into a one-dimensional optical lattice potential. A method of indicating entanglement in the system is also presented.\n\t\t\n\t\tThe system ground-state can be either in the superfluid phase or in the Mott insulator phase. The wave functions of atoms in the superfluid phase are delocalised over the whole lattice and overlap. In the Mott phase, the wave functions are localised around lattice sites. The GHZ state is being generated in the superfluid phase and stored in the Mott insulator phase. It is achieved by a linear change of the potential depth in an optical lattice filled with atoms of two species. The numerical method used to describe the system is based on the exact diagonalisation of the Bose-Hubbard Hamiltonian. A quantum correlator indicating the level of multi-mode entanglement is introduced. Finally, it is shown that the value of the correlator indicates generation of the GHZ state. The appearance of the GHZ state is confirmed by the numerical representation of the state.\n\n\t\t\n\n\t\t\n\t\t\n\n\t\t\tStreszczenie\n\t\t\n\n\n\t\tNiniejsza praca przedstawia teoretyczną analizę protokołu do wytwarzania i przechowywania trwałego, maksymalnie splątanego stanu Greenbergera-Horne'a-Zeilingera (GHZ) w układzie złożonym z bozonów w jednowymiarowej sieci optycznej. Przedstawiona jest również metoda wykrywania splątania w układzie.\n\n\t\tStan podstawowy układu może występować w fazie nadciekłej albo w fazie izolatora Motta. W przypadku fazy nadciekłej funkcje falowe opisujące atomy są zdelokalizowane w ramach całej sieci i mogą się przekrywać. W fazie Motta funkcje falowe są zlokalizowane wokół oczek sieci. Stan GHZ jest wytwarzany w fazie nadciekłej, a przechowywany w fazie izolatora Motta. Jest to osiągnięte poprzez liniową zmianę głębokości potencjału pułapkującego sieci optycznej wypełnionej bozonowymi cząstkami dwóch rodzajów. Użyta metoda numeryczna opiera się na ścisłej diagonalizacji hamiltonianu Bosego-Hubbarda. Wprowadzony zostaje korelator kwantowy służący do pomiaru poziomu splątania. Wartość korelatora wskazuje na występowanie stanu GHZ. Jego wytworzenie potwierdza również analiza numerycznej reprezentacji uzyskanego stanu.\n\n\t\n\n\n\t\n\n§ ACKNOWLEDGEMENTS\n\n    empty\n\n    I would like to express my gratitude to the people who have supported me throughout my academic endeavours.\n    \n    My supervisors: dr hab. Emilia Witkowska, prof. IP PAS and dr hab. Jan Chwedeńczuk – thank you for the initial idea of this work, the valuable suggestions on the thesis, and everything I have learnt from you.\n    \n    Everyone who gave me a consultation on writing and proofreading in English – thank you for your scrupulosity and patience.\n    \n    I would also like to extend my sincere thanks to everyone who has supported me emotionally during the writing of the thesis.\n\n    \n\n\n\tempty\n\t\n\tarabic \n\t\n\t\n\t\n\t\n\nCHAPTER: MOTIVATION AND RELATION TO OTHER WORK\n\n\t\n\t\t\n\tThe aim of this work is to present a method for generating and storing an entangled state in a system composed of ultracold atoms loaded into an optical lattice. The considered system and protocol can be realised experimentally with nowadays techniques <cit.>. The method can be exploit for experimental generation of entanglement in the many-body system. It can also be used as a framework for theoretical studies of multi-mode entanglement.\n\t\n\tThe main concept underlying this work is entanglement <cit.>. Discussion of this phenomenon starts with the groundbreaking paper by Albert Einstein, Boris Podolsky and Nathan Rosen from 1935 <cit.>. In that paper, the authors showed that in quantum theory a measurement conducted on one particle can give a certain information about the result of some measurement on another particle. They proven that this is independent of the interval separating the particles, what implies a non-local correlation between observables. In the same year, another paper was published by Erwin Schrödinger where entanglement has been discussed as a general phenomenon of quantum theory <cit.>.\n\n\tThe phenomenon of entanglement can be understood in the following way: A group of quantum-mechanical objects are in entangled state if one can not describe behaviour of each of them separately, but rather has to consider the state of the whole system in order not to lose any information about the behaviour of its parts. Entanglement has already been proven to be of great importance in many areas like quantum information <cit.>, quantum cryptography <cit.> and other branches of quantum theory. Another important field that exploits entanglement is quantum metrology, the idea of which is to perform precise measurements of physical quantities, for example in quantum interferometry <cit.>.\n\tEntanglement is a distinctive feature of quantum theory. It gives plenty of possibilities to experimentally test the advantage of quantum theory over the classical theory in describing physical phenomena <cit.>.\n\tThe entangled states can be produced using many techniques: in quantum optics (with photons <cit.>), solid state physics <cit.> or cold matter physics (using ions or neutral gases of ultracold atoms <cit.>).\n\n\tOne of the most extensively exploited entangled states is the Greenberger-Horne-Zeilinger (GHZ) state, which is the maximally entangled state. It was first proposed in <cit.> to test the fundamental issue of non-locality in quantum theory. For a system of M qubits (each qubit from orthonormal basis {|0⟩, |1⟩}) the GHZ state is defined as\n\t\n    |GHZ⟩ := |0⟩^⊗ M+|1⟩^⊗ M/√(2).\n\n\tThis state has been found useful in quantum information theory <cit.>. As a superposition of two macroscopic states it is fragile to decoherence, and thus, difficult to be produced in laboratory, in particular for a large number of qubits. The first successful attempt to produce it was made in 1999 with use of three photons <cit.>. The state-of-the-art experiments achieve a GHZ state composed of up to 27 qubits <cit.>. This work, following <cit.>, proposes a protocol allowing to create the GHZ state using an arbitrary number of bosonic atoms in optical lattice.\n\t\n\tThis work focuses on a system composed of bosonic atoms loaded into an optical lattice potential. The ultracold regime is considered so that the Bose-Hubbard model can be used as an approximation giving sufficient description of the system <cit.>. The system can be observed in two distinct thermodynamic phases <cit.> – the superfluid phase characterised by the presence of Bose-Einstein condensate <cit.> and the Mott insulator phase characterised by the fact that all particles are well-localised at the lattice sites.\n\t\n\tThis thesis is motivated by the results of two papers <cit.>. In <cit.> the authors propose a protocol for generation and storage spin-squeezed states in the Mott phase. Additionally, they show that the protocol allows one to generate the GHZ state and store it in the optical lattice. The idea of this thesis is to characterise and prove that indeed the highly entangled state can be generated and stored in the Mott insulator phase using the above method. To quantify the level of entanglement in this thesis a generalised notion of the correlator defined in <cit.> is used. The generalisation bases on the theorems [the:Theorem1] and [the:MaxC], which are proved in appendices. The value of the correlator is bounded from above for separable (non-entangled) states. Breaking the bound proves that the state is entangled <cit.>.\n\t\n\tIt was also shown that the correlator quantifies the level of entanglement in the system <cit.>.\n\t\n\t\n\t\n\t\n\nCHAPTER: DESCRIPTION OF THE PROBLEM\n \n\t\n\t\n\n\tIn quantum statistical physics, there are two classes of particles – fermions and bosons. Fermionic particles ([fermions]) are characterised by the property that any wave function describing a set of them is anti-symmetric due to exchange of the particles. This leads to an important fact that only one fermion can occupy a state described by specific quantum number. The other type of particles – [bosons] – is characterised by the symmetry of the wave function due to exchange of particles. This gives a possibility of arbitrary many bosons taking the exact same quantum state.\n\n\tThis work examines bosonic particles at ultra-low temperatures of the order of hundreds of nanokelvins. A gas composed of bosons at such low temperatures exhibits a phase transition to the so-called Bose-Einstein condensate. This phenomenon was theoretically predicted in 1924 by Satyendra Nath Bose <cit.> and Albert Einstein <cit.>. It was experimentally realised for the first time in 1995 by Eric Cornell, Carl Wieman et al. <cit.> and, independently, in the same year by Wolfgang Ketterle et al. <cit.>. In 2001, the experiments were honoured with the Nobel prize in physics <cit.>.\n\t\n\tIn a bosonic gas below the critical temperature T_c (usually T_c ∼ 100 nK for atoms) a macroscopic number of particles tends to occupy the lowest energy state. The macroscopic quantum state composed of the bosons occupying the ground state is called the [Bose-Einstein condensate] (BEC). The amount of BEC in a gas can be expressed by a notion of the [condensate fraction]\n\t\n    f_c := ⟨n_0|⟩/N,\n\n\twhere ⟨n_0|$⟩ is the average number of particles in the lowest energy state, andNis the total number of particles in the gas. A gas withf_c≈1is called pure condensate.\n\n\tAll the particles forming BEC are indistinguishable. It allows to apply a quantum operation to a large set of particles simultaneously. For this reason, using cold gases, one has more potentiality in manipulating many-body quantum systems than using solid states. Thanks to those properties, a whole branch of research projects exploiting BEC has emerged. They include investigations of interference of two condensates <cit.>, applications of BEC in quantum metrology <cit.>, producing solitons <cit.>, Feshbach resonances <cit.> and squeezed or entangled states <cit.> in Bose-Einstein condensate. Experiments on the generation of BEC are being conducted all over the world including KL FAMO laboratory in Toruń <cit.> and even in space <cit.>.\n\n\tThis research investigates an ultracold gas of bosonic atoms, which may exhibit a Bose-Einstein condensation. It will be referred to when discussing the condensate fraction in the further sections. It is, however, worth mentioning that BEC is not the key aspect of the study. This work examines bosonic atoms loaded into an optical lattice, which might have properties of BEC in some regime of parameters what will be discussed in Section [sec:phaseDiagram]. In other ranges of parameters, the system is in the Mott insulator phase. \n\tIn the end it is worth noting that this study investigates a finite number of particles; thus, referring to thermodynamic phenomena such as BEC cannot be considered in a strict sense.\n\n\n\t\n\n§ OPTICAL LATTICE\n\n\n\tThe protocol proposed in this thesis relies on optical lattice – a device, which, using lasers, creates an effective periodic trapping potential for ultracold atoms.\n\n\tAn optical lattice is made of counter-propagating laser beams. To keep the atoms in the optical lattice potential, they are first cooled down to ultra-low temperatures of the order of hundreds of nanokelvins using various methods of cooling and trapping <cit.>. The whole setup is closed in a vacuum chamber to isolate the system from the environment to avoid undesirable effects, e.g. scattering with other particles. The atomic gas is also very dilute to prevent many-body scattering events. Those events would lead to emergence of molecules, which would not be trapped by the optical lattice leading to vaporisation of the atoms in a short time.\n\n    \n\n §.§ Potential of the lattice\n\n\n    \tThe counter-propagating laser beams are tuned in such a way that the electro-magnetic field forms a standing wave. Following <cit.>, in the one-dimensional case, the electric field 𝐄 of the standing wave can be written as\n    \t\n    𝐄(x,t) = ê_⊥Ẽ(x) sin(ω_L t) := ê_⊥ E_0 sin(k_L x)sin(ω_L t),\n\n    \twith ê_⊥– the unit [polarisation vector] perpendicular to the x-axis, Ẽ(x)–[field amplitude] in each point x of space, E_0– amplitude of the electro-magnetic field, k_L=2 πλ_L[wavevector] of the monochromatic light of [wavelength] λ_L, ω_L=2 π cλ_L–[angular frequency] of the light and t– time.\n    \t\n    \tIf a neutral atom is surrounded by such a field it induces an atomic dipole moment 𝐩:\n    \t\n    𝐩(x,t) = ê_⊥αẼ(x) sin(ω_L t),\n\n    \twhere α being called [complex polarisability] is dependent on the frequency ω_L of the light <cit.>. Interaction of the atom with the field creates [dipole potential] V:\n    \t\n    V(x) = - 1/2∫_0^2 π/ω_L𝐩·𝐄 dt = - Re(α) | Ẽ|^2 =\n\n    = - Re(α) E_0^2 sin^2(2 π/λ_L x),\n\n    \twhere integral denotes time-averaging over one period of the optical wave <cit.>.\n    \t\n    \tIt is apparent that two counter-propagating laser beams of wavelength λ_L can create a potential with [spatial period] d:=λ_L2 for a neutral atom. This periodic structure of the potential with ability to trap atoms is called [optical lattice]. The following Figure <ref> presents a sketch of the one-dimensional optical lattice. The red arrows illustrate laser beams while the sinusoidal line the potential created by the standing electro-magnetic wave.\n    \t\n\n\tWhat is highly useful is that one can precisely control parameters of the lattice such as geometry of the lattice and its depth during the experiment by changing the frequency of the laser beams, their intensity and the angle between them. Using two counter-propagating laser beams one gets one-dimensional periodic structure of the lattice potential. One can create two- or three-dimensional structures with four or six laser beams (see Figure <ref>). The elementary cell of the lattice is cubic when the laser beams are perpendicular. A system of triclinic symmetry can be also created when changing the angles between the laser beams. In the whole lattice there are thousands of atoms, usually few per one site. However, one can very precisely control the number of atoms in each site. The opportunity of changing so many parameters makes optical lattices a basic element of many experiments like the most precise device available to humans – the optical lattice clock <cit.>.\n\n    \n\n §.§ Parameters of the lattice\n\n\n\tThis work models bosonic atoms loaded into the one-dimensional optical lattice potential\n\t\n    V(x) = - Re(α) E_0^2 sin^2 ( 2 π/λ_L x ) =: V_0 sin^2 (  k_L  x ),\n\n\twhereV_0:=- Re(α) E_0^2is called [lattice depth] or [lattice height],k_L = 2π/λ_Lis the wave number of trapping light, andd=λ_L/2is the spatial [period of the lattice]. For typically used lasers,λ_L≈800nm.\n\n\tUsingk_Land massmof a single atom, one can introduce a natural energy scale,\n\t\n    E_R := k_L^2 ħ^2/2 m =  h^2/2 m λ_L^2.\n\n\tIn further sections the [recoil energy]E_Ris used as the energy unit. This value is typically close to2.4 ·10^-30 J.\n\n\tIn the numerical calculations, dimensionless variables like\n\t\n    Ṽ_0 := V_0/E_R\n\n\tare used. The value ofṼ_0in this study is usually in the rangeṼ_0∈[3, 45].\n\n\tThis thesis examinesN=6atoms onM=6lattice sites, it also assumes periodic boundary conditions. The system can be thus modelled using the Bose-Hubbard model <cit.> introduced in the next paragraph.\n\t\n\n\t\n\n§ THE BOSE-HUBBARD MODEL\n\n\t\n\tThe dynamics of the optical lattice filled with bosons can be approximately described by the so-called [Bose-Hubbard model] <cit.>. The approximation assumes that the particles are localised near the lattice sites, the tunnelling of the particles between the lattice sites can only occur between the nearest-neighbour sites and that the only possible states are those in the lowest energy band.\n\n\tIn this work an ultracold gas composed of a few bosonic atoms with repulsive interaction in two internal statesAandB, loaded into a three-dimensional potential of an optical lattice is considered. It is assumed that tunnelling is only possible along thexdirection while transversely the atoms are described by a localised wave function that can be approximated by a Gaussian function with a characteristic lengthL_⊥. The optical lattice potential in thex-direction isV(x)(<ref>). In the absence of the lattice, the system is homogeneous and the atoms are confined in a [flat-bottom potential] <cit.>. After reduction of the perpendicular directions, the effective one-dimensional system Hamiltonian reads\n\t\n    ℋ̂   =   ∑_σ=A,B∫ dx (\n    \t\tΨ̂_σ^†(x) ĥΨ̂_σ(x) + \n    \t\tg_σσ/2Ψ̂_σ^2†(x) Ψ̂_σ^2(x) ) \n       +    g_AB∫ dx  Ψ̂_A^†(x)Ψ̂_B^†(x)Ψ̂_B(x)Ψ̂_A(x)\n\n\twith the single-particle Hamiltonian\n\t\n    ĥ = -ħ^2/2 md^2/dx^2 + V(x)\n\n\tandΨ̂_σ(x)– the field operator annihilating a boson in stateσat positionx. The interaction coefficientsg_σσ'=g^3D_σσ'/(2 πL_⊥^2)are determined by the transverse confinement lengthL_⊥and by the coupling constants in three dimensionsg^3D_σσ'=4πħ^2 a_σσ'/m, wherea_σσ'is thes-wave scattering length for one atom in the stateσand the other one inσ',mis the atomic mass andħis the Planck constant. This study assumes repulsive interaction between atoms in the two states, withA ↔Bsymmetry leading tog_AA = g_BB, and an adjustable inter-species couplingg_AB, restricting to the phase-mixing regime:g_AB<g_AA<cit.>.\n\n\tThe motion of a particle in a periodic potential formed by an optical lattice can be conveniently described by the band theory, and the system Hamiltonian (<ref>) can be considered in the basis of Bloch functionsψ_l,q(x, t)<cit.>. These are eigenfunctions of the single-particle Hamiltonian (<ref>) and posses required translational properties. The Bloch functions can be constructed numerically in the plane wave basis as described in <cit.>. As the next step, the Hamiltonian is rewritten in the basis of Wannier functionsw(x-x_i,t)localised around lattice sites, wherex_idenotes position of theisite, in the lowest energy band. The Wannier functions can be conveniently constructed from the Bloch statesψ_l=1,q(x,t)in the following way\n\t\t\n    w(x-x_i,t) = ( d/2 π) ^1/2∫_q ∈ 1BZ dq   e^-i q x_i ψ_l=1,q(x,t).\n\n\t\tSummation in Equation (<ref>) extends over wave vectors belonging to the 1st[Brillouin zone] (1BZ),-k_L< q ≤k_L. The two-component Hamiltonian is then\n\t\t\n    ℋ̂   = -∑_i, j J(i-j) (â_i^†â_j + b̂_i^†b̂_j) \n    \n    \t\t+    1/2∑_i,j,k,l U^AA_i,j,k,lâ^†_i â^†_j â_k â_l \n    \t\t+ 1/2∑_i,j,k,l U^BB_i,j,k,lb̂^†_i b̂^†_j b̂_k b̂_l \n    \n    \t\t+    ∑_i,j,k,l U^AB_i,j,k,lâ^†_i b̂^†_j â_k b̂_l ,\n\n\t\twhereâ_i^†(orb̂_i^†) creates a particle in the single-particle Wannier statew(x-x_i,t)of the lowest energy band (l=1) localised on theisite, in the internal stateA(orBrespectively). The commutation relations between those operators are presented in the equations (<ref>).\n\t\t\n\t\tThe Bose-Hubbard model considers only states in the lowest energy band, which is justified as long as the excitation energies to the higher bands are much larger than the energies involved in the system dynamics. In general, if the lattice heightV_0(t)is being varied in time, the Wannier functions, and hence the hopping and interaction parameters depend on time\n\t\t\n    J(i-j)     = - d/2π∫_q ∈ 1BZ d q   E_q e^-i (i-j)d q \n    \n    \t\t\tU^σσ'_i,j,k,l    = g_σσ'∫ dx  w(i)w(j)w(k)w(l),\n\n\t\twherew(i)=w(x-x_i). \n\t\tDue to the orthonormality of the Wannier functions, the tunnelling termsJ(i-j)are independent on the dimension while the interaction parameters are not, as the Wannier function factorises in the respective spatial dimensions.\n\t\n\tIn the [tight-binding] limit when the lattice height is larger than the recoil energyE_R=ħ^2k_L^2/(2m)and the Wannier functions are well-localised around each lattice site, the tunnelling and interaction terms fall off rapidly with the distance|x_i - x_j|. By keeping  only the leading terms in (<ref>), one obtains the Bose-Hubbard model\n\t\n    ℋ̂_BH = ℋ̂_hopp + ℋ̂_int,\n\n\twhere\n\t\n    ℋ̂_hopp   = - J∑_< i,j> =1^Mâ_i^†â_j  - J∑_< i,j> =1^Mb̂_i^†b̂_j, \n    ℋ̂_int   = U_AA/2∑_i=1^Mn̂^A_i (n̂^A_i - 1) + U_BB/2∑_i=1^Mn̂^B_i (n̂^B_i - 1) + U_AB∑_i=1^Mn̂^A_i n̂^B_i.\nIn the above expressions J:=J(1), U_σσ':=U^σσ'_0,0,0,0 and n̂^A_i:=â_i^†â_i, n̂^B_i:=b̂_i^†b̂_i. In the shallow lattice, however, for V_0 ≪ 1, all the terms in (<ref>) have to be taken into account. A schematic illustration of the Bose-Hubbard model is depicted in Figure <ref>.\n\n\tThe first and second term in (<ref>) is called [hopping term] (<ref>) and [interaction term] (<ref>) respectively. The sums in the hopping term go over neighbouring indices (|i-j| =1). Theâ_i^†andb̂_i^†operators are [creation operators] of an atom in statesAandBoniofMlattice's sites. They obey commutation relations\n\t\n    [α̂_i,β̂^†_j] = δ_ijδ_αβ, \n    \n    \t\t[α̂^†_i,β̂^†_j] = [α̂_i,β̂_j] = 0,\n\n\tforα= a, bandβ= a, b. The [atoms number operators]n̂_i^αare defined as:\n\t\n    n̂^A_i := â_i^†â_i,    n̂^B_i := b̂_i^†b̂_i,\n\n\tand [total atoms number operator]N̂is defined as:\n\t\n    N̂ := N̂^A + N̂^B := ∑_i=1^Mn̂_i^A + ∑_i=1^Mn̂_i^B,\n\n\twhereN̂^α:=∑_i=1^M n̂_i^αare total atoms number operators of typeα.\n\t\n\tTheU_AA, U_BB, U_ABandJparameters depend onV_0– depth of the lattice potential. A more detailed discussion of the dependence of valuesJ, U_AA, U_BB, U_ABonV_0is presented in Section [sec:deepLattice]. In the proposed protocol, parameters of the Bose-Hubbard model are time-dependent, as a change of the lattice heightV_0is induced. ChangingV_0is necessary to cross the system from the superfluid to the Mott insulator phase. \n\n\tIn the simulations, the symmetry between typeAandBparticles is assumed and:\n\t\n    U := U_AA(V_0) = U_BB(V_0) = 0.95^-1  U_AB(V_0) ≥ 0.\n\n\n\tForV_0a linear dependence on time is considered:\n\t\n    V_0(t) = V_i + (V_f - V_i)t/τ,\n\n\twhere the lattice depthV_0changes fromV_itoV_fin timeτ, which is referred to as [ramp time].\n\n\t\n\t\n\n§ THE NOTATION\n\n\n §.§ Fock basis\n\n\n\tThis work uses the Fock basisℱto describe the system. Any element of the Fock basis of an optical lattice withMlattice sites andNparticles of two types (AandB) in the considered model can be written in the form\n\t\n    |n^A_1; n^B_1⟩⊗|n^A_2; n^B_2⟩⊗⋯⊗|n^A_M; n^B_M⟩≡|n^A_1, ..., n^A_M; n^B_1, ..., n^B_M⟩,\n\n\twheren^α_iis the number ofαtype particles onilattice site, so\n\t\n    n̂^α_i |n^A_1, ..., n^A_M; n^B_1, ..., n^B_M⟩ = n^α_i |n^A_1, ..., n^A_M; n^B_1, ..., n^B_M⟩,\n\n    ∑_α=A,B∑_i=1^M n^α_i = ∑_α=A,B N^α = N\n\n\tand creation/annihilation operators for typeAwork so that\n\t\n    â_i |n^A_1, ..., n^A_i, ..., n^A_M; { n_i^B }⟩ = √(n^A_i-1)|n^A_1, ..., n^A_i-1, ..., n^A_M; { n_i^B }⟩,\n    â^†_i |n^A_1, ..., n^A_i, ..., n^A_M; { n_i^B }⟩ = √(n^A_i)|n^A_1, ..., n^A_i+1, ..., n^A_M; { n_i^B }⟩\n\n\t(where{ n_i^B } = n^B_1, ..., n^B_M), analogically for typeB.\n\t\n\tAny state|Ψ(t)⟩can be then written in the form:\n\t\n    |Ψ(t)⟩≡∑_ψ∈ℱ|ψ⟩⟨ψ||Ψ(t)⟩ =: ∑_ψ∈ℱ c_ψ (t) |ψ⟩,\n\n\twhere the complex numbersc_ψ(t):=⟨ψ|Ψ(t)|$⟩ are called decomposition coefficients of the state |Ψ(t)⟩ in the Fock basis ℱ.\n\n\tSimilarly, any operator acting on the whole lattice is also considered in the Fock basis:\n\t\n    𝒪̂ = ∑_ψ,ψ'∈ℱ|ψ⟩⟨ψ|𝒪̂|ψ'⟩⟨ψ'| =: ∑_ψ,ψ'∈ℱ𝒪_ψ,ψ'|ψ⟩⟨ψ'|\n\n\tand the complex numbers 𝒪_ψ,ψ' are the elements of the matrix representing the operator 𝒪̂ in the Fock basis.\n\n\tIt is the vector/matrix representation, where states are represented by vectors while operators by matrices. In this way, any operation (like the calculation of an average) can be translated to a numerical multiplication or addition of matrices and vectors.\n\n\n\t\n\n §.§ Single-site operators\n\n\t\n\n\tIn this study, quantum states describing multiple lattice sites are examined. Sometimes, the operators used in the work act on the whole state, however, other times they act only on a single lattice. It is thus convenient to introduce the notation below. An operator acting on a single site state is marked by a superscript with parentheses. For instance, 𝒪̂^(j) operator acts on a state describing j lattice site only. For any operator 𝒪̂^(j) acting on a state describing a single lattice site, one can define an operator 𝒪̂_j acting on a state describing the whole lattice such that\n\t\n    𝒪̂_j := ^(1)⊗⋯⊗^(j-1)⊗𝒪̂^(j)⊗^(j+1)⊗⋯⊗^(M)\n\n\tand ^(k) are identity operators acting on state describing k  lattice site.\n\tOne can note here that the mathematical form of 𝒪̂^(j) operators with different values of j is the same. However, by changing the value of j in the superscript of the operator 𝒪̂^(j) one changes the physical interpretation of the operator, because it acts on another lattice site. On the other hand, changing the lower index of 𝒪̂_j, changes also the mathematical form of this operator.\n\n\tThis thesis uses also operators of form:\n\t\n    𝒪̂ = ∑_j=1^M 𝒪̂_j,\n\n\tlike the spin operators defined in Subsection [sec:SpinOperators] or:\n\t\n    𝒪̂ = ⊗_j=1^M 𝒪̂^(j),\n\n\tlike the Ŝ_rot operator defined in Section [sec:CorrelatorChoice]. Operators of the structure (<ref>) and (<ref>) act on the state describing the whole lattice applying the same operation to each of the lattice sites.\n\t\n\t\n\t\n\n §.§ Spin operators\n\n\t\n\t\n\tThis work utilises the below defined collective spin operators Ŝ_x, Ŝ_y, Ŝ_z:\n\t\n\t\n\t    \n    Ŝ_x := ∑_j=1^M1/2 (â^†_jb̂_j + b̂^†_jâ_j)\n    Ŝ_y := ∑_j=1^M1/2i (â^†_jb̂_j - b̂^†_jâ_j) \n    Ŝ_z := ∑_j=1^M1/2 (â^†_jâ_j - b̂^†_jb̂_j).\n\n\t\n\tThe operators obey cyclic commutation relations:\n\t\n    [ Ŝ_j, Ŝ_k ] = ϵ_jkl i Ŝ_l,\n\n\twith ϵ_jkl being the Levi-Civita symbol.\n\t\n\tNote that the average values of Ŝ_x, Ŝ_y, Ŝ_z operators span a generalised Bloch sphere of radius N2. It means that the length of the [collective spin] ⟨Ŝ|$⟩ is\n\t\n    | ⟨Ŝ|⟩| := √(⟨Ŝ_x|^⟩2+⟨Ŝ_y|^⟩2+⟨Ŝ_z|^⟩2) = N/2.\n\n\tThe Hamiltonian (<ref>) conserves the number of particles; thus, the collective spin is also conserved during the evolution.\n\t\n\n\t\n\n§ VERY DEEP LATTICES – HARMONIC APPROXIMATION\nIn the limit of V_0/E_R ≫ 1, the Wannier functions can be approximated by Gaussian functions whose width is set by the frequency associated with each lattice site minimum <cit.>. Therefore, w(x)≈( k_L^2/π)^1/4( V_0/E_R)^1/8 e^-√(V_0) k_L^2 x^2/2. This is a sufficient approximation to obtain the interaction coefficient\n\t\t\n    U^ Gauss_σσ' (t) /E_R≈√(32/π)a_σσ' d/L_x L_y(V_0/E_R)^1/4 .\n\n\t\tFigure <ref> (a) presents the interaction terms calculated exactly from (<ref>), compared with the approximated formula (<ref>). It can be easily observed that for V_0/E_R>1, the interaction terms beyond the terms involving nearest neighbours can be neglected as compared with the latter ones as expected <cit.>.In the case of the hopping parameters J(i-j), the Gaussian approximation gives a relative error growing with the lattice height <cit.>. The hopping matrix element can be conveniently approximated by the width of the lowest band in the one-dimensional Mathieu equation <cit.>, yielding to\n\t\n    J_ app/E_R≈4/√(π)(V_0,x/E_R)^3/4 e^-2√(V_0,x/E_R),\n\n\tfor the nearest neighbours, i.e. |i-j|=1. \n\tFigure <ref> (b) shows the tunnelling terms calculated exactly and using the above formula. Indeed, as long as V_0/E_R>1, the leading nearest neighbour term dominates.\n\n\tThis work operates in the regime3 < V_0/E_R < 40; thus, the terms other thanU^σσ'_0000 =: U_σσ'andJ(1) =: Jare omitted. The values used in the numerical calculations are computed from (<ref>) and (<ref>). They are presented in Figure <ref>.\n\n\n\n§ PHASE DIAGRAM OF GROUND STATES\n\n\n\tThe Bose-Hubbard Hamiltonian describes many-body system. One can then investigate its thermodynamic properties. As this thesis deals with systems with finite number of particles, the thermodynamic limit cannot be achieved. However, for simplicity, the terminology from statistical physics is used, because in finite systems there appear analogous phenomena as in thermodynamics of infinite systems.\n\n    The following subsections describe two interesting regimes of the phase diagram of the ground states of the Hamiltonian. Those are Mott insulator regime and superfluid regime.\n\n\tIn order to calculate the phase diagram at zero temperature, a numerical program to compute the ground states of the Bose-Hubbard Hamiltonian for different numbers of particles per siteν:=N/MandU/Jratios was prepared. ForM = 8sites in the lattice andU_AA = U_BB,U_AB = 0.95   U_AA, the variance of particle numbers and condensate fraction were calculated for different values ofJand different total numbers of atomsN. The results are presented in subsections [subs:MI] and [subs:SF].\n\n\t\n\n §.§ Mott insulator phase\n\n\t\t\n\t\tIn the regime, where J ≪ U_σσ', the hopping term becomes negligible. The atoms become localised as probability of hopping between different lattice sites becomes very small.\n\n\t\tThe interaction between atoms is repulsive (U_σσ'≥ 0) and the system is translationally invariant; thus, the system tends to occupy the states with homogeneous distribution of atoms over the lattice. The ground states of the system are realised with exactly one atom per site for N=M.\n\n\t\tThis regime is called the [Mott insulator phase] <cit.>. It is interesting as in this regime, the interaction between atoms at neighbouring sites is suppressed and many-body properties such as entanglement can be “frozen”.\n\n\t\tTo verify if the system is in the Mott insulator phase, the variance of the population of particles in each site is used:\n\t\t\n    _i := Δ^2 (n̂^A_i + n̂^B_i) ≡⟨(n̂^A_i + n̂^B_i)^2|-⟩⟨n̂^A_i + n̂^B_i|^⟩2.\n\n\t\tIt tends to zero for each site i in the Mott regime. The diagram of δ_1 is plotted in Figure <ref>.\n\t\t\n\t\t\n\n §.§ Superfluid phase\n\n\t\t\n\t\tThe hopping term becomes the most important in the Hamiltonian when J ≫ U_σσ'. In this regime the system is [superfluid] – the wave functions of atoms are spatially delocalised and atoms can easily interact with each other <cit.>.\n\n\t\tThis study employs the notion of [superfluid fraction] to indicate the existence of the superfluid phase. In the case of this work, the superfluid fraction is equal to [condensate fraction] <cit.>\n    f_c := 1/N M∑_i=1^M ∑_j=1^M ∑_α=a,b⟨α̂_i^†α̂_j|,⟩\n\n\t\twhich measures the amount of atoms in the zero quasi-momentum mode.\n\t\t\n\t\tFigure <ref> shows interpolated values of f_c– a measure of condensate fraction and superfluid fraction as well – depending on J/U_σσ and N/M.\n\t\t\n\t\t\n\n§ ENTANGLEMENT\n\n    \n\n\tEntanglement is one of the key features of quantum systems. As being unique for quantum mechanics, it witnesses non-classicality of physical systems <cit.>. It can also be used as a resource in quantum information protocols such as dense coding or quantum teleportation <cit.>. \n\n\tIn the linear-algebraic terms of quantum theory, entanglement is a property of a multipartite system, which is described by non-separable density operator. To explain what is non-separability, first definition of [separability] has to be introduced. A quantum state described by the density operatorρ̂_sepis [separable] if the operator can be written in the form\n\t\n    ρ̂_sep = ∫ dλ p(λ) ⊗_j=1^M ρ̂^(j)(λ),\n\n\twhereρ̂^(j)(λ)is a density operator describing state ofjofMparts of the system andp(λ)is probability distribution over some random variableλ.\tIf a state cannot be described in a form (<ref>), it is called [non-separable] or [entangled].\n\t\n\tThis work considers entanglement between modes as the parts of the system are lattice sites. If the examined parts of the system were particles, then one would deal with entanglement between particles.\n\n\n\t\n\n §.§ Quantum correlator \n\n\t\t\n\tThe goal of this thesis is to produce an entangled state; thus, it has to be justified whether created states are entangled. Following the discussion from <cit.>, a similar measure of entanglement is used in this work – the quantum correlator  defined below:\n\t\n    | 𝒞_e⃗|^2 := | ⟨⊗_j=1^M Ŝ_e⃗^(j)|⟩|^2.\n\n\tTheŜ_e⃗^(j)operators are spin operators ine⃗direction acting onjlattice site, defined as\n\t\n\t\n    Ŝ_e⃗^(j) := e⃗·Ŝ⃗^(j)≡e⃗· (Ŝ_x^(j), Ŝ_y^(j), Ŝ_z^(j))^T,\n\n\twheree⃗is a three-dimensional vector of complex numberse_x, e_y, e_z(independent ofj) such that its scalar product with any unit vector of real numbersn⃗is no greater than one:\n\t\n    ∀_n⃗:\n     |n⃗|=1 | e⃗·n⃗| ≤ 1\n\n\t(the choice of the above condition is explained in Appendix [app:CumbersomeInequality]) and\n\t\n    Ŝ_x^(j) := 1/2( â^(j)^†b̂^(j) + b̂^(j)^†â^(j)), \n    Ŝ_y^(j) := 1/2( â^(j)^†b̂^(j) - b̂^(j)^†â^(j)), \n    Ŝ_z^(j) := 1/2( â^(j)^†â^(j) - b̂^(j)^†b̂^(j)).\n\n\n\tWhat is worth mentioning is that the value of  calculated on a mixed state withN=Mparticles inMlattice sites is limited by the following bound:\n\t\n    | 𝒞_e⃗|^2 ≤1/4,\n\n\twhich is proved in Appendix [app:MaxCorrelator].\n    \n    It has to be noted that the definition (<ref>) of the correlator, represents a whole class of possible correlators, which differ by the direction ofe⃗. Application of the correlator as a witness of entanglement in a given physical problem requires a careful choice of the directione⃗. In the context of the Bose-Hubbard model it is shown in Section [sec:CorrelatorChoice]. A special case is, e.g.| 𝒞_+ |^2 correlator withŜ_e⃗^(j) = Ŝ_+^(j) := Ŝ_x^(j) + Ŝ_y^(j), which was used in <cit.> and in this work in Section [sec:CorrelatorChoice].\n\n\t\n\n §.§  as a witness of entanglement\n\n\n\tIn the thesis, states with equal number of particles and lattice sites (N=M) are investigated. For these states, Condition (<ref>) necessary for separability of modes is presented and proven as below.\n\t\n\tAssuming that a density matrixρ̂_sepdescribing some system is separable, one can write as follows:\n\t\n    | 𝒞_e⃗|^2 ≡| [ ρ̂_sep⊗_j=1^M Ŝ_e⃗^(j)] |^2 =[1]=| ∫ dλ  p(λ) ∏_j=1^M [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤[2]≤∫ dλ  p(λ) ∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤[3]≤ 2^-2M.\n\n\tThe above holds since:[1]the state is separable ((<ref>)),[2]a square of a modulus of mean value of a random variable is no greater than a mean value of square of modulus of the random variable[For any complex random variable X the following holds: ⟨(|X|-|⟨X||⟩)^2|≥⟩0. As a consequence |⟨X||⟩^2≤⟨|X|^2|$⟩ because⟨|X||=⟩|⟨X||⟩. and[3]is just a special case of the equation:\n\t\n    ∫ dλ  p(λ) ∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤(N/2 M)^2M\n\n\twithN=M, which is proved as Theorem [the:Theorem1] in Appendix [app:CumbersomeInequality].\n\t\n\tFrom the above it is apparent that for any separable state withN = M, the value of| 𝒞_e⃗|^2is less than2^-2Mfor all directionse⃗:\n\t\n    | 𝒞_e⃗|^2 ≤ 2^-2M    (for separable states).\n\n\tThe value2^-2Min Inequality (<ref>) is called [separability bound] in this thesis, because breaking it would prove that the state cannot be considered a separable state. It would indicate that there is entanglement between the modes in the system. This work uses| 𝒞_e⃗|^2as a measure of entanglement in a multi-mode system. All the states with>2^-2Mare [entangled] and the states with=14are called [fully entangled], because14is the maximum possible value of  as proved in <cit.> for|𝒞_+|^2and in Appendix [app:MaxCorrelator] for anye⃗. The value \n\t\n\tIt is worth noting that the state is entangled if for anye⃗occurs>2^-2M. On the other hand, for a given entangled state there may be such vectore⃗for which the separability bound (<ref>) is not broken. To prove that the state is entangled one needs to find a propere⃗as done in Section [sec:CorrelatorChoice]. Moreover, if one finds that the value of  is lower than2^-2M, for alle⃗allowed by Condition (<ref>), it does not have to mean that the state is separable.\n\t\n\t\n\t\n\n§ GENERATING ENTANGLEMENT IN OPTICAL LATTICE\n\n    \n    This subsection briefly argues why entanglement can be generated in the system studied in this work. To give a better understanding, first, the Hamiltonian of the model is presented in the Fourier space. Then it is shown that the model takes the form of the one-axis twisting model and the consequences of this fact are discussed.\n    \n    The Bose-Hubbard Hamiltonian (<ref>) can be written in the momentum representation as follows (see, e.g. <cit.>):\n    \n    ℋ̂_BH = ∑_q ϵ_q ã̂_q^†ã̂_q + ∑_q ϵ_q b̂̃̂_q^†b̂̃̂_q +\n\n    + ∑_q_1, q_2, k[ U_AA/2Mã̂_q_1-k^†ã̂_q_2+k^†ã̂_q_1ã̂_q_2 + U_BB/2Mb̂̃̂_q_1-k^†b̂̃̂_q_2+k^†b̂̃̂_q_1b̂̃̂_q_2] +\n\n    + ∑_q_1, q_2, kU_AB/Mã̂_q_1-k^†b̂̃̂_q_2+k^†ã̂_q_1b̂̃̂_q_2,\n\n    whereã̂_q^†andb̂̃̂_q^†are creation operators of a particle with quasi-momentumqin stateAandBrespectively:\n    \n    â_i^†   = 1/√(M)∑_q e^-  q x_iã̂_q^†, \n    b̂_i^†   = 1/√(M)∑_q e^-  q x_ib̂̃̂_q^†\n\n    withx_ibeing the position ofilattice site and\n    \n    ϵ_q = - 2 J cosq d,\n\n    wheredis the spatial distance separating lattice sites.\n\t\t\n\tIn the superfluid phase, when condensate fraction (<ref>) is close to one, most of the atoms tend to occupy the zero momentum mode. In this regime, the following part of the Hamiltonian (<ref>) can be considered, to effectively describe the system:\n\t\n    ℋ̂_BH, q=0 = ϵ_0Ñ̂_0^A + ϵ_0Ñ̂_0^B + U_AA/2MÑ̂_0^A^2 + U_BB/2MÑ̂_0^B^2 + U_AB/MÑ̂_0^AÑ̂_0^B,\n\n    whereÑ̂_0^A, Ñ̂_0^Bare numbers of atoms in the zero momentum mode defined as\n    \n    Ñ̂_0^A   := ã̂_0^†ã̂_0, \n    Ñ̂_0^B   := b̂̃̂_0^†b̂̃̂_0.\n\n    \n    Assuming that the system is in the superfluid phase with condensed fractionf_c≈1, one might expect that⟨Ñ̂_0^A+Ñ̂_0^B|≈⟩Nand therefore the Bose-Hubbard model for q=0 takes the form:\n    \n    ℋ̂_BH, q=0 = U_AA+U_BB - 2 U_AB/2MŜ_z_0^2 + U_AA-U_BB/2MŜ_z_0Ñ̂_0 +\n\n    + U_AA+U_BB+4 U_AB/8MÑ̂_0^2 + ϵ_0Ñ̂_0,\n\n    where\n    \n    Ŝ_z_0   := 1/2( Ñ̂_0^A - Ñ̂_0^B),\n    Ñ̂_0   := Ñ̂_0^A + Ñ̂_0^B.\n\n    The first term in (<ref>) has the form of the famous one-axis twisting model <cit.>. Here thezcomponent of the collective vector refers to the zero-momentum mode only.\n\n    It is already widely understood that the one-axis twisting model, from the initial spin-coherent state, generates squeezed and entangled states, including Schrödinger cat state <cit.>. The latter one is nothing else as the rotated GHZ state that this thesis focuses on. Taking this into account, one can expect that the Bose-Hubbard model generates squeezed and entangled states in the superfluid regime. Therefore, the idea of this work, as explained in Subsection [sec:Protocol], is to generate an entangled state in the superfluid phase and then shift the system to the Mott insulator phase by rising the lattice height.\n    \n\n\t\n\n§ THE INITIAL STATE\n\n\n\tIt is already well-recognised that squeezing and entanglement in an optical lattice can be generated from the initial spin-coherent state <cit.>. The spin-coherent state can be conveniently prepared in numerical simulation using the following procedure.\n\n\tOne starts the simulation from the ground state|GS^A⟩of the Hamiltonian (<ref>), with additional condition of all particles being in theAstate. The ground state is calculated numerically. An example forN=M=2is given in the Appendix [app:Neq2].\tThe|GS^A⟩state is then exposed to rotation around they-axis of the generalised Bloch sphere to obtain [spin-coherent state]|GS^+⟩:\n\t\n    |Ψ(t=0)⟩ = |GS^+⟩ := e^-π/2Ŝ_y|GS^A⟩,\n\n\twhereŜ_yoperator is defined by (<ref>).\n\t\n\t\n\tThe spin-coherent state is then evolved according to the Schrödinger equation:\n\t\n    iħ∂/∂ t|Ψ(t)⟩ = ℋ̂_BH(t) |Ψ(t)⟩.\n\n\n\tIn this thesis the equation is solved numerically. The equation can be solved analytically only forN=M=2and constant Hamiltonian. The solution for theN=M=2case is presented in Appendix [app:Neq2].\n\n\n    \n\t\n\n§ THE PROTOCOL\n\n\t\n\tThis section proposes a protocol for generating entangled states. The protocol exploits the existence of two phases in the optical lattice. It is achieved by using a model of an optical lattice filled with ultracold atoms. At the beginning, the lattice is prepared in a ground state of bosonic atoms in one internal stateA. Then aπ/2-pulse is applied to create a superposition of two internal states of atoms (it is the spin-coherent state (<ref>)). The system being in superfluid phase is evolved dynamically to create entanglement. During evolution, the lattice depth is being increased to reach Mott insulator phase and eventually stop the interaction to freeze the state. The quantum correlator𝒞_e⃗defined in the next section [sec:QuantumEntanglement] is used to quantify entanglement in the 6-partite system. The study finds that the appropriate choice of parameters in the protocol allows one to create maximally entangled Greenberger-Horne-Zeilinger (GHZ) state. The protocol follows the method presented in <cit.>. This thesis presents an analysis of entanglement in the system and introduces tools similar to those presented in <cit.> to measure entanglement in a more general case.\n\t\n\t\n    < g r a p h i c s >\n(a) At the beginning, in a shallow optical lattice, ultracold bosons in an internal state A are prepared in the superfluid phase. The number of atoms is equal to the number of lattices. (b) Then a π/2-pulse is applied to put each atom in a coherent superposition of two internal states A and B. As the system is in the superfluid phase, non-linear interaction between atoms starts the generation of quantum correlations in the system. (c) Depth of the lattice is being gradually increased to perform adiabatic change of the Hamiltonian and shift the system from the superfluid to the Mott-insulator phase and freeze the created correlations. Reprinted from <cit.>.\n\t\n\nCHAPTER: METHODS\n\n\t\n\t\n\n§ STRATEGY\n\n\n\tThe research started from investigating the ground states of the Hamiltonian (<ref>) for different parameters of the lattice. It was done to get a better understanding of the phase diagram of the system and to find the numerical values of the parameters leading to Mott insulator phase and superfluid phase (Section [sec:phaseDiagram]).\n\n\tThen a numerical program (Appendix [app:NumericalProgram]) was prepared to calculate the ground states of the Bose-Hubbard Hamiltonian with different values of its parameters. To construct the Hamiltonian, the Fock basis (Subsection [sec:FockBasis]) was used. The states were represented by vectors whose components correspond to the coefficients of decomposition in the basis. The operators, such as the Bose-Hubbard Hamiltonian, were represented by matrices in the same basis. Values of condensate fraction (<ref>) and particle number variance (<ref>) for these states were calculated to specify for which range of parameters one deals with Mott or superfluid regime. The results are shown in figures <ref> and <ref>.\n\n\tFrom the phase diagram, the appropriate parameters of the system were found to create a protocol for freezing the states. The idea was to evolve the state in the superfluid regime so it would become entangled and adiabatically shift the system into Mott regime to “freeze” the entanglement.\n\n\tNext, a numerical program was written to solve numerically the Schrödinger equation using the Runge-Kutta method <cit.>. The initial state was prepared numerically according to Section [sec:initialStatePreparation].\n\tDuring evolution the program was also calculating values of other observables such as fluctuations of particles number_i(<ref>), superfluid fractionf_c(<ref>) and correlator (<ref>).\n\tA linear increase of the lattice potential was assumed what is easily achievable in an experiment. The aim was to verify whether it is possible to generate entanglement in the lattice and store it in Mott insulator phase, and possibly to find a protocol, which gives the most entangled state. Simulations for different ramp timesτwere run to analyse the resulting states. To examine the entanglement in the system, Inequality (<ref>) was derived and used as a criterion for separability. The value of  was employed as a measure of entanglement.\n\n\n\t\n\n§ COMPUTER TOOLS\n\n\t\n\tTo perform numerical simulations, programming languages such as ,  and  were used. The research involved  and  libraries in  code, , ,  and  in  code and  package in the  code to ensure efficient computations. All the simulations were prepared in the framework of GNU/Linux operating system Ubuntu. To increase the computational efficiency, the fact that the Hamiltonian matrix is sparse was exploited and special techniques for operating on sparse matrices were applied. A brief description of the computer program realising the simulations is presented in the Appendix [app:NumericalProgram].\n\n\n\t\n\t\n\nCHAPTER: RESULTS\n\n\t\n    This work presents a method of generating and storing entangled states of a few bosonic atoms in an optical lattice potential described by the Bose-Hubbard model. To prove that there is entanglement in the system, a family of correlators  was introduced in Subsection [subs:Correlator]. The value of  is a measure of entanglement in the system as shown in Subsection [subs:Witness]. To validate that the correlator  can be used as a witness of entanglement, another important result of this thesis – Theorem [the:Theorem1] leading to separability bound (<ref>)– was proven.   \n\n    In the previous chapters, the Bose-Hubbard model describing one-dimensional optical lattice was introduced (Section [sec:BoseHubbardModel]). Then it was shown that this model can be mapped into one-axis twisting model and allows producing entangled states (Section [sec:HamiltonianIn0q]). A protocol generating entangled states, using the spin-coherent state (<ref>) as the initial state, was described in Section [sec:Protocol]. The protocol consists of the following steps: First, the spin-coherent state|GS^+⟩(<ref>) is created in the lattice. The lattice is tuned so that the system remains in the superfluid regime to enable entanglement generation. Then the lattice potential height is slowly increased to adiabatically shift the system to the Mott regime where the dynamics slows down and the level of entanglement is frozen.\n\n    The following Section [sec:Tuning] presents how to determine the parameters of the model (number of particles per siteνand the lattice potential heightV_0) allowing to operate the lattice from superfluid to Mott insulator regime. The form of the states produced by the protocol is discussed in Section [sec:InternalStructure]. For some ramp time, the resulting state (<ref>), at the end of the evolution, is the GHZ state. In Section [sec:CorrelatorChoice] it is shown how to find a correlator proving that this state is the maximally entangled state. At the end, Section [sec:Breaking] demonstrates that indeed the protocol produces entangled states and specifically the maximally entangled state.\n\t\n\n\t\n\n§ TUNING THE TRAP\n\n\t\n\tThe goal of this work was to create and store an entangled state. As shown in Section [sec:HamiltonianIn0q], Bose-Hubbard Hamiltonian creates entanglement in a system in the superfluid regime. On the other hand the Mott insulator phase is necessary to freeze the state. This section presents how to choose the proper values of the number of particles per siteνand the lattice potential heightV_0to prepare the system in the superfluid phase and shift it to the Mott insulator phase.\n\t\n\tThe Mott insulator phase is only achievable for integer number of particles per lattice site <cit.>, as it is apparent from the phase diagram of the Bose-Hubbard model (Figure <ref>). This study examines a system with one particle per lattice site (N = M). It has an additional feature that in the deep Mott regime the system can be described as a spin-1/2chain <cit.>. Due to computational limitations, it was chosen to consider a system with six lattice sites (M=6).\n\n\tA simulation with linear change of potential from3 E_Rto45 E_Rin a very long time (ramp timeτ=10000 ħ/E_R) was run to provide adiabatic evolution. The variance of particles' number and condensate fraction was calculated to investigate for which ranges of potential there is Mott insulator or superfluid phase.\n\t\n\t\n    < g r a p h i c s >\nA plot showing the condensate fraction f_c (<ref>) and the variance of the number of particles in the first site δ_1 (<ref>) as a function of the lattice potential V_0 during adiabatic evolution of the system (V_0 changing slowly from 3 to 45 E_R).\n\t\n\tAs observed in Figure <ref>, the condensate fractionf_cis close to one and the system is in the superfluid regime for small values of the lattice's potential (V_0 ≲ 4 E_R). In this regime, the high value of condensate fractionf_callows entanglement generation (as explained in Section [sec:HamiltonianIn0q]). When increasingV_0to around30 E_R, the variance of number of particles in lattice siteδ_itends to zero (Figure <ref>). It indicates that the system arrives at the Mott regime with exactly one atom per lattice site. The interaction between the atoms is hindered. The change of the system's parameters is then suppressed and one can expect to be able to “freeze” the resulting state.\n\t\n\t\n\t\n\t\n\n§ INTERNAL STRUCTURE OF THE STATE\n\n\t\n\tTo investigate the protocol (Section [sec:Protocol]), simulations of the system withN=M=6for different ramp timesτwere run. In <cit.> it was shown that the states at the end of the ramp are of the form:\n\t\n    |Ψ⟩_MI, N= 6 = c_60( |𝒮_6,0⟩ + |𝒮_0,6⟩) + c_51(|𝒮_5,1⟩ + |𝒮_1,5⟩) + \n    \n    \t+ c_42(|𝒮_4,2⟩ + |𝒮_2,4⟩) + c_33 |𝒮_3,3⟩,\n\n\twhere|𝒮_N_A,N_B⟩(withN_A+N_B=N=M) are defined as\n\t\n    |𝒮_N_A,N_B⟩ := ∑_{n^A_i }:\n    ∑_i n^A_i=N_A,\n     n^A_i ≤ 1 ∑_{n^B_i }:\n    ∑_i n^B_i=N_B,\n     n^A_i + n^B_i ≤ 1 |{n^A_i}; {n^B_i}⟩≡\n    ≡1/N_A! N_B!∑_σ∈ S_M∏_k=1^N_A∏_l=N_A+1^N_A+N_Bâ^†_σ(k)b̂^†_σ(l)\n\n\tandS_Mare all permutations of a set withMelements. Example|𝒮_N_A,N_B⟩states using notation introduced in (<ref>):\n\t\n    |𝒮_6,0⟩ = |1,1,1,1,1,1;0,0,0,0,0,0⟩,\n\n    |𝒮_1,5⟩ = |1,0,0,0,0,0;0,1,1,1,1,1⟩ + |0,1,0,0,0,0;1,0,1,1,1,1⟩ +\n\n    + |0,0,1,0,0,0;1,1,0,1,1,1⟩ + |0,0,0,1,0,0;1,1,1,0,1,1⟩ +\n\n    + |0,0,0,0,1,0;1,1,1,1,0,1⟩ + |0,0,0,0,0,1;1,1,1,1,1,0⟩.\n\n\tValues ofc_ABfactors in|Ψ⟩_MI, N= 6state can be well approximated by:\n\t\n    c_60 = 1/2^3,    c_51 = 1/2^3 e^ϕ_51,    c_42 = 1/2^3 e^ϕ_42,    c_33 = 1/2^3 e^ϕ_33,\n\n\twhereϕ_51, ϕ_42andϕ_33numbers are from range[0, 2π[.\n\t\n\tFrom the results of simulations presented in Figure <ref> it can be concluded that the values ofϕ_51, ϕ_42andϕ_33phases depend linearly on the ramp timeτ.\n\t\n\t\n    < g r a p h i c s >\nThis figure shows internal structure of the final state for different ramp times τ. The upper plot demonstrates the norm of coefficients c_N_AN_B whose values are close to 1/2^3 as expected. The lower plot shows phases of the coefficients, which are linearly changing with the value of τ. The value τ=19100 is marked with horizontal line. For this ramp time, one gets ϕ_42≈0 and ϕ_51≈π/2≈ϕ_33, and therefore the state is a superposition of two phase-states (<ref>)– which is the GHZ state. \n\t\n\tTo rewrite the resulting state|Ψ⟩_MI,N=6the phase-state|ϕ⟩_MIcan be defined:\n\t\n    |ϕ⟩_MI := ( ⊗_j=1^6â^(j)^†+e^ϕb̂^(j)^†/√(2))\n\n\twithbeing the vacuum Fock state. Expressing|𝒮_N_A,N_B⟩in terms of phase-states leads to:\n\t\n    3/4(|𝒮_6,0⟩+|𝒮_0,6⟩)    = |0⟩_MI + |π⟩_MI + |π/3⟩_MI + |2π/3⟩_MI + |4π/3⟩_MI + |5π/3⟩_MI, \n    1/2(|𝒮_5,1⟩+|𝒮_1,5⟩)    = |0⟩_MI - |π⟩_MI - ( |π/2⟩_MI + |3π/2⟩_MI), \n    3/4(|𝒮_4,2⟩+|𝒮_2,4⟩)    = 2|0⟩_MI + 2|π⟩_MI - ( |π/3⟩_MI + |2π/3⟩_MI + |4π/3⟩_MI + |5π/3⟩_MI), \n    1/2|𝒮_3,3⟩   = |0⟩_MI - |π⟩_MI + ( |π/2⟩_MI + |3π/2⟩_MI).\n\n\t\n\tFrom (<ref>) and (<ref>) it is apparent that the state at the end of the ramp|Ψ⟩_MI,N=6defined in (<ref>) can be written as a linear combination of phase-states. Moreover, fore^ϕ_42=1andϕ_51=ϕ_33=π/2it simplifies to the superposition of only two phase-states:\n\t\n    |Ψ⟩ := |Ψ⟩_MI,N=6.|_ϕ_42=0, ϕ_51=ϕ_33=π/2 = e^π / 4/√(2)(|0⟩_MI-|π⟩_MI) =\n\n    = e^π / 4/√(2)( ⊗_j=1^6â^(j)^†+b̂^(j)^†/√(2) - ⊗_j=1^6â^(j)^†+b̂^(j)^†/√(2)) .\n\n\tThe above form of the state at the end of the ramp suggests that it is the GHZ state (<ref>) (up to a phase factor between the two of superposed states). From the results of the simulation it is evident that the GHZ state can be produced whenτ≈ 19000 E_R/ħ(see Figure <ref>).\n\n\n\t\n\n§ CHOICE OF THE PROPER CORRELATOR\n\n\t\n\n\tTo prove that the state|Ψ⟩defined by Equation (<ref>) is entangled, the correlator of the form (<ref>) is used. The reasoning below demonstrates how to choose the directione⃗appearing in the definition of the correlator (<ref>) to make it useful for the system generated by the protocol. It is done for arbitrary number of sitesM; thus, in this section the state|Ψ⟩takes more general form than (<ref>):\n\t\n    |Ψ⟩ = C/√(2)( ⊗_j=1^Mâ^(j)^†+b̂^(j)^†/√(2) - ⊗_j=1^Mâ^(j)^†+b̂^(j)^†/√(2)) ,\n\n\twithCbeing some phase factor (complex number of norm one). To find a proper directione⃗the following reasoning can be carried out:\n\n\t\n\n\t\tIf in each of M lattice sites there is exactly one atom, the lattice can be seen as a chain of M qubits, where atom in state A denotes |0⟩ and atom in state B denotes |1⟩. The GHZ state will be then represented in the Fock basis by\n\t\t\n    |GHZ⟩ := 1/√(2)(|0⟩^⊗ M + |1⟩^⊗ M) ≐1/√(2)(⊗_j=1^M â^(j)^† + ⊗_j=1^M b̂^(j)^†).\n\n\t\tThe analysis presented here is very general. Therefore the notation typical for description of qubits as introduced in quantum information tasks is used. Note, however, that the state |0⟩^⊗ M can also be expressed using the Fock state basis (see Subsection [sec:FockBasis]), then |0⟩^⊗ M≐|1,1,...,1;0,...,0⟩.\n\t\tThe correlator (<ref>) gives the largest possible value for e⃗ such, that Ŝ^(j)_e⃗ = Ŝ_+^(j) (see Subsection [subs:Correlator]), as\n\t\t\n    | 𝒞_e⃗^GHZ|^2 := | ⟨⊗_j=1^M Ŝ_+^(j)|⟩|^2 = | ⟨GHZ|⊗_j=1^M â^(j)^†b̂^(j)|GHZ|⟩|^2 = 1/4\n\n\t\tand 1/4 is the largest possible value of the correlator as proved in Appendix [app:MaxCorrelator].\n\t\t\n\t\tAssuming that the state (<ref>) is the rotated maximally entangled state, one can find a rotation operator Û^(j) acting on single qubit such that\n\t\t\n    ⊗_j=1^M Û^(j)^†|Ψ⟩=|GHZ⟩\n\n\t\tand then:\n\t\t\n    1/4= | ⟨GHZ|⊗_j=1^M Ŝ_+^(j)|GHZ⟩|^2 = | ⟨Ψ|⊗_j=1^M Û^(j)Ŝ_+^(j)Û^(j)^†|Ψ⟩|^2.\n\n\t\tFrom the above, it is clear that one can use Ŝ_rot:=⊗_j=1^M Ŝ_rot^(j):=⊗_j=1^M Û^(j)Ŝ_+^(j)Û^(j)^† operator to prove entanglement of the |Ψ⟩ state.\n\t\t\n\t\tWith Û^(j)Û^(j)^† = ^(j) being ansatz it can be found that sufficient conditions for Û^(j)^† fulfilling (<ref>) are\n\t\t\n    Û^(j)^†â^(j)^† = â^(j)^† + b̂^(j)^†/√(2), \n    Û^(j)^†b̂^(j)^† = â^(j)^† - b̂^(j)^†/√(2),\n\n\t    because\n\t\t\n    ⊗_j=1^M Û^(j)^†|Ψ⟩ = ⊗_j=1^M  Û^(j)^†C/√(2)( ⊗_j=1^M â^(j)^†+b̂^(j)^†/√(2) - ⊗_j=1^M â^(j)^†+b̂^(j)^†/√(2))  =\n\n    = C/√(2)( ⊗_j=1^M ( Û^(j)^†â^(j)^†+b̂^(j)^†/√(2)) - ⊗_j=1^M  ( Û^(j)^†â^(j)^†+b̂^(j)^†/√(2)) )  =\n\n    = C/√(2)( ⊗_j=1^M  â^(j)^† + ⊗_j=1^M b̂^(j)^†)  = C |GHZ⟩.\n\n\t\t\n\n\t\tFrom (<ref>) it is evident that:\n\t\t\n    Û^(j)â^(j)^†   = â^(j)^† + b̂^(j)^†/√(2)\n    Û^(j)b̂^(j)^†   = â^(j)^† -  b̂^(j)^†/√(2),\n\n\t\tand\n\t\t\n    Ŝ_rot := ⊗_j=1^M Ŝ_rot^(j) := ⊗_j=1^M Û^(j)â^(j)^†b̂^(j)Û^(j)^† = ⊗_j=1^M Û^(j)â^(j)^† (Û^(j)b̂^(j)^†)^† =\n\n    = ⊗_j=1^M /2(â^(j)^†â^(j) - â^(j)^†b̂^(j) + b̂^(j)^†â^(j) - b̂^(j)^†b̂^(j)) = ⊗_j=1^M ( Ŝ^(j)_z + Ŝ^(j)_y ).\n\n\t\t\n\t\tThe Û^(j) operator is then rotation among z and y axes:\n\t\t\n    Û^(j) = e^- π/2Ŝ^(j)_z e^π/2Ŝ^(j)_y,\n\n\t\twhat is a unitary matrix, and thus, fulfils the ansatz. One can also easily check that Ŝ_rot^(j) belongs to the family of operators Ŝ_e⃗^(j)(<ref>) with e⃗=(0,1,) fulfilling Condition (<ref>).\n\t\n\t\n\tFrom the above it is apparent that measuring the value of|⟨Ŝ_rot|⟩|^2on the final state|Ψ⟩(<ref>) one gets14what is greater than2^-12and proves non-separability of the state. It is worth mentioning that theŜ_+^(j)operator was rotated, but conversely, the state could be rotated to get the GHZ state and theŜ_+^(j)operator used to prove entanglement.\n\tThe next section presents the results of calculations of\n\t\n    | 𝒞|^2 := |⟨Ŝ_rot|⟩|^2 = |⟨⊗_j=1^M ( iŜ^(j)_z + Ŝ^(j)_y ) |⟩|^2\n\n\tin numerical simulations.\n\n\t\n\n§ BREAKING THE SEPARABILITY BOUND\n\n\n\tFollowing the results analysed in Section [sec:Tuning], it was chosen to operateV_0between3 E_Rand40 E_R, to ensure that at the beginning the system remains superfluid (what guarantees entanglement generation) and it ends up in the Mott insulator phase (so that evolution is frozen). The lattice height was changed linearly during timeτ. To check what is the optimal speed of changing the potential, simulations with differentτ's were run and value of  indicating entanglement in the system at the end of evolution was observed. The results are presented in Figure <ref>.\n\t\n\t\n    < g r a p h i c s >\nEach point on the plot represents a value of some variable at the end of the evolution for given τ. The upper subplot shows the final values of  together with the separability bound 2^-12 (red dashed line) and the maximal possible value of  (blue line). The lower subplot presents phases ϕ_N_AN_B. The horizontal line marks τ=19100 for which the value of the correlator is maximal. For that ramp time ϕ_42≈0 and ϕ_51≈π/2≈ϕ_33 what gives GHZ-like state (see Section [sec:InternalStructure]).\n\t\n\t\n\tIt can be observed that for ramps with ramp timeτ∈ [ 2600, 35700 ]the value of correlator  on the final state, at the end of evolution, is greater than the separability limit2^-12. It indicates that the state cannot be described by the separable state, and therefore that there is entanglement in the system (see Subsection [subs:Witness]). Moreover, forτ≈ 19000 E_R/ħthe value of the correlator approaches the value0.232which is close to14. It is the maximum possible value of the correlator (see Appendix [app:MaxCorrelator]). At the same time the values of the phases of the nonzero coefficients of decomposition of the state in the Fock state basis (see Section [sec:InternalStructure]) take the valuesϕ_42≈0andϕ_51≈π/2≈ϕ_33. These values are expected when the GHZ state  (<ref>) is realised in the system (see Section [sec:InternalStructure]).\n\t\n\tIn the following, a single evolution of the state in a ramp with ramp timeτ=19000 E_R/ħwill be considered to investigate how the entanglement does emerge in the system. The results of the simulation are presented in Figure <ref>. Value of  during the evolution is marked with the solid green line. The red dashed line represents the separability bound (<ref>).\n\t\n\t\n    < g r a p h i c s >\nHorizontal axis marks the time of evolution and lattice height V_0 (which changes linearly with t). Vertical axis symbolises value of the correlator. Green line marks value of  during evolution of the system. Red dotted line represents the bound for separable states for M=6 subsystems and blue solid line the maximal possible value of –1/4. It is evident that the system breaks the separability bound and approaches highly entangled state.\n\n    It is apparent that after time2365 E_R/ħthe state must be entangled as the value of  is greater than the separability bound. The blue line marks14– the maximum possible value of the correlator. After time10000 E_R/ħvalue of the correlator approaches14and the state becomes almost maximally entangled. When the lattice depthV_0exceeds30 E_R, the system is in the Mott insulator phase (see Figure <ref>). Thanks to that, evolution of the state is frozen and the value of the correlator does not change anymore. Noticeably, it is a result of a numerical experiment, where decoherence processes are not taken into account.\n\n\tThe above demonstrates that it is possible to use an optical lattice filled with a few bosonic atoms to create and store the maximally entangled state. To prove that, the correlator of form (<ref>) was used. This work shows that the family of correlators  can be used to measure entanglement in an optical lattice. As  is a well-defined physical observable, it might be measured in a real experiment.\n\t\n\t\n\t\n\t\n\nCHAPTER: SUMMARY AND CONCLUSION\n\n\n\tThe thesis presents a protocol for generation and storage of the maximally entangled GHZ state in the Mott phase. The method can be realised experimentally with a few ultracold atomic bosons loaded into one-dimensional optical lattice potential. It can be achieved by simply preparing all the atoms in one internal state, applyingπ/2-pulse before the evolution and linearly changing the lattice height.\n\n\tNumerical results forN=6particles onM=6lattice sites are shown. The author has also observed a similar behaviour forN=M=4case. The same effects are expected to occur for an arbitrary large number of particles as long as the decoherence effects can be neglected. What is worth mentioning is that in the model used in the study, the number of particles per lattice site is exactly equal to one, change of the potential is slow enough that the system evolves adiabatically and are no particle losses. In the work, the correlator  was also defined. It measures the level of entanglement in the system and is a generalisation of the correlator proposed in <cit.>. To generalise the applicability of the correlator from <cit.>, analytical proofs of two inequalities: (<ref>) and (<ref>) are provided. Inequality (<ref>) is used to indicate entanglement in an optical lattice filled with an arbitrary number of particles. This inequality defines a more general class of correlators that can be used to indicate entanglement in a system. Inequality (<ref>) gives the bound for the value of the generalised correlator . It is valid for a more general class of operators and any state with the number of atoms equal the number of lattice sites. It was proven numerically that the maximal value of the correlator  can be achieved when the GHZ state is generated and stored (Figure <ref>) in the system composed of a few ultracold atoms loaded into the optical lattice potential by using the presented protocol (Section [sec:Protocol]).\n\n\tThe scheme can be implemented experimentally with present-day techniques and the correlator can be measured using for example quantum-gas microscopy <cit.>. The advantage of using a system with a few atoms is the high level of control one has, both for the preparation and for the measurement. The strength of the presented method is the possibility of scaling up the system size step by step by increasing the number of lattice sites or the spatial dimension. The discovered method has a potential to allow exploration of the boundary between the microscopic and the macroscopic world.\n\n\n\t\n\nCHAPTER: PROOF OF INEQUALITY [3]\n\n\n\tThis appendix contains a proof of Inequality[3](<ref>). To prove the inequality, first, Lemma [lem:Pauli] is introduced. The lemma is then used to prove Theorem [the:Theorem1], which forN=Mis identical with Inequality[3](<ref>).\n\n\t\n\t    The sum of the modulus square of expectation value of spin operators Ŝ_e⃗^(j) defined in (<ref>) on subsystems ρ̂^(j) of any separable state ⊗_j=1^M ρ̂^(j) with N atoms over M lattice sites is no greater than N2:\n\t    \n    ∑_j=1^M | [ ρ̂^(j)Ŝ_e⃗^(j)] | ≤N/2.\n\n\t    The left-hand side of Inequality (<ref>) can be first rewritten as follows:\n\t    \n    | [ ρ̂^(j)Ŝ_e⃗^(j)] | = | [ ρ̂^(j) e_x Ŝ_x^(j)] + [ ρ̂^(j) e_y Ŝ_y^(j)] + [ ρ̂^(j) e_z Ŝ_z^(j)] | = = | e_x ⟨Ŝ_x^(j)|_⟩ρ̂^(j) + e_y ⟨Ŝ_y^(j)|_⟩ρ̂^(j) + e_z ⟨Ŝ_z^(j)|_⟩ρ̂^(j)| = = | e⃗·( ⟨Ŝ_x^(j)|_⟩ρ̂^(j),  ⟨Ŝ_y^(j)|_⟩ρ̂^(j), ⟨Ŝ_z^(j)|_⟩ρ̂^(j))^T | = = | e⃗·⟨Ŝ^(j)|⟩_ρ̂^(j)|,\n\n\t    where ⟨Ŝ^(j)|⟩_ρ̂^(j):=( ⟨Ŝ_x^(j)|_⟩ρ̂^(j),  ⟨Ŝ_y^(j)|_⟩ρ̂^(j), ⟨Ŝ_z^(j)|_⟩ρ̂^(j))^T. Expression (<ref>) can be further investigated introducing unit vectors n⃗^(j)=(n_x^(j),n_y^(j),n_z^(j))^T parallel to ⟨Ŝ^(j)|⟩_ρ̂^(j), i.e.:\n\t    \n    n_x,y,z^(j):= ⟨Ŝ_x,y,z^(j)|_⟩ρ̂^(j)/| ⟨Ŝ^(j)|⟩_ρ̂^(j)|.\n\n\t    Using this notation, Expression (<ref>) takes the following form:\n\t    \n\t    \n\t   \n\t   \n    | e⃗·⟨Ŝ^(j)|⟩_ρ̂^(j)| = | ⟨Ŝ^(j)|⟩_ρ̂^(j)| | e⃗·n⃗^(j)|.\n\n\t   In this work they are considered only those e⃗=(e_x,e_y,e_z) vectors, which scalar product with any unit vector of real numbers n⃗ is no greater than one:\n\t   \n    ∀_n⃗:\n     |n⃗|=1 | e⃗·n⃗| ≤ 1.\n\n\t   This condition is necessary to obtain the following boundary for the expression from (<ref>):\n\t   \n    | e⃗·⟨Ŝ^(j)|⟩_ρ̂^(j)| ≤| ⟨Ŝ^(j)|⟩_ρ̂^(j)|.\n\n\t    Using the above inequality, the left-hand side of Inequality (<ref>) can be then bounded in the following way:\n\t    \n    ∑_j=1^M | [ ρ̂^(j)Ŝ_e⃗^(j)] | ≤∑_j=1^M | ⟨Ŝ^(j)|⟩_ρ̂^(j)| = | ⟨Ŝ|⟩| = N/2\n\n\t    as the average value of the collective spin ⟨Ŝ|$⟩ on any state with well-defined number of particlesN, is equal toN2(see Subsection [sec:SpinOperators]).\n\t    \n\t\n\t\n\t    It is worth noting that:\n        \n    | e⃗·n⃗| = | e_x n_x + e_y n_y + e_z n_z | =\n    \t        = ( |e_x|^2  n_x^2 + |e_y|^2  n_y^2 + |e_z|^2  n_z^2 + 2 ( Re  e_x  Re  e_y + Im  e_x  Im  e_y )n_x n_y + \n    \n    \t        + 2 ( Re  e_y  Re  e_z + Im  e_y  Im  e_z )n_y n_z + 2 ( Re  e_z  Re  e_x + Im  e_z  Im  e_x )n_z n_x )^1/2\n\n\t   Based on the above, an obvious consequence is that when considering suche⃗=(e_x,e_y,e_z)vectors that fulfil the following conditions:\n\t    \n    Re  e_x  Re  e_y = Re  e_y  Re  e_z = Re  e_z  Re  e_x = 0, \n    Im  e_x  Im  e_y = Im  e_y  Im  e_z = Im  e_z  Im  e_x = 0, \n    \n    \t        |e_x|, |e_y|, |e_z| ≤ 1,\n\n\t    Inequality (<ref>) holds, and thus, also the inequalities (<ref>) and (<ref>) hold. The class of vectors satisfying (<ref>) is narrower than of those satisfying (<ref>). The only vectorse⃗that fulfil (<ref>) are of the form:\n\t    \n    ( α, β, 0 ), ( α, β, 0 ), ( α, 0, β), ( α, 0, β), ( 0, α, β) or( 0, α, β),\n\n\t    withα, β∈ℝand-1 ≤α, β≤ 1. It is worth checking first whether Inequality (<ref>) is broken fore⃗defined by (<ref>) withα,β=±1before numerically searching fore⃗that fulfils the more general Condition (<ref>).\n\n\n\tWith Lemma [lem:Pauli] proven, the main statement of this appendix can be proved:\n\n\t\n\t    For separable quantum states ∫ dλ  p(λ) ⊗_j=1^M ρ̂^(j)(λ) of N atoms on M lattice sites:\n        \n    ∫ dλ  p(λ) ∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤(N/2 M)^2M.\n\n\t    Inequality (<ref>) is proved for any separable state with well-defined total number of atoms and for operators Ŝ_e⃗^(j) defined in Subsection [subs:Correlator] with e⃗ fulfilling (<ref>). Because the integral in (<ref>) is just an average over probability distribution p(λ), Theorem [the:Theorem1] holds true if for all λ\n    ∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤(N/2 M)^2M.\n\n\n\t    Proving Inequality (<ref>) is then sufficient to prove Theorem [the:Theorem1]. Proof of Inequality (<ref>) starts form noting that the 2M root of the left-hand side of (<ref>) can be seen as a geometric mean. Knowing that the geometric mean is no greater than the arithmetic mean[One can prove that for M non-negative numbers {a_i} their geometric mean is bounded from above by their arithmetic mean: √(∏_i=1^M a_i)≤1/M∑_i=1^M a_i. As in <cit.>.], one can write:\n\t    \n    √(∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] | )≤1/M∑_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |.\n\n\t    Raising both sides of (<ref>) to the power of 2M, one gets a bound for the left-hand side of (<ref>):\n\t    \n    ∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤( 1/M∑_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] | )^2M.\n\n\t    Now Lemma [lem:Pauli] (which holds true for all separable states with exactly N atoms and for any e⃗ fulfilling (<ref>)) can be applied to write\n\t    \n    ( 1/M∑_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] | )^2M≤( 1/M·N/2)^2M.\n\n\n\t    The above presented reasoning proves that Inequality (<ref>) holds true and by this that Inequality (<ref>) also holds true.\t    \n\t\n\n\tIn the special case, whenN=MTheorem [the:Theorem1] is identical with Inequality[3](<ref>):\n\t\n    ∫ dλ  p(λ) ∏_j=1^M | [ ρ̂^(j)(λ) Ŝ_e⃗^(j)] |^2 ≤(1/2)^2M.\n\n\tIt is worth noting here that the whole proof of Lemma [lem:Pauli], and thus, the proof of Theorem [the:Theorem1] are based on Condition (<ref>) imposed on vectore⃗. That is why (<ref>) is imposed one⃗when defining theŜ_e⃗^(j)operator (<ref>) and the correlator𝒞_e⃗(<ref>) in Subsection [subs:Correlator].\n\t\n\t\n\t\n\t\n\nCHAPTER: MAXIMUM VALUE OF \n\n\t    The modulus of the quantum correlator 𝒞_e⃗ squared  calculated on a mixed state with N = M atoms on M lattice sites is bounded from above by 14:\n\t    \n    |𝒞_e⃗|^2 = |⟨⊗_j=1^M Ŝ_e⃗^(j)|⟩|^2 ≤1/4.\n\n\t    The proof starts from considering the 𝒞_+:=⟨⊗_j=1^M Ŝ_+^(j)|$⟩ correlator:\n\t    \n    𝒞_+ = [ ρ̂⊗_j=1^M Ŝ_+^(j)] = ∑_ψ p_ψ⟨ψ|⊗_j=1^M â^(j)^†b̂^(j)|ψ|,⟩\n\n\t    with vectors|ψ⟩and probabilitiesp_ψconstituting the density matrix of the mixed stateρ̂describing the whole system, i.e.ρ̂ = ∑_ψ p_ψ|ψ⟩⟨ψ|. The|ψ⟩vectors can be represented in the Fock basisℱ:\n\t    \n    ∑_ψ p_ψ⟨ψ|⊗_j=1^M â^(j)^†b̂^(j)|ψ|=⟩∑_ψ p_ψ∑_α, α' ∈ℱ c_α^ψ c_α'^ψ^*⟨α'|⊗_j=1^M â^(j)^†b̂^(j)|α|,⟩\n\n\t    whereα, α'address states of the Fock basis andc_α^ψare coefficients of decomposition of the|ψ⟩state in the Fock basis, i.e.c_α^ψ=⟨α|ψ|$⟩.\n\t    \n\t    Now the state ρ̂ giving the maximal value of 𝒞_+ will be found and this maximal value will be calculated. First, one can note that the action of the operator ⊗_j=1^M â^(j)^†b̂^(j) on the state |α⟩ gives non-zero vector only when |α⟩=|0,...,0;1,...,1⟩. This is because with N = M all the other states have zero particles of B-type in some lattice site j and the correlator acting on them returns zero. The resulting vector is\n\t    \n    ⊗_j=1^M â^(j)^†b̂^(j)|0,...,0;1,...,1⟩ = |1,...,1;0,...,0⟩.\n\n\t    It is clear now that the only non-zero terms in the expression on the left-hand side of Equation (<ref>) are those with |ψ⟩ containing |0,...,0;1,...,1⟩ and |1,...,1;0,...,0⟩ states. Therefore, the state ρ̂ giving the maximal value of |⟨⊗_j=1^M Ŝ_+^(j)||⟩^2 should be a pure state of form:\n\t    \n    ρ̂^* = |θ,φ⟩⟨,|\n\n\t    with\n\t    \n    |θ,φ⟩ := sinθ|0,...,0;1,...,1⟩ + e^φcosθ|1,...,1;0,...,0⟩,\n\n\t    where θ∈[ 0, 2 π[ and φ∈[ 0, 2 π[.\n\t    The value of |𝒞_+|^2 can be calculated explicitly for this state:\n\t    \n    | ⟨θ,φ|⊗_j=1^M Ŝ_+^(j)|θ,φ|⟩|^2 = | sinθ⟨θ,φ|1,...,1;0,...,0|⟩|^2 = sin^2 θ cos^2 θ.\n\n\t    This value is maximised for sin^2 θ = 1/2 = cos^2 θ. Therefore, the maximum value of |𝒞_+|^2 is 14:\n\t    \n    max_ρ̂| 𝒞_+|^2 = max_ρ̂| [ ρ̂⊗_j=1^M Ŝ_+^(j)] |^2 = max_θ̂,̂ ̂φ̂| [ ρ̂^* ⊗_j=1^M Ŝ_+^(j)] |^2 = 1/4.\n\n\t    This way Inequality (<ref>) is proved for the special case 𝒞_e⃗=𝒞_+.\n\t    In the following, this result is generalised for any e⃗. First, one can note that there exists such unitary operator Û_e⃗ that:\n\t    \n    ⊗_j=1^M Ŝ_e⃗^(j) = Û_e⃗^†⊗_j=1^M Ŝ_+^(j)Û_e⃗.\n\n\t    The value of  on some state ρ̂ can be then expressed by | 𝒞_+|^2 calculated on another state ρ̂':=Û_e⃗ρ̂ Û_e⃗^† so that\n\t    \n    max_ρ̂| 𝒞_e⃗|^2 = max_ρ̂| [ ρ̂ Û_e⃗^†⊗_j=1^M Ŝ_+^(j)Û_e⃗] |^2 = max_ρ̂| [ Û_e⃗ρ̂ Û_e⃗^†⊗_j=1^M Ŝ_+^(j)] |^2 =\n\n    = max_ρ̂'| [ ρ̂' ⊗_j=1^M Ŝ_+^(j)] |^2 = 1/4\n\n\t    according to (<ref>). Inequality (<ref>) must hold true, since, as shown above, the maximum value of  is \n\t    14.\n\t    \n\t\n\ttoc\n\nCHAPTER: NUMERICAL PROGRAM\n\n\t\n\t\n\t\t\n\tA single simulation consisted of two stages. In the first stage, a program written in  was creating operators' matrices (particularly the matrix of the components of the Hamiltonian (<ref>)) and computing the initial state by solving the eigenproblem of the Hamiltonian. In the second stage, another program written in , was first applyingπ/2-pulse and then realising the numerical evolution of the state and calculating values of observables during the evolution.\n\t\n\tThe input arguments of the first program were the numbers of particles and sites (NandM) and the parameters of the lattice. First, the program generated the Fock space for givenNandM. In the created Fock space, matrices representing the Hamiltonian and other observables were obtained. Then the eigenproblem for the Hamiltonian's matrix has been solved to find the initial ground state. The matrices of the operators as well as the ground state were sent as the input for the second program.\n\t\n\tThe second program, basing on the output from the first one, was rotating the initial state byπ/2-pulse and evolving it. Every time step of the evolution consisted of calculation of the Hamiltonian for a given moment of time and Runge-Kutta evolution according to Schrödinger equation. Every few time steps, the values of interesting observables were calculated to get an insight into the evolution.\n\t\n\n\ttoc\n\nCHAPTER: EVOLUTION FOR N=2: ANALYTICAL RESULTS\n\n\n\tIn this appendix a semi-analytical method used to describe the dynamics of the system withN=M=2is presented. It is a result of <cit.>.\n\n\tThe Bose-Hubbard Hamiltonian (<ref>) can be considered in the Fock state basis. This thesis uses the following notation for the elements of the Fock basis forN=M=2:\n\t\n    |1⟩   =|2,0;0,0⟩,  |2⟩=|1,1;0,0⟩,  |3⟩=|0,2;0,0⟩,\n    |4⟩   =|1,0;1,0⟩, |5⟩=|1,0;0,1⟩, |6⟩=|0,1;1,0⟩, |7⟩=|0,1;0,1⟩,\n    |8⟩   =|0,0;2,0⟩, |9⟩=|0,0;1,1⟩, |10⟩=|0,0;0,2⟩.\n\n\tFor instance, using this notation, one can write:b̂^†_2 b̂_1 |8⟩=√(2)|9⟩.\n\tThe matrix of the Hamiltonian takes block diagonal form in the basis:Ĥ_BH=diag{ℋ̂_AA, ℋ̂_AB, Ĥ_BB},\n\twith representation ofĤ_ABtaking the form\n\t\n    Ĥ_AB≐(\n    \t[ U_AB -2 J -2 J    0; -2 J    0    0 -2 J; -2 J    0    0 -2 J;    0 -2 J -2 J U_AB;      ])\n\n\tin basis{|4⟩, |5⟩, |6⟩, |7⟩}and representations ofĤ_AA,Ĥ_BBin bases{|1⟩, |2⟩, |3⟩},{|8⟩, |9⟩, |10⟩}respectively, taking the form \n\t\n    Ĥ_AA≐(\n    \t[      U_σσ -2 √(2) J         0; -2 √(2) J         0 -2 √(2) J;         0 -2 √(2) J      U_σσ;           ]) ≐Ĥ_BB.\n\n\n    The initial spin-coherent state|GS^+⟩(<ref>) is defined as the ground state with condition of all atoms being in theAstate, rotated by thee^-i π/2Ŝ_yoperator:\n    \n    |GS^+⟩ = e^-i π/2Ŝ_y|GS^A⟩.\n\n    As all the particles in|GS^A⟩are in theAstate, it is enough to consider theℋ̂_AApart of the Hamiltonian only. The eigenvalues of this operator areE_1=Ω_AA-/2,E_2=U_AA,E_3=Ω_AA+/2,\n\twhereΩ_AA±=U_AA±√(64J^2+U_AA^2)and the corresponding eigenstates\n\t\n    |Ψ_1⟩   = 1/𝒩_1( |1⟩ + Ω_AA+/4√(2)J |2⟩ +  |3⟩), \n    \n    \t|Ψ_2⟩   = 1/√(2)( -|1⟩ + |3⟩), \n    \n    \t|Ψ_3⟩   = 1/𝒩_3( |1⟩ + Ω_AA-/4√(2)J |2⟩ +  |3⟩),\n\n\twith𝒩_1^2=2+Ω_AA+^2/(32J^2)and𝒩_3^2=2+Ω_AA-^2/(32J^2).\n\tThe|GS^A⟩state is then\n\t\n    |GS^A⟩=|Ψ_1⟩=∑_w=1^10 c^A_w |w⟩\n\n\twherec⃗^A=(1,Ω_AA=/4√(2)J,1,0,0,0,0,0,0,0)^T/𝒩_1, asE_1is the lowest eigenvalue.\n\t\n\tThee^- iŜ_y π/2operator in the basis (<ref>) takes the form\n\t\n    (\n    \t\t[     1/2       0       0 -1/√(2)       0       0       0     1/2       0       0;       0     1/2       0       0    -1/2    -1/2       0       0     1/2       0;       0       0     1/2       0       0       0 -1/√(2)       0       0     1/2;  1/√(2)       0       0       0       0       0       0 -1/√(2)       0       0;       0     1/2       0       0     1/2    -1/2       0       0    -1/2       0;       0     1/2       0       0    -1/2     1/2       0       0    -1/2       0;       0       0  1/√(2)       0       0       0       0       0       0 -1/√(2);     1/2       0       0  1/√(2)       0       0       0     1/2       0       0;       0     1/2       0       0     1/2     1/2       0       0     1/2       0;       0       0     1/2       0       0       0  1/√(2)       0       0     1/2 ])\n\n\tand the spin-coherent state is\n\t\n    |Ψ(0)⟩ = |GS^+⟩ = e^- iŜ_y π/2|GS^A⟩ = ∑_w c_w(0) |w⟩,\n\n\twhere\n\t\n    c⃗_w(0)=(2√(2), a/2, 2√(2),4,a/2,a/2,4,2√(2),a/2,2√(2) )^T1/√(8^2 + a^2)\n\n\tanda=Ω_AA+/J.\n\tIf the HamiltonianĤ_BHis constant, the solution to the Schrödinger equationi ħ∂_t |Ψ(t)⟩ = ℋ̂_BH|Ψ(t)⟩is:\n\t\n    |Ψ(t)⟩=e^-i t ℋ̂_BH/ħ|Ψ(0)⟩.\n\n\tIn the general case, when the Hamiltonian depends on time, the evolution of state can be calculated numerically.\n\t\n\tAs the time-independent case (<ref>) can be solved analytically it is still quite cumbersome in general. However, assuming the symmetric case withU_AA=U_BBthe result simplifies to:\n\t\n    |Ψ(t)⟩ = ∑_w c_w(t) |w⟩,\n\n\twhere\n\t\n    c_1(t)=2Je^-itΩ_AA-/2/√(64J^2+U_AAΩ_AA+),\n       c_2(t)=√(Ω_AA+)e^-itΩ_AA-/2/2√(2ω_AA), \n       c_4(t)=2Je^-itΩ_AB+/2[ Ω_AB+ - Ω_AA+ + e^i t ω_AB(Ω_AA+ - Ω_AB-)]/√(ω^2_AB(64J^2 + Ω_AA+^2)) ,\n       c_5(t)=e^-itU_AB/2/2√(2 ω^2_AB (64J^2 + U_AAΩ_AA+))×\n       ×[ Ω_AA+ω_AB cos(tω_AB/2)\n    \t+i (64J^2+Ω_AA+U_AB) sin(tω_AB/2) ] ,\n\n\tandc_3(t)=c_8(t)=c_10(t)=c_1(t),c_6(t)=c_5(t),c_7(t)=c_4(t),c_9(t)=c_2(t), withω_σσ' = √(64J^2 + U_σσ')andΩ_σσ' ±=U_σσ'±ω_σσ'. Thec_6-c_10coefficients can be expressed in terms ofc_1-c_5due to the symmetry in respect of exchange of the type of the particle, resulting from the equality of interaction coefficientsU_AA=U_BB. IfU_AA≠ U_BBthose coefficients differ and take more complex forms. It is worth mentioning, that in the limit ofJ→ 0the coefficientsc_1, c_3, c_4, c_7, c_8, c_10tend to zero, thus only the states with exactly one atom in each lattice site contribute to the state|Ψ⟩. It holds also when the non-symmetric case is considered.\n\n\n\tunsrt]"}