{"entry_id": "http://arxiv.org/abs/2303.06912v1", "published": "20230313081505", "title": "Synergizing Beyond Diagonal Reconfigurable Intelligent Surface and Rate-Splitting Multiple Access", "authors": ["Hongyu Li", "Shanpu Shen", "Bruno Clerckx"], "primary_category": "cs.IT", "categories": ["cs.IT", "eess.SP", "math.IT"], "text": "\n\n\nEffects of Nb Doping on the Charge-Density Wave and Electronic Correlations in the Kagome Metal Cs(V_1-xNb_x)_3Sb_5\n    Hai-Hu Wen\n    March 30, 2023\n===================================================================================================================\n\nempty\n\nThis work focuses on the synergy of rate-splitting multiple access (RSMA) and beyond diagonal reconfigurable intelligent surface (BD-RIS) to enlarge the coverage, improve the performance, and save on antennas. \nSpecifically, we employ a multi-sector BD-RIS modeled as a prism, which can achieve highly directional full-space coverage, in a multiuser multiple input single output communication system.   \nWith the multi-sector BD-RIS aided RSMA model, we jointly design the transmit precoder and BD-RIS matrix under the imperfect channel state information (CSI) conditions. \nThe robust design is performed by solving a stochastic average sum-rate maximization problem. \nWith sample average approximation and weighted minimum mean square error-rate relationship, the stochastic problem is transformed into a deterministic one with multiple blocks, each of which is iteratively designed. \nSimulation results show that multi-sector BD-RIS aided RSMA outperforms space division multiple access schemes. More importantly, synergizing multi-sector BD-RIS with RSMA is an efficient strategy to reduce the number of active antennas at the transmitter and the number of passive antennas in BD-RIS. \n\n\n\n    Beyond diagonal reconfigurable intelligent surface, rate-splitting multiple access, robust design.\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nThe next generation of wireless communications is expected to improve ongoing techniques in 5G and explore novel techniques to support high data rate transmission and massive connectivity <cit.>.\nSpecifically in the physical (PHY) layer, rate-splitting multiple access (RSMA) <cit.> and reconfigurable intelligent surface (RIS) <cit.> are two promising techniques, which can improve the wireless communication performance, such as spectral efficiency, energy efficiency, and coverage. \n\n\nRSMA is a PHY-layer non-orthogonal transmission strategy, which enables more flexible inter-user interference management compared to other existing multiple access techniques, such as spatial division multiple access (SDMA) and orthogonal multiple access (OMA) <cit.>. The key principle of (1-layer) RSMA is summarized as follows. \n1) At the transmitter, user messages are split into common and private parts, where the common parts from different users are combined and encoded into one common stream, while the private parts are individually encoded into private streams. \n2) At the receiver, each user first decodes the common stream and performs successive interference cancellation (SIC) to remove the common stream, and then decodes its own private stream. \nSuch a technique has been proved to achieve higher degree of freedom (DoF) <cit.>, spectral and energy efficiency <cit.> than SDMA, and be robust to channel state information (CSI) uncertainty <cit.> and mobility <cit.>. \nThe higher efficiency, universality, flexibility, robustness, and reliability of RSMA over existing multiple access strategies have been demonstrated in more than forty different applications and scenarios relevant to 6G <cit.>.\n\nMeanwhile, RIS is an emerging PHY-layer technique, which enables flexible manipulations of wireless communication environments in an energy-efficient manner <cit.>. The key advantages of RIS come from the following two perspectives. \n1) RIS is a planar surface consisting of a large number of nearly-passive elements with low power consumption. \n2) RIS has tuneable elements which can reconfigure incident signals. \nSuch a technique has been widely employed into various schemes, such as wireless power transfer (WPT) <cit.>, simultaneous wireless information and power transfer (SWIPT) <cit.>, integrated sensing and communication (ISAC) <cit.>, to show the benefits of RIS in improving sum output current <cit.> and radar output signal-to-interference-plus-noise (SINR) <cit.>.\n\n\n\n\n\n\n\n\n\n\nConventional RIS utilized in aforementioned research <cit.> is modeled as a diagonal phase shift matrix, assuming an architecture where each RIS element is connected to ground by its own load without interacting with other elements. \nHowever, new RIS architectures have recently appeared, namely beyond diagonal RIS (BD-RIS), whose mathematical model is not limited to diagonal matrices. \nUntil now, there are three categories of BD-RIS.\nThe first category is BD-RIS with group/fully-connected architectures modeled as block diagonal matrices <cit.>. In this category, group/fully-connected BD-RIS with reflective mode is first proposed and modeled in <cit.>, followed by the study of discrete-value group/fully-connected architectures <cit.> and optimal group/fully-connected design <cit.> of BD-RIS. \nTo enlarge the coverage of RIS, simultaneous transmitting and reflecting (STAR) RIS or intelligent omni-surface (IOS) <cit.> is recently introduced and implemented. Then STAR-RIS/IOS is proved to be a special case of group-connected architecture with group size 2 and further generalized in <cit.>. \nMulti-sector BD-RIS is proposed in <cit.> to further enhance the achievable performance of RIS while guaranteeing the full-space coverage.\nThe second category is BD-RIS with dynamically group-connected architectures modeled as permuted block diagonal matrix <cit.>. \nDifferent from <cit.>, where the architectures are fixed regardless of CSI, a dynamically group-connected architecture adapting to CSI is proposed in <cit.> based on a dynamic grouping strategy to further enhance the performance. \nThe third category is BD-RIS with non-diagonal phase shift matrix <cit.>. \nIn this category, a novel architecture, where signals impinging on one element can be reflected from another element, is modeled, analyzed, and proved to achieve better performance than conventional RIS with diagonal phase shift matrices. \n\n\nDue to the potential advantages of RSMA and RIS, the synergy among them has recently gained much attention <cit.>. \nThe synergy among the conventional RIS and 1-layer RSMA in multiuser systems is most commonly considered, whose benefits are shown by focusing on various metrics, such as sum-rate maximization <cit.>, energy efficiency maximization <cit.>, outage probability analysis <cit.>, transmit power minimization <cit.>, and max-min fairness <cit.>.\nIn addition, the interplay between conventional RIS and RSMA beyond 1-layer architectures, such as 2-layer hierarchical RSMA <cit.>, is also studied. \nWhile the abovementioned RIS aided RSMA work <cit.> is restricted to perfect CSI conditions, a more practical imperfect CSI scenario is analyzed in <cit.>. \nHowever, the above results <cit.> are restricted to the integration of RSMA and conventional RIS, which limits both the coverage and the achievable performance. \nTo realize full-space coverage in wireless networks, there are a few results on STAR-RIS aided RSMA <cit.> considering spatially correlated channels <cit.>, hardware impairments <cit.>, PHY layer security <cit.>, and the coupling of transmission and reflection phases <cit.>. \nMeanwhile, to enhance the spectrum efficiency of wireless communications, there is only one work <cit.> considering the employment of BD-RIS with fully-connected architecture and reflective mode in RSMA transmission network, where the sum-rate enhancement compared to SDMA schemes is highlighted. \nNevertheless, none of the existing work investigates the integration of BD-RIS and RSMA to simultaneously 1) enlarge the coverage, 2) boost the rate performance <cit.>, and 3) reduce the required number of active/passive antennas to improve energy efficiency, which motivates this work.  \n\nThe contributions of this work are summarized as follows. \n\nFirst, we consider the integration of RSMA and multi-sector BD-RIS in a multiuser multiple input single output (MU-MISO) system to simultaneously achieve the abovementioned three goals.\nThe first two goals are achieved by adopting the multi-sector BD-RIS, which is modeled as a prism consisting of multiple sectors with each covering part of the horizontal space. More importantly, the multi-sector BD-RIS enables highly directional beams and thus can provide high performance gains, thanks to the use of high-gain antennas with narrow beamwidth.  \nTo achieve the third goal, we adopt 1-layer RSMA at the transmitter, which provides additional DoF over conventional multiuser linear precoding, enables better inter-user interference management, and has the potential to save on the number of both active and passive antennas when synergizing with BD-RIS. \n\nSecond, we propose a robust beamforming design algorithm to maximize the average sum-rate for multi-sector BD-RIS aided RSMA under imperfect CSI conditions. To solve the stochastic problem, we first approximate it as a deterministic optimization by sample average approximation (SAA) methods <cit.>, and then transform the deterministic problem into a more tractable three-block optimization based on the weighted minimum mean square error (WMMSE)-rate relationship <cit.>. Specifically for the design of the BD-RIS matrix block, we first transform the non-smooth objective into a smooth one, and then solve the smooth problem by manifold methods. Initialization, complexity analysis, and convergence analysis of the proposed design are also provided. \n\n\nThird, we present simulation results to evaluate the ergodic sum-rate performance of the multi-sector BD-RIS aided RSMA compared to the SDMA scheme from the perspective of 1) the radiation pattern of BD-RIS antennas, 2) CSI conditions, and 3) the quality of service (QoS) threshold. Simulation results show that multi-sector BD-RIS aided RSMA always outperforms multi-sector BD-RIS aided SDMA in either of the abovementioned perspectives.\n\n\nFourth, with the same ergodic sum-rate requirement and QoS thresholds, we show the required numbers of active and passive antennas can be reduced compared to the SDMA scheme by synergizing BD-RIS with RSMA. Such reduction of antenna numbers leads to a potential energy efficiency gain. \n\n\nOrganization: Section II illustrates the multi-sector BD-RIS aided RSMA model. \nSection III provides the robust beamforming design for the multi-sector BD-RIS aided RSMA.\nSection IV evaluates the performance of the proposed design and Section V concludes this work.\n\nNotations:\nBoldface lower- and upper-case letters indicate column vectors and matrices, respectively.\nℂ, ℝ, and ℝ^+ denote the set of complex numbers, real numbers, and non-negative real numbers, respectively.\n𝔼{·} represents statistical expectation.\n(·)^∗, (·)^T, (·)^H, and (·)^-1 denote the conjugate, transpose, conjugate-transpose operations, and inversion, respectively.\n{·} denotes the real part of a complex number.\n𝐈_L denotes an L × L identity matrix.\n0 denotes an all-zero matrix.\n𝒞𝒩(0,Σ) denotes the circularly symmetric complex Gaussian (CSCG) distribution with mean 0 and covariance matrix Σ.\n𝐀_F denotes the Frobenius norm of matrix 𝐀.\n𝐚_2 denotes the ℓ_2-norm of vector 𝐚.\n|a| denotes the norm of variable a.\n𝗏𝖾𝖼(·) denotes the vectorization of a matrix.\n𝖽𝗂𝖺𝗀(·) denotes a diagonal matrix.\n𝖳𝗋{·} denotes the summation of diagonal elements of a matrix. \n▿(·) denotes the first-order Euclidean gradient operation. \n∂(·)/∂(·) denotes the first-order partial gradient operation.\n[𝐀]_i,:, [𝐀]_:,j, [𝐀]_i,j, and [𝐚]_i denote the i-th row, the j-th column, the (i,j)-th element of matrix 𝐀, and the i-th element of vector 𝐚, respectively. \n\n\n\n\n§ MULTI-SECTOR BD-RIS AIDED RSMA\n\n\nIn this section, we briefly review the concept of multi-sector BD-RIS, describe the multi-sector BD-RIS aided MU-MISO system, explain the architecture of 1-layer RSMA, and illustrate the modeling of CSI uncertainty.\n\n\n\n\n\n\n\n §.§ Multi-Sector BD-RIS\n\n\nThe multi-sector BD-RIS is modeled as a polygon consisting of L sectors, each of which has M antennas, as shown in Fig. <ref>. \nThe modeling of multi-sector BD-RIS is essentially based on group-connected reconfigurable impedance network and antenna array arrangements <cit.>. \nIn this subsection, we briefly explain the key of multi-sector BD-RIS from the following two perspectives.\n\n1) The multi-sector BD-RIS consists of M cells with an index set ℳ = {1,…,M}. Particularly, cell m, ∀ m∈ℳ contains antennas m, M+m, …, (L-1)M+m, which are connected to each other by reconfigurable impedance components to support the multi-sector mode.\n\n2) Each multi-sector BD-RIS antenna has a uni-directional radiation pattern with beamwidth 2π/L, which only covers 1/L azimuth space. \nIn each cell, L antennas are located at the edge of the polygon such that L antennas cover the whole azimuth space. \nThe larger the number of sectors L, the narrower the beamwidth of each BD-RIS antenna, and thus the higher the antenna gain of each BD-RIS antenna.\n\nTo summarize, benefiting from group-connected impedance network and antenna array arrangements, the multi-sector BD-RIS can realize highly directional full-space coverage.   \n\nMathematically, the multi-sector BD-RIS is characterized by L matrices, Φ_l∈ℂ^M× M, ∀ l∈ℒ={1,…,L}, corresponding to L sectors, which satisfy a combined unitary constraint given by\n\n    ∑_lΦ_l^HΦ_l = 𝐈_M.\n\nMore details about the modeling, design, and performance evaluation of the multi-sector BD-RIS can be found in <cit.>.\n\n\n\n\n §.§ Multi-Sector BD-RIS Aided MU-MISO\n\nConsider a MU-MISO system operating in the downlink as illustrated in Fig. <ref>, where the transmitter equipped with N antennas communicates to a set of single-antenna users 𝒦 = {1,…,K} with the aid of an M-cell multi-sector BD-RIS[In this work, we ignore the direct links between the transmitter and users for simplicity, while the proposed design in the following section is still feasible when direct links exist.].\nIn this work, we assume the transmitter is within the coverage of sector 1 of the multi-sector BD-RIS and K_l users in 𝒦_l = {∑_i=1^l-1K_i+1,∑_i=1^l-1K_i+2,…,∑_i=1^lK_i} are located within the coverage of sector l, ∀ l∈ℒ of the multi-sector BD-RIS, ∪_l𝒦_l = 𝒦, as illustrated in Fig. <ref>.  \nFor the multi-sector BD-RIS aided downlink MU-MISO, the signal received by user k, ∀ k∈𝒦_l covered by sector l, ∀ l∈ℒ is \n\n    y_k = 𝐡_k^HΦ_l𝐆𝐱 + n_k,\n\nwhere 𝐡_k∈ℂ^M and 𝐆∈ℂ^M× N, respectively, are the channel between the multi-sector BD-RIS and user k, ∀ k∈𝒦, and the channel between the transmitter and the BD-RIS, 𝐱∈ℂ^N is the transmit signal vector, and n_k∼𝒞𝒩(0,σ_k^2), ∀ k∈𝒦 is the additive white Gaussian noise (AWGN). \nThe transmit signal vector 𝐱 is subject to the power constraint 𝔼{𝐱^H𝐱}≤ P, where P is the maximum transmit power. \n\n\n\n\n\n\n\nAs discussed in <cit.>, reconfigurable impedance networks with different circuit topologies have scattering matrices with different mathematical characteristics. \nIn this work, we focus on a cell-wise single-connected (CW-SC) architecture of the multi-sector BD-RIS, where the inner-cell antennas are connected to each other by reconfigurable impedance components while the inter-cell antennas are not connected to each other. \nTo facilitate understanding, we provide an example of the BD-RIS with 4 sectors, 2 cells, and the CW-SC architecture in Fig. <ref>.\nFor multi-sector BD-RIS with CW-SC architecture, Φ_l, ∀ l∈ℒ are all diagonal matrices and the general unitary constraint (<ref>) becomes\n\n    Φ_l = 𝖽𝗂𝖺𝗀(ϕ_l,1,…,ϕ_l,M), ∀ l,\n    ∑_l |ϕ_l,m|^2 = 1, ∀ m,\n\nwhere ϕ_l,m∈ℂ, ∀ l∈ℒ, ∀ m∈ℳ. With equation (<ref>), we can rewrite equation (<ref>) as \n\n    y_k = ϕ_l^T𝐐_k^H𝐱 + n_k,\n\nwhere 𝐐_k = 𝐆^H𝖽𝗂𝖺𝗀(𝐡_k)∈ℂ^N× M, ∀ k∈𝒦 denotes the cascaded channel between the transmitter and user k, ϕ_l = [ϕ_l,1,…,ϕ_l,M]^T∈ℂ^M, ∀ l∈ℒ.\n\n\n\n\n\n §.§ Rate-Splitting\n\n\nIn this work, we adopt an 1-layer RSMA architecture at the transmitter. \nFig. <ref> illustrates the transceiver architectures with 1-layer RSMA, where the splitting, combining, encoding, and precoding of transmit signals at the transmitter and the decoding, splitting, and combining of received signal at the user side will be described in detail. \n\n\n\n\n\nTransmitter: The message W_k intended to user k, ∀ k∈𝒦 is split into a common part W_c,k and a private part W_p,k. \nAs shown in Fig. <ref>(a), the common parts W_c,k from all K users are merged into a common message W_c and further encoded into the common stream s_c, which will be decoded by all users, by a common codebook. \nK private parts are encoded into private streams s_p,1,…,s_p,K and individually decoded by different users. \nThe common stream and K private streams, 𝐬 = [s_c,s_p,1,…,s_p,K]^T∈ℂ^K+1, are linearly precoded by 𝐏 = [𝐩_c,𝐩_p,1,…,𝐩_p,K]∈ℂ^N×(K+1), where 𝐩_c∈ℂ^N is the common precoder and 𝐩_p,k∈ℂ^N is the private precoder for user k.\nThe resulting transmit signal is \n\n    𝐱 = 𝐏𝐬 = 𝐩_cs_c + ∑_k𝐩_p,ks_p,k.\n\nAssuming 𝔼{𝐬𝐬^H} = 𝐈_K+1, the transmit power constraint  becomes 𝔼{𝐱^H𝐱} = 𝖳𝗋(𝐏𝐏^H) = 𝐏_F^2 ≤ P.\n\n\nReceiver: Substituting (<ref>) into (<ref>), we obtain the received signal at user k covered by sector l, ∀ k∈𝒦_l,∀ l∈ℒ as\n\n    y_k =ϕ_l^T𝐐_k^H𝐩_cs_c + ϕ_l^T𝐐_k^H∑_k'𝐩_p,k's_p,k'+ n_k.\n\nTherefore, the average received power of user k covered by sector l for given CSI is given by\n\n    τ_c,k =   𝔼{|y_k|^2} = |ϕ_l^T𝐐_k^H𝐩_c|^2\n       +|ϕ_l^T𝐐_k^H𝐩_p,k|^2 + ∑_k' k|ϕ_l^T𝐐_k^H𝐩_p,k'|^2 + σ_k^2^= ι_p,k_= τ_p,k = ι_c,k.\n\nAt the user side, the signal process, taking user k covered by sector l, ∀ k∈𝒦_l, ∀ l∈ℒ as an example, is summarized as following three steps and also illustrated in Fig. <ref>(b).\n\n\nStep 1: User k covered by sector l decodes the equalized common stream s_c,k = g_c,ky_k with equalizer g_c,k∈ℂ into W̅_c,k by regarding the interference induced by all K private streams as noise, i.e., τ_p,k or ι_c,k in (<ref>). After performing SIC, W̅_c,k is subtracted from the received signal. \n\nStep 2: User k decodes the equalized private stream s_p,k = g_p,ky_k with equalizer g_p,k∈ℂ into W_p,k by regarding the interference induced by remaining K-1 private streams as noise, i.e., ι_p,k in (<ref>).  \n\nStep 3: User k splits its contribution to the common message, W_c,k, from the decoded W̅_c,k, and combines W_c,k with W_p,k to reconstruct W_k.\n\n\nBased on the above signal process, the instantaneous SINRs of the common stream and private streams at user k covered by sector l, ∀ k∈𝒦_l, ∀ l∈ℒ are given by\n\n    γ_c,k = |ϕ_l^T𝐐_k^H𝐩_c|^2ι_c,k^-1, γ_p,k = |ϕ_l^T𝐐_k^H𝐩_p,k|^2ι_p,k^-1.\n \nAssuming Gaussian inputs, the instantaneous common rates and private rates for user k are \n\n    R_c,k = log_2(1 + γ_c,k),  R_p,k = log_2(1 + γ_p,k).\n \nTo guarantee the common message W_c is successfully decoded by all K users, the common rate should not exceed min_∀ k R_c,k.\nGiven the architecture of RSMA as illustrated above, the common rate min_∀ k R_c,k is split into K parts, yielding min_∀ k R_c,k = ∑_kC_k. Each part C_k∈ℝ^+ corresponds to the common part of the achievable rate for user k. \nFinally, the total rate for user k is a summation of common part and private part, i.e., R_k = C_k + R_p,k, ∀ k∈𝒦. \n\n\n\n\n §.§ Channel State Information\n\n\nPerfect CSI acquisition in RIS aided systems is challenging due to the passive property of RIS. Therefore, in this work, we assume the transmitter has an imperfect instantaneous CSI\n𝐐 = [𝐐_1,…,𝐐_K]∈ℂ^N× MK. To model the CSI uncertainty, the perfect cascaded channel matrix 𝐐 = [𝐐_1,…,𝐐_K]∈ℂ^N× MK is expressed as a summation of the channel estimate and channel estimation errors, that is 𝐐 = 𝐐 + 𝐐, where the estimation error matrix is defined as 𝐐 = [𝐐_1,…,𝐐_K]∈ℂ^N× MK.\nThe channel estimation error could come from the noise and limited uplink training in time division duplex (TDD) settings based on the typical MMSE criterion <cit.>[The existing popular and effective channel estimation strategy, where the cascaded channel is estimated by pre-defining the RIS pattern during the uplink training process to minimize MSE, can be easily extended to the multi-sector BD-RIS case with CW-SC architecture. The key and main difference compared with conventional RIS case is the design of the RIS pattern due to the new constraint of multi-sector BD-RIS. A simple choice to minimize the MSE is to set identical amplitude for non-zero elements of the BD-RIS matrix, i.e., |ϕ_l,m| = 1/√(L). Then orthogonal matrices, such as discrete Fourier transform (DFT) matrix and Hadamard matrix, can be adopted to construct the RIS pattern.].\nIn this case, the channel estimation error generally follows the CSCG distribution, that is 𝗏𝖾𝖼(𝐐_k)∼𝒞𝒩(0,δ_k^2𝐈_MN), ∀ k∈𝒦, where δ_k^2 measures the estimation inaccuracy of the cascaded channel between the transmitter and user k. \n\n\n\n§ ROBUST BEAMFORMING DESIGN WITH SAMPLE AVERAGE APPROXIMATION\n\n\n\nIn this section, we formulate the sum-rate maximization problem for BD-RIS aided RSMA based on imperfect CSI conditions and propose efficient algorithms to jointly design the transmit precoder and BD-RIS. \n\n\n\n §.§ Problem Formulation\n\n\n\nBeamforming design for RIS aided systems highly relies on the CSI among the transmitter, RIS, and users. \nWhen perfect CSI is available at the transmitter, beamforming design can be developed according to perfect channels such that the instantaneous sum-rate, ∑_kR_k, is maximized, and thus the ergodic sum-rate given by 𝔼_𝐐{∑_kR_k}. \nHowever, when the transmitter has only partial instantaneous CSI as illustrated in Section <ref>, beamforming design that maximizes instantaneous sum-rate as in perfect CSI case is not possible, which makes it difficult to measure the long-term ergodic sum-rate. \nOne robust approach to tackle this issue is to perform the beamforming design based on the fact that the transmitter has access to the average rate, which captures the statistical property of the channel estimation error with a given estimate. The average rate is defined as follows. \n\n    The average rate is a measure of the expected performance over a distribution of the channel estimation error, e.g., the distribution of 𝐐, with determined estimate 𝐐 <cit.>. \n    Mathematically, the average common and private rates for user k, ∀ k∈𝒦 are, respectively, defined as R̅_c,k = 𝔼_𝐐|𝐐{R_c,k|𝐐} and R̅_p,k = 𝔼_𝐐|𝐐{R_p,k|𝐐}.\n \nWith Definition 1, we can connect the ergodic rates 𝔼_𝐐{R_c,k}, 𝔼_𝐐{R_p,k} with average rates R̅_c,k, R̅_p,k as \n\n    \n    𝔼_𝐐{R_c,k} = 𝔼_𝐐{𝔼_𝐐|𝐐{R_c,k|𝐐}} = 𝔼_𝐐{R̅_c,k}, \n    𝔼_𝐐{R_p,k} = 𝔼_𝐐{𝔼_𝐐|𝐐{R_p,k|𝐐}} = 𝔼_𝐐{R̅_p,k},\n\n\nwhich indicate that ergodic rates can be characterized by the expectation of average rates over varied channel estimate 𝐐. Accordingly, maximizing the ergodic sum-rate 𝔼_𝐐{∑_k R_k} with partial CSI is transformed into maximizing the average sum-rate for each 𝐐, given by ∑_kC̅_k + ∑_kR̅_p,k, where C̅_k∈ℝ^+, ∀ k∈𝒦_l referring to the common part of the average rate should satisfy ∑_kC̅_k = min_∀ kR̅_c,k.\nTherefore, the average sum-rate maximization problem can be formulated as\n\n    \n    \n    max_{𝐏,𝐜̅},{ϕ_l,∀ l}     ∑_kC̅_k + ∑_k R̅_p,k\n    s.t.          ∑_l|ϕ_l,m|^2 = 1, ∀ m,\n       𝐏_F^2 ≤ P,\n       ∑_k'C̅_k'≤R̅_c,k, ∀ k,\n       𝐜̅≽0,\n       R̅_k ≥ R_th,k, ∀ k,\n\n\nwhere ϕ_l=[ϕ_l,1,…,ϕ_l,M]^T∈ℂ^M, ∀ l∈ℒ, 𝐜̅ = [C̅_1,…,C̅_K]^T∈ℝ^K, and R_th,k∈ℝ^+ is the threshold rate for user k, ∀ k∈𝒦, to guarantee the QoS.\nProblem (<ref>) is a challenging stochastic optimization. One reliable solution is to 1) transform problem (<ref>) into a deterministic one based on SAA <cit.>, and to 2) deal with the deterministic problem by well-known WMMSE-rate relationship <cit.>. Details of the two-step transformation will be illustrated in Section <ref>. \n\n\n\n\n §.§ Two-Step Transformation\n\n\n\n\n  §.§.§ SAA\n To facilitate SAA, we give the following definition.\n\n    Given an estimate 𝐐_k of user k, a sample of i.i.d. channel realizations is constructed based on the set \n    ℚ_k = {𝐐^a_k = 𝐐_k + 𝐐_k^a | 𝐐_k, ∀ a∈𝒜 = {1,…,A}},\n    where 𝐐_k^a follows the CSCG distribution, i.e., 𝗏𝖾𝖼(𝐐_k^a)∼𝒞𝒩(0,δ_k^2𝐈_MN), ∀ a∈𝒜. Then the SAA of average common and private rates are, respectively, defined as R_c,k = 1/A∑_aR_c,k^a and R_p,k = 1/A∑_aR_p,k^a, ∀ k∈𝒦[In the following illustrations, notations with superscript “(·)^a” have the same expressions as that without “(·)^a”, except that the term 𝐐_k is replaced by 𝐐_k^a, ∀ k∈𝒦_l, ∀ l∈ℒ, ∀ a∈𝒜.].\n\nThe SAA of average rate in Definition 2 is a tight approximation of the average rate with sufficient large number of samples, i.e., lim_A→∞R_c,k = R̅_c,k, lim_A→∞R_p,k = R̅_p,k, ∀ k∈𝒦, which motivates us to approximate the stochastic problem (<ref>) into a deterministic problem\n\n    max_{𝐏,𝐜̅},{ϕ_l,∀ l}     ∑_kC̅_k + ∑_kR_p,k\n    s.t.          (<ref>), (<ref>), (<ref>), \n       ∑_k'C̅_k'≤R_c,k, ∀ k,\n       C̅_k + R_p,k≥ R_th,k, ∀ k.\n\nProblem (<ref>) can be further transformed into a more tractable form based on the following step. \n\n\n\n  §.§.§ WMMSE-Rate Relationship\n\nLet s_c,k^a = g_c,k^ay_k^a be the estimate of s_c with equalizer g_c,k^a from user k covered by sector l, ∀ k∈𝒦_l, ∀ l∈ℒ, ∀ a∈𝒜. \nThe estimate of s_p,k with equalizer g_p,k^a after removing the common stream is given by s_p,k^a = g_p,k^a(y_k^a - ϕ_l^T(𝐐_k^a)^H𝐩_cs_c), ∀ k∈𝒦_l, ∀ l∈ℒ, ∀ a∈𝒜.\nDefine MSE functions regarding the common and private streams for user k covered by sector l at channel sample a as ϵ_c,k^a = 𝔼{|s_c,k^a - s_c|^2} = |g_c,k^a|^2τ_c,k^a -2{g_c,k^aϕ_l^T(𝐐_k^a)^H𝐩_c} + 1 and ϵ_p,k^a = 𝔼{|s_p,k^a - s_p,k|^2} = |g_p,k^a|^2τ_p,k^a -2{g_p,k^aϕ_l^T(𝐐_k^a)^H𝐩_p,k} + 1.\nThen optimal unconstrained equalizers for the common stream and private streams which achieve minimum MSEs are given by \n\n    (g_c,k^a)^⋆ = 𝐩_c^H𝐐_k^aϕ_l^*/τ_c,k^a,  \n            (g_p,k^a)^⋆ = 𝐩_p,k^H𝐐_k^aϕ_l^*/τ_p,k^a,\n \nand the corresponding minimum MSEs are (ϵ_o,k^a)^⋆ = min_g_o,k^aϵ_o,k^a = (τ_o,k^a)^-1ι_o,k^a = (1 + γ_o,k^a)^-1, ∀ o∈{c,p}, ∀ k∈𝒦, ∀ a∈𝒜.\nIntroducing weights λ_c,k^a∈ℝ^+ and λ_p,k^a∈ℝ^+ associating common and private MSEs for user k, we can establish the WMMSE-rate relationship R_o,k^a = max_λ_o,k^alog_2λ_o,k^a - λ_o,k^a(ϵ_o,k^a)^⋆ + 1, ∀ o∈{c,p}, ∀ k∈𝒦, ∀ a∈𝒜,\nwhere the maximum of the right-hand problem is achieved when weights λ_c,k and λ_p,k satisfy\n\n    (λ_c,k^a)^⋆ = 1 + γ_c,k^a,  (λ_p,k^a)^⋆ = 1 + γ_p,k^a.\n\n\nBased on the above derivations, we reformulate problem (<ref>) as a three-block optimization \n\n    \n    \n    max_{λ_o^a, 𝐠_o^a,∀ a,∀ o}\n    {𝐏,𝐜̅}, {ϕ_l,∀ l}   ∑_k(C̅_k\n            + 1/A∑_a(log_2λ_p,k^a-λ_p,k^aϵ_p,k^a))\n    s.t.        (<ref>), (<ref>), (<ref>),\n       1/A∑_a(log_2λ_c,k^a-λ_c,k^aϵ_c,k^a+1)\n            ≥∑_k'C̅_k', ∀ k,\n       C̅_k + 1/A∑_a(log_2λ_p,k^a-λ_p,k^aϵ_p,k^a+1)\n            ≥ R_th,k, ∀ k,\n\n\nwhere λ_o^a = [λ_o,1^a,…,λ_o,K^a]^T and 𝐠_o^a = [g_o,1^a,…,g_o,K^a]^T, ∀ o∈{c,p}, ∀ a∈𝒜. \nAlthough problem (<ref>) is not convex in a joint design manner, the sub-problem regarding one block with fixing other blocks is either convex, such as the design of blocks {λ_o^a, 𝐠_o^a,∀ o, ∀ a} and {𝐏,𝐜̅}, or more tractable, such as the design of block {ϕ_l,∀ l∈ℒ}, than directly dealing with the original objective. Specifically, the unconstrained solution to block {λ_o^a, 𝐠_o^a, ∀ o, ∀ a} with fixed two other blocks have been given in equations (<ref>) and (<ref>), respectively. Solutions to blocks {𝐏,𝐜̅} and {ϕ_l,∀ l} will be respectively given in Sections <ref> and <ref>.\n\n\n\n §.§ Solution to Block {𝐏,𝐜̅}\n\n\nWith fixed equalizers, weights, and BD-RIS matrix, the sub-problem regarding block {𝐏,𝐜̅} is given by \n\n    min_{𝐏,𝐜̅}     1/A∑_k∑_aλ_p,k^aϵ_p,k^a - ∑_kC̅_k\n    s.t.      (<ref>), (<ref>), (<ref>), (<ref>).\n\nWith the following definitions \n\n    \n    ψ_c,k^a    = λ_c,k^a(g_c,k^a)^*𝐐_k^aϕ_l^*,  ψ_p,k^a = λ_p,k^a(g_p,k^a)^*𝐐_k^aϕ_l^*,\n    \n            Ψ_c,k^a    = ψ_c,k^a(ψ_c,k^a)^H/λ_c,k^a,  Ψ_p,k^a = ψ_p,k^a(ψ_p,k^a)^H/λ_p,k^a,\n    \n            ξ_c,k^a    = log_2λ_c,k^a - λ_c,k^a|g_c,k^a|^2σ_k^2 - λ_c,k^a + 1,\n    ξ_p,k^a    = log_2λ_p,k^a - λ_p,k^a|g_p,k^a|^2σ_k^2 - λ_p,k^a + 1,\n\n\nand their averages over A samples, i.e., ψ_c,k = 1/A∑_aψ_c,k^a, ψ_p,k = 1/A∑_aψ_p,k^a, Ψ_c,k = 1/A∑_aΨ_c,k^a, Ψ_p,k = 1/A∑_aΨ_p,k^a, ξ_c,k = 1/A∑_aξ_c,k^a, ξ_p,k = 1/A∑_aξ_p,k, ∀ k∈𝒦,\nproblem (<ref>) can be rewritten as \n\n    \n    \n    min_𝐜̀,𝐩_c,{𝐩_p,k,∀ k}   ∑_k(C̀_k+∑_k'𝐩_p,k'^HΨ_p,k𝐩_p,k'\n           - 2{ψ_p,k^H𝐩_p,k})\n    s.t.       𝐩_c_2^2 + ∑_k𝐩_p,k_2^2 ≤ P,\n       𝐩_c^HΨ_c,k𝐩_c + ∑_k'𝐩_p,k'^HΨ_c,k𝐩_p,k'\n        -2{ψ_c,k^H𝐩_c}≤∑_k'C̀_k + ξ_c,k,∀ k,\n       𝐜̀≼0,\n       ∑_k'𝐩_p,k'^HΨ_p,k𝐩_p,k'- 2{ψ_p,k^H𝐩_p,k}\n         + C̀_k≤ξ_p,k - R_th,k, ∀ k,\n\n\nwhere 𝐜̀ = [C̀_1,…,C̀_K]^T = -𝐜̅. Problem (<ref>) is a convex second-order cone program (SOCP) and can be solved by interior-point methods with computational complexity bounded by 𝒪((NK+N+K)^3.5) <cit.>.\n\n\n\n §.§ Solution to Block {ϕ_l,∀ l}\n\n\nRecall that (<ref>) in problem (<ref>) is the QoS constraint, which can be guaranteed in the design of block {𝐏,𝐜̅}. To simplify the design of block {ϕ_l,∀ l}, we temporarily ignore constraint (<ref>). Then, without the QoS constraint (<ref>), we can remove the term 𝐜̅ by putting constraint (<ref>) into the objective. In this case, the original problem (<ref>) can be simplified as the following form\n\n    \n    \n    max_{λ_o^a, 𝐠_o^a, ∀ o, ∀ a}\n    𝐏, {ϕ_l,∀ l}   {min_∀ k1/A∑_a(log_2λ_c,k^a-λ_c,k^aϵ_c,k^a+1)}\n       +1/A∑_k∑_a(log_2λ_p,k^a-λ_p,k^aϵ_p,k^a)\n    s.t.        (<ref>), (<ref>), (<ref>).\n\n\nWith given equalizers, weights, and the transmit precoder, the sub-problem regarding the multi-sector BD-RIS is \n\n    min_{ϕ_l,∀ l}    {max_∀ k1/A∑_a(λ_c,k^aϵ_c,k^a-log_2λ_c,k^a-1)}\n       + 1/A∑_a∑_kλ_p,k^aϵ_p,k^a\n    s.t.      ∑_l|ϕ_l,m|^2 = 1, ∀ m.\n\nWith the following definitions\n\n    \n    𝐯_c,k^a =    (𝐐_k^a)^T𝐩_c^*,   𝐯_p,k,k'^a = (𝐐_k^a)^T𝐩_p,k'^*, \n    𝐗_c,k^a =   λ_c,k^a|g_c,k^a|^2𝐯_c,k^a(𝐯_c,k^a)^H \n       + λ_c,k^a|g_c,k^a|^2∑_k'𝐯_p,k,k'^a(𝐯_p,k,k'^a)^H,\n    𝐗_p,k^a =   λ_p,k^a|g_p,k^a|^2∑_k'𝐯_p,k,k'^a(𝐯_p,k,k'^a)^H,\n    \n            𝐱_c,k^a =   λ_c,k^a(g_c,k^a)^*𝐯_c,k^a, 𝐱_p,k^a = λ_p,k^a(g_p,k^a)^*𝐯_p,k,k^a,\n\n\nand their averages over A samples, i.e., 𝐗_c,k = 1/A∑_a𝐗_c,k^a, 𝐗_p,k = 1/A∑_a𝐗_p,k^a, 𝐱_c,k = 1/A∑_a𝐱_c,k^a, 𝐱_p,k = 1/A∑_a𝐱_p,k^a, ∀ k∈𝒦, \nproblem (<ref>) can be rearranged as \n\n    min_{ϕ_l,∀ l}     {max_∀ k(ϕ_l^H𝐗_c,kϕ_l - 2{ϕ_l^H𝐱_c,k} - ξ_c,k)}\n       + ∑_l(ϕ_l^H𝐗̅_p,lϕ_l - 2{ϕ_l^H𝐱̅_p,l})\n    s.t.        ∑_l|ϕ_l,m|^2 = 1, ∀ m,\n\nwhere 𝐗̅_p,l = ∑_k'∈𝒦_l𝐗_p,k' and 𝐱̅_p,l = ∑_k'∈𝒦_l𝐱_p,k', ∀ l∈ℒ.\nWe observe from problem (<ref>) that the objective regarding each cell of the multi-sector BD-RIS is coupled with each other, while the constraints for different cells are independent of each other. This fact motivates us to successively design each cell while fixing the rest cells. Specifically, the design of one cell with fixed others will be given as follows.\n\nWe first formulate the sub-problem regarding cell m, ∀ m∈ℳ, with fixed other cells as \n\n    min_ϕ̅_m     {max_∀ kν_c,k,m|ϕ_l,m|^2 - 2{ϕ_l,m^*χ_c,k,m} - ξ_k,m_=f_c,k(ϕ_l,m)}\n        + ∑_lν_p,l,m|ϕ_l,m|^2 - 2{ϕ_l,m^*χ_p,l,m}_=f_p,l(ϕ_l,m)\n    s.t.      ϕ̅_m_2^2 = 1,\n\nwhere the fresh notations are respectively defined as \n\n    \n    \n    ν_c,k,m   = [𝐗_c,k]_m,m,  ν_p,l,m = [𝐗̅_p,l]_m,m,\n    χ_c,k,m   = ∑_n m[𝐗_c,k]_m,nϕ_l,n - [𝐱_c,k]_m,\n    χ_p,l,m   = ∑_n m[𝐗̅_p,l]_m,nϕ_l,n - [𝐱̅_p,l]_m,\n    ξ_k,m   = ξ_c,k - ∑_n m∑_n' m[𝐗_c,k]_n,n'ϕ_l,n^*ϕ_l,n'\n           + 2{∑_n mϕ_l,n^*[𝐱_c,k]_n},\n\n\nand ϕ̅_m = [ϕ_1,m,…,ϕ_L,m], ∀ m∈ℳ, ∀ k∈𝒦_l, ∀ l∈ℒ.\nProblem (<ref>) is a non-smooth optimization with a non-convex constraint. \nTo solve this problem, we 1) introduce the well-known LogSumExp (LSE) function to transform the non-smooth part of the objective function into a smooth form, and 2) adopt the manifold theory <cit.> to transform the constrained problem on the Euclidean space into an unconstrained optimization on the manifold space. Each of the two steps is described as follows. \n\n\n\nStep 1: LSE Approximation. To facilitate the LSE approximation, we give the following definition. \n\n   Given a set 𝔽 = {f_c,k∈ℝ | ∀ k∈𝒦}, an LSE function is defined as the logarithm of the sum of the exponentials of f_c,k, ∀ k∈𝒦, i.e., log∑_kexp(f_c,k), which is a smooth approximation of the maximum max_∀ kf_c,k with a lower bound max_∀ kf_c,k and an upper bound max_∀ kf_c,k + log|𝒦|, i.e., max_∀ kf_c,k≤log∑_kexp(f_c,k)≤max_∀ kf_c,k + log|𝒦|.  \n\nWith Definition 3, we can obtain an approximation to the maximum max_∀ k f_c,k(ϕ_l,m) in problem (<ref>), which has the following bounds \n\n    max_∀ k f_c,k(ϕ_l,m)    (a)≤εlog∑_kexp(f_c,k(ϕ_l,m)/ε)_=f̅(ϕ̅_m)\n       (b)≤max_∀ k f_c,k(ϕ_l,m) + εlog|𝒦|,\n\nwhere (a) achieves its equality when |𝒦| = 1 and (b) achieves its equality when f_c,1(ϕ_l,m) =…= f_c,K(ϕ_l,m), ∀ k∈𝒦. f̅(ϕ̅) is the LSE function of max_∀ kf_c,k(ϕ_l,m) with ε>0 a scalar to make the bounds tighter[Based on Definition 1, by replacing each f_c,k with f_c,k/ε, ∀ k∈𝒦, we have max_∀ kf_c,k/ε≤log∑_kexp(f_c,k/ε)≤max_∀ kf_c,k/ε + log|𝒦|. Multiplying by ε gives the inequality (<ref>).]. Based on (<ref>), problem (<ref>) can be approximated as \n\n    ϕ̅_m^⋆ = min_ϕ̅_m_2^2 = 1 ∑_l f_p,l(ϕ_l,m) + f̅(ϕ̅_m)_=f(ϕ̅_m).\n\nNow problem (<ref>) has a smooth objective function f(ϕ̅_m) and only one constraint, which can be solved by the manifold method <cit.> as illustrated below. \n\n\nStep 2: Manifold Construction. \nWe give the following definition to construct the feasible region of problem (<ref>), i.e., ϕ̅_m_2^2 = 1, as a manifold <cit.>, <cit.>. \n\n    An L-dimensional complex sphere manifold is defined as 𝕄 = {ϕ̅_m∈ℂ^1× L: ϕ̅_m_2 = 1}, where ϕ̅_m is a point on the complex sphere manifold 𝕄. \n    Given a point ϕ̅_m on 𝕄, a tangent vector refers to one possible moving direction of this point. The set of these tangent vectors regarding point ϕ̅_m forms the tangent space, which is mathematically defined as 𝕋_ϕ̅_m𝕄 = {𝐮_m∈ℂ^1× L: {𝖳𝗋(ϕ̅_m^H𝐮_m)} = 0}. \n    Among all these tangent vectors on 𝕋_ϕ̅_m𝕄, Riemannian gradient is defined as the tangent vector with the steepest-descent direction of the objective function.\n\n\nWith Definition 4, we say ϕ̅_m is a point on the complex sphere manifold 𝕄, yielding problem (<ref>) an unconstrained optimization on 𝕄, which can be solved by many classic algorithms with necessary projections. \nThe algorithm we use here to solve problem (<ref>) is the Riemannian conjugate gradient (RCG) algorithm <cit.>, which is a modified version of the well-known CG algorithm by changing the search space from the Euclidean space to a manifold.  \nMore details of the RCG algorithm is summarized in the Appendix.\n\nSummary: With solutions to each cell of the multi-sector BD-RIS, the procedure of the  successive design is straightforward and summarized in Algorithm <ref>. \nThe complexity of Algorithm <ref> is given by 𝒪(I_1L^1.5), where I_1 is the number of iterations of Algorithm <ref>.\n\n\n\n\n\n\n\n\n §.§ Algorithm and Analysis\n \n\n\n  §.§.§ Framework of the Algorithm\n \nThe above three blocks are updated in an iterative manner until convergence as summarized in Algorithm <ref>.\n\n\n\n\n\n\n\n  §.§.§ Initialization\n \nIn Algorithm <ref>, ϕ_l, ∀ l∈ℒ are initialized as ϕ_l^0 = 1/√(L)[e^φ_l,1,…,e^φ_l,M]^T, where φ_l,m is randomly selected within the range [0,2π],  ∀ l∈ℒ, ∀ m∈ℳ. The transmit power allocated to the common streams is initialized as P_c = 0.7P, and thus that allocated to the private streams is P_p = 0.3P. Accordingly, the common precoder is initialized as 𝐩_c = ∑_a∑_k𝐐_k^aϕ_l^*, followed by a normalization 𝐩_c^0 = √(P_c)𝐩_c/𝐩_c_2. The private precoder is initialized as 𝐩_p,k = ∑_a𝐐_k^aϕ_l^*, followed by 𝐩_p,k^0 = √(P_p/K)𝐩_p,k/𝐩_p,k_2, ∀ k∈𝒦.\n\n\n\n\n  §.§.§ Complexity Analysis\n\nThe complexity of Algorithm <ref> mainly comes from the update of three blocks (steps 4-7). Specifically, updating block {λ_o^a,𝐠_o^a, ∀ o, ∀ a} requires complexity 𝒪(MNKLA). Updating block {𝐏,𝐜̅} by solving SOCP has complexity 𝒪((NK+N+K)^3.5), while updating block {ϕ_l,∀ l} by Algorithm <ref> requires 𝒪(I_1L^1.5). The overall complexity of Algorithm <ref> is thus 𝒪(I(NK+N+K)^3.5), where I is the number of iterations of Algorithm <ref> to achieve the convergence threshold. \n\n\n\n\n§ PERFORMANCE EVALUATION\n\n\n\nIn this section, we evaluate the performance of the proposed robust beamforming design for multi-sector BD-RIS aided RSMA under different CSI conditions. Particularly, we first illustrate the simulation settings. Then, we show convergence of the proposed algorithm. Finally, we evaluate the achievable ergodic sum-rate performance of multi-sector BD-RIS aided RSMA by analyzing the impact of the radiation pattern of BD-RIS antennas, CSI uncertainty, QoS threshold, and numbers of active/passive antennas. \n\n\n\n §.§ Simulation Setup\n\n\nThe perfect channels 𝐐_k = √(ζ_k^-1)𝐆̆^H𝖽𝗂𝖺𝗀(𝐡̆_k), ∀ k∈𝒦 are generated as a combination of small-scale fading and large-scale fading.\nSpecifically, the small-scale fading of transmitter-RIS and RIS-user channels is modeled as Rician fading, i.e.,\n\n    \n    𝐆̆   = √(κ/κ + 1)𝐆̆^LoS + √(1/κ + 1)𝐆̆^NLoS, \n    𝐡̆_k    = √(κ_k/κ_k + 1)𝐡̆_k^LoS + √(1/κ_k + 1)𝐡̆_k^NLoS, ∀ k,\n\n\nwhere {κ,κ_k,∀ k} denotes the Rician factor, and channels with superscript “LoS” and “NLoS”, respectively, denote line-of-sight (LoS) and non-LoS (NLoS) channels.\nζ_k is the path loss exponent measuring the large-scale fading. The large-scale fading components have different expressions when BD-RIS antennas have different radiation patterns. Here we consider two cases, that is each BD-RIS antenna has either idealized radiaton pattern or practical radiation pattern <cit.>, which are illustrated in Fig. <ref> from the top view, yielding the following path loss model:\n\n    ζ_k = ϱ (1-cosπ/L)^2,    Idealized Pattern,\n    ϱ/(α_L+1)^2(cosθ_ITcosθ_IU,k)^α_L,    Practical Pattern,\n\nwhere ϱ = 4^3π^4d_IT^ϵ_ITd_IU,k^ϵ_IU/λ^4G_TG_U is calculated by transmiter-RIS distance d_IT, RIS-user distance d_IU,k, ∀ k∈𝒦, path loss exponents[The value of the path loss exponent is usually chosen within the range [2,4] and depends on the small-scale fading conditions.] ϵ_IT and ϵ_IU, wavelength of transmit signal λ, transmit antenna gain G_T and receive antenna gain G_R. In addition,  α_L is a parameter related to the beamwidth of the BD-RIS antennas, θ_IT is the elevation angle between the transmit antenna and BD-RIS antenna, and θ_IU,k is the elevation angle from the BD-RIS antenna to user k, ∀ k∈𝒦.\nSectors of the multi-sector BD-RIS are modeled as M_x× M_y = M uniform planar arrays and the transmitter is modeled as a uniform linear array with half-wavelength inter-antenna spacing. \nLocations among the transmitter, multi-sector BD-RIS, and users are shown in Fig. <ref>.\n\n\n\n\n\n\nThe channel estimation error for each channel realization 𝐐_k is generalized such that 𝗏𝖾𝖼(𝐐̃_k)∼𝒞𝒩(0,δ_k^2𝐈_MN), where the channel estimation uncertainty δ^2_k is set as δ^2_k = ζ_k^-1δ^2, ∀ k∈𝒦 with a scalar δ∈[0,1). Specifically, the value δ = 0 refers to the perfect CSI case.  \nFor each channel estimate 𝐐_k = 𝐐_k - 𝐐_k, the a-th sample in the set (available at the transmitter) ℚ_k is given by 𝐐^a_k = 𝐐_k + 𝐐_k^a, where 𝐐_k^a follows the same error distribution, that is 𝗏𝖾𝖼(𝐐_k^a)∼𝒞𝒩(0,δ_k^2𝐈_MN),  ∀ k∈𝒦, ∀ a∈𝒜.\nFor each channel realization, the precoder and BD-RIS are designed based on sets ℚ_k, ∀ k∈𝒦 and the maximization of the average sum-rate as summarized in Algorithm <ref>, while the sum-rate is calculated based on the perfect instantaneous channel 𝐐. \nThe ergodic sum-rate is plotted as an average of sum-rates for 50 perfect channel realizations. \nThe simulation settings, unless otherwise stated, are summarized in Table <ref>. \n\n\n\n\n\n\n\n\n\n\n §.§ Convergence of the Algorithm\n\nThe convergence of Algorithm <ref> cannot be theoretically proved since the design of BD-RIS matrix block does not lead to a global optimal solution. Instead, we provide numerical results to show the proposed algorithm can converge within limited iterations.\nFig. <ref> plots the average sum-rate versus the number of iterations of Algorithm <ref>.\nWe can observe from Fig. <ref> that the proposed algorithm always converges within finite iterations regardless of simulation settings, such as channel conditions (perfect and imperfect CSI), the number of transmit antennas, and QoS requirements. \n\n\n\n\n\n\n\n\n §.§ Impact of the Radiation Pattern of BD-RIS Antennas\n\nWe first evaluate the ergodic sum-rate of multi-sector BD-RIS aided RSMA when BD-RIS antennas have either idealized or practical radiation patterns in Fig. <ref>. For comparison, we add the performance of multi-sector BD-RIS assisted SDMA, which is achieved by switching off the common precoder at the transmitter[In this case, the multi-sector BD-RIS design with given precoder is performed by using the closed-form solution proposed in <cit.>.]. We have the following observations from Fig. <ref>. 1) With the same multiple access technique, the idealized radiation pattern scheme always outperforms the practical radiation pattern scheme, which is in accordance with the results in <cit.>. 2) Using the same radiation pattern for each BD-RIS antenna, the RSMA scheme always outperforms the SDMA scheme. 3) Under imperfect CSI conditions, the BD-RIS aided RSMA with practical radiation pattern of BD-RIS antennas outperforms the BD-RIS aided SDMA with idealized radiation pattern for BD-RIS antennas. \nThis phenomenon demonstrates the benefits of integrating RSMA and multi-sector BD-RIS in easing the requirements to antenna realizations and to channel estimation accuracy. \n\n\n\n\n\n §.§ Impact of CSI Uncertainty\n\n\nIn Fig. <ref>, we evaluate the impact of CSI uncertainty by plotting the ergodic sum-rate versus δ when each BD-RIS has an idealized radiation pattern. We observe from Fig. <ref> that the ergodic sum-rate for both RSMA and SDMA schemes decreases with increasing channel estimation errors. However, the multi-sector BD-RIS aided RSMA always outperforms multi-sector BD-RIS aided SDMA regardless of CSI conditions, which demonstrates the robustness of the integration of RSMA and multi-sector BD-RIS in wireless communications. \n\n\n\n\n\n\n\n\n\n\n §.§ Impact of QoS Threshold\n\n\nThen, in Fig. <ref>, we show the impact of the QoS requirement for each user to the achievable ergodic sum-rate under different CSI conditions when each multi-sector BD-RIS antenna has an idealized radiation pattern. From Fig. <ref> we have the following observations. 1) The multi-sector BD-RIS aided RSMA always outperforms the SDMA scheme with various QoS thresholds and different CSI conditions. 2) The achievable ergodic sum-rate for both schemes decreases with the growth of the QoS requirement, which can be explained as follows. Since we focus on the sum-rate maximization problem, when the number of transmit antennas is smaller than the number of users (4 = N < K = 6), the weakest N-K users tend to be turned off. In this case, increasing the QoS requirement for all users violates the aim of maximizing sum-rate. \n3) The performance gap between the RSMA scheme and the SDMA scheme becomes larger with increasing QoS threshold for each user, and thus the RSMA scheme is able to achieve both higher sum-rate and better QoS than the SDMA case, e.g., the comparison between RSMA scheme with R_th = 0.5 and SDMA scheme with R_th = 0.1.  \nThis is because in RSMA scheme, the power allocated to the common precoders increases with the QoS requirement. \nThis phenomenon demonstrates that the common precoders play an increasingly important role to guarantee the fairness while achieving better sum-rate performance. \n\n\n\n\n\n\n\n\n\n\n\n §.§ Impact of Numbers of Active and Passive Antennas\n\n\nIn Fig. <ref>, we plot the ergodic sum-rate versus the total number of antennas of the multi-sector BD-RIS under different CSI conditions when each BD-RIS antenna has an idealized radiation pattern. We observe from Fig. <ref> that the ergodic sum-rate of both RSMA and SDMA schemes grows with increasing number of BD-RIS antennas, and that the RSMA scheme always achieves better performance than the SDMA scheme. More importantly, to achieve the same sum-rate, the required number of passive antennas can be reduced compared to the SDMA scheme by adopting RSMA at the transmitter. \nFor example, in perfect CSI case, to achieve an ergodic sum-rate of 15 b/s/Hz, the required number of passive antennas can be reduced by 16%; in imperfect CSI case, to achieve an ergodic sum-rate of 13 b/s/Hz, the required number can be reduced by 14%. This observation highlights the benefit of synergizing BD-RIS and RSMA in saving on passive antennas, which is friendly to the hardware implementation of multi-sector BD-RIS. \n\n\n\nFinally, in Fig. <ref>, we plot the ergodic sum-rate versus the number of transmit antennas under different CSI conditions. \nSimilar conclusions that the RSMA scheme always outperforms the SDMA scheme can be obtained from Fig. <ref>. \nMore importantly, to achieve the same sum-rate, the required number of active antennas at the transmitter can also be reduced compared to the SDMA scheme when RSMA is adopted at the transmitter. For example, an 1-antenna RSMA-enabled transmittersupports the same sum-rate performance as an 2-antenna SDMA-enabled transmitter. \nSuch reduction of the number of transmit antennas demonstrates the benefit of synergizing BD-RIS and RSMA in reducing power consumption and cost, which leads to an energy efficiency gain.    \n\n\n\n\n\n§ CONCLUSION\n\n\n\nIn this work, we consider the integration of multi-sector BD-RIS and RSMA in a MU-MISO communication system. \nSpecifically, we assume a multi-sector BD-RIS and an RSMA-enabled transmitter. \nGiven that the channel estimation for RIS and BD-RIS aided scenarios is challenging, we model the channel estimation error when only partial/imperfect CSI is available at the transmitter. \n\nWith the multi-sector BD-RIS aided RSMA model and CSI uncertainty model, we propose a robust design to jointly optimize the transmit precoder and multi-sector BD-RIS for a MU-MISO system. Specifically, SAA and WMMSE-rate relationship are adopted to transform the stochastic problem into a more tractable deterministic multi-block problem. Regarding the design of the BD-RIS matrix block, we adopt the RCG algorithm after transforming the corresponding problem into a smooth optimization.\n\nFinally, we present simulation results, which demonstrate the performance enhancement of multi-sector BD-RIS aided RSMA compared to multi-sector BD-RIS aided SDMA with different radiation pattern of BD-RIS antennas and various parameter settings, such as CSI conditions and QoS threshold for users. \nMore importantly, with given sum-rate requirement, the numbers of active and passive antennas can be effectively reduced by synergizing RSMA with multi-sector BD-RIS. Such reduction of the number of antennas is beneficial for practical implementations. \n\n\n\n[The RCG Algorithm to Solve Problem (<ref>)]\nRecall that RCG is the modified version of the well-known CG, the key of which is to determine the descent direction of the objective function. \nIn RCG, the Riemannian gradient, which can be obtained from the Euclidean gradient, is required to calculate the descent direction. Therefore, we first calculate the Euclidean gradient of the objective function \n\n    f(ϕ̅_m)    = ∑_l f_p,l(ϕ_l,m) + f̅(ϕ̅_m)\n       = ∑_l f_p,l(ϕ_l,m) + εlog∑_kexp(f_c,k(ϕ_l,m)/ε),\n \nwhich is given by\n\n    \n    ▿ f(ϕ̅_m)    = [∂ f(ϕ̅_m)/∂ϕ_1,m, …, ∂ f(ϕ̅_m)/∂ϕ_L,m]\n       = [▿ f_p,1(ϕ_1,m) + ∂f̅(ϕ̅_m)/∂ϕ_1,m,\n            …, ▿ f_p,L(ϕ_L,m) + ∂f̅(ϕ̅_m)/∂ϕ_L,m],\n    ▿ f_p,l(ϕ_l,m)    = 2ν_p,l,mϕ_l,m - 2χ_p,l,m,\n    ∂f̅(ϕ̅_m)/∂ϕ_l,m   = ∑_k∈𝒦_lexp(f_c,k(ϕ_l,m)/ε)▿ f_c,k(ϕ_l,m)/∑_k∈𝒦exp(f_c,k(ϕ_l,m)/ε), \n    ▿ f_c,k(ϕ_l,m)    = 2ν_c,k,mϕ_l,m - 2χ_c,k,m.\n\n\nThen, we obtain the Riemannian gradient, which projects the Euclidean gradient onto the tangent space, i.e., ▿_𝕄 f(ϕ̅_m) = 𝖯𝗋_ϕ̅_m(▿ f(ϕ̅_m)) = ▿ f(ϕ̅_m) - {𝖳𝗋(ϕ̅_m^H▿ f(ϕ̅_m))ϕ̅_m}. \nThe descent direction at the v-th iteration of RCG is thus\n\n    β^v = -▿_𝕄 f(ϕ̅_m^v) + μ^v𝖯𝗋_ϕ̅_m(β^v-1),\n \nwhere μ^v is the Riemannian version of the Polak-Ribière formula <cit.>, which is given by\n\n    μ^v = ⟨▿_𝕄 f(ϕ̅_m^v), ▿_𝕄 f(ϕ̅_m^v)-𝖯𝗋_ϕ̅_m^v(▿_𝕄 f(ϕ̅_m^v-1))⟩/⟨▿_𝕄 f(ϕ̅_m^v-1), ▿_𝕄 f(ϕ̅_m^v-1)⟩,\n\nwhere ⟨𝐀,𝐁⟩ = {𝖳𝗋(𝐀^H𝐁)}. \nThe v+1-th update is given by a retraction function mapping point ϕ̅_m^v on the tangent space 𝕋_ϕ̅_m^v𝕄 to the manifold 𝕄, that is <cit.>\n\n    ϕ̅_m^v+1 = ϕ̅_m^v + ς^vβ^v/ϕ̅_m^v + ς^vβ^v_2,\n\nwhere ς^v is the stepsize obtained by Armijo backtracking <cit.>.\n\nTo summarize, problem (<ref>) can be solved by iteratively updating the stepsize, the retraction, the Polak-Ribière formula, and the search direction as illustrated above, until convergence.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIEEEtran\n\n\n"}