{"entry_id": "http://arxiv.org/abs/2303.06903v1", "published": "20230313074109", "title": "Resource-efficient Direct Characterization of General Density Matrix", "authors": ["Liang Xu", "Mingti Zhou", "Runxia Tao", "Zhipeng Zhong", "Ben Wang", "Zhiyong Cao", "Hongkuan Xia", "Qianyi Wang", "Hao Zhan", "Aonan Zhang", "Shang Yu", "Nanyang Xu", "Ying Dong", "Changliang Ren", "Lijian Zhang"], "primary_category": "quant-ph", "categories": ["quant-ph", "physics.optics"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nthese authors contribute equally to this work\nResearch Center for Quantum Sensing, Zhejiang Lab, Hangzhou 310000, China\n\nthese authors contribute equally to this work\nResearch Center for Quantum Sensing, Zhejiang Lab, Hangzhou 310000, China\n\nthese authors contribute equally to this work\nResearch Center for Quantum Sensing, Zhejiang Lab, Hangzhou 310000, China\n\nResearch Center for Quantum Sensing, Zhejiang Lab, Hangzhou 310000, China\n\nNational Laboratory of Solid State Microstructures, Key Laboratory of Intelligent Optical Sensing and Manipulation, College of Engineering and Applied Sciences, and Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing 210093, China\n\nSchool of Electronic Control, Chang’an University, Xi’an 710064, China\n\nNational Laboratory of Solid State Microstructures, Key Laboratory of Intelligent Optical Sensing and Manipulation, College of Engineering and Applied Sciences, and Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing 210093, China\n\nNational Laboratory of Solid State Microstructures, Key Laboratory of Intelligent Optical Sensing and Manipulation, College of Engineering and Applied Sciences, and Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing 210093, China\n\nNational Laboratory of Solid State Microstructures, Key Laboratory of Intelligent Optical Sensing and Manipulation, College of Engineering and Applied Sciences, and Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing 210093, China\n\nQuantum Optics and Laser Science, Blackett Laboratory, Imperial College London, Prince Consort Rd, London SW7 2AZ, United Kingdom\n\nQuantum Optics and Laser Science, Blackett Laboratory, Imperial College London, Prince Consort Rd, London SW7 2AZ, United Kingdom\n\n\nResearch Center for Quantum Sensing, Zhejiang Lab, Hangzhou 310000, China\n\nyingdong@zhejianglab.com\nResearch Center for Quantum Sensing, Zhejiang Lab, Hangzhou 310000, China\n\nrenchangliang@hunnu.edu.cn\nKey Laboratory of Low-Dimensional Quantum Structures and Quantum Control of Ministry of Education,Key Laboratory for Matter Microstructure and Function of Hunan Province,\nDepartment of Physics and Synergetic Innovation Center for Quantum Effects and Applications,Hunan Normal University, Changsha 410081, China\n\nlijian.zhang@nju.edu.cn\nNational Laboratory of Solid State Microstructures, Key Laboratory of Intelligent Optical Sensing and Manipulation, College of Engineering and Applied Sciences, and Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing 210093, China\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSequential weak measurements allow the direct extraction of individual density-matrix elements instead of globally reconstructing the whole density matrix, opening a new avenue for the characterization of quantum systems. Nevertheless, the requirement of multiple coupling for each qudit of quantum systems and the lack of appropriate precision evaluation constraint its applicability extension, especially for multi-qudit quantum systems. Here, we propose a resource-efficient scheme (RES) to directly characterize the density matrix of general multi-qudit systems, which not only optimizes the measurements but also establishes a feasible estimation analysis. In this scheme, an efficient observable of quantum system is constructed such that a single meter state coupled to each qudit is sufficient to extract the corresponding density-matrix element. An appropriate model based on the statistical distribution of errors are used to evaluate the precision and feasibility of the scheme. We experimentally apply the RES to the direct characterization of general single-photon qutrit states and two-photon entangled states. The results show that the RES outperforms the sequential schemes in terms of efficiency and precision in both weak- and strong- coupling scenarios. This work sheds new light on the practical characterization of large-scale quantum systems and investigation of their non-classical properties.\n\n\n\n\n\n\n\nResource-efficient Direct Characterization of General Density Matrix\n    Lijian Zhang\n    March 30, 2023\n====================================================================\n\n\n\nIntroduction.–The density matrix fully describes a quantum system (QS), including its intrinsic properties and how it interacts with other systems. The characterization of the density matrix, especially the off-diagonal elements, is crucial for revealing the non-classical properties of quantum systems <cit.> and underpinning advanced quantum technologies <cit.>. Quantum state tomography (QST) is a standard approach to globally reconstruct the whole density matrix based on the informationally-complete measurement results. However, both the experimental difficulties in implementing informationally-complete quantum measurements and the computational complexity of reconstruction algorithm dramatically increase with growing dimension of quantum systems, making the QST impractical for the characterization of large-scale quantum states. Though many attempts have been made to improve the feasibility of QST <cit.>, the characterization of the entire density matrix would be inefficient when a few specific density-matrix elements are sufficient to reveal certain properties e.g., entanglement <cit.> and coherence <cit.>. \n\nRecently, weak measurement followed by post-selection makes it possible to directly measure the quantum wavefunction of pure states <cit.> as well as the quasi-probability distribution of general mixed states <cit.>, which is equivalent to the density matrix through linear transformation <cit.>. In particular, the density-matrix elements can be directly characterized by sequential measurements of complementary observables <cit.>. Given the significant advantages in the reduced number of measurement basis and the avoidance of the reconstruction algorithm, the direct characterization scheme has also been generalized to quantum processes <cit.> and quantum detectors <cit.>. However, the current direct characterization of density matrix relies on sequential coupling processes for each qudit of quantum systems, which largely restricts its efficiency and scalability to multi-particle and high-dimensional quantum states <cit.>. Thus, the up-to-date direct characterization of high-dimensional or two-photon density matrix has to resort to introducing certain assumptions or utilizing extra quantum resources <cit.>. Beyond that, the extraction of high-order correlation information during the sequential weak measurements leads to large statistical errors <cit.>. A rigorous framework based on strong measurements has also been developed to improve the characterization precision <cit.>. Yet, such an approach may destroy the unique advantages of weak measurement in slight disturbance to the quantum systems. \n\n\n\nIn this paper, we propose a resource-efficient scheme (RES) to directly characterize the density-matrix elements of general multi-qudit quantum systems. An efficient observable is constructed through Hadamard transformations, which allows to extract the density-matrix element of interest with one coupling process for each qudit. We experimentally demonstrate the RES by directly characterizing the density matrix of single-photon qutrit states and two-photon entangled states during the unitary evolution and dephasing processes. Our results show that the RES achieves better precision than sequential schemes with fewer quantum measurements in two prevalent situations, where the coupling strength is weak or simultaneously optimized in terms of precision. \n\n\n\nTheoretical framework.–We first consider a general single-qudit (d-dimensional) QS described by the density matrix ρ = ∑_a,a^'ρ_a,a^'|a⟩⟨ a^'|. The diagonal element ρ_a,a can be easily obtained with the projective measurements π̂_a = |a⟩⟨ a| yielding ρ_a,a = Tr(ρπ̂_a). In sequential weak measurement scheme, the off-diagonal element ρ_a,a^' (a≠ a^') is associated with the average value Tr(M̂_a^',aρ) = ρ_a,a^' of the operator M̂_a^',a = dπ̂_a^'π̂_bπ̂_a, where π̂_b = |b⟩⟨ b| and |b⟩ =1/√(d)∑_a|a⟩. Practically, one sequentially couples the observables π̂_a and π̂_b with two independent meter states followed by the projector π̂_a^' for the post-selection <cit.>. The joint measurement on the post-selected meter states leads to the average value of M̂_a^',a. Here, we adopt an alternative decomposition of M̂_a^',a = π̂_a^'Ĉ_a,a^' to the product of the efficient observable Ĉ_a,a^' = |a⟩⟨ a^'| + |a^'⟩⟨ a| and the projector π̂_a^' for the post-selection. With this decomposition, the density-matrix element can be directly characterized through one coupling operation for each qudit to measure the efficient observable.\n\n\n\nFig. <ref> (A) shows how to directly characterize the density matrix of a single-qudit QS with the RES. In the red dashed box, we implement the coupling between the QS ρ and the single-qubit meter state (MS) |0⟩_m under the Hamiltonian Ĥ=gδ(t-t_0)Ĉ_a,a^'⊗σ̂_y, where g is the coupling strength and σ̂_y is the Pauli operator of the MS. The efficient observable Ĉ_a,a^' is constructed through the Hadamard transformation H_a,a^' on the ordinary observable Ô_a,a^'=|a⟩⟨ a| - |a^'⟩⟨ a^'| of the QS, given by Ĉ_a,a^' = Ĥ_a,a^'Ô_a,a^'Ĥ_a,a^'. After the coupling process Û = exp(-i∫Ĥdt), the system-meter joint state evolves to ρ_jt=Ûρ⊗ |0⟩_m⟨ 0| Û^†. Since a pair of post-selection projectors π̂_a^' and π̂_a correspond to the conjugate operators M̂_a^',a and M̂_a,a^', we perform both post-selection on the QS and obtain the final meter states ρ_m,a^'=Tr_s[π̂_a^'⊗_mρ_jt] and ρ_m,a, respectively, with the subscript s denoting the partial trace on the QS. In this way, the density-matrix element derived by the weak average ρ_a,a^' = [Tr(M̂_a^',aρ_jt) + Tr(M̂_a,a^'ρ_jt)']/2 can be extracted with the observables σ̂_+ = σ̂_x+iσ̂_y and σ̂_- =  σ̂_x - iσ̂_y of the post-selected meter states:\n\n    ρ_a,a^' = Tr(σ̂_+ρ_m,a^') + Tr(σ̂_-ρ_m,a)/2sin(2g).\n\n\nIn Fig. <ref> (B), we generalize our formalism to the direct characterization of N-qudit density matrix ρ^(N) = ∑_𝒮,𝒮^'ρ^(N)_𝒮,𝒮^'|𝒮⟩⟨𝒮^'|, where |𝒮⟩⟨𝒮^'| = |a_1,...,a_N⟩⟨ a_1^',...,a_N^'| and |a_n⟩ refers to the eigenstate of nth qudit. To directly characterize the off-diagonal element ρ_𝒮,𝒮^', we decompose the operator M̂_𝒮^',𝒮 = |𝒮^'⟩⟨𝒮| (and its conjugate M̂_𝒮,𝒮^') to the joint efficient observable Ĉ^(N) = ⊗_n=1^NĈ_n and the post-selection projector Π̂_𝒮^'^(N) = |𝒮^'⟩⟨𝒮^'| (Π̂_𝒮^(N)). The efficient observable Ĉ_n for nth qudit is divided into two cases: (i) if a_j ≠ a_j^', we choose Ĉ_j = |a_j⟩⟨ a_j^'| +|a_j^'⟩⟨ a_j| and the coupling process is in analogy to the single-qudit situation; (ii) if a_k = a_k^', Ĉ_k equals to _k and no coupling is required. The separate measurement of the observable Ĉ_j on each qudit with the identical coupling strength g leads to the Hamiltonian Ĥ^(N) = ∑_a_j ≠ a_j^' gδ(t-t_0) Ĉ_j⊗σ̂_y,j and the multiplied result yields the average value of Ĉ^(N). Assuming that there are totally l independent couplings of N-qudit system, i.e., l terms in Ĥ^(N), we get the joint state\n\n    ρ_jt^(N) = Û^(N)[ ρ^(N)⊗ (|0⟩_m⟨ 0|)^⊗ l]  Û^(N)†.\n\nwith the unitary Û^(N) = exp[-i∫Ĥ^(N)dt]. The following post-selection Π̂_𝒮^' or Π̂_𝒮 on the QS results in the final MS ρ_m,𝒮^' = Tr_s[Π̂_𝒮^'⊗^⊗ lρ_jt^(N)] or ρ_m,𝒮, respectively. The density-matrix element can be directly obtained by collective measurements on the MS:\n\n    ρ_𝒮,𝒮^'=Tr[⊗_a_j ≠ a_j^'σ̂_+,jρ_m,𝒮^'] + Tr[⊗_a_j ≠ a_j^'σ̂_-,jρ_m,𝒮]/2sin^l(2g).\n\n\nTo comprehensively evaluate the precision of the direct-characterization schemes, we analyze the statistical errors of the measured density-matrix elements with the quantum states uniformly sampled over the state space. Thus, the expected precision and the feasibility of the scheme can be inferred from the statistical distribution of errors. Due to the uniform sampling of single-qudit systems, both the real and the imaginary parts of all off-diagonal density-matrix elements stand on equal footing. Given that the sampled state ρ_d evolves from an initial state |0⟩⟨ 0| = (1,0,...,0)^T(1,0,...,0) under the unitary transformation V∈ U(d), we define the mean precision of single-qudit characterization\n\n    Δ^2_d = ∫ _V∈ U(d)δ^2 ρ_d dμ_d(V).\n\nby taking the integral of mean errors δ^2 ρ_d = 1/d(d-1)∑_a=0,a<a^'^d-1 [δ^2 Re(ρ_a,a^') + δ^2 Im(ρ_a,a^')] with respect to Harr measure μ_d(V). For N-qudit quantum systems, we start with the maximally entangled state, e.g., |Ψ_0⟩ = 1/√(d)∑_j=0^d-1 |a_j⟩_1...|a_j⟩_N and let nth qudit evolve under the unitary V_n∈ U(d) to acquire the arbitrary sampling state |Ψ_E⟩ = ⊗_n=1^N V_n |Ψ_0⟩. We focus on the density-matrix elements ρ^(N)_𝒮,𝒮^' satisfying a_n ≠ a_n^' for all n since such elements imply the coherence information among all particles. Therefore, we can get the mean precision of N-qudit characterization:\n\n    Δ^2_N,d = _V_n ∈ U_n(d)δ^2 ρ^(N)∏_n=1^N dμ_d(V_n),\n\nwhere δ^2 ρ^(N) = 2^N-1/d^N(d-1)^N∑_∀ n, a_n≠ a_n^'{δ^2 Re[ρ^(N)_𝒮,𝒮^'] + δ^2 Im[ρ^(N)_𝒮,𝒮^']}.\n\nExperiment.–The experimental setup for the preparation and direct characterization of single-qutrit states ρ_T is shown in Fig. <ref> (B). The heralded single photons generated in module (A) input S1 port and sequentially pass through a half-wave plate (HWP), a quarter-wave plate (QWP) and a polarizer to initialize the polarization to the horizontal state |H⟩. By referring to the optical paths {up, middle, bottom} as basis {|0⟩, |1⟩, |2⟩}, we prepare the pure qutrit state |ψ_T⟩ =  cos 2θ_1 cos 2θ_2 |0⟩ + cos2θ_1sin 2θ_2e^iϕ_2 |1⟩ + sin 2θ_1e^i(ϕ_1+ϕ_2) |2⟩ with the HWPs at θ_1, θ_2 and the phase retarders (PRs) at ϕ_1, ϕ_2 realizing polarization transformation as well as the polarizing beam displacers (PBDs) implementing beam splitting <cit.>. Additionally, the mixed states can be obtained by probabilistic mixture of specific pure states <cit.>. In the two boxes labelled `Ĥ_a,a^'', we perform the Hadamard transformations of qutrits Ĥ_a,a^' with the realization shown in blow dotted blocks <cit.>. After the first Hadamard transformation, we initialize the polarization of photons at all paths to |H⟩ as the MS. The interaction Hamiltonian Ĥ=gδ(t-t_0) Ô_a,a^'⊗σ̂_y is realized by rotating the HWPs at the path a (a^') to g/2 (-g/2) degrees. Given that both the Hadamard transformation and the post-selection on QS are commutable with the measurement of the MS, we first perform projective measurements on the MS with the combination of a QWP, a HWP and a polarizer. After the second Hadamard transformation, the distribution of photons at detectors D1, D2 and D3 are collected for the post-selection of the QS.\n\n\n\n\n\nIn Fig. <ref> (C), we directly characterize the arbitrary two-photon entangled states ρ_E by inputting two photons into S1 and S2 ports, respectively. Both photons undergo two identical setups in the dotted box `(M)' but the configuration depends on the density-matrix element of interest. Here, the polarization degree of freedom of photons is referred to as the QS. The first group of a QWP, a HWP and a QWP is used for compensating the polarization changes in fiber transmission <cit.>. Then, the arbitrary unitary transformation Û_1(2) on the polarization is realized with a group of a QWP, a HWP and a QWP <cit.>. The subsequent HWP (as well as the last HWP) at 22.5^∘ implements the Hadamard transformation on the polarization qubit. To facilitate the coupling between the QS and the MS, we transform the polarization information of photons to the path information through a PBD and the polarization of photons is used as the MS. The coupling operation and measurements on the MS are in analogy to the single-qutrit experiment. The coincidence rates, such as D4&D6, D4&D7, D5&D6 and D5&D7, are collected for the corresponding post-selection.\n\nResults.–The directly measured density-matrix elements of qutrit states during the unitary and dephasing processes are shown in Fig. <ref> (A) and (B), respectively. In the unitary evolution, we set the parameters θ_1 = arcsin(√(1/3))/2, θ_2 = π/8, ϕ_1 = ϕ_2 + π/3 and vary ϕ_2 from π/3 to 4π/3. By mixing specific pure states with different probability distribution, we equivalently let an original state ρ_T,0 with ϕ_2 = 2π/3 undergo the dephasing process 𝒩(|a⟩⟨ a^'|) = γ |a⟩⟨ a^' |, in which the off-diagonal elements are decreased to γ⟨ a|ρ_T,0|a^'⟩ <cit.>. In direct characterization of two-qubit systems, the two-photon entangled state ρ_E = |ψ_E⟩⟨ψ_E| is prepared by evolving one of the bell states |ψ_b⟩ = (|H⟩|V⟩ + |V⟩|H⟩) /√(2) under the composed unitary Û_1(2)⊗Û_2(2) with Û_n(2) = [ cos 2θ_n e^-iϕ_n1 -sin 2θ_n e^iϕ_n1; sin 2θ_n e^-iϕ_n2  cos 2θ_n e^iϕ_n1 ]. In Fig. <ref> (C), we illustrate the measured anti-diagonal elements of the density matrix ⟨ 00|ρ_E|11⟩ and  ⟨ 01|ρ_E|10⟩ with the parameters θ_11 = π/8, θ_21=ϕ_21=ϕ_22 = 0, ϕ_12 = ϕ_11+π/4 and varying ϕ_11 from 0 to π. In the following, the original state |ψ_E,0⟩ with ϕ_11=π/3 is chosen to evolve under the dephasing process 𝒩(|𝒮⟩⟨𝒮^'|) = γ |𝒮⟩⟨𝒮^'| realized by appropriately mixing certain unitary operations Û_1(2) and Û_2(2) <cit.>. The experimental results of anti-diagonal elements ⟨ 00|ρ_E|11⟩ and ⟨ 01|ρ_E|10⟩ in dephasing process are shown in Fig. <ref> (D). The error bars are smaller than the data points.\n\nIn Fig. <ref>, the precision of the RES and that of sequential scheme are compared with different coupling strength g. By assuming the total number of single photons or photon pairs per unit time n_t subjecting to Poisson distribution, we theoretically derive the mean precision of direct characterization with single copy of state n_tΔ^2_T  and n_tΔ^2_E for qutrit states and two-photon entangled states, respectively <cit.>. In the experiment, we randomly generate one hundred single-qutrit states |ψ_T⟩ = Û(3)|0⟩ or two-photon polarization states |ψ_E⟩ with the unitary operators Û(3), Û_1(2) and Û_2(2) sampled according to Harr measure. The experimental precision are obtained from the Monte Carlo simulation based on the raw data. The results show that the precision of both direct characterization schemes is improved with stronger coupling strength g. The optimal precision of the RES in characterizing both qutrits (g=π/4, n_tΔ^2_T = 0.125) and entangled states (g=π/4, n_tΔ^2_E = 0.208) is overall better than that of the sequential schemes with qutrits (g=π/2, n_tΔ^2_T = 0.708) and entangled states (g=π/2, n_tΔ^2_E = 0.458).\n\nDiscussion and conclusions.–From the insets (a) to (d) of Fig. <ref>, the statistical errors are non divergent confirming the feasibility of our scheme in characterizing the arbitrary quantum states. In weak-measurement scenario (i.e., g→ 0), the precision of the RES is several orders of magnitude better than that of sequential schemes with the ratio following g^2N for N-qudit systems. This advantage endows our scheme with better potential in studying weak-measurement problems, e.g., share of non-locality <cit.>, error-disturbance relationship <cit.> and etc <cit.>. With the qubit meter states used for the direct characterization of N-qudit systems, 2^2N or 2^3N projective measurements are typically performed for the resource-efficient or sequential schemes, respectively. Provided that the efficiency of direct characterization schemes is quantitatively compared by counting the total number of photons (or the equivalent time consumption) to achieve the same precision, the mean efficiency of the optimal RES is 11.3 or 8.8 times higher than that of the optimized sequential schemes for qutrit states or two-photon states, respectively.\n\n\n\nIn conclusion, we propose a RES which can be practically used to directly characterize the density matrix of general multi-qudit quantum systems. Compared to the multiple coupling operations in sequential schemes, our protocol only requires one coupling process to measure an efficient observable for each qudit in extracting a specific density-matrix element. We experimentally demonstrate the advantages of the RES over sequential schemes by directly characterizing single-qutrit states and two-photon entangled states with fewer measurements and better precision. These advantages will be significantly enhanced as the particle number increases in weak coupling scenario. When both the resource-efficient and sequential schemes are optimized in terms of precision over the coupling strength, the former scheme still demonstrates the efficiency advantage over the latter by about an order of magnitude. Our work provides a promising approach for the characterization and exploration of large-scale quantum systems with broad extension from integrated photonic chip to other physical systems. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis work was supported by China Postdoctoral Science Foundation (Grants No. 2022M722918, No. 2021M702976, No. 2020TQ0297 and No. 2020M681949), International Postdoctoral Exchange Fellowship Program 2022 (Grant No. PC2022049), National Natural Science Foundation of China (Grants No. 12204437, No. 61975077, No. 12075245,  No. 12247105 and No. 92265114), the Center initiated Research Project of Zhejiang Lab (Grant No. 2021MB0AL01), the Natural Science Foundation of Hunan Province (Grant No. 2021JJ10033), Xiaoxiang Scholars Project of Hunan Normal university, the National Key Research and Development Program of China (Grants No. 2018YFA0306202 and No. 2019YFA0308704) and Fundamental Research Funds for the Central Universities (Grant No. 020414380175).\n\n\n\n\n\n\n\n\n\n\n\n\n48\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[Horodecki et al.(2009)Horodecki, Horodecki, Horodecki, and  Horodecki]horodecki2009quantum\n  author author R. Horodecki, author P. Horodecki, author M. Horodecki, and author K. Horodecki, @noop  journal journal\n  Rev. Mod. Phys. volume 81, pages 865\n  (year 2009)NoStop\n[Modi et al.(2010)Modi,\n  Paterek, Son, Vedral, and  Williamson]modi2010unified\n  author author K. Modi, author T. Paterek,\n  author W. Son, author\n  V. Vedral, and author\n  M. Williamson, @noop  journal journal Phys. Rev. Lett. volume 104, pages 080501 (year\n  2010)NoStop\n[Streltsov et al.(2017)Streltsov, Adesso, and Plenio]streltsov2017colloquium\n  author author A. Streltsov, author G. Adesso,  and author M. B. Plenio,  @noop  journal journal Rev. Mod. Phys.  volume 89, pages 041003 (year 2017)NoStop\n[Degen et al.(2017)Degen,\n  Reinhard, and Cappellaro]degen2017quantum\n  author author C. L. Degen, author F. Reinhard,  and author P. Cappellaro,  @noop  journal journal Rev. Mod. Phys.  volume 89, pages 035002 (year 2017)NoStop\n[Braun et al.(2018)Braun,\n  Adesso, Benatti, Floreanini,\n  Marzolino, Mitchell, and Pirandola]braun2018quantum\n  author author D. Braun, author G. Adesso,\n  author F. Benatti, author R. Floreanini, author\n  U. Marzolino, author\n  M. W. Mitchell, and author\n  S. Pirandola, @noop  journal journal Rev. Mod. Phys. volume\n  90, pages 035006 (year 2018)NoStop\n[Giovannetti et al.(2011)Giovannetti, Lloyd, and Maccone]giovannetti2011advances\n  author author V. Giovannetti, author S. Lloyd,  and author L. Maccone,  @noop  journal journal Nat. Photon.  volume 5, pages 222 (year\n  2011)NoStop\n[Vidrighin et al.(2014)Vidrighin, Donati, Genoni, Jin, Kolthammer, Kim, Datta, Barbieri, and Walmsley]vidrighin2014joint\n  author author M. D. Vidrighin, author G. Donati,\n  author M. G. Genoni, author X.-M. Jin, author\n  W. S. Kolthammer, author\n  M. Kim, author A. Datta, author M. Barbieri, and author I. A. Walmsley, @noop  journal\n  journal Nat. Commun. volume 5,  pages 1 (year 2014)NoStop\n[Wootters and Fields(1989)]wootters1989optimal\n  author author W. K. Wootters and author B. D. Fields, @noop  journal journal Ann.\n  Phys. volume 191, pages 363 (year 1989)NoStop\n[Scott and Grassl(2010)]scott2010symmetric\n  author author A. J. Scott and author M. Grassl,  @noop  journal journal J. Math. Phys.  volume 51, pages 042203 (year 2010)NoStop\n[Bent et al.(2015)Bent,\n  Qassim, Tahir, Sych,\n  Leuchs, Sánchez-Soto, Karimi, and Boyd]bent2015experimental\n  author author N. Bent, author H. Qassim,\n  author A. Tahir, author D. Sych, author\n  G. Leuchs, author L. L. Sánchez-Soto, author E. Karimi, and author R. Boyd, @noop  journal journal Phys. Rev. X volume 5, pages\n  041006 (year 2015)NoStop\n[Banchi et al.(2018)Banchi,\n  Kolthammer, and Kim]banchi2018multiphoton\n  author author L. Banchi, author W. S. Kolthammer, and author M. Kim, @noop  journal journal Phys.\n  Rev. Lett. volume 121, pages 250402\n  (year 2018)NoStop\n[Zhao et al.(2021)Zhao,\n  Rubin, and Miyake]zhao2021fermionic\n  author author A. Zhao, author N. C. Rubin,  and author A. Miyake,  @noop  journal journal Phys. Rev. Lett.  volume 127, pages 110504 (year 2021)NoStop\n[Friis et al.(2019)Friis,\n  Vitagliano, Malik, and Huber]friis2019entanglement\n  author author N. Friis, author G. Vitagliano,\n  author M. Malik, and author M. Huber, @noop \n  journal journal Nat. Rev. Phys. volume 1, pages 72 (year\n  2019)NoStop\n[Wu et al.(2021)Wu,\n  Streltsov, Regula, Xiang,\n  Li, and Guo]wu2021experimental\n  author author K.-D. Wu, author A. Streltsov,\n  author B. Regula, author G.-Y. Xiang, author\n  C.-F. Li, and author\n  G.-C. Guo, @noop  journal journal Adv. Quantum Technol. volume 4, pages 2100040 (year\n  2021)NoStop\n[Lundeen et al.(2011)Lundeen, Sutherland, Patel, Stewart, and Bamber]lundeen2011direct\n  author author J. S. Lundeen, author B. Sutherland,\n  author A. Patel, author C. Stewart, and author\n  C. Bamber, @noop  journal journal Nature volume 474,  pages 188 (year 2011)NoStop\n[Mirhosseini et al.(2014)Mirhosseini, Magaña-Loaiza, Rafsanjani, and Boyd]mirhosseini2014compressive\n  author author M. Mirhosseini, author O. S. Magaña-Loaiza, author S. M. H.  Rafsanjani, and author R. W.  Boyd, @noop  journal journal Phys. Rev. Lett. volume 113, pages 090402 (year 2014)NoStop\n[Malik et al.(2014)Malik,\n  Mirhosseini, Lavery, Leach,\n  Padgett, and Boyd]malik2014direct\n  author author M. Malik, author M. Mirhosseini,\n  author M. P. Lavery, author J. Leach, author\n  M. J. Padgett, and author\n  R. W. Boyd, @noop  journal journal Nat. Commun. volume\n  5, pages 1 (year 2014)NoStop\n[Fischbach and Freyberger(2012)]fischbach2012quantum\n  author author J. Fischbach and author M. Freyberger, @noop  journal journal\n  Phys. Rev. A volume 86, pages 052110\n  (year 2012)NoStop\n[Bolduc et al.(2016)Bolduc,\n  Gariepy, and Leach]bolduc2016direct\n  author author E. Bolduc, author G. Gariepy,  and author J. Leach,  @noop  journal journal Nat. Commun.  volume 7, pages 1 (year\n  2016)NoStop\n[Shi et al.(2015)Shi,\n  Mirhosseini, Margiewicz, Malik, Rivera, Zhu, and Boyd]shi2015scan\n  author author Z. Shi, author M. Mirhosseini,\n  author J. Margiewicz, author M. Malik, author\n  F. Rivera, author Z. Zhu, and author R. W.  Boyd, @noop  journal journal Optica volume 2, pages 388\n  (year 2015)NoStop\n[Pan et al.(2019)Pan,\n  Xu, Kedem, Wang,\n  Chen, Jan, Sun, Xu, Han, Li et al.]pan2019direct\n  author author W.-W. Pan, author X.-Y. Xu,\n  author Y. Kedem, author Q.-Q. Wang, author\n  Z. Chen, author M. Jan, author K. Sun, author J.-S. Xu,\n  author Y.-J. Han, author C.-F. Li, et al.,  @noop  journal journal Phys. Rev. Lett.  volume 123, pages 150402 (year 2019)NoStop\n[Lundeen and Bamber(2012)]lundeen2012procedure\n  author author J. S. Lundeen and author C. Bamber, @noop  journal journal Phys.\n  Rev. Lett. volume 108, pages 070402\n  (year 2012)NoStop\n[Salvail et al.(2013)Salvail, Agnew, Johnson, Bolduc, Leach, and Boyd]salvail2013full\n  author author J. Z. Salvail, author M. Agnew,\n  author A. S. Johnson, author E. Bolduc, author\n  J. Leach, and author\n  R. W. Boyd, @noop  journal journal Nat. Photon. volume\n  7, pages 316 (year 2013)NoStop\n[Bamber and Lundeen(2014)]bamber2014observing\n  author author C. Bamber and author J. S. Lundeen, @noop  journal journal\n  Physical Review Letters volume 112, pages 070405 (year 2014)NoStop\n[Wu(2013)]wu2013state\n  author author S. Wu, @noop  journal journal Sci.\n  Rep. volume 3, pages 1 (year 2013)NoStop\n[Dirac(1945)]dirac1945analogy\n  author author P. A. M.  Dirac, @noop  journal journal Rev. Mod. Phys. volume 17, pages 195 (year 1945)NoStop\n[Thekkadath et al.(2016)Thekkadath, Giner, Chalich, Horton, Banker, and Lundeen]thekkadath2016direct\n  author author G. S. Thekkadath, author L. Giner,\n  author Y. Chalich, author M. J. Horton, author\n  J. Banker, and author\n  J. S. Lundeen, @noop  journal journal Phys. Rev. Lett. volume 117, pages 120401 (year\n  2016)NoStop\n[Martinez-Becerril et al.(2021)Martinez-Becerril, Bussières, Curic,\n  Giner, Abrahao, and Lundeen]martinez2021theory\n  author author A. C. Martinez-Becerril, author G. Bussières, author D. Curic, author L. Giner,\n  author R. A. Abrahao, and  author J. S. Lundeen,  @noop  journal journal Quantum volume 5, pages 599 (year\n  2021)NoStop\n[Kim et al.(2018)Kim,\n  Kim, Lee, Han, Moon, Kim, and Cho]kim2018direct\n  author author Y. Kim, author Y.-S. Kim,\n  author S.-Y. Lee, author S.-W. Han, author\n  S. Moon, author Y.-H. Kim, and author Y.-W.  Cho, @noop  journal journal Nat. Commun. volume 9, pages\n  1 (year 2018)NoStop\n[Xu et al.(2021a)Xu, Xu, Jiang, Xu,\n  Zheng, Wang, Zhang, and  Zhang]xu2021direct_PRL\n  author author L. Xu, author H. Xu, author T. Jiang, author\n  F. Xu, author K. Zheng, author B. Wang, author A. Zhang, and author L. Zhang,  @noop  journal journal Phys. Rev. Lett.  volume 127, pages 180401 (year 2021a)NoStop\n[Xu et al.(2021b)Xu, Xu, Xie, Li,\n  Zhou, Xu, and Zhang]xu2021direct_AP\n  author author L. Xu, author H. Xu, author J. Xie, author\n  H. Li, author L. Zhou, author F. Xu, and author L. Zhang,  @noop  journal journal Adv. Photon.  volume 3, pages 066001 (year\n  2021b)NoStop\n[Ren et al.(2019)Ren,\n  Wang, and Du]ren2019efficient\n  author author C. Ren, author Y. Wang, and  author J. Du, @noop \n  journal journal Phys. Rev. Appl. volume 12, pages 014045 (year\n  2019)NoStop\n[Zhou et al.(2021)Zhou,\n  Zhao, Hay, McGonagle,\n  Boyd, and Shi]zhou2021direct\n  author author Y. Zhou, author J. Zhao, author D. Hay, author\n  K. McGonagle, author\n  R. W. Boyd, and author\n  Z. Shi, @noop  journal journal Phys. Rev. Lett. volume 127, pages 040402 (year\n  2021)NoStop\n[Chen et al.(2021)Chen,\n  Li, Liu, Wu, Su, Wang, Li, Liu,\n  Lu, and Pan]chen2021directly\n  author author M.-C. Chen, author Y. Li, author R.-Z. Liu, author\n  D. Wu, author Z.-E. Su, author X.-L.  Wang, author L. Li, author N.-L. Liu,\n  author C.-Y. Lu, and author J.-W. Pan, @noop \n  journal journal Phys. Rev. Lett. volume 127, pages 030402 (year\n  2021)NoStop\n[Maccone and Rusconi(2014)]maccone2014state\n  author author L. Maccone and author C. C. Rusconi, @noop  journal journal Phys.\n  Rev. A volume 89, pages 022122\n  (year 2014)NoStop\n[Gross et al.(2015)Gross,\n  Dangniam, Ferrie, and Caves]gross2015novelty\n  author author J. A. Gross, author N. Dangniam,\n  author C. Ferrie, and author C. M. Caves, @noop \n  journal journal Phys. Rev. A volume 92, pages 062133 (year\n  2015)NoStop\n[Zhu et al.(2016)Zhu,\n  Zhang, and Wu]zhu2016direct\n  author author X. Zhu, author Y.-X. Zhang,  and author S. Wu, @noop\n   journal journal Physical Review A volume 93, pages 062304 (year\n  2016)NoStop\n[Vallone and Dequal(2016)]vallone2016strong\n  author author G. Vallone and author D. Dequal, @noop  journal journal Phys.\n  Rev. Lett. volume 116, pages 040502\n  (year 2016)NoStop\n[Calderaro et al.(2018)Calderaro, Foletto, Dequal, Villoresi, and Vallone]calderaro2018direct\n  author author L. Calderaro, author G. Foletto,\n  author D. Dequal, author P. Villoresi, and author G. Vallone, @noop \n  journal journal Phys. Rev. Lett. volume 121, pages 230501 (year\n  2018)NoStop\n[Zhang et al.(2020)Zhang,\n  Hu, Hou, Tang, Zhu, Xiang, Li, Guo, and  Zhang]zhang2020direct\n  author author C.-R. Zhang, author M.-J. Hu,\n  author Z.-B. Hou, author J.-F. Tang, author\n  J. Zhu, author G.-Y. Xiang, author C.-F.  Li, author G.-C. Guo, and author Y.-S. Zhang, @noop  journal journal Phys.\n  Rev. A volume 101, pages 012119\n  (year 2020)NoStop\n[ODS()]ODST_supplementary\n  @noop   note Supplementary MaterialsNoStop\n[Shao-Kai et al.(2007)Shao-Kai, Ji-Gang, Cheng-Zhi, Shuo, and Xiang-Bin]shao2007realization\n  author author W. Shao-Kai, author R. Ji-Gang,\n  author P. Cheng-Zhi, author J. Shuo, and author\n  W. Xiang-Bin, @noop  journal journal Chin. Phys. Lett. volume 24, pages 2471 (year\n  2007)NoStop\n[Simon and Mukunda(1989)]simon1989universal\n  author author R. Simon and author N. Mukunda, @noop  journal journal Phys.\n  Lett. A volume 138, pages 474\n  (year 1989)NoStop\n[Simon and Mukunda(1990)]simon1990minimal\n  author author R. Simon and author N. Mukunda, @noop  journal journal Phys.\n  Lett. A volume 143, pages 165\n  (year 1990)NoStop\n[Hu et al.(2018)Hu,\n  Zhou, Hu, Li, Guo, and Zhang]hu2018observation\n  author author M.-J. Hu, author Z.-Y. Zhou,\n  author X.-M. Hu, author C.-F. Li, author\n  G.-C. Guo, and author\n  Y.-S. Zhang, @noop  journal journal npj Quantum Inform. volume 4, pages 63 (year 2018)NoStop\n[Mao et al.(2019)Mao,\n  Ma, Jin, Sun, Fei, Zhang, Fan, and Pan]mao2019error\n  author author Y.-L. Mao, author Z.-H. Ma,\n  author R.-B. Jin, author Q.-C. Sun, author\n  S.-M. Fei, author Q. Zhang, author J. Fan, and author J.-W.  Pan, @noop  journal journal Phys. Rev. Lett. volume 122, pages 090404 (year 2019)NoStop\n[Blok et al.(2014)Blok,\n  Bonato, Markham, Twitchen,\n  Dobrovitski, and Hanson]blok2014manipulating\n  author author M. Blok, author C. Bonato,\n  author M. Markham, author D. Twitchen, author\n  V. Dobrovitski, and author\n  R. Hanson, @noop  journal journal Nat. Phys. volume\n  10, pages 189 (year 2014)NoStop\n[Kim et al.(2012)Kim,\n  Lee, Kwon, and Kim]kim2012protecting\n  author author Y.-S. Kim, author J.-C. Lee,\n  author O. Kwon, and author Y.-H. Kim, @noop \n  journal journal Nat. Phys. volume 8, pages 117 (year 2012)NoStop\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}