{"entry_id": "http://arxiv.org/abs/2303.06900v1", "published": "20230313072919", "title": "Redshift drift in a universe with structure II: Light rays propagated through a Newtonian N-body simulation", "authors": ["S. M. Koksbang"], "primary_category": "astro-ph.CO", "categories": ["astro-ph.CO"], "text": " \n\t\n\t\n\t\n\t\n\t\n\t \n\tkoksbang@cp3.sdu.dk\n\tCP^3-Origins, University of Southern Denmark, Campusvej 55, DK-5230 Odense M, Denmark\n\t\n\t\n\t\n \nThe redshift drift is computed along light rays propagating through a simulated universe based on the Newtonian N-body simulation code GADGET-2 combined with a perturbed Friedmann-Lemaitre-Robertson-Walker metric in the Newtonian gauge. It is found that the mean redshift drift is equal to the drift of the mean redshift to the precision of the numerical computations and that this is due to a high degree of cancellation between two dominant components of the redshift drift. This result is contrary to earlier findings based on inhomogeneous cosmological models exhibiting cosmic backreaction.\nFor simplicity, the results neglect contributions from optical drift. Based on a study of the redshift drift in a Lemaitre-Tolman-Bondi model, the optical drift effects are estimated to be at most of order 10% of the redshift drift signal. In addition, it is found that the redshift drift contribution from peculiar acceleration of the emitter is negligible in the simulation setup. However, it is expected that the contribution from peculiar acceleration of the emitter is suppressed in the setup due to low resolution of structures and it is hence expected that this contribution will be larger for real observations.\n\n\t \n\t\n\tRedshift drift in a universe with structure II: Light rays propagated through a Newtonian N-body simulation\n    Sofie Marie Koksbang\n    March 30, 2023\n===========================================================================================================\n\n\n\n§ INTRODUCTION\n\nObtaining new observational data is key for understanding the reason(s) behind the discrepancies between the standard ΛCDM model and various observational data sets, discussed in e.g. <cit.>. Such new data should not only include more of the same types of data that we already have, but also new types of observations. A prime example of a “new” type of observable is the redshift drift, i.e. the change of a source's redshift in time.\nRedshift drift measurements were envisioned already in 1962 in <cit.>. In the former of these, it was concluded that it would require at the order of 10^7 years of observation time for the signal to be large enough for detection. With today's technology, it is instead estimated that the measurements may be feasible within only a few decades <cit.>, although it will not be an easy achievement.\nThe possibility of actually measuring the redshift drift within our lifetime has spurred a significant amount of research into redshift drift in recent years. The redshift drift has for instance been studied in various homogeneous and isotropic cosmological models such as in <cit.> but also in less standard scenarios with e.g. modified gravity theories <cit.> and with a varying speed of light <cit.>. In addition, the redshift drift has been considered in a variety of different inhomogeneous and/or anisotropic models such as in Lemaitre-Tolman-Bondi <cit.>, Szekeres <cit.>, Stephani <cit.>, Bianchi I <cit.>, perturbative, <cit.> and Einstein-Strauss models <cit.>, and has been utilized to develop different cosmological tests <cit.> (see e.g. <cit.> regarding a correction of the first of these).\nThe redshift drift is a particularly interesting observable because it within the Friedmann-Lemaitre-Robertson-Walker (FLRW) cosmologies is given by\n\n    δ z    = δ t_0[(1+z)H_0-H(z) ] \n       = (1+z)[a_,t(t_0) - a_,t(t_e)  ] ,\n\nwhere δ t_0 is the time interval and t_e is the emission time. Clearly, if H_0 is known by other means, the redshift drift yields a direct measurement of the expansion rate of the FLRW universe. A direct measurement of H(z) is important in its own right since today's observables only indirectly teach us about the expansion rate of the Universe. However, the importance of measuring the redshift drift becomes even more clear when noticing that the sign of the redshift drift can become positive only if the expansion rate has accelerating periods. This is clear for the FLRW models as seen by equation <ref> but an important follow-up question is to what extent this extrapolates to other cosmological models. It was in <cit.> shown that the redshift drift in a model universe with average accelerated expansion generated by cosmic backreaction <cit.> was negative. In other words, it was shown that the observed redshift drift in the model was negative despite structures leading to apparent accelerated expansion and based on that it was in <cit.> conjectured that the redshift drift in a statistically homogeneous and isotropic universe will be positive only if the Universe is undergoing local accelerated expansion due to dark energy – a conjecture that has later been supported by e.g. <cit.>. On the other hand, within the ambitious and quite complex inhomogeneous cosmological model known as timescape cosmology, the redshift drift can still be positive at low redshift <cit.> without local accelerated expansion induced by dark energy.\nWith the expectation that redshift drift measurements are about to become feasible it is necessary to understand possible sources of measurement errors that need to be taken into account when determining the precision of the measurements. One important question in this regard is how big the structure-induced fluctuations of redshift drift signals are, assuming a standard cosmological scenario where structures are well described by e.g. Newtonian N-body simulations. The objective with the work presented here is therefore to compute the redshift drift along light rays in such a simulation to quantify the fluctuations in the measurements around the values expected based on equation <ref>. This complements earlier studies such as <cit.> which indicate that the peculiar velocities of sources have only a small impact on the observed redshift drift signal.\nThe examples of <cit.> show that the drift of the mean redshift will not in general be equal to the mean drift of the redshift. On the other hand, the results of <cit.> show that the mean redshift drift does follow the drift of the mean redshift in LTB Swiss cheese models. These results hint towards an important question, namely whether or not we can expect the mean redshift drift to equal the drift of the mean redshift in our universe. While the answer to this question seems to e.g. depend on whether or not there is significant cosmic backreaction in the real universe, the standard cosmological description of the inhomogeneous universe is based on Newtonian N-body simulations (which are inherently backreaction free). An important step towards answering the question is therefore to study the mean redshift drift versus the drift of the mean redshift in a model universe based on a Newtonian N-body simulation. The results of such a study will also be presented here.\nSection <ref> below introduces the theoretical framework for computing the redshift drift in a Newtonian N-body simulation and discusses the importance of the optical drift. Numerical results from computing the redshift drift along light rays propagated through the N-body model are presented in section <ref> while section <ref> provides a summary and concluding remarks.\n\t\n\n\t\n\t\n\n\n§ REDSHIFT DRIFT IN AN INHOMOGENEOUS UNIVERSE\n\nSeveral formalisms for computing the redshift drift in inhomogeneous cosmological models have been proposed within the previous few years <cit.>. The redshift drift will here be computed using the formalism presented in <cit.>, i.e. using the decomposition\n\n    δ z =\n       δτ_0 E_e ∫_λ_e^λ_0 d λ(  -κ^μκ_μ +Σ^ O    +  e^μΣ^ e_μ    +       e^μ   e^νΣ^ ee_μν + e^μκ^νΣ^ eκ_μν) ,\n\nwith\n\n    Σ^ O :=  - 1/3 u^μ u^ν R_μν     + 1/3D_μ a^μ + 1/3 a^μ a_μ\n       Σ^ e_μ  :=  - 1/3θ a_μ    -   a^νσ_μν  + 3 a^νω_μν    - h^ν_μȧ_ν\n       Σ^ ee_μν :=     a_μa_ν  + D_μ a_ν    -  u^ρ u^σ  C_ρμσν   -  1/2 h^α_ μ h^β_ ν  R_αβ\n       Σ^ eκμν :=2(σ_μν-ω_μν)\n       κ^μ = h^μ_νė^ν.\n\nQuantities are defined in the usual manner with R_μν the Ricci tensor, C_ρμσν the Weyl tensor, D_μ the 3D spatial covariant derivative, h_μν projecting onto spatial hypersurfaces orthogonal to the velocity field u^μ with a corresponding acceleration a^μ. The velocity field is associated with an expansion scalar θ, vorticity ω_μν and shear σ_μν. The 4-vector e^μ is the spatial direction vector of the light ray as seen by the observer with velocity u^μ. Triangular brackets indicate the trace-free symmetric part of the spatial projection. The convention c=1 is used throughout.\n\n\n\n\n\n\n\n §.§ Comment on optical drift\n\nAs discussed in <cit.>, computations of the redshift drift simplify tremendously if the optical drift (quantified by κ^μ) can be neglected (see e.g. <cit.> for a discussion on the optical drift and <cit.> for related considerations). The optical drift will therefore be neglected for the computations of the redshift drift along light rays through the N-body simulation studied here. To justify this, note that it was in <cit.> found that for Lemaitre-Tolman-Bondi (LTB) models <cit.> with a central void surrounded by an overdensity and with the observer placed in the FLRW region outside the double structure, the optical drift could be neglected to a relative precision of 10^-3 when computing the redshift drift. However, the observers in a Newtonian N-body simulation will in general be placed in an inhomogeneous patch of spacetime and not in an FLRW background. Thus, to further judge the significance of neglecting the optical drift, the redshift drift in the LTB model used in <cit.> is here studied with observers placed at different positions inside the void to verify that the optical drift still represents a subdominant contribution to the redshift drift. \nFour non-radial light rays have been studied with 3 different observers with non-radial lines of sight. Figure <ref> shows the present-day density profile of the LTB model with stars marking the positions of the observers. Two different lines of sight have been considered for the observer represented by the middle star.\nThe density fields along the light rays are shown in figure <ref>, and in figure <ref>, the different contributions to the redshift drift are shown. Note that Σ^ eκ_μν is identically zero in the LTB spacetime and therefore not included in the plots. The figures show that even for an observer in the inhomogeneous LTB region, the terms involving the optical drift are clearly subdominant. However, for one particular observer and line of sight, the optical drift becomes as large as roughly of order 10 % based on an overall estimate along the light ray. This indicates that the optical drift cannot be expected to be entirely negligible for the simulation data. This must be kept in mind when considering the results presented further below regarding the redshift drift in the simulated model universe. It must also be kept in mind that the study presented in this section is not a thorough systematic study, but merely an initial study tentatively suggesting that the optical drift represents a sub-dominant contribution to the redshift drift along most lines of sight even if the observer is placed inside a structure.\n\nDetails regarding the LTB computations and a remark on the stabilization of the effect of the optical drift around 10% can be found in appendix <ref> together with a discussion of emitter velocity.\n\n\n\n\n §.§ Formalism for computing the redshift drift in a Newtonian N-body simulation\n\nTo apply the above formalism to simulation data from GADGET-2 <cit.>, snapshots from the simulation must be combined with a spacetime metric. According to <cit.> this can be done by introducing the perturbed line element\n\n    ds^2 = -(1+2ψ)dt^2 + a^2(1-2ψ)( dx^2+dy^2+dz^2) ,\n \nwhere ∇^2 ψ = 4π Ga^2(ρ-ρ_ bg) with ρ_ bg the background matter density of the simulation and ρ the actual local matter density. The densities are obtained by TSC (triangular shaped cloud) interpolation of the particle masses in each snapshot. The metric function ψ is then found using FFTW3[http://www.fftw.org].\nUsing this line element, the geodesic equation can be solved for light rays propagating through the simulation box. Quadri-linear interpolation is used to interpolate within and between snapshots.\nWith the line element as given above, we can compute the integrand components in equation <ref>. For simplicity, the optical drift is neglected. In addition, the shear, vorticity and acceleration all vanish at background order so to first order in these quantities the integrand components reduce to \n\n    Σ^O≡  - 1/3 u^μ u^ν R_μν\n       Σ^e_μ≡   - 1/3θ a_μ\n       Σ^ee_μν≡    -  u^ρ u^σ  C_ρμσν    .\n\nIn the last line it was also utilized that 1/2 h^α_ μ h^β_ ν  R_αβ vanishes identically.\nThe total expression for the redshift drift is thus given by the integral over just 3 terms: The projections of the Ricci tensor, R_μν, and the Weyl tensor, C_ρμσν, along the light path as well as the projection of the acceleration scaled by the expansion rate, i.e.\n\n\n    δ z ≈ E_eδτ_0∫_t_e^t_0dt(1+2ψ)/E^(n)[-1/3u^μu^νR_μν- 1/3θ a_μ e^μ-u^ρu^σe^μe^νC_ρμσν].\n\n\nNote that the energy E^(n) under the integral is computed using the velocity field normal to the spatial hypersurfaces i.e. n^μ = -(1+2ψ)∂_μt = (-(1+2ψ),0,0,0) and not the fluid velocity field[This was pointed out by Asta Heinesen.]. In practice, the difference between these two is of course very small and at first order, it only affects the background part of the Ricci term of the integrand (see e.g. <cit.> for details regarding the choice of velocity field and energy computations when integrating over the affine parameter versus over the time coordinate).\nThis integral is computed as a finite sum on-the-fly while solving the geodesic equation for the given spacetime, observer and emitter[The issue regarding emitter velocity discussed in <cit.> is neglected here. See appendix <ref> for a justification and discussion.].\nWith the line element given above, the three considered terms contributing to the redshift drift are at lowest order in ψ and its derivatives given by\n\n    -1/3u^μu^νR_μν = -4π G/3ρ,\n\n\n    -θ a_μe^μ = 3H( ∂_t δ u^i + Hδ u^jδ_j^i )e_i,\n\nand\n\n    -u^ρu^σe^μe^νC_ρμσν  =\n        -e^i e^j( ∂_i ∂_j ψ + Γ^γ( bg)_ijψ_,γ -4π G a^2/3( ρ-ρ_ bg)δ_ij) ,\n\nwhere the superscripted “(bg)” on the Christoffel symbol indicates that only the background values are used. The 4-vector e^μ:=u^μ - k^μ/E is the spatial projection of the null geodesic tangent vector as seen by an observer comoving with the fluid and is to be understood as given at background order everywhere except for in the last term. δ u^μ represents the perturbation to the velocity field of the fluid which is obtained by TSC interpolation of the velocity field, v^i, from the snapshot. The full 4-velocity field is given by u^μ∝(1,v^i), with normalization according to u^μu_μ = -1.\n\t\n\n\n §.§ Simulation setup\n\nThe simulation data was obtained by running GADGET-2 <cit.> with initial conditions generated with N-GenIC[https://wwwmpa.mpa-garching.mpg.de/gadget]. The Einstein-de Sitter (EdS) model with a reduced Hubble parameter of 0.7 was chosen as the simulation background. This choice will give slightly enhanced quantitative results compared to a ΛCDM model where only 30% of the energy content is inhomogeneous.\nThe simulation was run with 512^3 particles in a box with side lengths 512 Mph/h and 24 snapshots in the interval roughly corresponding to z∈ [0,1] were produced.\n\t\n\n\n§ NUMERICAL RESULTS\n\n\n\n189 light rays were considered, all with random lines of sight and observers placed at random spatial positions (all at present time). Observation time, δ t_0, was set to 30 years. The main results are shown in figure <ref> which shows the redshift drift along the light rays compared to the redshift drift in the EdS model. The relative deviation between the mean redshift drift and the redshift drift of the EdS model (which represents the drift of the mean redshift) is of order 10^-4. Considering that the redshift drift itself is of order 10^-9, this means that the deviation is of absolute order 10^-13 which is roughly around the expected precision of the computations.\nFigure <ref> shows the mean and fluctuations of the individual components of the redshift drift. The acceleration term is too small to be clearly visible and is therefore shown independently in figure <ref> where it is seen that the fluctuations in the acceleration term is of order 10^-8. The mean of this term is of order 10^-10 which is several orders of magnitude below the other two terms. In relation to this, it should be noted that earlier studies <cit.> show that the full non-linear peculiar acceleration contribution to the redshift drift signal can be larger than the cosmic signal along individual light rays but that the signal should average out when considering many rays in different directions. The small contribution from the acceleration found here is presumably due to the peculiar acceleration being suppressed since it was computed from a smoothed velocity field representing large scale structures. Thus, the current study cannot meaningfully contribute to the quantification of effects from peculiar acceleration.\n\nFigure <ref> shows that the mean of the contribution from the two dominant (i.e. non-acceleration) perturbative terms cancel each other almost exactly in the mean computation, leaving only the contribution representing the background redshift drift. A similar symmetry is seen in the contours of the shaded and hatched areas indicating the fluctuations of the two components. Figure <ref> shows the redshift drift along a random light ray and supports this symmetry: It is clearly seen that the two dominant perturbative contributions cancel each other to high precision at all points along the light ray, indicating that the dominant term in equation <ref> is the term proportional to the density fluctuation. This is reminiscent of the cancellations between the shear and expansion rate fluctuations in the redshift discussed in <cit.>. Indeed, in <cit.> one can see that the redshift along light rays in the studied N-body simulation is always very close to the background redshift with a deviation of at most of order 10^-5. It is therefore not surprising that the redshift drift is also close to the background value everywhere along the light rays. However, in agreement with earlier studies <cit.>, it was in <cit.> found that the redshift along individual light rays in Swiss-cheese models based on LTB structures was also everywhere close to the background redshift, with deviations of order 10^-3. But the results of <cit.> are not that the redshift drift is always close to the background redshift drift in LTB models.\nTo establish the relationship between these cancellation relations along light rays and their possible relation to cancellations of e.g. the terms of the kinematical backreaction <cit.>, it could be interesting to consider models of averaging along light cones such as the setups presented in <cit.>. In addition, one intriguing point with the results discussed above is the significance of the Weyl tensor and the question of under what conditions its redshift drift contribution (nearly) cancels with the contribution from the fluctuation in the Ricci tensor – more specifically, if there is a connection between the electric part of the Weyl tensor being dominated by the Ricci curvature, and other aspects of a spacetime. It may be interesting to study this more thoroughly, e.g. with inspiration from the analysis of the “quiet” spacetime presented in <cit.>.\n\n\n\n\n§ SUMMARY AND CONCLUSIONS\n  \nThe redshift drift was computed along 189 light rays through a simulated spacetime obtained with the Newtonian N-body simulation code GADGET-2 run with an Einstein-de Sitter background. It was found that the two main non-background contributions to the redshift drift cancel almost exactly along the light rays and therefore the mean redshift drift equals the drift of the mean redshift to high precision. This is contrary to earlier results based on inhomogeneous cosmological models. Specifically, it was in <cit.> found for specific models that exhibit significant cosmic backreaction that the mean redshift drift in these models deviates significantly from the drift of the mean redshift. These combined results support the work presented in <cit.> where an observational signal of cosmic backreaction was devised based on the notion that the mean redshift drift deviates from the drift of the mean redshift in a spatially statistically homogeneous and isotropic universe only if there is significant cosmic backreaction.\nThe cancellation further means that the local fluctuations in the redshift drift along individual light rays are very modest. The results presented here thus indicate that future redshift drift measurements only will contain a small bias/error due to fluctuations from structures. While this is good news, such a conclusion is too strong based on the limits of the considered N-body simulation; the density and velocity fields of the simulation are smoothed to represent large scale structures and therefore the importance of e.g. peculiar acceleration of the emitter cannot be realistically determined from the simulation. Indeed, while the contribution to the redshift drift from peculiar acceleration was here found to be several orders of magnitude smaller than the other contributions, earlier work <cit.> indicates that the peculiar acceleration may (for some types of sources) be even larger than the cosmological contribution to the redshift drift. Presumably, this does not spoil the ambition to measure the cosmic redshift drift since the contribution from the peculiar acceleration according to these studies should become negligible upon averaging over several points of observation.\nIt is lastly noted that the results presented here are based on inhomogeneous cosmological models with EdS backgrounds and thus the small fluctuations found here should be expected to correspond to even smaller fluctuations in the redshift drift in similar models with a ΛCDM background.\n\t\n\n\t\n\t\n\n\nThe author is funded by the Carlsberg Foundation. The author thanks Asta Heinesen for pointing out an error in the original expression for the redshift drift. Some of the computations done for this project were performed on the UCloud interactive HPC system managed by the eScience Center at the University of Southern Denmark.\n\t\t\n\n\t\n\t\n\n\n§ REDSHIFT DRIFT COMPUTATIONS IN AN LTB MODEL\n\n\nThis appendix serves to give details regarding the LTB model studied in section <ref>.\n\n\n\nThe line element of the LTB model can be written as\n\n    ds^2 = -dt^2 + A_,r^2(t,r)/1-k(r)dr^2+A^2(t,r)dΩ^2.\n\nTo specify the model used in <cit.> and the main text here, it is required that the LTB model has a homogeneous big bang which is most naturally ensured by setting A(t=0, r) = 0. The model is then further specified by setting \n\n    k(r) = \n    \t\n    \t-1.3 × 10^-7 r^2( ( r/r_b)^6 - 1 )^6 ,   if  r < r_b\n    \n    \t0   ,                 else  .\n\nAs in <cit.> r_b is chosen to be 40Mpc. Outside the region defined by r≤ r_b the model reduces to the background FLRW model which is here chosen to be the EdS model with reduced Hubble parameter of 0.7. To ensure this, A(t=t_i, r) = a_ir is fixed for an initial time t_i representing the time at which the scale factor of the EdS model is equal to a_i = 1/1100. This sets up the initial conditions used for solving the dynamical equation for A which is given by\n\n    A_,t^2 = 2M/A-k,\n\nwhere M=M(r) is fixed by the conditions described above through the considerations presented in <cit.>.\nFor studying light rays in the LTB model it is necessary to simultaneously solve the geodesic equations and propagation equations for the partial derivatives of the tangent vector, k^μ,\n\n    d/dλ(g_αβk^β)    = 1/2g_μν,αk^μk^ν\n    d/dλk^μ_,ν   = ∂/∂ x^νdk^μ/dλ - k^β_,νk^μ_,β,\n\nwhere the latter set of equations were presented in <cit.>.\nNaturally, initial conditions are needed in order to solve the above set of equations along light rays. When setting these, the expressions for the components of κ^μ will be used and are therefore shown here. By defining R:=A_,r^2/(1-k), the components can be written as\n\n\t\n    κ^t    = 0\n    κ^r    = -1/k^t[ ( 1-R( k^r) ^2/( k^t) ^2)(k^r_,t +R_,t/2Rk^r ) -k^rk^θ/( k^t) ^2A^2( k^θ_,t + A_,t/Ak^θ) -k^rk^ϕ/( k^t) ^2A^2sin^2(θ)(k^ϕ_,t +A_,t/Ak^ϕ)     ] \n    κ^θ    = -1/k^t[ -k^θ k^r/(k^t)^2R(k^r_,t + R_,t/2Rk^r ) + (1-(k^θ)^2/(k^t)^2A^2 )(k^θ_,t + A_,t/Ak^θ) -k^θk^ϕ/(k^t)^2A^2sin^2(θ)(k^ϕ_,t + A_,t/Ak^ϕ)   ]\n    κ^ϕ    = -1/k^t[  -k^ϕ k^r/(k^t)^2R( k^r_,t +R_,t/2R) -k^ϕ k^θ/(k^t)^2A^2( k^θ_,t +A_,t/Ak^θ) +(1-( k^ϕ) ^2/(k^t)^2A^2sin^2(θ) )(k^ϕ_,t + A_,t/Ak^ϕ)       ] .\n\n\nUtilizing the spherical symmetry of the LTB models, we can set k^ϕ and its partial derivatives to zero. This trivially means that κ^ϕ = 0 initially. In addition, initial conditions are also set to fulfill κ^r, κ^θ = 0 initially. This implies that there is no optical drift at the position of the observer which seems a reasonable choice. To further specify initial conditions, the partial derivatives of the null condition as well as the definition dk^ν/dλ:=k^μ∂_μk^ν must also be fulfilled.\nAs shown in figure <ref>, these initial conditions lead to a subdominant optical drift contribution to the redshift drift. However, to judge the significance of this result it must be considered what the corresponding peculiar velocity field of the emitters along the light rays are. As discussed in <cit.>, the choice of initial conditions for k^μ_,ν fixes the possible peculiar velocities of the emitter. In principle, this means that the redshift drift must be computed with a new set of initial conditions for each point along a light ray in order to ensure that the peculiar velocity field of the emitter is as desired. However, for the light rays considered in <cit.>, it was found that the actual emitter velocity field corresponding to a single set of initial conditions could be chosen to be very close to the comoving velocity field (which was the desired velocity field). In figure <ref> the same is shown for the four light rays considered in the main text. Specifically, figure <ref> shows that the comoving velocity field projected orthogonally to the light ray tangent vector and an actually possible velocity field of the emitter is small – of order 10^-8-10^-7.\n\n\n\nThe four light rays were generated using  the initial conditions k^ϕ = 0, k^t = -1, k^θ=0.001,0.005 and k^r obtained from the null condition. The observers were placed according to r_b-r = 5,10,20Mpc. The observer placed at r = r_b-10Mpc is the observer with 2 lines of sight. For the other 2 observers, only initial conditions with k^θ = 0.005 were considered. In all cases, the observation time was set to δ t_0 = 30 years. A fifth light ray with initial r= r_b-10Mpc and k^θ = 0.01 has also been studied but the results are similar (of same order of magnitude) as for the light ray with initial r = r_b-10Mpc and k^θ = 0.005 so the results for the former light ray are not shown. The fact that the effect of the optical drift is of same order of magnitude for these two light rays is taken to tentatively indicate a stabilization of the optical drift effect at about 10% in this type of model.\n\n\n\n\t\n\ntensions1 W. Handley, Curvature tension: evidence for a closed universe, Phys. Rev. D 103, L041301 (2021), arXiv:1908.09139\ntensions2 E. Di Valentino, A. Melchiorri and J. Silk, Planck evidence for a closed Universe and a possible crisis for cosmology, Nature Astron. 4 196–203 (2020), arXiv:1911.02087\ntensions3 E. Di Valentino, A. Melchiorri and J. Silk Cosmic Discordance: Planck and luminosity distance data exclude LCDM, arXiv:2003.04935\ntensions4 L. Perivolaropoulos, F. Skara, Challenges for ΛCDM: An update, arXiv:2105.05208v3 [astro-ph.CO]\ntensions5 Weiqiang Yang et al., Revealing the effects of curvature on the cosmological models, arXiv:2210.09865v1 [astro-ph.CO] \ntensions6 Elcio Abdalla et al., Cosmology Intertwined: A Review of the Particle Physics, Astrophysics, and Cosmology Associated with the Cosmological Tensions and Anomalies, J. High En. Astrophys. 2204, 002 (2022), arXiv:2203.06142v3 [astro-ph.CO]\ntensions7 Eleonora Di Valentino, Emmanuel Saridakis, Adam Riess, Cosmological tensions in the birthplace of the heliocentric model, arXiv:2211.05248v1 [astro-ph.CO]\n\nsandage Allan Sandage, The Change of Redshift and Apparent Luminosity of Galaxies due to the Deceleration of Selected Expanding Universes, Astrophysical Journal, vol. 136, p.319 (1962)\nmcvittie G. C. McVittie, Appendix to The Change of Redshift and Apparent Luminosity of Galaxies due to the Deceleration of Selected Expanding Universes, Astrophysical Journal, vol. 136, p.334 (1962)\n\n\nbolejko_flux Krzysztof Bolejko, Chengyi Wang, Geraint F. Lewis, Direct detection of the cosmic expansion: the redshift drift and the flux drift, arXiv:1907.04495v1 [astro-ph.CO]\nSKA H.-R. Klockner et al., Real time cosmology - a direct measure of the expansion rate of the Universe, contribution to SKA Cosmology Chapter, Advancing Astrophysics with the SKA (AASKA14), Conference, Giardini Naxos (Italy), June 9th-13th 2014, arXiv:1501.03822\nfeasible1 J. Liske et al., Cosmic dynamics in the era of Extremely Large Telescopes, Mon.Not.Roy.Astron.Soc.386:1192-1218,2008, arXiv:0802.1532v1 [astro-ph]\nfeasible2 S. Cristiani, et al., The CODEX-ESPRESSO experiment: cosmic dynamics, fundamental physics, planets and much\nmore..., Nuovo Cim.B122:1159-1164,2007; Nuovo Cim.B122:1165-1170,2007, arXiv:0712.4152v1 [astro-ph]\nfeasible3 Claudia Quercellini, Luca Amendola, Amedeo Balbi, Paolo Cabella, Miguel Quartin, Real-time Cosmology, Physics Reports, Volume 521, Issue 3, p. 95-134 (2012), arXiv:1011.2646v2 [astro-ph.CO]\nfeasible4 Pier-Stefano Corasaniti, Dragan Huterer, Alessandro Melchiorri, Exploring the Dark Energy Redshift Desert with the\nSandage-Loeb Test, Phys.Rev.D75:062001,2007, arXiv:astro-ph/0701433v1\nfeasible5 Abraham Loeb, Direct Measurement of Cosmological Parameters from the Cosmic Deceleration of Extragalactic Objects, Astrophys.J.499:L111-L114,1998, arXiv:astro-ph/9802122v1\n\ndz_hom1 A. Balbi, C. Quercellini, The time evolution of cosmological redshift as a test of dark energy, Mon. Not. R. Astron. Soc. 382, 1623–1629 (2007), arXiv:0704.2350v3 [astro-ph]\ndz_hom2 Ruth Lazkoz, Iker Leanizbarrutia, Vincenzo Salzano, Forecast and analysis of the cosmological redshift drift, Eur. Phys. J. C 78, 11 (2018), arXiv:1712.07555v1 [astro-ph.CO] \ndz_hom3 Francisco S. N. Lobo, Jose Pedro Mimoso, Matt Visser, Cosmographic analysis of redshift drift, JCAP 04 (2020) 043, arXiv:2001.11964v3 [gr-qc]\n\ndz_FR F.A. Teppa Pannia, S.E. Perez Bergliaffa, N. Manske, Cosmography and the redshift drift in Palatini f(R) theories, Eur. Phys. J. C (2019) 79: 267, arXiv:1811.08176v2 [gr-qc]\n\ndz_varying_c Adam Balcerzak, Mariusz P. Dabrowski, Redshift drift in varying speed of light cosmology, Phys. Lett. B728, 15-18 (2014), arXiv:1310.7231v2 [astro-ph.CO]\n\ndz_LTB1 C.-M. Yoo, T. Kai, and K.-I. Nakao, Redshift drift in Lemaıtre-Tolman-Bondi void universes, Phys. Rev. D 83, 043527 (2011), arXiv:1010.0091 [astro-ph.CO]\ndz_LTB2 S. M. Koksbang and S. Hannestad, Redshift drift in an inhomogeneous universe: averaging and the backreaction conjecture, JCAP 01, 009, arXiv:1512.05624 [astroph.CO]\ndz_LTB3 Sofie Marie Koksbang, Asta Heinesen, Redshift drift in a universe with structure I: Lemaitre-Tolman-Bondi structures with arbitrary angle of entry of light, Phys. Rev. D 106, 043501 (2022), arXiv:2205.11907v2 [astro-ph.CO]\ndz_LTB4 R. Codur, C. Marinoni, Redshift drift in radially inhomogeneous Lemaitre-Tolman-Bondi spacetimes, Phys. Rev. D 104, 123531 (2021),  arXiv:2107.04868v2 [gr-qc]\ndz_SZ1 P. Mishra, M.-N. Celerier, and T. P. Singh, Redshift drift in axially symmetric quasi-spherical Szekeres models, Phys. Rev. D 86, 083520 (2012), arXiv:1206.6026 [astro-ph.CO]\ndz_Sz2 P. Mishra and M.-N. Celerier, Redshift and redshift drift in Λ = 0 quasispherical Szekeres cosmological models and the effect of averaging, Phys. Rev. D 105, 063520 (2022), arXiv:1403.5229 [astro-ph.CO]\ndz_stephani1 A. Balcerzak and M. P. Dabrowski, Redshift drift in a pressure gradient cosmology, Phys. Rev. D 87, 063506 (2013), arXiv:1210.6331 [astro-ph.CO]\ndz_stephani2 A. Balcerzak, Redshift drift and inhomogeneities, AIP Conf. Proc. 1514, 128 (2013)\ndz_BianchiI_1 P. Fleury, C. Pitrou, and J.-P. Uzan, Light propagation in a homogeneous and anisotropic universe, Phys. Rev. D 91, 043511 (2015), arXiv:1410.8473[gr-qc]\ndz_BianchiI_2 S. M. Koksbang, Observations in statistically homogeneous, locally inhomogeneous cosmological toy-models without FLRW backgrounds, Mon. Not. Roy. Astron. Soc. 498, L135 (2020), [Erratum: Mon.Not.Roy.Astron.Soc. 500, (2021)], arXiv:2008.07108 [astro-ph.CO]\ndz_pert_bianci Oton H. Marcori, Cyril Pitrou, Jean-Philippe Uzan, Thiago S. Pereira, Direction and redshift drifts for general observers and their applications in cosmology, Phys. Rev. D 98, 023517 (2018), arXiv:1805.12121v1 [astro-ph.CO]\nLinder_dz1 Alex G. Kim, Eric V. Linder, Jerry Edelstein, David Erskine, Giving Cosmic Redshift Drift a Whirl, Astroparticle Physics 62, 195 (2015), arXiv:1402.6614v2 [astro-ph.CO]\nLinder_dz2 Eric V. Linder, Constraining Models of Dark Energy, arXiv:1004.4646v1 [astro-ph.CO]\n\ndz_ES S. M. Koksbang, On the relationship between mean observations, spatial averages and the Dyer-Roeder approximation in Einstein-Straus models, JCAP11(2020)061, arXiv:2010.04500v2 [astro-ph.CO]  \n\n\n\n\ndz_test1 J.-P. Uzan, C. Clarkson, and G. F. R. Ellis, Time drift of cosmological redshifts as a test of the Copernican principle, Phys. Rev. Lett. 100, 191303 (2008), arXiv:0801.0068 [astro-ph]\ndz_test2 S. M. Koksbang, Quantifying effects of inhomogeneities and curvature on gravitational wave standard siren measurements of H(z), \tPhys. Rev. D 106, 063514 (2022), arXiv:2208.12450v2 [astro-ph.CO]\ndz_test3 S. M. Koksbang, Searching for signals of inhomogeneity using multiple probes of the cosmic expansion rate H(z), Phys. Rev. Lett. 126, 231101 (2021), arXiv:2105.11880v1 [astro-ph.CO]\n\nanother_look S. M. Koksbang, Another look at redshift drift and the backreaction conjecture, JCAP10(2019)036, arXiv:1909.13489v1 [astro-ph.CO]\n\n\n\nfluid1  Thomas Buchert: On average properties of inhomogeneous fluids in general relativity I: dust cosmologies, Gen.Rel.Grav. 32 (2000) 105-125, arXiv:gr-qc/9906015v2\nfluid2 Thomas Buchert, On average properties of inhomogeneous fluids in general relativity II: perfect fluid cosmologies, Gen.Rel.Grav.33:1381-1405,2001, arXiv:grqc/0102049v2\nfluid3 Thomas Buchert, Pierre Mourier, Xavier Roy, On average properties of inhomogeneous fluids in general relativity III: general fluid cosmologies, Gen. Rel. Grav. 52 (2020) 27, arXiv:1912.04213v2 [gr-qc]\n\n\nAsta_dz_DE Asta Heinesen, Redshift drift as a model independent probe of dark energy, Phys. Rev. D 103, L081302 (2021), arXiv:2102.03774v1 [gr-qc] \n\ntimescape David L. Wiltshire, Average observational quantities in the timescape cosmology, Phys.Rev.D80:123512,2009, arXiv:0909.0749v2 [astro-ph.CO] \ntimescape2 David L. Wiltshire, Gravitational energy as dark energy: Average observational quantities, AIP Conf.Proc.1241:1182-1191,2010, arXiv:0912.5236v1 [astro-ph.CO]\n\n\npec_acc_not1 K. Lake, Remark on Peculiar Corrections to the Time Evolution of the Cosmological Redshift, Astrophysical Letters, Vol. 23, p.23\n\n\nSee e.g. also S. Phillipps, On the Time Evolution of the Cosmological Redshift, Astrophysical Letters, Vol. 22, p.123, 1982\n\npec_acc_not2 Madhura Killedar, Geraint F. Lewis, Lyman alpha absorbers in motion: consequences of gravitational lensing for the cosmological redshift drift experiment, Mon. Not. R. Astron. Soc. 402, 650–656 (2010), arXiv:0910.4580v1 [astro-ph.CO]\npec_acc_not3 Ryan Cooke, The ACCELERATION programme: I. Cosmology with the redshift drift, Mon. Not. R. Astron. Soc., 492, 2044–2057 (2020), arXiv:1912.04983v1 [astro-ph.CO]\n\n\nAsta_first_dz Asta Heinesen, Multipole decomposition of redshift drift – model independent mapping of the expansion history of the Universe, Phys. Rev. D 103, 023537 (2021), arXiv:2011.10048v1 [gr-qc]\n\n\noptical_effects Mikolaj Korzynski, Jaroslaw Kopinski, Optical drift effects in general relativity, JCAP03(2018)012, arXiv:1711.00584v4 [gr-qc]\nbigOnLight  M. Grasso and E. Villa, BiGONLight: light propagation with bilocal operators in numerical relativity, Class. Quant. Grav. 39, 015011 (2022), arXiv:2107.06306 [grqc]\n\nAsta_cosmography Asta Heinesen, Redshift drift cosmography for model-independent cosmological inference, Phys. Rev. D 104 (2021), 123527, arXiv:2107.08674v2 [astro-ph.CO]\nnonlinearities M. Grasso, E. Villa, M. Korzynski, and S. Matarrese, Isolating nonlinearities of light propagation in inhomogeneous cosmologies, Phys. Rev. D 104, 043508 (2021),arXiv:2105.04552 [astro-ph.CO]\n\n\n\nparallax Syksy Rasanen, A covariant treatment of cosmic parallax, JCAP03(2014)035, arXiv:1312.5738v3 [astro-ph.CO]\nposition_drift1 Andrzej Krasinski, Spacetimes with no position drift, arXiv:2208.10440v1 [gr-qc]\nposition_drift2 Andrzej Krasinski, Krzysztof Bolejko, Exact inhomogeneous models and the drift of light rays induced by nonsymmetric flow of the cosmic medium, International Journal of Modern Physics D Vol. 22, No. 06, 1330013 (2013), arXiv:1212.4697v3 [gr-qc]\nposition_drift3 Andrzej Krasinski, Repeatable light paths in the conformally flat cosmological models, \tPhys. Rev. D86, 064001 (2012), arXiv:1205.6341v3 [gr-qc] \n\nLTB1 G. Lemaitre: L'Universe en expansion, Annales de la Societe Scientifique de Bruxelles A 53, 51 (1933), English translation: The expanding universe, Gen. Rel. Grav. 29, 637 (1997)\nLTB2 R. C. Tolman: Effect of Inhomogeneity on Cosmological Models, Proc. Natl. Acad. Sci. USA 20, 169-176 (1934)\nLTB3 H. Bondi: Spherically Symmetrical Models in General Relativity, Month. Not. Roy. Astr. Soc. 107,410 (1947)\n\n\nGadget Volker Springel, Naoki Yoshida, Simon D.M. White, GADGET: A code for collisionless and gasdynamical cosmological simulations, New Astron.6:79,2001, arXiv:astro-ph/0003162v3\n\nGadget2 Volker Springel, The cosmological simulation code GADGET-2, \tMon.Not.Roy.Astron.Soc. 364 (2005) 1105-1134, arXiv:astro-ph/0505010v1\n\nGreenWaldMap  S. R. Green and R. M. Wald, Newtonian and Relativistic Cosmologies, Phys. Rev. D85 (2012) 063512, arXvi:1111.2997\n\n\nsyksy_light Syksy Rasanen, Light propagation in statistically homogeneous and isotropic universes with general matter content, JCAP 1003:018,2010, arXiv:0912.3370v2 [astro-ph.CO]\n\nacc_dz Luca Amendola, Claudia Quercellini, Amedeo Balbi, Peculiar acceleration, Phys.Lett.B660:81-86,2008, arXiv:0708.1132v1 [astro-ph]\nvariance_dz Jean-Philippe Uzan, Francis Bernardeau, Yannick Mellier, Time drift of cosmological redshifts and its variance, Phys.Rev.D77:021301,2008, arXiv:0711.1950v2 [astro-ph]\n\n\n\ndr S. M. Koksbang, Understanding the Dyer-Roeder approximation as a consequence of local cancellations of projected shear and expansion rate fluctuations, Phys. Rev. D 104, 043505 (2021), arXiv:2106.12913 [astro-ph.CO]\n\nsyksy_pert Syksy Rasanen, Light propagation and the average expansion rate in near-FRW universes, Phys. Rev. D 85, 083528 (2012), arXiv:1107.1176v2 [astro-ph.CO]\ntardis Mikko Lavinto, Syksy Rasanen, Sebastian J. Szybka, Average expansion rate and light propagation in a cosmological Tardis spacetime, JCAP12(2013)051, arXiv:1308.6731v2 [astro-ph.CO]\ncheese S. M. Koksbang, Light propagation in Swiss cheese models of random close-packed Szekeres structures: Effects of anisotropy and comparisons with perturbative results, Phys. Rev. D 95, 063532 (2017), arXiv:1703.03572v2 [astro-ph.CO]\n\nkinematical Thomas Buchert, Dark Energy from structure: a status report, Gen.Rel.Grav.40:467-527,2008, arXiv:0707.2153v3 [gr-qc]\nkinematical2 E.W. Kolb, S. Matarrese, A. Riotto, On cosmic acceleration without dark energy, New J.Phys.8:322,2006,  arXiv:astro-ph/0506534v2\n\nlightcone  M. Gasperini, G. Marozzi, F. Nugier and G. Veneziano, Light-cone averaging in cosmology: Formalism and applications, JCAP 1107, 008 (2011), arXiv:1104.1167 [astro-ph.CO]\n\n\nG. Fanizza, M. Gasperini, G. Marozzi, G. Veneziano, A new approach to the propagation of light-like signals in perturbed cosmological backgrounds, JCAP08(2015)020, arXiv:1506.02003v2 [astro-ph.CO] \n\n\nErmis Mitsou, Giuseppe Fanizza, Nastassia Grimm, Jaiyul Yoo, Cutting out the cosmological middle man: General Relativity in the light-cone coordinates, Class.Quant.Grav. 38 (2021) no. 5, 055011, arXiv:2009.14687v2 [gr-qc]\n\nGiuseppe Fanizza, Giovanni Marozzi, Matheus Medeiros, Gloria Schiaffino, The Cosmological Perturbation Theory on the Geodesic Light-Cone background, JCAP 02 (2021) 014, arXiv:2009.14134v2 [gr-qc]\n\n\nnull_cone Thomas Buchert, Henk van Elst, Asta Heinesen, The averaging problem on the past null cone in inhomogeneous dust cosmologies,  arXiv:2202.10798v1 [gr-qc]\n\nquiet Asta Heinesen, Hayley J. Macpherson, A prediction for anisotropies in the nearby Hubble flow, JCAP03(2022)057, arXiv:2111.14423v1 [astro-ph.CO] \n\nacoleyen Karel Van Acoleyen, LTB solutions in Newtonian gauge: from strong to weak fields, JCAP0810:028,2008, arXiv:0808.3554v2 [gr-qc]\n\n\nishak Anthony Nwankwo, Mustapha Ishak, John Thompson, Luminosity distance and redshift in the Szekeres inhomogeneous cosmological models, JCAP 1105:028, 2011, arXiv:1005.2989v3 [astro-ph.CO]\n\n\n\t\n"}