{"entry_id": "http://arxiv.org/abs/2303.06894v1", "published": "20230313065654", "title": "Axial collective mode of a dipolar quantum droplet", "authors": ["P. Blair Blakie"], "primary_category": "cond-mat.quant-gas", "categories": ["cond-mat.quant-gas"], "text": "\n\n\n Dodd-Walls Centre for Photonic and Quantum Technologies and Department of Physics, University of Otago, Dunedin 9016, New Zealand\n\n  \n \n \n \nIn this work, we investigate the ground state properties and collective excitations of a dipolar Bose-Einstein condensate that self-binds into a quantum droplet, stabilized by quantum fluctuations. We demonstrate that a sum rule approach can accurately determine the frequency of the low energy axial excitation, using properties of the droplet obtained from the ground state solutions. This excitation corresponds to an oscillation in the length of the  filament-shaped droplet. Additionally, we evaluate the static polarizabilities, which quantify change in the droplet dimensions in response to a change in harmonic confinement.\n\n Axial collective mode of a dipolar quantum droplet\n    P. Blair Blakie\n    March 30, 2023\n==================================================\n\n\n \n\n\n  \n\n\n§ INTRODUCTION\n\nA dipolar Bose-Einstein condensate (BEC) is made up of particles with a significant dipole moment, making dipole-dipole interactions (DDIs) important. Highly magnetic atoms have been used in experiments to create dipolar BECs <cit.> and explore various phenomena arising from these interactions <cit.>.\nIn the dipole-dominated regime, where DDIs dominate over short-ranged interactions, quantum droplets can be formed. These droplets are mechanically unstable at the mean-field level, but are stabilized against collapse by quantum fluctuations  <cit.>. Experiments using dysprosium <cit.> and erbium <cit.> atoms have prepared and measured various properties of these quantum droplets, which have a filament-like shape due to the anisotropy of the DDIs.\n\n \nThe extended Gross-Pitaevskii equation (EGPE) provides a theoretical description of the ground states and dynamics of quantum droplets, incorporating quantum fluctuation effects within a local density approximation. The collective excitations of  these quantum droplets are described by the Bogoliubov-de Gennes (BdG) equations, which can be obtained by linearizing the time-dependent EGPE about a ground state. Baillie et al. <cit.> presented the results of numerical calculations of the collective excitations of a  dipolar quantum droplet (also see <cit.>). Additionally, a class of three shape excitations has been approximated using a Gaussian variational ansatz <cit.>. Experiments have measured the lowest energy shape excitation, corresponding to the lowest nontrivial axial mode, for a large trapped droplet <cit.>. Experiments with dysprosium droplets have also  measured the scissors-mode <cit.>.   \n\nIn this paper,  we consider dipolar quantum droplet ground states and the m=0 (projection of angular momentum quantum number) collective excitations in free-space   and in trapped cases. We focus on a low energy axial collective excitation, which softens to zero energy to reveal the unbinding (evaporation) point for a free-space quantum droplet.\nWe use a sum rule approach to estimate the excitation frequency of this mode in terms of the ground state properties, including its static response to a small change in the axial trapping frequency. We compare the result of this sum rule method to the excitation frequency obtained by direct numerical solution of the BdG equations. We verify that the sum rule predictions are accurate over a wide parameter regime, including deeply bound droplet states, droplets close to the unbinding threshold, and in the trapped situation where the droplet crosses over to a trap-bound BEC. \n\n\n \n\n§ FORMALISM\n\n\n\n §.§ Ground states\n\n \nHere we consider a gas of magnetic bosonic atoms described by EGPE energy functional \n\n    E    = ∫ d ψ^*[h_sp+12g_s|ψ|^2+12  +25|ψ|^3]ψ,\n \nwhere \n\n    h_sp   =-ħ^2/2M∇^2+V(𝐱),\n    \n    V(𝐱)   =1/2M (ω_x^2x^2+ω_y^2y^2+ω_z^2z^2),\n \nare the single particle Hamiltonian and the harmonic trapping potential, respectively.\nHere g_s = 4πħ^2 a_s/M is the coupling constant for the contact interactions, where a_s is the s-wave scattering length.\nThe  potential\n\n    ()=∫ d' (-')|ψ(')|^2,\n\ndescribes the long-ranged DDIs, where the magnetic moments of the atoms are polarized along z with\n\n    () = 3/4π r^3(1-3z^2/r^2).\n\nHere =4πħ^2/M is the DDI coupling constant, with = Mμ_0μ_m^2/12πħ^2 being the dipolar length, and μ_m the atomic magnetic moment. The quantum fluctuations are described by the nonlinear term with coefficient = 32/3 g_s√(a_s^3/π)𝒬_5() where \n\n    𝒬_5(x)={∫_0^1 du [1+x(3u^2 - 1)]^5/2},\n <cit.> and ≡/a_s.   We constrain solutions to have a fixed number of particles N and ground state solutions satisfy the EGPE \n\n    μψ   = ℒ_EGPψ,\n\n where μ is the chemical potential and we have introduced\n \n    ℒ_EGPψ   =(h_sp+ g_s|ψ|^2+  + |ψ|^3 )ψ.\n\n For the results we present here we leverage the  algorithm developed in Ref. <cit.> to calculate the ground states. \n \n\n\n §.§ Excitations\n\n\n\n  §.§.§ Bogoliubov-de Gennes theory\n\n The collective excitations are described within the framework of Bogoliubov theory.  These excitations can be obtained by linearising the time-dependent EGPE  iħΨ̇= ℒ_EGPΨ around a ground state using an expansion of the form \n\n    Ψ=e^-iμ t   [ψ(𝐱) +∑_ν{λ_ν u_ν(𝐱)e^-iω_νt-λ_ν ^*v^*_ν(𝐱)e^iω_νt}],\n\nwhere  λ_ν are the (small) expansion coefficients.\nThe excitation modes  u_ν,v_ν and frequencies ω_ν satisfy the BdG equations\n\n    [    ℒ_EGP - μ + X               -X;                X -(ℒ_EGP - μ + X) ][ u_ν; v_ν ]   = ħω_ν[ u_ν; v_ν ],\n\n\nwhere X is the exchange operator given by\n\n\n    Xf ≡   g_s|ψ_0|^2f+ψ_0∫ d𝐱' U_dd(𝐱-𝐱') f(𝐱')ψ_0^*(𝐱')\n       \n       +32 γ_QF |ψ_0|^3f.\n\nMore details of the Bogoliubov analysis of the EGPE can be found in Ref. <cit.>.  Here we will consider problems with rotational symmetry about the z axis, which restricts the trap to  cases with ω_x=ω_y. This symmetry means that the excitations can be chosen to have a well-defined z-component of angular momentum, ħ m, where we have introduced   m=0,±1,±2,… as the quantum number. \n\n\n\n\n  §.§.§ Sum rule approach for lowest compressional mode\n\nWe now wish to discuss a method for extracting the low energy axial compressional mode. We consider the mode excited by  the axial operator σ_z=∫ d𝐱 ψ̂^† z^2ψ̂,  where ψ̂ is the bosonic quantum field operator.\n The energy (ħω_ub) of the lowest mode excited by σ_z  has an upper bound provided by the ratio √(m_1/m_-1), where  we have introduced m_p=∫ dω (ħω)^pS_z(ω) as the p-moment of  S_z(ω) <cit.>. \nHere \n\n    S_z(ω)=ħ∑_p|⟨ p |σ_z|0⟩|^2δ(E_p-E_0-ħω),\n\n is the zero temperature dynamic structure factor, with |p⟩ being the eigenstate of the second quantized Hamiltonian  H of energy E_p, and |0⟩ denotes the ground state. \n The m_1 moment can be evaluated using a commutation relation as\n \n    m_1=1/2⟨ 0|[σ_z,[H,σ_z]]|0⟩=2Nħ^2⟨ z^2⟩/M.\n\nThe m_-1 moment can be evaluated as m_-1=1/2χ_zz (see <cit.>), where χ_zz is the static polarizability quantifying the linear response of σ_z  to the application of  the  perturbation -λσ_z to the Hamiltonian, i.e. δ⟨σ_z⟩=λχ_zz.  Setting λ≡ -1/2M δω_z^2, we see that this  perturbation is equivalent to a change in the axial trapping frequency, and hence the static polarizability can be evaluated as\n\n    χ_zz=-2Nδ⟨ z^2⟩/Mδω_z^2,\n\nalso see <cit.>. Thus we obtain the following as an upper-bound estimate of the lowest mode frequency\n\n    ω_ub=√(4N⟨ z^2⟩/Mχ_zz).\n\nA similar approach was used in Ref. <cit.> to estimate the scissors mode frequency of a dipolar droplet, but in that work the z-component of angular momentum was the relevant excitation operator.\n \n It is also of interest to understand the static polarizability quantifying the change in the transverse width (with operator  σ_ρ=∫ d𝐱 ψ̂^†ρ^2ψ̂, where ρ=√(x^2+y^2)) to the axial perturbation, i.e. \n \n    χ_ρ z=-2Nδ⟨ρ^2⟩/Mδω_z^2.\n\nLater we will consider both the axial χ_zz and transverse χ_ρ z static polarizabilities to characterize the quantum droplet behavior.\n \n  \n \n\n\n \n\n§ RESULTS FOR FREE-SPACE DROPLETS\n\n \n\n §.§ Energetics\n\n In Fig. <ref>  we consider a free-space (self-bound) ^164Dy droplet for a_s=80 a_0 (i.e. ϵ_dd=1.64) as a function of N. For N>N_crit≈2020 a self-bound droplet solution exists[This value of N_crit is slightly higher than the value obtained  in Ref. <cit.> for the same physical parameters. This is because we use the result mathcalQ_5(ϵ_dd), rather than the approximation 1+3/2ϵ_dd^2, to define γ_QF.],  while for N<N_crit there is no droplet solution, and the atoms expand to fill all space.\n  In Fig. <ref>(a) we examine the energy of the free-space droplet, seeing that as N approaches N_crit from above the total energy of the droplet becomes positive (for N≲2,350, see inset). When the energy is positive the droplet is metastable.  We show some examples of the droplet states in  Fig. <ref>(c) to give some context on the size and shape of the droplet as N varies.\n  \n  We also consider the components of energy, defined by\n  \n    E_kin   =-ħ^2/2M∫ d𝐱 ψ^*∇^2ψ,\n    \n     E_pot   =∫ d𝐱  V(𝐱)|ψ|^2,\n    \n     E_s    =1/2g_s∫ d𝐱 |ψ|^4,\n    \n     E_dd   =1/2∫ d𝐱 Φ_dd(𝐱)|ψ|^2,\n    \n      E_QF   =2/5∫ d𝐱 |ψ|^5\n\n as the kinetic, potential, contact interaction, DDI, and quantum fluctuation energy, respectively. \nFor this free-space case E_pot=0. We observe that the DDI and contact interaction energies are the largest energies by magnitude, but have opposite sign. The quantum fluctuation term is necessary to stabilise the droplet solution against mechanical collapse driven by the interaction terms, but is typically significantly smaller in magnitude than either of the interaction energies. The kinetic energy is smaller than all other components except  when N→ N_crit,  where it can exceed   E_QF.\n \nA virial relation for the system can be obtained by considering how the energy functional transforms under a scaling of coordinates (e.g. see <cit.>). For the dipolar EGPE in a harmonic trap this relation is \n \n    Λ≡ E_kin-E_pot+3/2(E_s+E_dd)+9/4E_QF=0,\n\n and provides a connection between the energy components   <cit.>. In Fig. <ref>(a) we show Λ for reference.  This turns out to be a sensitive test of the accuracy of dipolar quantum droplet solutions <cit.>, and the results we present here typically have |Λ/Nh|≪10^-3Hz. \n \n \n \n \n  \n \n  \n \n\n §.§ Excitations\n\n\n \n  In Fig. <ref>(b) we show the spectrum of m=0 modes in the droplet as a function of N. Excitations for other m values have been examined in Ref. <cit.>. The lowest energy excitation branch for the quantum droplets is m=0 (this is not the case for vortex states, e.g. see <cit.>).  We note that the excitations are measured relative to the condensate chemical potential. Thus excitations with ħω_ν>-μ are unbounded by the droplet potential and are part of the continuum. For this reason we only calculate excitations with ħω_ν<-μ. From these results we observe that the lowest  m=0 mode goes soft (i.e. approaches zero energy) as N→ N_crit. This indicates the onset of a dynamical instability of the self-bound state. We also show the excitation frequency bound ω_ub obtained from ground state calculations according to Eq. (<ref>). This is seen to be in good agreement with the BdG result for the lowest excitation over the full range of atom numbers considered.\n  \n  \n \n\n  \n  In Fig. <ref>(c) we show results for the static polarizabilities. The axial result χ_zz [used in Eq. (<ref>)] is always positive, reflecting that the application of a weak axial confinement to the free-space droplet causes it to shorten. The magnitude of χ_zz tends to be much larger than χ_ρ z, so we have scaled it by a factor of 10^-2 to make the two polarizabilities easier to compare.  The transverse response χ_ρ z changes sign depending on the atom number. In the deeply bound droplet regime (i.e. for N>5× 10^3, where μ is large and negative), it is negative. Thus a weak compression along z results in the droplet expanding transversally.  In contrast, closer to the unbinding threshold (N<5× 10^3),  χ_ρ z  is positive, and the transverse width will decrease with axial compression. This occurs as the lowest m=0 mode starts to soften.  This change in  behaviour of the transverse response occurs as the lowest excitation mode changes from quadrupolar character at high N to monopole (compressional) character at low N <cit.>.\n  \n  \n  \n \n\n §.§ Results with varying a_s\n\n \nIn Fig. <ref>(a) we show results for the m=0 excitations of a free-space droplet with a fixed number N=10^4, but with a_s varying. Here the droplet unbinds at a_s≈98.5 a_0, when the lowest energy mode goes soft. The BdG calculations for the energy of the lowest mode are again seen to be in good agreement with the results of Eq. (<ref>). In  Fig. <ref>(b) we examine the response of the ground state to a change in axial confinement.  For the deeply bound droplet  (a_s≲  87 a_0) χ_ρ z is negative, while close to unbinding (a_s≳  87 a_0) it becomes positive [see inset to Fig. <ref>(b)]. \n\n \n \n \n \n\n \n\n§ RESULTS FOR TRAPPED DROPLET\n\n In Fig. <ref>(a) we show the excitation spectrum for a droplet confined in a weak cigar-shaped trap (ω_x,y,ω_z)=2π×(20,10)Hz. This geometry allows a smooth crossover between a self-bound droplet and a trap-bound dipolar BEC. Apart from the trap, the parameters of these results are otherwise identical to the case studied in Fig. <ref>. For a_s≲95 a_0 the lowest excitation energies, and chemical potential are similar for the trapped and untrapped cases. A notable feature is the emergence of a Kohn mode at the axial trap frequency[The transverse Kohn modes, with frequency ω_x,y, are in the m=±1 excitation branches and do not appear here.] ω_z. For a_s≳95 a_0 the trap starts playing an increasingly important role. In this regime the droplet self-binding begins to fail and the trap provides the confinement  [see Fig. <ref>(c)].  As this happens the chemical potential becomes positive. Since the trap binds excitations at all energy scales, we show BdG results with ħω_ν>-μ.\n \n \nFor the full range of parameters considered in  Fig. <ref>(a)   Eq. (<ref>) is seen to provide an accurate description of the axial mode. The lower energy Kohn mode has no effect on our sum rule since the symmetry of the that mode does not couple tothe σ_z operator. \n  In Fig. <ref>(a) we also present results for the transverse equivalent of Eq. (<ref>), i.e. \n  \n    ω_2≡√(4N⟨ρ^2⟩/Mχ_ρρ),\n\n  where δ⟨σ_ρ⟩=λχ_ρρ defines the static polarizability for a transverse perturbation of -λσ_ρ. \n  The frequency estimate of Eq. (<ref>) is in reasonable agreement with the second even mode in the trap-bound region, but ascends to a high frequency in the droplet regime. These results indicate that Eq. (<ref>) is of limited use in the droplet regime. \n    \n    We  show results for the static polarizabilities in Fig. <ref>(b). In the droplet regime χ_zz≫|χ_ρρ|,|χ_ρ z|, while in the trap-bound regime they all become of comparable magnitudes. Interestingly χ_ρ z is positive at intermediate values of a_s.  Correspondingly we find that the axial mode changes character from being a quadrupolar excitation at low a_s values, to monopolar at intermediate values, before returning to quadrupolar character at high values of a_s. Aspects of this behavior has also been described within a variational Gaussian approach <cit.>.\n  \n  \n    \n  \n\n§ CONCLUSIONS\n\n  \n In this work we have presented results for the ground state properties of quantum droplets, their collective excitations and static polarizibility related to  a change in confinement. The lowest energy collective mode has been measured in experiments by  Chomaz et al. <cit.>, and plays a critical role in the instability of a free-space droplet. We have shown that a simple sum rule approach can accurately predict the frequency of this mode over a wide parameter regime. Our results for the static polarizabilities quantify changes in the widths of the droplet in response to variations in the axial or transverse confinement. We observe that the transverse static polarizability (to an axial confinement change) is negative in deeply-bound droplets and crosses over to being positive in weakly-bound or trap-bound droplets. This change correlates with lowest excitation changing from  quadrupolar (incompressible) to monopolar (compressible) character. \n  \n\n \n \n\n\n§ ACKNOWLEDGMENTS\n\nPBB wishes to acknowledge use of the New Zealand eScience Infrastructure (NeSI) high performance computing facilities and support from the Marsden Fund of the Royal Society of New Zealand. Helpful discussions with D. Baillie, A.-C. Lee and J. Smith are acknowledged.\n \n\n\n\n\n\n\n\n\n27\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[Griesmaier et al.(2005)Griesmaier, Werner, Hensler, Stuhler, and Pfau]Griesmaier2005a\n  author author Axel Griesmaier, author Jörg Werner, author Sven Hensler,\n  author Jürgen Stuhler,  and  author Tilman Pfau, title title Bose-Einstein condensation of\n  chromium, 10.1103/PhysRevLett.94.160401 journal journal Phys. Rev. Lett. volume 94, pages 160401 (year\n  2005)NoStop\n[Beaufils et al.(2008)Beaufils, Chicireanu, Zanon, Laburthe-Tolra, Maréchal, Vernac,\n  Keller, and Gorceix]Beaufils2008\n  author author Q. Beaufils, author R. Chicireanu, author T. Zanon,\n  author B. Laburthe-Tolra,\n  author E. Maréchal, author L. Vernac, author\n  J.-C. Keller,  and author\n  O. Gorceix, title title All-optical production of chromium Bose-Einstein\n  condensates, 10.1103/PhysRevA.77.061601 journal journal Phys. Rev. A volume\n  77, pages 061601 (year 2008)NoStop\n[Lu et al.(2011)Lu,\n  Burdick, Youn, and Lev]Mingwu2011a\n  author author Mingwu Lu, author Nathaniel Q. Burdick, author Seo Ho Youn,\n   and author Benjamin L. Lev,  title title Strongly dipolar\n  Bose-Einstein condensate of dysprosium, 10.1103/PhysRevLett.107.190401 journal journal\n  Phys. Rev. Lett. volume 107, pages\n  190401 (year 2011)NoStop\n[Aikawa et al.(2012)Aikawa,\n  Frisch, Mark, Baier,\n  Rietzler, Grimm, and Ferlaino]Aikawa2012a\n  author author K. Aikawa, author A. Frisch,\n  author M. Mark, author\n  S. Baier, author A. Rietzler, author R. Grimm,  and author F. Ferlaino, title title Bose-Einstein condensation of erbium, 10.1103/PhysRevLett.108.210401 journal journal\n  Phys. Rev. Lett. volume 108, pages\n  210401 (year 2012)NoStop\n[Lahaye et al.(2009)Lahaye,\n  Menotti, Santos, Lewenstein,  and Pfau]Lahaye_RepProgPhys_2009\n  author author T Lahaye, author C Menotti,\n  author L Santos, author M Lewenstein,  and author T Pfau, title\n  title The physics of dipolar bosonic quantum gases,  http://stacks.iop.org/0034-4885/72/126401 journal\n  journal Rep. Prog. Phys. volume 72,  pages 126401 (year 2009)NoStop\n[Chomaz et al.(2022)Chomaz,\n  Ferrier-Barbut, Ferlaino, Laburthe-Tolra, Lev, and Pfau]Chomaz2023a\n  author author Lauriane  Chomaz, author Igor Ferrier-Barbut, author Francesca Ferlaino, author Bruno Laburthe-Tolra, author Benjamin L  Lev,  and author Tilman  Pfau, title title\n  Dipolar physics: a review of experiments with magnetic quantum gases,  10.1088/1361-6633/aca814 journal journal Reports on Progress in Physics volume\n  86, pages 026401 (year 2022)NoStop\n[Lee et al.(1957)Lee,\n  Huang, and Yang]LHY1957\n  author author T. D. Lee, author Kerson Huang,   and author C. N. Yang,  title title Eigenvalues and\n  eigenfunctions of a Bose system of hard spheres and its low-temperature\n  properties, 10.1103/PhysRev.106.1135 journal journal Phys. Rev. volume\n  106, pages 1135–1145 (year 1957)NoStop\n[Lima and Pelster(2011)]Lima2011a\n  author author Aristeu R. P.  Lima and author Axel  Pelster, title title\n  Quantum fluctuations in dipolar Bose gases, 10.1103/PhysRevA.84.041604 journal journal Phys.\n  Rev. A volume 84, pages 041604\n  (year 2011)NoStop\n[Lima and Pelster(2012)]Lima2012a\n  author author A. R. P.  Lima and author A. Pelster, title title Beyond\n  mean-field low-lying excitations of dipolar Bose gases, 10.1103/PhysRevA.86.063609 journal journal Phys.\n  Rev. A volume 86, pages 063609\n  (year 2012)NoStop\n[Petrov(2015)]Petrov2015a\n  author author D. S. Petrov, title title Quantum\n  mechanical stabilization of a collapsing Bose-Bose mixture, 10.1103/PhysRevLett.115.155302 journal journal Phys. Rev. Lett. volume 115, pages 155302 (year 2015)NoStop\n[Ferrier-Barbut et al.(2016)Ferrier-Barbut, Kadau, Schmitt,\n  Wenzel, and Pfau]Ferrier-Barbut2016a\n  author author Igor Ferrier-Barbut, author Holger Kadau, author Matthias Schmitt, author Matthias Wenzel,  and author Tilman Pfau, title title Observation of\n  quantum droplets in a strongly dipolar Bose gas, 10.1103/PhysRevLett.116.215301 journal journal\n  Phys. Rev. Lett. volume 116, pages\n  215301 (year 2016)NoStop\n[Wächtler and Santos(2016a)]Wachtler2016a\n  author author F. Wächtler and author L. Santos, title title Quantum\n  filaments in dipolar Bose-Einstein condensates, 10.1103/PhysRevA.93.061603 journal journal Phys.\n  Rev. A volume 93, pages 061603(R)\n  (year 2016a)NoStop\n[Bisset et al.(2016)Bisset,\n  Wilson, Baillie, and Blakie]Bisset2016a\n  author author R. N. Bisset, author R. M. Wilson,\n  author D. Baillie,  and  author P. B. Blakie, title title Ground-state phase diagram of a dipolar\n  condensate with quantum fluctuations, 10.1103/PhysRevA.94.033619 journal journal Phys.\n  Rev. A volume 94, pages 033619\n  (year 2016)NoStop\n[Kadau et al.(2016)Kadau,\n  Schmitt, Wenzel, Wink,\n  Maier, Ferrier-Barbut, and Pfau]Kadau2016a\n  author author Holger Kadau, author Matthias Schmitt, author Matthias Wenzel, author Clarissa Wink,\n  author Thomas Maier, author Igor Ferrier-Barbut,  and  author Tilman Pfau, title title Observing the Rosensweig instability\n  of a quantum ferrofluid, http://dx.doi.org/10.1038/nature16485\n  journal journal Nature volume 530, pages 194–197 (year\n  2016)NoStop\n[Schmitt et al.(2016)Schmitt, Wenzel, Böttcher,\n  Ferrier-Barbut, and Pfau]Schmitt2016a\n  author author Matthias  Schmitt, author Matthias  Wenzel, author Fabian  Böttcher, author Igor  Ferrier-Barbut,  and author Tilman Pfau, title title Self-bound droplets of a dilute magnetic quantum liquid, http://dx.doi.org/10.1038/nature20126 journal journal Nature volume 539, pages\n  259–262 (year 2016)NoStop\n[Chomaz et al.(2016)Chomaz,\n  Baier, Petter, Mark,\n  Wächtler, Santos, and Ferlaino]Chomaz2016a\n  author author L. Chomaz, author S. Baier,\n  author D. Petter, author M. J. Mark, author\n  F. Wächtler, author\n  L. Santos,  and author\n  F. Ferlaino, title title Quantum-fluctuation-driven crossover from a dilute\n  Bose-Einstein condensate to a macrodroplet in a dipolar quantum fluid,  10.1103/PhysRevX.6.041039 journal journal Phys. Rev. X volume 6, pages\n  041039 (year 2016)NoStop\n[Baillie et al.(2017)Baillie, Wilson, and Blakie]Baillie2017a\n  author author D. Baillie, author R. M. Wilson,\n   and author P. B. Blakie,  title title Collective excitations of\n  self-bound droplets of a dipolar quantum fluid, 10.1103/PhysRevLett.119.255302 journal journal\n  Phys. Rev. Lett. volume 119, pages\n  255302 (year 2017)NoStop\n[Pal et al.(2022)Pal,\n  Baillie, and Blakie]Pal2022a\n  author author Sukla Pal, author D. Baillie,  and  author P. B. Blakie, title title Infinite dipolar droplet: A simple\n  theory for the macrodroplet regime, 10.1103/PhysRevA.105.023308 journal journal\n  Phys. Rev. A volume 105, pages\n  023308 (year 2022)NoStop\n[Wächtler and Santos(2016b)]Wachtler2016b\n  author author F. Wächtler and author L. Santos, title title Ground-state\n  properties and elementary excitations of quantum droplets in dipolar\n  Bose-Einstein condensates, 10.1103/PhysRevA.94.043618 journal journal Phys.\n  Rev. A volume 94, pages 043618\n  (year 2016b)NoStop\n[Ferrier-Barbut et al.(2018)Ferrier-Barbut, Wenzel, Böttcher,\n  Langen, Isoard, Stringari,  and Pfau]Ferrier-Barbut2018c\n  author author Igor Ferrier-Barbut, author Matthias Wenzel, author Fabian Böttcher, author Tim Langen, author Mathieu Isoard, author Sandro Stringari,  and author Tilman Pfau, title title Scissors mode of\n  dipolar quantum droplets of dysprosium atoms, 10.1103/PhysRevLett.120.160402 journal journal\n  Phys. Rev. Lett. volume 120, pages\n  160402 (year 2018)NoStop\n[Lee et al.(2021)Lee,\n  Baillie, and Blakie]Lee2021a\n  author author Au-Chen Lee, author D. Baillie,  and  author P. B. Blakie, title title Numerical calculation of\n  dipolar-quantum-droplet stationary states, 10.1103/PhysRevResearch.3.013283 journal journal\n  Phys. Rev. Research volume 3, pages\n  013283 (year 2021)NoStop\n[Pitaevskii and Stringari(2016)]BECbook\n  author author Lev Pitaevskii and author Sandro Stringari, @noop  title Bose-Einstein\n  Condensation and Superfluidity, Vol. volume 164 (publisher Oxford University Press, year 2016)NoStop\n[Menotti and Stringari(2002)]Menotti2002a\n  author author Chiara Menotti and author Sandro Stringari, title title Collective\n  oscillations of a one-dimensional trapped bose-einstein gas, 10.1103/PhysRevA.66.043610 journal journal Phys. Rev. A volume 66, pages 043610 (year 2002)NoStop\n[Tanzi et al.(2019)Tanzi,\n  Roccuzzo, Lucioni, Famà,\n  Fioretti, Gabbanini, Modugno,\n  Recati, and Stringari]Tanzi2019b\n  author author L. Tanzi, author S. M. Roccuzzo,\n  author E. Lucioni, author F. Famà, author\n  A. Fioretti, author\n  C. Gabbanini, author\n  G. Modugno, author A. Recati,  and author S. Stringari, title title Supersolid symmetry breaking from compressional oscillations in a\n  dipolar quantum gas, 10.1038/s41586-019-1568-6\n  journal journal Nature volume 574, pages 382 (year\n  2019)NoStop\n[Dalfovo et al.(1999)Dalfovo, Giorgini, Pitaevskii, and  Stringari]Dalfovo1999\n  author author Franco Dalfovo, author Stefano Giorgini, author Lev Pitaevskii,  and author Sandro Stringari, title title Theory of\n  Bose-Einstein condensation in trapped gases, @noop  journal journal Rev. Mod. Phys. volume 71, pages 463 (year 1999)NoStop\n[Triay(2019)]Triay2019a\n  author author Arnaud Triay, @noop  title Existence of\n  minimizers in generalized Gross-Pitaevskii theory with the\n  Lee-Huang-Yang correction,  (year 2019), http://arxiv.org/abs/1904.10672 arXiv:1904.10672 [math-ph] NoStop\n[Lee et al.(2018)Lee,\n  Baillie, Bisset, and Blakie]Lee2018a\n  author author Au-Chen Lee, author D. Baillie,\n  author R. N. Bisset,  and  author P. B. Blakie, title title Excitations of a vortex line in an\n  elongated dipolar condensate, 10.1103/PhysRevA.98.063620\n  journal journal Phys. Rev. A volume 98, pages 063620 (year\n  2018)NoStop\n\n\n \n\n \n"}