{"entry_id": "http://arxiv.org/abs/2303.06887v1", "published": "20230313061017", "title": "Negative transverse magnetoresistance due to negative off-diagonal mass in linear dispersion materials", "authors": ["Yudai Awashima", "Yuki Fuseya"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall"], "text": "\n\n]Negative transverse magnetoresistance due to negative off-diagonal mass in linear dispersion materials\n\n\n\n\n^1 Department of Engineering Science, University of Electro-Communications, Chofu, Tokyo 182-8585, Japan\n^2 Institute for Advanced Science, University of Electro-Communications, Chofu, Tokyo 182-8585, Japan\nawashima@kookai.pc.uec.ac.jp\n\n\n\n\n\n\n\nThis study calculated the magnetoresistance (MR) in the Dirac electron system, Dresselhaus–Kip–Kittel (DKK) model, and nodal-line semimetals based on the semiclassical Boltzmann theory, with particular focus on the detailed energy dispersion structure.\nThe negative off-diagonal effective-mass was found to induce negative transverse MR owing to the energy dispersion effect.\nThe impact of the off-diagonal mass was more prominent in case of a linear energy dispersion.\nFurther, Dirac electron systems could realize negative MR even if the Fermi surface was perfectly spherical. The obtained negative MR in the DKK model may explain the long-standing mystery in p-type Si.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nSince its discovery by Thomson in 1857 <cit.>, magnetoresistance (MR) has garnered attention from both scientific and practical use perspectives, such as mobility measurements and sensitive magnetic sensors <cit.>.\nThe microscopic origin of orbital MR is the Lorentz force.\nTherefore, the essential properties of orbital MR must be explainable within the semiclassical theory. \nHowever, the simple semiclassical theory provided in textbooks <cit.> cannot comprehensively explain the properties of MR even in elementary systems.\nFor example, the simple semiclassical theory states that transverse MR (TMR) (current and magnetic field are perpendicular) is not observed in single carrier systems with parabolic dispersion.\nHowever, experiments have confirmed that many single carrier systems exhibit a clear TMR <cit.>.\nFurther, it states that longitudinal MR (LMR) (current and magnetic field are in parallel) should not be realized in every system owing to the absence of the Lorentz force in such a configuration.\nHowever, many systems have been experimentally shown to exhibit a finite LMR, and in certain cases, the LMR has been found to be larger than TMR <cit.>.\n\nEffective mass is considered a key aspect for understanding such unexpected properties. It is expressed as α_ij(=m_ij^-1)=ħ^-2∂^2E(k)/∂ k_i∂ k_j.\nConventional simple semiclassical theories assume a parabolic energy dispersion, where the effective mass is diagonal and constant (k-independent). However, the MR can exhibit unexpected properties in cases where the k-dependence or the off-diagonal components of the effective mass are involved.\nFor example, even for a single carrier system, the TMR has been observed owing to the k-dependent effective mass <cit.>.\nIn addition, the LMR becomes finite when the effective mass contains off-diagonal elements.\nMoreover, off-diagonal effective mass driven large LMR has been observed in multi carrier systems <cit.>.\n\nRecently, another anomalous MR, referred to as the negative MR has garnered renewed interest, particularly in Weyl semimetals from the perspectives of chiral anomaly and the Berry curvature<cit.>.\nFollowing this trend, it was recently proposed that the negative off-diagonal mass can induce negative MR in Weyl semimetals, irrespective of the chiral anomaly or the Berry curvature <cit.>.\nHowever, whether this concept of negative off-diagonal mass is common or specific to Weyl semimetals is yet to be understood.\n\nThus, this study showed that the concept of negative MR owing to the negative off-diagonal mass is considerably common, particularly in systems with a linear dispersion. This was realized through the examination of three different systems: the Dirac electrons, Dresselhaus–Kip–Kittel (DKK) model, and nodal-line semimetals.\nThese particular systems were selected because their energy dispersions contain a root sign, which easily yields the negative off-diagonal mass.\nFor example, the energy dispersion of the isotropic Dirac electron system considered in this study is expressed as follows <cit.>: \n\n    E^Dirac_±=±√(Δ^2+Δħ^2 k^2/m^*),\n\nwhere k^2=k_x^2+k_y^2+k_z^2, 2Δ is a band gap between the conduction and valence bands, m^* is the effective-mass, and ħ is the Dirac constant.\nThe off-diagonal component of the inverse mass α_xy can be calculated as follows: \n\n    α^Dirac_xy=-Δ^2 ħ^2 k_xk_y/m^*2(Δ^2+ Δħ^2 k^2/m^*)^3/2.\n\nAs evident, α_xy^ Dirac has a negative sign, which is because of appearance of k-dependence in the root sign.\n(Specifically, the positive or negative sign of the effective mass must be determined by excluding the factor k_x k_y, that is, by considering α̅_ij=α_ijk_ik_j/|k_i||k_j|.)\nSimilarly, the DKK model and the nodal-line semimetals possess the negative off-diagonal mass; however, their k-dependences are different.\nThis study also discussed the influence of the linearity of the energy dispersion on the off-diagonal elements.\n\n\n\n§ THEORY OF MAGNETORESISTANCE\n\nThe MR was calculated considering a combination of the semiclassical Boltzmann theory and the well-known Chambers formula<cit.>.\nUsing the Chambers formula, the conductivity σ̂ and resistivity ρ̂ are expressed as\n\n    σ_ij=e^2⟨ v_i(k)v̅_j(k)⟩_F,\n       ρ̂=σ̂^-1.\n\nwhere e (>0) is the elementary charge and ⟨⋯⟩_F=∫(dk/4π^3)⋯(-∂ f_0/∂ E) represents integration along the Fermi surface at low temperature (f_0 is the Fermi-Dirac distribution function at equilibrium).\nFurther, v(k) is the velocity of the electron obtained from the energy dispersion and is expressed as follows:\n\n    v(k)=1/ħ∂ E(k)/∂k.\n\nMoreover, v̅(k) is the velocity averaged over time for electrons moving in a magnetic field.\n\n    v̅(k)=∫_-∞^0dtv(k(t))exp(t/τ),\n       dk(t)/dt=-e/ħv(k)×B,\n\nwhere B is the magnetic field and τ is the relaxation time. The Chambers formula does not assume any specific material in the derivation process and is thus applicable to any arbitrary energy dispersion.\nHowever, the Chambers formula does not include effects derived from topological quantities such as the Berry curvature or chiral anomaly.\nThe following results were obtained based on the detailed structure of the energy dispersion without any topological effects.\n\n\n\n\n\n\n\n§ DIRAC ELECTRON SYSTEM\n\n\n\n\n\nFirst, the single-carrier isotropic Dirac electron system was examined. Its energy dispersion is expressed as Eq. (<ref>). Owing to the Fermi surface of this model being perfectly spherical, no MR is expected upon the application of the parabolic dispersion approximation to this model <cit.>.\nHowever, a large negative TMR was observed beyond the parabolic approximation.\nFigure. <ref> (a) shows the TMR calculated using the Chambers formula for an isotropic Dirac electron system with a magnetic field applied in the z-direction, B=(0,0, B).\nThe calculations yielded a negative TMR, -56% at μ B= 1.0 for E_F=15  meV, where μ is the mobility. \n(maximum permissible value of the negative MR was -100%).\nHere, μ B=1.0 corresponded to a relatively weak-field in Dirac electrons systems, where the effective mass was very small with a high mobility <cit.>. For example, μ B=1.0 corresponded to B=0.01 T when μ=100 T^-1.\nThis finite TMR was caused by the k-dependence of the effective mass. \nFurthermore, the negative TMR originated from the negative off-diagonal mass.\n\nThe Chambers formula Eq. (<ref>) is not appropriate for determining the physical origin of the field-dependence in the resistivity because the contribution from B is hidden.\nBy contrast, to clarify the physical origin of the field-dependence, the Jones-Zener expansion is extremely useful <cit.>.\nThus, the magneto-resistivity ρ_xx was expanded up to the second order with respect to B as follows:\n\n    ρ^(2)_xx=τ^2[R_xx+R_xy] B^2,\n       R_xx=Λ_x^2⟨ v_x^2(α_xxα_yy-α_xy^2)⟩_F\n       +Λ_x^2⟨ v_x^2(v_xγ_xyy)\n    +v_x^2(v_yγ_xxy+v_yγ_xyx)\n    -v_x^2(v_xγ_xxx)⟩_F.\n       R_xy=-Λ_x^2Λ_y⟨(v_xv_yα_xy-v_y^2α_yy)^2⟩_F\n\nwhere Λ_μ=1/⟨ v_μ⟩_F^2 and γ_ijk=ħ^-3∂^3E(k)/∂ k_i∂ k_j∂ k_k.\nR_xx originates from σ_xx(B), and R_xy originates from σ_xy^2(B).\nConsequently, it is evident that the coefficient of B^2 is mostly obtained in terms of the (invers) effective mass α_ij.\nTherefore, the intuitive understandings for the anomalous MR can be obtained upon an in-depth investigation of the properties of the effective-mass.\n\nThe key to the negative TMR are R_xy and α_xy, where the former negatively contributes to ρ_xx owing to the negative coefficient in Eq. (<ref>). In the ordinary case of α̅_xy >0, the negative contribution from R_xy is small because the α_yy-term offsets the α_xy-term.\nHowever, when α̅_xy<0, both the α_xy and α_yy cooperatively boost the negative contribution of R_xy.\nConsequently, the negative off-diagonal mass can realize the negative TMR.\n\nThe Dirac electron system is a typical example for such a negative off-diagonal mass induced negative TMR.\nFigure. <ref> (c) shows a plot α̅_xy as a function of k_x and k_y. \nThe majority of α̅_xy was negative. Further, α̅_xy was vanishingly small when k_x, y=0, although it was not positive.\nThe widespread negative region in α̅_xy causes the significantly negative TMR in the Dirac electron system.\n\nMoreover, the TMR of the Dirac electron system becomes zero in the region Δ≃ E_F, which can be approximated as the parabolic dispersion. \nThe energy dispersion Eq. (<ref>) can be approximated as \n\n    E^Dirac_+≃Δ+ħ^2/2m(k_x^2+k_y^2+k_z^2),\n \nfor Δ≃ E_F.\nThe off-diagonal mass becomes zero in case of this parabolic dispersion, and the k-dependence of the diagonal element vanishes.\nConsequently, the negative TMR should be vanishingly small when E_F approaches Δ.\n\n\n\n\n\n§ DKK MODEL\n\nThe DKK model is an effective model for investigating the valence band around the Γ point of Si and Ge.\nThe energy dispersion is expressed as<cit.>\n\n    E^DKK_±=Ak^2±√(B^2k^4+C^2(k_x^2k_y^2+k_y^2k_z^2+k_z^2k_x^2)).\n\nIt is expressed in a form that included the root sign similar to that in case of the Dirac electron system; that is, the negative TMR because of the negative off-diagonal mass is expected.\nIn Si, the parameters were A=-4.29, B=0.68, and C=4.87 in units of ħ^2/2m<cit.>.\nFurther, positive and negative signs corresponded to heavy and light hole, respectively <cit.>.\nFigure. <ref> (a) shows the energy dispersion of DKK model.\nThe single carrier MR was calculated for each heavy and light hole shown in Fig. <ref> (b).\nThe MR was always positive for heavy hole and saturated at 25%.\nHowever, for light hole, the MR increased up to μ B=0.2 and exhibited saturation signs at approximately 5%, after which it began to decrease and became negative at approximately μ B=1.0.\n\nIn the presence of both positive and negative off-diagonal masses, the behaviour of the MR is governed by the one dominant in the entire Fermi surface.\nThe effective mass α_xy in the DKK model is expressed as\n\n    α^DKK_xy=A_xA_y/(4ħ^2(D^DKK)^3)\n           ± k_xk_y(8B^2+4C^2)/(2ħ^2 D^DKK),\n       A_x=4B^2k^2k_x+C^2k_x(2k_y^2+2k_z^2),\n       A_y=4B^2k^2k_y+C^2k_y(2k_x^2+2k_z^2),\n       D^DKK=(B^2k^2+C^2(k_x^2k_y^2+k_y^2k_z^2+k_z^2k_x^2))^1/2.\n\nFigure. <ref> (c) shows a plot of α̅_xy of light hole against several k_z.\nNegative off-diagonal element was observed over a wide range; however, positive values appeared for certain values of k_z.\nThe entire Fermi surface, including all k_z, was dominated by negatives; however, positive values weakened the negative off-diagonal element.\nThe opposite was true for heavy hole, which exhibited a negative off-diagonal element in certain parts; however, a positive off-diagonal element was observed in the entire Fermi surface.\nThus, a heavy hole with a positive dominant off-diagonal element results in a positive MR. By contrast, a light hole with a dominant negative element yields a negative MR.\n\n\n\n\n\n\n\n§ NODAL-LINE SEMIMETALS\n\nIn nodal-line semimetals, the band gap is closed along the nodal-line in k space <cit.>.\nThe following Hamiltonian was proposed for nodal-line semimetals as an effective model obtained using the k·p theory<cit.>.\n\n    H^nodal={[ħ^2/2m(k_x^2+k_y^2)-u]τ_3+λ k_zτ_1}⊗σ_0.\n\nwhere σ̂ and τ̂ are the Pauli matrices in the spin and orbital spaces, respectively, and m, u, and λ are the model parameters.\nThe eigenvalue is expressed as\n\n    E^nodal_±=±√((ħ^2/2m(k_x^2+k_y^2)-u)^2+λ^2k_z^2).\n\nThe energy dispersion is shown in Fig. <ref> (a).\nParameter u exhibits an energy dimension and corresponds to the band gap size at the Γ point.\nFor u<E_F, the Fermi surface was a drumhead Fermi surface [Fig. <ref> (c)], and for u>E_F, it was a torus shaped Fermi surface [Fig. <ref> (d)].\n\n\n\n\n\n\n\n\nAs MR results from Lorentz forces, the off-diagonal mass perpendicular to the applied magnetic field is essential.\nFor example, α_xy for B=(0, 0, B) and α_yz for B=(B, 0, 0) are important factors that affect the MR.\nThe model used in this study was anisotropic in the k_z and k_x,k_y directions.\nTherefore, the effective-masses α^nodal_xy and α^nodal_yz differed significantly from each other.\nThe off-diagonal elements α^nodal_xy and α^nodal_yz of E^nodal_+ are\n\n    α^nodal_xy=λ^24ħ^2k_xk_yk_z^2/(2m)^2D^nodal,\n       α^nodal_yz=-λ^2k_yk_z[ ħ^2(k_x^2+k_y^2)/2m-u]/mD^nodal,\n       D^nodal={[ħ^2/2m(k_x^2+k_y^2)-u]^2+λ^2 k_z^2}^3/2.\n\n\nIn this effective model of the nodal-line semimetals, the behaviour of the TMR differed significantly depending on the direction of the magnetic field.\nHerein, the TMR characteristics were calculated for two magnetic field directions: B∥ z and B∥ x.\nThe TMR for B∥ z was positive MR for both u=0.0, 0.015 eV, particularly for u=0.015  eV, reaching 230% at μ B=3.0 [Fig. <ref> (a)].\nFurther, α̅^nodal_xy was always positive for the entire region, as shown in Fig. <ref> (b).\nBy contrast, the TMR for B∥ x decreased after reaching 80% for u=0.015  eV and 10% for u=0.0 eV [Fig. <ref> (c)].\nThe inset in Fig. <ref> (c) shows the calculation results when λ=1  eV.Å.\nCompared to the case with λ=0.32  eV.Å, the decreasing trend of MR was stronger and a negative MR was obtained at approximately μ B=1.0.\nIn contrast to the case of B∥ z, α̅^nodal_yz exhibited a negative region, particularly for u=0.0 [Fig. <ref> (d)].\nThis negative off-diagonal mass was the source of the decreasing TMR for B∥ x. \n\n\n\n\n§ DISCUSSION\n\n\n\n §.§ Linearity\n\nThe impact of the negative off-diagonal mass on the MR is observed to be more significant for systems with linear dispersion.\nThis study demonstrated the reason why the linear dispersion induced negative MR compared with the quadratic dispersion, through simple examples. \nSuppose that the linear and quadratic energy dispersions E^L and E^Q, respectively, are expressed as\n\n    E^L=√(Δ^2+Δ k^2),\n       E^Q=√(Δ^2+k^4).\n\n(Here, Δħ^2/m=1 was set for simplicity.)\nEach off-diagonal mass is expressed as follows:\n\n    α_xy^L=-Δ^2 k_xk_y/(Δ^2+Δ k^2)^3/2\n    ,\n       α_xy^Q=-4k^2k_xk_y/(Δ^2+k^4)^3/2+4k_xk_y/(Δ^2+k^4)^1/2\n    .\n\nWith linear dispersion, only the negative term appeared. Whereas, with quadratic dispersion, both negative and positive terms were found to coexist, thus offsetting each other.\n\n\nTherefore, the magnitude of the negative MR for the Dirac electrons (linear) was larger than that for the DKK model (quadratic).\nFurther, nodal line semimetals exhibited linear dispersion for one direction (k_z) and quadratic dispersion for two directions (k_x, k_y). Consequently, the nodal line semimetals exhibited behaviour in-between that of the Dirac electrons and the DKK model.\n\n\n\n\n\n §.§ Comparison with experiments\n\nA primary finding of the study is that the Dirac electrons exhibited significant negative TMR.\nHowever, typical Dirac electron systems, such as Bi and PbTe, have not been experimentally observed to exhibit negative TMR <cit.>.\nThe source of the discrepancy between theory and experiment is the multi-carrier nature.\nBi and PbTe have three and four Dirac valley at the L points in their Brillouin zone, respectively<cit.>.\nTo examine the manner in which the results of this study change in multi-carrier systems, the calculations performed on the Dirac electrons were extended to the four-valley system, which is an effective model for PbTe <cit.>.\n\n\n\n\n\nFour valleys of Dirac electrons were considered, where the long-axis of each Fermi surface was oriented along the four body-diagonal directions of the cubic (cf. the inset of Fig. <ref>). \nThe energy dispersion of the four-Dirac-valley model is expressed as\n\n    E_i^multi=√(Δ^2+Δħ^2/m^*k·Â_i·k)\n       Â_1=\n    [  1 -β -β; -β  1 -β; -β -β  1 ] ,Â_2=\n    [  1 -β  β; -β  1  β;  β  β  1 ] ,\n       Â_3=\n    [  1  β  β;  β  1 -β;  β -β  1 ] ,Â_4=\n    [  1  β -β;  β  1  β; -β  β  1 ].\n\nwhere β in Â_i is an anisotropic parameter and acquires the value of 0≤β≤ 1/2.\nFurther, it is fully isotropic at β=0 and fully anisotropic (i.e., a cylindrical Fermi surface) at β=1/2.\nThe total MR in the four-Dirac-valley model is obtained as\nρ̂_multi=(∑_i^4σ̂_i)^-1.\n\nFigure. <ref> shows the TMR calculated in the four-valley model. \nWhen only one Dirac carrier was considered, its MR exhibited a negative TMR.\nHowever, when simultaneously considering four Dirac carriers, the total MR became a positive TMR.\n\nThis transformation from negative to positive TMR can be understood on the basis of the off-diagonal mass.\nIn the multi-ellipsoidal model, the off-diagonal mass becomes finite and positive when the axis of ellipsoid is tilted from the orientation of the electric current <cit.>.\nThis positive off-diagonal mass owing to the multi-carrier contributes positively to the TMR.\nConsequently, in the multi-Dirac system, the positive off-diagonal mass owing to the multi-carrier nature suppresses the negative off-diagonal mass because of the linear dispersion, thus resulting in the transformation from negative to positive TMR.\nTherefore, the negative TMR of Dirac electrons should be observed only in the single-carrier Dirac electron systems, where the Dirac electrons are located at the Γ point.\n\nThe negative TMR has been already observed in p-type Si 60 years ago <cit.>. However, there exists no reasonable explanation for p-type Si exhibiting the negative TMR. Thus, the mechanism of the negative TMR remains a longstanding mystery.\nThe results for the DKK model may entail a reasonable explanation for this mystery. The negative off-diagonal mass of light hole yields negative TMR, and its negative contribution dominates the total TMR because the mobility of the light hole is much larger than that of the heavy hole.\n\nCertain nodal-line semimetals exhibit negative LMR and positive TMR <cit.>.\nHowever, to the best of our knowledge, no experimental study exhibiting negative TMR has been reported.\nA reason of this discrepancy between experiments and our theory can be attributed to the sensitivity to the direction of the magnetic field.\nAs shown in Sec. 5, the properties of the TMR change drastically according to the orientation of the magnetic field. \nTherefore, the negative TMR may be observed via the tuning of the magnetic field direction.\nAnother possible reason for the discrepancy is the multi-carrier nature of actual nodal-line semimetals.\nThe nodal-line semimetals generally have a very complex band structure, and they frequently contain other carriers in addition to the nodal-line carries<cit.>. \nThis multi-carrier nature induces the positive TMR as we have shown for the multi-Dirac model.\nTo comprehensively explain the MR experiments in the actual nodal-line semimetals, their complex band structure must be considered based on the Chambers formula, which will be a future problem.\nMoreover, if an ideal nodal-line material is discovered, the positive to negative TMR transformation can be observed by controlling the field orientation.\n\n\n\n§ SUMMARY\n\nThis study showed that the negative TMR can be realized in Dirac electrons, the DKK model, and the nodal-line semimetals based on the semi-classical Boltzmann theory with the Chambers formula.\nIt was emphasized that the negative TMR was induced by the negative off-diagonal mass, considering the detailed band structure and k-dependence of the effective-mass.\n\nThe effect of the negative off-diagonal mass was enhanced in the case of linear energy dispersion.\nFurther, the proposed negative TMR mechanism easily explained the negative TMR in p-type Si, which has been a long-standing mystery.\nIn addition, in Si and many other systems, the mysterious negative MR properties were found to be explainable by focusing on the negative off-diagonal mass, which could be easily obtained from the density functional theory.\nFurther research is required to clarify the relationship between effective-mass and MR in many other systems and deepen our understanding of negative MR.\nMoreover, the proposed concept of negative off-diagonal mass is general in nature, and thus, future studies will focus on providing a new route to the negative MR in addition to the chiral anomaly and the Berry curvature.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe would like to thank M. Tokunaga, A. Yamada, K. Behnia, B. Fauqué, and Z. Zhu for the fruitful discussions and helpful comments.\nThis work was supported by JSPS KAKENHI grants 19H01850 and 22K18318.\n\n\n§ REFERENCE\n\niopart-num\n\n\n"}