{"entry_id": "http://arxiv.org/abs/2303.06874v1", "published": "20230313054758", "title": "Stochastic Real-Time Second-Order Green's Function Theory for Neutral Excitations in Molecules and Nanostructures", "authors": ["Leopoldo Mejía", "Jia Yin", "David R. Reichman", "Roi Baer", "Chao Yang", "Eran Rabani"], "primary_category": "physics.chem-ph", "categories": ["physics.chem-ph"], "text": "\n \n\n\nleopoldo.mejia@berkeley.edu\nDepartment of Chemistry, University of California, Berkeley, California 94720, USA\nMaterials Sciences Division, Lawrence Berkeley National Laboratory, Berkeley, California 94720, USA\n\n\njiayin@lbl.gov\nApplied Mathematics and Computational Research Division, Lawrence Berkeley National Laboratory, Berkeley, California 94720, USA\n\n\ndrr2103@columbia.edu\nDepartment of Chemistry, Columbia University, New York, New York 10027, USA\n\n\nroi.baer@huji.ac.il\nFritz Haber Center for Molecular Dynamics, Institute of Chemistry, The Hebrew University of Jerusalem, Jerusalem 91904, Israel\n\n\ncyang@lbl.gov\nApplied Mathematics and Computational Research Division, Lawrence Berkeley National Laboratory, Berkeley, California 94720, USA\n\n\neran.rabani@berkeley.edu\nDepartment of Chemistry, University of California, Berkeley, California 94720, USA\nMaterials Sciences Division, Lawrence Berkeley National Laboratory, Berkeley, California 94720, USA\nThe Raymond and Beverly Sackler Center of Computational Molecular and Materials Science, Tel Aviv University, Tel Aviv 69978, Israel\n\n\nWe present a real-time second-order Green's function (GF) method for computing excited states in molecules and nanostructures, with a computational scaling of O(N_ e^3), where N_ e is the number of electrons.  The cubic scaling is achieved by adopting the stochastic resolution of the identity to decouple the 4-index electron repulsion integrals (ERI). To improve the time-propagation and the spectral resolution, we adopt the dynamic mode decomposition (DMD) technique and assess the accuracy and efficiency of the combined approach for a chain of hydrogen dimer molecules of different lengths. We find that the stochastic implementation accurately reproduces the deterministic results for the electronic dynamics and excitation energies. Furthermore, we provide a detailed analysis of the statistical errors, bias, and long-time extrapolation. Overall, the approach offers an efficient route to investigate excited states in extended systems with open or closed boundary conditions.\n\n\nStochastic Real-Time Second-Order Green's Function Theory for Neutral Excitations in Molecules and Nanostructures\n    Eran Rabani\n    Received: date / Accepted: date\n=================================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nThe computation of excited state properties is a very active field in the molecular and materials sciences.<cit.> The importance of such calculations is accentuated by the wide range of technological applications that are derived from a deeper understanding of excited state properties, as well as the fundamental physics and chemistry that can be learned from the development of methods to compute them. In molecular systems, time-dependent density functional theory <cit.> (TDDFT) or wave function-based methods, such as time-dependent Hartree-Fock <cit.> (TDHF) and coupled cluster within the equation of motion formalism (EOM-CC),<cit.> are commonly used to compute excited state energies. However, it is challenging to find a balance between accuracy and efficiency. While methods such as TDDFT and TDHF can handle the computation of the excited state properties of systems containing hundreds of electrons, their accuracy highly depends on the system or system-functional combination, in the case of TDDFT. By contrast, while wave-function-based methods that include electron correlation beyond the level of Hartree-Fock (e.g. EOM-CC) are usually more accurate, their inherent steep computational cost restricts computations to systems with a few atoms only.<cit.>\n\nAlternative methods traditionally used in condensed matter theory, such as many-body perturbation theory (MBPT) within the Green's function (GF) formalism,<cit.> have also proven to be useful to describe excited states. Two of the most popular approximations are the GW method <cit.>, a first-order approximation to the self-energy in the screened Coulomb interaction (W) and the GF2 method,<cit.> in which the self-energy is approximated to second-order in the bare Coulomb interaction, allowing for the inclusion of dynamical exchange correlations. The GW and the GF2 closures have been successfully used to compute charged excitations (quasiparticle energies) in molecules and bulk systems <cit.> and have been extended to describe neutral excitations using time-dependent approaches.<cit.> \nAttaccalite et al. <cit.> showed that the time-dependent GW approach is equivalent to the well-known Bethe-Salpeter equation (BSE) in the adiabatic, linear response limit.  Similarly, Dou et al.<cit.> derived a Bethe-Salpeter-like equation with a second-order kernel (GF2-BSE) and tested the approach for a set of molecules, with encouraging results for low-lying excited states, particularly for charge transfer excitations.<cit.> However, the O(N_ e^6) scaling with system size (or O(N_ e^5) in real-time), where N is the number of electrons, of both GW and GF2 approaches limit their applications to relatively small systems or basis set sizes.\n\nHere, we develop a stochastic real-time approach to obtain neutral excitations within the second-order Born approximation (GF2), reducing the computational scaling from O_ e^6) to O(N_ e^3). This is achieved using the range-separated <cit.> stochastic resolution of the identity <cit.> to decouple the 4-index electron repulsion integrals appearing in the Kadanoff-Baym (KB) equations.<cit.> Furthermore, we adopt the dynamic mode decomposition (DMD) technique <cit.> to solve the nonlinear Kadanoff-Baym equations within the adiabatic approximation. The DMD method is a data-driven model order reduction procedure used to predict the long-time nonlinear dynamics of high-dimensional systems and has been used previously with the time-dependent GW approach.<cit.> We assess the accuracy of the stochastic, real-time GF2 approach with respect to the number of stochastic orbitals, the propagation time, and the system size for hydrogen dimer chains of varying lengths.\n\nThe manuscript is organized as follows. In Sec. <ref> and Sec. <ref>, we summarize the GF2-BSE method and introduce the stochastic approaches to its real-time implementation, respectively. In Sec. <ref>, we compare the real-time stochastic and deterministic algorithms, analyze the statistical error in the computations, and evaluate the quality of the DMD extrapolation. Finally, in Sec. <ref> we discuss the significance and perspectives of this work.\n\n\n\n\n§ TIME-DEPENDENT GF2\n\n\nIn this section, we provide a summary of the time-dependent GF2 approach for computing neutral excitations.<cit.> We begin by defining the electronic Hamiltonian in second quantization. Next, we summarize the Kadanoff-Baym equations (KBEs) for the two-time GF on the Keldysh contour and introduce the second-order Born approximation. Finally, we describe the adiabatic limit to the KBEs. \n\n\n\n §.§ Hamiltonian\n\nWe consider the electronic Hamiltonian of a finite system interacting with an explicit electric field. In second quantization the Hamiltonian is given by\n\n    Ĥ = ∑_ij h_ijâ^†_i â_j + 1/2∑_ijklv_ijklâ^†_i â^†_k  â_l â_j + ∑_ijΔ_ij(t) â^†_i â_j ,\n\nwhere i, j, k, and l denote indexes of a general basis, â^†_i (â_i) is the creation (annihilation) operator for an electron in orbital χ_i, and h_ij and v_ijkl are the matrix elements of the one-body and two-body interactions, respectively. The two-body terms are given by the 4-index electron repulsion integral (ERI):\n\n    v_ijkl = (i  j | kl ) = ∬χ_i ( r_1)χ_j ( r_1)χ_k ( r_2)χ_l ( r_2)/| r_1- r_2| d r_1 d r_2,\n\nwhere we have assumed that the basis set is real. We use atomic units throughout the manuscript, where the electron charge e=1, the electron mass m_e=1, ħ=1, the Bohr radius a_0=1, and 4πϵ_0=1. \n\nThe last term in Eq. (<ref>) is a time-dependent perturbation. Here, to describe neutral excitation, we couple the system to an external electric field, E(t), within the dipole approximation, where Δ_ij(t)=E(t) ·μ_ij and \n\n    μ_ij=∫χ_i( r)  rχ_j( r) d r.\n\nWe choose to explicitly include this term in the Hamiltonian (rather than introducing a linear-response perturbation in the initial wave function) because we make no assumption that the field is weak.\n\n\n\n §.§ Kadanoff-Baym Equations\n\nFollowing Ref. doutime2022, the equations of motion for the single-particle lesser Green's function, G^<(t_1,t_2), are given by the KB equations:\n\n    i∂_t_1 G^<(t_1,t_2) =  F[ρ(t_1)] G^<(t_1,t_2) +  I^<_α(t_1,t_2)\n\nand\n\n    -i∂_t_2 G^<(t_1,t_2) =  G^<(t_1,t_2) F[ρ(t_2)] +  I^<_β(t_1,t_2) ,\n\nwhere t_1 and t_2 are projections onto the real-time branch, ρ(t)=-i  G^<(t, t) is the time-dependent density matrix, and F[ρ(t)] is the Fock operator, with matrix elements given by\n\n    F_ij[ρ(t)] = h_ij + v^H_ij[ρ(t)] + v_ij^x [ρ(t)] + Δ_ij(t).\n\nIn the above, the Hartree and exchange potentials are given by v^H_ij[ρ]=∑_klv_ijklρ_kl  and v_ij^x [ρ]=∑_klv_ikjlρ_kl, respectively. \n\nThe last terms in Eqs. (<ref>) and (<ref>) are the collision integrals, given by<cit.>\n\n    I^<_α(t_1,t_2) =   ∫_0^t_1Σ^R(t_1,t_3) G^<(t_3,t_1)dt_3\n       + ∫_0^t_2Σ^<(t_1,t_3) G^A(t_3,t_1)dt_3\n\nand\n\n    I^<_β(t_1,t_2) =   ∫_0^t_1 G^R(t_1,t_3)Σ^<(t_3,t_2)dt_3\n       + ∫_0^t_2 G^<(t_1,t_3)Σ^A(t_3,t_2)dt_3 ,\n\nrespectively. In the above equations,  Σ is the self-energy (which encodes all many-body interactions) and the superscript \"R / A\" denotes retarded/advanced components.\n\n\n\n\n §.§ Second-Order Born Approximation to the Self-Energy\n\n\n\nTo obtain an approximate expression for the self-energies, we use the second-order Born approximation, where the self-energy is expanded to second-order in the Coulomb interaction. The resulting retarded component can be written in terms of the retarded and greater screened Coulomb integrals (δ W^R/>)<cit.>\n\n    Σ^R_ij(t_1, t_2 ) =   ∑_mn i G^<_mn(t_1, t_2 ) δ W^R_imjn(t_1, t_2 ) \n       +i G^R_mn(t_1, t_2 )δ W^>_imjn(t_1, t_2 ) ,\n\nwhere\n\n    δ W   ^R_imjn(t_1, t_2 ) = -i  ∑_klqp   ( G^<_kl(t_1, t_2 ) G^A_qp(t_2, t_1 )\n       + G^R_kl(t_1, t_2 ) G^<_qp(t_2, t_1 )  )v_impk (2 v_jnql - v_jlqn )\n\nand\n\n    δ W   ^>_imjn(t_1, t_2 ) =\n       -i  ∑_klqp  G^>_kl(t_1, t_2 ) G^<_qp(t_2, t_1 ) v_impk (2 v_jnql - v_jlqn ).\n\nA particular feature of the self-energy in Eq. (<ref>) is the inclusion of dynamical exchange as diagrammatically illustrated in Fig. <ref>.\n\n\n\n §.§ The Adiabatic Approximation\n\nThe equations of motion (<ref>) and (<ref>) for the GFs together with the expression for the self-energy (Eq. (<ref>)) form a close set of equations, but depend on two times, t_1 and t_2. To further simplify the time evolution of the GF, we assume that the retarded self-energy responds instantaneously to the application of external driving forces (e.g. the adiabatic limit)<cit.>\n\n    Σ^R(t_1,t_2) ≈Σ̃^ ad[(t_1+t_2)/2]δ(t_1-t_2) ,\n\nwhile the lesser self-energy is assumed to be negligible<cit.>\n\n    Σ^<(t_1,t_2) ≈ 0 .\n\nIn the above, Σ̃^ ad[t] is the so-called adiabatic GF2 self-energy with matrix elements<cit.>\n\n    Σ̃^ ad_ij(t) = -∑_mnδW̃^R_imjnρ_mn(t)\n        +1/2∑_mnδW̃^R_imjnδ_mn ,\n\nwhere\n\n\n    δW̃^R_imjn =lim_ω→ 0{-1/2∑_kqf(ε_k)-f(ε_q)/ε_k-ω-ε_q-iη v_imqk(2v_jnqk-v_jkqn)}\n\n\nis the Fourier transform of the screened Coulomb interaction, f(ε) is the Fermi-Dirac distribution, η is a small positive regularization parameter, and ε_k are the quasiparticle energies obtained using a stochastic GF2 for charge excitations (see Ref. dou2019stochastic for more information on how to calculate the quasiparticle energies using GF2). Using Eqs. (<ref>) and (<ref>) for the self-energy, the time evolution of the GFs given by Eqs. (<ref>) and (<ref>) can be reduced to a simpler form for the equal time (t_1 = t_2≡ t) GF (we assume an orthogonal basis from now on)<cit.>\n\n    id/dtρ(t) = [ F[ρ(t)],ρ(t)] + Σ̃^ad(t)ρ(t) - ρ(t)Σ̃^ad†(t),\n\nwhere, as before, ρ(t)=-i G^<(t,t) and [A,B] = AB-BA. Excitation energies obtained using Eq. (<ref>) will be referred to as TD-GF2 (or TD-G0F2 when the quasi-particle energies are corrected using a single-shot, non-self-consistent GF2 <cit.>). \n\nIn TD-GF2, the computational limiting step is the calculation of the self-energy at time t, Σ̃^ad(t). The formal computational cost scales as O(N_e^5) with system size, limiting the application of TD-GF2 to small system sizes.  To reduce the number of self-energy evaluations, we adopt the dynamic mode decomposition (DMD) method to describe the long-time limit of the density matrix, ρ(t), as described in the next subsection. In addition, we develop a stochastic approach that reduces the scaling of computing the self-energy to O(N_e^3) at the account of introducing a controlled statistical error. This is described in the next section.\n\n\n\n §.§ Dynamic Mode Decomposition\n\nThe dynamic mode decomposition method allows the extrapolation of the density matrix dynamics to long times without the need to further solve the equation of motion. As developed in Ref. yin2023analyzing, the DMD method is a data-driven model order reduction procedure used to predict the long-time nonlinear dynamics of high-dimensional systems. The method is based on Koopman's theory <cit.> for reduced order modeling. The general strategy is to find a few (r) modes ϕ_ℓ^ij with associated frequencies ω^ℓ_ij to approximate the density matrix dynamics as\n\n    ρ_ij(t) = ∑_l=1^rλ_ij ^ℓϕ^ℓ_ij e^iω^ℓ_ij t\n\nwith coefficients λ^ℓ_ij. This model is constructed from the short-time nonlinear dynamics of the density matrix and can be seen as a finite-dimensional linear approximation to the dynamics.\n\n\n\n§ STOCHASTIC REAL-TIME GF2 APPROACH\n\n\nIn this section, we adopt the stochastic resolution of the identity <cit.> to calculate the adiabatic self-energy appearing in Eq. (<ref>) and combine it with the equation of motion for the density matrix (cf., Eq. (<ref>)).\n\n\n\n\n §.§ Stochastic Vectors and the Resolution of the Identity\n\nWe define a stochastic orbital θ as a vector in the Hilbert space of the system with random elements ± 1. The average of the outer product of the stochastic vectors\n\n    θ⊗θ^T_N_s→∞ =\n         [ 1 0 ⋯ 0; 0 1 ⋯ 0; ⋮ ⋮ ⋱ ⋮; 0 0 ⋯ 1 ]\n        = I\n\nrepresents the identity matrix, referred to as the stochastic resolution of the identity.<cit.> Here, θ⊗θ^T_N_s≡1/N_s∑_ξ=1^N_sθ_ξ⊗θ_ξ^T is an average over the set {θ_ξ} of uncorrelated stochastic orbitals θ_ξ, with ξ=1,2,…,N_s. \n\nAnalogous to the deterministic resolution of the identity (also known as density fitting), in which 3-index (ij|A) and 2-index V_AB=(A|B) ERIs are used to approximate the 4-index ERI as\n\n    v_ijkl≈∑_AB^N_aux(ij|A)V_AB^-1(B|kl) ,\n\nwhere A(B) is an auxiliary basis of dimension N_aux, the stochastic resolution of the identity can be used as a resolution basis to approximate the 4-index ERIs as <cit.>\n\n    v_ijkl≈R_ijR_kl_N_s ,\n\nwhere R_αβ=∑_A^N_aux(αβ|A)  ∑_B^N_auxV_AB^-1/2θ_B. One advantage of using this approximation is that the indexes ij and kl are decoupled, allowing to perform tensor contractions and reduce the computational scaling.<cit.>\n\nThe use of the stochastic resolution of the identity to approximate the ERIs introduces a controllable statistical error that can be tuned by changing the number of stochastic orbitals, with a convergence rate proportional to 1/√(N_s). An alternative for controlling the error is to use the range-separated stochastic resolution of the identity in which the largest contributions to the ERIs are treated deterministically, while the remaining terms are treated stochastically. Specifically, as proposed in Ref. dou2020range, we first identify large contributions (denoted by the superscript L) to the 3-index ERIs with respect to a preset threshold,\n\n    (ij|A)^L = \n        (ij|A)    if  |(ij|A)|≥ε'/N_ e{ |(ij|A)| }^max_j \n    \n        0    otherwise,\n\nwhere ε' is a parameter in the range [0,N_ e]. The factor ε'/N guarantees that the total non-vanishing elements in (ij|A)^L scales as O_ e^2). Then, we define the large K-tensors\n\n    [K_ij^Q]^L = ∑_A^N_aux(ij|A)^L V_AQ^-1/2\n\nand keep only their larger elements, according to a second threshold\n\n    [K_ij^Q]^L = \n        [K_ij^Q]^L    if  |[K_ij^Q]^L|≥ε{ |[K_ij^Q]^L| }^max\n    \n        0    otherwise,\n\nin which ε is a parameter in the range [0,1]. We then define large and small (denoted by the superscript S) R-tensors as\n\n    R_ij^L = ∑_Q^N_aux[K_ij^Q]^Lθ_Q\n\nand\n\n    R_ij^S = R_ij - R_ij^L ,\n\nwhere R_ij is defined as in Eq. (<ref>). Using these expressions, a range-separated 4-index ERI can be written as\n\n    v_pqrs≈   ∑_Q^N_aux[K_pq^Q]^L [K_rs^Q]^L + R_pq^L R_rs^S_N_s + R_pq^S R_rs^L_N_s\n        + R_pq^S R_rs^S_N_s .\n\n\n\n\n §.§ Stochastic Self-Energy\n\nTo derive a stochastic expression for the self-energy we insert Eq. (<ref>) (or Eq. (<ref>) for range-separated computations) into Eqs. (<ref>) and (<ref>), to yield\n\n\n    Σ^ ad_ij[δρ(t)] ≈ -1/2⟨∑_kqmnf(ε_k)-f(ε_q)/ε_k-ω-ε_q-iη R_imR_qk (2R'_jnR'_qk-R'_jkR'_qn)δρ_mn(t)⟩_N_s,\n\n\nwhere δρ(t)=ρ(t)-ρ(t_0). In the above equation, the \"prime\" superscript denotes that a different set of stochastic orbitals is used to construct the R'-tensors. Next, we rearrange the equation of motion for the density matrix (cf., Eq. (<ref>)) as:\n\n    i d/dtρ(t)\n    =   [ F[ρ(t_0)] + Δ H+ v^H[δρ(t)] +v^x[δρ(t)],ρ(t)]\n       + Σ^ ad[δρ(t)]ρ(t) - ρ(t)Σ^ ad†[δρ(t)] ,\n\nwhere Δ H=Σ(t_0) is the GF2 (or G0F2) quasiparticle energy correction. Excitation energies obtained using Eq. (<ref>) in combination with Eq. (<ref>) will be referred to as sTD-GF2 (or sTD-G0F2).\n\n \n\n\n\n§ RESULTS\n\nTo assess the accuracy of the real-time stochastic TD-GF2 formalism, we restrict the applications below to systems interacting with weak electric fields and compare the stochastic results to the linear-response GF2-BSE frequency-domain approach.<cit.>  In the weak coupling limit, the absorption spectrum (photoabsorption cross-section) is computed by taking the imaginary part of the Fourier transform of the induced time-dependent dipole, averaged over the three spatial directions:\n\n    σ(ω) ∝1/3∑_d=x,y,zω∫ dt e^-iω t(ind. μ_d(t)) ,\n\nwhere the induced dipole is given by:\n\n    ind. μ_d(t) = 1/γTr[(ρ(t)-ρ(t_0))μ_d] ,\n\nwith d=x,y,z for the spatial components of the dipole moment. In the above equations, the matrix elements of the dipole operator are given by Eq. (<ref>), ρ(t) is computed using TD-GF2 or sTD-GF2, and γ≪ 1 is a dimensionless parameter that scales the amplitude of the external electric field.\n\n\n\n §.§ Comparison between Deterministic and Stochastic Dynamics\n\nFig. <ref> shows the stochastic (sTD-G0F2) and deterministic (TD-G0F2) induced dipole dynamics of a hydrogen dimer chain (H_20, containing ten H_2 dimers with bond length of 0.74 Å  and intermolecular distance of 1.26 Å, align along the z-axis). The equations of motion for the density matrix were propagated using Eq. (<ref>) with stochastic (Eq. (<ref>)) and deterministic (Eq. (<ref>)) self energies, respectively. In both cases, a Gaussian-pulse centered at t_0=1 fs, was used to represent the electric field, with an amplitude γ E_0=0.02 V/Å and a variance of 0.005 fs; the regularization parameter appearing in Eq. (<ref>) η=0.01 and the inverse temperature is set to β=50 in all computations. For the stochastic approach, averages were computed using N_s=80 stochastic orbitals. In all cases, the minimal basis set STO-3G was used. \n\nFig. <ref>(a) exemplifies how the stochastic approach reproduces the deterministic dynamics, by comparing the TD-G0F2 and sTD-G0F2 induced dipole dynamics for the H_20 chain. The shaded region in red is the standard deviation (SD) obtained from 6 independent runs. The statistical error can be reduced by increasing the number of stochastic orbitals (with a convergence rate proportional to 1/√(N_s)) or by changing the range separation parameters \nε and ε', as is further discussed in Sec. <ref> below. \n\nWe find that for a fixed number of stochastic orbitals and for fixed values of ε and ε', the statistical error increases with the propagation time, as shown in Fig. <ref>(b). This is consistent with our previous finding for the stochastic time-dependent density functional theory <cit.> and for the stochastic BSE approach.<cit.> Since the induced dipole decays rather rapidly in time, the increase in the statistical error at long times does not affect the absorption spectrum in any significant way. Nonetheless, to mitigate the divergence of the dynamics at long times, we have multiplied the induced dipole by a damping function e^-10t/t_max, where t_max corresponds to the total propagation time and plays a similar role as the regularization parameter, η.\n\nThe long-time dynamics of the density matrix and the resultant time-dependent induced dipole were obtained using the DMD technique outlined above. Fig. <ref>(c) shows a comparison between the extrapolated DMD dynamics and the dynamics obtained by solving Eq. (<ref>) for both the deterministic and stochastic methods. The shaded region (first 6 fs in Fig. <ref>(c)) indicates the portion of the dynamics that was used to train the reduced DMD model (defined as DMD window), while the remaining 34 fs (of which 14 fs are shown in Fig. <ref>(c)) corresponds to the extrapolated dynamics. We find that the DMD technique accurately captures the main dynamical features, even for the noisy stochastic data. Naturally, the time scale of the events that can be captured by the reduced DMD model depends on the DMD window length. Below, we analyze the accuracy of the DMD approach in reproducing the absorption spectra.\n\n\n \n\n\n\n §.§ Comparison between Deterministic and Stochastic Absorption Spectra\n\n\n\nIn Fig. <ref> panels (a) and (b) we compare the absorption spectra obtained from the stochastic and deterministic real-time dynamics and the reference deterministic frequency-domain linear-response approach (G0F2-BSE), for two representative hydrogen dimer chains. The absorption spectra obtained from the three different approaches (vertically shifted for clarity) are numerically identical, demonstrating that the real-time implementations are consistent with the frequency domain reference methods (in the weak coupling-linear response limit) and, in particular, that the stochastic approach can reproduce the benchmark results with only 80 stochastic orbitals.\n\nThe frequency resolution of the absorption spectra can be improved by propagating the density matrix dynamics to longer times using the DMD technique. Fig. <ref> panels (c) and (d) show the corresponding absorption spectra for a 40 fs extrapolated trajectory (sTD-G0F2+DMD) considering three different DMD window lengths. Even a short (2fs) window length provides a reasonable description of the low-excitation features (main absorption peak at ∼15 eV), but the quality of the spectra improves with increasing DMD windows lengths, especially for the higher-excitation peaks. Specifically, for the sTD-G0F2+DMD method, we observed that the average DMD spectral error is proportional to 1/√(t_DMD), with t_DMD being the DMD window length. \n\n\n\n §.§ Error analysis and scaling\n\n\n \n\nThe variation of the range-separated threshold parameters, ε and ε' (see Eqs. (<ref>) and (<ref>)), allows us to control the ratio of deterministic to stochastic Coulomb tensor elements. As ε' → N or ε→ 1 the approach reduces to the fully stochastic limit. By contrast, when ε'→ 0 or ε→ 0 the approach is fully deterministic. Fig. <ref>(a) shows the dependence of the statistical error on ε' and ε for H_20. The average error was estimated using n=6 independent stochastic runs as\n\n    Error = 1/N_ω∑_ω^N_ω1/n√(∑_i^n(σ_i(ω)-σ(ω))^2) ,\n\nwhere N_ω is the number of frequencies used in the range E=10-30 eV. As ε increases the statistical error increases and approaches the fully stochastic limit (dotted line in Fig. <ref>(a)). For the case with the lowest statistical error in Fig. <ref>(a) (ε'=0.002, ε=0.001), the amount of ERI elements computed deterministically corresponds to ≈ 10% for H_20, resulting in an error reduction of almost 2 orders of magnitude compared to the fully stochastic limit.\n\nThe main advantage of using the stochastic formulation of GF2 in the real-time domain is the reduction in the computational complexity and scaling. Formally, GF2 in the frequency-domain scales as O(N_ e^6) with the system size (N) while the real-time deterministic implementation scales as O_ e^5). By contrast, when the stochastic resolution of identity is used in the time-domain, the computational scaling is further reduced to O_ e^3), as long as the number of stochastic orbitals does not increase with system size to achieve a similar statistical error (which is the case for the systems studied here). The computational limiting step in the sTD-GF2 method is the computation of the self-energy (Eq. (<ref>)), with a formal scaling of O(N_s N_ e^3) when appropriate tensor contractions are used. Figure <ref>(b) shows the computational cost associated with the stochastic and deterministic real-time methods and the equivalent frequency-domain linear-response implementation for hydrogen dimer chains with varying lengths. The lowest scaling corresponds to the stochastic real-time implementation, sTD-GF2, which exhibits an O_ e^3) behavior, with a large pre-factor. For the current target statistical error, the stochastic approach is computationally more efficient than the deterministic approach for system sizes that exceed N ≈ 200 basis functions.\n\n\n\n§ CONCLUSIONS\n\nWe presented a stochastic real-time approach to compute excited state energies in extended systems based on the adiabatic approximation to the  Kadanoff-Baym equations using the second-order Born approximation to the self-energy (referred to as sTD-GF2). We showed that the sTD-GF2 approach reproduces the benchmark linear-response results from analogous deterministic methods, namely TD-GF2 and GF2-BSE,<cit.> but at a much milder computational cost that scales as O(N_ e^3) with system size, in contrast to the formal O(N_ e^5) and O(N_ e^6) of TD-GF2 and GF2-BSE, respectively. The reduction in scaling is achieved by introducing a statistical error that can be controlled by varying the number of stochastic orbitals or by tuning the fraction of ERIs that are computed deterministically using the range-separated resolution of the identity.\n\nWithin the adiabatic approximation, the Kadanoff-Baym equations can be reduced to a single-time integro-differential equation, which is efficiently solved using the dynamic mode decomposition method. We assessed the performance of the DMD method for a chain of hydrogen dimers of various lengths and found that it is sufficient to train the systems for times as short as 2 fs (independent of the system size) to greatly improve the resolution of the absorption spectra.\n\nThe method presented in this work offers the possibility to study neutral excitations in systems with hundreds to thousands of electrons at the GF2 closure. This complements the growing manifold of stochastic methods capable of elucidating the electronic structure of the ground and excited states in extended systems with open or closed boundary conditions. Further directions include the development of stochastic techniques that allow the efficient propagation of the two-time Kadanoff-Baym equations (Eq. (<ref>) and <ref>), opening the possibility to describe strongly driven system beyond the adiabatic limit.\n\n\nCY, DRR, and ER are grateful for support from the U.S. Department of Energy, Office of Science, Office of Advanced Scientific Computing Research, Scientific Discovery through Advanced Computing (SciDAC) program, under Award No. DE-SC0022088. Some of the methods used in this work were provided by the Center for Computational Study of Excited State Phenomena in Energy Materials (C2SEPEM), which is funded\nby the U.S. Department of Energy, Office of Science, Basic Energy Sciences, Materials Sciences and Engineering Division, via Contract No. DE-AC02-05CH11231 as part of the Computational Materials Sciences program. Resources of the National Energy Research Scientific Computing Center (NERSC), a U.S. Department of Energy Office of Science User Facility operated under Contract No. DE-AC02-05CH11231 are also acknowledged. RB and ER acknowledge support from the US-Israel Binational Science Foundation BSF-201836.\n\n\n"}