{"entry_id": "http://arxiv.org/abs/2303.07340v1", "published": "20230313175918", "title": "Optimal parallel wire cutting without ancilla qubits", "authors": ["Hiroyuki Harada", "Kaito Wada", "Naoki Yamamoto"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\n\nhiro.041o_i7@keio.jp\nDepartment of Applied Physics and Physico-Informatics, Keio University, Hiyoshi 3-14-1, Kohoku, Yokohama 223-8522, Japan\n\n\n\nDepartment of Applied Physics and Physico-Informatics, Keio University, Hiyoshi 3-14-1, Kohoku, Yokohama 223-8522, Japan\n\n\n\nyamamoto@appi.keio.ac.jp\nDepartment of Applied Physics and Physico-Informatics, Keio University, Hiyoshi 3-14-1, Kohoku, Yokohama 223-8522, Japan\nQuantum Computing Center, Keio University, Hiyoshi 3-14-1, Kohoku, Yokohama 223-8522, Japan\n\n\nThe circuit cutting techniques are widely used to execute quantum algorithms that require \nmore qubits than physically available; the idea is to decompose the original circuit to \nsmaller sub-circuits that are combined to simulate the original one by sampling. \nHowever, they suffer from an inevitable issue that the sampling cost exponentially grows \nwith the number of cuts, and thus it is practically important to develop decomposition \nmethods working with smaller sampling cost. \nThis paper focuses on the parallel wire-cutting problem, meaning that the target to cut is \nthe identity channel acting on multiple qubits in parallel. \nThere are two previous studies. \nThe first one is a teleportation-based method that achieves this task with the use of \nancilla qubits, whose sampling cost was proven to be optimal. \nThe second one uses the technique of classical shadow to solve the problem without \nany ancilla qubits, which however does not achieve the optimal sampling cost. \nThis paper gives a definitive solution to this problem. \nThat is, we develop the optimal parallel wire cutting without ancilla qubits, in the \nsame setup as that taken in the above previous studies. \nMoreover, the developed ancilla-free method can be applied to the non-parallel case, \nwhich also improves the sampling cost obtained in the previous study.\n\n\nOptimal parallel wire cutting without ancilla qubits\n    Naoki Yamamoto\n    March 30, 2023\n====================================================\n\n\n\n\n\n§ INTRODUCTION\n\nQuantum computers are expected to have significant advantage in certain tasks over classical ones <cit.>. In recent years, with the advent of Noisy Intermediate-Scale Quantum (NISQ) devices <cit.>, extensive research have been conducted to explore algorithms that may demonstrate usefulness of those near-term devices, e.g., quantum machine learning <cit.>, quantum simulation <cit.> and quantum chemical computation <cit.>. However, current NISQ devices have fundamental limitations in both quality and quantity of available qubits, which are major obstacles to their practical use. \n\n\nTo mitigate this problem, a wide range of approaches have been proposed, which effectively expand the size of quantum systems with the help of classical post-processing <cit.>. In particular, the methods of partitioning a quantum circuit <cit.> are useful. The idea is to decompose a quantum circuit into several subsystems and recover the original output by appropriately combining the output results from all the subsystems. The circuit partitioning method is categorized into mainly two techniques, depending on the type of target quantum circuits to be decomposed. One is the method to decompose the identity channel (or the wires) into linear combinations of measure-and-prepare channels with measurement followed by preparation of a quantum state, which is called the wire cutting (or circuit cutting or time-like cut) <cit.>.\nThe other one is called the gate cutting (or space-like cut), which decomposes a global channel into linear combinations of tensor products of local channels <cit.>, based on the quasiprobability decomposition methods widely used in error mitigation techniques <cit.>. \nHowever, they have an inevitable problem that the variance of target quantities calculated using the subsystems exponentially increases with respect to the number of cut locations. Clearly, this sampling issue will become serious in practice, and several studies have been conducted to pursue a less-costly decomposition <cit.>. \n\n\n\n\n\n\n\n\nIn this paper, we consider the problem of wire cutting, for which the methods proposed \nin <cit.> realize a smaller sampling cost than the \noriginal scheme <cit.>. \nHere we briefly describe these methods. \nThe idea of decomposing the n parallel identity channel (i.e., Id^⊗ n \nwith the single-qubit identity channel Id) is illustrated in Fig. <ref>. \nThat is, Id^⊗ n depicted with the blue rectangular is replaced by a \nchannel Φ which functions as an identity channel from the top n wires to the \nbottom n wires; \nadditionally, to realize the wire cutting, the top and bottom wires are not connected \nvia any quantum resource, but any local operations and classical communication \n(LOCC) is allowed. \nHence, the problem boils down to how to realize such Φ. \nRef. <cit.> employed the idea of classical shadow <cit.> for this purpose, as illustrated in Fig. <ref>(b1). \nSpecifically, a random unitary V^† followed by the computational basis \nmeasurement on the top wire yields the output y, from which we input the state \nV|y⟩⟨y|V^† (called the classical snapshot in \n<cit.>) to the bottom wire; if V forms a unitary t-design \n(t≥ 2) such as the Clifford random gate, then their ensemble average over V and y together with an additional input y' (which is a uniformly random vector in {0,1}^n) recovers the input state at the bottom wire. \nClearly the top and bottom wires in Φ in this case are separated, and thus the \nentire circuit depicted in Fig. <ref>(a) is decomposed into two smaller \nsub-circuits. \nNote that this scheme does not use any ancilla qubit other than the top and bottom wires. \nThe sampling cost (a formal definition is given later) is reduced from the original \none 16^n to (2^n+1+1)^2, as summarized in Table <ref>. \nHence, we arrive at the first question: can we improve this sampling cost, \nwhile keeping no-ancilla assistance?\n\n\n\nNext, the idea of the method <cit.> is to use the quantum teleportation \nto realize the identity channel from the top to bottom wires, as shown in \nFig. <ref>(b2) in the case of n=1. \nAs is well known, the teleportation needs to introduce ancilla qubits and a pre-shared \nentangled state (Bell pair when n=1) between the ancilla and the bottom wires, followed \nby an LOCC. \nTo realize wire cutting between the top and bottom wires, the authors of \n<cit.> applied the gate cutting technique to the CNOT gate \nused for generating the Bell pair; as a result, the Bell pair becomes virtual \nand thereby the wire cutting is achieved. \nThe sampling cost in this case is (2^n+1-1)^2, as shown in Table <ref>. \nImportantly, it was proven in <cit.> that this is the minimum cost \nin the setup where an arbitrary LOCC is allowed for Φ, regardless of ancilla \nassistance. \nHere we arrive at the second question (this was indeed posed in <cit.>): \ncan we achieve this sampling cost, without using ancilla qubits? \n\n\n\nThe contribution of this paper is to give positive answers to the above two questions. \nThat is, we develop a method for cutting the parallel n wires with sampling cost \n(2^n+1-1)^2, in the setup where we can perform any LOCC between the top and bottom wires but no ancilla qubit is allowed to use. \nAs mentioned above, this sampling cost is the minimum in this setup \n<cit.>. \nThat is, we develop the optimal parallel wire cutting without ancilla qubits. \nThe idea is, roughly speaking, to remove the redundancy appearing in \nthe shadow-based method <cit.>. \n\n\nLastly we add a discussion on the case where the target to be decomposed is a non-parallel identity channel, i.e., the set of single-qubit identity channel Id that however cannot be collected to Id^⊗ n.\nRemarkably, the teleportation-based scheme <cit.> assisted by \nancilla qubits can achieve the minimum sampling cost (2^n+1-1)^2, which is \nthe same cost as the parallel n wires cutting. \nThis is thanks to the ability of collective quasi-probability decomposition \non the entangling gates for the ancilla qubits and bottom wires. \nHowever, in the absence of ancilla, such global operation is not available and \nthere have been no proposal to reach the cost (2^n+1-1)^2. \nA simple strategy is to apply the 1-wire cutting method for all wires independently. \nThen, the sampling cost for the original method <cit.>, the \nshadow-based method <cit.>, and our proposed method are \n16^n, 25^n, and 9^n, respectively. \nHence, though limited to the situation taking such simple strategy, our method surely \nimproves the cost reached by the original one. \n\n\n\n\n§ PRELIMINARIES\n\n\n\n\n\n\n\n\n\n\nWe aim to simulate a large quantum circuit, by classically processing the result produced \nfrom relatively small quantum circuits. \n\nLet y∈{0,1}^N be the result of the computational basis measurement on \na given N-qubit quantum circuit with the input state |0⟩^⊗ N and \nf:{0,1}^N→ [-1,1] be a classical postprocessing function. \n\nHere, the expectation 𝔼_y[f(y)] over the outputs of the N-qubit \ncircuit is the target quantity to be estimated. \nNote that this setting includes the estimation of the expectation of Pauli strings.\n\n\n\nThe wire cutting method <cit.> provides the strategy to calculate 𝔼_y[f(y)] by using smaller sub-circuits derived from the \noriginal circuit; thus, we can simulate large quantum circuits beyond available \nreal quantum devices yet with overhead for classical postprocessing. \nThe method splits a large circuit into smaller ones by decomposing the single-qubit identity channel Id(∙) as follows; \n\n    Id(∙) \n         = ∑_i=1^8 c_i Tr[O_i(∙)] ρ_i,\n\nwhere the observables O_i, quantum states ρ_i, and real coefficients c_i \nare given by \n\n    O_1   =I,      ρ_1   =|0⟩⟨0|,      c_1 = +1/2,\n\n    O_2   =I,     ρ_2   =|1⟩⟨1|,     c_2 = +1/2,\n\n    O_3   =X,     ρ_3   =|+⟩⟨+|,     c_3 = +1/2,\n\n    O_4   =X,     ρ_4   =|-⟩⟨-|,     c_4 = -1/2,\n\n    O_5   =Y,     ρ_5   =|+i⟩⟨+i|,     c_5 = +1/2,\n\n    O_6   =Y,     ρ_6   =|-i⟩⟨-i|,     c_6 = -1/2,\n\n    O_7   =Z,     ρ_7   =|0⟩⟨0|,     c_7 = +1/2,\n\n    O_8   =Z,     ρ_8   =|1⟩⟨1|,     c_8 = -1/2.\nHere, I,X,Y,Z denote the single-qubit identity and Pauli matrices; \n|±⟩, |± i⟩, and {|0⟩,|1⟩} are eigenstates of X, Y, \nand Z, respectively. \nNote that the above set {O_i,ρ_i,c_i} is just one of decompositions \nsatisfying Eq. (<ref>).\nIn this decomposition, Tr[O_i(∙)] ρ_i represents a channel \nthat measures the expectation value of the observable O_i on the quantum state \nentering the identity channel and prepares the new quantum state ρ_i. \n\nThat is, this channel separates the prepared state from the entering state by LO.\n\n\n\n\n\nThe decomposition of Id given by Eq. (<ref>) allows \nus to simulate a large circuit by the weighted summation of smaller circuits.\nTo clarify this procedure, let us consider the decomposition of a 3-qubit quantum circuit shown in Fig. <ref> as an example.\nThis quantum circuit consists of the 3-qubit initial state |0⟩^⊗ 3 and \ntwo unitary operators U_12 and U_23 where U_ab acts on the a-th and b-th qubits, followed by the computational basis measurements. Here, we decompose Id on the 2nd qubit wire between U_12 and U_23, indicated by the red circle in Fig. <ref>(a). \n\nIn this case, for each quantum circuit equipped with the i-th channel in Eq. (<ref>), there are 2 types of measurement results; \nthe computational-basis measurement at the terminal of the circuit, y=(y_1,y_2,y_3), and the eigenbasis measurement on O_i in the middle of the circuit, s∈{-1,1}; see Fig. <ref>(b). \nThese results follow the probability distribution conditioned on the index i as\n\n\n    P[y_1,s|i]   :=    Tr[(|y_1⟩⟨y_1|⊗ E_is)U_12|0⟩⟨0|^⊗ 2 U_12^†],\n    \n        P[y_2,y_3|i]   :=    Tr[|y_2,y_3⟩⟨y_2,y_3|U_23(ρ_i⊗|0⟩⟨0|)U_23^†],\n\n\nwhere E_is denotes the projector on the eigenspace with eigenvalue s of O_i.\nUsing these probabilities, the target expectation value can be written as\n\n\n    𝔼_y[f(y)]\n       =γ_1 ∑_i=1^8∑_y,s sign(c_i) s f(y)  P[y_1,s|i]P[y_2,y_3|i]|c_i|/γ_1,\n\nwhere sign(c_i) returns the sign of c_i. \nHere, we defined \n\nγ_1 to normalize the coefficient c_i as\n\n\n    γ_1 := ∑_i=1^8 |c_i|,\n\n\nwhere the subscript \"1\" means the 1-qubit wire cutting. \nBecause |c_i|/γ_1 represents the probability of the i-th channel, \nEq. (<ref>) enables us to estimate the target quantity using the Monte-Carlo method with samples from the smaller quantum circuits. \n\nMore precisely, for each shot, we first choose the index i with probability |c_i|/γ_1 and then run the small sub-circuits obtained from the quantum circuit equipped with ith channel as in Fig. <ref>(b). Then, using the measurement outcomes y and s, we calculate the value of sign(c_i) s f(y). By repeating the above process and computing their arithmetic mean with multiplication of γ_1, we would finally obtain the desired expectation value. Importantly, (y_1,s) and (y_2,y_3) can be sampled from each small circuit in Fig. <ref>(b) respectively, and as a result we can estimate 𝔼_y[f(y)] over the 3-qubit system with the use of only 2-qubit circuits.\n\n\n\nFinally, in the above example of Id, the total number of measurements required to calculate 𝔼_y[f(y)] within the error ε is \n\n    O(γ_1^2/ε^2).\n\n\n\nFurthermore, if we apply the decomposition with γ_1 at n places in a quantum \ncircuit, the total number of measurements with the error ε results in \nO(γ^2n_1/ε^2). \n\nThis exponential increase of the number of the required measurements, with respect to the number of cuts, is a serious problem for practical use. \nHence, it is important to find a decomposition that achieves the smallest possible \nγ_1.\n\n\n\n\n\n\n\n\n\n\n§ MAIN RESULTS\n\n\n\n\n §.§ Measure-and-prepare channel\n\n\n\n\n\n\n\n\n\n\nOur goal is to provide a new decomposition of the parallel n-qubit identity channel \nvia channels with LOCC. \nSuch component of channel taken in this paper is the measure-and-prepare channel \ndefined as \n\n\n    ℰ(∙):=∑_i a_iTr[E_i(∙)] ρ_i,\n\n\nwhere a_i=± 1. \nThe operator set {E_i} is a positive operator-valued measure (POVM) which satisfies \n∑_i E_i=I^⊗ n and E_i≥ 0 for all i. Also, ρ_i is an \nn-qubit density operator, which are assumed to be efficiently prepared in quantum \ncircuits. \nNote that all measure-and-prepare channels are contained in the class of channels \nsuch that any LOCC between the top and bottom wires is allowed to use. \n\n\nAn example of this channel is depicted in Fig. <ref>, showing \nthe case where the POVM consists of unitary operations followed by the computational \nbasis measurement; in this figure, the bottom wire is lifted to the same line as that \nof the top wire. \n\n\n\nThe measure-and-prepare channel (<ref>) contains several \ntypes of channels analyzed in the previous studies. \nFor instance, we can easily check that each channel of the decomposition in \nEq. (<ref>), i.e., Tr[O_i(∙)]ρ_i, is a special \ncase of the measure-and-prepare channel over 1 qubit, because of the spectral \ndecomposition of the observable O_i whose eigenvalues are ± 1.\n\nAlso, the shadow-based wire cut method with randomized measurements <cit.> \ncan also be captured by this formalism (see Appendix <ref> for \na more detailed explanation.) \n\n\n\n\n\n\n\n\n\n\n §.§ Wire cutting with grouping of commuting observables\n\n\n\n\n\n\n\n\nThe sophisticated decomposition of the single-qubit identity channel Id \n(i.e., 1 wire) with the lowest overhead for classical postprocessing is highly \ndemanded due to its applicability to arbitrary position in a quantum circuit. \nHere, let us consider the decomposition via a linear combination of single-qubit \nmeasure-and-prepare channels: \n\n\n    Id(∙) = ∑_i=1^m c_i ℰ_i(∙),\n\n\nwhere m is the number of principle measure-and-prepare channels in this decomposition, \nand c_i is a real coefficient. \nWe define the sampling cost for the decomposition as (γ^(mp)_1)^2 where γ^(mp)_1 denotes the one-norm of \nthe coefficients {c_i}; that is,\n\n    :=(γ^(mp)_1)^2,   γ^(mp)_1:=∑_i=1^m|c_i|.\n\nThe superscript means that the decomposition is based on measure-and-prepare channels.\nNote that the definition of γ^ (mp)_1 is consistent with Eq. (<ref>), and γ^ (mp)_1 characterizes the total number of required measurements for the estimation of 𝔼_y [f(y)] as in Eq. (<ref>).\n\n\n\n\n\n\nRecall that the decomposition of Id via the original method <cit.> \nrealizes γ_1=4 and thus the sampling cost 16, as shown in the previous section. \nHere we show that the minimum value of γ^( mp)_1 is lower bounded as\n\n    γ^(mp)_1, min≥ 3,\n\nwhere γ^(mp)_1, min is defined as\n\n\n    γ^(mp)_1, min:=min{ ∑_i=1^m|c_i| |  Id = ∑_i=1^m c_iℰ_i, c_i∈ℝ, m∈ℕ, ℰ_i }.\n\n\n\n\n\n\nThe proof is provided in Appendix <ref>. \nHere, recall that brenner2023optimal proved that, when an arbitrary LOCC \n(including the measure-and-prepare channels) is allowed to use, the lower bound of \nγ_n^ (LOCC) is given by\n\n    γ_n^ (LOCC)≥ 2^n+1-1,\n\nwhere the superscript means a decomposition of Id^⊗ n based on LOCC channels.\nIn this sense, Eq. (<ref>) is not new. \nHowever, the achievability of the lower bound was proven only for the teleportation-based \nLOCC channels that use ancilla qubits. \nIn contrast, here we prove that the lower bound of Eq. (<ref>) is \nachievable by explicitly constructing the following ancilla-free measure-and-prepare channel.\n\n\nThe single-qubit identity channel Id(∙) can be decomposed as\n\n    Id(∙)\n           =∑_i=1,2∑_j∈{0,1}Tr[ U_i|j⟩⟨j|U_i^†(∙) ]U_i|j⟩⟨j|U_i^†\n          -∑_j∈{0,1}Tr[ |j⟩⟨j|(∙) ]X |j⟩⟨j|X,\n\n\n\nwhere U_1=H and U_2=SH, with H the Hadamard gate and S the phase gate. \n\n\nThis decomposition achieves the lower bound of Eq. (<ref>) as\n\n    γ^(mp)_1 =3.\n\n\n\n\n\n\nThe proof of Theorem <ref> is given in Appendix <ref>.\nFigure <ref>(a) shows the graphical representation of the decomposition in Eq. (<ref>). \nThe idea of proof is as follows. \nThe original decomposition in Eq. (<ref>) has redundancy in the \nmeasurement and the input state in terms of the basis that simultaneously diagonalize \ncommuting observables.\nThis redundancy can be eliminated by applying the grouping technique for commuting \nobservables such as I and Z via simultaneous diagonalization. \nNoting that the input states and the coefficients c_i in Eq. (<ref>) \ncan be rewritten as observables (See Appendix <ref>), we can apply the \ngrouping technique for both the measurement and the input state; as a result, we arrive at \nthe decomposition Eq. (<ref>). \n\n\n\n\n\n\nBased on the above 1 wire cutting result, we can have a simple discussion on how to \ndecompose a non-parallel n wire, i.e., the set of single-qubit identity channel Id \nthat cannot be collected to the parallel one, Id^⊗ n. \nEven in this case, our decomposition (<ref>) improves the \nbase of the exponential scaling for the non-parallel n-wire cutting from the original \nscaling 16^n by the conventional 1-wire cutting Eq. (<ref>) \nto 9^n, without any ancilla qubits. \nIn other words, the decomposition (<ref>) allows us to cut arbitrary n-wire with the sampling cost 9^n even in the worst case (i.e., a non-parallel n-wire  cutting). \nNote that the multiple applications of the decomposition (<ref>) \nfor each wire cannot achieve the optimal sampling cost \n(γ_n^ (LOCC))^2=(2^n+1-1)^2 <cit.>. \nHowever, for the parallel n-wire cutting, an extension of the optimal 1-wire cutting \nEq. (<ref>) gives the optimal sampling cost in n-wire without \nthe help of ancilla qubits, as shown in the next subsection.\n\n\n\n\nAnother important feature of our decomposition is that it contains only 3 measure-and-prepare channels, while the original decomposition (<ref>) contains 8 \nchannels. \nNote that when we apply a decomposition including m channels in Eq. (<ref>) \nto arbitrary n wires in a quantum circuit, the total number of circuits to be simulated \nis give by O(m^n), which increases exponentially with respect to the number of cuts.\nFor the estimation of 𝔼_y[f(y)] with use of identity channel decompositions, it is practically useful to assign a uniform number of shots to each circuit in advance and run these circuits in parallel.\nTherefore the number of channels m in a decomposition should be small to save the actual execution time.\n\n\nFor instance, when simulating a large circuit by cutting 3 locations with the above mentioned scheme, the total number of circuits to be implemented is 512 (=8^3) in using Eq. (<ref>), but in adopting our decomposition Eq. (<ref>) the quantity is 27 (=3^3).\nAccordingly, this noticeable reduction of the total number of required circuits decreases the overall processing time compared to the conventional method.\n\n\n\n\n    \n    \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\nFinally, to clearly see the existence of classical communication between the top and \nbottom wire, let us reconsider the problem studied in Section <ref>. \nReplacing the identity channel in the red circle in Fig. <ref>(a) with the \nmeasure-and-prepare channel in Eq. (<ref>), there are 2 types \nof measurement results; y=(y_1,y_2,y_3) and j∈{0,1} (instead of s \nappeared in Eq. (<ref>)). \nUnlike the original decomposition in Eq. (<ref>), the measure-and-prepare channel requires us to input the quantum state U_i|j⟩ or X|j⟩ depending on the measurement result j into the following quantum circuit to sample (y_2,y_3), and thus the probability distribution of these measurement results are given by (for simplicity, i=1,2)\n\n\n    P[y_1,j|i]   :=    Tr[(|y_1⟩⟨y_1|⊗ U_i|j⟩⟨j|U_i^†)U_12|0⟩⟨0|^⊗ 2 U_12^†],\n    \n        P[y_2,y_3|i,j]   :=    Tr[|y_2,y_3⟩⟨y_2,y_3|U_23( U_i|j⟩⟨j|U^†_i⊗|0⟩⟨0|)U_23^†],\n\n\nwhere the probability distribution of (y_2,y_3) is conditioned by both the index of channels i and the measurement result j.\nComparing with Eq. (<ref>), it is clear that the our decomposition employs classical communication between split quantum circuits.\n\n\n\n\n\n\n\n\n §.§ Extension to parallel multi-qubit wire\n\n\n\n\n\nIn this subsection, we show an extension of Eq. (<ref>) to the \ndecomposition of the n-qubit parallel identity channel Id^⊗ n, via \nn-qubit measure-and-prepare channels. \nSimilar to Theorem <ref>, we can derive the following decomposition of \nId^⊗ n by applying the grouping technique for mutually commuting \nobservables in n-qubit Pauli strings. \n\n\n\n\n\n\nThe n-qubit parallel identity channel Id^⊗ n(∙) can be decomposed as\n\n    Id^⊗ n(∙)    =∑_i=1^2^n∑_j∈{0,1}^ nTr[ U_i|j⟩⟨j|U_i^†(∙) ]U_i|j⟩⟨j|U_i^†\n         -(2^n-1)∑_j∈{0,1}^ nTr[ |j⟩⟨j|(∙) ] ρ_j,\n\nwhere |j⟩ denotes the n-qubit computational basis, and a new input state ρ_j depending on the measurement result j is defined as:\n\n    ρ_j=∑_k∈{0,1}^n1/2^n-1(1-δ_j,k)|k⟩⟨k|.\n\n\nHere, δ_j,k is the Kronecker delta, and \n{U_i}_i=1^2^n∪{I^⊗ n} denotes a set of unitary operators which \ntransform the computational base into 2^n+1 mutually unbiased bases. \n\n\n\n\nThe proof of Theorem <ref> is shown in Appendix <ref>.\nFigure <ref>(b) shows the graphical representation of the decomposition (<ref>).\nThe sampling cost of the decomposition is characterized by\n\n    γ^(mp)_n =2^n+1-1,\n\nwhere the subscript n means that the decomposition consists of n-qubit \nmeasure-and-prepare channels. \nWhen n=1, this decomposition yields the optimal single-qubit identity channel \ndecomposition (<ref>). \nLet us now recall Eq. (<ref>), meaning that the sampling cost of \nour decomposition (<ref>) achieves the lower bound. \nThat is, our decomposition is one of the the optimal parallel n wires cutting method \namong all the LOCC-based schemes. \nSurely the most notable feature of our wire cutting method is that, unlike the \nteleportation-based method (which also achieves the optimal sampling cost), it does not \nuse any ancilla qubits. \n\n\n\nThe mutually unbiased bases (MUBs) in n-qubit system describe a grouping of the 4^n-1 \nn-qubit Pauli strings {I,X,Y,Z}^⊗ n∖ I^⊗ n into 2^n+1 \ncommuting families each of which has 2^n-1 elements that are commuting with each other \n<cit.>. \nThat is, commuting families of Pauli strings can be diagonalized simultaneously by MUBs.\nThe unitary operators {U_i} transforming the computational base into MUBs can be obtained from the circuit synthesis procedure using the stabilizer matrix for mutually commuting Pauli strings <cit.>.\n\nAlso, the circuits generated by this procedure require only O(n^2) gates in the worst case.\n\n\nThe decomposition (<ref>) contains (2^n+1) n-qubit \nmeasure-and-prepare channels, which can be classified into two types of channels. \nThe first is represented as\n\n    Λ_i^(1)(∙) := ∑_j∈{0,1}^ nTr[ U_i|j⟩⟨j|U_i^†(∙) ]U_i|j⟩⟨j|U_i^†.\n\nIn practice, this channel can be realized by measurement on an entering state with the POVM { U_i|j⟩⟨j|U_i^†} and preparation of a quantum state U_i|j⟩⟨j|U_i^†, which depends on the measurement result j∈{0,1}^n.\nThe second is represented as\n\n    Λ^(2)(∙) := ∑_j∈{0,1}^ nTr[ |j⟩⟨j|(∙) ] ρ_j.\n\n\nThis can be implemented by measuring an entering state with {|b⟩⟨b|} (b∈{0,1}^n) and preparing a random quantum state based on the measurement result j.\nThe new input state is randomly selected from a set {|0⟩⟨0|, |1⟩⟨1|}^⊗ n excluding the quantum state |j⟩⟨j| with equal probability.\n\n\n\n\n\n\n\n§ DISCUSSION AND CONCLUSIONS\n\n\n\n\n\n    \n\n    \n\n    \n\n    \n\n\n\n    \n\n\n\n\n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n\n\n\nWe propose new decompositions of the identity channels for simulating a large quantum circuit with limited quantum resources in quantum circuit cutting framework. Applying the grouping technique for mutually commuting observables into the original decomposition <cit.>, we first construct a decomposition of the single-qubit identity channel with use of local operations and classical communication.\nThe decomposition achieves the lower bound of sampling cost that we have derived within any decomposition whose basis is a measure-and-prepare channel allowed to use classical communication.\nHere, the principle measure-and-prepare channels also contain channels used in the previous works e.g., <cit.>.\nOur decomposition improves the (worst-case) sampling cost for an arbitrary k-wire cutting from 16^k by the existing best decomposition to 9^k at the cost of classical communication but needs no ancilla qubits.\n\n\n\nWe also extend the decomposition of the single-qubit identity channel to that of the n-qubit parallel identity channel relying upon the grouping technique via simultaneous diagonalization in Pauli strings.\nThis decomposition has the sampling cost (2^n+1-1)^2, and thus it achieves the lowest cost proved in the previous paper <cit.> within any decomposition based on LOCC.\nMoreover, unlike the previous method in <cit.>, our method does not use any ancilla qubits.\nThus our method is one of the most efficient decompositions for the n-qubit parallel identity channel in LOCC scheme in terms of both sampling cost and additional quantum resources.\n\n\n\n\n\n\n\n\n\nConsidering cuts for multiple wires including non-parallel ones in a quantum circuit, we first partition the wires into sets comprised of parallel wires and then apply our optimal decomposition for each of the sets.\nHowever, this procedure does not have the optimal sampling cost in sense of global, though each set of parallel wires is decomposed by our decomposition with locally optimal cost.\nSince the optimality of sampling cost (2^n+1-1)^2 derived in <cit.> holds for a non-parallel n-wire cutting, it is an open problem whether the globally optimal cutting can be accomplished without any additional ancilla qubits.\n\n\nOur method would be a promising technique to create a larger quantum system from multiple systems with limited quantum resources using classical communication.\n\n\nAcknowledgements: \nWe thank Dr. Suguru Endo for helpful discussions. \nThis work was supported by MEXT Quantum Leap Flagship Program Grants No. JPMXS0118067285 and No. JPMXS0120319794. \n\n\napsrev4-1\n\n\n\n\n\n\n§ THE DESCRIPTION OF EXISTING QUANTUM CIRCUIT CUTTING BY THE MEASURE-AND-PREPARE CHANNELS.\n\n\n\n\n\n\n\n\n §.§ Quantum circuit cutting introduced in peng2020prl\n\n\nThe decomposition of the single-qubit identity channel Id(∙) given in Eq. (<ref>) can be represented with the use of the 1-qubit measure-and-prepare channels defined in Eq. (<ref>):\n\n    Id(∙) = ∑_k=1^8 c_kℰ_k(∙),   ℰ_k(∙) = ∑_i_k=0,1 a_i_kTr[ E_i_k(∙) ] ρ_i_k,\n\nwhere the set {c_k,(a_i_k, E_i_k, ρ_i_k)_i_k}_k=1^8 follows the Table <ref>.\nFor instance, ℰ_3(∙) in Eq. (<ref>), which corresponds to Tr[X(∙)]|+⟩⟨+|, can be expressed by setting a_0=1, a_1=-1, {E_0,E_1} where E_0=|+⟩⟨+|, E_1=|-⟩⟨-|, and ρ_0=ρ_1=|+⟩⟨+| as in Fig. <ref>(b).\n\n\n\n\n\n\n\n\n\n\n §.§ Quantum circuit cutting with randomized measurements in lowe2023quantum\n\n\nThe decomposition of the n-qubit parallel identity channel Id^⊗ n given in <cit.> can be expressed with the principle n-qubit measure-and-prepare channels as follows:\n\n\n\n\n    Id^⊗ n(∙)    = (2^n+1) 𝔼_V[ ∑_i∈{0,1}^nTr[ V|i⟩⟨i|V^† (∙) ] V|i⟩⟨i|V^†] - 2^n ∑_i∈{0,1}^ nTr[ |i⟩⟨i| (∙) ] I^⊗ n/2^n\n       =𝔼_V∑_i∈{0,1}^ nTr[ V|i⟩⟨i|V^† (∙) ]ρ_ cs,   ρ_ cs:=(2^n+1)V|i⟩⟨i|V^†-I^⊗ n   ,\n\nwhere {|i⟩}_i is the n-qubit computational base, and 𝔼_V[∙] denotes the expectation over a random unitary operator V forming a unitary 2-design.\nHere, the first channel 𝔼_V[ ∑_i∈{0,1}^ nTr[ V|i⟩⟨i|V^† (∙) ] V|i⟩⟨i|V^†] can be considered as a measure-and-prepare channel composed of a random POVM {E_i}={V|i⟩⟨i|V^†}, a coefficient a_i=1, and a new input state ρ_i = V|i⟩⟨i|V^†.\nThe second term is also a measure-and-prepare channel with the computational basis measurement and the maximally-mixed state. These two channels are schematically illustrated in Fig. <ref>(c1)(c2).\n\n\n\n\n§ PROOF OF EQ. (<REF>)\n\n\n\n\n §.§ Pauli Transfer Matrix\n\nIn this subsection, we briefly describe the Pauli Transfer Matrix (PTM) representation of linear operators and channels <cit.> for the proof of the lower bound of γ_1,min^(mp) in Eq. (<ref>).\nFor the PTM representation, we firstly introduce the Pauli basis of the 4-dimensional Hilbert-Schmidt space, whose elements act on a single qubit system, as {|σ_i⟩⟩}_i=0^3 where σ_0=I/√(2), σ_1=X/√(2), σ_2=Y/√(2), and σ_3=Z/√(2).\nSimilarly, we set a basis of the 4^n-dimensional Hilbert-Schmidt space for an n-qubit system as {|σ_i⃗⟩⟩}_i⃗ where σ_i⃗:=σ_i_1⊗ ... ⊗σ_i_n, (i⃗=(i_1,⋯,i_n)) with i_k∈{0,1,2,3} being the index associated with the k-th qubit.\nNote that a basis σ_i⃗=σ_i_1⊗ ... ⊗σ_i_n satisfies the orthonormality under the inner product on the Hilbert-Schmidt space, i.e., ⟨⟨σ_i⃗|σ_j⃗⟩⟩ = Tr[ σ_i⃗^†σ_j⃗]=δ_i⃗,j⃗.\n\nHere, an n-qubit quantum state ρ can be represented as follows:\n\n    |ρ⟩⟩ = ∑_i⃗ρ_σ_i⃗ |σ_i⃗⟩⟩,\n\nwhere ρ_σ_i⃗ = ⟨⟨σ_i⃗|ρ⟩⟩ is a real coefficient.\n|ρ⟩⟩ is a 4^n-dimensional real column vector whose i⃗-th element is ρ_σ_i⃗.\nAlso, an n-qubit Hermitian operator O can be expressed as the same manner.\n\n    ⟨⟨ O| = ∑_i⃗ O_σ_i⃗⟨⟨σ_i⃗|,\n\nwhere O_σ_i⃗ = ⟨⟨ O|σ_i⃗⟩⟩. ⟨⟨ O| is a 4^n-dimensional real row vector whose i⃗-th element is  O_σ_i⃗.\nLastly, a quantum channel Λ(∙) can be written as\n\n    S(Λ) = ∑_k⃗,l⃗ S(Λ)_σ_k⃗,σ_l⃗ |σ_k⃗⟩⟩⟨⟨σ_l⃗|,\n\nwhere S(Λ)_σ_k⃗,σ_l⃗=⟨⟨σ_k⃗ |S(Λ)|σ_l⃗⟩⟩ can be calculated as Tr[σ_k⃗^† Λ(σ_l⃗) ]. \nS(Λ) is a 4^n× 4^n real matrix, generally called superoperator.\nCombining these elements |ρ⟩⟩, ⟨⟨ O|, and S(Λ), we can write the expected value of the observable O for the quantum state Λ(ρ) as \n\n    ⟨O|=⟩Tr[ O Λ(ρ) ]=⟨⟨ O |S(Λ)|ρ⟩⟩.\n\n\n\n\n §.§ Proof of Eq. (<ref>)\n\n\nUsing the PTM representation, a single-qubit measure-and-prepare channel defined in Eq. (<ref>) can be written as:\n\n    S(ℰ) = ∑_i a_i |ρ_i⟩⟩⟨⟨ E_i |,\n\n\nwhere ρ_i is a single-qubit quantum state with the bloch vector r_i:=(r_i^x, r_i^y,r_i^z), and its PTM representation is given by |ρ_i⟩⟩=(1,r_i^x,r_i^y,r_i^z)^T/√(2).\nE_i=e_i^1I+e_i^xX+e_i^yY+e_i^zZ (where each e_i^(·) is a real coefficient) is a POVM element, and the corresponding matrix is ⟨⟨ E_i|=√(2)(e_i^1,e_i^x,e_i^y,e_i^z).\n\nAlso, we can write the superoperator of the single-qubit identity channel S( Id) as \n\n    S( Id) = [ 1 0 0 0; 0 1 0 0; 0 0 1 0; 0 0 0 1 ].\n\n\nThen, using these representations, the single-qubit identity channel can be decomposed by a following set of coefficients and single-qubit measure-and-prepare channels:\n\n    {c_i, S(ℰ_i)=∑_k_i a_k_i|ρ_k_i⟩⟩⟨⟨ E_k_i|}_i,\n\nif and only if the elements of the set satisfy\n\n    [ 1 0 0 0; 0 1 0 0; 0 0 1 0; 0 0 0 1 ]=∑_i c_i∑_k_i a_k_i[        e_k_i^1        e_k_i^x        e_k_i^y        e_k_i^z; r_k_i^xe_k_i^1 r_k_i^xe_k_i^x r_k_i^xe_k_i^y r_k_i^xe_k_i^z; r_k_i^ye_k_i^1 r_k_i^ye_k_i^y r_k_i^ye_k_i^y r_k_i^ye_k_i^z; r_k_i^ze_k_i^1 r_k_i^ze_k_i^x r_k_i^ze_k_i^y r_k_i^ze_k_i^z ].\n\n\nFocusing on the lower right 3× 3 matrix in Eq. (<ref>), we obtain a necessary condition that a set {c_i, ℰ_i} forms a valid decomposition as follows:\n\n    [ 1 0 0; 0 1 0; 0 0 1 ]=∑_i c_i∑_k_i a_k_i[ r_k_i^xe_k_i^x r_k_i^xe_k_i^y r_k_i^xe_k_i^z; r_k_i^ye_k_i^y r_k_i^ye_k_i^y r_k_i^ye_k_i^z; r_k_i^ze_k_i^x r_k_i^ze_k_i^y r_k_i^ze_k_i^z ].\n\nNow, evaluating the trace norm ∙_1 for the both side of Eq. (<ref>), and we get the following relation:\n\n    3 = || ∑_i c_i∑_k_i a_k_i[ r_k_i^xe_k_i^x r_k_i^xe_k_i^y r_k_i^xe_k_i^z; r_k_i^ye_k_i^y r_k_i^ye_k_i^y r_k_i^ye_k_i^z; r_k_i^ze_k_i^x r_k_i^ze_k_i^y r_k_i^ze_k_i^z ]||_1    ≤∑_i |c_i| ∑_k_i |a_k_i| || [ r_k_i^xe_k_i^x r_k_i^xe_k_i^y r_k_i^xe_k_i^z; r_k_i^ye_k_i^y r_k_i^ye_k_i^y r_k_i^ye_k_i^z; r_k_i^ze_k_i^x r_k_i^ze_k_i^y r_k_i^ze_k_i^z ]||_1\n       = ∑_i |c_i| ∑_k_i|| [ r_k_i^xe_k_i^x r_k_i^xe_k_i^y r_k_i^xe_k_i^z; r_k_i^ye_k_i^y r_k_i^ye_k_i^y r_k_i^ye_k_i^z; r_k_i^ze_k_i^x r_k_i^ze_k_i^y r_k_i^ze_k_i^z ]||_1,\n\nwhere the first inequality comes from the triangle inequality and the homogeneity of the trace norm, and the second equality uses |a_k_i|=1.\nFrom the definition of the trace norm, we have\n\n    || [ r_k_i^xe_k_i^x r_k_i^xe_k_i^y r_k_i^xe_k_i^z; r_k_i^ye_k_i^y r_k_i^ye_k_i^y r_k_i^ye_k_i^z; r_k_i^ze_k_i^x r_k_i^ze_k_i^y r_k_i^ze_k_i^z ]||_1 \n           = √((r_k_i^x)^2 + (r_k_i^y)^2 + (r_k_i^z)^2)√((e_k_i^x)^2 + (e_k_i^y)^2 + (e_k_i^z)^2)\n       ≤√((e_k_i^x)^2 + (e_k_i^y)^2 + (e_k_i^z)^2),\n\nwhere the inequality comes from the fact that the magnitude of the bloch vector is less than 1, i.e., (r_k_i^x)^2 + (r_k_i^y)^2 + (r_k_i^z)^2 ≤ 1. \n\n\n    \n\n\n\n    \n\nHere, the eigenvalues μ_k_i,+, μ_k_i,- of a POVM element corresponding to ⟨⟨ E_k_i|=√(2)(e_k_i^1,e_k_i^x,e_k_i^y,e_k_i^z) are calculated as\n\n    μ_k_i,±=e_k_i^1±√((e_k_i^x)^2 + (e_k_i^y)^2 + (e_k_i^z)^2).\n\nSince E_k_i is a positive semi-definite operator, we have\n\n    √((e_k_i^x)^2 + (e_k_i^y)^2 + (e_k_i^z)^2)≤ e_k_i^1.\n\nCombining Eqs. (<ref>)-(<ref>), we obtain\n\n    3 ≤∑_i |c_i| ∑_k_i e_k_i^1.\n\nSince the operator set {E_k_i}_k_i is a POVM, it satisfies ∑_k_i E_k_i = I, and the trace of this equation leads to\n\n    ∑_k_i e_k_i^1 = 1.\n\n\nConsequently, we derive\n\n    γ_1^(mp) = ∑_i |c_i| ≥ 3.\n\nAlso, we can conclude that γ_1,min^(mp)≥ 3.\n\n\n\n\n    \n    \n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \n\n\n\n\n\n§ PROOF OF THEOREM <REF>\n\n\n\n\n\n\nThe single-qubit identity channel Id(∙) can be decomposed as\n\n    Id(∙)=∑_i=1,2∑_j∈{0,1}Tr[ U_i|j⟩⟨j|U_i^†(∙) ]U_i|j⟩⟨j|U_i^† -∑_j∈{0,1}Tr[ |j⟩⟨j|(∙) ]X |j⟩⟨j|X,\n\nwhere U_1=H and U_2=SH diagonalize Pauli X and Y, respectively.\n(Here, H is the Hadamard gate, and S is the phase gate.)\nThis decomposition achieves the lower bound of Eq. (<ref>) as\n\n    γ^(mp)_1 =3.\n\n\n\n\nThe decomposition of a single-qubit identity channel Id(∙) proposed by peng2020prl is expressed as\n\n    Id(∙)=1/2∑_i=0^3Tr[ O_i (∙) ] O_i,\n\nwhere O_0=I, O_1=X, O_2=Y, and O_3=Z.\n\nDistributing the 0th term with the identity I into the other terms, we can transform Eq. (<ref>) into\n\n    Id(∙)=1/2{Tr[ X (∙) ] X + Tr[ I (∙) ] I } + 1/2{Tr[ Y (∙) ] Y + Tr[ I (∙) ] I } - 1/2{Tr[ I (∙) ] I - Tr[ Z (∙) ] Z }.\n\nHere, by a simple calculation, each term in Eq. (<ref>) can be rewritten as follows.\n\n    1/2{Tr[ X (∙) ] X + Tr[ I (∙) ] I }   = ∑_j∈{0,1}Tr[ H |j⟩⟨j| H (∙) ] H |j⟩⟨j| H, \n    1/2{Tr[ Y (∙) ] Y + Tr[ I (∙) ] I }   = ∑_j∈{0,1}Tr[ SH |j⟩⟨j| HS^† (∙) ] SH |j⟩⟨j| HS^†,\n    1/2{Tr[ I (∙) ] I - Tr[ Z (∙) ] Z }   = ∑_j∈{0,1}Tr[ |j⟩⟨j|(∙) ]X |j⟩⟨j|X,\n\nTherefore, we obtain the decomposition of a single-qubit identity channel in Eq. (<ref>).\n\nNote that the proof shown above uses Eq. (<ref>) presented in the previous study <cit.>, but the correctness of Eq. (<ref>) can also be shown by simple direct calculations.\nMore concretely, letting A be any 2×2 complex matrix, we define the channel ℰ(∙) as \n\n    ℰ(∙):= ∑_i=1,2∑_j∈{0,1}Tr[ U_i|j⟩⟨j|U_i^†(∙) ]U_i|j⟩⟨j|U_i^† -∑_j∈{0,1}Tr[ |j⟩⟨j|(∙) ]X |j⟩⟨j|X.\n\n\nThen, it is possible to check that ℰ(A)=A, ∀ A directly, and thus we conclude ℰ(∙)= Id(∙).\n\nNext, we show that γ_1^(mp) of our decomposition in Eq. (<ref>) is 3. Following the definition of the measure-and-prepare channel, the decomposition in Eq. (<ref>) can be represented as\n\n\n\n\n\n\n\n\n    Id(∙) = ∑_k=1^3 c_kℰ_k(∙),   ℰ_k(∙)=∑_i_ka_i_kTr[ E_i_k(∙) ] ρ_i_k,\n\nwhere the set {c_k,(a_i_k,E_i_k,ρ_i_k)_i_k}_k=1,2,3 follows the Table <ref>. By the definition of γ_1^(mp) in Eq. (<ref>) and a simple calculation, γ_1^(mp) of this decomposition is clearly 3.\n\n\n\n\n\n\n\n\n\n\n\n\n§ PROOF OF THEOREM <REF>\n\n\n\nThe n-qubit parallel identity channel Id^⊗ n(∙) can be decomposed as\n\n    Id^⊗ n(∙) =∑_i=1^2^n∑_j∈{0,1}^nTr[ U_i|j⟩⟨j|U_i^†(∙) ]U_i|j⟩⟨j|U_i^†\n       -(2^n-1)∑_j∈{0,1}^ nTr[ |j⟩⟨j|(∙) ] ρ_j,\n\nwhere |j⟩ denotes the n-qubit computational basis, and a new input state ρ_j depending on the measurement result j is defined as:\n\n    ρ_j=∑_k∈{0,1}^n1/2^n-1(1-δ_j,k)|k⟩⟨k|.\n\n\nHere, {U_i}_i=1^2^n∪{I^⊗ n} denotes a set of unitary operators which transform the computational base into 2^n+1 mutually unbiased bases (MUBs).\n\n\n\nThe decomposition of the single-qubit identity channel Id(∙) proposed by peng2020prl can be represented as follows:\n\n    Id(∙)=1/2∑_i=0^3Tr[ O_i (∙) ] O_i,\n\nwhere O_0=I, O_1=X, O_2=Y, and O_3=Z. Using Eq. (<ref>), the n-qubit parallel identity channel Id^⊗ n :=  Id⊗⋯⊗ Id can be written as \n\n    Id^⊗ n(∙)=1/2^n∑_P∈{I,X,Y,Z}^⊗ nTr[ P (∙) ] P.\n\n\nWe first partition the 4^n-1 n-qubit Pauli strings {I,X,Y,Z}^⊗ n∖ I^⊗ n into the 2^n+1 commuting families, each of which has 2^n-1 elements that are commuting each other.\nNote that the commuting families have no overlap each other.\nThen we write the commuting family as G_i = { P_ij}_j=1^2^n-1, (i=1,⋯,2^n+1), and therefore Eq. (<ref>) can be rewritten as\n\n    Id^⊗ n(∙)=1/2^nTr[I^⊗ n (∙)]I^⊗ n+1/2^n∑_i=1^2^n+1∑_P_ij∈ G_iTr[P_ij(∙)]P_ij.\n\n\n\n\nHere, there are unitary operators {U_i}_i=1^2^n+1 creating mutually unbiased bases from the computational base <cit.>, each of which simultaneously diagonalizes all elements of G_i.\n(The construction of U_i is described in Section III.C.)\nThen P_ij∈ G_i is diagonalized as\n\n    P_ij^(z)=c_ij U_i^†  P_ijU_i,\n\nwhere c_ij∈{1,-1}, and P_ij^(z)∈{I,Z}^⊗ n∖ I^⊗ n.\nSince it holds that P_ij≠ P_ij'⇒ P_ij^(z)≠ P_ij'^(z) for any j,j', each set { P_ij^(z)}_j=1^2^n-1 is equivalent to the set {I,Z}^⊗ n∖ I^⊗ n regardless of i.\nCombining Eqs. (<ref>) and Eq. (<ref>), we obtain \n\n    Id^⊗ n(∙)    =1/2^nTr[I^⊗ n (∙)]I^⊗ n+1/2^n∑_i=1^2^n+1∑_P_ij∈ G_iTr[P_ij(∙)]P_ij\n       =1/2^nTr[I^⊗ n (∙)]I^⊗ n+1/2^n∑_i=1^2^n∑_P_ij∈ G_iTr[P_ij(∙)]P_ij\n        +1/2^n∑_P^(z)∈{I,Z}^⊗ n∖ I^⊗ nTr[P^(z)(∙)]P^(z)\n       =1/2^n∑_i=1^2^n{Tr[I^⊗ n(∙)]I^⊗ n +∑_P_ij∈ G_iTr[ P_ij (∙) ] P_ij}-1/2^n{ 2^n Tr[ I^⊗ n (∙) ]I^⊗ n-∑_P^(z)∈{I,Z}^⊗ nTr[ P^(z)(∙) ]P^(z)}\n       =1/2^n∑_i=1^2^n∑_P^(z)∈{I,Z}^⊗ nTr[ U_iP^(z)U^†_i (∙) ]U_iP^(z)U^†_i-1/2^n{ 2^n Tr[ I^⊗ n (∙) ] I^⊗ n -∑_P^(z)∈{I,Z}^⊗ nTr[ P^(z) (∙) ] P^(z)},\n\nwhere we chose a commuting family {I,Z}^⊗ n ∖ I^⊗ n as G_2^n+1 and used c_ij^2=1.\nFor the first term in Eq. (<ref>), we can write it as\n\n    ∑_P^(z)∈{I,Z}^⊗ nTr[ U_iP^(z)U_i^† (∙) ]U_iP^(z)U_i^†\n       =   ∑_P^(z)∈{I,Z}^⊗ nTr[  U_i( ∑_k,k'∈{0,1}^ n⟨k|P^(z)|k'||%s⟩⟩k⟨k'|) U_i^† (∙) ] U_i( ∑_l,l'∈{0,1}^ n⟨l|P^(z)|l'||%s⟩⟩l⟨l'|) U_i^†\n       =   ∑_P^(z)∈{I,Z}^⊗ n∑_k,l∈{0,1}^ n⟨k|P^(z)|k|⟨%s|%s⟩⟩l|P^(z)|lTr[ U_i|k⟩⟨k| U_i^† (∙) ] U_i|l⟩⟨l| U_i^†\n       =   ∑_k,l∈{0,1}^n{∑_P_1^(z)∈{I,Z}∑_P_2^(z)∈{I,Z}⋯∑_P_n^(z)∈{I,Z}∏_m=1^n⟨k_m|P_m^(z)|k_m|⟨%s|%s⟩⟩l_m|P_m^(z)|l_m}Tr[ U_i|k⟩⟨k| U_i^† (∙) ] U_i|l⟩⟨l| U_i^†\n       =   ∑_k,l∈{0,1}^ n{∏_m=1^n(1+(-1)^k_m+l_m) }Tr[ U_i|k⟩⟨k| U_i^† (∙) ]U_i|l⟩⟨l| U_i^†,\n\nwhere |k⟩=|k_1⟩⊗⋯⊗|k_n⟩ denotes the n-qubit computational basis, and P_m^(z) is a Pauli operator acting on the m-th qubit.\n\nSince P^(z) is a diagonal matrix with respect to the computational basis, we can omit the indices k' and l' in the first equality.\n\n\nNoting that\n\n    ∏_m=1^n (1+(-1)^k_m+l_m)    = {[    2^n, (k = l);      0,   (k≠l) ].= 2^nδ_k,l,\n\nwe have the following equation:\n\n    1/2^n∑_i=1^2^n∑_P^(z)∈{I,Z}^⊗ nTr[ U_iP^(z)U_i^† (∙) ]U_iP^(z)U_i^†   = 1/2^n∑_i=1^2^n∑_k,l∈{0,1}^ n\n        2^nδ_k,lTr[ U_i|k⟩⟨k| U_i^† (∙) ]  U_i|l⟩⟨l| U_i^†\n       = ∑_i=1^2^n∑_k∈{0,1}^nTr[ U_i|k⟩⟨k|U^†_i(∙) ]U_i|k⟩⟨k|U_i^†.\n\n\n\n\n\nFor the second term in Eq. (<ref>), we can transform the two components as\n\n    2^n Tr[ I^⊗ n (∙) ] I^⊗ n = 2^n ∑_k,l∈{0,1}^ nTr[ |k⟩⟨k| (∙) ] |l⟩⟨l|,\n\nand\n\n    ∑_P^(z)∈{I,Z}^⊗ nTr[ P^(z)(∙) ] P^(z) = 2^n ∑_k∈{0,1}^nTr[|k⟩⟨k| (∙)] |k⟩⟨k|,\n\nwhere we used a special case of Eq. (<ref>) with U_i=I^⊗ n\n\nHence, we have\n\n    1/2^n{ 2^n Tr[ I^⊗ n (∙) ] I^⊗ n -∑_P^(z)∈{I,Z}^⊗ nTr[ P^(z) (∙) ] P^(z)}   = ∑_k∈{0,1}^nTr[ |k⟩⟨k| (∙) ] (-|k⟩⟨k|+∑_l∈{0,1}^n|l⟩⟨l|)\n       = (2^n-1)∑_k∈{0,1}^nTr[ |k⟩⟨k|(∙) ] ∑_l∈{0,1}^ n1-δ_k,l/2^n-1|l⟩⟨l|.\n\n\nCombining Eqs. (<ref>), (<ref>) and (<ref>), we establish the statement of Theorem <ref>.\n\n\n\n\n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n"}