{"entry_id": "http://arxiv.org/abs/2303.06866v1", "published": "20230313052618", "title": "Using the Star Forming Main Sequence To Explore Quiescent Galaxies Across Cosmic Time", "authors": ["Tyler Houston", "Darren J. Croton", "Manodeep Sinha"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA", "astro-ph.CO"], "text": "\n\nfirstpage–lastpage\nFusionLoc: Camera-2D LiDAR Fusion Using Multi-Head Self-Attention for End-to-End Serving Robot Relocalization\n    Jieun Lee, Hakjun Lee, and Jiyong Oh*\nJ. Lee and J. Oh are with Robot IT Convergence Research Section, Daegu-Gyeongbuk Research Center, Electronics and Telecommunications Research Institute (ETRI), Daegu, Korea (e-mail: {jieun.lee, jiyongoh}@etri.re.kr). H. Lee is with Polaris3D, Pohang, Korea (e-mail: hakjunlee@polaris3d.co). J. Oh is the corresponding author.\n\n\n    Received: date / Accepted: date\n=================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\nIn this letter, we explore the quiescent lives of central galaxies using the SAGE galaxy model and Uchuu dark matter simulation. We ask three questions: (1) How much of a galaxy’s life is spent in quiescence? (2) How often do galaxies transition off the main sequence? (3) What is the typical duration of a quiescent phase? We find low and high-mass galaxies spend the highest fraction of their lives in quiescence: 45±19% for <9.0 (3.68±1.80 Gyr) and 26±25% for >11.5 (3.46±3.30 Gyr), falling to 7±13% for galaxies in-between (0.82±1.57 Gyr). Low mass galaxies move in and out of quiescence frequently, 2.8±1.3 times on average, though only for short periods, 1.49±1.04 Gyr. This can be traced to the influence of supernova feedback on their quite stochastic evolution. Galaxies of higher mass have fewer quiescent periods, ∼0.7±0.9, and their length increases with mass, peaking at 1.97±2.27 Gyr. However, our high-mass population comprises star-forming and quiescent galaxies with diverging evolutionary paths, so the actual time may be even longer. These high-mass trends are driven by radio mode feedback from supermassive black holes, which, once active, tend to remain active for extended periods.\n\n\n\n\n\n\ngalaxies: evolution – galaxies: statistics – galaxies: active – galaxies: star formation\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nThe star forming main sequence relates the stellar mass of a galaxy to its star formation rate and is a relationship that describes the large-scale growth of the galaxy population. Similar correlations are seen in almost all areas of physics – i.e. how a physical property relates to its time (or other) derivative. Analysing the evolution of the star forming main sequence over cosmic time provides a pathway to understanding how galaxy populations are born, evolve, and die.\n\nDetailed measurements of the star forming main sequence only became possible once we entered the era of large-scale galaxy surveys. <cit.> found that at z < 1.1, log_10(M_star) is proportional to log_10(Ṁ_star) with a limited range of star formation rates for a given M_star <cit.>. Their work has since been expanded <cit.>, and the main sequence is now known to be present as early as z ∼ 6 <cit.>. \n\nThe relation clearly encodes many critical physical processes that shape galaxy evolution. The correlation itself appears to be set by the balance of gas supply into the galaxy and the efficiency with which this gas is converted into stars <cit.>. Galaxies above the main sequence are typically known to be undergoing interactions or mergers that perturb the gas and drive up the star formation rate. Galaxies below are usually experiencing short- or long-term episodes of star formation suppression <cit.>. The latter can be caused by the removal of disk gas via feedback from supernova or active galactic nuclei and by limiting outside gas cooling into the galaxy. These processes determine how the main sequence changes with time, both in its normalisation and slope <cit.>. Thus, by measuring the main sequence, we gain insight into the background conditions for star formation across the galaxy population and the physical processes that govern them.\n\nThere is little consensus in the literature on the precise shape of the star forming main sequence. It has been measured to turn over at stellar masses > 10.5 <cit.>. <cit.> show that this high mass turnover may only be present at low redshift (z < 0.45), finding no evidence of a turnover above z = 2.6. They postulate this is expected given that massive galaxies begin quenching more systematically at low redshift <cit.>, which could be due to a growing bulge component that contributes to the stellar mass but not star formation rate. The scatter of the main sequence is of order ∼ 0.2 - 0.35 dex <cit.>. <cit.> describe the small size of this scatter as being the result of every galaxy having star formation governed by similar quasi-static processes <cit.>, with the scatter arising due to fluctuations in the mass flows into and within galaxies <cit.>. The normalisation of the main sequence has been broadly shown to increase with increasing redshift <cit.>. \n\nIndividual galaxies can be used as `test particles' to explore how a galaxy (star forming or quiescent) may evolve relative to the broader sequence. This evolution can tell us about the processes and events important for that galaxy’s history, even if we only have star formation and stellar mass information and nothing else. Unfortunately, this test can't be done observationally (at least not for the complete history of a galaxy), so one must resort to numerical models and simulations of galaxy evolution to map out the possibilities. Such models will be central to the analysis undertaken in this work.\n\nIn this letter, we ask three important questions about galaxy evolution relative to the star forming main sequence: (1) How much of a galaxy’s life is spent in quiescence? – as defined by being found below the main sequence at any point in time. (2) How often do galaxies jump off and back on the main sequence? – highlighting the stochastic nature of their growth. (3) What is the average time a galaxy is quiescent when off the main sequence? – revealing the impact of the key physical processes on galaxy star formation. \n\nThis letter is structured as follows: In Section <ref>, we describe the simulation and galaxy model used to build our data set. In Section <ref>, we outline our method to measure the star forming main sequence at each redshift and how galaxies move relative to it as they evolve across time. Section <ref> presents our results and the answers to the three questions given above, along with a brief discussion. We summarise in Section <ref>. Throughout this work, we assume a Planck 2020 cosmology <cit.> and a Hubble constant where h = 0.73. All stellar masses are given in units of solar mass, M_⊙.\n\n\n\n\n§ THE UCHUU COSMOLOGICAL SIMULATION AND SAGE GALAXY FORMATION MODEL\n\n\n\n\n\nOur work follows the semi-analytic approach to building a galaxy population. This is a hybrid method that evolves galaxies using an analytic model of the baryonic physics, post-processed on the output of a numerical simulation of the large-scale dark matter. \n\nFor this dark matter backbone, we use the Uchuu Main simulation from the Uchuu Simulation Suite <cit.>. This suite comprises a series of Λ-cold dark matter N-body simulations covering various cosmological scales and mass resolutions. Uchuu Main, the flagship of the suite, was run using 12800^3 dark matter particles in a box of side-length 2 h^-1Gpc, and with a softening length of 4.27 h^-1kpc. This resulted in a particle mass resolution of 3.27 × 10^8 h^-1 M_⊙, leading to a minimum 20-particle resolved halo mass of 6.54 × 10^9 h^-1 M_⊙. The simulation particles were evolved from z = 127 to z = 0 and produced 50 complete particle and halo data outputs to capture the evolution of structure at distinct times. These outputs serve as the input into our galaxy model. Uchuu was run using the latest (at the time) cosmological parameters measured by the Planck Satellite <cit.>. For more information on Uchuu we refer the interested reader to <cit.>.\n\nTo populate Uchuu with galaxies we use the SAGE (Semi-Analytical Galaxy Evolution) galaxy formation model <cit.>. SAGE describes the behaviour and evolution of baryonic matter in dark matter halos across cosmic time. This includes the hot, cold, and accreted gas captured by the halo, stars, and black holes that are formed from this gas by various processes, and ejected gas expelled from the halo due to strong feedback mechanisms. How the baryons in their various forms move between these mass reservoirs is governed by analytic prescriptions that model various relevant physical phenomena; these include cooling flows, star formation and metal production, and supernova and active galactic nuclei (AGN) feedback. The efficiency of such processes are governed by various parameters which give the modeller some control over how the galaxies evolve. In this letter, star formation and feedback are particularly important, as they are the prime influencers of the shape of the star forming main sequence. As such, below we provide a summary of their implementation in SAGE. Note that in this letter we use the SAGE 2016 model with default parameters. Full details can be found in <cit.>.\n\nStar formation in SAGE occurs when the mass of cold gas in a galaxy's disk exceeds a critical threshold. This indicates that the local gas density is sufficient for new stars to form, which is modelled using a Kennicutt-Schmidt-type star formation law <cit.>. Star formation continues while the cold gas mass remains above this threshold and uses up the gas, although it can be replenished from gas cooling out of the surrounding halo. The star formation rate of a galaxy in SAGE at any given time is simply the mass of cold gas in the disk above the critical threshold divided by the disk dynamical time, modulated by a conversion efficiency parameter that hides much of the (known and unknown, and unavoidable) smaller-scale temporal and spatial detail.\n\nThe cold disk gas, and hence star formation rate, is further modulated by various feedback mechanisms. SAGE models two kinds of feedback, one from supernova which heats and removes cold gas from the disk via supernova winds, and the other from AGN which heats and suppress the cooling of hot gas into the disk via quasar winds and radio jets. Both feedback mechanisms act to reduce the mass of cold gas available for star formation, and hence can influence a galaxy's place on the star forming main sequence. \n\nFor supernova, the feedback rate is (of course) dependent on the presence of star formation. Thus, supernova winds tend to be most impactful in low-to-intermediate mass systems where star formation is common and the potential well of the parent dark matter halo is not so deep to escape. Collectively, supernova explosions across a galaxy heat and blow cold gas out into the halo surrounding the disk, and can even eject the gas out of the halo itself if the rate is high and halo potential shallow. The affected gas may later cool (for hot gas) or be reincorporated (for ejected gas) to once again form stars at a future time.\n\nFor AGN, SAGE differentiates two modes of feedback: the quasar mode and radio mode. The quasar mode refers to the strong hydrodynamic and radiative winds from optical/UV and X-Ray AGN <cit.>, triggered from galaxy–galaxy mergers and internal disk instabilities in the presence of cold disk gas. The disturbance drives this gas onto the central supermassive black hole, fuelling the wind from the surrounding accretion disk. Such winds act similarly to supernova but with significantly more energy; quasars in SAGE can remove the entire gas disk and hot halo. Hence, quasar winds are `event driven', with conditions that make them most common at high redshift in low-to-intermediate mass systems. \n\nIn contrast, the radio mode of AGN results from the slow accretion of hot gas in the vicinity of the supermassive black hole, producing a low energy and (averaged over cosmological time-scales) continuous heating source into the galaxy and halo. SAGE assumes this heating interacts with the cooling gas from the hot halo, offsetting its energy losses and robbing the disk of fresh star forming material. For this to happen a massive and stable hot gas atmosphere must be present, and the black hole must be large enough to efficiently capture this gas within its gravitational radius. These conditions are typically met at late times in high mass systems when much of structure formation has settled. In this way, the radio mode is quite distinct to the quasar mode in both how it occurs, and its impact on galaxy evolution.\n\n\n\n\n§ MEASURING THE STAR FORMING MAIN SEQUENCE ACROSS COSMIC TIME\n\n\n\n\n\nOnce the galaxy formation model has run on the Uchuu simulation output, we have on-hand a vast data set that we can explore, approximately 4.4 million galaxies. Plotting each galaxy's star formation rate against its stellar mass at a given redshift is straightforward, but defining the star forming main sequence for the population as a whole, in a consistent way across all redshifts that can be fairly compared (out to those where galaxies are first born), is challenging. \n\nIn this letter we adopt the method of <cit.>, whereby at a fixed redshift, the galaxy population is split into stellar mass bins with width 0.1 dex. The median star formation rate for each bin is then calculated iteratively, where for each iteration, galaxies with a star formation rate more than 1 dex below the median are defined as quiescent and removed. This continues until the median star formation rate for the remaining galaxies converges to 1%. From this, galaxies with a star formation rate more than 1 dex below this converged median comprise the quiescent population, with the remainder making up the star forming population. This process is repeated for all 50 outputs of the SAGE+Uchuu data set (i.e. from z=127 to z=0) to find the star forming main sequence and quiescent galaxies in each.\n\nThe z = 0 outcome of this algorithm is presented in Figure <ref>. Here, the star forming main sequence is shown with blue contours, while galaxies defined as quiescent are shown with red contours. Note that because the quiescent population has much lower space density overall, we highlight their distribution by using a different contour normalisation to the star forming main sequence. \n\nThis definition for quiescence also aligns with a common definition used in the observational literature for local data, where galaxies with a log_10 specific star formation rate (sSFR) per year less than -11 are called quiescent <cit.>. This discriminator is shown in Figure <ref> with the solid black line. The advantage of the Donnari et al. method is that it can be applied out to high redshift and self-adjusts for changes in normalisation and slope, necessary for the goals of our work. \n\nOnce done, every central z = 0 galaxy in our catalogue more massive than > 8.5 is traced back in time along its main progenitor line to its snapshot of first identification in the simulation. This minimum value is chosen to stay well above the stellar mass completeness limit of the model, which is 0.5-1.0 dex lower. Our focus on central galaxies is due to their typically less complicated formation histories in comparison to satellite galaxies, and their more direct measurement and interpretation in the simulation. From the identification snapshot we linearly interpolate to find the galaxy's formation time, defined as the time since the Big Bang that this galaxy first reached 20% of its z = 0 mass. This chosen definition is both robust and reproducible (i.e. simulation resolution independent) <cit.>. With this, and the galaxy's position relative to the star forming main sequence at each output, we can calculate the total time and fraction of its life the galaxy is quiescent, how many times it becomes quiescent since `formation', and the average time each quiescent period lasted. Specifically, a quiescent period is defined as a single snapshot or several consecutive snapshots where the galaxy is quiescent, and the quiescent time is simply the sum of those snapshot times. As such, our analysis is limited by the Uchuu snapshot time resolution of 200-400 Myr (depending on redshift), and we are smoothing over quiescent activity that occurs on shorter time-scales. Regardless, the results below give us confidence that this technical limitation is not biasing our conclusions. Finally, the number of quiescent periods a galaxy experiences is simply the number of times it has fallen off the main sequence since its formation time. Exploring the quiescent population statistics as a function of z = 0 stellar mass addresses the three questions we set as our goal at the outset of this letter. These we now discuss.\n\n\n\n\n§ RESULTS: QUANTIFYING QUIESCENCE RELATIVE TO THE MAIN SEQUENCE\n\n\n\n\n\nTable <ref> outlines our key results, which we also plot in Figure <ref> as a function of z = 0 stellar mass. In this figure, the three panels display (top) the number of years galaxies of each mass spend in quiescence across their life; (middle) the number of quiescent periods experienced by these galaxies; and (bottom) the length of these quiescent periods. For each mass bin, the average value is shown with error bars of one standard deviation. Up to 1000 data points were also sampled randomly from each range and are over-plotted to additionally highlight the change in the shape of the distribution with increasing stellar mass.\n\nThe top panel in Figure <ref> reveals that low mass (< 9.5) and high mass (> 10.5) galaxies spend more of their life in quiescence (up to 3.68 Gyr) than galaxies of intermediate mass (∼ 10.0, 0.82 Gyr), on average. The 1σ range of ages increases significantly towards high mass, reflecting the more complicated and varied formation histories massive galaxies tend to experience. \n\nIn the model we find this U-shaped trend with stellar mass reflects the influence of two primary physical processes: supernovae feedback and the radio mode of AGN. Lower mass galaxies have increasingly shallow gravitational potential wells which make their cold gas reservoirs susceptible to emptying via supernovae feedback. More massive galaxies often host AGN undergoing radio mode feedback due to the immense accretion occurring around their supermassive black hole. Both these feedback processes reduce the gas available for star formation and thus promote quiescence. Galaxies of intermediate mass fall between these extremes where such feedback effects are diminished. Hence, they tend to live more of their life happily forming stars on the star formation main sequence.\n\nThe middle and bottom panels of Figure <ref> support this view by showing the average number of quiescent periods and their average length when in quiescence, respectively. We see that low mass galaxies typically undergo more quiescent periods than higher mass galaxies, up to an average of 2.8 times across their life. However these quiescent periods tend to be shorter, lasting on average 1.49 Gyr. Again, this behaviour can be understood by the action of supernovae on the galaxy and its surrounds. Although the potential well of a galaxy can quickly be emptied of its gas from such feedback, it can similarly be refilled once the supernovae has passed, leading the galaxy back to star forming and the main sequence.\n\nAt intermediate-to-high galaxy masses the average number of quiescent periods is lower and levels out at ∼ 0.7 times (noting a small up-tick for the most massive galaxies), and become longer. More massive systems are typically more stable owing to their deeper potential wells, and hence more significant disruptions are required to knock them off the star forming main sequence. The radio mode provides such disruption, suppressing the accretion of fresh gas for star formation. As such AGN typically represent a new phase in a galaxy's evolution and not something transient, radio AGN tend to affect the long-term evolution of a galaxy, unlike supernovae. Thus quiescence is less frequent (middle panel) but more impactful (bottom panel).\n\nIt is worth noting that one might expect the average length of a quiescent period for the most massive galaxies to be even longer than our results suggest, given that massive galaxies are known to be quenched for a significant fraction of their life. But our results measure the average population behaviour, which, in this mass range, includes a mix of large star forming spiral galaxies and massive quenched ellipticals (with an exponentially declining abundance). This mix of populations dilutes the effect somewhat. Here, it may be that the SAGE model is failing to capture the correct abundance massive quiescent galaxies at some level. Further exploration on this is required.\n\nFinally, we can also ask not just about the total time a galaxy spends in quiescence, but the fraction of its life. This is plotted in Figure <ref>, following the same conventions as Figure <ref> (see also Table <ref>). We see that low and high mass galaxies live the largest fraction of their lives under the star forming main sequence, 45% and 26% respectively, but this happens for different reasons. Low mass galaxies at z = 0 are significantly younger on average (Table <ref>) and continually experience supernovae whenever they get the chance to grow via star formation (that then leads to short quiescent periods). High mass galaxies are almost always older and see a change in their population mix, with increasing mass having more radio mode quenched ellipticals, as discussed above. Galaxies in-between are the most efficient star formers in the Universe <cit.>, and not surprisingly spend the lowest fraction of their lives under the main sequence, on average 7%.\n\n\n\n\n\n\n\n§ SUMMARY\n\n\n\nIn this letter we model the star forming main sequence using the Uchuu N-body cosmological dark matter simulation and the SAGE galaxy formation model. Central galaxies are tracked from their formation at high redshift to z = 0 in order to record their position relative to the main sequence throughout their lifetime. From this we quantify the amount of time galaxies spend on the main sequence as well as the number and duration of their quiescent periods, all as a function of final stellar mass. Our results are summarised in Table <ref> and Figure <ref> and <ref>.\n\nOur results show that the low mass galaxy population, those with < 9.5, experience frequent, short-term quiescent periods, indicative supernova feedback and its transient nature and impact. High mass galaxies, those with > 10.5, spend a similar total lifetime in quiescence, although with fewer individual quiescent periods. This reflects the role of radio AGN in shutting down star formation, and highlights the long-term impact AGN have on galaxy evolution. Galaxies of intermediate mass are found to be less susceptible to supernovae and less likely to host radio AGN, and thus spend the least amount of time in quiescence of all the galaxies studied. \n\nAlthough this `story' of galaxy evolution is not new <cit.>, our work provides new utility by quantifying these very basic properties of galaxy quiescence across cosmic time in an established galaxy formation model. Furthermore, these methods can be applied to essentially any galaxy model or simulation for additional predictions and to map out the broader theoretical uncertainties. Regardless, using the star forming main sequence as a reference point to study quiescence with galaxy models offers a very direct way to compare and interpret the observations, which are getting increasingly detailed and sophisticated with time.\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\ntocsectionAcknowledgements\nWe thank the referee, Neven Caplar, for their helpful comments which improved the quality of this letter. The authors acknowledge the support of the Australian Research Council Centre of Excellence for All-Sky Astrophysics in 3 Dimensions (ASTRO 3D), through project number CE170100013. We further thank the Instituto de Astrofisica de Andalucia (IAA-CSIC), Centro de Supercomputacion de Galicia (CESGA), and the Spanish academic and research network (RedIRIS) in Spain for hosting Uchuu DR1 and DR2 in the Skies & Universes site for cosmological simulations. The Uchuu simulations were carried out on Aterui II supercomputer at Center for Computational Astrophysics, CfCA, of National Astronomical Observatory of Japan, and the K computer at the RIKEN Advanced Institute for Computational Science. The Uchuu DR1 and DR2 effort has made use of the skun@IAA_RedIRIS and skun6@IAA computer facilities managed by the IAA-CSIC in Spain (MICINN EU-Feder grant EQC2018-004366-P).\n\n\n\n\n\n§ DATA AVAILABILITY\n\n\nThe data used in this letter are available in the Skies & Universes online repository for cosmological simulations (Uchuu N-body Simulation; http://www.skiesanduniverses.org/Simulations/Uchuuhttp://www.skiesanduniverses.org/Simulations/Uchuu) and the Theoretical Astrophysical Observatory (SAGE galaxy model; https://tao.asvo.org.auhttps://tao.asvo.org.au). SAGE is a publicly available code-base and can be download at https://github.com/darrencroton/sagehttps://github.com/darrencroton/sage. \n\n\n\n\n\nmnras\n\n\n\n\n\n\n\n\n\n"}