{"entry_id": "http://arxiv.org/abs/2303.06861v1", "published": "20230313050932", "title": "On the achievable degree of stability in strictly negative imaginary state feedback control", "authors": ["James Dannatt", "Ian Petersen"], "primary_category": "math.OC", "categories": ["math.OC", "cs.SY", "eess.SY"], "text": "\n\n\nSemantically Secure Private Set Intersection over Outsourced Multi-Owner Secret-Shared Databases\n    Dongfang Zhao\n    Received: date / Accepted: date\n================================================================================================\n\nempty\nempty\n\n\n\n\nIn this paper we study the problem of determining the largest degree of stability that can be achieved for SISO systems using negative imaginary state feedback control. A state feedback result is given for synthesising a controller for a plant such that a given closed-loop transfer function is strictly negative imaginary with a prescribed degree of stability. By varying a parameter, the placement of the closed-loop system poles can be adjusted to give a prescribed degree of stability. We show the achievable degree of stability is related to the zero locations of the transfer function from the control input to the disturbance output of the nominal plant being controlled. Moreover, we offer results that outline the largest degree of stability that can be achieved for systems with distinct eigenvalues.\n\n\n\n\n\n\n§ INTRODUCTION\n\nThe theory of negative imaginary (NI) systems is broadly applicable to problems of robust vibration control for flexible structures; e.g., see <cit.>. In these control systems, unmodelled spillover dynamics can degrade control system performance or lead to instability if the controller is not designed to be robust against this type of uncertainty. NI systems theory provides a way analyzing robustness and designing robust controllers for such flexible structures in the case of collocated force actuators and position sensors; e.g., see <cit.>. Motivated by the robust stability properties of NI systems, research has been made into controller synthesis results with the aim of creating a closed-loop system with the NI or SNI property <cit.>.\n\n\n\n\nIn this paper, we concentrate on the state feedback negative imaginary control problem as illustrated in Figure <ref>. In this control problem, the unmodelled flexible dynamics are represented by the plant uncertainty Δ(s) which are assumed to have the NI or SNI property. This is a natural assumption in the control of flexible structures, since it is known that any flexible structure with collocated force inputs and position outputs will have the NI property; e.g., see <cit.>. The (strictly) NI state feedback control problem is concerned with synthesising a state feedback control law u = Kx, such that the corresponding closed-loop system will be guaranteed to have the (strictly) NI property\n\n\n\nOne method of approaching the SNI state feedback control problem has been to form a controller using the solution to a certain algebraic Riccati equation (ARE) <cit.>. However, it has been shown that the associated ARE used in these results does not have a stabilizing solution <cit.>. To avoid the computation complexity of solving this ARE, <cit.> proposed a controller synthesis approach using the solution to an algebraic Riccati equation (ARE) that could be obtained by solving two Lyapunov equations. The approach was computationally efficient, but yielded a closed-loop pole at the origin, ensuring a marginally stable closed-loop system. This pole at the origin was problematic, as in vibration control problems for flexible structures, pole placement is related to the degree of damping achieved for the nominal resonant modes. \n\n\n\n\nThe papers <cit.> modified the approach of <cit.> using a perturbation applied to the plant matrix of the nominal system in order to ensure asymptotic stability of the closed-loop system. The perturbation achieved closed-loop asymptotic stability. However, it was not proven that the closed-loop system retained the NI property after such a perturbation. The paper <cit.> then showed that under suitable assumptions, the perturbation approach of <cit.> did in fact lead to an SNI closed-loop system and by varying the perturbation parameter, the closed-loop poles of the system could be shifted further into the complex plane, resulting in a prescribed degree of stability. The Lyapunov equations used in forming the controller in this approach also depend on the perturbation parameter. As a consequence, there are choices of this parameter that result in the equations no longer being solvable. This puts a limit on the degree of stability that can be achieved.\n\n\n\n\nIn this paper, we focus on SISO systems and build on the results of <cit.> to study the achievable degree of stability of an SNI closed-loop system formed using the perturbation approach of <cit.>. This issue is important since closed-loop degree of stability is a key performance measure in vibration control problems for flexible structures. Our main results show that the achievable degree of stability for a given system is limited by the eigenvalues of a certain matrix that is related to the zeros of the transfer function from the control input to the disturbance output of the nominal system. Under suitable assumptions, we quantify how the perturbation approach of <cit.> effects this matrix, and the maximum degree of stability that can be achieved before we can no longer guarantee the SNI property of the closed-loop system.\n\n\n\n§ PRELIMINARY DEFINITIONS\n\nIn this section, we briefly present definitions for both negative imaginary and strictly negative imaginary systems.\n\nFirst consider the linear time-invariant (LTI) system,\n\n    ẋ(t)    =    Ax(t) + Bu(t), \n    \n    \ty(t)    =    Cx(t) + Du(t),\n\nwhere A ∈ℝ^n × n, B ∈ℝ^n × m, C ∈ℝ^m × n and D ∈ℝ^m × m.\n\nThe following two definitions relate to the NI and SNI properties of the transfer function matrix G(s) = C(sI - A)^-1B+D corresponding to the system (<ref>). We do not consider a direct feed-through term from disturbance to output in this work.\n\n\n\n\n  A square transfer function matrix G(s) is NI if the following conditions are satisfied <cit.>:\n\t\n\t\t\n  * G(s) has no pole in Re[s]>0.\n\n\t\t\n  * For all ω≥ 0 such that jw is not a pole of G(s), j(G(jω) - G(jω)^*) ≥ 0.\n\n\t\t\n  * If s=jω_0, ω_0 > 0 is a pole of G(s) then it is a simple pole. Furthermore, if s=jω_0, ω_0 > 0 is a pole of G(s), then the residual matrix K = lim_s → jω_0 (s-jω_0)jG(s) is positive semidefinite Hermitian.\n\n\t\t\n  * If s=0 is a pole of G(s), then it is either a simple pole or a double pole. If it is a double pole, then, lim_s → 0 s^2G(s) ≥ 0.\n\t\n\n\n\n\nAlso, an LTI system (<ref>) is said to be NI if the corresponding transfer function matrix G(s) = C(sI-A)^-1B + D is NI.\n\n\n\n \nA square transfer function matrix G(s) is SNI if the following conditions are satisfied <cit.>:\n\t\n\t\t\n  * G(s) has no poles in Re[s] ≥ 0.\n\n\t\t\n  * For all ω > 0 such that jw is not a pole of G(s), j(G(jω) - G(jω)^*) > 0.\n\t\n\n\n\nAlso, an LTI system (<ref>) is said to be SNI if the corresponding transfer function matrix G(s) = C(sI-A)^-1B + D is SNI.\n\n\n(<cit.>)  Suppose the system (<ref>) is a given state space realization with R = CB + B^TC^T > 0 and D=D^T. If there exists a real P=P^T≥0 such that\n\t\n    PA + A^TP + (CA - B^TP)^TR^-1(CA-B^TP) = 0\n\n\twith σ(A-BR^-1(CA-B^TP))⊂ℂ_≤ 0. Then, the state space realization and corresponding transfer function is NI.\n\n\n\n\n§ STRICTLY NEGATIVE IMAGINARY STATE FEEDBACK\n\n\nIn this paper are concerned with the use of state feedback control to achieve a closed-loop system which is SNI and has a prescribed degree of stability. Moreover, we are concerned with how stable can we make the eigenvalues of the closed-loop system while maintaining the SNI property. In this section, we introduce the SNI state feedback control problem along with the state feedback results of the papers <cit.>. In addition to this we  will introduce supporting lemmas that contextualise the perturbation method used in the state feedback theorem of <cit.>.\n\n\n\n §.§ Problem Formulation\n\n\nFor the SNI state feedback method we will consider in this paper, we require the following controlled linear state space system:\n\n    ẋ   = Ax + B_1w + B_2u, \n    \n    \tz          = C_1x,\n\nwhere A ∈ℝ^n × n, B_1 ∈ℝ^n × m, B_2 ∈ℝ^n × m, and C_1 ∈ℝ^m × n. This system corresponds to the nominal plant transfer function matrix G(s) in Figure <ref>.\n\nIf we apply a state feedback control law u=Kx to this system, the corresponding closed-loop system has state space representation\n\n    ẋ   = (A + B_2K)x + B_1w, \n    \n    \tz          = C_1x,\n\nwith corresponding closed-loop transfer function G_cl(s) = C_1(sI - A - B_2K)^-1B_1. \n\n\n\n\nWe assume that the system (<ref>) satisfies the following assumptions.\n\n  \n  The matrix C_1B_2 is non-singular.\n\n\n  \n  The matrix R = C_1B_1 + B_1^TC_1^T > 0.\t\n\nAssumption <ref> is essential for ensuring the existence of the controller in the state feedback theorem that will follow. Assumption <ref> is necessary to ensure the invertability of a certain matrix in several of the proofs that follow.\n\n\n\n §.§ Preliminary Results\n\n\nWe now introduce three results that are needed to understand the SNI state feedback theorem discussed in this paper. Firs,t we will introduce a lemma that details the behavior of NI systems under an ϵI perturbation applied to the plant matrix. Then, we present a Schur decomposition applied to a matrix that is used in controller synthesis to avoid the potential computational difficulties of solving an ARE that does not have a stabilizing solution. In the third result, we remark that the eigenvalues of the matrix used in the Schur decomposition actually corresponds to the zeros of a certain related transfer function. Our main results will show that these eigenvalues dictate the maximum degree of stability that the closed-loop system can achieve under SNI state feedback.\n\n\n\n\n  Suppose the system (<ref>) is a given state space realization with m=1 and an NI transfer function G(s). Then the perturbed state space realization [ A-ϵ I   B\nC   D ] will be SNI for all ϵ > 0.\n\n\n\n\n\nWe now introduce the matrix\n\n    A_r    = Q(A+ϵ I) = A_q + ϵ Q.\n\nwhere \n\n    Q    = I-B_2(C_1B_2)^-1C_1, \n    \n      \tA_q    = QA,\n\nand ϵ > 0 is a parameter which will determine the degree of stability of the closed-loop system in the SNI state feedback theorem of the next subsection. The matrix A_r is fundamental to the state feedback theorem that follows and is discussed further in Remark <ref>.\n\n\n\n\nAfter applying a real Schur decomposition to the matrix A_r as in (<ref>), we may take the orthogonal matrix U and construct the following matrices:\n \n\t\n    Ã   = U^TA_rU =\n    \t\t[ Ã_11   Ã_12\n    \n    \t\t\t\t0    Ã_22 ], \n    B̃   = U^TB_1 =\n    \t\t[ B̃_11\n    B̃_22 ], \n    C̃   = U^T(B_2(C_1B_2)^-1 - B_1R^-1) =\n    \t\t[ C̃_11\n    C̃_22 ], \n    Z̃   = U^TZU = B̃R^-1B̃^T - C̃RC̃^T = [ Z̃_11   Z̃_12\n    Z̃_21   Z̃_22 ],\n\n\nwhere Ã_11 has all of its eigenvalues in the closed left half of the complex plane and Ã_22 is an anti-stable matrix; i.e., σ(Ã_22) ⊂{s:Re[s]>0}. Here, U is an orthogonal matrix dependent on ϵ and is obtained through the real Schur transformation; see Section 5.4 of <cit.>. Also, \n\n    Z    = B_1(B_2^TC_1^T)^-1B_2^T + B_2(C_1B_2)^-1B_1^T \n                    - B_2(C_1B_2)^-1R(B_2^TC_1^T)^-1B_2^T.\n \n\n\n\n\n\n  \nNote that the choice of matrix A_r for the Schur decomposition above is not arbitrary. The eigenvalues of A_q correspond to the zeros of the transfer function from u to z in (<ref>), plus a zero at the origin. To see this, set w≡ 0 and note that (<ref>) implies\n\n    ż = C_1Ax+C_1B_2u.\n\nSince (C_1B_2) is invertible by assumption, we can rearrange (<ref>) to write\n\n    u = (C_1B_2)^-1ż - (C_1B_2)^-1C_1Ax.\n\nNow, we can substitute (<ref>) into (<ref>) to give\n\n    ẋ   = Ax + B_2(C_1B_2)^-1ż- B_2(C_1B_2)^-1C_1Ax \n       = (A- B_2(C_1B_2)^-1C_1A)x + B_2(C_1B_2)^-1ż\n       = A_qx + B_2(C_1B_2)^-1ż.\n\nThese equations define the inverse system which maps from ż to u. Considering the Laplace transform of ż, suppose z(0)=0 and observe that ℒ(ż) = sℒ(z) + z(0). Thus, the eigenvalues of A_q will be the zeros of the transfer function from u to z plus a zero at zero.\n\n\n\n\n §.§ Negative Imaginary State Feedback\n\n\nIn this section we introduce the SNI state feedback theorem that we will be analysing in our main result to determine the degree of stability that can be achieved. This theorem can be found in <cit.>.\n\n\n\n\n Consider the  system (<ref>) with m=1 satisfying Assumptions A1-A2. For a given ϵ > 0, there exists a static state feedback matrix K such that the closed-loop system (<ref>) is SNI with degree of stability ϵ if there exist  T ≥ 0 and S ≥ 0 such that\n\t\n    -Ã_22T - TÃ_22^T + C̃_22RC̃_22^T    = 0, \n    \n    \t\t-Ã_22S - SÃ_22^T + B̃_22R^-1B̃_22^T    = 0, \n    \n    \t\tT-S    > 0,\n\n\twhere Ã_22, B̃_22 and C̃_22 are obtained from the Schur decomposition (<ref>). Moreover, if the conditions (<ref>)-(<ref>) are satisfied, then the required state feedback controller matrix K is given by\n\t\n    K = (C_1B_2)^-1(B_1^TP - C_1A - ϵ C_1 - R(B_2^TC_1^T)^-1B_2^TP),\n where P = UP̃U^T and P̃ = [ 0   0\n0   (T-S)^-1 ]≥ 0. Here, U is the orthogonal matrix obtained through the Schur transformation (<ref>).\n\n\n\n\n\nWhen the A_q matrix from the Schur decomposition (<ref>) has no unstable eigenvalues, the dimension of Ã_22 is equal to zero. Therefore, we cannot form (<ref>)-(<ref>). This situation corresponds to the case in which the transfer function from u to y in (<ref>) is minimum phase. This case is also considered in the paper <cit.> for the special case of B_1= B_2 in (<ref>). The following theorem is a minor result that allows us to use SNI state feedback in the case in which the transfer function from u to y in (<ref>) is minimum phase.\n\n\n\n\n Consider the  system (<ref>) with m=1 that satisfies Assumptions A1-A2. Suppose the matrix A_q, obtained from the Schur decomposition (<ref>) has no unstable eigenvalues. For a given ϵ > 0 such that the corresponding matrix A_r also has no unstable eigenvalues, there exists a static state feedback matrix K such that the closed-loop system (<ref>) is SNI with degree of stability ϵ. The required state feedback controller matrix K is given by\n\t\n    K = -(C_1B_2)^-1(C_1A + ϵ C_1 ).\n \n\n\n\n\n\nProof of Theorem <ref>: \n\tFor design purposes we will begin by replacing the open loop plant matrix A with the perturbed matrix A_ϵ = A + ϵI. Now, using Lemma <ref>, we know that the closed-loop system (<ref>) is NI if there exists a real P=P^T≥0 such that\n\t\n    PÂ + Â^TP + PB_1R^-1B_1^TP + Q = 0\n\n\twhere\n\t\n    Â   = A_cl - B_1R^-1C_1A_cl,    \n    \t\tR     = C_1B_1 + B_1^TC_1^T, \n    \n    \t\tQ    = A_cl^TC_1^TR^-1C_1A_cl,    \n    \t\tA_cl   = A_ϵ + B_2K,\n\n\twith σ(A_cl-B_1R^-1(CA_cl-B^TP)) ⊂ℂ_≤ 0. \n\t\n\tLet P=0. Then, (<ref>) reduces to the condition\n\t\n    A_cl^TC_1^TR^-1C_1A_cl = 0.\n\n\tWe will consider the matrix C_1A_cl. For our choice of K, and noting that for a SISO system, (C_1B_2) is a scalar, C_1A_cl = A+ϵ I + B_2K reduces to\n\t\n    C_1A_cl   = C_1A+ϵ C_1 -C_1B_2(C_1B_2)^-1(C_1A + ϵ C_1) = 0\n\n\tTherefore, P=0 satisfies (<ref>). We will now show that σ(A_cl-B_1R^-1(CA_cl-B^TP)) ⊂ℂ_≤ 0. We begin by considering A_cl-B_1R^-1(CA_cl-B_1^TP). When P=0, and substituting for K = -(C_1B_2)^-1(C_1A + ϵ C_1 ) in this expression, we see that\n\t\n    A_cl-B_1R^-1(CA_cl-B_1^TP) =    A_cl-B_1R^-1CA_cl\n    \n    \t\t\n             \n            \n    \t\t=    A_ϵ - B_2(C_1B_2)^-1C_1A_ϵ\n    \n    \t\t=    A_r,\n\n\twhere A_r is defined in (<ref>).\n\tThus, (<ref>) implies\n\t\n    σ(A_cl-BR^-1(CA_cl-B^TP)) =   σ(A_r).\n\n\tSince σ(A_r)⊂ℂ_≤ 0 follows from our assumption that A_r has no unstable eigenvalues, we have σ(A_cl-BR^-1(CA_cl-B^TP)) ⊂ℂ_≤ 0. Therefore, it follows from Lemma <ref> that the closed-loop system is NI. Further, Lemma <ref> then implies that the actual closed-loop system corresponding to the unperturbed system will have all its poles shifted by an amount ϵ to the left in the complex plane. Moreover, the actual closed-loop system is SNI with degree of stability ϵ.\n▪\n\n\n\n\n\n\n\n§ THE ACHIEVABLE DEGREE OF STABILITY\n\n\nThis section contains the main results of this paper and provides a solution to the maximum degree of stability that can be achieved using Theorem <ref> to design a controller for SNI state feedback. This section is broken into two subsections. The first offers preliminary results needed in the proofs of the main results. In the second subsection, we offer two results that outline the maximum degree of stability that can be achieved using Theorem <ref>. There are two results because depending on the zeros of the transfer function from u to z in (<ref>), the matrix A_r may have no unstable poles. As a consequence, Theorem <ref> cannot be used and Theorem <ref> must be evaluated instead.\n\n\n\n §.§ Preliminary Results\n\n\nIn this section we provide lemmas necessary to the proof of our main results.\n\n \n\tConsider the  system (<ref>) and suppose the dimensions are such that (C_1B_2) ≠ 0 is a scalar. In addition, let\n\t\n    w = (C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2.\n\n\tThe vector C_1 is orthogonal to w.\n\n\n\n\tWe show our result using a simple algebraic manipulation. Observe that\n\t\n    w C_1^T    = (C_1B_1B_2^T-C_1B_2B_1^T/(C_1B_2)^2)C_1^T \n       = C_1B_1B_2^TC_1^T-C_1B_2B_1^TC_1^T/(C_1B_2)^2\n       = 0.\n\n\n\n\n\n\n \n\tThe vector C_1 defined in (<ref>) is in the left-nullspace of the matrices Q, A_q and A_r, where Q, A_q and A_r are defined in (<ref>), (<ref>) and (<ref>).\n\n \n\tWe can show that C_1 is in the left-nullspace of Q, A_q and A_r using the following routine algebra:\n\t\n    C_1Q    = C_1(I-B_2(C_1B_2)^-1C_1) \n       = C_1-C_1B_2(C_1B_2)^-1C_1 = C_1-C_1 = 0, \n    \n    \t\tC_1A_q    = C_1QA = 0, \n    \t\n    \t\tC_1A_r    = C_1(QA + ϵQ) = C_1QA + C_1Qϵ = 0 + 0 = 0.\n \n\n\n\n\n\n  \n\tConsider the  system (<ref>) with m=1 satisfying Assumptions A1-A2. Let Z be defined as in (<ref>). For some non-zero vector y, y^T Z y=0 if and only if\n\t\n    (C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2y   = 0, \n    or        B_2^Ty   = 0.\n\n\n\n\n\tNote that Assumption A1 is required to ensure C_1B_2 ≠ 0 in the manipulation to follow. Now, suppose there exists a non-zero vector y which we use to pre and post multiply Z to form y^TZy. We may expand y^TZy=0 as\n\t\n    0    = y^T[B_2(C_1B_2)^-1R(B_2^TC_1^T)^-1B_2^T - B_1(B_2^TC_1^T)^-1B_2^T \n       - B_2(C_1B_2)^-1B_1^T]y. \n    Using that fact that R = C_1B_1 + B_1^TC_1^T = 2C_1B_1 and C_1B_2 are scalars, we may further manipulate (<ref>) as follows\n    \t\t0    = y^TB_2(2C_1B_1)B_2^Ty/(C_1B_2)^2 - y^TB_1B_2^Ty/C_1B_2 - y^TB_2B_1^Ty/C_1B_2\n       = (2C_1B_1)B_2^TyB_2^Ty/(C_1B_2)^2 - B_1^TyB_2^Ty/C_1B_2 - B_1^TyB_2^Ty/C_1B_2\n       = ((2C_1B_1B_2^T)y/(C_1B_2)^2 - B_1^Ty/C_1B_2 - B_1^Ty/C_1B_2)B_2^Ty\n       = 2(C_1B_1B_2^T/(C_1B_2)^2 - B_1^T/(C_1B_2))yB_2^Ty\n       = 2(C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2yB_2^Ty.\n\n\tNow, there are only two cases where (<ref>) is equal to zero, either:\n\t\n    (C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2y   = 0, \n    or         B_2^Ty   = 0,\n\n\tas required.\n\n\n\n\n\n  \n\tConsider the  system (<ref>) with m=1 satisfying Assumptions A1-A2. Let ϵ > 0 be given and A_r defined as in (<ref>) and suppose there exist matrices T, S ≥ 0 satisfying:\n\t\n    -Ã_22T - TÃ_22^T + C̃_22RC̃_22^T    = 0, \n    \n    \t\t-Ã_22S - SÃ_22^T + B̃_22R^-1B̃_22^T    = 0,\n\n\twhere Ã_22, B̃_22 and C̃_22 are obtained from the Schur decomposition (<ref>). Let Z be defined as in (<ref>) and let X = T-S. Suppose, λ≠ 0 is an eigenvalue of Ã_22 with corresponding eigenvector v_2^T ∈ ker(Ã_22^T - λI) and let y=U[ 0   v_2^T]^T ∈ ker(A_r^T - λI), where U is obtained from the Schur decomposition (<ref>). Then y^TZy < 0 if and only if v_2^T X v_2>0.\n\n\n\tSuppose all assumptions are satisfied and (<ref>)-(<ref>) hold. Subtracting (<ref>) from (<ref>) gives the Lyapunov equation,\n\t\n    0    = -Ã_22S - SÃ_22^T + B̃_22R^-1B̃_22^T \n         - (-Ã_22T - TÃ_22^T + C̃_22RC̃_22^T ) \n    \n    \t\n    \t\n    \t\n    \t\n    \t\n    \t\t   = Ã_22X + XÃ_22^T + Z̃_22.\n\n\tNote that the matrix Ã_22 is the 22 block of the matrix Ã obtained from the Schur decomposition (<ref>). By assumption, we know there exists a vector v_2 that satisfies\n\t\n    v_2^TÃ_22 = λv_2^T, \n    Ã_22^T v_2 = λ̅v_2.\n\n\tNow, pre-multiply (<ref>) by v_2^T and post-multiply by v_2 to form\n\t\n    v_2^T Ã_22X v_2 + v_2^T XÃ_22^T v_2 + v_2^TZ̃_22v_2 = 0.\n\n\tWe may proceed with the following manipulation:\n\t\n    0    = v_2^T Ã_22X v_2 + v_2^T XÃ_22^T v_2 + v_2^TZ̃_22v_2\n    \n    \t\t   = λv_2^TX v_2 + v_2^T Xλ̅v_2 + v_2^TZ̃_22v_2\n    \n    \t\t   = (λ + λ̅)v_2^T X v_2 + v_2^TZ̃_22v_2.\n\t\n\tWe now rearrange (<ref>) to form\n\t\n    v_2^T X v_2   = - v_2^TZ̃_22v_2/(λ + λ̅),\n\n\twhere, (λ + λ̅) > 0. \n\tIn order to see the relationship between v_2^T X v_2 and y^TZy, observe that\n\t\n    v^TZ̃v   =[     0 v_2^T ][ Z̃_11 Z̃_12; Z̃_21 Z̃_22 ][   0; v_2 ] = v_2^TZ̃_22v_2.\n\n\tUsing (<ref>), we can rewrite (<ref>) as\n\t\n    v_2^T X v_2 = - v^TZ̃v/(λ + λ̅).\n\n\tWe know that y^T = v^TU^T by assumption. Thus we can substitute back into (<ref>) to see that\n\t\n    v_2^T X v_2   = - v^TZ̃v/(λ + λ̅) = - y^TZy/(λ + λ̅).\n\n\tSince (λ + λ̅) > 0 and (<ref>) was arrived at using only algebraic manipulation, we can infer that y^TZy < 0 if and only if v_2^T X v_2>0.\n\n\n\n\n\n  \n\tConsider a SISO  system (<ref>) satisfying Assumptions A1-A2. Let Z,A_r and X=T-S be defined as in (<ref>), (<ref>) and (<ref>). Suppose there exists a vector y such that y=U[ 0   v_2]^T ∈ ker(A_r^T - λI), where λ > 0 and U is obtained from the Schur decomposition (<ref>). Under these assumptions, v_2^TXv_2=0 if and only if either of the following conditions holds\n\t\n    (C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2y   = 0, \n    or        B_2^Ty   = 0.\n \n\n\n\n\tSuppose either (<ref>) or (<ref>) hold. We know from Lemma <ref> that this immediately implies y^T Z y=0. Also, we know from Equation (<ref>) in Lemma <ref> that for a vector y such that y=U[ 0   v_2]^T ∈ ker(A_r^T - λI), then\n\t\n    v_2^T X v_2   = - v^T(Z̃)v/(λ + λ̅) = - y^TZy/(λ + λ̅),\n\n\twhere, (λ + λ̅) > 0. Since (λ + λ̅) > 0, it follows from (<ref>) that y^T Z y=0 implies v_2^T X v_2=0.\n\t\n\tConversely, suppose v_2^T X v_2=0. We can use the relationship (<ref>) and after substituting in v_2^T X v_2=0 we see that\n\t\n    - y^TZy/(λ + λ̅) = 0.\n\n\tSince, (λ + λ̅) > 0 by assumption, this implies\n\t\n    y^TZy = 0.\n\n\tNow, Lemma <ref> states that y^T Z y=0 if and only if (<ref>)-(<ref>) hold.\n\n\n\n\n\n \n\tConsider the  system (<ref>) satisfying Assumptions A1-A2. Let Z,A_r and X=T-S be defined as in (<ref>), (<ref>) and (<ref>). Suppose the Schur decomposition (<ref>) is such that dim(Ã_22)=1, and let y=U[ 0     1]^T ∈ ker(A_r^T - λI), where λ = Ã_22 > 0 and U is obtained from the Schur decomposition (<ref>).\n\tThen X=0, if and only if either of the following conditions holds\n\t\n    (C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2y   = 0, \n    or        B_2^Ty   = 0.\n \n\n\n\n\tThis is a special case of Lemma <ref> and the proof is the same noting that v_2 in that proof is equal to 1 in this case.\n\tWe know from Lemma <ref> that for a vector y such that y=U[ 0   v_2]^T ∈ ker(A_r^T - λI), X is related to Z by\n\t\n    v_2^T X v_2   =  - y^TZy/(λ + λ̅).\n\n\tWhen dim(Ã_22)=1, v_2 = 1 and we can substitute y into (<ref>) to obtain\n\t\n    X     = - [ 0 1 ]^TZ̃[ 0 1 ]/(λ + λ̅) = - y^TZy/(λ + λ̅),\n\n\twhere, (λ + λ̅) > 0. We know from Lemma <ref> that y^T Z y=0 if and only if (<ref>)-(<ref>) hold. Since (λ + λ̅) > 0, it follows from (<ref>) that y^T Z y=0 if and only if X=0.\n\n\n\n\n\n\n <cit.> \n\tLet matrix A, scalars λ and μ, and non zero vectors x, y be given. Suppose that Ax=λx and y^TA=μy^T.  If λ≠μ, then y^Tx = 0.\n\n\n\n\n\n <cit.> \n\tLet matrix A, eigenvalue λ and non zero vectors x and y be given. Suppose that λ is an eigenvalue of A such that Ax=λx and y^TAx=λy^T. \n\tIf λ has algebraic multiplicity 1, then y^Tx≠ 0.\n\tAlso, if λ has geometric multiplicity 1, then it has algebraic multiplicity 1 if and only if y^Tx≠ 0.\n\n\n\n\n\nThe following lemma is important as it tells us how the eigenvalues of the matrix A_q behave under the perturbation A_r = A_q + ϵQ. Remember the eigenvalues of A_q correspond to the zeros of the transfer function from u to z in (<ref>), plus a zero at the origin. Also, the solvability of the Lyapunov equations in Theorem <ref> is also depend on the eigenvalues of A_r.\n\n\n\n\n \n\tConsider the uncertain system (<ref>) with m=1 satisfying Assumptions A1-A2. Consider the n × n matrix A_q = QA defined in (<ref>). Suppose A_q is not a defective matrix and has the distinct eigenvalues\n\t\n    0   ,  λ_1   ,  λ_2   ,   ...   ,  λ_k,\n\n\tsuch that\n\t\n    dim (   ker( A_q)  )    = j , \n    \n    \t\tdim (   ker( A_q - λ_i I )  )    = n_i, i = 1,2,...,k,\n\n\twhere 1 ≤ j ≤ n. Let a value of ϵ > 0 be given such that λ_i ≠ - ϵ  ∀  i where i = 1,2,...,k and the matrix A_r = QA + ϵQ is not defective. Then A_r = QA+ϵQ has the distinct possible eigenvalues\n\t\n    0   ,  ϵ  ,  λ_1 + ϵ  ,   ...   ,  λ_k + ϵ,\n\n\tsuch that\n\t\n    dim (   ker( A_r - ϵI)  )    = j - 1  \n    \n    \t\tdim (   ker( A_r - (λ_i + ϵ)I)  )    = n_i, i = 1,2,...,k \n    \n    \t\tdim (   ker( A_r )  )    = 1 .\n\n\n The proof will be published elsewhere. \n\n\n\n\n\n\n\n §.§ Main results\n\n\nIn this section we address the problem of determining the maximum degree of stability that can be achieved using the SNI state feedback control laws presented in Theorem <ref> and Theorem <ref>. These results are given under a number of assumptions on the eigenvalues of the matrix A_q. Future research will be directed towards more generalized results. Our results are offered as two separate cases that consider when the system has different zeros of the transfer function from u to z in (<ref>).\n\n\n\n\nFor the results that follow, we assume the following assumption is satisfied:\n\n\n\n\n\nA_q has distinct eigenvalues λ_1, ⋯ , λ_n. \n\nThis assumption is made so that we can leverage Lemma <ref>, which does not use generalized eigenvector. This assumption will be relaxed in future work.\n\n\n\n\nCase 1: \n\nThe following case considers when the matrix A_q has a single unstable eigenvalue, a single eigenvalue at the origin, and n-2 stable eigenvalues. We only consider a single unstable eigenvalue here in order to simply the proof and conserve space.\n\n\n\n\nThe eigenvalues of A_q are ordered such that\n\n    Re[λ_1] ≤⋯≤ Re[λ_n-2] ≤ 0 ≤λ_n\n\nand  we will assume that the following conditions hold:\n\n\t\n  * For all i ∈{1,⋯,n-2}, Re[λ_i] < 0;\n\t\n  * For i = n-1, λ_i= 0;\n\t\n  * For i = n, λ_i> 0.\n\nLet γ be defined as γ = -Re[λ_n-2]. In other words, γ is the real part of the maximum eigenvalue of A_q less than zero.\n\n\n\n\nIn the following theorem we will show that a system with an A_q matrix as above may be perturbed for all ϵ within the range 0 < ϵ < γ and still satisfy the conditions of Theorem <ref>.\n\n\n\n\n \n\tConsider the system (<ref>) that satisfies the conditions of Theorem <ref>. Suppose, the pair {A,B_2} is controllable,  the matrix A_q, (<ref>), has  distinct eigenvalues and the matrix A_q, has only one unstable eigenvalue;\n\tThe closed-loop system formed using Theorem <ref> will be SNI with degree of stability ϵ, for any ϵ within the range 0 < ϵ < γ, where γ = -Re[λ_n-2].\n\n\n\n\n\nCase 2: \n\nThe following case considers when the matrix A_q has no unstable eigenvalues, a single eigenvalue at the origin, and n-1 stable eigenvalues.\n\n\n\n\nNow, consider a matrix A_q ∈ℝ^n × n with distinct eigenvalues λ_1, ⋯ , λ_n. Suppose the eigenvalues of A_q are ordered such that\n\n    Re[λ_1] ≤⋯≤ Re[λ_n-1] < 0.\n\nAlso, assume that the following conditions hold:\n\n\t\n  * For all i ∈{1,⋯,n-1}, Re[λ_i] < 0;\n\t\n  * For i = n, λ_i= 0.\n\n Let γ be defined as γ = -Re[λ_n-1]. In other words, γ is the real part of the maximum eigenvalue of A_q less than zero.\n\n\n\n\nIn the following theorem we show that the system with an A_q matrix as above may be perturbed for all ϵ within the range 0 < ϵ < γ and still satisfy the conditions of Theorem <ref>; that is, the system will be SNI for all ϵ within the range 0 < ϵ < γ. Moreover, for ϵ > γ, the system may still be SNI if it satisfies Theorem <ref>.\n\n\n\n\n  \n\tConsider the system (<ref>) with dimension n, that satisfies the conditions of Theorem <ref> when unperturbed. Suppose, \n\t the pair {A,B_2} is controllable;\n\t the matrix A_q defined in  (<ref>) has distinct eigenvalues, and \n\tthe matrix A_q, has no unstable eigenvalues.\nThen, the closed-loop system formed using Theorem <ref> will be SNI with degree of stability ϵ, for any ϵ within the range 0 < ϵ < γ, where γ = -Re[λ_n-1] is defined as in (<ref>). In addition,  for ϵ in the range -Re[λ_n-1] < ϵ < -Re[λ_n-2], if the open-loop system satisfies the conditions of Theorem <ref> at ϵ, then the system will remain SNI for all ϵ within the range -Re[λ_n-2] < ϵ < -Re[λ_n-2].\n  \n\n\n\n\nProof of Theorem <ref>:\n\tIf a system satisfies the conditions of Theorem <ref>, there exists an X>0 such that\n\t\n    Ã_22X + XÃ_22^T + B̃_22R^-1B̃_22^T - C̃_22RC̃_22^T = 0 \n    Ã_22X + XÃ_22^T + Z̃_22 = 0,\n\n\twhere Ã_22, B̃_22 and C̃_22 are obtained from the Schur decomposition (<ref>). Suppose the conditions of Theorem <ref> are satisfied when ϵ=0 and X_0>0 is a solution to (<ref>). The dimension of X_0 is related to Ã_22 by dim(X_0) = dim(Ã_22)=1, so in this case X_0 is scalar. Our proof methodology will show that for any ϵ within the range 0 < ϵ < -Re[λ_n-2], if there exists a left eigenvector of A_r such that X_ϵ=0, then X_0=0 must also be true, which contradicts our initial assumption. To that end, let γ = -Re[λ_n-2] and suppose there exists an ϵ within the range 0 < ϵ < γ such that X=0. Also, let y_1 be a left eigenvector of A_r such that \n\t\n    y_1^TA_r = (μ + ϵ) y_1^T,\n\n\twhere A_r is defined in (<ref>) and μ=λ_n is the anti-stable eigenvalue of A_q.\n\t\n\tAccording to Lemma <ref>, if X=0, then either\n\t\n    (C_1B_1B_2^T-C_1B_2B_1^T)/(C_1B_2)^2y_1   = 0, \n    or        B_2^Ty_1   = 0.\n\n\t\n\tWe now consider each of these conditions separately:\n\t\n\tCase 1, (<ref>) is satisfied: \n\t\n\n\n\tIn this case,\n\t\n    (C_1B_1B_2^T-C_1B_2B_1^T/(C_1B_2)^2)y_1 = w^Ty_1   = 0.\n\n\tSince we can easily check that the vector w is orthogonal to C_1, it follows that\n\t\n    C_1^T ∈ ker(A_r^T).\n\t\n\tMoreover, we have distinct eigenvalues, therefore C_1 is also a basis for ker(A_r^T). Since w is orthogonal to the basis of ker(A_r^T), this must mean w∈ range(A_r). Thus, we can describe w using a linear combination of basis vectors for range(A_r), to give\n\t\n    w = β_1 x_1 + β_2 x_2 + ⋯ + β_n-1x_n-1,\n\n\twhere β_1,⋯,β_n-1∈ℝ and x_1,⋯,x_n-1 are eigenvectors of A_r corresponding to the n-1 non-zero eigenvalues.\n\t\n\tUsing this form of w, we can restate (<ref>) as\n\t\n    w^Ty_1   = 0 \n    y_1^Tw   = 0 \n    β_1 y_1^Tx_1 + ⋯ + β_n-1y_1^Tx_n-1   = 0.\n\n\tAccording to Lemma <ref>, every term after β_1 y_1^Tx_1 will be equal to zero. Therefore (<ref>) is reduced to\n\t\n    β_1 y_1^Tx_1 = 0.\n\n\tEquation (<ref>) tells us that Condition (<ref>) holds if either β_1=0 or y_1^Tx_1 = 0.\n\t\n\tSince we only have simple eigenvalues, it follows from Lemma <ref> that y_1^Tx_1 = 0 cannot occur. Therefore, we now consider β_1=0. \n\t\n\tIf we substitute β_1=0 back into (<ref>), the first term is eliminated and we are left with\n\t\n    w = β_2 x_2 + ⋯ + β_n-1x_n-1.\n\n\tWe know from Lemma <ref> that A_q and A_r will have the same right-eigenvectors corresponding to a particular eigenvalue. Therefore, each vector x_i is an eigenvector of A_q and the following holds:\n\t\n    A_q x_i = λ_i x_i,\n\n\tfor i = 1,2,⋯, n-2,n.\n\tAlso, for the eigenvalue μ=λ_n in (<ref>), there will be a left-eigenvector of A_q, y_0, that satisfies\n\t\n    y_0^T A_q = μy_0^T.\n\n\tNow, consider \n\t\n    w^Ty_0 = β_2 x_2^Ty_0 + ⋯ + β_n-1x_n-1y_0.\n\n\tWe can apply Lemma <ref> to show that each term in this sum is orthogonal and therefore zero. Thus,\n\t\n    w^Ty_0 = β_2 x_2^Ty_0 + ⋯ + β_n-1x_n-1y_0 = 0.\n\n\tEquation (<ref>) is just (<ref>). Therefore, we can conclude from Lemma <ref> that (<ref>) implies X_0=0. This contradicts our initial assumption that X_0>0.\n\t\n\n\n\tCase 2, (<ref>) is satisfied: \n\t\n\n\n\tIn this case, let y_1 be a left eigenvector of A_r such that \n\t\n    y_1^TA_r = (μ + ϵ) y_1^T\n and\n\t\n    B_2^Ty_1   = 0.\n\n\tWe know (A,B_2) is controllable by assumption. Since is (A,B_2) controllable, it follows immediately that (A + ϵI , B_2) is also controllable. Using this knowledge, we will make a manipulation on A_r to show that it is also controllable. To that end, remember A_r = QA + ϵQ, Q= I - B_2(C_1B_2)^-1C_2, and C_1B_2 is a scalar. Let k = -C_1(A+ϵI)/C_1B_2 and consider the following manipulation:\n\t\n    A_r = Q(A + ϵI)\n    \t\n    \t\t   = (A+ϵI) - (B_2C_1/C_1B_2)(A+ϵI) \n       = A + ϵI + B_2K.\n\n\tThus, we can conclude from (<ref>) that (A_r, B_2) is also controllable. An immediate consequence of (A_r, B_2) being controllable is  that there can be no left eigenvector of A_r that is orthogonal to B_2. Therefore, (<ref>) can never be satisfied and we have a contradiction. \n\t\n\n\n\tWe have shown that both cases lead to a contradiction. \n▪\n\n\n\n\nProof of Theorem <ref>: \n\tFor ϵ within the range 0 < ϵ < γ, where γ = -Re[λ_n-1], the closed-loop system is SNI follows directly from Theorem <ref>. For -Re[λ_n-2] < ϵ < -Re[λ_n-2], the matrix A_q will have attained an unstable eigenvalue. Consequently, X has dimension one. Therefore, if the system satisfies the conditions of Theorem <ref> for -Re[λ_n-2] < ϵ < -Re[λ_n-2], then the system will remain SNI for all ϵ within the range 0< ϵ < -Re[λ_n-2] follows directly from Theorem <ref>. \n▪\n\n\n\n\n\n\n§ ILLUSTRATIVE EXAMPLE\n \n\n\nIn this section we provide an illustrative example that illustrates Theorem <ref>.\n \n\n\n\nConsider an uncertain system\n\n\n    A    = [ -1  0 -1;  1  0 -1; -1  2  1 ],    \n    \tB_1    = [ 1; 1; 1 ],    \n    \tB_2    = [ 0; 1; 1 ], \n    \n    \tC_1    = [ 1 1 0 ],     D    = 0.\n\nthat satisfies assumptions A1-A2. The A_q matrix for this system is \n\n    A_q    = [ -1  0 -1;  1  0  1; -1  2  3 ],\n\nwith σ(A_q) = {-1.6458 ,    0 ,    3.6458 }. We can readily verify that for any ϵ<1.6458 this system satisfies the conditions of Theorem <ref>, and the closed-loop system is SNI.\n\nNow, we choose ϵ=1.6458 and reevaluate. With ϵ=1.6458, the matrix A_r = QA+ϵQ has the form\n\n    A_r    = [  0.6458       0      -1; -0.6458       0       1; -2.6458  0.3542  4.6458 ],\n\nwith σ(A_r) = {0 ,    5.2946 } and the 0 eigenvalue has multiplicity two. At exactly ϵ=1.6458, the matrix X is undergoing a dimension change and cannot be evaluated. Therefore, we analyse X as we approach ϵ=1.6458 from the positive direction on the real axis; i.e., we consider ϵ^+ : ϵ→ 1.6458^+.\n\nWe can reform X_ϵ^+ for our perturbed system as \t\n    X_ϵ^+   = [ -5.5431  0.2815;  0.2815  0.2477 ].\n\nIt is easily verified that X_ϵ^+ is dimension 2 and no longer positive definite, with a negative eigenvalue at -5.5568. We no longer satisfy the conditions of Theorem <ref> and cannot guaranteed the SNI property.\n\n\n\n\n§ CONCLUSIONS\n\nIn this paper we have studied the maximum prescribed degree of stability that can be achieved by SISO closed-loop systems formed using SNI state feedback. These results show that in the cases considered, the achievable degree of stability for the closed-loop system is related to the zeros of the transfer of the nominal plant from the control input to the disturbance output. These results were given under a number of assumptions and future research will be directed towards relaxing these assumptions and extending the results to MIMO systems. \n\n-12cm   \n                                  \n                                  \n                                  \n                                  \n                                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIEEEtran\n\n"}