{"entry_id": "http://arxiv.org/abs/2303.06858v1", "published": "20230313050301", "title": "Continuous-Time Zeroth-Order Dynamics with Projection Maps: Model-Free Feedback Optimization with Safety Guarantees", "authors": ["Xin Chen", "Jorge I. Poveda", "Na Li"], "primary_category": "math.OC", "categories": ["math.OC", "cs.SY", "eess.SY"], "text": "\n\n\n\n\n\nContinuous-Time Zeroth-Order Dynamics with Projection Maps: Model-Free Feedback Optimization with Safety Guarantees\n    Xin Chen, Jorge I. Poveda,  Na Li \nXin Chen is with the MIT Energy Initiative at the Massachusetts Institute of Technology, MA, USA. E-mail: xinch512@mit.edu. Jorge I. Poveda is with ECE Department, University of California, San Diego, CA, USA. E-mail: poveda@ucsd.edu. Na Li is with the School of Engineering and Applied Sciences at Harvard University, MA, USA. E-mail: nali@seas.harvard.edu.\n  This work was supported in part by NSF CAREER: ECCS 2305756, NSF CAREER: ECCS-1553407, NSF EAGER: ECCS-1839632, and AFOSR grant FA9550-22-1-0211.\n\n\n    Received: date / Accepted: date\n===================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\nThis paper introduces a class of model-free feedback  methods for solving generic constrained optimization problems where the specific mathematical forms of the objective and constraint functions are not available. The proposed methods, termed Projected Zeroth-Order (P-ZO) dynamics, incorporate projection maps into a class of continuous-time model-free dynamics that make use of periodic dithering for the purpose of gradient learning. In particular, the proposed P-ZO algorithms can be interpreted as new extremum-seeking algorithms that autonomously drive an unknown system toward a neighborhood of the set of solutions of an optimization problem using only output feedback, while systematically guaranteeing that the input trajectories remain in a feasible set for all times. In this way, the P-ZO algorithms can properly handle hard and asymptotical constraints in model-free optimization problems without using penalty terms or barrier functions. Moreover, the proposed dynamics have suitable robustness properties with respect to small bounded additive disturbances on the states and dynamics, a property that is fundamental for practical real-world implementations. \nAdditional tracking results for time-varying and switching cost functions are also derived under stronger convexity and smoothness assumptions and using tools from hybrid dynamical systems. \nNumerical examples are presented throughout the paper to illustrate the above results. \n\n\n\n\n\nModel-free control, zeroth-order methods, constrained optimization, extremum seeking, nonsmooth dynamical systems.\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nThis paper studies the design of model-free feedback control algorithms for autonomously steering a plant toward the set of solutions of an optimization problem using high-frequency dither signals. \nThis type of feedback control design \nhas recently attracted considerable attention, due to successful applications in power grids,\n \ncommunication networks, \nand mobile robots; see <cit.> and references therein.\n\n\nThe designing of these controllers for practical applications is particularly challenging because of two major obstacles: one is the lack of accurate models of the system, as many real-world systems are too complex to derive tractable mathematical equations that accurately describe their behavior in unknown or dynamic environments; the other obstacle is  to meet safety requirements by  properly handling various constraints, including physical laws, control saturation, capacity and budget limits, etc. This paper introduces a class of algorithms that can overcome both of these obstacles and are suitable for the solution of model-free constrained optimization problems describing safety-critical applications.\n\n \n\n\n\n §.§ Literature Review\n \n\nTo address the problem of unknown system models, real-time model-free control and optimization schemes have been extensively studied. In these approaches,\ninstead of pre-establishing a complex and often static/stationary system model from first principles and historical data, adaptive control algorithms probe the unknown plant and learn its optimal operation points using real-time output feedback. Such techniques, called extremum seeking (ES) controllers, leverage multi-time scale principles in control theory to steer dynamical systems towards an optimal steady state operation, while preserving closed-loop stability guarantees. ES techniques date back to the early 1920s <cit.>. However, the first general stability analysis for nonlinear systems was presented in the 2000s in <cit.> using averaging-based methods, and in <cit.> using sampled-data approaches based on finite-differences approximations. Since these methods make use of only measurements of the objective function, ES  exhibits a close connection with  discrete-time zeroth-order optimization dynamics <cit.>. In the continuous-time and finite-dimensional setting, ES algorithms have been further advanced during the last two decades using more general analytical and design techniques for continuous-time systems, see <cit.>.\n \n\n   \nHowever, despite the theoretical advances and practical applications in ES, one of the major challenges of existing schemes is how to guarantee the systematic satisfaction of hard and asymptotical constraints simultaneously. Hard constraints refer to physical or safety-critical constraints that need to be satisfied by the actions of the controller at all times, e.g. saturation or actuator capacity limits, the generation capacity of a power plant, etc. On the other hand, asymptotic constraints refer to soft physical limits or performance requirements \n  that can be violated temporarily during transient processes but should be met\nin the long-term steady state, e.g., the thermal limits of power lines and voltage limits imposed by industrial standards,  the comfortable temperature ranges required in building climate control, etc. \nProperly handling these two types of constraints is essential to ensure stability and optimality in real-time optimization algorithms.\n\nIn the context of ES, most of the approaches and stability results have been developed for unconstrained optimization problems. For optimization problems with hard constraints, the majority of the results and schemes have been limited to methods that integrate barrier or penalty functions in the cost <cit.>, which can limit the type and number of constraints that can be handled by the algorithms. In <cit.>, ES algorithms were introduced to solve optimization problems with constraints defined by certain Euclidean smooth manifolds and Lie Groups. These schemes, however, do not incorporate soft constraints in the optimization problem, and can only handle boundaryless manifolds. Anti-windup techniques in ES for problems that involve saturation were studied in <cit.>, and ES with output constraints were studied in <cit.> using boundary tracing techniques. Switching ES algorithms that emulate sliding-mode techniques were also presented in <cit.> to handle hard constraints in time-varying problems. More recently, an innovative approach that combines safety filters and ES was introduced in <cit.> using control barrier functions and quadratic programming. To handle soft constraints, ES approaches based on saddle flows have also been studied in <cit.>. Finally, more closely related to our setting are the works <cit.>, which considered ES algorithms with certain projection maps for scalar problems <cit.>, and numerical studies of Nash-seeking problems with box constraints <cit.>.\n\n\n\n\n\n\n §.§ Contributions and Organization\n \n\nThis paper introduces a class of continuous-time projected zeroth-order (P-ZO) algorithms for solving generic constrained optimization problems with both hard and asymptotical constraints. Based on ES and two different types of projection maps,\nthe proposed P-ZO methods  can be interpreted as model-free feedback controllers that steer a plant towards the set of solutions of an optimization problem with hard and soft constraints, using only measurements of the objective and constraint functions. In particular, we explain the main advantages and innovations of the proposed algorithms below:\n\n\n\n\n\n\n(a) Model-Free Methods: We study a class of optimization algorithms that use only measurements or evaluations of the objective function and the constraints, i.e., zeroth-order information. In this way, the algorithms do not require knowledge of the mathematical forms of the expressions that define the optimization problem, or their gradients. We show that, under suitable tuning of the control parameters, the trajectories of the proposed model-free ZO algorithms can approximate the behavior of continuous and discontinuous first-order model-based dynamics <cit.>. By exploiting real-time output feedback, the proposed algorithms are inherently robust and adaptive to time-varying unknown disturbances, and for a general class of objective functions, potentially time-varying or switching between a finite collection of candidates. \n\n\n\n(b) Safety and Optimality via Hard and Soft Constraints: The proposed algorithms can satisfy safety-critical constraints at all times by using continuous or discontinuous projection maps. The systematic incorporation of these mappings into ES vector fields remained mostly unexplored in the literature, and our results show that they can be safely used in feedback loops to solve optimization problems with hard constraints. In the context of ES, to allow for enough exploration via dithering, the projection maps are applied to a shrunken feasible set that can be made arbitrarily close to the nominal feasible set by decreasing the amplitude of the dithers. In this way, the algorithms are able to provide suitable evolution directions near the boundary of the feasible set, achieving a property of “practical safety”, similar in spirit to the one studied in <cit.>. In addition to the hard constraints, the proposed controllers are also able to simultaneously handle soft constraints via primal-dual ES vector fields, thus achieving safety and optimality in a variety of model-free optimization problems. \n    \n\n\n(c) Stability and Performance Guarantees: We leverage averaging and singular perturbation theory for non-smooth (and hybrid) systems, as well as Lyapunov-based arguments, to show that the proposed dynamics can guarantee convergence to an arbitrarily small neighborhood of the optimal set, from arbitrarily large compact sets of initial conditions in the feasible set. Moreover, by exploiting the well-posedness of the dynamics and the optimization problem, the algorithms also guarantee suitable robustness properties with respect to arbitrarily small bounded additive disturbances acting on the states and dynamics of the closed-loop system. This is a fundamental property for practical applications and  is non-trivial to achieve in model-free algorithms. We also provide tracking bounds for time-varying optimization problems using (practical) input-to-state stability tools, and we provide stability results for a class of ES problems  with unknown switching objective functions,  which have remained mostly unexplored in the literature.\n\n\n\n\n\n\n\n\n\n\n\n\nEarlier, partial results of this paper appeared in the conference paper <cit.>. The results of <cit.> are dedicated only to a particular optimal voltage control problem in power systems using only one of the algorithms studied in this paper. In contrast to <cit.>, in this paper, we consider a generic constrained optimization problem and we study two different types of projection maps (continuous and discontinuous), which require different analytical tools and lead to two different algorithms. Additionally, we present novel tracking results for time-varying optimization problems and problems with switching costs, and we establish robustness guarantees for all the algorithms. Unlike <cit.>, we also present the complete proofs of the results, as well as novel illustrative examples.\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n\n\n\n\n\n\n\nThe remainder of this paper is organized as follows: \nSection <ref> introduces the notation and the preliminaries. Section <ref> presents the problem formulation. Section <ref> introduces the projected ZO dynamics that incorporate Lipschitz projection maps, and establishes results for static maps, time-varying maps, and switching maps. Section <ref> considers projected gradient-based ZO dynamics with discontinuous projections. Section <ref> presents the analysis and proofs. Numerical experiments are presented throughout the paper to illustrate the main ideas and results. The paper ends with conclusions presented in Section <ref>.\n\n\n\n\n\n\n\n§ NOTATION AND PRELIMINARIES\n\n\n\n\n\n\n\n\n §.§ Notation\n\n\nWe use unbolded lower-case letters for scalars and bolded lower-case letters for column vectors. \nWe use ℝ_+:=[0,+∞) to denote the set of non-negative  real values and use  to denote a closed unit ball of appropriate dimension.  \n\nWe use\n||·|| to denote the Euclidean norm of a vector and  use [; ] := [^⊤, ^⊤]^⊤ to denote the column merge of column vectors ,. Given a positive integer n, we   define the index set [n]:={1,⋯,n}. The distance between a point ∈^n and a nonempty  closed convex set ⊆^n is denoted as ||||_:=∈inf  ||-||; and the Euclidean projection of  onto the set  is defined as \n\n\n    𝒫_():= ∈arg  inf  || -||.\n\n\nThe norm cone to a set  at a point ∈ is defined as \n\n\n    N_():=   {∈ℝ^n: ^⊤( -) ≤ 0,  ∀ ∈}.\n\n\nThe tangent cone to     at a point ∈ is defined as \n\n\n    T_():=  {∈ℝ^n: ^⊤≤ 0,  ∀ ∈ N_()  },\n\n\nwhich is the polar cone of the normal cone N_(). \n\n\n\n\n\n\n\n\n\nA continuous function β(r,s): _+×_+→_+ is said to be of class-𝒦ℒ if it is zero at zero, non-decreasing in its first argument r, non-increasing in the second argument s, lim_r→0^+β(r,s)=0 for each s, and lim_s→∞β(r,s)=0 for each r <cit.>.\n\nIn this paper, we will consider constrained dynamical systems in the form:\n\n\n    𝐱∈ C,   𝐱̇∈ F(𝐱),\n\n\nwhere 𝐱∈ℝ^n is the state, C is the    flow set, and F:ℝ^n⇉ℝ^n is the  flow map, which can be set-valued. We use 𝐱̇=d𝐱(t)/dt to denote the time derivative of the function t↦𝐱(t). A function  is said to be a (Caratheodory) solution to (<ref>) if\n1) t↦𝐱(t) is absolutely continuous on each compact sub-interval of its domain dom(𝐱); 2) 𝐱(0)∈C; and 3) 𝐱̇(t)∈ F(𝐱(t)) and 𝐱(t)∈ C for almost all t∈dom(𝐱) <cit.>. The solution 𝐱 is said to be complete if dom(𝐱)=[0,∞). \n If the flow map F is single-valued,  (<ref>) reduces to an ordinary differential equation. If  F is also continuous, solutions 𝐱 to (<ref>) are continuously differentiable functions. In addition, if F is locally Lipschitz, then solutions of (<ref>) are unique.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Preliminaries on Extremum Seeking Control\n\n\n\n\n\nExtremum Seeking (ES) control is a type of adaptive control that is able to steer a plant towards a state that optimizes a particular steady-state performance metric using real-time output feedback. These types of controllers can be seen as continuous-time ZO optimization algorithms with (uniform) convergence and stability guarantees. \nTo explain the rationale behind these algorithms, we consider the optimization problem \n\n\n    min_x f(x),\n\n\nwhere f:ℝ→ℝ is a continuously differentiable function.  \n\n\n\n\n\n\nA standard approach to finding the minimizer of f is to use a gradient descent flow in the form ẋ = -k_x·d f(x)/d x, where the gain k_x defines the rate of evolution of the system. However, when the derivative of f is unknown, gradient flows cannot be directly implemented, and instead, model-free techniques are required. To address this issue, ES approximates the behavior of the gradient flow by adding a high-frequency periodic probing signal ε_a μ̂(t) with amplitude ε_a to the nominal input of the plant. The resulting output y = f(x+ ε_a μ̂(t)), which is assumed to be available for measurements, is then multiplied by the same probing signal μ̂(t), and further normalized by the constant 2/ε_a. The loop is closed with an integrator with a negative gain -k_x, leading to the ES dynamics: \n\n\n    ẋ = -k_x 2/ε_a  f(x+ε_a μ̂(t)) μ̂(t).\n\n\nWhen the frequency of μ̂(·) is sufficiently large compared to the rate of evolution k_x, \n\n\nthe ES dynamics (<ref>) exhibits a time scale separation property that allows to approximate the behavior of x based on the average of the vector field of (<ref>). For example, consider the use of a sinusoidal signal as the probing single, i.e.,  μ̂(t) := sin (ω t). With large ω>0 and small ε_a,\n\n\n\n\n\n\n\n\n\nwe  consider the Taylor expansion of f: \n    f(x+ε_asin(ω t)) =  f(x)\n    + ε_asin(ω t)d f(x)/d x +   𝒪(ε_a^2).\n By  computing the average of the vector field of (<ref>) over one period T=2π/ω of the probing signal, one obtains\n\n\n\n\n\n\n\n\n\n\n\n    ẋ    = 1/T∫_0^T-k_x2/ε_a  f(x+ε_asin(ω t))sin(ω t)   dt \n       \n    = -k_x/T∫_0^T2sin^2(ω t)d f(x)/d x + (ε_a)   dt , \n        = -k_xd f(x)/d x +  (ε_a):=h_ave(x)\n\n \n where (ε_a) denotes high-order terms, bounded on compact sets, that vanish as ε_a→0^+. The average system (<ref>) is essentially an (ε_a)-perturbed gradient descent flow. Under suitable assumptions on f, averaging theory and perturbation theory show that the trajectories of (<ref>) will approximate those of (<ref>) (on compact sets and compact time intervals) as ε_a→0^+ and as ω→0^+ <cit.>. Uniform stability properties of gradient flows can then be leveraged to establish stability results for (<ref>) in the infinite horizon <cit.>. This analysis can also be applied to the multi-variable case using an appropriate choice of the (vector) frequencies ω, and to other architectures using Lie-bracket averaging theory that results in a similar average system <cit.>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n§ PROBLEM FORMULATION\n \n\n\n\n\n\n\n\n\nIn contrast to (<ref>), in this paper, we consider generic constrained optimization problems in the form:\n\n\n\n    Obj.     min_  f() \n    s.t.      ∈\n        g_j()≤ 0,      j∈[m],\n\n\n\nwhere ∈^n is the decision variable, f:^n→ is the  objective function, ⊆^n denotes the feasible set of , and the vector-valued function :=[g_1;g_2;⋯;g_m]:^n→^m describes additional inequality constraints on . The set of the optimal solutions of (<ref>) is denoted as 𝒳^*⊂ℝ^n.\n\n  Information Availability:\nWe consider  the problem setting where the feasible set 𝒳 is known but the mathematical forms of f(·) and (·) are unknown. In this case, one can only query (in real-time) the  values of f() and () for a given . That is, the optimization solver can only access the zeroth-order information of f(·) and (·), but not their (first-order) gradients  or (second-order) Hessian information. \n\n\n \n\n\nThe motivation and rationale of the above problem setting are explained below:\n\n\n  \n    \n  1) The above problem is motivated by the  feedback control design that seeks to steer an unknown plant in real time to an optimal solution of problem (<ref>). Here, we model the plant using the static input-to-output maps f(·) and (·) to approximate its dynamics. The validity of this approximation lies in the fact that in many applications the plant is a stable dynamical system that converges to a steady state in a much faster time scale compared to the controller. The steady-state approximation of the plant can then be justified using singular perturbation results for nonlinear systems <cit.>, provided that the time-scale separation is sufficiently large. \n    \n    \n    \n    \n    \n    \n     \n     \n       \n \n\n\n \n  \n\n\n \n\n\n  2) For many complex engineering systems, their  models, captured by the maps f(·) and (·), may be unknown, unavailable, or too costly to estimate. \n   \nOn the other hand, the widespread deployment of smart meters and sensors provides real-time  measurements of the system outputs. These measurements can be \n interpreted as the function evaluations of f(·) and (·) and  can be used as the system feedback to circumvent the unknown model information. \n\n\n  3) In problem (<ref>), we\n    distinguish  hard constraints, modeled by , and asymptotic constraints, modeled by the inequalities  (<ref>). Thus, the constraints imposed by   (<ref>) must be satisfied at all times, while inequalities (<ref>) \n    may be violated during the transient process but should be  satisfied   in the steady states.\n\n\n\nThis paper aims to develop model-free feedback optimization algorithms that are able to solve problem (<ref>) using only zeroth-order information, while simultaneously  satisfying hard and asymptotic constraints. To achieve these goals, in Sections <ref> and <ref>, we will study a class of ZO feedback optimization algorithms that are based on ES and incorporate two types of projection maps. To guarantee that problem (<ref>) is well-posed, throughout this paper we will make the following assumptions, which, as discussed later, can be used to relax standard global convexity assumptions considered in the literature of ES.\n\n\n\n \n The feasible set 𝒳 is  nonempty, closed, and convex. The functions f and g_1,⋯,g_m are convex and continuously differentiable on an open set containing 𝒳. The function f is radially unbounded.\n\n\n\n\n\n\n\n\n\n\n \nProblem (<ref>) has a finite optimum and the Slater's conditions hold. Moreover, the set  of optimal solutions ^* is compact. \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n§ MODEL-FREE FEEDBACK OPTIMIZATION  WITH LIPSCHITZ PROJECTIONS\n\n\n\nIn this section, we introduce a class of gradient-based continuous-time ZO algorithms that incorporate Lipschitz continuous projection maps. We term these algorithms as the projected gradient-based zeroth-order (P-GZO) dynamics. We first study a reduced version of (<ref>) that considers only the hard constraint (<ref>), i.e., we consider the problem:\n\n\n    min_∈ f().\n\n\nFor this problem, we establish stability, safety, and  tracking results under the P-GZO dynamics. After this, we develop results for the case when f is dynamically drawn from a finite collection of cost functions that share the same minimizer, a problem that emerges in systems with switching plants. Lastly, we further incorporate the constraints (<ref>) using a projected primal-dual zeroth-order (P-PDZO) algorithm. \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n §.§ GZO Dynamics with Lipschitz Projection\n \n\n\nTo solve (<ref>), we develop the following dynamics termed\nprojected gradient zeroth-order (P-GZO) dynamics:\n\n\n\n    𝐱̇   =k_x (𝒫_𝒳(𝐱-α_x  ξ)-𝐱),\n       =1/ε_ξ(-+2/ε_af(𝐱̂) ),\n       =1/ε_ωΛ_κ,\n\n\n\nwhere k_x,α_x,ε_ξ,ε_a,ε_ω>0 are tunable parameters. The dynamics (<ref>) incorporates a Lipschitz projection map of the form (<ref>) to ensure that  stays within the feasible set . The dynamics (<ref>)  estimates the gradient ∇ f with a new state ∈^n, whose dynamics depend on the measured output y=f(), where  is the perturbed input   defined as\n\n\n    :=   + ε_a .\n\n\nIn (<ref>), :ℝ_≥0→^n is a vector-valued  periodic dither signal that is  generated by the linear dynamic oscillator (<ref>). Specifically, the vector  collects all the odd entries of the state ∈^2n, i.e.,\n\n\n    := [ μ_1,  μ_3,  μ_5,⋯, μ_2n-1]^⊤.\n\n\nThe matrix Λ_κ∈ℝ^2n× 2n in (<ref>) is block diagonal, with the i-th diagonal block given by\n\n\n    Λ_κ_i=[[      0 -2πκ_i;  2πκ_i      0 ]]∈^2× 2,    i∈[n],\n\n\nwhich is parameterized by the tunable constant κ_i>0. Hence, (<ref>) describes n autonomous oscillators, whose solutions  can be explicitly computed as\n\n \n    μ_i(t) = μ_i(0)sin(2πκ_i/ε_ω t)   \n    +μ_i+1(0)cos(2πκ_i/ε_ω t),   \n           ∀  i = 1, 3, ⋯, 2n-1,\n  \n\nand we choose initial conditions that satisfy \n\n\n    μ_i(0)^2 + μ_i+1(0)^2=1.\n\n\n\nFor example, when μ_i(0) = 1 and μ_i+1(0) = 0 for i = 1, 3, ⋯, 2n-1, equation (<ref>) becomes\n\n    (t):= [sin(2πκ_1/ε_ω t), ⋯, sin(2πκ_2n-1/ε_ω t) ]^⊤.\n\n\nIn addition to sinusoidal dither signals, other types of dither signals can also be employed to obtain suitable estimations of the gradient, including triangular waves and square waves, see <cit.>.  By incorporating the linear dynamic oscillator (<ref>), the P-GZO dynamics (<ref>) becomes an autonomous system, which facilitates the theoretical analysis. \n\nThe P-GZO dynamics (<ref>), with the overall state :=(, ,  ), is restricted to evolve on the following flow set\n\n\n    𝐂_1:=𝒳×ℝ^n×𝕋^n,\n\n\nwhere 𝕋^n:=𝕊×𝕊×…×𝕊 \nand 𝕊⊂^2 denotes the unit circle centered at the origin. By construction and Assumption <ref>, the set 𝐂_1 is closed, and it enforces condition (<ref>) on the initialization of the state . Note that the P-GZO dynamics (<ref>) has a Lipschitz continuous vector field on the right-hand side due to the use of a Lipschitz projection mapping. Figure <ref> shows a block diagram of the proposed algorithm.\n\n\n\n\n\nThe following assumption will be used throughout  this paper to distinguish different dither signal components with different frequency parameters.\n\n\n\nThe parameters κ_i>0 in (<ref>) are rational numbers and satisfy κ_i≠κ_j, and κ_i≠ 2κ_j for all i≠ j. \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n \nWe further explain the proposed P-GZO dynamics (<ref>) with the following remarks.\n\n\n\n\n\n\n\n The intuition behind the P-GZO dynamics (<ref>) is that, under a sufficiently small ε_ω and ε_a, the term 2/ε_af(𝐱̂) gives, on average, an (ε_a)-approximation of the gradient ∇ f(). The dynamics (<ref>) with a small ε_ξ behaves like a low-pass filter that takes  2/ε_af(𝐱̂) as the input, and proceeds to output a refined signal , which can mitigate oscillations induced by the dither. Moreover, the introduction of the state  with dynamics (<ref>) facilitates the analysis of the projected system via averaging theory by removing from  the term that explicitly includes the highly oscillatory signal . Otherwise, the projection in (<ref>) may interfere with the computation of the average dynamics of  near the boundary of . \n\n\n\n\n\n\n \n\n(Safety and Optimality). As we will show below in Lemma <ref>, the projection map in (<ref>) guarantees that  remains always in the feasible set ,\nand thus the actual decision input  always remains in a small tunable (ε_a)-inflation of . This property defines a notion of “practical\" safety, similar to those studied in using safety filters and smooth orthogonal projections <cit.>. However, in contrast to other constrained model-free algorithms that use barrier functions <cit.>, orthogonal projections <cit.>, or safety filters <cit.>, the state  in (<ref>) can actually hit the boundary of 𝒳 in a finite time, a situation that emerges in problems with saturation constraints. On the other hand, for safety-critical applications where the decision input  must stay within , the projection map can be applied to a shrunk feasible set 𝒳_ε_a satisfying 𝒳_ε_a+ε_a𝔹⊆𝒳. In addition, as stated below in Theorem <ref>, when ε_ξ and ε_a are also sufficiently small, the trajectory  of (<ref>) will converge to a small tunable neighbor of the optimal set ^* that solves problem (<ref>).   \n\n\n\n\n\n\n\n\n\n §.§ Stability Analysis of the P-GZO Dynamics\n\n\n\n\n\n\n\nTo study the P-GZO dynamics (<ref>), we first establish the following lemma, showing that the solutions  of (<ref>) remain in the flow set 𝐂_1. The proof is provided in Appendix <ref>. \n \n\n\n \nSuppose that Assumption <ref> holds.\n Let 𝐳:=(𝐱,ξ,μ) be a solution of   P-GZO dynamics (<ref>)  with 𝐳(0)∈𝐂_1.   Then,  \n 𝐳(t)∈𝐂_1 and 𝐱̂(t)∈𝒳+ε_a𝔹 for all t∈dom(𝐳). \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe analyze the stability and convergence properties of the  P-GZO dynamics (<ref>) based on the properties of a nominal “target system”, given by\n\n\n    𝐩∈,  𝐩̇=k_x(𝒫_𝒳(𝐩-α_x∇ f(𝐩))-𝐩),\n\n\nwhich has been well studied in  the literature <cit.>. The following theorem, which is the first result of this paper, only relies on assuming the well-posedness of (<ref>) and suitable stability properties for (<ref>). Particular cases where these assumptions are satisfied are discussed afterwards.\n\n\n\n \n\nSuppose that Assumptions <ref>-<ref> hold, and \n\n\n\n\n  * Every solution of (<ref>) with 𝐩(0)∈𝒳 is complete;\n\n\n  * System (<ref>) renders the optimal set 𝒳^* forward invariant and uniformly attractive. \n\n\n\nThen, for any Δ>ν>0 there exists ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ) there exists ε̂_a>0 such that for all ε_a∈(0,ε̂_a), there exists ε̂_ω>0 such that for all ε_ω∈(0,ε̂_ω),  every solution 𝐳 of the P-GZO dynamics \nwith 𝐳(0)∈𝐂_1∩(𝒲_1^*+Δ𝔹)×𝕋^n) is complete and satisfies:\n\n\n    (Practical Convergence):  lim sup_t→∞  ||𝐱(t)||_𝒳^*≤ν,    \n       (Practical Safety):  𝐱(t)∈𝒳, 𝐱̂(t)∈𝒳+ε_a𝔹, ∀ t≥ 0,\n\n\nwhere 𝒲_1^*:={(𝐱,)∈ℝ^2n:𝐱∈𝒳^*, =∇ f(𝐱)}. \n\n\n\n\n\n\n The complete proof of Theorem <ref> is presented in Section <ref> as a particular case of a more general result presented later in Theorem <ref>. The result of Theorem <ref> establishes two main properties: 1) convergence from arbitrarily large Δ-compact sets of initial conditions to arbitrarily small ν-neighborhoods of the optimal set, which is typical in zeroth-order algorithms; and 2) the safety result (<ref>) for  and  that holds for all time t≥ 0. The result does not assume that the feasible set 𝒳 is bounded, but, when this is the case, the results become global.\n \n \n \n\n\nThe conditions under which the assumptions (a) and (b) in Theorem <ref>  hold for the nominal system (<ref>) have been extensively studied in the literature <cit.>. For example, these two assumptions hold when the objective function f is strictly convex <cit.>, in which case 𝒲_1^* is a singleton.  In fact, the result of Theorem <ref> holds even when ∇ f in (<ref>) is replaced by a general strictly monotone mapping, since in this case assumptions (a) and (b) of Theorem <ref> also hold <cit.>. This implies that Theorem <ref> can also be used for decision-making problems in games using the pseudo-gradient instead of the gradient.\n\n\nOne of the main limitations of traditional zeroth-order algorithms that emulate gradient descent, such as (<ref>), is that the cost f might not be convex (or gradient-dominated) in ℝ^n, precluding global convergence results. In this case, projection maps can be used to restrict the evolution of the algorithm to “safe” zones 𝒳 where suitable convexity/monotonicity properties hold. This observation is illustrated in Figure <ref>, where a non-convex landscape, with multiple local minima, maxima, and saddle points, is safely optimized in a set 𝒳 where the assumptions of Theorems <ref> and <ref> hold. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Tracking Properties of P-GZO Dynamics\n\n\nFor many practical applications, the corresponding optimization problem (<ref>) is not static but time-varying, whose objective and constraints may change over time. This subsection considers the time-varying optimization setting by letting the objective f in (<ref>) depend on a time-varying parameter ∈^p, i.e., we now consider mappings (,)↦ f(,). In addition,   is assumed to be generated by an (unknown) exosystem in the form: \n\n\n\n    ∈Θ,  =ε_θΠ(),\n\n\nwhere ε_θ>0 is a parameter that describes the rate of change of θ, Θ⊂ℝ^p is a compact set, and Π(·) is a locally Lipschitz map.\nSystem (<ref>) is assumed to make the set Θ forward invariant.\n\nAs a result, the optimizer ^* is also time-varying and forms a trajectory t↦𝐱^*((t)). We study the tracking performance of the P-GZO dynamics for solving the time-varying version of problem (<ref>). We make the following assumption on the variation of f, which guarantees uniqueness of the optimal trajectory t↦𝐱^*().\n\n\n\n\n\n\n\n\nThere exists a continuously differentiable function :ℝ^p→ℝ^n such that\n\n\n    𝐱^*():=()=argmin_𝐱∈𝒳f(𝐱,),\n\n\nfor all ∈Θ. Also, there exist ℓ,γ>0 such that \n\n\n\n    ||∇ f(𝐱,)-∇ f(𝐲,)||≤ℓ||𝐱-𝐲||,\n       f(𝐱,)-f(𝐲,)≥∇_ f(𝐲,)(𝐱-𝐲)+γ/2||𝐱-𝐲||^2,\n\n\nfor all 𝐱,𝐲∈ℝ^n and  ∈Θ.\n\nIn addition, there exists M>0 such that \n\n\n    ||∂/∂∇_ f(𝐱,) ||≤ M,\n\n\nfor all 𝐱∈ℝ^n and all ∈Θ.\n\n\n\n\n\n\n\nThe conditions (<ref>) and (<ref>) imply the smoothness and strong convexity of f with respect to , respectively, uniformly on θ. They are commonly assumed in time-varying optimization problems and will enable an exponential practical input-to-state stability for the P-GZO dynamics (<ref>). The following theorem states the tracking performance of the P-GZO dynamics (<ref>), while preserving the Practical Safety property (<ref>). The proof is presented in Section <ref>.\n\n\n\n\n\n\n\n\n  \nConsider the system dynamics (<ref>), (<ref>) with the flow set  \n𝐂_1×Θ. Suppose that Assumptions <ref>-<ref> hold.  Then, there exists c>0 such that for any Δ>ν>0, there exists ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ), there exists ε̂_a>0 such that for all ε_a∈(0,ε̂_a), there exists ε̂_ω>0 such that for all ε_ω∈(0,ε̂_ω),\n every solution 𝐳 of the P-GZO dynamics with 𝐳(0)∈𝐂_1∩(( 𝐰^*(0)+Δ𝔹)×𝕋^n) is complete and satisfies the Practical Safety property (<ref>), and also: \n\n\n    (Practical Tracking):\n           lim sup_t→∞ ||𝐱(t)-𝐱^*((t))||≤ c·sup_t≥0||(t)||+ν.\n\n\nwhere  𝐰^*(0):= (𝐱^*((0)),  ∇ f(𝐱^*((0))) ).\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nThe proof of Theorem <ref> relies on  \ninput-to-state stability (ISS) tools for perturbed systems, which have been recently exploited to study other model-free optimization problems, e.g., <cit.>. Due to the continuity of Π(·) and the compactness of Θ, the function t↦(t) is uniformly bounded,  and thus the term sup_t≥0||(t)|| in (<ref>) is well-defined and bounded by ε_θcmax_∈ΘΠ().\n\n\n\n\n\n\n\n\n\n \nTo illustrate the tracking behaviors of the P-GZO dynamics, we consider a simple problem in the plane, where f(𝐱,)=(x_1-x_1^*())^2+(x_2-x_2^*())^2 and the feasible set is the disk :={∈ℝ^2: (x_1-1.5)^2+x_2^2≤9/4}. Let  be generated by the dynamics \n θ̇_1=ε_θsin(2θ_2), θ̇_2=ε_θ/2cos(θ_1), with ε_θ=1× 10^-3 and let  x_i^*():=θ_i, i∈[2].\n \n To ensure strict safety, we use an ε_a-shrunk feasible set _ε_a:= {: (x_1-1.5)^2+x_2^2≤ (3/2-ε_a)^2}.\n Figure <ref> shows the time-varying optimizer trajectory t↦^*(t) and the solution trajectory t↦(t) of the P-GZO dynamics (<ref>) under frequencies that are not necessarily too large, e.g., ε_ω∼𝒪(10^0), and amplitudes that are not necessarily too small, e.g., ε_a∼𝒪(10^-1), which is a situation that is common in practical applications with computational limitations. It is observed that (t) tends to closely track ^*(t) in the interior and   the boundary of 𝒳.  \n\n \n\n\n\n\n\n\n\n\n\n §.§ Switching Objective Functions\n\n\nThis subsection considers the problem setting with switching objective functions. Depending on the information available to the decision-maker,  the objective function in (<ref>) is drawn from a finite collection of functions {f_q(𝐱)}_q∈ Q. The selection of the current function to be optimized at each time t might be performed by an external entity, leading to passive switching, or by the decision-maker, leading to active switching. In both cases, we show that provided the minimizers and critical points coincide across functions, the P-GZO dynamics can safely achieve extremum seeking in a model-free way. \n\nUnder switching objective functions,  the dynamics of the low-pass filter (<ref>) become\n\n\n\n    =1/ε_ξ(-+2/ε_af_q(𝐱̂)),\n\n\nwhere q is a switching signal that selects from the set of indices Q:={1,2,…,q̅}, with q̅<∞, the function f_q to be used in the model-free algorithm at each time t, see Figure <ref>.\n\n\nThis switching signal is generated by the following hybrid dynamical system <cit.>:\n\n\n\n    (q,τ)∈ Q×[0,N_0],   q̇=0,        τ̇∈[0,1/τ_d],\n       (q,τ)∈ Q×[1,N_0],   q^+∈ Q\\{q},  τ^+=τ-1,\n\n\n\nwhere the state τ is a timer indicating when the signal q is allowed to switch via (<ref>). In (<ref>), τ_d>0 is called the dwell-time, and N_0 is the chatter bound. As shown in <cit.>, the hybrid system (<ref>) guarantees that every switching signal q satisfies an average dwell-time (ADT) constraint. In particular, for every pair of times (t_1,t_2) with t_2>t_1, every solution of (<ref>) satisfies:\n\n\n    𝒮(t_1,t_2)≤1/τ_d(t_2-t_1)+N_0,\n\n\nwhere 𝒮(t_1,t_2) is the number of switches between times t_1 and t_2. The following theorem establishes the convergence and safety properties of the P-GZO dynamics under switching objectives. For simplicity, we consider the static optimization case when the optimizer ^* is not time-varying but remains the same, and we omit the dependence of  on discrete-time indices, which is typical in hybrid systems of the form (<ref>). The proof of Theorem <ref> is provided in   Section <ref>.\n\n\n\n\n\nConsider the system dynamics (<ref>), (<ref>), (<ref>), (<ref>).\nSuppose that all functions in {f_q()}_q∈ Q are strongly convex and smooth,  Assumptions <ref> and <ref> hold for each of them, and they share\n\n\n\n\n  (a) common minimizer: ^*=min f_q(), for all q∈ Q;\n\n\n  (b) common critical point: ^*=∇ f_q(^*),  for all q∈ Q.\n\n\nThen, for any Δ>ν>0, there exists ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ), there exists ε̂_a>0 such that for all ε_a∈(0,ε̂_a), there exists ε̂_ω>0 such that for all ε_ω∈(0,ε̂_ω),\n every solution (t) of the P-GZO dynamics (<ref>), (<ref>), (<ref>) with 𝐳(0)∈𝐂_1 ∩(((^*,^*)+Δ𝔹)×𝕋^n) is complete and satisfies the Practical Safety property (<ref>), and also:\n\n\n\n    (Practical Stability under ADT Switching):\n    lim sup_t→∞ ||𝐱(t)-𝐱^*||≤ν.\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor unconstrained optimization problems, it has been shown in <cit.> and <cit.> that switched  ES algorithms are stable when each mode is stable and the switching is sufficiently slow.\n\nThe novelty of Theorem <ref> lies in the incorporation of constraints  into the switched zeroth-order dynamics via projection maps.  Moreover, as shown in the analysis, the rate of convergence in (<ref>) and (<ref>) is actually exponential. \n\n\n\n\n Real-time optimization problems with switching costs and safety constraints emerge in many engineering problems. For example, in the economic dispatch problem in electric power systems, the generation fuel costs and electricity prices can change over time, but sudden small price changes  may not lead to   different optimal dispatch solutions. \n\n\n\n\n\n\n\n\n\n\n\n §.§ Projected Primal-Dual ZO Dynamics with Lipschitz Projections\n \n\nWe now consider the complete optimization problem (<ref>), including the inequality constraints (<ref>). To solve  this problem, we first introduce the dual variable :=(λ_j)_j∈[m]∈_+^m for the inequality constraints (<ref>),\nand we formulate the  saddle \n point problem  (<ref>):\n \n\n    max_∈_+^m min_∈𝒳  L(,):=f()+  ^⊤(),\n\n\nwhere  L(,) is the  Lagrangian function. Denote := [;], \ndefine 𝒴:= 𝒳×_+^m as the feasible set  of , and denote ^* as the set of the saddle points that solve  (<ref>). \nBy strong duality (implied by Assumptions <ref> and <ref>), the -component of any saddle point ^*:= [^*;^*]∈^* of (<ref>) is an optimal solution to problem (<ref>).\n\nSimilar to the design of P-GZO dynamics (<ref>) in Section <ref>, \nwe develop the projected primal-dual zeroth-order (P-PDZO) dynamics (<ref>) for the solution of problem (<ref>):\n\n \n\n    = k_x[_ (  - α_x  _1 ) -], \n        =k_λ[ __+^m(  + α_λ_2\n         ) -],\n    _1    =1/ε_ξ[ -_1 + 2/ε_a(f() + \n              ^⊤ () )],\n        \n    _2    =1/ε_ξ[ -_2 +  () ],  \n       =1/ε_ωΛ(κ) ,\n\n\nwhere  the parameters are defined in the same way as (<ref>), and  and  are defined as (<ref>) and (<ref>), respectively. Thus, the P-PDZO dynamics  (<ref>) is restricted to evolve in the flow set\n\n\n    𝐂_2=𝒳×ℝ_+^m×ℝ^n×ℝ^m×𝕋^n.\n\n\n\nThe P-PDZO dynamics (<ref>) can be regarded as a generalization of the P-GZO dynamics (<ref>) that further incorporates the inequality constraint (<ref>). Hence, the properties of P-GZO are generally applicable to P-PDZO, such as those mentioned in Remarks <ref> and <ref>.  \nThe following lemma states the forward invariance of 𝐂_2, which\ndirectly follows by Lemma <ref> by replacing 𝒳 with\n  𝒳×ℝ_+^m, and thus we omit the proof here.\n\n\n\n\n\nSuppose that Assumption <ref> holds. Let 𝐳:=(𝐱,,_1,_2,) be a solution of the P-PDZO dynamics (<ref>). Then, 𝐳(t)∈𝐂_2 and 𝐱̂(t)∈𝒳+ε_a𝔹 for all t∈dom(𝐳).  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe study the stability properties of the P-PDZO dynamics (<ref>) based on the stability of the nominal target system:\n\n \n\n    𝐩̇_1    = k_1[_( 𝐩_1 - α_1( ∇ f(𝐩_1) +   ∇(𝐩_1)^⊤_2 )   ) -𝐩_1 ], \n    𝐩̇_2     = k_2 [__+^m( 𝐩_2 + α_2 (𝐩_1)\n         ) -𝐩_2],\n\n\n\nwhere ∇:= [∇^⊤ g_1;⋯;∇^⊤ g_m ] is the Jacobian matrix. \n\nThe nominal system (<ref>) is \na well-known projected saddle flow that has been widely studied in the literature <cit.>.\n\n\nThe following theorem shows that the component  of the solution of (<ref>) will converge to  a neighborhood of the saddle-point set ^* using only zeroth-order information of f and , provided ^* is compact and uniformly globally asymptotically stable (UGAS) under the nominal system (<ref>). The proof is presented in Section <ref>.\n\n\n\n\n\nLet :=[_1;_2], and suppose that Assumptions <ref>-<ref> hold, and:  \n\n\n\n\n  * The saddle point set ^* is compact;\n\n\n  * Every solution of (<ref>) with (0)∈ is complete; \n\n\n  * System (<ref>) renders the saddle point set ^* forward invariant and uniformly attractive.\n\n\n\nThen, for any Δ>ν>0, there exists ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ), there exists ε̂_a>0 such that for all ε_a∈(0,ε̂_a), there exists ε̂_ω>0 such that for all ε_ω∈(0,ε̂_ω),\n every solution 𝐳(t) of the P-PDZO dynamics (<ref>) with 𝐳(0)∈𝐂_2∩ ( (𝒲^*_2+Δ𝔹)×𝕋^n) is complete and satisfies:\n\n\n    (Practical Stability):  lim sup_t→∞  ||𝐲(t)||_𝒴^*≤ν,    \n       (Practical Safety):  𝐲(t)∈𝒴, 𝐱̂(t)∈𝒳+ε_a𝔹, ∀ t≥ 0,\n\nwhere 𝒲_2^*:={(𝐲,_1,_2)∈^2(n+m):𝐲∈𝒴^*, _1=∇ f(𝐱) +   ∇(𝐱)^⊤, _2 = ()}.\n \n\n\n\n\n\n\n\n\n\n\nThe assumption of a compact saddle point set ^* in Theorem <ref> is  commonly made in order to use the analysis tools of averaging theory and singular perturbation theory.  For many practical applications,\n\nthe feasible set\n   describes physical capacity limits or control saturation bounds, and thus is naturally compact. \n In addition, we can \n  replace the feasible region _+^m of the dual state  by the feasible box set  [0,M_λ]^m with a sufficiently large M_λ such that the saddle point set of practical interest is compact. \n\n\n\n\n\nAs discussed in Section II-B, the vanilla ES algorithm (<ref>) emulates the behavior of an 𝒪(ε_a)-perturbed gradient flow. Similarly, the P-GZO dynamics (<ref>) emulate the behavior of an 𝒪(ε_a)-perturbed projected gradient flow, and the P-PDZO dynamics (<ref>) emulate the behavior of an 𝒪(ε_a)-perturbed projected saddle flow. While model-based algorithms of this form have been extensively studied in the literature, continuous-time zeroth-order implementations of these dynamics with stability and safety guarantees were mostly unexplored. Since in many cases the stability properties of (27) (see items (a)-(c) of Theorem 5) are established via the Krasovskii-LaSalle invariance principle, the result of Theorem 4 allows us to establish stability properties for the model-free algorithm with similar generality as their model-based counterparts.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ MODEL-FREE FEEDBACK OPTIMIZATION WITH DISCONTINUOUS PROJECTIONS\n \n\n\nIn  Section <ref> above, all the ZO algorithms employed the Euclidean projection onto  the feasible set 𝒳, which leads to ordinary differential equations (ODEs) with Lipschitz continuous vector fields on the right-hand side. This continuity property facilitates the well-posedness and stability analysis of the ZO dynamics, since the existence and uniqueness of solutions are guaranteed by standard results for ODEs <cit.>. In this section, we turn to the study of another class of projected ZO dynamics that enforce the hard constraints (<ref>) via discontinuous projection maps. This type of projection has been extensively studied in the field of (discontinuous) model-based projected dynamical systems\n   <cit.>. \n \n To simplify our presentation, we focus on the reduced problem (<ref>), which does not include the inequality constraints (<ref>). As shown in Section <ref>, such inequality constraints can be handled via primal-dual dynamics or additional penalty terms in the objective f; see  <cit.> for details.  \n \n\n\n\n\n §.§ GZO Dynamics with Discontinuous Projection\n\n\n\nTo solve the reduced problem (<ref>), we consider the following ZO dynamics: \n\n\n\n    𝐱̇   =k_x𝒫_T_𝒳(𝐱)(- ), \n       =1/ε_ξ(-+2/ε_af(𝐱̂) ),\n       =1/ε_ωΛ_κ,\n\n\n\nwhich are restricted to evolve in the flow set 𝐂_1 defined in (<ref>). In (<ref>), the mapping 𝒫_T_𝒳(𝐱)(·)  projects the vector - onto the tangent cone of the feasible set 𝒳 at point , i.e., T_𝒳(𝐱). As a result, the right-hand side of (<ref>) is in general discontinuous, but it  guarantees that  stays within the feasible set. Figure <ref> shows a block diagram of the dynamics (<ref>). In conjunction with the flow set (<ref>), we term the dynamics (<ref>) as discontinuous projected  gradient-based  zeroth-order (DP-GZO) dynamics. We study its stability and regularity properties using tools from differential inclusions and the notion of Krasovskii regularization <cit.>:\n\n\n\n\nConsider the ODE 𝐳̇=(𝐳), where 𝐳∈𝐂⊂ℝ^n\n and :ℝ^n→ℝ^n is locally bounded. The Krasovskii regularization of this ODE is the differential inclusion\n\n\n    𝐳∈𝐂,  𝐳̇∈ K(𝐳):= ⋂_ϵ>0con ((𝐳+ϵ𝔹)∩𝐂),\n\n\nwhere for a set , con() denotes its convex hull  and  denotes its closure. \n\n\n\n\n\n\n\nThe existence of solutions for the Krasovskii regularization of (<ref>) is guaranteed by   well-posedness of (<ref>) and standard viability results <cit.>. Moreover, it can be shown that system (<ref>) accurately captures the limiting behavior of (<ref>) under arbitrarily small additive perturbations on the states and dynamics via the so-called Hermes solutions <cit.>. This suggests that (<ref>) provides a useful characterization of the solutions of the ODE =() under small perturbations, a setting that naturally emerges in the context of ZO dynamics. \n\n\nThe solutions of (<ref>) are also solutions of its Krasovskii regularization, but the converse is not always true. However, under mild regularity assumptions on (<ref>), it turns out that every solution of its Krasovskii regularization is also a standard (i.e., Caratheodory) solution of (<ref>) <cit.>. This fact allows us to study the behaviors of the DP-GZO dynamics (<ref>) based on its nominal target system:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    𝐩̇= k_x·𝒫_T_𝒳(𝐩)(-∇ f(𝐩)).\n\n\nThe following theorem establishes the stability and (practical) safety properties for the DP-GZO dynamics (<ref>). The proof of Theorem <ref> is provided in Section <ref>.\n\n\n\n    \n\nSuppose that Assumptions <ref>-<ref> hold and that f is strictly convex. Then, for any Δ>ν>0, there exists ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ), there exists ε̂_a>0 such that for all ε_a∈(0,ε̂_a), there exists ε̂_ω>0 such that for all ε_ω∈(0,ε̂_ω),\n every solution 𝐳(t) of the DP-ZO dynamics (<ref>)  with  𝐳(0)∈𝐂_1∩(𝒲_1^*+Δ𝔹)×𝕋^n)  is complete and satisfies the Practical Convergence property (<ref>) and the Practical Safety property (<ref>).  \n\n\n\n\nAlthough the results of Theorem <ref> for the DP-GZO dynamics (<ref>) are similar to Theorem <ref> for the P-GZO dynamics (<ref>), their analyses and proof ideas are different, as the DP-ZO dynamics are discontinuous; see  Section <ref>.\n\n\n\n\n\n\n\n\n\n\n\nWith sufficiently small parameters ε_a,ε_ξ,ε_ω, the 𝐱-trajectories of the DP-GZO dynamics (<ref>) emulate the trajectories of (<ref>). \nSince any closed and convex set 𝒳⊂ℝ^n is  Clarke regular <cit.> and prox-regular <cit.>, and since f is locally Lipschitz under Assumption <ref>, the solutions of (<ref>) and its Krasovskii regularization coincide and are unique <cit.>. Nevertheless, since the uniqueness of solutions is not required in our analysis, the convexity of 𝒳 and the strict convexity of f can be relaxed to mere Clarke regularity and the assumption that all first-order critical points of (<ref>) are optimal and also equilibria of (<ref>). \n\n\n\n\n\n \n\n \nTo illustrate the behavior of system (<ref>), we consider a simple example of problem (<ref>), where the feasible set := [-1,1]× [-1,1] is a box constraint and the objective function f is the same as the one in Example <ref>, but now with θ̇_1=-ε_pθ_2 and θ̇_2=ε_pθ_1, ε_p=1× 10^-3. As shown in  Figure <ref>, this exosystem makes the\n the minimizer of f in ℝ^n  (i.e., min_ f()) a slowly varying signal that forms a circular trajectory, shown in blue color. It can be observed that the trajectory  t↦𝐱(t), shown in green, generated by the DP-GZO dynamics (<ref>) tends to closely track the blue minimizer trajectory, but it stays in the feasible set at all times due to the projection map. Similar to Example <ref>, we have replaced  with a shrunk set _ε_a:= [-1+ε_a,1-ε_a]× [-1+ε_a,1-ε_a] in  (<ref>) to ensure the actual input ∈ all the time. Here, ε_a=1× 10^-2, so the difference between _ε_a and 𝒳 is almost indistinguishable. The right plot   shows the trajectory of each of the components of .  \n \n\n \n\n \n\n\n\n\n\n\n\n\n\n §.§ Structural Robustness\n\n\nThe ZO  algorithms proposed in this paper rely heavily on function evaluations (or system output measurements) to steer the decision variable 𝐱̂ to an optimal solution of problem (<ref>) or (<ref>).\nHence, suitable robustness properties are necessary  to handle small disturbances and noises that are inevitable in practice. The following result, i.e., Corollary <ref>, \n indicates that, under the corresponding assumptions of Theorems <ref>-<ref>, all the proposed ZO algorithms (<ref>), (<ref>), (<ref>)    are structurally   robust   to small bounded additive perturbations  on the states and dynamics.\n We rewrite these ZO dynamics as 𝐳∈𝐂, 𝐳̇=(𝐳 ), and consider their perturbed dynamics    (<ref>):\n \n    𝐳+𝐞∈𝐂,   𝐳̇=(𝐳+𝐞)+𝐞,\n\n where  is the state of the ZO dynamics, (·) denotes the  vector field describing the right-hand side of the dynamics,   is the additive noise, and 𝐂 denotes the flow set.\n\n\n\n \n    Under the assumptions and parameters of Theorems <ref>-<ref>, there exists e̅>0 such that for any  additive   noise 𝐞(t):[0,+∞)→^n with sup_t≥ 0 ||𝐞(t)||≤e̅, the trajectory (t) of the perturbed ZO dynamics (<ref>) satisfies the respective practical convergence bounds in Theorems <ref>-<ref>. \n\n\n\n\n\n\n\n\n\n\n\nThe result is a corollary of Theorems <ref>-<ref> because the convergence,  well-posedness, and stability properties of the dynamics imply that, for each sufficiently large compact set of initial conditions K, and fixed parameters of the controller that induce the convergence bounds (which are actually uniform, see Section <ref>), there exists a compact set that is locally asymptotically stable under the nominal dynamics (the so-called Omega-limit set of K), and also semi-globally practical asymptotically stable as e̅→0^+ for the perturbed system (<ref>) <cit.>. However, we note that Corollary <ref> only shows the existence of a sufficiently small e̅, such that any additive noise bounded by e̅ does not change drastically the convergence properties of the ZO algorithms. However, in practice, the computation of this robustness bound is important, but difficult and application-dependent. \n\n\n\n\n\n\n\n §.§ Non-Sinusoidal Dither Signals\n\n\nThe ZO algorithms above use   sinusoidal dither signals t↦(t), generated by the linear dynamic oscillator (<ref>), as the perturbation to estimate the gradients, while other types of dither signals can also be employed <cit.>.  \n\n\nHowever, as discussed in <cit.>, these are not the only types of signals that can be used for the purpose of gradient and Hessian estimation via averaging theory. In particular, we could also consider any vector of piece-wise continuous T-periodic\n\n\n\n\n\n\nprobing signals t↦𝐝(μ(t)) that satisfies max_t∈[0,T]𝐝(t) = 1 and\n\n\n    ∫_0^T𝐝(μ(t)) dt = 0;   1/T∫_0^T𝐝(μ(t))𝐝(μ(t))^⊤ dt =1/η_d I_n\n\n\nfor some known η_d>0. Common choices of the  probing signals include sinusoidal, triangular waves, and square waves defined in the scalar case as \n\n \n    𝐝_sq(μ(t))\n         1,     t∈ [2kπ, (2k+1)π]\n    \n         -1,     t∈ [(2k+1)π, 2(k+1)π]\n         ,  k∈ℤ.\n\n\nNote that (<ref>) holds with η_d = 2 for sinusoidal dithers,  while η_d = 1 for square-wave signals d_sq. Similarly, for the square signals we also require κ_i ≠ (2k+1)κ_j for all k∈ℤ and i≠ j to meet the above. As discussed in <cit.>, a variety of these signals can be generated by autonomous (sometimes hybrid) dynamical systems. Indeed, when t↦𝐝(μ(t)) is not periodic or continuous, but still generates a well-defined average map, generalized averaging theorems can be used to establish stability results without changing the stability analysis. The averaging techniques used in this paper can be applied to these and other non-smooth dither signals by making use of hybrid boundary layer dynamics, see <cit.>.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ANALYSIS AND PROOFS\n\n\n\nIn this section, we present the proofs of our main results. Since the result of Theorem <ref> can be seen as a particular case of Theorem <ref> when the set of inequality constraints (<ref>) is empty, we first  present the proof of Theorem <ref>. Subsequently, we show how to adapt this proof to Theorem <ref>. The proofs of Theorems <ref>, <ref>, <ref> are based on the construction of suitable Lyapunov functions, and therefore are presented afterwards.\n\n\n\n\n\n\n §.§ Proof of Theorem <ref>\n\n\n\nLet :=[;], :=[_1;_2], and :=[;]. \nThe P-PDZO dynamics (<ref>)-(<ref>) can be written in compact form as\n\n\n    =    [ ;  ] = [            𝐪_1(,); 1/ε_ξ(- + 𝐪_2(,)) ]:= 𝐪(,),\n\n\nwhere 𝐪_1 captures the dynamics (<ref>) and _2 is given by\n\n\n    _2(𝐲,):=[ 2/ε_a(f()+^⊤() );               () ],\n\n\nwhere  is generated by the oscillator (<ref>), and 𝐱̂, are defined in (<ref>) and (<ref>). We analyze the stability properties of this system using multi-time scale techniques based on averaging theory and singular perturbation theory. We divide the analysis into the following three main steps.\n\n\n\nStep 1) Behavior of system (<ref>) restricted to compact sets: Let Δ>0 and :=𝒳×ℝ^m_+. Consider the compact set [(^*+Δ𝔹)∩]×Δ for the initial condition (0) and any desired Δ>0\n. Here, \n ^*+Δ𝔹 denotes \n the union of all sets obtained by taking a closed ball of radius Δ around each point in the saddle point set ^*. \n\nBy items (a)-(c) in Theorem <ref>, the compact set 𝒴^* is uniformly globally asymptotically stable\n(UGAS) for the model-based dynamics (<ref>) restricted to evolve in , which is also a forward invariant set. Thus, there exists a class-𝒦ℒ function β such that for any initial condition 𝐩(0)∈, the solutions 𝐩 of   (<ref>) satisfy ||𝐩(t)||_^*≤β(||𝐩(0)||_^*,   t) for all t≥0. Without loss of generality, let ν∈(0,1) and consider the set\n\n\n    :={∈:   ||𝐲||_^*≤β( max_∈^*+Δ𝔹 ||||_^*,  0 )+1  }.\n\n\nNote that the set  is compact under the assumption that ^* is compact.\nDue to the boundedness of , there exists a positive constant M_1 such that ⊂ M_1. Let \n\n\n    ℓ():=[ ∇ f() + ∑_j=1^m λ_j ∇ g_j();                          () ],\n\n\nand note that, by continuity of ℓ, there exists a positive constant M_2>max{Δ,1} such that ||ℓ()|| +1≤ M_2 for all ||||≤ M_1. Denote M_3= M_2+1.\n We then study the behavior of system (<ref>) restricted to evolve in the compact set × M_3.  \n\n\n\n\n\nStep 2) Stability properties of the average dynamics of system (<ref>): Since the solutions of the oscillator (<ref>) are given by (<ref>), and μ_i(0)^2+μ_i+1(0)^2=1 for all i∈{1,3,…,2n-1},  system (<ref>) with small values of ε_ω  is in standard form  for the application of averaging theory along the trajectories of .  The following Lemma <ref> characterizes the average map of 𝐪_2. The proof is presented in Appendix <ref>.\n\n\nThe average of t↦_2(,(t)) is given by\n\n\n    _2():=   1/T∫_0^T _2(𝐲,(t))  dt\n        = ℓ() +(ε_a),\n\n\nwhere T is the   common  period of . \n\n\n\nUsing Lemma <ref>,\nwe obtain the average dynamics of (<ref>):\n\n\n    = [ ;  ]=[                  𝐪_1(,); 1/ε_ξ(- + ℓ() +(ε_a)  ) ],\n\n\nwhere :=[;]. We study (<ref>)  restricted to evolve in the compact set × M_3. \nWe treat the right-hand side of (<ref>) as an (ε_a)-perturbation of a nominal system with ε_a=0. This nominal system (i.e., (<ref>) with ε_a=0) is in the standard form for the application of singular perturbation theory <cit.>, with  being the slow state, and  being the fast state. The boundary layer dynamics of this nominal system, in the time scale τ=t/ε_ξ, are \n\n    d /d τ = -  +ℓ(),\n \nwhere  is kept constant. This linear system (<ref>) has a unique exponentially stable equilibrium point ^*=ℓ(). As a result, the associated reduced system  is derived as \n\n\n    = _1(, ℓ()),\n\n\nwhich is exactly the nominal target system (<ref>). Under the assumptions of Theorem <ref>, system (<ref>) renders the set ^* UGAS. By using singular perturbation theory <cit.>, we can conclude that, as ε_ξ→ 0^+, the set ^*×M_3𝔹 is semi-globally practically asymptotically stable (SGPAS) for the unperturbed average system (<ref>) with ε_a=0. Since system (<ref>) has a continuous right-hand side , the perturbed average system  (<ref>) also renders the set ^*×M_3𝔹 SGPAS as (ε_ξ,ε_a)→ 0^+, which is stated as Lemma <ref>.\n\n\n\n\n \nThere exists β∈𝒦ℒ such that for each ν>0,\nthere exists ε̂_ξ>0 such that for any ε_ξ∈(0,ε̂_ξ), there exists ε̂_a>0 such that for any ε_a∈ (0,ε̂_a), \nevery solution  of the average system (<ref>) (restricted in × M_3) with initial condition (0)∈ [(^*+Δ𝔹)∩]×Δ satisfies \n\n    ||(t)||_^*≤β(||(0)||_^*,   t) +ν/4,\n\n\nfor all t∈dom(). \n\n\n\n\nSince the average system (<ref>) is restricted in × M_3, we have ||(t)||_M_3 = 0 for all t∈dom(), which implies that ||(t)||_^*× M_3 =  ||(t)||_^* for all t∈dom(). Hence, it follows that for all t∈dom():\n\n\n    ||(t)||_^*× M_3≤β(||(0)||_^*× M_3,  t) +ν/4.\n\n\nNext, we show the completeness of solutions of the average  system (<ref>) by leveraging Lemma <ref>, which follows as a special case of <cit.>.\n\n \nLet k,M_2>0 be given and 𝐮:_+ → M_2 be a continuous function of time. Then, the set M_2 is forward invariant under the dynamics = k·(- +𝐮(t)). \n\n\n\n\nUnder the initial condition (0)∈ [(^*+Δ𝔹)∩]×Δ, by (<ref>), the trajectory 𝐲̅ of (<ref>) satisfies 𝐲̅(t)∈int() for all t∈dom(). This implies that  ||𝐲̅(t)||≤ M_1 and thus ||ℓ(𝐲̅(t)) +(ϵ_a))||< M_2 for all t∈dom(), where we take ||(ϵ_a)||<1 for all ε_a∈ (0,ε̂_a) without loss of generality. Using Lemma <ref>, (t) ∈ M_2⊂int(M_3) for all t≥ 0. Thus, under the given initialization,  satisfies \n\n\n    (t)∈int(× M_3),   ∀ t≥ t_0,\n\n\nand thus it has an unbounded time domain. The following lemma proved in Appendix <ref> will be useful for our results.\n\n\n\n\n\nThere exists ε̂_ξ>0 such that for any ε_ξ∈(0,ε̂_ξ), there exists ε̂_a>0 such that for any ε_a∈ (0,ε̂_a),  there exists a compact set[See <cit.> for the  notion of “Omega-limit set of a set\".] Ω(× M_3) that is uniformly globally (pre)-asymptotically stable for the average system (<ref>) restricted to × M_3. \n\n\n\nStep 3) Link the stability property of the average dynamics (<ref>) to the stability property of the original system (<ref>): Since  the set ^*× M_3 is SGPAS for the average system (<ref>) (restricted in × M_3) as (ε_ξ,ε_a)→ 0^+, by averaging theory for perturbed systems <cit.>, it follows that for each pair of (ε_ξ,ε_a) inducing the bound (<ref>), there exists ε̂_ω>0 such that for any ε_ω∈(0,ε̂_ω), the solution  of the original system (<ref>) (restricted to × M_3) satisfies \n\n\n    ||(t)||_^*× M_3≤β(||(0)||_^*× M_3,  t) +ν,\n\n\nfor all t∈dom(). Since  ||(t)||_^*= ||(t)||_^*× M_3 for all t∈dom(), we obtain the bound  (<ref>).  The only task left is to show the completeness of solutions of the original  system (<ref>). This can be done by using the following lemma, corresponding to <cit.>.\n\n\n\n\n\n\n\nLet (ε_ξ,ε_a)>0 take sufficiently small values such that Lemmas <ref> and <ref> hold. Then, for each T,δ>0, there exists ε̂_ω>0 such that for all ε_ω∈ (0,ε̂_ω)  and all solutions  of the original system (<ref>), with 𝐬(0)∈ [(^*+Δ𝔹)∩]×Δ𝔹, there exists a solution 𝐬̅ of the average system (<ref>), with 𝐬̅(0)∈ [(^*+Δ𝔹)∩]×Δ𝔹 such that 𝐬 and 𝐬̅ are (τ,ε) close. \n\n\n\n\n\n\n\n\n\n\n\n\nBy Lemma <ref>, there exists a 𝒦ℒ-class function β̃ such that every solution of the average system (<ref>) satisfies \n\n\n    ||(t)||_Ω( × M_3 )≤β̃( ||(0)||_Ω( × M_3 ),t),\n\n\nfor all t∈dom(). Moreover, by (<ref>), the trajectories  are complete if (0)∈ [(^*+Δ𝔹)∩]×Δ. Using this bound, the closeness of solutions property of Lemma <ref>, and stability results in averaging theory <cit.>, there exists ε̂_ω such that for all ε_ω∈(0,ε̂_ω), every solution of the original system (<ref>) with (0)∈ [(^*+Δ𝔹)∩]×Δ, satisfies \n \n \n    ||(t)||_Ω( × M_3 )≤β̃(||(0)||_Ω( × M_3 ),t)+ν/2,\n\n\nfor all t∈dom(𝐬). This implies that (t) ∈int(× M_3) for all t≥0.  Therefore, every solution  of the original system (<ref>), under the given initialization, has an unbounded time domain. Thus Theorem <ref> is proved. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Proof of Theorem <ref>\n \n\nThe proof of Theorem <ref> follows the same steps as the proof of Theorem <ref>. In this case, 𝐪_2:=2/ε_af(𝐱̂), and the function ℓ(·) in (<ref>) becomes ℓ(𝐱)=∇ f(𝐱). Therefore, system (<ref>) is precisely the Lipschitz continuous projected gradient flow (<ref>). Under the conditions (a) and (b) in Theorem <ref>, there exists a class 𝒦ℒ function β such that Lemma 6 holds. The rest proof follows the same steps as the proof of Theorem <ref>.\n\n\n\n\n\n\n §.§ Proof of Theorem <ref>\n \n\n Following similar computations to those in Lemma <ref>, we \ncompute the average dynamics of (<ref>) along the trajectories of  and \nobtain:\n\n\n\n    𝐱̇̅̇   =k_x 𝒫_𝒳(𝐱̅-α_x )-k_x𝐱̅,\n       =1/ε_ξ(-+∇_ f(𝐱̅,)+𝒪(ε_a)), \n       =ε_θΠ(),\n\n\n\nwhich is restricted to evolve in the set 𝐂_3:=𝒳×ℝ^n×Θ. Next, we establish a key lemma for the average system (<ref>).\n\n\n\n\n\n\nFor system (<ref>) with ε_a=0 and ε_θ>0, there exist α̂_x, k̂_x,ε̂_ξ>0, such that for all α_x∈(0,α̂_x), all k_x∈(0,k̂_x) and all ε_ξ∈(0,ε̂_ξ), every solution satisfies\n\n\n    ||(t)-^*((t))||≤ c_1||(0)   -^*((0))||e^-c_2 t\n            +csup_0≤τ≤ t||(τ)||,\n\n\nwhere 𝐬̅:=(𝐱̅,),  𝐬^*():=(𝐱^*(),∇_ f(𝐱^*(),)), and c_1,c_2,c>0. \n\n\n\nProof: We introduce the error variables 𝐱̃:=𝐱̅-𝐱^*() and :=-∇_f(𝐱̃+𝐱^*,), which leads to the error dynamics\n\n\n\n    𝐱̇̃̇   =k_x𝒫_𝒳(𝐱̃+𝐱^*-α_x(+∇_ f(𝐱̃+𝐱^*,)))\n          -k_x (𝐱̃+𝐱^*)-𝐱̇^*, \n       =-1/ε_ξ-d/dt∇_ f(𝐱̃+𝐱^*,).\n \n\n\nWe study the stability properties of (<ref>) with respect to the origin. To this end, we consider the Lyapunov function: \n\n\n    W(𝐱̃,)=(1-λ)V_x(𝐱̃)+λ V_ξ(),\n\n\nwhere λ∈(0,1),  V_x(𝐱̃)=1/2||𝐱̃|||^2 and V_ξ()=1/2||||^2. The function (<ref>)\nis radially unbounded and positive definite, and it satisfies Ẇ\n=(1-λ)𝐱̃^⊤𝐱̇̃̇+λ^⊤. Let (,𝐱̃):=∇_ f(𝐱̃+𝐱^*,) and thus =  + (,𝐱̃). We rewrite the 𝐱̃-error dynamics (<ref>) compactly as \n\n    𝐱̇̃̇= _x(𝐱̃,+(,𝐱̃))-𝐱̇^*.\n\nIt follows that\n\n\n    𝐱̃^⊤𝐱̇̃̇=𝐱̃^⊤ (_x(𝐱̃,+(,𝐱̃))-𝐱̇^*) \n    \n    \n    =   𝐱̃^⊤ (_x(𝐱̃,+(,𝐱̃))-_x(𝐱̃,(,𝐱̃))) \n          +𝐱̃^⊤( _x(𝐱̃,(,𝐱̃))-𝐱̇^*)\n    ≤   ||𝐱̃||·||𝐱̇^*||+||𝐱̃||·||_x(𝐱̃,+(,𝐱̃))-_x(𝐱̃,(,𝐱̃))|| \n          +𝐱̃^⊤_x(𝐱̃,(,𝐱̃)) \n    ≤    ||𝐱̃||·||𝐱̇^*||+k_xα_x||𝐱̃||·||||+𝐱̃^⊤_x(𝐱̃,(,𝐱̃)),\n\n\nwhere we use the fact that 𝒫_𝒳(·) is Lipschitz continuous with unitary Lipschitz constant <cit.>, such that:\n\n\n    ||_x(𝐱̃,)-_x(𝐱̃,(,𝐱̃))|| \n    ≤     k_xα_x||-h(,𝐱)||=k_xα_x||||.\n \n\nUsing the uniform strong convexity and Lipschitz properties of Assumption <ref> and the same steps of the proof of <cit.>, we obtain \n\n\n    ^⊤_x(𝐱̃,(,𝐱̃))≤ -k̃_x||||^2,\n\n\nwhere k̃_x=α_x(γ-α_xℓ^2/4). Thus, for all α_x∈(0, α̂_x) with α̂_x=4γ/ℓ^2 such that k̃_x is positive, we obtain\n\n\n    𝐱̃^⊤𝐱̇̃̇≤ -k̃_x||𝐱̃||^2+k_xα_x||𝐱̃||·||||+m||||·||||,\n\n\nwhere m:=max_∈Θ||∇()|| and (·) is defined in (<ref>). Note that m<∞ because Θ is compact and  is continuously differentiable by Assumption <ref>. From (<ref>), we have \n\n\n    ^⊤=-1/ε_ξ||||^2-^⊤d/dt∇_ f(𝐱̃+𝐱^*,),\n\n\nand note that\n\n\n    d/dt∇_f(𝐱̃+𝐱^*,)   =H_f(,𝐱̃+𝐱^*)(𝐱̇̃̇+𝐱̇^*)\n       +∂/∂∇_ f(𝐱̃+𝐱^*,),\n\n\nwhere H_f(·,·) is the Hessian matrix of f. By (<ref>) in Assumption <ref>, we have that ||H_f(,𝐱)||≤ℓ for all 𝐱∈ℝ^n and all ∈Θ, and since 𝐱̇̃̇+𝐱̇^*=_x(𝐱̃,+(,𝐱̃)) by (<ref>), we obtain\n\n\n    ||H_f(,𝐱̃+𝐱^*)(𝐱̇̃̇+𝐱̇^*)|| \n    ≤   ℓ ||_x(𝐱̃,)-_x(𝐱̃,(,𝐱̃))+_x(𝐱̃,(,𝐱̃))||\n    ≤   ℓ k_xα_x||||+ℓ||_x(𝐱̃,(,𝐱̃))||\n    ≤ℓ k_xα_x||||+cℓ||||,\n\n\nwhere c:=k_x(2+α_xℓ). The second inequality above is due to  (<ref>). The last inequality is because _x(0,(,0))=0  and\n\n    1/k_x·|| _x(𝐱̃,(,𝐱̃))-_x(0,(,0))|| \n    ≤   ||𝐱̃||+||𝒫_𝒳(𝐱̅-α_x ∇_ f(𝐱̅,))-𝒫_𝒳(𝐱^*-α_x ∇_ f(𝐱^*,))| \n    ≤    ||𝐱̃||+||𝐱̃||+α_x||∇_ f(𝐱̅,)-∇_ f(𝐱^*,)||\n    ≤    2||𝐱̃||+α_x ℓ||𝐱̃|| =  c ||||.\n\n\n\nCombining the above inequalities and using (<ref>), we obtain\n\n\n    ^⊤≤ -(1/ε_ξ-ℓ k_xα_x)||||^2+cℓ||𝐱̃|| ||||+M|||| ||||.\n\n\nUsing (<ref>) and (<ref>):\n\n\n    Ẇ   ≤ (1-λ)k_xα_x||𝐱̃|| |||+m(1-λ)|||| ||||+Mλ|||| ||||\n       -k̃_x(1-λ)||𝐱̃||^2-λ(1/ε_ξ-ℓ k_xα_x)||||^2+cℓλ||𝐱̃|| ||||\n       =-𝐲̃^⊤ Q 𝐲̃+c̅||𝐲̃|| ||||,\n\n\nwhere 𝐲̃=(||𝐱̃||,||||) and Q is given by the 2×2 matrix\n\n\n    Q=[[           k̃_x(1-λ)m 1/2(1-λ)k_xα_x+cℓλ/2; 1/2(1-λ)k_xα_x+cℓλ/2    (1/ε_ξ-ℓ k_xα_x)λ ]],\n\n\nand c̅=max{m(1-λ),Mλ}. This matrix is positive definite whenever\n\n\n    λ(1-λ)k̃_x m(1/ε_ξ-ℓ k_xα_x)>1/4[(1-λ)k_xα_x+λ cℓ]^2,\n\n\nwhich is equivalent to\n\n\n    1/ε_ξ>0.25 [(1-λ)k_xα_x+λ cℓ]^2/λ(1-λ)k̃_x m+ℓ k_xα_x.\n\n\nThis guarantees the existence of ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ), the matrix Q is positive definite, and therefore W in (<ref>) is a smooth input-to-state stability (ISS) Lyapunov function for the error dynamics (<ref>) with respect to the input . This establishes the bound of Lemma <ref>. Since ||||=ε_ ||Π()||≤ε_σ, where σ=max_∈Θ||Π()||, the result also implies  uniform ultimate boundedness (UUB) with ultimate bound proportional to ε_0.  ▪\n\n\nSince Lemma <ref> directly establishes ISS for the nominal error averaged dynamics of (<ref>) with ε_a=0, evolving in 𝐂_3, the perturbed error average system (<ref>) renders the origin semi-globally practically ISS as ε_a→0^+. We can now directly link the stability properties of the average dynamics (<ref>) and the original dynamics (<ref>) via standard averaging results for ISS systems <cit.>. The practical safety property follows directly by Lemma <ref> since the dynamics (<ref>) are independent of  (see the proof of Lemma <ref>).  \n\n\n\n\n\n §.§ Proof of Theorem <ref>\n\n\nFor each constant q, the average dynamics of the P-GZO dynamics (<ref>) are obtained as:\n\n\n\n    𝐱̇̅̇   =k_x 𝒫_𝒳(𝐱̅-α_x )-k_x𝐱̅,\n       =1/ε_ξ(-+∇ f_q(𝐱̅)+𝒪(ε_a)).\n\n\n\nThe following lemma is the main technical result needed to prove Theorem <ref>. Denote :=(,) and 𝒲_1^*:={(𝐱,)∈ℝ^2n:𝐱∈𝒳^*, =∇ f(𝐱)}\n\n\nConsider the system  (<ref>) with ε_a=0. Then, there exist a function V_q and k_x,ε̂_ξ,c_1,c_2>0 such that for all ε_ξ∈(0,ε̂_ξ), we have\n\n\n\n    c_1||||^2_𝒲_1^*≤ V_q()≤ c_2||||^2_𝒲_1^*\n       ⟨∇ V_q(), ⟩≤ -λ_q V_q(),\n\n\n\nfor all ∈𝒳×ℝ^n and all q∈ Q. \n\nProof: For each mode q∈ Q, we consider the Lyapunov function V_q()=1/2||-^*||^2+1/2||-∇ f_q()||^2. Since\n\n||||^2_𝒲_1^*=||-^*||^2+||-∇ f_q(^*)||^2  \n\nand  ∇ f_q(^*)=^*,\n\n\n    ||-∇ f_q()|| = ||-∇ f_q(^*)+∇ f_q(^*)-∇ f_q() ||\n    ≤    ||-^*||+ℓ_q ||-^*||,\n\n\nwhere we use the Lipschitz property of ∇ f_q. Hence, there exists c̅_q>0 such that V_q()≤c̅_q||||^2_𝒲_1^* for all ∈𝒳×ℝ^n. Similarly,\n\n\n    ||-∇ f_q(^*) ||   ≤ ||-∇ f_q()||+||∇ f_q()-∇ f_q(^*)||\n       ≤ ||-∇ f_q()||+ℓ_q||-^*||.\n\n\nTherefore,\n\n\n    ||-∇ f_q(^*)||^2   ≤(||-∇ f_q()||+ℓ_q||-^*||)^2\n       ≤ 2||-∇ f_q()||^2+2ℓ_q^2||\n    -^*||^2.\n\n\nAdding ||-^*||^2 to both sides and dividing by 2d_q=max{2,2ℓ_q^2+1} leads to\n\n\n    1/2d_q||||^2_𝒲_1^*≤ V_q(),  ∀ ∈𝒳×ℝ^n.\n\n\nIt follows that c_2=max_q∈ Qc̅_q, and c_1=1/2max_q∈ Qd_q. Next, note that\n\n\n    V̇_q=(-^*)^⊤-(-∇ f_q())^⊤ H_f_q()+(-∇ f_q())^⊤.\n\n\nThe first term of V̇_q satisfies\n\n    (-^*)^⊤=(-^*)^⊤ (- _r + _r)\n    ≤    (-^*)^⊤_r+||-^*|| ||-_r||\n    ≤    -k̃_x||-^*||^2+k_xα_x||-^*|| ||-∇ f_q()||,\n\n\nwhere _r denotes the right-hand side of (<ref>) with =∇ f_q() and   we used <cit.> and (<ref>) to obtain the last inequality. Next, using (<ref>), the second term of V̇_q can be bounded as\n\n\n    -(-∇ f_q())^⊤ H_f_q()   ≤ℓ k_xα_x||-∇ f_q()||^2\n         +cℓ||-∇ f_q()|| ||-^*||.\n\n\nThe last term of V̇_q satisfies \n\n    (-∇ f_q())^⊤=-1/ε_ξ||-∇ f_q()||^2.\n\nTherefore, V̇_q satisfies the same upper bound of (<ref>) with =0,  and there exists ε̂_ξ>0 such that for all ε_ξ∈(0,ε̂_ξ) the matrix Q is positive definite and \n\n\n    V̇_q≤ -k V_q(),   ∀∈𝒳×ℝ^n.\n\n\nThis establishes the result of  Lemma <ref>. ▪\n\nThe result of Lemma <ref>, in conjunction with <cit.>, guarantees the existence of a τ_d sufficiently large such that, the hybrid dynamical system with flows \n\n\n\n    𝐱̇̅̇   =k_x 𝒫_𝒳(𝐱̅-α_x )-k_x𝐱̅,\n       =1/ε_ξ(-+∇ f_q̅(𝐱̅))\n    q̇̅̇   =0\n    τ̇̅̇   ∈[0,1/τ_d]\n\n\n\nevolving on the flow set C=(𝒳×ℝ^n)× [0,N_0]×𝒬, and jumps\n\n\n    𝐱̅^+=𝐱,  ξ̅^+=ξ̅,  q̅^+∈ Q,  τ̅^+=τ̅-1.\n\n\nevolving on the jump set D=(𝒳×ℝ^n)× [1,N_0]×𝒬, renders the set {z^*}×[0,N_0]×𝒬 UGAS. In turn, by robustness properties of well-posed hybrid systems, the 𝒪(ε_a)-perturbation of this nominal average system renders the same set SGPAS as ε_a→0^+ <cit.>. Then the result of Theorem <ref> follows  directly by an application of averaging theory for perturbed hybrid systems <cit.>.  \n\n\n\n\n §.§ Proof of Theorem <ref>\n \n\nSince the DP-GZO dynamics (<ref>) is a discontinuous ODE, we consider its  Krasovskii regularization defined in (<ref>), which only affects the right-hand side of 𝐱̇:\n\n\n    𝐱̇∈ K(𝐳),  =1/ε_ξ(-+2/ϵ_af(𝐱̂)),\n\n\nwhere 𝐳:=(𝐱,). Since 𝒳 is closed and convex, and f is continuously differentiable, by <cit.>, every solution of (<ref>) is also a solution of the DP-GZO dynamics (<ref>), and vice versa. Moreover, since the dynamics of 𝐱 are  independent of , system (<ref>) is in standard form for the application of averaging theory <cit.>. In particular, similar to Lemma <ref>, we compute the average dynamics of (<ref>) along t→(t) and obtain\n\n\n    ∈ K(),  =1/ε_ξ(-+∇ f(𝐱̅)+𝒪(ε_a)).\n\n\nWe will study the stability properties of this perturbed system by analyzing the nominal unperturbed dynamics corresponding to ε_a=0. The following lemma will be key for our results.\n\n\n\nUnder the assumptions of Theorem <ref>, system (<ref>) with ε_a=0 restricted to evolve in the set 𝒳×ℝ^n renders  the point ^*=(𝐱^*,∇ f(𝐱^*)) UGAS. \n\n\n\n\n\nProof: Using the equivalence between Krasovskii and Caratheodory solutions for well-posed projected gradient systems <cit.>, we consider the dynamics\n\n\n    =k_x𝒫_T_𝒳()(-),  =1/ε_ξ(-+∇ f()),\n\n\nand the Lyapunov function with λ∈(0,1)\n\n    V(𝐳̅)=(1-λ)(f(𝐱̅)-f(^*))+λ1/2||-∇ f(𝐱̅)||^2,\n\n which is continuously differentiable, radially unbounded, and positive definite with respect to ×^n.\n \n We proceed to compute the inner product ⟨∇ V, 𝐳̇̅̇⟩, where 𝐳̇̅̇=(𝐱̇̅̇,). To do this, we use the fact that for any regular set 𝒳, and any 𝐱∈𝒳, ν∈ℝ^n, there exists a unique η∈ N_𝒳() such that 𝒫_T_𝒳()(ν)=ν-η, η^⊤ (ν-η)=0, and ν^⊤ (ν-η)=||ν-η||^2, \n <cit.>.\n Thus using ν=-, 𝐯̃(𝐱̅):=ν-η, and (𝐱̅)=-∇ f(𝐱̅) we obtain:\n\n\n    ⟨∇ V, 𝐳̇̅̇⟩\n    \n     =     k_x(1-λ)∇ f(𝐱̅)^⊤(𝐱̅)-k_xλ(𝐱̅)^⊤ H_f(𝐱̅) (𝐱̅) +λ(𝐱̅)^⊤\n    \n    =    k_x(1-λ)∇ f(𝐱̅)^⊤(𝐱̅)-k_xλ(𝐱̅)^⊤ H_f(𝐱̅) (𝐱̅) -λ/ε_ξ ||(𝐱̅)||^2.\n\n\nTo upper-bound the first term, we note that\n\n\n    ∇ f(𝐱̅)^⊤(𝐱̅)\n    =(∇ f(𝐱̅)-)^⊤(𝐱̅)+^⊤(𝐱̅)\n    ≤    ||(𝐱̅)|| ||(𝐱̅)||-ν^⊤ (ν-η)\n    ≤    ||(𝐱̅)|| ||(𝐱̅)||-||ν-η||^2 = ||(𝐱̅)|| ||(𝐱̅)|| -||(𝐱̅)||^2.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMoreover, since ∇ f is ℓ-globally Lipschitz by assumption, the second term of V̇ satisfies \n\n    (-∇ f(𝐱̅))^⊤ H_f(𝐱̅) (𝐱̅) ≤ℓ||(𝐱̅)|| ||(𝐱̅)||.\n Therefore, defining (𝐳̅):=((𝐱̅),(𝐱̅)), we obtain:\n\n\n    ⟨∇ V(𝐳̅), 𝐳̇̅̇⟩≤ - (𝐳̅)^⊤ Q 𝐪̃(𝐳̅),\n\n\nwhere\n\n\n    Q=[[             k_x(1-λ) -1/2(k_xδℓ+k_x(1-λ)); -1/2(k_xλℓ+k_x(1-λ))               λ1/ε_ξ ]].\n\n\nThis matrix is positive definite whenever λ (1-λ) k_x/ε_ξ>1/4[k_xλℓ +k_x(1-λ)]^2, which can be satisfied for sufficiently small values of ε_ξ. Since (𝐳)=0 if and only if 𝐳=(𝐱^*,^*), we obtain that ^* is uniformly globally asymptotically stable (UGAS) for (<ref>). \n▪\n\n\n\n\nBy equivalence between Krasovskii and Caratheodory solutions, the result of Lemma <ref> guarantees UGAS for the Krasovskii regularization of (<ref>), which is precisely (<ref>) with ε_a=0. Since, by construction, this system is well-posed (outer-semi-continuous, locally bounded, and convex-valued), the set ^* is semi-globally practically asymptotically stable for (<ref>) as ε_a→0^+. The stability result of Theorem <ref> follows  directly by the application of averaging results for non-smooth system <cit.>.  ▪\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\n\n\nIn this paper, we introduce a class of continuous-time \nprojected zeroth-order (P-ZO) dynamics methods for solving generic constrained optimization problems with both hard and asymptotical constraints, where\nthe mathematical forms of the objective and constraint functions in these problems are  unknown and only their function evaluations are available. Therefore, the proposed P-ZO methods can be \ninterpreted as model-free feedback controllers that steer a black-box plant towards  optimal steady states described by an optimization problem using only measurement feedback.\nThis paper considers both the continuous and discontinuous projection maps and establishes the stability and robustness results for the proposed P-ZO methods. Moreover, their dynamic tracking performance under the time-varying setting and switching cost functions is analyzed. The focus of this paper is to introduce these  P-ZO methods and to analyze their theoretical performance. Our future work will delve into the practical implementation of these P-ZO methods in different applications in engineering and sciences.\n\n\n \n\n\n\n \n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ AUXILIARY LEMMAS\n\n\n\n\n\n\n\n §.§ Proof of Lemma <ref>\n\n\n\n\nFirst, we have \n(0)∈𝕋^n and   μ_i(0)^2+μ_i+1(0)^2=1 for all i∈{1,3,…,2n-1}. Since\n\n\n    d/dt(μ_i(t)^2+μ_i+1(t)^2)   =2μ_iμ̇_i+2μ_i+1μ̇_i+1\n       =2 (μ_i,μ_i+1)^⊤Λ_i(μ_i,μ_i+1)=0,\n\n\n𝕋^n is forward invariant for (t) under (<ref>). Then, following the ideas of <cit.>, we define Φ(𝐱):=|𝐱-𝒫_𝒳(𝐱)|^2 and have\n\n\n    Φ̇   =2(𝐱-𝒫_𝒳(𝐱))^⊤𝐱̇\n       =2k_x(𝐱-𝒫_𝒳(𝐱))^⊤(𝒫_𝒳(𝐱-α_xξ)-𝐱)\n       =-2k_x(𝐱-𝒫_𝒳(𝐱))^⊤(𝐱- 𝒫_𝒳(𝐱))\n          -2k_x(𝐱-𝒫_𝒳(𝐱))^⊤(𝒫_𝒳(𝐱)-𝒫_𝒳(𝐱-α_x))\n       ≤  -2k_x |𝐱-𝒫_𝒳(𝐱)|^2 = -2k_xΦ(𝐱),\n\n\nfor all 𝐱∈ℝ^n, where the first equality follows by <cit.>, and the inequality in the last step used the property  \n (𝐮-P_𝒳(𝐮))^⊤(P_𝒳(𝐮)-𝐯)≥ 0 for all 𝐮∈ℝ^n and all 𝐯∈𝒳.\n This implies that Φ̇(𝐱(t))≤ -2k_xΦ(𝐱(t))≤ 0, for all t∈dom(𝐳).  We next show that (t)∈ for all t∈dom() given (0)∈ using the  contradiction argument. Suppose that there exists  t_2>t_1 with   t_2,t_1∈dom(𝐳) such that    𝐱(t)∈𝒳 for all t∈[0,t_1] and  𝐱(t)∉𝒳 for all t∈(t_1,t_2]. Then, it follows that Φ(𝐱(t_1))=0 and Φ(𝐱(t_2))>0. But the mean value theorem implies the existence of a   t̅∈(t_1,t_2) such that \n\n\n    Φ̇(t̅)=Φ(t_2)-Φ(t_1)/t_2-t_1>0,\n\n\nwhich is a contradiction. Therefore, we conclude that if 𝐳(0)∈𝐂_1, then 𝐳(t)∈𝐂_1 for all t∈dom(𝐳). Since the input 𝐱̂ is defined via (<ref>) and |μ_i(t)|≤ 1 for all i and t≥0, it follows that 𝐱̂(t)∈𝒳+ε_a𝔹 for all t∈dom(𝐳). \n\n\n\n\n\n §.§ Proof of Lemma <ref>\n \n\n\nFirst, consider the  integration on the first part of _2(y,(t)). By the Taylor expansion of f(·), we have  (∀ i∈[n]) \n\n\n    1/T∫_0^T 2/ε_a   f(+ ε_a (t)) _i(t)  dt \n    \n     =    1/T∫_0^T2/ε_a [f()+ε_a  ∇ f()^⊤(t)\n     +(ε_a^2)] _i(t) dt \n    \n    =    1/T∫_0^T 2∑_j=1^n [∂ f()/∂ x_j_j(t)_i(t)]  dt +(ε_a)\n    \n    =    ∂ f()/∂ x_iη_d/ T∫_0^T _i(t)^2   dt +(ε_a)= ∂ f()/∂ x_i  +(ε_a).\n\n\nSimilarly, we have (∀ j∈[m], i∈[n])\n\n    1/T∫_0^T2/ε_a λ_jg_j(+ε_a (t)) _i(t) dt= λ_j ∂ g_j()/∂ x_i+(ε_a).\n\n\n\nAs for the integration on the second part of _2(y,μ(t)), i.e., ((t)), each component of this integration is (∀ j∈[m])\n\n    1/T∫_0^T g_j(+ ϵ_a(t))   dt \n    \n    =     1/T∫_0^T \n    g_j() + ϵ_a  ∇ g_j()^⊤(t) +(ε_a^2)  dt\n    \n    =     g_j() + (ε_a^2).\n\n\nCombining these two parts, Lemma <ref> is proved.\n\n\n\n\n §.§ Proof of Lemma <ref>\n\n\n\n\nTake ε_a sufficiently small such that (ϵ_a)< 1 in (<ref>). \nFor each ν∈(0,1), there exists a time T_1>0 such that for any t≥ T_1,  β(Δ, t)≤ν/4. Such  T_1 always exists because β is a class-𝒦ℒ function, and thus  |(t)|_^*≤ν/2 for t≥ T_1 by (<ref>). In addition,\nby the exponential input-to-output stability of the fast dynamics in (<ref>), there exists a time T_2>0 such that for any t≥ T_2, every solution of (<ref>) with (0)∈ [(^*+Δ𝔹)∩]×Δ satisfies \n\n\n    |ξ̅(t)|≤ν/2 + sup_τ≥ t_0 ||ℓ((τ)) +(ε_a)||≤ν/2+ M_2.\n\n\nThus, for all t≥max{T_1,T_2}, the trajectory  converges to a ν/2-neighborhood of ^*× M_2. Therefore, the Omega-limit set from × M_3 is nonempty and Ω(× M_3)⊂ (^*× M_2) + ν/2⊂int(× M_3).  By <cit.>, the set Ω(× M_3) is uniformly globally asymptotically stable for the average system (<ref>) restricted to × M_3. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\nieeetr\n\n\n\n\n\n\nXin Chen is a Postdoctoral Associate in the MIT Energy Initiative at  Massachusetts Institute of Technology. He received the Ph.D. degree in electrical engineering from Harvard University, and\nreceived the double B.S. degrees in engineering physics and economics and the master’s degree in electrical engineering from Tsinghua University,  China.  His research interests lie in\nthe intersection of control, learning, and optimization for human-cyber-physical systems, with particular applications to power and energy systems. He was a recipient of the IEEE PES Outstanding Doctoral Dissertation Award in 2023, \nthe Outstanding Student Paper Award in the IEEE Conference on Decision and Control in 2021, the Best Student Paper Award Finalist in the IEEE Conference on Control Technology and Applications in 2018, and the Best Conference Paper Award in the IEEE PES General Meeting in 2016.\n\n\n\n\n\n\nJorge I. Poveda\nis an Assistant Professor in the ECE Department at the University of California, San Diego. He received the M.Sc. and Ph.D. degrees in Electrical and Computer Engineering from UC Santa Barbara in 2016 and 2018, respectively. Before joining UCSD, he was an Assistant Professor at CU Boulder from 2019 until 2022, and a Postdoctoral Fellow at Harvard University during part of 2018. He has received the NSF Research Initiation (CRII) and CAREER awards, the Young Investigator Award from the Air Force Office of Scientific Research, the campus-wide RIO Faculty Fellowship at CU Boulder, and the CCDC Outstanding Scholar Fellowship and Best Ph.D. Thesis awards from UCSB. He has co-authored papers selected as finalists for the Best Student Paper Award at the 2017 and 2021 IEEE Conference on Decision and Control. \n\n\n\n\n\n\nNa Li is the Gordon McKay Professor of Electrical Engineering and Applied Mathematics in the School of Engineering and Applied Sciences at Harvard University. She received her PhD degree in Control and Dynamical systems from the California Institute of Technology in 2013. In 2014, she was a postdoctoral associate of the Laboratory for Information and Decision Systems\nat Massachusetts Institute of Technology.  She has received the Donald P. Eckman Award, ONR and AFOSR  Young Investigator Awards, NSF CAREER Award, the Harvard PSE Accelerator Award, and she was also a Best Student Paper Award finalist in the 2011 IEEE Conference on Decision and Control. She has served as Associate Editor for IEEE Transactions on Automatic Control, Systems and Control Letters, and IEEE Control System Letters.\n\n\n\n\n\n\n\n"}