{"entry_id": "http://arxiv.org/abs/2303.07339v1", "published": "20230313175913", "title": "Constraining the X-ray heating and reionization using 21-cm power spectra with Marginal Neural Ratio Estimation", "authors": ["Anchal Saxena", "Alex Cole", "Simon Gazagnes", "P. Daniel Meerburg", "Christoph Weniger", "Samuel J. Witte"], "primary_category": "astro-ph.CO", "categories": ["astro-ph.CO"], "text": "\n\nfirstpage–lastpage\nOptimal parallel wire cutting without ancilla qubits\n    Naoki Yamamoto\n    March 30, 2023\n====================================================\n\n\n\n\n\nCosmic Dawn (CD) and Epoch of Reionization (EoR) are epochs of the universe which host invaluable information about the cosmology and astrophysics of X-ray heating and hydrogen reionization. Radio interferometric observations of the 21-cm line at high redshifts have the potential to revolutionize our understanding of the universe during this time. However, modeling the evolution of these epochs is particularly challenging due to the complex interplay of many physical processes. This makes it difficult to perform the conventional statistical analysis using the likelihood-based Markov-Chain Monte Carlo (MCMC) methods, which scales poorly with the dimensionality of the parameter space. In this paper, we show how the Simulation-Based Inference (SBI) through Marginal Neural Ratio Estimation (MNRE) provides a step towards evading these issues. We use  to model the 21-cm power spectrum during CD-EoR with a six-dimensional parameter space. With the expected thermal noise from the Square Kilometre Array (SKA), we are able to accurately recover the posterior distribution for the parameters of our model with an order of magnitude fewer simulations than the conventional likelihood-based methods. We further show how the same training dataset can be utilized to investigate the sensitivity of the model parameters over different redshifts. Our results support that such efficient and scalable inference techniques enable us to significantly extend the modeling complexity beyond what is currently achievable with conventional MCMC methods.\n\n\n\n\n\ndark ages, reionization, first stars – methods: data analysis – methods: statistical\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nsections/introduction.tex\n\n\n\n§ IMPLEMENTATION OF MNRE USING SWYFT\n\n\nsections/swyft_framework.tex\n\n\n\n§ SIMULATIONS AND TRAINING DATA\n\n\nsections/sims_data.tex\n\n\n\n§ RESULTS\n\n\nsections/results.tex\n\n\n\n§ SUMMARY\n\n\nsections/summary.tex\n\n\n\n§ ACKNOWLEDGEMENTS\n\nP.D.M acknowledges support from the Netherlands organization for scientific research (NWO) VIDI grant (dossier 639.042.730). S.G acknowledges support from the Harlan J. Smith McDonald fellowship. S.J.W. and C.W. are supported by the European Research Council (ERC) under the European Union’s Horizon 2020 research and innovation programme (Grant agreement No. 864035 - Undark).\n\n\n\n\n§ DATA AVAILABILITY\n\nAccompanying code is available at <https://github.com/anchal-009/swyft_21cmPk>. The data underlying this article will be shared on reasonable request to the corresponding author.\n\n\n\n\n\n\n\n\n\nmnras\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ COVERAGE OF THE NETWORK\n\n\nWith the trained network d_ϕ (x, θ), we can quickly estimate the posterior p(θ|x) for any mock observation x. This allows us to test the statistical properties of the Bayesian inference. We evaluate the nominal and empirical expected coverage probabilities to check the consistency of the trained network. Given a set of n i.i.d. samples (x_i, θ_i^*) ∼ p(x, θ), the empirical expected coverage probability of the (1 - α) highest posterior density regions (HPDR) for the posterior estimator p̂(θ|x) is given as <cit.>\n\n    1 - α̂ = 1/n∑_i=1^n1[θ_i^* ∈Θ_p̂(θ|x_i)(1-α)] ,\n\nwhere Θ_p̂(θ|x_i)(1-α) function gives the (1-α) HPDR of p̂(θ|x) for the mock data x_i with the ground truth θ_i^*. We then compare it with the nominal expected coverage probability, which is equal to the confidence level (1 - α). For an estimator with perfect coverage, the empirical coverage probability is equal to the nominal coverage probability, so when we randomly generate n samples (x_i, θ_i^*) ∼ p(x, θ), the ground truth θ_i^* lies outside the (1-α) HPDR in α of the cases <cit.>. \n\nWe re-parameterize α (α̂) in terms of a new variable z which is 1 - α/2 (1 - α̂/2) quantile of the standard normal distribution. This means that the (1, 2, 3)σ regions correspond to z=(1, 2, 3) with (1-α) = (0.6827, 0.9545, 0.9997). The uncertainties on the empirical expected coverage probability follow from the finite number of samples (n) and are estimated using the Jeffreys interval <cit.>. In Figure <ref>, we show the empirical expected coverage probability of the network as a function of confidence levels for all 1D and 2D marginal posteriors. We find that in all cases, they match to good precision.\n\n\n\n§ COMPARISON WITH 21CMMC\n\n\nIn this section, we compare the posteriors obtained from MNRE with an MCMC sampling-based method, 21CMMC. As sampling our joint six-dimensional parameter space with the likelihood-based approach is computationally very demanding, we shrink our parameter space to two dimensions, including ζ and log_10(T_ vir^ min). We keep the other parameters fixed to {R_ mfp, log_10(L_ X), E_0, α_ X} = {15, 40.5, 0.5, 1} and target redshifts z = 10, 9 and 8. \n\nTo set up 21CMMC, we use 48 random walkers with 2000 iterations each, generating ∼ 10^5 samples. On the other hand, the training data for MNRE consists of 10^4 simulations. The mock observation with (ζ, log_10(T_ vir^ min)) = (30, 4.70) is generated using a different realization of the density field from the one used in sampling. In Figure <ref>, we show the posteriors obtained from 21CMMC (red) and MNRE (blue). The 1D and 2D marginal posteriors obtained from MNRE are in good agreement with 21CMMC at a significantly reduced computational cost. These results are consistent with the findings of <cit.>.\n\n\n\n\n\n\n\n"}