{"entry_id": "http://arxiv.org/abs/2303.06847v1", "published": "20230313043135", "title": "Label Distribution Learning from Logical Label", "authors": ["Yuheng Jia", "Jiawei Tang", "Jiahao Jiang"], "primary_category": "cs.LG", "categories": ["cs.LG", "cs.AI"], "text": "\n\nOn the Regret of Online Edge Service Hosting t1\n    Sharayu Moharir\n    Received: date / Accepted: date\n===============================================\n\n\n\n\nLabel distribution learning (LDL) is an effective method to predict the label description degree (a.k.a. label distribution) of a sample. However, annotating label distribution (LD) for training samples is extremely costly. So recent studies often first use label enhancement (LE) to generate the estimated label distribution from the logical label and then apply external LDL algorithms on the recovered label distribution to predict the label distribution for unseen samples. But this step-wise manner overlooks the possible connections between LE and LDL. Moreover, the existing LE approaches may assign some description degrees to invalid labels. To solve the above problems, we propose a novel method to learn an LDL model directly from the logical label, which unifies LE and LDL into a joint model, and avoids the drawbacks of the previous LE methods. Extensive experiments on various datasets prove that the proposed approach can construct a reliable LDL model directly from the logical label, and produce more accurate label distribution than the state-of-the-art LE methods.\n\n\n\n\n§ INTRODUCTION\n\n Multi-label learning (MLL) <cit.> is a well-studied machine learning paradigm where each sample is associated with a set of labels. In MLL, each label is denoted as a logical value (0 or 1), indicating whether a label can describe a sample. However, the logical label cannot precisely describe the relative importance of each label to a sample. To this end, label distribution learning (LDL) <cit.> was proposed, in which real numbers are used to demonstrate the relative importance of a label to a certain sample. For example, Fig. 1(a) is a natural scene image, which is annotated with three positive labels (“Sky\", “Mountain\" and “Sea\") and one negative label (“Human\") as shown in Fig. 1(b). Since the relative importance of each label to this image is different, for example, the label “Mountain\" is more important than the label “Sea\", the real numbers (also known as the description degree) in Fig. 1(c) can better describe this image. The description degrees of all labels constitute a label distribution (LD). Specifically, if d^l_x represents the description degree of the label l to the instance x, it's subject to the non-negative constraint d^l_x∈[0,1] and the sum-to-one constraint ∑_l d^l_x=1. LDL aims to predict the LD for unseen samples, which is a more general paradigm than the traditional MLL.\n\n\n\n\n\n\nIn LDL, a training set with samples annotated by LDs is required to train an LDL model. Unfortunately, the acquisition of label distributions of instances is a very costly and time-consuming process. Moreover, in reality, most datasets are only annotated by logical labels, which cannot be used directly by the existing LDL methods. Then a question naturally arises: can we directly train an LDL model from the logical labels? \n\nRecently, label enhancement (LE) <cit.> was proposed to partially answer this question. Specifically, LE first recovers the label distributions of training samples from the logical labels and then performs an existing LDL algorithm on the recovered LDs. Following <cit.>, many variants of LE were proposed, such as <cit.>, <cit.> and <cit.>. We refer the readers to the related work for more details. To achieve LE, those methods generally construct a linear mapping from the features to the logical labels directly, and then normalize the output of the linear mapping as the recovered LDs. However, those LE methods may assign positive description degrees to some negative logical labels. Moreover, as all the positive logical labels are annotated as 1, simply building a mapping from features to the logical labels is unreasonable, which will not differentiate the description degrees to different labels. Last but not least, the LE-based strategy is a step-wise manner to predict LD for unseen samples, which may lose the connection between LE and LDL model training. \n\nIn this paper, we come up with a novel model named DLDL, i.e., Directly Label Distribution Learning from the logical label, which gives a favorable answer to the question “can we directly train an LDL model from the logical labels\". The major contributions of our method are summarized as follows:\n\n\n\n  * Our model is the first attempt to combine LE and LDL into a single model, which can learn an LDL model directly from the instances annotated by the logical labels. By the joint manner, the LE and LDL processes will better match each other. \n\n\n  * We strictly constrain the description degree d^l_x to be 0 when the logical value corresponding to the label l is 0. The constraint will avoid assigning positive description degrees to the negative logical labels.\n\n\n  * The existing LE methods usually minimize a least squares loss between the recovered LD and the logical label, which can not differentiate the description degrees of different labels. The proposed model avoids this fidelity term, and uses KL-divergence to minimize the difference between the recovered LD and the predictive LD, which is a better difference measure for two distributions.\n\nExtensive experiments on six benchmark datasets clearly show that the LD recovered by our method is better than that recovered by state-of-the-art LE methods on the training set, and the prediction performance of our model on the testing set also achieves state-of-the-art results compared to the traditional step-wise strategy.\n\nThe structure of the paper is as follows. Firstly, we briefly review the related works on LDL and LE in Section 2. Secondly, we present the technical details of our model in Section 3. Then, the experimental results and analyses are  presented to  prove the effectiveness of our model in Section 4. Finally, conclusions and future working directions are drawn in Section 5.\n\n\n\n\n§ RELATED WORKS\n\nNotations: Let n, m and c represent the number of samples, the dimension of features, and the number of labels. Let x∈ℝ^m denote a feature vector and y∈{0,1}^c denote its corresponding logical label vector. The feature matrix and the corresponding logical label matrix can be denoted by 𝐗=[x_1;x_2;…;x_n]∈ℝ^n× m and 𝐘=[y_1;y_2;…;y_n]∈{0,1}^n× c, respectively. Let 𝒴={l_1, l_2, …, l_c} be the complete set of labels. The description degree of the label l to the instance x is denoted by d^l_x, which satisfies d^l_x∈[0,1] and ∑_l d^l_x=1, and the label distribution of x_i is denoted by d_i=(d^l_1_x_i,d^l_2_x_i,…,d^l_c_x_i).\n\n\n\n §.§ Label Distribution Learning\n\nLDL is a new machine learning paradigm that constructs a model to predict the label distribution of samples. At first, LDL were achieved through problem transformation that transforms LDL into a set of single label learning problems such as PT-SVM, PT-Bayes <cit.>, or through  algorithm adaptation that adopts the existing machine learning algorithms to LDL, such as AA-kNN and AA-BP <cit.>. SA-IIS <cit.> is the first model that specially designed for LDL, whose objective function is a mixture of maximum entropy loss <cit.> and KL-divergence. Based on SA-IIS, SA-BFGS <cit.> adopts BFGS to optimize the loss function, which is faster than SA-IIS. Sparsity conditional energy label distribution learning (SCE-LDL) <cit.> is a three-layer energy-based model for LDL. In addition, SCE-LDL is improved by incorporating sparsity constraints into the objective function. To reduce feature noise, latent semantics encoding for LDL (LSE-LDL) <cit.> converts the original data features into latent semantic features, and removes some irrelevant features by feature selection. LDL forests (LDLFs) <cit.> is based on differentiable decision trees and may be combined with representation learning to provide an end-to-end learning framework. LDL by optimum transport (LDLOT) <cit.> builds an objective function using the optimal transport distance measurement and label correlations.\n\n\n\n §.§ Label Enhancement\n\nThe above mentioned LDL methods all assume that in the training set, each sample is annotated with label distribution. However, precisely annotating the label distributions for the training samples is extremely costly and time-consuming. On the contrary, many datasets annotated by logical labels are readily available. To this end, LE was proposed, which aims to convert the logical labels of samples in training set to label distributions. GLLE <cit.> is the first LE algorithm, which assumes that the LDs of two instances are similar to each other if they are similar in the feature space. LEMLL <cit.> adopts the local linear embedding technique to evaluate the relationship of samples in the feature spaces. Generalized label enhancement with sample correlations (gLESC) <cit.> tries to obtain the sample correlations from both of the feature and the label spaces. Bidirectional label enhancement (BD-LE) <cit.> takes the reconstruction errors from the label distribution space to the feature space into consideration.\n\nAll of these LE methods can be generally formulated as\n\n    min_𝐖||𝐗𝐖-𝐘||_F^2+ϕ (𝐗𝐖,𝐗),\n\nwhere 𝐗 and 𝐘 are the feature matrix and logical label matrix, ·_F denotes the Frobenius of a matrix, 𝐖∈ℝ^m× c builds a linear mapping from features to logical labels, and ϕ (𝐗𝐖,𝐗) models the geometric structure of samples, which is used to assist LD recovery. After minimizing Eq. (<ref>), those methods usually normalize 𝐗𝐖 as the recovered LD.\n\nAlthough those LE methods have achieved great success, they still suffer from the following limitations. Firstly, the fidelity term that minimizes the distance between the recovered LD 𝐗𝐖 and the logical label 𝐘 is inappropriate, because the logical labels are annotated as the same value and the linear mapping will not differentiate the description degrees for different labels. Besides, the Frobenius norm is also not the best choice to measure the difference between two distributions. Secondly, Eq. (<ref>) doesn't consider the restriction of the label distribution, i.e. ∀ i, 0≤d_i ≤y_i, ∑_l d^l_x_i=1. Although those LE methods performs a post-normalization to satisfy those constraints, they may assign positive description degrees to some negative logical labels. Furthermore, to predict the LD for unseen samples, those methods need to first perform LE and then carry out an existing LDL algorithm. The step-wise manner does not consider potential connections between LE and LDL.\n\n\n\n§ THE PROPOSED APPROACH\n\nTo solve the above mentioned issues, we propose a novel model named DLDL. Different from the previous two-step strategy, our method can directly generate a label distribution matrix 𝐃 = [d_1;d_2;…;d_n] ∈ℝ^n× c for samples annotated by logical labels and at the same time construct a weight matrix 𝐖∈ℝ^m× c to predict LD for unseen samples.\n\nWe use the following priors to recover the LD matrix 𝐃 from the logical 𝐘. First, as each row of 𝐃 (e.g., d_i) denotes the recovered LD for a sample, it should obey the non-negative constraint and the sum-to-one constraint to make it a well-defined distribution, i.e., 0_c≤d_i≤1_c and d_i1_c=1, where 0_c, 1_c∈ℝ^c denote an all-zeros vector and an all-ones vector, and 0≤d_i≤1 means each element of d_i is non-negative and no more than 1. Moreover, to avoid assigning a positive description to a negative logical label, we require that 0≤d_i≤y_i, ∀ i. Reformulating the above constraints in the matrix form, we have 0_m× c≤𝐃≤𝐘, 𝐃1_c = 1_n, where 0_m× c is an all-zeros matrix with size m× c, and the above inequalities are held element-wisely.\n\nSecond, we utilize the geometric structure of the samples to help recover the LDs from the logical labels, i.e., if two samples are similar to each other in the feature space, they are likely to own the similar LDs. To capture the similarity among samples, we define the local similarity matrix 𝐀=[A_i j]_n × n as\n\n    A_i j=\n        exp(-x_i-x_j_2^2 / 2σ^2),   if x_j ∈𝒩(x_i)\n    \n        0,     otherwise.\n\n𝒩(x_i) denotes the k-nearest neighbors of x_i, and σ^2>0 is a hyper-parameter. Based on the constructed local similarity matrix 𝐀, we can infer that the value of ||d_i-d_j|| is small when A_ij is large, i.e.,\n\n    min_𝐃 i,j∑A_ij||d_i-d_j||_2^2 =tr(𝐃^T𝐆𝐃),\n\nin which tr( ·) denotes the trace of a matrix, and 𝐆=𝐀̂-𝐀 is the graph Laplacian matrix and 𝐀̂ is a diagonal matrix with the elements Â_i i=∑_j=1^n A_i j.\n\nBy taking the above priors into consideration, the LD matrix 𝐃 can be inferred from the logical label matrix 𝐘, i.e.,\n\n    𝐃min tr(𝐃𝐆𝐃^T)+||𝐃||_F^2\n       s.t. 0_m× c≤𝐃≤𝐘, 𝐃1_c=1_n,\n\nwhere an additional term 𝐃_F^2 is imposed as regularization. \n\nBased on the recovered LD, we adopt a non-linear model that maps the features to the recovered LD, which can be used to predict the LD for unseen samples. Specifically, the non-linear model is formulated as\n\n    P_ij=1Zexp(∑^m_k=1 X_ikW_kj),\n\nwhere 𝐖 is the weight matrix, 𝐏=[P_ij]_n× n is the prediction matrix, and Z=∑^c_j=1exp(∑^m_k=1 X_ikW_kj) is a normalization term.  To infer the weight matrix 𝐖, we minimize the KL-divergence between the recovered label distribution matrix 𝐃 and the prediction matrix 𝐏, because KL-divergence is a good metric to measure the difference between the two distributions. Accordingly, the loss function for inferring 𝐖 becomes\n\n    𝐖minKL(𝐃,𝐏)+||𝐖||_F^2,\n\nwhere the widely-used squared Frobenius norm is imposed to control the model complexity.\n\nTo directly induce an LD prediction model from the logical labels, we combine Eqs. (<ref>) and (<ref>) together and the final optimization problem of our method becomes:\n\n    𝐃,𝐖minKL(𝐃,𝐏)+α tr(𝐃𝐆𝐃^T)+β||𝐃||_F^2+γ||𝐖||_F^2\n       s.t. 0_m× c≤𝐃≤𝐘, 𝐃1_c=1_n,\n\nin which α, β and γ are hyper-parameters to adjust the contributions of different terms. By minimizing Eq. (<ref>), the proposed model can recover the LD for samples with logical labels, and simultaneously, can predict LD for unseen samples through Eq. (<ref>). \n\n\n \nThen, some restrictions to the label distribution matrix 𝐃 should be attached to Λ(𝐃). Specifically, considering that d^l_x∈[0,1] and if Y_i j=0, the corresponding description degree d^l_j_x_i, i.e., D_i j, should be 0, which means that D must satisfy 0≤𝐃≤𝐘, where 0∈ℝ^n× c is a matrix of all zeros and “𝐀≤𝐁” means that every element in 𝐀 is less than or equal to the corresponding element in 𝐁. So the final loss function of the LE process can be written as:\n\n\n    Λ(𝐃)   =i,j∑A_ij||d_i-d_j||_2^2 + ||𝐃||_F^2\n       =tr(𝐃^T𝐆𝐃) + ||𝐃||_F^2,\n       s.t. 0≤𝐃≤𝐘, 𝐃1_c=1_n,\n\nin which 1_c is a vector of size c with all of its elements equals to 1.\n\n\nTo make LDL predictions, we need a prediction matrix 𝐏∈ℝ^n× c and make it close to the label distribution matrix 𝐃. We adopt a non-linear predictive model and train the weight matrix 𝐖 to achieve this. In detail, we specify P_ij=1Zexp(∑^m_k=1 X_ikW_kj), in which Z=∑^c_j=1exp(∑^m_k=1 X_ikW_kj). Moreover, instead of the least squares loss function, we take the KL-divergence to measure the division from the label distribution matrix 𝐃 to the prediction matrix 𝐏, since it can better represent the difference between the two probability distributions. By adding the widely-used squared Frobenius norm to control the scale of 𝐖, we can obtain the loss function Ω(𝐃,𝐖) of the LDL process:\n\n    Ω(𝐃,𝐖)=KL(𝐃,𝐏)+||𝐖||_F^2.\n\n\nSince our model is a combination of LE and LDL, we optimize Λ(𝐃) together with Ω(𝐃,𝐖). By introducing three penalty coefficient α, β and γ, the overall optimization objective can be written as\n\n    𝐃,𝐖minKL(𝐃,𝐏)+α tr(𝐃𝐆𝐃^T)+β||𝐃||_F^2+γ||𝐖||_F^2\n       s.t. 0≤𝐃≤𝐘, 𝐃1_c=1_n.\n\n\n\n\n\n\n §.§ Optimization\n\nEq. (<ref>) has two variables, we solve it by an alternative iterative process, i.e., update 𝐖 with fixed 𝐃, and then update 𝐃 with fixed 𝐖. \n\n\n  §.§.§ Update W\n When 𝐃 is fixed, the optimization problem (<ref>) with respect to 𝐖 can be formulated as follows:\n\n    𝐖min    KL(𝐃,𝐏)+γ||𝐖||_F^2.\n\nExpanding the KL-divergence and substituting P_ij in Eq. (<ref>) into Eq. (<ref>), we obtain the objective function of 𝐖 as\n\n    T(𝐖)=\n           ∑_i ln∑_jexp(∑_k X_i k W_k j)\n         +γ||𝐖||_F^2\n       -∑_i,j D_i j∑_k X_i k W_k j.\n\nEq. (<ref>) is a convex problem, we use gradient descent algorithm to update 𝐖, where the gradient is expressed as\n\n    ∂ T( 𝐖)∂ W_k j=   ∑_iexp(∑_k X_i k W_k j) X_i k∑_jexp(∑_kX_i k W_k j)\n       -∑_i D_i j X_i k+2γ W_k j.\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Update D\n With fixed 𝐖, the optimization problem (<ref>) regarding 𝐃 is formulated as\n\n    𝐃min KL(𝐃,𝐏)+αtr(𝐃𝐆𝐃^T)+β||𝐃||_F^2\n       s.t. 0≤𝐃≤𝐘, 𝐃1_c=1_n.\n\nEq. (<ref>) involves multiple constraints and diverse losses, we introduce an auxiliary variable 𝐁 = 𝐃∈ℝ^n× c to simplify it, and the corresponding augmented Lagrange equation becomes\n\n    𝐃,𝐁min KL(𝐃,𝐏) +αtr(𝐃^T𝐆𝐃) +β||𝐃||_F^2 \n                +<Φ,𝐁-𝐃>\n    +τ/2||𝐁-𝐃||^2_F\n       s.t. 0≤𝐁≤𝐘, 𝐁1_c=1_n,\n\nwhere Φ∈ℝ^n× c is the Lagrange multiplier, and τ is parameter to introduce the augmented equality constraint. Eq. (<ref>) can be minimized by solving the following sub-problems iteratively. \n\n\n1) 𝐃-subproblem: Removing the irrelated terms regarding 𝐃, the 𝐃-subproblem of Eq. (<ref>) becomes\n\n    𝐃min KL(𝐃,𝐏) +αtr(𝐃^T𝐆𝐃) +β||𝐃||_F^2\n                +<Φ,𝐁-𝐃>\n    +τ/2||𝐁-𝐃||^2_F.\n\nEq. (<ref>) is solved when its gradient regarding 𝐃 vanishes, leading to \n\n    𝐃=(𝐗𝐖+Φ+τ𝐁)(2β+α(𝐆+𝐆^T)+τ)^-1.\n\n\n2) 𝐁-subproblem: When 𝐃 is fixed, the problem (<ref>) can be written as\n\n    𝐁min <Φ,𝐁-𝐃>\n    +τ/2||𝐁-𝐃||^2_F\n       s.t. 0≤𝐁≤𝐘, 𝐁1_c=1_n.\n\nLet b̂=[b_1^T;b_2^T;⋯;b_n^T]∈ℝ^nc=vec(𝐁), where b_i is the i-th row of 𝐁 and vec(·) is the vectorization operator. Then, the problem (<ref>) is equivalent to:\n\n    b̂min b̂^T Σb̂ - (2d̂^T+2/τϕ̂^T) b̂\n       s.t. 0_nc≤b̂≤ŷ, ∑_j=c(i-1)+1^cib̂_j=1   (∀ 0≤ i≤ n ),\n\nin which d̂, ϕ̂ and ŷ represent vec(𝐃), vec(Φ) and vec(𝐘), respectively, and b̂_j is the j-th element of b̂. Eq. (<ref>) is a quadratic programming (QP) problem that can be solved by off-the-shelf QP tools. \n\nThe detailed solution to update 𝐃 in Eq. (<ref>) is summarized in Algorithm 1.\n\n\n\n  §.§.§ Initialization of W and D\n\nThe above alternative updating of 𝐖 and 𝐃 needs an initialization of them. As is suggested by <cit.>, we initialize 𝐖 as an identity matrix and we initialize 𝐃 by the pseudo label distribution matrix in <cit.>.\n\nThe pseudo code of DLDL is finally presented in Algorithm 2.\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ EXPERIMENTS\n\n\n\n §.§ Real-World Datasets\n\nWe select six real-world datasets from various fields for experiment, and samples in each dataset are annotated by LDs. The statistics of the six datasets are shown in Table <ref>. Natural Scene <cit.> is generated from the preference distribution of each scene image, SCUT-FBP <cit.> is a benchmark dataset for facial beauty perception, RAF-ML <cit.> is a multi-label facial expression dataset, SCUT-FBP5500 <cit.> is a big dataset for facial beauty prediction, Ren_CECps <cit.> is a Chinese emotion corpus of weblog articles, and Twitter_LDL <cit.> is a visual sentiment dataset.\n\nTo verify whether our method can directly learn an LDL model from the logical labels, we generate the logical labels from the ground-truth LDs. Specifically, when the description degree is higher than a predefined threshold δ, we set the corresponding logical label to 1; otherwise, the corresponding logical label is 0. In this paper, δ is fixed to 0.01.\n\n\n\n\n\n §.§ Baselines and Settings\n\nIn this paper, we split each dataset into three subsets: training set (60%), validation set (20%) and testing set (20%). The training set is used for recovery experiments, that is, we perform LE methods to recover the LDs of training instances; the validation set is used to select the optimal hyper-parameters for each LE algorithms; the testing set is used for predictive experiments, that is, we use an LDL model learned from the training set with the recovered LDs to predict the LDs of testing instances.\n\nIn the recovery experiment, for our method DLDL, α and γ are chosen among {10^-3,10^-2,⋯,10,10^2}, β is selected from {10^-3,10^-2,⋯,1,10}, and the maximum of iterations t is fixed to 10. We compare DLDL with five state-of-the-art LE methods, each configured with suggested configurations in respective literature:\n\n\n  * FLE <cit.>: α, β, λ, γ are chosen among {10^-3,10^-2,⋯,10,10^2}.\n\n  * GLLE <cit.>: λ is chosen among {10^-3,10^-2,⋯,1}.\n\n  * LEMLL <cit.>: the number of neighbors K is set to 10 and ϵ is set to 0.2.\n\n  * LESC <cit.>: β is set to 0.001 and γ is set to 1.\n\n  * FCM <cit.>: the number of clustering centers is set to 10 times of the number of labels.\n\n\nIn the predictive experiment, we apply BFGS-LLD <cit.> algorithm to predict the LDs of testing instances based on the recovered LDs by performing the five baseline LE methods. Note that our model can directly predict the LDs without an external LDL model.\n\nAs suggested in <cit.>, we adopt three distance metrics (i.e., Chebyshev, Clark and Canberra) and one similarity metric (i.e., Intersection) to evaluate the recovery performance and the predictive performance.\n\n\n\n\n\n\n §.§ Evaluation Metrics\n\nAs suggested in <cit.>, we adopt three distance metrics (i.e., Chebyshev, Clark and Canberra) and one similarity metric (i.e., Intersection) to evaluate the recovery performance and the predictive performance. The formulas of the four evaluation metrics are summarized in Table 2, where d denotes the ground-truth LD vector and d̂ denotes the recovered or predicted LD vector. In addition, Dis and Sim represent the distance metric and the similarity metric, respectively. The “↓\" after the distance measures means “the smaller the greater\", while the “↑\" means “the larger the greater\".\n\n\n\n\n\n\n\n\n\n §.§ Results\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Recovery Results\n\nIn this subsection, we calculate the distances and similarities between the ground-truth LD and the LD recovered by each LE method via four evaluation metrics on each dataset. Table <ref> shows the detailed recovery results, where all methods are ranked according to their performance and the best average rank on each metric is shown in boldface. In addition, the “↓\" after the metrics means “the smaller the greater\", while the “↑\" means “the larger the greater\". Based on the recovery results, we have the following observations:\n\n\n\n  * DLDL achieves the lowest average rank in terms of all the four evaluation metrics. To be specific, out of the 24 statistical comparisons (6 datasets × 4 evaluation metrics), DLDL ranks 1st in 79.2% cases and ranks 2nd in 16.7% cases, which clearly shows the superiority of our approach in LE.\n\n\n  * On some datasets, our method achieves superior performance. For example, on SCUT, REN and FBP, DLDL significantly improves the results compared with other algorithms in terms of the Chebyshev and Intersection.\n\n\n  * Although the average ranks of FLE and GLLE are low, they do not perform well on all datasets as DLDL does. Specifically, FLE performs poorly on SCUT and RAF, and GLLE performs poorly on NS, REN and Twitter. From this point of view, DLDL is more robust to different datasets than comparison algorithms.\n\nWe can also see that in the REN dataset, our algorithm has a significant improvement in the results against Chebyshev, Cosine and Intersection compared with other algorithms. This is probably because the ground-truth labels in this dataset is mostly zero, which fits well with the restriction to the LD in our algorithm.\n\n\nMoreover, Fig. <ref> shows the recovery results of a typical sample on the Twitter dataset. For this sample, the logical values corresponding to the label 1, 4, 5, 6, 8 are all 0, indicating that these labels cannot describe this sample. However, the five comparison methods still assign positive description degrees for these invalid labels. Differently, DLDL avoids this problem, and produces differentiated description degrees fairly close to the ground-truth values.\n\n\n\n\n\n\n\n\n\n  §.§.§ Predictive Results\n\nIn this subsection, BFGS-LLD is used as the predictive model to generate the LDs of testing instances for the five comparison methods, while our model can directly predict the LDs of testing instances. Then, we rank all methods and highlight the best average rank on each metric in boldface. The detailed predictive results are presented in Table <ref>. In addition, BFGS-LLD is trained on the ground-truth LDs of the training instances and its results are recorded as the upper bound of the prediction results. From the reported results, we observe that:\n\n\n\n  * DLDL achieves the lowest average rank in terms of the three evaluation metrics (i.e., Clark, Canberra and Intersection). Specifically, out of the 24 statistical comparisons, DLDL ranks 1st in 62.5% cases and ranks 2nd in 8.33% cases. In general, DLDL performs better than most comparison algorithms.\n\n\n  * In some cases, the performance of our approach even exceeds the upper bound. For example, on SCUT dataset, DLDL performs better than the BFGS-LLD trained on the ground-truth LDs in terms of all the four evaluation metrics, which shows that our model has considerable potential in learning from logical labels.\n\nThis may be interpreted as that the alternative optimization of the weight matrix 𝐖 and the label distribution matrix 𝐃 can excavate some hidden information in the deep layers of the training instance space.\n\n\n\n\nIn Figure 3, we visualize one of the recovery results in the Twitter dataset. Because of the high quality of the recovered label distributions on the training datasets, the LDL results of DLDL is also excellent. So in Figure 6, it's obvious that the description degrees generated by DLDL is also similar to the ground-truth ones.\n\n\n\n\n §.§ Further Analysis\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Ablation Study\n\nIn order to verify the necessity of the involved terms of our approach, we conduct ablation experiments and present the results on Chebyshev in Tables <ref> and <ref>, where α, β and γ are hyper-parameters to adjust the contributions of different terms. When one of hyper-parameters is fixed to 0, the remaining ones are determined by the performance on the validation set.\n\nFrom the results, we observe that the performance of DLDL becomes poor when the term controlled by β is missing, indicating that it is critical to control the smoothness of the label distribution matrix 𝐃. In general, DLDL outperforms its variants without some terms, which verify the effectiveness and rationality of our model.\n\n\n\n  §.§.§ Significance Test\n\n\n\nIn this subsection, we use the Bonferroni–Dunn test at the 0.05 significance level to test whether DLDL achieves competitive performance compared to other algorithms. Specifically, we combine the recovery results with the predictive results to conduct the Bonferroni-Dunn test, that is, the number of algorithms is 6 and the number of datasets is considered as 12 (2 groups of experiments × 6 datasets). Then, we use DLDL as the control algorithm with a critical difference (CD) to correct for the mean level difference with the comparison algorithms.\n\nThe results are shown in Fig. <ref>, where the algorithms not connected with DLDL are considered to have significantly different performance from the control algorithms. It is impressive that DLDL achieves the lowest rank in terms of all evaluation metrics and is comparable to FLE, GLLE and LEMLL based on all evaluation metrics.\n\n\n\n§ CONCLUSION AND FUTURE WORK\n\nThis paper gives a preliminary positive answer to the question “can we directly train an LDL model from the logical labels\". Specifically, we propose a new algorithm called DLDL, which unifies the conventional label enhancement and label distribution learning into a joint model. Moreover, the proposed method avoids some common issues faced by the previous LE methods. Extensive experiments validate the advantage of DLDL against other LE algorithms in label enhancement, and also confirm the effectiveness of our method in directly training an LDL model from the logical labels. Nevertheless, our method is still inferior to the traditional LDL model when the ground-truth LD of the training set is available. In the future, we will explore possible ways to improve the predictive performance of our algorithm. \n\n\n\nnamed\n\n\n"}