{"entry_id": "http://arxiv.org/abs/2303.06831v1", "published": "20230313032250", "title": "Fluctuations-Induced Quantum Radiation and Reaction from an Atom in a Squeezed Quantum Field", "authors": ["Matthew Bravo", "Jen-Tsung Hsiang", "Bei-Lok Hu"], "primary_category": "quant-ph", "categories": ["quant-ph", "gr-qc", "hep-th"], "text": "\n   \n\nmbravo@terpmail.umd.edu\nDepartment of Physics, University of Maryland, College Park, Maryland 20742, USA\n\ncosmology@gmail.com\nCenter for High Energy and High Field Physics, National Central University, Taoyuan 320317, Taiwan, R.O.C.\n\nblhu@umd.edu\nMaryland Center for Fundamental Physics and Joint Quantum Institute,  University of Maryland, College Park, Maryland 20742, USA\n\n\n\nIn this third of a series on quantum radiation, we further explore the feasibility of using the memories (nonMarkovianity) kept in a quantum field to decipher certain information about the early universe.  As a model study, we let a massless quantum field be subjected to a parametric process for  a finite time interval such that the mode frequency of the field transits from one constant value to another. This configuration thus mimics a statically-bounded universe,  where there is an in and out state with the scale factor approaching constant, not a continuously evolving one.  The field subjected to squeezing by this process should contain some information of the process itself. If an atom is coupled to the field after the parametric process, its response will depend on the squeezing, and any quantum radiation emitted by the atom will carry this information away so that an observer at a much later time may still identify it. Our analyses show that 1) a remote observer cannot measure the generated squeezing via the radiation energy flux from the atom because the net radiation energy flux is canceled due to the correlation between the radiation field from the atom and the free field at the observer's location. However, 2) there is a chance to identify squeezing by measuring the constant radiation energy density at late times. The only restriction is that this energy density is of the near-field nature and only an observer close to the atom can use it to unravel the information of squeezing. The second part of this paper focuses on 3) the dependence of squeezing on the functional form of the parametric process. By explicitly working out several examples we demonstrate that the behavior of\nsqueezing does reflect essential properties of the parametric process. In fact, striking features may show up in more complicated processes involving various scales. These analyses allow us to establish the connection between properties of a squeezed quantum field and details of the parametric process which does the squeezing. Therefore,  4) one can construct templates  to reconstitute the unknown parametric processes from the data of measurable quantities subjected to squeezing. In a sequel paper these results will be applied to a study of quantum radiations in cosmology.\n\nFluctuations-Induced Quantum Radiation and Reaction  \n from an Atom in a Squeezed Quantum Field\n    Bei-Lok Hu0000-0003-2489-9914\n    March 30, 2023\n===============================================================================================\n\n\n\n\n=18pt\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nThis paper is the third of a series on quantum radiation, in the form of emitted radiation with an energy flux (distinct from thermal radiance felt by an accelerated atom, as in the Unruh effect <cit.>) from the internal degrees of freedom (idf) of an atom, tracing its origin to the vacuum fluctuations of a quantum field, including its back-reaction on the idf dynamics of the atom, in the form of quantum dissipation. In <cit.> two of us considered how vacuum fluctuations in the field act on the idf of an atom (we may call this the `emitter'), modeled by a harmonic oscillator. We first showed how a stochastic component of the internal dynamics of the atom arises from the vacuum fluctuations of the field, resulting in the emittance of quantum radiation.  We then show  how the back-reaction of this quantum radiation induces   quantum dissipation  in the atom's idf dynamics.  We  explicitly identified  the different terms representing these processes  in the Langevin equations of motion.  Then, using the example of a stationary atom, we show how in this simple case the absence of radiation  at a far away observation point where a probe (or detector – note the so-called  Unruh-DeWitt `detector' <cit.> is an emitter in the present context) is located is actually a result of complex cancellations of the interference between emitted radiation from the atom's idf  and the local fluctuations in the free field. In so doing we point out that the entity which enters into the duality relation with vacuum fluctuations is not radiation reaction[In the quantum optics literature, e.g., <cit.>, the relation between quantum fluctuations and radiation reaction is often mentioned without emphasizing the difference between classical radiation reaction <cit.> and quantum dissipation, which exist at two separate theoretical levels. Only quantum dissipation enters in the fluctuations-dissipation relation with quantum fluctuations, not classical radiation reaction.], which can exist as a classical entity, but quantum dissipation <cit.>.  In the second paper <cit.> we considered the idf of the atom interacting with a quantum scalar field initially in a coherent state. We   showed  how the deterministic mean field drives the internal classical mean component to emit classical radiation and receive classical radiation reaction. Both components are statistically distinct and fully decoupled. It is clearly seen that the effects of the vacuum fluctuations of the field are matched with those of quantum radiation reaction, not with classical radiation reaction, as the folklore goes, even promulgated in some textbooks. Furthermore, we identified the reason why quantum radiation from a stationary emitter is not observed, and a probe  located far away only sees classical radiation.\n\n\n\n §.§ Quantum Radiation from an Atom in a Squeezed Quantum Field\n\n\nIn this paper we treat quantum radiation from an atom's idf interacting with a quantum field in a squeezed state. The squeezed state is probably the most important quantum state,  next to the vacuum state, with both rich theoretical meanings and broad practical applications, as well-known in quantum optics. (See, e.g.,  <cit.>). We are particularly interested in its role in cosmology of the early universe.   \n\n \n\n  \nQuantum field squeezed by an expanding universe\n \nSqueezed states of a quantum field  are naturally produced in an expanding universe in fundamental processes  which involve the parametric amplification  of quantum fluctuations, such as particle creation <cit.>, either spontaneous production from the vacuum  or stimulated production from n-particle states, and structure formation <cit.>  from quantum fluctuations of the inflaton field. From relics such as primordial radiation and matter contents observed today, with the help of theoretical models governing their evolution, one attempts to deduce the state of the early universe at different stages of development. In addition to particle creation and structure formation we add here another fundamental quantum process, namely, quantum radiation. One can ask questions like, if such radiation of a quantum nature is detected, how can one use it to reveal certain quantum aspects of the early universe?  Revealing secrets of the early universe by digging out information  stored in the quantum field is \n\nin a similar spirit as the quest we initiated about the nonMarkovianity of the universe through the  memory kept in the quantum field <cit.>.  \n\n\n\n §.§ Three components: Radiation, Squeeze, Drive\n\n\nTowards such a goal we carry out this investigation which involves three components: 1) Quantum radiation 2) Squeezed state,  3) Driven dynamics, either under some external force  or as provided by an expanding universe, which describes how the squeeze parameter changes in time. Part 1)  was initiated in <cit.> and continued in <cit.>,  where the required technical tools for the present investigation can be found. \n\n\nPart 2) is performed here:  we  consider a quantum field in a squeezed state with a fixed squeeze parameter, regarded as the end state of the quantum field after being squeezed under some drive protocol or cosmological evolution. For the description of squeezed states we shall follow the descriptions in our earlier paper <cit.>.  Under the classification of the three types of squeezing described there, we shall adhere to the first type, namely, with fixed squeezing.  The second type of dynamical parametric  squeezing will be treated in our sequel cosmological papers. We shall set aside the third type of squeezing due to finite coupling between the system (here the atom's idf) and the environment (here the quantum field) completely.  \n  \n To see more explicitly what Part 3) entails, consider a situation where the atom at the initial time t_i is in a quantum field in a squeezed state with a fixed squeeze parameter ζ_i  and the same atom  at the final time t_f  in a squeezed field with a different squeeze parameter ζ_f. If an atom emits quantum radiation at either or both the initial and the final times, comparing the signals from both should tell us something about how the drive had affected the atom through the quantum radiation emitted from the atom, or in cosmology, how the universe had evolved as measured by the parametric squeezing of the field. The more challenging situation is if it turns out that there is no emitted quantum radiation from an atom in a squeezed field.  This is what our next work intends to find out.  \n\n\n\n\n\n §.§ Our objectives, in two stages\n\n\nWe wish to ask questions in the same spirit as in <cit.>: can we extract information about the history of the quantum field which had undergone a parametric process from the responses of an atom coupled to it  in the epoch after  the parametric process?  In particular,  for observers (receivers) situated far away from the atom (emitter) whether they can detect radiations emitted  from the atom of a quantum nature. Quantum radiation is of special interest as it originates from the vacuum fluctuations of a quantum field, and is expected to keep some memories of the parametric process it went through. In a cosmological context it acts as a carrier of  quantum information about the early universe. \n\n We divide our program of quantum radiation in cosmology into two stages, phrased as two questions. A) Is there emitted quantum radiation from a stationary atom in a  quantum field with a fixed squeeze parameter? If there is no emitted quantum radiation, then question B) Is there emitted quantum radiation from a stationary atom in a quantum field subjected to a changing squeeze parameter, such as in an expanding universe?  If so, what kind of evolutionary dynamics would produce what types of emitted radiation and with what magnitudes?  The first stage addresses components 1) and 2) listed above, the second stage, components 2) and 3), which will be continued in a follow-up paper.\n \n \n\n  \nRadiation pattern as template for squeezing\n \n This paper operates in the first stage, with a set up  meant for a statically-bounded universe, not the continuously evolving type such as in the Friedmann–Lemaître–Robertson–Walker (FLRW) or the inflationary universe. The first half answers the first question A), \n \n and the second half of this paper examines the response of the atom coupled to a field that had undergone a parametric process earlier.   This evokes the template idea, i.e.,  one can use the response of the atom, coupled to the field in the out-region, to identify the dependence of the squeeze parameter on the earlier parametric process before the out-region.  In the cosmology context, this offers a way for a late time observer of such quantum phenomena to uncover how the universe had evolved in much earlier times. \n   \n\n\n  \nStress-energy tensor of squeezed field\n\nTo answer the central question A),  we use a simplified model in which the quantum field undergoes a parametric process of finite duration, such as under an external drive for a definite period of time, or in an asymptotically stationary (statically bounded) universe. The field could be a quantized matter or graviton field, or an inflaton field whose quantum fluctuations engender cosmological structures. \nThen we calculate the expectation value of the stress-energy tensor of the radiation field emitted by an atom coupled to a free field in a fixed two-mode squeeze state. In order to identify the unambiguous signals and conform to the typical settings, we focus on the late-time results. We learned from our earlier work <cit.> for a quantum field in the vacuum state  that the procedure for checking this is quite involved,  as it entails both the radiation flux emitted from the atom as detected at the spacetime point of the probe, and an incoming flux from infinity. \n\n\n\n §.§ Key steps and major findings\n\n\nThe answer we found after calculating all relevant contributions for an atom in a quantum field in a squeezed state shows that there is no net radiation flux, same as in <cit.>. This is a  consequence of relaxation dynamics of the atom's internal dynamics when it is coupled to the squeezed field <cit.>. However, if the probe can measure the radiation energy density, it should obtain a residual constant radiation energy density at late time. Its value will fall off like the inverse cubic power of the distance between the probe and the atom. Thus it is more like a near-field effect. Nonetheless this energy density has an interesting characteristic: it depends on the squeeze parameter, which is what we are after.\n\nThus, our investigation turns to whether and how the squeeze parameter of the field after the parametric process would depend on the details of the process. We first show that the squeeze parameter can formally be expressed by the fundamental solutions of the parametrically driven field, the latter contains useful information about the process. Then by working out several examples numerically we can make the following observations:\n\n\n    \n  * For a monotonically varying process, the squeeze parameter has a monotonic dependence on the duration of this process; it does not depend on when the process starts, if we fix the duration.\n    \n    \n  * The magnitude of squeezing is related to the rate of change in the process. That is, large squeezing can be induced from a non-adiabatic transition. This is consistent with our understanding of spontaneous particle creation from parametric amplification of  vacuum fluctuations <cit.> and that copious particles can be produced at the Planck time under rapid expansion of the universe <cit.>. Thus we expect that  non-adiabatic processes may contribute to larger residual radiation energy density around the atom. \n    \n    \n  * For a non-monotonic parametric process, various scales in the process induces richer structure to the behavior of the squeeze parameter. In particular, if the parametric process changes with time sinusoidally at some frequency range, it may induce parametric resonance and yield exceptionally large squeezing in the out-region.\n\nSimilar considerations can likewise be  applied to the frequency spectrum of the squeeze parameter of the field in the out-region. One can then examine its dependence on the parametric process which the field has gone through. This illustrates the way to obtain templates in how the squeeze parameter is related to the parametric process, and how certain information of the unknown parametric process can be inferred from these templates.\n\n\n\n\n\n\n §.§ Organization\n \nThe paper is organized as follows. In Sec. <ref>, as a prerequisite, we briefly summarize our earlier results on the relaxation process of the atom-field interaction, and pose the questions we would like to answer in this paper. In Sec. <ref>, we lay out the formalism and the essential tools for detailing the nonequilibrium evolution of the atom's internal dynamics and the squeezed field when they are coupled together. In Sec. <ref> we study the general spatial-temporal behavior of the energy flux and the energy density of the radiation field and examine their late-time behaviors. In Sec. <ref> we turn to the functional dependence of the squeeze parameter on the functional form of the parametric process. Several  examples are provided to illustrate the formal analysis. In Sec. <ref> we give some concluding remarks. Appendix <ref> offers a succinct summary of the two-mode squeezed state. In Appendices <ref> and <ref>, we offer more details on the late-time, large distance behaviors of the energy flux and the energy density of the radiation field. In Appendices <ref>, we discuss the time-translational invariance of the squeeze parameter in the out-region.\n\n \n\n\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n§ SCENARIO: QUANTUM RADIATION IN ATOM-FIELD SYSTEMS\n\n\n\nClassical radiation is a familiar subject. But what is its quantum field origin? Can one trace back its link all the way to quantum fluctuations? We obtained partial  answers  in our last two papers to this question for a harmonic  atom interacting with a quantum field in a vacuum and in a coherent states. This paper deals with a squeezed field, necessary for treating cosmological quantum processes.  Since fluctuation-induced quantum radiation is not a household topic yet, it might be useful to first provide a physical picture of the global landscape of quantum radiation based on our understanding from  previous works, setting the stage for the current work.\n\nIt has been shown that <cit.> when the internal degree of freedom, modeled as a harmonic oscillator, of an atom (called a harmonic atom) in any initial state, is linearly coupled to a  massless linear scalar field in the stationary state, its motion will settle down to an equilibrium state. The presence of this equilibrium state, from the perspective of the atom, implies a balance of energy exchange between the atom and the environmental field. Expectantly,  the radiation generated by the nonequilibrium motion of the atom's internal degree of freedom propagates outward to spatial infinity. It is  lesser known whether and how, from the perspective of the field, the radiation energy from the atom is balanced. In our previous works <cit.>, we have demonstrated that the correlation between the outward radiation field and the local free field at spatial infinity constitutes an inward energy flow to balance the outward radiation energy flow. Furthermore this inward flux serves to supplement the needed energy around the atom for the field to drive the atom's internal motion. Thus we clearly see how energy flows from the atom to spatial infinity and then back-flows to the atom. This is a consequence of the nonequilibrium fluctuation-dissipation relations <cit.> for the atom's internal degree of freedom and the free field. This is a stronger condition than the conservation of energy. This point is better appreciated once we take the global view of the total system, composed of the atom and field. The entire system is closed and the total energy is conserved, but this does not guarantee the energy exchange between two subsystems is balanced unless the reduced dynamics is fully relaxed to an equilibrium state. \n\n\n\nIf, instead, the internal degree of freedom of the atom is initially coupled to the quantum field in a nonstationary state, like the squeezed state, then will the nonstationary nature of the field prevent the internal degree of freedom from approaching an equilibrium state? We have shown that <cit.> when the (mode-dependent) squeeze parameters is time-independent, the atom's internal degree of freedom still settles down to an equilibrium state in the long run. The stationary components of the covariance matrix elements or the energy flows decay exponentially fast to time-independent constants as in the previous case, but the additional nonstationary components  fall off to zero. The mechanisms that account for the late-time behavior of the stationary and the nonstationary components seem to be quite distinct. For the stationary components, it is a consequence of dissipation dynamically adapting to the driving fluctuations from the environment, but for  the nonstationary components, cancellation due to fast phase variations in the nonstationary terms plays the decisive role. In contrast, from the viewpoint of the squeezed field, what is the nature of radiation emitted from the atom, and can this outward energy flux at distances far away from the atom find a corresponding inward flux at late times such that there is no net energy output to spatial infinity, as proven for the case of a stationary field? If so, what makes it possible?\n\n\nThese questions are of particular interest  in a cosmological setting for the consideration of fundamental issues described in the Introduction.  There,  evolution of the universe parametrically drives the ambient quantum field into a squeezed state. The extent of squeezing may depend on the characteristics of the parametric process actuated by the evolution of the background universe. When an atom is coupled to such a field, emitted radiation from the atom should carry   the information of squeezing of the field, which in turn may reveal the  evolution history of the universe.\n\n\n\n\nAs a prerequisite to addressing these issues, in this paper we will examine a simpler configuration that may cover the essential features. Consider in Minkowski spacetime, a massless scalar field undergoes a parametric process such that each mode frequency changes smoothly from one constant value, say ω_i, to another ω_f, for example, as shown in Fig. <ref>. The parametric process occurs during the time interval t_a≤ t≤ t_b. In the out-region (t≥ t_b) of the process, an atom is coupled to the squeezed field at time t_0. The nonequilibrium evolution of the internal degree of freedom of the atom then generates outward radiation, which after time r will reach a detector (like a satellite around the earth) far distance r away from the atom. The detector may measure the time variation of the energy flux. The corresponding signal will be extracted and amplified to sieve out the information regarding the parametric process of the field occurred earlier.\n\n\n\n\n\n\n\n§ MASSLESS SCALAR FIELD INTERACTING WITH A HARMONIC ATOM\n\n\n\nFor the case of a massless scalar field ϕ coupled to a static atom, with its internal degree of freedom χ represented by a harmonic oscillator, we have the following Heisenberg equations of motion \n\n    χ̈̂̈(t) + ω_b^2 χ̂(t)    = e/mϕ̂(0, t) ,\n    (∂_t^2 - ∇^2  )ϕ̂(x, t)    =e δ^(3)(x) χ̂(t) ,\n\nwhere the atom is located at the origin of the spatial coordinates x in a 3+1 Minkowski spacetime. The parameter e denotes the coupling strength between the internal degree of freedom of the atom and the field, and ω_b is the bare frequency of the oscillator.  Solving the equation of  motion of the field (<ref>) yields\n\n    ϕ̂(x, t) = ϕ̂_h(x, t) + e ∫_0^tds   G^(ϕ)_R, 0(x, t ; 0, s) χ̂(s) ,\n\nwhere the homogeneous part ϕ̂_h(x, t) gives the free field while the integral expression represents the radiation field emitted by the atom. The retarded Green's function G^(ϕ)_R, 0(x, x') of the free field is defined by \n\n    G^(ϕ)_R, 0(x, x') =i θ(t-t') [ϕ̂_h(x), ϕ̂_h(x')]=1/2πθ(τ) δ (τ^2 - R^2) ,\n\nwhere x=(x,t), τ=t-t', R=|x-x'|, and θ(τ) is the Heaviside unit-step function. In the special case R → 0 which is met for a single Brownian oscillator, we instead have \n\n    G^(ϕ)_R, 0(t, t')= - 1/2πθ(τ) δ'(τ) .\n\nHere we have suppressed the trivial spatial coordinates 0. The superscript of the Green's function indicates the operator by which the Green's function is constructed, while the 0 in the subscript reminds that the Green's function of interest is associated with a free operator; otherwise it is an interacting operator. For example, G^(ϕ)_R, 0(τ) refers to the retarded Green's function of the free field while G^(χ)_R(τ) is the retarded Green's function of the interacting χ.\n\n\nPlugging Eq. (<ref>) into the equation of motion (<ref>) for the atom's internal degree of freedom, we get \n\n    χ̈̂̈(t) + ω_b^2 χ̂(t) - e^2/m∫_0^tds   G^(ϕ)_R, 0(t, s) χ̂(s) = e/mϕ̂_h(0, t) .\n\nThis is the generalized quantum Langevin equation for χ̂(t)  – it has included backreactions of the environmental field in terms of the noise force on the righthand side and the integral expression on the left hand side. As has been identified in (<ref>), the latter is the reaction force due to emitted radiation which retards the motion of the atom's internal degree of freedom.\n\n\n\n\nSuppose the free field has a Markovian spectrum, we can reduce (<ref>) into a local form\n\n    χ̈̂̈(t) + 2γχ̇̂̇(t) + ω^2_r χ̂(t) = e/mϕ̂_h(0, t) ,\n\nand the oscillation frequency is renormalized to a physical value ω_r. Since we want to examine the nature of radiation and its late time behavior in relation to the atom's internal dynamics in a self-consistent way, we need the field expression (<ref>) written in terms of the solution to the equation of the reduced dynamics (<ref>)\n\n    χ̂(t) = χ̂_h(t) + e∫_0^tds   G^(χ)_R(t-s) ϕ̂_h(0, s) ,\n\nwhere the retarded Green's function associated with χ̂ has the form\n\n    G^(χ)_R(τ)=1/mΩ e^-γτsinΩτ ,\n\nwith Ω=√(ω_r^2-γ^2), and χ̂_h(t) is the homogeneous part. Eq. (<ref>) always implies\n\n    d/dt[m/2⟨χ̇̂̇(t)⟩+mω_r/2⟨χ̂^2(t)⟩]=P_ξ(t)+P_γ(t) ,\n\nwhere P_ξ(t) is the power delivered by the free field fluctuations\n\n    P_ξ(t)=e/2⟨{ϕ̂_h(0,t), χ̇(t)}⟩ ,\n\nand P_γ(t) represents the rate of energy lost due to dissipation\n\n    P_γ(t)=-2mγ ⟨χ̇^2(t)⟩ .\n\nWe have shown <cit.> that even if the scalar field is initially in a nonstationary squeezed thermal state, the internal dynamics of the atom will still settle down to an asymptotic equilibrium state, where, in particular,  \n\n    P_ξ(t)+P_γ(t)=0 .\n\nThis is a stronger condition than (<ref>), which reflects   energy conservation of the reduced dynamics. \n\nFrom (<ref>) and (<ref>), the full interacting field is then given by\n\n    ϕ̂(x)     = ϕ̂_h(x) + e ∫_0^t dt'   G^(ϕ)_R, 0(x, t ; 0, t')[χ̂_h(t') + e∫_0^t' ds   G^(χ)_R(t'-s) ϕ̂_h(0, s)  ] .\n\nIt will turn out convenient to split the full interacting field into three physically distinct components, ϕ̂(x)=ϕ̂_h(x)+ϕ̂_tr(x)+ϕ̂_br(x) with\n\n    ϕ̂_tr(x)   =e ∫_0^t dt'   G^(ϕ)_R, 0(x, t ; 0, t') χ̂_h(t') ,\n    ϕ̂_br(x)   =e^2∫_0^t dt'   G^(ϕ)_R, 0(x, t ; 0, t')∫_0^t' ds   G^(χ)_R(t'-s) ϕ̂_h(0, s) ,\n\nwhere ϕ̂_tr(x) is the transient term associated with the atom's transient internal dynamics and ϕ̂_br(x) is the backreaction field correlated with ϕ̂_h(x) everywhere.\n\n\n\n\n\n\n\n §.§ Hadamard function\n\nAt this point, we have not specified the state of the field. For the reason that will be explained in Sec. <ref>, we assume the initial state of the field the atom interacts with is a time-independent two-mode squeezed thermal state, for which the field's density matrix has the form \n\n    ρ̂_tmst = ∏_kŜ_2^(ζ_k) ρ̂_βŜ^†_2(ζ_k)\n\nwhere ρ̂_β is the thermal density matrix of the free field at temperature T_b=β^-1, and Ŝ_2(ζ_k) is the two-mode squeeze operator, with squeeze parameter ζ_k = η_k e^iθ_k, defined by\n\n    Ŝ_2(ζ_k)=exp[ζ^*_k â_+k^â_-k^-ζ_k â_+k^†a_-k^†] .\n\nFor the reader's convenience we have collected the essential properties of the two-mode squeezed state in Appendix <ref>. Here we will assume that the squeeze parameter is mode-independent to simplify the arguments.\n\n\nIf the free field has the plane-wave expansion \n\n    ϕ̂_h(x) = ∫d^3 k/(2π)^3/2 1/√(2ω)[â_k e^ik· x + â^†_k e^-ik· x] ,\n\nwith k· x = -ω t + k·x and ω=|k|, then the free field's Hadamard function for this two-mode squeezed thermal state has the form \n\n    G^(ϕ)_H, 0(x, x') = ∫d^3 k/(2π)^3 1/4ω βω/2 e^ik·(x-x') [cosh2η e^-iω(t-t') -sinh2η e^iθe^-iω(t+t')]+ C.C. .\n\nAfter carrying out the angular integration, we arrive at the following decomposition\n\n    G^(ϕ)_H, 0(x, x') = G^(ϕ),st_H, 0(x, x') + G^(ϕ),ns_H, 0(x, x') ,\n\nwith\n\n    G^(ϕ),st_H, 0(x, x')   = ∫_-∞^∞dω/2π cosh2η βω/2 sin(ω|x-x'|)/4π|x - x'| e^-iω(t-t') ,\n    \n        G^(ϕ),ns_H, 0(x, x')   =-∫_0^∞dω/2π sinh2η βω/2 sin(ω|x-x'|)/4 π|x-x'| e^-iω(t+t')+i θ + C.C. .\n\nObserve that the Hadamard function has an extra component that is not invariant under time translation, so we call it the nonstationary component of the Hadamard function. This is distinct from the case we consider in <cit.>. The emergence of this component is a consequence of the field being squeezed. We shall discuss its dynamical origin  in Sec. <ref>. This nonstationary nature of the free field's Hadamard function will impact on the dynamical evolution of the atom's internal dynamics because the Hadamard function governs the statistics of the noise force  sourcing (<ref>), which naturally raises the concern whether the internal dynamics can ever equilibrate. As was mentioned earlier, it turns out the atom's internal motion can still relax to an  equilibrium, meaning time-translation invariant, state. Details of derivations and discussions on this point can be found in Ref. <cit.>.\n\n\nEq. (<ref>) or (<ref>) is the essential ingredient used to express the Hadamard function G^(ϕ)_H(x, x') of the interacting field, which we will need to evaluate the stress-energy tensor. Following the decomposition laid out before (<ref>), the interacting field's Hadamard function is given by\n\n    G^(ϕ)_H (x,x')     = 1/2⟨{ϕ̂_h(x), ϕ̂_h(x') }⟩ + 1/2[⟨{ϕ̂_h(x), ϕ̂_br(x')}⟩ + ⟨{ϕ̂_br(x), ϕ̂_h(x')}⟩]\n                    + 1/2⟨{ϕ̂_br(x), ϕ̂_br(x') }⟩ + 1/2⟨{ϕ̂_tr(x), ϕ̂_tr(x') }⟩ ,\n\nwhere\n\n    1/2⟨{ϕ̂_h(x), ϕ̂_h(x') }⟩    = G^(ϕ)_H, 0(x,x') , \n    1/2⟨{ϕ̂_h(x), ϕ̂_br(x')}⟩   =e^2∫_0^t' ds_1'  G_R, 0^(ϕ)(x', t' ;0, s_1')∫_0^s_1' ds_2' G_R^(χ)(s_1' - s_2') G_H, 0^(ϕ) (x, t; 0, s_2') ,\n    1/2⟨{ϕ̂_br(x), ϕ̂_br(x') }⟩   =e^4∫_0^t ds_1∫_0^t'ds_1'  G_R, 0^(ϕ)(x,t;0, s_1) G^(ϕ)_R, 0 (x', t'; 0, s_1')\n               ×∫_0^s_1 ds_2∫_0^s_1' ds_2'  G_R^(χ)(s_1 - s_2)G_R^(χ)(s_1' - s_2') G^(ϕ)_H, 0(0, s_2 ; 0, s_2') ,    \n    1/2⟨{ϕ̂_tr(x), ϕ̂_tr(x') }⟩   =e^2/2∫_0^t ds∫_0^t' ds'  G_R, 0^(ϕ)(x,t; 0 , s) G_R, 0^(ϕ)(x', t'; 0 , s')  ⟨{χ̂_h(s) , χ̂_h (s') }⟩ .\n\nThe second group inside the square brackets is of special interest because it describes the correlation between the radiation field and the free field at any location outside the atom. We do not see such counterpart in classical electrodynamics because in classical field theory, there is no vacuum state to establish any correlation with the radiation field. Here the correlation must be present because 1) the internal dynamics of the atom, which emits the radiation, is driven by the free field at the atom's location and 2) the free field has nonvanishing correlation among any spacetime interval. Note that we are in the Heisenberg picture, so the expectation values are evaluated with respect to the initial state of both subsystems. The contribution in (<ref>) can be ignored at late times due to its transient nature. In addition, we also note that these four components are at most linearly proportional to G^(ϕ)_H, 0(x,x'). Thus, at least before t-r≫γ^-1, the interaction field is expected to behave like a squeezed field to some extent.\n\n\n\nFor later convenience, we introduce a shorthand notation for an expression which comes up frequently,\n\n    L_ω(x, t) =  ∫_0^t ds_1   G^(ϕ)_R, 0(x, t-s_1)∫_0^s_1 ds_2   G^(χ)_R(s_1 - s_2) e^-iω s_2 .\n\nAfter we carry out the integrations, we find its explicit form is given by\n\n    L_ω(x, t)   =θ(t - r) G_R^(χ)(ω) {G_R, 0^(ϕ)(x; ω) e^-iω t - e^-γ(t - r)/4πΩ r[(ω+iγ) cosΩ(r-t) + i Ω sinΩ(r-t)] } ,\n\nwhere we have used the identity for the Fourier transform of G_R, 0^(ϕ)(x,τ;0, 0)\n\n    G_R, 0^(ϕ)(x; ω)=e^iω r/4π r\n    \nwith r=|x|. The convention of the Fourier transformation we adopt is\n\n    f(t)=∫_-∞^∞dω/2π f̃(ω) e^-iω t .\n\nAt times t≫ r, we find that the dominant term in (<ref>) is given by\n\n    L_ω(x, t) =θ(t - r) G_R^(χ)(ω) G_R, 0^(ϕ)(x; ω)  e^-iω t .\n \nThese are convenient snippets that will greatly simplify the analysis of the late-time behavior of the expectation values of the energy-momentum stress tensor of the interacting field. Henceforth, we will proceed with the analysis separately for the contributions due to the stationary and the nonstationary components of G^(ϕ)_H, 0(x,x').\n\n\nAt late times, the explicit expressions for the stationary and nonstationary components of the Hadamard functions of the free field and the interacting field ϕ become relatively simple. The interacting field's Hadamard function can likewise be decomposed into a stationary and a nonstationary component, G^(ϕ)_H(x, x') = G^(ϕ),st_H(x, x') + G^(ϕ),ns_H(x, x'), and\n\n    G^(ϕ),st_H(x, x')   = G^(ϕ),st_H, 0(x, x')+e^2∫_-∞^∞dω/2π {G^(ϕ),st_H, 0(x, 0;ω) G_R^(χ)*(ω) G_R, 0^(ϕ)*(x'; ω). \n                                     +. G^(ϕ),st_H, 0(x', 0;ω) G_R^(χ)(ω) G_R, 0^(ϕ)(x; ω)}  e^-iω (t-t')+C.C.\n             +e^2∫_-∞^∞dω/2π cosh2η βω/2 G^(ϕ)_R, 0(x, ω)  G^(ϕ) *_R, 0(x', ω) ImG^(χ)_R(ω) e^-iω(t-t')+C.C. ,and\n        G^(ϕ),ns_H(x, x')   =G^(ϕ), ns_H, 0(x, x')-e^2∫_0^∞dω/2π sinh2η βω/2 G^(χ)_R(ω)\n                       ×{sin(ω|x|)/4 π|x| G^(ϕ)_R, 0(x'; ω)+sin(ω|x'|)/4 π|x'| G^(ϕ)_R, 0(x; ω)} e^-iω (t+t')+iθ+C.C.\n           -e^4∫_0^∞dω/2π ω/4π sinh2η βω/2 G^(χ) 2_R (ω) G^(ϕ)_R, 0(x; ω)  G^(ϕ)_R, 0(x'; ω) e^ -i(ω(t+t')+iθ+C.C. ,\n\nwhere\n\n    G^(ϕ),st_H, 0(x, 0;ω)≡G^(ϕ),st_H, 0(x;ω)=cosh2η βω/2 sin(ω|x|)/4π|x|=cosh2η βω/2 ImG_R, 0^(ϕ)(x; ω) .\n\nThe energy momentum stress tensor of the interacting field is then constructed via the Hadamard function G^(ϕ)_H(x, x').  Analyses of the late-time energy flow of the field at distances far away from the atom resulting from the atom-field interaction are contained in Appendices <ref> and <ref>.  A general discussion of the spatial-temporal behavior of the stress-energy tensor due to the radiation field emitted from the atom follows in the next section.\n\n\n\n\n\n\n\n\n\n\n\n\n§ STRESS-ENERGY TENSOR DUE TO THE RADIATION FIELD\n\nThe expectation value of the energy-momentum stress tensor due to the radiation field is defined by\n\n    ⟨ΔT̂_μν(x)⟩ = lim_x'→ x{∂^2/∂ x^μ∂ x'^ν -  1/2g_μν g^αβ∂^2/∂ x^α∂ x'^β}[  G^(ϕ)_H (x,x') - G^(ϕ)_H, 0(x,x') ]\n\nwith the signature of g_μν being (-,+,+,+). Here we have subtracted off the contribution purely from the free field, which is irrelevant to the atom-field interaction. Due to symmetry, it has no dependence on the azimuthal angle ϑ and the polar angle φ of the spherical coordinate system, so the stress-energy tensor already reduces to\n\n    L1.0T⟨ΔT̂_μν⟩ = \n        ⟨ΔT̂_tt⟩   ⟨ΔT̂_tr⟩    0     0 \n    ⟨ΔT̂_rt⟩   ⟨ΔT̂_rr⟩    0     0 \n    \n            0     0      0     0 \n    \n            0     0     0      0 \n         .\n\nThen we will focus on the components ⟨ΔT̂_tr⟩ and ⟨ΔT̂_tt⟩ that are relevant to our following discussions.\n\n\n\n\n\n\n\nHere the analysis is not limited to the large-distance and the late-time limits, so that we can have a more complete, global view of the energy flow and energy density of the field caused by the atom-field interaction. We will put the analysis in those specific regimes in Appendices <ref> and <ref>.\n\n\nSince in our configuration the coupling between the harmonic atom and the massless scalar field takes a different form from that between the point charge and the electromagnetic fields, it would be more illustrative if we first quickly go over the elementary derivations of the continuity equation and the total atom-field Hamiltonian in the classical regime to highlight their differences.\n\nFrom the equation of motion of the scalar field (<ref>), if we multiply both sides by ∂_tϕ, we obtain a local form of the continuity equation\n\n    ∂_tu_ϕ+∇·S_ϕ=𝗉 ∂_tϕ ,\n\nwhere 𝗉(x,t)=e δ^(3)(x) χ(t) serves as the point dipole associated with the atom, and we identify the field energy density u_ϕ and the field momentum density S_ϕ respectively by\n\n    u_ϕ(x,t)   =1/2[∂_tϕ(x,t)]^2+1/2[∇ϕ(x,t)]^2 ,   S_ϕ(x,t)   =-∂_tϕ(x,t) ∇ϕ(x,t) .\n\nThe unusual issue with the right hand side of the continuity equation (<ref>) is best appreciated when we compare with the corresponding equation for the electromagnetic fields\n\n    ∂_t u+∇·S   =-J·E ,      with   u   =1/2E^2+1/2B^2 ,     S   =E×B ,\n\nwhere J is the current density and the corresponding current is equal to eẋ for a point charge at the location x.  The electric field E field is defined by E=-∇A^0-∂_tA and the magnetic field B by B=∇×A. Here A^0 is the scalar potential and A is the vector potential. Thus the right hand side of (<ref>) should bear a similar interpretation as -J·E, which is usually understood as the dissipation of the field energy due to the work done by the field on the charge. That is, it is the opposite of the power delivered by the Lorentz force. However, there are a few subtle catches: 1) In classical field theory, we seldom consider the free field component of the field equation, and we never have vacuum field fluctuations, so the electromagnetic fields in (<ref>) are usually assumed to be the field generated by the charge. In contrast, the quantum scalar field ϕ under our consideration is a full interacting field, comprising of the free field and the radiation field emitted by the atom. Thus the right hand side of (<ref>) will contain an extra contribution associated with the free field fluctuations. 2) The right hand side of (<ref>) does not correspond to the net power delivered by the field to the internal degree of freedom of the atom, which is e ϕ(0,t) ∂_tχ(t), apart from a renormalization contribution, according to the right hand side of (<ref>). Then the interpretation of the right hand of (<ref>) is not so straightforward, even though it has a form of the dipole interaction, similar to the right hand side of (<ref>).\n\n\n\n\n\n\nWe may trace such a feature to the Hamiltonian. The Hamiltonian H_χϕ associated with the Lagrangian of the atom-field interacting system\n\n    L_χϕ=m/2 χ̇^2-mω_b^2/2 χ̇^2+∫_Vd𝒱 e δ(x)χ(t)ϕ(x,t)+∫_Vd𝒱 {1/2[∂_tϕ(x,t)]^2-1/2[∇ϕ(x,t)]^2} ,\n\nunder our consideration is given by\n\n    H_χϕ=m/2 χ̇^2+mω_b^2/2 χ̇^2-e χ(t)ϕ(0,t)+∫_Vd𝒱 {1/2[∂_tϕ(x,t)]^2+1/2[∇ϕ(x,t)]^2} ,\n\nwhere we implicitly assume that χ̇(t) and ϕ̇(x,t) are functions of the respective canonical momenta, p(t) and π(x,t). The quantity V denotes the whole spatial volume on a fixed time slice. Since the whole atom-field system forms a closed system, the total energy is conserved, so we have dH/dt=0,\n\n    d/dtH_χϕ(t)=0   =χ̇(t){mχ̈(t)+mω_b^2χ(t)-e ϕ(x,0)}\n                       +∫_Vd𝒱 [-e δ(x)χ(t) ∂_tϕ(x,t)+d/dt{1/2[∂_tϕ(x,t)]^2+1/2[∇ϕ(x,t)]^2}] .\n\nNote how the derivative of the interaction term is distributed, and further observe that the contribution inside of the first pair of curly brackets gives zero, following the equation of motion (<ref>). It actually has a nice interpretation. Following the derivations of (<ref>) and (<ref>), it accounts for the reduced dynamics of the atom's internal degree of freedom, and, from the atom's perspective, describes the energy exchange between the atom and the surrounding quantum field.\n\n\n\nThe integral on the right hand side of  (<ref>), on the other hand, describes the energy exchange from the field's perspective, and thus gives zero too. In the integrand, we see the presence of the same dipole interaction term e δ(x)χ(t) ∂_tϕ(x,t) that appears on the righthand side of (<ref>). At first sight it may seem odd that the dipole interaction term is solely responsible for the change of the field energy. However, we can further show\n\n    d/dtH_χϕ(t)=0=∫_Vd𝒱 ∇·[∇ϕ(x,t) ∂_tϕ(x,t)]=-∮_∂ Vd𝒜·S(x,t) .\n\nIt says that there is no flux entering from or leaving to spatial infinity because the boundary ∂ V of the space volume V is at spatial infinity. It is a rephrase of energy conservation in a closed system, so there is no inconsistency. On the other hand, Eq. (<ref>) is too restrictive because V is the total volume. The differential form of the continuity equation (<ref>) is more suitable to see the energy distribution in the field.\n\n\n\nIn contrast to (<ref>), the Hamiltonian for the interacting system of a point charge and the electromagnetic field is\n\n    H_xA=m_b/2 ẋ^2+m_bω^2/2 x^2+1/2∫_Vd𝒱 (E^2+B^2) .\n\nIt does not have the interaction term manifestly if the Hamiltonian is not expressed in terms of the canonical momentum of the charge. However, it is consistent with the observation that -J·E is opposite to the power delivered by the Lorentz force.\n\n\n\nNow we discuss the general result of ⟨ΔT̂_μν⟩ that will be valid for t>r at any location distance r away from the atom, so we come back to the manipulation of quantum operators. We first compute ⟨ΔT̂_tr⟩.\n\n\n\n §.§ General behavior of field energy flux \n\nIf we write ϕ̂_r(x,t) as\n\n    ϕ̂_r(x,t)=e∫_0^tds G_R,0^(ϕ)(x,t;0,s) χ̂(s)=e/4π r θ(t-r) χ̂(t-r) ,\n\nwhich explicitly shows that the radiation field is a retarded Coulomb-like field emitted by a source at an earlier time t-r. Note that the simple expression of the radiation field like (<ref>) is not obtainable if the field has a non-Markovian spectrum. \n\n\nWith the help of (<ref>), we obtain\n\n    1/2⟨{∂_tϕ̂_r(x,t), ∂_rϕ̂_r(x,t)}⟩   =-(e/4π r)^2⟨χ̂'^2(t-r)⟩-(e/4π r)^21/2r⟨{χ̂'(t-r), χ̂(t-r)}⟩ ,\n\nfor t>r, where a prime denotes taking the derivative with respect to the function's argument. If we compute the energy flow associated (<ref>), across any spherical surface of   radius r centered at the atom, we get\n\n    ∫_∂ Vd𝒜 1/2⟨{∂_tϕ̂_r(x,t), ∂_rϕ̂_r(x,t)}⟩   =-2mγ ⟨χ̂'^2(t-r)⟩-mγ/r ⟨{χ̂'(t-r), χ̂(t-r)}⟩\n       =P_γ(t-r)-mγ/r ∂_t⟨χ̂^2(t-r)⟩ ,\n\nwhere we have used the substitution e^2=8πγ m. The first term has a special significance. From <cit.>, we know that P_γ(t) is the energy the atom's internal degree of freedom loses to the surrounding field due to damping. Thus the first term tells that the energy lost by the atom at time t-r takes time r to propagate to a location at a distance r away from the atom. It is the only contribution in (<ref>) that may survive at spatial infinity.\n\n\n\nThe contribution from the cross terms need a little more algebraic manipulations, but it gives\n\n    1/2⟨{∂_tϕ̂_h(x,t), ∂_rϕ̂_r(x,t)}⟩+1/2⟨{∂_tϕ̂_r(x,t), ∂_rϕ̂_h(x,t)}⟩\n       =1/4π r^2 P_ξ(t-r)-e^2/4π r^2∂/∂ t∫_0^t-rds G_R^(χ)(t-r-s) G_H,0^(ϕ)(x,t;0,s) ,\n\nin which the integral in the last expression is nothing but\n\n    e^2∫_0^t-rds G_R^(χ)(t-r-s) G_H,0^(ϕ)(x,t;0,s)=e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩ .\n\nHere P_ξ(t) is the power the free quantum field fluctuations deliver to the atom's internal dynamics at time t at the atom's location. Then we find the incoming energy flow given by \n\n    ∫_∂ Vd𝒜 [1/2⟨{∂_tϕ̂_h(x,t), ∂_rϕ̂_r(x,t)}⟩+1/2⟨{∂_tϕ̂_r(x,t), ∂_rϕ̂_h(x,t)}⟩]\n       =P_ξ(t-r)-∂/∂ t[e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩] .\n\nCombining (<ref>) and (<ref>), we thus have \n\n    ⟨ΔT̂_tr⟩=1/4π r^2{P_ξ(t-r)+P_γ(t-r)-∂/∂ t[mγ/r ⟨χ̂^2(t-r)⟩+e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩]} ,\n\nFrom the relaxation of the reduced dynamics of the atom's internal degree of freedom, outlined in the beginning of Sec. <ref>, we  learn that the internal dynamics will reach equilibrium, where P_ξ(t)+P_γ(t)=0 for t≫γ^-1. Hence, from (<ref>), we easily conclude that, for a fixed r, when t-r is much greater than the relaxation time scale, the sum of the dominant terms P_ξ(t-r)+P_γ(t-r) vanishes. At large distance away from the atom, the remaining terms are very small, decaying at least like 1/r^3. It is consistent with our results in Sec. <ref>, where we explicitly show that they actually give zero at late times. Alternatively we may deduce the same conclusion here, since 1) ⟨χ̂^2(t)⟩ will approach a constant at late times as the  atom's internal dynamics  asymptotically reaches an equilibrium, and 2) with the help of the explicit expression\n\n    e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩=-e^2/4π r∫_0^∞dω/2π βω/2 cosh2η∫_0^t-rds G_R^(χ)(t-r-s) sinω r/4π r^2 cosω(t-s) ,\n\nit is not difficult to see that the time derivative of the last term inside the square brackets will vanish at late times. \n\n\nThus, the detector away from the atom will not measure any radiation energy flux from the stationary atom at late times even though the atom is coupled to a nonstationary squeezed state.\n\n\n\n\n\n\n §.§ General behavior of field energy density \n\n\nIt is also of interest to examine the change of the field energy density at distances far away from the atom resulting from their mutual interactions.  Conceptually, the atom's internal dynamics will send out to spatial infinity  spherical waves centered at the location of the atom. Due to the quantum nature of the internal dynamics, this radiation wave in general has a random phase and its magnitude is inversely proportional to the distance to the atom. Following our previous discussion, a detector at large but fixed distance away from the atom will receive a net outward energy flux in the beginning, and then it will find the magnitude of the flux rapidly falls off to zero with time. After all these activities settle down, will the earlier energy flux leave any footprint in the space surrounding the atom, say, by shifting the local field energy density, albeit almost imperceptibly? This is what we try to find out in this section.\n\n\n\n\nIn the same manner, we will re-write ⟨Δ T_tt⟩, following (<ref>). Other than the overall factor 1/2, we first show\n\n    1/2⟨{∂_tϕ̂_r(x,t), ∂_tϕ̂_r(x,t)}⟩+1/2⟨{∂_rϕ̂_r(x,t), ∂_rϕ̂_r(x,t)}⟩=-2×1/4π r^2{P_γ(t-r)+∂/∂ r[mγ/r ⟨χ̂^2(t-r)⟩]} ,\n\nwhere ∂_tχ(t-r)=-∂_rχ(t-r). Here due to the minus sign up front, this contribution tends to grow to a positive value at late times. We further note that the same expression P_γ(t-r) also appears in the component (<ref>) of ⟨ΔT̂_tr(t)⟩ that is purely caused by the radiation field. Thus, we see the outward energy flux due to (<ref>) imparts field energy into the space around the atom.\n\n\nFor the cross terms, we obtain\n\n    2×1/2 ⟨{∂_tϕ̂_h(x,t), ∂_tϕ̂_r(x,t)}⟩+2×1/2 ⟨{∂_rϕ̂_h(x,t), ∂_rϕ̂_r(x,t)}⟩\n       =-2×1/4π r^2{P_ξ(t-r)+∂/∂ r[e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩]} .\n\nFollowing the same argument, the inward energy flux from (<ref>) on the other hand is prone to take away the field energy in the surrounding space.\n\n\nTogether we thus find that the net field energy density outside the atom is given by\n\n    ⟨ΔT̂_tt⟩=-1/4π r^2{P_ξ(t-r)+P_γ(t-r)+∂/∂ r[mγ/r ⟨χ̂^2(t-r)⟩+e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩]} ,\n\nfor t>r>0. This looks very similar to (<ref>), and can be the consequence of the continuity equation. The dominant term in Eq. (<ref>) will vanish at late times, as a consequences of the relaxation of the internal dynamics of the atom, and the behavior of (<ref>) due to the appearance of t-r. Following our earlier arguments, the remaining term, ⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩, on the other hand, becomes a constant at late times, which falls off at least like 1/r^3, as is explicitly shown in Sec. <ref>.\n\n\nIndeed, Eqs. (<ref>) and (<ref>) enable us to verify the continuity equation\n\n    1/r^2∂/∂ r(r^2⟨ΔT̂_tr⟩)   =1/4π r^2{∂_rP_ξ(t-r)+∂_rP_γ(t-r)-∂^2/∂ t∂ r[mγ/r ⟨χ̂^2(t-r)⟩+e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩]}\n       =1/4π r^2{-∂_tP_ξ(t-r)-∂_tP_γ(t-r)-∂^2/∂ t∂ r[mγ/r ⟨χ̂^2(t-r)⟩+e/2⟨{χ̂(t-r), ϕ̂_h(x,t)}⟩]}\n       =∂/∂ t⟨ΔT̂_tt⟩ ,\n\nfor r>0. To include r=0, the location of the atom, we need the form (<ref>) which also takes into account the energy flow into and out of the atom, from the scalar field perspective.\n\n\nFrom the considerations presented so far we may now see better how the radiation flux, generated by the internal dynamics of the atom, propagates outward and at the same time intakes the field energy in space outside the atom. Meanwhile,  due to the remarkable correlation between the quantum radiation field and the free quantum field, there exists an inward flux. On its way toward the atom, it pulls out field energy stored in the proximity of the atom. From this hindsight, it can be understood that the net power e ϕ(0,t)χ̇(t) delivered by the quantum field to the atom is not equal to the rate of work done to the field e ϕ̇(0,t)χ(t), as can be inferred from (<ref>). Otherwise ⟨ΔT̂_tr⟩ in (<ref>) will simply be proportional to P_ξ(t-r)+P_γ(t-r). Their difference accounts for the field energy density stored in the space  for the configuration we have studied.\n\t\nIn summary,  the results in this section tell us that at late times the observer will not measure any net energy flow associated with the radiation emitted from the atom driven by the squeezed quantum field, but the observer can still detect a constant radiation energy density, which is related to the squeeze parameter. However, a restrictive condition is that the residual radiation energy density is of the near-field nature, and it  falls off with the distance to the atom like 1/r^3. Thus its detection can be difficult at large distances, unless the squeeze parameter is large.\n\n\nEven with these difficulties, we can still locally identify the squeezing via the response of the atom interacting with the squeezed field.\n\n\nIn the next section we shall discuss how the squeeze parameter depends on the parametric process the quantum field has experienced, such that we may acquire certain information about the process once we have measured the squeeze parameter.\n\n\n\n\n\n\n\n\n§ FUNCTIONAL DEPENDENCE OF THE SQUEEZE PARAMETER ON THE PARAMETRIC PROCESS\n\nNow we turn to how we may possibly extract from the behavior of the squeeze parameter the information of the parametric process that occurs earlier. To be specific, consider the simple case that a massless quantum Klein-Gordon field in flat spacetime undergoes a parametric process such that the frequency of mode k transits smoothly from one constant value ω_i for 0≤ t≤ t_a to another constant ω_f for t≥ t_b>t_a. \n\n\nWe would like first to show that the quantum field in the out-region behaves as if it is in its squeezed thermal state with a time-independent squeeze parameter ζ_k if the initial state of the field at t=0 is a thermal state. Then we express the squeeze parameter in terms of the Bogoliubov coefficients,  a common tool to treat the dynamics of the quantum field in a parametric (time-varying) process. We will also link the squeeze parameter to the fundamental solutions of the equation of motion of the field, in which  information of the parametric process is embedded.\n\n\n\nWe work with the Heisenberg picture, so the field remains in its initial state at t=0. Formally we can expand the field operator ϕ̂(x) in terms of different sets of mode functions. In the out-region, two convenient choices are\n\n    u_k^in(x)   =1/√(2ω_i) e^ik·x[d_k^(1)(t)-i ω_i d_k^(2)(t)] ,   u_k^out(x)   =1/√(2ω_f) e^ik·xe^-iω_ft ,\n\nwhere d_k^(i)(t) satisfies the equation d̈_k^(i)+ω^2(t) d_k^(i)(t)=0, and u_k^out(x) is the standard  plane-wave mode function in the out-region, while u_k^in(x) represents the mode function which evolves from the plane-wave mode function in the in-region.  Thus the field operator may have the expansion\n\n    ϕ̂(x)   =∑_kâ_k^u_k^in(x)+â_k^†u_k^in*(x) ,   \n    ∑_kb̂_k^u_k^out(x)+b̂_k^†u_k^out*(x) ,      ∑_k   =∫d^3k/(2π)^3/2 ,\n\nin the out-region.\n\n\n\n\n\n\n\nWe further suppose (b̂_k^,b̂_k^†) are related to (â_k^,â_k^†) by\n\n    b̂_+k^=α_+k^ â_+k^+β_-k^* â_-k^† ,\n\nwhence the completeness condition implies that the Bogoliubov coefficients α_k, β_k can be parametrized by\n\n    α_k   =coshη_k ,   β_-k^*   =-e^iθ_k sinhη_k ,\n\nsuch that \n\n    b̂_+k^=coshη_k â_+k^-e^iθ_k sinhη_k â_-k^†=Ŝ_2^†(ζ_k) â_+k^ Ŝ_2^(ζ_k) .\n\nThe parametrization (<ref>) can be alternatively implemented by the two-mode squeeze operator Ŝ_2^†(ζ_k). We summarize its properties in Appendix <ref>.\n\n\n\nThen a quantity of the field like the Hadamard function in the out-region can be cast into\n\n    1/2⟨in|{ϕ̂(x), ϕ̂(x')}|in⟩\n       =∑_k1/2ω_f[ 1/2⟨in|{b̂_k^, b̂_k^}|in⟩ e^ik·(x+x')e^-iω_f(t+t')+1/2⟨in|{b̂_k^, b̂_-k^}|in⟩ e^ik·(x-x')e^-iω_f(t+t').\n                   +.1/2⟨in|{b̂_k^, b̂_k^†}|in⟩ e^ik·(x-x')e^-iω_f(t-t')+1/2⟨in|{b̂_k^, b̂_-k^†}|in⟩ e^ik·(x+x')e^-iω_f(t-t')+C.C.]\n       =∑_k1/2ω_f e^ik·(x-x')[ 1/2⟨ζ_k,in^tmsq|{â_k^, â_-k^}|ζ_k,in^tmsq⟩ e^-iω_f(t+t')+1/2⟨ζ_k,in^tmsq|{â_k^, â_k^†}|ζ_k,in^tmsq⟩ e^-iω_f(t-t').\n                           +.C.C.] ,\n\nwhere |ζ_k,in^tmsq⟩=Ŝ_2^(ζ_k) |in⟩ is the two-mode squeezed state of the initial in-state |in⟩. Thus Eq. (<ref>) gives a Hadamard function in the two-mode squeezed in-state. Although here we use the pure state form, the result can be easily adapted for a mixed state.\n\n\n\n\nOn the other hand, the same Hadamard function can be expressed in terms of the in-mode functions,  by the expansion \n\n    1/2⟨in|{ϕ̂(x), ϕ̂(x')}|in⟩\n       =∑_k1/2ω_ie^ik·(x-x')(N_k^(β)+1/2)[d_k^(1)(t)-i ω_i d_k^(2)(t)][d_k^(1)(t')+i ω_i d_k^(2)(t')]+C.C. .\n\nIf the in-state is a thermal state, then ⟨in|{â_k^, â_k^†}|in⟩ is understood in terms of the trace average, and gives 2N_k^(β)+1, with N_k^(β) being the average number density of the thermal state at temperature β^-1,\n\n    N_k^(β)=1/e^βω_i-1 .\n\nObserve the structural similarities between (<ref>) and (<ref>). \n\n\n\n\nTo make them more revealing, we evaluate the expectation values on the righthand side of (<ref>),\n\n    ⟨in|{b̂_+k^, b̂_+k^}|in⟩   =0 ,   ⟨in|{b̂_+k^, b̂_-k^}|in⟩   =(α_+k^β_+k^*+α_+k^β_-k^*)(2N_k^(β)+1) ,\n    ⟨in|{b̂_+k^, b̂_-k^†}|in⟩   =0 ,   ⟨in|{b̂_+k^, b̂_+k^†}|in⟩   =(|α_+k^|^2+|β_-k^|^2)(2N_k^(β)+1) .\n\nThus, Eq. (<ref>) becomes\n\n    1/2⟨in|{ϕ̂(x), ϕ̂(x')}|in⟩\n       =∑_k1/2ω_f e^ik·(x-x')(N_k^(β)+1/2)[ 2α_k^β_k^* e^-iω_f(t+t')+(|α_k^|^2+|β_k^|) e^-iω_f(t-t')+C.C.] .\n\nComparing this equation with (<ref>) we find\n\n    |α_k^|^2+|β_k^|^2   =1/2 [ω_f/ω_i d_k^(1)2(t_f)+ω_fω_i d_k^(2)2(t_f)+1/ω_fω_i ḋ_k^(1)2(t_f)+ω_i/ω_f ḋ_k^(2)2(t_f)] ,\n    \n    \t2α_k^β_k^*   =1/2ω_iω_f [+i ω_f d_k^(1)(t_f)+ω_iω_f d_k^(2)(t_f)-ḋ_k^(1)(t_f)+i ω_i ḋ_k^(2)(t_f)]\n                           ×[-i ω_f d_k^(1)(t_f)+ω_iω_f d_k^(2)(t_f)+ḋ_k^(1)(t_f)+i ω_i ḋ_k^(2)(t_f)] .\n\nThese results easily enable us to find the Bogoliubov coefficients α_k, β_k once we have the fundamental solutions d_k^(i)(t) with i=1, 2.\n\n\n\nFollowing the same arguments leading to (<ref>) and (<ref>), if we compute ⟨ϕ̂^2(x)⟩, ⟨π̂^2(x)⟩ and ⟨{ϕ̂(x), π̂(x)}⟩ in the out-region, we obtain that, for each mode\n\n    cosh2η_k   =1/2[1/ω_fω_i ḋ_k^(1)2(t)+ω_i/ω_f ḋ_k^(2)2(t)+ω_f/ω_i d_k^(1)2(t)+ω_fω_i d_k^(2)2(t)] ,\n    cos(θ_k-2ω_ft) sinh2η_k   =1/2[1/ω_fω_i ḋ_k^(1)2(t)+ω_i/ω_f ḋ_k^(2)2(t)-ω_f/ω_i d_k^(1)2(t)-ω_fω_i d_k^(2)2(t)] ,\n    sin(θ_k-2ω_ft) sinh2η_k   =-[1/ω_i d_k^(1)(t)ḋ_k^(1)(t)+ω_i d_k^(2)(t)ḋ_k^(2)(t)] ,\n\nexplicit relations between the squeeze parameters and the fundamental solutions. Here π̂(x) is the canonical momentum conjugated to ϕ̂(x). Eqs. (<ref>)–(<ref>) clearly tell how squeezing may dynamically arise from the parametric process of the field.\n\n\nAs a consistency check, we substitute the coefficients α_k, β_k on the righthand side by (<ref>), and obtain\n\n    |α_k^|^2+|β_k^|   =cosh2η_k ,   2α_k^β_k^*   =-e^iθ_ksinh2η_k .\n\nIn fact, (<ref>) and (<ref>) only determine α_k, β_k up to a phase factor or a rotation, which we have been ignoring. For example, from (<ref>), we may let\n\n    α_k   =1/2√(ω_iω_f)[+i ω_f d_k^(1)(t_f)+ω_iω_f d_k^(2)(t_f)-ḋ_k^(1)(t_f)+i ω_i ḋ_k^(2)(t_f)] ,\n    β_k   =1/2√(ω_iω_f)[-i ω_f d_k^(1)(t_f)+ω_iω_f d_k^(2)(t_f)+ḋ_k^(1)(t_f)+i ω_i ḋ_k^(2)(t_f)] ,\n\nand then we can directly show that (<ref>) is recovered and \n\n    |α_k^|^2-|β_k^|^2=d_k^(1)(t_f) ḋ_k^(2)(t_f)-ḋ_k^(1)(t_f)d_k^(2)(t_f)=1 .\n\nHowever, obviously in this case α_k is not real, as (<ref>) implies. \n\n\n\n\n\n\nWe may recover the missing phase by putting back the rotation operator we have ignored all along. To be more specific, for example, let the rotation operator R̂ be given by\n\n    R̂(Φ_i)=exp[iΦ_i(â_i^†â_i^+1/2)] .\n\nWe find R̂^†(Φ_i) â_1R̂(Φ_1)=â_1 e^iΦ_1. Then,  depending on the order of the rotation operator and the squeeze operator, we may have either\n\n    Ŝ_2^†(ζ)R̂^†(Φ_i) â_1R̂(Φ_i)Ŝ_2^(ζ)   =e^iΦ_1coshη â_1-e^iΦ_1e^iθsinhη â_2 ,\n    \torR̂^†(Φ_i)Ŝ_2^†(ζ) â_1Ŝ_2^(ζ)R̂(Φ_i)   =e^iΦ_1coshη â_1-e^iΦ_2e^iθsinhη â_2 .\n\nWe see that there is always a phase ambiguity. In both cases, from (<ref>) and (<ref>), we find α_k will be complex in general, but in principle, we may factor out the overall phase factor for each mode to render α_k real.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBefore we proceed further with our analysis, let us examine a few illustrative examples. \n\n\n  \nCase 1\nConsider the parametric process in which the squared frequency ω^2(t) varies with time according to\n\n    ω^2(t)=ω_i^2 ,   0≤ t≤ t_a ,\n    ω_i^2+(ω_f^2-ω_i^2) t-t_at_b-t_a ,   t_a≤ t≤ t_b ,\n    ω_f^2 ,   t≥ t_b ,\n\nThat is, ω^2(t) is a piecewise-continuous function of time. The time evolution of d_k^(1)(t), d_k^(2)(t) are shown in Fig. <ref>-(b) and -(c), where we observe that the oscillation amplitudes of the two fundamental solutions change by different amounts, implying the occurrence of quantum squeezing. Notice in Fig. <ref>-(d), as t≥ t_b the squeeze parameter η_k becomes a constant,  squeezing is very small because cosh2η_k∼1. This small squeezing results from the slow transition rate in the parametric process. The plots (e) and (f) show oscillations of frequency 2ω_f, consistent with expectation. However, from these plots it is hard to tell whether θ_k is time independent. We will take another approach to show it later.\n\n\n\n\n\n\n\n  \nCase 2 In the second example, we choose a non-monotonic parametric process,\n\n    ω^2(t)=ω_i^2 ,   0≤ t≤ t_a ,\n    ω_i^2+(ω_f^2-ω_i^2) sin^2[t-t_at_b-t_anπ2] ,   t_a≤ t≤ t_b ,\n    ω_f^2 ,   t≥ t_b .\n\nHere n,  an odd integer, gives the number of oscillations of the transition process. Thus the frequency variation is not monotonic. The corresponding plots are shown in Fig. <ref>. Since both processes, though continuous, are not smooth, it allows us to clearly see when the transitions start and end. Compared with Case 1, the non-monotonic transition introduces tumultuous behavior in the fundamental solutions d_k^(i) during the transition, in Fig. <ref>-(b) and -(c), but right after t=t_b, the out mode immediately oscillates at frequency ω_f. Again,  we can see the time-independence of η_k in the out-region.\n\n\n\n\nFor the simple case we consider here, let us carry out some analysis about the time dependence of the squeeze parameter in the out-region. We may write d_k^(i)(t) for t≥ t_b as\n\n    d_k^(1)(t)=d_k^(1)(t_b) cosω_f(t-t_b)+d_k^(2)(t_b) 1/ω_f sinω_f(t-t_b) ,\n    \n    \td_k^(2)(t)=d_k^(1)(t_b) 1/ω_f sinω_f(t-t_b)+d_k^(2)(t_b) cosω_f(t-t_b) .\n\nThe amplitudes of d_k^(i)(t) in the out-region are determined by\n\n    d_k^(1)(t):       [d_k^(1)2(t_b)+d_k^(2)2(t_b)/ω_f^2]^1/2 ,      and      d_k^(2)(t):       [d_k^(1)2(t_b)/ω_f^2+d_k^(2)2(t_b)]^1/2 ,\n\nwhich in turns are determined by the values of the fundamental solution at the end of the parametric process. We readily find that d_k^(1)(t)ḋ_k^(1)(t)-ḋ_k^(1)(t)d_k^(1)(t)=1 for all t even for the parametric process via the Wronskian of the differential equation the mode function satisfies.\n\n\n\n\nAccording to Eqs. (<ref>), we can show\n\n    |α_k^(t)|^2+|β_k^(t)|^2=|α_k^(t_b)|^2+|β_k^(t_b)|^2\n\nfor all t≥ t_b. Since |α_k^|^2+|β_k^|^2 is proportional to cosh2η_k, Eq. (<ref>) then shows that η_k is a time-independent constant for all t≥ t_b. On the other hand, with the help of (<ref>) and (<ref>), we find\n\n    1/ω_fω_i ḋ_k^(1)2(t)+ω_i/ω_f ḋ_k^(2)2(t)-ω_f/ω_i d_k^(1)2(t)-ω_fω_i d_k^(2)2(t)   =A_k sin(2ω_ft_b-2ω_ft)+B_k cos(2ω_ft_b-2ω_ft)\n       =√(A_k^2+B_k^2) cos(ϑ_k+2ω_ft_b-2ω_ft) ,\n\nwith\n\n    A_k   =2[1/ω_i d_k^(1)(t_b) ḋ_k^(1)(t_b)+ω_i d_k^(2)(t) ḋ_k^(2)(t)] ,\n    \n    \tB_k   =[1/ω_fω_i ḋ_k^(1)2(t_b)+ω_i/ω_f ḋ_k^(2)2(t_b)-ω_f/ω_i d_k^(1)2(t_b)-ω_fω_i d_k^(2)2(t_b)] .\n\nand\n\n    cosϑ_k   =B_k/√(A_k^2+B_k^2) ,   sinϑ_k   =-A_k/√(A_k^2+B_k^2) .\n\nFrom (<ref>) and (<ref>), we see √(A_k^2+B_k^2) is proportional to sinh2η_k, and thus is a time-independent constant. We immediately can identify ϑ_k in Eqs. (<ref>)–(<ref>) to be the same θ_k in (<ref>)–(<ref>). Finally, we may note that (<ref>) still looks slightly different from the lefthand sides of (<ref>)–(<ref>) in the arguments of the trigonometric functions. It results from the choice of the out mode function in (<ref>). The reason for such a choice is that for an observer in the out-region, he has no reference to identify the origin of time coordinate. In addition, the choice of a fixed time origin at most amounts to an absolute phase, which in most cases is of no significance. However, in the current case we are comparing two formalisms. So for   consistency's sake, we may define the origin of the time coordinate in the out-region at t_b rather than 0. Simply shifting t in (<ref>) to t→ t-t_b,   then (<ref>) will look the same as those in (<ref>)–(<ref>). At this point, we have shown that in the out-region an observer may report on having experienced a quantum field in a squeezed thermal state, with a time-independent squeeze parameter.\n\n\n\n\n\nThe squeeze parameter η_k we showed earlier is quite small because cosh2η_k∼1. This results from the fact that the parametric processes in the previous cases vary mildly. Now we show a case similar to that in Fig. <ref> but with a much sharper transition with ω_i=1, ω_f=100, t_a=3π/2, t_b=3π/2+0.05 and n=1. The plot for cosh2η_k is shown in Fig. <ref>. We see in this case cosh2η_k=25.62206 in the out-region, much larger than the previous two cases. Therefore, it is consistent with the understanding that to generate large squeezing, the parametric process had better not be adiabatic.  This is corroborated by our prior knowledge of cosmological particle production.\n\n\nFinally,  as a contrast to the previous piecewise-continuous parametric processes, we consider a sufficiently smooth ω^2(t), such as the thrice differentiable function ω^2(t) \n\n    ω^2(t)=-(t-t_a)^4/(t_b-t_a)^7[20t^3-10(7t_b^-t_a^) t^2+4(21t_b^2-7t_b^t_a^+t_a^2) t-(35t_b^3-21t_b^2t_a^+7t_b^t_a^2-t_a^3)] ,\n\nbetween t=t_a and t=t_b. The corresponding results are shown in Fig. <ref>. We do not discern any difference in the generic behavior, so for the quantities of interest in our present  study, the piecewise-continuous ω^2(t) suffices.\n\n\n\nThe fact that the squeeze parameter becomes time-independent in the out-region implies that this result is time-translation invariant. To be more precise, if we shift the parametric process along the time axis, then as long as the conditions that 1) the observation time t is still in the out-region of the shifted process and 2) the initial time t_i remains in the in-region of the shifted process, are satisfied, the observer at time t will still see the same squeeze parameter. In other words, the observer in the out-region cannot extract from the squeeze parameter any information about when the parametric process starts or ends. At first, it sounds odd that there exists such a time-translation  invariance for a nonequilibrium, nonstationary process. We show this in Appendix <ref>; however, after seeing these examples, this result may not appear that dubious. The full evolution from the initial time t_i to the observation time t is not invariant under time translation, but after the parametric process has ended at t_b, the mode functions in the out-region reverts to  a  sinusoidal time dependence. The time translation in a sinusoidal function of time amounts to a phase shift.  Thus, if the  quantity of interest is independent of this phase shift, it appears to possess time-translation invariance.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlthough in the current configuration the detector in the out-region will sense the same squeeze parameter when the parametric process is shifted along the time axis, the measured results in the detector still depend on the duration t_b-t_a and the functional form of the process. In fact this can be expected from (<ref>)–(<ref>), where the squeeze parameters are expressed in terms of the fundamental solutions, which in turn depend on the functional form of the parametric process in their equation of motion. \n\n\n\n\nFor illustrations, Fig. <ref>-(c) shows the dependence of the squeeze parameter η_k on the duration of the parametric process, given by Eq. (<ref>). We fix the starting time t_a of the parametric process and the moment t the measurement in the out-region is performed. We find that the squeeze parameter η_k, defined in (<ref>), is oscillatory but decreases with increasing ending time t_b. Except for the small oscillations, the curve in (c) gives the general trend that the squeezing (as manifested, e.g., in particle pair production), is subdued with a slower transition rate or longer transition duration t_b-t_a. This example shows that this kind of parametric process gives a lower production of particles as it moves toward the adiabatic regime. The mild oscillations may be related to the kinks at t_a and t_b due to the nonsmoothness of ω(t). This may be seen from the observation that the oscillations, as shown in the blow-ups in Fig. <ref>-(c), appear shallower with larger t_b-t_a because the kinks are less abrupt. This argument also find its support from Fig. <ref>-(b) and -(d). \n\n\nIn Fig. <ref>, the dependence of the squeeze parameter η_k on the functional form of the parametric process is shown. We choose three different parametric processes of ω^2(t) for examples. In Fig. <ref>-(a), the process has the piecewise-continuous form given by Eq. (<ref>), so it gives a same result as Fig. <ref>-(c). Fig. <ref>-(b) is described by the smooth transition, Eq. (<ref>). We have the same process, Eq. (<ref>), for Fig. <ref>-(c) and -(d) but with different choices of n. We choose n=11 for (c) and n=1 for (d). Thus in plot (c) the transition does not monotonically vary with time. \n\n\n\nSince both Fig. <ref>-(b) and -(d) are associated with smooth parametric processes, when we prolong the duration of the parametric processes by fixing t_a and increasing t_b, we see that the value of η_k monotonically decreases without any ripples. Thus, together with the behavior of the curve in Fig. <ref>-(c), they imply that the ripples in Fig. <ref>-(a) may originate from the non-smoothness of the parametric process at the transition times t_a and t_b.\n\n\nAmong the plots in Fig. <ref>, Fig. <ref>-(c) shows a more interesting behavior. The transition described by (<ref>) with n=11 is sinusoidal, as shown in Fig. <ref>-(a). The squeeze parameter η_k in Fig. <ref>-(c) then reveals more structures, and may signify the presence of resonance, shown by a large peak. It seems to imply that the particle production can be greatly enhanced if the transition duration is tuned to the right value for fixed ω_i and ω_f, as in parametric resonance. This  may constitute  a mechanism to generate stronger squeezing, in addition to the common one  in a runaway setting <cit.>. Another unusual feature  is that η_k in Fig. <ref>-(c) is not significantly reduced when we have a larger t_b.\n\n\n\n\n\n\nIn fact, this resonance feature can be traced back to parametric instability. If we write the equation of motion for a parametric oscillator with the frequency given by (<ref>) into the canonical form\n\n    x”(τ)+[a-2q cos(2τ)] x(τ)=0 ,\n\nwhere a prime represents taking the derivative with respect to τ,  Ω  t=2τ, and\n\n    a   =4A^2/Ω^2 ,   q   =2B^2/Ω^2 ,   Ω   =nπ/t_b-t_a ,   A^2   =ω_f^2+ω_i^2/2 ,   B^2   =ω_f^2-ω_i^2/2 .\n\nNow compare the stability diagram Fig. <ref>-(a) of (<ref>) with Fig. <ref>-(c). We immediately see that the portion of the curve in Fig. <ref>-(b) that corresponds to exceptionally high squeezing is essentially located within the unstable region (white area) of the stability diagram in Fig. <ref>-(a). Thus, the large squeezing in the mode driven by a non-monotonic ω(t) is caused by instability in parametric resonance.\n\n\n\n\n\nThe above simple examples illustrate a point that the dependence of the squeeze parameter η_k on the duration of the parametric process does reflect qualitative features of the parametric process. In fact, we can apply the same idea to the spectral dependence of the squeeze parameter for various functional forms of the parametric processes. These will serve as templates from which we may extract qualitative information about the parametric process the quantum field has experienced. \n\n\n\n\n\n\n\n\n\n§ SUMMARY\n\n\nA major task of theoretical cosmology is to find ways to deduce the state of the early universe from relics observed today such as features of primordial radiation and matter contents. In addition to particle creation at the Planck time and structure formation after the GUT (grand unified theory) time we add here another fundamental quantum process: quantum radiation from atoms induced by of quantum fields.\n\n\n\nA massless quantum field in Minkowski space is subjected to a parametric process which varies the frequencies of the normal modes of the field from one constant value to another over a finite time interval. The initial (in-) state of the field will become squeezed after the process. In the out-region we couple an atom to this field in the out-state; the response of the atom certainly depends on this squeezing. Meanwhile, the radiation generated by the interacting atom will send out signals outwards, such that an observer or a probe at a much later time may still be able to identify the squeezing via the signatures in the radiation.\n\nOnce we have identified the squeezing, locally or remotely, we then ask how the squeezing may depend on the details of the parametric process the field had been subjected to. If we can work out templates that relate these quantities, then measurements of certain features of squeezing can tell us something about the parametric process.\n\nThe salient points in our results are summarized below. In the first part of this paper we show the following:\n\n    \n  * The radiation field at a location far away from the atom looks stationary; its nonstationary component decays with time exponentially fast.\n    \n  * The  net energy flow cancels at late times like the case discussed in <cit.>. These features are of particular interest considering that the atom that emits this radiation is coupled to a squeezed field, which is nonstationary by nature. However they are consistent with the fact that the atom's internal dynamics relaxes in time.\n    \n  * This implies that we are unable to measure the extent of squeezing by measuring the net radiation energy flow at a location  far away from the atom.\n    \n  * On the other hand, one can receive residual radiation energy density at late times, which is a time-independent constant and is related to the squeeze parameter. But it is of a near-field nature, so the observer cannot be located too far away from the atom.\n\nNote that there is always an ambient free component of the same squeezed quantum field everywhere, in addition to the above radiation component generated by the atom's internal motion. \n\n In the second part of this paper we focus on the dependence of the squeeze parameter on the parametric process  and obtain these results:\n\n    \n  * Formally it can be shown that the squeeze parameter depends on the evolution of the field in the parametric process.\n    \n  * In the current configuration, for a given parametric process, the squeeze parameter depends only on the duration of the process, it does not depend on the starting or the ending time of the process.\n    \n  * In general, for a monotonically varying process, the value of the squeeze parameter decreases with increasing duration of the process.\n    \n  * This implies that, for an adiabatic parametric process, the squeezing tends to be very small, but it can be quite significant for non-adiabatic parametric processes. These results are consistent with studies of cosmological particle creation in the 70s as parametric amplification of vacuum fluctuations.\n    \n  * If the parametric process changes with time sinusoidally, then the dependence of the squeeze parameter on the duration of the process shows interesting additional structures. For certain lengths of the process, the squeeze parameter can have unusually large values.\n    \n  * This non-monotonic behavior turns out to be related to parametric instability. The resulting large squeeze parameter is caused by the choice of the parameter that falls within the unstable regime of the parametric process.\n\nOur results in this second part indicate that not much information about a monotonic parametric process can be gleaned off from the squeeze parameter. On the other hand, for a non-monotonic parametric process, the squeeze parameter shows nontrivial dependence on the duration of the process. The latter is expected to be the typical case in nature in which various scales are involved in a transition.  Moreover, to conform to realistic measurements, we can apply similar considerations to examine the mode dependence of the squeeze parameter. Thus the current scenario seems to offer a viable means to extract partial information about the parametric process a quantum field has undergone.\n\n\n\n\nAs a final remark, we comment on applying the discussions in Sec. <ref> to the case of the atom coupled to quantized electromagnetic fields. To begin with, in conventional sense, such a configuration has a supra-Ohmic, Markovian dynamics. It is inherently unstable, as discussed in <cit.>. It has runaway solutions, so it makes no sense to discuss the late time  behavior, relaxation, energy balance or the fluctuation-dissipation relation of such a system. Although we may render such a system to have stable dynamics by resorting to order reduction <cit.> via the critical manifold argument, this approach is not very satisfactory from the viewpoint of  open systems because order reduction only asymmetrically changes the behavior of the dissipation on the atom side; it does not accordingly modify the fluctuation noise force on the atom. Thus the resulting nonequilibrium fluctuation-dissipation relation associated with the atom's internal dynamics will not take the elegant form we usually see for the Ohmic, Markovian dynamics. Furthermore this relation will depend on the parameters of the reduced system, and thus loses its universality for  interacting linear systems and for some nonlinear systems. \n\nTo restore the stable dynamics of the atom's internal dynamics <cit.> and the beauty of the associated nonequilibrium fluctuation-dissipation relation, it is probably easiest if we generalize the Markovian spectrum of the quantized electromagnetic field to the non-Markovian one.  However this introduces additional complexity to the analysis presented in Sec. <ref> because the radiation field will not have a simple local (apart from retardation) form like (<ref>). Thus it is not clear yet whether the rather general properties we expounded in Sec. <ref> for a quantum scalar field also convey to a quantized electromagnetic field, a topic saved for future investigations.\n\n\n\n\n\nAcknowledgment J.-T. Hsiang is supported by the Ministry of Science and Technology of Taiwan, R.O.C. under Grant No. MOST 111-2811-M-008-022. B.-L. Hu appreciates the kind hospitality of Prof. Chong-Sun Chu of the National Center for Theoretical Sciences and Prof. Hsiang-nan Li of the Academia Sinica, R.O.C. in the finishing stage of this paper. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ TWO-MODE SQUEEZED STATE\n\nHere we outline the properties of the two-mode squeezed operator Ŝ_2(ζ) associated mode 1 and 2,\n\n    Ŝ_2(ζ)=exp[ζ^*â_1^â_2^-ζ â_1^†â_2^†] ,\n\nsuch that the two-mode squeezed thermal state is defined by\n\n    ρ̂_tmst=Ŝ_2^(ζ) ρ̂_β Ŝ_2^†(ζ) .\n\nwhere ρ̂_β is a thermal state. The creation and annihilation operators satisfy the standard commutation relation [â,â^†]=1. It is convenient to put the squeeze parameter ζ into a polar form ζ=η e^iθ, with η∈ℝ^+ and 0≤θ<2π. We thus have\n\n    Ŝ_2^† â_1 Ŝ_2^   =coshη â_1^-e^+iθsinhη â_2^† ,   Ŝ_2^† â_2 Ŝ_2^   =coshη â_2^-e^+iθsinhη â_1^† .\n\nso that\n\n    ⟨â_i^2⟩_tmst   =Tr{ρ_β Ŝ_2^† â_i^2 Ŝ_2^}=0 ,   ⟨â_i^†2⟩_tmst   =0 ,\n    ⟨â_1^â_1^†⟩_tmst   =(n̅_1+1) cosh^2η+n̅_2 sinh^2η ,   ⟨â_1^†â_1^⟩_tmst   =n̅_1 cosh^2η+(n̅_2+1) sinh^2η ,\n    ⟨â_2^â_2^†⟩_tmst   =(n̅_2+1) cosh^2η+n̅_1 sinh^2η ,   ⟨â_2^†a_2^⟩_tmst   =n̅_2 cosh^2η+(n̅_1+1) sinh^2η ,\n    ⟨â_̂1̂â_2⟩_tmst   =-e^+iϕ/2(n̅_1+n̅_2+1) sinh2η ,   ⟨â_1^†a_2^†⟩_tmst   =-e^-iϕ/2(n̅_1+n̅_2+1) sinh2η ,\n\nwhere n̅_i is the mean particle number of the thermal state associated with mode i,\n\n    n̅_i=Tr{ρ̂_β â_i^†â_i^}\n\n    \n\nIt is interesting to compare with the single-mode squeezed thermal state ρ̂_st, defined by  \n\n    ρ̂_st=Ŝ(ζ) ρ̂_β Ŝ^†(ζ) .\n\nHere Ŝ(ζ) is the squeezed operator\n\n    Ŝ(ζ)=exp[1/2 ζ^*â^2-1/2 ζ â^†2] .\n\nWe then find\n\n    ⟨â⟩_st   =0=⟨ a^†⟩_st ,\n    ⟨â^2⟩_st   =-e^+iθ sinh2η (n̅+1/2) ,            ⟨ a^†2⟩_st=-e^-iθ sinh2η (n̅+1/2) ,\n    ⟨â^†â⟩_st   =cosh2η (n̅+1/2)-1/2=cosh2η n̅+sinh^2η ,\n\nwhere n̅ is the mean particle number of the thermal state. Both the two single-mode squeezed state and the two-squeezed state are connected. We first write two modes in terms of their normal modes i=±,\n\n    â_1   =â_++â_-/√(2) ,   â_2   =â_+-â_-/√(2) ,\n\nwith [â_+,â_-]=0. Then we can write the two-mode squeeze operator Ŝ_2, (<ref>), as\n\n    Ŝ_2   =exp[ζ^*/2(â_+^+â_-^)(â_+^-â_-^)-ζ/2 (â_+^†+â_-^†)(â_+^†-â_-^†)]\n       =exp[ζ^*/2 â_+^2-ζ/2 â_+^†2]×exp[-ζ^*/2 â_-^2+ζ/2 â_-^†2]\n       =Ŝ_â_+(ζ)×Ŝ_â_-(-ζ) .\n\nThat is, in terms of the normal modes, it can be decomposed into a product of two single-mode squeezed operators.\n\n\nIn the current setting the connection is even closer because the pair of modes in Ŝ_2 have the opposite momenta ±k. Since the two-mode squeeze operator Ŝ_2, (<ref>), symmetrically contains the annihilation and the creation operators of both modes, during the mode counting, contributions from each pair (k,-k) will appear twice, and the resulting expressions may look like that given by two single-mode squeezed state. For example, let us compute the Hadamard function of the scalar field ϕ in the two-mode squeezed thermal state in spatially isotropic spacetime,\n\n    G_H,0^(ϕ)(x,x')   =∫d^3k/(2π)^3/21/√([b]2ω)∫d^3k'/(2π)^3/21/√(2ω')[ 1/2 ⟨{â_k^, â_k'^}⟩_tmst e^ik·x+ik'·x'e^-iω t-iω't'.\n                                     +.1/2 ⟨{â_k^, â_k'^†}⟩_tmst e^ik·x-ik'·x'e^-iω t+iω't'+H.C.]\n       =∫d^3k/(2π)^31/2ω [ 1/2 ⟨{â_k^, â_k^}⟩_tmst e^ik·(x+x')e^-iω(t+t')+1/2 ⟨{â_k^, â_-k^}⟩_tmst e^ik·(x-x')e^-iω (t+t').\n                   +1/2 ⟨{â_k^, â_k^†}⟩_tmst e^ik·(x-x')e^-iω (t-t')+1/2 ⟨{â_k^, â_-k^†}⟩_tmst e^ik·(x+x')e^-iω (t-t')\n                               +.H.C.]\n       =∫d^3k/(2π)^31/2ω e^ik·(x-x')[(n_ω+1/2) cosh2η_ω e^-iω(t-t')-e^iθ_ω(n_ω+1/2) sinh2η_ω e^-iω(t+t').\n                               +.H.C.] ,\n\nwith ω=|k| and the help of (<ref>)–(<ref>). This is the same as the Hadamard function of the field in the squeezed thermal state, consistent with (<ref>). \n\n\n\n\n\n\n\n\n§ LATE-TIME BEHAVIOR OF \n\n\n\n §.§ Late-Time Energy Flux Density \n\nHere we will examine the late-time net radiation flux of the field at distance r sufficiently far away from the atom, so that only the dominant contribution, independent r, will be of our interest. The energy flux density is given by\n\n    ⟨ΔT̂_rt(x)⟩ = lim_x' → x∂^2/∂ r ∂ t'[  G^(ϕ)_H (x,x') - G^(ϕ)_H, 0(x,x') ] .\n\n We first look at the stationary component.\n\n\n \n\n\n  §.§.§ stationary component \n\nWe will assume that t≫ r, but place no other restrictions on r for the moment. Following the decomposition in (<ref>), the stationary part of the contribution purely from the radiation field is given by\n\n    lim_x' → x∂^2/∂ r ∂ t'1/2⟨{ϕ̂_br(x), ϕ̂_br(x') }⟩_st= -e^2∫_-∞^∞dω/2π ω^2  G^(χ)_H(ω) |G^(ϕ)_R, 0(x; ω)|^2 ,\n\nwith the help of\n\n    ∂/∂ rG^(ϕ)_R, 0(x; ω)   =(iω-1/r) G^(ϕ)_R, 0(x; ω) ,\n    ∂/∂ rG^(ϕ),st_H, 0(x; ω)   =cosh2η βω/2[ω ReG^(ϕ)_R, 0(x; ω)-1/r ImG^(ϕ)_R, 0(x; ω)] ,\n\nwhere the stationary part of the free-field Hadamard function is\n\n    G^(ϕ),st_H, 0(x,0; ω)≡G^(ϕ),st_H, 0(x; ω)=cosh2η βω/2 sinω r/4π r .\n\nTo arrive at Eq. (<ref>), we observe the term proportional to r^-1 is odd in ω, thus, vanishing, and that ReG^(χ)_R(ω) is an even function of ω. At time greater than the relaxation time scale we may make the identification \n\n    G^(χ)_H(ω)=cosh 2η βω/2 ImG^(χ)_R(ω) ,\n\nby the nonequilibrium fluctuation-dissipation relation <cit.> of the internal dynamics of the atom if initially it is coupled to a squeezed thermal field. \n\n\nOn the other hand, for the cross-term, containing the correlation between the radiation field and the free field at large distance from the atom, its stationary part is\n\n    lim_x' → x∂^2/∂ r ∂ t'1/2[⟨{ϕ̂_h(x), ϕ̂_br(x')}⟩_st + ⟨{ϕ̂_br(x), ϕ̂_h(x')}⟩_st]\n       =-i e^2 ∫_-∞^∞dω/2π ω^2 ρ^(st)(ω) G^(χ)_R(ω) |G^(ϕ)_R, 0(x; ω)|^2 .\n\nHereafter it is convenient to introduce the shorthand notations\n\n    ρ^(st)(ω)=cosh2η βω/2 ,       and   ρ^(ns)(ω)=sinh2η βω/2 .\n\nSince the contribution from ReG^(χ)_R(ω) is an even function of ω, we immediately see it is the opposite of (<ref>) by (<ref>), and thus cancels with (<ref>). We already know from the case of the unsqueezed thermal state that the corresponding contributions of (<ref>) and (<ref>) cancel with one another. Therefore here we have shown that at late times the stationary part of the net energy flux density far away from the atom vanishes even though the field is initially in the squeezed thermal state, a nonstationary configuration. \n\nHere it is worth emphasizing the significance of vanishing stationary component of the net radiation flux. This is a unique feature of self-consistent quantum dynamics. The cancellation between (<ref>) and (<ref>) is not possible if the radiated field ϕ_r(x) is not correlated with the free field ϕ_h(x). This correlation is established because the atom that sends out the radiation field is driven by a free field, as seen by the Langevin equation (<ref>). It still holds when the field state is a vacuum state <cit.>, so a pure classical system will not have such correlation. Secondly our system is distinct from the classical driven dipole because the latter has a net outward radiation flux supplied by the external driving agent and is then independent of the field state. This is best seen from the component (<ref>) of the flux that is solely composed of the radiation field. This flux is field-state dependent because the internal dynamics of the atom is driven by the quantum fluctuations of the field, rather than an external agent.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ nonstationary component \n\nNow we turn to the nonstationary contribution in ⟨ΔT̂_rt(x)⟩. The component purely from the radiation field is given by\n\n    lim_x' → x∂^2/∂ r ∂ t'1/2⟨{ϕ̂_br(x), ϕ̂_br(x') }⟩_ns\n       =i e^4∫_0^∞dω/2π ω^2/4π ρ^(ns)(ω) (iω-1/r)[G^(χ)_R(ω) G^(ϕ)_R, 0(x; ω)]^2e^-i2ω t+iθ+C.C. ,\n\nwhile the counterpart from the cross term is\n\n    lim_x' → x∂^2/∂ r ∂ t'1/2[⟨{ϕ̂_h(x), ϕ̂_br(x')}⟩_ns+⟨{ϕ̂_br(x), ϕ̂_h(x')}⟩_ns]\n       =i e^2∫_0^∞dω/2π ω ρ^(ns)(ω) G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)[ω G_R,0^(ϕ)(x;ω)-2/r ImG_R,0^(ϕ)(x;ω)] e^-i2ω t+iθ+C.C. .\n\nContrary to the stationary contribution, in general, (<ref>) does not cancel (<ref>). This can be explicitly shown by examining the sum of the expressions which are proportional to ω inside the curly brackets in both equations. We find these terms together give\n\n    i e^2∫_0^∞dω/2π ω^2ρ^(ns)(ω) G_R^(χ)(ω) [G_R,0^(ϕ)(x;ω)]^2[i e^2 ω/4πG_R^(χ)(ω)+1] e^-i2ω t+iθ+C.C.\n       =i e^2∫_0^∞dω/2π ω^2ρ^(ns)(ω) ReG_R^(χ)(ω) G_R^(χ)(ω)/G_R^(χ)*(ω)[G_R,0^(ϕ)(x;ω)]^2e^-i2ω t+iθ+C.C. ,\n   \nwhere we have used the fact that e^2=8πγ m and\n\n    ImG_R^(χ)(ω)   =2mγω |G_R^(χ)(ω)|^2 .\n\nObviously (<ref>) does not vanish in general. If the squeeze angle θ is really a mode- and time-independent constant, we may set θ=0 without loss of generality and further simplify the nonstationary contribution, (<ref>), in ⟨ΔT̂_rt(x)⟩ to\n\n    i e^2∫_0^∞dω/2π ω^2ρ^(ns)(ω) [G_R,0^(ϕ)(x;ω)]^2 G_R^(χ)(ω)/G_R^(χ)*(ω) ReG_R^(χ)(ω) e^-i2ω t .\n\nEq. (<ref>), or the special case Eq. (<ref>), in general is time dependent and is not identically zero.\n\n\nFor completeness, let us write down the sum of the terms proportional to 1/r in the square brackets in (<ref>) and (<ref>), which is\n\n    -i e^2/r∫_0^∞dω/2π ω ρ^(ns)(ω) G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)[e^2ω/4π G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)+2ImG_R,0^(ϕ)(x;ω)] e^-i2ω t+iθ\n       =-e^2/r∫_0^∞dω/2π ω ρ^(ns)(ω) {[G_R,0^(ϕ)(x;ω)]^2G_R^(χ)(ω)/G_R^(χ)*(ω) ReG_R^(χ)(ω)+G_R^(χ)(ω) |G_R,0^(ϕ)(x;ω)|^2} e^-i2ω t+iθ ,\n\nplus its complex conjugate. Here again we have used (<ref>) to recast the expression into a more compact form. This will be useful later to check the consistency via the continuity equation.\n\n\n\nThe sum of (<ref>) and (<ref>) gives the only contribution of the net radiation flux that is likely to survive after the relaxation time scale. However, in Appendix <ref>, we can argue that although Eqs. (<ref>) and (<ref>) do not cancel in general, their sum still decays with time and furthermore it actually falls off to zero exponentially fast, proportional to e^-2γ t.\n\nThus combining the discussions about the stationary component, we show that at late times no net radiation flux exudes to spatial infinity from a static atom even though the internal degree of freedom of the atom is driven by the quantum fluctuations of the squeezed field caused by its parametric process. At late times it leaves no trace of detectable signal to a detector at distance much greater than the typical scales in the atom's internal dynamics, except for the case of extremely large squeezing where we might have the chance to see a trace of the net flux since it will take a longer time to decay. However, the information of the squeeze parameter η can still be read out from the asymptotic equilibrium state of the atom's internal dynamics. \n\n\n\n\n\n\n\n\n §.§ late-time field energy density \n\n\n\n\n\nThe energy density is given by\n\n    ⟨ΔT̂_tt(x)⟩ = lim_x' → x1/2( ∂^2/∂ t ∂ t' + ∂^2/∂ r ∂ r') [  G^(ϕ)_H (x,x') - G^(ϕ)_H, 0(x,x') ] .\n\nThat is, we subtract off the energy density of the free field in the squeezed state, and Eq. (<ref>) tells us the change in energy density due to the atom-field interaction. \n\n\n\n\n\n  §.§.§ stationary component \n\nWe first consider the stationary component of (<ref>). Following the decomposition (<ref>), the part purely caused by the radiation field is given by\n\n    lim_x' → x1/2( ∂^2/∂ t ∂ t' + ∂^2/∂ r ∂ r') 1/2 ⟨{ϕ̂_br(x), ϕ̂_br(x')}⟩_st\n       =e^2∫_-∞^∞dω/2π ρ^(st)(ω) (ω^2+1/2r^2) ImG_R^(χ)(ω) |G_R,0^(ϕ)(x;ω)|^2 .\n\nThe contribution from the cross term is then     \n\n    lim_x' → x1/2( ∂^2/∂ t ∂ t' + ∂^2/∂ r ∂ r') 1/2[⟨{ϕ̂_h(x), ϕ̂_br(x')}⟩_st+ ⟨{ϕ̂_br(x), ϕ̂_h(x')}⟩_st]\n       =-e^2∫_-∞^∞dω/2π ρ^(st)(ω) {(ω^2+1/2r^2) |G_R,0^(ϕ)(x;ω)|^2 ImG_R^(χ)(ω)+ω/r Re[G_R^(χ)(ω) G_R,0^(ϕ) 2(x;ω)].\n                               -.1/2r^2 Im[G_R^(χ)(ω) G_R,0^(ϕ) 2(x;ω)]} ,\n\nwith the help of (<ref>) and (<ref>) to re-express the term\n\n    2Re[G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)] ImG_R,0^(ϕ)(x;ω)=-|G_R,0^(ϕ)(x;ω)|^2 ImG_R^(χ)(ω)+Im[G_R^(χ)(ω) G_R,0^(ϕ) 2(x;ω)] .\n\nAdding both contributions together gives\n\n    ⟨ΔT̂_tt⟩_st=-e^2∫_-∞^∞dω/2π ρ^(st)(ω) {ω/r Re[G_R^(χ)(ω) G_R,0^(ϕ) 2(x;ω)]-1/2r^2Im[G_R^(χ)(ω) G_R,0^(ϕ) 2(x;ω)]} ,\n\nat late times and at large distance away from the atom. The dominant contribution of the stationary component of the local field energy density vanishes, so Eq. (<ref>) is subdominant since it is proportional to 1/r^3. It comes from the correlation between the radiation field and the free field at the location far away from the atom, and it decays faster with r. Note that there are two type of 1/r^3 contributions in the cross terms (<ref>) but one of them cancels with its counterpart in (<ref>). The residual energy density (<ref>) has relatively short range by nature. We note it is proportional to e^2, which is proportional to the damping constant γ. Since this is a time-independent constant, it means that this may be an unambiguous aftereffect of the transient peregrinating radiation field. \n\n\nNext we turn to the nonstationary component.\n\n\n\n\n\n\n  §.§.§ nonstationary component \n\nWe first examine the late-time contribution purely from the radiation field\n\n    lim_x' → x1/2( ∂^2/∂ t ∂ t' + ∂^2/∂ r ∂ r') 1/2 ⟨{ϕ̂_br(x), ϕ̂_br(x')}⟩_ns\n       =e^4∫_0^∞dω/2π ω/4π ρ^(ns)(ω) (ω^2+i ω/r-1/2r^2) [G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)]^2e^-i2ω t+iθ+C.C. .\n\nOn the other hand, the corresponding contribution from the cross term gives\n\n    lim_x' → x1/2( ∂^2/∂ t ∂ t' + ∂^2/∂ r ∂ r') 1/2[⟨{ϕ̂_h(x), ϕ̂_br(x')}⟩_ns+ ⟨{ϕ̂_br(x), ϕ̂_h(x')}⟩_ns]\n       =-e^2∫_0^∞dω/2π ρ^(ns)(ω) {i (ω^2+i ω/r)G_R^(χ)(ω) [G_R,0^(ϕ)(x;ω)]^2.\n                                     +.1/r^2 G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)ImG_R,0^(ϕ)(x;ω)} e^-i2ω t+iθ+C.C. ,\n\nNow we will use the same trick (<ref>) to combine both contributions, and we obtain\n\n    ⟨ΔT̂_tt⟩_ns   =-i e^2∫_0^∞dω/2π ρ^(ns)(ω) {-i (ω^2+i ω/r-1/2r^2)[G_R,0^(ϕ)(x;ω)]^2G_R^(χ)(ω)/G_R^(χ)*(ω) ReG_R^(χ)(ω).\n                                     +.1/2r^2 G_R^(χ)(ω) |G_R,0^(ϕ)(x;ω)|^2} e^-i2ω t+iθ+C.C. .\n   \nThe dominant term in (<ref>) has the same form as (<ref>), and thus will vanish at late times at distance far away from the atom. \n\n\n\nTherefore at late times, ⟨ΔT̂_tt⟩ settles down to a constant value, whose value decays like 1/r^3 away from the atom.\n\n\n\n\n\n\n\n §.§ continuity equation\n\nHere in passing we would like to examine the consistency of our results of the nonstationary components of  ⟨ΔT̂_μ t⟩ in terms of the continuity equation ∂^μT_μ t=0. It turns out convenient to list the previous results for the relevant components\n\n    ⟨T̂_rt⟩^(rr)_ns   =i e^4∫_0^∞dω/2π ω^2/4π ρ^(ns)(ω) (iω-1/r)[G^(χ)_R(ω) G^(ϕ)_R, 0(x; ω)]^2e^-i2ω t+iθ+C.C. ,\n    ⟨T̂_rt⟩^(hr)_ns   =i e^2∫_0^∞dω/2π ω ρ^(ns)(ω) G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)[ω G_R,0^(ϕ)(x;ω)-2/r ImG_R,0^(ϕ)(x;ω)] e^-i2ω t+iθ+C.C. ,\n    ⟨T̂_tt⟩^(rr)_ns   =e^4∫_0^∞dω/2π ω/4π ρ^(ns)(ω) (ω^2+i ω/r-1/2r^2) [G_R^(χ)(ω) G_R,0^(ϕ)(x;ω)]^2e^-i2ω t+iθ+C.C. ,\n    ⟨T̂_tt⟩^(hr)_ns   =-e^2∫_0^∞dω/2π ρ^(ns)(ω) G_R^(χ)(ω) {i (ω^2+i ω/r)[G_R,0^(ϕ)(x;ω)]^2.\n                                     +.1/r^2 G_R,0^(ϕ)(x;ω)ImG_R,0^(ϕ)(x;ω)} e^-i2ω t+iθ+C.C. .\n\nThe superscript (RR) represents the contributions purely from the radiation field like (<ref>) and (<ref>) while the superscript (HR) denotes those from the cross terms like (<ref>) and (<ref>).  For our configuration, we do not have T_ϑ t and T_φ t where ϑ and φ are respectively the polar angle, and azimuthal angle, so explicitly the continuity equation can be put in the form\n\n    ∂^μT̂_μ t=0=∂_tT_tt-1/r^2 ∂_r(r^2T_rt) .\n\nThus we find\n\n    1/r^2 ∂_r(r^2⟨T̂_rt⟩^(rr)_ns)   =-2i e^4∫_0^∞dω/2π ω^2/4π ρ^(ns)(ω)(ω^2+i ω/r-1/2r^2)[G^(χ)_R(ω) G^(ϕ)_R, 0(x; ω)]^2e^-i2ω t+iθ+C.C. ,\n        which is equal to ∂_t ⟨T̂_tt⟩^(rr)_ns, and1/r^2 ∂_r(r^2⟨T̂_rt⟩^(hr)_ns)   =2e^2∫_0^∞dω/2π ρ^(ns)(ω) G_R^(χ)(ω) {i (ω^2+i ω/r)[G_R,0^(ϕ)(x;ω)]^2.\n                                     +.1/r^2 G_R,0^(ϕ)(x;ω)ImG_R,0^(ϕ)(x;ω)} e^-i2ω t+iθ+C.C. .\n\nIt is exactly ∂_t ⟨T̂_tt⟩^(hr)_ns. Thus the continuity equation is satisfied.\n\n\n\n\n\n\n\n\n§ LATE-TIME BEHAVIOR OF THE NONSTATIONARY CONTRIBUTION IN \n\nIt turns out that the nonstationary contribution in ⟨ΔT̂_rt(x)⟩ still decays with time. To begin with, it proves useful to quote the late-time expressions of the energy exchange between the atom and the surrounding field <cit.>. For times greater than the relation time, the nonstationary contribution of the energy flow into the atom from field has the form\n\n    P_ξ^(ns)(t)   =i e^2∫_0^∞dω/2π ω^2/4π sinh2η βω/2{G_R^(χ)(ω) e^-i2ω t+iθ-C.C.} ,and the corresponding contribution of the energy flow out of the atom due to friction is\n        P_γ^(ns)(t)   =-e^4∫_0^∞dω/2π ω^3/(4π)^2 sinh2η βω/2 {[G_R^(χ)(ω)]^2 e^-i2ω t+iθ+C.C.} .\n\nFor comparison, let us put the terms proportional to ω inside of the curly brackets of (<ref>) and (<ref>) here,\n\n    (<ref>)   :      i e^2∫_0^∞dω/2π ω^2/(4π)^2r^2 sinh2η βω/2{G_R^(χ)(ω) e^-i2ω (t-r)+iθ-C.C.} ,\n    (<ref>)   :      -e^4∫_0^∞dω/2π ω^3/(4π)^3r^2 sinh2η βω/2{[G^(χ)_R(ω)]^2 e^-i2ω (t-r)+iθ+C.C.} .\n\nWe see correspondence between (<ref>) and (<ref>), as well as between (<ref>) and (<ref>). For example, the integrand of (<ref>) is e^i2ω r4π r^2 times the integrand of (<ref>). The same applies to the (<ref>)–(<ref>) pair. For a fix r and at times t≫ r, we may shift or re-define t in (<ref>) and (<ref>) by t-r→ t such that the integrals in both equations are essentially proportional to those in (<ref>) and (<ref>). We have numerically shown in <cit.> that (<ref>) and (<ref>) vanish as t→∞, so we conclude that the terms proportional to ω inside of the curly brackets of (<ref>) and (<ref>) will also vanish at late times. For example, as shown in Fig. <ref> generated by numerical calculations, the contribution in (<ref>) actually decays exponentially fast to zero. \n \n\n\n\nFor terms which are proportional to 1/r inside of the curly brackets of (<ref>) and (<ref>), we immediately see that if we take the time derivative of (<ref>), we obtain an expression which is 2/r times (<ref>). Likewise, the time derivative of (<ref>) gives,\n\n    2/r× i e^2∫_0^∞dω/2π ω^2/(4π)^2r^2 sinh2η βω/2{G_R^(χ)(ω) [e^-i2ω (t-r)+iθ-e^-i2ω t+iθ]-C.C.} .\n\nFollowing the previous arguments, for a fixed r, it vanishes in the limit t→∞ too. Thus we have demonstrated that the time derivatives of the terms proportional to 1/r inside of the curly brackets of (<ref>) and (<ref>) vanishes, so these terms must be constants for sufficiently large time. On the other hand, these terms are time dependent and are not sign definite, so the asymptotic constants must be zero.\n\n\nPutting these results together, we reach the conclusion that the nonstationary terms of the net radiation flux vanishes eventually at large distance away from the atom. However it does tell how slowly the nonstationary term decay. In fact, at least for the zero temperature limit β→∞, we can carry out the above integrals analytically, and the brute-force calculations show that for fixed r, these integrals give results that decay exponentially fast to zero in a form proportional to sinh 2η e^-2γ t. Thus at late times, no net radiation energy flux leaks to the spatial infinity from the atom even though the internal degree of freedom of the atom is coupled to a nonstationary squeezed quantum field. \n\n\n\n\n\n\n\n\n§ TIME-TRANSLATIONAL INVARIANCE OF THE SQUEEZE PARAMETER IN THE OUT-REGION\n\nNext we argue that if we shift the parametric process by Δ along the time axis, as shown in Fig. <ref>, then we will have\n\n    𝖽_i^(ii)(t+Δ,t_a+Δ)=d_i^(ii)(t,t_a)\n\nwhere 𝖽_i^(ii)(t+Δ,t_a+Δ) on sans serif style is the fundamental solution in-region II for the shifted case described by the orange curve in Fig. <ref>. \n\n\n\n\nSince the fundamental solutions 𝖽_i^(ii)(y,y_a) in-region II for the orange curve satisfies the equation of motion\n\n    𝖽̈_i^(ii)(y,y_a)+ω^2(y) 𝖽_i^(ii)(y,y_a)=0 ,\n\nwith the standard initial conditions given at y_a=t_a+Δ, while the fundamental solutions d_i^(ii)(y,y_a) in-region II for the blue curve satisfies the equation of motion\n\n    d̈_i^(ii)(t,t_a)+ω^2(t) d_i^(ii)(t,t_a)=0 ,\n\nwith the standard initial conditions given at t_a, we immediately see that both cases are related by y=t+Δ, and thus we arrive at (<ref>) and in particular,\n\n    𝖽_i^(ii)(t_b+Δ,t_a+Δ)=d_i^(ii)(t_b,t_a) .\n\nLater we will need this result.\n\n\n\nNow we would like to explicitly show that an detector, in the out-region with t>t_b+Δ, will find the same squeeze parameter for both cases described in Fig. <ref>, independent of the shift Δ, even if it carries out the measurement at the same time t. Note that in both cases the motion starts at the same t_i=0. Following the previous discussions on the construction of the fundamental solutions, we carry out a similar construction of the fundamental solution for the shifted process. At t>t_b+Δ. In particular, we focus on the moment t=t_b+Δ since afterward the squeeze parameter is a constant. Before we start, we first note that 𝖽_i^(i)(t) is essentially the same as d_i^(i)(t), except that the former applies to the time interval 0=t_i≤ t≤ t_a+Δ while the latter only to 0=t_i≤ t≤ t_a. With this recognition, we can write 𝖽_i^(i)(t_a+Δ) as\n\n    𝖽_i^(i)(t_a+Δ)=d_1^(i)(Δ) d_i^(i)(t_a)+d_2^(i)(Δ) ḋ_i^(i)(t_a) .\n\nThis will be convenient later. Now we will write 𝖽_i(t_b+Δ,0) in terms d_i^(x) with X=I, II, and III of the unshifted process. We show the calculations explicitly for 𝖽_1(t_b+Δ), and the result for 𝖽_2(t_b+Δ) will follow similarly. Pretty straightforwardly, we have\n\n\n\n\n    𝖽_1(t_b+Δ,0)   =𝖽_1^(ii)(t_b+Δ,t_a+Δ) 𝖽_1^(i)(t_a+Δ)+𝖽_2^(ii)(t_b+Δ,t_a+Δ) 𝖽̇_1^(i)(t_a+Δ)\n       =d_1^(ii)(t_b,t_a)[d_1^(i)(Δ) d_1^(i)(t_a)+d_2^(i)(Δ) ḋ_1^(i)(t_a)]+d_2^(ii)(t_b,t_a)[ḋ_1^(i)(Δ) d_1^(i)(t_a)+ḋ_2^(i)(Δ) ḋ_1^(i)(t_a)]\n\nwith the help of (<ref>) and (<ref>). We use a trick that only applies to the undamped harmonic oscillator. in-region I, we have the identities\n\n    ḋ_2^(i)(t)   =d_1^(i)(t) ,      ⇒   d_2^(i)(Δ) ḋ_1^(i)(t_a)   =d_2^(i)(t_a) ḋ_1^(i)(Δ) ,\n\nand it allows us to re-write (<ref>),\n\n    𝖽_1(t_b+Δ,0)   =d_1^(ii)(t_b,t_a)[d_1^(i)(Δ) d_1^(i)(t_a)+ḋ_1^(i)(Δ) d_2^(i)(t_a)]+d_2^(ii)(t_b,t_a)[ḋ_1^(i)(Δ) d_1^(i)(t_a)+d_1^(i)(Δ) ḋ_1^(i)(t_a)]\n       =[d_1^(ii)(t_b,t_a) d_1^(i)(t_a)+d_2^(ii)(t_b,t_a) ḋ_1^(i)(t_a)] d_1^(i)(Δ)+[d_1^(ii)(t_b,t_a) d_2^(i)(t_a)+d_2^(ii)(t_b,t_a) d_1^(i)(t_a)] ḋ_1^(i)(Δ)\n       =d_1(t_b,0) d_1^(i)(Δ)+d_2(t_b,0) ḋ_1^(i)(Δ) .\n\nSimilarly for 𝖽_2(t_b+Δ,0), we have\n\n    𝖽_2(t_b+Δ,0)=d_1(t_b,0) d_2^(i)(Δ)+d_2(t_b,0) ḋ_2^(i)(Δ) .\n\nNow we plug these results into the expressions in (<ref>)–(<ref>) to find the corresponding squeeze parameter in-region III,\n\n    1/ω_fω_i 𝖽̇_k^(1)2(t_b+Δ)+ω_i/ω_f 𝖽̇_k^(2)2(t_b+Δ)+ω_f/ω_i 𝖽_k^(1)2(t_b+Δ)+ω_fω_i 𝖽_k^(2)2(t_b+Δ)\n                           =1/ω_fω_i ḋ_k^(1)2(t_b)+ω_i/ω_f ḋ_k^(2)2(t_b)+ω_f/ω_i d_k^(1)2(t_b)+ω_fω_i d_k^(2)2(t_b) ,\n       1/ω_fω_i 𝖽̇_k^(1)2(t_b+Δ)+ω_i/ω_f 𝖽̇_k^(2)2(t_b+Δ)-ω_f/ω_i 𝖽_k^(1)2(t_b+Δ)-ω_fω_i 𝖽_k^(2)2(t_b+Δ)\n                           =1/ω_fω_i ḋ_k^(1)2(t_b)+ω_i/ω_f ḋ_k^(2)2(t_b)-ω_f/ω_i d_k^(1)2(t_b)-ω_fω_i d_k^(2)2(t_b) ,\n       1/ω_i 𝖽_k^(1)(t_b+Δ)𝖽̇_k^(1)(t_b+Δ)+ω_i 𝖽_k^(2)(t_b+Δ)𝖽̇_k^(2)(t_b+Δ)\n                           =1/ω_i d_k^(1)(t_b)ḋ_k^(1)(t_b)+ω_i d_k^(2)(t_b)ḋ_k^(2)(t_b) ,\n\ndue to the facts that\n\n    d_1^(i)(Δ) ḋ_1^(i)(Δ)   =-ω_i^2d_2^(i)(Δ) ḋ_2^(i)(Δ) ,   d_1^(i)2(Δ)+ω_i^2d_2^(i)2(Δ)   =1 ,   1/ω_i^2 ḋ_1^(i)2(Δ)+ḋ_2^(i)2(Δ)   =1 .\n\nThe results for the shifted process are the same as those for un-shifted process. Thus both cases generate the same squeezing at t≥ t_b+Δ.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n99\n\n\nUnr76 \n\tW. G. Unruh, Notes on black-hole evaporation, Phys. Rev. D 14, 870 (1976).\n\nQRadVac \n\tJ.-T. Hsiang, and B. L. Hu, Atom-field interaction: From vacuum fluctuations to quantum radiation and quantum dissipation or radiation reaction, Physics 1, 430 (2019).\n\nDeW79  \n\tB. S. DeWitt, General Relativity: An Einstein Centenary Survey, Edited by S. W. Hawking and W. Israel (Cambridge Press, Cambridge, UK, 1979). \n\nRadReact\n\tJ. R. Ackerhalt, P. L. Knight, and J. H. Eberly, Radiation reaction and radiative frequency shifts, Phys. Rev. Lett. 30, 456 (1973).\n\nRadReact1\n\tP. W. Milonni, and W. A. Smith, Radiation reaction and vacuum fluctuations in spontaneous emission, Phys. Rev. A 1975, 11, 814. [CrossRef]\n\nRadReact2\n\tJ. Dalibard, J. Dupont-Roc, and C. Cohen-Tannodji, Vacuum fluctuations and radiation reaction: Identification of their respective contributions, J. Phys. (Paris) 43, 1617 (1982).\n\nRadReact3\n\tJ. Dalibard, J. Dupont-Roc, and C. Cohen-Tannodji, Dynamics of a small system coupled to a reservoir: Reservoir fluctuations and self-reaction, J. Phys. (Paris) 45, 637 (1984). \n\nJackson\n    J. D. Jackson, Classical Electrodynamics, 2nd Ed. (Wiley, New York, 1975).\n\nRohrich\n    F. Rohrlich, Classical Charged Particles—Foundation of their Theories (Westview, Colorado, 1990).\n\nJH1 \n\tP. R. Johnson, and B. L. Hu, Stochastic theory of relativistic particles moving in a quantum field: Scalar Abraham-Lorentz-Dirac-Langevin equation, radiation reaction, and vacuum fluctuations, Phys. Rev. D 65, 065015 (2002).\n\nJHUnr\n \tP. R. Johnson, and B. L. Hu, Unruh effect in a uniformly accelerated charge: From quantum fluctuations to classical radiation, Found. Phys. 35, 1117 (2005).\n\nQRadCoh \n    J.-T. Hsiang, and B. L. Hu, Quantum radiation and dissipation in relation to classical radiation and radiation reaction, Phys. Rev. D 106, 045002 (2022).\n\n\n\nSqBooks E.g., \n\tP. D. Drummond and Z. Ficek, Quantum Squeezing (Springer-Verlag, Berlin, Heidelberg, 2004).\n\nGriSid \n\tL. P. Grishchuk, and Y. V. Sidorov, Squeezed quantum states of relic gravitons and primordial density fluctuations. Phys. Rev. D 42, 3413 (1990).\n\nHKM94 \n\tB. L. Hu, G. Kang and A. Matacz,  Squeezed vacuua and the quantum statistics of cosmological particle creation, Int. J. Mod. Phys. A9, 991 (1994).\n\nStrFor \n\tS. Weinberg, Cosmology (Oxford University Press, 2008)\n\nnMCos \n\tJ. T. Hsiang, and B. L. Hu, NonMarkovianity in Cosmology: Memories kept in a quantum field, Ann. Phys. 434, 168656 (2021).\n\nFDRSq \n\tJ. T. Hsiang, and B. L. Hu, Fluctuation-dissipation relation for a quantum Brownian oscillator in a parametrically squeezed thermal field, Ann. Phys. 433, (2021).\n\nParker \n\tL. Parker, Quantized fields and particle creation in expanding universes. I, Phys. Rev. 183, 1057 (1969).\n\nZeldovich \n\tYa B. Zel'dovich, Particle production in cosmology, JETP Lett. 12, 443 (1970).\n\nAHH22\n\tO. Arısoy, J. T. Hsiang, and B. L. Hu, Quantum-parametric-oscillator heat engines in squeezed thermal baths: foundational theoretical issues, Phys. Rev. E 105, 014108 (2022).\n\t\nHCSH18\n\tJ. T. Hsiang, C. H. Chou, Y. Subaşı, and B. L. Hu, Quantum thermodynamics from the nonequilibrium dynamics of open systems: Energy, heat capacity, and the third law, Phys. Rev. E 97, 012135 (2018).\n\t\nHH22\n\tJ. T. Hsiang, and B. L. Hu, Non-Markovian Abraham-Lorenz-Dirac equation: radiation reaction without pathology, Phys. Rev. D 106, 125108 (2022).\n\nGP85\n\tA. H. Guth, and S.-Y. Pi, Quantum mechanics of the scalar field in the new inflationary universe, Phys. Rev. D 32, 1899 (1985).\n\nHH22a\n\tJ. T. Hsiang, and B. L. Hu, No intrinsic decoherence of inflationary cosmological perturbations, Universe 8, 27 (2022).\n\t \nSp00\n\tH. Spohn, The critical manifold of the Lorentz–Dirac equation, Europhys. Lett. 49, 287 (2000).\n\n\n\n\n\n\n"}