{"entry_id": "http://arxiv.org/abs/2303.06830v1", "published": "20230313031628", "title": "Anti-helical edge magnons in patterned antiferromagnetic thin film", "authors": ["Yun-Mei Li"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall"], "text": "\n\n\n\nyunmeili@xmu.edu.cn\nDepartment of Physics, School of Physical Science and Technology, Xiamen University, Xiamen 361005, China\n\n\n  Helical edge states in topological insulators give counterpropagating spin current on the two parallel edges.\n  We here propose anti-helical edge states of magnons in patterned antiferromagnetic thin films,\n  which host copropagating spin current on the two parallel edges, where the two magnon modes\n  with opposite chirality act like the spin. The embedded heavy metal dot array\n  in the thin film induces interfacial Dzyaloshinskii-Moriya interactions (iDMIs), drives\n  the magnon bands into nontrivial topological phases, characterized by spin Chern number.\n  The resulting helical edge modes lead to spin current with the direction dependent on the sign of iDMI parameter.\n  In a strip geometry, we combine two subsystems with two embedded metal dot arrays, which give opposite\n  iDMI parameters. Anti-helical edge states emerge, compensated by the counterpropagating bulk confined states.\n  Helical and anti-helical edge states are verified by the micromagnetic simulations.\n  Our work is quite helpful in the field of magnon spintronics based on antiferromagnets.\n\n\nAnti-helical edge magnons in patterned antiferromagnetic thin film\n    Yun-Mei Li\n    March 30, 2023\n==================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nChiral or helical edge states are a hallmark feature of two-dimensional topological insulators <cit.>.\nChiral edge states emerge in quantum Hall or Chern insulators with time-reversal symmetry breaking and propagate along the edges clockwise or counterclockwise.\nAs a consequence, a typical strip geometry supports opposite propagating edge states along the two parallel edges.\nHelical edge states can be treated as two copies of chiral edge states,\nprotected by the time-reversal symmetry, holding great potential applications in spintronics.\nThe edge states for opposite spin hold opposite chirality, leading to a vanished charge current and a net spin current,\nwhich flow in opposite direction at the two parallel edges in the strip geometry.\n\nRecent theory predicted the so-called antichiral edge states <cit.>,\nwhich copropagate in the same direction at opposite edges,\ncompensated by counterpropagating bulk modes, distinct from the chiral edge states.\nThe original work is based on the modified Haldane model in electronic systems <cit.>, quite hard to realize experimentally.\nThen a series of the theoretical even experimental works addressed the realization in many other systems, including\nthe electron system based on graphene <cit.>,\nexciton polariton <cit.>, magnon <cit.>, photon <cit.> and classical electric circuit <cit.> systems.\nThe experimental works in photonic <cit.> and electric circuit <cit.> systems observed the\ncopropagating behavior of antichiral edge states based on the modified Haldane model.\nAll these works require the broken time-reversal symmetry.\nA natural question arises. In the time-reversal symmetric systems, is it possible to realize “anti-helical\" edge states,\nwhere the spin current on the parallel edges propagates in the same direction?\nFor now, quite few works made the explorations theoretically or experimentally.\n\nIn recent yeas, antiferromagnets have attracted significant attention in spintronics due to the ultrafast spin dynamics and lack of stray fields <cit.>.\nImportantly, antiferromagnets support both left-handed and right-handed polarized magnon modes, related by the pseudo-time reversal symmetry <cit.>,\nanalogous to the electron spin. This coexistence of both polarizations give rise to many novel spin-related physical phenomena,\nsuch as the magnon spin Nernst effect <cit.>, Stern-Gerlach effect <cit.> and Hanle effect <cit.>.\nManipulating the polarization may facilitate the chirality-based computing <cit.> and logic devices <cit.>.\nTherefore, the exploration on topologically protected helical or even anti-helical edge state could be greatly helpful in the field of\nmagnon spintronics based on antiferromagnets <cit.>.\n\nIn this paper, we theoretically propose the realization of anti-helical edge states of magnons\nin patterned antiferromagnetic thin film, in which the spin current at parallel edges flow in the same direction,\ncompensated by the counterpropagating bulk confined spin currents, as illustrated in Fig. <ref> (a).\nHere the degenerate two magnon modes with opposite chirality is treated\nas the spin degree of freedom, as widely discussed in previous works above.\nHeavy metal dot array is embedded into the thin film to fold the free dispersion of magnons into bands.\nMoreover, the inversion symmetry breaking at the interfaces between metal dots and the thin film will generate\ninterfacial Dzyaloshinskii-Moriya interactions (iDMIs),\nwhich modify the exchange boundary condition and induce nontrivial topological phase for the magnon bands,\ncharacterized by the spin Chern number. As a result, helical edge magnons arise in a finite width strip geometry.\nThe left-handed and right-handed edge magnons flow towards opposite\ndirections at the same edge, leading to a pure spin current, revealed by the micromagnetic simulations.\nThe direction of the spin current is determined by the sign of iDMI parameter D.\nIn a finite width ribbon geometry, we combine two subsystems embedded with\ndifferent metal dot arrays, which induce iDMIs with opposite sign of D, as shown in Fig. <ref> (a).\nInteresting, the spin currents along the two edges flow in the same direction, while the spin currents along the domain wall flow in opposite direction.\nThe emergence of the anti-helical edge states can also be verified by the micromagnetic simulations.\n\nThis paper is organized as follows. In Sec. II, we derive the eigenvalue problem for the magnons in the patterned antiferromagnetic thin film\nin the presence of metal dot array and the iDMIs.\nIn Sec. III, we discuss the band topological properties due to the iDMIs, the topological phase transition and the construction of strip geometry for\nanti-helical edge states. We also performed the micromagnetic simulations for verifications.\nIn Sec. IV, we summarize our results. In Sec. V, we present the methods and the parameters we adopted for the calculations.\n\n\n\n§ THE PATTERNED ANTIFERROMAGNETIC THIN FILM\n\n\n\n\nWe consider an antiferromagnetic thin film with periodically embedded metal dots.\nThe metal dots are arranged in a triangular lattice configuration.\nWe construct a domain along two sides with different embedded metal dot array\nto get the anti-helical edge states in a strip geometry, as illustrated in Fig. <ref> (a).\nAn infinite system with only one type embedded metal dot array is a two-dimensional artificial magnonic crystal.\nThe corresponding unit cell is shown in Fig. <ref> (b).\nThe strip geometry with one or two embedded metal dot array is one-dimensional artificial magnonic crystal.\nThe magnetization dynamics in antiferromagnets can be described\nby two coupled Landau-Lifshitz-Gilbert (LLG) equations for each sublattice,\n\n    ṁ_i=-γ𝐦_i×𝐡_i+α𝐦_i×ṁ_i,\n\nwhere i=1,2 denote the two sublattices. γ is the gyromagnetic ratio, α is the Gilbert damping constant.\nHere γ𝐡_i=K_zm_i^z𝐳+A∇^2𝐦_i-J_ex𝐦_i̅\n(with 1̅=2 and 2̅=1) is the effective magnetic field acting locally on sublattice 𝐦_i,\nwhere K_z is the easy-axis anisotropy along 𝐳 direction\nA and J_ex characterize the Heisenberg exchange coupling constant of intra-sublattice and inter-sublattice, respectively.\nThe equilibrium magnetization is in collinear order for the two sublattices and parallel to the z-direction.\nTo get the magnon dispersions, we can divide the magnetization and effective magnetic fields on each sublattice\ninto the static and dynamical ones.\nLet 𝐦_i=𝐦_i^0+δ𝐦_i and 𝐡_i=𝐡_i,0+δ𝐡_i\nwith 𝐦_i^0 the equilibrium magnetization and |δ𝐦_i|≪𝐦_i^0.\n𝐡_i,0 is the z-component of the effective magnetic field.\nBy neglecting the damping first, we have\n∂δ𝐦_i/∂ t =-γ(𝐦_i^0×δ𝐡_i+δ𝐦_i×𝐡_i,0).\nTo solve the dispersion in the artificial crystals,\nwe employ the ansatz δ𝐦_i=δ𝐦_i^𝐤(𝐫)e^i(𝐤·𝐫-ω t),\nand after a transformation, we can get the eigenvalue equations, given by\n\n    ωψ_±,𝐤 =∓σ_zĤ_𝐤ψ_±,𝐤,\n\nwhere ψ_±,𝐤=(δ m_1,±^𝐤,δ m_2,±^𝐤)^T,\nδ m_i,±^𝐤=δ m_i,x^𝐤± iδ m_i,y^𝐤,\nĤ_𝐤=[K_z+J_ex+(∇+i𝐤)^2]σ_0+J_exσ_x.\nσ_0 is 2×2 identity matrix, σ_x,y,z are the Pauli matrices.\nThe solution for ψ_+,𝐤 denotes left-handed modes while  ψ_-,𝐤 is solution\nfor right-handed modes. As discussed in our recent work <cit.>, the two polarized modes are related by a pseudo-time reversal symmetry.\nNote that the two polarized modes are totally decoupled.\n\nWe turn to the role of the embedded heavy metal dots.\nThe first effect is to fold the free dispersion into magnon bands due to the scattering by the periodic interfaces from the metals.\nMore importantly, as discussed in many theoretical <cit.>\nand verified in experimental works <cit.>,\nthe heavy metals (such as Pt, W, Au, Re, Ir, etc) with strong spin-orbit coupling can generate chiral interfacial Dzyaloshinskii-Moriya interactions (iDMI)\ndue to the inversion symmetry breaking at the magnets/heavy metal interfaces. In our system, the iDMI 𝐡_DM is given by\nγ𝐡_DM=D𝐳×(𝐞_t·∇)𝐦_i\nby comparing our bent surface to the previous plane surface <cit.>.\n𝐞_t=𝐧×𝐳 is the in-plane tangential vector of the interface and 𝐧 the\nnormal vector of the interface, both depicted in Fig. <ref> (b). D may be either positive or negative,\ndepending on the metal materials <cit.>.\nWithout loss of generality, we assume D is uniform at the bent surfaces.\nThe iDMI will give an interface torque <cit.>, change the exchange boundary condition into the formalism below,\n\n    𝐧·∇𝐦_i+Dd/A𝐳×(𝐞_t·∇)𝐦_i=0,\n\nwith d the thickness of interface atomic layer and D_0=Dd is a constant, only depending the materials. This constant D_0 value\naccounts for the experimentally observed approximately inverse thickness dependence of spin wave frequency shift in ferromagnets/heavy metal heterostructures <cit.>.\n\nBy solving the eigenvalue equation in Eq. (<ref>) with the boundary condition in Eq. (<ref>),\nwe can obtain the magnon dispersions in the 𝐤-space.\nThe strip geometry illustrated in Fig. <ref> (a) can also be calculated.\nThe results are shown in the subsequent section.\n\n\n\n\n\n§ RESULTS AND DISCUSSIONS\n\n\n\n\n §.§ Band topological phase transitions\n\n\nBefore presenting the construction of anti-helical edge states,\nwe first discuss the topological properties of magnons in AFM thin film embedded with only one type heavy metal dot array.\nThe corresponding Brillouin zone (BZ) is shown in Fig. <ref> (a).\nWe present the band dispersions at four different D_0 values for right-handed modes in Fig. <ref> (b).\nThe left-handed bands are degenerate to the right-handed ones.\nWhen D=0, all the bands are topological trivial.\nThe first (fourth) and second (fifth) bands are degenerate at K and K^' points,\nwhich gives multiple Dirac points in the spectrum.\nThe second (fifth) and third (sixth) bands intersect at Γ point.\n\nA finite D lifts all the above the band degeneracies and open bandgap\nat Γ, K and K^' points.\nAs the right-handed and left-handed modes are totally decoupled,\nwe can use the Chern number to characterize the topological properties for the bands of each polarized mode.\nThe berry connection of n-th band is given by\n 𝐀_n,±^𝐤=∓ i∫_ucψ_±,𝐤^n,†σ_z∇_𝐤ψ_±,𝐤^nd𝐫\nand Berry curvature 𝐁_n,±^𝐤=∇_𝐤×𝐀_n,±^𝐤.\nThe Chern number C_n,±=1/2π∫_BZB_n,z,±^𝐤d^2𝐤.\nThe integral for the berry connection is done over the unit cell.\nThe Chern number for the corresponding right-handed magnon bands are shown in Fig. <ref> (b) by the number on the bands.\nWe find the Chern numbers for the left-handed magnon bands are opposite to the right-handed ones for each degenerate band.\nTherefore, we can use the spin Chern number to characterize the topological properties of the total system,\nC_n,s=(C_n,--C_n,+)/2.\nWe can also define the n-th gap spin Chern number C̅_n,s associated with the gap\nabove the n-th band as\n\n    C̅_n,s=∑_n^'=1^nC_n^',s.\n\nThe number C̅_n,s determined the number of helical edge states in the n-th gap according\nto the bulk-boundary correspondence.\nWhen D reverse sign, the Chern number for each mode will reverse the sign accordingly.\nThe spin Chern number will also reverse sign. Therefore, the spin current due to the helical edge states are expected\nto change the flow direction. As the sign of D is determined by the heavy metal materials, we can design our system\nby choosing the heavy metal as desired. Based on this feature, we can\nconstruct the anti-helical edge magnons by structural design.\n\nFor the first gap, a larger D will give a larger bandgap at K and K^' points,\nas shown in Fig. <ref> (c). At any value of D, the first gap spin Chern number is always -1.\nInterestingly, increasing D will drive a topological phase transition for the third and fourth bands.\nWe find when D_0=D_0^c≃ 0.11A, the bandgap between the third and fourth bands at Γ point will be closed.\nA larger D_0 will reopen the gap, as shown in Fig. <ref> (b) and (d). The spin Chern number\nfor the third band C_3,s will change from 1 to 0, while for the fourth band, C_4,s changes\nfrom 1 to 2. The total (spin) Chern number of the two bands remain unchanged.\nBut this topological phase transition will change the third gap spin Chern number C̅_3,s from 0 to -1.\nThis indicates that the third gap will experience a topologically trivial to nontrivial phase transition.\nFrom Fig. <ref> (b), we can see only the first and third bandgap are full gap.\n\n\n\n §.§ Helical edge magnons\n\n\n\n\nThe nonvanishing n-th gap spin Chern number is expected to give rise to helical edge states covering the bandgap.\nTo verify this prediction, we calculate the band dispersion in a strip geometry with a finite width along y direction and infinite along x direction.\nThe strip geometry with only the upper edge termination are shown in Fig., <ref> (a).\nThe ribbon band dispersions for the right-handed modes are shown in Fig. <ref> (b) with D_0=0.05A (left) and D_0=0.2A (right).\nThe bands for left-handed modes are degenerate to the right-handed ones.\nFor D_0=0.05A, We can see the edge states cover the first and second bandgap.\nThe spin Chern number of the third gap is 0, indicating a trivial gap without supporting edge states.\nEdge states are also expected to exist in higher bands.\nBut due to the absence of full gaps, they are not distinguishable from the bulk states, thus  not shown.\nFor D_0=0.2A, the edge states in the first and second gaps preserve. Additional edge states emerge\nin the third bandgap due to the topological phase transition\nfor D_0>D_0^c compared to D_0<D_0^c.\n\nFrom the zoom in bands for D_0=0.05A near the first bandgap in Fig. <ref> (c),\nwe can see that the edge states with the frequency located in the shaded region show\na totally chiral feature. These edge states thus propagate unidirectionally.\nWe can also see this feature for the states in the first and third gap for D_0=0.2A.\nThe excitation of the states with other frequencies in the first gap and the states in the second gap will do not show\nunidirectional flow. In the subsequent simulations, we mainly focus on the states in the first bandgap.\nDue to the helical feature of the edge states, pure spin current locate at the edges.\nTo verify the helical feature of topologically protected edge magnons,\nwe perform micromagnetic simulations by selectively exciting spin waves with either one polarization.\nThe method for the micromagnetic simulations is present in Sec V.\nThe results are shown in Fig. <ref> (d) and (e).\nWe apply a right-handed microwave source with the frequency located in the first bandgap.\nThe excited right-handed spin waves flow unidirectionally towards the left [Fig. <ref> (d)], consistent with the in-pane magnetization\ndistributions obtained from band calculation.\nWhen we changed the microwave source to the left-handed one, the excited spin waves move towards right [Fig. <ref> (e)].\nWhen the excitation microwave source is linearly polarized, both magnon modes will be excited.\nA higher frequency located in the third bandgap will also give the same behavior.\nWhen the excitation source is placed in the opposite parallel edge, the moving direction of each mode will be opposite.\nThese behaviors of excited spin waves clearly demonstrated the helical feature of the edge states.\nSame to the electronic systems, it will lead to a pure magnon spin current on each edge, counterpropagating along the two parallel edges.\nThese states are topologically protected and are thus robust against the disorders from the nanofabrication process,\nsame to our previous work <cit.>.\n\nAs the sign of spin Chern number is locked to the sign of iDMI parameter D, which is dependent on the heavy metal materials.\nWhen we embed different heavy metal dot array to induce an opposite D, both of the polarized edge states will reverse the propagation direction,\nso as to the spin current. The feature in our system is the key point for the construction of anti-helical edge states.\n\n\n\n §.§ Anti-helical edge magnons\n\n\nBased on the locking behavior between spin Chern number and D, we now construct the anti-helical edge magnons in our system\nto make the edge spin currents on the two parallel edges flow towards the same direction.\nAs the the sign of D is determined by the heavy metal materials, we design an interface in the middle of the finite width strip, illustrated in Fig. <ref> (a).\nTwo different heavy metal materials are embedded along the two sides of the interface.\nThe two metal materials are assumed to induce iDMI with opposite D, as illustrated\nin Fig. <ref> (a). For simplicity, we assume the absolute value of D is the same as different values give the same physics.\n\n\n\nWe plotted the bands for both polarized modes in Fig. <ref> (b) at |D_0|=0.2A.\nThe edge states are marked by red lines while the green lines denote the modes localized\nalong the interface between the two domains with different embedded heavy metal dot array.\nThese edge and interfacial states are still topologically protected.\nThe edge modes are doubly degenerate for both spin, localized on the upper and lower edges, respectively.\nFor each polarized edge states covering the first and third gaps, the two degenerate states propagate along the same direction,\nwhile the the interfacial states flow towards the opposite direction.\nThe left-handed polarized bands can be mirrored to the right-handed ones respect to k_xa=π (time-reversal invariant point) and vice versa.\nOn each edge and on the interface, the two polarized modes still counterflow to each other.\nAs a result, the spin current on the two edges flow towards the same direction,\ncompensated by the counterpropagating interfacial spin current, manifestation of the anti-helical feature for magnons\nin this designed structure.\n\n\n\nThe anti-helical feature of the edge magnons can also be revealed in the micromagnetic simulations.\nThe results are shown in Fig. <ref> (a) and (b).\nThe excited left-handed spin waves on the parallel edges flow towards right while the interfacial ones flow to the left.\nOn the contrary, the excited right-handed edge spin waves propagate towards left and the interfacial ones propagate to the right.\nThese behaviors demonstrate the successful construction of anti-helical edge magnons.\nIn a cell with a finite width along the x direction, a linearly polarized microwave source will excite\nboth polarized spin waves, as shown in Fig. <ref> (c). When the spin waves meet the left and right vertical edges,\nthey will be totally transmitted without backscattering due to the topological protection.\nBut they can not penetrate into the vertical edges lower than the interface.\nThis is because of the anti-helical feature, either polarized vertical edge magnons above and below the interface move in the opposite directions,\ndifferent from the chiral and helical edge states in topological insulators.\nInstead, they will be transmitted into the interface, as shown in Fig. <ref> (c).\nHowever, after a longer time when transport to the opposite vertical edges, they will split into two beams, as illustrated\nin the inset of Fig. <ref> (c). One of the two will be transmitted to the lower horizontal edge.\nAll the edge magnons on each horizontal edge can be transmitted to the other only through the interface.\n\n\n\n §.§ Discussions\n\n\nAbove all, we have discussed the band topology due to the iDMIs,\nthe helical also the anti-helical edge magnons in the patterned antiferromagnetic thin film. In our calculations, the thickness\nof the film is 4 nm. The other thickness will also give the same band dispersions when only considering the k_z=0 bulk modes.\nThe modes with higher frequency at nonvanishing k_z for any film thickness\nare also expected to give the same physics as any k_z mode share the same symmetry in the xy plane.\nWe adopt the triangular configuration for the embedded heavy metal array.\nThe other configurations like the square lattice are also expected to give similar results.\n\nWe here adopted a medium lattice constant (a=50 nm) for the calculations.\nA larger lattice constant will give a smaller bandgap,\nbut does not alter the topological protection of the edge and interfacial states.\nOur model is experimentally feasible to construct.\nThe helical, anti-helical and interfacial states can be probed in the spin pumping process\nas opposite magnon chirality could generate opposite spin polarization, discussed in recent experimental work <cit.>.\nThey can also be detected by the polarization selective spectroscopy <cit.>.\nIn addition, our configuration in a ferromagnetic thin film will lead to the antichiral edge states as there is only one magnon polarization in ferromagnets.\n\n\n\n§ SUMMARY\n\n\nIn this work, we proposed a theoretical scheme to realize the anti-helical edge magnons in antiferromagnetic thin film with embedded\nheavy metal dot array. The iDMIs induce helical edge states with the direction of spin current dependent on the sign of iDMI parameter.\nBy constructing an interface with embedded different metal dots along the two sides in a finite width ribbon, edge spin current\non the parallel two edges propagate in the same direction, compensated by conterpropagating spin current along the interface.\nOur proposal is experimentally feasible and the anti-helical edge states can be probed by the state-of-the-art techniques.\nOur work provides a new method controlling the magnon spin in antiferromagnets and should be quite helpful in the field of magnon spintronics based on antiferromagnets.\n\n\n\n\n§ METHODS\n\n\nThe nearest distance between the metal dot center (lattice constant) is a=50 nm. The radius of the metal dot is r=15 nm.\nThe parameters in the coupled LLG equation are as follows: <cit.>\nK_z=8.55 GHz, A=7.25×10^-6 Hz·m^2, J_ex=1.105×10^11 Hz.\nThe saturation magnetization M_s=1.94×10^5 A/m,\nthe gyromagnetic ratio γ=2.21×10^5 Hz·m/A.\nThe values of D_0 in the unit of A are given in the main text according to our need for the discussions.\nThe micromagnetic simulation is based on the Eq. (<ref>). The damping constant is adopted as α=2×10^-4\nto get a long decay length. We did not take the dipolar fields into calculation due to the antiferromagnet environment.\n\nWe can selectively excite either one or both of the polarized modes simultaneously by setting the microwave fields.\nThe effective field of the radio wave is given by 𝐡_rf(t)=h_0[cos(ω t)𝐞_x±sin(ω t)𝐞_y], where\n+ denotes the right-handed source and - denotes the left-handed source.\nOnly one component above along the x or y direction give a linearly polarized source.\nIn our micromagnetic simulation, h_0=2×10^9 Hz, ω=2π×16.2 GHz.\n\n\n\n\n\n§ ACKNOWLEDGEMENT\n\n\nThis work is supported by the startup funding from Xiamen University.\n\n99\n\nMZHasan M. Z. Hasan and C. L. Kane, Colloquium: Topological insulators,\nhttps://doi.org/10.1103/RevModPhys.82.3045Rev. Mod. Phys. 82, 3045 (2010).\n\nXLQiX.-L. Qi and S.-C. Zhang, Topological insulators and superconductors,\nhttps://doi.org/10.1103/RevModPhys.83.1057Rev. Mod. Phys. 83, 1057 (2011).\n\nEColomes E. Colomés and M. Franz, Antichiral Edge States in a Modified Haldane Nanoribbon,\nhttps://doi.org/10.1103/PhysRevLett.120.086603Phys. Rev. Lett. 120, 086603 (2018).\n\nMMDenner M. M. Denner, J. L. Lado, and O. Zilberberg,\nAntichiral states in twisted graphene multilayers,\nhttps://doi.org/10.1103/PhysRevResearch.2.043190Phys. Rev. Research 2, 043190 (2020).\n\nXCheng X. Cheng, J. Chen, L.Zhang, L. Xiao, and S. Jia,\nAntichiral edge states and hinge states based on the Haldane model,\nhttps://doi.org/10.1103/PhysRevB.104.L081401Phys. Rev. B 104, L081401 (2021).\n\nSMandal S. Mandal, R. Ge, and T. C. H. Liew,\nAntichiral edge states in an exciton polariton strip,\nhttps://doi.org/10.1103/PhysRevB.99.115423Phys. Rev. B 99, 115423 (2019).\n\nDBhowmick D. Bhowmick and P. Sengupta,\nAntichiral edge states in Heisenberg ferromagnet on a honeycomb lattice,\nhttps://doi.org/10.1103/PhysRevB.101.195133Phys. Rev. B 101, 195133 (2020).\n\nJChen J. Chen, W. Liang, and Z.-Y. Li,\nAntichiral one-way edge states in a gyromagnetic photonic crystal,\nhttps://doi.org/10.1103/PhysRevB.101.214102Phys. Rev. B 101, 214102 (2020).\n\nPZhou P. Zhou, G.-G. Liu, Y. Yang, Y.-H. Hu, S. Ma, H. Xue, Q. Wang, L. Deng, and B. Zhang,\nObservation of Photonic Antichiral Edge States,\nhttps://doi.org/10.1103/PhysRevLett.125.263603Phys. Rev. Lett. 125, 263603 (2020).\n\nYangY Y. Yang, D. Zhu, Z. Hang, and Y. Chong,\nObservation of antichiral edge states in a circuit lattice,\nhttps://doi.org/10.1007/s11433-021-1675-0Sci. China Phys. Mech. Astron. 64, 257011 (2021).\n\nTJungwirth T. Jungwirth, X. Marti, P. Wadley, and J. Wunderlich, Antiferromagnetic spintronics,\nhttps://doi.org/10.1038/nnano.2016.18Nature Nanotech. 11, 231 (2016).\n\nVBaltz V. Baltz, A. Manchon, M. Tsoi, T. Moriyama, T. Ono, and Y. Tserkovnyak,\nAntiferromagnetic spintronics,\nhttps://doi.org/10.1103/RevModPhys.90.015005Rev. Mod. Phys. 90, 015005 (2018).\n\nYMLi1 Y.-M. Li, Y.-J. Wu, X.-W. Luo, Y. Huang, and K. Chang,\nHigher-order topological phases of magnons protected by magnetic crystalline symmetries,\nhttps://doi.org/10.1103/PhysRevB.106.054403Phys. Rev. B 106, 054403 (2022).\n\nRCheng R. Cheng, S. Okamoto, and D. Xiao,\nSpin Nernst Effect of Magnons in Collinear Antiferromagnets,\nhttps://doi.org/10.1103/PhysRevLett.117.217202Phys. Rev. Lett. 117, 217202 (2016).\n\nVAZyuzin V. A. Zyuzin and A. A. Kovalev,\nMagnon Spin Nernst Effect in Antiferromagnets,\nhttps://doi.org/10.1103/PhysRevLett.117.217203Phys. Rev. Lett. 117, 217203 (2016).\n\nZWang  Z. Wang, W. Bao,  Y. Cao, and  P. Yan,\nAll-magnonic Stern-Gerlach effect in antiferromagnets,\nhttps://doi.org/10.1063/5.0096968Appl. Phys. Lett. 120, 242403 (2022).\n\nTWimmer T. Wimmer, A. Kamra, J. Gückelhorn, M. Opel, S. Geprägs, R. Gross, H. Huebl, and M. Althammer,\nObservation of Antiferromagnetic Magnon Pseudospin Dynamics and the Hanle Effect,\nhttps://doi.org/10.1103/PhysRevLett.125.247204Phys. Rev. Lett. 125, 247204 (2020).\n\nCJia  C. Jia, M. Chen, A. F. Schäffer, and J. Berakdar,\nChiral logic computing with twisted antiferromagnetic magnon modes,\nhttps://doi.org/10.1038/s41524-021-00570-0npj Comput. Mater. 7, 101 (2021).\n\nMWDaniels M. W. Daniels, R. Cheng, W. Yu, J, Xiao, and D. Xiao,\nNonabelian magnonics in antiferromagnets,\nhttps://doi.org/10.1103/PhysRevB.98.134450Phys. Rev. B 98, 134450 (2018).\n\nWYu1 W. Yu, J. Lan, and J. Xiao,\nMagnetic Logic Gate Based on Polarized Spin Waves,\nhttps://doi.org/10.1103/PhysRevApplied.13.024055Phys. Rev. Applied 13, 024055 (2020).\n\nABarman A. Barman, et al., The 2021 Magnonics Roadmap,\nhttps://doi.org/10.1088/1361-648X/abec1aJ. Phys.: Condens. Matter 33, 413001 (2021).\n\nLUdvardi L. Udvardi and L. Szunyogh, Chiral Asymmetry of the Spin-Wave Spectra in Ultrathin Magnetic Films,\nhttps://doi.org/10.1103/PhysRevLett.102.207204Phys. Rev. Lett. 102, 207204 (2009).\n\nJHMoon J.-H. Moon, S.-M. Seo, K.-J. Lee, K.-W. Kim, J. Ryu, H.-W. Lee, R. D. McMichael, and M. D. Stiles,\nSpin-wave propagation in the presence of interfacial Dzyaloshinskii-Moriya interaction,\nhttps://doi.org/10.1103/PhysRevB.88.184404Phys. Rev. B 88, 184404 (2013).\n\nKYamamoto K. Yamamoto, A.-M. Pradipto, K. Nawa, T. Akiyama, T. Ito, T. Ono, and K. Nakamura,\nInterfacial Dzyaloshinskii-Moriya interaction and orbital magnetic moments of metallic multilayer films,\nhttps://doi.org/10.1063/1.4973217AIP Advances 7, 056302 (2017).\n\nMdRKAkanda Md. R. K. Akanda, I. J. Park, and R. K. Lake,\nInterfacial Dzyaloshinskii-Moriya interaction of antiferromagnetic materials,\nhttps://doi.org/10.1103/PhysRevB.102.224414Phys. Rev. B 102, 224414 (2020).\n\nMKostylev M. Kostylev, Interface boundary conditions for dynamic magnetization and spin wave dynamics in a\nferromagnetic layer with the interface Dzyaloshinskii-Moriya interaction,\nhttp://dx.doi.org/10.1063/1.4883181J. Appl. Phys. 115, 233902 (2014).\n\nPFerriani P. Ferriani, K. von Bergmann, E. Y. Vedmedenko, S. Heinze, M. Bode, M. Heide, G. Bihlmayer, S. Blügel, and R. Wiesendanger,\nAtomic-Scale Spin Spiral with a Unique Rotational Sense: Mn Monolayer on W(001),\nhttps://doi.org/10.1103/PhysRevLett.101.027201Phys. Rev. Lett. 101, 027201 (2008).\n\nKZakeri Kh. Zakeri, Y. Zhang, J. Prokop, T.-H. Chuang, N. Sakr, W. X. Tang, and J. Kirschner,\nAsymmetric Spin-Wave Dispersion on Fe(110): Direct Evidence of the Dzyaloshinskii-Moriya Interaction,\nhttps://doi.org/10.1103/PhysRevLett.104.137203Phys. Rev. Lett. 104, 137203 (2010).\n\nJCho J. Cho, N.-H. Kim, S. Lee, J.-S. Kim, R. Lavrijsen, A. Solignac, Y. Yin, D.-S. Han,\nN. J. J. van Hoof, H. J. M. Swagten, B. Koopmans, and C.-Y.You,\nThickness dependence of the interfacial Dzyaloshinskii-Moriya interaction in inversion symmetry broken systems,\nhttps://doi.org/10.1038/ncomms8635Nature Commun. 6, 7635 (2015).\n\nNembachH H. T. Nembach, J. M. Shaw, M. Weiler, E. Jué, and T. J. Silva,\nLinear relation between Heisenberg exchange and interfacial Dzyaloshinskii-Moriya interaction in metal films,\nhttps://doi.org/10.1038/nphys3418Nature Phys. 11, 825 (2015).\n\nKDi K. Di, V. Li Zhang, H. S. Lim, S. C. Ng, M. H. Kuok, J. Yu, J. Yoon, X. Qiu, and H. Yang,\nDirect Observation of the Dzyaloshinskii-Moriya Interaction in a Pt/Co/Ni Film,\nhttps://doi.org/10.1103/PhysRevLett.114.047201Phys. Rev. Lett. 114, 047201 (2015).\n\nYMLi Y.-M. Li, J. Xiao, and K. Chang,\nTopological Magnon Modes in Patterned Ferrimagnetic Insulator Thin Films,\nhttps://doi.org/10.1021/acs.nanolett.8b00492Nano Lett. 18, 3032 (2018).\n\nYLiu Y. Liu, Z. Xu, Lin Liu, K. Zhang, Y. Meng, Y. Sun, P. Gao, H.-W. Zhao, Q. Niu, and J. Li,\nSwitching magnon chirality in artificial ferrimagnet,\nhttps://doi.org/10.1038/s41467-022-28965-7Nature Commun. 13, 1264 (2022).\n\nYShiota Y. Shiota, T. Arakawa, R. Hisatomi, T. Moriyama, and T. Ono,\nPolarization-Selective Excitation of Antiferromagnetic Resonance in Perpendicularly Magnetized Synthetic Antiferromagnets,\nhttps://doi.org/10.1103/PhysRevApplied.18.014032Phys. Rev. Applied 18, 014032 (2022).\n\n\nWYu2 W. Yu, J. Lan, and J. Xiao, Polarization-selective spin wave driven domain-wall motion in antiferromagnets,\nhttps://doi.org/10.1103/PhysRevB.98.144422Phys. Rev. B 98, 144422 (2018).\n\n\n\n\n"}