{"entry_id": "http://arxiv.org/abs/2303.06826v1", "published": "20230313025352", "title": "Transmission Efficiency Limit of Single-Switch Reconfigurable Transmitarray Elements", "authors": ["Changhao Liu", "Fan Yang", "Shenheng Xu", "Maokun Li"], "primary_category": "physics.app-ph", "categories": ["physics.app-ph"], "text": "\n\n\t\n\n\n\n\nTransmission Efficiency Limit of Single-Switch Reconfigurable Transmitarray Elements\n    Changhao Liu, Student Member, IEEE, Fan Yang, Fellow, IEEE, Shenheng Xu, Member, IEEE and Maokun Li, Senior Member, IEEE\n\tThis work was supported in part by in part by THE XPLORER PRIZE. (Corresponding author: Fan Yang.)\n\tThe authors are with the Beijing National Research Center for Information Science and Technology (BNRist), Department of Electronic Engineering, Tsinghua University, Beijing 100084, China (e-mail: fan_yang@tsinghua.edu.cn).\n\n    March 30, 2023\n==================================================================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\n\n\tReconfigurable transmitarray antennas (RTAs) are rapidly gaining popularity, but optimizating their performance requires systematic design theories. In particular, a performance limit theory for RTA elements would be highly valuable. This paper presents a theory on the transmission efficiency limit of single-switch RTA elements. Using microwave network theory, we conduct an analytical investigation of single-switch RTA elements, revealing that the transmission coefficients under two states should be restricted within a specific unit circle on the Smith chart. The results are validated through analytical proof and numerical simulations. Additionally, this theory suggests that the transmission phase difference is tightly constrained by the transmission amplitudes, indicating that the phase-shifting ability of a single-switch RTA element is limited. These findings have significant implications for the design and optimization of RTAs.\n\n\n\n\tMetasurfaces, microwave network theory, one-bit, performance limit, reconfigurable reflectarray antennas, reconfigurable transmitarray antennas.\n\n\n\n\n§ INTRODUCTION\n\nRecent years have witnessed the rapid development of microwave metasurfaces, leading to the emergence of diverse high-gain array antennas with novel architectures, including reflectarray antennas (RAs), transmitarray antennas (TAs), and their reconfigurable versions <cit.>. Along with the emergence of various prototypes, underlying theories have also been proposed to guide the design of these array antennas. Performance limit theories are particularly useful in predicting the performance of general structures before their actual design, which can significantly improve the design efficiency. Here are some examples of performance limit theories for these novel array antennas.\n\nIn 2014, the transmission phase limit theory for multilayer TA designs was first introduced in <cit.>. Figure <ref>(a) depicts a schematic illustration of the multilayer TA. Using microwave network models and S-parameters, researchers discovered the constraints on the transmission amplitude and phase of TA elements, demonstrating that the phase tuning range within a 1-dB transmission amplitude loss is 54^∘, 170^∘, 308^∘, and 360^∘ for single-, double-, triple-, and quad-layers.\n\n\n\nAnother instance of the performance limit theory pertains to transmit-reflect-array antennas based on polarization conversion methods, as revealed in 2018 <cit.>. A schematic of the this type of array antenna is shown in Fig. <ref>(b). By applying the electric field continuity condition on the near-zero-thickness surface, researchers found that to achieve 360^∘ phase coverage on both sides, a minimum of 6 dB amplitude loss is required.\n\nReconfigurable reflectarray antennas (RRAs) have emerged as a promising candidate for achieving beam-scanning capability. In particular, the 1-bit phase quantization technique has become a mainstream architecture in many applications, due to its minimal switch requirement with only 3 dB gain loss <cit.>. In recent years, several single-switch 1-bit RRAs with different features have been presented in <cit.>, as depicted in Fig. <ref>(c). Recently, a performance limit theory for single-switch RRA elements was presented based on the radiation viewpoint <cit.>. By pre-calculating the performance limit and design targets at given switch parameters, this theory can facilitate the efficient design of wideband, multiband, or high-frequency RRA elements.\n\nReconfigurable transmitarray antennas (RTAs) have been proposed as an alternative to RRAs to eliminate the feed blockage effect. Since 2012, 1-bit RTAs have been extensively studied, and various prototypes based on different principles have been proposed. For example, current reversal method utilizes at least two opposite switches on one layer to achieve accurate 180^∘ phase difference <cit.>. Recently, stacked-layer RTAs with two switches on different layers have been presented based on the resonant method, which can also achieve 1-bit phase difference at certain frequency bands <cit.>.\n\nInterestingly, it has been found that all of the aforementioned 1-bit RTA elements require at least two switches to achieve 1-bit phase difference with high transmission amplitude. This raises a question: Is it feasible to design a high-performance RTA element using only one switch? Fig. <ref>(d) provides an illustration of a single-switch RTA. Recently, by using three-port microwave network analysis, it is proven by contradiction that it is impossible to design a single-switch RTA element with both high transmission amplitude and 1-bit phase tuning ability simultaneously <cit.>. Therefore, the 1-bit RTA elements indeed require at least two switches theoretically. However, this proof only applies to the zero-reflection case, and it does not consider the general situation where the reflection coefficients are not necessarily zero. Therefore, a quantitative analysis of the performance of the single-switch RTA element in general cases needs to be further investigated.\n\nTo provide a quantitative performance limit in general situations, this paper presents a theory on the transmission efficiency limit for single-switch RTA elements. Geometrically, this theory states that the transmission coefficients under two states must vary on or inside a specific unit circle with a diameter of 1 on the Smith chart. An intuitive illustration of this conclusion is shown in Fig. <ref>. Based on this finding, it is concluded that the transmission phase difference is tightly constrained by the transmission amplitudes. Specifically, high transmission amplitudes result in a narrow transmission phase difference, while a phase difference of near 180^∘ results in low transmission amplitudes. This conclusion is consistent with the previous finding in <cit.>.\n\n\n\n\nThis paper is organized as follows. Section II introduces the microwave network model of the single-switch RTA elements and presents an important lemma. Section III presents the transmission efficiency limit theory and its proof of the single-switch RTA elements. The simulation verification of this limit theory is demonstrated in Section IV. Section V draws the conclusion.\n\n\n\n§ MODEL OF SINGLE-SWITCH RTA ELEMENTS\n\n\n\n\n §.§ The Microwave Network Model of the RTA Element with a Single Switch\n\n\nThe RTA element with a single switch can be modeled as a three-port microwave network <cit.>, as shown in Fig. <ref>. The incoming wave enters the element through the Floquet port 1, and transmits toward the Floquet port 2. Since the size of the switch is much smaller than the wavelength, the lumped switch port 3 can be designated between the switch and the element. The passive structure is characterized by a 3×3 scattering matrix [S]. According to the S-parameter definition <cit.>, the incoming wave [a] and outgoing wave [b] are related through the [S] matrix using the following formula\n\n    [[ b_1; b_2; b_3 ]]\n    \t=\n    \t[[ S_11 S_12 S_13; S_21 S_22 S_23; S_31 S_32 S_33 ]]\n    \t·[[ a_1; a_2; a_3 ]].\n\nHere, S_ij=S_ji due to reciprocity.\n\n \n\nγ is the reflection coefficient of the switch, which is defined as\n\n    γ = Z-η/Z+η = a_3/b_3,\n\nwhere Z is the impedance of the switch, and η is a reference characteristic impedance, typically 377 Ω.\nNotably, the switch has two states, and thus, γ takes on two distinct values: γ_ON and γ_OFF.\n\n\n\n §.§ Lemma: Relation Among Reflection and Transmission Coefficients\n\n\nAs derived in <cit.>, the reflection coefficient of port 1 (Γ_1) and the transmission coefficient from port 1 to port 2 (T_21) are expressed as follows \n\n    Γ_1 = b_1/a_1 = S_11 + S_13^2γ/1-S_33γ,\n\n\n    T_21 =b_2/a_1 = S_21 + S_23S_13γ/1-S_33γ.\n\nSimilarly, the reflection coefficient of port 2 (Γ_2) is expressed as\n\n    Γ_2 = b_2/a_2 = S_22 + S_23^2γ/1-S_33γ.\n\n\nWe denote the reflection coefficients under ON/OFF switch states as (Γ^ON_1, Γ^OFF_1) and (Γ^ON_2, Γ^OFF_2), and the transmission coefficients under ON/OFF switch states as (T^ON_21, T^OFF_21). Then we define the difference of the coefficients between two states as follows\n\n    ΔΓ_1=Γ^ON_1-Γ^OFF_1=S_13^2γ_ON/1-S_33γ_ON-S_13^2γ_OFF/1-S_33γ_OFF,\n\n\n    ΔΓ_2=Γ^ON_2-Γ^OFF_2=S_23^2γ_ON/1-S_33γ_ON-S_23^2γ_OFF/1-S_33γ_OFF,\n\n\n    Δ T_21=T^ON_21-T^OFF_21=S_23S_13γ_ON/1-S_33γ_ON-S_23S_13γ_OFF/1-S_33γ_OFF.\n\nFrom (<ref>), (<ref>), and (<ref>), it is evident that the following relation holds\n\n    Δ T^2_21 = ΔΓ_1 ΔΓ_2.\n\nThis expression shows a clear relationship on differences of reflection and transmission coefficients in a single-switch RTA element, and reduces the three-port network to a two-port network analysis by incorporating the switch parameters into the reflection and transmission coefficients, as illustrated in Fig. <ref>. We define a reduced 2×2 scattering matrix [S'] as follows\n\n    [S']=[[  Γ_1 T_21; T_21  Γ_2 ]],\n\nwhich represents the scattering behavior of the entire element.\n\n\n\n\n\n\n\n§ THE CONSTRAINT ON THE TWO TRANSMISSION COEFFICIENTS OF SINGLE-SWITCH RTA ELEMENTS\n\n\nIn this section, we utilize (<ref>) and (<ref>) to derive the transmission efficiency limit of a single-switch RTA element. The key result is stated first, and then proven under both symmetric and asymmetric conditions. We also derive the upper limit of the transmission phase difference as a corollary of the theory.\n\n\n\n §.§ The Transmission Efficiency Limit\n\n\nThe transmission efficiency limit of the single-switch RTA element is as follows: The two transmission coefficients under two switch states must lie on or within a unit circle with a diameter of 1. In other words, there exists a unit circle that can contain the two transmission coefficients for single-switch RTA element geometrically. An intuitive illustration of this finding has been shown in Fig. <ref>.\n\nMathematically, T^ON_21 and T^OFF_21 should satisfy the following condition\n\n    ∃φ∈ [0, 2π),      |T^ON_21-e^jφ/2| ≤1/2,\n       |T^OFF_21-e^jφ/2| ≤1/2.\n\n\nThe proof of this statement can be divided into two parts. First, for RTA elements with symmetric reflection coefficients, it can be theoretically proven that the two transmission coefficients must lie on the unit circle. Secondly, for RTA elements with asymmetric reflection coefficients, it can be analyzed and observed that the two transmission coefficients must lie within or on the unit circle.\n\n\n\n\n §.§ Proof for Symmetric RTA Elements\n\n\nAssuming the single-switch RTA element is lossless, we can prove that the two transmission coefficients vary on the unit circle for symmetric elements.\n\nThe lossless condition implies that the scattering matrix [S'] is unitary, meaning that [S'][S']^H=I, where H denotes the Hermitian transpose. Using the results of our previous derivation in <cit.>, we have\n\n    {[ |Γ_1|^2+|T_21|^2=1; |Γ_2|^2+|T_21|^2=1;                    ].\n\nand \n\n    θ_1+θ_2/2-θ_21 = ±π/2,\n\nwhere θ_1 and θ_2 are the reflection phases from two ports, respectively, and θ_21 is the transmission phase.\n\nSince the network is symmetric, the two reflection coefficients are equal, i.e.,\n\n    Γ_1=Γ_2.\n\nThis implies that θ_1=θ_2. Combining these results with (<ref>) and (<ref>), we obtain\n\n    {[ |Γ_1|^2+|T_21|^2=1;    θ_1-θ_21 = ±π/2;                    ].\n\nIt can be mathematically shown that the complex numbers Γ_1 and T_21 have the following relations\n\n    T_21-Γ_1=e^jφ,\n\nor\n\n    T_21+Γ_1=e^jφ,\n\nwhere φ is a parameter of this equation.\nA geometric illustration of these relations is shown on the Smith chart in Fig. <ref>. The vector Γ_1 and T_21 lie on the complex plane, and according to the Pythagorean theorem, they are perpendicular to each other, and the length of the hypotenuse is 1. Therefore, T_21, e^jφ and 0 form a circle on the Smith chart, and e^jφ represents the diameter of the circle. In other words, for a given e^jφ, T_21 varies on the circle determined by e^jφ.\n\n \n\nSince Γ_1=Γ_2 in both states, the difference between them should also be equal, i.e., ΔΓ_1=ΔΓ_2. Substituting this relation into (<ref>), the following expression is obtained\n\n    Δ T^2_21 = ΔΓ^2_1.\n\nThere are two sets of solutions to this equation, which are discussed separately. Notably, it is assumed in advance that T^ON_21 varies on the circle determined by e^jφ^ON, and T^OFF_21 varies on the circle determined by e^jφ^OFF.\n\n\n  * Δ T_21 = ΔΓ_1. This equation leads to\n\n    T^ON_21-Γ^ON_1=T^OFF_21-Γ^OFF_1.\n \nBased on (<ref>) and (<ref>), it is found that\n\n    e^jφ^ON=e^jφ^OFF,\n\nwhich means that T^ON_21 and T^OFF_21 vary on the same unit circle, as shown in Fig. <ref>(a).\n\n\n  * Δ T_21 = -ΔΓ_1. This equation leads to\n\n    T^ON_21+Γ^ON_1=T^OFF_21+Γ^OFF_1.\n\nBased on (<ref>) and (<ref>), it is found that\n\n    e^jφ^ON=e^jφ^OFF,\n\nwhich means that T^ON_21 and T^OFF_21 vary on the same unit circle, as shown in Fig. <ref>(b).\n\n\n \n\nIn summary, for lossless symmetric RTA elements, the two transmission coefficients should lie on the same unit circle.\n\n\n\n §.§ Analysis of Asymmetric RTA Elements\n\n\nThis part analyzes the asymmetric single-switch RTA elements, and it is observed that the two transmission coefficients should vary on or inside the unit circle.\n\nAssume the element is lossless, so (<ref>) and (<ref>) still hold. From (<ref>), it can be deduced that |Γ_1|=|Γ_2|. Because it is the relative relation between two transmission coefficients that matters, without loss of generality, one of the transmission coefficients, such as T^ON_21, can be assumed to vary on the unit circle determined by e^j0=1. An auxiliary variable Γ^ON is introduced, with the equal amplitude to Γ^ON_1 and Γ^ON_2, and the phase is defined as θ^ON = (θ^ON_1+θ^ON_2)/2. Therefore, the relation between Γ^ON and T^ON_21 can be expressed as\n\n    {[ |Γ^ON|^2+|T^ON_21|^2=1;    θ^ON-θ^ON_21 = ±π/2;                        ].\n\nSimilar to the analysis in the symmetric case, Γ^ON should be perpendicular to T^ON_21, and the length of the hypotenuse is 1. Fig. <ref>(a) shows a graphical representation of the relationship between reflection and transmission coefficients in (<ref>) and (<ref>).\nAdditionally, as θ^ON = (θ^ON_1+θ^ON_2)/2, Γ^ON lies on the angular bisector between Γ^ON_1 and Γ^ON_2. Let the phase difference between Γ^ON and Γ^ON_1 be ϕ^ON. Thus, the phase difference between Γ^ON and Γ^ON_2 is -ϕ^ON. Since the network is asymmetric, ϕ^ON is neither 0 nor π. Based on the geometric insights, the reflection coefficients can be expressed as\n\n    {[ Γ^ON_1=(T^ON_21-1)e^-jϕ^ON;  Γ^ON_2=(T^ON_21-1)e^jϕ^ON;                            ].\n\n\n \n\n\n\nFor the other state of the transmission coefficients (e.g. T^OFF_21), it is supposed that T^OFF_21 varies randomly on the Smith chart. We further suppose T^OFF_21 varies on the circle determined by e^jφ, as shown in Fig. <ref>(b). Similarly, the reflection coefficients is expressed as\n\n    {[ Γ^OFF_1=(T^OFF_21-e^jφ)e^-jϕ^OFF;  Γ^OFF_2=(T^OFF_21-e^jφ)e^jϕ^OFF;                                  ].\n\n\nBy substituting (<ref>) and (<ref>) into (<ref>), the expression is finally simplified as\n\n    (T^ON_21-T^OFF_21)^2   =(T^ON_21-1)^2+(T^OFF_21-e^jφ)^2\n    \n    \t\t-   2cos(Δϕ)(T^ON_21-1)(T^OFF_21-e^jφ),\n\nwhere Δϕ=ϕ^OFF-ϕ^ON denotes the difference between the two-state asymmetric reflection phases.\n\nIt is noted that T^ON_21 and T^OFF_21 are on the unit circles, which can be further expressed as\n\n    {[     T^ON_21= |cos(θ^ON_21)|e^jθ^ON_21; T^OFF_21=|cos(θ^OFF_21-φ)|e^jθ^OFF_21;                                       ].\n\nNote that (<ref>) has 4 parameters: θ^ON_21, θ^OFF_21, φ and Δϕ.\n\nWe needs to demonstrate that T^OFF_21 and T^ON_21 lie within a circle. Theoretically, if θ^ON_21, φ and Δϕ are given, θ^OFF_21 can be solved using (<ref>). We can then use the mathematical criterion in (<ref>) to determine whether T^OFF_21 and T^ON_21 lie inside the same circle. However, the expression for θ^OFF_21 is very complex and not intuitive. Therefore, numerical calculations are used to demonstrate the relation between T^OFF_21 and T^ON_21.\n\nFor a given group of θ^ON_21 and Δϕ, a series of θ^OFF_21 and φ can be obtained that satisfy (<ref>), and the exact value of T^OFF_21 depends on the specific element parameters. Without losing generality, We present several cases to demonstrate that T^OFF_21 is always located on or inside the circle on which T^ON_21 lies, as shown in Fig. <ref>. In Fig. <ref>(a)-(f), we fix θ^ON_21 and thus T^ON_21 is also fixed. By changing Δϕ, the variation range of T^OFF_21 changes accordingly. If Δϕ=0 or π, T^OFF_21 is always on the circle of T^ON_21. The analytical solutions of T^OFF_21 for Δϕ=0 or π are derived in the Appendix. As Δϕ increases from 0 to π/2, T^OFF_21 tend to move inside the circle, while from Δϕ=π/2 to Δϕ=π, T^OFF_21 tends to be on the circle again. The variation trend of T^OFF_21 from Δϕ=π to Δϕ=2π should be the same as from Δϕ=π to Δϕ=0, since cos(2π-Δϕ)=cos(Δϕ). Moreover, if we fix Δϕ (e.g. Δϕ=π/3), the varying trend when changing T^ON_21 is shown in Fig. <ref>(c), (g)-(j). When T^ON_21=1, the T^OFF_21 is always on the circle where T^ON_21 varies. As θ^ON_21 increases, the variation range of T^OFF_21 changes, but it is always within the circle on which T^ON_21 lies. In summary, the case studies in Fig. <ref> demonstrate that for an asymmetric RTA element, T^OFF_21 and T^ON_21 are always located on or inside the same circle.\n\n\n\n\n\n §.§ Summary\n\n\n\n\n\n\nBased on the analysis presented above, it can be concluded that both the symmetric and asymmetric RTA elements with a single switch have their two transmission coefficients constrained by a circle. Specifically, for a lossless symmetric element, the two transmission coefficients lie on the same circle, while for a general asymmetric element, the two transmission coefficients lie inside the unit circle. There are also several special cases for asymmetric elements where the two transmission coefficients lie on the circle, namely when Δϕ=0 or π, |T^ON_21|=1 or |T^OFF_21|=1. The relations for these different scenarios are summarized in Table. <ref>.\n\n\n\n §.§ Corollary: The Transmission Phase Difference Limit of RTA Elements\n\n\nThis part presents a key corollary of the proposed theory, which is the constraint on the transmission phase difference and transmission amplitudes. \n\nAs shown in Fig. <ref>, the transmission phase difference is defined as the included angle between the two transmission coefficients. Since the two transmission coefficents lie on or inside a unit circle, the relative phases of the two transmission coefficents can be expressed as\n\n    {[   cos(α^ON)≥|T^ON_21|; cos(α^OFF)≥|T^OFF_21|;                       ].\n\nwhere α represents the included angle between one transmission coefficient and the diameter. Given the transmission amplitudes, the phase difference Δθ between the two transmission coefficients is limited by\n\n    Δθ≤α^ON+α^OFF≤arccos(|T^ON_21|)+arccos(|T^OFF_21|).\n\nThe equal sign holds only when T^ON_21 and T^OFF_21 both lie on the circle, and they are on opposite sides of the diameter.\n\n\nThe maximum transmission phase difference is limited by the two transmission amplitudes, as expressed in (<ref>). The phase difference limit (PDL) is defined as the sum of the two arccosine terms, arccos(|T^ON_21|)+arccos(|T^OFF_21|). The relation among PDL and transmission amplitudes is plotted in Fig. <ref>(a). Particularly, when the two transmission amplitudes are equal, i.e.,  |T|=|T^ON_21|=|T^OFF_21|, and the relation between PDL and |T| is plotted in Fig. <ref>(b). \n\nThe curves in Fig. <ref> reveal that a single-switch RTA element cannot achieve both large phase difference and high transmission amplitudes simultaneously. For instance, to achieve high transmission amplitudes near 1, the phase difference must be close to 0. Alternatively, to achieve a phase difference of approximately 180^∘, the two transmission amplitudes should be close to 0. Moreover, to achieve a 90^∘ phase difference, at least a 3 dB amplitude loss is introduced. These results quantitatively support the findings in <cit.> that it is impossible to achieve high transmission efficiency with a large phase tuning range using a single-switch RTA element.\n\n \n\n\n\n\n§ NUMERICAL DEMONSTRATION OF THE TRANSMISSION EFFICIENCY LIMIT\n\n\nThis section presents two numerical simulation cases to validate the proposed theory. The first case involves a single-layer dipole RTA element with a single switch, while the second case features a dipole RTA element with a half ground plane. The results confirm the validity of the proposed theory, as it shows that the transmission phase difference does not break the PDL in either case.\n\n\n\n §.§ Simulation Verification for Symmetric Structures\n\n\nTo confirm the conclusions regarding symmetric structures, we modeled and simulated a single-layer dipole RTA element with a single switch using Ansys HFSS 2018, as shown in Fig. <ref>. For the sake of brevity, the dipole is assigned as a perfect electric conductor (PEC) with no substrate loaded. The switch is modeled as C_OFF=25 fF, L_OFF=30 pH; R_ON=7.8 Ω, L_ON=30 pH, with reference to <cit.>. The position of the switch P_s varies from 0.2 mm to 9 mm to generate different transmission coefficients. The simulation frequency ranges from 5 GHz to 12 GHz with a step of 0.01 GHz. \n\n\n\nFig. <ref> shows the transmission coefficients for different switch positions. In the ON state, the transmission coefficient remains relatively constant for different P_s values, and it is resonant at approximately 8 GHz (Fig. <ref>(a)). In the OFF state, the resonant frequency shifts from 10.7 GHz to approximately 8 GHz as P_s changes from 9 mm to 0.2 mm (Fig. <ref>(b)). When the switch position moves toward the edge (P_s changes toward 0.2 mm), the maximum phase difference increases, but it does not exceed ±180^∘ (Fig. <ref>(c)).\n\n\n\nThe relationship among the phase difference and the transmission amplitudes are illustrated in Fig. <ref>. The actual phase differences at different frequencies with varying switch positions are plotted alongside the calculated PDL curve based on the transmission amplitudes in Figure <ref>(a)-(b). The results show that the actual phase differences remain below the PDL curve and do not break it. Moreover, at certain switch positions, there are frequency points where  |T|=|T^ON_21|=|T^OFF_21|, and the relationship between |T| and the phase difference is depicted in Fig. <ref>(c). The findings confirm that for any given |T| value, the corresponding Δθ is near the PDL curve without breaking it, which supports the conclusion that the two transmission coefficients are on the circle for symmetric structures, as discussed in Section III. The observed error is mainly due to the loss of the switch. \n\n \n\nIn summary, the simulation example presented in this study shows that the transmission phase is limited by the transmission amplitudes.\n\n\n\n\n §.§ Simulation Verification for Asymmetric Structures\n\n\nTo demonstrate the effect of asymmetry, a half ground plane is introduced beneath the dipole, breaking the symmetric condition, as shown in Fig. <ref>. The simulation is conducted in Ansys HFSS 2018, where the metal is assigned as PEC and no substrate is introduced for brevity. \nAn ideal switch without resistance is used with the following parameters: C_OFF=25 fF, L_OFF=30 pH; L_ON=30 pH.\nThe switch position P_s ranges from 1 mm to 11 mm, and the simulation frequency ranges from 5 GHz to 12 GHz with a step of 0.01 GHz.\n\n \n\nTo begin with, we want to confirm that the designed structure can produce asymmetric reflection coefficients. As illustrated in Fig. <ref>, the asymmetric reflection phase is defined as ϕ=(θ_1-θ_2)/2, where θ_1 and θ_2 represent the reflection phases from two ports, respectively. As depicted in Fig. <ref>(a)-(b), the asymmetric reflection phases are generally neither 0 nor π under both switch states, which confirms that the reflection coefficients from the two ports are asymmetric. Moreover, Fig. <ref>(c) shows the differences between the two asymmetric reflection phases, denoted by Δϕ. From 5 GHz to 9 GHz, Δϕ is neither 0 nor π, indicating that the two transmission coefficients should be within the circle when the amplitudes are not 1.\n\n\n\nFig. <ref> illustrates the transmission coefficients of the asymmetric RTA element under both switch states. At the ON state, the dipole induces a resonant frequency around 6.6 GHz. By adjusting the position of the switch at the OFF state, the transmission coefficients shift. As the switch moves closer to the edge of the dipole, the resonant frequency approaches 6.6 GHz. Additionally, the transmission phase differences between the two states vary, but they remain within the ±180^∘ phase limit.\n\n\n\nFig. <ref>(a)-(b) show the transmission amplitudes and phase differences. It is observed that, for all given transmission amplitudes, the phase differences remain within the PDL. Additionally, a special case is analyzed, where the two transmission amplitudes are equal, as shown in Fig. <ref>(c). It is found that the phase differeces are also within the maximum limit determined by the transmission amplitudes. Notably, some of the phase differeces can nearly reach the PDL, such as the point with Δθ≈150^∘, indicating that the two transmission coefficients lie on the circle. This is because Δϕ is close to 0, and it has been demonstrated in the Appendix that the two transmission coefficients should lie on the unit circle. Furthermore, some points in Fig. <ref>(c) do not reach the PDL, indicating that the two transmission coefficients are within the unit circle. These observations varify that, for asymmetric structures, the two transmission coefficients should lie on or within the unit circle.\n\n \n\n\n\n§ CONCLUSION\n\n\nThis paper presents a theory on the transmission efficiency limit of single-switch RTA elements. The RTA element can be modeled as a three-port microwave network. The study uses analytical derivations, geometric representation, and numerical simulations to show that the transmission coefficients under two states should be on or inside a unit circle with a diameter of 1 on the Smith chart. Additionally, it is found that the transmission phase difference has an upper limit determined by the transmission amplitudes. This result provides solid evidence that it is not feasible to achieve both high transmission amplitudes and large phase tuning range using a single-switch RTA element.\n\nThese conclusions are not limited to single-switch RTA elements, but also apply to other reconfigurable elements with the same three-port network topology. Examples of such elements include single-switch RRA elements with polarization conversion, the single-switch RTA elements based on near-field feeding method, planar reconfigurable elements with a single switch based on transmission-line feeding method, and so on.\n\n\n\nThis appendix analytically demonstrates that if Δϕ=0 or π, then T^OFF_21 should lie on the same circle as T^ON_21.\n\nStarting from (<ref>), let us consider the case where Δϕ=0. This simplifies (<ref>) to\n\n    (T^ON_21-T^OFF_21)^2=(T^ON_21-T^OFF_21-1+e^jφ)^2.\n\nThis equation has two sets of solutions.\n\n\t\n  * T^ON_21-T^OFF_21=T^ON_21-T^OFF_21-1+e^jφ, which simplifies to e^jφ=1. This means that T^OFF_21 varies on the same circle as T^ON_21.\n\t\n  * T^ON_21-T^OFF_21=-T^ON_21+T^OFF_21+1-e^jφ. This can be rearranged as\n\t\n    T^ON_21-T^OFF_21=1-e^jφ/2.\n\n\tBased on (<ref>), T^ON_21 can be written as\n\t\n    T^ON_21=e^j2θ^ON_21+1/2.\n\n\tSubstituting (<ref>) into (<ref>), T^OFF_21 is expressed as\n\t\n    T^OFF_21=e^j2θ^ON_21+e^jφ/2.\n\n\tGeometrically, this means that T^OFF_21 varies on the circle with diameter e^j2θ^ON_21, on which T^ON_21 also lies (when e^jφ=1), as shown in Fig. <ref>. This demonstrates that T^ON_21 and T^OFF_21 lie on the same circle.\n\t\n\n\n\n\n\nThen consider the case where Δϕ=π. (<ref>) simplifies as\n\n    (T^ON_21-T^OFF_21)^2=(T^ON_21+T^OFF_21-1-e^jφ)^2.\n\nThis equation has two sets of solutions.\n\n\t\n  * T^ON_21-T^OFF_21=T^ON_21+T^OFF_21-1-e^jφ, which leads to\n\t\n    T^OFF_21 = 1+e^jφ/2.\n\n\tObviously, T^OFF_21 lies on the circle with diameter 1, which implies that T^ON_21 and T^OFF_21 are on the same circle.\n\t\n  * T^ON_21-T^OFF_21=-T^ON_21-T^OFF_21+1+e^jφ, which leads to\n\t\n    T^ON_21 = 1+e^jφ/2.\n\n\tInserting (<ref>) into (<ref>), it is found that \n\t\t\n    e^jφ=e^j2θ^ON_21,\n\n\twhich means T^OFF_21 varies on the circle with a diameter of e^j2θ^ON_21, on which T^ON_21 also lies, as shown in Fig. <ref>. Thus, T^ON_21 and T^OFF_21 also lie on the same circle in this case.\n\n\n\n00\n\treflectarray  P. Nayeri, F. Yang, and A. Z. Elsherbeni, Reflectarray Antennas: Theory, Designs and Applications. New York, NY, USA: Wiley, 2018.\n\t\n\tRRA1 S. V. Hum and J. Perruisseau-Carrier, “Reconfigurable reflectarrays and array lenses for dynamic antenna beam control: A review,” IEEE Trans. Antennas Propag., vol. 62, no. 1, pp. 183–198, Jan. 2014.\n\tRRA2 P. Nayeri, F. Yang, and A. Elsherbeni, “Beam scanning reflectarray antennas: A technical overview and state of the art,” IEEE Antennas Propag. Mag., vol. 57, no. 4, pp. 32–47, Aug. 2015.\n\tRRA3 C. Liu, F. Yang, S. Xu, and M. Li, “Reconfigurable metasurface: A systematic categorization and recent advances,” arXiv preprint arXiv:2301.00593, 2023.\n\t\n\tFSS A. H. Abdelrahman, A. Z. Elsherbeni, and F. Yang, “Transmission phase limit of multilayer frequency selective surfaces for transmitarray designs,” IEEE Trans. Antennas Propag., vol. 62, no. 2, pp. 690–697, Feb. 2014.\n\t\n\ttratheory F. Yang, R. Deng, S. Xu, and M. Li, “Design and experiment of a near-zero-thickness high-gain transmit-reflect-array antenna using anisotropic metasurface,” IEEE Trans. Antennas Propag., vol. 66, no. 6, pp. 2853–2861, Mar. 2018.\n\t\n\tbit2 H. Yang et al., “A study of phase quantization effects for reconfigurable reflectarray antennas,” IEEE Antennas Wireless Propag. Lett., vol. 16, no. 5, pp. 302-305, Mar. 2017.\n\t\n\t\n\t\n\trra2 E. Carrasco, M. Barba, and J. A. Encinar, “X-band reflectarray antenna with switching-beam using pin diodes and gathered elements,” IEEE Trans. Antennas Propag., vol. 60, no. 12, pp. 5700–5708, Dec. 2012.\n\trra9 O. Bayraktar, O. A. Civi, and T. Akin, “Beam switching reflectarray monolithically integrated with RF MEMS switches,” IEEE Trans. Antennas Propag., vol. 60, no. 2, pp. 854–862, Feb. 2012.\n\trra3 H. Yang et al., “A 1-bit 10 × 10 reconfigurable reflectarray antenna: design, optimization, and experiment,” IEEE Trans. Antennas Propag., vol. 64, no. 6, pp. 2246-2254, June 2016.\n\trra6 H. Zhang, X. Chen, Z. Wang, Y. Ge and J. Pu, “A 1-bit electronically reconfigurable reflectarray antenna in X band,” IEEE Access, vol. 7, pp. 66567-66575, 2019.\n\trra7 X. Pan, F. Yang, S. Xu and M. Li, “A 10240-element reconfigurable reflectarray with fast steerable monopulse patterns,” IEEE Trans. Antennas Propag., vol. 69, no. 1, pp. 173-181, Jan. 2021.\n\trra1 H. Kamoda, T. Iwasaki, J. Tsumochi, T. Kuki and O. Hashimoto, “60-GHz electronically reconfigurable large reflectarray using single-bit phase shifters,”  IEEE Trans. Antennas Propag., vol. 59, no. 7, pp. 2524-2531, July 2011.\n\trra10 X. Pan, S. Wang, G. Li, S. Xu and F. Yang, “On-chip reconfigurable reflectarray for 2-D beam-steering at W-band,” in 2018 IEEE MTT-S International Wireless Symposium (IWS), 2018, pp. 1-4.\n\trra11 X. Pan, F. Yang and X. Nie, “Analysis and design of THz 1-bit RRA element with series inductance,” in 2021 IEEE International Symposium on Antennas and Propagation and USNC-URSI Radio Science Meeting (APS/URSI), 2021.\n\trra5 J. Han, L. Li, G. Liu, Z. Wu and Y. Shi, “A wideband 1 bit 12×12 reconfigurable beam-scanning reflectarray: Design fabrication and measurement,” IEEE Antennas Wireless Propag. Lett., vol. 18, no. 6, pp. 1268-1272, Jun. 2019.\n\trra8 B. J. Xiang, X. Dai, and K. M. Luk, “A wideband low-cost reconfigurable reflectarray antenna with 1-bit resolution,” IEEE Trans. Antennas Propag., vol. 70, no. 9, pp. 7439-7447, Sept. 2022.\n\trra4 H. Yang et al., “A 1600-element dual-frequency electronically reconfigurable reflectarray at X/Ku-band,”  IEEE Trans. Antennas Propag., vol. 65, no. 6, pp. 3024-3032, June 2017.\n\trra12 C. Liu, F. Yang, M. Li, and S. Xu, “Deep-learning-empowered inverse design for freeform reconfigurable metasurfaces,” arXiv preprint arXiv:2211.08296, 2022.\n\t\n\trratheory C. Liu et al., “A radiation viewpoint of reconfigurable reflectarray elements: Performance limit, evaluation method and design process,” arXiv preprint arXiv:2211.08632, 2023.\n\t\n\t\n\trta1 A. Clemente, L. Dussopt, R. Sauleau, P. Potier, and P. Pouliguen, “1-bit reconfigurable unit cell based on PIN diodes for transmit-array applications in X-band,” IEEE Trans. Antennas Propag., vol. 60, no. 5, pp. 2260–2269, Mar. 2012.\n\t\n\trta2 A. Clemente, L. Dussopt, R. Sauleau, P. Potier and P. Pouliguen, “Wideband 400-element electronically reconfigurable transmitarray in X band,” IEEE Trans. Antennas Propag., vol. 61, no. 10, pp. 5017-5027, Oct. 2014.\n\t\n\trta3 C. Huang, W. Pan, X. Ma and X. Luo, “1-bit reconfigurable circularly polarized transmitarray in X-band,” IEEE Antennas Wireless Propag. Lett., vol. 13, pp. 448-451, 2016.\n\t\n\trta4 L. Di Palma, A. Clemente, L. Dussopt, R. Sauleau, P. Potier and P. Pouliguen, “Circularly-polarized reconfigurable transmitarray in Ka-band with beam scanning and polarization switching capabilities,” IEEE Trans. Antennas Propag., vol. 65, no. 2, pp. 529-540, Feb. 2017.\n\t\n\trta5 M. Wang et al., “Design and measurement of a Ku-band pattern-reconfigurable array antenna using 16 O-slot patch elements with p-i-n diodes,” IEEE Antennas Wireless Propag. Lett., vol. 19, no. 12, pp. 2373-2377, Dec. 2020.\n\t\n\t\n\trta6 M. Wang, S. Xu, F. Yang and M. Li, “Design and measurement of a 1-bit reconfigurable transmitarray with subwavelength H-shaped coupling slot elements,” IEEE Trans. Antennas Propag., vol. 67, no. 5, pp. 3500-3504, May 2019.\n\t\n\trta7 Y. Wang, S. Xu, F. Yang and M. Li, “A novel 1 bit wide-angle beam scanning reconfigurable transmitarray antenna using an equivalent magnetic dipole element,” IEEE Trans. Antennas Propag., vol. 68, no. 7, pp. 5691-5695, July 2020.\n\t\n\trta8 H. Yu, J. Su, Z. Li and F. Yang, “A novel wideband and high-efficiency electronically scanning transmitarray using transmission metasurface polarizer,” IEEE Trans. Antennas Propag., vol. 70, no. 4, pp. 3088-3093, Apr. 2022.\n\t\n\trta9 Y. Xiao, F. Yang, S. Xu, M. Li, K. Zhu and H. Sun, “Design and implementation of a wideband 1-bit transmitarray based on a Yagi-Vivaldi unit cell,” IEEE Trans. Antennas Propag., vol. 69, no. 7, pp. 4229-4234, Jul. 2021.\n\t\n\t\n\t\n\t\n\trta10 B. D. Nguyen and C. Pichot, “Unit-cell loaded with PIN diodes for 1-bit linearly polarized reconfigurable transmitarrays,” IEEE Antennas Wireless Propag. Lett., vol. 18, no. 1, pp. 98-102, Jan. 2019.\n\t\n\trta11 C.-W. Luo, G. Zhao, Y.-C. Jiao, G.-T. Chen, and Y.-D. Yan, “Wideband 1 bit reconfigurable transmitarray antenna based on polarization rotation element,” IEEE Antennas Wireless Propag. Lett., vol. 20, no. 5, pp. 798–802, May 2021. \n\t\n\trta12 X. Wang, P. -Y. Qin, A. T. Le, H. Zhang, R. Jin and Y. Jay Guo, “Beam scanning transmitarray employing reconfigurable dual-layer huygens element,”  IEEE Trans. Antennas Propag., vol. 70, no. 9, pp. 7491–7500, Sep. 2022. \n\t\n\n\t\n\trta C. Liu, Y. Wu, F. Yang, S. Xu and M. Li, “Is it possible to design a 1-bit reconfigurable transmitarray element with a single switch?” IEEE Antennas Wirel. Propag. Lett., in press.\n\t\n\tnetwork D. M. Pozar, Microwave Engineering, New York, NY, USA:Wiley, 2011.\n\n\t\n\n\n"}