{"entry_id": "http://arxiv.org/abs/2303.06825v1", "published": "20230313025059", "title": "Best-of-three-worlds Analysis for Linear Bandits with Follow-the-regularized-leader Algorithm", "authors": ["Fang Kong", "Canzhe Zhao", "Shuai Li"], "primary_category": "cs.LG", "categories": ["cs.LG", "stat.ML"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1]Fang Kong\n1]Canzhe Zhao\n1]Shuai Li Corresponding author.\n\n\n\n\n\n[1]Shanghai Jiao Tong University\n\n\n\n[ ]{fangkong,canzhezhao, shuaili8}@sjtu.edu.cn\n\n\n Best-of-three-worlds Analysis for Linear Bandits with Follow-the-regularized-leader Algorithm\n    [\n    \n=============================================================================================\n\n\n\n\n\n\n    The linear bandit problem has been studied for many years in both stochastic and adversarial settings. Designing an algorithm that can optimize the environment without knowing the loss type attracts lots of interest. <cit.> propose an algorithm that actively detects the loss type and then switches between different algorithms specially designed for different settings. However, such an approach requires meticulous designs to perform well in all settings. Follow-the-regularized-leader (FTRL) is another popular algorithm type that can adapt to different environments. This algorithm is of simple design and the regret bounds are shown to be optimal in traditional multi-armed bandit problems compared with the detect-switch type algorithms. Designing an FTRL-type algorithm for linear bandits is an important question that has been open for a long time. In this paper, we prove that the FTRL-type algorithm with a negative entropy regularizer can achieve the best-of-three-world results for the linear bandit problem with the tacit cooperation between the choice of the learning rate and the specially designed self-bounding inequality.  \n    \n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\n\n\n\n\n\n\nThe linear bandit problem is a fundamental sequential decision-making problem, in which the learner needs to choose an arm to pull and will receive a loss of the pulled arm as a response in each round t <cit.>. Particularly, the expected value of the loss of each arm is the inner product between the pulled arm and an unknown loss vector. \nThe learning objective is to minimize the regret, defined as the difference between the learner's cumulative loss and the loss of some best arm  in hindsight. There are two common environments characterizing the schemes of the loss received by the learner.\nIn the stochastic environment, the loss vector is fixed across all rounds and the learner only observes a stochastic loss \n\nsampled from a distribution with the expectation being the inner product between the feature vector of the pulled arm and the loss vector. \nIn this line of research, it has been shown that the instance-optimal regret bound is of order O(log T) (omitting all the dependence on other parameters) <cit.>.\nMeanwhile, in the adversarial environment, the loss vector can arbitrarily change in each round. In this case, the minimax-optimal regret has been proved to be O(√(T)) <cit.>.\n\nWhile several algorithms are able to achieve the above (near) optimal regret guarantees in either stochastic environment <cit.> or adversarial environment <cit.>, these algorithms require prior knowledge about the regime of the environments. If such knowledge is not known a priori, the algorithms tailored to the adversarial environment will have too conservative regret guarantees in a stochastic environment. Also, without knowing such knowledge, the algorithms tailored to the stochastic environment may have linear regret guarantees in the adversarial environment and thus completely fail to learn. To cope with these issues, recent advances have emerged in simultaneously obtaining the (near) optimal regret guarantees in both the stochastic and adversarial environments, which is called the best-of-both-worlds (BoBW) result. \n\nFor the special case of multi-armed bandit (MAB) problems,\nalgorithms with (near) optimal regret in both adversarial and stochastic environments\nhave been proposed <cit.>.\nIn general, these algorithms can be divided into two approaches.\n\nThe first approach achieves the BoBW regret guarantees by conducting statistical tests to distinguish between the stochastic and adversarial environments. Then it will perform an irreversible switch\ninto adversarial operation mode if an adversarial environment is detected <cit.>. The other approach modifies the algorithms originally designed for adversarial bandits to achieve improved regret guarantee in the stochastic environment, without compromising the adversarial regret guarantee <cit.>. Compared with the first approach, the\nsecond approach has better adaptivity since it does not need to detect the nature of the environment.\n\nMore importantly, the second approach may have a tighter regret guarantee, and the follow-the-regularized-leader (FTRL) type\nalgorithm of <cit.> obtains regret guarantees that are optimal up to universal constants in both environments. For the linear bandit problem, while <cit.> achieve the BoBW result, their algorithm is based on the first approach, and hence still requires distinguishing between two kinds of environments. Therefore, a natural question is still open:\n\n\n\nDoes there exist an FTRL-type BoTW algorithm for linear bandits, with the same adaptivity to both the adversarial and (corrupted) stochastic environments?\n\nIn this paper, we give an affirmative answer to the above question, and hence solve the open problem of \n<cit.>. Specifically, we propose an algorithm based on the FTRL framework, which extends the similar idea of <cit.> for the MAB setting that runs a variant of FTRL with a special regularizer to handle both the stochastic and adversarial environments in the setting of the linear bandit. However, the extension is non-trivial as discussed by <cit.>, and our results require new ingredients regarding the theoretical analysis. In particular, the main challenge relies on regret analysis in the stochastic setting. Different from MAB problems, it is not easy to decompose the regret in stochastic linear bandits by the selecting times of each arm, since the number of arms can be huge and the exploration rate should depend on the linear structure. So we design the self-bounding inequality such that the regret is lower bounded by the product between the selecting times of all sub-optimal arms and a minimum reward gap Δ_min. Based on this special design to link the regret with the selecting times and the choice of the learning rate, we are able to bound the regret of our algorithm by O(log T) in the stochastic setting and O(√(T)) in the adversarial setting. \n\nAs a preliminary step, our analysis also contributes some new ideas for the BoTW problem in other online learning models with linear structures such as linear Markov decision processes (MDPs).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ RELATED WORKS\n\n\n\n  \nLinear Bandits\n\nLinear bandit is a fundamental model in online sequential decision-making problems. Its stochastic setting is originally proposed by <cit.>, and first solved by <cit.> using the optimism principle. Subsequently, the regret guarantees of this problem have been further improved by several algorithms <cit.>. The adversarial setting dates back to <cit.>. The first O(√(T)) expected regret bound is obtained by the Geometric Hedge algorithm proposed by <cit.>. Latter, <cit.> establish the first computationally efficient algorithm achieving O(√(T)) regret guarantee based on the FTRL framework. \n<cit.> further obtain the regret guarantee that is minimax optimal up to a logarithmic factor. \nThe recent work of <cit.> achieves the (near) optimal instance-dependence regret and minimax optimal regret in stochastic and adversarial environments respectively, via establishing a detect-switch type algorithm.\nFor linear bandits in a corrupted stochastic setting, <cit.> first obtain an instance-dependent regret guarantee, with an additional corruption term depending on the corruption level C  linearly and on T logarithmically. Subsequently, <cit.> attain the instance-independent bound in the same setting. For the more general setting of  linear contextual\nbandits where the arm set may vary in each round and can even be infinite, <cit.> establish the sublinear instance-independent and/or instance-dependent regret guarantees. Remarkably, <cit.> obtain the near-optimal instance-independent regret guarantees for both the corrupted and uncorrupted cases with the leverage of a weighted ridge regression scheme.\n\n\n\n\n\n  \nBest-of-Both-Worlds Algorithms \nThe best-of-both-worlds (BoBW) algorithms aim to obtain the (near) optimal theoretical guarantees in both the stochastic and adversarial environments simultaneously,\nand have been extensively investigated for a variety of problems in the online learning literature, including MAB problem <cit.>, linear bandit problem <cit.>, combinatorial semi-bandit problem <cit.>, the problem of bandits with graph feedback <cit.>, online learning to rank <cit.>,\nthe problem of prediction with expert advice <cit.>,\nfinite-horizon tabular Markov decision processes <cit.>,\nonline submodular minimization <cit.>, and partial monitoring problem <cit.>. \n\n\nIn addition to investigating the BoBW results for stochastic and adversarial environments, devising algorithms that can simultaneously learn in the stochastic environment with corruptions also gains lots of research attention recently <cit.>. Particularly, algorithms with (near) optimal regret guarantees in adversarial, stochastic, and corrupted stochastic environments are typically called the best-of-three-worlds (BoTW) algorithms. In this work, we are interested in achieving the BoTW results in the linear bandit problem, but without using a detect-switch type algorithm similar to that of <cit.>. Instead, we aim to achieve the BoTW results for linear bandits by devising an FTRL-type algorithm, whose key idea is to leverage the self-bounding property of regret. \n\nSimilar ideas have been used to obtain BoBW results <cit.> as well as the BoTW results <cit.> in various settings.\n\n\n\n\n§ PRELIMINARIES\n\n\n\n\n\nIn this section, we present the basic preliminaries regarding the linear bandit problem, \nin both the adversarial environments and stochastic environments (with possibly adversarial corruptions).\n\n\n\n\n\n\n\n\n\nWe denote by D∈ℝ^d the finite arm set with d being the ambient dimension of the arm feature vectors <cit.>. We further assume that D spans ℝ^d and x_2≤ 1 for all x∈ D <cit.>. In each round t, the learner needs to select an arm x_t∈ D. Meanwhile, there will be an unknown loss vector θ_t∈ℝ^d determined by the environment. Subsequently, the loss ℓ_t(x_t) of the chosen arm x_t will be revealed to the learner. Particularly, ℓ_t(x_t)=⟨ x_t,θ_t⟩+ϵ_t(x_t) in linear bandits, with ϵ_t(x_t) being some independent zero-mean noise. The performance of one algorithm is measured by the regret (a.k.a., expected pseudo-regret), defined as\n\n    R(T)=𝔼[∑_t=1^Tℓ_t(x_t)-∑_t=1^Tℓ_t(x^∗)] ,\n\nwhere x^∗∈_x∈ D𝔼[∑_t=1^Tℓ_t(x)] is the best arm in expectation in hindsight, and the expectation is taken over the randomness of both the loss sequences ℓ_t and the internal randomization of the algorithm.\n\n\nFor linear bandits in adversarial environment, \nθ_t is chosen by an adversary arbitrarily in each round t. In this work, we consider the non-oblivious adversary, \n\nwhich means that the choice of θ_t may potentially depend on the history of the learner's actions {x_τ}_τ=1^t-1 up to round t-1, in addition to the adversary's own internal randomization.\n\nAlso, for ease of exposition, we assume ϵ_t(x_t)=0 for all t in the adversarial environment. In the following, we present the definition of a general environment, which is first formalized by <cit.> and subsumes the stochastic and corrupted stochastic environments as special cases.\n\n\n\n\nLet C>0 and Δ∈[0,2]^|D|.\nAn environment is defined as the adversarial regime with a (Δ, C, T) self-bounding constraint, if for any algorithm, the regret satisfies \n\n    R(T)≥∑_t=1^T∑_x∈ DΔ(x)ℙ(x_t=x)-C .\n\n\nThe stochastic environment satisfies θ_t=θ for some fixed but unknown θ.\nHence it has regret R(T)=𝔼[∑_t=1^T Δ(x_t)] with Δ(x)=⟨ x-x^∗,θ⟩ for all x∈ D. It follows that a stochastic environment is also an adversarial regime with a (Δ,0,T) self-bounding constraint.\nFor this case, we assume the optimal arm x^* to be unique as previous works studying stochastic linear bandits <cit.> and BoTW problems <cit.>.\n\n\n\nFor the corrupted stochastic environment, it is also satisfied that θ_t=θ for some unknown θ, but the learner now receives loss ℓ_t(x_t)=⟨ x_t,θ_t⟩+ϵ_t(x_t)+c_t, where c_t is the corrupted value chosen by the adversary in each round t and may depend on the historical information {(ℓ_τ,x_τ)}_τ=1^t-1. \nWe note that the corrupted stochastic environment considered in this work is slightly more general than that considered by <cit.>, since we do not impose any structural assumptions over c_t, while they further assume c_t is linear in x_t. As aforementioned, the corrupted stochastic environment is also an instance of the adversarial regime with a self-bounding constraint. To see this, let C=∑_t=1^T|c_t| be the corruption level, indicating the total amount of the corruptions. Then  a corrupted stochastic environment has regret satisfying Eq. (<ref>), and hence it is an instance of the adversarial regime with a (Δ, C, T) self-bounding constraint.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ALGORITHM\n\nIn this section, we present the proposed algorithm for linear bandits in both adversarial and (corrupted) stochastic environments, and detail its pseudo-code in Algorithm <ref>.\n\nIn general, our algorithm follows from the basic idea of FTRL that chooses the arm which minimizes the cumulative loss of past rounds together with the regularizer.\nIn specific, at each round t, our algorithm computes the regularized leader q_t by solving the following optimization problem (Line <ref>):\n\n    q_t ∈_p∈Δ(D)∑_s=1^t-1ℓ̂_s, p + ψ_t(p)  ,\n\nwhere Δ(D) is the probability simplex over D, ℓ̂_s is the loss estimate in round s to be defined later and ψ_t(p) is the regularizer. In this work, different from the\ncomplex (hybrid) regularizers used in previous works studying FTRL-type BoTW algorithms <cit.>, we simply choose the negative Shannon entropy as the regularizer:\n\n    ψ_t(p) = β_t ∑_x∈ D p(x)ln p(x) ,\n\n\nwhere β_t is the time-varying learning rate, whose concrete value is postponed to Theorem <ref>.\n\nThen, to permit enough exploration and control the variance of the loss estimates, our algorithm mixes the regularized leader q_t with a distribution π of the G-optimal \ndesign over the arm set D (Line <ref>):\n\n    p_t = γ_t ·π + (1-γ_t)· q_t ,\n\nwhere γ_t is a time-varying hyper-parameter to be chosen later.\nIn particular, the  G-optimal design distribution π is chosen such that\nπ∈_ρ∈Δ(D) g(ρ), where g(ρ)=max _x ∈ Dx_V(ρ)^-1^2 and V(ρ)=∑_x ∈ Dρ(x) x x^⊤ for any ρ∈Δ(D).\n A similar exploration strategy can also be found in the work of <cit.>. Subsequently, our algorithm samples action from the mixed distribution p_t, and observes the corresponding loss ℓ_t(x_t) (Line <ref>).\n \nAt the end of each round t, our algorithm constructs a least squares loss estimate ℓ̂_t(x) for each x∈ D (Line <ref>):\n\n    ℓ̂_t(x) = x^⊤Σ_t^-1x_t ℓ_t(x_t) ,\n\nwhere Σ_t = ∑_x∈ D p_t(x)xx^⊤ is the covariance matrix in terms of p_t. It is clear that ℓ̂_t is an unbiased estimate of the true loss ℓ_t, conditioned on p_t.\n\n\n\n\n\n\n\n\n\n\n\n  \nComparisons with Previous Methods \nAt a high level, our algorithm and previous works achieving the BoTW results share the similar idea that using the FTRL framework together with a carefully chosen regularizer to achieve (near) optimal regret guarantees in both the adversarial and (corrupted) stochastic environments <cit.>. \nHowever, perhaps surprisingly, our algorithm uses a rather common negative entropy entropy as the regularizer. This brings the computational efficiency compared with their complex or even hybrid regularizers, but also requires new ingredients that are not leveraged in previous works to obtain the desired BoTW regret guarantees for linear bandits.\n\nBesides, compared  with the algorithm of <cit.> that also obtains the BoTW regret guarantees for linear bandits, our algorithm departs from theirs significantly since we do not need to determine the nature of the environment, which is required by their detect-switch type algorithm.\nConsequently, our algorithm is conceptually simpler than that of <cit.>  and has the same adaptivity to all kinds of environments. More importantly, our algorithm has a regret guarantee with the same order as that of <cit.> in adversarial environment, and a tighter regret guarantee than theirs in corrupted stochastic environment, as we shall see in the analysis.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the following theorem, we present the regret guarantees in all environments of Algorithm <ref>.\n\n\nthmthmregret\nChoose ψ_t(p) = β_t ∑_x∈ D p(x)ln p(x):= -β_t H(p), γ_t = ming(π)/β_t,1/2 where β_t is of the following value\n\n    d√(ln T/ln |D|)+∑_τ=1^t-1d√(ln T/ln |D|)/√(1+ln |D|^-1∑_s=1^τ H(q_s) ) .\n \nOur algorithm <ref> satisfies that:\n\n    \n  * In the adversarial environment, the regret can be upper bounded by\n    \n    R(T) ≤    = Od√(Tln T ln(|D|T)) .\n\n    \n  * In the stochastic environment with corruption level C, the regret can be bounded by\n    \n    R(T) ≤ O  d^2ln T ln (|D|T) /Δ_min + √(Cd^2ln T ln (|D|T)/Δ_min) .\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \nDiscussions. \nDue to the simple design and the potential to achieve better theoretical guarantees like previous works for multi-armed bandits (MAB), we believe deriving BOTW analysis for an FTRL-type algorithm is worthwhile even though a detect-switch one exists.  \nOur work provides a solution for the open problem in <cit.>. \n\n\nOne of the main challenges is to discover the optimal exploration rate in the stochastic setting as pointed out by <cit.>.    \nSimilar to previous FTRL algorithms for the multi-armed bandit problem <cit.>, the instance-dependent regret mainly relies on the self-bounding inequality that lower bounds the regret by the selecting probability of arms. However, in linear bandits, the regret upper bound does not explicitly depend on the selecting probability of each arm due to the linear structure and simply decomposing the regret by the regret caused by each arm may bring the dependence on the number of arms, which is not realistic in linear bandit problem as the number of arms can be huge. \nSo we mainly care about the minimum reward gap Δ_min that characterizes the problem hardness and designs the self-bounding inequality by treating all sub-optimal arms together as shown in Lemma <ref>.\n\n\n\n(Self-bounding inequality)\n\nAlgorithm <ref> with Definition <ref> satisfies that\n\n    R(T) ≥1/2∑_t=1^T (1-q_t(x^*))Δ_min -  C  .\n\n\n\n\n\n\n\n    R(T)    ≥∑_t=1^T ℓ_t(x_t) - ℓ_t(x^*) - C\n       = ∑_t=1^T ℓ_t, p_t - p^* - C\n       ≥∑_t=1^T (1-γ_t) ℓ_t, q_t - p^*  - C\n       = ∑_t=1^T (1-γ_t) ∑_x q_t(x)  Δ(x)    - C \n       ≥1/2∑_t=1^T 1-q_t(x^*)Δ_min - C ,\n\nwhere the last inequality holds by choosing γ≤ 1/2. \n\n\n\n\n\n\n\n\n\nThe other key to achieving the BoTW results is the choice of the learning rate. \nBased on the standard analysis of the FTRL algorithm, the regret can be decomposed as \n\n    R(T) ≤ O∑_t=1^T 1/β_t  + (β_t+1 -β_t) H(q_t+1) .\n\nIn the adversarial setting, we hope to get an O(√(T)) regret, the natural choice is to select β_t = O(√(t)) as both ∑_t 1/√(t) = O(√(t)) and ∑_t √(t+1)-√(t) = O(√(t)). While in the stochastic setting, we aim to get an O(log T) regret, so it would be natural to choose β_t = O(t) as H(q_t) tends to be 0 when the policy always selects the unique optimal arm. Inspired by the motivation that H(q_t) can be regarded as a constant term in the adversarial setting  and a decreasing sequence that eventually tends to 0 in the stochastic setting, we set the learning rate β_t as O∑_τ=1^t 1/√(∑_s=1^τH(q_s) ).\n\n\n\n\n\n\n\nThe cooperation of the specially designed self-bounding inequality  and the choice of β_t_t contributes to the final results. The detailed proof is deferred to the next section. \n\n\n\n\n\n\n§ THEORETICAL ANALYSIS\n\nThis section provides the proof of Theorem <ref>. \n\nWe first present some useful lemmas and the main proof would come later. \n\n\nThe regret can be decomposed in the form of the cumulative entropy of exploitation probability q_t as the following lemma. \n(Regret Decomposition)\n    By choosing β_t = c+∑_τ=1^t-1c/√(1+ln |D|^-1∑_s=1^τ H(q_s) ) and γ_t = ming(π)/β_t,1/2, the regret can be bounded as\n    \n    R(T)=    Odln T/c√(ln |D|)  + c√(ln |D|)√(∑_t=1^T H(q_t)) .\n\n\n\n\n    R(T) =   ∑_t=1^T ℓ_t(x_t) - ℓ_t(x^*)\n    \n        =   ∑_t=1^T ℓ_t, p_t - p^*\n    \n        =   ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - p^* + ∑_t=1^T  γ_tℓ_t, π - p^*\n    ≤   ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - p^* + ∑_t=1^T  γ_t \n        \n    ≤   ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - q_t+1 - D_t(q_t+1,q_t) + ψ_t(q_t+1) -   ψ_t+1(q_t+1)\n       + ψ_T+1(p^*) - ψ_1(q_1) + ∑_t=1^T  γ_t \n    \n         =   ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - q_t+1 - D_t(q_t+1,q_t) + (β_t+1-β_t) H(q_t+1)\n       + ψ_T+1(p^*) - ψ_1(q_1) + ∑_t=1^T  γ_t \n    ≤   ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - q_t+1 - D_t(q_t+1,q_t)_part  1 + (β_t+1-β_t) H(q_t+1) +β_1 ln |D|+ ∑_t=1^T  γ_t  \n    ≤   ∑_t=1^T  2d/β_t + (β_t+1-β_t) H(q_t+1)_part 2 +β_1 ln |D| \n    ≤   ∑_t=1^T  2d/β_t + 2c √(ln |D| ∑_t=1^T H(q_t))  +cln |D|    \n    ≤   2d ∑_t=1^T √(1+ln |D|^-1∑_s=1^t H(q_t))/c· t + 2c √(ln |D| ∑_t=1^T H(q_t))  +cln |D| \n    ≤    Odln T/c√(ln |D|)√(∑_t=1^T H(q_t))  + c√(ln |D|)√(∑_t=1^T H(q_t)) .\n\nwhere Eq. (<ref>) holds due to x_t ∼ p_t, Eq. (<ref>) holds since ℓ̂_t is an unbiased estimator, Eq. (<ref>) is because ℓ_t, π - p^*≤ 1, Eq. (<ref>) is based on Lemma <ref>, Eq. (<ref>) holds according to Lemma <ref> and the choice of γ_t =min g(π)/β_t, 1/2≤ d/β_t, Eq. (<ref>) and (<ref>) are due to Lemma <ref> and the choice of β_t, the last inequality is based on Jensen's inequality.  \n\n\nWe next provide Lemma <ref>,  <ref> and <ref> that is used in the above analysis. \n\n\n\n\n\n\n(Decomposition of FTRL, Exercise 28.12 in <cit.>)\n    \n    ∑_t=1^T  ℓ̂_t, q_t - p^*≤   ∑_t=1^T ℓ̂_t, q_t - q_t+1 - D_t(q_t+1,q_t) + ψ_t(q_t+1) -   ψ_t+1(q_t+1)\n       + ψ_T+1(p^*) - ψ_1(q_1) .\n\n\n\n\n\n\n\n\n(Bound Part 1)\n    \n    ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - q_t+1 - D_t(q_t+1,q_t)≤∑_t=1^T 2d/β_t .\n\n\n\n    \n    ∑_t=1^T (1-γ_t) ℓ̂_t, q_t - q_t+1 - D_t(q_t+1,q_t)\n    ≤   ∑_t=1^T (1-γ_t)β_t ∑_x∈ Dq_t(x)exp(-ℓ̂_t(x)/β_t ) +ℓ̂_t(x)/β_t -1  \n    ≤   ∑_t=1^T (1-γ_t)β_t ∑_x∈ Dq_t(x)ℓ̂^2_t(x)/β^2_t  \n    \n            =   ∑_t=1^T (1-γ_t)/β_t∑_x∈ Dq_t(x)ℓ̂^2_t(x)   \n    ≤   ∑_t=1^T 1/β_t∑_x∈ Dp_t(x)ℓ̂^2_t(x)    ,\n\nwhere Eq. (<ref>) is based on <cit.>, Eq. (<ref>) holds due to exp(-a)+a-1≤ a^2 when a≥ -1 and Lemma <ref>, Eq. (<ref>) is because q_t  = (p_t - γ_t π)(1-γ_t) ≤ p_t/(1-γ_t). \n\n    Recall that ℓ̂_t(x) = x^⊤Σ_t^-1 x_t ℓ_t(x_t). We have\n    \n    ℓ_t(x)^2 = ℓ_t(x_t)^2 x_t^⊤Σ_t^-1 x x^⊤Σ_t^-1 x_t ≤ x_t^⊤Σ_t^-1 x x^⊤Σ_t^-1 x_t\n\n    and further, \n    \n    ∑_x p_t(x) ℓ_t(x)^2 ≤∑_x p_t(x)x_t^⊤Σ_t^-1 x x^⊤Σ_t^-1 x_t  = x_t^⊤Σ_t^-1 x_t = (x_tx_t^⊤Σ_t)  .\n\n    Above all, \n    \n    ∑_x p_t(x) ℓ_t(x)^2≤∑ x x^⊤Σ_t = d  .\n\n    Lemma <ref> is then proved. \n\n\n\n\n\n(Bound Part 2)\n    By choosing β_t = c+∑_τ=1^t-1c/√(1+ln |D|^-1∑_s=1^τ H(q_s) ),\n    \n    ∑_t=1^T (β_t+1-β_t)H(q_t+1) ≤ 2c √(ln |D| ∑_t=1^T H(q_t)) .\n\n\n\n    Based on the definition of β_t, it holds that\n    \n    ∑_t=1^T (β_t+1-β_t)H(q_t+1) =    ∑_t=1^T c/√(1+ln |D|^-1∑_s=1^t H(q_s) ) H(q_t+1) \n    ≤   √(ln |D|)∑_t=1^T c/√(ln |D|+ ∑_s=1^t H(q_s) ) H(q_t+1) \n    \n            =    2√(ln |D|)∑_t=1^T c/√(ln |D|+ ∑_s=1^t H(q_s) ) + √(ln |D|+ ∑_s=1^t H(q_s) ) H(q_t+1)\n    ≤    2√(ln |D|)∑_t=1^T c/√(∑_s=1^t+1 H(q_s) ) + √(∑_s=1^t H(q_s) ) H(q_t+1) \n    \n            =    2c√(ln |D|)∑_t=1^T √(∑_s=1^t+1 H(q_s) ) - √(∑_s=1^t H(q_s) )\n    \n            =    2c√(ln |D|)√(∑_s=1^T+1 H(q_s) ) - √(  H(q_1) )\n    ≤     2c√(ln |D|)√(∑_t=1^T H(q_t) ) ,\n\n    where the last two inequalities holds since H(q_t) ≤ H(q_1) = ln |D| for any t. \n\n\n    Denote Σ(π) = ∑_x∈ Dπ(x) xx^⊤ and g(π) = max_x∈ D x^⊤Σ(π)^-1 x. By choosing γ_t =\n    ming(π)/β_t,1/2, we have ℓ̂_t(x)/β_t ≥ -1 for all x∈ D. \n\n\n\n\n\nSince Σ_t = ∑_x p_t(x) xx^⊤ = ∑_x  (1-γ_t)q_t(x) + γ_t π(x) xx^⊤≽∑_x γ_t π(x) xx^⊤ = γ_tΣ(π), we have \n\n    Σ_t^-1≼1/γ_tΣ(π)^-1 .\n\nFurther, \n\n    x^⊤Σ_t^-1x_t ≤x_Σ_t^-1x_t_Σ_t^-1≤max_v∈ D v^⊤Σ_t^-1v ≤1/γ_tmax_v∈ D v^⊤Σ(π)^-1v = g(π)/γ_t .\n\nWith the choice of γ_t, it holds that\n\n    ℓ̂_t(x)/β_t = 1/β_t x^⊤Σ_t^-1 x_t ℓ_t(x_t)  ≤1/β_t x^⊤Σ_t^-1 x_t  ≤g(π)/β_t γ_t≤ 1 ,\n\nThe last inequality is due to the choice of β_t and the fact that g(π)≤ d. \n\n\n\n\n\n\n\nRecall that we have already decomposed the regret by the cumulative entropy of the exploitation probability q_t_t. The next lemma further links the cumulative entropy with the expected selecting times on sub-optimal arms. \n\n(Relationship between H(q_t) and regret)\n    \n    ∑_t=1^T H(q_t) ≤∑_t=1^T(1-q_t(x^*))lne|D|T/∑_t=1^T(1-q_t(x^*))\n\n\n\n\n\n    According to the definition of H(p) for a distribution p over D and the fact that the optimal arm x^* ∈ D is unique, we can bound H(p) as\n    \n    H(p) = ∑_x p(x)ln1/p(x) =     p(x^*)lnp(x^*)+1-p(x^*)/p(x^*) + ∑_x≠ x^*p(x)ln1/p(x)\n    ≤    p(x^*)1-p(x^*)/p(x^*) + ∑_x≠ x^*p(x)ln1/p(x)\n    ≤    1-p(x^*) + (|D|-1) ∑_x≠ x^*p(x)/|D|-1ln|D|-1/∑_x≠ x^*p(x)\n    \n            =    (1-p(x^*)) 1+ln|D|-1/(1-p(x^*)) ,\n\n    where the last inequality is due to Jensen's inequality. \n\n    Above all, \n    \n    ∑_t=1^T H(q_t) ≤   ∑_t=1^T (1-q_t(x^*)) 1+ln|D|-1/(1-q_t(x^*))\n    ≤   ∑_t=1^T (1-q_t(x^*)) 1+lnT(|D|-1)/∑_t=1^T(1-q_t(x^*))\n    ≤   ∑_t=1^T(1-q_t(x^*))lne|D|T/∑_t=1^T(1-q_t(x^*)) .\n\n\n\nBased on Lemma <ref> and <ref>, we are now able to upper bound the regret as below. \n\n    \n    R(T) ≤    Odln T/c√(ln |D|) +c√(ln |D|)√(∑_t=1^T H(q_t))\n    ≤    Odln T/c√(ln |D|) +c√(ln |D|)√(∑_t=1^T(1-q_t(x^*))lne|D|T/∑_t=1^T(1-q_t(x^*))_term A)\n    ≤     Odln T/c√(ln |D|) +c√(ln |D|)√(lne|D|Tmaxe, ∑_t=1^T(1-q_t(x^*)) )\n    \n           =    Odln T/c√(ln |D|) +c√(ln |D|)√(lne|D|Tmaxe, ∑_t=1^T(1-q_t(x^*)))\n    \n           =    O d√(ln T)·√(lne|D|Tmaxe, ∑_t=1^T(1-q_t(x^*))) ,\n\n    where Eq. (<ref>) holds since term A ≤∑_t=1^T(1-q_t(x^*)) ln |D|T if ∑_t=1^T(1-q_t(x^*)) > e and term A ≤ e ln e|D|^2T/(|D|-1)=O(elne|D|T) otherwise as ∑_t=1^T(1-q_t(x^*)) ≥ 1-q_1(x^*) = 1-1/|D|; Eq. (<ref>) is due to c=d√(ln T/ln |D|).  \n\n\n    \n\n\n  \nRegret analysis in the adversarial setting.\n    \n    According to Eq. (<ref>), since ∑_t=1^T (1-q_t(x^*)) ≤ T, it holds that\n    \n    R(T) ≤    Od√(ln T)√(lne|D|T· T   ) = Od√(Tln T ln(|D|T)) .\n\n\n\n\n  \nRegret analysis in the stochastic setting with corruptions.\nAccording to Lemma <ref>, \n\n    \n    R(T) =    (1+λ)R(T) - λ R(T) \n    ≤    O( (1+λ)· d√(ln T)·√(lne|D|Tmaxe, ∑_t=1^T(1-q_t(x^*))). \n       . -1/2λ∑_t=1^T (1-q_t(x^*))Δ_min +λ C  ) \n    ≤       O(1+λ)^2 d^2ln T ln (|D|T) /2λΔ_min + λ C \n    \n            =    Od^2ln T ln (|D|T)/2λΔ_min +   d^2ln T ln (|D|T) /Δ_min + λ  d^2ln T ln (|D|T) /2Δ_min + λ C \n    ≤    O  d^2ln T ln (|D|T) /Δ_min + √(Cd^2ln T ln (|D|T)/Δ_min) ,\n\nwhere Eq. (<ref>) holds since a√(x) - bx/2 = a^2/2b - 1/2 a/√(b) - √(bx)≤ a^2/2b\nfor any a,b,x≥ 0; Eq. (<ref>) holds by choosing λ = √( d^2ln T ln (|D|T)/(2Δ_min)/ d^2ln T ln (|D|T)/(2Δ_min) +C   ). \n\nFurther, in the purely stochastic setting with C=0, we can conclude R(T) = O  d^2ln T ln (|D|T) /Δ_min.\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\nIn this work, we establish the first FTRL-type BoTW algorithm for linear bandits. Our algorithm does not distinguish between the (corrupted) stochastic and adversarial environments and hence has better adaptivity than the detect-switch type algorithm of <cit.> for the same setting.\nWhen using the negative  Shannon entropy as a regularizer, we prove that our algorithm achieves O(d^2log^2 T/Δ_min+√(Cd^2log^2 T/Δ_min)) and  O(d√(Tlog^2 T )) regret guarantees in \ncorrupted stochastic and adversarial environments respectively. These results achieve similar or even better orderings than the previous detect-switch method <cit.> with a much simpler algorithmic design. \nAnd as a special case of linear MDP, we believe our analysis for linear bandits also provides new insights into the BoTW problem in linear MDPs.\n\n   \nStochastic linear bandit problem has a special property that the optimal result is the solution of an optimization problem which has no explicit form <cit.>. And our current approach provides a d/Δ_min dependence, a natural upper bound for the solution of this optimization problem. \nOne interesting future direction would be to investigate such optimal exploration rates under FTRL-type algorithms and derive regret bounds in the stochastic setting that enjoys the form of the solution to the optimization problem like <cit.>.\nAnalyzing the FTRL algorithm for the BoTW problem in linear MDPs is also an important future work. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nnamed\n\n\n\n"}