{"entry_id": "http://arxiv.org/abs/2303.06814v1", "published": "20230313021433", "title": "Implementing static Dyson-like spheres around spherically symmetric black hole spacetime", "authors": ["Shao-Wen Wei", "Yu-Peng Zhang", "Yu-Xiao Liu", "Robert B. Mann"], "primary_category": "gr-qc", "categories": ["gr-qc", "hep-th"], "text": "\n\n\n\n\n\n\n\n\n^1Lanzhou Center for Theoretical Physics, Key Laboratory of Theoretical Physics of Gansu Province, School of Physical Science and Technology, Lanzhou University, Lanzhou 730000, People's Republic of China,\n\n^2Institute of Theoretical Physics & Research Center of Gravitation,\nLanzhou University, Lanzhou 730000, People's Republic of China,\n\n^3 Department of Physics & Astronomy, University of Waterloo, Waterloo, Ont. Canada N2L 3G1\n\n\nUnique features of particle orbits would produce novel signatures of gravitational observable phenomena,  and are quite useful in testing compact astrophysical objects in general relativity or modified theories of  gravity. In this work, we observe a representative example that static, spherically symmetric dyonic black hole solution admit static points at finite radial distance. Considering the spherical symmetry, each static point shall produce a static sphere, which can be used to implement the well-known Dyson spheres aiming to collect the infrared radiation energy of the stellar sources. More interestingly, employing with the topological argument, we disclose that, the stable and unstable static spheres always come in pairs in an asymptotically flat spacetime if they exist. While the counterpart naked singularity has one more stable static sphere than the unstable one. Our results have potential application in constructing the Dyson spheres around the stellar sources.\n\n\n\n\n\n04.20.-q, 04.25.-g, 04.70.Bw\n\nImplementing static Dyson-like spheres around spherically symmetric black hole spacetime\n    Shao-Wen Wei^1,2 [weishw@lzu.edu.cn],\nYu-Peng Zhang^1,2 [zyp@lzu.edu.cn],\nYu-Xiao Liu^1,2 [liuyx@lzu.edu.cn],\nRobert B. Mann^3 [rbmann@uwaterloo.ca]\n    \n\n========================================================================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nExploring the nature of a black hole or spacetime in both weak and strong gravity regimes largely relies on the characteristic geodesic motions of test particles. Some characteristic phenomena, such as the ringdown of black hole binaries <cit.> and shadows <cit.>, can also be understood by the circular orbits of photons or massive particles. Further study also shows that semi orbits, pointy petal orbits, and static light points appear in rotating boson stars, hairy black holes, wormholes <cit.>, and higher-dimensional rotating black holes <cit.>, expecting to have potential signatures on observable effects. Recent developments can also be found in Refs. <cit.>.\n\nAnother intriguing object that has attracted a lot of attention is the Dyson sphere, proposed by  Freeman Dyson <cit.>, which was initially constructed around a star and designed to exploit all the infrared radiation energy of  stellar sources. Construction of an actual and rigid Dyson sphere is extremely hard to implement; for example,  the required elastic modulus of the material is very high <cit.>, exceeding that of the strongest known material, carbyne, by nine orders of magnitude <cit.>.\n Noting that the spacetime exterior to a  stellar source can be described by a black hole metric, here we aim to investigate  Dyson-like spheres around   black holes. For a class of rotating hairy black holes, it has been shown <cit.> that there is a static point at which a particle can remain at rest. Such an orbit, however, is limited to the equatorial plane of the rotating black hole. Thus only a thin static belt (see left panel of Fig. <ref>) could be formed around this object, with almost all the (Hawking) radiation energy leaking to infinity without being collected.\n\n\nSince the spin of a stellar source is usually small, we shall proceed to construct the Dyson-like sphere around a spherically symmetric black hole. Due to the spherical symmetry, a matter shell can be easily formed with an equatorial circular orbit described by the red circle shown in the right panel of Fig. <ref>. In order to maintain a rotating Dyson-likesphere, this configuration also has its limitations. For example, when one considers the matter shell rotating with the same angular momentum as the equatorial circular orbit, the matter component  undergoes non-geodesic motion at non-equatorial latitudes (the blue curves in Fig. <ref>), and thus experience an inner stress density. If its value is beyond the maximal stress tolerance of the material, the matter shell of the Dyson-like sphere will break up. In order to solve this problem, we need to keep the angular momentum of the equatorial circular orbit sufficiently small. This can be done for a static sphere at radius r_sp with vanishing angular velocity\n\n    Ω(r_sp)=0\n\nin a nonrotating black hole background.  Then each point on this sphere is a particular geodesic, the static point. The internal stress thus disappears and an actual Dyson-like sphere can be firmly formed on this static sphere for any material. In general relativity, minimally coupled to Standard Model matter,  such a sphere is absent. We shall show  that it indeed exists in nonlinear electrodynamics, and always comes in pairs.\n\n\n\n\n§ STATIC SPHERES AND STRAIGHT ORBITS\n\n\nLet us consider a static, spherically symmetric black hole with the following line element\n\n    ds^2=-f(r)dt^2+1/f(r)dr^2+r^2(dθ^2+sin^2θ dϕ^2),\n\nwhere f(r) is the metric function and is only dependent of the radial coordinate r. Without loss of generality, one needs only to focus on the equatorial geodesics with θ=π/2 for the study of geodesic motion of a test particle. With the two Killing vectors for the black hole background (<ref>), ξ^μ=(∂_t)^μ and ψ^μ=(∂_φ)^μ, one can obtain two conserved quantities\n\n    -E   =   g_μνu^μξ^ν=g_ttṫ, \n    \n     l   =   g_μνu^μψ^ν=g_φφφ̇,\n\nwhich are respectively the energy and orbital angular momentum per unit mass of a massive test particle, along each geodesic with tangent vector\nu^μ; the dots denote the derivative with respect to an affine parameter. For a massive test particle, we have g_μνẋ^μẋ^ν=-1, which leads to\n\n    -f(r)ṫ^2+1/f(r)ṙ^2+r^2ϕ̇^2=-1.\n\nWith the above three equations (<ref>)-(<ref>), one easily obtains\n\n    ṫ=E/f(r),  ϕ̇=l/r^2,  ṙ^2=-V_eff,\n\nwhere the effective potential is given by\n\n    V_eff = ( l^2/r^2 + 1 ) f(r) - E^2.\n\nFor a distant static observer at rest, the angular velocity of a massive test particle circling the black hole is\n\n    Ω=ϕ̇/ṫ=f(r)l/r^2E.\n\nOutside the black hole horizon, f(r)>0. So vanishing Ω requires\n\n    l=0,\n\nas expected. The reduced effective potential becomes\n\n    𝒱_eff=f(r)-E^2.\n\nThe static sphere is also a specific circular sphere, which satisfies 𝒱_eff=∂_r𝒱_eff=0. As a result, the following conditions should be satisfied:\n\n    E=√(f(r_sp)),   f'(r_sp)=0,\n\nwhere the prime denotes the derivative with respect to r, and r_sp is the radius of the static sphere. Note that f”(r_sp)>0 and <0 correspond to  stable and unstable static spheres, respectively, and so the former is of particular interest. Moreover, for the well known Schwarzschild and Reissner-Nordström black hole, there is no static sphere outside the black hole horizon.\n\n\nWe now investigate whether there are static spheres for other static spherically symmetric black holes. We consider   the dyonic black hole   <cit.>, which is a solution of the field equations that follow  from the action\n\n    S=1/16π∫√(-g)d^4x(R-α_1F^2-α_2\n       ((F^2)^2-2F^(4))),\n\nwhere the field strength is F^2=-F^μ_νF_μ^ν and F^(4)=F^μ_νF^ν_ρF^ρ_σF^σ_μ. The coupling parameters α_1 and α_2 are for the standard Maxwell and quasi-topological electromagnetic actions, respectively. Under the ansatz of  global polarization, this quasi-topological term has no influence on the Maxwell equation and the energy-momentum tensor. We shall see that  particular property yields interesting results.\n\n\nThe line element of a static and spherically symmetric black hole is given in the form (<ref>) with <cit.>\n\n    f(r)=1-2M/r+α_1 p^2/r^2\n     +q^2/α_1r^2 _2F_1\n        [1/4,1; 5/4; -4p^2α_2/r^4α_1],\n\nwhere p and q are the electric and magnetic charge parameters. In certain parameter regions, for example,\n\n    p/M=0.14,  q/M=1.02, α_1=1, α_2/M^2=2.76.\n\nthere are four black hole horizons and three photon spheres, indicating an interesting spacetime structure. In this case, outermost horizon of the black hole is located at r_h/M=0.25.\n\nPlotting the reduced effective potential (<ref>) in Fig. <ref> with parameter values given in (<ref>),  we observe one stable and one unstable static sphere at r_sp1 and r_sp2 for fixed energy E_sp1 and E_sp2 respectively. For each energy E∈ (E_sp1, E_sp2), there is a bound orbit. A neutral massive test particle will undergo straight back-and-forth motion between two turning points, for example r_1 and r_2 for E=0.25. Note that there is no angular motion due to the vanishing angular velocity.\n\n\n\n\n\nTaking   energies to be  E=0.2, 0.15, 0.14, and E_sp1=0.1393, we exhibit the radial motion of the particle starting at the small turning points in the r-t plane in Fig. <ref>. Obviously, when the energy decreases and tends to E_so1, the radial region of the motion narrows. In particular, when E=E_sp1 shown in Fig. <ref>, the radial distance remains unchanged with   coordinate time,   indicating there is a static sphere at r=r_sp1.\n\n\n\n\n\n\nIn summary, we observe two static spheres  – one stable and one unstable – for the static, spherically symmetric dyonic black hole. Thus a Dyson-like sphere can be appropriately constructed for this nonrotating black hole.\n\n\n\n\n§ NUMBER OF STATIC SPHERES\n\n\nWe now seek to determine  the number of the static spheres in the static, spherically symmetric black hole (<ref>). The approach was mainly developed in Refs. <cit.> for the light ring (see also <cit.>), and was then generalized to  timelike circular orbits <cit.>.\n\nIn order to satisfy the conditions for a static sphere given in (<ref>), we construct the vector ϕ=(ϕ^r, ϕ^θ) with\n\n    ϕ^r=∂ f(r)/∂ r,  ϕ^θ=-cosθ/sin^2θ.\n\nNote that ϕ^θ is an auxiliary term and whose explicit form is influenced by the location of the static sphere. Obviously a static sphere is  exactly located at a zero point of ϕ. For any given static sphere we can calculate its winding number, where a  positive (negative) value signifies a stable (unstable) static sphere. However, here we are concerned with the sum of the winding numbers, namely the total topological number W of the static spheres corresponding to the following topological current\n<cit.>\n\n    j^μ=1/2πϵ^μνρϵ_ab∂_νn^a∂_ρn^b,\n       μ,ν,ρ=0,1,2,\n\nwhere ∂_ν=∂/∂ x^ν and x^ν=(τ, r, θ) and the unit vector is defined as n^a=ϕ^a/||ϕ|| (a=1, 2). The parameter τ is a time control parameter. It is not hard to check that this current is conserved: ∂_μj^μ=0.\n\nTo determine W, we need to examine the behavior of the vector ϕ at the boundary of the r-θ plane. It is easy to find that at θ=0 and π the direction of ϕ is outwards. Near the horizon r=r_h,   f(r_h)=0 and f(r>r_h)>0;  thus ϕ^r is positive, which indicates the direction of ϕ is  rightward in the plane, ignoring the specific values of ϕ^θ. At large r,  for an asymptotically flat black hole\n\n    f(r)∼ 1-2M/r+𝒪(1/r^2)\n\nand so f'(r→∞)>0. This suggests that the direction of ϕ is also towards the right.\nCombining  these results, we easily obtain the total topological number\n\n    W=∑_i w_i=0,\n\nwhere w_i denotes the winding number of the i-th zero point of ϕ.  For   asymptotically flat, static, spherically symmetric black holes, this result strongly suggests that if static spheres exist, they always come in pairs. We shall see that this result   changes for naked singularities.\n\n\n\n\n\nAs shown in Ref. <cit.>, the black hole charge can be treated as a time control parameter. In order to study the evolution of the static sphere radius as the time control parameter, we choose the parameter values in (<ref>).\nFor q≤ q_2 and q>q_2, the metric (<ref>) respectively describes a dyonic black hole and   naked singularity, with f(r) given in (<ref>). The behavior of the radii of  static spheres is  shown in Fig. <ref>. From the figure, we find that two static spheres emerge only when q≥ q_1 for the black hole. The one with small radius has a negative winding number and so  is unstable, whereas the one with large radius has a positive winding number and  is stable. The total topological number   vanishes for q<q_1, where static spheres are absent. This  property continues   for all  q_1<q<q_2.\n\nAt extremality, with q=q_2, a  new stable static sphere with smaller radius emerges.\nFor q> q_2 the solution describes a naked singularity, and there are three static spheres; the topological number is W=1-1+1=1, notably different from the situation for a black hole. This situation persists for   q_2<q<q_3.\nFor q → q_3, the two smaller spheres merge, leaving only one static sphere of  large radius for q > q_3. Nevertheless, the topological number W=1 remains unchanged.\n\nWe summarize our results in Table <ref>. The topological number W clearly has distinct values\nfor  the black hole and naked singularity,  indicating they are in different topological classes.\n\n\n\n\n\n\n\n\n\n\n§ SUMMARY\n\n\nWe have investigated the construction of  Dyson-like spheres about a  static, spherically symmetric dyonic black hole and its naked singularity counterpart.\n We find that the black hole admits a pair of stable and unstable static spheres, at which a massive particle remains at rest with respect to a static asymptotic static observer.\n\nMaking use of a topological argument for static spheres in an asymptotically flat spacetime, we showed the black hole and naked singularity have distinct topological numbers  (W=0 and 1 respectively) for their static spheres.  These results\n confirm that the stable and unstable static spheres always come in pairs for asymptotically flat black holes.\nIt also indicates that the black hole and naked singularity solutions belong to different topological classes.    Moreover, if one   the naked singularity solution  can  be the exterior metric of some stellar structure, there would be a topological phase transition at q=q_2 for the static spheres.\n\nBesides realizing the static Dyson-like sphere, the presence of  static orbits could result in certain novel gravitational phenomena. For example, there may be one extra static or slow velocity accretion disk, in contrast to those formed at the usual innermost stable circular orbits. Since this orbit, which  acts as a light source, is  closer to the black hole, it will produce a different shadow pattern. Such double accretion disks will yield interesting observable effects, providing unique tests of general relativity.\n\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nThis work was supported by the National Natural Science Foundation of China (Grants No. 12075103, No. 12105126, No. 11875151, and No. 12247101), the 111 Project (Grant No. B20063), Lanzhou City's scientific research funding subsidy to Lanzhou University, and the Natural Sciences and Engineering Research Council of Canada.\n\n\n99\n\nAbbott\n B. P. Abbott et al. (Virgo, LIGO Scientific),\n Observation of Gravitational Waves from a Binary Black Hole Merger,\n  Phys. Rev. Lett. 116, 061102 (2016),\n   [arXiv:1602.03837 [gr-qc]].\n\nAkiyama1\n K. Akiyama et al. (Event Horizon Telescope),\n First M87 Event Horizon Telescope Results. I. The Shadow of the Supermassive Black Hole,\n Astrophys. J. 875, L1 (2019),\n  [arXiv:1906.11238 [astro-ph.GA]].\n\nAkiyama2\n K. Akiyama et al. (Event Horizon Telescope),\n First Sagittarius A* Event Horizon Telescope Results. I. The Shadow of the Supermassive Black Hole in the Center of the Milky Way,\n Astrophys. J. Lett. 930, L12 (2022).\n\nGrandclement\n P. Grandclement, C. Som, and E. Gourgoulhon,\n Models of rotating boson stars and geodesics around them: new type of orbits,\nPhys. Rev. D 90, 024068 (2014),\n [arXiv:1405.4837 [gr-qc]].\n\nGrould\n M. Grould, Z. Meliani, F. H. Vincent, P. Grandclement, and E. Gourgoulhon,\n Comparing timelike geodesics around a Kerr black hole and a boson star,\n Class. Quant. Grav. 34, 215007 (2017),\n [arXiv:1709.05938 [astro-ph.HE]].\n\nCollodel\n L. G. Collodel, B. Kleihaus, and J. Kunz,\n Static spheres in rotating spacetimes,\n Phys. Rev. Lett. 120, 201103 (2018),\n [arXiv:1711.05191 [gr-qc]].\n\nTeodoro\n M. C. Teodoro, L. G. Collodel, J. Kunz,\n Retrograde Polish Doughnuts around Boson Stars,\n JCAP 03, 063 (2021),\n [arXiv:2011.10288 [gr-qc]].\n\nYazadjiev\n M. C. Teodoro, L. G. Collodel, D. Doneva, J. Kunz, P. Nedkova, and S. Yazadjiev,\n Thick toroidal configurations around scalarized Kerr black holes,\n Phys. Rev. D 104, 124047 (2021),\n [arXiv:2108.08640 [gr-qc]].\n\nGibbons\n G. W. Gibbons and C. A. R. Herdeiro,\n Supersymmetric rotating black holes and causality violation,\n Class. Quant. Grav. 16, 3619 (1999),\n [arXiv:hep-th/9906098].\n\nHerdeiro\n C. A. R. Herdeiro,\nSpecial properties of five-dimensional BPS rotating black holes,\n Nucl. Phys. B 582, 363 (2000),\n [arXiv:hep-th/0003063].\n\nDiemer\n V. Diemer and J. Kunz,\n Supersymmetric rotating black hole spacetime tested by geodesics,\n Phys. Rev. D 89, 084001 (2014),\n [arXiv:1312.6540 [gr-qc]].\n\nDelgado\n J. F. M. Delgado, C. A. R. Herdeiro, and E. Radu,\n Equatorial timelike circular orbits around generic ultracompact objects,\n Phys. Rev. D 105, 064026 (2022),\n [arXiv:2107.03404 [gr-qc]].\n\nLehebel\n A. Lehebel and V. Cardoso,\n The fate of observers in circular motion,\n Phys. Rev. D 105, 064014 (2022),\n [arXiv:2202.08850 [gr-qc]].\n\nDyson\n F. J. Dyson,\n Search for Artificial Stellar Sources of Infrared Radiation,\n Science 131, 1667 (1960).\n\nPapagiannis\n M. D. Papagiannis,\n The Search for Extraterrestrial Life: Recent Developme,\n  IAU Symposium 112, 543 (1985).\n\nWright\n J. T. Wright,\n Dyson Spheres,\n  Ser. Astr. J. 200, 1 (2020), [arXiv:2006.16734 [astro-ph.EP]].\n\nLiu2020\nH.-S. Liu, Z.-F. Mai, Y.-Z. Li, and H. Lü,\nQuasi-topological Electromagnetism: Dark Energy, Dyonic Black Holes, Stable Photon Spheres and Hidden Electromagnetic Duality,\nSci. China Phys. Mech. Astron. 63, 240411 (2020), [arXiv:1907.10876 [hep-th]].\n\nCunhaa\n P. V. P. Cunha, E. Berti, and C. A. R. Herdeiro,\n  Light ring stability in ultra-compact objects,\n   \tPhys. Rev. Lett. 119, 251102 (2017),\n   [arXiv:1708.04211 [gr-qc]].\n\nCunhab\n P. V. P. Cunha and C. A. R. Herdeiro,\n  Stationary Black Holes and Light Rings,\n   \tPhys. Rev. Lett. 124, 181101 (2020),\n   [arXiv:2003.06445 [gr-qc]].\n\nWeisw\n S.-W. Wei,\n  Topological Charge and Black Hole Photon Spheres,\n   Phys. Rev. D 102, 064039 (2020),\n   [arXiv:2006.02112 [gr-qc]].\n\nGuo\n M. Guo and S. Gao,\n  Universal Properties of Light Rings for Stationary Axisymmetric Spacetimes,\n   Phys. Rev. D 103, 104031 (2021),\n   [arXiv:2011.02211 [gr-qc]].\n\nJunior\n H. C. D. L. Junior, J.-Z. Yang, L. C. B. Crispino, P. V. P. Cunha, and C. A. R. Herdeiro,\n  Einstein-Maxwell-dilaton neutral black holes in strong magnetic fields: topological charge, shadows and lensing,\n   Phys. Rev. D 105, 064070 (2022),\n   [arXiv:2112.10802 [gr-qc]].\n\nWeila\n S.-W. Wei and Y.-X. Liu,\n  Topology of equatorial timelike circular orbits around stationary black holes,\n      Phys. Rev. D 107, 064006 (2023), \n   [arXiv:2207.08397 [gr-qc]].\n\nDuan\n Y. S. Duan,\n The structure of the topological current,\n Stanford Linear Accelerator Center (SLAC), Report No. SLACPUB-\n3301, (1984).\n\n\n\n\n"}