{"entry_id": "http://arxiv.org/abs/2303.07332v1", "published": "20230313175221", "title": "3D hydrodynamics simulations of internal gravity waves in red giant branch stars", "authors": ["Simon Blouin", "Huaqing Mao", "Falk Herwig", "Pavel Denissenkov", "Paul R. Woodward", "William R. Thompson"], "primary_category": "astro-ph.SR", "categories": ["astro-ph.SR"], "text": "\n\nfirstpage–lastpage\nLifted particles from the fast spinning primary of the Near-Earth Asteroid (65803) Didymos\n    Paula G. Benavidez^1,4 \n    March 30, 2023\n==========================================================================================\n\n\n\n\nWe present the first 3D hydrodynamics simulations of the excitation and propagation of internal gravity waves (IGWs) in the radiative interiors of low-mass stars on the red giant branch (RGB). We use the PPMstar explicit gas dynamics code to simulate a portion of the convective envelope and all the radiative zone down to the hydrogen-burning shell of a 1.2 M_⊙ upper RGB star. We perform simulations for different grid resolutions (768^3, 1536^3 and 2880^3), a range of driving luminosities, and two different stratifications (corresponding to the bump luminosity and the tip of the RGB). Our RGB tip simulations can be directly performed at the nominal luminosity, circumventing the need for extrapolations to lower luminosities. A rich, continuous spectrum of IGWs is observed, with a significant amount of total power contained at high wavenumbers. By following the time evolution of a passive dye in the stable layers, we find that IGW mixing in our simulations is weaker than predicted by a simple analytical prescription based on shear mixing and not efficient enough to explain the missing RGB extra mixing. However, we may be underestimating the efficiency of IGW mixing given that our simulations include a limited portion of the convective envelope. Quadrupling its radial extent compared to our fiducial setup increases convective velocities by up to a factor 2 and IGW velocities by up to a factor 4. We also report the formation of a ∼ 0.2 H_P penetration zone and evidence that IGWs are excited by plumes that overshoot into the stable layers.\n\n\n\nhydrodynamics, methods: numerical, stars: evolution, stars: interiors, turbulence, waves\n\n\n\n\n§ INTRODUCTION\n\n\nWhen exiting the main sequence and entering the red giant branch (RGB), the outer layers of low-mass stars expand, cool down, and as a result become more opaque to radiation. This triggers convection in their envelopes, which brings up to the surface the products of H fusion. After this “first dredge-up”, no further changes to the atmospheric abundances of RGB stars are predicted by canonical stellar evolution theory, since the outer convective envelope remains isolated from the H-burning shell by a radiative zone that blocks the transport of species from the H-burning region to the surface.\n\nBut spectroscopic observations tell a different story. After the H-burning shell has crossed the composition discontinuity left at the maximal extent of the convective envelope during the first dredge-up (the so-called bump luminosity), the surface composition of nearly all low-mass RGB stars starts changing again. The ^13C and ^14N abundances increase, while the ^12C and ^7Li abundances decrease <cit.>. Those abundance changes are the signpost of H fusion and imply that species can be transported across the radiative zone that separates the H-burning shell from the convective envelope <cit.>.\n\nThe search for the extra mixing process responsible for this transport has been the subject of intense theoretical efforts for decades <cit.>. The most commonly invoked mechanism is thermohaline mixing (or fingering convection). This instability is triggered in RGB stars due to ^3He burning in the outskirts of the H-burning shell, which produces a depression in the mean molecular weight profile μ <cit.>. The efficiency of this mixing mechanism crucially depends on the aspect ratio of the “fingers” formed as a result of the μ profile inversion. The aspect ratios needed to produce enough mixing far exceed those predicted by numerical simulations, where more blob-like structures are observed <cit.>. This suggests that thermohaline mixing alone is not sufficient to explain the observed extra mixing and the quest for additional mixing mechanisms is still ongoing.\n\nInternal gravity waves (IGWs) are suspected to be an efficient species transport mechanism in the radiative zones of stellar interiors <cit.>. IGWs are caused by density perturbations in a stably stratified fluid and have buoyancy as a restoring force. In stellar interiors, they are stochastically excited by convective motions at the convective–radiative interface. Therefore, one can expect IGWs to be generated at the lower boundary of the convective envelope of RGB stars and to propagate inside the radiative zone that separates the H-burning shell from the convective envelope. This could provide an additional mixing mechanism for RGB stars. \n\nIn addition to transporting species, IGWs may also transport angular momentum <cit.>. Asteroseismological observations have revealed that the cores of RGB stars spin much faster than their envelopes <cit.>, but also much slower than if there was no additional angular momentum transport mechanism coupling the core to the envelope <cit.>. Current evolutionary models fail to predict this (relatively) slow rotation: an additional process that extracts angular momentum from the core is needed. IGWs <cit.> have been considered as a solution to this problem <cit.>.\n\nDue to the complex interplay between convective motions and the excitation and propagation of IGWs, detailed hydrodynamics simulations are required to accurately determine the properties of IGWs in stellar interiors and ultimately assess their impact on stellar evolution. Analytical approaches are also possible <cit.>, but they inevitably rely on a number of assumptions (e.g., the wave excitation mechanism, the shape of the power spectrum). Multi-dimensional hydrodynamics simulations of IGWs excitation and propagation have been performed for main-sequence stars <cit.>, but to our knowledge no results currently exist for RGB stars. In this work, we present the first hydrodynamics simulations of IGW excitation and propagation in RGB stars. We use the PPMstar gas dynamics code to perform three-dimensional, full-sphere, high-resolution simulations of two different phases in the evolution of a 1.2 M_⊙ star on the RGB. Based on these simulations, we present a first estimate of the mixing enabled by IGWs in RGB stars.\n\nIn Section <ref>, we describe the MESA models that we use as base states for our hydrodynamics simulations and explain how the latter are set up in PPMstar. We then discuss the overall properties of our simulations in Section <ref>, where we present high-resolution renderings of our simulations as well as radial profiles and power spectra. Mixing by IGWs is investigated in Section <ref> using two different approaches. Section <ref> is devoted to the influence of the size of the convective envelope on our results and Section <ref> to the properties of the convective boundary. Finally, our conclusions are stated in Section <ref>.\n\n\n\n§ METHODS\n\n\n\n\n §.§ MESA models\n\n\nWe use MESA version 7624 <cit.> to generate the initial states of our hydrodynamics simulations. We calculated the evolution of a 1.2 M_⊙ star from the pre-main sequence to the tip of the RGB. We assume an initial metallicity of [ Fe/H]=-0.3, and the mixing length theory (MLT) is used, with mixing length ℓ_ MLT = 2 H_P (where H_P is the pressure scale height). Figure <ref> displays the evolution of our model from the zero-age main sequence to the tip of the RGB in the theoretical Hertzsprung–Russell diagram. Two circles identify the two phases simulated in 3D in this work. The first one is just after the bump luminosity at log L/L_⊙=2.00 (this is our “bump setup”), and the second one is very close to the tip of the RGB at log L/L_⊙=3.33 (this is our “tip setup”).\n\n\n\nFigure <ref> shows the Kippenhahn diagram of our MESA model along the RGB. The convective envelope is in grey and the H-burning shell is displayed as a thin blue line; the narrow region in between is the radiative zone where IGWs propagate. Two dashed vertical lines indicate the models that correspond to our bump and tip setups and the thick solid lines show the portion of those models that we actually simulate in 3D. It would be prohibitively expensive to simulate the whole star and choices have to be made regarding which regions to include. For both setups, we omit the inner R < 40Mm, which corresponds to truncating our setups just above the H-burning shell. The equation of state currently included in PPMstar does not account for the degeneracy pressure that becomes prominent in the dense inner core, and in any case this region is not strictly needed to study IGWs in the radiative zone above. Furthermore, recent 2D hydrodynamics simulations of a Sun-like star show that the location of the inner simulation boundary has a negligible effect on the IGWs <cit.>; a similar behaviour can be expected for the RGB. The mass contained inside this inner 40 Mm is taken into account when computing the gravitational acceleration in our 3D simulations. For the upper boundary, we adopt a maximum radius of R_ max=900 Mm for our fiducial simulations, which represents only 8% of the stellar radius for the bump setup and 1% for the tip setup. This is enough to include all the radiative zone and a portion of the convective envelope. However, we recognize that artificially blocking the flow at 900 Mm (PPMstar uses reflective boundary conditions) alters the convective motions in the envelope by impeding the development of large-scale convective modes. But extending our simulation sphere further out would degrade the grid resolution in the radiative zone where the IGWs propagate, and we thus settled on R≤ 900 Mm as a compromise between those two effects. We will explore how including a larger envelope affects our results in Section <ref>.\n\n\n\nTo initialize the 3D hydrodynamics simulations, we only require (1) the mass contained within the inner simulation radius (i.e., within R<40Mm), (2) the pressure at the inner simulation radius, and (3) the entropy profile up to the outer simulation radius. From those quantities, the initial pressure (P), density (ρ), temperature (T), and mass (M_r) stratifications can be recovered by integrating the hydrostatic equilibrium equation from the inner boundary. Note that there is no composition gradient in our RGB setups, including across the convective boundary, meaning that only one fluid with the appropriate μ is needed in our 3D simulations. As in <cit.>, we smooth the MESA entropy profile to remove small-scale noise and we force a constant entropy in the convective envelope. Figure <ref> compares the Brunt–Väisälä frequency N obtained by this procedure to the original MESA profile. Only at the convective boundary (when N → 0) is there a small discrepancy between both profiles due to our smoothing procedure.\n\n\n\n\n\n §.§ PPMstar simulations\n\n\nWe use the PPMstar explicit gas dynamics code <cit.> to perform our 3D hydrodynamics simulations. As described in <cit.>, a more realistic equation of state that includes both the ideal gas pressure and the radiation pressure is now implemented in PPMstar. Contributions from electron degeneracy pressure and Coulomb interactions remain negligible in the regions we simulate (R ≥ 40  Mm). In addition, radiation diffusion is now also included <cit.>. The Rosseland mean opacity is calculated using polynomial fits that are generated before each run by fitting OPAL opacity tables <cit.> within the restricted ρ–T domain relevant to each setup. Here, those fits depend only on ρ and T since the composition is uniform throughout the simulated region. We opted for this approach instead of a direct interpolation of the OPAL tables in the interest of code execution speed.\n\nConvection is driven by cooling down (i.e., removing heat) from the uppermost 50 Mm. The rate at which heat is removed corresponds to the luminosity that we are simulating (which is not necessarily the same as the nominal stellar luminosity as discussed in the next paragraph). In addition, we inject heat at the same rate in the first 20 Mm above the inner boundary of our simulations. This is to compensate the loss of heat at the upper boundary with the aim of keeping the thermal content of the star constant over the simulation. This driving strategy closely imitates energy transport in the real star. Heat is produced close to the centre in the H-burning shell, which is what our heating term at the inner simulation boundary mimics. Similarly, convection carries heat all the way to the surface in a real star, which is what our cooling term at the outer simulation boundary simulates.\n\nThe explicit scheme used by PPMstar sets a lower limit on the Mach numbers that can be simulated. A very low Mach number flow would demand prohibitively small grid cells. Consequently, for our bump setup, we cannot perform the simulations at the nominal luminosity L_⋆. Our fiducial bump simulations use L=1000 L_⋆ to drive the convection zone. To extrapolate our results to nominal heating, we perform a series of simulations with different luminosity boost factors as indicated in Table <ref>. Note that the radiative diffusivity K is also increased by the same factor so that the energy transported by radiation scales as the driving luminosity (in order to conserve energy).\n\n\n \nThe tip setup is different. Thanks to its higher luminosity and different stratification, the Mach numbers in its convection zone (Ma≃ 0.010-0.015) are high enough that the star can be simulated at nominal luminosity. This is also true for the IGWs in the stable layers. This gives our RGB tip simulations an exceptional degree of fidelity, providing solutions of the full conservation equations in 3D and over the 4π sphere, at the actual stellar luminosity, and including radiation diffusion with realistic opacities. To our knowledge, these are the first stellar interior hydrodynamic simulations of this kind. The one approximation we are making is that only a small portion of the envelope is included. This can admittedly have a large impact both on the convective and IGW motions <cit.>. We return to this question in Section <ref>.\n\nTo demonstrate that the tip setup can reliably be simulated at nominal heating, we show in Figure <ref> how, for the bump setup, the rms velocity in the convective envelope and in the stable layers scales as a function of the boost factor applied to the heating luminosity. The convective velocities follow a well-defined L^1/3 scaling relation, as established in previous 3D hydrodynamics simulations <cit.>. In the stable layers, we observe the same L^1/3 dependence down to at least L=10^2.5 L_⋆ (this differs from the results of , a point to which we return in Section <ref>). This suggests that there are no numerical convergence issues at those luminosities. The smallest velocity that still adheres to the scaling law is |U| ≃ 0.1  km/s (L=10^2.5 L_⋆ in the bottom panel of Figure <ref>), which corresponds to a Mach number of ≃ 0.0003. As shown in Figure <ref>, the Mach numbers of our RGB tip simulations are above that threshold for R ≳ 300  Mm. This indicates that our nominal-heating RGB tip simulations can be trusted everywhere except in the innermost portion of the radiative interior. Finally, note that this analysis (Figure <ref>) was performed with the lowest-resolution grid (768^3) used in this work. This is therefore a pessimistic assessment of convergence errors as the scaling laws are expected to hold down to lower luminosities and smaller velocities when the grid resolution is increased (e.g., Figure 32 of ).\n\n\n\nOur simulations are performed on Cartesian grids of 768^3, 1536^3 or 2880^3 and run on average for t ≃ 1000h of star time, as indicated in Table <ref>. With a characteristic convective turnover timescale of 1 day, the simulations are long enough to determine the flow properties after eliminating the initial transient phase of a few hundred hours (Figure <ref>). We note however that our simulations are not long enough to achieve a thermal equilibrium state. Since the gas dynamics in the 3D simulations is different than what is assumed in the initial 1D MLT-based MESA stratifications, our setups are inevitably out of thermal equilibrium. This results in the gradual migration of the convective boundary. Furthermore, in all our simulations except X30, our choice of external boundary condition also leads to a spurious migration of the Schwarzschild boundary (see Section <ref>). For those reasons, the convective boundary does not remain at its original location shown in Figure <ref>. Finding configurations that are in equilibrium when simulated with 3D hydrodynamics is an interesting endeavour in itself, but one that is outside the scope of this work.\n\n\n\nThe time steps are adjusted as to maintain a Courant number of 0.85. In the case of our 768^3-grid simulations, this corresponds to Δ t=3.2s for the bump setup and 2.6 s for the tip setup (Δ t is half that when using a 1536^3 grid with the same R_ max). A detailed output of the simulations (or dump) is produced every 2.6 h for the bump setup and every 1.3 h for the fiducial tip setup. The content of those dumps is detailed in <cit.>.\n\n\nPPMstar’s use of Cartesian coordinates optimizes numerical accuracy for a general fluid flow problem. It gives rise to a simple and highly effective design in which the computation proceeds in symmetrized sequences of 1D passes in the three coordinate directions (i.e., directional operator splitting). One consequence of our coordinate choice is that the application of boundary conditions becomes more difficult. Boundary conditions are currently implemented at specific radii (here, an inner boundary at 40 Mm and an outer boundary at R_ max), placed well away from the main region of interest to minimize potential numerical artifacts. We approximate these bounding spheres by the nearest set of cubical grid cell faces, which implies that these spheres are ragged at the scale of the grid. We impose a reflecting boundary condition at the bounding spheres using ghost cells that mirror the cells across the bounding surfaces. This is done in each 1D pass, and in each such pass the bounding surface is perpendicular to the direction of the pass, but it is not perpendicular to the gravitational acceleration vector. For convenience, we therefore smoothly turn off gravity beginning a few grid cell widths in radius before the bounding sphere is reached, allowing us to implement a simple boundary condition in each 1D pass. The downside of this approach is the introduction of a very thin layer next to the boundary where gravitational acceleration smoothly drops to zero. This approach has so far caused no noticeable problems <cit.>, but the current context is trickier because the reflection of IGWs at the inner boundary could matter. We find that over the course of the computation, motions are set going and grow in the thin layer next to the inner boundary. However, these do not come near to the observed IGW motions that are set in motion by the convective envelope (as we will see in Section <ref>, radiative damping dissipates the IGWs well before they reach the inner boundary), and they should not affect the computed results in the regions of interest. \n\n\n\n§ MAIN PROPERTIES OF THE FLOW\n\n\n\n\n §.§ Centre-plane slice renderings\n\n\nTo visualize the important features of our simulations, Figures <ref> and <ref> show renderings of the tangential velocity magnitude |U_t|, radial velocity U_r, and vorticity magnitude | ∇× U| for dump 390 (t=672h) of X22 (L=1000 L_⋆, 1536^3 grid). Those renderings display a centre-plane slice of the full 3D simulation sphere. In all three renderings, the convective envelope is easily distinguished from the radiative zone. The former is characterized by large velocities and is highly turbulent as revealed by the fine-scale structures in the vorticity rendering. In contrast, the radiative zone shows slower, more organized, wave-like flows. As we will see in Section <ref>, the almost circular structures visible in the |U_t| and vorticity renderings correspond to the superposition of several IGWs with different spatial and temporal frequencies.\n\n\n\n\n\nWhile the behaviour of our simulations is most easily visualized in the movies available at <https://www.ppmstar.org>, those static renderings nevertheless offer important insights. The rendering of the radial velocity component reveals that the convective envelope hosts several convective cells, with alternating downdrafts and updrafts (shown as an alternation of blue and red-orange colours) as we rotate around the sphere. This is reminiscent of the flow patterns observed in PPMstar simulations of He-shell flash convection in rapidly accreting white dwarfs <cit.> and of O-burning shells in massive stars <cit.>. However, this is very different from the behaviour found in our recent simulations of core convection in non-rotating massive main sequence stars, where a single dipole mode dominates the convective flow <cit.>. This also differs from the results of <cit.>, whose anelastic 3D simulations of the envelope of slowly rotating RGB stars are also dominated by a large dipole mode, as previously established by <cit.>. We attribute this difference to the artificial boundary imposed on the flow at 900 Mm. The largest-scale mode that develops in the convection zone is limited by the vertical extent of the convection zone, and therefore a large dipole mode is prevented from forming in our simulations. We investigate this question in Section <ref>.\n\nThe tangential velocity rendering displays a few high-|U_t| (dark red) structures inside the convection zone that follow the contour of the convective boundary. Those structures are caused by the inward moving flows that collide with the convective–radiative interface. Unable to continue inward, those flows are forced to turn and continue in a perpendicular direction, thereby creating high-|U_t| structures. For example, the downdraft seen just a few degrees East from North in the U_r rendering of Figure <ref> creates a high-|U_t| double wedge structure where it hits the convective boundary. This behaviour is entirely analogous to the one described in <cit.> for core convection in massive main sequence stars. In Section <ref>, we will see that it is where those flows impact (or overshoot past) the convective boundary that waves are excited in the radiative zone. The |U_t|, U_r and | ∇× U | renderings of the RGB tip simulations are qualitatively similar to those shown for the bump setup in Figures <ref> and <ref>. We omit them for conciseness, but they are available, along with high-resolution movies, at <https://www.ppmstar.org>.\n\n\n\n §.§ Radial profiles\n\n\nNow that the overall morphology of the flow has been established, we investigate its properties more quantitatively. Figure <ref> displays radial profiles of |U_t| and |U_r| for both the bump and tip setups (see also Figure <ref>, which displays the same quantities but this time in terms of Mach numbers). We omit the 40  Mm < R < 200  Mm region in this and subsequent radial profile figures as the behaviour of the flow in this region is tainted by artifacts introduced by the inner boundary conditions of our simulations (Section <ref>). The results of both the 768^3 and 1536^3 simulations are shown and the agreement between both grid resolutions is excellent. Above 300 Mm, the difference never exceeds 20%. Larger discrepancies are apparent at R<300 Mm for the tip setup. This can be at least partially explained by the fact that a smaller grid cell size is required to satisfactorily resolve the slower flow at small radii (consistent with our discussion of Figure <ref>), but as we will see numerical heat diffusion also plays a role.\n\n\n\nIn the convective envelope, the radial and tangential velocity components have similar magnitudes, except near the convective boundary where |U_t|>|U_r|. This is the result of the turning of the flow when downdrafts collide against the convective boundary, as described in the previous section and illustrated in Figure <ref>. Inside the radiative zone, the tangential component of the velocity remains 2 to 8 times larger than the radial component. This qualitatively matches the expected behaviour for a flow dominated by IGWs, since these waves have higher amplitudes in the tangential direction.\n\nFigure <ref> shows radial profiles of the vorticity magnitude, | ∇× U |, for both setups and two grid resolutions. As expected, the vorticity is much higher in the turbulent convective envelope than in the stable layers dominated by wave-like flows. In the convective envelope, doubling the resolution results in a ≃ 50% increase of the vorticity. A similar increase was also observed in the convective cores of our recent PPMstar simulations of massive main sequence stars <cit.>. This is due to the fact that the turbulent cascade in the convective envelope extends to the smallest scales resolved by the simulation grid. As will be shown in Figure <ref> (see Section <ref>), doubling the resolution allows this cascade to extend to smaller spatial scales and therefore increases the vorticity. This behaviour is to be contrasted with what is observed in the stable layers. For the bump setup, the vorticity profiles obtained at 768^3 and 1536^3 are in excellent agreement. This indicates good convergence with respect to the grid resolution: there are no smaller-scale motions to be resolved. The tip setup behaves somewhat differently as we find progressively larger discrepancies between both grid resolutions below 400 Mm.\n\n\n\n\n\n §.§ Power spectra\n\n\nTo characterize the spatial structure of the flow, we show in Figure <ref> the power spectra of |U| at different radii for runs X22 and X26 (1536^3 grid, bump and tip setups, respectively). In those figures, the power is decomposed into spherical harmonics, each represented by their angular degree (or spherical wavenumber) ℓ.[The angular degree ℓ is related to the horizontal wavenumber k_h by k_h = √(ℓ (ℓ +1 ))/R.] The three largest radii are in the convection zone, the four smallest are in the stable layers, and R=500Mm is in the convection zone for X22 and in the radiative zone for X26 (the convective boundary is at R_c ≃ 470Mm for X22 and at R_c ≃ 580Mm for X26). The maximum ℓ value shown in those spectra is set by the highest-degree spherical harmonics that can be resolved given the angular resolution of the Cartesian simulation grid when projected on a sphere at a given radius. Note that the spectra are calculated from the filtered briquette data output <cit.>, for which the grid size in each direction is four times smaller than the computational grid. In the convection zone, we recover the expected Kolmogorov spectrum at small spatial scales. The spectra depart from the Kolmogorov ℓ^-5/3 scaling at ℓ≲ 4, which reflects the fact that the ℓ=1 and 2 modes are not able to fully develop in the relatively small envelope included in our simulations <cit.>. Note that we find the same results if we use a coarser grid resolution, as shown in Figure <ref>. The only difference is that in the high-ℓ limit the spectrum departs from the ℓ^-5/3 scaling at lower ℓ since smaller-scale turbulence is not resolved, consistent with our discussion of Figure <ref> in Section <ref>.\n\n\n\nIn this Section, it will become clear from the properties of the flow, and in particular from the frequencies containing most of the power, that the stable layers are dominated by IGW motions. This IGW-dominated region has a very different spectrum compared to the unstable layers. First, the total power decreases rapidly as we move away from the convective boundary. This signals a strong damping of the IGWs (also visible in Figures <ref>–<ref>), which we attribute to radiative diffusion in Section <ref>. Secondly, for both setups, the spectrum resembles a broken power law with a flat portion up to ℓ≃ 10-40, followed by a very sharp (∼ℓ^-7) decline at higher wavenumbers. As with the convective layers, the general shape of the spectrum is insensitive to the grid resolution (Figure <ref>). From this observation, we can infer that the shift in the ℓ value where the spectrum goes from flat to rapidly decreasing is not simply due to a change in the effective angular grid resolution with R. As they travel toward the centre of the star, the high-ℓ waves are more readily damped than their low-ℓ counterparts. This IGW spectrum has both important similarities and differences with previous hydrodynamics simulations. The steep power law at large ℓ is reminiscent of the <cit.> simulations of IGWs in the Sun (where the resonant cavity is similar to that considered here, with IGWs propagating in a radiative zone surrounded by a convective envelope) and of the massive main-sequence star simulations of <cit.>. The former find a steep ∼ -5 to -7 power law (see their Figure 15) and the latter find a similarly steep ∼ -4 to -6 power law at large ℓ (see their Figure 6). However, a major difference is that both <cit.> and <cit.> find a spectrum that is monotonically decreasing with respect to ℓ, whereas we obtain a flat spectrum at low ℓ.\n\nWe note that the comparison of the IGW spectra of Figure <ref> to those presented in <cit.> and <cit.> is not rigorous as in those works the IGW spectrum is separated into its spatial and temporal dependencies,\n\n    E(ℓ, ν) = f(ℓ) g(ν).\n\nIn Figure <ref>, the dependence on the temporal frequency ν was ignored but nevertheless affects the power spectra since the spherical wavenumber ℓ is coupled to ν through a dispersion relation. To independently study the dependencies on ℓ and ν, <cit.> and <cit.> decompose their spectra into the form given by Equation (<ref>) using singular value decomposition. Naturally, the spectrum cannot be entirely separated as in Equation (<ref>), and in our case we found that the singular value decomposition led to a poor representation of the full spectrum. We therefore opted not to use singular value decomposition to present our IGW spectra. The same considerations apply to the temporal frequency power spectra presented below.\n\nIn Figure <ref>, we showed the spectra of the total power, that is, due to displacements both in the radial and horizontal directions. It is instructive to compare those spectra to spectra computed by considering only the radial velocity component (Figure <ref>). The most important difference is that instead of being flat at low ℓ, the U_r IGW spectra instead increase up to ℓ≃ 10-40. This behaviour is expected. For IGWs, the ratio U_r/U_t increases with frequency (see ) as the waves approach the Brunt–Väisälä frequency and the vertical motions become more important compared to the horizontal motions. This can explain the positive slope observed in Figure <ref>. A similar trend is also observed in the IGW spectra of our massive main sequence stars simulations <cit.> and in recent 3D simulations of late-type F stars <cit.>.\n\n\n\nIn Figure <ref> we now show the power spectra for the same radii as in Figures <ref> and <ref>, but this time in the temporal frequency space. The spectra are truncated at ν = 80 μHz (bump setup) and ν = 104 μHz (tip setup), which correspond to the Nyquist cut-off frequencies given the time interval that separates each dump in our simulations (i.e., higher frequency modes cannot be resolved). To be clear, higher frequencies are resolved in the simulations themselves, but the detailed outputs that allow us to reconstruct the power spectra are written to disk only every ∼ 2000 time steps. In the stable layers, the spectra are relatively flat, although for the tip setup there is a noticeable decrease of the power at high frequencies. This high-frequency quenching is more pronounced close to the convective boundary. This is consistent with these waves being IGWs. IGWs can only propagate when their frequencies are smaller than the local Brunt–Väisälä frequency. Here, the relative amount of power at high frequencies grows as we move inward and N increases (Figure <ref>).\n\n\n\nIt is instructive to compare the frequencies that contain most of the IGW power to the convective frequency ν_c at the bottom of the envelope. The convective turnover timescale is not a precisely defined quantity, but as the convective cells occupy the maximum space available to them in the envelope, we can estimate it by taking the thickness of the envelope (≃ 400Mm for X22 and 300 Mm for X26) and dividing it by the average convective velocity (|U|≃ 5  km  s^-1 for X22 and 3 km s^-1 for X26). This yields a convective turnover timescale of 22 h (ν_c ≃ 13 μHz) for the bump setup and 28 h (ν_c ≃ 10 μHz) for the tip setup. Figure <ref> shows that a large fraction of the IGW power is contained at frequencies that exceed ν_c. This result is consistent with the fact that the power spectra in the convective envelope are flat (Figure <ref>). If there is no correlation between the convective turnover timescale and the convective spectrum, then we also expect to observe no correlation between the convective turnover timescale and the IGW spectrum.\n\nComparing our wave spectra to asteroseismological observations of RGB stars would be interesting, but this exercise is complicated by the fact that the IGWs propagating in the radiative interior are coupled with pressure modes in the envelope <cit.>. Because of this and given the truncation of the envelope in our simulations, we cannot make a direct comparison between the frequencies of the mixed modes detected in upper RGB stars and the frequency spectra of Figure <ref>. Nonetheless, we note that the frequency at maximum oscillation power for mixed modes in a 1.2 M_⊙ RGB star at the bump luminosity, ν_ max≃ 40 μHz <cit.>, is within the range of frequencies where IGWs are excited in our simulations (Figure <ref>).\n\nTo conclude our analysis of the wave spectra, we show in Figure <ref> power spectra of the radial velocity component as a function of both the angular degree and the frequency for an RGB tip simulation (X24). We use our longest simulation for this analysis in order to attain a finer frequency sampling in the Fourier decomposition. The power spectrum in the convective envelope (top panel) differs greatly from the spectrum obtained in the stable layers ≃ 0.8 H_P below the convective boundary (bottom panel). In the convection zone, the power spectrum is very smooth and has no specific features, as expected for turbulence. In the IGW-dominated region, we see a more distinctive power distribution, with no power at high frequencies (due to the quenching of IGWs with frequencies exceeding N) and in the low-frequency, high-ℓ region of the diagram. The most striking aspect of this wave spectrum is it blurriness. In contrast, hydrodynamics simulations of IGWs in stellar radiative interiors usually yield spectra where the power is predominantly contained in a set of discrete, well-defined ridges in the ℓ-ν space <cit.>, with each ridge corresponding to a specific radial order of standing IGW modes (or g modes). The absence of such ridges in Figure <ref> suggests that standing modes are not formed in our simulations or, in other words, that the mode lifetime is very short.\n\n\n\nFor standing waves to form, two progressive (or travelling) IGWs have to constructively interfere with each other. Here, this would require that IGWs excited at the convective boundary and travelling inward undergo a reflection somewhere close to the centre of the star. This reflection would generate outward travelling waves that could constructively interfere with the inward travelling waves to create standing modes. The absence of standing modes in Figure <ref> therefore suggests that only inward moving progressive waves exist in our simulations. This situation is analogous to that described in <cit.> for a solar-like star, where low-frequency IGWs are damped before reaching their reflection point near the centre. In the solar case, the reflection point is located where the Brunt–Väisälä frequency N becomes equal to the IGW frequency. Here, N remains larger than the IGW frequency all the way to the inner simulation radius, effectively meaning that the waves can only be reflected at that radius (remember that we use reflective boundary conditions). But Figures <ref> to <ref> show that the power contained in the IGWs is strongly damped as the waves propagate inward, which most likely explains the absence of reflected waves (and, by extension, of standing modes).\n\n\n\n §.§ Internal gravity wave damping\n\n\nIn the previous sections, we have seen how the amplitude of IGWs drops as they propagate inward (Figures <ref>–<ref>). What is the cause of this decrease? In a simulation without any heat diffusion and without any nonlinear interactions between waves, we expect the luminosity of each wave (i.e., the kinetic energy transported by wave packets moving radially at the group velocity U_ gr,r),\n\n    L^ IGW_ℓ,ν = 4 π R^2 ρ (U_r^2 + U_h^2) U_ gr,r,\n\nto remain constant as a function of R. Using the IGW dispersion relation <cit.>, Equation (<ref>) can be expressed more conviently as\n\n    L^ IGW_ℓ,ν = 4 π R^3 ρ U_r^2 N/√(ℓ ( ℓ +1 ))√( 1 - ω^2/N^2),\n\nwhere ω= 2 πν. In Figure <ref>, the dashed lines show the decrease in U_r predicted using this equation for four different (ℓ,ν) pairs representative of the IGWs present in our simulations. The IGW velocities are predicted to only decrease by a factor ∼ 2 between the convective boundary and R=200  Mm, a much more modest effect than the two orders of magnitude drop observed in Figure <ref>. A nonadiabatic effect must therefore be invoked to explain the wave amplitude damping observed in our simulations.\n\n\n\nIf radiative diffusion is considered, the wave velocities are damped by an additional attenuation factor e^-τ, where τ is analogous to an optical depth and is given by <cit.>\n\n    τ = [ ℓ (ℓ+1) ]^3/2/2∫_R_ CB^R K N N_T^2/ω^4√(N^2/N^2-ω^2) |dr|/r^3,\n\nwhere K is the thermal diffusivity,\n\n    K = 4 a c T^3/3 κ c_ Pρ^2,\n\nwith a the radiation constant, c the speed of light, κ the Rosseland mean opacity and c_ P the specific heat at constant pressure, and N_T is the thermal component of N,\n\n    N_T^2 = -g/H_P∂lnρ/∂ln T( ∇_ ad - ∇),\n\nwhere the temperature gradients have their usual meanings. The solid lines of Figure <ref> show what happens if we include this radiative damping in our predictions of the IGW velocities. A sharp ∼ 100 × damping is predicted between the convective boundary and R ≃ 200  Mm, which agrees very well with our simulations (compare to Figure <ref>).\n\nTo verify that radiative damping is indeed the mechanism leading to the IGW velocity decrease, we have performed two additional nominal-luminosity RGB tip simulations without radiative diffusion (X32 and X33, respectively on 768^3 and 1536^3 grids). Heating at the inner boundary is turned off for these runs, since with K=0 this extra heat would be spuriously trapped in the radiative cavity. Figure <ref> compares the spherically averaged velocity profiles of X32 and X33. It is entirely analogous to the bottom panel of Figure <ref>: the same grid resolutions are considered and the same simulation setup is used. The only difference is the omission of radiative diffusion. Clearly, the IGW velocities still undergo a considerable decrease between the convective boundary and R=200  Mm even if radiative diffusion is omitted. Remember that only a factor ∼ 2 decrease is expected in the purely adiabatic case (dashed lines in Figure <ref>). The stronger decline must be due to a nonadiabatic effect that we attribute here to the numerical diffusion of entropy, which mimics radiative diffusion. This interpretation is supported by the fact that the velocities decline faster when the grid resolution is lower (compare the dashed and solid lines in Figure <ref>), pointing to a numerical effect. Note that we have also observed numerical heat diffusion in our recent core-convection simulations <cit.>. \n\n\n\nWe stress that the observed velocity damping is not due to numerical viscosity. If it were the case, we would expect to also see the same significant difference between both grid resolutions for simulations where radiative diffusion is included, as this effect operates independently from radiative diffusion. But this is not the case: the difference between the 768^3 and 1536^3 grid resolutions is much smaller when the simulations include radiative diffusion (Figure <ref>). This observation is naturally explained by numerical heat diffusion. Numerical heat diffusion is hardly noticeable in Figure <ref> because radiative diffusion has a considerably larger effect. In contrast, numerical heat diffusion is very important in the case where K=0, since it becomes the only mechanism available for entropy diffusion. \n\nThree important conclusions follow from the analysis presented in this section. First, numerical heat diffusion operates in our simulations, but is much weaker than radiative diffusion and can therefore be ignored. Secondly, radiative damping can naturally explain most of the decrease of the IGW velocities observed in our simulations. Thirdly, the spurious behaviour of the flow at the inner simulation boundary (Section <ref>) can be ignored, since radiative damping strongly suppresses the IGWs before they reach that radius.\n\n\n\n§ MIXING BY INTERNAL GRAVITY WAVES\n\n\nNow that we have established the main properties of the flow, we turn to the problem of estimating the mixing enabled by IGWs in the radiative zone. To do so, we first perform an estimate of the diffusion coefficient D based on the vorticities and a simple analytical prescription (Section <ref>), and we then attempt to measure D more directly by studying the time evolution of a passive fluid added to our simulations (Section <ref>). As we will see, the second, more robust method disagrees with the first.\n\n\n\n §.§ Estimating the mixing from the vorticity\n\n\n\n\n  §.§.§ Theoretical framework\n\nIGWs can cause vertical mixing in the stable layers of stellar interiors if their horizontal velocity shear is high enough to overcome the tendency of the fluid to remain stratified. In the adiabatic case (no heat diffusion), this is expected to take place only if the Richardson number drops below 1/4,\n\n    Ri = N^2/( d U_t / d R )^2 < 1/4.\n\nIn our RGB stars, Ri > 1/4 throughout the radiative zone (except within ≃ 0.1 H_p from the convective boundary) and no vertical mixing is therefore expected based on this simple criterion. But in real stars (and in our simulations), radiative diffusion modifies Equation (<ref>) and may allow mixing to take place at larger Ri <cit.>. The diffusion coefficient due to IGW shear proposed by <cit.> is then given by\n\n    D ≃ηK/ Ri,\n\nwhere η is a dimensionless parameter of order 0.1 <cit.>. In the present context, this equation can be written as <cit.>\n\n    D ≃ 0.1 K ( ∇× U )^2/N^2,\n\nwhere we have also assumed that η = 0.1.\n\n\n\n  §.§.§ IGW vorticity scaling for the bump setup\n\n\nIn order to estimate D using Equation (<ref>), we need the vorticity profiles |∇× U| from our simulations. We have already shown those quantities in Figure <ref>, but only the vorticity profile for the tip setup is directly usable. As the RGB bump simulations are driven with a luminosity that is much higher than the nominal value (see Table <ref>), the flow velocities and vorticities are necessarily overestimated.\n\nTo extrapolate our RGB bump results to nominal luminosity, we use our series of 768^3 simulations with different heating rates. The mean vorticity measured in the convection zone is shown in the top panel of Figure <ref>, where it can be seen that it follows a L^1/3 scaling law as previously established in the case of core convection in massive main sequence stars <cit.>. This is consistent with Figure <ref>, which shows that the velocities also scale with L^1/3, as observed in previous 3D hydrodynamics simulations (see Section <ref>). As argued by <cit.>, the fact that both the velocity and the vorticity scale with L^1/3 requires that the spatial spectrum in the convection zone is independent of the heating factor.\n\nWe find a shallower ∼ L^1/4 scaling when we measure the vorticity 200  Mm≃ 1 H_P below the convective boundary (bottom panel of Figure <ref>). Note that the vorticities for the lowest heating factors should be interpreted with caution as they correspond to very low velocities (Ma≲ 10^-4 for L ≤ 100 L_⋆), a regime where the validity of our simulations is questionable. This explains why the L=10 L_⋆ point does not line up with the trend established at higher luminosities (see also Figure <ref>). Note also that this L^1/4 scaling law is not well defined (e.g., L^1/5 would give a similar fit to the data), but we assume L^1/4 in what follows. This result strongly differs from the L^2/3 scaling found in <cit.>. As shown in Section <ref>, we also observe a different scaling of the IGW velocities (L^1/3 here compared to L^2/3 in the core convection case) and in this respect it is not surprising to also find a different scaling of the vorticities.\n\n\n\nHowever, unlike <cit.>, we do not observe the same scaling for the velocities and for the vorticities. This implies that the spatial IGW spectrum changes as a function of heating rate. Figure <ref> shows the |U| power spectra measured 200 Mm below the convective boundary (as in Figures <ref> and <ref>) for different heating rates. It reveals that there is indeed a strong dependence of the power spectra on the heating rate, with more power at low ℓ relative to high ℓ when the luminosity is increased. This is qualitatively similar to the findings of <cit.>, but this comparison is misleading for at least two reasons. First, the IGW spectra measured in our simulations (Figure <ref>) are very different from those reported in <cit.>. Their spectra show well-defined IGW standing modes, but also contain a significant amount of power at low frequencies and over all wavenumbers. Secondly, the spurious migration of the convective boundary in our simulations (Section <ref>) operates more rapidly when the heating rate is increased, meaning that the spectra shown in Figure <ref> are not all determined at the same radius since they are measured at a fixed distance from the convective boundary. Moreover, this implies that the IGWs are not excited at the same location in the star. Ideally, we should compare the wave spectra and the IGW vorticities at the same radius and for simulations where the convective boundary is at the same location. This cannot be accomplished with our current simulations. Using earlier dumps for high-L runs where the boundary moves rapidly is not possible because the boundary migrates before the dynamics has the time to reach a steady state. We are therefore forced to conclude that the scaling laws that we have determined for the IGW velocities and vorticities in the RGB bump setup are most likely incorrect. In the absence of any suitable alternative, we will nevertheless use them in what follows. Fortunately, this problem does not affect our RGB tip simulations, where no extrapolation to low luminosities is required, and it does not impact any of the conclusions of this work.\n\n\n\n  §.§.§ Diffusivity estimates\n\nEquipped with our scaling relation for |∇× U| in the radiative zone of the bump setup, we can now estimate D by virtue of Equation (<ref>) for both setups. Figure <ref> shows the resulting diffusivity profiles. The magnitude of D in the stable layers is quite significant and suggests that IGW mixing could alter the evolution of upper RGB stars. For reference, at the bump luminosity, a diffusion coefficient of ∼ 10^9  cm^2  s^-1 at the base of the envelope is needed to explain the observed RGB extra mixing <cit.>.\n\n\n\nThe diffusion coefficient profiles of Figure <ref> follow a distinctive double-exponential decay near the convective boundary, a conclusion that does not depend on the uncertain RGB bump vorticity scaling law. D initially decreases rapidly close to the radiative–convective interface but then exhibits a shallower decay further inside the radiative zone. This behaviour is reminiscent of the prescription used by <cit.>, and based on the stellar hydrodynamics simulations of <cit.>, to model mixing below the convective envelopes of thermally pulsating asymptotic giant branch (AGB) stars during the third dredge-up. With this prescription, D at a distance z below the convective boundary is given by\n\n    D(z) = \n              D_0 exp[ -2z /(f_1 H_P,0) ]     z ≤ z_2\n    \n             D_2 exp[ -2(z-z_2)/(f_2 H_P,0) ]     z > z_2,\n\nwhere \n\n    D_2 = D_0 exp[ -2 z_2 /(f_1 H_P,0) ],\n\nD_0 is the diffusion coefficient at the convective boundary, H_P,0 is the pressure scale height at the boundary, and f_1 H_P,0 and f_2 H_P,0 are the overshoot scale heights <cit.>. We show in Figure <ref> the values of f_1 and f_2 obtained by fitting Equation (<ref>) to the D profiles for the first 150 Mm below the convective boundary. If the Zahn formula is correct, if η remains constant from the bump luminosity to the tip of the RGB, and if η is constant throughout the radiative zone (we return to this point in Section <ref>), then Figure <ref> implies that the f values change throughout the RGB evolution and that a single prescription cannot be used to describe all the upper RGB evolution.\n\n<cit.> adjusted the free parameters of Equation (<ref>) in order to reproduce the IGW mixing calculations of <cit.>, based on the IGW mixing prescription of <cit.>. The extra mixing generated with this simple model was shown to be able to generate a ^13C pocket in the radiative zone of AGB stars that is large enough to obtain s-process yields that are compatible with observations. While promising, this mixing prescription has not yet been verified with multi-dimensional hydrodynamics simulations of the stable layers below a convective envelope. In this context, our results shown in Figure <ref> offer additional support for the double-exponential prescription used in AGB models. While the radial stratification of a thermally pulsating AGB star obviously differs from that of an upper RGB star, there are significant similarities (e.g., comparable luminosities, analogous geometries). It is therefore encouraging to recover a double-exponential profile in our simulations, especially since the f values we find are approximately similar to those assumed by <cit.>.\n\n\n\n §.§ Constraints on the diffusivity from the time evolution of a tracer fluid\n\n\nThe diffusivity estimates presented in the previous section are far from robust. Apart from concerns regarding the RGB bump vorticity scaling law, their validity depends on the correctness of the Zahn formula (Equation <ref>) and on the assumed η value. Here, we attempt to measure the mixing more directly using a second passive fluid. PPMstar follows species advection using the high-order PPB scheme <cit.>. In setups that include a composition gradient <cit.>, a passive dye cannot be directly inserted in the simulations as PPMstar is currently a two-fluid code. Fortunately, our RGB setups have a uniform composition and a second fluid with the same mean molecular weight as the first fluid can be added to our base states. This is equivalent to adding a passive tracer. It has no effect on the flow but allows us to directly measure species mixing.\n\nWe initialize the concentration of this second fluid as a series of spherical shells with Gaussian radial profiles. The expectation is that shear-induced IGW mixing will spread those Gaussian profiles in the stable layers. The diffusion coefficient can then be recovered by measuring the rate at which the fractional volume of the second fluid at the peak of each Gaussian (FV_ max) decreases with time. By applying the diffusion equation to a Gaussian, one can show that the diffusion coefficient can be calculated as\n\n    D = -d  FV_ max/dt/ FV_max,0σ_0^2,\n\nwhere d  FV_ max/dt is the rate at which the FV at the peak of a Gaussian decreases, FV_ max,0 is its initial value, and σ_0 is the initial standard deviation of the Gaussian. Note that Equation (<ref>) assumes that the width of the Gaussian remains constant, which is an excellent approximation for the relatively short time scales over which our simulations are performed.\n\nPrevious experience has taught us that the grid resolutions we have been using so far in this work (768^3 and 1536^3) are insufficient to measure diffusion coefficients with this technique. In fact, in <cit.> we show that in massive main-sequence stars the measured D steadily decreases with increasing grid resolution due to numerical entropy diffusion up to at least 2688^3. We therefore jump directly to a very high 2880^3 resolution for this analysis (run X30, see Table <ref>), and any mixing measured at that resolution should be interpreted as an upper limit given the results of <cit.>. The setup for this new run is identical to that described above for the tip RGB X26 run, except that (1) FV Gaussians with σ_0=8.3Mm (corresponding to a full width at half maximum of ≃ 25 grid cells) are placed 100 Mm apart in the stable layers, (2) the convective envelope now extends further out to R_ max=1100Mm (we can afford this extension given the larger 2880^3 grid resolution), (3) we have disabled heat conduction at the inner and outer boundaries. This last change was made after we realized that simultaneously cooling the top layers and allowing heat to escape through radiative diffusion at the outer boundary was effectively cooling the star by more than 1 L_⋆. By omitting radiative diffusion at the boundary, we can now precisely set the luminosity to 1 L_⋆ by cooling the upper layers at that exact rate. Due to the large computational cost of the 2880^3 grid, X30 ran for a shorter total duration than other simulations presented so far (552 h of star time, see Table <ref>). Nevertheless, as we will show below, this is sufficient to establish useful constraints on D.\n\nFigure <ref> shows the evolution of the height of the two Gaussians closest to the convective boundary (at R=450 and 550 Mm), where IGW mixing is expected to be the strongest (Figure <ref>). The amplitude of the Gaussians was recovered by fitting the radial FV profiles with a Gaussian. Initially, at t ≲ 250h, FV_ max fluctuates a lot. This is entirely attributable to the initial transient at the beginning of our simulation and for this reason we discard the t≤300h portion of the time series from the rest of our analysis. If strong IGW mixing was present, we would expect to observe a decrease of FV_ max for t ≥ 300h. At R=550  Mm, we do not see any evidence for such decline (top panel of Figure <ref>). The Kendall rank correlation coefficient between FV_ max and t is consistent with the null hypothesis where there is no dependence of FV_ max on t (p-value of 0.057). Similarly, a linear fit to the data gives a positive but statistically insignificant slope, d  FV_ max/dt = (2.6 ± 1.0) × 10^-10  s^-1 (dashed line in Figure <ref>). From this linear fit, we can extract a lower limit on d  FV_ max/dt by taking the 5-sigma lower limit, d  FV_ max/dt > -2.5 × 10^-10  s^-1 (dotted line in Figure <ref>). Using Equation (<ref>), we find that this corresponds to log D ( cm^2  s^-1) < 8.2. In contrast, a tentative decline of FV_ max is visible for the 450 Mm Gaussian thanks to the lower noise level in the FV_ max time series (compare both panels of Figure <ref>). We find a Kendall rank correlation coefficient of 0.48, significantly different from 0 with a p-value of 10^-15. This time, a linear fit to the data yields d  FV_ max/dt = -(1.03± 0.11) × 10^-10  s^-1, which allows a tentative measurement of log D ( cm^2  s^-1) = 7.80 ± 0.05. It is possible that this downward trend is only temporary and that a longer simulation would show a stabilization of FV_ max. As for the Gaussians located at smaller radii (250 and 350 Mm), we find that they do not maintain their Gaussian shapes to a sufficiently high level of accuracy to allow a precise determination of FV_ max. Part of the problem is that the fluctuations of FV at smaller radii are much smaller (as can be inferred from Figure <ref>). This means that FV_ max must be determined with an increasing precision, making even small departures from perfect Gaussianity problematic. The artifacts introduced by the inner boundary are also a consideration at those small radii.\n\n\n\nIn Figure <ref>, we compare our estimates of D described in the previous paragraph to D calculated using Equation (<ref>) and the vorticities measured in X30. The latter D estimates differ from that previously shown in Figure <ref>, which can be explained by the higher grid resolution of X30, the different boundary conditions, and the slightly larger convective envelope. The main takeaway from Figure <ref> is that we can rule out IGW mixing on the scale predicted by Zahn's formula with η=0.1. There is a factor 6 discrepancy between both D estimates at 450 Mm and a factor ≳ 25 discrepancy at 550 Mm. The η=0.1 value we have assumed so far is only a rough order of magnitude estimate based on existing numerical simulations. A different value of η is certainly possible. For instance, <cit.> recommend η∼ 0.02, which would improve the agreement between both estimates in Figure <ref>. Furthermore, existing η determinations are still tentative given that they are based on low Reynolds number numerical simulations <cit.>. Taken at face value, our FV-based D determinations also suggest that η is not constant through the stable layers: the 450 Mm Gaussian implies η∼ 0.02 and the 550 Mm implies η≲ 0.004. Previous numerical simulations have found a dependence between the turbulent Reynolds number and the value of η <cit.>. This may be related to what we observe here.\n\nIn any case, the analysis of the time evolution of the Gaussians presented in this section represents a much more direct assessment of the efficiency of IGW mixing, and the results from this analysis take precedence over those presented in the previous section based on the application of Zahn's formula. Given that we find that D ( cm^2  s^-1) ∼ 10^8 at most close to the boundary (remember that the finite grid resolution implies that the measured D at 450 Mm is formally an upper limit, ), our hydrodynamics simulations a priori suggest that IGW mixing is not an important mixing mechanism in the radiative zones of RGB stars and that it cannot provide the missing extra mixing required to explain upper RGB surface compositions. A diffusion coefficient of the order of 10^9  cm^2  s^-1 throughout the upper RGB would be needed, and here we do not even reach that value at the RGB tip, where the luminosity is highest and IGW mixing is expected to be most efficient. That being said, we will see in Section <ref> that this conclusion is not definitive and that in a real RGB star IGW mixing may be more efficient.\n\n\n\n\n\n§ EFFECT OF THE ENVELOPE SIZE\n\n\nTo document the effect of including a limited portion of the convective envelope in our simulations, we performed an additional run (X25) where we extended our setup to R_ max=1800Mm instead of our fiducial 900 Mm. We performed this run on a 1536^3 grid, meaning that it has the same resolution as X24 (performed on a 768^3 grid with R_ max=900Mm) in the region where both grids overlap. By comparing X24 and X25, we can therefore assess the impact of including a larger envelope while controlling for the grid resolution. Figure <ref> shows a vorticity magnitude rendering of X25. As expected, larger eddies are able to develop in this extended convective envelope. Throughout the simulation, the flow is dominated by just a few large cells (three are clearly visible in Figure <ref>), which is to be contrasted with the many small cells that characterize the rest of our simulations (Section <ref>). Accordingly, we find that the U_r power spectrum in the convective envelope now exhibits a Kolmogorov ℓ^-5/3 scaling down to ℓ=2 (Figure <ref>). Extending the envelope even further out would presumably allow a single large dipole mode to develop. However, for a computationally feasible grid size, this would result in a grid resolution that is too poor to properly characterize IGWs in the radiative zone. This conundrum could be resolved in the future by using a nested grid with smaller cells in the central radiative layers and larger cells in the convective envelope. This capability is not yet implemented in PPMstar. For now, the extended envelope of X25 is enough to document the sensitivity of the IGWs on the size of the convective envelope; we postpone a proper convergence study to future work.\n\n\nHow does the development of larger convective cells affect the properties of the IGW-dominated flow in the radiative zone? Figure <ref> shows that the flow is 1.5-2 times faster in the convection zone with the extended envelope setup. Those faster convective motions in turn excite a more rapid flow below the convective boundary, with |U_r| and |U_t| up to ≃ 4 times faster in the radiative zone when a larger envelope is used (see also Figure <ref>). The vorticities are naturally also enhanced by up to a factor ≃ 3. Note however that the increase in vorticity is less pronounced in the outermost radiative layers: |∇× U| grows by only ≃ 50 % at 0.5 H_P below the convective boundary. This vorticity enhancement would directly impact our Zahn diffusion coefficient estimate (Equation <ref>) and increase it by up to one order of magnitude (the radiative diffusivity K and the Brunt–Väisälä frequency N in the stable layers are not affected by the inclusion of a larger envelope). The enhanced vorticity would also conceivably affect our constraints on D based on the analysis of the time evolution of the tracer fluid Gaussians (Section <ref>). Future work should focus on this aspect of the problem. We are forced to conclude that our tentative measurement of D in Section <ref> should be interpreted as a lower limit, as simulations including the full envelope would most likely result in more efficient mixing. Hence, we cannot conclusively rule out the idea that IGW mixing on the upper RGB is an important mixing mechanism and possibly at least part of the solution to the extra mixing problem.\n\n\n\n\n\n§ THE CONVECTIVE BOUNDARY\n\n\nWe now leverage the exceptionally high resolution (2880^3) of our X30 simulation to examine the properties of the convective boundary. Because radiative diffusion at the outer boundary has been omitted in X30 (see Section <ref>), heat is removed from the star at the same rate as it is injected. As a result, the Schwarzschild boundary does not migrate as in previous runs, therefore enabling a meaningful study of the boundary region.\n\nFigure <ref> tracks the evolution of the spherically averaged temperature gradients and FV profile in the boundary region (for reference, the evolution of the Brunt–Väisälä frequency is also given in Figure <ref>). In Section <ref>, we analyzed the time evolution of the FV Gaussians located well into the radiative zone, at R=450Mm and R=550Mm. X30 also includes an FV Gaussian centered at R=650  Mm, very close to the convective boundary. The ingestion of this Gaussian into the convective envelope provides a useful diagnostic for the extent of the fully mixed envelope. There are several things to note in Figure <ref>:\n\n\n  * While the formal Schwarzschild boundary is virtually stationary, the dynamic convective boundary (defined, as previously in this work, as the location of the maximum U_t gradient) migrates inward (circles in Figure <ref>);\n\n  * The temperature gradient in the region between the Schwarzschild and convective boundaries departs from the ∇_ rad value expected in the radiative zone and instead gradually approaches the adiabatic gradient ∇_ ad;\n\n  * The fully mixed region (i.e., the region where FV is constant) grows past the Schwarzschild boundary.\n\nAll those properties point to the formation of a convective penetration zone. Formally, a penetration zone is a region where both entropy and composition are mixed by convective motions beyond the Schwarzschild boundary <cit.>. Convective penetration below a convective envelope has been observed in 3D hydrodynamics simulations of a Sun-like star <cit.> and of a 5 M_⊙ star at the end of central He burning <cit.>, two examples where the geometry is similar to that of the RGB case. While the limited length of our simulation does not allow the establishment of a fully mixed, stationary penetration zone, it is clear from Figure <ref> that such a region is in the process of being formed. The thermal diffusion lengthscale √(Kt) over the full simulation (t=552h) is ≃ 50Mm, which explains why the penetration zone had the time to build up but has not yet reached a steady state.\n\n\n\n\n\nTo visualize this nascent penetration zone, we show in Figure <ref> renderings of the vorticity magnitude and radial velocity in the boundary region. The outer white circular arc marks the Schwarzschild boundary. Turbulent motions visible in the vorticity rendering extend well beyond this radius and up to the dynamic convective boundary (identified by the inner white circular arc): this is the convective penetration zone. In fact, this is very similar to the behaviour observed by <cit.> in their 3D hydrodynamics simulations performed in a simplified plane-parallel geometry (compare the left panel of Figure <ref> to the left panel of their Figure 1). While the penetration zone is not fully established, it is still useful to compare its extent to existing observational constraints. We can infer from Figures <ref> and <ref> that after 550 h of simulation time, the penetration zone extends ∼ 0.2 H_P beyond the Schwarzschild boundary. Interestingly, it has been shown that the inclusion of a ∼ 0.25 H_P overshooting below the Schwarzschild boundary can eliminate the discrepancy between the observed and predicted location of the RGB bump <cit.>.\n\nThe renderings of Figure <ref> reveal more than just the formation of a penetration zone. We also see a large plume moving inward (remember that blue colours stand for inward motions in our U_r renderings) and traversing the spherically-averaged dynamic convective boundary to reach the stable, IGW-dominated interior. This points to the presence of an overshoot zone beyond the penetration zone, where the convective motions are too weak to efficiently mix entropy and composition. This is in line with the schematic picture discussed by <cit.> and recently illustrated by <cit.>. In the vorticity rendering of Figure <ref>, we can even see how the intrusion of this plume in the radiative region excites IGWs. On each side of the plume, there are structures that form an angle with respect to the almost circular patterns that otherwise dominate the vorticity rendering of the stable layers. Those structures, indicated by two arrows in Figure <ref>, are IGWs excited by the intruding plume (this is most clearly seen in the movie). This suggests that penetrative plumes are an important wave excitation mechanism, consistent with our findings of Section <ref> based on the IGW power spectra. That being said, it is possible that in a real RGB star, with a much large convective envelope, the dipolar global flow morphology prevents the formation of such plumes.\n\nThe evolution of the FV profile in Figure <ref> can be used to infer the diffusion coefficient close to the convective boundary. As in <cit.>, we take the FV radial profiles at different times and invert the 1D diffusion equation to determine the profile D(R) that can reproduce the observed change. The resulting D(R) is shown as a black dashed line in Figure <ref>. Our diffusion coefficient inversion technique only works if the gradient of FV is not zero, meaning that we cannot measure D further out in the envelope than what is shown in Figure <ref>. Note also that this method cannot be applied in the stable layers, where diffusion is much slower and the approach used in Section <ref> is the best option. In Figure <ref>, we show with a grey dashed line the diffusion coefficient predicted by the MLT formula\n\n    D_ MLT = 1/3 U α H_P,\n\nwhere we have assumed that U corresponds to the total velocity amplitude in the PPMstar simulation and where we have fixed α=0.75 in order to fit the measured diffusivity (black dashed line) in the envelope far from the Schwarzschild boundary. As previously observed in other hydrodynamics simulations, a constant α value leads to an overestimation of D close to the boundary, a problem that can be solved by reducing the mixing length near the boundary <cit.>. We found that a good prescription for α is given by\n\n    α = min(0.75, 1.8 Δ R + 0.08),\n\nwhere\n\n    Δ R = R-R_ SB/H_P,\n\nwith R_ SB the radius of the Schwarzschild boundary. This yields an excellent fit to the measured diffusivity in the convection zone (red line in Figure <ref> for R≥ R_ SB). The simpler prescription suggested by <cit.> and the exponential parametrization of <cit.> cannot reproduce the measured diffusivity to a comparable degree of accuracy.\n\n\n\nTo extend our diffusivity model below the Schwarzschild boundary, we use the double-f prescription of Equation <ref>. We find that this particular convective boundary mixing model cannot simultaneously match the measured diffusivity in the penetration zone (black dashed line for R < R_ SB in Figure <ref>) and in the stable layers (square symbols as in Figure <ref>). The best overall match is given by f_1=0.06, f_2=0.9 and D_2=1.7× 10^8  cm^2  s^-1 (z_2=105  Mm = 0.41 H_P,0), and is displayed as a red line for R<R_ SB in Figure <ref>. This simple diffusivity model, with a modified mixing length in the unstable layers and a double-exponential profile below R_ SB, can be easily implemented in 1D stellar evolution codes, with the caveats that it underestimates mixing in the penetration zone and that it may not apply to the rest of the RGB evolution.\n\n\n\n§ CONCLUSION\n\n\nWe have presented the first 3D hydrodynamics simulations of IGW excitation and propagation in RGB stars. These simulations clearly show that a rich spectrum of IGWs is generated in the radiative zones of low-mass upper RGB stars (Section <ref>). By analysing the time evolution of a tracer fluid, we measured the mixing enabled by IGWs in the radiative interior (Section <ref>). In our simulations, we find that IGW mixing is too weak to explain the missing RGB extra mixing, but we cannot rule out that this mixing mechanism is much more efficient in real RGB stars. In fact, our simulations only include a limited portion of the convective envelope, and we have shown how this probably leads to an underestimation of IGW mixing in the radiative zone (Section <ref>). This is the most critical aspect of our simulations to be improved in future work. We have also studied the properties of the envelope convective boundary (Section <ref>). We found evidence for the establishment of a convective penetration zone and for the excitation of IGWs in the stable layers by plumes that traverse the penetration zone and encroach into the radiative zone. We also provided a simple prescription for the diffusion coefficient in the boundary region.\n\nPromisingly, we also find that the vorticity profiles measured below the convective boundary in our RGB simulations yield support to the idea that IGW mixing may be responsible for the formation of the ^13C pocket in AGB stars. This should be further studied with dedicated AGB hydrodynamics simulations.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe are grateful to the referee for insighful comments and questions that have improved this manuscript. SB is a Banting Postdoctoral Fellow and a CITA National Fellow, supported by the Natural Sciences and Engineering Research Council of Canada (NSERC). FH acknowledges funding through an NSERC Discovery Grant. PRW acknowledges funding through NSF grants 1814181 and 2032010. FH and PRW have been supported through NSF award PHY-1430152 (JINA Center for the Evolution of the Elements). The simulations for this work were carried out on the NSF Frontera supercomputer operated by the Texas Advanced Computing Center at the University of Texas at Austin and on the Compute Canada Niagara supercomputer operated by SciNet at the University of Toronto. The data analysis was carried on the Astrohub online virtual research environment (<https://astrohub.uvic.ca>) developed and operated by the Computational Stellar Astrophysics group (<http://csa.phys.uvic.ca>) at the University of Victoria and hosted on the Compute Canada Arbutus Cloud at the University of Victoria.\n\n\n\n§ DATA AVAILABILITY\n\nSimulation outputs are available at <https://www.ppmstar.org> along with the Python notebooks that have been used to generate the figures presented in this work.\n\nmnras\n\n\n\n\n\n\n§ SUPPLEMENTARY FIGURES\n\n\n\nThis Appendix contains additional figures that are all referenced in the main text.\n\n\n\n\n\n\n\n\n\n\n\n"}