{"entry_id": "http://arxiv.org/abs/2303.06803v1", "published": "20230313011940", "title": "Energy flux and high-order statistics of hydrodynamic turbulence", "authors": ["Yuri V. Lvov", "Victor S. L'vov"], "primary_category": "physics.flu-dyn", "categories": ["physics.flu-dyn", "nlin.CD"], "text": " \n\n\n \n \n\n\n\n \n\n \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n#1#1\n#1#1\n#1#1\n#1#1\n#1#1\n#1#1\n#1#1\n#1#1\n#1#1\n\n\n\n#11exto 8.5cm0.3cm\n\t\t8.0cm#11ex  \n\n\n\n    1/2≡̄· %̂ŝ­∂⊥∥#1#̂1̂^ T x y z∇1 Tr⟨⟩()\n            [\n        ]κ̨θΘσΣ#1#1-blue#1#1#1#1#1#1#1#1#1#1#1#1#1#1#1#1#1#1#1#10.90.4#11ex to 8.5cm0.3cm8.0cm#11ex\n            1/2≡̄·%̃s̃%̂ŝ­∂⊥∥#1#̂1̂^ T x y z∇1 Tr⟨⟩()\n                    [\n                 ]#1_#14 ^4He k̨ŭxaḇx  k_2  R qωk̨ŭxaḇ#1_#1  \n                  We use the Dyson-Wyld diagrammatic technique to analyze the infinite\n                  series for the correlation functions of the velocity in the\n                  hydrodynamic turbulence. We highlight the fundamental role played by\n                  the triple correlator of the velocity as all higher order\n                  correlation functions are expressed through it.  This fact is shown\n                  through the resummation of the infinite diagrammatic series for\n                  multi-point correlation functions. The resummation generalizes the\n                  Dyson-Wyld resummation.  By analyzing leading and subleading orders\n                  of the diagrammatic technique we show that the 2-dimensional\n                  hydrodynamic turbulence is close to Gaussian. We show how the\n                  Gaussianity can be proved in all orders.\n                  \n                \n                  Energy flux and high-order statistics \n                   of   hydrodynamic turbulence\n                 \n                    Yuri V. Lvov^1 and Victor S. L'vov^2\n                ^1 Department of Mathematical Sciences, Rensselaer Polytechnic Institute,\n                   Troy, NY 12180 \n                ^2 Dept. of Chemical and Biological Physics, Weizmann Institute of Science, Rehovot 76100, Israel \n                    March 30, 2023\n                ========================================================================================================================================================================================================================================\n                \n                \n                \n                § INTRODUCTION\n                \n                   Investigation of the statistical properties of the hydrodynamic\n                   turbulence has a long and exciting history <cit.>.  The\n                   developed hydrodynamic turbulence may be characterized by three\n                   fundamental quantities: (i) the double correlation of the velocity\n                   ^2 F( k), characterizing the energy distribution of\n                   k-eddies of scale ℓ≃ 1/k; (ii) the characteristic time\n                   scale τ( k) of the response of the k-eddies to the\n                   external perturbation, given by the Green's function G( k);\n                   (iii) The triple correlation ^3 F( k_1, k_2, k_3),\n                   responsible for the energy flux across the scale\n                   ℓ≃ k_1^-1≃ k_2^-1≃ k_3^-1.\n                 \n                   A systematic way to analyze these objects was suggested by\n                   Wyld <cit.> who develop a graphical (diagrammatic) way to\n                   treat infinite perturbational series for the original “bare\"\n                   objects G_0( k) and ^2 F_0( k), that depends on the\n                   kinematic viscosity ν.  A crucial step forward was the\n                   Dyson-Wyld line resummation allowing one to replace in all\n                   remaining diagrams the bare kinematic viscosity ν by what is\n                   called “dressed by interaction turbulent viscosity\" νturb\n                   that accounts for the main mechanism of the eddy damping due to the\n                   energy exchange between scales.  Mathematically this replacement\n                   leads to the exchange of the initial expansion parameter from the\n                   Reynold number Re ∝ (1/ν)≫ 1 by the turbulent\n                   Returb∝ 1/νturb∼ 1.  As the result, the\n                   resumed diagrams involve only dressed objects G( k),\n                   ^2 F( k) instead of their bare counterparts G_0( k),\n                   ^2 F_0( k) involving only ν≪νturb.  This kind\n                   of procedure in diagrammatic techniques is called  dressing.\n                   Nevertheless the series for ^3 F( k_1, k_2, k_3), remains\n                   “undressed\", expressing it in terms of the “bare\"\n                   ^3 F_0( k_1, k_2, k_3), proportional to the original\n                   (“bare\") interaction amplitude V( k_1, k_2, k_3) in the\n                   Navier-Stokes equations.\n                \n                 \n                   In this paper, we suggest a natural next logical step after the\n                   Dyson-Wyld line resummation, the Lvov and L'vov triangle\n                   resummation. For brevity we reffer to this resumation as\n                   LL-resummation.  The LL-resummation results in a shorter (but still\n                   infinite) series for the dressed triple correlator ^3 F(ℓ)\n                   in terms of three dressed objects, G( k) and ^2 F( k)\n                   and ^3 F( k_1, k_2, k_3) itself.  Moreover, we show that\n                   the quadruple and higher-order correlators ^4 F, ^5 F,\n                   etc. also proportional to the powers of ^3 F, and thus all of\n                   them vanish if ^3 F =0. Since in the thermodynamic equilibrium\n                   ^3 F =0 it means that in the equilibrium all comulants are zero\n                   and statistics of turbulence become Gaussian order by order.  To\n                   reach these goals we carefully revisit the Wyld diagrammatic\n                   approach from the very beginning paying special attention to the\n                   numerical prefactors of the diagrams, crucially important for their\n                   further resummations.\n                         \n                         \n                   The key advantage of the diagrammatic technique is that it is\n                   possible to draw and analyze diagrams for the higher-order\n                   correlation function without explicitly deriving the corresponding\n                   analytical expressions first. Analyses of the topological\n                   properties of the resulting diagrams allowed us to suggest LL\n                   triangular resummation that would be impossible, or near-impossible\n                   to obtain by studying analytical formulas for the perturbation\n                   expansion.\n                  \n                   The paper is organized as follows: in ss:ME we set up the\n                   stage by introducing scalar equation for 2D turbulence. In\n                   ss:field we discuss the perturbation expansion for the field\n                   amplitudes showing that the prefactors in resulting tree diagrams\n                   are equal to 1/N, where N is the number of elements in\n                   the symmetry group of each particular tree diagram.  We refer to\n                   this fact as the \"1/N-symmetry\" rule.  We show that the\n                   1/N-symmetry rule is valid for all types of diagrams and for\n                   any of its fragments.\n                   \n                  The next step, presented in ss:DT-CF, is the procedure of\n                  “gluing\" of the n tree diagram that results in diagrams for the\n                  n-point, different-time correlation functions ^n  F for which\n                  the symmetry rule for the prefactors is also applicable.\n                  \n                  Analysis of the resulting diagrams lead to formulations in\n                  ss:hight of diagrammatic rules for ^n  F that allow one to\n                  find them in arbitrary order without sequential analysis of all\n                  previous orders in the expansion. In principle this allows one to\n                  skip reading ss:field, <ref> and <ref> and\n                  to look only at the final diagrams for the correlation functions.\n                \n                    In s:one-time we reduce the resulting diagrams for the\n                  different-time correlations ^n F (in the\n                  ( k,ω)-representation) to the single-time domain, denoted\n                  as ^n F. For this goal, we used the relation\n                  ^2  F( k, ω)∝ G( k, ω).  that follows\n                  from Wyld resummation. The resulting “extended\" set of diagrams for\n                  simultaneous correlators ^n F involve simultaneous ^2 F( k)\n                  and Greens functions G( k, ω). Once again, the\n                  prefactors are given by the 1/N symmetry rule.\n                  \n                The numerical value of the prefactors in the extended set of\n                  diagrams for ^n F, given by the 1/N-symmetry rule, allows\n                  us to group them into groups of three (triads) such that each group\n                  appears as a diagram for ^3 F. A nontrivial element in this\n                  procedure is that some initial diagrams can participate in more than\n                  one triad, different triads by their parts.  Finally, we discovered\n                  that a full set of triads with a particular form of its surrounding\n                  can be summed up to the full series for ^3 F.\n                \n                  Note that the topological structure of the diagrammatic series is\n                  defined by the quadratic nonlinearity of the Navier-Stockes equation\n                  with the interaction vortex satisfying Jacoby identity.  The Jacobi\n                  identity is a mathematical manifestation of energy conservation in\n                  hydrodynamic turbulence. The 2D turbulence has an additional Jacoby\n                  identity manifesting the enstrophy conservation.  Therefore our\n                  conclusions are applicable to both three- and two-dimensional\n                  turbulence.\n                \n                  Having developed the theory for multiple point correlators we\n                  consider in more detail the 2D turbulence, which allows the\n                  presentation of the Navier-Stokes equation in a scalar\n                  form <cit.>. Remarkably, the 2D turbulence serves as\n                  an idealized model for many natural flow phenomena, including\n                  geophysical flows in the atmosphere, oceans, and magnetosphere.\n                  Setups that are quite close to 2D turbulence were realized\n                  experimentally <cit.>.  It is observed in both DNS and\n                  experiments that statistics of 2D turbulence is surprisingly close\n                  to the Gaussian <cit.>. The natural\n                  explanation of this fact follows directly from our results: all\n                  cumulants for ^n F are proportional to ^3 F and being\n                  proportional to d-4/3 vanish in dimension d=4/3 which is\n                  quite close to d=2, as noticed in <cit.>.\n                \n                \n                \n                \n                \n                \n                §  DIAGRAMMATIC TECHNIQUE FOR STRONGLY INTERACTING FIELDS\n                \n                \n                This paper is based on the Wyld diagrammatic technique for\n                hydrodynamic turbulence <cit.> generalized by Martin,\n                Siggia, Rose<cit.> and by Zakharov,\n                L'vov <cit.>. Its detailed review is available in\n                <cit.>. The essence of a diagrammatic technique is in a\n                graphical representation (diagrams) of infinite perturbation series.\n                The technique allows to assess particular terms in infinite\n                perturbation series which would be near-impossible to perform with\n                their algebraic expressions alone. Using diagrams one can for example\n                to estimate the magnitude of the various terms in the expansions by\n                looking at the topology of the corresponding diagrams. Such assessment\n                led to the Dyson-Wyld resummation and to the triangular LL resummation\n                discussed in this paper.\n                \n                \n                \n                 §.§  Basic equation of motion for 2D hydrodynamics\n                \n                \n                The basic equations of motion for two-dimensional (2D) and three-dimensional (3D) turbulence have similar structures. The 2D turbulence may be represented as a scalar equation for the vorticity, which simplifies the appearance of the analytical expressions. Therefore for the transparency of the presentation we  illustrate our formalism on the 2D turbulence. \n                In the present work we, following <cit.>, consider the Euler\n                equation for the vorticity equation in 2D:\n                \n                    ∂ω/ ∂ t+ ( u·∇) ω=0 .\n                \n                The velocity and vorticity of a two-dimensional (2D) flow may be\n                derived from the  stream functionψ( x,t):\n                u ( x,t)=-∇×ẑψ(,t),\n                ω( x,t) = -∇^2 ψ( x,t), where ẑ\n                is a unit vector orthogonal to the x̂-plane, and ∇^2\n                is the Laplacian operator in the plane.  In k-representation,\n                a( k,t)≡ k∫ d Rexp[-i( R· )] ψ(\n                R,t).  The Fourier transforms of u(,t) and of\n                ω(,t), are denoted as v(,̨t) and\n                Ω(,̨t) respectively. These Fourier transforms are expressed\n                in terms a(,̨t), re-designated for the shortness as a_ k:\n                v(,̨t)=i(ẑ×)  a_$̨,Ω(,̨t)= -k  a_$̨, where =/̨k.  Now, by NS3)\n                \n                    ∂ a_/∂ t   = ∫d^2 k_1 d^2 k_2/2·2πδ (+̨_̨1+_̨2)V_k12 \n                       a^*__̨1a^*__̨2 ,       \n                    V_k12 =  S_k12(k_2^2-k_1^2)/2 kk_1k_2 , S_k12≡2 k_1 k_2 sinφ_12 ,  \n                      \n                     S_k12   = \n                    S_2k1=S_12k=- S_k21=- S_1k2=- S_21k ,\n                        |S_k12| = √(2(k^2k_1^2+k_1^2k_2^2+k_2^2k^2)\n                     -k^4-k_1^4-k_2^4) .\n                \n                Here the interaction amplitude (or “vertex”) V_k12 is expressed\n                via S_k12; |S_k12|/4 is the area of the triangle formed by the\n                vectors ,_̨1 and _̨2. φ_12=φ_1-φ_2;\n                φ_k, φ_1 and φ_2 are the angles in the\n                triangle plane between the x_1-axis and the vectors $̨,_̨1and_̨2respectively.  The vertexV_k12satisfies two Jacobi\n                identities\n                \t\n                    (V_k12+V_2k1+V_12k)=0 ,\n                                   \n                    \t(k^2V_k12+k_2^2V_2k1+k_1^2V_12k)=0 .\n                \n                These two identities ensure the conservation of energy Ein the inviscid forceless limit and the enstrophy Hgiven by\n                \n                    E≡E/V=∑ _|̨a_k|^2 ,    H≡H/V=∑ _k̨^2 |a_k|^2  .\n                \n                \n                Equation (<ref>) describes the two-dimensional hydrodynamic\n                turbulence.  For the three-dimensional turbulence the equation of\n                motion is of the same type as (<ref>) but with additional vector\n                indices <cit.>.  Therefore the results of this manuscript\n                are applicable for both 2D- and 3D turbulence. We focus our\n                presentation on the 2D turbulence to simplify our presentation.\n                \n                Following Wyld <cit.> we divide the world into the system\n                under consideration and the thermostat. The action of the thermostat\n                on the system is modeled by random noisef( k,t)and dumpingγ_0(k). Then we replace in LHS of BE2∂ a_∂ t⇒∂/∂ t+ γ_0( k) ]a_-̨ f( k,t)so that we obtain\n                instead of BE2\n                    [∂/∂ t+   γ_0( k) ]a_=̨∫d^2 k_1 d^2 k_2/2·2πδ (+̨_̨1+_̨2)V_k12  a^*__̨1a^*__̨2+f( k,t) ,\n                \n                where the average statistics of the noisef( k,t)is assumed to\n                satisfy f( k,t) f( k',t') ∝ T γ_0( k,t)\n                δ( k-  k') δ(t-t'). Here an overbar denotes an average\n                with respect to the thermodynamic equilibrium ensemble with\n                temperatureT.  The presence of the thermostat force and the dumping\n                allows (<ref>) to have nontrivial solutions.  After the Dyson-Wyld\n                line-resummation, described below, we will disconnect our system from\n                the thermostat by taking limitγ_0( k)→ 0. It was\n                shown <cit.> that the result is independent of\n                the thermostat parameters.\n                \n                After  the Fourier transformation with respect to timet, the  ME  in the q=( k, ω)-representation becomes:\n                  \t\n                    a_    = ^0 G_ [ 1/2∫d _1   d   _2/ (2π)^d+1δ^d+1_q12 V_k, 1 2   a^*_1 a^*_2 + f_ ] ,       ^0  G_= i / [ω+iγ_0( k) ] .\n                 \n                \tHere^0 G_is  the bare Greens function,d _j d̄^2  k_j dω_j, andV_ k,  1  2=V( k; k_1, k_2). \n                 \n                  \n                \n                 §.§  Iterative expansion for field variables   a_\n                 \n                  Introducing zero-order solution of this equation^0a_ ^0  G_ f_we can get its iterative solution as a formal\n                infinite series with respect to powers of^0a_:a_ =  ^0 a_ +   ^1a_+   ^  2a_+\n                   ^3aa_  +  ^3ba_+  ^4aa_+   ^4ba_+   ^4ca_+…, where\n                \n                      \n                \t\n                    ^1a_    =    ^0 G_/2∫d  q_1  d  q_2/ (2π)^d+1δ^d+1_q56V_k,56 a_5  a_6  ⇒^1a_ ∝G  V/2 a _5    a _6   , \n                     ^2a_    =     ^0  G_/2∫d  q_1   d  q_9/ (2π)^d+1δ^d+1_q19V_k,19 G_1∫d  q_2  d  q_3/ (2π)^d+1δ^d+1 _156V_1,56  a_9\n                    \t\t\ta_5  a_6     ⇒   ^2a_∝(G V)^2/2  a_9   a_5  a_6 , \n                    \t\t\n                           - 1cm  \t ^3aa_ =  ^0 G_∫d  q_1  d  q_5/ (2π)^d+1δ^d+1_q15V_k15 ^2a_1 a _5\n                    \t\t\t   ⇒\n                    \t\t\t^3aa_∝(G V)^3/2       a_5   a_6  a_7     a_8     , \n                           - 1cm   ^3ba_ = ^0 G_/2∫d  q_1  d  q_2/ (2π)^d+1δ^d+1 _q12V_k,12 ^1 a_1  ^1 a_2     ⇒ \n                    \t\t\t^3ba_∝(G V)^3/2^3  a_5  a_6  a_7  a_8  , \n                           - 1cm    ^4aa_=  ^0    G_∫d  q 1   d  q 2/ (2π)^d+1δ^d+1 _q12V_k12  ^3aa_1 a _2 \n                    \t\t\t   ⇒   ^4aa_∝(G V)^3/2  a_5  a_6  a_7  a_8  a_9 ,  \n                           - 1cm    ^4ba_= ^0    G_∫d  q 1   d  q 2/ (2π)^d+1δ^d+1 _q12V_k,12^2a _1  ^1a_2  ⇒ ^4ba_q∝(G V)^3/4  a_5  a_6  a_7   a_8  a_9 ,\n                           - 1cm    ^4ca_=  ^0 \n                     G_∫d  q_1   d  q_2/ (2π)^d+1δ^d+1 _q12V_k12  ^3b a_1 a _2     ⇒\t\t\t^4ca_∝(G V)^3/8   a_5 a_6  a_7  a_8  a_9 .\n                \n                \n                \n                 \n                            \n                Here ^0 a_,  ^1a_, ^ 2a_, \n                  ^3a_and  ^4a_are zeroth, first, second,\n                third, and fourth-order iterations in the powers of interaction matrix\n                elementV. Here the number to the left ofadenotes the order of\n                iterative. For the third and fourth order there are contributions of\n                different typologies, so the letters “a”,”b”, and “c” are used\n                to differentiate between them.\n                \n                Using graphical notations shown in FF:1basic we can present each\n                term in this series in a graphical form, as a “tree\" diagram, as\n                shown in FF:1. In these diagrams,^0G_shown as thin\n                wavy-straight line,^0a_as a short thin wavy line which are\n                connected by vertexV_1,23shown as a fat dot “∙\" with\n                the straight tail, belonging to^0G__1and two wavy tails,\n                belonging to^0a__2and^0a__3.  The key realization\n                which gives birth to the diagrammatic technique is that instead of\n                deriving IT2 we could have had drawn  all possible\n                topologically different trees,  without deriving equations\n                  IT2 analytically first.\n                \n                 \n                \n                Analyzing IT2 and FF:1 with the trees, we see that the\n                trees with the symmetrical elements have a numerical prefactor that is\n                given by1/N, whereNis the number of elements of the\n                symmetry group of a diagram. This is a constructive demonstration of\n                the1/Nsymmetry rule for the trees.  We will see this rule\n                again when we consider diagrams for the correlation function.  The\n                symmetry factor appears as a consequence of the k_1↔k_2symmetry and factor1/2in\n                the equation of motion (<ref>). The rigorous proof of the1/Nsymmetry rule is beyond the scope of the present\n                manuscript.  The1/N-symmetry rule will play a crucial role\n                below, as it will lead to the natural grouping of the diagrams into\n                triads. It would be much harder to see this rule by looking at\n                analytical expressions alone.\n                \n                  The next important advantage of a diagrammatic technique is that\n                  from topological properties of the diagrams one can make conclusions\n                  about the corresponding analytical expression without detailed\n                  analysis and even perform a partial resummation of diagrams with\n                  particular topological properties. This observation leads to the\n                  Dyson-Wyld line-resummation of reducible diagrams. \n                    Reducible are the diagrams that contain fragments that can be\n                  disconnected from the rest of the diagram by cutting two lines. If\n                  these cut lines are wavy and straight ones, then the infinite sum of\n                  the corresponding fragments become “dressed\", Green's function G_, defined as∂ a_∂ f_'=(2π)^d+1δ^d+1\n                  ( -')  G_which can be presented as (see\n                  e.g. Wyld1961,Martin1973,Zakharov1972b)\n                \t\n                    G_= i  /  [ω + i γ_0( k)-Σ_ ] ,    -[Σ_ ]  =Γ_=k^2 νturb(k) ,\n                \t\n                \twhere the “mass operator\"Σ_is an an infinite set\n                        of diagrams and gives the “turbulent\" dissipation:νturb.  For the case when cut lines in the reducible\n                        diagrams are two wavy lines, the infinite sum corresponding\n                        fragments represents “dressed\" double correlator F_, defined by F2, shown in diagrams as long\n                        thick wavy lines.\n                \n                After performing the Dyson-Wyld line resummation, the\n                expansion (<ref>) is presented in terms of the dressed Green's\n                function G_(instead of^0 G_) and dressed fielda_(instead of^0a_) where the iteratea_qwill be used below.\n                \n                \n                 §.§ Diagrammatic expansion of\n                                correlation functions\n                \n                \n                  §.§.§ \n                                Definitions and procedure\n                \n                              We define the two-, three-, four-, andn-point\n                              correlators in=( k,ω) space as\n                     \n                    (2π)^d+1δ( _1+_2)  ^2 F\n                        (_1,_2)  \n                     = ⟨ a__1 a__2⟩/ 2! ,   \n                          (2π )^d+1δ( _1+_2+_3)   ^3 F(_1,_2,_3)   \n                         =  ⟨ a__1 a__2a__3⟩/ 3! , \n                       \n                         (2π)^d+1δ( _1+_2+_3+_4)  ^\n                           4 F(_1,_2,_3,_4)\n                               =  ⟨ a__1 a__2a__3\n                               a__4⟩/(4!) , \n                        (2π)^d+1δ(∑_j=1^n _j) ^n F\n                        (_1,…, _n)\n                        ⟨̄∏̄_̄j̄=̄1̄^̄n̄ ̄ā_̄_̄j̄⟩̄/ ( n!) ,     n = 2,3,\n                        … ,       ^2 F()^2   F(, -) .\n                \n                \n                       Heredis the dimension of space. In the case of 2D\n                       turbulence,d=2.  We have included prefactor1/ n!in the\n                       definitions ofn-point correlation function^n F.\n                       Note thatn!is the number of elements of the symmetry group\n                       of a correlator that is equal to the number of permutations in\n                       the definition of ^n  F in the definition (<ref>).\n                       This is precisely the choice that ensures the applicability of\n                       our1/N-symmetry rule  for the correlation functions.  As we will see below this\n                       particular choice simplifies the appearance of final\n                       expressions for^n F. Notice that the notation^2 F (,')involves two arguments, while\n                       actually, it depends only on one argument, says.\n                       Therefore in 9c we define it in the more traditional way.\n                 \n                  \n                       Diagrammatic presentations of^2 F,^3  Fand^4 Fcan be obtained by gluing together two, three, and four\n                       trees. The gluing is a graphical representation of the\n                       averaging over the ensemble of the random force.  On the\n                       corresponding diagrams of two glued trees the dashed line\n                       crossing out the double correlator is the point where the\n                       “branches” of two trees were “glued” to form a double\n                       correlator.  The number of possible combinations of the glued\n                       trees will be of crucial importance in further investigation of\n                       the diagrammatic series.\n                \n                       For the Gaussian process, the high-order correlation functions\n                       can be presented as a product of all possible second\n                       order correlators. Specifically, it means that\n                  \n                    ⟨ a_k^* a^*_l a_p a_n ⟩ =  F _k \n                        F_l(δ^k_pδ ^l_n + δ^k_nδ ^l_p) ,  ⟨\n                        a_k^* a_l a_p a_n⟩ =0  ,   ⟨ a_k a_l a_p a_n⟩ =\n                        0 .\n                \n                  In this manuscript, then-point correlators^n Falso will be\n                  classified by the numbermof interacting vortices in the\n                  diagrams, shown as superscript from the right:^n F^m. Thus, the\n                  lowest and next to the lowest diagrams for^3 Fand^4 Fare\n                  denoted as ^3 F I, ^3  FIIIand ^4 FII, ^4 FIV.  We will see that the\n                  numerical prefactors before the diagrams play a critical role in the\n                  LL-<triangle-resummation.\n                \n                 \n                \n                  §.§.§ Rules for   reading diagrams\n                \n                 Rules for writing down the analytical expressions corresponding to specific diagrams are pretty universal across different diagrammatic\n                 techniques <cit.>. We focus first on reading the diagram in\n                 the( r, t)representation. The rules\n                 are∙The diagrams are the sets of lines connected by a three-way\n                 junctions—interaction amplitudeV(solid dot in FF:1basic).\n                 The wavy lines are the double correlators^2 F, while the\n                 wavy-straight lines represent the Green's\n                 functions G.∙Each propagator is a function of two sets of arguments, say r_1,t_1and r_2,t_2, associated with its ends. In the stationary and space-homogeneous case, considered in this paper, the propagators depend only on differences of these arguments, e.g. G( r_1- r_2,t_1-t_2).∙Double correlator^2 F( r_1- r_2,t_1-t_2)is an\n                 even function of its arguments, while Green's function G( r_1- r_2,t_1-t_2)=0ift_2(associated with the\n                 straight line, denoting force end) is larger thant_1: G( r,t)=0ift<0. This a consequence of the causality\n                 principle response of the velocityδ v(t_1)on the\n                 forceδ f (t_2)must be zero ift_2>t_1.∙Each vertex also has space-time arguments, say r_n,t_n, the same as the legs of three propagators, connected to\n                 it. In the diagram, one has to integrate over arguments r_n,t_nof all\n                 inner vertices.∙Since each vortex has its own time we can partition the\n                 diagram into time zones.  The boundaries of these time zones are\n                 denoted by dashed lines on the diagrams, as on FF:21. These time\n                 zones will play a significant role in calculating time integrals\n                 corresponding to each diagram, as discussed\n                 below in Section <ref>.∙In( k,ω)-representation each propagator, say G( k,ω)[Fourier image of G( r,t)]\n                 has only one set of arguments, each vertex involves delta-functions\n                 with the sum of k_n, ω_narguments(2π)^(d+1)δ( k_1+ k_2+\n                 k_3)δ(ω_1+ω_2+ω_3), wheredis the\n                 dimensionality of k-space. \n                   Finally one has to integrate∫ dω_n/(2π)and∫ d k_n/(2π)^dfor all intrinsic lines.\n                 \n                 We will use these rules to write down analytical expressions\n                 for all the diagrams we obtain below.\n                \n                \n                 \n                 \n                \n                  §.§.§ Third order correlator  ^3   F I and ^3  FIII\n                \n                \n                  \n                First  order diagrams for triple correlator  ^3 F^1.\n                \n                Its first representative ^3  F_123^1Ais shown in\n                Fig.<ref>(a) as a diagram ^1 A_1,23.  From definition (<ref>) one gets\n                    (2π)^d+1δ_123 ^3 F_123^ 1A   =    123 P ^1 A_1,23 ,      \n                     \t(2π)^d+1δ_123 ^1 A_1,23  =  1/2 a_1^ 1  a_2  a_3  ,   δ_123δ̄(_1+_2+_3) .\n                \n                     Here 123 P is the permutation operator which,\n                     when acting on the function, produces a sum of all possible\n                     permutations of its indexes divided by the number of all\n                     possible permutations of the indices. For example\n                   123 P A_1,23≡13!( \n                  A_1,23+ A_1,32+ A_2,13. \n                 . +  A_2,31+ A_3,12+ A_3,21).\n                  Substituting ^1a_1 from 1A2 into ^1 A_1,23\n                  one gets ^1 A_1,23=14 G_1 V_1,56 a_5 a_6  a_2 a_3.  \n                Hereafter we colored in blue parts, originating from the tree\n                ^1a_ in itA. We now are to average the resulting\n                expression using the pairing rule  \n                eq:wick   which corresponds to gluing together the trees of ^1a_ and a_. The result is pairs a_5 a_6 and a_2 a_3that give uncoupled contributions (each of them is\n                equal to zero). Two equivalent ways to pair\n                a_5 a_2 and a_5 a_3{denoted for the shortness as 52 and\n                53, or even shorter as [5(2,3)]} result in\n                   \n                    ^1 A_1,23= 1/2  G_1 V_1   2   3   F_2  F_3 .\n                 \n                 Here _1+_2+_3=0,    G_jG(_j), and  F_jF(_j), \n                and \n                  \n                wherej=-_jand F_jF̄(_j).  Graphically\n                this result is shown in FF:3(a).  We preserve notation^n A_1,2…for all diagrams ofnthorder in\n                vertexesVwith one leg denoting the Green's function G_1and any\n                number of wavy tails denoting F_j.\n                \n                 \n                  \n                 \n                \n                  \n                Third order diagrams for triple correlator ^3 F^3. \n                  In this section, we compute the three-point correlator in the third order in the interaction vertex. As we will show below this object plays a key role in the\n                 statistical properties of hydrodynamic turbulence. This\n                 object appears as a result of gluing together three trees and leads to the diagrams which are triangular in shape. \n                To calculate^3 F^3we use   F2 and collect all terms∝ V^3:\n                  \n                    (2π)^d+1δ^d+1_123  ^3  F_123^(3)=   123 P [\n                       ^3a A_1,23+ ^3b A_1,23 + ^3 B_12,3 + ^3 C_123 ] ,  ^3a\n                           A_1,23=   ^3aa_1 a_2 a_3  / 2 ,   \n                     ^3b A_1,23=     ^3ba_1 a_2  a_3 / 2  ,   \n                        ^3 B_12,3= a_1^2 a_2^1 a_3  ,   ^3 \n                           C_123=   a_1^ 1 a_2^ 1 a_3^ 1  / 3! .\n                \n                \n                  These terms are computed in the Appendix\n                  (<ref>)\n                and the  results are given by\n                 \n                    ^3a A_1,23   =    G_1    F_2  F_3 ∫d _4/(2π)^d+1  V_1; 4,1+4V_4;4-2,2 V_2-4;3,1+4 G_4^*  G_2-4 F_1+4  ,   \n                      \n                      ^3b A_1,23   =1/2 G_1   F_2  F_3\n                      ∫d _4/(2π)^d+1 G^*_4  F_2-4 G_1+4 V_1;4,1+4\n                        V_4;4-2,2 V_4+1;3,2-4 ,\n                        \n                    \n                      ^3   B_12,3   = G_1  G_2    F_3\n                      ∫d_4/(2π)^d+1 F_4  F_4-2 G_1+4 \n                    V_1;4,1+4V_2;4,4-2V_4+1;3,2-4 ,   \n                    ^3  C_123   =  1/6 G_1  G_2  G_3\n                       ∫d_4/(2π)^d+1 F_4 \n                         F_4-2 F_1+4  V_1;4,\n                    1+4 V_2;4,4-2V_3;1+4,2-4 .\n                 \n                The corresponding diagrams are  shown in FF:4(a)-(d). \n                 \n                \n                \n                  §.§.§ Four Point Correlation Function\n                \n                \n                  \n                Second  order diagrams for ^4 F^(2)∝ V^2 \n                These diagrams are proportional to the product of two vertexesV.\n                They originates from ten terms, which we divide into two groups^2 A_1,234with one and twoG-tails involving Green's\n                functions.  Hereafter we preserve the notation^n B_12, …for all diagrams ofnthorder inVwith two leg G_1, G_2and any number of wavy tails\n                denoting F_j.\n                  \n                    -.5cm  (2π)^d+1δ_1234^4 F_1234^(2)=  1234 P [^2 A_1,234 + ^2 B_12,34 ] ,   ^2 A_1,234=      ^2 a_1    a_2  a_3 a_4/ 3! ,     ^2 B_12,34=   ^1 a_1  ^1 a_2    a_3a_4  /4 .\n                 \n                              The required pairings  are presented  in the Appendix (<ref>).\n                              The results are  diagrams  in FF:3(b) and (c) with \n                \n                    ^2 A_1,234=\n                      1/2  G_1  G_5 V_1;4,5 V_523  F_2  F_3  F_4     ,   ^2 B_12,34 = 1/2  G_1  G_2   F_3  F_4  F_5\n                         V_135\n                      V_235,   _5 = (_1 + _4)\n                     .\n                \n                 These results will be \n                used   to obtain a single-time version of the four-point correlator in the second order in the interaction vertex.\n                \n                \n                \n                  \n                 Fourth-order diagrams for\n                  ^4  F^(4)_1234∝ V^4 These diagrams have seven\n                types of terms:\n                \n                    (2π)^4 δ _1234  ^4  F_1234^(4) =\n                                1234  P{^4a\n                                    A_1,234 + ^4b A_1,234  +\n                                ^4a B_1234 + ^4b B_1234 +\n                                ^4c B_1234  + ^4  C_1234+\n                                ^4 D_1234} ,   \n                    ^4aA\n                    \t\t_1,234=   ^ 4a a_1      a_2   a_3 a_4 /3!,   ^4b A_1, 234=   ^ 4b a_1  a_2 a_3 a_4 /3! ,  ^4a B_12,34= ^ 3a a_1^\n                    \t\t\t1a_2   a_3   a_4 /2,   ^4b B_12,34= ^ 3ba_1  ^ 1a_2  a_3 a_4 /2,  \n                    ^4c B_1234= ^\n                    \t\t\t2a_1  ^ 2a_2   a_3 a_4 /4,    ^4  C_123,4=  ^ 2a_1  ^ 1a_2   ^\n                      1a_3 a_4 /2,  ^4  D_1234=   ^\n                    \t\t\t1a_1  ^ 1a_2   ^ 1a_3  ^ 1a_4 /4! .\n                 \n                      The resulting diagrams and corresponding analytical expressions\n                      are computed in the Appendix\n                      <ref>. The diagrams are shown\n                      in FF:5 while the corresponding analytical expressions are\n                      given by iter.\n                  \t\n                \n                  \t \n                \n                 §.§ Diagrammatic rules for plotting high order correlation functions\n                \n                \n                Examining diagrams in FF:1 for the vorticity fielda_we see\n                that it is possible to write then-th order diagrams fora_without\n                going through the cumbersome analytic substitutions, presented by\n                IT2: the diagrams corresponding to the velocity fielda_are\n                given by all topologically distinct binary trees withnvertices, such that all the trunks are made of Green's functions and\n                all the end branches are made ofa_s.  Furthermore, every portion of\n                the tree that continues in a symmetric fashion gets a factor of 1/2\n                due to the symmetry of the original equation of motion.  The overall\n                numerical prefactor for a tree withNelements in its symmetry group\n                is, therefore, is equal to1/N.\n                  \n                Examining FF:3, <ref> and <ref> for the diagrams for^3 Fand^4 Fwe formulate the rules of the\n                diagrammatic technique, which allows to skip the procedure of\n                step-by-step derivation by gluing\n                corresponding trees:∙Diagrams for then-point,m-th order correlator^n F^(m)irreducible correlation functions are all\n                topologically different graph withmvertices andn-wavy tails.\n                These wavy tails are either the Greens functions Gor double\n                correlations F. \n                ∙ Each vertex in the diagram can be reached by the only way via G from the outer leg of G.∙There are no loops made of the G-functions.∙According to our1/N-symmetry rule the prefactor for\n                a diagram withNelements in his symmetry group is1/N.\n                \n                \n                \n                \n                  In particular, diagrams without any symmetry (i.e. with onlyN=1identical element of symmetry), including diagrams in FF:3(b),\n                  FF:4(a) and (c) and FF:5 (a,b,c,e, and g) have\n                  numerical prefactor equal to unity. Furthermore, the diagrams with\n                  non-trivial symmetry element (i.e.N=2) have prefactor1/2,\n                  as in the diagram^1 A_1,23with the symmetry2\n                  ⇔ 3in FF:3(a), diagram^2\n                    B_12,34with the symmetry1 ⇔ 2together with3 ⇔ 4in FF:3(c), diagram^3b\n                    A_1,23with the symmetry2 ⇔ 3in\n                  FF:4(b), etc. The most symmetrical ones are the\n                  diagrams for^3 C_123in FF:4(d), (symmetrical\n                  under permutations of all three arguments) withP=3!=6, which\n                  generates prefactor1/6and the diagram for^4\n                    D_1234in FF:5(h), which is symmetrical under reflection\n                  in four lines: horizontal, vertical, and1-3and2-4oblige\n                  lines and rotations on the anglesϕ=0, π/2, π, 3π/2.  Thus for the^4 D_1234diagramN=8and the1/N-prefactor is\n                  equal to1/8.\n                \n                \n                 \n                  Analyses of these diagrams and a wide set of additional diagrams not presented here demonstrate that the above-formulated diagrammatic rules work not only for the diagrams as a whole but also for their\n                fragments. So we expect that this is the general rule for diagrams for \n                  all orders and for all of its fragments. \n                  \n                We think that this fact follows from the internal structure of the\n                presented perturbation theory, reflected in the topology of their\n                diagrams. Bearing in mind that the question of numerical prefactor is\n                of principal importance for this paper, allowing\n                LL-triangle-resummation of high-order diagrams and that its rigorous\n                mathematical proof is still absent we decided to check it\n                constructively for all diagrams, considered in this paper.\n                \n                \n                  \n                \n                \n                § \n                  SIMULTANEOUS CORRELATION FUNCTIONS\n                \n                In this section, we show how and why the simultaneous correlators\n                can be further resumed up to powers of the simultaneous triple correlator^3F.  As a preliminary step, we introduce all required simultaneous correlations in the k-space: F()̨F̄_$̨,\n                ^3  F (_̨1,_̨2,_̨3)^3 F_123 and\n                ^4 F(_̨1,_̨2,_̨3,_̨4)F̄_1234, where  \n                 (2π)^d δ( _̨1+_̨2)   F(_̨1)  a__̨1 a__̨2,\n                 (2π )^d δ(  _̨1 + _̨2 + _̨3 ) ^3\n                          F_123⟨̄ ̄ā_̄_̨̄̄1̄ ̄ā_̄_̨̄̄2̄ā_̄_̨̄̄3̄⟩̄/(3!), \n                  (2π)^d δ( _̨1+_̨2+_̨3+_̨4) ^\t4 F_1234⟨̄ ̄ā_̄_̨̄̄1̄ ̄ā_̄_̨̄̄2̄ā_̄_̨̄̄3̄ā_̄_̨̄̄4̄⟩̄/(4!), \n                \t etc.    The simultaneous correlation functions relate to\n                        different-time correlators in\n                        =(,̨ω)-representation as follows:\n                                \t\n                    F( )̨=∫d ω/2π F(,̨ω) ,  \n                                         ^3  F( _̨1,_̨2,_̨3)=∫d ω_1  d ω_2 d ω_3/(2π)^d   ^3  F( _1,_2,_3)\n                                         δ  ( ω_1+ ω_2+ ω_3 )   , \n                            ^4  F( _̨1,_̨2,_̨3,_̨4)=∫d ω_1  d ω_2 d ω_3 d ω_4/(2π)^d+1δ  ( ω_1+ ω_2+ ω_3 + ω_4)  ^4  F( _1,_2,_3,_4) .\n                \n                                Therefore to obtain a single-time correlator of any\n                              order the corresponding multiple-time correlator needs\n                              to be multiplied by the delta function of the sum of all\n                              the frequencies and then integrated overall\n                              frequencies.  \n                \n                \n                        \n                \t\n                \n                 §.§  One-pole approximation\n                 For the actual calculation of integrals in TO one\n                        needs to know the ω-dependence of G(,̨ω) and\n                        F(,̨ω).  Therefore to proceed further we adopt the\n                        so-called one-pole approximation <cit.> in\n                        which the ω-dependence of the “mass operator\"\n                        Σ_ k, ω in GnB for the Green's function\n                        G_ is neglected. Similarly, we further neglect\n                        ω-dependence of the mass operator\n                        Φ_,̨ω⇒Φ_$̨ in the Wyld's equation\n                        for F_= |G_|^2 (Φ_+D_) whereD_is a\n                        correlator of the white noise.  Furthermore in the Dyson\n                        equation we neglect the double correlator of the white noise,\n                        since it is much smaller thanΦ_. As a result we have\n                        \n                    G_,̨ω = i/ω+ iγ_k  ,\n                        F_,̨ω=Φ_/ω^2+γ_k^2= 2 γ_k F_/ω^2+γ^2= 2 {G_,̨ω}F_.\n                 \n                  \n                        Equation (<ref>) replaces F_,̨ωby\n                        the sum of the Green's function and its complex conjugate\n                        multiplied byF_$̨. This replacement is a crucial step that\n                        allows us to group in  high-order diagrams  in the triad, involving three diagrams, required for further it resuming in ^3F.   We denote \n                        G̃_G_ F_$̨ as an “auxiliary Green's functions”, while\n                        the original Green's function G_is called “true”\n                        Green's function. To distinguish between “true” and\n                        “auxiliary” Green's functions in the diagrammatic series,\n                        the auxiliary Green's functions will be distinguished by\n                        additional “dash” crossing it.\n                 \n                        The diagrams with the loop along Green's functions with the\n                        same orientations give zero contribution to^n  F_…due to the causality principle.  This is\n                        true regardless of whether the Green's function is “true” or\n                        auxiliary. This property can be seen int- or inω-representation.  Itt-representation we should\n                        recognize that the wavy tail of each Green's function has timet w, while the straight tail has timet s> t w.\n                        Otherwise, Green's function is zero due to the causality\n                        principle. Therefore wavy tail of Green's function in the next\n                        loop will have timetw,n+1even earlier thantw,n. This is impossible because the last in the loop\n                        wavy tails must have the same time as the timetw,1fist in the straight loop line.\n                  \n                        The same conclusion can be obtained in theωrepresentation: similarly oriented numbernGreen's function\n                        with frequenciesω_1,ω_2=ω_1+δ_1,ω_3=ω_1+δ_1+δ_2, etc. (hereδ_nis the “incoming\" frequency from the connected line in thenthvertex) are analytical in someω_1-half-plane, again, as a consequence of the\n                        causality principle. Thereforeω_1-frequency integral\n                        in the loop indeed vanishes. Similarly, it is possible to show\n                        that diagrams, involving chain of similarly oriented Green's\n                        function connected any of external tails do not contribute to\n                        the simultaneous correlators^n  F_…as a\n                        manifestation of the causality principle.  This statement is,\n                        again, true, regardless of whether the Green's function is\n                        “true” or “auxilarly”.\n                \n                \n                \n                \n                             \n                 \n                \n                 §.§  Time-zones and  interaction-time integrals in the   diagrams for ^3F_123,    and ^4F_1234\n                 \n                 \n                In this section, we consider the actual procedure of calculations of \n                 integrals for interaction times, of the type presented in TO,  in the one-pole approximation. Below we begin with the simplest case of diagrams for^3F^(1). \n                \n                \n                \n                \n                  §.§.§   First-order triad  for  ^3F_123 I\n                 After replacement (<ref>) in F31B we obtain four\n                diagrams for ^1F_123^(3), shown in FF:9. Three of them,\n                shown in Panels (b), (c), and (d) vanish after frequency integrations,\n                as required by TOa. A non-zero diagram in FF:9(a) under the\n                permutation operator123 Pin F31 can be\n                presented as the sum of three diagrams, shown in FF:9(e), (f)\n                and (g). The set of these three symmetric with respect to the\n                permutation of their legs diagrams, oriented inside with the straight\n                line will be referred to below as a “triad\". The simplest triad with\n                only one vertex inside, as shown in FF:9 will be called a\n                first-order triad. As we see this is nothing but the diagrams for ^1F_123^(3), shown in FF:9(h) as thin red triangle.\n                \n                \n                Analitycally, diagrams for ^1F_123^(3)are as follows: ^1F_123^(3)=123 P ^1 A_1,23, ^1 A_1,23 = 1/2 T_123 V_1; 2, 3  F _2 F_3,_1+_2+_3=0 .  where we introduced the triad-interaction time\"T_123: \n                    T_123   =   ∫\n                      dω_1 dω_2 dω_3 G_1 G_ 2 G_3 δ( ω_1 +ω_2 +\n                       ω_3) /(2π)^d .\n                 \n                  In the one-pole approximation (<ref>) this integral can be easily taken  to obtain\n                      \n                    T_ijk1̄/(γ_i+γ_j+γ_k) ,  γ_iγ̄(k_i) ,  γ_jγ̄(k_j) , …\n                \n                \n                We will see below thatω-integral (<ref>) and much more involvedω-integrals are much more efficient to calculate in k,t-representation.  \n                To translate any diagram to the( k,t)the representation we assign different times to the beginning and\n                to the end of each Green's function:G_i ≡ G( k,τ-t_j),   j=1,2,3.In the one-pole approximation  GF (<ref>) has the form \n                \n                    G( k, τ) =  \n                    exp(γ_k τ)  τ<0  .\n                \n                The Green's functions are equal to zero for positive times as  the\n                future can not affect the present (the causality principle).\n                \n                Now consider the diagrams  in FF:9(e,f,g). Since this is a one-time\n                correlator, the external ends should have an equal time assigned to\n                it. Let us assign the time to be zero, as int_1=t_2=t_3=0and connect them by the dotted line “present time-border\", which separates the future (outside of the diagram) and  past time-intervals, inside of the diagram. The time of the vertex,τbelongs to the past and goes from-∞to zero. Now \n                 integral (<ref>) in the k,t-representation can be written as follows: \n                \n                 \n                    T_123 =∫ _-∞^0 d τ G( k_1,τ)G( k_2,τ)   G( k_3,τ) = ∫ _-∞^0 exp[ (γ_1+γ_2+γ_3  ) τ  ] dτ=1 /(γ_1+γ_2+γ_3).\n                \n                 \n                 The answers (<ref>) and (<ref>) for the triple\n                 interaction time are equivalent. Naturally, the answer is independent\n                 on whether it is obtained intorωrepresentaton.\n                \n                 \n                \n                  §.§.§   Third-order triad  for  ^3F_123 III\n                \n                \n                  To calculate   the third-order triple\n                  correlator^3FIIIwe take (<ref>) and\n                  substitute it into 16. Graphically, this corresponds to replacing all\n                  three double correlators of ^3a A_1,23by the pair of auxiliary Green's functions, run in either direction (i.e. eight\n                  possibilities). The  six of these4· 8=32possibilities give nonzero contributions for simultaneous\n                  correlation functions.  The resulting six\n                  diagrams are shown in FF:11 and denoted as ^3a A_1,23 I ,^3b A_1,23 I , B_12,3 I , B_12,3II, B_12,3III,\n                  and C_1,23 I .  \n                 \n                 \n                  As explained above, Green's functions have inherent time direction:\n                  time flows in the direction from a wavy to a straight\n                  line. Therefore the beginning of the Green's function has an earlier\n                  time than the end of the Green's function that enters the vertex. To\n                  calculate one-time correlators, we replace the double correlator\n                  with the sum of two auxiliary Green functions oriented in the opposite\n                  directions. These Green's functions, therefore, partition the\n                  diagram for a multi-point correlator in the distinct time\n                  zones. Making an arbitrary choice that the external legs of the\n                  diagram correspond to timet=0we have earlier times inside the\n                  diagram. In fact, we have telescopically nested time zones that flow\n                  from the earliest time zone to the present time zone. In our\n                  diagrams, we color the earliest time zone as red, the latter as\n                  green, and even the latter as blue. We color the latest time zone,\n                  if present, as magenta.  The number of nested time zones is equal to\n                  the number of interaction vertexes.  In some diagrams, the ordering\n                  of the zones is not uniquely defined by Green's functions. For such\n                  diagrams, as explained below and in figure captions, all possible\n                  ordering of time zones must be taken into account in calculating\n                  interaction-time integrals for the simultaneous correlators.\n                 \n                  As before we connect all three external wavy lags of the GFs by the\n                  black dotted line, denoting the present time-bordert_1=t_2=t_3=0.\n                  The times of three vertexes denoted asτ_1,τ_2andτ_3in FF:11(a), each of the belonging to a particular\n                  time-zone, colored in red, green, and blue.\n                \n                  All of these time zones belong to the past:τ_1<0,τ_2<0,\n                  andτ_3<0according to the causality principle: The present\n                  time depends only on the past time, and does not depend on the\n                  future.  Green's functions in this diagramG( k_4,τ_21),G( k_5,τ_23), andG( k_6,τ_31)(hereafterτ_ijτ̄_i-τ_j) prescribe chronological order of the\n                  time zones:τ_2<τ_3<τ_1<0Armed with this arrangement we can easily compute time integral in\n                FF:11(A1)IA1= ∫ _-∞^0 dτ_1 G( k_1,τ_1) ×∫ _-∞^τ_1 dτ_3 G(\n                k_3,τ_3)∫ _-∞^τ_3 dτ_2 G( k_2,τ_2)G(\n                k_4,τ_2-τ_1)G( k_5,τ_2-τ_3)G( k_6,τ_3-τ_1)written in thet-representation for the diagram FF:21(A1).\n                Most Greens functions, except forG( k_1,τ_1), cross borders\n                between time zones such that their fragments belong to different\n                zones.  Using the decomposition ruleG(τ)=G(τ-τ')G(τ')for the Greens function in the one-pole approximation,\n                GreenFunctionTimeRepresentation, we can present them as the\n                product of the Greens functions such that each of them belongs only to\n                the one-time zone. Namely:G( k_2,τ_2)= G( k_2,τ_23)G( k_2,τ_31)G(\n                k_2,τ_1),G( k_3,τ_3)= G( k_3,τ_31)G( k_3,τ_1),\n                andG( k_4,τ_21)= G( k_4,τ_23)G( k_2,τ_31) .\n                Now interaction-time integralIcan be factorized as follows:I =  ^3T_123  ^3T_245  ^4T_2346, where\n                  \n                    T_123 =∫ _-∞^0 dτ_1  G( k_1,τ_1)  G( k_2,τ_1) G( k_3,τ_1)  ,     ^3T_123 =∫ _-∞^0 dτ_23  G( k_2,τ_23)  G( k_4,τ_23) G( k_5,τ_23)\n                \n                are the triad interaction times, defined by I1alternative: T_ijk= 1 /  [γ_i +γ_j +γ_k  ]. We   introduce the quadric interaction time T_ijkl\n                    T_ijkl= ∫ _-∞^0 dτ  G( k_i,τ)  G( k_j,τ) G( k_k,τ) G( k_l,τ)     = 1 /  [γ_i +γ_j +γ_k +γ_l ] .\n                 \n                In our case,^4T_2346originates from theτ_31-integration\n                over the earlier time-border of the intermediate time-interval (filled\n                in FF:11a with green) with four Greens functions directed inside\n                of it. The oldest time interval with three incoming Greens functionG( k_2),G( k_4), andG( k_5)produce^3T_245, while\n                the earliest time interval gives T_123with wave-vectors of the\n                external legs.  Clearly, time integrals depend only on the diagram\n                topology and are independent of the particular type of the Greens\n                function: true or auxiliary. Therefore time integrals are the same for\n                the diagram in FF:11(b) and many others in FF:11.\n                Corresponding full analytical expressions for these diagrams can be\n                found in Appendix <ref>, see\n                36, BTriads,Ctriads.\n                \n                \n                \n                  §.§.§   Second-order diagrams  for  ^4F_123 II\n                \n                 We now consider diagrams for ^4F_1234II  shown in\n                  f:9(a,b). There are two vertices with times τ_1, belonging\n                  to the earliest red-filled time zone, and τ_2<τ_1 in the green\n                  zone. Time integration over the three Green's functions G_2,\n                  G_3, and G_5, entering red zone leads to a factor T_235,\n                  while  four Green's functions G_1, G_2, G_3, and G_4,\n                  entering green zone produce T_1234. \n                \n                 \n                \n                  Diagrams for the fourth-order contributions to ^4F_1234IV\n                  are more complicated. They include four vertices and require four\n                  integrations over τ_1, τ_2, τ_3, and τ_4\n                  with, generally speaking, more complicated topology of the time\n                  zones, not necessarily chronologically nested.  Therefore before\n                  presenting analytical expressions for their interaction times we\n                  present in the forthcoming ss:3 the diagrammatic rules on how\n                  to reconstruct these expressions from the topology of the diagrams\n                  without their explicit calculations.\n                \n                 \n                \n                 §.§ Diagrammatic rules for the reconstruction of interaction times from the topology of the time-zones \n                \n                \n                  \n                 Finding appropriating time zones that allow factorizing time\n                 integrals for the interaction times in diagrams for ^3F_123 and\n                 ^4F_123II described above together with more complicated\n                 situations in numerous diagrams for ^4F_123II, we came up\n                 with a set of rules of how to avoid explicit integrations over\n                 τ_1, τ_2, τ_3, and τ_4 in diagrams for\n                 ^4F_1234IV.  Diagrams for ^4F_1234 of any orders, as\n                   well as the diagrams for higher-order correlation function, can be\n                   divided into two major groups: weakly connected diagrams like those\n                   shown in f:9, <ref>, <ref>, <ref>, and\n                   compact diagrams in FF:17, <ref>, <ref>. Unlike\n                   compact diagrams, weakly connected diagrams can be divided into two\n                   parts by cutting just one line.  In the diagrammatic rules,\n                   formulated below, we will show how one can find all-time integrals\n                   in presented here two groups of four order diagrams in particular\n                 and in even higher order diagrams, in general, just by simple\n                 analysis of their topological structure.  The rules are as follows:\n                \n                  *  Partition the diagram to telescopically nested time zones as dictated by the \n                     Green's functions.\n                     \n                    Each time zone has its “own\" vertex inside it characterized by\n                      the vertex time τ_j. Therefore the number of time zones is\n                    equal to the number of interactive vertexes. Resulting time\n                    integrals will be a product of distinct time factors corresponding\n                    to each zone. Each time factor is an interaction time of the wave\n                    numbers of Green's functions entering the zone.\n                \n                  \n                  *  In most cases, like in diagrams FF:20(A1),\n                    <ref>(A1,C1), <ref>(A1), and in FF:18(A1), times\n                    of the vertices are fully ordered:\n                    τ_1<τ_2<τ_3 < τ_4 <0. In these cases, time zones are\n                    uniquely chronologically nested, having the earliest (red filled\n                    in our diagrams) time zone with τ_1, early (green colored)\n                    zone with τ_2>τ_1, and recent (blue colored) zone with\n                    τ_3 and, finally the very recent (magenta-colored) zone with\n                    τ_4.  According to rule 1 integration over these times gives\n                    the product of four interaction times, in a particular case of\n                    FF:20(A1) this is\n                    T_145T_1467T_13468T_1234. Here\n                    for concreteness, we colored interaction time according to the\n                    color of the corresponding time zone.\n                   \n                \n                  *  In all the cases considered above and in general, the earliest\n                  (red) zone has always three incoming Greens functions, producing\n                  triple interaction time, e.g. T_145, in\n                  FF:20(A1). The very recent zone in the triple correlator\n                  ^3 F_123 produces T_123 in the quadruple correlator\n                  ^4 F_1234 produces T_1234. Therefore the most recent\n                  interaction-time is of the same order as the correlator generating\n                  it with the same wave-vector arguments. This statement is true for\n                  any-order correlations.\n                   \n                \n                  *  it may happen that a number of time zones have the relationship\n                  between times that are not uniquely determined by the Green's\n                  functions. Then there are two possibilities\n                  \n                  *  Some diagrams may have two and more earliest time zone, like\n                    in FF:23(A1) and in FF:19(A1) with two earliest time\n                    zones with τ_1 and τ_1. In these cases,\n                    time-integral over all vertex times factorizes with the product of\n                    integrals over τ_1 and over τ_1 from minus\n                    infinity to zero, producing the product of two (or as many as the\n                    number of the earliest time-zones) triple interaction times.\n                    \n                 \n                    \n                  *  If Green's functions do not uniquely define the ordering of\n                      times corresponding to the vertexes, then the time zones are to\n                      be drawn separately for each possible ordering of interaction\n                      times.  For such a case the resulting analytical expression\n                      contains the  sum of corresponding interaction times, see\n                      e.g. diagrams in FF:17(B1) and FF:19(A1).  Note that\n                      such branching of regions of integrations may happen at any\n                      level except the earliest and the very recent time zones.\n                    \n                \n                To summarize, the time integral for the diagram withnvertices\n                equal to the product ofninteraction times, corresponding to all\n                uniquely defined time zones Greens functions entering them. If some\n                zones are only partially overlapping the frequency integral includes\n                the sum of their interaction times.\n                \n                \n                §  LL-TRIANGLE-RESUMMATION OF THE  TRIPLE-LINE REDUCIBLE TRIADS  \n                \n                \n                 §.§ LL-resummation of diagrams for triple correlators ^3F_123\n                 \n                 In this subsection, we will bring all the things we have considered\n                 together and introduce triangular-LL resummation of the triple\n                 correlator.\n                 Triple \n                 correlator is the main focus of this manuscript. It has three\n                 appearances, shown on FF:1basic: empty thin red triangle for\n                 first order contribution^3F I, empty thick red triangle for\n                 third order contribution^3FIIIand filled thick red triangle\n                 for the full correlator^3F.\n                 \n                 One of the main points of this paper may be recognized by comparing\n                 diagrams for^3F Ion FF:9 and for^3FIIIon\n                 FF:11.  Note that our definition of the correlator involves\n                 the permutation operator P_123, defined by F31,\n                 12.  First notice that the first and second lines of the\n                 FF:11 contain vertex marked by a red circle, and the Green's\n                 functions connected to this vertex form precisely the diagrams of the^3F Ishown at FF:9. This allows us to write the compact\n                 expression for^3FIII.\n                \n                  \n                 \n                    ^3  F_123III=    P∫d  k_4/(2π)^d  ^4T_2346 V_1:4,6×[ V_4;2,5F_2+V_2;4,5 F_4 ]   ^3F_356 I ,    k_5= k_4+  k_2 \n                                              and   k_6= k_4-  k_1 ,\n                 \n                                       expressed in the terms of the first-order correlator as it follows from first two diagrams in the last line in FF:11. This fact  has deep consequences  as we will see below. \n                \n                 \n                                       The permutation operator P_123acting on\n                                       the two diagrams of FF:11 produces six\n                                       diagrams. Those diagrams can be grouped into a\n                                       triad of diagrams that involves three vertices,\n                                       have rotationalC_3symmetry, and three tails\n                                       of Green's functions oriented chronologically\n                                       ordered inside of the triangle from the present\n                                       timet=0in the simultaneous correlator back\n                                       to all past timest_j< 0, as required by\n                                       casualty principle.  We will refer to this\n                                       object as a “third-order triad\" and depict it\n                                       by the thick red triangle.\n                \n                \n                \n                Notice that  the bare Greens and bare double correlation in the  Dyson-Wyld line resummation are called reducible fragments, which can be separated from the body of a diagram by cutting two lines. Baring this in mind we can  clarify   them as “double-line\" reducible diagrams.  \n                 Such a name immediately suggests the existence of “triple line reducible diagrams\". \n                Indeed, our triad diagrams\n                can be separated from  the body of a diagram by cutting three Green's functions entering this time zone.  We call  this object  “triple-line reducible triads\"  (ofC_3symmetrical groups of diagrams). Up to now, we met in FF:9 first-order triple-line reducible triads (with one vertex) and in FF:11 third-order triple-line reducible triads with three vertexes, shown, e.g. in FF:11(a) by a blue square.   \n                \n                \n                Let us again examine Panel (a) on FF:11. The red oldest time\n                zone has three incoming Green functions entering it with straight\n                lines. The red time zone is in turn inside the earlier, blue time zone\n                which has three straight line entering it. This is an example of the\n                telescoping triangular telescopically nested time-ordered reducible\n                triads. Higher-order diagrams for the simultaneous triple correlator\n                there will have multiple zones nested in this manner. These zones will\n                sum up the fully dressed triple correlator.\n                \n                 Indeed, analysis of the higher-order diagram for^3 Fshows that besides two\n                first-order triads in the last line of FF:11 (thin red\n                triangles) one finds diagrams in which instead of the first-order\n                triads one meets third-order triads (thick red triangles). These\n                diagrams represent five-order triads, which in its turn can be found\n                in the even higher diagrams, etc. This possibility originates first\n                from the fact that perturbation diagrammatic series involves  all\n                topologically possible diagrams, and second because all diagrammatic\n                rules, including1/N-symmetry rules and time-integration rules,  are applicable not only to\n                the whole diagrams but also to any of their fragments.   Therefore there is a mechanism  for the infinite resuming of telescopically nested,\n                chronologically-ordered three-line reducible triads, appearing on the place of the earliest time zones resulting in the    fully dressed\n                  triple correlator^3 F_123.\n                \n                 The Dyson line resummation leads to a fully dressed Green's function. The Wyld\n                resummation leads to the fully dressed double correlator. The LL-triangular resummation of the three-line reducible triads suggested here leads to a fully dressed simultaneous triple correlator,  as we will show in ss:full. \n                \n                \n                \n                \n                 §.§ LL-resummation of diagrams for quadruple correlators ^4F_1234\n                \n                \n                  §.§.§ Identifying   ^3F  I triad in diagrams for ^4F II\n                 \n                  Analyzing the second-order diagrams^2 A_1,234and^2 B_12,34for^4 F_1234, shown in\n                  FF:3(b,c) we, as before, replace, the (three) double\n                  correlators by a sum of two auxiliary Green's functions according to\n                  OnePole, In this way each of the diagrams produces2^3diagrams. Out of those2× 2^3=16diagrams only three of them, shown in\n                  f:9(a,b) survive for the same-time case after frequency\n                  integration required by TOc.  Note that the diagram\n                  f:9(b) appears  twice in different orientations. This\n                  removes the factor1/2in front of it. The disappearance of  the1/2factor occurs as a manifestation of the1/N-symmetry rule because the diagram in f:9(b) lost reflecting symmetry with respect to the vertical line, present (together with prefactor1/2) in the diagram depicted in FF:3(c).\n                  \n                \n                Analytically diagrams in f:9 can be written as^4  F_1234II=1234 P [  ^2  A\n                _1,234 + ^2B_12,34],  where\n                 \n                    ^2 A _1,234\n                      = 1/2   V_1;4,5 V_523  F_2  F_3  F_4 T , \n                         ^2  B_12,34 =  F _3 F _4 F _ 1+4\n                      V_135 V_235T  ,    T  T_1234    T_235 ,\n                  \n                with   _5=  _1+_4 =-(_2+_3).  The time\n                integral T here was found with the help of\n                diagrammatic rules, formulated in ss:3.  It\n                reduces to a product of the triad  and quartic\n                interaction times.  Together with diagrams in \n                FF:9(e,f,g) this allows us to recognize \n                that the sum diagrams f:9(b,c) include the\n                correlator ^3F_235 I, shown in\n                f:9(d) as red empty thin triangle.\n                Analytically this reads:\n                \n                    ^4  F_1234II= 3   T_1234(V_1,45 F_4 )     ^ F I_235 .\n                 \n                We see that the first contribution of^4  F_1234IIto the\n                four-point correlator contains the first contribution ^3 F I_235to the three-point correlator. We will show below\n                that this statement generalizes to higher orders as follows: the(n+1)order of^4  F_1234 ^n+1involven-order\n                contribution of ^3 F^n.  Consequently, the fully dressed\n                fourth-order correlator depends on the fully dressed third-order\n                correlator. This is the essence of the LL-resummation and it\n                underlines the key role played by the third-order correlator.\n                 \n                \n                  §.§.§ \n                     Identifying  ^3F I and  ^3F III   triads  in the weakly connected spine diagrams  for ^4F IV.\n                 \n                     Recall that diagrams in f:9(a) and (b) are weakly connected in the sense that they can be divided into two parts by cutting only  \n                    one  line, sometimes  referred\n                     to as “spine\".  Using diagrammatic rules for^4F^(4)_1234formulated in ss:hight we found all  the   weakly\n                     connected spine  diagrams  shown  in Figures <ref>, <ref>, and\n                     <ref>. We divide the diagrams into these three figures by the position\n                     of the earliest (red) time zone relative to the spineG_5. \n                      Figure <ref> shows 18 diagrams with the earliest time-zone to the\n                      right of the Green functionG_5in the (678)-triangle, FF:20\n                      includes 10 diagrams with the (145)-time zone to the left ofG_5, while  \n                      FF:23 involves six diagrams with two earliest time  on either side ofG_5.\n                  \n                The diagrams of Figures <ref>,<ref> and\n                     <ref> are grouped  in such a  way that the triple correlator^3 F Iis identifiable in each line of the Figure. Namely, each line\n                     contains equivalent diagrams except the position of the true\n                     of Green's function entering the earliest time zone. Consequently, each line sums\n                     up to the diagram in the right column containing the third order correlator in the third order^3FIIIshown\n                     as a thin red triangle.  \n                     \n                   Consider the first diagrams in FF:21. \n                     The six resulting diagrams  on the right of the Figure  \n                     have the same structure: the part with  the block ofG_1G_4 V_1,45connected by leg 5 to one of the three leg (1̃,2̃, and3̃) of the structures in which we recognize one of the two diagrams for^ 3FIII, shown FF:11(b,c).  Namely diagram FF:21(A) is identical to the result of connection of theG_1G_4 V_1,45block to the leg2̃) diagram FF:11(b), diagram FF:21(B) is identical to its connection to the leg2̃of FF:11(c) , etc.   We denote this correspondence as FF:11(b2)⇒FF:21(A), FF:11(c2)⇒FF:21(B). In these notations we see that  FF:11(b1)⇒FF:21(C), FF:11(b3)⇒FF:21(D),  FF:11(c1)⇒FF:21(E), and  FF:11(c3)⇒FF:21(F).  Therefore  the sum of all diagrams in FF:21 for the^4FIV(denoted as^4,αFIV _1234) can be presented via^3FIII, very similar to 26. \n                 \n                 \n                 \n                 \n                 \n                 \n                    ^4,α   F_1234IV   = 3   T_1234(V_1,45 F_4 )     ^3 FIII_235 .\n                \n                 Comparing 26 and (<ref>) we  see that  i)  The  fourth-order correlator ^4  F_1234 ^n+1 of any order always includes quadruple interaction time, T_1234, originated from integration in the latest time-zone with four external legs of the Green function G_1G_2G_3G_4; ii)  the earliest time zone,  (235) in this case,  denotes the place where the triple correlator appears after the LL-resummation.  \n                 \n                Considering diagrams with the earliest (145) time zone in FF:20 we see five lines of diagrams (A), (B), (C), (D), and (E) have same structure, summarized to the triple correlator ^3F I_145 times three point objects, denoted as X A, X B, X C, X D, and X E. \n                Their sum is:\n                \n                    ^4,β   F_1234IV   =  3   T_1234  ^3 FI_145 [  X A_5,23+X B_5,23+X C_5,23+X D_5,23+X E_5,23 ] ,    k_5= k_1+ k_4 , \n                    \n                        X A_5,23   =  V_5,67 V_6;2,8  V_8,3,7F_3 F_4  ,     X B _5,23 =  V_7;5,6 V_2; 6,8  V_8,3,7F_3 F_6  ,  … .\n                Equations for the rest of the terms in the RHS of 4Fb can be easily reconstructed from their diagrammatic representation in FF:20.\n                \n                The last group of the  weakly-connected spine  diagrams with two earliest time zones is shown in\n                FF:23.  These diagrams sum\n                up  into one diagram with the product of two triple correlators  shown in  on the\n                FF:23(C3).   The corresponding analytical expression is \n                \n                    ^4,γ   F_1234IV  = 9  T_1234 ^3 F I _145∫d  k_6/(2π)^dT_13468 ^3 F I _378 V_2,68V_6,57 .\n                \n                Remarkably, this contribution is proportional to the  square\n                of the triple correlator^3 F I.\n                 \n                \n                \n                 \n                \n                  §.§.§  Identifying  ^3F I   in the compact square diagrams for ^4F IV\n                  \n                 As seen in FF:5 there are eight  compact  “square\" diagrams for the\n                 quadruple correlator^4FIVdepicted in FF:5.\n                 Consequently, they produce8· 2^4=128child diagrams but only\n                  22  of them, shown in FF:12 and <ref>, contribute\n                 to the simultaneous correlator.   Similar to the previous subsection, \n                 here  we show how\n                 all of them can be grouped in triads, each\n                 of which represents the  triple correlator^3F I.  We\n                   identify the  triads of  \n                 diagrams such  that  all elements \n                   in the diagrams in each triad are identical, except one vertex, where \n                 the “true” Green's function\n                 occupies each of the three positions in turns, and the other two\n                 positions are occupied by auxiliary Green's functions. \n                \n                First of all, we separate all diagrams into two groups with one earliest time zone, shown in FF:17 and <ref>, and two two\n                earliest time zones, shown in FF:19.\n                \n                The biggest group with one such zone will be  further  divided \n                into several topologically different sub-groups as follows.  \n                 Since the diagrams are under the permutation operator, we \n                redraw the diagrams  (by rotations or by mirroring)  in such a way \n                that the earliest time zone will be placed in the upper right corner of\n                the diagram.  We then label  all lines as shown\n                e.g. in FF:17(A1).\n                \n                 We classify the diagrams by the number of external true Green's functions,\n                labeled by 1,2,3 and 4. We call the diagrams to be \"Green's function identical\" if  their external Green's functions are identical. This set of lines does not include 2, 5 which connect\n                to the earliest time zone.  We remind   that  all vertexes\n                must be connected to one of the external true GFs by the true GFs with\n                the same orientations.\n                 \n                In a one-GF subgroup of the diagrams, there are two options: with G_1\n                and with G_2.  and G_3. G_3 subgroup is not new: it coincide\n                with G_1-diagram by mirroring in 2-4 line which connect G_2 and\n                G_4.\n                \n                Consider the first G_1 subgroup. From general requirements their topology\n                must include G_7 and G_8 true GFs which connect 3- and 4-vertices\n                to 1-vertex with true GF G_1. This subgroup has only three diagrams,\n                shown in FF:17(A1, A2, A3).  \n                 These three diagrams form the first triad which sum up to the  \n                diagram \n                  FF:17(A) which involves triple correlator\n                ^3F^(1)_256.\n                 \n                Next G_2 subgroup must include G_7 and G_8 true Green's functions  which\n                connect 3- and 4-vertices to 1-vertex with true Green's function  G_2. This subgroup\n                also has only two diagrams, shown in  FF:17B1, B2), \n                 forming the triad that sums up to the  diagram  (<ref>)(B) which\n                involve triple correlator.\n                 \n                There are nine diagrams with two true Green's functions  labeled 1, 3, and 4. The first\n                six diagrams involve G_1 and G_2. Three of them, collected in (C1),\n                (C2) and (C3) panels, have auxiliary GF G_8, oriented down by\n                a straight line. They are summarized in a diagram \n                  FF:17(C) which involves the same triple correlator\n                ^3F^(1)_256.  The  Rest three diagrams with auxiliary Green's functions  G_8,\n                oriented up, are summarized in the diagram \n                  FF:17)(D).  Last two-GF triad with G_1 and G_3 creates\n                diagram in (<ref>)(E) with the same triple\n                correlator ^3F^(1)_256.\n                 \n                Three GF subgroup with G_1, G_2 and G_3 are shown in\n                FF:18. They create two subgroups with G_8 oriented up and\n                down. The first triad creates a diagram in FF:18(A).  Considering\n                the diagram in FF:18(B1) as two ones (with prefactor 1/2) and\n                rotating one of them around 2–4 lines we have a second trial that\n                creates diagram FF:18(B).\n                \n                 \n                \n                  \n                \n                 \n                Analytical expressions for ^4δFIV_1234, originated from\n                diagrams X_1,X_2,… X_7 depicted in FF:17 and <ref>\n                are as follows:\n                \n                    ^4δFIV _1234   =  T_12341234 P{∫d  k_5/(2π)^d   \n                          ^3F^(1)_256   J _1234^□} , \n                         k_6  = k_2 +  k_5, ,    \n                     J_1234^□  = ∑_i=1^7 X_i ,  \n                      \n                            J_1234^(X_1)   =  6   T_2357T_23458V_1; 5 8V_7; 3 6V_8,47F_3 F_4 , \n                        J _1234^(X_2)= 3   (T_2357+T_1268)T_12378V_8; 1 5V_7;6,3 V_4; 7,8F_1 F_3 ,  \n                     \n                        J _1234^(X_3)   =  6   T_2357T_23458       V_1; 5, 8V_7; 3,6V_4; 7,8F_3 F_8 ,   \n                        J _1234^(X_4)= 6   T_2357T_23458V_1; 5, 8V_7; 3, 6V_4; 7,8F_3 F_8 ,  \n                     \n                        J _1234^(X_5)   =  6   T_2357T_23458V_1; 5, 8V_7; 3, 6V_8; 4, 7F_4 F_7 ,   \n                    J _1234^(X_6)= 6   T_2357T_23458V_1; 5, 8V_3, 6 7V_4; 7,8F_7 F_8 ,  \n                     \n                    J _1234^(X_7)   = 6   T_2357T_23458V_1; 5, 8V_3; 6, 7V_4; 7,8F_7 F_8 .\n                \n                 The second group of diagrams with two earlier time zones consists\n                 only from four diagrams.  As shown in FF:19 we   used the   diagram\n                 ^4C(VII)   in  two panels (A3) and (B1) putting\n                 prefactor 1/2 in front of them.  After that diagrams (A1), (A2)\n                 and (A3)   are  summed to diagram (A) and diagrams (B1) and (B2) – to\n                 diagram (B). In its turn, diagrams (A) and (B) can be summed to\n                 diagram (C) which involves two triple correlators\n                 ^3F(I)_256 and ^3F(I)_478. An analytical\n                 expression for the sum of all diagrams with two earliest time zones\n                 is as follows:\n                 \t\n                    ^4εFIV _1234 =     T_12341234 P{∫d  k_5/(2π)^d   ^3F I _256    ^3F I _478× (T_23458+T_12467 )   V_1:5,8V_3:6,7} .\n                Similar to 4Fc here  the\n                contribution to the fourth-order-four-point correlator comes from the product of two three-point correlator of the first order ^3F_123 I.  Analysing the structure of the diagrammatic technique we expect that in the higher-order diagrams  terms with a product of three and more correlators  ^3F_123 I will appear.  \n                \n                 §.§ Full LL-resummations for ^3F_123 and ^4F_1234\n                \n                \n                  \n                \n                In the previous sections, we demonstrate how the sum of six initial\n                diagrams for ^3F_123III   presented FF:11 fuses into\n                two diagrams in FF:11(b,c) involving ^3F I. Similarly, the\n                sum of two diagrams for ^4F_1234II in f:9 combines to\n                one diagram f:9(d) with ^3F  I. Moreover, the sum of\n                eighteen diagrams for ^4F_1234IV in FF:21 combines\n                into six diagrams, involving ^3FI which, in its turn fuse into\n                just to one diagram with ^3F III, analytically presented by\n                27. In exactly the same way, all the rest of the diagrams for\n                ^4F_1234IV, shown in FF:20, <ref>, <ref>,\n                <ref>, and in FF:19 was summarised in these figures to\n                diagrams, involving the triple correlator ^3F I.  These findings\n                are not a miracle, but the deep consequence of fundamental features of\n                the perturbation approach reflected in the diagrammatic technique and\n                the crucial role that is played by the three point correlator.\n                \n                Namely, the diagrammatic series involves all topologically possible\n                diagrams, satisfying general restrictions, described in\n                ss:hight.  These restrictions together with the 1/N-rule,\n                prescribing numerical prefactor have local character, i.e. they are\n                applicable to the entire diagram, or to any of their fragment. For\n                example, any diagram for ^3F_123 has three external Greens\n                functions G_1, G_2, and G_3 entering the diagram by straight\n                lines.  Similarly, any earliest time zone also has three “boundary\"\n                Greens functions, say G_k, G_l, and G_m entering the zone in the\n                same way. Therefore the sum of all diagrams inside of the earliest\n                time zone of (2n+1)-order [with (2n+1) vertices] gives exactly the\n                triple correlator of (2n+1)-order, ^3F^n+1_klm. This is what\n                exactly happened in all diagrams with the first-order earliest time\n                zones (colored in red), summarised to ^3F I, while the diagrams\n                FF:21 with the third-order earliest time zones, (colored in\n                blue) were summarised to ^3FIII.\n                 \n                 Consider first full LL-resummation for the triple correlator\n                 ^3F_123.  Panel (A1) in f:8 just reminds diagram in\n                 FF:9(b) for ^3F I_123, while f:8(A2) shows\n                 resummations diagrams for ^3FIII_123 with the result\n                 ^3 FIII_123∝ ^3 FI_123, as indicated by\n                 3F3. The next step is shown in f:8(B). Here\n                 ^3FV_123, shown as thick red-hatched triangle is\n                 proportional in the same manner to ^3 FIII_123. We can\n                 continue this iteration  ab infiniti, see the result in\n                 f:8(C3). Clearly, this procedure does not create high-order\n                 diagrams for ^3 FIII_123 of a more complicated topological\n                 structure.  These diagrams are replaced by “…\" in line (C) of\n                 f:8, which presents the entire series for\n                 ^3F =  ^3FI_123+  ^3FIII_123+ ^3!FV_123+….  Analytically we have\n                 \n                    ^3F_123  =\n                      ^3  F_123^(1) +  6 123  P∫d  k_4/(2π)^dT_2346 V_1:4,6×[ V_4;2,5F_2+V_2;4,5 F_4 ]   ^3F_356 + … .\n                \n                  This equation represents the essence of LL-triad resummation for the fully-dressed  triple correlator ^3F_123, as it\n                    represents ^3F_123 \n                    through the infinite series that involves again ^3F_123.   If one neglects higher-order contributions replaced in 28 by dots,   then this equation becomes  closed equation for ^3F_123. Clearly, this procedure is an      uncontrolled approximation. Currently, this equation looks\n                linear since the higher-order terms are represented as\n                    dots “…\". Analyzing  higher-order contributions  we found diagrams with \n                two, three, and more  earliest time zones, giving birth to   contributions to 28 proportional to (^3F) ^2, (^3F)^3,\n                etc. \n                  \n                 \n                \n                 The diagrams for the four-point simultaneous correlator ^4!F_1234 can also be LL-resumed. This is shown in F:30. We denote  ^4F_1234 as a red thick-filled square. The simplest diagram,  in Panel (A1), originates from the infinite resummation of the diagram for ^4F_1234II in f:9(d), where the   ^3F I is summed up to the  full correlator. Graphically this part of the LL resummation is depicted by replacing the this triangular by thick filled triangular. The LL resummation includes all diagrams in FF:21. Four lines of diagrams in FF:20 (after inversion over spine Greens function G_5) serve as the first terms of the triangular LL resummation that leads to diagrams in F:30(A2,A3,A4,A5). In the same way diagrams in FF:23 produce diagram F:30(A6), proportional to (^3F)^2, compact square diagrams in FF:17 and  <ref> gives after resummation diagrams in F:30(B1,B2). Remarkably, compact square diagrams in FF:19 with two earliest time-zones create diagram in \n                 F:30(B3). This diagram is proportional to the  square of (^3F)^2. Higher order terms, represented by dots, can also be  LL re-summed. \n                \n                \n                \n                \n                 \n                  Analytical expressions for various contributions to ^4F_1234, denoted as  ^4F_1234A1, …^4F_1234A6, ^4F_1234B1, ^4F_1234B2, and ^4F_1234B3 can be straightforward reconstructed from the corresponding diagrams. below we will present a few examples: \n                 \n                    ^4F_1234A1=    3  ^3F_235 F_4 V_145  ,    ^4F_1234A2=\n                     3  ^3F_235 F_4 ∫d  k_6/(2π)^2V _168V_657V_847F_7 , …  ^4F_1234A6=\n                     9   ^3F_235∫d  k_6/(2π)^2V _168V_657  ^3F_235 , \n                     \n                     ^4F_1234B1=    6  F_3 F_4   ∫d  k_5/(2π)^2V _156V_847V_673  ^3F_256 , …    ^4F_1234B3=\n                     3/2∫d  k_5/(2π)^2V _158V_367 ^3F_256 ^3F_478 .\n                \n                 These equations  present fully dressed quadruple correlator  ^4F_1234  as a series in powers of fully dressed triple correlator ^3F, explicitly involving linear and quadratic contributions. Some diagrams with five and more vertices will give contributions of third, fourth, and higher powers of ^3F. \n                  \n                \n                 \n                \n                \n                \n                § SUMMARY\n                \n                \n                 In  this  paper we  presented  detailed analyses of the\n                    three-point and four-point velocity correlation functions in\n                    leading and next order. That corresponds to the first and third orders\n                    in the interaction amplitude for the triple correlator and to\n                    second and fourth order for the four-point correlator. We used the\n                    Dyson-Wyld diagrammatic technique   and we performed  the following steps:\n                ∙ We showed how to build diagrammatic series for the\n                    complex amplitude of strongly\n                    interacting fields. \n                ∙ We have shown how to plot diagrammatic series for the\n                    three-point, four-point, and higher order correlation function in\n                    the velocity. This is achieved by averaging over an ensemble of\n                    random force, or  gluing together diagrammatic trees.  In\n                    doing so we have demonstrated constructively the natural emergence\n                    of the 1/N symmetry rule, which prescribes the\n                      numerical prefactor of a diagram. Emergence of this rule is the\n                    result of the symmetry of the interaction matrix element\n                    V^k_12, the choice of 1/2 factor in ME and\n                    definition of the correlation functions\n                    (<ref>) and F4a.\n                ∙ We then considered  simultaneous velocity\n                    correlators. In doing so, we need to perform the integration over\n                    all possible frequencies of multiple time correlators. To achieve\n                    this goal, it is imperative to know the frequency dependence of\n                    the double correlator and Green's function.  We have assumed \n                      one-pole approximation for the frequency dependence of the\n                    double correlator and Green's function. This assumption led to the\n                    decoupling of all the double correlators into the sum of two\n                    auxiliary Green's functions pointed in different directions.\n                    This, in turn, allowed us to formulate time-integration\n                    rules by introducing time zones and time boundaries. These rules allow one to reconstruct the time integrals from the topology of the diagrams without explicit calculations of the high-order time integrals. \n                ∙ We then considered in detail the simultaneous triple\n                    correlator of the velocity in the first and third order in the\n                    interaction vertex. We have shown how the diagrams can be grouped\n                    into triads, thus leading to the triple correlator.  This grouping\n                    allowed us to formulate the LL-resummation. The LL-resummation\n                    does for triple-reducible diagram what Dyson-Wyld ressumation does\n                    for double-reducible diagrams. Namely, the LL resummation replaces\n                    the bare triple correlator by its\n                    “dressed” counterpart.\n                ∙ We considered a four-point correlator in second and\n                    fourth order. We showed that the LL-resummation is equally\n                    applicable to four-point simultaneous correlators. We did it by\n                    identifying a third-order simultaneous velocity correlator in the\n                    diagrammatic series for four-point correlators. We did it\n                    constructively for\n                    second-order and fourth-order diagrams. \n                ∙ Analysing the structure of the diagrammatic technique we\n                    show that this pattern continues for all correlators for any order\n                    in the perturbation theory. Namely, all the diagrams can be\n                    grouped together in triple-reducible diagrams, that is the groups\n                    where the diagrams are equivalent except for one vortex where\n                    Green's function is rotated. These groups can be resumed to\n                    become third-order simultaneous correlators.\n                ∙ We demonstrated how the triple correlation function, and\n                    thus energy flux over scales ε( k) governs not\n                    only energy distribution over scales in the developed hydrodynamic\n                    turbulence, but also the rest of its higher-order statistics,\n                    including high-order correlation functions and their cumulants\n                    ^n F. After the suggested triangle-resummation of the\n                    triple-reducible diagrams, it becomes clear that all of them can\n                    be represented as a sum of the triple correlation\n                    function ^3  F∝(k).\n                ∙ As explained in <cit.>, the turbulence inverse\n                    energy cascade coincide with the thermodynamical equilibrium for\n                    the fractional dimensions of d=4/3.  Therefore  it is exactly\n                    Gaussian. The difference between 4/3 and d=2 is a small\n                    parameter ϵ=d-4/3 = 2/3.  The last observation\n                    explains therefore why the 2D turbulence is close to Gaussian\n                    state.  The ^3 F^I_123∝ϵ, and LL-resummation\n                    28 shows that the full correlator ^3F_123 is also\n                    small. If ^3F_123 is small, then the Figure <ref>\n                    explains why the fourth order cumulant is also small.  In this\n                    way, in 2D turbulence, cumulants ^n F become presented as a\n                    series in powers of the small parameter\n                    ϵ=d-4/3 = 2/3, demonstrating the closeness of the\n                    2D statistics to the Gaussian case.\n                 \n                \n                               \n                \n                Note also that the LL resummation of the triads is possible only for\n                the one-time correlators, otherwise, for example, diagrams, shown in\n                FF:9(b), (c), and (d) have to be accounted for. From a\n                theoretical viewpoint, this is the consequence of the fact that in the\n                thermodynamic equilibrium, the only simultaneous statistics are\n                Gaussian (with vanishing all cumulants of the correlation functions).\n                \n                \n                               We hope that this paper provides solid theoretical\n                               foundation for the further analytical study of the statistics of highly developed 2D and 3D hydrodynamic turbulence.\n                                 \n                 \n                   \n                   unsrt10Frisch1995\n                Uriel Frisch.\n                 Turbulence: The Legacy of A. N. Kolmogorov.\n                 Cambridge University Press, 1995.\n                \n                Wyld1961\n                H.D. Wyld.\n                 Formulation of the theory of turbulence in an incompressible fluid.\n                 Annals of Physics, 14:143–165, 1961.\n                \n                Kraichnan1980\n                Robert Kraichnan and D. Montgometry.\n                Two-dimensional turbulence.\n                 Rep. Prog. Phys., 43:547, 1980.\n                \n                Tabeling2002\n                Patrick Tabeling.\n                Two-dimensional turbulence: a physicist approach.\n                 Physics Reports, 362:1–62, 2002.\n                \n                Boffeta2000\n                G. Boffeta, A. Celani, and M. Vergassola.\n                Inverse energy cascade in two-dimensional turbulence: Deviations\n                  from Gaussian behavior.\n                 Phys. Rev. E, 61:R29, 2000.\n                \n                Boffeta2012\n                Guido Boffetta and Robert E. Ecke.\n                 Two-dimensional turbulence.\n                 Annual Review of Fluid Mechanics, 44(1):427–451, 2012.\n                \n                Lvov2002b\n                Victor S. L'vov, Anna Pomyalov, and Itamar Procaccia.\n                Quasi-Gaussian statistics of hydrodynamic turbulence in 4/3+\n                  ε dimensions.\n                 Physical Review Letters, 89(6):64501, 2002.\n                \n                Martin1973\n                P. C. Martin, E. D. Siggia, and H. A. Rose.\n                 Statistical dynamics of classical systems.\n                 Phys. Rev. A, 8:423–437, Jul 1973.\n                \n                Zakharov1975b\n                V.E. Zakharov and Victor S. L'vov.\n                Statistical description of nonlinear wave fields.\n                 Radiophysics and Quantum Electronics, 18(10):1084–1097, 1975.\n                \n                Lvov1995d\n                Victor S. L'vov and Itamar Procaccia.\n                Exact resummations in the theory of hydrodynamic turbulence: 0.\n                  Line-resummed diagrammatic perturbation approach.\n                 Arxiv preprint chao-dyn/9502010, 52(4):3840, 1995.\n                \n                Zakharov1975\n                V.E. Zakharov, Victor S. L'vov, and SS Starobinets.\n                Spin-wave turbulence beyond the parametric excitation threshold.\n                 Soviet Physics Uspekhi, 17(6):896, 1975.\n                \n                Zakharov1972b\n                V.E. Zakharov, Victor S. L'vov, and SL Musher.\n                TRANSIENT BEHAVIOR OF A SYSTEM OF PARAMETRICALLY EXCITED SPIN\n                  WAVES.\n                 SOVIET PHYSICS-SOLID STATE, 14(3):1–6, 1972.\n                \n                Lvov2000a\n                Victor S. L'vov, Y.V. L'vov, and Anna Pomyalov.\n                Anisotropic spectra of acoustic turbulence.\n                 Physical Review E, 61(3):2586, 2000.\n                \n                \n                \n                § APPENDIX\n                \n                \n                 §.§ Averaging products of trees\n                \n                Here we perform in details gluing of the rest of the\n                trees into diagrammatic series for correlation function. The gluing steps may be avoided alltogether. We present them here for references and\n                to show how the Symmetry 1/N rule appears.\n                \n                \n                   \n                \n                  §.§.§ Three Point Correlators \n                   Third Order\n                   \n                 \n                   In this\n                 subsection we compute the three-point correlation function in the\n                 third order in the interaction vertex. This object is obtained by\n                 gluing together three trees and averaging over the ensemble of random\n                 force. The advantage of the diagrammatic technique is that the gluing, again, can be ommitted alltogether, and the\n                 diagrams for these three-point third order in the vertices can be\n                 drawn from scratch by exhausting all possible topologies consistent with the diagrammatic rules. We present the details of the calculations here\n                 to illustrate constructively the mechanism of appearance of the\n                 symmetry 1/N rule.\n                   \n                   The terms\n                      \n                    -.4cm (2π)^d+1δ^d+1_123  ^3  F_123^(3)=\n                       ^3  F_123^(3) ,    F_123^(3)=\n                       ^3a A_1,23+ ^3b A_1,23 + ^3 B_12,3 + ^3 C_123 , \n                          ^3a\n                           A_1,23=  ^3aa_1 a_2 a_3 /2 ,\n                        ^3b A_1,23= ^3ba_1 a_2   a_3/2    ^3 B_12,3= a_1^2 a_2^1 a_3  ,  ^3 \n                           C_123= 1/3! a_1^ 1 a_2^ 1 a_3^ 1  ,\n                \n                with one (^3a A_1,23 and ^3b A_1,23),\n                two (^3 B_12,3), and three (^3 C_123)  external G-legs respectively.  Resulting diagrams are shown in FF:4. For\n                consistency with previous notation, we denote by ^3 A\n                third-order three-point correlators with one external Green function,\n                by ^3  B third order correlators with two external Green\n                functions.  Consistently with previous definitions of A- and B-terms we use notation ^n  C_123, … for all diagrams\n                of nth order in vertexes V with three G-legs G_1,\n                G_2 and G_3 and any number of wavy tails denoting F_j.\n                \n                 \n                We now consider each of these terms separately, one by one.\n                 \n                \n                  \n                *1.^3a A-terms.  The   ^3a A_1,23 term after substitution of 3aA2 for ^3aa_1 can be presented as\n                \n                    ^3a A_1,23  = G_1  G_… ^2V^3_…/4  (a _4  a _5a _6  a _7)_1   (a _2 a _3)_2   .\n                \n                 We now construct double correlators by pairing the fields (wavy\n                 lines).  To get an irreducible contribution we pair [(\n                   7(2,3)_2] (two options), then [(\n                   3(5,6)_2] (two options) and finally 46 (one option).  The resulting diagram is\n                 shown in FF:4(a) and corresponding analytical expression is\n                 \n                    ^3a A_1,23   =    G_1    F_2  F_3 ∫d _4/(2π)^d+1  V_1; 4,1+4V_4;4-2,2 V_2-4;3,1+4× G_4^*  G_2-4 F_1+4  .\n                \n                \n                  \n                * 2.^3b A-terms. The   ^3b A_1,23 term after substitution of 3bA2 for ^3ba_1 can be presented as\n                \t\n                    ^3b A_1,23 = G_1  G_…\n                                  ^2V^3_…/16 (a _4 a _5a _6 a _7)_1\n                              (a _2 a _3)_2  .\n                \n                However, due to the different topology of the tree for ^3ba_q we should\n                pair fields differently. For example, as follows:\n                [(4,5,6,7)2] (four options), next\n                [(5,6)3] (two options) and finally\n                45] (one option). The resulting analytical\n                  expression is given by\n                    ^3b A_1,23   =   1/2 G_1   F_2  F_3\n                                                 ∫d _4/(2π)^d+1 G^*_4  F_2-4 G_1+4× V_1;4,1+4\n                      V_4;4-2,2 V_4+1;3,2-4 ,\n                 \n                as shown diagrammatically in  FF:4(b).\n                \n                \n                  \n                * 3. ^3 B-terms. The ^3  B_12,3 term after\n                substitution of 1A2 for ^1a_1 and 2A2 for ^2a_1\n                can be presented as\n                \n                    ^3  B_12,3 = G_1 V_…\n                          G_2G_…V^2_…/2^2 (a _4 a _5)_1(\n                        (a _6 a _7a _8)_2 ) a _3 .\n                \n                To get an irreducible contribution we  should pair  for example  [\n                  6(4,5)] (two options), next [\n                  3(6,7)] (two options) and finally\n                75] (one option).  As the result, we have 4\n                  equivalents contribution to ^3  B_12,3 that attain the\n                  following analytical form:\n                \n                    ^3   B_12,3   = G_1  G_2    F_3\n                      ∫   d_4/(2π)^d+1 F_4  F_4-2 G_1+4×\n                                                           V_1;4,1+4V_2;4,4-2V_4+1;3,2-4 ,\n                 \n                as shown in FF:4(c). \n                \n                \n                  \n                * 4.^3  C-terms. The  ^3   C_123 term  can be presented as \n                \t\n                    ^3  C_123 =( G_1  G_2  G_3 V^3_…)/2^3\n                              · 3!(a _4 a _5)_1 (a _6 a _7)_2 (a _8 a _9)_3\n                             .\n                \n                 Pairing, for example as follows: [ 4(9,6,7,8)]\n                 (four options), [(5, 6(7,8)] (two options) and\n                 [ 58] (one options) we have 8 equal terms. The\n                 resulting diagram is FF:4b with the following analytical\n                 expression \n                 \n                    ^3  C_123   =    1/6 G_1  G_2  G_3\n                       ∫d_4/(2π)^d+1 F_4 \n                         F_4-2 F_1+4× V_1;4,\n                                                              1+4 V_2;4,4-2V_3;1+4,2-4 .\n                 \n                 Equations (<ref>,<ref>,<ref>,<ref>,<ref>)  are presented in 16 in the \n                 main text of the paper.\n                 \n                 \n                \n                  §.§.§ Four Point Correlator leading terms\n                  \n                \n                \n                Here we show how to glue four trees together to form\n                the diagrammatic series for the four-point correlator in the second order in the interaction \n                vertex. These steps are performed here in details to demonstrate explicitly how the diagrammatic series for correlation function appear and why they have the factor according to the  1/N-symmetry rule.\n                 These steps are equivalent to those described in the section (<ref>) and may be omitted altogether by \n                drawing the diagrams from scratch for the correlation functions as explained in the section\n                (<ref>.\n                \n                Consider first the expression for ^2\n                    B_12,34. Substituting expressions for ^1 a_1 and\n                ^1 a_2 from 1A2 and 2A2 we obtain\n                \n                ^2 B_12,34=1/16 G_1  G_2 V_1,56 V_2,78 ( a_5 a_6 )_1  (a_7 a_8 )_2 (  a_3a_4 )_3 .\n                  \n                \n                Here and below subscripts _1 and _2 identify the tree from\n                which the analytical structure with the subscript appeared. Pairing\n                fields in each (…)_j group leads to uncoupled\n                contribution. There are four equivalent ways to pair [\n                    4( 5,6,7,8)], two ways to pair\n                [3(7,8)] and one way to pair 68.  The result, diagrammatically shown in FF:3(c),\n                has corresponding analytical expression\n                    ^2 B_12,34 = 1/2  G_1  G_2   F_3  F_4  F_5\n                         V_135\n                      V_235 .\n                \n                 Here _5 = (_1 + _4).\n                 \n                 Next, substituting ^2a_ from 2A2 in \n                 F4b we get\n                \n                \n                    ^2 A_1,234   =    ( G V) /2· 3!  (a _5  a _6  a _9)_1 (a _2  a _3  a _4 )_2  .\n                 \n                \n                Required irreducible diagrams can be obtained from all possible (six)\n                pairing of all three fields (…)_1 with all three fields\n                (…)_2: [( (5 ,6,9)_1(2,3,4)_2]. The\n                resulting analytical expression is\n                    ^2 A_1,234= 1/2  G_1  G_5 V_1;4,5 V_523  F_2  F_3  F_4     ,\n                 \n                    with   _5=  _1+_4 and \n                   is diagrammatically shown in FF:3 (b). \n                   Expressions (<ref>) and (<ref>) are the\n                   main result of these calculations, and are repeated as F4Ba in the main text of the paper.\n                \n                \n                \n                \n                \n                 \n                \n                  §.§.§ fourth-order Four Point Correlator\n                   \n                \n                In this section we glue four trees to obatin the \n                expressions for the four-point correlators in the fourth-order in the vertices. \n                   \n                      Notice that we have met here the new type of diagrams \n                ^4 D_1234, \n                  \t  where we preserved the notation\n                  \t  ^n  D_1234, … for all diagrams of nth\n                          order in vertexes V with four G-legs, G_1, G_2,\n                          G_3 and G_4 and any number (including zero, as in this\n                          case) of wavy tails denoting F_j.\n                   \n                   \n                \n                  \n                * 1.^4a A_1,234-term. After substitution  4aA2 for ^4aa_1 the  ^4a A_1,234 term  can be presented as \n                  \t\n                    ^4a A_1,234 =   G_1 G_…^3 V^4_…/2· 3!  a_2 a_3 a_4 (\n                                 a_5  a_6 a_7  a_6 a_8  a_9)_1  .\n                \n                Here we red-colored terms originated from ^4aa_1, and\n                bracketed (…)_1 corresponding field. A particular\n                topological position of these and the rest fields and is shown in\n                FF:5(a), where (at this moment) we have to separate all wavy\n                lines into two parts.  Pairing, for example as follows: [(4,3\n                  2)5] (three options), [(4,\n                  3)6] (two options), and [\n                  4(7,8)] (two options) and [ \n                      89] (one option) we have 12 equal terms.  This factor\n                12 fully compensate denominator in 4aAa giving prefactor unity\n                in the diagram for ^4a A_1,234.\n                \n                \n                \n                \n                \n                        \n                \n                Explicit analytical expression for ^4a A_1,234 can be\n                reconstructed from FF:5(a) and is given by itA below.  The\n                diagram for ^4a A_1,234 has only one element of\n                symmetry, the identity, therefore the factor 1 in front of it is\n                consistent with the 1/N-rule.\n                \t\n                \n                \n                  \n                *2.^4b A_1,234-term.  After substitution  4bAa for ^4ba_1 the  ^4b A_1,234 term  can be presented similarly to 4aAa\n                as follows\n                \n                \n                    ^4b A_1,234=   G_1 G_…^3 V^4_…/4· 3!  a_2  a_3 a_4\n                                      (  a_5  a_6 a_7  a_6 a_8  a_9)_1  .\n                 \n                \n                However, the topology of this tree is different as shown in\n                FF:5(b). This different topology dictates a different way of\n                pairing, for example [(4,3, 2)(5,6] (six\n                options), [ 6(7,8))] (two options), [\n                  8(3,4)] (two options) and [\n                  49] (one option) we have 24 equal terms.\n                Again, this fully compensates the denominator in 4bAa giving prefactor\n                unity in the diagram for ^4b A_1,234.\n                 \n                \n                \n                  \n                *3.^4a B_12,34-term.  \n                           \n                After substitution of \n                 1A2 for  ^1a_1 and   2A2 for  ^2a_2 the  ^4a B_12,34 term  can be presented similarly to 4aAa and (<ref>) as follows\n                  \t \n                  \t\t\n                    ^4a B_12,34=   \n                      \t\tG_1G_2G_…^2 V^4_…/2^3 a_3 a_4 ( a_5  a_6 a_7  a_6 a_8 )_2 ( a_9  a_10)_1 .\n                 \n                \n                Here Green's functions and free fields originated from\n                ^1a_1 and ^2a_2 are colored in blue and\n                green and are taken in parentheses (…)_1 and\n                (…)_2.  Their particular positions on the diagram for\n                ^4a B_12,34, that dictates their pairing strategies,\n                is shown FF:5(c). The result, that leads to this diagram is\n                independent of the particular choice of strategy.  For\n                concreteness we pair free fields ^ 0a_j in the way: [\n                  6(3,4)] (two options), [ \n                      7 4(7,8)] (two options), [\n                  8(9,10)] (two options) and finally [\n                  510] (one option).\n                \n                \n                \n                The resulting diagram is presented in FF:5(c) with the\n                corresponding analytical expression given by itC below. Note that again\n                the numerical prefactor is equal to unity.  \n                \n                \n                  \n                *4.^4b B_12,34-term. After substitution  \n                 of 3bA2 for ^3aa_1 and  1A2 for   ^1a_3 the  ^4b B_12,34 term  can be presented similarly to 4aAa  as follows\n                  \t   \t\t\n                    ^4b B_12,34=   G_1G_3 G_…^2 V^4_…/32 (    a_5  a_6 a_9  a_10 )_1 ( a_7 a_8)_3    a_2 a_4    .\n                 \n                \n                Pairing in the way: [ 2(5,6,9,10] (four\n                options), [ 4(10,9)] (two options), and [\n                  9(8,7)] (two options) and finally [\n                  410] (one option) we have 16 equal terms, while\n                denominator in 4bBa is equal to 32. Therefore the results for\n                ^4b B_12,34 has prefactor 1/2 as graphically shown\n                in FF:5(c) with the corresponding analytical expression given by\n                itD below.\n                \n                 \n                 Since the diagram has mirror symmetry with respect to 1-3 diagonal,\n                 the factor 1/2 in front of a diagram is consistent with our\n                 1/N-rule.\n                  \t\n                 \n                \n                  \n                *5.^4c B_12,34-term.  Using twice\n                 2A2 for ^2a_j the ^4c B_12,34 term\n                 is shown in FF:5(e) (if one brakes the wavy\n                 lines). Analytically it can be presented as follows:\n                   \n                    ^4c B_12,34=  G_1 G_2  G_…^2 V^4_…/2^4 ( a_5  a_6  a_10)_1\n                                        ( a_7 a_8 a_9)_2  a_3 a_4 .\n                  \n                \n                \n                 The additional prefactor of 1/2 is consistent with our 1/N-rule since the diagram has two elements of symmetry:\n                 identity and rotation by π radians which maps diagram onto\n                 itself.  Explicit analytical expression for ^4c1\n                   B_12,34 is given by itE below and can be reconstructed\n                 from FF:5(e).\n                  \t\n                We denote result itE as ^4c1 B_12,34 because\n                there is another contribution to ^4c B_12,34,\n                originate from a different way of pairing: [\n                  4(9,5,6,8)] (four options), then [\n                  3(5,6))] (two options), [\n                  68] (one options) and finally [\n                  710] (one option). Now we have again 8 equal\n                contributions to Eq.(<ref>) with has denominator 1/16. This gives\n                again prefactor 1/2 reflecting mirror symmetry with respect to\n                the horizontal line in the diagram ^4c2 B_12,34 shown in\n                Fig.<ref>(f) with the corresponding analytical expression given\n                by itF below.  In total  \n                \n                    ^4c B_12,34= ^4c1 B_12,34+ \n                    ^4c2 B _12,34 .\n                \n                \n                  \n                *6.^4  C_123,4-term.  After substitution \n                 of 2A2 and (<ref>) \n                for ^2a_1^1a_3 and ^1a_4 the  ^4 C_123,4 term  can be presented similarly to 4aAa  as \n                \n                 \n                    ^4 C_123,4=  G_1G_3  G_4 G_…  V^4_…/16( a_5 a_6 a_9)_1 a_2 ( a_7\n                                      a_8)_3 ( a_9 a_11)_4    .\n                 \n                \n                Pairing, for example as follows: [ 2(5,6] (two\n                options), [ 6(7,8, 10,11)] (four options), [\n                  810,11] (two options) and [\n                  911] (one option) we have 16 equal\n                terms. Therefore the results for ^4 C_1,234 has\n                prefactor unity, with analytical expression shown in itG below\n                and depicted graphically in FF:5(g). \n                \n                \n                  \n                *7.^4 D_1234-term.  Substitution  1A2 for ^1a_j into 4Ftot for  ^4 D_1234 gives \n                \t\n                    ^4 D_1234   =    G_1 G_2 G_3 G_4\n                                          V^4_…/2^4 · 4!× ( a_5 a_6)_1 ( a_7 a_8)_2 ( a_9 a_10)_3 (\n                                        a_11 a_12)_4 .\n                    \n                Pairing, for example as follows: [\n                  5(7,8,9,10,11,12)] (six options) followed by\n                the pairing [ 8(9,10,11,12)] (four options) and\n                [ 10(11,12)] (two options). Pairing finally [\n                  612] (one option) we have 48 equal terms.\n                Therefore the results for ^4 D_1234, shown in\n                FF:5(h), has prefactor 48/2^4 4!= 1/8,  consistent with the 1/N-rule. \n                 \n                \n                \n                \n                \n                The resulting diagrams are shown in\n                  FF:5(h). Corresponding analytical expression are as follow:  \n                 \n                    ^4a A_12;34   =   G_1 F_2\n                                              F_3 F_4∫d\n                                              _5/(2π)^d+1V_1;8,5V_5;2,6V_6;3,7V_7;4,8G_5 G_6 G_7 \n                                                F_8, \n                     ^4b A_12;34   =   G_1 F_2\n                                              F_3 F_4∫d _5/(2π)^d+1V_1;8,5V_5;2,6V_7;3,6V_8;7,4G_5 F_6\n                                            G_7^* G_8^*,  \n                     ^4a B_12;34   =   G_1G_2 F_3 F_4∫d _5/(2π)^d+1V_1;8,5V_2;5,6V_6;3,7V_7;4,8 F_5G_6G_7 F_8, \n                     ^4b\n                                              B_12;34   =   1/2G_1 F_2\n                                            G_3 F_4∫d _5/(2π)^d+1\n                                            V_1;8,5V_5;2,6\n                                            V_3;6,7V_8;7,4G_5\n                                             F_6 F_7G_8^*, \n                     ^4c1 B_12;34   =   1/2G_1\n                                              F_2 G_3 F_4∫d _5/(2π)^d+1\n                                            V_1;8,5V_5;2,6\n                                            V_3;6,7 V_7;4,8 G_5 \n                                              F_6G_7 F_8, \n                     ^4c2 B_12;34   =   1/2G_1 F_2  F_3G_4\n                                                 ∫d   _5/(2π)^d+1\n                                                 V_1;8,5\n                                                 V_5;2,6      V_7;3,6   V_4;7,8      G_5  F_6G_7^* F_8,   \n                     ^4c C_12;34   =   G_1 F_2 G_3 G_4 ∫d _5/(2π)^d+1 V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 G_5  F_6 F_7 F_8,   \n                     D_12;34   =   1/8G_1G_2G_3G_4∫d _5/(2π)^d+1 V_1;8,5V_2;5,6V_3;6,7   V_4;7,8 F_5 F_6 F_7 F_8 .\n                \n                  \t \n                  \t \tHere _6=_2+_5, _7 = _3+_6=_2+_3+_5 and _8=_5-_1. \n                     \t          \n                 \n                \n                \n                 §.§ Calculations of the simultaneous triple correlator in the third order in the vertex\n                \n                \n                 \n                To write down the corresponding analytical expression we will choose\n                the notification and direction of wave vectors according to _5=_1+_4 and _6=_4-_2.  Diagrams ^3a   A _1,23 and ^3b   A _1,23 (both with prefactor 1/2) produce\n                two identical (under the permutation operator) twins.\n                \n                Sums of these diagrams are shown in FF:11(a) and (b), now with\n                prefactor unity. These diagrams differ also in direction of the\n                Greens' function G_5. \n                \n                \n                \n                 \n                      \n                    ^3a   A _1,23 I = F _2   F _3    ∫d _̨4 T_123T_356T_2346/(2π)^d  \n                                    V_1; 4,5V_6; 4,2 V_5;3, 6\n                                                 F _4 ,  \n                                                        ^3b  A _1,23I  =  F _2   F _3       ∫d _̨4 T_123 T_246T_2345/(2π)^d  V_1; 4,5V_4;2,6 V_5;3,6   F _6 .\n                \n                        Diagram ^3  B _12,3, presented in FF:4(c) has\n                        three children shown FF:11 , Panels ( c ,a),\n                ( c ,b), and ( c ,c) with the following analytical\n                expressions\n                 \n                        \n                    ^3 B _12,3 I  =    F _2 ∫d_̨4 T_123T_356T_2346/(2π)^ d \n                                      V_1;4,5 V_6;4, 2\n                                      V_3; 5, 6 F_ 4 F _6 ,     ^3 B\n                                      _12,3II = F _ 3∫d_̨4 T_123 T_246T_2345/(2π)^ d  V_1;4,5\n                                      V_2;6,4 V_3; 5, 6 F\n                                                _5 F _6 , \n                    \n                                                    ^3 B _12,3III  =    F\n                                      _3∫d_̨4   T_123 T_356T_1346/(2π)^ d  V_1;4,5\n                                      V_2;4,6 V_3; 5, 6 F\n                                      _4 F _5 .\n                The procedure of “multiplication” ensures that all the\n                  “children” inherit the same combinations of the vertexes and\n                double correlators from its common parent, but differ in the frequency\n                integrals.\n                \n                Last diagram in FF:4, Panel (d) with prefactor 1/6\n                produces six identical twins and results in diagram FF:11 (\n                  d) now with prefactor unity:\n                \n                    ^3  C_123   =    ∫d_̨4T_123 T_246T_2345/(2π)^d V_1;4,5V_2;4,6V_3;5,6\n                            F   _4   F_5 F _6 .\n                  \n                         \n                    \n                            Note that diagrams for ^3b  A _1,23 I,\n                            ^3  B _1,23II,and ^3 C _123, shown in\n                            FF:11) ( b), ( c b), and ( d), have\n                            identical directions of all Greens' functions and\n                            therefore have the same frequency integral while diagrams\n                            for ^3 B _12,3I and ^3 B _12,3III,\n                            shown in FF:11 ( c a) and ( c c) have\n                            the same (but different from the previous set of diagrams)\n                            orientation of the Greens functions.          \n                              \n                                  \n                \n                     \n                \n                 §.§ Square Diagrams Details of Calculations\n                \n                \n                  §.§.§ Next-lowest (4rd) order diagrams for quadruple   correlator \n                         \n                \n                \n                         Each of the eighth diagrams for the quadruple correlator,\n                         depicted in FF:5 with analytical\n                         expressions (<ref>) involve four double\n                         correlator. Consequently, they produce 8· 2^4=128 child\n                         diagrams but only 30 of them, shown in   FF:12 and\n                           <ref>, contribute to simultaneous\n                         correlator.  The detailed are presented in the\n                           Appendix (<ref>).\n                \n                 First diagram ^4a A_12;34 has only one surviving child shown\n                 in FF:12( a):\n                    \t        \n                                  \n                    ^4a  A_12;34 I= F_2 F _3 F _4 ∫d _̨5 T_123 T_356T_1346/(2π)^dV_1;8,5V_5;2,6V_6;3,7V_7;4,8 F_8 .\n                \n                   \n                    \n                        \n                        \n                    \tDiagram ^4b  A_12;34,  depicted on FF:5b\n                        has two surviving children,  FF:12(\n                              b a) and FF:12( b b).  Corresponding\n                        analytical expressions  are given by \n                        \t\t\t \n                    ^4b  A _12;34(I) = F_2  F   _3F_4  ∫d _̨5   T_1234T_256T_2357T_23458/(2π)^d V_1;8,5V_5;2,6V_7;3,6V_8;7,4  F  _6       ,     \n                    \n                                                                                ^4b  A _12;34(II)=F_2  F   _3F_4  ∫d _̨5\n                     T_1234T_367T_2357T_12378/(2π)^d V_1;8,5V_5;2,6V_7;3,6V_8;7,4  F  _6    .\n                  \n                 \n                 \n                 \n                These analytical expressions follow the same pattern: they\n                 have the same combination of vertices and double correlators.\n                 This appears to be the  general rule for all children of the\n                 same parent diagram.  These analytical expressions for the\n                     “child” of the same parent nevertheless do  differ in\n                 frequency integrals.  Diagrams ^4aB_12;34 [FF:5c and\n                   itC], have already three surviving children, shown in \n                     FF:12, Panels ( c a), ( c b), ( c c). \n                     \n                \n                     Note that the total of 22 square diagrams for the four-point\n                     correlator of their fourth-order presented on FF:12 and\n                     FF:13 depend only on very few (8 to be exact) frequency\n                     integrals. This is due to the fact that the frequency integral\n                     depends only on the position and orientation of the Green's\n                     functions, and is independent on the vertices and on whether the\n                     Green's function is \"true\" or \"auxiliary\". Consequently, there\n                     are a lot of repeated frequency integrals as seen on FF:12\n                     and FF:13 and analytical expressions 4aAb,\n                     4bAc and 4aB,4c1-e,4C and 4Da.\n                \n                   \n                    . -.2 cm       \t^4aB_12;34(I)  = \n                                                      F _3  F   _4 ∫d_̨5  T_1234T_367T_23458(T_3468+T_2357) \n                                                      /(2π)^d V_1;8,5V_2;5,6V_6;3,7V_7;4,8F_5 F_8,  \n                    . -.2 cm       \t^4aB_12;34(II) = F_3 F_4  ∫d    _̨5  T_1234  T_478 T_3468 T_23458/(2π)^d  V_1;8,5V_2;5,6   V_6;3,7V_7;4,8 F_5 F_8 ,  \n                    . -.2 cm        \t^4a B_12;34(III)  =F_3F_4 ∫d _̨5 \n                    T_1234T_367T_23458(T_3468+T_2357)\n                                                      /(2π)^d V_1;8,5V_2;5,6V_6;3,7V_7;4,8F_5F_8.\n                 \n                \n                       Parent diagram ^4b  B_12,34, FF:5( d), is\n                        symmetric with respect to rotation around first and third\n                        leg. Therefore in accordance with the 1/N rule,\n                       it has prefactor\n                        1/2. It has four children. The first two of them are \n                        rotationally symmetric and became identical (i.e. twins) under\n                        the permutation operator. They both contribute to diagram ^4b  B_12,34 I, FF:12  ( d a),\n                        now without symmetry and with prefactor unity. Last two\n                        children are shown in  FF:12, Panels ( d b)\n                            and ( d c), both symmetric and with prefactors\n                        1/2 as required by general diagrammatic rules. Their\n                        analytical expressions are:\n                \n                        \t\n                    . -.4 cm    \t ^4bB_12;34I = F_2 F_4d _̨5 T_1234  T_478 T_3468 T_23458/(2π)^d\n                                    V_1;8,5V_ 5;2,6V_3;6,7V_8;7,4 F_6F_7\n                                    , \n                       . -.4  cm   ^4bB_12;34II\n                       = F_2 F_4/2d _̨5\n                        T_1234T_367T_2357T_12378/(2π)^dV_1;8,5V_5;2,6V_3;6,7V_8;7,4 F_6F_7\n                                    , \n                       . -0.4  cm   ^4bB_12;34III\n                                    = F_2 F_4/2d _̨5T_1234T_367T_23458(T_3468+T_2357)/(2π)^d\n                                    V_1;8,5V_5;2,6V_3;6,7V_8;7,4\n                                    F_6F_7.\n                \n                        Due to the\n                          nature of the “multiplication” procedure the “children”\n                          repeat  the parent's genome (combination of vertexes and double\n                          correlators) but differ in frequency integrals.\n                          \n                      \n                                  \n                \n                     \n                Next diagrams ^4c1 B_12;34 [FF:5(e) and itE]\n                (with prefactor 1/2) has two twins both contributing to \n                   FF:12( e),  with corresponding analytical\n                      expression given by  4c1-e,  where  \n                 1/2⇒ 1  was\n                      replaced. \n                  \n                    ^4c1B_12;34I  =F_2 F_4 ∫d   _̨5 T_123 T_356T_1346/(2π)^d    V_1;8,5V_5;2,6      V_3;6,7      V_7;4,8 F_6 F_8.\n                \n                 \n                Diagrams ^4c2 B_12;34 [FF:5(f) and itF] has two\n                sets of two twins, shown in  FF:12( fa) and (\n                      f b)  respectively.  We now replace, according to the\n                    1/N rule   in both diagrams\n                    1/2⇒ 1.\n                    \n                \n                \n                \n                We therefore have\n                \n                 \n                    - .3 cm   \t  ^4c2B_12;34I     =   F_2  F_3  d   _̨5  T_1234  T_478 T_3468 T_23458/(2π)^d    V_1;8,5V_5;2,6      V_7;3,6   V_4;7,8      F_6F_8,  \n                    \n                         \t ^4c2B_12;34II     =   F_2 F_3 d   _̨5T_1234T_256 T_478(T_12467+T_23458)/(2π)^d      V_1;8,5V_5;2,6      V_7;3,6   V_4;7,8      F_6F_8.\n                \n                \n                \n                 \n                \n                                The most “prolific\" diagram ^c C_123,4\n                                [FF:5(g) and itG] have as much as seven\n                                children, shown in FF:13( g a–g).\n                                Consistent with the logic of our multiplication\n                                the procedure they differ only in frequency integrals.\n                                      \n                                               \n                                \n                     \n                    ^4cC_12;34I     =   \n                                                         F_2∫d   _̨5\n                       T_1234  T_478 T_3468 T_23458/(2π)^d  V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8, \n                    \n                              ^4cC_12;34II     =   F_2∫d _̨5\n                      T_1234T_256  T_12378(T_2357+T_1268)/(2π)^d V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8,       \n                    \n                              ^4cC_12;34III     =   F_2∫d _̨5\n                      ^T_1234  T_256 T_2357 T_23458/(2π)^d  V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8,   \n                     \n                                                           ^4cC_12;34IV     =   F_2∫d _̨5\n                     T_123 T_356T_1346\n                        T_123 T_356T_1346/(2π)^d  V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8,        \n                    \n                                         ^4cC_12;34V    =   F_2∫d _̨5 T_1234 T_367 T_2357 T_12378/(2π)^d V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8,  \n                    \n                              ^4cC_12;34VI     =   F_2∫d _̨5\n                    T_1234T_256 T_478(T_12467+T_23458)\n                          /(2π)^d V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8,         \n                    \n                              ^4cC_12;34VII     =   F_2∫d _̨5  T_1234T_367T_23458(T_3468+T_2357)      /(2π)^d  V_1;8,5V_5;2,6V_3;6,7   V_4;7,8 F_6F_7F_8  .\n                 \n                  \n                      Finally, we give analytical expressions for 2^4-2=14 children\n                      of diagram ^4 D_1234 with prefactor 1/8\n                      [FF:5(h) and itH], shown FF:13( h a),\n                      ( h b), and ( h c). First, eight identical (under\n                      the permutation operator) twins together contribute to\n                      ^6 D^(I)_12,34 shown on FF:13( h a).  This\n                      diagram has no symmetries and therefore has prefactor unity.\n                      Diagram FF:13( h b) includes four twins and has\n                      prefactor 1/2 instead of the parent prefactor 1/8,\n                      while last diagram FF:13( h c) includes\n                      only two twins and has prefactor 1/4.  \n                      \n                      \n                    \n                \n                  We now write down all analytical expressions for the D square\n                  diagrams:\n                      \n                    ^4cD_12;34I    =   ∫d _̨5\n                      T_1234  T_256 T_1268 T_12467/(2π)^d\n                          V_1;8,5V_2;5,6V_3;6,7\n                          V_4;7,8 F_5F_6F_7F_8, \n                         ^4cD_12;34II    =   ∫d _̨5\n                      T_1234 T_158 T_1268 T_12378/2(2π)^d\n                          V_1;8,5V_2;5,6V_3;6,7\n                          V_4;7,8 F_5F_6F_7F_8  ,\n                     \n                            ^4cD_12;34III    =   ∫d _̨5\n                    T_1234T_367T_23458(T_3468+T_2357) /4( 2π)^d\n                          V_1;8,5V_2;5,6V_3;6,7\n                          V_4;7,8 F_5F_6F_7F_8.\n                \n                        Here as before  _6=_2+_5,  _7 = _3+_6=_2+_3+_5     and _8=_5-_1.\n"}