{"entry_id": "http://arxiv.org/abs/2303.06794v1", "published": "20230313005337", "title": "Sensing Wellbeing in the Workplace, Why and For Whom? Envisioning Impacts with Organizational Stakeholders", "authors": ["Anna Kawakami", "Shreya Chowdhary", "Shamsi T. Iqbal", "Q. Vera Liao", "Alexandra Olteanu", "Jina Suh", "Koustuv Saha"], "primary_category": "cs.HC", "categories": ["cs.HC"], "text": "\n\n\nSensing Wellbeing in the Workplace, Why and For Whom?]Sensing Wellbeing in the Workplace, Why and For Whom?\n Envisioning Impacts with Organizational Stakeholders\n\n\n\n\nThis author was affiliated with Microsoft Research while this work was conducted.\n\n  Carnegie Mellon University\n\n  Pittsburgh\n  PA\n  USA\n\n\nakawakam@andrew.cmu.edu\n\n\n\n  Microsoft Research\n\n  Montreal\n  QC\n  Canada\n\n\nchowdhary.shreya@gmail.com\n\n\n\n  Microsoft Research\n\n  Redmond\n  WA\n  USA\n\n\nshamsi@microsoft.com\n\n\n\n  Microsoft Research\n\n  Montreal\n  QC\n  Canada\n\n\nveraliao@microsoft.com\n\n\n\n  Microsoft Research\n\n  Montreal\n  QC\n  Canada\n\n\nalexandra.olteanu@microsoft.com\n\n\n\n  Microsoft Research\n\n  Redmond\n  WA\n  USA\n\n\njinsuh@microsoft.com\n\n\n\n  Microsoft Research\n\n  Montreal\n  QC\n  Canada\n\n\n\nkoustuv.saha@gmail.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWith the heightened digitization of the workplace, alongside the rise of remote and hybrid work prompted by the pandemic, there is growing corporate interest in using passive sensing technologies for workplace wellbeing. Existing research on these technologies often focus on understanding or improving interactions between an individual user and the technology. Workplace settings can, however, introduce a range of complexities that challenge the potential impact and in-practice desirability of wellbeing sensing technologies. Today, there is an inadequate empirical understanding of how everyday workers—including those who are impacted by, and impact the deployment of workplace technologies–envision its broader socio-ecological impacts. In this study, we conduct storyboard-driven interviews with 33 participants across three stakeholder groups: organizational governors, AI builders, and worker data subjects. Overall, our findings describe how workers envisioned wellbeing sensing technologies may lead to cascading impacts on their broader organizational culture, interpersonal relationships with colleagues, and individual day-to-day lives. Participants anticipated harms arising from ambiguity and misalignment around scaled notions of “worker wellbeing”, underlying technical limitations to workplace-situated sensing, and assumptions regarding how social structures and relationships may shape the impacts and use of these technologies. Based on our findings, we discuss implications for designing worker-centered data-driven wellbeing technologies.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[\n    Koustuv Saha\n    March 30, 2023\n==================\n\n\n\n\n\n§ INTRODUCTION\n\nWith rapid transitions into a digital workplace, data-driven worker tracking technologies are increasingly considered “commonplace” across companies <cit.>. Further motivated by the rise of remote and hybrid work prompted by the COVID-19 pandemic, organizations are beginning to explore the use of new data-driven technologies that aim to measure workers' wellbeing <cit.>. One form of worker wellbeing technologies growing in prominence includes the use of passive sensing methods <cit.>. Passive sensing methods are designed for unobtrusive collection and analysis of behavioral and contextual data from individuals in situ, for example, through mobile devices such as smartphones, wearables, and online and digital interactions <cit.>. Recent research has leveraged these technologies to infer a variety of physiological, psychological, and social wellbeing constructs <cit.>, including workplace-specific measures <cit.>. Such approaches aim to address the limitations of traditional survey-based wellbeing measurements, which are comparatively harder to scale, may overlook temporal dynamics, and are susceptible to recall biases <cit.>.\n\nMuch empirical research and development efforts of workplace wellbeing technologies have been dedicated to understanding or improving interactions between an individual user and the technology. \n\nWorkplace settings, however, introduce a range of complexities that may challenge the potential impact and desirability of such technologies. Indeed, a growing body of academic literature and industry reports have raised concerns around how profit-maximizing incentives and power dynamics could impact workers' use of workplace-governed technologies <cit.>. When deployed in a workplace setting, data-driven wellbeing technologies, in particular, may also risk lending themselves to heightened surveillance and privacy concerns from increasing workers' digital visibility, issues about social desirability <cit.>, \namplified worker burdens around power asymmetries <cit.>, coercive control <cit.>, marginalization and biases <cit.> and lack of explicit consent <cit.>—factors that also contribute to an ongoing problematic cultural shift towards commodified workers <cit.>. \n\nHowever, in the human-computer interaction (HCI), ubiquitous computing (UbiComp), and computer-supported cooperative work (CSCW) literature, where much of these  sensing innovations are blossoming on the technical front <cit.>, there is an inadequate empirical understanding of how everyday workers envision passive sensing-based wellbeing technologies may live within a broader socio-ecological context. \n\n\n\nLike most other technologies, workplace wellbeing sensing technologies are often designed top-down (e.g., the notion of “worker wellbeing” is conceptualized and operationalized primarily through the decisions made by researchers and product teams <cit.>). With growing corporate interest in adopting these technologies into the real-world, it becomes critical to center worker perceptions around the in-practice desirability and anticipated (mis)use of these technologies <cit.>. Without centering the voices of workers, the majority of whom typically have little to no decision latitude for deploying these technologies, the technologies might eventually fail post-deployment, producing individual and societal harms along the way <cit.>.\n\n\nProgressing a more holistic understanding of the broader socio-ecological impacts that workers envision—including perceptions around why certain harms may be more likely to arise in workplace settings, and how could they be addressed and mitigated, if at all—could help more proactively inform growing trends in the corporate adoption of data-driven worker wellbeing technologies. Workers who are subject to these technologies, and who often do not have a say in informing their design or deployment, are at the highest risk of being impacted in undesirable ways. At the same time, it is just as critical to understand the potential motivations and envisioned impacts of technology builders and organizational governors who may drive decisions surrounding their deployment. \n\nWorkplace technologies implicate a broad range of stakeholders, each varying in the position and power they hold within an organization. Such differences among stakeholders may give rise to differing incentives, and therefore, diverse perceptions of the benefits and harms of these technologies.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn this study, our goal is to develop a systematic understanding of multiple stakeholder perspectives on the envisioned beneficial and harmful impacts of wellbeing sensing technologies deployed in the workplace. We specifically focus on how the stakeholders perceive wellbeing technologies may interface with the complex organizational structures, interpersonal dynamics, and individual preferences and needs surrounding the workplace setting.\n\n\nTowards meeting this goal, we conducted semi-structured interviews with 33 participants from three broad stakeholder groups, 1) organizational governors—those who may impact decisions to deploy these technologies, 2) AI builders—those who are involved with the design, research, and development of these technologies, and 3) worker data subjects—those who would primarily be impacted by these technologies. Through the lens of how power might operate within an organization, we studied up <cit.> the organizational governors, alongside the AI builders and worker data subjects on the ground. \nTo guide our interviews, we sketched and used four storyboards inspired by prior work (e.g.,  <cit.>) to depict different worker wellbeing sensing innovations and settings and to elicit participants' reactions towards different ways wellbeing sensing technologies may be used in the workplace.\n\n\nParticipants' concerns surface ambiguity and misalignment around the definition of worker wellbeing, technical limitations, and assumptions about how social structures and relationships may shape the impacts and use of these technologies. We highlight the cascading impacts that participants envisioned in their broader organizational culture, relationships with colleagues, and individual day-to-day lives. Moreover, we discuss participants' desires for potential technical, organizational, and policy interventions for improving the design and deployment of these technologies. We end by discussing the implications for designing worker-centered data-driven wellbeing technologies within complex, socio-organizational settings. \n\n\n\n\n\n§ BACKGROUND AND RELATED WORK\n\n\n\n §.§ Measuring Workplace Wellbeing\n\nResearch notes that the wellbeing of individuals at the workplace also translates to individual, collective, and organizational success <cit.>. A rich body of literature in organizational psychology and organizational behaviors has extensively studied the causes and correlates of improving wellbeing and performance at workplaces <cit.>. Research postulates that workplace wellbeing is associated with the interaction between individual characteristics and those of the working and organizational environment <cit.>. A body of research has emphasized and studied the challenges of workplace stress — stress that arises if the demands of an individual's role and responsibilities exceed their capacity and capability to cope <cit.>. \n\nTo understand workplace stress better,  proposed the importance of considering subjective wellbeing in the workplace as a coarse construct that leads to objective benefits across the major life domains of 1) health and longevity, 2) income, productivity, and organizational benefits, and 3) individual and social behaviors <cit.>.\n\nWhile wellbeing measurements are most validated and are conducted through survey methods, research also cautions that survey questions may be responded to “carelessly” <cit.>, and—because of their underlying parsimonious design—survey questions may not be interpreted the same way across individuals, and the responses are often reliant on an individual's retrospective recall; which may bias survey results <cit.>. \nSurveys are also challenging to do at the population-level scale and are often not able to capture high-granular temporal phenomena like wellbeing <cit.>. \nFurther, Pew survey estimates that survey response rates tend to be very low (9% in the U.S.) <cit.>. \nTo mitigate some of the confounds of static long-form surveys, research has proposed ecological momentary assessments (EMAs) (also dubbed experience sampling) <cit.>, where participants are prompted to respond to short survey items in-the-moment <cit.>. \nHCI and UbiComp research has extensively studied and used EMAs (or active sensing, when integrated with mobile-sensing technologies), including in the workplace settings <cit.>. However, these methods do require active engagement and induce a response bias on participants through disruptions <cit.>. This entails the requirement to balance between the construct validity of distributing short survey items with participant compliance <cit.>, and excessive use of EMAs can be challenging in longitudinal and robust data collection <cit.>. \n\nConsequently, more passive and unobtrusive sensing have been emerging to collect and infer wellbeing constructs <cit.>. \n\n\n\nThe ubiquity and widespread use of smartphones and wearables have enabled the collection of longitudinal and dense human behavioral cues at scale <cit.>. Within the context of workplace settings, prior work has studied the use of wearables in understanding aspects of job satisfaction <cit.>.  studied how email interactions associate with workplace stress and productivity <cit.>. Another work <cit.> leveraged digital activities of information workers to understand work patterns and attentional states <cit.>. In addition, prior research has used multimodal sensing through smartphone, wearable, bluetooth, and wireless sensors to try to infer job performance <cit.>, mood and cognition <cit.>, social interactions <cit.>, organizational personas <cit.>, organizational fit <cit.>. Further, with the widespread use of online and social media technologies, prior research has argued that such data can serve as longitudinal, historical, and verbal passive sensors <cit.>. \n\nA series of research with IBM's Beehive platforms have studied how people's social interactions associate with various workplace dynamics <cit.>. Other prior research has used such online and social media data in studying various dimensions and correlates of workplace wellbeing, such as engagement <cit.>, mood and affect <cit.>, \norganizational relationships <cit.>, organizational culture <cit.>, and job satisfaction <cit.>. Together, this body of research has highlighted the promise of passive sensing technologies in measuring and understanding the workplace wellbeing dynamics of individuals. \n\nDespite the promise, these measurements have primarily been evaluated in research and observational settings, where subjects are removed from the multiplex, incentive structures, and dynamics in real-world workplace settings. There is a lack of understanding of the in-practice utility and ecological validity of these approaches. Research has revealed other limitations of these sensing-based data-driven wellbeing measurements, including how poor proxies could lead to fairness and bias issues <cit.>. There are possible mismatches in people's self-perceived versus passively sensed and automatically inferred wellbeing <cit.>.  found that the misalignments were associated with the lack of workplace activity and context data that the sensing technology might not comprehensively include, and the authors questioned the construct validity of the measurements <cit.>.  noted that “those claiming to detect emotion use oversimplified, questionable taxonomies; incorrectly assume universality across cultures and contexts.” The research critically questions the applicability of digital technologies to automatically infer wellbeing <cit.>.\nIn parallel, the multiple transitions of workplaces in recent years, including the growth of remote work and hybrid work settings <cit.>, also amplified by the pandemic, have seen passive sensing technologies be increasingly embedded in the workplace <cit.>. There is growing excitement among organizations about adopting these passive technologies to support wellbeing <cit.>. But, are we there yet? Our work draws motivation from  in contributing empirical insights about filling the gap between translating research to practice with respect to worker wellbeing sensing technologies. Drawing on the social-ecological model <cit.>, that an individual worker is situated within their social ecology, we study the impacts of worker wellbeing technologies at individual, interpersonal, and organizational levels. \n\nWe conduct our study through storyboard-design-based interviews, where our storyboards are theoretically driven from the literature <cit.>, and we examine the participants' perceptions of such hypothetical technologies in the workplace.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Data-Driven Worker Activity Technologies in Organizational Settings\n\n\n\n\n\n\nThe deployment and use of workplace technologies are situated amidst the complexities introduced by the very nature of workplace settings and socio-organizational factors. Individual workers often have limited power within organizations, and rely on organizations for not only their livelihoods but also for health insurance and other essential benefits. Several scholars have raised concerns about the harms workers can face due to their powerlessness, especially when AI-based technologies are introduced in the workplace <cit.>.\n\n\n\n\nA major area of concern with AI- and sensing-based technologies is workplace surveillance and intrusions into workers' privacy <cit.>. Prior work highlights that electronic surveillance in the workplace can have multiple justifications including surveillance as coercive control and surveillance as caring <cit.>.   found that workers expected explicit boundaries that employers should not cross with respect to surveillance <cit.>. Further, with the rise of new web and social media technologies,  noted that employer surveillance shares a competing relationship with a worker's subjective expectation of privacy, and can influence a worker's use of these platforms <cit.>. \nCritical legal and computing scholars have situated these technologies within the history of workplace surveillance as advances that enable “limitless worker surveillance” <cit.>. These technologies have facilitated easier and more extensive means of workplace surveillance and lower costs <cit.>.\n\nSurveillance-related concerns are further exacerbated by the “black box” nature of workplace technologies — the lack of transparency further encroaches on workers' autonomy and personhood and stymies their agency and ability to resist <cit.>. This lack of transparency and the resulting effects are especially concerning given the invasive and intimate nature of the data that is often collected by sensing technologies <cit.>.\n\nThe intimate nature of the collected data, as facilitated by sensing technologies, introduces another concern with these technologies: the potential for punishment or discrimination. Critical scholars argue that the primary focus of these technologies is to “capture and control attention” <cit.> and, by conflating health with productivity, these could be another mechanism for organizations to exert what has been dubbed as bio-power over workers <cit.>. In an early work,  conceptualized “disciplinary” power, as the power “watchers” have to observe, scrutinize, and control the behavior of individuals within the institutions they control. Bio-power is an extension of “disciplinary” power where the omnipresence of the “watchers” leads the “watched” to begin to internalize and self-enforce the existing rules and norms (in this case, ideals of productivity that became codified into these technologies), and start behaving in the required manner without coercion <cit.>. \n\n\nRecent research has emphasized that the design of these technologies, especially the passive and constantly-present nature, and individualistic focus, can further amplify bio-power <cit.>. Such power could cause disproportionate impacts on workers \nfrom disadvantaged populations <cit.>.\n\n\n\nIn the area of supporting worker wellbeing, a recent interview study with workers across diverse, purposely sampled, progressive corporations, revealed that companies “often viewed keeping employees healthy primarily as a means to profitability rather than an end in itself and rationalized stressful workplaces as necessary and non-changeable” <cit.>.\n\nThese profit-motivated incentives are also seen in the motivations behind corporate wellness programs <cit.>, which may also include passive sensing technologies <cit.>.\n\n\n\n\nThe imbalance in whose interests are often served by these technologies reflects what  describes as one of the key challenges with implementing passive sensors in the workplace: the colonization of the private domain by the professional domain, by turning employees into resources to be extracted <cit.>. \n\n\n\n\n\n\nGiven the complexities surrounding power imbalances and resulting harms, research has discussed the ethics of designing and deploying workplace technologies <cit.>. Prior work proposed participatory, value-sensitive, and worker-centered design methodologies to mitigate the resulting harms by these technologies <cit.>. \n adopted a participatory approach to co-design checklists of organizational challenges in AI ethics <cit.>, and  proposed Value Sensitive Algorithm Design <cit.> in early stages of algorithm creation to avoid compromising stakeholder values <cit.>. Given the socio-organizational situatedness of these technologies, research recognizes the detrimental effect of a techno-centric view on AI technologies <cit.>. If individuals do not realize the values or use of these systems, there is a lower likelihood about their acceptability into the individual and organizational workflows <cit.>. \n\nBuilding on this body of research, our work aims at shedding light into the perceived needs, concerns, and desires of workers about wellbeing sensing technologies in the workplace. Adopting a worker-centered research design, our work helps to uncover previously understudied aspects of how different system actors, including more powerful system actors who have the ability to shape the systems and whose interests drive the development of these systems. Our work is inspired by the anthropological concept of “studying up” <cit.>, or the process of examining the most powerful in order to understand how a system truly works and all of the ways it disadvantages the less powerful. Our work contributes to and bears implications in accounting for multi-stakeholder voices in designing, deploying, and decision-making with respect to worker wellbeing technologies in the workplace.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Foreseeing Harms of AI and Sensing-Based Technologies\n\n\n\nWhile AI and computing has proliferated significantly in the last few decades, and been more and more embedded in our lives they have also caused harms at both individual and societal levels <cit.>.  noted that data-driven technologies that leverage the vividly available digital data of individuals can reinforce the troubling perception of these technologies as “Big Brother, enabling invasions of privacy, decreased civil freedoms, and increased state and corporate control” <cit.>. Recently,  highlighted how AI systems that are being deployed often do not work as intended <cit.>. Although anticipating all unintended uses and consequences of AI has proven difficult <cit.>, there have been growing efforts to map and taxonomize possible failures, risks, and harms, often in an attempt to gain a more comprehensive understanding of the issues that could arise within and across different AI deployment and use settings <cit.>. These include, taxonomy of AI failures <cit.>, guidelines for designing human-AI interaction technologies <cit.>, taxonomy of ethical tensions between AI and practitioners <cit.>, taxonomies of roles of AI consumers <cit.>, question-bank of explainable AI <cit.>, and guidelines for minimizing risks with automated emotion recognition technologies <cit.>. Relatedly, recent research has seen datasheets for datasets <cit.>, explainability fact sheets <cit.>, and model cards <cit.> towards building responsible and ethical AI technologies. \n\nFurther, there is a growing recognition that the priorities of different stakeholders are shaped by their backgrounds and personal experiences <cit.>, and that more participatory approaches are required to understand the range of needs and concerns of different stakeholders and practitioners <cit.>. \n\n\n\n\nRelatedly, research has investigated algorithmic impacts in different workplace settings and worker populations, including ridesharing <cit.>.  adopted participatory design to study how worker wellbeing can be incorporated into algorithmic management so that the workplace can be better optimized for workers <cit.>.  proposed a framework for worker wellbeing in an AI-integrated workplace, including six pillars of worker wellbeing across 1) human rights, 2) physical safety and health, 3) financial wellbeing, 4) intellectual wellbeing, 5) emotional wellbeing, and 6) purpose and meaning <cit.>. Recently, <cit.> studied designing fair worker-centered AI for Human Resource Management <cit.>, and  studied the tensions between how to better measure workplace wellbeing and how these technologies remake the boundaries of information flows between worker and workplace <cit.>.\n\nOur work draws inspiration from and contributes to the literature on investigating the ethical challenges and concerns about possible adverse impacts that the use of AI technologies can give rise to <cit.>. Our problem is situated in this space of deploying sensing technologies for worker wellbeing, which is envisioned and believed to be theoretically backed, however, there are currently only a few recent attempts at large-scale real-world deployments. \n\nTherefore, we consider time-critical to empirically study and surface the potential concerns and needs of workers. Our work motivates us to revisit and re-imagine the very existence and design of these technologies, and what factors and mitigation strategies to consider with respect to these technologies. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ STUDY DESIGN AND METHODS\n \n\nTo examine different organizational stakeholders' concerns and desires of using sensing-based wellbeing technologies in the workplace, we conducted semi-structured interviews with 33 participants across three stakeholder groups, broadly construed as: organizational governors, AI builders, and workers (i.e. data subjects and/or target users of wellbeing sensing technologies). Participants were recruited to represent a broad range of stakeholders who would impact or be impacted by the design and deployment of workplace wellbeing technologies. Before conducting the interviews, we sketched four storyboards, each depicting different ways in which a hypothetical wellbeing sensing technology can be used in a workplace setting. \n\nDuring the interviews, we used the storyboards \nas a provocative tool to elicit participants’ reactions toward integrating wellbeing sensing technologies into a workplace context. In the following, we describe the recruitment process and participant groupings, the design of the study protocol and storyboards, and our analysis method. \n\n\n\n §.§ Participants and Recruitment\n \n\n\n\n\n\n\n\n\n\n\nWe aimed to recruit participants across a range of roles with varying positions and power around implementing and using wellbeing sensing technologies in the workplace. Our study is scoped to focus on information workers <cit.>. Information workers process and work with information rather than physical objects and do so typically using computing technologies nowadays. \n\nWe recruited participants from 12 organizations of varying sizes, types (technology, consulting, research-based, non-profit, etc.), and four global locations (U.S., U.K., Canada, and India). \n\n\nOur recruitment was carried out in three weeks in June and July 2022. We adopted a snowballing strategy by posting on organizational email lists and directly contacting information workers in different roles through LinkedIn direct messaging and emails. \n\n\n\n\nInterested respondents were asked to complete an interest form that asked for information on their role, workplace tenure, organizational size, familiarity with AI, ML, or data science, and if they have served in a leadership or managerial position. Out of the 198 responses that we received, we invited a subset of participants to maximize diversity and balance across answers to the above questions. \n\nThis led to a final subset of 33 participants that consented to participate in the study, and we interviewed. \nEach participant was compensated with Amazon gift vouchers of $50 USD (or equivalent amounts in local currencies).\n\nWe group these participants into three stakeholder groups, 1) Organizational Governors (): individuals in leadership, human resources, policy-making, and corporate legal and governance roles, who are primarily responsible for decision-making surrounding the development, deployment, and use of worker technologies, 2) Builders (): individuals associated with building AI and sensing technologies, in the roles of design, engineering, research, and product management, 3) Worker Data Subjects (): workers who would be subjected to the use of workplace wellbeing technologies, including people serving both management (people, product, general, etc.) and rank-and-file roles. \nOur participant pool included an equal number (11) of participants from each group of stakeholders. <ref> and <ref> provide descriptive summaries about our participant pool. We note that individuals in the first two groups would likely serve multiple roles in an organization (e.g., a builder is also a worker data subject). We accounted for this in our study protocol by clarifying that participants can switch hats anytime when discussing the storyboards. \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Study Design\n \n\n\n\n\n\n\n\nWith the rise of media coverage on workplace tracking technologies <cit.>, the idea of collecting worker data to measure wellbeing may prompt participants to imagine very different technologies. \n\nAdditionally, passive sensing may be an unfamiliar method to a participant. Therefore, asking participants about their concerns or desires towards envisioned wellbeing sensing technologies may lead to responses that are not grounded in realistic scenarios. To establish common ground across participants, we leveraged pre-defined storyboards to elicit stakeholder perspectives. \n\n\nStoryboards are used to solicit people's immediate reactions and underlying needs towards a wide range of hypothetical scenarios depicted in storyboard sketches <cit.>.\nWe leverage storyboards to surface participants' boundaries and latent needs towards different forms of wellbeing sensing technologies. \nUsing storyboards also allows the introduction of other organizational stakeholders into the storyboard images. This creates an opportunity for stakeholders to react honestly to how they would feel about their colleagues or managers using these technologies on or with them. Such an honest reaction would be challenging to elicit in an actual workplace involving multiple stakeholders amidst possible power dynamics influencing participant responses.\n\nWe designed and incorporated four storyboards in our study that cover a range of wellbeing sensing technologies proposed in the research literature.\nFor each storyboard, we aimed to go more in-depth into understanding the underlying why behind participants' immediate reactions. \nWe first describe how we incorporate storyboards in our interview protocol, followed by how we constructed the storyboards.\n\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Storyboard-driven semi-structured interview protocol\n\n\n\nFor each interview, we first gave participants an overview of the study goals and structure. We then sent them a copy of a slide deck that included images of the four storyboards. We conducted  60-minute video interviews over Microsoft Teams which included a screen-sharing session with the same slide deck and was audio/video recorded with the participant's consent.\n\n\n\n\n\nParticipants were informed that the study's goal was to understand how their unique position within their company shapes their attitudes toward these technologies. For each storyboard, we asked if the storyboard was relatable to them and what were their immediate reactions.\n\n\nThen, we asked if they had any concerns about the technology and its use depicted in the storyboard. Since our goal was to build a holistic understanding of different stakeholders' concerns, if participants could not think about any concerns, we showed them a list of potential harms from the storyboard. The harms were used as a way to help scaffold thinking around potential concerns, and we clarified that the harms may or may not actually happen in practice. For participants who were Organizational governors or AI builders, we additionally asked them to “switch hats” to a worker role during parts of the interview protocol to uncover a broader range of potential concerns. After understanding their reasons for the concerns that they raised, we prompted participants to think about potential mitigation strategies or solutions that could address these concerns. \n\nFor worker data subjects, we asked what they would like to change in the storyboard to help them feel less concerned. \nFor AI builders, we asked them to imagine a scenario in which they were assigned the role of designing this technology, to engage them in thinking about choosing now to build it or how they would change it. \n\nFor organizational governors, we asked them to imagine that a product team pitched the idea to them, and they were asked to provide feedback. We additionally asked about what improvements or mitigation they might recommend that cannot be addressed by a product team (e.g., policy-related mitigation). We randomized the order in which we showed the four storyboards to avoid ordering effects. After showing all four storyboards, we asked questions to help debrief on the storyboard-driven section of the protocol. This included questions about whether participants were interested in seeing the technology in their workplace, their broader reflections of the depicted storyboards, and if they had prior experiences using data-driven wellbeing technologies. We prioritized using the interview time to go through all four storyboards and only asked the post-storyboard questions if there was remaining time. We kept the overall structure and nature of questions consistent for all participants. The study protocol and materials were refined through a pilot study with three participants (1 HR and 2 builders). \n\n\n\n\n  §.§.§ Storyboard construction\n\n\n\n\n\nWe designed the storyboards using an iterative process that involved collecting and reading research papers across UbiComp, HCI, and CSCW that propose or study wellbeing sensing technologies and sketching use case scenarios inspired by those papers. In total, we reviewed 31 research papers and selected 19 papers that represented a diverse set of wellbeing problems and methodologies (<ref>). We outlined and organized the use case scenarios from these 19 papers into four topical categories in a bottom-up manner: 1) Work Patterns and Scheduling () <cit.>, 2) Notifications and Focus Work () <cit.>, 3) Emotions and Social Interactions () <cit.>, and 4) Productivity and Job Fit () <cit.>. \n\n <ref> shows images of all four storyboards. \nEach storyboard follows the general pattern of having four panels—the first panel shows the wellbeing problem that the technology attempts to address, the second panel shows the data collection and sensing, the third panel shows the intervention the sensing technology provides, and the fourth panel shows a positive, real-world downstream course of action that resulted from that sensing technology. For participants who were data subjects, we changed the name of the worker in the storyboard to their actual name prior to the interview. \nThe scenarios depicted in the storyboards all led to a positive outcome for the storyboard character because the stories are inspired by prior literature innovating on the technology.\nOur storyboards were also intentionally designed to omit certain details (e.g., the accuracy of sensing overtime work), and these ambiguities gave participants an opportunity to question or respond to these gaps.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Analysis\n \n\n\n\n\nDrawing on practices in reflexive thematic analyses (e.g., in <cit.>), we qualitatively analyzed over 33 hours of transcribed interview recordings. \n\nAll the interview transcripts were first open-coded by at least one of the researchers, while referring to the research questions and protocol topics. For most interviews, we ensured that the coder was the researcher who conducted the interview. Otherwise, the researcher who conducted the interview looked over the coding to reconcile any misconceptions. During the process, the research team met frequently to discuss the codebook and resolved disagreements such as the granularity of codes. \n \n\n\n\n\nAfter the open-coding step, we iteratively refined and grouped all the codes into successively higher-level themes. In the end, this resulted in four levels of themes. The highest level of themes is organized into the three subsections of findings presented in the <ref>.  \n\n\n\n\n\n\n\n\n\n\nOur initial coding and grouping were agnostic of participants' roles and specific storyboards to avoid interpretation biases, while the codes were tagged with such information. Using these tags, after the first round of analysis, we looked for differences across the following two dimensions: 1) Stakeholder group and 2) Storyboard topic. We adopted inductive thematic analysis with the researchers in the team to identify themes of different stakeholders' needs, concerns, and desires with respect to these technologies. \n\nWe noted which themes and sub-themes were unique to specific stakeholder groups and included that in the findings whenever applicable. We did not find any notable difference across storyboards, so the sub-themes presented in the Results (<ref>) pertain to all four storyboards. \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n §.§ Privacy, Ethics, and Positionality\n \n\n\n\nOur study concerns the desirability and functionality of technologies that would be situated in workplaces by soliciting perspectives from participants employed at those workplaces. Therefore, our participants may not be comfortable fully expressing concerns or critiques during the study. Throughout the recruitment and the interviews, we assured the participants that their participation was completely voluntary, all questions were optional, their responses would be anonymous, and they may ask us to remove any recorded content from the study data after the interview session (no participants asked us to remove recorded content). To avoid identifiability and traceability of our participants, we analyzed the data in a de-identified fashion, and in this paper, we paraphrase their individual quotes and present demographics at an aggregated level, without disclosing organizations and specific roles of individuals. Our research team comprises researchers holding diverse gender, racial, and cultural backgrounds, including people of color and immigrants, and hold interdisciplinary research expertise in the areas of HCI, UbiComp, CSCW, and critical computing. This study was approved by the Institutional Review Board (IRB) at our research institution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ RESULTS\n\nOur findings surface the harms and benefits that organizational governors, developers, and end-user workers envisioned from the potential uses of data-driven workplace wellbeing technologies. We organize our findings into three sections, split into three layers cross-cutting the workplace context (<ref>). At a high level, we first describe how participants envisioned how these technologies may be mediated by their existing organizational culture and workplace incentives (<ref>). Next, we discuss participants' perceptions around how their relationships with their managers and colleagues may be enhanced or harmed, depending on their interpersonal relationships and team culture (<ref>). Finally, we discuss how participants perceived they, as individuals, may feel supported by or at conflict with wellbeing technologies deployed in their workplace (<ref>). We note that these layers are all intertwined (e.g., concerns at the organization-level cascade down to impact individual-level behaviors and needs, while individual and interpersonal interactions with wellbeing technologies also shape broader organizational uses and culture). <ref> includes an overview of our findings. \n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Organization-Level Impacts\n\n\n\n  §.§.§ Enabling Improved Company-Wide Wellbeing Practices and Policies through Wellbeing Data\n \nSome participants envisioned that the data from wellbeing technologies, even when intended for individual employees, could additionally be used by leadership to understand how the organization can support its employees' wellbeing through other resources. For example, some organizational governors described how anonymized wellbeing data aggregated across all employees could inform the design of organizational policies that target structural challenges impacting their employees' wellness. As one organizational governor (G11) put it, “[Human Resources] can take all of this information from all of the people in the company and see if there's a pathology in the organization that can be fixed because of some patterns they're seeing across multiple peoples, and that is going to be applied to improve the life of everybody.” \n\nOther participants envisioned that wellbeing apps could support managers in communicating to leadership any need for additional resources to support their employees' wellbeing. For example, one participant described that collecting data on wellbeing proxies in the workplace (e.g., amount of overtime work) to identify and mitigate sources of team-level challenges: “if everyone's doing a lot of overtime work, that probably means that you might need to ask for another spot on your team to allow more collaboration or [understand if] it's saying, `why is everyone working so hard?”' (W07). Another participant (A7) envisioned that the wellbeing app's data could also be used by the organization to monitor managerial practices, for example, to ensure that individual employees are treated fairly by their managers. This participant described how organizational leaders could track whether managers were distributing employee rewards that were commensurate with different workers' productivity, as inferred by data collected in the wellbeing app. \n\n\n\n\n  §.§.§ Concerns of Organizational Incentives for Misusing Wellbeing Technologies\n \nSome participants expressed skepticism towards the wellbeing sensing scenarios described in the storyboards, believing that the implementation would benefit the employer more than the individual worker themselves. Participants felt that organizations are incentivized to “maximize profit [..] to get more out of workers” (A7, G6), making it likely that wellbeing apps—even when deployed with a stated intention to improve individual wellbeing—may be another workplace tool to increase the organizations' profits. \n\nParticipants also perceived irony in having profit-maximizing organizations collect their employees' data and claim “for employees' welfare” (A12). One organizational governor (G7) perceived the wellbeing apps as “palliative care to make people feel better about the situation, [..] putting band-aids instead of looking at the systemic issues that might be the root cause of many of these.”\n\n\nOther participants expressed skepticism that organizations may collect employees' wellbeing data to boost their public image (A5) by providing data that allows them to publicly claim their employees were benefiting from positive mental health (A9). \n\nParticipants envisioned a range of ways the organization may re-purpose employees' wellbeing data for reasons beyond supporting their wellbeing, like enabling new forms of corporate regulation. For example, one AI builder was concerned that organizations might use data from employees' working hours (Storyboard ) to identify those who are using their work devices for personal reasons, risking individual workers' employment. \n\nOther participants noted the sensitive nature of wellbeing data, making it susceptible to misinterpretation that is harmfully biased towards different groups of workers, even when seen in aggregate. For example, one organizational governor cautioned that wellbeing data could be used to make biased causal inferences: \n\n  \n“women might feel particularly dispassionate or unproductive. Let's say, if they're experiencing their periods [..] And so then you'll see these patterns where ohh, women are less productive than men and women are less passionate about their jobs than men. Yeah, because women have a few days a month where, you know, they're feeling like dying, but they're working anyway.” (G7, Storyboard ). \n   \n\n\nFurther, participants envisioned that workers might begin altering their workplace behavior to protect themselves against unwanted data collection. For example, one participant described that workers may feel an increased “level of consciousness [.. because] they know their messages are being analyzed, or you know, peeped in.” (W4). Another participant similarly described how undesirable data sharing, even for the intended purpose of improving one's wellbeing, could “constrain someone's communication pathways” (G4), introducing new barriers to supporting open communication with managers. This aligns with\n\nthe paradoxes of behavioral visibility in organizations as identified in <cit.>.\n\n\n\n\n\n  §.§.§ Reliance on Organizational Culture as a Regulatory Force\n\nWithout effective regulations in place, organizational governors and AI builders described how the organization's culture — for example, its “ethics and code of values” (A10, Storyboard ) — could serve as a compass to signal what forms of wellbeing apps may be appropriate. For example, one organizational governor described that deciding whether to deploy a given wellbeing technology should consider a “creepiness factor” — where creepiness arises at the point in which “we cross the threshold from being someone's employer to being more than that” (G4). \n\nImportantly, organizational governors noted that companies might be more likely to rely on culture alignment-based assessments (e.g., like the “creepiness factor”) when there are no existing regulations. For example, when discussing the factors that determine whether a given wellbeing technology could get deployed or not, one organizational governor described how considerations might differ across countries. Comparing the U.S. to Europe, where there is stricter legislation, the participant described: “In Europe, this should probably be a no-go. In the U.S., I think for some employers, it would probably depend on the corporate culture and tone that they want to set.” \n\nWhile some organizational governors described assessing for “creepiness” (e.g., as in <cit.>) to understand what forms of data-driven wellbeing technology may be appropriate given the existing culture within their organization, worker data subjects similarly centered their own understanding of their organization's values to inform their judgments of wellbeing technology: “I am not a supporter of this technology [...] My company has a great value of privacy, and this would be a complete breach of its values” (W4). \n\nHowever, other participants described the risks of relying solely on organizational culture as a compass for understanding what forms of technology may or may not be appropriate to deploy. For example, organizational governors described the fluid and often volatile nature of organizational culture, given workplace norms can shift quickly with leadership changes. \nAnother organizational governor (G5) described that existing norms in the workplace might not be favorable towards workers, with practices differing based on how “traditional” a company is: \n\n\n“The more modern enterprises, I would keep [Human Resources] out [of employees' wellbeing data]. The more traditional enterprises are more structured. There's a processed way of doing everything: [… Human Resources] is instrumenting everything. They are pretty much in the loop and [in] the know-how on every career decision that is being made about the employee, employer, and manager” (G5).\n\n\nAnother AI builder (A7) also expressed concerns that, without appropriate regulations, harms to the workplace culture and workers themselves may be less visible: “There are power structures in the company that could lead to this being used to the detriment of the employees, fairly easily without anyone even noticing.” As an example, they told us how individual employees currently have no effective ways to raise concerns about their managers to higher-ups, creating risks of managers misusing these apps without others knowing. While participants generally acknowledged the importance of having company-wide policies to govern the use of wellbeing technologies, they also warned that company-level policies may still unfairly disadvantage workers. For example, one organizational governor (G7) admitted, “It's very difficult to have an employee-employer policy that is fair to both parties. [It's] most likely to be unfair to the employee and fairer to the employer, because they have the power they have – they'll be the ones or making the policies for the company itself.” Instead, one organizational governor with a legal background voiced a need for new legislative policies, specifically for the worker wellbeing domain: \n\n\n“[There are] differences between a labor question or a data protection question [..] should definitely be combined into something that is for employee wellbeing and employee data. [Labor laws and data protection laws] are two different areas of law and policy. [..] And it's challenging to enforce it to have some rights for the worker.” (G6)\n\n\n\n\n §.§ Interpersonal-Level Impacts\n\n\n\n  §.§.§ Enhancing Manager-Worker Relations\n \nMany worker data subjects expressed excitement about using the wellbeing sensing app to enhance their communications with their manager because they resonated with the challenges faced by the character in the storyboard. A participant approached the storyboard with light-hearted curiosity or humor, saying that they would find it “cute and hilarious” if their manager discussed their work patterns with them based on the wellbeing app (W7). Looking past the light-heartedness, participants imagined ways the portrayed sensing app could improve day-to-day work, especially in equipping managers to support them in being more reflective and proactive about their wellbeing.\n\nFor example, participants envisioned that having an app share their work hours with their manager could open opportunities to discuss strategies to improve their wellbeing. In some cases, participants imagined that the wellbeing app could help them share concerns with their manager around sensitive topics that are currently challenging to express by themselves. For example, one participant described that their cultural background imbibes shame in bringing up wellbeing-related challenges with their manager. This participant envisioned that a wellbeing app that documents and shares working hours could help nudge her towards having this conversation: “I think half the battle is bringing up the issue. This app that actually has the data and brings it up to your manager, prompting you to talk to you [..] So it's helpful in that sense.” (W10, storyboard WPS). \n\n\n\n\n  §.§.§ Concerns Around Using Wellbeing Data for Team Management\n \nParticipants in our study imagined ways workplace actors of the same position could leverage the same wellbeing app to either harm or help workers' wellbeing. Participants particularly viewed managers as holding a dual responsibility: bearing services towards their organization to evaluate their reportees' performance and—in tension with it–service towards their reportees to support their wellbeing. Moreover, with the workplace context ambiguating what it means to have “positive wellbeing” versus “good productivity”, workers were concerned that efforts towards improving their wellbeing could easily be misguided into evaluating their wellbeing as a proxy for productivity. Because of this, they feared that wellbeing data would lead to undesirable or unfair treatment from their managers. \n\nWorker data subjects described how even well-intended managers might unknowingly use the wellbeing app against employees' best interests. As one worker data subject (W10) described: “it doesn't matter how great your relationship with your manager is, it's very difficult to overcome your own perception of what is what constitutes a good worker.” Another worker data subject also described that managers and employees may have misaligned notions of what preferable levels of “work-life balance” should look like: \n\n\n“it's good that the manager has this information, but if there was, say, a new project, I really wanted to work on. The manager might be like, `Oh, well you've got too much on your plate, and I don't wanna give it to you.”' (W8)\n\n\nOther participants were concerned that tracking work hours, even for wellbeing-related purposes, could trickle into setting potentially harmful blanket standards for working hours amongst their team members. For example, worker data subject (W3) described how the wellbeing app might amplify existing tensions amongst colleagues who may feel pitted against each other at their workplace: “[collecting working hours] may not pan well, in places where there's pressure to work more hours and compare against other employees” (W3, Storyboard WP). Moreover, participants expressed concerns that wellbeing apps used to manage their team could pose risks to setting boundaries with their colleagues. Given that the wellbeing app may sense more personal attributes related to their emotional wellness (e.g., in Storyboard ), one worker described that any data sharing or data leakage could undermine the professional image workers may want to uphold in front of their colleagues: “[I would be] very concerned if this gets shared with others since in the workplace [..] if [a worker] wants to convey a certain image of how she feels about her work. This could impact whether she gets promoted” (W10). \n\nParticipants additionally felt concerned that managers might misunderstand workers' wellbeing or productivity, by overlooking critical factors not captured by the wellbeing app. For example, one participant described that a wellbeing app that uses the number of hours worked by an employee would shift the manager's attention towards the quantity of work hours, rather than the quality of the work or circumstances influencing the working hours. As one worker described: \n\n“when a manager doesn't get to see their folks directly, and now has to differentiate three employees who are all great, but then thinks: `Because I have this [wellbeing app] and it tells me [this worker] is working lot harder – longer hours than if he needs to, so he deserves a better bonus.' [The manager could make this decision] without taking into consideration, `why is he working longer hours? Is he being productive those hours or is he just connected and chatting with his friends on Facebook?”' (W6)\n \n\nParticipants stressed that the wellbeing app should collect a worker's unique circumstances and richer contextual data. \n\nFor example, a participant mentioned the importance of supplementing any data with more context: \n  \n“If somebody's not engaging in a particular task, it could be for a number of reasons, right? [..] There [could be] some personality personnel issues or it could be, something in their life that's intruding on that particular thing. Or maybe there's something [with] different time zones. [..] It's just you never see any of that context with this technology. So I think context needs to be provided somewhere.” (W2, Storyboard )\n\n\nTo collect contextual data, participants suggested data collection through active means, not just passive sensing, could serve as a complementary source of information. For example, one data subject (W2) was open to inputting their wellbeing data manually in conjunction with the passive data collection: “It could ask what is your current feeling right now, it could use [that with passive sensing] to say maybe something is up. I think that kind of makes good sense” (W2). \n\nOverall, participants from all three stakeholder groups also stressed the importance of having policies that required managers to undergo training processes to support them in appropriately using the wellbeing app. For example, participants described that managers should learn what data is and isn't captured by the sensing inferences, so they could more accurately interpret the data insights before making decisions aided by them. \n\n\n\n\n §.§ Individual-Level Impacts\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Enabling Positive Workplace Behaviors\n \nSome participants described that the wellbeing app could help identify and prevent working patterns that might detriment their wellbeing. For example, reflecting on their earlier months of employment, one worker envisioned having a similar wellbeing app could have helped them mitigate over-work and burnout: \n\n\n“I was a computer engineer by degree, but I joined management, so I had to prove to people that I could do it, as a lot of questions were being raised by people around me. So I took up projects that weren't normal. I took on so many projects that I gradually started burning out to the extent that I was ill with typhoid, but was still working. I got some escalations through senior leadership, and then I had to deal with them [..] I think if technology could have helped me [..], wouldn't have been in that worst place in the 1st place” (W04, Storyboard WPS).\n\n\nTo support such positive behaviors, one participant advocated for designing wellbeing technologies that empower individual workers to enforce their own desired workplace norms: “It's like humans are adapting to the norms of the systems versus the other way around. And so, how do we help the users build those boundaries? And the technology adapts to that versus the other way around.” (A11). \n\n\n\n\n\n  §.§.§ Concerns about the Prescriptive Nature of Recommendations\n \n\n\n\nParticipants were concerned that their individual needs could be overlooked by the recommendations provided by the wellbeing app. They pointed out that wellbeing recommendations may fit an overly simplified notion of wellbeing in a workplace context, causing discomfort to the worker who receives the recommendation. In particular, they described how their “workplace wellbeing” may be impacted by personal challenges unrelated to their work and workplace-specific incentives. Yet, wellbeing recommendations may not disambiguate these factors, causing discomfort or other harms to the individual worker. \n\n\nSome workers were concerned that wellbeing-related recommendations might provide suggestions that overlook, or cause tensions with, career-related incentives that may not help with their work performance. For example, A6 described that a recommendation to take a break might be harmful to an employee if their goal is to get promoted; however, it could be valuable if they want to receive help forming a more sustainable working pattern. Without understanding the worker's preference in a given moment, the recommendation in the wellbeing app appeared to assume a preferred tradeoff between their goals for wellbeing versus career progression. \n\n\nMoreover, participants were worried that recommendations might be superficial or ineffective because the wellbeing app cannot delineate whether their problems are caused by workplace-specific versus personal factors. A10 was concerned that in Storyboard , the app might recommend an individual to go back home after work hours when they purposely work overtime as they do not have a happy domestic life at home, exacerbating their domestic life further. This participant contextualized this case with women in India, “women are 35% of our workforce, [..] one of the primary reasons women work in the workplace is to avoid their family issues at home.” \nRelatedly, workers described feelings of discomfort with a wellbeing app that suggests workplace-specific tips for improvement because sensed patterns of lower wellbeing may also be signs of broader or more personal challenges the worker is facing: \n\n \n\n\n“So you're jumping to a solution without knowing the root cause. I might be tired because I'm physically sick, or because my work bores me, or because I have a small baby that's teething, right? It's just could be so many things so. Energizing tips are unlikely to meet the root cause of the problem.” (W6, Storyboard ).\n\n\n \n\n\n\n  §.§.§ Harm from Misalignment between Workers' Perceived Wellbeing and Sensed Wellbeing\n \nParticipants across all the stakeholder groups expressed concerns about seeing wellbeing recommendations that infer an emotional state that misaligns with their own understanding of their wellbeing. For example, participants imagined workers may feel emotional distress from receiving a recommendation similar to that described in Storyboard . Because the wellbeing recommendation pertained to employment-related concerns, W8 described this could cause “panic.” An AI builder similarly described how it might lead to feelings of “gaslighting” from the app:  \n\n  \n\n“[..] If I'm doing well in my job, I would not want an AI to tell me: `Hey, based on your number of completed tasks, [..] you may be struggling with some aspects of your work.' Excuse me, I know I'm doing a good job, and it feels like I'm being gaslit by this technology.” (A2, Storyboard ).\n\n  \n\nSimilarly, another participant described that receiving wellbeing recommendations in a workplace context risks feeling “patronizing” (A5, Storyboard ), given they or other workers may feel capable of identifying their own needs for wellbeing. To mitigate these concerns around providing inappropriate wellbeing recommendations, some participants in all three stakeholder groups suggested that the wellbeing app instead connect them to human-based support so the worker may receive help more collaboratively improving their wellbeing, rather than attempting to give a recommendation itself.  \n \n\n\n§ DISCUSSION\n\nAmidst multiple transitions in the workplace, including remote and hybrid work, organizations are increasingly implementing data-driven technologies that track workers' behaviors and actions. In parallel, this is growing corporate interest in adopting technologies that target the improvement of employees' wellbeing. A recent survey estimates worker wellbeing in the US costs to be ∼20.4 Billion USD in 2021, which is forecasted to grow four-fold in the next five years <cit.>. Existing research and development on wellbeing technologies that use passive sensing have often focused on interactions between the individual user and the technology. However, growing corporate interest in adopting sensing-based wellbeing technologies for the workplace raises new questions about how such technologies may interface with complex organizational structures, interpersonal dynamics, and individual preferences. While there is an emerging line of work shedding light on data subjects' concerns and desires towards various forms of wellbeing-related workplace technologies (e.g., on Emotion AI <cit.>), we lack an in-depth understanding of how various organizational stakeholders envision these technologies may harm or benefit their workplace and selves. \n\nIn this study, we form a systematic understanding of the beneficial and harmful impacts that stakeholders envision at the organizational, interpersonal, and individual levels. To do so, we include participants across multiple roles—from organizational governors who benefit from a higher-level perspective on the governance needs and organizational goals of such technologies to worker data subjects who are often most directly impacted by the deployment of such technologies (yet have the least say in influencing the introduction of emergent technologies). Overall, our findings surface multiple concerns targeting ambiguities and misalignments around 1) the core definition of workplace wellbeing, 2) underlying technical limitations in how well sensing-based technologies can scale to meet individual workplace wellbeing preferences, and 3) inadequate policies and reliance on organizational culture for governing the appropriate use of such technologies. \n\n\n\n\n\nAcross all three layers of organizational, interpersonal, and individual impacts, our findings provide empirical evidence that what constitutes a “workplace wellbeing problem” is not easily definable within an organization, between workers with interpersonal relations, and across individual workers. In our work, participants had varying perspectives on whether certain behaviors and goals (e.g., feeling higher levels of satisfaction while working) were related to what they would define as “workplace wellbeing.” These perspectives may not necessarily be moderated by their role in the workplace; rather, they may be more manifested by individual differences in underlying traits, life experiences, and perceptions. Prior work noted how these data-driven algorithms may not be sensitive to people's life events and may cause harms <cit.>, and <cit.> discussed in the context of digital wellbeing measurement, notions of wellbeing are not easily generalizable and scalable. Likewise, our study suggests assuming certain notions or factors contributing to “workplace wellbeing” through the design of the technology may be undesirable or, worse, harmful to workers who use them. Defining organizational wellbeing targets that do not align with workers' wellbeing goals may also produce misleading outcomes and decisions on how to better support workers. Yet, many existing workplace wellbeing technologies justify their reliance on passive-sensing and algorithmic inference approaches due to their perceived “objectiveness” and scalability, along with their convenience and unobtrusiveness <cit.>. As such, workplace wellbeing sensing technology research has often focused narrowly on a specific wellbeing problem (e.g., sedentary behavior at work, working overtime). However, our findings strongly suggest that the effectiveness of sensing wellbeing is subjective upon an individual's context-specific needs and desires for supporting their wellbeing. Therefore, proxy measures for wellbeing (e.g., relating productivity-related measures) may be socially contestable, failing to meet all individual wellbeing targets if deployed at scale. \n\n\nRelatedly, participants in this study also surfaced the importance of understanding the context surrounding their workplace behaviors and wellbeing needs. This was especially pertinent when considering how their managers may use this information to inform team decisions. Moreover, rather than relying solely on passive sensing technologies for identifying patterns in workers' wellbeing, participants expressed a desire to explore how active participation can support the design of improved wellbeing technologies. On the one hand, there is an opportunity to explore how workers may be empowered through self-reported, qualitative wellbeing documentation. These methods can simultaneously be unobtrusive and relevant while providing workers with additional agency and control over algorithmic inferences. At the same time, however, such technologies should be governed with considerations around how they may increase risks of privacy and anonymity breaches in the workplace. Moreover, prior literature on the privacy paradox <cit.> and empowering resignation <cit.> suggest that enabling greater customizability and control over data collection may in fact lead to increased resignation over data sharing decisions. Future research should explore whether and how personalized wellbeing technologies, combining active and passive mechanisms, could, if at all, help mitigate some worker burdens without exacerbating others. \n\n\nParticipants' concerns in our study surfaced a critical lack of–and need for–regulations that help govern the responsible implementation and use of workplace wellbeing technologies. Even if wellbeing technologies are designed to meet the individual needs and desires of workers, they may be irresponsibly used by those in higher positions of power (e.g., leaders, managers), after deployment. In our study, participants described concerns about how organization-level policies could further disadvantage workers and prioritize organizational needs (e.g., ensuring workers cannot begin lawsuits against the company). Participants also described that workers subjected to these technologies may not always have the leverage within their organization to meaningfully communicate and report when they believe their data is being used unfairly. Our findings suggest that to design truly worker-centered wellbeing technologies, it is not enough to understand workers' needs and concerns towards wellbeing technologies. Rather, it is critical to understand how these technologies may live within a broader socio-ecological context over time. Beyond exploring how worker-centered wellbeing technology could be co-designed with workers, future work should also explore how to engage workers in ideating, designing, and advocating for worker-centered policies and regulations that help ensure deployed technologies are responsibly used and maintained. \n\n\n\n\n\n\n\n\n\n\n\n §.§ Design Implications\n\nWe provide design implications based on our findings, for organizations interested in developing wellbeing technologies and researchers designing or studying these technologies. However, we note that our findings suggest designing truly worker-centered workplace wellbeing technologies governed by organizations may be a wicked problem <cit.>—a goal that is difficult or impossible to solve, in this setting, due to organizational incentive structures and power differentials that may vary widely from workplace-to-workplace. Therefore, we caution that these implications are only appropriate to understand whether and when there is good reason to believe data-driven wellbeing technologies may bring more benefit than harm to workers, in practice. We additionally include implications for how non-technical worker wellbeing support may complement or replace workplace wellbeing technologies. \n\n\n  * Deliberate with impacted stakeholders what notions of “workplace wellbeing” they feel are appropriate and desirable to target through the use of technology, before deciding to move forward with designing. Begin by understanding their workplace boundaries and needs, to form a design space for collaboratively ideating on both potential technical and non-technical solutions. Avoid design ideation driven by the availability of technical capabilities alone. \n\n  * Consider carefully how the design of workplace wellbeing technology may shift responsibility for wellbeing challenges across individuals and the organization. Certain design decisions (e.g., about the types of wellbeing inferences or recommendations) may risk placing unwarranted blame and responsibility on individual workers, as voiced by participants in Sections <ref>, <ref>, <ref>. \n\n  * Ensure that wellbeing technologies are not deployed as a ploy to promote “workplace problem washing,” by considering carefully whether the root problems of workplace wellbeing challenges may be addressable through technology, or should be complemented or replaced by other forms of non-technical, care-based human support. \n\n  * Provide individual workers with the power to decide  whether, when, and  with whom they would like to share any collected wellbeing data. Given that social relations with colleagues, managers, and the organization differ for each individual, workers may have different desires for (not) sharing certain data. Also find ways to ensure that workers have an opportunity to consent and take back consent, using methods that minimize the influences of potential external incentives and pressures (e.g., placed by workers' managers or leadership, as described in Section <ref>). \n\n  * Rather than relying solely on quantitative and passive data collection, consider how qualitative and actively collected data could provide complementary insights to workers while being less prone to causing harms. Qualitative documentation of their wellbeing and related practices may help workers better understand the context surrounding trends in their overall wellbeing, as well as aid the interpretation of data-driven wellbeing inferences. \n\n  * Involve impacted stakeholders, not just in the design of the wellbeing technology, but in informing the policies and regulations that govern the use of the technology. Even if wellbeing technologies are designed to support workers, once deployed in practice, they could still be used in harmful ways if governance mechanisms disadvantage workers (as described in <ref>). Ensure there are infrastructural mechanisms in place that provide workers with opportunities for recourse to potential inappropriate corporate or managerial uses of the technology (e.g., by developing worker unions). \n\n\n\n\n\n\n §.§ Limitations and Future Directions\n\nOur work has limitations, which also suggest interesting future directions. Our work studies and gathers perspectives from information workers, and we cannot make generalized claims about the impact of and perceptions towards sensing technologies for other kinds of work and workplaces. In addition, the design of our study protocol included explaining to participants the objectives of the study, including being transparent about our motives to understand their perspectives on hypothetical and envisioned technologies in the workplace. It is possible that some participants may have had an unconscious bias about implicitly interpreting that the study was about a “product-testing.” This may have led to responses that were over-optimistic about the use of the depicted technologies. Furthermore, the ordering in which the storyboards were shown may have played a role in influencing participants' perceptions (e.g., participants sometimes gave relative responses such as “This storyboard is better than the previous one”). While we shuffled the order of storyboards shown to each participant to help mitigate this risk, that does not eliminate potential problems with relative perception bias. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Worker-centered problem space\n\n\n\n  * ... \n\n\n\n\n  §.§.§ Inference process\n\n\n\n\n  §.§.§ Regulation and organizational culture\n\n\n\n  * ... \n\n\n\n\n\n\n§ CONCLUSION\n \nWorkplace settings surface new complexities that may complicate the in-practice desirability and responsible use of these technologies. Moreover, these technologies implicate a broad range of stakeholders—including those who are impacted by and impact the deployment of, these technologies. In our study, we conducted storyboard-driven interviews with 33 stakeholders across three participant groups: organizational governors, AI builders, and worker data subjects. Grounded by storyboards inspired by prior research literature proposing various wellbeing sensing technologies, we elicited stakeholders' envisioned harmful and beneficial impacts of wellbeing support in the workplace. \n\nWe focused our study on understanding why the workplace settings—with their complex organizational and social structures—surface unique concerns for workers, and how the design of wellbeing technologies may interface with these challenges. Further, we engaged stakeholders in envisioning organizational, social, and technical mitigation strategies to address these concerns. \n\n\n\n\n\n\n\nACM-Reference-Format\n\n\n"}