{"entry_id": "http://arxiv.org/abs/2303.06793v1", "published": "20230313005250", "title": "High Forward Thrust Metasurface Beam-Riding Sail", "authors": ["Prateek R. Srivastava", "Apratim Majumdar", "Rajesh Menon", "Grover A. Swartzlander Jr"], "primary_category": "physics.optics", "categories": ["physics.optics", "physics.space-ph"], "text": "\n\n\n\n\n\n\n\n1Chester F. Carlson Center for Imaging Science, Rochester Institute of Technology, Rochester, NY 14623, USA\n\n2Department of Electrical and Computer Engineering, The University of Utah, Salt Lake City, UT 84112, USA\n\n*grover.swartzlander@gmail.com \n\n\n\n \nThe radiation pressure force and torque on a one-dimensional bi-grating composed of a \nSi-SiO_2 high contrast binary metagrating is analyzed for the purpose of stable beam riding whereupon a high power laser having an expanding Gaussian irradiance distribution propels the grating in outer space, free from gravitational forces.  The binary metagrating structure has been simultaneously optimized to afford high forward thrust, and corrective restoring forces and torques \n\nin the event of small linear and angular disturbances. We demonstrate that stability may be enhanced at the expense of forward thrust.\nThe validity of our metamaterial findings is reinforced owing to good agreements between finite-difference time-domain and finite element numerical methods.  To reduce mass and enhance forward acceleration this laser-driven sail was designed to be free of a stabilizing boom.\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nOptical tweezers or single-beam optical traps are one of the most powerful means of contactless manipulation of nanoscopic/microscopic objects with a very diverse set of applications ranging from biology<cit.> to quantum optomechanics<cit.>. But the promise of optical tweezers to manipulate macroscopic objects of meter-scale has been held in check by the need for a tightly-focused beam that creates a gradient force in a very limited volume and effective distance. By engineering the scattering properties of the objects and the shape of the beam, the dynamics of macroscopic objects may be controlled and used for successful trapping, manipulation, levitation, and even propulsion without the need for a tightly focused beam. Most recently, NASA and Breakthrough Starshot Initiative aim to leverage these radiation pressure forces to propel a meter-scale light sail to the nearest stars with relativistic speeds. Nearly all the stable geometric designs proposed so far in the literature are subprime in three senses: (a) the ability of a conical/spherical/concave/convex sail to maintain its shape is questionable (b) a flat diffractive/nanophotonic design demands an undesirable mast to offset the center of mass away from the sail to achieve stability <cit.> and (c) all the designs sacrifice on thrust force for levitation/propulsion to enable a restoring force for stability.\n\nIn this work, we demonstrate the stability of a bi-grating lightsail comprised of subwavelength unit-cells of Si/SiO_2. The unit-cell geometry is optimized to engineer diffraction efficiencies such that the sail is stable against linear and rotational perturbation without any offset between the center of mass and the sail while simultaneously achieving maximum forward thrust. This work is different from <cit.> in the sense: (1) forward thrust is also an objective of optimization (2) a stability basin is compared between two different forward thrusts that quantify the trade-off between forward thrust and stable initial conditions. What's more, the forces and torque are validated using FEM (MEEP) and FDTD (COMSOL) methods. The two-dimensional dynamical analysis and electromagnetic response presented in this work may be extended into three dimensions using the scheme described in <cit.>.\n\n\n\n\n\n§ THEORY\n\n\n\n\nConsider the structure shown in Fig.<ref> composed of two different panels L (left) and R (right) of length ℓ. Each panel is comprised of an artificially designed sub-wavelength periodic lattice whose properties primarily arise from the design and distribution of meta-atoms or unit cells. Inspired by the principles of form birefringence and effective medium theory, the unit-cell of choice in this work is a ridge-width-modulated high contrast grating with Si nano-pillars on a low index SiO_2 substrate. As shown in Fig.<ref> (inset) is a multi-layer subwavlength binary unit-cell of period Λ. High-index Si nanopillars of height h_1=h_2 are deposited on low-index SiO_2 substrate of thickness t. The width and position of the nanopillar is w_1,2 and p_1,2 respectively. There exist multiple benefits to using this subwavelength binary design: (a) this design has been shown to offer stable levitation <cit.>, (b) optimal thermal management via radiative cooling <cit.>, and (c) the feature sizes may be easily realized with existing e-beam lithography technology\n\nThe bi-grating may levitate or propel when illuminated owing to radiation pressure forces. To model these forces, it\nis convenient to consider two different frames of\nreference: (x̂, ẑ) and (p̂, n̂)\nattached to the laser and bi-grating respectively. The  bi-grating has a total mass M (including a payload) \nand the center of the bi-grating coincides with \n the center of mass of the system at x_cm such that there is no offset between the two. The two coordinate spaces are related to each other as p = (x - x_cm)/cosΘ where Θ \n= -θ_i is the attitude of the sail rotated about \nŷ and θ_i is the angle of the beam \nincident on the bi-grating.\n\nThe meta-atoms offer exceptional control of wavefront and scattering response near their resonance, which may be engineered for desired force and torque on the bi-grating structure. Assuming a non-relativistic non-spinning bi-grating, the incident and scattered wavelengths are equal in the reference frame of the structure, and thus, the respective wave vectors may be expressed \nk⃗_i= kn̂ and \nk⃗_m^L,R= k (cosθ_m^L,R n̂ + sinθ_m^L,R p̂), where k = 2π/λ.  The diffraction angles are governed by the grating equation,\n\n    sinθ^L,R_t_m= -sinθ^L,R_r_m = m𝕂^L,R - sinΘ\n\nwhere and 𝕂^L,R is the grating momentum such that 𝕂^L=-𝕂^R and (θ^L,R_t_m , θ^L,R_r_m) are the diffraction angles for the m^th (transmitted, reflected) orders. The change in photon momentum Δk^L,R=(k_i-k_m^L,R)/k_i in the reference frame of unit-cell may now be expressed \n\n    Δk^L,R(Θ) = -sinΘ p̂ + cosΘ n̂  -  ∑_m=-1^m=1   (η^L,R_r_msinθ^L,R_r_m +  η^L,R_t_msinθ^L,R_t_m )p̂\n       - (η^L,R_r_mcosθ^L,R_r_m + η^L,R_t_mcosθ^L,R_t_m) n̂\n\nwhere η^L,R_r_m, t_m is the diffraction efficiency of m^th reflected(r) or transmitted(t) modes from corresponding panels (L,R). \nAlternatively, the change in photon momentum may also be expressed \n\n    Δk^L,R(Θ) = 1/P_0/c( ∫_∂ S T_ij·n̂ dA + ∫_∂ S T_ij·p̂ dA )\n\nwhere T_ij the Maxwell Stress Tensor expressed as.\n\n    T_ij = ϵ_0(E_iE_j - 1/2|𝐄|^2 δ_ij) + 1/μ_0(B_iB_j - 1/2|𝐁|^2 δ_ij)\n\nwhere E and B are electric and magnetic field respectively, mu_0 and epsilon_0 are permeability and permittivity of free space and δ_ij is the kronecker delta function. \n\nThe bi-grating may experience force and torque when illuminated by a laser beam of peak power P_0, wavelength λ<<L, characteristic beam-width 2w_0, and a Gaussian irradiance distribution \n\n    I(p) = P_0/2w_0^2√(π/2)cosΘexp( -2( pcosΘ + x_cm)^2/w_0^2)\n\nand the force F^L,R and torque N⃗^L,R of each panel may now be expressed\n\n\n    F^L(p,Θ) = ∫_-ℓ^0 I(p)/cΔk^L dp   &  F^R(p,Θ) = ∫_0^ℓI(p)/cΔk^L dp\n\n\n    N^L(p,Θ) = ∫_-ℓ^0 p p̂×I(p)/cΔk^L dp   &  N^R(p,Θ) = ∫_0^ℓ p p̂×I(p)/cΔk^R dp\n\n\n\nsuch that the transverse (F_x) and longitudinal (F_z) forces in the reference frame of the beam may be expressed \n\n\n    F_x = (F_p^LcosΘ + F_p^RcosΘ+ F_n^LsinΘ + F_n^RsinΘ)x̂\n\n\n    F_z = (F_n^LcosΘ + F_n^RcosΘ - F_p^LsinΘ - F_p^RsinΘ )ẑ\n\n\nand the torque is the same in both the frames of reference.\n\nThe non-spinning two-dimensional system described above entails 3 degrees of freedom: translation along x̂ and rotation about ŷ while it is propelled along ẑ. We define a state vector 𝐱 = [x, θ]^T to analyze the stable transverse dynamics of the bi-grating system. In a close analogy of a oscillating spring system, the transverse dynamics of the bi-grating may be linearized and expressed as a set of ordinary differential equations (ODE) 𝐱̈ = -K𝐱, where K is a Jacobian with stiffness coefficients\n\n    K = [ k_1 k_2; k_3 k_4 ] = [   1/M∂ F_x/∂ x    1/M∂ F_x/∂Θ; 1/J_y∂ N_y/∂ x  1/J_y∂ N_y/∂Θ ]_e\n\nwhere the coefficients are evaluated in the close proximity of equilibrium point 𝐱_e = [0,0]^T, implied by e. The metasurface is said to be marginally stable if Im(𝐞𝐢𝐠(K)) = 0 and Re(𝐞𝐢𝐠(K))<0 i.e., only real eigenvalues are allowed such that the frequencies of oscillation are real. In general, the system will exhibit two stable oscillation frequencies ω_1,2 = √(-Re(𝐞𝐢𝐠(K)))/2π Hz. Note that, we add no restrictions on the nature of the stiffness coefficients, they can either be positive or negative.\n\nWe may conclude from Eq.<ref> and Eq.<ref> that it is possible to engineer a unit-cell geometry that simultaneously high forward thrust and stability against small perturbation. However, the forces depends on η and analytically characterizing the diffraction efficiencies is very difficult except for simpler geometries. For the aforementioned unit-cell, rigorous diffraction theory must be applied. We make use of an FDTD based package in Python called MEEP <cit.> to solve for Maxwells Equation. The boundary conditions are assumed to be PML (Bloch periodic) along n̂(p̂) . To account for fabrication constraints and numerical dispersion problem in FDTD, we limit our resolution to a step size of 20 nm or 50 pixels per micron. When an in-the plane polarizatied light of wavelength λ is incident on the structure, the simulation is ran until the fields have decayed to 10^-6 of their peak value. A similar FEA simulation is performed in COMSOL to validate the results from MEEP. The problem may now be formulated in terms of a multi-objective optimization problem i.e., for the set of variables (Λ, h, p_1,2, w_1,2) along with Si (n=3.5220) /SiO_2 (n=1.4582), we are seeking a sail design with with two figures of merit (FOM): (a) FOM_1 = Im(𝐞𝐢𝐠(K)) is minimized until it is 0 and (b) the forward thrust F_z/F_0 is maximized, where F_0 = 2P_0/c.\nThe optimization is performed using a genetic algorithm called NSGA-II <cit.> for the bi-grating-beam system for the following parameters: L=1, w_0=0.5L, λ=1.2 μm, M=1 gm, and P_0=10 kW.  \n\n\n  \n\n\n\n\n\n\n§ RESULT & ANALYSIS\n\nSince, this is a multi-objective optimization problem, there is no single solution. Instead, there exist many solutions that are Pareto-optimal i.e., lie at the optimal trade-off between two competing objectives. From the multiple Pareto-optimal solutions that were achieved, selected some fabrication-friendly designs shown in Table <ref>. The diffraction efficiency of both the unit-cell geometries comprising the left panel is evaluated using MEEP(FDTD) and COMSOL(FEA) and is shown in Fig.<ref>(a) and (b) as the function of incident angle. An excellent agreement is evident between the two methods. The change in photon momentum δK(θ) is evaluated using both diffraction efficiency and Maxwell stress tensor and an excellent agreement between the two may be seen in Fig.<ref>(c) and (d). Clearly both the structure have very high reflectance that enables high forward thrust and hence Δ k^L_z, whereas a non-zero  Δ k^L_x enables restoring stable force for non-equilibrium positions, as shown in Fig.<ref>(c) and (d). \n\n\n\n\n\n\n\n\n\nThe total force and torque on the bi-grating, however, is the result of the individual response of each panel with respect to the beam center. Thus, the force and torque are the functions of both angle and displacement from the equilibrium point. Shown in Fig.<ref> is the force and torque on the bi-grating for both the structures assuming an expanded filling (w_0=ℓ) and non-expanded underfilling (w_0=0.5ℓ) beam. It is evident from the figure the restoring force and torque are linear for small perturbations from the equilibrium point and the slope of these curves correspond to Jacobians as described in Eq.<ref> for Linear stability analysis purposes. \n\n\n\nLinear stability analysis however provides only a partial picture of stability i.e., the stability of the system for very small perturbations near the equilibrium point. And hence the equations of motion must be solved using numerical methods like Runge-Kutta to fully gain an understanding of system stability. For an initial perturbation of (δ x/ℓ = 0.01, δθ = 0.01 rad, δx/ℓ = 0, δθ = 0), the equations of motion are solved for the two geometries and two different beam width w_0=0.5ℓ and w_0=ℓ. The results are shown in Fig.<ref>. The phase maps for all the cases are closed, suggesting a stable system. Please note, these simulations were performed for P_0=10kW and for a gigawatt class laser as proposed in Breakthrough Starshot system will remain closed and bounded albeit the frequency of oscillation will be scaled accordingly. \n\nThe above simulation is repeated for a range of initial conditions to test the limits of stability and is shown in Fig.<ref>. It is evident from Fig.<ref>(A) and (B), an increase in forward thrust from 120% to 170% leads to 3.4% shrinkage in stable basin for an underfilling beam-width. Similar behavior may be observed for an expanding beam Fig.<ref>(C) and (D) i.e., high forward thrust implies sacrifice on permissible stable conditions. However, the expanded beam imparts lower forward thrust than the non-expanded underfilling beam.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n§ CONCLUSION\n\nIn conclusion, we designed, optimized, and cross-validated a rigid bi-grating light sail for stability and thrust. We proposed two different geometries with two different forward thrust forces while quantifying the bounds of stable initial conditions. The sail is stable for both underfilling and expanded filling beams. The design thus is an excellent choice for applications such as levitated optomechanics of millimeter/centimeter-scale objects or laser propelled meter scaled light sail for space missions limited to the solar systems. As a final remark, significant practical challenges exist in the realization of these sails. For example,  the design is very sensitive to wavelength and becomes unstable for Doppler-shifted wavelength in the case of relativistic sails of Breakthrough Starshot. If a tunable phased-array laser becomes a reality, the proposed design becomes an ideal choice. Moreover, the non-rigidity of the light sail must be considered and modeled using Lagrangian mechanics <cit.>. Similarly, the local deformation of the all-dielectric thin sail may be optimized and modeled using the principles of conformal metasurfaces <cit.>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFundingNASA Headquarters (80NSSC19K0975); Breakthrough Prize Foundation (7dBPF Starshot LLC).\n\n\n\nDisclosures The authors declare no conflicts of interest.\n\nData availability Data underlying the results presented in this paper are not publicly available at this time but may be obtained from the authors upon reasonable request.\n\n\n\n\n"}