{"entry_id": "http://arxiv.org/abs/2303.06789v2", "published": "20230313002531", "title": "On the width of complicated JSJ decompositions", "authors": ["Kristóf Huszár", "Jonathan Spreer"], "primary_category": "math.GT", "categories": ["math.GT", "cs.CG", "57Q15, 57N10, 05C75, 57M15", "F.2.2; G.2.2"], "text": "\n\n\nBeyond Single Items: Exploring User Preferences in Item Sets with the Conversational Playlist Curation Dataset\n\n    Filip Radlinski\n    March 30, 2023\n================================================================================================================\n\n\n\n\nMotivated by the algorithmic study of 3-dimensional manifolds, we explore the structural relationship between the JSJ decomposition of a given 3-manifold and its triangulations. Building on work of Bachman, Derby-Talbot and Sedgwick, we show that a “sufficiently complicated” JSJ decomposition of a 3-manifold enforces a “complicated structure” for all of its triangulations. More concretely, we show that, under certain conditions, the treewidth (resp. pathwidth) of the graph that captures the incidences between the pieces of the JSJ decomposition of an irreducible, closed, orientable 3-manifold  yields a linear lower bound on its treewidth   (resp. pathwidth ), defined as the smallest treewidth (resp. pathwidth) of the dual graph of any triangulation of .\n\nWe present several applications of this result. We give the first example of an infinite family of bounded-treewidth 3-mani­folds with unbounded pathwidth. We construct Haken 3-mani­folds with arbitrarily large treewidth—previously the existence of such 3-manifolds was only known in the non-Haken case. We also show that the problem of providing a constant-factor approximation for the treewidth (resp. pathwidth) of bounded-degree graphs efficiently reduces to computing a constant-factor approximation for the treewidth (resp. pathwidth) of 3-manifolds. \n\n\n\n\n§ INTRODUCTION\n\n\n\nManifolds in geometric topology are often studied through the following two-step process. Given a piecewise linear d-dimensional manifold , first find a “suitable” triangulation of it, i.e., a decomposition of  into d-simplices with “good” combinatorial properties. Then apply algorithms on this triangulation to reveal topological information about .\n\nThe work presented in this article is motivated by this process in dimension d=3. Here every manifold can be triangulated <cit.> and questions about them typically admit algorithmic solutions <cit.>.[In higher dimensions none of these statements is true in general. See, e.g., <cit.>, <cit.> or <cit.>.] At the same time, the feasibility of a particular computation can greatly depend on structural properties of the triangulation in use.\nOver the past decade, this phenomenon was recognized and exploited in various settings, leading to fixed-parameter tractable (FPT) algorithms for several problems in low-dimensional topology, some of which are even known to be NP-hard <cit.>.[See <cit.> for an FPT algorithm checking tightness of (weak) pseudomanifolds in arbitrary dimensions.] Although these algorithms have exponential running time in the worst case, for input triangulations with dual graph of bounded treewidth they always terminate in polynomial (in most cases, linear) time.[The running times are given in terms of the size of the input triangulation, i.e., its number of tetrahedra.] Moreover, some of them have implementations that are highly effective in practice, providing useful tools for researchers in low-dimensional topology <cit.>.\n\nThe theoretical efficiency of the aforementioned FPT algorithms crucially depends on the assumption that the dual graph of the input triangulation has small treewidth. To understand their scope, it is thus instructive to consider the treewidth  of a compact 3-manifold , defined as the smallest treewidth of the dual graph of any triangulation of . Indeed, the relation between the treewidth and other quantities associated with 3-manifolds has recently been investigated in various contexts <cit.>. For instance, in <cit.> together with Wagner we have shown that the treewidth of a non-Haken 3-manifold is always bounded below in terms of its Heegaard genus. Combined with earlier work of Agol <cit.>—who constructed non-Haken 3-manifolds with arbitrary large Heegaard genus—this implies the existence of 3-manifolds with arbitrary large treewidth. Despite the fact that, asymptotically, most triangulations of most 3-manifolds must have dual graph of large treewidth <cit.>, this collection described by Agol has remained, to this date, the only known family of 3-manifolds with arbitrary large treewidth.\n\n\n\n    The main result\n In this work we unravel new structural links between the triangulations of a given 3-manifold and its JSJ decomposition <cit.>. Employing the machinery of generalized Heegaard splittings <cit.>, the results developed in <cit.>, and building on the work of Bachman, Derby-Talbot and Sedgwick <cit.>, we show that, under suitable conditions, the dual graph of any triangulation of a given 3-manifold  inherits structural properties from the decomposition graph that encodes the incidences between the pieces of the JSJ decomposition of . More precisely, in <Ref> we prove the following theorem.\n\n\nFor any closed, orientable and irreducible 3-manifold  with sufficiently complicated[The notion of “sufficiently complicated” under which we establish Theorem <ref> is discussed in <Ref>.] torus gluings in its JSJ decomposition , the treewidth and pathwidth of  and that of the decomposition graph () of  satisfy\n\n\n\n[b].425\n\n    ()≤ 18·(+1)\n\n[b].1\n  and\n[b].425\n\n    ()≤ 4·(3+1).\n\n\n\n\n\n\n    An algorithmic construction\n Much work in 3-dimensional topology has been devoted to the study of 3-manifolds constructed by pasting together simpler pieces along their boundary surfaces via “sufficiently complicated” gluing maps, and to understand how different decompositions of the same 3-manifold interact under various conditions, see, e.g., <cit.>.\n<Ref> allows us to leverage these results to construct 3-manifolds, where we have tight control over the treewidth and pathwidth of their triangulations <cit.>.\n\nBy combining <Ref> and <cit.> (cf. <cit.>), in <Ref> we prove the following result.\n\n\n\n\nThere is a polynomial-time algorithm that, given an n-node graph G with maximum node-degree , produces a triangulation _G of a closed 3-manifold _G, such that\n\n\t\n  * the triangulation _G contains O_(G· n) tetrahedra,[Similar to the standard big-O notation, O_(x) means “a quantity bounded above by x times a constant depending on Δ.” To ensure that eq:tw-inherit is satisfied, but not necessarily eq:pw-inherit, O_(G· n) tetrahedra suffice.] \n\t\n  * the JSJ decomposition 𝒟 of _G satisfies (𝒟) = G, and  \n\t\n  * there exist universal constants c,c'>0, such that\n\t\n\t\t\n  * (c / ) _G≤G≤ 18·(_G+1), and \n\t\t\n  * (c' / ) _G≤G≤ 4·(3_G+1). \n\t\n\n\n\n\n\n\n\n    Applications\n In <Ref> we present several applications of <Ref>. First, we construct a family of bounded-treewidth 3-manifolds with unbounded pathwidth (<Ref>). Second, we exhibit Haken 3-manifolds with arbitrary large treewidth (<Ref>). To our knowledge, no such families of 3-manifolds had been known before. Third, we show that the problem of providing a constant-factor approximation for the treewidth (resp. pathwidth) of bounded-degree graphs reduces in polynomial time to computing a constant-factor approximation for the treewidth (resp. pathwidth) of 3-manifolds (<Ref>). This reduction, together with previous results <cit.>, suggests that this problem may be computationally hard. \n\n\n\nWe now give a preview of the proof of our main result. As the arguments for showing (<ref>) and (<ref>) are analogous, we only sketch the proof of (<ref>). To show that ()≤ 18(+1), we start with a triangulation  of  whose dual graph has minimal treewidth, i.e., () =. Following <cit.>, we construct from  a generalized Heegaard splitting  of , together with a sweep-out ={_x : x ∈ H} along a tree H, such that the genus of any level surface _x is at most 18·(()+1). If  is not already strongly irreducible, we repeatedly perform weak reductions until we get a strongly irreducible generalized Heegaard splitting ' with associated sweep-out '={'_x : x ∈ H} along the same tree H. Crucially, weak reductions do not increase the genera of level surfaces <cit.>, thus 18·(()+1) is still an upper bound on those in '. Now, by the assumption of the JSJ decomposition of  being “sufficiently complicated,” each JSJ torus can be isotoped in  to coincide with a connected component of some thin level of '. This implies that, after isotopy, each level set '_x is incident to at most 18·(()+1)+1 JSJ pieces of . Sweeping along H, we can construct a tree decomposition of () where each bag contains at most 18·(()+1)+1 nodes of (). Hence ()≤ 18·(()+1) = 18·(+1).\n\n\n\n\n    Organization of the paper\n In <Ref> we review the necessary background on graphs and 3-manifolds. <Ref> contains a primer on generalized Heegaard splittings, which provides us with the indispensable machinery for proving our main result (<Ref>) in <Ref>. In <Ref> we describe the algorithmic construction of 3-manifolds that “inherit” their combinatorial width from that of their JSJ decomposition graph (<Ref>). Then, in <Ref> we present the aforementioned applications of this construction (<Ref>). The paper is concluded with a discussion and some open questions in <Ref>. Selected results from 3-manifold topology we rely on are collected in the [app]Appendix.\n\n\n\n§ PRELIMINARIES\n\n\n\n\n\n §.§ Graphs\n\n \n\nA (multi)graph G=(V,E) is a finite set V=V(G) of nodes[Throughout this paper we use the terms edge and vertex to refer to an edge or vertex in a 3-manifold triangulation, whereas the terms arc and node denote an edge or vertex in a graph, respectively.] together with a multiset E=E(G) of unordered pairs of not necessarily distinct nodes, called arcs. The degree d_v of a node v ∈ V equals the number of arcs containing it, where loop arcs are counted twice. G is k-regular, if d_v = k for all v ∈ V. A tree is a connected graph with n nodes and n-1 arcs. \n\nA tree decomposition of a graph G=(V,E) is a pair (𝒳={B_i:i ∈ I},=(I,F)) with bags B_i ⊆ V and a tree =(I,F), such that\n \n\t\n  * ⋃_i ∈ I B_i = V (node coverage),\n\t\n  * for all arcs {u,v}∈ E, there exists i ∈ I such that {u,v}⊆ B_i (arc coverage), and\n\t\n  * for all v ∈ V, T_v = {i ∈ I:v ∈ B_i} spans a connected sub-tree of  (sub-tree property).\n\nThe width of a tree decomposition equals max_i ∈ I|B_i|-1, and the treewidth G is the smallest width of any tree decomposition of G. Replacing all occurrences of “tree” with “path” in the definition of treewidth yields the notion of pathwidth G. We have G≤G.\n\n\n\n §.§ Manifolds\n\n\n\nA d-dimensional manifold is a topological space , where each point x ∈ has a neighborhood homeomorphic to ℝ^d or to the closed upper half-space {(x_1,…,x_d) ∈ℝ^d : x_d≥ 0}. The latter type of points of  constitute the boundary ∂ of . A compact manifold is said to be closed if it has an empty boundary. We consider manifolds up to homeomorphism (“continuous deformations”) and write _1 ≅_2 for homeomorphic manifolds _1 and _2.\n\n\n\n  \n*3-Manifolds and surfaces\n\n\nThe main objects of study in this paper are 3-dimensional manifolds, or 3-manifolds for short. Here we give a brief introduction to 3-manifolds tailored to our purposes. We refer the reader to <cit.> (and the references therein) for more details. All 3-manifolds and surfaces encountered in this article are compact and orientable.\nWe let _g denote the closed, connected, orientable surface of genus g. We also refer to the d-dimensional torus and sphere as ^d and d, respectively (hence _0 = 2 and _1 = ^2). The genus g() of a (not necessarily connected) surface  is defined to be the sum of the genera of its connected components. \n\n\n\n    Triangulations and the treewidth of 3-manifolds\n A triangulation  of a given 3-manifold  is a finite collection of abstract tetrahedra glued together along pairs of their triangular faces, such that the resulting space is homeomorphic to . Unpaired triangles comprise a triangulation of the boundary of . Note that the face gluings may also identify several tetrahedral edges (or vertices) in a single edge (or vertex) of . Every compact 3-manifold admits a triangulation <cit.> (cf. <cit.>). Given a triangulation , its dual graph () is the multigraph whose nodes correspond to the tetrahedra in , and arcs to face gluings (<Ref>).\n\n\n\nFor a compact 3-manifold , its treewidth  (resp. pathwidth ) is defined as the smallest treewidth (resp. pathwidth) of the dual graph of any triangulation of .\n\n\n\n    Incompressible surfaces and essential disks\n Given a 3-manifold , a surface ⊂ is said to be properly embedded in  if ∂⊂∂ and (∖∂) ⊂ (∖∂). Given a properly embedded surface ⊂, an embedded disk D⊂ with  int(D) ∩ = ∅ and ∂ D ⊂ a curve not bounding a disk on  is called a compressing disk. If such a disk exists,  is said to be compressible in , otherwise – and if  is not a 2-sphere – it is called incompressible. A 3-manifold  is said to be irreducible, if every embedded 2-sphere bounds a 3-ball in . A disk D ⊂ properly embedded in a 3-manifold  is called inessential if it cuts off a 3-ball from , otherwise D is called essential. A compact, orientable, irreducible 3-manifold is called Haken if it contains an orientable, properly embedded, incompressible surface, and otherwise is referred to as non-Haken.\n\n\n\n    Heegaard splittings of closed 3-manifolds\n A handlebody  is a connected 3-manifold homeomorphic to a thickened graph. The genus g() of  is defined as the genus of its boundary surface ∂.  A Heegaard splitting of a closed, orientable 3-manifold  is a decomposition = ∪_' where  and ' are homeomorphic handlebodies with ∪' = and ∩' = ∂ = ∂' = called the splitting surface. Introduced in  <cit.>, the Heegaard genus  of  is the smallest genus g() over all Heegaard splittings of .\n\n\n\n    The JSJ decomposition\n A central result by Jaco–Shalen <cit.> and Johannson <cit.> asserts that every closed, irreducible and orientable 3-manifold  admits a collection 𝐓 of pairwise disjoint embedded, incompressible tori, where each piece of the complement ∖𝐓 is either Seifert fibered[See <cit.> or <cit.> for an introduction to Seifert fibered spaces (cf. <Ref>).] or atoroidal[An irreducible 3-manifold  is called atoroidal if every incompressible torus in  is boundary-parallel.]. A minimal such collection of  tori is unique up to isotopy and gives rise to the so-called JSJ decomposition (or torus decomposition) of  <cit.>. We refer to this collection of incompressible tori as the JSJ tori of . The graph with nodes the JSJ pieces, and an arc for each JSJ torus (with endpoints the two nodes corresponding to its two adjacent pieces) is called the dual graph () of the JSJ decomposition  of .\n\n\n\n§ GENERALIZED HEEGAARD SPLITTINGS\n\n\n\nA Heegaard splitting of a closed 3-manifold is a decomposition  into two identical handlebodies along an embedded surface. Introduced by Scharlemann and Thompson <cit.>, a generalized Heegaard splitting of a compact 3-manifold  (possibly with boundary) is a decomposition of  into several pairs of compression bodies along a family of embedded surfaces, subject to certain rules. Following <cit.>,[For an open-access version, see <cit.>.] here we give an overview of this framework.\n\n\n\n §.§ Compression bodies and forks\n\n\nA compression body  is a 3-manifold with boundary obtained by the following procedure. \n\t\n  * Consider the thickening × [0,1] of  a closed, orientable, possibly disconnected surface ,\n\t\n  * optionally attach some 1-handles, each being of the form D × [0,1] (thickened edge, where the disk D is the cross-section), to ×{1} along D×{0}∪ D×{1}, and\n\t\n  * optionally fill in some collection of 2-sphere components of ×{0} with 3-balls.\n\nWe call ∂_- = ×{0}∖{filled-in 2-sphere components} the lower boundary of  and ∂_+ = ∂ ∖∂_- its upper boundary. By construction, g(∂_+) ≥ g(∂_-). Note that, if ∂_- is empty, then  is a handlebody. We allow compression bodies to be disconnected.\n\nA fork, more precisely an n-fork,  is a tree with n+2 nodes V()={,,_1,…,_n}, where , called the root, is of degree n+1, and the other nodes are leaves. One of them, denoted , is called the grip, and the remaining leaves _1,…,_n are called tines. A fork can be regarded as an abstraction of a connected compression body , where the grip corresponds to ∂_+ and each tine corresponds to a connected component of ∂_-, see, e.g., <Ref>.\n\n\n\n\n\n    Non-faithful forks\n In certain situations (notably, in the proof of <Ref>, cf. <Ref>) it is useful to also take a simplified view on a generalized Heegaard splitting. To that end, one may represent several compression bodies by a single non-faithful fork, where the grip and the tines may correspond to collections of boundary components. To distinguish faithful forks from non-faithful ones, we color the roots of the latter with gray, see <Ref>.\n\n\n\n\n0.55\n\t[scale=.9]faithful-forks\n\t\t(57.5,29.85) \n\t\n\tfigureTwo faithful forks bundled into a non-faithful fork. The colors show the grouping of the tines.\n\t\n0.36\n\t[scale=.9]compbody-spine\n\t\t(47.25,40.25) Γ\n\t\t(-10,1) \n\t\t(102,1) \n\t\n\tfigureSpines of a compression body  and of a handlebody .\n\t\n\n\n\n\n\n    Spines and sweep-outs of compression bodies\n A graph Γ embedded in a compression body  is called a spine of , if every node of Γ that is incident to ∂_- is of degree one, and ∖ (Γ∪∂_-) ≅∂_+× (0,1], see <Ref>. Assume first that ∂_-≠∅. A sweep-out of  along an interval, say [-1,1], is a continuous map f→[-1,1], such that f^-1(±1) = ∂_±,\n\n    f^-1(t) ≅∂_+,    if-t ∈ (0,1),\n    Γ∪∂_-,    if-t=0, and\n    ∂_-,    if-t ∈ (-1,0).\n\nWriting Σ_t = f^-1(t), we get a 1-parameter family of surfaces (except for Σ_0) “sweeping through” . For handlebodies, the definition of a sweep-out is similar, but it “ends at 0” with the spine: f^-1(1) = ∂, f^-1(t) ≅∂ if t ∈ (0,1), and f^-1(0) = Γ, see <Ref>.\n\n\n\n\n\nIt is straightforward to adapt the definition of sweep-out in a way that, instead of an interval, we sweep a compression body  along a (faithful or non-faithful) fork . Such a sweep-out is a continuous map f→ (where  denotes a geometric realization of ) that satisfies very similar requirements to those in (<ref>), however, the components of the lower boundary ∂_- may appear in different level sets, see <Ref>.\n\n\n\n\n\n\n §.§ Generalized Heegaard splittings and fork complexes\n\n\n\n\n    Heegaard splittings revisited\n Let  be a 3-manifold, and {∂_1, ∂_2} be a partition of the components of ∂. A Heegaard splitting of (, ∂_1, ∂_2) is a triplet (_1, _2, ), where _1 and _2 are compression bodies with _1 ∪_2 =, _1 ∩_1 = ∂_+_1=∂_+_2 =, ∂_-_1 = ∂_1, and ∂_-_2 = ∂_2. The genus of the Heegaard splitting (_1, _2,) is the genus g() of the splitting surface . The Heegaard genus  of  is the smallest genus of any Heegaard splitting of (, ∂_1, ∂_2), taken over all partitions {∂_1, ∂_2} of ∂.\n\n\n\n For any partition {∂_1, ∂_2} of the boundary components of , there exists a Heegaard splitting of (, ∂_1, ∂_2).\n\n\n\n\n\n    Generalized Heegaard splittings\n A generalized Heegaard splitting  of a 3-manifold  consists of\n\n\t\n  * a decomposition = ⋃_i ∈ I_i into submanifolds _i ⊆ intersecting along closed surfaces (<Ref>),\n\t\n  * for each i ∈ I a partition {∂_1_i, ∂_2_i} of the components of ∂_i  that together satisfy an acyclicity condition: there is an ordering, i.e., a bijection ℓ I →{1,…,|I|}, such that, for each i ∈ I the components of ∂_1_i (resp. ∂_2_i) not belonging to ∂ are only incident to submanifolds _j with ℓ(j) < ℓ(i) (resp. ℓ(j) > ℓ(i)), and\n\t\n  * a choice of a Heegaard splitting (^(i)_1, ^(i)_2, _i) for each (_i, ∂_1_i, ∂_2_i).\n Such a choice of splitting surfaces _i (i ∈ I) is said to be compatible with ℓ, see, e.g., <Ref>.\n\n\n\nJust as compression bodies can be represented by forks, (generalized) Heegaard splittings can be visualized via fork complexes, see <Ref> (cf. <cit.> for details).\n\n\n\n    Sweep-outs of 3-manifolds\n\nA generalized Heegaard splitting  of a 3-manifold  induces a sweep-out f→ of  along any fork complex  that represents  (here  denotes a drawing, i.e., a geometric realization of the abstract fork complex ) by concatenating the corresponding sweep-outs of the compression bodies that comprise  (cf. <Ref>). We also refer to a sweep-out f→ by the ensemble ={_x : x ∈} of its level sets, where Σ_x = f^-1(x).\n\n\n\n    The width of a generalized Heegaard splitting\n\n\nFor a generalized Heegaard splitting , the surfaces _i (i ∈ I) are also called the thick levels, and the lower boundaries ∂_-^(i)_1, ∂_-^(i)_2 are called the thin levels of . The width () of  is the sequence obtained by taking a non-increasing ordering of the multiset {g(_i) : i ∈ I} of the genera of the thick levels.\n\nA generalized Heegaard splitting  of a 3-manifold  for which () is minimal with respect to the lexicographic order (<) among all splittings of  is said to be in thin position.\n\n\n\n §.§ Weak reductions\n\n\n\nA Heegaard splitting (_1,_2,) of a connected 3-manifold is said to be weakly reducible <cit.>, if there are essential disks D_i ⊂_i (i=1,2)[The assumption that D_i is essential in the compression body _i implies that ∂ D_i ⊂∂_+_i = (i=1,2).] with ∂ D_1 ∩∂ D_2 = ∅, see <Ref>. In this case we also say that the splitting surface  is weakly reducible. A generalized Heegaard splitting  is weakly reducible, if at least one of its splitting surfaces is weakly reducible; otherwise  is called strongly irreducible. Every 3-manifold possesses a strongly irreducible generalized Heegaard splitting and this fact can be exploited in various contexts (e.g., in the proof of <Ref>). The usefulness of such splittings is mainly due to the following seminal result.\n\n\nLet  be a strongly irreducible generalized Heegaard splitting. Then every connected component of every thin level of  is incompressible.\n\n\nGiven a weakly reducible generalized Heegaard splitting  with a weakly reducible splitting surface[For future reference we remind the reader that splitting surfaces, also called thick levels, correspond to grips in the faithful fork complex that represents the generalized Heegaard splitting .]   and essential disks D_1 and D_2 as above, one can execute a weak reduction at . This modification amounts to performing particular cut-and-paste operations on  guided by D_1 and D_2, and decomposes each of the two compression bodies adjacent to  into a pair of compression bodies. Importantly, this operation results in another generalized Heegaard splitting ' of the same 3-manifold with (') < ().\n\nWe illustrate weak reductions via <Ref> and refer to <cit.> for further details (notably, Figures 5.8–5.13 therein, but also Lemma 5.2.2, Figures 5.6 and 5.7, and Proposition 5.2.4), including an exhaustive list of instances of weak reductions.[In the open-access version <cit.> these are Proposition 4.2.3 and Figures 87–92 (as well as Lemma 4.2.2, Figures 85 and 86, and Lemma 4.2.4).]\n\n\n\n\n\n§ THE MAIN RESULT\n\n\n\nIn this section we prove Theorem <ref>. The inequalities (<ref>) and (<ref>) are deduced in the same way, thus we only show the proof of (<ref>) in detail, and then explain how it can be adapted to that of (<ref>). First, we specify what we mean by a “sufficiently complicated” JSJ decomposition.\n\n\n\nGiven δ > 0, the JSJ decomposition of an irreducible 3-manifold  is δ-complicated, if any incompressible or strongly irreducible Heegaard surface ⊂ with genus g() ≤δ can be isotoped to be simultaneously disjoint from all the JSJ tori of .\n\n\n\nOur goal is to prove that ()≤ 18(+1), where () is the dual graph of the δ-complicated JSJ decomposition of the irreducible 3-manifold . To this end, we set δ=18(+1) and fix a triangulation  of , whose dual graph () has minimal treewidth, i.e., () =. Now, (<ref>) is established in four stages.\n\n[1. Setup]\nBy invoking the construction in <cit.>, from  we obtain a generalized Heegaard splitting  of  together with a sweep-out f→ along a non-faithful fork complex  representing . By construction,  is a tree with all of its nodes having degree one or three (<Ref>), moreover all non-degenerate level surfaces _x = f^-1(x) have genus bounded above by 18(+1).\nLet  be the faithful fork complex representing . Note that  is obtained from  by replacing every non-faithful fork ∈ with the collection 𝒞_ of faithful forks that accurately represents the (possibly disconnected) compression body  corresponding to . The inverse operation, i.e., for each ∈ bundling all faithful forks in 𝒞_ into  (see <Ref>), induces a projection map π→ between the drawings (cf. Figures <ref>(i)–(ii)). Note that every fork, tine, or grip in  corresponds to a collection of the corresponding items in  and so the projection map is well-defined.\n\n\n\n\n[2. Weak reductions]\nIn case  is weakly reducible, we repeatedly perform weak reductions until we obtain a strongly irreducible generalized Heegaard splitting ' of . Since weak reductions always decrease the width of a generalized Heegaard splitting, this process terminates after finitely many iterations. Throughout, we maintain that the drawings of the associated faithful fork complexes follow . Let ' be the faithful fork complex representing the final splitting ', f'→' be the sweep-out of  induced by ', and π''→ be the associated projection map (<Ref>(iii)). Due to the nature of weak reductions, 18(+1) is still an upper bound on the genus of any (possibly disconnected) level surface of π' ∘ f' →. As  is irreducible, we may assume that no component of such a level surface is homeomorphic to a sphere (cf. <cit.>). It follows that the number of components of any level set of π' ∘ f' is at most 18(+1).\n\n\n[3. Perturbation and isotopy]\nWe now apply a level-preserving perturbation π' π” on π', after which each thin level of ' lies in different level sets of π”∘ f' → (<Ref>(iv)). Since ' is strongly irreducible, its thick levels are strongly irreducible (by definition), and its thin levels are incompressible (by <Ref>). Moreover, all these surfaces have genera at most 18(+1). Hence, as the JSJ decomposition of  is assumed to be δ-complicated with δ=18(+1), we may isotope all JSJ tori to be disjoint from all the thick and thin levels of '. Then,  by invoking <cit.> we can isotope each JSJ torus of  to coincide with a component of some thin level of ' (<Ref>(v)). As a consequence, every compression body of the splitting ' is contained in a unique JSJ piece of .\n\n\n\n\n[4. The tree decomposition of ()]\nFirst note that every level set (π”∘ f')^-1(x) is incident to at most 18(+1) +1 = 18+19 JSJ pieces of . The `plus one' appears, because if (π”∘ f')^-1(x) contains a JSJ torus, then this torus is incident to two JSJ pieces of . Also note that, because of the perturbation performed in the previous stage, each level set (π”∘ f')^-1(x) can contain at most one JSJ torus of .\n\nWe now construct a tree decomposition (𝒳,T) of () of width 18(+1). Eventually, T will be a subdivision of  (which is a tree) with nodes corresponding to the bags in 𝒳, which we now describe. By <cit.>, each leaf l of  corresponds to a spine of a handlebody _l. We define a bag that contains the unique node of () associated with the JSJ piece containing _l. As we sweep through  (cf. the arrows on <Ref>(2)), whenever we pass through a point x ∈ such that the level set (π”)^-1(x) contains a tine of ', one of four possible events may occur (illustrated in <Ref>(v)–(vi)):\n\n\t\n  * A new JSJ piece appears. In this case we take a copy of the previous bag, and add the corresponding node of () into the bag.\n\t\n  * A JSJ piece disappears. Then we delete the corresponding node of () from a copy of the previous bag.\n\t\n  * Both previous kinds of events happen simultaneously. In this case we introduce two new bags. The first to introduce the new JSJ piece, the second to delete the old one.\n\t\n  * If neither a new JSJ piece is introduced, nor an old one is left behind, we do nothing.\n\nWhenever we arrive at a merging point in the sweep-out (i.e., a degree-three node of ), we introduce a new bag, which is the union of the two previous bags. Note that the two previous bags do not necessarily need to be disjoint.\n\n\nIt remains to verify that (𝒳,T) is, indeed, a tree decomposition of () of width at most 18+18. Node coverage: Every node of () must be considered at least once, since we sweep through the entirety of . Arc coverage: we must ensure that all pairs of nodes of () with their JSJ pieces meeting at a tine are contained in some bag. This is always the case for item:appears, because a new JSJ piece appears while all other JSJ pieces are still in the bag. It is also the case for item:disappears because a JSJ piece disappears but the previous bag contained all the pieces. In item:both a new JSJ piece appears and at the same time another JSJ piece disappears. However, in this case we first introduce the new piece, thus making sure that adjacent JSJ pieces always occur in at least one bag. Sub-tree property: This follows from the fact that a JSJ piece, once removed from all bags, must be contained in the part of  that was already swept. \nNow, every JSJ piece incident to a given level set (π”∘ f')^-1(x) of the sweep-out must contribute a positive number to its genus. Hence, it follows that every bag can contain at most  18+19 elements (with equality only possible where a tine simultaneously introduces and forgets a JSJ piece). This proves inequality (<ref>).\n\n\n\nWe start with the results from <cit.> yielding a fork-complex  whose underlying space  is a path, and the genus of the level sets of the associated sweep-out is bounded above by 4(3 + 1). Setting δ=4(3 + 1), the remainder of the proof is analogous with the proof of inequality (<ref>).\n\n\n\n\n§ AN ALGORITHMIC CONSTRUCTION\n\n\n\nHere we establish <Ref> that paves the way to the applications in <Ref>. In what follows,  denotes an arbitrary, but fixed, positive integer. Let G=(V,E) be a graph with |V|=n and maximum degree . <Ref> asserts that, in n time one can construct a triangulation _G of a closed, irreducible 3-manifold _G, such that the dual graph () of its JSJ decomposition  equals G, moreover, the pathwidth (resp. treewidth) of G determines the pathwidth (resp. treewidth) of _G up to a constant factor.\n\nOur proof of <Ref> rests on a synthesis of work by Lackenby <cit.> and by Bachman, Derby-Talbot and Sedgwick <cit.>. In <cit.> it is shown that the homeomorphism problem for closed 3-manifolds is at least as hard as the graph isomorphism problem. The proof relies on a simple construction that, given a graph G, produces a closed, orientable, triangulated 3-manifold whose JSJ decomposition  satisfies () = G. This gives the blueprint for our construction as well. In particular, we use the same building blocks that are described in <cit.>. However, as opposed to Lackenby, we paste together these building blocks via high-distance torus gluings akin to the construction presented in <cit.>. This ensures that we can apply <Ref> for the resulting 3-manifold _G and deduce the right-hand-side inequalities of eq:tw-inherit and eq:pw-inherit. The left-hand-side inequalities are shown by inspecting _G. We now elaborate on the ingredients of the proof of <Ref>.\n\n\n\n    The building blocks\n We first recall the definition of the building blocks from <cit.>. Let k ∈ℕ be a positive integer. Consider the 2-dimensional torus ^2 = 1×1, and let ^2_k denote the compact surface obtained from ^2 by the removal of k pairwise disjoint open disks. We define (k) = ^2_k ×1. Note that the boundary ∂(k) of (k) consists of k tori, which will be the gluing sites. See <Ref> for the example of (3).\n\nWe choose a triangulation (k) for (k) that induces the minimal 2-triangle triangulation of the torus (cf. <Ref>) at each boundary component. Note that (k) can be constructed from O(k) tetrahedra. An explicit description of (k) is given in <Ref>.\n\n\n\n\n0.425\n\t[scale=0.75]torus-3-holes\n\t\t(-47,37) (3) =\n\t\t(106,37) × 1\n\t\n\tfigureIllustration of (3).\n\t\n0.55\n\t[scale=0.75]torus-trg\n\t\n\tfigureMinimal triangulation of the torus ^2.\n\t\n\n\n\n\n\n\n    Overview of the construction of _G\n We now give a high-level overview of constructing _G from the above building blocks. Given a graph G=(V,E), for each node v ∈ V we pick a block _v≅(d_v), where d_v denotes the degree of v. Next, for each arc e = {u,v}∈ E, we pick a homeomorphism ϕ_e^2→^2 of sufficiently high distance (we discuss this notion below) and use it to glue together a boundary torus of _u with one of _v. After performing all of these gluings, we readily obtain the 3-manifold _G (cf. <Ref>(i)–(ii)). \n\n[name=Based on <cit.>, label=claim:jsj]\nThe JSJ decomposition  of _G satisfies () = G.\n\n\nFor a proof of <Ref> we refer to <Ref>.\n\n\n\n\n\n    High-distance torus gluings\n As already mentioned, to ensure that we can apply <Ref> to _G, we use torus homeomorphisms of “sufficiently high distance” to glue the building blocks together. This notion of distance, which is defined through the Farey distance, is somewhat technical. Thus, we refer to <cit.> for details, and rather recall a crucial result that makes the usefulness of distance in the current context apparent.\n\n There exists a computable constant K, depending only on the homeomorphism types of the blocks, so that if any set of blocks are glued with maps of distance at least K δ along their torus boundary components to form a closed 3-manifold , then the JSJ decomposition of  is δ-complicated (cf. <Ref>).\n\n\n\n\n\n    Triangulating the gluing maps\n We have already discussed that the block (k) admits a triangulation (k) with O(k) tetrahedra, where (k) induces a minimal, 1-vertex triangulation at each torus boundary of (k). It is shown in <cit.> that the gluings beading these blocks together can be realized as layered triangulations <cit.>. These triangulations manifest as “daisy chains” in the dual graph (_G) of the final triangulation _G, see <Ref>(iii).\n\n\n\nThere exist torus gluings with distance at least D, that can be realized as layered triangulations using 2D tetrahedra.\n\n\n\n\nThere exist universal constants c,c' > 0 such that\n\n\n\n    (c / ) _G≤G  and   (c' / ) _G≤G.\n\n\n\n\nSince every node of G has degree at most , the construction of _G only uses building blocks homeomorphic to (1),…,(). Hence, for each v ∈ V the triangulation (d_v) of the block _v contains O() tetrahedra. This, together with the above discussion on triangulating the gluing maps implies that (upon ignoring multi-arcs and loop arcs, which are anyway not “sensed” by treewidth or pathwidth), the dual graph (_G) is obtained from G by \n\t\n  * replacing each node v ∈ V with a copy of the graph ((d_v)) that contains O(Δ) nodes, and by\n\t\n  * possibly subdividing each arc e ∈ E several times.\n\n\nNow, the first operation increases the treewidth (resp. pathwidth) at most by a factor of O(), while the arc-subdivisions keep these parameters basically the same, cf. <Ref>. Hence (_G)≤ O(G) and (_G)≤ O(G), and the claim follows.\n\n\n\n Let G=(V,E) be a graph. If G'  is a graph obtained from G by subdividing a set F ⊆ E of arcs an arbitrary number of times. Then\n\n    G'≤G+2     and    G'≤max{G,3}.\n\n \n\n\nWe have already shown thm:construction-jsj (<Ref>) and the left-hand-sides of the inequalities  eq:tw-inherit and eq:pw-inherit (<Ref>). To prove the remaining parts of <Ref>, let δ = max{18(G + 1),4(3G + 1)} = O(G). By <Ref>, there is a computable constant K_ depending only on (1),…,() and hence only on , so that if we glue together the blocks via maps of distance at least K_δ, then the JSJ decomposition of _G is δ-complicated. By <Ref>, each such gluing map can be realized as a layered triangulation consisting of 2K_δ tetrahedra. Since G has at most n/2 arcs, these layered triangulations contain at most 2K_δ n/2 =  K_δ n = O( K_G· n) = O_(G· n) tetrahedra altogether. Since the triangulated blocks (d_v) contain O(· n) tetrahedra in total, the triangulation _G of the manifold _G can be built from O_(G· n) ≤ O_(n^2) tetrahedra. Last, as it follows from <cit.>, the construction can be executed in quadratic time.\n\n\n\n\n§ APPLICATIONS\n\n\n\n\n\nThere exist 3-manifolds (_h)_h∈ℕ with _h≤ 2 and _hh→∞⟶∞. \n\n\n\n\nThere exist Haken 3-manifolds (_k)_k∈ℕ with _kk→∞⟶∞.\n\n\n\nUsing Theorem <ref>, the construction of bounded-treewidth (Haken) 3-manifolds with arbitrarily large pathwidth follows by taking _h = _T_h (with the notation of <Ref>), where T_h is the complete binary tree of height h. The construction of Haken 3-manifolds of arbitrary large treewidth is deduced by setting _k = _Grid(k), where Grid(k) denotes the k × k grid graph. See <Ref>. Obtained as JSJ decompositions, where the JSJ tori are two-sided, incompressible surfaces, all of these manifolds are Haken.\n\n\n\n\n\n\tApproximating the treewidth (resp. pathwidth) of closed, orientable 3-manifolds up to a constant factor is at least as hard as giving a constant-factor approximation of the treewidth (resp. pathwidth) of bounded-degree graphs. \n\n\n\nThe argument for treewidth and pathwidth is the same. Given a graph G with maximum vertex degree , we use the polynomial-time procedure from <Ref> to build a 3-manifold  with  within a constant factor of G. An oracle for a constant-factor approximation of  hence gives us a constant-factor approximation of G as well.\n\n\n\nComputing a constant-factor approximation of treewidth (resp. pathwidth) for arbitrary graphs is known to be conditionally NP-hard under the Small Set Expansion Hypothesis <cit.>. For proving <Ref>, however, we rely on the assumption that the graph has bounded degree. Thus the conditional hardness of approximating the treewidth (resp. pathwidth) of a 3-manifold does not directly follow.\nEstablishing such a hardness result would add to the growing, but still relatively short list of algorithmic problems in low-dimensional topology that are known to be (conditionally) hard, cf. <cit.>.\n\n\n\n\n§ DISCUSSION AND OPEN PROBLEMS\n\n\n\nWe have demonstrated that 3-manifolds with JSJ decompositions with dual graphs of large treewidth (resp. pathwidth) and “sufficiently complicated” gluing maps cannot admit triangulations of low treewidth (resp. pathwidth). This provides a technique to construct a wealth of families of 3-manifolds with unbounded tree- or pathwidth that hopefully will prove to be useful for future research in the field.\n\nOne obvious limitation of our construction is a seemingly heavy restriction on the JSJ gluing maps in order to deduce a connection between the treewidth of a 3-manifold and that of the dual graph of its JSJ decomposition. Hence, a natural question to ask is, how much this restriction on gluing maps may be relaxed while still allowing meaningful structural results about treewidth. In particular, we have the following question.\n\n\n  Given a 3-manifold  with JSJ decomposition  and no restrictions on its JSJ gluings. Is there a lower bound for  in terms of ()?  \n\n\nNote that the assumption that we are considering the JSJ decomposition of  is necessary: Consider a graph G=(V,E) and a collection of 3-manifolds {_v}_v ∈ V, where _v has (v) torus boundary components. Assume that we glue the manifolds _v along the arcs of G to obtain a closed 3-manifold . Without restrictions on how these pieces are glued together, this cannot result in a lower bound  in terms of G: we can construct Seifert fibered spaces  in this way, even if G=(V,E) is the complete graph with |V| arbitrarily large. At the same time, Seifert fibered spaces have constant treewidth, see <cit.>.\n\n\nWhat is the complexity of computing the treewidth of a 3-manifold? \n\n\nWe believe that this should be at least as hard as computing the treewidth of a graph. \n\n\n\n\n\n\n\n§ SELECTED RESULTS FROM 3-MANIFOLD TOPOLOGY\n\n\n\nIn this appendix we collect important facts about the topology of 3-manifolds we rely on. We do not aim to reproduce their complete proofs; indeed, those are often quite technical or include lengthy case analyses. However, we do aim to give precise statements and references.\n\n\n\n §.§ Weak reductions\n\n\n\n The 3-torus ^3 = 1×1×1 is a closed 3-manifold built by identifying opposite faces of a solid cube K (<Ref>). It is well-known that ^3 has Heegaard genus ^3=3. A genus-three Heegaard splitting =(_1,_2,) of ^3 can be obtained as follows: Upon the face-identifications, the 1-skeleton of K becomes a bouquet -1.5pt\n    < g r a p h i c s >\n of three circles. We let _1 = N_^3(-1.5pt\n    < g r a p h i c s >\n) be a closed regular neighborhood of -1.5pt\n    < g r a p h i c s >\n in ^3, _2 be the closure of ^3∖_1, and = _1 ∩_2 be the resulting splitting surface (<Ref>).\n\n\n\nNote that D_1 and D_2 in <Ref> are essential disks in the handlebodies _1 and _2, respectively, and ∂ D_1 ∩∂ D_2 = ∅, hence the splitting =(_1,_2,) is weakly reducible. Now, a weak reduction at  may be carried out as presented on <Ref>. We refer to <cit.> for details (cf. <cit.>).\n\n\n\n\n\n\n\n §.§ Seifert fibered spaces and JSJ decompositions\n\n\n\nA key assertion about the manifold _G constructed in <Ref> is <Ref>, according to which the dual graph () of the JSJ decomposition  of _G satisfies () = G. This can be shown through the same argument that is outlined by Lackenby in <cit.>. However, while we use the same building blocks as Lackenby (namely the manifolds (k)), we glue them together via different (high-distance) maps. Therefore, some explanations are in order. To this end, closely following <cit.>, we recall some basic definitions and important results.\n\n\n\n    Seifert fiberings\n \nA model Seifert fibering of the solid torus 1× D is a decomposition of 1× D into disjoint circles, called fibers, obtained as follows. Consider the solid cylinder [0,1] × D and identify its boundary disks {0}× D and {1}× D through a rotation by 2π p/q, where p and q are relatively prime integers with q > 0. After this identification the segment [0,1] ×{0} becomes a fiber 1×{0}, whereas every other fiber consists of q segments of the form [0,1]×{x}. Next, a Seifert fibering of  3-manifold  is a decomposition of  into disjoint circles (also called fibers), such that each fiber has a neighborhood homeomorphic to that of a fiber in some model Seifert fibering of 1× D via a fiber-preserving homeomorphism. A 3-manifold that admits a Seifert fibering is called a Seifert fibered space. The following classical result says that most Seifert fibered spaces admit a unique Seifert fibering.\n\n\n\nEvery orientable Seifert fibered space admits a unique Seifert fibering up to fiber-preserving homeomorphism, except for:\n\n\t\n  * 1× D, the solid torus (various model fiberings; see above),\n\t\n  * 11 I, the orientable 1-bundle over the Möbius band (two fiberings),\n\t\n  * Seifert fibered spaces over ℝP^2 with one exceptional fiber (two fiberings),\n\t\n  * lens spaces L(p,q) including 3 and 1×2 (various fiberings), and\n\t\n  * 111, the orientable 1-bundle over the Klein bottle (two fiberings).\n\n\n\n\n\nThe manifolds (k) defined in <Ref> admit unique Seifert fiberings.\n\n\n\nThe statement follows by observing that (k) is a Seifert fibered space over the torus, and so it does not belong to any of the exceptional manifolds mentioned in <Ref>.\n\n\n\n\nIf an irreducible 3-manifold  is a covering space of the interior of another 3-manifold , then  is irreducible as well.\n\n\n[folklore, see <cit.>]\n\nFor any compact, connected and orientable surface F (possibly with boundary) other than 2, the interior of F ×1 has ℝ^3 as its universal cover.[The claim holds for non-orientable surfaces as well with the exception of ℝP^2.]\n\n\n\nIf F 2, it is well-known that the universal cover of F is ℝ^2. Indeed, for F ≅^2 a covering map ℝ^2 → F can be defined through the regular tiling of the Euclidean plane via squares, while for F ≅_g with genus g > 1 such a map can be obtained through the regular tiling of the hyperbolic plane via regular 4g-gons, with 4g such polygons meeting at each vertex <cit.>.\nIf F has non-empty boundary, then by the theory of covering spaces <cit.> the interior of F has some universal cover 𝒳, and by the uniformization theorem <cit.>, this space 𝒳 – being a non-compact, open, simply-connected surface – must be homeomorphic to ℝ^2.\nAs the universal cover of 1 is ℝ, it follows that the universal cover of F ×1 is ℝ^3.\n\n\n[folklore, see <cit.>]\n\nA 2-sided torus T ⊂ in an irreducible 3-manifold  is compressible if and only if T either bounds a solid torus 1× D ⊂ or lies in a ball in .\n\n\n\n\nFor any k ∈ℕ, (k) is irreducible and has incompressible boundary.\n\n\n\nThe irreducibility of (k) is a consequence of <Ref> and <Ref>. Then, the incompressibility of ∂(k) follows from <Ref> by noting that ∂(k) is a union of tori and, by construction of (k), none of them bounds a solid torus or lies in a ball in (k).\n\n\n\n\nThe manifold _G constructed in <Ref> is irreducible.\n\n\n\nLet G=(V,E) be a multigraph on n nodes with m arcs, and 𝐓 = {T_1,…,T_m} be the collection of pairwise disjoint tori T_i ⊂_G that are the images of the boundary tori of the manifolds _v ≅(d_v) after performing the torus-gluings in the construction of _G. \n\nLet us assume that _G is not irreducible, i.e., there is some reducing 2-sphere S ⊂_G. By definition, S does not bound a ball in _G. Note that S cannot be entirely contained in any of the building blocks _v ⊂_G, otherwise it would imply the reducibility of _v ≅(d_v), contradicting <Ref>. It follows that S ∩ (∪_i=1^m T_i) ≠∅. Thus, after an isotopy if necessary, we may assume that S intersects ∪_i=1^m T_i transversally, and the intersection S ∩ (∪_i=1^m T_i) is a union of pairwise disjoint closed curves α={α_1,…,α_ℓ} with ℓ being minimal.\n\nNow let α_j ∈α be a curve that is innermost in S, i.e., one of the two disks bounded by α_j in S, say D ⊂ S, does not contain any other curves from α. After relabeling if necessary, let T_j ∈𝐓 denote the torus for which α_j = S ∩ T_j. Note that, if α_j also bounds a disk D' ⊂ T_j, then D ∪ D' is a sphere entirely contained in one of the building blocks _w incident to T_j. Since _w is irreducible (<Ref>), D ∪ D' bounds a ball B ⊂_w, which can be used to eliminate α_j by first isotoping D inside B to coincide with D' and then pushing D' off the torus T_j, contradicting the minimality of α. Hence the disk D is essential in _w. However, this contradicts the incompressibility of T_j in _w (<Ref>).\n\n\n\nWe follow the notation introduced in the proof of <Ref>. By <Ref>, each building block _v admits a unique Seifert fibering. In particular, each boundary component of _v has a uniquely determined fibering. Therefore, when two building blocks _u and _u' are glued together along boundary tori T ⊂∂_u and T' ⊂∂_u', the resulting 3-manifold is not Seifert fibered, unless the gluing map aligns the (identical) Seifert fiberings of T and T'. Now, it follows from the definition of distance <cit.> that gluing maps of distance at least one do not align these Seifert fiberings. (In fact, for any two fixed Seifert fiberings of the torus, there are precisely two maps that align them.) Hence, upon the manifold _G is constructed, the Seifert fibrations of adjacent building blocks induce different fibrations on each torus in 𝐓 = {T_1,…,T_m}.\nNow, by construction of the building blocks, none of the tori in 𝐓 bounds a solid torus (cf. <cit.>), therefore they are all incompressible (cf. <Ref>) and pairwise non-parallel. This implies that the building blocks _v (v ∈ V) are indeed the JSJ pieces of _G and the tori in 𝐓 comprise its JSJ tori.\n\n\n\n\n\n\n§ TRIANGULATING THE BUILDING BLOCKS\n\n\n\nHere we describe the triangulation (k) of the building block (k) introduced in <Ref>. Topologically, (k) = ^2_k ×1, where ^2_k is obtained by removing the interiors of k pairwise disjoint disks from the torus ^2. To construct (k), first we triangulate ^2_k with 3k+2 triangles as shown in <Ref>. This triangulation of ^2_k naturally lifts to a decomposition of ^2_k × [0,1] into 3k+2 triangular prisms, each of which can be triangulated with three tetrahedra, see <Ref>. The construction of (k) is concluded by identifying the triangulations of ^2_k ×{0} and ^2_k ×{1} via the identity map. It immediately follows that (k) consists of 9k+6 = O(k) tetrahedra and induces a two-triangle triangulation at each boundary torus.\n\n\n\n\n\n"}