{"entry_id": "http://arxiv.org/abs/2303.06779v1", "published": "20230312233922", "title": "Study of Multiuser Scheduling with Enhanced Greedy Techniques for Multicell and Cell-Free Massive MIMO Networks", "authors": ["S. Mashdour", "R. C. de Lamare", "J. P. Sales"], "primary_category": "cs.IT", "categories": ["cs.IT", "math.IT"], "text": "\n0.94\n\n\n\n\nStudy of Multiuser Scheduling with Enhanced Greedy Techniques for Multicell and Cell-Free Massive MIMO Networks \n\n    Saeed Mashdour^⋆, Rodrigo C. de Lamare ^⋆,† and João P. S. H. Lima ^ \n  ^⋆ Centre for Telecommunications Studies, Pontifical Catholic University of Rio de Janeiro, Brazil \n\n^† Department of Electronic Engineering, University of York, United Kingdom \n\n^ CPqD, Campinas, Brazil \n\nsmashdour@gmail.com, delamare@cetuc.puc-rio.br, jsales@cpqd.com.br  \n\n\nThis work was supported by CNPq and CPqD.\n    \n==========================================================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\nIn this work, we investigate the sum-rate performance of multicell and cell-free massive MIMO systems using linear precoding and multiuser scheduling algorithms. We consider the use of a network-centric clustering approach to reduce the computational complexity of the techniques applied to the cell-free system. We then develop a greedy algorithm that considers multiple candidates for the subset of users to be scheduled and that approaches the performance of the optimal exhaustive search. We assess the proposed and existing scheduling algorithms in both multicell and cell-free networks with the same coverage area. Numerical results illustrate the sum-rate performance of the proposed scheduling algorithm against existing approaches.\n\n\n\n\nMassive MIMO, multiuser scheduling, multicell systems, cell-free systems, clustering. \n\n\n\n\n\n§ INTRODUCTION\n\n\nMulticell multiuser MIMO (MU-MIMO) systems have been widely used in wireless networks to improve the transmission rate, spectral and energy efficiencies using antenna arrays at each base station (BS), which can serve several user terminals simultaneously in each cell <cit.>. In these systems, different beamforming or precoding techniques such as zero forcing (ZF) or minimum mean squared error (MMSE) <cit.> are used to improve the system performance by maximizing the received signal power or by resorting interference cancellation at the receiver side <cit.>.\n\nWhen there are many users in a massive MU-MIMO network user scheduling is an important tool to achieve a desirable sum capacity and spectral efficiency<cit.>. This is key especially if each user requires a high data rate. In addition, user scheduling is required when pilot contamination reduces the transmit power for each user\nin Massive MIMO <cit.>. Furthermore, when the number of users is larger than the number of transmit antennas, user scheduling is fundamental to achieve a desirable sum capacity <cit.>. Accordingly, a great deal of  research has been done in the context of user scheduling in massive MIMO networks. In <cit.>, three methods for user scheduling has been presented to optimize the ergodic sum-rate. A joint user scheduling and transceiver design scheme for cross-link interference suppression that works on per-frame basis in interfering massive MIMO multi-cell scenarios has been reported in <cit.>. In <cit.>, a user-selection method based on simple zero-forcing beamforming with selection (ZFS) has been proposed which  attains a significant fraction of sum capacity and throughput of optimal method.\n\nUnlike multicell massive MIMO systems where users in each cell are served by a BS, a network with the same area of cells including randomly located single-antenna access points (APs) serving all users in the same time-frequency resource was introduced in <cit.> and called cell-free massive MIMO which presents higher throughput compared with small cells. Cell-free massive MIMO is compared with cellular massive MIMO systems in <cit.>, and it is shown that cell-free systems can provide significantly higher spectral efficiency for all users. Since the information of all APs and users are required in cell-free massive MIMO, it is suggested in literature to serve each user by a subset of APs to limit data sharing and computational complexity via two network-centric and user-centric approaches <cit.>. The first approach divides the APs into several clusters, where each includes different APs from other clusters. The latter, considers the AP subset providing the best channel conditions for each user which could be dynamic.  \n\nIn this paper, we investigate the sum-rate performance of the multicell and cell-free massive MIMO systems using greedy user scheduling based on ZFS algorithm in the downlink [This work was supported by CNPq and CPqD.]. We consider the use of a network-centric clustering approach to reduce the computational complexity of the techniques applied to the cell-free systems <cit.>. We then develop a greedy algorithm that considers multiple candidates for the subset of users to be scheduled and that approaches the performance of the optimal exhaustive search. We assess the proposed and existing scheduling algorithms in both multicell and cell-free networks with the same coverage area. Numerical results illustrate the sum-rate performance of the proposed scheduling algorithm against existing approaches.\n\nNotation: Throughout the paper, [ x  ]_+={ 0,x }, 𝐈_n denotes the n× n identity matrix, the complex normal distribution is represented by 𝒞𝒩 ( .,.  ), superscripts ^T ,^∗ , and ^H denote transpose,\ncomplex conjugate and hermitian operations respectively, A∪ B is union of sets A and B, and A∖ B shows exclusion of set B from set A.\n\n\n\n\n§ SYSTEM MODEL\n\nWe consider an area for both the multicell and cell-free networks so that we can have a fair comparison between these networks. There are K single antenna users distributed in the whole area. The multicell network consists of L cells each including K_c=K/L users and a BS equipped with N_t antennas. We also consider the cell-free system with M=L× N_t randomly located single antenna APs. \n\n\n\n §.§ Multicell Channel and Signal Model\n\n\nWe consider ℒ={ 1,2,⋯ ,L } as ths set of all existing cells in the area. We also model h_s_mk as the Rayleigh fading coefficient between the mth transmit antenna and kth receive antenna in the cell s and denote the row vector 𝐡_s_m= [ h_s_m1   h_s_m2  ⋯   h_s_mK_c ]. Then, 𝐇_l∈ℂ^K_c× N_t channel matrix including channel coefficient from the BS s to all users located in the related cell is\n\n    𝐇_l= [ 𝐡_l_1^T  𝐡_l_2^T  ⋯  𝐡_l_N_t^T ]\n\nConsidering 𝐱_s= [ x_s_1  ⋯   x_s_K_c ]^T as the vector\nof information symbols from BS s intended for all its related users with 𝐱_s∼𝒞𝒩 ( 0,𝐈_K_c ), and 𝐏_s∈ℂ^N_T× K_c as precoding matrix, the total downlink signal received by all users in cell s is given by\n\n    𝐲_s=𝐇_s𝐏_s𝐱_s+∑_l=1,l≠ s^Lq_sk𝐇_l𝐏_l𝐱_l+𝐰_s\n\nwhere 𝐰_s= [ w_s_1  ⋯   w_s_K_c ]^T is the additive white Gaussian\nnoise vector of the users located in cell s with w_s_k∼𝒞𝒩 ( 0,σ_w^2 ) and covariance matrix 𝐂_𝐰_s=σ _w^2𝐈_K_c, q_sk= [ 𝐐 ]_s,k and 𝐐 is the coupling matrix which describes the configuration of an interference model of a multiuser multicell system<cit.>. The term ∑_l=1,l≠ s^Lq_sk𝐇_l𝐏_l𝐱_l is considered as the interference caused by other cells called inter-cell interference (ICI). Since all noise vectors in each cell is independent of other cells, sum-rate of the received signals in the total network is achieved by summation of sum-rate of all the cells expressed by\n\n    R_t=∑_s=1^LR_s=∑_s=1^Llog_2 ( [𝐑_s+𝐈_K_c ]),\n\nwhere the covariance matrix of the received signal is given by\n\n    𝐑_s=𝐇_s𝐏_s𝐏_s^H𝐇_s^H (∑_l=1,l≠ s ^L | q_sk |^2𝐇_l𝐏_l𝐏_l^H𝐇_l^H+σ _w^2𝐈_K_c )^-1.\n\n\n\n\n §.§ Cell-Free Channel and Signal Model\n\nAccording to <cit.>, we use g_mk=√(β _mk)h_mk to denote the cell-free channel coefficient between mth AP and kth user where β _mk is the large-scale fading coefficient (path loss and shadowing\neffects) and h_mk∼𝒞𝒩 ( 0,1  ) is the small-scale fading coefficient, defined\nas independent and identically distributed (i.i.d) random variables (RVs)\nthat remain constant during a coherence interval and are independent over\ndifferent coherence intervals. Large scale coefficients are modeled as β _mk=_mk.10^σ _shz_mk/10 where _mk is the path loss and 10^σ _shz_mk/10\nrefers to the shadow fading with σ _sh=8 and  z_mk∼𝒩 ( 0,1  ). According to <cit.>, the path loss is modeled as \n\n\n    _mk={\n    --35log_10 ( d_mk ),   d_mk>d_1   \n     \n     --10log_10 ( d_1^1.5 d_mk^2 ),   d_0<d_mk≤ d_1   \n     \n     --10log_10 ( d_1^1.5 d_0^2  ),   d_mk≤ d_0   .,\n\nwhere d_mk denotes the distance between the mth AP and the\nkth user,\n\n    =46.3+33.9log_10 ( f  )-13.82log_10 ( h_AP ) \n    \n     - [ 1.11log_10 ( f  )-0.7  ]h_u+1.56log_10 ( f  )-0.8\n\nwhere f=1900MHz is the carrier frequency, h_AP=15m and h_r=1.5m are the\nAP and user antenna heights, respectively, d_0=10m and d_0=50m. When d_mk≤ d_1 there is no shadowing.\n\nIn downlink transmission, the signal received by the kth user is described by\n\n    y_k=√(ρ _f)𝐠_k𝐏𝐱+w_k\n\nwhere ρ _f is is maximum transmitted power of each antenna, 𝐠_k= [ g_1k,⋯ g_Mk ] are the channel coefficients for user k, 𝐏∈ℂ^M× K is the precoder matrix such as MMSE or ZF, 𝐱= [ x_1,⋯ ,x_K ]^T is the zero mean symbol vector with x_k the data symbol for user k and 𝐱∼𝒞𝒩 ( 0,𝐈_K ), and w_k∼𝒞𝒩 ( 0,σ_w^2 ) is the additive noise for user k. We consider elements of 𝐬 mutually independent, and independent of all noise and\nchannel coefficients. Combining all the users, we have\n\n    𝐲=√(ρ _f)𝐆^T𝐏𝐱+𝐰\n\nwhere 𝐆∈ℂ^M× K  is the channel matrix with elements [ 𝐆 ]_m,k=g_mk and\n𝐰= [ w_1,⋯,w_K ]^T is the noise vector. Considering noise covariane matrix as 𝐂_𝐰=σ _w^2𝐈_K, the sum-rate of\nthe cell-free system can be computed by \n\n    R_CF=log_2 (   [σ _w^-2ρ _f𝐆^T𝐏𝐏^H𝐆^∗+𝐈_K   ] )\n\n    \n\n\n\n§ ZFS USER SCHEDULING AND THE PROPOSED ENHANCED SCHEDULING ALGORITHM\n\n\nUsing an exhaustive search, we can schedule the user set with best performance among all possible user sets. However, it implies a high computational complexity which makes it impractical. Thus, alternative methods such as greedy algorithms are suggested in literature to reduce the selection complexity <cit.>. They usually\nconsider a selection criterion and based on that a user with best match at each iteration is selected.\n\nIn this section, we extend the greedy ZFS scheduling algorithm developed in <cit.> and to the scenarios of interest. Then, exploiting ZFS and introducing a strategy based on multiple candidates for choosing the subset of users, we develop an enhanced greedy algorithm which leads to a user subset closer to the optimal subset obtained by exhaustive search.\n\n\n\n\n\n §.§ ZFS Algorithm\n\n\nZF precoder creates orthogonal channels between transmitter and receivers by inverting the channel matrix at the transmitter using precoding matrix 𝐏=𝐇^H ( 𝐇𝐇^H )^-1 where 𝐇∈ℂ^K× M is the channel matrix. However, if K> M, 𝐇𝐇^H becomes singular and it is not possible to use ZF precoder. Therefore, it is required to schedule n≤ M out of K users as a set of users S_n resulting in a row-reduced channel matrix 𝐇 ( S_n ) which gives the highest achievable sum-rate \n\n    1≤ n≤ Mmax      S_nmaxR_zf ( S_n ) \n       subject to      ∑_i ∈ S_n [ μ -1/c_i ( S_n ) ]_+=P.\n\nwhere P is the upper limit of the signal covariance matrix [ 𝐂_𝐱 ]≤ P, R_zf ( S_n ) is throughput of ZF algorithm given by\n\n    R_zf ( S_n )=∑_i ∈ S_n [ log_2 ( μ c_i ( S_n )  )  ]_+\n\nwhere c_i ( S_n )={ [  ( 𝐇 ( S_n )𝐇 ( S_n )^H )^-1 ]_ii}^-1. Then, the reduced-complexity sub-optimal ZFS algorithm is outlined in the following pseudo code considering 𝒦={ 1,2,⋯ ,K } as the set of indices of all K users, K_s as number of users to be scheduled, and 𝐡_k as the channel vector of user k. Note that we have used equal power loading to obtain μ.\n\n    \n  1) Initialization \n    \n    \n  * set n=1\n    \n  * find a user s_1 such that \n    \n    s_1=k∈𝒦𝐡_k𝐡_k^*\n    \n    \n  * set S_1={ s_1} and denote the achieved rate R_ZF ( S_1 )_max\n        \n\n    \n    \n  2) while n<K_s\n    \n    \n    \n  * increase n by 1\n    \n  * find a user s_n such that \n    \n    s_n=k∈ (  𝒦∖  S_n-1 )R_ZF ( S_n-1∪{ k } )\n    \n    \n  * set S_n=S_n-1∪{ s_n} and denote the achieved rate R_ZF ( S_n )_max\n    \n  * If R_ZF ( S_n )_max≤ R_ZF ( S_n-1 )_max, breake and decrease n by 1\n    \n        \n    \n  3) Precoding 𝐏=𝐇 ( S_n )^* (  𝐇 ( S_n )𝐇 ( S_n )^* )^-1\n     \n     \n     \n     \n\n §.§ Enhanced Greedy Algorithm\n\n     \n\nHere, we devise a scheduling strategy that assesses more sets of users so that we can achieve a system performance closer to the performance achieved by an exhaustive search while saving significant computational complexity. In this regard, we consider the  set achieved by ZFS as the first user set S_n ( 1  ). Then, we choose k_ex as the least channel power user among the users of the first set which is called the first excluded user and is obtained by \n     \n    k_ex (1 )=k∈ S_n ( 1  )𝐡_k𝐡_k^*\n\n     We also select the user with the highest channel power from the remaining users other than the first selected set called first new user k_new defined as\n     \n    k_new (1 )=k∈𝒦_r ( 1 )𝐡_k𝐡_k^*\n\n     where 𝒦_r ( 1 )=𝒦∖ S_n ( 1  ) is set of the remaining or unselected users. Substituting the excluded user by the new user in the first set, we achieve a new user set as the second set. Then, excluding the new user from the remaining users we achieve the second remaining user set. Repeating the described procedure for the second set and so on, we achieve K-K_s/2 sets together with the first set. Therefore, the user set S_n ( j  ) and remaining user set 𝒦_r ( j ), j ∈{ 2,⋯ ,K-K_s/2+1 }, are respectively derived as \n       \n       \n    S_n ( j  )= (S_n ( j-1  )∖ k_ex (j-1 ) )∪ k_new (j-1 )\n\n     \n    𝒦_r ( j )=𝒦_r ( j-1 )∖ k_new (j-1 )\n\n      Thereafter, we assess all the considered sets to determine the best set S_n_f using two different criteria each of which implying a different complexity to the system. The first criterion would be the sum-rates according to equations (<ref>) and (<ref>) for multicell and cell-free networks, respectively. The second one, would be C_s ( S_n ( i  ) ) the sum channel correlation among the users of ith set, i ∈{ 1,2,⋯ ,K-K_s/2+1 } defined as\n     \n    C_s ( S_n ( i  ) )=∑_u ∈ S_n ( i  )∑_v ∈ S_n ( i  ),v≠ uC_u,v\n\n     where C_u,v is channel correlation of the users u and v in the set S_n ( i  ). Thus, depending on sum-rate or sum correlation criteria, the desired set is respectively derived as\n     \n    S_n_f=S_n∈ S_n ( i  ){  R_CF ( S_n ) }\n\n    or alternatively as \n     \n    S_n_f=S_n∈ S_n ( i  ){   C_s ( S_n ) }\n\n      Accordingly, the enhanced greedy algorithm for cell-free network is outlined as follows. Note that for the multicell network, the number of users to be selected will change to K_c and K_c_s respectively, R_CF is changed to R_t, and overall sum channel correlation is obtained by summation over all cells.\n     \n\n\n\n  * =1\n    \n  * Finding initial user set S_n (  ) using ZFS\n    \n  * : R_CF ( S_n (  ) ) or C_s ( S_n (  ) )% depending on the used criterion\n    \n  * 𝒦_r (  )=𝒦∖ S_n (  ) %  set of K-K_s unselected users  \n    \n  * k_ex ( )=k∈ S_n (  )𝐡_k𝐡_k^* \n            \n            \n  * k_new ( )=k∈𝒦_r (  )𝐡_k𝐡_k^*\n    \n    \n  * for =2 to K-K_s/2+1 % we are considering half of the remaining users\n        \n            \n             \n  * S_n (  )= (S_n ( -1  )∖ k_ex (-1 ) )∪ k_new (-1 ) \n             \n            \n  * 𝒦_r (  )=𝒦_r ( -1 )∖ k_new (-1 ) \n          \n          \n  * k_ex ( )=k∈ S_n (  )𝐡_k𝐡_k^* \n            \n            \n  * k_new ( )=k∈𝒦_r (  )𝐡_k𝐡_k^* \n          \n          \n  * : R_CF ( S_n (  ) ) or C_s ( S_n (  ) )\n        \n        \n        \n  * end for\n        \n  * S_n_f=S_n∈ S_n ( i  ){  R_CF ( S_n ) }  or S_n∈ S_n ( i  ){   C_s ( S_n ) }\n        \n        \n  * Precoding\n    \n       \n\n\n\n\n\n\n\n\n\n\n§ SIMULATION RESULTS\n\nIn this section, we assess in terms of sum-rates the proposed and existing scheduling algorithm in multicell and cell-free scenarios using Matlab. Note that CF and CoMP in the results represent cell-free and multicell systems, respectively. In particular, we consider a squared area of size 400m as the whole area of the cell-free system with M=64 single-antenna randomly located APs and K=16 uniformly distributed single antenna users. For the multicell system, we consider the same area divided in L=4 non-overlapping cells each including K_c=K/L=4 users with the same location as the cell-free system and a BS located at the center of the cell with N_t=M/L=16 antennas. We adopt the cell-free channel model in <cit.> and the cellular channel model in <ref>, and consider a static channel over each transmission packet in both networks. In Table <ref>, we provide more details on the parameters used for simulation.\n\n\n\n\n\n\n\nWe have used ZF and MMSE precoders for performance comparison of multicell and cell-free networks and the corresponding sum-rates are shown in Fig. <ref> against the signal-to-noise ratio (SNR) when user scheduling is not considered. For all plots, the sum-rates increase with the SNR, however, the MMSE precoder has resulted in higher sum-rates as compared with the ZF precoder in both networks. The performance of the cell-free system has shown a significant superiority over the multicell system, which is mainly because cell-free network is not so much affected by the ICI near the cell borders which impairs the multicell system.\n\n\n\nFigs. <ref> and <ref> show how different scheduling methods work in cell-free and multicell networks, respectively, when the sum-rate criterion is used. We have compared the performance of the systems implementing an exhaustive search, the proposed enhanced greedy and ZFS user scheduling algorithms to schedule half of the users when ZF and MMSE precoders are used. According to these figures, the proposed enhanced greedy method achieves an impressive improvement compared with ZFS and its performance is very close to the optimal exhaustive search method in cell-free networks. For multicell networks we also have a significant improvement. The performance of cell-free and multicell networks using the proposed enhanced greedy algorithm is also shown in Fig. <ref>, where the cell-free system has outperformed the multicell system, as expected. \n\n\n\n\n\n\n\n In Fig. <ref>, the performance of the enhanced greedy algorithm in a cell-free network is shown when the sum-rate and channel-correlation criteria are used. We can see that using the sum-rate criterion provide an improvement in system performance while the results for the channel-correlation criterion are slighltly worse. The choice of the sum-rate and the channel-correlation criteria depends on the available computational power and application.\n\n\n\nIn Table <ref>, the computational complexity of the ZFS and the proposed enhanced greedy methods for the sum-rate and channel-correlation criteria are shown in cellular and cell-free networks with network-centring clustering. The results show that the improvement in the method using the sum-rate criterion comes at the cost of more required flops.\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\nWe have proposed an enhanced greedy algorithm that extends the search procedure to find the user set with the best performance in cell-free and multicell MIMO systems. Numerical results show that there is a significant performance improvement in both cell-free and multicell systems using the proposed algorithm while linear MMSE and ZF precoders were used. The sum-rate criterion in the proposed enhanced greedy algorithm has outperformed the channel-correlation criterion at the cost of a slight increase in computational complexity.\n\nIEEEbib\n\n\n"}