{"entry_id": "http://arxiv.org/abs/2303.06773v1", "published": "20230312231818", "title": "Protecting Classical-Quantum Signals in Free Space Optical Channels", "authors": ["E. Villaseñor", "M. S. Winnel", "T. C. Ralph", "R. Aguinaldo", "J. Green", "R. Malaney"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n[\n    Max Wenqiang Xu\n    \n===================\n\n\n\n\n\nDue to turbulence and tracking errors, free-space optical channels involving mobile transceivers are characterized by a signal's partial loss or complete erasure. \nThis work presents an error correction protocol capable of protecting a signal passing through such channels by encoding it with an ancillary entangled bipartite state. \nBeyond its ability to offer protection under realistic channel conditions, novel to our protocol is its ability to encompass both classical and quantum information on the encoded signal. \nWe show how, relative to non-encoded direct transmission,  the protocol can\nimprove the fidelity of transmitted coherent states over a wide range of losses and erasure probabilities. \nIn addition, the use of ancillary non-Gaussian entangled bipartite states in the signal encoding \nis considered, showing how this can increase performance.\nFinally, we briefly discuss the application of our protocol to the transmission of more complex input states, such as multi-mode entangled states.\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nBuilding a global quantum network is a major technological challenge <cit.>. Any quantum technology that relies on mature hardware may provide a practical path forward. \nContinuous Variable (CV) quantum communications, which can be implemented using off-the-shelf components, is one such technology <cit.>. In this technology, quantum information is extracted using homodyne or heterodyne measurements - detection techniques previously developed to extract classical information encoded via coherent communications <cit.>. Interestingly, CV quantum and coherent communications can coexist using the same signal <cit.>, and it is this interesting co-existence of classical and quantum information we study here. Our main contribution will be the introduction of a combined classical-quantum encoding protocol that accommodates a wide range of partial loss and erasure conditions in the channel. As we discuss later, such conditions are those anticipated for practical free-space optical channels, where at least one of the transceivers is mobile.\n\n\nOptical free-space communications provide the basis for long-range communications, both classical <cit.> and quantum <cit.>, through horizontal channels on the ground <cit.> or more general channels to (or sometimes between) flying objects such as drones <cit.>, aircraft <cit.>, or satellites <cit.>.\nHowever,  beam deformation and wandering induced by the turbulent atmosphere can have detrimental consequences <cit.>. If at least one of the transceivers is mobile and untethered, then further misalignment of the optical beam introduced by transceiver motion (e.g., jitter) must also be considered <cit.>. Any error correction protocol that can alleviate such combined effects would be useful for a pragmatic communication deployment.\n \n \nIn the context of quantum information alone,\nprevious works have analyzed and experimentally demonstrated how error correction of the pure erasure channel (total loss in a channel) can be achieved via the introduction of ancillary modes transmitted through independent channels <cit.>.\nUnlike these previous works, however, here we present a new protocol capable of error correction under more realistic conditions, as well as accommodating combined classical-quantum information encoding. The realistic channel conditions we consider encompass a  range of loss conditions across the independent channels  - not just simple erasures. As we shall see, careful monitoring of the channel losses via separate bright classical reference signals provides the feedback mechanism we need to protect a three-mode-encoded classical-quantum signal under our realistic channel conditions.\n\n\n\nOur specific contributions in this work can be summarized as follows:  \n(i) We develop a three-channel error correction protocol capable of correcting any amount of loss on one mode of a three-mode quantum state while allowing some loss on the other  modes, demonstrating how to optimize signal recovery.\n(ii) We show that transmitted coherent states exhibit a  substantial improvement in fidelity over direct state transmission using one channel under our new protocol.  \n(iii) We demonstrate how transmission of classical information can be embedded into the protocol by adding a displacement operation, quantifying the displacement characteristics needed to achieve communications with a specific bit-error rate.\n(iv) We show how non-Gaussian states used as entangled ancillary states within the protocol can further increase the fidelity of transmitted states. \n(v) We investigate whether the trends found for coherent states also apply to the distribution of entanglement by the protocol, discussing how care must be taken in interpreting the transmission of different input states.\n\n\nThis work is organized as follows.\nIn Section <ref>, the protocol is introduced. \nIn  Section <ref>, simulation results of the state transmission via the protocol are presented.\nThe usefulness of non-Gaussian operations is presented in Section <ref>. \nPotential modifications to the protocol are discussed in Section <ref>, as are discussions on the use of alternate input states to the protocol. \nOur conclusions are drawn in Section <ref>.\n\n\n\n\n§ THE PROTOCOL\n\n\n\nIn Fig. <ref>.a, \nour protocol is presented. The protocol consists of the concurrent transmission of classical and quantum information embedded into an error correction protocol. The error correction code is first described in the following, followed by the transmission of classical information via the protocol. \n\nThe following steps are followed to perform error correction in the protocol. (i) Alice initially possesses the single-mode quantum state, |ϕ_s⟩ the “quantum signal\" state to be error corrected in mode 1^o, alongside an entangled bipartite state, |ψ_AB⟩ in modes 2^o and 3^o. (ii) The state |ϕ_s⟩ is combined with mode 2^o of the state |ψ_AB⟩ using a balanced Beam Splitter (BS), shown as BS1, to create a three-mode encoded state. (iii) The three modes of the encoded state are transmitted via the three fluctuating channels (acting independently on the three modes). The loss applied to each mode is characterized by the transmissivity coefficient T_j with j=1,2,3. A Local Oscillator (LO) is transmitted from Alice to Bob through each channel (a bright classical beam of known amplitude multiplexed with each mode).  (iv) Bob receives the three modes, 1, 2, and 3. (v) Bob obtains T_j  information on the channels by monitoring the three LOs. (vi) Bob uses a second BS (BS2), on modes 1 and 2 to decode the state. (vii) Applying a third BS (BS3), dual homodyne measurements are then performed   on modes 2' and 3' (referred to as the syndrome measurements x̃ and p̃). (viii) Bob uses his channel information, combined with the syndrome measurements, to determine the optimal corrective displacement, D̂_corr, that is applied to mode 1' to obtain the output state \n|ϕ_out⟩ of the protocol.  If error correction was successful then, |ϕ_out⟩ will deviate only marginally from |ϕ_s⟩.\n\nA critical component of the protocol is the classical computing required to apply the correction  D̂_corr. This classical computation can be thought of as an algorithm that takes as inputs the measured T_j in each channel; the syndrome measurements, x̃ and p̃; and the (pre-measured) excess noise in each channel; and determines the optimal value of the gain, g, in D̂_corr  that will be applied to mode 1' so to optimize the fidelity between |ϕ_out⟩ and |ϕ_s⟩. The details of this optimization procedure are non-trivial and are explained in detail below. However, suffice it to say this procedure can be implemented in software a priori. In the following, we will utilize one particular quantum information formalism to illustrate how the needed calculations within the software can be implemented.\n\n\n\nThe simulation results that appear later will be based on two steps: (i) the derivation of the analytical expressions for the transformations of quantum states in each step of  Fig 1.a; and  (ii) the numerical simulations to determine the probability distributions for the transmissivity of each channel (based on models of the phase screens indicated in Fig. 1.b) required as input to the analytical expressions.\n\n\n\n\n §.§ State transformation\n\n\n\nA previous result <cit.> demonstrates that the outcome state of CV quantum teleportation can be elegantly computed using the  Characteristic Function (CF) formalism. In this work, we present a similar result. \n \n\nFor any n-mode quantum state, ρ̂, its CF is defined as\n\n    (λ_1, λ_2, ..., λ_n) = {ρ̂D̂(λ_1)D̂(λ_2)...D̂(λ_n)},\n\nwhere λ_i ∈ℂ, and D̂ is the displacement operator,\n\n    D̂(λ_j) = e^λ_j â^†_j - λ_j^* â_j,\n\nwhere â_j and â^†_j are respectively the annihilation and creation operators of mode j,  and ^* represents the complex conjugate.\nUsing the CF formalism, linear optics operations can be expressed by simply transforming the CF arguments while leaving the functions unchanged.\nThe effect of a loss-noise channel, with transmissivity T_j and excess noise ϵ on a single-mode quantum state, corresponds to the transformation of its CF as,\n\n    (λ) (√(T_j)λ) _|0⟩(√(1 - T_j + ϵ)λ),\n\nwhere _|0⟩ is the CF of the vacuum state.\n\n\n \n\n\n\nThe full derivation of the CF of |ψ_mathrmout⟩ is presented in Appendix <ref>. Given the CF of the quantum signal, _s(λ_1), and the CF of the entangled state, _AB(λ_2,λ_3), the CF of the output state corresponds to,\n\n    _out(λ)   = _s( (T_ + g̃T_) λ) ×\n       _AB( (T_ + g̃ T_)λ,  √(T_3)g̃λ^*) \n       _|0⟩(√((1 + ϵ) (2g̃^2 + 1) + 2g^2(1 - η^2) - T')λ),\n\nwith \n\n    T_ =  √(T_1) + √(T_2)/2;      T_ =  √(T_1) - √(T_2)/2; \n    \n    T'= T_1/2 (1+g̃)^2 + T_2/2 (1-g̃)^2 + T_3 g̃^2.\n\n \n Here, g̃=gη, with η^2 the efficiency of the homodyne measurements. The gain parameter when applying D̂_corr, g, corresponds to a free parameter Bob can select at will (see Appendix <ref> for more detail). Error correction in the protocol works when Bob selects the appropriate value of g based on the knowledge he obtains by monitoring the channels.\n By selecting the appropriate value of g, the output state can be made independent of the loss affecting one of the three modes in the encoded state.\nThe ideal scenario occurs when two of the three modes are unaffected by the loss. In this scenario, g can always be selected to nullify the loss effects in the remaining mode. For more insight, some idealized scenarios with specific g values are discussed in Appendix <ref>.\n\n\n\n\nTransmission of classical information:\nThe only additional requirements for transmitting classical information are an agreed digital modulation scheme between Alice and Bob and an extra displacement operation D̂(Δ). During the first step in the error correction, the operation D̂(Δ) is used by Alice to encode a symbol on mode 2^o of |ψ⟩_AB immediately after it has been prepared. The symbol corresponds to one or multiple classical bits following a predetermined digital modulation scheme. \nThe symbol is then recovered by Bob automatically from the values of the syndrome measurement results, x̃ and p̃.\nNote, we adopt ħ=2; and Δ , x̃ and p̃ are dimensionless (the variance of the vacuum noise is one).\n\n\n\n\n\n\n §.§ Transmissivity calculations\n\n\n\nThe technique used here to model turbulence via phase screen simulations has been detailed extensively in our previous works, with experimental validation over a horizontal free-space channel of 1.5 km <cit.>. The simulation methodology in the present work follows our previous works; details can be seen in <cit.>.\n\n\nOur phase screen simulations allow us to find the Probability Density Function (PDF) of the transmissivity in the channel for any given communications setup.\nHenceforth, we refer to this PDF as  𝒫. The dominant parameters of a communication setup are the propagation distance, L, the wavelength of the light used, λ, the beam waist at the transmitter, r_t, and the size of the receiving aperture, r_d.\nThese parameters will be fixed to be values shown in Table I (with the exception of L and r_d).  For focus, we assume a horizontal channel in the results we show here; however, other configurations can be easily accommodated via small changes in the simulations <cit.>.\nA total of 10 uniformly distributed phase screens are used, and \nthe grid size of complex numbers is 1500 × 1500. A typical PDF from our calculations can be seen in Fig. <ref>. \n\n\n\nBeyond turbulence, other real-world system issues can affect the channel transmissivity. Most notable are the pointing and tracking errors between the transmitter and receiver that create a jitter and/or deterministic offsets of the beam direction <cit.>. In our channel model, we will account for these effects by the addition of erasures into the PDF of the transmissivity. That is, for each optical beam sent from the transmitter to the receiver, we consider that there is a probability p_e of it entirely missing the receiver (corresponding to T_j=0). In other words, for a given communications setup (e.g., the transceiver apertures, propagation distance, and wavelength) with corresponding PDF  𝒫, and an erasure probability, p_e, the values of T_j are now given by the following modified PDF,\n\n    T_j =  \n          T_j ∼𝒫   with  probability  (1-p_e) \n    \n          0    with  probability  p_e,\n\nwhere X∼ Y indicates that a random variable X is drawn from distribution Y. \nThis channel model represents a good approximation to the \nreal-world channel of interest to us - a channel where erasure probability is high[In channels where  𝒫 indicates a small probability for T∼ 0, and where p_e∼0, we find that no improvement from the protocol is likely - the transmission may as well be just direct. If a priori known that p_e=0,  we have a Gaussian channel, and the introduction of non-Gaussian states or measurements into the protocol is needed if any advantage is to be forthcoming.]. Also, the extension of the channel model via a new probability, p_e, \nto parameterize the additional loss caused by transceiver movement/offsets  allows us to compare \nbetter with previous related work.\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n§ SIMULATIONS\n\n \nHere, we first outline the CFs of the main quantum resources we use and make clear how we determine the fidelity - the key metric we use. We then discuss the performance of the quantum and classical communication under the protocol, detailing how the optimization of g is determined for each simulation run.\n\n\n §.§ Quantum resources\n\nThe quantum signal is a coherent state |α⟩, whose CF is,\n\n    _|α⟩(λ) = exp[-|λ|^2/2 + (λα^* - λ^* α) ].\n\nThe two-mode squeezed vacuum (TMSV) state |ψ_AB⟩ used in the encoding has a CF,\n\n    _TMSV(λ_A, λ_B) = exp[ -1/2(|λ_A'|^2 + |λ_B'|^2 ) ].\n\nIn deriving this, the following\n transformation has been used<cit.>, \n\n    Ŝ_AB(ϱ) D̂(λ_A) D̂(λ_B) Ŝ^†_AB(ϱ) = D̂(λ_A') D̂(λ_B'),  \n       λ_j' = cosh(r)λ_j + e^iϕsinh(r) λ_k^*      j,k = {A,B};    j≠ k,\n\nwith Ŝ_AB the two-mode squeezing operator, and with ϱ=re^i ϕ. Without loss of generality, the value ϕ=π is set.\n\n \nFinally, the CF of the vacuum state |0⟩, that appears in Eq. <ref> is,\n\n    _|0⟩(λ) = exp[ -|λ|^2/2].\n\n\n\nFidelity is used as the metric of the effectiveness of the protocol.\nThe fidelity represents the closeness between the quantum signal |ψ_s⟩ and the output state |ψ_out⟩. \nIn the CF formalism, the fidelity is computed as,\n\n    ℱ_α = 1/π∫ d^2 λ_s(λ) _out(-λ).\n\n\nThe fidelity as defined in Eq. <ref> will depend on each input state's value α. Therefore, the mean fidelity over an ensemble of coherent states must be considered. The following Gaussian distribution specifies the ensemble,\n\n    P_α(α) = 1/σ_απexp[-|α|^2/σ_α],\n\nwith σ_α the variance.\nTherefore, the fidelity over the ensemble of coherent states will be used, defined as\n\n    ℱ  = ∫ dα^2 P_α(α) ℱ_α.\n\n\n\nIdeally, we would like to compute the fidelity considering a uniform distribution of coherent states (corresponding to σ_α→∞); however, this would be analytically intractable. An approximation to a uninform distribution can be obtained by setting a large enough variance, σ_α = 10 (a value we adopt through this work).\n\nFor reference, the so-called classical limit, ℱ_class=0.52 sets the baseline where fidelities of transmission below this value could be obtained using purely classical communications<cit.>.\n\nUsing Eq. <ref> with Eq. <ref> it becomes possible to find an analytical expression of the fidelity for the ensemble of coherent states. This expression is provided in Appendix <ref>, Eq. <ref>. Additionally, the fidelity for direct transmission for the ensemble of coherent states, ℱ^dir, is also presented in Appendix <ref>, Eq. <ref>.\n\n\n\n\n §.§ Transmission of quantum information\n\n\nIn the following calculations, a homodyne measurement efficiency of η^2=0.9 is set unless specified otherwise. Fluctuations of the free-space channel produce several effects contributing to the excess noise <cit.>. We have modeled the excess noise in our simulation as  ϵ= ϵ_ph + ϵ_det. Here,  ϵ_ph is related to noise introduced by the displacement used in the encoding  (see  <cit.>) and will be modified by the transmissivity of the channel. The other term,  ϵ_det  is detector excess noise, which we set to ϵ_det=0.013  <cit.>. As an example, for T=0.5,  we have ϵ=0.018. \nWhen computing the fidelity, every protocol realization involves a different sample of the values T_j. Thus, the parameter g must be optimized for each protocol realization, as shown in Fig. <ref>.\nThe following procedure was followed to compute the mean fidelities. First, using the numerical simulations described in Section <ref>, 30000 samples of T_j were obtained for a given \npropagation distance. Next, fidelity was obtained for a specific realization of the channels using three sampled values of T_j in Eq. <ref>. \n\n\n\n\n\n\n \n \n\n \nAll possible transmissivity occurrences must be accounted for to compare the protocol's effectiveness to direct transmission. \nFor direct transmission, the total fidelity is calculated as \n\n    ℱ^dir_total = (1- p_e) ℱ^dir + \n    p_eℱ_|0⟩.\n\n\n \n \n\n\nThe results comparing the mean total fidelity between the protocol and direct transmission are shown in Fig. <ref>. The results indicate that the protocol improves the transmission fidelity for values of p_e up to 0.35. The advantage provided by the protocol decreases as the distance increases. For values, p_e>0.35, it is observed that the protocol does not provide any advantage for the r_d values shown.\n\n\n\n §.§ Transfer of classical information\n\n\nNow the error rates in transmitting classical information via the protocol are analyzed.\nAn error during the transmission of classical information corresponds to Bob misidentifying the symbol sent initially by Alice. The excess noise added to the system increases the variance of the syndrome measurements. Thus, if the noise is too high, there is a probability that the syndrome measurements appear on a different partition from the one Alice meant to encode. The error probability can be directly quantified by the ratio between the variance of the syndrome measurements, σ_s, and the magnitude of the displacement used during the classical encoding, |Δ|.\nFor a given value of |Δ|, a larger σ_s means a higher Bit Error Rate (BER). Alternatively, a more significant displacement can also be used to increase the distance between partitions and offset the effects of σ_s, increasing the Signal-to-Noise Ratio (SNR). \n\n\nIf all the states used during the protocol are Gaussian, then the measurement results will follow a Gaussian distribution <cit.>.\nSolving the integration in Eq. <ref> in Appendix <ref>, we see that the syndrome measurements have the mean values given by  \n \n    μ_x̃ =  1/√(2)η T_Δ\n    μ_p̃ = 1/√(2)η T_Δ.\n\nThe variance σ_s depends on the specific values T_j, the amount of squeezing r, and the size of the ensemble of states being transmitted using the protocol σ_α. The expression of σ_s is presented in Appendix <ref>.\n\n\nOnce we have determined the moments of the syndrome measurements, we can compute the BER. For simplicity, we assume the classical information consists of single bits encoded in Binary Phase-Shift Keying  <cit.>. In this case, the BER of the protocol will be,\n\n    BER=1/2erfc(η T_ |Δ|/√(2σ_s^2)).\n\n\nA value of interest is the size of the displacement required to maintain the BER to a tolerable level. For a BER of 10^-9, we see in Fig. <ref> the mean values of |Δ| required for the special case when T_1=0 in mode 1 (or similarly mode 2). \nIf instead mode 3 possesses T_3=0, the displacement requirements are approximately half of the values shown.\n\n\n \n\n\n\n\n§ ENHANCEMENT VIA NON-GAUSSIAN OPERATIONS\n\n\nNon-Gaussian states represent a key element in CV quantum information, and there has been great interest in their use to enhance quantum communications protocols <cit.>. Particularly, in CV quantum teleportation, certain non-Gaussian operations have shown to enhance the fidelities of transmitted states <cit.>. Thus, it is natural to ask if the same holds for this protocol.\n\n\nOne viable experimental way to construct non-Gaussian states \nshown in Fig. <ref>, where a mode of a TMSV is combined with a BS with transmissivity T_κ with a M photon Fock state, and a photon discriminating detector is used to detect N photons. In the following, we consider a Photon Subtraction (PS), setting M=0, N=1; Photon Addition (PA) with M=1, N=0; and Photon Catalysis (PC) setting M=1, N=1.\nWe also consider the successive application of the PS and PA operations,  PS-PA (order reversed in PA-PS). \nAll the operations are applied in mode 3^o of the initial TMSV state as the first step in our protocol. \n\nBesides applying non-Gaussian operations on a TMSV, an additional non-Gaussian entangled state is considered. This state is prepared at the start of the protocol by the application of the two-mode squeezing operation to a Bell state, the state known as the Squeezed Bell (SB) state, given by\n\n    |ψ_SB⟩   =(cos^2(ϑ) + sin^2(ϑ))^-1/2\n       ×Ŝ_AB(ϱ) [cos(ϑ) |00⟩ + sin(ϑ)|11⟩].\n\n\n\nThe implementation of the non-Gaussian states is achieved by replacing |ψ_AB⟩ in Fig. <ref>  with the corresponding non-Gaussian state. The CF of each non-Gaussian state must be computed first and used in Eq. <ref>, where the non-Gaussian CF replaces _AB. \nThe CF of the states used in this work have been calculated in previous works <cit.>, and are listed in Appendix <ref> for completeness.\n\nIn the CF of each non-Gaussian state, a free parameter exists corresponding to the transmissivity of the beam-splitter involved in each operation. This free parameter is optimized to maximize the fidelity of transmission. In the case of the SB state, the ϑ free parameter is optimized. For the PS-PA and PA-PS, the exact value of T_κ is used in both successive non-Gaussian operations. Finally, it is assumed that a quantum memory is available at the transmitter, such that the non-Gaussian states can be prepared and stored to be used on demand during the protocol[Non-Gaussian operations have a non-unity success probability. Without a quantum memory, this success probability would need to be accounted for in the resulting fidelities.].\n\n\n\n\n\n\nThe results are presented in Fig. <ref>. To simplify the analysis, we evaluate the fidelities for a simplified channel, where  𝒫= δ(T_j-T') in Eq. <ref>, the excess noise is set as ϵ = 0, and η=1.\nOf all the non-Gaussian resources used, only two states represent an enhancement over the TMSV squeezed state: the PA-PS and the SB states. Moreover, the gain in fidelity is only observed when the squeezing in the entangled states is low, around r=4.7 dB. As the squeezing increases, the\nfidelities obtained by the non-Gaussian states get closer to the ones obtained by the TMSV state, for a value of r=10 dB, the difference in fidelity is of the order of 10^-2.\nWe point out that there is an agreement between the two non-Gaussian resources that represent an enhancement between the protocol presented here and CV quantum teleportation <cit.>. Moreover, when mode 3 is erased, the fidelities obtained using the non-Gaussian states are equal to the ones obtained when the TMSV state is used.\n\nNow, we address how the use of non-Gaussian states affects classical encoding. When non-Gaussian states are used, the syndrome measurement results follow a non-Gaussian PDF. Numerical integration over this non-Gaussian PDF indicates that the values of |Δ| required to keep low BER are considerably higher when the non-Gaussian states are used. Approximately 80% larger |Δ| is required in the SB and PA-PS states when mode 1 is erased[A case where the application of the PA-PS operation is applied to mode 2^o instead of mode 3^o during the preparation of the non-Gaussian state was also tested. The results showed no difference in the displacement requirements between the two cases.]. \n\n\n\n  \n\n\n\n§ DISCUSSION\n\n\nHere, we discuss our new results in relation to previous similar work, some alternative encoding schemes, and some additional input states.\n\n\n\n §.§ Relation to other work\n\nOther works \n<cit.> have previously looked at similar encoding schemes. In <cit.>, a three-mode encoding scheme was studied in the context of a quantum state sharing scheme. Although not aimed at the communication scenario, the nature of this scheme was similar to the encoding required for an erasure channel in the communication context. In <cit.>, a  four-mode encoding scheme used to transfer two coherent input states over an erasure channel was investigated. In <cit.>,  a three-mode encoding scheme similar to that used in the context of state sharing was analyzed for the communication scenario, with extensions to include non-Gaussian operations. This latter work was again only in the scenario of an erasure channel. Channel errors beyond a simple erasure were considered in <cit.> - namely, a displacement error.\n\nThe results presented here represent outcomes different from all these previous works in several aspects. First, we consider a  channel model more appropriate to that anticipated for free-space atmospheric communications in which one transceiver is untethered. Simulations of this channel are then used to analyze a modified protocol deployed over a three-mode channel. The key modification in the protocol is an optimization phase in which the transmissivity measured for each channel is used as an input. This allows for encoding and decoding in the more general case where transmissivities in all channels are non-zero. Importantly, our protocol leads to improved results relative to the situation where any loss is simply considered a complete erasure.  Second, we have included additional displacements within the encoding phase to include classical signaling. Third, we have investigated non-Gaussian operations within the modified protocol.\n\n\n\n\n §.§ Alternative  encodings and post selection\n\nThus far, we have considered combined classical-quantum communication embedded in the same signal. However, other possibilities exist. For example, the reference pulses could embed classical information – simple on-off keying being one scenario. In this scenario, the lack of any LO sent in a channel could indicate a zero and its presence, a one. The quantum signal, in this case, would not need an additional displacement, but the trade-off would be that the quantum information rate would be reduced. Exactly how much reduction would occur would depend on the coherence time of the channel and the pulse rate of the source, but for anticipated timescales of order 1ms and available pulse rates of 100MHz, this reduction would be minimal (since the channel is stable for thousands of sent LOs - these can be re-used). This trade-off of a reduced quantum information rate would have the benefit of a reduction in the excess noise of ≈ 0.02 and would yield an increase of fidelity (≈0.05).  \nAn added benefit would be a reduction of the complexity of deployment (one less displacement operation) and potential power savings (fewer LOs sent). On-off keying could also be applied to the quantum signals (with a vacuum detection being mapped to a zero). However, such schemes would need a modified digital modulation scheme  (to avoid `on' signals which have small displacements).\n\nOur results presented here have utilized an averaging over all channel conditions. In practice, post-selection could be utilized to select the channels such that, at most only one presents an erasure. Again, a trade-off in performance vs. throughput would be in play here. Post-selection would be most beneficial under high erasure error rates. For example, post-selecting to allow at most a single erasure at an error rate p_e=0.3 would have the benefit of the fidelity being increased by ≈0.15, at a reduction in throughput of 0.8.\n\n\n\n\n §.§ Entanglement distribution\n\nWe are also interested in evaluating the protocol's effectiveness in distributing entangled states.\nConsidering an input TMSV state, |ψ^in_MN⟩ with squeezing r_MN, we can evaluate the fidelity with the state obtained after mode M has been transmitted via the protocol. Although not shown, our results show that there are scenarios where an advantage over direct transmission can be found similar to before.\n\nFor equal squeezing values in the states |ψ_AB⟩ and |ψ^in_MN⟩, we observe the use of the protocol does present an advantage over direct transmission. \n\n\nIdeally, for entangled input states, we would like to test the protocol's effectiveness using an application of quantum communications, such as entanglement distribution.  However, using only fidelity can be an incomplete metric of the transmission of quantum information, especially for entangled states <cit.>. \nEntanglement distribution is perhaps better measured by computing the Reverse Coherent Information (RCI) of the channel, as it\nrepresents a lower bound on the distillable entanglement <cit.>.\nThe RCI is defined as,\n\n    ℛ= S(ρ_N) - S(ρ_MN),\n\nwith S(·) the Von Neumann entropy, and ρ_MN a maximally entangled TMSV state (r_MN→∞), where mode M has been transmitted via the channel using the protocol.  \n\n\n\nFor our protocol, an upper bound on the RCI can be found using the fact that the entropy is  concave,\n\n    S(ρ_MN) ≥∑_k p_k S(ρ_k),\n\nwhere the index k iterates over all possible erasure combinations on three modes (no erasure, erasure on mode 1, erasure on mode 2, and so forth), ρ_k is the corresponding state after error correction for combination k, and p_k the probability of each combination. In the combinations when error correction is not possible, e.g. erasures on modes 1 and 2,\n\nρ_k=_M[ρ^in_MN]. \nUsing the upper bounds of the RCI as a new metric, we are interested in comparing the protocol with direct transmission. Direct transmission, in this case, corresponds to transmitting mode M (of the state |ψ_MN⟩) via the channel. We compute the upper bounds of the RCI for the simplified channel used for Fig. <ref>.\n\n\nThe resulting upper bounds of RCI are presented in Fig. <ref>. The results show that the upper bound on the RCI obtained from the protocol and direct transmission is virtually equal for values T' close to 1; as T' decreases in value, the protocol stops presenting an advantage, and the RCI becomes lower than the one obtained by direct transmission.\nThe lack of an advantage by the protocol in this simulation can be understood by the fact that loss in the ancilla modes (modes 2' and 3') in the protocol propagates to the final state.\nThus, while the transmission of coherent states can be effectively enhanced by using the protocol presented here, we warn that this may not be the case for applications that are dependent on the distribution of entangled states.\n\n\n\n \n \n\n\n\n\n§ CONCLUSIONS\n\n\n\n\nIn this work, a new\n error correction protocol was introduced. Aimed at deployment over realistic free-space optical channels where at least one transceiver is untethered, the protocol was designed to encompass both classical and quantum information\non the encoded signal. We showed, relative to non-encoded\ndirect transmission, that the protocol improves the fidelity of\ntransmitted coherent states over a wide range of losses and\nerasure probabilities. In addition, using ancillary\nnon-Gaussian entangled bipartite states in the signal encoding\nfurther increased the fidelity of transmission.\nVariants on a theme for the protocol were discussed, including its application to the transmission of components of a multi-mode\nentangled state. Our results demonstrate that signal loss in atmospheric channels can be compensated for significantly at the price of additional implementation complexity.\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe thank Ziqing Wang for the valuable discussions. The Australian Government supported this research through the Australian Research Council's Linkage Projects funding scheme (project LP200100601). The views expressed herein are those of the authors and are not necessarily those of the Australian Government or the Australian Research Council. Approved for Public Release; Distribution is Unlimited; #23-0238.\n\n \n\n unsrt\n \n \n\n\n\n\n\n\n\n\n\n\n\n§ OUTPUT STATE CF DERIVATION\n\n\nWe will derive the CF of the output quantum state obtained by the protocol. To do so, we follow the diagram presented in Fig. <ref>.\nAs the first step, consider the application of a displacement operation on mode 2 of a bipartite state ρ̂_AB,\n\n    ρ'  = D̂(Δ) ρ̂_ABD̂^†(Δ).\n\nThen the CF of the state ρ' is,\n\n    _ρ'(λ_1, λ_2)    = [D̂(Δ) ρ̂_ABD̂^†(Δ) D̂(λ_1) D̂(λ_2) ]\n\nUsing the following properties of the displacement operator,\n\n    D̂(α)D̂(β) = e^(αβ^* - α^* β)/2D̂(α + β); \n       D̂^†(α)D̂(β)D̂(α) = e^(α^* β - αβ^*)D̂(β),\n\nthe CF of ρ̂' is then,\n\n    _ρ̂'(λ_1, λ_2)   =[ e^(Δ^* λ_2 - Δλ_2^*)D̂(λ_1) D̂(λ_2)  ρ̂_AB]\n       = _AB(λ_1, λ_2) D_Δ(λ_2)\n\nwhere we defined the function  D_Δ(λ) = e^(Δ^* λ_ - Δλ^*) and _AB is the CF of ρ̂_AB.\nNow the CF of the initial state at the start of the protocol, considering the displacement applied to the entangled state, is\n\n    _s(λ_1)_AB(λ_2, λ_3)D_Δ(λ_2).\n\nThe effect of BS1 acting on modes 1 and 3 can be described as a change in variables, such as\n\n    _s(λ_1 + λ_2/√(2))\n      _AB(λ_1-λ_2/√(2), λ_3) \n     D_Δ(λ_1 -λ_2/√(2)).\n\nAfter that, the effect of the loss acting independently on every channel transforms the CF to\n\n    _s(√(T_1)λ_1 + √(T_2)λ_2/√(2))\n      _AB(√(T_1)λ_1-√(T_2)λ_2/√(2), √(T_3)λ_3) \n       ×D_Δ(√(T_1)λ_1 -√(T_2)λ_2/√(2))\n       _|0⟩( T_1^* λ_1 ) _|0⟩( T_2^* λ_2 ) \n       ×_|0⟩( T_3^* λ_3 ),\n\nwith T_j^*=√(1 + ϵ - T_j).\nThereafter, BS2 is applied by Bob on modes 1' and 2',\n\n    _s(√(T_1)(λ_1 + λ_2) + √(T_2)(λ_1 - λ_2)/2)\n       ×_AB(√(T_1)(λ_1 + λ_2) - √(T_2)(λ_1 - λ_2)/2, √(T_3)λ_3) \n       ×D_Δ(√(T_1)(λ_1 + λ_2) - √(T_2)(λ_1 - λ_2)/2) \n       ×_|0⟩( T_1^* (λ_1+λ_2)/√(2))\n      _|0⟩( T_2^* (λ_1-λ_2)/√(2))\n      _|0⟩( T_3^* λ_3 ).\n\nFinally, to perform a dual homodyne measurement, BS3 is applied, transforming the state.\n\nThe efficiency of the homodyne measurements can be modeled by considering a BS with transmissivity η^2, with an extra vacuum mode placed before the detectors.\nThen the CF of the state  before homodyne measurements is,\n\n    _BS3 (λ_1, λ_2, λ_3)   = \n    _BS3' (λ_1, λ_2,   λ_3) \n      D_Δ(λ_1 T_ + (λ_2 + λ_3)/√(2)η T_),\n\nwhere\n\n    _BS3' (λ_1, λ_2, λ_3)= \n        _s(λ_1 T_ + λ_2 + λ_3/√(2)η T_) ×\n        _AB(λ_1 T_ + (λ_2 + λ_3)/√(2)η T_ , √(T_3)η (λ_2-λ_3)/√(2)) ×\n        _|0⟩( T_1^* (λ_1/√(2) +ηλ_2 + λ_3/2) )×\n        _|0⟩( T_2^* (λ_1/√(2) -ηλ_2 + λ_3/2)) ×\n        _|0⟩( T_3^* ηλ_2 -λ_3/√(2)) _|0⟩(√(1-η^2)λ_1 ) ×\n        _|0⟩(√(1-η^2)λ_2 ).\n\n\nIt is convenient to express the measurement results in the phase space representation by transforming the complex arguments into two real numbers, x_j = λ_j + λ_j^* and p_j=i(λ_j^* - λ_j).\nThen the homodyne measurements are represented by integrating the measured modes.\n\n    _m(x, p)    = 𝒫(x̃, p̃)^-1/(2π)^2∫ d x_2 d p_3 _BS3(x, p, x_2, 0, 0, p_3 ) \n                          × e^-ix̃p_3 + ip̃x_2,\n\nwith 𝒫̃(x̃, p̃) the PDF of any pair of measurement results, given by\n\n    𝒫̃(x̃, p̃ )= 1/(2π)^2∫ d x_2 d p_3 _BS3(0, 0, x_2, 0, 0, p_3 ) \n    × e^-ix̃p_3 + ip̃x_2.\n\nExpanding the terms in D_Δ, we have, \n\n    D_Δ   (x_1 T_ +  x_2/√(2)η T_, p_1 T_ + p_3/√(2)η T_) =  \n       exp[-ix_1 T_Δ +i p_1  T_Δ]\n    ×\n       exp[-ix_2 η T_Δ/√(2) +i p_3 ηT_Δ/√(2)].\n\nInserting this expression into Eq. <ref> and manipulating the terms, it becomes clear that the mean of the syndrome measurement results is displaced following Eqs. <ref>.\n\nThe additional exponential term in Eq. <ref> indicates that the state after the measurement requires a corrective displacement to be recovered. This corrective displacement must also account for the additional displacement induced by the displacement Δ. The corrective displacement can be implemented via,\n\n    D̂_corr(x̃, p̃) =    exp[ - ip (√(2)x̃' g + T_Δ) + \n         i x(√(2)p̃' g +T_Δ)],\n\nwith \n\n    x̃' = x̃-μ_x̃, \n    p̃' = p̃+μ_p̃,\n\nwhere μ_x̅(p̅) is defined in Eq. <ref>.\nHere, the correction includes a factor of √(2) to compensate for the global factor that appears in the arguments of _BS3 in Eq. <ref>.\n\n\nFinally, since the output CF will depend on a specific set of measurement results,\nthe mean over all possible measurement outcomes, weighted by their corresponding probability, must be considered, that is\n\n    _out(x, p)    = ∫ d x̃ d p̃𝒫(x̃, p̃) _m(x, p) D̂_corr(x̃,p̃) \n       = 1/(2 π)^2∫ d x̃ d p̃ d x_2 d p_3\n     _BS3 '(x, p,x_2, 0, 0, p_3 ) \n                 × e^i x̃' (p_3 - √(2) p g) - i p̃' (x_2 - √(2) x g).\n\nAt this point, the definition of the Dirac delta function, 1/2π∬ e^iβ x -iβαf(α)dβ dα = ∫δ (x - α)f(α)dα, can be used twice to obtain\n\n    _out(x, p)   = ∫ d x_2 d p_3 δ (p_3 - √(2)p)δ (x_2 -√(2)x) \n               ×_BS3'(x, p, x_2, 0, 0, p_3 ).\n\nRemoving the integrands using the properties of the δ function, the Eq. <ref> presented above is recovered.\n\n\n\n§ SPECIFIC EXAMPLES OF ERROR CORRECTION\n\n\nTo further understand the error correction, we outline the following three cases, corresponding to different values of g.\n\n\n  §.§.§ g=0\n\n\n    _s(T_λ) \n    _AB(T_λ , 0 )\n    _|0⟩(√(1 + ϵ - T_1 + T_2/2)λ).\n\nIn this case, the resulting state is independent of the value of T_3. \nMoreover,\nthe excess noise in channels 2' and 3' does not propagate to the output state. However, when T_1 ≠ T_2 imperfect \ndestructive interference in BS2 will translate to additional excess noise introduced by the entangled state, which will be proportional to the squeezing of the state. When T_1=T_2, the resulting state is equivalent to the one obtained if the signal state were to be transmitted directly through the channel without using the protocol. \n\n\n  §.§.§ g=1/η\n\n\n    _s(√(T_1)λ) \n    _AB(√(T_1)λ, √(T_3)λ^* ) ×\n       _|0⟩(√(3 + 3ϵ + 2(1/η^2 -1) - 2 T_1 - T_3)λ).\n\nThe resulting state will be independent of the value of T_2. Unlike the previous case, the resulting state is affected by the loss and excess noise affecting modes 2' and 3'. Consider the case when T_1=T_3, then it becomes clear that the vacuum contribution appears in the output state three times. On an ideal scenario, with T_1=T_3=1, the quantum signal can be fully recovered in the limit V →∞ as in this limit _AB(λ, λ^*) → 1 (see Eq. <ref>) <cit.>.\n\n\n  §.§.§ g=-1/η\n\n\n    _s(√(T_2)λ )\n    _AB(-√(T_2)λ, -√(T_3)λ^* ) ×\n       _|0⟩(√(3 + 3ϵ + 2( 1/η^2 -1) - 2 T_2 - T_3)λ).\n\nIn this case, the resulting state is independent of T_1. Similarly to the previous case, the loss and excess noise from the ancillary entangled state propagates to the output state.\n\n\n\n\n§ FIDELITY OF TRANSMISSION\n\n\nTo compute the fidelity between the states |ϕ_in⟩ and |ϕ_out⟩ first the CF of _out is obtained using Eq. <ref>.  Next, an analytical expression for a single input coherent state can be obtained by solving the integration in Eq.<ref>. Finally, this fidelity is averaged over the ensemble of coherent states by solving the integral in Eq. <ref>.\nThe expression obtained is,\n\n    ℱ= 2/2σ_α( T_ + g̃ T_ -1)^2  + c_1 + 1,\n\nwith \n\n    c_1 =    V((T_ + g̃ T_)^2 + T_3g̃^2)- \n       2√(V^2-1)(T_ + g̃ T_)√(T_3)g̃ + (T_ + g̃ T_)^2 + \n       (1 + ϵ) (2g̃^2 + 1) + g^2(1 - η^2) - T'.\n\n\nAdditionally, the analytical expression for the fidelity of direct transmission can be obtained by following the same procedure as above, where the CF of the state transmitted directly through the channel replaces _out. The expression obtained is,\n\n    ℱ̅^DT= 2/2σ_α(√(T)-1)^2 + 2.\n\nwhere T is the transmissivity of the channel.\n\n\n\n\n§ DERIVATION OF THE SNR OF THE MEASUREMENT RESULTS\n\n\nThe SNR ratio of the syndrome measurement is used to calculate the bit error rate of the encoded classical communications. To find the SNR, we need to find the variance of the syndrome measurement results, σ_s. \nIf all the states involved in the protocol are Gaussian, then solving the integrating in Eq. <ref>, we observe that 𝒫̃ corresponds to a Gaussian distribution, \n\n    𝒫̃(x̃, p̃) = 1/2σ_sπexp[-x̃'^2 + p̃'^2/2σ_s^2],\n\nwhere\n\n    σ_s^2 = η^2 ( T_^2 σ_α + c_2 ) + 1.\n\nwith\n\n    c_2 =     V(T_^2/2 + T_3/2) - √(V^2-1)(T_√(T3)) +  \n       T_^2/2 + (ϵ- T'/2).\n\n\n\n\n\n§ CF OF NON-GAUSSIAN STATES\n\n\n\n\n  §.§.§ Photon addition, photon subtraction, and photon catalysis\n\nIn the following, we apply the procedures of <cit.> for determining CFs.\nThe unnormalized CF of the state resulting from the application of the non-Gaussian operation to a mode of the TMSV state after it has been transmitted through the  channel is,\n\n    '_PS(   ξ_A, ξ_B)\n    \t\t=T_κ-1/T_κexp[-|ξ_B|^2/2[\n       ×∂^2/∂ξ_B∂ξ_B^*[\n    \t\texp[|ξ_B|^2/2]\n    \t\tf(ξ_A, ξ_B, √(T_κ))\n    \t\t],\n\nwhere\n\n    f(ξ_A, ξ_B, √(T_κ))=∫d ξ^2/π (1-T_κ)_TMSV(ξ_A, ξ)\n       ×exp[\n    \t\t\t1+T_κ/2(T_κ-1)(|ξ|^2+|ξ_B|^2) +\n    \t\t\t√(T_κ)/T_κ-1\n    \t\t\t(ξ_Bξ^*+ξ_B^*ξ)\n    \t\t\t].\n\nSimilarly, the unnormalized CF after the PA operator is applied is,\n\n    '_PA(ξ_A,    ξ_B)\n    \t\t=(T_κ-1)\n    \t\texp[|ξ_B|^2/2[\n       ×∂^2/∂ξ_B∂ξ_B^*[\n    \t\texp[-|ξ_B|^2/2[\n    \t\tf(ξ_A, ξ_B, √(T_κ))\n    \t\t].\n\nWhen the PC operator is applied, the unnormalized CF is,\n\n    '_PC(ξ_A,    ξ_B)\n    \t\t=q^2\n    \t\texp[|ξ_B|^2/2[∂^2/∂ξ_B∂ξ_B^*{exp[-|ξ_B|^2[\n       ×∂^2/∂ξ_B∂ξ_B^*[\n    \t\texp[|ξ_B|^2/2[\n    \t\tf(ξ_A, ξ_B, √(T_κ))\n    \t\t]}\n       -q\n    \t\texp[|ξ_B|^2/2[∂/∂ξ_B{exp[-|ξ_B|^2[\n       ×∂/∂ξ_B^*[\n    \t\texp[|ξ_B|^2/2[\n    \t\tf(ξ_A, ξ_B, √(T_κ))\n    \t\t]}\n       -q\n    \t\texp[|ξ_B|^2/2[∂/∂ξ_B^*{exp[-|ξ_B|^2[\n       ×∂/∂ξ_B[\n    \t\texp[|ξ_B|^2/2[\n    \t\tf(ξ_A, ξ_B, √(T_κ))\n    \t\t]}\n       +f(ξ_A, ξ_B, √(T_κ)),\n\nwhere q=T_κ-1/T_κ.\n\nFor the sequential use of the PS and PA operators, the operations PS-PA and PA-PS, we consider the two non-Gaussian operations to use the same beam-splitter transmissivity, T_κ.\nFor PS-PA, the unnormalized CF is,\n\n    '_PS-PA(ξ_A, ξ_B)\n         =q^2\n    \t\texp[|ξ_B|^2/2[∂^2/∂ξ_B∂ξ_B^*{exp[-|ξ_B|^2[\n         ×∂^2/∂ξ_B∂ξ_B^*[\n    \t\texp[|ξ_B|^2/2[\n    \t\tf(ξ_A, ξ_B, T_κ)\n    \t\t]}.\n\nThe unnormalized CF for PA-PS is,\n\n    '_PA-PS(ξ_A, ξ_B)\n         =(T_κ-1)^2\n    \t\texp[-|ξ_B|^2/2[∂^2/∂ξ_B∂ξ_B^*{exp[|ξ_B|^2[\n         ×∂^2/∂ξ_B∂ξ_B^*[\n    \t\texp[-|ξ_B|^2/2[\n    \t\tf(ξ_A, ξ_B, T_κ)\n    \t\t]}.\n\n\n\n\n\n  §.§.§ Squeezed Bell-like states\n\nThe normalized CF of an SB state is <cit.>,\n\n    _SB(ξ_A, ξ_B) = (cos^2(ϑ) + sin^2(ϑ))^-1/2\n       exp[-1/2(|ξ_A'|^2 + |ξ_B'|^2 ) ]\n      [ cos^2(ϑ)  + 2 cos(ϑ)sin(ϑ)  \n       ×{ξ_A' ξ_B'   } +  sin^2(ϑ) (1 - |ξ_A'|^2) (1 - |ξ_B'|^2)  ],\n\nwhere { z} is the real part of z and the transformation given by Eq. <ref>, is used.\n\n\n\n\n\n\n\n"}