{"entry_id": "http://arxiv.org/abs/2303.07385v1", "published": "20230313180221", "title": "Linearised conformal Einstein field equations", "authors": ["Justin Feng", "Edgar Gasperin"], "primary_category": "gr-qc", "categories": ["gr-qc"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nplain\npropositionProposition\nlemmaLemma\ntheoremTheorem\nassumptionAssumption\n*conjectureConjecture\n*subconjectureSubconjecture\ncorollaryCorollary\nmainMain Result\n*definitionDefinition\nremarkRemark\n\n           \n          \n            \n         \n\n\n\n\nIndRemark\n  \n\n  0.95\n  \n\n\n\n\n\n\nIndAssumption\n  \n\n  0.95\n  \n\n\n\n\n\n\nIndProposition\n  \n\n  0.95\n  \n\n\n\n\n\n\n\n\n\na\nb\nη\ng\nσ\nℓ\nL\ne\np\nf\nF\nT\nQ\nS\nΨ\nH\nΣ\n\n∇\ng\nL\n…s\nΞ\nd\nΦ\nT\nF\n\n\n\n\n\n\n\n\n\n\n\n\n\n,1]Justin Feng\n  [E-mail address:justin.feng@tecnico.ulisboa.pt]\n,2]Edgar Gasperín\n  [E-mail address:edgar.gasperin@tecnico.ulisboa.pt]\n\n  [1,2] CENTRA, Departamento de Física, Instituto Superior\n    Técnico IST, Universidade de Lisboa UL, Avenida Rovisco Pais 1,\n    1049 Lisboa, Portugal\n\n\nLinearised conformal Einstein field equations\n    [\n    March 30, 2023\n=============================================\n\n\n  The linearisation of a second-order formulation of the conformal\n  Einstein field equations (CEFEs) in Generalised Harmonic Gauge (GHG),\n  with trace-free matter is derived.  The linearised equations are\n  obtained for a general background and then particularised for the\n  study linear perturbations around a flat background —the inversion\n  (conformal) representation of the Minkowski spacetime— and the\n  solutions discussed. We show that the generalised Lorenz gauge\n  (defined as the linear analogue of the GHG-gauge) propagates.\n  Moreover, the equation for the conformal factor can be trivialised\n  with an appropriate choice for the gauge source functions; this\n  permits a scri-fixing strategy using gauge source functions for the\n  linearised wave-like CEFE-GHG, which can in principle be generalised\n  to the nonlinear case. As a particular application of the linearised\n  equations, the far-field and compact source approximation is employed\n  to derive quadrupole-like formulae for various conformal fields such\n  as the perturbation of the rescaled Weyl tensor.\n\n\nKeywords: conformal boundary, conformal\nEinstein field equations, scri-fixing.\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nAlthough nowadays gravitational wave effects can be studied using the\nfull non-linear Einstein field equations, linear perturbation theory\nremains an active area of research, e.g. black hole perturbation\ntheory, quasinormal modes, post-Newtonian and post-Minkowskian\nexpansions.  As it is well-known, the concept of gravitational radiation\ncan be traced back to 1918 to the study of the linearisation of the\nEinstein field equations around flat spacetime and the derivation of the\ncelebrated quadrupole formula. However, a rigorous formulation of the\nnotion of gravitational radiation had to wait for further development of\nmathematical aspects of the theory put forward by Bondi, Sachs, Newman\nand Penrose and others in the decade of 1960 —see <cit.> for a historical review.  The notion of null-infinity (and\nmore generally the notion of a conformal boundary) developed in the\naforementioned theory proved crucial for the modern understanding of\ngravitational radiation.\n\n\n\nNull-infinity ℐ corresponds to an idealisation of the\nasymptotic region of the physical spacetime (ℳ̃,\n) and it is defined through a conformally related manifold\n(ℳ,) where =Ξ^2 so that\nℐ can be identified with the region where Ξ=0 —but\n∇_a Ξ≠ 0.  Unfortunately, the Einstein field equations\n(EFEs) are not conformally invariant so evaluating quantities at\nℐ is non-trivial. To circumvent this problem, there are\ndifferent approaches aimed at specific goals. For instance, the\nhyperboloidal approach in their different renditions <cit.>\nrepresents a compromise between the preservation of standard\nformulations of the EFEs used in Numerical Relativity and the inclusion\nof  ℐ at the expense of dealing with formally singular (but\nnumerically tractable) equations.  On the other hand, there exists\nanother strand of research that stems from taking further the conformal\napproach while insisting on having formally regular equations.  This\nconformally regular approach was initiated in 1981 when H. Friedrich\nderived in <cit.> a reformulation of the Einstein field equations\nknown as the conformal Einstein field equations (CEFEs) —see\n<cit.> for an exhaustive discussion. One of the distincive\nfeatures of the CEFEs is that the conformal factor is a variable, hence\nthe location of the conformal boundary is not fixed a priori. Strategies\nfor fixing the conformal boundary, or scri-fixing, have been\nintroduced for the CEFEs in <cit.> for vacuum and <cit.> for trace-free\nmatter, but they require the existence of a congruence of conformal\ncurves.\n\n\n\nDespite many advances in the mathematical analysis of spacetimes and\nnumerical evolutions with the CEFEs  <cit.>, the application of the CEFEs\nto physical problems has been surprisingly limited. This is evident in\n(and possibly a result of) the fact that the application of linear\nperturbation theory to the CEFEs has not been studied in the existing\nliterature. Such an analysis is needed to make contact with standard\n(linear) metric approaches to characterising gravitational radiation.\nThis article aims to provide a first step in this direction by\nstudying the linearisation of the CEFEs in a form that resembles\nstandard formulations of the linearised Einstein field equations. \n\n\n\nThe core of the CEFEs are the Bianchi identities, which provide a set of\nevolution and constraint equations for the Weyl curvature (coupled with\nother fields in the non-linear case). One approach to the linearised\nproblem concerns the study of the spin-2 equation in a fixed background\nspacetime, which can be thought as the linearisation of the Weyl sector\nof the CEFEs in spinorial form. The spin-2 equation on a particular\nbackground known as the Minkowski i^0-cylinder has been analysed in\n<cit.>.  The spin-2 equation\n∇_A'^Aϕ_ABCD=0, although elegant, looks very different\nto the standard linearisation of metric formulations of the Einstein\nfield equations.  Hence, in this article, we study the linearisation not\nof the original set of CEFEs but rather we start from a metric and\nsecond-order formulation of the CEFEs which is closer in spirit to\nstandard hyperbolic reductions of the EFEs in generalised harmonic gauge\n(GHG) employed in Numerical Relativity. This non-linear wave-like\nformulation of the CEFEs was originally derived in the vacuum case in\n<cit.> and has been extended for the case of trace-free matter in\n<cit.>. In this paper, we linearise these equations around a\ngeneral background and then the solutions to the linearised equations\naround flat spacetime are studied. As a concrete application of the\nlinearisation, we derive, in the far-field approximation,\nquadrupole-like formulae for the conformal fields, obtaining in\nparticular a quadrupole-like formula for the perturbation of the\nrescaled Weyl tensor. As a byproduct, we show how the gauge source\nfunctions can be chosen so that the conformal factor remains\nunperturbed. This can be regarded as a “scri-fixing” strategy for the\nlinearised CEFEs for trace-free matter. We then argue that the same\nstrategy carries over to the non-linear wave-CEFEs in the context of the\nhyperboloidal initial value problem, providing a simpler alternative to\nthe scri-fixing strategy in <cit.> based on conformal\ncurves.\n\n\n\n\n §.§ Notations and conventions\n\n\n\nThe signature convention for (Lorentzian) spacetime metrics will be (-,+,+,+). Latin indices from the first half of the alphabet\na,b,c,,... will be used as abstract tensor indices while Greek indices\nwill denote spacetime coordinate indices, taking values from the set\n{0,1,2,3}.  If an adapted coordinate system (with coordinates\nx^μ) is introduced, x^0=t represents the time coordinate, and\nLatin indices from the second half of the alphabet represent spatial\nindices, taking values from the set {1,2,3}. Symmetrisation and\nantisymmetrisation of tensors will be denoted with round and square\nbrackets and taking the trace-free part of a tensor will be denoted by\nadding {} on the relevant indices. For instance T_(ab):=\n12(T_ab + T_ba), T_[ab]:=12(T_ab -\nT_ba) and T_{ab}:= T_ab - 14g_abT.  The curvature\nconventions are fixed by the relation\n\n    (∇_a ∇_b -∇_b ∇_a) v^c = R^c_dab v^d.\n\nAlthough we will occasionally refer to expressions in spinorial form (as\nmuch of the literature on the CEFEs employs spinor notation), all\ncalculations in this article are performed in tensor notation.\n\n\n\n\n §.§ Organisation of the paper\n\n\n\nSection <ref> gives a brief summary of the CEFEs and the\nwave-like hyperbolic reduction of <cit.>. This is included to\ngive a concise reference to the reader and to provide the non-linear\ncontext of the equations studied in this paper.  Section\n<ref> contains the linearisation of the wave-CEFEs\nin GHG around a general background.  Section <ref>\nparticularises the equations for a flat background and discusses the\nperturbed solutions via Green's functions methods and, in the far-field\napproximation, quadrupole-like formulae for the conformal fields are\nderived.\n\n\n\n\n\n§ THE CONFORMAL EINSTEIN FIELD EQUATIONS\n\n\n\n\n\nThe conformal Einstein field equations (CEFEs) are a reformulation of\nthe Einstein field equations (EFEs) with the aim of dynamically\nimplementing R. Penrose's conformal approach. The CEFEs were originally\nintroduced in <cit.> and encode a set of differential conditions\nsatisfied by the geometry of a conformal extension (ℳ,)\nof a spacetime (ℳ̃,) (with\n=Ξ^2) satisfying the EFEs. To differentiate between\nthese two, the pair (ℳ,) is called the unphysical\nspacetime while the pair (ℳ̃,) is called\nthe physical spacetime.  The feature that distinguishes the CEFEs\nfrom other reformulations of the EFEs is that (for trace-free matter)\nthe CEFEs are formally regular at Ξ=0 —see\n<cit.>. To see this and concisely introduce the\nCEFEs, it is convenient to define the following zero-quantities\n—see <cit.> for an extensive discussion:\n\n\n    Z_ab := ∇_a∇_bΞ +Ξ L_ab - s g_ab -\n      1/2Ξ^3T_{ab}=0 ,\n      \n           Z_a := ∇_as +L_ac∇ ^cΞ -\n     1/2Ξ^2T_{ab}∇^bΞ -\n     1/6Ξ^3∇^bT_{ba}=0 , \n          δ_bac := ∇_aL_bc-∇_bL_ac -\n     d^d_cab∇_dΞ -Ξ T_abc =0 ,\n     \n          λ_abc:=\n     ∇_ed^e_abc-T_bca=0 , \n           P^c_dab :=  R^c_dab - Ξ d^c_dab - \n     2( δ^c_[aL_b]d -\n       g_d[aL_b]^c).\n     \n           Z := λ - 6 Ξ s + 3 ∇_aΞ∇^aΞ\n     -1/4Ξ^4T=0\n           M_a:=∇^bT_ba - Ξ^-1T∇_aΞ=0.\n\n\nwhere Ξ is the conformal factor, s is the Friedrich scalar,\nL_ab is the Schouten tensor, R^a_bcd is the Riemann\ntensor, d^a_bcd is the rescaled Weyl tensor, T_ab is\nthe rescaled energy-momentum tensor with trace T:=g^abT_ab\nand T_abc is the rescaled Cotton tensor. The zero-quantities\nZ_ab, Z_a, δ_abc,λ_abc , Z and M_a are defined\nsimply as a bookkeeping device in the sense that the CEFEs are satisfied\nwhen a collection of fields\n\n    {g_ab,  Ξ,   s ,L_ab,  d_abcd,  T_ab,   T_abc}\n\nsolve the equations\n\n    Z_ab=0,    Z_a=0,   δ_abc=0,   λ_abc=0,     P^d_abc=0,    Z=0,    M_a=0.\n\n\n\n   Observe that the only singular terms in the zero-quantities\n  (<ref>) appear with the trace of the unphysical\n  energy-momentum tensor, specifically in equation\n  (<ref>). However for trace-free\n  matter all the equations implied by the zero-quantities\n  (<ref>) are formally regular at Ξ=0. \n\n\n\nThe geometric variables are defined via\n\n    s   := 14∇_a∇^aΞ +\n      124RΞ,\n     L_ab   :=12R_ab-112Rg_ab,\n      \n     d^a_bcd   :=Ξ^-1C^a_bcd.\n\nwhere R_ab and R denote the Ricci tensor and Ricci scalar of\n(ℳ,) while C^a_bcd is the conformally invariant\nWeyl tensor. Given a solution to the CEFEs, it can be verified that the\nassociated physical metric g̃_ab=Ξ^-2g_ab will satisfy\nthe Einstein field equations:\n\n    R̃_ab-1/2R̃g̃_ab + λg̃_ab= T̃_ab ,\n \nwhere T̃_ab is the physical energy-momentum tensor, λ\nis the cosmological constant, and R̃_ab and R̃ are\nthe respective Ricci tensor and Ricci scalar. The matter variables in\n(<ref>) are related to their physical counterparts\nas:\n\n    T_ab    :=Ξ^-2T̃_ab,      T:=Ξ^-4T̃,\n          T̃:=g̃^abT̃_ab ,\n      \n    \n      T_abc    :=Ξ^-1∇̃_[aT̃_b]c\n      -1/3Ξ^-1g̃_c[b∇̃_a]T̃ .\n\nHere T̃_ab is the physical energy-momentum tensor and\n∇̃ is the Levi-Civita connection of g̃_ab. A\ncomprehensive discussion and derivation of the CEFEs can be found in\n<cit.>.\n\n\n\n   Though the conceptually clean setup is the vaccum case, we\n  include matter primarily for the purpose of deriving quadrupole-like formulae in subsection <ref>.\n\n\n\n\n\n  \n  From this point onward, it will be assumed that only trace-free\n  matter models are in consideration. Notice that the conditions T=0\n  and T_{ab}=T_ab simplify some of the matter terms in the\n  zero-quantities (<ref>).\n  \n\n\n\nWe now consider some properties of the rescaled Cotton tensor under the\ntrace-free matter assumption. Under this assumption, the rescaled Cotton\ntensor can be written in terms of the unphysical energy-momentum tensor\nas\n\n    T_abc    :=Ξ∇_[aT_b]c\n      + 3 T_c[b∇_a]Ξ -g_c[aT_b]e∇^eΞ .\n\nObserve as well that the Cotton tensor has the symmetries\nT_abc=T_[ab]c and T_[abc]=0. Furthermore, the trace-free\nassumption and ∇̃^aT̃_ab=0 implies that\n\n    ∇^aT_ab=0,     ∇_cT_ab^c     = 0.\n\nAdditionally, using again equations (<ref>),\n(<ref>)\n and  exploiting Z_ab=0 gives\n\n    ∇ _aT_b^a_c =   \n      - 12Ξ∇ _a∇ ^aT_bc\n      - (4 s - 13Ξ  R)T_bc  +  Ξ ^3 T_b^a T_ca\n      - 12Ξ ^2 T^ad d_bacd  \n       - 14Ξ ^3 T_ad T^ad g_bc\n       \n      + ∇ ^aΞ  (-2 ∇ _aT_bc +  ∇ _(bT_c)a).\n\n\n\n\n  The Ricci scalar R is not determined by the CEFEs and in fact, it\n  encodes the conformal gauge freedom. Given two conformal extensions of\n  the same physical spacetime  =Ξ^2 and\n  =Ξ̌^2 one has that\n  =ϰ^2 with ϰ := Ξ̌/Ξ\n  and ϰ≃𝒪(1) at the conformal boundary.\n  Hence, their Ricci scalars are related via\n  \n    6 ∇_a ∇^a ϰ -R ϰ =- Řϰ^3.\n\n  Observe that if Ř is considered as a given scalar function in\n  (ℳ,) then, this equation can always be solved locally\n  for ϰ. Thus, the Ricci scalar in the CEFEs is a gauge\n  quantity that is called the conformal gauge source function\n  —see <cit.> for further discussion.\n  \n\n\n\nIn this article, we will adhere to the metric formulation of the CEFEs\nwhich consists of using the definition of the Schouten tensor to obtain\n an equation for the metric. Namely, from\n\n    R_ab=2L_ab + 1/6Rg_ab,\n\none substitutes the expression for the Ricci tensor as second\nderivatives of the metric respect to some coordinate basis x^μ and\nreads L_μν as a source term in the resulting equation. The\nsource term L_μν is then coupled to the rest of the variables\nvia equations (<ref>).\n\n\n\n  \n   In view that the Ricci scalar is the conformal gauge source function,\n   to have a clean split between gauge quantities and non-gauge\n   quantities one could opt for using the trace-free Ricci tensor as\n   variable instead of L_ab,\n  \n    Φ_ab := 1/2(R_ab - 1/4Rg_ab).\n\n  The factor 1/2 in its definition is conventional and it is put so\n  that Φ_ab corresponds to the tensorial counterpart of the\n  trace-free Ricci spinor Φ_AA'BB' of the Newman-Penrose\n  formalism. In this case, the evolution equation for the metric is read\n  of from\n  \n    R_ab=2Φ_ab + 1/4Rg_ab.\n\n  For convenience, we employ such a splitting, and will use the\n  trace-free Ricci tensor rather than the Schouten tensor as a dynamical\n  variable.\n  \n\n\n\nThere are different hyperbolic reduction strategies to turn the\ntensorial expressions (<ref>) into partial\ndifferential equations.  In the next section, we revisit a hyperbolic\nreduction that is most appropriate for the aims of this article. \n\n\n\n\n §.§ Geometric wave equations\n\n\n\n\nA first derivation of the metric conformal Einstein field equations as a\nset of wave equations was given in <cit.> for the vacuum case and\nin <cit.> for the case of trace-free matter. Our discussion\ndiffers in the use of the trace-free Ricci tensor instead of the Schouten\ntensor; we do this to make transparent the split between gauge and\nnon-gauge quantities. Since we only make a simple variable change, the\nderivation will not be repeated here. The geometric wave equations read\n\n\n    □Ξ  = 4 s - 16Ξ R ,\n       □ s = ΞΦ _abΦ ^ab\n      - 16∇ _aR ∇ ^aΞ\n      - 16 s R + (R12)^2 Ξ\n      + 14Ξ ^5 T_ab T^ab\n      - Ξ ^3 T^abΦ _ab\n      + Ξ  T_ab∇ ^aΞ∇ ^bΞ,\n      \n      \n       □Φ_ab = 4 Φ _a^cΦ _bc\n      - Φ _cdΦ ^cd g_ab\n      -2 ΞΦ ^cd d_acbd + 13Φ _ab R\n      + 16∇ _b∇ _aR\n      - 124 g_ab□ R \n                                             \n      +   12Ξ ^3 T^dc d_adbc\n      - Ξ∇ _cT_b^c_a\n      - 2T_(a|c|b)∇ ^cΞ,\n      \n      \n       □ d_abcd =  12 d_abcd R\n      + 2 Ξ  d_a^e_d^p d_becp\n      -2 Ξ  d_a^e_c^p d_bedp\n      -2 Ξ  d_ab^ep d_cedp\n              - Ξ^2T_[c^ed_d]eab\n      - Ξ^2T_[a^ed_b]ecd\n      + Ξ^2T^ep( d_aep[cg_d]b - d_bep[cg_d]a )\n      + 2 ∇_[aT_|cd|b]\n                                           \n        +2 ∇_[cT_|ab|d]+ 2 g_d[b∇_|eT_c|^e_a]\n        + 2 g_c[a∇_|eT_d|^e_b],\n\n\nwhere □=∇_a∇^a denotes the geometric wave\noperator. Observe that these are tensorial in the same way as\nexpressions (<ref>) and they do not include an\nequation for the metric.  When recast in this form, the original set\nof equations (<ref>) form constraints on initial\ndata; the propagation of the constraints was shown in\n<cit.>.  A further discussion of these wave equations as an\nexplicit system of second order hyperbolic PDEs is given in Appendix\n<ref> —see also <cit.>.\n\n\n\n   \n  To obtain a set of equations for the matter fields encoded in T_ab\n  and T_abc, an explicit matter model is required. Namely, given a\n  matter model consisting on some fields τ={τ_1, ...\n  ,τ_n} so that T_ab=T_ab(τ) —and hence\n  T_abc=T_abc(τ, ∇τ) using equation\n  (<ref>)—one has to derive wave equations for\n  each of the fields encoded in τ and their derivatives. To give\n  a concise and general discussion, the wave equations for the matter\n  fields will not be presented as this is a case-dependent analysis and\n  can be revisited for a number of trace-free matter models in\n  <cit.>.\n  \n\n\n\n\n\n\n §.§ Wave equation for metric\n\n\n\nThe wave equation for the metric is derived from the expression of the\ntrace-free Ricci tensor in some fiduciary coordinate system x^μ.\nHere and in what follows, Γ^μ_αβ will denote the\nChristoffel symbols of the Levi-Civita connection ∇ of  in\nthe coordinate basis x^μ.  First, one defines the GHG-constraint as\n\n    C^μ := Γ^μ + ℋ^μ,\n\nwhere Γ^μ:=g^αβΓ^μ_αβ are\nthe contracted Christoffel symbols and ℋ^μ are the\ncoordinate gauge source functions.  Recall that Γ^μ =\n- ∇_α∇^αx^μ so that setting C^μ=0 is\nequivalent to imposing the generalised harmonic gauge condition\n\n    ∇_α∇^αx^μ= ℋ^μ.\n\nwith the above definitions, the reduced Ricci tensor\nℛ_μν is defined as\n\n    ℛ_μν:=R_μν - ∇_(μC_ν).\n\nA customary calculation —see for instance <cit.>— shows that the reduced Ricci tensor can be\nexpressed in terms of derivatives of the metric as\n\n    ℛ _μν = - 12 g_μν -\n      ∇ _(μℋ_ν)  + g^σδg^αβ\n      (Γ_νδβΓ_σμα +\n      2Γ_δνβΓ_(μν) α )\n\nwhere := g^αβ∂_α∂_β is\nthe standard reduced wave operator.  Similarly, recalling that\nthe Ricci scalar of  encodes the conformal gauge freedom, one\nintroduces\n\n    C := R - F\n\nwhere F is the conformal gauge source function.  Imposing the\nconstraint C=0 is equivalent to choosing a representative from the\nconformal class [] in the same way that imposing C^μ=0 is\nequivalent to choosing the coordinates to satisfy equation\n(<ref>) —see Remark <ref>.\nTherefore, using equation (<ref>) and imposing the\nGHG-coordinate and conformal gauge constraints\n\n    C^μ=0,      C=0,\n\nwe obtain the following reduced wave equation for the components of the\nunphysical metric in the x^μ coordinates:\n\n    g_μν = - 4Φ_μν - 1/2F g_μν - 2\n    ∇ _(μℋ_ν)  - g^σδg^αβ\n    (Γ_νδβΓ_σμα +\n    2Γ_δνβΓ_(μν) α ).\n\nOne can perform a similar procedure on the remaining wave equations\n(<ref>) to obtain them in their reduced form, but since it is\nnot absolutely necessary for the discussion that follows, that\ndiscussion is provided in Appendix <ref>.\n\n\n\n\n\n§  THE CONFORMAL EINSTEIN FIELD EQUATIONS IN THE LINEAR \n  APPROXIMATION \n\n\n\n\n\nIn this section the linearisation of the wave equations (<ref>)\nis obtained. To set up the notation regarding linearisation, first, we\noutline the general procedure. Consider a one-parameter family of fields\nϕ(ε) which satisfy an equation\n\n    ℰϕ(ε)=0,\n\nwhere ℰ is some (non-linear) differential operator.  Then,\nthe field ϕ:=ϕ(0) will be called the background\nsolution as it satisfies the equation ℰϕ=0.\nLet D denote the linearisation operator:\n\n    D(ℰϕ):=d/dε(ℰϕ(ε))|_ε=0\n\nThen, using that  Dϕ=0, one obtains\nℒδϕ=0 where ℒ is a linear operator\nacting on δϕ:=\ndϕ/dε|_ε=0. Issues of linearisation\nstability (the existence and correspondence between exact and linearised\nsolutions) will not be addressed here.\n\n\n\nFor the ongoing discussion ϕ = (φ, ), where\nφ encodes all the geometric variables while  and \nrespectively encode the gauge and matter variables. Namely, for the\ngeometric sector φ, one is considering an approximate\nsolution of the form\n\n    g_μν=g_μν + δ g_μν,     Φ_μν= Φ_μν + δΦ_μν,\n          Ξ = Ξ + δΞ,      s= s +\n      δ s\n\nFor the gauge sector  one has the split\n\n    F=F + δ F,     ℋ_μ = ℋ_μ \n      + δℋ_μ.\n\nFor the matter sector  one has the split\n\n    T_μν=T_μν + δ T_μν,      \n      T_μνα = T_μνα \n        + δ T_μνα.\n\nFrom this point forward (unless otherwise stated), indices will be\nraised and lowered with the background metric g_μν.\n\n\n\n\n §.§ Equation for the metric perturbation\n\n\n\n\n\nOne of the advantages of the wave formulation of the CEFEs is that the\nmetric sector of the equations resembles conventional formulations of\nGeneral Relativity. This can be seen clearly even in the non-linear\nequation (<ref>) where this equation is formally\nidentical to the standard (non-conformal) Einstein field equations in\ngeneralised harmonic gauge with a source term in this case given by\n-4Φ_ab-1/2Fg_ab which could be thought conceptually as\nsome artificial “geometric matter term”. To exploit the latter\nviewpoint let us define\n\n    𝒲_ab:=2Φ_ab + 1/4Fg_ab,\n\nso that equation (<ref>) agnostically reads:\n\n    R_ab=𝒲_ab.\n\nExpressing the equation for the metric in this way is advantageous since\none can follow the classical discussion for linearising the Einstein\nfield equations with respect to a general background g_ab\n—see for instance Sec. 7.5 of <cit.>.  Since a few gauge\ntransformations are needed and we want to reserve the symbol δ\ng_μν for the last transformation, we first decompose the metric\nas g_μν=g_μν + h_μν. Then, a\nstraightforward linearisation of equation (<ref>) gives\n\n    □ h_μν =\n      - 2 δ𝒲_μν \n      + ^αβ _β _μh_να \n      + ^αβ _β _νh_μα \n      - ^αβ _μ _νh_αβ\n\nwhere □ :=\n∇_μ∇^μ with ∇\ndenoting the Levi-Civita connection of . Then, upon\ncommuting covariant derivatives and defining the trace-reversed metric\nperturbation ĥ_μν:=h_μν-1/2\nh_α^α_μν, we obtain\n \n  □ĥ _μν     = -2 δ𝒲_μν + δ𝒲_α^α\n  g_μν -2 R_μανβ\n  ĥ^αβ + 2 R_(ν^α\n  ĥ_μ) α - g_μν _β_α ĥ^αβ + 2_(μ_|α| ĥ_ν) ^α\n\nwhere δ𝒲_α^α:=^αβδ𝒲_αβ, and R_μναβ and\nR_μν are the Riemann and Ricci tensors of\n, which can be written in terms of the rescaled Weyl\ntensor and trace-free Ricci tensors via the decomposition:\n\n    R_μναβ = \n      Ξd_μναβ\n       -2 Φ _β  [μg_ν] α\n       +2 Φ _α [μg_ν]  β\n       + 112R (g_μαg_νβ\n       - g_μβg_να).\n\nTo avoid unnecessarily long expressions, background curvature terms will\nnot be expanded out. Notice that equation (<ref>)\ncontains only divergences of ĥ_μν and derivatives of the\ntrace are absent. To obtain hyperbolic equations, the divergence terms\n_αĥ_ν^α are removed by\nemploying a slight generalisation of the procedure outlined in\n<cit.>; one begins by recognising that the quantity q_μν :=\nh_μν + 2_(μξ_ν) is a gauge transformation of\nthe metric perturbation h_μν. Introduce its trace-reversed\nversion \nδ g_μν=q̂_μν:=\nq_μν-12q_c^cg_μν.\nSince the vector field ξ_ν is arbitrary, one can choose a gauge\nin which ξ_ν satisfies an inhomogeneous wave equation. In\nparticular, the divergence of δ g_μν:\n\n    _νδ g_μ^ν =  F_μ,\n\nmay be rewritten as the following wave equation:\n\n    □ξ_μ + R_μνξ^ν +\n      _νĥ_μ^ν =  F_μ ,\n\nwhere F_μ is a given set of functions of the coordinates\nx^α and the evolved fields (but not their derivatives), which\nwe call the Lorenz gauge source functions.  These are related to\nthe linearisation of the coordinate gauge source functions\nℋ^μ as discussed in Remark <ref>.  If\nξ_ν satisfies the above wave equation, then δ\ng_μν satisfies the gauge (<ref>). The\ngauge condition in (<ref>) is a linear analogue\nof the generalised harmonic gauge condition, and as such we called it\nthe generalised Lorenz gauge —a similar definition is given\nalso in <cit.> in the non-conformal context\nassuming a flat background.  Working in the generalised Lorenz gauge,\nwe obtain the following equation for the metric perturbation:\n\n  □ δg_μν     = \n  - 2 δ𝒲_μν \n  + δ𝒲^α_α\n  g_μν\n  - 2 R_μανβ \n      δg^αβ\n  + 2 R^α_(ν δg_μ)  α\n  - _μν _αF^α\n  + 2 _(μF_ν)   \n\nsubject to the gauge condition (<ref>).\n\n\n \n  The analogy between the Lorenz and Harmonic gauge is more subtle\n  when dealing with a non-flat background since the direct linearisation\n  of the generalised harmonic condition C^μ:=Γ^μ +\n  ℋ^μ=0 renders\n  \n    δ C^μ=\n      _βδ g^βμ \n        - ℋ^αδ g^μ_α \n        - Γ^μ_αβδ g^αβ + \n         δℋ^μ =0.\n\n  Comparing equations (<ref>) and\n  (<ref>) one concludes that :\n  \n    F^μ = ℋ^αδ g^μ_α \n        + Γ^μ_αβδ g^αβ \n        - δℋ^μ .\n\n  Observe that even for the harmonic case ℋ^μ =\n  δℋ^μ=0 equation (<ref>) reduces to\n  \n    _βδ g^βμ =\n        Γ^μ_αβδ g^αβ,\n\n  retrieving the Lorenz gauge condition only if the background\n  connection vanishes Γ^μ_αβ=0.\n  \n\n\n\nTo complete the discussion now we look at the expression for δ𝒲_μν.  It follows from the definition of\n𝒲_ab in equation (<ref>) that\n\n    δ𝒲_μν = 2 δΦ _μν \n      + 14Fδ g_μν \n      - 18Fδ g^α_α_μν \n      +  14δ F _μν.\n\nRecalling that the conformal gauge constraint has been imposed C:= R -\nF=0, observe that the linearisation of this condition leads to the\nfollowing constraint:\n\n    δ C = \n      δ𝒲^μ_μ \n      - R^μνδ g_μν \n      + 12Rδ g^μ_μ \n      - δ F =0.\n\nFor consistency, the background conformal gauge source function and the\nbackground Ricci scalar should be identified:\nR=F.  Then, with this identification and using\nequations (<ref>) the linearisation of the conformal\nconstraint reads\n\n    δ C = 2δΦ_μ^μ -2 Φ^μνδ g_μν=0.\n\nThe latter equation states that although Φ_μν is trace-free,\nin general, its perturbation may not be. Nonetheless, the trace of the\nperturbation is fixed by equation (<ref>).  In\nparticular, notice that if the background is flat, this condition\nreduces to δΦ_μ^μ=0.\n\nTo obtain the final expression for the metric perturbation equation is\nthen enough to substitute equation (<ref>) into equation\n(<ref>).  Although the resulting equation for δ\ng_μν looks more complicated than the usual expression for the\nmetric perturbation this is mainly because the linearisation was\nperformed with respect to a general background and due to the use of the\ngeneralised Lorenz gauge. Later on, when the background is fixed the\nexpressions presented in this section will simplify considerably.\n\n\n\n\n §.§ Equations for the perturbation of other conformal fields\n\n\n\nThe linearisation of the rest of the conformal fields can be obtained\nsystematically.  The main calculation involves obtaining a suitable\nexpression for the linearisation of the geometric wave operator acting\non each of the conformal fields.  To do the calculation in the scalar\nsector, first notice that for a scalar field φ one has that\n\n    D□φ = □δφ\n      - h^νμ _ν_μφ\n      - ^μα _αh_νμ ^νφ\n      + 12^μα\n      _νh_μα ^νφ\n\nwhere φ denotes a background quantity and δφ the perturbation. Performing the same gauge transformations of\nsubsection <ref> for the metric perturbation h_μν\nand imposing the generalised Lorenz gauge one obtains:\n\n    D □φ = □δφ +\n      12δ g^μ_μ□φ\n      - δ g^μν _ν _μφ\n      - F^μ _μφ.\n\nA direct calculation using the latter expression and exploiting that the\nbackground fields ϕ satisfy the CEFEs in the form of\nequations (<ref>) as well as equations\n(<ref>), give the following equation for the\nperturbation of the conformal factor\n\n    □δΞ  =  \n      - 16FδΞ\n      - 16δ F\n      + 4 δ s \n      -  ^μνδ g_μν\n      +( 124F \n      - s )δ g^μ_μ \n      + F^μ _μ\n      + 12 ^3 ^μνδ g_μν\n\nA similar calculation gives the linearised wave equation for the\nFriedrich scalar. The explicit expression is lengthy and has been put in\nAppendix <ref>. For tensor fields the calculation is slightly\nmore involved. To give an abridged discussion consider now the case of\nthe linearisation of □ w_μ, where w_a is some covector\nfield.  A direct calculation gives,\n\n    D □ w_μ    =  □δ w_μ\n      - 12w^ν□ h_μν  \n      + w^ν _α _[νh_μ] ^α\n        - h_να ^α ^νw_μ\n      + 2  ^αw^ν _[νh_μ] α\n      -  _αh_μν ^αw^ν\n       \n      -  ^νw_μ\n      ( _αh_ν^α \n      - 12 _νh^α_α)\n\nwhere w_μ denotes a background quantity and δ\nw_μ the associated perturbation. Substituting the term\n□ h_μν using equation\n(<ref>) and rewriting the equation in\nterms of the trace-reversed metric perturbation ĥ_μν\nrenders\n\n    D □ w_μ    = □δ w_μ\n      - w^ν _α _μĥ_ν^α +\n      δ𝒲_μ^νw_ν\n      -  ^αw^ν(  _αĥ_μν\n      - 12_μν _αĥ^β_β)\n      \n           -2  ^αw^ν ( _[μĥ_ν] α \n      - 12 g_α [ν _μ] ĥ^β_β)\n      - ^α^νw_μ(ĥ_να\n      - 12ĥ^β_β_να)\n      -  _αĥ_ν^α ^νw_μ\n\nCommuting covariant derivatives on the second term in the right-hand\nside of equation (<ref>), performing the\ngauge transformation described in subsection <ref> and\nimposing the generalised Lorenz gauge one obtains\n\n    D    □ w_μ =□δ w_μ\n      + 12δ g^ν_ν□w_μ\n      - δ g_να ^α ^νw_μ\n      - δ  g_ν^αR_μαw^ν\n      + δ g^αβR_μανβw^ν\n      - ℒ_w_μ\n        \n      + δ𝒲_μ^νw_ν \n      + 2  ^αw^ν\n        (  _[ν(δ g)_μ] α\n      -12 _αδ g_μν) \n      + ^νδ g^α_α _[νw_μ] \n      + 12_μδ g^α_α _νw^ν\n\nwhere ℒ_ denotes the Lie-derivative along F^μ.\nExtending the latter calculation on tensors of higher valence is a long\nbut straighforward calculation. The latter leads to the following\nlinearised equations for the conformal fields:\n\n    □δ g_μν   =\n        H^g_(μν)(δϕ,\n        δϕ  ;  ϕ, , \n        ϕ,\n         )\n        \n    □δΞ    = H^Ξ_(δϕ, δϕ  ;  ϕ, , ϕ )  \n    □δ  s \n            = \n        H^s(δϕ, δϕ  ;  ϕ, , ϕ,\n         )   \n    □δΦ_μν   = \n        H^Φ_(μν)(δϕ,\n        δϕ  ;  ϕ, , ϕ,\n          ,  F, \n          δ F )\n        \n    □δ  d_μναβ    =\n        H^d_[μν][αβ](δϕ, \n        δϕ  ;  ϕ, , ϕ,\n        ϕ,  ) .\n\nHere we recall that ϕ schematically represents the conformal\nfields, and the gauge sources are schematically denoted as ;\ncontaining the Lorenz gauge source functions F^μ as well as\nF and δ F. The semicolon separates the arguments\nwhich do not contain the evolved perturbation variables explicitly.\nObserve that only the equation for δΦ_μν contains\nsecond derivatives of δ F which restricts the allowed choices for\nδ F—see Remark <ref>. The expressions\nfor H^g_μν, and H^Ξ are given in the respective\nequations (<ref>) and (<ref>).\nThe expressions for H^s, H^Φ_μν and\nH^d_μναβ are lengthy and are given explicitly in\nAppendix <ref>.\n\n\n\n\n\n§ ANALYSIS OF WAVE SOLUTIONS AROUND FLAT SPACETIME\n\n\n\n\n\n\n\n\n §.§ Fixing the background solution\n\n\n\nThe discussion given in the last section is general in the sense that\nneither the background solution ϕ nor the gauge\nsource functions  have been fixed.  The first observation to be\nmade is that, although the expression for H^d_μναβ is\ncomplicated, in fact, if one restricts the analysis to the vacuum\ncase and a conformally flat background (so that\nd_μναβ=0 but Φ_μν≠\n0 and R≠ 0), then the equation for the perturbation of\nthe rescaled Weyl tensor reduces to\n\n    □ δ d_μναβ\n      = 1/2Fδ d_μναβ,\n\nand this equation decouples from the rest.  This is to be expected since\nas one way to study linearised gravity is through the spin-2 equation\nfor which the metric perturbation plays no role —see <cit.>. Since the aim of this article is to give a first analysis\ninto the linearised version of the CEFEs, it is relevant to now examine\nthe complete system even if some of the equations decouple as in the\ncase described above.\n\nThe simplest choice of background is one in which the background\ngeometry is flat. Naively, one would think that this forces the\nbackground conformal factor to be constant, Ξ=1, and the\nequations trivialise to the standard non-conformal case; this would\ndefeat the purpose of considering the CEFEs in the first place, as one\nwould not be able to incorporate the conformal boundary\nin such an analysis. Fortunately, there\nexists a non-trivial conformal transformation that maps the Minkowski\nspacetime into itself such that spatial infinity and null infinity for\nthe physical Minkowski spacetime are respectively mapped to the\norigin and the lightcone through the origin of the (conformally\ntransformed) unphysical Minkowski spacetime. The evaluation of\nthe field at the conformal boundary of the physical spacetime\ncorresponds to evaluation at finite coordinate locations in the\nunphysical spacetime.  We point out that such a conformal transformation\ndoes not necessarily yield a full compactification, as some points (such\nas the physical origin) are mapped to infinity —see Figure\n<ref>.  This choice for a flat background, which we call the\ninversion representation of the Minkowski spacetime, is the\nsimplest non-trivial case (in the sense that it can incorporate the\nconformal boundary) that one can analyse in the conformal set-up.\nTherefore, the following analysis can be regarded as the conformal\ncounterpart of the standard discussion of linearised (physical) Einstein\nfield equations around flat spacetime. The inversion representation of\nthe Minkowski spacetime is a compelling choice not only for its\nsimplicity, but also because it is related to the\ni^0-cylinder representation of the Minkowski spacetime\n(see for instance <cit.>) which has\nd_μναβ=0, R = 0 with a\nnon-trivial trace-free Ricci tensor Φ_μν≠ 0.\nWhile an analysis on the i^0-cylinder background\nwould be of great interest, the sources  in\nthe equations for the fields other than δ d_μναβ\n(see Appendix <ref>) become cumbersome when\nΦ_μν≠ 0; this will be pursued in future work.\n\n\n\n\n\n §.§ The inversion conformal representation of the Minkowski spacetime\n\n\n\n\nThe inversion representation of the Minkowski spacetime described in the\npreceding paragraph is a standard conformal representation detailed in\n<cit.>, which we now\nsummarise. In what follows (ℝ^4, ) will denote\nthe (physical) Minkowski spacetime.  Let x̃^μ̃=\n(t̃,x̃^ĩ), represent physical Cartesian\ncoordinates.  The associated coordinate basis vectors and covectors are\ndenoted by ∂_μ̃ and\n𝐝x̃^μ̃, respectively. The components of an\narbitrary abstract tensor S_ab in the physical Cartesian coordinate\nbasis are denoted by S_μ̃ν̃. The Minkowski metric\nreads \n\n    =\n    η_μ̃ν̃𝐝x̃^μ̃⊗𝐝x̃^ν̃,\n\nwhere η̃_μ̃ν̃=diag(-1,1,1,1).\nDefining the physical radial coordinate via ρ̃^2=\nδ_ĩj̃x̃^ĩx̃^j̃\nwhere δ_ĩj̃=diag(1,1,1) and considering\nan arbitrary choice of coordinates on 𝕊^2 the physical\nMinkowski metric can be written as\n\n    =-𝐝t̃⊗𝐝t̃\n    +𝐝ρ̃⊗𝐝ρ̃+ρ̃^2\n    σ,\n\nwith t̃∈(-∞, ∞), ρ̃∈ [0,∞)\nwhere σ denotes the standard metric on 𝕊^2. \n\nWe now introduce the unphysical Cartesian coordinates\nx^μ=(t,x^i), and denote the associated vector and covector basis\nwith ∂_μ and 𝐝x^μ, respectively. As\nbefore, the components of an arbitrary tensor S_ab in the unphysical\nCartesian coordinate basis will be denoted as S_μν. The\nrelationship between the physical and unphysical Cartesian coordinates\nis given by:\n\n    x^μ\n    =\n    δ_μ̃^μ x̃^μ̃/X̃^2, \n        X̃^2 \n    ≡η̃_μ̃ν̃x̃^μ̃x̃^ν̃,\n    \n    x̃^μ̃=δ^μ̃_μ x^μ/X^2,\n        \n    X^2=η_μνx^μx^ν.\n\nwhere δ_μ̃^μ=diag(1,1,1,1),\nX^2=1/X̃^2 and η_μν=diag(-1,1,1,1). This\ncoordinate transformation is valid in the complement of the lightcone at\nthe origin in the physical Minkowski spacetime where X̃^2 > 0.\n\n\n\n   The notational reason for having a tilde over the physical\n  coordinate indices is to distinguish the physical and unphysical\n  coordinate bases denoted by ∂_μ and\n  ∂_μ̃.  The latter requires the use of\n  δ_μ̃^μ in the expressions\n  (<ref>) to keep the tilded and\n  untilded indices balanced. This notation is inspired by that of the\n  dual foliation formalism of <cit.>.\n  \n\n\n\n\n\n\n \n\n\n\n\nFrom the relation between the physical and the (unphysical) inversion\ncoordinate bases one can construct the Jacobians\n\n    J_μ̃^μ:= \n        ∂ x^μ/∂x̃^μ̃\n        =\n        X̃^-2(δ_μ̃^μ\n        - 2 x^μx̃_μ̃),      \n       J_μ^μ̃:=\n       ∂x̃^μ̃/∂ x^μ=\n        X^-2\n          (δ^μ̃_μ-2x̃^μ̃x_μ)\n\nTo identify a suitable conformal metric, it is enough to compute\nη_μν𝐝x^μ⊗𝐝x^ν =\n η_μν\n  J_μ̃^μJ_ν̃^ν𝐝x̃^μ̃⊗𝐝x̃^ν̃.\nIntroducing  η=η_μν𝐝x^μ⊗𝐝x^ν, we write this compactly as:\n\n    η=Ξ^2 ,\n\nwith Ξ =X^2. This demonstrates that the inversion (unphysical)\nMinkowski spacetime can be recast as a conformal transformation of the\nphysical Minkowski spacetime.  Although, in most of the upcoming\ndiscussion, all tensor components will be expressed in just one\ncoordinate basis (the unphysical one), notice that, the relation\nbetween the components of a tensor S_ab in the physical and the\nunphysical bases is then\ngiven by\n\n    S_μ̃ν̃= Ξ^2(δ_μ̃^μ \n      - 2x^μx̃_μ̃)\n      (δ_ν̃^ν -2x^νx̃_ν̃)S_μν.\n\nTo complete the discussion, one can construct an unphysical spherical\npolar coordinate system. Upon introducing\nρ^2=δ_ijx^ix^j, a calculation shows that the unphysical\n (conformal) metric η and conformal factor Ξ read\n\n    η=-𝐝t⊗𝐝t +𝐝ρ⊗𝐝ρ+ρ^2 σ,     Ξ=ρ^2 -t^2,\n\nwith t∈(-∞,∞) and ρ∈ [0,∞).  Notice that\nspatial infinity i^0 of the physical Minkowski spacetime\n(ℝ^4, ) is mapped to the origin (t=0,ρ=0)\nin (ℝ^4,η). Also, future and past null infinity\nℐ^± of the physical Minkowski spacetime are mapped to the\nlightcone passing through the origin. In other words, introducing the\nunphysical retarded and advanced times u:=t-ρ and v:=t+ρ,\nfuture/past null infinity ℐ^± is located at v=0 and\nu=0 respectively.  To round up the discussion between the relation the\nphysical and unphysical coordinates, here we record that\n\n    t=t̃/ρ̃^2-t̃^2,     ρ =\n       ρ̃/ρ̃^2-t̃^2.\n\n\n\n\n\n\n\n\n §.§ Linearised equations around the Minkowski-inversion \n            background\n\n\n\n\n\n\n  §.§.§ The background solution\n\n\nWe now fix the background solution ϕ to be the\nMinkowski inversion background discussed in the previous subsection,\n<ref>. This yields the following expressions for\nthe background fields\n\n    g_μν= η_μν,     Ξ=\n      ρ^2-t^2,     s= 2,     T_μν=0, \n          T_μνα=0.\n\nthe latter implies that the curvature\nR_μναβ=0 vanishes which, in terms of its\nirreducible decomposition implies that\n\n    Φ_μν=0,     R=0,\n        d_μναβ=0.\n\nSince one has that R=F, this fixes the\nbackground conformal gauge source function. Nonetheless, the remaining\ngauge source functions encoded in F^μ and δ F need not\nvanish and will (along with matter perturbation quantities) be left\nunspecified. This gives the following equations\n\n\n    □δ g _μν    = \n      - 4 δΦ _μν\n      + 2 δΦ ^α_αg_μν\n      - g_μν _αF^α\n      + 2 _(μF_ν)  \n      + 12δ F _μν\n    □δΞ    = 4 δ s  \n      - sδ g ^μ_μ \n      + F^μ_μΞ - 16δ F\n    □δ s      = \n      δ T^μν_μ_ν\n      - 16sδ F \n      - 16_μδ F ^μ\n    □δΦ_μν    = -2 δ T_(μ^α_ν)_α \n      - _αδ T_μ^α_ν\n      + 16_{μ_ν}δ F \n      \n    □δ d_μναβ =     \n      2 _[μδ T_|αβ|ν] \n      +2  _[αδ T_|μν|β] + 2\n      _β[ν_|σδ T_α|^σ_μ] \n      + 2\n      _α[μ_|σδ T_β|^σ_ν].\n\n\n\n\n  \n  The Lorenz gauge source functions F^μ are allowed to\n  depend on the variables δϕ as they appear only with first\n  derivatives in equations (<ref>). However, the\n  conformal gauge source function δ F is only allowed to depend\n  on the coordinates due to the second derivatives of δ F in\n  the equation (<ref>).\n\n\n\n\n\n  Although for simplicity we have fixed the notation in\n    subsection <ref> so that x^μ denotes\n    the unphysical Cartesian system of coordinates, in fact, equations\n    (<ref>) are not bound to these coordinates, the only\n    assumption used was that the background Riemann curvature\n    R^μ_αβν vanishes. In other\n    words, in deriving equation (<ref>), the vanishing\n    of the (background) Christoffel symbols\n    Γ^α_μν has not been assumed,\n    consequently, formally identical equations to\n    (<ref>) will hold in any coordinate\n    system. Nonetheless, the unphysical Cartesian system x^μ will\n    be assumed in the discussion of subsection <ref>\n    so that one may apply standard techniques such as expressing the\n    solutions in terms of Greens functions and multipolar expansion\n    approaches.\n\n\n\n\n\n\n  §.§.§ The matter relations\n\n\nThe matter equations depend on the particular matter model in question,\nhowever, since the background matter terms are assumed to vanish, the\ndirect linearisation of the general relations, combined with the\nsymmetries of T_abc and T_ab described in section\n<ref>, yield a set of formally identical expressions that the\nperturbations must satisfy:\n\n\n    δ T_μ^μ=0,     _νδ T_μ^ν=0,\n          δ T_αβμ= δ T_[αβ]μ,\n          δ T_[αβμ]=0,     _αδ T_μν^α=0.\n\nAlso, one has the relations:\n\n    δ T_αβγ    := _[αδ T_β]γ\n      + 3 δ T_γ[β_α]Ξ\n      -_γ[αδ T_β]λ^λ,\n      \n     _αδ T_μ^α_ν   =- 12Ξ□δ T_μν\n      -4 sδ T_μν  \n      -2  _αδ T_μν ^αΞ\n      +  ^αΞ _(μδ T_ν)  α.\n\n\n\n\n\n\n  §.§.§ Propagation of the generalised Lorentz gauge\n\n\nTracing equation (<ref>) and using equations\n(<ref>) shows that\n\n    □δΦ_μ^μ=0.\n\nRecall that the linearisation of the conformal gauge constraint,\ntranslates in the present case, to the condition\n\n    δΦ_μ^μ=0.\n\nThis, in particular, simplifies equation (<ref>):\n\n    □δ g _μν    = \n      - 4 δΦ _μν\n      - g_μν _αF^α\n      +  _μF_ν +  _νF_μ\n      + 12δ F _μν .\n\nThe condition (<ref>) is trivially propagated by equation\n(<ref>). Namely, if initial data is given such that\n\n    δΦ_μ^μ=0     and    _n δΦ_μ^μ=0     on    Σ ,\n\nwhere  _n:=n^μ_μ and n^μ denotes the normal\nto a spacelike hypersurface Σ. Then, by existence and uniqueness\nof solutions to the flat-wave equation (<ref>), one has\n\n    δΦ_μ^μ=0     on    𝒰⊂𝒟^+(Σ).\n\nwhere 𝒰 is an open set and 𝒟^+(Σ) denotes\nthe future domain of dependence of Σ. This result can be\nunderstood as the propagation of the conformal constraint in the linear\nsetting. To show that generalised Lorenz gauge condition\n(<ref>) propagates one needs to use the\ncontracted Bianchi identity. In the CEFE language this is encoded in\nequation (<ref>). Hence, for completeness and\nfuture reference, we linearise the CEFEs as defined in equations\n(<ref>) and (<ref>)\nand record the result in Remark <ref>.\n\n\n  \n  \n  Using equation equation (<ref>) to express\n  (<ref>) using the trace-free Ricci tensor and\n  linearising around a flat background gives\n  \n  \n    _μδ s  = \n        - δΦ _μν ^ν\n        + 12 ^2  δ T_μν ^ν\n        -124δ F _μ, \n        _μδΦ _αν  \n        -  _νδΦ _αμ\n        = δ T_μνα\n        - δ d_αβμν ^β\n        +  112_α  [μ _ν]  δ F,\n        \n        ^μδ d_μναβ =  \n        δ T_αβν, \n        _μ _νδΞ  =\n        Γ[q]^λ_μν_λ \n        +sq_μν \n        + (δ s - 124δ F)_μνδΦ_μν + 12δ T_μν,\n        \n       δ R_μναβ=\n        δ d_μναβ \n        + 2δΦ _[ν | β_α| μ]     \n        + 2δΦ _[μ | α_β| ν]  \n        + 16δ F _[μ|  α_β |ν]   ,\n\n  where\n  \n    Γ[q]^α_μν  :=\n        12g^αβ(  _μ  q_νβ\n        +   _ν  q_μβ \n        -   _β q_μν) ,\n            δ R_μναβ :=\n        2 _[α _|[ν q_μ  ]|β]  .\n\n  \n  where the expressions have been written using q_μν instead of\n  δ g_μν to avoid long expressions. Recall that  δ\n  g_μν is simply the trace-reversed version of q_μν.\n  \n\n\n\nContracting equation (<ref>), gives _νδΦ_μ^ν= _μδΦ_ν^ν +\n18_μδ F and using equation\n(<ref>) one obtains\n\n    _νδΦ_μ^ν= 1/8_μδ F.\n\nThe divergence-fixed condition (<ref>) is also\npropagated by the wave equations (<ref>). To see this,\nnotice that applying ∇^μ to equation (<ref>),\nusing (<ref>), and after trivially commuting the\nflat-covariant derivative  one obtains\n\n    □ (^μδΦ_μν\n      - 18_νδ F)=0.\n\nHence, if initial data is given on Σ such that ^μδΦ_μν=18_νδ F and\n_n ( ^μδΦ_μν\n-18_νδ F) =0 then condition\n(<ref>) is satisfied in 𝒰⊂𝒟^+(Σ). To show propagation of the generalised Lorenz\ngauge (<ref>), one proceeds analogously, taking a\ndivergence of equation (<ref>) and using equations\n(<ref>) and (<ref>) gives the\nfollowing equation\n\n    ^μ□δ g_μν = \n    □ F_ν\n\nwhich can be rewritten as\n\n    □ (^μδ g_μν -F_ν) = 0.\n\nHence, if one gives initial data on Σ such that ^μδ g_μν -F_ν=0 and _n(^μδ g_μν -F_ν)=0 then by virtue of equation\n(<ref>) one has that\n(<ref>), namely ^μδ g_μν\n=F_ν, is satisfied on 𝒟^+(Σ). In other words, the\ngeneralised Lorenz gauge propagates. This discussion is\nsummarised in the following\n\n\n  The linearisation of the wave-CEFEs around\n  the inversion-Minkowski unphysical spacetime is given by\n  \n  \n    □δ g_μν    = \n        -4 δΦ _μν\n        - g_μν _αF^α\n        + 2 _(μF_ν )   +\n        12δ F _μν\n    □δΞ    = 4 δ s  \n      - sδ g ^μ_μ \n      + F^μ_μΞ - 16δ F\n      \n    □δ s      = \n      δ T^μν_μ_ν\n      - 16sδ F \n      - 16_μδ F ^μ\n    □δΦ_μν    = -2 δ T_(μ^α_ν)_α \n      - _αδ T_μ^α_ν\n      + 16_{μ_ν}δ F\n      \n    □δ d_μναβ =   \n        2  _[μδ T_|αβ|ν] \n        + 2  _[αδ T_|μν|β] \n        + 2 _β[ν_|σδ T_α|^σ_μ] \n        + 2 _α[μ_|σδ T_β|^σ_ν].\n\n  \n  where the matter sources satisfy the relations in equation\n  (<ref>). The conditions δΦ_μ^μ=0, and ^μδΦ_μν=1/8_μδ F, along with the\n  generalised Lorenz gauge condition ^μδ\n  g_μν=F_μ, propagate.\n  \n\n\n\n\n\n  \n  Observe that if δ F=0 is set then δΦ_μν is a\n  TT-tensor (transverse and tracefree).\n  Furthermore, if the Lorenz gauge condition is chosen, F_μ=0,\n  equation (<ref>) looks formally identical to the\n  textbook linearisation Einstein equations with an geometric-artificial\n  matter term δΦ_μν.\n  \n\n\n\n\n\n  The initial data for the wave equations (<ref>) is\n  not free as it needs to satisfy equations (<ref>) on\n  Σ. The propagation of the (first order) CEFEs by the wave-CEFEs\n  has been proven at the non-linear level in <cit.> and the\n  result at the linear level follows from linearisation of the\n  subsidiary system obtained in <cit.>.  Also, a procedure to\n  obtain initial data for the conformal wave CEFEs at the non-linear\n  level has been outlined in <cit.>: one starts by solving the\n  conformal Einstein constraint equations on Σ which constitute\n  the spatial parts of the zero-quantities\n  (<ref>). Then, the time derivatives of the\n  evolved fields on Σ can be read from the zero-quantities using\n  the solution to the conformal Einstein constraints.  An analogous\n  procedure can be performed for the linear case to obtain initial data\n  for the wave equations (<ref>). Observe that from\n  equations (<ref>) and (<ref>)\n  one only needs to consider their trace-free parts as the traces give\n  the wave equations (<ref>) and (<ref>),\n  respectively. \n\n\n\n\n\n\n  §.§.§ Scri-fixing gauge\n\n\nA difficulty with the standard CEFEs concerns the fact that in general,\nthe conformal boundary is not fixed with respect to the coordinates.\nAlthough there exist a generalisation of the CEFEs, the extended\nCEFEs (see for instance <cit.>) that allows to have an explicit\nexpression the conformal factor, this approach is based on gauge adapted\nto a congruence of conformal geodesics, called the conformal Gaussian\ngauge. The latter requires the use of more general type of connections\nknown as Weyl connections and it is in general difficult to write\nexplicitly the line element of physically relevant solutions in the\ncoordinates adapted to the conformal Gaussian gauge.  Here, we give an\nalternative simpler approach based on exploiting the gauge source\nfunctions in the wave formulation of the standard CEFEs. In the linear\ncase, the key is to find a gauge choice such that equation (<ref>)\nis homogeneous. This amounts to choosing the Lorenz gauge source\nfunctions such that F^μ satisfies\n\n    F^μ_μ = - 4 δ s + sδ\n    g_μ^μ + 1/6δ F.\n\nThus, if trivial initial data is given to equation (<ref>) on the\ninitial hypersurface then the trivial solution δΞ=0 is\nobtained in the development. Hence, Ξ= and that the location\nof the conformal boundary of the perturbed linearised solution coincides\nwith that of the background spacetime. Observe that to solve equation\n(<ref>) one needs _μ≠ 0 and\nalthough this condition does not hold at i^0, this is not a problem\nfor foliations that end at a cut 𝒞 of ℐ (e.g.\nthe hyperboloidal and null foliations) —see Figure <ref>.\n\nIn the non-linear case one can proceed in a similar way.  The non-linear\nversion of the wave equation for the conformal factor reads:\n  \n    Ξ = - 16Ξ F -\n        ℋ^μ∇_μΞ + 4 s\n\nwhere := g^μν∂_μ∂_ν and x^μ is\na fiduciary coordinate system —see Appendix <ref>. One can\nfollow the same approach as in the linear case and think of Ξ as a\ngiven function of the coordinates and solve for the gauge source\nfunctions. Although this approach is of limited use for the Cauchy\nproblem as ∇_μΞ vanishes at i^0, this is not an issue for\nfoliations which end at a cut 𝒞 of ℐ for which\n∇_μΞ≠ 0.  As a concrete example and to make contact with\nthe hyperboloidal framework of <cit.> consider an unphysical coordinate system x^μ=(τ, r,\nϑ^A) with A=1,2, related to physical coordinates\nx̃^μ̃ =(t̃, r̃, ϑ^A) according\nto the standard hyperboloidal prescription t̃= τ +\nH(r̃) and r̃= r/Ω (r) where H and\nΩ are known as the height and compression functions. If one sets\nΞ= Ω(r) then equation (<ref>) fixes one of the\ncomponents of the coordinate gauge source functions\n  ℋ^μ as:\n  \n    ℋ^r = - Ω”/Ω'g^rr +\n        4s/Ω' - Ω/6Ω' F.\n\nwhere Ω' := dΩ/dr. If the slice is hyperboloidal\nthen Ω' ≠ 0 at ℐ.\n\n \n   In <cit.> a similar gauge-fixing is\n  developed, however in the previous work the evolution equations are\n  formally singular while in the CEFE approach of this paper the\n  equations are formally regular.  Also, the general strategy put\n  forward here is not bound to the hyperboloidal and asymptotically flat\n  set-up as a similar scri-fixing procedure could be adapted to study\n  spacetimes with de-Sitter (and anti-de-Sitter) asymptotics using CEFEs\n  similar to the case of <cit.> and <cit.> where the\n  gauge was fixed using, instead, a congruence of conformal geodesics.\n\n\n\n\n\n   Recall that g_ab=Ξ^2g̃_ab, hence for the linear\n  perturbations one has:\n  \n    δ g_μν=Ξ^2δg̃_μν +\n        2Ξg̃_μνδΞ .\n\n  Using the above described gauge to set δΞ=0, then equation\n  (<ref>) reduces to δ\n  g_μν=Ξ^2 δg̃_μν.  However, it\n  should be stressed that δg̃_μν≠δg̃_μ̃ν̃. Namely, δg̃_μν denotes the components of the physical metric\n  perturbation δg̃_ab in the unphysical Cartesian\n  coordinate basis ∂_μ. Using equation\n  (<ref>) one sees that the expression for the physical\n  metric perturbation in the physical Cartesian coordinate basis\n  ∂_μ̃ is given by\n  \n    δg̃_μ̃ν̃ =\n        (δ_μ̃^μ -2x^μx̃_μ̃)\n        (δ_ν̃^ν -2x^νx̃_ν̃) δ\n        g_μν .\n\n  \n\n\n\n\n\n\n §.§ General solutions to the linearised equations\n\n\n\n\n\n\n\n  §.§.§ The vacuum equations\n\nIn this subsection an analysis of the linearisation of the wave CEFEs in\nvacuum is given (later, we extend the discussion to the case where\nmatter is included and with a more general gauge choice). To start the\ndiscussion in the simplest possible set up, consider the vacuum case\nwith vanishing gauge source functions F_μ=δ F=0 so that the\nequations read\n\n    \n    □δ  g_{μν}    = \n          -4 δΦ _μν, \n    □δΞ    = 4 δ s  -\n          sδ g^μ_μ,  \n    □δ g^μ_μ    = 0 ,\n          \n    □δ s     =0, \n    □δΦ_μν    =0 ,\n          \n    □δ d_μναβ    =0  \n          ,\n\n\nsubject to the constraints imposed by equations (<ref>)\nwith vanishing matter terms. Note that we have split the metric\nperturbation into its trace δ g_μ^μ and its trace-free part\nδ g_{μν}. In this manner, one can identify the variables\nthat satisfy homogeneous equations.\n\n\n\n\n  §.§.§ Solutions to the homogeneous equations\n\n\nThe solutions of homogeneous wave equations in flat spacetime are widely\nknown and understood, but since the initial data are subject to the\ninitial constraints (<ref>), it is perhaps appropriate to\nbriefly discuss how one might write the solutions explicitly in terms of\nthe initial data. For a field δ_H satisfying a homogeneous\nwave equation □δ_H=0, the solution may be\nwritten in the form <cit.>:\n\n    δ_H(x) \n         = - ∫_Σ d Σ^'_λ[ δ_H(x^') \n            ∂^λ D(x,x^')\n            - D(x,x^') \n            ∂^λδ_H(x^')\n          ] ,\n\nwhere d Σ^'_λ = (1/3!)ϵ_λαβγ dx^'α∧ dx^'β∧\ndx^'γ is the surface element on Σ, the underline\ndenotes evaluation of a quantity on Σ, and the quantity\nD(x,x^'):=G^+(x,x^')-G^-(x,x^') is the difference\nbetween the retarded (-) and advanced (+) Green's functions, defined\nas \n\n    G^±(x,x^')\n      \n         := - δ(x^0-x^' 0±|x⃗-x⃗^'|)/4π |x⃗-x⃗^'|\n      ,\n\nand satisfying the inhomogeneous equation □\nG^±(x,x^') = -δ^4(x-x^'). That (<ref>)\nis a solution of (<ref>-<ref>) can be seen\nby noting that D(x,x^'), being the difference of two Green's\nfunctions, is a solution of the homogeneous wave equation. It is\nstraightforward to show that D(x,x^')=0 if x^0=x^0',\nand one can also show <cit.> that D(x,x^')\nsatisfies the properties:\n\n\n    -.\n      ∫_Σ d Σ^'_τ[ \n              _H(x^') \n              ∂^τ D(x,x^') \n        ]\n      |_x ∈Σ   = _H(x ∈Σ) ,\n      \n    .\n                ∂^2 D(x,x^')/∂Δ t^2|_Δ t=0   = 0\n      \n      .\n  \n \nwhere Δ t:=x^0-x^' 0. Equation (<ref>)\nfollows from the fact that for a given |x⃗-x⃗^'|,\nD(x,x^') is by construction an odd function in Δ t. Given\n(<ref>), one can verify that the coefficients in\n(<ref>) do in fact coincide with the initial data (though\nnote that (<ref>) only depends on the time derivatives of\nthe fields). Of course, as indicated earlier, the initial data for the\nfields must satisfy the vacuum version of (<ref>).\n\nGiven the simplicity of the vacuum wave equations and their resemblance\nto wave equations in ordinary Minkowski space it is tempting to write\nthe solutions in terms of plane waves. While one can certainly obtain\nsolutions to the wave equations in this manner, a difficulty arises from\nthe fact that even in the vacuum case, the constraints\n(<ref>) are nontrivial, since the background expression\nfor Ξ in the inversion coordinates is explicitly\ncoordinate dependent. As a result, solutions satisfying the constraints\ndo not have a clean mode separation in a Cartesian Fourier expansion\n(though perhaps an alternative mode decomposition may be appropriate).\n\n\n\n\n  §.§.§ Solutions to the inhomogeneous equations and including \nmatter\n\n\nFor completeness, we discuss the solutions of equations\n(<ref>) and (<ref>). One may begin by\nassuming that one has in hand initial data satisfying the constraints\n(<ref>). We note that the structure of the vacuum\nequations has a hierarchy: one can first solve for δ s, δΦ_μν, δ d_μναβ, and δ\ng^μ_μ, then use the result to solve for δ g_{μν} and δΞ. Schematically, one may then write the\ninhomogeneous wave equations for the latter two in the following form\n(where S is a source that depends on the background field\nexpressions and δ s, δΦ_μν, and δ\ng^μ_μ):\n\n    □δ_I(x) =  S(x),\n\nwhich yields a particular solution (with x^0=t, \nx^' 0=t^'):\n\n    δ_I_0(x) \n             = δ_H_0(x) \n            - ∫_t_0^t dt^'∫ d^3x⃗^'[ \n              G^-(x,x^')  S(x^')\n            ] ,\n\nwhere δ_H_0(x) is a solution to the homogeneous equation\nwith initial conditions chosen so that the particular solution δ_I_0(x) has trivial initial conditions δ_I_0(x)=0 and ∂_t δ_I_0(x)=0 on\nΣ; this can in principle be done by evaluating the integral term\nand its derivative on Σ to obtain -δ_H_0(x^') and -∂_t δ_H_0(x^'). Finally, to obtain the solution corresponding to\nthe prescribed initial data, one can then add to δ_I_0(x) a homogeneous solution of the form in equation\n(<ref>). Since we are interested in the initial value\nproblem, we have chosen the retarded Green's function\nG^-(x,x^') in (<ref>). This is (as the reader\nmight be aware) because G^-(x,x^') is only nontrivial for x^0\n> x^' 0, so that for a given point x, the field contributions\nfrom the integral in (<ref>) depend on the values of the\nsource in the past of x (specifically over the past light cone of\nx).\n\nWe note that the procedure described for the inhomogeneous equation can\nbe straightforwardly extended to the full set of non-vacuum equations\n(<ref>), subject to the constraints (<ref>) on\nthe initial data. As in the vacuum case, one has a hierarchy in which\none can first specify the matter sources, then solve for the variables\nδ s, δΦ_μν, δ d_μναβ,\nand δ g_μν, and finally solve for the conformal\nperturbation δΞ using the previously obtained results. Of\ncourse, the preceding discussion glosses over the problem of solving the\nmatter equations, however such analysis is matter-model dependent. Hence\nin the present analysis they are simply regarded as given sources in the\nequations.\n\n\n\n\n §.§ The far-field approximation and quadrupole-like formulae\n\n\n\n\nAs emphasised before, an appealing property of the wave formulation of\nthe CEFEs is that the metric sector of the equations looks as the\nstandard non-conformal Einstein field equations with some\nartificial-geometric matter term. This suggests that some of the\nstandard techniques and approximation methods can be applied to the\nlinearised wave CEFEs such as solving them in the far-field regime and\nobtaining quadrupole-like formulae.\n\n\n\n\n  §.§.§ The far-field approximation\n\n\nTo derive the far-field approximation, we focus our attention not to the\nhomogeneous part of the solution to equation (<ref>) but\nto the part generated by the sources. For simplicity, we omit nontrivial\nhomogeneous solutions and δ_H_0(x) in the particular\nsolution (which corresponds to an appropriate choice of initial data),\nso that the solution consists only of the integral in equation\n(<ref>). Upon evaluating the time integral, one obtains:\n\n    δ= -1/4π∫_Σ(t-|x⃗-x⃗^'|,x⃗^')/|x⃗-x⃗^'|d^3x⃗^'.\n\nThis is of course just the standard expression one can find in standard\ntextbooks—see  <cit.>.  To obtain a far-field expression in the\nunphysical set-up we start by recalling that the origin in the inversion\n(unphysical) Minkowski spacetime corresponds to spatial infinity i^0\nfor the physical Minkowski spacetime so the far-field region in physical\nMinkowski spacetime corresponds to a neighbourhood of the origin in the\ninversion Minkowski spacetime.  Let ' and  be a points in\nthe physical Minkowski spacetime with physical Cartesian coordinates\n(0, x̃^' i) and (0, x̃^i) respectively.\nExpressed in unphysical Cartesian coordinates, these points correspond\nto (0, x^' i) and (0,x^i). Hence, the distance r between\n' and  can be expressed through the vector\n\n \n    r⃗:=x⃗-x⃗^'=x⃗̃⃗\n          -x⃗̃⃗^'.\n\nIn terms of the physical coordinates, imposing the far-field\napproximation means |x⃗̃⃗|>>|x⃗̃⃗^'|.\nConsequently,\n \n    r:=|r⃗| = |x⃗̃⃗-x⃗̃⃗^'| \n       ≃ |x⃗̃⃗|\n       =1/|x⃗|= 1/ρ.\n\nTherefore, in the far-field approximation one can write\n  \n    δ≃ -ρ/4π∫_ℝ^3 \n        (t-r,x⃗^')d^3x⃗^'.\n\n\nIn particular, for the case where δ is either δΦ_μν, δ g_μν or δ d_αβμν\none can derive quadrupole-like formulae. To do so, it is necessary to\ncompute the divergence of the source terms appearing in equations\n(<ref>), (<ref>) and (<ref>).\nLet's define\n\n    𝒮_μν    :=-4 δΦ _μν\n        - g_μν _αF^α\n        +  _μF_ν +  _νF_μ +\n        12δ F _μν\n    \n       S_μν   :=-2 δ T_(μ^α_ν)_α \n      - _αδ T_μ^α_ν\n      + 1/6_{μ_ν}δ F, \n    \n       S_μναβ   :=\n      2 _[μδ T _|αβ|ν] \n      + 2 _[αδ T_|μν|β] \n      + 2 _β[ν_|σδ T_α|^σ_μ] \n      + 2 _α[μ_|σδ T_β|^σ_ν].\n\nRecall that the fields encoded in ϕ satisfy the\nCEFEs, hence the background conformal factor satisfies\nZ_ab=0 as defined in equation\n(<ref>), which for the flat background\ncase reduces to _μ _ν =  s_μν. A direct calculation using the latter expression  and\nthe matter relations (<ref>) shows that\n\n    ^ν𝒮_μν=□F_μ,     ^ν  S_μν= \n      18□_νδ F,     ^λ  S_λασβ =\n      □δ T_σβα.\n\nThe first two equations simply encode equations\n(<ref>) and (<ref>)  in a\ndivergence-like format. The third equation in (<ref>) shows\nthat equation (<ref>) propagates.\n\n\n\n  \n  For the scalar variables δ s and δΞ, the leading\n  order source terms can be evaluated directly. In the case of rank-2\n  tensors, a reason for reducing the sources to quadrupole form is\n  to make the field dependent on a single (the time-time) component of \n  the source tensor.\n  \n\n\n\n\n\n\n  §.§.§ A quadrupole-like formula for δΦ_μν and \nδ g_μν\n\n\n\nHere, we derive quadrupole-like formulae for δΦ_μν and\nδ g_μν, which we discuss in tandem. Since the source term\n𝒮_μν contains δΦ_μν [cf. equation\n(<ref>)] first one solves for δΦ_μν\nand then for δ g_μν.  Let δ Q_μν = δΦ_μν or δ g_μν and ℱ_μ =\n18_μδ F  or  F_μ, and\nσ_μν = S_μν or 𝒮_μν,\nrespectively.  Exploiting that equations (<ref>)\nand (<ref>) can be collectively written as\n^νδ Q_μν= ℱ_μ one has that\n\n    _0 δ Q_00=^iδ Q_i0 -ℱ_0,\n          _0 δ Q_0i=^jδ Q_ij\n      -ℱ_i,\n\nThus, once δ Q_ij is determined, δ Q_0i can be\nobtained by formally integrating the second equation in\n(<ref>). In turn, δ Q_00 is obtained by\nintegrating the first equation in (<ref>).  For the\nparticular case of δΦ_μν one could instead use that\nδΦ_μ^μ=0 to solve algebraically for δΦ_00.\nThus, one can reduce the discussion to that of obtaining a\nquadrupole-like formula for δ Q_ij. Recall that the far-field\napproximation reads\n\n    δ Q_ij≃ -ρ/4π∫_Σσ_ij(t-r,x⃗^')d^3x⃗^'.\n\nIf one were to restrict the calculations to gauge source functions\nsatisfying □F^μ = □_μδ F= 0 (in particular, F^μ= δ F=0) then the integrand\nwould satisfy ^νσ_μν=0 leading to an\nexpression which is formally identical to the quadrupole formula in the\nnon-conformal set-up for the physical metric perturbation —see for\ninstance <cit.>.  However, it is instructive to keep the\ngauge source function terms since it will serve as model for the\nderivation of the quadrupole-like formula for the rescaled Weyl tensor\nwhere the divergence of the source term S_μναβ cannot\nbe set to zero by gauge considerations —see the last equation in\n (<ref>). Here, we only assume that the gauge source\nfunctions are specified. The first two equations (<ref>) in the\ncurrent notation read ^νσ_μν =\n□ℱ_μ, which in components read\n\n    _0σ^00 + _iσ^i0\n      =□ℱ^0,     _0σ^0i\n      + _jσ^ij = □ℱ^i.\n\nIntegrating _i(σ^ikx^' j) over a region\nΩ⊂Σ and using Gauss' law gives the following\nidentity\n\n    ∫_∂Ωσ^ik x^' j ds_i =∫_Ωσ^jkd^3x⃗^' + ∫_Ω x^' j_i\n      σ^ikd^3x⃗^',\n\nwhere we have used _i x^' j = δ_i^j and\nds_i is the surface element of ∂Ω.\n\n\n   It will be assumed that the matter fields encoded in\n  S_μν and S_μναβ, as defined in equation\n  (<ref>), have compact support in Ω⊂ℝ^3.  \n\n\n\n\n\n  \nRecall that  □Φ_μν=S_μν, then\nunder assumption <ref> it follows that\nδΦ_μν has compact support in Ω.\nFurthermore, choosing\nthe gauge source function F^μ appropriately,\none can then assume that that 𝒮_μν [as given in equation\n(<ref>)] has compact support in Ω.\n\n\n\n\nUsing assumption <ref> and Remark\n<ref>, equations (<ref>) and\n(<ref>) give\n\n    ∫_Ωσ^jkd^3x⃗^'=-∫_Ωx^'(j□ℱ^k)d^3x⃗^' +\n      d/dt^'∫_Ωx^'(jσ^k)0d^3x⃗^'.\n\nSimilarly, integrating _k(σ^0kx^' ix^'\n  j) over a region Ω and proceeding as before, making use of\nGauss' law one obtains\n\n    ∫_∂Ωσ^0kx^' ix^' j ds_k\n      =∫_Ω x^' ix^' j_k\n      σ^0kd^3x⃗^' + 2 ∫_Ω x^' (iσ^j)0d^3x⃗^'.\n\nThen using Remark <ref> and equations\n(<ref>) and (<ref>) renders\n\n    ∫_Ω x^'(iσ^j)0d^3x⃗^'  =\n      -1/2∫_Ω x^' ix^' j□ℱ^0 d^3x⃗^'\n      + 1/2d/dt^'∫_Ω x^' ix^' jσ^00d^3x⃗^'\n\nCombining equations (<ref>)\nand (<ref>) one gets\n\n    ∫_Ωσ^jkd^3x⃗^' =\n         1/2d^2/dt^'^2∫_Ω x^' i x^' jσ^00d^3x⃗^'-1/2d/dt^'∫_Ω x^' ix^' j□ℱ^0 d^3x⃗^'\n       -∫_Ωx^'(j□ℱ^k)d^3x⃗^'\n\ntherefore, using the far-field approximation (<ref>)\ngives\n\n    δ Q_ij≃ -ρ/8πd^2ℐ_ij(t')/dt'^2|_t'=t-r +ρ/8πd𝒥_ij(t')/dt'|_t'=t-r -ρ/4π𝒦_ij(t')|_t'=t-r\n\nwhere\n\n    ℐ^ij:= ∫_Ωσ^00x^' ix^'\n        jd^3x⃗^',     𝒥^ij := ∫_Ω\n      x^' ix^' j□ℱ^0d^3x⃗^',     𝒦^ij := ∫_Ω□ℱ^(ix^' j) d^3x⃗^'.\n\n\nAs discussed earlier, the gauge source functions could be set to zero, \nbut in certain applications, it can be useful to consider general gauge \nsource functions. Of course, one may wish to implement a scri-fixing \ngauge for this situation, but such a gauge may be incompatible with the\nassumption that 𝒮_μν has compact support in Ω.\nHowever, the purpose of the present analysis is to provide a template\nfor deriving the quadrupole formula for the Weyl tensor, in which such a\nscri-fixing gauge can be implemented.\n\n\n\n  \n  The reader might wonder whether quadrupole-like formulae are\n  appropriate for trace-free energy-momentum tensors, which often\n  corresponds to that of radiation. The concern is that in order to\n  implement the far-field approximation, one implicitly assumes a\n  slow-motion approximation, which is inconsistent with radiation\n  propagating at the speed of light. However, geons\n  <cit.> and\n  photon stars\n  <cit.>\n  provide examples of stationary compact sources formed from\n  self-gravitating radiation, which may at the very least provide useful\n  toy models (the extension of our results to the case of nonvanishing\n  trace will be discussed elsewhere). Nevertheless, the primary reason\n  for the preceding analysis is to provide a template for deriving the\n  quadrupole formula for the rescaled Weyl tensor, which can be\n  straightforwardly generalised to the case with trace. This is discussed\n  further in Remark <ref>. \n  \n\n\n\n\n\n\n  §.§.§ A quadrupole-like formula for the rescaled Weyl tensor \nperturbation\n\n\nWe now turn to the case of the rescaled Weyl tensor δ\nQ_αβμν=δ d_αβμν. Here, the source\nterm S_αβμν is given entirely in terms of matter fields\n—see equation (<ref>). Expanding in components the\ndivergence equation (<ref>) one has\n\n    _0 S^0μσν + _k\n      S^kμσν = □δ\n      T^σνμ\n\nConsidering the case σ=j in equation (<ref>) one has\n\n    _0 S^0μ j ν + _k S^kμ j ν =\n      □δ T^j νμ\n\nIntegrating _k ( S^k μ j ν x^' i) over Ω\nand using Gauss' law gives\n\n    ∫_∂Ω S^k μ j νx^' i ds_k = \n      ∫_Ω S^iμ jν d^3x⃗^' \n      + ∫_Ω x^' i_k S^k μ j ν\n      d^3x⃗^'\n\nUsing assumption <ref> the boundary term in the\nleft-hand side of (<ref>) vanishes. Solving for the\nintegral with S^iμ j ν and substituting _k S^k μ\n  j ν using equation (<ref>), gives the following\nexpression (after symmetrising the spatial indices):\n\n    ∫_Ω S^(i |μ| j) νd^3x⃗^' =\n      - ∫_Ω x^' (i□δ T^j)νμ\n      d^3x⃗^'\n      +  d/dt^'∫_Ω  x^' (i|  S^0μ |j) ν\n      d^3x⃗^' .\n\nNow, considering the case σ =0 in equation (<ref>) one\nhas\n\n    _0  S^0ν 0 μ  + _k  S^k ν 0 μ\n      =  □δ T^0 μν.\n\nIntegrating  _k ( S^0 μ k ν x^' ix^' j)\nover Ω and using Gauss' law gives\n\n    ∫_∂Ω S^0 μ k νx^' ix^' j ds_k =\n      2 ∫_Ω  S^0 μ (j |ν| x^' i) d^3x⃗^'\n      + ∫_Ω x^' ix^' j_k  S^0 μ k ν d^3x⃗^'.\n\nUsing assumption <ref> to remove the boundary terms and\nexploiting the pair-interchange-symmetry of S_μναβ to\nrewrite _k S^0 μ k ν in using equation\n(<ref>) renders\n\n    ∫_Ω S^0 μ (j |ν| x^' i)d^3x⃗^' =\n      -1/2∫_Ω x^' ix^' j□δ T^0 μν d^3x⃗^' +\n      1/2d/dt^'∫_Ω x^' ix^' j\n      S^0ν 0 μd^3x⃗^'.\n\nTogether, equations (<ref>) and\n(<ref>) give\n\n    ∫_Ω S^(i |μ| j) ν d^3x⃗^' = 1/2d^2/dt^'^2∫_Ω x^' ix^' j\n      S^0ν 0 μd^3x⃗^' -1/2d/dt^'∫_Ω x^' ix^' j□δ T^0\n        μνd^3x⃗^' - ∫_Ω x^' (i□δ T^j)νμ d^3x⃗^'.\n\nTo employ equation (<ref>) one needs to perform an\nelectric-magnetic decomposition of the tensors involved in the current\ndiscussion.  Consider any tensor W_abcd with the symmetries of the\nWeyl tensor and let n^a be a normalised timelike vector such that\nn_an^a=-1. Define the associated projector as\nh_a^b:=g_a^b + n_an^b. Then, the electric part E_ab\nand magnetic part B_ab of W_abcd are given by\n\n    E_ab:=W_efgdn^fn^dh_a^eh_b^d,     \n    B_ab:=W^*_efgdn^fn^dh_a^eh_b^d,\n\nwhere B_ab=-12ϵ_cd^efW_abef with\nϵ_abcd is the (4-dimensional) volume-form of g_ab.  In\npractice (particularly when working in an adapted frame), instead of\nworking directly with B_ab it is simpler to use\n\n    B_abc:=W_efghn^fh_a^eh_b^gh_c^h,\n\nwhich is related to B_ab via B_ab= -\n1/2B_acdϵ_b^cd where\nϵ_abc:=ϵ_fabcn^f is the (3-dimensional) volume-form\nof h_ab —see <cit.> for further discussion on the\nelectric-magnetic decomposition. In the present case, since the\nbackground is flat, one can simply take the normal vector to be n^ν=\nδ_0^ν so that the electric-magnetic split of\nd_μναβ simply correspond to\n\n    δ d_ij:= δ d_i0j0,     δ d_ijk:=δ\n    d_i0jk.\n\nThe wave equation for δ d_μναβ, which compactly\nwritten  reads □δ d_μναβ=\nS_μναβ, can then be split into the wave equations for\nd_ij and d_ijk:\n\n    □δ d_ij= S_ij,     □δ d_ijk= S_ijk,\n\nwhere S_ij:=  S_i0j0 and S_ijk:= S_i0jk. Using the\nfar-field approximation expression (<ref>) and equation\n(<ref>) then gives\n\n    δ d_iμ j ν≃ -ρ/8πd^2I_ijμν(t')/dt'^2|_t'=t-r +ρ/8πdJ_ijμν(t')/dt'|_t'=t-r +ρ/4π\n     K_ijμν(t')|_t'=t-r,\n\nwhere\n\n    I^ij μν:=∫_Ω y^iy^j δ S^0ν 0 μd^3y⃗,\n           J^ij μν:=∫_Ω y^iy^j □δ\n      T^0 μνd^3y⃗,      K^ij μν:= ∫_Ω y^(i□δ T^j)νμ d^3y⃗.\n\nIn particular, setting μ=0 and ν=0 one gets the quadrupole-like\nexpression for δ d_ij and similarly taking μ=0 and ν =\nk for δ d_ijk.  Proceeding as described before and exploiting\nthe symmetries of S^μναβ (those of the Weyl tensor) and\nthose of δ T^αμν [cf. equation\n(<ref>)] renders\n\n    δ d_ij≃ρ/4π K_ij00(t')|_t'=t-r ,\n          δ d_ijk≃ρ/4π K_ijk0(t')|_t'=t-r,\n\nRecall that the rescaled Cotton tensor T_αμν can be\nexpressed in terms of the derivatives of the unphysical energy momentum\ntensor. Therefore equation (<ref>) allows one to\nexpress the perturbation to the rescaled Weyl tensor in the far-field\napproximation in terms  derivatives of the perturbation to the\nunphysical energy momentum tensor δ T_μν and background\nquantities via equation (<ref>).\n\n\n \n   Although the focus of this article has been in the conformal\n  spacetime set-up —and hence restricted to trace-free matter models—\n  an analogous calculation can be performed directly in the physical\n  spacetime, lifting then the trace-free  matter restriction,\n  obtaining a quadrupole-like formula for perturbations of the Weyl\n  tensor.  Observe that, for the derivation of the wave equation\n  satisfied by the rescaled Weyl tensor, the specific form of the\n  rescaled Cotton tensor (in terms of the unphysical energy-momentum\n  tensor) is never used. It follows that for the physical set-up, one \n  gets a\n  formally identical equation.  The wave equation for the Weyl tensor\n  has been derived for instance in <cit.> and <cit.>.\n  Therefore, the analysis of section <ref> would still\n  hold replacing the rescaled Weyl tensor d_abcd with the Weyl\n  tensor C_abcd and the rescaled Cotton tensor T_abc by its\n  physical counterpart T̃_abc which written in terms of the\n  physical energy-momentum reads:\n  \n    T̃_abc:= ∇̃_[aT̃_b]c +\n        1/3g̃_c[b∇̃_a](λ- T̃).\n\n\n\n\n \n   We note that the expression for S_μναβ is\n  independent of the choices for the gauge source function. For this\n  reason, one can choose the scri-fixing gauge independently of the\n  assumption that S_μναβ has compact support in\n  Ω; the quadrupole-like formula we obtain for the rescaled Weyl\n  tensor is therefore compatible with any gauge choice, in particular\n  the scri-fixing gauge introduced earlier.\n\n\n\n\n\n\n\n\n§ SUMMARY AND DISCUSSION\n\n\n\n\nIn this article, we have presented the linearisation of the wave-like\nhyperbolic reduction of the CEFEs in a GHG gauge for a general\nbackground. As a first step toward studying the linear perturbations of\nspacetimes using the conformal CEFE approach, the equations have been\nparticularised to the case where the background is the inversion\n(unphysical) Minkowski spacetime. Conceptually, when studying\nperturbations of the physical Minkowski spacetime, one can in principle\nuse any conformally flat metric so that\nd_μναβ=0. However having a non-vanishing\nΦ_μν makes the equations quite cumbersome. Hence,\nas a first analysis, we have opted to use as a background the inversion\nMinkowski spacetime for which Φ_μν=R=0.\nFor this background, we discuss the propagation of the gauge (the\ngeneralised Lorenz gauge and the linear version of the conformal\nconstraints). The fact that the chosen background is flat permits the\nuse of techniques similar to those of the classical methods in physical\nspacetime to study gravitational waves. In this manner, we have obtained\nthe conformal CEFE counterpart of the classical linearisation of the\n(physical) Einstein field equations.\n\n\n\n\nNevertheless, one may wish to consider linearising around non-flat\nconformal representations of the Minkowski spacetime. A particularly\ninteresting choice is the i^0-cylinder representation of Minkowski\nspacetime, as this is particularly useful for studying the gravitational\nfield close to the critical sets ℐ^±—the region where\nnull-infinity ℐ and spatial infinity i^0 meet.  Although\nthis analysis has been done via the spin-2 equation\n∇_A'^Aϕ_ABCD=0 in <cit.> (see also\n<cit.> for a discussion of the solutions of\nwave equations in this background) where it has been shown that the\n(linearisation of rescaled Weyl spinor) spin-2 field develops\nlogarithmic terms, it would be of interest to see how these logarithmic\nterms manifest in the metric, which is the variable employed in most\nperturbation schemes in physics (such as the post-Minkowskian\nexpansions). Another interesting class of backgrounds are Petrov type D\nspacetimes such as Kerr, so that a conformal Teukolsky-like equation may\nbe obtained; however, a different linearisation procedure (such as that\nof Chandrasekhar<cit.>), may be more appropriate in that case.\nThese avenues will be pursued in future work.  More generally, the\npresent work represents a first step into studying linear perturbations\nof spacetimes of physical interest within the CEFE\nframework.\n\n\n\n\nA particularly useful result of this paper is the development of a\nscri-fixing strategy using gauge source functions for CEFEs.  Our\nstrategy provides an alternative to more abstract gauges based on\nconformal curves and conformal geodesics <cit.>, one that is\nparticularly well-suited for numerical implementation. Though the\nstrategy is initially developed for the linearised equations (which are\nexpected to be good approximation in the weak field region of\nasymptotically flat spacetimes of physical interest), the generalisation\nto the nonlinear case, as discussed in the main text, is\nstraightforward. A minor limitation of this scri-fixing strategy in the\nasymptotically flat setting is that the initial data must be prescribed\non slices that intersect future null infinity (as opposed to spatial\ninfinity), nonetheless our scri-fixing strategy fits well within the\nhyperboloidal approach to Numerical Relativity.\n\n\n\n\nFinally, we have constructed quadrupole-like formulae for the CEFEs\nlinearised around a flat background. While the quadrupole-like formulae\nfor δ g_μν and δΦ_μν require gauge\nsource functions with compact support and a trace-free energy-momentum\ntensor, the quadrupole-like formula we obtain for the Weyl tensor is\nindependent of gauge choice and is formally identical to the case where\nthe energy-momentum tensor has nonvanishing trace. Since the Weyl tensor\nyields an unambigious notion of gravitational radiation at future null\ninfinity, our result provides a familiar prescription for computing\ngravitational waveforms at null infinity generated by weakly gravitating\nsources in the linear approximation.\n\n\n\n\n\n\n §.§ Acknowledgements\n\n\n\n\nWe have profited from conversations with Juan Valiente Kroon and David\nHilditch and Alex Vañó Viñuales.  We also thank J. Valiente\nKroon for sharing a Mathematica notebook where  the main\ncalculations of <cit.> were done.  EG holds a FCT (Portugal)\ninvestigator grant 2020.03845.CEECIND.  JF acknowledges support from\nFCT (Portugal) program UIDB/00099/2020. JF is grateful to the Yukawa\nInstitute for Theoretical Physics, Kyoto University, which hosted a\nvisit during which a part of this work was performed.\n\n\n\n\n\n\n\n\n\n§ EXPLICIT EXPRESSIONS FOR LINEARISED CEFES\n\n\n\n\n\nHere, we provide expressions for the right-hand side of the linearised\nwave-CEFEs, which are given below (ϕ and  schematically\nrepresenting the respective field variables and gauge sources):\n\n    □δ g_μν   =\n        H^g_(μν)(δϕ,\n        δϕ  ;  ϕ, , \n        ϕ,\n         )\n        \n    □δΞ    = H^Ξ_(δϕ, δϕ  ;  ϕ, , ϕ )  \n    □δ  s \n            = \n        H^s(δϕ, δϕ  ;  ϕ, , ϕ,\n         )   \n    □δΦ_μν   = \n        H^Φ_(μν)(δϕ,\n        δϕ  ;  ϕ, , ϕ,\n          ,  F, δ F )\n        \n    □δ  d_μναβ    =\n        H^d_[μν][αβ](δϕ, \n        δϕ  ;  ϕ, , ϕ,\n        ϕ,  ) .\n\n\nTo give more concise expressions, the quantities  on the\nright-hand side of the equations above are provided below without\nexplicit (anti)symmetrisation; the appropriate (anti)symmetrisation of\nindices is indicated in equation (<ref>).  This\ncalculation has been performed using the xPert package of the\nsuite xAct  in Mathematica <cit.> for metric\nperturbation theory.\n\n\n    H^g_μν   := -4 δΦ _μν +8 \n      _(μ^αδ g_ν )α -2 δ\n      g^αβd_(μ |α |ν )β \n      + 16δ\n      g_μν + δ g^α_α (-2  _μν\n      - 16_μν)\n      + 2  _(μ_ν )\n       \n      + _μν\n      (12δ F + 2 δΦ ^α_α -2\n      ^αβδ g_αβ - \n      _α^α)\n\n\n\n  H^Ξ_     := - 16 δΞ- 16\n  δF + 4 δs + (12 ^3 ^μν - ^μν) δg_μν +\n  (124 - s) δg^μ_μ +\n  ^μ _μ\n\n\n    H^s    := (12)^2 (δΞ\n      - 14δ g^μ_μ)\n      +  ^μν (2 δΦ _μν\n      -  ^3 δ T_μν \n      + _μν \n      (δΞ + 12δ g^α_α)\n      + 112δ g_μν\n      -  sδ g_μν\n        \n      - _μ^αδ g_να)\n      \n      + ^μν (-  ^3 δΦ _μν \n      + 12 ^5 δ T_μν\n      -  12 ^2  _μν \n      (6 δΞ + δ g^α_α)\n      + 18 ^4 _μν \n      (10 δΞ + δ g^α_α) \n       \n      + 12 ^2  δ g_μν\n      ( s  -  112 )\n      + (  ^3  _μ^α\n        - 14 ^5  _μ^α\n        )\n      δ g_να) +\n      24 \n      (\n        sδ g^μ_μ + 13 \n        (δ F  - 12 δ s  \n        - 3  ^μ _μ )\n      )\n      \n       \n      + 16 ^μ (3 δ  g^να\n      ( ^2  _α_μν\n      -2   _α _μν) \n      -  _μδ  F)  \n      - 16 ( sδ F  \n      + _μδΞ ^μ)\n      - ^μ _μν ^ν\n       \n      + (δ T_μν\n      - _μ^αδ g_να)\n       ^μ ^ν \n      + 18δ g_μν ^μ ^ν +  _μν\n      (12 ^2 ^μ^ν  \n      + 2   ^μ ^νδΞ\n       \n      + (δΞ + 12δ g^α_α)\n       ^μ ^ν)\n\n\n\n    H^Φ_μν    := 13δΦ _μν\n      + 12 ^3 ^αδδ d_μανδ\n      - 2  _μ^δ _νδδ g^α_α\n      - 112 _μν \n        (2 δ F  + δ g^α_α)\n      - 2  _μ^αδ g^δβ_νδαβ\n       \n      + _μανδ \n      (-2  ^αδδΞ\n      + 12  (3 ^αδδΞ\n      - 4 δΦ ^αδ \n      +  ^2 δ T^αδ))\n      + 124 (δ g^α_α_μν\n      - 12δ g_μν) □ _\n       \n      + (4  ^αδδ g_α^β\n        - ^δβδ g^α_α\n        + 14 ^3 (\n            -4 ^αδδ g_α^β\n            + ^δβδ g^α_α)\n        ) _μδνβ\n      - 2 δ T_μ^α_ν _α\n       \n      +  ^αδ (\n        - 2 δ d_μανδ\n        - 2  _μνδ g_αδ\n        -  _αδδ g_μν\n        - 2 δΦ _αδ_μν\n        + 2  _α^βδ g_δβ_μν)\n      - 2 _μ^α_ν _αδΞ\n       \n       + ^α (_μαν \n       +  _α _μν)\n       + δ g^αδ _α_μδν\n       +  _αδ g_νδ (\n          - ^αδ_μ\n          + 12_μ^αδ\n          + 2  ^α _μ^δ)\n      \n       \n        -  ^αδ T_μαν\n      - δΞ ^α_μαν\n      + 2 δ g^αδ_μαν _δ\n      + (- 12_μ^αδ\n        -2  ^α _μ^δ) \n         _δδ g_να\n       \n      + 112 _αδ g_μν ^α\n      + 124_μν(\n        -  _αδ g^δ_δ^α\n        + ^α _α\n        + δ g^αδ _δ _α)\n      + δ g^αδ _δ _α _μν\n       \n      +  _αδ g^δ_δ (\n        - 34_μ^α_ν\n        -  ^α _μν \n        +  _μ _ν^α)\n      - 16 ^α _μδ g_να\n      - ( 14_μ^α_α\n      +  ^α _μα)  _νδ g^δ_δ\n       \n      +  _μ^α (4 δΦ _να\n      + 2  _ν^δδ g_αδ\n      + 16δ g_να \n      + 2  _α^δδ g_νδ\n      + 2  _ν_α) \n      + (12_μ^αδ\n      + 2  ^α _μ^δ) \n         _νδ g_αδ\n       \n      + 112 _μ _νδ g^α_α\n      - 112δ g^α_α _ν _μ\n      + 16 _{ν _μ}δ F\n\n\n\n\n    H^d_μναβ    :=\n      12δ d_μναβ\n      - ^2 _α^δδ d_μνβδ\n      -  ^2 _μ^δδ d_νδαβ\n      - ( 12δ F  \n        + 4  ^δσδ g_δσ\n        + 112δ g^δ_δ) \n        _μναβ\n       \n      + (-2 _α^δδΞ  \n        + 4 δΦ _α^δ\n        -  ^2 δ T_α^δ  \n        - 16δ g_α^δ\n        + 2  _α^δδ g^σ_σ) _μνβδ\n      - 2 δ d_α^δ_β^σ_μνδσ\n       \n      + (-2  ^δσδ g_αδ\n        +  ^2 _α^δδ g_δ^σ\n        - 6  _α^δδ g_δ^σ)\n        _μνβσ\n      - 2_αδβσ \n        ( δ d_μν^δσ\n        +  δΞ_μν^δσ)\n      \n       \n      - (2 _μ^δδΞ\n        - 4 δΦ _μ^δ  \n        +  ^2 δ T_μ^δ\n        + 16δ g_μ^δ\n        - 2  _μ^δδ g^σ_σ) \n        _νδαβ\n      + 4 δ g_μα _δ_β^δ_ν\n      + _μαβ _νδ g^δ_δ\n       \n      - 2(4 δ d_μ^δ_α^σ\n        +  ^2 ^δσδ g_μα\n        + 2 δΞ_μ^δ_α^σ) \n        _νδβσ\n      + ( ^2 _μ^δδ g_δ^σ\n        - 6  _μ^δδ g_δ^σ\n        -2  ^δσδ g_μδ) \n        _νσαβ\n       \n      + 2δ g^δσ (\n        _βδσγ_μνα^γ\n        + _μ^γ_αβ_νδσγ)\n      + 4 δ g^δσ (\n        _ασβγ_μνδ^γ\n        + _μ^γ_αδ_νγβσ \n        + _μδα^γ_νσβγ) \n      \n       \n      - δ g^δ_δ\n      ( _ασβγ_μν^σγ\n      + 2 _μ^σ_α^γ_νσβ  g)\n      - 2   (2 ^δσδΞ\n        + δ T^δσ) \n        _μδασ_νβ\n      + F ^δ _δ_μναβ\n       \n      + ^δσδ g_δ^γ\n        (2^2_μγασ_νβ  \n        + 2  ^2 _μσαγ_νβ)\n      + 2  _αδ T_μνβ\n      + 2 _μναδ _β^δ\n      - _μαν _βδ g^δ_δ\n       \n      + _νβ \n        (-2 ( ^2 ^δσδ d_μδασ\n            + 2 ^δ_αδμ)\n        + (4 _α^δ_μ \n          + _μα^δ\n          + _μ^δ_α) \n           _δδ g^σ_σ)\n      - _μβ_α^δ_δ _νδ g^σ_σ\n       \n      + 2  _μδ T_αβν\n      - δ g^δ_δ \n        (  _α_μνβ\n        +  _μ_αβν)\n      + 2 _μδαβ _ν^δ\n      + 4 _(α^δ_μ ) \n        (  _βδ g_δν \n        +  _νδ g_βδ\n        -   _δδ g_βν)\n        \n       \n      + 4 ^δσ_μ_να _σδ g_βδ\n      + 2 _μβ_α^δσ\n        (  _δδ g_νσ\n        +  _νδ g_δσ\n        -  _σδ g_νδ)\n        + 4  _[δ_|μνβ|  σ] ^σδ g_α^δ\n       \n      + _μα \n        (4  _δδ T_β^δ_ν\n        - 4 δ g^δσ _σ_βδν\n        - 2 δ g^δ_δ _σ_β^σ_ν)\n      - 2  _αδ g^δσ _σ_μνβδ\n      - 2  _μδ g^δσ _σ_νδαβ\n       \n      + 8  _[σ_δ] ναβ ^σδ g_μ^δ\n      - 2 (  _[α_|μνβ| σ]  \n          +  _[μ_|ν| σ]αβ ) \n           ^σδ g^δ_δ\n      + δ g^δσ _σ _δ_μναβ\n\n\n\n\n\n\n\n\n§ REDUCED WAVE EQUATIONS\n\n\n\n\n\nIn this appendix, we extend the analysis leading up to\n(<ref>) to the other wave equations listed in\n(<ref>) for the sake of completeness. In particular, we wish to\nrecast (<ref>) explicitly as a system of second order\nhyperbolic equations.  This non-linear system of wave equations was\noriginally derived in <cit.> using slightly different set of\nvariables and a different reduced wave operator.\n\n\n\nFirst observe that in general, the geometric wave operator acting on a\ntensor will give rise to derivatives of the Christoffel symbols. Since\nthe metric is a variable of the system, this is problematic for\nhyperbolicity. In particular, for a covector w_a one has\n\n    □ w_μ=   w_μ\n      - w^ν∇ _αΓ_νμ^α\n      -2 Γ_νμα∇ ^αw^ν\n      - Γ _ν∇ ^νw_μ\n      - Γ^α_μ^βΓ_ναβ w^ν\n      - Γ_νμ^αΓ _α w^ν.\n\nIn this appendix, indices are raised and lowered with the metric g_μν. Observe that the second term in the right-hand side of equation\n(<ref>) represents second derivatives of the metric.\nHowever, one can replace these derivatives of the Christoffel symbols by\nnoticing the identity\n\n    g^μα∇ _αΓ ^β_νμ = -\n      R_ν^β+Γ^βμαΓ _μνα - Γ^β_νμΓ ^μ + ∇\n      _νΓ^β.\n\nExploiting the identity (<ref>) a direct calculation gives\n\n    □ w_μ =   w_μ +\n      1/4 R w_μ + 2 Φ _μν w^ν\n      - ℒ_Γ  w_μ\n      -2 Γ_νμα∇ ^αw^ν\n      -2 Γ^α_μ^βΓ_ναβ w^ν\n\nwhere ℒ_Γ is the Lie-derivative along Γ^a. Using\nthe definition of the conformal and the GHG-constraints one can rewrite\nthe last expression as\n\n    □  w_μ =   w_μ +\n      1/4 C w_μ - ℒ_C  w_μ + \n      1/4 F w_μ\n      + ℒ_ℋ  w_μ + 𝒬(w)_μ\n\nwhere ℒ_C and ℒ_ℋ are the Lie\nderivative along C^a and ℋ^a respectively and\n\n    𝒬(w)_μ := 2 Φ _μν w^ν\n      -2 Γ_νμα∇ ^αw^ν\n      -2 Γ^α_μ^βΓ_ναβ w^ν\n\nOne can generalise the latter calculation for tensor of type (0,n) as\nfollows\n\n    □  w_μ_1 ...μ_n =  w_μ_1\n        ...μ_n + n/4 C w_μ - ℒ_C w_μ_1\n        ...μ_n + n/4 F w_μ_1 ...μ_n \n        + ℒ_ℋ\n      w_μ_1 ...μ_n + 𝒬(w)_μ_1 ...μ_n\n\nwhere\n\n    𝒬(w)_μ_1 ...μ_n :=     2 Φ _μ_1ν\n      w^ν_μ_2...μ_n -2 Γ_νμ_1α∇\n      ^αw^ν_μ_2...μ_n -2 Γ^α_μ_1^βΓ_ναβ w^ν_μ_2...μ_n +\n      ...+ \n        + 2 Φ _μ_nν w_μ_1...ν_n-1^ν -2\n      Γ_νμ_nα∇ ^αw_μ_1...μ_n-1^ν -2 Γ^α_μ_n^βΓ_ναβ w_μ_1...μ_n-1^ν.\n\nThen, by imposing the conformal and GHG-constraints are satisfied so\nthat C=0 and C^a=0 one effectively has effectively removed the\nproblematic terms for hyperbolicity:\n\n    □ w_μ_1 ...μ_n =  w_μ_1 ...μ_n\n      + n/4 F w_μ_1 ...μ_n + ℒ_ℋ\n      w_μ_1 ...μ_n + 𝒬(w)_μ_1 ...μ_n\n\nApplying the latter rule on each of the fields appearing on the\ngeometric wave equations one obtains a set of hyperbolic non-linear\nwave equations which read as follows.\n\n\n\nFor the components of the metric:\n\n\n\n\n    g_μν = - 4Φ_μν \n    - 12F g_μν -\n    2 ∇ _(μℋ_ν)  - g^σδg^αβ\n    (Γ_νδβΓ_σμα +\n    2Γ_δνβΓ_(μν) α ).\n\n\nFor the components of the trace-free Ricci tensor:\n\n\n\n    Φ_μν = - 16Φ _μν F\n      -ℒ_ℋΦ_μν - 𝒬(Φ)_μν \n        + 16∇ _{μ∇ _ν}F + \n      4 Φ _μ^αΦ _να\n      - Φ _αβΦ ^αβ g_μν\n      -2 ΞΦ ^αβ d_μανβ\n                                           \n      +   12Ξ ^3 T^βα d_μβνα\n      - Ξ∇ _αT_ν^α_μ\n      - 2T_(μ|α|ν)∇ ^αΞ.\n\n\n\nFor the components of the rescaled Weyl tensor:\n\n    d_μναβ  \n      =    -12F d_μναβ\n      -ℒ_ℋd_μναβ \n      -𝒬(d)_μναβ + 2\n      Ξ d_μ^σ_β^λ\n      d_νσαλ -2 Ξ\n      d_μ^σ_α^λ d_νσβλ\n      -2 Ξ d_μν^σλ d_ασβλ\n        - Ξ^2T_[α^σd_β]σμν -\n      Ξ^2T_[μ^σd_ν]σαβ +\n      Ξ^2T^σλ( d_μσλ[αg_β]ν -\n      d_νσλ[αg_β]μ ) + 2\n      ∇_[μT_|αβ|ν]\n                              \n      +2  ∇_[αT_|μν|β] + 2\n      g_β[ν∇_|σT_α|^σ_μ] + 2\n      g_α[μ∇_|σT_β|^σ_ν].\n\n    \n\nFor the Friedrich scalar:\n\n\n    s =       - 16 F s \n      - ℒ_ℋ s   \n      - 16 g_μν∇ ^μΞ∇ ^νF\n      + (F12)^2 Ξ \n      + ΞΦ _μνΦ ^μν\n      + 14Ξ^5 T_μν T^μν\n      - Ξ ^3 T^μνΦ _μν\n                                                             \n      + Ξ  T_μν∇ ^μΞ∇ ^νΞ.\n\n\nFor the conformal factor:\n\n\n    Ξ = - 16Ξ F\n      - ℒ_ℋΞ   + 4 s .\n\n\n\n\n   In vacuum, the hyperbolicity of the wave equations\n  (<ref>) is clear. However, for the case with matter\n  T_ab=T_ab(τ, ∇τ), one could at first instance\n  question their hyperbolicity due to the presence of first derivatives\n  of the rescaled Cotton tensor T_abc which encode second\n  derivatives of the energy-momentum tensor T_ab —hence the\n  equations contain two (or more) derivatives of the matter fields\n  τ. Nonetheless, one can still ensure hyperbolicity\n  constructing wave equations for τ and ∇τ so that\n  T_abc is expressed in terms of evolved fields only. For instance,\n  in the case of the conformally invariant scalar field\n  T_ab=T_ab(ϕ, ∇ϕ)  one needs to construct wave\n  equations for ϕ and a reduction variable φ=∇ϕ\n  —see <cit.>.  Since this is a case-dependent analysis and\n  this has been done in <cit.> for a number of matter models,\n  further discussion is omitted. \n\n\n\nIn <cit.> the reduced wave operator is defined so that the\nlower order contributions (along with terms involving the gauge source\nfunctions) are absorbed into the definition of the operator\n▪ in such a way that the reduced equations look formally\nidentical to the geometric ones. Here the standard reduced wave operator\n:=g^αβ∂_α∂_β used in most\ndiscussions of generalised harmonic gauge in Numerical Relativity was\nemployed instead. The initial data for the reduced wave equations\n(<ref>) have to satisfy\n\n    Z_μν|_Σ=0,    Z_μ|_Σ=0,   δ_μνσ|_Σ=0,   λ_μνσ|_Σ=0,    Z|_Σ=0.\n\nwhere Σ⊂ℳ is a spacelike hypersurface on which\nthe initial data is prescribed. It should also be noticed that the\nGHG-constraint C^μ and the conformal constraint C are not\nindependent, in fact a calculation shows C=∇_μ C^μ.\nPropagation of the gauge and a full discussion of the propagation of the\nconstraints [i.e. propagation of the zero-quantities\n(<ref>)] has carefully been done in\n<cit.> and will not be reproduced here.  The aim of revisiting\nthe derivation of the reduced wave equations (<ref>) is\nsimply to provide context and the non-linear analogue of the\nlinearised equations derived in Section <ref>.\n\n\n\nunsrt\n\n10\n\nHilNur16\nC Denson Hill and Pawel Nurowski.\nHow the green light was given for gravitational wave search, 2016.\n\nBieGarYun17\nLydia Bieri, David Garfinkle, and Nicolas Yunes.\nGravitational waves and their mathematics.\n2017.\n\nZen08\nAnil Zenginoglu.\nHyperboloidal evolution with the Einstein equations.\nClass. Quant. Grav., 25:195025, 2008.\n\nVanHusHil14\nAlex Vañó-Viñuales, Sascha Husa, and David Hilditch.\nSpherical symmetry as a test case for unconstrained hyperboloidal\n  evolution.\nClass. Quant. Grav., 32(17):175010, 2015.\n\nVan15\nAlex Vañó-Viñuales.\nFree evolution of the hyperboloidal initial value problem in\n  spherical symmetry.\nPhD thesis, U. Iles Balears, Palma, 2015.\n\nVanHus17\nAlex Vañó-Viñuales and Sascha Husa.\nSpherical symmetry as a test case for unconstrained hyperboloidal\n  evolution II: gauge conditions.\nClass. Quant. Grav., 35(4):045014, 2018.\n\nHilHarBug16\nDavid Hilditch, Enno Harms, Marcus Bugner, Hannes Rüter, and Bernd\n  Brügmann.\nThe evolution of hyperboloidal data with the dual foliation\n  formalism: Mathematical analysis and wave equation tests.\nClass. Quant. Grav., 35(5):055003, 2018.\n\nGasHil18\nEdgar Gasperín and David Hilditch.\nThe Weak Null Condition in Free-evolution Schemes for Numerical\n  Relativity: Dual Foliation GHG with Constraint Damping.\nClass. Quant. Grav., 36(19):195016, 2019.\n\nDuaFenGasHil22\nMiguel Duarte, Justin C Feng, Edgar Gasperín, and David Hilditch.\nRegularizing dual-frame generalized harmonic gauge at null infinity.\nClassical and Quantum Gravity, 40(2):025011, dec 2022.\n\nFri81\nH. Friedrich.\nOn the Regular and the Asymptotic Characteristic Initial Value\n  Problem for Einstein's Vacuum Field Equations.\nProc. R. Soc. Lond. A, 375(1761):169–184, March 1981.\n\nVal16\nJuan-Antonio Valiente-Kroon.\nConformal Methods in General Relativity.\nCambridge University Press, Cambridge, 2016.\n\nFra04\nJörg Frauendiener.\nConformal infinity.\nLiving Rev. Relativity, 7(1), 2004.\n\nFri95\nH. Friedrich.\nEinstein equations and conformal structure - Existence of anti de\n  Sitter type space-times.\nJ. Geom. Phys., 17:125–184, 1995.\n\nLueVal12\nChristian Lübbe and Juan Antonio Valiente Kroon.\nThe extended conformal einstein field equations with matter: The\n  einstein–maxwell field.\nJournal of Geometry and Physics, 62(6):1548–1570, jun 2012.\n\nFri02\nHelmut Friedrich.\nSpin-2 fields on minkowski space near spacelike and null infinity.\nClassical and Quantum Gravity, 20(1):101–117, dec 2002.\n\nLueVal09\nC. Lübbe and J. A. Valiente Kroon.\nOn de Sitter-like and Minkowski-like spacetimes.\n26:145012, 2009.\n\nGasVal17\nEdgar Gasperin and Juan A. Valiente Kroon.\nPerturbations of the asymptotic region of the schwarzschild–de\n  sitter spacetime.\nAnnales Henri Poincaré, pages 1–73, 2017.\n\nDouFra16\nGeorgios Doulis and Jörg Frauendiener.\nGlobal simulations of minkowski spacetime including spacelike\n  infinity.\nPhys. Rev. D, 95:024035, Jan 2017.\n\nHub99\nPeter Hübner.\nA scheme to numerically evolve data for the conformal Einstein\n  equation.\nClass. Quantum Grav., 16:2823–2843, 1999.\n\nHub01\nPeter Hübner.\nFrom now to timelike infinity on a finite grid.\nClass. Quantum Grav., 18:1871–1884, 2001.\n\nHus02b\nSascha Husa.\nProblems and successes in the numerical approach to the conformal\n  field equations.\nvolume 604 of Lecture Notes in Physics, pages 239–260.\n  Springer, 2002.\n\nVal03a\nJ. A. Valiente Kroon.\nPolyhomogeneous expansions close to null and spatial infinity.\nIn J. Frauendiener and H. Friedrich, editors, The Conformal\n  Structure of Spacetimes: Geometry, Numerics, Analysis, Lecture Notes in\n  Physics, page 135. Springer, 2002.\n\nBeyDouFra13\nFlorian Beyer, George Doulis, Jörg Frauendiener, and Ben Whale.\nThe spin-2 equation on minkowski background.\nIn Springer Proceedings in Mathematics and Statistics, pages\n  465–468. Springer Berlin Heidelberg, sep 2013.\n\nPae13\nT.-T. Paetz.\nConformally covariant systems of wave equations and their equivalence\n  to Einstein's field equations.\nAnn. Henri Poincaré, 16:2059, 2013.\n\nCarHurVal\nDiego A. Carranza, Adem E. Hursit, and Juan A. Valiente Kroon.\nConformal wave equations for the einstein-tracefree matter system.\nGeneral Relativity and Gravitation, 51(7), jul 2019.\n\nFri81a\nH. Friedrich.\nOn the regular and the asymptotic characteristic initial value\n  problem for Einstein's vacuum field equations.\nProc. R. Soc., 375:169, 1981.\n\nFri81b\nH. Friedrich.\nThe asymptotic characteristic initial value problem for Einstein's\n  vacuum field equations as an initial value problem for a first-order\n  quasilinear symmetric hyperbolic system.\nProc. R. Soc., 378:401, 1981.\n\nCho08\nYvonne Choquet-Bruhat.\nGeneral Relativity and the Einstein Equations.\nOxford University Press, 12 2008.\n\nFri96\nH. Friedrich.\nHyperbolic reductions for Einstein's equations.\nClass. Quantum Gravit., 13:1451–1469, 1996.\n\nFri85\nH. Friedrich.\nOn the hyperbolicity of Einstein's and other gauge field equations.\nComm. Math. Phys., 100:525–543, 1985.\n\nLinSchKid05\nLee Lindblom, Mark A. Scheel, Lawrence E. Kidder, Robert Owen, and Oliver\n  Rinne.\nA new generalized harmonic evolution system.\nClass. Quant. Grav., 23:S447–S462, 2006.\n\nWal84\nRobert M. Wald.\nGeneral relativity.\nThe University of Chicago Press, Chicago, 1984.\n\nRainho_master_thesis\nInês Rainho.\nLinearized general relativity on hyperboloidal slices.\nMaster Thesis.\n  https://blackholes.tecnico.ulisboa.pt/gritting/theses.html#section-5, 2022.\n\nPenRin84\nR. Penrose and W. Rindler.\nSpinors and space-time. Volume 1. Two-spinor calculus and\n  relativistic fields.\nCambridge University Press, 1984.\n\nPenRin86\nR. Penrose and W. Rindler.\nSpinors and space-time. Volume 2. Spinor and twistor methods\n  in space-time geometry.\nCambridge University Press, 1986.\n\nGasVal20\nEdgar Gasperin and Juan Antonio Valiente Valiente Kroon.\nZero rest-mass fields and the Newman-Penrose constants on flat\n  space.\nJ. Math. Phys., 61(12):122503, 2020.\n\nGasVal21a\nE Gasperín and J A Valiente Kroon.\nStaticity and regularity for zero rest-mass fields near spatial\n  infinity on flat spacetime.\nClassical and Quantum Gravity, 39(1):015014, dec 2021.\n\nMinMacVal22\nMarica Minucci, Rodrigo Panosso Macedo, and Juan Antonio Valiente Kroon.\nThe maxwell-scalar field system near spatial infinity, 2022.\n\nValAli22\nMariem Magdy Ali Mohamed and Juan A. Valiente Kroon.\nAsymptotic charges for spin-1 and spin-2 fields at the critical sets\n  of null infinity.\nJournal of Mathematical Physics, 63(5):052502, may 2022.\n\nDuaFenGasHil23\nMiguel Duarte, Justin Feng, Edgar Gasperín, and David Hilditch.\nThe good-bad-ugly system near spatial infinity on flat spacetime.\nClassical and Quantum Gravity, 40(5):055002, feb 2023.\n\nSte91\nJ. Stewart.\nAdvanced general relativity.\nCambridge University Press, 1991.\n\nHil15\nDavid Hilditch.\nDual Foliation Formulations of General Relativity.\narXiv:1509.02071, 2015.\n\nMinVal23\nMarica Minucci and Juan Antonio Valiente Kroon.\nOn the non-linear stability of the cosmological region of the\n  schwarzschild-de sitter spacetime, 2023.\n\nBarutElectrodynamics\nA.O. Barut.\nElectrodynamics and Classical Theory of Fields & Particles.\nDover Books on Physics Series. Dover Publications, 1980.\n\nMag07a\nMichele Maggiore.\nGravitational Waves. Vol. 1: Theory and Experiments.\nOxford University Press, Oxford, 2007.\n\nWheeler1955geons\nJohn Archibald Wheeler.\nGeons.\nPhys. Rev., 97:511–536, Jan 1955.\n\nBrillHartle1964geon\nDieter R. Brill and James B. Hartle.\nMethod of the self-consistent field in general relativity and its\n  application to the gravitational geon.\nPhys. Rev., 135:B271–B278, Jul 1964.\n\nAndersonBrill1997geon\nPaul R. Anderson and Dieter R. Brill.\nGravitational geons revisited.\nPhys. Rev. D, 56:4824–4833, Oct 1997.\n\nSorkin:1981wd\nRafael D. Sorkin, Robert M. Wald, and Zhen Jiu Zhang.\nEntropy of self-gravitating radiation.\nGen. Rel. Grav., 13:1127–1146, 1981.\n\nSchmidt:1999tr\nHeinz-Jurgen Schmidt and Felix Homann.\nPhoton stars.\nGen. Rel. Grav., 32:919–931, 2000.\n\nmitra2010likely\nAbhas Mitra and Norman K Glendenning.\nLikely formation of general relativistic radiation pressure supported\n  stars or ‘eternally collapsing objects’.\nMonthly Notices of the Royal Astronomical Society: Letters,\n  404(1):L50–L54, 2010.\n\nKim:2016jfh\nHyeong-Chan Kim.\nClassifying self-gravitating radiations.\nPhys. Rev. D, 95(4):044021, 2017.\n\nHol22\nJan W. van Holten.\nCurvature dynamics in general relativity, 2022.\n\nBie14\nLydia Bieri and David Garfinkle.\nPerturbative and gauge invariant treatment of gravitational wave\n  memory.\nPhysical Review D, 89(8), apr 2014.\n\nCha83a\nS. Chandrasekhar.\nThe Mathematical Theory of Black Holes.\nOxford University Press, Oxford, England, 1983.\n\nxAct_web\nJosé M. Martín-García.\nxAct: tensor computer algebra.\n<http://www.xact.es/>.\n\n\n\n\n\n\n\n\n\n\n\n\n"}