{"entry_id": "http://arxiv.org/abs/2303.07330v1", "published": "20230313175142", "title": "Optical activity and transport in twisted bilayer graphene: the essence of spatial dispersion effects", "authors": ["S. Ta Ho", "V. Nam Do"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall"], "text": "\n\nPreprint not for distribution CONFIDENTIAL, Version of March 30, 2023\n\n\n\nHanoi University of Civil Engineering (HUCE), 55 Giai Phong road, Hanoi 10000, Vietnam\n\n\n\nnam.dovan@phenikaa-uni.edu.vn    \nDepartment of Basic Science, Phenikaa Institute for Advanced Studies (PIAS), 25^th Floor, A9 Building, Phenikaa University, Hanoi 10000, Vietnam\n\n\nThis study investigates optical activity and quantum transport in twisted bilayer graphene (TBG) systems, demonstrating that the former results from spatial dispersion effects. The transfer matrix method is used to solve the propagation of electromagnetic waves through two graphene layers that act as the coupling surfaces of a dielectric slab. The resulting optical conductivity tensor is decomposed into a local and a drag part, with the drag transverse conductivity σ_xy^(drag) governing the TBG system's optical activity. An effective continuum model is employed to analyze electron state formation and calculate relevant parts of the optical conductivity tensor. Correlation of electron motions leads to incomplete cancellation and a finite σ_xy^(drag) in the chiral TBG lattice. The study also calculates DC conductivity, showing TBG supports quantum conductivity proportional to e^2/h at the intrinsic Fermi energy.\n\nOptical activity and transport in twisted bilayer graphene: the essence of spatial dispersion effects\n    V. Nam Do\n    March 30, 2023\n=====================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nThe study of two-dimensional (2D) materials has received significant attention in recent years due to its potential applications in electronics, optoelectronics, spintronics, and valleytronics.<cit.> The use of multiple-layer materials with van der Waals (vdW) interlayer coupling offers various means to tune the electronic structure, such as altering the interlayer distance, changing the lattice alignment through twisting or sliding the layers, and applying external fields. Physically, these material engineering solutions often result in breaking the spatial and temporal symmetries that govern the dynamics of electrons within the material layers. For instance, a magnetic field breaks the time-reversal symmetry, leading to exciting phenomena such as the quantum Hall effect, magneto-optical effects, and the Kerr and Faraday rotations of the polarization plane of linearly polarized light and circular dichroism.<cit.> These intriguing optical phenomena have been utilized in the development of various devices for various applications.<cit.> However, the use of external fields has limitations for small-scale device design. As a result, it is crucial to search for materials with intrinsic properties and solutions that break the spatial symmetries of an electronic system to meet technological demands.\n\nTwisted-bilayer graphene (TBG) is a 2D van der Waals (2D vdW) material that has garnered significant attention from the research community due to its interesting electronic properties.<cit.> The TBG system is formed by stacking two graphene layers on top of each other with a rotation, or twist, angle between the two hexagonal lattices. The TBG system has been shown to be optically active, meaning that it has the ability to rotate the polarization plane of linearly polarized light by reflection and transmission and to absorb left- and right-handed light differently.<cit.> This, combined with the ability to mechanically tune the twist angle,<cit.> makes TBG a potential candidate for advanced optical applications. The optical activity of a dielectric medium is typically attributed to the anisotropy of its atomic lattice,<cit.> or to the magneto-electric effect.<cit.> External electric, magnetic, and mechanical forces can also induce anisotropy in a medium.<cit.> It has been shown that strained monolayer graphene is optically active due to the presence of the off-diagonal element σ_xy(ω) of the optical conductivity tensor.<cit.> The AA- and AB-stacked configurations of the TBG system are isotropic and characterized by the point groups D_6h and D_3d, respectively.<cit.> The breaking of the lattice symmetry from the D_6h and D_3d groups to the D_6 and D_3 groups, respectively, has been suggested as the mechanism causing the optical activity in TBG.<cit.> However, even with this symmetry, the TBG system is characterized by a total diagonal optical conductivity tensor, i.e., with zero off-diagonal components σ_xy(ω)=0. So, the mechanism supporting the optical activity of TBG remains to be further explored.\n\nIn this paper, we analyze the optical activity of twisted bilayer graphene by treating simultaneously two essential aspects of the field-matter interaction problem, namely the propagation of the electromagnetic waves through a material layer and the response of a material layer to the action of an external field. We show that the optical activity of the TBG system is a result of spatial dispersion effects. Our theory is based on the following analysis. Working with 2D van der Waals systems, the physical quantities that describe them, such as the dielectric tensor and the conductivity tensor, are often considered as if they were ideal 2D systems, i.e., with zero thickness, even though the interlayer spacing is taken into account in the description of interlayer coupling.<cit.> However, in reality, even for graphene with only one layer of carbon atoms, an effective thickness can be defined based on the width of the quantum well potential caused by the carbon atoms.<cit.> As a result, 2D vdW systems cannot be considered ideal 2D systems but rather quasi-2D (Q2D) systems. This means that when describing the interaction between an electromagnetic field and a Q2D vdW material system at a macroscopic level, special considerations must be made. Typically, field equations are determined by averaging a set of microscopic field equations over infinitesimal volume elements.<cit.> However, this averaging procedure is only valid when the wavelength of the fields is much smaller than the dimensionalities of the physical system. For Q2D materials, averaging cannot be performed along the Oz direction perpendicular to the Oxy plane of the atomic lattice. As a result, we need to use a hybrid basis of reciprocal-real spaces to represent physical quantities and field equations. For example, the equation\n\n    J_α(z,𝐪_∥,ω) = ∫ dz^'σ_αβ(z,z^',𝐪_∥,ω)E_β(z^',𝐪_∥,ω)\n\ndescribes the relationship between the component J_α(z,𝐪_∥,ω) of an electrical current density induced in the material by an electric field E_β(z,𝐪_∥,ω), where α, β = x,y are the indices of the components of vector fields, 𝐪_∥ is the wave vector in the material plane, ω is the frequency, and σ_αβ(z,z^',𝐪_∥,ω) is a component of the electrical conductivity tensor of the material layer. In the optical limit, where 𝐪_∥a≪ 1 and a is the lattice constant, we can approximate all quantities at 𝐪_∥=0, i.e., effectively ignoring the spatial effects in the material plane but not along the thickness.<cit.> This description highlights the importance of taking into account the spatial dispersion along the Oz direction, which is typically the transmission direction of electromagnetic fields used to study the material's properties.\n\nTheoretical studies of optical activity in TBG have been discussed in several references, including Kim_2016, Morell_2017, Stauber-2018. These studies have revealed the role of the spacing a between two graphene layers and explained optical activity as a magneto-electric effect. In this approach, a magnetization 𝐦_∥ and a polarization 𝐩_∥ emerge in the atomic plane due to the difference in current densities in the two graphene layers. To establish a relationship between these two quantities with electric and magnetic fields, a symmetry analysis and some assumptions were made,<cit.> such as the linear change of the fields in the space between the two graphene layers and the zero-frequency limit,<cit.> or the dephasing of the current operators in the two graphene layers.<cit.> The magnetization and polarization affect the direction and magnitude of the electric and magnetic field vectors within the material layer. However, the problem is that the transverse component σ_xy^(drag) of the conductivity tensor, which plays a role in creating the effect of one layer on the other when an electromagnetic field is transmitted through the system, is treated as the total Hall conductivity of the system in this wave propagation problem. This may be misleading as the system does not support a finite Hall conductivity due to time-reversal symmetry. Therefore, it is essential to consider in detail the electromagnetic wave propagation through the system, where it is understood that the electromagnetic wave must pass through one layer before reaching the second layer, and the coupling between the two layers must play a crucial role. In the next section, we will use Eq. (<ref>) without considering symmetry analysis and the mentioned assumptions to obtain the most important theoretical results in Ref. (Stauber-2018), see Eq. (2) therein, and clarify the role of σ_xy^(drag) in the electromagnetic wave propagation through the TBG system.\n\nOur study encompasses both macroscopic and microscopic perspectives. At the macroscopic level, we use the transfer matrix method to analyze the light propagation through a 2D van der Waals system composed of multiple material layers, each treated as a boundary between two vacuum layers of finite width.<cit.> The material system's conductivity tensor is decomposed into local and drag terms, with the local term defining the local relationship between current density and electric field in each layer, and the drag term defining the non-local relationship between current density in one layer and the electric field in other layers. Technically, the finite thickness of the material system makes the assumption of the spatial homogeneity along the thickness invalid. It therefore requires evaluating expressions that relate physical quantities through integrals over z and z'. This results in increased computational complexity and the need for a microscopic description of the material surfaces, such as the potential caused by atoms. To simplify the analysis, we assume that each layer of atoms has zero thickness. It allow us to express relevant quantities as sums of delta functions:\n\n    J_α(z,ω) = ∑_ℓ J_α^(ℓ)δ(z-z_ℓ),\n\nwhere z_ℓ is the position of the ℓth material layer, and J_α^(ℓ) is the current density on that layer.\n\nAt the microscopic level, we use the Kubo formula to calculate each term of the conductivity tensor required for the macroscopic level of description. We apply an effective model to determine the low-energy states of electrons in the TBG material lattice, and show that the electron eigen-states can be expressed as a hybridization of single-layer states in the two graphene layers. If the atomic lattice has mirror symmetry (the AA-stacked configuration) or glide symmetry (the AB-stacked configuration) in the lattice plane, the drag transverse conductivity will be vanished due to the cancelling contribution of the electron states. However, generic twisted bilayer graphene lattices have a chiral structure and do not possess these symmetries, leading to a non-zero drag transverse conductivity that determines the optical activity of the system. In addition to determining the components of the optical conductivity tensor, the reflection, transmission, absorption coefficients, and the circular dichroism spectrum, we also calculate the DC conductivity of the TBG system. We find that the hybridized states support a quantum value of 2σ_0^DC, where σ_0^DC = 4e^2/π h, at the intrinsic Fermi energy. This holds true even for the TBG configuration with a magic twist angle, which has a high density of states there due to the presence of a flat band.\n\nThe structure of this paper is divided into three sections. After the “Introduction\" section, the next section (Sec. <ref>) provides a solution to the problem of wave transmission through the twisted bilayer graphene (TBG) system in Sec. <ref>. The solution is based on the transfer matrix method, which illustrates the contribution of the conductivity tensor components to the transfer matrix elements such as the reflection and transmission coefficients and the absorption coefficient. In Sec. <ref>, the local and drag components of the optical conductivity tensor are calculated through the use of the Kubo formula, while the DC conductivity of the TBG system is calculated using the Kubo-Greenwood formula. In Sec. <ref>, an effective model for the electrons in the TBG lattices is presented. In Sec. <ref>, numerical results for the electronic band structure of various TBG configurations, the analysis of the optical conductivity tensor elements, and the spectra of circular dichroism as a function of photon frequency are presented. The conclusion is presented in the final section, Sec. <ref>.\n\n\n\n\n\n§ THEORY AND CALCULATION METHODS\n\n\n\n §.§ Optical chiral responses\n\nIn this section, we investigate the optical response of TBG systems by formulating a theory for the propagation of electromagnetic waves through a generic TBG sheet. Unlike typical dielectric slabs with two separate surfaces, the electric current densities in the two graphene layers of the TBG sheet are interdependent. The current density in one graphene layer is affected by both the electric field within that layer and the electric field in the other layer. This relationship is described by Eq. (<ref>), which we use to solve the problem at hand.\n\nWe set up the system, following Ref. Szechenyi_2016, with two graphene layers separating the entire space into three regions, each characterized by parameters (ϵ_i,μ_i), where i=1,2,3 labels the mediums. Our goal is to determine the transfer matrix of the system and to develop expressions for the transmission and reflection matrices of the bilayer graphene system. As the inhomogeneity of the space only occurs in the z direction perpendicular to the TBG surface, the Maxwell equations support a plane wave solution of the form:\n\n    F_i(x,y,z) = [F_i^+e^ik_izz + F_i^-e^-ik_izz]e^ik_ixxe^ik_iyy,\n\nwhere F represents E (the electric field), D (the electric induction), H (the magnetic field), and B (the magnetic induction). The vector coefficients F_i^± depend on the wave vector k_i in general. The conditions for the continuity of the vector fields at the interface between two mediums are given by:\n\n\n    n×[E_2(1)-E_1(1)] = 0,\n       n×[H_2(1)-H_1(1)] = J(1),\n\n\nfor the first graphene layer surface, and\n\n\n    n×[E_3(2)-E_2(2)] = 0,\n       n×[H_3(2)-H_2(2)] = J(2).\n\n\nfor the second graphene layer surface. In Eqs. (<ref>) and (<ref>), the distribution of current densities on each graphene layer is linearly related to the electric field by the conductivity tensor given via Eq. (<ref>). To the completeness of the setup, we rewrite this equation in the explicit form:\n\n\n    J(1)    = σ^(1)E_1(1)+σ^(drag)E_2(2),\n    J(2)    = σ^(drag)†E_1(1)+σ^(2)E_2(2)\n       =σ^(drag)†E_2(1)+σ^(2)E_3(2).\n\n\n\nThe continuity conditions of the fields at interfaces allow us to determine the relationship between the vector fields (F_i^+,F_i^-) in two different media at their interface. In particular, the magnetic field H_i is related to the electric field E_i through the Maxwell equation curl(E) = -∂_tB, where B=μH. Utilizing the plane wave solution (<ref>), we obtain the expression for H_i^±:\n\n    H_i^± = ±√(ϵ_i/μ_i)k_i×E_i^±/|k_i|,\n\nwhere ϵ_i and μ_i represent the absolute permittivity and absolute permeability of medium i, respectively. This equation makes use of the dispersion relation ω = c|k_i|/n_i, where c is the speed of light in vacuum and n_i is the refractive index of medium i. It is worth noting that √(ϵ_i/μ_i) can be expressed through n_i as √(ϵ_i/μ_i)≈ n_iσ_0/2α, where σ_0=e^2/h is the unit of quantum conductivity and α = e^2/(4πϵ_0ħ c) is the fine-structure constant. In this study, the problem is solved for light transmission along the normal direction to the TBG layer, so k_i = k_in. The transfer matrix 𝐌31 (of size 4× 4) is then derived, relating the components of the electric fields in the first and third mediums as follows:\n\n    ([ E_3^+(2);  E3^-(2) ])\n       = 𝐌31([ E_1^+(1); E_1^-(1) ]).\n\nHere, 𝐌_31=𝐌_32𝐌^f_2𝐌_21, where:\n\n\n\n    𝐌_32   = ([                  1                  1; -√(ϵ_3/μ_3)1-σ^(2)  √(ϵ_3/μ_3)1-σ^(2) ])^-1([                               1                               1; -√(ϵ_2/μ_2)1+σ^(drag)†e^-ik_2zd   √(ϵ_2/μ_2)1+σ^(drag)†e^ik_2zd ]), \n    𝐌_21   = ([                             1                             1; -√(ϵ_2/μ_2)1-σ^(drag)e^ik_2zd √(ϵ_2/μ_2)1-σ^(drag)e^-ik_2zd ])^-1([                  1                  1; -√(ϵ_1/μ_1)1+σ^(1)  √(ϵ_1/μ_1)1+σ^(1) ]), \n    𝐌_2^f    =([  e^ik_2zd1          0;          0 e^-ik_2zd1 ]),\n\n\n\nwith 1 the 2× 2 identity matrix.\n\nLet 𝐫 and 𝐭 be the 2× 2 matrices that relate the components of the electric field vector of the incident light to those of the reflected and transmitted light, i.e., E_1^-(1) = 𝐫·E_1^+ and E_3^+=𝐭·E_1^+. These matrices are referred to as the reflection and transmission matrices, respectively. From Eq. (<ref>), we can deduce the following:\n\n\n    𝐫   = -[𝐌_31^22]^-1𝐌_31^21, \n    𝐭   = 𝐌_31^11-𝐌_31^12[𝐌_31^22]^-1𝐌_31^21=[𝐌_31^-1]^11.\n\n\nFrom these matrices, the reflectance (R) and transmittance (T) are determined as the ratio of energy fluxes, specifically:\n\n\n    R    = |(𝐫·E_1^+)^†·(𝐫·E_1^+)/E_1^+†·E_1^+|, \n    \n    T    = |n_3/n_1(𝐭·E_1^+)^†·(𝐭·E_1^+)/E_1^+†·E_1^+|.\n\n\nOn the base of the conservation of energy flux, the absorptance is then determined by A = 1-(R+T). The values of R, T, and A are dependent not only on the energy, but also on the polarization states of light. It is important to note that the left- and right-handed polarization states of light are characterized by electric field vectors, E_L,R^+ ∝ (1,± i)^T/√(2) (The supersript T here denotes the transpose operation). To measure the dependence of light absorption on these polarization states, we calculate the spectrum of circular dichroism (CD), defined as:\n\n    CD = A_L-A_R/A_L+A_R.\n\nIn the following section, we present the method for calculating the conductivity tensors σ^(ℓ) and σ^(drag), and we will use the results obtained to calculate the transmittance, reflectance, absorbance and circular dichroism via Eqs. (<ref>), (<ref>) and (<ref>).\n\n\n\n\n\n §.§ AC and DC conductivities\n\nThe optical properties of bilayer graphene systems are notable, as evidenced by previous research.<cit.> When taking into account the layer thickness, the effects of spatial dispersion become evident. To describe these effects, we decompose the current response to an external electric field caused by an incident monochromatic light beam perpendicular to the material plane. To start, we rewrite Equation (<ref>) in the real space representation as follows:\n\n\n    J_α(x,z, ω)    = ∫ dz^'σ_αβ(x,z;x,z^',ω)E_β(x,z^',ω),\n\nwhere 𝐱 = (x,y) represents the position vector in the material plane with x and y as its coordinates. On the assumption of spatial homogeneity in the material plane, we can write σ_αβ(x,z;x,z^', ω) = σ_αβ(z,z^',ω), and:\n\n    σ_αβ(z,z^',ω)  =   ∑_ℓ=1^2σ_αβ(z,z^',ω)δ(z^'-z_ℓ).\n\nEq. (<ref>) therefore becomes:\n\n    J_α(x,z,ω) = ∑_ℓ=1^2σ_αβ(z,z_ℓ,ω)E_β(x,z_ℓ,ω).\n\nMore specifically, we resolve the current density induced in each graphene layer as follows:\n\n    J_α^(ℓ)(x,ω) = σ_αβ^(ℓ)(ω)E_β^(ℓ)(x,ω)+σ_αβ^(drag)(ω)E_β^(ℓ^')(x,ω),\n\nwhere the involved quantities are defined by: J_α^(ℓ)(x,ω) = J_α(x,z_ℓ,ω); E_β^(ℓ)(x,ω) = E_β(x,z_ℓ,ω) and σ_αβ^(ℓ)(ω) = σ_αβ(z_ℓ,z_ℓ,ω), and  σ_αβ^(drag)(ω) = σ_αβ(z_ℓ,z_ℓ^',ω) where ℓ≠ℓ^'. Eqs. (<ref>) can be cast in the matrix form:\n\n    ([ J^(1); J^(2) ])_ω = ([     σ^(1)  σ^(drag); σ^(drag)†     σ^(2) ])_ω([ E^(1); E^(2) ])_ω,\n\nwhere σ^(ℓ)(ω) = σ^(ℓ)(ω)τ_0 is called the local part, and  σ^(drag)(ω) = σ^(drag)(ω)τ_0-iσ_xy^(drag)(ω)τ_y = σ^drag(ω)-σ_xy^dragẑ× is called the drag part. Here τ_0 is the 2× 2 identity matrix and τ_2 is the conventional second Pauli matrix. The compact form (<ref>) is identical to results reported in Refs. Stauber-2018,Ochoa_2020. Importantly, it guarantees the time-reversal symmetry, the rotation symmetry and the layer interchange symmetry. \n\nThe conductivities σ^(ℓ)(ω), σ^(drag)(ω) and σ^(drag)_xy(ω) can be determined from the Kubo formula. There are a number of versions of the Kubo formula for the electrical conductivity suitable for implementing it in different situations. However, the most important ingredient we must specify is the velocity operators v̂_α. In general, these operators are determined from the position operator x̂_α and the Hamiltonian Ĥ via the Heisenberg equation:\n\n    v̂_α = 1/iħ[x̂_α,Ĥ] → v_α(k)= 1/ħ∂/∂ k_αH(k).\n\nAccording to the linear response theory, we see that the conductivity has the paramagnetic part only. Using the eigen-vectors of single-particle Hamiltonian (without the presence of external vector potential A(x,t)) as the representation basis, Ĥ|n⟩ = E_n|n⟩, the elements of the optical conductivity tensor are given by this formula: <cit.>\n\n    σ_αβ^(c)(ω)    = i  e^2/S1/ω+iη∑_m,n(f_m-f_n)O^(c)mn_αβ/E_m-E_n+ħ(ω+iη),\n\nwhere S is the area of material sample; c = {ℓ,drag}; f_n = f(E-μ,k_BT) is the occupation weight of the energy level E_n determined by the Fermi-Dirac function f with μ,k_BT the chemical potential and thermal energy; η is a positive infinitesimal number, and O_αβ;mn^(c) denotes the product of velocity matrix elements:\n\n\n    O_αβ^(ℓ)mn   = ⟨ m|v̂_α^(ℓ)|n⟩⟨ n|v̂_β^(ℓ)|m⟩,\n    \n        O_αβ^(drag)mn   = ⟨ m|v̂_α^(1)|n⟩⟨ n|v̂_β^(2)|m⟩.\n\n\n\nTo the DC conductivity, it might be optimistic to think that the DC conductivity can be simply obtained from the expression of the optical conductivity in the limit of zero frequency. However, it is not, at least in the numerical calculation. This is because for some finite frequency ω, there is always a finite length scale governing the behavior of electron. This length scale is L_ω = 2π v_F/ω. Meanwhile, there is no such length scale for the DC transport. Furthermore, the static transport has the diffusion nature due to the similarity of the Schrödinger equation and the diffusion equation. The DC conductivity can be obtained from the linear response theory. The vector potential is chosen in the form A(t) = (-Et,0,0), where E is the intensity of a static electric field. The DC conductivity is calculated using the Kubo-Greenwood formula:<cit.>\n\n    σ_αα(μ,kT) = -∫_-∞^+∞dE ∂ f(E-μ,kT)/∂ Eσ_αα(E),\n\nwhere\n\n    σ_αα(E) = 2π e^2ħ/S∑_m,n|⟨ m|v̂_α|n⟩|^2 δ(E-E_n)δ(E-E_m).\n\nThis quantity is seen as the DC conductivity at zero temperature. When performing the above formula, we use the Gaussian function to approximate the δ-Dirac function:\n\n    δ(E-E_n) ≈1/η√(π)exp(-(E-E_n)^2/η^2),\n\nwhere η > 0 is a tiny number that is appropriately chosen to smear the energy levels for the numerical calculation.\n\n\n\n §.§ Effective continuum model\n\nEffective continuum models for the low-energy states of electrons in TBG systems have been developed since 2007 by Lopes et al. <cit.> However, the model proposed by Bistritzer and MacDonald in 2011 is better known and widely used. In this paper, we present our solution to the Bistritzer-MacDonald model. <cit.> We implement this model for TBG lattices in which the first layer is clockwise rotated by a half-twist angle, θ_1 = -θ/2, and the second layer is counterclockwise rotated by θ_2 = +θ/2. The unrotated layers are defined by unit vectors a_1 = a·e_x and a_2 = acosπ/3·e_x + asinπ/3·e_y, where a is the lattice constant of graphene, and e_x and e_y are the unit vectors defining the x and y directions, respectively. The two associated vectors defining the reciprocal lattice are thus a_1^⋆ = (4π/a)(cosπ/6·e_x+sinπ/6·e_y) and a_2^⋆ = (4π/a)·e_y. Under the twisting, these vectors defining the atomic lattice of the two graphene layers as well as their reciprocal lattice are determined by applying the rotation matrix R_z(θ_ℓ), specifically a_i^(ℓ) = R_z(θ_ℓ)·a_i, and a_i^⋆(ℓ) = R_z(θ_ℓ)·a_i^⋆. The first Brillouin zone BZ^(ℓ) of each graphene layer is defined by a set of six corner points K_i^(ℓ). For instance, the point K_1^(ℓ) is determined by the point K_-^(ℓ) with K_ξ^(ℓ) = -ξ(2a_1^⋆(ℓ)+a_2^⋆(ℓ))/3, where ξ = ± 1.\n\nFor commensurate twisting, the twist angle θ is determined by two integer numbers m and n via the formula:\n\n    θ = arctan(|n^2-m^2|sin(π/3)/(n^2+m^2)cos(π/3)+2mn).\n\nWhen the absolute value of the difference between m and n is equal to 1, two unit vectors A_i^⋆ = a_i^⋆(1)-a_i^⋆(2) define the moiré reciprocal lattice. The mini-Brillouin zone comprises six K^M_i points. K_1^M = (-A_1^⋆+A_2^⋆)/3, and K^M_6 = (A_1^⋆+2A_2^⋆)/3 define two of these points. The remaining points can be obtained by shifting these points using the reciprocal unit vectors.\n\nWe begin by representing the Hamiltonian H for electrons using the layer-resolution vector basis set {|ℓ⟩,|,ℓ = 1,2}. Using the identity 1=∑_ℓ=1^2|ℓ⟩⟨ℓ|, we can express H as follows:\n\n    H = ∑_ℓ,ℓ^'=1^2|ℓ⟩ H_ℓ,ℓ^'⟨ℓ^'|,\n\nwhere H_ℓ,ℓ^' = ⟨ℓ|H|ℓ^'⟩. Next, we can further specify H_ℓ,ℓ^' by using the lattice-resolution vector basis set |k,m⟩ = |k+G_m⟩ ,|,k∈ BZ, m∈ℤ. We can then use the identity 1=∑k∈ BZ∑_m|k,m⟩⟨k,m| to obtain:\n\n    H\n       = ∑_k∈ BZ∑_ℓ,m∑_ℓ^',n|ℓ,k,m⟩ H_ℓ,m;ℓ^',n(k)⟨ℓ^',k,n|,\n\nwhere |ℓ,k,m⟩ = |ℓ⟩|k,m⟩ and we use the relation ⟨ℓ,k,m|H|ℓ^',k^',n⟩ = H_ℓ,m;ℓ^',n(k)δ_k,k^'.\nIn the case of twisted bilayer graphene (TBG) configurations with tiny twist angles, the low energy states of electrons are distinguished by a quantum index ξ = ±1, which corresponds to the two nonequivalent Dirac valleys K_ξ^(1,2) of the graphene monolayers. As the twist angle becomes smaller, the positions of the two points K_ξ^(1) and K_ξ^(2) become closer to each other. The Bistritzer-MacDonald model is represented by a Hamiltonian in real-space representation as follows:<cit.>\n\n    Ĥ^ξ =\n    [ H_1^ξ(p̂)   T^ξ(r̂);  T^ξ†(r̂) H_2^ξ(p̂) ].\n \nHere, H_1^ξ(p̂) and H_2^ξ(p̂) are the blocks for the Hamiltonians of the two monolayers, and T^ξ(r̂) is the interlayer coupling block, which are determined via the momentum and position operators, p̂ and r̂, respectively. For the range of energy around the intrinsic Fermi level the two Hamiltonian blocks H_1^ξ(p̂) and H_2^ξ(p̂)  are well approximated by the 2D Dirac Hamiltonian:\n\n    H_ℓ^ξ(p̂) = - v_F(ξσ_x,σ_y)·[R^z(-θ_ℓ)·(p̂-ħK_ξ^ℓ)],\n\nwhere σ_x,σ_y are two conventional Pauli matrices, R^z(-θ_ℓ) is a matrix that rotates the relevant vectors around the Oz axis to maintain the canonical form of the Dirac Hamiltonian, K_ξ^ℓ is the corner point of type (valley) ξ in the first Brillouin zone of layer ℓ, and v_F is the Fermi velocity. The minus sign in the equation is due to the negative value of the hopping parameter V_ppπ = -2.7 eV. The block term for interlayer coupling is expressed as follows:<cit.>\n\n\n    T^ξ(r̂) =   ([   u u^'; u^'   u ])+([       u u^'ω^-ξ;  u^'ω^ξ       u ])e^iξδk_2·r̂\n       +([       u  u^'ω^ξ; u^'ω^-ξ       u ])e^iξδk_3·r̂,\n\n\nThe values of δk_2 and δk_3 are defined as A_1^⋆ and A_1^⋆ + A_2^⋆, respectively, where A_1^⋆ and A_2^⋆ are reciprocal lattice vectors and ω = exp(i2π/3). To account for the effects of lattice reconstruction, the parameters u and u^', which are set to be 0.0797 eV and 0.0975 eV, respectively, are chosen based on the description in reference Koshino_2018.\n\nThe velocity operator corresponding to the Hamiltonian in Eq. (<ref>) can be expressed as follows:\n\n    v̂_α = -v_F(ξσ_x,σ_y)· R^z_α(-θ_ℓ),\n\nHere, R^z_α(-θ_ℓ) denotes the first or second column of the rotation matrix R^z(-θ_ℓ) depending on whether α=x or α=y. It is noteworthy that, because of the relativistic nature of H^ξ_ℓ(p̂) in Eq. (<ref>), the current operator ĵ_α only comprises a drift current component, ĵ_α = ev̂_α, with no diffusion or diamagnetic terms.\n\nThe spectrum of the Hamiltonian Ĥ is obtained by solving the secular equation given by:\n\n    ([ H_1^ξ(p̂)   T^ξ(r̂);  T^ξ†(r̂) H_2^ξ(p̂) ])|ψ_ξ,k⟩ = E|ψ_ξ,k⟩,\n\nwhere the electron states in the twisted bilayer graphene (TBG) lattice are modeled as Bloch state vectors |ψ_ξ,k⟩. Because of the approximate periodicity of the moire lattice in TBG the state vectors |ψ_ξ,𝐤⟩ can be expanded in terms of the plane-wave vectors |k+G_m⟩ which are the eigenvectors of the momentum operator p̂, i.e., p̂|k+G_m⟩ = (k+G_m)|k+G_m⟩ and  ⟨r|k+G_m⟩ = e^i(k+G_m)·r. Specifically, we have:\n\n    |ψ_ξ,k⟩ = ∑_m([ C_1,ξ,k(G_m); C_2,ξ,k(G_m) ])|k+G_m⟩,\n\nwhere C_1,ξ,k(G_m) and C_2,ξ,k(G_m) are 2D vectors of combination coefficients that need to be found. {G_n |  n = 1,2,3, , N_G} is a set of N_G vectors of the moire reciprocal lattice. Substituting the expression (<ref>) into Eq. (<ref>) then left-multiplying both sides with ⟨k+G_n| we obtain a set of linear equations in the form:\n\n\n    ∑_m[([ H_1^ξ(k+G_n)        T_1^ξ;       T_1^ξ† H_2^ξ(k+G_n) ])δ_G_n,G_m+.\n       +.∑_j=2^3([     0 T_j^ξ;     0     0 ])δ_G_n,G_m+δk_j+∑_j=2^3([      0      0; T_j^ξ†      0 ])δ_G_n,G_m-δk_j]([ C_1,ξ,k(G_m); C_2,ξ,k(G_m) ]) = E([ C_1,ξ,k(G_n); C_2,ξ,k(G_n) ]),\n\n\nwherein we denote:\n\n\n    ⟨k+G_n|H_ℓ^ξ|k+G_m⟩   = H_ℓ^ξ(k+G_n)δ_G_n,G_m,\n    ⟨k+G_n|T^ξ(r̂)|k+G_m⟩   = ∑_j=1^3T_j^ξδ_G_n,G_m+δk_j,\n    ⟨k+G_n|T^ξ†(r̂)|k+G_m⟩   = ∑_j=1^3T_j^ξ†δ_G_n,G_m-δk_j,\n\n\nTo obtain a numerical solution, we define a 4N_G× 4N_G Hermitian matrix H_k^ξ in block form for each value of ξ and k∈MBZ:\n\n\n    [H_k^ξ]_n,n = ([ H_1^ξ(k+G_n)        T_1^ξ;       T_1^ξ† H_2^ξ(k+G_n) ]),\n       [H_k^ξ]_n,m_j = ([     0 T_j^ξ;     0     0 ]), ifG_m_j = G_n-δk_j,\n       [H_k^ξ]_n,m_j^' = ([      0      0; T_j^ξ†      0 ]), ifG_m_j^' = G_n+δk_j.\n\n\nThe eigenvalues E_n^ξ(k) and corresponding eigenvectors, obtained by diagonalizing the matrix H_k^ξ, approximate the states of low-energy electrons in the TBG lattice. The accuracy of the effective description is numerically dependent on the number of reciprocal lattice vectors {G_n |  n = 1,2,3,, N_G} considered in the calculation. To ensure validity in the low-energy range near the intrinsic Fermi level, where the energy surfaces of the monolayer graphene take the form of cones, we control the value of N_G by using a cutoff energy E_c. Specifically, we count only the G_n vectors such that |G_n|≤ E_c/ħ v_F.\n\n\n\n\n\n\n\n§ RESULTS AND DISCUSSIONS\n\n\n\n §.§ Electronic band structure of TBGs\n\nWe used numerical methods to solve Eq. (<ref>). Specifically, for each value of ξ=± 1, we constructed a Hermitian matrix H_k^ξ of size 4N_G× 4N_G and diagonalized it for each value of k in the mini-Brillouin zone of the TBG system. The sets of eigenvalues E_m(k) and eigenvectors {𝐂^m_ξ(k)=[C^m_1,ξ,k(G_1),C^m_2,ξ,k(G_1),,C^m_1,ξ,k(G_N_G),C^m_2,ξ,k(G_N_G)]^T} were calculated. The results for three TBG configurations with twist angles of θ = 1.05^∘, 1.89^∘ and 3.89^∘ are shown in Fig. <ref>. The blue curves represent the results obtained when the electronic interlayer coupling is artificially turned off. Both sets of data are plotted on the same figure for comparison, to highlight the impact of the interlayer coupling. The presence of multiple dispersion curves in the figure results from the folding of the energy band structure of two graphene layers due to the enlargement of the unit cell of the TBG lattice and the corresponding shrinkage of the Brillouin zone into the mini-Brillouin zone. However, the electronic band structure of the TBG system is not simply formed in this manner. At the points where the bands of monolayer graphene cross, the interlayer coupling leads to the hybridization of Bloch states and the lifting of energy degeneracy to form new bands. Our results agree with other available data in the literature <cit.>. However, in this study, we wish to emphasize the formation of new electronic states, which are special to TBG systems and play a crucial role in determining its electronic, optical and transport properties. Fig. <ref> can be considered a visual representation of the evolution of the band structure with respect to the twist angle. We observe that for the configuration with θ = 3.89^∘, the dispersion curves in the low energy range around the intrinsic Fermi energy (E_F = 0) have a similar form to the blue curves, although they are not identical. This implies that the states created in the bilayer system share similarities with those in monolayer graphene. For smaller twist angles, particularly θ = 1.05^∘, a band with a very narrow bandwidth forms around the Fermi energy, separated from the lower and upper bands by a narrow gap. These dispersion curves are completely different from the blue curves, as seen in Fig. <ref>(e). We conclude that the electronic interlayer coupling creates special states in TBG lattices with small twist angles. Although the TBG systems are two-dimensional, it can be challenging to analyze their geometrical features of energy surfaces in wave-vector space. However, the density of states (DOS) generally exhibits key features, such as van Hove singularity behavior, as shown in the right panels of Figs. <ref> (a, b, c). The blue curves in these figures were obtained numerically without considering the effects of electronic interlayer coupling, which is equivalent to the DOS of two independent graphene layers. The red curves show significant peaks due to van Hove singularities, indicating the presence of extremal and saddle points of the energy surfaces.\n\nIt's worth noting that the energy bands with index ξ =+1 (resulting from the hybridization of graphene Bloch states in the K_1 valley of the first layer and K_2 valley of the second layer) differ from those with index ξ = -1 (resulting from the hybridization of Bloch states in the K_1^' valley and K_2^'). This difference is evident along the ΓM direction as shown in Figs. <ref> (d, e, f). However, it does not appear in the DOS picture. We computed the DOS for both ξ = +1 and ξ = -1 separately and obtained the same results. This implies that the energy surfaces with ξ = +1 are simply rotations of the corresponding ones with ξ = -1 by an angle of π/3.\n\n\n\n\n\n §.§ DC conductivity\n\nThe calculation of the electronic structures of TBG configurations with twist angles greater than 2 degrees shows the presence of two energy bands near the Fermi energy (E_F = 0), which have dispersion curves similar to those of monolayer graphene. However, the Fermi velocity of the linear dispersion law in TBG (v_F^TBG) is smaller than that of monolayer graphene (v_F^MLG). As the twist angle decreases, these two bands become closer and eventually form an isolated band with a narrow bandwidth. This “flat band\" near the Fermi energy is expected to have limited impact on the transport properties of TBG sheets because of its small Fermi velocity. In other words, electrons occupying these bands are expected to be spatially confined in the atomic lattice. Although these bands are not completely dispersionless, the study of their transport properties is still of great interest. To this end, within the framework of the non-interacting electron approximation, the DC conductivity was calculated using the Kubo-Greenwood formula as given by Eqs. (<ref>) and (<ref>). The results of the calculation for the longitudinal components (σ_xx^DC and σ_yy^DC) of three TBG configurations at low temperatures are presented in Fig. <ref>.\n\nThe data indicate that the electrical conductivity of TBG systems is anisotropic, which is reflected in the two different longitudinal elements of the conductivity tensor, σ_xx^DC (represented by solid curves) and σ_yy^DC (represented by dashed curves). The conductivity should reflect the electronic structure with respect to the Fermi energy, and our calculations for the two cases of ξ = ± 1 yielded the same result. This is similar to the picture of the density of states, but the difference between the two longitudinal conductivities highlights the anisotropic nature of the energy surfaces. For the TBG configuration with a twist angle of θ = 3.890^∘, the electronic structure is similar to that of monolayer graphene (except for the value of the Fermi velocity), and the conductivity curves have a characteristic V-shape (or an M-shape when considered over a wider energy range, as shown by the blue curves). For TBG configurations with smaller twist angles, the electronic structure and thus the conductivity picture becomes much more complex. However, our calculations show that the conductivity at the intrinsic Fermi level E_F = 0 is always finite and non-zero. Interestingly, the calculated DC conductivity for TBG configurations with twist angles that are not magic values is about two times the quantum value of the minimal conductivity of monolayer graphene, which is σ^DC_0 = 4e^2/π h. In the case of the TBG configuration with the magic twist angle θ = 1.050^∘, the conductivity curve shows a small hump at the Fermi energy E_F = 0 with σ_αα^DC(0) ≈σ^DC_0. This quantum value of the conductivity of monolayer graphene has been intensively discussed in the past and is rooted in the fact that the valence and conduction bands touch each other at the K points, resulting in always-available free carriers due to fluctuations in the electrostatic profile around the Fermi energy level.<cit.> In our calculation, we approximated the delta-Dirac functions in the Kubo-Greenwood formula with a Gaussian function with a parameter η that defines the finite width of the peak. The value of η was taken to be η < 5 meV to account for both numerical calculation needs and the broadening of energy levels and finite lifetime of the electric charge-carrying quasi-particles. Although the observed DC conductivity value in TBG systems is supported by the characteristic hybridized states in the TBG lattice, \nwe suppose that it has the same underlying physical explanation as in monolayer graphene.\n\n\n\n §.§ AC conductivity and optical Hall drag conductivity\n\nIn Fig. <ref>, we present the results of our calculations for the total optical conductivity of three different twisted bilayer graphene (TBG) configurations. The calculation was performed using the Kubo formula for the conductivity tensor, where the velocity operator v̂_α was determined from the Hamiltonian (<ref>) using Eq. (<ref>). The time reversal symmetry and the Onsager reciprocal relations eliminate the off-diagonal elements σ_xy and σ_yx of the conductivity tensor, which we numerically confirmed behave as noise with an amplitude of 10^-3. We also verified all of the symmetry properties of the conductivity tensor according to Eq. (<ref>), demonstrating the accuracy of our numerical data.\n\nFigure <ref> displays the longitudinal conductivity curves σ_xx(ω) with significant peaks, which are attributed to dominant interband transition processes. This correlation is supported by its relationship to the electronic band structures of the TBG configurations, shown in Fig. <ref>. For instance, in Fig. <ref>(b), at an energy of 0.5681 eV, there is an optical absorption peak that can be assigned to a transition from the highest valence band to the lowest conduction band around the M points in the mini-Brillouin zone. As the twist angle decreases, the electronic structure becomes more complex and the optical conductivity exhibits more optical absorption peaks.\n\nFor TBG configurations with twist angles greater than 2 degrees, there is a distinctive feature in the low-energy range of the conductivity curve: the real part of the conductivity is independent of the photon energy ħω and takes a value of 2σ_0, where σ_0 = π e^2/2h. This behavior is similar to that of monolayer graphene and results from the linear dispersion law of electron states. In the low-energy range, the energy band structure of TBG systems is qualitatively similar to that of monolayer graphene, but with a smaller Fermi velocity, as previously analyzed. The value of σ_xx(ω) is equal to 2σ_0, as found in previous studies.<cit.>\n\nFor the case of the “magic angle\" θ = 1.050^∘, our calculation shows a clear dominant contribution from optical transitions from the quasi-flat bands around the Fermi level to the lowest conduction band around the Γ point, as shown in Fig. <ref>(c) and Figs. <ref>(c) and <ref>(f).\n\nThus far, we would like to emphasize that the use of the total DC conductivity tensor is not relevant when studying the wave transmission problem in TBG. As we have presented in Secs. <ref> and <ref>, the required quantities to be utilized are σ^(ℓ)(ω) and σ^(drag)(ω). In Figs. <ref> and <ref>, we present the calculation results for the elements of the conductivity tensor blocks σ^(ℓ)(ω) and σ^(drag)(ω) as analyzed in Sec. <ref>. Our numerical calculation reveals that σ^(1)(ω) = σ^(2)(ω) = σ_xx^(ℓ)(ω)τ_0, verifying the equivalent role of the two graphene layers in the TBG lattice. Figs. <ref>(a), (b), and (c) display the real (red) and imaginary (blue) parts of σ_xx^(ℓ)(ω) for ℓ=1,2. It is worth noting that decreasing the twist angle increases the magnitude of σ_xx^(ℓ), particularly when the imaginary part becomes dominant and varies in accordance with 1/ħω, as seen in Fig. <ref>(c). Fig. <ref> shows the real and imaginary parts of the off-diagonal element σ^(drag)(ω) of the drag part of the conductivity tensor. For large twist angles in the TBG configuration, there is a notable difference between σ_xx^(ℓ)(ω) and σ_xx^(drag)(ω), see Figs. <ref>(a) and <ref>(a). However, for small twist angles (<2^∘), these curves are quite similar but have opposite signs. As a result, although there is significant variation in the magnitude of σ_xx^(ℓ)(ω) and σ_xx^(drag)(ω), they compensate each other when summed to give the total value σ_xx(ω) = 2[σ_xx^(ℓ)(ω)+σ_xx^(drag)(ω)], as seen in Fig. <ref>. \n\n\n\nFigures <ref>(b), (d), and (f) present the calculated results for the transverse conductivity component σ_xy^(drag)(ω). The behavior of σ_xy^(drag)(ω) is primarily characterized by close-to-zero values across the energy range, with some sharp peaks and dips appearing at energy positions with high optical absorption. This finite value of σ_xy^(drag)(ω) can be attributed to both the correlation between the current densities in the two graphene layers and the chiral structure of the atomic lattices. The former is considered a necessary condition, representing the result of the coupling between the two graphene layers, which leads to the formation of composite states like the superposition of Bloch states between the two layers. This means that when electrons move in one graphene layer along the Ox direction, they induce a motion in the second layer along the transverse Oy direction due to interlayer coupling. The sufficient condition, however, is the contribution of the electronic states in the system to the resulting conductivity. If the system had mirror symmetry, these correlations would cancel each other out completely. However, the TBG lattices lack mirror symmetry, unlike the hexagonal lattice of graphene, which results in a finite, non-zero conductivity of σ_xy^(drag)(ω) ≠ 0. \n\nTo emphasize this point, the hexagonal mini-Brillouin zone of the TBG lattice was divided into three equal parts, as depicted in the inset of Fig. <ref>. This division was based on the assumption of mirror symmetry through the plane M_yz, with domain (1) containing the symmetry, and domains (2) and (3) being its mirror images. Using the Kubo formula, the value of σ_xy^(drag)(ω) was calculated by summing over all k points in each of the three domains. The results, shown in Fig. <ref>, indicate that the results in domains (2) and (3) are similar, opposite in sign, and much larger than the result in domain (1). Upon summing these results, a strong but incomplete cancellation takes place, leading to the final value of σ_xy^(drag)(ω) displayed in Figs. <ref>(b), (d), and (f). For the AA- and AB-stacked configurations with mirror symmetries, the cancellation was found to be complete, resulting in σ_xy^(drag)(ω) = 0. The symmetry analyses in Refs. Morell_2010 and Do_2020 support this theory.\n\n\n\n\n\n\n\n\n\n §.§ Optical characteristics\n\nOn the basis of the theory established in Sec. <ref> and the data of the conductivity tensor already computed, we performed the calculation for the transfer matrix, then the reflection, transmission and absorption spectra of several TBG configurations.  The obtained results for transmittance and CD are presented in Figs. <ref> and <ref>, respectively. Since the reflectance is negligible, it is not shown here. It should be noted that while the optical properties of TBGs have been extensively studied, they are usually analyzed through the behavior of the real and imaginary parts of the diagonal components of the total optical conductivity tensor,<cit.> rather than through the transmittance and reflectance, which are quantities that can be directly measured in experiments.  From the transmission spectra as shown, we see that the transmittance of all TBG configurations can get the value of 98% and the absorptance of 2% in average in a large energy range. The spectral curves clearly exhibit the peaks and dips consistent with the picture of the longitudinal conductivities. The transmission and absorption spectra for the left- and right-handed lights are different to be distinguished. However, the CD spectra is clearly manifested. From Fig. <ref>, we see that for the TBG configuration with θ = 3.890^∘,  the CD curve exhibits essential features of experimental data reported by Kim et. al.,<cit.> for instance, with the peaks and dips of large width, except several sharp peaks at the energy position of the absorption peaks. In order to verify the role of the drag transverse conductivity σ_xy^(drag), we did not include it into the calculation. As expected, it results in the zero CD for the total energy range, but mostly does not change the transmission spectrum. We therefore conclude that this drag transverse conductivity plays the decisive role in governing the chiral optical behaviors of the TBG systems. Last but not least, it is important to note that the CD spectrum shown in Fig. <ref> is extracted from the theory presented in Sec. <ref>, which may differ from the formula used in Refs. Morell_2017,Stauber_2018, where CD is simply proportional to the real part of σ_xy.\n\n\n\n\n§ CONCLUSION\n\nThe field of engineering two-dimensional quantum materials for electronic and optoelectronic applications has been the subject of extensive research. In this work, we demonstrate that the optical activity observed in the TBG system results from the spatial dispersion effects of a typical vdW heterostructure of two graphene layers lacking mirror and glide symmetries. Our analysis addresses two fundamental aspects of the field-matter interaction problem: the propagation of electromagnetic waves through a material layer and the material layer's response to an external field, both treated simultaneously using the macroscopic and microscopic descriptions, respectively.\n\nTechnically, we utilize an effective continuum model to demonstrate how electron states in each graphene layer can hybridize, forming electron states in the bilayer system that allow for the correlation of transverse motions between the two layers. In terms of electromagnetic wave propagation, we clarify how the coupling between the two layers can transform the magnitude and direction of the fields within the material layer. We provide a detailed solution to the electromagnetic wave propagation problem through a TBG sheet by considering each graphene layer as a conducting interface between two dielectric media. The two interfaces are not independent and conduct mutually influenced current densities. Our solution to the wave propagation problem clarifies how the roles of the conductivity components characterized by local and nonlocal spatial effects manifest themselves in the optical behavior of the material system.\n\nOn the basis of explicitly considering the spatial dispersion effects, our analysis naturally composes the conductivity tensor into the local part and the drag part without relying on symmetry analysis or assumptions about the phase shift between current operators in the two layers. We calculate all elements of these parts using the Kubo formula, and formulate and calculate the transfer matrix numerically. We demonstrate that the transverse drag transverse conductivity σ_xy^(drag) plays a critical role in defining the chiral optical response of the TBG system. This conductivity arises from the chiral structure of the atomic lattice, which leads to hybridized states that lack mirror symmetry and support the correlation of transverse motions between the two graphene layers. We use the results of our calculations of the components of the optical conductivity tensor to calculate the transmission and circular dichroism spectra. We show that the overall transparency of twisted bilayer graphene (TBG) samples, on average, is generally 98%, but it has the potential to absorb light up to 2%. Significantly, we establish that the drag transverse conductivity is a decisive factor in determining the circular dichroism, thereby affirming that the optical activity of the TBG system is a manifestation of spatial effects.\n\nFurthermore, we found that the DC conductivity of the TBG system exhibits a quantum conductivity value of ∝ e^2/h at the intrinsic Fermi energy, which is determined by the hybridized states in the bilayer system. This quantum value is obtained from a single-particle approximation. However, a rigorous discussion of the intrinsic transport properties of TBG configurations with magic twist angles should be based on a strong correlation picture of low-energy excited states as Dirac fermions. In summary, our study emphasizes the importance of considering the finite thickness of twisted bilayer graphene when analyzing its optical response and transport properties, owing to the significance of spatial dispersion effects. This theoretical approach can also be extended to other van der Waals material systems with multiple layers.\n\n\n\n§ ACKNOWLEDGEMENTS\n\nOne of the authors, S.T.H., acknowledges the financial support of Hanoi University of Civil Engineering (HUCE) for his work under grant number 28-2021/KHXD-TD.\n\n\n\napsrev4-1\n\n\n"}