{"entry_id": "http://arxiv.org/abs/2303.06769v1", "published": "20230312222730", "title": "Exploring $2d$ localization with a step dependent coin", "authors": ["Kallol Sen"], "primary_category": "quant-ph", "categories": ["quant-ph", "cond-mat.stat-mech", "hep-th", "math-ph", "math.MP"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ndecorations.markings\ndecorations.pathmorphing\n\n\n\n\n\n\n\n\n\n\n\n\nequationsection\n\n\n\n\n\n\n\n\n\n\n    αβ̱χ̧δ̣ϵεϕγηıικ̨łλμνπψρ̊στþθωξζΔΦΓΩΘ∂q̃f̃z̅⟨⟩f_∞↑↓𝒜ℬ𝒞𝒟ℰℱ𝒢ℋℐ𝒥𝒦ℒℳ𝒩𝒪𝒫ℛ𝒮𝒯𝒲𝒵PnxyDKPMLh̅𝕀ℝℓ̃ tr #1\n        #1empty\n        \n         Exploring 2d localization with a step dependent coin\n        \n         Kallol Senemail: kallolmax@gmail.com\n         ICTP South American Institute for Fundamental Research,\n          IFT-UNESP (1^∘ andar), Rua Dr. Bento Teobaldo Ferraz 271, Bloco 2 - Barra Funda, \n         01140-070 São Paulo, SP Brazil\n        \n         Abstract \n        We generalize the coin operator of <cit.>, to include a step dependent feature which induces localization in 2d. This is evident from the probability distributions which can  be further used to categorize the localized walks. Localization is also evident from the entropic measures. We compute and compare three distinct measures (a) Shannon Entropy in the position and coin space, (b) Entanglement entropy between position and spin space, and (c) Quantum Relative Entropy which is a POVM of density operators of the step dependent and step independent coins. Shannon Entropy and Entanglement Entropy are periodic and bounded functions of the time steps. The zeros of Shannon and Entanglement entropies signify a complete localization of the wave-function. The Quantum Relative Entropy and Quantum Information Variance exhibit a similar periodic feature with a zero minima where the step dependent and step independent walks coincide. Finally, we compute the numerical localization length (inverse of the Lyapunov Exponent) for the step dependent coin as a function of energy and compare with an approximate perturbative computation, where we put the step dependent coin as a perturbation in the background of a step independent coin. In both the instances, we find that the localization length peaks at approximately the same positions in the momentum space.    \n        \n        \n        § INTRODUCTION\n        \n        Localization in physics <cit.>, describes a phenomenon where a disorder or decoherence in the system can give rise to a localized wave function within the system. Localization has been in study for its interesting and important implications regarding  quantum transport <cit.>, critical exponents <cit.> and even in supersymmetric theories <cit.>. The transition from weak to strong localization, also called Anderson transition, a field of active study in disordered spin chains <cit.>. \n        In this work, we study the decoherence effects of a step dependent coin on random walks following the 1d approach of <cit.>. Several aspects of localization in random walk has been considered in <cit.> for random environments, for entropy guided walks <cit.> and in the effects of recurrence <cit.> and so on. In this work we consider the simple generalization of the approach in <cit.> and extend the analysis of <cit.>, to show that a step dependent coin is capable of inducing entanglement in the random walk in 2d. The step dependent coin is given by,\n        𝐂_t(θ_1,θ_2,ϕ)=([   e^-itϕcos tθ_1                0                0 -ie^-itϕsin tθ_1;                0    e^itϕcos tθ_2  -ie^itϕsin tθ_2                0;                0  -ie^itϕsin tθ_2    e^itϕcos tθ_2                0; -ie^-itϕsin tθ_1                0                0   e^-itϕcos tθ_1 ]) .\n        \n        that is capable of inducing localization in the walk. The corresponding step independent coin is given by 𝐂_SIC=𝐂_t=1. At each step, we also compare the walks between the  step dependent coin (SDC) and its corresponding step independent coin (SIC) counterpart. We summarize our main findings below.\n        \n          *  Since a non-zero probability distribution for our specific form of coin exists only along the diagonals, we compare SDC and SIC walks with θ_1=θ_2=θ for a symmetric localization. For illustration, we consider θ=π/(4j), π/(4j-1) for j=1,2,3,… and ϕ=0 and an initial wave-function at the origin. For θ=π/(4j), as j increases, the SDC distribution localizes at the origin while the SIC walk spreads out. For θ=π/(4j-1), the SDC and SIC walks are diffused (and along the diagonals) for j=1. However, as j increases, the distribution for the SDC walk becomes more pronounced around the origin. Consequently, for θ=π/(4j), the number of points with non-zero probability for SDC walk follows a periodic profile with an upper bound, while the SIC walk grows linearly with time steps. For θ=π/(4j-1), the number of points with non-zero probability starts off as an increasing function of time steps for j=1. However as j increases, the number of points with non-zero probability decrease in agreement with the probability distribution. We also demonstrate that starting with a quantum walk for θ=π/3(1+j/10), we can transition to various regimes ranging from compact quantum walk to a semi-classical compact walk to a fully localized domain with various 1≤ j≤ 10. \n        \n          *  Localization is also evident from dynamical observables point of view. The relation between localization and entanglement has been studied extensively either in random walk perspective of entanglement induced localization <cit.> or their interconnections in non-relativistic QFTs <cit.>. For our purposes, we explore the implications of entropic measures as an evidence for localization. We will use three different entropic variables (a) Shannon Entropy  <cit.>, (b) Entanglement Entropy <cit.> and (c) Quantum Relative Entropy <cit.>. The measures (a) and (b) are state dependent while (c) is a POVM measurement. We observe that in comparison to the SIC where the Shannon entropy grows with time steps and the entanglement is an oscillatory function around a non-zero mean value, the SDC Shannon entropy and entanglement are oscillates with a lower bound at zero. In particular the zeros of the Shannon and entanglement entropy denote a separable state hinting at a completely localized state. For (c) we directly compare the density operators for the SDC and SIC walks using Quantum Relative Entropy (QRE) and Quantum Information Variance (QIV). These measures follow a periodic pattern between maxima and minima. The maxima signifies that the walks are most distinct from each other and vice-versa interpretation for the minima. At certain time steps, the variance is zero and coincides with the zeroes of QRE as well. The maxima denotes maximal localization for SDC, while the minima signifies maximum diffusion. \n        \n          *  We characterize the SDC walk by its  Localization Length (L_loc), which implies the extent of the region within which the walk is bounded. The localization length is inverse of the  Lyapunov Exponent (ł_t) which characterizes the strength of disorder (chaos) in the system. We follow the transfer matrix approach of <cit.>. For large disorder, the L_loc is sufficiently small indicating strong localization. For θ=π/(4j), the walk is completely localized indicating L_loc=0. This is also evident from the computation of ł_t=∞ from the analytical computation using transfer matrix. For θ=π/(4j-1), the localization length decreases as j increases, consistent with probability and entropic distribution observations. \n        \n        The remainder of the paper is organized as follows. In section <ref>, we discuss the probability distributions for the SDC and SIC walk. Along with this we also demonstrate the relative restrictions on the number of points with a non-zero distribution and explore the categories of restricted walk by tuning the coin. In  section <ref>, we explore localization from the entropy measures point of view. In particular we discuss the evidence of localization from Shannon Entropy (section <ref>), Entanglement (section <ref>) and finally compare the SDC and SIC walks through the POVM based measurements using Quantum Relative Entropy (section <ref>). In section <ref>, we explore the localization phenomenon analytically using the transfer matrix approach. We demonstrate that the L_loc as a function of the energy peaks at only certain values, demonstrating that the system is maximally localized. Further, we incorporate the SDC walk in the background of an SIC walk, as a perturbation to demonstrate that the walk approximately localizes at around the same points as dictated by the numerical simulation meaning that even in presence of a small disorder, the walk exhibits significant localization. We end the work with conclusions and future questions to be addressed in section <ref>.\n        \n        \n        \n        § PROBABILITY DENSITY\n        \n        \n        The Step Dependent Coin is given by,\n        𝐂_t(θ_1,θ_2,ϕ)=([   e^-itϕcos tθ_1                0                0 -ie^-itϕsin tθ_1;                0    e^itϕcos tθ_2  -ie^itϕsin tθ_2                0;                0  -ie^itϕsin tθ_2    e^itϕcos tθ_2                0; -ie^-itϕsin tθ_1                0                0   e^-itϕcos tθ_1 ]) .\n        \n        The Step Independent Coin operator is given by 𝐂_SIC=𝐂_t=1. Teh shift operator is the same, given by,\n        𝐒=∑_x⃗(|0,x⃗+_00,x⃗|+|1,x⃗+_11,x⃗|+|2,x⃗-_12,x⃗|+|3,x⃗-_03,x⃗|) ,\n        \n        where _0=(1,1) and _1=(1,-1) and the state |i,x⃗=|i⊗|x⃗ where |i∈ℋ_𝐂 and |x⃗=(m,n)∈ℋ_𝐏. The evolution operator 𝐔=𝐒·(𝐂_t⊗𝐈_𝐏) acts on the initial state |Ψ_w(0) to evolve a wave function |Ψ_w(t) after t steps of evolution, given by,\n        \n        |Ψ_w(t)=U^t|Ψ_w(0) .\n        \n        The final state has a general form,\n        \n        |Ψ_w(t)=∑_i,x⃗A^(i)_x⃗(t)|i,x⃗ .\n        \n        where |i,x⃗=|i⊗ |x⃗∈ℋ_𝐂⊗ℋ_𝐏. The probability distribution, as a function of the 2d grid is given by,\n        \n        P(t,x⃗)=∑_i=0^3 |A^(i)_x⃗(t)|^2 .\n        \n        \n        We demonstrate the probability distributions for the SDC and SIC walks for θ_1=θ_2=θ and ϕ=0. In figure <ref>, we demonstrate the SDC and SIC walks for θπ/3 ,π/4 , π/7 ,π/8 , π/11 and π/12. For even values of the denominator, we find that the SDC walk is localized at and around the origin while the SIC walk spreads out. For odd values of the denominator, the SDC and SIC walks start out with significant spreads. However as θ decreases, the SDC walk migrates to the origin. The same feature is exhibited in figure <ref>, where we compute the number of positions with non-zero probability distribution and compare for the SDC and SIC walks. We again find that for even values of the denominator, the SDC walk is an oscillatory and bounded function of the time steps while the SIC walk linearly grows with time. For odd values of the denominator in θ, the SDC and SIC walks start off with a linear growth with time. As θ decreases, the plot for the SDC walk comes down indicating that the number of positions with non-zero probability distribution decreases signifying that the wave-function becomes localized. \n        In figure <ref>, we consider tuning the coin parameters to categorize the quantum walks. To begin with, we start with θ_1=θ_2=π/3 and ϕ=0, where the walk is quantum in nature and start tuning θ=π/3(1+j/10) for 1≤ j≤ 10. For j=1,3,5,7,9, the transition is to a  fully localized walk. For j=2,8, it is a  compact semi-classical/quantum walk. For j=4,6, the walk is a  compact classical walk.  This illustrates that the quantum regime can be tuned to a classical and semi-classical compact or a fully localized walk with the step dependent coin. Finally we explore the return probability for the wave function to the origin in figure <ref>,  given by P_0,0(t) as a function of the time step t. For SIC walk, the wave function spreads out and after t steps, the probability of the wave function at the origin decreases exponentially. For the SDC walk however, we see that for θ=π/(4j-1) the return probability follows the SIC distribution with certain peaks. However as j increases, the peaks become significant implying that the walk accumulates at the origin. For θ=π/(4j), we see periodic peaks P_0,0(t)=1 in the return probability meaning that the walk is completely localized at the origin. At the steps, where the P_0,0(t)=0, implies that the walk is localized at some other point as exhibited in figure <ref>. \n        \n        \n        § ENTROPIC MEASURES\n        \n        In addition to the kinematical features exhibited by the step dependent coin in the random walk, we would examine the dynamical features of the walk as well from entropic measurements. For our purpose, we would choose to demonstrate the localization of the walk through the measures of (a) Shannon Entropy, (b) Entanglement and (c) Quantum Relative Entropy between the density matrix operators. Please note that the measurements will also depend on the initial state. For our purpose, we choose a tensor product initial state so that the walk becomes entangled solely due to the coin operator. Our initial state is,\n        \n        |Ψ_w(0)=1/√(2)([ 1; i; 0; 0 ])⊗|0,0 .\n        \n        Note that this choice of initial state is by no means unique and any tensor product state can be chosen. However, the basic aspects of localization will remain unaltered and we choose to demonstrate those features through a simple choice.\n        \n        \n        \n         §.§ Shannon Entropy\n        \n        We will compute and compare the Shannon Entropy for the position space and coin space for SDC and SIC walks <cit.>. These measures are defined as,\n        \n        S_P=-∑_m,n=-t^t P_m,n(t)log P_m,n(t) ,  S_C=-∑_i=0^3 P_i(t)log P_i(t) . \n        \n        where,\n        \n        P_m,n(t)=∑_i=0^3 |A^(i)_m,n(t)|^2 ,  P_i(t)=∑_m,n=-t^t |A^(i)_m,n(t)|^2 .\n        \n        Also note that as the wave function localizes in a particular point (m,n), P_m,n(t)=1 and zero elsewhere. Consequently, S_P=0. For the S_C, the Shannon entropy however oscillates between and maxima and minima (even for a completely localized state). We compare the Shannon entropy for a range of θ values of the coin parameters in figure <ref>. Completely localized states are obtained for θ_1=θ_2=θ=π/(4j) in sharp contrast to its SIC counterpart with same θ. This is exhibited by a vanishing Shannon Entropy due to a separable state. For θ_1=θ_2=θ=π/(4j-1) however, the walk is not completely localized. For j=1, the SDC and SIC walk has maximal overlap. However as j increases, the walk becomes more localized and S_P decreases in contrast to its SIC counterpart. In these cases, however the S_C increases over the SIC counterpart hinting at the growing localization of the walk. \n        \n        \n         §.§ Entanglement\n        \n        The second entropic measure is the entanglement entropy between the position and coin (spin) degrees of freedom. The reduced density matrix after tracing over the position coordinates is given by,\n        (t)=_pos(̊t)=∑_m,n=-t^t([        |A^(0)_m,n|^2  A^(0)_m,nA^(1)⋆_m,n  A^(0)_m,nA^(2)⋆_m,n  A^(0)_m,nA^(3)⋆_m,n; |A^(1)_m,nA^(0)⋆_m,n        |A^(1)_m,n|^2  A^(1)_m,nA^(2)⋆_m,n  A^(1)_m,nA^(3)⋆_m,n;  A^(2)_m,nA^(0)⋆_m,n  A^(2)_m,nA^(1)⋆_m,n        |A^(2)_m,n|^2  A^(2)_m,nA^(3)⋆_m,n;  A^(3)_m,nA^(0)⋆_m,n  A^(3)_m,nA^(1)⋆_m,n  A^(3)_m,nA^(2)⋆_m,n        |A^(3)_m,n|^2 ]) .\n        \n        The entanglement is given by,\n        \n        E(t)=-(t)log(t) .\n        \n        If the final state is a completely localized state as happens for θ_1=θ_2=θ=π/(4j), then,\n        \n        |Ψ_w(T)=ψ_c⊗ |p,q ,\n        \n        is a separable state. The corresponding reduced density matrix is a pure state and the entanglement is zero. This is demonstrated in figure <ref>, where the entanglement drops to zero for certain time steps for θ_1=θ_2=π/(4j). Figure <ref>, demonstrates the same for θ=π/(4j-1). The walks are not completely localized but the walks become more localized with increasing j which is exhibited in the certain dips in the entanglement. \n        \n        \n        \n        \n        \n        \n         §.§ Relative Entropy\n        \n        Finally the third entropic measure is a POVM between the density matrix operators for the SDC and SIC walks. We consider Quantum Relative Entropy (QRE) and Quantum Information Variance (QIV) between the density matrices for SDC and SIC walks. The QRE is defined by <cit.>,\n        \n        D(|̊|)=(̊log-̊log) ,\n        \n        and the QIV is given by,\n        \n        V(|̊|)=(̊log-̊log)^2-D(|̊|)^2 .\n        \n        The operators $̊ andare two positive valued reduced density matrices$̊ and  for the step dependent and step independent coin operator. For the walks, we have chosen, θ_1=θ_2=θ and ϕ=0 as previously. We further group the plots in terms of θ=π/(4j-1) and θ=π/(4j) for j=1,2,3 as demonstrated in figure <ref>. Note that both D(|̊|) and V(|̊|) increase as j increases (both for odd and even values of the denominator). For odd values of the denominator V(|̊|)≥ D(|̊|) while for even values, D(|̊|)≥ V(|̊|). This observation is also consistent with the probability distributions for the chosen values of θ. For odd values of the denominator,  both the SDC and SIC walks have significant overlaps and the difference between the SDC and SIC becomes more pronounced as j increases. The exact opposite happens for even values of the denominator (as j increases). High values of relative entropy and low values of QIV signifies a pronounced difference between the SDC and SIC walks.  For V(|̊|)=0, \n        (̊log-̊log)^2=((̊log-̊log))^2 .\n        \n        We start by writing,\n        (̊t)=ł_i|Φ_iΦ_i| ,   (t)=ł'_i|Φ'_iΦ'_i| ,\n        \n        in terms of the eigen basis. Thus, using c_ik=Φ_i|Φ'_k,\n        (̊log-̊log)^2=ł_i(logł_i)^2|Φ_iΦ_i|+ł_i(logł'_j)^2 |Φ'_jΦ'_j|-2ł_ilogł_ilogł'_kc_ik|Φ_iΦ'_k| .\n        \n        Then,\n        (̊log-̊log)^2=ł_i(logł_i)^2+ł_i(logł'_j)^2|c_ij|^2-2ł_i logł_ilogł'_j|c_ij|^2 .\n        \n        while,\n        \n        D(|̊|)=ł_ilogł_i-ł_ilogł'_j|c_ij|^2 .\n        \n        The zeroes of D(|̊|) imply that =̊ or precisely that the SDC and SIC walks coincide. V(|̊|)=0 with D(|̊|)≠0, implies that the final states for both SDC and SIC walks come arbitrarily close to a maximally entangled state. \n         \n        \n        \n        \n        § TRANSFER MATRIX\n        \n        In this section we formulate the transfer matrix for the localization problem. We will go the reverse way of constructing the Hamiltonian from the transfer matrix. Given a wave function, Ψ_x⃗=(A^(0)_x⃗,A^(1)_x⃗-,A^(2)_x⃗,A^(3)_x⃗-), for x⃗=(m,n), =(1,1) and =̱(1,-1), we can write, \n        ([ A^(0)_x⃗+2;  A^(1)_x⃗+; A^(2)_x⃗+2;  A^(3)_x⃗+ ])=𝐓([ A^(0)_x⃗; A^(1)_x⃗; A^(2)_x⃗; A^(3)_x⃗ ]) .\n        \n        The form of the transfer matrix for our 2d walk is given by,\n        𝐓=([ e^-itϕ+i_1 tθ_1               0               0     -i tan tθ_1;               0 e^i tϕ+i_2 tθ_2      -itan tθ_2               0;               0       itan tθ_2 e^-itϕ-i_2 tθ_2               0;       itan tθ_1               0               0  e^itϕ-i_1 tθ_1 ]) .\n        _1 , _2 are the eigenvalues of the spectrum satisfying the dispersion relation,\n        cos_1=cosθ_1cos(k_1+k_2) , cos_2=cosθ_2cos(k_1-k_2) .\n        \n        We define the Lyapunov exponent by,\n        ł_t=1/t∑_x⃗=1^t log|Ψ_x⃗| ,\n        \n        with an initial condition Ψ_x⃗^(0)=(1,0,0,0). The localization length is defined by the inverse of the Lyapunov exponent,\n        \n        L_loc=1/ł_t .\n        \n        Note that for θ=π/(4j), we note that the localization length is zero which is consistent with the probability distribution demonstrating that the wave function is completely localized at the position of the initial wave function. For θ=π/(4j-1), j=1,2,3, we plot the localization length (L_loc) as a function of the frequency (),\n        \n        \n        Having determined the localization properties of the step dependent coin, we will now use this step dependent coin as a perturbation to an otherwise SIC 2d random walk.  The eigenvalues are,\n        ł=e^± i_1 , e^± i_2 ,\n        \n        where, cos_1=cos(_1)(θ_1) and cos_2=cos(_2)(θ_2). \n        We can combine with a similarity transformation to bring the transfer matrix to a diagonal form. This similarity transform is,\n        \n        S=([  tanθ_1       0       0    -ξ_1;       0  tanθ_2    -ξ_2       0;       0     ξ_2 -tanθ_2;     ξ_1       0       0 -tanθ_1 ]) .\n        \n        where ξ_1=sin(_1)θ_1-sin_1, ξ_2=sin(_2)θ_2-sin_2. The diagonalized matrix is given by,\n        \n        S^-1T_SICS=([  e^i_1      0      0      0;      0  e^i_2      0      0;      0      0 e^-i_2      0;      0      0      0 e^-i_1 ]) .\n        \n        In the same basis, the SDC which will be imposed as a disorder perturbation, will yield,\n        \n        S^-1T_SDCS=([    (t)      0      0   (̱t);      0    (t)   (̣t)      0;      0 (̣t)^⋆  (t)^⋆      0; (̱t)^⋆      0      0  (t)^⋆ ]) .\n        \n        where,\n        \n            (t)   =ξ _1^2 e^-i ω _1(θ _1 t)+2i ξ _1 tan(θ _1) tan(θ _1 t)-e^i ω _1tan ^2(θ _1) (θ _1 t)/ξ _1^2-tan^2θ_1 ,\n            (̱t)   =i (θ _1 t) (2 ξ _1 tan(θ _1) sin(ω _1)-ξ _1^2 sin(θ _1\n               t)-tan ^2(θ _1) sin(θ _1 t))/ξ _1^2-tan ^2(θ _1)\n            (t)   =ξ _2^2 e^-i ω _2(θ _2 t)+2i ξ _2 tan(θ _2) tan(θ _2 t)-e^i ω _2tan ^2(θ _2) (θ _2 t)/ξ _2^2-tan^2θ_2 ,\n            (̣t)   =i (θ _2 t) (2 ξ _2 tan(θ _2) sin(ω _2)-ξ _2^2 sin(θ _2\n               t)-tan ^2(θ _2) sin(θ _2 t))/ξ _2^2-tan ^2(θ _2) .\n        \n        The stochastic equation for the wave function is then,\n        \n            Ψ_0,x⃗   =(e^i_1+(t))Ψ_0,x⃗-+(̱t) Ψ^⋆_0,x⃗- .\n            Ψ_1,x⃗   =(e^i_2+(t))Ψ_1,x⃗-+(̣t) Ψ^⋆_1,x⃗- .\n        \n        For our specific case, Ψ_x⃗^⋆=-Ψ_x⃗. We will use,\n        Ψ_0,x⃗=r_0(x⃗)exp[iχ_0(x⃗)] ,  Ψ_1,x⃗=r_1(x⃗)exp[iχ_1(x⃗)] .\n        \n        The equations become,\n        \n            r_0(x⃗)/r_0(x⃗-)exp[i(χ_0(x⃗)-χ_0(x⃗-))]   =e^i_1+(t)-(̱t) .\n            r_1(x⃗)/r_1(x⃗-)exp[i(χ_1(x⃗)-χ_1(x⃗-))]   =e^i_2+(t)-(̣t)\n        \n        To the leading order in perturbation theory,\n        r(x⃗)/r(x⃗-)=1+·ln r/x⃗ .  χ(x⃗)-χ(x⃗-)=1-·χ/x⃗ .\n        \n            ·ln r_0/x⃗   =cos_1-1+ℜ𝔢(t) ,\n            ·ln r_1/x⃗   =cos_2-1+ℜ𝔢(t) ,\n        \n        since ℜ𝔢(,̱)̣=0. The Lyapunov coefficient is given by,\n        1/N∑_n=1^N log |Ψ_n|=log|√(r_0^2+r_1^2)| .\n        \n        For ℜ𝔢(t)=cos_1(θ_1 t) and ℜ𝔢(t)=cos_2(θ_2 t), the solution to (<ref>) is given by,\n        \n        r_0^2=exp[2X(cos(k⃗·)-1+ℜ𝔢(t))], r_1^2=exp[2Y(cos(k⃗·)-1+ℜ𝔢(t))] .\n        \n        Hence,\n        \n            r_0^2+r_1^2=   exp[2X(cos(k·)-1)](1+ℜ𝔢(t)+1/2ℜ𝔢(t)^2+…)\n               +exp[2Y(cos(k·)̱-1)](1+ℜ𝔢(t)+1/2ℜ𝔢(t)^2+…) .\n        \n        Roughly, by order of estimates, we can assume without generality that,\n        \n        X(cos(k·)-1)≈ Y(cos(k·)̱-1)≈ u .\n        \n        The oscillating terms ℜ𝔢(t), ℜ𝔢(t), average to zero. Hence,\n        log|√(r_0^2+r_1^2)|=u/2 (ℜ𝔢(t)^2+ℜ𝔢(t)^2) .\n        \n        which gives an approximate analytical formula for the localization length,\n        \n        L_loc=2/(ℜ𝔢(t)^2+ℜ𝔢(t)^2) .\n        \n        upto an overall constant. More precisely, the analytical form of the denominator is given by,\n        (ℜ𝔢(t)^2+ℜ𝔢(t)^2)=lim_N→∞(cos^2_1/N∑_n=1^N ^2(n θ_1)+cos^2_2/N∑_n=1^N ^2(n θ_2)) .\n        \n        \n        § CONCLUSIONS\n        \n        In this note, we examine the localization properties of a step dependent coin (SDC) on a random walk. We explore the consequences of SDC walk point wise below:\n        \n          *  We consider a step dependent coin (SDC) to demonstrate the localization of the wave function in two dimensions. The SDC is based on the same model of coin in <cit.>. The localization is evident in the probability distribution as well as the boundedness of the number of points with non-zero probability. We also show that by tuning the coin parameter, one can transition through various categories of compact walks ranging  from quantum to classical. As a further check, the return probability to the origin (location of initial wave function) is maximized by certain coins, exhibiting a completely localized walk.\n        \n        \n          *  In addition to the kinematical evidence, we can also demonstrate the boundedness of the walk from the entropic point of view. The Shannon entropy and entanglement oscillates between zero and an upper bound. The lower bound of zero indicates a separable state which in turn implies a complete localization in the two dimensional grid. The Quantum Relative Entropy (D) and Quantum Information Variance (V) measures demonstrate the difference between SDC and SIC walks based on the respective density matrices $̊ and. Forθ=π/(4j),D(|̊|)>V(|̊|)and increases monotonically with decreasingθ, while the reverse is true forθ=π/(4j-1). At certain steps,D(|̊|)=0implying that at those steps, the SDC walk coincides with the SIC walk. WhileV(|̊|)=0withD(|̊|)≠0, implies that the operators for SDC and SIC come arbitrarily close to a maximally entangled state. \n        \n          *  In order to characterize the localization phenomenon, we compute the Lyapunov exponent from the transfer matrix method in <cit.>. The transfer matrix suggests an Anderson Hamiltonian with a non-trivial hopping term. Forθ=π/(4j), the localization length is zero which is consistent with a completely localized wave-function. Forθ=π/(4j-1), the localization length peaks at∼±π/2. We compare this with an approximate analytic computation of the localization length (where we put in the SDC as a perturbative on a SIC background) and observe the peaks at the same positions. This is similar to the localization dependency on frequency in <cit.>.\n        \n        However, there are open questions still to be addressed:\n        \n          *  So far we have restricted ourselves to a step dependent coin in 2d. A more illustrative generalization would be a site dependent coin as discussed in <cit.>. A site dependent coin introduces exotic features in the localization features of the Hamiltonian. \n        \n          *  A more general computation will be to use a SU(4) coin. However that would introduce 15 parameters which might be difficult to tackle. One way to generalize the computation will be to use a perturbation in place of the zero elements. At this point, the two component wave functions couple with each other perturbatively. \n        \n          *  An immediate question would be to address the structure of the Anderson Hamiltonian. The form of the transfer matrix suggests a linear combination of two 1d Hamiltonians. However, the forms of the Hamiltonians are different. This Hamiltonian formalism can be used to to analyze phase transitions in various systems including non-Hermitian models of <cit.>. In addition, we would like to compare how and under what circumstances, our step compares with the disordered spin chain systems of <cit.> or entangled photons in <cit.>. \n        \n          *  It would be nice to get a quantitative handle on various generalized entanglement measures that characterize the coin operator through entangling power <cit.> or its n-qubit generalizations considered in <cit.>. \n        \n        \n        § ACKNOWLEDGEMENTS\n        \n        The author thanks Ahmadullah Zahed, Aranya Bhattacharya and Siddhartha E.M. Guzmán for their insightful comments on the work. The author is supported by the São Paulo Funding Agency FAPESP Grants 2021/02304-3 and 2019/24277-8.\n        \n        \n        \n        \n        utphys\n"}