{"entry_id": "http://arxiv.org/abs/2303.06766v1", "published": "20230312220535", "title": "Next-Best-View Selection for Robot Eye-in-Hand Calibration", "authors": ["Jun Yang", "Jason Rebello", "Steven L. Waslander"], "primary_category": "cs.RO", "categories": ["cs.RO"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNext-Best-View Selection for Robot Eye-in-Hand Calibration\n    Jun Yang, Jason Rebello, Steven L. Waslander\nInstitute for Aerospace Studies and Robotics Institute\n\nUniversity of Toronto\n\nToronto, Canada\n\n{jun.yang, jason.rebello, steven.waslander}@robotics.utias.utoronto.ca\n\n    \n========================================================================================================================================================================================================================\n\n\n\n\n\nRobotic eye-in-hand calibration is the task of determining the rigid 6-DoF pose of the camera with respect to the robot end-effector frame. In this paper, we formulate this task as a non-linear optimization problem and introduce an active vision approach to strategically select the robot pose for maximizing calibration accuracy. Specifically, given an initial collection of measurement sets, our system first computes the calibration parameters and estimates the parameter uncertainties. We then predict the next robot pose from which to collect the next measurement that brings about the maximum information gain (uncertainty reduction) in the calibration parameters. We test our approach on a simulated dataset and validate the results on a real 6-axis robot manipulator. The results demonstrate that our approach can achieve accurate calibrations using many fewer viewpoints than other commonly used baseline calibration methods.\n\n\n\n\n\nHand-eye calibration; active vision; next-best-view; non-linear optimization\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nWith the rapid advance in 3D computer vision techniques, perception systems have become an essential component in many industrial applications, such as robotic bin-picking <cit.> and on-machine inspection <cit.>. Historically, for these applications, the sensor is installed in a static position. For example, in robotic bin-picking, the camera is mounted above the bin. However, the camera often fails to acquire a complete representation of the task space from a single viewpoint due to occlusions and limited sensor resolution. To overcome these limitations, we can attach the camera to the end-effector of a robotic manipulator, which is also known as the eye-in-hand system.\n\nThe proper functioning of an eye-in-hand system relies on accurate calibration. The goal is to estimate a rigid 6-DoF pose of the camera with respect to the robot end-effector frame. As introduced in <cit.>, this problem can be solved with a hand-eye calibration formulation 𝐀𝐗=𝐗𝐁, where 𝐀 and 𝐁 represent the relative robotic arm and camera motions between two different time instants, respectively, and 𝐗 is the unknown rigid transformation from the robot end-effector frame to the camera coordinate frame. To use this formulation, we need to convert absolute poses into relative ones and solve the 𝐀𝐗=𝐗𝐁 problem using closed-form approaches <cit.> or optimization-based solutions <cit.>. Alternatively, the eye-in-hand calibration can be solved with the robot-world-hand–eye formulation 𝐀𝐗=𝐘𝐁 <cit.>. In this formulation, 𝐘 represents the transformation from the robot end-effector to the camera frame, and 𝐗 is the transformation from the robot base to the world frame. The transformations 𝐀 and 𝐁 represent the absolute transformation from the robot base to the robot end-effector, as well as the transformation from the camera to the world coordinate. The goal of robot-world-hand–eye calibration is to determine both 𝐗 and 𝐘 from either closed-form solutions <cit.> or optimization-based approaches <cit.>.\n\n\n\nAs studied in <cit.>, optimization-based approaches with 𝐀𝐗=𝐘𝐁 formulation achieve the highest accuracy since they use absolute measurements and are more tolerant to the measurement noise and errors. These approaches generally take the initial estimates from any fast closed-form methods, such as Tsai <cit.> or Zhuang <cit.>, and iteratively minimize the formulated cost function (e.g., 2-D reprojection errors) with non-linear optimizers. Although the optimization-based solution can provide accurate calibration, it requires sufficient measurement sets to ensure high accuracy. As illustrated in Figure <ref>, different robot poses are needed to create measurement sets for the optimization-based methods, and the calibration accuracy heavily relies on the selection of the measurement sets. Manual selection of the robot poses has two major limitations. First, it requires a large volume of the robot motions to collect sufficient measurements for accurate calibration. Second, even if a large volume of measurement sets is collected, it does not guarantee that a good calibration can be estimated. The addition of poor measurements may even degrade the calibration accuracy due to the biased distribution of the robot poses and measurement noise.\n\nTo this end, we propose an active vision method for eye-in-hand calibration. Our method follows the 𝐀𝐗=𝐘𝐁 formulation and uses an information theoretic next-best-view (NBV) policy <cit.>. For each iteration, we determine the next best robot pose from where to collect measurements, such that it brings about the maximum reduction in calibration parameter uncertainty. We evaluate our approach on a simulated dataset and verify it on a real 6-axis robot manipulator. The results demonstrate that our next-best-view approach can achieve high calibration accuracy using significantly fewer viewpoints when compared with heuristic-based baselines, such as random and maximum distance sampling strategies. The contributions are summarized as follows:\n\n    \n  * An information-theoretic formulation for the estimation of the eye-in-hand calibration parameters and prediction of the information gain for a future viewpoint.\n    \n  * An active vision system that exploits the proposed information-theoretic formulation for rapid and accurate eye-in-hand calibration.\n\n\nThe rest of the paper is structured as follows. Section <ref> reviews the relevant literature. Section <ref> formulates our eye-in-hand calibration problem. Section <ref> describes the autonomous active calibration system. Section <ref> presents the evaluation results, and section <ref> concludes the paper.\n\n\n\n\n\n§ RELATED WORK\n\n\n\n\n §.§ Robotic Hand-Eye Calibration\n\nIn robotics, hand-eye calibration is the problem of determining the rigid transformation between a camera and a robot reference frame and includes two different camera setups: eye-in-hand and eye-to-hand. The eye-in-hand calibration is the process of estimating the relative 6D pose of a robot-mounted camera with respect to the robot’s end-effector. In comparison, for eye-to-hand calibration, the camera is mounted statically, and the calibration determines the 6D pose of the camera with respect to the robot’s base. Both camera setups employ the 𝐀𝐗=𝐗𝐁 hand–eye formulation <cit.> or 𝐀𝐗=𝐘𝐁 robot-world-hand–eye formulation <cit.>. For both the 𝐀𝐗=𝐗𝐁 or 𝐀𝐗=𝐘𝐁 formulation, the earliest approaches solved the problem in the closed-form manner by estimating the rotation and translation separately <cit.>, which is also known as the separable closed-form method. Another class of closed-form methods solves the rotation and translation simultaneously <cit.>. To further improve the calibration accuracy for high-precision tasks, such as robot pick-and-assembly, some recent works proposed optimization-based approaches <cit.>. These approaches take the initial estimates from a fast closed-form method <cit.>, and iteratively minimize a cost function to yield better calibration accuracy. While the core problem has been well addressed, the majority of existing works perform the calibration in a passive way, where the robot motions and camera poses are given in advance, which limits the resulting calibration accuracy. Only a few approaches exist <cit.> that can perform hand-eye calibration in an active manner. \n\n\n\n\n §.§ Active Vision and Next-Best-View\n\nActive vision <cit.>, and more specifically\nNext-Best-View (NBV) <cit.> refers to the approach of actively manipulating the camera to gather more informative measurements in a greedy fashion. Active vision technologies have been successfully applied to a wide range of robotic applications, such as localization <cit.>, 3D reconstruction <cit.>, robot grasping <cit.> and calibration <cit.>. Among these works, a typical scheme for NBV is to maximize the Fisher information or minimize the entropy for the robot state parameters <cit.>. Specifically, for a robot state estimation problem, the \"informativeness\" of a viewpoint (i.e., how much parameter uncertainties can be reduced) is quantified by the Fisher information. In <cit.>, the authors leverage the Fisher information to select informative trajectories to improve localization quality and avoid pose tracking loss. From these examples, the closest one to our work is from <cit.>, where the Fisher information is used to select the next best robot mechanism inputs for calibrating a dynamic camera cluster with one static camera <cit.>. In this work, we formulate the active robot eye-in-hand calibration problem with the Fisher information objective and automate the calibration process using a next-best-view strategy. \n\n\n\n\n\n§ EYE-IN-HAND CALIBRATION FORMULATION\n\n\nIn this section, we present our problem formulation for eye-in-hand calibration. We use the robot-world-hand–eye calibration formulation, 𝐀𝐗=𝐘𝐁, and solve the problem using an iterative non-linear optimization-based approach. We define the rigid transformation 𝐓 in the 𝕊𝔼(3) Lie Group:\n\n    𝕊𝔼(3) := {𝐓=[   𝐑   𝐭; 0^T   1 ]  |    𝐑∈𝕊𝕆(3),𝐭∈ℝ^3\n    }\n\nwhere 𝕊𝕆(3) is the special orthogonal group (i.e., 𝐑𝐑^T = 𝐈, 𝖽𝖾𝗍(𝐑)=1). The associated Lie Algebra space to the 𝕊𝔼(3) Lie Group is indicated as 𝔰𝔢(3). The calibration process aims to determine two rigid transformations in 𝕊𝔼(3): the transformation 𝐓_ce from the robot end-effector frame, ℱ_e, to the camera frame, ℱ_c, as well as the transformation 𝐓_bw from the world frame, ℱ_w, to the robot base frame, ℱ_b. Note that the world frame, ℱ_w, is defined by a static calibration board with a known marker size (e.g., a checkerboard). For each robot pose, 𝐓_eb, the camera captures the pixel measurements, 𝐮∈ℝ^2. We define the measurement set, 𝐙_k, from the k^th robot pose as:\n\n    𝐙_k = {𝐮_k , 𝐓_eb,k}\n\nwhere the robot pose, 𝐓_eb,k, represents the transformation from the robot base frame, ℱ_b, to the robot end-effector frame, ℱ_e, which is obtained from the robot's forward kinematics. The pixel measurement, 𝐮_k ∈ℝ^2, is the set of the 2D projections of the 3D marker points, 𝐏_w∈ℝ^3, from the calibration board. \n\nGiven the measurement set, 𝐙_k, estimating the transformations 𝐓_ce and 𝐓_bw can be formulated as a non-linear optimization problem. We name these two unknown transformations as the set of calibration parameters and represent them as:\n\n    Θ = {𝐓_ce  ,  𝐓_bw}\n\nThe optimization is constructed by defining the re-projection error between the measured pixel positions, 𝐮_k, and the projected target locations, 𝐮_k^', through the calibration parameters on the image plane:\n\n    r^j(Θ, 𝐙_k )    = u_k^j - u_k^j'\n       = u_k^j - π(T_cw, kP_w^j)\n       = u_k^j - π(T_ceT_eb, kT_bwP_w^j)\n\nwhere u_k^j is the measurement of the j^th 3D marker point P_w^j from the k^th robot pose, and r^j(Θ, 𝐙_k ) is the residual between them. π represents the perspective projection function for a camera model. The loss function is then defined as:\n\n    L(Θ)    = ∑_k ∑_j=1^| P_w |r^j(Θ, 𝐙_k )^T (Σ_k^j)^-1 r^j(Θ, 𝐙_k )\n\nwhere Σ_k^j is the corresponding measurement covariance matrix. For a calibration process, the calibration target is usually provided with high contrast, and the 2D measurements (e.g., corner detection) of the 3D marker points can be obtained accurately. Therefore, we assume the measurement noise is constant for different marker positions across all the camera viewpoints and change the loss function in Equation (<ref>) to:\n\n    L(Θ)    ≈∑_k ∑_j=1^| P_w |r^j(Θ, 𝐙_k )^T  r^j(Θ, 𝐙_k )\n\n\nTo compute the optimal calibration parameters Θ^*, we perform an unconstrained optimization for Equation (<ref>) and minimize the re-projection errors over all the collected measurement sets, 𝐙_1:K. To ensure a stable solution, we can provide a good initial estimate Θ from any closed-form methods <cit.> for the non-linear optimization. The iterative algorithms, such as Levenberg–Marquardt or Gauss-Newton, can finally be used to optimize the calibration parameters. For example, the update equation with the Gauss-Newton method is:\n\n    ( J_Θ, Z_1:K^T J_Θ, Z_1:K) δΘ = J_Θ, Z_1:K^T   r(Θ, Z_1:K)\n\nwhere r(Θ, Z_1:K) is the residual vector over all the collected measurements Z_1:K. The stacked Jacobian matrix J_Θ, Z_1:K of the measurements is represented as:\n\n    J_Θ, Z_1:K =\n        [ J_Θ, Z_1;        ⋮; J_Θ, Z_K ]\n\n\nEach row-block of Equation (<ref>), J_Θ, Z_k, corresponds to the Jacobian matrix with the k^th measurement set. It composes of two parts:\n\n    J_Θ, Z_k = [F_k   E_k]\n\nwhere Jacobian matrices F_k and E_k are the derivative of the overall cost function with respect to the poses ξ_ce and ξ_bw on the tangent space:\n\n    F_k = -∂u_k^'/∂ξ_ce = -∂u_k^'/∂P_c,k∂P_c,k/∂ξ_ce\n\n\n    E_k = -∂u_k^'/∂ξ_bw = -∂u_k^'/∂P_c,k∂P_c,k/∂P_e,k∂P_e,k/∂P_b,k∂P_b,k/∂ξ_bw\n\nwhere ξ_ce , ξ_bw∈𝔰𝔢(3) are the Lie algebra representations of the transformations 𝐓_ce and 𝐓_bw, respectively. The Hessian, J_Θ, Z_k^T J_Θ, Z_k is constructed by:\n\n    J_Θ, Z_k^T J_Θ, Z_k = [ F_k^T F_k F_k^T E_k; E_k^T F_k E_k^T E_k ]\n\nNote that, for the multiple measurement sets, Z_1:K, the Hessian, J_Θ, Z_1:K^T J_Θ, Z_1:K, is a 12 × 12, square matrix. The operation complexity of its inversion is constant.\n\n\n\n\n\n§ ACTIVE CALIBRATION USING NEXT-BEST-VIEW\n\n\nIn Section <ref>, we formulate the eye-in-hand calibration as a non-linear optimization problem and solve it using the iterative approaches. However, the calibration accuracy relies heavily on the collected measurement sets from the selected robot poses. Even if a large volume of the measurement sets is collected, it does not ensure calibration accuracy due to the biased distribution of the robot poses, redundant measurements, and possible measurement noises. Hence, in this section, we present our active calibration process that can estimate the uncertainty of the calibration parameters and predict the next-best-view for maximizing the information gain (uncertainty reduction). An overview of our proposed active calibration system is illustrated in Figure <ref>.\n\n\n\n\n\n\n §.§ Initialization and Uncertainty Estimation\n\nWe initialize our active calibration with a collection of measurement sets 𝐙_1:K from K viewpoints. To uniquely determine the set of the calibration parameters Θ and provide the initial estimate, at least K=3 sets with non-parallel rotation axes are required <cit.>. We then perform the iterative optimization, described in Section <ref>, to refine the calibration parameters. To assess the calibration quality with collected measurement sets, we assume the set of the calibration parameter is distributed with a uni-modal Gaussian and compute its covariance matrix, Σ_Θ, Z_1:K, with a first-order approximation of the Fisher information matrix (FIM):\n\n    Σ_Θ, Z_1:K   = ( J_Θ, Z_1:K^T  J_Θ, Z_1:K)^-1\n\n\nSuch an inverse of the FIM defines the Cramer-Rao lower bound, which is the smallest covariance that can be achieved by an unbiased estimator. To quantify the calibration parameter uncertainty, we use the differential entropy h_e( Σ_Θ, Z_1:K):\n\n    h_e( Σ_Θ, Z_1:K) = 1/2ln((2π e)^n | Σ_Θ, Z_1:K| )\n\nNote that the uncertainty computation is not limited to the differential entropy and can be superseded by other metrics, such as the trace <cit.> or the sum of the eigenvalues <cit.> of the covariance matrix.\n\n\n\n\n §.§ Next-Best-View Prediction\n\nTo improve the quality of the calibration parameters, we aim to find the next best robot forward kinematics θ^* from a set of candidates, {θ}, that governs the robot pose 𝐓_eb and will be used to maximize the information gain of the calibration parameters. The information gain is defined as the uncertainty (entropy) reduction after including the measurement set from a candidate robot kinematics. For a candidate robot kinematics, θ, after including the measurement set, 𝐙, the stacked Jacobian matrix becomes:\n\n    J_Θ, Z =\n        [ J_Θ, Z_1:K;     J_Θ, Z ]\n\n\n\n\n\nwhere Z = {Z_1:K, Z} represents the set of measurements from the robot forward kinematics θ_1:K and the candidate kinematics θ. Using the FIM approximation, the parameter covariance can be calculated as follows:\n\n    Σ_Θ, Z = ( J_Θ, Z^T   J_Θ, Z)^-1\n\nNote that we compute the Jacobian matrix (Equation (<ref>)) and the predicted parameter covariance (Equation (<ref>)) before actually applying the robot kinematics θ and including the measurement 𝐙. The computation of the Equation (<ref>) is based on the estimated calibration parameters using measurement sets Z_1:K only.\n\n\n\nFor a robot kinematics θ, we define the corresponding information gain I_Θ, Z as the entropy reduction of the parameter covariance:\n\n    I_Θ, Z = h_e(Σ_Θ, Z_1:K) - h_e(Σ_Θ, Z)\n\nTo find the next-best-view, θ^*, we maximize the information gain over the entire candidate set, {θ}:\n\n    θ^* = _θI_Θ, Z\n\n\nOnce the next-best-view, θ^*, is determined, we apply the robot motion. A new measurement set 𝐙^* is collected and the total collection 𝐙_1:K+1 will be updated as:\n\n    𝐙_1:K∪𝐙^*→𝐙_1:K+1\n\nWe finally optimize the calibration parameters Θ^* using the newly updated measurement sets, 𝐙_1:K+1, and predict the next-best-view again. We repeat this process until it reaches user-defined criteria, i.e., after a fixed number of iterations or when the highest information gain of a subsequent robot kinematics falls below a user-defined threshold:\n\n    I_Θ, Z < I_τ\n\nThe architecture of NBV for eye-in-hand calibration is shown in Algorithm <ref>.\n\n\n\n\n\n\n§ EXPERIMENTS\n\n\n\n\n §.§ Datasets\n\nReal-World Dataset. To demonstrate the effectiveness of our proposed approach, we capture a real dataset using an EPSON C4L 6-Axis robot manipulator with an industrial Ensenso N35 camera. As shown in Figure <ref>, we mount the camera on the end-effector of the robot arm and move the robot to capture the monochrome images with varying robot poses. In our experiments, we use a precisely manufactured calibration board with a 4×4 symmetrical circle grid pattern. We calibrated the camera's intrinsic parameters using the calibration toolbox provided by the camera vendor. We program the robot arm to move the camera to different viewpoints. Since the calibration pattern is symmetrical, we make the robot end-effector stay pointed towards the center of the workstation, and the camera in-plane rotation remains unchanged. The examples of the captured calibration images are shown in Figure <ref>-<ref>. With such a workstation setup, we captured a total of seven sets. Each calibration set includes one training set and one validation set. We perform the calibration using the training set only and evaluate the calibration results on the validation set.\n\n\n\nSimulated Dataset. The real dataset can represent the true uncertainties (e.g., measurement noise) for a calibration system in the real world. However, it is not possible to acquire the ground truth information for quantifying the absolute pose errors. The main advantage of using a simulated dataset is the availability of ground truth transformations (e.g., robot end-effector to camera frame, robot base to world frame). In our experiments, we use a public dataset <cit.>. It includes three simulated datasets with a different number of robot poses and synthetic images. The dataset is injected with pseudo-realistic robot pose noise and visual noise for synthetic images.\n\n\n\n\n\n §.§ Baselines and Evaluation Metrics\n\n\nFor robot hand-eye calibration, existing works use heuristic-based policies, such as random selection or linear spacing, to select viewpoints. To demonstrate the effectiveness of our approach, we compare our system against two heuristic-based viewpoint selection strategies. The first baseline, \"Random\", selects random robot poses from the set of candidates. The second baseline, \"Maximum Distance\", moves the robot end-effector to the position of the furthest distance from previous positions in the Euclidean space ℝ^3. Figure <ref> depicts the trajectories generated by our approach and these two baselines. In our experiments, we assume the robot can teleport from one location to the next without the path planning restriction. This will allow us to explore the theoretical upper bounds of our method.\n\nTo evaluate the results on the simulated datasets, we take two metrics from <cit.>. We use absolute translation error (mm), e_𝐚𝐭, and absolute rotation error (deg), e_𝐚𝐑, to quantify the absolute pose errors:\n\n    Δ𝐓_ce =  Ť_ce^-1 𝐓_ce\n\n\n    e_𝐚𝐭 = d(Δ𝐓_ce),     e_𝐚𝐑 = ∠(Δ𝐓_ce)\n\nwhere Ť_ce and 𝐓_ce are the estimated and ground truth transformation (from robot end-effector to camera frame), respectively. The function d( Δ𝐓) extracts the translation part from Δ𝐓 and computes the Euclidean norm. ∠( Δ𝐓) extracts the rotation part from Δ𝐓 and gets the absolute angle value with angle-axis representation with Lie algebra representation in 𝔰𝔬(3). \n\nFor the real dataset, due to the missing ground truth poses, we use three metrics from <cit.> for the evaluation: relative translation error (mm), e_𝐫𝐭, relative rotation error (deg), e_𝐫𝐑, and reprojection error (px), e_𝐑𝐌𝐒𝐄. The relative translation and rotation errors are derived from 𝐀𝐗=𝐘𝐁 formulation:\n\n    Δ𝐓_k = Ť_bw 𝐓_wc,k Ť_ce 𝐓_eb,k\n\n\n    e_𝐫𝐭 =  1/K∑_k=1^K d( Δ𝐓_k ),     e_𝐫𝐑 =  1/K∑_k=1^K ∠( Δ𝐓_k )\n\nwhere Ť_bw and Ť_ce are the estimated calibration parameters. The per-frame camera pose 𝐓_wc,k is obtained by solving the perspective-n-point (PnP) problem. The metric re-projection error, e_𝐑𝐌𝐒𝐄, is the re-projection root mean squared error between the measured pixel positions and the projected locations over the test set:\n\n    e_𝐑𝐌𝐒𝐄 = √(1/K-1∑_k=1^K ‖u_k - π(T_ce^*T_eb, kT_bw^*P_w) ‖_2^2 )\n\nwhere u_k is the pixel measurement of the 3D marker point set P_w from the robot pose T_eb, k.\n\n\n\n\n\n\n\n §.§ Results\n\nFor our system and the baselines, we initialize the calibration parameters with the same set of robot poses (3 sets in our experiments). Table <ref> shows the experimental results on the simulated dataset <cit.>. We can observe that, although the proposed approach is not advantageous to the baselines in terms of the absolute rotation error, it can achieve much higher accuracy for the translation estimation using the same number of the collected measurement sets (28.4% and 37.7% error reduction compared to the \"random\" and \"max-distance\" baselines, respectively).\n\n\n\n\n\nFor the real dataset, we performed the evaluation on the collected validation sets, which were not used in the calibration process. Figure <ref> presents the results for the baselines and our proposed NBV system when using different metrics. It can be seen that, with the first few additional viewpoints, the \"max-distance\" achieves higher accuracy than the \"random\" policy and has a similar performance to our proposed NBV approach. However, the performance using both \"max-distance\" and \"random\" policies becomes less obvious when visiting more viewpoints. Compared to the baselines, our approach is able to achieve the same level of parameter uncertainties and accuracy with much fewer robot poses. Moreover, we measure the Pearson correlation coefficient <cit.> between our predicted information gain and the reduction of the re-projection error. As illustrated in Figure <ref>, the predicted information gain accurately reflects the true error reduction, thus making them well suited to our goal. Table <ref> further demonstrates the advantage of our approach with the same number of additional robot poses. To obtain the results, we use 5 additional measurement sets for each view selection strategy. We can see that, compared to the baselines, our proposed NBV achieves the lowest error for all three metrics.\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\nIn this work, we have presented a viewpoint selection framework for eye-in-hand calibration. We first formulate the calibration problem with the 𝐀𝐗=𝐘𝐁, robot-world-hand–eye representation, and estimate the set of calibration parameters using a non-linear optimization process. Our approach estimates the parameter uncertainty and predicts the information gain of future measurement sets. This allows us to reduce the parameter uncertainty by selecting the robot kinematics with the highest information gain. We evaluate our method on a synthetic dataset and a real robot manipulator. The results demonstrate that our proposed next-best-view approach can achieve high calibration accuracy with much fewer robot poses when compared against baselines that use heuristic-based policies.\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENT\n\nThis work was supported by Epson Canada Ltd.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nieeetr\n\n\n\n\n\n\n"}