{"entry_id": "http://arxiv.org/abs/2303.06765v1", "published": "20230312220245", "title": "Closed-form analytical solution for the transfer matrix based on Pendry-MacKinnon discrete Maxwell's equations", "authors": ["Ovidiu-Zeno Lipan", "Aldo De Sabata"], "primary_category": "physics.optics", "categories": ["physics.optics", "physics.class-ph"], "text": "\n\n\n\n\n\nAPS/123-QED\n\n\n\n\n\n olipan@richmond.edu\n\nDepartment of Physics, Gottwald Center for the Sciences 138 UR Drive, University of Richmond, Richmond, VA 23173, USA\n\n\n\n\n Department of Measurements and Optical Electronics, Politehnica University of Timisoara, 300006 Timisoara, Romania\n\n\n             \n\n\n\n           \n             \n             \n\nPendry and MacKinnon  meaningful discretization of  Maxwell's equations was put forward specifically as part of a finite-element numerical algorithm. By contrast with a numerical approach, in the same spirit evoked by the relationships between the difference and the differential equations, we provide an analytical solution for the transfer matrix elements generated by this discretization of  Maxwell's equations. The method, valid for all modes and any non-magnetic pattern with frequency-dependent permittivities, is exemplified for a bilaminar structure. The results from hundreds of  path-operators simplify to a small number of propagation channels, which transfer the electromagnetic field between input and output. A specific bilaminar device is design-optimized and used to generate  a topological map from permittivities to the number of modes and very high Q-factor resonances.\n\n\n\n\n  PACS Numbers\n78.67.Pt, 42.25.Fx\n\n\n\n\n\n\n\n                             \n\n                              \nClosed-form analytical solution for the transfer matrix based on Pendry-MacKinnon discrete Maxwell's equations\n    Aldo De Sabata\n    March 30, 2023\n==============================================================================================================\n\n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nWhat follows came about as an overlap of a present technological need with a perennial scientific quest. The current need is represented by photonic devices based on thin laminae,  be they in the form of waveguides for augmented reality <cit.>, <cit.> or of frequency-selective surfaces for the 5 and 6G networks <cit.>, of wearable applications <cit.> or of surface wave-mediated sensing applications <cit.>, <cit.>. The perennial quest is to understand the  interplay between discrete and continuous models <cit.>, <cit.>. The focus on this association has varied since the 19th century, <cit.>,  piquing the interest of many in, for example, the theory of solitons <cit.>,  universality in chaos <cit.>, <cit.>, fractals <cit.>.  The manifestation that interests us  is  the relationship between the difference and the differential equations. For example, the discrete version of the equation of Korteweg and de Vries for soliton wave motion,<cit.>, shows a distinct asymmetric  richness  since it contains a series of universal  properties that are not readily visible in the continuum. Particularly, the discrete form of soliton equations proposed by  Hirota <cit.>,<cit.> is connected with quantum integrable systems  <cit.>, <cit.>.\nIt is essential to emphasize that it is not at all trivial to discretize an equation in a way that preserves the prime properties of the original continuous equation. \n \nPendry and MacKinnon obtained a meaningful discretization of  Maxwell's equations <cit.> on a carefully chosen simple cubic lattice <cit.>, by retaining the essential properties of the longitudinal modes present in the continuum. This discretization was put forward specifically  as part of a finite-element numerical algorithm <cit.>.\n  \nBy contrast with a numerical approach, in the same spirit evoked by the relationships between the difference and the differential equations, we asked the question of whether a complete analytical solution can be found to the transfer matrix of the Pendry and MacKinnon discrete Maxwell's equations. \n\nThe transfer matrix, <cit.>, is widely used well beyond the study of the propagation of electromagnetic fields <cit.>, <cit.>. \nIts common appearance is in the form of a 2× 2 matrix, reduced to one propagation mode <cit.>, <cit.>,<cit.>.\nHowever, we are looking here for an  analytical solution for the transfer matrix that is valid for any non-magnetic pattern and that has to encompass all Bloch-Floquet modes, either propagative or evanescent. As a consequence, our procedures differ from those employed in theories where the number of parameters are few and symmetries are many, <cit.>,<cit.>.\n\n\nIn the ensuing sections we derive this  analytical solution and present the techniques we used, noteworthy among them being the definition of path-operators, Fig.<ref>, and the appearance of propagation channels for the transfer of the electromagnetic field between input and output, Fig.<ref>. This analytical solution is valid for filling the lattice's nodes with frequency-dependent non-magnetic isotropic material of any kind.  We present the general solution for two laminae, although the method can be extended to additional laminae. \n\n To be more specific, in Sections <ref> and <ref> we rewrite the Pendry and MacKinnon discrete version of  Maxwell's equations to take shape in a tensor product of two 2-dimensional linear spaces, (<ref>) to (<ref>) and (<ref>) to (<ref>). As a consequence, the electromagnetic states and the propagation operators are decomposed as a tensor product, (<ref>). This course of action proves to be essential in simplifying a large volume of analytic computations. \n Sections <ref> and <ref> are dedicated to the discrete dispersion relation in vacuum and to the on-shell scattering method, <cit.>, from which a function along the z-coordinate is extracted, (<ref>). The Bloch-Floquet periodic boundary conditions along the x and y axes, but not along z, are introduced in Section <ref>. The building up of the transfer matrix from its elements is covered in Section <ref>.\n \n  A key step towards the solution, the path-operators, is defined and discussed in Section <ref>. The summation over the entire set of path-operators greatly simplifies the transfer matrix to reveal that the propagation run along a small number of channels, Section <ref>. \n  \n  To concretize the proposed method, which hinges on path-operators and channels, we completely solve for the transfer matrix elements of a bilaminar structure. The presentation of the solution starts in Section <ref> from a bird's eye view, and dives into the details in Sections <ref> and <ref>.  The classification of the channels by the  input-output polarization and the direction of propagation is summarized in Table <ref>, Figs.<ref> and <ref> and Appendix B. \n  \n  In Section <ref> we segue into the continuum limit, and then apply it to the specific bilaminar pattern from Fig.<ref>.\n   The limit is in the x and y directions and it reveals that channels can be classified by a set of universal functions. It also calls for computing 2-dimensional Fourier integrals of products of these functions, each function's argument being defined by the permittivities of a lamina, Section <ref> and <ref>. For polygonal tessellated laminae, Section <ref>, these integrals can be computed in a closed form, Section <ref> and <ref>. The formulas contain a gauge freedom and are arranged as a sum of terms over the vertices of the tessellated polygons. These terms hold all the information about the non-magnetic materials and the geometric orientations of the structure, as can be seen in (<ref>).\n  \nLastly, from the formulas for the transfer matrix, an optimization procedure is devised in Section <ref> to create a dielectric bilaminar structure, Fig.<ref>, on which Bloch-Floquet modes propagate along the laminae with large amplitudes, being evanescent in the z-direction <cit.>. These resonances display a series of relevant properties.  One is the robustness with respect to the change of the dielectric constants, Section <ref>. The resonant frequencies are located close to the zeroes of the diagonal elements of the transfer matrix. As the dielectric permittivities pass through different values, the zeroes are created or disappear  allowing us to define a topological map that counts the number of resonant modes, Fig.<ref>.\n  \nOn a separate note, in Section <ref> and <ref> we find that the same bilaminar structure, but with specifically selected  dielectric constants, resonates with a very large  Q-factor, Fig.<ref>. Finally, in Section <ref>, the complete analytical formula offers the possibility to obtain the Fano-Lorentz spectral line shape for a resonant mode, <cit.>,<cit.>, through a zero-pole approximation (<ref>), in the complex frequency plane Fig.<ref>. \n  \n   \n   \n\n\n\n\n\n§ DISCRETE MAXWELL'S EQUATIONS ON A LATTICE\n\n\n\nSpace is an orthogonal lattice with lattice constants a,b and c on the x,y and z directions, respectively. The z-axis is singled-out as the propagation axis for the transfer matrix. The discrete space is thus viewed as a sequence of x,y-parallel planes labeled by the z-axis coordinate. The discrete position vector is n=(a n_x,b n_y,c n_z)=(n_⊥,c n_z), where the notation n_⊥=(a n_x,b n_y) emphasizes the decomposition of the space as a collection of planes perpendicular to the z-axis, as in <cit.>. If there is a preference to view the collection of planes as central, then ⊥ should be changed to ∥ everywhere in the paper. At each point of the lattice, the electromagnetic field is described by six components, E and H. The material attached to each lattice point is characterized by two discrete scalar fields which connect D to E and B to H, respectively:\n\n    D   =   ϵ_0ϵ(n_⊥,c n_z)E, \n    B   =   μ_0μ(n_⊥,c n_z)H.\n\nIn the discrete electrodynamics that we are taking forward, the ∇ operator becomes a pair, (T^E ,T^H ), of lattice operators,  where T^E=(T_x^E(a),T_y^E(b),T_z^E(c)) and T^H=(T_x^H(a),T_y^H(b),T_z^H(c)). These discrete operators are defined by their action on a lattice scalar function f(n). For the x-axis\n\n    T_x^E(a)f(n)   =(i a)^-1(f(n+a x̂)-f(n)),\n    \n    \tT_x^H(a)f(n)   =-(i a)^-1(f(n-a x̂)-f(n)).\n\nwith (y,b) and (z,c) taking place of (x,a), for the other axes.\nThe Maxwell's equations on the lattice are\n\n    T^E ×E   =   Γ_H^-1H^' , \n    T^H×H^'   =   Γ_E^-1E,\n\nwhere\n\n    Γ_H^-1   =    -iω^2 ϵ_0μ_0 μ(n_⊥,c n_z) c,\n    Γ_E^-1   =   -i ϵ(n_⊥,c n_z)c^-1,\n    H^'   =   i(ωϵ_0 c)^-1H.\n\nEliminating E_z and H^'_z from  Maxwell's equations, the propagation of the  4-dimensional vector field \n\n    |F(n_⊥,n_z)⟩=\n              [   E_x(n_⊥,c n_z);   E_y(n_⊥,c n_z); H^'_x(n_⊥,c n_z); H^'_y(n_⊥,c n_z) ]\n\nis carried on, as usual, by two operators. The first operator O_E, (<ref>), advances only the E-components Fig.(<ref>)\n\n\n\n    [   E_x(n_⊥,c n_z);   E_y(n_⊥,c n_z); H^'_x(n_⊥,c n_z); H^'_y(n_⊥,c n_z) ]              [ E_x(n_⊥,c n_z+c); E_y(n_⊥,c n_z+c); H^'_x(n_⊥,c n_z); H^'_y(n_⊥,c n_z) ].\n\n\n\n\n\n\n\n\n\n\n\n\nThe material properties Γ_H and Γ_E embedded in the O_E matrix elements depend only on the spatial position n located on the plane n_z.  The operator O_E acts on the internal index α of the vector field F_α, (<ref>), as a 4 by 4 matrix multiplication, whereas the matrix elements of O_E are operators on the external space variable n_⊥ of the field, but not on the n_z-position.\nThe E-step carried by O_E is followed by an H-step carried by O_H\n\n    [ E_x(n_⊥,c n_z+c); E_y(n_⊥,c n_z+c); H^'_x(n_⊥,c n_z); H^'_y(n_⊥,c n_z) ]                            [   E_x(n_⊥,c n_z+c);   E_y(n_⊥,c n_z+c); H^'_x(n_⊥,c n_z+c); H^'_y(n_⊥,c n_z+c) ].\n\n\n\n\n\n\n\n\n\n\n\nIn contrast to O_E, the material properties Γ_H and Γ_E for the O_H matrix elements depend on the spatial position on plane n_z+1.\nThe complete propagation from the plane located at n_z to the one located at n_z+1 is accomplished by O_H(n_⊥,c n_z+c) O_E(n_⊥,c n_z).\n\nIt is apparent from the structure of the operators O_E and O_H that the internal 4-dimensional space can be viewed as a tensor product of two 2-dimensional spaces. This decomposition proves to be efficient in classifying different paths taken by the electromagnetic propagation through materials, which will be one of our main instruments to obtain closed analytic formulas for the transfer matrix elements. So, departing from <cit.>, the path viewpoint is expressed by writing the operators as\n\n    O_E (n_z)   =    O_E^(1)+O_E^(2)+O_E^(3), \n    \n       O_E^(3)   =   1⊗1,\n        \n    \n       O_E^(2)   =    I_E⊗σ_2 Γ_H^-1(-c),\n    \n       O_E^(1)   =   I_E⊗|T_E⟩Γ_E ⟨T_E|σ_2(-c),\n\nwhere σ_2 is the Pauli matrix and\n\n    1=[ 1 0; 0 1;   ]   ,\n    I_E=[ 0 1; 0 0;   ]   ,\n    I_H=[ 0 0; 1 0;   ].\n\n\nThe ket and the bra operators form (<ref>) act  on the internal space as 2-dimensional vectors and on the external space variable  n_⊥ as operators on functions\n\n    |T_E⟩=[ T_x^E;      ; T_y^E ]   ,\n    ⟨T_E|=[ T_x^H T_y^H ].\n\n\nThe ket to bra conjugation is defined as the change of E into H. There is no  additional conjugation over the complex unit i. The labels, as is usually the case, do not change under conjugation.\n\nSimilarly, but different to the E-step, the operator for the H-step is\n\n    O_H(n_z+1)    =    O_H^(1)+O_H^(2)+O_H^(3), \n    \n       O_H^(3)   =   1⊗1,\n        \n    \n       O_H^(2)   =    I_H⊗σ_2 Γ_E^-1(-c),\n    \n       O_H^(1)   =   I_H⊗|T_H⟩Γ_H ⟨T_H|σ_2(-c),\n\n\n    |T_H⟩=[ T_x^H;      ; T_y^H ],\n       ⟨T_H|=[ T_x^E T_y^E ].\n\n\n\nConcordant to the tensor product decomposition of the operators, the field will be represented also as a tensor product,\n\n    |F(n_⊥,n_z)⟩=   \n    |e⟩⊗[ E_x(n_⊥,c n_z); E_y(n_⊥,c n_z) ]+|h⟩⊗   [ H^'_x(n_⊥,c n_z); H^'_y(n_⊥,c n_z) ],\n\nwhere the 2-dimensional vectors |e⟩ and  |h⟩, \n\n    |e⟩=[ 1;  ; 0 ]   ,\n    |h⟩=[ 0;  ; 1 ],\n\nselect the electric part (E_x,E_y) and the magnetic part  (H^'_x,H^'_y)  of the 4-dimensional vector (E_x,E_y,H^'_x,H^'_y), respectively.\n\n\n\n§ BASIS VECTORS FOR FIELDS ON A LATTICE\n\n\n\nThe solutions to  Maxwell's equations on a lattice filled with a homogeneous medium, i.e. constant Γ_H(n_⊥,c n_z)=Γ_H and Γ_E(n_⊥,c n_z)=Γ_E, are plane waves.\n These solutions, |Ψ_S/P,p_⊥^±⟩ e^± i p_z n_z c e^- i ω t, are distinguished by the type of polarization S or P and by the direction of propagation ± along the positive or negative z-direction. Here\n\n    |Ψ_S/P,p_⊥^±⟩=|p_⊥,S/P,±⟩e^i p_⊥ n_⊥,\n\nwith the propagation in the (x,y)-plane  described by p_⊥=(p_x,p_y).\n\nThe internal 4-dimensional vectors of the plane waves are \n\n    |p_⊥,S,+⟩   =|e⟩⊗ i σ_2 |p_⊥^H⟩+|h⟩⊗|p_⊥^H⟩Γ_H k_z^E,\n    |p_⊥,P,+⟩   =|e⟩⊗|p_⊥^E⟩Γ_E k_z^H+|h⟩⊗ i σ_2 |p_⊥^E⟩,\n\nwhere, consistent with (<ref>) and (<ref>), the column vectors  |p_⊥^E⟩ and |p_⊥^H⟩ are the transpose and E⇄ H conjugate of the row vectors ⟨p_⊥^E|=[k_x^H,k_y^H] and ⟨p_⊥^H|=[k_x^E,k_y^E], respectively.\n The space being discrete, the  plane wave depends on the lattice constants (a,b,c) through the vectors k^E=(k_x^E,k_y^E,k_z^E) and k^H=(k_x^H,k_y^H,k_z^H),\n\n    k_x^E = (i a)^-1(e^i a p_x-1),\n    \n    \tk_x^H = -(i a)^-1(e^-i a p_x-1),\n\nwith the pairs (b,p_y) and (c,p_z) instead of (a,p_x), for the other axes. To obtain the other two basis vectors, |p_⊥,S/P,-⟩, change k_z^E from  |p_⊥,S/P,+⟩ into - k_z^H.\n\nTo derive the transfer matrix elements, the field (<ref>), at a given n_z, is decomposed in the basis |Ψ_S/P,p_⊥^±⟩. The decomposition is carried out by projecting on an orthogonal set of bra vectors (<ref>)\n\n\n    ⟨Φ_S/P,p_⊥^±|=⟨p_⊥,S/P,±|e^-i p_⊥ n_⊥,\n\t\nwhere\n\n    ⟨p_⊥,S,+|   =-⟨e|⊗⟨p_⊥^H|i σ_2 k_z^H+⟨h|⊗⟨p_⊥^H|Γ_H^-1,\n    \n    ⟨p_⊥,P,+|   =⟨e|⊗⟨p_⊥^E|Γ_E^-1-⟨h|⊗⟨p_⊥^E|i σ_2 k_z^E.\n\nMultiply  ⟨p_⊥,S/P,+| by -1 and change k_z^H into -k_z^E to attain  ⟨p_⊥,S/P,-|. The orthogonal basis is not normalized. The norm,  ⟨p_⊥^H||p_⊥^H⟩( k_z^H+k_z^E)=⟨p_⊥^E||p_⊥^E⟩( k_z^E+k_z^H), is invariant to E⇆ H conjugation. \n\n\n\n\n\n\n§ DISPERSION RELATION FOR A HOMOGENEOUS MEDIUM\n\n\n\nThe requirement that the plane wave basis satisfy  Maxwell's equations on the lattice filled with a homogeneous medium imposes that\n\n    -(Γ_H Γ_E)^-1=⟨p_⊥^H||p_⊥^H⟩+k_z^E k_z^H.\n\nThis is the dispersion relation for the homogeneous medium\n\n    ω^2/v_0^2=k_x^E k_x^H+k_y^E k_y^H+k_z^E k_z^H,\n\nwhere the velocity of light in that medium is v_0. \nThrough the following c-scaling\n\n    ω/v_0=Ω/c=2 π/λ,\n\nthe dispersion relation is written in terms of a unitless frequency Ω\n\n    Ω^2/c^2=k_x^Ek_x^H+k_y^Ek_y^H+k_z^Ek_z^H,\n\nwhich will become useful for expressing the transfer matrix elements in terms of unitless parameters.\nNote that the term k_x^Ek_x^H+k_y^Ek_y^H, which is equal to ⟨p_⊥^E||p_⊥^E⟩=⟨p_⊥^H||p_⊥^H⟩, tends in the continuum limit a → 0,b→ 0 to p_x^2+p_y^2. In what follows, we use vacuum as the homogeneous medium for the basis. Interchangeably, this medium will be called also as the reference medium for the basis.\n\n\n\n§ SOLVING FOR Φ _Z=E^I C P_Z FOR GIVEN Ω, P_X AND P_Y\n\n\nThe approach in <cit.> is to work on-shell which means solve the dispersion relation for p_z, given the frequency Ω and  p_⊥.\nTo this end, we introduce the function φ _z\n\n    φ _z=e^i c p_z,\n\nwhich is the solution to the equation\n\n    φ _z+φ _z^-1=2ζ,\n\nwhere\n\n    ζ=1-Ω^2/2+c^2/2⟨p_⊥^H||p_⊥^H⟩.\n\n\nThere are two distinct and non-overlapping constraints that we impose on p_z from (<ref>). One condition is Im(p_z)⩾ 0 so that evanescent waves generated away from sources placed at z=-∞ or at z=∞  are represented by a decaying φ_z or φ_z^-1, respectively. The other condition is p_z⩾0 enforcing the velocity of   propagating waves coming from z=-∞ or z=∞ to be oriented along  ẑ or \n -ẑ, respectively. The formal solution to the equation (<ref>), φ_z=ζ±√(ζ^2-1)\n\n\n\ndivides the real axis  into three intervals, (-∞,-1), (-1,1) and (1,∞). The requirement Im(p_z)⩾0  for the interval (-∞,-1) selects the  φ_z=ζ - √(ζ^2-1)\n\n\n\nbut does not impose specific values for φ_z on (-∞,-1). Both walks in the ζ-complex plane  above or below (-∞,-1) satisfy  Im(p_z)⩾ 0. \nThe second constrain, p_z⩾ 0,  requires the values of  φ_z on (-1,1) to be those obtained from walking below the segment (-1,1). For the last interval the constrain  Im(p_z)⩾ 0 is fulfilled and, like for  (-∞,-1), we are free to define φ_z on  (1,∞) from walking above or below the interval. \n We opt to construct a function φ_z continuous from below, Im(ζ)⩽ 0, and so select the values of φ_z on the real axis by walking below it in the ζ-complex plane.\n \n This analysis leads to the following solution\n\n    φ_z(ζ)=ζ-√(ζ^2-1)e^i/2(arg(ζ-1)+arg(ζ+1)).\n\nThe arg(ζ) takes values on [-π,π) in such a way  that arg(ζ)=-π if Im(ζ)=0 and ζ<0.\nIn Fig.<ref> the point φ_z=1 defines the Rayleigh frequency, at which, for a given p_⊥, the waves turn from evanescent to propagating.\n\n\n\n\n\n§ PERIODIC BOUNDARY CONDITIONS\n\n\nConsider that the electromagnetic field is subjected to the Bloch-Floquet boundary conditions\n\n    |F(n_⊥+(a,0)L_x,c n_z)⟩=\te^2π i ξ_x |F(n_⊥,c n_z)⟩,\n    |F(n_⊥+(0,b)L_y,c n_z)⟩=\te^2π i ξ_y |F(n_⊥,c n_z)⟩,\n\nwhere L_x⩾ 2 and L_y⩾ 2 are two integer numbers selected to describe the dimensions of a unit cell in the (x,y)-plane. The material properties are taken to be periodic from one unit cell to another\n\n    Γ_H(n_⊥+(a,0)L_x,n_z)    =   Γ_H(n_⊥,n_z) \n    Γ_H(n_⊥+(0,b)L_y,n_z)    =   Γ_H(n_⊥,n_z)\n\nwith a similar periodicity for Γ_E. The Bloch-Floquet boundary condition reduces the possible values for (p_x,p_y) to\n\n    p_x = 2 πM_x/a L_x+ 2 πξ_x/a L_x,\n    \n    \tp_y = 2 πM_y/b L_y+ 2 πξ_y/b L_y,\n\nwhere  M_x=0,1,…,L_x-1 and M_y=0,1,…,L_y-1, with 0⩽ξ_x<1, 0⩽ξ_y<1.\n\nThe indices of the basis, written as |ψ_POL,BF^DIR⟩, are thus of four categories. The first, POL, is the polarization index, which takes two values S and P. The second, DIR, is the direction of propagation of the plane wave along the z-axis, which also take two values, + and -. The third, BF, is the Bloch-Floquet index consisting of pairs of integer numbers (M_x,M_y) and  it takes a finite number of values. The last index, (ξ_x,ξ_y)  takes only one value and can be viewed as a label for the entire Bloch-Floquet linear basis.\n\nThe parameters (ξ_x,ξ_y) specify the direction of the wave in the (x,y)-plane. For example, if the direction of the incoming mode (M_x=0,M_y=0) is stated in spherical coordinates by the angles (θ,φ), then the parameterization of ξ_x and ξ_y is\n\n    sin(πξ_x/L_x)    =   a Ω/2 csin(θ) cos(φ), \n    sin(πξ_y/L_y)    =   b Ω/2 csin(θ) sin(φ), \n    sin(1/2c p_z)    =   c Ω/2 ccos(θ).\n\n\nThe first two equations give ξ_x,ξ_y for  chosen θ, φ and Ω, whereas  the third equation solves for p_z. \n\n\n\n\n§ TRANSFER AND SCATTERING MATRICES\n\t\nTo go ahead and propagate from the IN  plane located at n_z to the OUT at n_z+L_z, decompose the IN and OUT fields in the plane wave basis, (<ref>), labeled  as |ψ_pol,bf^dir⟩ and |ψ_POL,BF^DIR⟩, respectively. The z-phases, e^± i p_z^IN n_z and  e^± i p_z^OUT (n_z+L_z), which are not included in the basis, are generated by the operators and so they do appear in the transfer matrix elements.\nThe transfer matrix elements are defined in (<ref>) as the factors that connect the coefficients of the |F^IN(n_⊥,n_z)⟩ and |F^OUT(n_⊥,n_z+L_z)⟩ fields decomposed in the reference medium plane wave basis\n\n    C_POL,BF^DIR=∑(T^DIR;dir_POL,BF;pol,bf ) C_pol,bf^dir ,\n\nthe sum being over indices (dir,pol,bf) related to the IN parameters.\nThe transfer matrix elements T in (<ref>) borrow, from the basis, all four index categories.\n\n\n\n\n\n\t\n\t\n\n\nBuilding a matrix out of the T-coefficients of (<ref>)  requires a map from the 2-dimensional Bloch-Floquet index (M_x,M_y)  to a 1-dimensional integer index m=1,2,⋯, L_x L_y. We use the Rayleigh frequency of (M_x,M_y) to both map and order the Bloch-Floquet index. If the Rayleigh frequency of (M_x,M_y) is less than the Rayleigh frequency of (M_x^',M_y^') we order the Bloch-Floquet indices as (M_x,M_y)<(M_x^',M_y^'). If two distinct Bloch-Floquet modes have the same Rayleigh frequency, the order used is the lexicographic order. Note that this ordering depends on (ξ_x,ξ_y). The mode (M_x,M_y)=(0,0) has f_Rayleigh=0 and it is mapped into m=1. The next  f_Rayleigh > 0 is mapped into m=2 and so on Table<ref> from Appendix I.\n\nThe process of building the transfer matrix out of its elements starts with  all 2× 2 matrices \n\n    T^-,-_m,n=\t(\n    \t[ T^-,-_Sm,Sn T^-,-_Sm,Pn; T^-,-_Pm,Sn T^-,-_Pm,Pn;             ])\n \nconstructed for each pair (m,n).\nThese matrices contain the information about the transfer, through the device, of the mode n with a negative direction present at IN into the mode m, also with a negative direction but located at OUT. \n\nFrom these 2× 2-matrices, construct the transfer matrix T^-,- by letting the Bloch-Floquet indices m and n  run from 1 to L_x L_y\n\n    T^-,-=\t(\n    \t[ T^-,-_1,1 T^-,-_1,2 T^-,-_1,3         ⋯; T^-,-_2,1 T^-,-_2,2 T^-,-_2,3         ⋯; T^-,-_3,1 T^-,-_3,2 T^-,-_3,3         ⋯;         ⋯         ⋯         ⋯         ⋯;           ]).\n\n\nOnce  all four matrices T^-,-, T^-,+,\tT^+,-, T^+,+ are constructed in a similar manner, the complete transfer matrix appears as\n\n    T(ξ_x,ξ_y)=\t(\n    \t[ T^+,+ T^+,-; T^-,+ T^-,-;       ]),\n\nwhere (ξ_x,ξ_y) are explicitly written here to remind us of their role. \n\nThe elements of the scattering matrix can now be obtained from the complete transfer matrix. The input and output have a different meaning for the scattering matrix than OUT and IN have for the transfer matrix. Instead of \"DIR/dir\", for the scattering matrix we use a position index, which is either min or max depending on the position on the z-axis of the field |F⟩, at z=n_z or at z=n_z+L_z, respectively. The polarization and the Bloch-Floquet  indices remain the same.\n\nThe well-known procedure to obtain the scattering matrix, <cit.>,\n \n\n\n\n\n\n\n\n\n\n    t(ξ_x,ξ_y)=\t(\n    \t[ t^max,min t^max,max; t^min,min t^min,max;           ]),\n\nrequires the inverse of the transfer matrix T^-,-\n\n    t^min,max   =   (T^-,-)^-1,\n    \n    \tt^min,min   =   -t^min,maxT^-,+,\n    \n    \tt^max,max   =   T^+,-t^min,max,\n    \n    \tt^max,min   =   T^+,++t^max,maxT^-,-t^min,min.\n\n\n\n\n\n§ PROPAGATION BY PATH-OPERATORS\n\n\nThe transfer matrix elements\n(<ref>) can be written in terms of the propagation operator\n\n    T^DIR; dir_POL,BF; pol,bf=   OUT^-1(L_xL_y)^-1∑_-5mu n_⊥\n       ⟨ϕ_POL,BF^DIR|Operator|ψ_pol,bf^dir⟩,\n\t\n\n\n\t\n\t\n\t\n\t\n\nwhere the normalization in the internal space and the Operator are\n\n    OUT=⟨p^H,OUT_⊥||p^H,OUT_⊥⟩(k_z^H,OUT+k_z^E,OUT),\n    Operator=O_H(n_z+L_z)O_E(n_z+ L_z-1)\n    … \n    \tO_H(n_z+1)O_E(n_z).\n \n\nThe common approach, also followed by <cit.>, is to place the resolution of identity between every pair of O_HO_E operators in the product (<ref>). Within this procedure, for a stack of laminae we need  to multiply a set of large-dimensional transfer matrices, one for each lamina. This implies that to grasp one desired transfer matrix element of the stack we actually need to compute all elements, which can be computationally taxing, at both levels, theoretical or numerical. Furthermore, the advantage of using a sequence of matrix products is diminished by numerical instabilities and, potentially, by approximating a large-dimensional transfer matrix by a smaller one. \n\nTo avoid using  products of matrices  we develop a different procedure, which, to the best of our knowledge is new in the context of transfer matrices for non-homogeneous  permittivity and permeability materials. \n\n\nTo exemplify, consider |ψ_pol,bf^dir⟩=|p_⊥^IN,S,+⟩ e^i p_⊥^IN n_⊥ at IN and ⟨ϕ_POL,BF^DIR|=⟨p_⊥^OUT,S,+| e^-i p_⊥^OUT n_⊥ at OUT in (<ref>).\n\n\n\n\n\n\nThere are several decisive moments in this manuscript. One is here, where we decide to expand the product operator as a sum of path-operators. Namely, since each O_E and O_H is a sum of there operators, (<ref>) and (<ref>), (<ref>) becomes a sum of 3^L_z+1 terms O_H^(j)O_E^(k)… O_H^(m)O_E^(n), parameterized by a path (INn,m,…,k,jOUT), where each index takes three values. Each path can be represented graphically, like in Fig.<ref>, by associating a j ∙ and a j ∘ to O_E^(j) and O_H^(j), respectively.\n\n\n\n\n\n\n\n\n\n\n\nFor example, the path-operator O_H^(2)O_E^(3)O_H^(2)O_E^(1)O_H^(2)O_E^(1) for the path IN121232OUT is represented in Fig.<ref>\n\n\n\t\n\t\n\n\n \n \n\n\n§ CHANNELS\n\n\nThe transfer matrix element is thus a sum over path-operators\n\n    OUT^-1(L_xL_y)^-1∑_paths∑_n_⊥e^-i p_⊥^OUT n_⊥\n       ⟨p_⊥^OUT,S,+|path-operator|p_⊥^IN,S,+⟩ e^i p_⊥^IN n_⊥.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n We continue with the chosen example where S+ is placed at both  IN and OUT. However, the liberty of choosing any pair of polarization and direction at both IN and, independently, OUT, is manifestly visible in (<ref>). \n To proceed further, the tensor product decomposition of both the basis and the operators proves to be very useful. Each element of the  basis, (<ref>), is a sum of two parts, the e-part and the h-part, that contains |e⟩ and |h⟩, respectively. The same kind of decomposition is valid for the path-operator, where there is an I_E-part and an I_H-part in  (<ref>) and (<ref>). Due to these decompositions, the  tensor product in ⟨p_⊥^OUT,S,+|path-operator|p_⊥^IN,S,+⟩ splits as a product of  two factors. The first factor is  of the form ⟨e|I_H I_E I_2I_HI_1⋯ I_E|h⟩, and alike versions. It can take only two values, 0 or 1. For each non-zero path that survives this first-factor selection, we must compute the second factor, which contains the material properties. For this paper we confine ourselves to non-magnetic materials.\n \n The structure of the second factor is of the form ⟨p_⊥^H,OUT||T_E⟩Γ_Pσ_2⋯|p_⊥^E,IN⟩, which, drawing on ⟨T_E|σ_2|T_H⟩ e^i p_⊥· n_⊥=0, offers a second zero-selection procedure. Moreover, the second factor, for those paths that are overall non-zero, admits, as well, a pleasing and advantageous factorization into two terms. One term, call it the 𝒵-term, is a function of (p_z^IN,p_z^OUT,Ω) but not on the  materials parameters, whereas the other, call it the XY-term, depends on p_⊥^IN and the deposited materials.\nThis factorization is crucial in simplifying the final result for the transfer matrix because, fortunately, the XY-term is common to a group of paths. \n\nWe will call a channel a subset of paths, which have the same XY-term. The main significance is that the number of channels is much smaller than the number of non-zero paths, substantially reducing the final analytical expression for a transfer matrix element. Furthermore, the 𝒵-term of a channel, which is the sum of the 𝒵-terms of the paths that belong to that channel, simplifies into products of φ_z-dependent factors. \n\nThe technique to separate a 𝒵-term from an XY-term is to forward-propagate the input phase e^i p_⊥^IN· n_⊥ and backward-propagate the output phase  e^i p_⊥^OUT· n_⊥, both through the chain of path-operator product. These propagations are carried through the path-operator by using the general relation\n\n\n    ∑_n_⊥e^-i p_⊥^OUT· n_⊥ f_OUT (n_⊥)(|T_E/H⟩(f_IN (n_⊥)e^i p_⊥^IN· n_⊥))=\n    ∑_n_⊥(-|T_H/E⟩(e^-i p_⊥^OUT· n_⊥ f_OUT (n_⊥)))f_IN (n_⊥)e^i p_⊥^IN· n_⊥.\n\t\n\nFor the specific aim of splitting-up the 𝒵 from the XY-factor, the forward-propagation proceeds as long as  f_IN (n_⊥) is a constant independent of n_⊥. With or without the use of (<ref>), a trivial observation is that  the phase \ne^i p_⊥^IN can be pushed through |T_E⟩ leaving behind |p_E^IN⟩.\n\n\n\nHowever, (<ref>) brings in clarity for the backward-propagation. In this case, i.e. for constant f_OUT (n_⊥), the phase \ne^-i p_⊥^OUT is acted upon by  -|T_H⟩, creating  |p_E^OUT⟩, but at the output.\n\n\n\nThe splitting-up procedure stops when each phase meets its own n_⊥-dependent non-magnetic materials. The sub-chain of a path-operator that extends between the final propagation positions of e^-i p_⊥^OUT· n_⊥ and e^i p_⊥^IN· n_⊥ is the XY-operator, which defines a channel. Once the classification of channels is at hand, the complete solution for the transfer matrix elements is obtained by continuing the forward-propagation of the phase e^i p_⊥^IN, but now through the non-magnetic material-dependent XY-operators. We explain this below, solving the case of a structure composed of two nonhomogeneous non-magnetic laminae.\n\n\n\n\n§ ANALYTICAL SOLUTION FOR A BILAMINAR NON-MAGNETIC STRUCTURE\n\n\n\nIt is not difficult to complete the path-operator calculation for a single lamina carrying an (n_x,n_y)-dependent non-magnetic materials. The next in line is a bilaminar structure, which gives rise to a greater range of scattering phenomena. Although its complete solution may seem arduous, the end result elucidates the role played by each propagation channel. Furthermore, the analytical solution combined with optimization procedures provides a method for designing practical devices, Section <ref>. \n\nIn what follows we present the solution to the path-operator propagation for a device composed of two laminae with non-homogeneous and distinct non-magnetic materials  ϵ_1(n_x,n_y)≠ϵ_2(n_x,n_y), Fig.<ref>.\n\n\nFirst we take an overall view of the results, followed by an in-depth study of  propagation through  path-operators.\n\nFrom the total of 3^6=729 paths only 188 paths, counted for all possible polarization pairs, are non-zero. These paths are grouped into channels. The channels through which the plane waves propagate from IN at n_z-1 to OUT at n_z+2, depend on the polarization index, Tab.<ref>. For example, the specific propagation from S^IN into S^OUT goes through 104 paths, the contributions from the rest of the paths, up to 188, being zero for this polarization pair. These 104 paths are grouped in 5 channels Tab.<ref>. Channel 1 of S^OUTS^IN contains 46 paths, Channel 2 comprises 22 and so on, until Channel 5, which is built on 20 paths. Tab.<ref> contains, for each pair of IN-OUT polarization, the information for the number of channels and the number of paths per channel.\n\n\n\nBy way of example, to justify these results, and more, we will analyze three paths.\n\n\nTwo paths are selected form the 729-188 set of zero-paths to explain the source of their null contribution to propagation. \n\nThe path  IN321321OUT does not contribute at all to any polarization propagation because the operator product for this path,  O_H^(1)O_E^(2)O_H^(3)O_E^(1)O_H^(2)O_E^(3), is of the form\n(I_H I_E1I_E I_H1)⊗(operator ). The part I_E1I_E=|e⟩⟨h|1|e⟩⟨h| is zero, since ⟨h||e⟩=0, which renders the paths inactive to any propagation.\n\nAnother path, IN321121OUT is also zero, but for a different reason. Its path-operator O_H^(1)O_E^(2)O_H^(1)O_E^(1)O_H^(2)O_E^(3) is of the form\n(I_H I_EI_HI_E I_H1)⊗(operator). The first term of the tensor product, (I_H I_E I_H I_E I_H1)=|h⟩⟨e|, is not zero. However, the second term of its tensor product contains O_H^(1)O_E^(1)=|T_H⟩Γ_S⟨T_H|σ_2 (-c)|T_E⟩(-c Γ_P)⟨T_E|σ_2. This brings into contact ⟨T_H| with |T_E⟩ acted by σ_2, which is zero\n\n\n    [ T_x^E;      ; T_y^E ]σ_2\n    \t\t[ T_x^E T_y^E ]=i(T_y^ET_x^E-T_x^ET_y^E)=0,\n\ngiven that T_y^E and T_x^E commute. \nWe are left with the propagation along 188 non-zero paths, which is exemplified next.   \n\n\n\n§ CHANNEL 3 SS\n\n\n\nCompute the contribution of the path IN321221OUT to the propagation of S^IN,+ into S^OUT,+. This path is part of Channel 3 S^OUTS^IN, which contains 8 paths, Tab.<ref>.\nIts path-operator  is of the form\n|h⟩⟨e|⊗(operator). To evaluate its contribution to the transfer matrix element, the operator needs to act on both the input \n|p_⊥^IN,S,+⟩ e^i p_⊥^IN n_⊥ \nand on the output \ne^-i p_⊥^OUT n_⊥⟨p_⊥^OUT,S,+|,\n(<ref>).\n\n\n\n\n\n\n\n\n\nThe first term |h⟩⟨e| tells us that only the e-part of the input |p_⊥^IN,S,+⟩ is delivered, by this path, into the h-part of the output ⟨p_⊥^OUT,S,+|.\n\n\n\n\n\n\n\n\nUse, for a non-magnetic device, Γ_H^-1=Ω^2(i c)^-1 and Γ_E^-1=i ϵ(n_⊥)c^-1 to arrive at\n\n\n    OUT^-1(L_xL_y)^-1∑_n_⊥e^-i p_⊥^OUTn_⊥\n     ic^3Ω^2⟨p_⊥^OUT,H||T_H⟩⟨T_H|σ_2ϵ_2|T_E⟩ϵ_1^-1⟨T_E|ϵ_1σ_2|p_⊥^IN,H⟩\n     e^i p_⊥^IN n_⊥.\n\nFactorize the summand into a 𝒵-factor and an XY-factor, by back-propagating e^-i p_⊥^OUTn_⊥ through |T_H⟩ at OUT, (<ref>), whereas at IN use   |T_H⟩e^i p_⊥^IN n_⊥=|p_⊥^IN,H⟩e^i p_⊥^IN n_⊥,\n\n\n    OUT^-1(L_xL_y)^-1∑_n_⊥e^-i p_⊥^OUTn_⊥ ic^3Ω^2⟨p_⊥^OUT,H||p_⊥^OUT,H⟩\n    ⟨T_H|σ_2ϵ_2|T_E⟩ϵ_1^-1⟨T_E|ϵ_1σ_2|T_H⟩ e^i p_⊥^IN n_⊥.\n\nFor this path, the 𝒵-factor is ic^3Ω^2⟨p_⊥^OUT,H||p_⊥^OUT,H⟩. For other paths, both variables φ_z^OUT and φ_z^IN are present in the result.  \n\nThe XY-operator, which is common to all 8 paths from channel_3-SS and thus  defines this channel, is\n\n\n    Operator-XY_3^SS=⟨T_H|σ_2ϵ_2|T_E⟩ϵ_1^-1⟨T_E|ϵ_1σ_2|T_H⟩.\n\n\n In the general case, the action of an XY-operator on the input phase e^i p_⊥^IN n_⊥ delivers a function of n_⊥, χ(n_⊥), which depends on ϵ_1(n_⊥), ϵ_2(n_⊥) and p_⊥^IN. This function,  χ(n_⊥), contains the information from the propagation of the IN phase through the entire  non-magnetic media, all the way to the OUT. Here, for Channel 3 SS, \n\n    Operator-XY_3^SS(e^i p_⊥^IN n_⊥)=e^i p_⊥^IN n_⊥χ_3^S^OUT,S^IN(n_⊥).\n\t\n\nHenceforth, to keep the formulas for χ(n_⊥) simple,  we write interchangeably p_x=p^IN_x and p_y=p^IN_y. However, to avoid confusion and to be able to distinguish between the IN and OUT phases, we will keep the index OUT for p_⊥^OUT.\n\nFrom (<ref>) we deduce the dependence on p_⊥^IN of the χ-function.\nNamely, χ_3^S^OUT,S^IN(n_⊥)=g_0+g_1cos(a p_x)+g_2cos(b p_y)+g_3sin(a p_x)+g_4sin(b p_y)+g_5cos(a p_x-b p_y)+g_6sin(a p_x-b p_y), where g_j, with j=0⋯6, are functions of n_⊥ build exclusively on the non-magnetic materials deposited on the laminae. For example\n\n\n    g_6= iϵ _1(n_x-1,n_y+1) ϵ _2(n_x,n_y)/a^2 b^2 ϵ _1(n_x,n_y+1)   \n    \n    \t\t-iϵ _1(n_x+1,n_y-1)\n    \t\t\tϵ _2(n_x,n_y)/a^2 b^2 ϵ _1(n_x+1,n_y)   \n    \n    \t\t+iϵ _1(n_x+1,n_y-1) ϵ _2(n_x+1,n_y)/a^2 b^2 ϵ _1(n_x+1,n_y)   \n    -iϵ _1(n_x-1,n_y+1)\n    \t\t\tϵ _2(n_x,n_y+1)/a^2 b^2 ϵ _1(n_x,n_y+1)   \n    \n    \t\t+iϵ _2(n_x,n_y+1)/a^2 b^2-iϵ _2(n_x+1,n_y)/a^2 b^2,\n\nwhere, for clarity, we used the shorthand notation n_x-1=a n_x-a, n_y+1=b n_y+b, and alike.\n\n\n\n\n\n\nThe periodic boundary conditions and the sum from (<ref>) bring in the Fourier transform of  χ(n_⊥) over the variable q_⊥=p_⊥^IN-p_⊥^OUT≡ p_⊥-p_⊥^OUT,\n\n    χ̃_3^S^OUT,S^IN(q_⊥):=\n    \n    \t\t(L_xL_y)^-1∑_n_⊥e^i q_⊥· n_⊥χ_3^S^OUT,S^IN(n_⊥).\n\t\n\n\n\n\n\n\n\n\n\n\nSince χ̃_3^S^OUT,S^IN(q_⊥) is common to all paths from Channel 3, the next focus is on the sum of all 𝒵_paths. It turns out that, for all channels, this sum factorizes into simple terms, each term being a function of either φ _z,IN or φ _z,OUT, but not both. For the example under study\n\n\n    ∑_paths from\n    Channel 3𝒵_path\t=i c Ω ^2 φ _z,INφ _z,OUT.\n \t\n\nFinally, we arrive at the contribution of Channel 3 S^OUT,+,S^IN,+, \n\n\n\n\n\n\nwhich, conveniently, is a product of χ̃_3 from (<ref>) and the channel 𝒵-factor (<ref>) \n\n\n    𝒵_3^OUT,S+,IN,S+=\tOUT^-1 i c Ω ^2 φ _z,INφ _z,OUT.\n \t\n\n\nThe main result, for the IN S to OUT S propagation, is that the transfer matrix element is reduced from a sum of 729 paths to a sum of 5 channels\n\n\n    T_Sm,Sn^+,+=∑_channel=1^5\t𝒵_channel^OUT,S+,IN,S+ χ̃_channel^S^OUT,S^IN(q_⊥).\n\t\n\nThe dependence on the Bloch-Floquet indices m and n is through both p_⊥ and q_⊥.\n\n\n\n\n§ 𝒵 AND XY-FACTORS FOR ALL CHANNELS\n\n\nThe XY-channel-operators  for all four polarization combinations (OUT/IN,S/P) are represented in Fig.<ref>. These operators are independent of the direction of propagation index ±. The channels from IN S to OUT S were discussed above. There are 9 channels that connect  IN S polarization with  OUT P. All start with |T_E⟩ and end in ⟨T_H|. They are colored green in Fig.<ref>. Change the input into a P-polarization. There are 5 unique channels that transfer an IN P into an OUT S. They are colored purple in Fig.<ref>. The last case  is the transfer of  IN P into  OUT P. There are 14 channels out of which 13 are unique to this polarization pair. They are colored black in Fig.<ref>. The non-unique channel, shared with IN S to OUT S, has no (x,y)-dependence and so its χ-function is 1.\n\n\n\nBy contrast, the 𝒵-factors depend on the direction of propagation. Tab.<ref> and Appendix B contain the information for all the other 𝒵-factors.\n\n\n\nThe rule to obtain the 𝒵-factors for other directions is to change IN- into IN+ and, at the same time, change\nφ_z,IN→φ_z,IN^-1 and\nc →  -c. The same rule applies for OUT- into OUT+.\n\nHowever, this rule does not apply for Channel 1, for both  SS and PP, Appendix B,  Tables <ref>, <ref>. The reason is that, in vacuum, there are pairs of polarization and directions that cannot propagate into each other. For example, in vacuum,  IN S+ cannot propagate into  OUT S-. In contrast, Channel 1 is open in vacuum, so the rule does not apply to it.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAt this point, the transfer matrix elements are  computed in closed analytical formulas for any non-magnetic bilaminar lattice structure. \nThe solution is completely general being valid for elaborate non-magnetic material patterns that can be drawn on both laminae.\n\nThe decomposition of propagation by channels can be implemented also for three or more patterned laminae. The number of channels increases with the increase of the number of laminae, but the procedure remains the same.\n\nReturning to the bilaminar structure, an avenue worth to explore is the continuum limit in the x and y dimensions. In this limit, the number of Bloch-Floquet modes become infinite, placing  weight to our method of directly seizing the transfer matrix elements by circumventing infinite-dimensional transfer matrices.\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\nXXXXXXXXXXXXXX\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONTINUUM LIMIT FOR A,B→ 0\n\nConsider that the discrete lattice constants a and b are much smaller than c, the discrete lattice constant on the z-axis. In this case n_⊥ transforms into a continuum r_⊥ coordinate so that the unit cell length is  l_x=lim (a L_x) for a→ 0 and L_x→∞. Same goes for l_y. However, the z-axis remains discrete. In the continuum x,y-limit the discrete χ_3^S^OUT,S^IN(n_⊥), (<ref>), is a function of (x,y)\n\n    χ_3^InS,OutS(x,y,p_x,p_y)=\n    \t\t\n       \n    \t\tp_x (\n    \t\ti (∂_yylnϵ_1)(∂_xϵ_2)-i(∂_xylnϵ_1)(∂_yϵ_2))+\n    \t\t\n       \n    \t\tp_y (\n    \t\ti (∂_xxlnϵ_1)(∂_yϵ_2)-i(∂_xylnϵ_1)(∂_xϵ_2))+\n    \t\t\n       \n    \t\tp_x^2  (∂_ylnϵ_1)(∂_yϵ_2)+\n    \t\t\n       \n    \t\tp_x p_y ( -(∂_xlnϵ_1)(∂_yϵ_2)-(∂_ylnϵ_1)(∂_xϵ_2))+\n    \t\t\n       \n    \t\tp_y^2 ( (∂_xlnϵ_1)(∂_xϵ_2)).\n\nThe dependence of (<ref>) on p_x, p_y is quadratic. Recall that p_⊥=p_⊥^IN. Each coefficient of this quadratic polynomial is a combination of partial derivatives of permittivities, Fig.<ref>. We purposely placed these coefficients as a sum of terms, each being a product of a partial derivative of a function of ϵ_1 into another one, which depends exclusively on ϵ_2. This specific arrangement is crucial to get a closed formula for the Fourier integral for a polygonal tessellated  pattern, which will be a later subject to undertake. In addition to being technically useful, this arrangement has another facet. It reveals that the contribution of the permittivity constants to a channel is via pairs of functions (f_1,f_2), where f_1 and f_2 acts only on ϵ_1 and ϵ_2, respectively. From (<ref>) we get f_1(ϵ_1)= ln(ϵ_1) and f_2(ϵ_2)= ϵ_2.  These functions are easily gleaned, for each of the 33 channels, from Fig.<ref> and Appendix B.  They are either f(ϵ)=ϵ,ϵ^-1, ln(ϵ) or the constant 1. \nAll 33 channels, with the exception of the following 7 channels χ_3,4^P^OUT,S^IN,  χ_4^S^OUT,P^IN, and χ_7,8,9,13^P^OUT,P^IN, use one pair (f_1,f_2). Channel  χ_8^P^OUT,P^IN involves 3 pairs, whereas the other 6 from the exceptions use 2 pairs. Some examples are presented in Tab.<ref>. \nThese channel-dependent permittivity functions are universal for a bilaminar structure, the distinction between devices with the same geometry being captured by the specific values of their arguments, ϵ_1 and ϵ_2. It is worth noting that, for a given IN-OUT polarization pair, the set of functions are uniquely specific to a channel. This property can thus be used to name a channel. For example, Channel 3 in Fig.<ref> may bare the name SS(ln(x),x).\n\n\n\n§ C-SCALING\n\n\nThe transfer matrix elements get simpler once the influence of the discreteness  along the z-axis, c, is embodied into the scaling of the unit cell \n\n    x = c x^',y=c y^'.\n\nThe frequency was already c-scaled in (<ref>).\nAll parameters  become c-scaled l_x/y = c l_x/y^',\np_x/y= c^-1p_x/y^'.  Scaling a χ channel-function is equivalent to multiplying it by a power of the scaling parameter c. For example, the c-scaling effect on (<ref>) is\n\n    χ_3^InS,OutS(x,y,p_x,p_y)=c^-4χ_3^InS,OutS(x^',y^',p_x^',p_y^').\n\n\nIn the continuum (x,y)-plane the discrete Fourier transform becomes an integral, as (a b)/((a L_x) (bL_y))→ (dx dy)/(l_x l_y).\nIn the scaled variables, the Fourier transform of the χ channel-function\n\n    (l_x^'l_y^')^-1∫_0^l_x^'dx^'∫_0^l_y^'dy^'  e^i q_x^'  x^' e^i q_y^' y^'χ(x^',y^',p_x^',p_y^')\n\nis a function of q_⊥^'=p_⊥^'IN-p_⊥^'OUT where\np_x/y^'IN/OUT=2π( M_x/y^IN/OUT+ξ_x/y)(l_x/y^')^-1\nwith 2πξ_x/l_x^' and 2πξ_y/l_y^' being equal to Ωsin(θ)cos(ϕ) and Ωsin(θ)sin(ϕ), respectively.\n\nFor 𝒵-factors, the c-scaling appears in the argument of φ_z\n\n    φ _z,IN   =   φ_z(1-2^-1Ω ^2+2^-1(p_x^'2+p_y^'2)).\n\nFor φ _z,OUT the argument contains p_⊥^'OUT.\nBelow, we drop the prime notation for the c-scaled parameters, understanding that all variables are c-scaled.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe advantage of scaling is that the  c-monomial from  χ and its corresponding  𝒵-factor cancel, rendering a c-independent formula for a channel.\n\n\n\n§ POLYGONAL TESSELLATION PATTERNS\n\n\nThe transfer matrix elements, for the xy-continuous limit, are reduced at this point to the computation of 2-dimensional Fourier transforms of functions defined on the unit cell. To push forward the project of finding analytical closed-form formulas, we show that, in the general case, the Fourier transforms for all channels can be completely solved for polygonal subdomains. The approach and the notations for the general formulas are exemplified using a pattern,  Fig.<ref>, which we will call π-π-rig. The unit cell is a square with corners positioned at (±π,±π), in length units chosen for a desired frequency band. Inside the unit cell sits an inner square. Fig.<ref> shows two inner squares, one located on plane 1, whereas the other on plane 2, both defined in Fig.<ref>. The corners of the unit cell are not visible in Fig.<ref> to save the space for the information pertaining to the inner squares. In the foreground, the square on plane 2 has its vertices labeled B_i,j, i=± 1,j=± 1 positioned at (±π/2,±π/2). In the background, the square on plane 1, with vertices A_i,j, is rotated counterclockwise by an angle α. For α=0, the squares' vertices coincide. There are two kinds of points in Fig.<ref>. Points like A_i,j and B_i,j from plane 1 and plane 2, respectively, are called  real . In contrast, we call virtual those that appear as intersection points, like D_1, the origin O and Δ_1. All points, real and virtual, have associated with them a set of unit vectors. Take for example the origin O. There are four segments that originate at O. One is the segment OA_1,1 which carries a unit vector denoted μ̂_1 in Fig.<ref>. Then  μ̂_2, μ̂_3 and  μ̂_4 are along  OB_1,1, OA_-1,-1 and  OB_-1,-1, respectively. All tails of these unit vectors sit on point O. From the same point O, originates another set of four unit vectors λ̂_i, i=1,… ,4 in such a way that each pair (λ̂_i,μ̂_i) is orthogonal and each triplet (λ̂_i,μ̂_i, ẑ) is right-oriented.\n The last geometrical parameter is related to the choice of a frequency band, say in GHz or THz, which scales the device's units to  mm or μm, respectively. Versus this unit of length we define a unitless thickness parameter t\n\n    t=[1 unit](c  [unit])^-1.\n\t\nAlthough the frequency ω and the dimensions l_x,l_y are fixed in the chosen units, the c-scaled parameters change with t. As the laminae get thinner the scaled unit cell (l_x^', l_y^') and the probing wavelength λ^' get larger, λ^'=tλ [unit]/1 [unit], whereas the probing frequency Ω slides into lower regions,  \nΩ=2 πλ^'-1.  \n\nThe increase of the scaled unit cell repositions the coordinates of the vertices, but do not change the unit vectors (λ̂,μ̂). \n\nThe coordinates of all points, real and virtual, together with the orientations of all unit vectors and a choice of the thickness parameter comprise the geometrical data for computing the Fourier transformation of any polygonal tessellation. The other data come from the jumps of the  permittivities across polygonal segments. For example, for point O in Fig.<ref> the relative permittivity pair (ϵ_1R,ϵ_2L) appears towards to tip of λ̂_1, i.e. on the right-side looking along μ̂_1. The pair (ϵ_1L,ϵ_2L) sits towards the tail of λ̂_1, i.e. on the left-side of μ̂_1. As we cross μ̂_1 walking in the direction of λ̂_1, slightly above point O,  the change in the relative permittivities introduces  a jump\n\n    (Δ f_1f_2)_O,μ̂_1= f_1(ϵ_1R)f_2(ϵ_2L)-f_1(ϵ_1L)f_2(ϵ_2L),\n\t\nwhere (f_1,f_2) is a channel-specific pair of permittivity functions as in Tab.<ref>.\n\n\n\n\n\n\n\n\n\n\n\n\nThe Fourier transforms for the χ channel-functions include both the geometrical configuration and the permittivities jumps.\n In (<ref>) we show, as an example, the result of the Fourier transform, ℱ(χ), of  the third channel for OutS,InS and for the specific case q_⊥·μ̂≠ 0 for all μ̂,\n\n    ∑_(V_12,μ̂)e^i (q_⊥· V_12)_2 (p_⊥·μ̂_1)(p_⊥·μ̂_2) \n    ( q_⊥·μ̂_2/μ̂_1·λ̂_2)( q_⊥·μ̂_1/μ̂_2·λ̂_1)\n    Δ (ϵ_2lnϵ_1)_μ̂W·λ̂/W· q_⊥1/q_⊥·μ̂ -\n    ∑_(V_12,μ̂)e^i (q_⊥· V_12)_3 (p_⊥·μ̂_1)(μ̂_1·λ̂_2) \n    ( q_⊥·μ̂_2/μ̂_1·λ̂_2)^2( q_⊥·μ̂_1/μ̂_2·λ̂_1)\n    Δ (ϵ_2lnϵ_1)_μ̂W·λ̂/W· q_⊥1/q_⊥·μ̂.\n\t\nFor each virtual vertex V_12 from Fig.<ref>, the sum covers all four μ̂'s associated with it. The indices 1 and 2 refer to the line from plane 1 and 2, respectively. In this formula we are free to choose one pair (μ̂_1,μ̂_2) of unit vectors along line 1 and line 2, out of all four possible choices of the pairs  exiting V_12. The result is independent on the choice of the pair because the terms are invariant to the transformation μ̂_1→ -μ̂_1 or μ̂_2→ -μ̂_2.\n\nThe Fourier transform in (<ref>) depends on p_⊥, i.e.  p_⊥^IN, because the channel's χ-function (<ref>) depends on it. In addition, the transform is naturally a function of the  q_⊥, (<ref>).  The first sum in (<ref>) displays the quadratic dependence on p_⊥ as a dot product, invariant to rotations of the (x,y) coordinate system. An invariant form also appears for the second sum, which contains the linear dependence on  p_⊥. In this formula, the variables q_⊥,p_⊥ and V_12 are c-scaled and depend on the thickness parameter t. As we announced before, we do not carry the primed symbol, (<ref>), anymore.\nIn the next section we lay down the Fourier transform results, with their proofs left to Appendices D to H.\n\n\n\n§ FOURIER TRANSFORMS FOR THE Χ-CHANNEL-FUNCTIONS\n\n\n\n We encounter four types of integrals on the unit cell, based on the number of derivatives m^1=(m_x^1,m_y^1) and m^2=(m_x^2,m_y^2) being zero or not\n\n\n\t\n  (00). ∬ dx dy (f_1)(f_2) e^q_⊥· r_⊥, m^1=0,m^2=0,\n\t\n  (10). ∬ dx dy (∂_m^1f_1)(f_2) e^q_⊥· r_⊥,  m^1≠ 0, m^2= 0,\n\t\n  (01). ∬ dx dy (f_1) (∂_m^2f_2) e^q_⊥· r_⊥,  m^1= 0, m^2≠ 0,\n\t\n  (11). ∬ dx dy (∂_m^1f_1)(∂_m^2f_2) e^q_⊥· r_⊥,  m^1≠ 0, m^2≠ 0.\n\n\nThere are three cases for (00), which depend on the relation between the geometry of the device, expressed by the set of vectors μ̂ and the mode-scattering vector q_⊥. For case  (1), q_⊥·μ̂≠0.\nCase (2) consists of q_⊥·μ̂=0  and  q_⊥≠ 0, which means that q_⊥=±λ̂q_⊥. Finally for (3) q_⊥=0.\n\nThe formulas for (00), from (<ref>) and (<ref>), are written on purpose as a sum of terms contributed by each pair (V,μ̂). This is akin to a potential theory where only the ends of the curve contribute. In addition, also reminiscent of a potential theory,  gauge vectors appear in the solution. They are the same for all pairs (V,μ̂) and their arbitrariness helps eliminating all singularities that may appear in the denominators. The gauge vectors are denoted as W and 𝒟, and can be arbitrarily chosen with the provision that \nW· q_⊥≠ 0 and 𝒟·μ̂≠ 0.\nThe jump in ϵ, as the vector μ̂ is traversed along λ̂, is captured in (Δ f_1f_2)_μ̂,\nas exemplified in (<ref>).\n \n \n\n\n\n\n\n\nOutside the unit cell we place a fictitious material with ϵ=0 to get, for the (00) integrals, the correct terms generated by the unit cell boundaries. \n\nThe (00) integration formula for a polygonal tessellation of the unit cell, for cases (1) and (2), is\n\n    ∬_ dxdy (f_1f_2) e^i q_⊥· r_⊥=\n     ∑_V,μ̂e^i q_⊥· V1/q_⊥·μ̂ W·λ̂/W· q_⊥ (-Δ(f_1f_2))_μ̂ +\n     ∑_V,μ̂e^i q_⊥· V(i μ̂· V) W·λ̂/W· q_⊥ (-Δ(f_1f_2))_μ̂ .\n\t\nThe first and the second sum applies for case(1) and (2), respectively.\nFor (00) in case (3) we need to use two gauge vectors. The W is the same as before, whereas 𝒟 is specific for this case and comes from taking the limit s→ 0 for q_⊥=s 𝒟. This formula,as proven in Appendix E, is independent on the choice of 𝒟 \n\n    ∬_ dxdy (f_1f_2) =\n    ∑_V,μ̂1/2 (i 𝒟· V)^2 1/𝒟·μ̂ W·λ̂/W·𝒟 (-Δ (f_1f_2))_μ̂ .\n\nWe intentionally drafted the (00) Fourier transforms as a sum of contributions from vertices. This format can be handed on to the next integrals, (01), (1,0) and (1,1), in a consistent manner. The (00) integral appear in other works <cit.>,<cit.>, but as a sum over the edges of the polygon. \n\nFor the formulas that follow, we will list only the contribution of a pair (V,μ̂), the summation being understood.\n\n\n\n§  FOURIER TRANSFORMS FOR PRODUCT OF DERIVATIVES OF TYPE (01), (10) AND (11)\n\n\nThe result for the (00) case is now used to generate the integrals for which a derivative acts on at least one function. The procedure implies two steps. The first step is to compute \n\n    ∬_ dxdy f_1(r_⊥+δ r_1) f_2(r_⊥+δ r_2) e^i q_⊥· r_⊥=   \n    Int(δ x_1,δ y_1,δ x_2,δ y_2)\n\nas a function of two independent translations, δ r_1 and δ r_2, on plane 1 and plane 2, respectively. These translations change the position of a vertex V \n\n    V_translated=V-τ_x^1δ x_1-τ_y^1δ y_1-τ_x^2δ x_2-τ_y^2δ y_2.\n\t\nThe four vectors τ depend on the vertex V being subjected to a free or constraint translation, which will be defined subsequently. If the vertex is associated with a free translation, we have τ_x^1=τ_x^2=x̂\tand τ_y^1=τ_y^2=ŷ. \nA vertex at the intersection of two lines from different planes,  subjected to a constraint translation, moves to\n\n    (V_12)_translated=V_12-δ r_1·λ̂_1/μ̂_2·λ̂_1μ̂_2-δ r_2·λ̂_2/μ̂_1·λ̂_2μ̂_1,\n\nwhere μ̂_1 and μ̂_2 represent the directions of the two intersecting lines situated on plane 1 and 2, respectively. For constraint translations, the vectors τ^1 and τ^2 can be extracted from (<ref>).\nIn what follows we associate vertices  V_1  and V_2 that are exclusively situated either in plane 1 or 2, respectively, to a free translation. For a  V_1-type vertex τ^2=0 and, in reverse, τ^1=0 for a  V_2-type.\nVirtual vertices V_12 are associated to a constraint translation.\nThe sets V_1, V_2 and V_12 are exemplified in Fig.<ref>.\n\nFor the second step, once the function Int(δ x_1,δ y_1,δ x_2,δ y_2) is at hand, we compute the rest of the integrals by taking its derivatives\n\n    ∬_ dxdy (∂_x^m_x^1∂_y^m_y^1f_1(r_⊥))(∂_x^m_x^2∂_y^m_y^2f_2(r_⊥)) e^i q_⊥· r_⊥\n    \n    =∂_δ x_1^m_x^1∂_δ y_1^m_y^1∂_δ x_2^m_x^2∂_δ y_2^m_y^2Int\n\n at δ x_j,δ y_j=0, j=1,2. The results are listed below and the details follow in Appendices D to H.\n\nUnlike for the (00) integrals, here the unit cell boundaries do not generate any terms, because the derivative  of a permittivity function is zero across the unit cell boundaries.\n\nFor m^1+m^2≠0 and case (1), q_⊥·μ̂≠0, the contribution of (V,μ̂)  is \n\n    e^i (q_⊥· V)  \n    \t\t(-i q_⊥·τ_x^1)^m_x^1\n    \t\t(-i q_⊥·τ_y^1)^m_y^1   \n    \n    \t\t(-i q_⊥·τ_x^2)^m_x^2\n    \t\t(-i q_⊥·τ_y^2)^m_y^2   \n    1/q_⊥·μ̂ W·λ̂/W· q_⊥(-Δ(f_1f_2)_μ̂).\n\nFor case (2), q_⊥·μ̂=0, the contribution of (V,μ̂) is\n\n    d/ds|_s=0 e^i (q_⊥+s μ̂)· V)  \n    \t(-i (q_⊥+s μ̂)·τ_x^1)^m_x^1\n    \n    \t(-i (q_⊥+s μ̂)·τ_y^1)^m_y^1\t\t\t\t\n    \t(-i (q_⊥+s μ̂)·τ_x^2)^m_x^2\n    \n    \t(-i (q_⊥+s μ̂)·τ_y^2)^m_y^2W·λ̂/W· q_⊥(-Δ(f_1f_2)_μ̂).\n\nFor case (3), q_⊥=0, the contribution of (V,μ̂) is\n\n    1/2d^2/ds^2|_s=0 e^i (s𝒟· V) s^m_x^1+m_y^1+m_x^2+m_2^2\n    \n    \t(-i 𝒟·τ_x^1)^m_x^1\n    \t(-i 𝒟·τ_y^1)^m_y^1\t\t\t\t\n    \t(-i 𝒟·τ_x^2)^m_x^2\n    \n    \t(-i 𝒟·τ_y^2)^m_y^2W·λ̂/W·𝒟(-Δ(f_1f_2)_μ̂).\n\n\nThe transfer matrix for a polygonal tessellated bilaminar non-magnetic structure, continuous in the x and y directions, is completely solved at this point.  We are moving to test the theoretical results by comparing our closed analytical formulas for the π-π-rig structure, to numerical results obtained from a high-performance analysis software package <cit.>. Complex symbolic computations were handled by <cit.>.\n\n\n\n§ EVANESCENT RESONANT MODES BY OPTIMIZATION DESIGN\n\n\nThe intent is to design-optimize a dielectric structure from Fig.<ref> such that a subset of evanescent Bloch-Floquet modes (M_x,M_y)≠0 acquire large scattering matrix elements at a specified frequency. Such an excited resonant mode propagates along the plane (x,y) at a frequency smaller than its Rayleigh frequency. Specifically, in the frequency range under study, 37 GHz to  50 GHz, the optimization function is based on four modes. Two modes, (0,0) and (-1,0), propagate, and two other modes, (0,± 1), are evanescent. The goal is to find a set of dielectric constants for which the modes (0,± 1) resonate.  To excite the resonant modes, the plane wave (0,0) coming from z-min lands at angles θ=17.5^∘ and φ=0^∘  on the face A of the π-π-rig oriented at α=45^∘. The thickness of each of the two laminae is\nc=0.25 𝚖𝚖.\nThe design-objective-function, constructed from the analytical formulas for the transfer matrix elements, selects a point in the 6-dimensional dielectric space ϵ _1B= 4.99, ϵ _2B= 2.96, ϵ _1L= 7.60,\nϵ _2L = 5.66, ϵ _1R=5.93 and ϵ _2R= 1.63. \n\nTechnologically, this point may not be easily implemented, although we constrained the dielectric constants to be less than 12. Instead, we focus  on studying the predictions  put forward by the analytic solution and compare them against numerical results from a high-performance software package. \n\nThese predictions are grouped in three categories. The first category, inspired by topological photonics, is related to robustness of the resonant modes with respect to the change of the dielectric constants, quantified as a map from the real to integer numbers.\nThe second is based on resonant frequency identification, whereas the third is focused on high Q-factors and the use of complex frequency plane to estimate the Fano-Lorentz spectral line shape for the resonant modes. In what follows we confine ourselves to evanescent S-polarized resonant waves excited by the (0,0) S-polarized incoming wave. Only the main results are presented below, with specific details on the design optimization being summarized in  Appendix I. \n\n\n\n§ A  MAP FROM THE REAL TO INTEGER NUMBERS\n \n\nThe resonances in the scattering matrix elements appear as zeros of the determinant of the T^-,- matrix, (<ref>). The minimal T^-,- matrix can be reduced to just the matrix element T^-,-_Sm,Sm, the zeros of which give the first approximation for the resonant frequencies. To see that, take a  2× 2 transfer matrix  built only from the set T^±,±_Sm,Sm and look at the resonance for the mode Sm as a singularity for which  (<ref>) has a non-zero solution if all coefficients but (DIR,POL,BF)=(+,S,m) and  (dir,pol,bf)=(-,S,m) are zero. It turns out that this simple approximation has predictive power.\nAs the dielectric constants change their values, the  zeroes of T^-,-_Sm,Sm appear or disappear, creating or destroying a resonance. We study this phenomenon for variable ϵ_1B=ϵ_2B, running from 1 to ∞, with the rest of the dielectric constants kept constant at the optimized values. \n\n\nHence, map ϵ_1B=ϵ_1B to the number of modes m=(M_x,M_y) for which the diagonal transfer matrix element T^-,-_S m,S m, Appendix C, has at least one zero on the frequency axis in the interval [0,60] GHz,\n\n\n\n\n    ϵ∈ℝ↦number of modes with zeroes.\n\t\nThe analytic formulas position the zeros as in Fig.(<ref>) and Fig.(<ref>)\n\n\n\nAs ϵ_1B=ϵ_2B increases from 1 to ∞, Fig.<ref>, the number of modes for which T^-,-_S m,S m crosses the real frequency axis  increases in discontinuous steps, then decreases as the dielectric constant gets above 30. It reaches a plateau of 36 modes as ϵ→∞. Fig.<ref> shows the position in the (M_x,M_y) plane of the 53  and 36 modes for ϵ_1B=ϵ_2B=35 and ∞, respectively. Two adjacent steps in  Fig.<ref> have two distinct topological invariants, i.e. distinct  number of resonant modes. The boundaries of these steps  are not uniformly distributed on the horizontal dielectric axis. Knowing the distribution of these boundary values may play a significant role in assembling compound devices, which are built by bringing together two structures with distinct topological invariants.\n\nNumerical simulations confirm that 5 modes resonate for ϵ_1B=ϵ_2B=1 and 53 for ϵ_1B=ϵ_2B=35. \n\t\n\nOne step deeper into the analysis of the zeros is provided by  propagation along channels. Channel 1 SS does not depend on the dielectric constants and  is positive for any frequency and direction p_⊥, Fig.<ref>. Some other channels have to be negative for T^-,-_S m,S m to cross the frequency axis. Interestingly, each channel keeps a constant sign  as a function of frequency, namely (1,+),(2,-),(3,-),(4,+) and (5,-), noticeable in  Fig.<ref> to Fig.<ref>.\n\n\n\n\nFrom Fig.<ref> we see that Channel 3 is two orders of magnitude smaller than the other ones, so it does not lead to creation of destruction of a zero, but contributes to its location on the frequency axis.\n\n As  ϵ_1B=ϵ_2B increases the negative contribution starts to dominate the positive one and two phenomena appear: the zeros are pushed into lower frequencies and a variable number of modes start to cross the frequency axis. This explains the increase in the number of resonant modes as ϵ_1B=ϵ_2B increases.\n\n\n\n\n\n\n §.§ Zeroes of the diagonal matrix elements of T^-,-\n\n\nA distinctive advantage of analytical formulas over the numerical approaches is in the study of infinite limits\n\n    ϵ_1B =ϵ_2B→∞.\n\t\n\nIn this limit, the zeros of the transfer matrix elements\nT^-,-_S m,S m(Ω)=0, appear at small Ω≅ 0. So, approximate\n1+Ω ^2 φ _z,OUT≅1 to get, from Appendix C,\n\n    (T^-,-_S m,S m)_Channel 1≅1/φ _z,OUT^3 ,\n\n\n    (T^-,-_S m,S m)_Channel 2≅-Ω ^2 /8 φ _z,OUT^2 (1-φ _z,OUT^2)( 6 ϵ _1B),\n\n\n    (T^-,-_S m,S m)_Channel 3≅0,\n\n\n    (T^-,-_S m,S m)_Channel 4≅Ω ^4 /φ _z,OUT(1-φ _z,OUT^2)(  ϵ_1Bϵ_2B/√(2)),\n\n\n    (T^-,-_S m,S m)_Channel 5≅-Ω ^2 /8 φ _z,OUT^2 (1-φ _z,OUT^2)( 6 ϵ _2B).\n\nThe equation\n(T^-,-_S m,S m)=0, under the above approximations and using the notation ϵ_1B=ϵ_2B=ϵ, turns into\n\n    -3/2Ω ^2φ _z,OUTϵ+1/√(2)Ω ^4φ _z,OUT^2ϵ^2+1-φ _z,OUT^2=0.\n\nAs ϵ→∞, the zero of T^-,-_S m,S m(Ω)=0 tends to zero in such a way that\tΩ^2ϵ→finite number. In terms of  this finite number, which we call X, the equation becomes  \n\n    -3/2X φ _z,OUT+1/√(2)X ^2φ _z,OUT^2+1-φ _z,OUT^2=0.\n\nThe requirement for X to be positive imposes a constrain on mode numbers M_x and M_y, for which the diagonal transfer matrix elements posses a zero on the real frequency axis, in the limit  ϵ_1B =ϵ_2B→∞\n\n    φ_z (1/2(M_x^2/t^2+M_y^2/t^2)+1) ⩾1/4√(16-9 √(2)).\n\nThis inequality is valid for 36 modes, which are visible in Fig.<ref>.\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\n\n\n§ ANALYTICAL PREDICTION OF THE RESONANT FREQUENCY\n\n\n\n\n §.§ Thinner the lamina higher the precision\n\t\n\nFrom counting the number of zeros for many modes, we change the focus, Table<ref>, to predict the position of the zero, Ω_theory, of T^-,-_S m,S m for the optimized design  modes, (0,± 1).\nBoth modes have the same zero at φ=0^∘. The resonant frequency depends on the thickness of the structure's lamina, c. All the other parameters are kept constant.\n\n\nNotice that Ω %-error=100Ω 𝚗𝚞𝚖-Ω  𝚝𝚑𝚎𝚘𝚛𝚢/Ω 𝚗𝚞𝚖, which measures the distance to the numerical simulation result Ω 𝚗𝚞𝚖, <cit.>, decreases with the decrease of the width c. This is to be expected because as c→ 0 the discrete approximation of Maxwell's equations improves. \n\n\n\n\n\n §.§ The influence of the rotation angle α on the resonant frequency\n\n\nOut of the 5 channels for transfer of the SS-polarization, only Channels 3 and 4 depend on the angle α. \nAs the angle α is varied, the resonant frequency for the degenerate modes (0,-1) and (0,1) changes in the vicinity of the frequencies determined at α =45^∘, Figs.<ref>,<ref>.  Although the relative changes are small, with an estimated linear slope of -0.96 MHz/deg and -2.46 MHz/deg, respectively, the slopes are close to the ones from the numerically simulated data.\n\n\nThe systematic shift between the theoretical and numerical values, described for α=45^∘ in Tab.<ref>, is the same for all angles α.\n\nThe study of the wedge effect, that comes out for 0^∘<α<10^∘ or for 80^∘<α<90^∘, will be covered in a different manuscript.\n\n\nThe transfer matrix elements depend on the logarithm of the permittivities, so we need to test the formulas for a metal, which exhibits  complex permitivitty. \nWe take ϵ _2B=  Johnson-Chrysti gold and find a local minimum of an objective function in the 5-dimensional space of the other dielectric constants.\nThe frequency range is now placed in the infrared at f=286.2 THz. \nThe optimization process to find the five unknown dielectric constants is similar to that for the all-dielectric case. This time, though, the objective function is based on one propagative mode (0,0) and one evanescent mode  (-1,0), both P-polarized. The position and shape of the theoretical resonance were confirmed by numerical simulations performed via <cit.>. \n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\n\n\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\n\n§ A HIGH Q-FACTOR BILAMINAR STRUCTURE\n\nTo study the theoretical prediction for the amplitude we choose a series of  resonances with large Q-factors. The first has Q=4.8× 10^6 at -3 dB, Fig.<ref>. The theoretical values were computed using a 20× 20 transfer matrix. Two systematic shifts, f_shift and t_shift, are needed to superpose the theoretical formula 20log_10t^max,min_S(0,1),S(0,0)(f-f_shift)+t_shift on numerical simulations. For Fig.<ref>,  f_shift=3.2 10^-5 GHz and t_shift=-3.9 dB. The lamina being thin, c=0.01mm, the shifts are small with respect to the frequency and amplitude at resonance.\n\n\n\t\n\t\n\t\n\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\t\n\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\n\t\n\nVariable φ offers another venue to study the amplitude around a high Q-factor resonance. The modes (0,-1) and (0,1) are degenerate for φ=0^∘, having the same Rayleigh and resonant frequency. As the angle φ slides away from 0^∘, the scattering amplitude of the mode S(0,-1)  decreases, whereas the scattering amplitude for the mode S(0,1) remains excited at high dB levels, Fig.<ref>.\n\nThe same trend was confirmed by numerical simulation. Table<ref> contains additional data for the comparison between theory and numerical simulations for the high Q-factors.\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ COMPLEX-FREQUENCY PLANE AND THE WEIGHTED FANO-LORENTZ LINE SHAPE\n\n\nMoving beyond predicting the position of the resonant frequency and its amplitude, the complete analytical solution for transfer matrix provides a simple but meaningful approximation for the resonant line shape\n\n    t^min,max_S(0,1),S(0,0)=Cofactor_S(0,0),S(0,1)(T^-,-)/Det(T^-,-)\n    ≅ρ e^iΦf-f_zero/f-f_pole,\n\nwhere the zero and the pole are located in the complex frequency plane, both in the vicinity of  the real resonant frequency, <cit.>. The meromorphic approximation (<ref>) has a natural structure of dipoles with the monopoles placed at f_zero and f_pole, Fig.<ref>. \n\nTo estimate the pole and the zero, we use φ_z(ζ) already defined for complex values of ζ. Here we take advantage of the continuity at the real ζ-axis of φ_z(ζ) coming from below,  Im(ζ)⩽ 0. This translates, for our case  of φ=0^∘ and M_x=0, into the continuity from above, Im(Ω)⩾ 0,  of the cofactor and the determinant at the real Ω-axis. Both functions of Ω are thus extended into the lower half of complex frequencies plane from the values they take above and on the real frequency axis, Appendix J. \nAfter this analytic continuation, the zero-pole model, extracted from a  20× 20 matrix t^min,max , is\n\n\n\n\n    t^min,max_S(0,1),S(0,0)=0.053  e^-2.732 i f-f_zero/f-f_pole  ,\n\nwith frequency, in GHz, given by\n\n\n\n\n\n    f_zero=40.843+ 0.027 i \n    \n    \tf_pole=41.286- 0.009 i\n\nFollowing <cit.>, we express the scattering line shape t^min,max_S(0,1),S(0,0)^2 in different forms. The first is \n\n    t^min,max_S(0,1),S(0,0)^2(x)=ρ^2(δ+x)^2+γ^2/1+x^2\n    \n    \t=2.81× 10^-3(-47.47+x)^2+8.55/1+x^2,\n\nwhere x=-f-Re(f_pole)/Im(f_pole), δ=-Re(f_pole-f_zero)/Im(f_pole), and γ=Im(f_zero)/Im(f_pole).\nThe second form is connected with the presence of a continuum background\n\n    t^min,max_S(0,1),S(0,0)^2(x)=A_0+F_0(ν+x)^2/1+x^2.\n\nWe found two solutions for the parameters A_0,F_0 and ν. Namely,\nA_0=1.06× 10^-5, F_0=2.8× 10^-3 and ν=-47.65, or\nA_0=6.37, F_0=-6.36 and ν=2.09× 10^-2. This form is thus ambiguous as is also noted in  <cit.>.\n\nThe third, and the final format, presents the resonant line shape as a weighted sum of a Fano and Lorentz line shapes\n\n    t^min,max_S(0,1),S(0,0)^2(x)=A (η(δ+x)^2/1+x^2+(1-η)1/1+x^2).\n\nwhere the weight parameter is η=1/(1+γ^2)=0.105 and A=ρ^2 (1+γ^2)=0.027.\n\nThe Fano line shape, which is the first term in (<ref>), contributes 10.5% to the resonance line shape.\n\n\n\n§ CONCLUSION \n\nTo sum up, we show how to derive the transfer matrix using  Pendry-MacKinnon discrete Maxwell's equations. Space is an orthogonal lattice with lattice constants a,b and c on the x,y and z directions, respectively. The z-axis is singled-out as the transfer axis. A finite number of parallel discrete laminae of thickness c are  placed perpendicular along the z-axis. Each lamina can carry any non-magnetic, frequency-dependent pattern, independent from each other. The method we introduce computes, in an analytical closed form, the transfer matrix elements  for all Bloch-Floquet modes. The computation starts with a large number of path-operators that transfer the field from the first to the last lamina. Fortunately, many of these path-operators come up with a zero contribution and the results of the paths that contribute can be further grouped together in simple terms, which we call channels. Each channel has the interesting attribute of being a product of two terms that bear distinctive features. One term, called the channel's χ-function, depends on the permittivities, whereas the other term, called the channel's 𝒵-factor, does not. We computed the χ and the 𝒵-factors for a bilaminar device for all pairs of input output polarization. \n\nTo exemplify the building up of a transfer matrix element consider, in continuum case of a,b→ 0, the P polarization at the input and the S at the output. The method for the discrete case is similar to the continuum, except that the χ functions are discrete like in (<ref>). For this (P,S) pair of polarization the transfer matrix element is a sum over 5 channels, having their χ-functions displayed in Fig.<ref>. For Channel 2, as an example, the  χ-function is a polynomial in  (p_x,p_y) given by p_y (-∂_xϵ_2)+p_x ∂_yϵ_2, for any permittivity pattern. The transfer matrix elements depend on the Fourier transforms of the  χ-functions, which contain all Bloch-Floquet modes through the variable q_⊥=p_⊥-p_⊥^OUT. Next, the choice of a pair of  ± propagation direction decides the specific form of the 𝒵-factor. For example, if we are looking for the matrix element T^-,-, then use Table <ref> and divide its entries by OUT  to normalize the 𝒵-factor. \n\nThe rule to obtain the 𝒵-factors for other directions  is to change IN- into IN+ and, at the same time, change\nφ_z,IN→φ_z,IN^-1, and c→ -c, before moving to the c-scaled variables. The same rule applies for OUT- into OUT+. However, this rule does not apply for Channel 1, for both  SS and PP, for which all unnormalized  𝒵-factors are tabulated in Appendix B Tables <ref> to <ref>. Finally, the matrix element is a sum over the product of the Fourier transform of  χ and the 𝒵-factor for  all channels that belong to the selected  polarization pair.\n\nA  valuable way of proceeding further is to extend to range of applications. One possibility is to exploit Fig.<ref> and bring together two devices with distinct number of resonant modes, and examine the propagation along different channels at the interface. Other applications may be connected to metasurfaces <cit.>, energy harvesting <cit.>, <cit.>,<cit.>, leaky-wave theory <cit.> and frequency-selective surfaces <cit.>.\n\n\n\n\n§ ACKNOWLEDGMENT\n\n One of us, O.L., wishes to thank the Fulbright Commission for a Fulbright Scholarship grant and the host Victor Lopez-Richard from Universidade Federal de São Carlos, SP, Brazil, where part of this work was done. In addition, O.L. thanks his colleague Mariama Rebello de Sousa Dias for many conversations during the course of this research. Both of us wish to thank Dr. Andrei Silaghi, with Continental Automotive Romania SRL, for facilitating the access to numerical simulation using CST microwave studio <cit.>.\n \n\n\n\n\n\n\nAppendix A: A summary of symbols with explanatory notes\n\n1.The discrete position vectors are n=(a n_x,b n_y,c n_z) and n_⊥=(a n_x,b n_y). In the continuous, a,b→ 0, the position  n_⊥ becomes r_⊥=(x,y).\n\n2. The vector p_⊥=(p_x,p_y) appear in the formulation of the plane wave basis, |Ψ_S/P,p_⊥^±⟩ e^± i p_z n_z c e^- i ω t where |Ψ_S/P,p_⊥^±⟩=|p_⊥,S/P,±⟩e^i p_⊥ n_⊥, (<ref>). To distinguish between two Bloch-Floquet modes, one at the input IN and the other one at the output OUT, we write p_⊥^IN and p_⊥^OUT, respectively. To keep the final formulas for the transfer matrix elements simple, we use p_⊥ instead of p_⊥^IN, as is the case in Fig.<ref>.\n\n3. Connection between p_x and k_x^E = (i a)^-1(e^i a p_x-1), (<ref>).\n\n4. The unitless frequency Ω is defined by Ω v_0=ω c, (<ref>)\n\n5. The p_z component appears in φ _z=e^i c p_z. φ_z(ζ)=ζ-√(ζ^2-1)e^i/2(arg(ζ-1)+arg(ζ+1)), (<ref>). The arg(ζ) takes values on [-π,π) in such a way  that arg(ζ)=-π if Im(ζ)=0 and ζ<0. The argument ζ is defined in (<ref>).\n\n6. Periodic boundary conditions introduce the modes (M_x,M_y) and the direction (ξ_x,ξ_y) of the mode (0,0) through  (<ref>) and (<ref>).\n\n7. Transfer matrix element T^-,-_m,n are organized in (<ref>). \n\n8. All XY-operators are listed in Fig.<ref>.\n\n9. An example of a discrete χ-function, (<ref>). \n\n10. Discrete Fourier transform of a χ-function, (<ref>).  \n\n11. The Fourier transform goes from space n_⊥ to the mode variable q_⊥=p_⊥^IN-p_⊥^OUT≡ p_⊥-p_⊥^OUT.\n\n12. An example of a 𝒵-factor, (<ref>). \n\n13. Transfer matrix element as a sum over channels, (<ref>).\n\n14. The 𝒵-factors are tabulated in Table <ref> and <ref> to <ref>. \n\n15. Rules to obtain all 𝒵-factors for all directions are presented in  Appendix B. \n\n16. Some examples of  permittivity functions for the continuum (x,y)-plane are in Table <ref>. \n\n17. For the continuum (x,y) case, the χ-functions, the permittivity functions and the polynomial dependence on p_⊥≡ p_⊥^IN are found in (<ref>), Fig.<ref> and Fig.<ref> to <ref>\n\n18. Through  c-scaling,  x = c x^',y=c y^' from (<ref>), the lattice constant c simplifies in the transfer matrix element.\n\n19. Choose a unit of length in accordance with the frequency band under study. Use the thickness parameter t=[1 unit](c  [unit])^-1, (<ref>), to write the transfer matrix element in terms of only unitless parameters.\n\n20. Each vertex for any polygonal tessellation pattern carry a pair of orthogonal unit vectors (λ̂,μ̂). An example is the π-π-rig from Fig.<ref>. \n\n21. The jumps in the relative permittivities are measured across μ̂ in the direction of λ̂, (<ref>). \n\n22. The Fourier transforms of a tessellated pattern, in continuum, from the position space vector r_⊥ to the mode vector q_⊥, are built on (λ̂,μ̂), the permittivities jumps and two constant gauge vector W and 𝒟.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\n\n\n\n\n\n\n\n\nAppendix C: The diagonal T^-,- matrix elements (q_⊥=0) for the π-π-rig  and a,b→ 0.\n\n\n\n\n\n\n\t\n\n\n\n    (T^-,-_S m,S m)_Channel 1=\n    \t-δ _IN,OUT((Ω ^2 φ _z,OUT+1)^2-(φ _z,OUT)^2) /(φ _z,OUT^2-1) φ _z,OUT^3 ,\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\n\n\n\n    (T^-,-_S m,S m)_Channel 2=( 6 ϵ _1B+ϵ _1L+ϵ _1R)\n    \tΩ ^2 (Ω ^2 φ _z,OUT+1)/8 φ _z,IN(φ _z,OUT^2-1) φ _z,OUT,\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\t\n\t\n\t\t\n\t\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\t\n\t\n\t\t\n\t\n\t\n\t\n\t\n\n\n\n\n\n    (T^-,-_S m,S m)_Channel 3=\n    Ω^2/4 π ^2 t^2 (p_x^2+p_y^2) φ _z,IN(φ _z,OUT^2-1)\n    (.\n    \tp_x^2(\n    \t (α )  (α ) ϵ _2B(2 ln(ϵ _1B)-ln(ϵ _1L)-ln(ϵ\n    \t_1R))\n    \n    \t+ϵ _2L(- (α )  (α ) log(ϵ _1B)+3  (α ) log(ϵ _1L)/2\n    \t\t(sin (α )+cos (α ))-( (α )-2)  (α )  (α ) log(ϵ _1R)/2 ( (α )+1))\n    \n    \t+ϵ _2R(- (α )  (α ) log(ϵ _1B)-( (α )-2)  (α )  (α ) log(ϵ _1L)/2 ( (α )+1)+3  (α ) log(ϵ _1R)/2 (sin (α )+cos (α\n    \t\t)))\n    \t.\t)\n    \n    \t+p_x p_y (α ) /sin (α )+cos (α )(ϵ _2L-ϵ _2R) (log(ϵ _1L)-log(ϵ\n    \t_1R))\n    \n    \t+p_y^2 ( .\n    \t (α )  (α ) ϵ _2B(2 log(ϵ _1B)-log(ϵ _1L)-log(ϵ\n    \t_1R))\n    \n    \t+ϵ _2L(- (α )  (α ) log(ϵ _1B)+(3  (α )+2)  (α )  (α ) log(ϵ _1L)/2 ( (α )+1)- (α ) log(ϵ _1R)/2 (sin (α )+cos (α )))\n    \n    \t+ϵ _2R(- (α )  (α ) log(ϵ _1B)- (α ) log(ϵ _1L)/2\n    \t\t(sin (α )+cos (α ))+(3  (α )+2)  (α )  (α ) log(ϵ _1R)/2 ( (α )+1))\n    \t. )\n    \t.\t )\n    \t. ,\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\n    (T^-,-_S m,S m)_Channel 4=-Ω^4/128 φ _z,IN(φ _z,OUT^2-1) \n    (.\n    \t64 ϵ _1Bϵ _2B+16 ϵ _1Bϵ _2L+16 ϵ _1Bϵ _2R+16 ϵ _2Bϵ _1L+16 ϵ _2Bϵ _1R+4 (cos (α )-sin (α )) (ϵ _1L-ϵ _1R) (ϵ _2L-ϵ _2R)/sin (α\n    \t\t)+cos (α )\n     ^2(1/4 (2 α +π ))  (α ) (2 sin (α )+cos (2 α )+3) (ϵ _1B-ϵ _1R)\n    \t(ϵ _2B-ϵ _2L)\n    \t\n    \n    \t-4  (α )  ^2(1/4 (2 α +π )) (ϵ _1B-ϵ\n    \t_1L) (ϵ _2B-ϵ _2L)\n    \t\n    \n    \t+ ^2(1/4 (2 α +π ))  (α ) (2 sin (α )+cos (2 α )+3) (ϵ _1B-ϵ _1L)\n    \t(ϵ _2B-ϵ _2R)\n    \t\n    \n    \t-4  (α )  ^2(1/4 (2 α +π )) (ϵ _1B-ϵ _1R) (ϵ _2B-ϵ\n    \t_2R)\n    \t\n    \n    \t4 (2 tan(α/2)+ (α )) ((ϵ _1B-ϵ _1L) (ϵ _2B-ϵ\n    \t_2L)+(ϵ _1B-ϵ _1R) (ϵ _2B-ϵ _2R))\n    \t\n    \n    \t-4 tan ^2(α/2) tan (α ) ((ϵ _1B-ϵ _1L) (ϵ _2B-ϵ\n    \t_2L)+(ϵ _1B-ϵ _1R) (ϵ _2B-ϵ _2R))\n    \t). ,\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\n\n\n\n    (T^-,-_S m,S m)_Channel 5=\n    \t (6 ϵ _2B+ϵ _2L+ϵ _2R)\tΩ ^2 (Ω ^2 φ _z,IN+1)/8 φ _z,IN^2 (φ _z,OUT-1) (φ\n    \t\t_z,OUT+1) .\n\n\n\n\nAppendix D: Fourier transform of a constant function on a polygon. Case q_⊥≠ 0\n\nStart with the Stokes theorem applied for a polygon in the (x,y)-plane, <cit.>,\n\n    ∬_polygon (∇×F)·dA=∮_right-oriented boundaryF·ds,\n\t\t\nwhere dA=ẑ dx dy. Take the filed F to be of a special case F(x,y)=(ẑ× W) e^q_⊥· r_⊥, with W=(W_x,W_y) a constant 2-dimensional field.\nUse the right-oriented pair (μ̂_j,λ̂_j) to compute, along each segment of the polygon, the right-hand  integral from (<ref>). The integral over each segment gives different results for q_⊥·μ̂_j ≠ 0 or q_⊥·μ̂_j = 0. At this stage in the computations we notice two features\n(i) the sum over segments is written in terms of sums over vertices,\n(ii) we can drop the requirement of using a specific orientation of the polygon by using both μ̂_j and -μ̂_j for the j^th-segment. To accomplish this, if  μ̂_j is associated with the vertex V_j, then associate -μ̂_j with the vertex V_j+1.\nThe result is a vertex-wise formula, with the sum running over the index k that labels the vertices of the polygon \n\n    ∬_polygon dx dy e^i q_⊥· r_⊥=   ∑_k∈vertices±W·λ̂_k/ W· q_⊥ 1/ q_⊥·μ̂_k e^i q_⊥· V_k.\n\t\n\nThe ± is the last remnant of the need of an orientation in the Stokes's theorem. To incorporate this ± into an unoriented polygon, place a permittivity ϵ inside the polygon, ϵ=0 outside and define the change in ϵ like in (<ref>).\n\nThe need for an orientation in the Stokes' theorem is exchange with the need to use a right-oriented pair (μ̂,λ̂). This, in turn, imposes the jump to change sign when μ̂ changes sign,\nwhich makes the ± in (<ref>) to become part of (Δϵ)_μ̂.\nWe thus arrived at the formula  (<ref>).\n\nNote that the four corners of the unit cell contribute to the (00)-type Fourier integrals. For Channel 1, which is permittivity-independent, the corners contribute with jumps  (Δ(f_1f_2))_μ̂ that are equal to ± 1, given that outside the unit cell we work with ϵ=0.\n\n\nAppendix E: Fourier transform of a constant function on a polygon. Case q_⊥= 0\n\nThis integral is the area of the polygon, for which a simple answer is given by the sum of the areas of triangles, each triangle producing a term 1/2ẑ· (V_j+1× V_j). The disadvantage for us is that the vertices V_j+1 and V_J are not separated, as they are in the formula for q_⊥≠ 0.\nStart from (<ref>) and take the limit of q_⊥→ 0 along a selected direction 𝒟\n\n    q_⊥ = s 𝒟→ 0, as  s→ 0.\n\nWe will show that the final result is independent of the choice of the direction 𝒟.\nWith this choice of q_⊥ and 𝒟·μ̂≠ 0 for all μ̂, formula  (<ref>) becomes\n\n    ∑_verticese^i 𝒟· V s∑_μ̂_vertexW·λ̂/W·𝒟1/s(-Δϵ)_μ̂1/𝒟·μ̂1/s .\n\n\n\nIn (<ref>) there is a second-order singularity, s^-2, which we need to eliminate. To do just that, expand the exponential in Taylor series and examine the terms that belong to  μ̂ and -μ̂ oriented along the same edge and notice that the second-order singularity is eliminated. However, a first-order singularity s^-1 came into being. This singularity goes away too once we sum up its contribution along a closed loop.\nOnce the singularity s^-1 is eliminated, we are left, in the limit s→ 0, with one term per segment\n\n    W·λ̂_j/W·𝒟1/𝒟·μ̂_j(-Δϵ)_μ̂_j1/2((i 𝒟· V_j)^2-(i 𝒟· V_j+1)^2).\n\n\nThis term can be placed back into a format that contains two μ̂ vectors per each edge. This is the result (<ref>).\n\nWe  prove that the result thus obtained is independent on the choice of W and 𝒟 by showing that\n(<ref>) is equal to sum of areas of triangles.\nCall the vertices of the j-edge by V_j and V_j+1. Placed at V_j and V_j+1 are (λ̂_j,μ̂_j) and (λ̂_j+1,μ̂_j+1)=(-λ̂_j,-μ̂_j), respectively. \nAlong the computation we use  V_j+1-V_j=μ̂_j l_j, where l_j is the length of the edge. Change the dot product into a cross product,  W·λ̂=(ẑ× W)·μ̂, to prove the equality\n\n\n    W·λ̂_j/W·𝒟1/𝒟·μ̂_j(-Δϵ)_μ̂_j1/2(i 𝒟· V_j)^2+   \n    W·λ̂_j+1/W·𝒟1/𝒟·μ̂_j+1(-Δϵ)_μ̂_j+11/2(i 𝒟· V_j+1)^2=   \n    \n    \t\t(-Δϵ)_μ̂_j1/W·𝒟1/2(ẑ× W)·   \n    (V_j+1-V_j/l_j( 𝒟· V_j)+V_j+1-V_j/l_j( 𝒟· V_j+1))l_j  .\n\n\nThere are four terms in the last line of (<ref>). Two out of these four sum up to zero when we go around a closed loop\n\n\n\n\n\n\nkeeping in mind that (-Δϵ)_μ̂_j is the same for all μ̂_j because we are working for a polygon with one kind of permittivity inside and ϵ=0 outside.\n\nWe are left with the sum of the other two terms, which, by the Binet-Cauchy vector relation, is transformed into a sum of  oriented areas of triangles O V_j V_j+1, where O is some arbitrary origin.\n\n\n\n\n\n\nAppendix F: The integral (00) on a polygonal tessellation of the plane  \n\n\n\n\n\n\n\nIn the tessellated plane, for a selected vertex V and a pair (λ̂,μ̂) associated with this vertex, there are exactly two contributions from the two polygons  that have a common edge along μ̂.\n\n\n\n\n\n\n\n Two permittivity jumps along μ̂ originate from these two distinct polygons, each polygon being surrounded by a medium with ϵ=0. The sum of these polygonal jumps is actually equal to (-Δ(f_1f_2))_μ̂ but on the tessellated structure.\n\n\n\n\n\n\n\nWe arrived at the formula for the polygonal tessellation (<ref>).\n\n\n\n\n\n\n\n\n\nAppendix G: Translation of a virtual point\n\nA virtual point appears at the intersection of a line from plane 1 and another line from plane 2, which are described by r_1=V_12+μ_1μ̂_1 and r_2=V_12+μ_2 μ̂_2, respectively. Parameters μ_1 and μ_2 run on the real axis.\nApply a translation in plane 1, \nδ r_1=(δ x_1,δ y_1), and plane 2,\nδ r_2=(δ x_2,δ y_2), respectively.\nWritten in terms of a new set of  parameters, μ_1^' and μ_2^', the translated lines are \n\n    (r_1)_translated=   V_12-(δ r_1·λ̂_1)λ̂_1+μ_1^'μ̂_1,\n    \n    \t\t(r_2)_translated=   V_12-(δ r_2·λ̂_2)λ̂_2+μ_2^'μ̂_2.\n\nTo compute the position of the translated intersection, (V_12)_translated, solve for μ_1^' and μ_2^' such that (r_1)_translated=(r_2)_translated.\n\n\n\n\n\n\nUse μ̂_2·λ̂_1=-μ̂_1·λ̂_2 and get at the final result (<ref>).\n\n\n\n\n\nAppendix H: Fourier transforms for product of derivatives of type (01), (10) and (11)\n\n\n\n\n\n\n\n\n\n\nWe expand on (<ref>) and (<ref>).\nIn order to simplify the computation of ∂_δ x_1 and others of this kind, for case (2), (i.e. q_⊥·μ̂= 0 and q_⊥≠ 0), compound the product of the two vertex-dependent terms in one exponential\n\n    e^i q_⊥· V(i μ̂· V)=d/d s( e^i q_⊥· V+s i μ̂· V)|_s=0 .\n\t\nFor case (3), q_⊥=0, in a similar way as above, we get\n\n    1/2 (i 𝒟· V)^2=1/2(d^2/ds^2)_s= 0e^i (𝒟· V)s .\n\t\n\n\n\n\t\t\n\t\t\n\n\n\n\n\t\n\t\t\n\t\t\n\t\t\n\n\n\nTo group together the results for case (1) and (3), we found it useful to define a  function  e^i (q_⊥· V)_m, which for  q_⊥≠0 it is equal to  e^i q_⊥· V. For  q_⊥=0 and for any natural number m it is 1/2(d^2/ds^2)_s= 0(e^i (𝒟· V)s s^m). So\n\n\n\n\n\n\n\n\n\n\n    e^i (q_⊥· V)_m =\n    \t\te^i (q_⊥· V)    for all  m,if  q_⊥≠ 0,\n    1/2(i 𝒟· V)^2    if  m=0,and  q_⊥= 0,\n    \n    \t\ti 𝒟· V    if  m=1,and  q_⊥= 0,\n    \n    \t\t1   if  m=2,and  q_⊥= 0,\n    \n    \t\t0   if  m⩾3,and  q_⊥= 0.\n\nThe function, for q_⊥=0, is equal to the term number  2-m,  from the Taylor expansion.\n\nWith the help of this function, the contribution to the type (10)-integral, Section <ref>,\n\n\n\n\n\n\n from a pair from plane 1, i.e. (V_1,μ̂), is \n\n    e^i (𝒟· V_1)_m_x^1+m_y^1 (-i𝒟_x )^m_x^1 (-i𝒟_y )^m_y^1\n    W·λ̂/W·𝒟(-Δ(f_1f_2)_μ̂)1/𝒟·μ̂,\n\nwhere 𝒟 is arbitrary, subject to the condition that 𝒟·μ̂≠0 for all μ̂ in plane 1.\nThe contribution to the type (01)-integral from all real points from plane 2, i.e. V_2, is a mirror image. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe contribution to the type (11)-integral from a virtual point, V_12, under constrained translation has a different aspect, being\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    ∑_all four μ̂^'se^i (𝒟· V_12)_m_x^1+m_y^1+m_x^2+m_y^2   \n    \n    \t\t(λ_1x)^m_x^1\t(λ_1y)^m_y^1\n    \t\t(λ_2x)^m_x^2\t(λ_2y)^m_y^2   \n    (i𝒟·μ̂_2/μ̂_1·λ̂_2)^m_x^1+m_y^1(i𝒟·μ̂_1/μ̂_2·λ̂_1)^m_x^2+m_y^2   \n    W·λ̂/W·𝒟(-Δ(f_1f_2)_μ̂)1/𝒟·μ̂  .\n\nTo avoid carrying over a minus sign and to arrive at the above formula, we use μ̂_2·λ̂_1=-μ̂_1·λ̂_2.\nThe sum, for a fixed virtual point V_12, is over all four μ̂^'s, which have the tail located at V_12.\n\nThe above sum, if needed, can be place in a form which is independent of the gauge vector W. For that, first notice that \n\n    (λ_1x)^m_x^1\t(λ_1y)^m_y^1\n    \t\t(λ_2x)^m_x^2\t(λ_2y)^m_y^2\n    (i𝒟·μ̂_2/μ̂_1·λ̂_2)^m_x^1+m_y^1(i𝒟·μ̂_1/μ̂_2·λ̂_1)^m_x^2+m_y^2\n\nis the same for all four μ̂^'s, which have the tail located at V_12. \n\nSecond, use the relation\n\n    ∑_all four μ̂^'sW·λ̂/W·𝒟(-Δ(f_1f_2)_μ̂)1/𝒟·μ̂=\n    λ̂_1·μ̂_2/(𝒟·μ̂_1)(𝒟·μ̂_2)\n    \t\t(Δ f)_μ̂_1(Δ g)_μ̂_2\n\t\nvalid for any two choices of μ̂_1 and μ̂_2,  which have the tail located at V_12 and the tip on line 1 and line 2, respectively. \n\nThe contribution of a virtual point can be thus brought into a W-independent form\n\n    ∑_V_12,two μ̂^'se^i (𝒟· V_12)_m_x^1+m_y^1+m_x^2+m_y^2   \n    (i𝒟·μ̂_2/μ̂_1·λ̂_2λ_1x)^m_x^1(i𝒟·μ̂_2/μ̂_1·λ̂_2λ_1y)^m_y^1   \n    (i𝒟·μ̂_1/μ̂_2·λ̂_1λ_2x)^m_x^2(i𝒟·μ̂_1/μ̂_2·λ̂_1λ_2y)^m_y^2   \n    λ̂_1·μ̂_2/(𝒟·μ̂_1)(𝒟·μ̂_2)\n    \t\t(Δ f)_μ̂_1(Δ g)_μ̂_2  .\n\n\n\nTo show (<ref>), choose  two out of four vectors that have the tail on the virtual point and direction on the line in plane 1 and plane 2, and call them μ̂_1 and μ̂_2, respectively. The other two vectors are -μ̂_1 and -μ̂_2.\n\n\n\n\n\n\n\n\n\n\n\nUse \n\n    -Δ(f_1f_2)_μ̂_1-Δ(f_1f_2)_-μ̂_1=\n    \n    \t\t-(-Δ(f_1f_2)_μ̂_2-Δ(f_1f_2)_-μ̂_2)\n\nand get \n\n    ∑_all four μ̂^'sW·λ̂/W·𝒟(-Δ(f_1f_2)_μ̂)1/𝒟·μ̂=   \n    (W·λ̂_1/W·𝒟1/𝒟·μ̂_1-W·λ̂_2/W·𝒟1/𝒟·μ̂_2)   \n    \n    \t\t(-Δ(f_1f_2)_μ̂_1-Δ(f_1f_2)_-μ̂_1).\n\t\nA vector identity, valid for any W, 𝒟 and two pairs\n(λ̂_1,μ̂_1) and (λ̂_2,μ̂_2), \n\n    (W·λ̂_1)(𝒟·μ̂_2)-(W·λ̂_2)(𝒟·μ̂_1)=(W·𝒟)(λ̂_1·μ̂_2)\n\nbrings the right-hand side of (<ref>) into the form\n\n    (λ̂_1·μ̂_2/(𝒟·μ̂_1)(𝒟·μ̂_2))(-Δ(f_1f_2)_μ̂_1-Δ(f_1f_2)_-μ̂_1).\n\t\nThe final step is to prove that\n\n    (-Δ(f_1f_2)_μ̂_1-Δ(f_1f_2)_-μ̂_1)(λ̂_1·μ̂_2)=\n    \n    \t\t(Δ f_1)_μ̂_1(Δ f_2)_μ̂_2λ̂_1·μ̂_2  .\n\n\nThis last equality can be established by going through every of the four cases of pairs (λ̂,μ̂). Another way is to notice that -Δ(f_1f_2)_μ̂_1-Δ(f_1f_2)_-μ̂_1 is equal to (Δ f)_μ̂_1(Δ g)_μ̂_2 up to a sign, i.e. -Δ(f_1f_2)_μ̂_1-Δ(f_1f_2)_-μ̂_1=± (Δ f_1)_μ̂_1(Δ f_2)_μ̂_2. This is so, because the left-hand side is invariant under the change in sign μ̂_1→ -μ̂_1, whereas the right-hand side changes its sign. The absolute value eliminates this change in sign and so the equality is valid.\n\n\n\nAppendix I: The optimization procedure for selecting the dielectric constants\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nConstruct, out of (<ref>),  a 8 × 5 sub-matrix  composed of transfer matrix elements that couples only the S-polarization of the four modes selected, (0,0),(-1,0),(0,-1),(0,1).  The equations to solve are obtained from formula (<ref>). The OUT  set (DIR,POL,BF) is composed of (±,S,m), with m=1,…,4 from Table <ref>. Given the absence of any source at z=+∞, the coefficients C_POL,BF^DIR are all zero for (-,S,m), m=1,…,4. At IN, the set (dir,pol,bf) contains the incoming (+,S,1) and the reflected (-,S,m), with m=1,…,4. There are 8 unknown coefficients, 4 at OUT and another 4 at IN. \n\n\nThe 8× 5 matrix transfers the input column vector (𝒞^+_S1,𝒞^-_S1,𝒞^-_S2,𝒞^-_S3,𝒞^-_S4) into the output (C^+_S1,C^+_S2,C^+_S3,C^+_S4,0,0,0,0). For ease of reading, the IN and OUT coefficients are marked using distinct fonts. Within this approximation, we can solve 8 equations for 8 unknowns coefficients, by fixing the input 𝒞^+_S1=1. The coefficients thus found are the transmission and reflection coefficients for the 4 modes under consideration. \nTo construct an objective function for the optimization process we use a series of properties. The first property is that in the vicinity of the resonant frequency the absolute value of the determinant of the 4× 4 matrix (T^-,-_Sm,Sn) attains a minimum. The second one is that the absolute value of the transmission and reflection coefficients of the evanescent modes need to attain high values. The third property is based on the absorptance factor defined as 1-C^+_S1^2-C^+_S2^2-𝒞^-_S1^2-𝒞^-_S2^2, similarly to the definition from <cit.>. The absorptance factor goes through a maximum around the resonant frequency.  \nThe objective function we use is\n\n\n    Det(T^-,-_Sm,Sn)+\n    C^+_S1^2+C^+_S2^2+𝒞^-_S1^2+𝒞^-_S2^2-0.5\n    +\n    C^+_S3-10+C^+_S4-10  .\n\n\nOnly the transmission coefficients for the evanescent waves are present in (<ref>) because we expect that the reflection coefficients be very close, in absolute value, to the transmission values. We choose 10 as a target number for this values. For the absorptance factor the target values is chosen at 0.5. \n\nFor a fixed frequency in the range 37 GHz to 50 GHz, we  found a local minimum for  this objective function in the 6-dimensional space of the dielectric constants, each constant constrained to be between 1 and 12. \nAfter scanning 100 frequencies, the local minimum we selected has f=41.29 GHz, Det(T^-,-_Sm,Sn) =2.5× 10^-5-3.7× 10^-5 i, C^+_S1= 0.59 - 0.0022 i, 𝒞^-_S1=  -0.21 - 0.59 i, C^+_S2= 0.041 + 0.31 i, 𝒞^-_S2=0.04 + 0.34 i, C^+_S3=-10.03 - 0.15 i, 𝒞^-_S3=-10.61 - 0.18 i,\nC^+_S4=-3.92 + 9.20 i and 𝒞^-_S4= -4.13 + 9.74 i. \nWe see that the obtained determinant is a small number and that the reflection and the transmissions coefficients are close, in absolute value, to the value 10 we imposed. The absorptance factor came out as 0.04, far from the value of 0.5. This is because in the vicinity of the resonant frequency the  transmission and reflection coefficients of the propagative modes attain a minimum at frequencies slightly different than the resonance. \n\nThe dielectric permittivity set for the local minimum is \n\n    ϵ _1B= 4.98655,ϵ _2B= 2.95855,ϵ _1L= 7.59549,\n    ϵ _2L = 5.663,ϵ _1R=\n    5.92965,ϵ _2R= 1.63434\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAppendix J: Complex frequency plane\n\nThe real resonant frequency is located at the minimum of the determinant on the real Ω-axis.\nThe zero of the cofactor is located in the upper complex plane, Im(f_zero)>0 \n. A search for the minimum of the absolute value of the Cofactor_S(0,0),S(0,1)(T^-,-) gives a complex frequency Ω_zero= 0.213999052599+0.00014322547392 i, for which the Cofactor attains the value of -4.17186×10^-7 + 5.51181×10^-7 i. Translated in frequency, using c=0.25 mm, we get f_zero=40.8425 + 0.0273351 i in GHz. Once this zero is localized, the parameters a and b are estimated through a linear regression, <cit.>.\n\nThe linear approximation of the cofactor in the vicinity of Ω_zero,\n\n    Cofactor_S(0,0),S(0,1)(T^-,-)≅(a+i b) (Ω-Ω_zero),\n\ncontains two unknown parameters, a and b. The numerical data consists of pairs  (Ω,Cofactor_S(0,0),S(0,1)(T^-,-)) obtained from sampling the upper complex-frequency plane  using the analytical formulas for the transfer matrix.\n\nThe linear approximation for the determinant starts with localizing  Re(Ω_resonance)=0.21632449245970709 on the real axis at the point where the absolute value of the determinant becomes minimum, attaining the value 1.15869. In terms of the frequency, the resonance is at Re(f_resonance)=41.28635279688047 GHz. The linear approximation of the determinant in the vicinity of Ω_pole=0.21632449245970709+ i y_pole,\n\n    Det(T^-,-)≅(a^'+i b^') (Ω-Ω_pole),\n\ncontains three unknown parameters, a^', b^' and y_pole. The numerical data consists of pairs  (Ω,Det(T^-,-)) obtained from sampling the upper complex-frequency plane around Re(Ω_resonance) using the analytical formulas for the transfer matrix. The fit this time is nonlinear because of the product (a^'+i b^') y_pole.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\n\n\n\n"}