{"entry_id": "http://arxiv.org/abs/2303.06763v1", "published": "20230312215919", "title": "MigraR: an open-source, R-based application for analysis and quantification of cell migration parameters", "authors": ["Nirbhaya Shajia", "Florbela Nunes", "M. Ines Rocha", "Elsa Ferreira Gomes", "Helena Castro"], "primary_category": "q-bio.QM", "categories": ["q-bio.QM", "q-bio.CB"], "text": "\n\n\n\n\n\n\nMigraR: an open-source R-based application for analysis and quantification of cell migration\n\n\nmode = title]MigraR: an open-source, R-based application for analysis and quantification of cell migration parameters                      \n\n\n\n\n\n\n\n\n\n\n\n\n\n1,4,9]Nirbhaya Shaji\n2,3,9]Florbela Nunes\n3]M.Ines Rocha\n2,4]Elsa Ferreira Gomes\n3]Helena Castro\n\n\n\n\n\n\n\n[1]FCUP – Faculdade de Ciências da Universidade do Porto, Rua do Campo Alegre s/n, 4169-007 Porto, Portugal.\n[2]ISEP – Instituto Superior de Engenharia do Porto, Politécnico do Porto, Rua Dr. António Bernardino de Almeida 431, 4249-015 Porto, Portugal..\n[3]i3S – Instituto de Investigação e Inovação em Saúde, Universidade do Porto, Rua Alfredo Allen 208, 4200-135 Porto, Portugal.\n[4]INESC-TEC – Instituto de Engenharia de Sistemas e Computadores, Tecnologia e Ciência, Campus da Faculdade de Engenharia da Universidade do Porto, Rua Dr. Roberto Frias, 4200-465 Porto, Portugal.\n[9]These authors contributed equally to this work.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBackground and objective: Cell migration is essential for many biological phenomena with direct impact on human health and disease. One conventional approach to study cell migration involves the quantitative analysis of individual cell trajectories recorded by time-lapse video microscopy. Dedicated software tools exist to assist the automated or semi-automated tracking of cells and translate these into coordinate positions along time. However, cell biologists usually bump into the difficulty of plotting and computing these data sets into biologically meaningful figures and metrics.\n\nMethods: This report describes MigraR, an intuitive graphical user interface executed from the RStudioTM (via the R package Shiny), which greatly simplifies the task of translating coordinate positions of moving cells into measurable parameters of cell migration (velocity, straightness, and direction of movement), as well as of plotting cell trajectories and migration metrics. One innovative function of this interface is that it allows users to refine their data sets by setting limits based on time, velocity and straightness. \n\nResults: MigraR was tested on different data to assess its applicability. Intended users of MigraR are cell biologists with no prior knowledge of data analysis, seeking to accelerate the quantification and visualization of cell migration data sets delivered in the format of Excel files by available cell-tracking software.\n\nConclusions: Through the graphics it provides, MigraR is an useful tool for the analysis of migration parameters and cellular trajectories. Since its source code is open, it can be subject of refinement by expert users to best suit the needs of other researchers. It is available at GitHub and can be easily reproduced. \n\n\n\nShiny application Cell-tracking software Visualization R language\n\n\n[\n    [\n    March 30, 2023\n==================\n\n\n\n\n\n§ INTRODUCTION\n\n\nCell migration is an increasingly eminent area of research in biomedical sciences, with implications in fields as diverse as infection, immune response, embryo-genesis, and cancer <cit.>. The in-depth study of cells' migratory behavior holds promise to shed new light into these processes and ultimately translate into the development of innovative therapeutic strategies to ameliorate pathological conditions stemming from abnormal cell mobility. One powerful tool to study cell migration is time-lapse video microscopy. By imaging moving cells over several hours, this method captures both the temporal and the spatial dynamics of cell migration. Downstream image processing and cell tracking analyses by dedicated software (reviewed in <cit.>) then translate image sequences into numerical values. In their simplest version, cell trajectories are displayed as lists of x,y pixel coordinates along time. These coordinates, transformed into standard length measurements (μm), set the basis to compute biological meaningful quantitative metrics of single-cell migration, namely velocity, straightness and direction of movement, which can be ultimately used to draw informed conclusions about the mobile behavior of a population of cells.\n\nTransforming complex data sets into quantitative and insightful results is not an easy task for most biomedical researchers though. To perform basic tasks, such as graphical display of cell trajectories, plotting of Rose cell-tracking wind diagrams, and data refinement (based, for instances on the time window of data acquisition), cell biologists resort to dedicated ®MATLAB and RStudioTM software.\nHowever, the use of these tools requires an expert knowledge in computer science and mathematics rarely met by health scientists. In the last decade, some more accessible tools have been proposed by the community. A few are free and only some of those are open source (e.g. MotilityLab[<http://2ptrack.net/index.html>]/CelltrackR  <cit.>, CellMissy <cit.> or Ibidi <cit.>).\n\nThe software tool presented in this manuscript was developed to meet the need of a group of biomedical researchers to have access to a free, user-friendly application to make analysis of cell motion. From their collaboration with computer scientists, emerged MigraR.\n\nMigraR is cross-platform, with an intuitive graphical user interface, running from open-source RTM and RStudioTM. With no need for expert knowledge in mathematical data analysis software, MigraR drastically simplifies the plotting and analysis of migration parameters and cell trajectories. Besides quantifying speed and straightness, MigraR also provides specific plots of directions and angles, and, importantly, enables users to filter datasets to improve the quality of their output results. Importantly, MigraR is publicly and freely available on a GitHub account to all interested parties to download and use.  Since its source code is also open, it can be subject of refinement by expert users to best suit the needs of other researchers. \n\n\n\n§ MATERIAL AND METHODS\n\n\n\n\n §.§ Related applications\n\n\nMigraR was developed to assist biomedical researchers in the analysis of cell trajectories and migration parameters. MigraR does not perform tracking of cells from time-lapse videos; rather, it processes data sheets of x,y coordinates along time that are delivered by upstream image processing and cell tracking software (reviewed in <cit.>). Launched from RStudioTM using the Shinny extension, MigraR is a fully open source, and user-friendly and interactive platform for uncomplicated analysis of cell migration parameters. Compared with analogous free and open source applications MigraR stands out for (Table <ref>):\n\n=0pt\n\n  * enabling users to filter their datasets by re-scaling parameters such as time, velocity or straightness;\n\n  * displaying the direction and angle of cell trajectories; \n\n  * running independently of image analysis software (TrackMate <cit.>, Ibidi Chemotaxis Manual Tracking <cit.> and ADAPT <cit.>, currently not available, are Fiji/ ImageJ <cit.> plugins) and/or of proprietary numerical computing platforms (u-track <cit.> runs on ®MATLAB).\n  \n\n\n\n\n\n §.§ Software description, download and execution\n\nMigraR is a graphical user interface (GUI) software  implemented in R using the Shiny framework. MigraR can be accessible online via the Shinyapps.io server [<https://nirbhaya-shaji.shinyapps.io/migrar/>]. It runs in MS WindowsTM, Linux and macOS and requires prior installation of RTM and RStudioTM from website <cit.>. \n\n\nMigraR time complexity is O(n), where n is the data set length (all time steps of all the tracks). \n\nMigraR sources can be downloaded from GitHub account[<https://github.com/nirbhayashaji/MigraR.git>]. To execute MigraR, users must download the files server.R and ui.R to the working directory of RStudioTM and double click on the server.R file or open it using the file browser form RStudioTM. The file will open in RStudioTM, wherefrom it can be executed by clicking Run App <cit.>. MigraR will open in your default browser. To upload the cell tracking data, users simply have to click on the Browse button as seen in (Fig.<ref>, top left) listed first on the left panel. Users must be connected to the internet for the initial run so that the required packages can be installed. From there, no active internet connection is necessary for executing the application. The images in the manuscript that corresponds to the MigraR screens are also available in the GitHub for viewing in better clarity. The data used for those images are also available at GitHub. \n\n\n\n\n\n §.§ Data sets\n\nThe data sources of MigraR are files (txt, csv or xlsx format) generated by dedicated cell-tracking software – an example (provided from ImarisTM) is shown in Fig.<ref>. In these files, data must be organized in four columns \n\n, with the fixed titles (as shown in Fig.<ref>) and in case of CSV files ',' separated as follows: column A) x coordinates; column B) y coordinates; column D) time; column E) TrackID (i.e., the cell track identifier, attributed by the cell tracking software). Note that decimal separator has to be '.'. The value of TrackID cannot be 0. If it happens MigraR shows a warning message and will ask the user to change the TrackIDs to non zero values. Some cell tracking software might also deliver z coordinates listed in one additional column – column C in the example of Fig.<ref>. If the data file does not display z coordinates, users must introduce one dummy (empty or randomly filled) column C. The upload of input files to MigraR is performed by clicking the Browse button below the Choose input file text as shown in \nFig.<ref>.  \n\n\n\n\n\n\n §.§ Computing temporal and spatial coordinates into migration metrics\n\n\nMigraR is a digital platform that performs the visual and quantitative inspection of cells' dynamic behavior. It is used after cells trajectories have been recorded by time-lapse microscopy and traced by dedicated cell tracking software. MigraR computes the resulting cells' coordinates along in time, providing users a set of insightful graphical and quantitative outputs.\n\nMigraR performs a 'cell-based' quantification of cell migration parameters, i.e., it carries out a calculation for each cell separately and, based on each individual result, determines the mean or median for the entire population of cells. This method is in contrast with 'step-based' metrics, for which the mean or median of all separate movement steps are calculated independent of which track it belongs to. Detailed information about advantages and disadvantages of each quantification methods can be found in dedicated literature <cit.>. We should stress that some relevant track analysis metrics, like mean squared displacement (MSD) or autocorrelation plots are not yet supported by MigraR <cit.>.\n\nOne of MigraR functionalities is the graphical display of Rose plots. To draw these graphs, MigraR makes all tracks initiate from the (0,0) coordinate. To do so, the x,y coordinates at time zero (the first movie frame) of a given cell track are subtracted to all its x,y coordinates along time.\nMigraR also calculates the velocity and straightness of cell trajectories, employing the formulas provided in Table <ref>, and always taking into account the start and ending points of each cell trajectory. Straightness divides the displacement by the track Length. This gives a number between 0 and 1 (1 means a perfectly straight track).\nAs we can see in Table<ref>, we compute a step-based speed (with one number for each coordinate in the track) and a cell-based approach for the straightness where the total track displacement is divided by the distance travelled in time by the cell (just one number for each track) <cit.>.\n\n\n\n\n\n\n\n\n\n\nFor calculation of the angle of trajectories (θ), MigraR takes into account x,y  standard coordinates at the end point of the analysis and uses on the trigonometry equation presented in Fig.<ref>.\n\nThis calculation delivers the value of an angle (angle α in Fig.<ref>). Afterwards, MigraR makes the necessary adjustments according to the quadrant (Q1-Q4) of the x,y chart in which cells finalize their trajectories, as follows:\n\n\nQ1 (x>0, y>0), θ1 = α1;  \n\nQ2 (x<0, y>0), θ2 = 180 - α2; \n\nQ3 (x<0, y<0), θ3 = 180 + α3;  \n\nQ4 (x>0, y<0), θ4 = 360 - α4.\n\nAngles of trajectories are displayed by MigraR in the form of histograms. In its current version, MigraR accommodate a band width adjustment tool for data refinement based on the number of data points and their distribution - this will avoid biased interpretations, which are particularly tricky in the case of datasets consisting of few cell tracks. For users looking for more refined methods to detect directionality, we suggest alternative tools <cit.>.\n\n\n\nFinally, to have a visual representation of the direction of movement (left or right), MigraR calculates the cosine of θ, and attributes a color code to the resulting values. The cosine value of 1 (yellow color) indicates that cells move to the right, parallel to the x axis; the cosine value of -1 (red color) indicates that cells move to the left, parallel to the x axis; the cosine value of zero (orange color) indicates that cells move up or down. Similarly using the sin value, the vertical movement is represented using colors blue and green for up and down movements respectively. \n\n\n\n\n §.§ Experimental details for the illustrative data sets used for this report\n\nThe illustrative data set used in this manuscript was obtained by time-lapse microscopy recording of migrating cells, following previously described methodology <cit.>. Briefly, murine bone marrow-derived dendritic cells (BMDCs) <cit.>, pulsed for 3 hours with 10μ g/ml LPS were embedded in bovine type I collagen and loaded into a silicon chip mounted on a glass-bottom microscopy chamber slide. Upon polymerization of the collagen/cells mix, medium containing the chemokine CCL21 was added to the microscopy chamber slide. Videos were captured at 10 x magnification in an inverted Leica DMI 6000 FFW (LEICA Microsystems) microscope, equipped with an automated stage, and control of atmosphere  (5% CO2, 37C). The same points in multiple wells were imaged every 4 min for approximately 16 hrs. Movies were subsequently processed in Fiji/ImageJ software <cit.>, prior to automated cell tracking in proprietary software ImarisTM (Bitplane).\n\n\n\n§ RESULTS AND DISCUSSION\n\n\n\n §.§ The four (main) windows of MigraR\n\nMigraR offers an intuitive graphical user interface for plotting and calculating cell migration parameters. MigraR automatically calculates velocity, straightness and direction of movement based on the spatial and temporal coordinates listed on the uploaded data file. The workflow of MigraR is organized in four windows (Trajectories, Velocity, Straightness, and Direction), which can be selected from the respective tabs at the top of the large right side panel (Fig.<ref>). MigraR also have a window named DataTable that lets the user see the raw and calculated data that they are using. \n\nThe Trajectories window (accessible from the Trajectories tab). The Trajectories window depicts the visual projection of single-cell trajectories (Fig.<ref>). These can be visualized according to three View Mode options, available on the left panel: \n\n \n  * the Normal view mode is the default option, which provides a close-to-real projection of cell trajectories along the x,y axes;\n  \n  * in the Track ID mode, individual cell trajectories are distinguished based on color;\n  \n  * in the Rose Plot option, the starting positions of each cell trajectory are normalized to x,y origin (0,0). Scales of x,y axes can be adjusted using scroll bars on the bottom-right.\n\n\nBy clicking on the Download plot button at the bottom of the charts, users can download the plot as an image file of .png type.\n\nThe Velocity and Straightness windows (Fig.<ref>) display box and whisker charters, plotted from the velocity and straightness values that MigraR computes for set of cell trajectories under analysis. Velocity values refer to the average velocity that each cell assumes along its trajectory. Straightness values refer to the behavior of each cell between the first and the last time point of its trajectory. By pressing the Download plot buttons, users can generate and save the plot as .png files.\nHowever, the analysis of tracking data is sensitive to biases and artefacts. The user must be careful when using measures like straightness, specially between different datasets <cit.>, <cit.>.\n\nIn particular, there is a warning message  in the  straightness analysis window that this analysis is meaningful for tracks of equal length.\n\n\n\n\nDownload the Velocity data and Download the Straightness data buttons generate .csv files listing the values of velocity and straightness displayed on the corresponding plots. These .csv files can be used for subsequent comparative and statistical analyses between different data sets using dedicated software.\n\nThe Direction window (Fig.<ref>) is presented with two options, which can be chosen from the radio buttons on the left panel. On the first, Direction of Trajectories, users can visualize and download plots where cell trajectories appear in different colors based on the direction of the movement. These cell trajectories plots are available in both their Normal View and Rose Plot modes. \n\n\n\nIn the first pair of plots, cells are colored with a red-to-yellow gradient according to their horizontal directional choices: cells moving to the left are colored red; cells moving to the right are colored yellow. In the second pair of plots, cells are colored with a blue-to-green gradient according to their vertical directional choices: cells moving to the up are colored blue; cells moving to the down are colored green. \n\nThe second option, Angle of Trajectories, shows the frequency of cell trajectories moving within the range of  0-360 angles, over intervals of 4 degrees. Data are plotted both as column chart (Angle Frequency) and Rose Plot. These plots, as well as the corresponding data sets are available for download using buttons similar to the ones in the previous windows. \n\nIt will be useful if these features were complemented with common track analysis methods not yet included in the tool, displacement analysis, such as mean square displacement (MSD), and angle analysis, direction autocorrelation <cit.>.\n\n\n\n §.§ Visualizing Directional and Random movements \n\n\nIn Fig.<ref>, we show representative graphical outputs generated by MigraR, starting from two distinct sets of data: one of the datasets (upper panels, ‘Directional movement’) compiles the trajectories of cells exposed to a chemoattractant placed on their left; the other dataset (lower panels, ‘Random movement’) refers to cells that, in the absence of a specific migratory stimulus, moved randomly. Notably, all five graphical displays produced by MigraR translate the different directional choices of cells in each of the experimental conditions under analysis.\n\n\n\n\n\n §.§ The adjustments function of MigraR\n\n\nAll MigraR windows run in parallel with adjustment functions, which can be operated from the left side panel of the graphical interface. Here, users can find three sliders to filter the data sets based on the following parameters: Time, Velocity (Speed), and Straightness as shown in Fig.<ref>. Artifacts are unavoidable in data sets generated by high throughput analysis <cit.>. Applying limits or thresholds on these variables is thus desired when cell tracking has been performed fully automatically, albeit it needs to be performed cautiously to avoid elimination of relevant data points. \nWith MigraR adjustment functions, users can refine their data sets to exclude outliers resulting from inaccurate tracking [e.g. cells that do not move (most likely dead cells), or to cells that move too fast and/or move with straightness values equal to 1 (corresponding to straight lines, unlikely to occur in nature)]\n\n\nParticularly useful is the possibility to filter data sets based on time intervals – with this option, users can look into the dynamics of cell migration at different instants of movie acquisition and chose the most appropriate interval for their analysis. A Reset button, at the bottom of this panel, allows users to go back to the original data set. Importantly, these scroll bars work inter-connectedly between windows, i.e. scrolling one of these bars in one window automatically adjusts the same scroll bar in the remaining windows. \n\n\n\n§ CONCLUSION\n\nCell migration is an increasingly trendy area of research - related publications grew from 1 per year in the early 1970's to >21'000 last year - with potential applications in several branches of health and biological sciences. Powerful commercial tools are available to assist researchers in the complex analysis, visualization and quantification of cell migration. These are nonetheless commercialized at prohibitive prices to groups with poor financial resources. \n\nAs alternative, researchers can resort to open-source solutions, some of which not requiring computational experience (MotilityLab/CelltrackR  <cit.>, CellMissy <cit.> or Ibidi <cit.>). We expect to democratize the use of cell migration solution with MigraR, a user-friendly, free solution and open-source to all end-users, which has been developed to meet the needs of a group of biomedical researchers.\n\n\nAs future work, we intend to include some other usual features not yet supported by MigraR.\n\n\nAcknowledgements.This work is financed by National Funds through the Portuguese funding agency, FCT- Fundação para a Ciência e a Tecnologia, within project UIDB / 50014 / 2020.\n\ncas-model2-names\n\n\n\n\n"}