{"entry_id": "http://arxiv.org/abs/2303.07329v1", "published": "20230313175003", "title": "Application of targeted maximum likelihood estimation in public health and epidemiological studies: a systematic review", "authors": ["Matthew J. Smith", "Rachael V. Phillips", "Miguel Angel Luque-Fernandez", "Camille Maringe"], "primary_category": "stat.AP", "categories": ["stat.AP", "stat.ME", "stat.ML"], "text": "\n\n\n\n\n\n1]Matthew J. Smith*\n\n2]Rachael V. Phillips\n\n1,3]Miguel Angel Luque-Fernandez^±\n\n1]Camille Maringe^±\n\nSmith et al.\n\n[1]Inequalities in Cancer Outcomes Network, London School of Hygiene and Tropical Medicine, London, England, United Kingdom\n\n[2]Division of Biostatistics, School of Public Health, University of California at Berkeley, California, United States of America\n\n[3]Department of Statistics and Operations Research, University of Granada, Granada, Spain\n\n\n*Matthew J. Smith. matt.smith@lshtm.ac.uk\n\n\n\nLondon School of Hygiene and Tropical Medicine, Keppel Street, London, England, United Kingdom, WC1E 7HT \n\n^± Both authors contributed equally to this work.\n\n[Abstract]\nBackground The Targeted Maximum Likelihood Estimation (TMLE) statistical data analysis framework integrates machine learning, statistical theory, and statistical inference to provide a least biased, efficient and robust strategy for estimation and inference of a variety of statistical and causal parameters. We describe and evaluate the epidemiological applications that have benefited from recent methodological developments.\nMethods\nWe conducted a systematic literature review in PubMed for articles that applied any form of TMLE in observational studies. We summarised the epidemiological discipline, geographical location, expertise of the authors, and TMLE methods over time. We used the Roadmap of Targeted Learning and Causal Inference to extract key methodological aspects of the publications. We showcase the contributions to the literature of these TMLE results.\nResults\nOf the 81 publications included, 25% originated from the University of California at Berkeley, where the framework was first developed by Professor Mark van der Laan. By the first half of 2022, 70% of the publications originated from outside the United States and explored up to 7 different epidemiological disciplines in 2021-22. Double-robustness, bias reduction and model misspecification were the main motivations that drew researchers towards the TMLE framework. Through time, a wide variety of methodological, tutorial and software-specific articles were cited, owing to the constant growth of methodological developments around TMLE.\nConclusions\nThere is a clear dissemination trend of the TMLE framework to various epidemiological disciplines and to increasing numbers of geographical areas. The availability of R packages, publication of tutorial papers, and involvement of methodological experts in applied publications have contributed to an exponential increase in the number of studies that understood the benefits, and adoption, of TMLE.\n\n\n\n\nApplication of targeted maximum likelihood estimation in public health and epidemiological studies: a systematic review\n    [\n    March 30, 2023\n=======================================================================================================================\n\n\n\n\n\n\n\n§ BACKGROUND\n\n\nPublic health decisions across many clinical specialities are often informed by research exploring the relationship between exposures and patient health outcomes. To ascertain a causal relationship, randomised control trials (RCT) are considered the gold standard because, through randomisation of subjects to a treatment, they reduce the possibility of bias. Observational data offer invaluable opportunities to study causal relationships in contexts where clinical trials might prove infeasible or unethical, as well as for studying groups of the population typically excluded from trials or beyond the initial target population. Under correct adjustment for selection bias, missingness, interference, and confounding, observational data complements the evidence coming from RCTs. \n\n\nIn both RCT and observational studies, a causal exposure-outcome relationship is presented with a causal estimand, such as the average treatment effect (ATE). Methodological statistical developments for causal inference attempt to produce the least biased estimate of the estimand and accurate inference. G-computation, Propensity Score (PS), and Inverse Probability of Treatment Weighting (IPTW) estimators rely on parametric modelling assumptions, which are susceptible to model misspecification (i.e., exclusion of the underlying and unknown data-generating distribution from the model, which can lead to biased estimates with small standard errors and thus misleading results). Double-robust methods, like Augmented Inverse Probability of Treatment Weighting (AIPTW) and Targeted Maximum Likelihood Estimation (TMLE), aim to minimise model misspecification by requiring estimation of both the outcome and exposure mechanisms. They provide a consistent estimator as long as either the outcome or exposure model is correctly specified. Double-robust methods often outperform single-robust methods in point and interval estimation.<cit.> \n\n\nTMLE, also known as targeted minimum loss-based estimation, was introduced by van der Laan and Rubin in 2006.<cit.> In general, TMLE is a two-step process that involves (1) initial estimation of the outcome and intervention models, and then (2) in a “targeting” step, uses information from them to optimise the bias-variance trade-off for the target estimand (e.g., ATE), rather than the whole outcome probability distribution. Furthermore, to avoid model misspecification, ensemble machine learning algorithms are used to estimate the initial models. In particular, the Super Learner (SL) algorithm for stacked ensemble machine learning is most commonly used as it is theoretically grounded and proven to perform optimally in large samples.<cit.>\n\n    \nWe lightly detail the technical steps involved in the TMLE of the ATE, i.e., the effect of a binary exposure A on a post-exposure outcome Y, adjusted by baseline covariates W.<cit.> The prediction function for the mean outcome Y, given exposure A and covariates W is estimated, most commonly, using SL. We could use this estimated prediction function, Ê[Y|A,W], to arrive at an estimate of the ATE. Specifically, we would obtain predicted outcomes under a counterfactual scenario where all subjects receive the exposure/treatment versus another scenario where no one receives it. The average difference between these predicted counterfactual outcomes is an estimate of the ATE. However, formal statistical inference (i.e., confidence intervals and p-values) cannot be obtained for this estimate and it is susceptible to residual confounding; the latter can be reduced by using the information on how each individual was assigned or allocated to each level of the exposure. We, therefore, estimate the function for predicting the probability of being exposed, given the covariates W, using SL (exposure model, i.e. propensity score). These first steps are common to other double-robust estimators of the ATE, such as AIPTW. We then calculate the so-called “clever covariate” for the ATE, which is the individual values of the binary exposure weighted by the predicted probabilities of the exposure, given W. This is similar to IPTW, except here we weight the predicted probability of each exposure level instead of the outcome. The fluctuation parameter (ϵ) describes the difference between the observed outcome Y and the initial predictions of the outcome from the outcome model. It is calculated through maximum likelihood estimation (MLE) by regressing the clever covariate on the observed outcome and incorporating as offset the predicted outcome values. When the fluctuation parameter is estimated as close to 0 there is little difference between the observed and predicted outcomes; thus, the propensity score does not provide additional information for the initial estimate of the outcome model because it was correctly specified. If the fluctuation parameter is not close to 0, then this indicates the presence of residual confounding in the initial estimate. The initial outcome model's predictions for each level of the binary exposure are updated using the fluctuation parameter ϵ as a weight, and the final ATE estimate is calculated from these updated estimates. The functional delta method based on the influence function can be used to derive the standard error of the ATE and construct Wald-type confidence intervals.  \n\n\nSince 2006, the TMLE framework has experienced a growing number of theoretical and applied developments, and it has expanded further after a book that shared the TMLE framework to the international community of applied researchers was published in 2011.<cit.> Targeting specifically applied researchers, efforts were made to provide lay-language descriptions of the framework and exemplify its applications.<cit.> Furthermore, in 2018, a second book was published disseminating more advanced applications of the TMLE framework to data scientists with a particular focus on longitudinal settings.<cit.> TMLE is a robust framework for statistical analysis in clinical, observational and randomised studies. Since 2016, the American Causal Inference Conference has hosted a data challenge in which teams compete to estimate a causal effect in simulated data sets based on real-world data, such as from healthcare or education.<cit.> The competition is a proving ground for cutting-edge causal inference methods that have the potential to transform program evaluation. TMLE has consistently been a top-performing method.<cit.> \n\n\nThe use of robust statistical methods is key to obtaining reliable results for public health and epidemiological research and maximising their benefit to society. Evidence shows that TMLE, by blending flexible machine learning methods and causal inference principles, is one such step towards robust causal claims that bear significant and practical effects. We reviewed the literature around public health and epidemiological applications of TMLE to date, alongside key TMLE developments over the last 20 years. We highlight the speed at which the field developed and spread through the scientific community, and identify areas for further development to increase the utility of the TMLE framework in epidemiological and applied research.\n\n\n\n§ METHODS\n\n\n\n\n  \nProtocol registration and reporting standards  \n\n    This study is reported using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guideline. We registered this systematic review with PROSPERO (ID: CRD42022328482). \n\n\n\n  \nInformation sources  \n    \n    We searched the PubMed medical literature database for published epidemiological studies using TMLE in any epidemiological field (i.e., observational settings in biomedical sciences, including clinical epidemiology and public health). We searched for publications from any time up to 20th May 2022, the date the search was executed. The search strategy comprised of two specific groups of search terms focusing on TMLE and epidemiology. Relevant Mesh headings were included as were free-text terms, searched in the title, abstract or keyword fields. We used general and specific TMLE search terms, such as “targeted maximum likelihood estimation”, “targeted minimum loss-based estimation”, and “targeted machine learning”. Epidemiological search terms included “epidemiology”, “public health”, “population”, or “treatment”. The two specific groups of terms were combined with ‘AND’ to retrieve the final set of results. Search strategies were developed with an information specialist (MALF). The full search strategy is shown in Table <ref>. \n    \n    \n    \n\n\n  \nEligibility criteria  \n    \n    We excluded studies that did not report the use of TMLE as a tool to explore their (possibly causal) estimand of interest. We also excluded experimental studies, such as RCTs (n=15). We did not consider manuscripts that compared the performance of TMLE to other estimators, when there was no new development proposed and even if there was an applied question of interest, such as in Luque-Fernandez et al.<cit.> Studies were restricted to the English language and primary research studies. Secondary research studies, such as reviews and comments of TMLE, conference abstracts and brief reports, and preprints were not searched. We classified the retained manuscripts into observational, methodological and tutorial articles. TMLE methodological development articles and tutorials were considered separately, even if they contained a methodological development specifically designed to investigate an epidemiological question within the same article. We make reference to these methodological articles throughout this review, as they underpin the applied publications. \n    \n\n\n  \nStudy selection, data extraction and management  \n    \n    All retrieved publications were imported into the Endnote reference software where they were checked for duplication. Two of the three lead researchers (authors MJS, MALF and CM) were randomly allocated two-thirds of the 226 articles, to screen titles and abstracts of each publication independently and classify these into (1) observational, (2) methodological developments, (3) tutorial, (4) systematic review, (5) RCT, or (6) not relevant (Figure <ref>). Disagreements were discussed and adjudicated by the third independent reviewer, where necessary. Two researchers (authors MJS and CM) independently reviewed the full text of all eligible observational publications for data extraction. \n\n    \n    \n    \n\n    \n\n    \n\n    \n\n\n\n\n\n\n\n\n§ RESULTS\n\n\n    We found 226 unique publications published prior to 20th May 2022 in PubMed (Figure <ref>). Of these, 95 articles were a methodological development (including theoretical - or software-based), eight were tutorials, five were systematic reviews, and fifteen were RCTs. Of the 22 articles that were not relevant, three mentioned “TMLE” only in the author fields, one was a discussion of currently existing methods, twelve were assessments of learning (educational) programs that are targeted towards clinical environments, and six were comparisons of machine learning algorithms to other prediction models (without mention of TMLE). Overall, we focused on 81 observational studies in this systematic review for which full texts were available; six publications were not open-access and full texts were obtained from the corresponding authors.\n\n\n\n §.§ Dissemination and uptake of the TMLE framework\n \n\n    There has been a growing uptake of the TMLE framework over time, with five or fewer applied publications per year until 2017, and up to 21 in 2021. The majority (58, 71.6%) of publications using TMLE were published in the last three and a half years, starting in 2019. Most studies (77, 95.1%) cited the authors of particular TMLE methods they apply, whereas four (4.9%) did not cite any TMLE references. The large majority of these first epidemiological studies benefit from the expert knowledge of an author who is (or was) part of Professor Mark van der Laan's lab. (Table <ref>) \n\n    \n    Of the 81 studies included, two-thirds were conducted in the United States of America (US) (53, 65.4%, Figure <ref>),<cit.> with 100% of articles before 2017 being published in the US and down to 50% of all 2021 articles. Publications from Europe or Scandinavia (10, 12.3%),<cit.> Africa (4, 4.9%),<cit.> Middle East (5, 6.2%),<cit.> and Oceania or Asia (8, 9.9%)<cit.> represent between 20% (in 2017) and 70% (in 2022, up to May 2022) of all applied studies published in the last 6 years. (Figure <ref>, Table <ref>) In the US, the majority of publications (28) were from California, including 20 from the University of California at Berkeley, where TMLE was first described.\n\n    \n    In the early years, the first authors tended to be qualitative academic experts, but we saw more variety in expertise and a larger number of practising clinicians leading observational studies in many epidemiological and public health fields in recent publications. \n    The most common epidemiological sub-discipline was non-communicable disease (23, 28.4%),<cit.> followed by behavioural epidemiology (17, 21.0%),<cit.> and then infectious disease epidemiology (12, 14.8%).<cit.> Through time we see an uptake of TMLE in many more disciplines, such as pharmaco-epidemiology,<cit.> policy,<cit.> biomarker epidemiology,<cit.> environmental epidemiology,<cit.> occupational epidemiology,<cit.> and health economy.<cit.> \n\n\n    We also studied the evolution of citations. When only methodological overviews of the TMLE framework were available, these were cited despite their heavy statistical requisite. Since 2016, tutorials were published and started to be cited alongside references for statistical packages. <cit.>(Table <ref>) \n\n\n    Cohort study design<cit.> was the most prevalent design (42, 51.9%), followed by cross-sectional (32, 39.5%) (Appendix Table <ref>).<cit.> Other types of epidemiological design included case-control<cit.> and ecological.<cit.>  \n\n\n    Many articles reported results from other statistical methods, in addition to reporting those obtained from TMLE. Over one-quarter of the studies used adjusted parametric regression (24, 29.6%),<cit.> one sixth (12, 14.8%) used IPTW,<cit.> one (1.2%) used AIPTW,<cit.> three (3.7%) used non-parametric methods (e.g. Kaplan Meier),<cit.> and seven (8.6%) used unadjusted regression.<cit.> Some studies included more than one comparative method.\n\n    \n    SuperLearner (SL) provides a flexible machine learning approach to  the estimation of the initial outcome and intervention models. Of the 81 articles, more than half (47, 58.0%) used the SL algorithm, <cit.> 18 (22.2%) used logistic regression,<cit.> and 16 (19.8%) did not specify the approach for the estimation of either the outcome or intervention model.<cit.> The average number of machine-learning algorithms considered by the SL was 6.3 (range 1 - 16), 19 different machine-learning algorithms were used across the articles (a machine-learning algorithm is a wrapper included within the SuperLearner<cit.> library in R software).\n\n    \n    Variance of point estimates obtained from TMLE were estimated using the influence function (n=19, 23.5%),<cit.> bootstrap (n=6, 7.4%),<cit.> and Wald tests (n=2, 2.5%),<cit.> while 54 (66.7%) studies did not specify how standard errors were obtained.<cit.>\n\n    \n    The Causal Inference Roadmap<cit.> contains seven recommended criteria to define a causal effect: (i) specify the scientific question, (ii) specify the causal model, (iii) define the target causal quantity, (iv) link the observed data to the causal model, (v) assess identifiability assumptions, (vi) estimate the target statistical parameters, and (vii) interpretation of the results. On average, 5.3 (SD 1.0) criteria were complete per article. We considered a version of the Targeted Learning Roadmap<cit.> that contains five criteria: (i) specify the observed data and describe the data-generating experiment, (ii) specify a statistical model representing a set of realistic assumptions about the underlying true probability distribution of the data, (iii) define a target estimand of the data distribution that “best\" approximates the answer to the scientific question of interest, (iv) given statistical model and target estimand, construct an optimal plug-in estimator of the target estimand of the observed data distribution, while respecting the model, and (v) construct a confidence interval by estimating the sampling distribution of the estimator. When the scientific question of interest is causal, step (iii) of the Targeted Learning Roadmap incorporates steps (ii)–(v) of the Causal Inference Roadmap.<cit.> On average, 3.3 (SD 1.0) criteria were complete per article. Most studies have room to state the necessary content for at least one more criteria. \n\n    \n    Most publications (77, 95.1%) used R software to perform TMLE,<cit.> except four that used STATA.<cit.> Nonetheless, nine articles reported using another software tool (i.e., Stata/SAS/SPSS) alongside R for TMLE.<cit.> The most commonly used R software packages were tmle<cit.> (40, 49.4%) and ltmle<cit.> (16, 19.8%).\n\n\n\n §.§ Showcase of the TMLE framework in different disciplines\n \n    \n    In all disciplines and applications, applying the TMLE framework to their specific research question encouraged authors to review the strengths and limitations of their data and carefully consider how their data and setting might violate identifiability assumptions, which are assumptions necessary for causal inference but not TMLE. If, and only if, the identifiability assumptions are assumed to hold, the estimated effect is a causal effect. However, for observational studies, it cannot be known whether identifiability assumptions hold. Therefore, if an estimate is interpreted as a causal effect, then this interpretation should be accompanied by a discussion of the plausibility of identifiability assumptions. All disciplines and disease areas highlight issues with missing data and measurement errors and incorporate subject-matter knowledge. (Appendix Table <ref>) Model misspecification, which might result from imposing constraints that are unrealistic or not informed by subject-matter knowledge, was the first and foremost driver for using the TMLE framework. Three-quarters of the studies (n=68, 84.0%) provided at least one justification for using TMLE compared to another method. (Table <ref>) Standard regression techniques in settings with low incidence,<cit.> rare outcomes<cit.> or low sample size<cit.> may over-fit the data or not converge: careful SL specifications overcome these limitations.<cit.> Least biased and double-robust estimation were also widely cited advantages of the framework. These mean (i) the estimated parameter will be closest to the true value of our quantity of interest, even when our sample size is low, and (ii) only one of our initial models needs to be correctly specified.   \n\n    \n    There was a range of disease areas covered in the 23 noncommunicable disease epidemiology studies. The appealing property of TMLE was that it is a semiparametric estimator, allowing the use of machine learning algorithms to minimise model misspecification.<cit.> Additionally, extensions of TMLE have developed ways to appropriately handle the dual nature of time-varying confounding, which have been utilised in longitudinal studies analysing data on depression,<cit.> survival from acute respiratory distress syndrome,<cit.> caries arising from intake of soda,<cit.> effects of smoking on rheumatoid arthritis,<cit.> and effects of asthma medication on asthma symptoms.<cit.> Improved predictive performance<cit.> and adjusting for informative censoring<cit.> were additional reasons for using TMLE. Furthermore, the extension of TMLE to case-control studies, in which sampling is biased with respect to the disease status, provided a platform for analysing the causal effect of reproductive factors on breast cancer by using case-control weighted TMLE.<cit.> \n\n    \n    In infectious disease epidemiology (IDE) articles, most were concerned with having a flexible modelling approach that does not impose assumptions on the functional form of the exposure-outcome relationship.<cit.> A key feature of the IDE subdiscipline is that baseline confounders and exposures may change over time and can obscure the causal effect of interest.<cit.> Standard survival modelling assumes that censoring and survival processes are independent, which is likely violated in this setting, and it assumes there is no time-dependent confounding.<cit.> TMLEs with a working marginal structural model and for time-to-event outcomes permit evaluation of the effect of an exposure at multiple time points, which is beneficial when the interpretation of causal effects from hazard models is often difficult.<cit.> Other studies have overcome this issue by using TMLE in a target trial framework or case-cohort studies.<cit.> \n \n    \n    In behavioural epidemiology manuscripts, the behavioural nature of the topics covered implied that RCTs are mostly unethical, bear prohibitive costs or have very small sample sizes. There are several key challenges for using observational data to study the causal effects of childhood adversities,<cit.> physical activity,<cit.> alcohol consumption<cit.> or supply <cit.> on various outcomes, including fractures,<cit.> mental health,<cit.> asthma,<cit.> and pregnancy outcomes.<cit.> They include a risk for reverse causation;<cit.> high dimensional data and in particular, multidimensional exposures;<cit.> and measurement error resulting from self-reported exposures or outcomes.<cit.> Longitudinal relationships and time-varying confounding, where confounders of the effect of an exposure on an outcome can themselves be affected by prior exposures, as well as sample attrition,<cit.> are particular challenges faced by survey data that are collected in consecutive waves.<cit.> TMLE adjusts for time-varying confounders affected by prior exposure and employs a doubly robust estimation approach that allows for flexible model fitting. Additionally, as pointed out in 2016 by Ahern et al.,<cit.> “TMLE with machine learning addresses the challenge of a multidimensional exposure because it facilitates `learning' from the data the strength of the relations between each adversity [dimensions of the exposure] and outcome, incorporating any interactions or nonlinearity, specific to each [sub-group]\". \n \n    \n    The field of biomarker epidemiology is driven by the search for sets of candidate biomarkers that are important in determining given outcomes. Ranking the contributions of these candidate biomarkers is also of interest. Some studies used TMLE to measure variable importance in biomarker research<cit.> and in other fields.<cit.> Dimension reduction for the estimation of causal effects is an aim in some biomarker examples.<cit.> In the models presented in the publications, there are complex joint effects to consider in large correlated data, as well as longitudinal patterns and time-dependent confounding.<cit.> Furthermore, two manuscripts present covariate selection algorithms ahead of causal effect estimation.<cit.> \n\n    \n    Research published in environmental epidemiology highlights challenges around the clear definitions of exposure and outcomes,<cit.> as there are likely many proxy and surrogate measures of exposure,<cit.> coupled with potential exposure misclassification and measurement errors.<cit.> Nonetheless, TMLE was successfully applied to determine either causal attributable risk,<cit.> or risk differences.<cit.> \n\n    \n    The only observational study of TMLE in health economics explored the relationship between financial resources leading to food insecurity and healthcare expenditure in a pay-to-access healthcare system. It uses ecological measures of exposure and outcome and leads to evidence for policy.<cit.> \n \n    \n    Two publications focused on occupational epidemiology.<cit.> A key aspect of occupational epidemiology is accounting for the healthy worker survivor effect: a bias arising due to healthier workers accruing more exposure over time. These studies looked at exposure to particulate matter from aluminium or metalworking fluids in metal factory workers, which varied depending on the length of employment. Both studies benefited from TMLE's flexibility to allow for time-varying confounding of the exposure.\n\n\n    The field of pharmacoepidemiology is concerned with assessing treatment's efficacy in real-world settings and monitoring long-term side effects of treatments. Both objectives would be either impractical or too costly to study in RCTs, given the limited follow-up time available in clinical trials. TMLE has been used in this setting, as it provides a robust procedure for estimation.<cit.> In particular, the flexibility of TMLE, provided through the specification of a diverse and rich set of machine learning algorithms in the SL, is crucial for appropriately adjusting for confounding in observational studies.<cit.> \n \n\n    Policy epidemiology assesses the effects of population programs or mandates. Lack of randomisation, such as in studies examining the association between speciality probation and public safety outcomes,<cit.> leads to an imbalance in the covariate distribution by exposure levels. Studies of cost-effectiveness may involve dealing with outliers which can be addressed with TMLE.<cit.> Other challenges include zero-inflation, such as the assessment of the effect of primary care physician density on arthroplasty outcomes, in which some areas had zero density.<cit.> This is dealt with by using a mixture of models to assess the probability of non-exposure (i.e., very low density).<cit.> Other policy studies presented challenges around missing data,<cit.> reliance on epidemic modelling assumptions,<cit.> target trial emulation,<cit.> or infeasible randomisation process.<cit.> \n    \n    \n        \n        \n\n    \n        23cm!\n        [ht]\n        Distribution of observational papers by year of publication and selected characteristics\n        \n        \n        1l     28cYear of publication     1l \n 2-29\n             2c2009     2c2010     2c2011     2c2012     2c2013     2c2014     2c2015     2c2016     2c2017     2c2018     2c2019     2c2020     2c2021     2c2022 ^⋆     Total \n 2-30 \n             N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N     (%)     N \n 2-30\n        1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l \n\n        1lPublications     2                    1          1          1          2          1          5          4          6          12          16          21          9          81 \n \n        1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l \n gray1lTMLE expert (author)^±      2     (100)               1     (100)     1     (100)     1     (100)     1     (50)     1     (100)     3     (60)     1     (25)     4     (67)     6     (50)     6     (38)     5     (24)     1     (11)     33 \n\n        1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l     1l \n  gray1lUSA-based publication     2     (100)               1     (100)     1     (100)               2     (100)     1     (100)     5     (100)     3     (75)     6     (100)     9     (75)     10     (63)     11     (52)     2     (22)     52 \n \n        1l                                                                                                                                                  \n gray1lDiscipline                                                                                                                                                  \n\n        Behavioural epi                         1     (100)                                             1     (20)               1     (17)     2     (17)     6     (38)     4     (19)     2     (22)     17 \n\n        Biomarker     2     (100)                                                                 3     (60)                                   1     (6)     2     (10)               8 \n\n        Environmental epi                                   1     (100)                                             1     (25)     1     (17)     3     (25)               1     (5)               7 \n\n        Health economy                                                                                                         1     (8)                                   1 \n\n        Infectious disease                                                       1     (50)                         1     (25)               1     (8)     4     (25)     2     (10)     3     (33)     12 \n\n        Non-Communicable Disease                                             1     (100)     1     (50)                                   3     (50)     3     (25)     4     (25)     9     (43)     2     (22)     23 \n\n        Occupational epi                                                                 1     (100)                                   1     (8)                                   2 \n\n        Pharmaco-epi                                                                                     1     (25)                         1     (6)     2     (10)               4 \n\n        Policy                                                                           1     (20)     1     (25)     1     (17)     1     (8)               1     (5)     2     (22)     7 \n\n        1l                                                                                                                                                  \n gray1lMotivations ^†                                                                                                                                                  \n\n        Bias     1     (50)                                             2     (100)     1     (100)     1     (20)     1     (25)     2     (33)     5     (42)     5     (31)     12     (57)     6     (67)     36 \n\n        Double-robust     1     (50)                                                                 1     (20)     1     (25)     2     (33)     2     (17)     5     (31)     6     (29)     4     (44)     22 \n\n        Efficient                                                                                                         2     (17)     5     (31)     2     (10)     3     (33)     12 \n\n        Finite   sample                                   1     (100)                                                                                     2     (10)               3 \n\n        Model misspecification     1     (50)               1     (100)     1     (100)                                   3     (60)     1     (25)     2     (33)     1     (8)     3     (17)     1     (57)     2     (22)     16 \n\n        Positivity   assumption                                                                                               1     (17)     1     (8)     1     (6)                         3 \n\n        Power                                                                                                                   1     (6)                         1 \n\n        None specified                                             1     (100)                         1     (20)     2     (50)               5     (42)     4     (25)     2     (10)     1     (11)     16 \n\n        1l                                                                                                                                                  \n gray1lExpertise first author                                                                                                                                                  \n\n        Biostatistician     1     (50)                                             1     (50)     1     (100)               1     (25)     2     (33)     2     (17)     2     (13)     4     (19)     2     (22)     16 \n\n        Epidemiologist                         1     (100)     1     (100)               1     (50)               3     (60)               1     (17)     4     (33)     6     (38)     7     (33)     1     (11)     25 \n\n        MD                                                                           1     (20)     2     (50)               1     (8)     1     (6)     5     (24)     2     (22)     12 \n\n        MD, MPH                                                                                                         1     (8)     1     (6)                         2 \n\n        MD, PhD                                             1     (100)                                                       3     (25)     2     (13)     3     (14)     3     (33)     12 \n\n        Other                                                                                                                   2     (13)     2     (10)               4 \n\n        PhD     1     (50)                                                                           1     (25)     2     (33)               1     (6)                         5 \n\n        Not known                                                                           1     (20)               1     (17)     1     (8)     1     (6)               1     (11)     5 \n\n        1l                                                                                                                                                  \n gray1lCitations ^⊡                                                                                                                                                  \n\n        Overall TMLE method.     2     (100)               1     (50)     1     (100)               5     (56)     1     (33)     4     (33)     4     (50)     3     (33)     6     (19)     13     (42)     20     (38)     4     (16)     64 \n\n        Specific TMLE method.                         1     (50)               1     (100)     4     (44)     1     (33)     6     (50)     1     (13)     3     (33)     15     (47)     7     (23)     13     (25)     8     (32)     60 \n\n        Tutorial                                                                                               1     (11)     7     (22)     7     (23)     14     (27)     7     (28)     36 \n\n        R software                                                                 1     (33)     2     (17)     3     (38)     2     (22)     4     (13)     4     (13)     5     (10)     6     (24)     27 \n 30l2*c]@l@ ^⋆ Up to 20th May 2022 \n\n        ^± TMLE expert is a current or past member of M.J. van der Laan's Lab. \n\n        ^† Proportions calculated over the number of publications within that year. \n\n        ^⊡ Proportions calculated over the total number of citations within that year. \n\n         \n\n        \n        \n    \n    \n\n\n\n §.§ Methodological developments and their implementation\n\n    \n    Over the years since the TMLE framework was first laid out,<cit.> many contributions have been made to expand the settings in which TMLE is used, provide tools for implementation in standard software, and describe the TMLE framework and application in lay language. Thanks to this, the community of public health researchers and epidemiologists have started implementing the TMLE framework and its latest developments to obtain double robust, least biased and efficient estimates and statistical inference from studies. The properties of TMLE, in contrast to other estimators commonly used for causal inference, include that it is loss-based, well-defined, unbiased, efficient and can be used as a substitution estimator. \n\n    \n    Figure <ref> shows schematically when and why extensions of TMLE have happened in the last 15 years, as well as extensions and uptake. The 81 applied epidemiological studies are classified by methodological development used during the study. Appendix Table <ref> provides further details regarding the methodological development references between 2006 and mid-2022 that are highlighted in Figure <ref>. \n\n    \n    TMLE’s superior efficiency and power are evidenced in small sample size settings where marginal effects from logistic regression models adjusted for (possibly many) covariates would not be recommended.<cit.> The implementation of TMLE in complex causal effect estimation problems is discussed in many publications, such as in settings with multiple time point interventions,<cit.> longitudinal data,<cit.> post-intervention effect modifiers,<cit.> dependence of the treatment assignment between units<cit.> or censoring,<cit.> causally connected units,<cit.> hierarchical data structures,<cit.> randomisation at the cluster level,<cit.> large electronic health record data, <cit.> and in meta-analyses.<cit.> \n\n    \n    The TMLE framework is extended and discussed in the setting of case-control studies. One study matched cases to controls,<cit.> another used two-stage sampling and nested case-control design.<cit.> Other studies required the design to be adaptive to possibly invalid assumptions of independent units<cit.> or if the sample population differs from the (possibly ill-defined) target population.<cit.> \n\n    \n    The collaborative TMLE (C-TMLE), introduced in 2010,<cit.> is an extension of TMLE, in which information on the causal parameter of interest is used when estimating and selecting initial model(s). C-TMLE aims to improve the robustness and efficiency of the TMLE. Schnitzer et al.<cit.> highlight the pitfalls and their consequences of automated variable selection in causal inference, such as in the propensity score model, and how C-TMLE corrects for this. C-TMLE was later extended to measure variable importance<cit.> and to longitudinal data settings.<cit.> Proposals to enhance the C-TMLE algorithm include ordering covariates to decrease C-TMLE time complexity,<cit.> using LASSO with C-TMLE for the estimation of the propensity scores,<cit.> and adaptive truncation of the propensity scores with C-TMLE to ensure positivity.<cit.> \n\n\n    The pooled TMLE<cit.> was developed for the context of longitudinal data structures with baseline covariates, time-dependent intervention nodes, intermediate time-dependent covariates, and a possibly time-dependent outcome. Extensions include advice for the optimal discretisation of time<cit.> and to the hazard function.<cit.>\n\n\n    The one-step TMLE aims to preserve the performance of the original two-step TMLE, and achieves bias reduction in one step (i.e., without additional iterations of the TMLE update step and possible over-fitting in finite samples).<cit.> This one-step TMLE was later extended to counterfactual average survival curves<cit.> and heterogeneous treatment effects.<cit.>\n\n\n    The robust TMLE was proposed in 2017 for transporting intervention effects from one population to another.<cit.>\n\n\n    The cross-validated TMLE (CV-TMLE) provides asymptotic inference under minimal conditions (i.e., non-parametric smoothness<cit.>) keeping the bounds of the parameter estimates. It is also used in the estimation of data-adaptive target parameters, like optimal treatment regimes. Recently, TMLE was shown to be useful in defining thresholds and marking specified levels of risks.<cit.> \n\n    \n    The set of observational articles that use TMLE in their main or sensitivity analyses shows that TMLE has successfully been used to examine associations,<cit.> causation,<cit.> and variable importance. <cit.> It has been used to analyse data with varying numbers of observations, from less than 100 to over hundreds of thousands, from clinical trials, cohort studies,<cit.> and observational studies.\n    \n    \n    \n\n\n\n\n\n§ DISCUSSION\n\n\n    We aimed to investigate the use of the TMLE framework in epidemiology and public health research and to describe the uptake of its methodological developments since its inception in 2006. We focused on TMLEs for point treatment, time-to-event/survival, and longitudinal exposure-outcome relationships. We did not discuss TMLE methodological developments and software for mediation analyses.<cit.> We found that the TMLE framework and its different estimators were implemented in at least 81 epidemiological observational studies. The majority of these studies have come from the US, many of which are from the University of California, Berkeley. Recently, the use of TMLE has spread across the world. Until 2016, TMLE in observational studies was used by select groups of expertise and disciplines, such as biostatisticians or epidemiologists in academia exploring noncommunicable and infectious diseases, or behavioural epidemiology. From 2016 onward, there was a faster uptake amongst a wider range of expertise and disciplines. There is potential for even wider dissemination and acceptance, both geographically and in some specific disease areas or epidemiological disciplines. We hope this review of explicit and applied examples will contribute to enhancing the relevance of the TMLE framework and increasing its uptake and acceptance in settings where challenges with regard to data, unrealistic assumptions, or subject-matter knowledge lend themselves to the framework. \n\n    \n    Initially, causal inference methods and estimators relied on parametric modelling assumptions but, to quote Box (1976), “all models are wrong but some are useful\".<cit.> It highlights that model misspecification was and remains a challenge, even with ever-growing datasets and computing power: exclusion of the unknown data-generating distribution leads to biased results. Semi-parametric and non-parametric causal inference estimators, such as AIPTW, double-debiased,<cit.> and TMLE<cit.> aim to provide the least biased estimate of the effect of an exposure on an outcome.<cit.> Maximum Likelihood Estimation (MLE) based methods (stratification, propensity score and parametric regression adjustment) and other estimating equations (AIPTW) do not have all of the properties of TMLE, and evidence shows that they under-perform in comparison to TMLE in specific settings.<cit.> For more detailed comparisons between the different methods, the interested reader is referred to Chapter 6 of van der Laan and Rose’s TMLE textbook.<cit.> It is important to highlight that in contrast to the AIPTW estimator, TMLE respects the global constraints of the statistical model (i.e., P(0 < Y < 1) = 1) and solves the score estimation equations being equal to zero using substitution and fluctuation approaches.<cit.> TMLE augments the initial estimates to obtain an optimal bias-variance trade-off for the target estimand of interest and produces a well-defined, unbiased, efficient substitution estimator. Furthermore, the targeting step (i.e., update of the initial estimate) may remove finite sample bias. Lastly, the TMLE framework can be tailored to specific research questions that are difficult to answer using other causal inference methods, such as rare diseases,<cit.> ordinal<cit.> or continuous exposures,<cit.> dynamic treatment regimes,<cit.> and missing outcome data.<cit.> \n\n    \n    We argue that dissemination of any new statistical methodology relies on five key factors: (i) software availability, (ii) accessibility of available material (e.g., quality of software help files, language used in publications, etc.), (iii) number of experts in the area, (iv) teaching, and (v) collaborations. In the following, we discuss the dissemination of TMLE with regard to each of them. \n\n    \n    \n\n  \n(i) Software availability:   \n\n    Various TMLEs have been developed for complex study designs, such as those with time-to-event outcomes, case-control studies, hierarchical data structures (including cluster randomised trials), longitudinal data, and time-dependent confounding. These methodological developments were accompanied by the release of R software packages, increasing the usability of TMLE. Such software developments include the SuperLearner<cit.> R package in 2007 and the tmle R package in 2012.<cit.> TMLE software for survival analysis (survtmle),<cit.> longitudinal data (ltmle),<cit.> doubly-robust confidence intervals (drtmle),<cit.> and estimation of the survival curve under static, dynamic and stochastic interventions (stremr)<cit.> were implemented in 2017. To match the expanding framework, further software developments occurred in the following years, such as the tlverse suite of software packages for Targeted Learning (<https://tlverse.org/tlverse-handbook/>), which includes R packages for cross-validation (origami),<cit.> highly adaptive lasso (HAL, hal9001),<cit.> super learning (sl3),<cit.> and TMLEs for a range of target estimands, such as effects under static interventions on an exposure (tmle3),<cit.> optimal dynamic treatment regimes for binary and categorical exposures (tmle3mopttx),<cit.> and stochastic treatment regimes that shift the treatment mechanism of a continuous exposure (tmle3shift).<cit.> Additional recently developed packages in R include ctmle for collaborative TMLE,<cit.> haldensify for conditional density estimation with HAL, <cit.> txshift for estimating causal effects of stochastic interventions,<cit.> and lmtp for longitudinal modified treatment policies.<cit.>\n\n    \n    Although the TMLE framework is well developed in the R software, applied epidemiological research is performed in several other software languages, such as Stata, Python, and SAS. TMLE implementations for binary point exposure and outcome studies are available in all of these languages. A SAS macro for the general implementation of TMLE was programmed in 2016.<cit.> TMLE has been developed for the Python software language in the library zEpid.<cit.> The number of applied researchers in epidemiological studies using Python is relatively low but is increasing; thus, this tool is not currently widely used among applied health sciences researchers. Further development could improve on software packages in the widely used statistical software in health sciences and econometrics, such as Stata.<cit.> Nonetheless, the development version of the user-written Stata command eltmle is currently available to Stata users.<cit.> Not all features of TMLE are available in this Stata command, such as longitudinal analysis and cross-validated TMLE. Additionally, eltmle provides ensemble learning capabilities by accessing the SuperLearner R package. \n    Lastly, any new software development needs to have a friendly user interface, together with standard programming features to be easily disseminated and quickly adopted. \n\n    \n    \n\n  \n(ii) Accessibility of available material:   \n\n    The TMLE framework is a series of potentially statistically-complex modelling approaches and computational algorithms, grounded in statistical theory that requires a solid understanding of highly advanced statistics (i.e., theory for semi-parametric estimation, asymptotics, efficiency, empirical processes, functional analyses, and statistical inference). Tutorials in a more lay language targeting applied researchers and epidemiologists have become more common over the past five years and the uptake of TMLE is expected to increase in the future because of them.<cit.> Their beneficial impact is evident from this review, as these articles are highly referenced in applied work, from the year of their publication, alongside more methodologically heavy contributions to start with, and as sole references in later years. This shows evidence of the importance of speaking the language of the target audience and disseminating advanced mathematical statistics and algorithms from an applied perspective. \n\n    \n    Additionally, the gradual dissemination of the TMLE framework was evident from our systematic review of the methods sections of the 81 selected manuscripts. We observed that papers published in the early years lay out their TMLE strategy and carefully describe each step in the methods section; whereas, more recently, publications of applied research have placed details of the methods in appendices (or supplementary material) and only cite tutorials and software packages. This shows that the community (e.g., authors, editors, reviewers, readers, etc.) is now aware of the TMLE framework, its utility, and its advantages. A wide range of journals have published the applied research articles studied here, from non-specific public health journals to statistical or disease-specific journals.\n\n\n    \n\n  \n(iii) Experts:   \n\n    Dissemination outside the US needs further work, as evidenced in our systematic review. We have shown that the TMLE framework appears to be well consolidated in the US, and adoption from Europe and other regions are lower in comparison. This may be related to the delayed introduction of causal inference education outside the US. Fostering targeted local seminars and dedicated short courses for the interested applied audience could be a useful strategy to disseminate the framework. Disease- or discipline-specific experts would be useful for the wider distribution of the methods in specific areas that would benefit from improved methodology. \n\n    \n    TMLE remains dominant in non-communicable or infectious disease epidemiology compared to other disciplines, but it has high applicability in many disciplines and its use has increased in several of them. The slower uptake of the TMLE framework in other disciplines might be due to a lack of empirical examples of how one performed and interpreted statistical analyses using TMLE in a specific disease area. We aimed to provide such a showcase of the application of the methods in specific settings, based on the available literature, and we demonstrated how the framework was successfully used to advance research by providing robust results. We believe interested readers will find it useful to refer to the studies that faced similar challenges, or were based in settings comparable to theirs. \n\n    \n    \n\n  \n(iv) Teaching:   \n\n    There have been tremendous efforts of dissemination of causal inference methods across disciplines, with a particular emphasis on epidemiology and econometrics sciences in the US during the last 20 years. Most graduate programs in epidemiology have included the teaching of causal inference as a leading topic in the field. In Europe, the trends have not been as fast-paced and for a long time, introductions to causal inference methods have mainly been provided through week-long intensive short courses and at international conferences. These different approaches have major impacts on how quickly the methods are adopted by the community of researchers, journal editors, public health groups, and regulatory agencies. In recent years, there has been a development and acceptance of real-world evidence in various public-health fields, such as the Food and Drug Administration's 21st Century Cures Act of 2016 in the US, which specifically promotes the use of causal inference methodology and designs, such as the emulated trial and TMLE frameworks.<cit.>\n \n    \n    \n    \n\n  \n(v) Collaborations:   \n\n    The Center for Targeted Machine Learning and Causal Inference (CTML) is an interdisciplinary research centre at the University of California at Berkeley that is focused on applications of causal inference and targeted learning. The CTML mission is to advance, implement and disseminate methodology to address problems arising in public health and clinical medicine (<https://ctml.berkeley.edu/home>). CTML provides a great resource for courses, ongoing research, partners, collaborators, and Berkeley faculty members involved in TMLE. CTML sponsors include the Danish multinational pharmaceutical company, Novo Nordisk A/S, the Patient-Centered Outcomes Research Institute (pcori), Kaiser Permanente, the US National Institutes of Health, and the Bill and Melinda Gates Foundation. Academic partners include the University of Washington, University of Copenhagen, UCLA David Geffen School of Medicine, University of California at San Francisco, and Monash University.\n \n\n    \n\n    \n\n  \nConclusions\n    Evidence shows that cross-validated, double-robust, efficient and unbiased estimators are at the forefront of causal inference and statistics, as they aim to avoid model misspecification, bias and invalid inference. The TMLE framework for causal and statistical inference was first developed in 2006 and its expansion in applied studies arose in 2018 via applied epidemiological work, tutorials and user-friendly software. The theoretical properties and practical benefits of the TMLE framework have been highlighted across different fields of applied research (such as various epidemiological, public health and clinical disciplines). More can be done to reach a wider audience across varied disease areas and scientific fields (e.g., genomics, econometrics, political and sociological sciences), including the development of software packages outside the R software, tutorial articles as well as seminars and courses targeted to audiences in specific disciplines, lay-language demonstration, such as by example, of the benefits of TMLE in improving epidemiological output, to name only a few ideas. Many recent TMLE developments answer a variety of methodological problems that expand across scientific disciplines and further efforts can be made to disseminate the framework. This would facilitate the conscientious application of TMLE for causal inference and statistical data analyses, so more researchers could use it in their applied work to minimise the risk of reporting misleading results that are biased due to misspecification.\n\n\n\n\n§ FUNDING\n\nThis work was supported by the Medical Research Council [grant number MR/W021021/1]. A CC BY or equivalent licence is applied to the Author Accepted Manuscript (AAM) arising from this submission, in accordance with the grant’s open access conditions. Camille Maringe is supported by a Cancer Research UK Population Research Committee Programme Award (C7923/A29018).\n\n\n\n§ AUTHORS CONTRIBUTIONS\n\nThe article arose from the motivation to disseminate the principles of modern epidemiology among clinicians and applied researchers. All authors developed the concept and wrote the first draft of the article. MJS and CM reviewed the literature. MJS, RVP, MALF and CM drafted and revised the manuscript. RVP, SG and MJL provided comments on the draft manuscript. RVP contributed to drafting some sections. All authors read and approved the final version of the manuscript. CM is the guarantor of the article.\n\n\n\n§ ACKNOWLEDGMENTS\n\nThe motivation and some parts of the manuscript come from MALF's work in a visiting academic position in the Division of Biostatistics at the Berkeley School of Public Health in 2019.\nWe acknowledge Dr Susan Gruber for her careful read over one draft manuscript and Professor Mark J. van der Laan for his additional guidance.\n\n\nFor the purpose of open access, the authors have applied a Creative Commons Attribution (CC BY) licence to any Author Accepted Manuscript version arising.\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n    \n        \n    \n    \n    \n    \n    \n    \n    \n     \n    \n\n        \n\n    \n       [pages=1, scale=0.95, angle=90, pagecommand=tableArticles by discipline]Table_of_disciplines.pdf\n        \n        [pages=2-,scale=0.95, angle=90, pagecommand=]Table_of_disciplines.pdf\n    \n\n\n\n\n\n"}