{"entry_id": "http://arxiv.org/abs/2303.06758v1", "published": "20230312212346", "title": "Conceptual Modeling and Artificial Intelligence: A Systematic Mapping Study", "authors": ["Dominik Bork", "Syed Juned Ali", "Ben Roelens"], "primary_category": "cs.SE", "categories": ["cs.SE", "cs.AI"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ndominik.bork@tuwien.ac.at\n0000-0001-8259-2297\n\n  TU Wien, Faculty of Informatics, Business Informatics Group\n  Favoritenstr. 9-11\n  1040\n  Vienna\n  Austria\n\n\n\nsyed.juned.ali@tuwien.ac.at\n0000-0003-1221-0278\n\n  TU Wien, Faculty of Informatics, Business Informatics Group\n  Favoritenstr. 9-11\n  1040\n  Vienna\n  Austria\n  \n\n\nben.roelens@ou.nl\n0000-0002-2443-8678\n\n  Open Universiteit, Faculty of Science, Information Science Group\n  Valkenburgerweg 177\n  6419 AT\n  Heerlen\n  The Netherlands\n  \n\n  Ghent University, Faculty of Economics and Business Administration, Business Informatics Research Group\n  Tweekerkenstraat 2\n  9000\n  Ghent\n  Belgium\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nIn conceptual modeling (CM), humans apply abstraction to represent excerpts of reality for means of understanding and communication, and processing by machines. Artificial Intelligence (AI) is applied to vast amounts of data to automatically identify patterns or classify entities. While CM produces comprehensible and explicit knowledge representations, the outcome of AI algorithms often lacks these qualities while being able to extract knowledge from large and unstructured representations. Recently, a trend toward intertwining CM and AI emerged. This systematic mapping study shows how this interdisciplinary research field is structured, which mutual benefits are gained by the intertwining, and future research directions.\n\n\n\n\n\n\n\n<ccs2012>\n   <concept>\n       <concept_id>10011007.10011006</concept_id>\n       <concept_desc>Software and its engineering Software notations and tools</concept_desc>\n       <concept_significance>500</concept_significance>\n       </concept>\n   <concept>\n       <concept_id>10010147.10010178</concept_id>\n       <concept_desc>Computing methodologies Artificial intelligence</concept_desc>\n       <concept_significance>500</concept_significance>\n       </concept>\n </ccs2012>\n\n\n[500]Software and its engineering Software notations and tools\n[500]Computing methodologies Artificial intelligence\n\n\n\n\n\n\n\n\n\n\nConceptual Modeling and Artificial Intelligence: A Systematic Mapping Study\n    Ben Roelens\n    March 30, 2023\n===========================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nIn the last 60 years, Artificial Intelligence (AI) has become of strategic importance for organizations as it enables them to realize technological development in support of efficiently discovering and delivering innovative products and services <cit.>. In particular, AI benefits from a large amount of available data to build intelligent applications and support fact-based decision making <cit.>. AI refers to software and/or hardware systems designed by humans that, given a complex goal, act in the physical or digital dimension by perceiving their environment through data acquisition, interpreting the collected structured or unstructured data, reasoning on the knowledge or processing the information derived from this data, and deciding the best action(s) to take to achieve the given goal <cit.>. AI systems are developed in domains like Machine Learning, Natural Language Processing (NLP), Computer Vision, Knowledge Representation, Automated Reasoning, Multi-agent Systems, etc. <cit.>.\nAlthough AI offers a vast range of opportunities for more efficient use of data in a digitized world, the quality of the data poses a significant challenge for organizations <cit.>. This implies that the data collection should be well embedded with the existing domain knowledge across different organization units to obtain consistent data sets. Furthermore, AI systems act as a black box that yields non-explainable results, which prevents a clear understanding and control of the followed process by human stakeholders. \n\nOne can employ Conceptual Modeling (CM) techniques to tackle these challenges of AI systems as this domain has adopted a broad focus on enterprise-wide models and the complete business-to-IT domain <cit.>. CM enables the formal description of some aspects of the physical and social world around us for purposes of understanding and communication <cit.>. In the context of AI systems, four relevant CM purposes can be distinguished: (i) representing a system <cit.>, (ii) analyzing the properties of a system <cit.>, (iii) (re-)designing a to-be system <cit.>, and (iv) generating code to realize a system <cit.>. However, the value of CM is primarily appreciated in the collaboration between business architects and IT stakeholders, which results in a limited impact inside the organization <cit.>. \n\nThe combined use of CM and AI techniques defines the CMAI (i.e., Conceptual Modeling & Artificial Intelligence) domain, which offers the opportunity to enhance the advantages and eliminate some of the disadvantages within the individual domains <cit.>. The combined value of CMAI is increased from two directions, the value added by CM to AI and, from the opposite direction, the value that AI adds to CM. This leads to the following characterization of research contributions in the CMAI domain <cit.>: (i) Exaptation, i.e., combining existing solutions from both fields to target a specific problem (e.g., <cit.>); (ii) CM-driven, i.e., (re-)designing CM techniques combined with existing AI techniques to target a specific problem  (e.g., <cit.>); (iii) AI-driven, i.e., (re-)designing AI techniques combined with existing CM techniques to target a specific problem  (e.g., <cit.>); and (iv) CM- & AI-driven, i.e., (re-)designing both AI and CM techniques to target a specific problem (e.g., <cit.>). \n\nGiven the recency of the CMAI domain, getting a complete conceptualization is essential to increase the understanding of the domain and guide future research efforts. This conceptualization will be realized by performing a systematic mapping study (SMS) on the relevant literature <cit.>. An SMS is preferred to a systematic literature review in this case as it enables to structure the overall body of knowledge through multiple categorization taxonomies <cit.>. Furthermore, these taxonomies support visual exploration to efficiently gain insights into the new CMAI domain. Literature reviews and mapping studies in the CMAI domain exist (see Sect. <ref>). Still, existing works only focus on separated aspects of the AI and or CM domain, thereby preventing a comprehensive analysis of existing research and future research opportunities.\n\nWe automated the first part of the search process to enable such a comprehensive analysis of the CMAI domain. This included an automated extraction of the bibliometric data and the source files that resulted from the search queries' execution, which also enabled further filtering on the obtained paper sets regarding research discipline, publication type, and document length. Afterwards a manual analysis was feasible to assess the relevance of the content for the CMAI domain and to classify the papers according to the different categorization taxonomies, which we developed while being influenced from existing works: research type (influenced by <cit.>), contribution type (influenced by <cit.>), modeling purpose (influenced by <cit.>), AI domain (influenced by <cit.>), and AI modeling value (influenced by <cit.>). Sect. <ref> will provide more details on the development of the taxonomies. Afterward, we analyze how modeling languages and AI techniques have been combined throughout the last three decades. Furthermore, we present a web knowledge base[<http://me.big.tuwien.ac.at/cmai> currently only accessible to the reviewers. We will make it publicly available with the publication of this article.] that allows others to replicate the findings of this mapping study and to perform customized search queries in the CMAI domain. We will continuously update this web knowledge base to enable explorative search in the CMAI domain to the entire research community. Finally, implications for future CMAI research are derived based on these analyses.\n\nThis paper is structured as follows. Sect. <ref> discusses related systematic literature reviews and mapping studies in the CM, AI, and CMAI domains. The research method that was followed for performing the mapping study is detailed in Sect. <ref>, while Sect. <ref> gives an answer to the proposed research questions. The CMAI web knowledge base is briefly introduced in Sect. <ref> and Sect. <ref> presents the implications for future research. A discussion of the validity and reliability of the findings is presented in Sect. <ref>, after which this paper is concluded in Sect. <ref>.\n\n\n\n§ RELATED WORK\n\n\nThis section provides an overview of related work, i.e., related systematic literature reviews and mapping studies. As our research is positioned in the intersection of CM and AI, related works are first presented covering CM, followed by those works on AI. Eventually, we will report on existing works related to the combination of the two domains.\n\nIn the CM field, systematic literature/mapping studies exist that review the use of a particular (group of) modeling language(s). In work proposed by Wolny et al. <cit.>, research on the Systems Modeling Language (SysML) between 2005 and 2017 is analyzed. This general-purpose architecture modeling language is an OMG standard for Systems Engineering applications <cit.>. In particular, Wolny et al. <cit.> execute a mapping study of 579 publications to get an overview of existing research topics and groups, to identify publication trends, and to uncover missing links in the research domain. A broader view is adopted in other studies, which focus on the use of modeling languages for a particular purpose. Febrero et al. <cit.> report on a mapping study of 503 papers to develop a taxonomy of modeling languages for software reliability. La Rosa et al. <cit.> analyze 66 publications in a systematic literature review about business process variability modeling. The authors provide a comparative evaluation of the used languages to identify relevant modeling features, provide selection criteria among modeling approaches, and identify research gaps in the domain. In work by Silva et al. <cit.>, the use of CM for Model-Driven Engineering (MDE) is investigated, which includes the creation or automatic execution of software systems starting from these models. In particular, the authors conduct a literature survey to develop a unified model that identifies and relates the essential concepts of MDE. Wortmann et al. <cit.> present an analysis about the use of CM languages and techniques in a particular application domain, namely Industry 4.0. The extended mapping study reviews 408 publications to overview expected CM benefits, addressed Industry 4.0 concerns, CM languages used, applied research methods, involved countries and institutions, publication venues, and the temporal evolution of publication activities.\n\nResearch in the AI domain has been studied by Lu <cit.>, who performed a long-term mapping study of 7522 articles covering multiple angles in the AI domain: evolution through time, applications in industries, and challenges and future directions. Pournader et al. <cit.> present a systematic analysis of AI applications in Supply Chain Management. In particular, 150 studies are analyzed to discuss the present and future state of the domain and the clusters of knowledge that currently exist.\n\nNumerous systematic literature reviews and mapping studies are related to the CMAI domain by means of the fact that they cover at least a subset of the CMAI domain. The first category analyzes the interplay between CM and a selected AI technology or AI domain. For example, in <cit.>, a systematic literature review is conducted to give an overview of 38 state-of-the-art research papers on implementing NLP in user stories. In particular, the authors focus on the contribution of NLP, the specific approaches that were used, and the challenges of using NLP in user story research. A similar focus is adopted by Zhao et al. <cit.>, who analyze the use of NLP for Requirements Engineering. The authors present an SMS of about 404 relevant studies to conceptualize the studied combinations along with the following aspects: state of the literature, state of empirical research, research focus, tool development, and the usage of NLP technologies. Zaidi et al. <cit.> review the use of CM for Machine Learning and vice versa. In total, ten papers are analyzed in detail to discuss the combined use of both and the challenges and opportunities related to this combination.\n\nThe second group of related works reviews the added value of applying one specific CM language in the AI domain. The work proposed by Goncalvez et al. <cit.> discusses the use of iStar extensions, which is a goal modeling language for documenting requirements in software development. Although the literature review considers a wide range of application areas, 19 papers are identified covering the use of iStar to model agents, adaptive systems, autonomic systems, intelligent environments, and robotic systems. Liu et al. <cit.> performed a literature review on the use of fuzzy Petri Nets to formalize knowledge representation and reasoning in rule-based expert systems. In total, 99 papers are analyzed to give an overview of existing theories and models, review the use of fuzzy Petri Nets in different application fields, and discuss current research trends and future research opportunities. \n\nThe third category of related works reviews CMAI research in a particular application domain. In work proposed by Lee et al. <cit.>, the development and use of multi-agent modeling techniques and simulations are analyzed in the context of production design and development, production planning and control, and supply chain management. To this end, the authors review 114 applications to describe the state-of-the-art literature and to identify significant issues and a future vision for multi-agent modeling research.\n\nThe preceding discussion of related works shows the impressive amounts of work that analyze individual aspects of either CM or AI, or a very focused (e.g., application domain specific) combination of the two fields. To the best of our knowledge, the study we propose in this paper is the first of its kind by aiming for a broad, comprehensive, and inclusive scope on CM and AI that is not limited to particular modeling languages, AI techniques, or application domains.\n\n\n\n§ RESEARCH METHOD\n\n\nIn the paper at hand, we report the findings of an SMS. Such studies aim \"at exploring broad research areas by classifying the most representative studies in a particular subject and investigating generic research questions.\" <cit.>. Choosing an SMS over a Systematic Literature Review <cit.> was motivated by the goal to classify and thematically analyze the vast body of literature on CM and AI instead of, e.g., identifying best practices <cit.>. Furthermore, our search focus is broad, aimed to respond to generic research questions <cit.>. We followed the SMS research protocol proposed by Petersen et al. <cit.> which is widely adopted and well recognized in the community (for exemplary applications, see <cit.>). The protocol is composed of five phases (see Fig. <ref>), which will be discussed in the remainder of this paragraph. \n\n\n\n\n\n §.§ Phase 1: Definition of research scope\n \nTypically for SMS, the research scope is broad, and the research interest, which is formalized by the research questions, is generic <cit.>. In our SMS, we thus concentrated on responding to the following research questions:\n\n\n\n  RQ-1: What is the state of the literature on CMAI? We want to know, who are the main contributors in the field, what types of reseaerch are contributed, and where is CMAI research published (i.e., the publication venues).\n\n  RQ-2: Which type of research is performed in CMAI? We want to know which type of research is primarily reported on in CMAI (e.g., solution, evaluation, etc.) and also which contribution type the research offers to the scientific community (e.g., concepts, algorithms, etc.).\n\n  RQ-3: Which modeling languages are combined with AI? We want to investigate which languages are used in combination with AI techniques.\n\n  RQ-4: Which AI techniques are combined with CM? We want to explore which AI techniques are used in combination with CM languages.\n\n  RQ-5: What are the mutual benefits of combining CM and AI? \nWe want to know the benefits CM brings for AI and, vice versa, the benefits AI brings for CM.\n\n  RQ-6: Which collaboration communities exist for CMAI? We want to know, what are the most active collaboration communities conducting CMAI research and on which topics they work on.\n\n\nFor many of the proposed research questions, we are interested in the current state and the longitudinal development (i.e., the trend analysis) of the CMAI research. \n\n\n\n §.§ Phase 2: Conduct search\n \nFollowing the guidelines proposed by Kitchenham et al. <cit.>, an SMS search query should be generic and guided by the topic of the study. Consequently, our search query combines the terms that best characterize Conceptual Modeling and Artificial Intelligence. The potential risk of having too many hits as a result of the broad search query can, to some extent, be mitigated by the fact that we are only interested in works intersecting both domains. Our study is based on the following logically structured search query that was also influenced by related previous SMSs (see Sect. <ref>):\n\n\n    Q = ( CM_i)  ( AI_j), where\n\n\n\n\nCM_i∈ {\"conceptual modeling\" OR \"metamodel\" OR \"meta-model\" OR \"domain specific language\" OR \"modeling formalism\" OR \"modeling tool\" OR \"modeling language\" OR \"modeling method\" OR \"model driven\" OR \"model-driven\" OR \"mde\"}\n, and\n\n\n\n\n\n\nAI_j∈ {artificial intelligence\" OR \"ai\" OR \"machine learning\" OR \"ml\" OR \"deep learning\" OR \"dl\" \"neural network\" OR \"genetic algorithm\" OR \"smart\" OR \"intelligent}.\n\n\n\nIn the executed query, we added the plural forms, e.g., \"modeling languages\" and the British English version, e.g., \"modelling method\" where applicable. We executed the query on the five well respected scientific databases ACM Digital Library, IEEE Explore, Science Direct, Scopus, and Web of Science. We took the deliberate choice to rather be more generic with our search terms, e.g., including \"smart\" and \"intelligent\" for the AI search query part, instead of including not scientifically curated databases like Google Scholar.\n\n\n\n\n\n §.§ Phase 3: Screening of papers\n \nIn the third step of an SMS, inclusion and exclusion criteria need to be defined to separate the relevant and irrelevant papers. For the study at hand, two following generic inclusion criteria were defined:\n[label=IC-*:]\n    \n  * Publications reporting on the combination of CM and AI (decided based on title, abstract, and keywords); \n    \n  * Peer-reviewed publications (i.e., articles in journals, conferences or workshops, and book chapters).\n\n\nWe applied the following list of exclusion criteria to identify and exclude irrelevant papers:\n[label=EC-*:]\n    \n  * Publications considering only CM or AI; \n    \n  * Publications not written in English; \n    \n  * Publications for which the full text is not available; \n    \n  * Extensions of already considered publications (we used the extended version); \n    \n  * Non-Peer-reviewed and non-scientific publications (e.g., editorials, tutorials, books, extended abstracts); \n    \n  * Publications not related to Computer Science (e.g., social sciences, chemistry); and \n    \n  * Publications with less than five or more than 100 pages.\n\n\nThe search was performed on 20th May 2021 on all five databases and yielded a total number of 27,255 potentially relevant documents (see Fig. <ref>). We retrieved the results from Scopus using the available API. The API response provided us with all the relevant information about the publications. We downloaded all the values from the online search portal for IEEE, ACM, Science Direct, and Web of Science. Once we had the downloaded citations, we transformed the BibTeX files to CSV. Once we had the CSVs of all the individual datasets, we removed the duplicates, which yielded 18,335 remaining documents. Fig. <ref> shows the number of results retrieved from the respective sources and the remaining number of unique hits after removal of the duplicates based on title and DOI (if present). We then removed all the publications that did not belong to the Computer Science discipline using the classification of the search databases (e.g., Science Direct). That resulted in 12,680 remaining documents. Afterward, only conference papers, book chapters, and journal articles (IC-2) were considered. We thus filtered based on document type (IC-2 and EC-5), which yielded 12,680 remaining documents. In the next step, we further applied a page length filter (EC-7), decreasing the number of remaining documents to 10,944, thereby concluded the filtering based on bibliometric data and metadata.\n\nIn the final stage of the search process, we manually reviewed the remaining 10,944 documents. We first downloaded the abstracts of all documents, read them, and decided on the relevance to our study. In this stage, 888 documents remained relevant (IC-1, EC-1). We then tried to retrieve all full-texts (EC-3) of these 888 documents, read them entirely, applied the remaining exclusion criteria (EC-2 and EC-4), and mapped them to our multi-faceted classification scheme. Eventually, 460 documents were considered relevant and were mapped.\n\nThe generic and broad search query can explain the considerable effect of the filtering, which removed 98.32% of the documents. For example, many documents were found that only considered CM in combination with the term 'smart,' i.e., modeling in smart cities <cit.>. We also learned and consequently excluded studies that use the term 'meta-model' not in the sense we consider it relevant in the Computer Science domain. Many studies, e.g., from the mechanical engineering domain, use the term to relate to an artificial object that imitates the behavior of a physical thing for means of analysis and simulation <cit.>.\n\n\n\n §.§ Phase 4: Keywording of Abstracts\n \n\nIn the fourth step of the SMS procedure proposed by Petersen et al. <cit.>, the authors of the SMS read the abstracts of the relevant papers and \"look for keywords and concepts that reflect the contribution of the paper\" <cit.>. Once all authors of this paper read a representative sample of paper abstracts, we conducted a brainstorming session to identify relevant facets to characterize the CMAI research field and respond to the research questions introduced at the outset adequately. In the following, we will introduce the classification schemes, which will be used in Sect. <ref> to map the relevant literature into a coherent structure.\n\n\n\n  §.§.§ Research type taxonomy\n\n\nPapers can be categorized according to four different types of research: Vision, Solution, Evaluation, and Experience. This taxonomy is adopted from <cit.> and further refined based on <cit.> (see Table <ref>).\n\n\n\n\n\n  §.§.§ Contribution type taxonomy\n\n\nThe literature will be classified according to five different types of research contributions: Discussion, Concepts, Methods, Algorithms, and Tools. The precise definition of this classification structure is given in Table <ref>, which is an extension based on <cit.>.\n\n\n\n\n\n  §.§.§ Modeling taxonomy\n\n\nThe modeling taxonomy reflects the wide range of CM purposes included in our SMS. The taxonomy incorporates studies spanning from pure Representation purposes as stressed by, e.g., Mylopoulos <cit.>, Nelsen et al. <cit.> amongst others <cit.>, to means of using conceptual models (i.e., the resulting artefact of the CM process <cit.>) to Analyze an existing system under study , e.g., by means of simulations of model queries <cit.>. Furthermore, the taxonomy includes the use of conceptual models to (Re-)Design or even automatically Generate the Code of a new system, i.e., treating models \"as central artefacts in the software engineering process” <cit.>.\n\n\n\n\n\n  §.§.§ AI Modeling Value Taxonomy\n\n\nIn this taxonomy, we are interested in analyzing the benefit/value that AI brings for CM. The two main groups of stakeholders of conceptual models are the creators and the users of a model <cit.>. With regard to model creation, AI can help to (semi-)automate or even automate parts of the development process by data acquisition and interpretation <cit.>. On the other hand, AI may facilitate model use by analyzing model data and providing relevant information, and/or processing the model content to identify action(s) that achieve the goals of model users <cit.>.\n\n\n\n\n\n  §.§.§ AI Taxonomy\n\n\nThe AI field is even more extensive than CM and composes many techniques applicable to different contexts. It is therefore not surprising that there exists not yet a commonly agreed-upon definition of AI. Existing definitions are furthermore very diverse spanning the metaphors thinking humanly, acting humanly, thinking rationally, and acting rationally (cf. <cit.> for an overview of selected AI definitions). For our SMS, we adopted a recently proposed AI taxonomy that composes eight AI domains and 16 AI subdomains <cit.> (see Table <ref>). \nThe taxonomy has been proposed in response to the lack of a common definition of AI and to account for the heterogeneity of AI research. It, therefore, is expressive enough to cover the broad scope we want to apply in our SMS.\n\n\n\n\n\n §.§ Phase 5: Data Extraction and Mapping\n\nThe final phase of our SMS, as proposed by Petersen et al. <cit.>, is the data extraction and mapping phase. We set up a shared Google Docs spreadsheet to collaborate remotely. The taxonomies were pre-configured in the spreadsheet to ease the mapping process. We conducted weekly meetings to discuss the progress, streamline the taxonomies, and develop a coherent and consistent evaluation of the papers. Once we finished the mapping, we applied several data processing steps to generate insights and visualizations. All findings of this step will be presented in detail in the Sect. <ref>.\n\n\n\n§ FINDINGS\n\n\n\nIn this section, we present the findings of our SMS. The research questions will be responded to by explaining the results of mapping the remaining relevant papers to the individual taxonomies introduced at the outset. As our SMS comprises 460 eventually relevant papers, some results of categories like the used CM language or the countries the study authors are affiliated with exceed the space and hamper visual representation when presenting all individual results. In such cases, we will define a threshold that constrains the values shown in this paper. A comprehensive analysis of all results is provided in the accompanying web knowledge base (see Sect. <ref>). The presentation of the findings is structured as follows: Sect. <ref> provides a bibliometric analysis, reporting, e.g., on a longitudinal overview of CMAI research and the most active contributors to the field; Sect. <ref> then reports on the content of the CMAI contributions, e.g., how often a CM language is used in combination with AI techniques; and eventually, Sect. <ref> reports on an analysis of the CMAI research communities.\n\n\n\n §.§ Bibliometric Analysis\n\n\nAs a response to RQ-1, this section describes the current state of the literature on CMAI research, including an analysis of (i) the number of papers and the (ii) the publication types over time. Moreover, this also includes an analysis of the (iii) main contributors to CMAI research and (iv) the primary publication venues used.\n\n\n\n  §.§.§ Longitudinal overview of CMAI research\n\n\nFig. <ref> depicts the number of papers per year, which shows a zigzag pattern with a positive trend. Note that the figure for 2021 only shows the results until the 20th of May. The first two papers in the CMAI domain date back to 1988, and the number increased to a maximum of 50 in 2019. The domain took off slowly as 15% of the publications were published between 1988 and 2005. Afterward, the growth has steadily accelerated, which resulted in 48.9% of the publications since 2015. Hence, it can be concluded that there has been a growing interest in the combined use of CM and AI techniques, which shows the increasing relevance of the CMAI domain in the last three decades.\n\n\n\nFig. <ref> shows that the work in the CMAI domain is currently mainly published as conference papers (i.e., 60.4% of publications in the period 2019-2021) and journal articles (i.e., 37.7% of publications in the period 2019-2021). This mutual ratio has remained relatively stable over time, with a mean of 63.7% conference papers (i.e., 293 of 460) and 34.1% (i.e., 157 of 460) journal articles since 1988. The absolute number of book chapters fluctuates between 0 and 5 over the years.\n\n\n\n\n\n  §.§.§ Main contributors\n\n\nThe publication share per country is given in Fig. <ref>, which includes all countries with more than five contributions. To identify the countries, we analyzed the geographical location of all authors' affiliations. This resulted in 26 countries for the 1,186 authors in the dataset. The five most contributing countries, which account for 39.2% of the publications, are distributed between North America and Europe, including the United States (60 publications), France (47 publications), Spain (47 publications), Germany (41 publications), and Canada (40 publications).\n\n\n\nTable <ref> analyzes the institutions that are most active in CMAI research. The leading institution that published relevant research is the Complutense University of Madrid in Spain (14 papers), particularly the Research Group on Agent based Social and Interdisciplinary Applications (GRASIA) of the Department of Software Engineering and Artificial Intelligence. Notably, three Canadian universities are part of the five most active institutions (i.e., the University of Toronto, McGill University, and the University of Montreal), besides the Ege University of Turkey.\n\n\n\n\n\n  §.§.§ Publication channels\n\n\nTable <ref> gives an overview of the most popular journals and conferences that published CMAI research. These provide a good starting point for authors searching for channels to distribute CMAI research. Nevertheless, the journals and conferences in Table <ref> only account for 16.5% of the publications in the dataset, which illustrates the fragmentation that currently still exists in the domain. This is not surprising, as this SMS is the first effort to provide a broad overview of the CMAI field. Regarding the journals, Expert Systems with Applications is the most popular by disseminating ten papers since 2005. The conference that published most CMAI research (i.e., 12 publications) is the International Conference on Model Driven Engineering Languages and Systems (MoDELS). \n\n\n\n\n\n §.§ Content Analysis\n\n\nAs a response to RQ-2 through RQ-5, this section contributes the content analysis of the surveyed CMAI research. This includes (i) a meta-analysis of the research and contribution types (Sect. <ref>); (ii) an analysis of the CM facet (modeling languages and modeling purpose) in Sect. <ref>; (iii) an analysis of the AI facet in Sect. <ref>; and (iv) an analysis of the combined use of CM and AI in Sect. <ref>.\n\n\n\n  §.§.§ Meta Analysis\n\n\nIn a meta analysis, we are interested to classify the research type (see Table <ref>) and the contribution type (see Table <ref>) of CMAI research.\n\n\n\n  \nResearch type.\n\nThe majority of CMAI research (i.e., 436 occurrences) is oriented towards solving a particular problem and demonstrating the applicability of a proposed solution (see Fig. <ref>). The second most occurring research type is evaluation, which was observed in 179 cases. In 172 papers (i.e., 37.4% of the dataset), the proposed solution is supplemented by an evaluation, which is in line with the Design Science Research (DSR) methodology <cit.>. DSR research proposes a solution with an evaluation to complete the iterative build-and-evaluate loop, i.e., DSR research includes the development of a new artifact and the use of this artifact to solve a particular problem <cit.>. Vision and experience papers remain a niche in the CMAI domain with respectively 16 and 1 occurrence(s) since 1988.\n\n\n\n\n\n  \nContribution type.\n\nThe main contribution types of CMAI research are concepts (204 occurrences), followed by algorithms (192 occurrences), methods (105 occurrences), tools (34 occurrences), and discussions (17 occurrences). Although tools are only presented as an explicit research contribution to a limited extent, we observed that 294 papers in the dataset use some form of tool support, of which 19.7% is openly available via a public link. Fig. <ref> further shows that algorithms have been the dominant contribution type since 2016, which can be explained by the rising application of AI techniques as Machine Learning, Genetic Algorithms, NLP, etc. \n20% of the papers in the dataset make multiple contributions, with the following occurrences: concepts & algorithms (49 occurrences), concepts & methods (27 occurrences), methods & algorithms (10 occurrences), concepts & tools (2 occurrences), methods & tools (2 occurrences), algorithms & tools (1 occurrence), and concepts & methods & algorithms (1 occurrence). These combinations show that multiple artifacts may be needed to address a broad problem, which also corresponds to the DSR perspective.\n\n\n\n\n\n  §.§.§ CM Analysis\n\n\nIn the following, an analysis is performed concerning the used modeling language and the modeling purpose taxonomy (see Table <ref>).\n\n\n\n  \nModeling Language.\nThe publication share per modeling language (group) is given in Fig. <ref>, which includes all languages with more than five occurrences in the dataset. These languages represent 90.6% of the modeling languages and 87.8% of the publications in the survey data. The modeling languages are roughly evenly distributed between being specific to the targeted problem domain (i.e., Domain-Specific Modeling Languages (DSMLs), Domain Ontologies, and UML (i.e., Unified Modeling Language) Profiles with 276 occurrences), and the following general-purpose modeling languages (i.e., a total of 214 occurrences): UML, Petri Nets, Ecore (i.e., part of the Eclipse Modeling Framework), Entity Relationship models, Goal models, Business Process Modeling Notation (BPMN), and SysML.\n\n\n\n\n\n  \nModeling Purpose.\nFig. <ref> gives an overview of the modeling purpose in the CMAI research papers. The most occurring purpose over time is the use of conceptual models to create a descriptive representation of the system under study (282 occurrences). Notably, the purpose of representation is often a precursor for the other purposes, as manifested by the following observed combinations: representation & analysis (72 occurrences), representation & (re-) design (26 occurrences), representation & (re-) design & analysis (41 occurrences), and representation & code generation (6 occurrences). Since 2010, model-based code generation has gained importance in the CMAI field and currently occupies the second position with an incidence of 153. The use of CM for simulation or query analysis (106 occurrences) and (re-)designing a future version of the system (68 occurrences) remains relatively stable with only slight fluctuations over time.\n\n\n\n\n\n\n  §.§.§ AI Analysis\n\n\nThe analysis of the AI domain follows subsequently. First, the results for the mapping to the AI domain and subdomain are reported, followed by the mapping results concerning the value AI brings to CM.\n\n\n\n  \nAI subdomain.\nNote that the AI subdomains Connected and Automated vehicles, AI Ethics, and Philosophy of AI were not found in the dataset and are therefore not represented in Fig. <ref>. The occurrences of all remaining 13 (of the 16 introduced) AI subdomains (cf. Table <ref>) are presented in Fig. <ref>. Over the complete dataset, the AI subdomains can be classified according to the frequency with which they have been addressed in the CMAI domain: Multi-agent systems (139 times), Knowledge representation (123 times), Machine learning (117 times), Optimization (82 times), NLP (37 times), Automated reasoning (31 times), Planning and Scheduling (16 times), Searching (12 times), Robotics and Automation (11 times), AI Services (8 times), Computer vision (5 times), Common sense reasoning (3 times), Audio processing (1 time).\nWhen analyzing the evolution, the fast growth of the Machine Learning domain since 2016 stands out. Besides, a slight increase can be observed for NLP use since 2019. Nevertheless, this rise in importance needs to be confirmed in the future. This is in contrast to the other domains, which show a flattening pattern over time – albeit the increase in the total number of publications (cf. Fig. <ref>).\n\n\n\n\n\n  \nAI value to CM.\nFig. <ref> shows that AI brings value to the CM domain in 254 papers. The main benefit can be categorized as Model Use - Processing, which was observed 163 times. This category has been clearly dominant since 2004, followed by Model Use - Analysis (34 occurrences), Model Creation - Automated (33 occurrences), and Model Creation - Semi-Automated (30 occurrences). The occurrence of these benefits fluctuates between 1 and 10 over the 3-year intervals, so the mutual importance of these benefits changes regularly.\n\n\n\n\n\n  §.§.§ CM and AI Analysis\n\n\nIn the following, we report on the findings on the combination of CM and AI. We first analyze the combination between modeling language and AI technique before combining three taxonomies to further dig into the most occurring combinations in CMAI research. \n\n\n\n  \nCM language and AI technique.\nFig. <ref> gives an overview of the combined use of modeling languages and AI techniques. The most popular combination is using DSMLs with Multi-Agent Systems (67 occurrences). This type of modeling language is also commonly used with Machine Learning (32 occurrences), Deep Learning (16 occurrences), and NLP (11 occurrences). Another language that stands out is UML, which is combined with AI techniques as Genetic Algorithms (50 times), Machine Learning (20 times), NLP (13 times), and Multi-Agent Systems (10 times). Other remarkable combinations are the use of Petri Nets with Fuzzy sets (13 occurrences) and the one of a Domain Ontology with Multi-Agent Systems (11 occurrences). All remaining combinations in Fig. <ref> have less than ten occurrences in our dataset.\n\n\n\n\n\n  \nModeling language, modeling purpose, and AI value to CM.\nFig. <ref> shows the most commonly used CM languages, their modeling purpose, and the value AI brings to CM. In line with the analysis in Fig. <ref>, we see that Model Use - Processing is the primary value offered by AI to CM. In particular, this value is mainly realized in the context of UML (82 occurrences) and DSMLs (47 occurrences). Although the other benefits of AI to CM are less frequent, UML and DSMLs are also mainly employed to realize these. This goes hand in hand with the modeling purpose (see right side of Fig. <ref>), which shows that DSMLs and UML are applied for the different modeling purposes with a total incidence of respectively 289 and 126. This demonstrates broader usability compared to the other languages in the dataset.\n\n\n\n\n\n  \nAI technique, contribution type, and modeling purpose.\nFig. <ref> gives an overview of the contribution type and modeling purpose in combination with the different AI techniques. Overall, it can be observed that algorithms are developed as the main contribution for most AI techniques, such as Genetic Algorithms, Machine Learning, NLP, Deep Learning, etc. These algorithms are mainly combined by descriptive models representing the system under study.\nBesides, concepts and methods are particularly relevant for model representation in the context of Multi-Agent Systems and Machine Learning. For these techniques, the languages also support the purposes of analysis, code generation, and (re-)design. \nThe development of tool support as an explicit research contribution is still immature in the current CMAI research, so frequently occurring combinations cannot yet be identified.\n\n\n\n\n\n §.§ Research Community Analysis\n\n\nIn the following, we present the results of a co-authorship analysis performed on our dataset aimed at responding to RQ-6. Fig. <ref> shows the research communities contributing to the domain of CMAI. It shows all 1,186 authors in our dataset and all co-authorships. Nodes in the graph represent authors, and edges between nodes represent co-authorship, i.e., connected nodes have at least one co-authored paper. In total, the analysis yielded 330 communities comprising between 1 and 28 members (i.e., collaborations through a co-authored paper in our dataset).\n\nWhen digging into the community analysis, we were interested in identifying the most active CMAI research communities in our dataset based on (i) the size of the community (i.e., the number of nodes), and (ii) the strength of the community (i.e., the number of co-authored documents). The sub-communities sharing more than two authors are present in the same color, while communities sharing a bridge author or bridge edge (like the community visualized in Fig. <ref>) have different colors. We ranked the communities first based on their size, followed by their strength. Table <ref> summarizes the five most active communities. Each community is described by its central author(s), the total number of authors, and the total number of publications. We furthermore used the dataset and particularly analyzed the papers authored by these five communities. Consequently, Table <ref> also shows the specific contributions and focus of the five most active CMAI research communities. In the following, we will briefly describe these five communities, Figs. <ref> and <ref> further visualize the two most active CMAI research communities.\n\n\n\n\n\n\n    \n  Community centering Houari Sahraoui and Manuel Wimmer: This community consists of 28 authors with ten documents in our dataset. The community has two sub-communities centered at Manuel Wimmer and Houari Sahraoui. Houari Sahraoui co-authored five publications, Manuel Wimmer is co-author of four publications in our dataset. These two communities work primarily on CMAI with Genetic Algorithms in the AI domain used for Code Generation and Representation in the modeling domain. This community primarily uses Ecore and UML Class Diagrams as modeling language. The analysis further showed that Wael Kassentini bridges the two sub-communities. \n    \n  Community centering Eric Yu, Li Jiang, John Mylopolous, and Zhixue Wang This community consists of 27 authors who contributed 12 documents to our dataset. It comprises four sub-communities centered at Eric Yu, Li Jiang, John Mylopolous, and Zhixue Wang. Eric Yu is the most active author for this community, co-authoring eight publications. This community is primarily focused on Machine Learning for the AI domain and Representation & Analysis for the CM domain. Some works are also related to Multi-Agent Systems and Automated Reasoning for the AI domain and Code Generation and Analysis for the CM domain. The most common combination is using the Goal Model language with Machine Learning. Goal Models and other DSMLs are used for representation analysis, while Machine Learning is primarily used to support Model Processing and Model Analysis. Mylopolous and Wang further focus on Automated Reasoning and on using DSMLs for Code Generation. \n    \n  Community centering Kardas Geylani and Moharram Challenger This community consists of 17 authors with ten publications. Kardas Geylani and Moharram Challenger are the most active authors for this community, co-authoring eight publications. This community is primarily focused on Knowledge Representation with Multi-Agent Systems and using modeling for Code Generation. DSMLs are used in several cases.\n    \n  Community centering Vivianne Torres Da Silva: This community consists of 17 authors with seven publications. Vivianne Torres Da Silva is the most active author for this community co-authoring all seven publications. This community is primarily focused on Multi-Agent Systems for the AI domain and Code Generation and Representation for the conceptual modeling domain. Some works are also related to Multi-Agent systems and Automated Reasoning. This community's most commonly applied modeling languages are UML Profiles and DSMLs, which are used for Representation, Analysis, and Code Generation. \n    \n  Community centering Rubén Fuentes-Fernández This communtiy consists of 13 authors with eight publications in our dataset. Rubén Fuentes-Fernández is the most active author with seven publications. This community is very similar to the community centering Kardas Geylani and Moharram Challenger because it also focuses on Multi-Agent Systems and the use of DSMLs for Code Generation and Representation.\n\n\n\n\n\n\n§ CMAI WEB KNOWLEDGE BASE\n\n\nIn addition to the SMS we report with this article, we present a web-based knowledge base for our SMS that provides easy access to and enables efficient exploration of the publications, active authors, and prominent venues related to CMAI research. Our platform supports keyword-based search for publications, authors, and venues. All the searched publications are further tagged with the CM and AI taxonomies introduced in Sect. <ref> (see Fig. <ref>). The CMAI web knowledge base can be accessed via <http://me.big.tuwien.ac.at/cmai>[Please use the following credentials to log in, we will openly release the web knowledge base only with the publication of this article: U: j@g.com, PW: 123].\n\n\n\nThe CMAI web knowledge base is intended to support the researchers interested in the CMAI domain and make the relevant resources easily accessible using our search platform. The platform initially supports the following use cases:\n\n    \n  Publications search Our platform supports searching for publications based on keywords. The search query for publications is matched with the title and abstract of all publications in the CMAI SMS dataset. Fig. <ref> shows the publications results page. The results page shows the total number of publications matching the search query. The title of each search result is a hyperref linking to the DOI of the paper, allowing users to navigate to the full text of a publication directly. The results page also allows the user to see the abstract of a search result by clicking the \"see the abstract\" button. \n    \n    The user can also further filter the results using the three taxonomies: AI, CM, and Research Method (for research type and contribution type). The filtering allows multiple selections of taxonomy values, and the results are then evaluated based on the intersection of these taxonomy values. The user is also allowed to filter papers based on the publication year. By default, all the taxonomy values part of the search results are selected. In the left part of Fig. <ref>, one can see the details of the AI technique taxonomy with all taxonomy chosen values and the corresponding number of results indicated. Each publication is further tagged with the corresponding taxonomy value (see the right side of Fig. <ref>). \n    \n  Authors search The CMAI web knowledge base allows users to search for the authors in our SMS by searching for author names in the query. The results page shows the total number of authors matching the search query. Furthermore, all publications in the dataset that those authors co-authored are presented. The platform also supports the filtering of results based on the taxonomies of the SMS, publication year, and the affiliation country of the author.\n    \n  Venue search The CMAI web knowledge base allows users to search for relevant venues matching a search query. The results show the total number of venues matching the query and all the publications in the dataset that have been published at this venue. The results can be further filtered using the taxonomies of the SMS.\n\nNote that for all three uses cases, the platform also supports the search with an empty string, then showing all results of the dataset.\n\n\n\n§ IMPLICATIONS FOR FUTURE RESEARCH\n\n\n\nBased on the insights of Sect. <ref>, we can derive the following implications for future research. First, the bibliometric analysis shows that CMAI research is topical, given the growing interest in the domain since 2015. This is also evinced by a panel discussion with the topic 'Artificial Intelligence meets Enterprise Modelling' at the Forum of the Practice of Enterprise Modeling (PoEM) workshop in 2019 <cit.> and several workshops organized at international CM conferences (e.g., the CMAI workshop at Modellierung (since 2020) <cit.>, the MDE Intelligence workshop at MoDELS (since 2019) <cit.>, the CMAI workshop at ER (since 2020) <cit.>, and the International Workshop on Business Process Innovation with Artificial Intelligence (since 2017) <cit.> at BPM. This indicates that current CMAI research is primarily CM-driven, in which the CM techniques are (re-)designed by existing AI techniques to target a specific problem. This observation shows that much potential is left for the CM community to provide value by (re-)designing AI techniques in combination with the use of CM (i.e., AI-driven research). In this respect, the CMAI web knowledge base (Sect. <ref>) supports researchers interested in the different aspects of the CMAI domain and makes the relevant resources easily accessible using the search functionality. \n\nThe meta-analysis indicates that CMAI research is very suited to be guided by a Design Science Research methodological perspective  <cit.>, as problems are addressed by the realization of different contributions (i.e., concepts, methods, algorithms, and tools) and iterative build-and-evaluate loops are needed. As such, the application of a design cycle offers the opportunity to realize a research contribution that combines both scientific rigor and practical relevance <cit.>. The combined analysis shows that concepts and methods are particularly relevant for model representation in the context of Multi-Agent Systems and Machine Learning. At the same time, algorithms are developed as the main contribution for most AI techniques, such as Genetic Algorithms, Machine Learning, NLP, Deep Learning, etc. These algorithms are mainly combined by descriptive models representing the system under study.\n\nBesides, Vision and Experience papers are highly welcomed to supplement current CMAI research efforts, as this type of research is currently still underrepresented in the CMAI domain. Given the current tool support, the meta-analysis also shows a need for openly available tools, which are presented as an explicit contribution of the research. This will foster the application of CMAI concepts, methods, and algorithms and reinforce the reproducibility of the presented results.\n\nThe content analysis of the papers reveals that DSMLs and UML are the mainly used modeling languages in the CMAI domain. Given their broader usability compared to the other languages, they provide an exciting starting point for future research in the field. Model-based code generation, Machine Learning, and NLP gained importance during the last decade, which offers an opportunity for future research in the CMAI domain. Besides, no research is currently available in the AI subdomains Connected and Automated vehicles, AI Ethics, and Philosophy of AI. It would be helpful to investigate whether multidisciplinary CMAI research projects could be beneficial to fill this gap.\n\n\n\n§ THREATS TO VALIDITY\n\n\nWe will report on the threats to validity related to our SMS in the following. We will refer to the widely adopted generic set of validity threats proposed by Wohlin et al. <cit.>: Construct validity, Internal validity, External validity, and Conclusion validity. As we report on an SMS, the presented results reflect the investigated domain (i.e., CM and AI in our case) but naturally cannot be generalized. Consequently, external validity is not an issue, and the following discussion will concentrate on the remaining threats. Moreover, in the conclusion validity, we will relate to the specific reliability threats of mapping studies in Software Engineering that have been proposed in <cit.>.\n\nAlthough SMSs are intended to provide an unbiased and complete overview of a specific domain of interest, such studies are still prone to validity threats. Most importantly, it needs to be stated that all results reported in this paper are only based on the sample of documents that (i) were found by our search query and that (ii) fit our inclusion and exclusion criteria. As soon as one of these parameters is altered, the results will also significantly change. As we aimed to provide a comprehensive overview of the CMAI domain, we designed the search query as inclusive as possible to enable a subsequent manual analysis and mapping. Consequently, we included search terms like 'intelligent' and 'smart,' which increased the initial hits with many papers that did not meet the inclusion/exclusion criteria and were dropped throughout the process. Still, this general query ensured we did not miss relevant work.\n\nLooking at the inclusion and exclusion criteria, we focused on the intersection of CM and AI and high-quality, peer-reviewed works. In response to the latter argument, we omitted Google Scholar from the database selection and defined appropriate exclusion criteria (e.g., excluding non-scientific articles, imposing a minimum paper length, etc.). \n\nWith respect to internal validity, it needs to be stated that our SMS only covers the published works, i.e., it is prone to the publication bias. Moreover, we also only consider works written in English. Reliability also threatens the results presented in this paper. A study is reliable if the results are the same if the mapping is performed a second time. Here, we see the issue that it might not always be decidable, which taxonomy values can be mapped to a specific paper. Although we related our taxonomies to related works and established definitions, we arguable see a threat. Taxonomies like modeling purpose or AI modeling value have a subjective part, while many others like the modeling language and AI technique taxonomies are objective (and therefore considered more reliable). To mitigate this reliability threat, we conducted pilot mappings and conducted regular meetings throughout the mapping phase where we discussed the indistinct cases. Moreover, we set up a shared Google Docs spreadsheet with the pre-configured taxonomies. This ensured that all authors were able to track the entire mapping process, and it made sure that (i) only valid taxonomy classes were mapped to a paper, and (ii) that within one category only the proper taxonomy was applied.\n\nTo ensure replicability, we transparently followed a rigorous research methodology. We further developed and openly shared a web knowledge base for our SMS to trace the mapping process and reproduce the results we presented. We also mitigated the fishing problem <cit.> because we were entirely open and curious about the state of research in the CMAI domain. Not a single paper of one of the authors is part of the dataset. Finally, all conclusions were drawn after the analysis, when the findings materialized.\n\n\n\n§ CONCLUSION\n\n\nTo the best of our knowledge, this article is the first to systematically and comprehensively analyze the state of research that combines CM and AI. Starting from 27,255 documents, 460 relevant ones have been identified, systematically analyzed, and mapped to respond to several research questions. With this SMS, we reported on the current state of CMAI research and the most used modeling languages and AI techniques in this domain. We further analyzed which combinations of modeling languages and AI techniques are most frequent and investigated the purpose and value of such a combination. The study at hand also showed the most active research communities and the publication channels that are used to publish CMAI research by applying network analysis. \n\nOur mapping study revealed a dominance of DSMLs and UML as the primary modeling languages used in CMAI research. Given their purpose- and stakeholder-specific design, DSMLs seem to provide an exciting starting point for many CMAI researchers. Especially, DSMLs are frequently combined with Multi-Agent Systems, Machine Learning, Deep Learning, while the UML is most often combined with Genetic Algorithms, Machine Learning, and NLP. We further found that quite some research exists in combining Petri Nets with AI; most often, these works combine it with Fuzzy Sets. AI is generally most often used to process the information provided by a conceptual model, whereas CM is most often used for representation with a recent update of code generation purposes.\n\nAlthough the first works in CMAI date back to the late 1980s, the field is gaining more and more traction in recent years, most probably also influenced by the popularity of AI research. Our dataset shows that 48.9% of the publications have been published since 2015. Since 2011, 67% of all CMAI papers in our dataset have been published. With the expected continued increase of interest in CMAI research, we believe this article plays an essential role in structuring the state of research, showing vital research areas and areas that are still open for initial contributions. Developing the CMAI web knowledge base further enables efficient exploration of the CMAI domain. The platform is available via <http://me.big.tuwien.ac.at/cmai>.\n\n\n\n\nACM-Reference-Format\n\n\n"}