{"entry_id": "http://arxiv.org/abs/2303.06749v1", "published": "20230312205535", "title": "A Logistics Provider's Profit Maximization Facility Location Problem with Random Utility Maximizing Followers", "authors": ["David Pinzon", "Emma Frejinger", "Bernard Gendron"], "primary_category": "math.OC", "categories": ["math.OC", "90-10 (Primary), 90-05 (Secondary)"], "text": "\n\nConceptual Modeling and Artificial Intelligence: A Systematic Mapping Study\n    Ben Roelens\n    March 30, 2023\n===========================================================================\n\n\n\n\nWe introduce a strategic decision-making problem faced by logistics providers (LPs) seeking facility location decisions that lead to profitable operations. The profitability depends on the revenue generated through agreements with shippers, and the costs arising when satisfying those agreements. The latter depend in turn on service levels and on characteristics of the shippers' customers. However, at a strategic level, LP has imperfect information thereof.\n\nWe propose a stochastic bilevel formulation where a given LP (leader) anticipates the decisions of shippers (followers) arising from a random utility maximization model. Using a sample average approximation and properties of the associated optimal solutions, we introduce a non-conventional single-level mixed integer linear programming formulation that can be solved by a general-purpose solver. We can quickly identify situations that lead to zero expected profit for the LP. Experimental results show that optimal expected profit is highly dependent on shippers' price sensitivity. Underestimating it can lead to an overestimation of expected profits.\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nGrowth in online shopping and omni-channel distribution leads to logistical challenges, and outsourcing of logistics operations is a widely used strategy <cit.>. We focus on transportation services offered by a logistics provider (LP) – a carrier or third-party logistic provider – to its clients, shippers. The market environment for LPs is challenging. It is highly competitive and demand patterns change over time. There is also a need to reduce negative environmental footprint which requires changes in infrastructure and fleet composition (e.g., by electrification). LPs therefore face important planning problems where it is key to consider profitability at all stages.\n\n\nThis work deals with the problem of a given LP seeking to make strategic facility location decisions that lead to profitable operations. The profitability depends on the revenue generated through agreements with shippers – demand for offered service levels and associated prices – and the cost arising when satisfying those agreements. The latter depends in turn on service levels and customer characteristics, such as their location. Focusing on a given LP, we introduce a profit maximizing facility location problem where the decisions, in addition to locations, pertain to service levels and prices. It is challenging to solve because of the interdependence between different actors. Namely, LP makes agreements with shippers but the cost of operations largely depends on characteristics of the shippers' customers. At a strategic planning level, the LP has imperfect information thereof.\n\n\nOur strategic profit maximization facility location problem has similarities with facility location and pricing problems. Closest to our work are studies that deal with both facility location and pricing decisions formulated as bilevel programs <cit.>. These are hierarchical decision-making problems where a leader first takes decisions, anticipating the follower's reactions (lower-level problem). In our problem, a given LP is the leader, and shippers are the followers. Unlike existing work, a challenging aspect of our problem is the endogenous uncertainty associated with the LP's cost (leader objective function) that arises because of unknown characteristics of shippers and their customers. Our work is complementary to studies on tactical transportation service procurement problems <cit.>, as the strategic facility location decisions we focus on are made before any procurement process takes place.\n\nThis paper offers four main contributions. First, we consider a problem of high practical relevance to LPs in general, and to our industrial partner, Purolator, in particular. We offer a first attempt to address this problem that, to the best of our knowledge, has not been studied before. Second, the problem can be naturally modeled with a stochastic bilevel formulation where shippers make decisions according to a random utility maximization model. Noteworthy are the intrinsic and endogenous uncertainty in the LP's costs due to imperfect knowledge of the shippers' reactions and their customers' characteristics. Third, using a simulation-based model approximation and properties of the associated optimal solutions, we propose a non-conventional single-level mixed-integer linear programming reformulation. Fourth, we report an experimental study where we analyze the impact of model parameters on solutions and computing times. For most settings, we can solve instances of sizes relevant in practice within a reasonable computing time. Optimal expected profit displays important variations depending on price sensitivity and the level of uncertainty associated with shipper and customer reactions. Notably, we can identify situations where there is no profitable solution quickly (i.e., expected costs exceed expected revenue). The occurrence of the latter depends on the level of price sensitivity. Moreover, the expected optimal profit increases with increasing level of uncertainty. Underestimating price sensitivity can hence lead to an overestimation of optimal expected profits.\n\nThe remainder of the paper is structured as follows. Section <ref> offers a detailed description of the problem, and Section <ref> reviews related work. Section <ref> exposes the mathematical programming formulation. Section <ref> supplies an illustrative example and Section <ref> reports detailed experimental results. Section <ref> concludes.\n\n\n\n\n§ PROBLEM DESCRIPTION\n\n\nThis section provides a detailed description of the problem and introduces the relevant notation. Tables <ref> and <ref> in Appendix <ref> summarize the latter. We start by describing the actors – LP, shippers and customers – and related concepts. We then outline the decision-making problem of the LP and its link to shippers and customers.\n\nWe consider an LP that offers logistics operations services to its clients, a set of shippers N. In turn, each shipper n ∈ N needs to satisfy the demand d_j of its customers j ∈ J^'_n. The customers with same profile and preferences are grouped into categories k ∈ K_n according to known characteristics. We denote by J_k the set of customers who belong to the same category k ∈ K_n. They can be end-consumers or businesses depending on the type of business the LP deals with – business-to-consumer (B2C) or business-to-business (B2B).\n\nThe LP seeks to make strategic facility location decisions that will lead to profitable operations in the future. The profitability depends, on the one hand, on revenue-generating agreements with shippers that fix price and service levels and, on the other hand, on the cost of serving the shippers' customers. The strategic facility location decisions take place before procurement processes that fix the agreements, and consequently before the operational planning of service to customers. The LP therefore has to take into account the agreements and the link to the cost of serving customers at a high level and under imperfect information.\n\nWe note that we adopt a highly abstract perspective on the complex organization of this industry. Shippers are also profit maximizing actors in the market. They are purchasing services from the LP and reselling them to their customers. However, we do not explicitly represent this problem because of lack of information of individual shippers. Instead, we consider shipper preferences and price sensitivity as implicitly dominated by the preferences of their customers. \n\nAgreements with shippers fix the price and service levels. In this context, the LP defines a set of offered service levels m ∈ M_nk for each shipper and customer category (denoted by binary variables z_nk^m) as well as the associated prices t_n^m. Note that it is not indexed by k as the LP does not control the pricing to customers. \n\nThe cost of allocating customer demand d_j j∈ J to facility i∈ I at a variable cost c_ij^m depends on the service level m∈ M and the geographical location of the demand and the facility. Associated with each facility is a fixed opening cost f_i and capacity u_i. We denote by w_ij^m and r_i the binary decision variables related to assignment of customers to facilities and the opened facilities, respectively. Note that the service levels may lead to different capacity usage of the facilities. For example, a higher service level may require more resources.\n\nEach shipper decides to accept or reject the price and service level assignments offered by the LP. If the shipper accepts, then the demands from the corresponding customers are included in the agreement. Shippers can also opt to drop some of their customers from the agreement if, given the LP's offer, they prefer insourcing their own logistics operations or outsourcing them to other LPs. This is henceforth referred to as opt-out. Consequently, having chosen a given shipper, the customers are captive to the shipper's decisions and face the service levels and prices fixed in the agreement. Customer preferences determine their choice of shipper and choice of service levels. Shippers therefore need to take their customers' preferences into account when concluding agreements with LPs. Hence, the decisions of accepting or rejecting offers made by the LP, denoted by binary variables x_nk^m, depend on the shippers as well as on their customers' preferences. Note that at this strategic decision level, the LP has imperfect information about such preferences but can have knowledge about certain customer attributes. Moreover, the LP makes facility location decisions before shipper and customer preferences are revealed.\n\n In summary, we consider a strategic decision-making problem faced by an LP seeking to open facilities that lead to profitable operations. Therefore, when making such decisions, it takes into account the expected revenue generated by agreements with shippers, and the costs arising when satisfying those agreements (i.e., serving the shippers' customers). Given the conflicting objectives between the profit maximizing LP and cost minimizing shippers' and customers, the problem naturally lends it self to a bilevel formulation that we delineate in Section <ref>. To the best of our knowledge, this problem has not been studied in the literature before. However, as we discuss in the following section, it shares similarities with facility location and pricing problems, as well as transportation service procurement problems. \n\n\n\n\n§ RELATED WORK\n\n\nIn this section, we discuss related work in the literature on facility location and pricing problems, and transportation service procurement problems. We focus the discussion on similarities and contrasts with our problem.\n\nThere is an extensive literature studying facility location and pricing problems separately. Works treating the joint problem is relatively scarce.  We therefore distinguish facility location problems in which customers show preferences for facilities but without considering pricing <cit.>, from those that include pricing in the problem <cit.>.\nOnly a few of the latter <cit.> consider followers that show preferences towards price levels in addition to the characteristics of the facilities. \nMost studies consider objectives of cost minimization <cit.>, revenue maximization <cit.> or captured-demand maximization <cit.>. To the best of our knowledge, the literature on profit maximization is scarce <cit.> and in these cases, the cost is easy to incorporate. \nWe address a facility location and pricing problem where the objective is to maximize profit. However, unlike in existing work, the cost in the leader problem depends on follower reactions which are not perfectly known. In other words, there is endogenous uncertainty around costs (they depend on leader decisions) which constitutes a key challenge.\n\nOur strategic decision-making problem has similarities with transportation service procurement problems arising at the tactical level. This literature focuses on different mechanisms to define short- or long-term agreements between shippers and carriers (in our case LPs).\nNoteworthy are combinatorial auctions for transportation procurement <cit.>. Typically the focus lies on single-level formulations and first-price auctions assumptions <cit.>. \nHowever, there are also bilevel formulations where the leader is a carrier and shippers are the followers <cit.>.\nWe are not aware of any work that considers facility location decisions. Our work is complementary to the literature on procurement as we focus on strategic facility location decisions and only take pricing into account at a high level.\n\n\n\n\n§ MATHEMATICAL PROGRAMMING FORMULATION\n \n\nThis section expounds the mathematical formulation of our problem. Its underlying assumptions and a compact form of the formulation are outlined in Section <ref>. The latter clearly shows the stochastic bilevel structure of our problem.\nIn Section <ref>, we present the detailed constraints and a simulation-based version of the formulation. Then, we show that this version can be reformulated into a single-level mixed integer linear program (MILP) that we can solve effectively with a general purpose solver. We present the results that lead to the MILP formulation in Section <ref>.\n\n\n\n §.§ Preliminaries\n\n\nWe introduce the assumptions and the compact formulation on which we build our subsequent developments. In our strategic setting, we consider the pricing problem at a high-level and therefore assume the existence of a finite set of prices and service levels based on which the LP's defines its offers to the shippers and their customers.\n\nassumptionAssumption\n\nThe LP decides among a finite set of discrete price levels {q^p: p ∈ P}, where q^1 < q^2 < ⋯ < q^|P|. \n\n\n \nFor each shipper n ∈ N, and each service level m ∈ M_n, there is a subset of possible price levels {q_n^mp: p ∈ P_n^m ⊆ P}.\n\n\nBased on this assumption, the price t_n^m charged for service level m to  shipper n can only take discrete values. \nWe introduce the binary decision variables y_n^mp taking value 1 if price q_n^mp is selected, and 0 otherwise. Hence, we have \n\n    t_n^m=∑_p ∈ P_n^m q_n^mp y_n^mp.\n\n\n\nEach service level m has a capacity usage proportional to a scale factor γ^m ≥ 1.\n\n\n\nA minimum demand level l_n^mp is required from shipper n to have access to service level m at price level q_n^mp.\n\n\n\nAlternatives from competitors are grouped into one unique alternative service level, called opt-out, denoted by 0.\n\n\n\n\n        P_n^0=∅, that is, there is no price available for opt-out alternative m=0.\n\n\nBased on Assumption <ref>, customers in category k of a given shipper n can choose an alternative from the set m ∈ M_nk∪ 0.\n\nWe now introduce assumptions that allow us to model shipper and customer preferences with random utility maximization (RUM) models <cit.>. \n\n\nThe preference of shipper n for a service level m is modeled by an utility U_n^m, which can be expressed as the sum of the corresponding utilities U_nk^m of each of their customer categories, that is, U_n^m=∑_k ∈ K_n U_nk^m. \n\n\n\nThe deterministic utility U_nk^m for a given price level is U_nk^m=α t_n^m+L_nk^m, where α is the parameter capturing price sensitivity and L_nk^m, is an exogenous variable that captures the preference of the customers to the service level.\n\n\nUsing (<ref>),  we can write utility U_nk^m as\n\n    U_nk^m(𝐲) =α( ∑_p ∈ P_n^m q_n^mpy_n^mp)+L_nk^m.\n\n\nBased on Assumption <ref>, the utility of the opt-out alternative is U_nk^0=L_nk^0 since ∑_p ∈ P_n^0 q_n^0py_n^0p=0. Whereas the utility depends on decision variables y_n^mp. \nIn order to simplify the mathematical expressions, we use a shorthand notation to designate vectors made up of individually indexed variables. Thus, 𝐲 stands for the vector made up of y_n^mp, ∀ n, m, p. Similarly, ε, 𝐳, 𝐱, 𝐫, 𝐰 respectively stand for ε_nk^m, z_nk^m, x_nk^m, ∀ m,n,k;  r_i, ∀ i  ∈ I; w_ij^m, ∀ i, j, m.\n\nGiven our strategic setting and the inherited uncertainty surrounding the demand distribution, we assume that utilities are not perfectly known. Adopting the additive RUM theory, we assume that utilities include additive noise.\n\n\nU_nk^m(𝐲;ε_nk^m) = α( ∑_p ∈ P_n^m q_n^mpy_n^mp)+L_nk^m +ε_nk^m, where ε_nk^m is a continuous random variable with support Ξ. \n\n\nFinally, we make an assumption about the assignment of customers to facilities aligned with the practice that multiple facilities can service a same customer.\n\n\nThe assignment of customers to facilities is not strict, that is, \n0 ≤ w_ij^m ≤ 1.\n\n\n\nOur problem can naturally be formalized as a bilevel program where the LP and the shippers respectively play the roles of the leader and the followers. To clearly show the structure of our problem, we introduce a compact form \n\n    max 𝐄_ε[G(𝐲,𝐳,𝐫,𝐱,𝐰)   :  (𝐲,𝐳,𝐫, 𝐰) ∈ H(𝐱); 𝐱∈ F(𝐲,𝐳;ε)].\n\n\nAlthough we have not provided any details about the RUM yet, stochasticity is implicit.\n\nThe LP's objective function G(·) and constraints H(·) depend on the follower's decision variables 𝐱. In turn, shippers' reaction depend on the LP's decision variables 𝐲 and 𝐳 as well as random variables ε. The objective function G(·) as well as the set H(𝐱) are implicitly affected by the random variables ε through decision variables 𝐱. This is one of the challenging aspects that we focus on in subsequent sections. \n\nThe set of optimal solutions of the shippers is \n\n    F(𝐲,𝐳;ε) =argmax [∑_n ∈ N∑_k ∈ K_n∑_m ∈ M_nk^0U_nk^m(𝐲,ε_nk^m)x_nk^m:  x_nk^m∈ R(𝐳);  n ∈ N, k ∈ K_n, m ∈ M_nk].\n\nThe feasible set of shippers solutions for given LP's decisions is\n\n    R(𝐳) = {∑_m ∈ M_nk^0x_nk^m = 1, ∀ n ∈ N, k ∈ K_n  ;  \n        x_nk^m≤ z_nk^m,    n ∈ N, k ∈ K_n, m ∈ M_nk}.\n\nThe first set of constraints states that the shipper can choose exactly one of the service levels proposed by the LP, or the opt-out alternative. The second set of constraints indicates that the shipper can choose the service level only if it was offered to the shipper and the customer category. The random variables ε affect the objective function of the shippers but not the set R(𝐳). The shipper's objective is to maximize utility U_nk^m(𝐲,ε), and, assuming a negative perception of price (α < 0), this objective is conflicting with the profit maximizing objective of the LP. The demand allocation decisions 𝐰 do not affect the set of optimal decisions F(𝐲,𝐳;ε) as they do not impact the service perceived by the shippers. Notice that the shipper's problem can be decomposed: The set F(𝐲,𝐳;ε) can be partitioned as F(𝐲,𝐳;ε) = ⋃_n ∈ N, k ∈ K_n F_nk(𝐲,𝐳;ε) where F_nk(𝐲,𝐳;ε) represents the set of optimal solutions for each shipper n and customer category k. \n\n\n\n\n §.§ Simulation-based Model Formulation\n\n\nThis section presents a formulation based on the compact form (<ref>) describing the constraints and the RUM model in details.\n\nChoice probabilities of RUM models are non-linear in the decision variables. This is one of the challenges associated with their use in mathematical programming formulations. This has essentially been dealt with in two different ways in the literature: either through linearization of, e.g, the well-known logit model <cit.>, or by using simulated linear utilities as opposed to probabilities and relying on sample average approximation (SAA) <cit.>.  \nWe adopt the latter as it allows to use any RUM model as long as it is possible to simulate utilities. Accordingly, in this section we introduce the SAA corresponding to (<ref>). \nSince the shippers' preferences are revealed only after the LP's strategic decisions, we use a two-stage stochastic bilevel structure. \nOur first-stage decision variables are the prices y_n^mp, the service level assignments z_nk^m and the facility location decisions r_i. \nSince the LP can only allocate demand to facilities once shippers accept to include those customers in the agreements, the second-stage decision variables are shippers' binary decisions to accept or reject service level offers, x_nk^m, and the LP's demand allocation decisions, w_ij^m. \n\nOur first-stage problem is\n\n    max -∑_i ∈ If_ir_i+Q(𝐫,𝐳,𝐲)\n\n\n    s.t.   ∑_p ∈ P_n^my_n^mp≤ 1,         n ∈ N, m ∈ M_n, \n       ∑_m ∈ M_n∑_p ∈ P_n^m y_n^mp≤ |K_n|,         n ∈ N, \n       ∑_m ∈ M_nkz_nk^m ≤ 1 ,         n ∈ N, k ∈ K_n, \n        z_nk^m≤∑_p ∈ P_n^my_n^mp,         n ∈ N, k ∈ K_n,  m ∈ M_n, \n       r_i∈{0,1},         i ∈ I, \n       y_n^mp∈{0,1},        n ∈ N,  m ∈ M_n,  p ∈ P_n^m, \n       z_nk^m∈{0,1},         n ∈ N,  k ∈ K_n,  m ∈ M_n.\n\nThe objective function in (<ref>) is the expected profit. Its first term captures the fixed cost of opening facilities and the second term is equal to the expected value of the second-stage problem Q(𝐫,𝐳,𝐲)=𝐄_ε[ϕ(𝐫,𝐳,𝐲;ε)].\nConstraints (<ref>) state that the LP can choose at most one price for each shipper and service level. Constraints (<ref>) ensure that the maximum number of price and service level combinations assigned to a shipper does not exceed the number of its customer categories. Constraints (<ref>) impose that the LP can choose at most one service level for each shipper and customer category. Constraints (<ref>) ensure that a customer category can be assigned to a service level only if the service level has been associated to a price level. \n\nNext, we turn our attention to the second-stage problem which is a bilevel program. \nUsing the approach proposed in <cit.>,  we estimate Q(𝐫,𝐳,𝐲) with an SAA approximation  Q̅(𝐫,𝐳,𝐲)=1/|S|∑_s ∈ Sϕ_s(𝐫,𝐳,𝐲;ε_s), where ε_s is a realization of ε for s∈ S and S is the set of scenarios drawn independently at random. For a given s, our second-stage problem is \n\n\n    ϕ_s(𝐫,𝐳,𝐲;ε_𝐬) = max∑_n ∈ N∑_k ∈ K_n∑_m ∈ M_k∑_p ∈ P_n^md_kq_n^mpx_nks^my_n^mp-∑_i ∈ I∑_j ∈ J∑_m ∈ M_jc_ij^mw_ijs^m\n\n\n    s.t.   ∑_j ∈ J∑_m ∈ M_jw_ijs^mγ^md_j≤ u_ir_i,        i ∈ I, \n       ∑_m ∈ M_jw_ijs^m≤ r_i,        i ∈ I, j ∈ J_i, \n       ∑_i ∈ Iw_ijs^m = x_nks^m,       n ∈ N, k  ∈ K_n, j ∈ J_k, m ∈ M_j, \n       ∑_k∈ K_nd_kx_nks^m≥∑_p ∈ P_n^ml_n^mpy_n^mp,        n ∈ N, m ∈ M_n,  \n       x_nks^m∈ F_nks(𝐲, 𝐳;ε_s),         n ∈ N,  k ∈ K_n,  m ∈ M_n, \n       0 ≤ w_ijs^m≤ 1,        i ∈ I, j  ∈ J, m ∈ M_j.\n\n\nThe first term in the objective function in (<ref>) corresponds to the revenue generated in this scenario, and the second term to the variable costs. Note that the latter depends on the assignment of specific customers to facilities.\nConstraints (<ref>) ensure that the demands assigned to facilities do not exceed the respective capacities. Constraints (<ref>) impose that customers are assigned to open facilities only. Constraints (<ref>) indicate that only the demand of customers included in the agreements is allocated to any facility. Constraints (<ref>) ensure that the required minimum demand level for price p and service level m is respected. Constraints (<ref>) refer to the domain of the decision variables w_ijs^m. \n\nIn Constraints (<ref>), the set of optimal solutions for the follower problem, corresponding to a shipper and customer category, is \n\n    F_nks(𝐲,𝐳; ε_s)= argmax [∑_m ∈ M_nk^0U_nks^m(𝐲;ε_nks^m)x_nks^m: ∑_m ∈ M_nk^0x_nks^m = 1;x_nks^m≤ z_nk^m; x_nks^m∈{0,1}].\n\nNote that the simulated utility U_nks^m(𝐲;ε_nks^m) = α( ∑_p ∈ P_n^m q_n^mpy_n^mp)+L_nk^m +ε_nks^m is linear in decision variables whereas the objective function is bilinear (<ref>). Moreover, when α<0 utility is decreasing as price increases, in contrast to (<ref>) which increases with price.\n\nThis two-stage stochastic bilevel formulation cannot be solved with a general purpose MILP solver. In the following section we introduce a reformulation that can.\n\n\n\n §.§ Reformulation\n\nIn this section we introduce a single-level MILP reformulation. It is based on insights about the nature of the optimal solutions. \nFirst, in Section <ref>, we show that we can compute optimal solutions to the follower's problem (<ref>) by solving a continuous unconstrained relaxation. Second, in Section <ref>, we establish a condition for trivial solutions, i.e., those for which the LP will not offer any agreement. Based on these results and model reduction, we finally introduce the resulting MILP reformulation in Section <ref>.\n\n\n\n  §.§.§ Continuous Relaxation of the Follower Problem\n \n\nPropProposition\n\nOptimal solutions to the follower's problem (<ref>) can be computed by solving a continuous relaxation\n\n    max[ (U_nks^m'(𝐲;ε_nks^m)-U_nks^0(ε_nks^0)  )x_nks^m': x_nks^m'∈ [0,1] ].\n\n\n\nBy replacing x_nks^0=1- ∑_m ∈ M_nkx_nks^m in (<ref>) and rearranging the corresponding terms x_nks^m, m ∈ M_nk, we obtain\n\n    argmax[ ∑_m ∈ M_nk(U_nks^m(𝐲;ε_nks^m)-U_nks^0(ε_nks^0)  )x_nks^m: x_nks^m≤ z_nk^m;  x_nks^m∈{0,1}, m ∈ M_nk].\n\nRecall that (<ref>) is solved for fixed z_nk^m and y_n^mp.  \nDue to Constraints (<ref>), either z_nk^m=0, ∀ m ∈ M_nk and as a consequence x_nks^m=0, or we solve the problem for a given m' where z_nk^m'=1. That is,\n\n    argmax[ (U_nks^m'(𝐲;ε_nks^m)-U_nks^0(ε_nks^0)  )x_nks^m': x_nks^m'≤ 1;  x_nks^m'∈{0,1}].\n\n Note that even if we relax the binary constraint in (<ref>), that is 0 ≤ x_nks^m'≤ 1, three cases can be distinguished in regard to the  objective function in (<ref>). \nFirst, U_nks^m'(𝐲;ε_nks^m')-U_nks^0(ε_nks^0)>0, in which case x_nks^m'=1 is optimal. \nSecond, U_nks^m'(𝐲;ε_nks^m')-U_nks^0(ε_nks^0)<0, in which case x_nks^m'=0 is optimal.\nThird, U_nks^m'(𝐲;ε_nks^m')-U_nks^0(ε_nks^0)=0, the probability that this case happens is zero as the samples are drawn from continuous distributions. \nHence, solving (<ref>) yields the optimal solution of (<ref>).\n\n\n\n\n  §.§.§ Condition for Trivial Second-Stage Solutions\n \n\nIt is useful to identify conditions for which first-stage decisions do not lead to an agreement. In other words, second-stage decision variables are zero. Those solutions are henceforth referred to as trivial solutions. Recall that the second-stage problem (<ref>)-(<ref>) consists in deciding the assignment of the customer's demand to the open facilities, but only for customers where U_nks^m(𝐲;ε_nks^m)>U_nks^0(ε_nks^0). Proposition <ref> states that if  U_nks^m(𝐲;ε_nks^m)<U_nks^0(ε_nks^0), then customers in category k of shipper n are not considered in the assignment and hence, their impact on ϕ_s(𝐫,𝐳,𝐲,ε_s) is zero. This is addressed in the following proposition.\n\n\n    For given s ∈Ω, and for the assignments z_nk^m and y_n^mp that lead to U_nks^m(𝐲;ε_nks^m)< U_nks^0(ε_nks^0) we have\n    \n    (U_nks^m(𝐲;ε_nks^m)-U_nks^0(ε_nks^0)) x_nks^m    =0, \n    \n            d_k q_n^mp x_nks^m y_n^mp- ∑_i ∈ I∑_j ∈ J^'_n ∩ J_kc_ij^m w_ijs^m   =0.\n\n\n\n\nIf U_nks^m(𝐲;ε_nks^m)< U_nks^0(ε_nks^0) then, as explained in the proof of Proposition <ref>, x_nks^m=0. Therefore, due to Constraints (<ref>), w_ijs^m=0, ∀ j ∈ J^'_n ∩ J_k, i ∈ I.\n\n\n\n\n  §.§.§ Single-level and Reduced Formulation\n \n\nThis section extends the discussion to the set of all scenarios Ω and derives a single-level MILP. First, let us consider a specific assignment y_n^mp and z_nk^m for shipper n and customer category k. In such case, note that the LP and shipper n are open to conclude an agreement only in the scenarios s ∈ S where U_nk^m(𝐲;ε_nks^m)> U_nks^0(ε_nks^0). In the rest of scenarios, as seen in Propositions <ref> and <ref>, shipper n is not willing to include customers in category k into the agreements and hence the LP will get zero profit from such customers. Therefore, we can anticipate the reaction of shippers in a single-level formulation through the condition U_nk^m(𝐲;ε_nks^m)> U_nks^0(ε_nks^0) in each scenario s. \n\nWe define a partition of the set of scenarios S, for each n and k as follows: S_nk^m = {s ∈ S:U_nks^m(𝐲;ε_nks^m)-U_nks^0(ε_nks^0)≥ 0}, and (S_nk^m)^c = {s ∈  S : U_nks^m(𝐲;ε_nks^m)-U_nks^0(ε_nks^0)<0}. \nAccordingly, for each z_nk^m and y_n^mp assignment, shipper n accepts the offer for customers in category k, x_nks^m=1, in a share |S_nk^m|/|S| of the scenarios. \n \nHence, we can define |S_nk^m|/|S| as the SAA of the probability that the utility of a price-service level alternative is greater than the opt-out alternative's utility for a shipper n and customer category k. This probability is defined as\n\n    ρ_nk^mp=P(U_nk^m(y_n^mp=1;ε_nk^m) ≥ U_nk^0(ε_nk^0) | z_nk^m=1 )=P(α q_n^mp+L_nk^m+ε_nk^m ≥ L_nk^0+ε_nk^0).\n\nFor a specific assignment z_nk^m=1 and y_n^mp=1, we have\n\n    lim _|S|→∞|S_nk^m|/|S|→ρ_nk^mp.\n\nThe latter can be computed using the scenarios s∈ S, or through a closed-form, if it exists. Importantly, we can compute ρ_nk^mp in a preprocessing phase hence avoiding the explicit use of scenarios in the formulation. This leads to a significant reduction in model size. \n\nNext, we introduce ρ_nk^mp in the objective functions of the leader and the second-stage problem. \n\nIn brief, the problem then consists in finding the combinations of prices and service levels with a ρ_nk^mp>0 that provides the maximum profit to the LP. The reformulation is relatively straightforward, especially for the revenue term in the objective, whereas the cost term requires a change of variables. \n \nNote that if we multiply each c_ij^m w_ij^m by ∑_p ∈ Py_n^mp for each j ∈ J^'_n, n ∈ N, m ∈ M_j and i ∈ I, we do not alter the solutions:\n\n    ∑_p ∈ Py_n^mp=0    ⟹  w_ij^m=0; ∀ i ∈ I, j ∈ J^'_n ∴∑_j ∈ J^'_n c_ij^m w_ij^m(∑_p ∈ Py_n^mp)=0,\n    ∑_p ∈ Py_n^mp=1    ⟹∑_j ∈ J^'_nc_ij^mw_ij^m.\n\nAccordingly, we can replace Q̅(𝐫,𝐳,𝐲) with\n\n    max   ∑_n ∈ N∑_k ∈ K_n∑_m ∈ M_k∑_p ∈ P_n^mρ_nk^mpd_kq_n^mpz_nk^my_n^mp \n        -∑_i ∈ I∑_j ∈ J∑_m ∈ M_j∑_p ∈ P_n_j^mρ_n_jk_j^mpc_ij^mw_ij^my_n_j^mp\n\n\n    s.t.    ∑_j ∈ J∑_m ∈ M_jw_ij^mγ^md_j≤ u_ir_i,         i ∈ I, \n       ∑_m ∈ M_jw_ij^m≤ r_i,        i ∈ I, j ∈ J_i, \n       ∑_i ∈ Iw_ij^m = z_nk^m,       n ∈ N, k  ∈ K_n, j ∈ J_k, m ∈ M_j, \n       ∑_k∈ K_nd_kz_nk^m≥∑_p ∈ P_n^ml_n^mpy_n^mp,         n ∈ N, m ∈ M_n,  \n       0 ≤ w_ij^m≤ 1,        i ∈ I,  j  ∈ J, m ∈ M_j.\n\nWe note the presence of bilinear terms in the objective function. We linearize them by introducing a new set of variables π_nks^mp≡ y_n^mpz_nk^m, ν_nk^m ≡ w_ij^my_n^mp:\n\n    π_nk^mp≤ z_nk^m,        n ∈ N, k ∈ K_n, m ∈ M_nk,  p ∈ P_n^m,\n    π_nk^mp≤ y_n^mp,       n ∈ N, k ∈ K_n, m ∈ M_nk, p ∈ P_n^m, \n    π_nk^mp≥ z_nk^m-1+y_n^mp,        n ∈ N, k ∈ K_n, m ∈ M_nk, p ∈ P_n^m, \n    π_nk^mp≥ 0,        n ∈ N, k ∈ K_n, m ∈ M_nk, p ∈ P_n^m,  \n    ν_ij^mp≤ w_ij^m,        n ∈ N, j ∈ J_n^', i ∈ I, m ∈ M_j, \n    ν_ij^mp≤ y_n^mp,       n ∈ N, j ∈ J_n^', i ∈ I, m ∈ M_j, \n    ν_ij^mp≥ w_ij^m+y_n^mp-1,        n ∈ N, j ∈ J_n^', i ∈ I, m ∈ M_j, \n    ν_ij^mp≥ 0,        n ∈ N, j ∈ J_n^', i ∈ I, m ∈ M_j.\n\n\nFinally we obtain the single-level MILP reformulation\n\n    max    -∑_i ∈ If_ir_i+∑_n ∈ N∑_k ∈ K_n∑_m ∈ M_k∑_p ∈ P_n^mρ_nk^mpd_kq_n^mpπ_nk^mp\n        -∑_i ∈ I∑_j ∈ J∑_m ∈ M_j∑_p ∈ P_n_j^mρ_n_jk_j^mpc_ij^mν_ij^mp\n    s.t.    (<ref>)-\n        (<ref>), (<ref>)- (<ref>).\n\n\n\n\n§ ILLUSTRATIVE EXAMPLE\n\n\nThis section introduces a small example to illustrate the impact of the RUM model. To this aim, we analyze three cases: First, a particular specification of the RUM model yields the probability of selecting an offered alternative, or the opt-out. Second, the LP assumes perfect information and that the opt-out is never selected. Third, the LP assumes no information (uniform distribution) and the opt-out is equally likely to select the opt-out as one of the offered alternatives. Before summarizing the findings for each of these cases, we describe the setting of the example.\n\nThere are two shippers, N={0,1}, each having a set of two customers: J_0^'={0,1} and J_1^'={2,3}. The demand levels for each customer of Shipper 0 are 50 and 100, whereas they are 20 both customers of Shipper 1. Hence, the total demand from Shipper 0 is 150, and it is 40 for Shipper 1. \n\nThe LP has the option to open two facilities, I={A,B} with a capacity of 150 and 50, respectively. The fixed cost of opening facility A is 250, and that of facility B is 140. We depict the structure of the facility location part of the problem in Figure <ref>(a). We show the corresponding values (u_i,f_i, γ_m) below a facility node. Note that we illustrate  the two facilities – A and B – twice to show that the assignment costs c_ij^m are affected by the service levels. We use sub-indexes when denoting the facilities to identify the corresponding service level. We also report the demand of each customer above the corresponding node. \n\nThe LP offers the same two service levels to both shippers, M={0,1}, with capacity usage rate of γ^1=1 and γ^2=1.15. Furthermore, they are both offered with the same price levels, P^0 = {6.0, 6.5} and P^1 = {6.3, 7.0} for services 0 and 1, respectively. \nHowever, the lower prices are only available if a minimum demand level is satisfied, 40 and 50 unites for levels 0 and 1, respectively (i.e., l_0^0,6.0=l_1^0,6.0=40 and l_0^1,6.3=l_1^1,6.3=50). Since the total demand for Shipper 1 is 40, it means that it cannot have access to the cheaper price for service level 1. The probabilities, shown next to the arcs in Figure <ref>(b), are fixed such that they are higher for lower prices than for higher prices. Moreover, it is likelier to select the opt-out for the higher prices, compared to the lower. Note that the sum of the probabilities of selecting an alternative, and the opt-out (not shown in the figure) equals one.  \n\n\n\nIn this setting (probabilities as in Figure <ref>(b)), the optimal solution with an expected profit of 125 consists in opening Facility A and serve all demand from Shipper 0 at Service level 0 and at price 6.0. Indeed, Shipper 0 then meets the minimum demand level. It is not optimal to serve Shipper 1. In this case Facility B would be required, but it would not be profitable as the expected revenue is less than the fixed cost of opening that facility. \nNote that only Service level 0 can be assigned to customers of Shipper 0. In case Service level 1 would be chosen, the capacity of Facility A would be exceeded (1.5x150>150).\n\nWe now turn to the case where we do not assume that the probabilities are given by a RUM model. Assuming perfect information and that the opt-out is never selected gives an upper bound on the expected profit. In this example it is 324, almost 3 times larger than the one discussed previously. On the contrary, considering a uniform distribution (third case), (ρ_nk^mp=0.5; ∀ n,k,m,p), yields a zero expected profit. Under such high uncertainty, it is not worth opening any of the facilities. \n\nThis small example illustrates that assumptions on shipper and customer preferences can have an important impact on expected profits and should therefore be taking into account when making strategic facility location decisions. In the following section we report computational results and analyze a variety of instances and parameter settings.\n\n\n\n§ COMPUTATIONAL RESULTS\n\n\nIn this section we aim to analyze the impact of key parameters on optimal expected profit and computation time, as well as assess how large instances we can solve to optimality. With this in mind, we divide the computational results into three parts. First, we analyze how profit varies in response to changes in the RUM model parameters (Section <ref>). For the sake of interpretability, we base this analysis on one example instance. Second, in Section <ref>, we focus on the capacitated facility location problem (CFLP) structure of our problem and generate multiple instances with varying characteristics. Third, we assess how computation time scales with increasing problem size (Section <ref>). More precisely, we fix demand model parameters to values that lead to relatively hard instances to solve, and we generate instances with increasing sizes (number of facility locations, customers and price levels). The following section provides more details on the experimental setup.\n\n\n\n\n §.§ Experimental Setup\n\nSince we introduce a new problem, we do not have access to existing benchmark instances, and we are unaware of an existing exact solution approach that we could use as baseline. However, we can use the CFLP structure of our problem to generate instances that are close to those in the literature. More precisely, we base our instance generation on the generator proposed by <cit.> and whose test instances where used in <cit.> and <cit.>. In the following we outline the setup with respect to a number of main characteristics.\n\n\n\n  \nLogistics provider. In Sections <ref> and <ref> we fix the numbers of facility locations |I|=4, service levels |M|=3 and price levels |P|=5. We use 15 and 23 as lower and upper bounds for price levels, and equal price steps are given by 23 -15/|P|-1 . For |P|=5, we therefore set P={15,17,19,21,23}. In the last section, we vary |I| and |P|. We use |P|={3,4,5}, and generate the corresponding price level sets as before. \n\nFor the sake of simplicity, we assume that the service levels do not impact the capacity utilization (γ^m=γ=1, ∀ m∈ M) in all of the results. However, we fix the relative costs of assigning customers to facilities for the three different service levels to be c_ij^1=c_ij, c_ij^2=1.05c_ij and c_ij^3=1.1c_ij. We note that c_ij, along with facilities' capacities u_i, fixed opening costs f_i, and customer demands d_j are fixed by the CFLP instance generator, as we detail next.\n\n\n\n  \nCFLP generator. We use the instance generator of <cit.> with a seed equal to 963490972. The values of  c_ij,  u_i, f_i and d_j are generated such that they satisfy a ratio of ∑_i ∈ Iu_i/∑_j ∈ Jd_j relating the capacity of the facilities and the total demand of the customers. In Section <ref>, we fix this ratio to 2, whereas we vary this value in Section <ref>. Finally, in the last section, we fix it to 1. \n\n\n\n  \nShippers and customers. In Sections <ref> and <ref>, we fix the numbers of shippers |N|=2, customers |J|=48 and customer categories |K|=3. In the last section, we vary |J|.\n\n\n\n\n  \nRUM model. In all of the experiments, we consider a logit model, i.e., ε follow an Extreme Value type I distribution with scale parameter β. For the sake of simplicity, we assume that all shippers and customer categories share a common utility specification\n\n    U_nk^mp=U^mp =α_n^m q^p+L_nk^m+ε=-0.1q^p+4.5+ε\n\nand that the utility of the opt-out alternative is U^m_0=3. It has been fixed so that the deterministic part of the utility for the opt-out and that of price q^0=15 are equal. The value of parameter α represents the customers' price sensitivity. In Section <ref>, we vary the value of α and β whereas they are fixed to α=-0.1 and β=1 in the subsequent sections.\n\n\n\n  \nInfrastructure and computing time budget. We perform computations on the Linux version of ILOG CPLEX 12.10 running on an Intel Core i7-7800X CPU at 3.50 GHz. Given the strategic nature of our problem, we consider a 10 hour computing time budget reasonable. For the smaller instances in Sections <ref> and <ref>, we impose a 2 hour time limit which allows us to solve all instances to optimality. In Section <ref>, we impose the 10 hour time limit.\n\n\n\n\n §.§ Interpreting the Impact of the Demand Model Parameters\n\n\nIn this section we first analyze the impact of the price sensitivity parameter values α on the optimal expected profit, followed by a similar analysis of the impact of the level of uncertainty as captured by the scale parameter β. We also report the computing times. For ease of interpretation, we focus on a single instance. Hence, the results are for illustrative purposes. Appendix <ref> reports details about the choice of parameter values.\n\nIn Figure <ref>, we show the optimal expected profit for  α values ranging from highly price sensitive customers (α=-0.453) to price insensitive (α=0). Note that β is fixed to 1. As expected, profit increases with decreasing price sensitivity. For highly price sensitive customers (in these results α≤ -0.226), the optimal expected profit is zero. For this case, LP does not tender any service offer as the expected costs exceed the expected revenue. \n\nThese illustrative results highlight the importance of modeling price sensitivity as it can have a major impact on the expected profit. Underestimating its value may lead to an overestimation of the expected profit, and in turn, to strategic facility location decisions that do not lead to profitable operations.\n\n\n\nIn Figure <ref>, we display a similar plot but for the computing time. We observe that a peak occurs for α close to -0.1. In this case, the problem becomes harder to solve due to a symmetry issue that arises when ρ_nk^mpq^p d_j in the objective function is similar for all price levels p. We focus the analysis of the computing time for larger instances in Section <ref> on instances displaying such symmetry issues.\n\nWe now turn our attention to the impact of uncertainty. For this purpose we vary the scale parameter of the Extreme Value type I distributed random terms. In Figure <ref>, we report the optimal expected profit for different values. These range from β=0.031, representing a close to degenerate distribution, to β=8. Note that we keep α fixed to -0.1. As uncertainty increases, we see a similar effect as that of decreasing price sensitivity, namely an increase in optimal expected profit. At the extreme, for large enough values of β, the distribution is close to uniform. It is then equally likely to choose the opt-out option (i.e., it does not depend on price).  \nIn other words, the deterministic part of the utility does not have an impact. We conclude that there is a trade-off between the magnitude of the deterministic part of the utility and the scale of the random term. We illustrate this in Figure <ref> where we show how the optimal expected profit varies for different values of α and two alternatives about β. When β=32, there is very little variation in optimal expected profit for all values of α (we note a slight decline as the magnitude of α increases). On the contrary, when β=1, the price sensitivity impacts the expected profit, albeit less severely than in the degenerate (deterministic) case. \n\n\n\n\n\nFinally, in Figure <ref>, we show how computing time varies as a function of β values. \nWe note a peak for β=1. For the same reason that we explained in the analysis of α values, this is due to symmetry issues arising around this value.\n\n\nThe preceding illustrative results highlight that the optimal expected profit can display important variations depending on shippers's price sensitivity and on uncertainty in utilities. It is therefore important to take such considerations into account when making strategic location decisions. The formulation we propose can model different settings ranging from full information (deterministic) to no information (uniform distribution). These settings also impinge on computing times and tractability. The following sections focus on computational aspects, starting with the impact of the CFLP parameters.\n\n\n\n §.§ Impact of CFLP Parameters\n\n\nIn this section, we vary the ratio parameter defined by <cit.> and relating the total capacity of the facilities and the total demand of the customers. Whereas it was fixed to 2 in the previous section, we now let it vary from a highly constraining capacity (ratio equals 0.5, meaning that total capacity is 50% of total demand) to a high excess capacity (ratio equals 5). \nWe note that <cit.> and  <cit.> also used some of the values in this range in their numerical results.\n \nIn our experiments we treat total demand as fixed and only let the capacity vary. For each value of the ratio, we generate 20 instances. \n\nWe report the results in Figures <ref> and <ref>. We see that the average optimal expected profit increases with the ratio. When the ratio increases, less facilities are required which affects the profits given the high impact of fixed costs. However, we should expect a decrease in profits beyond some given ratio value. In this case, a single (the cheapest) facility captures all demand and subsequent increases in the ratio value only make the cost of this single facility increase.\n\n\nIn Figure <ref>, we observe that the model is harder to solve and shows more variable computing times when the total potential capacity is 1.5 times the total demand. Instances with very loose or very constrained capacities are easily solved. We note that instances with with ratio <1 are frequently the easiest to solve by leading to trivial solutions where the LP earns zero expected profits.\n\n\n\nOur problem features similarities with CFLP and we observe for certain parameter settings patterns in computing times that are similar to those reported about CFLP. However, the profit maximization objective and the inner structure of our problem make it quite distinct from CFLP. For instance, capacity / demand ratios less than one are not considered in CFLP since there is typically a demand satisfaction constraint. We also note that certain settings lead to trivial solutions requiring negligible computing times. Consider for example instances where I and J have similar cardinalities. If a tight ratio between total capacity and total demand holds, we always obtain a trivial solution in our problem, while this is not the case for results reported about CFLP. \n\n\n\n\n §.§ Impact of Problem Size\n\n\nThis section examines the computing times yielded by our model by testing it against multiple sets of 20 random instances. Instances essentially differ between these sets with respect to numbers of customers, facilities and price levels. The instance generator given in <cit.> updates the capacity of the facilities in order to maintain the value of the ratio parameter relating total capacity and total demand. We only report results for instances that do not lead to trivial solutions, as those instances require almost negligible computing time. \n\nAs in Section <ref>, all calculations are performed on an identically configured computer. We enforce a time limit of 10 hours, assuming that this is a reasonable time budget for a strategic planning problem. We use the same seed=963490972 to generate each group of 20 instances. Values α=-0.1, β=1 and a value of 1 for the ratio of capacity to demand are used throughout. \n\nTable <ref> reports statistics about the performance of our formulation for each set of  instances. We show the minimum, average and maximum computing times (in seconds) over the 20 instances in columns Min., Avg. and Max., respectively. The number of cases out of 20 reaching an optimal solutions within the allocated time is reported in column # Opt. \n\nAs expected, computing time increases with the size of the problems measured by the number of customers and facilities. It does so linearly. On the contrary, computing time increases exponentially with the number of price levels. This is most likely to be caused by the escalation in the symmetry issues identified in Section <ref> as the number of price levels increases. In view of the intended strategic use of the model and the high-level representation of the pricing problem, the number of price levels is bound to remain limited and we do not expect this situation to cause prohibitive difficulties.\n\nWe cannot solve three out of 20 of the largest instances to optimality within the time limit. For those three instances, the average gap was 11.2%. However, recall that α and β are set to values (-0.1 and one) that yielded the largest computing time in Section <ref>.  \nIf the experiments are repeated with different RUM parameters from Section <ref>, for instance α=-0.136, and β=2, every instance can be solved to optimality within the time limit. In addition, considering only the instances solved to optimality, the average computing time is then 63% of what it was with α=-0.1 and β=1. \n\n\n\n\n\n\n\n§ CONCLUSION AND PERSPECTIVES\n\n\n\nWe addressed a strategic decision-making problem for an LP seeking facility location decisions that lead to profitable operations. In this context, we model at a high level the decisions related to price and service levels, in addition to facility locations. In this strategic setting, the LP has imperfect knowledge of the preferences of the shippers and their customers that impact its profit. \n\nOffering a first attempt to address this problem that, to the best of our knowledge, has not been studied before, we proposed a non-conventional single-level MILP reformulation for a bilevel stochastic formulation. We grounded this reformulation in a simulation-based model and three key results arised from the analysis of the structure of the optimal solutions: First, we found that the problem of the follower can be formulated as a continuous unconstrained optimization model. Second, we defined conditions to discover trivial solutions. Third, we significantly reduced the size of the problem by including a parameter that condenses the information of all scenarios. We can easily compute this parameter outside of the model. This resulted in a model that can be solved by a general purpose solver for instances of sizes that are relevant in practice.\n\nIn addition to optimizing facility location decisions, our methodology allows the LP to anticipate the impact of its decisions about price and quality of service. For instance, solutions can prepare an LP for a transportation procurement process by providing tailored prices and service levels depending on the shippers' profiles. Our results showed that some facility location decisions lead to zero expected profits for the LP, as the resulting costs would exceed revenues. We also observed that the optimal expected profit is highly dependent on the demand model parameters. Finally, achieved computing times were relatively large for some parameter configurations due to symmetry issues. Such issues worsen when the number of price levels increases.\n\n\nWe envisage pursuing research along three directions. The first direction concerns extensions to our model. Instead of setting a service level and a price for each shipper independently, the LP's policy might address the aggregated demand of several shippers. Also, service levels could be more finely defined. Thus, given a set of attributes and the preferences of the customers towards them, a decision would be made on the optimal level of each attribute in a service level offered to a shipper. The second direction pertains to the estimation of the demand model. In view of the high dependency of the solutions on the latter (in our case a RUM model), parameter estimation might gainfully account for partial availability of data, as important attributes may be latent. This would also make it possible to test the methodology on real data. Finally, additional work should be dedicated to improving the algorithmic performance. Some parameter configurations can lead to symmetry issues and a column generation approach would seem appropriate in these circumstances. We should also pursue research on enhancements to the model that include symmetry breaking inequalities.\n\n\n\n§ AUTHOR CONTRIBUTION\n\n: Conceptualization, Methodology, Software, Validation, Investigation, Formal analysis, Writing – Original Draft. : Conceptualization, Supervision, Funding acquisition. : Supervision, Conceptualization, Resources, Validation, Writing – Review & Editing, Funding acquisition. \n\n\n\n§ ACKNOWLEDGEMENTS\n\nWe gratefully acknowledge that the first author receives financial support from the Ecuadorian Secretaría de Educación Superior , Ciencia, Tecnología e Innovacion (SENESCYT) under its international scholarships program and from University Escuela Superior Politécnica del Litoral, Ecuador. The research is funded by Data Intelligence for Logistics Research Chair at Université de Montréal thanks to support from Purolator and Natural Sciences and Engineering Research Council of Canada (grant CRDPJ 538506 – 19). We express our deep gratitude to Eric Larsen who helped us improve the exposition of the paper. The first author received a scholarship from EURO-IFORS to attend the EURO Summer Institute in Location Science, held in Edinburgh in June 11-22, 2022, where this work was presented. Finally, this research would not have happened without the support, passion and ideas of the second author, Bernard Gendron, who left this world far too early. He will be with us forever in our hearts.\n\n\n\n§ DISCLOSURE STATEMENT\n\nThe authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.\n\n\n\n\n\n\n\n\n\n\n    \n\n§ NOTATION\n\n    \n        \n        \n        \n        \n    \n\n§ PARAMETERS IN EXPERIMENTAL RESULTS\n\n    Here we describe the procedure we use to compute some of the parameter values we use in the computational experiments. As seen in Section <ref> values must be assigned to parameters α and β. For the case of parameter α, we seek for a value that leads to a very low probability ρ_nk^mp for the first service level (m=1) and lowest price level (p=0,q^0=15). We set ρ_nk^10=0.005 to compute the initial value of α. Therefore, we obtain the first value α=-0.45289 by solving:\n    \n    1/1+e^(U^0-U^10)=1/1+e^(3- 15α -4.5) = 0.005\n\n    The other 10 values taken by α are equally spaced between the first one and 0. The 11 resulting values for α are reported in Table  <ref>.\n    \n    \n    \n    To determine values for parameter β, we use the exponential expression 2^l over the set l={-5,-4,-3,-2,-1,0,1,2,3}. Low values of l correspond to low values for the scale parameter β.\n    Table  <ref> reports values for β that are used in Section  <ref>.\n    \n\n\n"}