{"entry_id": "http://arxiv.org/abs/2303.06742v1", "published": "20230312200332", "title": "An energy-efficient GMRES-Multigrid solver for space-time finite element computation of dynamic poro- and thermoelasticity", "authors": ["Mathias Anselmann", "Markus Bause", "Nils Margenberg", "Pavel Shamko"], "primary_category": "math.NA", "categories": ["math.NA", "cs.NA"], "text": "\n\t\n\n\n\n\n\nAn energy-efficient GMRES–Multigrid solver for space-time finite element computation of dynamic poro- and thermoelasticity\n    \n\tMathias Anselmann^∗anselmann@hsu-hh.de (corresponding author) , Markus Bause^∗,  Nils Margenberg^∗, Pavel Shamko^∗\n\n\t^∗ Helmut Schmidt University, Faculty of Mechanical and Civil Engineering, Holstenhofweg 85,\n \n\t22043 Hamburg, Germany\n\n    \n==================================================================================================================================================================================================================================================\n\n\nAbstract\n\nWe present families of space-time finite element methods (STFEMs) for a coupled hyperbolic-parabolic system of poro- or thermoelasticity. Well-posedness of the discrete problems is proved. Higher order approximations inheriting most of the rich structure of solutions to the continuous problem on computationally feasible grids are naturally embedded. However, the block structure and solution of the algebraic systems become increasingly complex for these members of the families. We present and analyze a robust geometric multigrid (GMG) preconditioner for GMRES iterations. The GMG method uses a local Vanka-type smoother. Its action is defined in an exact mathematical way. Due to nonlocal coupling mechanisms of unknowns, the smoother is applied on patches of elements. This ensures the damping of error frequencies. In a sequence of numerical experiments, including a challenging three-dimensional benchmark of practical interest, the efficiency of the solver for STFEMs is illustrated and confirmed. Its parallel scalability is analyzed. Beyond this study of classical performance engineering, the solver's energy efficiency is investigated as an additional and emerging dimension in the design and tuning of algorithms and their implementation on the hardware.\n\n\nKeywords. \nPoro-/thermoelasticity, dynamic Biot model, space-time finite element approximation, geometric multigrid method, GMRES iterations, computational efficiency, energy consumption. \t\n\n\n\n§ INTRODUCTION\n\n\n\n\n\n §.§ Mathematical model\n\n\nWe present and investigate numerically a geometric multigrid preconditioning technique, based on a local Vanka-type smoother, for solving by GMRES iterations the linear systems that arise from space-time finite element discretizations of the coupled hyperbolic-parabolic system of dynamic poroelasticity\n\n\n\n\nρ∂_t^2 u⃗ - ∇·(C⃗ ε⃗(u⃗)) + α∇⃗p     = ρf⃗ ,          in   \nΩ×(0,T] ,\n\n\nc_0∂_t p + α∇·∂_t u⃗  -  ∇·(K⃗ ∇p)      = g ,          in    Ω×(0,T] ,\n\n\nu⃗ (0) = u⃗_0 ,   ∂_t u⃗ (0) = u⃗_1 ,   p(0)     = p_0 ,          in    Ω×{0}  ,\n\n\nu⃗     = u⃗_D ,          on    Γ_u⃗^D ×(0,T] ,\n\n\n-(C⃗ε⃗(u⃗) - αpE⃗) n⃗      = t⃗_N ,           on    Γ_u⃗^N ×(0,T] ,\n\n\np     = p_D ,          on    Γ_p^D ×(0,T] ,\n\n\n- K⃗ ∇p ·n⃗      = p_N ,          on    Γ_p^N ×(0,T] .\n\n\nIn (<ref>), Ω⊂^d, with d∈{2,3}, is an open bounded Lipschitz domain with outer unit normal vector n⃗ to the boundary ∂Ω and T>0 is the final time point. We let ∂Ω = Γ_u⃗^D∪Γ_u⃗^N and ∂Ω = Γ_p^D∪Γ_p^N with closed portions Γ_u⃗^D and Γ_p^D of non-zero measure. Important applications of the model (<ref>), that is studied as a prototype system, arise in poroelasticity; cf. <cit.> and <cit.>. In poroelasticity, Eqs. (<ref>) are referred to as the dynamic Biot model. The system (<ref>) is used to describe flow of a slightly compressible viscous fluid through a deformable porous matrix. The small deformations of the matrix are described by the Navier equations of linear elasticity, and the diffusive fluid flow is described by Duhamel’s equation. The unknowns are the effective solid phase displacement u⃗ and the effective fluid pressure p. The quantity ε⃗(u⃗):= (∇u⃗ + (∇u⃗)^⊤)/2 denotes the symmetrized gradient or strain tensor and E⃗∈^d,d is the identity matrix. Further, ρ is the effective mass density, C⃗ is Gassmann’s fourth order effective elasticity tensor, α is Biot’s pressure-storage coupling tensor, c_0 is the specific storage coefficient and K⃗ is the permeability field. For brevity, the positive quantities ρ>0, α>0 and c_0 >0 as well as the tensors C⃗ and K⃗ are assumed to be constant in space and time. The tensors C⃗ and K⃗ are assumed to be symmetric and positive definite,\n\n\n\n\n∃k_0>0   ∀ξ⃗= ξ⃗^⊤∈^d,d:       ∑_i,j,k,l=1^d ξ_ij C_ijkl ξ_kl ≥k_0 ∑_j,k=1^d |ξ_jk|^2 ,\n\n\n ∃k_1>0   ∀ξ⃗∈^d:        ∑_i,j,=1^d ξ_i K_ij ξ_j ≥k_1 ∑_i=1^d |ξ_i|^2 .\n\n\n In order to enhance physical realism in poroelasticity, generalizations of the model (<ref>) have been developed and investigated in, e.g., <cit.>. We note that the system (<ref>) is also formally equivalent to the classical coupled thermoelasticity system which describes the flow of heat through an elastic structure; cf. <cit.> and <cit.>). In that context, p denotes the temperature, c_0 is the specific heat of the medium, and K⃗ is the conductivity. Then, the quantity α∇ p arises from the thermal stress in the structure, and the term α∇·∂_t u⃗ models the internal heating due to the dilation rate. Well-posedness of (<ref>) is ensured; cf., e.g., <cit.>. This can be shown by different mathematical techniques, by semigroup methods <cit.>, Rothe's method <cit.> and Picard's theorem <cit.>. In these works, boundary conditions different to the ones in (<ref>) to   (<ref>) are partly used. \n\n\n\n §.§ Space-time finite element and multigrid techniques\n\n\nThe coupled hyperbolic-parabolic structure of the system (<ref>) of partial differential equations adds an additional facet of complexity onto its numerical simulation. A natural and promising approach for the numerical approximation of coupled systems is given by the application of space-time finite element methods that are based on an uniform treatment of the space and time variables by variational formulations. Therein, the discrete unknown functions are defined on the entire space-time domain Ω× [0,T] and are represented in terms of basis functions. This facilitates the discretization of even complex coupling terms that may involve combinations of temporal and spatial derivatives as in (<ref>). Moreover, space-time finite element methods enable the natural construction of higher order members in the families of schemes. Higher order discretizations offer the potential to achieve accurate results on computationally feasible grids with a minimum of numerical costs. In particular for second-order hyperbolic problems, higher order time discretization schemes have shown their superiority, measured in terms of accuracy over temporal mesh resolution and compute time; cf., e.g., <cit.>. Finally, space-time adaptivity based on a-posteriori error control by duality concepts and multi-rate in time approaches become feasible. For this we refer to <cit.> for the presentation of the abstract framework of duality based error control and, e.g., to <cit.> for its application to physical problems. For the variational time discretization of second-order hyperbolic and parabolic equations, various families have been proposed and investigated recently; cf., e.g., <cit.>. They differ by the approximation order and regularity in time of the discrete solution as well as stability and energy conservation properties. In this work, we use a discontinuous Galerkin time discretization of arbitrary polynomial order and focus on the efficient solution of the resulting complex algebraic block systems. Higher order (variational) time discretizations for three-dimensional applications put a facet of complexity on the algebraic solver and have rarely been studied yet in the literature. For the discretization of the space variables, numerous finite element approaches have been proposed and studied, in particular, for the quasi-static Biot system of flow in deformable porous media. The latter model results from (<ref>) by neglecting the acceleration term ρ∂_t^2 u⃗ in (<ref>). For the quasi-static Biot model, three-field formulations with the fluid flux q⃗ = - K⃗∇ p as an additional explicit variable and the application of mixed finite element methods for the spatial discretization of p and q⃗ attracted strong interest of researchers; cf., e.g., <cit.> and the references therein. In this work, we use an approximation of the variables u⃗ and p by higher order inf-sup stable pairs of finite element spaces with continuous or discontinuous discrete variable p. Precisely, either the well-known Taylor–Hood family of finite element pairs for u⃗ and p or a continuous approximation of u⃗ combined with a discontinuous approximation of p is used; cf. (<ref>). In the literature, the latter option has shown its superiority for the approximation of incompressible viscous flow problems <cit.>. Structure-preserving approximations with the fluid flux and stress tensor as additional variables, that are based on a reformulation of the coupled problem (<ref>) as a first-order in space and time system (cf. <cit.>), remain as a work for the future. \n\n\n\nIn our space-time finite element  approach, we choose a discontinuous temporal test basis such a time-marching process is obtained. On each subinterval I_n=(t_n-1,t_n] of the time mesh ℳ_τ := {I_1,…, I_N}, we use a Lagrangian basis with respect to the (k+1) Gauss–Radau quadrature points of I_n for the time interpolation. Two discrete systems differing by the treatment of the term ∇·∂_t u⃗ in (<ref>) are then proposed. Dirichlet boundary conditions are implemented in a weak form by means of Nitsche's method and/or a discontinuous (spatial) approximation of the scalar variable p. Well-posedness of the discrete problems is carefully proved for arbitrary polynomial degrees of the discretization. The degrees of freedom on I_n are associated with the (k+1) Gauss–Radau quadrature nodes of this subinterval; cf. Fig. <ref>. On each subinterval I_n, the resulting algebraic problem is a linear system of equations with a block matrix of (k+1)× (k+1) subsystems where each of the subsystems exhibits a complex structure itself. Here, k denotes the piecewise polynomial order of the time discretization; cf. <cit.>. The solution of these algebraic problems with complex block structure demands for efficient and robust iteration schemes. Geometric multigrid (GMG) methods are known as the most efficient iterative techniques for the solution of large linear systems arising from the discretization of partial differential equations, particularly of elliptic type; cf. <cit.> for a general overview.  In contrast to other iterative solvers (like for instance BiCGStab or GMRES), multigrid solvers converge with a rate which is independent of the (spatial) mesh size and require computational costs that are only linearly dependent on the number of unknowns. Massively parallel implementations of GMG methods on modern architectures show excellent scalability properties and their high efficiency has been recognized, e.g., in <cit.>. Today they are widely used and are employed in many variants; cf. <cit.> for flow and saddle point problems. Nowadays, GMG methods are employed as preconditioner in Krylov subspace iterations, for instance GMRES iterations, to enhance their robustness, which is also done here.  Analyses of GMG methods (cf., e.g., <cit.>) have been done for linear systems in saddle point form, with matrix 𝒜⃗= [   A⃗ B⃗^⊤;   B⃗ - C⃗ ] and symmetric and positive definite submatrices A⃗ and C⃗, arising for instance from mixed discretizations of the Stokes problem. If higher order discontinuous Galerkin time stepping is used, the resulting linear system matrix is a (k+1)× (k+1) block matrix with each of its blocks being of the form 𝒜⃗. This imposes an additional facet of complexity on the geometric multigrid preconditioner. To the best of our knowledge,  analyses of GMG methods arising form higher order (variational) time discretizations of the coupled system (<ref>) or related ones are still missing in the literature. \n\nGMG methods exploit different mesh levels of the underlying problem in order to reduce different frequencies of the error by employing a relatively cheap smoother on each grid level. Different iterative methods have been proposed in the literature as smoothing procedure; cf. <cit.> and the references therein.  They range from low-cost methods like Richardson, Jacobi, and SOR applied to the normal equation of the linear system to  collective smoothers, that are based on the solution of small local problems. Here, we use a Vanka-type smoother <cit.> of the family of collective methods. Numerical computations show that an elementwise application of the Vanka smoother fails to reduce  the high frequencies of the error on the multigrid levels. The reason for this comes through spatial interelement couplings of degrees of freedom of the scalar variable p in (<ref>). This holds for the discontinuous and continuous spatial approximation of p. For the spatially continuous approximation of p, the coupling of degrees of freedom is obvious. For the spatially discontinuous approximation of p, the interelement coupling of degrees of freedom of p is due to the presence of the diffusion term in (<ref>) and the surface integrals involving averages and jumps of the discrete solution over interelement faces resulting from its discretization. This is in contrast to the Navier–Stokes equations for which elementwise Vanka-type smoother are known to perform excellently if discontinuous pressure approximations are applied; cf. <cit.>. The difference comes through the fact that in case of the Navier–Stokes system no interelement coupling of pressure degrees of freedom arises. As a remedy, we propose the application of the Vanka-type smoother on cell patches that are linked to the grid nodes and  built from four neighbored cells in two dimensions and eight neighbored elements in three dimensions, with appropriate adaptations for grid nodes close to or on the domain's boundary. Further we employ some relaxation strategy in the smoothing steps. Then an efficient damping of frequencies in the error on the multigrid hierarchy is obtained. Here, this Vanka-type smoother is presented in an mathematically exact way and its performance properties are investigated by numerical experiments. Our numerical experiments confirm that GMRES iterations that are preconditioned by the proposed multigrid method converge at a rate which is (nearly) independent of the mesh sizes in space and the time step size; cf. also <cit.>. In the smoothing steps, the application of the Vanka-type operator requires the solution of patchwise linear systems of equations. For (<ref>) and three space dimensions the size of the local systems no longer continues to remain negligible, in particular if a higher polynomial order in space and/or time is applied. Their solution deserves attention. In our approach we compute of inverse of the patchwise system matrix by LAPACK routines to solve to local system of equations. Details of an data-structure efficient MPI-based parallel implementation of the GMG algorithm in our in-house high-performance frontend solver for the deal.II finite element library <cit.> can be found in <cit.> where this is presented for the Navier–Stokes system. Multi-field formulations of the system (<ref>), that are not studied in this work, further increase the complexity of the arising linear systems; cf. <cit.>. However, the methodology of the linear solver, that is developed here, offers the potential of its generalization to more advanced problem formulations and their discretizations.  \n\n \n\n\n §.§ Energy efficiency\n\n\nIn the past, performance engineering and hardware engineering for large scale simulations of physical phenomena have been eclipsed by the longing for ever more performance where faster seemed to be the only paradigm. ”Classical” performance engineering has been applied to enhance, firstly, the efficiency of the current method on the target hardware or to find numerical alternatives that might better fit to the hardware in use and/or, secondly, to develop other numerical methods can be found to improve the numerical efficiency. Tuning both simultaneously is called hardware-oriented numerics in the literature; cf. <cit.>. Since recently, a growing awareness of energy consumption in computational science, particularly, in extreme scale computing with a view to exascale computing has raised; cf., e.g., <cit.>. It has been observed that as a consequence of decades of performance-centric hardware development there is a huge gap between pure performance and energy efficiency. An analysis of our algorithm's parallel scaling and energy consumption properties by performance models exceeds the scope of this work and would overburden it. However, since energy consumption of application codes on the available hardware is of growing awareness and a key for future improvements, we study the energy consumption and parallel scaling properties of our algorithm and its implementation by three-dimensional numerical experiments. The development of a proper model that quantifies performance and energy efficiency in some appropriate metric and can be used for a code optimization still deserves research and is left as a work for the future. \n\n\n\n\n §.§ Outline of the work\n\n\nThis work is organized as follows. In Sec. <ref> we introduce our notation. In Sec. <ref> the space-time finite element approximation of arbitrary order of (<ref>) is derived and well-posedness of the fully discrete problem is proved. Our GMRES–GMG solver is introduced in Sec. <ref>. In Sec. <ref> our performed numerical computations for analyzing the performance properties of the overall approach are presented. In Sec. <ref> we end with a summary and conclusions. In the appendix, supplementary results are summarized.     \n\n\n\n§ BASIC NOTATION\n\n\n\nIn this work, standard notation is used. We denote by H^1(Ω) the Sobolev space of L^2(Ω) functions with first-order weak derivatives in L^2(Ω). Further, H^-1(Ω) is the dual space of H^1_0(Ω), with the standard modification if the Dirichlet condition is prescribed on a part Γ^D⊂Γ of the boundary ∂Ω only; cf. (<ref>). The latter is not explicitly borne out by the notation of H^-1(Ω). It is always clear from the context. For vector-valued functions we write those spaces bold. By ⟨·, ·⟩_S we denote the L^2(S) inner product for a domain S. For S=Ω, we simply write ⟨·, ·⟩. For the norms of the Sobolev spaces the notation is \n\n    · := ·_L^2 ,    ·_1 := ·_H^1 .\n \nFor short, we put \n\n    Q:=L^2(Ω)    and    V⃗:= (H^1(Ω))^d .\n\nFor a Banach space B, we let L^2(0,T;B) be the Bochner space of B-valued functions, equipped with its natural norm. For a subinterval J⊆ [0,T], we will use the notation L^2(J;B) for the corresponding Bochner space. In what follows, the constant c is generic and indepedent of the size of the space and time meshes.\n\nFor the time discretization, we decompose the time interval I:=(0,T] into N subintervals I_n=(t_n-1,t_n], n=1,…,N, where 0=t_0<t_1< ⋯ < t_N-1 < t_N = T such that I=⋃_n=1^N I_n. We put τ := max_n=1,…, Nτ_n with τ_n = t_n-t_n-1. Further, the set ℳ_τ := {I_1,…,\nI_N} of time intervals is called the time mesh. For a Banach space B and any k∈_0, we let \n\n    ℙ_k(I_n;B) := {w_τ :    I_n → B  ,   w_τ(t) = ∑_j=0^k \n    \tW^j t^j  ∀ t∈ I_n ,   W^j ∈ B ∀ j } .\n\nFor k∈_0 we define the space of piecewise polynomial functions in time with values in B by \n\n    Y_τ^k (B) := {w_τ: I→ B  | w_τ_|I_n∈ℙ_k(I_n;B) ∀ I_n∈ℳ_τ,  w_τ(0)∈ B }⊂ L^2(I;B) .\n\nFor any function w: I→ B that is piecewise sufficiently smooth with respect to the time mesh ℳ_τ, for instance for w∈ Y^k_τ (B), we define the right-hand sided and left-hand sided limit at a mesh point t_n by\n\n    w^+(t_n) := lim_t→ t_n+0 w(t) ,  for  n<N ,\n    \t    and    \n    \tw^-(t_n) := lim_t→ t_n-0 w(t) ,  for  n>0 .\n\nFor the integration in time of a discontinuous Galerkin approach it is natural to use the right-sided (k+1)-point Gauss–Radau quadrature formula. On the subinterval I_n, it reads as \n\n    Q_n(w) := τ_n/2∑_μ=1^k+1ω̂_μ^GR w(t_n,μ^GR ) ≈∫_I_n w(t)  t  ,\n\nwhere t_n,μ^GR=T_n(t̂_μ^GR), for μ = 1,…,k+1, are the Gauss–Radau quadrature  points on I_n and ω̂_μ^GR the corresponding weights. Here, T_n(t̂):=(t_n-1+t_n)/2 + (τ_n/2)t̂ is the affine transformation from Î = [-1,1] to I_n and t̂_μ^GR are the Gauss–Radau quadrature points on Î. Formula (<ref>) is exact for all polynomials w∈ℙ_2k (I_n;).  In particular, there holds that t_n,k+1^GR=t_n.  \n\nFor the space discretization, let {𝒯_l}_l=0^L be the decomposition on every multigrid level of Ω into (open) quadrilaterals or hexahedrals, with 𝒯_l = {K_i| i=1,… , N^el_l}, for l=0,…,L. These element types are chosen for our implementation (cf. Sec. <ref>) that is based on the deal.II library <cit.>.  The finest partition is 𝒯_h=𝒯_L. We assume that all the partitions {𝒯_l}_l=0^L  are quasi-uniform with characteristic mesh size h_l and h_l=γ h_l-1, γ∈ (0,1) and h_0 = 𝒪(1).  On the actual mesh level, the finite element spaces used for approximating the unknowns u⃗ and p of (<ref>) are of the form (l∈{0,…,L})\n\n\t\n\t\n\t\t\n\t\tV⃗_h_l^l     := {v⃗_h ∈V⃗ ∩C(Ω)^d  :   v⃗_h_|K∈V⃗(K)    for all  K ∈𝒯_l} , \n\n\t\t\n\t\tQ_h_l^l,cont     := {q⃗_h ∈Q∩C(Ω)   :   q⃗_h_|K∈Q(K)    for all  K ∈𝒯_l} , \n\n\t\t\n\t\tQ_h_l^l,disc     := {q⃗_h ∈Q  :   q⃗_h_|K∈Q(K)    for all  K ∈𝒯_l} .\n\t\n\nBy an abuse of notation, we skip the index l of the mesh level when it is clear from the context and put\n\n    V⃗_h := V⃗_h^l   and   Q_h := Q_h^l   with   Q_h^l∈{Q_h^l,cont, Q_h^l,disc} .\n\n For the local spaces V⃗(K) and Q(K) we employ mapped versions of the pairs ℚ_r^d/ℚ_r-1 and ℚ_r^d/ℙ_r-1^, for r≥ 2. The pair ℚ_r^d/ℚ_r-1 with a (globally) continuous approximation of the scalar variable p in Q_h^l,cont is the well-known Taylor–Hood family of finite element spaces. The pair ℚ_r^d/ℙ_r-1^ comprises a discontinuous approximation of p in the broken polynomial space Q_h^l,disc. For the Navier–Stokes equations, the multigrid method has shown to work best for higher-order finite element spaces with discontinuous discrete pressure; cf. <cit.> and <cit.>. For a further discussion of mapped and unmapped versions of the pair  ℚ_r^d/ℙ_r-1^ we refer to <cit.>. For an analysis of stability properties of (spatial) discretizations for the quasi-static Biot system we refer to, e.g., <cit.>. In particular, both choices of the local finite element spaces, ℚ_r^d/ℚ_r-1 and ℚ_r^d/ℙ_r-1^, satisfy the inf–sup stability condition,\n\t\n    inf_q_h ∈ Q_h\\{0}sup_v⃗_h∈V⃗_h\\{0⃗}b(v⃗_h,q_h)v⃗_h _1   q_h≥β > 0 ,\n\nfor some constant β independent of h; cf. <cit.>. In <cit.> optimal interpolation error estimates for mapped finite elements on quadrilaterals and hexahedra are studied. It turned out that the optimality is given for special families of triangulations. In two and three dimensions, families of meshes, which are obtained by a regular uniform refinement of an initial coarse grid, are among these special families. Such a regular refinement that is natural for the construction of the multigrid hierarchy is used in our computations.  Thus, for v⃗∈H⃗^r+1(Ω) and q∈  H^r(Ω) there exist approximations i_h v⃗∈V⃗_h and j_h q ∈ Q_h such that, with some generic constant c>0 independent of h, \n\t\n    v⃗ - i_h v⃗ + h ∇ (v⃗-i_h v⃗)≤ c h^r+1    and     q - j_h q≤ c  h^r .\n\n\n\n\n\n\n\n\n\n\n§ SPACE-TIME FINITE ELEMENT APPROXIMATION\n\n\n\nFor the discretization we rewrite (<ref>) as a first-order in time system by introducing the new variable v⃗:= ∂_t u⃗. Then, we recover (<ref>) and (<ref>) as\n\n\n\n\n∂_t u⃗ - v⃗     = 0⃗\n\t\n\nρ∂_t v⃗ - ∇·(C⃗ ε⃗(u⃗)) + α∇⃗p     = ρf⃗ , \n\n\nc_0∂_t p + α∇·v⃗  - ∇·(K⃗ ∇⃗p)      = g\n\n\n\nalong with the initial and boundary conditions <ref> to <ref>. We employ discontinuous Galerkin methods (cf. <cit.>) for the discretization of the time variable and inf-sup stable pairs of finite elements (cf. Sec. <ref>) for the approximation of the space variables in <ref>. The derivation of the discrete scheme, presented below in Problem <ref>, is standard and not explicitly presented here. It follows the lines of <cit.>, where continuous in time Galerkin methods are applied to (<ref>), and <cit.>, where discontinuous in time Galerkin methods are used to discretize the Navier–Stokes system. In contrast to <cit.>, Dirichlet boundary conditions are implemented here by Nitsche’s method <cit.>. This yields a strong link between two different families of inf-stable finite element pairs for the space discretization. The main reason for using Nitsche’s method here comes through our more general software framework. It captures problems on evolving domains solved on fixed computational background grids (cf. <cit.>), where Nitsche’s method is applied. We note that Nitsche’s method does not perturb the convergence behavior of the space-time discretization; cf. Sec. <ref>.\n\nFor the discrete scheme we need further notation. On the multigrid level l with decomposition 𝒯_l, for w⃗_h, χ⃗_h∈V⃗_h and q_h, ψ_h ∈ Q_h we define\n\n\t\n\t\n\t\n\t\tA_γ(w⃗_h,χ⃗_h)\t    := ⟨C⃗ ε⃗(w⃗_h),ε⃗(χ⃗_h)⟩- ⟨C⃗ε⃗(w⃗_h) n⃗, χ⃗_h⟩_Γ^D_u⃗+ a_γ(w⃗_h,χ⃗_h) ,\n\n\t\n\t\tC (χ⃗_h,q_h)       := -α⟨∇·χ⃗_h, q_h⟩+  α⟨χ⃗_h ·n⃗ , q_h ⟩_Γ^D_u⃗  , \n\n\t\tB_γ(q_h,ψ_h)     := {[                                                               ⟨K⃗ ∇q_h, ∇ψ_h ⟩- ⟨K⃗ ∇q_h ·n⃗, ψ_h ⟩_Γ_p^D + b_γ(q_h,ψ_h) ,                                                                                                   for   Q_h = Q_h^l,cont ,; [ ∑_K∈𝒯_l⟨K⃗ ∇q_h, ∇ψ_h ⟩_K - ∑_F∈ℱ_h (⟨K⃗ ∇q_h ·n⃗, ψ_h ⟩_F;   + ⟨q_h, K⃗ ∇ψ_h ·n⃗ ⟩_F) + ∑_F∈ℱ_h γ/h_F ⟨q_h , ψ_h⟩_F , ]                                                                                                   for   Q_h = Q_h^l,disc ,;                                                                                                                            ].\n\t\n\nwhere, for w⃗∈H⃗^1/2(Γ^D_u⃗) and q∈ H^1/2(Γ^D_p), \n\n\t\t\n\t\n\t\t\n\t\ta_γ(w⃗ ,χ⃗_h)     := - ⟨w⃗, C⃗ε⃗(χ⃗_h) n⃗ ⟩_Γ^D_u⃗  + γ_a/h_F  ⟨w⃗, χ⃗_h ⟩_Γ^D_u⃗ , \n\n\t\t\n\t\tb_γ(q, ψ_h)     := - ⟨q, K⃗ ∇ψ_h ·n⃗⟩_Γ_p^D +  γ_b/h_F  ⟨q, ψ_h ⟩_Γ^D_p  .\n\t\n\nThe second of the options in (<ref>) amounts to a symmetric interior penalty discontinuous Galerkin discretization of the scalar variable p; cf., e.g.,  <cit.>. As usual, the average ·  and jump · of a function w∈ L^2(Ω) on an interior face F between two elements K^+ and K^-, such that F=∂ K^+ ∩∂ K^-, are \n\n    w  :=  1/2 (w^++ w^-)  and   w  : =  w^+ -  w^- .\n\nFor boundary faces F ⊂∂ K ∩∂Ω, we set w:= w_|K and w  := w_|K. The set of all faces (interior and boundary faces) on the multigrid level 𝒯_l is denoted by ℱ_h. In the second of the options in (<ref>), the parameter γ of the last term has to be chosen sufficiently large, such that discrete coercivity on Q_h of B_γ is preserved. The local length h_F is chosen as h_F =  h_F  := 1/2 (|K^+|_d + |K^-|_d) with Hausdorff measure |· |_d; cf. <cit.>. For boundary faces we set h_F := |K|_d.\nIn (<ref>), the quantities γ_a and γ_b are the algorithmic parameters of the stabilization terms in the Nitsche formulation.\nTo ensure well-posedness of the discrete systems the parameters γ_a and γ_b  have to be chosen  sufficiently large; cf. Appendix <ref>. Based on our numerical experiments we choose the algorithmic parameter γ, γ_a and γ_b in (<ref>) and (<ref>) as \n\n    γ_a = 5· 10^4  · r · (r+1)   and  γ = γ_b =  1/2· r · (r-1) ,\n\nwhere r is the polynomial degree of the finite element space (<ref>) for the displacement variable.\n\n\nFinally, for given f⃗∈H⃗^-1(Ω), u⃗_D ∈H⃗^1/2(Γ^D_u⃗), t⃗_N ∈H⃗^-1/2(Γ^N_u⃗) and g∈ H^-1(Ω), p_D ∈ H^1/2(Γ^D_p), p_N∈ H^-1/2(Γ^N_p) for Q_h = Q_h^l,cont, and properly fitted assumptions about the data for Q_h = Q_h^l,disc, we put \n\n\t\t\n\t\n\t\t\n\t\tF_γ(χ⃗_h)     := ⟨f⃗ , χ⃗_h⟩- ⟨t⃗_N,χ⃗_h ⟩_Γ^N_u⃗ + a_γ(u⃗_D ,χ⃗_h) ,\n\n\t\t\n\t\tG_γ(ψ_h)     := {[                                                                                            ⟨⟨g,ψ_h ⟩-  α⟨v⃗_D ·n⃗ , ψ_h ⟩_Γ^D_u⃗  - ⟨p_N, ψ_h⟩_Γ^N_p + b_γ(p_D, ψ_h) ,                                                                                                                                               for   Q_h = Q_h^l,cont ,; [ ⟨g,ψ_h ⟩-  ∑_F∈ℱ_h^D,u⃗ α⟨v⃗_D ·n⃗ , ψ_h ⟩_F -  ∑_F∈ℱ_h^D,p⟨p_D, K⃗ ∇ψ_h ·n⃗ ⟩_F;                     + ∑_F∈ℱ_h^D,p γ/h ⟨p_D, ψ_h⟩_F - ∑_F⊂ℱ_h^N,p ⟨p_N, ψ_h ⟩_F , ]                                                                                                                                               for   Q_h = Q_h^l,disc . ].\n\t\n\nIn the second of the options in (<ref>), we denote by ℱ_h^D,p⊂ℱ_h and ℱ_h^N,p⊂ℱ_h the set of all element faces on the boundary parts Γ_p^D and  Γ_p^N, respectively; cf. (<ref>). The second of the terms on the right-hand side of (<ref>), with v⃗_D = ∂_t u⃗_D, is added to ensure consistency of the form (<ref>) in the fully discrete formulation (<ref>) of (<ref>), i.e., that the discrete equation (<ref>) is satisfied by the continuous solution to (<ref>). \n\n\nWe use a temporal test basis that is supported on the subintervals I_n; cf., e.g., <cit.>. Then, a time marching process is obtained. In that, we assume that the trajectories u⃗_τ,h, v⃗_τ,h and p_τ,h have been computed before for all t∈ [0,t_n-1], starting with approximations  u⃗_τ,h(t_0) :=u⃗_0,h, v⃗_τ,h(t_0) :=u⃗_1,h and p_τ,h(t_0) := p_0,h of the initial values u⃗_0, v⃗_0 and p_0,h. Then, we consider solving the following local problem on I_n.\n\n[Numerically integrated I_n-problem]\n\t\n\tFor given u⃗_h^n-1:= u⃗_τ,h(t_n-1)∈V⃗_h, v⃗_h^n-1:= [4]v⃗_τ,h(t_n-1)∈V⃗_h,  and p_h^n-1:= p_τ,h(t_n-1) ∈ Q_h with  u⃗_τ,h(t_0) :=u⃗_0,h, v⃗_τ,h(t_0) :=u⃗_1,h and p_τ,h(t_0) := p_0,h, find (u⃗_τ,h,v⃗_τ,h,p_τ,h) ∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h) such that\n\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t   \n\t\t\t    Q_n (⟨∂_t u⃗_τ,h , ϕ⃗_τ,h ⟩- ⟨v⃗_τ,h , ϕ⃗_τ,h ⟩) + ⟨u⃗^+_τ,h(t_n-1), ϕ⃗_τ,h^+(t_n-1)⟩=  ⟨u⃗_h^n-1, ϕ⃗_τ,h^+(t_n-1)⟩ , \n\n\t\t\t\n\n\t\t\t\n\t\t\t   \n\t\t\t    Q_n (⟨ρ∂_t v⃗_τ,h , χ⃗_τ,h ⟩+ A_γ(u⃗_τ,h, χ⃗_τ,h ) + C(χ⃗_τ,h,p_τ,h)) + ⟨ρv⃗^+_τ,h(t_n-1),  χ⃗_τ,h^+(t_n-1)⟩\n  \n\t\t\t      = Q_n (F_γ(χ⃗_τ,h)) + ⟨ρv⃗_h^n-1,  χ_τ,h^+(t_n-1)⟩ ,\n\n\t\t\t\n\n\t\t\t\n\t\t\t   \n\t\t\t    Q_n (⟨c_0 ∂_t p_τ,h,ψ_τ,h ⟩- C(v⃗_τ,h,ψ_τ,h)+ B_γ(p_τ,h, ψ_τ,h)) + ⟨c_0 p^+_τ,h(t_n-1), ψ_τ,h^+(t_n-1)⟩\n \n\t\t\t       = Q_n ( G_γ(ψ_τ,h)) + ⟨c_0 p_h^n-1, ψ_τ,h^+(t_n-1)⟩\n\t\t\n\t\n\tfor all (ϕ⃗_τ,h,χ⃗_τ,h,ψ_τ,h)∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h).\n\n\nThe trajectories defined by Problem <ref>, for n = 1,…,N, satisfy that u⃗_τ,h,v⃗_τ,h∈ Y_τ^k(V⃗_h) and p_τ,h∈ Y_τ^k(Q_h). The quadrature formulas on the left hand-side of (<ref>) can be rewritten by time integrals since the Gauss–Radau formula (<ref>) is exact for all polynomials w∈ P_2k(I_n;). Well-posedness of Problem <ref> is ensured.\n\n\n\nProblem <ref> admits a unique solution.\n\n\n\nWe prove Lem. <ref> for Q_h=Q_h^l,cont only, thus assuming the first of the options in (<ref>) and (<ref>). For Q_h=Q_h^l,disc, the proof can be done similarly by using, in addition, standard techniques of error analysis for discontinuous Galerkin methods; cf., e.g., <cit.>. Since Problem  <ref>  is finite-dimensional, it suffices to prove uniqueness of the solution. Existence of the solution then follows directly from its uniqueness. Let now (u⃗^(1)_τ,h,v⃗^(1)_τ,h,p^(1)_τ,h) ∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h) and (u⃗^(2)_τ,h,v⃗^(2)_τ,h,p^(2)_τ,h) ∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h)  denote two triples of solutions to (<ref>). Their differences (u⃗_τ,h,v⃗_τ,h,p_τ,h) =(u⃗^(1)_τ,h,v⃗^(1)_τ,h,p^(1)_τ,h) -(u⃗^(2)_τ,h,v⃗^(2)_τ,h,p^(2)_τ,h) then satisfy the equations\n\t\n\t\n\t\n\t\t\n\t\t\t    Q_n (⟨∂_t u⃗_τ,h , ϕ⃗_τ,h ⟩- ⟨v⃗_τ,h , ϕ⃗_τ,h ⟩) + ⟨u⃗^+_τ,h(t_n-1), ϕ⃗_τ,h^+(t_n-1)⟩= 0 , \n\n\t\t\n\t\t\t    Q_n (⟨ρ∂_t v⃗_τ,h , χ⃗_τ,h ⟩+ A_γ(u⃗_τ,h, χ⃗_τ,h ) + C(χ⃗_τ,h,p_τ,h)) + ⟨ρv⃗^+_τ,h(t_n-1), χ⃗_τ,h^+(t_n-1)⟩= 0  ,\n\n\t\t\n\t\t\t    Q_n (⟨c_0 ∂_t p_τ,h,ψ_τ,h ⟩- C(v⃗_τ,h,ψ_τ,h)+ B_γ(p_τ,h, ψ_τ,h)) + ⟨c_0 p^+_τ,h(t_n-1), ψ_τ,h^+(t_n-1)⟩= 0 \n\t\n\nfor all (ϕ⃗_τ,h,χ⃗_τ,h,ψ_τ,h)∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h). We let A⃗_γ:  V⃗_h ↦V⃗_h be the discrete operator that is defined, for w⃗_h ∈V⃗_h and all ϕ⃗_h∈V⃗_h, by\n\n    ⟨A⃗_γw⃗_h , ϕ⃗_h ⟩ = A_γ (w⃗_h,ϕ⃗_h) .\n\nIn (<ref>) we choose ϕ⃗_τ,h=A⃗_γu⃗_τ,h, χ⃗_τ,h=v⃗_τ,h and ψ_τ,h=p_τ,h. Adding the resulting equations yields that \n\n    Q_n (⟨∂_t u⃗_τ,h , A⃗_γu⃗_τ,h⟩  + ⟨ρ∂_t v⃗_τ,h , v⃗_τ,h⟩  + ⟨ c_0 ∂_t p_τ,h, p_τ,h⟩ + B_γ(p_τ,h,p_τ,h) )   \n          + ⟨u⃗^+_τ,h(t_n-1), A⃗_γ u_τ,h^+(t_n-1)⟩  + ⟨ρv⃗^+_τ,h(t_n-1),  v⃗_τ,h^+(t_n-1)⟩ + ⟨ c_0 p^+_τ,h(t_n-1), p_τ,h^+(t_n-1)⟩  = 0  .\n\nRecalling  the exactness of the Gauss–Radau formula (<ref>) for w∈ℙ_2k(I_n;), Eq. (<ref>) yields that \n\n    1/2∫_t_n-1^t_nd/dt( ⟨A⃗_γu⃗_τ,h , u⃗_τ,h⟩  + ⟨ρv⃗_τ,h , v⃗_τ,h⟩  + ⟨ c_0 p_τ,h, p_τ,h⟩ )  t + Q_n(B_γ(p_τ,h,p_τ,h) )  \n          + ⟨u⃗^+_τ,h(t_n-1), A⃗_γ u_τ,h^+(t_n-1)⟩  + ⟨ρv⃗^+_τ,h(t_n-1),  v⃗_τ,h^+(t_n-1)⟩ + ⟨ c_0 p^+_τ,h(t_n-1), p_τ,h^+(t_n-1)⟩  = 0  .\n\nUsing (<ref>), this shows that \n\n    A_γ (u⃗_τ,h(t_n) , u⃗_τ,h(t_n))  + ⟨ρv⃗_τ,h (t_n), v⃗_τ,h(t_n)  ⟩  + ⟨ c_0 p_τ,h(t_n), p_τ,h(t_n)⟩ +  2 Q_n (B_γ(p_τ,h,p_τ,h) ) \n          + A_γ(u⃗^+_τ,h(t_n-1), u⃗_τ,h^+(t_n-1))  + ⟨ρv⃗^+_τ,h(t_n-1),  v⃗_τ,h^+(t_n-1)⟩ + ⟨ c_0 p^+_τ,h(t_n-1), p_τ,h^+(t_n-1)⟩  = 0  .\n\nFrom (<ref>) along with the discrete coercivity properties (<ref>) of A_γ and (<ref>) of B_γ we directly deduce that \n\n    u⃗_τ,h(t_n)= u⃗_τ,h^+(t_n-1)=0⃗ ,   v⃗_τ,h(t_n)= v⃗_τ,h^+(t_n-1)=0⃗  and   p_τ,h(t_n)=p_τ,h^+(t_n-1)= 0 ,\n\nas well as\n\n    p_τ,h(t_n,μ^GR) = 0  ,   for  μ = 1,…, k+1 .\n\nWe note that t_n,k+1^GR=t_n. Relation (<ref>) now implies that p_τ,h≡ 0 on I_n. \n\n To prove that u⃗_τ,h≡0⃗ and v⃗_τ,h≡0⃗,  by (<ref>) it is sufficient to show that u⃗_τ,h(t_n,μ^G)=0⃗ and v⃗_τ,h(t_n,μ^G) = 0⃗, for μ = 1,…, k, where t_n,μ^G, for μ = 1,…, k, are the nodes of the k-point Gauss quadrature formula on I_n that is exact for all polynomials in ℙ_2k-1(I_n;). This is done now. Recalling (<ref>), we conclude from (<ref>) by a suitable choice of test functions that \n \n    ∂_t u⃗_τ,h(t_n,μ^GR)=v⃗_τ,h(t_n,μ^GR)  ,   for  μ = 1,…, k .\n \t\nNext, choosing  χ_τ,h=v⃗_τ,h in (<ref>) and recalling (<ref>) imply that \n\n    Q_n (⟨ρ∂_t v⃗_τ,h , v⃗_τ,h⟩ + A_γ(u⃗_τ,h, ∂_t u⃗_τ,h ) )= 0\n \t\nBy the exactness of the Gauss–Radau formula (<ref>) for all w∈ℙ_2k(I_n;) we have from (<ref>) that \n\n    ∫_t_n-1^t_n⟨ρ∂_t v⃗_τ,h , v⃗_τ,h⟩ t + 1/2∫_t_n-1^t_nd/dt A_γ (u⃗_τ,h , u⃗_τ,h )   t = 0  .\n \t\nThe second of the terms in (<ref>) vanishes by (<ref>). The stability result of <cit.> then implies that \n\n    v⃗_τ,h(t_n,μ^G) = 0⃗ ,   for  μ = 1,…, k .\n\nFrom (<ref>) along with  (<ref>) we then deduce that v⃗_τ,h≡0⃗ on I_n.  Choosing the test function ϕ⃗_τ,h=u⃗_τ_h in  (<ref>), using v⃗_τ,h≡0⃗ and applying the stability result <cit.>, it follows that \n\n    u⃗_τ,h(t_n,μ^G) = 0⃗ ,   for  μ = 1,…, k .\n\n From (<ref>) along with  (<ref>) we then have that u⃗_τ,h≡0⃗ on I_n. Thus uniqueness of solutions to (<ref>) and, thereby, well-posedness of Problem <ref>  is thus ensured.\n\n\n\nIn Appendix <ref> an alternative formulation for the system (<ref>) is still presented. It is based on using the time derivative ∂_t u⃗_τ,h of the primal variable u⃗_τ,h instead of the auxiliary variable v⃗_τ,h in (<ref>). In this case, an additional surface integral has to be included; cf.  Eq. (<ref>) . \n\n\n\n\n§ ALGEBRAIC SOLVER BY GEOMETRIC MULTIGRID PRECONDITIONED GMRES ITERATIONS\n\n\n\nOn the algebraic level, the variational problem (<ref>) leads to linear systems of equations with complex block structure, in particular if higher order (piecewise) polynomial degrees k for the approximation of the temporal variable are involved. This demands for a robust and efficient linear solver, in particular in the three-dimensional case Ω⊂^3. For solving (<ref>) we consider using flexible GMRES iterations <cit.> that are preconditioned by a V-cycle geometric multigrid method (GMG) based on a local Vanka smoother. In <cit.>, the combined GMG–GMRES approach is further embedded in a Newton iteration for solving space-time finite element discretizations of the Navier–Stokes system. Thus, nonlinear extensions of the prototype model (<ref>) are expected to become feasible by our approach as well. \n\nTo derive the algebraic form of (<ref>), the discrete functions u⃗_τ,h, v⃗_τ,h and p_τ,h are represented in a Lagrangian basis {χ_n,m}_m=1^k+1⊂ℙ_k(I_n;) with respect to the (k+1) Gauss–Radau quadrature points of I_n, such that \n\n\n\n\tu⃗_τ,h_|I_n(x⃗,t)     = ∑_m=1^k+1 u⃗_n,m(x⃗) χ_n,m(t) ,   v⃗_τ,h_|I_n(x⃗,t) = ∑_m=1^k+1 v⃗_n,m(x⃗) χ_n,m(t) , \n  p_τ,h_|I_n(x⃗,t)     = ∑_m=1^k+1 p_n,m(x⃗) χ_n,m(t) .\n\n\nThe resulting coefficient functions (u⃗_n,m,v⃗_n,m,p_n,m)∈V⃗_h×V⃗_h× Q_h, for m=1,…,k+1, are developed in terms of the finite element basis of V⃗_h and Q_h, respectively. Letting V⃗_h= span{ψ⃗_1,…,ψ⃗_R } and Q_h=span{ξ_1,…,ξ_S }, we get that \n\n    u⃗_n,m(x⃗) = ∑_r=1^R u^(r)_n,mψ⃗_r(x⃗) ,   v⃗_n,m(x⃗) = ∑_r=1^R v^(r)_n,mψ⃗_r(x⃗)   and   \n    \tp_n,m(x⃗) = ∑_s=1^S p^(s)_n,m ξ_s(x⃗) .\n\nFor the coefficients of the expansions in (<ref>) we define the subvectors \n\n\n\nU⃗_n,m     = (u^(1)_n,m,…,u^(R)_n,m )^⊤ ,    V⃗_n,m=  (v^(1)_n,m,…,v^(R)_n,m )^⊤  and \n \nP⃗_n,m     =  (p^(1)_n,m,…,p^(S)_n,m )^⊤ ,    for    m=1,…,k+1 ,\n\n  \nof the degrees of freedom for all Gauss–Radau quadrature points and the global solution vector on I_n by\n\n    X⃗_n^⊤ = ((V⃗_n,1)^⊤,(U⃗_n,1)^⊤,(P⃗_n,1)^⊤,…, (V⃗_n,k+1)^⊤,(U⃗_n,k+1)^⊤,(P⃗_n,k+1)^⊤) .\n\nWe note that X⃗_n comprises the (spatial) degrees of freedom for all (k+1) Gauss–Radau nodes, representing the Lagrange interpolation points in time , of the subinterval I_n. The approximations at these time points will be computed simultaneously. Substituting (<ref>) and (<ref>) into (<ref>) and choosing in (<ref>) the test basis {χ_n,mψ⃗_r,χ_n,mψ⃗_r,χ_n,mξ_s}, for m=1,…,k+1, r=1,…, R and s=1,…,S,  built from the trial basis in (<ref>) and (<ref>), we obtain the following algebraic system.\n[Algebraic I_n-problem]\n\nFor the vector X⃗_n, defined in (<ref>) along with (<ref>), of the coefficients of the expansions  (<ref>) solve \n\n    A⃗_n X⃗_n = F⃗_n ,\n\nwhere the matrix A⃗_n exhibits the (k+1)× (k+1) block structure \n\n    A⃗_n = (A⃗_a,b)_a,b=1^k+1\n\nwith block submatrices A⃗_a,b, for a,b=0,…,k, defined by\n\n    A⃗_a,b = ([                 - M⃗^0,V⃗_h_a, b                    M⃗^1,V⃗_h_a,b                               0⃗;                    M⃗^1,V⃗_h_a,b                A⃗_a,b + N⃗^A_a,b                         C⃗^⊤_a,b;                               0⃗                         - C⃗_a,b M⃗^1,Q_h_a,b + B⃗_a,b + N⃗^B_a,b ]) .\n\n\nFor the choice Q_h^l=Q_h^l,cont in (<ref>), the explicit representation of the submatrices in (<ref>) reads as\n\n    (M⃗^1,V⃗_h_a,b)_i,j    := Q_n(⟨ρ∂_t χ_n,aψ⃗_j, χ_n,bψ⃗_i⟩) + ⟨ρχ_n,a(t_n-1^+) ψ⃗_j, χ_n,b(t_n-1^+) ψ⃗_i⟩ , \n    (M⃗^0,V⃗_h_a,b)_i,j    := Q_n (⟨ρχ_n,aψ⃗_j, χ_n,bψ⃗_i⟩)  , \n    (A⃗_a,b)_i,j    : = Q_n (⟨C⃗ε⃗(χ_n,aψ⃗_j), ε⃗(χ_n,bψ⃗_i) ⟩ + ⟨C⃗ε⃗(χ_n,aψ⃗_j) n⃗ , χ_n,bψ⃗_i⟩_Γ^D_u⃗) , \n    (N⃗^A_a,ψ⃗_b)_i,j    :=  Q_n (a_γ(χ_n,aψ⃗_i,χ_n,bψ⃗_i))\n\nas well as \n\n    (C⃗_a,b)_r,j     := Q_n (-α⟨∇· (χ_n,bψ⃗_j), χ_n,aξ_r ⟩ + α⟨χ_n,bψ⃗_j·n⃗ , χ_n,aξ_r ⟩_Γ^D_u⃗) ,\n    (M⃗^1,Q_h_p_a,p_b)_r,s    := Q_n(⟨ c_0 ∂_t χ_n,aξ_s, χ_n,bξ_r ⟩) + ⟨ c_0 χ_n,a(t_n-1^+) ξ_s, χ_n,b(t_n-1^+) ξ_r⟩)\n\nand\n\n    (B⃗_a,b)_r,s     := Q_n (⟨K⃗∇ (χ_n,aξ_s), ∇ (χ_n,bξ_r) ⟩ - ⟨K⃗∇ (χ_n,aξ⃗_s) ·n⃗ , χ_n,bξ_r⟩_Γ^D_p) , \n    (N⃗^B_a,b)_r,s    := Q_n (b_γ(χ_n,aξ_s,χ_n,bξ_r)) ,\n\nwith a_γ(·,·) and b_γ(·,·) being defined in (<ref>) and i,j=1,…, R and r,s=1,… , S. The right-hand side vector F⃗_n in  (<ref>) is defined similarly, according to (<ref>) along with (<ref>). Its definition is skipped here for brevity. We note that (<ref>) is still multiplied by ρ>0 for the definition of the first row in (<ref>). For the family of finite element pairs, corresponding to Q_h^l=Q_h^l,disc in (<ref>), the definition of the submatrix B_a,b has to be adjusted to the second of the options in (<ref>). Further, the contribution N⃗^B_a,b has to be omitted. \n\nIncreasing values of the piecewise polynomial degree in time k enhance the complexity of the block structure of the system matrix A⃗_n in (<ref>) along with (<ref>). They impose an additional facet of challenge on the construction of efficient block preconditioners for (<ref>). We solve the linear system (<ref>) for the unknown X⃗_n on the subinterval I_n by flexible GMRES iterations <cit.> that are preconditioned by a V-cycle geometric multigrid (GMG) algorithm <cit.>. Key ingredients of the GMRES–GMG approach are \n\n\n  * left preconditioning of each GMRES iteration by a single V-cycle GMG iteration,\n\n  * prolongation to grids by interpolation and application of the transpose operator for restriction to grids,\n\n  * J_max pre- and post-smoothing steps on each grid level {𝒯_l} for l=1,…,L and\n\n  * application of a (parallel) direct solver on the coarsest mesh partition 𝒯_0.\n\nIn our computational studies presented in Sec. <ref>, we use J_max=4 and the parallel direct solver SuperLU_DIST <cit.>. For the implementation of the restriction and prolongation operators the deal.II classes MultiGrid and MGTransferPrebuilt are used. For the deal.II finite element library we refer to <cit.>. For details of the parallel implementation by the message passing interface (MPI) protocol of our GMG approach  we refer to <cit.>.\n\nThe choice of the smoothing operator in the GMG method is extremely diverse; cf., e.g., <cit.> for a further discussion. We use a collective smoother of Vanka type that is based on the solution of small local problems. Compared to the Navier–Stokes system <cit.>, the dynamic Biot problem (<ref>) requires adaptations in the construction of the local Vanka smoother. In inf-sup stable discretizations of the Navier–Stokes equations by the ℚ_r^d/ℙ_r-1^disc, r≥ 2, family of finite element spaces no coupling between the pressure degrees of freedom is involved due to the discontinuous approximation of the pressure variable. This feature leads to excellent performance properties of the Vanka smoother <cit.>. In contrast to this, the discretization (<ref>) of (<ref>) by ℙ_r-1^disc, r≥ 2, elements involves a coupling between degrees of freedom of the scalar variable p due to the presence of the face integrals over the average and jump in the second of the options in (<ref>) for the definition of the bilinear form B_γ. This coupling reduces the smoothing properties of elementwise Vanka operator. For the ℚ_r-1, r≥ 2, family of elements for the scalar variable p, leading to the first of the options in (<ref>), the coupling of degrees of freedom of p by its continuous in space approximation and the loss of smoothing properties  arise likewise. As a remedy, for both families of inf-sup stable approximation in (<ref>) the local Vanka smoother is computed on overlapping patches of adjacent elements. In addition, an averaging of the patchwise updates is done after the Vanka smoother has been applied on all of them. \n\nTo construct the patchwise Vanka, we let on the mesh partition 𝒯_l, for l=1,…, L, of the multigrid hierarchy the linear system, to be solved, be represented by\n\n    A⃗_l d⃗_l = b⃗_l ,   for    l=1,…, L .\n\nTo each grid node ξ⃗_l^m, for m = 1 ,… , M_l, where M_l denotes the total number of grid nodes on the mesh partition 𝒯_l,  we built a patch of adjacent elements such that \n\n    P_l^m := ⋃{ K ∈𝒯_l |ξ_l^m ∈K} ,   for  m=1,…, M_l  .\n\nIn two space dimensions P_l^m is built from four elements, if ξ_l^m ∉∂Ω. In three space dimensions, P_l^m has eight elements, if ξ_l^m ∉∂Ω.  If ξ_l^m ∈∂Ω, patches of less elements are obtained.  On 𝒯_l, let Z_l denote the index set of all global degrees of freedom with cardinality C_l,\n\n    C_l := card(Z_l) .\n\nLet Z_l(P_l^m) denote the subset of Z_l all global degrees of freedom linked to the patch P_l^m, i.e. degrees of freedom of u⃗_τ,h, v⃗_τ,h and p_τ,h for the (k+1) Gauss–Radau time points of I_n. The cardinality of Z_l(P_l^m) is denoted by C_l^m, \n\n    C_l^m : = card(Z_l(P_m^l)) ,   for   m=1,…, M_l  .\n\nFurther, we denote the index set of all local degrees of freedom on P_l^m  by Ẑ_l(P_m^l) :={0,…,C_l^m-1}. For the notation, we note that the set Ẑ_l(P_m^l) depends on the cardinality of the patch P_l^m. For a given patch P_l^m and a local degree of freedom with number μ̂∈Ẑ_l(P_m^l) let the mapping \n\n    dof:𝒯_l×Ẑ_l(P_m^l)  → Z_l ,     μ = dof(P_l^m,μ̂)∈ Z_l(P_l^m) ,\n\nyield the uniquely defined global number μ∈ Z_l. Finally, we put R = dim V⃗_h and S = dim  Q_h. \n\nWe are now in a position to define the local Vanka operator for the patch P_l^m in an exact mathematical way; cf., e.g., <cit.>.\n[Patchwise Vanka smoother]\n\nOn patch P_l^m, for m∈{1,…,M_l}, the local Vanka operator S⃗_P_l^m: ^(k+1)  ·  (2R+S)→^C^l_m is defined by  \n\n    S⃗_P_l^m(d⃗) = R⃗_ P_l^md⃗ + ω A⃗_P_l^m^-1 R⃗_P_l^m  (b⃗_l-A⃗_l d⃗) ,\n\nwith underrelaxation factor ω>0 and  P_l^m-local restriction operator R⃗_K:^(k+1)· (2R+S)→^C_l^m defined by \n\n    (R⃗_P_l^md⃗)[μ̂] = d⃗[dof(P_l^m,μ̂)] ,   for  μ̂∈Ẑ_l(P_l^m) .\n\nFurther, the patch system matrix A⃗_P_l^m∈^C_l^m,C_l^m in (<ref>) is defined by \n\n    A⃗_P_l^m[ν̂][μ̂] := A⃗[dof(P_l^m,ν̂)][dof(P_l^m,μ̂)] ,   for  ν̂,μ̂∈Ẑ_l(P_l^m) .\n\n\nIn the numerical experiments of Sec. <ref> we choose ω = 0.7.  The P_l^m-local restriction operator (<ref>) assigns to a global defect vector d⃗∈^(k+1)· (2R+S) the local block vector R⃗_K d⃗∈^C_l^m that contains all components of d⃗ that are associated with all degrees of freedom (for all (k+1) Gauss–Radau points of I_n) belonging to the patch P_l^m.  For the computation of the inverse (A⃗_P_l^m)^-1 of the patch system matrixA⃗_P_l^m in (<ref>) we use LAPACK routines.\n\nThe application of the smoother for (<ref>) on the mesh partition 𝒯_l is summarized in Algorithm <ref>.  \n\n\n\nIn line <ref> of Alg. <ref> the defect and solution vector is pre-initialized with 0⃗. In line <ref> the loop over all  J_max smoothing steps starts. In line <ref>  and <ref> the counter vector p⃗ for the number of updates of the degrees of freedom and the auxiliary vector z⃗  are initialized with 0⃗.\tIn line <ref> the loop over all patches P_l^m, for m=1,…,M, starts. In line <ref> the local Vanka smoother is applied on patch P_l^m to the current iterate d⃗ of the defect vector and the image is stored in the local patch vector y⃗. In line  <ref> the local vector y⃗ is assigned to an auxiliary global  vector z⃗. In line <ref> the components of the counter p⃗ are incremented for the (global) indices associated with the degrees of freedom of the patch P_l^m processed in the loop. Finally, in line <ref> the arithmetic mean of the local (patchwise) updates z⃗ is assigned to the update of the global defect vector d⃗. In line <ref>, the P_l^m-dependent extension operator E⃗_P_l^m:^C_l^m→^(k+1)· (2R+S) is defined by \n\n    (E⃗_P_l^my⃗)[μ] = {[                            y[μ̂] , if ∃μ̂∈Ẑ_l(P_l^m): μ = dof(K,μ̂) ,;                                0 ,                 if μ∉Z_l(P_l^m)  . ].\n\n\nRegarding the performance of Alg. <ref> and the overall GMRES–GMG approach we note the following. \n\n\n\n  * Averaging of the patchwise updates implemented in line <ref> and <ref> of Alg. <ref>, that is used instead of overwriting successively the (global) degrees of freedom within the patch loop starting in line <ref>, is essential and ensures the convergence and efficiency of the local Vanka smoother and, thereby, the desired performance of the overall GMRES–GMG linear solver. Without the averaging step we encountered convergence problems of the GMRES–GMG solver for the experiments  of Sec. <ref>.\n\n  * The same holds for the application of the Vanka smoother on the patches (<ref>) instead of using an elementwise Vanka smoother on the element K. The latter would lead to systems  (<ref>) of smaller dimension, however causes convergence problems for the GMRES–GMG solver. This is expected to be due coupling of the degrees of freedom of the scalar variable p in the spatial discretizations used here,.  \n \n\n\n\n\n§ NUMERICAL STUDIES\n\n\n \nIn this section we study numerically the proposed space-time finite element and GMRES–GMG solver approach with respect to its computational and energy efficiency. Firstly, we demonstrate the accuracy of solutions in terms of convergence rates. Further, we illustrate the robustness of the GMRES–GMG solver with respect to the resolution in space and time and the polynomial approximation order. This is done for a challenging three-dimensional test problem of practical interest, in order to demonstrate the feasibility of large scale three-dimensional simulations. The numerical convergence of goal quantities of the benchmark is addressed. The parallel scaling properties of our implementation are also investigated. Beyond these studies of classical performance engineering, the energy efficiency of the approach is considered further.  \n\nThe implementation of the numerical scheme and the GMRES–GMG solver was done in an in-house high-performance frontend solver for the  library <cit.>. For details of the parallel implementation of the geometric multigrid solver we refer to <cit.>. In all numerical experiments, the stopping criterion for the GMRES iterations is an absolute residual smaller than .\nThe computations were performed on a Linux cluster with 571 nodes, each of them with 2 CPUs and 36 cores per CPU. The CPUs are Intel Xeon Platinum 8360Y with a base frequency of 2.4, a maximum turbo frequency of 3.5 and a level 3 cache of 54. Each node has 252 of main memory.\n\n\n\n §.§ Accuracy of the discretization:  Experimental order of convergence\n\n\n\t\nWe study (<ref>) for Ω=(0,1)^2 and I=(1,2] and the prescribed solution\n\n    u( x, t) = ϕ( x, t)  E_2   and  \n    \tp( x, t) = ϕ( x, t)   with  ϕ( x, t) = sin(ω_1 t^2) sin(ω_2 x_1) sin(ω_2 x_2)\n\nand ω_1=ω_2 = π. We put ρ=1.0, α=0.9, c_0=0.01 and K= E_2 with the identity E⃗_2∈^2,2. For the fourth order elasticity tensor C, isotropic material properties with Young's modulus E=100 and Poisson's ratio ν=0.35, corresponding to the Lamé parameters λ = 86.4 and μ = 37.0, are chosen.  For an experiment with larger values of λ and μ we refer to Table <ref> in the appendix. In our numerical experiments, the norm of L^∞(I;L^2) is approximated by computing the function's maximum value in the Gauss quadrature nodes t_n,m of I_n, i.e., \n\n    w_L^∞(I;L^2)≈max{ w_|I_n(t_n,m)| m=1,… ,M ,   n=1,…,N} ,   with   M=100  .\n\n\nWe study the space-time convergence behavior of the scheme (<ref>). For this, the domain Ω is decomposed into a sequence of successively refined meshes of quadrilateral finite elements. The spatial and temporal mesh sizes are halved in each of the refinement steps. The step sizes of the coarsest space and time mesh are h_0=1/(2√(2)) and τ_0=0.1. We choose the polynomial degree k=2 and r=3, such that discrete solutions u⃗_τ,h, v⃗_τ∈ Y_τ^2(V⃗_h), p_τ,h∈ Y_τ^2(Q_h) with local spaces ℚ_3^2/ P_2^disc are obtained, as well as k=3 and r=4 with u⃗_τ,h, v⃗_τ∈ Y_τ^3(V⃗_h) and p_τ,h∈ Y_τ^3(Q_h) and local spaces ℚ_4^2/ℙ_3^disc ; cf. (<ref>), (<ref>) and (<ref>). The calculated errors and corresponding experimental orders of convergence are summarized in Table <ref> and <ref>, respectively. The error is measured in the quantities associated with the energy of the system (<ref>); cf. <cit.> and <cit.>. Table <ref> and <ref> nicely confirm the optimal rates of convergence with respect to the polynomial degrees in space and time of the overall approach. A notable difference in the convergence behavior between the pairs ℚ_r^2/ℙ_r-1^disc and ℚ_r^2/ℚ_r-1 of local spaces for the discretization of the spatial variables is not observed. For completeness, we summarize in Appendix <ref> the convergence results obtained for the pair ℚ_r^2/ℚ_r-1 of spaces of the Taylor–Hood family. A minor superiority of the pair ℚ_r^2/ℙ_r-1^disc over the pair ℚ_r^2/ℚ_r-1 is only seen in the approximation of the scalar variable p. The coincidence of the convergence results also holds for the application of Problem <ref> instead of Problem <ref>. The two discrete problems differ from each other by the discretization of the term α∇·∂_t u⃗ in (<ref>). \n\n\n\n\t\n\nNext, we show numerically that the time discretization is even superconvergent of order 2k+1 in the discrete time nodes t_n, for n=1,…, N. For this, we introduce the time mesh dependent norm\n\n    w_l^∞(L^2) := max{ w(t_n)| n=1,…, N} .\n\nWe prescribe the solution\n\n\t\n    u( x, t) =  \n    \t\t[ -2 (x-1)^2 x^2 (y-1) y (2 y-1) sin (ω_1  t); -2 (x-1) x (2 x-1) (y-1)^2 y^2 sin (ω_1  t) ]  and  \n    \t\tp( x, t) = -2 (x-1)^2 x^2 (y-1) y (2 y-1) sin (ω_2  t)\n\n\nwith ω_1=40·π and ω_2 = 10·π. We put ρ=1.0, α=0.9, c_0=0.01 and K= E_2 with the identity E⃗_2∈^2,2. For the elasticity tensor C, isotropic material properties with Young's modulus E=100 and Poisson's ratio ν=0.35 are used. For the local spaces we choose the pair ℚ_5^2/ℚ_4 such that, for any t∈ [0,T], the solution (<ref>)   belongs to the discrete spaces V⃗_h and Q_h, respectively,  and its spatial approximation is exact. This simplification is done here since we aim to study the convergence of the temporal discretization only. In the experiment, we choose k=2 such that discrete solutions u⃗_τ,h, v⃗_τ∈ Y_τ^2(V⃗_h) and p_τ,h∈ X_τ^2(Q_h) are obtained.\nWe use a spatial mesh that consists of 16 cells with h=1/(2√(2)) and set τ_0=0.02.\nThe calculated errors and corresponding experimental orders of convergence are summarized in Table <ref>. Superconvergence of order 2k+1 in the discrete time nodes is clearly observed in the second of the tables in Table <ref>. \n\n\t\n\n\n §.§ Computational efficiency:  Accuracy of goal quantities and convergence of the GMRES–GMG solver in a 3d benchmark\n\n\n\nFor a three-dimensional problem configuration of practical interest (cf. <cit.>), we study the potential of the proposed approach to compute reliably and efficiently goal quantities of physical interest that are defined in (<ref>). Concurrently, we analyze the convergence and performance properties of the GMRES–GMG solver of Sec. <ref> for our families of space-time finite element methods. More precisely, we consider the L-shaped domain Ω⊂^3 sketched in Fig. <ref> along with the boundary conditions for u⃗ prescribed on the different parts of ∂Ω. Beyond the boundary conditions (<ref>) and (<ref>), we further apply (homogeneous) directional boundary conditions on parts of the boundary for the variable u⃗. This is done for the sake of physical realism. For the portion Γ^d_u⃗⊂∂Ω they read as  \n\n    u⃗·n⃗ = 0     and      (σ⃗(u⃗)n⃗) ·t⃗_i  = 0 ,   for   i=1,…, d-1 ,    on  Γ^d_u⃗× (0,T] ,\n\nfor the stress tensor σ⃗(u⃗) = C⃗ε⃗(u⃗) and the unit basis vectors t⃗_i, for i=1,…,d-1, of the tangent space at x⃗∈Γ^d_u⃗.  In the definition of A_γ in (<ref>) and (<ref>), the conditions (<ref>) still need to be implemented properly. For instance, for the left boundary of the L-shaped domain Ω the first of the equations in (<ref>) implies that\n\n    u⃗_τ,h·n⃗ = u_τ,h,1 = 0 ,   for  u⃗_τ,h=(u_τ,h,1,u_τ,h,2)^⊤ .\n\nBy the second of the conditions in (<ref>) we get for the second of the terms on the right-hand of (<ref>) that \n\n    ⟨C⃗ε(u⃗_τ,h)n⃗, χ⃗_τ,h⟩_Γ_u⃗^l  = ⟨C⃗ε(u⃗_τ,h) n⃗·n⃗,n⃗·χ⃗_τ,h⟩_Γ_u⃗^d .\n\nFor the boundary part Γ^d_u⃗ we then put, similarly to (<ref>), \n\n    a^d_γ (w⃗,χ⃗_h) := - ⟨w⃗·n⃗, C⃗ε(χ⃗_h) n⃗·n⃗⟩_Γ^d_u⃗ + γ_a  h^-1⟨w⃗·n⃗, χ⃗_h ·n⃗⟩_Γ^d_u⃗ ,\n\nwhile leaving a_γ unmodified for the part Γ^D_u⃗ where Dirichlet boundary conditions are prescribed for u⃗. In its entirety, we thus have that a_γ(·,·) := a_γ^D (·,·)+a_γ^d (·,·) with a_γ^D (·,·) being defined by the right-hand side of (<ref>). By the arguments of Appendix <ref>, the coercivity of the resulting form A_γ is still ensured. On the right boundary we prescribe a homogeneous Neumann condition for u⃗ with  t⃗_N=0⃗ in (<ref>). On the left part of the upper boundary, i.e. for Γ^N_u⃗:=(0,0.5)×{1}× (0,0.5),  we impose the traction force (cf. (<ref>))\n\n    t⃗_N = \n    \t[                                            0; 5 · 10^9· (32 x z-18 x-16 z+10) sin (8 π  t);                                            0 ] .\n\nFor the scalar variable p we prescribe a homogeneous Dirichlet condition (<ref>) on the left upper part of ∂Ω, i.e., for (x_1,x_2,x_3)∈Γ_p^D:=[0,0.5]×{1}× [0,0.5]. On Γ_p^N:=∂Ω\\Γ_p^D a homogeneous Neumann condition with p_N=0 in (<ref>) is prescribed. We put ρ=1.0, α=0.9, c_0=0.01 and K= E_3 with the identity E⃗_3∈^3,3. For the elasticity tensor C, isotropic material properties with Young's modulus E=20000 and Poisson's ratio ν=0.3, that model the material behavior of human bone (cf. <cit.>), are used. We put T=4.\n\n\n\n\nAs goal quantities of this benchmark problem, we measure the displacement in the normal direction as well as the pressure at the right part of the boundary by \n\n    b_u⃗ = ∫_Γ_mu⃗·n⃗  o     and     \n    \tb_p = ∫_Γ_m p   o     for  Γ_m:= {1}× (0,0.5)× (0,0.5) .\n \n\nThe time step size of the temporal discretization is chosen as τ = 0.01. The calculated profile for t=3.8 of the modulus of the vectorial variable u⃗ and the scalar variable p are illustrated in Fig. <ref>. \nIn Table <ref> we summarize characteristic quantities and results of our simulations for various spatial resolutions and different temporal and spatial polynomial degrees of the STFEMs. In Fig. <ref> we visualize the computed benchmark quantities (<ref>) of some of the simulations over the temporal axis. For the temporal discretization with polynomial degree k = 0 and k=1 the computed quantities differ on the spatial refinement level 4 only by a small shift of the phases of the goal quantifies. This indicates that for the current benchmark setting (choice of the model parameter and boundary conditions) the spatial discretization error dominates the temporal one. Therefore, in order to study numerically the convergence and accuracy of the goal quantities, we computed the benchmark problem for higher spatial resolutions (spatial mesh and approximation order; cf. Table <ref>. The lowest row in Table <ref> contains the results of the finest simulation that we could run on our hardware. Fig. <ref> shows that the solution (i.e., the goal quantities) is not fully converged yet. This underlines the complexity of the benchmark. The final column of Table <ref> shows the convergence statistics of the proposed GMRES–GMG solver. In terms of the average number of iterations per time step the solver is (almost) grid independent. This underlines its capability and robustness for solving efficiently the complex systems arising from space-time finite element discretizations of partial differential equations.   \n\n\n\n\tscientific-notation = false,\n\t\tround-mode=places,\n\t\tround-precision=2,\n\t\toutput-exponent-marker=,\n\t\ttable-figures-integer=4, \n\t\ttable-figures-decimal=2, \n\t\ttable-figures-exponent=1, \n\t\ttable-sign-mantissa = false, \n\t\ttable-sign-exponent = false, \n\t\ttable-number-alignment=right \n\t\n\n\n\n\n\n\n\n\n §.§ Parallel scaling and energy efficiency\n\n\nHere, we study briefly the parallel scaling and energy efficiency of our solver. By studying energy consumption, we'd like to draw attention to this emerging dimension in the tuning of algorithms. Energy efficiency broadens the classical hardware-oriented numerics that is applied to enhance the performance of the current method on the target hardware and/or to find other numerical methods to improve the numerical efficiency. For the longer term, energy and power consumption needs to be mapped into a rigorous performance model. Here, we restrict ourselves to illustrate numerically the parallel scaling and energy consumption properties of our implementation that uses Message Passing Interface(MPI) libraries and multi threading parallelism. \n\nWe perform a strong scaling benchmark for the test problem of Subsec. <ref> with k = 1, r = 2 and ref_n = 5, with 10571532 degrees of freedom in each subinterval I_n on the fine level 𝒯_L (cf. Table <ref>) and 98304 mesh cells on 𝒯_L. Throughout, we assign 18 MPI processes to each of the nodes used for the computations and vary the number n of nodes from n=20 to n=200. For the evaluation of the parallel scaling properties, we compute the parallel speedup of the code (cf. <cit.>) that is approximated by\n\n    S = t_wall(n=n_min)/t_wall(n) ,\n\nwhere t_wall(n) denotes the wall time of the simulation of fixed size on n compute nodes and t_wall(n=n_min) is the wall time of the simulation on the minimum number of nodes involved in the scaling experiment. Secondly, we compute similarly the energy ratio by means of \n\n    R = E(n)/E(n=n_min) ,\n\nwhere E(n) measures the total energy consumption of the simulation on n nodes. The energy consumption is determined by the Linux cluster workload manager slurm <cit.>. The energy consumption data is collected from hardware sensors using Intel's Running Average Power Limit (RAPL) mechanism. It measures the energy consumption of the processor and memory.  On our system, the sampling interval of energy consumption is determined by the value of 30 seconds. Fig. <ref> illustrates the results of the performance test.\n\n\n\nTo quantify and evaluate the productivity or resource costs of the algorithm and its implementation, we use a simple model for the Productivity P = Output O/Input  I; cf. <cit.>. In an economic sense, all outputs should be the desired ones. Therefore, we use the reciprocal of the wall time t_wall as the output O = 1/t_wall, such that a decrease in t_wall represents an increase of the (abstract) output. As the input I we use the total energy consumption E of the simulation. We scale the result by multiplying P with the constant factor E(n_min) · t_wall(n_min) such that the computation with n = n_min has a productivity of P=1.0:\n\n    P = 1/t_wall(n)/E(n)· E(n_min) · t_wall(n_min) = S/R ,\n\nwith S and R being defined in (<ref>) and (<ref>), respectively. The resulting productivity curve of our computations is presented in Fig. <ref>. In our model the simulation on 80 compute nodes is the most productive one, that is, the ratio of output (low wall-time) to input (energy) is best. The characteristic quantities of our performance study are also summarized in Table <ref>.\n\n\n\n\n\n\tscientific-notation = false,\n\t\tround-mode=places,\n\t\tround-precision=2,\n\t\toutput-exponent-marker=,\n\t\ttable-figures-integer=3, \n\t\ttable-figures-decimal=3, \n\t\ttable-figures-exponent=0, \n\t\ttable-sign-mantissa = false, \n\t\ttable-sign-exponent = false, \n\t\ttable-number-alignment=right \n\t\n\n\n\n\n\n\n§ SUMMARY AND OUTLOOK\n\n\n\nIn this work we presented and analyzed families of space-time finite element discretizations of the coupled hyperbolic-parabolic system (<ref>) of poro- or thermoelasticity. The time  discretization uses the discontinuous Galerkin method. The space discretization is based on inf-sup stable pairs of finite element spaces with continuous and discontinuous approximation of the scalar variable p. Well-posedness of the discrete problems is proved. For efficiently solving the arising algebraic systems with complex block structure in the case of increasing polynomial degrees of the time discretization a geometric multigrid preconditioner with a local Vanka smoother on patches of finite elements is proposed and studied. The overall approach is carefully evaluated for a sequence of numerical experiments, in particular for a challenging three-dimensional test setting of practical interest. Parallel scaling and energy consumption is also considered in the experiments. The benchmark problem of Subsec. <ref> deserves further studies. In particular, soft materials with a dominating impact of the hyperbolic equation (<ref>) to the overall system  (<ref>) need to be studied as well. The definition of the goal quantities of the proposed benchmark might be reconsidered and revised with regard to either an improved choice of such quantities or their computation with higher rate of convergence. This evaluation remains as a work for the future. Finally, multi-field formulations of (<ref>) with an explicit approximation of the stress tensor σ⃗= C⃗ε⃗ and the flux vector q⃗=-K⃗∇ p might be advantageous for applications of (<ref>) in that these quantities are of interest or desired. By using the concept of the local (patchwise) Vanka smoother GMG preconditioner, that was presented here, multi-field formulations of (<ref>) are expected to be become feasible as well. This also remains as a work for the future. \n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nComputational resources (HPC-cluster HSUper) have been provided by the project hpc.bw, funded by dtec.bw — Digitalization and Technology Research Center of the Bundeswehr.\n\n99\n\t\nA67\t\nG. M. Amdahl, Validity of the single processor approach to achieving large scale computing capabilities, in Proceedings of the April 18-20, 1967, Spring Joint Computer Conference on — AFIPS ’67 (Spring), Atlantic City, New Jersey: ACM Press, 1967, p. 483.\t\n\t\nAB21\nM. Anselmann, M. Bause, A geometric multigrid method for space-time finite element discretizations of the Navier–Stokes equations and its application to 3d flow simulation, ACM Trans. Math. Softw., accepted (2023), https://doi.org/10.1145/3582492, pp. 1–27; arXiv:2107.10561.\n\nAB22\nM. Anselmann, M. Bause, Efficiency of local Vanka smoother geometric multigrid preconditioning for space-time finite element methods to the Navier-Stokes equations, PAMM Proc. Appl. Math. Mech., accepted (2022), pp. 1–6; arXiv:2210.02690.\n\t\nAB21_2 \nM. Anselmann, M. Bause, CutFEM and ghost stabilization techniques for higher order space-time discretizations of the Navier–Stokes equations, Int. J. Numer. Meth. Fluids, 94 (2022), pp. 775–802.\n\nABBM20 \nM. Anselmann, M. Bause, S. Becher, G. Matthies, Galerkin-collocation approximation in time for the wave equation and its post-processing, ESAIM Math. Model. Numer. Anal., 54 (2020), pp. 2099–2123.\n\nAetal21\nD. Arndt, W. Bangerth, B. Blais, M. Fehling, R. Gassmöller, T. Heister, L. Heltai, U. Köcher, M. Kronbichler, M. Maier, P. Munch, J.-P. Pelteret, S. Proell, K. Simon, B. Turcksin, D. Wells, J. Zhang, The deal.II Library, Version 9.3, J. Numer. Math., 29 (2021), pp. 171–186.\n\nA02\nD. N. Arnold, D. Boffi, R. S. Falk, Approximation by quadrilateral finite elements, Math. Comp., 71 (2002), pp. 909–922.\n\nBGR10 \nW. Bangerth, M. Geiger, R. Rannacher, Adaptive Galerkin finite element methods for the wave equation,\nComput. Meth. Appl. Math., 10 (2010), pp. 3–48.\n \nBR03\nW. Bangerth, R. Rannacher, Adaptive Finite Element Methods for Differential Equations, Birkhäuser, Basel, 2003.\n\nBKR22\nM. Bause, M. Anselmann, U. Köcher, F. A. Radu, Convergence of a continuous Galerkin method for hyperbolic-parabolic systems, Comput. Math. with Appl., submitted (2022), pp. 1–24;  arXiv:2201.12014.\n\nBRK17 \nM. Bause, R. Radu, U. Köcher, Space-time finite element approximation of the Biot poroelasticity system with iterative coupling, Comput. Methods Appl. Mech. Engrg., 320 (2017), pp. 745–768.\n\nB02\nR. Becker, Mesh adaptation for Dirirchlet flow control via Nitsche's method, Commun. Numer. Meth. Engrg., 18 (2002), pp. 669–680.\n\t\nB41\nM. Biot, General theory of three-dimensional consolidation, J. Appl. Phys., 12 (1941), pp. 155–164.\n\nB55\nM. Biot, Theory of elasticity and consolidation for a porous anisotropic solid, J. Appl. Phys., 26 (1955), pp. 182–185.\n\nB72\nM. Biot, Theory of finite deformations of porous solids, Indiana Univ. Math. J., 21 (1972), pp. 597–620.\n\t\t\nBKNR22\nJ. W. Both, N. A. Barnafi, F. A. Radu, P. Zunino, A. Quarteroni, Iterative splitting schemes for a soft material poromechanics model, Comput. Methods Appl. Mech. Engrg., 388 (2022), 114183.\n\nBL11\nA. Brandt, O. E. Livne, Multigrid Techniques—1984 Guide with Applications to Fluid Dynamics, SIAM, Philadelphia, 2011. \n\nB03\nS. C. Brenner, Korn's inequalities for piecewise H⃗^1 vector fields,  Math. Comp., 73 (2003), pp. 1067–1087.\n\t\nBKB22\nM. P. Bruchhäuser,  U. Köcher, M. Bause, On the implementation of an adaptive multirate framework for coupled transport and flow, J. Sci.  Comput.,  93:59 (2022), https://doi.org/10.1007/s10915-022-02026-z, pp. 1–29. \n\nC72\nD. E. Carlson, Linear thermoelasticity, Handbuch der Physik  V Ia/2, Springer, Berlin, 1972.\n\nC00\nW. W. Cooper, L. M. Seiford, K. Tone Data Envelopment Analysis, Kluwer Academic Publishers, Dordrecht, 2000.\n\nPE12\nD. A. Di Pietro, A. Ern, Mathematical Aspects of Discontinuous Galerkin Methods, Springer, Berlin, 2012. \n\nDJRWZ18\nD. Drzisga, L. John, U. Rüde, B. Wohlmuth, W. Zulehner, On the analysis of block smoothers for saddle point problems, SIAM J. Matrix Anal. Appl., 39 (2018), pp. 932–960.\n\nF78\nG. Fairweather, Finite Element Galerkin Methods for Differential Equations, Lecture Notes in Pure and Applied Mathematics 34, Marcel Dekker Inc., New York, 1978.\n\nFTW19\nS. Franz, S. Trostorff, M. Waurick, Numerical methods for changing type systems, IMA J. Numer. Anal., 39 (2019), pp. 1009–1038.\n\nGHJRW16\nB. Gmeiner, M. Huber, L. John, U. Rüde, B. Wohlmuth, A quantitative performance study for Stokes solvers at the extreme scale, J. Comput. Sci., 17 (2016), pp. 509–521.\n\nGRSWW15\nB. Gmeiner, U. Rüde, H. Stengel, C. Waluga, B. Wohlmuth, Performance and scalability of hierarchical hybrid multigrid solvers for Stokes systems, SIAM J. Sci. Comput., 37 (2015), pp. C143–C168.\n\nGRSWW15_2\nB. Gmeiner, U. Rüde, H. Stengel, C. Waluga, B.  Wohlmuth, Towards textbook efficiency for parallel multigrid, Numer. Math. Theory Methods Appl., 8 (2015), pp. 22–46.\n\nH85\nW. Hackbusch, Multigrid methods and applications, Springer, Berlin, 1985.\n\nHK18\nQ. Hong, J. Kraus, Parameter-robust stability of classical three-field formulation of Biot's consolidation model, Electron. Trans. Numer. Anal., 48 (2018), pp. 202–226.\n\nHKXZ16\nQ. Hong, J. Kraus, J. Xu, L. Zikatanov, A robust multigrid method for discontinuous Galerkin discretizations of Stokes and linear elasticity equations, Numer. Math., 132 (2016), pp. 23–49.\n\nHST14\nS. Hussain, F. Schieweck, S. Turek, Efficient Newton-multigrid solution techniques for higher order space-time Galerkin discretizations of incompressible flow, Appl. Numer. Math., 83 (2014),  pp. 51–71.\n\nHST13\nS. Hussain, F. Schieweck, S. Turek, An efficient and stable finite element solver of higher order\nin space and time for nonstationary incompressible flow, Internat. J. Numer. Methods Fluids, 73 (2013), pp. 927–952.\n\t\t\nHST11\nS. Hussain, F. Schieweck, S. Turek, Higher order Galerkin time discretizations and fast multigrid solvers for the heat equation, J. Numer. Math., 19 (2011), pp. 41–61.\n\nJR18\nS. Jiang, R. Racke, Evolution equations in thermoelasticity, CRC Press, Boca Raton, 2018.\n\t\nJ16\nV. John, Finite Element Methods for Incompressible Flow Problems, Springer, Cham, 2016.\n\t\nJ02\nV.  John, Higher order finite element methods and multigrid solvers in a benchmark problem for the 3D Navier-Stokes equations, Int. J. Numer. Meth. Fluids, 40 (2002), pp. 775–798.\n\nJM01\t\nV. John, G. Matthies,\tHigher-order finite element discretizations in a benchmark problem for incompressible flows, Int. J. Numer. Meth. Fluids, 37 (2001), pp. 885–903.\t\n\t\nJT00\nV. John, L.  Tobiska, Numerical performance of smoothers in coupled multigrid methods for the parallel solution of the incompressible Navier–Stokes equations, Int. J. Numer. Meth. Fluids, 33 (2000),  pp. 453–473. \n\nKR18\n G. Kanschat, B. Riviere, A finite element method with strong mass conservation for Biot's linear consolidation model, J. Sci. Comput., 77 (2018), pp. 1762–1779.\n\nKM04\nO. Karakashian, C. Makridakis, Convergence of a continuous Galerkin method with mesh modification for nonlinear wave equations, Math. Comp., 74 (2004), pp. 85–102.\n\nKM99\nO. Karakashian, C. Makridakis, A space-time finite element method for the nonlinear Schrödinger equation: The continuous Galerkin method, SIAM J. Numer. Anal., 36 (1999), pp. 1779–1807.\n\nL86\nR. Leis, Initial boundary value problems in mathematical physics, Teubner, Stuttgart, John Wiley & Sons, Chichester, 1986.\n\nLD03\nX. S. Li, J. W. Demmel, SuperLU_DIST: A scalable distributed-memory sparse direct solver for unsymmetric linear systems, ACM Trans. Math. Softw., 29 (2003), pp. 110–140.\nLLRS94\nJ. Linden, G. Lonsdale, H. Ritzdorf, A. Schüller, Scalability aspects of parallel multigrid, Future Gener. Comput. Syst., 10 (1994), pp. 429–439.\n\n M06\nS. Manservisi, Numerical analysis of Vanka-type solvers for steady Stokes and Navier–Stokes flows,  SIAM. J. Numer. Anal., 44 (2006), pp. 2025–2056.\n\nM01\nG. Matthies, Mapped finite elements on hexahedra. Necessary and sufficient conditions for optimal interpolation errors, Numer. Algor., 27 (2001), pp. 317–327.\n\nMT02\nG. Matthies, L. Tobiska, The inf-sup condition for the mapped ℚ_k^d/P_k-1^ element in arbitrary space dimensions, Computing, 69 (2002), pp. 119–139. \n\t\t\nMW12\nA. Mikelić, M. F. Wheeler, Theory of the dynamic Biot–Allard equations and their link to the quasi-static Biot system, J. Math. Phys., 53 (2012), 123702:1–15.\n\nN71\nJ. Nitsche, Über ein Variationsprinzip zur Lösung von Dirichlet Problemen bei Verwendung von Teilräumen, die keinen Randbedingungen unterworfen sind (in German),  Abh. Math. Sem. Univ. Hamburg, 36 (1971), pp. 9–15.\n\nPW07\nP. J. Philips, M. F. Wheeler, A coupling of mixed and continuous Galerkin finite \n\telement methods for poroelasticity I, II, Comput. Geosci., 11 (2007), \n131–158.\n\nPW08\nP. J. Philips, M. F. Wheeler, A coupling of mixed and discontinuous Galerkin \n\tfinite \n\telement methods for poroelasticity , Comput. Geosci., 12 \n(2008), 417–435.\n\nRHOAGZ17\nC. Rodrigo, X. Hu, P. Ohm, J. H. Adler, F. J. Gaspar, L. T. Zikatanov, New stabilized discretizations for poroelasticity and the Stokes' equations, Comput. Methods Appl. Mech. Engrg., 341 (2018), pp. 467–484.\n\nR17\nU. Rüde, Algorithmic Efficiency and the Energy Wall, 2017. DOI: 10.13140/RG.2.2.33914.18881.\n\nSTW22\nC. Seifert, S. Trostorff, M. Waurick, Evolutionary Equations: Picard's Theorem for Partial Differential Equations, and Applications, Birkhäuser, Cham, 2022.\n\nS03\nY. Saad, Iterative Methods for Sparse Linear Systems. 2nd edition. SIAM, Philadelphia, 2003.\n\nS00\nR. Showalter, Diffusion in poro-elastic media, J. Math. Anal. Appl.,  251 (2000), pp. 310–340.\n\nS89\nM. Slodička, Application of Rothe's method to integrodifferential equation, Comment. Math. Univ. Carolinae, 30 (1989), pp. 57–70.\n\nS23\nSlurm Workload Manager, Version 22.05, <https://github.com/SchedMD/slurm/tree/master/src/plugins/acct_gather_energy/rapl>, 2023. \n\n\nSZ22\nO. Steinbach, M. Zank, A generalized inf–sup stable variational formulation for the wave equation, J. Math. Anal. Appl.,  505 (2022), 125457. \n\nT06\nV. Thomeé, Galerkin Finite Element Methods for Parabolic Problems, Springer, Berlin, 2006.\n\nTOS01\nU. Trottenberg, C. W. Oosterlee, A. Schüller, Multigrid, Academic Press, San Diego, CA, 2001.\n\nT99\nS. Turek, Efficient Solvers for Incompressible Flow Problems, Springer,  Berlin, 1999.\n\nTBK06\nS. Turek, C. Becker, D. Kilian, Hardware-oriented numerics and concepts for PDE software, Future Generation Computer Systems, 22 (2006), pp. 217–238.\n\t\nTGBBW10\nS. Turek, D. Göddecke, C. Becker, S. Buijssen, H. Wobker, FEAST — realisation of hardware-oriented numerics for HPC simulations with finite elements, Concurrency and Computation: Practice and Experience 6\n(May), pp. 2247–2265. Special Issue Proceedings of ISC 2008, doi:10.1002/cpe.1584.\n\t\nV86\nS. Vanka, Block-implicit multigrid solution of Navier-–Stokes equations in primitive variables,\nJ. Comput. Phys., 65 (1986), pp. 138–158.\n\nWS00\nD. C. Wirtz, N. Schiffers, T. Pandorf, K. Rademacher, D. Weichert, R. Forst, Critical evaluation of known bone material properties to realize anisotropic FE-simulation of the proximal femur,\nJ. Biomech., 33 (2000), pp. 1325–1330.\n\n\n\n\n\n\n\n\n§ APPENDIX\n\n\n\n§ DISCRETE COERCIVITY\n\n\n\nHere, we prove the discrete coercivity of the bilinear form A_γ defined in (<ref>) along with (<ref>). For this we introduce the mesh- and parameter-dependent norm\n\n    v⃗_h _h,γ_a := (ε(v⃗_h) ^2 + γ_a   h^-1v⃗_h _Γ^D_u⃗^2)^1/2 ,   for  v⃗_h ∈V⃗_h ,\n\nwith some parameter γ_a> 0. Its choice is addressed below. The norm property of (<ref>) is ensured by a variant of Korn's inequality; cf. <cit.>. We recall the well-known inverse inequality (cf. <cit.>)\n\n    ε⃗(v⃗_h) n⃗_Γ^D_u⃗≤ c h^-1/2ε⃗(v⃗_h)  ,   for  v⃗_h ∈V⃗_h .\n\nFrom (<ref>) along with (<ref>), it follows by the positive definiteness (<ref>) of C⃗, the inequality of Cauchy–Young with a sufficiently small constant δ >0 and the trace inequality (<ref>) that, for all v⃗_h ∈V⃗_h, \n\n    A_γ( v⃗_h, v⃗_h)     = ⟨C⃗ε⃗(v⃗_h),ε⃗(v⃗_h)⟩ - ⟨C⃗ε⃗(v⃗_h) n⃗, v⃗_h⟩_Γ^D_u⃗ - ⟨v⃗_h, C⃗ε⃗(v⃗_h) n⃗⟩_Γ^D_u⃗  + γ_a  h^-1⟨v⃗_h, v⃗_h ⟩_Γ^D_u⃗\n       ≥ c ε⃗(v⃗_h) ^2 - c ε⃗(v⃗_h) n⃗_Γ^D_u⃗v⃗_h_Γ^D_u⃗+ γ_a  h^-1v⃗_h ^2_Γ^D_u⃗\n       ≥ c ε⃗(v⃗_h) ^2  - c δ  h ε⃗(v⃗_h) n⃗^2_Γ^D_u⃗  - c δ^-1 h^-1v⃗_h^2_Γ^D_u⃗ + γ_a  h^-1v⃗_h ^2_Γ^D_u⃗\n       ≥ c ε⃗(v⃗_h) ^2  - c δε⃗(v⃗_h) ^2 - c δ^-1 h^-1v⃗_h^2_Γ^D_u⃗ + γ_a  h^-1v⃗_h ^2_Γ^D_u⃗\n        = c( ε⃗(v⃗_h) ^2 + γ_a  h^-1v⃗_h ^2_Γ^D_u⃗) ,\n\t\nwith some constant γ_a >0 for a sufficiently large choice of the algorithmic parameter γ_a in (<ref>), such that γ_a :=γ_a -cδ^-1>0. Thus, there holds for some constant c>0 that \n\n    A_γ( v⃗_h, v⃗_h) ≥ c v⃗_h _h,γ_a ,   for all  v⃗_h ∈V⃗_h .\n\n\nSecondly, we prove the discrete coercivity of the bilinear form B_γ defined in (<ref>) along with (<ref>). For brevity, we study the case Q_h= Q_h^l,cont only, such that Q_h⊂ H^1(Ω) is satisfied. The case Q_h= Q_h^l,disc can be captured similarly. We introduce the mesh- and parameter-dependent norm\n\n    q_h _h,γ_b := (∇ q_h ^2 + γ_b   h^-1 q_h _Γ^D_p^2)^1/2 ,   for   q_h ∈ Q_h⊂ H^1(Ω) ,\n\nwith some parameter γ_b> 0, where Q_h=Q_h^l,cont; cf. (<ref>). Further, we recall the well-known inverse inequality\n\n    ∇ q_h ·n⃗_Γ^D_p≤ c h^-1/2∇ q_h  ,   for   q_h ∈ Q_h .\n\nFrom (<ref>) along with (<ref>), it follows by the positive definiteness (<ref>) of K⃗, the inequality of Cauchy–Young with a sufficiently small constant δ >0 and the trace inequality (<ref>) that, for all q_h ∈ Q_h, \n\n    B_γ( q_h, q_h)     = ⟨K⃗∇ q_h ,∇ q_h ⟩ - ⟨K⃗∇⃗q_h ·n⃗, q_h⟩_Γ^D_p - ⟨ q_h, K⃗∇ q_h ·n⃗⟩_Γ^D_p  + γ_b  h^-1⟨ q_h, q_h ⟩_Γ^D_p\n       ≥ c ∇ q_h) ^2 - c ∇ q_h ·n⃗_Γ^D_p q_h_Γ^D_p+ γ_b  h^-1 q_h ^2_Γ^D_p\n       ≥ c ∇ q_h ^2  - c δ  h ∇ q_h ·n⃗^2_Γ^D_p  - c δ^-1 h^-1 q_h^2_Γ^D_p + γ_b  h^-1 q_h ^2_Γ^D_p\n       ≥ c ∇ q_h ^2  - c δ∇ q_h ^2 - c δ^-1 h^-1v⃗_h^2_Γ^D_p + γ_b  h^-1 q_h ^2_Γ^D_p\n        = c( ∇ q_h ^2 + γ_b  h^-1 q_h ^2_Γ^D_p) ,\n\t\nwith some constant γ_b >0 for a sufficiently large choice of the algorithmic parameter γ_b in (<ref>), such that γ_b :=γ_a -cδ^-1>0. Thus, there holds for some constant c>0 that \n\n    B_γ( q_h, q_h) ≥ c  q_h _h,γ_b ,   for all   q_h ∈ Q_h .\n\n\n\n\n§ ALTERNATIVE  FORMULATION OF THE FULLY DISCRETE PROBLEM\n\n\n\nHere, we present an alternative formulation for the fully discrete system to (<ref>). The difference to Problem <ref> comes through using ∂_t u⃗_τ,h instead of v⃗_τ,h in (<ref>) by means of (<ref>) and (<ref>), respectively. However, this modification requires the inclusion of an additional boundary integral in the resulting equation (<ref>). This non-obvious adaptation results from the proof of well-posedness of the discrete problem. The following problem is thus considered. \n\n[Numerically integrated I_n-problem with ∂_t u⃗_τ,h]\n\t\n\tFor given u⃗_h^n-1:= u⃗_τ,h(t_n-1)∈V⃗_h, v⃗_h^n-1:= v⃗_τ,h(t_n-1)∈V⃗_h,  and p_h^n-1:= p_τ,h(t_n-1) ∈ Q_h with  u⃗_τ,h(t_0) :=u⃗_0,h, v⃗_τ,h(t_0) :=u⃗_1,h and p_τ,h(t_0) := p_0,h, find (u⃗_τ,h,v⃗_τ,h,p_τ,h) ∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h) such that\n\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t   \n\t\t\t\t   Q_n (⟨∂_t u⃗_τ,h , ϕ⃗_τ,h ⟩- ⟨v⃗_τ,h , ϕ⃗_τ,h ⟩) + ⟨u⃗^+_τ,h(t_n-1), ϕ⃗_τ,h^+(t_n-1)⟩=  ⟨u⃗_h^n-1, ϕ⃗_τ,h^+(t_n-1)⟩ ,\n\n\t\t\t\n\n\t\t\t\n\t\t\t   \n\t\t\t\t    Q_n (⟨ρ∂_t v⃗_τ,h , χ⃗_τ,h ⟩+ A_γ(u⃗_τ,h, χ⃗_τ,h ) + C(χ⃗_τ,h,p_τ,h)) + ⟨ρv⃗^+_τ,h(t_n-1), χ⃗_τ,h^+(t_n-1)⟩\n\n\t\t\t\t        = Q_n (F_γ(χ⃗_τ,h)) + ⟨ρv⃗_h^n-1, χ⃗_τ,h^+(t_n-1)⟩ ,\n\t\t\t\n\n\t\t\t\n\t\t\t   \n\t\t\t\t   Q_n (⟨c_0 ∂_t p_τ,h,ψ_τ,h ⟩- C(∂_t u⃗_τ,h,ψ_τ,h)+ B_γ(p_τ,h, ψ_τ,h))\n\n\t\t\t\t          + ⟨c_0 p^+_τ,h(t_n-1) +α∇·u⃗^+_τ,h(t_n-1),  ψ_τ,h^+(t_n-1)⟩- α⟨u⃗^+_τ,h(t_n-1) ·n⃗ ,ψ_τ,h^+(t_n-1) ⟩_Γ^D_u⃗ \n \n\t\t\t\t        = Q_n ( G_γ(ψ_τ,h)) + ⟨c_0 p_h^n-1 + α∇·u⃗_h^n-1, ψ_τ,h^+(t_n-1)⟩- α⟨u⃗_D(t_n-1) ·n⃗ ,ψ_τ,h^+(t_n-1) ⟩_Γ^D_u⃗ \n\t\t\t\n\t\t\n\t\n\tfor all (ϕ⃗_τ,h,χ⃗_τ,h,ψ_τ,h)∈ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;V⃗_h) ×ℙ_k (I_n;Q_h).\n\n\n\n\t\n\tProblem <ref> admits a unique solution.\n\n\n\nThe proof follows basically the lines of the proof of Lem. <ref> and is kept short. Only differences to Lem. <ref> are depicted. For the differences (u⃗_τ,h,v⃗_τ,h,p_τ,h) of two triples satisfying (<ref>) and the test functions ϕ⃗_τ,h= A_γu⃗_τ,h, χ⃗_τ,h=v⃗_τ,h and ψ_˝τ,h=p_τ there holds that \n\n    1/2∫_t_n-1^t_nd/dt( A_γ (u⃗_τ,h , u⃗_τ,h) + ⟨ρv⃗_τ,h , v⃗_τ,h⟩  + ⟨ c_0 p_τ,h, p_τ,h⟩ )  t + Q_n(B_γ(p_τ,h,p_τ,h) )  \n              + Q_n(C_γ (v⃗_τ,h - ∂_t u⃗_τ,h,p_τ,h) ) + α⟨∇·u⃗^+_τ,h(t_n-1),  p_τ,h^+(t_n-1)⟩ - α⟨u⃗^+_τ,h(t_n-1) ·n⃗ ,p_τ,h^+(t_n-1) ⟩_Γ^D_u⃗\n          + A_γ (u⃗^+_τ,h(t_n-1), u_τ,h^+(t_n-1))  + ⟨ρv⃗^+_τ,h(t_n-1),  χ_τ,h^+(t_n-1)⟩ + ⟨ c_0 p^+_τ,h(t_n-1), p_τ,h^+(t_n-1)⟩  = 0  .\n\nNow, let l∈{1,…,k+1} be arbitrary but fixed and ϕ⃗_τ,h∈ℙ_k(I_n;V⃗_h) be chosen as  \n\n    ϕ⃗_τ,h(t) := ξ_n,l(t) ϕ⃗_h   with  ξ_n,l(t) := (∏_i=1  i ≠ l^k+1(t-t_n,i^GR)) (∏_i=1  i ≠ l^k+1(t_n,l^GR -t_n,i^GR))^-1∈ℙ_k(I_n;) ,   ϕ⃗_h ∈V⃗_h ,\n\nand the Gauss–Radau quadrature nodes t_n,μ^GR, for μ = 1,… , k+1; cf. (<ref>). By the exactness of the Gauss–Radau quadrature formula (<ref>) for all polynomials in ℙ_2k(I_n;) we deduce from (<ref>) that\n\n    0     = τ_n/2∑_μ=1^k+1ω̂_μ^GR(⟨∂_t u⃗_τ,h(t_n,μ^GR), ϕ⃗_τ,h(t_n,μ^GR)  ⟩ - ⟨v⃗_τ,h(t_n,μ^GR), ϕ⃗_τ,h(t_n,μ^GR) ⟩) + ⟨u⃗^+_τ,h(t_n-1), ϕ⃗_τ,h^+(t_n-1)⟩\n        = τ_n/2ω̂_l^GR⟨∂_t u⃗_τ,h(t_n,l^GR) - v⃗_τ,h(t_n,l^GR), ϕ⃗_h ⟩ + ⟨u⃗^+_τ,h(t_n-1),  ξ^+_n,l(t_n-1) ϕ⃗_h ⟩ .\n\nThus, we have that (l=1,…, k+1)\n\n    v⃗_τ,h(t_n,l^GR) - ∂_t u⃗_τ,h(t_n,l^GR)  = c_n,l u⃗^+_τ,h(t_n-1)  with   c_n,l = 2 τ_n^-1 (ω̂_l^GR)^-1 ξ^+_n,l(t_n-1) .\n\nSubstituting (<ref>) into the third term on the left-hand side of (<ref>), we get that \n\n    Q_n(C_γ (v⃗_τ,h - ∂_t u⃗_τ,h,p_τ,h) )     = ∑_μ=1^k+1  C_γ (u⃗_τ_h^+(t_n-1),ξ^+_n,μ(t_n-1) p_τ,h(t_n,μ^GR) ) = C_γ (u⃗_τ_h^+(t_n-1), p_τ,h^+(t_n-1))\n        = - α⟨∇·u⃗_τ_h^+(t_n-1), p_τ,h^+(t_n-1)⟩ + α⟨u⃗_τ_h^+(t_n-1) ·n⃗ ,  p_τ,h^+(t_n-1) ⟩_Γ^D_u⃗ .\n\nCombining (<ref>) with (<ref>) then implies that \n\n    A_γ (u⃗_τ,h(t_n) , u⃗_τ,h(t_n))  + ⟨ρv⃗_τ,h (t_n), v⃗_τ,h(t_n)  ⟩  + ⟨ c_0 p_τ,h(t_n), p_τ,h(t_n)⟩ +  2 Q_n (B_γ(p_τ,h,p_τ,h) ) \n          + A_γ(u⃗^+_τ,h(t_n-1), u⃗_τ,h^+(t_n-1))  + ⟨ρv⃗^+_τ,h(t_n-1),  χ_τ,h^+(t_n-1)⟩ + ⟨ c_0 p^+_τ,h(t_n-1), p_τ,h^+(t_n-1)⟩  = 0  .\n\nFrom (<ref>) along with the discrete coercivity properties (<ref>) and (<ref>) we deduce that \n\t\n    u⃗_τ,h(t_n)= u⃗_τ,h^+(t_n-1)=0⃗ ,   v⃗_τ,h(t_n)= v⃗_τ,h^+(t_n-1)=0⃗  and   p_τ,h(t_n)=p_τ,h^+(t_n-1)= 0\n\nas well as \n\n    p_τ,h(t_n,μ^GR) = 0  ,   for  μ = 1,…, k+1 .\n\nThe rest then follows as in the proof of Lem. <ref>.\t\n\n\n\n\n\n§ ADDITIONAL NUMERICAL EXPERIMENTS\n\n\n\nHere, we present some additional results of our numerical experiments. Table <ref> shows the results of the convergence study introduced in Subsec. <ref> for the solution (<ref>) of (<ref>). For the computations of Table <ref> the Taylor-Hood pair of finite element spaces ℚ_r^2/ℚ_r-1, with r=4, is used instead of the pair ℚ_r^2/ℙ_r-1^disc chosen for the results of Table <ref>. For the pressure approximation marginally smaller errors are observed. In Table <ref> the computed errors of the approximation of (<ref>) for larger values of the Lamé parameters λ and μ in the elasticity tensor C⃗ are summarized. No significant increase of the errors is observed, indicating the independence of the error constant on the magnitude of C⃗.\n\n\t\n\n\n\n\n"}