{"entry_id": "http://arxiv.org/abs/2303.06741v1", "published": "20230312200234", "title": "Hierarchical Adaptive Control for Collaborative Manipulation of a Rigid Object by Quadrupedal Robots", "authors": ["Mohsen Sombolestan", "Quan Nguyen"], "primary_category": "cs.RO", "categories": ["cs.RO"], "text": "\n\nAn energy-efficient GMRES–Multigrid solver for space-time finite element computation of dynamic poro- and thermoelasticity\n    \n\tMathias Anselmann^∗anselmann@hsu-hh.de (corresponding author) , Markus Bause^∗,  Nils Margenberg^∗, Pavel Shamko^∗\n\n\t^∗ Helmut Schmidt University, Faculty of Mechanical and Civil Engineering, Holstenhofweg 85,\n \n\t22043 Hamburg, Germany\n\n    \n==================================================================================================================================================================================================================================================\n\nempty\nempty\n\n\nDespite the potential benefits of collaborative robots, effective manipulation tasks with quadruped robots remain difficult to realize. In this paper, we propose a hierarchical control system that can handle real-world collaborative manipulation tasks, including uncertainties arising from object properties, shape, and terrain. Our approach consists of three levels of controllers. Firstly, an adaptive controller computes the required force and moment for object manipulation without prior knowledge of the object's properties and terrain. The computed force and moment are then optimally distributed between the team of quadruped robots using a Quadratic Programming (QP)-based controller. This QP-based controller optimizes each robot's contact point location with the object while satisfying constraints associated with robot-object contact. Finally, a decentralized loco-manipulation controller is designed for each robot to apply manipulation force while maintaining the robot's stability. We successfully validated our approach in a high-fidelity simulation environment where a team of quadruped robots manipulated an unknown object weighing up to 18 kg on different terrains while following the desired trajectory.\n\n\n\n\n\n\n\n§ INTRODUCTION\n \nLegged robots are known for their ability to move quickly and maneuver easily due to their versatile locomotion skills. The advancement of model predictive control (MPC) for legged robots <cit.> has facilitated the creation of real-time control systems that can execute diverse walking gaits.\nMost research on quadruped robots has concentrated on locomotion <cit.>, and loco-manipulation <cit.> by a single robot. The approaches are even extended to the problem with significant uncertainty in robot model <cit.> as well as manipulating an object with unknown property <cit.>. However, a limited number of works explore collaboration among multiple quadruped robots. In scenarios with multiple general-purpose robots available rather than specialized, larger robots, collaboration among several quadruped robots can prove highly advantageous. \nThe group of robots can work together to perform collaborative tasks beyond a single robot's capabilities, such as object manipulation in industrial factory locations and last-mile delivery operations.\n\nThe use of multiple quadruped robots for towing a load with cables towards a target while avoiding obstacles has been explored in <cit.>. However, in manipulation tasks, including the work mentioned above, the controller often necessitates prior knowledge of the manipulated object and terrain, such as the object's mass, geometry, and terrain friction coefficient.\nNonetheless, in many practical scenarios, the parameters of the manipulated object are generally unknown, especially if the object is non-geometric or asymmetric. Hence, the robot should be capable of adapting to a wide range of objects.\n\nAdaptive control has been employed in some prior research for collaborative manipulation in mobile robots without making assumptions about the object's mass. Both centralized controllers <cit.> and decentralized controllers <cit.> have been developed in this regard.\nHowever, these approaches rely on the rigid connection between the object and robots during the manipulation task, which is problematic in quadrupedal robots application. The rigid connection can impact the robots' stability and limit the team of the robots' initial configuration before starting the manipulation task.\nAdditionally, in some instances, the measurement of the manipulators' relative positions from the center of mass (COM) is required <cit.>. However, this assumption is impractical for non-geometric objects with an unknown COM location (see fig: schematic). \nOur approach allows the robots to begin in a random location and then engage in object manipulation. In addition, there are no assumptions regarding object properties such as mass, inertia, and COM location, as well as terrain properties such as friction coefficient.\n\n\n\n\n\n\n\n\n\n\n\nThis paper presents a hierarchical adaptive control for manipulating an unknown rigid object collaboratively using multiple quadruped robots.\nIn our previous work <cit.>, we introduced a unified MPC framework that utilized robot locomotion to manipulate an object effectively without sacrificing robot balance. However, that work was limited to one-direction object manipulation with a single robot. \nIn this paper, we aim to tackle the problem of planar collaborative manipulation of a heavy unknown object via multiple quadruped robots. \nOur proposed approach involves developing a controller that utilizes Quadratic Programming (QP) and is inspired by QP-based balancing control for quadruped robots <cit.>. This controller is integrated with an adaptive controller to compensate for the object uncertainties and can optimally distribute manipulation force among multiple robots while adjusting each robot's contact point location.\nThe contribution of this paper is as follows:\n\n    \n  * We introduced a novel hierarchical control framework composed of three levels of controllers to facilitate the cooperative manipulation of an unknown asymmetric object using quadruped robots (see fig: block_diagram).\n    \n    \n  * At the first level, we developed an adaptive controller that calculates the required force and moment for the object to follow the desired trajectory over time accurately. It should be noted that certain attributes of the object, such as mass, inertia, COM location, and frictional forces, are unknown.\n    \n    \n  * Next, we will propose a QP-based controller that will effectively allocate the manipulation force and moment among a group of quadruped robots while determining the optimal contact point for each robot. The QP controller is designed to meet the constraints related to the contact between the object and robots.\n    \n    \n  * In the last level, we utilize a decentralized loco-manipulation control for each robot that leverages the robot's locomotion to manipulate the object without losing the robot's stability.\n    \n    \n  * We validated the efficacy of our approach through high-fidelity simulations conducted on a team of Unitree A1 robots. We also compared our method and several baseline controllers to demonstrate the superiority of our framework. By employing our proposed approach, a team of robots can manipulate an unknown object weighing up to 18 kg across various terrains while accurately tracking the desired trajectory.\n    \n\n\nThe rest of the paper is structured as follows: a brief overview of the control system is presented in sec: overview. This is followed by a comprehensive explanation of our proposed method, which provides more details on the design of the three levels of our control system in sec: Method. Furthermore, numerical validation is demonstrated in sec: simulation. Finally, concluding remarks are provided in sec: conclusion.\n\n\n\n\n§ CONTROL SYSTEM OVERVIEW\n \n\nOur hierarchical proposed approach is illustrated in fig: block_diagram. The control system has three levels according to fig: block_diagram. We briefly introduce each level in this section, then in sec: Method, we will discuss each part in more detail.\n\nThe first level of our approach involves designing an adaptive control system that enables the manipulated object to follow a desired trajectory. The object may have an asymmetric shape and unknown properties, and measurements of its state (such as position and velocity) will be taken relative to an arbitrary reference point, which need not be the COM. We assume that the object's mass, moment of inertia, and COM location are all unknown, as is the magnitude and direction of any external wrench (such as friction force) acting on the object. Using the adaptive controller, the control system can adapt to estimates of the object's properties.\n\nNext, the force and moment values calculated by the adaptive control must be appropriately distributed among the robots. We developed a QP-based controller for this purpose, which enables each robot to apply an optimal force while adjusting its contact point location with respect to the object. fig: schematic illustrates a schematic of multiple quadruped robots collaborating to manipulate an object. The robots are not rigidly attached to the object; they can only push the object in one direction while adjusting their position with respect to the object (as represented by d_i). The force direction of each robot (n̂_r,i) is treated as a constraint in the QP formulation. \n\nLastly, a decentralized loco-manipulation control is created for each robot, considering the distributed force. The loco-manipulation controller consists of a unified MPC that incorporates both the locomotion controller for quadruped robots and the desired distributed manipulation force for each robot. This level serves as the critical control component for each robot and should run at a frequency of 150 Hz to ensure robust locomotion. In contrast, the higher-level parts of the control system need not be updated as frequently as the loco-manipulation controller. As such, the QP-based and adaptive controllers are run at a lower frequency of 100 Hz to free up sufficient processing units for the loco-manipulation control.\n\n\n\n§ PROPOSED METHOD\n \nThis section will elaborate on our hierarchical adaptive control for collaborative manipulation of an unknown asymmetric object using multiple quadruped robots. The object undergoes translational and rotational motion, led by a team of n robots. A collaborative manipulation task is illustrated in fig: schematic. First, we define our problem and the assumption that we will make to solve the problem, then we will introduce each level of our proposed approach illustrated in fig: block_diagram, separately. \n\n\n\n §.§ Problem Definition\n\nThere exists a world frame W and a body frame B attached to the object's center of mass (COM). There is a body-fixed point p, which is the reference point for all the object's measurements and can be picked arbitrarily. As we indicated before, the properties of the object, such as mass (m_b), body-frame inertia about COM (I_G), and COM position (r_p) are unknown. Each robot starts at an initial point r_i,0 from p on the object surface, and they have their own position estimation r_i. The robots can freely move along the object's surface, which means they are not rigidly connected to the object. Additionally, we assume that the friction between the robot and the object at the contact point is negligible. Therefore, each robot can only apply perpendicular force f_r,i to the object's surface (along n̂_r,i) while moving d_i tangential to the object surface (along t̂_r,i). Note that all vectors defined in fig: schematic such as f_r,i, r_i,0, r_p, n̂_r,i, and t̂_r,i are represented in the body-frame B.\n\nBased on the above problem definition and assumptions made, we will describe the three levels of our control system shown in fig: block_diagram in the following subsections.\n\n\n\n §.§ Adaptive Control for Object Manipulation\n\n\n\n  §.§.§ Equation of motion for a rigid object\n\nThe equation motion of a rigid body object can be written as follow:\n\n    F = m_b ẍ_G\n    \n       M_G = RI_G R^T ω̇ + ω× (RI_G R^T ω)\n\nwhere R is the rotation matrix from body frame B to the world frame W, ω is the angular velocity of the object, and ω̇ is the angular acceleration. Since, in our problem, the COM position is unknown, we should derive the equation of motion of the rigid object with respect to the reference point p:\n\n    F = m_b ẍ_p - m_b(ω̇×Rr_p) - m_b ω× (ω×Rr_p) \n    \n       M_p = RI_p R^T ω̇ + ω× (RI_p R^T ω) - m Rr_p ×ẍ_p\n\n where F and M_p are the force and moment required for object manipulation, respectively, ẍ_p is the object acceleration at point p, and I_p is the object's moment of inertia with respect to p.\n\n\n\n\n\n\n\n\n\n\n\n\nConsidering that the object is on the ground and will be manipulated within planar coordinates, we can limit our focus to the planar aspect of the equation of motion. To achieve this, we define the configuration variable q = [x_p, θ], where θ represents the object's yaw angle, and we also take into account an external wrench f_k. We can then express the equation of motion in a compact form as follows:\n \n    τ = H(q)q̈ + C(q, q̇)q̇  + f_k\n\nwhere τ is the wrench applied to the rigid object from a team of robots. By defining r_p = [r_x;r_y] and I_p,zz as the moment of inertia about the normal direction to the ground, H(q) and C(q, q̇) can be represented as follow:\n\n    H(q) = m_b R[[          1          0        r_y;          0          1       -r_x;        r_y       -r_x I_p,zz/m_b ]] R^T\n    \n       C(q, q̇)q̇ = m_b ω^2 R[[ r_x; r_y;   0 ]]\n\n\n\n\n  §.§.§ Adaptive Control\n \nIn the adaptive control for manipulators <cit.>, it is common to use a linear combination of position and velocity error, denoted as s. This approach results in exponentially stable dynamics when the surface s=0 is reached. Hence, we define the composite error as follows:\n\n    s = [[ ẋ_e + λx_e; ω_e + λθ_e ]]\n\nwhere x_e, ẋ_e, θ_e, and ω_e represented the tracking error for x_p, ẋ_p, θ, and ω, respectively. Then we define the reference velocity as follows:\n\n    q̇_r = q̇ - s\n\n\nThe unknown physical parameter, such as m_b, I_p,zz, and r_p, appear linearly in the equation of motion. Thus, we can decompose the equation of motion into a known regressor matrix Y_Θ and vector of unknown parameter Θ.\n\n    Hq̈_r + Cq̇_r = Y_ΘΘ\n\nWe can exploit the same property for the unknown external wrench as well and define that in terms of known regressor matrix Y_Ψ and vector of an unknown parameter Ψ.\n\n    f_k = Y_ΨΨ\n\n\nNow, we propose the control and adaption laws required to be applied to the object to track the desired trajectory asymptotically. The control law would be:\n\n    τ = [[   F; M_p ]] = Y_ΘΘ̂ + Y_ΨΨ̂ - K_D s\n\nwhere Θ̂ and Ψ̂ are estimated vector of unknown parameters and K_D is a positive definite matrix. The first two terms in control law (<ref>) are related to the dynamic estimation, and the last term is a PD term which leads the object to follow the desired trajectory. Moreover, adaptation laws are proposed as follows:\n\n    Θ̇̂̇ = -Γ_ΘY_Θ^T s\n    Ψ̇̂̇ = -Γ_ΨY_Ψ^T s\n\nwhich Γ_Θ and Γ_Ψ are positive definite matrices. In sec: stability, we will provide a detailed explanation of the design of the control law (<ref>) and adaptation laws (<ref>), (<ref>), as well as the stability proof.\n\n\n\n\n\n  §.§.§ Stability Proof\n \nLet us consider the following Lyapunov function:\n\n    V(t) = 1/2(s^T Hs + Θ̃^TΓ_Θ^-1Θ̃ + Ψ̃^TΓ_Ψ^-1Ψ̃ )\n\nwhere Θ̃ = Θ̂ - Θ and Ψ̃ = Ψ̂ - Ψ are vectors of estimation error. Note that according to the definition of H in (<ref>), H is a positive definite matrix.\nSince Θ and Ψ are constant vectors, the estimation error derivative Θ̇̃̇, Ψ̇̃̇ are the same as the estimation derivative Θ̇̂̇, Ψ̇̂̇. By considering this property, we will take the derivative of V(t): \n\n    V̇(t) = s^T Hṡ + 1/2s^T Ḣs + Θ̃^TΓ_Θ^-1Θ̇̂̇ + Ψ̃^TΓ_Ψ^-1Ψ̇̂̇.\n\nAccording to the definition of reference velocity in (<ref>), we know q̇ = s + q̇_r and ṡ= q̈ - q̈_r. Therefore, by considering the equation of motion (<ref>), the first term in equation (<ref>) can be expanded as follows:\n\n    s^T Hṡ   = s^T H (q̈ - q̈_r) \n       = -s^T Cs + s^T[τ - (Hq̈_r + Cq̇_r) - f_k ]\n\nBy using the property described in (<ref>) and (<ref>), we substitute the (<ref>) into (<ref>), then we have:\n\n    V̇(t) =  s^T[τ - Y_ΘΘ - Y_ΨΨ] + 1/2s^T (Ḣ-2C) s + \n    Θ̃^TΓ_Θ^-1Θ̇̂̇ + Ψ̃^TΓ_Ψ^-1Ψ̇̂̇.\n\nThe Ḣ-2C is a skew-symmetric matrix <cit.>, so the second term in (<ref>) is zero. Finally, substituting the control law (<ref>) and adaptation laws (<ref>), (<ref>) into equation (<ref>) yields:\n\n    V̇(t)     =  - s^T K_D s≤ 0.\n\nAccording to the Lyapunov theorem <cit.>, the system is uniformly stable because V(t) is positive definite and decrescent, and V̇(t) is negative semi-definite. As a result, the variables s, Θ̃, and Ψ̃ will remain bounded.\n\nThe expression in (<ref>) indicates that V(t) has a finite limit, and it can be easily demonstrated that ṡ is bounded <cit.>. As a result, V̈(t) is bounded, as can be observed from the expression V̈(t) = -2 s^T K_D ṡ. Since V̈(t) is bounded, and V̇(t) is uniformly continuous in time, and V(t) is lower bounded, the second version of Barbalat's Lemma <cit.> implies that V̇(t) → 0 as t →∞. Therefore, s also approaches zero as t →∞. When s = 0, it can be shown that ẋ_e = - λx_e and ω_e = - λθ_e, which corresponds to an asymptotically stable system.\n\n\n\n §.§ QP-based Control for Force Distribution\n \nThe adaptive control presented in sec: adaptive control calculates the force F and moment M_p required for object manipulation that the object's pose q track the desired pose q_d. Since our approach, in general, is not limited to a specific number of robots, we need an optimal framework to distribute the manipulation force into each robot. Importantly, each agent has a constraint on the direction of the force that it can apply. Each robot starts from a random initial position r_i,0 with respect to point p (see fig: schematic). \nThen, the robot can only apply force perpendicular to the object's surface (along n̂_r,i) while moving d_i tangential to the object's surface (along t̂_r,i) within a specific range on the object that allows the robot to navigate. To this end, we developed the following QP formulation to compute the optimal control input for each robot while satisfying constraints:\n\n    [[ F_r^*;   d^* ]]=  F_r ,d∈ℝ^nargmin     γ_1 F_r ^2 + γ_2 F_r - F_r,prev^* ^2 \n        +γ_3 d - d_prev^* ^2 \n           (1): ∑_i = 1 ^nf_r,i = RF\n           (2): ∑_i = 1 ^nr_i ×f_r,i = M_p   \n           (3):  F_r,i = \n    ≥ 0    active\n    \n        0         otherwise\n           (4): d≤d≤d̅\n           \n       f_r,i = F_r,in̂_r,i\n       r_i = r_i,0 + d_i t̂_r,i\n\nwhere F_r is the vector of agents force magnitude (F_r = [F_r,1, F_r,2, … , F_r,n]^T ∈ℝ^n) and d is the vector of agents position on the object's surface (d = [d_1, d_2, … , d_n]^T ∈ℝ^n). \nThe cost function contains three terms to minimize the force magnitude F_r as well as the change of the current solution with respect to the solution from the previous time-step for both force magnitude F_r and distance d. \n\nThe first two constraints are regarding achieving the desired manipulation force computed with adaptive control using our team of robots. Note that the calculated force F is represented in the fixed world frame W. Since all the agents' forces f_r,i are described in the object body frame B, we transform the manipulation force vector into the object body frame using rotation matrix R. This fact does not affect the M_p since, for a planar problem, we only have a moment about the direction normal to the ground, and M_p is scalar. The third constraint is associated with agents' force. Since each active agent can only push the object forward, the force magnitude is always positive. If the robot is not in contact with the object, no force will be distributed to that robot. Finally, the last constraint ensures the robot will not exceed the surface limitation.\n\n\n\n §.§ Decentralized Loco-manipulation Control via Unified MPC\n\nThis subsection will introduce a decentralized loco-manipulation control for each agent. We previously developed a unified MPC that considers both locomotion and manipulation for robots <cit.>. The unified MPC regulates the manipulation force achieved in sec: QP while maintaining the robot balance. First, we write the robot's equation of motion with the manipulation force based on the state representation presented in <cit.>:\n\n    Ẋ_i = D_i X_i + G_i F_l,i + f_r,i^w / m_i\n\nwhere f_r,i^w is the force vector f_r,i represented in the world frame W, m_i is the robot mass, F_l,i is the vector of ground reaction forces for all the legs, and X_i contains the robot's body's COM location, Euler angle, and velocities. More details on the equation as well as the definition of D and G can be found in <cit.>. Note that the i ∈{1, …, n} represents the agent index number.\n\nMPC employs linear discrete-time dynamics to predict the system's behavior over a finite time horizon. However, using a traditional discretization technique like zero-order hold requires incorporating the manipulation term f_r,i^w from equation (<ref>) into the state vector to create an extended vector for MPC formulation. As a result, equation (<ref>) can be rewritten as:\n\n    η̇_i = D̅_i η_i + G̅_i F_l,i\n\nwhere \n\n    η_i = [[          X_i; f_r,i^w /m_i ]] ∈ℝ^15\n       D̅_i = [[           D_i∈ℝ^13 × 13 0_6 × 2\n    I_2 × 2\n    0_5 × 2;                0_2 × 13                 0_2 × 2 ]] ∈ℝ^15 × 15\n       G̅_i = [[      G_i; 0_2 × 12 ]] ∈ℝ^15 × 12\n\nwhere η_i is the augmented vector. Therefore, a linear MPC can be designed as follows:\n\n    min_F_l,i     ∑_j=0^k-1X̃_i,j+1^T QX̃_i,j+1 + F_l,i,j^T P_i,jF_l,i,j\n    s.t.     X̃_i,j+1 = X_i,j+1 - X_d,i,j+1\n       η_i,j+1 = D̅_t,jη_j + G̅_t,jF_l,i,j\n       c_f ≤C_f F_l,i,j≤c̅_f\n\nwhere k is the number of horizons, X_d,i,j is the robot desired state at time step j, Q and P are diagonal positive semi-definite matrices, D̅_t,j and G̅_t,j are discrete-time system dynamics matrices, and c_f ≤C_f F_l,i,j≤c̅_f represents friction cone constraints defined in <cit.>. Note that the computed d_i from the QP-based controller affects the robot's desired state X_d,i,j.\n\n\n§ NUMERICAL SIMULATION\n \nThe purpose of this section is to demonstrate the effectiveness of our proposed approach through numerical simulations. Our simulations were conducted in a high-fidelity environment called Gazebo 11, with controllers implemented in ROS Noetic. The simulations involved a team of Unitree A1 robots attempting to manipulate an unknown asymmetric object to track its desired pose q_d despite uncertainty in both the object and terrain. We carried out multiple simulations with varying scenarios to demonstrate the team's adaptability. More details of our conducted simulations are shown in the supplemental video[<https://youtu.be/cHofdxolZk4>].\n\n\n\n §.§ Comparative Analysis\n\nWe conducted comparative simulations to assess the efficacy of our proposed method. Specifically, we focused on evaluating the impact of the first two levels of controllers in our control system. During each phase of the evaluation, we analyzed the performance of the control system both with and without adaptive control and QP-based control.\n\n\n\n\n\n  §.§.§ Effect of Adaptive Control\n\nWe compared our proposed approach and an alternative one that utilizes a PD controller at the first level instead of the adaptive controller. During the simulation, a team of robots manipulates an unknown asymmetric object weighing 5 kg, and three unknown objects weighing 2 kg each are randomly dropped onto the main object. The result for adaptive and non-adaptive methods are compared in fig: compare_adaptive.\n\nUsing our proposed controller, the object successfully tracks the desired trajectory with minimal error and arrives at the target position with the intended orientation. However, the non-adaptive method fails to reach the target position within the specified time. It should be noted that the yaw tracking for both methods is almost the same (as seen in subfig: adaptive_yaw), indicating that the team of robots can adjust the object's orientation using non-adaptive control, but they are unable to apply enough force for position tracking.\n\n  \n\n\n\n\n\n  §.§.§ Effect of QP-based Control\n\nWe proceeded to investigate the effectiveness of the QP-based controller in our proposed method. To highlight the advantages of this controller, we utilized a heuristic approach to adjust the contact location d_i based on the object's yaw angle error:\n\n    d_i = k_p^d (θ_d - θ)\n\nWe compared the performance of our method with the heuristic approach. The scenario involved a team of two robots attempting to manipulate an object in a straight line while adjusting its yaw angle. The comparison results are displayed in fig: compare_QP.\n\nAs depicted in fig: compare_QP, our proposed method, with the QP-based controller, can accurately track the desired trajectory. In contrast, when using the heuristic policy, One of the robots attempts to adjust its contact point to align with the desired yaw angle but exceeds the object surface limitation. During manipulation, the robot loses contact with the object (as shown in subfig: lose contact), leading to a significant deviation from the intended trajectory. \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Terrain Uncertainty\n\nOur next objective is to evaluate the robot's ability to adjust to terrain uncertainties. To achieve this, we will create a simulation where the team of robots moves through diverse terrains with varying friction properties on a desired curve trajectory while manipulating an unknown object weighing 5 kg. The robot will begin by navigating on a hardwood surface that has a friction coefficient of μ = 0.3. Subsequently, it will traverse a grassy field that has a friction coefficient of μ = 0.8. The results are presented in fig: various_friction. As depicted in fig: various_friction, the tracking error of the robot increases as it moves from hardwood ground to grass. During this transition, the object is partially on the grass, requiring more significant force for manipulation. However, the robot's feet are still on the hardwood ground, which has low friction, preventing the robot from exerting sufficient force for object manipulation.\n\n\n\n\n §.§ Collaborative Manipulation of a Heavy Load\n\nFirstly, we intended to demonstrate the adaptability of our control system, even in the middle of an operation, to any number of robots. Secondly, we want to exhibit the effectiveness of our approach in manipulating heavy objects, which is unfeasible for a single robot to accomplish. To initiate the task, we employ two quadruped robots to manipulate an unknown heavy object weighing 18 kg. As the tracking error began to increase, we introduced another robot to the team to improve the tracking performance. By including the third robot, the QP-based controller system could distribute forces to all three robots, allowing them to collaborate optimally during the manipulation task. Therefore, the load on the other two robots, which has already reached its threshold, was reduced. The team's performance during this simulation is depicted in fig: three_robot. Notably, the tracking error improved after the third robot joined the team, as indicated by the red dashed line.\n\n\n\n\n§ CONCLUSION\n \nIn summary, we propose a hierarchical adaptive control approach for the collaborative manipulation of a heavy, unknown object using a group of quadrupedal robots. The control framework comprises three levels. Firstly, an adaptive controller computes the manipulation force and moment. Secondly, a QP-based controller optimally distributes the force and moment among the robot team, as well as determines the optimal contact point for each robot. Finally, a decentralized loco-manipulation controller regulates the manipulation force of each robot while maintaining its stability. Our future work involves expanding the framework to a fully decentralized control system.\n\n\n\n\n\nIEEEtranS\n\n\n"}