{"entry_id": "http://arxiv.org/abs/2303.07328v1", "published": "20230313174802", "title": "Perturbations of Fefferman spaces over CR three-manifolds", "authors": ["Arman Taghavi-Chabert"], "primary_category": "math.DG", "categories": ["math.DG", "gr-qc", "math-ph", "math.CV", "math.MP", "Primary 53C18, 32V05, 53C50, 83C15, Secondary 32V10, 32V30, 53B30"], "text": "\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\tWe introduce a generalisation of Fefferman's conformal circle bundle over a contact Cauchy–Riemann three-manifold. These can be viewed as exact `perturbations' of Fefferman's structure by a semi-basic one-form, which encodes additional data on the CR three-manifold.\n\t\n\tWe find conditions on the Weyl tensor and the Bach tensor for a Lorentzian conformal four-manifold equipped with a twisting non-shearing congruence of null geodesics to be locally conformally isometric to such a perturbed Fefferman space.\n\t\n\tWe investigate the existence of metrics in the perturbed Fefferman conformal class satisfying appropriate sub-conditions of the Einstein equations, such as the so-called pure radiation equations. These metrics are defined only off cross-sections of Fefferman's circle bundle, and are conveniently expressed in terms of densities that generalise Gover's notion of almost Einstein scales. Our setup allows us to reduce the prescriptions on the Ricci tensor to the underlying CR three-manifold in terms of differential constraints on a complex density and the CR data of the perturbation one-form. One such constraint turns out to arise from a non-linear, or gauged, analogue of a second-order differential operator on densities. A solution thereof provides a criterion for the existence of a CR function and, under certain conditions, for the realisability of the CR three-manifold. These findings are consistent with previous works by Lewandowski, Nurowski, Tafel, Hill, and independently, by Mason.\n\t\n\tWe also provide an analysis of the Weyl curvature of such conformal structures in terms of the underlying CR data. In particular, we arrive at a CR formulation of the asymptotic Einstein condition by viewing conformal infinity as a cross-section of Fefferman's circle bundle.\n\t\n\t\n\t\n\t\n\tFaculty of Physics, University of Warsaw, ul. Pasteura 5, 02-093 Warszawa, Polandarman.taghavi-chabert@fuw.edu.pl\n\t\n\t\n\t[2020]Primary 53C18, 32V05, 53C50, 83C15; Secondary 32V10, 32V30, 53B30\n\t\n\t\n\tPerturbations of Fefferman spaces over CR three-manifolds\n    Arman Taghavi-Chabert\n    March 30, 2023 at \n=========================================================\n\n\n\n\n\t\n\t\n\n§ INTRODUCTION\n\n\tThis article is concerned with the interaction between Lorentzian conformal geometry and Cauchy–Riemann geometry, where the latter arises as the leaf space of a foliation by null geodesics on the former. This geometric setting can be found in two distinct and independent contexts. The first of these is the well-known construction due to Fefferman <cit.> that associates a non-degenerate or contact CR structure of hypersurface type to a conformal structure of Lorentzian signature on a canonical circle bundle. There are various approaches to the construction: in the original version, Fefferman shows how a conformal structure can be constructed from the standard Kähler structure on the complex space ^m+1 in which the CR hypersurface is embedded. Later formulations allow for the CR manifold (M,H,J) to be abstract, that is, not necessarily embeddable. Of particular relevance in this article is the construction due to Lee <cit.>, who showed that Fefferman's conformal structure lives on the total space of a circle bundle over (M,H,J), which is a certain quotient of the canonical bundle C over M. Čap and Gover <cit.> later substituted C for a certain root thereof, which allows them to work within the framework of parabolic geometry and tractor calculus. In all of these versions, one associates to each contact form θ a so-called Fefferman metric\n\t\n\t\n    g_θ    = 4 θ⊙ω^W_θ + h   ,\n\nwhere ω^W_θ is the induced Weyl connection one-form compatible with θ, and h is the (degenerate) metric induced from the Levi form of θ. Conformally related contact forms yield conformal related Fefferman metrics. The conformal structure thus constructed is characterised by the existence of a null conformal Killing field, and the CR manifold is recovered as the leaf space of its space of integral curves.\n\n\tThere is no global Einstein metric in the Fefferman conformal class, and at best, there exists only local ones defined off two cross-sections of M→M. Each such metric can be shown to arise from a so-called CR–Einstein structure, which is determined by a certain complex density σ satisfying a system of CR invariant equations <cit.>. This density determines a contact form θ, and thus a Fefferman metric g_θ. Using σ to trivialise M→M with local coordinate ϕ, and off the sections ϕ = ±π/2, the metric\n\t\n    g    = ^2 ϕ·g_θ  ,\n\n\nis Einstein. Rather disappointingly, a CR–Einstein three-manifold is flat, i.e. locally CR equivalent to the Heisenberg group or the three-sphere, and this implies in turn that the Fefferman space is conformally flat <cit.>.\n\n\tThere is, however, another, less-known, story connecting three-dimensional CR manifolds to four-dimensional Lorentzian metrics, which goes back to the Golden Age of mathematical relativity. And more importantly, these metrics are exact solutions to the vacuum Einstein's field equations, which include Einstein metrics. These are said to be algebraically special, meaning that the Weyl tensor is algebraic degenerate. A theorem due to Golberg and Sachs <cit.> tells us that such a property is equivalent to the existence of a so-called non-shearing congruence of null geodesics, that is, a (local) foliation by curves generated by a null vector field k, which preserves the conformal structure along directions orthogonal to it. For our purpose, we also assume that the congruence is twisting, i.e. the orthogonal complement ot k is non-integrable.\n\t\n\t Viewed in this light, our local Fefferman–Einstein metric is a special case, albeit conformally flat. But there are of course many other, non-conformally flat, algebraically special Einstein metrics. In local coordinates (u, ζ, ζ, r), broadly following <cit.>, they may be cast as\n\t\n\t\n    g    = 4 ϱ·ω⊙λ'_ω + 2 (r^2 + ϱ^2)   ·ω^1⊙ω ^1̅  .\n\n\twhere\n\t\n    ω    = 1/2 ϱ(ụ + Z ζ̣+ Zζ)   ,    ω^1     = ζ̣  ,    λ'_ω    = ṛ + Wω^1 + Wω^1 + Uω  .\n\n\n\tHere, the coordinate r is an affine parameter along the null geodesics of the congruence defined by the null vector field k, and (u, ζ, ζ) are coordinates on the leaf space, with u real, and ζ complex. The non-vanishing complex-valued function Z and real function ϱ are defined on M, and the one-forms ω and ω^1 define the contact CR structure on the leaf space, with ω̣= ıω^1 ∧ω^1̅ω. The r-dependence of the complex-valued function W and real function U is fully determined by virtue of the algebraical degeneracy of the Weyl tensor and (a subset of) Einstein's field equations, the\tso-called reduced Einstein equations. This form of the metric has the advantage of being amenable to asymptotics analysis as shown in <cit.>.\n\t\n\tA more convenient form for these metrics was obtained by Lewandowski and Nurowski in <cit.>, who found that any algebraically special pure radiation metric can be cast in the form\n\t\n    g    = ϱ^2 ^2 (ϕ - ϕ )·( 4 θ⊙λ + 2 θ^1 ⊙θ^1̅)   ,\n\nwhere ϕ is an affine parameter along the geodesics of the congruence, the one-forms θ and θ^1 define the CR structure on the leaf space M, with θ̣= ıθ^1 ∧θ^1, and ϱ and ϕ are smooth functions on M, but, as argued in <cit.>, both ϱ and ϕ can be eliminated by a rescaling of the contact form θ and a reparametrisation of the geodesics respectively. The components of the null one-form λ all admit finite Fourier expansions in ϕ, so their coefficients are functions on M. The coordinates ϕ and r from our previous form are related by the transformation r = ϱtan (ϕ - ϕ). We can then see at once that each of the metrics (<ref>) and (<ref>) with (<ref>) live on a circle bundle with some cross-sections removed, and this strongly suggests that they only differ from each other by some `perturbation' semi-basic one-form ξ, i.e. λ = ω^W_θ + ξ, and one of the aims of this article will be to establish this fact formally. From the relation between the two coordinates r and ϕ, we see that r →±∞ as ϕ→±π/2, so one can interpret the hypersurfaces where the metric g blows up as conformal infinity. To accommodate these singularity sets, we shall put Gover's notion of almost Einstein scale into good use. These are certain densities σ on M satisfying a conformally invariant second-order differential equation, which encapsulates the existence of an Einstein metric in the conformal class, but defined only off the singularity set of σ, if non-empty.\n\nA by-product of the investigation of these non-shearing congruences of null geodesics, which is the focus of Lewandowski1990a,Hill2008 is the discovery of analytic properties of CR three-manifolds arising from some subset of Einstein's field equations: these concern the existence of CR function, of which Kerr's complex coordinate ζ in (<ref>) is an example, or even the realisability of the CR manifold, under suitable conditions.\n\nMore recently, the authors of <cit.> revisited the work of Lewandowski1991,Hill2008 by focussing on a variant of Fefferman's construction, which admits non-conformally flat solutions of a certain subset of Einstein's field equations, and by appealing to Jacobowitz's work on the realisability of CR manifolds <cit.>. The present article will delve further into these ideas.\n\nFinally, many of the computations necessary to derive the present results were carried out by the author in arbitrary even dimensions in <cit.>. In dimensions greater than four, all Einstein metrics on Lorentzian conformal manifolds of even dimension admitting a twisting non-shearing congruence of null geodesics were found to be contained in a three-parameter family of metrics, which include the Taub–NUT–(A)dS metric. We shall return to these findings in a separate article.\n\n\nThe overall aim of the article is two-fold:\n\n\t\n  * To introduce and study CR invariant differential equations for contact CR manifolds, in connection with the existence of CR functions and the CR embeddability. These naturally occur in the investigation of algebraically special Einstein Lorentzian four-manifolds.\n\t\n  * To show that algebraically special Lorentzian four-manifolds with prescribed Ricci curvature can find a natural formulation in the context of Fefferman spaces. To be precise, these belong to the same conformal class as `perturbed' Fefferman metrics, i.e. they are of the form g = cosϕ·( g_θ + 4 θ⊙ξ) where g_θ is a Fefferman metric for some contact form θ, ξ is a semi-basic one-form, determined by some CR data, and ϕ a local fibre coordinate arising from a distinguished trivialisation of the Fefferman bundle.\n\t\n\t\n\tWe presently outline the structure of the paper while highlighting its main results. Section <ref> gives a review of CR geometry in any odd dimensions, but new interpretations are also obtained in connection with realisability of contact CR structures. In particular, we recast two results due to Jacobowitz <cit.> in terms of solutions to a CR invariant second-order differential equation in Proposition\t<ref> and Theorem <ref>. In fact, this equation can be defined in terms of a so-called first BGG operator as pointed out in Remark <ref>. A non-linear analogue of this equation, which we term a Webster–Weyl structure provides in dimension three a criterion for the existence of CR functions — Theorem <ref>. Theorem <ref> shows that this non-linear equation can always be `linearised' in a certain sense.\n\n\tSection <ref> contains a review of conformal geometry and so-called optical geometries which are at the heart of non-shearing congruences of null geodesics. In Definitions <ref> and <ref>, we introduce formal definitions of certain metrics with prescribed Ricci curvature, which we term weakly half-Einstein, half-Einstein and pure radiation metrics, and their almost Lorentzian scale analogues as generalisations of almost Einstein scales — Proposition <ref>.\n\t\n\tWe briefly recall the Fefferman construction in Section <ref>, and define their perturbation by a semi-basic form, which is shown in Lemma <ref> to arise from some CR data understood as a tuple of densities on the CR manifold.\n\t\n\tIn Section <ref>, we start our investigation of optical geometries with twisting non-shearing null geodesics in dimension four and their relation to perturbed Fefferman spaces. In particular, we prove Theorem <ref>, which can be summarised as follows:\n\t\t\t\n\t\t\tLet (M,c) be a Lorentzian conformal four-manifold with twisting non-shearing congruence of null geodesics K. Suppose that for any generator k of K, the Weyl tensor and the Bach tensor of c satisfy\n\t\t\t\n    (k,v,k,·)     = 0   ,    \n    (k,k)     = 0   ,\n\n\t\t\trespectively. Then (M,c) is locally conformally isometric to a perturbation of a Fefferman space over a contact CR three-manifold.\n\t\t\n\t\n\tIn Section <ref>, we investigate almost (weakly) half-Einstein and pure radiation scales on perturbed Fefferman spaces. Their zero set are shown to arise from a distinguished density on the CR base space — see Proposition <ref>. Next, in the same framework, Theorems <ref>, <ref> and <ref> show how various prescriptions on the Ricci curvature can be translated into CR invariant differential equations. They provide CR invariant articulations of the results of Lewandowski1990,Mason1998. Of interest is Proposition <ref>, which gives an alternative characterisation of algebraically special optical geometries as perturbed Fefferman spaces. Drawing from Section <ref>, we also recover the results of Lewandowski1990a,Hill2008 regarding CR realisability in Proposition <ref>, Theorems <ref> and <ref>. On that matter of realisability, Corollary <ref> adds new results in some specific cases of perturbed Fefferman spaces.\n\t\t\n\t\n\tIn Proposition\t<ref> of Section <ref>, we provide a detailed description of the Weyl tensor of an important class of perturbed Fefferman spaces in terms of weighted tensors on the base space. These are shown to satisfy algebraic conditions in the presence of an almost half-Einstein scale or an almost pure radiation scale in Propositions <ref> and <ref>. The asymptotic behaviour of the curvature at conformal infinity is examined Propositions <ref>, <ref> and <ref>.\n\n\t\n\tWe end the article with Section <ref> by commenting briefly on conformal symmetries and their interpretation in terms of CR invariant differential equations.\n\t\n\tFour appendices are included: Appendix <ref> contains some technical results regarding adapted coframes in dimension three, which are used in Section <ref>. In Appendices <ref> and <ref>, we provide computations of parts of the Bach tensor and the Ricci tensor used in Sections <ref> and <ref> respectively. In Appendix <ref>, we sketch how to recover the Debney–Kerr–Schild metric from our approach.\n\n\nAcknowledgments: The author would like to thank Rod Gover and Jerzy Lewandowski for helpful and stimulating conversations.  The research leading to these results has received funding from the Norwegian Financial Mechanism 2014-2021 UMO-2020/37/K/ST1/02788.\n\t\n\t\t\n\n§ CR GEOMETRY\n\n\t\n\n §.§ General definitions\n\n\tIn this article, an almost CR structure on a smooth (2m+1)-dimensional manifold M consists of a pair (H,J) where H is a rank-2m distribution, J a bundle complex structure on H, i.e. J∘J = -, where  is the identity map on H. This means that the complexification ^H of H splits as ^H = H^(1,0)⊕H^(0,1) where H^(1,0) and H^(0,1) are the rank-m ı-eigenbundle and -ı-eigenbundle of J respectively. When H^(1,0) is involutive, i.e. [H^(1,0),H^(1,0)] ⊂ H^(1,0), we refer to (M,H,J) as a CR manifold. The complex line bundle C := ⋀^m+1(H^(0,1)) is known as the canonical bundle of (M,H,J). We refer to <cit.> for a review on the topic.\n\t\n\tA (complex) infinitesimal symmetry of H^(1,0) is a complex-valued vector field v on M that preserves the distribution H^(1,0) in the sense that _v w ⊂Γ(H^(1,0)) for any w ∈Γ(H^(1,0)). An infinitesimal symmetry of (M,H,J) is a real vector field v on M that preserves H^(1,0). In particular, since it is real, it preserves H^(1,0) too. An infinitesimal symmetry v of either H^(1,0) or (H,J) is said to be transverse (to H), if it satisfies v θ≠ 0, for any θ∈Γ((H)).\n\t\n\t\n\t\tA complex infinitesimal symmetry of H^(1,0) as we have defined it is not an infinitesimal symmetry in the strict sense of the term since it does not generate a one-parameter family of diffeomorphisms preserving the CR structure unless it is real. Its geometric interpretation will be given in Jacobowitz Proposition <ref> below.\n\t\n\t\n\tReal hypersurfaces in ^m+1 are the prototypical examples of CR manifolds. Not every CR manifold arises in this way, but those that do are referred to as (locally) realisable or embeddable, in the sense that locally there exists an embedding from M to ^m+1 with the property that the bundle complex structure J on H is induced from the ambient complex structure on ^m+1.\n\n\n\t\n\tA CR function on (M, H,J) is a smooth complex-valued function f defined in the neighbourhood of a point of M that satisfies X(f) = 0 for any section X of H^(0,1). We shall say that a set of CR functions { f_1, … f_r} on some subset U⊂M is independent if they satisfy\n\t\n    f̣_1 ∧…∧f̣_r ≠ 0   ,\n\nat every point, and strongly independent if they satisfy\n\t\n    f̣_1 ∧f_1∧…∧f̣_r ∧f_r≠ 0   ,\n\nat every point of U. Realisability is then equivalent to the existence of m+1 independent CR functions. We shall give further criteria for realisability below. Before that, we give the following criterion for the existence of a CR function:\n\t\n\t\tLocally, a CR manifold (M, H,J) admits a strongly independent CR function if and only if there exists a smooth complex-valued one-form α annihilated by H^(0,1) such that α∧α̣= 0 and α∧α≠ 0.\n\t\n\tMore precisely, one can find two non-vanishing smooth complex-valued functions w and z on M such that α = w^-1ẓ.\n\t\n\t\t\n\t\n\t\tLocally, a CR manifold (M, H,J) is realisable if and only if it admits a complex transverse infinitesimal symmetry of H^(1,0).\n\t\n\t\n\tThe existence of a (real) transverse infinitesimal symmetry of (M,H,J) is sufficient but not necessary for realisability.\n\t\n\n\t\n\tOn a realisable CR manifold of dimension 2m+1, the pullback of any holomorphic (m+1,0)-form from ^m+1 to M gives rise to a closed section of the canonical bundle. So realisability provides an abundance of such forms. However, a closed section of the canonical bundle does not guarantee realisability <cit.>, unless one has enough CR functions at disposal:\n\t\n\n\tLocally, a (2m+1)-dimensional CR manifold is realisable if and only if it admits m strongly independent CR functions and a closed section of the canonical bundle. \n\n\n\n\tIn dimension three, it follows that once we know that (M,H,J) admits a CR function, realisability becomes equivalent to the existence of a closed section of the canonical bundle.\n\t\n\nFor ease of reference, we summarise the various criteria for the realisability of a CR manifold below. Given the following statement on a CR manifold (M,H,J):\n\n\t\n  * there is a (real) transverse symmetry of (H,J);\n\t\n  * there is a (complex) transverse symmetry of H^(1,0);\n\t\n  * the CR structure is realisable;\n\t\n  * there are m+1 independent CR functions;\n\t\n  * there are m strongly independent CR functions and a closed section of C;\n\t\n  * there is a closed section of C;\n\nwe have that\n\n    (1)       ⟹       (2)       ⟺        (3)       ⟺       (4)       ⟺       (5)       ⟹       (6)   .\n\n\n\n\tLocal sections of H^(0,1) can be interpreted as so-called Cauchy–Riemann operators, sometimes called Lewy operators. CR functions thus correspond to smooth complex functions that lie in the kernel of all such operators. For a CR manifold embedded as a real hypersurface in complex space, these operators arise from the restriction of the standard Cauchy–Riemann operators on ^m+1. We say that a Cauchy–Riemann operator ∂ is solvable at a point, if for each sufficiently smooth complex-valued function ξ in its neighbourhood, there exists a complex-valued function z in a possibly smaller neighbourhood such that\n\t\n    ξ = ı∂log z   .\n\nIn dimension three, even for realisable CR manifolds, there exists a ξ for which there is no z solving (<ref>) <cit.>. In other words, the ∂-Poincaré Lemma does not hold in CR geometry in general.\n\n\t\n\t\n\n §.§ Contact CR structures\n\n We shall be mostly interested in the case where our CR manifold (M,H,J) is contact, that is, the distribution H is contact, i.e. maximally non-integrable in the sense that T M = H + [H,H]. This is particularly convenient as there is a well-developed theory of such geometries available <cit.>. We also assume M and H to be oriented. A choice of contact form θ∈Γ((H)) is referred to as a pseudo-hermitian structure in the present context. Its Levi form, that is, the restriction h of θ̣ to H, has signature (p,q) with p+q=m, p positive, q negative eigenvalues. It provides a hermitian form on ^ H, and thus a bundle metric on H of signature (2p,2q). The Reeb vector field of θ is the unique vector field ℓ, satisfying θ (ℓ) = 1 and θ̣ ( ℓ , · ) = 0. Since there is in general no preferred pseudo-Hermitian structure on (M,H,J), we obtain a subconformal structure c_H on H compatible with J.\n\t\nIt will be convenient to assume that the canonical bundle C admits a -1/m+2-th root, and define the line bundle E(1,0) := C^-1/m+2, its complex conjugate E(0,1) = E(1,0), dual  E(-1,0) :=  E(1,0)^*. More generally, we define CR density bundles E(w,w') := E(1,0)^w ⊗E(1,0)^w' for any w, w' ∈ such that w - w' ∈. By definition, it follows that E(w,w') = E(w',w).\n\nThere are  canonical sections θ of T^* M⊗E(1,1) and h of (H^(1,0))^* ⊗ (H^(0,1))^* ⊗E(1,1) with the property that for each CR scale, that is, a (real) section 0 < s ∈Γ(E(1,1)), then θ = s^-1θ is a contact form with Levi form h = s^-1h. This reflects the fact that T M/H injects into E(1,1). The weighted Levi form h allows us to identify H^(1,0) with (H^(0,1))^*⊗E(1,1) and H^(0,1) with (H^(1,0))^*⊗E(1,1).\n\nOne can also understand the relation between CR scales and contact forms as follows: to each section ζ of C = E(-(m+1),0), there is a unique contact form θ with Reeb vector field ℓ for which ζ is volume-normalised, i.e.\n    θ∧ (θ̣)^m     = ı^m^2 m! (-1)^q θ∧ (ℓζ) ∧ (ℓζ)   .\n\nThis equation tells us that at every point p there is a circle of volume-normalised elements of C_p associated to a non-zero element of (H_p).\n\n\n\n\t\n\n\t\n\t\n\t\t\n\n\t\n\t\n\n §.§ Webster connections\n\n\tEach choice of CR scale s with contact form θ=s^-1θ and Reeb vector field ℓ induces a splitting\n\t\n    ^ T M =  ^⟨ℓ⟩⊕H^(1,0)⊕H^(0,1)  ,\n\n\tBefore we proceed, we  introduce plain and overlined  minuscule Greek abstract indices in the following way:\n\t\n    E^α   := H^(1,0)  ,    E^α̅    := H^(0,1)  ,    E_0     := (H)   , \n    E_α    := (H^(1,0))^*   ,    E_α̅    := (H^(0,1))^*   ,\n    \t\t   E^0     := ((H))^*   .\n\n\tIn effect, indices can be raised and lowered using h_αβ̅, e.g. v_α = h_αβ̅v^β̅. Clearly, complex conjugation on ^H changes the index type, and, in general, unless stated otherwise, we shall write v^α̅ for v^α, and so on. These indices will also be used in a concrete way, in which case, they run from 1 to m.\n\t\n\t\n\t\n\tComplete ℓ to a (complex) frame ( ℓ , e_α , e_β̅ ), α, β̅ = 1, …, m, adapted to (H, J), i.e. ( e_α )  and ( e_β̅ ), α, β̅ = 1, …, m, span H^(1,0) and H^(0,1) respectively. Denote by ( θ , θ^α , θ^α̅ ), the coframe dual to ( ℓ , e_α , e_β̅ ), α, β̅ = 1, … , m. Then the contact form θ satisfies\n\t\n    dθ    = ıh_αβ̅θ^α∧θ^β̅  ,\n\n\twhere we realise the Levi form h_αβ̅=s^-1h_αβ̅ of θ as a Hermitian matrix of functions. We refer to (θ^α) as an admissible coframe for (H^(1,0))^*, and to (θ, θ^α, θ^α̅) as an adapted coframe for (M,H,J). An admissible or adapted coframe is said to be unitary if h_αβ̅ = δ_αβ̅ with respect to (θ^α, θ^α̅). In dimension three, we shall sometimes qualify such a coframe as being of the first kind, to distinguish it from an adapted coframe of the second kind as described in Appendix <ref>.\n\t\n\tFor each contact form θ, there is a unique linear connection ∇ on T M and associated bundles with the property that for a chosen adapted coframe ( θ , θ^α , θ^β̅ ), ∇ satisfies\n\t\n    ∇θ    = 0   ,    ∇θ^α    = - Γ_β^α⊗θ^β  ,     ∇θ^α̅    = - Γ_β̅^α̅⊗θ^β̅  ,\n\n\twhere Γ_β^α and Γ_β̅^α̅ denote the connection one-form of ∇ in that coframe. In addition, ∇ is required to preserve the Levi form h_αβ̅, from which it follows that\n\t\n    ḥ_αβ̅ - ( Γ_α^γh_γβ̅ + Γ_β̅^γ̅h_αγ̅)      = 0   .\n\n\tFor a unitary adapted coframe, we have Γ_αβ̅ = - Γ_β̅α.\n\t\n\t\n\t\n\tThe torsion of this connection splits into two pieces: the Levi-form h_αβ̅ and the Webster or pseudo-hermitian torsion tensor _αβ with conjugate _α̅β̅. The latter satisfies the symmetries _αβ = _(αβ). They can be identified within the Cartan structure equations:\n\t\n\t\n    dθ    = ıh_αβ̅θ^α∧θ^β̅  , \n    dθ^α    = θ^β∧Γ_β^α +  ^α_β̅θ∧θ^β̅  , \n    dθ^α̅    = θ^β̅∧Γ_β̅^α̅ + ^α̅_βθ∧θ^β  .\n\n\n\nThe Webster connection extends to a connection on the density bundles E(w,w'). If σ∈Γ(E(w,0)) is such that σ^-m+2/w = θ∧θ^1 ∧…∧θ^m for some adapted coframe (θ,θ^α, θ^α̅). Then\n\t\n    ∇σ    = w/m+2Γ_α^ασ  ,\n\n\twhere Γ_α^β is the connection one-form of ∇ corresponding to θ. By complex conjugation, one obtains a similar formula for densities of weight (0,w).\n\t\n\tNote that ∇ preserves the weighted contact form θ, i.e. ∇θ = 0. Thus if θ = s^-1θ for some CR scale s, ∇ also preserves s. This implies that for any σ∈Γ(E(1,0)) such that s = σσ, we must have σ^-1∇σ = - σ^-1∇σ.\n\t\n\t\n\tFor future use, we record the commutators of the Webster connection when (M,H,J) is of dimension three only. For any λ_α∈Γ(E_α), we have\n\t\n    (∇_α∇^α - ∇^α∇_α ) λ_γ + ı∇_0 λ_γ    = - 4 Ρλ_γ  , \n    \n    \t\t(∇_α∇_0 - ∇_0∇_α ) λ_γ - _αβ∇^βλ_γ    = -  λ_β∇^β_αγ  , \n    \n    \t\t(∇^α∇_0 - ∇_0∇^α ) λ_γ - ^αβ∇_βλ_γ    = (∇_γ^αδ)  λ_δ  ,\n\n\twhere Ρ is the Webster–Schouten scalar. For any smooth density f ∈Γ(E(w,w')),\n\n\t\n    (∇_α∇^α - ∇^α∇_α ) f    = 4/3 (w -w') Ρ f - ı∇_0f  , \n    \n    \t\t(∇_α∇_0 - ∇_0∇_α ) f    = 1/3 (w -w') ∇^β_αβ f + _α^β̅∇_β̅f  .\n\n\n\t\n\tFinally, the Cartan tensor is the fourth-order CR invariant of weight (-1,-1) defined by\n\t\n    _αβ    := ı∇_0 _αβ - 2 ı∇_α𝖳_β + 2 Ρ_αβ  ,\n\n\tIts vanishing is equivalent to CR flatness, that is, _αβ = 0 if and only if (M, H,J) is locally CR equivalent to the CR three-sphere.\n\n\t\n\t\n\t\n\tWhile we shall mostly be using the Webster connection throughout this article, it is worth introducing an alternative canonical connection, namely the Weyl connection ∇^W of (H,J,θ) — see <cit.>. It agrees with the Webster connection ∇ along directions tangent to H, but differs from it along the Reeb direction. In particular, on a density σ of weight (1,0), we have\n\t\n    ∇^W σ = ∇σ + ı/m+2 (w - w')Ρθσ  .\n\n\t\n\t\n\t\n\n §.§ Gauged partial Webster connections\n\n\tIn what follows, E_∙ will denote any multiple tensor products of E_α and E_α̅. Choose a Webster connection ∇, and view ∇_α and ∇_α̅ as partial connections along sections of E^α and E^α̅. Then, for any choice of ξ_α∈Γ(E_α), we define the partial connection\n\t\n    ξ∇_α    : Γ(E_∙(w,w')) ⟶Γ(E_α⊗E_∙(w,w'))    : f↦ξ∇_αf := ∇_αf - ı (w - w') ξ_αf  .\n\n\tClearly, ξ∇_α coincides with ∇_α on any section of E_∙(w,w). We shall often use the short-hand ξ∇_α = ∇_α + ξ_α to mean (<ref>).\n\t\n\t\n\t\tWe shall call the partial connection defined by (<ref>) the partial Webster connection gauged by ξ_α. If ξ_α = ı∇_αlog z for some complex-valued function z, we refer to the partial gauge ξ_α as being exact.\n\t\n\t\n\t\tTo carry out explicit computations, it is convenient to choose σ∈E(1,0) such that ∇ (σσ)=0 so that we can trivialise f as the function f = fσ^-wσ^w'. Then\n\t\t\n    σ^wσ^-w'ξ∇_αf    = ∇_α f + (w -w') (σ^-1ξ∇_ασ)  f   .\n\n\t\n\nIn full analogy, a one-form ξ can be used to gauge a Webster connection as\n\t\n    ξ∇    : Γ(E_∙(w,w')) ⟶Γ(T^* M⊗E_∙(w,w'))    : ξ∇f := ∇f - ı (w - w') ξf  .\n\nThis gauged connection will however play little in this article. It is nevertheless instructive to compute the curvature F of this gauge: writing ξ = ξ_αθ^α + ξ_α̅θ^α̅ + ξ_0θ, we have\n\n    F     := ξ̣= F_αβθ^α∧θ^β + F_α̅β̅θ^α̅∧θ^β̅ + 2 F_αβ̅θ^α∧θ^β̅ \n    \t+ 2 F_0 βθ∧θ^β \n    \t+ 2 F_0 β̅θ∧θ^β̅  ,\n\nwhere\n\n    F_αβ    = ∇_[αξ_β]  ,     F_αβ̅    = 1/2( ∇_αξ_β̅ - ∇_β̅ξ_α + ıξ_0h_αβ̅)   ,     F_0 β    = 1/2( ∇_0ξ_β - ∇_βξ_0 + ξ_α̅A^α̅_β)   .\n\n\n\nThe following lemma follows from a straightforward computation:\n\n\tFor any two pairs σ, ξ_α and σ', ξ'_α, where σ, σ' ∈Γ(E(1,0)) and ξ_α, ξ'_α∈Γ(E_α) are related by\n\t\n    σ'     = z σ  ,    ξ'_α = ξ_α + ı∇_αlog z   ,\n\nfor some smooth non-vanishing complex-valued function z, we have\n\n    σ'^-1ξ'∇_ασ'     = σ^-1ξ∇_ασ  .\n\n\n\n\n\tClearly, if the gauge is exact, one can always find a rescaling (<ref>) such that σ'^-1∇_ασ' = σ^-1ξ∇_ασ\n\n\n\t\n\n\t\n\n §.§ Transformations under a change of contact form\n\n\tLet s and s be two CR scales related by s = ^-φ s, for some smooth function φ on M so that the Levi form transforms as h_αβ̅ = ^φ h_αβ̅, and the induced change of adapted coframes are related by\n\t\n    θ^0    = ^φθ  ,    θ^α    = θ^α + ıΥ^αθ  ,    θ^α    = θ^α - ıΥ^αθ  ,\n\nwhere Υ = φ̣. The induced change of the Webster connections will be denoted by the short-hand notation\n\n    ∇    = ∇ + Υ  ,\n\nmeaning that, for any τ_α∈Γ( E_α),\n\t\n    ∇_ατ_β    = ∇_ατ_β - 2 Υ_(ατ_β)  , \n    ∇_β̅τ_α    = ∇_β̅τ_α + h_αβ̅Υ^γτ_γ  , \n    ∇_0τ_β    = ∇_0τ_β + ıΥ^γ̅∇_γ̅τ_β - ıΥ^γ∇_γτ_β - ı( ∇_γΥ^γ - Υ_γΥ^γ) τ_β  ,\n\nwhile, for any f ∈Γ( E(w,w')),\n\t\n    ∇_α f     = ∇_α f + w Υ_α f     , \n    ∇_α̅ f     = ∇_α̅ f + w' Υ_α̅ f   , \n    ∇_0 f     = ∇_0 f + ıΥ^β̅∇_β̅ f - ıΥ^β∇_β f + 1/m+2[ (w +w') Υ_0 + ı w Υ^β_β - ı w' Υ_β^β + ı (w' - w) Υ^βΥ_β] f   .\n\n\tThe Webster torsion and Webster–Schouten scalar transform as\n\t\n    _αβ    = _αβ + ı∇_αΥ_β  - ıΥ_αΥ_β  ,    Ρ    = Ρ - 1/2( ∇^αΥ_α + ∇_αΥ^α) - 1/2Υ^γΥ_γ  ,\n\nrespectively.\n\n\nGauged (partial) Webster connections undergo the same transformation as their ungauged counterpart: if ξ∇_α and  ξ∇_α are the partial Webster connections gauged by some ξ_α∈Γ(E_α), and ∇ and ∇ related by (<ref>), then\n\n    ξ∇_αf    = \tξ∇_αf + w Υ_αf  ,\n\nfor any section f of E_∙(w,w').\n\n\t\n\t\n\t\n\n §.§ CR densities\n\n\tWe now naturally extend the notion of CR functions to densities.\n\n\tWe shall say that a density τ of weight (w,0) for any w ∈ on a contact CR manifold (M,H,J) is a CR density if it satisfies the CR invariant equation\n\t\t\t\n    ∇_α̅τ = 0   .\n\n\n\n\n\tThis definition should not be confused with that of a CR scale introduced earlier, that is a positive real density of weight (1,1).\n\n\n\n\tWhen w=0, we then recover the definition of a CR function. For a strongly independent CR function, we need the additional requirement that τ≠τ and ∇_ατ≠ 0. If the latter does not hold, we clearly conclude from (<ref>) that τ is constant.\n\n\t\n\tThe space of CR densities is clearly closed under multiplication, that is, if σ and τ are two CR densities of weight (w,0) and (w',0) respectively, then στ is a CR density of weight (w+w',0). Further, since a section ε of the canonical bundle is a density of weight of -m-2, choosing any -w/m+2-th root of ε for any w ∈ yields a section of E(w,0). In particular, the structure equations (<ref>) together with (<ref>) gives a straightforward proof of the next result.\n\t\n\t\tLocally, a contact CR manifold admits a closed section of the canonical bundle if and only if it admits CR densities of weight (w,0) with 0 ≠ w ∈.\n\t\n\t\n\tNow, since any realisable (M,H,J) admits closed sections of C, we have:\n\t\n\t\tAny realisable contact CR manifold (M,H,J) admits CR densities of weight (w,0) for any w ∈.\n\t\n\t\n\t\n\t\tSince CR densities and CR functions are on the same footing, Jacobowitz's Theorem <ref> feels very natural in that respect: in this light, the closed section of the canonical bundle is just a CR density.\n\t\n\t\n\t\n\t\tLee showed <cit.> that locally, the existence of a closed section of C is essentially equivalent to the existence of a so-called pseudo–Einstein structure, that is, the existence of a contact form θ such that the Webster–Schouten tensor is proportional to the Levi form (but not necessarily by a constant factor).\n\t\n\t\n\t\n\t\n\n §.§ Complex infinitesimal transverse symmetries\n\n\tIt is straightforward to check that for any density σ of weight (1,w), w ∈, the equation\n\t\n    ∇_α∇_βσ + ı_αβσ    = 0   ,\n\nis CR invariant.\n\n\n\tIn the language of parabolic geometries, the solution σ lies in the kernel of a so-called first Bernstein–Gel'fand-Gel'fand (BGG) operator <cit.> — see also for instance <cit.>, especially Section 8.2 there for the case m=1. For w≥0, the operator occurs as part of a resolution of an irreducible (m+1,1)-representation.\n\n\nIn the case where w=1, the geometric interpretation of its solutions is given in the next proposition.\n\t\n\t\tAny solution σ∈Γ(E(1,1)) to (<ref>) is equivalent to the existence of a complex infinitesimal transverse symmetry of H^(1,0).\n\t\n\t\n\t\n\t\tIn a local adapted frame (ℓ, e_α, e_α̅), a vector field v on (M,H,J) can be expressed as\n\t\t\n    v     = v^0ℓ + v^α e_α + v^α̅e̅_α̅  ,\n\n\t\tfor complex v^0∈Γ(E), v^α∈Γ(E^α) and v^α̅∈Γ(E^α̅). Note we are not assuming that v^α̅ is the complex conjugate of v^α in general. A straightforward computation shows that v preserves H^(1,0), i.e. _v e_α∈Γ(H^(1,0)), if and only if\n\t\t\n\t\t\t\n    v_α - ı∇_α v^0    = 0   , \n    ∇_α v_β + ı_αβ    = 0   .\n\n\t\t\n\t\tThe condition that v be transverse to H means that v^0 is non-vanishing. Setting σ := v^0 s where s is the CR scale preserved by ∇, we see that σ satisfies (<ref>).\n\t\t\n\t\tThe converse is clearly true: let σ∈Γ(E(1,1)) be a solution of (<ref>), choose a CR scale s with Webster connection ∇, and set v^0 := σ s^-1. Then v^0 is non-zero, and v_α := ı∇_α v^0 satisfies (<ref>) by virtue of (<ref>). Define v := v^0 ℓ + v^α e_α + v^α̅e_α̅ for any choice of section v^α of E^α. Then σ yields a complex transverse symmetry of H^(1,0).\n\t\t\n\t\n\t\n\t\tIn the special case where a density σ of weight (1,1) is real, i.e. σ is a CR scale, and solves (<ref>), then the Reeb vector field defined by σ is an infinitesimal transverse symmetry of (M,H,J). Note that in this case the assumption that (H,J) is contact forces the symmetry of (H,J) to be transverse. We shall nevertheless retain the terminology. Such solutions have already been investigated in e.g. <cit.> in the context of deformations of (almost) CR structures.\n\t\t\n\t\tOn the other hand, the correspondence between complex densities of weight (1,1) satisfying (<ref>) and complex transverse symmetries is not one-to-one in general, since the (1,0)-part of the latter is completely arbitrary. This is to be expected since H^(1,0) is involutive. Thus if one solution exists, so do infinitely many.\n\t\n\t\n\tIn the context of contact CR manifolds and in the light of Proposition <ref>, we can re-express Jacobowitz's Proposition <ref> in the following terms: \n\t\n\t\tLocally, a contact CR manifold (M,H,J) is realisable if and only if it admits a solution σ∈Γ(E(1,1)) to  (<ref>). \n\t\n\t\n\t\n\t\n\n §.§ Webster–Weyl structures\n\n\t\n\n  §.§.§ General odd dimensions\n\nIn this section, we introduce a CR invariant structure that may be thought of as a non-linear analogue to (<ref>), and will play a key rôle in the subsequent sections. We start with a simple lemma, whose proof follows from the transformation rule (<ref>) of the Webster torsion tensor.\n\t\n\t\tLet ∇ and ∇ be two Webster connections on a contact CR manifold (M,H,J) related by (<ref>). Then a section λ_α of E_α is a solution to\n\t\t\n    ∇_(αλ_β) -  ıλ_αλ_β  - _αβ    = 0   ,\n\n\t\tif and only if \n\t\t\n    λ_α = λ_α + ıΥ_α  ,\n\n\tis a solution to\n\t\n    ∇_(αλ_β) -  ıλ_αλ_β  - _αβ    = 0   .\n\n\t\n\n\nConsidering the close resemblance of (<ref>) to the Einstein–Weyl equation, we make the following definition.\n\t\n\t\tA Webster–Weyl structure on (M,H,J) is an equivalent class [∇_α,λ_α] of pairs (∇_α,λ_α), where ∇_α is a (partial) Webster connection and λ_α∈Γ(E_α), with the property that these satisfy the Webster–Weyl equation (<ref>), and (∇_α, λ_α) ∼ (∇_α,λ_α) whenever ∇_α and ∇_α related by (<ref>), and λ_α and λ_α by (<ref>).\n\t\n\n\n\t It is not difficult to check that equation (<ref>) for a real density σ∈Γ(E(1,1)) is a particular case of (<ref>) where, for every choice of representative [∇_α,λ_α], we have that λ_α = ı∇_αψ for some real smooth function ψ on M. In particular, there is a representative for which λ_α = 0, which tells us that the Reeb vector field corresponding to σ is an infinitesimal symmetry of (M,H,J).\n\n\nThere is an analogue of equation (<ref>), closely related to (<ref>) for gauged partial connections: Let ξ∇_α be a partial Webster connection gauged by some ξ_α∈Γ(E_α). Then\n\n    ξ∇_(αξ∇_β)σ + ı_αβσ    = 0   ,\n\nis a well-defined CR invariant on densities of weight (1,w). In fact, CR invariance simply follows from the following easy observation:\n\n\tSuppose that σ∈Γ(E(1,w)) for any w ∈ is a solution to (<ref>). Then\n\t\n    λ_α = ıσ^-1ξ∇_ασ = ıσ^-1∇_ασ + ξ_α  ,\n\nsatisfies the Webster–Weyl equation (<ref>).\n\nConversely, suppose that λ_α solves (<ref>). Fix some σ∈E(1,w), w ∈, and define a partial gauge ξ_α∈Γ(E_α) by (<ref>). Then σ satisfies (<ref>).\n\nThus, we can interpret equation (<ref>) in three different ways:\n\n\t\n  * as an equation on the density σ for ξ_α fixed;\n\t\n  * as an equation on the partial gauge ξ_α for σ fixed;\n\t\n  * as an equation on the pair (σ, ξ_α) subject to the freedom (<ref>) since by Lemma <ref>, it leaves λ_α as defined by (<ref>) unchanged.\n\n\n\n\n\nA consequence of Lemma <ref> is the following:\n\n\tFor any non-vanishing complex-valued function z, any solution σ∈Γ(E(1,0)) to (<ref>) yields a solution z σ to (<ref>) where the partial gauge is given by ξ_α =ı∇_αlog z.\n\t\n\tSuppose that ξ_α = ı∇_αlog z for some non-vanishing complex-valued function z. Then any solution to (<ref>) gives rise to a solution to (<ref>).\n\n\nOnce a solution to (<ref>) is known for some gauge, it is easy to produce more by using CR densities of weight (1,0) as `raising' or `lowering' operators:\n\nSuppose that (M,H,J) admits a CR density τ of weight (w,0) for some w ∈ Z. Then any solution s of weight (1,w') to (<ref>) for some w' ∈ Z gives rise to a solution σ=s τ^-1 of weight (1,w'-w) to (<ref>).\n\n\nIt thus follows from Lemmata <ref> and <ref> that for realisable (M,H,J), densities of weight (1,0) that satisfies (<ref>) exists in plentiful. We note that the geometric interpretation of a solution to (<ref>) crucially depends on the weight of the density since in general only weight (1,1) implies realisability. However, Jacobowitz's Theorem <ref> already hints at a way to remedy this issue.\n\n\tLocally, a contact CR manifold (M,H,J) is realisable if and only if it admits two densities σ and τ of weight (1,0) that satisfy\n\t\n\t\n    ∇_α∇_βσ + ı_αβσ    = 0   , \n    ∇_α̅τ    = 0   ,\n\n\nrespectively.\n\n\n\n\tSuppose that (M,H,J) is realisable. Then Lemma <ref> provides a solution τ to (<ref>), and Proposition <ref> provides a solution to (<ref>). Hence, by Lemma <ref> we obtain a solution to (<ref>).\n\t\n\tConversely, we apply Lemma <ref> to our solutions σ and τ to (<ref>) and (<ref>) respectively, to produce a solution στ^-1∈Γ(E(1,1)) to (<ref>). Realisability then follows by Proposition <ref>.\n\n\n\n\nIn the special case, where τ=σ in Theorem <ref>, the pair of equations (<ref>) and (<ref>) define what is referred to as an (almost) CR–Einstein structure in <cit.>. In this case, the solution σ defines a pseudo-hermitian structure θ for which\n\n    _αβ    = 0   ,    ( Ρ_αβ̅)_∘    = 0   ,    ∇_αΡ    = 0   .\n\nIn dimension three, any solution thereof immediately tells us that (M,H,J) is CR–flat.\n\n\n\n\n  §.§.§ Dimension three\n\nHenceforth, we assume that (M,H,J) has dimension three. Then the tensor product of any number of copies of H^(1,0) and H^(0,1) is of rank 1, so symmetrisation is a vacuous operation, and we have that H^(1,0)⊗H^(0,1)≅E(1,1), since for any A^α∈Γ(E^α), B^α̅∈Γ(E^α̅), we can write A^αB^β̅ = A^γB_γh^αβ̅. While the use of indices, which concretely only take the numerical value 1, may appear to be of rather limited utility, they turn out to be extremely useful for book keeping and ultimately makes the geometric interpretation of our computations much more transparent, and the relation to the general case more direct.\n\nWe now return to the problem of characterising the existence of a CR function. \tLet us choose an arbitrary local adapted coframe (θ, θ^α, θ^α̅) on (M,H,J) with dual (ℓ,e_α,e_α̅). Starting in greater generality, let λ_α be an arbitrary section of E_α, and set\n\t\n    ω    = θ  ,    ω^α    = θ^α + λ^αθ  ,    ω^α̅    = θ^α̅ + λ^α̅θ  .\n\nNote that by (<ref>) and (<ref>), ω^α does not depend on the choice of contact form.\n\tUsing the structure equations (<ref>), we then find\n\t\n\t\t\n    ω̣    = ıh_αβ̅ω^α∧ω^β̅ +  ω∧( ıλ_αω^α  - ıλ_α̅ω^α̅)   , \n    ω̣^α    = ( Γ_β̅γ^γ + ıλ_β̅) ω^α∧ω^β̅ + (  - Γ_0 δ^δδ_β^α - e_β( λ^α ) + λ^γ̅Γ_γ̅δ^δδ_β^α +  ıλ^αλ_β) ω∧ω^β\n                + ( ^α_β̅ - ∇_β̅λ^α -   ıλ_β̅λ^α)  ω∧ω^β̅  , \n    ω^α̅    = ( Γ_βγ̅^γ̅ - ıλ_β) ω^α̅∧ω^β \n    \t\t\t+ (  - Γ_0 δ̅^δ̅δ_β̅^α̅ - e_β̅( λ^α̅ ) + λ^γΓ_γδ̅^δ̅δ_β̅^α̅ -  ıλ^α̅λ_β̅) ω∧ω^β̅\n                + ( ^α̅_β - ∇_βλ^α̅ + ıλ_βλ^α̅)  ω∧ω^β  .\n\n\t\n\tIn particular,\n\t\n    ω^γ∧ω̣^α    = ( ∇_β̅λ^α +  ıλ_β̅λ^α - ^α_β̅)  ω∧ω^γ∧ω^β̅  ,\n\n\tand similarly for its complex conjugate. We thus conclude\n\t\n    ω^α∧ω̣^β    = 0       ⟺      ∇_αλ_β - ıλ_αλ_β - _αβ = 0   .\n\nFurther, we have\n\n    ω^α∧ω^β̅    = θ^α∧θ^β̅ + θ∧( λ^αθ^β̅ - λ^α̅θ^β̅) ≠ 0   .\n\n\tHence, by Lemma <ref>, we conclude:\n\t\t\n\t\tLocally, a contact CR three-manifold admits a strongly independent CR function if and only if it admits a Webster–Weyl structure.\n\t\n\n\tThis, together with Lemma <ref>, allows us to recast Jacobowitz's Theorem <ref> in the following terms:\n\n\tLocally, a smooth contact CR three-manifold is realisable if and only if it admits a Webster–Weyl structure and a CR density of weight (1,0).\n\n\n\n\tIt is interesting to note that in dimension three, if one considers equation (<ref>) alone, realisability can only be guaranteed if the weight of σ is (1,1). For any other weight (1,w) with w ≠ 1, we must content ourselves with only one CR function by Theorem <ref> via Lemma <ref> with ξ_α=0.\n\n\n\nIn the following, we translate the condition of functional independence of two CR functions into a statement on their Webster–Weyl structures.\n\n\tLet (M,H,J) be a contact CR three-manifold. Then any two CR functions are independent if and only if their corresponding Webster–Weyl structures [∇_α,λ_α] and [∇_α,λ_α'] differ by a non-vanishing (1,0)-form, i.e. λ'_α = λ_α + μ_α for some non-vanishing μ_α.\n\t\n\tIn particular, given a Webster–Weyl structure (∇_α,λ_α), any other (∇_α,λ_α') arises from a solution μ_α to the CR invariant equation\n\t\n    ∇_αμ_β - 2 ıλ_αμ_β - ıμ_αμ_β    = 0   ,\n\nand setting λ'_α = λ_α + μ_α.\n\n\n\n\tLet ω^1 and ω'^1 be two forms annihilated by H^(0,1) and satisfying ω^1∧ω̣^1 = 0 and ω'^1∧ω̣'̣^1 = 0, so that by Lemma <ref>, ω^1 = z^-1ẉ and ω'^1 = z'^-1ẉ' for some non-vanishing complex-valued functions z, w, z' and w' on M. With no loss, we may choose an adapted coframe (θ^0, θ^1, θ^1̅) and, possibly after some rescaling of ω^1, write ω^1 = θ^1 + λ^1θ and ω'^1 = θ^1 + λ'^1θ for some solutions λ_α and λ'_α to the Webster–Weyl equation (<ref>). The condition that the CR functions w and w' be independent is then equivalent to ω^1 ∧ω'^1 = ( λ^1 - λ'^1) θ^0 ∧θ^1 ≠ 0, from which the result follows immediately.\n\n\nAs it will next emerge, in dimension three, one can always `linearise' a solution to the Webster-Weyl equation, in the sense of turning a one-form solving (<ref>) into a density of weight (1,-2) solving (<ref>):\n\n\tLet (M,H,J) be a contact CR three-manifold endowed with a Webster–Weyl structure [∇_α,λ_α]. Then locally, there exists a smooth density σ of weight (1,0) such that for any choice of representative (∇_α, λ_α), we have\n\t\n    λ_α    = ıσ^-1σ^2∇_α( σσ^-2)   ,\n\nor equivalently,\n\t\n    λ_α    = ıσ^-1ξ∇_ασ := ıσ^-1∇_ασ + ξ_α  ,          ξ_α    := - 2 ıσ^-1∇_ασ  ,\n\nwith the property that if (θ, θ^1, θ^1̅) is the unitary adapted coframe determined by σ, i.e. σ^3 = θ∧θ^1, and ((θ)∇_α,(θ)λ_α) is the representative of [∇_α,λ_α] determined by θ = (σσ)^-1θ, then the one-form ω^1 = θ^1 + λ^1θ is given by ω^1 = ẉ for some CR function w, and\n\n    (θ)∇_α(θ)λ^α - ı(θ)λ_α(θ)λ^α + 3 σ^-1(θ)∇_0σ    = 0   .\n\nIn particular, σσ^-2∈Γ ( E(1,-2) ) satisfies\n\n    ∇_α∇_β( σσ^-2) + ı_αβ( σσ^-2)     = 0   .\n\n\nAny other density σ of weight (1,0) related to σ by\n\t\n    σ = z^-3/2z^-1/2σ  ,\n\nfor some smooth CR function z satisfying ∇_0 z - λ^α∇_α z = 0, will share the same property as σ.\n\n\n\n\tSince (M,H,J) admits a Webster–Weyl structure, by Theorem <ref>, it locally admits a CR function w, and we can find a unitary adapted coframe (θ, θ^1, θ^1̅) such that (ω, ω^1, ω^1̅) as defined by (<ref>) is an adapted coframe of the second type, as described in Appendix <ref>, with the property that ω^1 = ẉ. This choice picks out a representative ((θ)∇_α,(θ)λ_α) of [∇_α,λ_α]. We now return to equation (<ref>), and to emphasise the dependence on the choice of frame, we adorn the geometric quantities with (θ)·. Then ω̣^1 = 0 implies that\n\t\n\t\t\n    (θ)∇_β̅(θ)λ^α + ı(θ)λ_β̅(θ)λ^α - (θ)^α_β̅    = 0   , \n    (θ)Γ_β̅γ^γ + ı(θ)λ_β̅    = 0   , \n    \n       - (θ)Γ_0 γ^γδ_β^α - e_β( (θ)λ^α ) + (θ)λ^γ̅(θ)Γ_γ̅δ^δδ_β^α +  ı(θ)λ^α(θ)λ_β    = 0   .\n\n\n\tClearly, equation (<ref>) is vacuous. By (<ref>), equation (<ref>) tells us that (θ)λ_α̅ = 3 ıσ^-1(θ)∇_α̅σ for some density σ of weight (1,0) such that σ^-3 = θ∧θ^1 and θ = (σσ)^-1θ. However, this expression depends on the coframe, and thus on the choice of connection. To resolve this issue, we note that since (θ)∇(σσ) = 0, we can write\n\t\n    (θ)λ_α    =  ıσ^-1(θ)∇_ασ - 2 ıσ^-1(θ)∇_ασ = ıσ^-1σ^2 (θ)∇_α (σσ^-2 )  .\n\n\tThis new expression gives the appropriate transformation for (θ)λ_α under a change of contact form. In particular, it does not depend on the particular choice of representative of [∇_α, λ_α], and we can safely drop the adornment (θ)·, thereby establishing (<ref>). We can now recast (<ref>) as (<ref>). Plugging now (<ref>) into (<ref>) yields (<ref>).\n\t\n\t\n\tFinally, we note that if z is some non-zero complex-valued function that satisfies ∇_α̅ z = 0 (so z is a CR function) and ∇_0 z - λ^α∇_α z = 0, the one-form ω^1 = z ω^1 is also exact with a CR potential. Rescaling σ as in (<ref>) yields a unitary adapted coframe of the first kind (θ, θ^1, θ^1̅) where θ = z zθ and θ^1 = z θ^1 + Υ^1θ. Carrying out the analysis as before, we find that\n\t\n    λ_α    = ıσ^-1∇_ασ - 2 ıσ^-1∇_ασ  ,\n\n\tand we may verify for consistency that λ_α = λ_α + ıΥ_α.\n\n\n\nTheorem <ref> tells us that we obtain an equivalence class of densities related by (<ref>), for which the solution λ takes the form (<ref>). Each of these densities singles out a connection ∇ in which the connection one-form component Γ_αβ̅^β̅ in the associated adapted coframe can be identified with ıλ_α. This falls short of a distinguished connection, but nevertheless partially mimics the behaviour of Einstein–Weyl structure in the conformal setting.\n\n\n\n\t\n\t\tWhile Theorem <ref> singles out a family of unitary adapted coframes, and in particular, of contact forms, in the context of CR functions, these might not be the most convenient ones when it comes to geometric structures. Indeed, a local transverse symmetry determines a unique contact form θ for which the Reeb vector field is its generator. But in general, there will be no admissible unitary coframe (θ^1) such that θ^1 = ẉ where w is a CR function.\n\t\n\t\n\tWe end this section by an application of Theorem <ref>, which weakens the assumptions of Theorem <ref> in dimension three:\n\t\n\t\n\t\tLocally, a contact CR three-manifold (M,H,J) is realisable if and only if it admits two densities σ and τ of weight (1,0) that satisfy\n\t\t\n\t\t\t\n    ξ∇_αξ∇_βσ + ı_αβσ    = 0   , \n    ξ∇_α̅τ    = 0   ,\n\n\t\t\n\twhere ξ∇_α = ∇_α + ξ_α for some gauge ξ_α∈Γ(E_α).\n\t\n\n\t\t\n\t\tWe work locally. Suppose that σ and τ solve (<ref>) and (<ref>) respectively. Then λ_α = ıσ^-1ξ∇_ασ satisfies the Webster-Weyl equation (<ref>), and so by Theorem <ref>, there exists a density σ of weight (1,0) such that\n\t\t\n    λ_α    = ı( σ^-1σ^2) ∇_α( σσ^-2)   ,\n\n\t\tand it immediately follows that\n\t\t\n    ξ_α    = ıϱ^-1∇_αϱ  ,\n\n\tWe shall now produce a CR density with the data provided.\n\t\tDefine τ' = ϱ^-1τ∈Γ(E(3,0)). Since, by assumption, (<ref>) holds, ∇_α̅τ =  ıξ_α̅τ and ∇_α̅ϱ =  ıξ_α̅ϱ, and so\n\t\t\n    ∇_α̅τ'\n    \t\t\t    = ∇_α̅( ϱ^-1τ) \n        = ( ∇_α̅ϱ^-1) τ  + ϱ^-1( ∇_α̅τ) \n        = - ıξ_α̅ϱϱ^-2τ  + ıξ_α̅ϱ^-1τ = 0   .\n\n\t\tHence, ∇_α̅τ' = 0, and thus, by Theorem <ref>, (M,H,J) is locally realisable.\n\t\t\n\t\tThe converse is immediate.\n\t\n\n\n\t\n\n§ CONFORMAL GEOMETRY\n\n\tLet (M, c) be an oriented and time-oriented conformal smooth manifold of dimension four and of Lorentzian signature (+,+,+,-). Two metrics g and g belong to the conformal class c if and only if\n\t\n    g    = ^2  φg  ,\n\n\tFollowing <cit.>, for each w ∈, there are naturally associated density bundles denoted E[w], and the Levi-Civita connection of g extends to a linear connection on E[w]. In particular, there is a one-to-one correspondence between metrics in c and sections of the bundle of conformal scales, denoted E_+[1], which is a choice of square root of E[2]. The correspondence is achieved by means of the conformal metric g, which is a distinguished non-degenerate section of ^2 T M⊗E [2]: if σ∈E_+[1], then g = σ^-2g is the corresponding metric in c. We shall refer to such a non-vanishing density as a Lorentzian scale. The Levi-Civita connection ∇ of g also preserves σ, and it follows that g is preserved by the Levi-Civita connection of any metric g in c.  We thus have a canonical identification of T M with T^* M⊗E [2] via g.\n\t\n\t\n\tWe shall often use the abstract index notation, whereby sections of T M, respectively, T^* M will be adorned with upper, respectively, lower minuscule Roman indices starting from the beginning of the alphabet, e.g.  v^a ∈Γ(T M), and ξ_a b∈Γ(⋀^2 T^* M). Symmetrisation will be denoted by round brackets, and skew-symmetrisation by square brackets, e.g. λ_[a b] = 1/2( λ_a b - λ_b a) and λ_(a b) = 1/2( λ_a b + λ_b a). In particular, we will write E_[a_1 … a_k] for the k-th exterior power of the cotangent bundle ⋀^k T^* M, and E_(a_1 … a_k) for its k-th symmetric power ^k T^* M.  Its tracefree part ^k_∘ T^* M will by denoted  E_(a_1 … a_k)_∘.\n\t\n\tBy convention, we take the Riemann tensor of a given metric g_a b in c to be defined by\n\t\n    2 ∇_[a∇_b]α_c     = - _a b^d_cα_d   ,    α_a ∈Γ(E_a[w])   .\n\n\tIt decomposes as\n\t\n    _a b c d    = _a b c d + 4 g_[a|[cΡ_d]|b]  ,\n\n\twhere _a b c d is the conformally invariant Weyl tensor and Ρ_a b the Schouten tensor, which is related to the Ricci tensor _a b = _c a^c_b and the Ricci scalar = _a^a by\n\t\n    Ρ_a b    = 1/2( _a b - /6g_a b)   .\n\n\tThe Schouten scalar is defined to be Ρ := Ρ_a bg^a b = 1/6. One construct the Cotton tensor and the Bach tensor as\n\t\n    _a b c    = 2 ∇_[bΡ_c] a  , \n    _a b    = - ∇^c_a b c + Ρ^c d_a c b d  ,\n\nrespectively. The former vanishes whenever g is an Einstein metric, while the latter is a conformally invariant obstruction to the existence of an Einstein metric. By the Bianchi identities, we have\n\t\n    _a b c = ∇^d _d a b c  .\n\n\n\tFor any two metrics g and g in c related by (<ref>), their respective Levi-Civita connections ∇ and ∇ are related by\n\n    ∇_a α_b     = ∇_a α_b + (w - 1) Υ_a α_b - Υ_b α_a + Υ_c α^c g_a b  ,    α_a ∈Γ(E_a[w])\n\nwhere Υ_a := ∇_a φ. The Schouten tensor, Schouten scalar and Cotton tensor transform as\n\n    Ρ_a b     = Ρ_a b - ∇_aΥ_b + Υ_aΥ_b - 1/2Υ^cΥ_cg_a b  ,    Ρ     = Ρ - ∇^aΥ_a - Υ^cΥ_c  , \n    _a b c    = _a b c + Υ^d _d a b c  ,\n\nrespectively. \t\n\t\n\t\n\n §.§ Non-shearing congruences of null geodesics\n\n\tWe briefly review some notions that have been introduced and studied variously in <cit.>. We shall refer to a null line distribution K on (M,c) as an optical structure, and the triple (M,c,K) as an optical geometry. The orientation and time-orientation on (M,c) induces an orientation on K. It is a subbundle of its orthogonal complement  K^⊥ with respect to c, i.e. K⊂K^⊥⊂ T M, and the screen bundle H := K^⊥ / K of K inherits a conformal structure of Riemannian signature from c.\n\t\n\tSince H has rank two it admits a bundle complex structure J, and thus a splitting ^H = H^(1,0)⊕H^(0,1) into the eigenbundles of J. One can show that there is a unique complex rank-two distribution N, totally null with respect to c, such that ^K = N∩N and N / ^K = H^(0,1). Conversely, any totally null complex rank-two distribution arises in this way. We refer to the pair (N,K) as the almost Robinson structure associated to K.\n\t\t\n\tAny non-vanishing section k of K generates a congruence of null curves K tangent to K. These curves are oriented since K is oriented. The local leaf space M of K inherits geometric structures from (M,c,K) under certain conditions. The weakest of all is when the curves of K are geodesics, that is,\n\t\t\n    _kκ  (v)      = 0   ,    v   ∈Γ(K^⊥)   .\n\n\t\twhere κ = g (k,·) for some metric g in c. This means that H descends to a rank-two distribution H on M.\n\t\t\n\tWe shall suppose that in addition,  K is non-shearing,\n\t\t that is, the conformal structure on H is preserved along the flow of k, i.e.\t\t\n    _kg (v , w )     = ϵg (v , w )    ,    v, w∈Γ(K^⊥)   ,\n\n\t\tfor some smooth function ϵ. Then H inherits a bundle conformal structure from H, and thus a bundle complex structure J. In fact, the property that K is non-shearing is equivalent to the associated almost Robinson structure (N,K) being involutive, in which case we refer to (N,K) as a Robinson structure. The subbundle H^(1,0) descends to the ı-eigenbundle H^(1,0) of J. This makes (M,H,J) a CR three-manifold.\n\t\n\t\tOur last requirement will be that K is twisting, i.e. K^⊥ is non-integrable: for any generator k and any metric g in c, the one-form κ = g (k,·) satisfies\n\t\t\n    κ ( v , w)    ≠ 0   ,    v, w   ∈Γ(K^⊥)   .\n\n\t\tBy virtue of (<ref>), the leaf space (M,H,J) of K is then a contact CR three-manifold.\n\n\nFor a congruence of null curves, the properties regarding the geodesy, shear and twist are all conformally invariant and do not depend on the choice of generator of K. The next question that we need to address is how metrics in c are related to contact forms for (M,H,J). To this end, we shall use the following canonical structures arising from our geometric setup <cit.>:\n\n\t\n  * There is a conformal subclass n.e.c of metrics in c with the property that whenever g is in n.e.c, the congruence K is non-expanding, i.e.\t\n    _kg (v , w )     = 0    ,    v, w   ∈Γ(K^⊥)   ,\n\n\tAny two metrics in n.e.c differ by a factor constant along K.\n\t\n  * From the twisting property of K, there is a distinguished generator k of K with the property that for any metric g in n.e.c, we have that\n\t\n    κ    = g(k,·) = 2 θ  ,\n\n\twhere θ is a contact form for (H,J)\n\nThanks to k and n.e.c, we obtain a `tight' relation between (M,c,K) and the leaf space (M,H,J) of K. To be precise, there is a one-to-one correspondence between metrics in n.e.c and contact forms for (H,J). Further, each metric g_θ in n.e.c associated to some contact form θ takes the form\n\n\n    g_θ    = 4 θ⊙λ + h   ,\n\nwhere h is (the metric induced from) the Levi form of θ, and λ is a unique null one-form satisfying kλ = 1. Choosing an admissible coframe (θ^α) for θ, and an affine parameter ϕ along the geodesics of k so that k=ϕ, we can write\n\n    h     = 2 h_αβ̅θ^α⊙θ^β̅  ,    λ    = ϕ̣+ λ_αθ^α + λ_α̅θ^α̅ + λ_0 θ^0   ,\n\n\nfor some complex-valued functions λ_α and λ_α̅=λ_α, and real function λ_0 on on M. Differentiation with respect to ϕ will be denoted by a dot, i.e. ḟ := _kf for any smooth tensor-valued function f on M, and this notation will be extended to tensor components.\n\nAny other choice of metric g_θ = ^φg_θ in n.e.c for some smooth function φ on M is given by\n\n    g_θ    = 4 θ⊙λ + h  ,\n\n\twhere\n\n    θ    = 1/2g_θ(k, ·) = ^φθ  , \n    h    = ^φ( h - 2 ıΥ_αθ^α⊙θ + 2 ıΥ_α̅θ^α̅⊙θ + 2 Υ_αΥ^αθ⊙θ)   , \n    λ    = λ + 1/2ıΥ_αθ^α - 1/2ıΥ_α̅θ^α̅ - 1/2Υ_αΥ^αθ  ,\n\nwith (θ^α) being admissible for (H,J,θ), and Υ_α = ∇_αφ. On the other hand, a change of affine parametrisation\n\n    ϕ↦ϕ'= ϕ - ϕ  ,\n\nfor some smooth function ϕ on M accompanied with the redefinition\n\n    λ'_α    = λ_α + ∇_αϕ  ,    λ'_0    = λ_0 + ∇_0ϕ  ,\n\npreserves the form of the metric (<ref>) and clearly the vector field k=∂/∂ϕ'.\n\nWe shall henceforth denote an optical geometry with twisting non-shearing congruence of null geodesics by the triple (M,c,k). The perturbed Fefferman spaces to be introduced in Section <ref> are a special case of these.\n\n\n\n\n §.§ Almost Einstein scales and generalisations\n\nRecall that a metric g in c is said to be Einstein if its Ricci tensor satisfies\n\n    = Λg  ,\n\nfor some constant Λ. In the context of optical geometries, one can make further definitions whereby the Einstein condition is weakened.\n\t\n\t\tLet (M,c,K) be an optical structure with associated almost Robinson structure (N,K). We say that a metric g in c is:\n\t\t\n\t\t\n  * a weakly half-Einstein metric if its Ricci tensor satisfies\n\t\t\n    _a bv^a v^b     = 0   ,\n\n\t\t\t\t\n  * a half-Einstein metric if it is weakly half-Einstein and has constant Ricci scalar curvature;\n\t\t\t\t\n  * a pure radiation metric if it is half-Einstein and the tracefree part of the Ricci tensor satisfies\n\t\t\t\t\n\t\t\t\n    κ_[a( _b] c)_∘    = 0   ,\n\n\t\ti.e.\t\t\n    _a b    = Λg_a b + Φκ_aκ_b  ,\n\n\tfor some constant Λ and smooth function Φ on M.\n\t\n\t\t\n\t\n\t\n\tFor our considerations, these conditions are somewhat too strong. For this reason, and motivated by the notion of almost pseudo-Riemannian structure in <cit.>, we make the following definition:\n\t\n\t\tLet σ be a section of E[1] with zero set Z. We say that σ is an almost Lorentzian scale if ∇_aσ≠ 0 on Z where ∇ is the Levi-Civita connection of some (and thus any) metric in c. \n\t\n\tThat this definition does not depend on the choice of metric, follows from the transformation rule ∇_aσ = ∇_aσ + Υ_aσ, and the fact that the second term vanishes on Z. The density σ defines a metric g = σ^-2g in c, but regular only off Z.\n\t\n\tFirst introduced by Gover in <cit.> — see also <cit.> — an almost Einstein scale is an almost Lorentzian scale σ that satisfies the conformally invariant equation\n\n    ( ∇_a∇_bσ + Ρ_a bσ)_∘ = 0   .\n\nIf σ has empty zero set Z, then it is referred to as an Einstein scale, and it defines a (global) Einstein metric. Otherwise, if Z is non-empty, then off Z, the metric g = σ^-2g is Einstein. A useful interpretation of Z is as the conformal infinity of some Lorentzian Einstein manifold — see <cit.> for more details.\n\n\n\nWe can readily generalise this idea to the metrics introduced in Definition <ref>.\n\t\n\tLet σ∈Γ(E[1]) on an optical geometry (M,c,K) with associated almost Robinson structure (N,K). We say that σ is \n\t\n\t\t\n  * an almost weakly half-Einstein scale if it satisfies\n\t\t\t\n    ( ∇_a∇_bσ + Ρ_a bσ)_∘ = 1/2Φ_a bσ  ,\n\n\t\t\tfor some tracefree symmetric tensor Φ_a b satisfying\n\t\t\t\n    Φ_a bv^a v^b     = 0   ,\n\n\t\t\n  * an almost half-Einstein scale if it is an almost weakly half-Einstein scale, and\n\t\t\n    Φ_a^b∇_bσ - 1/2σ∇_bΦ_a^b = 0   ;\n\n\t\t\t\n  * an almost pure radiation scale if it is an almost half-Einstein scale, and\n\t\n    Φ_a [bκ_b]  = 0   ,\n\n\t \n\t\nAll the conditions given in the above definition are conformally invariant.\n\n\tNote that condition (<ref>) is equivalent to\n\t\n    Φ_a b    = Φκ_aκ_b  ,\n\n\nThe relation between Definition <ref> and Definition <ref> is given below.\n\t\n\t\tLet (M,c,K) be a four-dimensional optical geometry, and let σ∈Γ(E[1]) so that g = σ^-2g∈c is a smooth metric off the zero set of σ. Then\n\t\t\n\t\t\t\n  * σ is an almost weakly half-Einstein scale if and only if g is a weakly half-Einstein metric;\n\t\t\t\n  * σ is an almost half-Einstein scale if and only if g is a half-Einstein metric;\n\t\t\t\n  * σ is an almost pure radiation scale if and only if g is a pure radiation metric.\n\t\t\n\t\n\t\n\t\n\t\tThroughout ∇^(g) will denote the Levi-Civita connection preserving g, so that for any other connection ∇, ∇ = ∇^(g) + Υ where Υ = σ^-1∇σ. We first prove the implication ⇒ for each of the cases, working off the zero set of σ:\n\t\t\n\t\t\t\n  * Suppose σ satisfies (<ref>). Multiplying (<ref>) through by σ^-1 and using the transformation rule for the Schouten tensor (<ref>), we find ( ^(g)_a b)_∘ = 1/2Φ_a b, and comparing (<ref>) with (<ref>) tells us that g is a weakly half-Einstein metric.\n\t\t\t\n  * Suppose that σ satisfies (<ref>) in addition to (<ref>). By case (1), we already know g is weakly half-Einstein metric. We proceed to check that its scalar curvature is constant. Multiplying (<ref>) through by σ^-1 gives the transformation rule\n\t\t\t\n    ∇^(g)_bΦ_a^b    = ∇_bΦ_a^b + 2 Υ_bΦ_a^b  .\n\n\t\t\tThe right-hand-side is zero by virtue of (<ref>). On the other hand, we have (^(g)_a b)_∘ = Φ_a b, and the contracted Bianchi identity tells us that\n\t\t\t\n    ∇_a^(g)    = 4 ∇^(g)_bΦ_a^b = 0   ,\n\n\t\t\ti.e. ^(g) is constant, which makes g a half-Einstein metric.\n\t\t\t\n  * Suppose that Φ_a b satisfies (<ref>), in addition to σ being a solution to (<ref>). Then clearly (<ref>) follows from (<ref>).\n\t\t\n\nFor the converse direction, if we assume that the metric g defined by σ is weakly half-Einstein off the zero set Z of σ, then choosing ∇ to preserve σ tells us that (<ref>) is satisfied off Z . But (<ref>) clearly holds on Z too. Thus σ is an almost weakly-Einstein scale. The remaining cases are similar.\n\t\n\t\n\t\n\n §.§ Principal null directions and Petrov types of the Weyl tensor\n\nLet (M, c,K)  be a four-dimensional optical geometry. We first assume that c is not conformally flat, i.e. the Weyl tensor  is nowhere zero. We shall adapt a number of definitions from mathematical relativity to the present setting — see <cit.> for details. We say that K is a\nprincipal null direction (PND) of the Weyl tensor  if\n\n    (k,v,k,v)     = 0   ,\n\nand it is said to be repeated if it satisfies\n\n    (k,v,k,·)     = 0   ,\n\nFurther degeneracy conditions are possible, namely,\n\t\n    (k,v,w,·)     = 0   ,    \n    (k,·,·,·)     = 0   ,\n\nIn this case, we refer to a PND K as\n\n\t\n  * simple if it satisfies (<ref>) but not (<ref>),\n\t\n  * double if it satisfies (<ref>) but not (<ref>),\n\t\n  * triple if it satisfies (<ref>) but not (<ref>),\n\t\n  * quadruple if it satisfies (<ref>) and ≠ 0.\n\n\nOn the other hand, at any point of a four-dimensional non-conformally flat Lorentzian conformal manifold (M,c), the Weyl tensor always determines at most four distinct PND, and thus locally, at most four distinct optical structures. The multiplicity of each of these PNDs form the basis of the Petrov classification of the Weyl tensor  <cit.>. We say that  is algebraically special if it admits a repeated PND, and algebraically general otherwise. In more details, now allowing for conformal flatness, it is said to be\n\n\t\n  * of Petrov type I if  does not admit any repeated PNDs,\n\t\n  * of Petrov type II if  admits a single double PND,\n\t\n  * of Petrov type D if  admits a pair of distinct double PNDs,\n\t\n  * of Petrov type III if  admits a triple PND,\n\t\n  * of Petrov type N if  admits a quadruple PND,\n\t\n  * of Petrov type O if  is identically zero.\n\nIt is a standard result that if K is a non-shearing congruence of null geodesics, then K is a PND of the Weyl tensor. Another important result is the so-called Goldberg–Sachs theorem <cit.>, which in the present context, can be formulated in these terms:\n\n\tLet (M,c) be a four-dimensional Lorentzian manifold that admits an almost Einstein scale. Then the Weyl tensor is algebraically special if and only if it admits a non-shearing congruence of null geodesics.\n\nWe omit the proof, which is similarly to that of Theorem <ref> below. There are variations of this theorem, and for our purpose, we shall need the following reformulation of a result due to <cit.>.\n\n\tLet (M,c,K) be an optical structure with non-shearing congruence of null geodesics that admits an almost weakly half-Einstein scale. Then K is a repeated PND of the Weyl tensor.\n\n\n\n\tBy hypothesis, the almost weakly half-Einstein scale σ defines a weakly half-Einstein metric g off the zero set Z of σ. By Theorem 5.9 of <cit.>, we already know that off Z, K is a repeated PND of the Weyl tensor. This property smoothly extends to Z.\n\nOf course, the Weyl tensor may degenerate further on the zero set, as will be investigated in Section <ref>.\n\nWe end this section by introducing some notation. Let (M,c,K) be an optical geometry with congruence of null curves K and associated almost Robinson structure (N,K). For a given choice of metric in c, it is convenient to choose an frame (e_0, e_α,e_α̅,e^0) adapted to (N,K), that is\n\n    g(e_0 , e^0)     = 1   ,    g(e_1 , e^1)     = 1   ,\n\nand all other pairings zero. Set\n\n    Ψ_0     := _α^0_β^0  ,    Ψ_1     := ^0_α^0_0  ,    Ψ_2     := _α 0^α 0  ,    Ψ_3     := _0 α_0^0  ,    Ψ_4 := _α 0_β 0  .\n\nWe shall now assume that K is geodesic and non-shearing (so that Ψ_0 = 0), and in addition that K is a repeated PND, so that\n\n    Ψ_0 = Ψ_1 = 0   .\n\nWe suppose further that K is non-twisting. Referring to the setup of Section <ref>, we choose two metrics g and g in n.e.c, so that the corresponding change of adapted frames induces the change\n\n    Ψ_2     = Ψ_2   ,     \t(Ψ_3)_α    = (Ψ_3)_α - 3/2ıΥ_αΨ_2   ,     \t(Ψ_4)_αβ    = (Ψ_4)_αβ + 2 ıΥ_α (Ψ_3)_β - 3/2Υ_αΥ_βΨ_2   .\n\nHere, we have adjoined abstract indices to Ψ_3 and Ψ_4 to emphasize the transformation laws.\n\nThe table below characterises the remaining possible Petrov types in terms of the Ψ_i defined in (<ref>):\n\n\n\t \n\t\tPetrov type      Conditions on Ψ_i \n [0.5ex] \n\t\tD     4 (Ψ_3)^2 - 6 Ψ_2 Ψ_4 = 0 \n \n\t\tIII     Ψ_2 = 0 \n\n\t\tN     Ψ_2 = Ψ_3 = 0 \n\n\t\tO     Ψ_2 = Ψ_3 = Ψ_4 = 0 \n\n\t\t\n\n\n\n\n\n§ THE FEFFERMAN CONSTRUCTION AND ITS VARIANTS\n\n\n\n §.§ Fefferman spaces\n\nIn this section, we follow the approach of <cit.> closely. Let (M,H,J) be a contact CR three-manifold. The bundle E(-1,0) with its zero-section removed is a principal bundle with structure group ^*, and taking its quotient by the natural _>0-action yields a circle bundle M over M. The projection from E(-1,0) with its zero section removed to M sends a density τ of weight (-1,0) to an equivalence class [τ], where τ, τ' ∈ [τ] if and only if τ = ϱτ' for some positive real function ϱ on M. Let us fix a contact form θ. We then have a natural identification of sections of M with volume-normalised densities of weight (-1,0) via (<ref>). Thus, choosing a non-vanishing section τ∈Γ(E(-1,0)) yields a trivialisation of M such that θ = ττθ, and we may define a fibre coordinate ϕ∈ [ - π, π) such that ^ıϕτ is a section of M. The Fefferman metric associated to θ is the Lorentzian metric on M given by\n\n    g_θ    = 4 θ⊙( ϕ̣+ ı/2( σ^-1∇σ - σ^-1∇σ) - 1/3Ρθ) + h   ,\n\nwhere σ = τ^-1∈Γ(E(1,0)), and h is the degenerate metric induced by the Levi form of θ. One can conveniently eliminate σ by noting that since σ determines ∇, we have that ∇(σσ) =0, i.e. σ^-1∇σ = - σ^-1∇σ. Using (<ref>), we can also easily recover the more familiar form of the Fefferman metric in terms of the connection one-form:\n\n    g_θ    = 4 θ⊙( ϕ̣+ 1/3( ıΓ_α^α - ı/2 h^αβ̅ḥ_αβ̅ - Ρθ) ) + h   .\n\nNote the following:\n\n\t\n  * Since, for any other section τ' = ^ıϕτ, the corresponding change of coordinate is ϕ' = ϕ - ϕ, the expression (<ref>) does not depend on the choice of trivialisation σ.\n\t\n  * Under a change of contact form θ = ^φθ for smooth function φ on M, the metric transforms conformally as g_θ = ^φg_θ.\n\nWe therefore have a conformal class of Fefferman metrics in c. Further, c admits a canonical conformal Killing field k, i.e. _kg = 0, namely the generator k = ∂/∂ϕ of the fibers of M→M. In fact, it is Killing for each of the Fefferman metrics in c, i.e. _kg_θ = 0 for any contact form θ for (H,J). We shall refer to (M,c,k) ⟶ (M,H,J) as the Fefferman space of (M,H,J).\n\n\n\n §.§ Perturbed Fefferman spaces\n\nWe generalise the Fefferman conformal structure as follows.\n\n\n\tLet (M,c,k) ⟶ (M,H,J) be a Fefferman space. Let ξ be a semi-basic one-form on M, that is, kξ = 0. Given a Fefferman metric g_θ in c, we define the Fefferman metric perturbed by ξ as\n\t\n    g_θ,ξ    = g_θ + 4 θ⊙ξ  .\n\n\tThis naturally extends to a conformal structure c_ξ, which we refer to as the Fefferman conformal structure perturbed by ξ, and we call ξ the perturbation one-form of (M,c,k), and the triple (M,c_ξ,k) as a perturbed Fefferman space.\n\n\nThe next straightfoward result encapsulates the issue at stake in this article.\n\n\tWith respect to the conformal structure c_ξ, the vector field k generates a twisting non-shearing congruence of null geodesics. It is conformal Killing if and only if kξ = 0.\n\n\nSince ξ lives on a circle bundle, its components can be Fourier expanded, and in fact, the Fourier coefficients should be understood as trivialised CR densities as the lemma below makes clear. Example <ref> should clarify any ambiguity in the notation adopted.\n\n\tLet (M,c_ξ,k) ⟶ (M,H,J) be a perturbed Fefferman space. For any subsets I⊂, J⊂_≥ 0, consider the tuple ( ξ^(i)_α , [∇, ξ^(j)_0] )_i ∈I, j ∈J where\n\t\n\t\t\n  * for k ∈I, ξ_α^(k)∈Γ(E_α(k2,-k2)),\n\t\t\n  * for k ∈J, [∇, ξ^(k)_0] denotes the equivalence class (∇, ξ_0^(k)) ∼ (∇, ξ_0^(k)) where ∇, ∇ are Webster connections related by ∇ = ∇ + Υ for some exact Υ, and for  k ∈I, ξ_0^(k) and ξ_0^(k) are sections of E(k2-1,-k2-1) related by\n\t\t\n    ξ^(k)_0     = ξ^(k)_0 - ıξ^(k)_αΥ^α + ıξ^(k)_α̅Υ^α̅  ,\n\n\twith the understanding that, for i ∈I, j ∈J, ξ_α̅^(i) = ξ_α^(-i), ξ_0^(j) = ξ_0^(-j). In particular ξ_0^(0) is real.\n\t\nChoose some non-vanishing σ∈Γ(E(1,0)) to trivialise M→M with fibre coordinate ϕ, and set\n\n    ξ_α^(k)    = ξ_α^(k)σ^-k2σ^k2  ,    ξ_α̅^(k)    = ξ_α̅^(k)σ^-k2σ^k2  ,    ξ_0^(k)    =  ξ_0^(k)σ^1-k2σ^1+k2  .\n\nThen, viewing\n\n    ξ_α    = ∑_k ∈Iξ_α^(k)^k ıϕ  ,    ξ_α̅    = ∑_k ∈Iξ_α̅^(-k)^-k ıϕ  ,    ξ_0    = ∑_k ∈ - J∪Jξ_0^(k)^k ıϕ  ,\n\nas components with respect to some adapted coframe (θ^0 , θ^α, θ^α̅) with θ^0 = θ = (σσ)^-1θ, the semi-basic one-form\n\n    ξ    = ξ_αθ^α + ξ_α̅θ^α̅ + ξ_0θ  ,\n\nis well-defined on M.\n\t\nConversely, any semi-basic one-form on M arises in this way.\n\n\n\n\tStarting from the CR data, we only need to check that (<ref>) and (<ref>) are well-defined. First, ξ is real by virtue of from the reality conditions on the CR data. Next, ξ does not depend on the choice of trivialisation, since under the transformation σ' = ^-ıϕσ, ϕ'= ϕ - ϕ, the relations (<ref>) tell us that the Fourier coefficients (<ref>) transform as\n\t\n    ξ'_α^(k)    = ^k ıϕξ_α^(k)  ,    ξ'_0^(k)    = ^k ıϕξ_0^(k)  .\n\n\tFinally, ξ does not depend on the choice of adapted coframe as follows from (<ref>). The converse works analogously.\n\n\n\n\n\tWe shall refer to the tuple ( ξ^(i)_α , [∇, ξ^(j)_0] )_i ∈I, j ∈J given in Lemma <ref>, where I⊂, J⊂_≥ 0, as the CR data associated to the perturbation one-form ξ.\n\n\n\n\tA perturbation one-form ξ with CR data ( ξ_α^(-2), ξ_α^(0), [∇, ξ_0^(0), ξ_0^(2)], ξ_0^(4)) means that with a choice of trivialisation σ of M with fibre coordinate ϕ, and adapted coframe (θ,θ^α, θ^α̅) with θ^0 = (σσ)^-1θ, the one-form ξ is given by\n\t\n    ξ = ( ξ_α^(0) + ξ_α^(-2)^-2ıϕ) θ^α + ( ξ_α̅^(0) + ξ_α̅^(2)^2ıϕ) θ^α̅\n    \n    \t\t+ ( ξ_0^(4)^4ıϕ + ξ_0^(2)^2ıϕ + ξ_0^(0) + ξ_0^(-2)^-2ıϕ + ξ_0^(-4)^-4ıϕ) θ\n\n\twhere ξ_α^(0) = ξ_α^(0), ξ_α^(-2) = σσ^-1ξ_α^(-2), ξ_0^(0) = σσξ_0^(0), ξ_0^(-2) = σ^2 ξ_0^(-2), ξ_0^(-4) = σ^3 σ^-1ξ_0^(-4), and similar for their complex conjugates. Note that ξ_0^(4) = ξ_0^(4) under a change of contact forms, which justifies our notation for the tuple.\n\n\n\n\n\n\n\n\n\n§ ALGEBRAICALLY SPECIAL PERTURBED FEFFERMAN SPACES\n\nIn this section and the next, we shall consider a four-dimensional optical geometry(M,c,k) ⟶ (M,H,J) with twisting non-shearing congruence of null geodesics K. We refer the reader to Section <ref> for the general setup and notation concerning these geometries. In addition, since a perturbed Fefferman metric is in particular a special case of an optical geometry with twisting non-shearing congruence of null geodesics, it will be convenient to write\n\n    g_θ,ξ    = 4 θ⊙λ + h   ,    λ    := ω_θ - 1/3Ρθ + ξ  ,\n\nwhere ω_θ is the induced Webster connection one-form on M with Schouten tensor Ρ. Just as we did in Lemma <ref>, we can Fourier expand the components of λ with respect to an adapted coframe.\n\nWe start with a technical lemma.\n\n\tLet (M,c,k) ϖ⟶ (M,H,J) be an optical geometry with twisting non-shearing congruence of null geodesics. Let g_θ∈n.e.c for some contact form θ so that it is given by (<ref>). Suppose that\n\n    λ_α    = ∑_k ∈Iλ_α^(k)^k ıϕ  ,    λ_α̅    = ∑_k ∈Iλ_α̅^(-k)^-k ıϕ  ,    λ_0    = ∑_k ∈ - J∪Jλ_0^(k)^k ıϕ  ,\n\nfor some I⊂, J⊂_≥0. Then (M,c,k) is locally conformally isometric to a perturbed Fefferman space (M',c'_ξ,k') ⟶ (M,H,J) with perturbation one-form ξ determined by the CR data (ξ_α^(i), [∇,ξ_0^(j)] )_i ∈I, j ∈J, where for each choice of trivialisation σ∈Γ(E(1,0)) of M, we have\n\n\t\n    λ_α^(0)    = ıσ^-1∇_ασ + ξ_α^(0)  ,    λ_0^(0)    = ıσ^-1∇_0σ + ξ_0^(0) - 1/3Ρ  ,    \n    λ_α^(k)    =  ξ_α^(k)  ,    λ_0^(k)    =  ξ_0^(k)  ,     k ≠ 0   .\n\n\nwhere ξ_α^(i) and ξ_0^(j) are given by (<ref>).\n\n\n\n\tSince (M,H,J) is a contact CR three-manifold, we associate to it its conformal Fefferman space (M',c',k') ϖ'⟶ (M,H,J). To the contact form θ, we have an associated Webster connection ∇ with induced connection one-form ω_θ on M', and a corresponding Fefferman metric g'_θ in c'.\n\t\n\tNext, choose a non-vanishing density σ of weight (1,0) such that θ = (σσ)^-1θ and denote by ϕ' the corresponding fibre coordinate on M' →M. The map that sends a point p in M to (ϖ(p) , ^ıϕ∘ϖ(p) σ^-1 ) in M' is a bundle map ι from (M,c,k) to (M',c',k'): clearly ϖ' ∘ι = ϖ, and any change of affine parametrisation of k of the form ϕ = ϕ - ϕ induces a change of trivialisation as σ = ^-ıϕσ, so ι does not depend on the choice of trivialisation.\n\t\n\tLet us now write\n\t\n    ω_θ    := ω_θ - ϕ̣= ıσ^-1∇σ - 1/3Ρθ  ,\n\n\tand define\n\t\n    ξ_α^(0)    = λ_α^(0) - ıσ^-1∇_ασ  ,    ξ_0^(0)    = λ_0^(0) - ıσ^-1∇_0σ + 1/3Ρ  ,    \n    ξ_α^(k)    = λ_α^(k)  ,    ξ_0^(k)    = λ_0^(k)  ,     k ≠ 0   .\n\nIt is then straightforward to check that under an affine reparametrisation of the geodesics of k and a change of contact form, the induced transformations of ξ_0^(k) and ξ_0^(k) allow us to view them as the trivialisations of some CR data (ξ_α^(i), [∇,ξ_0^(j)] )_i ∈I, j ∈J. We can therefore define a perturbation one-form ξ from this CR data, and an associated perturbed Fefferman metric\n\n    g'_θ,ξ    := g'_θ + 4 θ⊙ξ  .\n\nOne can also verify that under a change of contact form, the metrics thus constructed rescale by the same conformal factor. Checking that ι is a conformal isometry that sends each metric g_θ in n.e.c to a perturbed Fefferman metric g'_θ,ξ, is routine. In particular, ι_* k|_p = k'|_ι(p) at every point p of M.\n\n\nWe shall use Lemma <ref> in Proposition <ref>, Theorem <ref> and Proposition <ref> to relate twisting non-shearing congruences of null geodesics to perturbed Fefferman spaces. As a first step, we have:\n\n\nLet (M,c,k) ⟶ (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Let g_θ be any metric in n.ec so that it takes the form (<ref>). The following two conditions are equivalent:\n\t\n\t\t\n  * ⟨k⟩ is a repeated principal direction of the Weyl tensor , i.e. it satisfies\n\t\t\n    (k, v, k, ·)     = 0   ,\n\n\t\tso that  is of Petrov type II or more degenerate.\n\t\t\n  * The component λ_α takes the form\n\t\t\n    λ_α    = λ_α^(0) + λ_α^(-2)^-2 ıϕ  ,\n\n\tfor some (1,0)-forms λ_α^(0) and λ_α^(-2) on (M,H,J).\n\t\n\n\n\n\t\tThis is already computed in Lewandowski1990,TaghaviChabert2022. Condition (<ref>) is equivalent to Ψ_1 = 0 in the notation of Section <ref>. This can be seen to be equivalent to the second-order linear ordinary differential equation λ̈_α + 2 ıλ̇_α = 0, which has general solution (<ref>).\n\n\nApplying Lemma <ref> to a perturbed Fefferman space gives:\n\n\tLet (M,c_ξ,k) ⟶ (M,H,J) be a four-dimensional perturbed Fefferman space. Then ⟨k⟩ is a repeated PND of the Weyl tensor of c_ξ if and only if the perturbation one-form ξ is determined by some CR data ( ξ_α^(-2),  ξ_α^(0), [∇,ξ_0^(k)] )_k ∈I for some subset I⊂_≥0.\n\n\nStarting from the hypotheses of Lemma <ref>, further assumptions are needed in order to fully integrate out the dependence of the metric on the fibre coordinate. We start with a stronger constraint on the Weyl curvature.\n\n\tLet (M,c,k) ⟶ (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Suppose that ⟨k⟩ is a triple or quadruple PND of the Weyl tensor , i.e.\t\n    (k, v, w, ·)     = 0   ,\n\nso that  is of Petrov type III or more degenerate.\n\t\n\tThen (M,c,k) is locally conformally isometric to a perturbed Fefferman space (M',c'_ξ,k') ⟶ (M,H,J), and the perturbation one-form ξ is determined by the CR data (ξ_α^(0), ξ_α^(-2) , [∇, ξ_0^(0), ξ_0^(2)] ) where\n\t\n    ξ_0^(0)    = ı∇_αξ^α_(0) -   ı∇^αξ_α^(0) \n    \t\t+ 3 ξ^α_(2)ξ_α^(-2)  , \n    ξ_0^(2)    = ıξ∇_αξ^α_(2)  ,\n\nwhere ξ∇_α is the partial Webster connection gauged by ξ_α^(0).\n\n\n\nAs before, we work with a metric g_θ in n.e.c with the form (<ref>). Condition (<ref>) clearly implies (<ref>), so we know by Lemma <ref> that the component λ_α is given by (<ref>). \n\t\n\tWe proceed to show that under the assumption (<ref>), the component λ_0 takes the form\n\t\n    λ_0    = λ_0^(-2)^-2 ıϕ + λ_0^(0) + λ_0^(2)^2 ıϕ  ,\n\n\twhere λ_0^(0) and λ_0^(± 2) are smooth functions on M, with λ_0^(0) = λ_0^(0) and λ_0^(2) = λ_0^(-2). Using Appendix A of <cit.>, we compute the component Ψ_2 of the Weyl tensor, as defined in Section <ref>, under the assumption (<ref>). For convenience, we separate the real and imaginary parts of Ψ_2. We find\n\t\n    Ψ_2 + Ψ_2 = 1/6λ̈ _0 - 4/3λ_0 + 4/3ı( ∇_αλ^α_(0) -  ı∇^αλ_α^(0) + 3 λ^α_(2)λ_α^(-2)   \n    \t\t+ Ρ)  \n    \n    \t\t+  ı(   ∇_αλ^α_(2) - 2 ıλ_α^(0)λ^α_(2)) ^2 ıϕ  - ı( ∇^αλ_α^(-2) + 2 ıλ^α_(0)λ_α^(-2)) ^-2 ıϕ  ,\n\n\tand\n\t\n    ı ( Ψ_2 - Ψ_2 )    = λ̇_0 + ( ∇_αλ^α_(2) - 2 ıλ_α^(0)λ^α_(2)) ^2 ıϕ + ( ∇^αλ_α^(-2)  + 2 ıλ^α_(0)λ_α^(-2)) ^-2 ıϕ  .\n\nEach of these parts must vanish separately. Differentiating (<ref>) = 0 with respect to ϕ, and substituting the resulting expression for λ̈_0 into (<ref>) = 0, we can immediately solve for λ_0 algebraically, and find that it takes the form (<ref>), where\n\t\t\n    λ_0^(0)    = ı∇_αλ^α_(0) -   ı∇^αλ_α^(0) \n    \t\t\t+ 3 λ^α_(2)λ_α^(-2)   \n    \t\t\t+ Ρ  , \n    λ_0^(2)    = ı∇_αλ^α_(2) + 2 λ_α^(0)λ^α_(2)  .\n\nNext, we use the relations (<ref>) and the commutation relation (<ref>), multiply the resulting expressions by σσ and σ^-2 respectively, and using (<ref>), we arrive at (<ref>) and (<ref>) respectively. To complete the proof, we simply apply Lemma <ref>.\n\n\n\n\tWe note that both ξ_0^(0) and ξ_0^(2) transform as (<ref>) as required.\n\n\t\n\n\n\nIn the present context, the condition that the Weyl tensor is of Petrov type III or more degenerate has the following conformally invariant consequence:\n\n\n\t\tLet (M,c,k) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Suppose that ⟨k⟩ is a triple or quadruple PND of the Weyl tensor, i.e. (<ref>) holds.\tThen the Bach tensor satisfies (k,k) = 0.\n\n\n\n\tThis is a long and tedious computation. Details are given in Appendix <ref>. Formula (<ref>) gives (k,k) as a linear combination of the real and imaginary parts of the component Ψ_2 of the Weyl tensor and its derivatives with respect to k. The lemma follows immediately.\n\n\nThe converse of Lemma <ref> is not true in general, and this allows us to weaken the assumption of Proposition <ref>:\n\n\tLet (M,c,k) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Suppose that the Weyl tensor and the Bach tensor satisfy\n\t\n    (k, v, k, ·)     = 0   ,    \n    (k,k)     = 0   ,\n\nrespectively.\n\n\tThen (M,c,k) is locally conformally isometric to a perturbed Fefferman space (M',c'_ξ,k') ⟶ (M,H,J). More precisely, the perturbation one-form ξ is determined by the CR data(ξ_α^(0), ξ_α^(-2) , [∇,ξ_0^(0), ξ_0^(-2)], ξ_0^(-4)) where\n\n    ξ_0^(0)    = ı∇_αξ^α_(0) -   ı∇^αξ_α^(0) \n    \t+ 3 ξ^α_(2)ξ_α^(-2)  .\n\n\n\n\n\tAgain we refer to the setup given at the beginning of this section. The line of arguments follows that of the proof of Proposition <ref>. In particular, condition (<ref>) already tells us that \nλ_α is given by (<ref>). We proceed to show that condition (<ref>) forces the coefficient λ_0 to take the form\n\n    λ_0    = λ_0^(-4)^-4 ıϕ + λ_0^(-2)^-2 ıϕ + λ_0^(0) + λ_0^(2)^2 ıϕ + λ_0^(4)^4 ıϕ  ,\n\nwhere λ_0^(2k), |k|=0,1,2, are smooth functions on M, real for k=0, complex for k ≠ 0. \n\nBy Proposition <ref>, we already know that this is true with λ_0^(4) = 0 when ⟨k⟩ is a triple PND of , and Lemma <ref> tells us that this is consistent with (<ref>). Let us now assume that ⟨k⟩ is a double PND of . This means that the component Ψ_2 of  defined in (<ref>) is not zero. Using (<ref>) and (<ref>) and taking further derivatives with respect to ϕ, and plugging the resulting expressions into (<ref>), we find that condition (<ref>) is equivalent to the fourth-order linear ordinary differential equation\n\t\n    ⃜λ_0 + 20 λ̈_0 + 64 λ_0     = 64 ( ı∇_αλ^α_(0) -   ı∇^αλ_α^(0) \n    \t\t+ 3 λ^α_(2)λ_α^(-2)   \n    \t\t+ Ρ)   ,\n\n\ton λ_0. The general solution is given by (<ref>) where\n\t\n    λ_0^(0)    = ı∇_αλ^α_(0) -   ı∇^αλ_α^(0) \n    \t\t+ 3 λ^α_(2)λ_α^(-2)   \n    \t\t+ Ρ  ,\n\n\tand λ_0^(-2), λ_0^(-4) are arbitrary complex-valued functions on (M,H,J). The end of the proof is just as that of Proposition <ref>.\n\n\n\n\n§ DISTINGUISHED ALMOST LORENTZIAN SCALES\n\nIn contrast with Section <ref>, we now investigate the consequences of the existence of the distinguished almost Lorentzian scales that we introduced in Section <ref>.\n\n\tLet (M,c,k) ϖ⟶ (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Then in the neighbourhood U of any point, we can always find an almost Lorentzian scale σ∈Γ(E[1]) that satisfies \n\t\n    k^ak^b( ∇_a∇_bσ + Ρ_a bσ)     = 0   ,\n\nand whose zero set Z consists of the union of sections of ϖ: U→U := ϖ (U) ⊂M parametrised by the integers .\n\nMore specifically, there exists an affine parameter ϕ along the geodesics of k, unique up to transformations ϕ↦ϕ + k π for any k ∈ such that\n\n    Z = {ϕ = 2 k + 1/2π | k∈}  ,\n\nand a unique contact form θ for (H,J) so that\nthe metric g = σ^-2g takes the form\n\n    g    = ^2 ϕ·g_θ  ,\n\nwhere g_θ∈n.e.c is the metric associated to θ, and off Z, the Ricci tensor of g satisfies\n\n    (k,k)     = 0   .\n\nIn particular, we can write\n\n    σ    = cosϕ·σ_θ  ,\n\nwhere σ_θ is the Lorentzian scale of g_θ\n\nLocally, any almost Lorentzian scale σ on M such that the Ricci tensor of  g = σ^-2g satisfies (<ref>) arises in this way.\n\n\n\n\tIf a density σ satisfying (<ref>) exists, then off its zero set Z, the metric g = σ^-2g will satisfy (<ref>). This follows from the same argument used in the proof of Proposition <ref>. So we first show that a metric g with the required Ricci prescription exists. To this end, we may work on some open set U and assume that\n\t\n    g    = ^φg_θ  ,\n \t\n\tfor some smooth function φ on M, and where g_θ∈n.e.c for some contact form θ.  The condition that the Ricci tensor of g satisfies (<ref>) is equivalent to φ satisfying φ̈ - φ̇^2 = 1 <cit.>. On U∖Z, this has a unique solution, up to sign,\n\t\n    ^φ    = ϱ·cos(ϕ - ϕ)   ,\n\n\tfor some smooth functions ϱ and ϕ on M, where ϱ is nowhere vanishing. We can then rescale θ by ϱ, and reparametrise the geodesics of k as in (<ref>), and this allows us to define Z by (<ref>).  Then, the zero set of σ is precisely Z, and off Z, its associated metric is given by (<ref>) with Ricci tensor satisfying the required property (<ref>). Since g_θ = σ_θ^-2g for some σ_θ∈Γ(E_+[1]) is regular on U, the almost Lorentzian scale corresponding to g can be expressed by (<ref>).\n\n\n\n\n\tCondition (<ref>) is in fact conformal invariant if we restrict ourselves to conformal changes of the metric that are induced from changes of contact forms on (M,H,J) — this can be seen from the transformation law (<ref>) for the Schouten tensor. This therefore places no condition on the existence of any particular (almost) Lorentzian scales.\n\n\nSince the zero set of the density σ in Proposition <ref> is never empty, we obtain as a corollary:\n\n\tLet (M,c,k) ϖ_∘⟶ (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Then there is no global metric in c whose Ricci tensor satisfies (k,k) = 0. \n\n\n\n\nWhile g_θ in Proposition <ref> is regular on U, in general there is still no guarantee that it is periodic, which prevents us to conclude that (M, c, k) is a circle bundle. \n\nLet us now suppose that the optical geometry in Proposition <ref> is in fact a perturbed Fefferman conformal structure, which means that we work on a circle, rather than line, bundle, and as described in Section <ref>, the fibre coordinate ϕ, the contact form θ and the perturbed Fefferman metric g_θ,ξ are all determined by a choice of non-vanishing section σ∈Γ(E(1,0)). We now define σ := z σ where z = ϱ^-ıϕ with ϱ and ϕ being the functions of integrations in (<ref>). This induces a change of contact form, and thus a change of perturbed Fefferman metric g_θ,ξ, and a change of fibre coordinate. For notational convenience, we drop the hats, i.e. σ is our new density σ. Then σ is an almost Lorentzian scale given by σ = cosϕ·σ_θ, where σ_θ is the Lorentzian scale for g_θ,ξ, and it is not difficult to see that it must satisfy \n\n    k^ak^b( ∇_a∇_bσ + Ρ_a bσ)     = 0   ,\n\nby virtue of (<ref>). Finally, since the fibre coordinate ϕ lies in [-π, π), the zero set of σ is now simply the hypersurfaces ϕ = ±π/2, which, by definition of the Fefferman bundle, can be identified as the cross-sections [±ıσ] : M→M.\n\nWe can now reformulate Proposition <ref> as follows:\n\n\n\tLet (M,c_ξ,k) ϖ⟶ (M,H,J) be a four-dimensional perturbed Fefferman space. Then any choice of non-vanishing density σ of weight (1,0) on M determines an almost Lorentzian scale σ∈Γ(E[1]) on M that satisfies \n\t\t\n    k^ak^b( ∇_a∇_bσ + Ρ_a bσ)     = 0   ,\n\nand whose zero set Z of σ consists of the union Z_+ ∪Z_- of the sections Z_± = { [±ıσ^-1] : M→M} for some unique, up to sign, density σ of weight (1,0) on M.\n\nIn particular, the metric g = σ^-2g takes the form\n\n    g    = ^2 ϕ·g_θ,ξ  ,\n\nwhere g_θ,ξ is the perturbed Fefferman metric associated to the contact form θ = (σσ)^-1θ, and ϕ is the fibre coordinate determined by σ. Off Z, the Ricci tensor of g satisfies\n\t\t\n    (k,k)     = 0   .\n\n\n\tConversely, any almost Lorentzian scale σ on M satisfying (<ref>) arises from a non-vanishing density σ∈Γ(E(1,0)), unique up to sign.\n\n\n\n\tThe sign ambiguity of the density σ in Proposition <ref> is harmless since the change σ↦ -σ leaves the contact form θ unchanged, and merely interchanges the two connected components Z_+ and Z_+ of the zero set of σ.\n\n\n\n\n\n\n\n\n §.§ Almost weakly half-Einstein scales\n\nWe can proceed with a discussion of the almost Lorentzian scales introduced in Section <ref>. The next proposition is a reformulation of a classical result that has its roots in the work of Robinson, Trautman and Kerr, to name but a few, but was subsequently interpreted in the language of CR geometry in Lewandowski1990a,Hill2008.\n\n\tA four-dimensional optical geometry (M,c,k) ⟶ (M,H,J) with twisting non-shearing congruence of null geodesics admits an almost weakly half-Einstein scale if and only if (M,H,J) locally admits a CR function.\n\n\n\nIf (M,c,k) admits an almost weakly half-Einstein scale, then off its zero set Z, the Ricci tensor of the metric g = σ^-2g satisfies (<ref>). By Proposition <ref>, there exists λ_α∈Γ(E_α) that satisfies (<ref>), which is none other than the Webster–Weyl equation (<ref>). By Theorem <ref>, we can conclude that (M,H,J) admits a CR function. The converse works just analogously.\n\n\nLet us now specialise to the case where we start from a perturbed Fefferman space. This will allow us to determine the nature of the Webster–Weyl equation in this context.\n\n\tA four-dimensional perturbed Fefferman space (M,c_ξ,k) ⟶ (M,H,J) admits an almost weakly half-Einstein scale σ if and only if ξ is determined by some CR data ( ξ_α^(-2),  ξ_α^(0), [∇,ξ_0^(k)] )_k ∈I for some subset I⊂_≥0, and there exists a non-vanishing density σ∈Γ(E(1,0)) such that\n\t\t\n    ξ∇_α̅σ + 2ıξ_α̅^(2)σ = 0   , \n       ξ∇_αξ∇_βσ + ı_αβσ = 0   ,\n\n\t\twhere ξ^(-2)_α = σσ^-1ξ_α^(-2) and ξ∇_α denotes any partial Webster connection gauged by ξ_α^(0). In addition, the zero set Z of σ consists of the union Z_+ ∪Z_- of the sections Z_± = { [±ıσ^-1] : M→M}.\n\n\n\n\t\tWe have two immediate consequences of the existence of an almost weakly half-Einstein scale σ. First, by Theorem <ref>, ⟨ξ⟩ is a repeated PND of the Weyl tensor of c_ξ, and so by Corollary <ref>, the perturbation one-form ξ is determined by some CR data ( ξ_α^(-2),  ξ_α^(0), [∇,ξ_0^(k)] )_k ∈I for some subset I⊂_≥0. Second, since σ satisfies (<ref>) in particular, we have by Proposition <ref> a distinguished non-vanishing density σ such that [±ıσ^-1] are the zero set Z of σ.\tIn terms of the fibre coordinate ϕ defined by σ, the metric g = σ^-2g takes the form (<ref>). We already know that its Ricci tensor satisfies (<ref>). The remaining consequences of the condition (<ref>), i.e. (v , v ) = 0 for any v∈Γ(N) are given in Proposition <ref> as (<ref>) and (<ref>), which, using the identification (<ref>), imply\n\t\n    ξ∇_ασ +  2 ıξ_α ^(-2)σ    = 0   ,     ξ∇_αξ∇_βσ + ı_αβσ = 0   ,\n\n\trespectively. The second of these equations is just (<ref>), and since we are using the Webster connection compatible with σσ, the complex conjugate of the first is just (<ref>).\n\t\n\tFor the converse, we assume that we have the CR data as given and a density σ of weight (1,0) that satisfies (<ref>) and (<ref>). By Proposition <ref>, σ gives rise to an almost Lorentzian scale σ satisfying (<ref>) with zero set Z determined by [±ıσ^-1]. By appealing to Proposition <ref>, it is then a simple matter to check that off Z, the Ricci tensor of the metric g = σ^2g satisfies (<ref>): Choose ∇ to be compatible with θ = (σσ)^-1θ, and trivialise (<ref>) and (<ref>) to obtain (<ref>) and (<ref>) as required.\n\n\nIn two special cases, we obtain the following consequences:\n\n\tLet (M,c_ξ,k) ⟶ (M,H,J) be a four-dimensional perturbed Fefferman space.\n\t\n\t\t\n  * Suppose that ξ is determined by some CR data (ξ_α^(0), [∇,ξ_0^(k)] )_k ∈I for some subset I⊂_≥0. Then (M,c_ξ,k) admits an almost weakly half-Einstein scale σ if and only if (M,H,J) is realisable.\n\t\t\n  * Suppose that ξ is determined by some CR data (ξ_0^(k))_k ∈I for some subset I⊂_≥0. Then (M,c_ξ,k) admits an almost weakly half-Einstein scale σ if and only if (M,H,J) is CR–Einstein.\n\t \n\n\n\n\tFor the first part, (<ref>) and (<ref>), with ξ_α^(-2) = 0, are simply (<ref>) and (<ref>) respectively with τ = σ. By Theorem <ref> the result follows. For the second part, if in addition ξ_α^(0) = 0, (<ref>) and (<ref>) are the defining equations for a CR–Einstein structure — see Remark <ref>\n\n\n\nThe second part of Corollary <ref> also tells us that the underlying CR structure is flat. Weaker conditions are certainly possible if one assumes that ξ_α̅^(0) or ξ_α̅^(2) are `exact'. We leave the details to the reader.\n\n\n\n\n §.§ Almost weakly half-Einstein scales and null vacuum Maxwell two-forms\n\nDrawing from the terminology used in physics, a vacuum Maxwell two-form on a four-dimensional Lorentzian conformal manifold (M,c) is a two-form F that is both closed and co-closed, i.e.\n    F    = 0   ,    ⋆F    = 0   .\n\nHere, ⋆ is the (conformally invariant) Hodge dual operator on two-forms on M. Such a two-form will be said to be null or algebraically special if there exists a null vector field k such that\n\n    kF    = 0   ,    κ∧F    = 0   .\n\nwhere κ = g (k , · ). In this case, we shall refer to the span of k as a repeated principal null direction (PND) of F. Both (<ref>) and (<ref>) are conformally invariant.\n\nCondition (<ref>) tells us that we can write F = F^+ + F^- where F^± are simple complex two-forms satisfying F^± = F^∓ and ⋆F^± = ±ıF^±. More precisely, k defines an optical structure K := ⟨k⟩ on (M,c) with almost Robinson structure (N,K), and F^+ ∈Γ(⋀^2 (N)). By (<ref>), F^± are closed, so N is involutive, which is equivalent to k being tangent to a non-shearing congruence of null geodesics K. This is essentially the content of Mariot's Theorem <cit.>: a null vacuum Maxwell two-form locally always gives rise to a non-shearing congruence of null geodesics. In particular, the leaf space of K is a CR three-manifold (M,H,J), contact if the congruence is twisting, and by (<ref>) and (<ref>), using a suitable orientation on M, F^+ is the pull-back of a closed section of the canonical bundle of (M,H,J).\n\nThis already suggests that a converse of Mariot's Theorem will not in general be possible: starting from a twisting non-shearing congruence of null geodesics, a null vacuum Maxwell two-form would have to arise from a closed section of the canonical bundle of a contact CR three-manifold. But the existence is in general not guaranteed unless (M,H,J) is realisable. In particular, if one works in the analytic category, the CR three-manifold is certainly realisable and admits closed sections, and one can construct analytic null vacuum Maxwell two-forms. This is known as Robinson's Theorem <cit.>. Tafel <cit.> showed that Robinson's result may fail otherwise, and indeed, highlighted its failure in terms of a Lewy operator on the CR three-manifold.\n\nThe following result is a reformulation of <cit.> and <cit.>.\n\n\tLet (M,c,k) → (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Then locally c admits an almost weakly half-Einstein scale and ⟨k⟩ is a repeated PND of a null vacuum Maxwell two-form if and only if (M,H,J) is realisable.\n\n\n\n\tSuppose that (M,c, k) admits an almost weakly half-Einstein scale. Then Proposition <ref> provides a CR function and the null Maxwell two-form the closed section of the canonical bundle. By Theorem <ref>, realisability follows. The converse follows from Proposition <ref> alone.\n\n\n\n\n\n\n\n §.§ Almost half-Einstein scales\n\nOur next result is an alternative characterisation of four-dimensional optical geometries with twisting non-shearing congruence of null geodesics arising from perturbed Fefferman spaces.\n\n\tLet (M,c,k) ⟶ (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics that admits an almost half-Einstein scale σ. Then (M,c,k) is locally conformally isometric to a perturbed Fefferman space (M',c'_ξ,k') ⟶ (M,H,J) where the pertubation one-form ξ is determined by some CR data(ξ_α^(0), ξ_α^(-2), [∇ , ξ_0^(0), ξ_0^(2)], ξ_0^(4)).\n\n\n\t\nSince (M,c,k) admits an almost half-Einstein scale, ⟨k⟩ is a repeated PND of the Weyl tensor by Theorem <ref>. By Lemma <ref>, the dependence of the component λ_α on the fibre coordinate ϕ is fully determined as (<ref>). Next, off the zero set of σ, the Ricci tensor of g = σ^-2g satisfies (<ref>) and has constant Ricci scalar. Referring to Proposition <ref>, this implies that the ϕ-dependence of the component λ_0 is fully determined as the Fourier expansion (<ref>). The proof is completed by an application of Lemma <ref>.\n\n\nThe next theorem describes the CR data of the perturbation one-form alluded to in Proposition <ref>.\n\n\tA four-dimensional perturbed Fefferman space (M,c_ξ,k) ⟶ (M,H,J) admits an almost half-Einstein scale σ if and only if ξ is determined by some CR data(ξ_α^(0), ξ_α^(-2), [∇ , ξ_0^(0), ξ_0^(2)], ξ_0^(4)), and there exists a non-vanishing density σ∈Γ(E(1,0)) such that\n\t\n    ξ∇_α̅σ + 2ıξ_α̅^(2)σ = 0   , \n       ξ∇_αξ∇_βσ + ı_αβσ = 0   ,\n\n\twhere ξ^(-2)_α = σσ^-1ξ_α^(-2), ξ∇_α denotes any partial Webster connection gauged by ξ_α^(0), and\n\n\t\n    ξ_0^(0) =   ı(  ∇_αξ^α_(0) -  ∇^αξ_α^(0)) + 3 ξ_α^(-2)ξ^α_(2) + 6 ( μ) σ^-1σ^-1  , \n       ξ_0^(2) =  1/2ıξ∇_αξ^α_(2) + 2 ξ_0^(4)σ^-1σ + 2 ( μ) σ^-2  ,  \n       ξ_0^(4) =  1/2(  3/4( ∇_α( σ^-1ξ∇^ασ) + ∇^α( σ^-1ξ∇_ασ) - (σ^-1ξ∇_ασ) ( σ^-1ξ∇^ασ) ) . \n                   . - 1/2( ∇_αν^α + ∇^αν_α  - ν_αν^α) + Ρ)  σ^2 σ^-2 + ( - 1/6Λ + μ) σσ^-3  ,\n\n\nfor some real constant Λ and complex valued function μ on (M,H,J), and where ∇_α (σσ) = ν_ασσ.\n\n\t In addition, the zero set Z of σ consists of the union Z_+ ∪Z_- of the sections Z_± = { [±ıσ^-1] : M→M}. Off Z, the half-Einstein metric g = σ^-2g has Ricci scalar 4 Λ, and is given g = ^2 ϕ·g_θ, ξ, where g_θ, ξ is the perturbed Fefferman metric associated to σ and contact form θ, and ϕ the local fibre coordinate.\n\n\n\n\t Since σ is an almost half-Einstein scale, we already know by Proposition <ref> that the perturbation one-form ξ is determined by some CR data (ξ_α^(0), ξ_α^(-2), [∇ , ξ_0^(0), ξ_0^(2)], ξ_0^(4)). Further the existence of a density σ∈Γ(E(1,0)) that satisfies (<ref>) and (<ref>) is guaranteed by Theorem <ref>. To establish the precise form of the remaining densities, we look at the next relevant conditions on the Ricci curvature, which tells us by Proposition <ref> that the component λ_0 is determined by (<ref>) with (<ref>). We can rewrite the latter as\n\n    λ_0^(0)    =  ı(  ∇_αλ^α_(0) - ∇^αλ_α^(0)) + 3 λ_α^(-2)λ^α_(2)  +  Ρ + 6 ( μ)   , \n    λ_0^(2)    =  2 λ_0^(4) +  1/2ı∇_αλ^α_(2) + λ_α^(0)λ^α_(2) + 2 ( μ)   , \n    λ_0^(4)    = 1/8(   4  Ρ  + 3  ı( ∇_αλ^α_(0) -   ∇^αλ_α^(0)) - 3 λ_α^(0)λ^α_(0)  - 4/3Λ) + μ  ,\n\nfor some real constant Λ and complex valued function μ on (M,H,J). Using the relations (<ref>), these become\n\n\t\n    ξ_0^(0)    =   ı(  ∇_αξ^α_(0) -  ∇^αξ_α^(0)) + 3 ξ_α^(-2)ξ^α_(2) + 6 ( μ)   , \n    ξ_0^(2)    =  2 ξ_0^(4) +  1/2ı∇_αξ^α_(2) +  ıσ^-1ξ∇_ασξ^α_(2) + 2 ( μ)   , \n    ξ_0^(4)    = 1/2( 3/4( ∇_α( σ^-1ξ∇^ασ) + ∇^α( σ^-1ξ∇_ασ) ) . \n               . - 3/4( σ^-1ξ∇_ασ) ( σ^-1ξ∇^ασ)  - 1/3Λ  + Ρ) + μ  .\n\n\nNext, we multiply (<ref>), (<ref>) and (<ref>) through by σ^-1σ^-1, σ^-2 and σσ^-3 respectively, so that using (<ref>), we obtain (<ref>), (<ref>) and (<ref>), where we have added terms involving  ν_α = (σσ)^-1∇_α (σσ) to ensure CR invariance.\n\nThe converse is straightforward: the distinguished density σ allows us to trivialise the CR data. Choosing the Webster connection for which ν_α = 0, we can similarly trivialise equations (<ref>) and (<ref>). Again, using (<ref>), and computing the Ricci tensor, we find that the components of λ satisfy the conditions given in Proposition <ref>.\n\n\n\n\n\n\n §.§ Almost pure radiation scales\n\nWhile the Bach tensor of a conformal four-manifold is an obstruction to the existence of an almost Einstein scale, its vanishing is not necessary for the existence of an almost pure radiation scale. For our purposes, we shall need the following weaker condition.\n\n\n\tLet (M,c,k) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics that admits an almost pure radiation scale. Then ⟨k⟩ is a repeated PND of the Weyl tensor, and the Bach tensor satisfies (k,k) = 0.\n\n\n\nLet σ be an almost pure radiation scale. Then ⟨k⟩ is a repeated PND of the Weyl tensor by Theorem <ref>. Let g = σ^-2g be the pure radiation metric off the zero set of σ. By (<ref>), the Schouten tensor of g can be written as\n\n    Ρ_a b    = 1/2Φκ_aκ_b + 1/2Λg_a b  ,\n\nfor some smooth function Φ on M, constant Λ and where κ = g(k,·). By (<ref>), we must compute the expression\n\n    k^a k^b _a b    = - k^a k^b ∇^c_a b c + k^a k^b Ρ^c d_a c b d  ,\n\nThe second term of the RHS of this expression is then clearly zero, and we are left with the first term, which by the product rule, can be re-arranged as\n\n    k^a k^b ∇^c_a b c    = ∇^c( k^a k^b _a b c) - ( ∇^ck^a ) k^b _a b c - ( ∇^ck^b ) k^a _a b c  .\n\nNow, using equation (<ref>) for the definition of the Cotton tensor, the product rule and the fact that Ρ_a bk^b = 0, we  k^a k^b _a b c = 0, thus, the first term of the RHS of (<ref>) is zero. Next, using (<ref>) and substituting in (<ref>), we find ( ∇^ck^a ) k^b _a b c = 0, so that the second term of the RHS of (<ref>) vanishes, and so does the third term by the symmetries of _a b c. Hence, B(k,k) = 0 off the zero set of σ. These conformally invariant conditions extend smoothly to the zero set of σ.\n\n\n\n\n\nBy Lemma <ref> and Theorem <ref>, we immediately obtained the following corollary.\n\nLet (M,c,k)⟶ (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics that admits an almost pure radiation scale. Then it is locally conformally isometric to a perturbed Fefferman space (M',c'_ξ,k')⟶ (M,H,J) where the perturbation one-form ξ is determined by some CR data (ξ_α^(0), ξ_α^(-2) , [∇,ξ_0^(0), ξ_0^(-2)], ξ_0^(-4)) where\n\n    ξ_0^(0)    = ı∇_αξ^α_(0) -   ı∇^αξ_α^(0) \n    \t+ 3 ξ^α_(2)ξ_α^(-2)  .\n \n\n\nThe differential properties of the CR data are given next.\n\n\tA four-dimensional perturbed Fefferman space (M,c_ξ,k) ⟶ (M,H,J) admits an almost pure radiation scale σ if and only if ξ is determined by CR data(ξ_α^(0), ξ_α^(-2) , [∇,ξ_0^(0), ξ_0^(-2)], ξ_0^(-4))  and there exists a non-vanishing density σ∈Γ(E(1,0)) such that\n\t\n    ξ∇_α̅σ + 2ıξ_α̅^(2)σ = 0   , \n       ξ∇_αξ∇_βσ + ı_αβσ = 0   ,\n\n\twhere ξ^(-2)_α = σσ^-1ξ_α^(-2), ξ∇_α denotes any partial Webster connection gauged by ξ_α^(0), and\n\t\n\t\n    ξ_0^(0) = ı∇_αξ^α_(0) -   ı∇^αξ_α^(0) \t+ 3  ξ^α_(2)ξ_α^(-2)  , \n       ξ_0^(2) =  - 1/2ıξ∇^αξ_α^(-2) + 4 σσ^-1ξ_0^(-4)  , \n       ξ^(4)_0 = σ^2σ^-23/8( ∇^α( σ^-1ξ∇_ασ) + ∇_α( σ^-1ξ∇^ασ)  ) \n    \t\t- 3/8( σ^-1ξ∇_ασ) ( σ^-1ξ∇^ασ) + Ρ\n                 - 1/4( ∇_αν^α + ∇^αν_α  - ν_αν^α) + μσσ^-3  ,\n\n\n\tfor some real constant Λ and complex valued function μ on (M,H,J) satisfying μ= -μ, and where ∇_α (σσ) = ν_ασσ, and in addition\n\t\n    ξ∇_αξ_0^(4) - ( ν_α - 2 ıξ_α^(-2)) ξ^(4)_0 = 0   .\n\n\tIn addition, the zero set Z of σ consists of the union Z_+ ∪Z_- of the sections Z_± = { [±ıσ^-1] : M→M}. Off Z, σ determines a pure radiation metric g = ^2 ϕ·g_θ, ξ, where g_θ, ξ is the perturbed Fefferman metric associated to σ and contact form θ, and ϕ the local fibre coordinate. In addition, the Ricci tensor of g is given by\n\t\n    = 4 ·cos^2 ϕ·Φ·θ⊗θ + Λg  ,\n\n\tfor some density Φ of weight (-2,-2) on (M,H,J). \n\n\n\n\n\n\n Since σ is an almost pure radiation scale, and in particular, an almost half-Einstein scale, we know by Theorem <ref> that the perturbation one-form is determined by some CR data (ξ_α^(0), ξ_α^(-2), [∇ , ξ_0^(0), ξ_0^(2)], ξ_0^(4)), and that there exists a density σ∈Γ(E(1,0)) that satisfies (<ref>) and (<ref>), and ξ_0^(0), ξ_0^(2) and ξ_0^(4) must are given by (<ref>), (<ref>) and (<ref>) respectively. Referring to Proposition <ref>, in particular equation (<ref>), the next relevant conditions on the Ricci curvature tells us that (μ) = 0, which immediately gives the required expressions (<ref>), (<ref>) and (<ref>). In addition, we turn (<ref>) into (<ref>) by setting ξ_0^(4) = λ_0^(4) and λ_α = ıσ^-1ξ∇_ασ, multiplying it through by σσ^-3 and adding a term involving ν_α = (σσ)^-1∇_α (σσ) to ensure CR invariance. The converse is just as was explained in the proof of Theorem <ref>. \n \n Finally, the form of the Ricci tensor (<ref>) follows from Lemma <ref>.\n\n\n\n\n\n\n\n\tWe note that in the case where our conformal manifold is the canonical Fefferman space, equations (<ref>) and (<ref>) reduce to the CR–Einstein equations (<ref>) and (<ref>) with τ = σ, which is consistent with what is found in <cit.>.\n\n\t\n\t\n\t\n\t\n\nWe end this section by reformulating a result due to <cit.> and <cit.> regarding the connection between the realisability of the CR structure and the Petrov type II or D condition. We provide an alternative proof based on the ideas of Section <ref>.\n\n\tLet (M,c_ξ,k) → (M,H,J) be a four-dimensional perturbed Fefferman space that admits an almost pure radiation or Einstein scale. Suppose c_ξ is of Petrov type II or D but no more degenerate. Then (M,H,J) is realisable.\n\n\n\n\tSuppose that (M,c_ξ,k) admits an almost pure radiation scale. By Theorem <ref>, there exists σ∈Γ(E(1,0)) and CR data ( ξ_α^(0) , ξ_α^(-2) , [ξ_0^(0)], [ξ_0^(-2)], ξ_0^(-4)) such that (<ref>), (<ref>) and (<ref>) hold, where ∇_α (σσ) = ν_ασσ and ξ_α^(-2) = σσ^-1ξ_α^(-2). The condition that c_ξ is of Petrov II or D implies that ξ_0^(4) is not zero — see <cit.> or Proposition <ref> below. Using the definition of ν_α, (<ref>) implies\n\t\n    ξ∇_ασ - ( ν_α - 2ıξ_α^(-2)) σ    = 0   .\n\n\tHence, by (<ref>) and (<ref>), we have that \n\t\n    ξ∇_α( σ^-1ξ_0^(4))     = \t( ξ∇_ασ^-1) ξ_0^(4) + \tσ^-1( ξ∇_αξ_0^(4)) \n        = - ( ν_α - 2 ıξ_α^(-2)) σ^-1ξ^(4)_0 + ( ν_α - 2 ıξ_α^(-2)) σ^-1ξ^(4)_0 = 0   .\n\n\tChoose τ∈Γ(E(1,0)) such that τ^-3 = σ^-1ξ_0^(-4)∈Γ(E(-3,0)). Then applying Theorem <ref> proves realisability of (M,H,J).\n\n\n\n\tSuppose that (M,H,J) is realisable. Then Theorem <ref> tells us that there exists σ and τ of weight (1,0) that satisfy (<ref>) and (<ref>) for some gauge ξ_α^(0) respectively. Define ν_α by ∇_α (σσ) = ν_ασσ. Then ξ_0^(4) := στ^-3∈Γ(E(1,-3)) satisfies (<ref>). We can then define ξ^(-2)_α by (<ref>), and ξ^(0)_0 and ξ^(2)_0 by (<ref>) and (<ref>) respectively. A converse to Theorem <ref> would then boil down to whether these definitions are compatible with the remaining equation (<ref>).\n\n\n\n\n§ PROPERTIES OF THE WEYL TENSOR AND ASYMPTOTICS\n\nThe following proposition can be obtained from a brute force computation using Appendix A of <cit.>. We also recall that the definition of F_αβ̅ and F_0 α are given by (<ref>) with ξ_α^(0) and ξ_0^(0) in place of ξ_α and ξ_0.\n\nLet (M,c_ξ,k) ⟶ (M,H,J) be a perturbed Fefferman space where the perturbation one-form ξ is determined by some CR data (ξ^(-2)_α, ξ^(0)_α, [∇, ξ^(0)_0, ξ^(2)_0], ξ^(4)_0) so that ⟨k⟩ is a repeated PND of the Weyl tensor . In particular,  is algebraically special. Choose a non-vanishing density σ of weight (1,0) to trivialise M→M with fibre coordinates ϕ. Let g_θ be a perturbed Fefferman metric in c_ξ for the contact form θ = (σσ)^-1θ.  Then the Fourier expansions of the components of the Weyl tensor defined by (<ref>) are found to be\n\n\t\n    Ψ_2     = Ψ_2^(-4)^-4 ıϕ + Ψ_2^(-2)^-2 ıϕ + Ψ_2^(0)  , \n    Ψ_3     = Ψ_3^(-6)^-6 ıϕ + Ψ_3^(-4)^-4 ıϕ + Ψ_3^(-2)^-2 ıϕ + Ψ_3^(0) + Ψ_3^(2)^2 ıϕ  , \n    Ψ_4     = Ψ_4^(-8)^-8 ıϕ + Ψ_4^(-6)^-6 ıϕ + Ψ_4^(-4)^-4 ıϕ + Ψ_4^(-2)^-2 ıϕ + Ψ_4^(0) + Ψ_4^(2)^2 ıϕ + Ψ_4^(4)^4 ıϕ  ,\n\n\nfor some tensors Ψ_2^(i), (Ψ_3^(i))_α and (Ψ_4^(i))_αβ on (M,H,J) that correspond to densities\n\n    Ψ_2^(k) = σ^k2-1σ^-k2-1Ψ_2^(k)   ∈Γ(E(k2-1,-k2-1))   ,        k  = -4, -2 , 0   ,\n        (Ψ_3^(k))_α = σ^k2-1σ^-k2-1  (Ψ_3^(k))_α   ∈Γ(E_α(k2-1,-k2-1))   ,        k  = -6, -4, -2 , 0 , 2   ,\n        (Ψ_4^(k))_αβ =   σ^k2-1σ^-k2-1 (Ψ_4^(k))_αβ   ∈Γ(E_αβ(k2-1,-k2-1))   ,        k  = -8, -6, -4, -2 , 0 , 2, 4   .\n\ngiven by\n\n    Ψ_2^(-4)    =  4   ξ_0^(-4)  , \n    Ψ_2^(-2)    = ıξ∇^γξ^(-2)_γ + 2  ξ_0^(-2)  , \n    Ψ_2^(0)    = 4ı/3  F_α^α - 2 ξ^γ_(2)ξ_γ^(-2)  , \n    Ψ_3^(-6)    = - 6 ξ_α^(-2)ξ_0^(-4)  , \n    \n    Ψ_3^(-4)    = - 1/2ξ_α^(-2)Ψ_2^(-2) + 2 ıξ∇_αξ_0^(-4)  , \n    \n    Ψ_3^(-2)    = -1/4ξ∇_βξ∇^βξ_α^(-2) + 3  ı/2ξ∇_αξ_0^(-2) -ıξ∇_0ξ_α^(-2)  , \n    \n    Ψ_3^(0)    = 1/2∇_α F_β^β\n    + 3  ı/2  F_0 α \n    -3  ı/2ξ∇_βξ^β_(2)ξ_α^(-2) -ıξ∇_βξ_α^(-2)ξ^β_(2)  , \n    \n    Ψ_3^(2)    = 1/4( ξ∇_αξ∇_βξ^β_(2) - 3  ı_βαξ^β_(2))\n    +ı/2ξ∇_αξ_0^(2) \n    +2 ξ_α^(-2)ξ_0^(4)  , \n    Ψ_4^(-8)    = 6 ξ_0^(-4)ξ_α^(-2)ξ_β^(-2)  , \n    \n    Ψ_4^(-6)    = -ıξ_0^(-4)ξ∇_αξ_β^(-2) - 3  ıξ_α^(-2)ξ∇_βξ_0^(-4)  , \n    \n    Ψ_4^(-4)    = -1/2( ξ∇_αξ∇_βξ_0^(-4)\n    -3  ı_αβξ_0^(-4))\n    -ıξ_α^(-2)(  ξ∇_βξ_0^(-2) \n    - ξ∇_0ξ_β^(-2))   , \n    \n    Ψ_4^(-2)    =  -1/2( ξ∇_αξ∇_βξ_0^(-2) - 2 ı_αβξ_0^(-2))\n    +1/2ξ∇_αξ∇_0ξ_β^(-2)\n    -1/2_αβξ∇^γξ_γ^(-2)  , \n    \n    Ψ_4^(0)    = ı/2_αβ -1/2∇_α F_0β\n    +2  ıξ∇_αξ_β^(-2)ξ_0^(2)\n    +3  ıξ_α^(-2)ξ∇_αξ_0^(2)\n    -3  ı_αγξ^γ_(2)ξ_β^(-2)\n    +6 ξ_α^(-2)ξ_β^(-2)ξ_0^(4)  , \n    \n    Ψ_4^(2)    = -1/2ξ∇_αξ∇_βξ_0^(2)\n    +3  ıξ∇_αξ_β^(-2)ξ_0^(4) \n    +5  ıξ_α^(-2)ξ∇_βξ_0^(4) \n    +1/2ξ∇_γ_αβξ^γ_(2)\n    + _αβξ∇_γξ^γ_(2)  , \n    \n    Ψ_4^(4)    = -1/2( ξ∇_αξ∇_βξ_0^(4)\n    + ı_αβξ_0^(4))   .\n\n\n\n\n\tWe note that in the case of a Fefferman space, i.e. ξ =0, there is only one component left, namely, Ψ_4^(0) = ı/2_αβ where _αβ is the Cartan invariant (<ref>) obstructing CR flatness. Thus, we have that the Weyl tensor is of type N, and the Fefferman conformal structure is flat if and only if the CR structure is flat, as was already demonstrated in <cit.>.\n\n\nFrom (<ref>), under a change of perturbed Fefferman metrics (or equivalently, change of contact forms), these transform as\n\n\t\n    Ψ_2^(k)    = Ψ_2^(k)  ,       k  = -4, -2 ,     0   ,\n    \n    \t\t(Ψ_3^(k))_α    = (Ψ_3^(k))_α - 3/2ıΥ_αΨ_2^(k)  ,     k  = -6, -4, -2 ,     0 , 2   ,\n    \n    \t\t(Ψ_4^(k))_αβ    = (Ψ_4^(k))_αβ + 2 ıΥ_α (Ψ_3^(k))_β - 3/2Υ_αΥ_βΨ_2^(k)  ,     k  = -8, -6, -4, -2 ,     0 , 2, 4   .\n\n\nWe immediately obtain:\n\nLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>. Then \n    Ψ_αβ^(k)    = ∑_i,j =k( 4 (Ψ_3^(i) )_α (Ψ_3^(j))_β - 6 Ψ_2^(i) (Ψ_4^(j))_αβ)   ,     k = -12, -10, … , 4   ,\n\nare CR invariant sections of E_αβ(k-2,-k-2). Further, Ψ^(-12)_αβ=0.\n\nThe transformations (<ref>) of the densities allow us to determine which of these are CR invariant under various conformal curvature conditions such as Petrov types and so on. We have collected this information in the table below:\n\n\n\n\tInterestingly, for Petrov type II and D, the CR invariant Ψ_4^(4) is nothing but the gauged Webster–Weyl operator acting on a density of weight (1,-3), which is known to be CR invariant in the first place.\n\n\n\nAnother property easy to check is that Ψ_2^(0) is real-valued. The interpretation of its vanishing is given next.\n\n\tLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>. Then the Bach tensor satisfies (k,k) = 0 if and only if Ψ_2^(0) = 0.\n\n\n\n\tThis is immediate on comparison between the expression for Ψ_2^(0) in Proposition <ref> and (<ref>) in Theorem <ref>.\n\n\n\n\n §.§ Distinguished almost Lorentzian scales\n\nIf we now assume that the perturbed Fefferman space admits a distinguished almost Lorentzian scale as discussed in Section <ref>, the expressions for the densities of the Weyl curvature given in Proposition <ref> may simplify or vanish altogether. We shall make no attempt to provide a full account, and focus on the two specific cases below.\n\n\n  §.§.§ Almost half-Einstein scales\n\n\nLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>, and suppose it admits an almost half-Einstein scale σ. Let σ∈Γ(E(1,0)) be the unique (up to sign) non-vanishing density given in Theorem <ref>. Then\n\n    σσΨ_2^(0) - σ^2 Ψ_2^(2) + σ^-1σ^3  Ψ_2^(4)    = 0   .\n\n\n\n\nCombining (<ref>) and (<ref>), we obtain\n\n    σσ( ξ_0^(0) - ı(  ∇_αξ^α_(0) -  ∇^αξ_α^(0)) -  3 ξ_α^(-2)ξ^α_(2)) - \n    \t3 σ^2 ( ξ_0^(2) - 1/2ıξ∇_αξ^α_(2)) + 6 σ^-1σ^3 ξ_0^(4)    = 0   .\n\nHence, on comparing with the expressions for Ψ_2^(0), Ψ_2^(-2) and Ψ_2^(-4) in Proposition <ref>, we deduce (<ref>).\n\n\n\n\n\n\n  §.§.§ Almost pure radiation scales\n\n\n\nLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>, and suppose it admits an almost pure radiation scale  σ. Let σ∈Γ(E(1,0)) be the unique (up to sign) non-vanishing density given in Theorem <ref>. Then\n\n\n    Ψ_2^(0)    = 0   , \n    Ψ_2^(2)    = σ^-1σΨ_2^(4)  ,\n\n\n\n\n\nOn inspection of Ψ_2^(0), Ψ_2^(-2) and Ψ_2^(-4) in Proposition <ref>, conditions (<ref>) and (<ref>) are seen to follow from (<ref>) and (<ref>) respectively. Equation (<ref>) can also be obtained from Proposition <ref> and Lemma <ref>.\n\n\n\n\n §.§ Asymptotics\n\nWe now investigate the behaviour of the Weyl tensor on the zero set of some distinguished almost Lorentzian scale.\n\nLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>. Choose any density  σ of weight (1,0) and let σ be any almost Lorentzian scale whose zero set Z consists of the union Z_+ ∪Z_- of the sections Z_± = { [±ıσ^-1] : M→M}. Then the Weyl tensor is\n\n\t\n  * of Petrov type D or more degenerate on Z if and only if \n\t\n    ∑_k=-5^2 (-1)^kσ^-k+1σ^k+1Ψ_αβ^(2k) = 0  ;\n\n\t\n  * of Petrov type III or more degenerate on Z if and only if \n\t\n    σ^3 σ^-1Ψ_2^(-4) - σ^2 Ψ_2^(-2) +\tσσΨ_2^(0)  = 0   ;\n\n\t\n  * of Petrov type N or more degenerate on Z if and only if (<ref>) holds, and\n\t\n    - σ^4σ^-2Ψ_3^(-6)  + σ^3σ^-1Ψ_3^(-4) - σ^2Ψ_3^(-2) + σσΨ_3^(0) -  σ^2Ψ_3^(2) = 0   ;\n\n\t\n  * of Petrov type O on Z if and only if (<ref>) and  (<ref>) holds, and\n\t\n    σ^5σ^-3Ψ_4^(-8) - σ^4σ^-2Ψ_4^(-6) + σ^3σ^-1Ψ_4^(-4) - σ^2Ψ_4^(-2) + σσΨ_4^(0) - σ^2Ψ_4^(2) + σσ^3Ψ_4^(4) = 0   .\n\n\n  \n\n\nIn terms of the fibre coordinate, Z consists of the hypersurfaces ϕ = ±π/2. The expressions (<ref>) evaluated at ϕ = ±π/2 simply correspond to (<ref>), (<ref>) and (<ref>). The computation of  (<ref>) is similar.\n\n\nComparing (<ref>) from Proposition <ref> and (<ref>) from Proposition <ref>, we obtain:\n\n\tLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>, and suppose it admits an almost half-Einstein scale σ with zero set Z. Then the Weyl tensor is of Petrov type III or more degenerate on Z.\n\n\n\nLet us now delve further into the causal properties of Z. We start in greater generality by assuming the existence of an almost Lorentzian scale σ on a perturbed manifold (M,c_ξ). Then, for each choice of Levi-Civita connection ∇, we have a weighted one-form\n\n    ν_a    := ∇_aσ∈Γ( E_a[1])   .\n\nThis depends on the choice of metric in c_ξ since under a conformal change, ν_a transforms as ν_a = ν_a + Υ_aσ. However, on restriction to Z, any of these weighted forms coincides with the weighted normal covector of Z <cit.>.\n\nLet us assume further that σ is an almost half-Einstein scale. By Theorem <ref>, σ is determined by some non-vanishing σ∈Γ(E(1,0)) trivialising M→M with fibre coordinate ϕ and with contact form θ = (σσ)^-1θ, associated Fefferman scale σ_θ,ξ so that σ = cosϕ·σ_θ,ξ. Its zero set is given by Z = Z_+  ∪Z_- where Z_± = { [±ıσ^-1] : M→M}. This means two things: First, for each choice of Levi-Civita connection ∇, the weighted one-form (<ref>) reads as\n\n    ν    = - σ_θ,ξ·sinϕ·ϕ̣+ cosϕ·∇σ_θ,ξ  .\n\nSecond, we may choose our Levi-Civita connection to preserve the distinguished perturbed Fefferman scale σ_θ,ξ to single out the one-form of weight 1 and vector field of weight -1\n\n    (θ)ν    = - σ_θ,ξ·sinϕ·ϕ̣  ,    (θ)n    = g^-1 ( (θ)ν , · )   .\n\nComputing the length squared of (θ)n on restriction to Z, we find \n\n    g ((θ)n, \t(θ)n) |_Z    = -1/3Λ  .\n\nWe can then immediately reformulate a standard result of mathematical relativity Penrose1965,Penrose1986 in terms of almost half-Einstein scales:\n\n\tLet (M,c_ξ,k) ⟶ (M,H,J) be a four-dimensional perturbed Fefferman space that admits an almost half-Einstein scale σ, so that off the zero set Z of σ, the metric g = σ^-2g is half-Einstein with constant Ricci scalar 4 Λ. Then\n\t\n\t\t\n  * Z is null if and only if Λ = 0;\n\t\t\n  * Z is spacelike if and only if Λ > 0;\n\t\t\n  * Z is timelike if and only if Λ < 0.\n\t\n\n\n\n\t In general, while Z is expected to have merely a conformal, rather than metric, structure — see for instance <cit.> — in our case, by virtue of the almost half-Einstein equations, we do in fact have a distinguished regular metric on Z, namely, the perturbed Fefferman metric (<ref>) pulled back to Z:\n\t\n    g_θ,ξ |_Z    = 4 θ⊙( ı/2( σ^-1∇σ - σ^-1∇σ)  - 1/3Ρθ + ξ|_Z) + h   .\n\nThis clearly depends on the pseudo-hermitian data.\n\tProposition <ref> can also derived by computing the determinant ( .g_θ,ξ|_Z) = -4/3Λ. When (θ))n is null, it is tangent to Z and the metric g_θ,ξ is degenerate. \n\n\n\nWith this result at hand, we are now in the position of proving the following:\n\n\tSuppose (M,c_ξ,k) admits an almost pure radiation scale σ with zero set Z. Then c_ξ is conformally flat on Z.\n\n\n\n\tLet us take another covariant of the defining equation (<ref>) for σ with (<ref>) and (<ref>). Then commuting the covariant derivatives, we derive the integrability condition\n\t\n    _a b c dν^d + _c a bσ    = T_a b cσ - Φκ_cκ_[aν_b]  ,\n\nfor some tracefree tensor T_a b c regular on M, and where ν_a = ∇_aσ. We already know by Lemma <ref> that Φ = 0 on Z. Hence\n\n    _a b c dν^d     = 0   ,\n\nThere are two cases to consider:\n\n\t\n  * If Λ≠ 0, then by Proposition <ref>, Z is spacelike or timelike, and so ν_a is non-null. It is easy to verify that in dimension four, at any point, given such a non-null vector, the Weyl tensor generically takes the form _a b c d = (ν_[a_b] c d + ν_[c_d] a b)_∘ for some tracefree _a b c=_a [b c] satisfying _[a b c] = 0. Condition (<ref>) now implies that =0 on Z.\n\t\n  * If Λ = 0, then by Proposition <ref>, Z is null, and so is ν_a. Hence (<ref>) implies that ν_a is a quadruple PND of  on Z. This would mean that k degenerates to a quadruple PND of  and so would be proportional to ν^a on Z. But this is impossible since ν^a is tangent to the null hypersurface Z and k^a is transverse to it. Hence, =0 on Z.\n\nThis ends the proof.\n\n\n\nCombining Proposition <ref> and Proposition <ref>, and on inspection of Table <ref>, we have\n\t\n\t\tLet (M,c_ξ, k ) ⟶ (M,H,J) be a perturbed Fefferman space as in Proposition <ref>, and suppose it admits an almost pure radiation scale σ with zero set Z. Then\n\t\t\n\t\t\n    σ^3 σ^-1Ψ_2^(-4) - σ^2 Ψ_2^(-2)  = 0   , \n        - σ^4σ^-2Ψ_3^(-6)  + σ^3σ^-1Ψ_3^(-4) - σ^2Ψ_3^(-2) + σσΨ_3^(0) -  σ^2Ψ_3^(2) = 0   , \n       σ^5σ^-3Ψ_4^(-8) - σ^4σ^-2Ψ_4^(-6) + σ^3σ^-1Ψ_4^(-4) - σ^2Ψ_4^(-2) + σσΨ_4^(0) - σ^2Ψ_4^(2) + σσ^3Ψ_4^(4) = 0   .\n\n\t\n\t\nFollowing Penrose <cit.>, we shall call the set of equations (<ref>) the strong asymptotic Einstein condition, regardless of whether our manifold admits an almost Einstein scale or not.\n\n\n\tDrawing from <cit.>, we may think of (M,c_ξ,k) admitting a half-Einstein scale σ with zero set Z as the conformal compactification of some algebraically special optical geometry (M', g,k) with twisting non-shearing congruence of null geodesics, where M' = M∖Z and g=σ^-2g is a half-Einstein metric. We can then think of M' as the bulk of some manifold M with boundary Z, at least locally.\n\t\t\n\tNote however that these results are very much local, and assumptions on (M',g,k) such as being asymptotically simple <cit.> may be too strong. Indeed, it is demonstrated in <cit.> that this condition is too stringent in our context: the only algebraically special asymptotically simple Ricci-flat Lorentzian four-manifold is Minkowski space.\n\t\n\tNevertheless, one may assume that the geodesics of the congruence generated by k reach only some portions of conformal infinity.  One could then use the above results to describes the asymptotic properties of such spacetimes, but only along the congruence. Thus, from Proposition <ref>, we may say that the M' is asymptotically conformally flat along the geodesics of k, and by Proposition <ref>, more specifically asymptotically flat, de Sitter or anti Sitter along the geodesics of k depending on the sign of the Ricci scalar. For instance, the Taub–NUT metric <cit.> is well-known to be globally non-asymptotically flat since the topology of its conformal infinity is S^3, but it is asymptotically flat along the geodesics of its twisting non-shearing congruences of null geodesics.\n\n\n\n\n§ COMMENTS ON CONFORMAL SYMMETRIES\n\nGiven a four-dimensional perturbed Fefferman space (M,c_ξ,k) ⟶ (M,H,J), one may naturally ask how conformal symmetries of (M,c_ξ,k) relate to solutions to CR invariant differential equations on its base (M,H,J). While this question goes beyond the scope of this article, we shall nevertheless outline some ideas towards the answer.\n\nLet us first review the situation in the unperturbed case, i.e. ξ = 0. It is shown in <cit.> that the space of all conformal Killing fields on a Fefferman space (M,c,k) splits into a direct sum of three spaces\n\n    A_8 ⊕A_6 ⊕⟨k⟩  ,\n\nwhere\n\n\t\n  * any section of A_8 is transverse to ⟨k⟩^⊥ and arises from a real solution s ∈Γ(E(1,1)) of\n\t\n    ∇_α∇_β s + ı_αβ s     = 0   ,\n\n\tand such a solution gives rise to transverse infinitesimal CR symmetries as we have already seen in Section <ref>;\n\t\n  * any section of A_6 is tangent to ⟨k⟩^⊥ and arises from a solution w^α∈Γ(E^α(-1,1)) to\n\t\n    ∇^(α w^β)    = 0   ,    ∇_α w^β    = δ_α^β∇_γ w^γ  .\n\n\tIn dimension three, however, the second condition is vacuous, while the first one reduces to ∇^α w^β = 0.\n\nFor conformally flat (M,c,k), the dimensions of A_8 and A_6 are eight and six respectively, the former being the maximal dimension of the automorphism group of (M,H,J) as expected. Together with ⟨k⟩, these indeed add up to 15, the maximal dimension of the automorphism group of (M,c,k).\n\nThere are two ways in which a perturbation of (M,c,k) by a semi-basic one-form ξ affects the decomposition (<ref>): first, k itself will cease to be conformal Killing (unless kξ = 0). Second, the perturbation one-form will affect the conformal curvature, and in particular, the dimension of each summand in (<ref>) will not be preserved.\n\nSuppose that we start with a conformally flat (M,c,k). Then we end up with non-conformally flat perturbed Fefferman spaces over a flat CR manifold. To illustrate this phenomenon, and following <cit.> a flat CR three-manifold (i.e. either the Heisenberg group or three-sphere) gives rise to four distinct perturbed Fefferman spaces, each admitting an almost Einstein scale σ with zero set Z:\n\n\t\n  * the canonical conformally flat Fefferman conformal structure that contains the Minkowski metric off Z;\n\t\n  * a perturbed Fefferman conformal structure that contains the Petrov type D Taub-NUT metric Taub1951,Newman1963 off Z;\n\t\n  * a perturbed Fefferman conformal structure that contains the Petrov type N Hauser metric <cit.> off Z.\n\n\nIncidentally, since in dimension four, the `unperturbed' Fefferman conformal structure admits an almost Einstein scale if and only if it is conformally flat (or equivalently its underlying CR structure is flat), the main point of these perturbations is to enlarge the range of possible almost Einstein scales.\n\nIn fact, a conformally flat space (M,c) can be viewed as a (perturbed) Fefferman space in an `infinitely' many ways: The space of all null geodesics in M is a contact CR five-fold PN of signature (1,1), and any contact CR submanifold of PN of dimension three gives rise to a twisting non-shearing congruences of null geodesics on M. In the analytic category, the so-called Kerr theorem tells us that such CR three-manifolds can be constructed as the intersection of PN⊂^3 with a complex surface in ^3, the twistor space of (M,c) <cit.>. For instance, the `massless' Kerr metric is flat, but its underlying CR three-manifold admits a two-dimensional group of symmetry.\n\n\n\nIn  <cit.>, the authors consider algebraically special pure radiation metrics, which can therefore be treated as almost pure radiation scales on a perturbed Fefferman space, with underlying contact CR three-manifold admitting an automorphism group of submaximal dimension (in this case, three).\n\n\n\n\n\n§ ADAPTED CR COFRAMES OF THE SECOND KIND\n\nLet (M,H,J) be a contact CR three-manifold. Then any choice of non-vanishing section f_α of H^(1,0) determines a unique real non-vanishing vector field f_0 defined by the relation\n\n    [f_α, f_β̅]     = - ıδ_αβ̅f_0   .\n\nThe triple ( f_0, f_α, f_α̅) will be referred to as a adapted frame of the second kind. Its dual coframe, which we shall denote ( ω, ω^α, ω^α̅), will be refer to as adapted coframe of the second kind. The commutation relation (<ref>) is then equivalent to the structure equations\n\n    ω̣    = ıδ_αβ̅ω^α∧ω^β̅ +  ω∧( Γ_αω^α  + Γ_α̅ω^α̅)   , \n    ω̣^α    = Ξ_β^αω∧ω^β + Ξ_β̅^αω∧ω^β̅  , \n    ω^α̅    = Ξ_β̅^α̅ω∧ω^β̅ + Ξ_β^α̅ω∧ω^β  ,\n\nfor some complex-valued functions Γ_α, Ξ_β^α, Ξ_β̅^α, where Γ_α̅ = Γ_α, Ξ_β̅^α̅ = Ξ_β^α and Ξ_β^α̅ = Ξ_β̅^α. Note that by definition, (f_α) and (ω^α)  are necessarily unitary with respect to the Levi form of ω. As before, we raise and lower the indices freely using δ_αβ̅ and its inverse, i.e. v^α = δ^αβ̅ v_β̅, and so on.\n\n\nNow define\n\n    θ    = ω  ,    θ^α    = ω^α - ıΓ^αθ  ,    θ^α̅    = ω^α̅ + ıΓ^α̅θ  ,\n\nor equivalently,\n\n    ℓ    = f_0 + ıΓ^αf_α - ıΓ^α̅f_α̅  ,    e_α    = f_α  ,    e_α̅    = f_α̅  .\n\nThen (θ, θ^α, θ^α̅) is a unitary coframe of the first kind with dual (ℓ, e_α, e_α̅), and by inspection of the structure equations (<ref>) with h_αβ̅ = δ_αβ̅, we obtain the relation\n\n    Γ_α    = Γ_αβ̅^β̅  ,    Γ_α̅    = Γ_α̅β^β  , \n    Ξ_β^α    = -   Γ_0 γ^γδ_β^α -  ı e_β (Γ^α_γ^γ)    ,    Ξ_β̅^α̅    = - Γ_0 γ̅^γ̅δ_β̅^α̅ +  ı e_β̅ (Γ^α̅_γ̅^γ̅)    , \n    Ξ_β̅^α    =  ^α_β̅ -  ı e_β̅(Γ^α_γ^γ)    ,    Ξ_β^α̅    = ^α̅_β +  ı e_β (Γ^α̅_γ^γ)     .\n\n\nThe above transformation from a coframe of the second kind to a unitary coframe of the first kind is clearly invertible. In addition, any such coframe determines the non-vanishing section of the canonical bundle given by θ^0 ∧θ^1 = ω∧ω^1. Conversely, any non-vanishing local section ζ of the canonical bundle determines a unique contact form θ by the volume normalisation condition (<ref>). The remaining freedom (θ^α) is to choose the admissible coframe such that ζ = θ^0 ∧θ^1.\n\n In summary:\n\n\tLocally, there is a one-to-one correspondence between\n\t\n\t\t\n  * unitary adapted coframes of the first kind,\n\t\t\n  * adapted coframes of the second kind,\n\t\t\n  * non-vanishing sections of the canonical bundle.\n\t\n\n\n\n\n\n§ PROPERTIES OF THE BACH TENSOR\n\n\tLet (M,c,k) be an optical geometry of dimension four equipped with a twisting non-shearing congruence of null geodesics. We refer the reader to Section <ref> for the general setup induced from such a geometry, that is, we work with a metric g in n.ec. This means that κ = g(k,·) is the pull-back of a contact form on the leaf space (M, H, J) and\n\t\n    ∇_aκ_b     = τ_a b + 2 E_(aκ_b)  ,\n\n\tfor some two-form τ_a b and one-form E_a such that k^aτ_a b= k^aE_a = 0. In particular,\n\t\n    k^b∇_bκ_a    = 0   , \n    ∇^aκ_a    = 0   ,\n\n\tas expected since the geodesics of k are affinely parametrised and the congruence is non-expanding.\n\t\n\tWe assume from the outset that the Weyl tensor satisfies\n\n    (k,v,k,·)     = 0   ,\n\nwhich is equivalently to\n\n    (k,v,u,w)     = 0   ,\n\nThis can be re-expressed as k^d_d a b c = κ_aϕ_[b c] - κ_[bϕ_c] a for some ϕ_a b satisfying k^aϕ_a [bκ_c] = 0, and this tells us that\n\n    k^d_d a b ck^e_e^a b c    = 0   .\n\nIn addition, since ∇_[aτ_b c] = 0, equation (<ref>) gives\n\n    ∇_aτ_b c    = _b c^d_aκ_d + 2 τ_b cE_a + 2 ∇_[bE_c]κ_a  .\n\n\nWe are now in the position to compute, using the definition of the Bach tensor (<ref>),\n\t\n    k^a k^b\t_a b    = - k^a k^b ∇^c_a b c + k^a k^b Ρ^c d_a c b d  ,\n\nunder our given assumptions. We break down the computation of the first term of (<ref>) into a number of steps. We first note that\n\n    k^a k^b ∇^c_a b c    = \t∇^c( k^a k^b _a b c) - ( ∇^ck^a ) k^b _a b c - ( ∇^ck^b ) k^a _a b c  ,\n\nUsing (<ref>), the product rule, multiple instances of (<ref>) and the fact that ⟨k⟩ is a repeated PND of the Weyl tensor, we find\n\n    k^a k^b _a b c    = ∇^d (k^a k^b _d a b c) - 3/2τ^d bk^a _d b a c  .\n\nBy (<ref>), we get k^a k^b _a b [cκ_d] = 0.\nThis fact, together with (<ref>) and (<ref>), tells us that\n\n    ( ∇^ck^b ) k^a _a b c    = - τ^b ck^a _a b c  ,\n\nand using the fact that _[a b c] = 0,\n\n    ( ∇^ck^a ) k^b _a b c    = - 1/2τ^b ck^a _a b c  .\n\nHence, equation (<ref>) simplifies to\n\n    k^a k^b ∇^c_a b c    = \t∇^c( k^a k^b _a b c) + 3/2τ^b ck^a _a b c  .\n\nFor the last term, we obtain\n\n    τ^b ck^a _a b c    = ∇^d (τ^b ck^a _d a b c) + 2  Ρ^b dk^ck^a _d a b c - τ^d aτ^b c_d a b c  ,\n\nwhere we have used (<ref>), the product rule, equations (<ref>), (<ref>), (<ref>),  and (<ref>). Plugging this expression and (<ref>) into (<ref>) yields\n\n    k^a k^b ∇^c_a b c    = \t∇^c∇^d (k^a k^b _d a b c) + 3 ∇^d (τ^b ck^a _d a b c) + 3  Ρ^b dk^ck^a _d a b c - 3/2τ^d aτ^b c_d a b c  ,\n\nand therefore, equation (<ref>) becomes\n\n    k^a k^b\t_a b    = - ∇^c∇^d (k^a k^b _d a b c) - 3 ∇^d ( τ^b ck^a _ d a b c )  + 3/2τ^d aτ^b c_d a b c  - 2 k^a k^b Ρ^c d_a c b d  .\n\nUsing the symmetries of the Weyl tensor, and (<ref>) for the definition of Ψ_2, we find\n\n    k^a k^b _d a b c    =\n    \t- κ_d κ_c (Ψ_2 + Ψ_2)   ,    τ^b ck^a _d a b c    =\n    \t-2 ıκ_d (Ψ_2 - Ψ_2)   ,    τ^d aτ^b c_d a b c    =\n    \t- 4 (Ψ_2 + Ψ_2)   .\n\nFinally, substituting these into (<ref>) and using the product rule together with (<ref>) and (<ref>), we finally conclude \n\n    k^a k^b\t_a b    = (Ψ̈_2 + Ψ̈_2) + 6 ı (Ψ̇_2 - Ψ̇_2)  - 8 (Ψ_2 + Ψ_2)    ,\n\nwhere we have made use of the fact that Ρ^a bκ_a κ_b = 1.\n\n\n\n§ RICCI CURVATURE\n\n\tIn this section, we present some consequences of prescriptions on the Ricci curvature tensor of some metric in the conformal class presented in Section <ref>.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tLet (M,c,k) → (M,H,J) be a four-dimensional optical geometry with twisting non-shearing congruence of null geodesics. Assume further that\n\t\t\t\t\t\n\t\t\t\t\t\t\n  * (M,c,k) admits an almost pseudo-Riemann scale σ∈Γ(E[1]) that satisfies\n\t\t\t\t\t\t\n    k^ak^b( ∇_a∇_bσ + Ρ_a bσ)     = 0   ,\n\n\t\t\t\t\t\tso that by Proposition <ref>, the zero set Z is the union of sections of ϖ : U→U := ϖ (U) ⊂M parametrised by the integers , and off Z, the metric g = σ^-2g takes the form\n\t\t\t\t\t\t\n    g    = ^2 ϕ·g_θ  ,\n\n\t\t\t\t\t\twhere g_θ is a metric in n.e.c given by\n\t\t\t\t\t\t\n    g_θ    = 4 θ⊙λ + h    ,\n\n\t\t\t\t\t\tfor some contact form θ for (H,J) with Levi form h, ϕ is an affine parameter along the geodesics of K, and λ a semi-basic one-form dual to k. The Ricci tensor of g satisfies\n\t\t\t\t\t\t\n    (k,k)     = 0   .\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n  * k is a repeated PND of the Weyl tensor of c, so that by Lemma <ref>, λ is given by\n\t\t\t\t\t\t\n    λ    = ϕ̣+ ( λ_α^(0) + λ_α^(-2)^-2ıϕ) θ^α + ( λ_α̅^(0) + λ_α̅^(2)^2ıϕ) θ^α̅ + λ_0θ  ,\n\n\t\t\t\t\t\tfor some complex-valued functions λ_α^(0), λ_α^(-2) on M, and real function λ_0 on M.\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\tThen\n\t\t\t\t\n\t\t\t\t\t\n  *  (k,v) = 0 for any v∈Γ(⟨k⟩^⊥) if and only if\n\t\t\t\t\t\n    2 λ_α ^(-2)    =  λ_α^(0) =: λ_α  .\n\n\t\t\t\t\t\n  *  (w,w) = 0 for any w∈Γ(N) if and only if (<ref>) holds\n\t\t\t\t\t\n    ∇_αλ_β - ıλ_αλ_β - _αβ = 0\n\n\t\t\t\t\t\n  *  (w,w) = 0 for any w∈Γ(N)  and = 4 Λ for some real constant Λ if and only if (<ref>) and (<ref>) hold, and\n\t\t\t\t\t\t\t\n    λ_0     =  λ_0^(-4)^-4 ıϕ + λ_0^(-2)^-2 ıϕ  + λ_0^(0) + λ_0^(2)^2 ıϕ + λ_0^(4)^4 ıϕ  ,\n\n\t\t\t\t\twhere\n\t\t\t\t\t\n\t\t\t\t\t\t\n    λ_0^(0)    = ı(  ∇_αλ^α - ∇^αλ_α) + 3/4λ_αλ^α  +  Ρ  + 6 ( μ)    , \n    \n    \t\t\t\t\t\t\tλ_0^(2)    = 2 λ_0^(4) +  1/4ı∇_αλ^α + 1/2λ_αλ^α + 2 ( μ)   , \n    \n    \t\t\t\t\t\t\tλ_0^(4)    = 1/8(   4  Ρ  + 3  ı( ∇_αλ^α -  ∇^αλ_α) - 3 λ_αλ^α  - 4/3Λ) + μ  ,\n\n\t\t\t\t\t\n\t\t\t\tfor some arbitrary complex-valued function μ;\n\t\t\t\t\t\n  *  (v,w) = Λg(v,w) for any v∈Γ(⟨k⟩^⊥), w∈Γ(N)\n\t\t\t\t\tif and only if (<ref>) and (<ref>) hold, and λ_0 takes the form (<ref>) with\n\t\t\n\t\n    λ_0^(0)    =  ı(  ∇_αλ^α - ∇^αλ_α) + 3/4λ_αλ^α  +  Ρ  , \n    λ_0^(2)    =  2 λ_0^(4) +  1/4ı∇_αλ^α + 1/2λ_αλ^α  , \n    λ_0^(4)    = 1/8(   4  Ρ  + 3  ı( ∇_αλ^α -  ı∇^αλ_α) - 3 λ_αλ^α  - 4/3Λ) + μ  ,\n\n\nfor some arbitrary complex-valued function μ such that (μ) = 0.\n\t\t\t\t\t\n\t\t\t\t\t\n  *  (v,·) = Λg(v,·) for any v∈Γ(⟨k⟩^⊥) if and only if \n\t\t\t\t\t\n    ∇_αλ_0^(4) - 3  ıλ_αλ_0^(4) = 0   .\n\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\tThis is a long computation of the Ricci curvature of g based on Appendix A of <cit.>. We omit the details. Steps (<ref>) and (<ref>) are straightforward.\n\t\n\tFor step (<ref>), using our assumptions, the condition =4Λ is equivalent to λ_0 being a solution to\n\t\t\n    cos^2 ϕλ̈_0 + 6 cosϕsinϕλ̇_0 + ( 12 - 8 cos^2 ϕ) λ_0 \n    \t\t\t+ A_2 cos^2 ϕ \n    \t\t\t+ A_1 cosϕsinϕ  + A_0     = 0   ,\n\n\t\twhere\n\t\t\t\n    A_0     = -  4  Λ - 6   λ_αλ^α  ,    \n    \t\t\t\tA_1     = 3 ( ∇_αλ^α + ∇^αλ_α)   ,    \n    \t\t\t\tA_2     =  8  Ρ  + 5  ı( ∇_αλ^α - ∇^αλ_α) - 6 λ_αλ^α  .\n\n\t\tThe explicit solution is given by (<ref>) with coefficients (<ref>). We note that \nthe function μ can also be written as\n\t\t\n    μ    := 1/16( 2 ı∇^αλ_α - 4 λ_αλ^α  + c - ı b  )   ,\n\n\t\tfor some arbitrary functions b and c on M.\n\nFor step (<ref>), our next condition ^0_0 = Λ is equivalent to λ_0 being a solution to \n\t\t\n    cos^2 ϕλ̈_0 + 3 cosϕsinϕλ̇_0 +  ( 3 + 4 cos^2 ϕ) λ_0\n    \n    \t\t\t+ B_4 cos^4 ϕ  \n    \t\t\t+ A_1 cos^3 ϕsinϕ\n    \t\t\t- 1/2 A_2\tcos^2 ϕ \n    \t\t\t+ 1/4 A_0 = 0   .\n\n\t\twhere A_1, A_2 and A_3 are given by (<ref>), and\n\t\t\n    B_4     = (   3 ı(  ∇^αλ_α - ∇_αλ^α) - 12  λ_αλ^α)   .\n\n\t\tPlugging the solution (<ref>) with coefficients (<ref>) into (<ref>) tells us that the constant c given in (<ref>) is fully determined by\n\t\t\n    c     =  ı(  ∇_αλ^α - ∇^αλ_α) + 4  λ_αλ^α  .\n\n\t\tThus μ satisfies (μ) = 0, and the coefficients (<ref>) reduce to (<ref>).\n\nFinally, step (<ref>) is again, a brute force computation, involving our previous assumptions and manipulations, which eventually leads to (<ref>).\n\n\nFor the metric g to satisfy the full Einstein equations, ()_∘ = 0, we need only one more real constraint on the CR data as will be made clear from the next lemma.\n\t\n\tLet (M,c_ξ,k) → (M,H,J) be a four-dimensional perturbed Fefferman space that admits an almost pure radiation scale σ, i.e. σ satisfies (<ref>) and (<ref>) for some Φ_a b of the form (<ref>). Then Φ_a b is given by\n\t\n    Φ    = 4 cos^2 ϕ·Φ·θ⊗θ  ,\n\n\tfor some density Φ of weight (-2,-2) on (M,H,J).  In particular, Φ_a b=0 on the zero set of σ.\n\n\n\n\tWe trivialise (<ref>) where the pure radiation field is given by (<ref>) with the Lorentzian scale σ_θ, and since Υ = tanϕ ϕ̣, we find that\n\t\n    Φ̇ + 2 sinϕ·cosϕ·Φ    = 0   ,\n\n\twhich clearly has solution Φ = cos^2 ϕ·Φ, for some real function Φ on (M,H,J). By CR invariance, we must deduce that Φ arises from a density Φ of weight (-2,-2).\n\n\n\n\tWe have omitted the rather involved expression for the CR density Φ of weight (-2,-2) which determines the pure radiation field of the metric. After some work we conclude that\n\n    _0 0    = _0 0^(2)^2 ıϕ + _0 0^(-2)^-2 ıϕ  ,\n\nfor some _0 0^(2) and _0 0^(-2), for which we obtain complex expressions. Clearly, _0 0^(-2) = _0 0^(2). But since Lemma <ref> tells us that _0 0 = cos^2 ϕ·Φ for some real density of weight (-2,-2), we must conclude that _0 0^(2) = _0 0^(-2) too.\n\n\n\n\n§ RELATION TO THE DEBNEY–KERR–SCHILD METRIC\n\nIn this section, we provide the appropriate coframe and coordinate transformations to relate a perturbed Fefferman space (M,c_ξ,k) → (M,H,J) that admits an almost half-Einstein scale, to the `standard' metric of Debney1969,Stephani2003. Note that the relation between the latter and the form of the metric obtained in <cit.> is already given in <cit.>. In that reference, it is rightly pointed out that the equations on the CR base space are simplest when given in the Debney–Kerr–Schild coordinates. But these lack obvious invariance. There is therefore a trade-off when expression the Einstein equations in an invariant manner.\n\nThe reader should refer to Theorem <ref> for the notation used in the next paragraphs. Since ıσ^-1ξ∇_ασ is a solution to (<ref>), there exists, by Theorem <ref>, a density σ of weight (1,0) such that\n\n    ıσ^-1ξ∇_ασ    =  ı( σ^-1σ^2) ∇_α( σσ^-2)   ,\n\nUsing the definition of ξ∇_α and (<ref>), this allows us to express ξ_α^(0) and ξ_α^(-2) as\n\n    ξ_α^(0)    = ı( σ^-1σ^2σ) ∇_α( σσ^-2σ^-1)   , \n    ξ_α^(-2)    = ı/2( σ^-1σ^2σσ) ∇_α( σσ^-2σ^-1σ^-1)   .\n\nNote that σσ^-2σ^-1∈E(0,-2) and σσ^-2σ^-1σ^-1∈E(0,-3). Substituting these into (<ref>), we can derive similar expressions for ξ_0^(0), ξ_0^(2) and ξ_0^(4).\n\nLet us write\n\n    σ    = w σ  ,            w     = ϱ^ıϕ  ,\n\nfor some smooth real functions ϱ > 0 and ϕ∈ [-π,π). This induces a change of contact forms θ = ϱ^-2θ, and with reference to Appendix <ref>, there are unitary adapted coframes (θ,θ^1,θ^1̅) and (ω,ω^1,ω^1̅) of the first and second kinds respectively, related by\n\n    θ    = ω  ,    θ^1    = ω^1 - ıΓ^1ω  ,\n\nwhere Γ_1̅ is the connection one-form of the (partial) Webster connection preserving θ. In addition, as guaranteed by Theorem <ref>,\n\n    ω^1     = ζ̣  ,\n\nfor some CR function ζ.  We can re-express\n\n    ξ_α^(0) = 2 ıΓ_α + ı w^-1∇_α w   ,\n\nand similar formulae can be derived for the remaining CR data.\n\nWe now trivialise the Fefferman bundle with σ. This induces a change of perturbed Fefferman metrics g_θ,ξ = ϱ^-2g_θ,ξ, a change of fibre coordinates ϕ = ϕ + ϕ, and a change of λ=ω_θ + ξ as\n\n    λ    = λ - 1/2ıΥ_1θ^1 + 1/2ıΥ_1̅θ^1̅ - 1/2Υ_1Υ^1θ  ,\n\nwhere Γ_1 = ∇_1logϱ. Defining\n\n    λ_ω    = λ + 1/2ıΓ_1 ω^1 - 1/2ıΓ_1̅ω^1̅ + 1/2Γ_1 Γ^1 ω  ,\n\nwe can the write out our metric in one of the forms given in <cit.> as\n\n    g    = ^2 (ϕ - ϕ) ·ϱ^2 ·( 4 θ⊙λ_ω + 2 ω^1 ⊙ω^1̅)   ,\n\nwith some obvious changes in the notation.\n\nOur next step is to introduce a radial coordinate by the formula\n\n    r     = ϱtan (ϕ - ϕ)   ,          ϱ + ı r/√(r^2 + ϱ^2)    = ^ı (ϕ - ϕ)  ,\n\nso that\n\n    r^2 + ϱ^2     = ϱ^2 ^2 ( ϕ - ϕ)   ,    ϕ - ϕ    = 1/r^2 + ϱ^2( ϱṛ - r ϱ)   .\n\nIt is then a straightforward matter to re-express the metric in terms of the radial coordinate r. We may also check that the asymptotic properties of the `unphysical' metric g_θ, ξ as r tends to ±∞ are consistent with the findings of Section <ref>.\n\n\nTo make contact with the Debney–Kerr–Schild form of the metric Debney1969,Stephani2003, we rescale the one-forms λ and ξ as \n\n    λ'_ω    = ϱ·^2 ( ϕ - ϕ) ·λ_ω  ,    ξ'     = ϱ^2 ( ϕ - ϕ) ξ  .\n\nso that\n\n    λ'_ω    = ṛ - r ḷọg̣ϱ  + r^2 + ϱ^2/ϱ( ω_θ - 1/3Ρθ) + ξ'    ,\n\nThen the metric g takes the form\n\n    g    = 4 ϱ·ω⊙λ'_ω + 2 (r^2 + ϱ^2)  ω^1⊙ω ^1̅  .\n\nWe may also choose a transverse coordinate u and complex-valued function Z on M so that\n\n    ω = 1/2 ϱ(ụ + Z ζ̣+ Zζ)   .\n\nDropping the hats, we can now recognise metric (<ref>) given in Section <ref>.\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t"}