{"entry_id": "http://arxiv.org/abs/2303.06733v1", "published": "20230312192506", "title": "Probing the Origin of Changing-look Quasar Transitions with Chandra", "authors": ["Qian Yang", "Paul J. Green", "Chelsea L. MacLeod", "Richard M. Plotkin", "Scott F. Anderson", "Allyson Bieryla", "Francesca Civano", "Michael Eracleous", "Matthew Graham", "John J. Ruan", "Jessie Runnoe", "Xiurui Zhao"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA", "astro-ph.HE"], "text": "\n\n\n\nQian Yang\nqian.yang@cfa.harvard.edu\n\n0000-0002-6893-3742]Qian Yang\nCenter for Astrophysics | Harvard & Smithsonian, 60 Garden Street, Cambridge, MA 02138, USA\n\n0000-0002-8179-9445]Paul J. Green\nCenter for Astrophysics | Harvard & Smithsonian, 60 Garden Street, Cambridge, MA 02138, USA\n\n0000-0003-3422-2202]Chelsea L. MacLeod\nBlackSky, 1505 Westlake Ave N #600, Seattle, WA 98109, USA\n\n0000-0002-7092-0326]Richard. M. Plotkin\nPhysics Department, University of Nevada, Reno, 1664 N. Virginia St., Reno NV 89557, USA\nNevada Center for Astrophysics, University of Nevada, Las Vegas, NV 89154, USA\n\n0000-0002-6404-9562]Scott F. Anderson\nDepartment of Astronomy, University of Washington, Box 351580, Seattle, WA 98195, USA\n\n0000-0001-6637-5401]Allyson Bieryla\nCenter for Astrophysics | Harvard & Smithsonian, 60 Garden Street, Cambridge, MA 02138, USA\n\n0000-0002-2115-1137]Francesca Civano\nNASA Goddard Space Flight Center, Greenbelt, MD 20771, USA\n\n0000-0002-3719-940X]Michael Eracleous\nDepartment of Astronomy & Astrophysics and Institute for Gravitation and the Cosmos, 525 Davey Laboratory, The Pennsylvania State University, University Park, PA 16802, USA\n\n0000-0002-3168-0139]Matthew Graham\n  Cahill Center for Astronomy and Astrophysics, California Institute of Technology, 1216 E. California Boulevard, Pasadena, CA 91125, USA\n\n0000-0001-8665-5523]John J. Ruan\nDepartment of Physics and Astronomy, Bishop's University, 2600 College St., Sherbrooke, QC J1M 1Z7, Canada\n\n0000-0001-8557-2822]Jessie Runnoe\nDepartment of Physics and Astronomy, Vanderbilt University, Nashville, TN 37235, USA\n\n0000-0002-7791-3671]Xiurui Zhao\nCenter for Astrophysics | Harvard & Smithsonian, 60 Garden Street, Cambridge, MA 02138, USA\n\n\nExtremely variable quasars can also show strong changes in broad line emission strength, and are known as Changing Look Quasars (CLQs). To study the CLQ transition mechanism, we present a pilot sample of CLQs with X-ray observations both in the bright and faint states.  From a sample of quasars with bright state archival SDSS spectra and (Chandra or XMM-Newton) X-ray data, we identified five new CLQs via optical spectroscopic follow-up, and then obtained new target-of-opportunity X-ray observations with Chandra.  No strong absorption is detected in either the bright or the faint state X-ray spectra.\nThe intrinsic X-ray flux generally tracks the optical variability, and the X-ray power-law slope becomes harder in the faint state. Large amplitude mid-infrared variability is detected in all five CLQs. The changing-obscuration model is not consistent with the observed X-ray spectra and spectral energy distribution changes seen in these CLQs. It is highly likely that the observed changes are due to the changing accretion rate of the supermassive black hole, so the multiwavelength emission varies accordingly, with promising analogies to the accretion states of X-ray binaries.\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n \n\nActive galactic nuclei (AGN) are\npowered by supermassive black holes (SMBH) accreting gas, producing radiation that spans the entire electromagnetic spectrum <cit.>.  The X-ray emission comes from the hot corona <cit.> and possibly a jet <cit.>.\nIn the UV/optical, there is continuum emission from the accretion disk <cit.>, as well as broad and narrow emission lines <cit.>.\nDust in the torus is heated by the emission from the accretion disk, and re-emitted as thermal radiation in the infrared <cit.>.\n\nObservationally, AGN may be classified based on their multiwavelength characteristics.\nIn the UV/optical, there are type 1 AGN with both broad (≳ 1000   km s^-1) and narrow emission lines (≲ 1000   km s^-1); there are also type 2 AGN with only narrow emission lines <cit.>.\nIn the X-ray regime, there are unobscured AGN with N_ H < 10^22  cm^-2 and obscured AGN with N_ H≥ 10^22  cm^-2 <cit.>.\nMost type 1 AGN are X-ray unobscured and most type 2 AGN are X-ray obscured <cit.>. The canonical AGN unified model interprets that the different classes of AGN are actually the same class of object viewed at different angles <cit.>. In this model, AGN observed face-on, revealing unobscured emission both from the broad-line region and the narrow-line region, are type 1.  When viewed edge-on, the central region and broad emission line region are obscured by the dusty torus, so we observe type 2 AGN with only narrow emission lines and high intrinsic columns of dust and gas.\n\nHowever, there are some rare objects that suggest additional or complementary possibilities to this geometric model.\nSome type 2 AGN show no broad emission lines but also no detectable obscuration even in X-rays <cit.>.  Some of these “naked\" type 2 AGN, selected for lack of apparent broad emission lines but with AGN-like optical variability, do show faint broad emission line components in higher signal-to-noise ratio optical spectra <cit.>.\n\nDirect evidence that broad lines can strongly dim or even disappear in AGN leaving only narrow lines come from “changing-look AGN\" <cit.>.\nRemarkably, even the higher luminosity quasars can change between different types on timescales of a year or less.\nSuch objects exhibit large amplitude changes in luminosity, accompanied by the dramatic emergence or near disappearance of broad emission-line (BEL) components, dubbed “changing-look quasars\"\n<cit.>.\nThe “Changing-look\" phenomena were also found in z>2 quasars with dramatic changes in their  emission lines <cit.>.\nRepeat spectroscopy for large quasar samples continues to uncover this rare and remarkable phenomenon in regimes of luminosity and redshift that now overlap the huge cosmological samples of quasars of the Sloan Digital Sky Survey <cit.>.\n\nThe discovery of CLQs profoundly affects many areas of astrophysics, including our understanding of quasar duty cycles <cit.> and galaxy evolution <cit.>, through distinct feedback processes in states of high and low accretion rate <cit.>.\nRapid swings in SMBH accretion rate may also explain the complex AGN/star-formation connection <cit.>, and help reconcile cosmological simulations with the observed prevalence of ionized intergalactic medium or “AGN proximity zone fossils\" <cit.>. This scientific interest explains why CLQs have been ardently sought in the last few years, resulting in at least 80 now known <cit.>.\n\nSeveral explanations for the strong and relatively rapid luminosity and BEL changes have been proposed.\nThe first direct explanation is the changing obscuration due to moving clouds crossing over our line of sight. The term “changing-look\" was originally used in X-ray, when objects' X-ray spectra show absorption changing between Compton thick and Compton thin.  Absorption changes are a widely accepted explanation for X-ray changing-look events <cit.>. Clouds in the broad-line region (BLR) or torus may plausibly eclipse the much smaller X-ray emission region <cit.>.\nHowever, the crossing time for intervening clouds orbiting outside the BLR is too long <cit.> compared to observed CLQ transition timescales.\nA tidal distruption event (TDE), in which a star is disrupted by and accretes onto a SMBH, is also a  mechanism for strong, rapid variability.  However, TDEs can only explain a few turn-on CLQ cases <cit.>, and TDE flares are inconsistent with most CLQ lightcurve shapes and bright state durations <cit.>.  Large accretion rate changes seem the most likely explanation as suggested by recent work <cit.>.\nHowever, for major accretion rate changes, the radial inflow timescales <cit.> are inconsistent with the observed transition timescale of CLQs - from a few months to decades <cit.>.\n\nStrong accretion state transitions are also seen in X-ray observations of the\nGalactic X-ray binaries <cit.>,\nsuggesting analogies between AGN and XRB accretion <cit.>.\nWhile typical BH accretion regions cannot yet be spatially\nresolved, temporal changes in XRB spectral states have gone a\nlong way to unravel the accretion physics in XRBs, and suggest\npowerful theoretical and observational analogies to AGN and quasars\n<cit.>. However, mass scaling from XRBs to SMBHs\n<cit.> suggests  timescales\n(∼10^ 4-7 yr) for quasar accretion state transitions\nthat far exceed a human lifetime. CLQ transition timescales do not scale as expected from XRBs <cit.>. Thus, large spectral state changes in quasars challenge and invigorate debates both about accretion theory and the nature of historical quasar classes <cit.>.   Some recent studies suggest that the timescale problem can be qualitatively alleviated when taking the large-scale magnetic field into account <cit.> or considering  accretion disk instabilities <cit.>.\n\nComparison of multiwavelength observations before and after a transition is needed\nto test different models of CLQs. With X-ray spectra in both states, we can detect changes in obscuration or in X-ray spectral power-law slopes.\nX-ray spectral shape variations were observed in a handful of CL AGN at lower luminosities (Seyfert galaxies), including Mrk 1018 <cit.>, Mrk 590 <cit.>, NGC 1566 <cit.>, and 1ES 1927+65 <cit.>.\nHardening of the X-ray-to-UV spectrum of the fading CL AGN Mrk 1018 suggests accretion state transitions similar to XRBs <cit.>.  Mrk 1018 also shows evidence that both X-ray photon index and α_ OX, similar to some XRBs, exhibit V-shape correlations in a single AGN <cit.>.\n In comparison to quasars, however, these AGN tend to have ∼10-100 times lower SMBH masses, high Eddington ratios, and unusual, X-ray bright spectral energy distributions.\n\nThe first CLQ, SDSS J015957.64+003310.5 (hereafter, J0159), discovered by <cit.> is an X-ray selected AGN, and there are serendipitous X-ray observations: XMM-Newton observation in its bright state and Chandra observation in its faint state. <cit.> analyzed its X-ray spectra and found its X-ray flux dropped by a factor of 7 with no change in absorption.\n<cit.> analyzed the X-ray data of a CLQ, SDSS J155258+273728 (hereafter, J1552) discovered by <cit.>, and found the absorption in X-ray is moderate and stable, and the X-ray spectrum becomes harder in the bright state, with an Eddington ratio being lower than a few percent. They found that the CL AGN and CLQ with X-ray observations in both states follow a “V\"-shaped correlation: above a critical turnover luminosity the X-ray spectra is softer when brighter, and below the critical luminosity the trend is reversed  as harder when brighter.  <cit.> obtained Chandra X-ray observations of five CLQs,\nand found consistency with accretion state transitions in prototypical X-ray binary outbursts, as well as a possible V-shaped correlation for the UV-to-X-ray spectral index with an inversion at a critical Eddington ratio of ∼ 10^-2. However, for those five CLQs only\nROSAT All-Sky Survey measurements are available for the bright state, yielding\nupper limits on the bright-state X-ray luminosity (and thus lower limits on α_ OX).\n<cit.> performed Chandra observations for ten CLQs and further investigated the similarities between AGN and XRBs. However, among these ten CLQs, only two (J2252 and J2333) had archival XMM-Newton X-ray detections in their former bright states; there are again only upper limits on the bright-state X-ray luminosity (and thus lower limits on α_ OX) for the remaining eight CLQs, preventing much analysis of changes in obscuration or X-ray spectral power-law slopes for CLQs.\n\nTo test the different models of CLQs, probe the structure of AGN, and the accretion processes of SMBHs, we pursue the study of CLQs with X-ray observations in both states.\nIn this work, we present a pilot sample of five new CLQs with X-ray observations in both states.\nOur sample doubles the size of optical spectroscopic confirmed CLQs[Here for clarity, CLQs are AGN with L_ bol≳ 10^45 erg  s^-1 in the bright state.] with X-ray observations in both states.\nThe five new CLQs are SDSS J020621.67-060952.7 (hereafter, J0206) at z = 0.413, SDSS J022429.10-091851.7 (hereafter J0224) at z = 0.357, SDSS J082905.98+420204.3 (hearafter J0829) at z=0.638, SDSS J122638.66-001114.0 (hearafter J1226) at z=0.642, and SDSS J133806.59-012412.8 (hearafter J1338) at z=0.452.\n\nThis paper is organized as follows. We present target selection, data, and reduction in Section 2. In Section 3, we describe the data analysis methods, including optical spectral fitting, X-ray spectral analysis, and SED fitting. Results and discussions are in Section 4 and 5, respectively. We summarize the paper in Section 6. Throughout this paper, we adopt a standard ΛCDM cosmology with Ω_Λ=0.7, Ω_m=0.3, and H_0=70 km s^-1 Mpc^-1.\n\n\n\n§ SELECTION, DATA, AND REDUCTION\n \n\n\n §.§ CLQ Target Selection\n\nWe selected candidates from the SDSS quasar catalogs <cit.>, applying a redshift limit of z < 0.9 to keep Hβ within the SDSS spectral range.\nRadio-detected objects were excluded using the FIRST survey <cit.>, since jet-dominated emission in the bright state and its variability would complicate our interpretations. \nTo study CLQs in both states, we required existing archival XMM-Newton  or Chandra observations close in time to the SDSS spectroscopic observations.\nFor these X-ray observed quasars, we compiled optical light curves from multiple imaging surveys (see §<ref>), and selected CLQ candidates with a large-amplitude optical variability, specifically |Δ g | > 1 mag and |Δ r | > 0.5 mag (as described in ), comparing the latest available epoch to its bright state.\n\nWe performed spectroscopic follow-ups using 6-8 m telescopes (§<ref>) as the CLQ candidates dramatically faded in the optical. Once we confirmed with a follow-up optical spectrum a 3σ fading of the broad Hβ flux, we triggered a Chandra X-ray Target of Opportunity (ToO) observation (§<ref>), as well as radio observations with the  Karl G. Jansky Very Large Array (VLA) (§<ref>). We summarize the five CLQs observed in Table <ref>.\n\nlccccl\nChanging-look Quasars \n1pt\n\nFull Name    \nShort Name    \nRA    \nDecl.    \nRedshift\n\nSDSS J020621.67-060952.7     J0206     02:06:21.67     -06:09:52.70     0.413 \n\nSDSS J022429.10-091851.7     J0224     02:24:29.10     -09:18:51.70     0.357 \n\nSDSS J082905.98+420204.3     J0829     08:29:05.98     +42:02:04.30     0.638 \n\nSDSS J122638.66-001114.0     J1226     12:26:38.66     -00:11:14.06     0.642 \n\nSDSS J133806.59-012412.8     J1338     13:38:06.59     -01:24:12.84     0.452 \n\n\n\n\n\n\n\n §.§ Optical Imaging Data\n \nWe used multiple public available optical imaging surveys, including the SDSS imaging survey <cit.>, the Pan-STARRS1 <cit.>, the Palomar Transient Factory survey <cit.>, and the Zwicky Transient Facility survey <cit.>. We compiled g- and r-band light curves from these surveys, using the point-spread function (PSF) magnitudes. For objects without recent public ZTF photometric data, we performed imaging observations in g and r bands using the 1.2 meter telescope at the Fred Lawrence Whipple Observatory (FLWO) on Mount Hopkins in Arizona.\n\nTo calibrate the optical data from different surveys onto the same flux scale for light-curve plotting, we applied corrections to account for different filter curves. We convolved each quasar spectrum with the PS1, PTF, ZTF, and FLWO filter curves to obtain synthetic magnitudes, and derived the magnitude offsets, typically ∼ 0.02 (0.09) mag in g (r) band between similar filters from different surveys.  We used these offsets to calibrate all optical magnitudes to SDSS filter system magnitudes for the purposes of light-curve plotting.\n\nWe also used the Catalina Real-time Transient Survey <cit.>. The CRTS photometric data are unfiltered, so we applied a constant offset to match the contemporaneous the r-band light curve described above.  We describe photometric data we used for spectral energy distributions (SEDs) in §<ref> and summarize the photometric data in Table <ref>.\n\nWe corrected the Galactic extinction using the dust reddening map of <cit.> and the reddening law in <cit.>. The typical E(B-V)_ SFD for the five CLQs is 0.02 mag.\n\nWe computed the extinction coefficients for the surveys we used in this work (see more details in Appendix §<ref>). We adopt a R_V=3.1, which is the traditional value of R_V in the diffuse interstellar medium <cit.>.\n\n\n\n\n\n §.§ Optical Spectroscopic Observations\n \nFor the bright-state, we use the SDSS spectra, taken by the Sloan Foundation 2.5 m telescope <cit.> at Apache Point Observatory.\nThe spectra are from the SDSS-I/II, with a wavelength coverage of 3800-9100, and the Baryon Oscillation Spectroscopic Survey <cit.> spectrograph of the SDSS-III <cit.>, with a wider wavelength coverage of 3600-10400 <cit.>.\nThe SDSS spectral resolution is 1500 at 3800 and 2500 at 9000.\n\nWe obtained optical spectroscopic follow-ups for CLQ candidates in the faint states, using the MMT, Gemini, and Magellan telescopes. Observations were carried out over several dates from 2017 to 2020. Table <ref> summarized the spectroscopic observation information, including telescope, grating, and exposure time.\n\nThe MMT telescope is a 6.5 meter MMT telescope on Mount Hopkins in Arizona. J1338 was observed with the Blue Channel Spectrograph using a grating 300 lines/mm, with a resolution of 6.47 and a wavelength coverage of 5268. For the other four targets, we used the Binospec Spectrograph with a grating 270 lines/mm with a resolution of 1340 and wavelength coverage of 3900-9240.\n\nThe Gemini Observatory consists of twin 8.1-meter diameter telescopes, Gemini North and Gemini South, which are located at two separate sites on Maunakea in Hawaii and Cerro Pachón in Chile, respectively. We obtained Gemini North observations\nfor J0206 to cover the Hβ and Hα emission lines, simultaneously. We used the Gemini Multi-Object Spectrograph (GMOS-N) with the R400 grating (400 lines/mm), with a resolution of 1918 and wavelength coverage of 416 nm.\n\nThe 3.5m telescope at the Apache Point Observatory (APO) is located in the Sacramento Mountains in Sunspot in New Mexico, United States. We used the Double Imaging Spectrometer (DIS), which is a medium dispersion spectrograph with separate red and blue channels. In the blue (red) channel, we used the B400 (R300) grating 400 (300) lines/mm with a wavelength coverage of 3660 (4620) . Soon after our initial follow-up MMT observations confirmed J1338 to be a CLQ in the faint state, it re-brightened, as confirmed using the APO 3.5m telescope after our Chandra observations.\n\nThe Magellan Telescopes are a pair of 6.5 meter telescopes located at Las Campanas Observatory in Chile. We used the Inamori Magellan Areal Camera and Spectrograph (IMACS) on the Baade telescope with a grating 300 lines/mm, with a wavelength coverage of 3650-9740.\nWe used the Magellan Baade telescope to observe J1338 a few months after Chandra observations.\n\nThe spectra were reduced using standard [IRAF is distributed by the National Optical Astronomy Observatory, which is operated by the Association of Universities for Research in Astronomy (AURA) under cooperative agreement with the National Science Foundation.] routines <cit.>. Since flux calibrations from the follow-up spectra were not always reliable, we normalized the spectra to the earlier SDSS spectrum assuming a constant narrow emission line luminosity (described in §<ref>).\n\nAll the spectra of the five CLQs are shown in Figure  <ref>. The spectra in black are earliest SDSS spectra in the bright states. The spectra in red are our follow-ups in the faint state. For some of them, there are intermediate spectra (green and orange) observed by SDSS or our follow-ups.\n\ncccccccl\nSpectroscopic Observations \n1pt\n\nName    \nMJD    \nDate    \nTelescope    \nSpectrograph    \nGrating    \nExpTime    \nState \n\n    day                 lines/mm     second    \n\n\nJ0206     56660     2014-01-03     SDSS     ⋯     ⋯     ⋯     Bright \n\n\nJ0206     58431     2018-11-09     MMT     Binospec     270     2000     Faint \n\n\nJ0206     58507     2019-01-24     Gemini     GMOS-N     400     3000     Faint2 \n\n\n\nJ0224     51908     2000-12-30     SDSS     ⋯     ⋯     ⋯     Bright \n\n\nJ0224     59145     2020-10-23     MMT     Binospec     270     1800     Faint \n\n\n\nJ0829     55513     2010-11-13     SDSS     ⋯     ⋯     ⋯     Bright \n\n\nJ0829     58866     2020-01-18     MMT     Binospec     270     2700     Faint\n\n\n\nJ1226     51990     2001-03-22     SDSS     ⋯     ⋯     ⋯     Bright \n\nJ1226     54153     2007-02-22     SDSS     ⋯     ⋯     ⋯      Intermediate \n\n\nJ1226     58574     2019-04-01     MMT     Binospec     270     3200     Faint \n\n\nJ1338     52427     2002-06-02     SDSS     ⋯     ⋯     ⋯     Bright \n\n\nJ1338     57818     2017-03-06     MMT     Blue Channel     300     1800     Faint \n\n\nJ1338     57891     2017-05-18     APO 3.5m     DIS     Blue 400 (Red 300)     900     Intermediate\n\nJ1338     58162     2018-02-13     Magellan     IMACS     300     1800     Intermediate2 \n\n\n\nDate is in format of year-month-day.\nExpTime stands for “Exposure Time\".\n\n\n\n\n\n §.§ X-ray Observations\n \nWe used archival X-ray observations close in time to the optical spectra from the Chandra Source Catalog <cit.> or the XMM-Newton serendipitous survey <cit.>.\nFor X-ray observed CLQ candidates confirmed as CLQs by optical follow-up spectra,  we obtained Chandra ToO observations.\nOur Chandra observations were triggered shortly after our optical spectroscopic follow-ups. The targets were observed using the Advanced CCD Imaging Spectrometer (ACIS) detector <cit.>.  The X-ray observations are listed in Table <ref>.\n\nFour of the CLQ candidates were thereby observed in X-rays in both bright and faint states.  However, J1338 is a special case.\nIn March 2017 (MJD 57818), we obtained an optical spectrum of the XMM-Newton source and CLQ candidate J1338, for which analysis showed that the Hβ broad line had vanished at ≥ 3σ significance with respect to the earlier SDSS spectrum.  Shortly afterward, we began monitoring the source with the 1.2m at FLWO, which confirmed the object to be in the faint state according to the g-band magnitude. We triggered the Chandra observation in mid-April, but it was observed by Chandra about 3 weeks later, during which we saw an unexpected ∼1 mag brightening in the g-band. The resulting Chandra spectrum showed a bright unobscured, normal AGN power law slope, as expected after its re-brightening.  Just after the Chandra observation, we obtained an optical spectrum with the 3.5m at Apache Point Observatory in June that showed significant broad Hβ emission line flux (spectrum plotted in orange in Figure <ref>).\nThe light curve of J1338 indicates a transition from faint to bright state of about 40 days, very rapid even for a CLQ.\n\nFor Chandra data reduction, we used the software  version 4.14 <cit.> and CALDB version 4.9.6. We used the  reprocessing script, which automates the recommended data processing steps in .\n\nFor archival XMM-Newton data reduction, we used the Science Analysis Software <cit.> version 20.0.0 following standard procedures.\nThe XMM-Newton data\nis from three X-ray CCD cameras, including two MOS cameras (MOS1 and MOS2) and one pn camera.\n\nccccccclcc\nX-ray Observations \n1pt\n\nName    \nTelescope    \nObsID    \nPI    \nMJD    \nDate    \nExposure    \nNet Counts    \nGroup    \nEpoch\n\n                    day     kilosecond            \n\nJ0206     XMM     677670138     Pierre     55945     2012-01-19     10.7     20.23/18.22/18.22     1     \n\nJ0206     XMM     677670139     Pierre     55945     2012-01-19     14.3     24.63/29.77/18.83     1     \n\nJ0206     XMM     747190632     Pierre     56691     2014-02-03     24.3     170.54/157.70/300.24     2    \n\nJ0206     XMM     742430201     Mantz     56837     2014-06-29     30.8     640.84, 623.45, 436.19     3     1 \n\nJ0206     Chandra     16575     Mantz     57197     2015-06-24     4.991     36.88      4     \n\nJ0206     Chandra     20457     Green     58483     2018-12-31     19.84     345.86     5     2 \n\nJ0206     Chandra     22027     Green     58483     2018-12-31     19.84     315.39     5     2\n\nJ0224     XMM     655343850     Finoguenov     55582     2011-01-21     2.7     48.72, 58.51, 219.87     1     1 \n\nJ0224     Chandra     23662     Green     59279     2021-03-06     24.95      357.87     2     2\n\nJ0224     Chandra     24978     Green     59280     2021-03-07     23.96     389.57     2     2 \n\nJ0829     XMM     724791301     Dennerl     56573     2013-10-08     26.2     128.53, 149.15, 175.94     1     1\n\nJ0829     XMM     724791332     Dennerl     56574     2013-10-09     8.7     89.97, 89.88, 115.24     1     1 \n\nJ0829     XMM     724791333     Dennerl     56574     2013-10-09     8.7     46.86, 44.57, 46.28     1     1\n\nJ0829     Chandra     22550     Green     58967     2020-04-28     17.72     77.17     2     2\n\nJ0829     Chandra     23234     Green     58972     2020-05-03     29.4     124.99     2     2\n\nJ1226     Chandra     4865     Richards     53047     2004-02-12     4.899     145.68     1     1\n\nJ1226     Chandra     21412     Green     58606     2019-05-03     16.84     141.47     2     2 \n\nJ1226     Chandra     22204     Green     58607     2019-05-04     17.83     134.38     2     2 \n\nJ1226     Chandra     22205     Green     58608     2019-05-05     11.91     86.96     2     2 \n\nJ1338     XMM     502060101     Lamastra     54292     2007-07-11     17.6     68.44, 87.38, 224.18     1     1 \n\nJ1338     Chandra     19474     Green     57881     2017-05-08     32.64     924.96     2     2 \n\n\nObsID stands for “Observation ID\".\nNet counts for XMM-Newton  (XMM) are for cameras MOS1, MOS2, and pn, respectively.\n\n\n\n\n\n\n\n §.§ Radio Observations\n \n\nIf CLQ dim states represent a radiatively inefficient accretion (RIAF) state, they should re-activate a compact radio jet, as seen in low luminosity AGN <cit.>. We triggered radio observations using the VLA for four of the five CLQs, omitting J1338, since it had returned rapidly to the bright state.  The VLA consists of 27 independent antennas, each of which has a dish diameter of 25 meters <cit.>.  The VLA observations were performed within one day of the Chandra X-ray observations.\n\nEach VLA observation lasted two hours, except for J1226 which lasted one hour.  This yielded 87 min on source (38 min for J1226).\nObservations were taken in C-band with 2×2 GHz basebands centered at 5.25 and 7.2 GHz for the near-equatorial sources J0206, J0224, and J1226 (to minimize interference from satellites within the Clarke Belt), and centered at 5.0 and 7.0 GHz for J0829.  We set the flux density scale and performed bandpass calibrations using 3C 147 (for J0206 and J0224) or 3C 286 (for J0829 and J1226), and we cycled to a nearby phase calibrator to solve for the complex gain solutions (see Table <ref> for the phase calibrator and array configuration used for each observation).\n\nVLA data were processed using the Common Astronomy Software Applications v6.1.2.7 <cit.> and calibrated using the VLA calibration pipeline 6.1.2, following standard procedures. The data were imaged using tclean, adopting two Taylor terms to model the spectral dependence of sources in the field, and adopting Briggs weighting with a robust value for each source as noted in Table <ref>.  We detected radio emission at the known optical position of each target, and flux densities were  measured using imfit by fitting a two-dimensional Gaussian to each source.  We found that J0224 and J1226 are consistent with point sources, and J0206 and J0829 are  extended (3.0 arcsec×0.5 arcsec and 6.8 arcsec×4.5 arcsec, respectively, after deconvolution with the synthesized beam).\n The signal-to-noise of the radio detections is not large enough to obtain meaningful in-band constraints on the radio spectral indices of our targets. We summarize the radio observations in Table <ref>.\n\ncccccccccc\nRadio Observations \n1pt\n\nName    \nProject    \nConfig    \nPhase Cal    \nMJD    \nDate    \nrobust    \nf_peak    \nlogL_ 5GHz    \nlog(R)\n\n                            μJy bm^-1     erg s^-1\n\nJ0206     18B-393     C     J0239-0234     58483     2018-12-31     0.0     47.1±5.4     39.01     -4.79\n\nJ0224     SM0081     A     J0239-0234     59279     2021-03-06     0.0     50.1±4.5     38.90     -5.03\n\nJ0829     SL0102     C     J0818+4222       58968     2020-04-29     1.0     13.8±2.8     38.86     -5.25\n\nJ1226     SK0063     B     J1224+0330       58609     2019-05-06     0.5     28.4±5.2     39.18     -5.15\n\n\nf_peak is reported at 6.2 GHz for J0206, J0224, and J1226, and 6.0 GHz for J0829.  R is the radio loudness, R = L_ 5GHz/L_2500.\n\n\n\n\n\n §.§ Infrared Data\n\nThe Wide-field Infrared Survey Explorer <cit.> mapped the all-sky in 2010 in four bands centered at mid-infrared (MIR) wavelengths of 3.4, 4.6, 12, and 22 μm (W1, W2, W3, and W4). WISE scans the sky every half a year in W1 and W2 bands. We used unWISE <cit.> light curves force-photometered for sources in the DESI Legacy Imaging Surveys <cit.>.\n\nWe also compiled available near-infrared (NIR) data, including the UKIRT Infrared Deep Sky Survey <cit.> in YJHK bands, the UKIRT Hemisphere Survey <cit.> in J band, and the VISTA Hemisphere Survey <cit.> in YJHK_s bands.\n\n\n\n\n\n§ DATA ANALYSIS\n\n\n\n\n §.§ Optical Spectral Fitting\n \nWe fit the optical spectra following the quasar spectral fitting code, [ is a general-purpose IDL code for quasar spectral fits <cit.>.], from <cit.>. The spectra are fit in the rest-frame of the quasar after correcting for Galactic reddening, again using the dust map of <cit.> and the extinction curve from <cit.>.\n\n decomposes different components in the quasar spectrum, including power-law continuum,  emission multiplets, and major broad and narrow emission lines.  uses empirical UV  emission templates from the literature <cit.> covering from 1000 to 3500, and an optical  template (3686-7484) from <cit.>.\n\n is designed for quasar spectral fitting, where the host galaxy emission is not prominent, so no host galaxy components were included initially. For our CLQs in the faint states when the AGN continuum is dim, the host galaxy emission becomes more obvious. Therefore, we enhanced the code to take into account host galaxy stellar emission using the simple stellar population models <cit.> with the <cit.> initial mass function. We allow for two host components, one for the young (<300 Myr) stellar population and one for old (>300 Myr) stellar populations. We use 30 templates from <cit.>, covering the metallicities of Z = 0.004, 0.02 and 0.05, and the ages of 0.005, 0.025, 0.10, 0.29, 0.64, 0.90, 1.4, 2.5, 5, and 11 Gyr.\n\nFollowing <cit.>, we choose a few continuum windows and fit the continuum components described above together. The emission lines are fit after subtracting the fitted continuum model. Three broad and one narrow Gaussian components are used for the Hβ and Hα emission.\n\nAs the extent of the  narrow emission line region in quasars is typically 10 kpc or larger\n<cit.>\nthe narrow line flux is expected to remain constant on multi-year timescales.\nWe use the first SDSS epoch as the reference spectrum and re-scale the other spectra to the first SDSS epoch according to the flux of the narrow , and then re-fit the spectra as described above.\n\nTo quantify the measurement uncertainties,\nwe used a Monte Carlo approach, by adding a random Gaussian deviate to the flux at each pixel, with the Gaussian σ equal to the spectral error at that pixel. We compute the values and their uncertainties using the median value and the semi-amplitude of the range enclosing the 16th and 84th percentiles of the distribution from 100 trials.\n\nFigure <ref> shows an example of the optical spectral fitting to J0224 in the bright state (left panels) and faint state (right panels). The top panels show the continuum decomposition. In the bright state, the continuum is dominated by the AGN power-law continuum. Weak host stellar emission is also detected. In the faint state, the AGN continuum emission dimmed dramatically, thus the continuum becomes dominated by the host stellar emission.\nThe middle two panels shows the spectral fitting in the Hβ window. There is obvious broad Hβ emission in the bright state; but it becomes invisible in the faint state. The bottom two panels are in the Hα window. The broad Hα emission became much weaker, but remains visible in the faint state.\n\nTo evaluate the variability of broad Hβ emission, we calculate the flux deviation between the bright and faint state spectra in the Hβ window (4750–4940)\nfollowing <cit.> and <cit.> as\n\n    N_σ(λ) = (f_ bright - f_ faint) / √(σ_ bright^2 + σ_ faint^2),\n\nwhere f is the flux density in unit of erg s^-1 cm^-2 ^-1 and σ is its uncertainty. Following the procedures in <cit.> and <cit.>, we subtract the continuum model, re-bin the spectrum to 2/pixel in the rest frame, and smooth the spectrum with a window of 32.\n\nWe characterize the significance of the Hβ change as the maximum flux deviation of the line relative to the continuum at 4750 as follows,\n\n    N_σ( Hβ) = N_σ (4750-4940 ) - N_σ (4750 ).\n\n\nTo estimate the black hole mass, M_ BH, for each of our CLQs, we utilize the single-epoch virial black hole mass method, using the bright-state spectrum with its prominent broad emission lines. In this approach, the M_ BH is estimated using the measured width of a broad Balmer emission line, as well as a empirical radius–luminosity relation for the BLR based on reverberation mapping results of low-redshift AGN. We use the relation (Equation 6) in <cit.> as follows,\n\n    M_ BH = 10^6.91 ± 0.02[  FWHM(Hβ)/ 1000 km s^-1]^2 \n    ×[ L( Hβ)/ 10^42 erg s^-1]^0.5 M_⊙,\n\nwhere FWHM(Hβ) and L( Hβ) are the full width at half maximum (FWHM; i.e., the width) and luminosity of the broad Hβ emission. The Eddington luminosity\nis calculated as\n\n    L_ Edd = 1.26 × 10^38 M_ BH,\n\nin units of erg s^-1.\n\ncccccccc\nOptical Spectroscopic Properties \n1pt\n\nName    \nN_σ( Hβ)    \nlog(L_ Hβ, 1)    \nlog(L_ Hβ, 2)    \nlog(λ L_ 5100)    \nFWHM_ Hβ    \nlog(M_ BH/M_⊙)    \nlog(M_ BH, ref/M_⊙) \n\n        erg s^-1     erg s^-1     erg s^-1     km h^-1\n\nJ0206     3.59     42.35±0.02     41.84±0.12     44.03±0.01     9715.0±515.1     8.90±0.05     8.95±0.04 \n\nJ0224     5.85     42.50±0.01     42.01±0.02     44.38±0.01     5106.7±286.3     8.51±0.05     8.74±0.05 \n\nJ0829     3.91     42.67±0.05     42.20±0.04     44.32±0.02     3907.8±798.0     8.25±0.17     8.54±0.13 \n\nJ1226     4.41     43.07±0.07     42.38±0.03     44.60±0.02     2869.6±623.6     8.13±0.15     8.17±0.12 \n\nJ1338     2.76     42.51±0.08     42.44±0.13     44.30±0.05     4355.7±692.5     8.34±0.13     8.60±0.15 \n\nN_σ( Hβ) is the significance of the change in Hβ broad line emission between the bright and faint states.\nL_ Hβ, 1 and L_ Hβ, 2 are the broad Hβ line luminosities in the bright and faint state, respectively.\nL_ 5100 is listed for the bright state only, as that is what we use to calculate M_ BH.  M_ BH, ref are the values derived by\n<cit.>, shown for comprison.\n\n\ncccrrrrrrrrr\nX-ray Spectral Analysis \n1pt\n\nName    \nTelescope    \nEpoch    \nχ^2_    \ndof_    \nχ^2_ red    \nN_H, intrin    \nΓ_X    \nNorm    \nlog(F_ 0.5-7keV)      \nlog(ν L_ 2 keV)     \nlog(L_ 2-10 keV) \n \n                        10^22  cm^-2         10^-5     erg s^-1 cm^-2     erg s^-1     erg s^-1\n\nJ0206     XMM-Newton     1     132.387     85     1.56     0.063_-0.013^+0.014     1.744_-0.057^+0.059     10.125_-0.582^+0.625     -12.580_-0.016^+0.015     43.786_-0.011^+0.011     44.079_-0.020^+0.019 \n\nJ0206     Chandra     2     22.653     29     0.78     0.000_-0.000^+0.065     1.673_-0.082^+0.087     7.198_-0.631^+0.789     -12.676_-0.019^+0.019     43.658_-0.021^+0.020     43.979_-0.028^+0.027 \n\nJ0224     XMM-Newton     1     80.196     45     1.78     0.035_-0.021^+0.025     2.344_-0.159^+0.172     20.614_-2.222^+2.651     -12.494_-0.041^+0.041     43.808_-0.034^+0.033     43.885_-0.060^+0.058 \n\nJ0224     Chandra     2     54.727     35     1.56     0.000_-0.000^+0.030     1.708_-0.087^+0.088     7.202_-0.678^+0.726     -12.669_-0.017^+0.017     43.534_-0.022^+0.021     43.841_-0.027^+0.025 \n\nJ0829     XMM-Newton     1     273.537     170     1.61     0.088_-0.028^+0.030     1.899_-0.083^+0.086     9.673_-0.878^+0.982     -12.807_-0.021^+0.021     44.050_-0.015^+0.015     44.285_-0.025^+0.024 \n\nJ0829     Chandra     2     45.523     27     1.69     0.000_-0.000^+0.371     1.715_-0.122^+0.224     3.238_-0.546^+1.299     -13.163_-0.031^+0.031     43.628_-0.044^+0.043     43.932_-0.039^+0.038 \n\nJ1226     Chandra     1     5.104     8     0.64     0.000_-0.000^+0.223     2.192_-0.185^+0.190     13.021_-2.055^+2.371     -12.795_-0.047^+0.047     44.099_-0.042^+0.041     44.228_-0.071^+0.070 \n\nJ1226     Chandra     2     61.520     46     1.34     0.000_-0.000^+0.033     1.662_-0.105^+0.106     4.633_-0.577^+0.651     -12.970_-0.024^+0.024     43.803_-0.032^+0.032     44.128_-0.029^+0.029 \n\nJ1338     XMM-Newton     1     79.536     65     1.22     0.107_-0.032^+0.038     2.246_-0.149^+0.163     10.380_-1.291^+1.561     -12.837_-0.035^+0.034     43.722_-0.026^+0.025     43.833_-0.048^+0.046 \n\nJ1338     Chandra     2     42.382     35     1.21     0.000_-0.000^+0.043     2.038_-0.072^+0.073     14.548_-1.008^+1.046     -12.564_-0.016^+0.015     43.929_-0.017^+0.016     44.112_-0.026^+0.025 \n\n\nN_H, intrin is the best-fit intrinsic absorption column density at the quasar redshift in unit of 10^22  cm^-2.\n\n\n\n\n\n §.§ X-ray Spectral Analysis\n \n\nFor X-ray spectral analysis and fitting, we used the  software <cit.> in version 12.12.0. We grouped X-ray spectra observed with the same telescope within one week and performed spectral analysis together, indicated by the column “Group\" in Table <ref>. In , the spectra are grouped using the task , so that each spectral bin contains 20, 15, 10, 5, 3 or 1 counts, when the total net counts, N_ net, N_ net≥300, 225≤N_ net <300, 100≤N_ net <225, 50≤N_ net <100, 30≤N_ net <50, or 10≤N_ net <30, respectively. We used χ^2 statistic for high-count spectra and C statistic <cit.> when the counts in each spectral bin are less than 20.\n\nThe intrinsic AGN X-ray spectrum is typically a power law within the Chandra and XMM-Newton energy range. The observed X-ray spectrum is a result of the intrinsic spectrum reduced by line-of-sight absorption, mainly from the intrinsic absorption at the quasar redshift and the Galactic absorption from the Milky Way. Therefore, we used the model in  as follows,\n\n    phabs *  zphabs *  zpower,\n\nwhere  is the Galactic absorption,  models\nthe intrinsic absorption with the redshift fixed to the source redshift, and  is a simple photon power law redshifted to the source redshift. We used the  task in  to obtain the Galactic absorption column density, N_H, derived  from  the  HI map <cit.>. The typical Galactic N_H for our CLQs are 2×10^20  cm^-2.\n\n\n\n\n\n §.§ SED Fitting\n \nSince we are interested in the Eddington ratio in different states for these accreting SMBH, we calculate the bolometric luminosity, L_ bol, by fitting to the SEDs. We use the  software <cit.> version v2022.1.  implements a modern UV-to-IR AGN module, SKIRTOR <cit.>, which is a clumpy torus model. Host galaxy stellar emission is also considered in  using stellar populations\nin <cit.>.\n\nTo fit X-ray and other wavelengths simultaneously,  uses the UV to X-ray slope, i.e., α_ OX. We use a definition of α_ OX following literature <cit.> as,\n\n    α_ OX = 0.3838  log(L_ 2500 / L_ 2 keV),\n\nwhere L_ 2500 and L_ 2 keV are the AGN intrinsic luminosity per frequency (in units of erg s^-1 Hz ^-1) at 2500 (UV) and 2 keV (X-ray), respectively.\n\nSince we have X-ray measurements as described in §<ref>, we fixed the X-ray photon indices, Γ_ X and normalizations (fluxes), to the value measured from the X-ray spectra. To explore a wide range of SED shapes and possible variability of α_ OX, we allow for a large deviation |Δα_ OX|_ max=0.6 from the expected AGN values of α_ OX = 0.137  log(L_ 2500) - 2.638 <cit.>\nused by .\n\nGalactic extinction correction is not implemented in . For optical, NIR, and MIR data, we corrected the Galactic extinction for each band as described in §<ref>.\n\n\n\n§ RESULTS\n \n\n\n §.§ Optical Results\n\n\nWe obtained follow-up optical spectroscopy for five new CLQs, summarized in Table <ref>. The optical spectra are shown in Figure <ref>. The optical spectroscopic observations demonstrate that the quasar continuum emission dimmed significantly, along with the broad Balmer emission. In all the five CLQs, broad Hβ disappeared, as well as Hγ. In three CLQs, J0224, J1226, and J1338, there is visible broad Hδ emission in the bright states, which disappeared in the faint state as well. For two CLQs at lower redshift, thus with coverage of Hα emission, J0206 and J0224, the broad Hα becomes weaker in the faint states, but still remains visible (see the spectral fitting to J0224 in Figure <ref>). For the other three CLQs at higher redshift, thus with coverage of , the broad  emission decreases, but remains visible as well. Hα and  vary slower than Hβ, possibly due to larger radius of gas emitting Hα and .\nThis phenomenon is consistent with previous spectroscopic follow-up of CLQs <cit.>.\n\nWe calculate the significance of Hβ change, defined in Equation <ref>. Four of the five CLQs vary at ≳ 4σ level; and one CLQ J1338, the first one observed in 2017 which rapidly brightened again, shows a decrease of broad Hβ slightly below the 3σ level.\n\n<cit.> and <cit.> used a criterion for CLQ behavior as having a change of broad Hβ flux at N_σ( Hβ) ≥ 3. <cit.> indicated that better criteria to declare identification of a bona fide CLQ should be based on intrinsic properties measured with adequate significance i.e., the fractional change in both continuum luminosity and broad Hβ line luminosity should be larger than 30%.  In practice, nearly all CLQs that satisfy the N_σ( Hβ) ≥ 3 criterion also satisfy the other two criteria.  In Table <ref>, we summarize some of the relevant the spectral fitting measurements. The broad Hβ line luminosity L_ H β changes more than 30% between the bright and faint states for the four CLQs with N_σ( Hβ) ≥ 3σ.\n\ncrrrrrcr\nChanging-obscuration Model \n1pt\n\nName    \nχ^2    \ndof    \nχ^2_ red    \nχ^2_ abs    \ndof_ abs    \nχ^2_ red, obsc    \nN_H, obsc \n\n                             10^22  cm^-2\n\nJ0206     22.653     29     0.78     50.394     31     1.63     0.417_-0.086^+0.099 \n\nJ0224     54.727     35     1.56     107.572     37     2.91     1.154_-0.112^+0.122 \n\nJ0829     45.523     27     1.69     253.722     29     8.75     2.605_-0.290^+0.289 \n\nJ1226     61.520     46     1.34     114.350     48     2.38     1.173_-0.165^+0.164 \n\n\nχ^2_ red,obsc, the reduced χ^2 values of the changing-obscuration model, is larger than χ^2_red of the independent best-fit model from Table <ref>.\n\n\n\n\n\nUsing the bright state spectra, with their prominent broad Hβ emission, we find the virial M_ BH based on Equation <ref> for these CLQs are 10^8-9 M_⊙ (see individual results in Table <ref>). Our M_ BH measurements are consistent with the results in <cit.>, though slightly lower (0.04-0.29 dex), since we accounted for the host galaxy contribution, thus yielding a lower AGN continuum emission.\n\nFigure <ref> shows the multiwavelength light curves of the five new CLQs, from top to bottom panels, in X-ray, optical g and r bands, and MIR W1 and W2 bands. In the optical, the photometric data has been calibrated to the SDSS filter magnitude (as described in §<ref>). The multiwavelength light curves show highly consistent variability trends across the different wavebands.\n\nJ1226 faded all the way  from 1999 to 2021 in all wavelengths from X-ray to MIR. Across more than two decades, its variability shows a slow, steady decline. Until recently, the ZTF imaging observations in 2022 shows signs of re-ignition in this CLQ. The other CLQs are different from J1226, with shorter timescale variability. Recent ZTF photometric data shows signs of re-brightening in all of the five CLQs.\n\nThe Chandra observation of J1338 is brighter than its previous X-ray observation (described in §<ref>). It brightened by 0.7 mag in g band and 0.3 mag in r band within two months from our MMT observation to the Chandra observation, according to our photometric monitoring using the 1.2m FLWO telescope. The r-band photometry close to the Chandra observation is actually 0.1 mag brighter than the one close to the XMM-Newton observation. In the Magellan spectrum, 11 months after the MMT observation, the broad Hβ reappeared. Therefore, we believe that the Chandra X-ray observation of J1338 was not performed in its faint state.\n\n\n\n §.§ X-ray Analysis Results\n \nSince the primary physical puzzles concern the SMBH accretion rate and intrinsic absorption, X-ray observations are the ideal probes.\nWe firstly fit the X-ray spectra in both states independently. Figure <ref> shows the X-ray spectral fitting results for the five CLQs in Epoch 1 (left panels) and Epoch 2 (right panel), with the model described in §<ref>.\nWithin one panel, the observations taken for the same object with the same telescope within one week are fit together.\nThe different colors/symbols are data from different observations (or cameras). We summarize the X-ray fitting results in Table <ref>.\n\nNo strong intrinsic absorption is detected in\neither bright or faint states for these quasars. The faint-state X-ray spectra are fit well with zero intrinsic column density, N_H, intrin, with 1σ upper limits smaller than or comparable with the N_H, intrin values in the bright-state X-ray spectra.\nThe non-absorption result is consistent with previous studies on X-ray studies of CLQs <cit.>, as well as in CL AGN such as Mrk 590 <cit.> and Mrk 1018 <cit.>.\n\nInstead, we detected changes in the power-law continuum, both in photon index and flux. Apart from J1338, which re-brightened rapidly, in the other four CLQs, the intrinsic fluxes in Epoch 2 are lower than those in Epoch 1. As shown in Figure <ref>, their X-ray emission generally tracks the optical variability. The photon indices are harder in the faint state, consistent with the trend in ensemble AGN <cit.>.\n\nAs X-ray data is sensitive to absorption, we use the X-ray spectra to test the changing-obscuration model. Assuming varying absorption is the cause of the changes, we fix the AGN power-law continuum parameters in the faint state to the measurements obtained in the bright state, with only quasar intrinsic column density as a free parameter. Figure <ref> shows the results for the four CLQs observed in the faint state by Chandra. The plotted data are from Chandra in the faint state.\nThe dotted black line is the independent best-fit model in the faint state.\nThe dashed red line is the best-fit changing-obscuration model to the faint-state data. The results demonstrate that the changing-obscuration model does not match the observations. The reduced χ^2 value, χ^2_ red, obsc of this changing-obscuration model is larger than the results of the independent best-fit model (summarized in Table <ref>). For these CLQs, the X-ray data are not consistent with a varying absorption scenario.\n\n\n\n\n\n §.§ CLQ SED Variability\n\nThe CLQs show multiwavelength variability.\nFigure <ref> illustrates the comparison between the SEDs in the Epoch 1 (black) and Epoch 2 (red). We fit the SEDs with components including AGN (X-ray and UV to IR), host galaxy, and dusty torus (as described in §<ref>). The right bottom panel shows an example of the SED decomposition for J1226 in the bright state. In the four CLQs, J0206, J0224, J0829, and J1226, Epoch 2 is fainter than Epoch 1 throughout the electromagnetic spectrum. We integrate the best-fit SED model to obtain the bolometric luminosity, L_ bol, and use the virial M_ BH obtained from the optical spectra to calculate the Eddington ratio, λ_ Edd. Only for J1338 is the L_ bol higher in Epoch 2 than in Epoch 1. The L_ bol are in range of 10^44.7-45.6 erg s^-1 and the λ_ Edd are in range of from 10^-2.2 to 10^-0.5 (0.6% to ∼30%; summarized in Table <ref>). We also measure the UV luminosity (λ L_2500) and UV to X-ray slope (α_ OX) from the SED fitting.\nUse of the SED fitting is more accurate for this purpose than simply extrapolating rest frame luminosities from total observed fluxes, because we are interested in changes to the AGN emission, and our SED fitting models the host galaxy and AGN components separately, especially important for the faint states.\n\nThe entire SED variability shape is not consistent with varying obscuration; while the mid-infrared flux varies significantly, it is at most weakly affected by dust extinction. The extinction coefficient in g band is a factor >15 greater than that in the W1 band, according the extinction law <cit.>, across a range R_V values (see Table <ref>). All five CLQs vary more than 0.5 mag in W1 band, which cannot be caused by changing extinction given the corresponding ∼  1-2 mag optical variability. Some of the CLQs show larger variability in the W2 band than in the W1 band, also inconsistent with an extinction model.\n\nIt is more likely the changes in these CLQs are due to changing accretion state of the SMBH, whereby the multiwavelength emission varies accordingly. The accretion rate of the central SMBH decreased, so the whole system dimmed. The AGN emission throughout the entire electromagnetic spectrum – the UV-optical emission from the accretion disk, the X-ray emission from the corona, and the MIR emission from the re-radiation in the dusty torus – decreased as the luminosity from the central engine decreased. As a consequence, the emission in the BLR, photoionized by the UV emission from the accretion disk, fades and even disappears. The SEDs show stronger variabilities in the X-ray, UV optical, and MIR, than in the near-infrared. This is also reasonable in this scenario, because the emission in the NIR is dominated by the host galaxy, which does not vary. If the common model of AGN structure with hotter regions at smaller radii is correct, then densely cadenced multiwavelength photometry throughout a state transition should verify that continuum changes generally propagate with time from shorter to longer wavelengths.\n\ncccccc\nSED Fitting Results \n1pt\n\nName    \nState    \nlog(L_ bol)    \nlog(λ_ Edd)    \nlog(λ L_2500)    \nα_ OX \n\n         erg s^-1         erg s^-1    \n\nJ0206     1     44.94±0.03     -2.06±0.06     44.02±0.06     1.10±0.03 \n\nJ0206     2     44.81±0.03     -2.19±0.06     43.80±0.09     1.07±0.03 \n\nJ0224     1     45.26±0.05     -1.35±0.07     44.63±0.07     1.29±0.03 \n\nJ0224     2     44.78±0.03     -1.83±0.06     43.93±0.10     1.16±0.04 \n\nJ0829     1     45.32±0.04     -1.04±0.17     44.60±0.06     1.22±0.02 \n\nJ0829     2     44.90±0.02     -1.46±0.17     44.11±0.01     1.21±0.02 \n\nJ1224     1     45.64±0.01     -0.59±0.15     45.03±0.01     1.35±0.03 \n\nJ1224     2     45.11±0.02     -1.11±0.15     44.33±0.03     1.23±0.02 \n\nJ1338     1     45.15±0.03     -1.29±0.13     44.51±0.03     1.28±0.02 \n\nJ1338     2     45.17±0.05     -1.27±0.14     44.44±0.08     1.19±0.03 \n\n\n\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\n\n §.§ Fundamental Plane of Black Hole Activity\n\nAccretion onto BHs illuminates fascinating physics from the stellar mass BHs in XRBs to the SMBHs.\nThe fundamental plane of black holes shows the correlation of radio luminosity, X-ray luminosity, and black hole mass for hard-state XRBs and their supermassive analogs <cit.>. The theoretical framework behind the fundamental plane typically assumes a black hole fed by a RIAF that is launching a compact, partially self-absorbed synchrotron jet (implying unresolved radio emission with a flat/inverted spectrum; e.g., ).\n\nUsing the VLA radio observations, we obtain the radio luminosity at 5 GHz in the rest frame, L_ 5GHz, typically ∼10^39 erg s^-1 for the four CLQs (summarized in Table <ref>). In Figure <ref>, we plot the CLQs on the edge-on view of the fundamental plane in <cit.>. The correlation extends over many decades of black hole mass and luminosity, including many different sources, from stellar mass BHs to SMBHs. The CLQs appear to follow the fundamental plane relation. However, there are several caveats to bear in mind that complicate physical interpretations with current data.  Foremost, although we detect radio emission from all four CLQ targets in their faint states, we stress that it is unclear if this emission is related to the activation of a compact jet, or if the radio emission is instead a relic from the previous QSO phase.  It is also unknown if our targets' radio emission have flat/inverted spectra, and only two of our targets remain unresolved at VLA spatial resolutions (J0224 and J1226).\n We use different symbols in Figure <ref> to distinguish point source (filled circle) and possible extended (filled diamond) sources.\n\n\n\n §.§ Analogy between AGN and XRBs\n\nAccretion state transitions have been detected in many XRBs. The X-ray power-law continuum slope correlates strongly with Eddington ratio λ_ Edd in individual XRBs as their accretion state varies, such as Swift J1753.5-0127 <cit.>, H1743-322 <cit.>, and GX 339-4 <cit.>. Similar trends are seen (so far) across samples of quasars and Seyferts <cit.>, but have rarely been tracked in individual AGN, much less luminous quasars.\nFigure <ref> shows the X-ray power-law slope, Γ_ X, vs. the Eddington ratio. The colored dots are our five CLQs; dots of the same color represent the same object in different states. The black filled squares are individual AGN in the sample of <cit.>, and the other black symbols are individual XRBs. Each individual CLQ basically follow the same softer-when-brighter trend, probably due to the changes in the hot corona temperature or opacity <cit.>\n\nThere is both variability in the UV/optical and X-ray. α_ OX provides a measurement of the ratio of disk to corona emission. Large α_ OX corresponds to strong UV relative to X-ray (i.e., a soft SED). Figure <ref> shows the α_ OX vs. Eddington ratio, λ_ Edd. The gray symbols are CLQ measurements in the faint state <cit.> and (ROSAT) X-ray upper limits in the bright state (so lower limits in α_ OX, shown with upward arrows). The black symbols are three known CLQs with X-ray measurements in both states, including J0159 <cit.>, and J2252 and J2333 <cit.>.\n\nThere is some evidence that α_ OX varies with λ_ Edd in two branches around a critical Eddington ratio of ∼10^-2 (1%). When λ_ Edd≳ 1%, as is the case for our CLQ observations, α_ OX hardens (decreases) when λ_ Edd decreases.  By contrast, when λ_ Edd≲ 1%, α_ OX softens (increases) when λ_ Edd is smaller. While there is evidence to support this trend from ensembles of AGN each observed once, it is key to track the trends among individual AGN observed at different accretion rates because other factors - most importantly SMBH mass and inclination angle - are obviously fixed across epochs for individual AGN.\nOur CLQs are mostly λ_ Edd≳ 1%, so the individual CLQs vary such that α_ OX increases (softens) with  λ_ Edd. J0206, with λ_ Edd slightly lower than 10^-2, also follows this trend. J1338 is an outlier, but as we mentioned it varies quickly, and we did not catch the desired faint state in X-rays. For J0159, with one epoch at λ_ Edd > 10^-2 and another epoch at λ_ Edd < 10^-2,  <cit.> reported no detected\nchange in X-ray slope or (albeit with large errors) in α_ OX .\n\nIn Figure <ref>, the asterisks are predictions for AGN from <cit.>, based on modeling the observed X-ray spectral evolution of the XRB GRO J1655–40 during its accretion state transition and scaling the SED evolution up to AGN SMBH masses. The predicted data from XRBs also show a critical Eddington ratio of about 1%.\nThe analogy of SMBHs and stellar mass black holes encourages a theoretical model to explain the phenomena.\nReferring to theoretical models of XRBs, <cit.> suggested that\nat high Eddington ratios, accretion is mediated via a geometrically thin accretion disk <cit.>. As λ_ Edd decreases, there is less UV emission from the thin disk with lower apparent temperature, so α_ OX decreases.\nWhen the λ_ Edd is lower than 1%, a jet may launch or the inner region of the thin disk may progressively evaporate into a hot radiatively inefficient accretion flow (RIAF) that is possibly advection-dominated <cit.>.\nThus the α_ OX increases again possibly due to the emergence of UV emission from either a jet or an advection-dominated accretion flow (ADAF). For our CLQs, the λ_ Edd is not far below 10^-2, and the radio loudness is ∼10^-5 (see Table <ref>), indicating no powerful jet launch, so our observations are consistent with the model.  Multi-epoch observations of CLQs at even lower Eddington ratios are warranted.\nHowever, evidence so far indicates that most AGN with λ_ Edd< 1% will not show broad emission lines, so the necessary observations may require following significant intrinsic (not absorption-related) variability in type 2 AGN.  Strong  variability in “naked type 2\" AGN is relatively rare, but worth pursuing; they may on closer inspection be found to have weak broad Hβ emission, and/or broad Hα (e.g., associated with types 1.8 or 1.9) <cit.>.\n\n\n\n§ SUMMARY\n \nWe present multiwavelength, multi-epoch observations of five new CLQs and analyze the data both in the bright and faint states. Our main conclusions are as follows:\n\n\n\n  * Our optical spectroscopic follow-up confirms CLQ behavior, with continuum emission dramatically dimmed, accompanied by disappearance of broad Balmer emission lines, such as Hβ, Hγ, and Hδ. By selection, their broad Hβ varies at ≳  3σ level. The broad Hα and  emission varies less\n\n(or much more slowly) than Hβ.\n\n\n  * The CLQs vary accordingly in multiwavelength throughout the  electromagnetic spectrum, in X-ray, optical, and MIR.\n\n\n  * The intrinsic X-ray continuum strength changes together with the optical variability.\nThe X-ray power-law slope changes following a harder-when-fainter trend.  No strong absorption is detected in the faint-state X-ray spectra, so that a changing-obscuration model does not match the X-ray observations.\n\n\n  * The broader SED variability is also inconsistent with the changing-obscuration model, especially given that large amplitude MIR variability (>0.5 mag) is detected in all five quasars.\n\n\n  * It is highly likely that the changes in these CLQs are due to changing accretion state of the SMBH, so the multiwavelength emission varies accordingly.\n\n\n  * There are many similarities between AGN and XRBs, indicating similarities in the BH accretion processes in SMBHs and stellar mass black holes.\n\n\nOnly a handful of CLQ have been observed in X-rays both before and after the state transition. More such observations are needed for a statistically significant result. Our five CLQs are basically at λ_ Edd≳ 10^-2. More CLQ transitions over a wide range of λ_ Edd will be important for studies of BH accretion processes and AGN structure.\n\n\n\nWe thank Ruancun Li and Malgorzata Sobolewska for useful discussions and suggestions.\n\n\n\n\n\nThis research has made use of data obtained from the Chandra Data Archive and the Chandra Source Catalog, and software provided by the Chandra X-ray Center (CXC) in the application packages CIAO and Sherpa.  Q.Y. is partially supported for this work by the National Aeronautics and Space Administration through Chandra Award Numbers GO9-20086X and GO0-21084X, issued by the Chandra X-ray Center, which is operated by the Smithsonian Astrophysical Observatory for and on behalf of the National Aeronautics Space Administration under contract NAS8-03060.\n\nRMP acknowledges support from the National Science Foundation under grant No. 2206123.\n\n\n\nThis work used observations obtained with XMM-Newton.\nBased on observations obtained with XMM-Newton, an ESA science mission with instruments and contributions directly funded by ESA Member States and NASA.\n\n\nWe acknowledge the use of telescopes, including MMT, Gemini, Magellan, the 3.5m telescope at APO, and the 1.2m telescope at the Fred Lawrence Whipple Observatory, operated by the Smithsonian Institution.\nObservations reported here were obtained at the MMT Observatory, a joint facility of the Smithsonian Institution and the University of Arizona.\n\nBased on observations obtained at the international Gemini Observatory, a program of NSF’s NOIRLab, which is managed by the Association of Universities for Research in Astronomy (AURA) under a cooperative agreement with the National Science Foundation on behalf of the Gemini Observatory partnership: the National Science Foundation (United States), National Research Council (Canada), Agencia Nacional de Investigación y Desarrollo (Chile), Ministerio de Ciencia, Tecnología e Innovación (Argentina), Ministério da Ciência, Tecnologia, Inovações e Comunicações (Brazil), and Korea Astronomy and Space Science Institute (Republic of Korea).\n\nThis paper includes data gathered with the 6.5 meter Magellan Telescopes located at Las Campanas Observatory, Chile.\n\nBased on observations obtained with the Apache Point Observatory 3.5-meter telescope, which is owned and operated by the Astrophysical Research Consortium.\n\n\nWe acknowledge the use of SDSS data. Funding for SDSS-III has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation, and the U.S. Department of Energy Office of Science. The SDSS-III website is <http://www.sdss3.org/>. SDSS-III is managed by the Astrophysical Research Consortium for the Participating Institutions of the SDSS-III Collaboration including the University of Arizona, the Brazilian Participation Group, Brookhaven National Laboratory, Carnegie Mellon University, University of Florida, the French Participation Group, the German Participation Group, Harvard University, the Instituto de Astrofisica de Canarias, the Michigan State/Notre Dame/JINA Participation Group, Johns Hopkins University, Lawrence Berkeley National Laboratory, Max Planck Institute for Astrophysics, Max Planck Institute for Extraterrestrial Physics, New Mexico State University, New York University, Ohio State University, Pennsylvania State University, University of Portsmouth, Princeton University, the Spanish Participation Group, University of Tokyo, University of Utah, Vanderbilt University, University of Virginia, University of Washington, and Yale University.\n\n\nThis research has made use of PS1, WISE, CRTS, and PTF imaging data. The PS1 has been made possible through contributions by the Institute for Astronomy, the University of Hawaii, the Pan-STARRS Project Office, the Max-Planck Society and its participating institutes, the Max Planck Institute for Astronomy, Heidelberg and the Max Planck Institute for Extraterrestrial Physics, Garching, The Johns Hopkins University, Durham University, the University of Edinburgh, Queen's University Belfast, the Harvard-Smithsonian Center for Astrophysics, the Las Cumbres Observatory Global Telescope Network Incorporated, the National Central University of Taiwan, the Space Telescope Science Institute, the National Aeronautics and Space Administration under Grant No. NNX08AR22G issued through the Planetary Science Division of the NASA Science Mission Directorate, the National Science Foundation under Grant No. AST-1238877, the University of Maryland, and Eotvos Lorand University (ELTE). This publication makes use of data products from the Wide-field Infrared Survey Explorer, which is a joint project of the University of California, Los Angeles, and the Jet Propulsion Laboratory/California Institute of Technology, funded by the National Aeronautics and Space Administration. The Catalina Sky Survey (CSS) is funded by the National Aeronautics and Space Administration under Grant No. NNG05GF22G issued through the Science Mission Directorate Near-Earth Objects Observations Program. The CRTS survey is supported by the US National Science Foundation under grants AST-0909182 and AST-1313422. We acknowledge the use of PTF data, and the website is <https://www.ptf.caltech.edu>.\n\n\nWe acknowledge the use of ZTF data. Based on observations obtained with the Samuel Oschin Telescope 48-inch and the 60-inch Telescope at the Palomar Observatory as part of the Zwicky Transient Facility project. ZTF is supported by the National Science Foundation under Grant No. AST-2034437 and a collaboration including Caltech, IPAC, the Weizmann Institute for Science, the Oskar Klein Center at\nStockholm University, the University of Maryland, Deutsches Elektronen-Synchrotron and Humboldt University, the TANGO\nConsortium of Taiwan, the University of Wisconsin at Milwaukee, Trinity College Dublin, Lawrence Livermore National\nLaboratories, and IN2P3, France. Operations are conducted by COO, IPAC, and UW.\n\n\n\nChandra, XMM-Newton, MMT (Blue Channel spectrograph, BinoSpec), Magellan:Baade (IMACS), Gemini (GMOS-N), APO 3.5m (DIS), FLWO:1.2m, Sloan, PS1, PTF, CRTS, ZTF, WISE\n\nCIAO, SAS, XSPEC, CASA, IRAF, QSOFIT, X-CIGALE\n\n\n\n\n\n\n§ EXTINCTION COEFFICIENT\n \n\nWe provide a table of conversion coefficients from E(B-V)_ SFD to extinction in 35 filters for the surveys we used in this work in Table <ref>.\nWe calculated the extinction coefficients following the procedures in <cit.>. The extinction in band b is expressed as,\n\n\n    A_b = -2.5 log[ ∫ dλ W_b(λ) S(λ)10^-A(λ)Δ m_1μ m/2.5/∫ dλ W(λ)S(λ)]\n\nwhere W_b(λ) is the filter throughput curve in band b as a function of wavelength λ, S is the source spectrum, and A is the extinction law <cit.>, normalized to A_1 μ m = 1. Δ m_1 μ m is a normalization N=0.78 times the extinction at 1μm according to <cit.>. The source spectrum S is a synthetic stellar spectrum, with T_ eff = 7000K, logZ=-1, and logg=4.5 from <cit.>, extrapolating into the infrared following a blackbody spectrum S(λ) ∝λ^-3. We compute the extinction coefficients A_b / E(B-V), with R_V = 2.1, 3.1, 4.1, and 5.1.\n\n\n\n\ncccccc\nExtinction Coefficient \n1pt\n\nSurvey    \nBand    \n    \nA_b/E(B-V)    \n\n3-6\n        R_V=2.1     R_V=3.1     R_V=4.1     R_V=5.1\n\nSDSS     u     5.443     4.247     3.716     3.418 \n\nSDSS     g     3.852     3.304     3.052     2.907 \n\nSDSS     r     2.260     2.287     2.298     2.305 \n\nSDSS     i     1.585     1.697     1.749     1.780 \n\nSDSS     z     1.211     1.263     1.286     1.300 \n\nPS1     g     3.666     3.188     2.967     2.840 \n\nPS1     r     2.254     2.278     2.288     2.294 \n\nPS1     i     1.569     1.682     1.733     1.763 \n\nPS1     z     1.259     1.323     1.352     1.369 \n\nPS1     y     1.087     1.104     1.111     1.116 \n\nPTF     g     3.812     3.280     3.035     2.893 \n\nPTF     R     2.002     2.087     2.126     2.148 \n\nZTF     g     3.748     3.240     3.005     2.870 \n\nZTF     r     2.111     2.169     2.195     2.210 \n\nZTF     i     1.444     1.542     1.587     1.612 \n\nFLWO     g     3.758     3.245     3.008     2.871 \n\nFLWO     r     2.226     2.254     2.266     2.273 \n\nFLWO     i     1.524     1.631     1.680     1.708 \n\n2MASS     J     0.778     0.722     0.696     0.681 \n\n2MASS     H     0.517     0.457     0.430     0.414 \n\n2MASS     K_s     0.344     0.308     0.292     0.282 \n\nUKIRT     Z     1.226     1.282     1.308     1.323 \n\nUKIRT     Y     0.989     0.978     0.973     0.970 \n\nUKIRT     J     0.765     0.707     0.680     0.664 \n\nUKIRT     H     0.524     0.464     0.437     0.421 \n\nUKIRT     K     0.335     0.301     0.285     0.276 \n\nVISTA     Z     1.247     1.307     1.335     1.352 \n\nVISTA     Y     1.003     0.996     0.993     0.991 \n\nVISTA     J     0.763     0.705     0.678     0.662 \n\nVISTA     H     0.520     0.461     0.433     0.417 \n\nVISTA     K_s     0.351     0.314     0.298     0.288 \n\nWISE     W1     0.180     0.176     0.174     0.173 \n\nWISE     W2     0.112     0.120     0.123     0.125 \n\nWISE     W3     0.034     0.046     0.052     0.055 \n\nWISE     W4     0.014     0.022     0.026     0.028 \n\n\n\n\n\n§ SED DATA\n\nWe compiled the multiwavelength photometric data in both states (summarized in Table <ref>). Since we simultanously fit the X-ray to MIR SED, we chose the photometric data closest in time to the X-ray epochs (indicated by the “Epoch\" columns in Table <ref>).\n\n\n\n\ncccclcc\nPhotometric Data for CLQ SED \n1pt\n\nName    \nEpoch    \nSurvey/Telescope    \nBand    \nMJD    \nmag    \nuncertainty\n\nJ0206     1     PS1     g     56631.333      20.125      0.040 \n\nJ0206     1     PS1     r     56988.307      20.209      0.062 \n\nJ0206     1     PS1     i     56916.486      19.685      0.038 \n\nJ0206     1     PS1     z     56644.232      19.047      0.039 \n\nJ0206     1     PS1     y     56517.627      18.521      0.037 \n\nJ0206     1     WISE     W1     56860.281     14.762     0.019\n\nJ0206     1     WISE     W2     56860.281     14.046     0.041\n\nJ0206     1     WISE     W3     55312.068     11.487     0.134\n\nJ0206     1     WISE     W4     55312.068     8.877     0.775\n\nJ0206     2     FLWO     g     58481.133      20.816      0.100 \n\nJ0206     2     FLWO     r     58465.266      19.815      0.046 \n\nJ0206     2     WISE     W1     58480.006     15.748     0.051\n\nJ0206     2     WISE     W2     58480.006     14.855     0.092\n\nJ0224     1     PS1     g     55854.412      18.906      0.019 \n\nJ0224     1     PS1     r     55854.462      18.655      0.015 \n\nJ0224     1     PS1     i     56209.550      18.489      0.013 \n\nJ0224     1     PS1     z     55583.258      18.118      0.017 \n\nJ0224     1     PS1     y     55584.260      18.035      0.050 \n\nJ0224     1     VHS     J     56298.146      16.793      0.009 \n\nJ0224     1     VHS     K_s     56298.136      15.108      0.011 \n\nJ0224     1     WISE     W1     55213.406     13.599     0.009\n\nJ0224     1     WISE     W2     55213.406     12.771     0.014\n\nJ0224     1     WISE     W3     55318.732     10.551     0.052\n\nJ0224     1     WISE     W4     55322.150     7.589     0.220\n\nJ0224     2     ZTF     g     59138.359      20.058      0.025 \n\nJ0224     2     ZTF     r     59158.345      18.976      0.009 \n\nJ0224     2     WISE     W1     59054.290     14.244     0.013\n\nJ0224     2     WISE     W2     59054.290     13.546     0.030\n\nJ0829     1     PTF     r     56724.155      20.166      0.119 \n\nJ0829     1     UHS     J     56066-57784     18.356      0.073 \n\nJ0829     1     WISE     W1     56764.247     15.347     0.114\n\nJ0829     1     WISE     W2     56764.247     14.168     0.153\n\nJ0829     1     WISE     W3     55299.743     11.789     0.228\n\nJ0829     1     WISE     W4     55299.743     9.536     0.929\n\nJ0829     2     ZTF     g     58891.198      21.285      0.036 \n\nJ0829     2     ZTF     r     58891.290      20.826      0.025 \n\nJ0829     2     ZTF     i     58257.172      19.485      0.108 \n\nJ0829     2     WISE     W1     58778.937     16.046     0.058\n\nJ0829     2     WISE     W2     58778.937     15.322     0.138\n\nJ1226     1     SDSS     u     51923      18.936      0.042 \n\nJ1226     1     SDSS     g     51923      18.699      0.021 \n\nJ1226     1     SDSS     r     51923      19.262      0.036 \n\nJ1226     1     SDSS     i     51923      18.822      0.027 \n\nJ1226     1     SDSS     z     51923      19.078      0.094 \n\nJ1226     1     UKIDSS     Y     54398      18.387      0.047 \n\nJ1226     1     UKIDSS     J     54398      17.772      0.054 \n\nJ1226     1     UKIDSS     H     54398      17.135      0.043 \n\nJ1226     1     UKIDSS     K_s     54398      16.148      0.034 \n\nJ1226     1     WISE     W1     55370.140     14.304     0.013\n\nJ1226     1     WISE     W2     55370.140     13.302     0.020\n\nJ1226     1     WISE     W3     55370.743     10.519     0.073\n\nJ1226     1     WISE     W4     55370.743     8.221     0.565\n\nJ1226     2     ZTF     g     58607.299      20.751      0.061 \n\nJ1226     2     ZTF     r     58583.255      20.674      0.052 \n\nJ1226     2     ZTF     i     58261.189      19.846      0.097 \n\nJ1226     2     WISE     W1     58638.071     15.005     0.024\n\nJ1226     2     WISE     W2     58638.071     14.315     0.058\n\nJ1338     1     SDSS     u     52053      19.884      0.041 \n\nJ1338     1     SDSS     g     52053      19.437      0.025 \n\nJ1338     1     SDSS     r     52053      19.032      0.020 \n\nJ1338     1     SDSS     i     52053      18.734      0.018 \n\nJ1338     1     SDSS     z     52053      18.433      0.036 \n\nJ1338     1     UKIDSS     Y     54989      17.700      0.026 \n\nJ1338     1     UKIDSS     J     54989      17.154      0.029 \n\nJ1338     1     UKIDSS     H     54989      16.437      0.017 \n\nJ1338     1     UKIDSS     K_s     54989      15.515      0.014 \n\nJ1338     1     WISE     W1     55211.722     13.818     0.010\n\nJ1338     1     WISE     W2     55211.722     13.170     0.020\n\nJ1338     1     WISE     W3     55315.574     10.741     0.069\n\nJ1338     1     WISE     W4     55387.109     7.400     0.354\n\nJ1338     2     FLWO     g     57887.197      19.578      0.032 \n\nJ1338     2     FLWO     r     57887.201      19.008      0.026 \n\nJ1338     2     WISE     W1     57765.450     15.033     0.029\n\nJ1338     2     WISE     W2     57765.450     14.244     0.060\n\n\nWe use photometry in optical, near-infrared, and mid-infrared that is closest to the X-ray observation epochs.\nWe use PSF (AB) magnitudes in the optical, 2 arcsec diameter aperture (Vega) magnitudes in the near-infrared. The WISE data is in Vega magnitude.\n\n\n\n\n"}