{"entry_id": "http://arxiv.org/abs/2303.06724v1", "published": "20230312183120", "title": "Gröbner and Graver bases for calculating Opportunity Cost Matrices", "authors": ["Yuchen Ge", "Janosch Ortmann", "Walter Rei"], "primary_category": "math.OC", "categories": ["math.OC", "math.AC", "90C15(Primary), 90C10, 13P25 (secondary)"], "text": "\n\n\tOpportunity cost matrices, first introduced in <cit.>, are interesting in the context of scenario reduction. We provide new algorithms, based on ideas from algebraic geometry, to efficiently compute the opportunity cost matrix using computational algebraic geometry. We demonstrate the efficacy of our algorithms by computing opportunity cost matrices for two stochastic integer prorams.\n\n\t\nProbing the Origin of Changing-look Quasar Transitions with Chandra\n    [\n    \n===================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nIn many real-world applications, decision-making under uncertainty is a challenging problem that requires the consideration of multiple possible scenarios. However, the number of scenarios can grow exponentially with the number of uncertain parameters, making the decision problem intractable. Scenario reduction methods\n\naim to address this issue by reducing the number of scenarios while preserving the key characteristics of the original problem.\n\nRecently <cit.> there has been progress in developing problem-driven scenario reduction methods. All of these methods require the computation of a variant of the opportunity cost matrix introduced in <cit.>: assign a decision x^∗_j to each scenario s_j. In <cit.>  this is done by choosing an optimal solution to the single-scenario problem. The opportunity cost matrix is computed by evaluating the solution associated to scenario j against scenario i. Intuitively, suppose that we hae an oracle that predicts that scenario j will occur. The (i,j) entry of the opportunity cost matrix gives the cost incurred by trusting the oracle and taking a decision under the viewpoint of scenario j if it then turns out that in fact scenario i occurs.\n\nThe opportunity cost matrix naturally leads to a decision-based distance on the scenario set: two scenarios i and j can be considered to be close if the (i,j) entry of the opportunity cost matrix is small (and hence the cost of predicting scenario j when actually scenario i occurs leads to a small cost) and far away if the (i,j) entry is large.\n <cit.> propose clustering algorithms based on this distance, which has shown to lead to good approximative solutions and tight bounds on the true objective value.\n\n\n\nIn this paper, we present a novel approach to efficiently compute opportunity cost matrices using Gröbner and Graver bases. Gröbner <cit.> and Graver <cit.> bases  are algebraic objects that can be used to solve systems of polynomial equations and inequalities. These have been successfully applied to optimisation <cit.> \n\nand have seen a wide range of applications \n\n\n\nOur approach leverages the structure of opportunity cost matrices to formulate them as polynomial systems, which can then be solved using Gröbner and Graver bases. The resulting method is fast, accurate, and scales with the number of scenarios and variables.\n\nWe demonstrate the effectiveness of our approach through numerical experiments on a well-known integer program from <cit.>. Our results show that the Gröbner basis approach is particularly efficient for a large number of scenarios, whereas the Graver basis approach stays stable with a large number of decision variables.\nOur paper contributes to the literature by providing two new approaches to computing opportunity cost matrices. We also prove theoretical results about Graver bases for deterministic and stochastic integer programs.\n\n\nThe rest of the paper is organized as follows. In Section <ref>, we provide background on opportunity cost matrices and their usefulness. In Section <ref>, we introduce the Gröbner and Graver bases and present our mathematical results. Section <ref> describes the algorithms that we then apply to generate our numerical results in Section <ref>. Finally, Section <ref> concludes.\n\n\n\n §.§ Notation\n Throughout this paper,  denotes the set of integers and  the subset of non-negative integers.\n\n\n\n\n\n§ OPPORTUNITY COST MATRICES\n\n\n\n\n\nConsider the following two-stage stochastic optimisation problem\n\n    min_x∈ F(x,ξ) =  min_x∈γ^⊤ x +  Q(x,ξ) \n    \twhere γ∈^d and  is the intersection of the integer lattice with a convex polyhedron. The random part Q of the objective function is given by\n    \tQ(x,ξ)     =  min c_ξ^⊤ y   T x + A y = h_ξ y∈^d\n\nwhere c_ξ∈^d  and b_ξ∈^k for all ξ and T and A are integer matrices of the required dimension. \nObserve that we assume T and A to be deterministic matrices, i.e. they are not random.\n\n\nIn general, it is not obvious how to obtain an explicit solution to (<ref>). The scenario approach in stochastic programming <cit.> consists of approximating the probability measure  on ξ that gives rise to the expectation operator  by a discrete measure assigning probabilities[i.e. p_n≥ 0 for all n and ∑_n=1^N p_n=1] p_1,...,p_N on a finite set of outcomes ξ_1,...,ξ_N(often called scenarios) for ξ. The set =ξ_1,…,ξ_N is then referred to as the scenario set.\n\nFor example, this can be achieved by the sample average approximation <cit.>, where the ξ_i are independent samples from  and are each assigned the same probability 1/N of occurring. In any case, the scenario approach yields optimisation problems of the form\n\n    minγ ^⊤ x+∑_i=1^N p_i c_i^⊤ y_i: x∈, A y_i=h_i-T x, y_i∈ℤ_+^n ∀  i.\n\nIn order to properly model the incertainty represented by , often a large number of scenarios must be generated. On the other hand solving problems of the form <ref> when N is large can be very computationally challenging. This motivates the idea of scenario reduction: can one find a small subset  of the scenario set =ξ_1,…,ξ_N such that replacing  by  in (<ref>) only incurs a small approximation error. \n\nGenerally speaking, scenario reduction methods can be separated into distribution-based and  problem-based methods. The former seek to minimise the difference (defined in some suitable sense) between the empirical measure of the subset and the original scenario set. See for example <cit.> for examples of this approach. On the other hand, problem-based methods <cit.> look to minimise the difference between the solutions associated to the larger and smaller problems, in other words scenarios are considered to be similar if they lead to similar decisions according to (<ref>). In <cit.>, the opportunity cost matrix was introduced. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tConsider a set of feasible decisions x_1,...,x_N∈ such that decision x_j is associated to scenario s_j. The opportunity cost matrix is the N× N matrix  whose (i,j) entry is _ij=F(x_i,ξ_j).\n\n\n\nClearly there are many interesting choices for the solutions x_j. \n\n\nIn <cit.> and <cit.>, the decisions x_n were chosen to be the single-scenario solutions of (<ref>), that is\n\n    x_j∈ F(x,ξ_j),\n\n\n\nIn this paper, we are looking for efficient methods of computing the matrix  in the context of the stochastic linear two-stage problem defined in (<ref>).\nSince the functions Q and F only differ by the linear term γ· x, we turn our attention to efficiently computing \n\n    Qx_i,ξ_j    = minc_j^⊤ y  A y = b_ij,\n\nwhere c_j=c(ξ_j), b_ij=b(x_i,ξ_j). Here, we write b(x,ξ)=h_ξ-T_ξ x.\nSince we had assumed A to be deterministic deterministic, the feasible region on the right-hand side of (<ref>) changes only through b_ij as i and j vary. \n\n\n\n\n§ GRÖBNER AND GRAVER BASES\n\n\n\n\nIn this section we develop the  theory of Gröbner and Graver bases that we require in order to justify and motivate the algorithms that will be described in Section <ref>.\n\n\nIn the previous section we saw that in order to compute the opportunity cost matrix, we are looking to solve integer optimisation problems of the form\n\n\n    cb:   minc^⊤ z: A z=b, z ∈^d\n\nfor a given integer matrix A but with varying cost vectors c∈ and constraint vectors b∈$̱. Here,and$̱ are finite sets corresponding to the values that the c(ξ_m) and b(x,ξ_m) of (<ref>) can take. Since we consider the matrix A to be fixed throughout, we do not include it in the notation.\n\nNote that the optimal solution to (<ref>) may not be unique, which is sometimes inconvenient. Whenever required, we can therefore replace (<ref>) by its refinement >_cb that we will define now. We begin my defining a total order[A total order on a set S is a binary relation ≺ on S such that a≺ b or b≺ a for all a,b∈ S with a b.]  on ^d.\n\n\n\n\t\n\tLet > be any total order on ^n and fix c∈^d. We define another order relation on ^n by saying that x>_c y  and only if\n\t\n\t\t\n  * c· x>c· y or\n\t\t\n  * c· x=c· y and x>y.\n\t\n\n\nUnless otherwise specified, the total order ≺ in Definition <ref> will be the lexicographical order, under which x>y if and only if the leftmost non-zero entry of x-y is positive.\n\n\n\n\tA  set _c⊆^d  is called a test set for the family of problems  cb b ∈ℝ^l if\n\t\n\t\t\n  * c· t>0  for all  t ∈𝒯_c\n\t\t\n  * for every  b ∈ℝ^l  and for every non-optimal feasible solution  z_0∈ℤ_+^d  to  A z=b , there exists a vector  t ∈𝒯_c  such that  z_0-t  is feasible. Such a vector is called an augmentation vector.\n\t\n\n\n\n\nGiven a test set  𝒯_c, the augmentation algorithm (Algorithm <ref>) provides a way to compute the optimum of >cb for any b∈$̱. Intuitively, while  there ist ∈𝒯_cwithc^⊤ t>0such thatz_0-tis feasible, we repetitively iteratez_0by assigningz_0:=z_0-t.\nThus, we are looking to efficiently construct a test set_cfor eachc∈. Observe that_c⊆(A)since bothz_0andz_0-tare feasible for anyt∈_cwhich implies that\n\n    A t     = A(z_0 - (z_0-t)) = Az_0 - A(z_0-t) = b-b = 0.\n\n\nIn the following we will exhibit two approaches to constructing such a test set. The first uses Gröbner bases and is described in Section <ref>. The second, based on Graver bases, goes one step further and constructs a universal test set, that is, a setcontaining a test set_cfor each cost vectorc∈.\n\n\n\n\n\n §.§ The Gröbner Basis Approach\n\n\nIt is now well known <cit.>\nthat Gröbner bases <cit.> yield test sets. The Buchberger algorithm<cit.> takes as input a set of polynomialsf_1,…, f_Mand returns the reduced Gröbner basis of the ideal generated by thef_j. A geometric version of the Buchberger algorithm was given in <cit.>. \nThis algorithm is at its most efficient if the generating set is small. We achieve this by using the toric ideal and in particular the methodology of <cit.>. The advantage is that this can be done once for all cost vectors, which is efficient in the context of computing opportunity cost matrices.\n\t\n\t\n\n\n\t\n\t\n\t\n\t\n\tWe will require the following result, which is a direct consequence of Dickson's Lemma <cit.> and can be found as Lemma 2.1.4 of <cit.>.\n\t\n\t\n\t\tLet A∈^l× d and let _c,b denote the set of non-optimal feasible solutions of cb.\n\t\tThen there exist α(t),…,α(t)∈^d such that\n\t\t\n    ⋃_b ∈^l_c,b=⋃_i=1^t(α(i)+N^n)\n\n\n\n\t\n\tThe vectorsα(1),…,α(t)allow us to compute a test set for the family of integer programscbb∈, via the the following result, which follows from the Gordon-Dickson Lemma and is stated as Corollary 2.1.10 of <cit.>. See also Lemma 2.1 in <cit.>.\n\t\n\t\n\t\tFix c∈^d, let α(1),…,α(t) as in Lemma <ref> and let β(i) be the (unique) optimum of the program >_cA α (i). Then the set\n\t\t\n    𝒢_A,c=(α(i)-β(i)),i=1,2,...,t\n\n\t\tis a minimal test set for the family of problems cb b∈^l.\n\t\n\tThe set  𝒢_A,c is called the Gröbner basis for the matrix A. \n\n\n\tWhile this result gives a formula for the desired test set, it requires computation of theα(i)from Lemma <ref> and, crucially, of theβ(i), which are given in terms of solutions of integer problems itself. A geometric construction of the test set was given in <cit.>.  \n\t\n\tAs explained above, we need to compute the solutions to>_cbascvaries. If we would like to take the Gröbner basis approach, we would need to recompute the Gröbner basis for every cost vectorc∈. Therefore, we proceed in a different manner, based on ideas from the theory of polynomial rings.\n\t\n\tLetR=xndenote the ring of polynomials innvariables. We will make frequent use of a close relation between vectors of integers and differences of monomials inR. Anyn-vector of non-negative integersα=(α_1,…,α_n)∈^ncan be identified with a monomialx^α∈Rdefined by \n\t\n    x^α = x_1^α_1⋯ x_n^α_n = ∏_j=1^n x_j^α_j,\n\n\tand this mapping can be extended to integer-valued vectors as follows. For anyα=(α_1,…, α_n)^n, defineα^+=(α_1^+,…,α_n^+)andα^-=(α_1-,…,α_n^-), recalling that the positive part of a real numberxis defined to bex^+=max(x,0)and the negative part ofxisx^-=(-x)^+. Then bothα^+, α^-∈^nandα=α^+-α^-.  We now define a mapping\n\t\n    ϕ^n⟶ R   by  ϕ(α) = x^α^+- x^α^-.\n \n\n\tThe notion of a Gröbner basis associated to a matrix from Definition <ref> is actually a special case of a more general concept, namely that of a Gröbner basis of a polynomial ideal.  In the following, we give a very brief account of the definition and basic properties of Gröbner bases. For more details see for example Chapter 1 of <cit.>. \n\t\n\t\n\t\tA subset I⊆ R is said to be an ideal of R if it satisfies the following two properties:\n\t\t\n  *  For any x,y∈ I we have x-y∈ I (that is, I is an additive subgroup of R),\n\t\t\t\n  *  For any x∈ I and r∈ R we have rx ∈ I.\n\t\t\n\t\tGiven polynomials f_1,…,f_n, the ideal generated byf_1,…,f_n is the set of all R-linear combinations of the f_j:\n\t\t\n    ⟨ f_1,…,f_n⟩    = ∑_j=1^n r_j f_j  r_1,…,r_n ∈ R .\n\n\t\tThe toric idealI_A of a matrix A∈^d× n is generated by differences of monomials x^u-x^v such that u-v lies in the kernel of A:\t\t\t\t\n\n\t\t\n    I_A     = ⟨ x^u-x^v  Au=Av ⟩.\n\n\t\nSee Section 4 of <cit.> for the theory of toric ideals. A polynomialf∈Rconsists of monomialsx^αwith degreeα∈^n. Throughout, we fix a total order (recall Definition <ref> and the discussion surrounding it)≺on^n. In principle, any total order will do, but for us,≺will always be the total order<_cdefined in Definition <ref>. Given≺, we can compare the different monomials by comparing their degrees. This allows us to define the initial monomial offto be that with the greatest degree (with respect to≺). The initial monomial offis denoted≺f. Given an idealIofR, the initial ideal ofIis the  ideal generated by the initial monomials of the elements ofI:\n\n    ≺ f     = ⟨≺ f  f∈ I ⟩.\n\n\t\n\tWe are now in a position to define Gröbner bases for polynomial ideals. \n\t\n\t\n\t\tLet I be an ideal of R. A subset  of I is said to be a Gröbner basis of I if the inital ideal of I is generated by the inital monomials of the elements of :\n\t\t\n    ≺ I     = ⟨≺ g  g∈⟩.\n\n\tA Gröbner basis  of I is said to be minimal if (<ref>) no longer holds whenever  any one element is removed from \t. Also,  is said to be reduced if for any distinct g_1,g_2∈ it holds that no term of g_1 is a multiple of ≺g_2.\n\t\n\nGiven an idealIofRand a total order on^n, there is only one reduced Gröbner basissuch that the coefficients of≺gare equal to1for eachg∈. In other words, reduced Gröbner bases are unique up to multiplying the elements by constants. \n\t\n\t\n\t\tRecall the vectors α(i) and β(i) from <ref>. The set of polynomials\n\t\t\n    _I_A   = x^α(j)-x^β(j) j∈1,…,t\n\n\tis the reduced Gröbner basis of the toric ideal I_A with respect to the ordering <_c.\n\t\n\n\tWe conclude that the two notions of Gröbner basis (of a matrix on the one hand and of a polynomial ideal on the other) are actually the same: they are related via the mapϕdefined in (<ref>). In fact, the original Buchberger algorithm <cit.> is formulated in this setting.\n\t\nIn <cit.>, an efficient algorithm to compute a small generating set of the toric idealI_A, see Algorithm <ref>. Observe that the toric ideal only depends on the matrixA, and not on the cost vectorc. This motivates our kernel algorithm, described in detail in Algorithm <ref>:\n\n\n  *  Given the matrix A, compute a small generating set of the toric ideal  I_A following <cit.>.\n\t\n  *  For each j∈1,…,N, apply Buchberger's algorithm to compute the Gröbner base with respect to A and <_c_j.\n\t\n  *  Use the correspondence (x^u-x^v) ⟷ u-v from (<ref>) to obtain the test set with respect to (A,c_j).\n\t\n  *  For each i,j∈1,…,N, apply the augmentation algorithm (Algorithm <ref>) to compute Q(x_i,ξ_j), and hence the (i,j)-entry of the opportunity cost matrix.\n\n\t\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\n\t\n\t\n\n §.§ The Graver basis approach\n\n\t\n\n\nIn the previous section, computing theN×Nopportunity cost matrix still required computingNtest sets via the Gröbner bases. This motivates the question whether it is possible to construct a single test set that not only covers all right-hand side vectorsbbut also all cost vectorsc. \n\n\n\tA set ⊆ is an universal test set for the matrix A if it contains a test set _c for every cost vector c.\n\n\n\nClearly, the Gröbner basis approach alone is insufficient for computing a universal test set, as this would require computing an infinite number of Gröbner bases. Instead, the Graver basis approach will be used. We begin by stating the definition of a Graver basis.\n\n\n\n\tAssume a=(a_1,a_2,...,a_n), b=(b_1,b_2,...,b_n) ∈ℤ^n. Then a ⊑ b if  ∀ i:  a_i b_i≥ 0 and |a_i| ≤|b_i|. \n Fix a integer matrix A. The Graver Basis of A is the set  of  ⊑-minimal elements in  Ker_ℤ(A): ={u ∈ℤ^n: A · u=0,u≠ 0}, denoted by Γ_A. \n\nIt is not immediately obvious thatΓ_Ais finite. However, finiteness ofΓ_Afollows from the following result gathered from <cit.>.\n\n\n\tLet 𝒢_A, c be the reduced  Gröbner basis of A with respect to >c. Then ⋃_c ∈ℤ^n𝒢_A, c⊆𝒢ℛ_A .\n\n\n\n\n\n\nNext, we state and prove a result about the relationship between the Graver Basis of the stochastic integer program <ref> and that of the deterministic integer program obtained by choosing a single scenario and assigning probability1to it:\n\n    min{c^⊤ x+ p q^⊤ y_: A x = b, x  ∈ℤ_+^m, T x+W_ y_=h_, y_∈ℤ_+^n}\n\nThen we assert a new result, which connects the Graver Basis of the SIP problem and the Graver Basis of the IP problem:\n\n Denote the Graver Basis of the SIP problem (5) by Γ_N, and that of the IP problem (<ref>) by Γ_1  for  i=1,2,...,N. If Ker_ℝ(A)=0, we have the following relationship Γ_N={(0,0,...,v_i,...,0):(0,v_i)∈Γ_1,i=1,2,...,n}\n\tThe corresponding coefficient matrix of (<ref>) is of the form\n\t\n\tA_N:=([ A 0 0 ⋯ 0; T W 0 ⋯ 0; T 0 W ⋯ 0; ⋮ ⋮ ⋮ ⋱ ⋮; T 0 0 ⋯ W ])\n\t\n\tand  the corresponding coefficient matrix of (6) is of the form \n\t\n\tA_1:=([ A 0; T W;   ]).\n\t\n\tSince Ker_ℝ(A)=0, we have Ker_ℤ(A_N)=(0,v_1,v_2,...,v_n):(0,v_i)∈Ker_ℤ(A_1) }. From the definition of the Graver Basis, we can arrive at the conclusion.\n\n\n§ ALGORITHMS\n\n\n\n\n\tIn this section, we describe numerical algorithms that follow from the mathematical development of the previous section. We first introduce the augmentation algorithm that computes an optimal solutions tocbfrom a test set_cand a feasible solutionz_0.\n\n\n\nFor details about Algorithm <ref> see <cit.>.\t\n\n\nThe kernel algorithm takes as input the matrixA, a sequence of cost vectorscand an array of right-hand side vectorsband computes the corresponding opportunity cost matrix, by first applying Algorithm <ref> and then repeatedly the Buchberger algorithm. In this way, a Gröbner basis forAis computed with respect to each>_c. The augmentation algorithm <ref> then gives the entries of the opportunity cost matrix for everycand everyb.\n\n\n\n\n\nFor the Graver basis approach, we apply the modified augmentation algorithm <ref> for a family of integer problems of the formminc^⊤xAx=bas bothbandcvary.\n\n\n \n\n\n§ PRELIMINARY RESULTS\n\n\n\nIn this section we test our approach on some numerical examples. The first is a well-known purely combinatorial stochastic program  introduced in <cit.>. The second is a stochastic network design problem. \n\n\n\n §.§ The example of <cit.>\n\n\nIn  <cit.>, the following stochastic integer program was introduced and studied.\n\n\n\n    min   {35 x_1+40 x_2+1/N∑_ν=1^N 16 y_1^ν+19 y_2^ν+47 y_3^ν+54 y_4^ν}\n    s.t.     x_1+y_1^ν+y_3^ν≥ξ_1^ν\n        x_2+y_2^ν+y_4^ν≥ξ_2^ν\n        2 y_1^ν+y_2^ν≤ξ_3^ν\n        y_1^ν+2 y_2^ν≤ξ_4^ν, \n        x_1, x_2, y_1^ν, y_2^ν, y_3^ν, y_4^ν∈ℤ_+\n\n\n\nAs in <cit.> the scenariosξ^νare chosen uniformly from the four-dimensional squares [300,12000] ×[300,12000]×[200,12000] ×[200,12000]. \nIn order to bring the problem in the form (<ref>), we introduce slack variablesu_j^νforj∈1,2,3,4and obtain\n\n\n    min   {1/N∑_ν=1^N 35 x_1+40 x_2+ 16 y_1^ν+19 y_2^ν+47 y_3^ν+54 y_4^ν}\n    s.t.     x_1+y_1^ν+y_3^ν -u_1^ν = ξ_1^ν\n        x_2+y_2^ν+y_4^ν -u_2^ν  = ξ_2^ν\n        2 y_1^ν+y_2^ν +u_3^ν = ξ_3^ν\n        y_1^ν+2 y_2^ν  + u_4^ν =  ξ_4^ν, \n        x_1, x_2, y_1^ν, y_2^ν, y_3^ν, y_4^ν, u_1^ν, u_2^ν, u_3^ν, u_4^ν∈ℤ_+.\n\n\n\n\nIn order to test our approach, we calculated the seconds of CPU time used by the programs on the Apple Silicon M1 chip. We observe that it is easy to read off a  feasible solution to the problem (<ref>)\n    x_1=x_2=y_1^ν=y_2^ν=0, y_3^ν=ξ_1^ν, y_4^ν=ξ_2^ν   (ν=1, … N)\n\n\n\n\n\nThe task is to compare the computational costs of the opportunity-cost matrix in the SIP problem in the last section. In other words, we compute a family of integer programming problems with three algorithms. We test the program's running time in CPU seconds on an Apple Silicon M1 chip with Python'spackage. Also, we introduce the modern MINLP solver, specially designed for mixed-integer programming problems, implemented by Python'spackage. We shall compare the computational costs of  our algorithms <ref> and <ref> with the MINLP solver in two cases. One is when we fix the sub-problem, and the other is when we fix the number of scenarios.\n\nWe shall compute the computational time when the quantity of scenarios equals 1, 20, 40, 60, 80, 100, 120, 140, 160, 180, and 200. We gather the numerical results in the table below. \n\n\n\n\nIt is remarkable that it only took about 0.1 seconds to compute the generating set of the toric ideal ofA, essential for the Gröbner Bases computation in all scenarios. By contrast, it took approximately 130 seconds to compute the Graver Basis ofA. Also we visualize the table in a line chart below. The horizontal axis represents the increasing quantity of scenarios, and the vertical axis represents the running time. The three curves with different colors in the picture represent three different methods.\n\n\n\nFigure <ref> shows that Algorithm  <ref> took almost 130 seconds to initialize and then the curve rises slowly. The computational cost of the MINLP solver grows extremely fast and starts to overpower the Algorithm   <ref> whenN=20. Generally, the curve of Algorithm <ref> shows superior performance when compared with the other two algorithms.\n\n\n\nNext, we compare when the complexity of the sub-problems increases. Below is the graph showing the trends of computational costs when the size of scenarios is fixed to 200 but the number of scenarios is increased. In Figure <ref>, with a fixed 200 scenarios, var*xrepresentsxvariables in the particular programming problem. As can be seen, by comparing the curves, the Gröbner Basis approach (the blue curve) is overall superior to the Graver Basis approach (the grey curve) and the traditional MINLP solver (the yellow curve). Also, regarding details, the Graver Basis method begins to suffer from the curse of dimensionality, starting from the problem's complexity being 20 variables, and so is the Gröbner Basis method but more dramatically. However, the MINLP solver does not reflect the apparent complexity when it suffers from the curse. Generally, the MINLP solver applies to situations where the sub-problem is large, and the number of scenarios is small. In contrast, the Gröbner Basis applies to situations where the sub-problem has little complexity, and the number of scenarios is significant.\n\n\n\n\nWe have yet to reflect one thing in the experiments. By testing our algorithm hundreds of times, we have come to the empirical conclusion that the time increase of our proposed algorithm in computing Grobner Basis will be dramatic forN > 15. And there will be geometric growth for the computational time regarding Graver Basis when the complexity is between 10 and 15 variables. Also, surprisingly, we can no longer compute the Gröbner Basis after 15 variables' complexity. We refer to this phenomenon as the curse of dimensionality in computational algebraic geometry regarding SIP problems. We conjecture that the crux is that the number of ideal minimal generating elements will increase dramatically as the dimension increases, thus making Bunchberger's algorithm computationally costly.\n\nFinally, the crux of the problem, that two algebraic methods don't function when the variables' number exceeds 15, is the computation of the Gröbner Basis of some specific ideals, specifically the toric ideal of the coefficient matrixA, unavoidable in each of the two algorithms. We have tried many applications specialized in algebraic calculations, for example, SageMath, Macaulay2, etc. Still, when the variables' number exceeds 15, usually the exponential of the generating elements of the polynomial ideal, which is required in the algorithm, is too great to be computable. For example, the computation of the Gröbner Basis of the matrixA=(B, I)whereIdenotes the identity matrix andB = [  1  1  1  1  1  1  1  1  1  1;  1  2  3  4  5  6  7  8  9 10;  2  3  4  5  6  7  8  9 10 11;  3  4  5  6  7  8  9 10 11 12;  4  5  6  7  8  9 10 11 12 13;  5  6  7  8  9 10 11 12 13 14;  6  7  8  9 10 11 12 13 14 15;    ]involves the computation of the Gröbner Basis of the toric ideal belowideal(x_8^2-x_7*x_9, x_7*x_8-x_6*x_9, x_6*x_8-x_5*x_9, x_5*x_8-x_4*x_9, x_4*x_8-x_3*x_9, x_3*x_8-x_2*x_9, x_2*x_8-x_1*x_9, x_1*x_8-x_0*x_9,  x_7^2-x_5*x_9, x_6*x_7-x_4*x_9, x_5*x_7-x_3*x_9, x_4*x_7-x_2*x_9, x_3*x_7-x_1*x_9, x_2*x_7-x_0*x_9, x_1*x_7-x_0*x_8, x_6^2-x_3*x_9, x_5*x_6-x_2*x_9, x_4*x_6-x_1*x_9, x_3*x_6-x_0*x_9, x_2*x_6-x_0*x_8, x_1*x_6-x_0*x_7,  x_5^2-x_1*x_9, x_4*x_5-x_0*x_9, x_3*x_5-x_0*x_8, x_2*x_5-x_0*x_7, x_1*x_5-x_0*x_6, x_4^2-x_0*x_8, x_3*x_4-x_0*x_7, x_2*x_4-x_0*x_6, x_1*x_4-x_0*x_5, x_3^2-x_0*x_6, x_2*x_3-x_0*x_5, x_1*x_3-x_0*x_4, x_2^2-x_0*x_4, x_1*x_2-x_0*x_3, x_1^2-x_0*x_2,  x_8*x_11*x_12*x_13*x_14*x_15*x_16-x_9, x_7*x_11*x_12*x_13*x_14*x_15*x_16-x_8, x_6*x_11*x_12*x_13*x_14*x_15*x_16-x_7,\nx_5*x_11*x_12*x_13*x_14*x_15*x_16-x_6, x_4*x_11*x_12*x_13*x_14*x_15*x_16-x_5,\nx_3*x_11*x_12*x_13*x_14*x_15*x_16-x_4, x_2*x_11*x_12*x_13*x_14*x_15*x_16-x_3,\nx_1*x_11*x_12*x_13*x_14*x_15*x_16-x_2, x_0*x_11*x_12*x_13*x_14*x_15*x_16-x_1,\nx_9*x_10*x_14*x_15^2*x_16^3-x_0*x_6*x_11^2* x_12, x_8*x_10*x_14*x_15^2*x_16^3-x_0*x_5*x_11^2* x_12, x_7*x_10*x_14*x_15^2*x_16^3-x_0*x_4*x_11^2* x_12,\nx_6*x_10*x_14*x_15^2*x_16^3-x_0*x_3*x_11^2* x_12, x_5*x_10*x_14*x_15^2*x_16^3-x_0*x_2*x_11^2* x_12, x_4*x_10*x_14*x_15^2*x_16^3-x_0*x_1*x_11^2* x_12,\nx_3*x_10*x_14*x_15^2*x_16^3-x_0^2*x_11^2* x_12, x_0*x_5*x_11^3*x_12^2*x_13-x_9*x_10*x_15*x_16^2, x_0*x_4*x_11^3*x_12^2*x_13-x_8*x_10*x_15*x_16^2,\nx_0*x_3*x_11^3*x_12^2*x_13-x_7*x_10*x_15*x_16^2, x_0*x_2*x_11^3*x_12^2*x_13-x_6*x_10*x_15*x_16^2, x_0*x_1*x_11^3*x_12^2*x_13-x_5*x_10*x_15*x_16^2,\nx_0^2*x_11^3*x_12^2*x_13-x_4*x_10*x_15*x_16^2, x_2*x_10*x_13*x_14^2*x_15^3* x_16^4-x_0^2*x_11, x_1*x_10*x_12*x_13^2*x_14^3*x_15^4* x_16^5-x_0^2,\nx_10*x_11*x_12^2*x_13^3*x_14^4*x_15^5* x_16^6-x_0),In future work, we will study how the situation can be improved by  optimising the algorithm for computation of Gröbner bases, for example, the FaugèreF_4<cit.> andF_5<cit.> algorithms.\n\n\n\n\n §.§ Stochastic network design\n\n\nWe have also tested our approach on a small stochastic network design problem, formulated as follows:\n\n    min   ∑_a ∈ A c_a x_a+1/N∑_i=1^N∑_c ∈ C∑_a ∈ A q_a c y_a c^i\n     s.t.    ∑_a ∈ A \n     a(0)=v y_a c^i-∑_a ∈ A \n     a(1)=v y_a c^i=d_v, c^i  ∀(v, c, i) ∈ V × C ×{1, …, N}\n       ∑_c ∈ C y_a c^i≤ u_a x_a  ∀(a, i) ∈ A ×{1, …, N}\n        x_a∈{0,1}, y_a c^i∈\n\n\nFollowing the same procedure as in Section <ref>, we compare our two algorithms with a commercial solver. Our instances concern a small problem, with three vertices and three arcs. Figure <ref> shows the time taken to compute the opportunity cost matrix for each approach.\n\nWe once more observe the superior efficiency of the kernel approach when the number of decision variables is small.\n\n\n\n\n\n§ CONCLUSION\n\n\nIn this paper, we have presented new algorithms for computing the opportunity cost matrix of <cit.> using algebraic methods using Gröbner and Graver bases. We have also provided mathematical results showing the relationship of Graver bases for deterministic and stochastic integer programs. Our numerical results show that the Gröbner basis is very efficient as the number of scenarios increases if the number of variables of the underlying integer program does not grow too fast. On the other hand, the Graver basis approach is interesting when there are a large number of variables.\n\nIn future work, we propose to include more recent methods of computing Gröbner basis, such as the Faugère algorithms. We will also study how to combine the algebraic approach with approximations such as Lagrangian cuts in order to increase further the number of decision variables that our approach can handle."}