{"entry_id": "http://arxiv.org/abs/2303.06723v1", "published": "20230312180530", "title": "Running couplings and unitarity in a 4-derivative scalar field theory", "authors": ["Bob Holdom"], "primary_category": "hep-th", "categories": ["hep-th"], "text": "  \n\n\n\nbob.holdom@utoronto.ca\nDepartment of Physics, University of Toronto, Toronto, Ontario, Canada  M5S 1A7\n\nWe obtain the β-functions for the two dimensionless couplings of a 4d renormalizable scalar field theory with cubic and quartic 4-derivative interactions. Both couplings can be asymptotically free in the UV, and in some cases also in the IR. This theory illustrates the meaning of unitarity in the presence of a negative norm state. A perturbative calculation that accounts for the new minus signs shows that the optical theorem is identically satisfied. These minus signs also enter a discussion of tree-level scattering. For a certain setup involving colliding beams of particles we find even more intricate cancellations and quite normal behaviour at high energies.\n\nRunning couplings and unitarity\nin a 4-derivative scalar field theory\n    Bob Holdom\n    \n=====================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nWe consider the following real scalar field theory in four spacetime dimensions, with four derivatives appearing in both the kinetic term and the cubic and quartic interaction terms,\n\n    L_1=1/2∂_μϕ(+m^2)∂^μϕ+λ_3(∂_μϕ∂^μϕ) ϕ+λ_4(∂_μϕ∂^μϕ)^2.\n\nThe scalar field ϕ=ϕ(x) is dimensionless, as are the couplings λ_3 and λ_4. We shall allow these couplings to have either sign. The mass term breaks a classical scale invariance. At low enough energies only the mass term survives and the field can be re-scaled to absorb the mass, leaving a free and massless theory. Our interest is then in the UV behaviour of the theory. Many of our results will be obtained by calculating with a finite mass and then taking the m→0 limit at the end. These mass independent results will exhibit the manner in which the scale invariance is broken quantum mechanically. We do not claim that this m→0 limit should be taken as the definition of the theory where m is identically zero to begin with. That theory has problems with its definition and cannot be handled directly by standard methods. The theory in (<ref>) can be.\n\nThis theory also exhibits a simple shift symmetry ϕ(x)→ϕ(x)+c. A term has a shift symmetry if a derivative acts on every factor of ϕ(x), or if not, the term is equivalent to one that is by integration by parts. Since the field is dimensionless the shift symmetry excludes an infinite number of terms with dimensionless couplings. If the ϕ field couples to any other field then the shift symmetry must also be preserved by that coupling. The shift symmetry, along with the four derivative kinetic term and the lack of couplings with inverse mass dimensions, ensures that the theory is renormalizable. The two simpler theories, with λ_3=0 or λ_4=0 respectively, are also renormalizable, and sometimes our focus will be on one of those theories.\n\nOur first goal is to study the renormalization of (<ref>) and to obtain the one-loop β-functions for the couplings λ_3 and λ_4. We will display the flow diagram of the running couplings that shows their behaviour in both the UV and the IR, where by IR we mean scales that are still above the arbitrarily small mass m. Perhaps most notable is that there is a family of trajectories where both couplings are asymptotically free in both the UV and the IR. Our other goals are to study the unitarity of the theory and the behaviour of scattering at high energies.\n\nA higher derivative scalar field theory has been extensively studied in another context <cit.>. This is the theory of the conformal factor of the metric as extracted from an effective action related to the conformal anomaly, which in turn is generated by loops of light particles. A simple form of such a Lagrangian using conventional notation is\n\n    L_ conf=-θ^2(σ)^2-ζ[2(∂σ)^2σ+(∂σ)^4]+γ e^2σ(∂σ)^2-λ e^4σ.\n\nThe corresponding action has a global conformal symmetry, and this is what relates the coefficients in the second term and brings in the exponential factors in the last two terms, which are the mass and cosmological constant terms. The interest in (<ref>) is usually driven by its effective description of possible infrared physics whereas our interest in (<ref>) is in the UV. Calculations of β-functions for (<ref>) usually do not treat renormalization of (σ)^2 as a wave function renormalization, and so give different results. β-functions of the more standard type were given in <cit.>, but there are various minus sign and factor of 2 deviations from our results. Very recent results for the renormalization of (<ref>) have been given in <cit.>, without giving β-functions, and our results agree where they overlap. \n\nOther recent studies of higher derivative scalar theories have appeared in various contexts <cit.>, but without considering both the λ_3 and λ_4 couplings simultaneously. There is interest in these theories even with an assumed lack of unitarity due to the existence of a negative norm state. But there is more to the unitarity story than this. As far as we are aware, the authors of <cit.> were the first to look more closely at the optical theorem in higher derivative scalar theories and its relation to renormalizability. (One of their criteria for renormalizability appears to be equivalent to requiring the shift symmetry to apply only to terms with dimensionless couplings.) These authors derive an inequality from the optical theorem and weak coupling and show by example that it is satisfied only when the theory is renormalizable, with their positive example being the λ_3=0 theory. The authors refer to this as S-matrix unitarity, the fact that SS^†=1 can still hold, even though it no longer implies the standard bound on the size of amplitudes at high energies.\n\nAnother motivation for the study of (<ref>) is its similarity to quantum quadratic gravity. The latter is also a renormalizable quantum field theory <cit.> with four derivatives in all terms except for a mass term with two derivatives. The mass term is the Einstein term and the two four-derivative interaction terms are curvature-squared terms with dimensionless couplings. The mass term again breaks a classical scale invariance, while the coordinate invariance of quadratic gravity is the analog of the shift symmetry of (<ref>). Quadratic gravity is a significantly more complex theory, and so the theory in (<ref>) is thus a useful proxy for quadratic gravity where we can much more easily obtain loop amplitudes, and where we can in particular investigate the optical theorem.\n\nWith the completeness relation\n\n    1=∑_X∫ dΠ_X |X⟩⟨ X|/⟨ X|X ⟩\n\ninserted on the RHS of -i(T-T^†)=TT^†, where S=1+iT, we see that there are new minus signs on the RHS of the optical theorem when some of the states |X⟩ have negative norm. These signs produce the cancellations among the terms on the RHS as observed by <cit.>. By focussing on the inequality satisfied by the RHS, those authors avoided calculating the one-loop amplitude appearing on the LHS of the optical theorem. In Section <ref> we shall use the λ_3=0 theory to calculate both the LHS and RHS to show that the optical theorem at order λ_4^2 is identically satisfied, both in the m→0 limit and for finite m. We can refer to the theory as having unitarity without positivity.\n\nWe then argue that the structure of the theory puts constraints on the scattering experiments that can actually be physically realized. In Section <ref> we calculate the lowest order event rates in such scattering experiments and find that they can have high energy behaviour similar to theories with standard unitarity bounds. This is due to even more intricate cancellations brought about by the lack of positivity among the terms summed in an inclusive process. We have also found these types of cancelations for the scattering of gravitational degrees of freedom in <cit.> and for photon scattering in <cit.>, both in the context of quantum quadratic gravity.\n\n\n\n§ RENORMALIZATION AND RUNNING COUPLINGS\n\nWith the following transformations,\n\n    ϕ   =ψ_1-ψ_2,\n    ψ_1   =1/m^2(+m^2)ϕ,\n    ψ_2   =1/m^2ϕ,\n\nLagrangian L_1 can be converted to Lagrangian L_2,\n\n    L_2   =-m^2/2ψ_1ψ_1+m^2/2ψ_2(+m^2)ψ_2\n       +λ_3(∂ψ_1-∂ψ_2)^2(ψ_1-ψ_2)\n       +λ_4(∂ψ_1-∂ψ_2)^4.\n\nL_2 is familiar for having the wrong sign kinetic term for ψ_2. We have chosen to keep the ψ_1 and ψ_2 fields dimensionless, since it is not difficult to account for the m^2 normalization of the kinetic terms in calculations. Note that the shift symmetry ϕ→ϕ+c corresponds to ψ_1→ψ_1+c and ψ_2→ψ_2.[That these two Lagrangians are the same can be deduced by substituting (<ref>) into the quadratic term in (<ref>), taking the difference with the quadratic terms in (<ref>), and then substituting (<ref>) and (<ref>) into the result to find zero after an integration by parts.]\n\nLagrangian L_1 can be taken to define a propagator of double pole form,\n\n    -i/(k^2+iϵ)(k^2-m^2+iϵ)\n    .\n\nThis gives Feynman diagrams where the number of propagators is effectively doubled, where each pair of propagators with the same momentum can be interpreted to bring in an additional zero-momentum vertex. The diagram can thus be evaluated by standard methods. But when the effective number of propagators grows to six or more then standard methods are not so well developed and this approach quickly becomes cumbersome.\n\nFor the second Lagrangian L_2, the number of fields is doubled, and so each internal line can be one of the following two propagators,\n\n    1/m^2 i/k^2+iϵ,  -1/m^2 i/k^2-m^2+iϵ.\n\nOnly the first has the normal sign. The number of diagrams quickly grows with the number of internal lines, but standard methods can now more easily deal with, say, four propagators in a loop, rather than eight that would occur from L_1.\n\nWe can suppose that either of these Lagrangians are composed of renormalized fields and renormalized couplings m, λ_3 and λ_4. These renormalized quantities are related to bare quantities via the renormalization constants ϕ_0=Z_ϕ^1/2ϕ, m_0^2=Z_m m^2, λ_30=Z_3λ_3 and λ_40=Z_4λ_4. A counterterm Lagrangian is constructed using these renormalization constants such that the total Lagrangian yields finite results at one-loop. The respective counterterm Lagrangians are\n\n    L_1^ c.t.   =1/2∂ϕ[(Z_ϕ-1)+(Z_ϕ Z_m-1)m^2]∂ϕ\n       +(Z_ϕ^3/2 Z_3-1)λ_3(∂ϕ)^2ϕ\n       +(Z_ϕ^2 Z_4-1)λ_4(∂ϕ)^4,\n\n\n    L_2^ c.t.   =-m^2/2ψ_1(Z_ϕ Z_m-1)ψ_1+m^2/2ψ_2[(Z_ϕ Z_m-1)+(Z_ϕ Z_m^2-1)m^2]ψ_2\n       +(Z_ϕ^3/2 Z_3-1)λ_3(∂ψ_1-∂ψ_2)^2(ψ_1-ψ_2)\n       +(Z_ϕ^2 Z_4-1)λ_4(∂ψ_1-∂ψ_2)^4.\n\nThe total Lagrangians L_1+ L_1^ c.t. and L_2+ L_2^ c.t. when written in terms of bare quantities take the same form as the original Lagrangians L_1 and L_2. We have used Z_ψ_1=Z_ψ_2=Z_ϕ.\n\nEither L_1 or L_2 can be used to extract the various renormalization constants. Using dimensional regularization with\n\n    2/ε=2/4-d-γ_E+ln(4π),\n\nwe find the following results[Our calculations use a combination of Maple and Package-X <cit.> for Mathematica.]\n\n    Z_ϕ Z_m-1   =-3λ_4/4π^21/ε,\n    \n    Z_ϕ -1   =5λ_3^2/8π^21/ε,\n    \n    Z_ϕ^3/2 Z_3-1   =-5λ_4/4π^21/ε,\n    \n    Z_ϕ^2 Z_4-1   =-5λ_4/4π^21/ε.\n\nThe one-loop one-particle-irreducible diagrams that produce these ε-poles are those that involve one or two propagators, and the four diagrams corresponding to (<ref>), (<ref>), (<ref>), (<ref>) respectively are shown in Fig. <ref>.[The use of L_1 to calculate these diagrams is somewhat simpler, and if L_2 is used to extract Z_ϕ and Z_m, the one-loop corrections that emerge are in the form of the kinetic terms in L_1 after inserting ϕ=ψ_1-ψ_2.]\n\n\n\nThere are also 3 and 4-point one-particle-irreducible diagrams that have more than two propagators, as shown in Fig. <ref>. Power counting arguments suggest that these diagrams should also have log divergences, similar to the diagrams in Fig. <ref>. But this is not the case; we find that the diagrams in Fig. <ref> are finite by explicit calculation using L_2. (For the first diagram in Fig. <ref> this was noted in <cit.>.) Why this is so is related to renormalizability. The diagrams in Fig. <ref> can be converted to 5, 6, 7 or 8-point functions by converting cubic vertices to quartic vertices. Power counting suggests that those diagrams also have log divergences. But there are no counter-terms with these numbers of fields, due to the shift symmetry, and so the absence of divergences for such diagrams must be due to the shift symmetry. It thus appears that the diagrams in Fig. <ref> are finite for this reason as well.\n\n\n\nThe nature of the divergence in the first diagram in Fig. <ref>, which renormalizes the m^2∂ϕ∂ϕ term, is different from the other three. Other than the factor of p^2m^2, there is no further momentum dependence and thus no scale dependence from this tadpole-type diagram. If we define the anomalous dimensions as γ=1/2dZ_ϕ/dlnμ and γ_m=1/2dZ_m/dlnμ then we have\n\n    γ=-γ_m=5λ_3^2/16π^2.\n\nThe running of the mass is due entirely to the wave function renormalization and the mass term as a whole has no scale dependence.\n\nThe other three diagrams in Fig. <ref> do introduce nontrivial scale dependence. The β-functions in d=4 dimensions are given by the residues of the 1/(4-d) poles in Z_3 λ_3 and Z_4 λ_4 respectively,\n\n    dλ_3/dlnμ   =-5/4π^2(λ_4λ_3+3/4λ_3^3),\n    dλ_4/dlnμ   =-5/4π^2(λ_4^2+λ_4λ_3^2).\n\nThe second term in each β-function is due to the wave function renormalization. Clearly both couplings are asymptotically free in the UV when both are positive. For general signs, we show the flow diagram for the two couplings in Fig. (<ref>). Interesting behaviour occurs in the quadrants where λ_4<0. Then there are trajectories where both couplings are asymptotically free in both the UV and the IR, such that |λ_3| and |λ_4| reach maximum values at intermediate scales. The decrease of |λ_3| and |λ_4| in the IR will continue down to the scale of the mass, below which the theory is trivial.\n\nOur results for the β-functions depend on the normalizations and signs in our definition of the theory in (<ref>). For example it may be common to reverse the signs of the interaction terms, in which case (<ref>, <ref>) are transformed with λ_3→-λ_3 and λ_4→-λ_4. The resulting flow diagram is obtained from the one in Fig. (<ref>) by flipping it around the line λ_4=0. In <cit.> the λ_3=0 and λ_4=0 theories are treated separately, and so they obtain the λ_3^3 term in (<ref>) and the λ_4^2 term in (<ref>) (the latter is also obtained in <cit.>). Our results agree.\n\n\nWith dimensional regularization we can reduce the number of spacetime dimensions d and look for 1/(2-d) poles, which would correspond to quadratic divergences in four dimensions. We find a 1/(2-d) pole only in one case, in the tadpole diagram associated with the mass renormalization. The other diagrams in Fig. <ref> are finite in two dimensions.\n\n\n\n§ UNITARITY AND THE OPTICAL THEOREM\n\nFirst we give the full momentum dependent amplitudes corresponding to the last three diagrams in Fig. <ref>, after taking the m/E→0 limit. No infrared divergences are encountered in this limit. The Feynman amplitudes are a factor of i times the following two, three and four-point functions. The 1/ε poles appearing here are cancelled by the counterterms.[The overall sign of these results depends on the number of ψ_2 fields, as is the case for the tree-level vertices. The results presented assume an even number. This is also the case of interest for the optical theorem, since elastic scattering involves the same particles in the initial and final states.]\n\n    Σ(p)   =λ_3^2/(4π)^2(p^2)^2(10/ε+3+5log(-μ^2/p^2))\n    Γ_3(p,q)   =λ_3λ_4/(4π)^2((80/ε+112/3)((pq)^2-p^2q^2).\n        -8/3[(7 p^2 q^2+6 (pq)p^2 - (pq)^2) log(-μ^2/p^2) + ( 7 p^2 q^2+6 (pq) q^2-(pq)^2 ) log(-μ^2/q^2)\n       .+(p^2 q^2 - 6 (pq)(p^2+ q^2)  - 13 (pq)^2)  log(-μ^2/(p+q)^2)])\n    Γ_4(s,t)   =λ_4^2/(4π)^2((80/ε+112/3)(s^2+st+t^2)+i8/3π (7s^2+st+t^2).\n       .+8/3 [(7 s^2 + s t + t^2) log(μ^2/s) + (s^2 + s t + 7 t^2) log(-μ^2/t) + (7 s^2 + 13 s t + 7 t^2) log(μ^2/s + t)])\n\n\nOur focus shall be on the optical theorem for two-to-two scattering where we restrict to the λ_3=0 theory, and for which the four-point function Γ_4(s,t) is of interest. We have assumed that the four external particles are on-shell, and so the m/E→0 limit produces a four-point function that is a function of the Mandelstam variables s and t.[A similar result is obtained in <cit.>.] It is evaluated in the physical region where s>0,t<0,s+t>0 such that the imaginary part is displayed explicitly. For elastic scattering in the forward direction we are interested in Γ_4(s,0); twice its imaginary part is the s cut discontinuity that is related by the optical theorem to an inclusive cross section (with the initial state normalization factor omitted). We see from (<ref>) that this discontinuity is 7s^2/3π.\n\nBefore checking the optical theorem we first mention some factors appearing in an exclusive cross section. Most importantly the ψ_2 state is a negative norm state, and this results in a factor (-1)^n_2 where n_2 is the number of ψ_2's in the initial and final states. The presence of the m^2 factors in the kinetic terms of L_2 also implies an additional normalization factor of 1/m^2 for each ψ_1 or ψ_2 state. These factors would seem to make the m→0 limit problematic, but this is not the case for the optical theorem.  We can also comment on the LSZ reduction formulas that extract scattering amplitudes from the residues of the poles of Greens functions. For Lagrangian L_1 each external line is associated with two poles, and so the residues of the various products of poles give the scattering amplitudes. For Lagrangian L_2 the reduction formula is more standard, and indeed, the definition of ψ_1 and ψ_2 in (<ref>) and (<ref>) can be seen to leave just one pole for each external line.\n\nThe RHS of the optical theorem involves the squares of tree-level, two-to-two amplitudes generated by the quartic interaction. They are summed over the possible final states for a fixed initial state with the factors we have just mentioned for each final state (but not for the initial state). We employ on-shell kinematics for all particles and express each amplitude in terms of s and m and the scattering angle in the centre-of-momentum frame. The angular integration of the sum of squares is done with a factor of 1/2 to avoid double counting, after which we finally let m/E→0. We find that the result is 7s^2/3π and so the optical theorem is satisfied. Any of the initial states, ψ_1ψ_1, ψ_2ψ_2 or ψ_1ψ_2 gives the same result.\n\nWe can also consider the finite mass version of the optical theorem, and for this we restrict to the ψ_1ψ_1 initial state. For the LHS we evaluate the fourth diagram of Fig. <ref> without taking the m/E→0 limit and find that the discontinuity across the s cut is\n\n    λ_4^2/30 m^4 π   (21 s^4  θ(s) - \n       2/s (s-m^2 )^3 (21 s^2 + 8 m^2 s + m^4)  θ(s-m^2).\n       .+  \n       s √(s (s-4 m^2)) (21 s^2 - 68 m^2 s +56 m^4) θ(s-4 m^2) )\n    .\n\nFor the RHS we just avoid taking the m/E→0 limit in the previous evaluation of the RHS. The result is again (<ref>) and so this confirms the optical theorem for any m. Due to the negative sign of the θ(s-m^2) term, at large s the cancellations produce s^2 behaviour rather than the naive s^4/m^4 behaviour. This minus sign is due to a negative propagator when the LHS is calculated, and it is due to a negative norm when the RHS is calculated. So it is not a surprise that the optical theorem is satisfied. The theory is displaying unitarity without positivity. This more accurate description allows us focus on the actual nonstandard property of the theory, which is the lack of positivity.\n\nThe RHS of the optical theorem becomes a cross section when multiplying by the normalization factor for the initial state (∝1/(sm^4)). It is this factor that introduces a minus sign for the ψ_1ψ_2 initial state, meaning that this cross section is negative. But ψ_2 does not describe an asymptotic state and so this initial state cannot be treated in isolation. The massive ψ_2 particle is unstable, decaying into 2ψ_1 or 3ψ_1 or any other light particles to which it couples. The proper time between the original production of the ψ_2 and its scattering must be less than the ψ_2 lifetime. There is another minus sign built into the ψ_2 production cross section, and so there are two minus signs, in the production and scattering cross sections respectively, that cancel in the product.\n\nWe shall instead turn to high energies and short time scales so that both mass and decay effects are small. Within this context we can consider a standard scattering experiment involving the collision of two beams of particles. The two beams should be composed of nearly equal numbers of ψ_1 and ψ_2, since the ψ_2 or ψ_1 particles are produced through couplings that always involves the combination ψ_1-ψ_2 and so the two particles are equally likely to be produced. It appears that this setup can be treated in isolation and in this case it is a sum of probabilities that is positive. We develop this picture in the next section.\n\nIf it was possible to have pure ψ_1 beams, for example by utilizing long enough times for the initial beams to be depleted in ψ_2's, due to their decay, then the cross section would behave like s/m^4 for large s. This violation of an upper bound, that is normally attributed to unitarity, is allowed when unitarity comes without positivity <cit.>. But there is a caveat regarding this picture of on-shell scattering at large s. It may be that the analog of parton showers occur in both the initial and final states, which would imply that the actual hard scattering occurs between highly virtual excitations of the ψ_1 and ψ_2 fields. Then on-shell particles and negative norm states are not actually involved in the hard scattering process. So it is still not certain that the s/m^4 behaviour can be realized. In any case, the on-shell picture with suitably inclusive differential cross sections could still provide a useful type of dual description, as it does in perturbative QCD. This is the view that was taken in <cit.> and the discussion of the next section can be viewed in this light.\n\n\n\n§ A SCATTERING EXPERIMENT\n\nThe sum or average over ψ_1 and ψ_2 in the initial state is trickier to deal with than an averaging over, for example, polarizations. As before we calculate for finite m first before taking the m/E→0 limit. Since intricate cancellations take place in this limit, we need to properly account for all mass effects before the limit is taken. We shall introduce a luminosity factor to better describe the initial state, since this factor is another source of mass dependence. We assume short time scales so that the effect of ψ_2 decay can be ignored.\n\nConsider the collision of two finite beams of particles, each containing both types of particles.  A choice of initial state i=(A,B) corresponds to considering the collision of particles of type A in one beam with particles of type B in the other beam. And for a choice i we can consider the integrated luminosity L^ int_i such that its product with the cross section σ_i→ f gives the number of scattering events from initial state i to final state f. The integrated luminosity is an integral of the Lorentz invariant luminosity density S, <cit.>\n\n    L^ int_i=∫ dtd^3x S,   S=√((j_A j_B)^2-j_A^2 j_B^2).\n\nThe 4-vector j^μ is a particle current density. j^μ is proportional to p^μ, and in particular j^μ=(ρ/E)p^μ where ρ is a particle density. Thus ρ/E is a Lorentz invariant constant and we can write\n\n    S   =ρ_Aρ_B/E_A E_B√((p_A p_B)^2-m_A^2 m_B^2).\n\nThe actual values of ρ_A and ρ_B are functions of the respective momenta p_A and p_B of the particles A and B occurring in the beams.\n\nNow let us go to the centre-of-momentum frame where\n\n    L^ int_iσ_i→ f   =F_AB√(s)p_i/E_A E_Bσ_i→ f,\n    \n    F_AB   =∫ dtd^3x ρ_Aρ_B.\n\nWe have used √((p^μ_A p_Bμ)^2-m_A^2 m_B^2)=√(s)p_i, where p_i is the magnitude of the equal and opposite 3-momenta describing the initial state in this frame. F_AB describes the beams and has dimensions of inverse area. Also in this frame the exclusive differential cross section is\n\n    dσ_i→ j/dΩ=(-1)^n_2/m^81/64π^2 sp_f/p_i| M_fi(s,θ)|^2,\n\nwhere Ω=(θ,ϕ) characterizes the direction of a final state 3-momentum, of magnitude p_f, relative to the initial state 3-momentum. Note that p_i, p_f, E_A, E_B are all determined from the value of s and the masses and from the constraint that all particles are on shell. We have mentioned the origin of the (-1)^n_2/m^8 factor above.\n\nThe combination of (<ref>) and (<ref>) shows that the total number of scattering events in differential form is given by\n\n    dN/dΩ=∑_i,f(-1)^n_2/64π^2F_AB1/E_A E_Bp_f/√(s)1/m^8| M_fi(s,θ)|^2.\n\nThe sum over i and f sums over all combinations of ψ_1 and ψ_2 in the initial and final states that are kinematically allowed by the value of s being considered. Although we are only calculating this at tree level, the imposition of the on-shell constraints produces a lengthy expression. Cancellations occur in the m/E→0 limit as long as the particle densities that determine F_AB in the limit become independent of whether particles A and B are massive or massless. For example ρ_A and ρ_B can be functions of the velocities p_i/E_A and p_i/E_B respectively.\n\nFirst we consider the λ_3=0 theory, where the tree level diagram is just the quartic vertex. For our first example we simply set F_AB to a constant F. Then the leading term in the m/E→0 limit is\n\n    dN/dΩ=8  λ_4^2F/s(5 cos(θ)^4+2 cos(θ)^2+1).\n\nFor the second example we introduce an extra product of velocities, F_AB=(p_i^2/E_A E_B)F. Then the leading term in m/E→0 limit is\n\n    dN/dΩ=8 λ_4^2F/s(35 cos(θ)^4+54 cos(θ)^2+15)\n\nAs a third example we remove the luminosity factor altogether and simply sum the cross sections. Then the result is\n\n    dN/dΩ=16  λ_4^21/s(5 cos(θ)^2+1).\n\n\nThese results are all positive definite. Since the individual amplitudes grow like s^2, any term in the sum in (<ref>) has a factor that goes like (s/m^2)^4/s. We instead see that intricate cancellations produce 1/s behaviour at large s. This behaviour is the same as for theories that have standard unitarity bounds. We see that the cancellations are quite robust, leaving only the angular dependence sensitive to the precise beam description.\n\nWe can also consider the same scattering experiment for the λ_4=0 theory. In this case each of the tree diagrams is a one-particle exchange diagram. Performing the sum over initial and final states as described above again gives a result that falls like 1/s at large s. The θ dependence now features a 1/sin(θ)^4 pole behaviour for forward and backward scattering, due to the exchange of (near) massless particles. For the same three examples the θ dependence is again positive definite.\n\n\nGoing back to the λ_3=0 theory, we can consider the number of scattering events in (<ref>) without taking m/E→0. After doing the angular integration we display the result in Fig. <ref> for the two different choices of F_AB, both of which give positive definite results. In the second case the extra factors of velocity suppress the ψ_2 contribution close to the thresholds where these massive particles are slow. The suppression of the negative norm contributions means that the final positive result is larger. Trouble finally arrives for the third example we considered, the naive sum over cross sections, which gives a result that is not positive definite. Here we notice the 1/p_i factor in (<ref>), which is enhanced for a slow ψ_2 in the initial state. We have arrived back with an initial state that cannot be treated in isolation.\n\n\n\n§ COMMENTS\n\nWe have presented a number of standard calculations within a 4-derivative quantum field theory with a negative norm state. The results show more similarities to standard 2-derivative theories than might have been expected. Rather paradoxically, it is the negative norm state itself that makes these similarities possible. The optical theorem being satisfied and the good high energy behaviour of inclusive scattering rates are both due to the cancellations brought about by the negative norm state. On top of this we have a four dimensional scalar field theory that exhibits asymptotic freedom in the UV with a possible concurrent asymptotic freedom in the IR.  \n\nOne difference between 2 and 4 derivative theories involves the classical limit. The negative norm is a consequence of the manner in which the theory is quantized so as to ensure the propagation of positive energy only, and thus stability. There is no analog of negative norms in the classical theory, which instead directly exhibits negative energies and instabilities. We have mentioned that the theory becomes a free 2-derivative theory for wavelengths larger than 1/m, and it is only here that the classical wave solutions make sense. The classical limit of quantum quadratic gravity must similarly involve long wavelengths where Einstein gravity applies. At short wavelengths these theories are intrinsically quantum.\n\nOur approach to the theory has been strictly perturbative where, besides some unusual signs, standard Feynman methods apply. The perturbation theory displays a standard analytic structure.  An example of a deviation from this strictly perturbative approach is the resummation of the one-loop self-energy to obtain a dressed propagator. As soon as this is done the causal structure of the theory changes due to the abnormal structure of the dressed propagator. The dressed ψ_2 propagates in a peculiar way over time scales of order its lifetime <cit.>. At the higher energies and shorter times scales of interest to our study here, it is appropriate to use the strictly perturbative approach. \n\n\n99\nant I. Antoniadis and E. Mottola, “Four-dimensional quantum gravity in the conformal sector”, Phys. Rev. D45 (1992) 2013.\nElizalde:1994sn\nE. Elizalde, A. G. Zheksenaev, S. D. Odintsov and I. L. Shapiro,\n“One loop renormalization and asymptotic behavior of a higher derivative scalar theory in curved space-time,\nPhys. Lett. B 328, 297-306 (1994)\n\n[arXiv:hep-th/9402154 [hep-th]].\nAntoniadis:1994ij\nI. Antoniadis and S. D. Odintsov,\n“Renormalization group and logarithmic corrections to scaling relations in conformal sector of 4-D gravity,”\nPhys. Lett. B 343, 76-80 (1995)\n\n[arXiv:hep-th/9411012 [hep-th]].\nSilva:2023lts\nW. C. Silva and I. L. Shapiro,\n“Effective approach to the Antoniadis-Mottola model: quantum decoupling of the higher derivative terms,”\n[arXiv:2301.13291 [hep-th]].\nSafari:2021ocb\nM. Safari, A. Stergiou, G. P. Vacca and O. Zanusso,\n“Scale and conformal invariance in higher derivative shift symmetric theories,”\nJHEP 02, 034 (2022)\n\n[arXiv:2112.01084 [hep-th]].\nBuccio:2022egr\nD. Buccio and R. Percacci,\n“Renormalization group flows between Gaussian fixed points,”\nJHEP 10, 113 (2022)\n\n[arXiv:2207.10596 [hep-th]].\nTseytlin:2022flu\nA. A. Tseytlin,\n“Comments on 4-derivative scalar theory in 4 dimensions,”\n[arXiv:2212.10599 [hep-th]].\nAbe:2018rwb\nY. Abe, T. Inami, K. Izumi, T. Kitamura and T. Noumi,\n“S-matrix Unitarity and Renormalizability in Higher Derivative Theories,”\nPTEP 2019, no.8, 083B06 (2019)\ndoi:10.1093/ptep/ptz084\n[arXiv:1805.00262 [hep-th]].\nstelle\n K. S. Stelle,    Renormalization   of   higher   derivative   quantum   gravity,    Phys. Rev. D 16,    953   (1977).\nHoldom:2021hlo\nB. Holdom,\n“Ultra-Planckian scattering from a QFT for gravity,”\nPhys. Rev. D 105, 046008 (2022)\n\n[arXiv:2107.01727 [hep-th]].\nHoldom:2021oii\nB. Holdom,\n“Photon-photon scattering from a UV-complete gravity QFT,”\nJHEP 04, 133 (2022)\n\n[arXiv:2110.02246 [hep-ph]].\nPatel:2015tea\nH. H. Patel,\n“Package-X: A Mathematica package for the analytic calculation of one-loop integrals,”\nComput. Phys. Commun. 197, 276-290 (2015)\n\n[arXiv:1503.01469 [hep-ph]].\nfurman\nFurman, M. (2003). The moller luminosity factor. Lawrence Berkeley National Laboratory, https://escholarship.org/uc/item/3897k3zp\nDonoghue:2019ecz\nJ. F. Donoghue and G. Menezes,\n“Arrow of causality and quantum gravity,”\nPhys. Rev. Lett. 123, 171601 (2019).\n\n[arXiv:1908.04170 [hep-th]].\n\n\n"}