{"entry_id": "http://arxiv.org/abs/2303.06722v1", "published": "20230312180212", "title": "STM observation of the hinge-states of bismuth nanocrystals", "authors": ["Tianzhen Zhang", "Valeria Sheina", "Sergio Vlaic", "Stéphane Pons", "Dimitri Roditchev", "Christophe David", "Guillemin Rodary", "Jean-Christophe Girard", "Hervé Aubin"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall", "cond-mat.str-el"], "text": "\n\nAPS/123-QED\n\n\n\n\nLPEM, ESPCI Paris, PSL Research University, CNRS, Sorbonne Université, 75005 Paris, France\n\n\nUniversités Paris-Saclay, CNRS, Centre de Nanosciences et de Nanotechnologies, 91120, Palaiseau, France\n\n\nLPEM, ESPCI Paris, PSL Research University, CNRS, Sorbonne Université, 75005 Paris, France\n\n\nLPEM, ESPCI Paris, PSL Research University, CNRS, Sorbonne Université, 75005 Paris, France\n\n\nLPEM, ESPCI Paris, PSL Research University, CNRS, Sorbonne Université, 75005 Paris, France\n\n\nUniversités Paris-Saclay, CNRS, Centre de Nanosciences et de Nanotechnologies, 91120, Palaiseau, France\n\n\nUniversités Paris-Saclay, CNRS, Centre de Nanosciences et de Nanotechnologies, 91120, Palaiseau, France\n\n\nUniversités Paris-Saclay, CNRS, Centre de Nanosciences et de Nanotechnologies, 91120, Palaiseau, France\n\n\n\nUniversités Paris-Saclay, CNRS, Centre de Nanosciences et de Nanotechnologies, 91120, Palaiseau, France\nHerve.Aubin@universite-paris-saclay.fr \n\n\n\n\n\n\n\n\n\n\n\n             \n\n\nThe recent application of topological quantum chemistry to rhombohedral bismuth established the non-trivial band structure of this material. This is a 2^ndorder topological insulator characterized by the presence of topology-imposed hinge-states. The spatial distribution of hinge-states and the possible presence of additional symmetry-protected surface-states is expected to depend on the crystal shape and symmetries. To explore this issue, we have grown bismuth nanocrystals in the tens of nanometers on the (110) surface of InAs. By scanning tunneling spectroscopy, we mapped the local density of states on all facets and identified the presence of the hinge-states at the intersection of all facets. Our study confirm the classification of bulk bismuth as a 2^ndorder topological insulator. We propose that the ubiquitous presence of the hinge-states result from their tunnel-coupling across the nanometer-sized facets.\n\n\n\n                              \nSTM observation of the hinge-states of bismuth nanocrystals\n    Hervé Aubin\n    March 30, 2023\n===========================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nSolids with filled electronic bands and no interactions may seem quite mundane, yet, band structures can have interesting non-trivial topological properties, which can be inferred from their symmetries.\n\nTo analyse the symmetry properties of an atom located on a lattice site, it is usual to employ the representation theory <cit.> of point-groups to obtain the decomposition of the atomic orbitals as a direct sum of irreducible representations of the atomic site point-group symmetry. \n\nBy analogy, to analyse the symmetry properties of the Bloch states arising from these orbitals, band representations theory, a representation theory of space groups <cit.>, can be employed to obtain the decomposition of the band structure as a direct sum of irreducible band representations.\n\nWhile band representation theory was barely used for decades, it have recently attracted intense interest with the demonstration that one band that cannot be decomposed into any linear combination of physical elementary band representation must have non-trivial topological properties. This gave birth to topological quantum chemistry <cit.> and enabled the identification and calculation of symmetry indicators for the 230 space groups <cit.>, which are related to topological indexes, and facilitated large-scale search across databases to identify topological materials <cit.>. This has greatly expanded the topological classification of  band  insulators  beyond  the Z_2 topological insulators <cit.> and revealed the existence of numerous symmetry-indicated topological phases such as mirror-symmetry-protected topological crystalline insulators (TCIs) <cit.>, rotational-symmetry–protected  TCIs <cit.> and higher-order topological insulators (HOTIs) <cit.>.\n \nAlthough the lowest-symmetry HOTI models exhibit gapped two-dimensional (2D) surfaces-states and gapless one-dimensional (1D) hinge-states <cit.>, typical solid-state HOTIs have additional crystal symmetries that can protect gapless surface-states; thus, a HOTI can coexist with a TCI. Depending on the sample termination, the same crystal  may exhibit either 2D surface-states or gapped facets separated by topological hinge-states. \n\n\n\nThe application of topological quantum chemistry to rhombohedral bismuth (Bi), with space-group  R3̅m (#166) and point-group D3d has shown that its valence and conduction bands result from a split elementary band representation<cit.>, which implies non-trivial topological properties. These topological properties result from a double band inversion\n<cit.> at the same time-reversal-invariant momenta (TRIM) points. The topological phase can be described as two superposed copies of a TCI protected by time reversal T, threefold rotation C_3[111] about the [111] direction and inversion I symmetries <cit.>, characterized by the Z_4 = 2 topological index <cit.>. The fourfold Dirac surface-states of this topological phase are unstable<cit.> and it has been shown that a crystal with an inversion-symmetric shape, such as a rod of hexagonal section oriented along the [111] direction, the mass of the Dirac states is of opposite sign on surfaces with inversion - related  Miller indices, resulting in helical hinge modes encircling the crystal <cit.>.\n\n\n\nExperimentally, on hexagonal cavities in the (111) surface of bulk Bi <cit.>, scanning tunneling microscopy (STM) and spectroscopy (STS) identified edge-states on every two edges of the cavity. Because two-dimensional bismuth was predicted theoretically to be a two-dimensional quantum spin Hall insulator (QSHI) with Kane-Mele index Z_2 = 1 <cit.>, the edge-states were identified with the topological states of a QSHI altered by the coupling to the bulk<cit.>. While later STM works indeed confirmed the presence of topological edge-states on thin bismuth films<cit.> and bismuthene<cit.>, those observed on bulk Bi cavities were later reinterpreted as the signature of the hinge-states of a HOTI<cit.>. Interestingly, the edge-states in bismuthene and hinge-states in Bi are related as it was shown that the stacking of multiple 2D QSHI leads either to a weak 3D topological insulator, as for example Pt2HgSe30 <cit.> or a HOTI, as Bi<cit.>, WTe2<cit.> and Bi4Br4 <cit.>. Finally, the presence of the hinge-states was also inferred from SQUID-like supercurrent oscillations observed with Josephson circuits fabricated on Bi<cit.> and WTe2 <cit.>.\n\nIn addition to the HOTI phase protected by the C_3[111] symmetry, it has been shown<cit.> that Bi is also host of a first-order TCI state protected by a twofold rotational symmetry C_2[11̅0] about the [11̅0] direction, resulting in a pair of topological Dirac surface-states on its (11̅0) surface, coexsisting with the hinge-states of the HOTI phase. On (110) oriented Bi films, recent STM/STS measurements<cit.> have identified  hinge-states that could be described by a HOTI protected by time-reversal symmetry and bulk two-fold rotation C_2[11̅0]<cit.>. The surface-states were not observed though, because of the broken translation symmetry on the (11̅0) facets.\n\nThese recent theoretical and experimental works suggest that the distribution of surface- and hinge-states on a Bi crystal depends on its shape and transformation properties under C_3[111], C_2[11̅0] and inversion symmetries.\n\nTo explore the relationship between surface-states, hinge-states and the crystal shape, we have grown Bi nanocrystals (NCs) on the (110) surface of InAs and characterized its electronic properties by STM/STS. Thanks to the small size of the NCs and using very sharp STM-tips, we have been able to perform the STM/STS characterization of multiple facets and hinges of the NCs. We clearly identified hinge-states, confirming qualitatively the classification of Bi as a HOTI. However, we found that the spatial distribution of the density of states due to hinge-states could not be reproduced easily by a simple model with hinge-states appearing at the intersection of facets with Dirac masses of opposite signs<cit.>. Instead we found hinge-states at the intersection of all facets, provided they are sufficiently extended. We suggest that the ubiquitous presence of hinge-states is the consequence of their tunnel-coupling across the nanometer-sized facets.\n\n\n\n§ NANOCRYSTAL GROWTH\n\n\nThe Bi NCs have been grown on the (110) surface of n-doped InAs, which substrate has been cleaved in ultra-high vacuum at base pressure P≈ 10^-10 mbar. The (110)-surface of InAs substrates has also been employed previously for the growth of superconducting Pb NCs <cit.> and Bi nanolines<cit.>. By thermal evaporation, we deposited a nominal quantity of three monolayers of Bi at a temperature of 500 K. This is the optimum temperature for the growth of nanolines<cit.>, where we checked their formation by low energy electron diffraction (LEED). A topographic STM image is shown in Fig. <ref>a, where Bi NCs are visible as well as nanolines in the zoom insert. To accentuate the facets and edges, a Laplacian filter Δ_xyz(x,y) is applied to all topographic images. Fig. <ref>b show topographic images zoomed on five selected Bi nanocrysals, labelled I to V. The lateral size of NCs is between 10 nm and 40 nm, the height is between 5 nm and 15 nm. To obtain such topographic images free from artifacts resulting from the shape of the tip, a tip-shaping procedure has been employed where the tip is approached into contact with the InAs surface, then, a large current of 1 μ A is injected and the tip is slowly retracted. This tip-elongation procedure is repeated until no effects of the shape of the tip is visible on the topography of the NCs. Using the crystallographic software VESTA^@ and employing the crystal structure of Bi, we model the shape of all NCs and show the results below the corresponding NCs in Fig. <ref>b. From these Wulf constructions, the crystallographic planes (111), (110) and (100) can be clearly identified for each NC. \n\nOn the hexagonal cavity studied on the (111) surface of bulk Bi <cit.>, two type of edges were identified with edge A (B) corresponding to the edge with last Bi atom pointing up (down). We use the same notation. As shown by the atomic model in Fig. <ref>c, the location of edges A and B can be identified on NCs, which was not possible on the cavity. Edge A (B) is located at the intersection, i.e. hinge, between the (111) and the (100) ( (110) ) facets. \n\n\n\n§ SCANNING TUNNELING SPECTROSCOPY\n\n\n\n\n\n\nOn these 3D NCs, it is possible to perform STS on multiple facets. We will now detail the results obtained on two selected NCs. The results for NC I, which has large (111) and (110) facets, are shown in Fig. <ref>. The results for NC IV,  which has large (111) and (100) facets, are shown in Fig. <ref>. Additional STS results for the NCs II, III and V are shown in Fig. <ref>. \n\nFor all NCs, a small Coulomb gap about 25 meV is visible at zero bias, as highlighted in Fig. <ref>c and Fig. <ref>c. As described in the previous work on Pb NCs<cit.>, when a NC is grown atop a 2D electron gas of Fermi wavelength larger than the NC lateral sizes, a quantum constriction effect occurs, similar to what observed in quantum-point contacts, reducing the transmission to values smaller than one quantum of conductance. In this situation, the NC is only weakly coupled to the substrate and so Coulomb blockade occurs. In our system, the Bi nanowires and NCs have expected Fermi wavelengths in the 10 - 30 nm range <cit.>, comparable to NCs lateral sizes, explaining the observation of Coulomb blockade and implying that the Bi NCs are only weakly coupled to the substrate.\n\nFig. <ref>c and Fig. <ref>c show the differential conductance (DC) IV(V) spectra measured on NC I and NC IV, respectively, at positions indicated by colors symbols on corresponding panels ab. \n\nIn the middle of the (111) facets (red hexagon symbols), the DCs present conductance peaks at = 0.23 V. This is a consequence of the saddle point in the higher-energy relation dispersion of (111) surface-states (HESS)<cit.>, shown in  Fig. <ref>g, along the Γ̅ - 𝐌̅ direction of the Brillouin zone shown in Fig. <ref>e. The corresponding energy range is indicated as green zones in Fig. <ref>cdgh and Fig. <ref>cd. The DCs also show a sharp increase near = -0.01 V, which is a consequence of the saddle point in the lower-energy relation dispersion of (111) surface-states, followed by a maxima about = -0.07 V, identified as low-energy surface-states (LESS) where the corresponding energy range is indicated as blue zones in Fig. <ref>cdgh and Fig. <ref>cd. \n\nOn the edges of the (111) facets, the conductance peak at = 0.23 V due to HESS is missing, instead, peaks in the DCs are observed at lower energy. For NC I, conductance peaks are observed at = 0.125 V on all type-B edges (red symbols). On the two type-A edges measured (due to STM drift, the third one has not been measured), one large conductance peak is visible at = 0.14 V on the edge (pink right triangle)  where the (100) facet is well defined  but only a very small conductance peak (= 0.17 V) is visible on the second one (pink disk); we suggest this is due to the absence of the (100) facet for this edge where the (111) facet is reaching the InAs surface. For NC IV, on the type-B edges, the conductance peak at = 0.125 V is well defined only on the longest edge (red star symbol) but not on the two other short edges (red left- and up-triangles). On the type-A edges, the conductance peak at = 0.14 V is visible on two edges (pink right- and up-triangles), where the (100) facet is well defined, but not on the third one (pink disk symbol) where the (100) facet is absent and the (111) facet is reaching the InAs surface. These conductance peaks on both type of edges are identified as the one-dimensional van Hove singularities (vHS) of hinge-states. Their energy range is indicated as pink zones in Fig. <ref>cdgh and Fig. <ref>cd. Thus, in contrast to the observation on cavities in the (111) surface of bulk Bi crystal<cit.>, we find that the hinge-states vHs conductance peaks are visible on both type of edges. As is also seen on the other NCs, Fig. <ref>, the conductance peaks are visible only when the two facets making the hinge are extended and well defined.\n\nIn the middle of the (110) facet (orange square symbols), the DCs feature broad maxima at = 0.18 V, consistent with the observation of Ref. <cit.>. This maxima in the density of states is due to (110) surface-states<cit.>, whose dispersion relation is shown Fig. <ref>h along the 𝐗̅_1 - Γ̅ - 𝐗̅_2 direction of the Brillouin zone shown in Fig. <ref>f. \n\nIn the middle of the (100) facets (green down-triangle symbols), mostly visible in Fig. <ref>c of NC IV, the DCs feature broad maxima at = 0.24 V, which is likely due to (111) surface-states<cit.>. \n\nFinally, on the hinges between the (110) and (100) facets (light green symbols), the DCs feature conductance peaks at ≈ 0.1 V that indicates the presence of hinge-states. This is remarkable as they do not involve the (111) facet, which confirms the classification of Bi as a HOTI. \n\nTwo comments are in order. \n\nFirst, we note that the energy of the vHs slightly changes from one hinge to the other; in particular, they have energies ≈ 0.125 eV for type-B edges and ≈ 0.14 eV for type-A edges. This changes of energy could be explained by the tunnel-coupling between hinge-states.  \n \nSecond, on all edges, the vHs conductance peaks appear concomitantly with the disappearance of the conductance peaks due to surface-states on all three facets. Such an anti-correlation between the HESS conductance peak on the (111) surface and the hinge-states vHs conductance peaks was also observed previously<cit.>.\n\nTo see this more clearly, we acquired full conductance maps, typically on a spatial grid of 64 pixels × 64 pixels and 512 voltage points.  Fig. <ref>d shows an histogram of the energies of the conductance peaks identified in the 4096 DC spectra measured on the NC I. This histogram shows that the LESS, HESS and hinge-states are at the origin of all conductance peaks observed in the energy range [-0.25 eV, 0.25 eV]. There is no other major spectral feature of interest in this energy range on the whole NC.\n\nTo obtain maps of the local density of states, we remove the effects of changing tip-height and tunnel barrier energy by normalizing the DC spectra assuming that the total density of states is conserved on the energy range [-0.5 V, 0.5 V] measured. That is, the DC IV(V) spectra are normalized by their integrated values ∫_-0.5^0.5IVdV. Then, the normalized spectra are integrated on the three energy ranges corresponding to HESS [0.19 V, 0.27 V], LESS [-0.1 V, -0.04 V] and hinge-states [0.07 V, 0.15 V], to give ρ_HESS, ρ_LESS and ρ_HS, respectively, shown Fig. <ref>ijk and Fig. <ref>fgh for NC I and NC IV, respectively.\n\nAt the energy of HESS, Fig. <ref>k and Fig. <ref>h, a large density of states is visible on all facets except on the edges. In contrast, at the energy of hinge-states vHs, Fig. <ref>j and  Fig. <ref>g, a large density of states is observed on almost all hinges, between the (111) facet and (110), (100) facets as well as between the (110) facets and the (100) facets. Note that a large density of hinge-states is also observed in the middle of the largest (110) facet of NC I, seemingly as a consequence of the defect observed in the topography, Fig. <ref>a. Note also that the density of states due to LESS is mostly visible on the (111) and (100) facets and not on the (110) facets. Looking at the conductance maps Fig. <ref>jk and Fig. <ref>gh for both NC I and NC IV, respectively, the anti-correlation between the density of surface-states, ρ_HESS, and the density of hinge-states in the vHs, ρ_HS, is obvious. This suggests that a map of hinge-states can be obtained by calculating the ratio ρ_HS/ρ_HESS, which is shown Fig. <ref>b and Fig. <ref>b for both NC I and NC IV, respectively. In addition, Fig. <ref> show the topography, ratio ρ_HS/ρ_HESS and DC spectra for the three additional NCs : II, III and V. \n\n\n\nFor all NCs, the map ρ_HS/ρ_HESS show that the topological states are clearly visible only at the hinges where two distinct Bi facets are well defined. See how the conductance peaks due to hinge-states disappear where the (111) facet reaches the InAs surface. This suggests that the hinge-states indeed arise from the interaction between surface-states as expected theoretically. More precisely, the theoretical model proposed in Ref. <cit.> implies the existence of two sets of surface-states resulting from two copies of the 3D Z_2 topological insulator. The off-diagonal coupling between the two sets opens a gap for the surface-states, leaving only in-gap hinge-states at the edges of the facets. Thus, our STM/STS study of NCs confirm the existence of hinge-states and so the classification of Bi as a HOTI. \n\n\n\n\n\n§ DISCUSSION\n\n\nDespite global consistency of the STS data with a HOTI model, there are two features that remain be understood theoretically. First, as mentioned above, the spectral weight associated with the hinge-states in the vHs appears concomitantly with the disappearance of the spectral weight associated with the HESS. To highlight this anti-correlation between HESS and hinge-states, Fig. <ref>efkl show the DC maps as function of sample voltage and distance along profiles drawn on the topographic images Fig. <ref>a(g) and ratio maps Fig. <ref>b(h) for NC I (IV). These maps show that the hinge-states appear at the expense of the surface-states on all facets.\nIn the model of Ref. <cit.>, this is not expected, the gap should remain constant on the whole surface of the NC, including the hinges, and so should the spectral weight due to surface-states. Second, according to this model applied to a rod of hexagonal section<cit.>, the hinge-states should not exist on all hinges but only on those separating facets with Dirac masses of opposite signs. Instead, we observe topological states on all hinges except where the facet reaches the InAs substrate. We suggest that this ubiquitous presence result from the coupling between hinge-states on opposite sides of the facets. Indeed, it is well established that the tunnel coupling between the edge-states at opposite edges (surfaces) of a 2D (3D) topological insulator leads to a gap opening in the relation dispersion of the edge-states Dirac spectrum <cit.>. This is also true for the tunnel-coupling between edge-states of a second-order topological insulator as shown recently for the corner-states of a 2D second-order topological insulator <cit.>. In this last theoretical work, it has been shown that for well localized corner-states, the corresponding density of states is large on only some of the corners and not on others, however, when the wavefunctions of corner-states overlap, the corresponding density of states become equally distributed on all corners. In our small NCs, significant coupling between hinge-states is to be expected and could explain their presence on all hinges as well as the slightly different energy position of the vHs observed for different hinges. Furthermore, at hinges where several atomic steps exists, individual hinge-states separated in space by terraces should exist and for an even number of such states, they can hybridize and gap out. Note also that the observation of a vHS conductance peak does not imply that the hinge-state is topological. It is possible that only some of the hinge-states are gapless, while others are gapped, however, on the background of all the conducting states such a gap is hard to observe by STM.\n\n\n\n§ CONCLUSION\n\n\nTo summarize, we have shown that Bi NCs could be grown on the (110) InAs surface. Their size in the tens of nanometer make them suitable for STM/STS studies on all facets of the tri-dimensional NC. We identified the hinge-states vHs at all hinges between the three facets (111), (110) and (100), however, on edges where the facet ends on the InAs substrate, no vHs is observed. These observations are consistent with the classification of Bi as a HOTI. The ubiquitous observation of the vHs on all hinges suggests that the hinge-states are tunnel-coupled because of the small size of the NCs.\n\n\nWe acknowledge financial support from ANR MECHASPIN Grant No. ANR-17-CE24-0024-02 and ANR FRONTAL Grant No. ANR-19-CE09-0017-02. We thank S. Guéron, H. Bouchiat, T. Neupert and M. Denner for discussions, reading of the manuscript and suggestions.\n\n\n\n\n"}