{"entry_id": "http://arxiv.org/abs/2303.06716v1", "published": "20230312174432", "title": "Mechanism of femtosecond laser ablation revealed by THz emission spectroscopy", "authors": ["Shuntaro Tani", "Yohei Kobayashi"], "primary_category": "physics.optics", "categories": ["physics.optics"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[e-mail:]stani@issp.u-tokyo.ac.jp\n\n1Institute for Solid State Physics, The University of Tokyo, Kashiwa-no-ha 5-1-5, Kashiwa, Chiba, 277-8581, Japan\n\n\n\n\nWe investigated femtosecond laser ablation dynamics using THz time-domain spectroscopy. To clarify the breakdown dynamics of materials, we focused on the motion of charged particles and measured the terahertz waves emitted during laser ablation. We revealed that the Coulomb force dominated the ablation process. Furthermore, comparisons of the experimental results with theoretical models showed that material breakdown occurs within a few hundred femtoseconds. Our experimental results indicate that electrostatic ablation is the most likely ablation mechanism for metals.\n\n\n\n\nMechanism of femtosecond laser ablation revealed by THz emission spectroscopy\n    Yohei Kobayashi\n    March 30, 2023\n=============================================================================\n\n\n\n\n\nWhen an intense femtosecond laser pulse irradiates a material, the laser field drives the electrons in the material strongly into highly energetic states, which leads to large-scale atomic motions and material ejection. This material removal process is called femtosecond laser ablation and provides a foundation for laser-based machining processes with minimal thermal degradation <cit.>. Extensive research has been conducted into this process for more than three decades, both experimentally and theoretically <cit.>, to clarify the irreversible processes that cause solids to break down into atoms under application of intense laser fields. Various ablation mechanisms have been proposed and are still subject to debate. These mechanisms include evaporation <cit.>, spallation caused by a laser-induced shock wave <cit.>, explosive boiling <cit.>, phonon instability <cit.>, electrostatic force <cit.>, and Coulomb explosion <cit.>. As a result, the time required for bond to break varies widely depending on the theoretical model used. For example, ab initio molecular dynamics calculations predicted bond breaking times of less than 100 fs <cit.>. In contrast, molecular dynamics and hydrodynamics-based calculations predicted bond-breaking times of tens of picoseconds or more <cit.>.\n\nTime-resolved spectroscopic studies have revealed the ultrafast dynamics that occur in materials after instantaneous optical excitation. For example, optical pump-probe measurements have revealed the occurrence of changes in both electronic band structures <cit.> and the states of matter <cit.>. Additionally, electron beam and X-ray diffraction measurements have shown the energy transfer processes that occur from electronic systems to phonon systems <cit.>. However, direct observation of the atomic-level fracture that occurs at several nanometers beneath the surface remains challenging.\n\nOne process that will inevitably occur when a solid is broken apart into atoms is the acceleration of the motion of the electrons and ions. These accelerated motions of the charged particles cause emission of electromagnetic waves and these emissions can be measured with subpicosecond time resolution using terahertz time-domain spectroscopy (THz-TDS) <cit.>. In particular, measurement of the charged particle motions triggered by laser irradiation, which is called THz emission spectroscopy, has been used for a variety of systems <cit.>. However, although terahertz emission has been reported to occur during laser ablation, the actual ablation mechanism has not yet been revealed <cit.>.\n\nIn this study, we investigated the ablation mechanism of copper near the material's ablation threshold. We used broadband THz emission spectroscopy to measure the dynamics of the charged particles on a subpicosecond scale. Our vectorial THz-TDS system determined the direction of the charged-particle motion successfully. Furthermore, the charge displacements were estimated from the THz waveforms and compared to theoretical models. As a result, we clarified that ablation occurs within a few hundred femtoseconds and that the electrostatic ablation model is the most plausible of the existing models.\n \n \n \n\nThe experimental setup used for the THz-TDS of the laser ablation process is shown in Fig. 1(b). A Ti-sapphire regenerative amplifier delivered 80-fs pulses that were used as excitation pulses for the ablation process and as sampling pulses for electro-optic detection <cit.>. The laser pulses for ablation were focused perpendicularly onto a target material with a 1/e^2 spot size of 60 μ m. Electromagnetic emissions generated during laser ablation were collected using a pair of off-axis parabolic mirrors on a 310-μ m (110) GaP crystal. Electro-optic sampling with this thin GaP crystal enabled broadband THz measurements to be taken <cit.>. The parabolic mirror used to for accumulating the THz emissions was placed at an angle of 70^∘ to the normal of the target surface. Two black polypropylene films were inserted between the parabolic mirrors to cut out any scattered excitation light while also allowing the THz waves to pass through. Copper plates were used as the target materials. THz-TDS was performed while the sample was moved horizontally on a motorized stage, thus eliminating optical path length variations caused by the ablation process.\n\nFigure 2 shows the electric waveforms measured by the THz-TDS under both linearly and circularly polarized excitation. The field strengths exclude the contribution of Fresnel losses at the black polypropylene films and at the GaP crystal surface. The ablation thresholds for the two polarizations above were 0.2  and 0.3   respectively. Below these thresholds, the electric fields are weak and have a cosine-shaped waveforms. Above these thresholds, the electric fields become much stronger and begin to show a sine-type component. Additionally, a significant polarization dependence is observed at low excitation fluences, whereas this polarization dependence disappears at high excitation fluences.\n\n \n We confirmed that the observed THz waves originated from the motion of charged particles, based on the dependence of the THz wave polarization on the excitation polarization. We determined the vectorial directions of the THz fields by rotating the nonlinear crystal used to perform the electro-optic sampling <cit.>. If the THz wave generation is caused by optical rectification at the target surface, it should be strongly dependent on the excitation polarization <cit.>. However, the resulting vectorial waveform was linearly polarized along the horizontal plane irrespective of the direction of excitation polarization. We thus conclude that the electromagnetic radiation from the laser ablation process was due to the acceleration or deceleration of charged particles, namely electrons and ions.\n \nWe can estimate the ultrafast charge motion during laser ablation from the temporal waveform of the THz pulses. The following processes were considered for the estimation: the conversion of transient current to radiation, free-space propagation via the parabolic mirrors, and detection in the electro-optic crystal. Putting all together, we obtained the relationship between the motion of charges and the detected electric field E_det (V/cm) <cit.>:\n\n    E_det(t)=-8.0×10^-10qN(t)d^2/dt^2v(t),\n\nwhere q is the sign of the charge, N(t) is the number of charged particles, and v(t) (nm/ps) is their average velocity. Namely, the detected electric field waveform is the second-order derivative of the transient current.\n\nHere we consider one-way and round-trip motions of the charges. We took a Gaussian and its first-order derivative as the time profile of each component, as shown in Figs.3(a). Under this assumption and Eq. (<ref>), the electric field waveform was fitted with the following waveform:\n\n    E(t)=E_2 H_2(t-t_0/τ_2)e^-(t-t_0)^2/τ_2^2+E_3 H_3(t-t_0/τ_3)e^-(t-t_0)^2/τ_3^2,\n\nwhere H_n is the nth-order Hermite polynomial, E_n and τ_n are fitting parameters representing the amplitudes and timescales, and t_0 is the time delay of both components. This fitting well reproduces the experimental results for all excitation fluences and polarizations, as shown in Fig. 2. The values of τ_2 and τ_3 are approximately 0.22 ps and 0.28 ps, respectively, and are nearly constant irrespective of excitation fluence and polarization.\n\nFigure 3(b) shows the excitation fluence dependence of the peak values of the one-way and round-trip transient currents. For both currents, there is a large polarization dependence at fluences below 1.0 . In contrast, above 1.5   the polarization dependence almost disappears. The one-way currents increase according to a power law, with an exponent of 2 at the low fluence side and 0.6 on the high fluence side.\n\nFigure 3(c) shows the fluence dependence of the common time delay. It decreases monotonically as fluence increases and becomes almost constant above 1.0 . The time origin was determined by the sum frequency generation of the sampling pulse and the scattered light at the sample surface of the excitation pulse. The optical path length difference due to the black polypropylene films and the temporal walk-off in the nonlinear crystal were compensated.\n\nIn this letter, we focused on the displacement of charges by integrating the motion. The displacement of charge density per unit area δ is:\n\n    δ = ∫[n_e(t)v_e(t) - n_i(t)v_i(t)]dt,\n\nwhere n(t) is charge density, and v(t) is the average velocity of the particles. The subscripts e and i represent electrons and ions, respectively. The results are shown in Fig. 3(d). The product n(t)v(t) corresponds to the sum of the one-way and round-trip motions, as per Fig. 3(a). Note that the integral of the round-trip motion is zero, and the magnitude of the final displacement does not depend on a way of decomposing the charge motions.\n\nLet us first assume that the observed motions are only due to electrons. The one-way motion results in the electrons resting on a finite displacement from the surface. A force is needed to slow down the emitted electrons and keep them outside the material. This force can only be the Coulomb force between the electrons and the mirror charges on the metal surface. \n\nTwo opposite scenarios can cause such displacement: continuous thermionic emission and impulsive photoemission. In the thermionic emission scenario, the electron system heated by a laser pulse continues to emit thermal electrons, as per Fig. 4(a). In this situation, thermionic emission and the Coulomb force balance and create outward displacement. We derived the electron distribution ρ_e(z) in a self-consistent manner, assuming thermionic electron emission by the Richardson-Dushman formula <cit.> and an exponential spread of the emitted electrons. The distribution is as follows:\n\n    ρ_e(z)    =   ρ_s e^-β z  (z > 0), \n    ρ_s    =   m_e k_B T_e/2π^2ħ^3√(π m_e k_B T_e/2)e^-W/k_B T_e, \n    β   =   √(e^2 ρ_s/ϵ_0 k_B T_e),\n\nwhere ρ_0 is the density of the spreading electrons, β is the inverse of the spreading length, T_e is the electronic temperature at the material surface, m_e is the electron mass, k_B is the Boltzmann constant, ħ is the Plank constant, W is the work function of copper, e is the elementary charge, and ϵ_0 is the vacuum permittivity. Then, the charge displacement density δ equals 2ρ_0/β^2. Note that 1/β is equal to the Debye length. As a result, we found the following relationship:\n\n    T_e = e^2/2ϵ_0 k_Bδ.\n\nNamely, the electron temperature increase at the surface can be directly estimated by integrating the THz waveform three times with respect to time. Figure 4(c) shows the fluence dependence of the electron temperature at the surface calculated from the THz waveform. The estimated temperature is much higher than the electron temperature estimated from the laser fluence, indicating that this scenario is not valid.\n\nAs for the other scenario, let us consider a packet of electrons ejected ballistically by impulsive photoemission processes <cit.>, as per Fig. 4(b). The Coulomb interaction with the mirror charge slows down and spreads the packet of electrons. Assuming an infinitely thin electron slab of area density σ_imp ejected at velocity v_imp as the electron packet, we obtain an analytical expression for the electron displacement:\n\n    δ(t) = {[ σ_imp v_imp t - e^2 σ_imp^2/4 ϵ_0 m_et^2                          (0 ≤ t < t_ret);                      ϵ_0 m_e v_imp^2/e^2                              (t ≥ t_ret) ].,\n\nwhere t_ret = 2 ϵ_0 m_e v_imp/e^2 σ_imp represents the time required for a portion of the emitted electrons to return to the surface. After t_ret, the charge displacement is constant irrespective of t and independent of the emitted electron density σ_imp. Thus, this scenario also produces finite outward displacement, and the averaged kinetic energy E_kin of the emitted electrons can be calculated directly from the charge displacement:\n\n    E_kin = e^2/2ϵ_0δ.\n\nInterestingly, although they are based on completely different assumptions, Eqs. (<ref>) and (<ref>) have the relationship k_B T_e = E_kin.\nFigure 4(d) shows the kinetic energy E_king as a function of fluence. The high kinetic energy cannot be explained by multiphoton photoemission or photoassisted thermionic emission <cit.>. While electron emission with kinetic energies of a few tens of eV is possible due to above-threshold ionization, an electric field of more than 100 V/nm should be generated on the surface considering the yield of electrons <cit.>. An electric field that strong should extract ions and such an ablation mechanism is called electrostatic ablation <cit.>, as shown in Fig. 5(a).\n\n\nEither scenario requires unreasonably high energy electron emission to overcome the strong Coulomb force. Accordingly, our initial assumption that only electrons move on ultrafast timescales must be corrected; if ions move on a subpicosecond time scale, the Coulomb force is suppressed, allowing large displacements to be achieved. Here, we assume the impulsive model and consider an effective particle mixture of electrons and ions. Assuming a mixing ratio of 1/2+f to 1/2-f, the charge displacement yields δ = ϵ_0 E_kin/2f^2e^2. Assuming that the energy of the incident laser pulse is distributed among electrons and ions, the imbalance f can be estimated as shown in Fig. 5(b). Such a small fraction of ionization has also been reported in time-of-flight measurements on GaAs and silicon excited by femtosecond pulses near the ablation threshold <cit.>. \n\nOur experimental observation revealed that the breakup of solids into atoms should occur on a subpicosecond timescale. This time scale is much faster than the commonly accepted time scales in spallation and evaporation models <cit.>, which range from several picoseconds to a few nanoseconds. This is because electron-phonon coupling is suppressed inside the solid due to Coulomb shielding, but electrons ejected from the surface pull atoms with bare Coulomb. Gamaly et al. estimated the time scale of breakup by electrostatic ablation to be as fast as tens of femtoseconds <cit.>, which is consistent with our experiments. Furthermore, the ultrafast breakdown is reasonable to explain the excitation polarization dependence observed in this study and the gentle ablation where the optical penetration length determines the ablation depth <cit.>.\n\nFinally, Figure 5(c) plots transient current as a function of the number of atoms removed by laser ablation. The number of ablated atoms was obtained by measuring a depth profile of the grooves created by the ablation using a three-dimensional microscope. Remarkably, the round-trip current is proportional to the number of ablated atoms over two orders of magnitude. The proportionality coefficient is approximately 0.05 e·nm/ps, irrespective of the excitation polarization. This relationship suggests that round-trip current is closely related to laser ablation.\n\nIn conclusion, we measured the motion of charged particles during laser ablation in the vicinity of the ablation threshold. The calculated charge displacements reveal that the motion of the ions must occur on a time scale of a few hundred femtoseconds. Our result clarifies the ablation mechanism and its timescale, a matter of long-standing controversy. Moreover, a round-trip current has been found that is proportional to the number of ablated atoms over two orders of magnitude. Precise measurement of ultrafast charge transfer will open the physics of irreversible processes driven by ultrashort laser pulses.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis work was supported in part by New Energy and Industrial Technology Development Organization (TACMI project, P16011); Council for Science, Technology and Innovation; Cabinet Office, Government of Japan; National Institutes for Quantum and Radiological Science and Technology (Cross-ministerial Strategic Innovation Promotion Program); Ministry of Education, Culture, Sports, Science and Technology (JPMXS0118067246 and JPMJCE1313) ; JSPS KAKENHI Grant Number JP20K15188. \n\n\n\n99\nChichkov1996a B.N. Chichkov, C. Momma, S. Nolte, F. Von Alvensleben, and A. Tünnermann, Applied physics A 63, 109 (1996).\nKerse2016 C. Kerse, H. Kalaycıog˘lu, P. Elahi, B. Çetin, D.K. Kesim, Ö. Akçaalan, S. Yavas¸, M.D. As¸ık, B. Öktem, H. Hoogland, R. Holzwarth, and F.Ö. Ilday, Nature 537, 84 (2016).\nPreuss1993 S. Preuss, M. Späth, Y. Zhang, and M. Stuke, Applied Physics Letters 62, 3049 (1993).\nStampfli1994 P. Stampfli, and K.H. Bennemann, Physical Review B 49, 7299 (1994).\nNolte1997 S. Nolte, C. Momma, H. Jacobs, A. Tünnermann, B.N. Chichkov, B. Wellegehausen, and H. Welling, JOSA B 14, 2716 (1997).\nHuang1998 L. Huang, J.P. Callan, E.N. Glezer, and E. Mazur, Physical Review Letters 80, 185 (1998).\nCavalleri1999 A. Cavalleri, K. Sokolowski-Tinten, J. Bialkowski, M. Schreiner, and D. von der Linde, Journal of Applied Physics 85, 3301 (1999).\nAmoruso2002 S. Amoruso, X. Wang, C. Altucci, C. De Lisio, M. Armenante, R. Bruzzese, N. Spinelli, and R. Velotta, Applied surface science 186, 358 (2002).\nGamaly2011a E.G. Gamaly, Physics Reports 508, 91 (2011).\nRethfeld2017a B. Rethfeld, D.S. Ivanov, M.E. Garcia, and S.I. Anisimov, Journal of Physics D: Applied Physics 50, 193001 (2017).\nPompili2018 R. Pompili, M.P. Anania, F. Bisesto, M. Botton, E. Chiadroni, A. Cianchi, A. Curcio, M. Ferrario, M. Galletti, Z. Henis, M. Petrarca, E. Schleifer, and A. Zigler, Sci Rep 8, 3243 (2018).\nTakahashi2020 T. Takahashi, S. Tani, R. Kuroda, and Y. Kobayashi, Applied Physics A 126, 1 (2020).\nUchida2020 K. Uchida, K. Nagai, N. Yoshikawa, and K. Tanaka, Physical Review B 101, 094301 (2020).\nTani2022 S. Tani, and Y. Kobayashi, Scientific reports 12, 1 (2022).\nColombier2007 J.P. Colombier, P. Combis, R. Stoian, and E. Audouard, Physical Review B 75, 104105 (2007).\nWinter2020 J. Winter, S. Rapp, M. Spellauge, C. Eulenkamp, M. Schmidt, and H.P. Huber, Applied Surface Science 511, 145514 (2020).\nLorazo2003 P. Lorazo, L.J. Lewis, and M. Meunier, Physical Review Letters 91, 225502 (2003).\nZier2016a T. Zier, E.S. Zijlstra, and M.E. Garcia, Physical Review Letters 116, 153901 (2016).\nGamaly2002 E.G. Gamaly, A.V. Rode, V.T. Tikhonchuk, and B. Luther-Davies, Applied surface science 197, 699 (2002).\nStoian2002 R. Stoian, A. Rosenfeld, D. Ashkenasi, I.V. Hertel, N.M. Bulgakova, and E.E.B. Campbell, Physical review letters 88, 097603 (2002).\nColombier2005 J.P. Colombier, P. Combis, F. Bonneau, R. Le Harzic, and E. Audouard, Physical Review B 71, 165406 (2005).\nLorazo2006 P. Lorazo, L.J. Lewis, and M. Meunier, Physical Review B 73, 134108 (2006).\nWu2014 C. Wu, and L.V. Zhigilei, Applied Physics A 114, 11 (2014).\nPovarnitsyn2015a M.E. Povarnitsyn, V.B. Fokin, and P.R. Levashov, Applied Surface Science 357, 1150 (2015).\nCallan2000 J.P. Callan, A.M.-T. Kim, L. Huang, and E. Mazur, Chemical Physics 251, 167 (2000).\nWinkler2018 T. Winkler, L. Haahr-Lillevang, C. Sarpe, B. Zielinski, N. Götte, A. Senftleben, P. Balling, and T. Baumert, Nature Physics 14, 74 (2018).\nSokolowski-Tinten1998a K. Sokolowski-Tinten, J. Bialkowski, A. Cavalleri, D. von der Linde, A. Oparin, J. Meyer-ter-Vehn, and S.I. Anisimov, Physical Review Letters 81, 224 (1998).\nWinter2017 J. Winter, S. Rapp, M. Schmidt, and H.P. Huber, Applied Surface Science 417, 2 (2017).\nSokolowski-Tinten2001 K. Sokolowski-Tinten, C. Blome, C. Dietrich, A. Tarasevitch, M. Horn von Hoegen, D. von der Linde, A. Cavalleri, J. Squier, and M. Kammler, Phys Rev Lett 87, 225701 (2001).\nSokolowski-Tinten2003a K. Sokolowski-Tinten, C. Blome, J. Blums, A. Cavalleri, C. Dietrich, A. Tarasevitch, I. Uschmann, E. Förster, M. Kammler, M. Horn-von-Hoegen, and D. von der Linde, Nature 422, 287 (2003).\nSiwick2003 B.J. Siwick, J.R. Dwyer, R.E. Jordan, and R.J.D. Miller, Science 302, 1382 (2003).\nWaldecker2017 L. Waldecker, T. Vasileiadis, R. Bertoni, R. Ernstorfer, T. Zier, F.H. Valencia, M.E. Garcia, and E.S. Zijlstra, Physical Review B 95, 054302 (2017).\nWang2020a X. Wang, J.C. Ekstrom, A.U.J. Bengtsson, A. Jarnac, A. Jurgilaitis, V.T. Pham, D. Kroon, H. Enquist, and J. Larsson, Physical Review Letters 124, 105701 (2020).\nSchmuttenmaer2004 C.A. Schmuttenmaer, Chemical Reviews 104, 1759 (2004).\nNeu2018 J. Neu, and C.A. Schmuttenmaer, Journal of Applied Physics 124, 231101 (2018).\nBeard2002 M.C. Beard, G.M. Turner, and C.A. Schmuttenmaer, The Journal of Physical Chemistry A 106, 878 (2002).\nSotome2021 M. Sotome, M. Nakamura, T. Morimoto, Y. Zhang, G.-Y. Guo, M. Kawasaki, N. Nagaosa, Y. Tokura, and N. Ogawa, Physical Review B 103, L241111 (2021).\nGopal2013 A. Gopal, S. Herzer, A. Schmidt, P. Singh, A. Reinhard, W. Ziegler, D. Brommel, A. Karmakar, P. Gibbon, U. Dillner, T. May, H.G. Meyer, and G.G. Paulus, Phys Rev Lett 111, 074802 (2013).\nLiao2016 G.-Q. Liao, Y.-T. Li, Y.-H. Zhang, H. Liu, X.-L. Ge, S. Yang, W.-Q. Wei, X.-H. Yuan, Y.-Q. Deng, B.-J. Zhu, Z. Zhang, W.M.Wang, Z.M. Sheng,L.M. Chen, X. Lu, J.L. Ma, X. Wang, and J. Zhang, Physical Review Letters 116, 205003 (2016).\nJin2016 Z. Jin, H.B. Zhuo, T. Nakazawa, J.H. Shin, S. Wakamatsu, N. Yugami, T. Hosokai, D.B. Zou, M.Y. Yu, Z.M. Sheng, and R.Kodama, Physical Review E 94, 033206 (2016).\nTani2017 S. Tani, and Y. Kobayashi, SPIE Proceedings Optical Manipulation Conference 10252, 43 (2017).\nTamaki2022 R. Tamaki, T. Kasai, G. Asai, D. Hata, H. Kubo, Y. Takigawa, J. Takeda, and I. Katayama, Optics Express 30, 23622 (2022).\nGallot1999 G. Gallot, and D. Grischkowsky, JOSA B 16, 1204 (1999).\nLeitenstorfer1999 A. Leitenstorfer, S. Hunsche, J. Shah, M.C. Nuss, and W.H. Knox, Applied Physics Letters 74, 1516 (1999).\nWu1997 Q. Wu, and X.-C. Zhang, Applied Physics Letters 70, 1784 (1997).\nPlanken2001 P.C.M. Planken, H.-K. Nienhuys, H.J. Bakker, and T. Wenckebach, JOSA B 18, 313 (2001).\nKadlec2005 F. Kadlec, P. Kuzel, and J.L. Coutaz, Opt Lett 30, 1402 (2005).\nS.Tani See Supplemental Material at [URL] for the derivation of the conversion from transient current to detected fields.\nDushman1930 S. Dushman, Reviews of Modern Physics 2, 381 (1930).\nAeschlimann1995 M. Aeschlimann, C.A. Schmuttenmaer, H.E. Elsayed-Ali, R.J.D. Miller, J. Cao, Y. Gao, and D.A. Mantell, The Journal of chemical physics 102, 8606 (1995).\nMusumeci2010 P. Musumeci, L. Cultrera, M. Ferrario, D. Filippetto, G. Gatti, M.S. Gutierrez, J.T. Moody, N. Moore, J.B. Rosenzweig, C.M. Scoby, G. Travish, and C. Vicario, Phys Rev Lett 104, 084801 (2010).\nSaathoff2008 G. Saathoff, L. Miaja-Avila, M. Aeschlimann, M.M. Murnane, and H.C. Kapteyn, Physical Review A 77, 022903 (2008).\nHashida2002 M. Hashida, A.F. Semerok, O. Gobert, G. Petite, and Y. Izawa, Applied surface science 197, 862 (2002).\nTani2018 S. Tani, and Y. Kobayashi, Applied Physics A 124, 1 (2018).\n\n"}