{"entry_id": "http://arxiv.org/abs/2303.06711v1", "published": "20230312172337", "title": "Large-scale homogeneity and isotropy versus fine-scale condensation. A model based on Muckenhoupt type densities", "authors": ["Hugo Aimar", "Federico Morana"], "primary_category": "math.AP", "categories": ["math.AP", "math-ph", "math.MP"], "text": "\n\n]Large-scale homogeneity and isotropy versus fine-scale condensation. A model based on Muckenhoupt type densities\n\n\n]Hugo Aimar\n\n\n]Federico Morana\n\n\n\n\n\n\n\n\n\n\n\n\nIn this brief note we aim to provide, through a well known class of singular densities in harmonic analysis, a simple approach to the fact that the homogeneity of the universe on scales of the order of a hundred millions light years is completely compatible with the fine-scale condensation of matter and energy. We give precise and quantitative definitions of homogeneity and isotropy on large scales. Then we show that Muckenhoupt densities have the ingredients required to a model for the large-scale homogeneity and the fine-scale condensation of the universe. In particular, these densities can take locally infinitely large values (black holes) and at once, in the large scales they are independent of the location. We also show some locally singular densities satisfying the large scale isotropy property.\n\n\n\n[\n    [\n    March 30, 2023\n==================\n\n\n\n\n\n\n§ INTRODUCTION\n\nThe cosmological principle of the universe states that the universe is homogeneous and isotropic at large scales. Large means here lengths larger than the diameter of galaxy clusters (see Chapter 27 of <cit.>). But, of course, no homogeneity could be expected at small scales. Planets, stars, galaxies are real inhomogeneities in which there is concentration of mass and energy.\n\n\n\nFrom the point of view of mathematics, homogeneity has also been considered from several points of view. Perhaps the most simple but non-quantitative meaning is that of topological homogeneity. In this approach the expression “the space looks the same no matter where you are” is interpreted from the topological perspective. Hence a topological space X is homogeneous if for every couple of points x and y in X there exists a homeomorphism f:X→ X such that f(x)=y.  This means that\nthe universe looks topologically the same about x than about y. Nevertheless this concept does not take into account the local heterogeneities and it is not quantitative.\n\n\n\nFor simplicity, assume that the “substance” of an n-dimensional Euclidean universe is distributed according to a density ρ(x). Here x=(x_1,⋯,x_n) is a point of ^n and ρ(x)≥ 0.\n\n\n\nLet us proceed to give a plausible definition of homogeneity in the large scales for a general density ρ(x) of our n-dimensional space.  Assume that our universe has two astronomers, located at different points x^1 and x^2.  Assume that their astronomical skills grow with the same rhythm. In particular they are able to weigh their own neighborhoods. Set B(x^i, R), i=1,2, to denote the euclidean ball centered at x^i with radius R>0. Precisely B(x^i,R)={x∈^n:|x-x^i|<R}. At the beginning their observations will be disjoint, when R increases they will start sharing part of their observable universe. When R is very large, the will share most of their measurements but the two observed regions will never coincide.\n\n\n\n\n\n\nIn our elementary interpretation, the two observers are drawing the increasing functions\n\n\n    M_1(R)=∫_B(x^1,R)ρ(x)  dx\n\n\nand\n\n\n    M_2(R)=∫_B(x^2,R)ρ(x)  dx\n\n\nrespectively. We say that the universe, modeled by ρ(x), is homogeneous in the large scales if no matter what the locations x^1 and x^2 are, the two observers are weighing the same mass for R large. More precisely if\n\n    M_1(R)/M_2(R)1\n\nfor every choice x^1, x^2 of points in .\nIt is worthy noticing that not every locally integrable density satisfies this property. In fact, as it is easy to prove, exponential growth is not allowed.\n\nThe question is whether or not there are nontrivial densities satisfying (<ref>).  Non triviality should allow very strong local heterogeneities. Not only objects of large mass but also points of infinitely large density in order to include, at least in an heuristic way, an elementary model for black holes.\n\n\n\nWe aim to show that there is a huge class of densities ρ in ^n fulfilling this two apparently contradictory conditions: homogeneity in the large scales, in the sense of (<ref>), and strong local heterogeneity allowing heavy objects and locally unbounded density.\n\n\n\nThe class of densities that we shall consider is the well known, in harmonic analysis, class of Muckenhoupt weights. See <cit.>, <cit.>, <cit.>.\n\n\n\nSection <ref> is devoted to a brief introduction of this class of densities and to exhibit some nontrivial examples, including densities that are singular on sets of positive dimension. In Section <ref> we prove that the densities defined by Muckenhoupt weights provide the desired homogeneity at large scales in the sense of (<ref>). In Section <ref> we briefly discuss the corresponding isotropy condition with these types of mass distributions.\n\n\n\n\n§ MUCKENHOUPT DENSITIES\n\n\nLet us start by introducing the Muckenhoupt classes in the Euclidean setting .  There are extensive treatments of the subject in harmonic analysis such as <cit.>, <cit.>, <cit.>. These approaches focus usually more on operator theory, than into the  geometrical properties associated to these densities. With B we shall denote the Euclidean open balls of .  We shall write B(x,r) when the center x∈ and the radius r>0 of B have to be explicit. A positive measurable and locally integrable function ρ defined in  satisfies always, by Schwarz inequality, the following upper estimate for the volume |B| of a ball B\n\n    |B|^2     = (∫_B dx)^2=\n        (∫_Bρ^1/2ρ^-1/2 dx)^2\n       ≤(∫_Bρ dx)(∫_Bρ^-1 dx).\n\nfor every ball B. More generally, from Hölder inequality with 1<p<∞ and 1/q+1/p=1, we have also\n\n    |B|^p     = (∫_B  dx)^p = (∫_Bρ^1/pρ^-1/p  dx)^p\n       ≤{(∫_Bρ \n    dx)^1/p(∫_Bρ^-q/p \n    dx)^1/q}^p\n        = (∫_Bρ  dx)(∫_Bρ^-1/p-1 \n    dx)^p-1\n\nagain for every ball B and every density ρ.\n\n\n\nIt is easy to provide examples of densities in which the above estimates for the volume of B are far away from being optimal. On the other hand it is clear that the above inequalities become equations for balls in regions where the density ρ is constant.\nAnd that |B|^p and (∫_Bρ dx) (∫_Bρ^-1/p-1  dx)^p-1 are of the same order if there exist positive and finite constants 0<c_1≤ρ(x)≤ c_2<∞ for every x∈. In other words, these two magnitudes become equivalent when ρ is almost constant. On the other hand, from the point of view of the model for a density of the universe, the property 0<c_1≤ρ(x)≤ c_2<∞ is unrealistic because it prevents having very localized and massive objects and even for having some points with vanishing density. Precisely, Muckenhoupt densities deserve analysis and particular consideration because the quantities |B|^p and (∫_Bρ dx)(∫_Bρ^-1/p-1 dx)^p-1 are equivalent and ρ can still have singularities, points of infinity density and points of vanishing density.\n\n\n\n\nLet ρ be a density in  and 1<p<∞. We shall say that ρ is a Muckenhoupt density, of the class A_p, if there exists a constant C such that\n\n    (∫_Bρ dx)(∫_Bρ^-1/p-1 dx)^p-1≤ C|B|^p\n\nfor every ball B in .\n\n\nA density ρ is said to belong to A_∞ if ρ∈ A_p for some 1<p<∞.\n\n\n\nBenjamin Muckenhoupt introduced in <cit.> these densities as the exact classes for the boundedness of Hardy-Littlewood and singular integrals operators in Lebesgue spaces. In this brief introduction we shall only collect the measure theoretical aspects of Muckenhoupt densities allowing us to prove, in the next section, the homogeneity in the large scales of a\nuniverse modeled by this type of densities ρ.\n\n\n\nThe next proposition contains the mains properties of Muckenhoupt densities related with the subsequent development of our model.\n\n\nLet ρ be a density in  the n-dimensional Euclidean space. Then\n\n  \n  (a) for 1<p<q and ρ∈ A_p we have that ρ∈ A_q;\n  \n  (b) for p>1 and ρ∈ A_p there exists a constant C such that the inequality\n  \n    |E|/|B|≤ C(ρ(E)/ρ(B))^1/p,\n\n  ρ(A)=∫_Aρ dx, holds for every ball B and every measurable subset E of B;\n  \n  (c) for p>1, ρ∈ A_p and C as in (b) the mass satisfies the following doubling property\n  \n    ρ(Bx,2R))≤ 2^npC^pρ(B(x,R))\n\n  for every x∈ and every R>0;\n  \n  (d) let ρ be any A_∞ density, then there exist two constants C>0 and γ>0 such that the inequality\n  \n    ρ(E)/ρ(B)≤C(|E|/|B|)^γ,\n\n\nholds for every ball B and every measurable subset E of B.\n\n\n\n\nThe proof of the above proposition can be found in <cit.> or <cit.>.\nThe first three properties are simple consequences of the definition of A_P.\nProperty (d) instead relies on subtle arguments such as the Calderón-Zygmund decomposition technique.  On the other hand Property (d) shall be crucial in our proof of the large scale of homogeneity in the next section.\n\n\n\nLet us give some examples of locally quite heterogeneous Muckenhoupt densities.  The first class of non trivial A_∞ densities which are radial with respect to some point x_0∈ are the powers of the distance.  In fact ρ(x)=|x-x_0|^β belongs to the Muckenhoupt class A_p() if and only if -n<β<n(p-1).  Hence ρ(x)=|x-x_0|^β belongs to A_∞ if and only if β>-n.  When β=0 we recover the trivial constant weights but, when -n<β<0 we have a singularity in x_0 and ρ can be arbitrarily large in any neighborhood of x_0.  On the other hand, when β>0, we have\ndensities that are unbounded at infinity, but they are still A_∞ densities.  An extension of the above is due to Ricci and Stein <cit.> (see also <cit.>).\n\n\n\nThe singularities of the density can actually be concentrated on sets which are quite irregular and large in the sense of Hausdorff dimension. In <cit.>, <cit.> and references therein, the problem of the construction of densities of Muckenhoupt type which are powers (positive or negative) of the distance to a closed set of  is considered.\nThe results are of the following type. Let F be a compact set with Hausdorff dimension n>s≥ 0, then\n\n    ρ(x)=d^β(x,F)\n\nbelongs to A_p() for -n(n-s)<β<(n-s)(p-1), where d(x,F)=inf{d(x,y):y∈ F} is the distance of x to F.\nIt is important to realize that n-1 is a possible value for s and, then\n\n    ρ(x)=1/√(d(x,F))\n\nbelongs to A_∞ if F is the boundary of some open domain in . Hence we can have densities with infinitely large values on very large sets of Hausdorff dimension less than n, for example on a surface of ^3 .\n\n\n\nSeveral important results of harmonic analysis provide tools for building singular weights. In particular the relation of Muckenhoupt classes with the space of functions of bounded mean oscillation.\n\n\n\nIn some sense these results revels that power laws are in some sense the extremals of the A_∞ class of densities. No exponential behavior for a density, as illustrated in Section <ref>, will produce the desired homogeneity in the large scales allowing strong heterogeneities in any bounded region of the space.\n\n\n\n§ THE MAIN RESULT\n\n\nLet us formally state and prove the main result of this note.\n\n\nLet ρ(x) be an A_∞() Muckenhoupt density. Then  with the density ρ(x) is homogeneous at the large scales.\n\n\n\nLet x^1 and x^2 be two points in  and let R>0 be given. With the notation introduced in Section <ref> we have to prove that\n\n    ρ(B(x^1,R))/ρ(B(x^2,R))1 .\n\nWith the standard notation for intersections and differences of sets we may write\n\n\n    ρ(B(x^1,R))/ρ(B(x^2,R))    = ρ(B(x^1,R)∩ B(x^2,R))+ρ(B(x^1,R)∖ B(x^2,R))/ρ(B(x^2,R)∩ B(x^1,R))+ρ(B(x^2,R)∖ B(x^1,R))\n        = 1+ρ(A_1)ρ(B(x^1,R)∩\n        B(x^2,R))1+ρ(A_2)ρ(B(x^2,R)∩ B(x^1,R))\n\n\nwith A_1=B(x^1,R)∖ B(x^2,R) and\nA_2=B(x^2,R)∖ B(x^1,R). Notice that\n\n\n  \n  * A_1⊂ E_1= B(x^1,R)∖ B(x^1,R-|x^1-x^2|)⊂ B(x^1,R);\n  \n  * A_2⊂ E_2= B(x^2,R)∖ B(x^2,R-|x^1-x^2|)⊂ B(x^2,R);\n  \n  * B(x^1,R/2)⊂ B(x^1,R)∩ B(x^2,R) for R large enough;\n  \n  * B(x^2,R/2)⊂ B(x^1,R)∩ B(x^2,R) for R large enough.\n\n\nNow use (3), (4) and the doubling property (c) in Proposition <ref> and obtain\n\n\n    ρ(A_i)/ρ(B(x^1,R)∩ B(x^2,R))≤ρ(A_i)/ρ(B(x^i,R/2))≤ 2^npC^p ρ(A_i)/ρ(B(x^i,R))\n\nfor i=1,2 and p such that ρ∈ A_p(). The constant C is that in (c) of Proposition <ref>. Let us now apply (1) and (2) above and then (d) in Proposition <ref>.  Doing so, since E_i⊂ B(x_i,R)  (i=1,2) we get\n\n    ρ(A_i)/ρ(B(x^1,R)∩ B(x^2,R))   ≤ 2^npC^pρ(E_i)/ρ(B(x^i,R))\n       ≤ 2^npC^pC(|E_i|/|B(x^i,R)|)^γ\n        = 2^npC^pC[R^n-(R-|x^1-x^2|)^n/R^n]^γ\n        = 2^npC^pC[1-(1-|x^1-x^2|/R)^n]^γ\n\nfor i=1,2. Since the above expression tends to zero for R→∞, we have the desired homogeneity in the large scales, i.e.\n\n    ρ(B(x^1,R))/ρ(B(x^2,R))1 .\n\nActually the last estimate provides a velocity of convergence in terms of the distance |x^1-x^2| between the two observers.\n\n\n\n\n\n\n§ ISOTROPY\n\n\nThe second component of the cosmological principle is the large scale isotropy of the universe. Roughly speaking, isotropy entails that from every point of the space the universe looks, at large scales, the same in any direction.\n\nAssume as before that the density of the universe of n dimensions is distributed according to the nonnegative density function ρ(x)=ρ(x_1,…,x_n). A quantitative version of the above qualitative formulation can be given by the fact that\n\n    lim_R→∞ λ(x_1,v⃗_⃗1⃗,R)/λ(x_2,v⃗_⃗2⃗,R) = 1\n\nfor every x_1,x_2 ∈ and v⃗_⃗1⃗,v⃗_⃗2⃗∈ S^n-1, where\n\n    λ(x,v⃗,R) = ∫_0^Rρ(x+tv⃗) dt\n\nfor x∈ and v⃗∈ S^n-1 the unit sphere in .\n\n\nNotice that in order to have the function λ well defined for every x∈, every R>0 and every v⃗∈ S^n-1 we need more than the local integrability of ρ. Nevertheless some local singularities of ρ are still possible with power laws weaker than those providing homogeneity. The next result shows a simple example of isotropy and homogeneity with a singularity.\n\n\n\tLet x_0 be a fixed point in  and 0<α<1. Let ρ(x)=x-x_0^-α, then\n\t\n    1/1-α[ (x-x_0+R)^1-α - x-x_0^1-α]     ≤λ(x,v⃗,R) \n       ≤x-x_0^1-α/1-α + 1/1-α(R-x-x_0)^1-α\n\n\tfor every x∈, v⃗∈ S^n-1 and R>x-x_0.\n\n\n\tLet us first estimate pointwise from above and from below the restriction of the density ρ to the half line {x+tv⃗: t>0}. Since -x-x_0≤ (x-x_0)·v⃗≤x-x_0, we have, for t>0 that -2tx-x_0≤ 2t (x-x_0)·v⃗≤ 2tx-x_0. Hence\n\t\n    (x-x_0) - tx-x_0/x-x_0^2≤(x-x_0)+tv⃗^2≤(x-x_0) + tx-x_0/x-x_0^2.\n\n\t Then for ρ(x+tv⃗)=(x+tv⃗)-x_0^-α, we have\n\t \n    ρ(x+tx-x_0/x-x_0) ≤ρ(x+tv⃗)≤ρ(x-tx-x_0/x-x_0).\n\n\t So that, integrating for t∈ [0,R] we get\n\t \n    ∫_0^R (x-x_0) + tx-x_0/x-x_0^-α dt ≤λ(x,v⃗,R)≤∫_0^R (x-x_0) - tx-x_0/x-x_0^-α dt.\n\n\t Then\n\t \n    ∫_0^R (t+x-x_0)^-α dt ≤λ(x,v⃗,R)≤∫_0^R x-x_0 - t^-α dt,\n\n\t or, for R large\n\t \n    1/1-α   [(x-x_0+R)^1-α - x-x_0^1-α]\n       ≤λ(x,v⃗,R)\n       ≤∫_0^x-x_0 (x-x_0-t)^-α dt + ∫_x-x_0^R (t-x-x_0)^-α dt\n       = x-x_0^1-α/1-α + 1/1-α(R-x-x_0)^1-α,\n\n\t as desired.\n\n\n\nFor x_0∈ and 0<α<1, the density ρ(x)=x-x_0^-α is homogeneous and isotropic.\t\n\n\nTake x_1, x_2∈; v⃗_⃗1⃗, v⃗_⃗2⃗∈ S^n-1 and R large. Applying Lemma <ref> we have\n\n    1/1-α[(x_1-x_0+R)^1-α-x_1-x_0^1-α]/x_2-x_0^1-α1-α+ 11-α(R-x_2-x_0)^1-α   ≤λ(x_1,v⃗_⃗1⃗,R)λ(x_2,v⃗_⃗2⃗,R)\n       ≤x_1-x_0^1-α1-α+ 11-α(R-x_1-x_0)^1-α/1/1-α[(x_2-x_0+R)^1-α-x_2-x_0^1-α].\n\nThe first and the last terms in the above inequalities tend to one for R→∞ and we are done, since ρ is a Muckenhoupt weight.\n\n\n\n\n\n §.§ Funding\n \nThis work was supported by the Ministerio de Ciencia, Tecnología e Innovación-MINCYT in Argentina: Consejo Nacional de Investigaciones Científicas y Técnicas-CONICET; and Universidad Nacional del Litoral-UNL.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\t\n\tAiCaDuTo14\n\tH. Aimar, M. Carena, R. Durán, and M. Toschi, Powers of distances to\n\t\tlower dimensional sets as Muckenhoupt weights, Acta Math. Hungar.\n\t143 (2014), no. 1, 119–137. 3215609\n\t\n\tCoifmanFefferman74\n\tR. R. Coifman and C. Fefferman, Weighted norm inequalities for maximal\n\t\tfunctions and singular integrals, Studia Math. 51 (1974), 241–250.\n\t358205\n\t\n\tDuLoG10\n\tRicardo G. Durán and Fernando López García, Solutions of the\n\t\tdivergence and analysis of the Stokes equations in planar\n\t\tHölder-α domains, Math. Models Methods Appl. Sci. 20\n\t(2010), no. 1, 95–120. 2606245\n\t\n\tGarciaCuervaRubioFranciaBook\n\tJosé García-Cuerva and José L. Rubio de Francia, Weighted\n\t\tnorm inequalities and related topics, North-Holland Mathematics Studies,\n\tvol. 116, North-Holland Publishing Co., Amsterdam, 1985, Notas de\n\tMatemática [Mathematical Notes], 104. 807149\n\t\n\tMTWgravitation\n\tCharles W. Misner, Kip S. Thorne, and John Archibald Wheeler,\n\tGravitation, W. H. Freeman and Co., San Francisco, Calif., 1973.\n\t0418833\n\t\n\tMuckenhoupt72\n\tBenjamin Muckenhoupt, Weighted norm inequalities for the Hardy maximal\n\t\tfunction, Trans. Amer. Math. Soc. 165 (1972), 207–226. 293384\n\t\n\tRicciStein87\n\tFulvio Ricci and E. M. Stein, Harmonic analysis on nilpotent groups and\n\t\tsingular integrals. I. Oscillatory integrals, J. Funct. Anal.\n\t73 (1987), no. 1, 179–194. 890662\n\t\n\tSteinBook93\n\tElias M. Stein, Harmonic analysis: real-variable methods, orthogonality,\n\t\tand oscillatory integrals, Princeton Mathematical Series, vol. 43, Princeton\n\tUniversity Press, Princeton, NJ, 1993, With the assistance of Timothy S.\n\tMurphy, Monographs in Harmonic Analysis, III. 1232192\n\t\n\n\n\n\n\n\n\nAffiliation. \nInstituto de Matemática Aplicada del Litoral, UNL, CONICET.\n\n\nAddress: \n\n\nE-mail address.  Hugo Aimar (corresponding author), , \nFederico Morana, \n\n\n"}