{"entry_id": "http://arxiv.org/abs/2303.07326v1", "published": "20230313174512", "title": "A Smoothing Algorithm for Minimum Sensing Path Plans in Gaussian Belief Space", "authors": ["Ali Reza Pedram", "Takashi Tanaka"], "primary_category": "cs.RO", "categories": ["cs.RO", "math.OC"], "text": "\n\n\n\nUnsupervised HDR Image and Video Tone Mapping via Contrastive Learning\n    Cong Cao, Huanjing Yue, Member, IEEE, Xin Liu, Jingyu Yang, Senior Member, IEEE\nThis work was supported in part by the National Natural Science\nFoundation of China under Grant 62072331 and Grant 62231018.\nC. Cao, H. Yue (corresponding author), X. Liu, and J. Yang are with the School of Electrical and Information Engineering, Tianjin University.\n    March 30, 2023 at \n==============================================================================================================================================================================================================================================================================================================================================================\n\nempty\nempty\n\n\n\n\nThis paper explores minimum sensing navigation of robots in environments cluttered with\nobstacles. The general objective is to find a path plan to a goal region that requires minimal\nsensing effort. In [1], the information-geometric RRT* (IG-RRT*) algorithm was  proposed to\nefficiently   find   such   a   path.   However,   like   any   stochastic   sampling-based   planner,   the\ncomputational complexity of IG-RRT* grows quickly, impeding its use with a large number of\nnodes. To remedy this limitation, we suggest running IG-RRT* with a moderate number of\nnodes, and then using a smoothing algorithm to adjust the path obtained. To develop a\nsmoothing algorithm, we explicitly formulate the minimum sensing path planning problem as\nan   optimization   problem.   For   this   formulation,   we   introduce   a   new   safety   constraint   to\nimpose a bound on the probability of collision with obstacles in continuous-time, in contrast\nto   the   common   discrete-time   approach.   The   problem   is   amenable   to   solution   via   the\nconvex-concave   procedure   (CCP).   We   develop   a   CCP   algorithm   for   the   formulated\noptimization and use this algorithm for path smoothing. We demonstrate the efficacy of the\nproposed approach through numerical simulations.\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nAdvancements in sensing and computer vision techniques over the last decades have facilitated the acquisition of  ample amounts of information for robot navigation. However, using all the available data can result in  long processing times; draining the available computational power and communication bandwidth. \nOne popular approach for managing the overhead of intense information processing is the strategic use of available sensory data as opposed to full deployment. For instance, in <cit.>, several feature selection algorithms are proposed and compared for efficient visual odometry/visual simultaneous localization and mapping. In <cit.> the features that contribute the most to state estimation are incorporated meanwhile others are ignored. In the same line of research, <cit.> incorporated a restriction on the sensing budget into an optimal control problem and proposed an algorithm for control and sensing co-design. In <cit.>, an attention mechanism is proposed for the optimal allocation of sensing resources.\n\n\n\nExecuting different path plans requires different amounts of sensory data.\n\nThus, it is crucial for an autonomous system to be able to find path plans that require minimal sensing. To achieve this capability, <cit.>  and <cit.> established the minimum sensing path planning paradigm, \n\nwhere a pseudo-metric is introduced for Gaussian belief space to quantify the\naugmented  control and information costs incurred in the transition between two arbitrary states. The work <cit.> proposed  an asymptotically optimal <cit.> sampling-based motion planner, referred to as information-geometric RRT* (IG-RRT*) to find the shortest path in the introduced metric.\n\n\n\n\nThe success of IG-RRT* in providing optimal path plans in obstacle-cluttered environments is verified through simulation in <cit.>. However, like any RRT* algorithm, the time complexity of IG-RRT*  with n nodes grows as 𝒪(nlog n) <cit.>. This complexity restricts finding a precise approximation of the optimal path plan directly by deploying  IG-RRT* for a large number of steps. We thus propose a two-stage procedure to circumvent this computational limitation of IG-RRT*. In the first stage, the algorithm is run for a moderate number of iterations to find an approximation of the optimal path. The path sought in this stage is “jagged\" in most cases due to the stochastic nature of IG-RRT*. In the second stage, this path is “smoothed\" toward the optimal path using gradient-based solvers.\n\nPerforming the second stage requires the minimum sensing path problem to be formulated explicitly as a shortest path problem with safety constraints ensuring a small probability of collision with obstacles. The explicit formulation of the shortest path problem in the belief space with safety constraints is a well-studied problem, and a core element of chance-constrained (CC) motion planners <cit.>. \nCC planners impose a set of deterministic constraints (e.g., see <cit.>) which ensure the instantaneous probability of collision with half-space obstacles is bounded at discrete time steps. \n\nThe probability of collision with polyhedral obstacles is bounded \nusing probabilistic bounds like  Boole's inequality <cit.>. Constraints that aim to bound the collision probability in continuous time, that is, in the transition between discrete-time steps, are less explored. <cit.> and <cit.> are among a few papers that studied continuous-time safety constraints using the reflection principle and cumulative Lyapunov exponent formulation, respectively. Yet, these papers only provide constraints to bound the probability of collision with half-space obstacles. \n\n\nIn this work, we derive novel safety constraints that directly bound the probability of collision with polyhedral obstacles in both discrete and continuous time. Our derivation is obtained using  strong duality and the theorem of alternatives <cit.>. Using the proposed safety constraints, we formulate the minimum sensing path problem explicitly. We partially convexify the resulting optimization and represent it as a difference of convex (DOC) program. By exploiting the DOC form, we devise an iterative algorithm that starts from the feasible solution obtained by IG-RRT* at stage one, and monotonically \nsmooths the path toward a locally optimal path using gradient-based solvers. The devised algorithm is the implementation of the convex-concave procedure (CCP) <cit.> for the formulated problem.  \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nNotation:  We write vectors in lower case x and matrices in upper case X. Let 𝕊_+^d={P∈ℝ^d × d: P=P^⊤≻ 0 } and x denote the 2-norm of x. For positive integers i<j, [i:j] denotes the set {i,  i+1, …,  j} and  [j]=[1:j]. x∼𝒩(x,P) denotes a Gaussian random variable with mean x and covariance P. The unit interval {a ∈ℝ: 0≤ a ≤ 1} is denoted by int and the zero vector in ℝ^f by 0_f. For vectors ≥ denotes element-wise inequality, e.g. a≥ 0_f.\n\n\n\n\n§ PRELIMINARIES\n\n\nAs in <cit.> and <cit.>, we model the minimum sensing navigation of a robot as a shortest path problem in Gaussian belief space ℝ^d×𝕊^d_+. In this setting, we search for the optimal joint control-sensing plan that drives the robot from an initial state to a target region while achieving the minimum steering cost (defined in Subsection <ref>) and a bounded probability of collision with obstacles.  \n\n\n\n\n §.§ Assumed Dynamics\n\nWe assume that the robot's dynamics are governed by a controlled Ito process\n\n\n\n    dx(t)=v(t) dt+ N^1/2 db(t),\n\n\nwhere x(t) ∈ℝ^d is the state  of the robot at time t with initial x(0)∼𝒩(x_0, P_0), v(t) is the velocity input command, b(t) is  d-dimensional standard\nBrownian motion, and N ∈𝕊^d is the process noise intensity.[ In practice, the path planning strategy we propose is applicable even if the robot's actual dynamics are different from  \n(<ref>). See <cit.> for further discussion.] We assume that the robot is commanded at constant periods of Δ t, and the control input is applied using a zero-order hold converter. Under these assumptions, (<ref>) can be discretized via\n\n\n\n    x_k = x_k-1+ u_k-1+w_k-1,\n\n\nwhere x_k is a state of the robot at time t=kΔ t, u_k-1=v(t_k-1)Δ t, and w_k-1∼𝒩(0, W := N Δ t).\n\nLet the probability distributions of the robot's state at\na given time step k-1 be parameterized by a Gaussian model x_k-1∼𝒩(x_k-1, P_k-1). After exerting the deterministic feed-forward control input u_k-1, the covariance propagates linearly to P̂_k=P_k-1+W, and the \nrobot's state becomes  (x_k=x_k-1+u_k-1, P̂_k) prior to the measurement at t_k. After the measurement at t_k, the covariance is reduced to the posterior covariance P_k≜ (P̂_k^-1+S_k)^-1≼P̂_k, where S_k∈𝕊_+^d is the information content of the measurement.[ See <cit.> \nthat explains how a given S_k is realized by an appropriate choice of sensors.]\n\n\n\n\n\n\n §.§ Steering Cost\n\n\nThe cost incurred during t_k-1→ t_k is defined as the weighted sum of control cost D_cont,k and the information acquisition cost D_info,k, as \n\n    𝒟_k≜𝒟_cont,k+ α𝒟_info,k,\n\nwhere α is the weight factor. The control cost is simply the control input power 𝒟_cont,k≜u_k-1^2=x_k-x_k-1^2.\nThe information cost is the entropy reduction incurred at the end of transition t_k-1→ t_k, defined as\n𝒟_info,k≜1/2logP̂_k - 1/2log P_k.\n\n\n\n §.§ Collision Constraints\n\n\nWe assume the path planning is to be performed inside a polyhedral domain 𝒳_dom := { x∈ℝ^d: a_dom,l^⊤ x ≤ b_dom,l, l ∈ [L] }, which is filled with polyhedral obstacles\n𝒳_obs^m := { x∈ℝ^d: A_obs,m  x ≤ b_obs,m}  for m∈ [M]. We assume the target region is also defined as \npolyhedral region 𝒳_tar := { x∈ℝ^d: a_tar,n^⊤ x ≤ b_tar,n, n ∈ [N]}. Fig. <ref> shows a sample environment with L=4, M=2, and N=4.  \n\n\n\n\nWe define the % confidence ellipse for a Gaussian distribution x∼𝒩(x_i,P_i) as ℰ_χ(x_i,P_i) := {x∈ℝ^d: (x-x_i)^⊤ P^-1(x-x_i) ≤χ^2()}, where χ^2() is the -th quantile of the Chi-squared distribution. For simplicity, we use χ^2 in the sequel. Fig. <ref> depicts a sample belief path with 6 steps using confidence ellipses, where two measurements are performed at time-steps k=3 and 6 with no measurement at all other time-steps k (which means S_k=0 for k∉{1,3}).\n\n\nFor a fixed confidence level χ^2>0,\nwe say a belief state (x_i,P_i) is collision-free if the confidence ellipse ℰ_χ(x_i,P_i) has empty overlap with obstacles 𝒳_obs^m for all m∈ [M] and is contained in 𝒳_dom. The collision-free constraint can be written as \n\n\n\n    x_obs∉ℰ_χ(x_i, P_i),   ∀ x_obs∈𝒳^m_obs,   m∈ M,\n       ℰ_χ(x_i,P_i) ⊆𝒳_dom.\n\n\n\nAt first glance, (<ref>) and (<ref>) seem to have two seperate mathematical forms. However, (<ref>) can be written as\n\n    x_out∉ℰ_χ(x_i,P_i),  ∀ x_out∈𝒳_out,\n\nwhere 𝒳_out := ℝ^d \\𝒳_dom. We can rewrite 𝒳_out as the union of half-space (1-faced polyhedral) obstacles 𝒳_out^l={x∈ℝ^d: -a_dom,l^⊤ x ≤ -b_dom,l} for l ∈ [L]. Hence, (<ref>) and (<ref>) can be jointly written as\nx_o∉ℰ_χ(x_i, P_i),   ∀ x_o∈𝒳^j_O,   j∈ [J:=M+L],\n\n\n\nwhere 𝒳^j_O∈{𝒳^1_obs, …, 𝒳^M_obs, 𝒳^1_out, …, 𝒳^L_out}.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor a fixed confidence level  χ^2>0, we say belief state (x_i,P_i) is an admissible final state if ℰ_χ(x_i,P_i) is contained in 𝒳_tar (i.e., ℰ_χ(x_i,P_i) ⊆𝒳_tar). For instance, ℰ_χ(x_6,P_6) in Fig. <ref> is an admissible final belief state.\n\n\nSimilar to 𝒳_out,  region 𝒳_tout:= ℝ^d\\𝒳_tar can be thought as the union of half-space obstacles  𝒳_tout^n={x∈ℝ^d: -a_n^⊤ x ≤ -b_n} for n∈ [N]. Thus,  ℰ_χ(x_i,P_i) is an admissible final state iff x_tout∉ℰ_χ(x_i,P_i), ∀ x_tout∈𝒳^n_tout,  ∀ n∈ [N].\n\n\n\n\n\nGoverned by dynamics (<ref>), it is easy to verify that the state of the robot in transition t_k-1→ t_k can be parameterized by s ∈ int as (x_k[s]= x_k-1+ s Δ x_k ,P[s] = P_k-1+ s W ), where Δ x_k:= x_k-x_k-1.\n\n\n\n\n\n\n\nFor a fixed confidence level χ^2>0, we say that the transition from x_k-1 to x_k with initial covariance P_k-1 is collision-free if for all s ∈ int, ℰ_χ(x[s],P[s]) has empty overlap with obstacles 𝒳_obs^m for all m∈[M], and 𝒳_out. Mathematically, it is equivalent to x_o∉ℰ_χ(x_k[s], P_k[s]),  ∀ x_o∈𝒳^j_O,   j∈ [J], ∀ s∈ int.\n\n\n\n\n\n\n\n\n\n§ PROBLEM FORMULATION\n\n\nLet's fix the number of time steps K and confidence level χ^2. Introducing information matrix Q_k:=(P_k-1+W)^-1= P_k^-1-S_k, the shortest path problem with respect to the proposed steering cost can be formulated as\n\n\n\n\n\n    min     ∑_k=1^K(x_k-x_k-1^2+α/2log (Q_k+S_k)\n             -α/2log Q_k) \n    s.t.     Q_k^-1 = (Q_k-1+S_k-1)^-1+W,  ∀ k ∈ [K],\n        x_o∉ℰ_χ(x_k[s],(Q_k+S_k)^-1[s]),\n       ∀ k∈ [K], ∀ x_o∈𝒳^j_O,  ∀ j∈ [J], ∀ s ∈ int\n       x_tout∉ℰ_χ(x_K,(Q_K+S_K)^-1),\n       ∀ x_tout∈𝒳^n_tout,  ∀ n∈ [N],\n\n where the minimization is performed over {x_k, Q_k, S_k}_k=1^K, and  x_0 and Q_0+S_0 := P_0^-1 are given.\nConstraint (<ref>) is the Kalman filter iteration, (<ref>) states all transitions t_k-1→ t_k are safe (collision-free), and  (<ref>) ensures that final belief is an admissible final state.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n We can define a relaxation of problem (<ref>) via\n \n\n\n\n\n    min     (<ref>)\n    s.t.       Q_k^-1≽ (Q_k-1+S_k-1)^-1+W,  ∀ k ∈ [K],\n       (<ref>) and (<ref>).\n\n\n\nThe following lemma proves that the optimal solution of Problem (<ref>)  is also an optimal solution of Problem (<ref>). Solving problem (<ref>) has computational advantage over solving problem (<ref>), as constraint  (<ref>) is convex whereas (<ref>) is not. More precisely, (<ref>) can be written as a linear matrix inequality (LMI)    \n\n\n\n    [         Q_k         Q_k        Q_kW;         Q_k Q_k-1+S_k-1           0;       W Q_k           0           W ]≽ 0, ∀ k ∈ [K].\n\n\n\n\n\n\n\n\n\nThe proof is based on contradiction. Assume the optimal value of Problem (<ref>) is  attained by (x^*_k, Q^*_k, S^*_k) as J^*,  where (<ref>) does not hold. We consider the set  (x^*_k, Q^**_k, S^*_k), where\n\n\n\n    Q_k^**-1 = (Q_k-1^**+S^*_k-1)^-1+W,  ∀ k∈ [K],\n\nstarting again from Q_0^**+S^*_0=P_0^-1,\nand show  (x^*_k, Q^**_k, S^*_k) is a feasible solution to Problem (<ref>) that attains a lower value J^**≤ J^*.\n\n\n\n\n\n\n    Q_k^**   ≽Q_k^*.\n\n\n\nWe proceed via induction on k. For k=1, we have Q_1^**-1 = Q_1^*-1 = P_0 + W, and thus the base step \nholds. We now assume (<ref>) holds for k=t and show (<ref>) holds for k=t+1. From Q_t^**≽Q_t^*, it immediately follows that\nQ_t+1^**-1 = (Q_t^**+S^*_t)^-1 + W ≼  (Q_t^*+S_t^*)^-1 + W ≼Q_t+1^*-1,\n\n\n\n\nwhich establishes the claim for k=t+1.\n\n\nClaim 1 implies that ℰ_χ(x^*_k[s], (Q_k^**+S_k^*)^-1[s]) ⊆ℰ_χ(x^*_k[s], (Q_k^*+S^*_k)^-1[s]) and  ℰ_χ(x^*_K,(Q̂_K^**+S^*_K)^-1) ⊆ℰ_χ(x^*_K,(Q̂_K^*+S^*_K)^-1), which proves (x^*_k, Q^**_k, S^*_k) satisfies constraints (<ref>), and (<ref>). Constraint (<ref>) is also satisfied trivially which leads to the conclusion that (x^*_k, Q^**_k, S^*_k) is a feasible solution for (<ref>). On the other hand, using the matrix determinant lemma we have\n\n\n\n    log (Q_k+S_k) - log Q_k\n       = log S_k+ log(Q_k^-1+S_k^-1).\n\nIt is trivial to see (<ref>) is decreasing function of Q_k, which proves J^**≤ J^*.\n\n\n\n\n\nBoth constraints  (<ref>), and (<ref>) have to be held over a continuous domain (like ∀ x_o∈𝒳_O^j), which cannot be handled directly by standard gradient-based solvers. In the upcoming subsections, we derive equivalent conditions for these constraints using strong duality and the theorem of alternatives <cit.>. \n\n\n\n\n §.§ Discrete-time Collision Constraint\n\n\nThe ellipse ℰ_χ(x_i,Q_i^-1) and the f-faced polyhedron 𝒳={ x: A x≤ b}  do not overlap if and only if ∃λ≥ 0_f such that\n\n    -λ^⊤ A Q_i^-1 A^⊤λ + 2 λ^⊤ (A x_i- b) ≥χ^2.\n\n\n\n\nInvoking the definition of confidence ellipse, the absence of overlap between ℰ_χ(x_i,Q_i^-1) and 𝒳 can be written as \n\n\n\n    ∀ x ∈𝒳,     (x-x_i)^⊤ Q_i (x-x_i) ≥χ^2,\n\nwhich is equivalent to the condition that the minimum value \n\n    V^* ≜min_x:Ax≤ b  (1/2)(x-x_i)^⊤ Q_i (x-x_i)\n\nis greater than χ^2/2. It is straightforward to see that the dual of (<ref>) is \n\n\n\n    max_λ≥ 0 -(1/2) λ^⊤ A Q_i^-1 A^⊤λ+ λ ^⊤ (A x_i - b),\n\nwhere λ≥ 0_f is the dual variable. The optimization problem (<ref>) is convex in x for a given pair of (x_i,P_i), and it is easy to verify that Slater's condition holds. Therefore, strong duality holds, implying that V^* ≥χ^2/2 if and only if there exists a dual feasible solution (λ≥ 0_f) satisfying (<ref>).  \n\n\n\n\nIf the polyhedron 𝒳 is a half-space {x: a^⊤ x ≤ b},\n (<ref>) simplifies to - (a^⊤ Q_i^-1 a) λ^2 + 2(a^⊤ x_i- b) λ -χ^2 ≥ 0,\nwhich is a second order function of scalar λ. It is easy to verify that the maximum of (a^⊤ x_i-b)^2/a^⊤ Q_i^-1 a-χ^2 is obtained at λ=a^⊤ x_i-b/a^⊤ Q^-1a≥ 0. Hence, (<ref>) reduces to \n\n\n\n    a^⊤ x_i+ √(χ^2 a^⊤  Q_i^-1 a)≤ b.\n\n\n\nEquation (<ref>) was previously derived in <cit.> and is extensively used in CC planners. Constraint (<ref>) is not convex in (x_i,Q^-1_i). In the following lemma, we derive an equivalent convex condition.  \n\n\nThe relation (<ref>) holds if and only if there exists a C≥ 0 such that\n\n    [ b-a^⊤ x_i         1;         1       γ C ]≽ 0,   and  [    1 Ca^⊤;   aC  Q_i ]≽ 0,\n\nwhere γ= (χ^2)^-1/2.\n\n\nIt is easy to verify that (<ref>) holds if and only if  there exists a C ≥ 0 such that a^⊤ Q_i^-1a ≤ C^-2 and a^⊤ x_i + γ^-1 C^-1< b. By applying Schur complement lemma to these inequalities, relation (<ref>) is obtained.\n\n\nUsing Lemma <ref>, we can rewrite (<ref>) as a set of convex constraints \n\n\n    \n    [ -b_tar,n+a_tar,n^⊤ x_K                      1;                      1                  γ C_n ]≽ 0,  ∀ n ∈ [N],\n       [             1 -C_na_tar,n^⊤;   -a_tar,nC_n       Q_K+S_K ]≽ 0,   C_n≥ 0,  ∀ n ∈ [N].\n\n\n\n\n §.§ Continuous-time Collision Constraint\n\nBased on Definition <ref>, we say a collision in transition t_k-1→ t_k with polyhedral obstacle 𝒳 ={x: Ax≤ b} is detected when\n\n\n\n    (x_k[s]-x)^⊤ P_k[s]^-1(x_k[s]-x) < χ^2,\n\nfor some s ∈ int and x∈𝒳. Collision detection can be formulated as the feasibility problem w.r.t s and x:\n\n    [                    χ^2 x_k-1^⊤+ s Δ x^⊤_k-x^⊤;       x_k-1+ s Δ x_k-x              P_k-1+s W ]≻ 0,\n       0≤ s ≤ 1,     A x ≤ b,\n\n\nwhich is a convex program  for arbitrary polyhedron 𝒳. More precisely,  transition t_k-1→ t_k is not in collision with 𝒳 iff (<ref>) is infeasible. \n\n\nProblem (<ref>) is infeasible for f-faced polyhedral obstacle 𝒳 ={x: A x≤ b}  iff there exists a λ≥ 0_f such that\n\n\n\n\n\n    -λ^⊤  A P_k-1 A^⊤λ + 2λ^⊤(A x_k-1-b)  ≥χ^2,\n        -λ^⊤  A (P_k-1+W) A^⊤ + 2λ^⊤(A x_k-b) ≥χ^2.\n\n\n\n\nBased on the theorem of alternatives; see Appendix <ref> for details.\n\n\nThe conditions (<ref>) and (<ref>) are similar to (<ref>).\nThey imply that the neither the initial ellipse ℰ(x_k-1,P_k-1) (when s=0) nor the final ellipse ℰ(x_k,P̂_k) (when s=1)  overlap with 𝒳. However, \n(<ref>) is stronger than the condition implying that initial and final confidence ellipses in transition t_k-1→ t_k are separately collision-free because  (<ref>) and (<ref>) should be satisfied for a common λ.  \n\n\nConstraint (<ref>) has a general non-convex form. Nevertheless, by writing (<ref>) in terms of information matrices and introducing a new slack variable R≥ 0, we can reformulate it as an LMI and a DOC constraint as\n\n\n\n    h_1(R,λ,Q_k)≜[      R λ ^⊤ A;   A^⊤λ    Q_k ]≽ 0, \n         \n       h_2(R,x_k,λ)≜R+χ^2+A x_k-b^2+λ^2\n                    -||Ax_k-b+λ||^2≤ 0.\n\n\nAn analogous reformulation can be performed for (<ref>).\n\n\n\n\n\n§ ALGORITHM\n\n\nSubstituting  (<ref>) and (<ref>), Problem (<ref>) becomes \n\n\n\n\n\n\n    min     (<ref>)\n    \n        \n         s.t.     (<ref>) and (<ref>),\n       \n       [ 2 λ_1,j^⊤ (A_jx_0-b_j)-χ^2                λ_1,j^⊤ A_j;                 A_j^⊤λ_1,j                    Q_0+S_0 ]≽ 0,\n    \n        \n        \n        \n        \n        \n        \n           h_1(R_k,j, λ_k,j,Q_k-1+S_k-1) ≽ 0,  ∀ k∈[2:K],\n    \n           h_1(R̂_k,j, λ_k,j,Q_k) ≽ 0, ∀ k∈[K],\n    \n        \n        \n        \n        \n           h_2(R_k,j, x_k-1, λ_k,j) ≤ 0, ∀ k∈[2:K], \n    \n        \n        \n        \n           h_2(R̂_k,j, x_k, λ_k,j) ≤ 0,\n         ∀ k∈[K],\n\n\n\nwith variables {x_k,Q_k≽ 0 ,S_k ≽ 0}_k=1^K, {C_n≥ 0}_n=1^N, {λ_k,j≥ 0, R̂_k,j≥ 0}_k=1, j=1^K,J, and { R_k,j≥ 0}_k=2, j=1^K,J. In (<ref>), we assumed 𝒳_O^j is defined as {x∈ℝ^d:A_j x ≤ b_j}, and constraints (<ref>)-(<ref>) are imposed for all j∈[J].  \n\nIn (<ref>), all terms in the objective function except log(Q_k+S_k), and all terms in constraints except\n-||A_jx_k-1-b_j+λ_k,j||^2 in (<ref>) and -||A_jx_k-b_j+λ_k,j||^2 in (<ref>) are convex. These non-convex terms are negative of convex functions, meaning that (<ref>) is a DOC problem.\n\n\n\nA variety of  sequential quadratic programming (SQP)-based\napproaches <cit.> could be used to solve the nonlinear program (<ref>) to local optimality. However, it would be required to  artificially assume that the sequence of convex programs in the SQP solvers stay feasible. In contrast, if we apply CCP to a DOC problem like (<ref>),  the concavity of the non-convex terms guarantees that the sequence of convex programs is feasible <cit.>. Also, it is shown that CCP monotonically converges to a local optimum <cit.>. \n\n\n\n\n §.§ Convex-Concave Procedure (CCP)\n\nCCP is an iterative method that starts from a feasible solution of a DOC optimization program. It over-approximates concave terms (both in the objective function and constraints) in the program via affine functions obtained by linearization around a feasible solution. The resulting convex problem can then be solved using standard convex solvers. The linearization is then repeated around the obtained solution, and the iteration continues until the sequence of solutions converges to a locally optimal solution <cit.>. \n\n\n\nTo implement CCP for (<ref>), we can linearize the functions  h_3(Q,S)≜log (Q+S)-log Q and h_2(R,x,λ) around  a feasible solution (Q̃,S̃, x̃, λ̃) by h̅_3(Q,S: Q̃,S̃) = log(Q̃+S̃)-log Q+ ((Q̃+S̃)^-1 (Q+S- Q̃-S̃)), and h̅_2(R, x,λ: x̃,λ̃) = R+χ^2+A x_k-b^2+λ^2 -\nAx̃-b+λ̃^2 - 2\n    (Ax̃-b+λ̃)^⊤ (A(x-x̃)+λ-λ̃), respectively.\nDenoting the the solution obtained via the  CCP iteration i as {x_k^i, S_k^i, Q^i_k}_k=1^K and {λ_k,j^i}_k=1,j=1^K,J, at iteration i+1 we solve the convex problem\n\n\n\n\n\n    min     ∑_k=1^Kx_k-x_k-1^2  +α/2h̅_3(Q_k,S_k:Q^i_k,S^i_k)\n    \n        \n        \n         s.t.     (<ref>)- (<ref>),\n        \n    \n           h̅_2(R_k,j,x_k-1,λ_k,j: x_k-1^i,λ_k,j^i) ≤ 0, \n       ∀ k∈[2:K], ∀ j ∈[J],\n    \n        \n           h̅_2(R̂_k,j, x_k,λ_k,j: x^i_k, λ_k,j^i)≤ 0, \n    \n           ∀ k∈[K],   ∀ j ∈[J].\n\n\n\n\n\n\n\n §.§ Initialization\n\nThe first stage of CCP starts from an initial feasible solution {x^0_k, S_k^0, Q^0_k}_k=1^K and {λ_k,j^0}_k=1,j=1^K,J. However, the IG-RRT* algorithm does not explicitly provide a set of {λ_k,j^0}_k=1,j=1^K,J. In IG-RRT*, the collisions are checked through a numerical state-validator function (like any sampling-based method),  and not directly through (<ref>).\n\n\n\nNevertheless, a feasible λ^0_k,j that satisfies (<ref>)\nfor polyhedral obstacles 𝒳_o^j={x:A_j x≤ b_j} and a feasible set {x^0_k, S^0_k, Q^0_k}_k=1^K obtained from IG-RRT* can be sought by solving the convex feasibility problem  \n\n\n    [ 2 λ_k,j^⊤ (A_j x^0_k-1-b_j)-χ^2                     λ_k,j^⊤ A_j;                      A_j^⊤λ_k,j                 Q_k-1^0+S^0_k-1 ]≥ 0, \n       [ 2 λ_k,j^⊤ (A_jx^0_k-b_j)-χ^2                  λ^⊤_k,j A_j;                   A_j^⊤λ_k,j                        Q^0_k ]≥ 0, \n      λ_k,j≥ 0,\n\nw.r.t λ_k,j.\n\n\n\n\n\n§ SIMULATION RESULTS\n\nFig. <ref> shows a 1m× 1m obstacle-filled environment, and the path plans obtained by the IG-RRT* algorithm with N=500 and W=0.2× 10^-3 I_2 for two values of α=0.1 and α=1.0. Fig. <ref> depicts the smoothed versions of these paths obtained after 15 CCP iterations. A comparison between Fig. <ref> and Fig. <ref> reveals the success of the proposed algorithm in smoothing the path plans obtained from the stochastic IG-RRT algorithm.  \n\nThe videos showing the evolution of the paths during the smoothing algorithm for α=0.1 and 1.0 are accessible at https://youtu.be/ieUbd1uj-aEhttps://youtu.be/ieUbd1uj-aE and https://youtu.be/nNZn4GGbbWshttps://youtu.be/nNZn4GGbbWs, respectively. Fig. <ref> demonstrates the monotonic reduction of steering costs in the sequence of path plans obtained in CCP iterations.  \n\n\n\n\n\n\n§ CONCLUSION AND FUTURE WORK\n\n\nIn this work, we studied the smoothing of minimum sensing belief paths obtained by the IG-RRT* algorithm. We derived a novel safety constraint to bound the probability of collision with polyhedral obstacles in the transition between two Gaussian belief states. We deployed the presented safety constraint to formulate minimum sensing path planning as an optimization problem. We formulated this problem as a DOC program, for which the CCP algorithm can be utilized to find local optima. We proposed to use such a CCP algorithm as an efficient smoothing algorithm.\n\nNumerical simulations demonstrated the utility of the proposed algorithm.\n\nThis paper assumes a fixed (common) confidence level for all\ntransitions on the path, and it is silent about the end-to-end\nprobability of collision. One future direction is to develop a\nsmoothing mechanism that allows the allocation of (potentially) different confidence\nlevels to each transition subject to a constraint on the end-to-end collision probability.\n\n\n\n\n\n\n§ PROOF OF THEOREM <REF> \n \nWe provide the proof for d=2; however, the proof can be generalized for arbitrary dimension. \nIf we denote the elements of x as x= [q_1  q_2]^⊤, feasibility problem (<ref>) becomes\n\n\n\n\n\n    min_s≥ 0,  q_1, q_2      0\n    s.t.      \n    R_0 +R_1 q_1+R_2 q_2+ R_3s≻ 0,\n        s ≤ 1,     A_1 q_1 + A_2 q_2 ≤ b,\n\n\nwhere\n\n\n\n    R_0=[     χ^2 x_k-1^⊤;   x_k-1   P_k-1 ],    \n        R_1=[  0 -1  0; -1  0  0;  0  0  0 ],\n        R_2=[  0  0 -1;  0  0  0; -1  0  0 ], \n           R_3=[       0 Δ x_k^⊤;   Δ x_k       W ],\n\nand A_1 and A_2 are the first and the second columns of A, respectively. The\nLagrangian of problem (<ref>), can be written as ℒ(q_1,q_2,s, M, γ, λ) = (-(R_0 +R_1 q_1+R_2 q_2+ R_3 s) M)+ γ (s-1) +λ^⊤(A_1 q_1 + A_2 q_2- b), where M≽0, γ≥0, and λ≥ 0 are dual variables. Dual function for (<ref>) can be written as\ng(M, γ, λ) = -(R_0M)-λ^⊤ b-γ+ inf_q_1 (-(R_1M)+λ^⊤ A_1)   q_1 + inf_q_2 (-(R_2M)+λ^⊤ A_2)  q_2+ inf_s≥0(-(R_3M)+γ) s. \n\n\n\n\n\n\n\n\n\nHence, the dual problem of (<ref>) can be written as\n\n\n\n\n\n    max      -(R_0M)-λ^⊤ b-γ\n    s.t.       -(R_1M)+λ^⊤ A_1=0,\n         -(R_2M)+λ^⊤ A_2=0,\n       -(R_3M)+γ≥ 0.\n\n\n where variables are M≽ 0, γ≥ 0, and λ≥ 0. If we denote the element at the ith row and the jth column of M by m_i,j, \n\n\n\n\n\n\nconstraints (<ref>) and (<ref>) yield [m_1,2  m_1,3] = -1/2λ^⊤ A. Hence, M has the form  \n\n\n\n    M=1/2[     M_1 - λ^⊤ A;   -A^⊤λ     M_2 ]≽ 0.\n \nUsing the structure of M, Problem (<ref>) turns to \n\n\n\n\n\n\n\n\n\n\n\n\n\n    max     -1/2M_1χ^2+λ^⊤(A x_k-1-b) -1/2(P_k-1 M_2)-γ\n    s.t.     [   M_1 λ^⊤ A;  A^⊤λ   M_2 ]≽ 0, \n    1/2(WM_2)- λ^⊤ A Δ x_k  ≤γ,\n\nwhere the variables are M_1>0, M_2≽ 0, λ≥ 0, and γ≥ 0.\n\n\nAfter performing the maximization w.r.t γ, \nthis optimization simplifies to \n\n\n\n\n    max_M_1≥ 0, M_2≽ 0, λ≥ 0   -1/2M_1χ^2+λ^⊤(A x_k-1-b)-1/2(P_k-1 M_2)\n       +min{0,-1/2(WM_2)+λ^⊤A Δ x_k}\n    s.t.       [   M_1 λ^⊤ A;  A^⊤λ   M_2 ]≽ 0.\n\n\nThe objective function and the constraints in (<ref>) are affine in dual variables M_1, M_2, and λ. Thus, (<ref>) is unbounded iff it admits a feasible solution (M_1>0,  M_2≽ 0, λ≥0,) that yields a positive value of objective function. From the theorem of alternatives, we know unboundedness of dual problem implies the infeasibility of primal problem and vice versa. Hence, (<ref>) is infeasible iff ∃λ≥0, M_2≽ 0 such that\n\n\n\n\n\n    2λ^⊤(A x_k-1-b) - (P_k-1 M_2) ≥χ^2,\n       2λ^⊤(A x_k-b) - ((P_k-1+W) M_2) ≥χ^2,\n        M_2≽λ^⊤ A A^⊤λ,\n\n\nwhere w.l.o.g we assumed M_1=1 and (<ref>) is obtained by applying Schur complement lemma to (<ref>).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt is easy to verify that the maximum values of the LHS of both (<ref>) and (<ref>) subject to (<ref>) are obtained at M_2=λ^⊤ A A^⊤λ. Hence, condition (<ref>) can be equivalently written as ∃λ≥0 such that (<ref>) holds, which completes the proof.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n-0cm   \n\n\n\n\n\n\n\n\nIEEEtran\n\n\n"}