{"entry_id": "http://arxiv.org/abs/2303.06706v1", "published": "20230312165606", "title": "Constructing Galois representations with prescribed Iwasawa $λ$-invariant", "authors": ["Anwesh Ray"], "primary_category": "math.NT", "categories": ["math.NT", "11R23, 11F80 (Primary) 11F11, 11R18 (Secondary)"], "text": "\n\n\nConstructing Galois representations with prescribed λ-invariant]Constructing Galois representations with prescribed Iwasawa λ-invariant\n\n\nA. Ray]Anwesh Ray\n[Ray]Centre de recherches mathématiques,\nUniversité de Montréal,\nPavillon André-Aisenstadt,\n2920 Chemin de la tour,\nMontréal (Québec) H3T 1J4, Canada\nanwesh.ray@umontreal.ca\n\n\n\n\n[2020]11R23, 11F80 (primary); 11F11, 11R18 (secondary) \n\n[\n    [\n    March 30, 2023\n==================\n\n\n\n\nLet p≥ 5 be a prime number. We consider the Iwasawa λ-invariants associated to modular Bloch-Kato Selmer groups, considered over the cyclotomic ℤ_p-extension of ℚ. Let g be a p-ordinary cuspidal newform of weight 2 and trivial nebentype. We assume that the μ-invariant of g vanishes, and that the image of the residual representation associated to g is suitably large. We show that for any number greater n greater than or equal to the λ-invariant of g, there are infinitely many newforms f that are p-congruent to g, with λ-invariant equal to n. We also prove quantitative results regarding the levels of such modular forms with prescribed λ-invariant.\n\n\n\n\n§ INTRODUCTION\n\n\nThe Iwasawa theory of Selmer groups associated to Galois representations captures significant arithmetic information about motives. Let p be a prime number. Given an elliptic curve E_/, and a number field extension F/, the p-primary Selmer group of E over F is of fundamental importance and captures information about the Mordell-Weil group E(F) and the p-primary part of the Tate-Shafarevich group (E/F). The fundamental object of study in the Iwasawa theory of elliptic curves is the p-primary Selmer group over the cyclotomic _p-extension, denoted Sel_p^∞(E/_cyc). Mazur <cit.> initiated the Iwasawa theory of elliptic curves E with good ordinary reduction at p, and associated structural invariants associated with these Selmer groups.\n\n\n\n §.§ Main results\n In this paper we consider λ-invariants associated to Bloch-Kato Selmer groups attached to modular Galois representations. We prove certain qualitative and quantitative results about the levels of modular forms that arise in natural families, for which the λ-invariant is prescribed to be a fixed value. We fix a cuspidal Hecke newform g of weight 2 on Γ_0(N_g). Associated with a fixed choice of embedding ι_p:↪_p, let ρ_g be the associated Galois representation. It is assumed that the image of the residual representation ρ̅_g:Gal(/)→GL_2(_p) is up to conjugation, equal to GL_2(_p). When we assume that p is odd and g is p-ordinary, the Iwasawa μ and λ-invariants are well defined, and denoted by μ_p(g) and λ_p(g) respectively (cf. section <ref>).\n\n\n   Let p≥ 5 be a prime and let g be a normalized newform of weight 2 on Γ_0(N_g). We assume the following conditions\n\n \n\n  * We shall assume that the image of the residual representation ρ̅_g lies in GL_2(_p). Moreover, the Galois representation\nρ̅_g:Gal(/)→GL_2(_p) is surjective.\n\n  * The modular form g is p-ordinary and p∤ N_g,\n\n  * g has optimal level, i.e., N_g is the prime to p part of the Artin conductor of the residual representation,\n\n  * μ_p(g)=0.\n\nAssociated with g, let Π_g be the set of prime numbers ℓ such that the following conditions are satisfied:\n\n    \n  * ℓ∤ N_g p, \n    \n  * ℓ≢± 1p and ℓ^p-1≢1p^2,\n    \n  * ρ̅_g(σ_ℓ)=ℓ001 for a suitable choice of basis for the residual representation.\n\n\nLet Ω_g be the set of prime numbers such that \n\n    \n  * ℓ∤ N_g p, \n    \n  * ℓ≢± 1p,  \n  * ρ̅_g(σ_ℓ)=-ℓ00-1 for a suitable choice of basis for the residual representation. \n    \n    The primes Π_g and Ω_g have Dirichlet density (p-3)/p(p-1) and (p-3)/(p-1)^2 respectively.\n\n\nLet n, r∈_≥ 0 be such that max{n, r}>0. \nLet n≥ 1 be an integer. Then for any sets of primes {q_1, …, q_n}⊂Π_g and {ℓ_1, …, ℓ_r}⊂Ω_g, there exists a normalized newform f of weight 2 of level N_f=N_g ×∏_i=1^n q_i×∏_j=1^r ℓ_j such that \n\n    \n  * f has good ordinary reduction at p, \n    \n  * ρ̅_g≃ρ̅_f, \n    \n  * μ_p(f)=0, \n    \n  * λ_p(f)=λ_p(g)+n.\n\n\n\n\n\nIn the special case when μ_p(g)=0 and λ_p(g)≤ 1, one is able to realize an infinite family of modular forms f that are p-congruent to g, for which the Bloch-Kato Selmer group over  has prescribed corank. We refer to Theorem <ref> for the statement of the result.\n\nThe following result further illustrates Theorem <ref>.\n\n\n    There is a positive density set of primes p, such that for any n≥ 0, there exist infinitely many normalized Hecke cuspdidal newforms f of weight 2 such that \n    \n    \n  * f has good ordinary reduction at p, \n    \n  * ρ̅_f is surjective, \n    \n  * μ_p(f)=0, \n    \n  * λ_p(f)=n.\n\n\n\n\n §.§ Relationship with previous work\n The existence of Galois representations for which the associated Selmer groups have large λ-invariant has been studied by various authors, cf. <cit.>. Our results are significantly stronger since we are able to explicitly realize any large enough integer as a λ-invariant. If at a given prime p≥ 5, there exists a newform g satisfying the conditions of Theorem <ref>, and such that λ_p(g)=0, then, every integer n≥ 0 is seen to arise from a modular form which is p-congruent to g. This is indeed the case for a density 1 set of primes p, as shown by the proof of Theorem <ref>. Furthermore, not only is one able to construct infinitely many modular Galois representations giving rise to a prescribed λ-invariant, one also obtains an explicit and satisfactory quantitative description of their levels. We contrast Theorem <ref> to the results of recent work by Hatley and Kundu <cit.>, where it is shown that there are infinitely many modular forms f that are p-congruent to a fixed modular form g, for which λ_p(f)=λ_p(g). This λ-stability result requires an additional assumption on g: that the λ-invariant of g is minimal in the family of all λ-invariants for modular forms that are p-congruent to g. For further details, we refer to p.15 of loc. cit. This assumption is clearly satisfied when λ_p(g) is 0. This λ-stability result follows from Theorem <ref> in the special case when n=0, without the additional hypothesis. The method used in proving our results does draw some inspiration from <cit.>.\n\n\n\n §.§ Organization\n Including the introduction, the manuscript consists of 5 sections. In section <ref>, we set up basic notation and review the level raising theorems of Carayol (cf. Theorem <ref>) and Diamond-Taylor (cf. Theorem <ref>). In section <ref>, we describe the relationship between the Bloch-Kato and Greenberg Selmer groups over the cyclotomic _p-extension of . We describe the Iwasawa invariants associated to these Selmer groups. In section <ref>, we recall the results of Greenberg and Vatsal, and prove Theorem <ref>, which paves the way to the proof of Theorem <ref>. In section <ref>, we compute the densities of the sets Π_g and Ω_g, and prove Theorems <ref> and <ref>.\n\n\n\n §.§ Acknowledgment\n The author's research is supported by the CRM Simons postdoctoral fellowship. \n\n\n\n\n§ PRELIMINARIES\n\nFix an algebraic closure /, and for each prime ℓ, let _ℓ be an algebraic closure and fix an inclusion of ι_ℓ:↪_ℓ. Set  to be the integral closure of  in . The choice of embedding ι_ℓ corresponds to a choice of prime 𝔩|ℓ of . The inclusion ι_ℓ induces an isomorphism of _𝔩 with _ℓ. Let G_ℓ denote the absolute Galois group Gal(_ℓ/_ℓ). The inclusion ι_ℓ induces an inclusion of G_ℓ into Gal(/), whose image is the decomposition group of 𝔩. Let I_ℓ be the inertia group of G_ℓ, and choose a Frobenius element σ_ℓ∈G_ℓ. Given a Galois representation ρ:Gal(/)→GL_2(·), let ρ_|ℓ be the restriction of ρ to G_ℓ. The representation ρ is unramified at ℓ if the restriction of ρ_|ℓ to I_ℓ is trivial. Fix a prime p≥ 5 and let |p be the prime above p, corresponding to the inclusion ι_p. Let f=∑_n=1^∞ a_n(f)q^n be a normalized cuspidal newform of weight k≥ 2 and ρ_f:Gal(/)→GL_2(_p) be the associated Galois representation. The Hodge-Tate weights for the Galois representation are {k-1, 0}. We note here that this is simply a matter of convention (instead of the Hodge-Tate weights being {0, 1-k}). There is a finite extension K over _p such that w.r.t a suitable choice of basis, the image of ρ_f lies in GL_2(K). In greater detail, let F be a number field containing the Fourier coefficients of f, and K is the completion F_𝔭. We set V_f≃ K^2 to denote the underlying Galois module for the representation ρ_f. Set  to denote the valuation ring of K, ϖ be a uniformizer of , and let κ:=/(ϖ) be the residue field of . There exists a Galois stable -lattice T_f⊂ V_f. We shall also denote the integral representation on T_f by ρ_f:Gal(/) →GL_2(). We denote its mod-ϖ reduction by ρ̅_f:Gal(/) →GL_2(κ). We shall assume throughout the ρ̅_f is absolutely irreducible. In this setting, it is easy to see that the Galois stable -lattice T_f is uniquely determined, and hence, there is no ambiguity in the notation used.\n\n\n §.§ The level raising results of Diamond-Taylor\n\nLet p be an odd prime number and ρ̅:Gal(/)→GL_2(_p) be an irreducible Galois representation. Let c∈Gal(/) denote the complex conjugation; ρ̅ is odd if detρ̅(c)=-1. Serre <cit.> conjectured that any odd and irreducible representation is modular. In greater detail, the strong form of the conjecture states that ρ̅ arises from a cuspidal newform g of weight k≥ 2 on Γ_1(N_ρ̅), where N_ρ̅ is the prime to p part of the Artin-conductor of ρ̅ (cf. <cit.>). The weight k=k(ρ̅) is prescribed according to <cit.>. Khare and Wintenberger <cit.> proved Serre's conjecture, building upon prior work of Ribet <cit.>. Suppose that f is a newform of weight k and level N_f coprime to p, such that the associated p-adic Galois representation ρ_f lifts ρ̅. Then, the optimal level N_ρ̅ divides N_f. A theorem of Carayol <cit.> proves necessary conditions for an integer N_f to arise in this way from a newform f.\n\n    Suppose there exists a modular form f of weight k of level N_f such that ρ̅=ρ̅_f is absolutely irreducible. The level N_f admits a factorization N_f=N_ρ̅∏_ℓℓ^α(ℓ), \nand for each ℓ with α(ℓ)>0, one of the following holds:\n\n\n  * ℓ∤ N_ρ̅, ℓ(traceρ̅(σ_ℓ) )^2 = ( 1+ℓ)^2 detρ̅( σ_ℓ) in _p, and α(ℓ)=1;\n\n  * ℓ≡ -1 p and one of the following holds:\n\n\n  * ℓ∤ N_ρ̅, traceρ̅(σ_ℓ) ≡ 0 in _p, and α(ℓ)=2;\n\n  * ℓ N_ρ̅, detρ̅ is unramified at ℓ, and α(ℓ)=1;\n\n\n  * ℓ≡ 1 p and one of the following holds:\n\n\n  * ℓ∤ N_ρ̅ and α(ℓ)=2;\n\n  * ℓ N_ρ̅ and α(ℓ)=1 or ℓ∤ N_ρ̅ and α(ℓ)=1.\n\n\n\n\n\n\n    The set of levels satisfying the conditions outlined in Theorem <ref> is denoted by 𝒮(ρ̅).\n\n\n\nLet p≥ 5 be a prime, \n    ρ̅:Gal(/)→GL_2(_p)\n be an irreducible Galois representation. Assume that ρ̅ arises from a newform g on Γ_1(N_ρ̅) of weight k. Assume that k lies in the range 2≤ k≤ p-2, and let M∈𝒮(ρ̅). Then there exists a cuspidal newform f of weight k on Γ_1(M), such that ρ̅_f=ρ̅. \n\nThe result of Carayol and the above level-raising result of Diamond and Taylor shows that 𝒮(ρ̅) is precisely the set of levels for the cuspidal newforms f such that ρ̅_f≃ρ̅. \n \n\n\n\n\n§ SELMER GROUPS ASSOCIATED TO MODULAR FORMS\n\n\nLet f=∑_n=1^∞ a_n(f) q^n be a normalized new cuspform on Γ_1(N_f) and p be an odd prime which is coprime to N_f. Let ρ_f:Gal(/)→GL_2() be the associated Galois representation and assume that the residual representation is absolutely irreducible. Here, K/_p is a finite extension and  is the valuation ring of K. Let V_f and T_f be as defined in previous sections. We shall assume throughout that p is an ordinary prime, i.e., p∤ a_p(f). Set μ_p^n to denote the p^n-th roots of unity in , and let (μ_p^n) be the cyclotomic extension of  generated by μ_p^n. Note that the Galois group Gal((μ_p^n)/) is isomorphic to (/p^n)^×. Let (μ_p^∞) be the union of cyclotomic fields (μ_p^n). The Galois group Gal((μ_p^∞)/) is isomorphic to _p^× and decomposes into a product Δ×_p, where Δ is isomorphic to /(p-1). The cyclotomic _p-extension _cyc is the field (μ_p^∞)^Δ and the Galois group Gal(_cyc/) is isomorphic to _p. For n≥ 0, the n-th layer _n/ is the extension contained in _cyc such that [_n:]=p^n.\n\n\n\n §.§ Definition of Selmer groups\n\nLet S be a finite set of rational primes containing {p, ∞}, and _S⊂ be the maximal extension in which all primes ℓ∉ S are unramified. Setting A_f:=V_f/T_f, we note that A_f≃(K/)^2. Let d^± be the dimension of the (± 1)-eigenspaces for complex conjugation. We note that d^+=d^-=1. Since we assume that f is p-ordinary, there exists a 1-dimensional, K-subspace W_f⊆ V_f of dimension 1, which is stable under the action of G_p. Let C be the image of W_f in A_f, with respect to the mod-T_f map V_f→ A_f, and set D=A_f/C. \n\nWe assume that the set S contains all primes dividing N_f. Let L be an extension of  which is contained in _cyc. Thus L is the field _n for some n≥ 0, or is the field _cyc. Given a rational prime ℓ, set ℓ(L) to be the set of primes of L that lie above ℓ. We note that the set ℓ(_cyc) is finite. Given a prime w of _cyc, let _cyc, w be the union of all completions of p-adic fields contained in _cyc at w. Given a prime ℓ∈ S, the Greenberg local Selmer condition _ℓ(L, A_f) is defined as follows. For ℓ≠ p, the local condition is defined by \n    _ℓ(L, A_f):=∏_w∈ℓ(L) H^1(L_w,A_f).\n The local condition at ℓ=p is defined differently. Let η_p be the unique prime of L that lies above p; let I_η_p denote the inertia subgroup of Gal(L̅_η_p/L_η_p). Let \n\n    H_η_p:=ker(H^1(L_η_p, A_f)⟶ H^1(I_η_p, D)),\n and set \n\n    _p(L, A_f):=H^1(L_η_p, A_f)/H_η_p.\n\nFollowing <cit.>, the Greenberg Selmer group Sel^Gr(L, A_f) is then defined as follows\n\n    Sel^Gr(L, A_f):=ker(H^1(_S/L,A_f)⟶⊕_ℓ∈ S_ℓ(L, A_f)).\n\nFor ℓ∈ S, _ℓ(_cyc, A_f) is a cofinitely generated _p-module (cf. <cit.>). We let σ_ℓ(f) denote the -corank of _ℓ(_cyc, A_f). For ℓ≠ p, we describe an algorithm to compute σ_ℓ(f). Let V_f' be the quotient (V_f)_I_ℓ and P_ℓ(f;X) be the mod-ϖ reduction of P_ℓ(f;X):=det(Id-σ_ℓ X| V_f'). Let s_ℓ be the number of primes of _cyc that lie above ℓ. Note that s_ℓ is the maximal power of p such that ℓ^p-1≡ 1ps_ℓ. Let d_ℓ(f) be the multiplicity of ℓ^-1 as a root of P_ℓ(f;X). By <cit.>, it follows that σ_ℓ(f) is given by\n\n    σ_ℓ(f)=s_ℓ d_ℓ(f).\n\n\nGiven a number field L/ contained in _cyc, we set Sel^BK(L, A_f) denote the Bloch-Kato Selmer group associated to A_f, cf. <cit.> or <cit.> for the precise definition. The Bloch-Kato Selmer group over _cyc is defined as the direct limit\n\n    Sel^BK(_cyc,A_f):=_n Sel^BK(_n,A_f).\n\n\n\nWith respect to notation above, there is a natural map \n    Sel^BK(_cyc, A_f)→Sel^Gr(_cyc, A_f)\nwith finite kernel and cokernel. \n\n\n    The result above is <cit.>.\n\n\nFrom the point of view of Iwasawa theory, we may work with either Selmer group Sel^BK(_cyc, A_f) or Sel^Gr(_cyc, A_f). It conveniences us to work with the Greenberg Selmer group, and for ease of notation, we simply set \n    Sel(_cyc, A_f):=Sel^Gr(_cyc, A_f).\n\n\n\n\n §.§ Iwasawa invariants\n\n\nWe set Γ:=Gal(_cyc/) and Λ denote the Iwasawa algebra Γ:=_n [Γ/Γ^p^n]. Given a module M over Λ, we shall set M^∨:=Hom_cnts(M, _p/_p). A module M over Λ is said to be cofinitely generated (resp. cotorsion) if M^∨ is finitely generated (resp. torsion) as a module over Λ. The Selmer group Sel(_cyc, A_f) is a cofinitely generated module over Λ. There are many cases of interest for which it is known to be cotorsion over Λ, which we shall further discuss in the next subsection. Given Λ-modules M and M', a pseudo-isomorphism is a map of Λ-modules M→ M' whose kernel and cokernel both have finite cardinality. Let M be a cofinitely generated and cotorsion Λ-module, then, as is well known, there is a pseudo-isomorphism \n\n    M⟶(⊕_i=1^s Λ/(ϖ^m_i))⊕(⊕_j=1^t Λ/(f_j(T)^n_j)).\n In the above sum, s, t, m_i, n_i∈_≥ 0, and f_j(T) is an irreducible distinguished polynomial in Λ, i.e., an irreducible monic polynomial whose non-leading coefficients are divisible by ϖ. The μ-invariant is given by \n\n    μ_p(M):=∑_i m_i     if s>0;\n    \n    0     if s=0.\n\nOn the other hand, the λ-invariant is given by \n\n    λ_p(M):=∑_j n_jdeg(f_j)     if t>0;\n    \n    0     if t=0.\n\n It follows from results of Kato <cit.> that Sel(_cyc/A_f) is a cotorsion module over Λ. Then, the μ (resp. λ) invariant of Sel(_cyc, A_f) is denoted by μ_p(f) (resp. λ_p(g)). We note that μ_p(f)=0 if and only if Sel(_cyc, A_f) is cofinitely generated as an -module, and in this case, \n    λ_p(f)=corank_(Sel(_cyc, A_f)).\n It follows from Proposition <ref> that the λ-invariant of Sel(_cyc, A_f) is equal to the λ-invariant of Sel^BK(_cyc, A_f). We shall set rank^BK(f) to denote the -corank of the Bloch-Kato Selmer group Sel^BK(, A_f). \n\n    Assume the μ_p(f)=0. The following assertions hold:\n    \n\n  *  rank^BK(f)≤λ_p(f),\n\n  *  rank^BK(f)≡λ_p(f)2,\n\n  * \nsuppose that λ_p(f)≤ 1, then, rank^BK(f)= λ_p(f).\n    \n\n\n\nPart (<ref>) follows as a direct consequence of <cit.>. Part (<ref>) follows from a standard argument due to Greenberg <cit.>, see <cit.>. Part (<ref>) is a direct consequence of (<ref>) and (<ref>).\n\n\nWe note that the conventions used here are the same as those in <cit.>. Note that the ring  is chosen to be the valuation ring of F_. It is easy to see that the definition of the λ-invariant λ_p(f) is independent of the choice of field F, and thus the valuation ring . Also, we note that the μ-invariant vanishes for the Selmer group over , if and only if it vanishes after base-change by any valuation ring '/. \n\n\n\n§ CONGRUENCE RELATIONS BETWEEN SELMER GROUPS\n\nWe recall some results of Greenberg and Vatsal <cit.>, and apply these results to study the structure of Selmer groups of ordinary Galois representations. Let g be a Hecke newform of weight 2 on Γ_0(N_g). Here, N_g is the level of g. Assume that the following conditions are satisfied\n \n\n  * p∤ N_g,\n\n  * g is ordinary at p,\n\n  * ρ̅:=ρ̅_g is absolutely irreducible,\n\n  * g has optimal level, i.e., N_g is the prime to p part of the Artin conductor of ρ̅. \n\nLet f be a Hecke new cuspform of weight 2 on such that ρ̅_f≃ρ̅_g. The understanding here is that the field F is chosen so that all the Fourier coefficients of both f and g are contained in F. Remark <ref> establishes that one may choose any large field F when studying the λ-invariant vanishing of the μ-invariant. Let N_f be the level of f. We assume that p∤ N_f. Note that by Theorem <ref>, N_f∈𝒮(ρ̅). We note that N_g divides N_f. We note that f has ordinary reduction at p (cf. <cit.>). Let ϵ_f be the nebentype of f, and ϵ̅_f:Gal(/)→κ^× its mod-ϖ reduction. We find that detρ̅_g=χ̅, and detρ̅_g=χ̅ϵ̅_f where χ̅ is the mod-p cyclotomic character. Since ρ̅_f≃ρ̅_g, we find that ϵ̅_f=1. The principal units in ^× are the units that reduce to 1 modulo (ϖ). It is clear that if a principal unit is a root of unity, then it is equal to 1. Since ϵ_f is a finite order character, ϵ̅_f=1 implies that ϵ_f=1. Therefore, f is a weight 2 cuspform on Γ_0(N_f).\n\n\n   With respect to above notation, assume that μ_p(g)=0. Then, μ_p(f)=0, and \n    \n    λ_p(f)-λ_p(g)=∑_ℓ| N_f(σ_ℓ(g)-σ_ℓ(f)),\n where the sum ranges over the primes ℓ dividing N_f. \n\n\nWe study the numbers (σ_ℓ(g)-σ_ℓ(f)) for primes ℓ|N_f. Let A be a local -algebra, with maximal ideal 𝔪_A, and residue field A/𝔪_A isomorphic to κ. Fix an -algebra isomorphism φ_0: A/𝔪_A→κ. Let φ:A→κ be the map obtained upon composing the reduction modulo 𝔪_A map, with φ_0. We set \n    GL_2(A):={abcd∈GL_2(A)|φ(a)φ(b)φ(c)φ(d)=1001}.\n \nFor n≥ 1, the map φ:/ϖ^n→κ is the reduction modulo ϖ map.\n\nAssociated with g, let Π_g be the set of prime numbers ℓ such that the following conditions are satisfied:\n\n    \n  * ℓ∤ N_g p, \n    \n  * ℓ≢± 1p and ℓ^p-1≢1p^2,\n    \n  * ρ̅_g(σ_ℓ)=ℓ001 for a suitable choice of basis for the residual representation. \n\nLet Ω_g be the set of prime numbers such that \n\n    \n  * ℓ∤ N_g p, \n    \n  * ℓ≢± 1p,  \n  * ρ̅_g(σ_ℓ)=-ℓ00-1 for a suitable choice of basis for the residual representation. \n\n\n\nIn section <ref>, we shall introduce further assumptions on the image of ρ̅_g, so that the sets Π_g and Ω_g have positive density. For ℓ∈Π_g (resp. Ω_g), we note that ρ_g is unramified at ℓ. Since ρ̅_f≃ρ̅_g, we find that ρ̅_f is unramified at ℓ as well. Thus, ρ_f(I_ℓ) is contained in GL_2(), which is a pro-p group. Hence, ρ_f|ℓ factors through Gal(_ℓ^p-tr/_ℓ), where _ℓ^p-tr⊂_ℓ is the maximal tamely ramified extension of _ℓ with pro-p inertia. The Galois group Gal(_ℓ^p-tr/_ℓ) is generated by a frobenius σ_ℓ, and the pro-p tame inertia generator τ_ℓ, subject to the relation σ_ℓτ_ℓσ_ℓ^-1=τ_ℓ^ℓ (cf. for instance <cit.>).\n\n\n   Let ℓ∈Π_g be a prime such that ρ_f is ramified at ℓ. Then, up to conjugation by a matrix in GL_2(),\n    \n    ρ_f(σ_ℓ)=ℓ xx and ρ_f(τ_ℓ)=1y1,\n where x≡ 1ϖ and y≡ 0ϖ.\n\n\n\nWe choose an integral basis for T_f so that ρ̅_f(σ_ℓ)=ℓ001. We show that there is a matrix A∈GL_2() so that ρ:=A ρ_f A^-1 satisfies the above conditions. In fact, the matrix A can be chosen to be in GL_2(). \n\n    For ease of notation, we set ρ':=ρ_f and ρ'_n denote the ϖ^n reduction of ρ'. We shall inductively specify matrices A_n ∈GL_2(/ϖ^n) such that A_m≡ A_n ϖ^n for all integers m>n. We shall then let A denote the matrix (A_n) in the inverse limit \n    \n    GL_2()=_n GL_2(/ϖ^n).\n Let us set ρ_n:=A_n ρ_n' A_n^-1. The matrices A_n shall have the property that there exist x_n, y_n, z_n∈/ϖ^n such that ρ_n(σ_ℓ)=ℓ x_nz_n and ρ_n(τ_ℓ)=1y_n1, where x_n, z_n≡ 1ϖ and y_n≡ 0ϖ. Since A_m ≡ A_n ϖ^n for all m>n, it shall then follow that x_m≡ x_nϖ^n, y_m≡ y_nϖ^n and z_m≡ z_nϖ^n. Setting x,y,z to denote the inverse limits (x_n), (y_n) and (z_n) respectively, we find that \n    \n    ρ(σ_ℓ)=ℓ xz and ρ(τ_ℓ)=1y1.\n The relation σ_ℓτ_ℓσ_ℓ^-1=τ_ℓ^ℓ then implies that x=z. \nSuppose that for some n≥ 1, \n\n    ρ_n(σ_ℓ)=ℓ x_nz_n and ρ(τ_ℓ)=1y_n1.\n\nIt suffices to lift A_n to A_n+1∈GL_2(/ϖ^n+1), so that \n\n    ρ_n+1(σ_ℓ)=ℓ x_n+1z_n+1 and ρ_n+1(τ_ℓ)=1y_n+11,\n\nwhere x_n+1, y_n+1, z_n+1 lift x_n, y_n and z_n respectively.\nLet B_n+1∈GL_2(/ϖ^n+1) be a lift of A_n, and set r_n+1:=B_n+1ρ_n+1 B_n+1^-1. Note that ρ_n=r_n+1ϖ^n. Therefore, we may write \n    r_n+1(σ_ℓ)=ℓx̃_nz̃_n+ϖ^nabcd;\n        r_n+1(τ_ℓ)=1y_n01+ϖ^nefgh.\n Let B:=(Id+ϖ^n a'b'c'd')∈GL_2(/ϖ^n+1), we set r_n+1':=B r_n+1 B^-1. Note that since ϖ^2n=0 in /ϖ^n+1, B^-1=(Id-ϖ^n a'b'c'd'). Let B':= a'b'c'd', write B:=Id+ϖ^n B'. Given a matrix M∈GL_2(/ϖ^n+1), we find that \n    \n    B M B^-1   =(Id+ϖ^nB')M (Id-ϖ^nB')\n       =M+ϖ^n[B', M],\nwhere [B',M]:=B'M-MB'. Note that ϖ^n [B', M] is determined by the reduction of M modulo ϖ. In particular, if M≡Idϖ, then, [B',M]=0, and B M B^-1=M. On the other hand, if M≡ℓ1ϖ, then, \n    \n    B MB^-1=M+ϖ^n(1-ℓ)b'(ℓ-1)c'.\n\n    From the above computations, we find that \n    \n    r_n+1'(σ_ℓ)=ℓx̃_nz̃_n+ϖ^nab+(1-ℓ)b'c+(ℓ-1)c'd;\n        r_n+1'(τ_ℓ)=1y_n01+ϖ^nefgh.\n\n    Since ℓ≢1p, we may choose B so that r_n+1'(σ_ℓ) is diagonal. In greater detail, b':=b/(ℓ-1) and c':=c/(1-ℓ), and set a'=0 and d'=0. Thus, we write \n    r_n+1'(σ_ℓ)=ℓ x_n+1z_n+1.\n\n    We find that \n    \n    r_n+1'(σ_ℓτ_ℓσ_ℓ^-1)=    ℓ x_n+1z_n+11+ϖ^n ey_n+ϖ^n fϖ^n g1+ϖ^n hℓ x_n+1z_n+1^-1, \n    \n       =    1+ϖ^n eℓ x_n+1z_n+1^-1(y_n+ϖ^n f)ϖ^n ℓ^-1x_n+1z_n+1^-1g1+ϖ^n h,\n    \n       =    1+ϖ^n eℓ x_n+1z_n+1^-1y_n+ϖ^n ℓ fϖ^n ℓ^-1g1+ϖ^n h,\n    \n       r_n+1'(τ_ℓ)^ℓ=   1+ϖ^n ℓ eℓy_n+ϖ^n ℓ fϖ^n ℓ g1+ϖ^n ℓ h.\n\n   Since ℓ≢± 1p, we find that e=g=h=0. Hence, we find that \n    r_n+1'(σ_ℓ)=ℓ x_n+1z_n+1;\n        r_n+1'(τ_ℓ)=1y_n+11.\n\n    We set A_n+1:=B B_n+1, we note that A_n≡ B_n+1ϖ^n, and B≡Idϖ^n. With respect to this choice, ρ_n+1=r_n+1', and A_n=A_n+1ϖ^n. This completes the inductive lifting argument. By previous remarks in the proof, this is enough to establish the result. \n\n\n\nLet ℓ∤ N_gp be a prime that divides N_f. Then, the following assertions hold.\n    \n        \n  *  If ℓ∈Π_g, then, σ_ℓ(g)=1 and σ_ℓ(f)=0.\n        \n  *  If ℓ∈Ω_g, then, σ_ℓ(g)=0 and σ_ℓ(f)=0.\n     \n\n\n\n    We begin by proving part (<ref>). Since ρ_g is unramified at ℓ, we find that V'_g=V_g. Since ρ̅_g(σ_ℓ)=ℓ1, it follows that P_ℓ(g;X)=(1-X)(1-ℓ X). Since ℓ≢1p, it follows that ℓ^-1 is a root of P_ℓ(g;X) with multiplicity 1. Therefore, d_ℓ(g)=1. On the other hand, it follows from Lemma <ref> that V_f' is the trivial G_ℓ-module, we find that P_ℓ(f;X)=1-X, and ℓ^-1 is not a root of P_ℓ(f;X). Therefore, d_ℓ(f)=0. Since ℓ^p-1≢1p^2, it follows that that s_ℓ=1. Since σ_ℓ(·)=s_ℓ d_ℓ(·), we find that σ_ℓ(g)=1 and σ_ℓ(f)=0. The second assertion can be argued in the same way. \n\n\nLet Q={q_1, …, q_n} be a set of primes contained in Π_g and Q'={ℓ_1, …, ℓ_r}. For (n, r)∈_≥ 0^2, we set T(n, r) be the collection of all sets Σ=Q∪ Q', where Q={q_1, …, q_n} (resp. Q'={ℓ_1, …, ℓ_r}) is a subset of Π_g (resp. Ω_g). The understanding is that when n=0 (resp. r=0), the set Q (resp. Q') is empty. When we write Σ={q_1, …, q_n, ℓ_1, …, ℓ_r}, we shall implicitly mean that {q_1, …, q_n} is contained in Π_g and {ℓ_1, …, ℓ_r} is contained in Ω_g.\n\n\n    For Σ∈T(n, r), set N_Σ:=∏_i=1^n q_i×∏_j=1^r ℓ_j. Let (Σ) be the set of newforms f of weight 2 such that \n    \n        \n  * ρ̅_f≃ρ̅_g, \n        \n  * N_f=N_g N_Σ.\n    \n\n\n\n    Let g be a Hecke newform of optimal weight k=2 and optimal level. Then, for (n, r) such that n>0 or r>0, and Σ∈T(n, r), the set (Σ) is nonempty.\n\n\n\n    The result is a direct consequence of Theorem <ref>.\n\n\n\n    Let f∈(Σ), and let ℓ≠ p be a prime which divides N_g. Then, σ_ℓ(f)=σ_ℓ(g).\n\n\n    It suffices for us to show that d_ℓ(f)=d_ℓ(g). Let h∈{g,f}, recall that V_h':=(V_h)_I_ℓ. Note that as a modules over the inertia group I_ℓ, V_h and A_h[ϖ] are self dual. Since ord_ℓ(N_f)=ord_ℓ(N_g), and N_g is the prime to p part of the Artin-conductor of ρ̅, it follows that \n    dim A_h[ϖ]_I_ℓ=dim (V_h)_I_ℓ,\n(cf. <cit.>). Recall that P_ℓ(h;X):=det(Id-σ_ℓ X| V_h') and that P_ℓ(h;X) is the mod-ϖ reduction of P_ℓ(h;X). Set T_h':=(T_h)_I_ℓ. We identify A_h[ϖ] with T_h/ϖ T_h, and thus A_h[ϖ]_I_ℓ with T_h'/ϖ T_h'. The equality (<ref>) implies that T_h' is torsion free. We identify T_h'⊗_ K with V_h', and since T_h' is torsion free, we find that T_h' is an -lattice in V_h', and that P_ℓ(h;X)=det(Id-σ_ℓ X| T_h'). Therefore, the mod-ϖ reduction of P_ℓ(h;X) is given by \n    P_ℓ(h;X) =   det(Id-σ_ℓ X|(T_h'/ϖ T_h')),\n    \n        =   det(Id-σ_ℓ X| A_h[ϖ]_I_ℓ),\n\nSince A_g[ϖ]≃ A_f[ϖ] as G_ℓ-modules, we find that A_g[ϖ]_I_ℓ≃ A_f[ϖ]_I_ℓ as G_ℓ/I_ℓ-modules. It thus follows that P_ℓ(f;X)=P_ℓ(g;X), from which we deduce that d_ℓ(f)=d_ℓ(g). \n\n\n\n Let g be a Hecke newform of optimal level N_g, trivial nebentype and weight 2. Assume that the following conditions are satisfied\n \n\n  * ρ̅_g is absolutely irreducible,\n\n  * g is p-ordinary and p∤ N_g,\n\n  * g has optimal level,\n\n  * μ_p(g)=0.\n\n   Let Σ∈𝔗(n, r) and f∈(Σ). Then, the following assertions hold\n   \n       \n  * f has good ordinary reduction at p,\n       \n  * μ_p(f)=0,\n       \n  * λ_p(f)=λ_p(g)+n.\n   \n\n\n    As noted earlier, that f has ordinary reduction at p follows from <cit.>. From Theorem <ref>, we find that μ_p(f)=0 and \n    \n    λ_p(f)=λ_p(g)+∑_i=1^n (σ_q_i(g)-σ_q_i(f))+∑_j=1^r (σ_ℓ_j(g)-σ_ℓ_j(f))+∑_ℓ|N_g(σ_ℓ(g)-σ_ℓ(f)).\n\n    For ℓ|N_g, it follows from Lemma <ref> that \n    \n    ∑_ℓ|N_g(σ_ℓ(g)-σ_ℓ(f))=0.\n\n    It follows from (<ref>) of Lemma <ref> that \n    \n    (σ_q_i(g)-σ_q_i(f))=1\n and it follows from (<ref>) of Lemma <ref> that \n    \n    (σ_ℓ_j(g)-σ_ℓ_j(f))=0.\n\n    It therefore follows that \n    \n    λ_p(f)=λ_p(g)+n.\n\n\n\n\n\n\n\n§ CONSTRUCTING GALOIS REPRESENTATIONS WITH PRESCRIBED Λ-INVARIANT\n\nThroughout this section, p≥ 5. We introduce our assumptions. Let g be a normalized newform of weight 2 on Γ_0(N_g). Throughout this section, we assume the following conditions.\n\n \n\n  * The residue field κ=/ϖ is _p, i.e., f(𝔭/p)=1 where 𝔭 is the prime above p prescribed by ι_p.  \n\n  * The Galois representation\nρ̅_g:Gal(/)→GL_2(_p) is surjective.\n\n  * The modular form g is p-ordinary and p∤ N_g,\n\n  * g has optimal level,\n\n  * μ_p(g)=0.\n\n\nWe show that the sets Π_g and Ω_g both have positive density. Furthermore, we estimate these densities. We let Y (resp. Y') be the subset of GL_2(_p) consisting of semisimple matrices conjugate to a1 (resp. a-1), where a≠± 1. It is easy to see that \n\n    # Y =# Y'= (p-3)#GL_2(_p)/#T(_p),\n where T denotes the diagonal torus. Therefore, we find that \n\n    # Y /#GL_2(_p)=# Y'/#GL_2(_p)=(p-3)/(p-1)^2.\n\nLet ρ̅ denote the residual representation ρ̅_g, and let (ρ̅) be the Galois extension of  which is the fixed field of the kernel of ρ̅. We refer to (ρ̅) as the field cut out by ρ̅. We set G to denote the Galois group Gal((ρ̅)/). The residual representation induces an isomorphism Φ: GGL_2(_p). Let Z (resp. Z') denote Φ^-1(Y) (resp. Φ^-1(Y')). It follows from (<ref>) that \n\n    # Z /# G=# Z'/# G=(p-3)/(p-1)^2.\n\n\n\n    Let ℓ∤ N_g p be a prime. The following assertions hold\n    \n        \n  * σ_ℓ∈ Z if and only if ρ̅(σ_ℓ)=ℓ1 up to conjugation and ℓ≢± 1p;\n         \n  * σ_ℓ∈ Z' if and only if ρ̅(σ_ℓ)=-ℓ-1 up to conjugation and ℓ≢± 1p.\n    \n\n\n    Suppose that σ_ℓ∈ Z (resp. σ_ℓ∈ Z'). Then, since the weight of g is 2 and has trivial nebentype, we find that detρ̅(σ_ℓ)=ℓ. It follows that ρ̅(σ_ℓ)=ℓ1 (resp. ρ̅(σ_ℓ)=-ℓ-1) and ℓ≢± 1p.\n\n\n\n    Let ℓ∤ N_g p be a prime. Then, σ_ℓ∈ Z' if and only if ℓ∈Ω_g. As a consequence, it follows that Ω_g has positive density equal to (p-3)/(p-1)^2.\n\n\n    We find that σ_ℓ∈ Z' if and only if ρ̅(σ_ℓ)=ℓ-1 up to conjugation and ℓ≢± 1p. In other words, σ_ℓ∈ Z' if and only if ℓ∈Ω_g. By the Chebotarev density theorem, Ω_g has positive density equal to # Z'/# G=(p-3)/(p-1)^2.\n\n\nRecall that _1 is the /p-extension of  contained in _cyc. Let / be the compositum (ρ̅)·_1. \n\n    The extensions (ρ̅) and _1 are linearly disjoint. \n\n\n    Let E:=(ρ̅)∩_1 and N:=Gal((ρ̅)/E). Note that N is a normal subgroup of G≃GL_2(_p) and that [G:N] divides p. For p≥ 5, the group PSL_2(_p) is simple. It is easy to see that GL_2(_p) does not contain an index p normal subgroup. Therefore, N=G and thus, (ρ̅) and _1 are linearly disjoint.\n\n\nLet Γ_1:=Gal(_1/) and we find that Gal(/)≃ G×Γ_1. Let W be the product Z× (Γ_1\\{0}). \n\n\n    Let ℓ∤ N_gp be a prime. Then, σ_ℓ∈ W if and only if ℓ∈Π_g. As a result, Π_g has density equal to (p-3)/p(p-1).\n\n\n    Note that the prime ℓ in nonsplit in _1 if and only if ℓ^p-1≢1p^2. The result is therefore a direct consequence of Lemma <ref>. By the Chebotarev density theorem, Π_g has density equal to\n    \n    #Z× (#Γ_1-1)/#G ×#Γ_1=(p-3)/p(p-1).\n\n\n\n\n    The Theorem is a direct consequence of Proposition <ref>, Proposition <ref> and Theorem <ref>.\n\n\n\n     Let p≥ 5 be a prime and let g be a normalized newform of weight 2 on Γ_0(N_g) satisfying all of the conditions of Theorem <ref>. Furthermore, assume that λ_p(g)≤ 1. Then, for any set of primes {ℓ_1, …, ℓ_r}⊂Ω_g, there is a Hecke newform of weight 2 of level N_f=N_gℓ_1…ℓ_r such that \n     \n    \n  * f has good ordinary reduction at p, \n    \n  * ρ̅_g≃ρ̅_f, \n    \n  * μ_p(f)=0, \n    \n  * rank^BK(f)=λ_p(g).\n\n\n\n\n    It follows from Theorem <ref> that there exists f satisfying the first three assertions, and such that λ_p(f)=λ_p(g). Proposition <ref> implies that \n    \n    rank^BK(f)=λ_p(f)=λ_p(g).\n This proves the last assertion.\n\n\n\n\n\n\n    It suffices to show that there is a non-CM Hecke newform g of weight 2 on Γ_0(N_g) and a density 1 set of primes Σ such that for all p∈Σ,\n    \n        \n  * p≥ 5, \n        \n  * The residue field κ=/ϖ is _p, i.e., f(𝔭/p)=1. \n\n  * The Galois representation\nρ̅_g:Gal(/)→GL_2(_p) is surjective.\n\n  * The modular form g is p-ordinary and p∤ N_g,\n\n  * g has optimal level, i.e., N_g is the prime to p part of the Artin conductor of the residual representation,\n\n  * μ_p(g)=0 and λ_p(g)=0.\n    \nIt then follows from Theorem <ref> that for p∈Σ, there are infinitely many Hecke newforms of weight 2 such that \n \n    \n  * f has good ordinary reduction at p, \n    \n  * ρ̅_f is surjective, \n    \n  * μ_p(f)=0, \n    \n  * λ_p(f)=n.\n\nLet E_/ be any non-CM elliptic curve with Mordell-Weil rank 0, and let g be the associated Hecke newform. Consider the following observations.\n\n    \n  * The field of Fourier coefficients of g is , since it is associated to an elliptic curve over . In particular, it follows that the residue field κ is isomorphic to _p for all primes p.\n    \n  * The set of primes at which E has good ordinary reduction has density 1, by a result of Serre <cit.>.\n    \n  * Serre's open image theorem <cit.> shows that for all but finitely many primes p, the residual representation ρ̅_g:Gal(/)→GL_2(_p) is surjective. \n    \n  * If at a given prime p, N_g is not optimal, then there must be a p-congruence between g and a newform h of weight 2 and strictly smaller level. This follows from Ribet's level lowering theorem. There are only finitely many newforms of weight 2 with level strictly less than N_g. Also, there are only finitely many primes p for which two newforms are p-congruent. Therefore, for all but finitely many primes p, the level N_g is optimal. \n    \n  * Finally, it follows from a theorem of Greenberg <cit.> that for a density 1 set of primes p, μ_p(g)=λ_p(g)=0. \n    Therefore, there is a set of primes Σ of density 1 such that the above conditions are satisfied. This completes the proof.\n\n\n\nalpha\n\n"}