{"entry_id": "http://arxiv.org/abs/2303.06705v1", "published": "20230312165408", "title": "Retinexformer: One-stage Retinex-based Transformer for Low-light Image Enhancement", "authors": ["Yuanhao Cai", "Hao Bian", "Jing Lin", "Haoqian Wang", "Radu Timofte", "Yulun Zhang"], "primary_category": "cs.CV", "categories": ["cs.CV"], "text": "\n\n\n\n\n\n\nRetinexformer: One-stage Retinex-based \n Transformer for  Low-light Image Enhancement\n    \n\tYuanhao Cai ^1,2, Hao Bian ^1,2,, Jing Lin ^1,2, \n Haoqian Wang ^1,2,, Radu Timofte ^3,4, Yulun Zhang ^4\n\n\t^1 Shenzhen International Graduate School, Tsinghua University, \n ^2  Shenzhen Institute of Future Media Technology, ^3 University of Würzburg, ^4 ETH Zürich\n\n    March 30, 2023\n===============================================================================================================================================================================================================================================================================\n\n\nempty\n\n\n\n\n\n\nWhen enhancing low-light images, many deep learning algorithms are based on the Retinex theory. However, the Retinex model does not consider the corruptions hidden in the dark or introduced by the light-up process. Besides, these methods usually require a tedious multi-stage training pipeline and rely on convolutional neural networks, showing limitations in capturing long-range dependencies. In this paper, we formulate a simple yet principled One-stage Retinex-based Framework (ORF). ORF first estimates the illumination information to light up the low-light image and then restores the corruption to produce the enhanced image. We design an Illumination-Guided Transformer (IGT) that utilizes illumination representations to direct the modeling of non-local interactions of regions with different lighting conditions. By plugging IGT into ORF, we obtain our algorithm, Retinexformer. Comprehensive quantitative and qualitative experiments demonstrate that our Retinexformer significantly outperforms state-of-the-art methods on seven benchmarks. The user study and application on low-light object detection also reveal the latent practical values of our method. Codes and pre-trained models will be released.\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nLow-light image enhancement is an important yet challenging task in computer vision. It aims to improve the poor visibility and low contrast of low-light images and restore the corruptions (e.g., noise, artifact, color distortion, etc.) hidden in the dark or introduced by the light-up process. These issues challenge not only human visual perception but also other vision tasks like nighttime object detection.\n\n\n\nHence, a large number of algorithms have been proposed for low-light image enhancement. \nPlain methods like histogram equalization and gamma correction tend to produce undesired artifacts because they barely consider the  illumination factors. Traditional cognition methods rely on the Retinex theory <cit.> that assumes the color image can be decomposed into two components, i.e., reflectance  and illumination. Different from plain methods, traditional methods  focus on illumination estimation but usually introduce severe noise or distort color locally because these methods assume that the images are noise- and color distortion-free. This is inconsistent with real under-exposed scenes. \n\nWith the development of deep learning, convolutional neural networks (CNNs) have been applied in low-light image enhancement. These CNN-based methods are mainly divided into two categories. The first category directly employs a CNN to learn a brute-force mapping function from the low-light image to its normal-light counterpart, thereby ignoring human color perception. This kind of methods lack interpretability and theoretically proven properties. The second category is inspired by the Retinex theory. These methods <cit.> usually suffer from a multi-stage training pipeline. They employ different CNNs to decompose the color image, denoise the reflectance, and adjust the illumination, respectively. These CNNs are first trained independently and then connected together to be finetuned end-to-end. The training process is tedious and time-consuming. \n\n\n\nIn addition, these CNN-based methods show limitations in capturing long-range dependencies and non-local self-similarity, which are critical for image restoration. The recently rising deep learning model, Transformer, may provide a possibility to address this drawback of CNN-based methods. However, directly applying original vision Transformers for low-light image enhancement may encounter an issue. The computational complexity is quadratic to the input spatial size. This  computational cost may be unaffordable. \nDue to this limitation, some CNN-Transformer hybrid algorithms like SNR-Net <cit.> only employ a single global Transformer layer at the lowest spatial resolution of a U-shaped CNN. Thus, the potential of Transformer for low-light image enhancement still remains under-explored. \n\nTo cope with the above problems, we propose a novel method,  Retinexformer, for low-light image enhancement. Firstly, we formulate a simple yet principled One-stage Retinex-based Framework (ORF). We revise the original Retinex model  by introducing perturbation terms to the reflectance and illumination for modeling the corruptions. Our ORF estimates the illumination information and uses it to light up the low-light images. Then ORF employs a corruption restorer to suppress noise, artifacts, under-/over-exposure, and color distortion. Different from  previous Retinex-based deep learning frameworks that suffer from a tedious multi-stage training pipeline, our ORF is trained end-to-end in a one-stage manner. Secondly, we propose an Illumination-Guided Transformer (IGT) to model the long-range dependencies. The key component of IGT is Illumination-Guided Multi-head Self-Attention (IG-MSA). IG-MSA  exploits the illumination representations to direct the computation of self-attention and enhance the interactions between regions of  different exposure levels. Finally, we plug IGT into ORF as the corruption restorer to derive our method, Retinexformer. As shown in Fig. <ref>, our Retinexformer surpasses state-of-the-art (SOTA) Retinex-based deep learning methods by large margins on various datasets. Especially on SID <cit.>, SDSD <cit.>-indoor, and LOL-v2 <cit.>-synthetic, the improvements are over 6 dB.\n\nOur contributions can be summarized as follows:\n\n\t\n\n\t\n  * We propose a novel Transformer-based algorithm, Retinexformer, for  low-light image enhancement. \n\t\n\n\t\n  * We formulate a one-stage Retinex-based low-light enhancement framework, ORF, that enjoys an easy one-stage training process and models the corruptions well.\n\t\n\n\t\n  * We design a new self-attention mechanism, IG-MSA, that utilizes the illumination information as a key clue to guide the modeling of long-range dependences.\n\t\n\n\t\n  * Quantitative and qualitative experiments show that our Retinexformer outperforms SOTA algorithms on seven datasets. The results of user study and low-light detection also suggest the practical values of our method.\n\n\n\n\n\n\n\n§ RELATED WORK\n\t\n\n\n\n\n\n §.§ Low-light Image Enhancement\n\n\n\n\n\nPlain Methods. Plain methods like histogram equalization <cit.> and Gama Correction (GC) <cit.> directly amplify the low visibility and contrast of under-exposed images. Yet, these methods barely consider the illumination factors, making the enhanced images perceptually inconsistent with the real normal-light scenes.\n\n\n\nTraditional Cognition Methods. Different from plain algorithms, conventional  methods <cit.> bear the illumination factors into consideration. They rely on the Retinex theory and treat the reflectance component of the low-light image as a plausible solution of the enhanced result. For example, Guo et al. <cit.> propose to refine the initial estimated illumination map by imposing a structure prior on it. Wang et al. <cit.> design an algorithm NPE to preserve the naturalness of details during the enhancement of non-uniform illumination images. However, these methods naively assume that the low-light images are corruption-free, leading to severe noise and color distortion issues during the enhancement process. Besides, these methods rely on hand-crafted priors, usually requiring careful parameter tweaking and suffering from poor generalization ability.\n\n\n\n\n\nDeep Learning Methods. With the rapid progress of deep learning, CNN <cit.> has been widely used in low-light image enhancement. For instance, Lore et al. <cit.> propose a stacked sparse denoising auto-encoder LLNet for joint low-light enhancement and noise suppression. Wei et al. <cit.> and follow-up works <cit.> combine the Retinex decomposition with deep learning. However, these methods usually suffer from a tedious multi-stage training pipeline. Several CNNs are employed to learn or adjust different components of the Retinex model, respectively. Wang et al. <cit.> propose a one-stage Retinex-based  CNN, dubbed DeepUPE, to directly predict the illumination map. Nonetheless, DeepUPE does not consider the corruption factors, leading to amplified noise and color distortion when lighting up  under-exposed photos. In addition, these CNN-based methods also show limitations in capturing long-range dependencies.\n\n\n\n\n\n §.§ Vision Transformer\n\n\n\nThe natural language processing model, Transformer, is proposed in  <cit.> for machine translation. In recent years, Transformer and its variants have been applied in many computer vision tasks and achieved impressive results in high-level vision (e.g., image classification <cit.>, semantic segmentation <cit.>, object detection <cit.>, etc.) and low-level vision (e.g., image restoration <cit.>, image synthesis <cit.>, etc.). For example, \nXu et al. <cit.> propose an SNR-aware CNN-Transformer hybrid network, SNR-Net, for low-light image enhancement. However, SNR-Net only employs a single  global Transformer layer at the lowest resolution of a U-shaped CNN due to the enormous computational costs of the vanilla global Transformer. The potential of Transformer has not been fully explored for low-light image enhancement.\n\n\n\n\n\n§ METHOD\n\n\n\nFig. <ref> illustrates the overall architecture of our method. As shown in Fig. <ref> (a), our Retinexformer is based on our formulated One-stage Retinex-based Framework (ORF). ORF consists of an illumination estimator (i) and a corruption restorer (ii). We design an Illumination-Guided Transformer (IGT) to play the role of the corruption restorer. As depicted in Fig. <ref> (b), the basic unit of IGT is Illumination-Guided Attention Block (IGAB), which is composed of two layer normalization (LN), an Illumination-Guided Multi-head Self-Attention (IG-MSA) module, and a feed-forward network (FFN). Fig. <ref> (c) shows the details of IG-MSA.\n\n\n\n\n\n §.§ One-stage Retinex-based Framework\n\n\n\n\nAccording to  the Retinex theory. A low-light image 𝐈∈ℝ^H× W× 3 can be decomposed into a reflectance image  𝐑∈ℝ^H× W× 3 and an illumination map  𝐋∈ℝ^H× W as\n\n\n\n    𝐈 = 𝐑⊙𝐋,\n\nwhere ⊙ denotes the element-wise multiplication. This Retinex model assumes 𝐈 is corruption-free, which is inconsistent with the real under-exposed scenes. We analyze that the corruptions mainly steam from two factors. Firstly, the high-ISO and long-exposure imaging settings of dark scenes inevitably introduce noise and artifacts. Secondly, the light-up process may amplify the noise and artifacts and also cause under-/over-exposure  and color distortion, as illustrated in the zoomed-in patch  i and ii of Fig. <ref> (a).\n\nTo model the corruptions, we reformulate Eq. (<ref>) by introducing a perturbation term for 𝐑 and 𝐋 respectively, as\n\n\n\n    𝐈   = (𝐑 + 𝐑̂) ⊙ (𝐋 + 𝐋̂) \n       = 𝐑⊙𝐋 + 𝐑⊙𝐋̂ + 𝐑̂⊙ (𝐋 + 𝐋̂),\n\nwhere 𝐑̂∈ℝ^H× W× 3 and 𝐋̂∈ℝ^H× W denote the perturbations. Similar to <cit.>, we regard 𝐑 as a well-exposed image. To light up 𝐈, we element-wisely multiply the two sides of Eq. (<ref>) by a light-up map 𝐋̅ such that 𝐋̅⊙𝐋 = 1 as\n\n\n\n    𝐈⊙𝐋̅ = 𝐑 + 𝐑⊙ (𝐋̂⊙𝐋̅) + (𝐑̂⊙ (𝐋 + 𝐋̂)) ⊙𝐋̅,\n\nwhere 𝐑̂⊙ (𝐋 + 𝐋̂) represents the noise and artifacts hidden in the dark scenes and are amplified by 𝐋̅. 𝐑⊙ (𝐋̂⊙𝐋̅) indicates the under-/over-exposure and color distortion caused by the light-up process. We simplify Eq. (<ref>) as\n\n\n\n    𝐈_lu= 𝐈⊙𝐋̅ = 𝐑 + 𝐂,\n\nwhere 𝐈_lu∈ℝ^H× W× 3 represents the lit-up image and 𝐂∈ℝ^H× W× 3 indicates the overall corruption term. Subsequently, we formulate our ORF as\n\n\n\n    (𝐈_lu, 𝐅_lu) = ℰ(𝐈, 𝐋_p),     𝐈_en = ℛ(𝐈_lu, 𝐅_lu),\n\nwhere ℰ denotes the illumination estimator and ℛ represents the corruption restorer. ℰ takes 𝐈 and its  illumination prior map 𝐋_p ∈ℝ^H× W as inputs. 𝐋_p= mean_c(𝐈) where mean_c indicates  the operation that calculates the mean values for each pixel along the channel dimension. ℰ outputs the lit-up image 𝐈_lu and light-up feature 𝐅_lu∈ℝ^H× W× C. Then 𝐈_lu and 𝐅_lu are  fed into ℛ to restore the corruptions and produce the enhanced image 𝐈_en∈ℝ^H× W× 3.\n\nThe architecture of ℰ is shown in Fig. <ref> (a) (i).  ℰ firstly uses a conv1×1 (convolution with kernel size = 1) to fuse the concatenation of 𝐈 and 𝐋_p. We notice that the well-exposed regions can provide semantic contextual information for under-exposed regions. Thus, a depth-wise separable conv9×9 is adopted to model the interactions of regions with different lighting conditions to generate the light-up feature  𝐅_lu.  Then ℰ uses a conv1×1 to aggregate 𝐅_lu to produce the light-up map 𝐋̅∈ℝ^H× W× 3. We set 𝐋̅ as a three-channel RGB tensor instead of a single-channel one like  <cit.> to improve its representation capacity in simulating the nonlinearity across RGB channels for color enhancement. Then 𝐋̅ is used to light up  𝐈 in Eq. (<ref>). \n\n\n\n\nDiscussion. (i) Different from previous Retinex-based deep learning methods <cit.>, our ORF estimates 𝐋̅ instead of the illumination map 𝐋 because if ORF estimates 𝐋, then the lit-up image will be obtained by an element-wise division (𝐈 ./ 𝐋). Computers are vulnerable to this operation. The values of tensors can be very small (sometimes even equal to 0). The division may easily cause the data overflow issue. Besides, small  errors randomly generated by the computer will be amplified by this operation and lead to inaccurate estimation. Hence, modeling 𝐋̅ is more robust.\n\n(ii) Previous Retinex-based deep learning methods mainly focus on suppressing the corruptions like noise on the reflectance image, i.e., 𝐑̂ in Eq. (<ref>). They overlook the estimation error on the illumination map, i.e., 𝐋̂ in Eq. (<ref>), thus easily leading to under-/over-exposure and color distortion during the light up process. In contrast, our ORF considers all these corruptions and employs ℛ to restore them all.\n\n\n\n\n\n §.§ Illumination-Guided Transformer\n\n\n\nPrevious deep learning methods mainly rely on CNNs, showing limitations in capturing long-range dependencies. Some CNN-Transformer hybrid works like SNR-Net <cit.> only employ a global Transformer layer at the lowest resolution of a U-shaped CNN due to the enormous computational complexity of global multi-head self-attention (MSA). The potential of Transformer has not been fully explored. To fill this gap, we design an Illumination-Guided Transformer (IGT) to play the role of the corruption restorer ℛ in Eq. (<ref>).\n\n\n\nNetwork Structure. As illustrated in Fig. <ref> (a) (ii), IGT adopts a three-scale U-shaped architecture <cit.>. The input of IGT is the lit-up image 𝐈_lu. In the downsampling branch, 𝐈_lu  undergoes a conv3×3, an IGAB, a strided conv4×4 (for downscaling the features), two IGABs, and a strided conv4×4 to generate hierarchical features 𝐅_i∈ℝ^H/2^i×W/2^i× 2^iC where i = 0, 1, 2. Then 𝐅_2 passes through two IGABs. Subsequently, a symmetrical structure is designed as the upsampling branch. The deconv2×2 with stride = 2 is exploited to upscale the features. Skip connections are used to alleviate the information loss caused by the downsampling branch. The upsampling branch outputs a residual image 𝐈_re∈ℝ^H× W× 3. Then the enhanced image 𝐈_en is derived by the sum of 𝐈_lu and 𝐈_re, i.e., 𝐈_en = 𝐈_lu + 𝐈_re.\n\n\n\nIG-MSA. As illustrated in Fig. <ref> (c), the light-up feature 𝐅_lu∈ℝ^H× W× C estimated by ℰ is fed into each IG-MSA of IGT. Please note that Fig. <ref> (c) depicts IG-MSA for the largest scale. For smaller scales, conv4×4 layers with stride = 2  are used to downscale 𝐅_lu to match the spatial size, which is omitted in this figure. As aforementioned, the non-trivial computational cost of global MSA limits the application of Transformer in low-light image enhancement. To tackle this issue, IG-MSA treats a single-channel feature map as a token and then  computes the self-attention.\n\n\n\nFirstly, the input feature 𝐅_in∈ℝ^H× W× C is reshaped into tokens 𝐗∈ℝ^HW× C. Then 𝐗 is split into k heads:\n\n\n\n    𝐗 = [𝐗_1, 𝐗_2, ⋯, 𝐗_k],\n\nwhere 𝐗_i ∈ℝ^HW× d_k, d_k = C/k, and i = 1, 2, ⋯, k. Note that Fig. <ref> (c) shows the situation with k = 1 and omits some details for simplification. For each head_i, three fully connected (fc) layers without bias are used to linearly project 𝐗_i into query elements 𝐐_i∈ℝ^HW × d_k, key elements 𝐊_i ∈ℝ^HW × d_k, and value elements 𝐕_i ∈ℝ^HW × d_k as \n\n\n\n    𝐐_i = 𝐗_i𝐖_𝐐_i^T,  𝐊_i = 𝐗_i𝐖_𝐊_i^T,  𝐕_i = 𝐗_i𝐖_𝐕_i^T,\n\nwhere 𝐖_𝐐_i, 𝐖_𝐊_i, and 𝐖_𝐕_i∈ℝ^d_k × d_k represent the learnable parameters of the fc layers and T denotes the matrix transpose. We notice that different regions of the same image may have different lighting conditions. Dark regions usually have severer corruptions and are more difficult to restore. Regions with better lighting conditions can provide semantic contextual representations to help enhance the dark regions. Thus, we use the light-up feature 𝐅_lu encoding illumination information and interactions of regions with different lighting conditions to direct the computation of self-attention. To align with the shape of  𝐗, we also reshape 𝐅_lu into 𝐘∈ℝ^HW× C and split it into k heads:\n\n\n\n    𝐘 = [𝐘_1, 𝐘_2, ⋯, 𝐘_k],\n\nwhere 𝐘_i ∈ℝ^HW× d_k, i = 1, 2, ⋯, k. Then the self-attention for each head_i is formulated as \n\n\n\n    Attention(𝐐_i, 𝐊_i, 𝐕_i, 𝐘_i) = (𝐘_i ⊙𝐕_i)softmax(𝐊_i^T𝐐_i/α_i),\n\nwhere α_i ∈ℝ^1 is a learnable parameter that adaptively scales the matrix multiplication. Subsequently, k heads are concatenated to pass through an fc layer and then plus a positional encoding 𝐏∈ℝ^HW× C (learnable parameters) to produce the output tokens 𝐗_out∈ℝ^HW× C. Finally, we reshape 𝐗_out to derive the output feature 𝐅_out∈ℝ^H× W× C.\n\n\n\nComplexity Analysis. We analyze that the computational complexity of our IG-MSA mainly comes from the k computations of the two matrix multiplication in Eq. (<ref>), i.e., ℝ^d_k× HW×ℝ^HW× d_k and ℝ^HW× d_k×ℝ^d_k × d_k. Therefore, the complexity 𝒪(IG-MSA) can be formulated as \n\n\n\n    𝒪(IG-MSA)    = k·[d_k·(d_k· HW) + HW·(d_k· d_k)], \n       = 2HWkd_k^2 = 2HWk(C/k)^2 = 2HWC^2/k.\n\nWhile the complexity of the global MSA (G-MSA) used by some previous CNN-Transformer methods like SNR-Net is\n\n\n\n    𝒪(G-MSA) = 2(HW)^2C.\n\nCompare Eq. (<ref>) with Eq. (<ref>). 𝒪(G-MSA) is quadratic to the input spatial size (HW). This burden is expensive and limits the application of Transformer for low-light image enhancement. Therefore, previous CNN-Transformer hybrid algorithms only employ a G-MSA layer at the lowest spatial resolution of a U-shaped CNN to save the computational costs. In contrast, 𝒪(IG-MSA) is linear to the spatial size. This much lower computational complexity enables our IG-MSA to be plugged into each basic unit IGAB of the network. By this means, the potential of Transformer for low-light image enhancement can be further explored.\n\n\n\n\n\n§ EXPERIMENT\n\n\n\n §.§ Datasets and Implementation Details\n\nWe eveluate our method on LOL (v1 <cit.> and v2 <cit.>), SID <cit.>, SMID <cit.>, and SDSD <cit.> (indoor and outdoor). \n\n\n\n\nLOL. The LOL dataset has two versions: v1 and v2. LOL-v1 provides 485 low-/normal-light image pairs for training and 15 image pairs for testing. Each pair contains a low-light image and its corresponding well-exposed reference image. LOL-v2 is divided into two subsets, i.e., LOL-v2-real and LOL-v2-synthetic. The train set of LOL-v2-real includes 689 low-/normal-light image pairs and the test set contains 100 pairs. Most low-light images are captured from a variety of scenes by changing the ISO and exposure time, while other parameters are fixed. LOL-v2-synthetic is created by analyzing the illumination distribution of low-light images and then synthesizing from RAW images.\n\n\n\nSID. The subset of SID dataset captured by the Sony α7S II  camera is adopted for evaluation. There are 2697 short-/long-exposure RAW image pairs. The low-/normal-light RGB images are obtained by using the same in-camera signal processing of SID <cit.> to transfer the RAW images to RGB domain. 2099 low-/normal-light image pairs are used for training and 598 image pairs are selected for testing.\n\n\nSMID. The SMID benchmark collects 20809 short-/long-exposure RAW image pairs. We transfer the RAW data to low-/normal-light RGB image pairs. 15763 pairs are used for training and the left pairs are adopted for testing.\n\n\nSDSD. The static version of the SDSD dataset is adopted for evaluation. It is captured by a Canon EOS 6D Mark II camera with an ND filter. The SDSD dataset contains two subsets, i.e., SDSD-indoor and SDSD-outdoor. SDSD-indoor includes 62 low-/normal-light video pairs for training and 6 pairs for testing. SDSD-outdoor contains 116 low-/normal-light video pairs for training and 10 video pairs for testing.\n\n\nImplementation Details. We implement Retinexformer by PyTorch <cit.>. The model is trained with the Adam <cit.> optimizer (β_1 = 0.9 and β_2 = 0.999) for 2.5 × 10^5 iterations. The learning rate is initially set to 2× 10^-4 and then steadily decreased to 1× 10^-6 by the cosine annealing scheme <cit.> during the training process. Patches at the size of 128×128 are randomly cropped from the low-/normal-light image pairs as training samples. The batch size is 8. The training data is augmented with random rotation and flipping. The training objective is to minimize the mean absolute error (MAE) between the lit-up image and enhanced image. We adopt the peak signal-to-noise ratio (PSNR) and structural similarity (SSIM) <cit.> as the evaluation metrics.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Low-light Image Enhancement\n\n\nQuantitative Results. We compare our method with a wide range of SOTA enhancement algorithms. The PSNR and SSIM results are reported in Tab. <ref>. Our Retinexformer significantly outperforms SOTA methods on the seven datasets while requiring moderate computational and memory costs. \n\nWhen compared with the recent best method SNR-Net, our Retinexformer achieves 0.55, 1.32, 1.53, 1.57, 0.66, 0.33, and 1.18 dB improvements on LOL-v1, LOL-v2-real, LOL-v2-synthetic, SID, SMID, SDSD-indoor, and SDSD-outdoor datasets. However, our Retinexformer only costs 40% (1.61 / 4.01) Parmas and 59% (15.57 / 26.35) FLOPS.\n\nWhen compared with SOTA Retinex-based deep learning methods (including DeepUPE <cit.>, RetinexNet <cit.>, RUAS <cit.>, and KinD <cit.>), our Retinexformer yields 4.30, 4.43, 8.54, 6.00, 3.27, 6.60, and 6.00 dB improvements on the seven benchmarks. Especially on SID and SDSD datasets that are severely corrupted by noise and artifacts, the improvements are over 6 dB, as plotted in Fig. <ref>. \n\nWhen compared with SOTA Transformer-based image restoration algorithms (including IPT <cit.>, Uformer <cit.>, and Restormer <cit.>), our Retinexformer gains by 2.73, 2.86, 4.26, 2.17, 1.95, 3.66, and 2.29 dB on the seven datasets. Nonetheless, Retinexformer requires only 1.4% and 6.2% Params, 0.2% and 10.9% FLOPS of IPT and Restormer.\n\nAll these results clearly suggest the outstanding effectiveness and efficiency advantage of our Retinexformer.\n\n\n\nQualitative Results. The visual results of Retinexformer and SOTA  algorithms on the seven benchmarks  are shown in Fig. <ref>, <ref>, and <ref>. Please zoom in for a better view. Previous methods either cause color distortion like RUAS in Fig. <ref>, or contain over-/under-exposed regions and fail to suppress the noise like RetinexNet and DeepUPE in Fig. <ref>, or generate blurry images like Restormer and SNR-Net in Fig. <ref>, or introduce black spots and unnatural artifacts like DRBN <cit.> and SNR-Net in Fig. <ref>. In contrast, our Retinexformer can effectively enhance the poor visibility and low contrast, reliably remove the noise without introducing  spots and artifacts, and robustly preserve the color.\n\n\n\nUser Study Score. We conduct a user study to quantify the human subjective visual perception quality of the enhanced low-light images from the seven datasets. 23 human subjects are invited to score the visual quality of the enhanced results, independently. These testers are told to observe the results from: (i) whether the results contain under-/over-exposed regions, (ii) whether the results contain color distortion, and (iii) whether the results are corrupted by noise or artifacts. The scores range from 1 (worst) to 5 (best). For each low-light image, we display it and the results enhanced by various algorithms but without their names to the human testers. There are 156 testing images in total. The user study scores are reported in Tab. <ref>. Our Retinexformer achieves the highest score on average. Besides, our results are  most favored by the human subjects on LOL-v2-real (L-v2-R), LOL-v2-synthetic (L-v2-S), SID, SMID, and SDSD-outdoor (SD-out) datasets and second most favored on LOL-v1 (L-v1) and SDSD-indoor (SD-in) benchmarks.\n\n\n\n\n\n §.§ Low-light Object Detection\n\n\n\nExperiment Settings. We conduct low-light object detection experiments on the ExDark <cit.> dataset to compare the preprocessing  effects of different enhancement algorithms for high-level vision understanding. The ExDark dataset consists of 7363 under-exposed images annotated with 12 object category bounding boxes. 5890 images are selected for training while the left 1473 images are used for testing. YOLO-v3 <cit.> is employed as the detector and trained from scratch. Different low-light enhancement methods serve as the preprocessing modules with fixed parameters. \n\n\n\nQuantitative Results. The average precision (AP) scores are listed  in Tab. <ref>. Our Retinexformer achieves the highest  result on average, 66.1 AP, which is 0.5 AP higher than the recent best self-supervised method SCI <cit.> and  0.8 AP higher than the recent best fully-supervised method SNR-Net <cit.>. Besides, Retinexformer yields the best results on five object categories: bicycle, boat, bottle, cat, and dog.  \n\n\n\nQualitative Results. Fig. <ref> depicts the visual comparisons of detection results. The detector easily misses some target  objects or predicts inaccurate locations on the images enhanced by previous algorithms. In contrast, the detector can reliably predict well-placed  bounding boxes to cover all the desired objects on the image enhanced by our Retinexformer. These results demonstrate the superiority of the proposed method in benefiting high-level vision understanding.\n\n\n\n\n\n\n §.§ Ablation Study\n\n\nWe conduct ablation study on the SDSD-outdoor dataset for the good convergence and stable performance of Retinexformer on it. The results are reported in Tab. <ref>.\n\n\n\nBreak-down Ablation. We conduct a break-down ablation to study the effect of each component towards higher performance, as shown in Tab. <ref>.  Baseline-1 is derived by removing ORF and IG-MSA from  Retinexformer. When we respectively apply ORF and IG-MSA, baseline-1 achieves 1.45 and 2.39 dB improvements. When jointly exploiting the two techniques, baseline-1 gains by 3.37 dB. This evidence suggests the effectiveness of our ORF and IG-MSA.\n\n\n\nOne-stage Retinex-based Framework. We conduct an ablation to study ORF. The results are listed in Tab. <ref>. We first remove ORF from Retinexformer and set the input of ℛ as 𝐈_lu = 𝐈. The model yields 28.86 dB. Then we apply ORF but set ℰ to estimate the illumination map 𝐋. The input of ℛ is 𝐈./𝐋 where ./ indicates the element-wise division. To avoid exceptions thrown by computer, we add 𝐋 with a small constant ϵ = 1×10^-4. Yet, as analyzed in Sec. <ref>, the computer is vulnerable to the division of small values. Thus, the model obtains a limited improvement of 0.11 dB. To tackle this issue, we estimate the light-up map 𝐋̅ and set the input of ℛ as 𝐈_lu = 𝐈⊙𝐋̅. The model gains by 0.40 dB. After using  𝐅_lu to direct ℛ, the model continues to achieve an improvement of 0.58 dB in PSNR and 0.007 in SSIM.\n\n\n\nSelf-Attention Scheme. We conduct an ablation to study the effect of the self-attention scheme. The results are reported in Tab. <ref>. Baseline-2 is obtained by removing IG-MSA from Retinexformer. For fair comparison, we plug the global MSA (G-MSA) used by previous CNN-Transformer hybrid methods into each basic unit of ℛ. The input feature maps of G-MSA are downscaled into 1/4 size to avoid out of memory. We also compare our IG-MSA with local window-based MSA (W-MSA) proposed by Swin Transformer <cit.>. As listed in Tab. <ref>, our IG-MSA surpasses G-MSA and W-MSA by 1.41 and 1.34 dB while costing 2.08G and 0.86G FLOPS less. These results demonstrate the cost-effectiveness advantage of the proposed IG-MSA.\n\n\n\n\n§ CONCLUSION\n\n\nIn this paper, we propose a novel Transformer-based method, Retinexformer, for low-light image enhancement. We start from the Retinex theory. By analyzing the corruptions hidden in the under-exposed scenes and caused by the light-up process, we introduce perturbation terms into the original Retinex model and formulate a new Retinex-based framework, ORF.  Then we design an IGT that utilizes the illumination information captured by ORF to direct the modeling of long-range dependences and interactions of regions with different lighting conditions. Finally, our Retinexformer is derived by plugging IGT into ORF. Extensive quantitative and qualitative experiments show that our Retinexformer dramatically outperforms SOTA methods on seven datasets. The results of user study and low-light detection also demonstrate the practical values of our method.\n\nieee_fullname\n\n\n\n"}