{"entry_id": "http://arxiv.org/abs/2303.06702v1", "published": "20230312164407", "title": "Existence proof of librational invariant tori in an averaged model of HD60532 planetary system", "authors": ["Veronica Danesi", "Ugo Locatelli", "Marco Sansottera"], "primary_category": "math-ph", "categories": ["math-ph", "math.MP"], "text": "\nNear-field imaging of domain switching in in-operando VO_2 devices\n    Erik van Heumen\n    March 30, 2023\n==================================================================\n\n\n\nExistence proof of librational invariant tori in an averaged model of HD60532V. Danesi, U. Locatelli, M. Sansottera\n\n\n We investigate the\n    long-term dynamics of HD60532, an extrasolar system hosting two giant planets orbiting in a 3:1 mean motion resonance. We consider an average approximation  at order one in the masses which results\n  (after the reduction of the constants of motion) in a resonant\n  Hamiltonian with two libration angles. In this framework, the usual\n  algorithms constructing the Kolmogorov normal form approach do not\n  easily apply and we need to perform some untrivial preliminary\n  operations, in order to adapt the method to this kind of\n  problems. First, we perform an average over the\n  fast angle of libration which provides an integrable approximation\n  of the Hamiltonian. Then, we introduce action-angle variables\n  that are adapted to such an integrable approximation. This sequence\n  of preliminary operations brings the Hamiltonian in a suitable form\n  to successfully start the Kolmogorov normalization scheme. The\n  convergence of the KAM algorithm is proved by applying a technique\n  based on a computer-assisted proof. This allows us to reconstruct\n  the quasi-periodic motion of the system, with initial conditions\n  that are compatible with the observations.\n\n\n\n\nNear-field imaging of domain switching in in-operando VO_2 devices\n    Erik van Heumen\n    March 30, 2023\n==================================================================\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe discovery of the first multiple-planet extrasolar\n  system, υ Andromedæ (see <cit.>),\n  immediately raised the question of its stability, notably from a\n  dynamical system point of view.  Nowadays more than 800\n  multiple-planet extrasolar systems have been discovered, making the\n  question even more relevant.\n\n  Typically, these systems have been numerically investigated as a\n  sort of inverse problem, prescribing their stability in order\n  to determine ranges of possible values of a few orbital elements\n  which are unknown or poorly known (e.g., inclinations and longitudes\n  of the nodes).  The numerical investigations of the dynamical\n  behavior of many interesting extrasolar planetary systems have been\n  done complementing long-term integrations (see,\n  e.g., <cit.> and <cit.>) with\n  refined numerical techniques, like for instance the frequency\n  analysis method or the MEGNO chaos indicator (see,\n  e.g., <cit.> and <cit.>,\n  respectively).\n\n\nPerturbation theory allows to complement the numerical investigations\nwith rigorous analytic results.  Normal form methods have a\nlong-standing tradition and their applications to problems that are\nrelevant in Celestial Mechanics have grown more and more with the\ndevelopment of the algebraic manipulators (for an introduction to the\nmain concepts of this kind of software see,\ne.g., <cit.>). Therefore, in such a framework the\nstudy of extrasolar planetary systems (in particular, of their secular\ndynamics) started very soon (see, e.g., <cit.>).  The\nanalytic investigation via computer algebra complements the knowledge\nprovided by long-term numerical integrations.  In particular, we think\nthat the modern Hamiltonian perturbation theory gives a proper\nframework, where it is possible to naturally explain why a\n  planetary configuration is stable and answer this question also\nwith quantitative arguments. In this respect, such a goal of the\nnormal form approaches is somehow reminiscent of the aims of other\nrecent works about the planetary system dynamics, which are not\nlimited just to detection of chaos, but they succeed in\nexplaining which is the source of instability in terms of\nsuperposition of a few resonances that are properly determined\n(see <cit.>).\n\nAccording to the main results for quasi-integrable systems that have\nbeen obtained in the last decades, effective stability[A\n  dynamical system is said to be effectively stable when the\n  time needed to eventually escape from a small region of the phase\n  space is proved to largely exceed the expected life-time of such a\n  system.] is ensured in the vicinity of an invariant torus by\n  applying the KAM theorem jointly with the Birkhoff normal form and,\n  eventually, the Nekhoroshev theorem (see <cit.> for a\n  complete discussion of this strategy, while applications to\n  planetary dynamical models are described in <cit.>\n  and <cit.>).\n\nIn turn, the construction of the invariant torus\n  through Kolmogorov normal form is more effective if the starting\n  Hamiltonian is close to a suitable normal form designed to locate\n  another invariant object. For instance,\n  a preliminar (partial) construction of the Birkhoff normal form\n  allows one to prove the existence of invariant tori which are in the\n  neighborhood of a stable equilibrium point and are well\n  approximating the orbits of celestial objects for both the secular dynamics of the\n  Sun-Jupiter-Saturn system and the Trojan asteroids\n  (see <cit.> and <cit.>, respectively).\n  In the former case, the equilibrium solution corresponds to orbits\n  which are both circular and coplanar in the approximation provided\n  by the average over the fast angles (up to order two in the masses)\n  of the planetary three-body model; such an approach has been used to\n  study the inverse problem concerning the stability of a few\n  extrasolar systems in the framework we have sketched above\n  (see <cit.>). In the latter case, the stationary\n  solution is represented by one of the equilateral Lagrangian points,\n  that are commonly denoted with L_4, L_5; moreover, here it\n  has been necessary to preliminarly perform also the construction of\n  an intermediate invariant torus well approximating each sought\n  torus, by using a variant of the Kolmogorov normalization algorithm\n  that avoids small translations on the actions at every step of such\n  a computational procedure (which is detailed in\n  Section <ref>).  In all these works, the rate of convergence\n  of the normalization algorithm is as faster as the final invariant\n  torus is closer to the equilibrium solution, this distance being\n  proportional to the norm of the actions, which are properly defined\n  with respect to action-angle canonical coordinates that are\n  preliminarly introduced in a suitable way. Therefore, these examples\n  highlight that there are regions of the phase space which are\n  dynamically stable because they are surrounding KAM tori that, in\n  turn, are persistent to perturbations due to their vicinity to\n  an elliptic equilibrium point.\n\nA strategy that is similar to the previous one (except for some further\nrefinement) has made possible to fully develop an application of the\nKAM theory to the secular dynamics of a three-body model of the\nυ Andromedæ planetary system\n(see <cit.>). For that problem, first the normal form for\nan elliptic torus has been constructed. Afterwards, an intermediate\ninvariant torus is constructed by performing the already mentioned\nvariant of the Kolmogorov algorithm designed so as to skip the small\ntranslations at each normalization step (as it is described in\nSection <ref>). Finally, the classical Kolmogorov algorithm is\nproved to converge to the normal form corresponding to the desired\ntorus. This result can be explained as follows: the secular dynamics\nof the three main bodies of the υ Andromedæ planetary\nsystem is stable because it is strictly winding around a linearly\nstable periodic orbit (i.e., a one-dimensional elliptic torus).  The\ndistance from the elliptic torus to the orbit under consideration\n(which is measured with respect to the value of a suitable action\ncoordinate) has been translated in an easy-to-use numerical\ncriterion evaluating the robustness of planetary configurations.  Such\na numerical indicator has been successfully applied to the study of\nthe inverse problem concerning the stability of the\nυ Andromedæ planetary system\n(see <cit.>). This kind of numerical exploration\nlooks to be very suitable for applications to several (similar)\nexoplanetary systems and it is subject of some works in progress.[M. Volpi,\n  U. Locatelli, C.Caracciolo, M. Sansottera. In preparation.] \n\nAs far as we know, an application of KAM theory to\n  realistic models of planetary systems in Mean Motion Resonance\n(hereafter often replaced with its acronym MMR) is still lacking;\nfilling this gap is the main motivation of the present work. Let us\nrecall that a non-negligible fraction of the multiple-planet\nextrasolar systems which have been recently discovered are expected to\nbe in MMR (see “The Extrasolar Planet Encyclopedia”, http://exoplanet.eu). A few of them are hosting exoplanets that\nmove on rather eccentric orbits; usually they have been detected by\nusing the Radial Velocity method. We focus our attention on the two\nexoplanets orbiting around the HD60532 star. We consider their orbital\ndynamics in the framework of the same planar model already considered\nin <cit.> and <cit.>, where the existence of\nquasi-periodic stable motions is shown by applying the methods of\nfrequency analysis and a basic normal form approach jointly with\nnumerical integrations, respectively. In both the papers we have just\nmentioned, the model is unambiguously shown to be locked in a 3:1\nMMR, which is double in the sense that there are two independent\ncombinations of angles (including the mean anomalies) which are in a\nlibration regime. After having performed an average over a fast\nrevolution angle and the reduction of the angular momentum, the\nproblem is described by a two degrees of freedom Hamiltonian. Since\nthe orbits of those exoplanets are rather far from being circular, we\nthink that it is not appropriate to limit us to an approach based on\nexpansions up to the second order in the eccentricities (as it has\nbeen successfully done, with different purposes, in <cit.>\nand  <cit.>). Therefore, in the present work we study an\nHamiltonian model which is defined by suitable expansions in the\ncanonical coordinates up to a larger order in the eccentricities\n(i.e., 6; see Section <ref> for the proper definitions of\nthese rather standard expansions). At the end of this paper, in\nSection <ref> we prove the existence of an invariant KAM torus\ncarrying quasi-periodic motions which are consistent with the orbits\ngenerated by the numerical integrations starting with initial\nconditions compatible with the observations. This result of ours is\nfully rigorous in the sense that it is completely demonstrated by\nusing a computer-assisted proof, based on a normal\n  form approach (for an introduction to this method see, e.g., the\n  Appendixes of <cit.>). Let us recall that this is not\n  the only viable technique in this context; in particular, a careful\n  application of the so called a posteriori approach has been\n  able to prove the existence of KAM tori for values of the small\n  parameter ϵ extremely close to the breakdown threshold in\n  the famous case of the standard map[So\n      remarkable performances are also due to the fact that the\n      a posteriori method tries to determine just the\n      parameterization of the invariant torus, whose existence proof is\n      aimed at. Therefore, this approach takes profit of the fact that\n      the dimension of the problem is reduced, because the equivalent\n      of Taylor expansions with respect to the actions in the phase\n      space is not considered (see <cit.> for a\n      description of this computer-assisted technique).] (see\n  <cit.>). In the framework of the computer-assisted\n  approach we work with, we emphasize that the preliminary\n  approximation of the Kolmogorov normal form is fundamental for the\n  eventual success of the application of KAM theory.  Indeed, the\nconvergence to the final sought KAM torus strongly depends on the\naccuracy given by the intermediate normal forms. We emphasize that\nnone of the strategies we have previously sketched (even if they are\nused in junction each other) is sufficient to perform the preliminary\noperations in such a way to allow the final constructive algorithm to\nbe convergent.  Therefore, in\nSections <ref>–<ref> we need to\ncarefully describe that part of our approach that is new and so\ncrucial. We stress that the intermediate Hamiltonian acting as a\nkeystone for our approach is provided by a further average with\nrespect to one of the librational angles; this is done so as to\nproduce an integrable approximation of the final Kolmogorov normal\nform, after having performed some further (and suitable) canonical\ntransformations. Let us also recall that an integrable model for the\ndynamics of planetary systems in MMR has been derived in another way\nin <cit.> and it is used for a different analysis with\nrespect to ours.\n\nWe do believe that the whole computational procedure we describe in\nthe present paper can apply also to extrasolar planetary systems that\nare similar to the one orbiting around HD60532. Nevertheless, the\ndiscussion of the generality of the approach goes beyond our scope\nand it is deferred to future investigations.\n\n\n\n\n\n\n§ RESONANT HAMILTONIAN MODEL AT ORDER ONE IN THE MASSES\n\n\n\nWe consider a planar planetary three-body problem, consisting of a\ncentral star having mass m_0 and two coplanar planets having masses\nm_1 and m_2. The problem has 6 degrees of freedom, which can be\nreduced to 4 due to the conservation of the linear momentum.\nIntroducing the canonical astrocentric variables\n  (𝐫̃_1 , 𝐫̃_2 , 𝐫_1 , 𝐫_2),\n  𝐫_j being the coordinates and 𝐫̃_j the\n  conjugate momenta, the Hamiltonian reads\n\n    H(𝐫̃,𝐫)=T^(0)(𝐫̃)+U^(0)(𝐫)+T^(1)(𝐫̃)+U^(1)(𝐫)  ,\n\nwhere\n\n    T^(0)(𝐫̃)=1/2∑_j=1^2𝐫̃_j^2\n      (1/m_0+1/m_j) ,\n         U^(0)(𝐫)   =-∑_j=1^2m_0 m_j/𝐫_j ,\n      \n        T^(1)(𝐫̃)=𝐫̃_1 ·𝐫̃_2/m_0 ,\n         U^(1)(𝐫)   =-m_1 m_2/𝐫_1-𝐫_2\n\nand  is the gravitational constant (see,\ne.g., <cit.>).  It is convenient to introduce the\nPoincaré canonical variables\n\n    Λ_j    = m_0 m_j/m_0+m_j√( (m_0 + m_j) a_j) ,\n           λ_j   =M_j + ω_j ,\n    ξ_j   =√(2Λ_j)√(1-√(1-e_j^2))cos(ω_j) ,\n         η_j   = -√(2Λ_j)√(1-√(1-e_j^2))sin(ω_j) ,\n\nwhere a_j, e_j, M_j and ω_j are the semi-major axis, the\neccentricity, the mean anomaly and the argument of the pericenter of\nthe j-th planet, respectively.  In addition, we also introduce the\ntranslations L_j=Λ_j-Λ_j^* where Λ_j^* is\ndefined taking into account the corresponding value a_j^* of the\nsemi-axis which is compatible with the observations.  Expanding the\nHamiltonian in Taylor-Fourier series around the origin of the\nvariables (L,ξ,η), we get\n\n    1#   #   #\n     H(L,λ,ξ,η)   =K(L)+μ P(L,λ,ξ,η)   =n^*·L+∑_j_1=2^∞h_j_1,0^(Kep)( L)+μ∑_j_1=0^∞∑_j_2=0^∞h_j_1,j_2^(P)(L,λ,ξ,η) ,\n\nwhere n_j^*=√((m_0+m_j)/(a_j^*)^3), for j=1,2, and\nμ=max{m_1/m_0,m_2/m_0 }. The action-angle variables (\nL,λ) are referred to as the fast variables and the cartesian\nvariables (ξ,η) as the secular ones.  In particular,\nthe functions h_j_1,0^(Kep) of the Keplerian part K(L)\nare homogeneous polynomials of degree j_1 in the actions L,\nwhile the terms h_j_1,j_2^(P) of the perturbation\nP(L,λ,ξ,η) are homogeneous\npolynomials of degree j_1 in L, degree j_2 in\nthe secular variables (ξ,η) and trigonometric\npolynomials in the angles λ.\n\nOf course, in practical applications a finite truncation of the\nHamiltonian above is in order. The truncation rules adopted in the present work will be detailed in the\nfollowing.\n\n\n\n\n\n\n§ THE CASE STUDY OF THE HD60532 EXTRA-SOLAR SYSTEM\n\n\n\n\nLet us focus on the planar three-body problem for the HD60532\nextra-solar system.  The orbital parameters and the initial conditions\nare fixed as in Table <ref>, according to the values\ngiven in <cit.>.  This\nsystem consists of two giant planets in a 3:1 MMR, orbiting around\nthe star named HD60532.  The motion is assumed to be co-planar with an\ninclination i (with respect to the plane that is normal to the line\nof sight) which is fixed at 20^∘.  As a consequence, the initial\nmasses of the planets are increased by the factor 1/sin(i) with\nrespect to the minimum ones detected by means of the radial velocity\nmethod.  The presence of the mean motion resonance is confirmed by the\nevolution of the resonant angle λ_1-3λ_2+2ω_1,\nwhich librates around 180^∘.  Moreover, the system also exhibits\na second libration angle given by the difference of the arguments of\nthe pericenters ω_2-ω_1, as it has been remarked\nin <cit.>. Therefore, also the\naverage of λ̇_1-3λ̇_2+2ω̇_2 is equal to\nzero.  The evolutions of the resonant angles are reported in\nFig. <ref>; they have been produced by running a\nsymplectic integrator of type _3, which is\ndescribed in <cit.>.  The plots of the resonant angles\nhighlight that the amplitudes of libration are wide, in particular for the resonant angle λ_1-3λ_2+2ω_1,\nwhich has a width of about 280^∘.  This makes the study of the\nlong-term dynamics much more tricky, making it necessary to develop a\nsuitable approach in order to reconstruct the quasi-periodic motion\npointed out by the numerical integrations of the system. This is the\nreason why it is natural to expect that it is convenient to consider\nλ_1-3λ_2+2ω_1 as resonant angle\ninstead of λ_1-3λ_2+2ω_2, the libration amplitude\nof the latter being larger than 360^∘.\n\n\n\nFor what concerns the eccentricities, looking at\nFig. <ref> one can easily remark that the one of the\ninner planet can also exceed the value 0.3, during its dynamical\nevolution. This makes evident that the orbital configuration of these\nexoplanets is quite different with respect to that of the biggest\nplanets of our Solar System, whose orbits are nearly\ncircular. Therefore, it is natural to expect that a remarkable effort\nwill be needed to adapt normal forms algorithms which worked\nefficiently to construct quasi-periodic approximations of the orbital\nmotions of the major planets in our Solar System\n(see <cit.> and <cit.>). In order to\nefficiently implement a normal form approach to the HD60532\nextra-solar system, we will need to design a few modifications to that\nbasic scheme. This has to be done in such a way to make it more\nsimilar to the approach that successfully worked in the case of the\nυ Andromedæ planetary system (see <cit.>),\nwhich also shows the phenomenon of the librations of the difference of\nthe pericenters arguments (i.e., the so called apsidal locking) as in\nthe case under study of HD60532.\n\n\n\n\n\n\n §.§ The resonant model\n\n\nBeing interested in the long-term dynamics of a system\n  that is in MMR, we consider a resonant approximation of the\n  Hamiltonian that allows to reduce the number of degrees of freedom\n  to 2. Hence, we\nnow consider a set of coordinates which allows to better highlight\nthis point.  First of all, let us introduce the action-angle variables\n( I,ω) which replace the secular variables (ξ,η) by means of the following canonical transformation:\n\n    ξ_j= √(2I_j)cos(ω_j) ,\n        η_j=-√(2I_j)sin(ω_j) ,\n        for   j=1,2 .\n\nNow, we also introduce the resonant variables related to the two\nlibration angles,\n\n    {    p_δ=I_1+2L_1 \n        p_σ=L_1 \n        p_ϕ=I_1+I_2+2L_1 \n        p_θ=L_2+3L_1\n      .\n              {   δ=ω_2-ω_1 \n       σ=λ_1-3λ_2+2ω_1\n       ϕ=-ω_2 \n       θ=λ_2\n      .  \n         .\n\nIn this new set of action-angle coordinates, we consider the average\nof the Hamiltonian over the (unique) non-resonant revolution angle\nθ, i.e.,\n\n    H̅ = 1/2π∫_0^2π\n    H(p_δ , p_σ , p_ϕ , p_θ , δ , σ , ϕ , θ)  dθ .\n\nTherefore, the angles ϕ and θ turn out to be cyclic\nvariables for the Hamiltonian H̅.  Indeed, the action\np_ϕ is exactly the total angular momentum, which is a constant of\nmotion for the whole three-body planetary system.  Since we perform\nan average of the Hamiltonian with respect to a fast angle of orbital\nrevolution, then it is usual to refer to H̅ as a resonant\napproximation at order one in the masses. Such an averaged model shows\ntwo first integrals and can be reduced to two degrees of freedom.\nThe accuracy of the approximation at order one in the masses is discussed in <cit.> and <cit.>, for \ngeneral 2D three-body models of exoplanetary systems and for particular cases in mean-motion resonance, respectively. This is made by means of comparisons with the results  provided by both the approximation at order two in the masses and the numerical integrations of the non-averaged system.\n\n\n\nThe center of the librations of the resonant angles δ and\nσ corresponds to an equilibrium point of the angle variables of\nthe resonant Hamiltonian H̅.  With the aim of expanding\nthe Hamiltonian H̅ around its equilibrium point, we also\nlook for the values, say (p_δ^*,p_σ^*), of the conjugate\nmomenta p_δ and p_σ such that the Jacobian of the\nHamiltonian H̅ is equal zero.  Once we have determined\nthe equilibrium point[For the problem we are considering, we have found the following values: p_δ^*=0.0227533, p_σ^*=-0.00128589.] (p_δ^*,p_σ^*,π,π), we can\ntranslate the origin of the canonical variables, by defining\n\n    y_1=p_δ-p_δ^* ,     y_2=p_σ-p_σ^* ,   \n      x_1=δ-π ,    x_2=σ-π ,\n\nand expand the Hamiltonian in Taylor series around the origin.  We\nalso proceed with a diagonalization of the quadratic part of the\nHamiltonian.  Indeed, there is a linear canonical\ntransformation[A procedure which allows to determine such a\n  canonical transformation 𝒞 can be found in Section 7 of\n  <cit.>. In order to avoid ambiguities, here the linear transformation C is chosen  in such a way that |ω_1| <|ω_2|.]\n(y_1,y_2,x_1,x_2)=𝒞(Y_1,Y_2,X_1,X_2) conjugating the\nquadratic approximation to a couple of harmonic oscillators.  As a\nresult, the Hamiltonian in the new polynomial variables ( Y,\nX) reads\n\n    H( Y, X)=\n      ω_1/2(Y_1^2+X_1^2) + ω_2/2(Y_2^2+X_2^2) +\n      ∑_ℓ≥ 1 h_ℓ ( Y, X)  ,\n \nwhere the functions h_ℓ are homogeneous polynomials of degree\nℓ+2 in the variables ( Y, X).  Let us remark that,\naccording to a standard notation in the context of the KAM theory,\nhereafter, ω_1 and ω_2 are used to denote the\nfrequencies (while they have been used before to refer to the\narguments of the pericenters).\n\nThe main goal of this work is to investigate the stability of the\nHamiltonian model given by (<ref>) and to reconstruct its\nquasi-periodic motion, starting from initial conditions corresponding\nto the data reported in Table <ref>.  First of all, let\nus stress that the Hamiltonian (<ref>) has an elliptic\nequilibrium point at the origin and, in addition, in the case of the\nextra-solar system HD60532, the two frequencies ω_1 and\nω_2 also have the same sign.  Hence, it would be quite natural\nto try to deal with the problem using a Lyapunov confinement argument\nabout the values of the actions after having performed a few steps of\nthe Birkhoff normalization algorithm.  However, this approach fails because the initial conditions (expressed in the polynomial variables ( Y, X)) are too far from the equilibrium point situated at the origin.\nHence, we need a less naif method in order to tackle the problem under\nstudy.  Therefore, one could try another constructive procedure that\nhas shown to be successful in a similar context, i.e., for models of\nthe secular planetary dynamics (see <cit.>,\n<cit.> and <cit.>). Indeed, it could\nbe convenient to first introduce action-angle variables, with the aim\nof performing a translation of the actions and then applying the\nstandard Kolmogorov normalization algorithm.  Nevertheless, also this\nattempt fails, because it is not enough to achieve the convergence of\nthe final procedure, even if preceded by a finite number of steps of\nthe Birkhoff normalization algorithm.\n\nWe are then led to develop a different approach which is adapted to\nthe special kind of problem we are considering.  Let us remark that in\nthis model a slow dynamics can be distinguished from a faster one, as\nwe can see from the plots of the two libration angles that are\nreported in the first panel of Fig. <ref> and the\nthird one.  In particular, the difference of the argument of the\npericenters points out the slow period, that is (1/μ), while\nthe mean motion resonant angle σ also highlights the presence\nof a faster period.  Therefore, the key strategy to face the problem\nis to preliminarly average the Hamiltonian with respect to the faster\nlibration angle, namely over an angle related to the MMR. Let us recall that, by applying the procedure mentioned in\nfootnote<ref>1, it can be\neasily shown that the period of such a (so called) fast libration\n  angle is (1/√(μ)). Therefore, it is somehow\nintermediate between the secular angles and the orbital revolution\nones. This justifies the name we have decided to adopt, in order to\nrefer to it.\n\n\n\n\n\n\n§ AVERAGE OVER THE FAST LIBRATION ANGLE\n\n\nIn this section we describe the algorithm which allows to perform the\naverage of the Hamiltonian with respect to the fast libration angle.\n\nWe introduce the action-angle variables ( J,ϑ)\nvia the canonical transformation ( Y, X)=( J,ϑ), namely\n\n    Y_j= √(2J_j)cos(ϑ_j) ,\n           X_j=√(2J_j)sin(ϑ_j) ,     for   j=1,2 .\n\nAfter this canonical change of coordinates the Hamiltonian\n(<ref>) reads\n\n    ^(0)( J,ϑ)=ω· J\n      +∑_ℓ≥ 1 h^(0)_ℓ( J,ϑ) ,\n          with   ( J,ϑ)∈^2×^2  ,\n\nwhere the functions h^(0)_ℓ are homogeneous polynomials of\ndegree ℓ+2 in the square root of the actions J and\ntrigonometric polynomials in the angles ϑ.  The\nsuperscript refers to the normalization step of the averaging\nalgorithm we are going to describe in detail.\n\n\n\n §.§ Formal algorithm for the construction of a resonant Birkhoff normal form\n\n\nAs usual, this normal form is constructed by using the Lie series\nformalism, with the Lie series operator exp( χ)\ndefined as follows:\n\n    exp( χ)=\n    ∑_s≥ 01s!χ^s\n      and  χ·={·,χ} .\n\nMoreover, we denote by _s the class of functions depending\non the action-angle variables ( J,ϑ) in such a way\nthat, ∀ g∈_s, g∘^-1 is an homogeneous\npolynomial of degree s in the cartesian canonical variables (\nY, X). In more detail, the Taylor-Fourier expansion of a\ngeneric function g∈_s can be written as\n\n    g(  J, ϑ) =∑_ℓ∈^2ℓ_1+ℓ_2=s ∑_k_1=-ℓ_1, -ℓ_1+2,…, ℓ_1k_2=-ℓ_2, -ℓ_2+2,…, ℓ_2c_ℓ, k (√(J_1))^ℓ_1 (√(J_2))^ℓ_2exp[ (k_1ϑ_1+k_2ϑ_2)] ,\n\nwhere the complex coefficients are such that c_ℓ,-\n  k=c̅_ℓ, k. For the sake of brevity, in the\nfollowing we will adopt the usual multi-index notation for the powers\nin the square roots of the actions, i.e, the product\n(√(J_1))^ℓ_1 (√(J_2))^ℓ_2 will be denoted as\n(√( J))^ℓ; moreover, they will be subject to the\nrestriction |ℓ|=s for every term appearing in the expansion\nof a function g∈_s, being |ℓ|:=ℓ_1+ℓ_2.\nIn the following Lemma[Its easy\n  proof is sketched (for a wider type of classes of functions) in\n  Subsection 3.1 of <cit.>.], we are going to\ndescribe the behaviour of such a class of functions with respect to\nthe Poisson brackets.\n\n  \n  Let f∈_s_1+2 and g∈_s_2+2, then {f, g}∈_s_1+s_2+2 ∀ s_1∈∖{0},\n  s_2∈∖{0}.\n\n\nProceeding in a perturbative way, we want to remove step by step the\ndependence on the fast angle ϑ_2 (which is related to the\nfast libration angle σ) from the perturbative part of the\nHamiltonian.  Hence, after having performed r-1 canonical changes of\ncoordinates defined by the Lie series operator, the\nHamiltonian (<ref>) is brought to the following form:\n\n    ^(r-1)( J,ϑ)=\n      ω· J+∑_ℓ= 1^r-1Z_ℓ( J,ϑ_1)\n      + ∑_ℓ≥ r h_ℓ^(r-1)( J,ϑ) ,\n\nwhere Z_ℓ∈_ℓ+2 and h_ℓ^(r-1)∈_ℓ+2.\n\nLet us remark that, with abuse of notation, we are denoting the new\naction-angle variables (that are introduced by the canonical\ntransformation defined by any normalization step) with the same pair\nof symbols ( J,ϑ), which has been used to denote the\narguments of ^(0). As it is usual for the Lie series formalism,\nthis is done in order to contain the proliferation of the symbols.\n\nThe Hamiltonian in normal form up to order r is obtained as\n^(r)=exp(χ_r)^(r-1), where the generating\nfunction χ_r is determined by solving the homological equation\n\n    χ_r(ω· J) +\n      h_r^(r-1)( J,ϑ)= Z_r( J,ϑ_1)  ,\n\nwith Z_r( J,ϑ_1):=⟨\nh^(r-1)_r⟩_ϑ_2 where as usual\n⟨·⟩_ψ denotes the angular average with respect\nto ψ.  In order to solve such an equation, let us first write the\nTaylor-Fourier expansion of the perturbative term as\n\n    h_r^(r-1)( J,ϑ)=\n     ∑_ℓ∈^2|ℓ|=r+2 ∑_k_1=-ℓ_1, -ℓ_1+2,…, ℓ_1k_2=-ℓ_2, -ℓ_2+2,…, ℓ_2\n     c_ℓ, k^(r) (√( J))^ℓexp( k·ϑ) .\n\nTherefore, the r-th generating function writes as\n\n    χ_r( J,ϑ)=\n      ∑_ℓ∈^2|ℓ|=r+2 ∑_k_1=-ℓ_1, -ℓ_1+2,…, ℓ_1k_2=-ℓ_2, -ℓ_2+2,…, ℓ_2 ; k_2≠ 0c_ℓ, k^(r)/ k ·ω (√( J))^ℓexp( k·ϑ) .\n\nClearly, the generating function can be properly defined if and only\nif the frequency vector ω is non-resonant up to the order\nr+2.  This means that k ·ω≠ 0\n∀ 0<| k|≤ r+2. Such a property is certainly satisfied if\nwe assume that ω satisfies the Diophantine condition, namely\n\n    | k ·ω|≥γ/| k|^τ ,\n        ∀  k∈^2∖{0} ,\n\nfor some fixed values of γ>0 and τ≥ 1. Let us also\nrecall that almost all the vectors in ^2 are Diophantine with\nrespect to the Lebesgue measure.\n\nThe transformed functions h_ℓ^(r) appearing in the expansion of\nthe new Hamiltonian\n\n    ^(r)( J,ϑ)   =\n      𝒵^(r)( J,ϑ_1)+ℛ^(r+1)( J,ϑ)\n       =\n      ω· J+∑_ℓ= 1^rZ_ℓ( J,ϑ_1)\n      + ∑_ℓ≥ r+1 h_ℓ^(r)( J,ϑ) ,\n\nare defined as follows\n\n    h_ℓ^(r)= ∑_j=0^⌊ℓ/r ⌋1/j!χ_r^j h^(r-1)_ℓ-jr ,\n                              for ℓ≥ r+1 .\n\nA simple induction argument, which is based on the application\nof Lemma <ref>, allows us to verify that\nh^(r)_ℓ∈_ℓ+2 ∀ ℓ.\nHence, after a finite number r of normalization steps, we get the\nHamiltonian ^(r), which is the sum of a normal form part\n𝒵^(r)( J,ϑ_1)=ω·\nJ+∑_ℓ= 1^rZ_ℓ( J,ϑ_1), which is integrable,\nand a remainder ℛ^(r+1)( J,ϑ)=∑_ℓ≥ r+1 h_ℓ^(r)( J,ϑ).\nIndeed, the averaged part 𝒵^(r)( J,ϑ_1) is\nindependent of the fast angle ϑ_2.  Therefore, the action\nJ_2 is constant along the flow induced by 𝒵^(r),\nbecause {J_2 , 𝒵^(r)}=0. Moreover, the\naveraged part 𝒵^(r) results in an integrable\napproximation, because it can be reduced to an Hamiltonian having just\none degree of freedom.\n\nFor later convenience, it is also worth to recall that the canonical\ntransformation 𝒞^(r) defining the resonant Birkhoff\nnormal form up to the r-th step of the constructive algorithm is\nexplicitly given by\n\n    𝒞^(r)( J,ϑ)=\n      expχ_r ∘ expχ_r-1 ∘ … expχ_1 ( J,ϑ) .\n\nIn fact, the exchange theorem for Lie series ensures us that\n^(r)( J,ϑ)=^(0)(𝒞^(r)( J,ϑ))\n∀ ( J,ϑ)∈( 0)×^2,\nbeing ( 0) a suitable open ball centered\naround the origin of ^2 (see <cit.>\nand <cit.>).\n\n\n\n\n §.§ Comparison between numerical integrations and semi-analytic solutions\n\n\nIn this subsection, we are going to check the validity of the averaged\nHamiltonian up to a finite order r̃ (namely the integrable\napproximation 𝒵^(r̃)) in describing the orbital\nmotions induced by the Hamiltonian (<ref>) which describes the slow dynamics of a planetary system in MMR.  For what\nconcerns our extra-solar model, this latter Hamiltonian, expressed in\naction-angle variables as in (<ref>), has been expanded\nup to order 6 in the square root of the actions.  We perform 6\nnormalization steps and our goal is to compare numerical\nintegrations[All the computations discussed in the present\nSection and in the following one, which are both of symbolic type and\nof purely numerical kind, have been performed by using Mathematica.] of the Hamiltonian in MMR (<ref>) with the\nsemi-analytic solution of the averaged Hamiltonian up to order 6,\nboth described in the cartesian variables Y_j=\n√(2J_j)cos(ϑ_j) and X_j=√(2J_j)sin(ϑ_j),\nfor j=1,2. The choice r̃=6 allows to obtain\n  a reasonable balance between the accuracy and the needed\n  computational time.\n\n\nLet us recall that the averaged Hamiltonian 𝒵^(6) is\nintegrable according to the\nLiouville-Arnold-Jost theorem (for a complete proof, see,\ne.g., <cit.>).  Therefore, there exists an\nanalytic expression (eventually involving also the computation of\nintegrals and the inversion of some functions) which defines a\ncanonical transformation ( J,ϑ)=Ψ( P,φ),\nsuch that the averaged approximation 𝒵^(6) depends on\nthe actions P only, when it is transformed according to the\nchange of variables Ψ, i.e.,\n\n    ∂ 𝒵^(6)(Ψ( P,φ))/∂φ_j=0\n      ∀ j=1, 2 .\n Thus, in the new set of action-angle variables ( P,φ) the equations of motion related to the averaged Hamiltonian\n𝒵^(6)∘Ψ can be solved very easily.  Moreover, we\ncan also evaluate the composition 𝒞^(6) of canonical\ntransformations introduced in the previous Subsection in order to\ndefine the action-angle variables ( P,φ) and to\nobtain the Hamiltonian in normal form up to order 6. The normal form\nalgorithm can be finally translated in a so called semi-analytic\nprocedure which allows to determine the motion law t↦(\nY(t), X(t)) that is defined by the flow induced by the averaged\nHamiltonian 𝒵^(6). Such a computational procedure is\nsummarized (∀ t∈) by the following scheme:\n\n    [row sep=5em, column sep=9em,every label/.append style = font = ]\n      ( Y(0), X(0)) [r, \"(∘𝒞^(6)∘Ψ)^-1\",shorten <=1em,shorten >=1em]    ( P(0),φ(0)) [d, \"Φ_𝒵^(6)∘Ψ^t\",shorten <=0.5em,shorten >=0.5em] \n    ( Y(t), X(t)) [r,leftarrow,\"∘𝒞^(6)∘Ψ\",shorten <=0.5em,shorten >=0.5em]    ( P(t)= P(0),φ(t)=β t+φ(0))\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nwhere Φ_𝒵^(6)∘Ψ^t is nothing but the flow at\ntime t induced by the Hamiltonian 𝒵^(6)∘Ψ and\nthe angular velocity is given by β_j=∂/∂\n  P_j(𝒵^(6)∘Ψ), while  and\n𝒞^(6) are defined in (<ref>)\nand (<ref>), respectively.  Let us stress that the\ninitial conditions ( P(0),φ(0)) can be obtained by\ninverting the composition of the canonical transformations previously\ndescribed, while the initial conditions ( Y(0), X(0)) are the\nones derived from the observations.  This semi-analytic solution could\nbe compared with the one obtained by a direct integration of the\nHamiltonian (<ref>).  For the sake of simplicity, we do not\nperform the last canonical transformation Ψ, which is essential\nto properly define the semi-analytic\nscheme (<ref>), but it would require to perform\nsome operations (e.g., the aforementioned integrals and the inversions\nof functions) that can be hard to implement in a fully explicit way.\nWe just exploit the uniqueness of the solution of the corresponding\nCauchy problem and we approximate it numerically, by directly\nintegrating the equations of motion of the averaged Hamiltonian\n𝒵^(6).  Afterwards, we use the canonical\ntransformations (<ref>)\nand (<ref>) to express the solution in the\nvariables ( Y(t), X(t)) and we compare it with the numerical\nintegration of the Hamiltonian (<ref>).\n\nAs we can see from the plots in Fig. <ref>, for the\nrelatively faster pair of variables (Y_2,X_2) we have a good\nagreement between the two solutions, both in terms of amplitude and in\nterms of frequency.  Instead, as regards the slow variables\n(Y_1,X_1), there is a remarkable error concerning the frequency.\nIn principle, this discrepancy might be amended with an approximation\n  at order two in the masses (which can be adapted to planetary systems in MMR, as explained in <cit.>), but this goes beyond the scope of the present paper.\n\n\n\n\n\n§ ACTION-ANGLE VARIABLES ADAPTED TO THE INTEGRABLE APPROXIMATION\n\n\nBefore showing that KAM theorem applies in the present context, we\nneed another preliminary essential step in order to make the algorithm\nconvergent.  Specifically, we have to introduce a set of action-angle\nvariables, that are more suitable to describe the integrable\napproximation of the Hamiltonian (<ref>) than the pair\n( J,ϑ) as it is defined after having performed the\ncanonical transformation 𝒞^(6). Indeed, the ideal\naction-angle coordinates would be ( P,φ), the\nones we avoided to compute, because of the technical difficulties due\nto an eventual application of the Liouville-Arnold-Jost theorem. Let us\nrecall that P_1 and P_2 would be constant of motion for the\nintegrable approximation 𝒵^(6) and the same holds true\nalso for the action J_2.\n\nHence, if we consider the orbit of the fast motion of the integrable\napproximation 𝒵^(6) in the cartesian\nvariables[Let us remark that, once again, with a little abuse\n  of notation, we are denoting the variables used before and after the\n  averaging normalization algorithm with the same name.]\n(Y_2,X_2)=(√(2J_2)cos(ϑ_2),√(2J_2)sin(ϑ_2)),\nwe get a circular orbit, as it is shown in the right panel of\nFig. <ref>.  Instead, looking at the orbit of the\nslow motion in the cartesian variables\n(Y_1,X_1)=(√(2J_1)cos(ϑ_1),√(2J_1)sin(ϑ_1)),\nthat are related to the secular dynamics, we can observe that such an\norbit is far from being circular.  Therefore, at this stage we aim at\nintroducing a second action which is closer than J_1 to be a\nconstant of motion. In other words, our approach consists in the\nconstruction of action-angle variables with the aim of trying to\ncircularize (at least partially) the orbit describing the slow\ndynamics in the integrable approximation.  Thus, trying to introduce\nan action which depends only on the distance from the origin in the\ncartesian plane endowed with coordinates (Y_1,X_1), we are dealing\nwith a quasi-constant of motion and we approach better the sought\n(final) KAM torus. From a practical point of view, our approach is\ntranslated in an explicit computational procedure, by suitably\napplying the frequency analysis method to the flow induced by the\nintegrable approximation 𝒵^(6) (see <cit.>\nfor an introduction to such a numerical technique). This can be done\nby studying the Fourier decomposition of the signal Y_1(t)+\nX_1(t)≃∑_j=1^𝒩_cA_1,j e^(k_jν_1\n  t+φ_1,j), where 𝒩_c is the number of\ncomponents considered, A_1,j>0, k_j∈,\nφ_1,j∈(-π,π] and 2π/ν_1 is the period of such a\nmotion law.  By taking into consideration only the 𝒩_c=3\ncomponents of the signal which correspond to k_j=0,± 1 for\nj=1,2,3, it is easy to show that the corresponding approximation of\nthe orbit which describes the secular dynamics is an ellipse.\nTherefore, in order to give a circular shape to such an approximation\nof the orbit it is necessary to perform two changes of coordinates: a\nshift on the variable X_1 of a translation value X_1^* and a\ndilatation/contraction with coefficient α.  The value X_1^*\nof the translation is determined by exploiting the constant component\n(because for j=1 we have k_1=0 and φ_1,1=-π/2, then\nA_1,j e^φ_1,1 is purely imaginary and so is\naligned with the X_1 axis), while the coefficient α is\ndefined as follows\n\n    α=√(c_- -c_+/c_- +c_+) ,\n\nwhere c_- and c_+ are the absolute values of the complex\ncoefficients of the components with k_2=-1 and k_3=1,\nrespectively. In more detail, we define c_-=A_1,2 and\nc_+=A_1,3 for j=2,3; indeed, the easy computation of the\nsuitable coefficient α of dilatation/contraction takes\nprofit of the values of the corresponding angles, which are\nsuch that φ_1,2=-φ_1,3. Therefore, we\nintroduce the new variables\n\n    v_1=α· Y_1 ,      u_1=X_1-X_1^*/α .\n\n\n\n\nThe new orbit of the slow motion in the variables (v_1,u_1) is\nrepresented in Fig. <ref>.  Let us remark that this plot\ndoes not represent exactly a circular orbit; this was somehow expected\nsince we have considered only a limited number of Fourier components\nin the computational method we have introduced in the present Section\nwith the aim of trying to circularize the orbit itself.  However, by\nlooking at the scales reported on the vertical axes of the two panels\nincluded in Fig. <ref>, one can appreciate that the\ncanonical change of coordinates (<ref>) allows\nus to reduce the oscillations of the value of the action involved in\nthe description of the slow dynamics. In fact, when the plot of the\nmotion law t↦(Y_1^2(t)+X_1^2(t))/2 is compared to the\none of t↦(v_1^2(t)+u_1^2(t))/2, the gain of about 30%\nin the circularization of the orbit is highlighted.  This is enough\nfor the purpose of obtaining a Kolmogorov normalization algorithm\nwhich is convergent to the normal form related to the desired final\ninvariant torus.\n\n\n\n\nWe can now introduce the action-angle variables that are more\nsuitably adapted to the integrable approximation, i.e.,\n\n    v_1   =√(2(p_1+p_1^*))cos(q_1) ,\n           Y_2   =√(2J_2)cos(ϑ_2) ,\n    \n      u_1   =√(2(p_1+p_1^*))sin(q_1) , \n           X_2   =√(2J_2)sin(ϑ_2) ,\n\nwhere p_1^* is the value of the area enclosed by the orbit that\ndescribes the secular dynamics in the phase plane (v_1,u_1) (or in\nthe one endowed with coordinates (Y_1,X_1), since canonical\ntransformations preserve the areas) multiplied by the factor\n1/(2π). Therefore, we are imposing that the value p_1^*, which\ncorresponds to the closed curve {(p_1,q_1) : p_1=0 ,\nq_1∈}, is equal to the usual definition of the action for\nHamiltonian systems with one degree of freedom (see, e.g., Chap. 3\nof <cit.>).\n\n\n\n\n\n\n§ CONSTRUCTION OF THE KAM TORUS\n\n\nWe can now start the construction of the KAM torus for the averaged dynamics of HD60532.  First, we perform a\ntranslation of the fast action and we rename the fast angle, i.e.\n\n    p_2=J_2-J_2^*  ,      q_2=ϑ_2 ,\n\nwhere J_2^* is the mean value of the action J_2.  In the new\naction-angle variables ( p, q) the Hamiltonian\n(<ref>) can be expanded as follows\n\n    1#   #   #\n     H^(0)( p, q)    =\n        E^(0)+ω^(0)· p\n     +∑_s≥ 0∑_ℓ≥ 2 f_ℓ^(0,s)( p, q)\n           +∑_s≥ 1( f_0^(0,s)( q) + f_1^(0,s)( p, q)) ,\n\nwhere f_ℓ^(0,s) is a homogeneous polynomial of degree ℓ in\np and a trigonometric polynomial of degree[More\n  generically, the functions f_ℓ^(0,s) are usually defined as\n  trigonometric polynomials of degree sK (for some positive fixed\n  value of the parameter K∈) in q. We choose to set\n  K=2, accordingly to what is usually done for quasi-integrable\n  Hamiltonian system that are in the vicinity of an elliptic\n  equilibrium point as it is in the model we are studying (see,\n  e.g., <cit.> and recall the discussion in\n  Section <ref>).] 2s in q. The first\nsuperscript of the functions f_ℓ^(0,s) denotes the\nnormalization step.  Furthermore, E^(0) is the constant of the\nenergy level of p=0 when f_ℓ^(0,s)=0 ∀ ℓ\nand s=0, 1.  The goal is to construct the Kolmogorov normal form\n\n    H^(∞)( p, q)=ω^*· p +( p^2) ,\n\nwhere ω^* is the angular velocity vector characterizing the\nquasi-periodic motion on the invariant (KAM) torus corresponding to\np= 0. In other words, the Kolmogorov normalization algorithm\nis designed in such a way to remove the terms appearing in the second\nrow of formula (<ref>) by a sequence of canonical\ntransformations.  Here, it is convenient to adopt a different version\nof the classical Kolmogorov normalization algorithm, which is slightly\nmodified in such a way to not keep fixed the angular velocity vector\nω^(r), that is defined at the r-th step of the\nprocedure and corresponds to the quasi-periodic approximation of the\nmotion on the final sought KAM torus. We basically follow the approach\ndescribed in <cit.>, where the normalization procedure introduced by Kolmogorov is adapted in such a way to skip the small translation of the actions performed at every step of that algorithm. This modification allows to make the computational procedure more stable; such an improvement can play a crucial role when the action–frequency map is (close to be) degenerate (see <cit.>). Moreover, in order to improve its efficiency, this small adaptation of the Kolmogorov normalization algorithm has to be formulated so as to suitably determine the preliminary translation in (<ref>). All this computational procedure is summarized in the\nfollowing in order to make our discussion rather\nself-consistent.\n\nAs in Section <ref>, it is convenient to introduce suitable\nclasses of functions; here, we are going to say that g∈_ℓ,sK\nif its Taylor-Fourier expansion writes as\n\n    g( p,  q) =\n      ∑_ j∈^n|  j|=ℓ∑_ k∈^n|  k|≤ sK \n      c_ j, k  p^ jexp( k· q)  ,\n\nfor some fixed values of the non-negative integer parameters\nℓ, s and K. The following statement allows us to describe the\nbehaviour of such a class of functions with respect to the Poisson\nbrackets.\n\n  \n  Let us consider two generic functions g∈_ℓ,sK and\n  h∈_m,rK, where K is a fixed positive integer\n  number. Then, the following inclusion property holds\n  true:\n  \n    {g,h} = h g ∈_ℓ+m-1,(r+s)K   ∀ℓ, m, r, s∈  with ℓ+m≥ 1 ,\n\n  while {g,h} = 0 when ℓ=m=0.\n\n\nLet us imagine to have already performed r-1 normalization steps by\nusing, once again, the Lie series formalism; then, we have to\ndeal with an Hamiltonian of the following type:\n\n    1#   #   #\n     H^(r-1)( p, q)    =\n        E^(r-1)+ω^(r-1)· p\n     +∑_s≥ 0∑_ℓ≥ 2 f_ℓ^(r-1,s)( p, q)\n           +∑_s≥ r( f_0^(r-1,s)( q) + f_1^(r-1,s)( p, q))\n      ,\n\nwhere f_ℓ^(r-1,s)∈_ℓ,2s\n∀ ℓ, s ∈, while E^(r-1)∈. Let us\nremark that the expansion of H^(0), which is reported\nin (<ref>), agrees with the more general one, that is written\njust above in (<ref>), in the case with r=1. The Kolmogorov\nnormalization algorithm at step r is aimed to remove the main\nperturbing terms (that are the functions f_0^(r-1,r) and\nf_1^(r-1,r)), which are independent of and linear in the actions,\nrespectively.\n\nIn order to perform the r-th normalization step, first we need to\ndetermine the generating function χ_0^(r) in such a way to\nsolve the following homological equation:\n\n    χ_0^(r)(ω^(r-1)· p) +f_0^(r-1,r)=\n      ⟨ f_0^(r-1,r)⟩_ q .\n\nAs a matter of fact,\n⟨ f_0^(r-1,r)⟩_ q∈_0,0 is nothing but a\nconstant term. Therefore, it can be added to E^(r-1), in order\nto update the energy level, whose new value is denoted with E^(r).\nBy considering the Taylor-Fourier expansion of the perturbing term we\naim to remove, i.e.,\n\n    f_0^(r-1,r)( q)=\n      ∑_0<| k|≤ 2r c_ 0, k^(r-1,r)exp( k· q) ,\n\nwe obtain the following expression for the generating function:\n\n    χ_0^(r)( q) = ∑_0<| k|≤ 2rc_ 0, k^(r-1,r)/ k·ω^(r-1)exp( k· q) .\n\nLet us remark that the homological equation can be solved provided\nthat the following non-resonance condition holds true\n\n    k·ω^(r-1)≠ 0 ,     ∀  k∈^2∖{0} ,\n        with   | k|≤ 2r .\n\n\nWe then introduce the transformed Hamiltonian\nĤ^(r)=exp(χ_0^(r))H^(r-1),\nwhose expansion\n\n    1#   #   #Ĥ^(r)( p, q)    =\n        Ê^(r)+ω^(r-1)· p\n     +∑_s≥ 0∑_ℓ≥ 2f̂_ℓ^(r,s)( p, q)\n           +∑_s≥ r( f̂_0^(r,s)( q) +\n     f̂_1^(r,s)( p, q))\n\nis such that the new Hamiltonian terms f̂_ℓ^(r,s) are defined\nso that\n\n    f̂_0^(r,r)   = 0  , \n    f̂_ℓ^(r,s)   = ∑_j=0^⌊ s/r ⌋1/j!χ^(r)_0^j f^(r-1,s-jr)_ℓ+j ,\n                for ℓ=0, s≠ r ,-2pt-14pt or ℓ≠0  s≥ 0 .\n\nBy applying repeatedly Lemma <ref>, one\ncan easily verify that f̂_ℓ^(r,s)∈_ℓ,2s\n∀ ℓ, s.\n\nThe second generating function χ_1^(r) is determined by solving\nthe following homological equation:\n\n    χ_1^(r)(ω^(r-1)· p )+\n      f̂_1^(r,r)=⟨f̂_1^(r,r)⟩_ q .\n\nThe term ⟨f̂_1^(r,r)⟩_ q∈_1,0. This\nmeans that it is not dependent on the angles q and is linear in\nthe actions p; thus, it gives a contribution to the definition\nof the value of the angular velocity vector ω^(r), which\nin principle should converge to its limit ω^* (if the\nnormalization algorithm is convergent) and is defined so that\n\n    ω^(r)· p=\n      ω^(r-1)· p +⟨f̂_1^(r,r)⟩_ q .\n\n\nBy considering the following Taylor-Fourier expansion of the new\nperturbing term we aim to remove, i.e.\n\n    f̂_1^(r,r)( q) - ⟨f̂_1^(r,r)⟩_ q =\n      ∑_|ℓ|=1 ∑_0<| k|≤ 2rĉ_ℓ, k^(r,r) p^ℓexp( k· q) ,\n\nthen we easily determine the new generating function as\n\n    χ_1^(r)( q)= ∑_|ℓ|=1 ∑_0<| k|≤ 2rĉ_ℓ, k^(r,r)/ k·ω^(r-1) p^ℓexp( k· q) .\n\nOnce again, the homological equation can be solved provided that the\nfrequencies satisfy the non resonance condition (<ref>).\nThe new Hamiltonian is defined as\nH^(r)=exp(χ_1^(r))Ĥ^(r-1). Its\nexpansion is completely analogous to the one reported\nin (<ref>). Moreover,\nthe terms f_ℓ^(r,s)∈_ℓ,2s appearing in the\nexpansion of H^(r) are defined in the following way:\n\n    f_1^(r,r)   = 0  , \n    \n    f_1^(r,ir)   =\n    i-1/i!χ^(r)_1^i-1f̂^(r,r)_1+\n    ∑_j=0^i-21/j!χ^(r)_1^jf̂^(r,(i-j)r)_1 ,\n            for i≥ 2 ,\n     \n    f_ℓ^(r,s)   =\n    ∑_j=0^⌊ s/r ⌋1/j!χ^(r)_1^jf̂^(r,s-jr)_ℓ ,\n            for ℓ=1, s≠ ir ,-2pt-14pt or ℓ≠1,  s≥ 0 ,\n\nwhere we have exploited the second homological\nequation (<ref>).\n\nFrom a practical point of view, we can iterate the algorithm only up\nto a finite number of steps, say, r. This allows us to\ndetermine\n\n    H^(r)( p, q)=E^(r)\n      +ω^(r)· p\n      +∑_s≥ 0∑_ℓ≥ 2 f_ℓ^(r,s)( p, q)\n      +∑_s≥r+1( f_0^(r,s)( q) + f_1^(r,s)( p, q))\n       .\n\nHence, we obtain an approximation of the final invariant torus which\nis characterized by an angular velocity vector\nω^(r).  If the value (say) I_1^* of the\ninitial shift on the first action, which has been preliminarly fixed\nequal to p_1^* in formula (<ref>), is accurate\nenough, then the slow frequency ω^(r)_1 is close\nto the one we are aiming at, which is numerically determined by\napplying the frequency analysis method, namely\nω^(r)_1≃ω_1^*.  We then calibrate the\ninitial translation of the first action I_1^*=p_1^* by means of a\nNewton method.  The goal is to solve the implicit equation\nω_1(Ĩ_1)=ω_1^* with respect to the initial\nshift Ĩ_1.  The value Ĩ_1 is iteratively\ncomputed using the formula\n\n    Ĩ_1^(n)=Ĩ_1^(n-1)+\n      ω_1^*-ω_1^(r)(Ĩ_1^(n-1))/ω_1^'(Ĩ_1^(n-1)) ,\n\nwhere Ĩ_1^(0)=I_1^* and the value of the derivative\nω_1^'(Ĩ_1^(n-1)) is numerically\napproximated by using the finite difference method.  Let us recall\nthat, after having performed the average with respect to the fast\nangle of libration as it has been described in the previous section,\nwe are mainly focusing on the study of the secular dynamics.  In\naddition, for what concerns the (relatively) faster frequency\nω_2^(r)/(2π) we automatically have a good enough\napproximation of both the frequencies of the averaged Hamiltonian, as\nit can be appreciated looking at the comparison between the\nsemi-analytic solutions showed in Fig. <ref>, which will\nbe widely commented in the next subsection.\n\nBy supposing to iterate the normalization algorithm ad infinitum, one\nwould get the Hamiltonian (<ref>), which admits the\ninvariant torus p=0 with frequency ω^*.\n\nFrom a practical point of view, we are able to explicitly iterate the\nalgorithm only up to a finite normalization step r and we\ncan numerically check the convergence of the procedure by controlling\nthe decrease of the norms of the generating functions. Hereafter, we\ndefine the norm of any generic function g∈_ℓ,sK as\n\n    g( p,  q) =\n    ∑_ j∈^n|  j|=ℓ∑_ k∈^n|  k|≤ sK|c_ j, k| ,\n\n∀ ℓ, s, K ∈, where the Taylor-Fourier\nexpansion of g is written\nin (<ref>).  The behavior of χ_0^(r) and\nχ_1^(r) for values of the normalization step r up to 9\nare reported in Fig. <ref>.\n\n\n\n\n §.§ Comparison between two different kinds of semi-analytic solutions\n\n\nIn this subsection we check the accuracy of the\nHamiltonian (<ref>) in Kolmogorov normal form up to a\nfinite order r in describing the motion of the averaged\nintegrable Hamiltonian 𝒵^(r̃) up to order r̃.  For what concerns our model of the librational dynamics of the\nextrasolar system HD60532, we consider the Hamiltonian H^(5),\nexpanded as in (<ref>) and truncated up to degree 2\nin the actions and to trigonometrical degree 12 in the angles.  The\naim is to make a comparison with the solution associated to the\naveraged integrable Hamiltonian 𝒵^(6), computed in\nSubsection <ref>.  The semi-analytic solution of\nthe equations of motion which is related to the Hamiltonian H^(5)\ncan be obtained with a procedure similar to the one previously\ndescribed and represented in (<ref>).\nMoreover, as we can see in Fig. <ref>, we compare the\nmotion laws induced by two different Hamiltonians by considering in\nboth cases the cartesian variables Y_j=√(2J_j)cos(ϑ_j)\nand X_j=√(2J_j)sin(ϑ_j), for j=1, 2, that were\nadopted as canonical coordinates before starting the averaging\nprocedure which constructs the resonant Birkhoff normal form. In more\ndetail, we can determine the expansions of all the canonical\ntransformations introduced in Sections <ref>,\n<ref> and <ref> with the aim of constructing\na Hamiltonian in Kolmogorov normal form up to order 5. Let us denote\nwith the symbol 𝒦^(5) the composition of the canonical\ntransformations introduced by the Kolmogorov algorithm (described in\nthe previous Subsection) up to the 5-th normalization step, i.e.,\n\n    𝒦^(5)( p, q)=\n      expχ_1^(5) ∘ expχ_0^(5) ∘ … ∘expχ_1^(1) ∘ expχ_0^(1) ( p, q) .\n\nTherefore, ∀ t∈, we can compute the values of the\ncanonical variables ( Y(t), X(t)) corresponding to the (\np(t), q(t))=(0,ω^(5) t+ q(0)), which describe the\nquasi-periodic motion of the final KAM torus as it is approximately reproduced by the Kolmogorov normalization algorithm,\nwhen it is iterated up to the 5-th step. This computation is\nperformed according to the following scheme:\n\n    [row sep=5em, column sep=10em,every label/.append style = font = ]\n      ( Y(0), X(0)) [r, \"(∘𝒞^(5)∘𝒯_Ĩ_1∘𝒦^(5))^-1\",shorten <=1em,shorten >=1em]    ( 0, q(0)) [d, \"Φ_ω^(5)· p^t\",shorten <=0.5em,shorten >=0.5em] \n    ( Y(t), X(t)) [r,leftarrow,\"∘𝒞^(5)∘𝒯_Ĩ_1∘𝒦^(5)\",shorten <=0.5em,shorten >=0.5em]    ( p(t)= 0, q(t)=ω^(5) t+ q(0))\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHere a few further explanations are in order. We denote with (\nJ,ϑ)=𝒯_Ĩ_1( p, q) the canonical\ntransformation that is obtained by making the composition of all the\ncanonical transformations described in Section <ref>\nand in formula (<ref>); moreover, one has to\ntake care of slightly modifying (<ref>) in\nsuch a way to replace p_1^* with the value of Ĩ_1 (i.e.,\nthe solution of equation ω_1(Ĩ_1)=ω_1^*\nnumerically obtained by applying the Newton method). In the\nscheme (<ref>) we have also decided to\nconsider 𝒞^(5) instead of 𝒞^(6), because\notherwise with the adopted rules of truncation the Hamiltonian would\nbe integrable already before the Kolmogorov normalization; this would\nmake trivial the application of such an algorithm. Finally, let us\nrecall that H^(5)( p, q)≃ω^(5)· p\n+( p^2) and ω^(5)≃ω^*; this allows us\nto put the flow of ω^(5)· p in order to\napproximate (in the semi-analytical scheme above) the solution of the\nequations of motion related to H^(5) and with initial conditions\np(0)= 0.\n\n\n\nThe plots in Fig. <ref> show an excellent\nsuperimposition between the two solutions, with respect to both the\namplitudes and the frequencies. This makes evident the effectiveness\nof our computational algorithm. Let us also recall that the initial\nconditions ( Y(0), X(0)) are the ones compatible with the\nobservations.\n\n\n\n\n §.§ Computer-assisted proof\n\n\nBy looking at the plots in Fig. <ref>, it can be\nnoticed that the decrease of the norms of the generating functions, in\nparticular for what concerns the finite sequence of the second\ngenerating function χ_1^(r), is not so regular and the\nconvergence of the algorithm looks doubtful.  In order to rigorously\nprove that the KAM algorithm is convergent, we adopt a rigorous\napproach based on a computer-assisted proof. For this purpose, we\nfollow the method which has been described in <cit.> and\nfurther developed in <cit.>, where a publicly available\nsoftware package[That software package can be freely\n  downloaded from the web address <http://dx.doi.org/10.17632/jdx22ysh2s.1>] is provided as\nsupplementary material. Such a package is designed for doing just this\nkind of computer-assisted proof for Hamiltonian systems having two\ndegrees of freedom. In order to use this software so as to apply it to\nthe problem under consideration, it is just matter to prepare some\ninput files, which basically describe the starting Hamiltonian; in\nprinciple, this can allow us to prove the existence of the KAM torus\nwe are aiming at, if the corresponding Kolmogorov normal form is close\nenough to such an initial Hamiltonian. More precisely, we consider\nH^(5) as the starting Hamiltonian. It is fully determined at the\nend of the application of the Newton method, which has been described\nin the previous Section; in terms of a single mathematical formula, it\ncan be written as\n\n    H∘∘𝒞^(5)∘𝒯_Ĩ_1∘𝒦^(5)\n\nwhere H, , 𝒞^(5),\n𝒯_Ĩ_1 and 𝒦^(5) are defined\nin (<ref>), (<ref>),\n(<ref>), just below\nformula (<ref>)\nand (<ref>), respectively.  Moreover, the expansion\nof H^(5) can be written as in (<ref>) and is\ntruncated up to degree 2 in the actions and to trigonometrical\ndegree 12 in the angles, while the expansion (<ref>)\nof the intermediate Hamiltonian\n^(5)=H∘∘𝒞^(5) has been preliminarly\ntruncated so as to exclude the sum of terms ∑_ℓ>6\nh_ℓ^(r)( J,ϑ)=( J^7/2).\nTherefore, H^(5) is not in Kolmogorov normal form because of a few\n(small) Hamiltonian terms that are either dependent on the angles q only or linearly dependent on the actions p.\n\nDuring the initial stage of the computer-assisted proof, a first code\nexplicitly performs a (possibly large) number R_ I of\nnormalization steps of a classical formulation of the Kolmogorov\nalgorithm, which includes also small translations of the actions that\naim at keeping fixed the desired angular velocity vector of the\nquasi-periodic motion on the final torus, i.e.,\nω^*. Afterwards, the size of the perturbation is further\nreduced (although in a less efficient way) by another code which just\niterates the estimates of the norms of the terms of order r with\nR_ I<r≤ R_ II. In the case of the model we are\nstudying, in order to achieve the convergence of the algorithm, we\nhave found convenient to set R_ I=200 and R_ II=20 000.\nThe whole computer-assisted proof[The\n    software package allowing to perform the computer-assisted proof\n    of theorem <ref> is available at https://www.mat.uniroma2.it/~locatell/CAPs/CAP4KAM-HD60532.zip\n As\n    a matter of fact, the codes included in this software package are\n    exactly the same as the ones which can be downloaded from the\n    website mentioned in\n    footnote<ref>1. The\n    differences between the two packages just concern the files\n    defining the expansions of the initial Hamiltonians to which the\n    computer-assisted proofs are applied.] required a total\ncomputational time of about 52.5 hours on a\nworkstation equipped with CPUs of type \n(2.2 GHz) and 384 GB of RAM. Nearly all the time (i.e., more than\n50 hours) has been requested by the first explicit\ncomputation of the (truncated) expansions of the Hamiltonians\nH^(r) for r=1 , … , R_I=200.\n\n\n\nThe plot of the norms of the generating functions χ_1^(r) (in\nsemi-log scale) is reported in Fig. <ref>, where\nthe occurrence of a regular decrease is clearly highlighted.  In\nparticular, looking at the panel on the right, we can appreciate that\nthe decrease is sharper for the first R_ I normalization steps,\nwhere the expansions of the generating functions are computed\nexplicitly.  Afterwards, there is a transition to the regime of the\niteration of the norms and, after some initially periodic jumps, the\ndecrease becomes more regular.\n\nAt the end of the running of the codes which make part of the software\npackage designed to perform this kind of computer-assisted proofs,\nupper bounds for all the terms appearing in the expansion of\nH^(R_ II), which is written as in (<ref>),\nare available. Therefore, one can check in an automatic way the\napplicability of the KAM theorem (e.g., in the version proved\nin <cit.>, which fits perfectly in this framework).  The\napplication of all this computational procedure allows us to prove our\nfinal result, that is summarized in the following statement.\n\n\n\n  Let us consider the Hamiltonian H^(5), expanded as\n  in (<ref>) and truncated up to degree 2 in the\n  actions and to trigonometrical degree 12 in the angles.  Let\n  ω^*∈^2 be such that\n  \n    ω_1^*∈( -2.72805620345077182 × 10^-2,\n        -2.72805620345057182× 10^-2)\n       ω_2^*∈( -3.0574227066998818 × 10^-1,\n        -3.0574227066978818 × 10^-1)\n\n  and it satisfies the Diophantine condition\n  \n    | k·ω^*|≥γ/| k|^τ ,\n          ∀  k∈^2∖{0} ,\n\n  with γ=2.7280562034505684× 10^-2 and τ=1.\n  Therefore, there exists an analytic canonical transformation which\n  transforms the Hamiltonian H^(5) in the Kolmogorov normal\n  form (<ref>). In the new action-angle coordinates, the\n  torus { p= 0 ,  q∈^2} is invariant and carries\n  quasi-periodic orbits whose corresponding angular velocity vector is\n  ω^*.\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n\nThis work was partially supported by the MIUR-PRIN 20178CJA2B “New\nFrontiers of Celestial Mechanics: theory and Applications”, by the\nMIUR Excellence Department Project awarded to the Department of\nMathematics of the University of Rome “Tor Vergata” (CUP\nE83C18000100006) and by the National Group of Mathematical\nPhysics (GNFM-INdAM).\n\n\n\n\n10\n\n\nAlv-Mich-Mal-2016\n  A.J. Alves, T.A. Michtchenko, M. Tadeu dos Santos.\n  Dynamics of the 3/1 planetary mean-motion resonance: an application to the HD60532 b-c planetary system.\n  Cel. Mech. & Dyn. Astr., 124, 311–334 (2016).\n\n\n\nBatMor-2013K. Batygin, A. Morbidelli.\n  Analytical treatment of planetary resonances\n  A&A, 556, A28 (2013). \n  \nButler-et-al-1999R.P. Butler, G.W. Marcy, D.A. Fischer,\n  T.M. Brown, A.R. Contos, S.G. Korzennik, P. Nisenson, R.W. Noyes.\n  Evidence for Multiple Companions to υ Andromedæ.\n  Astroph. Jour., 526, 916–927 (1999). \n\nCar-Loc-2020C. Caracciolo, U. Locatelli.\n  Computer-assisted estimates for Birkhoff normal forms.\n  Journal of Computational Dynamics, 7, 425–460 (2020).\n\n  \nCarLSV-2022C. Caracciolo, U. Locatelli, M. Sansottera, M. Volpi.\n  Librational KAM tori in the secular dynamics of the\n    υ Andromedæ planetary system.\n  MNRAS, 510, 2147–2166 (2022).  \n\nCelGL-2000A. Celletti, A. Giorgilli, U. Locatelli.\n  Improved estimates on the existence of invariant tori\n    for Hamiltonian systems.\n  Nonlinearity, 13, 397–412 (2000).\n\n\nDeitrick-et-al-2015R. Deitrick, R. Barnes, B.E. McArthur,\n  T.R. Quinn, R. Luger, A. Antonsen, G.F. Benedict.\n  The Three–Dimensional Architecture of the\n    υ Andromedæ.\n  Astroph. Jour., 798:46 (2015).\n\n  Fig-Har-Luq-2017J.-Ll. Figueras, A. Haro and A. Luque.\n  Rigorous computer-assisted application of KAM theory: a modern\n    approach. \n    Found. Comput. Math., 17 (2017), 1123–1193.\n  \n  \nGab-Jor-Loc-2005F. Gabern, A. Jorba, U. Locatelli.\n  On the construction of the Kolmogorov normal form for the\n    Trojan asteroids.\n  Nonlinearity, 18, 1705–1734 (2005).\n  \nGiorgilli-Libro-2022 \n  A. Giorgilli.\n  Notes on Hamiltonian Dynamical Systems.\n  London Mathematical Society Student Texts,\n  102, ISBN: 9781009151139 (2022).\n\n\nGioDFGS-1989A. Giorgilli, A. Delshams, E. Fontich,\n  L. Galgani, C. Simó.\n  Effective stability for a Hamiltonian system near an\n    elliptic equilibrium point, with an application to the restricted\n    three–body problem.\n  J. Differential Equations, 77, 167–198 (1989).\n\n \nGio-Loc-San-2009A. Giorgilli, U. Locatelli, M. Sansottera.\n  Kolmogorov and Nekhoroshev theory for the\n    problem of three bodies.\n  Cel. Mech. & Dyn. Astr., 104, 159–173 (2009).\n\n  \nGio-Loc-San-2017A. Giorgilli, U. Locatelli, M. Sansottera.\n  Secular dynamics of a planar model of the\n  Sun-Jupiter-Saturn-Uranus system; effective stability in the light\n  of Kolmogorov and Nekhoroshev theories.\n  Reg. & Chaotic Dyn., 22, 54–77 (2017).\n\nGio-San-Chronos-2012A. Giorgilli, M. Sansottera.\n  Methods of algebraic manipulation in perturbation theory.\n  In P.M. Cincotta, C.M. Giordano, C. Efthymiopoulos (eds.):\n    “Chaos, Diffusion and Non-integrability in Hamiltonian Systems –\n    Applications to Astronomy”, Proceedings of the Third La Plata\n    International School on Astronomy and Geophysics, Universidad\n  Nacional de La Plata and Asociación Argentina de Astronomía\n  Publishers, La Plata (2012).  \n  \nGrobner-60W. Gröbner.\n  Die  Lie-Reihen und Ihre \n    Anwendungen.\n  Springer Verlag, Berlin (1960).\n  Italian transl. in Le\n  serie di Lie e le loro applicazioni. Cremonese, Roma (1973).\n\nHadden-2019\n  S. Hadden.\n  An Integrable Model for the Dynamics of Planetary\n    Mean-motion Resonances.\n  Astron. Jour., 158:238 (2019).\n\n\nHaro-et-al_book_2016\n  A. Haro, M. Canadell, J-LL. Figueras, A. Luque, J-M. Mondelo.\n  The parameterization method for invariant manifolds.\n  Applied Mathematical Sciences, vol. 195, Springer (2016).\n\n\nLaskar-1989J. Laskar.\n  Les variables de Poincaré et le\n  développement de la fonction perturbatrice.  Groupe de travail\n  sur la lecture des Méthodes nouvelles de la Mécanique\n  Céleste.\n  Notes scientifiques et techniques du Bureau des\n  Longitudes, S026\n  (1989).\n  https://www.imcce.fr/content/medias/publications/publications\n-recherche/nst/docs/S026.pdf\n  \nLaskar-2003J. Laskar.\n  Frequency map analysis and quasi periodic decompositions.\n  In D. Benest, C. Froeschlé, &  E. Lega E. (eds.),\n    Hamiltonian systems and Fourier analysis,\n    Taylor and Francis, Cambridge (2003)\n  \n\nLas-Cor-2009\n  J. Laskar, A. C. M. Correia.\n  HD 60532, a planetary system in a 3:1 mean motion resonance.\n  Astron. & Astroph., 496, L5–L8 (2009).\n\n\nLas-Rob-2001J. Laskar, P. Robutel.\n  High order symplectic integrators for perturbed Hamiltonian\n    systems.\n  Cel. Mech. & Dyn. Astr., 80, 39–62 (2001).\n\nLib-San-2013A.-S. Libert, M. Sansottera. On the extension of the Laplace-Lagrange secular theory to order two in the masses for extrasolar systems. Cel. Mech. & Dyn. Astr., 117, 149–168 (2013).\n  \nLoc-Car-San-Vol-2021U. Locatelli, C. Caracciolo, M. Sansottera, M. Volpi. A numerical criterion evaluating the robustness of planetary architectures; applications to the υ Andromedæ system  In A. Celletti, C. Galeş, C. Beaugé, A. Lemaitre, eds., Multi-scale (time and mass) dynamics of space objects, Proceedings of the International Astronomical Union Symposium No. 364, Book Series, Volume 15, Pages 65-84, DOI 10.1017/S1743921322000461 (2021).\n  \n  \nLoc-Car-San-Vol-2022U. Locatelli, C. Caracciolo, M. Sansottera,\n  M. Volpi.\n  Invariant KAM tori: from theory to applications to exoplanetary systems\n   In G. Baù,\n  S. Di Ruzza, R.I. Páez, T. Penati & M. Sansottera (eds.),\n  I-CELMECH Training School — New frontiers of Celestial\n    Mechanics: theory and applications, Springer PROMS, volume 399, eBook ISBN 978-3-031-13115-8 (2022).\n    \nLoc-Gio-2000U. Locatelli, A. Giorgilli.\n  Invariant tori in the secular motions of the three–body\n    planetary systems.\n  Cel. Mech. & Dyn. Astr., 78, 47–74 (2000).\n\nLoc-Gio-2005U. Locatelli, A. Giorgilli.\n  Construction of the Kolmogorov's normal form for a\n    planetary system.\n  Reg. & Chaot. Dyn., 10, 153–171 (2005).\n\nLoc-Gio-2007U. Locatelli, A. Giorgilli.\n  Invariant tori in the Sun–Jupiter–Saturn system.\n  Discr. & Cont. Dyn. Sys. — B, 7, 377–398 (2007).\n  \nMcArt-et-al-2010B.E. McArthur, G.F. Benedict, R. Barnes,\n  E. Martioli, S. Korzennik, E. Nelan, R.P. Butler.\n  New observational constraints on the\n    υ Andromedæ system with data from the Hubble Space\n    telescope and Hobby-Eberly telescope.\n  Astroph. Jour., 715, 1203–1220 (2010).\n\nMich-Mal-2004T.A. Michtchenko, R. Malhotra.\n  Secular Dynamics of the Three-Body Problem:\n    Application to the υ Andromedæ Planetary System.\n  Icarus, 168, 237–248 (2004).\n\n\n\n\n\n  \nMog-Las-2022\n  F. Mogavero, J. Laskar.\n  The origin of chaos in the Solar System through\n    computer algebra\n  Astron. & Astroph., 662, L3 (2022).\n\n\nMor-Gio-1995A. Morbidelli, A. Giorgilli.\n  Superexponential stability of KAM tori.\n  J. Stat. Phys., 78, 1607–1617 (1995).\n\n  \nPucacco-2021G. Pucacco.\n  Normal forms for the Laplace resonance.\n  Cel. Mech. & Dyn. Astr., 133:3 (2021).\n\n  \nSanLib-2019M. Sansottera, A.-S. Libert.\n  Resonant Laplace-Lagrange theory for extrasolar systems\n    in mean-motion resonance.\n  Cel. Mech. & Dyn. Astr., 131:38 (2019).\n\n\nSteLoc-2012L. Stefanelli , U. Locatelli.\n  Kolmogorov's normal form for equations of motion with\n    dissipative effects.\n  Discr. & Cont. Dyn. Sys. — B, 17, 2561–2593\n  (2012).\n\n\nValLoc-2021 \n  L. Valvo, U. Locatelli.\n  Hamiltonian control of magnetic field lines: Computer assisted\n    results proving the existence of KAM barriers.\n  Journal of Computational Dynamics, 9, 505–527 (2022).\n\n\nVol-Loc-San-2018M. Volpi, U. Locatelli, M. Sansottera.\n  A reverse KAM method to estimate unknown mutual\n    inclinations in exoplanetary systems.  Cel. Mech. &\n    Dyn. Astr., 130:36 (2018).\n\nVol-Roi-Lib-2019M. Volpi, A. Roisin, A.-S. Libert.\n  On the 3D secular dynamics of radial-velocity-detected\n    planetary systems.\n  Astron. & Astroph., 626, A74 (2019).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}