{"entry_id": "http://arxiv.org/abs/2303.06701v1", "published": "20230312163300", "title": "Composite Sorting", "authors": ["Job Boerma", "Aleh Tsyvinski", "Ruodu Wang", "Zhenyuan Zhang"], "primary_category": "econ.GN", "categories": ["econ.GN", "q-fin.EC"], "text": "\n\n\n\n\n\n#1#2#3 \n[#1,->] (#2) +(80:#3) arc(80:-260:#3)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nfont=stretch=1.5\n\n \n\n\n\n\n\n\n      \t\n\n\npatterns\ndecorations.pathreplacing\n\n\n\n\n\n\n\n\nfillbetween\n\ndefinition\ntheoremTheorem\n*theorem*Theorem\nacknowledgementAcknowledgement\n\nassumptionAssumption\naxiomAxiom\ncaseCase\nclaimClaim\nconclusionConclusion\nconditionCondition\nconjectureConjecture\ncorollary[theorem]Corollary\n*corollary*Corollary\ncriterionCriterion\ndefinitionDefinition\n*definition*Definition\nexampleExample\nexerciseExercise\nlemmaLemma\nnotationNotation\nproblemProblem\nproposition[theorem]Proposition\nremarkRemark\nsolutionSolution\nsummarySummary\n\n \n \n\n\n\n\n\n\n\narrows,decorations.markings,arrows.meta\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.5\nḍ\n\nlaw =\nlaw →\nlaw ∼\n ∈_law\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(\n    [\n     \n     \n    \n    \n        ncbar angle/.initial=90,\n        ncbar/.style=\n            to path=()\n            – (()!#1!/tikz/ncbar angle:())\n            – (()!(()!#1!/tikz/ncbar angle:())!/tikz/ncbar angle:())\n            – ()\n        ,\n        ncbar/.default=0.5cm,\n    square left brace/.style=ncbar=0.5cmsquare right brace/.style=ncbar=-0.5cmround left paren/.style=ncbar=0.5cm,out=120,in=-120round right paren/.style=ncbar=0.5cm,out=60,in=-60\n    \n    \n    \n    \n    \n    Composite Sorting\n    12.5pt We thank Carter Braxton, Hector Chade, Rasmus Lentz, Ilse Lindenlaub, Paolo Martellini, Luigi Pistaferri, Tommaso Porzio, Fabien Postel-Vinay, and Alexander Zimin for comments.\n         Job Boerma \n     University of Wisconsin-Madison  \n    \n      Aleh Tsyvinski \n      Yale University \n    \n      Ruodu Wang \n     University of Waterloo \n    \n      Zhenyuan Zhang \n      Stanford University \n    \n    \n        \n     March 2023 \n    \n    =========================================================================================================================================================================================================\n    \n    \n    11.5pt18.0pt We propose a new tractable general framework for sorting – composite sorting.  Composite sorting comprises of (1) distinct workers being assigned to the same job and (2) a given worker type simultaneously being part of both positive and negative sorting. We show that composite sorting generically arises in a class of sorting models when fixed investments can mitigate the variable costs of mismatch. We develop a complete characterization of equilibrium sorting as well as the corresponding equilibrium wages. Wages exhibit a local hierarchical structure meaning the relative wages depend solely on sorting patterns within narrow skill groups. Using this framework, we study within–job wage dispersion and demonstrate that quantitatively composite sorting may explain a sizable portion of wage dispersion within occupations in the United States.\n    \n    \n     JEL-Codes: J01, D31, C78 \n     Keywords: Sorting, Assignment\n    \n    empty11.0pt21.0pt\n    \n    \n    § INTRODUCTION\n     Since <cit.> and <cit.>, sorting\n    models have taken a prominent position in economics. An important\n    insight of this literature is when the output function is supermodular\n    or submodular, sorting is positive or negative, implying that very\n    similar or identical worker types are assigned to the same job type.\n    <cit.>, <cit.>, <cit.>,\n    and <cit.> provide comprehensive reviews of this literature.[<cit.> and <cit.> provide an overview\n    of the significance of assignment models in international trade.]\n    \n    Our paper provides the first complete characterization of optimal\n    sorting and wages in a general sorting model with an output function\n    that is neither supermodular nor submodular. We establish that equilibrium\n    sorting is significantly richer than in the canonical settings yet\n    we characterize it fully. We refer to the sorting pattern that emerges\n    as composite sorting, which has two key features. First, distinct\n    workers are sorted to the same job which enables us to study wage\n    dispersion within jobs. Second, the fact that a given worker type\n    can simultaneously be in both positive and negative sorting allows\n    us to generate intricate sorting patterns to bring to the data. We\n    quantitatively demonstrate our model using American Community Survey\n    data. Our model can explain 32 percent of the overall wage dispersion\n    and about 50 percent of the wage dispersion at the top and the bottom\n    of the wage distribution. In contrast, with either supermodular or\n    submodular costs, the solution is positive or negative one-to-one\n    sorting with no dispersion in wages.[To be precise, wage dispersion in this case can be positive but solely\n    due to the discretization of occupations.]\n    \n    We consider a sorting model with heterogeneous workers and heterogeneous\n    jobs. Mismatch is the difference between the skill of the worker and\n    the difficulty of the job. When the job's difficulty exceeds the worker's\n    skill level, that is, a worker is underqualified, mismatch decreases\n    output. The second type of mismatch (as in <cit.>) arises\n    when the worker's ability surpasses the job's demands, that is, a\n    worker is overqualified, resulting in a utility loss for a worker\n    and a corresponding loss in the joint surplus. Following <cit.>\n    and <cit.>, firms can incur fixed costs\n    to reduce the variable costs of mismatch. Firms thus mitigate the\n    adverse effects of mismatch by investing in technologies or providing\n    amenities. An example is investing in an industrial cobot (collaborative\n    robot) that enhances the output of a low-skill welder. The result\n    of the technology decision is that the effective output function is\n    concave in the extent of underqualification. Similarly, employers\n    may invest in amenities to decrease the disutility of workers (as\n    in <cit.>) when they are overqualified. An example is\n    investing in a premium truck with advanced comfort and drivers support\n    system for a high-skill trucker. The result of investment in amenities\n    is that the effective surplus is concave in the extent of overqualification.\n    In sum, the effective output function is concave in mismatch. The\n    key characteristic of a generic concave function in mismatch is that\n    it is neither supermodular nor submodular. We are able to provide\n    a complete characterization of this general sorting problem with neither\n    supermodular nor submodular costs by analyzing it using the tools\n    of optimal transport theory.\n    \n    \n    \n    We now turn to the main characteristics of an optimal assignment.\n    First, an optimal assignment maximizes the number of perfect pairs,\n    which refer to pairs without mismatch. When mismatch costs are concave,\n    it is preferable to have a combination of one pair with small mismatch\n    and another with significant mismatch, as opposed to having two pairs\n    with moderate mismatch. A combination of a perfect pair and a pair\n    with significant mismatch exemplifies this.\n    \n    \n    \n    The second feature of an optimal assignment is that pairings between\n    workers and jobs do not intersect. Consider workers with low and medium\n    skills {x_L,x_M} and jobs that require high and exceptional\n    skills {z_H,z_E}. Positive sorting assigns the low-skill\n    worker to the high-skill job (x_L,z_H), and a medium-skill\n    worker to the exceptional skill job (x_M,z_E). This results\n    in two medium-size mismatch costs. Visualizing the pairing as arcs\n    connecting a worker with a job reveals that the pairs intersect as\n    in the left panel of  Figure <ref>. For concave costs, in contrast, it\n    is preferable to have one large mismatch (between a low-skill worker\n    and a very high-skill job (x_L,z_E)) and one small mismatch\n    (between a medium-skill worker and a high-skill job (x_M,z_H)).\n    Thus, it is optimal to have pairs that do not intersect as in the\n    right panel of  Figure <ref>.\n    \n    This principle of no intersecting pairs gives rise to two additional characteristics\n    of an optimal assignment. First, the assignment problem can be decomposed\n    into independent problems by a layer mechanism. Layers are constructed by first designing a measure of underqualification that evaluates the cumulative deficiency of worker skills compared to the cumulative demands of jobs at a given skill level. A layer contains all the workers and\n    jobs in a particular slice of this measure of underqualification.\n    An assignment in each layer optimally pairs workers and jobs within\n    a given slice, regardless of all workers and jobs in other layers.\n    The full optimal assignment combines the independent optimal assignments\n    in each layer. Second, we characterize an optimal assignment within\n    a given layer by formulating a Bellman equation. By leveraging the property of \n    no intersecting pairs, it is straightforward to construct\n    this recursive characterization. \n    \n    \n    The main result of our paper is composite sorting – the optimal\n    assignment sorts identical workers into different jobs, some positively\n    and some negatively. The intuition for composite sorting can be described\n    through an example. Suppose a low worker-job group {x_L,z_L}\n    is far from a high worker-job group {x_H,z_H} as in the top\n    panel of Figure <ref>. When there is a significant gap between the groups,\n    workers are optimally assigned to jobs within their skill groups resulting\n    in two pairs (x_L,z_L) and (x_H,z_H). This results in\n    two small mismatches and positive sorting. Suppose one identical low-skill\n    worker x_L and one identical high-skill job z_H as\n    well a medium-skill worker-job group {x_M,z_M} are added\n    as in the bottom panel of  Figure <ref>. Adding an identical low-skill\n    worker and an identical high-skill job does not allow to reduce the\n    initial mismatched pairs (x_L,z_L) and (x_H,z_H), and\n    so the added low-skill worker is assigned to the added high-skill\n    job forming a pair (x_L,z_H). The medium worker-job group {x_M,z_M}\n    can, in principle, be used to rematch the added low-skill worker and\n    the added high-skill job with the medium-skill job and worker forming\n    pairs (x_L,z_M) and (x_M,z_H).  However, such rematching\n    is not optimal, because due to concavity of the costs, two medium mismatches\n    (x_L,z_M) and (x_M,z_H) are worse than one small mismatch\n    within the medium-skill group (x_M,z_M) and one large mismatch\n    for (x_L,z_H). As a result, the medium-skill group is paired\n    together and this results in the negative sorting for the added group.\n    We emphasize that the optimal assignment sorts the same worker type\n    to very different jobs, with some positive and some negative sorting.\n    The low-skill worker x_L is paired positively with the low-skill\n    job z_L (as a part of the sorting (x_L,z_L) and (x_H,z_H))\n    but the same worker type is also paired negatively to the distant\n    high-skill job z_H as a part of the sorting ((x_L,z_H)\n    and (x_M,z_M)). Thus, the optimal full assignment is not one-to-one\n    because the same worker type is assigned to different jobs as a part\n    of simultaneously positive and negative sorting. The problem thus\n    delivers composite sorting.\n    \n    For general distributions, composite sorting may be very rich with\n    very distinct worker types being assigned to the same job and may\n    exhibit various local and global intervals of positive and negative\n    sorting. Our theory offers a complete characterization of composite\n    sorting.\n    \n    We determine equilibrium wages and firm values by characterizing the\n    solution to the dual planning problem. Our contribution here is to\n    characterize the dual for mismatched workers and jobs by demonstrating\n    that the shadow cost of mismatch exhibits a local hierarchical structure.\n    For a given skill group, the relative wages are determined locally,\n    that is, they depend only on information within the narrowly defined\n    local skill group and do not depend on any other groups or skills.\n    The hierarchical structure aggregates the local relative wages to\n    the wages for the larger groups preserving the relative wages implied\n    by the local structure. Finally, we extend the construction of the\n    wages and the firm values to perfectly paired workers.\n    \n    Having characterized the equilibrium theoretically, we quantitatively\n    illustrate the theory. An important implication of our results is\n    frictionless wage dispersion within jobs. We investigate to what extent\n    our model can generate qualitative and quantitative patterns of wage\n    dispersion within 497 occupations in the American Community Survey\n    between 2010 and 2017.\n    \n    We find that the model can deliver sizable wage dispersion within\n    occupations with high and low mean wages. Composite sorting can\n    account for 46 percent of wage dispersion within jobs at the bottom\n    of the distribution, and 58 percent at the top. At the top, a high-skill\n    surgeon performs the same job as a lower-skill surgeon assisted by\n    a robotic surgical system. This leads to a wide range of salaries\n    within the occupation, encompassing both low- and high-skill surgeons.\n    A similar pattern holds at the bottom of the distribution. The model\n    can account for 19 percent of the wage dispersion in the middle of\n    the distribution. The main reason is that the log-wage profile\n    is relatively flat in this range and, even though there may be substantial\n    skill dispersion within a particular occupation, it does not give\n    rise to substantial wage dispersion. Overall, composite sorting\n    accounts for 32 percent of the wage dispersion in the sample. In contrast,\n    one-to-one sorting models (such as models with positive or negative\n    sorting arising from submodular or supermodular costs) would deliver\n    no wage dispersion within jobs.\n    \n    \n    \n    Literature. We now briefly discuss additional relevant literature. <cit.>\n    study sorting of heterogeneous workers with a form of technology\n    choice where there is selection in managerial and worker roles.  <cit.>\n    uses optimal transport to extend their framework with a continuous\n    technological investment choice for each worker and manager which\n    scales the strength of the complementary between them. <cit.>\n    depart from focusing on the conditions for assortative matching by\n    developing comparative statics predictions for the sorting patterns\n    without having to solve for optimal sorting. <cit.>\n    empirically document the patterns on non-assortative pairing in wealth. Another recent development\n    in the sorting literature is to study assignment models with multiple\n    agents combined together (<cit.>, <cit.>,\n    <cit.>, and <cit.>).\n    \n    Another general alternative that results in imperfect assortative\n    matching is the search and matching literature (for example, <cit.>,\n    <cit.>, <cit.>, <cit.>,\n    <cit.>, <cit.>). Specifically, this approach\n    generates wage dispersion within jobs due to the search frictions.\n    Our work instead generates wage dispersion solely due to sorting in\n    a frictionless environment. \n    \n    Our paper uses results from the optimal transport\n    literature (see <cit.> for a comprehensive overview\n    of applications of optimal transport theory to solve economic problems) and, more specifically, from the literature with concave distance costs started by <cit.> and <cit.>.\n    In the optimal transport literature the idea of the perfect pairs\n    is referred to as “mass stays in place if it can” (<cit.>). <cit.> states that the non-intersecting rule first appears in <cit.>. This non-intersecting property\n    is central to the literature on optimal transport with concave distance costs\n     as well as to algorithmic sorting problems with distance costs\n    (<cit.>). <cit.>\n    proposed the first combinatorial algorithm that can be used to solve\n    for an optimal assignment within a layer when the cost of mismatch\n    is linear. The Bellman equation in our papers adopts a recursive\n    algorithm developed by <cit.>, designed to model statistical\n    properties of polymer chains. The idea of layering was  introduced\n    in <cit.>. Their work also develops a more computationally\n    efficient version of the Bellman equation building on <cit.>.\n    We provide a novel, concise proof of this more efficient Bellman equation. Our construction of the dual solution and characterization of its local hierarchical structure are also mathematical contributions within the optimal transport literature.\n    \n    \n    \n    § MODEL\n    \n    \n    We study an environment in which workers with heterogeneous skills sort into heterogeneous jobs, where the mismatch between their skills and the job difficulty leads to output losses. Firms reduce the extent to which mismatch penalizes surplus by reducing variable mismatch costs with fixed cost investments. \n    \n    \n    \n     §.§ Environment\n    \n    \n    The economy is populated by risk-neutral workers\n    and jobs. The workers differ in their skills which are indexed by\n    a real number x∈ X⊆ℝ. The set of worker skills\n    X contains a finite number n of types x_1<x_2<…<x_n.\n    Workers are distributed according to the cumulative distribution function\n    F(x).\n    \n    Jobs differ in their difficulty which is indexed by a real number\n    z∈ Z⊆ℝ. The set of job intensities Z contains\n    a finite number m of types z_1<z_2<…<z_m. Jobs\n    are distributed according to cumulative distribution function G(z).\n    Both the worker and the job distributions have finite support.\n    \n    \n    Technology. Firms produce a single good. Production requires\n    one worker for each job. A firm with a job z that employs\n    a worker with skill x produces output according to\n    \n        p(x,z)= g(x) + h(z) -γ_pmax( z-x,0),\n    \n    with γ_p≥0. There are three terms in this technology specification. The first term h(z) where h'(z)>0 reflects that a more difficult job z produces more output and is thus more valuable, independent of the worker that fulfills the job. The second term g(x) with g'(x)>0 reflects that a more skilled worker contributes more to production, independent of the job performed. The third term γ_pmax(z-x,0) captures the idea that a worker with a skill x that is lower than the job demand z causes a loss of output.  It is costly to have workers perform tasks for which they have limited talent.\n    \n    \n    Preferences. The utility of a worker x working a\n    job  z earning wage w is given by w-κ(x,z), where κ(x,z)\n    is the disutility from work which depends on the worker-job pair. Following <cit.>, disutility from work is  positive when the worker is overqualified for the job. We assume the utility cost of being overqualified is given by κ(x,z)=γ_κmax(x-z,0), where the parameter γ_κ≥ 0. The specification of the disutility cost function parallels the one we use to capture the output loss due to inadequacy of worker skills compared to the job difficulties in the production function (<ref>). The difference between these specifications\n    is governed by the parameters γ_p and γ_κ.\n    The utility cost of being overqualified introduces an excess of skills\n    to cause a loss of joint surplus without causing a loss of output. In equilibrium,\n    overqualified workers are compensated for their utility cost, and therefore are paid\n    more in a given job than workers whose skills exactly match the job’s\n    difficulties (as in <cit.>).\n    \n    \n    Technology Choice. Mismatch is the distance between worker x and job z. The environment so far assumes that the costs of mismatch are exogenous. We now endogenize the cost of mismatch. A firm can reduce the exogenous cost of mismatch by making a fixed investment. In case a worker is underqualified, the firm can make technology investments to reduce the cost of mismatch in output. When workers are overqualified they experience a disutility cost which can be reduced by providing amenities. The main insight of <cit.> and <cit.> for our setting is that the technology selection results in an output function with a concave cost of mismatch. We proceed to formally define these technology choices. \n    \n    We model technology choice as a firm making fixed investments (for example, by purchasing better equipment) to reduce variable costs associated with mistakes and delays caused by underqualified workers. Specifically, firms choose the variable\n    cost γ_p of production mismatch, which comes at an associated\n    fixed cost Ψ_p(γ_p). By decreasing the variable costs\n    γ_p, the firm increases its fixed costs, or Ψ_p'<0,\n    where Ψ_p”>0. To highlight the key forces that arise by introducing technology selection into the assignment model, we use the specification Ψ_p(γ_p)=B_p/η_pγ_p^-η_p, where parameters B_p and η_p are both strictly positive.[We generalize our approach to any convex cost function in the Technical Appendix.] The effective output created by worker x on job z > x is then: \n    \n        y(x,z)=max_γ_p≥ 0  g(x) + h(z) -γ_p(z-x)-B_p/η_pγ_p^-η_p.\n    \n    A firm makes a technology investment when a worker is underqualified to fulfill the job, when x<z. The extent of investment increases in the distance between the worker skill and the job difficulty. Using the first-order condition, the optimal technology choice is γ_p=(z-x/B_p)^-1/1+η_p. Firms choose\n    a low variable cost of production mismatch if the worker is less qualified,\n    that is, when the distance between skills and demands (z-x)\n    is large, or if the cost of technology investment B_p is low.\n    \n    The effective output of worker x in job z is, using the technology investment decision, given by: \n    \n        y(x,z)= g(x) + h(z) -ρ_p(z-x)^ζ_p\n    \n    for underqualified workers x<z, with implied parameters ζ_p=η_p/1+η_p∈(0,1)\n    and ρ_p=B_p^1/1+η_p/ζ_p. The distinctive\n    feature of this function is that the effective output is concave in\n    the distance between worker skill and job difficulty. The technology\n    choice transforms a production function with linear mismatch costs\n    into an effective output function with strictly concave mismatch costs.\n    \n    Firms can similarly reduce the extent to which overqualificaton penalizes worker utility by providing amenities. We model amenities analogously to technology choice.[Alternative frameworks that incorporate the decision to provide amenities are presented in <cit.>, <cit.>, and <cit.>.] If workers are underqualified, x<z, their employers want to  invest in technology so that the costs of having underqualified employees are reduced. Similarly, when workers are overqualified, x>z, their employers want to invest in amenities  to lower the disutility from working. Firms choose the variable disutility cost due to mismatch γ_κ at an associate fixed cost Ψ_κ(γ_κ)=B_κ/η_κγ_κ^-η_κ. The optimal provision of amenities\n    is thus characterized by γ_κ=(x-z/B_κ)^-1/1+η_κ.\n    Amenities increase with worker skills and decrease with the cost of\n    providing amenities, B_ψ. As a result, the effective output\n    of overqualified workers is y(x,z)=g(x) + h(z) -ρ_κ(z-x)^ζ_κ. \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Effective Output. We can write the effective output of overqualified and underqualified workers as: \n    \n        y(x,z)=g(x) + h(z)-ρ_p(z-x)^ζ_p if z≥ x\n        ρ_κ(x-z)^ζ_κ if z<x,\n    \n    where ζ_p and ζ_κ are strictly positive and strictly less than one. We use effective output  function (<ref>) to define the cost of mismatch between worker x and job z as c(x,z) = g(x) + h(z) - y(x,z), or\n        c(x,z) =ρ_p (z-x )^ζ_p if z≥ x\n        ρ_κ (x-z)^ζ_κ if z<x,\n     that is, maximal output of worker x and job z minus effective output y(x,z). Thus, the sections above give a microfoundation for a mismatch cost function that is concave in the discrepancy between worker x and job z. We plot the mismatch cost function in Figure <ref>. \n    \n    \n    \n    \n    \n    The key observation is that the effective output function is neither supermodular nor submodular. For both z>x and z<x, the cross-derivatives of the output function are negative. If the cross-derivative is negative for all (x,z) the production function is submodular. To see that our production function is not submodular, consider pairs (a,b) and (b,a) such that b>a. Pairing worker a positively with job a and worker b with job b gives zero mismatch. The original configuration (a,b) and (b,a), however, has mismatch and hence has lower output than the combination of (a,a) and (b,b). Submodularity, however, requires that the combined output of (a,b) and (b,a) is higher than the combined output of (a,a) and (b,b). Thus, the output function is not submodular. In sum, even though the cross-derivative is negative for all z>x and z<x, the output function is neither supermodular nor submodular. \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Assignment. An assignment pairs workers and jobs. Formally,\n    an assignment is a probability measure π over workers and jobs.\n    Given a worker distribution F and a distribution of jobs G,\n    the set of feasible assignment functions is Π:=Π(F,G) which\n    is the set of probability measures on the product space X× Z\n    such that the marginal distributions of π onto X and Z\n    are F and G. For an assignment π, we denote the support of this assignment by Γ_π={(x,z):π({(x,z)})>0}⊆^2. Feasibility of an assignment function is equivalent\n    to labor market clearing; that is, all workers and jobs are sorted. \n    \n    \n    \n     §.§ Equilibrium\n    \n    \n    To define an equilibrium for our economy, we first specify the firm and worker problem. A firm with job z employs worker x to maximize profits taking the wage schedule w as given. The firm problem is: \n    \n        v(z)=max_x ∈ X y(x,z)-w(x).\n    \n    Taking firm compensation v as given, worker x chooses to fulfill job z to maximize their wage income: \n    \n        w(x)=max_z ∈ Z y(x,z)-v(z).\n    \n    An equilibrium is a wage schedule w, firm value function v, and feasible assignment function π, such that firms solve their profit maximization problem (<ref>), workers solve the worker problem (<ref>), and a feasibility constraint is satisfied, ∫ y(x,z )  dπ = ∫ w(x)  d F + ∫ v(z)  d G, which states that the total quantity of output produced, ∫ y(x,z ) dπ, equals the total quantity of output distributed to workers and jobs.\n    \n    \n    \n     §.§ Planning Problem\n    \n    \n    We solve a planning problem to characterize the equilibrium assignment.\n    The planning problem is to choose an assignment to maximize aggregate\n    output: \n    \n        max_π∈Π∫ y(x,z) dπ\n    \n    The planning problem to maximize output is equivalent, in terms of\n    choosing an optimal assignment, to a planning problem that minimizes\n    the cost of mismatch. When we characterize the optimal assignment, we can thus equivalently represent the planning problem as: \n    \n        min_π∈Π ∫ c(x,z) dπ,\n    where c(x,z) represents the cost of mismatch  (<ref>). This is an optimal transport problem in the formulation of <cit.> with the cost function that is neither supermodular nor submodular.\n    \n    \n    Dual Problem. The solution to the planning problem is an\n    assignment, which we argue is an equilibrium assignment. To obtain\n    the equilibrium wage schedule and firm value function, we solve a\n    dual problem. The dual formulation for the assignment planning problem\n    is to choose functions w and v that solve: \n    \n        min ∫ w(x) dF+∫ v(z) dG,\n    \n    subject to the constraint w(x)+v(z)≥ y(x,z) for any (x,z)∈ X× Z. The Monge-Kantorovich duality states that the values from (<ref>) and (<ref>) are the same, or max_π∈Π∫ y(x,z) dπ= min∫ w(x)  dF+∫ v(z) dG. In Appendix <ref>, we prove the following relation between the primal and dual solutions.\n    \n    \n    Suppose we have some assignment π∈Π and some functions w and v such that w(x)+v(z)≥ y(x,z) for any (x,z)∈ X× Z and that w(x)+v(z)= y(x,z) for any (x,z)∈Γ_π, then assignment π is an optimal assignment and (w,v) is an optimal dual pair.    \n    \n    \n    § OPTIMAL SORTING\n     We now characterize an optimal assignment of workers to jobs. A necessary condition for an optimal assignment is that aggregate output does not increase by a bilateral exchange of workers between jobs. For any two pairs in an optimal assignment (x,z) and (x̂,ẑ), the following inequality should be satisfied:[This is an instance of the notion of cyclical monotonicity (see, e.g., Definition 1.36 in <cit.>).]\n        y(x,z)+y(x̂,ẑ)≥ y(x,ẑ)+y(x,ẑ).\n    \n    We next use this optimality condition to demonstrate the main features of an optimal assignment.\n    \n    \n    Maximal Number of Perfect Pairs. An optimal assignment maximizes\n    the number of pairs that are perfectly sorted, i.e., the number of\n    pairs with zero cost of mismatch between workers and jobs, or x=z. In other words, whenever feasible, an optimal assignment assigns worker x to job z=x. \n    \n    \n    \n    The rationale for why an optimal assignment maximizes the number of perfect pairs is as follows. When mismatch costs are concave, it is preferable to have a pair with small mismatch and a pair with significant mismatch than to have two pairs with moderate mismatch. A perfect pair is a demonstration of this concept since it has zero mismatch. Specifically, let an optimal assignment contain pairs (x,z) and (x',z') but x'=z where x and z' do not equal z.  Suppose x<x'=z<z', that is, the value z=x' is in between the values x and z. The original cost of mismatch is two medium-size mismatches in pairs (x,z) and (x',z'). Consider reshuffling to form a perfect pair (x',z) and the remaining pairing (x,z'). The cost of the mismatch of the reshuffled pairs is that of a large mismatch (x,z') and a zero mismatch for the perfect pair (x',z). By concavity of the costs, this is lower than two medium-size mismatches.[A strictly convex cost of mismatch implies that the optimal sorting is positive which, in general, conflicts with maximal perfect pairing.]\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n       \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n     \n    \n    \n    The output loss due to mismatch is strictly reduced by assigning worker x to job z' and by perfectly assigning worker x' to job z, which contradicts the optimality condition (<ref>). We\n    summarize this idea in Lemma <ref>.\n    \n     Maximal Perfect Pairs.\n    Let F∧ G denote the common component of the worker distribution\n    F and the job distribution G. Any optimal assignment π\n    between workers consists of perfect pairings on the support of F∧ G\n    and an optimal assignment between workers F-F∧ G and jobs\n    G-F∧ G.  We present a proof in Appendix <ref>. \n    \n    Lemma <ref> shows that workers and jobs which are part\n    of the common component are positively sorted. Since workers in the\n    common component are perfectly paired, better workers are paired with\n    better jobs. Lemma <ref> implies that in analyzing the sorting problem\n    between the remaining workers and jobs we can restrict attention to\n    assignments between worker and job distributions where the common parts of the distributions are removed. For brevity, we label the remaining worker distribution F and the remaining job distribution G. \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    No Intersecting Pairs. The second feature of an optimal\n    assignment is that pairings between workers and jobs do not intersect. Consider pairs (x,z) and (x',z') and illustrate their pairings by arcs. In Figure <ref>\n    we show intersecting and non-intersecting pairs. The left\n    panel shows an example of intersecting pairs as the arcs of pairs\n    (x,z) and (x',z') intersect. The right panel shows an example\n    of non-intersecting pairs as the arcs corresponding to pairs (x,z)\n    and (x',z') do not intersect. We say that the arcs (x,z)\n    and (x',z') do not intersect if and only if the intervals (x,z)\n    and (x',z') are either disjoint or one interval is a subset of\n    the other interval.[When referring to an interval (x,z), we do not require that the\n    worker skills and job difficulties are ordered: we mean\n    the set of real numbers lying between z and x on the real line.] Lemma <ref> establishes that under an optimal assignment arcs never intersect.\n    \n    No Intersecting Pairs. \n    Let π be an optimal assignment. For any two pairs (x,z) and\n    (x',z') in the support Γ_π, their arcs do not intersect.\n     The proof is in Appendix <ref> and we now outline the main idea.\n    \n    We prove Lemma <ref> by considering the two\n    unique configurations with intersecting pairs.[There are six distinct orderings of workers x's (white circles)\n    and jobs z's (black dots) to consider, which can be represented\n    as: \n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    .\n    The first four configurations do not contain any intersections. The\n    final two scenarios are discussed in the main text.] The first configuration is x<z'<z<x'. Since the mismatch cost\n    increases in the distance between worker and job, an improvement is\n    to instead pair the closer points (x,z') and (x',z) as it reduces\n    the mismatch cost for each worker and hence the total mismatch costs.\n    The second configuration is x<x'<z<z'. In this case, we utilize\n    the concavity of the cost of mismatch to obtain a contradiction to the optimality condition (<ref>). We\n    reshuffle so that we have one large mismatch (x,z')\n    and one small mismatch (x',z). By concavity, the cost of this is\n    smaller than two medium-size mismatches. The output loss due to mismatch\n    strictly reduces by assigning worker x to job z' and worker\n    x' to job z, which contradicts the optimality condition (<ref>).\n    \n    \n    Layering. The observation that an optimal assignment does not contain intersections\n    enables us to next show that the optimal assignment problem\n    can be decomposed into a series of independent problems.\n    \n    To see how the assignment problem is decomposed into different layers,\n    let H be the difference between the cumulative distribution function\n    of workers F and the cumulative distribution function of jobs G.\n    The measure of underqualification H measures\n    the extent to which workers up to skill level s outweigh the jobs\n    requiring skill levels up to s since H(s):=F(s)-G(s).\n    \n    \n    \n    Figure <ref> illustrates the measure of underqualification. The top panel gives an example of the worker distribution F and the job distribution G. Distribution F has one worker at skill level s_1 and four workers at skill level s_3.\n    Distribution G has two jobs each at skill level s_2 and s_5\n    and a single job at s_4. The underqualification measure between\n    s_1 and s_2 is H=1/5 as there is one worker at\n    s_1 and no jobs less than s_2. Between s_2 and s_3,\n    the underqualification measure is H=-1/5 as there are two\n    jobs and only one worker compared to level s_3.\n    The similar intuition holds for the other points yielding the\n    measure of underqualification H∈{a_v}_v=0^4={-1/5,0,1/5,2/5,3/5}\n    at skill levels {s_i}_i=1^5. Generally, an underqualification\n    measure has jumps at a finite number of skill levels {s_i}\n    and takes a finite number of values in {a_0,a_1,…,a_L}\n    if the distributions of workers and jobs are discrete.\n    \n    To illustrate the construction of layers we plot the blue dashed lines\n    which indicate the different values of the measure of underqualification in the bottom panel of Figure <ref>.\n    Layers are thus confined between two successive blue lines. For example,\n    the top layer (between a_3=2/5 and a_4=3/5)\n    contains a worker at skill level s_3 and a job at skill level\n    s_4. Similarly, the layer between a_1=0 and a_2=1/5\n    consists of one worker each at skill levels s_1 and s_3,\n    and one job each at skill levels s_2 and s_5.\n    \n    We observe that each layer consists of an alternating configuration of workers\n    and jobs, that is, either x_1<z_1<x_2<z_2<…< x_n<z_n or z_1<x_1<z_2<x_2 <… <z_n<x_n. We define an alternating assignment problem as an assignment\n    problem between n workers and n jobs. \n    Workers and jobs are arranged in increasing order, and alternating\n    such that every worker skill level is followed by a job difficulty level, except for the last one. Let F_ℓ and G_ℓ be the measure of the workers and the jobs in each layer.[The formal definition is given with the proof in Appendix <ref>.] \n    \n    \n    \n    \n    After providing a decomposition into layers with alternating configurations,\n    Lemma <ref> shows how to solve the full assignment problem using the solutions to the assignment problem\n    within each layer.\n    \n    Layering. Let π_ℓ\n    be an optimal assignment between the worker distribution F_ℓ and the job distribution G_ℓ\n    for the layer ℓ∈{1,…,L}. Then, an optimal assignment\n    between workers F and jobs G is their sum, π:=∑_ℓπ_ℓ.\n     This result is proved in Appendix <ref>.\n    \n    Lemma <ref> shows that an optimal assignment between workers\n    and jobs is equal to the sum of optimal assignments in each layer.\n    This observation breaks the original problem down into L independent problems.\n    In each of the layers, there is an alternating configuration of workers\n    and jobs. We use this observation to characterize an optimal assignment\n    for our full problem by aggregating the solutions to the assignment\n    problems for each layer.\n    \n    \n    \n    The intuition for Lemma <ref> is illustrated in Figure <ref> for the case where all points have equal weight. Let us consider two points x_0 and z_0 that are matched under an optimal assignment depicted by a solid arc. There is the same number of workers and jobs between these two points. Suppose that instead there exists at least one worker or a job that needs to be paired with a job or worker outside of this range. In the figure, worker x_1 does not have a pair in the interval between x_0 and z_0 and has to be connected by a dashed arc. This dashed arc intersects the solid arc (x_0,z_0) which contradicts the no-intersecting pairs principle in Lemma <ref>. \n    \n    \n    Sorting Within a Layer. By leveraging the property of  no intersecting pairs, it becomes straightforward to construct a recursive characterization for an optimal assignment within a particular layer. In particular, for each layer, we adopt the recursive algorithm developed by <cit.>, designed to model statistical properties of polymer chains. The complete optimal solution is then obtained by combining the optimal solutions of each individual layer. \n    \n    The optimal assignment problem for a given layer is\n    an alternating assignment problem. An optimal  assignment within a layer   matches one worker with precisely one job.[An equivalent form of Birkhoff's Theorem <cit.> states that for this setting, the set of Kantorovich transport plans is precisely  that of  mixtures of one-to-one transport maps. Since the cost is linear with respect to mixtures, there exists a one-to-one optimal assignment.] For notational convenience, we\n    order workers and jobs within each layer by their skill levels. Let there be n workers and n jobs in a given layer, and we denote the skill levels by s_1<s_2<…<s_2n-1<s_2n.\n    \n    \n    \n    We employ a Bellman equation to calculate the minimum total cost of\n    mismatch. Rather than using a Bellman equation to solve a dynamic\n    program, we apply the Bellman equation to solve a static assignment\n    program. The dynamic component of the Bellman equation is that\n    we consider assignment problems with an increasing number of skill levels.\n    We start by solving all assignment problems between  two consecutive\n    elements – the assignment problem between one worker and\n    one job. That is, we consider assignments between skill levels\n    s_i and s_i+1, for each i. Using the solutions from the\n    previous step, we proceed to solve all assignment problems between four consecutive elements (two workers and two jobs). That is, we solve for an optimal assignment\n    between s_i,s_i+1,s_i+2,s_i+3, for each i.  Then we consider all optimal\n    assignment problems between three workers and three jobs. We continue\n    increasing the size of the optimal assignment problem until we\n    solve the assignment problem between n workers and n jobs,\n    which is the original alternating assignment problem for the layer.\n    \n    By the property of no intersecting pairs, the formulation of the Bellman equation directly arises. We denote the minimum cost of mismatch when sorting all workers\n    and jobs with skill levels between s_i and s_j by the value\n    V_i,j, where j>i. The difference j-i has to be odd so that\n    there are equal numbers of workers and jobs between s_i and s_j.\n    Considering an optimal assignment of workers and jobs with skill levels\n    in [s_i,s_j], the planner can pair the leftmost s_i with\n    any  s_k such that k-i is odd. Upon pairing\n    s_i with  s_k, the planner remains to optimally pair the\n    other workers and jobs  in [s_i+1,s_k-1], and all workers and\n    jobs with skill levels in [s_k+1,s_j]. There are no pairings\n    between these two segments because this violates the \n    property of no intersecting pairs. In this way, we can use results from previous steps of assignment\n    and thus obtain a Bellman equation: \n    \n        V_i,j=min_k∈{i+1,i+3,…,j} ( c(s_i,s_k)+V_i+1,k-1+V_k+1,j)\n    \n    with boundary conditions V_i+1,i=0 for all i.[The boundary conditions are invoked at either end of the choice interval.\n    When k=i+1, the minimum cost of mismatch is c(s_i,s_i+1)+V_i+2,j,\n    the cost of pairing the first worker to the first job, together with\n    optimally sorting all skill levels from s_i+2 to s_j. When\n    k=j, the minimum cost is c(s_i,s_j)+V_j+1,j-1, the cost\n    of pairing the first worker to the last job, together with optimally\n    matching all intermediate skill levels between s_i+1 and s_j-1.\n    \n    The boundary conditions are also used when j-i=1, in which case\n    there is a unique choice necessarily at the bounds of the choice set.\n    This is an important step, as the Bellman equation (<ref>)\n    is solved by induction over all j-i odd, starting with j-1=1.]\n    \n    Once the Bellman equation (<ref>) is solved, we construct an optimal assignment. Starting from V_1,2n_ℓ, the optimal pairing of skill s_1 is given by skill s_k that solves equation (<ref>). Then two corresponding continuation values, V_2,k-1 and V_k+1,2n_ℓ, are evaluated to determine optimal pairings for skill s_2 and for skill s_k+1, respectively. This process of finding an optimal assignment continues recursively until the full assignment is constructed. \n    \n    Our three-step approach to characterizing the optimal sorting is as follows. First, we maximize perfect pairs. This always leads to positive sorting between identical workers and jobs and enables us to withdraw them from further analysis. Second, we construct a measure of underqualification to decompose the assignment problem into a sequence of independent problems – layers. Third, we characterize an optimal assignment for each layer  using the Bellman algorithm. The optimal allocation is thus given by the following proposition.\n    \n     An optimal assignment between\n    workers F and jobs G sums an optimal assignment in each layer,\n    where the optimal assignment in each layer attains V_1,2n_ℓ\n    in the Bellman equation (<ref>). \n     In Appendix <ref>, we introduce a novel, more concise proof of a computationally efficient version of the Bellman equation in <cit.>. Our proof also applies in the case of asymmetric cost functions that we consider. \n    \n    In Appendix <ref>, we derive an additional explicit optimal sorting when the mismatch power indices ζ_p and ζ_κ are close to one. Specifically, we show that the optimal assignment within each layer is positive. The implication is that for mismatch power indices close to one, the solution can be directly constructed by constructing the measure of underqualification, and constructing the positive sorting by layer. <cit.> shows that this layered positive assignment is the limit of some optimal assignments as ζ→ 1^-. Our results proves the existence of a threshold beyond which the layered positive assignment is optimal for our environment and is thus applicable away from the limit.\n    \n    \n    \n    \n    § EXAMPLES\n    \n    \n    Having described how to characterize the optimal sorting, we illustrate\n    various elements of composite sorting through examples.\n    \n    \n    Positive and Negative Sorting.  Our assignment problem,\n    which features neither a supermodular nor a submodular output function,\n    can deliver simultaneously positive and negative sorting. Importantly, the  sorting pattern, rather than being dictated by the shape of the production function alone as in the classic optimal assignment problems,  depends on the  distributions of worker skills and job difficulties.\n    \n    To see that an optimal assignment can feature both positively and negatively assorted pairings and sort identical workers into different jobs, consider an assignment problem with two workers and two jobs. Worker skills are given by x_L and x_H and jobs are given by\n    z_L and z_H satisfying x_L<z_L<x_H<z_H. Let\n    the absolute distance between x_i and z_j be d_ij:=|x_i-z_j|.\n    \n    \n    \n    \n    To explain the presence of positive sorting, consider the following\n    configuration of distances: d_LL^ζ+d_HH^ζ≤ d_LH^ζ+d_HL^ζ  with the specific cost function c(x,z) = |x-z|^ζ with ζ∈ (0,1). This case is presented\n    in the top panel of Figure <ref>, where the workers are\n    given by circles and the jobs are given by dots. \n    The low-skill worker x_L and the low-skill job z_L as well\n    as the high-skill worker x_H and the high-skill job z_H\n    are very close to each other, while the skill gap between the\n    low-skill job z_L and high-skill worker x_H is large. In\n    this case, it is optimal for the low-skill worker to fulfill the low\n    skill job and for the high-skill worker to fulfill the high-skill\n    job and, hence, the optimal assignment is positive. The optimal\n    assignment is visualized using an arrow between the low-skill worker\n    and low-skill job, and an arrow between the high-skill worker and\n    high-skill job. In other words, when there are worker-job skill groups that are far apart, it is optimal to sort within groups.\n    \n    To explain the presence of negative sorting, consider the opposite\n    configuration of distances where d_LL^ζ+d_HH^ζ>d_LH^ζ+d_HL^ζ.\n    In this case, the high-skill worker and the low-skill job are close\n    to each other, while the distance between the low-skill worker and\n    the low-skill job as well as the distance between the high-skill worker\n    and the high-skill job is relatively large. Since the mismatch\n    cost is concave in the distance between the worker skills and the\n    job demands, it is optimal to pair the high-skill worker with\n    the low-skill job since having one small mismatch and one large\n    mismatch is better than having two medium-sized mismatches. This case is\n    presented in the middle panel of Figure <ref>.\n    \n    To see that an  assignment between workers and jobs may simultaneously\n    feature positive and negative sorting, we combine the two prior cases. This case is displayed in the bottom panel\n    of Figure <ref>. The assignment problem features four\n    workers (circles) and four jobs (dots). In this case, we first split\n    the assignment problem into layers. The top layer contains the worker\n    and job types that we considered in the top panel, implying that\n    their optimal sorting is positive. Turning to\n    the bottom layer, we see that the worker and job types in the bottom\n    layer are given by the worker and job types that we considered in\n    the middle panel, which implies that their optimal sorting is negative. By Lemma <ref>, a sum of optimal assignments of each\n    of the two layers is optimal for the combined problem. In conclusion,\n    the equilibrium assignment simultaneously features positive and negative\n    sorting.\n    \n    We emphasize the optimal assignment not only features positive and\n    negative sorting simultaneously but also assigns the same worker\n    type to distant job types, and thus delivers the two defining features of composite sorting. Consider the bottom panel\n    in Figure <ref>. The low-skill worker is paired positively\n    with the low-skill job (dashed arc), but the same worker type is also\n    paired negatively with the very distant high-skill job (dashed dotted\n    arc). While the optimal assignment within each layer is a one-to-one\n    assignment, the full optimal assignment is not one-to-one because the same worker type is assigned to different jobs in different layers. Thus, sorting is composite – an identical worker type is assigned to multiple job types as part of both positive and negative pairings.[In equilibrium, workers of a type x that is assigned to multiple job types are indifferent between these job types since the worker receives identical compensation w(x).]\n    Reflecting Binomial Distributions. To illustrate layering, we consider the following example.  Let the skill levels be given by {0,1,2,3,4}, the numbers of workers with these skill\n    levels are given by {16,32,24,8,1}, and the numbers of jobs with these skill levels are given by {1,8,24,32,16}. This corresponds to an economy where both worker skills and job difficulties are distributed\n    following binomial distributions, where we denote the worker skill\n    distribution by B(n,p) and the job distribution by B(n,1-p)\n    with n=4 and p=1/3. In this case, the two binomial distributions are called reflecting\n    as they have parameters p and 1-p.\n    \n    We determine the solution to this sorting problem using the theory in Section <ref>. The first step is to maximize the number of perfect pairs. At skill level 0, there are 1 job and 16 workers. We perfectly pair this job with one of these 16 workers. Analogously, we perfectly pair {8,24,8,1} workers at each skill level in {1,2,3,4}. After maximizing perfect pairings, we are left with 15 workers of skill level 0 and 24 workers of skill level 1 together with 24 remaining jobs of skill level 3, and 15 jobs of skill level 4.\n    \n    Next, we apply the layer analysis to the remaining workers and jobs. The difference between the worker and job distribution, the measure of underqualification, is presented in the top panel of Figure <ref>. In this case, we split the assignment problem into two layers. The top layer consists of 24 workers (39-15) of skill level 1 and 24 jobs of skill level 3. The bottom layer consists of 15 workers of skill level 0 and 15 jobs of skill level 4. Within each layer there is only one feasible sorting. Across the layers, there is negative sorting, meaning that the best job is paired with the worst worker (bottom layer) and the worst job is paired with the top remaining worker (top layer).  This negative sorting pattern within each layer is represented by the top two arcs in the bottom panel of Figure <ref>. The circular arcs in the bottom of the second panel of Figure <ref> represent the optimal perfect pairing between workers and jobs to the extent that their distributions overlap. \n    \n    Summarizing, the assignment problem with these reflecting binomial distributions simultaneously features both positive and negative sorting. Furthermore, we note that, as in the first example, the same job type is assigned to distinct worker types. For example, among the 32 jobs with skill level 3, 8 of them are matched perfectly with workers of skill level 3, while 24 of them are matched with workers of relatively low-skill level 1. In sum, the structure of the assignment is twofold: positive sorting of identical pairs and, for the remaining workers and jobs, pairing two points in each layer leading to  negative sorting.[In fact, this result applies more broadly to any pair of worker and job distributions that lead to a unimodal measure of underqualification H.]\n    Reflecting Binomial Mixture Distributions. We now develop a more general example that provides a baseline intuition for the quantitative analysis in Section <ref>.\n    \n    We take the previous case with the reflecting worker\n    skill distribution and the job distribution parameterized by p=1/3 and n=4, and mix these distributions with a reflecting binomial worker and job distribution with p̂=1 and n=4 in the ratio of\n    3:1. Again, we consider skill levels {0,1,2,3,4} where now\n    the number of jobs with these skill levels is {28,8,24,32,16},\n    and the number of workers with these skill levels is {16,32,24,8,28}.\n    \n    We first maximize perfect pairs. For example, we sort 16 jobs with skill level 0 to all workers with skill level 0. Similarly, we perfectly pair {8,24,8,16} jobs with skill levels {1,2,3,4}. After maximizing perfect pairs, we are left with 24 workers of skill level 1 and 12 workers of skill level 4 together with 12 remaining jobs of skill level 0, and 24 jobs of skill level 3.\n    \n    Second, we decompose the problem into independent layers. The measure\n    of underqualification H after normalization[That is, multiplied by the total number of workers or jobs, equal\n    to 108. ] at the respective skill levels is thus given by {-12,12,12,-12,0},\n    and is depicted in Figure <ref>. The top layer consists of 12 workers of skill level 1 and 12 jobs\n    of skill level 3. The bottom layer contains four distinct elements:\n    12 jobs each at skill levels 0 and 3 and 12 workers each at skill\n    levels 1 and  4. \n    \n    Third, we characterize the optimal assignment for each layer independently.\n    As in the case of the two reflecting binomial distributions, there\n    is only one feasible sorting in the top layer. The problem for the bottom layer is  identical to the example\n    of positive and negative sorting where worker skills are represented\n    by x_L and x_H, while jobs are represented by z_L and\n    z_H satisfying z_L<x_L<z_H<x_H. The assumed distributions\n    of skill levels imply that d_LL=d_HH=1,d_LH=2 and d_HL=4.\n    In this case, the sorting within the top layer is positive since 2≤2^ζ+4^ζ\n    for all ζ∈(0,1). \n    \n    The full optimal assignment is shown in Figure <ref>. Consider the job with skill difficulty 3. This job is paired with workers of skill 1, 3, and 4. Similarly, the workers with skill type 1 are paired with jobs of type 0, 1, and 3. We emphasize that, even without perfect pairing (the bottom row of the bottom panel, circular arcs), the job with skill difficulty 3 is a part of both positive and negative pairing.\n    \n    \n    \n    § WAGES AND FIRM VALUES\n    \n    \n    We determine the equilibrium wages and firm values by characterizing\n    the solution to the dual planning problem (<ref>). The presentation is divided into two parts. The first part characterizes the\n    dual for mismatched workers and jobs by constructing the local hierarchical\n    structure which delivers the shadow cost of mismatch. The second\n    part then constructs the dual for both the mismatched and perfectly\n    paired workers. Our construction of the dual solution and characterization of its local hierarchical structure are interesting not only from the economic perspective, but also are new to the optimal transport literature. \n    \n    \n    \n    \n    Mismatched Workers and Jobs. We consider a problem with n workers with skill levels in a set\n    X and n jobs with difficulty levels in a set Z with potentially\n    multiple workers at each skill level and multiple jobs at each difficulty\n    level, where X and Z are disjoint  after the removal of perfect pairs. We denote by S=X∪ Z the set of all skill levels.\n    \n    Suppose that an optimal assignment π consists of n worker-job\n    pairs (x_i,z_i) ∈Γ_π. Our goal is to first construct a function\n    ϕ:S→ such that for each worker x and every job z,\n    ϕ(x)-ϕ(z)≤ c(x,z), which holds with equality if the assignment\n    π pairs worker x to job z.[Equivalently, we construct worker wage function ϕ:X→ and\n    firm value function ψ:Z→ such that for each worker x\n    and job z, ϕ(x)+ψ(z)≤ c(x,z), where the equality holds\n    if the optimal assignment π matches x with z, that is (x,z)∈Γ_π.\n    Since the intersection of the set of workers and the set of jobs\n    is empty these formulations are equivalent.] This gives the dual potentials ϕ and ψ, yielding\n    a shadow cost ϕ on X∪ Z of mismatch for the worker and the job via the connection\n    ψ(z)=-ϕ(z) for all mismatched jobs z ∈ Z.\n    \n    We propose a construction of the dual solution that is specific to\n    the model of composite sorting. This mechanism builds on a local hierarchical\n    structure for the shadow prices of mismatch. We show that locality\n    and hierarchy are direct consequences of the absence of intersecting\n    pairs. The main implication of this structure is that the relative\n    wages are determined locally – for any two skills s and s'\n    in a given skill group, their relative wages ϕ(s)-ϕ(s') can\n    be computed only based on information in this skill group.[Since the optimality of a dual potential is invariant constant shifts, the relative difference ϕ(s)-ϕ(s') contains all information of the solution to the dual problem.] Next, the mechanism aggregates this local structure by constructing\n    suitable level shifts that preserve the local structure of relative\n    wages within groups while ensuring consistency across all groups.[A local-global structure for the primal problem appears in <cit.> where he argues that the points of nondifferentiability in the dual problem can be used to determine local regions for the primal problem. Instead, we characterize a local-global structure for the dual solution directly using the primal problem. The primary technical difficulty in our construction is to ensure consistency at every scale from local to global via aggregation of the local relative wages.\n    \n    The local region generally does not appear in the case of convex costs. For instance, when all worker skills\n    are lower than each job difficulty, the optimal assignment for a convex\n    cost is the positive sorting, which allows for no local regions (except\n    for the whole set) since any two pairs intersect. In contrast, for\n    a concave cost, every pair forms a local region regardless of how\n    the worker skills and jobs are located. Therefore, our findings on\n    the hierarchical structure for the dual problem are specific to concave\n    costs.]\n    \n    Figure <ref> illustrates our local hierarchical structure.\n    The lower skill group has skills in the interval between x_1\n    and z_1. The higher skill group has skills in the interval between\n    x_2 and z_2. The relative shadow cost of mismatch for all\n    skills within either the first or the second group is determined\n    solely within each group. That is, the wage determination is local\n    by group. Wage determination is also hierarchical within groups. In\n    the lower skill group, the wage is first determined for the innermost\n    pair (x_4,z_4) which contains no nested skill groups, then\n    for the intermediate pair (x_3,z_3), and finally for the outer\n    pair (x_1,z_1). In other words, hierarchical structure implies\n    that we move sequentially from lower-level pairs to higher-level pairs.\n    At each stage, wages depend only on information from the skill group\n    nested within the progressively larger group. For the higher skill\n    group, the relative wage for the pair (x_2,z_2) is thus constructed from\n    the relative wages for both pairs (x_5,z_5) and (x_6,z_6)\n    which are, in turn, determined locally. Finally, the wages for the\n    outermost pair (x_0,z_0) are constructed using the relative\n    wages for the first and the second skill group. The formal definition\n    of the local hierarchical mechanism is analogous to this example but\n    is notationally more involved. We present a condensed statement of\n    the theorem here and include the complete definition of the mechanism,\n    the full statement of the theorem, and the proof in the Appendix.\n    \n     Given an optimal assignment,\n    the local hierarchical mechanism constructs an optimal dual pair (ϕ,ψ)\n    where ψ=-ϕ. Within each skill group, relative wages are\n    determined locally: for any two points s and s' in a skill group,\n    ϕ(s)-ϕ(s') depends only on the pairings within the group.\n    \n    \n    We next use the dual functions to define worker wages and firm values\n    for these non-overlapping segments of the worker distribution and\n    the job distribution. We let worker wages be w(x)=g(x)-ϕ(x)\n    and firm values be v(z)=h(z)-ψ(z). The first observation is\n    that the assignment π which solves the primal mismatch cost minimization\n    problem (<ref>) also solves the primal output maximization\n    problem (<ref>). Moreover, w(x)+v(z)≥ y(x,z) holds for all\n    (x,z) with equality if (x,z)∈Γ_π, where y(x,z)=g(z)+f(x)-c(x,z).\n    By Lemma <ref>, it follows that (w,v) is a dual optimizer\n    for the output maximization problem. In sum, given the shadow mismatch\n    cost (ϕ,ψ) for the minimization problem without overlapping\n    parts, the dual pair (w,v) for the maximization problem without\n    overlapping parts is obtained.\n    \n    \n    Incorporating Perfectly Paired Workers and Jobs. Up to this point, we have addressed\n    the issue of determining worker wages and firm values in the output\n    maximization problem where there is no overlap between the distributions\n    of workers and jobs. Next, we discuss how these wage and value functions\n    can be used to construct worker wages and firm values for the problem\n    with overlapping distributions.\n    \n    Before we formalize our construction, an informal description\n    is helpful. We start with an equilibrium of only mismatched workers\n    and jobs. We then add perfectly matched firms and determine what income\n    each firm could maximally generate given mismatched workers and wages\n    w̃ that is obtained in the discussion above. We next introduce perfectly matched workers and pass\n    on the new information, the assessed value of all jobs, to both mismatched\n    and perfectly matched workers. We then determine what wage income\n    both the imperfectly and perfectly paired workers would generate given\n    the compensation required by firms. As a result, we obtain the required\n    wages for both mismatched and perfectly paired workers. We pass on\n    this information, the compensation required by workers, further to\n    all firms such that all firms now have information about all workers.\n    Finally, we determine what income all firms would generate given all\n    workers and their required compensation. The dual values are the required\n    compensation of workers and firms in the final step. We next formalize\n    this sequential construction.\n    \n    \n    \n    After removing the common parts of distributions, denote the sets\n    of remaining workers and jobs as I and J. We start by defining\n    the first auxiliary firm decision problem, which is the problem of\n    a firm restricted to choosing an employee among only mismatched workers\n    x∈ I, that is, the workers who are not in perfect pairs. Formally,\n    a firm with job z∈ I∪ J solves: ṽ(z):=max _x∈ Iy(x,z)-w̃(x).\n    We denote by ṽ the firm mismatch compensation, the maximum\n    profits firms can attain given a set of mismatched workers and wage\n    schedule w̃. We use firm mismatch compensation to define\n    an auxiliary worker decision problem, which is the problem of a worker\n    x∈ I∪ J choosing any job, including the perfect pairs, given\n    the firm mismatch compensation schedule v̂: \n    \n        ŵ(x):=max_z∈ I∪ Jy(x,z)-ṽ(z).\n    \n    \n    \n    We set up a second auxiliary firm decision problem, which is the problem\n    of a mismatched job z∈ J now choosing an employee among all\n    workers (perfectly aligned and mismatched) subject to auxiliary wage\n    schedule ŵ: \n    \n        v̂(z):=max_x∈ I∪ J y(x,z)-ŵ(x).\n    \n    We refer to v̂ as mismatched firm compensation, since it represents\n    the profits of firm type z∈ J that is mismatched in equilibrium.\n    \n    Equilibrium wages are formulated using auxiliary wage income for mismatched\n    workers, w(x)=ŵ(x) for all x∈ I, as well as mismatched\n    firm compensation, v(z)=v̂(z) for all z∈ J, to set w(x)=-v(x)\n    for all x∈ J. Equilibrium firm values v are then given by\n    v(z)=-w(z) for every job z∈ I∪ J. Theorem <ref>\n    shows that the wage function w and the firm value function v\n    indeed solve the dual problem for the full assignment problem between\n    worker distribution F and job distribution G.[We can extend the domain of wages w and values v to K=X∖(I∪ J)\n    by setting w(x)=max_z∈ I∪ Jy(x,z)-v(z) for x∈ K and\n    v(z)=-w(z) for z∈ K.] The constructed functions (w,v)\n    are a dual solution for the sorting problem between worker distribution\n    F and job distribution G, that is, w(x)+v(z)≥ y(x,z), where equality holds everywhere with respect to  Γ_π.  The proof of Theorem 3, as well as a formal analysis of the above mechanism, is in Appendix <ref>.\n    \n    \n    \n    § QUANTITATIVE ANALYSIS\n    \n    \n    The distinguishing feature of the model is frictionless wage dispersion within occupations. We explore the ability of the model to generate qualitative and quantitative patterns of wage dispersion within occupations.\n    \n    \n    Data. Our main data source is the American Community Survey. We consider all individuals between 25 and 60 years of age between 2010 and 2017. The final sample includes about 6.7 million individuals. We select this period to work with a single Standard Occupational Classification (SOC) code, which yields 497 distinct and consistent occupations. Our measure of labor income is wage and salary income before taxes over the past 12 months.[Labor income includes wages, salaries, commissions, cash bonuses, tips, and other money income received from an employer. We drop individuals with wages below a threshold to focus on workers who are attached to the labor market. This minimum is equal to the federal minimum wage times 52 weeks at 40 hours per week.]\n    \n    \n    \n    Figure <ref> shows the dispersion of individual wages\n    within occupation. On the horizontal axis, we rank occupations by\n    the average wages earned in each occupation. For every occupation,\n    we calculate the dispersion in logarithmic wages within that occupation,\n    where the size of the circle indicates the share of employment within\n    the occupation. The salient data pattern is captured by the red solid\n    line which is a fractional polynomial fit. Wage dispersion within\n    occupations is sizable, with the average wage dispersion equal to\n    0.24 log points. Second, the wage dispersion within occupations is relatively\n    flat at the bottom 80 percent of occupations, but rapidly increases for the top fifth of occupations.\n    \n    \n    Analysis. We next calibrate the technology. We choose simple parameter values for the cost of mismatch: \n    ζ_p=ζ_κ=1/2 and ρ_p=ρ_κ=1.\n    These parameters, together with the distributions of workers and jobs,\n    determine the equilibrium assignment. We discipline the choice for\n    the production value of a worker independent of their job g(x)\n    to exactly replicate earnings data in the United States. That is,\n    we calibrate the function g to exactly replicate the wages at each percentile in the data.[We do not need to calibrate the function h as all our results are invariant to it. In principle, the function could be directly inferred using a measure of the value of a job.]\n    \n     We now expand on the example of reflecting binomial mixture distributions that we discussed in Section <ref> to develop an understanding of the quantitative exploration. First, in Figure <ref>, we plot a continuous analog of the measure of underqualification in that example. It follows from our theoretical\n    analysis of Section <ref> that this measure is an important determinant of an optimal assignment. There are two peaks and one trough - an increasing measure of underqualification indicates mismatched workers; a decreasing measure of underqualification\n    indicates mismatched jobs. Figure <ref> thus indicates\n    mismatched workers with skill difficulty levels between 0 and 500 as well as\n    mismatched workers between 1500 and 2500. Similarly, Figure <ref>\n    indicates mismatched jobs with skill levels between 500 and 1500 as well as mismatched jobs with skill difficulties between 2500 and 3000. To explain the equilibrium assignment, we divide the measure of underqualification\n    into three symmetric regions. The regions are given by 0 to 1000, 1000 to 2000, and 2000 to 3000.\n    \n    \n    Let us consider the first region given by skills between 0 and 1000.\n    The analysis for the other two regions is analogous.[The intuition for separation into three regions is similar to the\n    example of reflecting binomial mixture distributions and is verified\n    formally using the Bellman algorithm. In general, separation\n    may not be optimal and a complete characterization of sorting for\n    arbitrary distributions and any concave cost function is constructed\n    using the Bellman recursion (<ref>). Given the separation of the\n    measure of underqualification it follows that our equilibrium sorting\n    is not sensitive to the technological parameter values.] In this region, the measure of underqualification linearly increases\n    and then linearly decreases, as we plot in the left panel of <Ref>. The underlying distribution of the mismatched workers is plotted\n    in the middle panel: a uniform distribution of workers with\n    skills between 0 and 500. The underlying distribution of the mismatched\n    jobs is uniform between 500 and 1000 and is plotted in the right panel.\n    \n    \n    \n    To understand the optimal assignment, consider the workers x_1 and x_2 (where x_1<x_2) and the jobs z_1 and z_2 (where z_1<z_2).\n    By the principle of no intersecting pairs, it follows that we optimally\n    pair worker x_1 with job z_2 and worker x_2 with job\n    z_1. There are only two possible pairings. The first is positive\n    assortative matching: (x_1,z_1) and (x_2,z_2). The second\n    is negative assortative matching: (x_1,z_2) and (x_2,z_1).\n    Positive assortative matching here leads to intersections, contradicting\n    the property of no intersecting pairs, and, hence, is not optimal.\n    Negative assortative matching is the only non-intersecting configuration\n    and is thus optimal. Since this reasoning holds for any two workers\n    and two jobs in this region it follows that all workers and jobs are\n    negatively sorted. Alternatively, we could have established the optimal\n    assignment directly from the principle of layering. Since each layer\n    within the region contains a single worker and a single job, the optimal\n    assignment pairs them.\n    \n    The optimal pairing features significant variation in mismatch. The\n    mismatch varies from almost zero for the worker at skill (slightly\n    below) 500 and the job (slightly above) 500 to the mismatch of 1000\n    for the worker at skill 0 and the job at skill 1000. In contrast,\n    if sorting were positive, there would be no variation in mismatch\n    – mismatch for each worker-job pair would equal 500.\n    \n    Negative sorting in this region implies that more valuable jobs feature larger fixed investments. The worker with the highest skills is paired with the job with the lowest skills demands meaning that the mismatch (z-x) between the worker and the job is small. Since mismatch is small and technology choice increases in mismatch, the extent of investment is small. However, the worker with the lowest skills is paired with the most valuable job. To ensure that the value of this job is not significantly diminished, a large investment is made. An example would be the case of welding (SOC 51-4120, mean wage of 45 thousand dollars) and the adoption of collaborative welding robots (cobots).[A welding cobot consists of a robotic arm with welding instruments attached. A high-end cobot costs about 100 thousand dollars versus 5 thousand dollars for a basic industrial welding machine.] A low-skill welder (with high mismatch between the skill and the\n    job) is assisted by a cobot which ensures the quality of the output. A high-skill\n    welder (with no mismatch between the skill and the job) instead completes\n    the job without robotic assistance. In the right region of <Ref>, the intuition is similar for the case of surgeons (Physicians\n    and Surgeons SOC 29-1060 with a mean wage of 213 thousand dollars is the\n    top-ranked occupation). A low-skill surgeon is assisted by a robotic surgical system while a high-skill surgeon operates without robotic assistance.[A surgical robot consists of a control console and robotic arms with surgical instruments and costs about 2 million dollars.] The\n    welding company or a surgical practice makes investments in technology in order to produce valuable output with minimal mismatch costs.\n    In the middle region, workers are more qualified than the job requires\n    and firms invest in amenities for more skilled employees to reduce\n    their utility cost of mismatch. Consider the case of semi-truck\n    drivers (SOC 53-3030, mean wage 47 thousand dollars). A high-skill\n    trucker drives a new truck with a quiet cabin, enhanced sleep space, and driver assistance technologies such as adaptive cruise control and\n    digital mirrors. A low-skill trucker drives a basic model without\n    such features.[A new high-end Kenworth Signature truck costs about 250 thousand dollars\n    versus an older basic model that can be purchased for about 25 thousand\n    dollars or less.] A high-skill computer user support specialist (SOC 15-1150, mean\n    wage 64 thousand dollars) has an option to work from home using investments\n    in remote access and control software. A low-skill computer support\n    specialist instead works on-site in person.[For more empirical and theoretical discussion on the provision and valuation of amenities, see, amongst others, <cit.>, <cit.>, <cit.>, <cit.>, <cit.>, and <cit.>.]\n    \n    Second, we add common parts to the distributions of workers and jobs.\n    In particular, we add 250 workers and 250 jobs with identical skill\n    levels between 750 and 1000. Following Section <ref>, an optimal\n    assignment pairs these workers and jobs to maximize the number of\n    perfect pairs. We illustrate the resulting new distributions of workers\n    and jobs in <Ref>. Thus, we now have jobs without wage dispersion\n    with skill difficulty between 500 and 750 and jobs with wage dispersion\n    and skill difficulty between 750 and 1000. Two distinct workers\n    work in each of these jobs: one positively sorted worker in a perfect\n    pair, and one negatively sorted worker. Consider a job with skill\n    demand 800 as indicated by the horizontal dashed line in the\n    right panel of <Ref>. The horizontal dashed line intersects the assignment at two points. At the right intersection, the worker is perfectly paired and has skill 800. There is no mismatch for this worker. At the left intersection, the worker's skill is instead 200 and the worker is mismatched. No additional technology investment is necessary for a worker who is perfectly matched, while a worker with lower skills benefits from technology. Consider the example of welders. The welder with skill 200 is assisted by a cobot to ensure that the output is not diminished due to skill mismatch. The perfectly paired welder with skill 800 does not need a cobot and instead works with a standard manual welding machine.\n    The skill is a normalization that represents workers' rank. We now explain how the results on sorting by skills can be linked to sorting by wages. To convert skills into wages we use a one-to-one ranking between workers' positions in the skill distribution and their corresponding position in the earnings distribution. As an illustration, a worker located at the lowest point of the skill distribution (skill level 0) would earn a salary of 16 thousand dollars, which is the lowest possible wage level. Similarly, a worker situated in the middle of the skill distribution earns a wage of 47 thousand dollars (the median of the earnings distribution).\n    \n    The key attribute of our model is its ability to create wage dispersion within the same job. The analysis above concluded that there is dispersion of skills in the same job and thus there is corresponding dispersion of wages within jobs as well. On the other hand, a model that delivers either positive or negative sorting cannot result in any variation in skill levels within a particular job, and as a consequence, does not create any wage dispersion within that job. Furthermore, any model that pairs only one worker to each job does not generate any wage dispersion within jobs.\n    \n    In our example above, the same job is performed by a high-skill welder and a low-skill welder assisted by a cobot. It should be emphasized that this situation is different from a scenario where a high-skill welder is assigned to a more complex job (for example, underwater welding requiring specialized skills) and the low-skill welder is assigned to a simpler job (for example, assembling an industrial boiler). This would result in wage dispersion not within the same job, but rather across two different jobs: the complex and the simple job.\n    \n    By combining the optimal assignment within the three regions, we find that the model delivers sizable wage dispersion in occupations with high and low mean wages. Consider a high-skill occupation such as surgeon. There is a large wage variation at the top of the income distribution. A high-skill surgeon earns a multiple of the wages of a low-skill surgeon. According to our model, a low-skill surgeon assisted by a robotic surgical system performs the same job as a high-skill surgeon. As a result, the salary variation in this profession is significant, since it encompasses low-skill surgeons as well as high-skill surgeons. A similar intuition holds for the bottom of the wage distribution. The wage distribution exhibits a lower level of dispersion at the bottom compared to the top, and the model accounts for a sizable part of this reduced level of dispersion. In contrast, the model only accounts for a moderate portion of wage dispersion in the middle of the income distribution. The reason is that the log-wage profile is relatively flat in this range. As a result, even though there may be substantial skill dispersion within a particular occupation, it does not give rise to substantial wage dispersion.\n    \n    Our model explains 28 percent of the squared deviation and 32 percent\n    of the absolute deviation of wages across the sample. For the middle\n    of the distribution (20th to 80th percentiles), the model accounts\n    for 12 percent of the squared deviation and 19 percent of the absolute\n    deviation. In contrast, any one-to-one sorting model (for example,\n    a model with positive or negative sorting arising from submodular\n    or supermodular costs) would yield zero wage dispersion within occupations. For the bottom of the distribution (0th to 20th percentiles), the\n    model accounts for 20 percent of the squared deviation and 46 percent\n    of the absolute deviation. For the top of the distribution (80th to\n    100th percentiles), the model accounts for 57 percent of the squared\n    deviation and 58 percent of the absolute deviation.\n    \n    \n    \n    \n    § CONCLUSION\n    \n    \n    We provide a complete solution to an assignment problem with heterogeneous workers and heterogeneous jobs when the underlying technology is neither supermodular nor submodular. Our analysis introduces a general tractable framework – composite sorting – that yields both multiple workers sorted to the same job and workers being a part of both positive and negative sorting. We also show that wages have a new local hierarchical structure with relative wages being determined by narrow skill groups and aggregated to determine wages at different scales. We illustrate the composite sorting framework quantitatively to argue that it may  account for a sizable portion of wage dispersion within jobs.\n    \n    \n    \n    econometrica\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n     Composite Sorting \n     Online Appendix \n      Job Boerma, Aleh Tsyvinski, Ruodu Wang, and Zhenyuan Zhang \n     March 2023\n    \n    \n    \n    § PROOFS\n    \n    \n    In this appendix, we formally prove the results in the main text.\n    \n    \n    \n     §.§ Proof to Lemma <ref>\n    \n    \n    Suppose the assignment π and the functions (w,v) satisfy our assumptions above. Then it holds that ∫ y(x,z) dπ=∫ w(x)  dF+∫ v(z)  dG. By Monge-Kantorovich duality, we must have that the maximum for the primal problem is attained by π and the minimum for the dual problem is attained by (w,v), as required.    \n    \n    \n    \n     §.§ Proof to  Lemma <ref>\n    \n    \n    We show that a perfect pairing is made when feasible. By contradiction, suppose an optimal assignment contains pairings (x,z) and (x',z') when x'=z.[If either x = x' or z = z', a perfect pairing is naturally made since x' = z. We thus restrict our attention to the cases where x ≠ x' and z ≠ z'.]\n    \n    By symmetry, it suffices to consider two cases. Consider first the case x≤ z'<z=x'. Since the cost of mismatch c̅ is strictly increasing, c(x,z') + c(x',z) = c(x,z') < c(x,z) ≤ c(x,z)+c(x',z') where the equality follows since c(x',z)=0. Thus, the cost of mismatch when making the perfect pairing is strictly lower than under the optimal configuration, which is a contradiction. \n    \n    Second, we consider the case where x<x'=z<z'. In this case, the cost of mismatch c̅ is given by c(x,z')+c(x',z) = c̅(z'-x) since c(x',z)=0. To arrive at a contradiction, choose some weight λ∈ (0,1) to scale the maximum distance such that z-x = (1-λ)(z' - x). Since the total distance is given by (z - x) + (z' - x') = (z' - x), we also have z'-x' = λ (z' - x). Since the cost of mismatch is strictly concave, we use strict concavity and add the two previous equations to obtain c̅(z-x) + c̅(z'-x') > c̅(z'-x). The output loss due to mismatch can be strictly reduced by assigning worker x to job z' and by perfectly assigning worker x' to job z, which is a contradiction.[<cit.> further show that Lemma <ref> extends with continuous worker and job distributions in higher dimensions. In these environments, the solution is partially characterized by two parts. Overlapping sets of the distributions are perfectly paired, and the remaining mass is assigned using Monge maps. In our economy featuring distributions with atoms the remaining mass is not assigned using one-to-one assignments as identical worker types fulfill different jobs. We highlight this feature of optimal assignments in the first example in Section <ref>.]\n    \n     §.§ Proof to  Lemma <ref>\n    \n    \n    To establish the result, we show that if two pairings (x,z) and (x',z') under an optimal assignment intersect, then the support of the assignment is not optimal.\n    \n    By symmetry, it suffices to consider two cases.[There is a total of six distinct scenarios to consider, which can diagrammatically be represented by the following pairings: \n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    \n        < g r a p h i c s >\n    . The first four scenarios do not contain intersecting pairs. The fifth scenario is the first scenario in the proof, while the sixth scenario is the second scenario in the proof.] First, consider the case x < z'< z <x'. Since the cost function is increasing, c(x,z') + c(x',z) = c̅(z'-x) + c(x' - z)< c̅(z-x) + c(x'-z') = c(x,z) + c(x',z'). The output loss due to mismatch is strictly reduced by assigning worker x to job z' and worker x' to job z, which is a contradiction.\n    \n    \n    \n    Second, consider the case x < x' < z < z'. In this case, the cost of mismatch c̅ is given by c(x,z')+c(x',z) = c̅(z'-x) + c̅(z - x'). To arrive at a contradiction, choose some weight λ∈ (0,1) to average the minimum and maximum distance such that \n        z-x = (1-λ)(z' - x) + λ (z-x').\n    \n    Since the total distance is given by (z - x) + (z' - x') = (z' - x) + (z - x'), we moreover obtain \n    \n        z'-x' = λ (z' - x) + (1-λ) (z-x').\n    \n    Since the cost of mismatch is strictly concave, we can use strict concavity and add the two previous equations to obtain c̅(z-x) + c̅(z'-x') > c̅(z'-x) + c̅(z-x'). The output loss due to mismatch can be strictly reduced by assigning worker x to job z' and worker x' to job z, which is a contradiction.\n    \n    \n    \n     §.§ Layering and Proof to  Lemma <ref>\n    \n    \n    To prove Lemma <ref>, we make use of the following result due to <cit.>. We repeat the result here for completeness.\n    \n    Stability of Optimal Assignment. Let c(x,z) be a continuous non-negative cost function, and {F_n}_n∈, {G_n}_n∈ be sequences of distributions of workers and jobs, respectively. Suppose F_n→ F, G_n→ G weakly for some F, G,[This means that F_n→ F on continuity points of F and respectively for G.] and let π_n be an optimal assignment between F_n and G_n. If π_n→π in distribution, then π is an optimal assignment between F and G.\n    \n    \n    To establish Lemma <ref>, we first formally define F_ℓ and G_ℓ, the measures of the workers and the jobs in each layer. To obtain different layers for a general underqualification measure, we identify the skill levels where underqualification increases, and\n    the skill levels where underqualification decreases. Recall that an underqualification\n    measure H  takes a finite number of values in a_0<a_1<…<a_L. Underqualification\n    increases from a_ℓ to a_ℓ+1 at a skill level s\n    if H(s_-)≤ a_ℓ<a_ℓ+1≤ H(s), where s_- represents\n    the limit from the left. Analogously, the measure of underqualification\n    decreases from a_ℓ+1 to a_ℓ at a skill level s\n    if H(s_-)≥ a_ℓ+1>a_ℓ≥ H(s). The set of skill\n    levels where underqualification increases is denoted by X_ℓ^↑:={:  increases from  to  at skill level }\n    for all 1≤ℓ≤ L. Similarly, the set of skill levels where\n    underqualification decreases is denoted by X_ℓ^↓:={:  decreases from  to  at skill level }.\n    Define the discrete measures for all layers 1≤ℓ≤ L by \n    \n        F_ℓ:=(a_ℓ-a_ℓ-1)∑_x∈ X_ℓ^↑δ_x and G_ℓ:=(a_ℓ-a_ℓ-1)∑_x∈ X_ℓ^↓δ_x\n    \n    where δ_x is the Dirac measure at x. It follows that\n    F=∑ F_ℓ and G=∑ G_ℓ. Note that F_ℓ and\n    G_ℓ are generally not probability measures as they are not\n    required to have total measure one.\n    \n    Having defined the measure of workers and jobs in each layer, we next observe that the worker and job distributions are supported on disjoint sets and on a finite set of skills {s_j}_1 ≤ j ≤ S. We smooth both the discrete distributions of workers and the discrete distribution of jobs by replacing each atom in the worker and job distribution at level s_j by a uniform distribution on [s_j,s_j + ε] with the same mass for every 1≤ j≤ S, where ε is small enough such that the intervals [s_j,s_j+ε] for all 1≤ j≤ S do not intersect. In Figure <ref>, we provide an illustration of this procedure using the underqualification measure H of Figure <ref>. We denote the smoothed measure of workers by F_ε and the smoothed measure of jobs by G_ε, and the corresponding underqualification measure by H_ε. An optimal assignment given worker measure F_ε and job measure G_ε is given by π_ε. Since the mismatch cost c is continuous, by stability of the optimal transport, π_ε→π weakly where π is the optimal matching between workers F and jobs G. \n    \n    \n    \n    Consider the support A^ℓ_ε := H_ε^-1((a_ℓ-1,a_ℓ)) for all layers 1≤ℓ≤ L and define the smoothed worker distribution F^ℓ_ε:= F_ε|_A^ℓ_ε and the smoothed job distribution G^ℓ_ε := G_ε|_A^ℓ_ε for every layer such that F_ε = ∑ F^ℓ_ε and G_ε=∑ G^ℓ_ε.[The choice of an open or closed interval (a_ℓ-1, a_ℓ ) does not matter because the inverse of the boundary points is negligible with respect to the measure F_ε + G_ε.] Moreover, let an optimal assignment between workers F^ℓ_ε and jobs G^ℓ_ε in layer ℓ be denoted by π^ℓ_ε. Clearly, this assignment π^ℓ_ε is supported on the set (A^ℓ_ε)^2. \n    \n    Next, we establish that the sum of optimal assignments across layers ∑π^ℓ_ε is an optimal assignment between the smoothed worker distribution F_ε and the smoothed job distribution G_ε. Let π_ε be some optimal assignment between F_ε and G_ε. By cyclical monotonicity, the assignment π_ε is concentrated on a support Γ_ε that satisfies the property of no intersecting pairs. Since the smoothed distributions F_ε and G_ε are both atomless, this implies that any pairing (x,z)∈Γ_ε where x<z satisfies F_ε([x,z])=G_ε([x,z]). In turn, by the definition of the measure of underqualification H, this implies H_(x)=H_(z) meaning that x and z are both part of the same layer A^ℓ_ε. As a result, it follows that the support of the assignment π_ε is contained in the union of the support of all layers, or Γ_ε⊆∪ (A^ℓ_ε)^2. Since all the supports {A^ℓ_ε} are disjoint, the assignment π_ε|_(A^ℓ_ε)^2 transports between F^ℓ_ε and G^ℓ_ε. Since π^ℓ_ε is an optimal assignment between workers F^ℓ_ε and jobs G^ℓ_ε, it follows that the cost of mismatch for layer ℓ is greater under the assignment π_ε|_(A^ℓ_ε)^2, that is, ∫ c π̣_ε|_(A^ℓ_ε)^2≥∫ c  π̣^ℓ_ε. By summing over all layers 1 ≤ℓ≤ L, we can write that\n    \n        ∫ c π̣_ε = ∑_1≤ℓ≤ L∫ c π̣_ε|_(A^ℓ_ε)^2≥∑_1≤ℓ≤ L∫ c  π̣^ℓ_ε=∫ c  ( ∑_1≤ℓ≤ Lπ^ℓ_ε ).\n    \n    Since ∑π^ℓ_ε is a feasible assignment between the smoothed distributions F_ε and G_ε, and the mismatch cost is below the minimum mismatch cost, it follows that ∑π^ℓ_ε must be an optimal assignment.\n    \n    To conclude the proof it follows from our construction and the stability of the optimal assignment  that π^ℓ_ε→π^ℓ and ∑π^ℓ_ε→π weakly. Thus,\n    \n        π=lim_→ 0∑_1≤ℓ≤ Lπ^ℓ_ε =∑_1≤ℓ≤ Llim_→ 0π^ℓ_ε = ∑_1≤ℓ≤ Lπ^ℓ.\n    \n    \n     §.§ Representation of Bellman Algorithm\n    \n    \n    We can follow <cit.> to further simplify solving the Bellman\n    equation. Rather than considering all potential pairings k as in\n    equation (<ref>), it suffices to compare only two\n    alternatives. Specifically, the minimal mismatch cost can be described\n    by the simple recursive equation: \n    \n        V_i,j=min(c(s_i,s_j)+V_i+1,j-1,V_i,j-2+V_i+2,j-V_i+2,j-2),\n    \n    where j-i is odd so that the assignment problem contains an equal\n    mass of workers and jobs. We now illustrate Bellman equation (<ref>). Consider, say,\n    V_3,8 which is the cost of an optimal pairing for the skills\n    in [s_3,s_8]. It is given as the minimum between two alternatives.\n    The first alternative is c(s_3,s_8)+V_4,7. This is the cost\n    of pairing s_3 and s_8 which is given by c(s_3,s_8)\n    and the minimal cost of pairing in [s_4,s_7] given by the value\n    V_4,7. The second alternative is V_3,6+V_5,8-V_5,6. \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    We use the Bellman equation (<ref>), with initial conditions,\n    to obtain the minimal cost of mismatch V_i,j for every pair (i,j)\n    such that 1≤ i<j≤2n.[For this Bellman formulation, the initial conditions are V_i,i-1=0\n    and V_i+2,i-1=-c(s_i,s_i+1). To observe the role of initial\n    conditions consider the assignment problems of size two and four.\n    When j-i=1, we obtain V_i,i+1=min(c(s_i,s_i+1)+V_i+1,i,V_i,i-1+V_i+2,i+1-V_i+2,i-1)=c(s_i,s_i+1).\n    When j-i=3, we obtain V_i,i+3=min(c(s_i,s_i+3)+V_i+1,i+2,V_i,i+1+V_i+2,i+3-V_i+2,i+1)=min(c(s_i,s_i+3)+V_i+1,i+2,V_i,i+1+V_i+2,i+3).\n    We note that both are indeed identical to the simple specification\n    in equation (<ref>).]\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n     An optimal assignment between\n    workers F and jobs G sums an optimal assignment in each layer,\n    where the optimal assignment in each layer attains V_1,2n_ℓ\n    in the Bellman equation (<ref>). \n    Proof to Proposition <ref>. The proposition is proved in two steps. First, we show the minimum aggregate cost of mismatch is described by the Bellman equation. Given the Bellman equation, we then characterize the assignment that attains the minimum cost of mismatch as discussed in the main text.\n    \n    \n    Cost of Mismatch. We prove by induction that each mismatch cost V_i,j in (<ref>) represents the minimal cost of mismatching between the distribution of workers F|_[s_i,s_j] and the distribution of jobs G|_[s_i,s_j]. Let us first check the base cases |j-i|≤ 3. Recall the initial conditions V_i,i-1=0 and V_i+2,i-1=-c(s_i,s_i+1).\n    First,\n    \n        V_i,i+1   =min( c(s_i,s_i+1) + V_i+1,i,V_i,i-1 + V_i+2,i+1 - V_i+2,i-1)\n           =min(c(s_i,s_i+1),c(s_i,s_i+1))=c(s_i,s_i+1).\n    \n    This is the correct cost of matching as there exists only a unique assignment with one worker and one job.\n    Second,\n    \n        V_i,i+3   =min( c(s_i,s_i+3) + V_i+1,i+2,V_i,i+1 + V_i+2,i+3 - V_i+2,i+1)\n           =min(c(s_i,s_i+3)+c(s_i+1,s_i+2),c(s_i,s_i+1)+c(s_i+2,s_i+3)).\n    \n    This is the correct cost of matching since there are only two possibilities for an assignment in this case, match either the first and the fourth or the first and the second. \n    \n    Suppose we know V_i,j is the minimum cost of mismatch for every |j-i|< 2n - 1. For the induction step, we show this also holds at |j-i| = 2n - 1, or the complete alternating assignment problem, where:\n    \n        V_1,2n = min( c( s_1 , s_2n) + V_2, 2n-1, V_1,2n - 2 + V_3,2n -V_3,2n-2).\n    \n    Denote by F_t = F|_[3,2n-2] and G_t = G|_[3,2n-2] the worker and job distributions on a thin support, and we let F_a = F + F_t and G_a = G + G_t denote the addition of the original worker and job distribution and their respective distributions on the thin support. In order to prove that the Bellman equation (<ref>) holds, we show that both directions hold, that is, V_1,2n≤min ( c( s_1 , s_2n) + V_2, 2n-1, V_1,2n - 2 + V_3,2n -V_3,2n-2 ) and V_1,2n≥min ( c( s_1 , s_2n) + V_2, 2n-1, V_1,2n - 2 + V_3,2n -V_3,2n-2 ). \n    \n    We establish the ≤ direction by showing V_1,2n≤ c(s_1,s_2n)+V_2,2n-1 as well as V_1,2n≤ V_1,2n - 2 + V_3,2n -V_3,2n-2. The first inequality follows immediately. Take the optimal assignment in the interval [s_2,s_2 n-1], and pair the remaining elements, s_1 and s_2n, which induces a cost of mismatch c(s_1,s_2n)+V_2,2n-1. Since this is a feasible assignment for all workers and jobs on the interval [s_1,s_2 n] the minimum mismatch cost on this interval is below the mismatch cost of the constructed assignment, or V_1,2n≤ c(x_1,x_2n)+V_2,2n-1.\n    \n    To prove V_1,2n + V_3,2n-2≤ V_1,2n-2 + V_3,2n, consider the assignment problem between workers F_a and jobs G_a. By Lemma <ref>, the minimal cost of mismatch is V_1,2n + V_3,2n-2. On the other hand, combining the two optimal assignments between F|_[1,2n-2] and G|_[1,2n-2] as well as between F|_[3,2n] and G|_[3,2n] gives a feasible assignment between workers F_c and jobs G_c. This shows that the optimal assignment cost between workers F_c and jobs G_c is less than V_1,2n-2+V_3,2n, which concludes the proof of the ≤ direction.\n    \n    Next, we establish the ≥ direction, or V_1,2n≥min( c( s_1 , s_2n) + V_2, 2n-1, V_1,2n - 2 + V_3,2n -V_3,2n-2). It suffices to establish that if V_1,2n < c( s_1, s_2n ) + V_2,2n-1 then V_1,2n+V_3,2n-2≥ V_1,2n-2+V_3,2n.[Logically, we prove V ≥min ( A,B ) by showing that V ≥ B or V ≥ A. We show this by proving the statement that if V < A, then V ≥ B.] Suppose V_1,2n < c(s_1,s_2n)+V_2,2n-1. This implies that an optimal assignment between workers F and jobs G does not contain the pairing (s_1,s_2n). Suppose that s_1 is paired with s_j where j < 2n. The absence of intersecting pairs implies that the optimal assignment is concentrated on square subsets to the left and right of skill s_j, that is, π⊆ [s_1,s_j]^2∪[s_j+1,s_2n]^2. We denote the skill threshold in between s_j and s_j+1 by t = ( s_j + s_j+1 ) / 2. \n    \n    We next claim that an optimal assignment π_t between the thin distribution of workers F_t and the thin distribution of jobs G_t has no pairing with a corresponding interval that contains the point t. By contradiction, suppose there does exist a pair (s_k,s_l) crossing the threshold t in π_t. Since the masses to the left and the right of t are equal, there also exists a pairing (s_k',s_l') that contains (s_k,s_l). This is illustrated by the blue arrows in Figure <ref>. Consider an optimal assignment π_a between the added distribution workers F_a and jobs G_a. By Lemma <ref>, π_a = π + π_t, and hence assignment π_a contains the pairings (s_1,s_j), (s_k,s_l), and (s_k',s_l'). This contradicts the property of no intersecting pairs. Since the optimal assignment π_t does not contain a pair whose interval contains t, it follows that π_t is concentrated on the support [s_3,s_j]^2 ∪ [s_j+1,s_2n-2]^2.\n    \n    \n    \n    We combine the optimal assignment between workers F and jobs G with the optimal assignment between thinned distributions for workers F_t and jobs G_t to obtain the result. We construct a feasible assignment π_a,1 for the problem on [s_1,s_2n-2] by combining the optimal assignment π on [s_1,s_j] with the optimal assignment π_t on the interval [s_j+1,s_2n-2], so that π_a,1=π|_[s_1,s_j]^2+π_t|_[s_j+1,s_2n-2]^2. Analogously, we construct a feasible assignment π_a,2 for the problem on [s_3,s_2n] by combining the optimal assignment π on [s_j+1,s_2n] with the optimal assignment π_t on the interval [s_3,s_j] which generates π_a,2 = π_t|_[s_3,s_j]^2+π|_[s_j+1,s_2n]^2. Since the constructed assignments are feasible for the assignment problems on [s_1,s_2n-2] and [s_3,s_2n], respectively, we have (π_a,1)≥ V_1,2n-2 and (π_a,2)≥ V_3,2n. Finally, we observe that the addition of π_a,1 and π_a,2 solves the assignment problem with worker distribution F_a and job distribution G_a, such that π_a,1 + π_a,2 = π_a. These together yield V_1,2n-2+ V_3,2n≤(π_a,1) + (π_a,2) = (π_a) =V_1,2n+V_3,2n-2, completing the ≥ direction for (<ref>). This concludes the proof.\n    \n    \n    \n    \n     §.§ Other Examples\n    \n    \n    In this appendix, we provide additional illustrations of our theory.\n    \n    \n    Close to Linear Mismatch Costs. This example emphasizes\n    the dependence of the optimal sorting on the cost function. In particular,\n    we consider the assignment problem when ζ is close to 1, that\n    is, when the cost of mismatch is close to linear in the distance between\n    the worker skill and the job.[The linear case of mismatch (ζ=1) is the original formulation of the optimal transport problem due to Monge (1781) and has been well studied (<cit.>). See a discussion below.] \n    \n     First, we maximize the number of perfect pairings. Second, we  decompose the assignment problem into layers 0≤ℓ≤ L. Third, when ζ is close to one, the optimal assignment\n    within each layer is simple. Specifically, we show in Proposition\n    <ref> below that the optimal assignment within each layer is positive sorting which we denote by π_ℓ^+. \n    \n    The simplicity of the optimal assignment within layer enables us to\n    provide a simple characterization of the overall solution in this case. The solution to the full assignment problem is given by the sum of the positive assignments within each layer. We refer to this assignment as the layered positive assignment denoted by π^+=∑π_ℓ^+.\n    \n    \n    \n    Figure <ref> illustrates the layered positive assignment with\n    four workers and four jobs. The optimal assignment is given by the\n    top panel. To construct this assignment, we use the measure of underqualification\n    H in the bottom panel. The measure of underqualification induces\n    three independent layers. The decomposition yields two layers with\n    only one worker and one job (x_4,z_3) and (x_2,z_2)\n    for which there is no other option but to pair them. The third layer\n    contains skill levels (x_1,z_1,x_3,z_4). The assignment\n    positively pairs (x_1,z_1) and (x_3,z_4). \n    \n    We summarize the lessons from this subsection in Proposition <ref>.\n    \n     Given a worker distribution\n    F and a job distribution G, there exists ζ̅<1 such\n    that for any ζ∈[ζ̅,1], the layered positive assignment\n    π^+ is optimal. \n        After maximizing perfect pairs, by Lemma <ref>, we can restrict attention to assignments between worker and job distributions that are supported on disjoint sets. This means that the distributions F and G are supported on a finite set S, and we denote by δ the smallest pairwise distance between elements in S, and by D the largest pairwise distance between elements.[This proof can be extended to the case of continuous distributions when F and G are compactly supported with the measure of underqualification H:=F-G satisfying that both H and -H have finitely many local maxima and those maxima are strictly above zero.]\n    \n    \n    \n    \n    \n    We show there exists 0<ζ̅<1 such that for any ζ∈[ζ̅,1], the layered positive assignment π is optimal with respect to the mismatch cost c(x,z).  To prove the result, consider ζ̅ such that for any δ≤δ'≤ D'≤ D:\n    \n        2^1-ζ̅(D'-δ')^ζ̅≤δ'^ζ̅+D'^ζ̅.\n    \n    Such a ζ̅ exists because equation (<ref>) with D'-δ'≤δ is vacuously true while otherwise both sides of (<ref>) are uniformly continuous in ζ̅ on {(δ',D'):δ≤δ'≤ D'≤ D, D'-δ'> δ} and “<\" holds uniformly when ζ̅=1. Consider ζ∈ [ζ̅,1]. It suffices to prove that the optimal assignment within a layer does not contain any nested arc for the mismatch cost |x-z|^ζ. \n    \n    By the principle of layering Lemma <ref>, we decompose both measures F_n and G_n into layers. Here we assume without loss of generality that the lowest skill worker comes before the lowest skill job: x_1<z_1. On each layer there are 2 k equal masses on the skill levels x_1 < z_1 < … < x_k < z_k in S that are at least δ apart. The maximum distance within this layer is exceeded by D > z_k - x_1. Let {x_j}_1≤ j≤ k be the locations of mass on the layer for workers F_n, and let {z_j}_1≤ j≤ k be the locations of mass on the layer for jobs G_n. By contradiction, suppose that the optimal assignment within this layer instead does contain a nested arc, so it holds for some x_1≤ u<v<s<t≤ z_k that\n    \n        (t-u)^ζ + (s-v)^ζ≤ (t-s)^ζ + (v-u)^ζ.\n    \n    Since by concavity of the function x^ζ for x ≥ 0,\n    \n        (t-s)^ζ + (v-u)^ζ≤ 2(1/2(t-s)+1/2(v-u))^ζ=2^1-ζ((t-u)-(s-v))^ζ.\n    \n    Putting t-u=D' and s-v=δ' in (<ref>) leads to a contradiction.\n    Hence the optimal assignment within this layer does not contain any nested arc for ζ∈ [ζ̅,1].\n    \n     The implication\n    of the proposition is that for mismatch power values close to one, the\n    solution can be directly constructed by constructing the measure of\n    underqualification, and constructing the positive alternating assignment by layer.[<cit.> calls the layered positive assignment an excursion coupling, and shows  that the layered positive assignment is\n    the limit of some optimal couplings as ζ→ 1^-. We complement their result by proving the existence of a threshold ζ̅ beyond which the layered positive assignment is optimal for our environment.]\n    While this assignment generates positive sorting within each\n    layer, we emphasize this does not imply positive sorting overall\n    as we demonstrated in the example of two binomial distributions. In\n    particular, there is negative sorting since x_3 is sorted with z_4 but x_4 is sorted\n    with z_3. \n    \n    \n    Linear Cost of Mismatch. The last example naturally begs\n    the question what is optimal when the cost of mismatch is linear in\n    the distance between worker skills and job difficulties. The linear\n    case is exactly the specification of the mismatch cost prior to the\n    technology choice in Section <ref>. This formulation is in fact the\n    original formulation of the optimal transport problem due to Monge\n    (1781) and has been well studied (<cit.>). When the cost of mismatch is linear, an optimal assignment\n    is not unique. To illustrate this, we argue that both the Bellman\n    equation and positive sorting are optimal. \n    \n     To see that the Bellman equation also delivers the optimal\n    assignment in the case of linear costs of mismatch, we note that the\n    derivation of the Bellman equation did not require that the cost of\n    mismatch was strictly concave, only that the cost of mismatch was\n    concave. As a result, the same approach as before characterizes an optimal\n    assignment.\n    \n    \n    \n    Another solution to the assignment problem with linear costs of mismatch\n    is positive sorting. In this case, as with convex costs of the distance,\n    the production function is supermodular, and it follows that a positively\n    sorted assignment is optimal.\n    \n    \n    \n     §.§ Local Hierarchical Algorithm\n    \n    \n    We propose a new algorithm specifically tailored to the model of composite sorting, which has two distinct merits.  First,  it is more efficient than the existing generic algorithms, as shown in Appendix <ref>. Second, and more importantly, this new algorithm reveals\n    a hierarchical structure of the dual potential functions, \n    highlighting an implication of the absence of intersecting pairs to dual optimizers. \n    This hierarchical structure\n    means that a local dual optimizer within each region, which is the interval between two points in a pair, \n    is computed from the local dual optimizers on its subregions. \n    This hierarchical structure\n    leads to the following separation property of the global dual optimizer ϕ:   \n    for any two points s and s' in one region,\n    ϕ(s)-ϕ(s') \n    can be computed only based on points within this region, and thus it does not depend on points outside.  \n    We will describe this structure in detail and our algorithm below.  \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n       \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Recall that in our setting, we consider a problem with n workers with skill levels in \n    X and n jobs with difficulty levels in  Z, where X and Z are disjoint sets. We denote by S=X∪ Z the set of all skill levels. In what follows, when we mention an interval [x,z], we meant for the set of points between x and z, regardless of whether x<z or z<x. \n     \n      \n    \n    Our algorithm relies on recursive computations of ϕ constrained on smaller subsets of S. \n    To explain such a recursive procedure, we need some preparation by introducing the notion of subpairs.  \n    A pair (x,z) is called a subpair of the pair (x_0,z_0) if\n    (x,z) is a non-nested pair inside the interval [x_0,z_0] that is not equal to (x_0,z_0).\n    In Figure <ref>, the pairs (x_2,z_2) and (x_3,z_3) are\n    subpairs of the pair (x_0,z_0). The pair (x_1,z_1) is\n    a subpair of (x_2,z_2) but not of (x_0,z_0) as it is\n    nested in (x_2,z_2). For (x,z)∈Γ_π, \n    let X_[x,z] denote  the set of all points in\n    X between x and z inclusive of the boundary, and similarly for Z_[x,z].\n    \n    \n    \n    \n     \n    We process each pair  (x_0,z_0)∈Γ_π\n    sequentially in a certain order described below to get a local dual optimizer on [x_0,z_0], that is, a function\n    ϕ_[x_0,z_0] such that for any (x,z)∈ X_[x_0,z_0]× Z_[x_0,z_0],\n    ϕ_[x_0,z_0](x)-ϕ_[x_0,z_0](z)≤ c(x,z) which\n    holds with equality when (x,z)∈Γ_π. We observe that this property is preserved if ϕ_[x_0,z_0]\n    is shifted by any constant a∈ℝ.\n    \n    \n    \n    \n    \n    \n    A simple illustrative example is given in Figure <ref>. \n    We start with the pair (x_1,z_1) and found a local\n    dual optimizer ϕ_[x_1,z_1]. Here, the local dual optimizer\n    is any function ϕ_[x_1,z_1] satisfying ϕ_[x_1,z_1](x_1)-ϕ_[x_1,z_1](z_1) =  c(x_1,z_1)\n    as the only pair contained in \n    [x_1,z_1] is (x_1,z_1).\n    \n    \n    We then process the pair (x_2,z_2). A local dual optimizer\n    on [x_2,z_2] is a function ϕ_[x_2,z_2] satisfying\n    ϕ_[x_2,z_2](x)-ϕ_[x_2,z_2](z)≤ c(x,z) for (x,z)∈{(x_1,z_1),(x_2,z_2),(x_1,z_2),(x_2,z_1)}\n    with equality holding for (x,z)=(x_1,z_1) and (x,z)=(x_2,z_2).\n    We proceed with the subpair (x_3,z_3) and finally the remaining pair (x_0,z_0).\n    \n    \n    Below is a full description of the algorithm, where  ϕ, ϕ_i, x_i and z_i are local variables which vary across each iteration, and ϕ_[x,z] for (x,z)∈Γ_π are global variables which are the output of the algorithm.  \n    \n      *  Pick any pair (x_0,z_0)∈Γ_π that has not been processed such that all subpairs of (x_0,z_0) have been processed.\n    Let   (x_1,z_1),…,(x_p,z_p) be  the  subpairs  ordered in dictionary order[A vector (a_1,…,a_d) is smaller than  a vector (b_1,…,b_d) in dictionary order if either (a_1,…,a_d)=(b_1,…,b_d)  or there exists   p=1,\n    …,d such that  a_i=b_i for i=1,…,p-1 and a_p+1<b_p+1.] \n         with potential functions ϕ_i:=ϕ_[x_i,z_i] \n        for i=1,…, p.  \n        \n      *  If p=0,  then let ϕ (z_0)=0 and ϕ (x_0)=c(x_0,z_0).\n        \n      *  If p≥ 1, then   continue with the following sub-steps.\n        \n      *        If p>1,   let (β_2,…,β_p)∈^p-1 \n        be a solution to the inequality system \n        max(c_00-c_0n-c_m0, -c_mn) + c_nn≤∑_k=n+1^mβ_k≤min(c_0m+c_n0   -c_00 ,c_nm) -c_mm\n     \n        for all 1≤ n<m≤ p,\n        where c_ij=c(x_i,z_j) for i,j∈{1,…,p}. We show the existence of such (β_2,…,β_p) in Lemma <ref>.\n        \n      *  For i=1,…,p,\n        let \n        ϕ(s)= ϕ_i(s)+ ∑_k=i+1^p β _k +ϕ_p(x_p)-ϕ_i(x_i)\n    \n        for s∈ X_ [x_i,z_i] or s∈ Z_[x_i,z_i].  The above sum is 0 if i=p.\n        \n      *  Define ϕ(x_0) and ϕ(z_0) by the following equations \n        ϕ(z_0)     =max_i∈{1,…,p} (ϕ(x_i)-c(x_i,z_0))    if x_1≠ x_0,\n        min_i∈{1,…,p}(ϕ(z_i)+c(x_0,z_i))-c(x_0,z_0)    elsewhere;\n            \n        ϕ(x_0)     =ϕ(z_0)+c(x_0,z_0).\n    \n      *  Let ϕ_[x_0,z_0] be equal to ϕ.\n        \n      *  Return to step 1 with the next pair to process, or terminate if all pairs have been processed. \n    \n    \n    We note from step 3(b) that \n    for s,s'∈ X_[x_i,z_i]∪ Z_[x_i,z_i],\n    we have ϕ(s)-ϕ(s')=ϕ_i(s)-ϕ_i(s'). This means that after many iterations, the value of ϕ(s)-ϕ(s') does not change, and therefore it depends only on points in the region [x_i,z_i]. \n    \n    \n    There is some flexibility in the above algorithm \n    in choosing the order of processing the pairs in step 1 and  in solving for (β_2,…,β_p) in (<ref>) in step 3(a).  This flexibility is natural as the dual optimizers are not unique in general.\n     The order of processing the pairs does not affect the output of the algorithm because \n    each ϕ_[x_0,z_0] only depends on the local dual optimizers of its subpairs, which are all processed before this pair. A default order is to always choose the unprocessed pair (x_0,z_0) with the smallest x_0 satisfying the condition in step 1. \n    On the other hand, the choice of  \n     (β_2,…,β_p) does affect \n     the output of the algorithm. \n    As a default,  (β_2,…,β_p)\n    can be chosen as the solution of (<ref>) \n     which is the smallest in dictionary order.[Note that such a smallest solution always exists since (β_2,…,β_p) satisfying (<ref>) lies in a compact region.]\n     In this way, we obtain a unique output of the algorithm. \n     Nevertheless, in the next result, we will show that a dual potential ϕ is obtained from the algorithm  with arbitrary choices of (β_2,…,β_p) in each iteration.\n    \n    \n     \n    \n    We illustrate the construction of the dual potential ϕ in a simple example where X={1,3,7}, Z={4,8,10}, and x_0=1, x_1=3, x_2=7, z_0=10, z_1=4, z_2=8, with the cost function given by c(x,z)=√(|x-z|). By the principles established in Section <ref>, \n    the optimal assignment π pairs x_i with z_i for all i={0,1,2} as displayed in Figure <ref>. Our goal is to construct a function ϕ: S → such that ϕ(x_i)-ϕ(z_j)≤ c(x_i,z_j) for all i and j in {0,1,2} with equality holding when i=j. \n    \n    Following step 1 of the algorithm, we first process the pairs (x_1,z_1) and (x_2,z_2), as they do not have any subpair. Define ϕ_1(x_1)=ϕ_2(x_2)=1 and ϕ_1(z_1)=ϕ_2(z_2)=0, which are the local dual optimizers on [x_1,z_1] and [x_2,z_2], respectively. We now process the pair (x_0,z_0). According to (<ref>), the second step is to find β_2 ∈ℝ such that\n    \n        max(c_00-c_01-c_20,-c_21)+c_11≤β_2≤min(c_02+c_10-c_00,c_12)-c_22.\n    \n    Plugging in the values of x_i,z_i, we get\n    \n        max(c_00-c_01-c_20,-c_21)+c_11=4-2√(3)≈ 0.536;  min(c_02+c_10-c_00,c_12)-c_22=√(3)-1≈ 0.732.\n    \n    Following the default choice of choosing the smallest β_2, we set β_2=4-2√(3).[Any value in between 4-2√(3) and √(3)-1 will produce a dual potential. That the left-hand side of (<ref>) is no more than the right-hand side of (<ref>) is not a coincidence. We will prove that the system of inequalities (<ref>) always admits a solution in Lemma <ref> in Appendix <ref>.\n    \n    The set of solutions is always non-empty, although, intuitively, the larger |S| is, the less freedom for the dual optimizer one has.]\n    Following step 3(b) of the algorithm, we have \n    \n        ϕ(x_2)   =ϕ_2(x_2)+0+ϕ_2(x_2)-ϕ_2(x_2)=c_22=1;\n        ϕ(z_2)   =ϕ_2(z_2)+0+ϕ_2(x_2)-ϕ_2(x_2)=0;\n        ϕ(x_1)   =ϕ_1(x_1)+β_2+ϕ_2(x_2)-ϕ_1(x_1)=c_22+β_2=5-2√(3);\n        ϕ(z_1)   =ϕ_1(z_1)+β_2+ϕ_2(x_2)-ϕ_1(x_1)=c_22-c_11+β_2=4-2√(3).\n    \n    Further, step 3(c) yields\n    \n        ϕ(z_0)   =max(ϕ(x_1)-c_10,ϕ(x_2)-c_20)=1-√(3);\n        \n            ϕ(x_0)   =ϕ(z_0)+c_00=4-√(3).\n    \n    One can verify numerically that the function ϕ  defined above satisfies the conditions of a dual optimizer. \n     \n    \n    \n    \n    \n         \n    \n    \n    \n     §.§  Proof to Theorem <ref>\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    We prove Theorem <ref> in two parts. First, we prove there exists a solution (β_2,…,β_p) to (<ref>), in Lemma <ref>. Second, we prove that the function ϕ defined in (<ref>)-(<ref>) is indeed a local dual optimizer on S_[x_0,z_0].\n    \n    \n    \n           Suppose (x_1,z_1),…,(x_p,z_p) are ordered subpairs of pair (x_0,z_0) in the optimal assignment π. Define c_ij:=c(x_i,z_j). Then the system of inequalities, where for all 1≤ n<m≤ p:\n        \n        max(c_00+c_nn-c_0n-c_m0,c_nn-c_mn)≤∑_k=n+1^mβ_k≤min(c_0m+c_n0   -c_00-c_mm,c_nm-c_mm)\n    \n        admits a solution (β_2,…,β_p).\n     \n    We use Farkas' Lemma to prove our existence result, specifically, to have a necessary and sufficient condition for a system of linear inequalities to have a solution. We state Farkas' Lemma for completeness.\n    \n    Farkas.\n        Let A be a d_1× d_2 matrix, b∈^d_1, and let x=(x_1,…,x_d_2)^⊤ be a set of real-valued variables. Then the system Ax≥ b allows a set of solutions if and only if for any y∈ [0,∞)^d_1 such that y^⊤ A=0, it holds y^⊤ b≤ 0. \n    \n     We aim to show that equation (<ref>) admits a solution (β_2,…,β_p)∈^p-1. We observe that we can think of (<ref>) equivalently as the following set of inequalities: \n    \n        ∑_k=n+1^mβ_k ≥ c_00+c_nn-c_0n-c_m0\n           ∑_k=n+1^mβ_k ≥ c_nn-c_mn\n        \n        -    ∑_k=n+1^mβ_k ≥ c_mm - c_nm\n        \n        -    ∑_k=n+1^mβ_k ≥ c_00+c_mm-c_0m-c_n0\n    \n    for all 1 ≤ n < m  ≤ p. All inequalities implied by (<ref>) are thus linear in the variables (β_2,…,β_p). Matrix A is given by columns with values (-1,0,+1), while vector b is governed by the costs c. \n    \n    By Lemma <ref> it suffices to prove the following.[Equation (<ref>) is the analog of y^⊤ A=0 in the statement of Farkas' Lemma. Specifically, we use y^⊤ A=0 if and only if y^⊤ A z=0 for all z ∈ℝ^d_1. Applied to our setting, where β takes the position of x in Farkas' Lemma, this states that the weighted sum of all left-hand sides in the system of inequalities equals zero. Equation (<ref>) below is similarly the analog of y^⊤ b≤ 0 in the statement of Farkas' Lemma.] For any set of non-negative weights (λ^+_mn,λ^-_mn,ω^+_mn,ω^-_mn),1≤ n<m≤ p on each of the inequalities above such that \n    \n        ∑_1≤ n<m≤ p(λ^+_mn+ω^+_mn)∑_k=n+1^mβ_k= ∑_1≤ n<m≤ p(λ^-_m,n+ω^-_m,n)∑_k=n+1^mβ_k,  for all (β_2,…,β_p),\n    \n    it holds that\n    \n        ∑_1≤ n<m≤ p( _mn(c_00+c_nn-c_0n-c_m0)+_mn(c_nn-c_mn) ) \n           ≤∑_1≤ n<m≤ p( _mn(c_0m+c_n0-c_00-c_mm)+_mn(c_nm-c_mm) ) .\n    \n    \n    We start by simplifying equations (<ref>) and (<ref>). We first simplify equation (<ref>). Since (<ref>) has to hold for all (β_2,…,β_p), we note that the coefficient on each β_k has to equal zero. For each 2≤ k≤ p, equating the coefficients for some β_k requires\n    \n        ∑_m,n( λ^+_mn+ω^+_mn) =∑_m,n( λ^-_mn+ω^-_mn),\n    \n    where we sum over all (m,n) satisfying 1≤ n<k≤ m≤ p, that is, we sum over all equations where β_k appears. Furthermore, subtracting equation (<ref>) evaluated at k from equation (<ref>) evaluated at k+1 yields:\n    \n        ∑_k<m≤ p(_mk +_mk) - ∑_k<m≤ p(_mk+_mk) = ∑_1≤ n<k(_kn+_kn) - ∑_1≤ n<k(_kn+_kn),\n    \n     for all 2 ≤ k<p. \n    \n    We next simplify (<ref>). Rearranging (<ref>) by collecting terms by coefficients in front of c_ij leads to the equivalent form:\n    \n        ∑_1≤ n<m≤ p( λ^-_mn + λ^+_mn) c_00 + ∑_1<m≤ p( λ^-_m1+_m1) c_11 + ∑_1≤ n<p( λ^+_pn+_pn) c_pp\n           +∑_k=2^p-1( ∑_k<m≤ p( λ^-_mk+_mk) + ∑_1≤ n<k( λ^+_kn + _kn) ) c_kk\n           ≤∑_1<m≤ pλ^-_m1c_01+∑_1≤ n<pλ^+_pnc_0p+∑_1≤ n<pλ^-_pnc_p0+∑_1<m ≤ pλ^+_m1 c_10\n           +∑_k=2^p-1( ∑_1≤ n<kλ^+_kn+∑_k<m≤ pλ^-_mk) c_0k+ ( ∑_1≤ n<kλ^-_kn + ∑_k<m≤ pλ^+_mk) c_k0\n           +∑_1≤ n<m≤ p_mn c_mn +∑_1≤ n<m≤ p_mnc_nm,\n    \n    where the left-hand side of the inequality collects all “diagonal” elements, and the right-hand side collects all other elements.\n    \n    Our next step in proving that equation (<ref>) indeed holds, is to show that both sides of equation (<ref>) represent transport costs of an assignment between a measure of workers F̃ and a measure of jobs G̃. Specifically, consider the assignment problem between a measure F̃ and a measure G̃, satisfying:\n    \n        F̃   =∑_1≤ n<m≤ p(λ^-_mn+λ^+_mn)δ_x_0+∑_1<m≤ p(λ^-_m1+_m1)δ_x_1+∑_1≤ n<p(λ^+_pn+_pn)δ_x_p\n           +∑_k=2^p-1(∑_k<m≤ p(λ^-_mk+_mk)+∑_1≤ n<k( λ^+_kn+_kn))δ_x_k,\n    \n    and, similarly,\n    \n        G̃    = ∑_1≤ n<m ≤ p( λ^-_mn + λ^+_mn) δ_z_0 + ∑_1<m≤ p( λ^-_m1 + _m1) δ_z_1 + ∑_1≤ n<p( λ^+_pn + _pn) δ_z_p\n           + ∑_k=2^p-1( ∑_k<m≤ p(λ^-_mk+_mk)+∑_1≤ n<k( λ^+_kn+_kn) ) δ_z_k.\n    \n    Both measures may not be probability measures, but they do have the same total mass. \n    \n    The fact that the left-hand side of (<ref>) represents a transport cost between workers F̃ and jobs G̃ is evident. Under this assignment each worker type is assigned to an identically indexed job, which have identical masses by construction of the worker distribution F̃ in (<ref>) and the job distribution G̃ in (<ref>). To establish the same on the right-hand side requires work. Consider first the worker x marginal on the right-hand side of (<ref>).\n    \n    \n        \n      *  The mass on x_0 is \n        \n        \n        ∑_1<m≤ pλ^-_m1+∑_1≤ n<pλ^+_pn+∑_k=2^p-1(∑_1≤ n<kλ^+_kn+∑_k<m≤ pλ^-_mk) =∑_1≤ n<m≤ p( λ^-_mn+λ^+_mn).\n    \n        \n      *  Using equation (<ref>) with k=2, the mass on x_1 is\n        \n        ∑_1<m≤ pλ^+_m1+∑_1<m≤ p_m1=∑_1<m≤ p( λ^-_m1+_m1).\n    \n      *  For 2≤ k<p, using (<ref>) and grouping terms, the mass on x_k is \n        \n        ∑_1≤ n<kλ^-_kn+∑_k<m≤ pλ^+_mk+∑_1≤ n<k_k,n+∑_k<m≤ p_mk=∑_k<m≤ p(λ^-_mk+_mk)+∑_1≤ n<k(λ^+_kn+_kn).\n    \n      *  Using equation (<ref>) with k=p, the mass on x_p is \n        \n        ∑_1≤ n<p( λ^-_pn+_pn)= ∑_1≤ n<p( λ^+_pn + _pn).\n    \n    Combining these four terms we see that the x-marginal of the right-hand side of (<ref>) corresponds with that of (<ref>). We proceed to show that the same is true for the distribution of jobs.\n    \n    \n      *  The mass on z_0 is\n            \n        \n        ∑_1≤ n<p_pn+∑_1<m≤ p_m1+∑_k=2^p-1( ∑_1≤ n<kλ^-_kn+∑_k<m≤ pλ^+_mk)=∑_1≤ n<m≤ p( λ^-_mn+λ^+_mn),\n    \n        where the equality follows by simple accounting. \n        \n      *  The mass on z_1 is\n        \n        ∑_1<m≤ p_m1+∑_1<m≤ p_m1=∑_1<m≤ p( _m1+_m1).\n    \n      *  For 2≤ k<p, the mass on z_k is\n        \n        ∑_1≤ n<kλ^+_kn+∑_k<m≤ pλ^-_mk+∑_k<m≤ p_mk+∑_1≤ n<k_kn=∑_k<m≤ p( λ^-_mk+_mk) +∑_1≤ n<k( λ^+_kn+_kn).\n    \n      *  Finally, the mass on z_p is given by\n        \n        ∑_1≤ n<p_pn+∑_1≤ n<p_pn=∑_1≤ n<p ( λ^+_pn+_pn ).\n    \n    We have thus proved the marginal distributions on both sides of the costs (<ref>) are the worker distribution F̃ and the job distribution G̃. \n    \n    \n    \n    Why is the left-hand side of equation (<ref>) the optimal transportation cost between the worker distribution F̃ and job distribution G̃? To characterize an optimal assignment between the constructed measures F̃ and G̃, we decompose the corresponding measure of underqualification H̃ := F̃-G̃ into layers. By the definition of the worker measure F̃ in equation (<ref>) and the job measure G̃ in equation (<ref>), we know that for each k we have F̃(x_k)=G̃(z_k). This means each layer ℓ will consist of a subset S⊆{0,…,p} and the distributions within the layer F_ℓ and G_ℓ will be uniform on {x_k}_k∈ S and {z_k}_k∈ S respectively. From the assumption of the theorem we recall that the optimal assignment π pairs x_k with z_k for every k in the optimal assignment problem with uniform distributions on {x_k}_0≤ k≤ p and {z_k}_0≤ k≤ p. Since a restriction of an optimal assignment is also optimal on the restricted marginals, we know that an optimal assignment between F_ℓ and G_ℓ matches x_k to z_k for each k∈ S. After adding the layers, the same holds for an optimal assignment between F̃ and G̃ by the principle of layering. Therefore, the pairs { (x_k,z_k) } are paired under an optimal assignment between F̃ and G̃. This establishes the inequality (<ref>), hence we finally conclude (<ref>) has a solution.  Next, we continue to prove the second part of the result, that the function ϕ defined in (<ref>)-(<ref>) is indeed a local dual optimizer on S_[x_0,z_0]. \n    \n    \n    First, we record the following simple observation on our construction of ϕ in the case of overlapping masses.\n    \n    \n    \n    We will extensively make use of Lemma <ref>.\n    \n    \n    \n        Suppose h:[0,∞)→ is concave. Then for 0≤ x≤ y and a>0 we have\n        \n        h(x+a)-h(x)≥ h(y+a)-h(y).\n    \n        From concavity, it follows that\n        \n        h(y)+h(x+a)≥(y-x)h(y+a)+ah(x)/y+a-x+(y-x)h(x)+ah(y+a)/y+a-x=h(x)+h(y+a),\n    \n        completing the proof.\n     \n        Suppose (x_1,z_1),…,(x_p,z_p) are ordered subpairs of pair (x_0,z_0) in the optimal assignment π, and that ϕ_i are  dual potentials on S_[x_i,z_i]:=X_[x_i,z_i]∪ Z_[x_i,z_i] for all 1≤ i≤ p. Define c_ij=c_i,j:=c(x_i,z_j). We first prove that, with the possibilities of multiple workers on the same skill level and multiple jobs on the same difficulty level, our  ϕ in (<ref>)-(<ref>) is well-defined.\n        \n      *  Suppose that x_n=x_n+1 or z_n=z_n+1 for some 1≤ n<p. Then any solution (β_2,…,β_p) to the system of inequalities (<ref>) satisfies\n            \n        max(c_00-c_0n-c_n+1,0,-c_n+1,n)+c_nn≤β_n+1≤min(c_0,n+1+c_n0-c_00,c_n,n+1)-c_n+1,n+1.\n    \n            As a consequence,\n            \n        c_nn-c_n+1,n≤β_n+1≤ c_n,n+1-c_n+1,n+1,\n     and hence we must have \n            β_n+1=c_nn-c_n+1,n+1. In particular, the ϕ defined in (<ref>) satisfies ϕ(x_n)=ϕ(x_n+1) in the case x_n=x_n+1, and ϕ(z_n)=ϕ(z_n+1) in the case z_n=z_n+1.\n            \n      *  Suppose that z_0=z_1 and x_0≠ x_1. We first prove that\n            \n        max_i∈{1,…,p} (ϕ(x_i)-c(x_i,z_0))=ϕ(x_1)-c(x_1,z_0).\n    \n            Indeed, for any i∈{1,…,p}, it holds that\n            \n        ϕ(x_1)-c(x_1,z_0)=ϕ(x_1)-c(x_1,z_1)=ϕ(z_1)≥ϕ(x_i)-c(x_i,z_1)=ϕ(x_i)-c(x_i,z_0).\n    \n            Therefore, by (<ref>), \n            \n        ϕ(z_0)=ϕ(x_1)-c(x_1,z_0)=ϕ(x_1)-c(x_1,z_1)=ϕ(z_1).\n    \n      *  Suppose that x_0=x_1. Similarly as in step 2 above, we have \n            \n        ϕ(x_0)=ϕ(z_1)+c(x_0,z_1)=ϕ(z_1)+c(x_1,z_1)=ϕ(x_1).\n    \n      *  Suppose that x_0=x_1 and z_0=z_1. We need to show that \n            \n        max_i∈{1,…,p} (ϕ(x_i)-c(x_i,z_0))=min_i∈{1,…,p}(ϕ(z_i)+c(x_0,z_i))-c(x_0,z_0).\n    \n            This is because the left-hand side of (<ref>) is equal to ϕ(z_1) by step 3 and the right-hand side of (<ref>) is equal to ϕ(x_1)-c_00 by step 2. Since c_00=c_11-ϕ(x_1)-ϕ(z_1), this proves (<ref>).\n        \n        \n     We prove that ϕ is a local dual optimizer on the domain S_[x_0,z_0]∖{x_0,z_0}. Suppose that both  x∈ X_[x_n,z_n] and z∈ Z_[x_m,z_m]. The equality ϕ(x)-ϕ(z)=c(x,z) when (x,z) is a worker-job pair is obvious because the same condition is satisfied by ϕ_i for all 1≤ i≤ p. Our goal is to prove ϕ(x)-ϕ(z)≤ c(x,z) when worker x and job z are not paired.\n    \n    We consider three cases.\n    \n    Case I: n=m.  This follows immediately since ϕ_n is a dual potential on S_[x_n,z_n].\n    \n    Case II: n<m. Observe\n    \n        ϕ(x)-ϕ(z)    = ( ϕ(x)-ϕ(z_n) )-∑_k=n^m(ϕ(x_k)-ϕ(z_k))+∑_k=n+1^m(ϕ(x_k-1)-ϕ(z_k))+(ϕ(x_m)-ϕ(z))\n           ≤ c(x,z_n)-∑_k=n^mc_kk+∑_k=n+1^m(β_k+c_kk)+c(x_m,z) \n           = c(x,z_n)-c_nn+c(x_m,z)+∑_k=n+1^mβ_k\n           ≤ c(x,z_n)-c_nn+c_nm-c_mm+c(x_m,z).\n    \n    The first inequality follows since both ϕ(x) - ϕ(z_n) ≤ c(x,z_n) and ϕ(x_m) - ϕ(z) ≤ c(x_m,z) follow from the dual potential within the same part, and ϕ(x_k)-ϕ(z_k) = c_kk follows by the dual potential within the same part for paired workers and jobs, and finally β_k+c_kk = ϕ(x_k-1)-ϕ(z_k) by the definition of the constants a_i in statement of the theorem. The final inequality is implied by the upper bound on ∑_k=n+1^mβ_k from (<ref>). To show ϕ(x)-ϕ(z)≤ c(x,z), it suffices to prove\n    \n        c(x,z_n)+c(x_m,z)-c(x,z)≤ c_nn+c_mm-c_nm.\n     \n    Note that c(x,z_n)≤ c(x_n,z_n) and c(x_m,z)≤ c(x_m,z_m). There are four cases:\n    \n      * z_n≤ x_n≤ z_m≤ x_m. Then c(x,z)≥ c(x_n,z_m) and the claim follows.\n        \n      * x_n≤ z_n≤ z_m≤ x_m. In this case z_n-x≤ z_n-x_n. Applying Lemma <ref> with a=z-z_n yields c(x,z_n)-c(x,z)≤ c(x_n,z_n)-c(x_n,z)≤ c(x_n,z_n)-c(x_n,z_m). Using that c(x_m,z)≤ c(x_m,z_m) equation (<ref>) follows.\n        \n      * z_n≤ x_n≤ x_m≤ z_m. In this case z-x_m≤ z_m-x_m. Applying Lemma <ref> with a=x_m-x_n yields c(x_m,z)-c(x,z) ≤ c(x_m,z)-c(x_n,z)≤ c(x_m,z_m)-c(x_n,z_m), where the first inequality follows from c(x_n,z) ≤ c(x,z). Further using c(x,z_n)≤ c(x_n,z_n), equation (<ref>) follows.\n        \n      * x_n≤ z_n≤ x_m≤ z_m. In this case, the configuration between x_n and z_n is identical to Case 2, and the configuration between x_m and z_m is identical to Case 3. We apply Lemma <ref> exactly as in Case 2 and in Case 3. First, c(x,z_n)-c(x,z)≤ c(x_n,z_n)-c(x_n,z). Second, c(x_m,z)-c(x_n,z)≤ c(x_m,z_m)-c(x_n,z_m). Summing the two inequalities delivers inequality (<ref>).\n    \n    This completes the proof of (<ref>) for Case II.\n    \n    Case III: n>m. Observe that\n    \n        ϕ(x)-ϕ(z)   =(ϕ(x)-ϕ(z_n))+∑_k=m+1^n-1(ϕ(x_k)-ϕ(z_k))-∑_k=m+1^n(ϕ(x_k-1)-ϕ(z_k))+(ϕ(x_m)-ϕ(z))\n           ≤ c(x,z_n)+∑_k=m+1^n-1c_kk-∑_k=m+1^n(β_k+c_kk)+c(x_m,z) \n           = c(x,z_n)-c_nn+c(x_m,z)-∑_k=m+1^nβ_k\n           ≤ c(x,z_n)-c_nn+c_nm-c_mm+c(x_m,z).\n    \n    The first inequality follows since both ϕ(x) - ϕ(z_n) ≤ c(x,z_n) and ϕ(x_m) - ϕ(z) ≤ c(x_m,z) follow from the dual potential within the same part, and ϕ(x_k)-ϕ(z_k) = c_kk follows by the dual potential within the same part for paired workers and jobs, and finally β_k+c_kk = ϕ(x_k-1)-ϕ(z_k) by the definition of the constants a_i in statement of the theorem. The final inequality is implied by the upper bound on ∑_k=n+1^mβ_k from (<ref>). The rest follows similarly as in Case II.\n    \n    \n     It then remains to check that ϕ is a dual potential on S_[x_0,z_0], that is, to show that\n    \n      * ϕ(x_0)-ϕ(z_0)=c(x_0,z_0);\n        \n      *  For x∈ X_[x_0,z_0]∖{x_0}, ϕ(x)-ϕ(z_0)≤ c(x,z_0);\n        \n      *  For z∈ Z_[x_0,z_0]∖{z_0}, ϕ(x_0)-ϕ(z)≤ c(x_0,z).\n    \n    In view of (<ref>) and (<ref>), it remains to prove  \n    \n        min_1≤ i≤ p(ϕ(z_i)+c(x_0,z_i))-max_1≤ i≤ p (ϕ(x_i)-c(x_i,z_0))≥ c(x_0,z_0).\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    Equivalently, it suffices to show that\n        ϕ(x)-ϕ(z)≤ c(x_0,z)+c(x,z_0)-c_0,0\n    \n    for all x∈ X_[x_0,z_0]∖{x_0} and z∈ Z_[x_0,z_0]∖{z_0}. Recall that ϕ(x_i-1)-ϕ(z_i)=β_i+c_ii for 2≤ i≤ p by the definition of the constants in the statement of the theorem. Again, we have the three cases of Figure <ref> to consider to show that the sufficient condition (<ref>) is satisfied.\n    \n    Case I: n=m. By symmetry, we may assume x_0<z_0. Consider first the case z_n≤ x_n.  Since ϕ_n is  a dual potential on S_[x_n,z_n], we have ϕ(x)-ϕ(z)≤ c(x,z).  Since π is optimal,\n    \n        c(x,z)+c(x_0,z_0)≤ c(x_n,z_n)+c(x_0,z_0)≤ c(x_n,z_0)+c(x_0,z_n)≤ c(x,z_0)+c(x_0,z).\n    \n    where the first inequality follows since (x,z) ∈ (x_n,z_n), the second follows by optimality, and the third one follows since z_n≤ x_n and x_0<z_0.\n    \n    \n    \n    \n    \n    Using the above inequality, we write:\n    \n        ϕ(x)-ϕ(z)≤ c(x,z) ≤ c(x_0,z)+c(x,z_0)-c_00,\n     \n    verifying (<ref>). \n    \n    Next, we consider the case where x_n<z_n. By the property of no intersecting pairs, it follows that\n    \n        c(x_n,z_n)+c(x_0,z_0)≤ c(x_0,z_n)+c(x_n,z_0).\n    \n    Furthermore, two applications of Lemma <ref> yield both\n    \n        c(x_0,z_n)-c(x_0,z)≤ c(x_n,z_n)-c(x_n,z)\n    \n    when a = z_n -z and \n    \n        c(x_n,z_0)-c(x,z_0)≤ c(x_n,z_n)-c(x,z_n).\n    \n    when a = z_0 - z_n. Summing up equations (<ref>), (<ref>), and (<ref>) yields\n    \n        c(x_0,z_0)+c(x,z_n)+c(x_n,z)≤ c(x_0,z)+c(x,z_0)+c(x_n,z_n).\n    \n    Since  π is optimal, we have \n    \n        ϕ(x)-ϕ(z)   ≤ c(x,z) ≤ c(x,z_n)+c(x_n,z)-c(x_n,z_n)≤ c(x_0,z)+c(x,z_0)-c_00,\n    as desired by (<ref>).\n    \n    Case II: n<m. Similar to the other Case II discussed above, we obtain\n    \n        ϕ(x)-ϕ(z)   ≤  c(x,z_n)-c_nn+c(x_m,z)+∑_k=n+1^mβ_k\n           ≤ c(x,z_n)-c_nn+c_0m+c_n0-c_00-c_mm+c(x_m,z),\n    \n    where the second inequality follows from the upper bound in (<ref>). To prove equation (<ref>) it suffices to show that the upper bound in the previous equation is below the upper bound in equation (<ref>), or\n    \n        c(x,z_n)+c(x_m,z)-c(x_0,z)-c(x,z_0)   ≤ c(x_n,z_n)+c(x_m,z_m)-c(x_n,z_0)-c(x_0,z_m).\n    \n    We observe that the arcs (x,z_0) and (x_n,z_n) intersect, but that the arcs (x,z_n) and (x_n,z_0) do not cross. By Lemma <ref>, describing that intersecting pairs are never optimal, we thus have \n    \n        c(x,z_n)+c(x_n,z_0)≤ c(x,z_0)+c(x_n,z_n).\n    \n    Similarly, the arcs (x_0,z) and (x_m,z_m) intersect, but the arcs (x_0,z_m) and (x_m,z) do not intersect. Thus, by the property of no intersecting pairs,\n    \n        c(x_0,z_m)+c(x_m,z)≤ c(x_0,z)+c(x_m,z_m).\n     Summing up (<ref>) and (<ref>) yields (<ref>) and hence completes the proof of Case II.\n    \n    \n    \n    \n    \n    \n    Case III: n>m. We have\n    \n        ϕ(x)-ϕ(z)   ≤  c(x,z_n)-c_nn+c(x_m,z)-∑_k=m+1^nβ_k \n           ≤ c(x,z_n)-c_nn-c_00-c_mm+c_0m+c_n0+c(x_m,z),\n    \n    where the last step follows from (<ref>). Inequality (<ref>) coincides with inequality (<ref>) in Case II. Then (<ref>) follows in exactly the same way from (<ref>) as in Case II. Finally, we emphasize that our  construction relies on the concavity of the mismatch cost function c(x,z) in two respects. First, the property of no intersecting pairs is essential for our induction structure. Second, (<ref>) requires concavity as well.\n    \n    \n    \n     §.§ Proof to Theorem <ref>\n    \n    \n    In this appendix, we prove Theorem <ref>. We make use of Lemma <ref> and Lemma <ref>, which we prove first. \n    \n    Triangle Inequality.\n        For all x,y,z∈, it holds that c(x,y)+c(y,z)≥ c(x,z).\n    \n    Our cost of mismatch takes the form c(x,z)=h(z-x) where h is strictly concave and increasing on [0,∞), strictly concave and decreasing on (-∞,0], satisfying h(0)=0. \n    \n    The case where x=z is trivial, so we focus our attention to the case where x ≠ z. By symmetry, we assume x< z without loss of generality. If z-y≥ z-x > 0, then necessarily c(y,z)≥ c(x,z) and hence c(x,y)+c(y,z)≥ c(x,z). The same argument applies when y - x ≥ z-x > 0. In the remaining scenario where both (z-y) and (y-x) are in [0,z-x), we have by concavity of h that[The interval is bounded below by zero because when z-y ≥ z-x is not true, then y-x>0, and similarly when y-x ≥ z-x is not true then z-y > 0.]\n        c(x,y)+c(y,z)   =h(y-x)+h(z-y)≥y-x/z-x  h(z-x) + z-y/z-x  h(z-x)=h(z-x)=c(x,z),\n    \n    where the inequality follows since y - x = y-x/z-x× (z-x) + z-y/z-x× 0. This completes the proof.    \n    \n    \n    \n    In the main text, we established the connection between the dual optimizers for the cost minimization problem and the dual optimizers for the output maximization problem. In this appendix, we exploit this connection to simplify the exposition to the proof of Theorem  <ref>. Specifically, we use that we can equivalently characterize the dual functions (ϕ,ψ) for the overlapping segments of the worker and the job distribution, with the understanding that we can obtain wages and job values using w(x) = g(x) - ϕ(x) and v(z)=h(z) - ψ(z), where y(x,z)= g(x) + h(z) - c(x,z). \n    \n    To formulate Theorem <ref> in terms of the dual potentials for the mismatch cost minimization problem, we need to describe our sequential construction of the functions. For the interpretation of these objects we refer the reader to the main text. We define sequentially the dual maps, analogous to our previous definitions (<ref>) and (<ref>). Starting from ϕ̃=g-w̃, where w̃ are the dual values for mismatched workers x ∈ I, let \n    \n        ψ̃(z):=min_x ∈ I c(x,z) - ϕ̃(x)  and  ϕ̂(x):=min_z∈ I∪ Jc(x,z)-ψ̃(z) ,\n     \n    where we recall that J is the set of mismatched jobs. Moreover, let\n    \n        ψ̂(z):=min_x ∈ I ∪ J  c(x,z) - ϕ̂(x),\n    ϕ(x)=ϕ̂(x) for x∈ I,  ψ(z)=ψ̂(z) for z∈ J, and set ϕ(x)=-ψ(x)  for x∈ J and ψ(z)=-ϕ(z) for z∈ I. Finally, we define for x∈ K\n        ϕ(x)=min_z∈ I∪ Jc(x,z)-ψ(z)\n    \n    and ψ(z)=-ϕ(z) for z∈ K. \n    It is easy to check that with these definitions, ϕ=g-w and ψ=f-v, with w,v given in Theorem <ref>.\n    \n    To prove the result, we first define c-conjugate functions.\n    \n    \n     For ϕ: I →, we define the c-conjugate function for all jobs z ∈ J as\n    \n        ϕ^c(z) := min_x∈ I  c(x,z) - ϕ(x).\n    \n    Denote by c̅(z,x)=c(x,z) and we further define for x∈ I\n        ϕ^cc̅(x)=(ϕ^c)^c̅(x) = min_z∈ J c̅(z,x) - ϕ^c(z)=min_z∈ J c(x,z) - ϕ^c(z).\n     Given these definitions, the following statements follow:[See Chapter 1 of  <cit.> for further details.]\n      * ϕ^cc̅≥ϕ. \n    \n        This follows since for each x∈ I and z∈ J, ϕ(x)+ϕ^c(z)≤ c(x,z) or ϕ(x) ≤ c(x,z) - ϕ^c(z) by the definition of the c-conjugate function. By taking the infimum z ∈ J this leads to ϕ^cc̅(x)≥ϕ(x) by the definition (<ref>). \n    \n        \n      *  If  ϕ=ψ^c̅ for some ψ, then ϕ=ϕ^cc̅.\n     \n        First, we observe that ϕ=ψ^c̅ naturally implies ϕ^c=ψ^c̅c. To see this, note that ϕ^c=ψ^c̅c≥ψ which follows from the previous statement. This inequality, by uniformly decreasing from ϕ^c to ψ, together with the definition (<ref>), implies we uniformly increase the conjugate, or ϕ^cc̅=(ϕ^c)^c̅≤ψ^c̅=ϕ. We establish ϕ=ϕ^cc̅ by combining ϕ^cc̅≤ϕ with Statement 1. \n    \n        \n        \n        \n      *  If (ϕ,ψ) is an optimal dual pair, then so is (ϕ,ϕ^c). \n    \n        Suppose (ϕ,ψ) is a dual pair, then ϕ(x)+ψ(z)≤ c(x,z). It holds by the definition in (<ref>) that ϕ(x)+ϕ^c(z)≤ c(x,z) as well as ϕ^c(z)≥ψ(z). Since ϕ^c(z)≥ψ(z) and (ϕ,ϕ^c) is a dual solution, it follows that if (ϕ,ψ) is a solution to the dual maximization problem, then so is (ϕ,ϕ^c). \n        \n    ϕ̂(x)+ψ̃(z)≤ c(x,z) for all workers x and jobs z such that x,z ∈ I∪ J, and equality holds for (x,z)∈Γ_π.\n     That ϕ̂(x)+ψ̃(z)≤ c(x,z) follows from definition of the dual optimizer for workers ϕ̂(x) in (<ref>). Next, we prove ϕ̂(x)+ψ̃(z) = c(x,z) for all workers and jobs (x,z) ∈Γ_π. \n    \n    To prove that ϕ̂(x)+ψ̃(z) = c(x,z) for workers and jobs (x,z) ∈Γ_π, we fix some pair (x,z) ∈Γ_π. Since (ϕ̃, ϕ̃^c) is a dual solution to the assignment problem between remaining workers and jobs, ϕ̃(x)+ϕ̃^c(z) = c(x,z) for all (x,z) ∈Γ_π. Given the definition of the dual value for jobs z ∈ I ∪ J in (<ref>) we obtain that ψ̃(z) =min_x ∈ I c(x,z) - ϕ̃(x) = ϕ̃^c(z) and hence that ϕ̃(x)+ψ̃(z) = c(x,z) for all (x,z) ∈Γ_π. To conclude the proof it remains to show that ϕ̂(x)=ϕ̃(x) for every worker x∈ I. \n    \n    We next show that ϕ̂(x)=ϕ̃(x) for every worker x∈ I. Since we replaced, without loss of generality, the dual potential ϕ̃ by  the c-transform ϕ̃^cc̅,[We can always improve on the original ϕ̃ by doing a double c-conjugate transform by Statement 1 that is weakly better in terms of the dual maximization problem, see Remark 1.13 in <cit.>.]  it follows from the definition of the c-transform that for all x ∈ I:\n    \n        ϕ̃(x) = ϕ̃^cc̅(x) = min_z ∈ J c(x,z) - ϕ̃^c(z) .\n    \n    Further, since z∈ J, by definition of the dual potential for jobs ψ̃(z) =min_x ∈ Ic(x,z) - ϕ̃(x) = ϕ̃^c(z), where the second equality follows from the definition of the c-transform. We substitute this relationship into the previous expression for ϕ̃(x) to write\n    \n        ϕ̃(x) = min_z ∈ J c(x,z) - ϕ̃^c(z) = min_z ∈ J c(x,z) - ψ̃(z) .\n    \n    \n    We can use the definition of the dual optimizers (<ref>) to write that for all workers x ∈ I: \n    \n        ϕ̂(x)=min( min_z∈ J c(x,z) - ψ̃(z) , min_z∈ Ic(x,z)-ψ̃(z) ) = min( ϕ̃(x), min_z∈ Ic(x,z)-ψ̃(z) )\n    \n    where the first equality follows by splitting the sets in (<ref>) and the second equality follows from the equation above. \n    \n    Hence, we want to show for (x,z) ∈ I the infimum is attained by ϕ̃(x). We show c(x,z) ≥ψ̃(z) + ϕ̃(x). This follows since the dual optimizer for all jobs is defined as ψ̃(z):=min_x ∈ I c(x,z) - ϕ̃(x)\n    for all z ∈ I∪ J.\n     Having established the two claims, we next prove Theorem <ref>. \n    \n     The proof is divided in three parts. We first show the inequality holds on I∪ J. To do so, we consider four cases:\n    \n    \n      *  If x∈ I and z∈ J, we have\n    \n        ϕ(x)+ψ(z)   =ϕ(x)-ϕ(z)=ϕ̂(x)-max_x∈ I∪ J(ϕ̂(x)-c(x,z)) ≤ c(x,z)\n    \n    because in the final step we subtract the maximum, but a feasible deduction is ϕ̂(x)-c(x,z).\n    \n      *  If x,z ∈ I, then by Lemma <ref> we have\n    \n        ϕ(x)+ψ(z)=ϕ(x)-ϕ(z)   =ϕ̂(x)-ϕ̂(z) =min_y∈ I∪ J(c(x,y)-ψ̃(y))- min_y∈ I∪ J(c(z,y)-ψ̃(y))≤ c(x,z)\n    \n    where the final equality follows by (<ref>). The concluding inequality is obtained as follows. Suppose y_0 attains the infimum for the second term, the same y_0 may not attain the infimum for the first term but is feasible, so the left hand side will be lower than when both terms are evaluated at y_0, or min_y∈ I∪ J(c(x,y)-ψ̃(y))-min_y∈ I∪ J(c(z,y)-ψ̃(y))≤ c(x,y_0) - c(z,y_0). We combine the right-hand side with the triangle inequality of Lemma <ref> to write c(x,z) + c(z,y_0) ≥ c(x,y_0) or c(x,z) ≥ c(x,y_0)- c(z,y_0) to obtain the inequality. \n    \n      *  If x∈ J and z ∈ I. \n    \n        ϕ(x) + ψ(z)     = max_y∈ I∪ J( ϕ̂(y)-c(y,x) ) - ϕ̂(z).\n    \n    We next want to show that this expression is less than c(x,z). This is equivalent to showing that ϕ̂(y)-c(y,x) ≤ c(x,z) + ϕ̂(z) for all y ∈ I∪ J. To establish this, fix y, and evaluate: \n    \n        ϕ̂(y) - ϕ̂(z)     = min_w∈ I∪ J  ( c(y,w)-ψ̃(w) ) - min_w∈ I∪ J  ( c(z,w)-ψ̃(w) )\n    \n    where the  equality follows from the definition of ϕ̂ in equation (<ref>). Let w_0 be the value that attains the infimum in the second term on the right, which is also feasible for the first term so that ϕ̂(y) - ϕ̂(z) ≤ c(y,w_0) - c(z,w_0). To bound this further, we use the triangle inequality of Lemma <ref> twice to write c(y,w_0)- c(z,w_0) ≤ c(y,z) as well as c(y,z) ≤ c(y,x) + c(x,z). Using the triangle inequalities, we thus write ϕ̂(y) - ϕ̂(z) ≤ c(y,x) + c(x,z) which is what we wanted to show since y is arbitrary.\n    \n    \n      *  If worker and job x,z∈ J, use (<ref>) to write\n    \n        ϕ(x) + ψ(z)     = max_y∈ I∪ J(ϕ̂(y)-c(y,x)) - max_y∈ I∪ J(ϕ̂(y)-c(y,z)).\n    \n    To bound the right-hand side, let y_0 denote the value that attains the supremum in the first term, that is also feasible for the second term. Hence, the right-hand side is bounded above by -c(y_0,x) + c(y_0,z). By the triangle inequality of Lemma <ref> it follows that -c(y_0,x) + c(y_0,z) ≤ c(x,z) and hence we have ϕ(x) + ψ(z) ≤ c(x,z).\n     The second part of the proof shows that the equality holds  everywhere on I∪ J with respect to the optimal assignment π. We distinguish two cases:\n    \n      *  The worker is perfectly matched to their job, or (x,z)∈{(x,x):x∈}. Since the dual functions are defined as ψ(x) = - ϕ(x) we have ϕ(x)+ψ(x)=0. As a result, ϕ(x)+ψ(x)=0=c(x,x), as the cost of mismatch is zero.\n        \n      *  The worker is mismatched in their job, or (x,z)∈Γ_π, implying worker x∈ I and job z∈ J. Using definition (<ref>), ψ(z) = - ϕ(z),\n    \n        ϕ(x)+ψ(z)   =ϕ̂(x)-max_y∈ I∪ J(ϕ̃(y)-c(y,z)).\n    \n    By Lemma <ref>, ϕ̂(x)+ψ̃(z)≤ c(x,z) for all (x,z). In particular, for a given job z, ϕ̂(x)+ψ̃(z)≤ c(x,z) for all x, and min_x∈ I∪ J (c(x,z) -ϕ̂(x) ) ≥ψ̃(z), or, equivalently, -max_x∈ I∪ J(ϕ̂(x)-c(x,z)) ≥ψ̃(z). Combining this inequality with the previous expression, we obtain the inequality \n    \n        ϕ(x)+ψ(z)   ≥ϕ̂(x) + ψ̃(z) = c(x,z)\n    \n    where the final equality follows by Lemma <ref>. Since we have shown the opposite inequality above in the first case of the first part to this proof, we obtain that ϕ(x)+ψ(z)= c(x,z).\n     In the third part of the proof we further establish that the dual inequality ϕ(x)+ψ(z)≤ c(x,z) holds when x∈ K or z∈ K. There are three cases.\n    \n      * x∉K, z∈ K. For any x'∉K, we have ϕ(x)+ψ(x') = ϕ(x) - ϕ(x') ≤ c(x,x') when x∉K by the first part of this proof. Following the triangle inequality of Lemma <ref>,\n        ϕ(x)-ϕ(x') ≤ c(x,x')≤ c(x,z)+c(z,x'), giving ϕ(x)- c(x,z) ≤ c(z,x') + ϕ(x') = c(z,x') - ψ(x'). Taking infimum over x'∈ I∪ J gives ϕ(x)-c(x,z)≤ϕ(z)=-ψ(z) using the definition of ϕ.\n        \n        \n      * x∈ K, z∉K. For any x'∈ I∪ J, by the definition of the wage function, we have that\n        ϕ(x) = min_x' ∈ I ∪ J c(x,x') - ψ(x'), such that ϕ(x) - ϕ(x') ≤ c(x,x') ≤ c(x,z)+c(z,x'), where the final step follows by the triangle inequality of Lemma <ref>. Alternatively, we write ϕ(x) - c(x,z) ≤  c(z,x') - ψ(x'). Taking infimum in x'∈ I∪ J gives ϕ(x)+ψ(z)≤ c(x,z) using the definition of ϕ.\n        \n      * x,z∈ K. We want to establish \n        ϕ(x)+ψ(z)≤ c(x,z). Using the definitions of the dual potentials in (<ref>), \n    \n        ϕ(x)+ψ(z) = min_x' ∈ I ∪ J( c(x,x') - ψ(x') ) + max_x' ∈ I ∪ J( - c(z,x') + ψ(x') ) .\n    \n        Suppose the maximum in the second term is attained by the worker value x_0, and also evaluate the first term at x_0 where it may not attain the minimum, implying ϕ(x)+ψ(z) ≤ c(x,x_0) - c(z,x_0). By the triangle inequality c(x,x_0) - c(z,x_0) ≤ c(x,z) and hence it indeed follows that ϕ(x)+ψ(z)≤ c(x,z).\n    \n    By observing that ϕ=-ψ on the set K, the equality ϕ(x)+ψ(z)=0= c(x,z) holds when x,z∈ K and (x,z)∈Γ_π. This completes the proof in view of Lemma <ref>.\n    \n    \n    \n     Composite Sorting \n     Technical Appendix \n      Job Boerma, Aleh Tsyvinski, Ruodu Wang, and Zhenyuan Zhang \n     March 2023\n    \n    \n    \n    § ADDITIONAL RESULTS\n    \n    \n    In this appendix we present additional technical results.\n    \n    \n    \n     §.§ General Production Function\n    \n    \n    In this section, we present two generalizations of the model.\n    \n    \n    \n      §.§.§ Concave Distance Function\n    \n    \n    Using Legendre transformations, we show that the indirect output function is generally a strictly concave function in mismatch given strictly convex cost functions. To be specific, consider the same cost function Ψ as above, and use d:=|x-y| to denote the distance to obtain: \n    \n        𝒞(d) = min_γ≥ 0 γ d + Ψ(γ)\n    \n    This problem has a unique solution characterized by d = - Ψ'(γ(d)). From the envelope condition, we obtain 𝒞'(d)= γ > 0, showing that the cost function is strictly increasing in the distance.\n    \n    To characterize the second derivative, we write the cost minimization problem as a maximization problem of the form:\n    \n        𝒞̂(d) = max_γ≥ 0  - γ d - Ψ(γ)\n    \n    where 𝒞̂ = - 𝒞 which shows 𝒞̂ is the Legendre transformation of the strictly convex function Ψ. Since the Legendre transformation of a strictly convex function is also strictly convex, the indirect cost function 𝒞 is a strictly concave function of the distance.  As a result, choosing an assignment to maximize:\n    \n        y(x,z) = z + x - 𝒞(|x-y|)\n    \n    where 𝒞 is now our concave cost distance function.\n    \n    \n    \n      §.§.§ Asymmetric Distance Function\n    \n    \n    Next, we incorporate differential distance functions for both x - z > 0 and x - z < 0. This is a trivial extension, let Ψ̅ denote the cost function for x - z > 0 and Ψ denote the cost function for x - z < 0. In this case, the cost minimization problem is:\n    \n        𝒞̅(d) = min_γ≥ 0 γ d + Ψ̅(γ)\n    \n    when d > 0. By the same arguments on the Legendre transformation, this gives rise to a strictly concave function of the distance 𝒞̅(d). Analogously, when d < 0, we generically obtain a distinct strictly concave function of the distance 𝒞(d). As a result, we choose an assignment to maximize:\n    \n        y(x,z) = z + x - 𝒞̅({x-y }_+) - 𝒞({y-x }_+).\n    \n    \n     §.§ Convex Cost of Mismatch\n    \n    \n    We show that the optimal assignment features positive sorting when the mismatch cost function is strictly convex in the distance between worker skills and job difficulties. We establish this by showing that the cost function is submodular when the mismatch cost function is strictly convex. In turn, the production function is strictly supermodular, and hence the optimal sorting is positive following <cit.>.\n    \n    Convex Cost of Mismatch.\n        Suppose c(x,z)=h(z-x) with h:→ strictly convex.  Then the mismatch cost function c is strictly submodular. \n    \n        To establish that the cost of mismatch is submodular, we need to establish that \n        \n        c(x_1,z_1)+c(x_2,z_2)<c(x_1,z_2)+c(x_2,z_1),\n    \n        for any x_1<x_2 and z_1<z_2. \n    \n    \n        \n    It follows from the strict convexity of the cost function that h(z_1-x_1)≤ c_1h(z_1-x_2)+c_2h(z_2-x_1) where the weighting coefficients are c_1= (z_2-x_1)-(z_1-x_1)/(z_2-x_1)-(z_1-x_2) and c_2=1-c_1 = (z_1-x_1)-(z_1-x_2)/(z_2-x_1)-(z_1-x_2).[We observe that c_1 (z_1 - x_2) + (1- c_1) (z_2-x_1) = z_2-x_1 + c_1 ((z_1 - x_2) -(z_2-x_1) ) = z_2-x_1 - ((z_2-x_1)-(z_1-x_1)) = (z_1 - x_1) and further note that the coefficient c_1 is between 0 and 1 since the denominator is positive the numerator is positive but smaller than the denominator.] Analogously, it follows that h(z_2-x_2)≤ c_2 h(z_1-x_2)+c_1h(z_2-x_1).[For completeness, we observe that c_2 (z_1 - x_2) + (1- c_2) (z_2-x_1) = z_2-x_1 + c_2 ((z_1 - x_2) -(z_2-x_1) ) = z_2-x_1 - ((z_1-x_1)-(z_1-x_2)) = (z_2 - x_2).] We use these two inequalities to show that\n    \n        c(x_1,z_2) + c(x_2,z_1) = h(z_2-x_1) + h(z_1-x_2) > h(z_1-x_1)+h(z_2-x_2) = c(x_1,z_1) + c(x_2,z_2),\n    \n    where the inequality follows by addition of the two previous inequalities. \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n     \n    \n    \n    \n    \n    \n    \n       \n       \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n     \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n     §.§ Efficiency Properties of Algorithm\n    \n    \n    \n    Recall our algorithm for computing dual potentials from Appendix <ref>. The total runtime is dominated by the runtime for solving the system of inequalities (<ref>), which we recall as follows. Suppose that (x_1,z_1),…,(x_p,z_p) are ordered subpairs of pair (x_0,z_0) in the optimal assignment π. Define c_ij:=c(x_i,z_j). Then the system of inequalities, where for all 1≤ n<m≤ p: \n        \n        max(c_00+c_nn-c_0n-c_m0,c_nn-c_mn)≤∑_k=n+1^mβ_k≤min(c_0m+c_n0   -c_00-c_mm,c_nm-c_mm)\n    \n        (a) admits a solution (β_2,…,β_p).\n    \n    Since the system of inequalities (<ref>) can be solved via linear programming in p steps where p≤ n, the worst-case runtime for our algorithm is O(n^4) (when p=n). However, it becomes much more efficient when more layers of arcs are introduced. This is because compared with the trivial linear programming, our algorithm solves the problem in the order from bottom arcs to top, while at each step the values of ϕ in the hidden arcs need not be computed again, but only adjusted with  constant factors. Typically, the number N will not be as large as n. The following proposition provides a general upper bound of the number N, which is a consequence of the absence of intersecting pairs. Define the number of crossings of F-G at x ∈ as\n    \n        C_F-G(x):=∑_1≤ k≤ n_{(F-G)(x_k)=x}+∑_1≤ k≤ n_{(F-G)(z_k)=x}.\n    \n    In other words, every time a flat part of F-G takes value x, we count that as an x-crossing. Note that this is nonzero only if nx∈ℤ and |x|≤ 1.\n    \n    \n        Suppose that (x_1,z_1),…,(x_p,z_p) are the ordered subpairs of the pair (x_0,z_0) in the optimal matching π. Then there exists x ∈ℤ / n such that the measure of underqualification F-G crosses the level x for N times, i.e., C_F-G(x)≥ N.\n    \n        Consider numbers t_i∈(max(x_i,z_i),min(x_i+1,z_i+1)), 1≤ i<p. By the property of no intersecting pairs, F(t_i)-G(t_i) is a constant in i. On the other hand, F-G cannot be constant on the interval [t_i,t_i+1]. Thus the claim follows.    \n        \n    \n    \n    In fact, the number of crosses of F-G at a certain level is typically much smaller if we consider empirical processes. By empirical we mean that  X_1,…,X_n are random samples drawn independently from  distribution F on , and the workers are uniformly distributed on {X_1,…,X_n}, and similarly for the jobs. In this case, we may further refine the bound for the runtime of our algorithm, as is remarked  below. \n    \n    \n    \n        Suppose that F,G are independent empirical measures of the uniform distribution on [0,1]. Then the runtime of the algorithm is O(n^2.5(loglog n)^3/2) almost surely. \n    \n    \n        \n    \n    \n    \n    \n    In order to prove Remark <ref>, consider the (random) empirical cumulative densities F_n,G_n, drawn from two independent sequences {X_i}_1≤ i≤ n and {Z_i}_1≤ i≤ n uniformly in [0,1], i.e.,\n    \n        F_n(t)=1/n∑_k=1^n_{X_k≤ t}     and      G_n(t)=1/n∑_k=1^n_{Z_k≤ t}.\n    \n    It is well known that the scaled measure of underqualification √(n)(F_n-G_n) can be well approximated by a Brownian bridge, where we recall that a (standard) Brownian bridge B={B(t)}_t∈[0,1] is a centered Gaussian process with covariance [B(s)B(t)]=min(s,t)-st. \n    We denote the local time of a standard Brownian bridge  B on [0,1] at x∈ by L_B(x). By definition, the local time process {L_B(x)}_x∈ is such that for any bounded Borel function f,\n    \n        ∫_0^1 f(B(t)) ṭ=∫_ f(x)L_B(x) x̣.\n    \n    The following Lemma is a special case of Theorem 5 of <cit.>.\n     There exists a suitable probability space carrying F_n,G_n, and a sequence of Brownian bridges {B_n}, such that \n        \n        lim_n→∞max_k∈ℤ|n^-1/2C_F_n-G_n(k/n)-√(2) L_B_n(k√(2)/√(n))|=O(n^-0.24)  a.s.\n    \n        \n        \n        \n    \n    We also have the following Lemma on fluctuations of the local time for Brownian bridges. This is taken from Lemma 3.2 of  <cit.> applied with n_k=k and _n=√(2/n).\n    \n        Let {B_n} be any sequence of Brownian bridges.  It holds that\n        \n        sup_|x-y|<√(2/n)|L_B_n(x)-L_B_n(y)|=O(n^-0.24)  a.s.\n    \n    With a Borel-Cantelli argument in <cit.> applied to the sequence of Brownian bridges {B_n} (with the tail estimates supplied by Theorem 5.1 therein), the following lemma can be similarly  established as Theorem 1.4 of <cit.>.\n    Let {B_n} be any sequence of Brownian bridges. There is a constant C>0 such that\n    \n        [∫_L_B_n(x)^4x̣>y]≤exp(-y^2/3/C).\n    \n        Moreover,\n        \n        ∫_L_B_n(x)^4x̣=O((loglog n)^3/2)  a.s.\n    \n    The first claim is Theorem 5.1 of <cit.> applied with p=4. The second claim can be proved in a similar way as (3.7a) of <cit.>.\n    \n    \n    \n    \n    \n     Recall that solving (<ref>) requires N^4 steps. In view of Proposition <ref>, the runtime of our algorithm has the upper bound\n    \n        ∑_|k|≤ nC_F-G(k/n)^4.\n    \n    Using Lemma <ref>, we get that almost surely,\n    \n        C_F-G(k/n)=√(2n)L_B_n(√(2)k/√(n))+O(n^0.26).\n    \n        Therefore, using the elementary inequality (A+B)^4≤ 16(A^4+B^4) we have almost surely,\n        \n        ∑_|k|≤ nC_F-G(k/n)^4   ≤ 64 ∑_|k|≤ n(n^2L_B_n(√(2)k/√(n))^4+O(n^1.04))\n           ≤ O(n^2.04)+1024n^2.5(∫_-√(n)^√(n)+1/√(n) L_B_n(x)^4x̣+∑_|k|≤ n1/√(n)O(n^-0.96))\n           ≤ O(n^2.04)+1024n^2.5∫_L_B_n(x)^4x̣,\n    where we applied Lemma <ref> in the second inequality. Applying now Lemma <ref>\n     concludes the proof.    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    ###############################dual alg example\n    \n    We illustrate the construction of the dual solution ϕ for an example where |S|=6 and the optimal assignment π pairs x_i with z_i for all i={0,1,2} as displayed in Figure <ref>. Our goal is to construct a function ϕ: S → such that ϕ(x_i)-ϕ(z_j)≤ c(x_i,z_j) for all i and j in {0,1,2} with equality holding when i=j. \n    \n    We follow the algorithm described above. First, we process the pairs (x_1,z_1) and (x_2,z_2), as they do not have any subpair. We may define ϕ_1(x_1)=c_11, ϕ_2(x_2)=c_22, and ϕ_1(z_1)=ϕ_2(z_2)=0. We now process the pair (x_0,z_0).\n    \n    \n    According to (<ref>), the second step is to find β_2 ∈ℝ such that\n    \n        max(c_00-c_01-c_20,-c_21)+c_11≤β_2≤min(c_02+c_10-c_00,c_12)-c_22.\n    By optimality of the assignment π, we observe that it necessarily needs to hold that\n    \n        max(c_22-c_21,c_00-c_01-c_20+c_22)≤min(c_12-c_11,c_10-c_11-c_00+c_02),\n    \n    as each of the comparisons yields a comparison between something optimal and something suboptimal. The existence of β_2 follows directly as this is a rewriting of the equation (c_22,c_11).[The general case being similar, while we deploy Farkas' Lemma  to establish the existence. We will prove that the system of inequalities (<ref>) always admits a solution in Lemma <ref> in Appendix <ref>. ] (Job. EXPAND).\n    \n    Next we follow step 3 of the algorithm. Define \n    \n        ϕ(x_2)   =ϕ_2(x_2)+0+ϕ_2(x_2)-ϕ_2(x_2)=c_22;\n        ϕ(z_2)   =ϕ_2(z_2)+0+ϕ_2(x_2)-ϕ_2(x_2)=0;\n        ϕ(x_1)   =ϕ_1(x_1)+β_2+ϕ_2(x_2)-ϕ_1(x_1)=c_22+β_2;\n        ϕ(z_1)   =ϕ_1(z_1)+β_2+ϕ_2(x_2)-ϕ_1(x_1)=c_22-c_11+β_2.\n    \n    \n    Further, step 4 yields the definition\n    \n        ϕ(z_0)   =max(ϕ(x_1)-c_10,ϕ(x_2)-c_20);\n        ϕ(x_0)   =max(ϕ(x_1)-c_10,ϕ(x_2)-c_20)+c_00.\n    \n    We check that the potential function ϕ as defined satisfies being a dual optimizer on S_[x_0,z_0]. First we check the inequalities ϕ(x)-ϕ(z)≤ c(x,z) for (x,z)∉Γ_π. We have \n    \n        ϕ(x_1)-ϕ(z_2)   =c_22+β_2 ≤ c_12; \n        ϕ(x_2)-ϕ(z_1)   =c_11-β_2 ≤ c_21;\n        ϕ(x_1)-ϕ(z_0)   =c_22+β_2-max(ϕ(x_1)-c_10,ϕ(x_2)-c_20)≤ (c_22+β_2)-(ϕ(x_1)-c_10)=c_10;\n        ϕ(x_2)-ϕ(z_0)   =c_22-max(ϕ(x_1)-c_10,ϕ(x_2)-c_20)≤ c_22-(ϕ(x_2)-c_20)=c_20;\n        ϕ(x_0)-ϕ(z_1)   =max(ϕ(x_1)-c_10,ϕ(x_2)-c_20)+c_00-(c_22-c_11+β_2)\n           ≤max(β_2-c_10,-c_20)+c_00-max(c_00-c_01-c_20,-c_21)\n           ≤max(c_02-c_00-c_22,-c_20)+c_00-(c_00-c_01-c_20)≤ c_01;\n        ϕ(x_0)-ϕ(z_2)   =max(ϕ(x_1)-c_10,ϕ(x_2)-c_20)+c_00\n           =max(β_2-c_10,-c_20)+c_00+c_22≤max(c_02-c_00-c_22,-c_20)+c_00+c_22≤ c_02.\n    \n    Next, it is straightforward from definition that ϕ(x_i)-ϕ(z_i)= c(x_i,z_i) for i=0,1,2. This completes the proof that the above constructed ϕ is a dual solution.\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    That the algorithm works in general will be proved later in Appendix <ref>. \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    We now sketch the idea of the proof and depict it in Figure <ref>. Consider\n    three assignment problems. The top panel is the assignment between\n    the distribution of workers F_ℓ and the distribution of jobs\n    G_ℓ, both restricted to interval ℐ. The middle\n    panel is the assignment between the entire distributions F_ℓ\n    and G_ℓ. The bottom panel is the assignment between the combined\n    distributions in the top and the middle panels. Suppose that there\n    is an arc (x,z) concealed by another arc (x',z') in the optimal\n    assignment π_1 for the top panel. If the same arc (x,z)\n    is not part of any optimal assignment π_2 in the second panel,\n    then π_2 must contain an arc (x”,z”) intersecting (x',z').\n    The layer decomposition principle implies that π_1+π_2\n    is optimal for the third panel but now π_1+π_2 contains\n    intersecting arcs (x',z') and (x”,z”) contradicting Lemma.\n    \n    \n        \n    8cm2cm[darkgray, thick] (-4,1) – (-3,1);\n    [darkgray, thick] (-4,1) – (-4,0) node[below];\n    [darkgray, thick] (-3,0) – (-3,1);\n    \n    [darkgray, thick] (-2,1) – (-1,1);\n    [darkgray, thick] (-2,1) – (-2,0) node[below];\n    [darkgray, thick] (-1,0) – (-1,1);\n    [darkgray, thick] (2,1) – (1,1);\n    [darkgray, thick] (2,1) – (2,0)node[below] ;\n    [darkgray, thick] (1,0) – (1,1);\n    \n    \n    [darkgray, thick] (4,1) – (3,1);\n    [darkgray, thick] (4,1) – (4,0) node[below];\n    [darkgray, thick] (3,0) – (3,1);\n    \n    [darkgray, thick,dashed] (-5,0) – (5,0);\n    [<-,every node/.style=font=] (2,1) edge[bend right=30] node [left]  (-2,1);\n    [<-,every node/.style=font=] (-1,1) edge[bend left=30] node [left]  (1,1);\n    \n    \n    \n    16cm2cm[darkgray, thick] (-9,1) – (-8,1) ;\n    [darkgray, thick] (-9,1) – (-9,0)node[below];\n    [darkgray, thick] (-8,1) – (-8,0)node[below] (-7.5,0.5)node[right]…;\n    \n    [darkgray, thick] (-6,1) – (-5,1);\n    [darkgray, thick] (-6,1) – (-6,0);\n    [darkgray, thick] (-5,1) – (-5,0) node[below];\n    \n    [darkgray, thick] (-4,1) – (-3,1);\n    [darkgray, thick] (-4,1) – (-4,0) node[below];\n    [darkgray, thick] (-3,0) – (-3,1);\n    \n    [darkgray, thick] (-2,1) – (-1,1);\n    [darkgray, thick] (-2,1) – (-2,0) node[below];\n    [darkgray, thick] (-1,0) – (-1,1);\n    [darkgray, thick] (2,1) – (1,1);\n    [darkgray, thick] (2,1) – (2,0)node[below] ;\n    [darkgray, thick] (1,0) – (1,1);\n    \n    [darkgray, thick] (9,1) – (8,1);\n    [darkgray, thick] (9,1) – (9,0) node[below];\n    [darkgray, thick] (8,1) – (8,0) node[below];\n    \n    [darkgray, thick] (6,1) – (5,1);\n    [darkgray, thick] (6,1) – (6,0);\n    [darkgray, thick] (5,1) – (5,0) node[below](6.5,0.5)node[right]…;\n    \n    [darkgray, thick] (4,1) – (3,1);\n    [darkgray, thick] (4,1) – (4,0) node[below];\n    [darkgray, thick] (3,0) – (3,1);\n    \n    [darkgray, thick,dashed] (-10,0) – (10,0);\n    [<-,every node/.style=font=] (2,1) edge[bend right=30] node [left]  (-2,1);\n    [<-,every node/.style=font=] (-1,1) edge[bend left=30] node [left]  (1,1);\n    \n    \n    16cm3cm[darkgray, thick] (-9,1) – (-8,1) ;\n    [darkgray, thick] (-9,1) – (-9,0)node[below];\n    [darkgray, thick] (-8,1) – (-8,0)node[below] (-7.5,0.5)node[right]…;\n    \n    [darkgray, thick] (-6,1) – (-5,1);\n    [darkgray, thick] (-6,1) – (-6,0);\n    [darkgray, thick] (-5,1) – (-5,0) node[below];\n    \n    [darkgray, thick] (-4,2) – (-3,2);\n    [darkgray, thick] (-4,2) – (-4,0) node[below];\n    [darkgray, thick] (-3,0) – (-3,2);\n    \n    [darkgray, thick] (-2,2) – (-1,2);\n    [darkgray, thick] (-2,2) – (-2,0) node[below];\n    [darkgray, thick] (-1,0) – (-1,2);\n    [darkgray, thick] (2,2) – (1,2);\n    [darkgray, thick] (2,2) – (2,0)node[below] ;\n    [darkgray, thick] (1,0) – (1,2);\n    \n    [darkgray, thick] (9,1) – (8,1);\n    [darkgray, thick] (9,1) – (9,0) node[below];\n    [darkgray, thick] (8,1) – (8,0) node[below];\n    \n    [darkgray, thick] (6,1) – (5,1);\n    [darkgray, thick] (6,1) – (6,0);\n    [darkgray, thick] (5,1) – (5,0) node[below](6.5,0.5)node[right]…;\n    \n    [darkgray, thick] (4,2) – (3,2);\n    [darkgray, thick] (4,2) – (4,0) node[below];\n    [darkgray, thick] (3,0) – (3,2);\n    \n    [darkgray, thick,dashed] (-10,0) – (10,0);\n    [<-,every node/.style=font=] (2,2) edge[bend right=30] node [left]  (-2,2);\n    [<-,every node/.style=font=] (-1,2) edge[bend left=30] node [left]  (1,2);\n            \n    Qué mira bobo"}