{"entry_id": "http://arxiv.org/abs/2303.06688v1", "published": "20230312152227", "title": "Boundary Recovery of Anisotropic Electromagnetic Parameters for the Time Harmonic Maxwell's Equations", "authors": ["Sean Holman", "Vasiliki Torega"], "primary_category": "math.AP", "categories": ["math.AP", "math.DG", "35R30, 35S15, 35Q61, 53B50"], "text": "\n\nBoundary Recovery of Anisotropic Electromagnetic Parameters]Boundary Recovery of Anisotropic Electromagnetic Parameters for the Time Harmonic Maxwell's Equations\n\n\n\n\n\n\n\n\n\n\n\n\n\n1]Sean Holmansean.holman@manchester.ac.uk\n\n2]Vasiliki Toregavasiliki.torega@manchester.ac.uk\n\n\n\n[1]Department of Mathematics, University of Manchester, Oxford Road, Manchester, M13 9PL, Greater Manchester, UK\n\n[2]Department of Mathematics, University of Manchester, Oxford Road, Manchester, M13 9PL, Greater Manchester, UK\n\n\n\n\n\nThis work concerns inverse boundary value problems for the time-harmonic Maxwell's equations on differential 1-forms. We formulate the boundary value problem on a 3-dimensional compact and simply connected Riemannian manifold M with boundary ∂ M endowed with a Riemannian metric g. Assuming that the electric permittivity ε and magnetic permeability μ are real-valued anisotropic (i.e (1,1)- tensors), we aim to determine certain metrics induced by these parameters, denoted by ε̂ and μ̂ at ∂ M. We show that the knowledge of the impedance and admittance maps determines the tangential entries of ε̂ and μ̂ at ∂ M in their boundary normal coordinates, although the background volume form cannot be determined in such coordinates due to a non-uniqueness occuring from diffeomorphisms that fix the boundary. Then, we prove that in some cases, we can also recover the normal components of μ̂ up to a conformal multiple at ∂ M in boundary normal coordinates for ε̂. Last, we build an inductive proof to show that if ε̂ and μ̂ are determined at ∂ M in boundary normal coordinates for ε̂, then the same follows for their normal derivatives of all orders at ∂ M.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[\n    [\n    March 30, 2023\n==================\n\n\n\n\n\n§ INTRODUCTION\n\nIn this work, we consider a 3-dimensional compact and simply connected Riemannian manifold M,  with smooth boundary ∂ M, equipped with a Riemannian metric g. In the case of M ⊂ ℝ^3, g could be the Euclidean metric. The coordinate invariant formulation of time harmonic Maxwell's equations, in the absence of currents or sources, in M is provided by\n\n    ∗_gdH= -i ωε E,   δ_g (ε E)= 0,\n    ∗_gdE= i ωμ H,   δ_g (μ H)= 0,\n\nwhere ∗_g is the Hodge star operator with respect to the metric g and d stands for the exterior derivative. The operator δ_g denotes the divergence operator with respect to the  metric g.  The electric and magnetic fields E and H, respectively, are differential 1-forms. The electric permittivity ε and magnetic permeability μ are assumed to be real-valued (1,1)-tensor fields which are symmetric and positive definite with respect to the metric g. The angular frequency is represented by ω and is a real number.\n\nWe consider either of the Dirichlet boundary conditions\n\n    ι^∗H=F     ι^∗E=G,\n\nwhere ι^∗ stands for the pullback at ∂ M. Given that the Dirichlet problem composed of (<ref>) and either boundary condition in (<ref>) is well-posed, the boundary mappings Λ_ε and Λ_μ, called the impedance and admittance maps respectively are well defined and are provided by\n\n    Λ_ε(ι^∗H)=ι^∗E     Λ_μ(ι^∗E)=ι^∗H.\n\nNote that Λ_μ is the inverse of Λ_ε.\nAssuming the knowledge of Λ_ε and Λ_μ we aim to recover the metrics induced by ε and μ on the cotangent bundle of M, denoted by ε^♯ and μ^♯, as well as their normal derivatives at ∂ M. \n\n\n\n §.§ Literature Review\n\n\nThe inverse problem of recovering a Riemannian metric using boundary data has been widely studied for the wave equation. The boundary measurements in this case are realised by the Dirichlet to Neumann (DtN) map. A natural obstruction to the uniqueness of the reconstruction, also mentioned as “cloaking\", is encountered in this type of inverse problems and is caused by diffeomorphisms that fix the boundary <cit.>, <cit.>.\nThe article <cit.> studies the inverse problem of reconstructing a Riemannian manifold through the DtN map for the wave equation.  The Dirichlet boundary conditions represent the sources and they are located in an open subset of the boundary S. The Neumann boundary conditions which represent the waves produced by the sources in S, are being observed in R, which is an open subset of the boundary, with S∩R=∅. The method employed to solve this inverse problem uses arguments of the boundary control method. Applications of the boundary control method are given in <cit.> which concerns inverse problems in acoustics, elasticity, electrodynamics, electrical impedance tomography and graph theory.\n\nWell-posedness results for the time harmonic Maxwell's equations are given in <cit.> in the case of isotropic electromagnetic parameters and in <cit.> in the case of anisotropic electromagnetic parameters that are conformal multiples. Both the isotropic and anisotropic cases are considered in <cit.> where a coercive billinear form for the decoupled system is constructed. The time domain is also taken into account in <cit.> and the well-posedness is proved for non-analytic anisotropic parameters that are conformal multiples of each other. In this paper, we prove well-posedness for the equations considered by augmenting Maxwell's system to an elliptic one. Further details are provided later in sections <ref> and <ref>.\n\nThe linearized inverse boundary value problem of Maxwell's equations is studied in <cit.>. The electric permittivity, conductivity and magnetic permeability are assumed to be functions that differ slightly from given constants and they are recovered through the admittance map.\n The case of isotropic (scalar) electromagnetic parameters is also considered in <cit.>. In this case the Maxwell's system can be decoupled to derive a second order differential equation in terms of the Laplace-Beltrami operator either with respect to the magnetic field or the electric field. Using the calculus of Pseudodifferential Operators <cit.>, <cit.> the symbols of the admittance and impedance maps are determined in terms of a pseudodifferential operator of order 1 that factorises the Laplace-Beltrami operator. It is shown that this implies the boundary recovery of the electric permittivity ε and magnetic permeability μ and their first normal derivatives. This result is extended in <cit.> where the demonstration of an inductive proof establishes the boundary determination of the normal derivatives of all orders of the electromagnetic parameters. This method uses a special class of Pseudodifferential Operators that depends smoothly on the distance from the boundary. Similar reasoning is followed in <cit.> for the inverse problem of the Laplacian on k-forms where the boundary data are represented by the DtN operator.\n \n A different approach on the inverse problem of time harmonic Maxwell's equations for scalar electromagnetic parameters is demonstrated in <cit.>. The principal symbols of the impedance and admittance maps are derived using a boundary operator called the Calderon projector for an augmented system equivalent to the Maxwell's system. \n The isotropic inverse problem for the time harmonic Maxwell's equations is also studied in <cit.> where the medium is a subset of ℝ^3 and is assumed to be chiral. In this method the magnetic permeability is known and the recovery of the electric permittivity, conductivity and chirality constant throughout the medium of interest is proven. The augmented system used in <cit.> to construct solutions for this system and use complex geometrical optics, is also used in the present work to establish well-posedness.  The inverse problem for the metrics induced by ε and μ being (0,2)-tensors and conformal multiples of each other is studied in <cit.>. To the best of our knowledge, <cit.> is the only anisotropic case regarding the recovery of ε and μ studied in the existing literature.\n \n The article <cit.> concerns the anisotropic conductivity problem. The method employed is the same factorisation method used for the isotropic case of the time harmonic Maxwell's equations in <cit.>. In the case of the dimension n satisfying n≥ 3 the conductivity problem can be reduced to the problem of recovering a Riemannian metric g using the DtN map for harmonic functions. \nThe same factorisation method is also applied to the elasticity problem for transversely isotropic materials in  <cit.>. The elasticity operator, which is a second order elliptic operator, is factorised in terms of a pseudodifferential operator of order 1 making use of the theory of monic matrix polynomials <cit.>. The aforementioned operator is used to express the DtN map which yields to the recovery of the elastic parameters at the boundary. This is the approach that we follow in this paper in order to calculate the principal symbols of the boundary mappings.\n\n\n\n §.§ Summary of Current Work\n\n \nNow let us describe the contents of the present work. We start in section <ref> by introducing the background material and notation including new metrics ε̂ and μ̂ which are conformally related to ε^♯ and μ^♯ but also eliminate the dependence of Maxwell's equations on g. Then follows section <ref>, where we state our main results. In order to show that the impedance and admittance maps are well defined we start in section <ref> by illustrating the proof of well-posedness of the forward problem. To do so, we augment the Maxwell's system to an 8 × 8 elliptic system also used in <cit.> and <cit.>. The basic step, following <cit.>, is to prove a coercivity estimate for the elliptic operator of the system.\n\nIn section <ref>, we start by defining the impedance and admittance maps. \nFirst, we study two types of non-uniqueness that arise from diffeomorphisms that fix the boundary. We show that if (ε̂,μ̂),  (ε̂',μ̂') are two different sets of metrics connected by such a diffeomorphism Φ then the boundary data of the corresponding Dirichlet problems are the same.\nNext, we examine the consequences of a diffeomorphism Φ that fixes the boundary to the recovery of the determinant of the metric g, denoted by | g|, in boundary normal coordinates for ε^♯ and μ^♯. We prove that the Jacobian determinant | DΦ| of this diffeomorphism can be arbitrary in boundary coordinates and as a result, the determinant | g | cannot be uniquely determined in either boundary normal coordinates for ε^♯ or μ^♯. This affects the boundary recovery of ε^♯ and μ^♯ as we show in section <ref>.\n\n In section <ref> we decouple the system and follow <cit.> together with the theory of monic matrix polynomials <cit.> to derive the principal symbols of the factorisation operators denoted by B(x,D_x̃) and C(x,D_x̃) representing the normal derivatives in coordinates. Next, we express the principal symbols of the impedance and admittance maps through the principal symbols of B and C. Proceeding to section <ref>, we show that the principal symbols of Λ_ε and Λ_μ determine the tangential entries of the metrics ε̂ and μ̂. Next, investigating the consequences of the boundary recovery on the electric and magnetic fields, we prove that in some cases we can recover the normal components of μ̂ in boundary normal coordinates for ε̂. Under the same choice of coordinates, we show that when boundary recovery of the metrics ε̂, μ̂ is possible, the boundary recovery of their normal derivatives of all orders is implied. This is done by adjusting to our case the inductive proof employed in <cit.> and <cit.> that uses Riccati equations satisfied by B(x, D_x̃), C(x,D_x̃) together with a class of pseudodifferential operators that allows us to work exclusively with principal symbols at the boundary.\n \n \n\n§ BACKGROUND MATERIAL\n\n \n Let us introduce some prerequisites from tensor calculus that will be needed in the following sections. Further details on the topic are given in <cit.>.\n We will denote by τ_n^m(M) the spaces of smooth (n,m)- complex valued tensor fields on M. The Riemmanian g induces a point-wise billinear form ⟨·, ·⟩_g on these spaces. Also, we introduce the space Ω^k(M) that consists of the smooth complex-valued differential k-forms. \n For a,b ∈ Ω^k(M) we will write the point-wise inner product of a with b as ⟨ a, b̅⟩_g.  \n For a,b ∈ Ω^1(M) we express ⟨ a, b̅⟩_g in a local coordinate chart as\n \n    ⟨ a, b̅⟩_g= g^aba_ab̅_b,\n\n which induces the norm ⟨ a, a̅⟩_g^1/2.\n Note carefully that, in our notation, for complex valued fields the bilinear form ⟨ a,b ⟩_g is not an inner-product because we do not include the conjugation. Indeed, in local coordinates it is written as\n \n    ⟨ a, b ⟩_g= g^aba_ab_b.\n\n Furthermore, we will write | a | _g^2 = ⟨ a, a ⟩_g, which for complex a does not give a norm.\n \n \n The purpose of excluding the conjugation from ⟨ a, b ⟩_g and | a | _g^2 is that in what follows we will make use of the fact that | a | _g^2 can vanish for complex a. When we reach this point, the reader is reminded with a remark (see Remark <ref>).\n \n \n The inner product on L^2(Ω^k(M)) is given by\n \n    ⟨⟨ a,b̅⟩⟩ _g= ∫_M a ∧∗_gb̅,\n\n where a,b ∈ Ω^k(M). In what follows, we will also use inner products defined as above but with g replaced by metrics induced from the electromagnetic parameters ε and μ.\n Using the Levi-Civita connection on (M,g), denoted by ∇, we define the spaces H^1(Ω^k(M)) as \n \n    H^1(Ω^k(M))= {a ∈ L^2(Ω^k(M));   ∇ a ∈ L^2(τ_k+1^0(M))},\n\n equipped with the norm\n \n    a  _H^1(Ω^k(M))^2=  a  _L^2(Ω^k(M))^2+ ∇ a _L^2(τ_k+1^0(M))^2.\n\n Let ι: ∂ M ↦ M be the inclusion map at the boundary and define the pullback ι^∗: Ω^k(M) ↦Ω^k(∂ M) on smooth differential forms. The pullback can be extended by continuity to ι^∗: H^1(Ω^k(M))↦ H^1/2(Ω^k(∂ M)).\n The definition of H^1/2 and in general fractional Sobolev spaces is given in section 4.1 of <cit.>, in terms of the Fourier transform.\n Moreover, we define the Sobolev space H_0^1(Ω^k(M)) as\n \n    H_0^1(Ω^k( M))= { a ∈ H^1(Ω^k(M));   ι^∗a=0}.\n\n  The (1,1)-tensors ε and μ are assumed to be smooth and real valued. We interpret them as point-wise maps on the cotangent bundle T^∗(M) and assume that they are symmetric and positive definite with respect to g. For a,b ∈ T_x^∗(M) these properties are described by, respectively,\n \n    ⟨ a, εb̅⟩_g = ⟨ε a, b̅⟩_g,  ⟨ a, μb̅⟩_g = ⟨μ a, b̅⟩_g,\n \n \n    ⟨ a, εa̅⟩_g >0,   ⟨ a, μa̅⟩_g >0\n\n Due to the above, ε, μ and their inverses ε^-1, μ^-1 induce metrics on the cotangent and tangent bundles T^∗(M) and T(M), respectively. The metrics on T^∗(M) induced by ε and μ are (2,0)-tensors and using the ♯ (raising indices) operator are provided in a local coordinate by\n \n    ε^♯=ε^ij=g^ikε_k^j,   μ^♯=μ^ij=g^ikμ_k^j.\n\nWe will write the inverses of ε^♯ and μ^♯ using the ♭ (lowering indices) operator as\n \n    (ε^-1)_♭=(ε^-1)_ij=g_ik(ε^-1)_j^k,    (μ^-1)_♭=(μ^-1)_ij=g_ik(μ^-1)_j^k.\n\nNote that we will often use the term metric both for Riemannian metrics, which are (0,2)-tensors and induce a bilinear form on T(M), as well as for (2,0)-tensors and the corresponding bilinear forms on T^∗(M).\n\n \n\n §.§ Notation and identities\n\n Let us introduce the notation used in this paper. We are working in a set of coordinates adapted to the boundary ∂ M characterised by x_3=0 within the domain of the coordinate chart. These will be boundary normal coordinates either for ε^♯, μ^♯ or the related metrics ε̂, μ̂ introduced in (<ref>). Since we are working on a 3-d manifold, the indices of tensor fields i are assumed to take values from 1 to 3. In the case of an index restricted to i=1,2, we will add a tilde as in ĩ .\n When working with coordinate invariant expressions we will use the notation ξ̃ for the covector\n \n    ξ_ĩ dx^ĩ = ∑_ĩ=1^2  ξ_ĩ dx^ĩ.\n\n If ν=  dx^3 is a covector normal to the boundary, we will denote by ξ a covector that is written in components as\n \n    ξ=ξ̃+νξ_3.\n\n The determinants of the Riemannian metrics g, (ε^-1)_♭ and (μ^-1)_♭ in coordinates will be written as\n \n    | g | :=(g),   |ε^-1|:=((ε^-1)_♭),   |μ^-1|:=((μ^-1)_♭).\n\n The corresponding notation for the determinants of the metrics on T^∗(M) is\n \n    | g^-1|:=(g^-1),   |ε|:=(ε^♯),   |μ|:=(μ^♯).\n\nDenoting by σ^ijk the alternating tensor will use the following identities for the metric g^-1\n \n    | g^-1|σ^pqr=σ_ijkg^pig^qjg^rk,\n\n and for the matrix of cofactors of the Riemannian metric g \n \n    σ^aqjσ^dkbg_bj= | g | (g^adg^qk-g^akg^qd).\n\n We define new Riemannian metrics ε̂^-1 and μ̂^-1 by\n  \n    ε̂^-1/√(|ε̂^-1|)= (ε^-1)_♭/√(| g |),   μ̂^-1/√(|μ̂^-1|)= (μ^-1)_♭/√(| g |),\n\n which allow us to write the time harmonic Maxwell's equations as given in (<ref>)\n in the equivalent form\n \n    ∗_ε̂dH   = -i ω E,   δ_ε̂  E= 0,\n    ∗_μ̂dE   = i ω  H,   δ_μ̂ H= 0,\n\n that is independent of g.  When working with the metrics (<ref>), we will denote the associated impedance and admittance maps by Λ_ε̂, Λ_μ̂, respectively. The approach we follow is to work with two different pairs of metrics (ε̂,μ̂), (ε̂',μ̂') and boundary mappings Λ_ε̂, Λ_μ̂ and Λ_ε̂', Λ_μ̂' to investigate the implications of the assumption Λ_ε̂=Λ_ε̂', Λ_μ̂=Λ_μ̂'. \n We will use the phrases “boundary normal coordinates for ε̂/ε̂'\" and “boundary normal coordinates for μ̂/μ̂'\" to express that we work separately in boundary normal coordinates for either the metrics ε̂ and ε̂' or μ̂ and μ̂'. Assume that the representations of ε̂ and ε̂' in boundary normal coordinates for ε̂/ε̂' at x_3=0 are given by, respectively\n \n    (ε̃   0\n    \n     0^T    1\n     ),   (ε̃'   0\n    \n     0^T    1\n     ).\n\n Assume further that μ̂ and μ̂' in boundary normal coordinates for μ̂/μ̂' at x_3=0 are written as\n \n    (μ̃   0\n    \n     0^T    1\n     ),   (μ̃'   0\n    \n     0^T    1\n     ).\n\nNote that ε̃, ε̃', μ̃ and μ̃' define coordinate invariant metrics on ∂ M. These are the tangential parts of  ε̂, ε̂', μ̂ and μ̂' respectively.\n\nAs mentioned in Section <ref>, we are going to use the calculus of Pseudodifferential Operators (Ψ DOs) to determine the principal symbols of the boundary mappings Λ_ε̂ and Λ_μ̂. Using the Fourier transform and its inverse, P is a pseudodifferential operator of order m (P ∈Ψ DO^(m)) in local coordinates if\n\n    P(x,D_x)u(x)= 1/(2π)^3∫_ℝ^3 e^i x ·ξ p(x,ξ)û(ξ)  dξ,\n\nwhere D_x= - i ∂_x, û(ξ) denotes the Fourier transform of u(x) and p(x,ξ) is called the symbol of P(x,D_x) and is of order m with respect to the dual variable ξ. For details on the definition and calculus of Ψ DOs, which will be used, see <cit.>.\n \n\n\n\n\n§ RESULTS\n\nIn this section we present the main results included in this paper. The content of the remainder of the paper contains the proofs for each result.\n\n\n\tFor ω ∈ ℝ, outside a discrete set, the solution of the Dirichlet problem \n\t\n    ∗_ε̂d H   = -i ω E,   δ_ε̂E=0,\n    ∗_μ̂d E   = i ω H,   δ_μ̂H=0,\n\n\t\n    ι^∗H=F,\n\n\texists, is unique and depends continuously on the data F. More particularly, there exists Ĉ>0 that depends on ε̂, μ̂ and ω, such that\n\t\n    E_H^1(Ω^1(M))^2+ H_H^1(Ω^1(M))^2≤ĈF_H^1/2(Ω^1(∂ M))^2.\n\n\n\n \nSee Section <ref>.\n\n\n\nIf (ε̂,μ̂) and (ε̂',μ̂') are related by a diffeomorphism fixing the boundary of M then Λ_ε̂=Λ_ε̂'. Additionally, let g_ε, g_ε', g_μ and g_μ' be the local coordinate representations of the metric g in boundary normal coordinates for ε^♯/ε'^♯, μ^♯/μ'^♯. There exist pairs of metrics (ε^♯,μ^♯), (ε'^♯,μ'^♯) not equal to each other such that Λ_ϵ =Λ_ϵ' and the ratios of the determinants in the different sets of boundary normal coordinates | g_ε|/| g_ε'|, | g_μ|/| g_μ'| are arbitrarily chosen positive functions in a neighbourhood of the boundary.\n\n\n \nSee Section <ref>.\n\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of metrics and Λ_ε̂, Λ_ε̂' the associated impedance maps. Assuming that Λ_ε̂=Λ_ε̂', then \n\t\n    ε̃=ε̃',    x_3=0,\n\n\t\n    μ̃=μ̃',    x_3=0.\n\n\n\n \nSee Section <ref>.\n\n\n\n\tLet (ε̂,μ̂) (ε̂',μ̂') be two different sets of metrics and Λ_ε̂, Λ_ε̂' the associated boundary mappings. Let us fix boundary normal coordinates for ε̂/ε̂'.\n\tIf Λ_ε̂=Λ_ε̂', then at each point in ∂ M least one of the following cases holds:\n\t\n\t\t\n  * The metrics μ̃ and ε̃ are multiples and μ̂'^3j̃=c μ̂^3j̃ for some c ∈ℝ.\n\t\t\n  * ε̂=ε̂' and μ̂=μ̂'.\n\t\n\n\n \nSee Section <ref>.\n\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of metrics and Λ_ε̂, Λ_ε̂' the corresponding boundary mappings. Let us fix boundary normal coordinates for ε̂/ε̂'. If\n\t\n    Λ_ε̂=Λ_ε̂',\n\n\t\n    ε̂=ε̂',   μ̂=μ̂'    x_3=0,\n\n\tthen,\n\t\n    ∂_x_3^κε̂=\t∂_x_3^κε̂',   ∂_x_3^κμ̂=\t∂_x_3^κμ̂'    x_3=0,\n\n\tfor any κ≥ 1.\n\n\n \nSee Section <ref>.\n\n\n\n\n\n§ SKETCH OF THE PROOF OF THEOREM <REF>\n\nOur proof of Theorem <ref> relies on augmenting Maxwell's equations to a larger elliptic system and proving a coercivity estimate for this system. Since the methods are fairly standard and well-known, we only give a sketch of this proof.\n\nTo begin, we augment the system (<ref>) to\n\n    PU=\t-i  (\n    \n    i ω    0    δ_μ̂    0 \n    \n    0     i ω   ∗_ε̂d   d\n    d   -∗_μ̂d    i ω    0\n    \n    0    δ_ε̂    0     i ω )\n     (\n    \n    u_E\n     E \n     H \n     u_H )\n    = \n     (\n    \n    0 \n     0 \n     0 \n     0\n     ),\n\nwhere u_E and u_H are auxiliary 0-forms. Note that if u_E=u_H=0, then E and H satisfying (<ref>) also satisfy (<ref>). The purpose of this step is that P is an elliptic operator, i.e its principal symbol is invertible for ξ ∈ ℝ^3\\{0}, in contrast to the operator corresponding to the system (<ref>). The field U is defined in Ω(M), where \n\n    Ω(M)= Ω^0(M) ⊕Ω^1(M) ⊕Ω^1(M) ⊕Ω^0(M)\n\nand the boundary condition is written in terms of U as\n\n    BU= ( ι^∗   0   0   0\n    \n    0   0   0   0\n    \n    0   0   ι^∗   0\n    \n    0   0   0   ι^∗) (\n    \n    u_E\n     E \n     H \n     u_H )= (0\n    0\n    F\n    0  ).\n\nThe spaces L^2(Ω(M)) and H^1(Ω(M)) are defined using the inner products\nand norms given from the product structure\n\n    (U,V)   =\t\t∫_M( \n    u_E\n    \n    E\n    \n    H\n    \n    u_H)∧( ∗_μ̂   0   0   0\n    \n    0   ∗_ε̂   0   0\n    \n    0   0   ∗_μ̂   0\n    \n    0   0   0   ∗_ε̂)( u_E\n    E\n    H\n    u_H),\n\n\n    ( \n    u_E\n    \n    E\n    \n    H\n    \n    u_H)^2= u_E^2 + E^2+H^2+ u_H^2,\n\nwhere the norms are either L^2 or H^1.\nTransforming the boundary value problem consisting of (<ref>) and (<ref>) to the equivalent one with non-homogeneous differential equation and homogeneous Dirichlet condition we define the domain of P to be\n\n    D(P)= {U ∈ H^1(Ω(M));    BU=0}.\n\nThe main step in the proof is to prove the following coercivity estimate which holds for any U ∈ D(P) \n\n    U_H^1(Ω(M))^2≤ C PU_L^2(Ω(M))^2 + C U_L^2(Ω(M))^2,\n\nfor some C>0, depending on ε̂, μ̂ and ω.  In <cit.> is shown that the ellipticity of P implies that (<ref>) holds in the interior of M. Thus, it remains to show that the estimate (<ref>) holds in a coordinate chart adapted to the boundary. Using the method in <cit.>, it suffices to show that P satisfies the hypothesis of regularity upon freezing the coefficients.   The only difference is that we consider the eigenvalues and eigenvectors of K_1(ξ̃)+K_0 instead of K_1(ξ̃) as denoted in the proof of <cit.> to accomodate the fact that the eigenvectors of K_1(ξ̃) in our case do not satisfy <cit.>.\nNext, using the symmetry of P with respect to the  the L^2-product defined in (<ref>) and using the coercivity estimate we show that P is densely defined self-adjoint with compact resolvent. Hence, the set of eigenvalues of P is discrete. Finally, to obtain the result for the original time harmonic Maxwell's equations we must show that, for values of ω outside the spectrum, if u_E|_∂ M= u_H|_∂ M = 0 then u_E = u_H = 0. This is done by showing that u_E and u_H satisfy eigenvalue problems which can be decoupled from the augmented system.\n\n\n§ BOUNDARY MAPPINGS AND NON-UNIQUENESS RESULT\n\nThe fact that the boundary value problem with Dirichet condition on H is well-posed outside a discrete set of ω implies the corresponding result for the boundary value problem with Dirichlet condition\n\n    ι^∗E=G.\n \nTherefore, we can define the impedance map Λ_ε̂: Ω^1(∂ M) ↦Ω^1(∂ M) realised by\n\n    Λ_ε̂(ι^∗H)=ι^∗E\n\nand its inverse Λ_μ̂:Ω^1(∂ M) ↦Ω^1(∂ M) given by\n\n    Λ_μ̂(ι^∗E)=ι^∗H\n\nwhich is called the admittance map.\n\nNext we study the non-uniqueness implied by diffeomorphisms Φ that fix the boundary and thus prove Theorem <ref>.\n\n\n\n §.§ Proof of Theorem <ref>\n\n\nLet us consider the sets of metrics (ε̂,μ̂) and (ε̂',μ̂') connected by a diffeomorphism Φ: M↦ M with Φ|_∂ M= 𝕀 as\n\n    ε̂= Φ^∗ε̂',   μ̂=Φ^∗μ̂'.\n\nBecause of the coordinate invariant form of (<ref>), the action of Φ on the magnetic field H is\n\n    H= (DΦ)^TH'\n\nand since Φ|_∂ M= 𝕀 we get ι^∗H=ι^∗H'. The same is also true for the electrial field: ι^∗E=ι^∗E'.\nTherefore the impedance maps corresponding to the ε̂, ε̂' metrics satisfy\n\n    Λ_ε̂(ι^∗H)=Λ_ε̂'(ι^∗H).\n\nHence, the metrics (ε̂,μ̂) and (ε̂',μ̂') lead to the same boundary data, which implies the same for the metrics (ε^♯,μ^♯,g) and (ε'^♯,μ'^♯,g) defined through (<ref>).\n\nTo complete the proof of Theorem <ref> we need the following Lemma.\n\n\nSuppose that {x^j}_j=1^3 are a set of local boundary coordinates on a domain U ⊂ M and take any positive function h ∈ C^∞(M) such that supp(h-1) ⊂ U. Then there exists a diffeomorphism Φ:M ↦ M such that\n\t\n    Φ|_∂ M=𝕀\n\nand in the local coordinates the Jacobian determinant satisfies | DΦ| = h for all x^3 sufficiently small.\n\n\n\n\n\n\n\nWe will assume without loss of generality that\n\n    supp(h-1) ⊂{(x^1,x^2,x^3) ∈ [-ϵ,ϵ]×[-ϵ,ϵ]× [0,ϵ]}⊂ U.\n\nfor some ϵ >0. Let ϕ∈ C^∞_c(ℝ) be an even function satisfying 0≤ϕ≤ 1, supp(ϕ) ⊂ (-1,1), ϕ(s) = 1 for s in a neighourhood of zero and ∫_-∞^∞ϕ(s)  d s =1. Also set\n\n    a = 4 sup{ h+1} + 3,    b = 2ϵ/a (  sup{ h+1} + 1 ),    c = 2 ϵ/asup{ h+1},\n\n\n    d(x^1,x^2) = 1/c∫_0^∞ (h(x^1,x^2,s)-1) ϕ ( as/ϵ )  d s.\n\nThen we define Φ within U by\n\t\n    Φ(x^1,x^2,x^3)= (x^1,x^2, f(x^1,x^2,x^3)),\n\n\twith\n\n    f(x^1,x^2,x^3)=∫_0^x^3 (h(x^1,x^2,s)-1)ϕ (as/ϵ ) - d(x^1,x^2) ϕ ( s-b/c ) +1 ds.\n\nWith this construction, we see first that f(x^1,x^2,x^3) satisfies f(x^1,x^2,0)=0 which implies that\nΦ|_∂ M= 𝕀. Also, noting that the support of the first and second terms in the integrand on the right side of (<ref>) is contained in {s ∈ [0,ϵ]} we can conclude\n\n    ∂ f/∂ x^3(x^1,x^2,x^3) =  (h(x^1,x^2,x^3)-1)ϕ (ax^3/ϵ ) - d(x^1,x^2) ϕ ( x^3-b/c ) +1 > 0\n\neverywhere and f(x^1,x^2,x^3) = x^3 for (x^1,x^2,x^3) ∉ [-ϵ,ϵ]×[-ϵ,ϵ]× [0,ϵ]. Thus, Φ can be extended as the identity outside U to give a diffeomorphism on M with Jacobian matrix given within U by\n\t\n    DΦ= (\n    \t1   0    0\n    \n    \t0   1   0\n    ∂ f/∂ x^1   ∂ f/∂ x^2   ∂ f/∂ x^3).\n\nFrom (<ref>), we see that ∂ f/∂ x^3 = h when x^3 is sufficiently small, and so the Jacobian determinant is | DΦ| = h for all such x^3. This completes the proof.\n\n\nNow let us proceed to the proof of the second part of Theorem <ref> using the diffeomorphism Φ constructed in Lemma <ref> in (<ref>). Given a set of coordinates on the boundary, let Ψ, Ψ' be the corresponding coordinate transformations from M to boundary normal coordinates for ε̂ and ε̂', respectively. Let us denote by ĝ and ĝ' the local representations of the metric g in boundary normal coordinates for ε̂/ε̂'. Then, referring to Figure <ref> and using the fact that Ψ=Ψ' ∘Φ, we deduce that \n\n    |ĝ|=| DΦ|^-2|ĝ'|.\n\n\tUsing the result of Lemma <ref>, that | DΦ| can be an arbitrary positive function in a neighbourhood of the boundary, we conclude that the expression for the volume form of g in boundary normal coordinates for ε̂ cannot be determined from Λ_ε̂. \n\t\nTo complete the proof of Theorem <ref>, let us proceed to the following changes of coordinates\n\t\n    Ψ̃⟶   ,\n      Ψ̃'⟶  .\n\n\tUsing the relationship between the ε̂^-1 and (ε^-1)_♭ metrics given in (<ref>) as well the fact that ε̂ and ε̂' have the same expression in their boundary normal coordinates, the Jacobian matrices of Ψ̃^-1 and (Ψ̃')^-1 are given by, respectively,\n\t\n    DΨ̃^-1=(\n    \t1   0   0\n    \n    \t0   1   0\n    Ψ̃_31   Ψ̃_32   ( |ĝ|/|ε̂^-1|)^-1/4),    \n    \tD(Ψ̃')^-1=(\n    \t1   0   0\n    \n    \t0   1   0\n    Ψ̃'_31   Ψ̃'_32   ( |ĝ'|/|ε̂^-1|)^-1/4)\n\n\twhere the off diagonal entries are undetermined functions which will be zero at the boundary. Denoting by g_ε and g_ε' the metrics g and g' in boundary normal coordinates for (ε^-1)_♭/(ε'^-1)_♭ we have\n\t\n    | g_ε|= | DΨ̃|^-2|ĝ|= √(|ĝ|)√(|ε̂^-1|)    | g_ε'|= | DΨ̃'| ^-2|ĝ'|= √(|ĝ'|)√(|ε̂^-1|).\n\n\tMaking use of (<ref>), we deduce\n\t\n    | g_ε|=| DΦ|^-1| g_ε'|.\n\n\tAs we showed in Lemma <ref>, the determinant | DΦ| can be any positive function which implies that | g_ε|/| g_ε'| can be chosen arbitrarily in a neighbourhood of any point on the boundary and is otherwise equal to one in a neighbourhood of the boundary. By repeating this proof in a neighbourhood of any point on the boundary and combining the results as a composition we can complete the proof for ϵ^♯. Demonstrating an approach symmetric to the above we can prove the corresponding result for the determinant | g | in boundary normal coordinates for μ^♯. This concludes the proof of Theorem <ref>.\n\t\n\t\n\n\n\n\n\n\t\n\n§ SYSTEM DECOUPLING AND FACTORISATION OPERATORS\n\nAiming to decouple the augmented system given in equation (<ref>) for u_E=u_H=0, we decompose U as\n\t\n    U=(U_H\n    U_E),\n\n\twhere U_E=( 0\nE) and U_H=(  H\n0) to obtain\n\t\n    (\n    \t\n    \t-i δ_μ̂    0\n    \n    \t-i ∗_ε̂d    -i  d ) U_H     = - ω \n    \tU_E,    (\n    \t\n    \t- i d    i ∗_μ̂d\n    \n    \t0     -i δ_ε̂ ) U_E  = - ω  U_H.\n\n\tEliminating U_E from the above system, we derive the following equation in terms of H\n\t\n    (- dδ_μ̂+ ∗_μ̂d∗_ε̂d) H - ω ^2 H=0.\n\n\twhich applying the operator ∗_ε̂∗_μ̂ becomes\n\t\n    L_HH=\t(-∗_ε̂∗_μ̂dδ_μ̂+ ∗_ε̂d∗_ε̂d) H - ω ^2∗_ε̂∗_μ̂H=0.\n\n\tOr equivalently, in coordinates\n\t\n    L_HH=√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lqμ̂^qaD_x^a(μ̂^kbD_x^b-i ∂_x^d(√(|μ̂^-1|)μ̂^kd)/√(|μ̂^-1|))H_k\n    -(ε̂^-1)_lqσ^aj qD_x^a/√(|ε̂^-1|)(ε̂^-1)_bjσ^dkbD_x^d/√(|ε̂^-1|)H_k-ω^2√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lqμ̂^qkH_k=0.\n\n\tFollowing the approach of <cit.>, the next step is to separate the differentiation with respect to x_3 from the differentiation with respect to x̃ to write the differential operator L_H as\n\t\n    L_H=T_H(x)D_x_3^2+A_H(x,D_x̃) D_x_3+ G_H(x)D_x_3+Q_H(x,D_x̃)+ F_H(x,D_x̃) +R_H(x),\n\nwhere the symbols of the operators in the representation of L_H are given by\n\n    (T_H(x))_l^k   =√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lqμ̂^q3μ̂^k3+(δ_l^kε̂^33-δ_l^3ε̂^3k),\n\n\n    (A_H(x,ξ̃))_l^k   = √(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lq(\n    μ̂^q3μ̂^kãξ_ã+ μ̂^qãξ_ãμ̂^k3)\n       3cm+ 2 δ_l^k⟨ν, ξ̃⟩_ε̂- δ_l^3ξ_ãε̂^ãk - δ_l^l̃ξ_l̃ε̂^3k ,\n\n\n    (G_H(x))_l^k   =\n    -i√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lq(μ̂^qa∂_x^aμ̂^k3 +  μ̂^q3∂_x^a(√(|μ̂^-1|)μ̂^ka)/√(|μ̂^-1|)) \n       + i (ε̂^-1)_lqσ^aj q/√(|ε̂^-1|)∂_x^a(ε̂^-1)_b̃jσ^3k̃b̃/√(|ε̂^-1|),\n\n\n    (Q_H(x,ξ̃))_l^k   =√(|μ̂^-1|)/√(|ε̂^-1|)\n    (ε̂^-1)_lqμ̂^qãξ_ãμ̂^kb̃ξ_b̃+ (δ_l^k|ξ̃|_ε̂^2-δ_l^l̃ξ_l̃ξ_ãε̂^ãk),\n\n\n    (F_H(x,ξ̃))_l^k   =\n    -i√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lq(μ̂^qa∂_x^aμ̂^kãξ_ã + μ̂^qd̃ξ_d̃∂_x^a(√(|μ̂^-1|)μ̂^ka)/√(|μ̂^-1|))\n       + i (ε̂^-1)_lqσ^aj q/√(|ε̂^-1|)∂_x^a(ε̂^-1)_bjσ^d̃kb/√(|ε̂^-1|)ξ_d̃,\n\n\n    (R_H(x))_l^k= - ω^2√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lqμ̂^qk- (ε̂^-1)_lqμ̂^qb∂_x^b∂_x^a(√(|μ̂^-1|)μ̂^ka)/√(|μ̂^-1|).\n\nNext we show that L_H can be factorised using pseudodifferential operators. We will make use of the principal symbol of L_H which is\n\n    σ_p(L_H) = M_H(ξ_3)=T_H(x)ξ_3^2+ A_H(x,ξ̃)ξ_3+Q_H(x,ξ̃).\n\nM_H is a matrix polynomial with respect to the variable ξ_3 in the sense of <cit.> and, for fixed (x,ξ̃), the eigenvalues are the solutions of the sixth order polynomial equation det(M_H(ξ_3)) = 0. \n\n\nSuppose that we have some local boundary coordinates {x^j}_j=1^3 and let Γ_+(x,ξ̃) ⊂ℂ be a contour in ℂ enclosing all eigenvlaues of M_H with positive imaginary part. Then, in the domain of the coordinates, there exist pseudodifferential operators B(x,D_x̃) and G_0(x, D_x̃) of order 1 and 0, respectively, such that the principal symbol of B is given by\n\n    B^(1)(x,ξ̃)= ∫_Γ^+ξ_3 M_H(ξ_3)^-1 dξ_3(∫_Γ^+  M_H(ξ_3)^-1 dξ_3)^-1\n\nand\n\n    L_H= (𝕀D_x^3- B^∗(x,D_x̃)+ G_0 (x,D_x̃) )T_H(x)(𝕀 D_x^3- B(x,D_x̃) )\n\nmodulo smoothing. Additionally, B(x,D_x̃) satisfies the following Riccati equation\n\n    T_HD_x^3B+ (A_H+ G_H)B+ T_HB^2+ Q_H+ F_H + R_H=0\n\nand the symbol of B is a smooth function of ε̂ and μ̂.\n\n\n\nThe proof is the same as the proof of <cit.> which we briefly sketch. First, the Riccati equation (<ref>) can be derived from (<ref>) and the expression of the operator L_H as done in the proof of <cit.>. Looking at the principal symbol of the operators on both sides of (<ref>), we see that the principal symbol B^(1) of B must satisfy\n\n    T_H(x)(B^(1)(x,ξ̃))^2+ A_H(x,ξ̃)B^(1)(x,ξ̃)+Q_H(x,ξ̃)=0\n\nand using <cit.> we see that B^(1) given by (<ref>) will satisfy this equation. The remainder of the symbol of B can then be determined by looking at an asymptotic symbol expansion of (<ref>) and this symbol can be asymptotically summed to produce a pseudodifferential operator that satisfies (<ref>) modulo smoothing. Then the symbol for G_0 can be determined from (<ref>) in the same way.\n\nThe final statement about smoothness of the symbol of B with respect to the parameters ε̂ and μ̂ can be proven by first looking at the principal symbol given by (<ref>). Indeed, given (x,ξ̃) a single choice of Γ_+ will work also in a neighbourhood of (x,ξ̃), and so the regularity with respect to the parameters follows from the regularity of M_H(ξ_3)^-1 with respect to the same on the contour Γ_+. The regularity of the rest of the symbol with respect to ε̂ and μ̂ follows from this and the construction of the lower order parts of the symbol as given in <cit.>.\n\n\nNext we express the principal symbol B^(1) given by (<ref>) more explicitly. The expression we derive will be used in the calculation of the principal symbols of Λ_ε̂ and Λ_μ̂ later.\nOur method uses the theory of monic matrix polynomials <cit.> to determine the Jordan pairs of M_H(ξ_3) and then express B^(1)(x,ξ̃) in terms of them. The theory of monic matrix polynomials is applicable to M_H(ξ_3) as the coefficient T_H(x) is invertible.\n\n\nIn order to calculate the Jordan pairs of M_H, we should find the eigenvalues of M_H and for each eigenvalue ξ_3 also find covectors y_j such that \n\t\n    ∑_p=0^j1/p!∂_ξ_3^p M_H(ξ_3)y_j-p=0,    j=0, … k-1\n\nwhere k is at most the order of ξ_3 as a root of the equation (M_H(ξ_3))=0. For each eigenvalue, the covector y_0 is called a corresponding eigenvector and the covectors y_1,… y_k-1 are called generalised eigenvectors. Writing M_H(ξ_3) in coordinates, we have\n\n    (√(|μ̂^-1|)/√(|ε̂^-1|)(ε̂^-1)_lqμ̂^qaξ_aμ̂^kdξ_d+ δ_l^k|ξ|_ε̂^2- ξ_lξ_dε̂^dk) H_k=0,\n\nwhere we have made use of the identity (<ref>) for the ε̂^-1 metric. Let us now consider the covectors\n\n    ξ,   ζ=ε̂^-1μ̂ξ,   χ= ∗_ε̂ (ξ∧ζ).\n\nWhen these covectors form a basis (see remark <ref>), we can write M_H in the basis {χ,ξ,ζ} as follows\n\n    [χ   ξ   ζ]^Tε̂M_H [χ   ξ   ζ]=(|ξ|_ε̂^2   0   0\n    \n    0   0   √(|μ̂^-1|)/√(|ε̂^-1|)|ξ|_μ̂^2\n    \n    0    -|ξ|_μ̂^2   √(|μ̂^-1|)/√(|ε̂^-1|)|ξ|_μ̂ε̂^-1μ̂^2+|ξ|_ε̂^2).\n\nThe determinant of the above vanishes for ξ_3 satisfying\n\n    |ξ|_μ̂^4|ξ|_ε̂^2=0.\n\n \nRecalling Remark <ref>, let us point out that the quantities |ξ|_μ̂^2 and |ξ|_ε̂^2 can vanish for complex ξ as they are given by the real inner products ⟨·, ·⟩_ε̂ ⟨·, ·⟩_μ̂. \n\nFor fixed ξ̃, the solutions ξ_3 of (<ref>) are conjugate pairs denoted by ξ_μ̂_3, ξ_μ̂_3 and ξ_ε̂_3, ξ_ε̂_3, respectively. The values of ξ_3 with positive imaginary part denoted by ξ_μ̂_3 and ξ_ε̂_3 are given by, respectively\n\n    ξ_μ̂_3=- ⟨ν,ξ̃⟩_μ̂/μ̂^33+ i |ξ̃|_μ̃/√(μ̂^33),\n\n\n    ξ_ε̂_3=- ⟨ν,ξ̃⟩_ε̂/ε̂^33+ i |ξ̃|_ε̃/√(ε̂^33),\n\nwhere we have made use of the representations of ε̂ and μ̂ given in equations (<ref>), (<ref>). We notice that ξ_μ̂_3 is a double root of (M_H(ξ_3)) and we expect an eigenvector and a generalised eigenvector associated with this value of ξ_3.\nThe eigenvector corresponding to ξ_μ̂_3 will be denoted by ξ_μ̂ and is given by\n\n    ξ_μ̂= ξ|_ξ_3=ξ_μ̂_3.\n\n The generalised eigenvector is given by\n\t\n    γ_μ̂= ν + m_μ̂ζ_μ̂,\n\nwhere\n\n    ζ_μ̂=ζ|_ξ_3=ξ_μ̂_3         m_μ̂=  -  2√(|μ̂^-1|)/√(|ε̂^-1|)⟨ν,ξ_μ̂⟩_μ̂/√(|μ̂^-1|)/√(|ε̂^-1|)|ξ_μ̂|_μ̂ε̂^-1μ̂^2+ |ξ_μ̂|_ε̂^2.\n\nProceeding to the eigenvalue ξ_ε̂_3, as it is a single root of (M_H(ξ_3)), it corresponds to the eigenvector\nχ_ε̂, defined by\n\n    χ_ε̂= χ|_ξ_3 =ξ_ε̂_3.\n\nTherefore, the Jordan pairs and blocks of the matrix polynomial M_H(ξ_3) are given by\n\n    Y_ε̂= χ_ε̂ ,    J_ε̂=[ξ_ε̂_3],      \tY_μ̂= [ξ_μ̂   γ_μ̂],    J_μ̂= ( ξ_μ̂_3   1\n    \n    0   ξ_μ̂_3).\n\nUsing the Jordan pairs in the above, the principal symbol of the pseudodifferential operator B(x,D_x̃) is expressed as\n\n    B^(1)(x,ξ̃)= X_HJ_HX_H^-1,\n\nwhere\n\n    J_H= (ξ_ε̂_3   0   0\n    \n    0   ξ_μ̂_3   |ξ_μ̂|_ε̂\n    \n    0   0   ξ_μ̂_3)    \n    X_H= [χ̂_ε̂   ξ̂_μ̂   γ_μ̂]\n\nand χ̂_ε̂, ξ̂_μ̂ denote that the covectors χ_ε̂ and ξ_μ̂ are normalised in such a way that X_H ∈ Ψ DO^(0).\nAdditionally, M_H(ξ_3) can be factorised in terms of B^(1)(x,ξ̃) as \n\n    M_H(ξ_3)=(𝕀ξ_3-(B^∗)^(1)(x,ξ̃))T_H(x)(𝕀ξ_3 -B^(1)(x,ξ̃)),\n\nwhere in order to derive the above factorisation we use the fact that \tT_H^1/2B^(1)T_H^-1/2, T_H^1/2(B^∗)^(1)T_H^-1/2 are spectral right and left divisors of T_H^-1/2M_H(ξ_3)T_H^-1/2, respectively. Factorising M_H(ξ_3), we can follow the method of <cit.> to obtain the factorisation of L_H provided in (<ref>), where the principal symbol of B(x,D_x̃) is B^(1)(x,ξ̃).\n\n\tWe observe that when ξ_ε̂_3=ξ_μ̂_3, the covectors ξ, χ and ζ do not constitute a basis and the representation (<ref>) does not apply. However, using the continuity of the symbol B(x,ξ̃) with respect to ε̂ and μ̂ the various symbol expressions for the impedance and other maps derived below are still valid even when ξ_ε̂_3=ξ_μ̂_3.\n\n\nNext, we state the following result which will be used in the calculation of the principal symbol of the impedance map. The proof follows the proof of <cit.>.\n\n\tIf H is the solution of the Dirichlet problem consisting of (<ref>), then\n\t\n    D_x_3H=B(x,D_x̃)H, ,     M.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe corresponding factorisation operator obtained by decoupling the system in terms of the electric field E and following similar reasoning to the above, will be denoted by C(x,D_x̃). The pseudodifferential operator C(x,D_x̃) satisfies the Riccati equation\n\n    T_ED_x^3C+ (A_E+ G_E)C+ T_EC^2+ Q_E+ F_E + R_E=0,\n\nwhere T_E, A_E, G_E, Q_E, F_E, R_E are obtained from T_H, A_H, G_H, Q_H, F_H, R_H by exchanging ε̂ with μ̂.\nThe principal symbol of C(x,D_x̃) is provided by\n\n    C^(1)(x,ξ̃)= X_EJ_EX_E^-1,\n\nwhere\n\n    J_E= (ξ_μ̂_3   0   0\n    \n    0   ξ_ε̂_3   |ξ_ε̂|_μ̂\n    \n    0   0   ξ_ε̂_3)    \n    X_E= [χ̂_μ̂   ξ̂_ε̂   γ_ε̂]\n\nand the covectors χ_μ̂, ξ_ε̂ and γ_ε̂ are obtained from χ_ε̂, ξ_μ̂ and γ_μ̂ by exchanging μ̂ with ε̂.\n\nViewing the solution H of the Dirichlet problem involving equations (<ref>) and (<ref>) as a pseudodifferential operator acting on the boundary data F and motivated by the expression of B^(1)(x,ξ̃), the principal symbol of H in the basis {χ_ε̂,ξ_μ̂,γ_μ̂} is written as\n\n    H_k^(0)= a_ε̂χ_ε̂_k+ b_ε̂ξ_μ̂_k,\n\n\twhere\n\n    a_ε̂= ∗_ι^∗ε̂(ξ̃∧ F)/⟨ν_ε̂,ξ_ε̂⟩_ε̂|ξ_ε̂|_μ̂^2,    b_ε̂= ∗_ι^∗ε̂(F∧χ_ε̂)/⟨ν_ϵ,ξ_ε̂⟩_ε̂|ξ_ε̂|_μ̂^2.\n\nHere ∗_ι^∗ε̂ denotes the Hodge star operator with respect to the ε̂ metric pulled back to ∂ M and ν_ε̂ is the normal covector at ∂ M with respect to the ε̂ metric. This decomposition of the principal symbol of H is implied since it has to vanish on the principal symbol of the divergence equation ξ_ãμ̂^ãbH_b^(0)+ μ̂^3a(B^(1)(x,ξ̃))_a^bH_b^(0)=0. Similarly, the principal symbol of E seen as a pseudodifferential operator acting on the boundary data G is given by\n\t\n    E_k^(0)= a_μ̂χ_μ̂_k+ b_μ̂ξ_ε̂_k,\n\nwhere a_μ̂ and b_μ̂ are obtained from a_ε̂, b_ε̂ by exchanging ε̂ with μ̂ and replacing F by G.\n\n\t\n\n§ PRINCIPAL SYMBOLS OF BOUNDARY MAPPINGS AND BOUNDARY RECOVERY\n\n\t\n\t\n\t\tThe principal symbol of the impedance map Λ_ε̂: ι^∗H ↦ι^∗E is given by\n\t\t\n    λ_ε̂^(1)(F) = -ξ̃ ∗_ι^∗ε̂(ξ̃∧ F  ) /ω⟨ν_ε̂, ξ_ε̂⟩_ε̂.\n\n\t\n\t\n\t\tLet us consider the Maxwell's equation\n\t\t\n    ∗_ε̂dH= -i ω E,\n\n\t\twhich taking the pullback and considering the principal symbol in coordinates gives\n\t\t\n    λ_ε̂^(1)(F)\t =-1/ω(ε̂^-1)_l̃bσ^ãkb/√(|ε̂^-1|)ξ_ãH_k^(0) -1/ω(ε̂^-1)_l̃b̃σ^3ãb̃/√(|ε̂^-1|)(B^(1)(x,ξ̃))_ã^k H_k^(0).\n\nObserving that ξ_μ̂ in the decomposition (<ref>) of H^(0) is in the kernel of the right hand-side of the above equation, only the covector χ_ε̂ contributes to the principal symbol of Λ_ε̂\n\t\tas follows\n\t\t\n    λ_ε̂^(1)(F) = - a_ε̂1/ω (ε̂^-1)_l̃bσ^akb/√(|ε̂^-1|)ξ_ε̂_aχ_ε̂_k= - a_ε̂/ωξ_l̃|ξ_ε̂|_μ̂^2,\n\n\t\twhere we have used the identity (<ref>) for the ε̂^-1 metric.\n\t\tSubstituting the expression (<ref>) for a_ε̂ we obtain the result.\n\n\n\n\n\n\t\nWorking similarly to the above we can calculate the principal symbol of the admittance map as stated in the following theorem.\n\t\n\tThe principal symbol of the admittance map Λ_μ̂: ι^∗E ↦ι^∗H is given by\n\t\n    λ_μ̂^(1)(G)= ξ̃ ∗_ι^∗μ̂(ξ̃∧ G )  /ω⟨ν_μ̂, ξ_μ̂⟩_μ̂.\n\n\n\n\n\n §.§ Proof of Theorem <ref>\n \n\nFrom the fact that λ_ε̂^(1)=λ_ε̂'^(1)  and using Theorem <ref>, we get\n\t\n    √(|ε̃^-1|)⟨ν_ε̂,ξ_ε̂⟩_ε̂\t=√(|ε̃'^-1|)⟨ν_ε̂',ξ_ε̂'⟩_ε̂',    x_3=0,\n\nwhich, from (<ref>), leads to\n\t\n    √(|ε̃^-1|)|ξ̃|_ε̃ = √(|ε̃'^-1|)|ξ̃|_ε̃',    x_3=0.\n\n\tThis implies that\n\t\n    ε̃=ε̃'    x_3=0.\n\n\t Working in the same way for λ_μ̂^(1)=λ_μ̂'^(1) we reach the corresponding result for μ̃ and μ̃' which completes the proof of Theorem <ref>.\n\t \n\t\tThe result of Theorem <ref> in terms of the metrics (ε^♯,μ^♯), (ε'^♯,μ'^♯) translates to\n\t\t\n    | g |ε^ĩj̃=| g'|ε'^ĩj̃,    x_3=0,\n\n\t\tin boundary normal coordinates for ε^♯/ ε'^♯ and\n\t\t\t\n    | g |μ^ĩj̃=| g'|μ'^ĩj̃,    x_3=0,\n\n\t\tin boundary normal coordinates for μ^♯/ μ'^♯. Theorem <ref> implies that the presence of the determinant | g | in the above equations leads to a non-uniqueness on the boundary recovery of ε^♯ and μ^♯. More specifically, we have that the tangential components of the metrics ε^♯, μ^♯ can be determined up to a conformal factor which is arbitrary.\n\n\n §.§ Further consequences\n\nNow let us investigate the consequences of Theorem <ref> to the different pairs of electromagnetic fields E, H and E', H'.\n\n\tLet (ε̂,μ̂), (ε̂',μ̂')  be two different metrics and Λ_ε̂, Λ_ε̂', E, H, E', H' the associated impedance maps and electromagnetic fields, respectively. Assuming that Λ_ε̂=Λ_ε̂' and ι^∗H=ι^∗H' then\n\t\n    E=E',    x_3=0,\n\n\tin boundary normal coordinates for ε̂/ ε̂' and\n\t\n    H=H',    x_3=0,\n\n\tin boundary normal coordinates for μ̂/μ̂'.\n\n\n\n\n\n\n\nWe will work with E, E' and the result for H, H' is derived accordingly. Since ι^∗E=ι^∗E', it suffices to prove that E_3=E_3' at x_3=0.\n\tTo start with, let us consider the third component of the equation\n\t\n    ∗_ε̂d H= -i ω E,    x_3=0,\n\nin boundary normal coordinates for ε̂, which is\n\t\n    E_3=\ti/ωσ^ãk̃3/√(|ε̃^-1|)∂ H_k̃/∂ x_ã,    x_3=0.\n\n\tSimilarly, the corresponding equation for the '- parameters in boundary normal coordinates for ε̂' is given by\n\t\n    E'_3=\ti/ωσ^ãk̃3/√(|ε̃^-1|)∂ H_k̃/∂ x_ã,    x_3=0,\n\n\twhere we have used the result of Theorem <ref> and the assumption ι^∗H=ι^∗H'.\n\tTherefore, E_3=E'_3 at x_3=0 which completes the proof.\n\nLet Ψ, Ψ' be the following change of coordinates transformations\n\n    ε̂  Ψ⟶  μ̂,\n\n\n    ε̂'   Ψ'⟶  μ̂'.\n\nThe Jacobian matrix of Ψ and its inverse at x_3=0 are given by\n\n    DΨ =( \n    1   0    -μ̂^13/μ̂^33\n    \n    0   1    -μ̂^23/μ̂^33\n    \n    0   0   1/√(μ̂^33)),    \n    DΨ^-1=( \n    1   0   μ̂^13/√(μ̂^33)\n    \n    0   1   μ̂^23/√(μ̂^33)\n    \n    0   0   √(μ̂^33)),\n\nwhere the entries of μ̂ are expressed in boundary normal coordinates for ε̂. Similarly, the Jacobian matrix of Ψ' and its inverse at x_3=0 are obtained by (<ref>) after substituting the entries of μ̂ by the entries of μ̂'.\nUsing (<ref>) we obtain the following representations for ε̂ and its determinant in boundary normal coordinates for μ̂ at x_3=0\n\n    ε̂= DΨ(ε̃   0\n    \n    0^T   1\n    ) (DΨ)^T= (ε̃+ μ̂^3ĩμ̂^3j̃/(μ̂^33)^2    - μ̂^ĩ3/(μ̂^33)^3/2\n    \n    - μ̂^j̃3/(μ̂^33)^3/2   1/μ̂^33),   |ε̂|=|ε̃|/μ̂^33.\n\nSimilarly, the metric μ̂ and its determinant in boundary normal coordinates for ε̂ at x_3=0 are provided by\n\n    μ̂= DΨ ^-1(μ̃   0\n    \n    0^T    1\n    ) (DΨ ^-1)^T=( μ̃+ μ̂^3ĩμ̂^3j̃/μ̂^33   μ̂^ĩ3\n    μ̂^3j̃   μ̂^33),   |μ̂|=μ̂^33|μ̃|.\n\nThe expressions of ε̂' in boundary normal coordinates for μ̂' and μ̂' in boundary normal coordinates for ε̂' at x_3=0 follow from equations (<ref>) and (<ref>), respectively, after substituting the entries of μ̂ by the entries of μ̂'.\nNow let us introduce the notation for the covectors  ξ_μ̂, χ_μ̂, ξ_ε̂ and χ_ε̂ in boundary normal coordinates for μ̂ and ε̂ as shown in Table <ref> and then express their normal components in each coordinate system.\n\n\n\tThe normal components of the covectors ξ_ε̂,ε̃, ξ_μ̂,μ̃, ξ_μ̂,ε̃ and ξ_ε̂,μ̃ are provided by\n\t\n    ξ_ε̂,ε̃_3= i |ξ̃|_ε̃,   ξ_μ̂,μ̃_3= i |ξ̃|_μ̃,\n\n\t\n    ξ_μ̂,ε̃_3= - ⟨ν,ξ̃⟩_μ̂/μ̂^33 + i |ξ̃|_μ̃/√(μ̂^33),   ξ_ε̂,μ̃_3= ⟨ν,ξ̃⟩_μ̂/√(μ̂^33)+ i |ξ̃|_ε̃√(μ̂^33).\n\n\n\n\tTo prove the above equations it suffices to use equations (<ref>) and (<ref>) and the representations of each metric in the different coordinate systems.\n\n\n\tThe normal components of the covectors χ_μ̂,ε̃_3, χ_μ̂',ε̃_3, χ_ε̂,μ̃_3 and  χ_ε̂',μ̃_3 are expressed as\n\n    χ_μ̂,ε̃_3= σ_3j̃ĩε̃^ĩd̃ξ_d̃μ̃^j̃b̃ξ_b̃/√(|μ̃|)√(μ̂^33)+ i |ξ̃|_μ̃σ_3j̃ĩε̃^ĩb̃ξ_b̃μ̂^j̃3/√(|μ̃|)μ̂^33,\n\t\n\t\n    χ_ε̂,μ̃_3= σ_3j̃ĩε̃^b̃j̃ξ_b̃μ̃^ĩd̃ξ_d̃√(μ̂^33)/√(|ε̃|)- i|ξ̃|_ε̃σ_3j̃ĩμ̂^3j̃μ̃^ĩd̃ξ_d̃/√(|ε̃|)√(μ̂^33).\n\n\n\n\tWe use the following expressions of the covectors χ_μ̂ and χ_ε̂ in general coordinates\n\t\t\n    χ_μ̂_k=σ_kjiμ̂^bjξ_μ̂_bε̂^idξ_μ̂_d/√(|μ̂|),\n\n\t\n    χ_ε̂_k=σ_kjiε̂^bjξ_ε̂_bμ̂^idξ_ε̂_d/√(|ε̂|),\n\n\twhich are derived using the identity (<ref>) for the metrics μ̂ and ε̂, respectively.\n\t The normal components of these covectors in each coordinate system are calculated using the representations of the metrics in each coordinate system and Lemma <ref>.  \n\nThe normal components of the '- covectors in the different coordinate systems denoted by ξ_ε̂',ε̃_3, ξ_μ̂',μ̃_3, ξ_μ̂',ε̃, ξ_ε̂',μ̃, χ_ε̂',μ̃_3 and χ_μ̂',ε̃_3 are obtained from the expressions derived in Lemma <ref> and <ref> after substituting the normal components of μ̂ by the normal components of μ̂'.\n\n\tLet (ε̂,μ̂) (ε̂',μ̂') be 2 different sets of metrics and Λ_ε̂, Λ_ε̂' the associated boundary mappings. \n\tIf Λ_ε̂=Λ_ε̂', then the following identities hold\n\t\n    (ξ_μ̂',ε̃_3+ ξ_ε̂,ε̃_3)χ_μ̂,ε̃_3=(ξ_μ̂,ε̃_3+ ξ_ε̂,ε̃_3)χ_μ̂',ε̃_3,    x_3=0,\n\n\t\t\n    (ξ_ε̂',μ̃_3+ ξ_μ̂,μ̃_3)χ_ε̂,μ̃_3=(ξ_ε̂,μ̃_3+ ξ_μ̂,μ̃_3)χ_ε̂',μ̃_3,    x_3=0.\n\n\n\n\tWe will show the derivation of the identity (<ref>) as (<ref>) is proven in a similar way. Let us fix boundary normal coordinates for ε̂. We aim to write χ̃_μ̂ as\n\t\n    χ̃_μ̂= a ξ̃+ b ξ̃_ε̃⊥\n\nfor some constants a, b to be determined and ξ̃_ε̃⊥:= ∗_ε̃ξ̃ satisfying\n\t\n    ⟨ξ̃, ξ̃_ε̃⊥⟩_ε̃=0,   ξ̃∧ξ̃_ε̃⊥= |ξ̃|_ε̃^2 dv_ε̃,\n\n\twhere dv_ε̃ denotes the volume form at the boundary with respect to the ε̃ metric. Considering the inner product with respect to the ε̃ metric of ξ̃ with (<ref>), we obtain\n\t\n    a= - ξ_μ̂,ε̃_3χ_μ̂,ε̃_3/|ξ̃|_ε̃^2,\n\nwhere we have used the fact that ⟨χ_μ̂,ε̃,ξ_μ̂⟩_ε̂=0. The wedge product of ξ̃ with (<ref>) results to\n\n\n\n\n\t\t\n    b= - i√(|ε̃|)|ξ_μ̂|_ε̂^2|ξ̃|_μ̃/√(|μ̃|)|ξ̃|_ε̃^2.\n\n\tNow let us write the principal symbol of the normal component of E as\n\t\n    E_3^(0)= a_μ̂χ_μ̂,ε̃_3+ b_μ̂ξ_ε̂,ε̃_3.\n\n\tMaking use of equations (<ref>) as well as equation (<ref>) we arrive at\n\t\n    E_3^(0)(G)= χ_μ̂,ε̃_3/|ξ̃|_μ̃|ξ̃|_ε̃(ξ_μ̂,ε̃_3+ ξ_ε̂,ε̃_3) ∗_ι^*μ̂ (ξ̃∧ G )  + i √(|ε̃|)/√(|μ̃|)|ξ̃|_ε̃∗_ι^*μ̂ (ξ̃_ε̃⊥∧ G  ).\n\nSetting this equal to E_3'^(0)(G) with G = ξ̃_ε̃⊥ and using Theorem <ref> completes the proof.\n\n\n\n\n §.§ Proof of Theorem <ref>\n \n\n\nUsing Lemma <ref> and <ref>, the imaginary parts of (<ref>) and (<ref>)  are provided by, respectively,\n\t\n    σ_3j̃ĩε̃^ĩd̃ξ_d̃(  ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-⟨ν,ξ̃⟩_μ̂'μ̂^3j̃)   =|ξ̃|_ε̃/|ξ̃|_μ̃σ_3ĩj̃ε̃^ĩd̃ξ_d̃μ̃^j̃b̃ξ_b̃(μ̂'^33√(μ̂^33) -μ̂^33√(μ̂'^33)),\n    σ_3j̃ĩμ̃^ĩd̃ξ_d̃(  ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-⟨ν,ξ̃⟩_μ̂'μ̂^3j̃)   =|ξ̃|_μ̃/|ξ̃|_ε̃σ_3ĩj̃ε̃^ĩd̃ξ_d̃μ̃^j̃b̃ξ_b̃(μ̂'^33√(μ̂^33) -μ̂^33√(μ̂'^33)).\n\nCombining the above displayed formulae we arrive at\n\n    σ_3j̃ĩ(⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-  ⟨ν,ξ̃⟩_μ̂'μ̂^3j̃) ( |ξ̃|_ε̃^2μ̃^ĩd̃ξ_d̃-|ξ̃|_μ̃^2ε̃^ĩd̃ξ_d̃)=0.\n\nNow we are going distinguish the following two different cases. \n\n\t\n  * There exists a>0 such that \n\t\n    μ̃=a ε̃.\n \n\t\n  * The metrics μ̃ and ε̃ are not multiples.\n\nStarting with case <ref>, we have that σ_3ĩj̃ε̃^ĩd̃ξ_d̃μ̃^j̃b̃ξ_b̃=0 and the first equation in (<ref>) reduces to\n\n    σ_3j̃ĩε̃^ĩd̃ξ_d̃(  ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-⟨ν,ξ̃⟩_μ̂'μ̂^3j̃)=0.\n\nThis implies that if (  ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-⟨ν,ξ̃⟩_μ̂'μ̂^3j̃) ≠ 0, there exists b∈ℝ such that\n\n    ε̃^j̃d̃ξ_d̃= b  ( ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-⟨ν,ξ̃⟩_μ̂'μ̂^3j̃),\n\nwhich cannot hold, since multiplying the above by ξ_j̃ leads to |ξ̃|_ε=0. Therefore, ( ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃-⟨ν,ξ̃⟩_μ̂'μ̂^3j̃)=0 or equivalently\n\n    μ̂'^3j̃=cμ̂^3j̃,    x_3=0.\n\nfor c∈ℝ.\n\nIt remains to work with case <ref>, where μ̃ and ε̃ are assumed not to be multiples. Under this assumption, equation (<ref>) yields, at least for all ξ̃ in an open set, to\n\n    ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃- ⟨ν,ξ̃⟩_μ̂'μ̂^3j̃= β(  μ̃^j̃ãξ_ã|ξ̃|_ε̃^2-ε̃^j̃ãξ_ã|ξ̃|_μ̃^2),\n\nwhere β∈ℝ. Combining the above with the equations in (<ref>) we get\n\n    ⟨ν,ξ̃⟩_μ̂μ̂'^3j̃- ⟨ν,ξ̃⟩_μ̂'μ̂^3j̃=( μ̂^33√(μ̂'^33)-μ̂'^33√(μ̂^33)) (  μ̃^j̃ãξ_ã|ξ̃|_ε̃/|ξ̃|_μ̃-ε̃^j̃ãξ_ã|ξ̃|_μ̃/|ξ̃|_ε̃).\n\nDifferentiating (<ref>) with respect to ξ̃ results to\n\n    μ̂'^3j̃μ̂^3ã-  μ̂^3j̃μ̂'^3ã   =( μ̂^33√(μ̂'^33)-μ̂'^33√(μ̂^33))(μ̃^j̃ã|ξ̃|_ε̃/|ξ̃|_μ̃+ μ̃^j̃d̃ξ_d̃/|ξ̃|_μ̃ε̃^ãb̃ξ_b̃/|ξ̃|_ε̃.\n       . - μ̃^j̃d̃ξ_d̃|ξ̃|_ε̃μ̃^b̃ãξ_b̃/|ξ̃|_μ̃^3-ε̃^j̃ã|ξ̃|_μ̃/|ξ̃|_ε̃- ε̃^j̃d̃ξ_d̃/|ξ̃|_ε̃μ̃^ãb̃ξ_b̃/|ξ̃|_μ̃+ ε̃^j̃d̃ξ_d̃|ξ̃|_μ̃ε̃^b̃ãξ_b̃/|ξ̃|_ε̃^3).\n\nLet η∈ T^*_x(∂ M) be linearly independent from ξ̃. Multiplying both sides of the above displayed equation by η, we get\n\n    ( μ̂^33√(μ̂'^33)-μ̂'^33√(μ̂^33))[|ξ̃|_ε̃/|ξ̃|_μ̃( |η|_μ̃^2-\n    ⟨ξ̃,η⟩ _μ̃^2/|ξ̃|_μ̃^2)-|ξ̃|_μ̃/|ξ̃|_ε̃( |η|_ε̃^2-\n    ⟨ξ̃,η⟩ _ε̃^2/|ξ̃|_ε̃^2)]=0.\n\nAssuming that the second factor in (<ref>) vanishes and fixing η such that\n\n    η_1=-ξ_2,   η_2=ξ_1\n\nwe obtain\n\n    |ξ̃|_ε̃^4/|ξ̃|_μ̃^4= |ε̃|/|μ̃|.\n\nThe above holds for ξ̃ in an open set, and we observe that the right hand-side does not depend on ξ̃. Therefore ε̃ should be a multiple of μ̃, which contradicts to our initial assumption. Hence, the second factor in (<ref>) cannot be zero\nwhich leads to\n\n    μ̂^33=μ̂'^33,    x_3=0.\n \nTaking this into account and revisiting equation (<ref>) we have, assuming without loss of generality that μ̂^j̃3≠ 0,\n\n    μ̂'^j̃3=cμ̂^j̃3,    x_3=0,\n\nfor c∈ℝ. Next, the real part of (<ref>), by virtue of the relationships between the normal components of μ̂ and μ̂', becomes\n\t\n    (1-c )⟨ξ̃,ν⟩ _μ̂σ_3j̃ĩε̃^ĩd̃ξ_d̃μ̃^ĩb̃ξ_b̃\n    +|ξ̃|_μ̃^2( c-1) σ_3j̃ĩε̃^ĩd̃ξ_d̃μ̂^3j̃\n    =|ξ̃|_ε̃|ξ̃|_μ̃√(μ̂^33)( 1-c )σ_3j̃ĩε̃^ĩd̃ξ_d̃μ̂^3j̃,\n\nwhich choosing ξ̃≠ 0 such that\n\n    ⟨ν,ξ̃⟩_μ̂=0,\n\nsimplifies to\n\n    ( c-1) ( |ξ̃|_μ̃^2+|ξ̃|_ε̃|ξ̃|_μ̃√(μ̂^33))σ_3j̃ĩε̃^ĩd̃ξ_d̃μ̂^3j̃=0.\n\nSince the vectors ε̃^j̃d̃ξ_d̃ and μ̂^3j̃ are not multiples of each other, we have\n\n    ( c-1) ( |ξ̃|_μ̃^2+|ξ̃|_ε̃|ξ̃|_μ̃√(μ̂^33))=0.\n\nSince the second term on the left is positive, we deduce that c=1 which implies\n\n    μ̂^3j̃=\tμ̂'^3j̃,    x_3=0.\n\n\n\n\n\n\n\n\n\nThis completes the proof of Theorem <ref>.\n\n\n\nIn the following lemma we show that when the different pairs of metrics agree at x_3=0 in boundary normal coordinates for ε̂/ε̂' then the same holds for the electromagnetic fields E, H, E', H'. This will be used in Section <ref>.\n\t\n\t\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of metrics and E, H, E', H' be the corresponding electric and magnetic fields. If ε̂=ε̂' and μ̂=μ̂' at x_3=0, in boundary normal coordinates for ε̂/ε̂', then\n\t\t\n    E=E',    x_3=0\n\n\t\tand\n\t\t\n    H=H',    x_3=0.\n\n\t\n\n\tTo prove the above we only need to consider the magnetic fields H and H' as the result for E, E' is already proven in Lemma <ref>. Considering the change of coordinates (<ref>) and the fact that H=H' in boundary normal coordinates for μ̂/μ̂' completes the proof.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n§ NORMAL DERIVATIVES OF ELECTROMAGNETIC PARAMETERS\n\n\t\n\n\n\n\n\n\nIn this section, we apply the methods of <cit.> and <cit.> to show inductively that when the metrics (ε̂,μ̂),(ε̂',μ̂') are equal at x_3=0, then, for any κ>0, ∂_x_3^κε̂=∂_x_3^κε̂', ∂_x_3^κμ̂=∂_x_3^κμ̂' at x_3=0 which proves Theorem <ref>.\n\nLet us consider the pseudodifferential operators B(x,D_x̃) and B'(x,D_x̃) associated with the metrics (ε̂, μ̂) and (ε̂', μ̂') respectively and define Y=B'-B ∈ Ψ DO^(1). Making use of the Riccati equation (<ref>) and the corresponding Riccati equation for the '- parameters we have that Y satisfies\n\t\n    T_H'D_x^3Y+ ( A_H'+ G_H')Y+ T_H'Y^2+ T_H'BY +T_H'YB=\n       0.5cm [(A_H-A_H')+(G_H-G_H')+(T_H-T_H')B]B + (R_H-R_H')\n       0.5cm+ (Q_H-Q_H') +(F_H-F_H')+(T_H-T_H')D_x^3B.\n\nSimilarly, J ∈ Ψ DO^(1) realised by J=C'-C, satisfies\n\t\n    T_E'D_x^3J+ ( A_E'+ G_E')J+ T_E'J^2+ T_E'CJ +T_E'JC=\n       0.5cm [(A_E-A_E')+(G_E-G_E')+(T_E-T_E')C]C + (R_E-R_E')\n       0.5cm + (Q_E-Q_E') +(F_E-F_E')+(T_E-T_E')D_x^3C.\n\nLet us now define a class of pseudodifferential operators that depends smoothly on the normal distance from the boundary with respect to the ε̂ metric.\n\n\tWe say P ∈Ψ DO^(m,p)(∂ M, ℝ_+) if it is a family of pseudodifferential operators of order m on ∂ M, varying smoothly up to x_3=0 such that\n\t\n    P=∑_j=0^px_3^jP^(m-p+j),\n\n\twith P^(j) ∈ Ψ DO^(m-p+j)(∂ M).\n\nThe calculus of Ψ DOs as well as the definition immediately implies the following results which are collected here for later use.\n \nSuppose that P ∈Ψ DO^(m,p)(∂ M, ℝ_+) and P' ∈Ψ DO^(m',p')(∂ M, ℝ_+). Then P P' ∈Ψ DO^(m+m',p+p')(∂ M, ℝ_+). Also, P ∈Ψ DO^(m+1,p+1)(∂ M, ℝ_+) and x_3 P ∈Ψ DO^(m,p+1)(∂ M, ℝ_+)\n\n\n \n\tFor P ∈Ψ DO^(m,p)(∂ M, ℝ_+), we define the vector of principal symbols of P=∑_j=0^px_3^jP^(m-p+j) at x_3=0, by taking \n\t\n    σ_p,l(P) = σ_p (1/l!d^l/dx_3^lP|_x_3=0 ),\n\n\twhere 0≤ l ≤ p.\n\tMore particularly, we have that\n\t\n    σ_p(P) =  (σ_p (P^(m-p)|_x_3=0 ),σ_p (P^(m-p+1)|_x_3=0 ),…, σ_p (P^(m)|_x_3=0 ) ).\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe notice that when the metrics (ε̂,μ̂),(ε̂',μ̂') are equal at x_3=0, the principal symbols of B and B' agree at the boundary. Hence Y ∈ Ψ DO^(0)(∂ M), or in terms of the class of pseudodifferential operators given in Definition <ref>, Y=x_3Y^(1)+Y^(0),\nwhere, restricted to ∂ M, Y^(1)∈Ψ DO^(1)(∂ M) and Y^(0)∈Ψ DO^(0)(∂ M). This is equivalent to Y ∈Ψ DO^(1,1)(∂ M,ℝ^+) and correspondingly, for the pseudodifferential operator J, we have J∈Ψ DO^(1,1)(∂ M,ℝ^+). Also, defining H̃=H'-H we have, by Lemma <ref>, that H̃=0 at x_3=0 which allows us to write H̃∈ x_3Ψ DO^(0,0)(∂ M,ℝ^+) ⊂Ψ DO^(0,1)(∂ M,ℝ^+). Similarly, writing Ẽ=E'-E, then Ẽ is in the same space.\n\nAiming to prove Theorem <ref> inductively, we calculate the normal derivatives of order a, a≥ 1, of H̃ and Ẽ at x_3=0. In Theorems <ref> and <ref> we express these derivatives in terms of the pseudodifferential operators B, Y and C, J, respectively. In Theorems <ref> and <ref> we use the Maxwell's and divergence equations to write D_x_3^aH̃ and D_x_3^aẼ in terms of the normal derivatives of ε̂, μ̂, ε̂', μ̂' in boundary normal coordinates for ε̂/ε̂' at x_3=0. Then, we use the expressions derived for D_x_3^aH̃ and D_x_3^aẼ at x_3=0 to determine the vectors of principal symbols of the Riccati equations (<ref>) and (<ref>), in the sense of Definition <ref>.\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of electromagnetic parameters and H, H' the associated magnetic fields, respectively and let H̃=H'-H. Assume that B, B' are the factorisation operators corresponding to the magnetic fields H, H' and let H̃ = H'-H, Y=B'-B. Let us fix boundary normal coordinates for ε̂/ε̂'. If Y ∈Ψ DO^(1,κ)(∂ M,ℝ^+) and H̃=0 at x_3=0,\nthen we have H̃∈Ψ DO^(0,κ)(∂ M,ℝ^+)\n\tand for 1≤ a\n\t\n    σ_p (D_x_3^aH̃ )= ∑_j=0^a-1∑_n=0^j(\n    \tj\n    \n    \tn\n    \t)(B^(1))^a-1-jσ_p (D_x_3^j-nY  )(B^(1))^nH^(0)\n\n\tat x_3=0.\n\n\n\nMaking use of Theorem <ref> we have that\n\t\n    D_x^3H̃ = YH+ BH̃+ YH̃\n\nmodulo smoothing. In the case κ = 1, by taking the principal symbol of (<ref>) the proof is complete. So assume that κ>1. Starting from this, we prove inductively that for 1≤ a ≤κ,\n\n    D_x^3^a H̃ = ∑_j=0^a-1 B^a-1-j D_x_3^j(YH) + B^a H̃ +R̃_a H̃ + R_a\n\nwhere R̃_a ∈Ψ DO^(a-1,0)(∂ M,ℝ^+) and R_a ∈Ψ DO^(a,κ+1)(∂ M,ℝ^+). Note that the case a =1 of (<ref>) is already proven from (<ref>) with R̃_1 = 0 and R_1 = YH̃. \n\t\nNow assume, by induction, that (<ref>) is true for some 1≤ a. Using Pascal's triangle we obtain \n\n    D_x_3^j(YH)=∑_n=0^j(\n    j\n    \n    n\n    ) (D_x_3^j-nY) B^nH,\n\nand applying Lemma <ref> to each term separately conclude that D_x_3^j(YH) ∈Ψ DO^j+1,κ(∂ M,ℝ^+). Therefore, applying D_x^3 to (<ref>)\ngives\n\n    D_x^3^a+1H̃ = ∑_j=0^a-1 B^a-1-j D_x_3^j+1(YH) + B^a D_x^3H̃ +R̃_a+1H̃+R_a+1\n\nwhere  R̃_a+1∈Ψ DO^(a,0)(∂ M,ℝ^+) and R_a+1∈Ψ DO^(a+1,κ+1)(∂ M, ℝ^+) contain the derivatives of the corresponding terms from the a step, as well as terms involving derivatives of B. Using (<ref>), rearranging the terms and changing the remainder R_a+1, we see that (<ref>) holds for a+1. This completes the induction and so proves (<ref>).\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUsing (<ref>) and (<ref>) and the fact that H̃ vanishes at the boundary, the principal symbol of D^a_x^3H̃ at x_3=0 is given by (<ref>). This implies that, at x_3 = 0, D^a_x^3H̃∈Ψ DO^(a-κ)(∂ M) and so, since this is true for 1 ≤ a ≤κ, we get H̃∈Ψ DO^(0,κ)(∂ M,ℝ^+).\n\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of electromagnetic parameters and E, E' the associated electric fields, respectively and let Ẽ=E'-E. Assume that C, C' are the factorisation operators corresponding to the magnetic fields E, E' and let J=C'-C. If J ∈Ψ DO^(1,κ)(∂ M) and Ẽ=0 at x_3=0, then have Ẽ∈Ψ DO^(0,κ)(∂ M,ℝ^+) and for 1≤ a\n\t\n    σ_p(D_x_3^aẼ)= ∑_j=0^a-1∑_n=0^j(\n    \tj\n    \n    \tn\n    \t) (C^(1))^a-1-jσ_p(D_x_3^j-nJ)(C^(1))^nE^(0),\n\n\tat x_3=0.\n\n\n\n\tThe proof is done in a similar manner to the proof of Theorem <ref> and therefore is omitted.\n\n\n\n\n\n\n\n\nWe now continue to calculate the difference of the normal derivatives of Maxwell's and divergence equations for the two sets of parameters.\n\n\n\tLet (ε̂,μ̂) and (ε̂',μ̂') be two different sets of electromagnetic parameters and Λ_ε̂, Λ_ε̂', H, H', E, E' the associated impedance maps and electromagnetic fields, respectively and H̃=H'-H, Ẽ=E'-E.\n\tAssume that B,B' are the factorisation operators corresponding to the magnetic fields H, H' and let Y=B'-B. Assume further that C, C' are the factorisation operators corresponding to the electric fields E, E' and J=C'-C. Let us fix boundary normal coordinates for ε̂/ε̂'. If, for some κ≥ 1,\n\t\n\t\t\n  * Λ_ε̂=Λ_ε̂',\n\t\t\n  * ε̂=ε̂'+x_3^κe_ε,   μ̂=μ̂'+x_3^κe_μ, where e_ε, e_μ are symmetric,\n\t\t\n  * √(|ε̂^-1|) = √(|ε̂'^-1|) + x_3^κ r_ε, √(|μ̂^-1|) = √(|μ̂'^-1|) + x_3^κ r_μ,\n\t\t\n\t\t\n  * Y, J ∈ Ψ DO^(1,κ)(∂ M,ℝ^+),\n\t\n\tthen,\n\t\n    σ_p(D_x_3^κH̃_c̃)   =   0,   σ_p(D_x_3^κH̃_3)= (-i)^κκ!  (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j^(0)/μ̂'^33,\n    σ_p(D_x_3^κ+1H̃_c̃)   =   (-i)^κκ! ξ_c̃ (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j^(0)/μ̂'^33,\n    μ̂'^3jσ_p(D_x_3^κ+1H̃_j)   =    (-i)^κκ!   (- μ̂'^ĩ3ξ_ĩ/μ̂'^33 (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )\n          1cm +  e_μ^ĩjξ_ĩ+ 2 e_μ^3l(B^(1))_l^j + r_μμ̂'^3l/√(|μ̂'^-1|)(B^(1))_l^j)H_j^(0),\n\n\tat x_3 = 0 and if κ≥ 2 then\n\t\n    σ_p(D_x_3^aH̃_j)=0,    1 ≤ a ≤κ-1.\n\nat x_3=0.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFirst note that, by Theorem <ref>, H̃∈Ψ DO^(0,κ)(∂ M,ℝ^+). Let us first consider the divergence equations for the magnetic fields H and H', which are\n\t\n    -i δ_μ̂( H)=0,    -iδ_μ̂'(H')=0.\n\n\tSubtracting these equations and writing the result in  boundary normal coordinates for ε̂/ε̂', we obtain\n\t\n    μ̂'^3jD_x_3H̃_j   =- μ̂'^ĩjD_x_ĩH̃_j+ x_3^κe_μ^ĩjD_x_ĩH_j+ x_3^κe_μ^3jD_x_3H_j\n       1cm -i κ x_3^κ-1 (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j + R\n\nwhere R ∈Ψ DO^(0,κ)(∂ M, ℝ^+) and the other terms on the right are in Ψ DO^(1,κ)(∂ M, ℝ^+).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tApplying D_x_3^a for a ≥ 0 to (<ref>), we arrive at\n\t\n    μ̂'^3jD_x_3^a+1H̃_j   = D_x_3^a (- μ̂'^ĩjD_x_ĩH̃_j+ x_3^κe_μ^ĩjD_x_ĩH_j+ x_3^κe_μ^3jD_x_3H_j\n       -i κ x_3^κ-1 (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j ),\n\n\tmodulo Ψ DO^(a,κ)(∂ M). Each of the terms in the right hand-side of (<ref>) expands as\n\t\n    D_x_3^a(- μ'^ĩjD_x_ĩH̃_j)   = - μ̂'^ĩjD_x_ĩD_x_3^aH̃_j,\n    \n    \tD_x_3^a( x_3^κe_μ^ĩjD_x_ĩH_j)   = ∑_n=0^a(\n    \ta\n    \n    \tn\n    \t)(D_x_3^nx_3^κ)e_μ^ĩjD_x_ĩ D_x_3^a-nH_j,\n    \n    \tD_x_3^a(x_3^κe_μ^3jD_x_3H_j)   = ∑_n=0^a(\n    \ta\n    \n    \tn\n    \t) (D_x_3^nx_3^κ)e_μ^3jD_x_3^a+1-nH_j,\n    \n    \tD_x_3^a (-i κ x_3^κ-1 (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j )   =\n       -2.3cm -iκ∑_n=0^a(\n    \ta\n    \n    \tn\n    \t)  (D_x_3^nx_3^κ-1) (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )D_x_3^a-nH_j,\n\n\tmodulo Ψ DO^(a,κ)(∂ M).\n\tLet us consider the case of κ=1. The principal symbols of equation (<ref>) for a=0 and a=1 at x_3=0 give respectively\n\t\n    μ̂'^3lσ_p(D_x_3H̃_j)H_j^(0)   =-i  (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j^(0),\n    μ̂'^3jσ_p(D_x_3^2H̃_j)   = - μ̂'^ĩkξ_ĩσ_p(D_x_3H̃_j)\n       0.2cm+ (-i)  (  e_μ^ĩkξ_ĩ +2 e_μ^3j(B^(1))_j^k +  r_μμ̂'^3j/√(|μ̂'^-1|)(B^(1))_j^k) H_k^(0).\n\nAssuming that κ≥ 2 and considering the principal symbols of equation (<ref>) for 1 ≤ a ≤κ at x_3=0 we obtain\n\t\n    μ̂'^3j(D_x_3^lH̃_j)   =-μ̂'^ĩjξ_ĩσ_p(D_x_3^l-1H̃_j),     1 ≤ l ≤κ-1, \n    μ̂'^3jσ_p(D_x_3^κH̃_j)   =- μ̂'^ĩjξ_ĩσ_p(D_x_3^κ-1H̃_j)+ (-i)^κκ!  (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )H_j^(0),\n    μ̂'^3jσ_p(D_x_3^κ+1H̃_j)   =- μ̂'^ĩjξ_ĩσ_p(D_x_3^κH̃_j)\n       0.2cm+ (-i)^κκ!  ( e_μ^ĩkξ_ĩ+ 2 e_μ^3l(B^(1))_l^k +  r_μμ̂'^3j/√(|μ̂'^-1|)(B^(1))_j^k )H_k^(0),\n\n\twhere we have made use of equations (<ref>) for 1 ≤ a ≤κ at x_3=0.\n\t\n\tIn order to derive the equations regarding the tangential components of H̃ we start with Maxwell's equation\n\t\n    ∗_ε̂dH= -i ω E,\n\n\twhich is written in boundary normal coordinates for ε̂/ε̂' as\n\t\n    σ^lbcD_x_bH_c= ωε̂^lk/√(|ε̂|)E_k.\n\n\tEvaluating the above at either l=1 or l=2 and taking into account that we work in boundary normal coordinates for ε̂ implies\n\n\n\n\n\t\n    D_x_3H_c̃= D_x_c̃H_3+ ωσ_ã3c̃ε̂^lk/√(|ε̂|)E_k̃.\n\n\tSubtracting the corresponding equation for the '- parameters,\n\n\n\n\n\nwe arrive at\n\t\n    D_x_3H̃_c̃=D_x_c̃H̃_3 + ωσ_ã3c̃ (ε̂'^lk/√(|ε̂'|)E'_k̃-ε̂^lk/√(|ε̂|)E_k̃ ).\n\n\tUsing Theorem <ref> and the hypotheses, we obtain\n\n\n\n\n\n\nmodulo Ψ DO^(0,κ)(∂ M)\n\t\n    D_x_3H̃_c̃   =D_x_c̃H̃_3.\n\n\tApplying D_x_3 a more times leads to\n\t\n    D_x_3^a+1H̃_c̃=D_x_c̃D_x_3^aH̃_3,    Ψ DO^(a,κ)(∂ M)\n\n\tfor 0≤ a ≤κ. The principal symbol of the above equation at x_3=0 gives\n\t\n    σ_p(D_x_3^a+1H̃_c̃)=ξ_c̃σ_p(D_x_3^aH̃_3),    0<a≤κ.\n\n\tCombining equations (<ref>) and (<ref>) with (<ref>) completes the proof.\n\n\n\n\n\n\n\n\n\n\n\n\nAssume the same hypotheses as for Theorem <ref> and in addition\n\n\n  * ε̂=ε̂'+x_3^κ+1e_ε,\n\n  * √(|ε̂^-1|) = √(|ε̂'^-1|) + x_3^κ+1 r_ε.\n\nThen\n\n    σ_p(D_x^3^κ+1Ẽ_c̃)    =    0,   σ_p(D_x_3^κ+1Ẽ_3)= (-i)^κ+1 (κ+1)! r_ε/√(|ε̂'^-1|)E_3^(0),\n    σ_p(D_x_3^κ+2Ẽ_c̃)   =    (-i)^κ+1 (κ+1)! ξ_c̃r_ε/√(|ε̂'^-1|)E_3^(0),\n    σ_p(D_x_3^κ+2Ẽ_3)   =    (-i)^κ+1 (κ+1)!   (  e_ε^ĩjξ_ĩ+ r_ε/√(|ε̂'^-1|)(C^(1))_3^j)E_j^(0),    \n    σ_p(D_x_3^aẼ_j)   =   0,    1 ≤ a ≤κ\n\nat x_3 = 0.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWorking as in the proof of Theorem <ref> leads to the desired result. Note that the calculations and results are simpler in this case because of the choice of boundary normal coordinates.\n\n\n\n\n §.§ Proof of Theorem <ref>\n\nTo prove Theorem <ref>, it suffices to prove Theorems <ref>, <ref> and <ref> below. More specifically, in each inductive step we start with Theorem <ref> to prove given that the normal derivatives of order κ-1 ≥ 0 of ε̂ and ε̂' agree at x_3=0 the same follows for their normal derivatives of order κ at x_3=0. Then, we proceed to Theorem <ref> to prove the corresponding result for the metrics μ̂ and μ̂'. Last, we have to show that as the normal derivatives of the metrics induced by the electromagnetic parameters agree to a higher order at x_3=0 the order of the pseudodifferential operators Y and J decreases at x_3=0. This is shown in Theorem <ref>.\n\nIn what follows, we will work with specific values of the principal symbols of H and E by choosing H^(0)=χ_ε̂ and E^(0)=χ_μ̂. Recall Section <ref> for the definitions of these covectors. These covectors are not defined when ξ_ε̂3 = ξ_μ̂3, but in these cases the conclusions still follow by density since, as observed in Remark <ref>, the symbols are continuous with respect to the parameters.\n\n\tLet (ε̂,μ̂) and (ε̂',μ̂') be two different sets of electromagnetic parameters and Λ_ε̂, Λ_ε̂' the associated impedance maps. Assume that B, B' are the factorisation operators corresponding to the magnetic fields H, H' and let Y=B'-B. Let us fix boundary normal coordinates for ε̂/ε̂'. If\n\t\n    Λ_ε̂=Λ_ε̂',\n\n\t\n    ∂_x_3^aε̂=∂_x_3^aε̂',   ∂_x_3^aμ̂=∂_x_3^aμ̂',    x_3=0,\n\n\tfor a=0,…, κ-1\n\tand \n\t\n    Y ∈Ψ DO^(1,κ)(∂ M,ℝ^+),\n\n\tthen\n\t\n    ∂_x_3^κε̂=∂_x_3^κε̂',\n\t\n\tat x_3=0.\n\n\n\tSince Y∈Ψ DO^(1,κ)(∂ M,ℝ^+), both sides of Riccati equation (<ref>) are in Ψ DO^(2,κ)(∂ M,ℝ^+) and the vector of principal symbols, in the sense of Definition <ref>, is given by\n\t\n    A_H' Y^(1)+ T_H'B^(1)Y^(1)+T_H'Y^(1)B^(1)=\n       0.5cm 1/κ!(∂_x_3^κ(A_H-A_H')B^(1)+ ∂_x_3^κ(T_H-T_H')(B^(1))^2 + ∂_x_3^κ(Q_H-Q_H')),\n       -κ i T_H'Y^(1)+\tA_H'Y^(0)+ T_H'B^(1)Y^(0) + T_H'Y^(0)B^(1)=\n       3cm 1/(κ-1)!(∂_x^3^κ-1(G_H-G_H')B^(1) + ∂_x^3^κ-1(F_H-F_H')),\n       -(κ-1)i\tT_H'Y^(0)+\tA_H'Y^(-1)+T_H'B^(1)Y^(-1)+ T_H'Y^(-1)B^(1)=\n       7.5cm ∂_x_3^κ-2/(κ-2)!(R_H-R_H'),\n       -(κ-2) i T_H'Y^(-1)+A_H' Y^(-2)+ T_H'B^(1)Y^(-2)+T_H'Y^(-2) B^(1)=0,\n       5cm⋮\n        -i T_H'Y^-(κ-2)+ A_H'Y^-(κ-1)+ T_H'B^(1)Y^-(κ-1)+ T_H'Y^-(κ-1)B^(1)=0.\n\nThe different sets of electromagnetic parameters are assumed to agree to order κ-1 at x_3=0, which implies that\n\n    ε̂^-1= ε̂'^-1+ x_3^κẽ_ε,   μ̂= \tμ̂'+ x_3^κe_μ.\n\nTo prove the theorem, we aim to prove that ẽ_ε=0 at x_3=0 beginning by\n\napplying the second equation of (<ref>) to H^(0) = χ_ϵ̂. If κ=1, Lemma <ref> is directly satisfied which implies the desired result. If κ≥ 2, in order for the assumption of Lemma <ref> for Y to be satisfied we additionally use (<ref>) and (<ref>) which when combined give\n\n\n\n\n\n    Y^(l)χ_ε=0,    1-κ≤ l ≤ -1.\n\nat x_3=0.\nTherefore the assumptions of Lemma <ref> are satisfied for any κ≥ 1 and the proof is completed.\n\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of electromagnetic parameters and Λ_ε̂, Λ_ε̂' the associated impedance maps. Assume that C, C' are the  factorisation operators corresponding to the electric fields E, E' and let J=C'-C.  Let us fix boundary normal coordinates for ε̂/ε̂'. If\n\t\n    Λ_ε̂=Λ_ε̂',\n\n\t\n    ∂_x_3^aε̂ = ∂_x_3^aε̂',   ∂_x_3^bμ̂=∂_x_3^bμ̂',    x_3=0,\n\n\tfor a=0,1,2,…,κ, b=0,1,…,κ-1\n\tand\n\t\n    J ∈Ψ DO^(1,κ)(∂ M),\n\n\tthen\n\t\n    ∂_x_3^κμ̂=∂_x_3^κμ̂',    x_3=0.\n\n\n\nGiven that J ∈ Ψ DO^(1,κ)(∂ M) the principal symbol of the Riccati equation (<ref>) at x_3=0 is given by\n\n    A_E J^(1)+ T_EC^(1)J^(1)+T_EJ^(1)C^(1)=\n       1cm 1/κ!(∂_x_3^κ(A_E-A_E')C^(1)+ ∂_x_3^κ(T_E-T_E')(C^(1))^2 + ∂_x_3^κ(Q_E-Q_E')),\n       -κ i T_EJ^(1)+\tA_EJ^(0)+ T_EC^(1)J^(0) + T_EJ^(0)C^(1)=\n       3.3cm 1/(κ-1)!(∂_x^3^κ-1(G_E-G_E')C^(1) + ∂_x^3^κ-1(F_E-F_E')),\n       -(κ-1)i\tT_EJ^(0)+\tA_EJ^(-1)+T_EC^(1)J^(-1)+ T_EJ^(-1)C^(1)\n       4cm =1/(κ-2)!∂_x_3^κ-2(R_E-R_E'),\n       -(κ-2) i T_EJ^(-1)+A_E J^(-2)+ T_EC^(1)J^(-2)+T_EJ^(-2) C^(1)=0,\n       5cm⋮\n        -i T_EJ^-(κ-2)+ A_EJ^-(κ-1)+ T_EC^(1)J^-(κ-1)+ T_EJ^-(κ-1)C^(1)=0.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccording to the assumptions of the theorem, the different sets of metrics satisfy\n\n    ε̂=ε̂'+ x_3^κ+1e_ε,    (μ̂^-1)=(μ̂'^-1)+ x_3^κẽ_μ,\n\nfor e_ε, ẽ_μ symmetric.\nLet us fix E^(0)=χ_μ̂.\nIn order for Lemma <ref> to be applicable, we will show that for any κ≥ 1 we have\n\n    J^(l)χ_μ̂=0,    1-κ≤ l ≤ 1,\n\nat x_3=0.\nEquations (<ref>) and (<ref>) show that for any κ≥ 1\n\n    J^(l)χ_μ̂=0,   1-κ≤ l ≤ 0    x_3=0.\n\nTo show that J^(1) also vanishes, we consider the second equation in (<ref>), (<ref>), (<ref>), (<ref>), (<ref>) and (<ref>). Using all of these formulas and taking the μ̂' inner product with ν, we obtain that r_ϵ appearing in (<ref>) must be zero. This implies, again by (<ref>) and (<ref>), that J^(1)χ_μ̂ = 0. Hence, we obtain that equation (<ref>) holds for any κ≥ 1 which allows us to apply Lemma <ref> and the proof is completed.\n\n\nThe following two lemmas are used in the proofs of Theorems <ref> and <ref> and include many of the technical calculations.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of electromagnetic parameters. Let us fix boundary normal coordinates for ε̂/ ε̂'. If\n\t\n    ε̂^-1= ε̂'^-1+ x_3^κẽ_ε,   μ̂= \tμ̂'+ x_3^κe_μ\n\n\tand Y ∈ Ψ DO^(1,κ)(∂ M) such that for any κ≥2\n\t\n    Y^(a)χ_ε̂=0,    1-κ≤ a ≤ -1,\n\n\tthen for any κ≥ 1, equation\n\t\n    (T_H'(\t-κ i Y^(1)+ B^(1)Y^(0) + Y^(0)B^(1))+A_H'Y^(0))χ_ε̂=\n       2cm 1/(κ-1)!(∂_x^3^κ-1(G_H-G_H')B^(1)+ ∂_x^3^κ-1(F_H-F_H'))χ_ε̂\n\n\timplies that\n\t\n    ∂_x_3^κε̂=∂_x_3^κε̂',\n\t\n\n\nWe first show that for any κ≥ 1,\n\n    (Y^(0))_l̃^kχ_ε̂_k=0,     (Y^(0))_3^kχ_ε̂_k=-i κ (\n    ⟨ν, χ_ε̂⟩_e_μ/μ̂'^33+r_μ⟨ν, χ_ε̂⟩_μ̂'/√(|μ̂'^-1|)μ̂'^33 ),\n\nat x_3=0. Evaluating equation (<ref>) for a=κ at H^(0)=χ_ε results to\n \n    σ_p(D_x_3^κH̃)|_H^(0)=χ_ε̂= ∑_j=0^κ-1∑_n=0^j(\n     j\n    \n     n\n     ) (B^(1))^κ-1-jσ_p(D_x_3^j-nY)(B^(1))^nχ_ε̂.\n\n The assumption of the lemma on Y implies that \n \n    σ_p(D_x_3^κH̃)|_H^(0)=χ_ε̂= σ_p(D_x_3^κ-1Y)χ_ε̂=(-i)^κ-1(κ-1)!Y^(0)χ_ε̂,\n\n at x_3=0.\nEquation (<ref>) then implies (<ref>).\n\nNow let us write (<ref>) for a=κ+1 evaluated at H^(0)=χ_ε̂, which gives\n\t\n    σ_p(D_x_3^κ+1H̃)|_H^(0)=χ_ε̂= ∑_j=0^κ∑_n=0^j(\n     j\n    \n     n\n     ) (B^(1))^κ-jσ_p(D_x_3^j-nY)(B^(1))^nχ_ε̂.\n\nThe assumption of the theorem on Y implies that the only nonzero terms in the above arise for j = κ, n=0, 1 and j=κ-1, n=0. Thus, we have\n\t\n    σ_p(D_x_3^κ+1H̃)|_H^(0)=χ_ε̂= (-i)^κκ!Y^(1)χ_ε̂+(-i)^κ-1(κ-1)!  (B^(1)Y^(0)+Y^(0) B^(1) )χ_ε̂.\n\n\tHence, we observe that the left hand-side of (<ref>) is equal to\n\t\n    T_H'σ_p(D_x_3^κ+1H̃)|_H^(0)=χ_ε̂/(-i)^κ-1(κ-1)!+ A_H'Y^(0)χ_ε̂.\n\n\tUsing equations (<ref>), (<ref>), (<ref>), (<ref>) and (<ref>), the left hand side of (<ref>), as shown in (<ref>), is equal to\n\t\t\n    - i κ√(|μ̂^-1|)/√(|ε̂^-1|) ( (ε̂'^-1)_lqμ̂^q3⟨ξ_ϵ̂, χ_ε⟩_e_μ+ (ε̂'^-1)_lqμ̂^qaξ_ϵ̂a (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )χ_ϵ̂j ).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUsing formulas (<ref>), (<ref>) and (<ref>), the right hand side of (<ref>) is written in coordinates as\n\t\n    - i κ√(|μ̂^-1|)/√(|ε̂^-1|) ( (ε̂'^-1)_lqμ̂^q3⟨ξ_ϵ̂, χ_ε⟩_e_μ+ (ε̂'^-1)_lqμ̂^qaξ_ϵ̂a (e_μ^3j + r_μμ̂'^3j/√(|μ̂'^-1|) )χ_ϵ̂j )\n        3cm+i κ(ε̂'^-1)_lq/|ε̂'^-1|σ^3 j̃q̃ (ẽ_ε)_b̃j̃σ^d k b̃ξ_ε̂dχ_ε̂k.\n\n\tEquating (<ref>) with (<ref>) we arrive at\n\t\n    i κ(ε̂'^-1)_lq/|ε̂'^-1|σ^3 j̃q̃ (ẽ_ε)_b̃j̃σ^d k b̃ξ_ε̂dχ_ε̂k=0,\n\nwhich, substituting a coordinate expression for χ_ε̂ and cancelling some terms, is simplified to\n\n    (ε^-1)_l̃l̃'̃σ^3β̃l̃'̃(ẽ_ε)_b̃β̃ε^b̃b̃'̃ξ_b̃'̃=0.\n\nThis holds for all ξ̃ and l and so is satisfied if and only if ẽ_ε = 0. Therefore ε̂^-1 and ε̂'^-1 agree up to the κ derivative, and so the same is true for ε̂ and ε̂'. This completes the proof.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tLet (ε̂,μ̂), (ε̂',μ̂') be two different sets of electromagnetic parameters. Let us fix boundary normal coordinates for ε̂/ε̂'. If\n\t\n    ε̂=ε̂'+ x_3^κ+1e_ε,    (μ̂^-1)=(μ̂'^-1)+ x_3^κẽ_μ\n\n\tand for any κ≥ 1 the following equations hold at x_3=0\n\t\n    (∂_x^3^κ-1(G_E-G_E')C^(1) + ∂_x^3^κ-1(F_E-F_E'))χ_μ̂=0,\n\n\t\n    (∂_x_3^κ(A_E-A_E')C^(1)+ ∂_x_3^κ(Q_E-Q_E')+ ∂_x_3^κ(T_E-T_E')(C^(1))^2)χ_μ̂=0,\n\n\tthen,\n\t\n    ∂_x_3^κμ̂=∂_x_3^κμ̂',    x_3=0.\n\n\n\n\tMaking use of the symbols G_E, F_E, which are given by equations (<ref>) and (<ref>) with ε̂ and μ̂ switched, and the assumptions of the lemma on the different sets of metrics, equation (<ref>) implies\n\t\n    (μ̂^-1)_lq̃σ^3j̃q̃(ẽ_μ)_j̃bσ^dkbξ_μ̂_dχ_μ̂_k=0.\n\n\tSubstituting the expression of χ_μ̂. the above reduces to\n\t\n    (μ̂^-1)_lq̃σ^3j̃q̃(ẽ_μ)_j̃bμ̂^bb'ξ_μ̂_b'=0,    x_3=0.\n\n\tTherefore, we obtain \n\t\n    (ẽ_μ)_j̃b=0,    x_3=0\n\n\twhich implies in particular that  (ẽ_μ)_33 is the only remaining nonzero component at x_3 = 0. Considering (<ref>) while using the the symbols A_E, Q_E and T_E, determined respectively from (<ref>), (<ref>) and (<ref>), the hypothesis on the metrics as well as (<ref>), we can calculate\n\t\n    ∗_μ̂ (ν∧∗_μ̂ ( χ_μ̂∧ξ_μ̂) ) ⟨ν, ξ_μ̂⟩_μ̂ (ẽ_μ)_33 = 0.\n\n\tExplicit calculation in coordinates using the definitions of χ_μ̂ and ξ_μ̂ shows that the coefficient in the previous formula is not zero, and so we deduce \n\t\n    (ẽ_μ)_33=0,    x_3=0.\n\n\tTherefore, we have shown that \n\t\n    ∂_x_3^κμ̂^-1=∂_x_3^κμ̂'^-1,    x_3=0,\n\n\twhich completes the proof.\n\n\n\n\tLet (ε̂,μ̂) and (ε̂',μ̂') be two different sets of electromagnetic parameters and Λ_ε̂, Λ_ε̂' the associated impedance maps. Assume that B, B' are the factorisation operators corresponding to the magnetic fields H, H' and let Y=B'-B. Assume further that C, C' are the factorisation operators corresponding to the electric fields E, E' and let J=C'-C. Let us fix boundary normal coordinates for ε̂/ε̂'. If\n\t\n    Λ_ε̂=Λ_ε̂',\n\n\t\n    ∂_x^3^aε̂= ∂_x^3^aε̂',   ∂_x^3^aμ̂=∂_x^3^aμ̂',    x_3=0,\n\n\tfor a=0, …κ\n\tand\n\t\n    Y, J ∈Ψ DO^(1,κ)(∂ M,ℝ^+),\n\n\tthen \n\t\n    Y, J∈Ψ DO^(1,κ+1)(∂ M,ℝ^+).\n\n\n\nThe case κ = 0 follows from the formula (<ref>) and (<ref>) for B, B', C and C' since the principal symbols depend only on the values of the respective parameters at the boundary. For κ≥ 1, it suffices to show that the equations\n\t\t\n    (\tA_H+ T_HB^(1))Z + T_HZB^(1)= 0,\n\n\t\n    (\tA_E+ T_EC^(1))W + T_EWC^(1)= 0,\n\n\tadmit the unique solutions Z=0 and W=0, respectively. This follows from the fact that after proving Theorems <ref> and <ref> the right hand-sides of the equations in (<ref>) and (<ref>) vanish. We will prove the result for (<ref>) and the corresponding result for (<ref>) follows in a similar way.\n\tEquation (<ref>) multiplied by T_H^-1 becomes\n\t\n    ( T_H^-1A_H+ B^(1))Z + ZB^(1)= 0\n\n\tThis is a homogeneous Sylvester equation with unknown Z. According to <cit.>, if T_H^-1A_H+B^(1) and -B^(1) do not share any eigenvalues equation (<ref>) admits the unique solution\n\t\n    Z=0.\n\nWe showed that B^(1) satisfies\n\t\n    T_H(B^(1))^2+ A_HB^(1)+ Q_H=0.\n\n\tHence we can write T_H^-1A_H+B^(1) as\n\t\n    T_H^-1A_H+B^(1)= -T_H^-1 Q_H(B^(1))^-1.\n\n\tSo we have to investigate if T_H^-1Q_H(B^(1))^-1 and B^(1) share any eigenvalues. Revisiting the factorisation of M_H(ξ_3) in terms of B^(1) as given in equation (<ref>) we have\n\t\n    T_Hξ_3^2+ A_Hξ_3+ Q_H= (𝕀ξ_3-(B^∗)^(1))T_H(𝕀ξ_3 -B^(1)).\n\n\tEquating the terms that are of order zero with respect to ξ_3, we have that Q_H is expressed as\n\t\n    Q_H= (B^∗)^(1)T_H B^(1).\n\n\tHence, T_H^-1Q_H(B^(1))^-1 is written as\n\t\n    T_H^-1Q_H(B^(1))^-1= T_H^-1(B^∗)^(1)T_H.\n\n\tSince the eigenvalues ξ_μ̂3 and ξ_ϵ̂3 of B^(1) have nonzero complex component, the eigenvalues ξ_μ̂3 and ξ_ϵ̂3 of T_H^-1(B^∗)^(1)T_H are different, which completes the proof.\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nWe would like to thank Bill Lionheart for suggesting the problem and providing many useful discussions.\n\n\n\n\n"}