{"entry_id": "http://arxiv.org/abs/2303.07325v1", "published": "20230313174438", "title": "On the temperature and chemical dependency of prismatic stacking faults in C14 Laves phases", "authors": ["Zhuocheng Xie", "Dimitri Chauraud", "Erik Bitzek", "Sandra Korte-Kerzel", "Julien Guénolé"], "primary_category": "cond-mat.mtrl-sci", "categories": ["cond-mat.mtrl-sci"], "text": "\n\nAPS/123-QED\n\n\n \n\n\n[]xie@imm.rwth-aachen.de\nInstitute of Physical Metallurgy and Materials Physics, RWTH Aachen University, 52056 Aachen, Germany\n\n\nMax-Planck-Institut für Eisenforschung GmbH, Max-Planck-Str. 1, 40237 Düsseldorf, Germany\n     \n\nMax-Planck-Institut für Eisenforschung GmbH, Max-Planck-Str. 1, 40237 Düsseldorf, Germany\n\n\nInstitute of Physical Metallurgy and Materials Physics, RWTH Aachen University, 52056 Aachen, Germany\n\n\n[]julien.guenole@univ-lorraine.fr\nUniversité de Lorraine, CNRS, Arts et Métiers ParisTech, LEM3, 57070 Metz, France\nLabex Damas, Université de Lorraine, 57070 Metz, France\n\n\nActivation of non-basal slip is essential in improving the deformability of hexagonal crystals. However, the mechanism of non-basal slip remains largely unknown, especially for complex intermetallics such as Laves phases. In this work, the prismatic slip systems of C14 Laves crystals and possible metastable states along the slip paths are assessed using atomistic simulations. \nMultiple prismatic stacking fault states with the same lattice pattern but different site occupancies and chemical distributions are identified at different inter-atomic layers, temperatures and chemical compositions. The formation of energetically favorable prismatic stacking faults involves short-range diffusion which implies the thermally activated nature of prismatic slip. \nThe outcomes of this work advance the understanding of temperature and chemical-dependent non-basal slip in Laves phases and can be extended to other topologically close-packed phases.\n\nKeywords: Laves phase, prismatic slip, stacking fault, atomistic simulation\n\n\nOn the temperature and chemical dependency of prismatic stacking faults in C14 Laves phases\n    Julien Guénolé\n    March 30, 2023 at \n===========================================================================================\n\n\n\nLaves phases are intermetallics that are present in various alloys and exert a significant influence on their mechanical characteristics due to their high strength and superior creep resistance in comparison to the matrix phases <cit.>. Despite their excellent mechanical performance at elevated temperatures, Laves phase alloys are commonly deemed unsuitable for structural applications because of their well-known brittleness at room temperature <cit.>.\nThe crystal structure of Laves phases with an ideal chemical composition AB2 consists of a triple-layer and a kagomé layer along the basal ({ 1 1 1 }) planes. Synchro-shear <cit.>, as the most energetically favorable mechanism of plasticity on basal or { 1 1 1 } planes in Laves phases, is widely studied, particularly using atomic-scale modeling <cit.>. However, the mechanisms underlying plastic deformation on non-basal (non-{ 1 1 1 }) planes in Laves phases are not well understood so far.\n\nIn the early 1970s, Paufler et al. <cit.> reported the activation of grown-in prismatic dislocations in the prototype C14 MgZn2 under uniaxial compression at temperatures around 400°C.\nRecently, Zehnder et al. <cit.> investigated the plastic deformation of single crystal C14 CaMg2 at room temperature by nanoindentation and microcompression. The prismatic slip was confirmed by slip trace analysis and exhibits the lowest critical resolved shear stress (CRSS) among basal and non-basal slip systems. The authors <cit.> further investigated the activation of these slip systems of the CaMg2 phase in the temperature range from 50 to 250°C, where prismatic slip shows a decreasing CRSS with temperature.\nZhang et al. <cit.> characterized two prismatic stacking fault (SF) structures with the same crystal lattice but different site occupancies in a C14 Nb-based Laves phase using atomic-resolution scanning transmission electron microscopy (STEM) after deformation at different temperature regimes.\nThe formation of high and room-temperature prismatic SFs was interpreted based on the morphology of prismatic planes and topologically close-packed rules. The high-temperature SF formation was attributed to the diffusion-assisted shuffle mechanism, while the low-temperature SF formation was associated with the glide mechanism.\nIn addition, the prismatic SFs were not flat and exhibited numerous steps, which was attributed to dislocation motion through frequent switching between different prismatic slip planes.\n\nSo far, the deformation mechanisms of prismatic plasticity in C14 Laves phases, particularly the processes that lead to the formation of prismatic SFs through partial dislocations, are still not well understood. In this study, we investigated the temperature and chemical-dependent prismatic slip in C14 CaMg2 and MgZn2 Laves phases by performing atomistic simulations using the semi-empirical potentials <cit.>. The minimum energy paths (MEPs) of slip events on different prismatic interlayers and corresponding prismatic SF states were identified using the nudged elastic band (NEB) method <cit.>. The effects of temperature and chemical composition on SF structures were studied using molecular dynamics (MD) and hybrid MD/Monte Carlo (MC) simulations, respectively. The FIRE <cit.> and Quickmin <cit.> algorithms were used for relaxation in molecular statics (MS) simulations and NEB calculations, respectively. For more details on the simulation setup and methods, see Section I in the Supplementary Material.\n\n\n\nThe prismatic slip systems were systematically assessed by calculating the generalized stacking fault energy (γ) surfaces of three possible interlayers on prismatic {1̅ 1 0 0} plane in C14 CaMg2 (see Figure <ref>(a,c,e)) and MgZn2 (see Figure <ref>(a,c,e)). Meta-stable states close to the [1 1 2̅ 0] slip path were identified as the prismatic SF states in all interlayers. After full relaxation, the SF of interlayer III (SF III) shows the lowest stacking fault energy (SFE: 422 mJ/m2 in C14 CaMg2 and 265 mJ/m2 in C14 MgZn2), presumably is more stable than the SF states of interlayer I and II (SF I and SF II). The energy barriers of full and partial slip paths were calculated using the NEB method. Although the interplanar distance of interlayer III is almost two times larger than interlayer I and II, the energy barriers of slip events on the three interlayers are at similar levels. For the full sip, the activation energies on interlayer III are 11 % and 3 % higher than on interlayer I and II in C14 CaMg2 and for MgZn2, respectively. In C14 CaMg2, the activation energy of partial slip on interlayer III is 7 % higher than interlayer I and II. For the partial slip in MgZn2, the activation energy on interlayer III becomes 12 % lower than interlayer I and II counterparts. The energy barrier for partial slip within the same interlayer is slightly lower compared to that of full slip.\n\n\n\nThe identification of prismatic SF states is in agreement with the experimental observation in C14 Nb-base Laves phase after low and high-temperature deformation by Zhang et al. <cit.>. Abundant extended prismatic SFs bounded by partial dislocations with compact cores and Burgers vectors of 3/16[0 0 0 1 ] + 1/6[1 1 2̅ 0 ] were observed in atomic-resolution STEM <cit.>. Our study determined the Burgers vectors of prismatic partial slip close to 3/16[0 0 0 1] + 1/6[1 1 2̅ 0], which correlates well with the above-mentioned experimental results. Furthermore, Zhang et al. <cit.> reported that the prismatic SF is not flat and exhibits numerous steps, which they attributed to the movement of dislocations by frequently switching on different prismatic slip planes. This can be explained by nearly equal energy barriers of prismatic slip on interlayer I, II, and III, see Table <ref>. Further research is needed to gain a more comprehensive understanding of the out-of-plane mechanisms of prismatic dislocations switching between various interlayers and the associated activation energies. \n\n\n\nThree prismatic SF states with different microstructures and energies were found in this work (see Figure <ref>(a-c)). The structures of SF I and II are mirror symmetric and therefore exhibit the same SFE. The lattice pattern consists of a Laves building block (marked in blue dashed rhombic tile) with the characteristic triple-layer and a Zr4Al3 building block (marked in blue dashed rectangular tile) exists also in μ-phase was found in SF I and II. An empty site in the Zr4Al3 building block was observed, see Figure <ref>(a,b). The same lattice pattern exists in SF III, however, the site occupancies and chemical distributions are different (see Figure <ref>(c)). An empty site exists in the middle atomic column of the Laves building block in SF III. Interestingly, these two SF structures are not thermally stable at room or elevated temperature. After equilibrium at 300 K, a structural transition induced by short-range diffusion was observed in SF I and II. The empty site is partially occupied by small (Mg) atoms hopping from a nearby site at the junction of four lattice tiles, and the large (Ca) atoms in the middle atomic column of the Laves building block shift towards the site where the small atoms are left behind, see Figure <ref>(d-e). The structure of SF I (II) at 300 K is very similar to the experimentally observed prismatic SF structures after room temperature deformation, see Figure <ref>(g,h). In addition to the identical lattice pattern, the atomic distributions in SFs are similar in our atomic configurations and high-resolution STEM images. \nThe positions of three bright atomic columns (highlighted using white dashed circles) corresponding to the heavy elements (Nb in Nb-base Laves phase and Ca in C14 CaMg2) correlate well with the simulation results. In addition, the shift of the middle atomic column out of the Laves triple-layer was also reported in the experiment as illustrated using the grey dashed line in Figure <ref>(g,h).\n\n\n\n\nAccording to the atomic displacement introduced by thermalization at room temperature, the structure of glide-induced SF I (II) was optimized by shifting one out of two atoms in the Mg atomic column to the empty site (see the displacement vectors as shown in the inset of Figure <ref>(a)). After energy minimization, the Ca atoms located in the atomic column in the Laves triple-layer shift towards the empty site left behind by the Mg atoms. The SFE of SF I decreases by 28% to 374 mJ/m2 in CaMg2, and by 58% to 191 mJ/m2 in MgZn2 after the structural opimization. The NEB calculation was performed to find the MEP between the initial and optimized SF states (see Figure <ref>(a)). For the glide-induced SF I (II), a small energy barrier of 15 mJ/m2 needs to be overcome with thermal assistance to reach the diffusion-assisted SF state with lower energy. In addition to a lower SFE, the formation of diffusion-assisted SF I (II) states (Figure <ref>(b)) is mediated by a different slip mechanism (Figure <ref>(c-j)) with a lower activation energy. Simple crystallographic slip mediates the partial slip between the pristine and glide-induced SF I (II) states, with all atoms moving in the same direction as the partial Burgers vector (as illustrated in Figure <ref>(c-f)). For the partial slip between the pristine and diffusion-assisted SF I (II) states, a synchroshear-like mechanism, where certain Mg atoms move in a direction that differs from the direction of the partial Burgers vector, was identified. \n\nSF III shows better thermal stability than SF I and II, it remains the same atomic structure at 300 K, and a structural transition was observed after equilibrium at 500 K, see Figure <ref>(c,f). The empty site in the Laves building block is partially occupied by small (Mg) atoms hopping from a nearby site at the junction of lattice tiles. Compared to the SF observed in experiments following high-temperature deformation, diffusion-assisted SF III at 500 K exhibits a similar chemical distribution in the Laves building block but a distinct chemical distribution in the Zr4Al3 building block. In the experimental observation, the heavy (large) atoms are positioned at the up and down sites within the Zr4Al3 building block (Figure <ref>(i)), whereas in the simulation, they are situated at the left and right sites (Figure <ref>(f)). The SF structure is optimized by swapping the elemental type in the Zr4Al3 building block to be identical as reported in the experiment (see Figure <ref>(c,d)). The SFE of the optimized SF III decreases to 326 (by 23 %) and 189 (by 29 %) mJ/m2 in CaMg2 and MgZn2, respectively.\nThe formation of the optimized SF III state necessitates a more substantial thermal fluctuation than the optimized SF I (II) state due to its involvement in not only atomic diffusion but also atomic swapping, which rationalizes the experimental observation of optimized SF III mainly after high-temperature deformation <cit.>.\n\nThe formation of more energetically favorable prismatic SFs with the assistance of diffusion implies the strong thermally activated nature of prismatic partial dislocations. Thermal assistance was demonstrated to be indispensable in activating synchro-Shockley dislocations, implying that the motion of this zonal dislocation is prohibited at low temperatures <cit.>. A temperature-dependent deformation behavior is also expected for prismatic partial dislocations where the thermal fluctuation can significantly lower not only the planar fault energies but also the associated energy barriers of slip events.  \n\n\n\n\n\nZhang et al. <cit.> reported the uneven intensities of the atomic columns for the same sites in different unit cells along the prismatic SF plane. This variation can be attributed to the mixture of different SF structures (SF I, II and III) and the inconsistency of the local chemical environment in the same SF structure.\nThe chemical-dependent prismatic SF III structures in C14 MgZn2 were investigated using hybrid MD/MC in the variance-constrained semi-grand canonical (VC-SGC) ensemble at 500 K. The target concentrations were set within the range of 5% off-stoichiometry. After equilibrium, the site occupancy intensity NA/Ntot (where NA is the number of A-type atoms in AB2 Laves phase) was averaged over all unit cells in the prismatic SFs. The statistics of the site occupancies in SF III at different chemical compositions are shown in Figure <ref>(f) and the naming convention of the sites is illustrated in Figure <ref>(e).\nMultiple SF III states with different chemical compositions are depicted in the chemical distribution schematic of Figure <ref>(a-d). A significantly higher concentration of solute atoms was identified at prismatic SFs than the matrix after 16,000 MC steps (1.6 ns MD time), see Figure <ref>. The atomic swapping mainly takes place in the Zr4Al3 building blocks, where the Laves building blocks remain unchanged except at 28.3% Mg composition. At 31.3% Mg composition (-2% off-stoichiometry), Z14L and Z14R are almost occupied by Zn (small) atoms in contrast to the stoichiometric SF III configuration. In addition, half of the Z15U and Z15D sites are Mg (large) atoms. With decreasing Mg content, around 75% Z15U and Z15D sites are occupied by Zn atoms at 28.3% Mg composition. On the Mg-rich side of the off-stoichiometry, all sites in the Zr4Al3 building blocks are mostly occupied by Mg atoms. At 38.3% Mg composition (+5% off-stoichiometry), nearly pure Mg Zr4Al3 building blocks were obtained. \nThe variation of local chemical distribution in SF III at different chemical compositions provides a possible explanation of varying intensity in prismatic SFs as reported in the literature <cit.>. \nThe presence of diverse prismatic SF states in off-stoichiometry implies that the chemical composition has an impact on prismatic plasticity. To gain a more profound comprehension of prismatic plasticity, additional works are necessary, such as unraveling dislocation mechanisms and the effects of solute atoms on dislocation motion.\n\nIn this study, we evaluated the prismatic slip systems and potential metastable states of C14 CaMg2 and MgZn2 using atomistic simulations. Various prismatic stacking fault states with identical lattice patterns but different chemical distributions and site occupancies were identified at varying interlayers, temperatures and chemical compositions. The formation of prismatic stacking faults that are energetically favorable involves short-range diffusion, indicating that prismatic slip is thermally activated. The findings of this work enhance our comprehension of non-basal slip in Laves phases, which is dependent on temperature and chemical composition, and can be generalized to other topologically close-packed phases.\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n\nThe authors acknowledge financial support by the Deutsche Forschungsgemeinschaft (DFG) through the projects A02, A05 and C02 of the SFB1394 Structural and Chemical Atomic Complexity – From Defect Phase Diagrams to Material Properties, project ID 409476157. This project has received funding from the European Research Council (ERC) under the European Union’s Horizon 2020 research and innovation programme (grant agreement No. 852096 FunBlocks). Simulations were performed with computing resources granted by RWTH Aachen University under project (p0020267) and by the EXPLOR center of the Université de Lorraine and by the GENCI-TGCC (Grant 2020-A0080911390).\n\n\n\n\n\n\n\nOn the temperature and chemical dependency of prismatic stacking faults in C14 Laves phases\n    Julien Guénolé\n    March 30, 2023 at \n===========================================================================================\n\n\n\n\n\nSupplementary Material\n\n\n\n\n\n§ SIMULATION METHODS\n\nThe atomistic simulations were performed using the molecular dynamics (MD) software package LAMMPS <cit.>. \nThe interatomic interactions were modeled by the modified embedded atom method (MEAM) potential by Kim et al. <cit.> for Ca-Mg and the embedded atom method (EAM) potential by Brommer et al. <cit.> for the Mg-Zn system. \nBoth potentials reasonably describe the mechanical properties of C14 CaMg2 and MgZn2 Laves phases as compared to experiments and ab initio calculations (see Table <ref>).\n\nTo investigate the prismatic {1̅ 1 0 0} slip systems, the C14 CaMg2 and MgZn2 Laves structures were constructed using Atomsk <cit.> following the crystallographic orientation: 𝐱=[ 1 1 2̅ 0 ], 𝐲=[ 1̅ 1 0 0 ] and 𝐳=[ 0 0 0 1 ]. Generalized stacking fault energy (GSFE) surfaces were calculated by incrementally shifting one-half of the crystal along the slip directions across the slip plane. Periodic boundary conditions (PBC) were applied in the 𝐱 and 𝐳 directions parallel to the slip plane (contains 3 × 2 unit cells). Non-periodic boundary conditions were used along the 𝐲-[ 1̅ 1 0 0 ] direction (20 unite cells in 𝐲-direction). The FIRE <cit.> algorithm with the force tolerance of 10^-8 eV/Å was used to relax atoms along the 𝐲-[ 1̅ 1 0 0 ] direction after each displacement step. The stacking fault states were identified on the GSFE surfaces and then fully relaxed. In addition, climbing image nudged elastic band (NEB) <cit.> calculations were performed to find saddle points and minimum energy paths (MEPs) of slip events. The spring constants for parallel and perpendicular nudging forces are both 1.0 eV/Å^2. Quickmin <cit.> was used to minimize the energies across all replicas until the force norm was below 0.01 eV/Å.\n\nThe prismatic stacking fault configurations (9 × 40 × 6 unit cells with PBC in all directions) in C14 CaMg2 and MgZn2 were equilibrated for 200 ps at 300 K or 500 K using the Nosé-Hoover thermostat together with the Nosé-Hoover barostat <cit.> to relax possible stresses. The timestep is 1 fs. To investigate the chemical distribution at planar faults, hybrid MD/Monte Carlo (MC) simulations in the variance-constrained semi-grand canonical (VC-SGC) <cit.> ensemble (κ=1000, Δμ=± 0.3 eV) were performed at T=500 K on the C14 MgZn2 sample contains prismatic stacking faults for 1.6 ns (1 MC step every 0.1 ps MD time). The target concentrations of Mg atoms vary from 28.3% to 38.3% (± 5% off-stoichiometry). To ensure that the systems reach equilibrium at the target concentration, chemical potential and temperature, we used the evolution of potential energies (Figure S<ref>), local and global concentrations (Figure S<ref>), and successful swap rates (Figure S<ref>) as indicators.\n \nThe atomic structures were quenched using the conjugate gradient method to reduce thermal noise for visualization. The Open Visualization Tool (OVITO) <cit.> was used to visualize the atomic configurations and trajectories. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}