{"entry_id": "http://arxiv.org/abs/2303.06687v1", "published": "20230312151607", "title": "Quantifying the Effects of Magnetic Field Line Curvature Scattering on Radiation Belt and Ring Current Particles", "authors": ["Bin Cai", "Hanlin Li", "Yifan Wu", "Xin Tao"], "primary_category": "physics.space-ph", "categories": ["physics.space-ph"], "text": "\nUTF8gbsn\n\n\n\n\n\n\n\nBin Cai1,2,3, Hanlin Li1,2,3, Yifan Wu1,2,3, and Xin Tao1,2,3\n\n\n\n\n1CAS Key Laboratory of Geospace Environment, Department of Geophysics and Planetary Sciences, University of Science and Technology of China, Hefei, China\n2CAS Center for Excellence in Comparative Planetology, Hefei, China\n3Anhui Mengcheng Geophysics National Observation and Research Station, Mengcheng, China\n\n\n\nX. Taoxtao@ustc.edu.cn\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  * The effects of filed line curvature scattering on particles are investigated by test particle simulations and compared with the analytic model results. \n\n  * The global diffusion coefficients and decay time distribution of electrons and protons are calculated in a realistic magnetic model under different geomagnetic activity conditions.\n\n  * The apparent influence region by curvature scattering outside about 7Re for electrons and reaching 5Re for protons whose decay time is less than 10 hours at midnight at Kp above 4. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMagnetic field line curvature scattering(FLCS) happens when particle gyro-radius is comparable to magnetic field line curvature radius, and the conservation of the first adiabatic invariant is broken. As a collision-less particle scattering mechanism, FLCS plays a vital role in affecting the distribution of energetic electrons in the radiation belt, precipitation of ring current ions, and the formation of proton isotropic boundary(IB). In recent years, it has been increasingly used in research on particle dynamics. Previous studies focused on quantifying the effects of curvature scattering in a single case. This paper uses the analytic model to calculate the spatial distribution of diffusion coefficients induced by FLCS in a real magnetic field model. Various energy particles are used to analyze the coverage of curvature scattering in radial and MLT directions, as well as the influence of Kp index. The decay time of particles due to curvature scattering is estimated based on diffusion coefficients which suggest that the time scale of curvature scattering is too long to explain the rapid loss of electrons in the radiation belt and the ring current with the energy of MeV or below MeV. However, the decay time of ring current protons is on the order of hours or even minutes which can be used to explain the ring current decay during the recovery phase of magnetic storm. Finally, the effects of resonant wave-particle scattering and FLCS in the vicinity of the midnight equator are briefly compared. It is found that the influence of FLCS on hundred-keV protons in the ring current region is comparable to or even greater than that of EMIC wave scattering. Our results suggest the non-negligible effects of the FLCS and should be considered in radiation belt and ring current modeling. \n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nThe basic process of energetic particles motion play essential roles in determining the formation and dynamics of the radiation belts and ring current in the Earth's inner magnetosphere. Assuming charged particles are controlled by dipole magnetic field, there are three adiabatic invariants satisfy conservation laws. These three adiabatic invariants are called the first adiabatic invariant(magnetic moment, μ), the second adiabatic invariant(longitudinal invariant, J), and the third adiabatic invariant(magnetic flux, Φ ) corresponding to the particle gyro-rotation around magnetic filed, bounce along the magnetic field and azimuthal drift around the Earth respectively. However, the condition for conserving adiabatic invariants may not be satisfied in a realistic plasma environment. For example, in terms of the magnetic moment of a charged particle, the conservation requires the ratio of the time scale of charged particle gyro-rotation and magnetic field variation, in addition to the ratio of spatial scale of the charged particle gyro-radius(ρ) and magnetic field inhomogeneity both are much less than one. In a realistic plasma environment without electromagnetic waves, the latter ratio is more critical in deciding whether the conservation of magnetic moment is broken. During disturbed geomagnetic conditions, the night-side magnetosphere tends to have weaker magnetic field strength in the equatorial plane. And in this region, the magnetic field inhomogeneity or, say, the radius of magnetic field line curvature(R_c) becomes much smaller because the field line is stretched to a great extent. Therefore, the changes of the magnetic moment are determined by the parameter ρ / R_c, also called adiabatic parameter ε <cit.>. In general, when the value of the radius of magnetic field line curvature is comparable to the gyro-radius of charged particles, the violation of the magnetic moment happens.\n\nThe violation of adiabatic invariants, the so-called non-adiabatic behavior of charge particle, leads to a jump of magnetic moment Δμ when the charged particles are across the magnetic equatorial plane(i.e., where the magnetic field strength is a minimum). Various analytic models have been derived to predict the degree of magnetic moment change during one single equator cross between two mirror points. Hastie1969 derived a theoretical expression for non-adiabatic jumps using the trajectory deformation technique in the complex plane for the first time. Due to the thin thickness of the current sheet during the disturbed times, the magnetic field lines on both sides of the current sheet are significantly distorted, and the magnetic field lines appear to have a small radius of curvature at the magnetic equator. Based on the current sheet model, Gray1982,Wagner1979 and Il'In1978,Anderson1997 investigated the trajectories and the jump of the magnetic moment of charged particles passing through the equator in the terrestrial magnetotail and radiation belt region, respectively.\n\nThese analytic models quantitatively analyzed the non-adiabatic behavior of charged particles and indicated which parameters play a role in it. The quantity δμ/μ is defined as the relative changes of the magnetic moment when a particle is across the magnetic equator once. The value of the adiabatic parameter(ε) controls the degree of violation of the non-adiabatic behavior. The δμ/μ vary exponentially with ε and have sinusoidal dependence on the particle's equatorial gyro-phase angle Φ_eq. The maximum value of δμ/μ depends on the pitch angle of a charged particle. That is, the maximum changing in μ occurs for a pitch angle value between 0-90 degrees<cit.>. \n\nFurthermore, considering the cumulative effect of ensemble random slight changing of μ at the magnetic equator, the diffusion approximation<cit.> can be used. Under this approximation, the magnetic moment change of charged particles during several bounce periods can be viewed as the pitch angle scattering event called field line curvature scattering(FLCS). As a collisionless particle scattering mechanism in the absence of plasma waves, the FLCS contributes to the ring current decay and inner radiation belt proton loss because the ions pitch angle distribution tends to be more uniform, which leads to ions precipitation loss into the upper atmosphere. Ilin1986 and Chirikov1987 deduced that the FLCS effects become significant when the value of ε equals about 0.2, assuming the background field is static. For the current sheet magnetic model, when ε is great than 0.125, the FLCS effects must be considered in the charged particle dynamics<cit.>.\n\nThe exact value of ε not only determines the degree of individual changes in magnetic moment caused by field line curvature but also affects the rate of pitch angle scattering by FLCS when applicable to trapped charged particles where a large number of scattering events may occur. Birmingham1984 derived an analytic formula for the individual change of magnetic moment and deduced the diffusion coefficients by taking into account the phase space density satisfies the diffusion equation averaged over several bounce periods. To accurate the diffusion coefficients,Young2002,Young2008 developed the empirical model of magnetic moment scattering by adding two parameters related to equatorial magnetic field configuration. Due to the inaccurate estimate of protons loss by assuming a single value cutoff of ε, Tu2014 developed a new empirical ε-onset model to predict the proton loss caused by FLCS in dipole and T89c model. Also, to improve the inaccurate estimate of ring current ions loss, Eshetu2021 proposed another empirical model about the e-folding lifetime of midnight ion as a function of particle energy, pitch angle, L-value, and Kp index in T89c model. Besides, the FLCS process can explain the formation of the proton isotropic boundary(IB). The boundary between strong and weak proton scattering by FLCS in the magnetosphere is believed to coincide with the proton IB<cit.>.\n\nAlthough the electron has a much smaller gyro-radius than the ion at the same energy, the scattering effect of the magnetic field curvature of the electron is still not negligible, especially in the night-side magnetosphere during disturbed times. Artemyev2013 demonstrated that the effects of FLCS are more critical than the scattering by resonant wave-particle interaction for high-energy(≥ 1 MeV) electrons in the night-side inner magnetosphere based on the current sheet magnetic field model. Eshetu2018 demonstrated that FLCS in the weak magnetic strength region adjacent to the BBFs in the global MHD simulations could scatter energetic electrons whose energy is above a few keV. By simulating the 17 March 2013 storm event, Yu2020 shows that the precipitation proton flux of tens keV due to FLCS is comparable to that of electrons on the night side. \n\nPrevious studies investigated the mechanism of field line curvature scattering according to analytical models and numerical simulations. However, only some studies test the accuracy of the analytical formula in the realistic magnetic field configuration and give the global charged particle diffusion coefficients, including electrons and ions, under different geomagnetic activity conditions. In this study, we demonstrate the accuracy of Birmingham1984 analytical model in the current sheet configuration and quantify the filed line curvature scattering rate at different MLT, L-shell, and Kp-index in the T89c magnetic field. Furthermore, we calculate the particle lifetime and compare the results with the scattering by waves at the midnight magnetosphere to understand the role of field line scattering in the radiation belt and ring current dynamics. \n\nThe remaining part of the paper is organized as follows. Section <ref> describes the methodology, that is, the test particle simulation we implement to study the non-adiabatic behavior of the charged particle. Details of the analytic model validation by comparison with simulation are described in Section <ref>. Then, Section <ref> shows the global distribution of particle's diffusion coefficients and decay time by FLCS aimed at electrons and protons. The comparisons between curvature scattering and wave-induced scattering are also investigated. Finally, our results are summarized in Section <ref>.\n\n\n \n\n\n\n\n§ TEST PARTICLE SIMULATIONS\n\n\n\nTo thoroughly investigate the influence of FLCS on charged particles in the radiation belt and ring current region, we first carry out the test particle simulations, which trace the entire trajectories of particles by solving the fully relativistic Lorentz motion equation using the Boris algorithm<cit.>. Due to its excellent long-term accuracy, this algorithm is widely used in the radiation belt modeling community<cit.>. From the trajectory of a single particle to the vast number of particle's ensemble behavior during several bounce periods, we can obtain the degree of FLCS on the energetic particles quantitatively. The background magnetic field model we chose is the thin current sheet magnetic field, representing one kind of realistic magnetic field configuration often observed during disturbed geomagnetic conditions<cit.>. The background magnetic field in the vicinity of the equator can be represented by\n\n    B_z = σ B_0x ,  B_y = 0 \n         B_x = B_0xtanh(z/L_CS).\n\n\nThere is no electric field because a special Lorentz transformation to a moving frame of reference is used<cit.>. Here B_0x is the value of magnetic field strength at the boundary of the considered region, σ is a constant parameter representing the strength of magnetic field perturbation, L_CS is the thickness of the current sheet. The x-axis is defined along with the radial direction, and the z-axis is defined along the normal to the equatorial plane in the  GSM(Geocentric Solar Magnetic) coordinate we chose. The radius of curvature radius R_c(z) can readily obtain from equation (<ref>), and at the middle of the current sheet, that is for z=0, we get R_c(z=0) = σ L_CS. Note that the condition for adiabatic behavior of charged particles is the value of adiabatic parameters satisfy ε≪ 1 or R_c(z=0) ≫ρ. By changing the value of the parameter L_CS, we can study the non-adiabatic behavior characteristic of given energy(1.5 MeV) and equatorial pitch angle(30^∘) electron under the different thickness of the current sheet respective\nly. We assume B_0x=100nT  and σ=0.15, which is a typical value for the outer radiation belt in the magnetic storm period<cit.>. The time step is 0.02 T_gyro. Here T_gyro is the equatorial gyro-motion period of the electron.\n\n\n\n\n\n\n\nHere we show electron trajectories during one bounce period from relativistic test particle code as the benchmark simulation.Two kinds of magnetic field configuration are used by set L_CS = 5 Re and 2Re, which correspond to the adiabatic parameter ε = 0.09 and 0.22, respectively. The trajectories of one electron for one bounce period are traced in which energy E equals 1.5 MeV, and equatorial pitch angle α_eq equals 30^∘. The particle trajectories are obtained in Figure <ref>. Figure <ref>(a) and <ref>(c) are the projection of trajectories in the x-z plane, and Figure <ref>(b) and <ref>(d) is the projection in the y-z plane. In the ε=0.09, the electron's motion is approximately field-aligned, and the trajectories are symmetric concerning the z=0 plane. A characteristic `folded figure eight' trajectory is shown in the y-z plane, which implies the drift in the z direction around the equator is dominated by field curvature instead of field intensity gradient. These results reveal the strongly adiabatic behavior of electron under ε=0.09. Another magnetic field configuration of ε=0.22 is considered. Several characters indicate FLCS occurs at the equatorial plane, where the minimum value of curvature radius and the weakest magnetic field magnitude(B-minimum) exists. However, the trajectories are not symmetric about the z=0 plane, and the equatorial pitch angle is changed obviously so that the bounce altitude differs a lot before and after the electron crosses the equatorial plane. \n\n\n\n\n\n\n§ VALIDATION OF ANALYTIC FLCS COEFFICIENTS\n\n\n\nTo compare the cumulative FLCS scattering results of test particle simulation with predictions from analytic models, firstly, we further increase the simulation time to 500 equatorial gyro-motion period(T_gyro) and record the magnetic moment at each time by adding two magnetic field configuration L_CS= 3Re and 1Re which adiabatic parameter are ε = 0.15 and 0.45 respectively. Magnetic moment can be written by μ = p^2_⊥/(2m_0 B), where p_⊥ is the particle momentum perpendicular to the magnetic field direction and m_0 is the rest mass of a particle. In this paper we use the normalized magnetic moment μ^* via normalizing μ by p^2/(m_0 B_eq) so that the μ^* can be written as μ^* = sin^2α_eq / 2 at the equatorial plane. The same equatorial pitch angle α_eq = 30^∘ is chosen under different filed configuration situations. Therefore, the initial normalized magnetic moment is 0.125. The results are shown in Figure <ref>. The four figures demonstrate the transition from the adiabatic to non-adiabatic behavior of the particle. In the situation of ε=0.09 as shown in Figure <ref>(a), the particle behaves strictly adiabatically also as shown as the trajectories of Figure <ref>(a) and <ref>(c). The magnetic moment remains constant as the particle passes the equatorial plane, although the apparent rapid oscillating of the magnetic moment occurs at the equatorial plane. Figure <ref>(b) and <ref>(c) show two different degrees of non-adiabatic by FLCS, the thinner current sheet thickness(ε=0.22 corresponding to L_CS=2Re) lead to the more significant change of μ which is consistent with the understanding of FLCS. Besides, Figure <ref>(d) shows magnetic moment behaves large change by several times of initial value and maintains the low value till the end of the simulation. The thickness of the current sheet in Figure <ref>(d) is so thin(L_CS=1Re) that the change in μ is large enough when the electron passes through the equatorial plane and the electron enter into the loss cone after several bounce periods. \n   \n\n\n\nThough the FLCS effects cause the non-adiabatic behavior of a single particle, as we mentioned, the accurate definition of scattering is based on the ensemble cumulative effects of random slight changing of μ during several bounce periods under diffusion approximation. Therefore, besides studying the single particle μ jump events, we further investigate energetic electrons' pitch angle scattering events and calculate the test particle diffusion rates. The test particle diffusion coefficient of normalized magnetic moment (D^TP_μ^* μ^*) is calculated from D^TP_μ^* μ^*≡⟨Δμ^*2⟩ / 2 Δ t. Here ⟨…⟩ means averaging over all electrons, and Δμ^* ≡μ^* - ⟨μ^* ⟩<cit.>. Then the equatorial pitch angle diffusion coefficient can be obtained by the relationship D_αα =  D_μ^*μ^*/(sin^2α_eqcos^2α_eq). To obtain test particle diffusion coefficients, we trace 8000 electrons whose equatorial pitch angle is between 30^∘ and 70^∘ uniformly distributed, and the pitch angle step is 1^∘. Still, identical initial energy (1.5MeV) is used. The initial gyro-phase of electrons is randomly distributed between 0 and 2π, and the initial z position of electrons takes place in the north mirror point. Figure <ref>(a) shows the variation in μ of five randomly selected electrons with initial equatorial pitch angle α_eq = 37 ^∘. Variation of μ by FLCS can be viewed as the diffusion process. Furthermore, to calculate the test particle pitch angle diffusion coefficients, a linear fit to ⟨Δμ^*2⟩ as a function of time are plotted as shown by Figure <ref>(b). The ⟨Δμ^*2⟩ gradually deviates from a linear function of t after  ∼ 100T_gyro, which is due to the pitch angle of scattering electrons deviates from the initial α_eq gradually. Therefore, when performing a linear fitting of ⟨Δμ^*2⟩, specific time range t from 0 to 100T_gyro is used as indicated by the orange line in Figure <ref>(b).\n\n\n\nThe solid line in Figure <ref> is the prediction results from the Birmingham1984 analytic model under three different ε situations. The Birmingham1984 model not only derives the change of Δμ^* during charged particle single across the equator but also gives us the diffusion coefficients using the standard quasi-linear analysis<cit.>. The multi μ scattering process can be described as the random walk process so that the formula D_μ^*μ^* =  ⟨Δμ^*2/Δ t⟩ /2 is considered, where Δ t = τ_b/2 is the time interval between two crossing the equator and τ_b is the bounce period of particle. The diffusion coefficient using Birmingham1984 analytic model is given by the following:\n\n    D_μ^*μ^* = μ^*/4^5/4τ_bπ/Γ(9/8)^21/ε^1/4exp  -2F(μ^*)/ε\n\nwhich the function F is given by polynomial approximation in Birmingham1984 or Equation (10) in Anderson1997. Figure <ref> shows the comparison of test particle simulation and Birmingham model pitch angle diffusion coefficients under three configurations of the magnetic field L_CS= 1.5, 2, 2.5Re corresponding to ε are 0.3, 0.22, 0.18 respectively at equatorial pitch angle 30-70^∘. Birmingham1984 model agrees well with test particle simulations for ε = 0.3 and 0.22 at 30-70^∘ and for ε = 0.18 the agreement occurs at about 30-55^∘. The ε = 0.18 related to thicker current sheet configuration and at larger equatorial pitch angle(> 55^∘ ) the change of particle μ^* is so slow with time(like shown by Figure <ref>(b)), moreover, the μ changes dramatically at the equator that leads to the error in calculating ⟨Δμ^*2⟩. The result of calculation error overestimates the increase rate of ⟨Δμ^*2⟩, and the pitch angle diffusion coefficient by simulation has a larger value compared with the model consequently. In general, the predictions of Birmingham1984 analytic model are in good agreement with test particle simulations, especially when the medium value of equatorial pitch angle is chosen. \n\n\n\n\n\n§ FLCS DIFFUSION RATE OF ENERGETIC PARTICLES\n\n\n\n\n §.§ Calculation in T89c field\n\n\nTo study the effects of curvature scattering on radiation belt and ring current particles, that is, relativistic electrons and energetic protons in a more realistic magnetic field environment, we use the T89c magnetic field as the background field model<cit.>. As the T89c field has the advantages of broadly applicable conditions and simple parameter setting, it is convenient for us to use it to investigate the global distribution of curvature scattering diffusion rate. We employ the SM(Solar Magnetic) coordinates to describe the magnetic configuration below work. In SM coordinates, the z-axis is chosen parallel to the north magnetic pole and the y-axis perpendicular to the Earth-Sun line towards dusk. Correspondingly, the z=0 plane is approximately the magnetic equatorial plane. We aim to obtain the 2-D global distribution of diffusion coefficients at z=0 plane in the T89c field by the Birmingham1984 analytic formula. The results will help us to understand the influence of curvature scattering under different particle kinds between electron and proton, energy, L-shell, MLT, and geomagnetic activity index(Kp). The calculation process details: (1) In the z=0 circular plane of SM coordinates, 50 grids in the radial distance of 0-10 Re and 100 grids in the azimuthal direction of 0-2π are divided uniformly we used. Therefore, we calculate the diffusion coefficients of 5000 positions for given particle energy and Kp index. (2) By tracing the magnetic field line connecting the two ends of Earth from the point on the z=0 plane at each position, it can calculate the magnetic field magnitude and curvature radius of B-minimum, which is used to obtain the adiabatic parameter ε. (3) To calculate the bounce period(τ_b) of the particle with a given equatorial pitch angle, we integrate the parallel velocity of the particle along each segment filed line distance by assuming the conservation of magnetic moment satisfied. In calculation, we use the assumption of undisturbed trajectories theory<cit.>. (4) The pitch angle diffusion coefficients by Birmingham1984 model can be calculated as follows as Equation (<ref>). We choose the initial equatorial pitch angle α_eq=30^∘ because of the accurate estimation of Birmingham1984 model at medium pitch angle value as shown in Section <ref>. \n\nThe pitch angle diffusion coefficients of electrons are shown in Figure <ref>, in which three energy  E = 0.5, 1  and  4MeV  are chosen to correspond to outer radiation belt electrons in three columns under different geomagnetic activity index Kp from 1-7 in seven rows. In general, with increasing energy of the electron and more dramatic geomagnetic activity, the region of FLCS covers a wider L-MLT range. The FLCS region mainly happens on the night side of the inner magnetosphere, which can hardly inward penetrate the geostationary orbit(L ∼ 7) except for high electron energy under extremely dramatic geomagnetic conditions. The regional distribution of our calculation is not surprising. Because the stretched field line mainly occurs in the night-side inner magnetosphere, leading to a smaller curvature radius and the gyro-radius of higher energy electrons is much larger, the adiabatic parameters tend to be larger than the results of the day-side magnetosphere or lower electron energy. However, although the curvature scattering hardly happens within the geostationary orbit and is limited at night-side, the coverage of scattering can extend to dusk and downside of the inner magnetosphere even across the L ∼ 7 when energy is 4 MeV with Kp index above 5, which is consistent with Dubyagin2020 observation results. At first column in Figure <ref> which represents E=0.5MeV  electrons, the diffusion coefficients D_α_0α_0 can reach 10^-2s^-1 at 9Re midnight with Kp=5. The same diffusion coefficients occur at nearer 8 Re midnight with Kp=5 when electron energy is 1MeV as shown by the second column. These results indicate that curvature scattering could be a candidate mechanism to influence the radiation belt outer boundary, as shown by the observation by Sivadas2019. Assuming the D_α_0α_0 > 10^-6s^-1 is the condition to allow electrons to precipitate into the upper atmosphere, we notice that electrons of three kinds of energy can precipitate by FLCS but the different region. For example, at midnight above Kp=4, precipitation region is 8-10 Re for 0.5MeV , 7.5-10 Re for 1MeV and 6-10 Re for 4MeV  electrons.\n\n\n\nFrom the definition of the adiabatic parameter, we know that the ε depends not only on the magnitude of the magnetic field and curvature radius but also on the proportion of charge-to-mass radio. Therefore, the proton is more likely to be diffused due to FLCS. Many kinds of research of field line scattering focus on the major ions such as H^+,O^+ and He^+ of ring current in recent years<cit.>. Three proton energy E = 50keV, 100keV, and 1MeV  are chosen, in which 50 keV and 100 keV represent the ring current protons, and 1 MeV represents protons of the outer radiation belt. The calculation results are shown in Figure <ref> under different geomagnetic activity Kp index from 1 to 7. Not surprisingly, the region of proton field line scattering happens is much wider than electron even in the day-side magnetosphere when proton energy reaches 1 MeV. For 50 keV and 100 keV protons, which are often observed in the ring current<cit.>, the coverage of line curvature scattering is comparable with the 4 MeV   electrons on MLT direction and the inner boundary of  D_αα>10^-4 of midnight is at ∼ 8Re when Kp ≤ 3 while at ∼ 6Re when Kp>3. It's worth noting that Yu2020 found the inner boundary of D_αα > 10^-4 of midnight is about at 5Re  during their event with Kp = 5 - 6. This difference may be due to the electric field included in the RAM-SCB model they used. The convective electric field helps to enhance the influence of curvature scattering as demonstrated by Engel2015. For the 1 MeV proton, the region of FLCS completely covers all MLT directions. The inner boundary extends inwardly to ∼ 4 Re, which means the protons will always be affected by the curvature scattering when they drift around the Earth in ∼ 4 Re.\n\n\n\nAlthough the coverage of FLCS is much wider with the increase of geomagnetic activity index no matter whether electron or proton, the value of diffusion coefficients does not increase monotonically with Kp at the midnight position where curvature scattering occurs most likely. For instance, as shown obviously in Figure <ref>, D_αα of 1 MeV protons at 9 Re midnight when Kp = 7 is smaller than that of when Kp = 4 - 6. It can be explained. As the geomagnetic activity index increases, the magnetic field line is much more stretched, which leads to the increasing influence of curvature scattering. However, once the geomagnetic activity exceeds a certain limit, the magnetic reconnection event may occur at a certain midnight location, resulting in the reappearance of dipole-like magnetic configuration and decreasing the influence of line curvature scattering.\n\n\n\n §.§ Decay time estimation\n\n\nIt is essential to determine a physics mechanism's time and space scale. Regarding our work, the time scale of particle loss into the upper atmosphere due to field line scattering needed to be given. There are many studies focus on the particle decay time of the diffusion process<cit.>, here we use the method proposed by Shprits2006a who demonstrated that the decay time of electrons is most sensitive to the value of pitch angle scattering rate near the edge of the loss cone. Note that the decay time refers to the time it takes for the total number of particles to decay to 1/e of the original. In detail, by setting altitude 1000 km as the loss altitude or the magnetic mirror point, we calculate the angle of the loss cone by conservation of magnetic moment. Then, we use the angle of the loss cone(α_L) as the initial pitch angle of electrons at the magnetic equatorial plane to calculate the diffusion coefficients (D_α_Lα_L) as the same method as section <ref>. At last, using the value of 1/D_α_Lα_L to roughly estimate the particle's decay time, we get the time scale of the particle's loss of electrons and protons.\n\nFigure <ref> and <ref> represent the decay time distribution of electrons and protons by filed line curvature scattering in the T89c field, respectively. It is meaningless for the scattering process with a decay time greater than 100 days, so we ignore it by setting that region blank. The days of 10^-1-10^-2, 10^-3-10^-4 and 10^-5-10^-6 correspond to the diffusion process on the order of the hours, the minutes and the seconds. In terms of electron decay time, for 500keV and 1MeV energy, the loss time can be considered independent of curvature scattering within 6Re. The apparent loss occurs on the order of the hours outside 8Re under dramatic geomagnetic activity Kp>5. For energy 4MeV electrons, the decay time can reach the order of the seconds outside 7Re under condition Kp>4. However, such high energy flux is not often observed by satellites at that distance, as shown as Zhao2018. As for the decay time of protons, for energy 50keV, the order of hours of loss rate appears around 6Re night-side under Kp>5, which is comparable with the time scale of ring current decay during recover phase of the storm. The decay time of 100keV protons is < 10 hours at > 5Re when Kp>5, which is very consistent with the simulation results of Eshetu2021. For the protons with energy 1MeV, the decay time is within one day in the whole drift shell with > 5Re and can be reduced to the order of minutes on the night side.\n\n\n\n\n\n\n\n\n §.§ Comparison with wave-particle resonant scattering\n\n\nAs a primary collision-less mechanism responsible for non-adiabatic effects, researchers have always been widely concerned with the wave-particle resonant interaction to study the dynamic variability of the radiation belt electrons and ring current ions in the space physics community. For example, whistler mode chorus waves can cause both the local acceleration and the precipitation of electrons into the atmosphere by pitch angle and energy scattering<cit.>. Electromagnetic ion cyclotron(EMIC) waves not only lead to rapid electron loss of several MeV energy but also cause ion precipitation with energy above tens of keV<cit.>. Comparing the relative contribution of the particle diffusion process between FLCS with wave-particle resonant scattering is needed, which helps us better understand the inner magnetosphere particle dynamics. Because many studies focus on resonant scattering by waves, even though the parameters they used are similar to our work, we select two kinds of research to compare the results of diffusion coefficients.\n\nOrlova2012 calculated the electron's bounce-averaged diffusion coefficients by whistler mode chorus waves in the T01s field for magnetic storm conditions. In Figure 6(g) and 6(j) of their paper(not plotted here), the D_αα of electron energy 1MeV and 2MeV are calculated in midnight 7Re location under geomagnetic condition Kp=6. Our results of electron D_αα by curvature scattering are shown in Figure <ref>(a) using the method described in Section <ref>. The same electron energy, locations, and Kp index are chosen to compare. As the results of the comparison, the diffusion coefficients by curvature scattering are much smaller than by wave resonant scattering no matter whether electron energy is 1MeV or 2MeV at equatorial pitch angle 5^∘-85^∘. That indicates the curvature scattering is far less than resonant scattering by chorus waves on the relative contribution of electrons diffusion with 2MeV and below energy. Notice that with increasing energy from 1MeV to 2MeV, the electron diffusion coefficients by wave-particle resonant scattering dropped by an order of magnitude. However, the diffusion coefficients by FLCS increase with growing energy, as shown by Figure <ref>(a). It can be inferred that the importance of FLCS might be more significant for ultra-relativistic(∼ 2-8 MeV) electrons.\n\nAnother research we chose for comparison is the study of resonant interaction between parallel propagating H^+ band EMIC waves and ring current protons by Cao2019, which calculate the diffusion coefficients for 100keV and 500keV in the dipole field at L=6 Re location. Due to the excitation of EMIC waves was often accompanied by dramatic geomagnetic activity, we assume Kp=6 to calculate the D_αα by curvature scattering at midnight 6Re location under the same proton energy with Cao2019. The comparison results are shown in Figure <ref>(b). For 100keV energy protons, the influence of curvature scattering is comparable with resonant interaction scattering when α_eq<50^∘ on the contribution for loss of ring current proton. In contrast, resonant interaction is more significant when α_eq>50^∘. As for protons energy 500keV, the values of D_αα by curvature scattering at most equatorial pitch angle are more significant than it by resonant scattering of EMIC waves except α_eq near 90^∘. In general, the importance of FLCS on ring current protons is no less than wave resonant scattering, which might be the primary mechanism of controlling high-energy protons precipitation.\n \n\n\n\n\n§ SUMMARY\n\n\nDue to magnetic field line curvature scattering(FLCS), charged particle scattering is essential to non-adiabatic particle dynamics. Moreover, it might be responsible for the loss of energetic particles into the upper atmosphere. In this work, we investigated the effects of field line curvature scattering on radiation belt and ring current particles quantitatively in a realistic magnetic field. Fully relativistic test particle simulations were performed to test the accuracy of the analytic model from Birmingham1984, and the global diffusion coefficients and decay time distribution of field line curvature scattering are calculated by the analytical model for both electrons and protons. Furthermore, the relative importance of the loss of particles between resonant scattering by waves and curvature scattering is compared. The main conclusions are listed as follows:\n\n  \n  * Electrons with the energy of 1 MeV and below could be effect by curvature scattering at a large distance(R > 8Re) and at midnight during the active period(Kp > 6). However, the decay time of sub-MeV electrons is too long(> 1day) to explain the fast loss of relativistic electrons. On the other hand, for the ultra-relativistic electron(4 MeV), the curvature scattering region drifts toward the earth(R > 7 Re) and covers wider at night-side compared with sub-MeV electrons. Estimation of 4MeV decay time shows that they could be loss at the rate of the order of minutes to hours.\n\n  \n  * Compared with electrons, curvature scattering is more effective for protons. Ring current energy protons(50-100keV) could be affected by curvature scattering at R > 6Re during the active period(Kp > 4). They can be lost on the order of hours, which is close to the time scale ring current decay during the recovery phase of the magnetic storm. Therefore, the curvature scattering could act as an effective mechanism to precipitate ring current protons.\n\n  \n  * The relative contribution of curvature scattering is far less than chorus waves for MeV electron in the region of R < 7 Re. While, for ring current protons(100, 500keV) at R = 6 midnight with Kp =6, the influence of curvature scattering is comparable to or even more significant than EMIC waves. This result further implies that curvature scattering plays a vital role in the loss of ring current protons.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}