{"entry_id": "http://arxiv.org/abs/2303.06685v1", "published": "20230312151031", "title": "Enhanced entanglement and controlling quantum steering in a Laguerre-Gaussian cavity optomechanical system with two rotating mirrors", "authors": ["Amjad Sohail", "Zaheer Abbas", "Rizwan Ahmed", "Aamir Shahzad", "Naeem Akhtar", "Jia-Xing Peng"], "primary_category": "quant-ph", "categories": ["quant-ph"], "text": "\n\n\n\namjadsohail@gcuf.edu.pk\nDepartment of Physics, Government College University, Allama Iqbal Road,\nFaisalabad 38000, Pakistan\n\nDepartment of Physics, Government College University, Allama Iqbal Road,\nFaisalabad 38000, Pakistan\n\nPhysics Division, Pakistan Institute of Nuclear Science and Technology\n(PINSTECH), P. O. Nilore, Islamabad 45650, Pakistan\n\nDepartment of Physics, Government College University, Allama Iqbal Road,\nFaisalabad 38000, Pakistan\n\nDepartment of Physics, Zhejiang Normal University, Jinhua 321004, China\n\nState Key Laboratory of Precision Spectroscopy, Quantum Institute for Light\nand Atoms, Department of Physics, East China Normal University, Shanghai\n200062, China\n\n\nGaussian quantum steering is a type of quantum correlation in which two\nentangled states exhibit asymmetry. We present an efficient theoretical\nscheme for controlling quantum steering and enhancing entanglement in a\nLaguerre-Gaussian (LG) rotating cavity optomechanical system with an optical\nparametric amplifier (OPA) driven by coherent light. The numerical\nsimulation results show that manipulating system parameters such as\nparametric gain χ, parametric phase θ, and rotating mirror\nfrequency, among others, significantly improves mirror-mirror and\nmirror-cavity entanglement. In addition to bipartite entanglement, we\nachieve mirror-cavity-mirror tripartite entanglement. Another intriguing\ndiscovery is the control of quantum steering, for which we obtained several\nresults by investigating it for various system parameters. We show that the\nsteering directivity is primarily determined by the frequency of two\nrotating mirrors. Furthermore, for two rotating mirrors, quantum steering is\nfound to be asymmetric both one-way and two-way. As a result, we can assert\nthat the current proposal may help in the understanding of non-local\ncorrelations and entanglement verification tasks.\n\n\nEnhanced entanglement and controlling quantum steering in a\nLaguerre-Gaussian cavity optomechanical system with two rotating mirrors\n    Jia-Xing Peng\n    March 30, 2023\n====================================================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nQuantum entanglement is one of the most weirdest phenomenon of quantum\nmechanics in which there exists a non-classical (non-local) correlation\nbetween spatially separated states <cit.>. Entanglement has been\nshown to have numerous applications in quantum information processing <cit.>, quantum teleportation <cit.>, quantum algorithms <cit.>, and quantum computing <cit.>. In recent years, many of the\ntheoretical and experimental studies focused on the generation of\nmicroscopic entanglement in systems such as atoms, ions, and photons <cit.>. However, it remained a pipe dream for researchers to\ngenerate quantum entanglement for macroscopic objects. As a result of hard\nefforts, macroscopic entanglement has been experimetally demonstrated for\nsuperconducting qubits <cit.>, atomic ensembles <cit.> and\nentanglement between diamonds <cit.>.\n\nIn addition to quantum entanglement, Einstein-Podolsky-Rosen (EPR) steering\n<cit.> is one of an important quantum correlation that sits between\nBell's non-locality and entanglement <cit.>. As there\nexists non-exchangeable asymmetric roles between the two observers, Alice\nand Bob. This phenomenon was first introduced by Schrödinger to show\nthat the non-locality in EPR states <cit.>. Most distinctive and\nunique feature of quantum steering is its directionality <cit.>. It is\ninteresting to mention here that the steerable states of massive and\nmacroscopic objects can be utilized to test the foundational issues of\nquantum mechanics and the implementation of quantum information processing.\nIn recent years, many of the studies has focused to achieve these goals in\nmany optomechanical <cit.> and in magnomechanical systems\n<cit.>. It is because of advancement in present day\ntechnology that the most promising feature of quantum steering, one-way\nsteering, has been experimentally demonstrated <cit.>.\n\nOver the course of about last two decade, cavity optomechanical systems <cit.> have gained importance due to its academic significance and\napplications in foundational issues of quantum mechanics <cit.> and\nhighly precise measurements <cit.>. Optomechanical systems have\nrecently sparked widespread interest in their discussion of quantumness <cit.> via the Wigner function <cit.> and time-frequency\nanalysis <cit.>. In addition to above, optomechanical systems have\nbeen experimentally used because of the development of optical micro-cavity\ntechnology. They provide an excellent test bed macroscopic entangled state\n<cit.>, coherent state <cit.>, squeezed state\n<cit.>, ground state cooling <cit.> and optomechanically induced\ntransparency (OMIT) <cit.>. In principle, nothing\nfrom the principles of quantum mechanics prohibit macroscopic entanglement.\nThis has been first investigated by Vitali and collaborators in their\nseminal paper <cit.>. Therefore, optomechanics is paving a way towards\nthe macroscopic non-local correlations at macroscopic scales.\n\nMotivated by the progress in optmechanical systems, Bhattacharya and Meystre proposed an optomechanical system comprising a rotating mirror (or rovibrational mirror) which is directly coupled to a Laguerre-Gaussian (LG) cavity mode via exchange of angular momentum <cit.>. In their scheme, they demonstrate that the rotating mirror can be sufficiently cooled\nto 8mK right from the room temperature (300K), due to the incident radiation torque. At such low temperature, one can observe various nonlinear and quantum phenomena. In another interesting scheme, Bhattacharya and collaborators, showed that one can generate entanglement between mechanical rotating mirror and LG cavity mode <cit.>. More recently,\nresearchers found that orbital angular momentum of LG cavity mode can be measured by utilizing OMIT window width <cit.>. Furthermore, researcher used hybrid rotational system to study OMIT <cit.>, cooling of rotating mirrors <cit.>, and entanglement <cit.>. Most recently, there is an interesting study by Huang et al, in which they proposed a LG cavity optomechanical scheme, assisted with an optical parametric amplifier (OPA) whose pump frequency is double the frequency of frequency of anti-Stokes field which is\nbeing generated by the external laser beam interacting with both rotating mirrors, for exploring the entanglement between two rotating mechanical mirrors <cit.> and showed that the maximum entanglement is restricted by the gain of the OPA.\n\n\nThe current research focuses on the controllable quantum steering and\nenhanced entanglement in a resolved-side-band of two rotating mechanical\nmirrors of a single LG optomechanical cavity containing an OPA. We\nspecifically investigated mirror entanglement as well as quantum steering of\nrotating mirrors, and our results show that parametric interactions haveÂ\n increased entanglement. Moreover, we also discussed the dependence of\nentanglement upon several system parameters such as parametric gain χ,\neffective detuning Δ and parametric phase θ. It is also shown\nthat there exists tripartitite (mirror-cavity-mirror) entanglement,\nquantified by residual cotangle. In addition to entanglement, we also\nstudied the control of quantum steering ξ, which has been found to be\nasymmetric both one-way and two-way for rotating mirrors RM_1 and RM_2, respectively.\n\nThe paper is arranged as follows. In Section 2, we present\nthe theoretical model and the corresponding dynamical quantum langevin\nequations. The discussion of methodology for measuring entanglement and\nquantum steering is covered in Section 3. We present\nnumerical results that discuss bipartite/tripartite entanglement and quantum\nsteering in Section 4 and Section 5,\nrespectively, then Section 6, shows the experimental\nfeasibility of the present scheme. Finally, Section 7\npresents the conclusions.\n\n\n\n\n\n\n§ THEORETICAL MODEL\n\n\n The system we considered comprises an optical cavity with length L with two rotating mirrors, as shown in Figure 1. The cavity is driven by\nthe input Gaussian beam which has no topological charges. The Gaussian beam\nwith frequency ω_L and zero charge enters the cavity through the\nleft rotating mirror (RM_1), which is partly transmissive. The reflected\nbeam gets a charge -2l while the transmitted beam obtain zero charge.\nMoreover, the transmitted beam is then incident on the right rotating mirror\n(RM_2) and gets charge 2l (zero) on reflection (transmission) from RM_2. Thus a beam with charge 2l interacts with the RM_1 again. The\ntransmitted beam from RM_1 has charge 2l while the reflected beam\nremains with no charge, demonstrating that the net topological charge\nincrement of light transmission back and forth in the cavity is zero,\nensuring the stability of the system. Moreover, the coupling between the\ncavity and left/right rotating mirrors established due to the exchange of\norbital angular momentum. Therefore, we can expect the entanglement between\ntwo rotating mirrors. The exchange of angular momentum between each rotating\nmirror and each intracavity photon is 2lħ and time for a round trip is\n2L/c, thus the radiation torque acting on both mirror is the change in\nangular momentum per the time required for a round trip, that is, 2lħ/(2L/c)=clħ/L=ħ g_ϕ, where g_ϕ=cl/L\noptorotational coupling strength. For simplicity, we assumed the same radius\nR and the same mass m, and the same intrinsic damping rate γ_m.\nIn addition, a degenerate OPA is embedded into the cavity. Finally, the beam\nis completely reflected from RM_2. Moreover, we have ignored the loss of\nincident light <cit.>. In a frame rotating at the driving frequency ω _L,\nthe Hamiltonian of the whole system takes the form\n\n\n\n    H/ħ   =   [Δ_0+(g_1φ _1-g_2φ_2)]\n    a^†a+1/2∑_j^2ω_φ _i(\n    L_z_i^2+φ _i^2)  \n          +iχ ( a^† ^2e^iθ-a^2e^-iθ) +ι\n    E(a^†-a),\n\nwhere Δ_0=ω _c-ω _L is the detuning of the cavity\nfield and a (a^†) is the annihilation (creation) operator of\nthe cavity field, and follow the relation [ a,a^†] =1.\nWhile ϕ _j and L_z_k are the angular displacement and angular\nmomentum of the rotating mirrors, respectively, with [ϕ\n_j,L_z_k]=iδ_jk(j,k=1,2). In above Hamiltonian, the first two\nterms are the bare Hamiltonian of the energy for the cavity field and the\ntwo rotating mirrors, the third term describes the optomechanical coupling\nbetween the cavity field and the two rotating mirrors with the coupling\nconstant given by g_i=(cl/L)√(ħ /Iω _ϕ _i)(\ni=1,2) <cit.>, where c is the velocity of light and l is the\norbital angular momentum quantum number, L is the length of the cavity and\nI=MR^2/2 is the moment of inertia of the two rotating mirrors about the\ncentral axis of the cavity. The next term interprets the interaction of the\n2nd-order nonlinear optical crystals, at 2ω_L, with the L-G cavity\nmode with χ (θ) being the parametric gain (phase) of the OPAs.\nThe last term of Equation (<ref>) represents the interaction of the LG-cavity\nmode with the incoming coupling field.\n\nThe dynamics of the system can be well described by the time evolution of\nthe operators and is given by the quantum Langevin equations (QLEs), which\ncan be written as:\n\n\n    ϕ̇_j   =   ω _ϕ _jL_z_j,(j=1,2) \n    L̇_z_j   =   -ω _ϕ _jϕ _j+g_α ja^†a-γ _mL_z_j+ε ^in, \n    ȧ   =   -[κ +iΔ _∘+(g_1ϕ _1-g_2ϕ _2)\n    ]a+2χ a^†e^iθ\n          +E+√(2κ)a^in,\n\nwhere g_α1=-g_1, g_α2=g_2 and Δ _∘=ω _c-ω _L. In addition, ε ^in account for the\nmechanical noise, and its fluctuation correlations which are relevant to\ntemperature T, can be described by\n\n\n    ⟨δε ^in(t)δε ^in(t^^')⟩ =γ _m_i/ω _ϕ _i\n    ∫_-∞^∞dω/2πe^-ιω\n    (t-t^^')ω[ 1+Θ] ,\n\nwhere Θ =( ħω/2k_BT), with k_B being the Boltzmann's constant. Similarly, a^in is a noise\noperator that of the incident laser beam on the optical cavity and whose\ndelta-correlated fluctuations are\n\n    ⟨ a^in(t)a^in,†(t)⟩ =δ (t-t^^'),\n\nTo linearize the set of QLEs, i.e.,  Equation (<ref>-<ref>), we use the ansatz by\nwriting τ =τ _0+δτ, (τ =ϕ _j,L_z_j,a),\nwhere τ _s (δτ) is the steady-state (quantum fluctuation\n) of the operators. Under the long-term limit, the steady-state values of\neach operator are:\n\n\n    L_z_j   =   0, \n    ϕ _j0   =   g_αj| a_0| ^2/ω\n    _ϕ _1, \n    \n    a_0   =   (κ -iΔ +2χ e^iθ)/(κ ^2+Δ\n    ^2+4χ ^2)E,\n\nwhere Δ =Δ _0+∑_j^2g_jϕ _j0 represents the\neffective cavity detuning while a_0 denotes the effective field\namplitude of cavity modified by OPA. Since, |a_s|≫δ a, one can\nomit the unwanted nonlinear terms, e.g., δ aδ a^†. In\nthis case, the linearized set of QLEs takes the form: \n\n\n\n\n\n\n\n\n\n\n\n\n\n    δϕ̇_j   =   ω _ϕ _jδ L_z_j, \n    δL̇_z_j   =   -ω _φ _jδϕ _j-γ\n    _mδ L_z_j+G_jδ X+δε ^in, \n    δẊ   =   -κδ X+Δδ Y+√(2κ)X^in, \n    δẎ   =   -κδ Y-Δδ X-G_1δϕ\n    _1+G_2δϕ _2\n          +√(2κ)Y^in,\n\nwhere G_j=√(2)g_α ja_0 is the effective optomechanical\ncoupling strength. Here, we have introduced the set of quadratures for the\ncavity field, that is, δ X=1/√(2)(δ a+δ a^†), δ Y=1/√(2)i(δ a-δ a^†), δ\nX_in=1/√(2)(δ a_in+δ a_in^†) and δ\nY_in=1/√(2)i(δ a_in-δ a_in^†). Hence, we\nrewrite the QLEs (Equation (<ref>-<ref>)) in a more compact form, as follow\n\n\n    Ż(t)=𝒜𝒵(t)+n(t),\n\nwhere 𝒵^T=(δϕ _1,δ L_z_1,δϕ\n_2,δ L_z_2,δ X,δ Y) is the fluctuation vector and n^T(t)=(0,ε ^in,0,ε ^in,√(2κ)X^in,\n√(2κ)Y^in) represents the noise vector. Therefore, the drift\nmatrix of the system is given by\n\n    𝒜=(\n    [        0  ω _ϕ _1        0        0        0        0; -ω _ϕ _1    -γ _m        0        0     -G_1        0;        0        0        0  ω _ϕ _2        0        0;        0        0 -ω _ϕ _2    -γ _m      G_2        0;        0        0        0        0     μ _+     ρ _+;     -G_1        0      G_2        0     ρ _-     μ _- ]\n    ) ,\n\nwhere μ _±=-κ± 2χ(e^θ) and ρ _±=±Δ +(e^θ). The above drift matrix of the system determines the\nstability of the optorotational system, is stable and reaches its\nsteady-state if none of the eigenvalues of the above drift matrix 𝒜 has a positive real part <cit.>.\n\n\n§ ENTANGLEMENT AND GAUSSINA STEERING MEASUREMENT\n\n Covariance Matrix. The foremost task is to find the\nstability of any system which, in this case, is obtained by applying the\nRouth-Hurwitz criterion which impose certain constraints on the system\nparameters. Once the constraints for the current optorotational system are\nfulfilled, the steady state of the fluctuations must be a Gaussian state.\nSince, ⟨ε ^in⟩=⟨ a^in⟩=0, and in\nthis situation, quantum correlations of the system can then be characterized\nby the covariance matrix, which has the same order as the drift matrix, with\nV_jk=[𝒵_j(∞ )𝒵_k(∞ )+𝒵\n_k(∞ )𝒵_j(∞ )]/2, where\n\n    𝒵^T(∞ )   =   (δϕ _1(∞ ),δ L_z1(∞\n    ),δϕ _2(∞ ),δ L_z2(∞ ),  \n          δ X(∞ ),δ Y(∞ ))\n\nrepresents the fluctuation matrix. The elements of the covariance matrix\ntake the form <cit.>\n\n    V_jk=∑_k,l∫_0^∞dt∫_0^∞dt^'\n    Λ_i,k(t)Λ_j,l(t^')Ψ_k,l(t-t^'),\n\nwhere Λ=exp(𝒜t) and\n\n    Ψ_k,l(t-t^')=⟨\n    n_k(t)n_l(t^')n_l(t^')n_k(t)/2\n\nis noise correlation functions matrix. For large mechanical quality factor,\nthe quantum Brownian noise can be delta-correlated, that is\n\n    Ψ_k,l(t-t^')   =   D_k,lδ(t-t^'),  \n       =   Diag[0,γ _m_1(2n_1+1),0,γ_m_1(2n_2+1),κ,κ],\n\nwhich simplifies Equation (<ref>) as follow\n\n    V=∫_0^∞dtΛ(t)DΛ^T(t).\n\nThe covariance matrix V of system satisfy steady-state Lypunov equation,\n\n    𝒜V+𝒜V^T=-D.\n\nThe covariance matrix V which delineate the entanglement configuration of\nthe current two mirrors optorotational system, its form is\n\n    V=(\n    [    M_1   N_12   N_1m; N_12^T    M_2   N_2m; N_1m^T N_2m^T    M_m ]\n    ) .\n\nEach entry of above covariance matric V is a 2×2 block matrix. The\ndiagonal entries of the above covariance matrix V describe the local\nproperties of the participants while the rest of the entries define the the\ncorrelations between different modes. Bipartite entanglement. The logarithmic energy which quantify the\nentanglement is defined as\n\n    E_N=max [0,ln (2ν^-)],\n\nwhere ν ^-=2^-1/2√(ℵ -√(ℵ^2-4ς)) is the smallest symplectic eigenvalue of the partially\ntransposed covariance matrix (CM), ς=[ς _α, ς _αβ;ς _αβ^T,ς _β] with each entry of the ς is a 2× 2 block matrix and therefore, ς is the 4× 4 CM of the bipartite subsystem involving mode α and β and\nℵ =ς _α+ς _β-2ς_αβ.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTripartite entanglement. We opt the minimum residual cotangle <cit.> for the basic criteria to realize tripartite\nentanglement, is given by\n\n    ℛ_τ^min≡min [ℛ_τ^m_1|m_2a,\n    ℛ_τ^m_2|m_1a,ℛ_τ^a|m_1m_2],\n\nwhere ℛ_τ^f|jk≡ C_f|jk-C_f|j-C_f|k≥ 0 (f,j,k=m_1,m_2,a) is the monogamy of quantum entanglement and this\ncondition assures the invariance of tripartite entanglement under possible\npermutations of all modes. Hence, ℛ_τ^min and is\ndescribes the genuine tripartite entanglement of any three-mode Gaussian\nstate. In Equation (<ref>), C_f|j is the contangle of subsystems of f\nand j ( j incorporate one or two modes), and is equal to the \nsquared logarithmic negativity. To execute one-mode-vs-two-modes\nlogarithmic negativity E_f|jk, one must reform ν^- (see Equation (<ref>)) as\n\n    ν^-=min eig |⊕_j=1^3(-σ _y)V_4|,\n\nwhere V_4=𝒫_1|2𝒱_4𝒫_1|2\nwith 𝒬=𝒢_i|jk𝒬𝒢_i|jk.\nFurthermore Furthermore, the partial transposition matrices are given by\n\n    𝒢_1|23   =   diag(1,-1,1,1,1,1), \n    𝒢_2|13   =   diag(1,1,1,-1,1,1), \n    𝒢_3|12   =   diag(1,1,1,1,1,-1).\n\n\n\n\n\n\n\n\nGaussian steering. Gaussian steering has asymmetric characteristics\nin nature and is much different from the entanglement. For the two\ninteracting mode Gaussian state, the recommended measurements of the quantum\nsteerability between any two interacting parties in different directions can\nbe calculated as\n\n\n    ζ _α |β   =   max{0,𝒮(2𝒱_m_l)-\n    𝒮(2𝒱_in)},  \n    ζ _β |α   =   max{0,𝒮(2𝒱_m_2)-\n    𝒮(2𝒱_in)},\n\nwhere 𝒮(ν ) is the Rényi-2 entropy and is 𝒮(ν\n)=1/2ln (ν ), and\n\n\n    𝒱_in=[\n    [      𝒱_m_1   𝒱_m_1m_2; 𝒱_m_1m_2^T      𝒱_m_2 ]\n    ] ,\n\nThe diagonal entries of 𝒱_m_1 and 𝒱_m_2\ndefines the reduced states of modes 𝒱_m_1 and 𝒱\n_m_2, respectively. We quantify the quantum steering by ζ _α\n|β which translates the mode α steers mode β and\nsimilarly ζ _β |α defines the swaped direction. It is an\nestablished fact that the entanglement is symmetric property. However, the\nEPR steering is intrinsically different from entanglement, i.e., asymmetric\nproperty which means that a quantum state may be steerable from Bob to Alice\nbut not vice versa. Therefore, there exist mainly three different\npossibilities for quantum steering. (i) ζ _α |β=ζ\n_β |α=0 as no-way (NW) steering, (ii) ζ _α |β>0 and ζ _β |α=0 or ζ _α |β=0 ζ\n_β |α>0 as one-way (OW) steering and ζ _α |β>0\nζ _β |α>0 as two-way (TW) steering. Asymmetric\nsteerability between the two modes of the Gaussian states can be checked by\nintroducing the steering asymmetry, defined as\n\n    ζ _M=|ζ _α |β-ζ _β |α|.\n\nIt is vital to mentioned here that we obtain one-way or two way steering as\nlong as steering asymmetry remains positive, i.e., ζ _M>0 and no-way\nif ζ _M=0.\n\n\n\n\n\n\n§ BIPARTITE AND TRIPARTITE ENTANGLEMENT\n\n\n In the following discussion, we demonstrate the results\nregarding the generation of bipartite (and tripartite) entanglement and\nquantum steering for the current system. Throughout our numerics, we have\nassumed experimentally realizable parameters, similar to those in ref <cit.>, listed in Table 1. In this paper, we consider two\nbi-partitions, namely E_N^m-m and E_N^m-c to represent the\ndegree of entanglement between two phonon modes and between L–G cavity mode\nand phonon mode, respectively. The utmost task of studying the entanglement\nin such a double rotational cavity optomechanical system is to find optimal\nvalue of the cavity detuning Δ. In Figure 2 (a-b), the logarithmic\nnegativity is plotted as a function of the detuning in the absence and\npresence of parametric gain (with different parametric phases). To ensure\nthe stability of the system, we choose the parameter gain χ=0.1ω_ϕ_1. We find that the steady state entanglement\nbetween two mirrors E_n^m-m (between the mirror and the cavity E_n^m-c) is obtained when Δ<0 (Δ>0) in the steady state\nwhich is similar to <cit.>. In addition, the maximal value of E_n^m-m (E_n^m-c) is obtained at about Δ=-ω_ϕ_1\n(Δ=ω_ϕ_1). Furthermore, the enhancement pattern of\nentanglement E_n^m-m, by varying the phase of the parametric, behaves\nalmost in converse manner as compared to E_n^m-c as shown by Figure 2\n(a-b).\n\nNext, we examine the combined effect of parametric gain and parametric phase\n(associated with the gain), on the mirror-mirror entanglement E_n^m-m\nand mirror-cavity entanglement E_n^m-c as shown by the Figure 3.\nPhysically, the gradual increase of parametric gain induces the nonlinearity\nin the system and consequently, we observe the enhancement in entanglement.\nOne can see that bipartite entanglement E_n^m-m increases as the θ increases for a larger value of parametric gain. We can also see\nfrom the Figure 3 that by ensuring the stability of the current system, the\nmaximum enhancement of E_n^m-m appears around θ=3π/2 for\nvaried parametric gain. For specific value of χ, the amount of maximum\nentanglement increase, is different. For example, keeping the fixed\nparametric gain, i.e., χ=0.1ω_ϕ_1, the amount of maximum\nentanglement E_n^m-m increased, is about 14%.\n\n\nThe robustness of such a mirror-mirror entanglement in two rotating cavity\noptomechanical system with respect to the temperature T as shown in Figure\n4. It is clear that for a fixed value of the parametric gain, the amount of\nentanglement decreases monotonically as the temperature of the environment\nincreases. and eventually cease to exist. However, the critical temperature\nof mirror-mirror entanglement fluctuate by varying the parametric phase. On\nthe other hand, the curve shown in the inset of Figure 4 have dissimilar\ntendency i.e., by choosing the optimal value of the parametric phase, the\ndegree of mirror-mirror entanglement E_n^m-m increases with the rise\nof parametric gain. However, the temperature decreases, implying that the\nsystem with larger parametric gain mass possess weaker capability to refrain\nfrom decoherence of the thermal environment.\n\n\n\n\nOne of the most vital contribution in the present double rotating system is\nto find the possibility of exploring the genuine tripartite entanglement. In\nFigure 5, we investigate the genuine tripartite entanglement versus normalized\ndetuning. It is clear that the genuine tripartite entanglement among the\nparticipants (i.e., phonon-photon-phonon) exists in the current double\nrotating system if the cavity mode is in blue sideband. The solid blue curve\nshows the genuine tripartite entanglement when χ=0. However, in the\npresence of parametric gain χ=0.1ω_ϕ_1, we plot tripartite\nentanglement for different value of phase. It is clear from Figure 5 that\nmaximum enhancement in tripartite entanglement is obtained for θ=π/2\n. It is also noticeable that this enhancement go along with an increase in\ndomain of genuine tripartite entanglement over a relatively wider range of\neffective cavity detuning. Furthermore, the maximum of genuine tripartite\nentanglement with parametric phase increases by 40%. Hence, the\nparametric phase of the OPA plays a vital role in enhancing the genuine\ntripartite entanglement as exhibited in Figure 5.\n\n\n\n§ CONTROLLING GAUSSIAN STEERING\n\n\n\n\n\nTwo-way (TW) control. In the following, our purpose is to find the\ncontrollable quantum steering in the double rotational cavity optomechanical\nsystem. Since the entanglement and the quantum steering are two different\nfacets of inseparable quantum correlations, therefore, it is better to study\nthem simultaneously under the same conditions. For this purpose, we employ\nthe Rényi-2 entropy to quantify the steerability between the two\nrotational modes. We first demonstrate this idea in Figure 6, the peak values\nof the entanglement and quantum steering of the two mechanical modes. It is\nevident from Figure 6. that steerable states are always entangled, however,\nthe reverse order is not generally true, i.e., entangled states are not\nusually steerable. This property reflects the idea that stronger quantum\ncorrelations, between the two rotational modes, are indispensable for\nrealizing the Gaussian steering than that for the entanglement. In such a\ntwo-rotating cavity optomechanical system, there may exist (one-) two-way\nquantum steering between the two rotational modes due to frequency\ndifference. To demonstrate the Gaussian steering more clearly, we use the\npink area to area to depict the presence of two-way steering, green and\nyellow areas for one-way steering, and the blue area to represent the\npresence of no-way steering. It is clear from Figure 6 (a-b), that both the\nmirror steer each other, however, the steerability mainly depends on the\nfrequency of each mirror. The mirror which has high frequency steers more as\ncompared to the mirror which has less frequency as clearly demonstrated by\nthe pink area in Figure 6 (a-b). The two-way steering implies that both Alice\nand Bob can convince each other that the state they shared, is entangled.\nFurthermore, Figure 6. reveal situation where ζ_m_1|m_2>0, ζ_m_2|m_1=0 and E_N^m-m>0 (or ζ_m_1|m_2=0, ζ_m_2|m_1>0 and E_N^m-m>0) witnesses the Gaussian one-way\n(OW) steering region as shown by the green (yellow) region. One-way (OW)\nsteering in the current system translates that the states of the two\nrotational modes are steerable in single direction even though they are\nentangled. Such a kind of response is a direct manifestation of the problem\nwhich has been reported in <cit.>. Furthermore, Figure 6 also shows that\nnot only the two steerabilities ζ_m_1|m_2 and ζ_m_2|m_1 but also the entanglement E_N^m-m are strongly\nsensitive to the frequencies of the two mechanical modes. Moreover, it can\nbe seen that when the value of the frequency of mirror-2 is greater than the\nmirror-1, the region for the one-way (two-way) steering gets broaden\n(shorten). \n\nOne-way (OW) control. As we discussed, the steerability and\nentanglement between the rotational modes are sensitive to their\nfrequencies. We observe that when the two rotational modes are about to\nsynchronize, i.e., the ratio of the frequency of the two rotating mirrors\napproaches unity, the two-way steering completely vanishes. Furthermore,\nFigure 7(a) and 7(d) present a fascinating situation where the states of the\ntwo rotational modes are entangled; though they show steerability in one\ndirection, which indicates the perfect asymmetry of quantum correlations\n(one-way steering). Such an asymmetry of quantum correlations describes that\nboth Alice and Bob can execute the same Gaussian measurements on their side\nof the entangled system, however, they find completely different results.\nOne-way steering can be explained by the steering asymmetry introduced in\nEq. (<ref>). Figure 7(a) and 7(d) clearly show that one-way steering\ncan be observe until ω_ϕ_2/ω_ϕ_1=0.9 or ω_ϕ_2/ω_ϕ_1=1.1. The one-way steering has been\nexperimentally realized in <cit.> and imparts one-side device\nindependent quantum key distribution (QKD). However, we observe no-way\nsteering when ω_ϕ_2/ω_ϕ_1≃0.95 or ω_ϕ_2/ω_ϕ_1≃1.05. Furthermore, when the two\nrotating mirrors rotate with exactly the same frequency (complectly\nsynchronize), even the entanglement between rotating mirrors completely\ncease to exist (not shown).\n\nEffect of Parametric Gain and Phase on quantum steering. Finally,\nthe degree of entanglemnt entanglement and dynamics quantum steering can be\nstudied under influence of the parametric gain for different value of phase\nas shown in Figure 8 around the optimum value of the cavity detuning. Firstly,\nit can be seen in Figure 8. that quantum steering remains upper bounded by the\nentanglement irrespective of which rotational mirror has higher frequency.\nFigure 8 (a-d) shows that with gradual increase of the parametric gain, the\ntwo rotational modes exhibit two-way steering except the case when θ=π/2, where two-way steering converts to one-way steering around χ/ω_ϕ_1=0.13. This is because we obtained reduced\nentanglement at this parametric phase (can be seen in Figure 2(a)). The same\nsituation can also be observe in lower panel of Figure 8, where the one-way\nsteering vanishes around χ/ω_ϕ_1=0.16. Owing to the gradual\nenhancement of entanglement for θ=3π/2, one-way steering converts\nto two-way steering for large value of parametric gain. Hence, the current\nscheme may provide motivation for handling quantum steering in two\nrotational cavity optomechanical system.\n\n\n\n\n\n§ EXPERIMENTAL IMPLEMENTATIONS\n\n\n The parameters for the current scheme is given in Table. 1.\nKeeping these parameters in mind, we now talk about the feasibility of the\ncurrent two rotating system based on the recent experiments. In recent\nexperiment, the value of the angular momentum is taken very high because it\ncan easily be realizable via spiral phase elements. In addition, the\nazimuthal structure of beam of light can be altered via transmission or\nreflection from the spiral phase elements <cit.>. It is shown that low\nmass of the rotational mirrors with high precision can be well fabricated.\nFuthermore, topological charge of the LG laser beams can be taken as high as\n1000 <cit.>. With the fast growing nanotechnology, the mechanical\noscillators, with low effective mass (m=37pg), high-quality factor (Q_m=10^8) and and high frequency (a few MHz), has been experimentally\nreported <cit.>. This implies that the current system is an\nexperimentally feasible system under the present-day technology.\n\n\n\n§ CONCLUSIONS\n\n\n We have presented an efficient and effective method for\nimproving the entanglement and one-way (two-way) steering characteristics of\ntwo rotating mirrors in a Laguerre-Gaussian (LG) rotating cavity, which\ncomposed of two rotational mirrors coupled to a cavity via orbital angular\nmomentum exchange and an optical parametric amplifier (OPA) driven by\ncoherent light. We have shown that the frequencies of two rotational mirrors\nplay a vital role in modulating the entanglement and controlling the quantum\nsteering. For example, when ω_ϕ2=0.5ω_ϕ1 (ω_ϕ2=1.5ω_ϕ1), the steerability of two mirrors is\nenhanced as compared to the case when the two mirrors are near to\nsynchronized, that is, near the resonance frequency, two-way steering\nconverts to one-way steering (or no-way steering) with a reduced degree of\nentanglement. It is interesting to mention that the switch from two-way\nsteering to one-way (or no-way) steering is practicable by changing the frequencies of two rotational mirrors,\nparametric gain and phase. Hence, we argued that the steering directivity in the current scheme would\nsupport understanding the quantum correlation and may have major applications in one-way (two-way) quantum computing, quantum secret sharing, and quantum key distribution.\n\n\n§ DATA AVAILABILITY\n\nAll numerical data that support the findings in this study is available within the article\n\n\n\n\n\n\n\n\n\n\n99\nent E. Schrodinger, Proc. Cambridge Philos. Soc. 1935, 31(4), 555.\n\nent1 R. Horodecki, P. Horodecki, M. Horodecki, K. Horodecki, Rev. Mod. Phys. 2009, 81, 865.\n\nent2 M. A. Nielson and I. L. Chuang, Quantum Computation and Quantum Information (Cambridge University, 2000, pp. 558-559.\n\ntele X. M. Jin, et. al. Nat. Photon 2010, 4(6), 376 381.\n\nram R. ul-Islam, M. Ikram, R. Ahmed, A. H. Khosa, F. Saif, J. Mod. Opt. 2009, 56, 875.\n\nalgo A. M. Childs, W. Van Dam, Rev. Mod. Phys. 2010, 82, 148.\n\ncomp Andrew Steane, Rep. Prog. Phys. 1998, 61, 117.\n\nmicro C. A. Sackett, et. al. Nature 2000, 404, 256.\n\nmicro1 H. HÃffner, et. al. Nature 2005, 438, 643.\n\nmicro2 X. C. Yao, et. al. Nat. Photonics 2012, 6, 225.\n\nsup A. J. Berkley, et. al. Science 2003, 300, 1548.\n\natom H. Krauter, C. A. Muschik, K. Jensen, W. Wasilewski, J. M. Petersen, J. I. Cirac, E. S. Polzik, Phys. Rev. Lett. 2011, 107, 080503.\n\ndiam K. C. Lee, et. al. Science 2011, 334, 6060.\n\nepr A. Einstein, B. Podolsky, N. Rosen, Phys. Rev. 1935, 47, 777.\n\nbell J.S. Bell, Physics 1964, 1, 195.\n\nbell1 J.F. Clauser, M.A. Horne, A. Shimony, R.A. Holt, Phys. Rev. Lett. 1969, 23, 880.\n\nbell2 A. Aspect, P. Grangier, G. Roger, Phys. Rev. Lett. 1982, 49, 91.\n\nsch E. Schrodinger, Math. Proc. Cambridge Philos. Soc. 1935, 31, 555.\n\nsch1 E. Schrodinger, Proc. Camb. Phil. Soc.1936, 32, 446.\n\ndir H.M. Wiseman, S. J. Jones, A.C. Doherty, Phys. Rev. Lett. 2007, 98, 140402.\n\nstee Q. Y. He, M. D. Reid, Phys. Rev. A 2013, 88, 052121.\n\nstee1 S. Kiesewetter, Q. Y. He, P. D. Drummond, and M. D. Reid, Phys. Rev. A 2014, 90, 043805.\n\nstee2 J. El Qars, M. Daoud, R. Ahl Laamara, Phys. Rev. A 2018, 98, 042115.\n\nopent3 A. Sohail, R. Ahmed, R. Zainab, Chang shui Yu, Phys. Scr. 2022, 97, 075102.\n\nopent4 A. Sohail, A. Hassan, R. Ahmed, C. S. Yu, Quant. Inf. Process. 2022, 21, 207.\n\nopent5 A. Sohail, R. Ahmed, A. Shahzad, M. A. Khan , Int. J. Theor. Phys. 2022, 61, 174.\n\nexp D. Cavalcanti, P. Skrzypczyk, G. H. Aguilar, R. V. Nery, P. H. S. Ribeiro, S. P. Walborn, Nat. Commun. 2015, 6, 7941.\n\nexp1 V. Händchen, T. Eberle, S. Steinlechner, A. Samblowski, T. Franz, R. F. Werner, R. Schnabel, Nat. Photon. 2012, 6, 596.\n\noms D. Vitali, S. Gigan, A. Ferreira, H. R. Böhm, P. Tombesi, A. Guerreiro, V. Vedral, A. Zeilinger, M. Aspelmeyer, Phys. Rev. Lett. 2007, 98, 030405.\n\noms2 C Doolin, et. al. New J. Phys. 2014, 16, 035001.\n\noms3 T J Kippenberg, et. al. New J. Phys. 2013, 15, 015019.\n\nfound M. Metcalfe, Appl. Phys. Rev 2014, 1, 031105.\n\nmeasure M. Aspelmeyer, T,.J. Kipenberg, F. Marquardt, Rev. Mod. Phys. 2013, 86, 1391.\n\nwig1 M. F. Alotaibi, E. M. Khalil , M. Y. Abd Rabbou,and M. Marin, Mathematics, 2022, 10, 4458.\n\nnaeem1 N. Akhtar, J. Wu, J X Peng, W M Liu, G Xianlong, 2023 arXiv:2301.00195.\n\nnaeem2 N. Akhtar, B. C. Sanders, G. Xianlong, Phys. Rev. A 2022, 106, 043704.\n\nnaeem3 N. Akhtar, H. Ullah, A. Omari, F. Saif, J. Russ. Laser Res. 2017, 38, 399.\n\nopent R. Ahmed , S. Qamar, Phys. Scr.2017, 92, 105101.\n\nopent1 A. Sohail, M. Rana, S. Ikram, T. Munir, T. Hussain, R. Ahmed, Chang-shui Yu, Quant. Inf. Proc.2020, 19, 372.\n\nopent2 A. Sohail, R. Ahmed, Chang Shui Yu, T. Munir, Phys. Scr. 2020, 95, 035108.\n\nSigJS S. K. Singh and C. H. Raymond Ooi, J. Opt. Soc. Am. B 2014, 31, 2390-2398\n\ncoh A. Mahdifar, W. Vogel, T. Richter, R. Roknizadeh, M. H. Naderi, Phys. Rev. A 2008, 78, 063814.\n\nsq A. Vinante, P. Falferi, Phys. Rev. Lett.2013, 111, 207203.\n\nSin A. Kundu, S. K. Singh, Int. J. Theor. Phys. 2019, 58, 2418-2427.\n\ncool S. Huang, Aixi Chen, Appl. Sci. 2019, 9(16), 3402.\n\nomit A. Sohail, R. Ahmed, Chang shui Yu, Int. J. Theor. Phys. 2021, 60, 739.\n\nomit1 A. Sohail, Z. Yang, M. Usman, Chang shui Yu, Eur. Phys. J. D 2017, 71, 103.\n\nomit2 Stefan Weis, et. al., Science 2010, 330, 1520.\n\nSn1 S. K. Singh, M. Asjad, C. H. Raymond Ooi, Quantum Inf Process 2022, 21, 47.\n\nSn2 S. K. Singh, et. al. Physics Letters A 2022, 442, 128181.\n\nbhatt M. Bhattacharya, P. Meystre, Phys. Rev. Lett. 2007, 99, 153603.\n\nbht M. Bhattacharya, P. L. Giscard, P. Meystre, Phys. Rev. Lett. 2008, 77, 030303.\n\nbhatt1 M. Bhattacharya, P. L. Giscard, P. Meystre, Phys. Rev. A 2008, 77, 013827.\n\npeng J. X. Peng, Z. Chen, Q. Z. Yuan, X. L. Feng, Phys. Rev. A 2019, 99, 043817.\n\nXHYM X. Hao, Y. M. Huang, Y. Wu Phys. Rev. A 2021, 103, 043506.\n\nQingL L. Qinghong, J. Sun, Z. Liu, W. Bao, Int. J. of Theor. Phys. 2022, 61, 150.\n\npeng3 J. X. Peng, Z. Chen, Q. Z. Yuan, X. L. Feng, Phys. Lett. A 2020, 384, 126153.\n\nYXW Y Xu, W Liu, Journal of Lightwave Technology, 2022.\n\nZAAK Ziauddin, A. A. Khan, A. Yar, M. Abbas, Eur. Phys. J. Plus 2022 137, 1203.\nRao Shi Rao, Y. Huang, Eur. Phys. J. D 2020, 74, 233.\nQioP Q. Pan, W. Lv, D. Li, S. Huang, A. Chen, Nanomaterials 2022, 12, 3701.\n\npeng1 Z. Chen, J. X. Peng, J. J. Fu, X. L. Feng, Opt. Express 2019, 27, 029479.\n\npeng2 H. J. Cheng, S. J. Zhou, J. X. Peng, A. Kundu, H. X. Li, L. Jin, X. L. Feng, J. Opt. Soc. Am. B 2021, 38, 285.\n\nSingh S. K. Singh, J. X. Peng, M. Asjad, M. Mazaheri, J. Phys. B: At. Mol. Opt. Phys. 2021, 54, 215502.\n\nFWK F. Wang, K. Shen, J. Xu, New J. Phys. 2023, 24, 123044.\n\nhuang S. Huang, Li Deng, Aixi Chen, Ann. Phys. (Berlin)2022, 534, 2200171.\n\nASRA Amjad Sohail, R. Arif, N. Akhtar, Ziauddin, J. X. Peng, Gao Xianlong, ZhiDong Gu, 2023 arXiv:2301.06979v1\n\n11 C. Santori, et. al., Phys. Rev. Lett. 2006, 97, 247401.\n\nRHC E. X. DeJesus, C. Kaufman, Phys. Rev. A 1987, 35, 5288.\n\nCWSP C. Weedbrook, et. al., Rev. Mod. Phys. 2012, 84, 621.\n\nAdesso Adesso, G., Illuminati, F. J. Phys. A 2007, 40, 7821.\n\nAdesso2 G. Adesso, F. Illuminati. New J. Phys. 2006, 8, 15.\n\nCoffman Coffman, V., Kundu, J., Wootters, W. K. Phys. Rev. A 2000, 61, 052306.\n\nSYC Y. Shen, G. T. Campbell, B. Hage, H. Zou, B.C. Buchler, P. K. Lam , J. Opt. 2013, 15, 044005.\n\nKHG H. Kaviani, R. Ghobadi, B. Behera, M. Wu, A. Hryciw, S. Vo, D. Fattal, P. Barclay, Opt. Express 2020, 28, 15482.\n\n\n"}