{"entry_id": "http://arxiv.org/abs/2303.06682v2", "published": "20230312145704", "title": "DDS2M: Self-Supervised Denoising Diffusion Spatio-Spectral Model for Hyperspectral Image Restoration", "authors": ["Yuchun Miao", "Lefei Zhang", "Liangpei Zhang", "Dacheng Tao"], "primary_category": "cs.CV", "categories": ["cs.CV", "eess.IV"], "text": "\n\t\n\t\n\t\n\t\n\t\n\nDDS2M: Self-Supervised Denoising Diffusion Spatio-Spectral Model for Hyperspectral Image Restoration\n    Yuchun Miao^1 Lefei Zhang^1Corresponding Author Liangpei Zhang^2 Dacheng Tao^3,4 \n\n\t\t^1School of Computer Science, Wuhan University\n\n\t\t^2 State Key Lab. of Information Engineering in Surveying, Mapping and Remote Sensing, Wuhan University\n\n\t\t^3JD Explore Academy\n\n    \t^4School of Computer Science, University of Sydney\n\n\n\t\t{miaoyuchun, zhanglefei, zlp62}@whu.edu.cn, dacheng.tao@gmail.com\n\t\t\n\t\t\n\t\n\t\n\t\n\t\n    March 30, 2023\n=======================================================================================================================================================================================================================================================================================================================================================================================================================\n\n\nempty\n\n\n\n\n\tDiffusion models have recently received a surge of interest due to their impressive performance for image restoration, especially in terms of noise robustness. However, existing diffusion-based methods are trained on a large amount of training data and perform very well in-distribution, but can be quite susceptible to distribution shift. This is especially inappropriate for data-starved hyperspectral image (HSI) restoration. To tackle this problem, this work puts forth a self-supervised diffusion model for HSI restoration, namely Denoising Diffusion Spatio-Spectral Model (), which works by inferring the parameters of the proposed Variational Spatio-Spectral Module (VS2M) during the reverse diffusion process, solely using the degraded HSI without any extra training data. In VS2M, a variational inference-based loss function is customized to enable the untrained spatial and spectral networks to learn the posterior distribution, which serves as the transitions of the sampling chain to help reverse the diffusion process. Benefiting from its self-supervised nature and the diffusion process,  enjoys stronger generalization ability to various HSIs compared to existing diffusion-based methods and superior robustness to noise compared to existing HSI restoration methods. Extensive experiments on HSI denoising, noisy HSI completion and super-resolution on a variety of HSIs demonstrate 's superiority over the existing task-specific state-of-the-arts.\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\n\n\n\nAs a new trendy generative model, diffusion models <cit.> have attracted significant attention in the community owing to their state-of-the-art performance in image synthesis <cit.>. In essence, diffusion model is a parameterized sampling chain trained using a variational bound objective, which is equivalent to that of score-based models <cit.>. After training, samples are generated by the sampling chain, starting from white noise and gradually denoising to a clean image.\n\nRemarkably, diffusion models can go beyond image synthesis <cit.>, and have been widely utilized in image restoration tasks, such as super-resolution <cit.>, inpainting <cit.>, denoising <cit.>, and so on. Among these methods,  <cit.>, a diffusion-based image restoration framework, has achieved powerful robustness to noise, which is also noteworthy for hyperspectral images (HSIs). HSIs often suffer from noise corruption due to the limited light, photon effects, and atmospheric interference <cit.>. This motivates us to inherit the powerful noise robustness of  <cit.> to HSI restoration by capitalizing on the power of diffusion model for HSI restoration.\n\n\n\n\nHowever, harnessing the power of the diffusion model for HSI restoration is challenging. The bottleneck lies in the poor generalization ability to HSIs in various scenarios. Existing diffusion-based methods are excessively dependent on the adversity and quantity of the training data, and often focus on a specific domain, such as the face. As a result, these methods may perform very well in-distribution, but can be quite susceptible to distribution shifts, resulting in degraded performance. This is particularly inappropriate for data-poor applications such as HSI restoration, where very limited HSIs are available for training <cit.>. This is because HSIs are much more expensive to acquire in real-world scenarios, compared to natural RGB images. In addition, different sensors often admit large different specifications, such as the frequency band used, the spatial and spectral resolution. Therefore, a diffusion model trained on HSIs captured by one sensor may not be useful for HSIs captured by other sensors. In addition to the generalization ability issues mentioned above, how to leverage the intrinsic structure of HSIs is also critical for harnessing the power of the diffusion model for HSI restoration. Bearing the above concerns in mind, an effective diffusion model tailored for HSI restoration, which is able to generalize to HSIs in various practical scenarios and leverage the intrinsic structure of HSIs, is highly desired.  \n\n\n\n\n\nTo address the generalization ability problem mentioned above, one remedy is to use the emerging untrained neural networks, such as those in <cit.>. These methods learn a generative neural network directly from a single degraded image, rather than from a large volume of external training data. The rationale is that an appropriate neural network architecture, without training data, could already encode much critical low-level image statistical prior information. Owing to their training data-independent nature, untrained networks can usually generalize well to the wild data. Meanwhile, due to our need to flexibly cope with various HSIs in real scenarios, untrained networks are rendered as a natural choice. In addition, their powerful expressiveness allows the deployment of such untrained networks in the diffusion models for HSI restoration.\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\n\n\nIn this work, we put force a self-supervised Denoising Diffusion Spatio-Spectral Model (), which can cleverly alleviate the generalization ability problem, while exploiting the intrinsic structure information of the underlying HSIs.  is a denoising diffusion generative model that progressively and stochastically denoises samples into restored results conditioned on the degraded HSI and the degradation model after a finite time. Unlike existing diffusion models <cit.>, which use a neural network pre-trained a large number of training data,  reverses the diffusion process by virtue of the proposed Variational Spatio-Spectral Module (VS2M), solely using the degraded HSI without any extra training data; see Figure <ref> for visual comparison with  <cit.>. \n\n\n\n\n\nSpecifically, the proposed VS2M consists of two types of untrained networks (i.e., untrained spatial and spectral networks) and a customized variational inference-based loss function. The untrained spatial and spectral networks leverage the intrinsic structure of HSIs by modeling the abundance maps and endmembers derived from the linear mixture model <cit.>, respectively. The variational inference-based loss function is customized to enable these untrained networks to learn the posterior distribution of the task at hand. The specific contributions of this work are summarized as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n∙\nWe propose a self-supervised Deep Diffusion Spatio-Spectral Model (). Benefiting from its diffusion process and self-supervised nature,  enjoys stronger robustness to noise relative to existing HSI restoration methods and superior generalization ability to various HSIs relative to existing diffusion-based methods. To the best of our knowledge,  is the first self-supervised diffusion model that can restore HSI only using the degraded HSI without any additional training data. \n\n∙ \nWe design a variational spatio-spectral module (VS2M) to help reverse the diffusion process, which serves as the transitions of the sampling chain. VS2M is capable of approximating the posterior distribution of the task at hand by leveraging the intrinsic structure of the underlying HSI.\n\n\n\n∙ \nExtensive experiments on HSI denoising, noisy HSI completion and super-resolution illustrate the superiority of  over the existing task-specific state-of-the-arts, especially in terms of the robustness to noise, and the generalization ability to HSIs in diverse scenarios.\n\n\n\n\n\n\n\n\n\n§ RELATED WORKS\n\n\n\n §.§ HSI Restoration Methods\n\nHSI restoration is a long-standing problem with a wide range of applications, with model-based approaches dominating the early years <cit.>. Recently, triggered by the expressive power of deep neural networks, a plethora of supervised <cit.> and self-supervised methods <cit.> were developed.\n\n\n\n\n\nThe supervised methods mainly concentrate on exploring different neural network architectures to learn a mapping from a degraded HSI to the ground truth, such as convolution neural network <cit.>, recurrent neural network <cit.>, and transformer <cit.>. The main bottleneck of these supervised methods is that their performance is limited by the adversity and amount of training data, and is often susceptible to distribution outliers. In contrast, our  is not affected by such distribution outliers, since no extra training data is required in .\n\n\n\n\n\n\nAmong the self-supervised methods, a representative family is the untrained neural network-based methods <cit.>. As a promising tool for image restoration, untrained neural networks enjoy the expressive power of neural networks yet do not require additional training data <cit.>. Ulyanov et al. <cit.> first extended untrained neural network from RGB images to HSIs, putting forth a self-supervised HSI restoration framework. Then, Luo et al. <cit.> further proposed a spatio-spectral constrained untrained neural network. Inspired by these methods, Meng et al. <cit.> integrated untrained neural network into the plug-and-play regime <cit.>. In general, these methods learn a generator network directly from the degraded HSI in an iterative scheme. The critical drawback of these methods is that they easily accumulate errors inevitable in the iterative process, being quite fragile to degraded HSI with significant noise. Although our proposed  is also a multi-step generation process, it does not suffer from such accumulated errors. This is because diffusion-based methods have systematic mathematical formulation, and the errors in the intermediate step can be regarded as noise, which could be refined during the diffusion process <cit.>. Therefore, as compared with the above untrained network-based methods, our  is able to decently restore high-quality HSIs from the degraded HSI corrupted by noise.\n\n\n\n\n\n §.§ Diffusion Models for Image Restoration\n\nRecent emerged diffusion models have been widely utilized in image restoration. One branch of these works mainly focuses on tailoring a diffusion model suitable for a specific task, often leading to remarkable performance at the expense of flexibility across different tasks; see <cit.>. Another branch is concerned with tailoring a diffusion model that can be flexibly applied to different tasks; see <cit.>. To achieve this, these methods leave the training procedure intact, and only modify the inference procedure so that one can sample the restored image from a conditional distribution related to the task at hand. Among them, a representative method is  <cit.>, which achieves promising performance in multiple useful scenarios, including denoising, noisy super-resolution, and noisy completion, especially in terms of the robustness to noise. \n\nHowever, the main shortcoming of these diffusion-based methods is their generalization ability to the wild data. These methods excessively depend on the adversity and amount of training data, and may perform very well in-distribution, but can be quite susceptible to distribution shifts, sometimes resulting in severely degraded performance. This becomes more problematic for data-poor applications such as HSI restoration. In this work, we aim to inherit the advantage of diffusion model (i.e., noise robustness) to HSI restoration, and boost its generalization ability to HSIs in practical scenarios.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ NOTATIONS AND PRELIMINARIES\n\n\n\n §.§ Notations\n\nA scalar, a vector, a matrix, and a tensor are denoted as x, x, X, and 𝒳, respectively. x^(i), X^(i,j), and 𝒳^(i,j,k) denote the i-th, (i,j)-th, and (i,j,k)-th element of 𝐱∈ℝ^I, 𝐗∈ℝ^I× J, and 𝒳∈ℝ^I× J× K, respectively. The Frobenius norms of x are denoted as x_F=√(∑_ix^(i)x^(i)). Given 𝐲∈ℝ^N and a matrix 𝐗∈ℝ^I× J, the outer product is defined as 𝐗∘𝐲. In particular, 𝐗∘𝐲∈ℝ^I× J× N and (𝐗∘𝐲)^(i,j,n) = 𝐗^(i,j)𝐲^(n). The vec(𝐗) operator represents vec(𝐗)=[𝐗^(:,1);…;𝐗^(:,J)] ∈ℝ^IJ, and vec(𝒳) is further defined as vec(𝒳) = [ vec(𝒳^(:,:,1));…; vec(𝒳^(:,:,K))] ∈ℝ^IJK. \n\n\n\n §.§ Degradation Model\n\nThe goal of HSI restoration is to recover a HSI from potentially noisy degraded HSI given through a known linear degradation model. In general, HSI restoration can be formulated as\n\n    𝐲 = 𝐇𝐱 + 𝐳,\n\nwhere 𝐱∈ℝ^n is the vector version of the original HSI 𝒳 defined as 𝐱 =  vec(𝒳), 𝐲∈ℝ^m is corresponding to the degraded HSI 𝒴 defined as 𝐲 =  vec(𝒴), 𝐇  is the degradation matrix that depends on the restoration task at hand, and 𝐳∼𝒩(0, σ_𝐲^2 I) represents an i.i.d. additive Gaussian noise with standard deviation σ_𝐲. It is worth noting that in this work, following previous diffusion-based methods <cit.>, 𝐱 and 𝐲 in Eqn. (<ref>) are all scaled linearly to the range of [-1, 1], which ensures the neural network to operate on consistently scaled inputs during the reverse diffusion process. Therefore, when they are linearly scaled back to the range of [0, 1], the standard deviation of the Gaussian noise becomes σ=0.5σ_y.\n\n\n\n\n\n§ DENOISING DIFFUSION SPATIO-SPECTRAL MODELS\n\n\nIn this section, we introduce the proposed . The key idea behind  is to reverse the diffusion process solely using the degraded HSI without extra training data, with the help of the proposed VS2M. We first give an introduction to the diffusion process for image restoration, then describe our design in VS2M, and finally elaborate on the VS2M-aided reverse diffusion process.\n\n\n\n\n\n §.§ Diffusion Process for Image Restoration\n\nDiffusion models for image restoration are generative models with Markov chain 𝐱_T →𝐱_T-1→…→𝐱_1 →𝐱_0 conditioned on 𝐲 <cit.>, which has the following marginal distribution equivalent to that in <cit.>: \n\n    q(𝐱_t | 𝐱_0)=𝒩(𝐱_t ; √(α̅_t)𝐱_0,(1-α̅_t) 𝐈)\n\nwith\n\n    α_t=1-β_t,   α̅_t=∏_i=0^t α_i,\n\nwhere 𝐱_0 and 𝐲 are the vector version of high-quality HSI 𝒳 and degraded  HSI 𝒴, and β_t is a hyperparameter. The forward process (i.e., diffusion process ) progressively injects Gaussian noise to the original data 𝐱_0 and obtains 𝐱_T that looks indistinguishable from pure Gaussian noise, while the reverse diffusion process samples a slightly less noisy image 𝐱_t from 𝐱_t+1 by leveraging the forward process posterior distribution q(𝐱_t | 𝐱_t+1, 𝐱_0, 𝐲). More details can be found in the supplementary materials. \n\nIn , denoising is performed using a network pre-trained on a large number of additional training data like other diffusion models <cit.>, which perform well in-distribution, and can be susceptible to distribution shift. This is especially inappropriate with data-starved HSI restoration. In this work we break this routine and propose to reverse the diffusion process utilizing the VS2M that can perform denoising solely using the degraded image without any extra training data.\n\n\n\n §.§ Variational Spatio-Spectral Module (VS2M)\n\nThe VS2M utilized in  consists of untrained spatial and spectral networks, and a variational inference-based loss function. The untrained spatial and spectral networks are capable of leveraging the intrinsic structure of HSIs using designated network structures. The variational inference-based loss function is customized to enable these untrained networks to learn the posterior distribution. In this way, the untrained networks and the diffusion model can be incorporated to achieve promising performance.\n\n\n\nUnder VS2M, HSI 𝒳∈ℝ^I× J× K is represented as:\n\n    𝒳 = ∑_r=1^R 𝐒_r ∘𝐜_r,\n\nwhere 𝐜_r∈ℝ^K and 𝐒_r∈ℝ^I× J  represent the r-th endmember and the r-th endmember's abundance map, respectively, and R is the number of endmembers contained in the HSI. More details about the decomposition in Eqn. (<ref>) can be found in the supplementary materials. Here we introduce the untrained network architecture and the variational inference-based loss function individually.\n\nUntrained Network Architecture.\nThe physical interpretation of  𝐒_r and 𝐜_r makes it possible to utilize certain untrained networks to model these factors. Specifically, untrained U-Net-like “hourglass“ architecture in <cit.> and untrained full-connected networks (FCNs) are employed for abundance map modeling and endmember modeling, since abundance maps reveal similar qualities of the nature images <cit.> and the endmembers can be regarded as relatively simple 1D signals, as was done in <cit.>. Following this perspective, we model the HSI 𝐱∈ℝ^IJK  as follows:[Actually, The parameters of the r U-Nets are independent of each other, as are the parameters of the r FCNs. In order to simplify notations, here we use θ and ζ to represent {θ_r}_r=1^R and {ζ_r}_r=1^R, respectively. ] \n\n    𝐱 =  vec(𝒳) =   vec(∑_r=1^R  S_θ(𝐳_r) ∘ C_ζ(𝐰_r )),\n\n\n\n\nwhere S_θ(·):ℝ^N_a→ℝ^I× J is the untrained U-Net-like network for abundance map generation, and θ collects all the corresponding network weights; similarly, C_ζ(·):ℝ^N_s→ℝ^K and ζ denote the untrained FCN for endmember generation and the corresponding network weights, respectively; the vectors 𝐳_r∈ℝ^N_a and 𝐰_r∈ℝ^N_s are low-dimensional random vectors that are responsible for generating the r-th abundance map and endmember respectively. 𝐳_r and 𝐰_r are randomly initialized but fixed during the optimization process. It is worth noting that, instead of directly using the vanilla U-Net structure for abundance map modeling, we propose to introduce the attention mechanism <cit.> into the U-Net, which aims to enhance the self-supervised expression ability of the VS2M. The concrete structure of the untrained spatial and spectral networks is illustrated in the supplementary materials.\n\nVariational Inference-based Loss Function.\nWe aim to estimate high-quality HSI 𝐱_0  using the aforementioned untrained spatial and spectral networks, and update their parameters at every reverse process step. Denoting {θ_t, ζ_t } as the parameters at step t, we first define a learnable generative process p_θ_t,ζ_t(𝐱_t | 𝐱_t+1,𝐲) by replacing the 𝐱_0 in q(𝐱_t | 𝐱_t+1, 𝐱_0, 𝐱) with 𝐱_θ_t,ζ_t, i.e.,  \n\n    p_θ_t,ζ_t(𝐱_t | 𝐱_t+1,𝐲) ≜ q(𝐱_t | 𝐱_t+1, 𝐱_θ_t,ζ_t, 𝐲),\n\nwhere  𝐱_θ_t,ζ_t denotes the vector version of the estimated HSI at reverse process step t, i.e.,\n\n    𝐱_θ_t,ζ_t =  vec(∑_r=1^R  S_θ_t(𝐳_r) ∘ C_ζ_t(𝐰_r ))\n \nThe goal of  is to find a set of parameters {θ_t, ζ_t} to make p_θ_t,ζ_t(𝐱_t | 𝐱_t+1,𝐲) as close to q(𝐱_t | 𝐱_t+1, 𝐱_0,𝐲) as possible, by maximizing the \nvariational lower bound of the log likelihood objective:\n\n    𝔼_q(𝐱_0), q(𝐲|𝐱_0)[log p_θ, ζ(𝐱_0 | 𝐲)] \n    ≥   𝔼_q(𝐱_0:T), q(𝐲|𝐱_0)[log p_θ, ζ(𝐱_0:T | 𝐲) - log q (𝐱_1:T|𝐱_0,𝐲)].\n\n\n\n\n\n\n\n\nNotably, the objective in Eqn. (<ref>) can be reduced into a denoising objective, i.e., estimating the underlying high-quality HSI 𝐱_0 from the noisy 𝐱_t (please refer to the supplementary materials for derivation). By reparameterizing Eqn. (<ref>) as \n\n\n    𝐱_t(𝐱_0, ϵ)=√(α̅_t)𝐱_0+√(1-α̅_t)ϵ     for ϵ∼𝒩(0, 𝐈),\n\nour variation inference-based loss function can be designed as follows:\n\n    min_{θ, ζ} 𝐱_t  -  vec(√(α̅_t)∑_r = 1^R  S_θ (𝐳_r) ∘ C_ζ(𝐰_r))_F^2.\n\n\n\n\nIntuitively, given a noisy observation 𝐱_t+1, after optimizing {θ_t,ζ_t } from 𝐱_t+1 via Eqn. (<ref>) using the Adam <cit.>, 𝐱_θ_t,ζ_t can be derived via Eqn. (<ref>), and then 𝐱_t could be sampled from p_θ_t,ζ_t(𝐱_t | 𝐱_t+1,𝐲) defined in Eqn. (<ref>). In this way, the diffusion process could be reversed in a self-supervised manner with no need for extra training data.\n\n\n\n\n\n\n\n §.§ VS2M-Aided Reverse Diffusion Process\n\nGiven a degradation matric 𝐇∈ℝ^m × n, its singular value decomposition is posed as:\n\n    𝐇 = 𝐔Σ𝐕^𝖳,\n\nwhere 𝐔∈ℝ^m × m, 𝐕∈ℝ^n × n are orthogonal matrices, and Σ∈ℝ^m × n is the rectangular diagonal matrix consisting of the singular values denoted as s_1 ≥ s_2 ≥…≥ s_n. \nThe idea behind this is to tie the noise in the degraded signal 𝐲 with the diffusion noise in 𝐱_1:T, ensuring that the diffusion result 𝐱_0 is faithful to the degraded signal 𝐲 <cit.>.\n\nBefore illustrating the reverse diffusion process in detail, we first rethink the difference between our  and other diffusion-based methods <cit.> to guide the design of the reverse diffusion process. The main difference is how 𝐱_0 is predicted from 𝐱_t at each reverse step. In <cit.>, a denoising network is trained on a large amount of additional training data to predict 𝐱_0. By exploiting the external prior knowledge, this network could produce satisfactory 𝐱_0 even if 𝐱_t looks like pure Gaussian noise. Because of this, such a denoising network could work during the whole reverse diffusion process. However, it is difficult for untrained networks to produce a satisfactory image by denoising an image that is almost pure Gaussian noise. Therefore, starting inference from pure Gaussian is unsuitable for our .\n\n\nFollowing the above argument, we propose to start inference from a single forward diffusion with better initialization, instead of starting from pure Gaussian noise <cit.>. Specifically, we first perturb the degraded HSI 𝐲 via the forward diffusion process up to t_0 < T, where t_0 denotes the step that the reverse diffusion process starts from. \nDenoting 𝐱̅^(i) as the i-th index of vector 𝐱̅_t=𝐕^𝖳𝐱_t, 𝐲̅^(i) as the i-th index of 𝐲̅=Σ^†𝐔^𝖳𝐲,  and 𝐱̅_θ_t, ζ_t^(i) as the i-th index of 𝐱̅_θ_t, ζ_t = 𝐕^𝖳𝐱_θ_t, ζ_t, for all t < t_0, the variational distribution is defined as:\n\n    p_θ_t_0,ζ_t_0(𝐱̅_t_0^(i) | 𝐲) = 𝒩(𝐲̅^(i), σ_t_0^2-σ_y^2/s_i^2)     if  s_i>0 \n    𝒩(0, σ_t_0^2)     if  s_i=0\n\n\n    p_θ_t,ζ_t(𝐱̅_t^(i) | 𝐱_t+1, 𝐲)= \n       𝒩(𝐱̅_θ_t,ζ_t^(i)+√(1-η^2)σ_t 𝐱̅_t+1^(i)-𝐱̅_θ_t,ζ_t^(i)/σ_t+1, η^2 σ_t^2)     if  s_i=0 \n    𝒩(𝐱̅_θ_t,ζ_t^(i)+√(1-η^2)σ_t 𝐲̅^(i)-𝐱̅_θ_t,ζ_t^(i)/σ_𝐲 / s_i, η^2 σ_t^2)     if σ_t<σ_𝐲/s_i\n    𝒩((1-η_b) 𝐱̅_θ_t,ζ_t^(i)+η_b 𝐲̅^(i), σ_t^2-σ_𝐲^2/s_i^2η_b^2)     if σ_t ≥σ_𝐲/s_i\n\nwhere σ_t depending on the hyperparameter β_1:T  denotes the variance of diffusion noise in 𝐱_t, and η, η_b are the hyperparameters, which control the level of noise injected at each timestep. Once 𝐱̅_θ_t, ζ_t is sampled from Eqn. (<ref>), it is easy to obtain 𝐱_θ_t, ζ_t exactly by left multiplying 𝐕. And the values of the parameters {θ_t_0, ζ_t_0} are randomly initialized.\n\nIt is worth noting that the parameter updating (i.e, {θ, ζ}) and the reverse diffusion process are iteratively performed. The parameter values of each reverse diffusion step are inherited from the previous step, thus the parameters can be updated continuously during the reverse diffusion process. This reverse diffusion process is summarized in Algorithm <ref>.\n\n\n\n\n§ EXPERIMENTS\n\n\n\n §.§ Comparisons with State-of-the-Arts\n\nIn this paper, our interest lies in inheriting the 's powerful robustness to noise (which is unavoidable in the hyperspectral imaging process) to HSI restoration. Herein we mainly consider noisy HSI completion, HSI denoising, and noisy HSI super-resolution, and compare the proposed  with the existing task-specific state-of-the-arts. Two frequently used evaluation metrics, namely, peak signal-to-noise ratio (PSNR) and structure similarity (SSIM), are adopted to evaluate the results. In general, better performance is reflected by higher PSNR and SSIM values. In , T is set as {3000, 1000, 1000}  for noisy HSI completion, HSI denoising, and noisy HSI super-resolution, respectively, and the step t_0 to start reverse the diffusion process is set as T/2. We use η=0.95, η_b=1, and linearly increase β_1:T in which β_1=10^-4 and β_T = {2×10^-3, 5×10^-3}. The variance σ_t is set as a constant σ_t = 1-α̅_t-1/1-α̅_tβ_t  for all experiments. The number of endmembers R is selected from {5, 10}. As for diffusion-based restoration methods  <cit.> and  <cit.>, the diffusion model in them is trained on a large-scale remote sensing imagery dataset AID <cit.> containing ten thousands of scene images, and HSI restoration is performed in a channel-by-channel manner. All of the compared methods' parameters are set as suggested by the authors, with parameter fine-tuning efforts to uplift their performance. For implementation details, parameters sensitivity analysis, and inference time analysis, please refer to the supplementary materials. \n\n\n\n  §.§.§ Datasets and Compared Methods\n\nNoisy HSI Completion. The noisy HSI completion aims at recovering the underlying HSI from the noisy incompleted observation. We adopt a wide range of HSIs to conduct the experiments, including 32 natural HSIs[<https://www.cs.columbia.edu/CAVE/databases/multispectral/>] (i.e., CAVE dataset <cit.>), and 3 remote sensing HSIs[<http://lesun.weebly.com/hyperspectral-data-set.html>] (i.e., WDC Mall, Pavia Centre, and Pavia University datasets). The sampling rates are set as {0.1, 0.2, 0.3}, and the standard deviation σ of Gaussian noise in the range of [0,1] is set as 0.1. The compared methods consist of seven model-based methods (i.e.,  <cit.>,  <cit.>,  <cit.>,  <cit.>,  <cit.>,  <cit.>, and  <cit.>), two unsupervised deep learning-based methods (i.e.,  <cit.> and  <cit.>), and two diffusion-based methods (i.e.,  <cit.> and  <cit.>).\n\n\nHSI Denoising. The HSI denoising aims at recovering the clean HSI from its noisy observation. The data adopted in this experiment is the same as that in HSI completion, including 32 natural HSIs and 3 remote sensing HSIs. Herein we mainly consider Gaussian noise, and the standard deviation of Gaussian noise σ in the range of [0,1] is set as {0.1, 0.2, 0.3}. The compared methods consist of six model-based methods (i.e.,  <cit.>,  <cit.>,  <cit.>,  <cit.>,  <cit.>, and  <cit.>), two unsupervised deep learning-based methods (i.e.,  <cit.> and  <cit.>), and a supervised deep learning-based method (i.e.,  <cit.>). Since the purpose of the comparison with supervised methods in this work is to highlight the generalization ability of our methods, we directly use the models of  trained on ICVL <cit.> with Gaussian noise provided by the authors.\n\n\nNoisy HSI Super-Resolution. The noisy HSI super-resolution aims at recovering high-resolution HSI from its noisy low-resolution counterpart. We adopt CAVE dataset <cit.> to conduct the experiments. The scale factor is set as ×2, ×4, and ×8, and the standard deviation of Gaussian noise σ in the range of [0,1] is set as 0.1. The compared methods include three supervised deep learning-based methods (i.e.,  <cit.>,  <cit.>, and  <cit.>), a model-based method (i.e.,  <cit.>), two unsupervised deep learning-based methods (i.e.,  <cit.> and  <cit.>), and a diffusion-based method (i.e.,  <cit.>). In order to comprehensively compare with supervised methods in terms of generalization ability to other datasets and other noise standard deviations, we train each supervised model under five different settings, i.e., CAVE without noise denoted as , CAVE with 0.1 Gaussian noise denoted as , CAVE  with 0.05 Gaussian noise denoted as , CAVE with 0.03 Gaussian noise denoted as , and Chikusei dataset <cit.> with 0.1 Gaussian noise denoted as *. Here  denotes the method name, i.e., , , and .\n\n\n\n\n\n  §.§.§ Experimental Results\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\nThe quantitative results of noisy HSI completion, HSI denoising, and noisy HSI super-resolution are reported in Tables <ref>, <ref>, and <ref>. We can observe that the proposed  outperforms existing model-based, unsupervised deep learning-based, and diffusion-based methods in all three tasks, while yielding competitive results with respect to the state-of-the-art supervised deep learning-based methods. Specifically, as compared with the diffusion-based method , our method offers average PSNR improvement of 5.878 dB, 5.909 dB, and 3.998 dB in completion, denoising, and super-resolution, respectively. This observation validates that  can more flexibly adapt to diverse HSIs in real scenarios. Additionally, in HSI super-resolution experiments, the supervised methods (i.e., , , and ) all perform best when trained with CAVE dataset with 0.1 Gaussian noise among the five different training settings, and their performance degrades significantly when trained with other noise levels or datasets. It is worth noting that, our  achieves comparable performance with the best version of these supervised methods, and outperforms the models trained with other settings. This demonstrates the superiority of our  against these supervised methods.   \n\n\n\n\n\n\n\n\n\n\nSome visual results for different tasks are shown in Figures <ref>, <ref>, and <ref>[In Figure <ref> (i.e., super-resolution), the best results of the supervised methods are shown.].  As observed, the proposed  is capable of preserving the most detailed information and demonstrating the best visual performance among the compared methods, which is consistent with its satisfactory performance in PSNR and SSIM. In addition, there is the least residual noise remaining in the results produced by , which demonstrates the superiority of  in terms of noise robustness. \n\nWe conjecture that such promising results can be attributed to the organic cooperation of untrained spatial and spectral networks and diffusion model, which is beneficial to the generalization ability to various HSIs and the robustness to noise.\n\n\n\n\n §.§ Ablation Study\n\nWe test the impact of untrained spatial and spectral networks, and diffusion process in . The compared methods are listed as follows:\n\n∙  without untrained spatial and spectral networks (dubbed DDS2M w/o untra.): To evaluate the impact of the untrained spatial and spectral networks,  we remove the untrained spatial and spectral networks, and use an untrained U-Net to directly generate the whole HSI.\n\n∙  without diffusion process (dubbed DDS2M w/o diffu.):  To clarify the influence of the diffusion process, we remove the diffusion process and make the untrained spatial and spectral networks directly fit the degraded HSI in an iterative scheme.\n\n\nWe consider HSI denoising (σ=0.3), noisy HSI completion (sampling rate=0.1, σ=0.1), and noisy HSI super-resolutin (scale factor=2, σ=0.1). HSI Fruits from the CAVE dataset is selected as an example. The results are shown in Table <ref>. We can observe that the untrained spatial and spectral networks, and the diffusion process could indeed significantly boost the restoration performance. More implementation details can be found in the supplementary materials. \n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\nThis work reveals a new insight on how to synergistically integrate existing diffusion models with untrained neural networks, and puts forth a self-supervised diffusion model for HSI restoration, namely Denoising Diffusion Spatio-Spectral Model (). By virtue of our proposed Variational Spatio-Spectral Module (VS2M), the diffusion process can be reversed solely using the degraded HSI without any extra training data. Benefiting from its self-supervised nature and diffusion process,  admits stronger generalization ability to various HSIs relative to existing diffusion-based methods and superior robustness to noise relative to existing HSI restoration methods.\n\n\n \n\nieee_fullname\n\t\n\n"}