{"entry_id": "http://arxiv.org/abs/2303.14101v1", "published": "20230312145535", "title": "Compton-Getting effect due to terrestrial orbital motion observed on cosmic ray flow from Mexico-city Neutron Monitor", "authors": ["Carlos Navia", "Marcel de Oliveira", "Andre Nepomuceno"], "primary_category": "astro-ph.HE", "categories": ["astro-ph.HE", "astro-ph.EP", "physics.space-ph"], "text": "\n\n\n\n\n\n\n\n\n\nInstituto de Física, Universidade Federal Fluminense, 24210-346, Niterói, RJ, Brazil \nC.E. Navia\ncarlos_navia@id.uff.br\n\n\nInstituto de Física, Universidade Federal Fluminense, 24210-346, Niterói, RJ, Brazil \n\n\n\n\n\n\n\nDepartamento de Ciências da Natureza, Universidade Federal Fluminense, 28890-000, Rio das Ostras, RJ, Brazil\n\n\n\n\nWe look for a diurnal anisotropy in the cosmic ray flow,\n using the Mexico-City Neutron Monitor (NM) detector, due to  the Earth's orbital motion and predicted by Compton-Getting (C-G) in 1935, as\na first-order relativistic effect. The Mexico-City NM's geographic latitude is not very high (19.33^∘N), and it has a high cutoff geomagnetic rigidity (8.2 GV) and mountain altitude (2274 m asl) favoring the observation of the C-G effect. \nFurthermore, during the solar cycle minima, the galactic cosmic ray flux is maxima, and the solar magnetic field gets weakened, with a dipolar pattern. Its influence on cosmic rays reaching Earth is the smallest.\nAnalysis of the combined counting rate during two solar minima,  2008 and 2019, from Mexico-city NM's data yields the C-G effect with an amplitude variation of (0.043± 0.019)%, and phase of (6.15± 1.71) LT. The expected amplitude variation is 0.044%, and the phase of 6.00  LT. \n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n \n\n\nThe observed particle distributions in two frames of reference in relative motion are different. For instance, if the particle distribution is isotropic in a given reference frame, it must have an anisotropy in a reference frame in relative motion to the previous one in the direction of movement. That effect is known as the Compton-Getting (C-G) effect <cit.>. \nThus, considering that galactic cosmic rays have an almost isotropic distribution into the heliosphere (as is expected during the solar cycle minima), it is expected an anisotropy in the daily distribution of cosmic ray intensity at Earth due to the Earth's orbital motion around the Sun. The cosmic ray intensity should be higher, coming from the direction the Earth is moving, i.e., around 06:00 LT <cit.>.\n\nHowever, as Earth's orbital velocity is relatively small, having an average value of 29.78 km/s, observation of the C-G effect requires high-energy cosmic particles to minimize distortions due to interplanetary magnetic field, the solar wind, and the Earth's magnetic field.\n\n\nThe Earth's orbital motion is measured using underground muon flux because underground muons come from galactic cosmic rays with high geomagnetic rigidity cutoff  (above 1000 GV). Indeed, it is reporting an anisotropy due to the C-G effect, with an amplitude of about 0.025%. The parent particles were galactic cosmic rays with a stiffness of around 1.5 TeV/c during an observation period of 5.4 years <cit.>.\n\n \n\nOther measurements indicate that the amplitude of the anisotropy in the secondary cosmic ray flux due to the C-G effect is no higher than 0.1% <cit.>. On the other hand, measurements of the C-G effect in spacecraft, through the hydrogen flux in the keV energy range, indicates that the C-G effect distorts the hydrogen flux. Monte Carlo simulations show that in the ram frame where the spacecraft is toward the emission source, the C-G effect forces the hydrogen flux to the ecliptic plane, while the opposite occurs in the anti-ram frame <cit.>.\nThe energy spectrum of galactic cosmic rays follows a power law, from energies around \n∼ 8.0 GeV to ultra-high energies. Also, the energy spectrum decreases as energy increases. In detectors whose location has a geomagnetic rigidity cutoff above 9.0 GV, 80% of secondary particles at ground level come from galactic cosmic rays (mainly protons) of up to 2 TeV <cit.>.\nPlaces with a high cutoff in geomagnetic rigidity and located at small geographic latitudes are more effective for observing the C-G effect. However, there is a side effect, the greater the rigidity cutoff, the smaller the cosmic ray flux. Thus the observation of the C-G effect requires long periods of observation.\n\nHowever, we show that some NMs, especially those located at low latitudes and with a high geomagnetic rigidity cutoff and altitude, such as the Mexico-City NM, can observe the C-G effect.\nNeutron monitors detect a large variety of secondary particles, mainly nucleons produced mainly by the galactic cosmic rays which reach the Earth's atmosphere <cit.>.\n\nThe organization of paper is as follows: In Section 2, we present the data analysis with a brief description of Mexico City, including a theoretical aspect on the prediction of the C-G effect, \nfollowed by data analysis during two \nsolar minima (2008-2019) and considering\nthe two years together.\nWe present in Section 3 a preliminary analysis of the seasonality of the C-G effect. The correlation between the phases of the C-G effect and the E-W asymmetry is analyzed in section 4. Finally, in section 5, we present a summary and  conclusions of the article.\n\n\n\n\n\n\n§ ANALYSIS\n\n\n\n\n\n\n\n §.§ Mexico-City NM data\n\n\nThe Neutron Monitor Database (NMDB) (<http://www.nmdb.eu>) provides cosmic ray data from at least 18 neutron monitors distributed \naround the world, and operated in real-time. \nFrom these, the Mexico-City NM is among those located at not very high geographic latitudes (19.33^∘ N). In addition, it has a relatively high geomagnetic rigidity cutoff (8.2 GV) and a mountain altitude (2274 m asl) <cit.>. These characteristics are favorable to observing the C-G effect.\n\n\nThe Mexico-city NM is in continuous operation since 1990. \nFig. <ref> shows the pressure & efficiency corrected cosmic ray time profiles from these three decades. The left (red) scale is associated with the counting rate. While the scale at right (blue) is associated with the monthly sunspot number. The well-known inverse correlation between the cosmic ray counting rate and the sunspot number is evident. \n\nAs already indicated, data from the Mexico City NM\nis available from NMDB.\nDespite data were corrected for pressure and efficiency, they still show some fluctuations in the counting rate\n\n\nDuring the minimums of the solar cycles, the Sun's magnetic field pattern is like a dipole structure. Its strength weakens and provides less shielding to the galactic cosmic rays, arriving in the Earth's environment almost with an isotropic distribution. This behavior is responsible for the inverse relationship between the galactic cosmic ray intensity and the sunspot number. \nSo, during the minimums of the solar cycles, the galactic cosmic ray intensity at Earth is higher.\nThese characteristics are essential to observe the small anisotropy due to the terrestrial motion.\n\n\n\nIn more than 30 years of continuous operation, Mexico-City NM has recorded three solar minima.\nThe start (minimum) of solar cycles  23, 24, and 25 was in  August 1996, December 2008, and December 2019, respectively\n <cit.>.\n The maxima cosmic ray counting rate during the minima of cycles 24 and 25 was around 5% higher than the maximum counting rate from cycle 23. Fig. <ref> summarizes the situation.\n \n\n \n \n\n \n\n\n\n\n\n\n §.§ Compton-Getting effect prediction\n\n\nAssuming that an isotropic galactic cosmic rays flow reach the Earth with a power-law energy spectrum, such as E^-γ, with\nγ = 2.7, a ground-level detector would see an increase in the count rate when its field of view looks along the direction of Earth's orbital motion, predicted as\n <cit.>\n\n    Δ f/f=(γ+2) v/ccosλ,\n\nwhere v is the mean speed of Earth's orbital motion (29.78 km/s). Here, we assume that the galactic cosmic rays speed is close to c (the speed of light in a vacuum). This approximation is valid\nfor cosmic rays with energies greater than GeV, and \nλ is the angle between the direction of the detector's sensitivity and Earth's velocity vector. For non-directional (large field of view) detectors such as NMs, λ is close to the geographic latitude angle where the detector is located.\nThe C-G effect amplitude variation predicted  to the Mexico-City NM is\n0.044% and a phase at 06:00 LT.\n\n\n\n\n §.§ Cosmic ray anisotropies at Earth\n\n\nIn the region of energies below ∼50 TeV, the observed anisotropies of galactic cosmic rays mean that their propagation in the inner heliosphere (interplanetary space) is not isotropic. There are gradients parallel and perpendicular to the ecliptic plane. They are responsible for diurnal solar anisotropy and North-South anisotropy, among other smaller ones. Cosmic ray count rate at ground level provides valuable insight into the processes described above <cit.>.\n\n \nThe large anisotropy observed at ground level is the diurnal solar anisotropy. Galactic cosmic ray propagation (with hardness below ∼50 GV) in the plane of the ecliptic corotates with the interplanetary magnetic field (IMF) <cit.>. When the flux reaches Earth, it produces the diurnal solar anisotropy, approximately perpendicular to the Sun-Earth line, with a phase about 15:00 LT (under positive solar cycle polarity qA>0) and about 18:00  LT (under negative solar cycle polarity qA<0) <cit.>. Like the C-G effect, the diurnal anisotropy depends on geographic latitude λ as cosλ <cit.>. Thus, the greater the latitude of the place, the smaller the amplitude of diurnal solar anisotropy, and it disappears in the polar regions.\n\nHere we highlight an anisotropy due to the Earth's orbital motion, the so-called C-G effect, through analysing the daily counting rates at Mexico City NM. We select three years, 1996, 2008, and 2019, during the solar minima when the galactic cosmic ray flux reaching Earth is maximum. In these years, the Sun's magnetic field is weakened. It is like a well-behaved magnetic dipole. Consequently, the Sun's magnetic effects on cosmic rays are smaller.\n\nHowever, 1996 data from Mexico-NM are not available\nat NMDB at 1 h or fewer time intervals, which\nimpossibilities the analysis. So, 1996 NM data were not include. The analysis is restricted only to 2008 and 2019 years.\n\nLet's start with the 2008 data (minimum start of cycle 24). Fig. <ref> (top panel) shows the monthly counting rate time profiles (averathing 10 min) from Mexico-City NM data. \nAlready Fig. <ref> (bottom panel) shows the mean count daily rates for the full year 2008. The two curves are two Gaussian fits around the first and second peaks. The first peak is identified as due to the C-G effect, originating by the terrestrial motion, and the second one as the diurnal solar variation due to solar wind corotating structure reaching the Earth. \n\nTable <ref> indicates the amplitude variation in percentage relative to the daily mean counting rate in 2008 due to the C-G effect and diurnal solar variations, respectively. Table <ref> also \nindicates the phase in LT for these two peaks. \n\nNote that in 2008 the amplitude variation due to daily variation is around 18% greater than the amplitude variation due to the C-G effect.\n\nFig. <ref> shows the same type of analysis for the 2019 data (minimum start of cycle 25). Also, Table <ref> indicates the amplitude variation in percentage relative to the daily mean counting rate and the phase in LT due to the C-G effect and diurnal solar variations, respectively.\n\nIn most cases, the daily solar variation amplitude is higher than the C-G effect amplitude. However, note that in 2019, there is an anomaly. The amplitude variation due to the C-G effect is around 57.5% greater than the amplitude variation due to diurnal solar variation.\n\nFinally, Fig. <ref> represents a combined analysis including data from the 2008 and 2019 values. Again the \nTable <ref> shows the values found for the amplitude variations due to the C-G effect and diurnal solar variation, respectively, as well as their phases. \n\nWe would point out that the amplitude variation and phase for the C-G effect obtained in the combined data analysis (2008-2019) agree with expected values.\n\n\n \n\n\n\n\n\n\n\n§ SEASONALITY OF THE C-G EFFECT\n\n\nDespite low statistics, we also examine the cosmic-ray diurnal variation from Mexico-City NM data over 2019, according to the seasons.\nDates regarding season here used are \nWinter (01 January to 20 March); \nSpring (20 March to 21 June);\nSummer (21 June to 23 September);\nAutumn (23 September to 31 December).\n\nWe see a significant variation, as shown in Fig. <ref>, showing the hourly (averaging 30 min) counting rate per second during the 12 (seasonably) months of 2019.\n\nFrom Fig. <ref>, we also can see that the count rate during winter is the one that most contributes to the C-G effect observation. \nWe also can observe that the counting rate during autumn does not contribute to the C-G effect observation but contributes significantly to diurnal solar variation.\n\nFluctuation on the interplanetary magnetic filed and the E-W asymmetry of the cosmic ray flow (see next section) are responsible for the phase fluctuations of the Compton-Getting effect and of the diurnal solar variation around values, in most cases, earlier than expected. The details of this mechanism are the subject of the next section.\n\n\n\n\n\n\n\n§ C-G EFFECT AND THE WEST-EAST ASYMMETRY\n\n\nFrom the 1930s onwards, it's known that \nthe flow of cosmic rays reaching Earth from the West is higher than\nfrom the East; and is known as the East-West (E-W) effect\n<cit.>. This effect is due to the de\ndeflection of the cosmic\nray-charged particles by the Earth's magnetic field.\nThe count excess from the West direction means that\nprimary cosmic rays are predominantly positively charged\nparticles.\n\nThe observation of muons data detected by underground telescopes, allows to obtain the E-W asymmetry of their parent particles, galactic cosmic rays with high magnetic rigidity (above 1000 GV) <cit.>. \n\nSo, cosmic ray directional telescopes can obtain the phase from the E-W asymmetry, and from it obtain the phase of the C-G effect adding (clockwise) a right angle (=+6 hr) to E-W asymmetry phase:\n\n    Phase(C-G) = Phase(E-W) + 6  hr.\n\n\nThe E-W asymmetry is responsible for changing the phase of the C-G effect to times earlier than expected. Fig. <ref> details this mechanism.\n\n \n\nThe E-W asymmetry can also explain the shift of the phase of the diurnal solar variation for early times than expected. In the case of 2019 (beginning of solar cycle 25) with the solar cycle's  polarity conditions (qA>0), the expected phase for the diurnal solar variation is 15 hr LT, as shown by the right arrow\nat the top of Fig. <ref> where shift values of up to 3 hr relative to the expected value is observed, while the average value in the (averaging 10 m) data is  12.90± 1.97 LT (see \nTable <ref>).\n\n\n\n\n\n\n§ DISCUSSIONS AND CONCLUSIONS\n\n\nWe present a study on the daily variation of count rate at the Mexico City NM detector located at low geographic latitude (19.33^∘N) and a high geomagnetic rigidity cutoff (8.2 GV). We highlight the study of anisotropy due to the terrestrial orbital movement known as the C-G effect.\n\nTo optimize the cosmic ray detection at ground level (2274 m asl), we used the 2008 and 2019 data, which coincides with the last two solar minima, when the flow of galactic cosmic rays reaching Earth is higher, and the Sun's magnetic field is weakened,\nwith a dipolar pattern, and their influence on galactic cosmic rays is lowest.\n\nTwo modulations in the cosmic ray flux still survive in the Mexico-NM detector, even after corrections for variations in barometric pressure and efficiency. The first is in the early hours of the day (expect 6:00 hr LT), consistent with a modulation due to the Earth's orbital motion, i.e., the C-G effect. predicted by <cit.> as a first-order relativistic effect.\n\nThe second one is the known diurnal solar variation, in the early hours\n of the afternoon (expected between 15:00 and 18:00 LT),\nThe cosmic ray diffusion theory <cit.>, including\nother factors, such as the scattering effect due to irregularities in the solar magnetic field <cit.> and latitude effects <cit.>,\ncan describe the diurnal solar variation.\n\nTable <ref> summarizes the results, including the counting rate variation and the phase of both anisotropies, the C-G effect, and diurnal solar variation, respectively. Both the counting rate variation and phase for the C-G effect, obtained from combined data (2008-2019) from Mexico City NM, agree with those predicted.\n\nWe have also looked for the seasonality of the C-G effect, with the seasons during 2019. We observe a significant variation. The same is true for the solar diurnal variation. However, due to the low statistics, the results on the seasonality of the two anisotropies are preliminary. \n\nEven so, the data obtained during the winter are the ones that contribute the most to the C-G effect. The data collected in autumn has no contribution to the C-G effect but significantly contributes to diurnal solar variation. Fig. <ref> summarizes the results.\n\nFinally, we show that in addition to fluctuations in the interplanetary magnetic field, the E-W effect on the cosmic ray flow reaching Earth is also responsible for \ndispersion, observed in the phases of both anisotropies. In most cases, the E-W effect is responsible for bringing the phases forward, sometimes several hours ahead of the expected ones. In this study, this effect is more pronounced in diurnal solar variation. We highlight a correlation between the phases of the E-W and C-G effects (see Eq. /refphases)<cit.>. In the present case,\nthe C-G effect phase for the combined data (2008-2019) is \n06.15 LT. Consequently, the E-W phase will be close to 0.15  LT. This result is a prediction for the E-W phase at the Mexico City location.\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n\n\nWe acknowledge the NMDB database (www.nmdb.eu), founded under the European Union's FP7 programme (contract no. 213007) for providing data.\nMexico City neutron monitor data were kindly provided by the Cosmic Ray Group, Geophysical Institute, National Autonomous University of Mexico (UNAM), Mexico.\nThis work is supported by Fundacao de amparo a Pesquisa do Estado do Rio de Janeiro (FAPERJ)  under Grant E-26/010.101128/2018.\n\n\n\n\n\naasjournal\n\n"}