{"entry_id": "http://arxiv.org/abs/2303.06680v1", "published": "20230312145311", "title": "Non-Minimal Approximation for the Type-I Seesaw Mechanism", "authors": ["Mikhail Dubinin", "Elena Fedotova"], "primary_category": "hep-ph", "categories": ["hep-ph", "astro-ph.CO"], "text": "\n\n\n\n\n\n\n\n\nbold\nNon-minimal approximation for the type-I seesaw mechanism\nnormal\n\n.3cm\n\n\n0.5  cm\n\n\nM. N. Dubinin^1,2, \nE. Yu. Fedotova^1\n\n\n.7cm\n\n\n^1 Skobeltsyn Institute of Nuclear Physics (SINP MSU), \nM.V. Lomonosov Moscow State University, Leninskie gory, GSP-1, 119991 Moscow, Russia\n\n^2 MegaScience Center, National University of Science and Technology MISIS,\nLeninskiy Prospekt, 4, 119049, Moscow, Russia\n.5cm\n[l].9\n\n\nE-mail:\ndubinin@theory.sinp.msu.ru, fedotova@theory.sinp.msu.ru\n\n\n\n\n\n\n1cm\n\n\nA non-minimal approximation for effective masses of light and heavy neutrinos in the framework of a\ntype-I seesaw mechanism with three generations of sterile Majorana neutrinos \n\nis considered. \nThe main results are: \n(a) the next-order corrections to the effective mass matrix of heavy neutrinos due to terms O(θ M_D) are obtained, which modify the  commonly used representation for the effective mass (M_D is a Dirac neutrino mass when the electroweak symmetry is spontaneously broken); and\n(b) the general form of the mixing matrix is found in non-minimal approximation parametrized by a complex 3 × 3 matrix satisfying a nontrivial constraint. \n\nNumerical analysis within the νMSM framework demonstrates the very small effect of new contributions of \ndirect collider observables as opposed to their possible significance for  \n\n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\n\nNumerous consequences of the exceptionally successful standard model (SM) of elementary particle physics based on the gauge symmetry SU(3)× SU(2)_L× U(1) have been confirmed by experiments on colliders and extracted particle beams. No significant deviations from the SM predictions were found, as a result of which it is considered as a mathematically consistent effective field theory for a very large energy scale. At the same time, it is obvious that SM is not a complete theory, since it cannot explain a number of observed phenomena not only in particle physics, but also in astrophysics and cosmology. One of the most well-known problems of SM is the problem of neutrino masses and neutrino oscillations <cit.>, which will be considered in this paper. The essense of the problem is the absence of clarity concerning what mechanism provides the observed neutrino mass spectrum and how neutrinos of one flavor disappear and turn into neutrinos of another flavor. Some still-unknown particles would be needed to analyse the neutrino puzzle. Let us mention that the solution of other equally well-known problems of SM, which are the problem of dark matter and dark energy in the Universe, as well as the problem of its baryon asymmetry (BAU) generation, like the neutrino problem, can also be associated with the SM extension by new particles and/or interactions. The inability of modern collider experiments to detect new particles may be due not only to their large masses, but also to extremely elusive interactions with SM particles, making their production extremely rare events. In other words, to detect feebly interacting particles, the requirements for the integrated luminosity of the beam(s) in the experiment must cross the 'intensity frontier'. \n\nA well-known example of a field-theoretic model, within the framework of which it is possible to solve a significant part of the above-mentioned problems by extending the set of SM particles with relatively light and weakly interacting new particles of the lepton sector, is the νMSM model (neutrino minimal standard model) <cit.>. It is an extension of the SM with the help of three Majorana neutrinos whose flavor states do not participate in gauge interactions (so-called sterile neutrinos, also called heavy neutral leptons, HNL). The masses of sterile neutrinos do not exceed the electroweak scale O (10^2) GeV and at the same time significantly exceed the value of the mass parameter Fv (F is the neutrino Yukawa coupling constant and v is the Higgs field vacuum expectation value equal to 174 GeV), as a result of which the mass generation mechanism (known as the seesaw type-I  see Section <ref> below) works well for neutrino. Within the framework of the νMSM, it is not necessary to introduce a new mass scale for heavy fermions, the Majorana masses are comparable to the masses of light quarks and charged leptons. The number of sterile neutrinos should be at least three. At least two states of sterile neutrinos are necessary to explain the known experimental parameters Δ m^2_atm and Δ m^2_sol. However, none of these states are suitable for the role of a dark matter particle, since (1) their Yukawa constants are not sufficiently limited to form a moderate amount of dark matter within the framework of the Dodelson–Widrow mechanism <cit.>, and (2) the one-loop radiative decays of such states in the subdominant channel  \nN_2,3→νγ with the energy E_γ = 1/2 M_2,3 <cit.> would produce too many gamma rays compared to the available astrophysical experimental data[\nNote that the unidentified spectral line at the energy E ∼ 3.5 keV in the stacked X-ray spectra of dark-matter-dominated objects has been observed <cit.>. The signal distribution over the sky and the ratios of its strengths are consistent with predictions for decaying dark matter with the mass M_1 ≃ 7.1 ± 0.1 keV <cit.>.].\nFor these reasons, one more sterile neutrino (the HNL of the first generation[\nThroughout the paper we will assume that there is a normal ordering in the HNL sector, i.e., M_1 < M_2 ≤ M_3.]\nadded to the νMSM provides a suitable candidate for the role of dark matter. \n\n Adding three HNLs introduces 18 new parameters, 3 Majorana masses and 15 parameters of the Yukawa coupling matrix F.\n\nThe mass of a DM sterile neutrino can be varied in the range \n\n∼1–50 keV in the case of νMSM <cit.>. The baryogenesis of the νMSM is provided by the oscillation mechanism <cit.>. In the following, three generations of HNL are considered, which makes it possible to explain simultaneously the origin of the masses of standard (or active) neutrinos due to the seesaw mechanism, the existence of a dark-matter particle and the generation of baryon asymmetry. \nSignificant limitations on the mixing parameter value for HNL in the νMSM model, as well as on the second- and third-generation HNL masses, which should be split very weakly <cit.>, are reviewed in <cit.>.\n\nIn extensions of the SM lepton sector, the active neutrino flavor states and mass\nstates can be related with the help of Pontecorvo–Maki–Nakagawa–Sakata mixing matrix \nU_ PMNS,\nν_l L(x) = ∑_i (U_ PMNS)_li_i L(x),\nwhere ν_l L is the left-handed (LH) component of the flavour\nfield, _i L is the LH component of the state possessing a mass m_i,  i=1,2,3, and l=e, μ, τ <cit.>. \n\nThe exact values of neutrino masses are unknown, but it follows\nfrom the \nexisting data \nthat there are at least three active neutrino mass eigenstates, \n\nneutrinos must be light, \n\n|(m_ν)_ll'| ≤ 1 eV (l,l'=e, μ, τ),\n<cit.> and the neutrino mass values are rather strongly split.\nThe differences between them measured experimentally give the central values of mass parameters squared\nΔ m_sol^2 ≈ 7.54 ×  10^-5 eV^2 and  \nΔ m_atm^2 ≈ 2.43 ×  10^-3 eV^2  <cit.>. This leaves two different possibilities of neutrino mass ordering: normal ordering (NO) m_1 < m_2 ≪ m_3 or inverse ordering (IO)  m_3 ≪ m_1 < m_2. \nThe mass of the lightest\nneutrino m_0 may vary from zero to \n0.03 eV (NO) or 0.015 eV (IO) allowed by cosmological observations <cit.> (see also <cit.>). Within the νMSM,  the lightest active neutrino is lighter than O (10^-5) eV <cit.>. The HNL masses responsible for active neutrino mass generation\nare rather strongly constrained both by direct searches \n\n<cit.>\n\nand cosmological considerations <cit.>.\nThe analysis of lepton universality within the νMSM shows that\nM_2,3 > 173 MeV (264 MeV) for NO (IO) <cit.>, see also <cit.>. \nThe recent investigation of BAU <cit.> implies the masses of HNL to be M_2,3≥ O(3) GeV.\n\nHistorically, the motivation for considering right-handed (RH)\nneutrinos have appeared from the left-right symmetric extension of the SM <cit.>\nwhere the electroweak group of symmetry SU(2)_L × U(1)_Y was \nextended to the SU(2)_L × SU (2)_R × U(1)_B-L.\nThe observed left chirality of the low-energy weak interactions in the model with left–right symmetry, usually attributed to the spontaneous breaking of this symmetry, implies the existence of a right-handed neutrino.\n\nIt is commonly assumed that the effective mass (m_ν)_ll' can be presented as\n\n    (m_ν)_ll' = - M_D M_M^-1 M_D^T\n\nin the limit M_D ≪ M_M, where M_D, M_M are Dirac and Majorana mass matrices of the LH and RH neutrinos (see details below).\nHowever, Eq. (<ref>) is a standard approximation of a more complicated expression including an additional 3 × 3 matrix θ (|θ| ≪ I) describing mixing of the active neutrinos with HNL. The contribution of the next-order terms in effective neutrino mass representations requires a separate study.  \nIn the following, Section <ref>, we investigate the standard approach for the\ntype-I seesaw mechanism and consider the non-minimal approximations for effective masses of the active and sterile neutrinos. Nonstandard parametrization of the mixing inspired by diagonalization of the active-sterile neutrino mass matrix in the approach of <cit.> and a nontrivial relation for the parametrization matrix Ω_ nm have been obtained. The numerical analysis within the νMSM framework is performed in Section <ref>. Results are discussed in Section <ref>. \nA symmetric structure of effective and Majorana mass matrices as well as relations for M_D θ^T and θ^† M_D are analyzed in Appendix <ref>.\nSimple representations for the matrix Ω_ nm are considered in Appendix <ref>.\nA form of effective mass matrix of active neutrinos m_ν as function of U_ PMNS in standard and non-minimal approximations is derived in Appendix <ref>.\n\n \n\n\n§ A MODEL WITH THREE RIGHT-HANDED NEUTRINOS\n\n\n\nThe lagrangian of the SM extension by three right-handed neutrinos ν_R has the form (see e.g.,  <cit.>)\n\n    L =  L_SM + i ν_R ∂_μγ^μν_R- ( F l_L ν_R H̃ + M_M/2ν^c_R ν_R + h.c.),\n\nwhere \nl_L=(ν_L    e_L)^T\nis the left-handed lepton doublet,\nν_R is the right-handed neutrino \n[(ν_R)^c ≡ C ν_R^T, where C=i γ_2 γ_0 is the charge conjugation matrix], \nH is the Higgs doublet (H̃= ϵ_ij H^†, ϵ_ij antisymmetric tensor), \nF is the neutrino Yukawa coupling matrix, and\nM_M is the 3 × 3 Majorana mass matrix of the RH neutrinos,\nwhich does not break the SM gauge symmetry.\n\nAfter spontaneous electroweak symmetry breaking, the full neutrino mass term in Equation (<ref>) can be presented as  \n\n    1/2 (ν_L \n    ν^c_R)  M(\n    ν_L^c\n    ν_R),     where     M=\n    (\n    \n     0    M_D\n    M_D^T   M_M),\n\nM_D= F v is a 3 × 3 neutrino Dirac mass matrix (v=174 GeV is a vacuum expectation value of the Higgs doublet), and M_D, M_M are complex-valued in the general case.  \nIn the neutrino mass basis with the help of a unitary matrix U\n\n    U= W · diag(U_ν,U_N^*),\n\n(U_ν,U_N on the one hand side and W on the other hand side are 3× 3 and 6× 6 matrices, respectively), one can define the diagonal mass matrix <cit.>\n\n    U^† M U^*\n    =\n    (\n    m̂    0 \n    \n     0    M̂),\n        m̂ =  diag(m_1, m_2, m_3),\n    M̂ =  diag(M_1, M_2, M_3),\n\nwhere m_i, M_i are masses of light and heavy neutrinos.\n\nThe unitary diagonalization matrix W formally expressed as the exponential of an antihermitian matrix, see <cit.>,\n\n    W = exp(\n    \n    0    θ\n    -θ^†    0\n    )\n\n(where θ is a 3 × 3 complex matrix)\nconverts the matrix M to a block diagonal form\n\n    W^†(\n    \n     0    M_D\n    M_D^T   M_M) W^* \n    =\n    (\n    m_ν    0\n    \n    0    M_N) ≡M̃.\n\nHere, m_ν, M_N are effective Majorana mass terms for the LH and RH flavour neutrinos (see, e.g., <cit.>) which are related with m̂ and M̂ by \n\n    m_ν = U_νm̂ U_ν^T,     \n    M_N = U_N^* M̂ U_N^†.\n\n\n\n\nThe flavour states ν_L and ν_R and the mass states  and N then can be related as <cit.>\n\n    (\n    ν_L\n    ν_R^c)\n    =\n    P_L  U(\n    \n    N),\n\nwhere \nP_L is a left-helicity projector.\n\n\n\n §.§ Standard approximation\n \n\nAssuming that θ is “small,” it is sufficient to expand the rotation matrix (<ref>) up to O(θ^2) terms\n\n    W = exp(\n    \n    0    θ\n    -θ^†    0\n    )\n    ≃(\n    1-1/2θθ^†   θ\n    -θ^†   1-1/2θ^†θ),\n\nthus, using (<ref>) and the requirement M̃_12=0, one can relate Dirac, Majorana and θ matrices \n\n    θ≃ M_D M_M^-1,\n\nwhich yields the expressions\n\n    m_ν   ≃    - M_D θ^T ≃ \n     - M_D M^-1_M M_D^T, \n    \n    M_N     ≃   \n    \n    M_M +1/2 (θ^†θ M_M+M_M^T θ^T θ^*) ≃ M_M,\n\nwhere, in some cases, the terms O(θ^2) in (<ref>) are omitted, so Majorana mass matrices before and after rotation coincide.\nOne can represent (<ref>) in terms of θ and M_D using the relations (<ref>) and (<ref>) (see Appendix <ref>)\n\n    M_N ≃ (θ^-1 +θ^† )M_D.\n\n\nIn the representation (<ref>), the flavour states of active neutrinos can be expressed as [see (<ref>)]\n\n    ν_L    ≃   ( 1- 1/2θθ^†) U_ν_L + θ U_N^* N_L, \n    ν_R^c    ≃    -θ^† U_ν_L + (1-1/2θθ^†) U_N^* N_L,\n\nwhere terms in front of _L and N_L have to be identified with PMNS and mixing matrices[\nIn general, the PMNS matrix can be presented as\nU_ PMNS = U_l^† (1 + η)U_ν <cit.>, where\nU_l diagonalizes the charged lepton mass matrix m_l, U_l m_l m_l^† U_l^†=  diag(m_e^2, m_μ^2, m_τ^2), but throughout the paper, we assume that U_l=I.\n]\n\n    U_ PMNS≃  (1+η) U_ν,     Θ_ m≃θ U_N^*.\n\nHere, the parameter η=-1/2 (θθ^†) is considered as a deviation from the unitarity.\n\n\n\n §.§ Non-minimal approximation\n\nOne can, however, consider the expansion of the matrix W, see Equation (<ref>), up to O(θ^3)-terms\n\n    W ≃(\n    1-1/2θθ^†   θ - 1/6θθ^†θ\n    -θ^† + 1/6θ^†θθ^†   1-1/2θ^†θ),\n\nwhere again, |θ| ≪ I.\nThen, the corresponding expressions (<ref>) can be presented as\n\n\n    M̃_11    =     - (θ M_D^T+M_D θ^T) + θ M_M θ^T + 1/6 (θθ^†θ M_D^T+ M_D θ^T θ^* θ^T) \n       +   1/2 (θθ^† M_D θ^T+θ M_D^T θ^* θ^T) \n    ≃ m_ν, \n    \n    M̃_22    =     M_M+ (θ^† M_D+ M_D^T θ^*)- \n    1/2 (θ^†θ M_M + M_M θ^T θ^*) \n       -   1/2θ^† (θ M_D^T+M_D θ^T) θ^* \n    - 1/6 (θ^†θθ^† M_D+ M_D^T θ^* θ^T θ^*)\n     ≃  M_N, \n    M̃_12    =     M_D - θ M_M -1/2(θθ^† M_D+M_D θ^T θ^*) \n       -   θ M_D^T θ^*  + 1/2θ M_M θ^T θ^* + 1/6θθ^†θ M_M\n    ≃ 0.\n \n\n\nOne can note that the relation between Dirac, Majorana, and θ matrices can be defined in the form [see (<ref>)]\n\n\n    M_M - 1/2 M_M θ^T θ^*-1/6θ^†θ M_M \n     ≃θ^-1 M_D (1-1/2θ^T θ^*)-1/2θ^† M_D - M_D^T θ^*,\n\nwhich is more complicated than the expression (<ref>) of the standard approximation\nand can be converted to it \n\nif O(θ^2)-terms are neglected. \nAs one can see, the relation between two mass scales M_D, M_M and θ is not so obvious, but analyzing the relation (<ref>) one can note that (see Appendix <ref>)\n\n    O(θ^2 M_M) ∼ O(θ M_D).\n\nThis allows one to express Equations (<ref>) and (<ref>) in terms of O(θ^n M_D), where n=-1,1,2,3. However, the O(θ^2 M_D) and O(θ^3 M_D) terms are much smaller than O(θ M_D), so in the following we will consider only the last one. Thus,  the expressions for m_ν, M_N and M_M take the forms\n\n\n    m_ν   ≃    -θ M_D^T ≃ -M_D θ^T, \n    \n    M_N    ≃   \n    ( θ^-1 -1/3θ^†) M_D \n     ≃  M_M + θ^† M_D,\n\nwhere the right forms can be obtained if one takes into account the relations (<ref>) and (<ref>), see Appendix <ref>.\n\nAnalyzing the representation for the flavour states (<ref>)\n\n    ν_L    ≃   ( 1- 1/2θθ^†) U_ν_L + ( θ -1/6θθ^†θ) U_N^* N_L, \n    ν_R^c    ≃   (-θ^†+1/6θ^†θθ^†) U_ν_L + (1-1/2θ^†θ) U_N^* N_L,\n\none can identify the PMNS and active-sterile mixing matrices with\n\n    U_ PMNS≃(1 - 1/2θθ^†) U_ν,\n        Θ_ nm≃( θ -1/6θθ^†θ) U_N^*.\n\n\nAs far as |θ| ≪ 1, one can omit the terms O(θ^n), n>1 in the expressions (<ref>), so these forms coincide with ones of the standard approximation, see (<ref>).\n\nUsing (<ref>) and (<ref>), one can obtain \nthe difference between the effective mass of heavy neutrinos in standard and non-minimal approximations \n\n    M_N  m - M_N  nm = 4/3θ^† F v.\n\n\n\n\n §.§ Parametrization of the mixing matrix Θ\n\n\n\n\n  §.§.§ Standard approximation\n \n\nThe expression I = M_N M_N^-1, with the help of (<ref>), (<ref>), (<ref>) and the assumption U_ PMNS≃ U_ν can be presented as\n\n    I \n    = -M_D^T U_ PMNS^* m̂^-1 U_ PMNS^† M_D U_N M̂^-1 U_N^T.\n\n\nOne can rewrite (<ref>) in the form \n\n    I= - (√(M̂^-1) U_N^T M_D^T U_ PMNS^* √(m̂^-1))(√(m̂^-1)U_ PMNS^† M_D U_N √(M̂^-1))\n    = Ω_ m^T Ω_ m,\n\nwhere \n\n    Ω_ m = i √(m̂^-1)U_ PMNS^† M_D U_N √(M̂^-1)\n\nis an arbitrary complex orthogonal matrix (Ω_ m^T Ω_ m=I). \nThus, the Dirac matrix can be parametrized as <cit.>\n\n\n    M_D = - i U_ PMNS√(m̂)Ω_ m√(M̂) U_N^†,\n\n\nwhich together with (<ref>) leads to the expression for the  mixing matrix\n\n    Θ_ m≃θ U_N^*  ≃  - i U_ PMNS√(m̂)Ω_ m√(M̂^-1).\n\n\n\n\n  §.§.§ Non-minimal approximation\n\n\nThe same procedure I = M_N M_N^-1 in the non-minimal case M_M ∼ O(θ M_D) leads to\n\n    - [ √(M̂^-1) U_N^T (θ^-1-1/3θ^†) U_ν√(m̂)] [ √(m̂)  U_ν^T (θ^T)^-1 U_N √(M̂^-1)] ≃ I,\n\nwhere M_N^-1≡ U_N M̂^-1 U_N^T and  \nM_N is defined by Equations (<ref>) and (<ref>). \nIf one denotes the expression in the right brackets of (<ref>) as Ω_ nm\n\n    Ω_ nm = i √(m̂) U_ν^T (θ^T)^-1 U_N √(M̂^-1)\n\nand takes into account that the left side of (<ref>) concerns the unit matrix, then one can conclude using the identity Ω_ nm^-1Ω_ nm=I that the expression in left brackets is Ω_ nm^-1. \nThen, from Equation (<ref>) one can find the relation for Ω_ nm\n\n    Ω_ nm^-1 = Ω_ nm^T+1/3M̂^-1 (Ω_ nm^-1)^* m̂.\n\n\nDefining θ with the help of (<ref>) \n\n    θ≃ -i U_ν√(m̂) (Ω_ nm^-1)^T √(M̂^-1) U_N^T\n\nand using the definition of the mixing matrix Θ_, Equation (<ref>), one can write\n\n    Θ_ nm≃θ U_N^* ≃ \n    -i U_ PMNS√(m̂) (Ω_ nm^-1)^T √(M̂^-1),\n\nwhere again it was assumed that U_ν≃ U_ PMNS.\n\nNote that the mixing matrix Θ in approximations where M_M ≃θ^-1 M_D and M_M ≃ O (θ M_D) is parametrized in the same way. The difference is in the presence of requirements that must be met by an arbitrary 3 × 3 matrix Ω. \n\nThe corresponding Yukawa coupling matrix in terms of Ω_ nm can be presented as\n\n    F ≃i/v U_ PMNS√(m̂)Ω_ nm√(M̂) U_N^†.\n\nNote that the Dirac matrix in non-minimal approximation differs from (<ref>) by the parametrization matrix Ω_ nm and the sign because sign(Ω_ nm) ≠ sign(Ω_ nm^-1) whereas sign(Ω_ m) = sign(Ω_ m^-1), see (<ref>) and (<ref>). \n\nThere is an infinite set of Ω matrices leading to the\nobserved neutrino parameters <cit.>. \nIn various mixing scenario frameworks, the matrix Ω_ m can be parametrized by means of three Euler angles (complex-valued in general), see <cit.>; one complex angle ω and the sign factor ξ = ± 1 <cit.>, or just by the unit matrix, see, e.g., <cit.>. \n\nIt is desirable to relate a minimal and non-minimal matrices Ω_ m and Ω_ nm in order to consider the limit of the discussed approximations. However, one can find that the simple representation \n\n    Ω_ nm = Ω_ n + Ω_ m,\n\nwhere Ω_ mΩ_ m^T=I, Ω_ nΩ_ n^T ≠ I is not relevant, see Appendix <ref>.\n\n\n\n §.§ Interactions of the Majorana fields with SM particles\n\n\n\nThe charged-current (CC) and the neutral-current (NC) interactions of the Majorana fields with SM particles in terms of mixing parameter and U_ PMNS can be obtained as follows (see also <cit.>). \nUsing the SM normalization conventions of <cit.>\n\n    - g/√(2)ν_L γ^μ l_L W_μ^+\n    - g/√(2)l_L γ^μν_L W_μ^-\n    -g/2 cosθ_Wν_L γ^μν_L Z_μ,\n\nwhere θ_W is the Weinberg angle, one can write\nthe corresponding neutral and charged currents in the mass basis\n\n    L_NC^   =   g/2 c_W_L γ^μ U_ PMNS^† U_ PMNS_L Z_μ, \n     L_CC^   =   \n    -g/√(2)l_L γ^μ U_ PMNS_L W_μ^- + h.c., \n     L_NC^N    =    \n    -g/2 c_WN_L γ^μΘ^†Θ N_L Z_μ - ( g/2 c_W_L U_ PMNS^†γ^μΘ N_L Z_μ + h.c. ), \n     L_CC^N    =    \n    - g/√(2)l_L γ^μΘ N_L W_μ^- + h.c. ,\n\nwhere\nΘ is a minimal Θ_ m or a non-minimal Θ_ nm mixing matrix.\n\nIt is instructive to note that the active neutrino mass matrix m_ν has the same representation for both M_M ≃θ^-1 M_D and M_M ∼ O(θ M_D) approximations\n(see Appendix <ref>)\n\n    m_ν≃ U_ PMNSm̂ U_ PMNS^T.\n \n\n\n\n\n\n§ NUMERICAL EXAMPLES\n\n\n\nAs mentioned above, signals of sufficiently light HNL's are not observed in collider or beam-dump experiments. Experimental information is reduced to exclusion contours generated on the mass-mixing plane for different detectors. It should be noted that these exclusion contours use a model-independent phenomenological approach, in which only one HNL gives the observed signal, and the remaining two are strongly decoupled and practically do not affect the analysis. Within the framework of this approach, only two independent parameters are considered, the HNL mass and its coupling constant with an active neutrino, the generation of exclusion contours is carried out for the square of the mixing parameter as a function of mass for one flavor only, while the mixing for other flavors is assumed to be zero. Assumptions of this kind seem to be very strong and need to be translated for the case of a specific model. Suffice it to note that, even in the simple case of one generation of Majorana neutrinos <cit.>, the mixing parameter U=M_D/M_N depends on the mass of HNL, as a result of which the mapping of the active neutrino mass—HNL mass plane to the mixing squared—HNL mass plane is a triangle, not a rectangle. A part of the triangle for a limited region of HNL masses may look approximately like a rectangle  due to the low mass of the active neutrino.\n\nIn the following instructive example, we will vary the masses of the lightest neutrino and heavy neutrinos in  \n\nthe  ranges (see <cit.>)\n\n    m_0:        0 - 10^-5 eV,\n    \n    M_i:        1 - 50  keV for  M_1,      1-100  GeV for  M_2,3,\n\nparametrize the masses of active neutrinos as \nm_1^2 = m_0^2,\nm_2^2 = m_0^2+ Δ m_sol^2,\nm_3^2 = m_0^2+ Δ m_sol^2+  Δ m_atm^2\nfor NO or \n\nm_1^2 = m_0^2+ Δ m_sol^2,\nm_2^2 = m_0^2+ Δ m_sol^2+  Δ m_atm^2,\nm_3^2 = m_0^2\nfor IO \nand use the present central values of the known active neutrino sector parameters <cit.>.\n\nIn addition, we will use phenomenologically convenient quantities (see, e.g., <cit.>)\n\n    U_α I^2= |Θ_α I|^2,     \n     U_I^2=∑_α U_α I^2,     \n      U^2=∑_I U_I^2.\n\n\nAmong the infinite set of Ω_ m matrices satisfying the  requirement Ω_ m^T Ω_ m=I, \nwe consider \nthe following explicit forms \n\n\n    Ω^'   =    I,     Ω^”=\n    - (\n    1/√(2)   -1/2   -1/2\n    1/3 √(2)   5/6   -1/2\n    2/3   1/3 √(2)   1/√(2)), \n    Ω^”'_ NO   =   (\n    \n    1     0     0\n    \n    0     0     1 \n    \n    0    -1    0\n    ),\n     Ω^”'_ IO=\n    (\n    \n    0     0     1\n    \n    0    -1    0 \n    \n    1     0     0\n    ),\n\nwhere Ω_ m=Ω^' corresponds to a naive explicit form used, e.g., in <cit.>;\nthe form \nΩ_ m=Ω^” is not motivated by any special physical scenarios and used for numerical estimations in this section only; and\nΩ_ m=Ω^”' is a form inspired by a parametrization in <cit.> with fixed parameters ω=π/2, ξ=1\nwhich (as was determined numerically) \n\nmaximize the CP-asymmetry.\n\nThe non-minimal parametrization matrix satisfying (<ref>) is chosen as (see, also, Appendix <ref>)\n\n    Ω_ nm =  diag (ω_1, ω_2, ω_3),  where ω_i = √(1-1/3m_i/M_i).\n\n\nResults of evaluations for diagonal elements (m_ν)_ee,  (m_ν)_μμ,  (m_ν)_ττ with explicit forms Ω_ m as Ω^', Ω^”, Ω^”' are presented in \nTable <ref>, where \nfirst M_D is found using (<ref>) then (m_ν)_ll is evaluated with the help of (<ref>) and (<ref>).\nThe results for all cases coincide [in accordance with (<ref>)]\nand are below the present experimental bounds.  \n\n\n\n\n\nThe dependence of U^2 as a function of masses of heavy neutrinos M_1 and M_2=M_3=M at m_0=10^-5 eV \nfor NO is presented in Figure <ref>a, where one can see that its values are O(10^-9) and practically constant for all  M. \nThe qualitative behavior is similar for other cases. \nAs a rule, the contributions of M_1 to U^2 are neglected (as was assumed e.g., in <cit.>);\nhowever, Figure <ref>a demonstrates that the dependence U^2(M_1) can be sizable in some cases. \nOne can note that the minimal (maximal) value of U^2 is achieved at benchmark point BP_ min (BP_ max), where\n\n\n\n\n\n \n\nBP_ min:    m_0=0, M_1=50 keV, M=100 GeV,\n\nBP_ max:    m_0=10^-5 eV, M_1=1 keV, M=1 GeV.\n\n \n\n \n\nNumerical estimations of U^2 for different Ω_ m (Ω^', Ω^”, Ω^”') can be found in Table <ref>; based on these numbers, it is possible to come to a conclusion about the great complexity of heavy Majorana neutrinos observation. \n\n\n\n\n\nThe relative difference |U^2_ nm-U^2_ m|/U^2_ nm for NO, IO and different Ω_ m (Ω^', Ω^”, Ω^”') at  BP_ min (BP_ max) is presented in Table <ref>. One can see that it is quite small for Ω^', Ω^”'_ NO and is very large for Ω^”_ NO, which is a consequence of different representations for Ω_ m and Ω_ nm. Thus, the most relevant comparison can be performed for Ω_ m=Ω^' and Ω_ nm defined by (<ref>) and (<ref>) since for such representations of the parametrization matrix, it is possible to trace the limit from the standard approximation to the non-minimal one.\n\n\n\n\n\nThe relative difference of U^2 obtained in the minimal and non-minimal approximations as a function of M_2=M_3=M for Ω^”' in the NO case is presented in Figure <ref>b. \n As one can see, the results for BP1 and BP3 coincide which is explained by the choice m_0=0 and the explicit form of Ω^”'.\nThe behavior of the relative difference of U^2 at m_0=0 and m_0 ≠ 0 is different due to the contributions of M_1 to the mixing parameter.  Thus, the approximation with two RH neutrinos is quite reliable at m_0=0 and Ω^”', while one should use a model with three  HNL at m_0 ≠ 0. \nThe relative difference for NO is rather small.\nThus, in the cases where the limit of discussed approximations can be traced, the phenomenological consequences with a mixing parameter obtained in\nthe non-minimal approximation can be hardly distinguished from the results of a standard approach (see examples in <cit.>) at present or future facilities.\n\n \n\n\n\n§ CONCLUSIONS\n\n\n\nThe paper is devoted to the investigation of the SM extension by the three generations of sterile Majorana neutrinos which recover the left–right symmetry between quarks and leptons. \nExperimental detection of particles of this kind would greatly affect our understanding of particle physics and cosmology. The analysis carried out is especially significant for models in which there is no additional nonstandard scale of particle masses, so that a well-known 'model-independent approach' to calculating constraints for the model parameter space may not be directly relevant to reality. \nA non-minimal approximation for effective masses of light and heavy neutrinos in the framework of a type-I seesaw mechanism with three generations of right-handed Majorana neutrinos was considered. It was found that the obtained next-order corrections to the effective mass matrix of HNL can influence the well-known results of the current order modifying them with O(θ M_D) corrections. \nAdditional contributions to the effective masses of neutrinos were analysed and the regimes when they can be significant were defined.  \nFollowing the method proposed in <cit.>, a parametrization of the mixing matrix was performed with the help of a complex 3 × 3 matrix Ω_ nm satisfying a nontrivial relation (<ref>) in the non-minimal approximation. \nThe structure of effective and Majorana mass matrices was scrutinised and it was demonstrated that they are symmetric matrices, a fact which has not been discussed before. \nUseful relations were found for  M_D θ^T and θ^† M_D, which allow one to express effective masses in a simple form. \nIt is interesting to note that the modification of the mixing matrix does not change results for the effective mass matrix of active neutrinos m_ν in the non-minimal case. \n\n\n\nThe obtained results were analyzed in detail within the νMSM framework.\nIt was demonstrated that the approximation with two RH neutrinos is quite reliable at m_0=0, while one should use a model with three  HNL at m_0 ≠ 0.\n New additional corrections to effective masses can be more pronounced when heavy neutrino masses are small and the lightest mass of active neutrino is of O(10^-5) eV.\nNumerical examples demonstrate that the relative difference in the mixing parameter obtained in  standard and non-minimal approximations is negligibly small for all benchmark scenarios of the model where the limit of the discussed approximations can be traced. \nThus, phenomenological consequences for the mixing parameter obtained in the minimal and non-minimal approximations can be hardly distinguished at current and future facilities.\n\nThe question of the explicit form of the parametrization matrix Ω in standard and non-minimal approximations is still ambiguous. Various forms satisfying the requirement |θ| ≪ I and Ω_ mΩ_ m^T=I were considered with significantly different results. \nEffective masses of HNL in the standard and non-minimal approximations demonstrate noticeable  differences due to new sizeable terms of effective heavy neutrino mass matrix.\nNote that O(θ M_D) corrections to the splitting of eigenvalues of M_M and M_N matrices can impact both the lepton-number-violating event rates at colliders <cit.> and \nleptogenesis in the early Universe <cit.> (see also <cit.>). \n\n\n\n \n\nThe research was carried out within the framework of the scientific program of the National Center for Physics and Mathematics, project ”Particle Physics and Cosmology”.\n\n\n\n§ SYMMETRIC MATRICES M_Ν, M_N, M_M AND RELATIONS FOR M_D Θ^T AND Θ^† M_D\n\n\n\nThe elements of the matrix M̃, see (<ref>), have the forms \n\n    M̃_11   =    W_11^† M_D W_21^*+W_21^† (M_D^T W_11^*+M_M W_21^*) ≡ m_ν\n    M̃_22   =    W_12^† M_D W_22^*+W_22^† (M_D^T W_12^*+M_M W_22^*) ≡ M_N, \n    M̃_12   =    W_11^† M_D W_22^*+W_21^† (M_D^T W_12^*+M_M W_22^*) ≡ 0, \n    M̃_21   =    W_12^† M_D W_21^*+W_22^† (M_D^T W_11^*+M_M W_21^*) ≡ 0.\n\n\nAnalysing (<ref>)–(<ref>), one can note that m_ν, M_N and M_M are symmetric matrices\n\n    m_ν = m_ν^T,   \n    M_N = M_N^T,   \n    M_M = M_M^T,\n\nwhere for the last expression the relaton M̃_12-M̃_21^T=0 was used. \n\nIn the standard approximation, a requirement M̃_12=0 [see (<ref>)] has a form\n\n    θ M_M ≃ M_D - 1/2 (θθ^† M_D+M_D θ^T θ^*)-θ M_D^T θ^*.\n\n\nMultiplying (<ref>) by θ^T from the right side\n\n    θ M_M θ^T ≃ M_D θ^T - 1/2 (θθ^† M_D θ^T +M_D θ^T θ^* θ^T)-θ M_D^T θ^* θ^T\n\nand omitting terms O(θ^3) (as far as |θ| ≪ I), one can find \n\n    M_D θ^T ≃θ M_D^T,\n\nwhere the relation θ M_M θ^T = (θ M_M θ^T)^T [see (<ref>)] was applied. \n\nThe same relation (<ref>) takes place for the non-minimal approximation, where instead of (<ref>) one should use Equation (<ref>). \n\nMultiplying (<ref>) by θ^-1 from the left side\n\n    M_M ≃θ^-1 M_D - 1/2 (θ^† M_D  +θ^-1 M_D θ^T θ^*)- M_D^T θ^*\n\nand using the relation (<ref>), one can rewrite the requirement M_M = M_M^T in the form\n\n    θ^† M_D ≃ M_D^T θ^*.\n\n\nThe relation (<ref>) is also relevant in the non-minimal approximation. The expression (<ref>) can be written as\n\n    θ^†θ M_M    -   1/2θ^†θ M_M θ^T θ^* -1/6θ^†θθ^†θ M_M ≃\n          θ^† M_D-1/2θ^†θθ^† M_D-1/2θ^† M_D θ^T θ^*-θ^†θ M_D^T θ^*,\n\nso, in the limit O(θ M_D) \n\n    θ^†θ M_M ≃θ^† M_D,     \n    M_M θ^T θ^* ≃ M_D^T θ^*,\n\nwhich allows one to express (<ref>) as\n\n    M_M ≃θ^-1 M_D -1/3θ^† M_D -1/2 M_D^T θ^* - 1/2θ^-1 M_D θ^T θ^*.\n\n\nThe requirement M_M=M_M^T, (<ref>), with the help of (<ref>), leads to\n\n    θ^-1 M_D+2/3θ^† M_D ≃ M_D^T (θ^-1)^T+2/3 M_D^T R^*.\n\n\nMultiplying (<ref>) by θ and θ^T from the left and right sides, one can obtain\n\n    θθ^† M_D θ^T ≃θ M_D^T θ^* θ^T,\n\n\nwhich leads to the relation (<ref>).\n\n\n\n\n§ A SIMPLE REPRESENTATION FOR THE MATRIX Ω_ NM\n\n\n\n\nSuppose that\n\n    Ω_ nm = Ω_ n+Ω_ m,\n\nwhere Ω_ mΩ_ m^T=I, Ω_ nΩ_ n^T ≠ I. Inserting (<ref>) into (<ref>), one can find \n\n    Ω_ m = 3 m̂^-1 [(Ω_ n^-1)^† - Ω_ n^*] M̂ - (Ω_ n^-1)^T,\n\nwhich must satisfy the requirement Ω_ m^-1 = Ω_ m^T, i.e.,\n\n    3 M̂^-1[ Ω_ n^† - (Ω_n^*)^-1] m̂-Ω_ n ^T = 3 M̂ [(Ω_ n^-1)^*-(Ω_ n^*)^T] m̂^-1 - Ω_ n^-1.\n\n\nAssuming\n\n    A = Ω_ n^T - Ω_ n^-1,      A ≠ 0,\n\nEquation (<ref>) takes the form\n\n    3 M̂^-1 A^* m̂ + 3 M̂ A^* m̂^-1 - A = 0.\n\n\nOne can note that there is no matrix A satisfying the relation (<ref>). \nThus, the matrix Ω_ nm cannot be expressed by the form  (<ref>).\n\nHowever, if one assumes that Ω_ nm is a diagonal matrix, then its form is defined explicitly as \n\n    Ω_ nm =  diag (ω_1, ω_2, ω_3),  where ω_i = √(1-1/3m_i/M_i).\n\n\n\n\n\n§ THE EFFECTIVE MASSES OF ACTIVE NEUTRINOS IN STANDARD AND NON-MINIMAL APPROXIMATIONS\n\n\n\n\nIn the standard approach using  the relations (<ref>), (<ref>), (<ref>) and Ω_ mΩ_ m^T = I, one can find\n\n    m_ν≃  - M_D θ^T  ≃ - θ M_N θ^T \n     ≃  - θ U_N^* M̂ U_N^†θ^T = - ΘM̂Θ^T ≃ U_ PMNSm̂ U_ PMNS^T.\n\n\nIn the non-minimal approximation, \nthe expression for m_ν, (<ref>), with the help of (<ref>), is\n\n    M_D ≃[ θ - 1/3 (θ^† )^-1] M_N,\n\nand (<ref>) \ncan be presented as\n\n\n    m_ν≃ - [ θ - 1/3 (θ^† )^-1] U_N^* M̂Θ^T.\n\n \nUsing (<ref>) and (<ref>), one can find \n\n    m_ν   ≃    \n    -i^2 U_ν√(m̂)Ω_ nm√(M̂^-1) U_N^T U_N^* M̂√(M̂^-1)Ω_ nm^-1√(m̂) U_ν^T \n       ≃    U_ PMNSm̂ U_ PMNS^T,\n\nwhere, as far as |θ| ≪ 1, one can assume U_ν≃ U_ PMNS, see (<ref>).\n\n999\n\n\n\nosc_1_1\nPontecorvo, B.\nMesonium and anti-mesonium.\nZh. Eksp. Teor. Fiz. (JETP) 1957, 33, 549–551.\n\n\nosc_1_2\nPontecorvo, B. \nInverse beta processes and nonconservation of lepton charge.\nSov. Phys. JETP 1958, 7, 172–173. \n\n\n\n\nosc_2_1\nMaki, Z.; Nakagawa, M.; Sakata, S.\nRemarks on the unified model of elementary particles.\nProg. Theor. Phys. 1962, 28, 870–880. \n\n\nosc_2_2\nShrock R.E.\nGeneral theory of weak processes involving neutrinos. I. Leptonic pseudoscalar-meson decays, with associated tests for, and bounds on, neutrino masses and lepton mixing.\nPhys. Rev. D. 1981, 24, 1232–1274;\n\n\n\nosc_2_3\nShrock R.E.\nGeneral theory of weak processes involving neutrinos. II. Pure leptonic decays.\nPhys. Rev. D. 1981, 24, 1275–1309.\n\n\nnuMSM_1\nAsaka, T.; Blanchet, S.; Shaposhnikov, M.\nThe νMSM, dark matter and neutrino masses.\nPhys. Lett. B 2005, 631, 151–156.\n\n \nnuMSM_2\nAsaka, T.; Shaposhnikov, M.\nThe νMSM, dark matter and baryon asymmetry of the universe. \nPhys. Lett. B 2005, 620, 17–26.\n\n \nseesawI_1\nMinkowski, P. \nμ→ e γ at a rate of one out of 10^9 muon decays?\nPhys. Lett. B 1977, 67, 421–428.\n\n \nseesawI_2\nGell-Mann, M.; Ramond P.; Slansky, R. \nSupergravity.\nIn Proceedings of the Supergravity Stony Brook Workshop;\nvan Nieuwenhuizen, P., Freedman, D.Z., Eds.;   \nNorth Holland Publ. Co.: Amsterdam, 1979 ; p. 315.\n\n \nseesawI_3\nYanagida, T. \nHorizontal gauge symmetry and masses of neutrinos.\n\n\nIn Proceedinds of the Workshop on Unified Theories and Baryon Number in the Universe;\nSawada, O., Sugamoto A., Eds.; \nNational Laboratory for High Energy Physics:\n\nTsukuba, Japan, 1979; pp. 95–99.\n\n \nseesawI_4\nMohapatra R.N.; Senjanovic, G. \nNeutrino mass and spontaneous parity nonconservation. \nPhys. Rev. Lett. 1980, 44, 912–922.\n\n \ndw\nDodelson, S.; Widrow, L.M.\nSterile neutrinos as dark matter.\nPhys. Rev. Lett. 1994, 72 17–20.\n\n \n7keV_th_1\nDolgov, A.; Hansen, S.\nMassive sterile neutrinos as warm dark matter.  \nAstropart.Phys. 2002, 16, 339–344. \n\n \n7keV_th_2\nAbazajian, K.; Fuller, G.M.; Tucker, W.H.\nDirect detection of warm dark matter in the x-ray.  \nAstrophys. J. 2001, 562, 593–604.\n\n \n7keV_exp_1\nBulbul, E.; Markevitch, M.; Foster, A.; Smith, R.K.; Loewenstein, M.; Randall, S.W.\nDetection of an unidentified emission line in the stacked x-ray spectrum of galaxy clusters.\nAstrophys. J. 2014, 789, 13–36.\n\n \n7keV_exp_2\nBoyarsky, A.; Ruchayskiy, O.; Iakubovskyi, D.; Franse, J. \nUnidentified Line in x-ray spectra of the Andromeda\ngalaxy and perseus galaxy cluster.\nPhys. Rev. Lett. 2014, 113, 251301.\n\n \nalehin\nAlekhin, S. et al. \nA facility to search for hidden particles at the CERN SPS: the SHiP physics case.\nRept. Prog. Phys. 2016, 79, 124201.\n\n\n \n1-50keV\nBoyarsky, A.; Ruchayskiy, O.; Shaposhnikov, M. \nThe role of sterile neutrinos in cosmology and astrophysics.\nAnn. Rev. Nucl. Part. Sci. 2009, 59, 191–214. \n\n \n2007_Shap_sym\nShaposhnikov, M.\nA possible symmetry of the νMSM. \nNucl. Phys. B 2007, 763, 49–59.\n\n \npmns_3\nPontecorvo, B.  \nNeutrino experiments and the question of leptonic-charge conservation.  \nSov.Phys. JETP 1968, 26, 984–988. \n\n\n \nmerle\nMerle A.; Rodejohann, W.  \nThe elements of the neutrino mass matrix: Allowed ranges and\nimplications of texture zeros.\nPhys. Rev. D 2006, 73, 073012. \n\n\n \n0nubb\nCUORICINO collaboration. \nResults from a search for the 0 νββ-decay\nof 130 Te.\nPhys. Rev. C) 2008, 78, 035502. \n\n\n \nGA\nFogli, G.L. \net. al. \nGlobal analysis of neutrino masses, mixings and phases: entering the era of leptonic CP violation searches.\nPhys. Rev. D 2012, 86, 013012.  \n\n\n \nPlank\nPlanck collaboration. \nPlanck 2018 results. VI. Cosmological parameters.\nAstron. Astrophys. 2020, 641, A6; \n\nErratum in: \nAstron. Astrophys. 2021, 652, C4. \n\n \ndrewes_22\nDrewes, M.; Georis, Y.; Hagedorn, C.; Klaric, J. \nLow-scale leptogenesis with flavour and CP symmetries.\nJHEP 2022, 12, 044. \n\n\n\nnuMSM_lightest\nBoyarsky, A.; Neronov, A.; Ruchayskiy, O.; Shaposhnikov, M.\nThe masses of active neutrinos in the νMSM from x-ray astronomy. \nJETP Lett. 2006, 83, 133–135.\n\n\nMN<1eV_1\nde Gouvea, A.\nSee-saw energy scale and the LSND anomaly.\nPhys. Rev. D 2005, 72, 033005.\n\n\nMN<1eV_2\nde Gouvea, A.; Jenkins, J.; Vasudevan, N.  \nNeutrino phenomenology of very low-energy seesaws. \nPhys. Rev. D 2007, 75, 013003.\n\n\nHNLser_dir1\nArguelles, C.A.; Foppiani, N.; Hostert, M.  \nHeavy neutral leptons below the kaon mass at hodoscopic detectors.\nPhys. Rev. D 2022, 105, 095006.\n\n\n\nHNLser_dir2\nKelly K.J.; Machado, P.A.N.  \nMicroBooNE experiment, NuMI absorber, and heavy neutral leptons.\nPhys. Rev. D 2021, 104, 055015.\n\n\n\nHNLser_cosm1\nHernandez, P.; Kekic, M.; Lopez-Pavon, J.\nN_ eff in low-scale seesaw models versus the\nlightest neutrino mass. \nPhys. Rev. D 2014, 90, 065033.\n\n\n\nHNLser_cosm2\nMastrototaro, L.; Serpico, P.D.; Mirizzi, A.; Saviano, N. \nMassive sterile neutrinos in the early Universe: From thermal decoupling to cosmological constraints.\nPhys. Rev. D 2021, 104, 016026.\n\n\n\nHNLser_cosm3\nBoyarsky, A.; Ovchinnikov, M.; Ruchayskiy, O.; Syvolap, V. \nImproved big bang nucleosynthesis constraints on heavy neutral leptons.\nPhys. Rev. D 2021, 104, 023517.\n\n\n\nlep_univ\nAsaka, T.; Eijima, S.; Takeda, K.  \nLepton universality in the νMSM.\nPhys. Lett. B 2015, 742, 303–309.\n\n\nMN>100\nAsaka, T.; Eijima, S. \nDirect search for right-handed neutrinos and neutrinoless double beta decay.  \nPTEP 2013, 11, 113B02.\n\n\n\ncanetti_13\nCanetti, L.; Drewes, M.; Frossard, T.; Shaposhnikov, M.\nDark matter, baryogenesis and neutrino oscillations from right-handed neutrinos.\nPhys. Rev. D 2013, 87, 093006.\n\n\nmp\nMohapatra, R.N.; Pati J.C.\nA natural left-right symmetry.\nPhys. Rev. D 1975, 2558\n\n\n\n\n\n\n\ncasas_ibarra\nCasas, J.; Ibarra, A.  \nOscillating neutrinos and μ→ e, γ,\nNucl. Phys. B 2001, 618, 171.\n\n\n\nwhite\nAdhikari, R.; Agostini, M.; Ky, N.A.; Araki, T.; Archidiacono, M.; Bahr, M.; Baur, J.; Behrens, J.; Bezrukov, F.; Dev, P.B.; et al.\nA White Paper on keV Sterile Neutrino Dark Matter. \nJCAP 2017, 01, 025.\n\n\n\n\nbilenky\nBilenky, S.M.; Petcov, S.T.\nMassive neutrinos and neutrino oscillations. \nRev. Mod. Phys. 1987, 59, 671;\nErratum in: 1988, 60, 575;\nErratum in: 1989, 61, 169.\n\n\n\nmolinaro\nIbarra, A.; Molinaro, E.; Petcov, S.\nTeV scale see-saw mechanisms of neutrino mass generation, the Majorana nature of the heavy singlet neutrinos and (ββ) 0 ν-decay.\nJ. High Energ. Phys. 2010, 09, 108.\n\n\nDK_jetp\nDubinin, M.N.; Kazarkin D.M. \nImproved cosmological bounds for a fine-tuned see-saw mechanism of keV sterile neutrinos. arXiv 2022, arXiv:2206.05186.\n\ndas_22\nDas, P.; Das, M.K.; Khan, N. \nFive-zero texture in neutrino-dark matter model within the framework of minimal extended seesaw.\nNucl. Phys. B 2022, 980, 115810.\n\n\nDFK\nDubinin, M.N.; Fedotova, E.Y.; Kazarkin, D.M.  \nCosmological constraints for three generations see-saw mechanism of keV sterile neutrinos.\nPhys. Part. Nucl. Lett. 2023, 20\n(in press).\n\ngrounau\nGronau, M.; Leung, C. N.; Rosner, J. L.\nExtending limits on neutral heavy leptons.\nPhys. Rev. D 1984, 29, 2539\n\nDK_lep_un\nDubinin, M.N.; Kazarkin, D.M. \nLepton universality in a model with three generations of sterile Majorana neutrinos. arXiv 2022, arXiv:2212.11310.\n\ndrewes_LNV\nDrewes, M.; Klarić, J.; Klose, P.\nOn lepton number violation in heavy neutrino decays at colliders.\nJHEP 2019, 11, 032.\n\n\nshap_leptogenesis\nShaposhnikov, M. \nThe νMSM, leptonic asymmetries, and properties of singlet fermions.\nJHEP 2008, 8, 008.  \n\n\n\n\n\n\n\n"}