{"entry_id": "http://arxiv.org/abs/2303.06679v1", "published": "20230312145048", "title": "RotoGBML: Towards Out-of-Distribution Generalization for Gradient-Based Meta-Learning", "authors": ["Min Zhang", "Zifeng Zhuang", "Zhitao Wang", "Donglin Wang", "Wenbin Li"], "primary_category": "cs.CV", "categories": ["cs.CV"], "text": "\n\n\n\n\n\n\n\nJournal of  Class Files, Vol. 14, No. 8, August 2021\nShell et al.: A Sample Article Using IEEEtran.cls for IEEE Journals\n\n\n\n\n\nRotoGBML: Towards Out-of-Distribution Generalization for Gradient-Based Meta-Learning\n    Min Zhang^1, 2, Zifeng Zhuang^2, Zhitao Wang^2, Donglin Wang^2, †, Wenbin Li^3\n^† Corresponding author, ^1 Zhejiang University, ^2 Westlake University\n^3 Nanjing University, liwenbin@nju.edu.cn\n{zhangmin, zhuangzifeng, wangzhitao, wangdonglin}@westlake.edu.cn\n\n\n\n    March 30, 2023\n==========================================================================================================================================================================================================================================================================\n\n\n\n\n    Gradient-based meta-learning (GBML) algorithms are able to fast adapt to new tasks by transferring the learned meta-knowledge, while assuming that all tasks come from the same distribution (in-distribution, ID). However, in the real world, they often suffer from an out-of-distribution (OOD) generalization problem, where tasks come from different distributions. OOD exacerbates inconsistencies in magnitudes and directions of task gradients, which brings challenges for GBML to optimize the meta-knowledge by minimizing the sum of task gradients in each minibatch. To address this problem, we propose RotoGBML, a novel approach to homogenize OOD task gradients. RotoGBML uses reweighted vectors to dynamically balance diverse magnitudes to a common scale and uses rotation matrixes to rotate conflicting directions close to each other. To reduce overhead, we homogenize gradients with the features rather than the network parameters. On this basis, to avoid the intervention of non-causal features (e.g., backgrounds), we also propose an invariant self-information (ISI) module to extract invariant causal features (e.g., the outlines of objects). Finally, task gradients are homogenized based on these invariant causal features. Experiments show that RotoGBML outperforms other state-of-the-art methods on various few-shot image classification benchmarks.\n\n\n\n    Out-of-distribution, Few-shot learning, Gradient-based meta-learning, Multi-task learning\n\n\n\n§ INTRODUCTION\n\nDeep learning has achieved great success in many real-world applications such as visual recognition <cit.> and natural language processing <cit.>.\nHowever, deep learning relies heavily on large-scale training data, showing the limitation of not being able to effectively generalize to small data regimes.\nTo overcome this limitation, researchers have explored and developed a variety of meta-learning algorithms <cit.>, whose goal is to extract the meta-knowledge over the distribution of tasks rather than instances, and hence compensate for the lack of training data. Among the two dominant strands of meta-learning algorithms, we prefer gradient-based <cit.> over metric-based <cit.> for their flexibility and effectiveness. Unfortunately, most of these researches have a restrictive assumption that each task comes from the same distribution (in-distribution, ID). However, distribution shifts among tasks are usually inevitable in real-world scenarios <cit.>.\n \nIn this paper, we consider a realistic scenario, where each minibatch is constructed of tasks from different distributions or datasets (out-of-distribution, OOD). Surprisingly, through repeated experiments, we found that the OOD tasks seriously affect the performance of GBML, e.g., the performance of MAML drops from 75.75% to 54.29% with CUB dataset under the 5-way 5-shot setting. \nIntuitively, we explain the possible reason from the optimization objective of the meta-knowledge.\nSpecifically, GBML algorithms learn the meta-knowledge by minimizing the sum of gradients for each minibatch of tasks (see equation (<ref>)).\nIf task gradients have a significant inconsistency, it may cause the learned meta-knowledge to be dominated by certain tasks with large gradient values and fail to generalize to new tasks, affecting the performance of GBML algorithms.\nThe OOD generalization problem exacerbates the phenomenon, where task gradients are inconsistent. \nTo demonstrate the impact of the OOD problem on task gradients in each minibatch, we next give an illustrative example.\n\n\n \nWe take two different distributions to evaluate the impact in Figure <ref>.\nThe optimization process of meta-knowledge in GBML has two loops: an inner-loop at task space (Figure <ref> (a) and (c)) and an outer loop at meta space (Figure <ref> (b) and (d)). \nWe randomly sample two OOD tasks (task1 and task2) from the two different distributions and represent them using green and gray contour lines, respectively.  \nFirst, in the task space, each task learns a task-specific parameter ψ_1^τ or ψ_2^τ using the same meta-knowledge ψ. \nThen, in the meta space, the losses of two OOD tasks are calculated using ψ_1^τ and ψ_2^τ and are summed in turn to optimize the meta-knowledge from ψ to ψ^*.\nFrom Figure <ref> (a), it clearly shows that in the whole optimization process, task2 has a large gradient value (the length of g_2 > g_1) and the large gradient dominates the learning process, i.e., the updated meta-knowledge ψ^* is close to task2 in Figure <ref> (b).\nThis causes the learning of meta-knowledge to be dominated by task2 and ignore the existence of task1, and eventually GBML cannot fast adapt to new tasks using the learning meta-knowledge.\nWhen the gradient directions of OOD tasks are conflicting, the meta-knowledge optimized by summing and averaging the two task gradients may counteract each other.    \n\nIn this paper, to solve inconsistencies in task-gradient magnitudes and directions, we propose a simple yet effective framework, RotoGBML, to simultaneously homogenize magnitudes and directions and boost the learning of meta-knowledge in GBML.\nSpecifically, (1) RotoGBML solves the gradient magnitudes by dynamically reweighting task gradients at each step of the learning process, while encouraging the learning of ignored tasks. (2) Instead of directly modifying gradient directions, RotoGBML smoothly rotates each task space, seamlessly aligning gradient directions in the long run (see Figure <ref> (c)). \n(3) To reduce overhead, we use the features instead of network parameters to homogenize task gradients and more details can be found in Section <ref>. \n(4) We also propose an invariant self-information (ISI) module to extract invariant causal features (e.g., object outline), which are used for homogenization.\nThe introduction of ISI is mainly because of the fact that the features learned by neural networks are inevitably interfered with by some non-causal features (e.g., image backgrounds), which in turn affects the homogeneity of task gradients.\nWe theoretically and experimentally demonstrate that the OOD tasks affect meta-knowledge learning process. The main contributions could be briefly summarized as follows:\n\n\n  * We consider a real-world OOD scenario and propose a general RotoGBML algorithm to solve the OOD generalization problem. RotoGBML helps GBML algorithms learn good meta-knowledge by homogenizing task-gradient magnitudes and directions.\n\n  * To reduce memory, we homogenize task gradients at a feature level. Also, we design an invariant self-information (ISI) module to extract the invariant causal features. Homogenizing gradients using these features provides further guarantees for learning robust meta-knowledge. \n\n  * We theoretically evaluate our motivation and experimentally demonstrate the effectiveness of RotoGBML algorithm in various few-shot image classification benchmarks.\n\n\n\n§ PRELIMINARIES\n\n\n\n\n\n §.§ Task formulation in GBML.\n\nIn this paper, a supervised learning setting is considered, where each data point is denoted by (x,y) with x∈ X being the input and y∈ Y being its corresponding label.\nGBML assumes N training tasks {𝒯_i}_i=1^N∼𝒯_tr in each minibatch to be sampled, and an arbitrary testing task 𝒯_i∼𝒯_te is picked.\nFormally, each n-way k-shot task 𝒯_i consists of a support set 𝒮_i=(x_i^s, y_i^s) and a query set 𝒬_i=(x_i^q, y_i^q).\nx_i^s∈ℝ^n_s× d, x_i^q∈ℝ^n_q× d, y_i^s∈ℝ^n_s× n and y_i^q∈ℝ^n_q× n, where d=c× h× w indicates the image size, n_s and n_q denote the number of support and query examples, respectively.\nThe label spaces of training, validation and testing tasks are different, i.e., Y_tr∩ Y_val∩ Y_te =∅.\nMost gradient-based meta-learning (GBML) algorithms have a strict assumption for tasks as:\n\n   In-distribution (ID): each task is randomly sampled from the same distribution ℙ(𝒯), i.e., \n   𝒯_i∼ℙ(𝒯) comes from the task set {𝒯_tr, 𝒯_val, 𝒯_te} with ∀ i.  \n \n\n\nThe assumption indicates a highly restrictive setting due to the following reasons: \n(1) It is contradictory that tasks with disjoint classes come from the same distribution.\n(2) The data collection process is susceptible to some unobservable variables, which can cause distribution shifts even from the same dataset.\nImproving the generalization of gradient-based meta-learning (GBML) algorithms in the real world is very important.\n\n\n\n §.§ Task optimization in GBML.\n\n\nGBML aims to learn a good meta-knowledge and fast adapts to new tasks using two optimization loops (inner loop and outer loop).\nGenerally, the network architectures of GBML contain a feature encoder f_θ parameterized by θ, which is used to extracted features f_θ: ℝ^d→ℝ^m, and a classifier c_ϕ parameterized by ϕ, which is used to output predict labels c_ϕ: ℝ^m→ℝ^n. \nIn the inner loop, the model is grounded to an initialization (or meta-knowledge), i.e., (ϕ, θ), which is adapted to the i-th task in a few gradient steps τ (typically 1 ∼ 10 steps) by using its support set 𝒮_i.\nIn the outer loop, the performance of the adapted model, i.e.  (ϕ_i^τ, θ_i^τ), is measured on the query set 𝒬_i, and in turn used to optimize the initialization from (ϕ, θ) to (ϕ^*, θ^*).\nLet ℒ denotes the loss function and the above interleaved process is formulated as a bi-level optimization,\n\n\n    (ϕ^*, θ^*) := min_(ϕ, θ)1/N∑_i=1^N𝔼_(x_i^q, y_i^q)∼𝒬_iℒ_i(ϕ_i^τ(θ_i^τ(x_i^q)), y_i^q), \n       s.t. (ϕ_i^τ, θ_i^τ) ←min_(ϕ_i^0, θ_i^0)𝔼_(x_i^s, y_i^s)∼𝒮_iℒ_i(ϕ_i^0(θ_i^0(x_i^s)), y_i^s),\n\n\nwhere equations (<ref>) and (<ref>) are the outer-loop and inner-loop, respectively.\n(ϕ_i^0, θ_i^0) = (ϕ, θ) is the initial parameters for the i-th task.\nThe learning of meta-knowledge uses the summed and averaged gradients over all tasks in current batch.\n\n\n\n\n\n\n\n\n§ METHODOLOGY\n\n\nTo improve the generalization ability of GBML algorithms in real-world scenarios, in this paper, we consider an  out-of-distribution (OOD) setting, i.e., all tasks randomly sampled from a distribution set {ℙ_i(𝒯)}_i=1^N. A new assumption on the OOD task distributions is proposed as follows:\n\n   Out-of-distribution (OOD): each task comes from the different distributions {ℙ_i(𝒯)}_i=1^N, i.e., 𝒯_i∼ℙ_i(𝒯) and 𝒯_j∼ℙ_j(𝒯) with ∀ i, j, i ≠ j and ℙ_i(𝒯) ≠ℙ_j(𝒯).    \n   \n\n\nTo solve the problem that OOD exacerbates the inconsistencies of task-gradient magnitudes and directions, we introduce RotoGBML, a novel algorithm that consists of two building blocks:\n(1) Reweighting OOD task-gradient magnitudes. \nA reweighted vector set 𝐰_ω={ω_i}_i=1^N parameterized by ω is used to normalize the magnitudes to a common scale (see Section <ref>);\n(2) Rotating OOD task-gradient directions. \nA rotation matrix set R_γ={γ_i}_i=1^N parameterized by γ is used to rotate the directions close to each other (see Section <ref>).\nThe two blocks complement each other and facilitate meta-knowledge to learn common information of all tasks in each minibatch, thereby fast adapting to new tasks with only a few samples. The optimization of RotoGBML is re-defined as:\n\n\n    (ϕ^*, θ^*) := min_(ϕ,θ)1/N∑_i=1^N𝔼_(x_i^q, y_i^q)∼𝒬_iω_iℒ_i(ϕ_i^τ(γ_iθ_i^τ(x_i^q)), y_i^q), \n       s.t. (ϕ_i^τ, θ_i^τ) ←min_(ϕ_i^0, θ_i^0)𝔼_(x_i^s, y_i^s)∼𝒮_iℒ_i(ϕ_i^0(θ_i^0(x_i^s)), y_i^s).\n\n\nWe use red to annotate the differences between the generic GBML and RotoGBML.\nIt clearly shows that a set of corresponding ω_i and γ_i for each task at each batch is used to homogenize gradients in the outer loop optimization process.\nAnd, if task-gradient magnitudes and directions are consistent,  the equation (<ref>) degenerates into the equation (<ref>). \nIt is worth mentioning that our proposed RotoGBML algorithm is a model-agnostic method that can be equipped with arbitrary GBML algorithms (More details is given in Section <ref>).\n\n\n\n §.§ Reweighting OOD Task-Gradient Magnitudes\n\n\nHow to determine the value of 𝐰_ω? \nThis is a key challenge for reweighting OOD task-gradient magnitudes.\nMost previous works on multi-task learning use static approaches, such as hyperparameters or prior assignment <cit.>. However, these methods are difficult to adapt to the learning process due to the use of fixed values 𝐰_ω={ω_i}_i=1^N for each task. \nIn Table <ref>, the experiments of static reweighted vector evaluate the phenomenon. \nInstead, we dynamically adjust ω_i to adapt task distribution shifts by using an optimization strategy over the training iterative process. \n  \nSpecifically, we initialize {ω_i=1|i∈ N} for each task in each batch 𝒯_b={𝒯_i|i∈ N}, which aims to treat each task equally at the beginning.\nThen, the reweighted vector set is dynamically adjusted by using average gradient norms for the current batch during training.\nThe optimization objective is as: \n\n    ω^* := min_ω∑_i=1^N𝔼_(x_i^q, y_i^q)∼𝒬_iℒ_ω_i(θ_i^τ, x_i^q, y_i^q), \n       s.t. ℒ_ω_i = g_wi - g̅_wb× [I_i]^β_1,\n\nwhere ·_1 is the ℓ_1-norm.\ng_wi=∇_θω_iℒ_i(θ_i^τ(x_i^q), y_i^q)_2 is the ℓ_2-norm of the gradients for each reweighted task loss ω_iℒ_i in outer loop.\ng̅_wb=1/N∑_i=1^N g_wi is the average gradient for 𝒯_b.\nIn our experimental settings, we only use the gradients of feature encoder θ to optimize the reweighted vector set 𝐰_ω. \nThis operation not only saves compute times but also is reasonable because the feature knowledge is more helpfule for the generalization of GBML algorithms <cit.>.\nI_i aims to balance each task gradient and the formulation is\nas follows:\n\n    I_i = ℒ̂_i/∑_i=1^Nℒ̂_i, \n               s.t. ℒ̂_i = ℒ_i/ℒ_i^0,\n\nwhere ℒ_i is the cross-entropy loss for query set in outer loop and ℒ_i^0 is the initial loss to be determineed as log(n) and n is classes.\n\nSpecifically, the vaule of I_i is used to adjust the tasks of learning too fast or too slow, i.e., the lower value of I_i encourages the task to train more slowly, and vice versa. \n\nIn equation (<ref>), a novel hyperparameter β is introduced to control the learning rate of each task.\nWhen the distributions of tasks very different, a higher β should be used to produce the large learning rate.\nConversely, a lower β is appropriate for similar tasks.\nNote that β=0 means the learning rate is equal for all tasks.\nThe dynamically optimized ω_i can be integrated into the learning process to homogenize task-gradient magnitudes. \nIn the next section, we describe how to resolve conflicts of task directions in each batch. \n\n\n\n §.§ Rotating OOD Task-Gradient Directions\n\n\nHow to define and learn the matrix of R_γ?\nThis is a key challege for rotating OOD task-gradient directions.\n(1) Definition.\nMotivated by previous work <cit.>, we initialize R_γ∈ SO(M), where SO(M) is special orthogonal group to denote the set of all rotation matrix γ_i with size M (the network parameters).\nDue to the large size of M, to reduce overhead, we focus on feature-level task gradients ∇_ẑ_i^qℒ_i (rather than ∇_θℒ_i).\nThis is reasonable due to chain rule ∇_θℒ_i = ∇_θẑ_i^q·∇_ẑ_i^qℒ_i, where ẑ_i^q = γ_iz_i^q, z_i^q = θ_i^τ(x_i^q).\nFinally, R_γ∈ SO(m) is used, where m is the size of feature dimensions.\n(2) Learning.\nR_γ aims to reduce the direction conflict of the task gradients in each batch by rotating the feature space.\nWe optimize γ_i to make task spaces closer to each other and the objective is to maximize the cosine similarity or to minimize\n\n\n    γ^* := min_γ∑_i=1^N𝔼_(x_i^q, y_i^q)∼𝒬_iℒ_γ_i(θ_i^τ, x_i^q, y_i^q),  \n       s.t. ℒ_γ_i = - <γ_ig_i, g̅_rb>,\n\nwhere g_i=∇_θℒ_i(θ_i^τ(x_i^q), y_i^q), g_ri=γ_ig_i=∇_ẑ_i^qℒ_i(γ_iθ_i^τ(x_i^q), y_i^q) and g̅_rb=1/N∑_i∈ Ng_ri is the average gradient for 𝒯_b.\nThe optimization of the reweighted vector set in equation (<ref>), the rotation matrix set in equation (<ref>) and the neural network in equation (<ref>) can be interpreted as a Stackelberg game: a two player-game in which the leader and follower alternately move to minimize their respective losses, and the leader knows how the followers will react to their moves. \nSuch an interpretation allows us to derive simple guidelines to guarantee training convergence, i.e., the network loss does not oscillate as a result of optimizing the two different objectives. We introduce more details in Appendix.\n\n\n\n §.§ Invariant Self-Information\n\n\nAs mentioned above, we homogenize the task gradients from feature level. However, these features learned by neural network are susceptible to some biases, e.g., image backgrounds or textures <cit.>.\nFor example, in an image of a coat shape with a dog skin texture, the CNN tends to classify it as a dog rather than a coat. This is because the neural network trained with empirical risk minimization (ERM) are more prone to inrobust texture features and ignore robust shape features <cit.>. \nIn this section, we further introduce the invariant self-information (ISI) module to extract the robust shape features as invariant causal features.\nWe homogenize OOD task gradients based on these invariant causal features, which helps the reweighted vector set and the rotation matrix set avoid being affected by these biases (e.g., texture features).\n\nHow to extract the robust shape features? \nSince there are no existing corresponding shape labels, this is a challenging problem.\nGiven an image, we observe that the shape regions tend to be more pronounced and carry a high information compared with neighboring regions.\nTherefore, at each layer of the neural network, we learn shape features by saving neurons that extract high-informative regions and zeroing out neurons in low-informative regions.\nSpecifically, we first extract features z_i^l∈ℝ^c^l× k× k from input data x_i∈ℝ^c× h× w in i-th task 𝒯_i, where l is the l-th layer of the neural network. Then a drop coefficient d is proposed to drop these less-information regions:\n\n    d(z_i,c^l) ∝ e^-ℐ(p_i,k^l-1)/T, \n       s.t. ℐ(p_i,k^l-1) = -log q_i,k^l-1(p_i,k^l-1),\n\nwhere p_i,k^l-1 is the k-th region for c-th channel's in z_i^l-1 and p_i,k^l-1∈ℝ^c_l-1× k× k. p_i,k^l-1 is sampled from the defined distribution q_i,k^l-1. ℐ denotes self-information and T is temperature. When the amount of information of p_i,k^l-1 is low, that is, the value of this part of the self-information ℐ is low, the corresponding neuron is not optimized. \n\nTo evaluate q_i,k^l-1, we use Manhattan radius C to obtain (2C+1)^2 regions as the neighbourhood of p_i,k^l-1. And, we also assume that p_i,k^l-1 and its neighbourhood regions 𝒩_i,k^l-1 come from the same distribution.\nWe approximate q_i,k^l-1(·) with its kernel desity estimator and these neighbouring regions, the approximate  representation q̂_i,k^l-1 is shown as follows:\n\n    q̂_i,k^l-1(p) = 1/(2C+1)^2∑_p^'∈𝒩_i,k^l-1K(p, p^'),\n\nwhere K(·, ·) is kernel function. \nA Gaussian kernel is used, i.e., K(p, p^')=1/√(2π)hexp(-1/2h^2p-p^'^2), where h is the bandwidth.\nThen the information of p_i,k^l-1 is estimated by\n\n    ℐ̂(p_i,k^l-1) = -log {∑_p^'∈𝒩_i,k^l-1e^-1/2h^2p_i,k^l-1-p^'^2}.\n\n\nIf the more information is included, it can be observed that the larger the difference between p_i,k^l-1 and its neighbourhood regions 𝒩_i,k^l-1. In other words, shapes are more unique in their surroundings and thus more informative.\n\n\n\n §.§ Implementation\n\n\nWe summarize the overall proposed approach in Algorithm <ref>.\nIn this paper, we consider a more challenging and real-world setting, i.e., tasks are randomly sampled from different distributions during training and testing phases.\nIn the training phase, we first use the invariant self-information (ISI) module to extract the invariant causal features.\nThen, based on these invariant features, we use the reweighted vector set 𝐰_ω to reweight task-gradient magnitudes and the rotating matrix R_γ to rotate task-gradient directions.\nFinally, these homogenized task gradients are used to optimize the meta-knowledge in equation <ref>.\nIn the testing phase, invariant self-information (ISI) module is removed to examine whether our network has truly learned invariant features.\nWe also remove 𝐰_ω and R_γ to evaluate the performance of meta-knowledge learned by gradient-based meta-learning (GBML) algorithms.\n\n\n\n\n§ THEORETICAL ANALYSIS\n\n\nIn this section, we first theoretically investigate why OOD acerbates inconsistencies in task magnitudes and directions.\nWe sample two tasks from different distributions, where 𝒯_i=(𝒮_i, 𝒬_i)∼ℙ_i(𝒯) and 𝒯_j=(𝒮_j, 𝒬_j)∼ℙ_j(𝒯) with i ≠ j. In outer loop, the gradient difference is calculated as:\n\n    d_ij =    ∇_(ϕ,θ)ℒ_i(ϕ_i^τ(θ_i^τ(x_i^q)), y_i^q) \n       - ∇_(ϕ,θ)ℒ_j(ϕ_j^τ(θ_j^τ(x_j^q)), y_j^q),\n\nwhere g_i=∇_(ϕ,θ)ℒ_i(ϕ_i^τ(θ_i^τ(x_i^q)), y_i^q) and g_j=∇_(ϕ,θ)ℒ_j(ϕ_j^τ(θ_j^τ(x_j^q)), y_j^q) are gradients of task 𝒯_i and 𝒯_j, respectively.\nTo bridge the connections of task distributions and task gradients, we introduce Total Variation Distance (TVD) to re-estimate d_ij on the task distribution.\nThe definition of Total Variation Distance (TVD) is shown as follows:\n\n    (Total Variation Distance (TVD)) For two distributions P and Q, defined over the sample space Ω and σ-field ℱ, the TVD is defined as P-Q_T V:=sup _A ∈ℱ|P(A)-Q(A)|.\n    \n\nIt is well-known that the total variation distance (TVD) admits the following characterization\n\n    P-Q_T V=sup _f: 0 ≤ f ≤ 1𝔼_x ∼ P[f(x)]-𝔼_x ∼ Q[f(x)].\n\n\n    The difference of task gradients d_ij=g_i-g_j can be bounded by the TVD as: \n    \n    d_ij≤ 4 η_base GL ℙ_i(𝒯)-ℙ_j(𝒯)_TV,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nwhere η_base is the learning rate of the inner loop. The G, L and more proofs are introduced in Appendix. \nWhen ℙ_i(𝒯) ≠ℙ_j(𝒯), there is a gradient difference between 𝒯_i and 𝒯_j.\nThen, we analyze that RotoGBML can narrow the difference between task gradients from Cosine Theorem <cit.>.\nWhen viewing gradients as a vector, the value of d_ij is simplified to calculate the length of the third edge d_ij=g_i-g_j using Cosine Theorem in Figure <ref> (left). Based on Cosine Theorem, equation (<ref>) can be re-expressed as √(g_i^2+g_j^2-2g_ig_jcos<g_i, g_j>), where · means the length of the vector and cos<·, ·> is the consine angle between two vectors. \nRotoGBML homogenize task gradients by reweighting task-gradient magnitudes from g_i, g_j to g_i^*, g_j^*, respectively and rotating task-gradient directions from cos<g_i, g_j> to cos<g_i^*, g_j^*> to narrow the task gradients difference from d_ij to d_ij^* in Figure <ref> (right).\n\n\n§ RELATED WORK\n \n\n\nGBML for few-shot image classification.\nA plethora of GBMLs have been proposed to solve the few-shot image classification problem. \nThe goal of these algorithms is to fast adapt to new tasks with only a few samples by transferring the meta-knowledge acquired from training tasks <cit.>.\nHowever, these works have a strict assumption that training and testing tasks come from the same distribution, which seriously violates the real world.\n\nRecently, some works <cit.> have been proposed to study the OOD problem of GBML. However, they mainly focus on the shifts caused by training and testing data (e.g., training from miniImageNet, testing from CUB). \nThis setting follows the definition of distribution shifts in traditional machine learning <cit.>.\nThey do not consider the problem from the GBML optimization itself and proposed appropriate algorithms for GBML frameworks.\nWe consider the distribution shifts at the task level due to GBML uses task information of each minibatch to optimize the meta-knowledge.\n\n\n\n\n\n\n\n\nTask gradients homogenization in other fields.\nHomogenization of task-gradient magnitudes and directions is also found in multi-task learning <cit.>. \n\nTheir goal is to simultaneously learn K different tasks, that is, finding K mappings from a common input dataset to a task-specific set of labels (generally K=2).\nMotivated by <cit.>, we regard GBML meta-knowledge learning as a multi-task optimization process and homogenize task gradients from a multi-task perspective.\nOur work differ from these works in: (1) the input data is different for different tasks in GBML, but the input data of different tasks in multi-task learning is the same. (2) In multi-task learning, existing works on alleviating gradient conflicts usually assume that tasks come from the same distribution. However, we address the problem of conflicting gradients in different distributions. (3) We propose a new invariant self-information module to extract causal features.\n\n \n\n\n\n§ EXPERIMENTS\n\n\n\nIn this section, we conduct comprehensive experiments to evaluate the effectiveness of RotoGBML and compare it with state-of-the-art algorithms.\nSpecifically, we consider two OOD generalization problems in few-shot image classification: The weak OOD generalization problem is training and testing tasks from the same dataset but with disjoint classes <cit.>.\nThe strong OOD generalization problem is training and testing tasks from different datasets and has multiple datasets in training data <cit.>. Unlike these works, we use a more difficult setting, i.e., each minibatch of tasks from different datasets. \n\nWe aim to answer the following questions:\nQ1: How does the proposed RotoGBML framework perform for the few-shot image classification task on the weak OOD generalization problem (see Section <ref>)?\nQ2: Can RotoGBML fast generalize to new tasks from new distributions when faced with the strong OOD generalization problem (see Section <ref>)? \nQ3: How well each module (𝐰_ω, R_γ and ISI) in our proposed framework performs in learning the meta-knowledge (see Section <ref>)?\n\nDatasets.\nFor the weak OOD generalization problem, we adopt two popular benchmarks for image classification, i.e., miniImageNet and CUB-200-2011 (abbr: CUB). \nFor the strong OOD generalization problem, we adopt nine benchmarks, including miniImageNet, CUB, Cars, Places, Plantae, CropDiseases, EuroSAT, ISIC and ChestX following prior works <cit.>.\nIn the strong OOD generalization, miniImageNet is used only as training data because of its diversity, and evaluate the trained model on the other eight datasets using a leave-out-of method, i.e., randomly sampled one dataset as testing data and other datasets as training data.\n\n\n\nBackbone of GBML.\nSince our RotoGBML is model-agnostic and can be equipped with arbitrary GBML algorithms, we use five representative and generic GBML algorithms as our GBML backbone including MAML <cit.>, MAML++ <cit.>, ANIL <cit.>, Reptile <cit.>, iMAML <cit.>.\n\nIn all experimental results, iMAML is used as our GBML backbone due to its good performance, unless otherwise stated. \n\nFeature encoders.\nWe follow previous works <cit.> using three general networks as our feature encoder including,\ni.e. conv4 (filter:64), resnet10 and resnet18.\nHowever, it is well known that GBML algorithms (e.g, MAML) under-perform when applied to large networks <cit.>, so we use conv4 to show the main experimental results for the weak OOD generalization.\nFor a fair comparison with some cross-domain methods <cit.>, we follow their setting using resnet10 for the strong OOD generalization. We also show the performance of the three feature encoders in Figure <ref>. \n   \nExperimental setting.\nWe use the Adam optimizer with the learning rate of inner loop η_base=0.01, outer loop η_meta=0.001 and rotation matrix η_γ=5e-4. We set β=0.1 for weak and β=1.5 for strong OOD. We optimize all models from scratch and process datasets using data augmentation following previous work <cit.>. We evaluate the performance under two generic settings, i.e., 5-way 1-shot and 5-shot and report the average accuracy as well as 95% confidence interval.\n\n\n\n\n §.§ Weak OOD Generalization Problem\n\n\nWe conduct experiments on two representative few-shot image classification datasets: miniImageNet and CUB. Table <ref> reports the experimental results. From Table <ref>, we have some findings as follows:\n(1) Compared to Vanilla GBML algorithms (2-nd block), the proposed RotoGBML framework consistently and significantly improves all performances by homogenizing task-gradient magnitudes and directions.\nMoreover, compared to the 95% confidence interval, it is clear that RotoGBML reduces the uncertainty of model predictions and further reduces the high variances of model learning, thereby improving the robustness and generalization.   \n(2) Compared to some state-of-the-art few-shot image classification methods (1-st block), RotoGBML outperforms all methods, including metric-based model (ProtoNet), fine-tuning model (Linear), pretrain-based model (MTL) and  knowledge-distillation-based model (SKD-GEN1).\nThis further demonstrates the effectiveness of our proposed RotoGBML algorithm, while also providing a new solution for existing gradient-based meta-learning (GBML) algorithms to outperform metric-based meta-learning methods. \n\nWe also compare the performance of the model with different feature encoders (conv4, resnet10 and resnet18) in Figure <ref>.\nWe can find that (1) our proposed RotoGBML algorithm outperforms all existing gradient-based meta-learning (GBML) algorithms in all experimental settings with different network sizes.\n(2) It's worth noting that RotoGBML can alleviate the performance degradation problem of large networks.\nThis is mainly because our proposed ISI module can extract invariant causal features, i.e., the shapes or outlines of objects, which avoid some non-causal features (e.g., the backgrounds, colors or textures of objects) to affect the generalization of large networks on some new tasks from new distributions.\n\n\n\n \n\n\n\n\n\n §.§ Strong OOD Generalization Problem\n\n\nIn this section, we consider a more challenging OOD setting, i.e., each task of each minibatch (typically the number of tasks N=4) comes from different datasets.\nWe compare our method and some state-of-the-art methods with the strong OOD generalization problem in Table <ref>.\nFrom Table <ref>, we have some significant findings as follows:\n(1) Compared to Vanilla GBML algorithms (2-nd block), RotoGBML outperforms all algorithms on eight datasets with different performance gains.\nThese results again prove that our RotoGBML can learn robust meta-knowledge, which in turn generalizes quickly to new tasks from new distributions.\n(2) Compared to some cross-domain methods (1-st block), RotoGBML has a good performance in most settings, which demonstrates that we can help GBML algorithms to achieve state of the art by homogenizing task-gradient magnitudes and directions.\n(3) The improvement of the strong OOD setting is usually larger than that of the weak OOD setting (Table <ref>).\nThe phenomenon justifies our conclusion that the larger the distribution difference, the more obvious inconsistencies in magnitudes and directions of task gradients.\n\nIn Figure <ref>, the performances of the strong OOD problem are shown with different network sizes.\nWe show the results on Cars and EuroSAT as we\nhave similar observations on other datasets.\nCompared to Vanilla GBML algorithms, iMAML has the best performance on the weak OOD problem, but significantly degrades on the strong OOD problem.\nBecause it uses a regularization to encourage task parameters to close to meta parameters, large distribution shifts affect the learning of meta parameters.\nOur RotoGBML can learn good meta parameters by homogenizing task gradients.\n\n\n\n §.§ Ablation Study\n\n\n\n\n  \nThe performance of our proposed three modules\nWe use a hierarchical ablation study to evaluate the performance of each module for RotoGBML under the weak and strong OOD problems in Table <ref>.\nThe 1-st row represents the results of Vanilla iMAML.\nThe plus sign means performance increase and the minus sign means performance decrease, where violet is the weak OOD and blue is the strong OOD experiments. \nTo evaluate the performances of a fixed reweighted vector set, e.g., [0.1,0.5,0.3,0.4] is used for the four tasks in each minibatch in our experiments, the results are shown in the 2-nd row.\nFrom Table <ref>, the following findings:\n(1) compared to Vanilla iMAML, the performances of hyperparameters have a significant drop in most settings, but our dynamic adjustment strategy (3-rd row) has a clear improvement.\nThis further evaluates the effectiveness of our learning method to dynamically optimize the reweighted vectors.\n(2) Each module has different performance gains (3∼5-th rows). Compared to the strong OOD problem, the performances of ISI on the weak OOD problem have a large improvement, because even if invariant features are learned, the strong inconsistencies of task gradients affect the learning of meta-knowledge.\n(3) Arbitrary combination of two modules has good performance in 6∼8-th rows, especially with ISI. This is because adjusting the gradients based on invariant robust information from different distributions can learn better. We also give some visualization experiments of ISI learning invariant features in Figure <ref>.\nAnd all modules are used to have the best performance.\n\n\n\n  \nThe hyperparameter of β\nThe hyperparameter β is introduced in equation (<ref>) in Section <ref>. The β aims to adjust the tasks learning rate and β=0.1 is used for the weak OOD generalization problem and β=1.5 is used for the strong OOD generalization problem.\nIt is because a lower β is appropriate for similar tasks and a higher β should be used for dissimilar tasks.\nMore experimental results for β are shown in Figures <ref> and <ref>, where “None” means the performance of iMAML and the bars with “red” represents the performance of our method (iMAML-).\n\nFrom Figures <ref> and <ref>, β=0 damages the performance of vanilla iMAML in the strong OOD generalization problem. \nThe main reason is that β = 0 tries to pin the backpropagated gradients of each task to be equal at network parameters. \nFor the strong OOD generalization problem, this is unreasonable since each task comes from a different distribution, which varies widely from each other.\nMoreover, we have two hyperparameters and experiment with a control variable strategy.\n\n\n\n  \nThe hyperparameter of temperature T\nThe hyperparameter of temperature T is used as a “soft threshold\" of information in equation (<ref>) in Section <ref>. When T is small, this means more conservative filtering, i.e., only patches with the least information will be dropped and most shape and texture are preserved. When T goes to infinity, all neurons will be dropped with equal probability, and the whole algorithm becomes regular Dropout <cit.>. As mentioned above, we have two hyperparameters, so we adopt a strategy of fixing one to experiment with the other. The experimental results are shown in Figure <ref> under the 5-way 1-shot and Figure <ref> under the 5-way 5-shot setting, where “None” means the performance of iMAML, “INF” means that it degrades to regular Dropout and the bars with “red” represents the performance of our method (iMAML-). \n\nFrom Figures <ref> and  <ref>, we find that the strong OOD generalization problem uses a larger temperature than the weak OOD generalization problem.\nThis phenomenon is consistent with our analysis, because the strong OOD generalization problem has greater distribution differences than the weak OOD generalization problem, and more useless information needs to be dropped.\n\n\n\n  \nVisualization of the invariant self-information module\nWe propose the invariant self-information (ISI) module to avoid some non-causal features to affect the generalization of the neural network on some new tasks from new distributions in Section <ref>.\nMotivated by <cit.>, we extract the robust shape features as invariant causal features.\nTo verify the learning of shape features with the ISI module, we visualize gradients of model output using the saliency map.\nSpecifically, we use SmoothGrad <cit.> to calculate the saliency map S(x):\n\n\n    S(x) = 1/n∑_i=1^n∂ f(x_i)/∂ x_i,\n \n\nwhere x_i = x + δ_i is original image x with i.i.d. Gaussian noise δ_i and f(·) is the network. \nThe experiments are shown in Figure <ref>, where these original images are randomly sampled from the nine datasets used in our experiments.\nWe can see that ISI is more human-aligned and sensitive to the shapes of objects. While the Saliency map of the baseline (iMAML) algorithm is filled with noise, which indicates the baseline method is less shape-biased and lacks interpretability.\nAlthough on some difficult examples (the 3-rd, 4-th and 5-th columns), our ISI module also has impressive performance. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\nIn this paper, we address the challenging problem of learning a good meta-knowledge of gradient-based meta-learning (GBML) algorithms under the OOD setting. We show that OOD generalization exacerbates the inconsistencies in task-gradient magnitudes and directions. Therefore, we propose RotoGBML, a general framework to dynamically reweight diverse magnitudes to a common scale and rotate conflicting directions close to each other. Moreover, we also design an invariant self-information (ISI) module to extract the invariant causal features. Homogenizing gradients using these causal features provide further guarantees for learning robust meta-knowledge. Finally, we analyze the feasibility of our method from the theoretical and experimental levels. We believe that our work makes a meaningful step toward adjusting task gradients under the OOD problem for GBML.\n\n\n\n\n\nIEEEtran\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ THEORETICAL ANALYSIS\n\n\n\n\n\n\n\n §.§ RotoGBML as Stackelberg games\n\n\nThe optimization objective of learning the meta-knowledge in GBML algorithms has two loops: an inner loop and an outer loop. In the outer loop, we simultaneously optimize the network parameters (ϕ, θ) and the module parameters of (ω, γ).\nThe two optimization objectives can be interpreted as a Stackelberg game <cit.>, which is an asymmetric game with players playing alternately. The neural networks (ϕ, θ) are called as the follower to minimize their loss function. The reweighted vector set and rotation matrix set (ω, γ) are named as the leader. Compared to the follower, the leader attempts to minimize their own loss function, but it does so with the advantage of knowing which will be the best response to their movement by the follower. The problem can be written as:\n\n    Leader:  min_(ω, γ){ℒ_(ω, γ)(ω, γ, ϕ, θ)| (ϕ, θ)∈min_(ϕ, θ)∑_i=1^Nℒ_i(ϕ, θ, ω, γ) },  \n        Follower:  min_(ϕ, θ)∑_i=1^Nℒ_i(ϕ, θ, ω, γ) .\n\nThe leader knows the global objective while the follower only has access to their own local loss function. In gradient-play Stackelberg game, all players perform gradient updates at s-th step:\n\n    (ω^s, γ^s)    = (ω^s-1, γ^s-1) - η_(ω, γ)∇_(ω, γ)ℒ_(ω^s-1, γ^s-1)(ω^s-1, γ^s-1, ϕ^s-1, θ^s-1),   \n    \n        (ϕ^s, θ^s)    = (ϕ^s-1, θ^s-1) - η_(ϕ, θ)∑_i=1^N∇_(ϕ^s-1, θ^s-1)ℒ_i(ϕ^s-1, θ^s-1, ω^s-1, γ^s-1),\n\nwhere η_(ω, γ) and η_(ϕ, θ) are the learning rates of the RotoGBML and neural network, respectively. \n\nEquilibrium is an important concept in game theory, the point at which both players are satisfied with their situation, meaning that there is no action available that can immediately improve any player's score.\nIf the two players can converge to an equilibrium point, this also guarantees the convergence of the training phase.\nWe introduce the definition of Stackelberg equilibrium <cit.>:\n\n\n    (Differential Stackelberg equilibrium).  If ∇_(ω, γ)ℒ_(ω, γ)(ω, γ, r(ω, γ))=0 and ∇_(ω, γ)^2ℒ_(ω, γ)(ω, γ, r(ω, γ)) is positive definite, the pair of points (ϕ, θ), (ω, γ) is a differential Stackelberg equilibrium point and (ϕ, θ)=r(ω, γ) is implicitly defined by ∇_(ϕ, θ)ℒ_i(ϕ, θ, ω, γ)=0.\n\n\n\n\n\nWhen the players manage to reach such an equilibrium point, both of them are at a local optimum. Therefore, here we also provide theoretical convergence guarantees for an equilibrium point.\n\n    In the given setting, if the leader's learning rate η_(ω, γ) goes to zero at a faster rate than the follower's η_(ϕ, θ), that is, they will asymptotically converge to a differential Stackelberg equilibrium point almost surely.\n    \n\nAs long as the follower learns faster than the leader, they will end up in a situation where both are satisfied. In our experiments, the learning rate of the follower is 1e-3 and that of the leader is 5e-4.\n\n\n\n §.§ Proof of Theorem 4.1\n\n\nIn our main paper, we propose the Theorem 4.1 to bound the difference of task gradients d_ij=g_i-g_j≤ 4 η_base GL ℙ_i(𝒯)-ℙ_j(𝒯)_TV by using the total variation distance (TVD) based on an assumption of G and L. Motivated by previous work <cit.>, the assumption is defined as follows:\n\n\n   For any x∈ X, the loss function ℒ(·, x) is twice continuously differentiable. Furthermore, we assume it satisfies the following properties for any ψ=(ϕ,θ), ψ̅=(ϕ̅, θ̅):\n   \n       \n  * The gradient norm is uniformly bounded by G over ψ, i.e., ∇ℒ(ψ, x)≤ G.\n       \n  * The loss is L-smooth, i.e., ∇ℒ(ψ, x) - ∇ℒ (ψ̅, x) ≤ L ψ- ψ̅.\n   \n   \n\n\n\n\n\n𝒯_i=(𝒮_i, 𝒬_i)∼ℙ_i(𝒯) and 𝒯_j=(𝒮_j, 𝒬_j)∼ℙ_j(𝒯) with i ≠ j are randomly sampled from the different distributions. The difference of task gradients is definited as follows:\n\n    d_ij   = ∇_ψℒ_i(ψ_i^τ(x_i^q), y_i^q) - ∇_ψℒ_j(ψ_j^τ(x_j^q), y_j^q) ,  \n       = ∇_ψℒ_i(ψ- in_i, x_i^q, y_i^q) - ∇_ψℒ_j(ψ - in_j, x_j^q, y_j^q),    \n        = 𝔼_{(x_i^k, y_i^k)∼𝒬_i∼ℙ_i(𝒯)}_k=1^n_q∇_ψℒ_i(ψ- in_i, x_i^k, y_i^k)  \n               - 𝔼_{(x_j^k, y_j^k)∼𝒬_j∼ℙ_j(𝒯)}_k=1^n_q∇_ψℒ_j(ψ- in_j, x_j^k, y_j^k) ,   \n       where in_i = η_base𝔼_{(x_i^k, y_i^k)∼𝒮_i∼ℙ_i(𝒯)}_k=1^n_s∇_ψ_i^τℒ_i(ψ_i^τ-1(x_i^k), y_i^k),  \n                          in_j = η_base𝔼_{(x_j^k, y_j^k)∼𝒮_j∼ℙ_j(𝒯)}_k=1^n_s∇_ψ_j^τℒ_j(ψ_j^τ-1(x_j^k), y_j^k),\n\nwhere n_s and n_q are the number of the support set and query set examples, respectively.\ng_i = ∇_ψℒ_i(ψ_i^τ(x_i^q), y_i^q) and g_j = ∇_ψℒ_j(ψ_j^τ(x_j^q), y_j^q) are the task gradients for 𝒯_i and 𝒯_j using query set in the outer loop, respectively.\nHence, with probability n_qt (ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^t (1-ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^n_q-t, we have x_i^k≠ x_j^k for t choices of k (out of 1,...,n_q). In addition, based on the Assumption <ref>, the equation (<ref>) is bounded as follows:\n\n\n    d_ij   = 𝔼_{(x_i^k, y_i^k)∼𝒬_i∼ℙ_i(𝒯)}_k=1^n_q∇_ψℒ_i(ψ- in_i, x_i^k, y_i^k) - 𝔼_{(x_j^k, y_j^k)∼𝒬_j∼ℙ_j(𝒯)}_k=1^n_q∇_ψℒ_j(ψ- in_j, x_j^k, y_j^k) ,   \n       ≤ 2 η_base L 𝔼_{(x_i^k, y_i^k)∼𝒬_i∼ℙ_i(𝒯)}_k=1^n_q∇_ψℒ_i(ψ_i^τ(x_i^k), y_i^k) - 𝔼_{(x_j^k, y_j^k)∼𝒬_j∼ℙ_j(𝒯)}_k=1^n_q∇_ψℒ_j(ψ_j^τ(x_j^k), y_j^k) , \n       ≤ 4 η_base GL t/K.\n\n\nAs a result, we have\n\n\n    d_ij    = 𝔼_{(x_i^k, y_i^k)∼𝒬_i∼ℙ_i(𝒯)}_k=1^n_q∇_ψℒ_i(ψ- in_i, x_i^k, y_i^k) - 𝔼_{(x_j^k, y_j^k)∼𝒬_j∼ℙ_j(𝒯)}_k=1^n_q∇_ψℒ_j(ψ- in_j, x_j^k, y_j^k) ,  \n       ≤∑_t=0^K Kt (ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^t (1-ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^K-t· 4 η_base GL t/K, \n        = 4 η_base GL (ℙ_i(𝒯) - ℙ_j(𝒯) _TV) ∑_t=0^K t/KKt (ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^t-1 (1-ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^K-t,  \n        = 4 η_base GL (ℙ_i(𝒯) - ℙ_j(𝒯) _TV),\n\n\nwhere the last equality follows from the fact that\n\n\n    t/KKt (ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^t-1 (1-ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^K-t\n          = K-1t-1 (ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^t-1 (1-ℙ_i(𝒯) - ℙ_j(𝒯) _TV)^K-1-(t-1).\n\n\n\n\nTherefore, we can prove the conclusion of d_ij=g_i-g_j≤ 4 η_base GL ℙ_i(𝒯)-ℙ_j(𝒯)_TV.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}