{"entry_id": "http://arxiv.org/abs/2303.06677v1", "published": "20230312143706", "title": "Realization of all-optical underdamped stochastic Stirling engine", "authors": ["Chuang Li", "Shaochong Zhu", "Peitong He", "Yingying Wang", "Yi Zheng", "Kexin Zhang", "Xiaowen Gao", "Ying Dong", "Huizhu Hu"], "primary_category": "physics.optics", "categories": ["physics.optics"], "text": "\n\t\n\n\n\n\n\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\nThese authors contributed equally to this work.\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\nThese authors contributed equally to this work.\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\n[]gaoxw@zhejianglab.com\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\n[]yingdong@zhejianglab.com\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\n\n\nResearch Center for Quantum Sensing, Intelligent Perception Research Institute, Zhejiang Lab, Hangzhou, 311121, China\nState Key Laboratory of Modern Optical Instrumentation & College of Optical Science and Engineering, Zhejiang University, Hangzhou, 310027, China\n\t\n\t\n\t\n\n\n\n\n\n\n\t\n\n\t\n\nWe experimentally demonstrate a nano-scale stochastic Stirling heat engine operating in the underdamped regime. The setup involves an optically levitated silica particle that is subjected to a power-varying optical trap and periodically coupled to a cold/hot reservoir via switching on/off active feedback cooling. We conduct a systematic investigation of the engine's performance and find that both the output work and efficiency approach their theoretical limits under quasi-static conditions. Furthermore, we examine the dependence of the output work fluctuation on the cycle time and temperature difference between the hot and cold reservoirs. We observe that the distribution has a Gaussian profile in the quasi-static regime,  whereas it becomes asymmetric and non-Gaussian as the cycle duration time decreases. This non-Gaussianity is qualitatively attributed to the strong correlation of the particle’s position within a cycle in the non-equilibrium regime. Our experiments provide valuable insights into stochastic thermodynamics in the underdamped regime and open up new possibilities for the design of future nano-machines.\n\n\n\n\n\n\t\n\n\n\n\nRealization of all-optical underdamped stochastic Stirling engine\n    Huizhu Hu\n    March 30, 2023\n=================================================================\n\n\n\nThermodynamics deals with the relations between heat, work, temperature, entropy, and energy <cit.>. At its heart, is the heat engine, operating periodically between two reservoirs with different temperatures. Unlike its macroscopic counterpart that the deterministic classical thermodynamic laws can very well describe, a heat engine of micro- or nano-size will undergo visible fluctuations <cit.>, which makes it behave in a stochastic manner. In this regime, central concepts of thermodynamics such as the exchanged heat, the applied work, and the entropy can be meaningfully defined on the level of individual trajectories  <cit.>. These fluctuating quantities extend the laws of macroscopic thermodynamics and give birth to the so-called stochastic energetics <cit.>. With the advancement in the fabrication of microscopic mechanical devices, significant progress in the study of stochastic heat engines, both theoretical <cit.> and experimental <cit.>, have been witnessed during the past decade.\n\nA promising candidate for the experimental investigation of the stochastic thermodynamics <cit.> is the levitated optomechanical system (LOS) <cit.>, where optical tweezers allow us to apply a fast and accurate control to the particle captured and record its spatial trajectory in real-time <cit.>.\nAfter a full description of a colloidal stochastic heat engine <cit.> given by Schmiedl and Siefert, Blickle and Bechinger realized a stochastic Stirling engine experimentally <cit.> for the first time. The efficiency of the Stirling engine is fundamentally limited by the isochoric steps, which make the cycle inherently irreversible. To overcome the limitations of the Stirling cycle, Martinez et al. implemented a Brownian Carnot cycle <cit.> with an optically trapped colloidal particle by creating an effective hot temperature bath with fluctuating electromagnetic fields, which allowed precise control over the bath temperature that is synchronized with the change of the trap stiffness and therefore a realization of an adiabatic ramp.\n\nSo far, the implementations of stochastic heat engines (SHEs) with a levitated microscopic particle are all in colloidal systems where the particle is overdamped <cit.>. The SHEs in the underdamped regime have been less investigated experimentally yet. We know that an analytic treatment of optimal protocols is possible in the overdamped case because the dynamics can be described by a simplified equation in terms of the slow position variable <cit.>. In contrast, this is not possible in the underdamped case, where the position and velocity variables cannot be separated. As a result, the optimization of an underdamped SHE for maximizing its performance is much more complicated than an overdamped one. Theoretical analysis showed that rapid changes in the trapping frequency were desired to improve the power output and the efficiency <cit.>. More importantly, the investigations of much more isolated systems provide a path toward the future realization of quantum heat engines <cit.> or quantum refrigerators <cit.> in LOS and it has been shown that super Carnot efficiencies can be attained by clever reservoir engineering <cit.>. \n\nInspired by a scheme <cit.> proposed by Dechant et al., we present an experimental realization of an all-optical Stirling engine in the underdamped regime. The experimental setup is illustrated in Fig. <ref>(a).\nA charged silica particle of diameter 153.6 nm is levitated in a single-beam optical trap at the pressure of p = 1.0 mbar.\nThe damping rate due to the collision with residual gas molecules is experimentally measured as Γ_th/2π = 1.45 kHz.\n\nThe optical potential is approximately harmonic with a power-dependent stiffness. We thus use an acousto-optic modulator (AOM) to linearly change the optical trap power resulting in a linear variation of the optical trap stiffness. The resulting mechanical oscillation frequency of the particle Ω/2π ranges from 145.3 to 160.4 kHz.\nThe surrounding gas environment coupling to the center of mass (COM) motion of the particle acts as the high-temperature reservoir (hot bath).\nThe active feedback cooling, using electric fields to exert a force on the particle’s motion and providing an additional feedback damping rate Γ_fb, creates a controllable low-temperature reservoir (cold bath).\nA quadrant photodetector (QPD) monitors the motion of the particle so that its position trajectory can be accurately recorded.\nTo realize a stochastic Stirling cycle consisting of two isothermal and two isochoric strokes, we employ a signal generator (SG) to periodically output two synchronized signals, which are inputted into the AOM to change the optical trap power and into the switch to turn on/off the feedback cooling, respectively.\nThe detail of the experimental setup and protocol can be found in the caption of Fig. <ref> and the Supplemental Material (SM).\n\n\n\n\n\n\n\nThe model.—As described above, the particle's oscillation frequency is much larger than the damping rate. Therefore, its COM motion is governed by the one-dimensional underdamped Langevin equation <cit.> (we solely focus on the particle's motion along the x axis throughout this work),\n\n\n\n\n    v̇ + Γ v + k(t) x = √(2 k_B T Γ /m )ξ(t),\n\n\nwhere x and v = ẋ respectively denote the position and velocity of the particle. k(t) = m Ω^2 denotes the optical trap stiffness with the particle's mass m and frequency Ω. Γ = Γ_th +Γ_fb is the total damping rate, T is the effective COM temperature, and k_B is the Boltzmann constant. The quantity ξ(t) is a centered Gaussian white noise with ⟨ξ(t)ξ(t^')⟩ = δ(t - t^').\n\n\n\n\n\nA Stirling cycle consisting of two isochoric and two isothermal strokes will be realized in the following steps:\n\n\n\n  * Expansion. Starting from the system in thermal equilibrium with the hot bath at the temperature T_h, it undergoes an isothermal expansion with stiffness k(t) decreasing from k_max to k_min during a time period τ_h. The particle keeps the connection to the hot reservoir via the coupling Γ_th during this stroke. To make sure that the stroke is isothermal, we require that the duration τ_h≫ 1/Γ_th and the oscillator therefore always equilibrates with the reservoir.\n\n\n  * Heat emission. The temperature of the reservoir is reduced to T_c  = Γ_thT_h/(Γ_th + Γ_fd) by switching on the feedback cooling. In this stroke, the particle is instantaneously connected to the cold bath while the stiffness retains constant k(t) = k_min lasting a time duration of τ_hc until its effective temperature of COM equilibrates to T_c.\n\n\n  * Compression. The system undergoes an isothermal compression with the stiffness k(t) increasing back to k_max during a time duration τ_c. In this stage, the oscillator always keeps the connection to the cold bath at the constant temperature T_c.\n\n\n  * Heat absorption. The feedback cooling is switched off so that the particle is connected to the hot reservoir again and reaches back to the equilibrium state at the beginning of the cycle in a period of τ_ch. The stiffness keeps constant k(t) = k_max during this stroke.\n\n\n\t\nThe total duration period of a cycle is then given by τ_cyc = τ_h + τ_hc +  τ_c + τ_ch. Here, we set the four strokes with the equal duration τ_s, i.e., the cycle time τ_cyc = 4τ_s.\nThe schematic representation for a cyclic process of the Stirling engine and \nthe change of the trap stiffness and the effective COM temperature versus time is shown in Fig. <ref> (b) and (c), respectively.\n\n\n\n\n\nOne can draw an analogy between the particle in an optical trap and an ideal gas inside a piston, where the trap stiffness, or equivalently the trapping frequency, is analogous to the inverse of an effective volume while the variance of the particle position is seen as an effective pressure. Under this analogy, thermodynamic quantities can be extracted from the particle's positional fluctuations in the framework of stochastic thermodynamics. The total energy of the particle at time t reads\n\n    U(t) = 1/2 m v(t)^2 + 1/2  k(t) x(t)^2.\n\nThe increment of the energy dU can thus be divided into two parts where the output work is defined as\n\n    dW = 1/2dk/dt x^2 dt\n\nand the heat exchanged with the environment is defined as\n\n    dQ = m v dv/dtdt + kxdx/dtdt.\n\nIntegrating Eq. (<ref>) along a stochastic trajectory yields the time-dependent work during a time duration τ = t_f - t_i as\n\n    W(τ) = 1/2∫_t_i^t_fd k(t)/d t x(t)^2 dt,\n\nwhere t_i (t_f) is the initial (final) time.\nMeanwhile, the work W, heat Q, and inner energy U satisfy the stochastic first-law-like energy balance Δ U = W + Q for any single stochastic trajectory. \n\n\n\n\n\n\n\n\n\n\n\n\nThe experiments.—We experimentally studied the performance of the Stirling engine in the underdamped regime. The optical stiffness linearly change in the range from k_min = 3.29 aN/μm (∼Ω_min/2π = 145.3 kHz) to k_max = 3.63 aN/μm (∼Ω_max/2π = 160.4 kHz).\nThe effective COM temperature of the levitated particle is experimentally determined as T_h = 320 K and T_c = 65 K, respectively. Here, the temperature equilibrated to the hot bath is a little bit larger than the room temperature T_0 = 300 K due to the heating effect of the trapping laser <cit.>.\n\n\nFigure <ref>(a-b) show the mean output work W and the mean efficiency η = -W/Q varying with the cycle time τ_cyc, respectively.\n\nThe work and heat are both in units of k_BT_0 throughout this paper.\nOne can see, both the mean output work W and the mean efficiency η monotonically increase with the cycle time and finally converge to the theoretical limit W_qs = -1/2T_h - T_c/T_0lnk_max/k_min <cit.> and the Carnot efficiency η_qs = 1 - T_c/T_h = 0.79 respectively in the quasi-static regime with an infinite long cycle time. By numerical simulation, we also figured out that the maximum power P = -W/τ_cyc will reach its maximum value <cit.> at τ_cyc≈ 0.04 ms.  It is not observed since 0.04 ms is much less than the shortest cycle time τ_cyc = 4 ms that is allowed in our experiments. The theoretical and simulation results and the detailed discussion of the power are presented in the SM.\n\nFigure <ref> (c-d) show the probability distributions of the output work W and the absorbed heat Q in the quasi-static regime for τ_cyc = 400 ms. As expected, strong fluctuations can be seen in the output work and the absorbed heat. We compare the measured output work distribution with a Gaussian distribution with the same mean and variance in Fig. <ref>(c). We also calculated the Jensen-Shannon divergence (JSD) <cit.> between them as  D_JS = 0.0043 (see the SM), which confirms that the output work distribution in the quasi-static regime is Gaussian.\n\n\n\n\n\n\n\n\n\nWe further explore the output work distribution for different cycle times, as shown in Figure <ref>(a-c). Interestingly, we found that the profile of the work distribution becomes asymmetric as we decrease the cycle time.\n\n\n\n\nTo quantify the symmetry breaking of work distribution, we define a symmetric index s simply as\n\n    s = |N_la - N_le|/N_la + N_le,\n\nwhere N_la (N_le) is the count of cycles in which the value of the output work is larger (less) than the mean. The index s ranges from 0 (corresponding to a symmetric distribution) to 1 (corresponding to a fully asymmetric distribution).\nFig. <ref>(d) shows the symmetric index s and the JSD between the measured work distribution and the Gaussian distribution with the same mean and variance versus the cycle time. Both of them increase as the cycle time decreases, indicating that the output work will deviate from the Gaussian distribution <cit.> when the engine operates under non-quasi-static conditions.\n\n\n\nMoreover, we found that the work distribution profile also depends on the temperature difference Δ T = T_h - T_c between the hot and cold baths.\n\nFigure <ref>(e-g) shows how the work distribution changes with varying the temperature difference Δ T for the short cycle time τ_cyc = 4 ms, and the index s and JSD versus the temperature difference is plotted in (h).\nThe results show that the work distribution with a short cycle time can change from asymmetric to symmetric with decreasing temperature differences. However, the symmetric distribution is still non-Gaussian with a visible JSD. \n\n\n\n\n\n\t\n\n\n\n\n\n\n\nDiscussions and conclusions.\nThe position of an oscillator driven by a random Brownian force is a random variable.\nIn the quasi-static regime, the equipartition theorem states that the stochastic position at different instants should be a Gaussian distributed random variable with the variance ⟨ x^2(t)⟩ = k_BT/k(t).\nFigure <ref>(a) shows the position variance ⟨ x^2(t) ⟩ (ensemble average) versus time during a full cycle in the quasi-static regime, and the inset shows the measured position distribution at different instants. They agree well with the prediction from the equipartition theorem. As a result, the output work W calculated via Eq. (<ref>) would be the integration (or sum) of squares of a series of Gaussian distributed random variable x(t). It is well known that, for a large number of independent random variables with an arbitrary but identical distribution, the sum of them will tend toward a Gaussian distribution. However, the distributions of x^2(t) at different times are obviously not the same for the varying stiffness k(t). To understand the work distribution observed in the experiments, we numerically investigated the distribution of the sum of the squares of a sequence of independent Gaussian random variables {X_1,  X_2, ...   X_2N} with zero mean ⟨ X_i ⟩ = 0 and varying variance ⟨ X_i^2⟩ = T_i/k_i, where T_i and k_i are two independent parameters respectively. \n\nAn analogy to the isothermal strokes in the Stirling cycle, we set T_i to be constant while k_i scale linearly with i, i.e.,\nT_i = 1,  k_i = (β - 1)i + N - β/N - 1 for i ≤ N and T_i = α,  k_i = 1- β/Ni + 2β - 1  for  N < i ≤ 2N,\nwhere α = T_c/T_h and β = k_min/k_max denotes the temperature ratio and stiffness ratio, respectively.\nFigure <ref> (b) show the distribution of the square sum Y = ∑_i^2N X_i^2 for the same stiffness and temperature in Fig. <ref> (c), which indicates that the sum of the squares of a sequence of independent Gaussian-distributed random variables with varying variances is still a Gaussian random variable, and explains the experimental results we observed under the quasi-static condition.\nAs the cycle time decreases, the equipartition theorem is no longer held due to the fast-varying of stiffness. In this situation, not only is the consistency of the distribution but also the independence of variables is disrupted. We calculated the autocorrelation function C(t,t+Δ t) = ⟨ x(t)x(t + Δ t)⟩ of the particle displacement during the expansion stroke. For a given Δ t, the correlation function oscillates in the time domain with an amplitude C_amp(Δ t) (See SM for details), which is shown in Fig. <ref> (c) for different cycle times. One can see that the correlation time is about 1 ms in all three cases, which is comparable to the duration of the expansion (compression) stroke in the case of rapid stiffness variation. We can thus expect that the correlation between the particle's positions at different instants will play an important role and the non-Gaussian distributed output works are therefore observed when the cycle time is set short.\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n\n\nIn summary, we experimentally realized a nano-sized stochastic Stirling engine based on a levitated optomechanical system, where a silica particle serving as the working medium was subjected to power-varying optical tweezers and coupled periodically to the cold (hot) reservoir created by switching on (off) feedback cooling.\nThe experimental performance of the Stirling cycles including the work, heat, and efficiency is presented.\nOur experimental results show that the output work distribution of the underdamped stochastic Stirling engine is Gaussian in the quasi-static regime, and it becomes more and more non-Gaussian as the cycle time decreases. This non-Gaussianity is qualitatively attributed to the strong correlation of the particle's position within a cycle in the non-equilibrium regime. Unfortunately, the exact probability distribution function of the output work for a fast stiffness variation in the underdamped regime is yet unknown <cit.>.\n\n\n\n\nThe experimental study on the SHE in the underdamped regime has just begun. There are still a lot of open questions waiting to be answered. In this sense, the present work can be regarded as a preliminary exploration in this field. In the following, with an upgraded electronic controlling system, more complex investigations of the underdamped SHE such as the optimal efficiency at the max power, or dynamical behaviors of Otto cycles and Carnot cycles will be further explored. Integrating together with the ground state cooling <cit.> techniques demonstrated recently, our system could be directly turned into the platform for investigating real quantum mechanical nano-machines.\n\t\n\nAcknowledgments.\nThis work is supported by the Major Scientific Research Project of Zhejiang Lab (2019 MB0AD01), the Center initiated Research Project of Zhejiang Lab (Grant No. 2021MB0AL01) and Zhejiang Provincial Natural Science Foundation of China (Grant No. LQ22A040010). X.G acknowledges support from the Research Project for Young Scientists of Zhejiang Lab (No. 2020MB0AA04), Zhejiang Laboratory research Found (No. 2021MB0AL02), and the Major Project of Natural Science Foundation of Zhejiang Province (No. LD22F050002).\n\n\n\n\n\n\n\n\n\n§ SUPPLEMENTAL MATERIAL\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ THE EXPERIMENTAL SETUP AND PROTOCOL.\n\nThe experimental setup.—The experimental setup is displayed in Fig. 1 in the main text. A single-beam optical trap is created inside a vacuum chamber by a laser beam of wavelength 1064 nm. The beam passes through an acousto-optic modulator (AOM, Gooch & Housego, 3080-199) that can adjust the optical trap power, and then is focused by a microscope objective (OBJ) of numerical aperture NA = 0.8.\nA silica particle of diameter 153.6 nm is levitated in the center of the optical trap at a pressure of 1 mbar and the damping rate due to collision with residual gas molecules is experimentally determined to be Γ_th/2π = 1.45 kHz.\nThe optical potential is approximately harmonic, and the trap (mechanical) stiffness is proportional to the trap power, which can be altered by changing the radio frequency (RF) driving voltage of the AOM.\nThroughout our work, we restrict our focus to the motion of the particle along the x axis. By adjusting the driving voltage of the AOM, \nwe vary the resulting mechanical oscillation frequency of the particle along the x axis,\nΩ/2π, from 145.3 to 160.4 kHz.\nSince the gas damping rate Γ_th is much smaller than the mechanical frequency, the oscillator operates in the underdamped regime. We measure the motion of the particle along the x direction by detecting the scattered light using a quadrant photodetector (QPD) with a delay of approximately 200 ns.\n\n\nThe motion of the particle's center of mass (COM) is influenced by the surrounding gas environment, which acts as a high-temperature reservoir (hot bath). \nTo create a low-temperature reservoir (cold bath), we utilize an active feedback cooling scheme to cool the COM motion of the particle.\nIn this scheme, we exert a Coulomb force on the charged particle by applying a voltage to a pair of electrodes enclosing the trap.\nThe x-axis motion signal is sent through a bandpass filter (BPF, SRS, SIM965, 1 MHz bandwidth) and a derivative circuit d/dt (Zurich Instrument MFLI, delay ∼ 800 ns, noise ∼ 43 nV/Hz^1/2) to provide a feedback signal proportional to velocity. This velocity-dependent feedback signal is then sent to an amplifier (AMP, noise ∼ 14 μV/Hz^1/2) that modulates the voltage of the electrodes to cool the x-motion electrically. The noise resulting from the feedback cooling is approximately S_fd≈ 3× 10^-14 m/Hz^1/2, which is much lower than the thermal noise S_th≈ 9× 10^-12 m/Hz^1/2.\nUsing this feedback cooling, we can create a cold bath with the particle's COM temperature ranging from 30 to 300 K.\n\nThe experimental protocol of Stirling cycle.—In order to implement the Stirling cycle, it is necessary to synchronize the changes in both the optical trap stiffness and the feedback cooling (see Fig. 1(b-c) in the main text).\nTo accomplish this, we employ a two-channel programmable signal generator (SG, Keysight, 33500B) that periodically outputs two synchronized signals.\nOne signal (AOM signal) is sent to the AOM to linearly change the optical trap power, while another signal (switch signal) is sent to a switch (delay ∼ 140 - 180 ns) in the feedback loop to periodically turn on/off the feedback cooling. Figure <ref> shows the AOM and switch signals as a function of time.\nThe driving voltage of the AOM is inversely proportional to the optical trap power, resulting in a linear decrease (increase) in the optical trap stiffness during the first (third) stroke. The switch signal is a Transistor-Transistor Logic (TTL) signal, with the feedback cooling turned on (off) when the signal is set to 2 (0).\n\n\n\n\n\n§ THE THERMODYNAMIC QUANTITIES IN THE QUASI-STATIC REGIME.\n\nThis section presents an analytical calculation of the average thermodynamic quantities, such as work, heat, and efficiency, in the quasi-static limit. In this limit, the cycle or stroke duration time is much longer than all other relevant time scales, including the thermal relaxation time. As a result, when the protocol is changed, the system immediately adjusts to the equilibrium state corresponding to the new protocol value.\n\nDuring the first isothermal stroke, the mean work done on the particle is equal to the free energy change Δℱ before and after the expansion, which can be expressed as\n\n    W_h = Δℱ_h = k_BT_h/2lnk_min/k_max = - k_BT_h/2lnk_max/k_min.\n\nSimilarly, the mean work done on the particle during the second isothermal stroke is given by\n\n    W_c = Δℱ_c = k_BT_c/2lnk_max/k_min.\n\nSince the two isochoric strokes in the Stirling cycle, with constant stiffness k, do not contribute to the work W, the total output is\n\n    W = W_h + W_c = - k_B(T_h - T_c)/2lnk_max/k_min.\n\nWe can express the output work in terms of the unit of k_BT_0 as\n\n    W = - T_h - T_c/2 T_0lnk_max/k_min\n\nin the main text.\n\nTo obtain the average absorbed heat in the isothermal expansion stroke, we first calculate the average internal energy change and then apply the first law.\nSince the particle always remains in thermal equilibrium at a temperature T_h during this process, the average internal energy change is Δ U_h = 0. Therefore, the average absorbed heat is given by\n\n    Q = -W_h = k_BT_h/2lnk_max/k_min.\n\nUsing the total output work and the absorbed heat, we can calculate the mean efficiency of the Stirling cycle as:\n\n    η = - W/Q = 1 - T_c/T_h = η_Carnot,\n\nwhere η_Carnot is the efficiency of a Carnot cycle operating between the same two temperatures T_h and T_c.\n\n\n\n§ NUMERICAL SIMULATION.\n\nThe dimensionless Langevin equation.—We introduced dimensionless quantities Ω≡Ω/ω, t≡ω t, Γ_th/fd≡Γ_th/fd/ω, k≡Ω^2 = k/ω^2, and x = x/√(k_bT/mω^2), and obtain the following dimensionless Langevin equation,\n\n    ẍ + (Γ_th + Γ_fd) ẋ + kx = √(2 Γ_th)ξ(t).\n\nHere, we set the initial maximum mechanical frequency to be the normalized unit, i.e., ω = Ω_max.\nAccording to the experimental parameters in the main text, the related dimensionless parameters for the simulation are given by\nΩ_min = 145.3/160.4≃ 0.906, Γ_h = Γ_th = 1.45/160.4≃ 0.009, and τ̃_cyc = Ω_maxτ_cyc.\nThe damping rate of the cold bath is obtained via Γ_c = Γ_h/α with the temperature ratio α =  T_c/T_h and T_h = 320 K, for instant, Γ_c≃ 0.044 for the cold bath temperature T_c = 65 K.\n\nThe maximum power.—We numerically simulated the Stirling cycle via the dimensionless Langevin equation (<ref>), where the cold bath temperature is set to T_c = 65 K. Figure <ref> shows the mean output work and the mean power as a function of the cycle time. \nWhen the cycle time is very small, the mean output work is positive indicating the work done on the environment. As the cycle time increases, the mean output work also increases and gradually approaches the theoretical value of the quasi-static regime.\nThe mean power initially increases to a maximum value, then begins to decrease, and eventually approaches 0. The maximum power is achieved when the cycle time τ_cyc = 0.04 ms.\nThe experimental results are in good agreement with the numerical simulation.\n\n\n\n\n\n§ JENSEN–SHANNON DIVERGENCE.\n\n\nJensen–Shannon divergence (JSD) <cit.>, a symmetrized and smoothed version of the Kullback–Leibler divergence (KLD), is a quantity of measuring the similarity between two probability distributions. For two probability distribution P = (p_1, p_2, ..., p_n) and Q = (q_1, q_2, ..., q_n) with ∑_i^np_i = ∑_i^nq_i = 1, the JSD is defined as\n\n    D_JS(P, Q) = D_KL(P, M) + D_KL(Q, M)/2,\n\nwhere M = (P + Q)/2 and\n\n    D_KL(P, Q) = ∑_i^np_ilog(p_i/q_i)\n\nis the Kullback–Leibler divergence.\nThe Jensen–Shannon divergence is bounded in 0 ≤ D_JS(P, Q) ≤ 1 and only vanishes when P = Q.\n\n\n\n§ THE AUTOCORRELATION FUNCTIONS.\n\n\nThe autocorrelation function (ACF) is a statistical tool that quantifies the degree of correlation between a variable and its past values. In our experiments, we use the ACF of the particle displacement x(t), which is calculated as \n\n    C(t, t + Δ t) = ⟨ x(t)x(t + Δ t) ⟩,\n\nwhere Δ t represents the time lag and ⟨…⟩ denotes  the average over all realizations.\n\nFigure <ref> displays the ACFs of the experiment data as a function of time t for different time lags and cycle time during the isothermal expansion stroke. It shows that the ACFs exhibit an oscillation behavior with time t. For all the cycle time (i.e., τ_cyc = 4, 40, 400 ms), the amplitudes of the ACFs decrease as the time lag τ increases, and they approach zeros for a time lag of τ = 0.9 ms. \n\nTo more clearly decrease the dependence between the ACF and the time lag, we introduce the amplitude of the ACFs defined as follows:\n\n    C_amp(Δ t) = max{|C(t, t + Δ t)|}.\n\nThis new definition of the ACF focuses solely on the time lag, enabling us to analyze better how correlations change with the cycle time and time lag.\n\n\n\n\n\n\n\n\n\n\n"}