{"entry_id": "http://arxiv.org/abs/2303.07324v1", "published": "20230313174412", "title": "The algebraic structure of the non-commutative nonlinear Schrodinger and modified Korteweg-de Vries hierarchy", "authors": ["Gordon Blower", "Simon J. A. Malham"], "primary_category": "nlin.SI", "categories": ["nlin.SI", "math-ph", "math.AP", "math.MP", "35Q51, 35Q55"], "text": "\n\nNonlinear Schrödinger hierarchies\n    \nBlower and Malham\n\n^1 Department of Mathematics and Statistics, Lancaster University, Lancaster LA1 4YF, UK\n\n^2 Maxwell Institute for Mathematical Sciences,        \nand School of Mathematical and Computer Sciences,   \nHeriot-Watt University, Edinburgh EH14 4AS, UK\n\nG.Blower@lancaster.ac.uk, S.J.A.Malham@hw.ac.uk\n           \nThe algebraic structure of the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy\n    Gordon Blower^1 Simon J.A. Malham^2\n    11th March 2023\n=============================================================================================================\n\n\n\n\n  We prove that each member of the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy is a Fredholm Grassmannian flow,\n  and for the given linear dispersion relation and corresponding equivalencing group of Fredholm transformations,\n  is unique in the class of odd-polynomial partial differential fields.\n  Thus each member is linearisable and integrable in the sense that time-evolving solutions can be generated by solving a linear Fredholm Marchenko equation,\n  with the scattering data solving the corresponding linear dispersion equation.\n  At each order, each member matches the corresponding non-commutative Lax hierarchy field which thus represent odd-polynomial partial differential fields.\n  We also show that the cubic form for the non-commutative sine–Gordon equation corresponds\n  to the first negative order case in the hierarchy, and establish the rest of the negative order non-commutative hierarchy. \n  To achieve this, we construct an abstract combinatorial algebra, the Pöppe skew-algebra, that underlies the hierarchy.\n  This algebra is the non-commutative polynomial algebra over the real line generated by compositions,\n  endowed with the Pöppe product—the product rule for Hankel operators pioneered by Ch. Pöppe for classical integrable systems.\n  Establishing the hierarchy members at non-negative orders, involves proving the existence of a `Pöppe polynomial' expansion for basic compositions\n  in terms of `linear signature expansions' representing the derivatives of the underlying non-commutative field.\n  The problem boils down to solving a linear algebraic equation for the polynomial expansion coefficients, at each order.\n\n \n\n\n\n\n§ INTRODUCTION\n\nFor the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy, we prove that each member is both,\na Fredholm Grassmannian flow, and for the given linear dispersion relation and corresponding equivalencing group of Fredholm transformations,\nis unique in the class of odd-polynomial partial differential fields.\nThat each member represents a Fredholm Grassmannian flow means they are linearisable in the sense that solutions\ncan be generated by solving a linear Fredholm Marchenko equation whose scattering data is the solution to\nthe corresponding linear dispersion relation. We also show that each member of the Lax hierarchy generates an odd-polynomial partial differential field, \nand so by uniqueness, at each non-negative order, the Fredholm Grassmannian flow and Lax hierarchy member are one and the same.\nWe also show that the cubic form for the non-commutative sine–Gordon equation corresponds\nto the first negative order case in the Lax hierarchy, and establish the rest of the negative order non-commutative hierarchy. \nOur approach is inspired by the pioneering work of Ch. Pöppe. In a sequence of papers, Pöppe <cit.>,\nPöppe and Sattinger <cit.>, and Bauhardt and Pöppe <cit.> developed the fundamental product rule\nfor additive Hankel operators and semi-additive operators, in order to establish the integrability and specific solution forms\nfor classical integrable systems. These included for example, the scalar sine-Gordon equation and Kadomtsev–Petviashvili hierarchy. \nPöppe's approach has recently been substantially developed and extended. In particular, Doikou, Malham and Stylianidis <cit.>\nstreamlined and extended Pöppe's approach to the non-commutative Korteweg–de Vries and nonlinear Schrödinger equations,\nand Malham <cit.> extended the approach to the quartic-order, quintic-degree non-commutative nonlinear Schrödinger equation. \nAlso see Doikou, Malham, Stylianidis and Wiese <cit.>.\nFurther, Malham <cit.> developed a simpler form of the Pöppe algebra constructed herein to\nprove that each member of the non-commutative potential Korteweg–de Vries hierarchy is unique in the class of\npolynomial partial differential fields and represents a Fredholm Grassmannian flow. \nBlower and Newsham <cit.> developed a systems perspective to Pöppe's approach, constructing\ntau-functions and families of solutions to the Kadomtsev–Petviashvili equation, while\nBlower and Doust <cit.> extend this approach to the sinh-Gordon equation.\n\nLet us now briefly outline our approach herein. Consider a non-commutative nonlinear dispersive partial differential equation\nfor g=g(x;t) of order n of the form,\n\n    _tg=-(iℐ)^n-1π_n(g, g,^2g,…,^n-2g,^ng),\n\nwhere =_x and x∈. Here π_n=π_n(·) is a polynomial of its arguments—a polynomial partial differential field.\nIt is linear in ^ng. The diagonal matrix ℐ simply has top left block `-𝕀' and bottom right block is `𝕀'.\nAs we see presently, g= G is the square-integrable kernel of a Hilbert–Schmidt operator G. Herein we use the notation G\nto denote the kernel of an operator G.\nSuppose P is a Hilbert–Schmidt Hankel operator on the negative real axis satisfying the linear dispersive equation,\n\n    _tP=-(iℐ)^n-1^nP.\n\nNote if there are any linear terms in π_n, we should augment this equation for P with such linear terms on the right. \nIn particular we suppose the square-integrable kernel of P has the form p=p(y+z+x;t) for y,z∈(-∞,0], while x∈ represents an additive parameter.\nThe matrix-valued kernel p satisfies the same linear dispersive partial differential equation as that above for P; it represents the scattering data. \nThe Marchenko equation at the operator level, here has the Fredholm form,\n\n    2iP=G (𝕀+P^2),\n\nfor the unknown operator G. Provided U(𝕀+P^2)^-1 exists as a Fredholm operator,\nthen the solution Hilbert–Schmidt operator G=2iPU to this Marchenko equation,\nparametrises a Fredholm Grassmannian flow of subspaces spanned by linear dispersive solutions p.\nSee, for example, Doikou et al. <cit.>. Pöppe's insight was to recognise\nthe crucial role the Hankel properties of P played in making the connection between the solution G=iPU to the Marchenko equation,\nand that its kernel G satisfies a specific nonlinear dispersive partial differential equation of the form shown above.\nThe connection is made via the Pöppe kernel product rule,\n\n    F_x(HH^')F^'(y,z;x,t)= FH(y,0;x,t) H^' F^'(0,y;x,t),\n\nwhere H and H^' are Hankel operators as described above, and F and F^' are any two Hilbert–Schmidt operators.\nThis rule indicates at the fundamental level, that there is a connection between the matrix products of kernels of operators\nof the form G=2iPU and/or their derivatives (on the right), and kernels of monomials involving operator compositions\nof similar objects, but with one order higher derivative (on the left).\nUsing that 𝕀+P^2=(𝕀-iP)(𝕀+iP) and setting V(𝕀-iP)^-1,\nwe see that,\n\n    G=2V(iP)V^†≡ V-V^†.\n\nFurther, we observe that V=V(iP)V, and if we use sub-indicies to denote partial derivatives `', we find,\nG_1=V(iP)_1V-V^†(iP)_1^† V^†. In particular, if for any\nHilbert–Schmidt operator F we set [F] F-F^†, then we observe that the kernels in both these cases are given by, \n\n    G=[V]    and     G_1=[V(iP)_1V].\n\nIt is now easy to imagine that the nth partial derivative of G has the form,\n\n    G_n=∑χ(a_1⋯ a_n) [V(iP)_a_1V⋯ V(iP)_a_kV],\n\nwhere the sum is over all compositions a_1a_2⋯ a_k of n. Naturally _t G\nis given by [V_t(iP)V] where _t(iP) can be expressed in terms ^n(iP) \nusing the linear dispersion equation for P. Hence our goal is to express _t G in terms\nof a polynomial π_n=π_n( G, G_1,…, G_n-2, G_n), linear in G_n.\nThe monomials in the polynomial π_n consist of factors of the form G, G_1, …, G_n-2,\neach expressible as a linear combination of basis elements [V(iP)_a_1V⋯ V(iP)_a_kV]\nparameterised by compositions as shown above, with the product involved being the Pöppe kernel product.\nIf we extend the basis elements to include basis elements of the form [V(iP)_a_1V⋯ V(iP)_a_kV]\nwhere any of the V factors shown my be replaced by V^†, then the operator partial fractions formulae V=𝕀+(iP)V=𝕀+(iP)V\nimply that the Pöppe product generates a closed algebra on such basis elements (see Lemma <ref>). \nThe playing field is thus set. It is the algebra of such basis elements equipped with the Pöppe product.\nIn fact we use an abstract version of this algebra by stripping the basis elements of their P and V labels \nand focusing on the compositions a_1a_2⋯ a_k and a binary encoding, 0 and 0^†, of the intervening V or V^† factors. \nThe Pöppe product essentially only acts on these components and thus transport our playing field to the closed algebra of\nbasis elements [0 a_10 a_2 0⋯ 0 a_k0], where any of the 0's may be replaced by 0^†.\nThe G_n=[V]_n are linear combinations of such abstract basis elements (as shown shown above) and we label such\nspecific linear combinations by [ n]. The quantity _t G=_t[V] can ultimately be expressed in terms of\n[0 n0] or [0 n 0^†], respectively depending on whether n is odd or even.\nThe game is to determine if [0 n0] or [0 n 0^†] can be expressed\nin terms of a polynomial π_n=π_n([0],[ 1],…,[n-2],[ n]), linear in [ n].\nWe express π_n as a linear combination of monomials with factors chosen from  \n[0], [ 1], …, [n-2] and a linear term [ n]. The monomials present in π_n\nare restricted to those that can generate [0 n0] or [0 n 0^†] or basis elements involving\ncompositions a_1a_2⋯ a_k of n via the Pöppe product. An unknown complex coefficient is associated with \neach monomial in the linear combination. We use the linear expansions for \n[0], [ 1], …, [n-2] and linear term [ n] in terms of the basis elements,\nand compute the Pöppe products of all the expansion basis elements in each of the factors of the monomial.\nThe result is a large linear combination of basis elements, each with a factor which is a linear combination\nof the unknown coefficients. We equate this to [0 n0] or [0 n 0^†], depending on whether n is\nodd or even, and equate all the coefficients of the basis elements present.\nThis generates a large linear algebraic system of equations for the unknown coefficients.\nThough over-determined, it can be solved for a unique set of coefficients, see Theorem <ref>.\n\nOur Main result thus establishes that for each non-negative integer n, there exists a unique\npolynomial π_n=π_n([0],[ 1],…,[n-2],[ n]) such that [0 n0]=π_n,\nwhen n is odd, or [0 n0^†], when n is even. The non-commutative Lax hierarchy in our context,\ncan be iteratively generated, to obtain the next equation in the hierarchy from the previous one by applying\na specific operator to π_n. Given the existence of a match up to π_n, we show that applying this specific iterative operator\nto π_n generates [0(n+1)0^†] when n is odd, and generates [0(n+1)0] when n is even.\nSince, from our main Theorem <ref>, we know there is a unique polynomial expansion for\n[0 n0] when n is odd or [0 n 0^†] when n is even for any order, there is a unique\npolynomial expansion for [0(n+1)0^†] or [0(n+1)0]. The uniqueness property means that\nthe polynomials π_n we establish at each order, must match the Lax hierarchy members.\nWe also investigate pursuing the specific operator in the opposite direction to generate non-commutative Lax hierarchy\nmembers at all negative orders—see Tracy and Widom <cit.> for the scalar case.\nIn particular we show that the first negative order case n=-1, corresponds to the cubic form\nof the non-commutative sine-Gordon equation.\n\nThe solution to any of the non-commutative hierarchy equations is generated by solving the\nlinear dispersion equation for the matrix kernel p or equivalently the Hilbert–Schmidt Hankel operator P, and then\nsolving the linear Fredholm Marchenko equation 2iP=G (𝕀+P^2) for G. The hierarchy member solution is G.\nEach member of the hierarchy is thus linearisable as the solution is generated via solving a linear dispersion equation\nand a linear Fredholm equation. However this procedure also identifies the graph of G as a Fredholm Grassmannian flow,\nrepresented in a specific coordinate patch parametrised by Hilbert–Schmidt operators.\nSuch flows are explored in detail in Doikou et al. <cit.>.\nWe can think of the Fredholm Grassmannian as all collections of graphs of compatible linear Hilbert–Schmidt maps.\nIndeed briefly, suppose we set 𝕍 L^2((-∞,0];ℂ^m) for some m∈ℕ, for example.\nConsider the pair of operators,\n\n    [ 𝕀-Q; 2iP ],\n\nboth on 𝕍. Here we suppose 𝕀-Q is a Fredholm operator on , with Q a Hilbert–Schmidt operator,\nand P is a Hilbert–Schmidt operator on . Assuming that the regularised determinant det_2(𝕀-Q)≠0,\nthis pair of operators defines a Fredholm Grassmannian flow in a given coordinate patch as follows. We can think of\nthis pair of operators as spanning a subspace of ℍ𝕍×𝕍 that is isomorphic to .\nThe transformation (𝕀-Q)^-1 of this subspace generates,\n\n    [ 𝕀; G ],\n\nwhere G=2iP(𝕀-Q)^-1. We can think of the Hilbert–Schmidt operator G as parametrising all such subspaces of ℍ,\nthat can be projected onto the canonical subspace represented by the pair of operators (𝕀,O).\nThis is one coordinate patch of the Fredholm Grassmannian of such subspaces of ℍ.\nNote that if we set Q=-P^2, then G represents the solution to the Marchenko equation.\nRecall, in our application we assume P satisfies the dispersion equation _tP=-(iℐ)^n-1^nP. \nFurther we suppose that P is a Hankel operator. This property is a natural far-field symmetry for the dispersive field in the sense\nthat it is a natural symmetry arising as the result of the scattering, of an incident wave from one far field, into the opposite far field.\nSee for example the construction of the Marchenko equation in Drazin and Johnson <cit.> or Appendix B in Doikou et al. <cit.>.\nThat the Marchenko equation solution G parameterises a class of subspaces of ℍ characterised by solutions of a dispersive field P, \ngenerates the following perspective. We can think of the Fredholm Grassmannian, in the coordinate patch represented by the particular pair (𝕀, G),\nas parametrising the time-evolving envelope of dispersive field solutions, i.e. the time-evolving subspace represented by the pair (𝕀,G).\nIn principle we could consider G= G(y,z;x,t) or in particular G(0,0;x,t) as an observable.  \n\nThe Marchenko equation, and its role in inverse scattering and linearisation, has been fundamental in classical integrable systems\nfrom the very early stages. See for example Dyson <cit.>, Miura <cit.>, Zakharov and Shabat <cit.>,\nAblowitz et al. <cit.>, Fokas and Ablowitz <cit.>, Mumford <cit.>,\nPöppe <cit.>, Pöppe and Sattinger <cit.>, Bauhardt and Pöppe <cit.> and Nijhoff et al. <cit.>.\nThere has also been a resurgence of interest in such linearisation approaches, see for example \nFokas and Pelloni <cit.>, McKean <cit.>, Fu <cit.> and Fu and Nijhoff <cit.>. \nIt was Sato <cit.> and Segal and Wilson <cit.> who pioneered the connection between Fredholm Grassmannians and\nintegrable systems. Recently there has also been a resurgence in this direction as well, see for example, Mulase <cit.>,\nDupré et al. <cit.>, Kasman <cit.>, Hamanaka and Toda <cit.>, Cafasso <cit.>,\nCafasso and Wu <cit.> and Arthamonov et al. <cit.> (also see Beck et al. <cit.>\nand Doikoi et al. <cit.>).\nRelated to this is the well-studied connection between the Korteweg–de Vries hierarchy, the intersection theory of Deligne–Mumford moduli space\nand the a string equation in two-dimensional gravity; see for example Witten <cit.> and Cafasso and Wu <cit.>.\nSome of the earliest work on non-commutative integrable systems includes\nFordy and Kulish <cit.>, Nijhoff et al. <cit.>, Ablowitz et al. <cit.>, \nErcolani and McKean <cit.> and Aden and Carl <cit.>. Again there has been more recent interest in such systems and their solutions, such as \nTreves <cit.>, Hamanaka and Toda <cit.>, Degasperis and Lombardo <cit.>, Dimakis and Müller–Hoissen <cit.>,\nCarillo and Schiebold <cit.> whose results are particularly relevant to those herein, Sooman <cit.>,\nPelinovsky and Stepanyants <cit.>, Buryak and Rossi <cit.>, Doikou et al. <cit.>,\nStylianidis <cit.>, Adamopoulou and Papamikos <cit.>, Malham <cit.>, Gürses and Pekcan <cit.> and Ma <cit.>.\nThe role of Hankel operators in integrable systems first explored by Pöppe, has recently re-emerged as an active and fruitful research direction.\nIn particular, relevant to our results herein are Blower and Newsham <cit.>, Blower and Doust <cit.>, Grudsky and Rybkin <cit.>,\nGrellier and Gerard <cit.> and Gerard and Pushnitski <cit.>.\nThe combinatorial algebraic approach we consider herein was introduced in Malham <cit.> for the simpler\nnon-commutative potential Korteweg–de Vries equation; also see Doikoi et al. <cit.>.\nDimakis and Müller–Hoissen <cit.> consider integrable systems in the context of bidifferential graded algebras,\nwhile in Dimakis and Müller–Hoissen <cit.>, they consider connections to shuffle and Rota–Baxter algebras. \nSee Reutenauer <cit.>, Malham and Wiese <cit.> and Ebrahimi–Fard et al. <cit.>\nfor more details on shuffle algebras and references for Rota–Baxter algebras.\n\nTo summarise, our achievements herein are as follows. In terms of algebras, we: \n\n\n  (i) Introduce and develop new abstract non-commutative algebras. These are the algebra of\n  non-negative integer monomial forms ℂℤ_0 described above, equipped with a quasi-Leibniz type product\n  based on the Pöppe product, and its skew-form subalgebra ℂ[ℤ_0]. They are instrumental\n  to the results (ii)–(iv) just below.  \n\nFor the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy, we:\n\n\n  (ii) Provide a constructive proof that at each non-negative order, there exists a unique hierarchy member\n  in the class of odd-polynomial partial differential fields. The proof simultaneously establishes that the\n  solution flow of each member is a Fredholm Grassmannian, and therefore linearisable in the sense outlined in detail above;\n\n  (iii) Give a simple proof of the non-commutative Lax hierarchy in this context. In addition, \n  we immediately establish that at each non-negative order, the unique hierarchy member in (ii), and the corresponding Lax hierarchy member, coincide; \n\n  (iv) Establish that the first negative order non-commutative Lax hierarchy member is the cubic form\n  of the non-commutative sine-Gordon equation, and further, demonstrate how to generate the rest of the negative order non-commutative hierarchy.\n\n\nOur paper is organised as follows. In Section <ref> we introduce the Pöppe product for Hankel operators and motivate the solution form we propose\nfor the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy, based on the associated Marchenko equation. \nWe introduce the Pöppe kernel monomial algebra in Section <ref> with the Pöppe product,\nand in particular its isomorphic abstract form as well as the skew-Pöppe subalgebra we use for the\nproofs of our main results. We present a sequence of simple examples in Section <ref> \nillustrating the use of the abstract Pöppe algebra to generate the order zero through to order four members of the non-commutative hierarchy.\nIn Section <ref> we establish the non-commutative Lax hierarchy using the Pöppe algebra. \nHerein, we also generate the cubic form of the non-commutative sine-Gordon equation as the first negative order case,\nand indicate how to generate the rest of the negative order cases. We begin Section <ref> with\nthe illuminating example of the quintic non-commutative modified Korteweg–de Vries equation, before stating, and then proving, our main results. \nFinally, in Section <ref> we present some further conclusions and applications.\n\n\n\n\n\n§ HANKEL OPERATORS, THE PÖPPE PRODUCT AND THE MARCHENKO EQUATION\n\nIn this section we introduce the concepts and results that underlie our formulation.\nHerein, we: introduce the necessary Hilbert–Schmidt and Hankel operators we use and define the Pöppe product; \nmotivate the solution ansatz we use throughout; formulate the base linear dispersion equation;\nelucidate the well-posedness results for the Marchenko equation we require and establish the connection\nbetween the Pöppe product and finite rank operators.\n\n\n\n\n §.§ Hankel operators and the Pöppe product\n\nTo begin, let us fix some notation. Let  be the Hilbert space of square-integrable, complex matrix-valued functions on (-∞,0],\ni.e. L^2((-∞,0];^m) for some m∈ℕ.\nFurther, we denote by 𝔍_2() the space of Hilbert–Schmidt operators on ,\ni.e. bounded operators whose sum of the squares of their singular values is finite.  \nFor any given operator F=F(x,t)∈𝔍_2()\nthere exists a unique square-integrable kernel f=f(y,z;x,t) with\nf∈ L^2((-∞,0]^× 2;^m× m)\nsuch that for any ϕ∈ we have\n\n    (Fϕ)(y;x,t)=∫_-∞^0f(y,z;x,t)ϕ(z)  z.\n\nConversely, any such function f∈ L^2((-∞,0]^× 2;^m× m)\ndefines an operator F=F(x,t) in 𝔍_2() with (for each x,t):\n\n    F_𝔍_2()=f_L^2((-∞,0]^× 2;^m× m).\n\nSee for example Simon <cit.>.\n\n\nFor any Hilbert–Schmidt operator F=F(x,t), which depends on the parameters x∈ and t⩾0,\nwe use the kernel bracket notation F to refer to the kernel f=f(y,z;x,t) of F:\n\n    F(y,z;x,t) f(y,z;x,t).\n\nIn general, since f is square-integrable, it only exists almost everywhere on (-∞,0]^× 2.\nHowever below, the operators we consider have continuous kernels and so f makes sense pointwise.\nIn such cases, we can in particular set y=z=0, for which we use the notation F_0,0(x,t) f(0,0;x,t).\n\n\nRecall that the trace of any trace-class operator F on (-∞,0] is given by,\n\n    tr  F∫_-∞^0 f(z,z)  z.\n\n\nBy a Hankel operator, which may depend on a parameter x, we mean the following.\n\n\nWe say a Hilbert–Schmidt operator H∈𝔍_2() \nwith corresponding square-integrable kernel h is Hankel or additive with parameter x∈\nif its action, for any square-integrable function ϕ∈, \nis given by (here y∈(-∞,0]),\n\n    (Hϕ)(y;x)∫_-∞^0h(y+z+x)ϕ(z)  z.\n\n\n\nPöppe <cit.> recognised the fundamental role played by such Hankel operators\nin classical integrable systems. The kernel of the derivative with respect to the additive parameter x\nof the operator product of an arbitrary pair of Hankel operators can be expressed as the matrix product\nof their respective kernels as follows. See Pöppe <cit.>, as well as Doikou et al. <cit.>\nand Malham <cit.>. We include a proof for completeness.\n\n\n  Assume H and H^' are Hankel Hilbert–Schmidt operators with parameter x and F and F^'\n  are Hilbert–Schmidt operators. Further assume the kernels of F and F^' are continuous, whilst\n  the kernels of H and H^' are continuously differentiable. Then the following Pöppe product\n  rule holds,\n  \n    [[F_x(HH^')F^']](y,z;x)\n        = FH(y,0;x) H^' F^'(0,z;x).\n\n\n\n\nWe use the fundamental theorem of calculus and Hankel properties of H and H'.\nLet f, h, h' and f' denote the integral kernels of F, H, H' and F' respectively.\nBy direct computation F_x(HH^')F^'(y,z;x) equals\n\n    ∫__-^3\n    f(y,ξ_1;x)_x(h(ξ_1+ξ_2+x)h^'(ξ_2+ξ_3+x))\n    f^'(ξ_3,z;x) ξ_3 ξ_2 ξ_1\n       =∫__-^3\n    f(y,ξ_1;x)_ξ_2(h(ξ_1+ξ_2+x)h^'(ξ_2+ξ_3+x))\n    f^'(ξ_3,z;x) ξ_3 ξ_2 ξ_1\n       =∫__-^2\n    f(y,ξ_1;x)h(ξ_1+x)h^'(ξ_3+x)f^'(ξ_3,z;x) ξ_3 ξ_1\n       =∫__-f(y,ξ_1;x)h(ξ_1+x) ξ_1·∫__-h^'(ξ_3+x)f^'(ξ_3,z;x) ξ_3\n       =( FH(y,0;x))( H'F'(0,z;x)),\n\nwhich corresponds to the result stated. \n\n\n\nWe implicitly interpret kernel products written in the form ·  · ⋯ ·  ·\nas · (y,0;x) · (0,0;x)⋯ · (0,0;x) · (0,z;x).\n\n\n\n\n\n §.§ Solution ansatz motivation\n \nLet us formally motivate the solution form we use for the non-commmutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy we study herein.\nThis comes from the sine-Gordon equation.  With x∈ and t⩾0, we assume the sine–Gordon equation has the form,\n_t u=sin u, where u=u(x,t) and _x. In the scalar case, when u∈, it is well-known\nthat there exists a solution of the form,\n\n    u=2i tr log(𝕀-iP/𝕀+iP),\n\nor the equivalent form u=4 arctan  P.\nHere P=P(x,t) is a Hankel Hilbert–Schmidt operator with an integral kernel p=p(x,t) which satisfies the\nlinearised form of the sine–Gordon equation (see for example Pöppe <cit.>), _t p=p.\nFor scalar valued kernels, we have the following.\nSuppose that H=H(x) is a Hankel operator dependent on the parameter x∈. Then for any n∈ℕ, we have,\n\n    tr  H^n=n/2 H^n_0,0.\n\nFurther, suppose that Θ=Θ(H) is a power series function of the Hankel operator H, with\nscalar-valued coefficients c_n, of the form Θ(H)=∑_n⩾1c_n H^n. Then we have,\n\n    tr Θ(H)=12 H DΘ(H)_0,0,\n\nwhere DΘ=DΘ(H) is the series DΘ(H)=∑_n⩾1nc_n H^n-1.\n\n\n  This is equivalent to the result embodied in equation (3.26) in Pöppe <cit.>.\n  We give a proof in Proposition <ref> in Section <ref> below.\n  Also see Blower and Doust <cit.>.\n\n\n[Logarithm of the Cayley transform]\nThe solution ansatz for the scalar sine-Gordon equation above involves the logarithm of\nCayley transform, i.e. the form,\n\n    Θ(P)=log(𝕀-iP/𝕀+iP).\n\nBy direct computation we observe that,\n\n    DΘ(P)=-i·𝕀/𝕀-iP-i·𝕀/𝕀+iP  ⇒   P DΘ(P)=-2iP/(𝕀-iP)(𝕀+iP).\n\nThen, using the trace and kernel bracket result above, we have,\ntr Θ(P)=-(𝕀-iP)^-1(iP)(𝕀+iP)^-1_0,0,\nthough the order of the factors shown on the right us not important.\n\n\nRecall the solution form to the scalar sine–Gordon equation given above, u=2i tr Θ(P), where Θ=Θ(P) is\nthe logarithm of the Cayley transform given in Example <ref>. Let ^-1^-1_x denote the primative operator, \n(^-1ϕ)(x)∫_-∞^xϕ(ξ) ξ.\nThen, given the final result in Example <ref>, we can express the solution to the scalar sine–Gordon equation in the form,\n\n    u=-2i ^-1[[(𝕀-iP)^-1(iP)(𝕀+iP)^-1]]_0,0.\n\nThis form of the solution for the scalar sine–Gordon equation motivates\nthe solution form we seek for the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy, which we utilise\nin the following sections. The sine–Gordon equation is just a special case, the order `-1' case, in that hierarchy. \n\n[Non-commutative sine-Gordon cubic-form equation]\n  If u satisfies the scalar sine–Gordon equation _t u=sin u, and u=-2i^-1g,\n  then g=g(x,t) satisfies the following sine–Gordon cubic-form equation,\n  \n    _t g=g+g ^-1(_t g^2)+^-1(_t g^2) g.\n\n  To see this, define the operator Γ by, (Γϕ)(x)∫_-∞^xγ(ξ)ϕ(ξ) ξ,\n  where γ=-2ig.\n  Using that for any n∈ℕ we have, (Γ∘1)^n≡ n! (Γ^n∘1), then we observe that in fact,\n  sin u=(𝕀+Γ^2)^-1∘Γ∘1.\n  In other words γ satisfies the integral equation (𝕀+Γ^2)∘_tγ=Γ∘1 or equivalently \n  satisfies _tγ+^-1(γ^-1(γ_tγ))=^-1γ. Noting that g=γ/(-2i) \n  and symmetrically splitting the nonlinear term, generates the sine–Gordon cubic-form equation above.\n  The cubic-form equation above is often interpreted to be the non-commutative sine–Gordon equation in,\n  for example, Schiebold <cit.>.\n\n\n\n\n\n\n §.§ The linear dispersion equation\n\nConsider the following coupled linear system of equations for the Hilbert–Schmidt operators P_α, P_β, G_α and G_β,\n\n    _tP_α   =μ_n^n P_α,\n    iP_α   =G_α(𝕀+P_β P_α),\n         and     _tP_β   =(-1)^n-1μ_n^n P_β,\n    iP_β   =G_β(𝕀+P_α P_β).\n\nfor some order n∈ℤ, where the parameter μ_n∈ℂ.\nIn order for the partial differential equations for P_α and P_β shown\nto be dispersive, we necessarily require that μ_n is pure imaginary when n is even\nand real when n is odd. We suppose that the matrix-valued kernel of P_β has the same shape\nas the transpose of the matrix-valued kernel of P_α. \nThe matrix-valued kernels of G_α and G_β naturally match those of P_α and P_β, respectively.\nIf we set,\n\n    P[   O P_β; P_α   O ],    \n      G[   O G_β; G_α   O ],\n          and    ℐ[ -𝕀  O;  O  𝕀 ],\n\nthen the system of linear equations above can be expressed in the form,\n\n    _t P   =-μ_n(iℐ)^n-1^n P,\n    iP   =G(𝕀+P^2),\n\nwhere now the parameter μ_n∈ℝ. This form is given, eg., in Schiebold <cit.>.\nNow consider the following second order cubic nonlinear equation for the kernel G,\n\n    _t G(y,z;x,t)=-μ_2iℐ(_x^2 G(y,z;x,t)-2  G(y,0;x,t) G(0,0;x,t) G(0,z;x,t)).\n\nWritten in terms of the kernels G_α and G_β with y=z=0, we observe,\n\n    i_t G_α   =μ_2_x^2 G_α-2μ_2  G_α  G_β  G_α,\n    i_t G_β   =-μ_2_x^2 G_β+2μ_2  G_β  G_α  G_β.\n\nThere are several different consistent choices we can make for P_α and P_β, as follows.\nFor example, suppose we set P_β=P_α^†, the adjoint operator to P_α with respect to the L^2 inner product.\nThen if G=iPU with U(𝕀+P^2)^-1, as defined above, at the block level it transpires G_β=G_α^†. \nIn this case the kernel G_β(0,0;x,t) is the complex conjugate transpose of the kernel G_α(0,0;x,t).\nAnd thus, assuming the kernel G generated from G=PU satisfies the equation above,\nthe equation for the block G_α(0,0;x,t) collapses to the non-commutative nonlinear Schrödinger equation.\nFurther note, for the choice P_β=P_α^†, the operator P is Hermitian with respect to the  L^2 inner product,\ni.e. P^†=P. \n\n\nThe system of linear equations for P above allows us to incorporate, and thus deduce corresponding results,\nfor the nonlocal versions of the non-commutative nonlinear Schrödinger hierarchy. These include the\nreverse time, reverse space-time and space-time shifted nonlocal versions of these equations outlined in \nAblowitz and Musslimani <cit.>, Fokas <cit.>, Grahovski, Mohammed and Susanto <cit.>\nand Gürses and Pekcan <cit.>.\nThis fact is outlined in detail in Example 4 and Remark 17 in Doikou et al. <cit.>.\n\n\n\n\n\n\n §.§ The Marchenko equation\n\nConsider an operator P∈𝔍_N(𝕍), where N=1 or N=2. For the moment P is not necessarily a Hankel operator,\nand 𝕍 is an arbitrary seperable Hilbert space. The space 𝔍_1() denotes the set of trace-class (nuclear) operators.\nCrucial to the Pöppe algebra we introduce in Section <ref> are both, the Marchenko equation,\n\n    P=G (𝕀-Q),\n\nfor the operator G, and the Pöppe product in Lemma <ref>. In our application, we set Q-P^2.\nThe following abstract result is proved in Doikou et al. <cit.>.\n\n\n  Assume Q_0∈𝔍_2 and for some T>0 we know that Q∈ C^∞([0,T];_2) with Q(0)=Q_0 and\n  P∈ C^∞([0,T];_N), where N is 1 or 2. Further assume, det_2(𝕀-Q_0)≠0.\n  Then there exists a T^'>0 with T^'⩽ T such that for t∈[0,T^'] we have det_2(𝕀-Q(t))≠0 and \n  there exists a unique solution G∈ C^∞([0,T^'];_N) to the linear equation P=G(𝕀-Q).\n\n\nNow suppose L^2((-∞,0];^m) for some m∈ℕ.\nFor any function w⩾0, we denote the weighted L^2-norm of any complex matrix-valued function f on (-∞,0] by,\n\n    f_L^2_w^2∫_-∞^0tr (f^†(x)f(x)) w(x)  x.\n\nDoikou et al. <cit.> also establish, if p(·;t)∈ L^2_w((-∞,0])\nwith w y↦(1-y)^2, the Hankel operator P=P(t) generated by p is such that P(t)∈𝔍_2().\nHence we assume the solutions p=p(y;t) to the linear dispersive system _t p=-μ_n(iℐ)^n-1_y^n p\nlie in L^2_w((-∞,0]). We then take P=P(x,t) to be the Hankel operator with kernel p=p(y+z+x;t),\nwhere y,x∈(-∞,0]^×2, with parameter x∈. Statements for p=p(·;t) on (-∞,0]\ntranslate, for each x∈, to statements for p=p(·+x;t) on (-∞,x]. This is important, as we wish\nto include natural solutions p=p(y;t) to the linear dispersion equation that are unbounded as y→∞.\nExamples of such solutions are exponential-form solutions that generate soliton solutions to the corresponding non-commutative\nintegrable nonlinear partial differential equation. Explicitly, the Marchenko equation we consider herein takes the form,\n\n    p(y+z+x;t)=g(y,z;x,t)-∫_-∞^0 g(y,ξ;x,t)q(ξ,z;x,t) ξ,\n\nwhere q is the kernel of Q-P^2. With this in hand, we have the following result, adapted from \nDoikou et al. <cit.>.\n\n\n  Assume the smooth initial data p_0=p_0(·) for p=p(·;t) is such that det_2(𝕀-Q_0)≠0,\n  where Q_0-P_0^2 and P_0 is the Hankel operator generated by p_0. Further assume there exists a T>0\n  such that there is a solution,\n  \n    p∈ C^∞([0,T];L^2_w((-∞,0];^m× m)∩ C^∞((-∞,0];^m× m)),\n\n  to the linear dispersion equation _t p=-μ_n(iℐ)^n-1_y^n p, where w y↦(1-y)^2.\n  Then there exists a T^'>0 with T^'⩽ T such that for t∈[0,T^'] we know:\n  (i) The Hankel operator P=P(x,t) with parameter x∈ generated by p is Hilbert–Schmidt valued on ;\n  (ii) The determinant det_2(𝕀-Q(x,t))≠0 where Q(x,t)-P^2(x,t), and hence \n  (iii) There is a unique Hilbert–Schmidt valued solution G=G(x,t) with G∈ C^∞([0,T^'];𝔍_2())\n  to the linear Fredholm equation P=G(𝕀-Q).\n\n\n\n\n\n\n\n §.§ Trace formulae and finite-rank operators\n\nWe now establish that at the core of the Pöppe product is in fact a finite rank operator. \nFor this section only, for convenience, we assume the domain of support of the functions under consideration is [0,∞)\nas opposed to (-∞,0]. A reflection transformation translates between the two. \nFor a bounded integral operator K L^2(0,∞)→ L^2(0,∞) with a continuous kernel k=k(y,z),\nwe write K_0,0=k(0,0) for the kernel bracket.\n\n\n  We define the shift operator S_η L^2(0,∞)→ L^2(0,∞) by S_η f(x)=f(x-η) ind_(0,∞)(x-η),\n  where ind_(0,∞) is the indicator function on (0,∞).\n\n\nIt is well-known that S_η is a linear isometry and (S_η)_η>0 is a strongly continuous contraction semigroup.\nFurther, the adjoint S_η^† is a linear contraction, and (S_η^†)_η>0 is a strongly continuous contraction semigroup on L^2.\n\n\n  Set σ_η(K) S_η^† KS_η for K∈𝔍(L^2(0,∞)). Then we have:\n  \n  \n  (i) σ_η(K)∈𝔍(L^2(0,∞)) for all K∈𝔍(L^2(0,∞)) with\n    σ_η(K)⩽K, K↦σ_η(K) is linear and σ_η+ξ=σ_η(σ_ξ(K));\n  \n  (ii) K=K^† implies (σ_η(K))^†=σ_η(K) and K⩾0 implies σ_η(K)⩾0;\n  \n  (iii) (S_η)_η>0 gives a strongly continuous contraction semigroup on the von Neumann–Schatten ideal 𝔍_p\n  for 1⩽ p<∞ and on the space of compact operators. Also σ_η(K)→ K as η→0 for such K;\n\n  (iv) Let δ be the generator of the semigroup in (iii), so σ_η=exp(t δ).\n  Then for continuously differentiable kernels k=k(y,z) we have, δ k(y,z)=(_y+_z)k(y,z);\n  \n  (v) Suppose that K has a continuous kernel k=k(y,z), and that K is self-adjoint, non-negative and trace class.\n    Then, det(𝕀+σ_η(K))=det(𝕀+KPr_(η,∞)) and,\n  \n    σ_η(K)_0,0=k(η,η)=-/ηtr σ_η(K);\n    \n  \n  (vi) Pöppe's bracket operation satisfies, tr δ K=- K_0,0.\n\n\n\n\n  (i) Follows since (S_η) is a contraction semigroup, while (ii) is straightforward. \n  (iii) The Schatten class gives an operator ideal, so we have S_η^† KS_η_𝔍_p⩽ K_𝔍_p\n  since S_η_𝔍=1. In view of this, we only need to check continuity in the relevant norm. \n  For the Hilbert–Schmidt operators 𝔍_2, we let σ_η(K)(y,z) be the kernel of σ_η(K) as an integral operator.\n  Then we have σ_η(K)(y,z)=K(y+η,z+η), so by the Hilbert–Schmidt theorem,\n  \n    σ_η(K)-K^2_𝔍_2=∫_0^∞∫_0^∞ k(y+η,z+η)-k(y,z)^2  y z,\n\n  which converges to 0 as η→ 0^+. For the trace class operators 𝔍_1,\n  we observe that the space of trace class operators may be identified with the projective tensor product\n  𝔍_1=L^2⊗̂L^2, so we have a nuclear expansion,\n  \n    k(y,z)=∑_j=1^∞ f_j(y)g_j(z),\n\n  where ∑_j=1^∞f_j_L^2g_j_L^2=K_𝔍_1. Then we have\n  \n    σ_η(K)(y,z)-k(y,z)=∑_j=1^∞(f_j(y+η)-f_j(y))g_j(z+η)+∑_j=1^∞ f_j(y)(g_j(z+η)-g_j(y)),\n\n  and so,\n  \n    σ_η(K)-K_𝔍_1⩽∑_j=1^∞S_η^†(f_j)-f_j_L^2g_j_L^2+∑_j=1^∞f_j_L^2S_η(g_j)-g_j_L^2,\n\n  where the right-hand side converges to 0 as η→ 0^+ by dominated convergence. \n\n  For 1<p<∞, we observe that the finite-rank operators give a dense linear subspace of 𝔍_p,\n  so we can argue as with the trace class operators. Likewise, the finite-rank operators give a dense linear subspace of the space of compact operators.\n  Hence (σ_η)_η>0 gives as strongly continuous contraction semigroup on these spaces. \n  Now S_η^† f→ 0 as η→∞ for all f∈ L^2(0,∞),\n  so for all finite rank operators F, we have σ_η(F)→ 0 as η→∞.\n  Then for K∈𝔍_p and ε>0 there exists a finite rank F such that K-F_𝔍_p<ε,\n  so σ_η(K)_𝔍_p⩽K-F_𝔍_p+σ_η(F)_𝔍_p is less than 2ε\n  for all sufficiently large η. (Note, we do not assert that (σ_η)_η>0 is strongly continuous on 𝔍 itself.)\n  \n  (iv) From the definition of generator, we have,\n  \n    δ k(y,z)=./η|_η=0σ_η(K)(y,z)=./η|_η=0k(y+η,z+η)\n      =(_y+_z)k(y,z).\n\n    \n  (v) We have, (𝕀+σ_η(K))=(𝕀+S_η^† KS_η) =(𝕀+KS_η S_η^†)=(𝕀+KPr_(η, ∞ )).\n  By Mercer's formula we have, tr σ_η(K)=∫_0^∞ K(y+η,y+η)  y,\n  and we can differentiate this formula using the fundamental theorem of calculus.\n\n  (vi) The result (v) may be formulated in terms of the generator without explicit mention of the semigroup.\n  Let 𝒟^1{ϕ∈ L^2((0,∞);ℂ)ϕ'∈ L^2((0,∞);ℂ)}, and recall from\n  Hille and Phillips <cit.> that 𝒟^1 is the domain of the generator of (S_η^†)_η>0.\n  By Plancherel's theorem,\n  we have 𝒟^1⊂ L^∞, so 𝒟^1 is an algebra under pointwise multiplication of functions;\n  hence there is a map μ𝒟^1⊗𝒟^1→𝒟^1 given by ϕ(y)ψ(z)↦ϕ(y)ψ(y).\n  There is also a natural inclusion 𝒟^1⊗𝒟^1→ L^2⊗ L^2=𝔍_1(L^2), and the trace satisfies\n  tr (K)=∫_0^∞μ (K)(x)  x.\n  We have δ𝒟^1⊗𝒟^1→ L^2⊗ L^2ϕ⊗ψ↦ϕ'⊗ψ+ϕ⊗ψ';\n  hence for k=∑_j=1^∞ϕ_j(y)ψ_j(z) we have,\n  \n    tr δ K=∑_j=1^∞∫_0^∞(ϕ_j(y)ψ_j(y)+ϕ_j(y)ψ_j'(y))  y\n        =-∑_j=1^∞ϕ_j(0)ψ_j(0),\n\n  so we have the required expression for Pöppe's bracket operation.\n\n\nSuppose that ϕ∈ L^2((0,∞ );𝕄_m× m(ℂ)).\nThen we introduce ϕ_(x)(η)ϕ(2x+η) and the Hankel operator\nΓ_ϕ_(x):L^2((0,∞);ℂ^m× 1)→ L^2((0,∞);ℂ^m× 1) by,\n\n    Γ_ϕ_(x) h(y)=∫_0^∞ϕ (y+z+2x)f(z)  z\n\nfor f∈ L^2((0, ∞ );ℂ^m× 1).\nSuppose, ∫_0^∞ tϕ(y)^2  y<∞ and ∫_0^∞ tψ(y)^2  y<∞.\nThen Γ_ϕ is a Hilbert–Schmidt operator, and Γ_ϕΓ_ψ is trace class with,\n\n    tr (Γ_ϕΓ_ψ)=∫_0^∞∫_0^∞ϕ(y+z)ψ(y+z)  dy z=∫_0^∞ yϕ(y)ψ(y)  y.\n\nA bounded linear operator Γ on L^2(0, ∞ ) is Hankel if and only if S_η^†Γ=Γ S_η for all η>0.\nThis may be interpreted as _xΓ=-Γ_y when we consider operators on C_c^∞ (0, ∞ ).\nIn the context of Hankel products, this leads to the following. \n\n\n  We have the following:\n  \n  \n  (i) Let Γ_ϕ be the Hankel operator with kernel ϕ(y+z).\n   Then σ_η(Γ_ϕ) has kernel ϕ (y+z+2η), so σ_η(Γ_ϕ)=Γ_ϕ_(η);\n \n  (ii) Let ϕ,ψ∈𝕄_m× m(C_c^∞ (0,∞)) be functions as above.\n   Then σ_2η(Γ_ϕΓ_ψ)=Γ_ϕ_(η)Γ_ψ_(η), and,\n   \n    _η(Γ_ϕ_(η)Γ_ψ_(η)),\n\n   is a bounded linear operator of finite rank with rank less than or equal to m^2;\n \n  (iii) Suppose m=1, and ϕ,ψ∈ C_c^∞(0,∞). Then δ (Γ_ϕΓ_ψ ) has rank one;\n \n  (iv) Conversely, suppose that K is in the domain of δ and δ(K) has finite rank. Then K=Γ_Φ^⊤Γ_Ψ;\n \n  (v) Let Γ_x=Γ_ϕ_(x) and Γ_x'=_xΓ_x.\n   Let Θ be holomorphic on an open neighbourhood of the spectrum of Γ_x for all real x. Then we have,\n   \n    Γ_xΘ'(Γ_x)_0,0=-_xtr (Θ(Γ_x)).\n\n  \n\n\n\n  Item by item we observe the following.\n  (i) This is straightforward, and explains the notation.\n  \n  (ii) The Hankel operators Γ_ϕ_(η) and Γ_ψ_(η) are Hilbert–Schmidt, so their product is trace class.\n  Then we differentiate the kernel and obtain,\n  \n    _η∫_0^∞ϕ(y+ξ+2η)ψ(ξ+z+2η) ξ=-2ϕ(y+2η)ψ(z+2η),\n\n  which gives an element of the vector space 𝕄_m× m(ℂ) of dimension m^2.\n  \n  (iii) We have for m=1, δ(Γ_ϕΓ_ψ)(y,z)=-ϕ(y)ψ(z).\n  \n  (iv) By hypothesis, there exist ϕ_j,ψ_j∈ L^2(0,∞) for j=1,…,n such that δ K(y,z)=-∑_j=1^n ϕ_j(y)ψ_j(z).\n  Then we introduce the vector functions Φ=(ϕ_1,…, ϕ_n)^T and Ψ=(ψ_1,…, ψ_n)^T\n  so that Γ_Φ^⊤Γ_Ψ =∑_j=1^n Γ_ϕ_jΓ_ψ_j; and also δ(Γ_Φ^⊤Γ_Ψ)=-∑_j=1^n ϕ_j(y)ψ_j(z).\n  We consider W=K-Γ_Φ^⊤Γ_Ψ which belongs to the domain of δ with δ(W)=0, hence, \n  σ_η(W)=W+∫_0^ησ_ξ(δ W) ξ=W,\n  where σ_η(W)→ 0 as t→∞; thus W=0 and K=Γ_Φ^⊤Γ_Ψ is a Hankel product.\n  \n  (v) For even powers we have,\n  \n    2_xtr Γ_x^2k=2∑_j=0^k-1tr (Γ_x^2j_x(Γ_x^2)Γ_x^2(k-j-1))\n      =2k tr (Γ_x^2k-2_xΓ_x^2),\n\n  where the final operator has finite rank. For odd powers, since,\n  \n    2_xtr (Γ_x^2k+1)\n      =    tr (Γ_x'Γ_2^2k+Γ_xΓ_x'Γ_x^2k-1+⋯+Γ_x^2kΓ_x')\n        +tr (Γ_x'Γ_2^2k+Γ_xΓ_x'Γ_x^2k-1+⋯+Γ_x^2kΓ_x'),\n\n  and then we move the terms in the second list one step to the left, except for the first, which we move to the end. Thus we obtain,\n  \n    tr ((Γ_x'Γ_x+Γ_xΓ_x')Γ_x^2k-1\n      +Γ_x (Γ_x'Γ_x+Γ_xΓ_x')Γ_x^2k-2+⋯+Γ_x^2k-1(Γ_x'Γ_x+Γ_xΓ_x'))\n    \n      =(2k+1) tr (Γ_x^2k-1_xΓ_x^2),\n\n  where again the final operator has finite rank.\n\n  Suppose that the spectrum of Γ_x is contained in D(0,r) for some r>0. Then for all s such that | s| >r,\n  we have a convergent power series (s-γ )^-1=∑_j=0^∞γ^j/s^j+1 for all γ in the spectrum of Γ_x and,\n  \n    2 _xtr ((s·𝕀-Γ_x)^-1)=∑_j=1^∞2/s^j+1_xtr (Γ^j_x).\n\n  Then for the first term in the series, we have,\n  \n    2 tr (Γ_x')=2 _x∫_0^∞ϕ(2y+2x)  y=-2ϕ(2x)=-2Γ_x_0,0,\n\n  and for the remaining terms in the series, tr (Γ_x^j-2_xΓ_x^2) equals,\n  \n    -2∫_0^∞⋯∫_0^∞ϕ_(x)(y_0+y_1)ϕ_(x)(y_1+y_2)…ϕ_(x)(y_j-1+y_0)dy_0… dy_j-1,\n\n  which equals -2Γ_x^j_0,0.\n  The result -_xtr ((s·𝕀-Γ_x)^-1)=Γ_x(s·𝕀-Γ_x)^-2_0,0\n  holds for all s such that |s|>r follows when we multiply through by -1/2 and sum over j.\n  By analytic continuation, we have the same identity for all s in the unbounded component of the complement of the spectrum of Γ_x in the complex plane.\n\n  Now let Θ be holomorphic on an open neighbourhood of the spectrum of Γ_x for all x>0.\n  Note that Γ_x→ 0 as x→∞, so this uniformity is a mild restriction.\n  Then there exists a contour C that winds round the spectrum of Γ_x once in the positive sense, so by Cauchy's integral formula\n  Θ (Γ_x)=(2π i)^-1∫_C (s·𝕀-Γ_x)^-1Θ(ζ) ζ, hence, \n  \n    -_xtr (Θ(Γ_x))   =-1/2π i∫_C _xtr ((s·𝕀-Γ_x)^-1)Θ(ζ) ζ\n       =1/2π i∫_CΓ_x (s·𝕀-Γ_x)^-2_0,0Θ(ζ) ζ,\n\n  which integrates to Γ_xΘ'(Γ_x)_0,0. The proof is complete. \n\n\n  For real-valued ϕ, and for Θ(ζ)=ζ^2, the basic formulae are,\n  \n    Γ_x^2_𝔍_2=tr (Γ_x^2)=∫_0^∞yϕ_(x)(y)^2  y\n          and  Γ_x^2_0,0=-12_xtr (Γ_x^2)=∫_0^∞ϕ_(x)(y)^2  y.\n    \n\n\n\n\n\n\n\n§ PÖPPE ALGEBRA\n\nWe prescribe the kernel algebra generated by the quantities V and V^† and their derivatives,\nbased on the Pöppe product in Lemma <ref>, as well as a subalgebra generated by the quantity V-V^† and its derivatives.\nWe also outline abstract versions of these algebras to aid computations.\nWe nominate the abstract algebra as the Pöppe algebra and the corresponding subalgebra the skew-Pöppe algebra.\nThe Pöppe algebra outlined herein represents a generalisation of the Pöppe algebra used in Malham <cit.>\nto derive the non-commutative Korteweg–de Vries hierarchy.\nWe begin with some preliminary identities. Given a Hankel Hilbert–Schmidt operator P=P(x,t) on ,\ndepending on the parameters x∈ and t⩾0, we set, \n\n    V (𝕀-iP)^-1.\n\nRecall that P is self adjoint, so that P^†=P and thus (iP)^†=-iP.\n\n\nGiven a Hankel operator P=P(x,t) which is Hilbert–Schmidt valued, and the definition V(𝕀-iP)^-1, with\nV^†=(𝕀+iP)^-1 the adjoint operator to V, we observe that,\n\n    V≡𝕀+(iP)V≡𝕀+V(iP)\n      and   V^†≡𝕀+(iP)^† V^†≡𝕀+V^†(iP)^†,\n\nand further that, V-V^†≡2 V(iP)V^†.\n\n\n\nAll these identities follow directly from the definitions of V and V^† and partial fraction identities.\n\n\n\nGiven a Hankel Hilbert–Schmidt operator P=P(x,t) on , depending on the parameters\nx∈ and t⩾0, we define the operator G by,\n\n    G V-V^†.\n\n\n\n\nUsing Lemma <ref>, we can write V-V^†=2 V(iP)V^†=2 (iP)U,\nwhere U(𝕀+P^2)^-1. This is possible because V and V^†\ncan be expressed as power series in P with scalar coefficients.\nHence the order of the operators in V(iP)V^† does not matter.\nThus, as outlined in detail in Doikou et al. <cit.>,\nthe flow of G represents a Fredholm Grassmannian flow. \n\n\nIt is now helpful to define the signature character, given previously\nin Malham <cit.> and Doikou et al. <cit.>.\nLet ℕ^∗ denote the free monoid of words on ℕ, i.e. the set\nof all possible words of the form a_1a_2⋯ a_k we can construct from letters a_1, a_2, …, a_k∈ℕ.\n\n\n  Suppose a_1a_2⋯ a_n∈ℕ^∗. The signature character χℕ^∗→ℚ\n  of any such word is given by the product of Leibniz coefficients,\n  \n    χ a_1a_2⋯ a_n↦∏_k=1^n[ a_k+⋯+a_n;       a_k ].\n\n\n\nLet 𝒞(n) denote the set of all compositions of n∈ℕ.\nThe following result is equivalent to that in Malham <cit.>\nand Doikou et al. <cit.>, where detailed proofs can be found.\nFor any integer k, we set (iP)_k^k(iP), V_k^kV and V^†_k^kV^†.\nFor example, if k=2, then V_2=^2V, while if k=-1, then V_-1=^-1V. \n\n\nGiven a Hankel operator P=P(x,t) and that V(𝕀-iP)^-1 with\nV^†=(𝕀+iP)^-1, we observe that V≡ V(iP)_1V and\nV^†≡ V^†(iP)_1^† V^†. With the sum over all compositions a_1⋯ a_k∈𝒞(n), we have,\n\n    V_n=∑χ(a_1⋯ a_n) V(iP)_a_1V⋯ V(iP)_a_kV,\n\nwith the corresponding generalisation for V_n^†. In particular we have,\n\n    V_n-V_n^†=∑χ(a_1⋯ a_n) (V(iP)_a_1V⋯ V(iP)_a_kV-V^†(iP)^†_a_1V^†⋯ V^†(iP)_a_k^† V^†).\n\n\n\n\nWe now construct the algebra generated by V-V^† and its derivatives. For any Hilbert–Schmidt operator W, we set,\n\n    [W] W-W^†    and    {W} W+W^†.\n\nIn other words the bracket `[ · ]' generates the kernel of the difference, between its operator argument\nand corresponding adjoint. It is the kernel of the skew-symmetric part of its operator argument. It is not a commutator.\nThus if v=v(y,z;x,t) is the matrix-valued kernel corresponding to V which depends on the parameters x and t,\nthen [V]=v(y,z;x,t)-v^†(z,y;x,t), where now v^† is the complex conjugate transpose of the matrix v.\nAnalogously, { · } generates the kernel of the symmetric part of its operator argument.\nFrom Lemma <ref>, we observe that,\n\n    [V_n]=∑χ(a_1⋯ a_n) [V(iP)_a_1V⋯ V(iP)_a_kV].\n\nThe kernel monomial algebra is generated by the monomials [V(iP)_a_1V⋯ V(iP)_a_kV],\nincluding monomials of this form with one or more of the V's shown being replaced by V^†.\nThe Pöppe product from Lemma <ref> generates closed-form identities for products of such monomials. \nIn particular, we have the following.\n\n\n  For arbitrary Hilbert–Schmidt operators F and F^' and a Hankel Hilbert–Schmidt operator P with\n  parameter x and a smooth kernel, we have the following,\n\n    F(iP)_aV  V(iP)_bF^'\n      =     F(iP)_a+1V(iP)_bF^'+ F(iP)_aV(iP)_b+1F^'\n        +2  F(iP)_aV(iP)_1V(iP)_bF^',\n     F(iP_a)V^†  V^†(iP_b)F^'\n      =     F(iP)_a+1V^†(iP)_bF^'+ F(iP)_aV^†(iP)_b+1F^'\n        +2  F(iP)_aV^†(iP)_1V^†(iP)_bF^',\n     F(iP)_aV^†  V(iP)_bF^'\n      =     F(iP)_a+1V(iP)_bF^'+ F(iP)_aV^†(iP)_b+1F^',\n     F(iP)_aV  V^†(iP)_bF^'\n      =     F(iP)_a+1V^†(iP)_bF^'+ F(iP)_aV(iP)_b+1F^'.\n\n\n\n\nThe results stated are established straightforwardly. \nFor example, using the identities in Lemma <ref>\nand the basic Pöppe product rule, we observe, \n\n    F(iP)_aV  V(iP)_b F^'\n    =     F(iP)_a+F(iP)_aV(iP)(iP)_bF^'+(iP)V(iP)_b F^'\n    \n    =     F(iP)_a+1(iP)_b F^'\n    + F(iP)_a(iP)_b+1 F^'\n        + F(iP)_a+1(iP)V(iP)_b F^'\n    + F(iP)_a(iP)_1V(iP)_b F^'\n        + F(iP)_aV(iP)_1(iP)_b F^'\n    + F(iP)_aV(iP)(iP)_b+1 F^'\n        + F(iP)_aV(iP)_1(iP)V(iP)_b F^'\n        + F(iP)_aV(iP)(iP)_1V(iP)_b F^'.\n\nCombining terms using the identities in Lemma <ref> generates the first result claimed. And so forth.\n\n\n\n  As mentioned, the set of all kernel monomials of the form V(iP)_a_1V(iP)_a_2V⋯ V(iP)_a_kV,\n  where any of the V's shown may be replaced by V^†, with the Pöppe kernel product defined in Lemma <ref>,\n  form a closed algebra of such monomials. We assume here that all the derivatives of the P operator exist and are Hilbert–Schmidt valued.\n  At this stage it is useful to consider an abstract encoding of this kernel monomial algebra, equipped with the Pöppe kernel product.\n  The abstract algebra is constructed by simply stripping the `iP' and `V' labels from the kernel monomials, and respectively,\n  replacing them by the composition components a_1a_2⋯ a_k, together with a binary encoding of whether an intervening operator is a V\n  or V^†, i.e. we replace,\n  \n    V(iP)_a_1V(iP)_a_2V⋯ V(iP)_a_kV→0 a_10 a_20⋯0 a_k0,\n\n  where any of the 0's shown, corresponding to the V operator, may be replaced by 0^† in the corresponding position\n  that a V^† operator is present in the monomial on the left.\n  In essence, the Pöppe kernel product defined in Lemma <ref> involves operations on these stripped down\n  components only, i.e. operations on the forms 0 a_10 a_20⋯0 a_k0, where again some 0's may be replaced by 0^†. \n  Since we mirror the Pöppe product in the abstract setting in Definition <ref>,\n  we know that the kernel monomial algebra and our abstract algebra encoding just below, are isomorphic.\n\n\nLet us now introduce our abstract encoding for the algebra of operator kernel monomials\nequipped with the Pöppe product in Lemma <ref>, just mentioned.\nGiven a word w=a_1a_2⋯ a_k generated using letters a_1, a_2, …, a_k from ℤ,\nand a word φ=θ_1θ_2⋯θ_k+1 generated using the letters θ_1, θ_2, …, θ_k+1\nchosen from the binary set { 0, 0^†}, let w×ϑ denote the corresponding word,\n\n    w×φ=θ_1 a_1θ_2 a_2θ_3⋯θ_k a_kθ_k+1,\n\nin the free monoid (ℤ_ 0)^∗ where ℤ_ 0ℤ∪{ 0, 0^†}.\nFor such words, there is a single letter from the binary set { 0, 0^†} sandwiched between each of the letters from ℤ,\nas well as one at each end. Let ℂ⟨ℤ_ 0⟩ denote the non-commutative polynomial algebra over ℂ\ngenerated by words from (ℤ_ 0)^∗, endowed with the following Pöppe product.\n\n\n  Consider four words from (ℤ_ 0)^∗ of the form ua 0, ua 0^†, 0bv and 0^† bv,\n  where u and v are any subwords from (ℤ_ 0)^∗ and a,b∈ℤ. We define the Pöppe product\n  from ℂ⟨ℤ_ 0⟩×ℂ⟨ℤ_ 0⟩ to\n  ℂ⟨ℤ_ 0⟩ of these words to be,\n  \n    (ua 0)( 0 bv)   =u(a+1)0 bv+ua 0(b+1)v+2· ua 01 0bv,\n    \n        (ua 0^†)( 0^† bv)   =u(a+1)0^† bv+ua 0^†(b+1)v+2· ua 0^†1 0^† bv,\n    \n        (ua 0^†)( 0 bv)   =u(a+1)0 bv+ua 0^†(b+1)v\n    \n        (ua 0)( 0^† bv)   =u(a+1)0^† bv+ua 0(b+1)v.\n\n\n\nLet ν denote the empty word in ℂ⟨ℤ_ 0⟩.\nThen for any word w×φ∈ℂ⟨ℤ_ 0⟩\nwe have ν (w×φ)=(w×φ) ν=w×φ.\nLet 𝒞∪_n⩾0𝒞(n) denote the set of all compositions.\n\n\nFor any n∈ℕ∪{0}, we define the following linear signature expansions n∈ℂ⟨ℤ_ 0⟩,\n\n    n∑_a_1a_2⋯ a_k∈𝒞(n)χ(a_1a_2⋯ a_k) · 0a_1 0a_2 0⋯ 0a_k 0,\n\nwhere the sum is over all possible compositions a_1a_2⋯ a_k, with k⩾1 parts, of n.\n\n\nFor example, we note that 1=χ(1)· 01 0 and 2=χ(2)· 02 0+χ(11)· 01 01 0.\nFurther note, for the case n=0, the signature expansion simply corresponds to the letter 0 from the binary set { 0, 0^†}.\nEquivalently we can write the relation in Definition <ref> for the case n=0 as 0=χ(0)· 0.\nNaturally by convention, we take χ(0)=1.\nLet us also remark on the following basic identities in ℂ⟨ℤ_ 0⟩, which follow from Lemma <ref>.\n\n\n  We have the following basic relations in ℂ⟨ℤ_ 0⟩,\n  \n    0≡ν+ 00≡ν+0 0,    0^†≡ν+ 0^†0^†≡ν+0^† 0^†  and   0- 0^†=2· 00 0^†.\n\n\n\n\n  Given any word w×φ∈ℂ⟨ℤ_ 0⟩, say \n  w×φ=θ_1 a_1θ_2 a_2θ_3⋯θ_k a_kθ_k+1,\n  the letters a_i^† denote the letters `-a_i' from ℤ, i.e. a_i^†=-a_i. Further we set,\n  \n    (θ_1 a_1θ_2 a_2θ_3⋯θ_k a_kθ_k+1)^†θ_1^† a_1^†θ_2^†  a_2^†θ_3^†⋯θ_k^†  a_k^†θ_k+1^† ,\n\n  i.e. we replace all the letters a_i in w by their counterparts a_i^†=-a_i and all the letters in θ by their counterparts.\n  In the latter instance this means we change all the 0's to 0^†, and vice-versa.\n  Note we do not reverse the order of the terms in w×φ. This means, for example, that\n  we can interpret (w×φ)^†=w^†×φ^†, and since w^†=(-1)^|w|w,\n  where |w| is the length of w, then (w×φ)^†∈ℂ⟨ℤ_ 0⟩.\n\n\nConsider the following skew-symmetric and symmetric forms on ℂ⟨ℤ_ 0⟩.\n\n\nGiven any word w×φ∈ℂ⟨ℤ_ 0⟩,\nwe define its skew-symmetric and symmetric forms in ℂ⟨ℤ_ 0⟩,\nrespectively, by \n\n    [w×φ] w×φ-(w×φ)^†    and    {w×φ} w×φ+(w×φ)^† .\n\nNaturally we have [(w×φ)^†]=-[w×φ] and {(w×φ)^†}={w×φ}.\n\n\nThe following product rules based on the Pöppe product in Definition <ref>,\nare useful for our computations in all subsequent sections.\n\n\n  Consider the elements [ua 0], {ua 0}, [ 0bv] and {0 bv} from ℂ⟨ℤ_ 0⟩,\n  where u and v are any subwords from ℂ⟨ℤ_ 0⟩ and a,b∈ℤ.\n  We have the following Pöppe products in ℂ⟨ℤ_ 0⟩ between these elements,\n  \n    {ua 0} [ 0 bv]   =[u(a+1)[ 0 bv]]+[ua 0[(b+1)v]]+2· [ua 01 0bv],\n    \n        [ua 0] { 0 bv}   =[u(a+1){ 0 bv}]+[ua 0{(b+1)v}]+2· [ua 01 0 bv],\n    \n        [ua 0] [ 0 bv]   ={u(a+1)[ 0 bv]}+{ua 0[(b+1)v]}+2·{ua 01 0bv},\n    {ua 0} { 0 bv}   ={u(a+1){ 0 bv}}+{ua 0{(b+1)v}}+2·{ua 01 0bv}.\n\n  These products also hold when [ua0]=[0], which case term on the right involving `(a+1)' is absent.\n  Likewise, these products also hold when [0bv]=[0], in which case the term on the right involving `(b+1)' is absent. \n\n\n\n  The results are established straightforwardly using Definition <ref> for the abstract Pöppe product.\n  Consider for example the first product shown, we observe that,\n  \n    {ua 0} [ 0 bv]=    (ua 0+(ua 0)^†)( 0 bv-( 0 bv)^†)\n    \n        =    u(a+1)0 bv+ua 0(b+1)v+2· ua 01 0bv\n        -u(a+1)( 0bv)^†-ua 0((b+1)v)^†\n        +(u(a+1))^†0 bv+(ua 0)^†(b+1)v\n        -(u(a+1) 0bv)^†-(ua 0(b+1)v)^†-2·(ua 01 0 bv)^†,\n\n  which gives the first product result. The other three cases follow completely analogously.\n  For the case, for example, when [ua0]=[0] in the second product, we use that,\n  since [0]=2·000^† and 000^†=0^†00,\n  we have [000^†]=[0^†00]=000^†+0^†00=[0].\n  Hence we observe, since [0]=[0^†00], we can use the latter form in\n  the corresponding product already established, so using the properties of the skew and symmetric forms in\n  Definition <ref> we have,\n  \n    [0] {0bv}=    [0^†00] {0bv}\n    \n        =    [0^†1{ 0 bv}]+[0^†0 0{(b+1)v}]+2· [0^†0 01 0 bv]\n    \n        =    [0^†1 0 bv]+[01 0 bv]+[0^†0 0(b+1)v]+[00 0^†(b+1)v]+2· [0^†0 01 0 bv]\n    \n        =    [0(b+1)v]-[ 0^†(b+1)v]+[(0^†+0+2·0^†0 0)1 0 bv]\n    \n        =    [0{(b+1)v}]+2·[ 01 0 bv].\n\n  The remaining cases follow completely analogously.\n  \n\n\n  We observe that, using the properties of the skew-symmetric and symmetric forms `[ · ]' and `{ · }'\n  recorded in Definition <ref>, the skew and symmetric Pöppe products quoted in Lemma <ref>\n  are sufficient to resolve the Pöppe products of all possible skew-symmetric or symmetric forms we might encounter.\n  For example if the left factor is of the form [ua 0^†] or {ua 0^†}, then\n  we can use that [ua 0^†]=-[(ua)^† 0] or {ua 0^†}={(ua)^† 0} and then apply\n  the product rules shown to the latter forms. Similarly we can use that [ 0^† bv]=-[ 0(bv)^†]\n  and { 0^† bv}={ 0(bv)^†}.  \n\n\n\n  We observe, to compute the Pöppe product of any monomials of the form\n  [w_1×φ_1] [w_2×φ_2]  ⋯ [w_k×φ_k],\n  we really only need the rule for [ · ] [ · ] and say the rule\n  for [ · ] { · } in Lemma <ref>.\n  This is because we can work from right to left through the products in such a monomial.\n  We can alternatively use { · } [ · ] and work from left to right.\n\n\n\n  The skew-form [0] corresponds to the general skew-form [w×φ] in which the\n  composition component/word w=ν, the empty word, and φ=0, i.e. we have [ν×0]=[0].\n  Note if φ=0^†, this simply corresponds to `-[0]' or equivalently `-[ν×0]'. In Pöppe products,\n  the skew-form [0] has some rather special properties, as highlighted in Lemma <ref>.\n  By Remark <ref> and the second result in proof of Lemma <ref>,\n  we have, for example,\n  \n    [ 0] [0 bv]   ={0[(b+1)v]}+2·{ 01 0bv},\n    \n        [ua 0] [ 0]   ={u(a+1)[0]}+2·{ua 01 0},\n    \n        [0] {0bv}   =[0{(b+1)v}]+2·[ 01 0bv].\n\n  In particular, setting bv to be the empty word ν, we have [ 0]^2=2·{ 010}.\n\n\n\n\n  Consider a multi-factor product of signature expansions of the form,\n  \n    [ n_1] [ n_2] ⋯ [ n_k]\n        =∑(χ(w_1)χ(w_2)⋯χ(w_k))·[w_1×φ_1] [w_2×φ_2] ⋯ [w_k×φ_k],\n\n  where the sum is over all words w_1×φ_1 with w_1∈𝒞(n_1), w_2×φ_2 with w_2∈𝒞(n_2), and so forth.\n  Note, the form [w_1×φ_1] [w_2×φ_2] ⋯ [w_k×φ_k] generates many different\n  words in ℂ⟨ℤ_ 0⟩.\n  We observe that it would be convenient to encode χ(w_1)χ(w_2)⋯χ(w_k) as χ(w_1 w_2⋯ w_k).\n  Indeed, hereafter, we assume that χ acts homomorphically on any such tensor product of compositions so that indeed we have,\n  \n    χ(w_1 w_2⋯ w_k)≡χ(w_1)χ(w_2)⋯χ(w_k).\n\n\n\n\nLet us now outline some simple examples. \n\n\n  By definition [ 0] 0- 0^†.\n  Using the notation [ 0]^2=(χ(0)·[ 0]) (χ(0)·[ 0]) and so forth,\n  then using the product rules in Lemma <ref> we observe (also see Remark <ref>),\n  \n    [ 0]^2=    χ(00)·{ 010},\n    \n        [ 0]^3=    [ 0] [ 0]^2\n    \n        =    (χ(0)·[ 0]) (χ(00){ 010})\n    \n        =    χ(000)·[ 0{2 0}]+χ(000)·[ 01 0 1 0],\n\n  where the tensor notation `' in the argument of χ=χ(·) indicates a tensor product `'\n  together with the fact that an extra real factor of `2' should be included\n  with the χ=χ(·) factor shown. See Remark <ref> just below.\n\n\n\n  Hereafter, we also use the tensor notation `' in the argument of χ=χ(·) to indicate\n  when the skew or symmetric form were generated by the `quasi' term 2·[ua010 bv] in one of\n  the Pöppe products in Lemma <ref>.\n  We illustrated this in Example <ref> just above. We observe therein that\n  the result of the product [0]^2 is `2' times the symmetric form { 010}.\n  This symmetric form emerges from the `quasi' term in the Pöppe product of χ(0)·[ 0]\n  with χ(0)·[ 0] and a natural way to record this is the form χ(00)·{ 010}.\n  The tensor product of the zeros in the argument of χ=χ(·) indicates that the symmetric\n  form is the result of the product of [0] with [0], while the fact that the tensor product\n  is `' indicates it was the result of the `quasi' term in the Pöppe product, and an extra factor \n  of 2 is implied. In this case if we evaluate the signature character we include an extra factor of `2'\n  in its evaluation. Also consider the product [0]^3 in Example <ref>. \n  When we compute the Pöppe product\n  (χ(0)·[ 0]) (χ(00){ 010}), the first skew form generated,\n  i.e. [ 0{2 0}], has the coefficient χ(000) as we might expect, using the\n  homomorphic properties of χ. However the second term generated by the product\n  (χ(0)·[ 0]) (χ(00){ 010}), which is [ 01 0 1 0],\n  has the coefficient χ(000). This is because this second term is the result of the `quasi'\n  term 2·[ua010 bv] in the Pöppe product; here ua=ν and bv=10. The factor `2'\n  is absorbed/encoded by the fact that a `' tensor (instead of just `') is used between the first 0 and the 00,\n  the respective χ-arguments for [0] and { 010},\n  in the coefficient χ(000) for [ 01 0 1 0] in Example <ref>. \n  See Example <ref> for further illustrations of this notation.\n\n\n\n\n Using the Pöppe products in Lemma <ref> and that [ 1]=χ(1)·[ 010], we have,\n \n    [ 1] [ 0]^2=    (χ(1)·[ 010]) (χ(00)·{ 0 1 0})\n    \n        =    χ(100)·([ 02{010}]+[010{20}])\n        +χ(100)·[0101010],\n    \n        [ 0]^2 [ 1]=    (χ(00)·{ 0 1 0}) (χ(1)·[ 010])\n    \n        =    χ(00 1)·([ 02[010]]+[010[20]])\n        +χ(001)·[0101010].\n\n\n\n\n\n  Given any word w×φ∈ℂ⟨ℤ_ 0⟩ with\n  w×φ=θ_1a_1θ_2⋯θ_ka_kθ_k+1, we define the \n  derivation endomorphism  on ℂ⟨ℤ_ 0⟩ \n  to be the linear expansion,\n  \n    (w×φ)    ∑_ℓ=1^kθ_1a_1θ_2⋯θ_ℓ(a_ℓ+1)θ_ℓ+1⋯θ_ka_kθ_k+1\n        +∑_ℓ=1^k+1θ_1a_1θ_2⋯θ_ℓ-1a_ℓ-1(θ_ℓ)a_ℓθ_ℓ+1⋯θ_ka_kθ_k+1,\n\n  where θ_ℓ equals 01 0 or 0^† 1^† 0^†,\n  depending respectively on whether θ_ℓ is 0 or 0^†. \n\n\n\n  The action of the derivation endomorphism on 0 and 0^† shown in the definition\n  reflects the signature expansions, either at the kernel or abstract level. In this case here, we\n  know V=V(iP)_1V and V^†=V^†(iP)_1^† V^† or equivalently 1=χ(1)· 01 0\n  and 1^†=χ(1)· 0^† 1^† 0^†=- 0^† 1 0^†. Similarly, \n  the action of the derivation endomorphism on any signature expansion, say n, is given by,\n  n↦(n+1), and similarly for n^†.\n\n\nNow suppose, within ℂ⟨ℤ_ 0⟩, we restrict ourselves to the set of skew-symmetric forms [w×φ].\nNaturally, as a vector space, ℂ⟨ℤ_ 0⟩ can be decomposed into the direct sum of the \nvector subspaces ℂ[ℤ_ 0] of skew-symmetric forms, and ℂ{ℤ_ 0} of symmetric forms:\n\n    ℂ⟨ℤ_ 0⟩=ℂ[ℤ_ 0] ⊕ ℂ{ℤ_ 0}.\n\nWe observe from the Pöppe products in Lemma <ref>,\nthe product [w_1×φ_1] [w_2×φ_2] does not generate a skew-symmetric form but a symmetric one.\nHowever any triple product [w_1×φ_1] [w_2×φ_2] [w_3×φ_3]\ndoes generate a skew-symmetric form. This is true for any Pöppe products involving an odd number of skew-symmetric forms. \nHence we can define a subalgebra of the Pöppe algebra ℂ⟨ℤ_ 0⟩ which\nwe denote by ℂ[ℤ_ 0]⊆ℂ⟨ℤ_ 0⟩, which is generated\nby skew-symmetric forms and triple products of such forms.\n\n\nWe call ℂ[ℤ_ 0] the skew-Pöppe algebra. \n\n\n\n  In practice, in particular in the next two sections, we perform calculations in the “enveloping” algebra ℂ⟨ℤ_ 0⟩,\n  and at the end, show that the result remains closed within the skew-Pöppe algebra ℂ[ℤ_ 0].\n  However, the skew-Pöppe algebra and its triple product structure is crucial to the proof of our main result in Section <ref>.\n\n\n\n\n\n\n\n\n\n\n\n§ HIERARCHY EXAMPLES\n \nWe use the skew-Pöppe algebra ℂ[ℤ_ 0] to establish integrability for examples from the\nnon-commutative nonlinear Schrödinger and modified Korteweg–de Vries hierarchy. \nThis was first considered in an analogous context in Doikou et al. <cit.>.\nRecall the linear dispersion equation, the `base' equation, we introduced in Section <ref>.\nHereafter we assume Hilbert–Schmidt operators P and G satisfy, respectively, the linear dispersive\npartial differential equation _t P=-μ_n(iℐ)^n-1^n P and the linear Fredholm equation\niP=G(𝕀+P^2). We also assume P^†=P. We observe that with V(𝕀-iP)^-1,\nthen assuming it exists, we have,\n\n    G=V(iP)V^†.\n\nNote we scale this by a factor `2' presently so that it matches the expression in Definition <ref>.\nWe record the following identities that prove useful below; also see Doikou et al.  <cit.>.\nAlso recall the identities in Lemma <ref> and Remark <ref>.\n\n\nThe block operators P and V satisfy the following idenitites,\n\n    Pℐ=-ℐ P,    ℐV=V^†ℐ    and     Vℐ=ℐV^†.\n\n\n\n\nThe first identity follows from the block structures assumed for P and ℐ. The latter\ntwo identities follow using the power series expansion for V(𝕀-iP)^-1. \n\n\nWe now rescale our definition for G above by a factor `2', and set,\n\n    G V-V^†.\n\nHereafter, we are thus concerned with the quantity [V] V-V^†. \nUsing that _tV=V_t(iP)V and _tV^†=V^†_t(iP)^† V^†,\nand that _t(iP)=-μ_n(iℐ)^n-1^n(iP)\nand _t(iP)^†=-(-1)^n-1μ_n^n(iP)^†(iℐ)^n-1,\nwe observe that for any n∈ℤ, we have\n\n    _t[V]=    V_t(iP)V-V^†_t(iP)^† V^†\n    \n      =     -μ_n(V(iℐ)^n-1^n(iP)V-(-1)^n-1V^†^n(iP)^†(iℐ)^n-1V^†).\n\nFor convenience set ℳ_n-μ_n(iℐ)^n-1. Using the identities in Lemma <ref>, we have,\n\n    ℳ_n^-1_t[V]=[V(iP)_nV],     when n is odd,\n    [V^†(iP)_nV],    when n is even.\n\n\nWe now establish integrability for some examples from the non-commutative nonlinear Schrödinger hierarchy.\nWe express ℳ_n^-1_t[V] in the skew-Pöppe algebra as follows.\n\n\nGiven n∈ℤ, we define the time-derivation endomorphism\n𝔢_nℂ[ℤ_ 0]→ℂ[ℤ_ 0] by,\n\n    𝔢_n[ 0]↦\n                                          [ 0n 0],     when n is odd,\n    \n                                          [ 0n 0^†],    when n is even.\n\n\n\nThe nonlinear fields we seek are expressed in the skew-Pöppe algebra as follows.\n\n\n  For n∈ℕ∪{0}, let π_n=π_n([ 0],[ 1],…,[ n]) denote a\n  polynomial consisting of a linear combination of odd-degree monomials of signature expansions\n  in the skew-Pöppe algebra ℂ[ℤ_ 0] of the form,\n  \n    π_n∑_k=1(odd)^n∑_a_1a_2⋯ a_k c_a_1a_2⋯ a_k· [ a_1] [ a_2] ⋯ [ a_k].\n\n  The first sum is over odd values of k. The second sum is over all words a_1a_2⋯ a_k we can construct from\n  the alphabet {0,1,2,…,n} such that a_1+a_2+⋯+a_k=n-(k-1). This ensures π_n is an odd polynomial.\n  The coefficients c_a_1a_2⋯ a_k are scalar constants.\n\n\nOur goal is to show 𝔢_n([ 0]) can be expressed in terms of a Pöppe polynomial\nπ_n=π_n([ 0],[ 1],…,[ n]) in the skew-Pöppe algebra ℂ[ℤ_ 0].\nThus for each n∈ℕ∪{0}, our goal is to determine the coefficients c_a_1a_2⋯ a_k such that,\n\n    𝔢_n=π_n.\n\nThe examples we explore here correspond to the simple cases n=0,1,2,3,4, as follows.\n\n[Linear ordinary differential equation: n=0]\nWe observe 𝔢_0([ 0])=[ 0 0 0^†].\nRecall that a^†=-a for letters from ℤ in (ℤ_ 0)^∗,\nincluding a=0. Hence we observe,\n\n    [ 0 0 0^†]= 0 0 0^†- 0^†0^† 0= 0 0 0^†+ 0^†0 0= 0- 0^†=[ 0].\n\nIn other words 𝔢_0([ 0])=[ 0] which translates to the following linear ordinary differential\nequation for g= G, with ℳ_0=μ_0iℐ,\n\n    _tg=ℳ_0 g.\n\n\n\n[Linear wave equation: n=1]\n  We observe 𝔢_1([ 0])=[ 01 0].\n  From Definition <ref>, we have the signature expansion [ 1]=[ 01 0],\n  since χ(1)=1. From Definition <ref> for the derivation endomorphism, we know [ 0]=[ 1]. \n  Hence we have, 𝔢_1([ 0])=[ 0] in ℂ[ℤ_ 0].\n  This translates to the linear wave equation for g= G, with ℳ_1=-μ_1 𝕀,\n  \n    _tg=ℳ_1  g.\n\n\n\n[Nonlinear Schrödinger equation: n=2]\n  We observe 𝔢_2([ 0])=[ 02 0^†].\n  Using the homomorphic properties of χ, the values for the signature coefficients given in Definition <ref>\n  and that each tensor product `' under χ generates a real factor of 2, we have χ(000)=2 and χ(000)=4.\n  Then from Example <ref>, we see that we have,\n  [ 0]^3=2·[ 0{2 0}]+4·[ 01 0 1 0]=2·[ 02 0]-2·[ 02 0^†]+4·[ 01 0 1 0],\n  using that [ 0{2 0}]=[ 02 0]-[ 02 0^†],\n  and that 2^†=-2. The signature expansion for [ 2]=^2[ 0] is given by,\n  [ 2]=χ(2)·[ 02 0]+χ(11)·[ 01 0 1 0]=[ 02 0]+2·[ 01 0 1 0].\n  Hence we observe, 𝔢_2([ 0])=[ 2]-1/2·[ 0]^3 in ℂ[ℤ_ 0].\n  This translates to the non-commutative nonlinear Schrödinger equation \n  for g= G, with ℳ_2=-μ_2 (iℐ),\n  \n    ℳ_2^-1_tg=^2g-12g^3.\n\n\n\n\n  In all examples, rescaling the solution g to 2 g recovers the usual corresponding\n  equations in the non-commutative nonlinear Schrödinger hierarchy. This is because we assumed \n  G V-V^† rather than G=V(iP)V^†≡1/2(V-V^†).\n\n\n[Modified Korteweg–de Vries equation: n=3]\n  We observe 𝔢_3([ 0])=[ 03 0]. Recall from Example <ref> that,\n  [ 0]^2=χ([0 0])·{ 0 1 0}.\n  Note this lies in ℂ⟨ℤ_ 0⟩ as opposed to the skew-Pöppe algebra ℂ[ℤ_ 0].\n  From the results of Example <ref>, evaluating the signature characteristers, we know\n  [ 1] [ 0]^2=2·([ 02{010}]+[010{20}])+4·[0101010]\n  and [ 0]^2 [ 1]=2·([ 02[010]]+[010[20]])+4·[0101010].\n  Then using the properties of the skew form from Definition <ref>, we see that,\n  \n    [ 02{010}]+[ 02[010]]=2·[ 02010]\n          and  [ 010{20}]+[ 010[20]]=2·[01020].\n\n  The signature expansion for [ 3]=^3[ 0] is given by,\n  \n    [ 3]   =χ(3)·[ 03 0]+χ(21)·[02010]+χ(12)·[01020]\n        +χ(111)·[ 01 01 0 1 0]\n       =[ 03 0]+3·[02010]+3·[01020]+6·[ 01 01 0 1 0].\n\n  Hence we see that, 𝔢_3([ 0])=[ 3]-34·([ 1] [ 0]^2+[ 0]^2 [ 1]),\n  in ℂ[ℤ_ 0]. This translates to the non-commutative modified Korteweg–de Vries equation \n  for g= G, with ℳ_3=μ_3 𝕀,\n  \n    ℳ_3^-1_tg=^3g-34(( g)g^2+g^2( g)).\n\n\n\n\n\n\n\n\n[Fourth order quintic nonlinear Schrödinger equation: n=4]\nIn this case we know 𝔢_4([ 0])=[ 04 0^†].\nFor this and higher orders, our procedure needs to be systematic. The Pöppe polynomial in this\ncase has the form,\n\n    π_4    c_4·[ 4]+c_200·[2] [0]^2+c_020[0] [2] [0]\n    +c_002·[0]^2 [2]\n        +c_110·[1]^2 [0]+c_101·[1] [0] [1]\n    +c_011·[0] [1]^2+c_00000·[0]^5.\n\nThe signature expansion for [4] has the form,\n\n    [4]=    χ(4)·[040]+χ(31)·[03010]+χ(22)·[02020]+χ(13)·[01030]\n        +χ(211)·[0201010]+χ(121)·[0102010]+χ(112)·[0101020]\n        +χ(1111)·[010101010].\n\nUsing the skew and symmetric Pöppe products in Lemma <ref> we find, for example, that,\n\n    [ 2] [ 0]^2=    (χ(2)·[ 020]+χ(11)·[01010]) (χ(00)·{ 0 1 0})\n    \n      =    χ(200)·([ 03{010}]+[020{20}])\n      +χ(200)·[0201010]\n        +χ(1100)·([ 0102{010}]+[01010{20}])\n        +χ(1100)·[010101010].\n\nThe other products shown in π_4 can be similarly expanded. In Table <ref> we list all the basis elements\nand corresponding coefficients generated by all the Pöppe products present in π_4. The values of the coefficients \nare the χ-images of the tensored terms shown. Each row generates a linear algebraic\nequation for the expansion coefficients c_4, c_200, c_110, …c_00000. Note that in Table <ref>\nrows are ordered according to descent order, with a sub-order for the positions of the 0^† letters\nas indicated. The ordering of the columns is self-evident from the structure present in the table. We discuss\nthis ordering in more explicitly in Section <ref>.\nUsing all the rows shown, we generate an over-determined linear system of algebraic equations, AC=B,\nwhere B is the column vector shown in the right-hand column in Table <ref>, C is the vector of coefficients c_4,\nc_020, and so forth in the order shown across the top row. The matrix A consists of the χ-images of the entries shown in the table\n(neglecting the final column).\nFrom the augmented matrix [A  B], we observe the first two rows generate a closed system of equations,\nnamely c_4+2c_020=0 and -2c_020=1. This system of equations corresponds to the following smaller \naugmented matrix subsystem [A_0 B_0] for c_4 and c_020, where\n\n    A_0=[  1  2;  0 -2 ]    and     B_0=[ 0; 1 ].\n\nHence we deduce c_4=1 and c_020=-1/2. With these values in hand, we then observe that the next two\nrows also generate a closed system of equations for c_200 and c_011 given by 4c_4+2c_020+2c_200+2c_011=0 and 2c_020-2c_200+2c_011=0.\nThis linear system of equations for the two unknowns c_200 and c_011 is represented by the smaller augmented matrix subsystem [A_1 B_1], where,\n\n    A_1=[  2  2; -2  2 ]    and     B_1=[ -3;  1 ].\n\nSolving the linear system of equations, we deduce that c_200=-1 and c_011=-1/2. The next four rows in the augmented matrix [A  B],\ngiven the coefficients we have already solved for, generate a closed system of equations for c_110, c_101, c_002 and c_00000,\ngenerated by the smaller augment matrix [A_2  B_2], where,\n\n    A_2=[  1  1  2  4; -1  1  0 -4;  1 -1  0 -4; -1 -1  2  4 ]    and     B_2=[ -5/2; -5/2; -1/2; -3/2 ].\n\nThe solution to this system is given by c_110=-1/2, c_101=-3/2, c_002=-1 and c_00000=3/8.\nIt is easy to check the equations represented by the remaining rows in the big augmented matrix [A  B]\nabove, are consistent. Thus, we deduce that 𝔢_4([ 0])=π_4, where the coefficients c_4, c_020 and so forth,\nare given by the unique values outlined above.\nThe fourth order non-commutative nonlinear Schrödinger equation for g= G, with ℳ_4=μ_4iℐ, is given by,\n \n    ℳ_4^-1_tg=    ^4g-(^2g)g^2-12g(^2g)g-g^2(^2g)\n        -12( g)^2g-32( g)g( g)-12g( g)^2+38g^5.\n\nThis matches the form given in Malham <cit.> and Nijhoff et al. <cit.>.\n\n\n\n\n\n\n  In Tables <ref> and <ref> we record the basis elements of the form\n  [w×φ] in the far left column. The composition components w are compositions of n,\n  i.e. compositions of 3 and 4, in the respective tables. The ℤ_2^∗-component φ in the basis element\n  is in principle any possible (|w|+1)-tuples that can be constructed from\n  {0,0^†}≅ℤ_2. However, recall [(w×φ)^†]=-[w×φ]\n  and the Definition <ref>. \n  Using this property for [(w×φ)^†], for any basis element [w×φ], we can thus always\n  arrange for the first component of φ to be `0'; as can be observed in the tables. \n  The basis elements are ordered according to descent order for the compositions w and natural binary ordering for the\n  ℤ_2^∗-components φ. For more details see Definition <ref>\n  in Section <ref>, and the subsequent discussion therein.\n  Note that though the first component of φ can always be arranged to be 0,\n  in our computations involving Pöppe products, we often utilise the symmetry [(w×φ)^†]=-[w×φ]\n  in order to use the Pöppe products listed in Lemma <ref>.\n  Thus temporarily, the first component in some factors is sometimes 0^†.\n  However, we always use the same symmetry again to convert the final answer to the form with 0 as the\n  first component in the basis element.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ NON-COMMUTATIVE LAX HIERARCHY AND THE SINE-GORDON EQUATION\n\nHerein we establish the non-commutative nonlinear Schrödinger and modified Korteweg–de Vries Lax hierarchy iteratively,\norder by order. The non-commutative modified Korteweg–de Vries hierarchy can be found for example in Carillo and Schiebold <cit.>.\nImportantly, this iterative hierarchy extends to all negative orders. The first member of negative order, i.e. for which n=-1, corresponds to\nthe non-commutative sine-Gordon cubic-form equation in Example <ref>; see, for example, Tracy and Widom <cit.> for the scalar case.\nEstablishing the hierarchy for all orders n∈ℤ is particularly simple in the Pöppe algebra ℂℤ_0.\nWe need to define some natural actions on ℂℤ_0 first.\n\n\n  We define the standard commutation and symmetric products, respectively,\n  adℂℤ_0×ℂℤ_0→ℂℤ_0 and\n  sdℂℤ_0×ℂℤ_0→ℂℤ_0.\n  For example, for [0]∈ℂ[ℤ_0]⊂ℂℤ_0\n  and any word w×φ∈ℂℤ_0 we have,\n    \n    ad_[0](w×φ)   [0] (w×φ)-(w×φ) [0], \n    sd_[0](w×φ)   [0] (w×φ)+(w×φ) [0],\n\n    which is the exclusive form of their action we use below.\n    We also define the following two actions on the skew-Pöppe algebra ℂ[ℤ_0].\n    For [0]∈ℂ[ℤ_0] set,\n    \n    A1/4ad_[0]^-1ad_[0],\n    \n        S1/4sd_[0]^-1sd_[0].\n\n\n\nThat the actions of A and S are closed in ℂ[ℤ_0] is established as part of\nthe proof of the following crucial lemma.\n\n\n  For any n∈ℤ we have:\n  \n    (-A)[0n0^†]   =[0(n+1)0],\n    \n        (-S)[0n0]   =[0(n+1)0^†].\n\n\n\n\nBy direct computation using Lemma <ref> we have,\n \n    ad_[0] [0n0^†]   =[0][0n0^†]-[0n0^†][0]\n       =2·({0(n+1)0^†}+{010n0^†}+{0n0^†1^†0^†})\n       =2· {0n0^†}.\n\nHence we observe, using that {0 n0^†}=-{0^† n0} we have,\n\n    A [0n0^†]\n         =12([0] {0n0^†}+{0^† n0} [0])\n       =[0(n+1)0^†]-[0(n+1)0]+[010n0^†]+[0^† n010]\n       = [0n0^†]-[0(n+1)0].\n\nThis gives the first result. Again, by direct computation, we have,\n\n    sd_[0] [0n0]\n      =    [0] [0n0]+[0n0] [0]\n    \n      =    2 ({0(n+1)0}+{010n0}+{0n010})\n    \n      =    2· {0n0}.\n\nHence we observe, \n\n    S [0n0]\n      =    12([0] {0n0}+{0n0} [0])\n    \n      =    [0(n+1)0]+[010n0]+[0n010]-[0(n+1)0^†]\n    \n      =     [0n0]-[0(n+1)0^†].\n\nThis gives the second result.\n\nThe following immediate corollary is established straightforwardly by induction, both when n is positive as well as negative.\nFor the remainder of this section we refer to Pöppe polyomials π_n for n∈ℤ, though in Definition <ref>,\nn∈ℕ∪{0} for which π_n=π_n([0],[1],…,[ n]). The form of π_n for the\nnegative integer cases is given presently.\n\n\nLet n∈ℤ be a given integer, and consider the equation, 𝔢_n([ 0])=π_n,\nwhere π_n is a Pöppe polynomial and 𝔢_n([ 0]) equals [ 0n 0] if n is odd, and equals [ 0n 0^†] if n is even.\nFor n=0,1,2,3,4 such polynomials π_n exist, as demonstrated in Examples <ref>—<ref>. Then we have,\n\n    𝔢_n+1([ 0])= (-A)π_n,    when n is even,\n    \n                                                        (-S)π_n,    when n is odd.\n\n\n\n\nThis follows directly from Lemma <ref> for n∈ℤ by induction.\n \n\nFurther, we have the following additional immediate corollary.\n\n\n  For any n∈ℤ, the (n+1)th order member equation of the non-commutative Lax hierarchy is given by,\n  \n    𝔢_n+1([ 0])= (-A) ((-S)(-A))^n/2 [0],    when n is even,\n    ((-S)(-A))^1/2(n+1) [0],    when n is odd.\n\n\n\nThe Lax hierarchy stated in Corollary <ref>, at each odd order n, exactly matches that quoted \nfor the non-commutative modified Korteweg–de Vries hierarchy in Carillo and Schiebold <cit.>.\nGiven the main existence and uniqueness result we prove in Section <ref>, this is expected.\nThe cases n=0,1,2,3,4 in Corollary <ref> naturally match the non-commutative equation\nmembers given in Examples <ref>—<ref>. However, Corollary <ref> also\napplies for negative n. Consider the example case of order `-1'. \n\n[Non-commutative sine-Gordon cubic-form equation: order `-1']\nSetting n=-2, a case when n is even, in Corollary <ref>, generates the equation,\n\n    𝔢_-1([ 0])=(-A)((-S)(-A))^-1 [0]  ⇔  \n      (-S) 𝔢_-1([ 0])=[0].\n\nWe can express the equation on the right as follows,\n\n    𝔢_-1([ 0])\n        =[0]+14((^-1𝔢_-1([ 0]^2)) [0]\n        +[ 0] (^-1𝔢_-1([ 0]^2))),\n\nwhere we have used that sd_[0] 𝔢_-1([ 0])=𝔢_-1([ 0]^2) from Lemma <ref> just below.\nThis relation in ℂ[ℤ_0] translates to the non-commutative sine-Gordon cubic-form equation \ngiven in Example <ref> for g= G, with ℳ_-1=μ_-1 𝕀, i.e.\n\n    _tg-14((^-1_tg^2) g+g (^-1_tg^2))=μ_-1g.\n\nInvoking the factor `2' rescaling mentioned in Remark <ref> gives the exact match.\n\n\n\n  For any n∈ℤ we have,\n  \n    𝔢_n([ 0]^2)=sd_[0] 𝔢_n([ 0]),    when n is odd,\n    ad_[0] 𝔢_n([ 0]),    when n is even.\n\n\n\n\n  This result is established at the operator level. Recall ℳ_n-μ_n(iℐ)^n-1\n  and the properties outlined in Lemma <ref>. We observe when n is even, we have,\n  \n    _t[V]^2=    ℳ_n[V(iP)_nV^†] [V]+[V] ℳ_n[V(iP)_nV^†]\n    \n      =    ℳ_n[V(iP)_nV^†] [V]-ℳ_n[V] [V(iP)_nV^†],\n\n  where we have used that  [V] ℳ_n= V-V^† ℳ_n=ℳ_n  V^†-V=-ℳ_n[V]. \n  When n is odd, we follow an analogous computation with [V(iP)_nV] replacing [V(iP)_nV^†] just above,\n  and that in this case there is no sign change in the second term on the right as \n  [V] ℳ_n= V-V^† ℳ_n=ℳ_n  V-V^†=ℳ_n[V].\n\n\nNaturally we can continue to consider further negative order hierarchy member equations. For example,  \nthe non-commutative order `-2' equation can be generated by setting n=-3, a case when n is odd,\nin Corollary <ref>. With 𝔢_-2([ 0])=[ 0(-2) 0^†],\nthis generates the non-commutative equation,\n\n    𝔢_-2([ 0])=((-S)(-A))^-1 [0]  ⇔  \n      (-S)(-A) 𝔢_-2([ 0])=[0].\n\nAnd so forth.\n\nThe example integrable equations in Examples <ref>–<ref> in Section <ref>\nwere of the form _tg=π(g, g,^2g,…) for n=0,1,2,3,4. Indeed for these examples, we show \nthe equation is unique in this class. In other words, at each of the orders considered, given the base dispersion equation\nfor P and the form of the Marchenko equation, the right-hand side in the non-commutative nonlinear partial differential equation,\nthe `nonlinear field', is of the form π=π(g, g,^2g,…), where π is a polynomial in its arguments.\nIn Section <ref>, we establish this fact to all orders n⩾0. \n\n\n\n\n\n\n§ HIERARCHY UNIQUENESS\n\nHerein we prove that at each order n⩾0, the Pöppe polynomial signature\nexpansion π_n such that 𝔢_n([ 0])=π_n, exists, and is unique. This is our main result.\nBefore presenting this result in the general case, we present one further example, the n=5 case.\nThis case acts a useful reference for our general argument.\n\n[Fifth order quintic modified Korteweg–de Vries equation: n=5]\nIn this case 𝔢_5([ 0])=[ 05 0] and \nthe Pöppe polynomial π_5, in general, has the form,\n\n    π_5    c_5·[ 5]+c_300·[3] [0]^2+c_030·[0] [3] [0]\n    +c_003·[0]^2 [3]+c_210·[ 2] [1] [0]\n        +c_201·[ 2] [0] [1]+c_120·[ 1] [2] [0]+c_102·[ 1] [0] [2]+c_021·[ 0] [2] [1]\n        +c_012·[ 0] [1] [2]+c_111·[ 1] [1] [1]\n    +c_10000·[1] [0]^4+c_01000·[0] [1] [0]^3\n        +c_00100·[0]^2 [1] [0]^2+c_00010·[0]^3 [1] [0]+c_00001·[1] [0]^4.\n\nThe signature expansion for [5] has the form,\n\n    [5]=    χ(5)·[050]\n        +χ(41)·[04010]+χ(32)·[03020]+χ(23)·[02030]+χ(14)·[01040]\n        +χ(311)·[0301010]+χ(221)·[0202010]+χ(212)·[0201020]\n        +χ(131)·[0103010]+χ(122)·[0102020]+χ(113)·[0101030]\n        +χ(2111)·[020101010]+χ(1211)·[010201010]+χ(1121)·[010102010]\n        +χ(1112)·[010101020]+χ(11111)·[01010101010].\n\nUsing the skew and symmetric Pöppe products in Lemma <ref> we find, for example, that,\n\n    [1]    [2] [0]\n    \n      =    (χ(1)·[ 010]) (χ(2)·[020]+χ(11)·[01010])\n       (χ(0)·[0])\n    \n      =    (χ(1)·[ 010]) (χ(20)·{03[0]}+χ(20)·{02010}\n                      +χ(110)·{0102[0]}+χ(110)·{0101010})\n      \n      =    χ(120)·([ 02{03[0]}]+[010{4[0]}])\n      +χ(120)·[010103[0]]\n        +χ(120)·([ 02{02010}]+[010{3010}])\n      +χ(120)·[010102010]\n        +χ(1110)·([ 02{0102[0]}]+[010{102[0]}])\n      +χ(1110)·[01010102[0]]\n        +χ(1110)·([ 02{0101010}]+[010{201010}])\n        +χ(1110)·[01010101010].\n\nThe other products shown in π_5 can be similarly expanded. In Tables <ref> and <ref>\nwe list the essential basis elements and corresponding signature coefficients generated by all the Pöppe products present in π_5.\nThe values of the coefficients are the χ-images of the tensored terms shown. Each row generates a linear algebraic\nequation for the expansion coefficients c_5, c_300, c_210, …c_00001.\nThe ordering of rows and columns in Tables <ref> and <ref> is self-evident.\nWe discuss this ordering in detail presently.\nUsing all the rows shown, we generate an over-determined linear system of algebraic equations, AC=B,\nwhere B is the column vector shown in the right-hand column in Table <ref> and C is the vector of coefficients c_5,\nc_030, c_300, c_021 and so forth in the order shown. The matrix A is populated with the χ-images of the signature coefficients\nshown in the tables. We can in fact solve AC=B for C systematically, block by block, as follows.\nThe first two rows corresponding to [050] and 0^†50 generate the pair of equations,\nc_5+2c_030=1 and c_030=0. This system of equations corresponds to the smaller augmented subsystem [A_0 B_0^']\nwhere A_0 is the same matrix as in Example <ref> for the order n=4 case, and B_0^'=(1,0)^T.\nWe deduce c_5=1 and c_030=0. The next two rows corresponding to [04010] and [040^†10^†] generate\nthe pair of equations 5c_5+2c_030+2c_300+2c_021=0 and 2c_030-2c_300+2c_021=0 for c_300 and c_021.\nThis pair corresponds to the smaller augmented subsystem [A_1 B_1^'] where A_1 is the same matrix as in Example <ref>,\nand B_1^'=(-5,0)^T. Hence we deduce c_021=-5/4 and c_300=-5/4. Then the equations corresponding to\nthe rows [03020], [03020^†], [030^†20] and [030^†20^†]\ngenerate the following smaller augmented matrix subsystem [A_2  B_2^'] for c_210, c_201, c_012 and c_01000, where,\nA_2 is the same as the corresponding matrix in Example <ref> and B_2^'=(-25/4,-5/4,5/4,5/4)^T.\nThis system of linear equations is easily solved to reveal c_210=-5/4, c_201=-5/2, c_012=-5/4 and c_01000=0.\nAs we shall see, it is no coincidence that the coefficent matrices A_0, A_1 and A_2 match those for the\nanalogous blocks of basis elements in Example <ref>.\nThe next set of rows corresponding to the basis elements \n[02030], [02030^†], [020^†30] and [020^†30^†],\ngenerates exactly the same augmented matrix subsystem [A_2  B_2^'] as that discussed just above,\nbut now for the unknown coefficients c_120, c_102, c_003 and c_00010. \nThis linear system reveals c_120=-5/4, c_102=-5/2, c_003=-5/4 and c_00010=0.\nWe do not deduce any new information from the equations corresponding to the rows [01040] and [01040^†],\nother than that they are consistent.\nWe consider the next block of four rows shown in Tables <ref> and <ref> corresponding to\nthe rows [0202010], [02020^†10^†], [020^†2010] and [020^†20^†10^†].\nThese basis elements generate the following augmented matrix subsystem [A_3^'  B_3] for c_111, c_10000, c_00100 and c_00001, where,\n\n    A_3^'=[  1  4  4  4;  1 -4 -4  4;  1 -4  4 -4;  1  4 -4 -4 ]    and     \n    B_3=[  5; -5; -5; -5 ].\n\nThis system of linear equations is easily solved to reveal c_111=-5/2, c_10000=5/8, c_00002=5/8 and c_00001=5/8. \nWe have determined the unique set of coefficients for which 𝔢_5([ 0])=π_5.\nIn principle we can check the equations generated by the rows corresponding to the remaining basis elements are consistent.\nHowever, we explain in our proof of our main result (Step 8) why this is not necessary.\nHence the fifth order non-commutative modified Korteweg–de Vries for g= G, with ℳ_5=μ_5 𝕀,\nis given by (this matches the form given in Nijhoff et al. <cit.>),\n\n    ℳ_5^-1_tg=    ^5g-5/4((^3g)g^2+g^2(^3g)\n      +(^2g)( g)g\n        +2 (^2g)g( g)+( g)(^2g)g+2 ( g)g(^2g)\n        +g(^2g)( g)+g( g)(^2g)\n        +2 ( g)( g)( g))\n        +5/8(( g)g^4+g^2( g)g^2+g^4( g)).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe now consider the general order n⩾0 case. Our goal is to establish the following. \n\n\nFor every n∈ℕ∪{0}, there exists a unique Pöppe polynomial π_n=π_n([0],[1],…,[ n])\nin ℂ[ℤ_0] such that 𝔢_n([ 0])=π_n.\n\n\nWe prove this result through a sequence of steps. It requires some preparation and the \nrest of this section is devoted to outlining the notation, strategy, ideas\nand intermediate results we require to carry through the proof in Steps 1–7 before giving the\noverall proof in Step 8. We have the following immediate corollary of Theorem <ref>.\n\n\n  For any integer n⩾0, the Lax hierarchy generated by the iteration indicated in\n  Corollary <ref> is unique. The non-commutative nonlinear equation at order n in the Lax hierarchy\n  is simply that represented by 𝔢_n([ 0])=π_n in Theorem <ref>.\n\n\n\nWhen n is even, we know from Corollary <ref>\nthat 𝔢_n+1([ 0])=(-A)π_n. Now from Theorem <ref> we know\n𝔢_n+1([ 0])=π_n+1 with π_n+1=π_n+1([0],[1],…,[ n+1])\na unique polynomial in its arguments. We thus deduce the result of the corollary when n is even.\nAn exactly analogous argument follows for the case when n is odd.\n\nLet us now return to the proof of Theorem <ref>.\nRoughly, in the proof of Theorem <ref>, we construct a `table' for the coefficients of π_n,\nmuch like we did for the cases n=3,4,5 in Tables <ref>—<ref>.\nIndeed, Tables <ref> and <ref> act as a useful reference.\nWe proceed systematically, considering basis elements [w×φ] in descending order with respect to the composition\n𝒞-component w and using a natural binary order for the ℤ_2^∗-component φ.\nBoth these orders are implicit in Tables <ref>—<ref>.\n\n\n\nStep 1: Descent and binary order.\nWe introduce an order, the descent order, on the set of basis elements. We also define a new respresentation for the\nbasis elements, the composition-binary representation, that we use hereafter.\nThe descent order for compositions is given in Malham <cit.>; we present it here for completeness. \n\n\nA composition u∈ precedes another composition v∈ if the length of the compostion u, i.e. the number of digits it contains,\nis strictly less than the length of v. If u and v have the same length, say k, so u=u_1u_2⋯ u_k and v=v_1v_2⋯ v_k,\nthen u precedes v if for some ℓ∈{1,2,…,k} we have u_1=v_1, u_2=v_2, …, u_ℓ-1=v_ℓ-1 and u_ℓ<v_ℓ. \nOtherwise, v precedes u. The resulting ordering induced on , is the descent ordering.\n\n\nThe ℤ_2^∗-component φ in the basis element [w×φ] is any (|w|+1)-tuple constructed from\n{0,0^†}≅ℤ_2. Recall from Remark <ref>,\nwe can always arrange for the first component of φ to be `0'; see Tables <ref>—<ref>.\nThus for any given composition w∈𝒞, the component φ∈ℤ_2^∗ in a basis element [w×φ]\nis one of the following forms,\n\n    ϕ_100⋯0000, ϕ_200⋯0000^†, ϕ_300⋯000^†0, ϕ_400⋯000^†0^†,\n       ϕ_500⋯00^†00, ϕ_600⋯00^†00^†, ϕ_700⋯00^†0^†0,\n\nand so forth, all the way up to ϕ_2^|w|00^†⋯0^†0^†0^†0^†.\nThis is the natural binary ordering of ℤ_2^∗ we refer to just above.\nIn this and the next sections, we mainly use a modified encoding of the basis elements [w×φ], as follows.\nWe replace the free monoid ℤ_2^∗ of all forms φ that can be constructed from {0,0^†}≅ℤ_2\nby the vector space ℝ𝔹 representing the span over all the elements 𝔹{ϕ_i}_i⩾1.\nWe thus express any φ∈ℤ_2^∗ in the form φ=β_1ϕ_1+β_2ϕ_2+β_3ϕ_3+⋯, where the β_i\nfor integer i⩾1, represent the coefficients of the basis element components ϕ_i. Henceforth we\nrepresent any element φ∈ℤ_2^∗ by a 2^|w|-tuple β(β_1,β_2,…,β_2^|w|)∈ℝ𝔹.\nThus we replace,\n\n    [w×φ]⇝[w]×β.\n\n\n\n   Some examples matching the old notation with the new are as follows: [0a0]=[a]×(1,0), [0a0^†]=[a]×(0,1), and then also,\n  \n    [0a_10a_20]   =[a_1a_2]×(1,0,0,0),\n    \n        [0a_10a_20^†]   =[a_1a_2]×(0,1,0,0),\n    \n        [0a_10^† a_20]   =[a_1a_2]×(0,0,1,0),\n    \n        [0a_10^† a_20^†]   =[a_1a_2]×(0,0,0,1),\n    \n        [0a_10a_20a_30]   =[a_1a_2a_3]×(1,0,0,0,0,0,0,0),\n    \n        [0a_10a_20a_30^†]   =[a_1a_2a_3]×(0,1,0,0,0,0,0,0),\n    ⋮   \n    \n        [0a_10^† a_20^† a_30^†]   =[a_1a_2a_3]×(0,0,0,0,0,0,0,1),\n\n  and so forth. Naturally, as constructed, for linear combinations, we have for example that for any real scalar constants β_1 and β_2,\n\n    β_1·[0a_10a_20]+β_2·[0a_10^† a_20]=[a_1a_2]×(β_1,0,β_2,0),\n\nand so forth. There is a natural basis for elements of ℝ𝔹 of a given length 2^n. Such a basis is\ngiven by the elements of length 2^n of the form β_i(0,…,0,1,0,…), where the `1' is in the ith position. \n\n\n\n  We call the representation [w]×β where w∈𝒞 and β∈ℝ𝔹\n  the composition-binary representation of the basis elements. We call [w] the composition component and\n  β the ℝ𝔹-component.\n\n\n\n\n\nStep 2: Triple product action.\nAll the Pöppe polynomials π_n are polynomials in the skew-Pöppe algebra ℂ[ℤ_ 0]\nand thus necessarily of odd degree. As such all the monomials therein can be constructed from triple products\nof signature expansions [ n], as we have seen in Examples <ref>—<ref>.\nIn particular we characterise the following triple product action which is established straightforwardly using\nthe Pöppe product rules in Lemma <ref>.\n\n\n  Consider the two signature expansions [ a] and [ b] and a basis element [cw×φ]∈ℂ[ℤ_ 0],\n  with c∈ℤ the first letter in the composition `cw'. Let φ̂ denote the element of ℤ_2^∗\n  given by φ with its first letter `0' removed.\n  Then at leading order the triple product action [ a] [ b] ([cw×φ]) is given by,\n  \n    χ(a b cw)\n        ·(   [ 0(a+1)0(b+1)0 c(w×φ̂)]+[ 0(a+1)0^†(b+1)0 c(w×φ̂)]\n    \n        +   [ 0(a+1)0(b+1)0^† c(w×φ̂)^†]+[ 0(a+1)0^†(b+1)0^† c(w×φ̂)^†]\n    \n        +   [ 0(a+1)0 b0 (c+1)(w×φ̂)]+[ 0(a+1)0^† b0^† (c+1)(w×φ̂)]\n    \n        +   [ 0(a+1)0 b0 (c+1)(w×φ̂)^†]+[ 0(a+1)0^† b0^† (c+1)(w×φ̂)^†]\n    \n        +   2·[ 0a0(b+2)0 c(w×φ̂)]+2·[ 0a0(b+2)0^† c(w×φ̂)^†]\n    \n        +   [ 0a0(b+1)0(c+1)(w×φ̂)]+[ 0a0(b+1)0^†(c+1)(w×φ̂)]\n    \n        +   [ 0a0(b+1)0(c+1)(w×φ̂)^†]+[ 0a0(b+1)0^†(c+1)(w×φ̂)^†])+⋯.\n\n  Here by leading order, we mean, we do not retain terms generated by lower (descent) order terms\n  in the signature expansions of [ a] and [ b], nor do we retain terms generated with a quasi-product term—i.e.\n  generated using any of the final terms with real factor `2' in the Pöppe products in Lemma <ref>.\n  We use the notation `+⋯' do denote these missing terms.\n\n\nWe also define the following auto-tensorial action on ℝ𝔹.\n\n\n  Given β(β_1,β_2,…) and γ(γ_1,γ_2,…)\n  in ℝ𝔹 we define the (left) auto-tensorial action of β on γ,\n  denoted βγ, to be,\n  \n    βγ(β_1·γ, β_2·γ,…),\n\n  where for each i=1,2,…, we note β_i·γ=(β_iγ_1,β_iγ_2,…).\n\n\nIn the new notation, with the tensorial action on ℝ𝔹 just defined,\nthe triple product action on ℂ[ℤ_ 0] given in Lemma <ref>\ncan be expressed more succinctly as follows.\n\n \n  Given two signature expansions [ a] and [ b] and a generic basis element\n  [cw]×β∈ℂ[𝒞]×ℝ𝔹≅ℂ[ℤ_0],\n  the triple product action [ a] [ b] ([cw]×β) on ℂ[𝒞]×ℝ𝔹\n  is given at leading order by,\n  \n    [ a] [ b] ([cw]×β)uuuu   \n    \n      =χ(a b cw)·(   [(a+1)(b+1)cw]×((1,0,1,0)β+(-1)^|w| (0,1,0,1)β^†)\n    \n        +   [(a+1)b(c+1)w]×((1,0,0,1)(β+(-1)^|w| β^†))\n        \n        +   [a(b+2)cw]×((2,0,0,0)β+(-1)^|w| (0,2,0,0)β^†)\n    \n        +   [a(b+1)(c+1)w]×((1,1,0,0)(β+(-1)^|w| β^†))\n        )+⋯.\n\n  Here, if β=(β_1,β_2,β_3,…,β_2^n), then β^†=(β_2^n,β_2^n-1,…,β_2,β_1).\n\n\n\nThe result of the corollary is just a restatement of the triple product action in Lemma <ref>.\nThat the adjoint of β, denoted β^†, corresponds to reversing the elements in β is explained as follows.\nThe entries in β correspond to the coefficients of the basis ϕ_1, ϕ_2, …, ϕ̂_2^n, for some n∈ℕ.\nThe triple product action in Lemma <ref> involves the components φ̂^† where\nφ̂ corresponds to φ with its first letter `0' removed. Let ϕ̂_1, ϕ̂_2, …, ϕ̂_2^n,\nbe the same sequence of basis elements each of which has the first letter `0' removed. We observe,\n{ϕ̂_1^†,ϕ̂_2^†,…,ϕ̂_2^n^†}={ϕ̂_2^n,ϕ̂_2^n-1,…,ϕ̂_1}.\n\n\n\n  Consider computing the triple product [ a] [ b] [ c] to leading order. In this case,\n  to leading order [ c]=[0 c 0]+⋯ and so in Corollary <ref> we have w=ν, the empty word, with |w|=0. \n  We observe, [ 0c0]=[c]×γ with γ=(1,0)∈ℝ𝔹.\n  Hence we have,\n  \n    (1,0,1,0)γ   =(1·(1,0), 0·(1,0), 1·(1,0), 0·(1,0) )=(1,0,0,0,1,0,0,0),\n    \n        (0,1,0,1)γ^†   =(0·(0,1), 1·(0,1), 0·(0,1), 1·(0,1) )=(0,0,0,1,0,0,0,1),\n\n  and so forth. Hence we observe from Corollary <ref> that at leading order,\n  \n    [ a] [ b] [ c]\n      =χ(a b c)·(   [(a+1)(b+1)c]×(1,0,0,1,1,0,0,1)\n        +[(a+1)b(c+1)]×(1,1,0,0,0,0,1,1)\n        +[a(b+2)c]×(2,0,0,2,0,0,0,0)\n        +[a(b+1)(c+1)]×(1,1,1,1,0,0,0,0))+⋯.\n\n\n\nWe extensively use such computations hereafter. \n\n\n\n\nStep 3: Generators, a coarse-grain overview.\nFor a given basis element [w]×β and composition w of n∈ℕ, it is\nuseful to identify the types of odd-degree monomials of signature expansions that might generate it.\n\n\n  Given a basis element [w]×β with a composition component [w] and an ℝ𝔹-component β,\n  where w is a composition of n∈ℕ and β has length 2^n, we call any odd-degree\n  monomial of signature expansions of the form [ a_1] [ a_2] ⋯ [ a_2m+1] that produces\n  [w]×β as one of the terms in its expansion, a monomial generator or just generator of [w]×β.\n\n\nAt this stage and in this step, it is useful to give a brief coarse overview of our overall strategy,\nwhich we implement in detail in the subsequent steps below. We show in this step how, for any given composition component,\nwe can identify, for the associated basis elements, specific collections of generators. We call the sets of\nbasis elements and corresponding collections of generators “coefficient blocks” or simply “blocks”.\nWe show that such blocks are necessarily square.  \nTo start, consider any one-part composition w of n, so the two corresponding basis elements\nare [0 n0]⇝[n]×(1,0) and [0 n0^†]⇝[n]×(0,1).\nThe basis element [n]×(1,0) is generated by signature expansion [ n], while\n[n]×(0,1) is not. On the other hand, both basis elements are generated by [0] [n-2] [0].\nThis exhausts all the possible odd-degree monomials in π_n that could generate\n[n]×(1,0) and  [n]×(0,1). Thus for a one-part composition, the possible odd-degree generators\nhave the form,\n\n    [⋆], [0] [⋆] ([0]),\n\nwhere [⋆] represents the appropriate generic signature expansion, i.e. in the first instance it is [ n]\nand in the second instance, i.e. for [0] [⋆] ([0]), the middle [⋆] factor is [n-2].\nNote, we allow [⋆]=[0].\nThe only other possibilities are [⋆] [0] [0] and [0] [0] [⋆].\nHowever for n⩾3, we can rule these two possibilities out as [0] [0]=2·{010} and any subsequent Pöppe product\nof this term with [0] would generate a basis element [w]×β where the composition w has two parts.\nNote of course, the triple Pöppe product [ a] [ b] [ c] is naturally associative.\n\nNow consider any two part composition w=a_1a_2 of n. We observe that basis elements with such a two-part  \ncomposition component can in principle be generated by [⋆] and [0] [⋆] [0], which we have already come across just above.\nHowever such basis elements can also be generated by any of the following four generators of the form,\n\n    [⋆] [⋆] ([0]), [⋆] [0] ([⋆]), [0] [⋆] ([⋆]), [0] [⋆] ([0] [⋆] ([0])).\n\nWe observe that each possible generator above contains only two `[⋆]' factors, consistent with the\ntwo-part composition component of the basis elements we are aiming to generate. Further note that\nwe can also see that the four generators above can be constructed from the previous two generators\n[⋆] and [0] [⋆] ([0]) corresponding to one-part compositions, by applying\none of the three actions [⋆] [⋆] (·), [⋆] [0] (·) or [0] [⋆] (·) to them.\nFor example, the first generator above is constucted by applying the action [⋆] [⋆] (·) to [⋆]=[0],\nwhere we must set the argument [⋆]=[0] to preserve the two-part composition component of the basis element\nwe wish to generate. The next two generators above are constructed by applying the actions\n[⋆] [0] (·) or [0] [⋆] (·) to [⋆]. Now consider the final quintic generator above.\nApplying the action [⋆] [⋆] (·) to [0] [⋆] ([0]) would produce a generator with too many `[⋆]'\nfactors, while in principle, either of the actions [⋆] [0] (·) or [0] [⋆] (·) could be\napplied to [0] [⋆] ([0]). However the action of [⋆] [0] (·) on [0] [⋆] (·)\nis nilpotent. We demonstrate this below in Lemma <ref>. Hence the action\n[⋆] [0] (·) rigorously applied to [0] [⋆] ([0]) produces zero. Thus the\nonly viable action is [0] [⋆] (·) on [0] [⋆] ([0]) producing the quintic generator shown.\nFrom another perspective, for the quintic generator, in the case n⩾5, any other quintic arrangment with \ntwo [⋆]- and three [0]-factors, would necessitate a consecutive pair `[0] [0]' that would result\nin generating a basis element whose composition component has more than two parts.\n\nIn the case of basis elements with a three-part composition component w=a_1a_2a_3,\nthe possible generators are, in principle, any of the generators we have already seen, as well as, \nthe generators of the form,\n\n    [⋆] [⋆] ([⋆]),    [⋆] [⋆] ([0] [⋆] ([0])),\n       [⋆] [0] ([⋆] [⋆] ([0])),\n       [⋆] [0] ([⋆] [0] ([⋆])),\n       [0] [⋆] ([⋆] [⋆] ([0])),\n       [0] [⋆] ([⋆] [0] ([⋆])),\n       [0] [⋆] ([0] [⋆] ([⋆])),\n       [0] [⋆] ([0] [⋆] ([0] [⋆] ([0]))).\n\nWe remark that each possible generator above contains only three `[⋆]' factors.\nWe see that the first two generators are constructed by applying the action [⋆] [⋆] (·)\nto the generators for basis elements with one-part composition components.\nThe next set of generators are constructed by applying the action [⋆] [0] (·) to\nthe generators for basis elements with two-part composition components, taking into account \nthe nilpotent action of [⋆] [0] (·) on [0] [⋆] (·).\nThis accounts for the next two generators. Then the final four generators are constructed\nby applying the action [0] [⋆] (·) to all four of the generators \nfor basis elements with two-part composition components.\n\nFor the case of basis elements with a four-part composition component w=a_1a_2a_3a_4,\nthe possible generators are, in principle, besides any of the generators we have already seen, \ngenerators of the form,\n\n    [⋆] [⋆] ([⋆] [⋆] ([0])), [⋆] [⋆] ([⋆] [0] ([⋆])),\n       [⋆] [⋆] ([0] [⋆] ([⋆])), [⋆] [0] ([⋆] [⋆] ([⋆])),\n       [0] [⋆] ([⋆] [⋆] ([⋆])),\n       [⋆] [⋆] ([0] [⋆] ([0] [⋆] ([0]))),\n       [⋆] [0] ([⋆] [⋆] ([0] [⋆] ([0]))),\n       [⋆] [0] ([⋆] [0] ([⋆] [⋆] ([0]))),\n       [⋆] [0] ([⋆] [0] ([⋆] [0] ([⋆]))),\n       [0] [⋆] ([⋆] [⋆] ([0] [⋆] ([0]))),\n       [0] [⋆] ([⋆] [0] ([⋆] [⋆] ([0]))),\n       [0] [⋆] ([⋆] [0] ([⋆] [0] ([⋆]))),\n       [0] [⋆] ([0] [⋆] ([⋆] [⋆] ([0]))),\n       [0] [⋆] ([0] [⋆] ([⋆] [0] ([⋆]))),\n       [0] [⋆] ([0] [⋆] ([0] [⋆] ([⋆]))),\n       [0] [⋆] ([0] [⋆] ([0] [⋆] ([0] [⋆] ([0])))).\n\nAgain, each possible generator above contains only four `[⋆]' factors.\nThey are constructed by applying the action \n[⋆] [⋆] (·) to the generators for basis elements with two-part composition components,\napplying the action [⋆] [0] (·) to\nthe generators for basis elements with three-part composition components, taking into account \nthe nilpotent action of [⋆] [0] (·) on [0] [⋆] (·), and\nthen also applying the action [0] [⋆] (·) to all of the generators \nfor basis elements with three-part composition components.\n\nWe have seen that for basis elements with a composition component with k=1,2,3 or 4 parts,\nthe number of generators that might produce such a basis element is 2^k.\nWe have not shown that corresponding to a given basis element, the generators\nconstructed in the manner indicated are unique at leading order. We demonstrate\nthis below in Steps 7 and 8. Assuming this is the case for the moment,\nwe have the following.\n\n\n  For a given basis element with composition component w, the number of\n  monomial generators that can generate that basis element at leading order is 2^|w|.\n\n\n\n  As observed, the result is true for |w|=1,2,3,4. Assume the result is\n  true for |w|=1,2,…,k for some k∈ℕ.\n  The set of generators for basis elements with composition components of k+1 parts\n  are constructed by: (i) Applying the action  [⋆] [⋆] (·)\n  to the generators for basis elements with (k-1)-part composition components of which there are 2^k-1 by assumption;\n  (ii) Applying the action [⋆] [0] (·) to the generators for basis elements with k-part composition components, taking into account \n  the nilpotent action of [⋆] [0] (·) on [0] [⋆] (·). Since there are 2^k generators corresponding to any\n  basis element with a composition of k-parts, and half of these start with the factor `[0]  [⋆]', there are 2^k-1\n  generators constructed in this way; and then finally (iii) Applying the action [0] [⋆] (·) to all of the generators \n  for basis elements with k-part composition components, of which there are 2^k. Adding these three contributions up, 2^k-1+2^k-1+2^k=2^k+1,\n  and the result follows by induction.\n\n\nWe can also view this last result from another perspective as follows.\nFor each k-part composition, when k is odd, the set of new generators are characterised \nas follows. First, we include the degree k monomial [⋆] [⋆] ⋯ [⋆],\nof which there is only one choice. We also include the degree k+2 monomials which\ncontain two non-adjacent `[0]' factors; there are k+1 choose 2 possible monomials of this form.\nThen we can also include degree k+4 monomials which contain four non-adjacent `[0]' factors;\nthere are k+1 choose 4 possible monomials of this form. And so forth until we reach the single\ndegree 2k+1 monomial of the form [0] [⋆] [0] [⋆] [0] ⋯ [⋆] [0].\nHere we have implicitly used that the number of ways to place r objects in non-adjacent slots whose\ntotal number is m, is given by m-r+1 choose r. In the examples just presented, we\nconsidered the number of possible ways of placing 2ℓ factors of the form `[0]' in\na monomial of degree k+2ℓ, for ℓ=0,1,…,(k+1)/2. Hence the total number of\nmonomials of each degree outlined being k+1 choose 2ℓ. Thus with k odd, the total number of\nsuch new odd-degree monomials is given by the sum over ℓ=0,1,…,(k+1)/2 of k+1 choose 2ℓ,\ni.e. the sum on the left shown in Lemma <ref>. \nSuppose now k is even. The lowest degree monomials that might generate the corresponding basis element  \nare those of degree k+1 with a single factor `[0]'. There are k+1 such monomials.\nWe can also include degree k+3 monomials with three non-adjacent factors `[0]'; there\nare k+1 choose 3 such possible monomials, and so forth. In the final highest degree monomial,\nof degree 2k+1 has the single form [0] [⋆] [0] [⋆] [0] ⋯ [⋆] [0].\nThus with k even, the total number of such new odd-degree monomials is given by the sum\nover ℓ=0,1,…,k/2 of k+1 choose 2ℓ+1, i.e. the sum on the right shown in Lemma <ref>. \nIn consequence we have the following important result.\n\n\n  The aforementioned sums, in the respective k is odd and then even cases, are equal to 2^k.\n  In other words, respectively, when k is odd and then even, we have, \n  \n    ∑_ℓ=0^(k+1)/2[ k+1;  2ℓ ]=2^k    and    ∑_ℓ=0^k/2[  k+1; 2ℓ+1 ]=2^k.\n\n\n\n\n  Suppose k is odd. Then by direct computation, we observe,\n  \n    ∑_ℓ=0^(k+1)/2(k+1)!/(k+1-2ℓ)!(2ℓ)!\n         =    2+∑_ℓ=1^(k-1)/2k!/(k-2ℓ)!(2ℓ-1)!(1/k-2ℓ+1+1/2ℓ)\n    \n         =    2+∑_ℓ=1^(k-1)/2k!/(k+1-2ℓ)!(2ℓ-1)!+∑_ℓ=1^(k-1)/2k!/(k-2ℓ)!(2ℓ)!\n    \n         =    1+[ k; 1 ]+[ k; 2 ]+[ k; 3 ]+⋯+[   k; k-1 ]+1,\n\n  where we matched up respective pairs from the sums and then used that 2^k=(1+1)^k. This gives the first result.\n  When k is even, we again use that 2^k=(1+1)^k, and observe,\n  \n    2^k=[ k; 0 ]+[ k; 1 ]+[ k; 2 ]+⋯\n        +[ k; k ]=∑_ℓ=0^k/2(k+1)!/(k-2ℓ)!(2ℓ+1)!,\n\n  where we paired up successive terms and parameterised the pairs by ℓ=0,1,…,k/2. \n  This gives the second result.\n\n\nThe crucial observation from the result of Lemmas <ref> and <ref> is the following.\n\n\n  For a given composition component w of a block set of basis elements [w]×β parameterised\n  by the tuples β∈ℝ𝔹, \n  the number of new monomial generators equals the dimension of the tuple block, i.e. 2^|w|.\n\n\nOne of our main concerns now is to show that the resulting square block of signature coefficients has full rank.\nThe next three steps address this issue, making the analysis of this section more precise.\n\n\n\nStep 4: The three standard triple actions.\nWe have seen that the triple product action in Corollary <ref>, in the full form given therein,\nas well as in the special forms [ a] [0] (·) and [0] [ b] (·),\nare used to construct the generators corresponding to a given basis element. We call these three actions the\nstandard triple actions.\n\n\n  We call the actions [ a] [ b] (·), [ a] [0] (·)\n  and [0] [ b] (·) the three standard triple actions.\n\n\nThe result of the action [ a] [ b] (·) is given in Corollary <ref>.\nAs we use them frequently hereafter, we record the result of the standard actions\n[ a] [0] (·) and [0] [ b] (·) in the following Corollary.\nThey are just special cases which we call the special actions. \n\n\n  The two special actions [ a] [0] (·) and [0] [ b] (·)\n  are given at leading order by,\n  \n    [ a] [0] ([cw]×β)\n      =    χ(a 0 cw)·[(a+1)(c+1)w]×((1,-1)(β+(-1)^|w|β^†))+⋯,\n      \n      [0] [ b] ([cw]×β)\n      =    χ(0 b cw)·([(b+2)cw]×((2,0)β+(-1)^|w|(0,2)β^†)\n                +[(b+1)(c+1)w]×((1,1)(β+(-1)^|w|β^†)))+⋯.\n\n\n\n\n  By direct computation using the Pöppe product rules in Lemma <ref>, we observe that\n  [ a] [0] ([cw×φ]) equals,\n\n    χ(a 0 cw)·(    [0(a+1)0(c+1)(w×φ̂)]+[0(a+1)0(c+1)(w×φ̂)^†]\n        -[0(a+1)0^†(c+1)(w×φ̂)]-[0(a+1)0^†(c+1)(w×φ̂)^†)+⋯,\n\nat leading order, giving the first result.\nThen, by direct computation for the other case, we observe that [0] [ b] ([cw×φ]) equals,\n\n    χ(0 b cw)·(    2·[0(b+2)0c)(w×φ̂)]+2·[0(b+2)0^† c)(w×φ̂)^†]\n        +[0(b+1)0(c+1)(w×φ̂)]+[0(b+1)0^†(c+1)(w×φ̂)]\n        +[0(b+1)0(c+1)(w×φ̂)^†]+[0(b+1)0^†(c+1)(w×φ̂)^†)+⋯,\n\nat leading order, giving the second result. \n\n\n  Comparing the results of Corollary <ref> with Corollary <ref> we emphasise\n  two observations, that there is: (i) A natural contraction of the action forms due to the `[0]' factors in the action;\n  (ii) An apparent change of sign in the second term on the right in the first example. We can view both cases as\n  the consequence of substituting [ν×0] for [ b] in the first case and then [ν×0] for [ a]\n  in the second case. The sign change, perhaps more easily observed from the corresponding result in Lemma <ref>,\n  is a consquence of the fact that to make the appropriate substitution of [ν×0] for [ b], we should\n  convert the two terms with 0^† b0^† on the right, to -0^† b^†0^† first.\n\n\n\n\n\n\nStep 5: Generating blocks. We now show precisely how, given a block of basis elements characterised\nby a given composition component w and parameterised by the corresponding 2^|w| basis elements β of ℝ𝔹,\nwe can use the three standard actions to enumerate all the monomial generators that produce the basis elements\nof that block at leading order, and also establish the corresponding signature coefficient associated with\neach such basis element. Let us examine the three standard actions given in \nCorollaries <ref> and <ref> more closely.\nIf we examine the right-hand side of [ a] [ b] ([cw]×β)\nin Corollary <ref>, then we observe that in terms of descent order, the first\ncomposition term `[(a+1)(b+1)cw]' on the right is highest, and thus we retain that term only.\nIn Corollary <ref>, at leading order, the action [ a] [0] ([cw]×β) in unique, while\nthe right-hand side of [0] [ b] ([cw]×β) contains two terms, the\nfirst of which is higher in terms of descent order, which is the one we retain.\nThus at leading order the three standard actions on [cw]×β are:\n\n    [ a] [ b] (·)   =χ(cw)·[(a+1)(b+1)cw]×((1,0,1,0)β+(-1)^|w| (0,1,0,1)β^†)+⋯,\n    \n    [ a] [0] (·)   =χ(cw)·[(a+1)(c+1)w]×((1,-1)β+(-1)^|w|(1,-1)β^†)+⋯,\n    \n    [0] [ b] (·)   =χ(cw)·[(b+2)cw]×((2,0)β+(-1)^|w|(0,2)β^†)+⋯.\n\nHere we have used the homomorphic properties of χ, in particular that χ(a b cw)=χ(a 0 cw)=χ(0 b cw)=χ(cw).\nConsider the following respective replacements in each of the three actions above:\n(i) a→ a-1, b→ b-1, c→ν; (ii) a→ a-1, c→ c-1 and (iii) b→ b-2.\nWith these three choices, each of the actions generates the same composition acw—in the first case we relabel b as c and\nin the third case we relabel b as a. Recall from our coarse-grain overview in Step 3 that to enumerate the generators\ncorresponding to basis elements with composition components with k⩾2 parts, we apply the first action to the generators\nat level k-2, and the two special actions to the generators at level k-1, taking into account the nilpotent action outlined\njust below in Lemma <ref>.\nWe note that, for any sequence û∈ℝ𝔹, with |û|=2^k-2, we have,\n\n    (1,0,1,0)û   =(1,1)(1,0)û=(1,1)(û,0),\n    \n      (0,1,0,1)û^†   =(1,1)(0,1)û^†=(1,1)(0,û^†),\n\nwhere (û,0) and (0,û^†) are of length 2^k-1.\nPutting these observations together, we have thus established the following lemma.\n\n\nAt leading order, with the choices mentioned above, the following three standard actions generate the same composition with the\nrespective ℝ𝔹 components indicated,\n\n    [a-1] [c-1] ([w]×β)   =χ(w)·[acw]×((1,1)((û,0)\n      -(-1)^|w|(û,0)^†)),\n     \n      [a-1] [0] ([(c-1)w]×β)   =χ((c-1)w)·[acw]×((1,-1)((â,b̂)\n      +(-1)^|w|(â,b̂)^†)),\n    \n      [0] [a-2] ([cw]×β)   =χ(cw)·[acw]×((2,0)(â,b̂)\n      +(-1)^|w|(0,2)(â,b̂)^†).\n\nHere, in the first case β=(û,0)∈ℝ𝔹 with û arbitrary, and in the second and third cases\nβ=(â,b̂)∈ℝ𝔹 is arbitrary. Each such β is of length 2^|acw|-1,\nand â and b̂ have the same length—matching that of û.\n\n\n\n  Note, in the statement of Lemma <ref>, the case of the first action which corresponds to\n  the action [ a] [ b] (·) applied to [cw]×β in the discussion preceding the Lemma.\n  In that discussion, when we set c→ν, we equivalently replaced cw by w. This means that\n  we should effectively consider the length of w to be one less than would otherwise be the\n  case. This explains why the sign in front of the term with the factor (-1)^|w| in the first action case is negative\n  in the statement of the Lemma.\n\n\nSome further clarifications on the statement of Lemma <ref> are required. Note that,\n\n    [0]⇝[ν]×(1),\n\nwhere ν is the empty composition and (1) is the element of ℝ𝔹 corresponding to\ncompositions of zero parts. The special action [0] [a-2] (·)  in Lemma <ref>\nstill applies when the argument [cw]×β=[ν]×(1) and thus when (â,b̂)=(1).\nThe result is that at leading order we have,\n\n    [0] [a-2] ([ν]×(1))=χ(ν)·[a]×((2,0)(1)-(0,2)(1)^†)=[a]×(2,-2).\n\nHere, by convention, we take χ(ν)1. Since we have taken cw→ν,\nwe can think of the number of parts of w to be `-1', explaining the sign\nin front of the ℝ𝔹-element (0,2). This is consistent with\njust computing [0] [a-2] [0]. Further, the first two actions in Lemma <ref>\ndon't make sense when cw→ν, though if w→ν, the special action [a-1] [0] (·)\napplies with the appropriate adaptations. And of course we can compute\n[a-1] [c-1] ([ν]×(1))=[a-1] [c-1] [0].\n\nFinally, we now also observe the following (aforementioned) nilpotency property.\n\n\n  At leading order, if we first apply the action [0] [ b] (·) to an arbitrary ℝ𝔹 component,\n  then apply the action [ a] [ 0] (·) to the result, this generates the zero ℝ𝔹 component.\n  In other words at leading order we have,\n  \n    [ a] [ 0] ([0] [ b] (·))=0,\n\n  where the `0' on the right-hand side represents the zero ℝ𝔹 component.\n\n\n\n  We focus on the effect of the actions on the ℝ𝔹 components only.\n  The third (special) action applied to the input (a,b) generates 2·(a,b,± b^†,± a^†).\n  Set A,B∈ℝ𝔹 to be the sub-components A(a,b) and B±(b^†,a^†).\n  With these identifications we note that\n  B=± A^†. Ignoring the real factor 2, apply the second (special) action to the input (A,B).\n  This is (note the sign of the second term of the action changes), (1,-1)((A,B)∓(A,B)^†),\n  which equals, (A∓ B^†,B∓ A^†,-A± B^†,-B± A^†).\n  Since B=± A^†, this result is the zero ℝ𝔹 component.\n\n\nWe now explore, through a series of examples, how to construct the generators and coefficient blocks\nassociated with any given composition. In particular we consider the cases of compositions with\n1, 2 and 3 parts, before exploring the case of any given composition. Compositions\ncontaining a `1' need to be singled out, as explained below.\n\n[One-part compositions]\n  We observe that there are two basis elements corresponding to the one-part composition w=a, namely,\n  [a]×(1,0) and [a]×(0,1). We assume n=a⩾2. At leading we know from the corresponding\n  signature expansion [ a]=[a]×(1,0)+⋯. From our discussion succeeding Lemma <ref>,\n  we know the first two actions do not make sense when cw→ν, while the final special action\n  does make sense. As we saw directly, at leading order we have [0] [a-2] [0]=[a]×(2,-2).\n  We have thus enumerated the generators corresponding to [a]×(1,0) and [a]×(0,1) and that\n  the signature coefficient matrix is,\n  \n    A_0=[  1  2;  0 -2 ].\n\n\n\n[Two-part compositions]\n  Consider the basis elements with a two-part composition component a_1a_2, i.e. basis\n  elements of the form [a_1a_2]×β_i, where the β_i are the\n  four basis elements of length 4, which are zero apart from a `1' in the ith position.\n  For the moment assume neither a_1 nor a_2 equal 1; we consider each of these two special\n  cases separately below. Using Lemma <ref>, noting that for\n  each of the standard actions our goal is to obtain the composition component [a_1a_2]\n  on the right-hand side, we observe the following. For the first action, setting w=ν,\n  a=a_1 and c=a_2, we find that at leading order, we get,\n  \n  \n  \n  \n    [a_1-1] [a_2-1] [0]=[a_1a_2]×((1,1)((1,0)-(0,1)))=[a_1a_2]×(1,-1,1,-1).\n\n  The first special action in Lemma <ref>, with the same identifications gives, \n  \n    [a_1-1] [0] ([a_2-1]×(â,b̂))=[a_1a_2]×((1,-1)((â,b̂)+(b̂,â))).\n\n  We saw in Example <ref>, the basis element [a_2-1]×(â,b̂)\n  can be generated both by the corresponding signature expansion [a_2-1]=[a_2-1]×(1,0)+⋯,\n  and by the generator [0] [a-2] [0]. We discount the latter case due to the nilpotent action property.\n  Hence using this expression for [a_2-1] and inserting (â,b̂)=(0,1) into the expression above, we deduce, \n  \n    [a_1-1] [0] ([a_2-1])=[a_1a_2]×(1,1,-1,-1),\n\n  to leading order. Now consider the second special action in Lemma <ref>.\n  Again with the same identifications for a, c and w, we observe that to leading order,\n  \n    [0] [a_1-2] ([a_2]×(â,b̂))=[a_1a_2]×((2,0)(â,b̂)+(0,2)(b̂,â)).\n\n  We know from  Example <ref>, the basis element [a_2]×(â,b̂)\n  can be generated either by the signature expansion [a_2]=[a_2]×(1,0)+⋯,\n  or by the generator [0] [a_2-2] [0]=[a_2]×(2,-2)+⋯. Respectively substituting the expressions\n  [a_2]×(1,0) and [a_2]×(2,-2) for [a_2]×(â,b̂) in the relation just above, we observe that to leading order,\n  \n    [0] [a_1-2] ([a_2])   =[a_1a_2]×((2,0)(1,0)+(0,2)(0,1))\n       =[a_1a_2]×(2,0,0,2),\n    \n        [0] [a_1-2] ([0] [a_2-2] [0])   =[a_1a_2]×((2,0)(2,-2)+(0,2)(-2,2))\n       =[a_1a_2]×(4,-4,-4,4).\n\n  We have thus enumerated the four generators corresponding to the four basis elements [a_1a_2]×(1,0,0,0),\n  [a_1a_2]×(0,1,0,0), [a_1a_2]×(0,0,1,0) and [a_1a_2]×(0,0,0,1). They are\n  [a_1-1] [a_2-1] [0], [a_1-1] [0] [a_2-1], [0] [a_1-2] [a_2]\n  and the quintic generator [0] [a_1-2] [0] [a_2-2] [0]. The corresponding signature coefficient matrix is,\n    \n    A_2[  1  1  2  4; -1  1  0 -4;  1 -1  0 -4; -1 -1  2  4 ]\n\n  which is the subsystem coefficient matrix A_2 in Examples <ref> and <ref>\n  respectively concerning the quartic and quintic non-commutative nonlinear Schrödinger equations.\n\n  Let us now consider the case when a_2=1. If we substitute this value for a_2 into the generators above,\n  we see that the first two generators coincide and are given by [a_1-1] [0] [0]=[a_11]×(1,-1,1,-1)+⋯\n  and [a_1-1] [0] [0]=[a_11]×(1,1,-1,-1)+⋯. Since we can add them together under \n  the same coefficient c_(a_1-1)00, in this case we have the single generator,\n  [a_1-1] [0] [0]=[a_11]×(2,0,0,-2)+⋯.\n  The third generator above becomes, [0] [a_1-2] [1]=[a_11]×(2,0,0,2)+⋯.\n  The final quintic generator cannot be a generator in this case if we insist on only including signature expansions  \n  corresponding to non-negative integers. There are thus only two independent generators. Hence this this case,\n  the corresponding signature coefficient matrix, ignoring the middle two rows, is\n  \n    A_1[  2  2; -2  2 ].\n\n  See Examples <ref> and <ref> and the equations\n  for the coefficients c_(n-2)00 and c_0(n-3)1 in those cases for when w=(n-1)1, as\n  well as with the coefficients in Tables <ref>–<ref>. \n  Note, when a_1=a_2=1, there is only one generator, [0]^3, as we saw in Example <ref>.\n  We treat the more general case when a_1=1 at the end of this step..\n\n\n[Three-part compositions]\n  Consider basis elements with a three-part composition component a_1a_2a_3, i.e. basis  \n  elements of the form [a_1a_2a_3]×β_i, where the β_i for i=1,…,8,\n  contain `1' in the ith position and zeros in the remaining seven positions.  \n  For the moment assume neither a_1 nor a_2 nor a_3 are unity.\n  Using Lemma <ref>, the standard actions, setting a=a_1, c=a_2 and w=a_3 give to leading order,\n  \n    [a_1-1] [a_2-1] ([a_3]×(û,0))   =[a_1a_2a_3]×((1,1)(û,û^†)),\n     \n      [a_1-1] [0] ([(a_2-1)a_3]×(â,b̂))   =χ((a_2-1)a_3)·[a_1a_2a_3]\n                     ×((1,-1)((â,b̂)\n      -(â,b̂)^†)),\n    \n      [0] [a_1-2] ([a_2a_3]×(â,b̂))   =χ(a_2a_3)·[a_1a_2a_3]×(2â,2b̂,-2b̂^†,-2â^†).\n\n  We observe, with these three relations, the task of finding the generators for any basis element\n  with a three-part composition component, becomes the task of finding the generators for the basis element with the one-part\n  composition component `[a_3]' in the first case, and then the generators for basis elements with the two-part  \n  components `[(a_2-1)a_3]' and `[a_2a_3]' in the second and third cases. We can construct the\n  generators in these cases via Examples <ref> and <ref> just above.\n  In the first case, from Example <ref>, the two generators for [a_3]×(1,0) and [a_3]×(0,1)\n  are [ a_3]=[a_3]×(1,0)+⋯ and [0] [a_3-2] [0]=[a_3]×(2,-2)+⋯.\n  Hence if we substitute these expressions into the first case above, respectively setting û=(1,0) \n  and then û=(2,-2), we find,\n  \n    [a_1-1] [a_2-1] ([a_3])   =[a_1a_2a_3]×((1,1)(1,0,0,1))\n       =[a_1a_2a_3]×(1,0,0,1,1,0,0,1),\n    \n        [a_1-1] [a_2-1] ([0] [a_3-2] [0])   =[a_1a_2a_3]×((1,1)(2,-2,-2,2))\n       =[a_1a_2a_3]×(2,-2,-2,2,2,-2,-2,2).\n\n  For the second case above with composition component `[(a_2-1)a_3]', we know from Example <ref>,\n  there are four possible generators. However once we observe the nilpotent action property, we are\n  left with two, namely, [a_2-2] [a_3-1] [0]=[(a_2-1)a_3]×(1,-1,1,-1)+⋯ and\n  [a_2-2] [0] [a_3-1]=[(a_2-1)a_3]×(1,1,-1,-1)+⋯. Substituting these expressions\n  into the second case above, respectively setting (â,b̂)=(1,-1,1,-1) and then (â,b̂)=(1,1,-1,-1), we find,\n  \n    [a_1-1]    [0] ([a_2-2] [a_3-1] [0])\n       =χ((a_2-1)a_3)·[a_1a_2a_3]×((1,-1)((1,-1,1,-1)-(1,-1,1,-1)^†))\n       =χ((a_2-1)a_3)·[a_1a_2a_3]×(2,-2,2,-2,-2,2,-2,2),\n     \n        [a_1-1]    [0] ([a_2-2] [0] [a_3-1])\n       =χ((a_2-1)a_3)·[a_1a_2a_3]×((1,-1)((1,1,-1,-1)-(1,1,-1,-1)^†))\n       =χ((a_2-1)a_3)·[a_1a_2a_3]×(2,2,-2,-2,-2,-2,2,2).\n\n  For the third case above with composition component `[a_2a_3]', again, we know from Example <ref>,\n  there are four possible generators. These are all four of the generators shown in Example <ref>\n  once we replace a_1 and a_2 therein respectively by a_2 and a_3. If we substitute the corresponding\n  four expressions with the replacements mentioned into the third case above, respectively setting  \n  (â,b̂)=(1,-1,1,-1), (â,b̂)=(1,1,-1,-1), (â,b̂)=(2,0,0,2) and then (â,b̂)=(4,-4,-4,4),\n  we find at leading order,\n  \n    [0] [a_1-2] ([a_2-1] [a_3-1] [0])\n           =χ(a_2a_3)·[a_1a_2a_3]×(2,-2,2,-2,2,-2,2,-2),\n    \n        [0] [a_1-2] ([a_2-1] [0] [a_3-1])\n           =χ(a_2a_3)·[a_1a_2a_3]×(2,2,-2,-2,2,2,-2,-2),\n    \n        [0] [a_1-2] ([0] [a_2-2] [a_3])\n           =χ(a_2a_3)·[a_1a_2a_3]×(4,0,0,4,-4,0,0,-4),\n\n  and finally,\n  \n    [0] [a_1-2] ([0] [a_2-2] [0] [a_3-2] [0])\n        =χ(a_2a_3)·[a_1a_2a_3]×(8,-8,-8,8,-8,8,8,-8).\n\n  Hence, for the eight basis elements [a_1a_2a_3]×β_i, i=1,…,8,\n  with the columns corresponding to the generators above in descent order following by degree, \n  the corresponding signature coefficient matrix, is the full rank matrix,\n  \n    A_3[  1  2  2  2  2  2  4  8;  0 -2 -2  2 -2  2  0 -8;  0 -2  2 -2  2 -2  0 -8;  1  2 -2 -2 -2 -2  4  8;  1  2 -2 -2  2  2 -4 -8;  0 -2  2 -2 -2  2  0  8;  0 -2 -2  2  2 -2  0  8;  1  2  2  2 -2 -2 -4 -8 ],\n\n  where columns 3 and 4 should involve the factor χ((a_2-1)a_3), while\n  columns 5 through to 8 should involve the factor χ(a_2a_3). The factors\n  are omitted in A_3 for clarity.\n  \n\n\nExamples <ref>–<ref> precisely reflect the analysis we outlined in Step 3.\n\n\nWe can now discern the pattern. Suppose we wish to construct all the generators corresponding to a full set of 2^k\nbasis elements associated with a given composition component [a_1a_2⋯ a_k]. We preclude \nfor the moment, that any of a_1 through to a_k are equal to `1'. Using the standard actions\nin Lemma <ref>, we find,\n\n    [a_1-1] [a_2-1] ([a_3⋯ a_k]×(û,0))   =[a_1⋯ a_k]\n         ×((1,1)((û,0)-(-1)^k-2(0,û^†))),\n     \n      [a_1-1] [0] ([(a_2-1)a_3⋯ a_k]×(â,b̂))   =χ((a_2-1)a_3)·[a_1⋯ a_k]\n         ×((1,-1)((â,b̂)+(-1)^k-2(â,b̂)^†)),\n    \n      [0] [a_1-2] ([a_2⋯ a_k]×(â,b̂))   =χ(a_2a_3)·[a_1⋯ a_k]\n         ×((2,0)(â,b̂)+(-1)^k-2(0,2)(â,b̂)^†),\n\nto leading order. We then act iteratively to substitute for the generators corresponding to the composition:\n(i) [a_3⋯ a_k] with (k-2)-parts; (ii) [(a_2-1)a_3⋯ a_k] with (k-1)-parts, taking into account\nthe nilpotency action property; and (iii) [a_2⋯ a_k] with (k-1)-parts. We know from Step 3,\nfor a given composition a_1⋯ a_k, we can construct 2^k unique generators in this way.\nIn Step 6 we demonstrate that the corresponding signature coefficient matrix generated in this way has full rank.\nHowever, at this stage, we note that we have the following straightforward result.\n\n\n  If we use the procedure above to construct the 2^k generators associated with the 2^k basis elements\n  with a given composition component a_1⋯ a_k, then each such set of generators is unique to the given composition a_1⋯ a_k,\n  i.e. each such set of generators corresponding to a given composition a_1⋯ a_k, does not appear elsewhere\n  in generator sets for other compositions.\n\n\nLastly, apart from the case of the composition `a_11' in Example <ref>, including the case `11',\nour analysis above has precluded compositions a_1⋯ a_k containing `1' in the composition sequence.\nWe saw at the end of Example <ref>, that provided a_1≠1 then the set of generators\nfor the basis elements with composition components a_11 reduces to two generators only, however, both generators\nonly generate the basis elements [a_11]×(1,0,0,0) and [a_11]×(0,0,0,1).\nConsider the case of the composition a_1a_21, with both a_1≠1 and a_2≠1.\nUsing arguments analogous to those for the case `a_11' at the end of Example <ref>,\nif we examine the eight generators listed in Example <ref>,\nwe observe that the second and last cannot be generators in the case when a_3=1,\nwhile the third and fourth generators combine, and the fifth and sixth generators combine,\nin much the same way as for the case of `a_11' in Example <ref>.\nThe latter two correspond to adding the third and fourth, and also the fifth and sixth, columns\nin the 8×8-matrix A_3 above. Thus for the case of the composition a_1a_21, the resulting coefficient matrix, ignoring the\nsecond, third, sixth and seventh rows which are zero, corresponds to the coefficient matrix A_3^'\nin Example <ref>. With these last two examples in hand, we deduce that for any composition\nof the form a_1a_2⋯ a_k-11, where we preclude any of a_1 through to a_k-1 to be `1',\nwe have a unique set of generators in the sense of Lemma <ref>, albeit with\na signature coefficient matrix of size 2^k-1×2^k-1. Now consider the case when the\ncomposition component is [1a_2⋯ a_k], assume for the moment none of a_2 throught to a_k equal `1'.\nLooking at the standard actions in Lemma <ref>, we observe that for basis elements with\nsuch a composition component, the two valid actions are,\n\n    [0] [a_2-1] ([a_3⋯ a_k]×(û,0))   =χ(a_3⋯ a_k)·[a_1⋯ a_k]×(⋆,⋆),\n    \n      [0] [0] ([(a_2-1)a_3⋯ a_k]×(â,b̂))   =χ((a_2-1)a_3⋯ a_k)·[a_1⋯ a_k]×(⋆,⋆),\n\nwhere the two expressions (⋆,⋆) are proxies for the appropriate ℝ𝔹-components whose exact form is\nnot important at this stage. However, we now observe that if we apply the final action in Lemma <ref> respectively\nfor the cases of the compositions [(a_2+1)a_3⋯ a_k] and [2(a_2-1)a_3⋯ a_k], we find,\n\n    [0] [a_2-1] ([a_3⋯ a_k]×(û,0))   =χ(a_3⋯ a_k)·[(a_2+1)⋯ a_k]×(⋆,⋆),\n    \n      [0] [0] ([(a_2-1)a_3⋯ a_k]×(â,b̂))   =χ((a_2-1)a_3⋯ a_k)·[2(a_2-1)a_3⋯ a_k]×(⋆,⋆).\n\nWe observe that the first two respective factors of the generators and their arguments match the two cases corresponding to\nthe composition [1a_2⋯ a_k]. However the latter two cases generate basis elements with the respective composition components\n[(a_2+1)a_3⋯ a_k] and [2(a_2-1)a_3⋯ a_k], both of which occur before the composition [1a_2⋯ a_k] in descent order.\nThus these generators will not be new. A similar scenario could occur if one or more letters a_2 through to a_k are equal to 1.\nIn our main proof below in Step 8, we are able to discount any compositions a_1⋯ a_k in which any one of the letters a_1 through to a_k-1 \nis equal to `1'.\n\n\n\nStep 6: Full rank blocks.\nOur goal in this step is to show that for a given composition of length k, for which in general there are 2^k different possible \nℝ𝔹 components, there are 2^k independent generators, generated by the first action\nacting on generators at level k-2 and the second and third special actions on generators at level k-1.\nThe following results establish that this is indeed the case.\n\n\n  We have the following, at leading order:\n\n  (i) Given an independent set of input ℝ𝔹 components of length 2^k-1, \n  of the form (u,0) for the first action, or of the form (a,b) for the second and third actions,\n  each individual action produces an independent set of ℝ𝔹 components of length 2^k;\n\n  (ii) Given any arbitrary length 2^k-1 non-zero inputs, of the form (u,0) for the first action or of the form (a,b) \n  for the second and third actions, the set of three actions generate independent ℝ𝔹 components of length 2^k.  \n\n\n\n   We focus on the effect of the actions on the ℝ𝔹 components only.\n   In order, consider (i). It is sufficient to prove the result for two independent inputs as the general case\n   follows suit. Consider the first action and suppose u and û are two non-trivial independent\n   ℝ𝔹 components. Consider an arbitrary linear combination, with scalar coefficients κ_1 and κ_2,\n   of the first action applied to the input (u,0) and the first action applied to the input (û,0).\n   Set the linear combination to zero. This gives,\n   κ_1·(u,± u^†,u,± u^†)+κ_2·(û,±û^†,û,±û^†)=0,\n   where the right-hand side represents the zero ℝ𝔹 component of the appropriate length.\n   Pairing up, we observe the equation above is equivalent to κ_1· u+κ_2·û=0,\n   with the other pairings generating the same equation. Since by assumption u and û are two independent\n   ℝ𝔹 components, the result follows. Now consider the second action.\n   Suppose (a,b) and (â,b̂) are two non-trivial independent ℝ𝔹 components.\n   As above, we construct the arbitrary linear combination,\n   κ_1·(a± b^†,b± a^†,-a∓ b^†,-b∓ a^†)\n   +κ_2·(â±b̂^†,b̂±â^†,-â∓b̂^†,-b̂∓â^†)=0,\n   for arbitrary scalar coefficients κ_1 and κ_2. We assume a≠± b^† and\n   â≠±b̂^†—we observe from our proof of Lemma<ref> that the\n   second action is trivial if and only if a=± b^†.\n   Since in the last equation the final two components generate the same equation as the first two, the last equation is equivalent to,\n   κ_1·(a± b^†,b± a^†)+κ_2·(â± b^†,b̂± a^†)=0.\n   This reduces to κ_1·(a,b)+κ_2·(â,b̂)=0.\n   Hence by our assumption on (a,b) and (â,b̂), the result follows.\n   We now consider the third action. \n   Suppose (a,b) and (â,b̂) are two non-trivial independent ℝ𝔹 components,\n   As above, we construct the linear combination,\n   κ_1·(a,b,± b^†,± a^†)+κ_2·(â,b̂,±b̂^†,±â^†)=0,\n   for arbitrary scalar coefficients κ_1 and κ_2. This last equation is equivalent to\n   κ_1·(a,b)+κ_2·(â,b̂)=0—the final two components\n   generate the same equation as the first two. By our independence assumption on (a,b) and (â,b̂),\n   the result follows.\n\n   We now consider (ii). For arbitrary (u,0) and (a,b) in ℝ𝔹,\n   consider the following linear combination of the three actions, set equal to the zero ℝ𝔹 component, namely:\n   κ_1·(u,u^†,u,u^†)+κ_2·(a-b^†,b-a^†,b^†-a,a^†-b)+κ_3·(a,b,-b^†,-a^†)=0,\n   where κ_1, κ_2 and κ_3 are arbitrary scalar coefficients.\n   Note we assume u and (a,b) are non-trivial.\n   If κ_1≠0 and κ_2=κ_3=0 then we observe that necessarily u\n   must be the zero ℝ𝔹 component, which contradicts our assumptions.\n   Similarly if κ_3≠0 and κ_1=κ_2=0 then necessarily (a,b) is\n   the zero ℝ𝔹 component, which again contradicts our assumptions.\n   If κ_1≠0, κ_2≠0 and κ_3=0, the first and second components above\n   reveal that necessarily κ_1· u+κ_2·(a-b^†)=0 and κ_1· u^†+κ_2·(b-a^†)=0.\n   Taking the adjoint of the second equation and adding the result to the first equation, implies u=0.\n   The third and fourth components generate the same information. Thus we have a contradiction.\n   Analogously, in the cases κ_1≠0, κ_3≠0 and κ_2=0, as well as\n   κ_2≠0, κ_3≠0 and κ_1=0, it is straightforward to show that\n   a necessary consequence is that (a,b) is the zero ℝ𝔹 component,\n   and we have a contradiction. Now consider the case when all of κ_1, κ_2, κ_3\n   are non-zero. Pairing up the first component from the linear combination above with the\n   adjoint of the fourth component reveals that necessarily a is the zero ℝ𝔹 component.\n   Pairing the second component and the adjoint of the third component reveals that necessarily b \n   is the zero ℝ𝔹 component. We thus reach another contradiction.\n   The final case we have not considered is the case κ_1=κ_3=0 and κ_2≠0. In this case we necessarily\n   deduce a=b^†. As we have seen above, this is precisely the condition we need to rule\n   out for the input when we apply the second action. The proof is complete.  \n\nPutting the results of this and the previous steps together, we observe the following.\n\n\nSuppose we are given a composition a_1⋯ a_k∈𝒞 of k-parts.\nAssume that all of a_1 through to a_k-1 are not equal to `1'. \nThen associated with the 2^k set of basis elements with composition component a_1⋯ a_k,\nare a unique set of 2^k generators, and the signature coefficient matrix has full rank.\nIf a_k=1, the statement still holds but instead with 2^k-1 basis elements and 2^k-1 generators.\n\n\n\n\n\n\nStep 7: Composition and generator counts.\nIn light of Proposition <ref>, we are interested in the following counts.\nGiven n∈ℕ, what are the total numbers of: (i) Generators; (ii) Basis elements\nwith composition components avoiding `1', i.e. compositions a_1⋯ a_k for which\nnone of the letters a_1 through to a_k are `1';\n(iii) Basis elements with compositions ending in `1' with rest of the composition avoiding `1',\ni.e. compositions of the form a_1⋯ a_k-11 for which a_1⋯ a_k-1 avoids `1'. \nSuch information will help us keep track of size of the linear system of equations for the unknown coeffcients {c_⋆} we solve\nas part of the proof of Theorem <ref> below in Step 8.\n\nLet us begin with the total number of generators, i.e. item (i). Note that all monomial generators\nare of odd-degree. For a given n∈ℕ, there is one generator of degree 1, namely [n].\nWe then need to enumerate all the possible degree 3 generators. Each Pöppe product corresponds to\nincreasing the order of the compositions they generate by 1, and there are two Pöppe products in any\ndegree 3 generator. Hence all the degree 3 generators consist of all the possible compositions\nof (n-2) with 1, 2 and 3 parts and all the possible ways to assort them into three factors\nwhich can include “packing factors” of 0. So for example, the only 1-part compositions of (n-2)\nassorted in this way are [n-2] [0] [0], [0] [n-2] [0] and [0] [0] [n-2].\nThe first set of generators of this form associated with the 2-part compositions of (n-2) are\n[n-3] [1] [0], [n-3] [0] [1] and [0] [n-3] [1], and so forth.\nThese are just the weak compositions of (n-2) into three parts.\nThe next set of generators are those of degree 5, and all the generators of this degree would\nconsist of the weak compositions of (n-4) with 5 parts, and so forth.\nThe number of weak compositions of m into k parts is m+k-1 choose k-1.\nWe can also think of this as the number of ways of distributing m balls into k slots, allowing empty slots.\nFrom our discussion above, when n is odd, we see that we are interested in, for k=1,3,5,…,n,\nthe number of ways of distributing m=n-k+1 balls into k slots, or in other words,\n\n    ∑_k=1(k odd)^n[   n; k-1 ]=∑_ℓ=0^1/2(n-1)[  n; 2ℓ ]=2^n-1,\n\nwhere we use the substitution k=2ℓ+1 for the second sum. That the sum total on the right equals 2^n-1 follows, with some care,\nfrom the corresponding result in Lemma <ref>. Similarly, when n is even,\nwe are interested in, for k=1,3,5,…,n+1, the number of ways of distributing m=n-k+1 balls into k slots, or in other words,\n\n    1+∑_k=1(k odd)^n-1[   n; k-1 ]=1+∑_ℓ=0^1/2(n-2)[  n; 2ℓ ]=2^n-1.\n\nAgain we used the substitution k=2ℓ+1 for the second sum. Note that the initial `1' in the sum corresponds to the\ncase k=n+1, i.e. corresponding to the monomial generator [0]^n+1. That the sum total is 2^n-1 again follows\nfrom the first result in Lemma <ref>. We have thus established the following.\n\n\nGiven n∈ℕ, the total number of monomial generators is equal to 2^n-1.\n\n\n\nThe number of compositions of n with k-parts is n-1 choose k-1, and accumulating\nthese coefficients from k=1 to k=n, the total number of compositions of n is 2^n-1.\nOf course associated with each composition, there are one or more basis elements.\nFor example for a composition a_1⋯ a_k with k-parts which avoids 1, there are 2^k associated basis elements.\nThe number of compositions of n into k parts avoiding 1 is given by,\n\n    [ n-k-1;   k-1 ].\n\nTo see this we observe the following—see Axenovich and Ueckerdt <cit.> or Beck and Robbins <cit.>.\nThere is a bijection between: (a) the arrangements of n balls into k slots with each slot containing two or more balls;\nand (b) the arrangements of n-k balls into k slots with no empty slots. For the map from (a) to (b),\nwe simply remove one ball from each slot. For the map from (b) to (a) we just add one ball to each slot.\nThe count for (b) is n-k-1 choose k-1, giving the result above. Thus, given that for a given composition with k parts that\navoids `1' there are 2^k corresponding basis elements, the total number of basis elements\nwith composition components that avoid `1' is given, with λ=2, respectively when n is odd and then when n is even, by,\n\n    p(n;λ)∑_k=1^(n-1)/2[ n-k-1;   k-1 ]λ^k\n            and    \n      p(n;λ)∑_k=1^n/2[ n-k-1;   k-1 ]λ^k.\n\nBy direct enumeration, as well as from Examples <ref>–<ref>,\nwe know p(2;2)=p(3;2)=2, p(4;2)=6 and p(5;2)=10. \nIn fact, in general, we have the following result.\n\n\n  Given an integer n⩾2 and a real number λ>0,\n  the weighted sum p=p(n;λ) of the total number of basis elements\n  with composition components which avoid `1' satisfies the weighted Fibonacci sequence satisfying,\n  \n    p(n;λ)=p(n-1;λ)+λ p(n-2;λ).\n\n  In particular, when λ=2, p(2;2)=p(3;2)=2 and p(n;2)=2/3(2^n-1+(-1)^n).\n\n\n\n  By direct computation, for n odd, we observe, p(n-1;λ)+λ p(n-2;λ) equals,\n  \n    ∑_k=1^(n-1)/2   [ n-k-2;   k-1 ]λ^k+∑_k=1^(n-3)/2[ n-k-3;   k-1 ]λ^k+1\n       =[ n-3;   0 ]λ+∑_k=2^(n-1)/2([ n-k-2;   k-1 ]\n             +[ n-k-2;   k-2 ])λ^k,\n\n  which equals p(n;λ) once we combine the two terms in the coefficient of λ^k shown and observe that\n  the coefficient of the λ term is one. Note that in the\n  first step we made the change of variables ℓ=k+1 in the second sum, before relabelling ℓ as k.\n  When n is even, we similarly observe that p(n-1;λ)+λ p(n-2;λ) equals,\n  \n    ∑_k=1^(n-2)/2   [ n-k-2;   k-1 ]λ^k+∑_k=1^(n-2)/2[ n-k-3;   k-1 ]λ^k+1\n       =[ n-3;   0 ]λ+∑_k=2^(n-2)/2([ n-k-2;   k-1 ]\n             +[ n-k-2;   k-2 ])λ^k+[ n/2-2; n/2-2 ]λ^n/2,\n\n  which equals p(n;λ) once we combine the terms in the coefficient of λ^k, and\n  observe that the coefficients of the λ and λ^n/2 terms are one.\n  We also used the same change of variables in the first step. \n  The final statement specific to λ=2, follows directly by solving the difference\n  equation for p=p(n;2) for the initial conditions indicated.\n\n\nThe result of Lemma <ref> provides an answer to item (ii), stated at the beginning of this step.\nItem (iii) is now straightforward. The total number of compositions with k-parts of the form a_1⋯ a_k-11\nfor which a_1⋯ a_k-1 avoids `1' is simply n-k-1 choose k-2.\nThis is because here we require n-1 balls to fit into k-1 slots with each slot containing two or more balls.\nHence the total number of basis elements associated with composition components which end in `1', but avoid `1' elsewhere,\nwhen n is odd so n-1 is even, is given by,\n\n    ∑_k=2^(n+1)/2[ n-k-1;   k-2 ]λ^k-1=∑_k=1^(n-1)/2[ n-k-2;   k-1 ]λ^k,\n\nwhich equals p(n-1;λ). When n is even and thus n-1 is odd, the same count is,\n\n    ∑_k=2^n/2[ n-k-1;   k-2 ]λ^k-1=∑_k=1^(n-2)/2[ n-k-2;   k-1 ]λ^k,\n\nwhich equals p(n-1;λ). Finally we observe the following.\n\n\n  The total number of basis elements with composition components which avoid `1', or end in `1' and avoid `1' elsewhere,\n  equals 2^n-1.\n\n\n\n  The count in question is p(n;2)+p(n-1;2). Using the explicit soluton for p(n;2) given in Lemma <ref>,\n  the result follows.\n\n\nCombining the results of Lemmas <ref> and <ref>, we deduce the\nrather remarkable fact:\n\n  For any given n∈ℕ, the total number of basis elements whose composition component avoids `1', or ends in `1' but avoids `1' elsewhere,\n  exactly equals the total number of generators.\n\nNaturally this result is important in our proof of Theorem <ref> just below. We remark that the inclusion of\nbasis elements whose composition components end in `1' but avoid `1' elsewhere, rather than composition components\ncontaining `1' at some other position with avoidance elsewhere, is merely a consequence of the ordering we have imposed,\nnamely the descent order. \n\n\n\nStep 8: Proof of Theorem <ref>.\nIn this last step we provide the overall proof of our main theorem. We combine together the knowledge\nwe gained in Steps 1–7. This final stage of the argument, though significantly adapted, is analogous to that outlined for\nthe non-commutative potential Korteweg–de Vries hierarchy in Malham <cit.>.\n\n\n  To complete the proof, we essentially construct a table of signature coefficients for the arbitrary order n case,\n  much like Tables  <ref>–<ref> for the n=4 and n=5 cases.\n  Indeed we refer to these example tables to demonstrate examples of the general procedure.\n  We already know from Steps 1-7 that we can construct a linear algebraic equations of the form AC=B,\n  where the vector C of length 2^n-1 lists the unknown coefficients of the generator monomials\n  in the Pöppe polynomial π_n=π_n([0],[1],…,[ n]). The vector B, whose length exceeds 2^n-1,\n  is a vector of zeros apart from a single non-zero value `1' in the first position when n is odd and\n  in the second position when n is even. This is due to the ordering we impose which we outline briefly now,\n  and in some more detail just below. \n  The coefficients of C, are ordered according to the descent order and blocks as outlined in Steps 3 and 5.\n  The signature coefficient matrix A has a lower triangular block form.\n  It has 2^n-1 columns and its total number of rows exceeds 2^n-1, though equals the length of B.\n  The columns of A are parametrised by the blocks of monomial generators mentioned, or equivalently the order of the coeffcients in C.\n  The rows of A are parametrised by the basis elements, characterised by the composition components of the basis elements listed in descent order,\n  and within individual composition w, the basis elements are listed according to the binary order of the ℝ𝔹-components.\n  The number of such ℝ𝔹-components is 2^|w|-υ(w), where υ(w) counts the number of 1's in the\n  composition w.\n\n  Let us outline the forms of C and A in some more detail. We can be brief as much of the procedure has already been outlined in Steps 1–7. \n  Corresponding to the pair of basis elements with a one-part composition component, namely [n]×(1,0) and [n]×(0,1),\n  the first pair of coefficients in C are c_n and c_0(n-2)0, corresponding to the generators [ n] and [0] [n-2] [0].\n  The corresponding 2×2 top-left block in A is the matrix A_0. All the remaining entries in the first two rows of A to the right\n  of this block are zero. We move onto basis elements whose composition components have k=2 parts. In descent order the first set of\n  basis elements consists of [(n-1)1]×(1,0,0,0) and [(n-1)1]×(0,0,0,1). We know from Example <ref> in Step 5,\n  these are the only two relevant basis elements for corresponding to compositions ending in `1'. The corresponding coefficients in C\n  are c_(n-2)00 and c_0(n-3)1 associated with the generators [n-2] [0] [0] and [0] [n-3] [1].\n  The corresponding coefficient matrix is the block A_1 taking up rows and columns 3 and 4 in A, with the remaining entries\n  in rows 3 and 4 to the right of this block being zero. This first set of blocks is important once we start addressing the issue\n  of the uniqueness of the solution C to the linear system, or equivalently the consistency of the overall linear system.\n  Next we consider the blocks of basis elements parametrised by two-part composition components of the form a_1a_2\n  in descent order, with neither a_1 nor a_2 equal to zero. Associated with any such composition, there are four\n  basis elements [a_1a_2]×β_i, i=1,2,3,4, and the corresponding coefficients in C\n  are c_(a_1-1)(a_2-1)0, c_(a_1-1)0(a_2-1), c_0(a_1-2)a_2 and c_0(a_1-2)0(a_2-2)0,\n  corresponding to the monomial generators outlined in Example <ref>.\n  For each block of four basis elements with such a composition component, the corresponding signature coefficient matrix is A_2.\n  As we run through the compositions a_1a_2 which avoid `1' in descent order,\n  the coefficient matrix A_2 occupies rows and columns 4(n-a_1-1)+i for i=1,2,3,4 in the signature coefficient matrix A.\n  All the entries in A in the these rows to the right of these blocks are zero.\n  We know from Step 5, that the basis elements with the two-part composition component 1(n-1) does not occupy any new\n  columns in A, but instead, the two rows corresponding to the two basis elements concerned only contain\n  non-zero entries in the columns parametrised by 4(n-a_1-1)+i for i=1,2,3,4 for a_1≠1.\n\n  We move onto blocks of basis elements corresponding to composition components with k=3 parts. We know from\n  our arguments in Step 5 that we can focus on composition components of the form a_1a_2a_3 which avoid `1'\n  or end in `1' and avoid `1' elsewhere. Basis elements with composition components lying in the complement of\n  this set do not generate “new” columns, or equivalently, the non-zero entries in the rows in A corresponding\n  to these basis elements only occupy columns we have already encountered/parametrised. Let us examine the\n  blocks we generate as we run through the compositions a_1a_2a_3 which avoid `1' or end in `1' and avoid `1' elsewhere.\n  We know from Step 5, that for each of the former compositions we generate the block matrix A_3,\n  modified to include the column factors mentioned in Step 5, associated with the 8 corresponding basis elements\n  and the 8 “new” monomial generator columns. For each of the latter compositions we generate a block matrix A_3^' \n  associated with the 4 corresponding basis elements and the 4 “new” monomial generator columns. The block matrices\n  A_3 and A_3^' are diagonal blocks in A, with all entries in the corresponding rows they occupy to the right\n  of these blocks equal to zero.\n\n  We know from our analysis in Step 5 and in particular Lemma <ref> and the discussion immediately following this\n  lemma, that we have the following. For every composition w of n that avoids `1', or ends in `1' but avoids `1' elsewhere, we can construct\n  a 2^|w|×2^|w| block matrix A_w in the former case, or a 2^|w|-1×2^|w|-1 block matrix A_w^' in the latter case,\n  which occupies a distinct diagonal block in A. Here by “distinct”, we mean that its rows and columns do not coincide with the rows\n  and columns of any of the analogous block matrices corresponding to basis elements with such composition components. All the entries\n  in A in the rows occupied by these blocks and to the right of them, are zero. Thus for general n, the signature coefficient matrix A\n  is indeed a lower block triangular matrix. Further, from our results in Step 6, we know that each of the block matrices A_w and A_w^'\n  has full rank. Even further, from our results in Step 7, we know that the total number of basis elements corresponding to such\n  composition components and generating the rows of such diagonal blocks, exactly equals the total number of monomial generators\n  generating the columns of such diagonal blocks. This means that if we ignore the basis elements with composition components\n  in the complementary set for the moment, then we can proceed block by block, starting with A_0, and solve for the corresponding\n  set of Pöppe polynomial coefficients in C, until we precisely exhaust the blocks and uniquely recover C.\n\n  \n\n  The rest of the proof is now concerned with demonstrating the consistency of the remaining rows/linear equations for the coefficients\n  in C associated with those basis elements with composition components that contain a `1', not including the instances of\n  compositions ending in `1', but avoiding it elsewhere. We heavily rely on the fact that the linear system of algebraic equations for C\n  is almost homogeneous apart from the single unit entry in the first position when n is odd and in the second position when n is even.\n  The first phase of this section of the proof focuses on the blocks associated with basis elements with 1 and 2-part composition components.\n  Assume for the moment that n is odd. In this instance the first two linear equations for the coefficients c_n and c_0(n-2)0\n  are c_n+2· c_0(n-2)0=1 and -2· c_0(n-2)0=0. Thus when n is odd, we always have c_0(n-2)0=0. This means that all\n  the entries in the second column of the signature coefficient matrix A are not relevant to the linear system of equations\n  for C and we thus eliminate this column in A when n is odd. Implementing this, and ignoring the first row in A corresponding\n  to the basis element [0 n0], the top left corner of A has the form shown in the top part of Table <ref>.\n  Now assume that n is even. The first two linear for the coefficients c_n and c_0(n-2)0 in this instance are\n  are c_n+2· c_0(n-2)0=0 and -2· c_0(n-2)0=1. When n is even we swap over the first two rows in the \n  signature coefficient matrix A which is equivalent to swapping the order of the first two linear equations shown. \n  If we ignore the new first row of A corresponding to the nonhomogeneous equation -2· c_0(n-2)0=1,\n  then the top left corner of A has the form shown in the bottom part of Table <ref>. \n  All the remaining rows and columns in the signature coefficient matrix A, whether n is odd or even, remain\n  the same. However, with the first rows ignored, the system of linear equations that remains is homogeneous.\n  And, of course, the top left corners in the case that n is odd or even have the forms shown in Table <ref>. \n  In both cases in Table <ref> we trace a diagonal starting from the top left non-zero  \n  coefficient, which is χ((n-1)1)=n when n is odd, and χ(n)=1 when n is even.\n  When n is even the next two entries along this diagonal are χ(2·(0(n-2)0))=2 and \n  χ(-2·((n-2)00))=-2. When n is odd the next diagonal entry is χ(-2·((n-2)00))=-2.\n  Thereafter the diagonal entries for the cases of n being even or odd are the same.\n  In Table <ref>, when n is even, after swapping the first two rows, though not ignoring the new first row yet,\n  we can view the diagonal we have identified as the diagonal just below the leading diagonal. Similarly in Tables <ref>\n  and <ref>, when n is odd, after eliminating the second column but still retaining the first row, we can again view\n  the diagonal we have identified as that just below the leading diagonal in those Tables.\n  In either Table <ref> or in Tables <ref> and <ref>, let us call the diagonal just\n  below the leading diagonal the `sub-diagonal'. Consider for example Tables <ref> and <ref>.\n  If we follow the sub-diagonal with the view of retaining non-zero terms along it, we observe we meet a obstruction\n  in the first 4×4 block with matrix A_2 characterised by the composition component 32. The problem is\n  that while the sub-diagonal of A_2 has non-zero entries, the next term along the diagonal that lies in the last column\n  of that A_2 block, but beneath the entire block, and in fact the row corresponding to the basis element [23]×(1,0,0,0)\n  is zero. However there is a quick fix to this obstruction. That is to simply swap the two columns in the signature coefficient matrix\n  A corresponding to the final two columns of the A_2 block characterised by the composition component 23.\n  Such a swap simply corresponds to changing the order of the monomial generators.\n  We can see from Tables <ref> and <ref> that this column-swap procedure would guarantee\n  that the next entry in the sub-diagonal would be non-zero. We can then continue to consider the sub-diagonal\n  in the A_2 block corresponding to the basis elements [23]×β_i for i=1,2,3,4. However we observe\n  a similar obstruction necessitating an anologous swap of the columns of A corresponding to the final two\n  columns of this second A_4 block. This is again enacted to ensure that the term in the final column\n  immediately below this A_4 block is non-zero. The term in question corresponds to the signature coefficient\n  χ(003) in the row corresponding to [14]×(1,0,0,0). We have thus established, for all the\n  basis elements with 1 and 2-part composition components, a complete diagonal with all entries non-zero, and which can act as pivots.\n  Since all the linear equations corresponding to the rows we are considering (we are ignoring the top row) are homogeneous\n  we can use Gaussian elimination to render all the entries in the columns below the sub-diagonal to be zero.\n  \n  The procedure for the case of general n proceeds in exactly the same manner as the n=5 case we have just\n  outlined, except that now we need to establish that when we swap the columns over as just outlined, we are\n  guaranteed a non-zero entry in the corresponding sub-diagonal entry. We also need to guarantee that the\n  entry immediately below the final column of the 2×2 block A_1 corresponding to the rows [(n-1)1]×(1,0,0,0)\n  and [(n-1)1]×(0,0,0,1) is also non-zero. This case corresponds to the column given by [0] [n-3] [1].  \n  In the other cases of the A_4 blocks corresponding to the basis elements [(n-m)m]×β_i for i=1,2,3,4,\n  the column in question is the third column in the A_4 block corresponding to the column given by [0] [n-m-2] [m].\n  In particular this means we can treat the m=1 and m=2,…,n-2 cases simultaneously. Indeed, using Corollary <ref>\n  in Step 4, we observe that at leading order we have,\n  \n    [0] [n-m-2] [m]=[(n-m)m]×(2,0,0,2)+[(n-m-1)(m+1)]×(1,1,1,1)+⋯,\n\n  where we have used that at leading order [m]=[m]×(1,0)+⋯. The first term on the\n  right is the term we expect at leading order for this generator, while the second term on the right \n  is the column corresponding to the rows in the next block down—we see that (n-m-1)(m+1) is obtained\n  from (n-m)m by replacing m by m+1, which is one composition further down in descent order.\n  Thus indeed we are guaranteed that the next entry in the sub-diagonal is non-zero when we enact the column swap. \n  Further we observe that in the case of the final A_4 block corresponding to the composition 2(n-2)\n  for which m=n-2, the corresponding generator is [0] [0] [n-2] while the corresponding\n  row containing the sub-diagonal entry of interest is [1(n-1)]×(1,0,0,0). At leading order we have,\n  \n    [0] [0] [n-2]=[2(n-2)]×(2,0,0,2)+[1(n-1)]×(2,2,0,0)+⋯,\n\n  which thus guarantees a final sub-diagonal non-zero entry. We are thus in the exact same situation\n  as described for the n=5 case just above, and we can use the sub-diagonal entries as pivots\n  to render all the entries in A, in all the sub-diagonal columns, below the sub-diagonal to be zero.\n   \n  The second phase of this section of the proof now focuses on all the blocks associated with \n  basis elements with composition components with k-parts with k⩾3. This phase is\n  more straightforward. Let us focus on the 3-part composition cases to begin with.\n  The first 3-part composition in descent order is (n-2)11, and we know from Step 5 that there\n  are no “new” generators associated with with any such composition that lies in the set of\n  compositions complementary to those avoiding `1' or ending in `1', but avoiding it elsehwere.\n  Hence we can use Gaussian elimination, using the pivots from the\n  sub-diagonal outlined for the 1 and 2-part composition cases just outlined,\n  to render the entries in for the two rows/basis elements concerned here, \n  [(n-2)11]×β_1 and [(n-2)11]×β_8, equal to zero.\n  Next we consider the block of rows/basis elements corresponding to the composition (n-3)21.\n  As outlined in Step 5 this block is associated with 4 generators and the block matrix A_3^'. \n  We know this has full rank and we can thus use the leading diagonal as pivots to render\n  all entries in the corresponding columns of A below this diagonal to be zero.\n  The next block is associated with the composition (n-3)12, which with a `1' in the\n  middle is not associated with any new generators, and from our Gaussian elimination processes\n  thus far has all row entries rendered zero. The next blocks are associated with the compositions (n-4)31,\n  (n-4)22, (n-4)14. The first two of these compositions are associated with separate copies of the 8×8 matrix A_3 (with\n  the columns mentioned in Step 5 suitably scaled) and a total of 16 generators (one set of 8 each). The leading diagonals \n  of both copies of A_3 can again be used as pivots to render all the entries, below this diagonal in the columns of A associated\n  with these two copies, equal to zero. The entries in the rows associated with the third composition (n-4)13 will have been\n  rendered zero in the Gaussian elimination process just outlined for the other two compositions. And so forth, we can see\n  that we can proceed in descent order through the blocks associated with 3-part compositions, either in the case of\n  compositions that avoid `1' or end in `1' but avoid it elsewhere, using the diagonals of the blocks associated\n  with A_3 or A_3^', to render the corresponding entries in A below these diagonals to be zero, or recognising\n  for the blocks associated with the complementary set of compositions, the entries in the rows of those block will\n  already be rendered zero. The procedure for all further blocks associated with compositions of 4 or more parts\n  proceeds exactly analogously. Naturally that the corresponding diagonals with non-zero entries exist for all\n  blocks associated with compositions that avoid `1' or end in `1' but avoid it elsewhere, is guaranteed\n  by the results in Step 6, in particular Proposition <ref>.\n\n  Hence we have thus rendered all the entries in all the rows corresponding to basis elements with\n  composition components which lie in the set complementary to those that avoid `1' or end in `1' but avoid it elsewhere, \n  equal to zero. Briefly returning to the rows/blocks associated with the 1 and 2 part compositions, still\n  ignoring the top row as indicated in Table <ref>. A quick count reveals that when n is even,\n  we have 3+4(n-1) rows, i.e. homogneous linear equations, in 4+4(n-1) unknowns, while when n is odd,\n  we have 2+4(n-1) homogeneous linear equations, in 3+4(n-1) unknowns. In either case when n is even or odd,\n  proceeding through all the other blocks associated with compositions of three or more parts, the remaining\n  number of homogeneous linear equations equals the remaining number of unknowns (as outlined in the first section of this proof).\n  Hence, in either case when n is even or odd, we can solve the entire system of linear homogeneous equations,\n  with one less equation then the total number of unknowns, to find expressions for all the unknowns in terms of only one of them.\n  In the case that n is odd, we solve for all of them in terms of c_n. In the case that n is even, we solve for\n  all of them in terms of c_0(n-2)0.\n  We now re-introduce the very first row we ignored at the beginning of this second, “consistency”, section of the proof.\n  When n is odd, that first equation is c_n+2· c_0(n-2)0=1. Since we have an expression for c_0(n-2)0 in terms of c_n\n  from the homogeneous set of linear equations, we can substitute that expression into this non-homogeneous linear equation\n  and determine c_n. When n is even, the first equation is -2· c_0(n-2)0=1 or equivalently c_0(n-2)0=-1/2.\n  Since in this case we have expressions for all the other unknowns in terms of c_0(n-2)0, this fixes the values of\n  all the other unknowns. In either case, whether n is odd or even, we have established a unique solution C, and\n  the proof is complete.\n\n\n\n  As mentioned, the overall proof in Step 8 just above is analogous to that for\n  the non-commutative potential Korteweg–de Vries hierarchy in Malham <cit.>.\n  Therein we proceed by considering compositions with k=1, k=2, and so forth, parts.\n  In that case there are no blocks as there are no ℝ𝔹 components.\n  The basis elements are just compositions of n, there are no skew forms.\n  Also, as it is the potential equation, the generators are just monomials of\n  the signature expansions n, with n∈ℕ—in particular there are\n  no generators corresponding to [0]. Further, since there are no skew forms,\n  the generators can be of even or odd degree. See in particular Section 6 in Malham <cit.>.\n  We observed at the end of Step 7 above that the total number of generators equalled\n  the total number of basis elements with composition components that avoided `1' together\n  with those that ended in `1' but avoided it elsewhere. It would be natural to\n  wonder whether a similar situation occurs for the case of the non-commutative potential Korteweg–de Vries hierarchy,\n  and indeed retrospectively, we can establish the exact same result for that hierarchy.\n  In fact we can show, since there are no blocks and no generators akin to `[0]', that\n  for each set of compositions with k parts, the number of monomial generators with k factors\n  equals the number of compositions (the basis elements here) that avoid `1' together\n  with those that ended in `1' but avoided it elsewhere. Again, that we single out those\n  compositions ending in `1' is just an artefact of the descent order we impose.\n  To see this fact, we observe from Section 6 in Malham <cit.>,\n  that the number of generators with k factors, say of the form ( n_1)( n_2)⋯( n_k)\n  with the Pöppe product, is given by n-k choose k-1. This is because each Pöppe product\n  adds a `1' to one of the composition parts in the eventual expansion in compositions.\n  The complete set of such monomial generators is exhausted by those with k=1,2,…,1/2(n+1) parts.\n  We already know from Step 7 above, that the number of compositions of n with k parts that\n  avoid `1' equals n-k-1 choose k-1 for k=1,2,…,1/2(n-1), and the number of\n  compositions that end in `1' but avoid it elsewhere equals n-k-1 choose k-2 for k=2,…,1/2(n+1).\n  If we restrict ourselves to k=2,…,1/2(n-1), we observe that the number of compositions\n  satisfying either property is given by,\n  \n    [ n-k-1;   k-1 ]+[ n-k-1;   k-2 ]=[ n-k; k-1 ],\n\n  with equality following by simply adding the two relevant fractions on the left.\n  The cases k=1 and k=1/2(n+1), for which the number of such compositions and generators is singular,\n  just follows by inspection.\n\n\n\n\n\n\n\n§ CONCLUSION\n\nThere are many open directions of research we intend to pursue based on the combinatorial algebraic approach we introduced herein.\nOne direction we have not directly addressed herein is that of alternative formulations of the modified Korteweg–de Vries hierarchy members\nof orders 3, 5 and higher. See for example Liu and Athorne <cit.>, Olver and Sokolov <cit.>, Oevel and Rogers <cit.> and Gerdjikov <cit.>. \nFor example, the alternative non-commutative modified Korteweg–De Vries equation has the form,\n\n    _t g=^3g+3(g(^2g)-(^2g)g)-6g( g)g.\n\nNote that the polynomial partial differential field includes even degree terms. Such alternative forms can be obtained\nfrom non-commutative modified Korteweg–De Vries equation via a suitable gauge transformation as, for example,\noutlined in detail in Carillo and Schiebold <cit.>. The combinatorial algebraic structure we have developed\nwould seem a natural context to investigate such alternative hierarchy forms further. Closely related is the\nMiura transformation. This is particularly simple in our context. Assuming the order n=2m+1 with m∈ℕ\nis odd, then since ℐ^2=𝕀, the base dispersion equation for P is,\n\n    _t P=(-1)^m+1^2m+1P.\n\nWe can assume this to be the base equation for the non-commutative potential Korteweg–de Vries hierarchy considered in Malham <cit.>. \nIn that case the solution G^pKdV is given by G^pKdV=P(𝕀-P)^-1.\nFor the non-commutative modified Korteweg–de Vries hierarchy, we observe that when n is odd we can\nassume the solution G^mKdV to have the form G^mKdV=2P(𝕀+P)^-1(𝕀-P)^-1,\ni.e. replacing the `iP' everywhere simply by P, and all our results in Section <ref> and thereafter follow through. \nThis is because we carried through the quantity `iP' throughout our computations in Section <ref>\nand, in particular, into our abstract encoding. For example, our computation for _t[V] preceding Definition <ref>\ncarries through with this replacement with V(𝕀-P)^-1, P^†=-P and V^†=(𝕀+P)^-1.\nFor convenience we set U^pKdV(𝕀-P)^-1 and U^mKdV(𝕀+P)^-1(𝕀-P)^-1.\nNote that by operator partial fractions we have U^pKdV=𝕀+PU^pKdV so G^pKdV= U^pKdV.\nThen as in Doikou et al. <cit.> we observe that since U^pKdV=(𝕀+P)U^mKdV we have,\n\n    U^pKdV   =(PU^mKdV)+ U^mKdV\n    ⇔       U^pKdV   =(PU^mKdV)+U^mKdV(P^2)U^mKdV\n    ⇒       G^pKdV   = G^mKdV+ G^mKdV^2.\n\nIn the last step we used the Pöppe product rule. This represents the Miura transformation giving the connection\nbetween the non-commutative potential, and modified, Korteweg–de Vries hierarchies. A natural question is what\nthe translation (likely non-trivial) of this result is at even orders?\n\nA natural formulation for Hankel and Toeplitz operators is the L^2 Hardy spaces ℍ_±, corresponding to the\nupper and lower half complex plane; see for example Peller <cit.>. This can be thought of as the Fourier transform\nrepresentation of the formulation we gave in Section <ref>. Recently this context has been used to\nprove interesting integrability results/connections for the cubic Szegö equation, see Pocovnicu <cit.>,\nGrellier and Gerard <cit.> and Gerard and Pushnitski <cit.>,\nand to extend regularity results for the Korteweg–de Vries equation, see Grudsky and Rybkin <cit.>.\nThere is a natural decomposition L^2()=ℍ_+⊕ℍ_- and thus an immediate direction to pursue\nwould be to consider our Marchenko equation and Fredholm Grassmannian flow in this context and establish a\nconnection to the results of, for example, Grellier and Gerard <cit.> and Grudsky and Rybkin <cit.>.\n\nAt the abstract algebra level, for the skew-Pöppe algebra\nℂ[ℤ_0]≅ℂ[𝒞]×ℝ𝔹,          \nthere are many open questions as follows:\n(i) The skew-Pöppe algebra ℂ[ℤ_0], endowed with the triple product in Lemma <ref>,\nconstitutes a triple system or ternary algebra. See for example Meyberg <cit.> or Ricciardo <cit.>.\nExploring this context is very much of interest.\n(ii) The Pöppe products in Lemma <ref> are quasi-Leibniz products in which the `quasi' label refers to the term additional to the\ntwo expected Leibniz terms which essentially involves inserting a `1' between the two terms in the product (as well as a factor `2').\nA natural question is, is it possible to establish an isomorphism between between this skew-Pöppe algebra and the corresponding\nskew-Pöppe algebra endowed with the triple product based on the Pöppe products in Lemma <ref>\nwithout the `quasi' terms? This will necessarily require a fix of the non-quasi product for low order terms, for example those\ninvolving products with `[0]' and so forth.\nThe analogy is the isomorphism between the shuffle algebra and the quasi-shuffle algebra proved by Hoffman <cit.>.\nEstablishing such an isomorphism would significantly simplify the proofs of the results herein and would help to\nestablish (iii) and (iv) just below. \n(iii) We observe that in our main result we sought Pöppe polynomial expansions π_n=π_n([0],[1],…,[ n])\nfor the endomorphisms [ 0n0] when n is odd, and [0 n0^†] when n is even. \nHowever more generally we might ask the question of whether there exists Pöppe polynomial expansions for any of the basis elements\nin ℂ[ℤ_0]? In other words can we express any basis element in ℂ[ℤ_0] as a linear combination\nof monomials of the form [n_1] [n_2] ⋯ [n_k]?\n(iv) A directly related broader question then is, does there exist an isomorphism between the algebra of\nodd-degree monomial forms [n_1] [n_2] ⋯ [n_k] with n_i∈ℕ∪{0} endowed with the concatenation product,\nand the skew-Pöppe algebra? The connection is provided by the signature expansions. The odd-degree monomial form parametrising factors n_1n_2⋯ n_k\nare actually weak compositions.\n(v) Can we establish a co-algebra associated with the skew-Pöppe algebra ℂ[𝒞]×ℝ𝔹?\nThis was achieved for Pöppe algebra in Malham <cit.>.\nHere we have to deal with the ℝ𝔹-components. Indeed, we have already started in this direction.\n(vi) Establishing such a co-algebra, or at least a refined de-Pöppe co-product Δ_n associated with ℂ[𝒞]×ℝ𝔹,\nwould be useful. Consider the odd-degree monomial [n_1] [n_2] ⋯ [n_k] with n_1n_2⋯ n_k a weak composition of n.\nUsing the signature expansions for each of the factors, [n_1] [n_2] ⋯ [n_k] can be expressed in the form,\n\n    ∑χ(w_1 w_2⋯ w_k)·([w_1]×β_1(|w_1|)) ([w_2]×β_1(|w_2|)) ⋯ ([w_k]×β_1(|w_k|)),\n\nwhere the sum is over all basis elements [w_i]×β_1(|w_i|) for i=1,…,k, with w_i∈𝒞(n_i) and\nβ_1(|w_i|)∈ℝ𝔹 of length 2^|w_i| with the first component equal to `1' as the only non-zero component. \nIf we compute all the odd-degree Pöppe products on the right, we generate the following form, \n\n    ∑_w∈𝒞(n)∑_i=1^2^|w|χ_β_i((Δ_k([w]×β_i))·([w]×β_i).\n\nIn this expression, the β_i are the natural basis elements of ℝ𝔹 of length 2^|w|,\ncontaining a `1' in the ith position and zeros elsewhere. The combined pair of sums correspond to a sum over all possible basis elements,\nfor example over all the left-most column elemnts in Tables <ref> and <ref>.\nThe co-product Δ_k generates all forms w_1 w_2⋯ w_k such that the odd-degree Pöppe product\n([w_1]×β_1(|w_1|)) ⋯ ([w_k]×β_1(|w_k|)) generates [w]×β_i.\nThe homomorphic map χ_β_i records the signature coefficient χ(w_1 w_2⋯ w_k) together\nwith the factor in the 2^|w|×2^|w| block associated with the composition [w] as outlined in Section <ref>.\nSee for example the matrix A_3 from that section. It records the factor associated with the β_i row and the\n[σ(w_1)] [σ(w_1)] ⋯ [σ(w_1)] column, where σ(w_i) represents the sum of\nall the factors in the composition w_i. Any terms resulting from the `quasi' term in the Pöppe product are included.\nRecall we can systematically generate all the blocks and all such factors\nusing the appropriate three standard actions—see Step 5 in Section <ref>.\nLet 𝒞^∗(n) denote the set of all odd-length weak compositions v of n such that σ(v)+|v|-1=n.\nAssuming we have established such a co-product Δ_k, then we observe, we can express any Pöppe polynomial,\nor even an arbitrary sum of Pöppe polynomials, in the form,\n\n    ∑_n⩾1π_n   =∑_w∈𝒞Π([w])·([w]×β_i),\n      whereΠ([w])   =∑_i=1^2^|w|∑_v∈𝒞^∗(σ(w)) c_v χ_β_i(Δ_|v|([w]×β_i)).\n\nThus, in principle, we can express the whole hierarchy as the co-algebra sum Π.\n\n\n\n  SJAM would like to thank the EPSRC for the Mathematical Sciences Small Grant EP/X018784/1. \n  It is also a pleasure to acknowledge very interesting discussions with Alexander Pushnitski and Alexei Rybkin in connection with our work herein.\n\n\n\n\n\n\n§ DECLARATIONS\n\n\n\n\n §.§ Funding and/or Conflicts of interests/Competing interests\n\nSJAM received funding from the EPSRC for the Mathematical Sciences Small Grant EP/X018784/1.\nThere are no conflicts of interests or competing interests. \n\n\n\n §.§ Data availability statement\n\nNo data was used in this work. \n\n\n99\n\nAMusslimani  Ablowitz MJ, Musslimani ZH 2017\nIntegrable nonlocal nonlinear equations, Stud. Appl. Math. 139(1).\n\nAMshift Ablowitz MJ, Musslimani ZH 2021\nIntegrable space-time shifted nonlocal nonlinear equations, Physics Letters A 409, 127516.\n\nAPT Ablowitz MJ, Prinari B, Trubatch D 2004\nDiscrete and Continuous Nonlinear Schrödinger Systems, Cambridge University Press.\n  \nARSII Ablowitz MJ, Ramani A, Segur H 1980\nA connection between nonlinear evolution equations and ordinary\ndifferential equations of P-type. II, \nJournal of Mathematical Physics 21, 1006–1015.\n\nAP Adamopoulou P, Papamikos G 2020\nDrinfel'd–Sokolov construction and exact solutions of vector modified KdV hierarchy,\nNuclear Physics B 952, 114933.  \n\nAC1995 Aden H, Carl B 1995 On realizations of solutions of the KdV equation by determinants on operator ideals,\n  J. Math. Phys. 37(4), 1833–1857.\n\nAHH Arthamonov A, Harnad J, Hurtibise, J 2022 Tau functions, infinite Grassmannians and\n  lattice recurrences, arXiv:2207.08054v2.\n\nAU Axenovich M, Ueckerdt T 2017 Lecture Notes: Combinatorics,\n\n  .\n \nBP-ZS Bauhardt W, Pöppe Ch. 1993 \nThe Zakharov–Shabat inverse spectral problem for operators,\nJ. Math, Phys. 34(7), 3073–3086.\n\nBM Beck M, Malham SJA 2015 Computing the Maslov\nindex for large systems, PAMS 143, 2159–2173.\n\nBDMS1 Beck M, Doikou A, Malham SJA, Stylianidis I 2018\nGrassmannian flows and applications to nonlinear partial differential equations,\nProc. Abel Symposium, accepted.\n\nBDMS2 Beck M, Doikou A, Malham SJA, Stylianidis I 2018\nPartial differential systems with non-local non-linearities: Generation and solutions, \nPhil. Trans. R. Soc. A 376, 2117, 195.\n\nBR Beck M, Robbins N 2015\n  Variations on a generating-function theme: Enumerating compositions with parts\n  avoiding an arithmetic sequence, The American Mathematical Monthly 122, 256–263.\n\nBD Blower G, Doust I 2023 Linear systems, Hankel products and the sinh-Gordon equation,\n  Journal of Mathematical Analysis and its Applications.\n  \nBN Blower G, Newsham S 2020\nOn tau functions associated with linear systems,\nOperator theory advances and applications: IWOTA Lisbon 2019.\ned. Amelia Bastos; Luis Castro; Alexei Karlovich.\nSpringer Birkhäuser. (International Workshop on Operator Theory and Applications).\n\nBornemann Bornemann F 2010 On the numerical evaluation of Fredholm determinants,\n  Math. Comp. 79(270), 871–915.\n\nBuryakRossi Buryak A, Rossi P 2021\nQuadratic double ramification integrals and the noncommutative KdV hierarchy,\narXix:1909.11617v3.  \n\nCafasso Cafasso M 2008 Block Toeplitz determinants, constrained KP and Gelfand–Dickey hierarchies,\n  Mathematical Physics, Analysis and Geometry 11, 11–51.\n\nCW Cafasso M, Wu C-Z 2019 Borodin–Okounkov formula, string equation and topological solutions of Drinfield–Sokolov hierarchies,\n  arXiv:1505.00556v3. \n\nCSI Carillo S, Schiebold C 2009\nNoncommutative Korteweg–de Vries and modified Korteweg–de Vries hierarchies\nvia recursion methods, J. Math. Phys. 50, 073510.\n\nCSIa Carillo S, Schiebold C 2011\nMatrix Korteweg–de Vries and modified Korteweg–de Vries hierarchies:\nNoncommutative soliton solutions, J. Math. Phys. 52, 053507.\n\nCSII Carillo S, Schiebold C 2012\n  Nonlinear evolution equations: Bäcklund transformations and Bäcklund charts,\n  Acta Appl. Math. 122, 93–106.\n\nCSIII Carillo S, Schiebold C 2021 Bäcklund transformations: a tool to study Abelian and non-Abelian nonlinear evolution equations,\n  arXiv:2101.09245v1.\n\nDL2 Degasperis A, Lombardo S,\nMulticomponent integrable wave equations: II. Soliton solutions,\nJ. Phys. A: Math. Theor. 42(38) (2009).\n\nDM-H2005 Dimakis A, Müller–Hoissen F 2005\nAn algebaric scheme associated with the noncommutative KP hierarchy and some of its extensions,\nJ. Phys. A: Math. Gen. 38, 5453–5505.  \n\nDM-H2008 Dimakis A, Müller–Hoissen F 2008\nWeakly non-associative algebras, Riccati and KP hierarchies,\nin Generalized Lie Theory in Mathematics, Physics and Beyond,\nedited by S. Silvestrov, E. Paal, V. Abramov and A. Stolin, Springer–Verlag, 9–27.\n\nDM-H2009 Dimakis A, Müller–Hoissen F 2009 Bidifferential graded algebras and integrable systems,\nDiscrete and Continuous Dynamical Systems (DCDS) Supplements 2009, 208-219 (Proceedings AIMS Conference, Arlington 2008).\n\nDM-H2010 Dimakis A, Müller–Hoissen F 2010 Solutions of matrix NLS systems and their discretizations: A unified treatment,\nInverse Problems 26 095007.\n  \nDEGM Dodd RK, Eilbeck JC, Gibbon JD, Morris HC 1982\nSolitons and non-linear wave equations, London, Academic Press.\n\nDMS Doikou A, Malham SJA, Stylianidis I 2021\nGrassmannian flows and applications to non-commutative non-local and local integrable systems,\nPhysica D 415, 132744\n\nDMSW:AGFintegrable Doikou A, Malham SJA, Stylianidis I, Wiese A 2022\nApplications of Grassmannian flows to integrable systems, submitted.\n\nDMSW:AGFcoagulation Doikou A, Malham SJA, Stylianidis I, Wiese A 2022\nApplications of Grassmannian and graph flows to coagulation processes, submitted.\n\nDJ Drazin PG, Johnson RS 1989\nSolitons: an introduction, Cambridge Texts in Applied Mathematics,\nCambridge University Press.\n\nDGKM Dubard P, Gaillard P, Klein C, Matveev VB 2010\nOn multi-rogue wave solutions of the NLS equation and positon solutions of the KdV equation,\nEur. Phys. J. Special Topics 185, 247–258.\n\nDG Dubrovsky VG, Gramolin AV 2009 Gauge-invariant description of several (2+1)-dimensional integrable nonlinear evolution equations,\n  Theoretical and Mathematical Physics 160(1), 905–916.\n\nDGP2006 Dupré MJ, Glazebrook JF, Previato E 2006\nA Banach algebra version of the Sato Grassmannian and commutative rings of differential operators,\nActa Appl. Math. 92, 241–267.  \n\nDGP2007 Dupré MJ, Glazebrook JF, Previato E 2007\nOn Banach bundles and operator-valued Baker functions,\nInstitut Mittag–Leffler Report No. 12.  \n\nDGP2013 Dupré MJ, Glazebrook JF, Previato E 2013\nDifferential algebras with Banach-algebra coefficients II: The operator cross-ratio tau-function\nand the Schwarzian derivative, Complex Analysis and Operator Theory 7, 1713–1734.\n\nDyson Dyson FJ 1976 Fredholm determinants and \ninverse scattering problems, Commun. Math. Phys. \n47, 171–183.\n\nEFMKLMW Ebrahimi–Fard K, Lundervold A, Malham SJA, Munthe–Kaas H, Wiese A 2012\nAlgebraic structure of stochastic expansions and efficient simulation,\nProc. R. Soc. A 468, 2361–2382. (doi:10.1098/rspa.2012.0024)\n\nEM Ercolani N, McKean HP,\n  Geometry of KDV (4): Abel sums, Jacobi variety, and theta function in the scattering case, Invent. Math. 99, 483–-544 (1990).\n\nFokas Fokas AS 2016\nIntegrable multidimensional versions of the nonlocal nonlinear Schrödinger equation, Nonlinearity 29, 319–324.\n\nFA Fokas AS, Ablowitz MJ 1981 Linearization of the Korteweg de Vries and Painlevé II equations, Phys. Rev. Lett. 47, 1096.\n\nFP Fokas AS, Pelloni B 2014 Unified transform for boundary value problems: Applications and Advances, in: Society for Industrial and Applied Mathematics.\n  \nFK Fordy AP, Kulish PP 1983 Nonlinear Schrödinger equations and simple Lie algebras,\nCommun. Math. Phys. 89, 427–443.  \n\nFu Fu W 2018 Direct linearisation of discrete and continuous integrable systems:\nThe KP hierarchy and its reductions, PhD Thesis, University of Leeds.\n\nFNI Fu W, Nijhoff FW 2021 Elementary introduction to direct linearisation of integrable systems,\nChapter in the book “Nonlinear Systems and Their Remarkable Mathematical Structures”, Chapman and Hall/CRC.\n\nGerdjikov Gerdjikov VS 2018 On Kaup–Kupershmidt type equations and their soliton solutions, arXiv:1703.05850.\n\nGP Gerard P, Pushnitskii A 2022 Unbounded Hankel operators and the flow of the cubic Szegö equation, Inventiones Mathematicae.\n  \nGMS Grahovski GG, Mohammed AJ, Susanto H 2017 Nonlocal Reductions of the Ablowitz-Ladik Equation,\nTheor. Math. Phys. 197, 1412–1429 (2018).\n\nGerard Grellier S, Gerard P 2017 The cubic Szegö equation and Hankel operators,\nAstérisque 389, Société Mathématique de France, Paris.\n\nGRI Grudsky S, Rybkin A 2015 Soliton theory and Hankel operators,\nSIAM J. Math. Anal. 47(3), 2283–2323.\n  \nGRII Grudsky S, Rybkin A 2020 On classical solutions of the KdV equation,\nProc. London Math. Soc. 121, 354–371.\n\nGRIII Grudsky S, Rybkin A 2022 The inverse scattering transform for weak Wigner–von Neumann potentials,\n  Nonlinearity 35(5), 2175–2191.\n\nGP2018 Gürses M, Pekcan A 2018 Nonlocal nonlinear Schrodinger equations and their soliton solutions,\nJ. Math. Phys. 59, 051501.\n\nGP2019b Gürses M, Pekcan A 2019 Nonlocal modified KdV equations and their soliton solutions,\nCommun. Nonlinear Sci. Numer. Simul. 67, 427–448.  \n\nGP2020 Gürses M, Pekcan A 2020 Nonlocal KdV equations, arXiv:2004.07144.\n\nGP2022 Gürses M, Pekcan A 2022 Multi-component AKNS systems, arXiv:2208.01086.\n\nHT Hamanaka M, Toda K 2004 Towards noncommutative integrable equations,\nProceedings of the Institute of Mathematics of NAS of Ukraine 50(1), 404–411.\n\nHP Hille E, Phillips RS 1996 Functional analysis and semigroups, AMS, Colloquium Publications, Volume 31.\n\nHoffman Hoffman ME 2000 Quasi-shuffle products, Journal of Algebraic Combinatorics 11, 49-–68. \n  \nKM Karambal I, Malham SJA 2015 Evans function and Fredholm determinants, Proc. R. Soc. A 471(2174). \nDOI: 10.1098/rspa.2014.0597\n\nKasman1995 Kasman A 1995 Bispectral KP solutions and linearization of Calogero–Moser particle systems,\nComm. Math.Phys. 172, 427–448.\n  \nKasman1998 Kasman A 1999 Grassmannians, nonlinear wave equations and generalized Schur functions,\nin Contemporary Mathematics: Geometry and Topology in Dynamics, Volume 246, AMS.\n\nKlausner Klausner LD 2011\n  Coalgebras, Hopf algebras and combinatorics, Diplomarbeit, Technische Universität Wien.\n\nLA Liu QP, Athorne C 1991 Comment on `Matrix generalization of the modified Korteweg–de Vries equation',\n  Inverse Problems 7, 783–785.\n  \nMa Ma W-X 2023 Sasa–Satsuma type matrix integrable hierarchies and their Riemann–Hilbert problems and soliton solutions,\n  Physica D 446, 133672.\n  \nMalham:quinticNLS Malham SJA 2020 Integrability of local and nonlocal non-commutative fourth order quintic nonlinear Schrödinger equations,\narXiv:2009.14253.\n\nMalham:KdVhierarchy Malham SJA 2021, The non-commutative Korteweg–de Vries hierarchy and combinatorial Pöppe algebra, arXiv:2108.04514.  \n\nMW Malham SJA, Wiese A 2009 Stochastic expansions and Hopf algebras, Proc. R. Soc. A 465, 3729–3749.\n(doi:10.1098/rspa.2009.0203)\n\nMatveevSmirnov Matveev VB, Smirnov AO 2018 AKNS and NLS hierarchies, MRW solutions, P_n breathers, and beyond,\nJournal of Mathematical Physics 59, 091419.  \n  \nMcKean McKean HP 2011 Fredholm determinants,\nCent. Eur. J. Math.  9(2), 205–243.\n\nMeyberg Meyberg K 1972 Lectures on algebras and triple systems, Lecture notes, University of Virginia.\n  \nMiura Miura RM 1976 The Korteweg–De Vries equation: A survey of results,\nSIAM Review 18(3), 412–459.\n\nMJD Miwa T, Jimbo M, Date E 2000 Solitons: Differential equations, symmetries and infinite dimensional algebras,\nCambridge University Press.\n\nMulase Mulase M 1990 Category of vector bundles on algebraic curves and infinite dimensional Grassmannians,\n  International Journal of Mathematics 1(3), 293–342.\n\nMumford Mumford D 1984 Tata lectures on Theta II, Modern Birkhauser Classics.\n  \nNQVDLCII Nijhoff FW, Quispel GRW, Capel HW 1983 Direct linearization of nonlinear difference-difference equations,\nPhysics Letters 97A(4), 125–128.  \n\nNQVDLCI Nijhoff FW, Quispel GRW, Van Der Linden J, Capel HW 1983\nOn some linear integral equations generating solutions of nonlinear\npartial differential equations, Physica 119A, 101–142.\n\nNSZ Nijhoff FW, Sun Y-Y, Zhang D-J 2022 Elliptic solutions of Boussinesq type lattice equations\n  and the elliptic Nth root of unity, CMP (DOI) https://doi.org/10.1007/s00220-022-04567-8. \n\nOR Oevel W, Rogers C 1992 Gauge transformations and reciprocal links, Rev. Math. Phys. 5(2), 299–330.\n\nOS Olver PJ, Sokolov VV 1998 Integrable evolution equations on associative algebras,\n  Commun. Math. Phys. 193, 245–268.\n\nPelinovsky Pelinovsky DE, Stepanyants YA 2018 Helical solitons in vector modified Korteweg-de Vries equations,\nPhysics Letters A 382, 3165–3171.\n\nPeller Peller VV 2003 Hankel operators and their applications, Springer Monographs in Mathematics, Springer–Verlag, New York.\n\nPocovnicu Pocovnicu O 2012 Soliton interaction with small Toeplitz potentials for the Szegö equation on ,\n  Dynamics of PDE 9(1), 1–27.\n\nP-SG Pöppe Ch. 1983 Construction of solutions of the sine-Gordon equation by means of Fredholm determinants,\nPhysica D 9, 103–139.\n\nP-KdV Pöppe Ch. 1984 The Fredholm determinant method for the KdV equations,\nPhysica D 13, 137–160.\n\nP-KP Pöppe Ch. 1984 General determinants and the τ function for the Kadomtsev–Petviashvili hierarchy,\nInverse Problems 5, 613–630.\n\nPS-KP Pöppe Ch., Sattinger DH 1988 Fredholm determinants and the τ function for the Kadomtsev–Petviashvili hierarchy,\nPubl. RIMS, Kyoto Univ. 24, 505–538.\n\nPS Pressley A, Segal G 1986 Loop groups, Oxford Mathematical Monographs,\nClarendon Press, Oxford.\n\nReutenauer Reutenauer Ch 1993 Free Lie Algebras, \nLondon Mathematical Society Monographs, Clarendon Press, Oxford.\n\nRicciardo Ricciardo A 2014 Lie algebras and triple systems,\nTesi di Laurea in Algebra, Università di Bologna.\n  \nSatoI Sato M 1981 Soliton equations as dynamical systems\non a infinite dimensional Grassmann manifolds. RIMS 439, 30–46.\n\nSatoII Sato M 1989, The KP hierarchy and infinite dimensional\nGrassmann manifolds, Proceedings of Symposia in Pure Mathematics \n49 Part 1, 51–66.\n\nSchieboldncSG Schiebold C. 2009 Noncommutative AKNS systems and multisoliton solutions to the matrix sine-Gordon equation,\nDiscrete and Continuous Dynamical Systems: Suppl., 678–690.\n\nSW Segal G, Wilson G 1985 Loop groups and equations\nof KdV type, Inst. Hautes Etudes Sci. Publ. Math.\n61, 5-–65.\n\nSimon:Traces Simon B 2005 Trace ideals and their applications, \n2nd edn. Mathematical Surveys and Monographs, vol. 120. Providence, RI: AMS.\n\nSooman Sooman CM 2009 Soliton solutions of noncommutative integrable systems (PhD Thesis), University of Glasgow. \n\nStylianidis Stylianidis I 2019 \nGrassmannian flows: applications to PDEs with local and nonlocal nonlinearities, \nPhD Thesis, in preparation. \n\nTW Tracy CA, Widom H 1996 Fredholm determinants and the mKdV/Sinh-Gordon hierarchies,\nCommun. Math. Phys.  179, 1–10.\n\nTracyWidom Tracy CA, Widom H, Introduction to random matrices, arXiv:hepth/9210073.\n\nTI Treves F 2007 Noncommutative KdV hierarchy,\nRevi. Math. Phys. 19, 677–724.\n  \nTII Treves F 2009 Multidimensional soliton integrodifferential systems,\nin Advances in Phase Space Analysis of Partial Differential Equations,\nProgress in Nonlinear Differential Equations and Their Applications, Volume 78,\nEds. A. Bove, D. Del Santo, M.K. Venkatesha Murthy, Birkhäuser. \n\nW Wilson G 1985 Infinite-dimensional Lie groups and algebraic geometry in soliton theory,\nTrans. R. Soc. London A 315 (1533), 393–404.\n\nWitten1990 Witten E 1990 On the structure of the topological phase of two-dimensional gravity,\n  Nuclear Phys. B 340(2–3), 281–332.\n\nWitten1991 Witten E 1991 Two-dimensional gravity and intersection theory on moduli space,\n  Surveys in Differential Geometry 1, 243–310.\n  \nZS Zakharov VE, Shabat AB 1974 \nA scheme for integrating the non-linear equation of mathematical physics \nby the method of the inverse scattering problem I, \nFunct. Anal. Appl. 8, 226. \n\nZS2 Zakharov VE, Shabat AB 1979\nIntegration of nonlinear equations of mathematical physics by the method of inverse scattering II,\nFunct. Anal. Appl. 13(3), 166–-174.\n\n\n\n\n"}