{"entry_id": "http://arxiv.org/abs/2303.06672v1", "published": "20230312142601", "title": "Superconductivity studied by solving ab initio low-energy effective Hamiltonians for carrier doped CaCuO$_2$, Bi$_2$Sr$_2$CuO$_6$, Bi$_2$Sr$_2$CaCu$_2$O$_8$, and HgBa$_2$CuO$_4$", "authors": ["Michael Thobias Schmid", "Jean-Baptiste Morée", "Youhei Yamaji", "Masatoshi Imada"], "primary_category": "cond-mat.supr-con", "categories": ["cond-mat.supr-con", "cond-mat.str-el"], "text": "\n\n\n\n\n\n^1 Waseda Research Institute for Science and Engineering, Waseda University, 3-4-1, Okubo, Shinjuku, Tokyo 169-8555, Japan\n\n^2 Center for Green Research on Energy and Environmental Materials, National Institute for Materials Science, Namiki, Tsukuba-shi, Ibaraki, 305-0044, Japan\n\n^3 Toyota Physical and Chemical Research Institute, 41-1, Yokomichi, Nagakute, Aichi 480-1192, Japan\n\n^4 Department of Engineering and Applied Sciences, Sophia University, 7-1 Kioi-cho, Chiyoda, Tokyo 102-8554, Japan\n      \n\n\nUnderstanding the materials dependence together with the universal controlling parameter of superconductivity (SC) in copper oxide superconductors is one of the major challenges in condensed matter physics.\nHere, we numerically analyze SC by using ab initio low-energy effective Hamiltonians consisting of the antibonding combination of Cu 3d_x^2-y^2 and O 2p_σ orbitals without adjustable parameters.\nWe have performed the state-of-the-art variational Monte Carlo calculations for the four carrier doped cuprates with diverse experimental optimal SC critical temperature T_c^ opt: CaCuO_2 (T_c^ opt∼ 110 K), Bi_2Sr_2CuO_6 (T_c^ opt∼ 10-40 K), Bi_2Sr_2CaCu_2O_8 (T_c^ opt∼ 85-100 K), and  HgBa_2CuO_4 (T_c^ opt∼ 90 K). \nMaterials and hole doping concentration (δ) dependencies of the SC order parameter F_ SC and the competition with spin/charge order \nshow essential and quantitative agreements with the available experiments on the four materials\nin the following points:\n(1) In a wide range  0.05 ≤δ≤ 0.25, the ground state is commonly the SC state, which is severely competing with the charge/spin stripe and antiferromagnetic states.\n(2) F_ SC shows amplitude consistent with the superfluid density measured in the muon spin resonance (μSR) and its dome structure found in δ dependence shows consistency with that of the SC gap in the tunneling and photoemission measurements.\nBased on the confirmed materials dependence, we further find insights into the universal SC mechanism:  \n(I) F_ SC increases with the ratio U/|t_1|, indicating that U/|t_1| is the principal component controlling the strength of the SC.\nHere, U and t_1 are the onsite Coulomb repulsion and the nearest neighbor hopping, respectively, in the ab initio Hamiltonians.\n(II) A universal scaling T_c^ opt∼ 0.16 | t_1 | F_ SC holds.\n(III) SC is enhanced and optimized if U is increased beyond the real available materials, and it is further enhanced when the offsite interaction is reduced.\nThe present findings provide useful clues for the design of new SC materials with even higher T_c^ opt. \n\n Superconductivity studied by solving ab initio low-energy effective Hamiltonians for carrier doped CaCuO_2, Bi_2Sr_2CuO_6, Bi_2Sr_2CaCu_2O_8, and  HgBa_2CuO_4\n    \nMichael Thobias Schmid^1 0000-0003-2724-0621, \nJean-Baptiste Morée^1 0000-0002-0710-9880, \nYouhei Yamaji^2 0000-0002-4055-8792, \nand Masatoshi Imada^1,3,4 0000-0002-5511-2056\n\n    March 30, 2023\n====================================================================================================================================================================================\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe mechanism and origin of the large superconducting (SC) gap, high superfluid density, and high critical temperatures T_c observed in high-T_c superconductors, such as copper oxides, remain a central challenge in condensed matter physics.\nIn these copper oxides, the d-wave SC state is severely competing with other orders, such as spin and charge stripes or antiferromagnetic states, and the observed T_c widely ranges from above 130 K to below 10 K. \nUnderstanding and reproducing these diverse phenomena without relying on adjustable parameters is hence desirable, especially when clarifying their origin. \nWhen ab initio calculations are able to reproduce systematic materials dependence quantitatively by solely relying on their crystal structures, it  provides us with valuable insight into the universal mechanism behind and into the principal components for the enhancement of SC beyond existing materials.\n\nMany studies have suggested severe competitions of the SC with charge/spin stripe and antiferromagnetic states theoretically based on simplified Hubbard-like or t-J Hamiltonians as models of the cuprate superconductors <cit.>. \nA positive correlation between U and T_c or SC tendency was also pointed out by taking U as an adjustable parameter in the Hubbard type Hamiltonians <cit.>. \nHowever, ab initio studies without adjustable parameters are few and it is not clear whether the diversity of the materials dependence can be accounted for. There still exists a limited number of ab initio studies: The phase diagram including the SC phase was reproduced by solving the ab initio Hamiltonian for a particular case of Hg compound <cit.>. \nAb initio Hamiltonians were derived by Nilsson et al. for several cuprate compounds, which reported an empirical observation without solving the Hamiltonians that the experimental optimal T_c is generally higher for larger U/|t| in their parameters <cit.>.  \nThe relation of the charge transfer energy to T_c was also pointed out <cit.>. \nAside from the cuprates, there exist some ab initio studies on strong-coupling superconducting materials such as the iron-based superconductors <cit.>, fullerene <cit.>, and nickelates <cit.> to discuss the superconducting properties. \nHowever, to the authors' knowledge, there exist no systematic studies on the SC properties by solving solely ab initio Hamiltonians without adjustable parameters with the help of accurate many-body solvers to reveal the origin of the diverse materials dependence, especially for the challenging cuprates. \nUnless reproducing the materials dependent properties quantitatively, the universal mechanism would not be able to be identified either. \n\nIn this paper we show properties of typical cuprate superconductors calculated by solving the ab initio Hamiltonians of four families of materials, namely carrier doped CaCuO_2, HgBa_2CuO_4 (abbreviated as Hg1201 hereafter), Bi_2Sr_2CuO_6 (Bi2201 hereafter), and Bi_2Sr_2CaCu_2O_8 (Bi2212 hereafter) <cit.>, by applying a state-of-the-art quantum many-body solver based on the variational Monte Carlo (VMC) algorithm <cit.>, including the combination with neural network <cit.> elaborated from earlier variational algorithms <cit.>.  \nIt is experimentally known that the optimum critical temperature T_c ^ opt is realized at around δ=0.1-0.15 <cit.> for doped CaCuO_2 (T_c^ opt∼ 110K) and Hg1201 \n(T_c^ opt∼ 90K), and at around δ=0.15-0.25 <cit.> for doped Bi2212 (T_c^ opt∼ 85-100K) and Bi2201 (T_c^ opt∼ 10-40K). \nWe elucidate that similarity and diversity among the four families, especially the amplitude of the SC order parameters and  T_c^ opt in the experiments are accounted for by using the present ab initio results, which provides us with insights into the materials dependence and the universal mechanism:\n\nThe dominance of the SC for all the four families are successfully demonstrated. In addition, the δ dependence of F_ SC has a dome structure with the peak at δ∼ 0.05-0.1 consistently with the experimental indications. On the other hand, the dome peak of T_c appears at larger δ>0.1 in the experiment. This shift from the dome peak of F_ SC is understood from the decreasing renormalization factor with decreasing doping, which does not affect F_ SC but T_c.\n\nAlthough T_c^ opt has a variety among these four families, we show universally that (I) the higher SC order parameter F_ SC at the optimal doping basically results from a larger ratio U/|t_1|, where U is the onsite repulsive Coulomb interaction and t_1 is the nearest neighbor hopping in  our ab initio parameters of single-band effective Hamiltonian for the antibonding orbital of strongly hybridized Cu 3d_x^2-y^2 and O 2p_σ orbitals. Furthermore, we show that (II) T_c^ opt is determined by the scaling T_c^ opt∼ 0.16 | t_1 | F_ SC.\n\nThe δ dependence of the local energy suggests a universal superconducting mechanism: Though the bare interaction is strongly repulsive, the Mottness converts it to the strong effective attraction required for the Cooper pairing. \n\nDespite monotonic increase of F_ SC with U/|t_1| within the existing materials, we further show that (III) larger U/|t_1| beyond the ab initio values makes the peak of F_ SC followed by the reduction. \nWe find that F_ SC can be roughly 30% enhanced than the ab initio case when U is 20% increased beyond the ab initio value by preserving the transfer and other offsite interaction parameters.\nWe also show that F_ SC is further enhanced to as much as the double of the existing material by the additional reduction of the offsite Coulomb interaction.\nThese searches beyond the ab initio parameters for the existing materials offer a guide for future experimental materials design.  \n\n\nThis paper is organized as follows. \nSec. <ref> presents the methods and computational details: First, the effective Hamiltonians studied in this paper are summarized in Sec. <ref>.\nThen, we give the numerical methods in Sec. <ref> and define the physical quantities in Sec. <ref>.\nWe present in Sec. <ref> the results for each of the four families of compounds.\nBased on the obtained ab initio results, in Sec. <ref>, we further explore the direction to enhance and optimize the SC order parameter by controlling the effective interaction parameters beyond the ab initio values, to gain insights into the future materials design. In Sec. <ref>, we discuss our analyses. Summary and conclusion are given in Sec. <ref>.\n\n\n\n\n§ METHODS\n\n\n\n\n\n §.§ Ab initio effective Hamiltonian \n\n\n\nWithin this paper, we solve the ab initio single-band effective Hamiltonians for CaCuO_2, Hg1201, Bi2201, and Bi2212 as derived in Ref. moree2022, where the transfer and interaction parameters are derived at values close to the experimental optimum hole concentration (at 10% doping for CaCuO_2 and Hg1201 and at 20% for the two Bi compounds). \nThis choice is appropriate in this paper, because properties at optimum hole concentration are the central subject.\nThe effective Hamiltonians have the form\n\n    ℋ   = ℋ_ kin + ℋ_U + ℋ_V\n\nwith\n\n    ℋ_ kin   =   ∑_i, j, σ t_ij c^†_iσ c^†_jσ, \n    ℋ_U   =   ∑_i U n_i ↑ n_i ↓, \n    ℋ_V   =   1/2∑_i ≠ j V_ij n_i n_j.\n\nHere i,j are the unit cell indices of the maximally localized Wannier function <cit.>  and c^†_iσ (c^†_iσ) is the corresponding creation (annihilation) operator of an electron of spin σ at the site i. \nThe number operator is given by n_i = ∑_σ n_iσ and n_iσ=c^†_iσ c^†_iσ. \nHopping amplitudes t_ij in the kinetic energy ℋ_ kin depends on the relative coordinate vector  r_i -  r_j by assuming the translational invariance of the crystal structure. \nThe direct effective Coulomb interaction given by ℋ_U is scaled by the onsite interaction U, and intersite interaction ℋ_V is the sum over the combination of the site i and j, which is proportional to V_ij.\nLeading values for all of the four materials are listed in Table <ref>. For longer ranged part of t_ij and V_ij, see Sec. S1 in Supplemental Material (SM). Note that the Hamiltonian parameters for Hg1201 in Ref. moree2022, which we employ, are improved from Ref. hirayama2019. \nIt results in slightly different physical quantities on the quantitative level in the present solution in comparison to Ref. ohgoe2020. \n\n\n\n\nWe note that the effective Hamiltonian parameters in Eq. (<ref>) are restricted to a single CuO_2 layer.\nHowever, in the case of multilayer cuprates CaCuO_2 and Bi2212, the distance between CuO_2 layers is comparable to the cell parameter along x direction, so that interlayer coupling parameters (given in Table <ref> in Appendix for Bi2212) also exist in the effective Hamiltonian <cit.>, and its amplitude V_n^l ≲ 0.6 eV is comparable to that of the intralayer offsite interaction V_n ≲ 0.9 eV.\nThis interlayer coupling is ignored in Eq. (<ref>), but potentially play a role in the SC properties.\nThis role is actually examined in Sec. <ref> in the case of Bi2212, which ensures that the SC order parameter F_ SC^∞ (defined later in Sec. <ref>) and physical quantities are essentially not affected by the interlayer coupling within the present case of CaCuO_2 and Bi2212 as we discuss in Sec <ref>.\nThus, we restrict to Eq. (<ref>) even in the case of CaCuO_2 and Bi2212.\nWe employ this “single-layer approximation\" for all the four materials throughout this paper unless otherwise noted.\n\n\n\n\n §.§ Numerical Methods\n\n\nWe solve the Hamiltonian in Eq. (<ref>) by applying the many-variable variational Monte Carlo method (mVMC) <cit.> with a trial wavefunction of the form \n|ψ⟩ = 𝒫^G𝒫^J𝒫^dh|ϕ^pair⟩. \nHere we consider the Gutzwiller factor \n𝒫^G = exp(- g ∑_i  n_i↑ n_i ↓) <cit.>, \nthe Jastrow correlation factor \tP^J = exp( ∑_i<jα_ij n_in_j) <cit.>, \nthe doublon-holon correlation factor \n𝒫^dh = exp[-∑_m=0^4∑_ℓ = 1,2α^(ℓ)_m∑_iξ^(ℓ)_i(m)] <cit.>, \nand a generalized pairing wavefunction of the form \n|ϕ⟩^pair = (∑_iσ, j σ^' f_iσ,j σ^' c^†_iσ c^†_jσ^')^N_e/2|0⟩. \nThe variational parameters are g, α_ij, α^(ℓ)_m, and f_iσ,j σ^'.\n\nWe also supplement the mVMC with the restricted Boltzmann machine (RBM) <cit.> and the first-order Lanczos step to improve the wavefunction and also to take the zero limit of the variance extrapolation to improve the estimate by following the variance extrapolation method <cit.> and by using the simple mVMC, mVMC +Lanczos, and mVMC+RBM results (see Appendices <ref>, <ref>, and Ref. ido2022 for the detailed procedure. \n\nCompeting states with spin/charge order or strong fluctuations can be studied by imposing the mean-field order at the initial trial wavefunction <cit.>. \nThe correlated metallic state without any symmetry breaking can also be studied by using the ground state wave function of the noninteracting system as an initial state. \nThese initial states are then relaxed to lower the energy by optimizing the variational parameters. \nIf the competing states exist, the optimization leads to multiple locally stable solutions. \nThe true ground state is determined by comparing the total energy after taking the variance extrapolation descibed in Appendix <ref> and if possible after careful size extrapolation to see the thermodynamic limit.\n\nThe computational details are the following.\nFor all numerical solutions of finite-size lattices subsequently presented in this paper, we assumed the antiperiodic-periodic boundary condition on a N= L × L square lattice of length L, where N is the number of sites on the single-layer system by ignoring the interlayer coupling except for Bi2212.  For Bi2212, we examine the two-layer system to examine the effect of interlayer coupling, because a unit cell of Bi2212 contains two layers and the interlayer coupling could play roles in the SC. \nWithin a layer, hoppings and interactions were taken into account up to t_9 and V_9, i.e., up to the 2D distance R = (3,3) in the unit of the Cu-Cu distance, while contributions smaller than 0.001 eV were ignored.  \nUnless explicitly mentioned this is applied throughout the whole paper. \nWe concentrate solely on hole doped cases, where the hole doping is given via δ = 1 -  N_e/N  and N_e is the number of electrons in the system. \n\n\n\n\n §.§ Physical Quantities\n\n\n\nThe physical quantities discussed in this paper are defined as follows:\nThe total energy per site E/N = ⟨ℋ|/⟩N is calculated after the variance extrapolation as it is summarized in Appendix <ref>.\nTo see whether the state has spin/charge order, we compute the spin structure factor\n\n    S_s( q) = 1/N∑_i,j⟨ S_i · S_j |⟩e^i q ( r_i -  r_j).\n \nand\nthe charge structure factor \n\n    S_c( q) = 1/N∑_i,j⟨ n_i n_j |⟩e^i q ( r_i -  r_j),\n\nwhere S_i=(S_i^x,S_i^y,S_i^z)=∑_σ, σ' c_iσ^†σ_σσ' c_iσ' /2 is the spin-1/2 operator and  σ_σσ' is the Pauli matrix (=(σ^x_σσ',σ^y_σσ',σ^z_σσ')).\nThe long-range order is determined whether S_s( q)/N or S_c( q)/N remains after taking  the limit N→∞. \nThe SC long-range order is measured by the d-wave SC correlation function \n\n    P_d( r) = 1/2N∑_ r_i⟨Δ^†_d( r_i)  Δ^†_d( r_i +  r)  + h.c.|.⟩\n\nHere Δ^†_d( r_i) describes the order parameter of the form\n\n    Δ^†_ d( r_i)  = 1/√(2)∑_ r f_d( r) (c_ r_i ↑ c_ r_i +  r ↓ + c_ r_i ↓ c_ r_i +  r ↑),\n\nwhere the d_x^2 -y^2-wave symmetry is included via the form factor\n\n    f_d( r)  = δ_r_y,0 ( δ_r_x,1 + δ_r_x,-1)  - δ_r_x,0 ( δ_r_y,1 + δ_r_y,-1).\n\nThen, we deduce P_d( r) over the long range part, as\n\n    P̅_d(L)  = 1/M∑_√(2) L/4 < | r | P_d( r),\n\nwhere r = (r_x, r_y) includes all sites within the square ( -L/2, L/2]^2 and M is the number of lattice points satisfying √(2) L/4 < | r | < √(2) L/2. \nWe define the SC order parameter in the thermodynamic limit, F_ SC^∞ by \n\n    F_ SC^∞    =   lim_L→∞ F_ SC(L) = √(P̅_d^∞),\n     \n    \n    F_ SC(L)   ≡   √(P̅_d(L))\n    P̅_d^∞   =   lim_L→∞P̅_d(L).\n\n\n\n\n\n§ AB INITIO RESULTS\n\n\n\nIn this section we present our calculated ab initio results on the four families of compounds. We first analyze the results for doped CaCuO_2 in detail and then compare it with the result of doped Hg1201. \nDoped Bi2201 and Bi2212 suffer from the experimental uncertainty of the apical oxygen position due to the supermodulation of the crystal structure. \nSince it generates a variance of the Hamiltonian parameters if one assumes the translational symmetry of the Hamiltonian parameters, we show the properties by indicating this range. \nAll of the four materials show dominance of the d-wave SC in the doping concentration dependence and the calculated results reproduce the experimental materials dependence of the strength of SC, which makes it possible to extract the universal properties and systematic trends as well.\n\n\n\n\n §.§ Doped CaCuO_2\n\n\n\nHere, we present the results of our calculation for the doped CaCuO_2 in the following order: \n\n(1) δ dependence of SC properties; especially, P̅^∞_d and the d-wave SC order parameter F^∞_ SC. (See the definitions in Sec. <ref>.) \n\n(2) Competition between the SC state and other competing states including stripe states.\n\n\n\n\n\n\n  §.§.§ Properties of superconducting phase\n \nFirst, we discuss the r dependence of the pairing correlation P_d(r) for L× L lattice and its long-ranged part P̅_d(L):\nFig. <ref> shows P_d(r) and P̅_d(L) for several choices of square-lattices with the linear size L from 24 to 36 and hole doping δ from 0.028 (2.8 %) to 0.247 (24.7 %).  \nFor each value of δ, we observe that P̅_d does not significantly depend on L, suggesting the existence of a strong SC long-range order in the thermodynamic limit in this ground-state candidate.\nThis is indeed confirmed by a size extrapolation, i.e., plot of P̅_d(L) as a function of 1/L to estimate P̅_d^∞ in the limit L →∞ via linear regression, as shown in the insets of  Fig. <ref>, panels (a) to (h). \nThe linear 1/L scaling was employed in Ref. ohgoe2020 and is expected to work because of Dirac-type linear dispersion for the quasiparticle excitation of the d-wave superconductor at the nodal points. \n\n\n\nAfter taking the size extrapolation to the thermodynamic limit, we show the δ dependence of the order parameter F_ SC^∞ calculated from Eq.(<ref>) and P̅_d^∞  = lim_L→∞P̅_d(L) in Fig. <ref> and the numerical values in Table <ref>. \nThis shows a rapid increase of F_ SC^∞ from 0 at δ=0 up to δ∼ 0.05 as a function of δ followed by a plateau around 0.05≤δ≤ 0.1 and monotonic decrease with further increasing δ above around 0.1 in the thermodynamic limit.\n\nThe dome structure ubiquitously observed for T_c in the cuprates is qualitatively similar to the δ dependence in F_ SC^∞, but the peak for F_ SC^∞ is located at somewhat lower δ∼ 0.05 than the case of experimental T_c, where the optimum δ is observed to be δ∼ 0.12 <cit.>. \n\nHowever, the monotonic decrease of F_ SC^∞ with increasing δ for δ≥ 0.1 is consistent with the universal trend of δ dependence of the SC gap identified from the angle-resolved photoemission spectra (ARPES) and the scanning tunnelling microscope (STM) of the cuprates in general <cit.>, though the SC gap in the experimental estimate contains an ambiguity associated with the contribution from the pseudogap.\n\n\n\nIn the mean-field picture, the SC gap is the product of the order parameter F_ SC^∞ and the effective attractive interaction. If we consider the experimentally observed maximum gap ∼ 50 meV <cit.> and F_ SC^∞∼ 0.13, the characteristic scale of attractive interaction is as large as ∼ 0.4 eV. \nThis imposes a constraint on theories for the SC mechanism.\n\nThe sharp increase of F_ SC^∞ between δ=0 and 0.05 and the subsequent dome structure are similar to the earlier study by a VMC and a cluster dynamical mean field study <cit.> for the Hubbard model, where rapidly increasing F_ SC from 0 at δ=0 already reaches F_ SC∼ 0.1  at δ=0.03 in the present notation.\nIn case of the Hubbard model, however, it was argued that the ground state is actually not SC but stripe-ordered states <cit.>.\n\n\n\n\n  §.§.§ Competition of SC, stripe, and antiferromagnetic states\n\n\nNow, we analyze the competition between the SC and other states.\nThe energies of the SC state and other states at L=24 are given in Fig. <ref>. \nWe see that the SC state has the lowest energy in the region from δ=0.05 to δ=0.25, indicating that the SC phase is dominant in the ground state of doped CaCuO_2. \nThe SC ground state, however, is severely competing with the C4S8, and C3S3-like stripe states, and AF-type state within the energy difference of 5-10 meV. \nHere, CmSn denotes the charge/spin ordered stripe state with the periodicity of m lattice spacing for the charge modulation and the period n for the spin order.\nReal space charge/spin configurations and spin/charge structure factors are explicitly illustrated in Sec. S2 of SM for the AF-like, C3S3-like and C4S8 states.\n\nFigures <ref> and <ref> in Appendix <ref> show size dependence of spin and charge structure factors.\nAlthough the demanding computation cost does not allow larger system calculation, the available size dependence supports that the AF states up to δ=0.16 and the C4S8 stripe state at finite doping around δ∼ 0.12 do have the long-range order as one can see in  Figs. <ref> (a) and <ref>, respectively. \nHowever, although the initial trial states are ordered mean-field states, long-ranged order seems absent or is very weak after the optimization in VMC for the C3S3 stripe states and seems replaced by well developed short-ranged correlations at δ 0. \nThis is the reason why we add “-like\" for the case of C3S3. \nThe AF and stripe states are in any case excited states of the SC ground states at δ≥ 0.05.\n\n\n\n\n\n\n\n §.§ Doped Hg1201 Compared with CaCuO_2\n\n\nNow, we present our results in the case of Hg1201, and compare it to CaCuO_2. \nIn this comparison, we find (i) the positive correlation between F_ SC^∞ and U/|t_1|, (ii) the relation T_c ^ opt∼ 0.16 |t_1|F_ SC^∞ from the comparison with the experimental T_c.\n\nPairing correlation for Hg1201 Hamiltonian and the size extrapolation are shown in Fig. <ref> for δ=0.146, indicating the existence of the SC long-range order. \nThe size of the order parameter is F_ SC^∞∼ 0.09 as compared with ∼ 0.116 for doped CaCuO_2 at δ∼ 0.12, respectively, which are both close to each optimal concentration. \nThe difference in F_ SC^∞ between Ca and Hg compounds can be compared with the difference in U/|t_1|=8.10 for CaCuO_2 and 7.35 for Hg1201. \nAs we discuss later, F_ SC^∞ rapidly increases with U/|t_1| if we monitor the effect of U/|t_1| beyond the ab initio value around U/|t_1|=7-8. \nTherefore, F_ SC^∞ amplifies the increase in U/|t_1| while effects of other parameters are minor: Namely, F_ SC^∞ should have a functional form F_ SC^∞(U/t_1,V_i/t_1,t_i/t_1) with 1≤ i ≤ 9 in general, but V_i/t_1 and t_i/t_1 dependencies are weak. \nThe difference of F_ SC^∞ in these two compounds is then ascribed to the difference in U/|t_1|. \n \nThe materials dependent F_ SC^∞ may also be compared with the difference in T_c ^ opt∼ 110K and 90 K for CaCuO_2 and Hg1201, respectively, because T_c may be proportional to the order parameter F_ SC^∞. Since T_c has the dimension of energy and should also be scaled by the overall characteristic energy scale t_1, T_c may be proportional to |t_1|F_ SC^∞. \nIn fact, the ratio of T_c ^ opt/|t_1|F_ SC^∞ as a non-dimensional quantity is ∼ 0.16(1) at the optimal doping δ∼ 0.12 for CaCuO_2 and ∼ 0.16(2) at the optimal point δ∼0.15 for Hg1201 as we show in Table <ref>, supporting the hypothesis that T_c ^ opt is universally given from the relation \n\n    T_c ^ opt∼ 0.16 |t_1|F_ SC^∞\n\nat the optimal doping.\n\n In the Uemura plot <cit.>, it was observed from the μSR measurement that T_c ^ opt is proportional to the ratio between the superfluid density n_s, here interpreted as F_ SC^∞/√(2), and the effective mass m^*. \n Since the mass enhancement from the bare band mass m_0, namely m^*/m_0 at the optimal hole density may be similar in the cuprates, T_c ^ opt is indeed expected to be roughly proportional to |t_1|F_ SC^∞ according to the Uemura plot, because the inverse band mass is essentially determined by the dominant transfer t_1.  \n In addition, n_s estimated from the relaxation rate σ∼ 2 μ s^-1 from the μSR measurement for the cuprates with T_c∼ 80-100 K corresponds to n_sm_0/m^* ∼ 4× 10^21 cm^-3.\n If we cut out the volume including one Cu atom with the c axis length ∼ 6 Å as in <cit.> irrespective of the unit cell volume to compare with F_ SC^∞ defined as the value per Cu atom, this corresponds to F_ SC^∞∼ 0.10 by considering the definition F_ SC^∞=√(2)n_s and m^*/m_0∼ 5 assumed in Ref. Uemura1989. \n Then it is also quantitatively consistent with the present result of F_ SC^∞∼ 0.10 at the optimum doping. \n These indicate that our results indeed capture the realistic situation more or less quantitatively. \n We will show in Sec. <ref> that F_ SC^∞ also agrees with the estimate from the angle resolved photoemission spectra (ARPES) in case of Bi2212 and Bi2201.\n\n\n\n\n\n\n\n\n §.§ Doped Bi2201 and Bi2212\n\n\nIn this subsection, we discuss ab initio results for Bi2212 and Bi2201 and compare them each other.  Unfortunately, in these two compounds, an uncertainty exists in the experimental crystal parameters that causes the uncertainty in the effective Hamiltonian parameters as well. Especially, the distance d^z_ Oap between an apical oxygen and the nearest Cu atom is not fully precisely determined and the available experimental data have considerable variations <cit.>. This uncertainty is also related to the structural distortion and long-period modulation of the CuO_2 plane arising from the effect from the BiO layer <cit.> as we discuss in Sec. <ref>. \n Recent ab initio studies have clarified that this uncertainty leads to possible variety of effective Hamiltonian parameters, especially owing to the variation of the apical oxygen position <cit.>. \n \n In principle, the structural optimization in ab initio calculations is desired to predict the stable atomic position. However, such an optimization in strongly correlated electron systems is at the moment not necessarily accurate enough and we leave this task for future studies. Instead, in this paper, we admit a range of Hamiltonian parameters and discuss the consequence. \n \n As analyzed in Ref. moree2022, the apical oxygen position sensitively affects the effective Hamiltonian parameters, primarily the value of U. For Bi2212, the value U∼ 4.2 eV in Table <ref> is intermediate and the uncertainty range is between 4.0 and 4.7 eV for U by considering that d^z_ Oap may range from 2.25 Å to 2.45 Å. On the other hand, the value U∼ 4.4 eV for Bi2201 in Table <ref> is the upper bound and the uncertainty ranges from U∼ 4.4 eV to 3.5 eV by considering that d^z_ Oap may range from d^z_ Oap= 2.6 Å to 2.45 Å. \n We first present in Secs. <ref> and <ref> the results obtained from the parameters shown in Table <ref>, namely U=4.2 eV for Bi2212 and U=4.4 eV for Bi2201 and then discuss in Sec. <ref> the possible range of SC properties originating from this uncertainty later.\n\n\n\n\n  §.§.§ Bi2212\n\nWe begin with the results for Bi2212.\nFig. <ref> shows P_d(r) and P̅_d(L) at δ  = 0.167 for L from 16 to 36 by switching off the interlayer transfers and interactions. Namely we first show the results obtained by solving the single-layer Hamiltonian despite the actual two-layer unit cell of Bi2212.  \nSimilarly to CaCuO_2, we identify a SC ground state with large P̅_d and it does not change significantly by increasing L, where the size extrapolation gives P̅_d^∞∼ 0.0151 as shown in the inset of Fig. <ref>, which corresponds to a SC order parameter F_SC^∞∼ 0.12. \nThis relatively strong value of F_SC^∞ is understandable, because the U/|t_1| ratio has a value of U/|t_1| ∼ 9.4, which is the strongest among all four considered compounds.\nAgain the enhanced F_SC^∞ originates from the larger U/|t_1| in accordance with the observation in the comparison of Hg1201 and CaCuO_2 in Sec. <ref>.\nThis large F_SC^∞ is also consistent with the high T_c (up to ∼ 100 K) <cit.>.\nWe will discuss more involved aspect in Sec. <ref>. \n\n\n\n\nThe competition with other phases are seen in δ dependence of the total energy shown in Fig.<ref> in Appendix <ref>. \nSimilarly to CaCuO_2, the SC state is the ground state in most of the doping concentration, while it is severely competing with spin/charge ordered states.\n\nNow, we extend the calculation by switching on the interlayer terms and solve the two-layer Hamiltonian obtained in Ref. moree2022 to examine the effects of interlayer coupling.  \nFor the calculations  we take two identical layers (in terms of intralayer parameters for t_ij, V_i, and U where i and j are intralayer combination), coupled by the interlayer terms listed in Table <ref>.\nThe interlayer contributions are restricted to the leading interlayer hopping term of size t_0^l= -0.098 eV and nearest- and next nearest neighbor interlayer interaction of size  V_0^l = 0.643 eV and V_1^l = 0.463 eV.\nSee Ref. <cit.> for more details.\nA comparison between the single- and two-layer cases of P_d(r) for L = 16 and δ = 0.167 is shown in Fig. <ref>. \nWe see that the long-range average of P_d( r) in the two-layer case is close to that of P_d( r) in the single layer case, which demonstrates that P_d( r) is not significantly affected by the interlayer Coulomb interaction and hopping parameters.\nIndeed, for the single layer we found a long range average of the SC correlation function of  P̅_d^single = 0.0225, while for the two-layer compound the average is P̅_d^two = 0.0213. \nThe corresponding values of the SC order parameter are F_SC^single,∞=0.150 and F_SC^two,∞=0.146, which differ by only ∼ 2.8%.\nThe essentially same behavior between the single- and two-layer cases may not depend on the system size in accordance with the result of a two-layer Hubbard model at the optimum doping <cit.>.\nThis similarity may be attributed to (i) the relatively small leading interlayer hopping parameter of t_0^l = -0.098 eV and also (ii) the robustness of the SC solution against the interlayer Coulomb interaction parameter, because the pairing occurs essentially only within a layer.\n\n\n\n\n\n\n  §.§.§ Bi2201\n\n\nIn the case of Bi2201, we again solve the single-layer Hamiltonian. \nThe competition with other phases are seen in δ dependence of the total energy shown in Fig.<ref> in Appendix <ref>.\n\nFig. <ref> shows P_d(r) and its extrapolation to the thermodynamic limit, which suggests the stable long-ranged SC order. \nAgain, the obtained value F_ SC^∞∼ 0.10 is consistent with the rule that larger U/|t_1| leads to larger F_ SC^∞ because U/|t_1| is the second largest among the four materials in the estimate shown in Table <ref>.\nThe smaller U/|t_1| relative to Bi2212 leads to weaker SC. \nHowever, on a more quantitative aspect, we need to be careful about the uncertainty of the Hamiltonian parameter. We will discuss this issue below.\n\n\n\n\n  §.§.§ Effect of structural uncertainty on possible variation of SC properties\n\n\nSince we have the uncertainty of the Hamiltonian parameters particularly for the interaction as we discussed above, we here monitor the effects of modifying the effective interactions for Bi2212 and Bi2201, which well represent the effect of variant apical oxygen position as shown in Appendix C of Ref. <cit.>. \nNamely, Table <ref> with preserved transfer parameters fixed at each ab initio value, together with interaction scaling represents most of the effect of the apical oxygen shift and we scale the Hamiltonian (<ref>) such that\n\n    ℋ(α,ξ)    = H_kin + α   H_U  + ξ   H_V,\n\nwhere α=ξ=1 represents the ab initio case given in Table <ref>, α scales the onsite Coulomb interaction term H_U, and ξ scales the remaining offsite interactions V_i. \nSince the apical oxygen shift alters the interaction parameters in the way α∼ξ <cit.>, we examine the dependence on α=ξ below.\n\nFigures <ref> (a) and (b) show the size scaling and α=ξ dependence of P_d^∞ for Bi2212 and Bi2201 at δ=0.167, which is close to the experimental optimum doping.\nFurther details are given in Sec.IV of SM.\nFigure <ref> (c) shows the corresponding α=ξ dependence of the SC order parameter F_ SC^∞.\nFor Bi2212, by taking the realistic uncertainty range 4.0 eV ≤ U ≤ 4.7 eV (corresponding to 0.95≤α = ξ≤ 1.1) obtained from 2.25 Å   ≤ d_ Op^z ≤ 2.45 Å, we find the range of 0.011 ≲ P_d^∞≲ 0.015, namely 0.10 ≲ F_ SC^∞≲ 0.12. \nOn the other hand, the uncertainty for Bi2201 obtained from 2.45 Å ≤ d_ Op^z ≤ 2.6 Å  leads to 3.5 eV ≤ U ≤ 4.4 eV (corresponding to 0.8≤α = ξ≤ 1.0), which results in 0.00017 ≲ P_d^∞≲ 0.0094 (0.013 ≲ F_ SC^∞≲ 0.10). \nThe lower bound for Bi2201 causes a fatal damage to the SC order. \n\n\n\nTable <ref> summarizes the size-extrapolated P̅_d^∞ and corresponding F_SC^∞ for the two Bi compounds when we use the Hamiltonian parameters listed in Table <ref> and when admit uncertainty range of the interaction parameters for Bi2212 and Bi2201. \nThe scaling Eq.(<ref>) proposed for CaCuO_2 and Hg1201 are also valid in the Bi compounds and the experimental T_c^ opt is within the inferred range. \nWe conclude that its materials dependence is well captured for the four studied materials (see also Fig. <ref> in Sec. <ref>).\n\n\n \nWe realize that the fragility and diversity of T_c ^ opt experimentally observed in the range 10<T_c ^ opt<40 K for Bi2201 is accounted for by the range of actual apical oxygen position. \nThis range may be caused by the type of dopant atoms, impurities, and the spatial inhomogeneity caused by the supermodulation, which may depend on samples and the amplitude of the modulation. \nIn fact, it was observed that the d_ Op^z periodically varies as much as 6% in accordance with the supermodulation for Bi2212 and a comparable modulation may exist for Bi2201 as well, which can be the origin of the experimental uncertainty <cit.>. \nThe basic origin of this diversity and relatively low T_c among the four families of compounds is attributed to relatively small U/|t_1| in the lower uncertainty range, at which the SC order becomes sensitively damaged by a slight decrease of U/|t_1|. \nWe discuss more general aspects of the interaction dependence in Sec. <ref>.\nEven when we admit the uncertainty range, the general trend about the weaker SC of Bi2201 than those of Bi2212 are well explained by this ab initio results. It can also safely be addressed that Bi2212 has one of the strongest SC and T_c ^ opt among the four families comparably to CaCuO_2.\n\n\n\n\n§ RESULTS BEYOND AB INITIO: INTERACTION DEPENDENCE OF SUPERCONDUCTING ORDER\n\n\n \n We now study SC properties beyond the ab initio results.  Ab initio results in the last section successfully reproduce the experimental trend and have revealed that U/|t_1| is the principally important Hamiltonian parameter to control the SC order parameter. \nTherefore, it is intriguing to examine the optimum Hamiltonian parameters to maximize the order parameter and hence the optimum T_c beyond the existing materials for the purpose of materials design to seek for higher T_c superconductors.   \nWe present U/| t_1| dependence of F_ SC as well as dependence on offsite interaction when tuning the interaction parameters artificially away from the ab initio value while keeping transfer parameters fixed at ab initio values. We here take an example of CaCuO_2 Hamiltonian at δ=0.167 and monitor the effect of α and ξ dependencies defined in Eq. (<ref>).\n \nWe examine three types of scaling to go beyond the ab initio Hamiltonian: (i) Scale only the onsite Coulomb interaction by α with fixed ξ = 1.0 (ℋ(α, 1.0)), (ii) Scale the full interaction part equally by using α = ξ (namely, ℋ(α, α)), and (iii) Fix α = 1.2 and scale the intersite Coulomb interaction uniformly via ξ by employing ℋ(1.2, ξ), by considering the fact that (ii) shows the maximum SC order at α=ξ=1.2. \nFor the cases (i) and (ii) we chose scaling values α ranging from 0.6 up to 4.0 while for the third case the range from 0.0 to 2.0 is chosen.  \nSince the size dependence is not appreciable, we study L=24 lattice.\nThe SC order parameter F_ SC are shown  in Fig. <ref> (a) at δ = 0.167 hole doping. \n\nThe results show that the SC order parameter can be enhanced with the amount of around 30% from the ab initio value when the interaction parameter is tuned to α∼ 1.2 for (i) and around 20% at α=ξ∼ 1.2 for (ii), which may allow T_c ^ opt as much as ∼ 130–140 K, when compared to the ab initio results for CaCuO_2.\n\nIn the tuning (iii), we find that the order parameter further increases up to F_ SC^∞∼ 0.22 by decreasing ξ, which is twice as large as the ab initio case.\nHowever, we keep in mind that onsite and offsite interactions cannot independently be controlled in the usual experimental conditions. The present result offers a guide to enhance the SC in designing artificial structure and metamaterials including surface and interface, where quicker screening of the offsite interaction is desirable by keeping the onsite interaction at the optimal value (in this case α=1.2).\n\nAnother limitation to be considered is the competition with the stripe and AF order.\nAs far as we restrict the onsite interaction within the ab initio range, the SC energy is always lower than that of the stripe state as one sees in Fig. <ref> (b).\nHere, we show the competition with the C4S8 because it is established that the most severe competitor is the C4S8 state.\nHowever, the decreasing of energy difference, such as at (α=1.2, ξ=0), where the difference is ≤ 2 meV, may result in the thermal destruction of the SC order.\nFor ξ≥ 0.2 the SC is still a stable ground state, while at small ξ, F_ SC becomes nearly the twice of the ab initio value for the doped CaCuO_2.\n\n \n\nThe order parameter decreases when U/|t_1| is too large as we see in Fig. <ref> (a). \nThis reduction was already pointed out on the level of the Hubbard model <cit.>. \nAlthough the asymptotic behavior in the limit U/|t_1|→∞ is not clear, the reduction itself may be easily understood from the suppression of charge fluctuation with increasing U/|t_1|, which also suppresses the quantum entanglement caused by the suppression of both spin singlet fluctuation and dynamical exciton generation as was reported in the literature <cit.>.\nIt was pointed out that the enhanced quantum entanglement can be achieved by the fractionalization of electrons <cit.>, which may be maximaized at the optimum U/|t_1|. \n\n\n\n§ DISCUSSION\n\n\n\nBy assuming the same ratio T_c /(|t_1|   F_ SC^∞) ∼ 0.16 with CaCuO_2 and Hg1201, we can infer the range of T_c arising from the uncertainty of the apical oxygen position and resultant uncertainty of U/|t_1| listed in Table <ref>.  \nThe range of inferred T_c listed in Table <ref> for Bi2212 is consistent with the experimentally observed range of T_c ^ opt each other within the error bars. \nThis suggests that the sample dependence of T_c ^ opt may be accounted for by the sample dependence of the apical oxygen position.\n\nWe note that the order parameter F_ SC^∞∼ 0.10 obtained here for Bi2212 and Bi2201 also shows consistency with the result obtained by using the machine learning of the angle-resolved photoemission spectroscopy data for Bi2212 and Bi2201, respectively, at the optimum doping <cit.>, which gave ⟨ c_k↑c_-k↓⟩∼ 0.065 at the antinodal point for Bi2212 and the momentum averaged value ∼ 0.063 for Bi2201 at the optimum doping. \nThese are translated commonly to F_ SC^∞∼ 0.09 in the present definition of F_ SC^∞ because of the relation F_ SC^∞=√(2)⟨ c_k↑c_-k↓⟩.\n\nIn the case of Bi2201, the estimated 0.16 |t_1| F_ SC^∞ is also listed in Table <ref>. The comparison with the sample dependence of experimental T_c suggests that the true apical oxygen position is distributed near the lower bound d^z_ Op∼ 2.45Å, if it is spatially uniform. Alternatively if the supermodulation exists, the lower bound of  d^z_ Op in the modulation may be close to 2.45 Å, because it governs the SC order as the bottleneck.\nIt is desired to test this inference by precise and simultaneous measurements of the relation between T_c and d_ Oap^z for Bi2212 and Bi2201.\n\nThe order parameter F_ SC^∞ increases with decreasing hole doping for δ>0.05 as we find in Fig. <ref>, which follows the same trend as the SC gap as we discussed, but is slightly different from the dome structure known for T_c in the cuprates, where the peak of the dome is located at higher δ. Complete and quantitative understanding of this different trend is not the scope of this paper and is left for future studies. However, the origin of this difference can be inferred to be attributed to the increasing damping and incoherence of electrons in the underdoped region toward the metal-insulator transition as was analyzed before <cit.>, which is represented as the enhanced self-energy of the normal electrons toward the Mott insulator. \nIn Appendix <ref>, we show a qualitative difference of the momentum distribution between the optimal and underdoped hole concentrations, which suggests a signature of the increased damping at lower carrier concentration within the present ab initio study.\n\nThe δ dependence of the energy decomposed to the kinetic, onsite and offsite interaction energies are analyzed in Appendix <ref>. \nIt should be noted that the onsite interaction energy E_U=⟨ℋ_U ⟩ has a convex curvature as a function of δ, which contributes to the effective attraction of electrons despite the original strong repulsion U. \nThe local effective attraction may cause the Cooper pairing as well as the stripe formation. It was pointed out that the convex curve of the local energy generates bistable excitations, one in the underdoped side and the other in the overdoped side, inducing the electron fractionalization and the enhanced quantum entanglement through the quantum tunnelng of the two excitations <cit.>.\n\nThe importance of the apical oxygen position has been pointed out from various viewpoints <cit.>. \nIn this paper, we have elucidated the crucial role of controlling U in general in the single-band description, which quantitatively explain the variation of T_c^ opt and its uncertainty in the Bi compounds. \nIn addition, the modulation of the SC gap with the modulation of the apical oxygen position in Bi2212 has indicated that the longer d_ Oap^z induces the smaller SC gap <cit.>. \nThis is consistent with the trend of F_ SC^∞, which decreases when α  is increased in the realistic range as shown in Fig. <ref>. \nThis indicates that Bi2212 is located already slightly above the peak in the α dependence of F_ SC^∞, which corresponds to α=1.2 for doped CaCuO_2 shown in Fig. <ref>. \nThe present observation is also in accordance with the effect observed by laser irradiation aiming at the displacement of the apical oxygen position <cit.>. \nThe control of d_ Oap^z if possible in a spatially uniform fashion may help to optimize the SC in which the disturbance and pair breaking by the randomness caused by the inhomogeneous supermodulation in the case of the Bi compounds could be avoided.\n\n\n\n§ SUMMARY AND CONCLUSIONS\n\n\nWe have studied the superconductivity in the ab initio Hamiltonians for CaCuO_2, Hg1201, Bi2201, and Bi2212 derived by using the experimental crystal structure in Ref. moree2022 without adjustable parameters . \nThe dominance of SC order against severely competing stripe states and  antiferromagnetic state in a wide range of hole concentration are shown in the solutions for the ground state of all four materials obtained from the variational Monte Carlo calculations, which agrees with the experimental results. \n\nThe SC order parameter F_ SC^∞ at the optimal doping shows consistency with the superfluid density measured in the muon spin resonance\nand the machine learning analysis of the ARPES data for Bi2212 and Bi2201. F_ SC^∞ decreases with increasing doping for the doping concentration δ>0.05, showing a similarity to the SC gap reported in the STM and ARPES measurements. On the other hand, F_ SC^∞ quickly decreases to zero toward δ=0 for δ<0.05 forming a dome structure which has a similarity to experimental T_c, but the dome peak appears at slightly lower δ for the calculated F_ SC^∞. \nThis may be attributed to the reduced renormalization factor suggested by the broadened momentum distribution.\n\nFrom the comparison of the four materials, we have revealed that U/|t_1| is a crucial parameter to control the strength of the SC order; larger U/|t_1| materials show larger SC order parameter F_SC^∞ in the realistic materials. \nThis explains that T_c and the SC gap at the optimum doping is larger for CaCuO_2 than Hg1201, where T_c ^ opt is well scaled by | t_1 |  F_ SC^∞ as T_c ^ opt∼ 0.16   | t_1 |   F_SC^∞. \nThough the experimental uncertainty in the crystal structure prohibits a quantitative comparison, F_ SC^∞ is also larger for Bi2212 than Bi2201 at least qualitatively, in agreement with the experimental indications. \nWhen we apply the same scaling T_c^ opt∼ 0.16   | t_1 |   F_ SC^∞ to the two Bi compounds with the calculated order parameter, it also well explains the experimental sample dependence of T_c. The strong dependence of F_ SC^∞ on U/|t_1| for real materials are summarized in Fig. <ref>: In the range of 7.0≤ U/|t_1|≤ 8.0, F_ SC^∞ sharply increases and the calculated sensitive materials dependence of  F_ SC^∞ is well captured within this range. \nThe good scaling of T_c^ opt by 0.16 |t_1| F_SC^∞ is also summarized in Fig. <ref>, which indicates that the detailed difference of U/|t_1| within the range of 7<U/|t_1|<9 in the ab initio parameters reproduces the diverse materials dependence of T_c^ opt. \nSince the larger variance for the theoretical prediction on Bi2201 is ascribed to the experimental uncertainty of the apical oxygen, it is desired to precisely determine the apical oxygen position in the experiments. \n\n\n\nBased on the successful reproduction of the materials dependent properties, the underlying superconducting mechanism is identified by the effective local attraction emerging from the Mottness, which converts the original strong repulsion to the attraction.  \n\nThe SC order parameter has the maximum above the ab initio values of U/|t_1| at 20% larger value of U/|t_1| with the enhancement of 20-30 %. If one can control onsite and offsite interaction independently, further optimization of the SC order parameter as much as the factor two larger value  beyond the available compounds synthesized so far without falling into other competing states can be achieved as the theoretical maximum value in the present mechanism. \nBy increasing |t_1| as well as the whole parameter values uniformly, T_c^ opt should obviously increase accordingly. \nThese offer a clue for the materials design in the future.  \n\n\n\n§ ACKNOWLEDGEMENTS\n\nThis work was supported by MEXT as “Program for Promoting Researches on the Supercomputer Fugaku\" (Basic Science for Emergence and Functionality in Quantum Matter–Innovative Strongly-Correlated Electron Science by Integration of “Fugaku\" and Frontier Experiments–, JPMXP1020200104) and used computational resources of supercomputer Fugaku provided by the RIKEN Center for Computational Science (Project ID: hp200132, hp210163, and hp220166).\nPart of the computation was done using the facilities of the Supercomputer Center, the Institute for Solid State Physics, the University of Tokyo.\nWe also acknowledge the financial support of JSPS Kakenhi Grant No. 16H06345 and No. 22H0115500.\n\n\n\n\n\n\n\n\n\n\n\n§ LANCZOS METHOD AND RESTRICTED BOLTZMANN MACHINE PROCEDURE\n\n\n\n\n §.§ Lanczos method\n\nTo further improve the accuracy of the VMC calculations or the variance extrapolation of the competing ground state candidates, we apply the Lanczos method <cit.>.\nTo do so the optimized mVMC wavefunction |Ψ⟩ is extended by\n\n    |ψ_n⟩ = ( 1 + ∑_n = 1^M α_n ℋ^n ) |Ψ⟩.\n\nThe factor in front of |Ψ⟩ can be regarded as an additional projection operator with variational parameters α_n, which–when chosen appropriately–further reduce the energy. \nAlthough one could systematically improve the wavefunction by increasing M, the computational cost increases exponentially with M, too. \nHence we employ the Lanczos method only up to the first step (n=1) within this work. \n\n\n\n §.§ Restricted Boltzmann machine procedure\n\nTo further improve the mVMC wavefunction we apply a restricted Boltzmann machine as a variational wavefunction |Ψ⟩, as firstly suggested in Ref. carleo2017. \nHere we follow the notations given in Refs. <cit.>.\nThe variational wavefunction including RBM takes the following form\n\n    |Φ⟩ = 𝒫^G𝒫^J𝒫^dh𝒩|ϕ^pair⟩,\n\nwhere 𝒩 is the additional RBM correlator. \nThe RBM correlator\n\n    𝒩   = ∏_k 2 cosh( b_k + ∑_i W_ikσ_i) ×e^∑_i a_i σ_i\n\nintroduces the additional variational parameters h_i (hidden layer), a_i (visible layer), and W_ik (network).  \n\nIn practice we apply the additional RBM projection after the wavefunction was already optimized via mVMC, i.e., the variational parameters of the optimized wavefuction |ϕ⟩ = 𝒫^G𝒫^J𝒫^dh|ϕ^pair⟩  are kept fix during the RBM procedure. \n\nThe accuracy of the wavefunction depends on the number of hidden and visible parameters (N_h, N_v) <cit.>. \nHence we can define a hidden variable density as  α_ RBM = N_h/N_v as measure for the accuracy. \nNote that the number of RBM variational parameters increases with α, too.\n\nWithin this work the RBM procedure was applied with α_ RBM = 4.\n\n\n\n\n§ VARIANCE EXTRAPOLATION PROCEDURE\n\n\nThe total energy per site E/N=⟨ℋ|/⟩N is calculated after the variance extrapolation.\nThe true ground state as a function of the variance (δ E)^2 = (⟨ℋ^2|-⟩⟨ℋ|^⟩2)/⟨ℋ|^⟩2, is obtained by taking the limit δ E→ 0, because the true eigenstate satisfies δ E=0 <cit.>. \nIf several different states such as SC, spin- and charge-ordered as well as normal metallic states are competing, the ground state is determined from the lowest energy state after the variance extrapolation.\nIn practice, the variance extrapolation is a linear regression of the energies per site E/N (e.g. obtained from combinations of mVMC, Lanczos, or RBM) over the variance δ E for a specific state, to approximate the zero variance value of the energy. \n\n\nAs an example the variance extrapolation for δ = 0.167 in CaCuO_2 is shown in Fig. <ref>.\nFrom the inset we confirm the lowest energy of the SC state with severely competing AF and stripe states very close to it (the difference is around 5 meV). \nHowever,  the overlap of the error bars is small and in comparison to AF, C4S8 and C3S3 states, the SC state definitely has lower energy.\n\n\n\n§ THERMODYNAMIC LIMIT OF THE TRIAL WAVEFUNCTION AFTER OPTIMIZATION FOR CACUO_2\n\n\n\nHere we discuss the stability of the AF, C3S3, and C4S8 state in the thermodynamic limit for CaCuO_2.\nTo do so, each state is stabilized on different lattice sizes and the spin- and charge structure factors (S_s( q) and S_c( q)) are calculated. \n\nWe plot S_s( q) as a function of 1/L or 1/L^2 depending on the cases of the presence or absence, respectively, of the AF order by following the convention and perform a linear extrapolation.\nThe result is shown in Fig. <ref>, where in (a) the peak height of the spin structure factor follows a linear trend with a nonzero offset, indicating a stable long-ranged AF order.\nIn panel (b), the peak of the spin structure is scaled to zero in the thermodynamic limit, which indicates the absence of the long-ranged AF order in the SC state at this doping. \nWe did not find the coexistence of the SC and AF order at other doping, either.\n\n\n\nThe size scaling of the charge-stripe states is shown in Fig. <ref>. \nAlthough the plot of the size dependence is not sufficient due to very demanding computational cost for larger sizes, the trend suggests that only the C4S8 state shows a clear long-ranged order of spin and charge at around δ=0.125 in the thermodynamic limit.\nThe C3S3 state seems to collapse to a paramagnetic state at the chosen doping of δ = 0.207, at which C3S3 has relative stability. \nHence we use the labeling “C3S3-like\" instead of C3S3 in the main text. \nWe do not go into details of the size dependence for the stripe-like states, because they are in any case excited states.\n\n\n\n\n\n§ ANALYSIS OF Δ DEPENDENCE OF ENERGY\n\n\nIn Fig. <ref> the total energy per site E_ tot and the onsite Coulomb part E_U (see panel (a), (c) respectively) are shown for doped CaCuO_2.\nEach energy contribution is subtracted by a linear function F(δ) =   b_0 + b_1 δ for better visibility, where b_0 and b_1 are listed in Table <ref> (see gray lines in (a), (c)) and are shown in (b), (d). \nThe subtracted energies are fitted by a quadratic function 𝒫(δ) =  c_0 + c_1 δ + c_2 δ^2 to examine the curvature. \nExplicit values of the parameters are given in Table <ref>.\n\nThe result shows that the total energy is concave as a function of δ of course, which is required from the thermodynamic stability, while only E_U exhibits convex behavior with c_2<0. Because the effective particle interaction is given by the δ^2 term, we find that the local quantity E_U is the origin of the attraction while the nonlocal energies contribute to c_2>0 in the total energy ensuring the thermodynamic stability. \nThis supports the idea that the local strong correlation (repulsion) called Mottness turns to originate the effective attraction of the electrons, which is the underlying mechanism of both of the Cooper pairing and charge segregation such as the stripes. \nThe attraction is understood from the following Mottness: The local energy is retained high in the Mott insulator because of U. However, if the carrier is doped, this is released by acquiring the itinerancy in a nonlinear fashion as a function of δ which yields c_2<0 and the attraction. \n\n\n\n\n\n\n\n§ INTERLAYER CONTRIBUTIONS FOR BI2212 \n\n\nThe effective interlayer Hamiltonian parameters for Bi2212 are shown in Table <ref>, where V^l_n is the interlayer Coulomb interaction, and  t^l_n the interlayer hoppings. \nAs defined in Ref. moree2022, the notation n=0 represents the interaction or hopping between interlayer nearest-neighbor Cu atoms (located one above the other), and n ≥ 1 represents the interaction or hopping between a Cu atom and its (n+1)^ th interlayer nearest-neighbor (located above or below its intralayer n^ th nearest-neighbor).\n\n\n\n§ DOPING DEPENDENCE OF ENERGY FOR BI2201 AND BI2212\n\n\n\nThe energy per site as a function of δ and the competition of SC, stripe and AF states is shown in Fig. <ref> for Bi2212 and Fig. <ref> for Bi2201. \n\n\n\n\n\n\n\n§ ANALYSIS ON MOMENTUM DISTRIBUTION\n\n\n\nWe show calculated momentum distribution defined by \n\n    n( k)=1/2N∑_i,j,σe^ik( r_i- r_j)⟨ c_i σ^†c_j σ⟩,\n\nbecause the jump or singularity of n( k) at the Fermi level characteristic of metals measures the incoherence of the carrier. \nHere we show n( k) for the case of doped CaCuO_2 in Fig. <ref> for the cases of δ = 0.028 ((a),(f)), 0.045 ((b),(g)), 0.101 ((c),(h)), 0.125 ((d),(i)), and δ=0.167 ((e),(j)) in the SC state on the L=24 square lattice.  \nAlthough F_ SC^∞ is similar between δ=0.028 (or 0.045) and δ=0.101 (or 0.125), n( k) shows substantially more smooth and rounded shape for δ=0.028 and 0.04 than δ=0.101 and 0.125, demonstrating that the effect of the larger normal damping at smaller δ is responsible for this rounded behavior.\nThe substantial increase in the damping with decreasing doping may be responsible for the suppression of T_c in the underdoped region irrespective of the high F_ SC^∞. More quantitative studies will be presented elsewhere. \nIn SM Fig. S7, we show the case of δ=0.028 and δ=0.167 on the L=36 square lattice to ensure that the size dependence is weak.\n \n\napsrev4-2\n\n64\n\tfxundefined [1]\n\t\tifx#1\n\t\n\tfnum [1]\n\t\t#1firstoftwo\n\t\tsecondoftwo\n\t\t\n\tfx [1]\n\t\t#1firstoftwo\n\t\tsecondoftwo\n\t\t\n\t\n\t\n\t\n\t\n\t\n\tnoop [0]secondoftwo\n\t\n\tref[1]@startlink#1@href\n\thref[1]#1@endlink\n\tanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\n\tstartlink[1]\n\tendlink[0]\n\t\n\trl [1]href #1\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t@bib@innerbibempty\n\t\n\t[Corboz et al.(2014)Corboz,\n\t\tRice, and Troyer]PhysRevLett.113.046402\n\tauthor author P. Corboz, author T. M. Rice,\t\tand author M. Troyer, https://doi.org/10.1103/PhysRevLett.113.046402 journal\n\t\tjournal Phys. Rev. Lett. volume 113,\t\tpages 046402 (year 2014)NoStop\n\t[Hu et al.(2012)Hu,\n\t\tBecca, and Sorella]PhysRevB.85.081110\n\tauthor author W.-J. Hu, author F. Becca, and\t\tauthor S. Sorella, https://doi.org/10.1103/PhysRevB.85.081110 journal journal Phys. Rev. B volume 85, pages 081110(R) (year 2012)NoStop\n\t[Zhao et al.(2017)Zhao,\n\t\tIdo, Morita, and Imada]zhao2017\n\tauthor author H.-H. Zhao, author K. Ido, author S. Morita, and author\n\t\tM. Imada, https://doi.org/10.1103/PhysRevB.96.085103 journal journal Phys. Rev. B volume 96, pages 085103 (year 2017)NoStop\n\t[Zheng et al.(2017)Zheng,\n\t\tChung, Corboz, Ehlers,\n\t\tQin, Noack, Shi,\n\t\tWhite, Zhang, and Chan]doi:10.1126/science.aam7127\n\tauthor author B.-X. Zheng, author C.-M. Chung,\n\t\tauthor P. Corboz, author G. Ehlers, author\n\t\tM.-P. Qin, author R. M. Noack, author H. Shi, author S. R.\t\t\tWhite, author S. Zhang, and author G. K.-L. Chan, https://doi.org/10.1126/science.aam7127 journal journal Science volume\n\t\t\t358, pages 1155 (year 2017)NoStop\n\t[Darmawan et al.(2018)Darmawan, Nomura, Yamaji, and\t\tImada]darmawan2018\n\tauthor author A. S. Darmawan, author Y. Nomura,\n\t\tauthor Y. Yamaji, and author M. Imada, https://doi.org/10.1103/PhysRevB.98.205132 journal journal Phys. Rev. B volume 98, pages 205132 (year 2018)NoStop\n\t[Ido et al.(2018)Ido,\n\t\tOhgoe, and Imada]ido2018\n\tauthor author K. Ido, author T. Ohgoe, and\t\tauthor M. Imada, https://doi.org/10.1103/PhysRevB.97.045138 journal journal Phys. Rev. B volume 97, pages 045138 (year 2018)NoStop\n\t[Xiao et al.(2023)Xiao,\n\t\tHe, Georges, and Zhang]PhysRevX.13.011007\n\tauthor author B. Xiao, author Y.-Y. He,\n\t\tauthor A. Georges, and author S. Zhang, https://doi.org/10.1103/PhysRevX.13.011007 journal journal Phys. Rev. X volume 13, pages 011007 (year 2023)NoStop\n\t[Marino et al.(2022)Marino,\n\t\tBecca, and Tocchio]10.21468/SciPostPhys.12.6.180\n\tauthor author V. Marino, author F. Becca, and\t\tauthor L. F. Tocchio, https://doi.org/10.21468/SciPostPhys.12.6.180 journal\n\t\tjournal SciPost Phys. volume 12,\t\tpages 180 (year 2022)NoStop\n\t[Yokoyama et al.(2013)Yokoyama, Ogata, Tanaka, Kobayashi, and Tsuchiura]yokoyama2013\n\tauthor author H. Yokoyama, author M. Ogata,\n\t\tauthor Y. Tanaka, author K. Kobayashi, and author H. Tsuchiura, https://doi.org/10.7566/JPSJ.82.014707 journal journal J. Phys. Soc. Jpn. volume 82, pages 014707 (year 2013)NoStop\n\t[Ohgoe et al.(2020)Ohgoe,\n\t\tHirayama, Misawa, Ido,\n\t\tYamaji, and Imada]ohgoe2020\n\tauthor author T. Ohgoe, author M. Hirayama,\n\t\tauthor T. Misawa, author K. Ido, author\n\t\tY. Yamaji, and author\n\t\tM. Imada, https://doi.org/10.1103/PhysRevB.101.045124 journal journal Phys. Rev. B volume 101, pages 045124 (year 2020)NoStop\n\t[Nilsson et al.(2019)Nilsson, Karlsson, and Aryasetiawan]PhysRevB.99.075135\n\tauthor author F. Nilsson, author K. Karlsson,\t\tand author F. Aryasetiawan,\thttps://doi.org/10.1103/PhysRevB.99.075135 journal\n\t\tjournal Phys. Rev. B volume 99,\t\tpages 075135 (year 2019)NoStop\n\t[Morée et al.(2022)Morée, Hirayama, Schmid, Yamaji, and Imada]moree2022\n\tauthor author J.-B. Morée, author M. Hirayama,\n\t\tauthor M. T. Schmid, author Y. Yamaji, and author\n\t\tM. Imada, https://doi.org/10.1103/PhysRevB.106.235150 journal journal Phys. Rev. B volume 106, pages 235150 (year 2022)NoStop\n\t[Weber et al.(2012)Weber,\n\t\tYee, Haule, and Kotliar]Weber_2012\n\tauthor author C. Weber, author C. Yee, author K. Haule, and author\n\t\tG. Kotliar, https://doi.org/10.1209/0295-5075/100/37001 journal journal Europhysics Letters volume 100,\t\tpages 37001 (year 2012)NoStop\n\t[Watanabe et al.(2021)Watanabe, Shirakawa, Seki, Sakakibara, Kotani, Ikeda, and\t\tYunoki]PhysRevResearch.3.033157\n\tauthor author H. Watanabe, author T. Shirakawa,\n\t\tauthor K. Seki, author\n\t\tH. Sakakibara, author\n\t\tT. Kotani, author H. Ikeda, and author S. Yunoki, https://doi.org/10.1103/PhysRevResearch.3.033157 journal\n\t\tjournal Phys. Rev. Res. volume 3,\t\tpages 033157 (year 2021)NoStop\n\t[Misawa and Imada(2014)]Misawa2014-ym\n\tauthor author T. Misawa and author M. Imada,\thttps://doi.org/https://doi.org/10.1038/ncomms6738 journal journal Nature Communications volume 5, pages 5738 (year 2014)NoStop\n\t[Nomura et al.(2015)Nomura,\n\t\tSakai, Capone, and Arita]Nomura15Ful\n\tauthor author Y. Nomura, author S. Sakai,\n\t\tauthor M. Capone, and author R. Arita, https://doi.org/10.1126/sciadv.1500568 journal journal Science Advances volume 1, pages e1500568 (year 2015)NoStop\n\t[Kitatani et al.(2020)Kitatani, Si, Janson, Arita, Zhong, and Held]Kitatani2020-ra\n\tauthor author M. Kitatani, author L. Si,\n\t\tauthor O. Janson, author R. Arita, author\n\t\tZ. Zhong, and author\n\t\tK. Held, https://doi.org/https://doi.org/10.1038/s41535-020-00260-y journal journal npj Quantum Mat. volume 5, pages 59 (year 2020)NoStop\n\t[Misawa et al.(2019)Misawa,\n\t\tMorita, Yoshimi, Kawamura,\n\t\tMotoyama, Ido, Ohgoe,\n\t\tImada, and Kato]misawa2019\n\tauthor author T. Misawa, author S. Morita,\n\t\tauthor K. Yoshimi, author M. Kawamura, author\n\t\tY. Motoyama, author\n\t\tK. Ido, author T. Ohgoe, author M. Imada, and author T. Kato, https://doi.org/https://doi.org/10.1016/j.cpc.2018.08.014 journal journal Computer Physics Communications volume 235, pages 447 (year\n\t\t2019)NoStop\n\t[Tahara and Imada(2008)]tahara2008\n\tauthor author D. Tahara and author M. Imada,\thttps://doi.org/10.1143/JPSJ.77.114701 journal\n\t\tjournal J. Phys. Soc. Jpn. volume\n\t\t\t77, pages 114701 (year 2008)NoStop\n\t[Nomura et al.(2017)Nomura,\n\t\tDarmawan, Yamaji, and Imada]nomura2017\n\tauthor author Y. Nomura, author A. S. Darmawan, author Y. Yamaji,\t\tand author M. Imada, https://doi.org/10.1103/PhysRevB.96.205152 journal journal Phys. Rev. B volume 96, pages 205152 (year 2017)NoStop\n\t[Nomura and Imada(2021)]nomura2021\n\tauthor author Y. Nomura and author M. Imada,\thttps://doi.org/10.1103/PhysRevX.11.031034 journal\n\t\tjournal Phys. Rev. X volume 11,\t\tpages 031034 (year 2021)NoStop\n\t[Yokoyama and Shiba(1987)]YokoyamaShiba1987\n\tauthor author H. Yokoyama and author H. Shiba, https://doi.org/10.1143/JPSJ.56.1490 journal journal Journal of the Physical Society of Japan\t\tvolume 56, pages 1490 (year\n\t\t1987)NoStop\n\t[Gros et al.(1987)Gros,\n\t\tJoynt, and Rice]GrossJoyntRice1987\n\tauthor author C. Gros, author R. Joynt, and\t\tauthor T. M. Rice, https://doi.org/10.1103/PhysRevB.36.381 journal journal Phys. Rev. B volume 36, pages 381 (year 1987)NoStop\n\t[Gros(1988)]Gross1988\n\tauthor author C. Gros, https://doi.org/10.1103/PhysRevB.38.931 journal journal Phys. Rev. B volume\n\t\t\t38, pages 931 (year 1988)NoStop\n\t[Capriotti et al.(2001)Capriotti, Becca, Parola, and\t\tSorella]Capriotti2001\n\tauthor author L. Capriotti, author F. Becca,\n\t\tauthor A. Parola, and author S. Sorella, https://doi.org/10.1103/PhysRevLett.87.097201 journal\n\t\tjournal Phys. Rev. Lett. volume 87,\t\tpages 097201 (year 2001)NoStop\n\t[Azuma et al.(1992)Azuma,\n\t\tHiroi, Takano, Bando, and\t\tTakeda]Azuma1992\n\tauthor author M. Azuma, author Z. Hiroi,\n\t\tauthor M. Takano, author Y. Bando, and author\n\t\tY. Takeda, https://doi.org/https://doi.org/10.1038/356775a0 journal\n\t\tjournal Nature volume 356, pages 775 (year 1992)NoStop\n\t[Yamamoto et al.(2000)Yamamoto, Hu, and Tajima]yamamoto2000\n\tauthor author A. Yamamoto, author W.-Z. Hu,\t\tand author S. Tajima, https://doi.org/10.1103/PhysRevB.63.024504 journal journal Phys. Rev. B volume 63, pages 024504 (year 2000)NoStop\n\t[Fukase et al.(1990)Fukase,\n\t\tKoike, Goto, Nomoto,\n\t\tIwabuchi, and Hanaguri]fukase1990ultrasonic\n\tauthor author T. Fukase, author Y. Koike,\n\t\tauthor T. Goto, author\n\t\tT. Nomoto, author Y. Iwabuchi, and author T. Hanaguri, https://apps.dtic.mil/sti/pdfs/ADA335967.pdf#page=121 journal\n\t\tjournal Science & Technology , pages 113\n\t\t(year 1990)NoStop\n\t[Minghu et al.(1992)Minghu,\n\t\tZhuan, Hongbin, Xingbin,\n\t\tGangjin, Xuanjia, Qirui,\n\t\tYuming, Qidong, Jian, and\t\tLiezhao]fang1992\n\tauthor author F. Minghu, author X. Zhuan,\n\t\tauthor W. Hongbin, author Z. Xingbin, author\n\t\tH. Gangjin, author Z. Xuanjia, author Z. Qirui, author W. Yuming, author W. Qidong, author S. Jian, and author C. Liezhao, http://cpl.iphy.ac.cn/Y1992/V9/I3/159?utm_source=TrendMD   utm_medium=cpc   utm_campaign=Chinese_Physics_Letters_TrendMD_0\n\tjournal journal Chinese Physics Letters\t\tvolume 9, eid 159-161 (year\n\t\t1992)NoStop\n\t[Hobou et al.(2009)Hobou,\n\t\tIshida, Fujita, Ishikado,\n\t\tKojima, Eisaki, and Uchida]Hobou2009\n\tauthor author H. Hobou, author S. Ishida,\n\t\tauthor K. Fujita, author M. Ishikado, author\n\t\tK. M. Kojima, author\n\t\tH. Eisaki, and author\n\t\tS. Uchida, https://doi.org/10.1103/PhysRevB.79.064507 journal journal Phys. Rev. B volume 79, pages 064507 (year 2009)NoStop\n\t[Marzari and Vanderbilt(1997)]marzari1997maximally\n\tauthor author N. Marzari and author D. Vanderbilt, https://doi.org/10.1103/PhysRevB.56.12847 journal journal Phys. Rev. B volume\n\t\t\t56, pages 12847 (year 1997)NoStop\n\t[Souza et al.(2001)Souza,\n\t\tMarzari, and Vanderbilt]souza2001maximally\n\tauthor author I. Souza, author N. Marzari,\t\tand author D. Vanderbilt,\thttps://doi.org/10.1103/PhysRevB.65.035109 journal\n\t\tjournal Phys. Rev. B volume 65,\t\tpages 035109 (year 2001)NoStop\n\t[Hirayama et al.(2019)Hirayama, Misawa, Ohgoe, Yamaji, and Imada]hirayama2019\n\tauthor author M. Hirayama, author T. Misawa,\n\t\tauthor T. Ohgoe, author Y. Yamaji, and author\n\t\tM. Imada, https://doi.org/10.1103/PhysRevB.99.245155 journal journal Phys. Rev. B volume 99, pages 245155 (year 2019)NoStop\n\t[Gutzwiller(1963)]gutzwiller1963\n\tauthor author M. C. Gutzwiller, https://doi.org/10.1103/PhysRevLett.10.159\n\tjournal journal Phys. Rev. Lett. volume 10, pages 159 (year\n\t\t1963)NoStop\n\t[Jastrow(1955)]jastrow1955\n\tauthor author R. Jastrow, https://doi.org/10.1103/PhysRev.98.1479 journal journal Phys. Rev. volume\n\t\t\t98, pages 1479 (year 1955)NoStop\n\t[Capello et al.(2005)Capello, Becca, Fabrizio, Sorella, and Tosatti]capello2005\n\tauthor author M. Capello, author F. Becca,\n\t\tauthor M. Fabrizio, author S. Sorella, and author\n\t\tE. Tosatti, https://doi.org/10.1103/PhysRevLett.94.026406 journal\n\t\tjournal Phys. Rev. Lett. volume 94,\t\tpages 026406 (year 2005)NoStop\n\t[Yokoyama and Shiba(1990)]yokoyama1990\n\tauthor author H. Yokoyama and author H. Shiba, https://doi.org/10.1143/JPSJ.59.3669 journal journal J. Phys. Soc. Jpn. volume 59, pages 3669 (year\n\t\t1990)NoStop\n\t[Imada and Kashima(2000)]imada2000\n\tauthor author M. Imada and author T. Kashima, https://doi.org/10.1143/JPSJ.69.2723 journal journal J. Phys. Soc. Jpn. volume 69, pages 2723 (year\n\t\t2000)NoStop\n\t[Kashima and Imada(2001)]kashima2001\n\tauthor author T. Kashima and author M. Imada, https://doi.org/10.1143/JPSJ.70.2287 journal journal J. Phys. Soc. Jpn. volume 70, pages 2287 (year\n\t\t2001)NoStop\n\t[Sorella(2001)]sorella2001\n\tauthor author S. Sorella, https://doi.org/10.1103/PhysRevB.64.024512 journal journal Phys. Rev. B volume\n\t\t\t64, pages 024512 (year 2001)NoStop\n\t[Ido et al.(2022)Ido,\n\t\tYoshimi, Misawa, and Imada]ido2022\n\tauthor author K. Ido, author K. Yoshimi,\n\t\tauthor T. Misawa, and author M. Imada, https://doi.org/10.1038/s41535-022-00452-8 journal journal npj Quantum Materials volume 7,\t\tpages 48 (year 2022)NoStop\n\t[Hiroi et al.(1993)Hiroi,\n\t\tAzuma, Takano, and Takeda]hiroi1993\n\tauthor author Z. Hiroi, author M. Azuma,\n\t\tauthor M. Takano, and author Y. Takeda, https://doi.org/https://doi.org/10.1016/0921-4534(93)90200-A journal journal Physica C: Superconductivity volume 208, pages 286 (year\n\t\t1993)NoStop\n\t[Tanaka et al.(2006)Tanaka,\n\t\tLee, Lu, Fujimor,\n\t\tFujii, Risdiana, Terasaki,\n\t\tScalapino, Devereaux, Hussain, and Shen]Tanaka2006\n\tauthor author K. Tanaka, author W. S. Lee,\n\t\tauthor D. H. Lu, author A. Fujimor, author\n\t\tT. Fujii, author Risdiana, author I. Terasaki,\n\t\tauthor D. J. Scalapino, author T. P. Devereaux, author\n\t\tZ. Hussain, and author\n\t\tZ.-X. Shen, https://doi.org/10.1126/science.1133411 journal journal Science volume 314, pages\n\t\t1910 (year 2006)NoStop\n\t[Alldredge et al.(2008)Alldredge, Lee, McElroy, Wang, Fujita, Kohsaka, Taylor, Eisaki, Uchida, Hirschfeld, and Davis]Alldredge2008\n\tauthor author J. Alldredge, author J. Lee,\n\t\tauthor K. McElroy, author M. Wang, author\n\t\tK. Fujita, author Y. Kohsaka, author C. Taylor, author H. Eisaki, author S. Uchida, author P. Hirschfeld, and author J. Davis, https://doi.org/https://doi.org/10.1038/nphys917 journal\n\t\tjournal Nat. Phys. volume 4,\t\tpages 319 (year 2008)NoStop\n\t[Sakai et al.(2018)Sakai,\n\t\tCivelli, and Imada]Sakai2018\n\tauthor author S. Sakai, author M. Civelli,\t\tand author M. Imada, https://doi.org/10.1103/PhysRevB.98.195109 journal journal Phys. Rev. B volume 98, pages 195109 (year 2018)NoStop\n\t[Uemura et al.(1989)Uemura,\n\t\tLuke, Sternlieb, Brewer,\n\t\tCarolan, Hardy, Kadono,\n\t\tKempton, Kiefl, Kreitzman,\n\t\tMulhern, Riseman, Williams,\n\t\tYang, Uchida, Takagi,\n\t\tGopalakrishnan, Sleight, Subramanian, Chien, Cieplak, Xiao, Lee, Statt, Stronach,\n\t\tKossler, and Yu]Uemura1989\n\tauthor author Y. J. Uemura, author G. M. Luke,\n\t\tauthor B. J. Sternlieb, author J. H. Brewer, author\n\t\tJ. F. Carolan, author\n\t\tW. N. Hardy, author\n\t\tR. Kadono, author J. R. Kempton, author R. F.\t\t\tKiefl, author S. R. Kreitzman, author P. Mulhern,\n\t\tauthor T. M. Riseman, author D. L. Williams, author\n\t\tB. X. Yang, author\n\t\tS. Uchida, author H. Takagi, author J. Gopalakrishnan, author A. W. Sleight, author M. A.\t\t\tSubramanian, author C. L.\t\t\tChien, author M. Z. Cieplak, author G. Xiao,\n\t\tauthor V. Y. Lee, author B. W. Statt, author\n\t\tC. E. Stronach, author\n\t\tW. J. Kossler, and author\n\t\tX. H. Yu, https://doi.org/10.1103/PhysRevLett.62.2317 journal journal Phys. Rev. Lett. volume 62, pages 2317 (year 1989)NoStop\n\t[Torrance et al.(1988)Torrance, Tokura, LaPlaca, Huang, Savoy, and Nazzal]Torrance1988\n\tauthor author J. Torrance, author Y. Tokura,\n\t\tauthor S. LaPlaca, author T. Huang, author\n\t\tR. Savoy, and author\n\t\tA. Nazzal, https://doi.org/https://doi.org/10.1016/0038-1098(88)90987-8 journal journal Solid State Communications volume 66, pages 703 (year 1988),\tnote 25th Aniversary YearNoStop\n\t[Torardi et al.(1988)Torardi, Subramanian, Calabrese,\n\t\tGopalakrishnan, McCarron, Morrissey, Askew, Flippen, Chowdhry, and Sleight]Torardi1988\n\tauthor author C. C. Torardi, author M. A. Subramanian, author J. C. Calabrese, author J. Gopalakrishnan, author E. M. McCarron, author K. J. Morrissey, author T. R. Askew, author R. B. Flippen,\n\t\tauthor U. Chowdhry, and\t\tauthor A. W. Sleight, https://doi.org/10.1103/PhysRevB.38.225 journal journal Phys. Rev. B volume 38, pages 225 (year 1988)NoStop\n\t[Ito et al.(1998)Ito,\n\t\tVlaicu, Mukoyama, Sato,\n\t\tYoshikado, Julien, Chong,\n\t\tIkeda, Takano, and Sherman]Ito1998\n\tauthor author Y. Ito, author A.-M. Vlaicu,\n\t\tauthor T. Mukoyama, author S. Sato, author\n\t\tS. Yoshikado, author\n\t\tC. Julien, author I. Chong, author Y. Ikeda, author M. Takano, and author E. Y.\t\t\tSherman, https://doi.org/10.1103/PhysRevB.58.2851\n\tjournal journal Phys. Rev. B volume 58, pages 2851 (year\n\t\t1998)NoStop\n\t[Schlögl et al.(1993)Schlögl, Neumeier, Diederichs,\n\t\tAllgeier, and Schilling]Schloegl1993\n\tauthor author A. Schlögl, author J. Neumeier,\n\t\tauthor J. Diederichs, author C. Allgeier, and author J. Schilling, https://doi.org/https://doi.org/10.1016/0921-4534(93)90084-4 journal journal Physica C: Superconductivity volume 216, pages 417 (year\n\t\t1993)NoStop\n\t[Beskrovnyi et al.(1990)Beskrovnyi, Dlouhá, Jirák, and\t\tVratislav]Beskrovnyi1990\n\tauthor author A. Beskrovnyi, author M. Dlouhá, author Z. Jirák, and author S. Vratislav, https://doi.org/https://doi.org/10.1016/0921-4534(90)90450-S journal journal Physica C: Superconductivity volume 171, pages 19 (year\n\t\t1990)NoStop\n\t[di Cicco and Berrettoni(1993)]Cicco1993\n\tauthor author A. di\n\t\t\t\t\tCicco and author M. Berrettoni, https://doi.org/https://doi.org/10.1016/0375-9601(93)90936-T journal journal Physics Letters A volume 176, pages 375 (year\n\t\t1993)NoStop\n\t[Yamamoto et al.(1990)Yamamoto, Onoda, Takayama-Muromachi,\n\t\tIzumi, Ishigaki, and Asano]yamamoto1990\n\tauthor author A. Yamamoto, author M. Onoda,\n\t\tauthor E. Takayama-Muromachi,\n\t\tauthor F. Izumi, author T. Ishigaki, and author H. Asano, https://doi.org/10.1103/PhysRevB.42.4228 journal journal Phys. Rev. B volume 42, pages 4228 (year 1990)NoStop\n\t[Slezak et al.(2008)Slezak,\n\t\tLee, Wang, McElroy,\n\t\tFujita, Andersen, Hirschfeld,\n\t\tEisaki, Uchida, and Davis]slezak2008\n\tauthor author J. A. Slezak, author J. Lee,\n\t\tauthor M. Wang, author\n\t\tK. McElroy, author K. Fujita, author B. M.\t\t\tAndersen, author P. J.\t\t\tHirschfeld, author H. Eisaki, author S. Uchida, and author J. C.\t\t\tDavis, https://doi.org/10.1073/pnas.0706795105\n\tjournal journal Proceedings of the National\n\t\t\t\tAcademy of Sciences volume 105, pages\n\t\t3203 (year 2008)NoStop\n\t[Iwano and Yamaji(2022)]iwano2022\n\tauthor author A. Iwano and author Y. Yamaji,\thttps://doi.org/10.7566/JPSJ.91.094702 journal\n\t\tjournal J. Phys. Soc. Jpn. volume\n\t\t\t91, pages 094702 (year 2022)NoStop\n\t[Imada and Suzuki(2019)]imada_suzuki2019\n\tauthor author M. Imada and author T. J. Suzuki, https://doi.org/10.7566/JPSJ.88.024701 journal journal J. Phys. Soc. Jpn. volume 88, pages 024701 (year\n\t\t2019)NoStop\n\t[Imada(2021)]imada_review2021\n\tauthor author M. Imada, https://doi.org/10.7566/JPSJ.90.111009 journal journal J. Phys. Soc. Jpn. volume 90, pages 111009 (year\n\t\t2021)NoStop\n\t[Yamaji et al.(2021)Yamaji,\n\t\tYoshida, Fujimori, and Imada]PhysRevResearch.3.043099\n\tauthor author Y. Yamaji, author T. Yoshida,\n\t\tauthor A. Fujimori, and\t\tauthor M. Imada, https://doi.org/10.1103/PhysRevResearch.3.043099 journal\n\t\tjournal Phys. Rev. Res. volume 3,\t\tpages 043099 (year 2021)NoStop\n\t[Pavarini et al.(2001)Pavarini, Dasgupta, Saha-Dasgupta,\n\t\tJepsen, and Andersen]pavarini2001\n\tauthor author E. Pavarini, author I. Dasgupta,\n\t\tauthor T. Saha-Dasgupta, author O. Jepsen, and author\n\t\tO. K. Andersen, https://doi.org/10.1103/PhysRevLett.87.047003 journal\n\t\tjournal Phys. Rev. Lett. volume 87,\t\tpages 047003 (year 2001)NoStop\n\t[Mori et al.(2008)Mori,\n\t\tKhaliullin, Tohyama, and Maekawa]mori2008\n\tauthor author M. Mori, author G. Khaliullin,\n\t\tauthor T. Tohyama, and author S. Maekawa, https://doi.org/10.1103/PhysRevLett.101.247003 journal\n\t\tjournal Phys. Rev. Lett. volume 101,\t\tpages 247003 (year 2008)NoStop\n\t[Weber et al.(2010)Weber,\n\t\tHaule, and Kotliar]weber2010\n\tauthor author C. Weber, author K. Haule, and\t\tauthor G. Kotliar, https://doi.org/10.1103/PhysRevB.82.125107 journal journal Phys. Rev. B volume 82, pages 125107 (year 2010)NoStop\n\t[Sakakibara et al.(2010)Sakakibara, Usui, Kuroki, Arita, and Aoki]sakakibara2010\n\tauthor author H. Sakakibara, author H. Usui,\n\t\tauthor K. Kuroki, author R. Arita, and author\n\t\tH. Aoki, https://doi.org/10.1103/PhysRevLett.105.057003 journal\n\t\tjournal Phys. Rev. Lett. volume 105,\t\tpages 057003 (year 2010)NoStop\n\t[Hu et al.(2014)Hu,\n\t\tKaiser, Nicoletti, Hunt,\n\t\tGierz, Hoffmann, Le Tacon,\n\t\tLoew, Keimer, and Cavalleri]hu2014\n\tauthor author W. Hu, author S. Kaiser, author D. Nicoletti, author\n\t\tC. R. Hunt, author\n\t\tI. Gierz, author M. C. Hoffmann, author M. Le Tacon, author T. Loew, author B. Keimer, and author A. Cavalleri, https://doi.org/10.1038/nmat3963 journal journal Nature Mater. volume\n\t\t\t13, pages 705 (year 2014)NoStop\n\t[Carleo and Troyer(2017)]carleo2017\n\tauthor author G. Carleo and author M. Troyer, https://doi.org/10.1126/science.aag2302 journal journal Science volume\n\t\t\t355, pages 602 (year 2017)NoStop\n\n\n\n\nSupplementary Material \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nS1.  Full ab initio Hamiltonians \n\n\n\n\nIn Table <ref> we present the full single band ab initio Hamiltonian for all four compounds as derived in Ref. moree2022. \n\n\n\n5mm\nS2.  Correlation functions of the CmSn states in CaCuO_2 \n\n\n\n\n\nHere we discuss the real space spin- and charge-configuration of the CmSn stripe states.\nFor this purpose, we calculate the following correlation functions\n\n    S_z( r)    = ( n_ r, ↑ - n_ r, ↓)/2, \n    \n        n( r)      = (n_ r, ↑ + n_ r, ↓)/2,\n\nwhich are single-particle quantities.\nHere the vector  r represents the two-dimensional lattice site coordinate r = (r_x, r_y), S_z( r) the spin configuration of each lattice site, and n( r) the corresponding charge configuration. \nFurther we consider S_s( q), S_c( q), and n( k), as defined in equations (2), (3), and (A1) in the main text.\nAlthough the translational symmetry breaking does not occur in a finite-size systems in the true ground state, practically, ordered states are realized in a sufficiently large systems in the VMC results if the order is expected in the thermodynamic limit.\n\n5mm\n1. C4S8 \n\n\n\n\nStarting with the C4S8 state, the spin- and charge structure factor is shown in Fig. <ref>. \nTo confirm the charge order of period four, we expect to see peaks in the charge structure factor. \nIn panel (b), indeed, there are peaks at q_CDW = ( π/2, 0) and ( 3π/2, 0), confirming the charge order. \nSimilarly we find peaks in the spin structure factor (see panel (a)) at q_SDW = ( 3π/4, π) and ( 5π/4, π) corresponding to a spin order of period eight.\nIn (c) the corresponding momentum distribution is also shown. \n\n\n\nThe C4S8 stripe sate can also be identified in the real space resolved quantities S_z( r) and n( r), when no additional momentum projections in mVMC are done. \nIn Fig. <ref> S_z( r) (a) and n( r) (b) are shown for the same case as a heatmap. \nThe charge and spin stripes run along the r_y direction, while periodically alternating in the r_x direction with period four (charge) or eight (spin).\n\n\n\n5mm\n2. C3S3 \n\n\n\nUsing the same analysis as above the C3S3 state with charge period three and spin period three can be identified. The spin- and charge structure factors, depicted in Fig. <ref> (a) or (b), show peaks at  q_CDW = ( 2 π/3, 0) and ( 4 π/3, 0) for the charge structure factor, and q_SDW = ( 2π/3, π) and ( 4π/3, π) for the spin structure factor.\nIn (c) the corresponding momentum distribution is also shown. \nFig. <ref> (a) or (b) shows the real space configuration of spin and charge with the period of three in r_x direction. \n\n\n\n\n\nCompared to the C4S8 state, the C3S3 state realized here has significantly smaller peaks at q_CDW in S_c( q). \nAs shown in Appendix C of the main text, this may already indicate, that in the thermodynamic limit, this stripe state will fall into a paramagnetic state.\n\n5mm\nS3.  AF state for CaCuO_2 away from half filling \n\n\n\n\n\nFor the AF state at δ = 0.167 hole doping on a L = 24 square lattice for CaCuO_2, the spin- and charge structure factor, and momentum distribution is shown in Fig. <ref>. \nIn (a) the strong peak at q = (π, π) in S_s( q) indicates a strong antiferromagnetic correlations, corresponding to the well known checkerboard spin configuration pattern. \nFor the charge structure factor on the other hand (shown in (b)), there are no sharp peaks.\nOver the full range, the function is smooth, resulting in a charge homogeneous state.\nThe momentum distribution n( k) is  shown in (c), suggesting non Fermi liquid behaviour.  \n\n\n5mm\nS4. Uncertainty of the apical oxygen position in Bi2212 and Bi2201 \n\n\n\n\nSC correlations P_d(r) as a function of distance r for several choices of the scaling factor α=ξ with the Hamiltonian  ℋ(α,α) are presented in Fig. <ref> for Bi2212 and Bi2201.\n\n\n\n5mm\nS5.  Momentum distributions of CaCuO_2 \n\n\n\n\nWe show n(k) for the case of doped CaCuO_2 at L=36 lattice in Fig. <ref> for δ = 0.028 (a),(c) and δ = 0.167 (b),(d) for the SC state.\n \n\napsrev4-2\n1\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[Morée et al.(2022)Morée, Hirayama, Schmid, Yamaji, and Imada]moree2022\n  author author J.-B. Morée, author M. Hirayama,\n  author M. T. Schmid, author Y. Yamaji, and author\n  M. Imada, https://doi.org/10.1103/PhysRevB.106.235150 journal journal Phys. Rev. B volume 106, pages 235150 (year 2022)NoStop\n\n\n\n"}