{"entry_id": "http://arxiv.org/abs/2303.06671v1", "published": "20230312142549", "title": "An extension of the approximate component mode synthesis method to the heterogeneous Helmholtz equation", "authors": ["Elena Giammatteo", "Alexander Heinlein", "Matthias Schlottbom"], "primary_category": "math.NA", "categories": ["math.NA", "cs.NA"], "text": "\n\n Superconductivity studied by solving ab initio low-energy effective Hamiltonians for carrier doped CaCuO_2, Bi_2Sr_2CuO_6, Bi_2Sr_2CaCu_2O_8, and  HgBa_2CuO_4\n    \nMichael Thobias Schmid^1 0000-0003-2724-0621, \nJean-Baptiste Morée^1 0000-0002-0710-9880, \nYouhei Yamaji^2 0000-0002-4055-8792, \nand Masatoshi Imada^1,3,4 0000-0002-5511-2056\n\n    March 30, 2023\n====================================================================================================================================================================================\n\n\n\n\nAn extension of the approximate component mode synthesis (ACMS) method to the heterogeneous Helmholtz equation is proposed. The ACMS method has originally been introduced by Hetmaniuk and Lehoucq as a multiscale method to solve elliptic partial differential equations. The ACMS method uses a domain decomposition to separate the numerical approximation by splitting the variational problem into two independent parts: local Helmholtz problems and a global interface problem. While the former are naturally local and decoupled such that they can be easily solved in parallel, the latter requires the construction of suitable local basis functions relying on local eigenmodes and suitable extensions. We carry out a full error analysis of this approach focusing on the case where the domain decomposition is kept fixed, but the number of eigenfunctions is increased. This complements related results for elliptic problems where the focus is on the refinement of the domain decomposition instead. The theoretical results in this work are supported by numerical experiments verifying algebraic convergence for the interface problems. In certain, practically relevant cases, even exponential convergence for the local Helmholtz problems can be achieved without oversampling.\n\n\n\n\tMultiscale method, approximate component mode synthesis (ACMS), Helmholtz equation, heterogeneous media, high-frequency\n\n\n\n65N12, \n65N30, \n65N35, \n65N55  \n\n\n\n\n§ INTRODUCTION\n \n\nIn this paper, we propose and analyze a multiscale method for the heterogeneous Helmholtz equation\n\n-div(a ∇u) - κ^2 u    = f         in  Ω, \n\n a ∂_n u - i ωβu    =g          on  Γ_R, \n\n u   =0         on  Γ_D,\n \n\nin a plane region Ω⊂^2. The boundary of Ω is decomposed into sets Γ_D and Γ_R modeling Dirichlet boundary conditions or impedance boundary conditions described by the function g, respectively. The real-valued function β is related to transmission and reflection of the wave described by u.\n\nMaterial properties of the background medium occupying Ω are described by the coefficient functions a and c. \nDenoting the positive angular frequency as ω, the wavenumber is given by κ=ωc, and any interior sources are modeled by the function f.\nHeterogeneous Helmholtz equations have many applications, such as modeling the propagation of light in photonic crystals, where u is related to either the transverse-electric or  the transverse-magnetic field <cit.>, or seismic imaging <cit.>.\n\n\n\n §.§ Literature overview\n\n\nNumerical simulations of the Helmholtz equation are challenging due to the highly oscillatory behavior of the solution, in particular, in the case of a high wavenumber κ. The differential operator in the equation is indefinite, which may lead to stability issues for standard discretization approaches such as the classical finite element method (FEM). \nGenerally, convergence can only be achieved under the scale resolution condition, that is, if the mesh size h is scaled with the wavenumber O(1κ). This pre-asympotic behavior is also known as pollution effect <cit.>. \nIn order to reduce this effect, higher-order methods can be employed: in particular, for the hp-FEM, quasi-optimality has been proved in <cit.> under the conditions that the polynomial degree p is at least O(logκ) and that κ hp is sufficiently small.\nIn <cit.>, similar results have been achieved for the heterogeneous Helmholtz equation with piecewise smooth coefficients; however, to the authors' knowledge, no theory for rough coefficients \n\nis available yet. \n\nMultiscale discretization approaches can be very efficient for problems with heterogeneous or non-smooth coefficients, especially if the variations are on a much smaller scale than the size of the computational domain. Indeed, while classical higher-order finite element methods need to resolve the fine-scale variations, requiring a large number of degrees of freedom, multiscale methods are typically defined on a coarser grid, resulting in significantly smaller systems. \n\n\n\n\n\n\nIn recent years, many multiscale discretization methods have been developed and applied to the heterogeneous Helmholtz equation.\n\nThe localized orthogonal decomposition (LOD) method, introduced in <cit.>, has successfully been applied to heterogeneous Helmholtz problems with high wavenumbers <cit.>, achieving exponential convergence.\n\n\n\nMore recently, even super-exponential convergence could be shown for a variant of the LOD method in <cit.>. \nExponential convergence for highly oscillatory heterogeneous Helmholtz equations has also been obtained  in <cit.>, for a multiscale discretization inspired by the multiscale FEM (MsFEM) <cit.>;\nsee also, e.g., <cit.> for an overview on MsFEM. Moreover, nearly exponential error decay \n\nhas been achieved in <cit.>, using similar ideas as in the multiscale generalized finite element method (Ms-GFEM), first described in  <cit.>. \n\nAll the aforementioned approaches rely on local oversampling. \nFurthermore, in the multiscale framework, numerical homogenization techniques have been extended to Helmholtz problems: for instance, in <cit.>, quasi-optimality is obtained for the heterogeneous multiscale method (HMM) <cit.>, which relies on the local periodicity of the media, and in <cit.>, exponential convergence is achieved through homogenization techniques developed in a variational setting.\n\nIn domain decomposition methods, related discretizations are also often used as coarse spaces to construct preconditioners which are robust with respect to heterogeneous coefficients;\nsee, e.g., <cit.> for applications to scalar elliptic problems or <cit.> for linear elasticity problems.\n\nFor the application to heterogeneous Helmholtz problems, see, for instance, <cit.>.\nLet us also refer to <cit.> for an optimized parallel implementation of a multifrontal solver that employs nested dissection based domain decomposition with matrix compression techniques; see <cit.> for a recent work in the context of elliptic equations. Finally, multigrid methods for the heterogeneous Helmholtz problem have been analyzed; see, e.g., <cit.>.\n\n\nIn this work, we consider an extension of the approximate component mode synthesis (ACMS) method to Helmholtz problems. The ACMS method has been introduced by Hetmaniuk and Lehoucq in <cit.> as a multiscale discretization for scalar elliptic problems with heterogeneous coefficient functions. \nIt is based on the early component mode synthesis (CMS) method <cit.>, which uses a decomposition of the global approximation space into independent local subspaces and an interface space. The basis functions are defined as eigenmodes of corresponding generalized eigenvalue problems. The global support of the interface basis functions comes at a high computational cost in the construction as well as a dense matrix structure of the interface problem. Hence, the practicability and potential for parallelization of CMS method are rather limited.\n\nTherefore, the ACMS method was introduced in order to improve the CMS approach: instead of global interface modes, functions with local support are employed.\n\n\n\n\n\nThe basis functions incorporate heterogeneities of the model problem; notably, besides edge modes, this framework uses vertex basis functions of MsFEM <cit.> type. \n\nSince the ACMS discretization uses problem-specific shape functions with local support, it can therefore be considered a special finite element method (SFEM); cf. <cit.>.\nIn contrast to other multiscale approaches, such as those previously mentioned <cit.>, the ACMS method is based on a non-overlapping domain decomposition and does not use local oversampling. This makes the method very efficient but generally does not yield exponential convergence.\n\nThe ACMS method has been further investigated in <cit.>, where a priori error bounds and an a posteriori error indicator for the method have been derived, and in <cit.>, where a parallel implementation in PETSc based on the finite element tearing and interconnecting dual primal (FETI-DP) domain decomposition method as the parallel solver is presented. \nMore recently, a robust spectral coarse space for Schwarz domain decomposition methods based on the ACMS discretization has been introduced in <cit.>; further related works on CMS and ACMS methods include <cit.>. \nMoreover, to the authors' best knowledge, preliminary but unpublished work on the extension of the ACMS method to wave problems has been carried out by Hetmaniuk and Johnson in the early 2010s. \n\nAs a multiscale discretization, the ACMS method seems to be well suited for approximating heterogeneous Helmholtz problems. As we will discuss in this work, similar basis functions than in the elliptic case are suitable for the Helmholtz case as well, because the eigenmodes of the Helmholtz and the Laplacian operator are the same. \n\n\n\n\n §.§ Our contribution and outline\n\n\nIn this paper, we extend\n\nthe ACMS method to heterogeneous Helmholtz problems. In doing so, we slightly modify the construction of the edge modes and the extension operator. At the same time, we adapt the method to Robin boundary conditions, which are necessary for the definition of many real world-oriented Helmholtz problems. \nMoreover, in contrast to <cit.> where the number of subdomains in the domain decomposition is increased to obtain convergence, we perform a complementary error analysis focusing on fixing the domain decomposition and increasing the number of (edge) eigenmodes for tackling the local heterogeneities. \nWhile the error analysis for the local sub-problems, for which we obtain similar a posteriori error bounds as in <cit.> is rather simple, the error analysis for the interface problem is more sophisticated.\nThe analysis is based on the abstract framework of <cit.>, and relies in particular on the smallness of the so-called adjoint approximability constant; see <ref> and, in particular, <ref> below. \nWe show that, upon using sufficiently many (edge) eigenmodes, the adjoint approximability constant can be made arbitrarily small. Tracing the results of <cit.> allows to further obtain wavenumber explicit bounds.\nFinally, we present a detailed numerical study of the method using a flexible implementation that, unlike in the numerical results for the ACMS method shown in previous works, also allows for unstructured meshes and domain decompositions. \n\nThe paper is structured as follows: we introduce the necessary preliminaries for defining and analyzing the ACMS method for Helmholtz problems in <ref>. In particular, we show the variational formulation of the Helmholtz equation, recall the well-posedness results of <cit.>, and illustrate the underlying domain decomposition and function spaces of the ACMS discretization. \nThen, in <ref>, we present our new variant of the ACMS method for Helmholtz problems along with some theoretical properties. The error analysis of the ACMS method is carried out in <ref>.\n\nFinally, we describe our numerical results in <ref> and conclude with some final remarks.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ PRELIMINARIES\n \nIn the following, we introduce the functional analytic setting and recall well-posedness results for the heterogeneous Helmholtz equation. Furthermore, we introduce the domain decomposition used in the ACMS method.\n\n\n\n §.§ Variational formulation of the Helmholtz equation\n\nWe denote by L^2(Ω) the Lebesgue space of square-integrable functions v:Ω→ with inner product\n\n    (u,v)_Ω = ∫_Ω u v dx  ,\n\nand by H^1(Ω) the usual Sobolev space of functions with square-integrable weak derivatives.\nCorresponding notation is used for other measurable sets besides Ω. Furthermore, we indicate by ⊂ H^1(Ω) functions with vanishing trace on Γ_D⊂∂Ω. \nLet us introduce the sesquilinear forms ,: ×→ defined by\n\n    (u,v)   =∫_Ω a ∇ u ·∇v dx  ,\n    (u,v)   =(u,v) - (κ^2 u,v)_Ω-i (ωβ u,v)_Γ_R .\n\nThen the weak form of the Helmholtz problem <ref> and its adjoint are\n\n    Find  u ∈:   (u,v) = F(v),   for all  v ∈, \n        \n       Find  z ∈:   (v,z) = G(v),   for all  v ∈.\n\nHere, F:→ and G:→, defined by\n\n    F(v)    = (f,v)_Ω + (g,v)_Γ_R,\n        \n        \n    \n        G(v)    = (v,f)_Ω+(v,g)_Γ_R,\n\nare antilinear and linear functionals on , respectively.\n\n\n\n §.§ Well-posedness of the Helmholtz equation\n\nWe recall the well-posed-ness theory for the Helmholtz equation presented in <cit.>. Thus, we deem the following assumptions valid throughout the paper without explicitly mentioning it.\n\n\t(i) Ω⊂^2 is a connected polygonal domain with piecewise C^2 boundary with convex angles, see <cit.>). Its boundary can be decomposed as ∂Ω=Γ_R∪Γ_D into relatively open disjoint subsets Γ_R,\n\t\tΓ_D⊂∂Ω.\n\n\t(ii) The source terms satisfy f ∈ L^2(Ω) and g∈ H^12(Γ_R).\n\t\t\n\n\t(iii) The coefficient functions a,c ∈ L^∞(Ω) are uniformly positive, i.e., a_min≤ a(x) ≤  a_max and c_min≤ c(x) ≤ c_max for a.e. x∈Ω, where a_min, c_min, a_max, c_max are positive constants.\n\t\t\n\n\t(iv) β∈ L^∞ (Γ_R) with meas( supp(β))>0 and either 0< β or β <0.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe analysis employs the norm u_^2=(u,u) induced by the sesquilinear form \n\n    (u,v)= (u,v) + (κ^2 u ,v)_Ω,\n\ndefined for u,v∈.\n\nIn <cit.>, the following result is proved.\n\n(i) For all u,v∈, it holds that\n\n    |(u,v)| ≤ C_u_v_,\n\n    where the constant C_ =C_(a_min, β_∞, κ_∞) grows quadratically in κ_∞.\n\n    \n  \n  \n  \n  \n  \n  \n  \n    \n(ii) There exist unique solutions of <ref>.\n\n\n(iii)\n    If g=0 in <ref>, then there exists a constant C_ stab = C_ stab(a,c,ω, Ω) such that the corresponding solutions u and z satisfy:\n    \n    u_≤ C_ stabf_L^2(Ω),   z_≤ C_ stabf_L^2(Ω).\n\n\n\n\n\n\n\n\n §.§ Decomposition of the  computational domain\n\n\nLet {}_j=1^J denote a conforming decomposition of Ω into J non-overlapping domains  with piecewise smooth boundaries. \n\nFurthermore, let \n\n    Γ = ⋃_j=1^J ∂Ω_i ∖Γ_D\n \ndenote the domain decomposition interface and  the set of all edges of the domain decomposition, where each edge e is an open set with e = ∂Ω_i∩∂ for some i ≠ j.\n\n\n Furthermore, let ={p∈Γ}=Γ∖∪_e∈e be the set of points connecting adjacent edges, which we also refer to as the vertices of the domain decomposition. \n\n\n\n\n\n\n\n §.§ Function spaces\n\n\nDenoting  the interpolation space between  and L^2(e); see <cit.>, \nwe have the interpolation inequality\n\n    η_≤ C η_L^2(e)^12η_^12\n\nfor all η∈; see, e.g., <cit.>.\nWe will also use the Lions–Magenes space , which is defined as an interpolation space between L^2(e) and  <cit.>. Therefore, it holds that ⊂ densely <cit.>.\n\n\n\n\n\n\n\nIn view of <cit.>, if e⊂∂ for some 1≤ j≤ J, \nfunctions in  can be extended by zero to functions in . Here,  denotes the space of traces of functions in ; cf. <cit.>. \nLastly, by  we denote the space of traces on Γ, i.e., v∈ if, for all 1≤ j≤ J, there exist u_j ∈ such that u_|∂∩Γ=v_|∂.\n\n\n\n§ ACMS METHOD\n \nThe ACMS method introduced in <cit.> relies on an orthogonal splitting of  into interface functions  and local functions , j=1,…,J, and on the availability of basis functions with local support; whereas functions in  generally have local support, interface basis functions with local support are \n\nconstructed based \n\non the edges and vertices that form Γ. In <cit.>, orthogonality is characterized by the bilinear form associated to the elliptic problem. The basic idea of our extension of the ACMS method to Helmholtz problems is similar,  but `orthogonality' is measured with respect to the sequilinear form . Below we will construct spaces \n\n    := ⊕\n\nthat are either associated to the subdomains  or to the interface Γ.\n\nIn particular, the corresponding basis functions have local support and can be built locally.\nWe now discuss the construction of the bubble space  and the interface space  in detail.\n\n\n\n §.§ Bubble space\n\nLet us define the local sesquilinear form _j:×→ as in <ref> but with domain of integration  instead of Ω.\nSince _j is Hermitian, we can consider the eigenproblems: for j=1,...,J and i ∈, find (b_i^j,λ_i^j)∈× such that\n\n    _j(b_i^j,v)= λ_i^j ( κ^2 b_i^j,v)_  for all  v ∈.\n\nStandard theory ensures that the eigenfunctions {b^i_j}_i form an orthogonal basis for  with respect to _j and an orthonormal basis for L^2() with weighted inner product (κ^2 u,v)_, and that λ_i^j>0. Furthermore, we may assume that the eigenvalues λ_i^j are ordered non-decreasingly, i.e., λ_i^j≤λ_l^j for i≤ l.\nIn slight abuse of notation, we may denote by b_i^j ∈ H^1_0(Ω) also the extension of b_i^j ∈ by zero outside of  and we call these bubble functions.\n\nAssociated to the partition {}_j of Ω, let us introduce the infinite-dimensional bubble space\n\n    = ⊕_j=1^JV^j,    with  V^j= span{  b_i^j :  i∈}.\n\nLet S_B=(I_1,…, I_J)∈^J be a multi-index. Then, the finite-dimensional bubble space employed in the ACMS method is defined by:\n\n    = ⊕_j=1^JV^j_I_j,    with  V^j_I_j:= span{  b_i^j   :  1 ≤ i ≤ I_j }.\n\n\n\n\n\n §.§ Solvability of local Helmholtz problems\n\nThe interface space  introduced below relies on the proper extension of functions defined on the interface Γ. The extension relies on the solvability of local Helmholtz problems with homogeneous Dirichlet conditions. Therefore, in the rest of the manuscript, we additionally assume the following:\n\n    For all j=1,…,J and for all i∈, let λ_i^j≠ 1.\n\n\n<ref> might be justified by suitably adapting the partition {}_j and by a scaling argument.\n\nNext, we establish well-posedness of the local Helmholtz problems.\n\n\tFor β^j=inf_i∈{|λ_i^j-1|(λ_i^j+1)}>0, the following estimates hold:\n\t\n    inf_u∈sup_v∈_j (u, v)-(κ^2 u, v)_/u_v_   ≥β^j ,\n    inf_v∈sup_u∈_j (u, v)-(κ^2 u, v)_/u_v_   ≥β^j .\n\n\n\n\tLet u∈ be given. Since {b_i^j}_i is a basis of , we have that\n\t\tu= ∑_i=1^∞ u_i b_i^j\n\twith u_i=(κ^2 u, b_i^j)_. Now, let v=∑_i=1^∞ sgn(λ_i^j-1)u_i b_i^j. \n\tWe note that \n\t\n    u_^2=∑_i=1^∞ (λ_i^j+1)|u_i|^2,\n\n\tand v_=u_.\n\tThen we have that \n\t\n    _j (u, v)-(κ^2 u, v)_  = ∑_i=1^∞ |λ_i^j-1| u_i^2 ≥inf_i∈|λ_i^j-1|/λ_i^j+1u_^2.\n\n\tHence, the first inequality follows. The second inequality follows similarly.\n\n\n\n\n §.§ A harmonic extension operator\n\n\nIn order to define the interface space, we need an extension from Γ to Ω, which is obtained by combining the extensions of functions from ∂ to .\n\n\nFor a given τ∈, let τ̃∈ be any function satisfying τ̃_|∂=τ.\nThen, we indicate by τ̃_0∈ the solution to\n\n    _j (τ̃_0, v)-(κ^2 τ̃_0, v)_ = -(_j(τ̃,v)-(κ^2 τ̃, v)_)   for all  v∈,\n\nwhich is uniquely defined following from <ref>.\n\n\nWe characterize the -harmonic extension j:→ by setting \n\n    jτ := τ̃+τ̃_0.\n\n\n \n    The extension operator j:→ \n    \n    is bounded, that is,\n    \n    jτ_≤ (1+1β^j)τ̃_,\n\n    where τ̃∈ is any extension of τ∈.\n  \n\n\tWe estimate the right-hand side in <ref> by τ_v_.\n\t\n\t\n\t\n    Then, <ref> yields that τ̃_0_≤τ̃_β^j, and the assertion follows.\n    \n\nWe note the following orthogonality relation, which is a crucial property for the construction of the ACMS  spaces: for all bubble functions b_i^j ∈, we have\n\n    _j(jτ,b_i^j)-(κ^2jτ,b_i^j)_=0.\n\nNext, we construct extensions from local edges and the interface.\nAssume that e=∂∩∂Ω_i∈ is a common edge of Ω_i and . Let τ∈, which, by restriction, implies τ∈ and τ∈ H^12(∂Ω_i).\nSince (jτ)_| e=τ_| e= (iτ)_| e, we can introduce the  extension operator :→ by (τ)_| = jτ_|∂, for all j = 1,…,J. Moreover, we define :→ via τ =  E_0^eτ, where E_0^e: → denotes the extension by zero to the interface Γ.\n\n\n\n §.§ Vertex based approximation space\n\nFor any p∈, let φ_p: Γ→ denote a piecewise harmonic function, that is, Δ_eφ_p| e=0 for all e∈, with Δ_e indicating the Laplace operator along the edge e∈, and φ_p(q)=δ_p,q for all p,q∈.\nThe vertex based space is then defined by linear combinations of corresponding  extensions:\n\n    V_ =  span{ φ_p  :  p∈}.\n\nFor our error analysis, we will employ the nodal interpolant\n\n    I_ v = ∑_p∈ v(p) φ_p,\n\nwhich is well-defined for functions v:Ω→ that are continuous in all p∈. Moreover, note that the support of the vertex basis functions consists of all subdomains which share the vertex and is therefore local.\n\n\n\n\n §.§ Interface space\n\nLet us consider e∈ and denote by ∂_e the tangential derivative, i.e., differentiation along e.\nWe define the edge modes as solutions to the following weak formulation of the edge-Laplace eigenvalue problems: for each e∈, for i ∈, find (τ^e_i,λ^e_i)∈× such that\n\n    (∂_e τ^e_i,∂_e η)_e =λ^e_i ( τ^e_i, η)_e   for all η∈.\n\nStandard theory ensures that the eigenfunctions {τ^e_i}_i form an orthogonal basis for  and an orthonormal basis for L^2(e). We may again assume that the eigenvalues λ_j^e>0 are ordered increasingly. Moreover, we note that the asymptotic behavior of the eigenvalues, according to <cit.>, is\n\n    λ_i^e ∼( i π/|e|)^2.\n\nThe corresponding infinite-dimensional interface space is\n\n    = V_ + ∑_e∈ V^e,   V^e =  span{τ_i^e :  i ∈}.\n\nAgain, each function in V^e has local support inside the two subdomains adjacent to e. Choosing I_e∈, e∈, we introduce the L^2(e)-projection P^e_I_e:L^2(e)→ V^e as\n\n    P^e_I_ev=∑_j=1^I_e (v,τ_j^e)_e τ_j^e\n\nand denote the range of P^e_I_e by V^e_I_e.\n\n\n\n\n\n\nCollecting the indices I_e in a multi-index S_Γ,\n\nwe define the finite-dimensional interface space by\n \n    = V_ + ∑_e∈ V^e_I_e,\n\nwhich, together with <ref>, completes the construction of the ACMS approximation space in <ref>.\nWe now give\n\nsome interpolation error estimates.\n\n\nFor any e∈ and all w∈, it holds that\n\n    w-P^e_I_ew_L^2(e)≤1/√(λ_I_e+1)w-P^e_I_ew_.\n\nIf, additionally, w ∈∩ H^2(e), then there exists a constant C>0 such that\n\n    w- P^e_I_ew_   ≤C/√(λ_I_e+1^e)Δ_e w-P^e_I_eΔ_e w_L^2(e).\n\n\n\n\nSince {τ_j^e}_j form an orthonormal basis of L^2(e), we have that\n\n\n\n\n\n\n    w-P^e_I_ew_L^2(e)^2 \n    = ∑_j≥ I_e+1|(w,τ_j^e)_e|^2≤1/λ_I_e+1w-P^e_I_ew_^2,\n\nwhich proves <ref>.\n\nBy <ref> \nand the Poincaré inequality, we similarly have that\n\n    w-P^e_I_ew_^2 \n    ≤ C_P ∑_j≥ I_e+1λ_j^e |(w,τ_j^e)_e|^2.\n\n Using the definition of τ_j^e in <ref> again and performing integration by parts, we obtain\n\n    (w,τ_j^e)_e = 1/λ_j^e (∂_e w,∂_e τ_j^e)_e = -1/λ_j^e (Δ_e w,τ_j^e)_e,\n\nwhere we used that w, τ_j^e ∈. This concludes the proof of <ref>.\n\n\n\nLet e∈. Then, there exists a constant C>0 such that\n\n    inf_v^e∈ V_I_e^e w -I_ w -v^e_   ≤C/√(λ^e_I_e)w_H^32(e)\n\nfor all w∈ H^32(e), with nodal interpolant I_ w defined in <ref>.\n\n\nBy continuity of the embedding ↪ C^0(e), we have that the nodal interpolation operator I_ is bounded, i.e., I_ w_≤ C w_ for all w∈. By choosing v^e=0, we thus have the stability estimate\n\n    inf_v^e∈ V_I_e^e w -I_ w -v^e_≤ C w_  for all  w∈.\n\nEmploying <ref> and using that w-_ w∈, we also have that\n\n    inf_v^e∈ V_I_e^e w -I_ w -v^e_≤C/√(λ_I_e+1^e)w_H^2(e)  for all  w∈ H^2(e).\n\nTherefore, we get by interpolation <cit.> that\n\n    inf_v^e∈ V_I_e^e w -I_ w -v^e_≤C/(λ_I_e+1^e)^14w_H^32(e)  for all  w∈ H^32(e).\n\n\n\n\n\n\nEmploying <ref> and <ref> and recalling that the best-approximation is realized via the projection P^e_I_e(w-I_ w), we also have that\n\n    inf_v^e∈ V_I_e^e w -I_ w -v^e_L^2(e)   ≤1/(λ^e_I_e)^34w_H^32(e)  for all  w∈ H^32(e).\n\nTherefore, by the interpolation inequality <ref>, the relations <ref> yield <ref>, which concludes the proof.\n\n\n\n\n§ GALERKIN APPROXIMATION\n \n\nWe start by observing that \n\n    (, v_Γ) = (,v_Γ) -(κ^2 ,v_Γ)+ iβℛ(,v_Γ) = 0,\n\nfor all ∈ and v_Γ∈,\nwhere we used that =0 on Γ_R and that  and v_Γ are _j-orthogonal by <ref>.\nTherefore, the weak Helmholtz problem <ref>\nis equivalent to: find ∈ and u_Γ∈ such that\n\n    (,)    = F()   for all ∈  and\n    (u_Γ,v_Γ)    = F(v_Γ)  for all  v_Γ∈.\n\n<ref> implies that  is uniquely defined. Since u is uniquely defined by <ref>, we conclude that also u_Γ is uniquely defined.\n\nAnalogously, the Galerkin approximation corresponding to <ref> is: find ∈ V_S such that\n\n    (,v_S) = F(v_S)  for all  v_S ∈ V_S.\n\nEquivalently, this can be split into two independent problems, namely a bubble approximation: find ∈ V_B,S_B such that\n\n    (,v_B,S_B) = F(v_B,S_B)   for all  v_B,S∈ V_B,S_B;\n\nand an interface approximation: find ∈ such that\n\n    (u_S,Γ,v_S,Γ) = F(v_S,Γ)  for all  v_S,Γ∈.\n\nThe Galerkin problem <ref> is well-posed under <ref>, while adjoint approximability is required to analyze the Galerkin problem <ref>; cf. <cit.>. In <ref> below, we prove estimates for the adjoint approximability constant, ensuring that also <ref> is well-posed as long as the number of edge modes is sufficiently large.\n\nIn the following subsections, we present an error analysis for the two independent approximation problems <ref>.\n\n\n\n §.§ Error estimates for the bubble approximation\n\nFor the statement of the approximation result, let us introduce the L^2-projection \n P^j_I_j:L^2(Ω)→ V_I_j^j, given by\n\n    P^j_I_jf=∑_i=1^I_j(κ^2 f,b_i^j)_ b_i^j.\n\n\n\n\n\nThe error analysis is then straight-forward. \n  \nAssume f ∈ L^2(Ω) and set f_κ:=f/κ^2.\nFor ∈ and ∈, defined in <ref>, respectively, we have the estimates:\n\n    κ(-)_L^2(Ω)^2 \n       ≤∑_j=1^J 1/|λ_*^j-1|^2κ (f_κ-P^j_I_jf_κ)_L^2()^2, \n    √(a)∇(-)_L^2(Ω)^2  \n       ≤∑_j=1^J λ_#^j/|λ_#^j-1|^2κ (f_κ-P^j_I_jf_κ)_L^2()^2,\n\nwhere λ_*^j =  argmin{|λ_i^j-1|, i≥ I_j+1}, \nand λ_#^j =  argmax{λ_i^j/|λ_i^j-1|^2, i≥ I_j+1}.\n\n\nSince {b_i^j}_i form an orthonormal basis for L^2() with the weighted inner product (κ^2 u,v)_, we may assume the expansion\n\n    = ∑_j=1^J ∑_i=1^∞ u_B,i^j b_i^j,    with  u_B,i^j = (κ^2 ,b_i^j)_.\n\nBy testing <ref> with v_B= b_i^j, for i∈, and observing that (,b_i^j)=_j (,b_i^j) - (κ^2 , b_i^j)_, we infer from <ref> that\nu_B,i^j = F(b_i^j)/(λ_i^j-1).\nConsequently, we obtain that\n\n    = ∑_j=1^J ∑_i=1^I_j u_B,S,i^j b_i^j,  with   u_B,S,i^j = F(b_i^j)(λ_i^j-1).\n\nTherefore, u_B,S,i^j=u_B,i^j for 1≤ i≤ I_j and 1≤ j≤ J. \nSince b_i^j=0 on ∂Ω, we further have that F(b_i^j) = (f, b_i^j)_Ω.\nHence, we conclude that\n\n    κ(-)_L^2(Ω)^2 \n    =∑_j=1^J ∑_i=I_j+1^∞1/|λ_i^j-1|^2|(f,b_i^j)_|^2,\n\nwhich, by <ref> and the definition of λ_*^j, implies <ref>.\n\nEstimate <ref> follows similarly from _j (b_i^j,b_i^j)=λ_i^j and\n\n    √(a)∇(-)_L^2(Ω)^2 \n    = ∑_j=1^J ∑_i=I_j+1^∞λ_i^j/|λ_i^j-1|^2|(f,b_i^j)_|^2.\n\n\n\n\nThe bubble error estimates depend on the wavenumber essentially only via λ_i^j, which can be made fully explicit by a scaling argument.\n\nMoreover,\n\n<ref>\nbecomes a diagonal system, which is easily solvable, also in parallel. \nMoreover, if f_|=0, then u_ B|=0, and the approximation error vanishes on .\n\n\n\n\n\n §.§ Well-posedness of the interface Galerkin problem\n\nWell-posedness of the Galerkin problem and quasi-best approximation results under an adjoint approximability condition follow as in <cit.>. To state the result let us introduce T^*χ=z, mapping χ∈ L^2(Ω) to the solution z∈⊂ of the dual problem\n\n    (v,z) = (v,χ)  for all  v∈,\n\nwhich is well-defined due to <ref>.\nThe approximation properties of the interface space  are measured by the adjoint approximability constant\n\n    σ^* = sup_φ∈ L^2(Ω)∖{0}inf_∈T^*( κ^2φ)-_/κφ.\n\nWith these preparations, we can state the abstract result <cit.> in our setting.\n\n\nSuppose that C_σ^*≤12, where C_ is defined in <ref> and σ^* is the adjoint approximability constant. Then, the Galerkin problem <ref> has a unique solution, and the following estimates hold:\n\n    u_Γ-_   ≤ 2 C_inf_∈u_Γ - _, \n    κ (u_Γ-)   ≤ 2 C_^2 σ^* inf_∈u_Γ - _.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Estimates of the best-approximation error in VGS\n\n\nQuantitative estimates for the interface approximation error follow from localizing the error to single edges and applying the estimates proven in <ref>.\n\n\nAssume that the solution u to <ref> is continuous in all vertices p∈ and u ∈ H^2(e) for all e∈,\nand denote as  the solution to <ref>. Then, \n\n\n    u_Γ-_≤∑_e∈C/(λ_I_e+1^e)^34Δ_e u-P^e_I_eΔ_e u_L^2(e)\n\nfor a constant C>0 independent of u and . \n\n\nAccording to <ref>, it suffices to estimate the best-approximation error inf_u_Γ-_.\n\nBy assumption, the nodal interpolant I_ u of u is well-defined and, by construction, we obtain that (u-I_ u)_| e∈.\n\nThese observations motivate the \n\nchoice\n\n    =  I_ u + ∑_e∈ P^e_I_e(u-I_ u),\n\nwith P^e_I_e introduced in <ref>.\nWe then have that u_Γ(p)-(p)=0 for all p∈. \nMoreover, in view of <ref>,\n(-)_| e∈⊂.\nTherefore, the error can be localized to single edges as follows\n\n    _|  - _| = j( u_|∂ - _|∂ ) = ∑_e∈, e⊂∂ ( (u_| e - _| e))_|.\n\nFrom the latter identity and from the definition <ref>, we obtain the following estimate\n\n    - _^2 \n    \n       ≤∑_j ∑_e∈,e⊂∂ (u_| e- _| e)_|_^2 \n       ≤ (1+κ_∞^2)C max_j(1+1β^j)^2∑_e∈u-_^2,\n\nwhere we used <ref> and equivalence of the -norm to the -norm.\nThe interpolation estimate <ref> then yield the assertion.\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf the solution has more regularity convergence improves, as long as the derivatives of the edge modes do not grow too quickly, which is true, e.g., if e is a line segment.\n\n In addition to the assumptions of <ref>, suppose that u∈ H^3(e) for all e∈. Moreover, assume that there is a constant C>0 such that |∂_eτ_i^e(p)|≤ C √(λ_i^e) for all i∈ and p∈∂ e.\n Then there is a constant C>0 such that\n\n    u_Γ-_≤ C ∑_e∈1/λ_I_e+1^e u_H^3(e).\n\n\n\nIn view of <ref> it suffices to bound (Δ_e u,τ_i^e)_e for i ≥ I_e+1. Since -Δ_e τ_i^e=λ_i^eτ_i^e on e by elliptic regularity, integration by parts yields that\n\n    (Δ_e u,τ_i^e)_e =- 1/λ_i^e (Δ_e u,Δ_eτ_i^e)_e\n    = 1/λ_i^e((∂_e^3 u,∂_eτ_i^e)_e+ [Δ_e u∂_eτ_i^e ]_q^p),\n\nwhere p,q denote the endpoints of e.\nThe assertion then follows from the Cauchy-Schwarz inequality, the continuity of the embedding ↪ C^0(e), <ref> and the assumed bounds on ∂_eτ_i^e.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Estimates for adjoint approximability constant\n\nThe well-posedness and the error estimates for the interface problem in <ref> relied on the smallness of the adjoint approximability constant σ^* defined in <ref>.\nIn order to estimate σ^* in our setting, we follow the ideas of <cit.>, \nwhere they work with piecewise linear finite elements, requiring H^2(Ω)-regularity of the adjoint problem <ref>. \nSince we need to consider the interface problem only, we can require a weaker H^2-regularity in the vicinity of the interface Γ. Let, for fixed δ>0, \n\n    Ω_Γ⊂{x∈Γ:  dist(x,Γ∪∂Ω)<δ}\n\ndenote an open neighborhood of Γ∪∂Ω such that ∂Ω_Γ∖∂Ω is smooth.\nWe start with a result similar to <ref> but with slightly weaker regularity assumptions.\n\n\nLet λ^Γ=min_eλ_I_e^e. Then, there exists a constant C>0 such that, for all z∈ H^2(Ω_Γ)∩, it holds that\n\n    inf_∈z-_≤C/√(λ^Γ)z_H^2(Ω_Γ).\n\n\n\nIn view of <ref> it suffices to estimate\n\n    inf_v^e∈ V_I_e^e z -I_ z - v^e _\n\nin terms of z_H^2(Ω_Γ).\n\nBy embedding, z∈ H^2(Ω_Γ) implies that z∈ H^32(e) for all e∈, and applying <ref> yields that\n\n    inf_∈z-_≤C/√(λ_I_e+1^e)z_H^32(e).\n\nHence, the definition of λ^Γ yields the assertion.\n\nAssuming regularity of the coefficients of the Helmholtz problem locally around the interface Γ, we can next estimate the adjoint approximability constant.\n\nIf a,c∈ C^0,1(Ω_Γ),\nthen there exists a constant C>0 such that\n\n    σ^* ≤C√(λ^Γ).\n\n\n\nIn view of <ref>, the key for estimating σ^*\nis to obtain an estimate for\n\n    inf_∈T^*(κ^2φ)-_\n\nin terms of κφ for arbitrary φ∈ L^2(Ω), where T^*(κ^2φ)∈ is the solution to the adjoint problem <ref>.\nSimilarly to the proof of <cit.>, it can been shown that there exists a constant C_*>0 such that\n\n    T^*(κ^2 φ)_H^2(Ω_Γ)≤ C_* κφ_L^2(Ω),\n\nwhich employs smoothness of the coefficients on Ω_Γ and elliptic regularity results for T^*(κ^2φ) as well as <ref> for the dual problem. \nA simple combination of <ref> yields the assertion.\n\nNote that the constant C_* in <ref> depends on  κ_∞, see <cit.> for details.\nA consequence of the previous result is that, by using sufficiently many edge modes, the assumptions of <ref> can be verified. Moreover, we obtain the following statement.\n\n\nIn addition to the assumptions of <ref> suppose that u∈ H^2+α(e) for all e∈, for α=0,1.\nThen, for some C>0, it holds\n\n    κ^2 (-)≤C/(λ^Γ)^54 + α4∑_e∈u_H^2+α(e).\n\n\n\nInserting the estimate <ref> for σ^* and the error bounds stated in <ref> (if α=0) or <ref> (if α=1) into <ref> yields the assertion. \n\n\n\n\n\n§ NUMERICAL RESULTS\n \nWe provide numerical experiments to support our theoretical results and show the effectiveness of our approach.\n\nSince, in general, we cannot compute the ACMS basis functions in <ref> analytically, we compute them approximately using an underlying finite element discretization that adopts piecewise linear and continuous functions. To do so, we employ a quasi-uniform triangulation \n\nof the computational domain Ω into triangles, such that each subdomain  is the union of elements of that triangulation; see, for instance, <ref>.\n\n\n\n\n\n\n\n\nWe denote the corresponding finite element solution of the Helmholtz problem by u_ FEM. Moreover, the resulting errors are quantified according to <ref>.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Classical Helmholtz example\n\nLet Ω=B_1(0) be the unit disc and Γ_R=∂Ω.\nWe first consider the boundary value problem given by <ref> with a(x) = 1, β(x)=1.\n\nThe source terms f and g are defined such that \nthe problem has the plane wave solution \n\n\tu(x) = exp(-ι  k· x),\n\nwith wave vector k=κ(0.6,0.8) and variable wavenumber κ. \nIn particular, f(x)=0, therefore the solution satisfies u_B=0, and u can be approximated by solving the interface problem <ref> only; see  <ref> and also <ref>.\n\nWe employ a decomposition of Ω as depicted in <ref> (left) with an initial coarse triangulation as shown in <ref> (right), which corresponds to a domain decompositions into J = 8 subdomains. In this domain decomposition, the \n\n\nnumber of edges in  is 12, \n\nand\nthe number of vertices in  equals 5.\nThe ACMS solution  and the finite element solution u_ FEM are computed using uniform refinements of the coarse triangulation; see <ref> (right).\n\n\n\n\n\n  §.§.§ Low wavenumber\n\nLet us first consider the case of a low wavenumber κ=1. In this setting, we obtain u_≈ 2.5 and u_L^2(Ω)≈ 1.8 for the plane wave solution u.\n\nWe compare the plane wave solution u with the approximation  given by the ACMS method \n\n\n\n\nfor different underlying finite element discretizations and multi-indices S_Γ, which define the order of the interface approximation space V_Γ,S_Γ introduced in <ref>.\nMoreover, we use the same value of  I_e ∈{2,4,8,…, 64} for each of the 12 edges in .\n \n\n\n<ref> shows the approximation error of the ACMS method and the corresponding errors for the nodal interpolant I_h(u) for each mesh resolution.\n\nWe observe that the H^1-error decreases with a rate between 3.5 and 4.0, until it approaches the accuracy of the nodal interpolant I_hu of\n\n\n\nthe underlying finite element mesh. Similarly, the L^2-error decays cubically for sufficiently fine finite element meshes.\nThis is in good agreement with <ref> and the relation λ_i^e ∼ i^2 stated in <ref>.\nWe may conclude that, already with a low number of edge modes I_e≤ 32, or which corresponds to |S_Γ|≤ 384, the ACMS solution achieves the accuracy of the nodal interpolant in the H^1-norm, which employs around 8·10^6 vertices for h≈ 3.4·10^-4.\nIn fact, as shown in <ref>, the ACMS solution converges to the (standard) finite element solution u_ FEM quadratically in the H^1-norm and cubically in the L^2-norm, respectively.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Higher wavenumbers\n\n\nWe now repeat the previous numerical experiments focusing on the effect of an increasing wavenumber; namely, we test our method for κ=2,4,8,16,32,64,128.\n\n\nLet us mention that <ref> is satisfied for all chosen wavenumbers and that the plane wave solution u changes with κ.\n\nIn <ref>, we show the convergence of the ACMS method to the finite element approximation u_ FEM and, for comparison, we display the error between the nodal interpolant and the finite element solution.\n\nAs expected, we can clearly observe a dependency of the error on the wavenumber.\n\nFor example, for |S_Γ|=1 536, the errors e_0,h and e_1,h grow roughly quadratically in κ. This is less than we would expect in view of <ref>, and we may explain this behavior by the choice of different but equivalent norms. \nIf one is satisfied with the approximation errors achieved by u_ FEM, we may again conclude that the ACMS method can yield good approximations already with a moderate number of degrees of freedom. We note that, by using higher order elements or further mesh refinements, the accuracy of u_ FEM may be increased; see <cit.>. Then, we would\n\nexpect that \n\nthe corresponding solution of the ACMS method would also show better accuracy in approximating the exact solution.\nIf, however, approximation in the L^2-norm is the main objective, one could as well resort to other approaches that do not suffer from the pollution effect in the high wavenumber case; see, e.g., <cit.>.\n\n\n\n\n\n\n\n §.§ Localized interior source\n\nIn certain applications, such as in geophysics <cit.>,\nthe source terms of the wave propagation are localized. Therefore, let us study the behavior of the ACMS method for this type of setup. Different from the previous section, let us consider the non-zero source function\n\n\n\n\n\n\n\n\nf(x) = exp(-200 | x- x_c|^2),\nwith x_c=(13,13), κ=1, and g ≡ 0.\n\nFor this example, no analytical expression of the solution u is available. Thus, we only investigate the convergence of the ACMS method towards the solution of the underlying finite element method, which is justified by the discussion \n\nin the previous sections.\n\n\n\n\n<ref> shows the results for varying numbers of bubble functions and edge modes. In view of <ref>, we note that ≈ 0 outside the subdomain  with x_c∈. Hence, for an accurate approximation, we only need bubble functions in that subdomains .\n\nMoreover, the linear system for the bubble component is diagonal and decoupled from the interface part. Hence, the solution coefficient corresponding to a specific bubble basis function can be computed independently from any other ACMS basis function; cf. <ref>.\n\n\nFor this highly localized source, we observe spectral convergence to the finite element solution when I_j≥ 32, given a sufficiently high number of edge modes.\nThis can be explained by inspecting the proof of <ref>: using repeatedly <ref>, integration-by-parts and that f and all its derivative are negligible on ∂, we can estimate (f, b_i^j)_ by arbitrary powers of λ_i^j; see also <ref> for similar steps. For a high number of bubble functions, a saturation effect occurs. This can be due to the limited quantity of edge modes or to the fact that the values of higher-order derivatives of f are not negligible anymore.\nWhen increasing the selected edge modes while keeping the number of bubble functions fixed, the convergence approaches the predicted quadratic and cubic rates for the H^1- and the L^2-error, respectively.\nSince the Galerkin problems for the bubble part and the interface are decoupled (see <ref>), the size of the systems to be solved remains comparably small. \nTherefore, we conclude that, for a moderate number of degrees of freedom, we obtain very good approximations of the finite element solution.\n\n\n\n §.§ Localized boundary source\n \nNext, let us modify the classical Helmholtz example from <ref> such that κ=16, f=0, and \ng(x)=exp(-200|x-x_c|^2), with x_c=(-1√(2),1√(2)). \nIn <ref>, we display the real and imaginary part of the finite element solution computed on a quasi-uniform mesh with 521 217 vertices, i.e., h≈ 1.3· 10^-3. Although the source is very localized around x_c, the whole domain is excited, indicating the wave-type behavior of the solution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSince f=0 here, we do not need any bubble functions to obtain convergence according to <ref>. As we do not have an analytic solution, we investigate the error between u_ FEM and  for varying number of edge modes.\n\nThe results are shown in <ref>, where we consider the relative errors since the solution values are rather small.\n\nAs predicted by <ref>, we observe second order convergence for the H^1-error, while convergence is initially slightly faster. The L^2-error shows a similar behavior with a convergence rate approaching third order; cf. <ref>.\nWe again may conclude that we can approximate the highly resolved standard finite element solution using a moderate number of edge modes in the ACMS method.\n\n\n\n §.§ Periodic structure\n \nLet us conclude our numerical experiments with a heterogeneous Helmholtz problem on a domain decomposition as in <ref> (left) with a heterogeneous diffusion coefficient a depicted in <ref> (right). This configuration is similar to the modeling of two-dimensional photonic crystals <cit.>. We choose wavenumber  κ=100, interior source f=0, and the localized boundary source\ng(x)=exp(-ι k· x)exp(-100|x-x_c|^2),\nwith x_c=(0,12) and wave vector k=κ (1,0).\n\nThe corresponding finite element solution, which has been computed on a quasi-uniform triangulation with 5 330 337 vertices, is shown in <ref>.\n\n\n\n\n\n\nSince, again, f=0, we only need to study the behavior for varying numbers of edge modes, while the bubble part of the solution  is zero.\n\nNote that we can choose Ω_Γ defined in <ref> inside the region with a=1; cf. <ref>.\nThe relative H^1- and L^2-errors between the finite element solution and the ACMS solution are listed in <ref>. For |S_Γ|=2 880, which corresponds to the case of 16 modes per edge, the ACMS discretization already yields a good approximation to the highly resolved finite element solution. Moreover, the convergence of the error is initially even better than predicted by our theoretical results for |S_Γ| ≥ 720.\n\n\n\n§ CONCLUSIONS\n\nWe extended the ACMS method, which has originally been developed for elliptic problems, to the heterogeneous Helmholtz equation.\nThis framework \n\nis based on a decomposition into local Helmholtz problems and an interface problem, that can be solved separately. The numerical approximation of those problems is achieved by using basis functions with local support and which can be constructed locally as well.\n\nThe error analysis developed for the investigated method is based on the abstract framework introduced in <cit.>, and it is possible to trace the wavenumber dependency of the involved constants.\nWe proved error estimates in the H^1- and the L^2-norm, and we obtained algebraic decay in the number of basis functions (modes) being used. \nIn order to be able to apply the framework of <cit.>, we presented estimates for the adjoint approximability constants, which can be understood as a `sufficient resolution' condition for the problem at hand. \nIn order to satisfy this resolution condition, the number of edge modes should be sufficiently large in relation to the wavenumber.\nMoreover, we showed applicability of the method also if the diffusion coefficient is not smooth, as long as smoothness in a neighborhood of the interface is guaranteed.\n\nFinally, we exemplified the theoretical error bounds by numerical experiments, which show the accuracy of the investigated ACMS method for moderate wavenumbers. We constructed the ACMS basis functions using a finite element method, and we observed that the resulting discrete ACMS method approximates well the corresponding finite element solution. Thus, we may conclude that the accuracy of the discrete ACMS method depends on the accuracy of the underlying finite element method, and smaller errors might be achieved by using high-order finite elements. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n\nEG and MS acknowledge support by the Dutch Research council (NWO) via grant OCENW.GROOT.2019.071.\nAH and MS acknowledge support by the 4TU.AMI SRI Bridging Numerical Analysis and Machine Learning.\n\nsiamplain\n\n\n"}