{"entry_id": "http://arxiv.org/abs/2303.12662v1", "published": "20230312142029", "title": "Multipolar Acoustic Source Reconstruction from Sparse Far-Field Data using ALOHA", "authors": ["Yukun Guo", "Abdul Wahab", "Xianchao Wang"], "primary_category": "cs.IT", "categories": ["cs.IT", "eess.SP", "math.IT"], "text": "\n\t\n\n\t\n\tMultipolar Acoustic Source Reconstruction from Sparse Far-Field Data using ALOHA[1]\n    \n\t\tYukun Guo[2]\n\t\t\n\n\t\tAbdul Wahab[3] [4] \n            Xianchao Wang[2] \n\t\n    March 30, 2023\n===================================================================================\n\n\n\t[1]The work of Y. G and X. W was supported by the National Natural Science Foundation of China (NSFC) grant 11971133. The work of A.W. was supported by Nazarbayev University, Kazakhstan through Faculty Development Competitive Research Grant Program (FDCRGP) grant 1022021FD2914 and the Social Policy Grant.\n\t[2]School of Mathematics, Harbin Institute of Technology, Harbin, P. R. China (xcwang90@gmail.com; ykguo@hit.edu.cn).\n\n\t[3]Department of Mathematics, School of Sciences and Humanities, Nazarbayev University, 53, Kabanbay Batyr Avenue, 010000, Nur-Sultan, Kazakhstan (abdul.wahab@nu.edu.kz)\n\t[4]Corresponding author: A. Wahab at abdul.wahab@nu.edu.kz.\n\t\n \n\t\tThe reconstruction of multipolar acoustic or electromagnetic sources from their far-field radiation patterns plays a crucial role in numerous practical applications. Most of the existing techniques for source reconstruction require dense multi-frequency data at the Nyquist sampling rate. Accessibility of only sparse data at a sub-sampled grid contributes to the null space of the inverse source-to-data operator, which causes significant imaging artifacts. For this purpose, additional knowledge about the source or regularization is required. In this article, we propose a novel two-stage strategy for multipolar source reconstruction from the sub-sampled sparse data that takes advantage of the sparsity of the sources in the physical domain. The data at the Nyquist sampling rate is recovered from sub-sampled data and then a conventional inversion algorithm is used to reconstruct sources. The data recovery problem is linked to a spectrum recovery problem for the signal with the finite rate of innovations (FIR) that is solved using an annihilating filter-based structured Hankel matrix completion approach (ALOHA). For an accurate reconstruction of multipolar sources, we employ a Fourier inversion algorithm. The suitability of the suggested approach for both noisy and noise-free measurements is supported by numerical evidence.\n\t\n\t\n\tKeywords: ALOHA; compressed sensing;  inverse source problem; multipolar source; sparse data imaging\n\t\n\n\n§ INTRODUCTION\n\n\t\n\t\nInverse source problems have numerous applications in science and engineering, particularly in the fields of biomedical imaging <cit.>, non-destructive testing <cit.>, telecommunication <cit.>, seismology <cit.>, and atmospheric sciences <cit.>. Several algorithms have been developed for the resolution of inverse source problems in acoustic and electromagnetic media given their potential applications, experimental setup, practical needs or source types, and mathematical or engineering aspects.\n\nLeone, Maisto, and Pierri <cit.> employed inverse source problems in electromagnetic media to synthesize conformal antennas. Beltrachini et al. <cit.> and Thio et al. <cit.> have used inverse source problems to simulate neuron responses for intracranial recordings and for electroencephalography (EEG). In a similar vein, inverse source problems have been used in magnetoencephalography (MEG), for example, in <cit.>. An inverse problem for the reconstruction of temporally localized acoustic sources relevant to photoacoustic tomography has been dealt with by Ammari et al. <cit.>. Given their potential uses in security robots, cross-correlation-based passive imaging algorithms were suggested in <cit.> for locating correlated ambient noise sources in attenuating acoustic media. A deep learning elastography framework that uses sparse dynamic measurements was suggested in <cit.>.\n\nOn the technical side, Devaney, Marengo, and Li <cit.> developed a broad mathematical framework for inverse source problems in non-homogeneous media and proposed an optimization framework for reconstructing the minimal-energy sources. A framework based on finite elements was proposed in <cit.> for the detection of multipolar sources with applications in EEG. To find directive sources that resemble Gaussian beams, Eibert et al. <cit.> suggested a solution framework based on the Huygens radiator concept. Multiple Signal Classification (MUSIC) algorithms for inverse source problems were discussed in <cit.>. \n\nThe only measurements of the radiated waves that can be taken in the majority of real-world inverse source problems and imaging setups are multi-frequency discrete measurements. The application of many mathematical methods is stymied by this restriction. The existence of non-radiating sources whose signatures cannot be captured raises concerns about the availability of a unique solution. Mathematical discussions on the issue of the existence of a unique solution for multi-frequency discrete measurements may be found, for example, in <cit.>. For these issues, several mathematical algorithms have been put forth. There are some potential workarounds, such as least-squares-based minimum energy solutions <cit.>, regularization techniques <cit.>, or making use of some à priori knowledge about the sources <cit.>. By using measurements over a range of frequencies in an open interval, certain strategies overcome the non-uniqueness issue. For example, we mention <cit.> for expansion methods, <cit.> for recursive algorithms, <cit.> for sampling methods, <cit.> for Fourier approaches, and <cit.> for factorization techniques.\n\nIn this article, we propose a novel numerical strategy for solving the inverse source problem of imaging multipolar acoustic sources from sparse multi-frequency far-field data. The suitability of multipolar sources for localization of epileptogenic sources using EEG <cit.>, neuron response modeling using stereo-EEG (sEEG) <cit.>, cortical cavity localization using MEG <cit.>,  and confocal antenna synthesis <cit.> serves as the impetus behind our work.\n\nIn the past, factorization <cit.>, Prony's  <cit.>, MUSIC <cit.>, and compressed sensing <cit.> algorithms have been used to identify multipolar acoustic sources using sparse far-field data. However, the advantage of the inherent sparsity of multipolar sources in the physical medium has never been taken. In this article, we take advantage of this inherent sparsity of the multipolar sources to recover an enriched set of measurements at the Nyquist sampling rate and then adopt a Fourier inversion approach previously suggested in <cit.>  to reconstruct these sources. Based on the theory of the signal with the finite rate of innovations (FRI) <cit.>, we relate the problem of the recovery of measurements to the low rankness of a structured Hankel matrix and use an annihilating filter-based low-rank Hankel matrix completion approach (ALOHA) <cit.>. \n\nThe rest of the article is organized as follows. In Section <ref>, we mathematically formulate the inverse problem of interest. In Section <ref>, we discuss the integration of ALOHA with the Fourier inversion method. Numerical results and a discussion are provided in Section <ref>. The conclusion is provided in Section <ref>.\n\t\n\n\n§ MATHEMATICAL FORMULATION\n \n\nWe assume that S() is a frequency-independent multipolar source function defined by \n\n    S():=∑_j=1^J(λ_j+_j·∇_)δ (-_j),      J∈ℕ_+,\n\nwhere δ is the Dirac mass and ∇_ is the distributional gradient with respect to ∈^d, for d=2 or 3.  The points _1, _2, ⋯, _J∈^d denote the locations of component multipolar sources that are compactly embedded in the box\n\n    𝔸:=(-a2, a2)^d⊂^d,      a∈_+,\n \nand constants λ_j∈ and _j∈_+^d are the corresponding intensities that satisfy conditions\n\n    |λ_j|+|_j|≠ 0   and   |λ_j_j|=0,     for   j=1,⋯, J.\n\n\n\nThe radiation pattern, u(,k), of the multipolar source S() satisfies the Helmholtz equation, \n\n    (Δ+k^2)u(,k)=S(),     ∈^d,\n\nand Sommerfeld's outgoing radiation condition,\n\n    lim_||→∞||^(d-1)/2(∂ u∂ ||-ι k u)(,k)=0,   ι:=√(-1).\n\nThe parameter k∈_+ is the so-called wavenumber. We highlight that the radiation condition holds uniformly with respect to all directions \n\n    :=||∈𝕊^d-1:={∈^d:   ||=1},\n\nwhere 𝕊^d-1 represents the unit ball in ℝ^d. Here and throughout this article, a quantity with length normalized to one is marked by a superposed hat. \n\nThe outgoing radiation condition (<ref>) guarantees the existence of an analytic field u_∞:𝕊^d-1×_+→ℂ that signifies the far-field radiation signature of the radiated field u and is defined by the relation\n\n    u(,k)=e^-ι k||||^(d-1)/2(u_∞(,k)+O(1||)),      ||→∞.\n\n\nTo define the multi-frequency measurement grid, we introduce a parameter ϵ∈_+ such that ϵ→ 0^+ and set \nℓ_0:= (ϵ, 0) for d=2 or ℓ_0:=(ϵ,0,0) for d=3. We also introduce \n\n    _ℓ:=   ℓ̂,    ℓ∈ℤ^d∖{0},\n    ℓ̂_0,    ℓ=0, \n    \n    \n    k_ℓ:=   2πa\n    |ℓ|,    ℓ∈ℤ^d∖{0},\n    ϵ,    ℓ=0,\n\nand \n\n    𝕊^d-1_ dis:=   {_ℓ∈𝕊^d-1 |  ℓ∈ℤ^d}.\n\n\nLet Ω_M:={_1,⋯,_M}⊂𝕊^d-1_ dis\nbe the full set of sampling points at the Nyquist sampling rate, i.e., the sampling points, _m, for m=1,⋯, M, are chosen k_ min/2 distant apart from each other, where k_ min:= min{k_1,⋯, k_M} with k_m defined by (<ref>), associated with the sampling point _m defined by (<ref>). \nWe also define the sparse set of measurement points, Ω_M_R, as a (randomly chosen) subset of Ω_M for R≪ M, i.e.,   \n\n    Ω_M_R:={_M_r |   r=1,⋯, R}⊂Ω_M⊂𝕊^d-1_ dis.\n\n\n We consider the following inverse source problems in this article. \n\n[Full measurements inverse source problem]\nRecover the source function S() defined in (<ref>) given the multi-frequency far-field data \n  \n    {u_∞(_m, k_m) |   _m∈Ω_M,   m=1,⋯,M}.\n \n\n\n[Sparse measurements inverse source problem]\nRecover the source function S() defined in (<ref>) given the multi-frequency far-field data \n  \n    {u_∞(_M_r, k_M_r) |  _M_r∈Ω_M_R,    r=1,⋯, R}.\n\n\n\n\n\n§ HANKEL MATRIX COMPLETION APPROACH\n\n\nThe full measurement multi-frequency data inverse source problem (Problem <ref>) was solved in <cit.> using a Fourier inversion technique. To this end, recall that S can be represented by the Fourier series    \n\n    S()=∑_ℓ∈ℤ^ds̃_ℓϕ_ℓ()\n      with  s̃_ℓ =1a^d∫_𝔸 S()ϕ_ℓ()d.\n\nHere, the superposed bar indicates complex conjugate and the Fourier basis functions, ϕ_ℓ(), are given by \n\n    ϕ_ℓ():= e^ι2π/aℓ·,     ℓ∈ℤ^d.\n\nThe Fourier coefficients, s̃_ℓ, can be easily calculated using the far-field measurements. To this end, the following result is proved in <cit.>.\n\nLet _ℓ and k_ℓ be, respectively, defined by (<ref>) and (<ref>), then the Fourier coefficients \n{s̃_ℓ}_ℓ∈ℤ^d of S() can be determined uniquely by \n{u_∞(_ℓ, k_ℓ)|ℓ∈ℤ^d} and for any positive integer N→+∞,\n\n    s̃_ℓ=   \n    -1a^dγ_d u_∞(_ℓ, k_ℓ),     ℓ∈ℤ^d∖{0}, \n    s̃_ℓ_0≈   -ϵπa^dsin(ϵπ)γ_d u_∞(_ℓ_0, k_ℓ_0)+∑_1≤ |ℓ|_∞≤ Ns̃_ℓ∫_𝔸ϕ_ℓ()ϕ_ℓ_0() d,\n\nwhere N is a truncation parameter to retain a finite number of terms in the inversion and\n\n    γ_d:= e^ιπ/4√(8π k_ℓ)  for d=2 or  γ_d:=14π  for d=3.\n\n\n\nGiven Theorem <ref>, the source S can be reconstructed very accurately when enough multi-frequency measurements are available at dense sampling points ∈Ω_M at the Nyquist sampling rate, as all the Fourier coefficients can be calculated subject to measurement noise and an approximation of s̃_ℓ_0. However, the situation changes drastically when the recording grid is under-sampled. A part of the source S behaves like a non-radiated component since its radiation signature is not detected. The missing spectrum corresponding to the unrecorded sampling points and unused frequency profiles contributes to the null space of the inverse source-to-data operator due to under-sampling <cit.>. To this end, a traditional remedy is to use conventional or sparsity-promoting regularization methods to solve Problem <ref> <cit.>. As numerically illustrated in Section <ref>, such regularization approaches are not very useful because the size of the speckle field introduced by the under-sampling is comparable to or even larger than the size of the multipolar sources. Contrary to the conventional regularization approaches, we suggest exploiting the sparsity of the multipolar sources inside the background medium. In this section, we propose a two-stage numerical strategy to address Problem <ref>. We assume a sampling at the Nyquist rate and that the given sparse measurements constitute a (random) part of the full grid measurements while the rest are missing. Subsequently, we link the missing spectral values to the low-rankness of a structured Hankel matrix and recover them using ALOHA. Once the full Nyquist grid measurements are recovered, we use Theorem <ref> in the second stage to recover the source S.\n\nSince S is sparsely supported in the box 𝔸⊂^d, it has a sparsely distributed Fourier spectrum in the low spatial frequency regions. Therefore, according to the sampling theory of a signal with a finite rate of innovations <cit.>,  there exists an annihilating filter, 𝐡, in the Fourier domain for the corresponding spectral vector 𝐬̃ at the Nyquist sampling rate such that\n\n    (𝐡⋆𝐬̃)_k:=∑_i=0^n[𝐡]_i[𝐬̃]_k-i=0.\n\nHere, [𝐮]_i represents the ith component of the vector 𝐮,  n+1 is the length of the annihilating filter 𝐡, and ⋆ is the convolution operator. Consequently, the structured Hankel matrix (a sub-matrix of the corresponding convolution matrix), \n\n    ℋ_p(𝐬̃):=\n    [   s̃_1   s̃_2      ⋯   s̃_p;   s̃_2   s̃_3      ⋯ s̃_p+1;      ⋮      ⋮      ⋱      ⋮;   s̃_M   s̃_1      ⋯ s̃_p-1 ],\n\nassociated to the vector 𝐬̃∈^M is rank-deficient if the matrix-pencil size p (<M) is chosen larger than the minimum annihilating filter size since \n\n    ℋ_p(𝐬̃)𝐡'=0,\n\nwhere 𝐡' is the flipped version of vector 𝐡. \nSpecifically, it was shown in <cit.> that if the minimum annihilating filter length is n+1,\n\n    rank(ℋ_p(𝐬̃))=n.\n\nInterested readers are referred to the articles <cit.> for further details.\n\nGiven the relations (<ref>) and (<ref>) and sparsely sampled spectral measurements, {u_∞(_M_r, k_M_r) |  _M_r∈Ω_M_R}, the estimation problem of recovering the missing spectrum {u_∞(_M, k_M) |  _M∈Ω_M∖Ω_M_R} for 𝐬̃ can be formulated as the low-rank Hankel matrix completion problem,\n\n    argmin_𝐠∈𝐂^Mℋ_p(𝐠)_*     subject to    P_Ω_M_R(𝐠)=P_Ω_M_R(𝐬̃),\n\nwhere 𝒫_Ω_M_R denotes the projection on the set Ω_M_R and ·_* denotes the matrix nuclear norm. A unique minimizer to the structured matrix completion problem (<ref>) is guaranteed with probability 1-1/M^2 under a standard incoherence assumption on ℋ_p(𝐠) <cit.>.  \n\nSeveral algorithms can be used to solve the low-rank matrix completion problem (<ref>) but we use ALOHA <cit.> in the proposed numerical scheme due to its robustness and performance guarantee. It is a singular value decomposition (SVD)-free algorithm that uses a low-rank factorization model for initialization. Specifically, the optimization problem (<ref>) is first converted to the constrained optimization problem \n\n    min_𝐠∈ℂ(𝐔_F^2+𝐕_F^2) \n    \n       subject to ℋ_p(𝐠)=𝐔𝐕^H\n     and  P_Ω_M_R(𝐠)=P_Ω_M_R(𝐬̃),\n\nbased on the observation that\n\n    ℋ_p(𝐠)_*= min_(𝐔,𝐕)∈𝕄(𝐔_F^2+𝐕_F^2),   where  𝕄:={(𝐔,𝐕)|  ℋ_p(𝐠) = 𝐔𝐕^H},\n\nand then solved using the alternating direction method of multipliers (ADMM) <cit.>. We specify that the superposed H above represents the Hermitian transpose and ·_F is the Frobenius norm.  Once a minimizer 𝐠^* is found, the required source function S(x) can be reconstructed as\n\n    S_ recon()=∑_m=1^M [𝐠^*]_mϕ_m().\n \n\n\n\n§ NUMERICAL EXPERIMENTS AND DISCUSSION\n\n\nIn this section, we provide evidence of the suitability of the proposed two-stage numerical strategy. We first present the experimental setup in Section <ref> and then discuss reconstruction results in Section <ref>.\n\n\n\n §.§ Experimental setup\n\n\nFor numerical simulations, we consider a two-dimensional setting. The multipolar acoustic source S consists of two monopoles and two dipoles (see Fig. <ref>). The monopoles are located at positions _1:=(5, 4) and _2:=(-4, -4) with magnitudes λ_1:=9 and λ_2:=8, respectively. The dipoles are located at positions _3:=(-4, 5) and _4:=(4, -4) with intensities _3:=(1, -1)^T and _4:=(-1, 1)^T, respectively. Note that _1=0=_2 and λ_3=0=λ_4 due to conditions (<ref>). \n\n\nFollowing definitions  (<ref>) and (<ref>), the admissible sets of observation directions and wavenumbers are defined as\n\n    𝕏_N:=   {_ℓ= ℓ/|ℓ|  |   1≤|ℓ|_∞≤ N   }∪{ (1, 0) },\n    \n    𝕂_N:=   { k_ℓ=2π|ℓ|/a  |   1≤|ℓ|_∞≤ N   }∪{2π/aϵ}.\n\nThe arc length a of the domain, parameter ϵ, and Fourier series truncation parameter N are set to a=12, ϵ=10^-3, and N=20. The synthetic far-field patterns are generated by numerical integration of the formula\n\n    u_∞(_ℓ, k_ℓ )=-γ_d ∫_𝔸     S()   e^-ι k_ℓ_ℓ·  d.\n\n\nWe perform source reconstruction for two scenarios: (1) ideal measurement conditions without measurement noise, and (2) extremely noisy measurement conditions with an additive white Gaussian noise (AWGN) having a signal-to-noise ratio (SNR) of 3dB. For each scenario, four different sub-sampling rates, 5%, 10%, 15%, and 30%, were considered. The performance of the proposed algorithm was evaluated on three different criteria: (1) visual perception in terms of the peak-signal-to-noise ratio (PSNR), (2) structural similarity in terms of the structural similarity index measure (SSIM), and (3) computational time in terms of walk-clock run-time.  \n\nEach reconstructed image obtained from sparse far-field data using ALOHA is compared with (1) original image obtained from fully-sampled data at Nyquist rate, (2) input image obtained from the sub-sampled data without any regularization, and (3) L1-CS image obtained from the sub-sampled data with an L1-compressed sensing-based sparse regularization <cit.>. \n\nFor signal recovery, the number of filters in ALOHA was set to 15, but all other settings were kept to the default configuration. For the L1-CS, CVX, an all-platforms (v1.22) redistributable CVX package for specifying and solving convex programs <cit.>, was used. The visualization of monopole sources is somewhat limited in the input and L1-CS images, even with 30% measurements. Accordingly, the scales of the individual images are adjusted to emphasize the visual results. For computational time estimation, both ALOHA and L1-CS were implemented on the MATLAB cloud platform running on an Intel(R) Platinum 8375C CPU @ 2.90 GHz CPU, of clock speed 3464.412 MHz, equipped with 128GB RAM.\n\n\n\n §.§ Numerical results\n\n\nNumerical simulations with noise-free and noisy measurements are presented in Figs. <ref> and <ref>, respectively. Fig. <ref> shows that the conventional algorithm is unable to properly identify point sources from sub-sampled, noise-free data. The L1-CS approach improves the overall signal strength and compensates for the measurement losses in terms of PSNR even when just 5% of the measurements are used, but the gain is not effective enough. The performance of the L1-CS method is susceptible to the number of available measurements. The speckle field induced by the sub-sampling has random hot spots with typical diameters comparable to the size of the sources. As a result, it is challenging to distinguish the sources from the hot spots.\nThe proposed ALOHA-based strategy, on the other hand, effectively reconstructs the sources using sparse measurements and preserves the quality even with just 5% of the original measurements. For the noisy measurement scenario, similar observations can be made. Fig. <ref> shows that when the number and diameter of the hot spots in the speckle field increase due to under-sampling, the optical enhancement provided by L1-CS is less pronounced. Nevertheless, ALOHA is still able to provide incredibly efficient results.\n \n\n\n\nFor further analysis, PSNR, SSIM, and computational time are evaluated for 0 to 100% of measurements with and without additive white Gaussian noise. Table <ref> provides a quantitative performance comparison of the sparse reconstruction algorithms. The superiority of the proposed approach is substantiated in Fig. <ref> for both the noise-free and noisy measurement scenarios. Since the target spectrum only consists of point sources, fewer measurements produce the speckle field in the background medium, which lowers the structural similarity. As a result, for measurements under 50%, the structural similarity of the sub-sampled reconstruction decreases as the number of measurements rises, but it begins to rise for measurements beyond 50%.\nAlthough the L1-CS method increases PSNR at higher sampling rates, the structural similarity is not improved since its SSIM is smaller than the sub-sampled input in some cases. In contrast, the proposed ALOHA-based approach produces excellent PNSR and SSIM results even with just 5% measurements. Interestingly, with 100% noisy measurements, all curves meet at the same point (i.e., maximum PSNR and SSIM); however, for sub-sampled noisy measurements, ALOHA not only recovers the lost signal but also lowers the noise (see PSNR and SSIM curves in Fig. <ref> (Bottom)).\n\n\n\n\nAnother benefit of using ALOHA over the conventional sparse reconstruction approach L1-CS is its computational complexity. Fig. <ref> (right column) compares the walk-clock run-time of ALOHA with that of the L1-CS method. Once again, it is evident that the proposed Hankel matrix completion approach outperforms the conventional sparsity-promoting regularization approaches. The L1-CS method has a computational cost that is exponentially proportional to the number of measurements, whereas that for ALOHA is linear. This substantiates the robustness of the proposed approach.\n\n\n\n§ CONCLUSIONS\n\n\nWe propose a two-stage numerical scheme for reconstructing multipolar sources using sparse multi-frequency far-field data. First, the sparse data is enriched using a structured Hankel matrix completion approach. The sources are then reconstructed using the Fourier inversion algorithm from enriched data at the Nyquist rate. The measurement recovery problem is recast as the recovery problem for the missing spectrum of signals with a finite rate of innovations, which is solved using an annihilating filter-based structured Hankel matrix completion approach (ALOHA). Simulation results provide evidence that the proposed algorithm is much superior to the traditional regularization-based inversion strategies. We compared the peak signal-to-noise ratio (PSNR), structural similarity index measure (SSIM), and computational cost of the proposed approach with the sparsity-promoting L1 compressed sensing regularization technique. The proposed numerical scheme provides simulation results with a 10.1dB PSNR (41%) and a 0.266 SSIM (40.8%) increase in the worst-case scenario with a linear computing cost for both noise-free and noisy data with 3dB noise.\n\t\n\n\n§ COMPETING INTERESTS\n\n\nThe author(s) declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article.\n\n\n\n§ ACKNOWLEDGMENT\n\n\nThe authors would like to thank Prof. Jong Chul Ye and Prof. Kyong Hwan Jin for providing the MATLAB code of ALOHA. The authors would also like to thank Dr. Shujaat Khan for his technical support and fruitful discussions. \n\t\n10\n\nurl@samestyle\n\n\n\n\n\n\n\n\nThio23\nB. J. Thio, A. S. Aberra, G. E. Dessert, and W. M. Grill, “Ideal current\n  dipoles are appropriate source representations for simulating neurons for\n  intracranial recordings,” Clinical Neurophysiology, vol. 145, pp.\n  26–35, 2023.\n\nBeltrachini21\nL. Beltrachini, N. von Ellenrieder, R. Eichardt, and J. Haueisen, “Optimal\n  design of on-scalp electromagnetic sensor arrays for brain source\n  localisation,” Human Brain Mapping, vol. 42, no. 15, pp. 4869–4879,\n  2021.\n\nAmmari12\nH. Ammari, E. Bretin, V. Jugnon, and A. Wahab, “Photoacoustic imaging for\n  attenuating acoustic media,” in Mathematical Modeling in Biomedical\n  Imaging II: Optical, Ultrasound, and Opto-Acoustic Tomographies, H. Ammari,\n  Ed.1em plus 0.5em minus 0.4emBerlin, Heidelberg: Springer,\n  2012, pp. 57–84.\n\nTakahashi22\nS. Takahashi, K. Suzuki, T. Hanabusa, and S. Kidera, “Microwave subsurface\n  imaging method by incorporating radar and tomographic approaches,”\n  IEEE Transactions on Antennas and Propagation, vol. 70, no. 11, pp.\n  11 009–11 023, 2022.\n\nLeone18\nG. Leone, M. A. Maisto, and R. Pierri, “Application of inverse source\n  reconstruction to conformal antennas synthesis,” IEEE Transactions on\n  Antennas and Propagation, vol. 66, no. 3, pp. 1436–1445, 2018.\n\nApostol\nB. F. Apostol, “An inverse problem in seismology: Derivation of the seismic\n  source parameters from p and s seismic waves,” Journal of Seismology,\n  vol. 23, no. 1, pp. 1017–1030, 2019.\n\nBadia02\nA. E. Badia and T. Ha-Duong, “On an inverse source problem for the heat\n  equation. application to a pollution detection problem,” Journal of\n  Inverse and Ill-posed Problems, vol. 10, no. 6, pp. 585–599, 2002.\n\nAmmariN\nH. Ammari, E. Bretin, J. Garnier, and A. Wahab, “Noise source localization in\n  an attenuating medium,” SIAM Journal on Applied Mathematics, vol. 72,\n  no. 1, pp. 317–336, 2012.\n\nJerbi04\nK. Jerbi, S. Baillet, J. Mosher, G. Nolte, L. Garnero, and R. Leahy,\n  “Localization of realistic cortical activity in MEG using current\n  multipoles,” NeuroImage, vol. 22, no. 2, pp. 779–793, 2004.\n\nYoo2018\nJ. Yoo, A. Wahab, and J. C. Ye, “A mathematical framework for deep learning in\n  elastic source imaging,” SIAM Journal on Applied Mathematics,\n  vol. 78, no. 5, pp. 2791–2818, 2018.\n\nDevaney\nA. J. Devaney, E. A. Marengo, and M. Li, “Inverse source problem in\n  nonhomogeneous background media,” SIAM Journal on Applied\n  Mathematics, vol. 67, no. 5, pp. 1353–1378, 2007.\n\nBeltrachini19\nL. Beltrachini, “A finite element solution of the forward problem in EEG for\n  multipolar sources,” IEEE Transactions on Neural Systems and\n  Rehabilitation Engineering, vol. 27, no. 3, pp. 368–377, 2019.\n\nEibert16\nT. F. Eibert, D. Vojvodić, and T. B. Hansen, “Fast inverse equivalent source\n  solutions with directive sources,” IEEE Transactions on Antennas and\n  Propagation, vol. 64, no. 11, pp. 4713–4724, 2016.\n\nGriesmaier017b\nR. Griesmaier and C. Schmiedecke, “A multifrequency MUSIC algorithm for\n  locating small inhomogeneities in inverse scattering,” Inverse\n  Problems, vol. 33, no. 3, p. 035015, 2017.\n\nBleistein\nN. Bleistein and J. K. Cohen, “Nonuniqueness in the inverse source problem in\n  acoustics and electromagnetics,” Journal of Mathematical Physics,\n  vol. 18, no. 2, pp. 194–201, 1977.\n\nHanke1\nR. Griesmaier, M. Hanke, and T. Raasch, “Inverse source problems for the\n  Helmholtz equation and the windowed Fourier transform,” SIAM\n  Journal on Scientific Computing, vol. 34, no. 3, pp. A1544–A1562, 2012.\n\nSaman\nA. Wahab, A. Rasheed, R. Nawaz, and S. Anjum, “Localization of extended\n  current source with finite frequencies,” Comptes Rendus Mathematique,\n  vol. 352, no. 11, pp. 917–921, 2014.\n\nKusiak1\nS. Kusiak and J. Sylvester, “The convex scattering support in a background\n  medium,” SIAM Journal on Mathematical Analysis, vol. 36, no. 4, pp.\n  1142–1158, 2005.\n\nEller09\nM. Eller and N. P. Valdivia, “Acoustic source identification using multiple\n  frequency information,” Inverse Problems, vol. 25, no. 11, p. 115005,\n  2009.\n\nBao15IP\nG. Bao, P. Li, J. Lin, and F. Triki, “Inverse scattering problems with\n  multi-frequencies,” Inverse Problems, vol. 31, no. 9, p. 093001,\n  2015.\n\nBao15SNA\nG. Bao, S. Lu, W. Rundell, and B. Xu, “A recursive algorithm for\n  multifrequency acoustic inverse source problems,” SIAM Journal on\n  Numerical Analysis, vol. 53, no. 3, pp. 1608–1628, 2015.\n\nAlzaalig20\nA. Alzaalig, G. Hu, X. Liu, and J. Sun, “Fast acoustic source imaging using\n  multi-frequency sparse data,” Inverse Problems, vol. 36, no. 2, p.\n  025009, 2020.\n\nWang\nX. Wang, Y. Guo, D. Zhang, and H. Liu, “Fourier method for recovering acoustic\n  sources from multi-frequency far-field data,” Inverse Problems,\n  vol. 33, no. 3, p. 035001, 2017.\n\nZhang2015\nD. Zhang and Y. Guo, “Fourier method for solving the multi-frequency inverse\n  source problem for the Helmholtz equation,” Inverse Problems,\n  vol. 31, no. 3, p. 035007, 2015.\n\nGriesmaier17\nR. Griesmaier and C. Schmiedecke, “A factorization method for multifrequency\n  inverse source problems with sparse far field measurements,” SIAM\n  Journal on Imaging Sciences, vol. 10, no. 4, pp. 2119–2139, 2017.\n\nPotts13\nD. Potts and M. Tasche, “Parameter estimation for nonincreasing exponential\n  sums by prony-like methods,” Linear Algebra and its Applications,\n  vol. 439, no. 4, pp. 1024–1039, 2013, 17th Conference of the International\n  Linear Algebra Society, Braunschweig, Germany, August 2011.\n\nFannjiang10\nA. C. Fannjiang, T. Strohmer, and P. Yan, “Compressed remote sensing of sparse\n  objects,” SIAM Journal on Imaging Sciences, vol. 3, no. 3, pp.\n  595–618, 2010.\n\nvetterli2002sampling\nM. Vetterli, P. Marziliano, and T. Blu, “Sampling signals with finite rate of\n  innovation,” IEEE Transactions on Signal Processing, vol. 50, no. 6,\n  pp. 1417–1428, 2002.\n\njin2015annihilating\nK. H. Jin and J. C. Ye, “Annihilating filter-based low-rank Hankel matrix\n  approach for image inpainting,” IEEE Transactions on Image\n  Processing, vol. 24, no. 11, pp. 3498–3511, 2015.\n\nye2016compressive\nJ. C. Ye, J. M. Kim, K. H. Jin, and K. Lee, “Compressive sampling using\n  annihilating filter-based low-rank interpolation,” IEEE Transactions\n  on Information Theory, vol. 63, no. 2, pp. 777–801, 2017.\n\nADMM\nS. Boyd, N. Parikh, E. Chu, B. Peleato, and J. Eckstein, “Distributed\n  optimization and statistical learning via the alternating direction method of\n  multipliers,” Foundations and Trends in Machine Learning, vol. 3,\n  no. 1, pp. 1–122, 2011.\n\n8187544\nF. Bach, R. Jenatton, J. Mairal, and G. Obozinski, Optimization with\n  Sparsity-Inducing Penalties.1em plus 0.5em minus 0.4emNow\n  Publishers, 2012.\n\ncvx\nM. Grant and S. Boyd, “CVX: Matlab software for disciplined convex\n  programming, version 2.1,” <http://cvxr.com/cvx>, Mar. 2014.\n\n\n"}