{"entry_id": "http://arxiv.org/abs/2303.06668v1", "published": "20230312141226", "title": "An axiomatization of matroids and oriented matroids as conditional independence models", "authors": ["Xiangying Chen"], "primary_category": "math.CO", "categories": ["math.CO", "05B35 (Primary) 52C40, 62B10, 62R01 (Secondary)"], "text": "\n\t\n\t\tMatroids and semigraphoids are discrete structures abstracting and generalizing linear independence among vectors and conditional independence among random variables, respectively. Despite the different nature of conditional independence from linear independence, deep connections between these two areas are found and still undergoing active research. In this paper, we give a characterization of the embedding of matroids into conditional independence structures and its oriented counterpart, which lead to new axiom systems of matroids and oriented matroids.\n\t\n\tMultipolar Acoustic Source Reconstruction from Sparse Far-Field Data using ALOHA[1]\n    \n\t\tYukun Guo[2]\n\t\t\n\n\t\tAbdul Wahab[3] [4] \n            Xianchao Wang[2] \n\t\n    March 30, 2023\n===================================================================================\n\n\n\n§ INTRODUCTION\n\n\tFor a finite ground set E we denote by \n    𝒜_E:={ (ij|K):K⊆ E,i≠ j∈ E\\ K }\n the set of conditional independent statements (CI-statements) (ij|K) on E. We usually use the ground set [n]={1,…,n} and write 𝒜_n:=𝒜_[n] for convenience. A conditional independence structure (CI-structure) 𝒢⊆𝒜_E on E is a subset of 𝒜_E. \n\t\n\t\tNotational convention: In this paper we use the “Matúš notation\". Subsets (possibly empty) are denoted by upper case letters, singletons are denoted by lower case letters, concatenation of letters means disjoint union of sets. In particular, i and j are exchangeable in the notation (ij|K) of a CI-statement. If the CI-structure 𝒢 is clear in the context, we write i j|K iff (ij|K)∈𝒢 and i j|K iff (ij|K)∉𝒢. If a condition is appeared as an axiom, it should be valid for all subsets and singletons of the ground set such that the expression makes sense, for example, subsets are assumed to be disjoint whenever they are written in concatenation.\n\t\n\tLet ξ=(ξ_1,…,ξ_n) be an n-dimensional random vector, and we denote “random variables ξ_i and ξ_j are conditionally independent given {ξ_l:l∈ K}\" by i j|K. Then the CI-structure [[ξ]]:={(ij|K)∈𝒜_n: i j|K} satisfies the semigraphoid axiom <cit.>\n\t\n\t\t\n  (SG) i j|K ∧ iℓ |jK ⇒ iℓ |K ∧ i j|ℓ K.\n\t\n\tA CI-structure is a semigraphoid if it satisfies the axiom (SG). As in the case of matroids and linear independence, there exist semigraphoids which does not come from the conditional independence among any random vector. The CI-structures coming from random vectors are not finitely axiomatizable <cit.>, however they are approximated by semigraphoids <cit.>.\n\t\n\t\n\t\n\t\n\tIn <cit.> a geometric characterization of semigraphoids is given and is referred to as convex rank tests.  A CI-statement (ij|K)∈𝒜_n is associated to the set of walls\n\t\n    {𝐱∈ℝ^n:x_k_1≥⋯≥  x_k_s≥ x_i=x_j≥ x_ℓ_1≥⋯≥ x_ℓ_n-s-2}\n\n for k_1⋯ k_s=K and ℓ_1 ⋯ℓ_n-s-2=[n]\\ ijK, in the permutohedral fan Σ_A_n. Semigraphoids are exactly the subsets 𝒢 of 𝒜_n such that the removal of all walls corresponding to the elements of 𝒢 from the permutohedral fan Σ_A_n results in a coarser fan. If the resulting fan is polytopal, that is, the normal fan of a polytope, then the semigraphoid is structural or a semimatroid, and the polytope is a generalized permutohedron <cit.>. Generalized permutohedra can be characterized in several ways <cit.>. A set function h 2^[n]→ℝ is submodular if h(∅)=0 and\n\t\n    h(A)+h(B)≥ h(A∩ B)+h(A∪ B)\n\n\tfor any A,B⊆ [n]. Submodular functions are bijectively corresponding to the generalized permutohedra as their support functions. Therefore a CI-structure 𝒢⊆𝒜_n is a semimatroid iff there is a submodular function h 2^[n]→ℝ such that \n\t\n    𝒢={ (ij|K)∈𝒜_n: h(iK)+h(jK)=h(ijK)+h(K) }=:[[h]].\n\n\tSemimatroids encode the combinatorial data of generalized permutohedra: Two generalized permutohedra define the same semimatroid iff their face lattices are same. The lattice of semimatroids ordered by inclusion is isomorphic to the dual of the face lattice of the cone of submodular functions <cit.>.\n\t\n\tSubmodular functions appear and are well investigated in various branches of mathematics. They are important in the modeling of conditional independence as well <cit.>. If ξ is an n-dimensional discrete random vector, that is, a random vector which takes finite number of values, and h_ξ 2^[n]→ℝ maps every subset S⊆ [n] to the Shannon entropy of the subvector ξ_S, then h is submodular and [[ξ]]=[[h_ξ]] <cit.>. The same also holds for the measures with finite multiinformation <cit.>, which contain the class of discrete random vectors and the class of regular normally distributed random vectors. \n\t\n\tA submodular function r 2^[n]→ℤ is the rank function of a matroid M on [n] if it is integer-valued, subcardinal r(A)≤ |A| ∀ A⊆ [n] and monotonic r(A)≤ r(B) ∀ A⊆ B⊆ [n]. A set S ⊆ [n] is independent in M if r(S)=|S| and otherwise dependent. Minimal dependent sets are circuits and maximal independent sets are bases of M. The basis polytope 𝒫_M⊆ [0,1]^n of the matroid M is the convex hull of the indicator vectors 𝐞_B=∑_i∈ B𝐞_i∈ℝ^n of all bases B of M. It is the generalized permutohedron whose support function is r. \n\t\n\tOne of the most fascinating facts of matroids is that they can be defined in hundreds of different ways. The axiom systems arise from various areas of mathematics, they are elegant and define different natural looking objects that are indeed equivalent, however the equivalence can be far from obvious. This equivalence of axiomatically defined objects is called the “cryptomorphism\". For instance, rank functions of matroids are cryptomorphic to polytopes whose vertex coordinates are 0 or 1 and edges are parallel to 𝐞_i-𝐞_j, by taking their basis polytopes. Classic axiom systems of matroids and the cryptomorphic among them can be found in the Appendix in <cit.>. Recently, matroids are proven to be cryptomorphic to Stanley-Reisner rings whose symbolic powers are Cohen-Macaulay <cit.> (see <cit.> for more commutative-algebraic axiom systems), tropical varieties of degree 1 <cit.>, supports of multiaffine Lorentzian polynomials <cit.> and simplicial complexes whose combinatorial atlases are hyperbolic <cit.>. In this paper, we show that matroids are cryptomorphic to semigraphoids satisfying a single additional axiom (MCI) and oriented matroids are cryptomorphic to oriented CI-structures satisfying the axioms (OCI1)-(OCI5). We assume that the reader is familiar with the terminologies and basic facts about matroids and oriented matroids, which can be found in <cit.>. \n\t\n\t\n\t\n\t\n\t\n\n§ MATROIDS AS CI-STRUCTURES\n\n\t\n\t\n\tA matroid M on [n] with rank function r defines a CI-structure \n\t[[M]]:=[[r]]={ (ij|K)∈𝒜_n:r(iK)+r(jK)=r(ijK)+r(K) }. In other words, [[M]] is the semimatroid of the submodular function r. \n\t\n\tIf M is loopless, one can recover its rank function from its CI-structure [[M]] recursively by r(∅)=0, r(singleton)=1 and\n\t\n    r(ijK)=\n    \t\t\tr(iK)+r(jK)-r(K)     i  j |K\n    \n    \t\t\tr(iK)+r(jK)-r(K)-1     i j|K.\n\nAlternatively, we can recover the independent sets ℐ(M) of the matroid M by \n\n    ℐ(M)={S⊆ [n]:𝒜_S⊆ [[M]]},\n\n\nwhere 𝒜_S:={ (ij|K):K⊆ S,i≠ j∈ S\\ K }.\n\nReplacing a loop i∈ [n] by a coloop and replacing a coloop i by a loop correspond to the translation of matroid polytope by -𝐞_i and 𝐞_i, respectively. They do not affect the normal fan and thus the semimatroid stays unchanged. In this paper we consider loopless matroids as the representatives in every class of matroids on [n] whose base polytopes have the same normal fan.\n\nIn <cit.>, Matúš connected conditional independence to matroid theory by embedding matroids into CI-structures and investigating their probabilistic representability, and introducing the matroid theoretic tools to the research of conditional independence. He stated that a CI-structure can be defined by a matroid iff the sets obtained by (<ref>) are the independent sets of a matroid whose CI-structure is again the original one. Here we characterize these CI-structures by axioms in type of inference rules.\n\t\n\t\tA CI-structure 𝒢⊆𝒜_n is defined by a loopless matroid M iff it satisfies\n\t\t\n\t\t\t\n  (MCI) i j|K⇒ iℓ |jKL,\n\t\t\t\n  (SG) i j|K ∧ iℓ |jK ⇒ iℓ |K ∧ i j|ℓ K.\n\t\t\n\t\t\n\t\tMoreover, the correspondence between matroids and CI-structures satisfying (MCI) and (SG) is one-to-one.\n\t\t\t\n\t\t\n\t\t\tLet M be a matroid on [n] with rank function r. The rank function axioms of matroids imply that i j|K in [[M]] iff \n\t\t\t\n    r(iK)=r(jK)=r(ijK)=r(K)+1.\n\n\t\t\tFrom the second equality and submodularity r(ijK)+r(jKL)≥ r(ijKL)+r(jK) and monotonicity r(ijKL)≥ r(jkL) of r, we have r(ijKL)=r(jKL). This contradicts iℓ |jKL. So is (MCI) proven. The condition (SG) is the semigraphoid axiom. It is always satisfied by semimatroids.\n\t\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\tNow Let 𝒢⊆𝒜_n be a CI-structure satisfying (MCI) and (SG). We need to show that a function r 2^[n]→ℕ is uniquely defined by the recursion (<ref>) and it is the rank function of a matroid. \n\t\t\t\n\t\t\tTo show the well-definedness of r(S) we apply induction on the cardinality c of S. For c∈{0,1} the function value r(S) is given by the initial condition. For c=2, r(ij)=1 if i j| and 2 otherwise. Assume that c≥ 3 and r(S) is uniquely defined for any S with |S|<c. What is left to check is that we got the same value r(ijkL) for |ijkL|=c by applying (<ref>) to different conditional (in)dependence statements, namely,\n\t\t\t\n    r(ikL)+r(jkL)-r(kL)     i  j |kL\n    \n    \t\t\t\t\tr(ikL)+r(jkL)-r(kL)-1     i j|kL\n    \t\t\t\t\n    \n    \t\t\t=   \n    \t\t\t\tr(ijL)+r(jkL)-r(jL)     i  k |jL\n    \n    \t\t\t\tr(ijL)+r(jkL)-r(jL)-1     i  k |jL.\n\n\t\t\n\t\t\t\n  * i  j |kL and i  k |jL: From (SG) we have i k|L. By i  k |jL and (MCI) we have i j|L. Therefore\n\t\t\t\n    r(ikL)+r(jkL)-r(kL)   =r(iL)-r(L)-1+r(jkL)\n       =r(ijL)+r(jkL)-r(jL)-1.\n\n\t\tThe case i  k |jL and i  j |kL follows by symmetry.\n\t\t\t\n  * i  j |kL and i  k |jL: By (MCI) we have i j|L and i k|L.\n\t\t\t\n  * i  j |kL and i  k |jL: If i j|L, by (SG) we have i k|L. If i j|L, we have i k|L instead by (SG). In both cases the equality follows.\n\t\t\n\t\t\t\n\t\t\tTo show that r is the rank function of a matroid, what is left to show is r(i_1⋯ i_s)-r(i_2⋯ i_s)∈{0,1}. Applying (<ref>) s-2 times, we have\n\t\t\t\n    r(i_1⋯ i_s)-r(i_2⋯ i_s)=r(i_1)-r(∅)-a=1-a,\n\n\t\twhere \n\t\t\n    a=|{ (i_1i_s|i_2⋯ i_s-1),(i_1i_s-1|i_2⋯ i_s-2),…, (i_1i_2|) }\\𝒢|.\n\n\t\tThe condition (MCI) implies that at most one of \n    (i_1i_s|i_2⋯ i_s-1), (i_1i_s-1|i_2⋯ i_s-2), …,(i_1i_3|i_2), (i_1i_2|)\n can be a conditional dependent statement, i.e. not in 𝒢, therefore a is either 0 or 1. \t\t \t\n\t\t\n\nWe remark that sometimes it may be more convenient to write the condition (MCI) in the following form \n    i j|K ∨ iℓ| jKL   ∀  iℓ jKL⊆ [n].\n Since semigraphoids satisfying (MCI) are cryptomorphic to loopless matroids, we call such CI-structures matroids as well, and we can read off the CI-structure from other formulations of the matroid. The following lemma will be used repeatedly. \n\t\n\t\tFor any K⊆ [n] and i≠ j∈ [n]\\ K, i j|K iff there is a circuit C such that ij⊆ C⊆ ijK and every circuit in ijK contains either both i,j or none of them.\n\t\n\t\n\t\tLet C be a circuit such that i∈ C⊆ iK. Then r(C)=r(C\\ i). Together with r(iK)=r(K)+1 it contradicts the submodularity\n\t\t\n    r(C)+r(K)≥ r(iK)+r(C\\ i).\n\n\t\tIf there is no circuit in ijK containing i,j, then i and j are coloops in ijK. Then r(ijK)=r(iK)+1, so we have i j|K.\n\t\t\n\t\tNow assume that i j|K and there is a circuit ijK' such that K'⊆ K. We want to show that there exists a circuit containing exactly one of i,j. From i j|K we have \n\t\t\n    r(iK)+r(jK)=r(ijK)+r(K),\n\n\t\tand as ijK' is a circuit, r(ijK')=r(jK'). By submodularity\n\t\t\n    r(jK)+r(ijK')≥ r(ijK)+r(jK')\n\n\t\tand monotonicity, we have r(jK)=r(ijK) and therefore r(iK)=r(K). So there is a circuit C' such that i∈ C'⊆ iK.\n\t\n\nWe summarize the following characterizations for the conditional dependence (ij|K)∉ [[M]]. They are merely straightforward reformulations of the statements stated previously.\n\n\n\tLet M be a matroid on [n] and [[M]]⊆𝒜_n be the CI-structure associated to M. The following are equivalent for any K⊆ [n] and i≠ j∈[n]\\ K:\n\t\n\t\t\n  * i j|K.\n\t\t\n  * r(iK)=r(jK)=r(ijK)=r(K)+1.\n\t\t\n  * There exists a circuit C of M such that ij⊆ C⊆ ijK and every circuit in ijK contains either both i,j or none of them. \n\t\t\n  * The set ij is a cocircuit (or equivalently, K is a hyperplane) in the restriction of M to ijK.\n\t\t\n  * For any basis B of K, iB and jB are bases of ijK.\n\t\t\n\t\t\n  * There exists a basis B of K such that iB and jB are bases of ijK.\n\t\t\n  * Any wall of Σ_A_n corresponding to (ij|K) by (<ref>) is in some wall of the normal fan 𝒩(𝒫_M) of the base polytope 𝒫_M of M.\n\t\n\n\nIn <cit.>, the notions of matroid operations are adapted to conditional independence. Let 𝒢⊆𝒜_n be a CI-structure. The deletion and contraction of 𝒢 by A⊆ [n] are\n\n    𝒢\\ A:= { (ij|K)∈𝒢: ijK⊆ [n]\\ A },\n       𝒢/ A:= { (ij|K)∈𝒜_[n]\\ A: (ij|KA)∈𝒢},\n\nrespectively. They reflect the marginalization and conditioning in probability theory. The dual of 𝒢 is 𝒢^∗:={ (ij|[n]\\ ijK):(ij|K)∈𝒢}. The usual rules for matroid operations also work for CI-structure operations, e.g. deletion and contraction commute and are dual operations of each other. A CI-structure 𝒢' is a minor of a CI-structure 𝒢 if 𝒢' can be obtained from 𝒢 by applying any sequence of restriction and contraction. The direct sum of two CI-structures 𝒢_1⊆𝒜_E_1 and 𝒢_2⊆𝒜_E_2 is the CI-structure\n\n    𝒢_1⊕𝒢_2={ (ij|K)∈𝒜_E_1E_2: i∈ E_1,j∈ E_2     or  ij⊆ E_1,(ij|K∩ E_1)∈𝒢_1\n        or  ij⊆ E_2,(ij|K∩ E_2)∈𝒢_2}\n\non E_1E_2.\n\nThe operations on CI-structures are compatible with the operations on matroids, namely, [[M\\ A]]=[[M]]\\ A, [[M/ A]]=[[M]]/ A and [[M^∗]]=[[M]]^∗ for any matroid M on [n] and any A⊆ [n], and [[M_1⊕ M_2]]=[[M_1]]⊕ [[M_2]] for any matroids M_1,M_2 on disjoint ground sets <cit.>. In particular, being a matroid is a minor-closed property of CI-structures. In <cit.>, classes of CI-structures are investigated via forbidden minors. The CI-structures that are matroids, although having a short axiomatization by (MCI) and (SG), cannot be characterized by a finite set of forbidden minors.\n\n\n\tThe class of CI-structures that are matroids cannot be characterized by a finite set of forbidden minors. \n\n\n\tLet 𝒢_m:=𝒜_m\\{ (12|),(ij|K):ijK=[m] } for m≥ 4. In other words, 𝒢_m is the semimatroid defined by the sum of rank functions of matroids U_1,2⊕ U_m-2,m-2 and U_m-1,m, where U_r,m is the rank-r uniform matroid on [m]. Then 𝒢_m is not a matroid because (MCI) is violated by (12|),(13|245⋯ m)∉𝒢_m. However, any proper minor of 𝒢_m is a matroid as 𝒢_m\\ 1≅𝒢_m\\ 2≅  [[U_m-1]], 𝒢_m\\ i≅ [[U_1,2⊕ U_m-3,m-3]] for any i∈ [m]\\1,2 and 𝒢/j≅ [[U_m-2,m-1]] for any j∈[m].\n\n\n\t\n\t\n\n§ ORIENTED MATROIDS AS ORIENTED CI-STRUCTURES\n\n\t\tAn oriented CI-structure on [n] is a map σ𝒜_ n→{ -1,0,1 }. In <cit.>, oriented gaussoids are introduced for modeling the signs of the partial correlations among regular normally distributed random vectors. General oriented CI-structures are introduced in <cit.>.\n\t\t\t\t\n\t For notions regarding oriented matroids we use the notations in <cit.>. A signed subset of [n] is a map X [n]→{-1,0,1}. Write X^+:=X^-1(1), X^-:=X^-1(-1) and X:=X^+X^-. A collection 𝒞 of signed subsets of [n] is the set of signed circuits of an oriented matroid on [n] if it satisfies\n\t\n\t\t\n  (OC0) ∅∉𝒞,\n\t\t\n  (OC1) 𝒞=-𝒞,\n\t\t\n  (OC2) for all X,Y∈𝒞 with X⊆Y, either X=Y or X=-Y,\n\t\t\n  (OC3) for all X,Y∈𝒞, X≠ -Y and e∈ X^+∩ Y^- there is a Z∈𝒞 such that Z^+⊆ (X^+∪ Y^+)\\ e and Z^-⊆ (X^-∪ Y^-)\\ e.\n\t\n\tIf (OC0), (OC1) and (OC2) are satisfied, then (OC3) is equivalent to the following condition known as the strong elimination axiom:\n\t\n\t\t\n  (OC3') For all X,Y∈𝒞, e∈ X^+∩ Y^- and f∈ (X^+\\ Y^-)∪ (X^-\\ Y^+), there is a Z∈𝒞 such that Z^+⊆ (X^+∪ Y^+)\\ e, Z^-⊆ (X^-∪ Y^-)\\ e and f∈ Z.\n\t\n\tIf 𝒞 is a circuit signature of a matroid M, that is, 𝒞 consists of two opposite signed sets X and -X supported by C for each circuit C of M, then 𝒞 clearly satisfies (OC0)-(OC2). In this case, we only need to check the X,Y in (OC3) such that X and Y are a modular pair in M, that is, r(X)+r(Y)=r(X∪ Y)+r(X∩ Y). In this case, Z is unique.\n\t\n\tLet ℳ be an oriented matroid on [n] and 𝒞 be the set of signed circuits of ℳ. We associate an oriented CI-structure σ_ℳ𝒜_n→{-1,0,1} to ℳ by assigning σ_ℳ(ij|K)=0 whenever (ij|K)∈ [[ℳ]], and otherwise σ_ℳ(ij|K)=X(i)X(j) for any X∈𝒞 such that ij⊆X⊆ ijK. The following lemma ensures the well-definedness of σ_ℳ.\n\t\n\t\n\t\tIf (ij|K)∉ [[ℳ]], then X(i)X(j)=Y(i)Y(j) for any X,Y∈𝒞 such that ij⊆X,Y⊆ ijK.\n\t\n\n\tSuppose that X(i)X(j)=-Y(i)Y(j). By (OC1), we can assume that X(i)=Y(i)=1 and X(j)=Y(j)=-1, that is, j∈ X^+∩ Y^- and i∈ X^+\\ Y^-. The strong elimination axiom (OC3') implies that there is a Z∈𝒞 such that i∈Z⊆ iK and j∉Z, which contradicts Lemma <ref>.\n\n\nWe prove that oriented matroids can be axiomatized in terms of oriented conditional independence.\n\t\n\t\tAn oriented CI-structure σ𝒜_ n→{ -1,0,1 } is the associated oriented CI-structure σ_ℳ of an oriented matroid ℳ iff it satisfies\n\t\t\n\t\t\t\n  (OCI1) σ(ij|K)≠ 0⇒σ(iℓ |jKL)=0,\n\t\t\t\n  (OCI2) σ(ij|K)=σ(iℓ|jK)= 0⇒σ(ij|ℓ K)=σ(iℓ|K)=0,\n\t\t\t\n  (OCI3) σ(ij|K)≠ 0 ⇒σ(ij|L)∈{0,σ(ij|K)} for any L⊆ K or L⊇ K,\n\t\t\t\n  (OCI4) σ(iℓ|K)σ(ij|K)σ(jℓ|K)≤ 0,\n\t\t\t\n  (OCI5) σ(iℓ|jK)σ(ij|ℓ K)σ(jℓ|iK)≥ 0.\n\t\t\n\t\t\n\t\t\n\t\t\n\tIn this case, the oriented matroid ℳ can be determined uniquely from σ by first recovering the underlying matroid ℳ, and then assigning to each circuit C of ℳ two opposite signed circuits\n\t\n    ± ({c_0,c∈ C:σ(cc_0|C\\ cc_0)=1},{c∈ C:σ(cc_0|C\\ cc_0)=-1}),\n\n\twhere c_0∈ C can be chosen arbitrarily in each C.\n\t\n\t\n\t\tLet ℳ be an oriented matroid. By the construction of σ_ℳ, σ^-1(0) is the CI-structure associated to the underlying matroid ℳ, (OCI1) and (OCI2) are guaranteed by Theorem <ref>. The condition (OCI3) follows by definition and Lemma <ref>. \n\t\t\n\t\tIf σ(iℓ|K)σ(ij|K)σ(jℓ|K)≠ 0, then by Lemma <ref>, there are signed circuits X,Y of ℳ such that ij⊆X, ℓ∉X, iℓ⊆Y and j∉Y. By (OC1) we can assume i∈ X^+∩ Y^-. Then by (OC3) there is a signed circuit Z of ℳ such that Z^+⊆ (X^+∪ Y^+)\\ e and Z^-⊆ (X^-∪ Y^-)\\ e. It follows from σ(jℓ|K)≠ 0 that jℓ⊆Z and\n\t\t\n    σ(jℓ|K)=Z(j)Z(ℓ)=X(j)Y(ℓ)=X(i)σ(ij|K)Y(i)σ(iℓ|K)=σ(ij|K)σ(iℓ|K),\n\n\t\tso (OCI4) is proven. \n\t\t\n\t\tIf σ(iℓ|jK)σ(ij|ℓ K)σ(jℓ|iK)≠ 0, then by Lemma <ref>, for any signed circuit X of ℳ such that X⊆ ijℓ K, either ijℓ⊆X or {i,j,l}∩X=∅, and there exists a signed circuit X such that ijℓ⊆X⊆ ijℓ K. Let X be such a signed circuit. Then we conclude (CI5) as\n\t\t\n    σ(iℓ|jK)σ(ij|ℓ K)σ(jℓ|iK)=X(i)^2X(j)^2X(ℓ)^2=1.\n\n\t\t\n\t\tNow let σ𝒜_n→{-1,0,1} be such that (OCI1)-(OCI5) are satisfied, and let M be the loopless matroid obtained from the CI-structure σ^-1(0)⊆𝒜_n by Theorem <ref>. Let 𝒞 be the circuit signature (<ref>) of M. It follows by (OCI5) that the element c_0 in (<ref>) can be chosen arbitrarily in each C.\n\t\t\n\t\tLet X,Y∈𝒞 be such that X and Y are a modular pair in M. Let e∈ X^+∩ Y^-. By the construction (<ref>) we have X(x)=σ(xe|X\\ xe) for all x∈X\\ e and Y(y)=-σ(ye|Y\\ ye) for all y∈Y\\ e. \n\t\t\n\t\tLet C be the unique circuit of M such that C⊆ (X∪Y)\\ e. Explicitly, C=[n]\\cl^*(([n]\\ (X∪Y))e), where cl^∗ is the closure operator of the dual matroid of M.\n\t\t\n\t\t Let f∈X\\Y and g∈Y\\X. The existence of f and g are ensured by the incomparability of circuits of a matroid. Because C is the unique circuit of M in (X∪Y)\\ e, by the strong circuit elimination axiom of matroids, we have f,g∈ C. Let Z be the signed subset of [n] supported by C with Z(f)=X(f)=σ(ef|X\\ ef) which is defined by (<ref>), that is,\n\t\t \n    Z(z)=σ(zf|C\\ zf)σ(ef|X\\ ef).\n \n\t\t We show that Z is the desired circuit in the condition (OC3). \n\t\t \n\t\t Case 1: If z∈ C∩X\\Y, then σ(zf|(X∪Y)\\ zf)≠ 0 because\n\t\t \n    r(X∪Y)=r((X∪Y)\\ z)=r((X∪Y)\\ f)\n \n\t\t and \n\t\t \n    r(X∪Y)-1≤  r((X∪Y)\\ zf)   ≤ r(X\\ zf)+r(Y)-r(X∩Y)\n       =r(X)-1+r(Y)-r(X∩Y)=r(X∪Y)-1.\n\n\t\t It follows from σ(zf|C\\ zf),σ(zf|X\\ zf),σ(zf|(X∪Y)\\ zf)≠ 0 and (OCI3) and (OCI5) that  \n\t\t \n    Z(z)   =σ(zf|C\\ zf)σ(ef|X\\ ef)=σ(zf|(X∪Y)\\ zf)σ(ef|X\\ ef)\n       =σ(zf|X\\ zf)σ(ef|X\\ ef)=σ(ez|X\\ ez)=X(z).\n\n\t \n\t Case 2: If z∈ C∩Y\\X, we need to show Z(g)=Y(g), and the rest of this case is same as Case 1. It follows from (OCI3) and (OCI5) that\n\t\n    Z(g)   =Z(f)σ(fg|C\\ fg)=σ(ef|X\\ ef)σ(fg|C\\ fg)\n       =σ(ef|X\\ ef)σ(fg|(X∪Y)\\ efg)\n       =-σ(ef|X\\ ef)σ(ef|(X∪Y)\\ efg)σ(eg|(X∪Y)\\ efg)\n       =-σ(ef|X\\ ef)σ(ef|X\\ ef)σ(eg|Y\\ eg)=-σ(eg|Y\\ eg)=Y(g),\n\nwhere all σ-values are nonzero because of Lemma <ref>.\n\nCase 3: If z∈ C∩X∩Y, suppose in the contrary that X(z)=Y(z)=-Z(z). We have\n\n    σ(ez|X\\ ez)=X(z)=-Z(z)   =\t-σ(zf|C\\ zf)σ(ef|X\\ ef)\n       =-σ(zf|C\\ zf)σ(zf|X\\ zf)σ(ez|X\\ ez),\n\nthus σ(zf|C\\ zf)σ(zf|X\\ zf)=-1. Similarly, σ(zg|C\\ zf)σ(zg|Y\\ zg)=-1 because\n\n    σ(ez|Y\\ ez)   =-Y(z)=Z(z)=Z(g)σ(zg|C\\ zg)=Y(g)σ(zg|C\\ zg)\n       =-σ(eg|Y\\ eg)σ(zg|C\\ zg)=-σ(ez|Y\\ ez)σ(zg|Y\\ zg)σ(zg|C\\ zg).\n\nTherefore,\n\n    σ(fg|C\\ fg)   =σ(zg|C\\ zg)σ(zf|C\\ zf)=σ(zg|Y\\ zg)σ(zf|X\\ zf)\n       =σ(eg|Y\\ eg)σ(ez|Y\\ ez)σ(ef|X\\ ef)σ(ez|X\\ ez)\n       =σ(eg|Y\\ eg)(-Y(z))σ(ef|X\\ ef)X(z)\n       =-σ(eg|Y\\ eg)σ(ef|X\\ ef)=-Z(f)Z(g),\n\n\twhich contradicts (<ref>).\n\nWe have shown that an oriented CI-structure σ satisfying (OCI1)-(OCI5) defines an oriented matroid ℳ. The fact σ=σ_ℳ follows from (OCI3) and Lemma <ref>, namely, if σ(ij|K)≠ 0, then for any circuits C,C' of ℳ with ij⊆ C,C'⊆ ijK, we have σ(ij|C\\ ij)=σ(ij|K)=σ(ij|C'\\ ij).\n\t\nOriented matroids are known to be cryptomorphic to chirotopes, which abstract the possible signs of Plücker coordinates of points in the Grassmannian. By the following Proposition, σ_ℳ can be obtained directly from the chirotope of ℳ.\n\n\tLet χ[n]r→{-1,0,1} be the chirotope of an oriented matroid ℳ on [n]. The oriented CI-structure σ_ℳ𝒜_n→{-1,0,1} associated to ℳ can be obtained from the chirotope χ by\n\t\n    σ_ℳ(ij|K)=-χ(i,b_1,…,b_s,a_1,…,a_r-s-1)χ(j,b_1,…,b_s,a_1,…,a_r-s-1),\n\n\twhere b_1⋯ b_s is a basis of K and a_1⋯ a_r-s-1 is a subset of [n]\\ ijK such that χ(i,b_1,…,b_s,a_1,…,a_r-s-1)≠ 0 whenever it exists, and σ_χ(ij|K)=0 if no such a_1⋯ a_r-s-1 exists.\n\n\n\tLet σ_χ(ij|K) be the oriented CI-structure defined in the Proposition. It is easy to see that σ_χ(ij|K)=0 iff there is a basis b_1⋯ b_s of K such that iK or jK is not a basis of ijK in ℳ. By Proposition <ref>, this is equivalent to (ij|K)∈[[ℳ]]. Now assume that (ij|K)∉ [[ℳ]]. Let C be the circuit in ℳ such that ij⊆ C⊆ ijb_1⋯ b_s, then σ_χ(ij|K)=σ_χ(ij|C\\ ij) coincides with the sign σ(i,j) defined in <cit.>, which gives back the original oriented matroid ℳ by <cit.>, therefore we have σ_χ=σ_ℳ. The well-definedness of σ_χ follows as well.\n\n\t\n\n§ REMARKS ON REPRESENTATIONS OF MATROIDS\n\n\tIn <cit.>, Matúš introduced representations of matroids in probability theory and information theory which lead to new insight into representability of matroids. A matroid M is probabilistically representable if its CI-structure coincides with the conditional independence among a discrete random vector ξ, that is, [[M]]=[[ξ]]=[[h_ξ]]. As the rank function of any connected matroid spans an extreme ray in the cone of submodular functions, the probabilistic representability is equivalent to the entropicness in the case of connected matroids, where a matroid is entropic if its rank function is a positive multiple of the entropy function of some discrete random vector. Linear and multilinear matroids are entropic <cit.>, however the direct sum of Fano matroid and non-Fano matroid is algebraic but not entropic <cit.>. The rank function of any algebraic matroids is the pointwise limit of a sequence of entropy functions <cit.>, such matroids are called almost entropic <cit.>. The dual of an almost entropic matroid is not necessarily almost entropic <cit.>, while a long standing open problem in matroid theory is whether the dual of any algebraic matroid is algebraic. \n\t\n\tA Gaussian conditional independence, however, can never represent an interesting matroid. A semigraphoid 𝒢⊆𝒜_n is a gaussoid if it satisfies the following axioms:\n\t\n\t\t\t\n  (Int) {(ij|kL),(ik|jL)}⊆𝒢⇒{(ij|L),(ik|L)}⊆𝒢,\n\t\n  (Comp) {(ij|L),(ik|L)}⊆𝒢⇒{(ij|kL),(ik|jL)}⊆𝒢,\n\n  (WT) {(ij|L),(ij|kL)}⊆𝒢⇒ (ik|L)  or  (jk|L)∈𝒢.\n\t\nGaussoids are introduced in <cit.> as an abstraction of the conditional independence among regular normally distributed random variables: If ξ is an n-dimensional regular normally distributed random vector whose covariance matrix is Σ, then [[ξ]]={(ij|K)∈𝒜_n:Σ_iK,jK=0}=:[[Σ]] is a gaussoid. The CI-structures coming from regular normally distributed random vectors are not finitely axiomatizable <cit.>, they are axiomatically approximated by gaussoids <cit.>. In <cit.> it was computationally verified that for 3≤ n≤ 8 no CI-structure corresponding to a connected matroid on [n] is a gaussoid. We confirm this computation by showing that a loopless matroid is a gaussoid iff it is a direct sum of copies of uniform matroids U_1,1 and U_1,2.\n\n\t\n\t\tLet M be a loopless matroid. Then [[M]] is a gaussoid iff M≅ U_1,1^⊕ m_1⊕ U_1,2^⊕ m_2.\n\t\n\n\tThe necessity follows from the observation that [[U_1,1]]=[[(1)]] and [[U_1,2]]=[[(\n\t\t1     0.1\n\n\t\t0.1     1\n\t)]] are gaussoids and [[Σ_1]]⊕[[Σ_2]]=[[Σ_1⊕Σ_2]] for any positive definite matrices Σ_1,Σ_2 <cit.>.\n\t\n\tNow assume that M is a loopless matroid on the ground set E such that [[M]] is a gaussoid. We deduce the following three inference rules for any ijℓ K⊆ E from (MCI), (SG), (Int) and (Comp):\n\nClaim 1. i j|K ⇒ i j|ℓ K. It follows by (MCI) from i j|K that iℓ|jK and jℓ|iK. And by (Int) we get iℓ|K. However by (SG) we have iℓ|K or i j|ℓ K from i j|K. Thus we have i j|ℓ K.\n\nClaim 2. i j|ℓ K ⇒ i j| K. It follows by (MCI) from i j|ℓ K that iℓ|K and jℓ|K. And by (Comp) we get iℓ|jK. However by (SG) we have iℓ|jK or i j|K from i j|ℓ K. Thus we have i j|K.\n\nClaim 3. i j| ⇒ iℓ |. By applying (MCI) we get iℓ |j and jℓ |j from i j|. Then iℓ| follows from (Int).\n\nBy Claim 3, the ground set E can be partitioned into 2-element sets {a_ι,b_ι}, ι∈[m_2] and singletons {c_ι}, ι∈[m_1] such that a_ι b_ι| for any ι∈ [m_2] and i j| if i,j∈ E are in different blocks. By Claim 1 and Claim 2, for any two subsets K,K'⊆ E\\ ij we have i j|K iff i j|K'. Therefore, the loopless matroid M is isomorphic to the direct sum of m_2 rank one uniform matroids on {a_ι,b_ι}, ι∈[m_2] and m_1 rank one uniform matroids on {c_ι}, ι∈[m_1].\n\n\n\n\n§ ACKNOWLEDGMENTS\n\nThe author would like to thank Thomas Kahle for his comments. Funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) - 314838170, GRK 2297 MathCoRe.\n\n"}