{"entry_id": "http://arxiv.org/abs/2303.06667v1", "published": "20230312141038", "title": "Evidence for self-organized criticality phenomena in prompt phase of short gamma-ray bursts", "authors": ["Xiu-Juan Li", "Wen-Long Zhang", "Shuang-Xi Yi", "Yu-Peng Yang", "Jia-Lun Li"], "primary_category": "astro-ph.HE", "categories": ["astro-ph.HE"], "text": "\n\n\n0000-0001-6469-8725]Li, Xiu-Juan^\nSchool of Cyber Science and Engineering, Qufu Normal University, Qufu 273165, China\n0000-0001-6469-8725]Zhang, Wen-Long\nSchool of Physics and Physical Engineering, Qufu Normal University, Qufu 273165, China\n0000-0001-6469-8725]Yi, Shuang-Xi^†\nSchool of Physics and Physical Engineering, Qufu Normal University, Qufu 273165, China\n*0000-0001-6469-8725]Yang, Yu-Peng\nSchool of Physics and Physical Engineering, Qufu Normal University, Qufu 273165, China\n*0000-0001-6469-8725]Li, Jia-Lun\nyisx2015@qfnu.edu.cn;lxj@qfnu.edu.cn\nSchool of Physics and Physical Engineering, Qufu Normal University, Qufu 273165, China\n\n\n\n\nThe prompt phase of gamma-ray burst (GRB) contains essential information regarding the physical nature and central engine,\nwhich are as yet unknown. In this paper, we investigate the self-organized criticality (SOC) phenomena in GRB prompt phase as done in X-ray flares of GRBs.\nWe obtain the differential and cumulative distributions of 243 short GRB pulses, such as\npeak flux,\nFWHM, rise time, decay time, and peak time in the fourth BATSE TTE Catalog with the Markov Chain Monte Carlo (MCMC) technique. It is found that these distributions can be well described by\npower-law models. In particular, comparisons are made\nin 182 short GRB pulses in the third Swift GRB Catalog from 2004 December to 2019 July. The results are essentially consistent with those in BATSE ones. We notice that there is no obvious power-law index evolution across different energy bands for either BATSE or Swift sGRBs. The joint analysis suggests that GRB prompt phase can be explained by a Fractal-Diffusive, Self-Organized Criticality (FD-SOC) system with the spatial dimension S = 3 and the classical diffusion β = 1. Our findings show that GRB prompt phases and X-ray flares possess the very same magnetically dominated stochastic process and mechanism.\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n \nGamma-ray burst (GRB) is a sudden release of gamma-ray emission, which lasts from milliseconds to thousands\nof seconds. Despite many studies done on GRBs, the natures are still strongly debated. The lightcurves of GRB prompt phases are the imprints of the activities of central engine and contain the key information of internal energy dissipation and physical mechanisms. In general, it is difficult to accurately extract the properties of GRB lightcurves due to their notoriously complex and irregular structures. Fortunately, a fraction of GRBs are overwhelmingly single-peaked and double-peaked <cit.> providing valuable insights into the\nphysical processes by which GRBs release energy.\n\n\n<cit.> reported that a real, many-bodied, physical system in an external field assembles itself into a critical state which  can be triggered by a small perturbation and give rise to an avalanche-like chain reaction of any size due to some driving forces. This is known as the concept of self-organizing criticality (SOC) proposed as an\nattempt to explain the existence of self-similarities over extended ranges of spatial and temporal scales in a wide variety\nof systems.\nIt is worth noting that the SOC phenomena are commonly discussed in many astrophysical systems, such as solar flare, stellar flares, lunar craters, the asteroid belt, Saturn ring particles, magnetospheric substorms, radiation belt electrons, pulsar glitches, soft gamma-ray repeaters, black-hole objects, blazars, cosmic rays, X-ray bursts, and fast\nradio bursts <cit.>, etc.\n\nAs a common astrophysical phenomena in the universe, X-ray flares are observed in\na good fraction of GRB afterglows <cit.>. It is well known that GRB X-ray flares\nare attributed to the erratic GRB central engine activities just as the GRB prompt emission components which also provide important clues to the nature of the central\nengines <cit.>. For example, the similar lag-luminosity relation provides strongly evidence for the direct link between GRB X-ray flares and prompt phases <cit.>.\n<cit.> investigated the statistical properties of X-ray flares of GRBs and found that both GRB X-ray flares and solar\nflares might origin from the similar physical\nmechanism, i.e., they might be produced by a magnetic\nreconnection process and thus both can be well\nexplained by physical framework of a SOC system. Moreover, the further investigation based on a large sample of Swift GRB X-ray flares reported obtained the similar conclusions <cit.>.\nThus, it is necessary to determine whether the GRB prompt phases can also be explained by the SOC model and if so to probe the possible SOC behavior in GRB prompt phases, etc.\n\nFrom a more physical point of view, <cit.> developed the definition of SOC systems and proposed an analytical macroscopic SOC model. Adopting the expectation criteria proposed by the above model, we can identify an SOC system by examining the power-law-like distributions of relevant observed parameters <cit.>. Recently, <cit.> investigated the properties of BATSE GRBs with multi-pulses in their prompt lightcurves reported by <cit.>. By fitting the distributions of several observed pulses parameters, they tentatively suggested that SOC phenomena exist indeed in prompt phase of GRBs. However, the indisputable fact is that their investigations were\nmainly performed for the bursts with at least three pulses and single-peaked and double-peaked bursts were not\nincluded <cit.>. In this study, we systematically compile the temporal\nproperties of the single-peaked and double-peaked GRB pulses in the fourth BATSE TTE Catalog and the third Swift/BAT catalog given by our recent works <cit.> and perform a analysis focusing on the differential and cumulative distributions of characterized pulse parameters to search for the evidences of the SOC system. Particularly, in order to avoid instrumental selection effect, we examine whether the distributions evolve among different energy channels for both satellite bursts. Sample selection and data analysis are presented in\nSection 2. Section 3 displays our main results. We discuss some possible physical explanations of the results in Section 4. Finally, we summarize the results in Section 5.\n\n\n\n\n\n§ DATA AND METHOD\n \n\nOur recent works <cit.> utilized the empirical “KRL” function proposed by <cit.> to fit the lightcurves of short GRBs in the fourth BATSE TTE Catalog and the third Swift GRB Catalog from 2004 December\nto 2019 July. For BATSE sGRBs, the photon counts are accumulated into four standard\nenergy channels, labeled as Ch1 (25-55 keV), Ch2 (55-110 keV), Ch3 (110-320 keV), and Ch4 (≥320 keV). Similarly, the mask-weighted lightcurve data of Swift sGRBs are taken\nfrom the Swift website <cit.> for four energy\nchannels: Ch1 (15-25 keV), Ch2 (25-50 keV),\nCh3 (50-100 keV), and Ch4 (100-350 keV).\nIn total, 243 BATSE and 182 Swift pulses are obtained. Note that the pulse numbers in different energy channels are different due to either selection effect or low signal-to-noise ratio. Then, we extract the parameters of these pulses, including peak flux (f_ m), full width at half-maximum (FWHM), peak time (t_  m), rise time(t_  r), and decay time (t_  d). The detailed data processing refers to our previous works <cit.>.\n\n\n\nTo identify the possible SOC features in GRB prompt phases, we study in detail the differential and cumulative distributions of these temporal parameters. Here, a empirical thresholded power-law distribution function is used to fit the differential occurrence frequency distributions of GRBs <cit.>, which can be written as,\n\n\n    N_ diff=dN(x)/dx∝(x_0d+x)^-α_d, x_1 ≤ x ≤ x_2,\n\n\nwhere N is the number of events, x_0d is a constant by considering the threshold effects, x_ 1 and x_ 2 are the minimum and maximum values of scale-free range, and α_ d is the power-law index of differential distribution, respectively. This size function is identical to a “Generalized\nPareto distribution” <cit.>, the “Generalized Pareto Type II distribution” <cit.>, and the “Lomax distribution” <cit.>.\nThe uncertainty of the differential distribution is given by σ _diff,i=√(N_bin,i)/ x_i, where N_bin,i refers to the number of events of the i-bin, and x_i is the bin size.\n\nAccording to <cit.>, the cumulative distribution function of Equation <ref> can be obtained as,\n\n    N_ cum(>x)=1+(N-1) ×(x_2+x_0c)^1-α_c-(x+x_ 0c)^1-α_c/(x_2+x_0c)^1-α_c -(x_1+x_0c)^1-α_c,\n\nwhere N is the total number of events, x_0c is a constant by considering the threshold effects, and α_ c is the power-law index of cumulative distribution. The uncertainty of the cumulative distribution in a given bin i is estimated with σ _cum,i=√(N_i), where N_ i refers to the number of events of the bin.\nWe use the standard reduced chi-square (χ_ν ^2) goodness to identify a best fit. The χ_ν can be written as\n\n    χ_ν,diff=√(1/(n_x-n_par)∑_i=1^n_x[N_fit,diff(x_i)-N_obs,diff(x_i)]^2/σ_diff,i^2)\n\nfor the differential distribution function, and\n\n    χ_ν,cum=√(1/(n_x-n_par)∑_i=1^n_x[N_fit,cum(x_i)-N_obs,cum(x_i)]^2/σ_cum,i^2)\n\nfor the cumulative distribution function <cit.>,\nwhere n_ x is the number of logarithmic bins, n_ par is the number of the free parameters, N_ diff,obs(x_i) and N_ cum,obs(x_i) are the observed values, N_ diff,fit(x_i) and N_ cum,fit(x_i) are the corresponding theoretical values for differential distribution and cumulative distribution, respectively. Note that the points below the threshold x_0 are just noise and do not contribute to the accuracy of the best-fit power-law index, thus they are ignored when the reduced chi-square is calculated.\n\nMarkov chain Monte Carlo (MCMC) method is used to fit GRB data for the self-organized criticality model with PYTHON package pymc[https://pypi.org/project/pymc/] and obtain the optimal distribution parameters and the 95% confidence regions.\n\n\n\n§ RESULTS\n \n\n\n\n §.§ Distributions\n \nThe differential and cumulative distributions are fitted with Equations <ref> and  <ref>. The fitting results are shown in Figures <ref> -  <ref> for BATSE bursts and Figures <ref> -  <ref> for Swift bursts, respectively. In each Figure, the differential and cumulative distributions for the total sample are shown in panels (a) and (b). Note that we adopt a rank-order\nplot to get the differential distributions. The detailed method refers to Section 7.1.3 in <cit.>. In addition, in order to analyse the possible evolution from low to high energy channel, the distributions of different energy channels for both satellite\nbursts are fitted. The fitting results are shown in panels (c) - (f). It's important to note that the cumulative\ndistribution rather than differential distribution is used due to the fact that the sample number of individual energy channel\nis not sufficient to bin the data. The detailed fitting results are summarized in Tables <ref> and  <ref>.\n\nFrom Figures <ref> - <ref> (a), we find that all the parameters of BATSE GRBs possess the similar power-law differential distributions. In Figure <ref> (a), the best-fitting power-law index of peak flux for the total BATSE sample is 2.48 ± 0.02. The result is larger than the value of 2.09 ± 0.18 measured by <cit.> for a sample of BATSE bursts whose lightcurves have more than two pulses. However, it can be found from Figure <ref> (a) that the best-fitting power-law index of FWHM for the total BATSE sample is 1.89 ± 0.12, which is\nquite close to the value of 1.82 ^+0.14_-0.15 given by <cit.>.\nIn addition, the similar power-law differential distributions of rise time, decay time, and peak time with indexes of 1.89 ± 0.12, 1.92 ± 0.10, and 2.46 ± 0.05 can be found in Figures <ref> - <ref> (a), respectively.\n\nFor cumulative distributions, the best-fitting power-law index of peak flux for the total BATSE sample is 3.05 ± 0.02 in Figure <ref> (b), which is larger than the value of 1.99 ^+0.16_-0.19 reported by <cit.>. Particularly, it can be seen from Figure <ref> (b) that the best-fitting power-law index of FWHM for the total BATSE sample is 2.00 ± 0.01, which is also larger than the value of 1.75 ^+0.11_-0.13 given by <cit.>. The best-fitting power-law indexes of rise time, decay time, and peak time are 2.10 ± 0.01, 2.20 ± 0.01, and 2.50 ± 0.01 for the total BATSE sample (see Figures <ref> - <ref> (b) ).\n\nFigure <ref> (c) - (f) show the cumulative distributions of peak flux from BATSE Ch1 to Ch4. Similar results can be seen from Figures <ref> - <ref> (c) - (f).\nThe mean values of these power-law indexes of peak flux, FWHM, rise time, decay time, and peak time of four individual channels are 2.29 ± 0.13, 1.87 ± 0.07, 1.85 ± 0.08, 1.92 ± 0.05, and 2.41 ± 0.05, respectively. We find that there is almost no significant power-law index evolution across different energy bands, indicating that the self-organized criticality may quite be likely to exist in GRB systems or, in other words, be intrinsic.\n\nSignificantly, similar results are obtained for Swift GRBs in Figures <ref> -  <ref>. Overall, the results for Swift GRBs are approximately consistent with those of BATSE GRBs. In Figures <ref> -  <ref> (a), the best-fitting power-law indexes of differential distributions of peak flux and FWHM for the whole Swift sample are 2.44 ± 0.07 and 1.87 ± 0.13, both similar to the values of BATSE GRBs. Similarly, we can see from Figures <ref> - <ref> (a) that the power-law differential distributions of rise time, decay time, and peak time for the total Swift sample with the indexes of 1.82 ± 0.13, 1.86 ± 0.14, and 1.75 ± 0.17, respectively, which are slightly smaller than those of BATSE GRBs.\n\nMeanwhile, we find that the cumulative distributions of the total Swift sample can also be well described by power-law model with the indexes of 2.50 ± 0.01, 1.99 ± 0.01, 1.99 ± 0.01, 1.99 ± 0.02, and 1.97 ± 0.03 for peak flux, FWHM, rise time, decay time, and peak time, respectively, as shown in Figures <ref> - <ref> (b).\nThe mean values of these indexes of four individual channels are 2.40 ± 0.05, 1.81 ± 0.08, 1.80 ± 0.07, 1.80 ± 0.08, and 1.83 ± 0.07, respectively. Above all, it can be found that there is also no significant power-law index evolution across different energy bands for Swift GRBs. On the other hand, the fact that there is no significant instrumental effect between BATSE and Swift bursts, strengthens the evidences of the self-organized criticality in GRB systems.\n\n\n\n §.§ SOC\n \n\nFor a fractal-diffusive SOC model, <cit.> predicted power-law distributions for duration and peak flux with the indexes α_T = (1+S)β/2 and α_P = 2-1/S, where S = 1, 2, 3 is Euclidean space dimensions of SOC system and β is the diffusive spreading exponent. According to the prediction, it is easy to obtain the indexes α_P= 1.67 and α_T= 2 for S = 3 and the classical diffusion with β = 1.\n\nOur results can be used to derive the possible Euclidean space dimension of GRB SOC system. Owing to the small differences between the best-fitting power-law indexes of\ndifferential and cumulative distributions, we choose the cumulative case to examine GRB system. Furthermore, considering invariance of the power-law index on energy,\nwe adopt the mean value of power-law indexes of four individual channels to check. For example, the mean value of power-law index of FWHM for BATSE GRB is 1.87 ± 0.07 and can determine the Euclidean space dimension S = 3 according to the prediction of the FD-SOC model with the theoretical index α_T = 2. The result is very consistent with those of BATSE GRBs with at least three pulses reported by <cit.>. Similarly, the Euclidean space dimension can be obtained using the results of rise time, decay time, and peak time. Although the results are slightly smaller than the theoretical index α_T = 2, Euclidean space dimension of GRB SOC system is essentially in agreement with the model prediction for S = 3.\nIt is worth pointing out that it is difficult to determine which dimension for peak flux  since the value is obviously larger than the theoretical index 1.67 for S = 3. This phenomenon is similar to that reported by <cit.>. The steeper index of the peak flux distributions can be explained due to the fainter peak fluxes in small bin size (5ms and 8ms).\n\n\n\n§ DISCUSSIONS\n \n\n\nl c c c c c c c\nThe best-fitting parameters with the power-law models for BATSE GRBs.\n \n\nParameters     Energy Band     Satellite     x_ 0d     x_ 0c     α_ d    α_ c    χ_ν^2\n\npeak flux     total sample   BATSE   7.34±0.40   –   2.48±0.02   –   2.67\n\npeak flux     total sample   BATSE   –   14.94±0.08   –   3.05±0.02   1.28\n\npeak flux     Ch1            BATSE   –   6.81±2.70   –   2.17±0.31   0.22\n\npeak flux     Ch2   BATSE   –   7.18±0.38   –   2.48±0.03   0.85\n\npeak flux     Ch3   BATSE   –   10.88±0.53   –   2.48±0.02   1.03\n\npeak flux     Ch4   BATSE   –   6.32±2.65   –   2.02±0.40   0.11\n\nFWHM      total sample   BATSE   0.10±0.03   –   1.89±0.12   –   1.36\n\nFWHM      total sample   BATSE   –   0.20±0.00   –   2.00±0.01   2.93\n\nFWHM      Ch1   BATSE   –   0.11±0.05   –   1.77±0.21   0.21\n\nFWHM      Ch2   BATSE   –   0.20±0.01   –   1.98±0.03   1.45\n\nFWHM      Ch3   BATSE   –   0.19±0.01   –   1.97±0.04   1.07\n\nFWHM      Ch4   BATSE   –   0.07±0.03   –   1.75±0.20   0.11\n\nt_ r     total sample   BATSE   0.04±0.01   –   1.89±0.12   –   2.83\n\nt_ r     total sample   BATSE   –   0.08±0.00   –   2.10±0.01   2.86\n\nt_ r     Ch1   BATSE   –   0.08±0.04   –   1.65±0.29   0.35\n\nt_ r     Ch2   BATSE   –   0.08±0.00   –   1.97±0.04   1.08\n\nt_ r     Ch3   BATSE   –   0.08±0.00   –   1.97±0.04   0.98\n\nt_ r     Ch4   BATSE   –   0.02±0.01   –   1.82±0.16   0.15\n\nt_ d     total sample   BATSE   0.05±0.01   –   1.92±0.10   –   2.31\n\nt_ d     total sample   BATSE   –   0.13±0.00   –   2.20±0.01   3.48\n\nt_ d     Ch1   BATSE   –   0.12±0.03   –   1.90±0.16   0.48\n\nt_ d     Ch2   BATSE   –   0.11±0.01   –   1.98±0.03   1.62\n\nt_ d     Ch3   BATSE   –   0.09±0.00   –   1.98±0.03   1.15\n\nt_ d     Ch4   BATSE   –   0.05±0.02   –   1.80±0.14   0.12\n\nt_ m     total sample   BATSE   0.21±0.02   –   2.46±0.05   –   1.78\n\nt_ m     total sample   BATSE   –   0.28±0.01   –   2.50±0.01   3.21\n\nt_ m     Ch1   BATSE   –   0.18±0.03   –   2.41±0.09   0.51\n\nt_ m     Ch2   BATSE   –   0.23±0.01   –   2.47±0.04   1.55\n\nt_ m     Ch3   BATSE   –   0.28±0.02   –   2.46±0.06   0.93\n\nt_ m     Ch4   BATSE   –   0.19±0.05   –   2.30±0.17   1.07\n\n\n\nl c c c c c c c\nThe best-fitting parameters with the power-law models for Swift GRBs.\n \n\nParameters     Energy Band     Satellite     x_ 0d     x_ 0c     α_ d    α_ c   χ_ν^2\n\npeak flux     total sample   Swift   0.15±0.02   –   2.44±0.07   –   2.06\n\npeak flux     total sample   Swift   –   0.16±0.00   –   2.49±0.01   1.73\n\npeak flux     Ch1   Swift   –   0.11±0.02   –   2.36±0.12   0.42\n\npeak flux     Ch2   Swift   –   0.26±0.03   –   2.43±0.09   0.93\n\npeak flux     Ch3   Swift   –   0.17±0.03   –   2.43±0.09   0.41\n\npeak flux     Ch4   Swift   –   0.13±0.03   –   2.36±0.16   1.10\n\nFWHM      total sample   Swift   0.05±0.02   –   1.87±0.13   –   1.29\n\nFWHM      total sample   Swift   –   0.08±0.00   –   1.99±0.01   0.58\n\nFWHM      Ch1   Swift   –   0.04±0.02   –   1.73±0.15   0.06\n\nFWHM      Ch2   Swift   –   0.07±0.02   –   1.86±0.18   0.25\n\nFWHM      Ch3   Swift   –   0.08±0.01   –   1.88±0.12   0.33\n\nFWHM      Ch4   Swift   –   0.03±0.01   –   1.75±0.18   0.12\n\nt_ r     total sample   Swift   0.01±0.01   –   1.82±0.13   –   1.37\n\nt_ r     total sample   Swift   –   0.04±0.00   –   1.99±0.01   0.89\n\nt_ r     Ch1   Swift   –   0.01±0.01   –   1.58±0.17   0.13\n\nt_ r     Ch2   Swift   –   0.03±0.01   –   1.88±0.12   0.14\n\nt_ r     Ch3   Swift   –   0.03±0.01   –   1.94±0.08   0.79\n\nt_ r     Ch4   Swift   –   0.03±0.01   –   1.81±0.20   0.22\n\nt_ d     total sample   Swift   0.05±0.01   –   1.86±0.14   –   1.25\n\nt_ d     total sample   Swift   –   0.05±0.00   –   1.99±0.02   0.54\n\nt_ d     Ch1   Swift   –   0.04±0.01   –   1.78±0.19   0.11\n\nt_ d     Ch2   Swift   –   0.03±0.02   –   1.68±0.20   0.27\n\nt_ d     Ch3   Swift   –   0.05±0.01   –   1.88±0.12   0.22\n\nt_ d     Ch4   Swift   –   0.02±0.01   –   1.87±0.13   0.28\n\nt_ m     total sample   Swift   0.04±0.02   –   1.75±0.17   –   1.43\n\nt_ m     total sample   Swift   –   0.07±0.00   –   1.97±0.03   0.28\n\nt_ m     Ch1   Swift   –   0.04±0.01   –   1.79±0.17   0.11\n\nt_ m     Ch2   Swift   –   0.05±0.01   –   1.78±0.15   0.18\n\nt_ m     Ch3   Swift   –   0.05±0.01   –   1.90±0.11   0.26\n\nt_ m     Ch4   Swift   –   0.04±0.01   –   1.83±0.15   0.20\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter Swift was launched, the bright X-ray flares are detected in nearly half of GRBs <cit.>. Generally, X-ray flares are characterized as the late central engine activities, through a mechanism similar to that of GRB prompt emissions <cit.>. At present, some of theoretical models of GRB and X-ray flares involve magnetic reconnection scenario <cit.>. <cit.> suggested that the differential rotation of millisecond magnetar after compact star mergers can lead to windup of interior\npoloidal magnetic fields to toroidal fields, which are strong enough to\nfloat up and break through the stellar surface. Once penetrating through the surface, the toroidal fields with different polarity may reconnect and give rise to original GRB and multiple X-ray flares.\nIn the Internal Collision-induced Magnetic Reconnection and Turbulence (ICMART) model proposed by <cit.>, internal collisions distort the ordered magnetic field lines in the ejecta. Then, GRBs and X-ray flares can be triggered by magnetic reconnection in the distorted magnetic field. The ICMART model can well reproduce the properties of GRB prompt phases and X-ray flares simultaneously.\nOur statistical results of the similar statistical framework of SOC system of GRBs and X-ray flares support the model and can impose strong constraints on the same magnetically dominated stochastic process and mechanism of them.\n\n\n<cit.> studied three statistical properties: power-law frequency distributions for energies, durations and waiting times of GRB X-ray flares with known redshift. They suggested that GRB X-ray flares can be explained with the same statistical framework with solar flares and correspond to a one-dimensional SOC system. In our previous work <cit.>, we studied the peak times, rise times, decay times, waiting times, and durations of a larger GRB X-ray flare sample and further strengthened the self-organized criticality in GRB X-ray flares. Nevertheless, the Euclidean space dimension S = 3 is\ndifferent from the result reported by <cit.>. As to GRB prompt phases, it is very exciting that our conclusion is consistent with that reported by <cit.> in despite of different GRB samples. It can be naturally explained by the theory that GRB prompt phases and X-ray flares arise from different active stages of internal shocks <cit.>. The radial component of magnetic fields decays faster with radius <cit.>. Thus, the early GRB prompt phases near to the central engine is in a 3-dimensional form while the X-ray flares are closer to one dimension rather\nthan three dimensions <cit.>. It is worth noting that GRB optical\nflares are found to share a similar physical origin to X-ray flares and similar frequency distributions further confirm the SOC nature of GRB system <cit.>.\n\n\n\n\n\n§ CONCLUSIONS\n \nIn this paper, we have systematically studied the differential and cumulative distributions\nof short GRBs from the fourth BATSE TTE Catalog and the third Swift GRB Catalog from 2004 December to\n2019 July. For the first time, we presented the joint analysis among the different individual energy bands\nin both BATSE and Swift sGRBs. Our major results are summarized as follows:\n\n1. We find that GRBs have similar power-law distributions with GRB X-ray flares for peak flux, FWHM, rise time, decay time, and peak time, thus both can be attributed to a SOC process.\n\n2. There is no obvious power-law index evolution across different energy bands.\n\n3. It is found that the results for Swift sGRBs are essentially consistent with those in BATSE ones.\n\n4. According to <cit.>, our results are used to derive the possible Euclidean space dimensions of the GRB SOC system and obtain the spatial dimension S = 3.\n\nIn this work, our survey is restricted to the BATSE and Swift short GRBs and shed new light on the physical processes of compact binaries mergers. In fact, some long GRBs are found to originate from moderately-magnetized millisecond\npulsars with hyperaccreting accretion disks after the collapses of massive stars <cit.>. Thus, it is worth exploring the SOC behavior in long GRB prompt emissions. On the one hand, the longer duration enhances the chance of analyzing the multi-pulses (more than three) within a single burst. On the other hand, the higher detection rate of long GRBs makes it possible to obtain enough pulses to perform the statistics. Therefore, further search for GRBs, especially those with X-ray flares observed simultaneously from the Fermi, HXMT, GECAM, and SVOM catalogs can help to unveil the real physical mechanism of GRBs in the future.\n\n\n§ ACKNOWLEDGEMENTS\n\nWe thank the referee for very helpful suggestion and\ncomments. This work is supported by the National Natural Science Foundation of\nChina (Grant No. U2038106), and China Manned Spaced Project (CMS-CSST-2021-A12).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Arnold(2015)]Arnold2015Arnold, B.C. 2015, Pareto Distributions (2nd ed.). Chapman and Hall/CRC. https://doi.org/10.1201/b18141\n[Abdo et al.(2011)]Abdo2011 Abdo, A. A., Ackermann, M., Ajello, M., et al. 2011, , 734, L27. doi:10.1088/2041-8205/734/2/L27\n[Aschwanden(2011)]Aschwanden2011 Aschwanden, M. J. 2011, Self-Organized Criticality in Astrophysics, by Markus J. Aschwanden.  Springer-Praxis, Berlin ISBN 978-3-642-15000-5, 416p.\n    [Aschwanden(2012)]Aschwanden2012 Aschwanden, M. J. 2012, , 539, A2. doi:10.1051/0004-6361/201118237\n[Aschwanden(2014)]Aschwanden2014 Aschwanden, M. J. 2014, , 782, 54. doi:10.1088/0004-637X/782/1/54\n[Aschwanden(2015)]Aschwanden2015 Aschwanden, M. J. 2015, , 814, 19. doi:10.1088/0004-637X/814/1/19\n[Aschwanden & Dudok de Wit(2021)]Aschwanden2021 Aschwanden, M. J. & Dudok de Wit, T. 2021, , 912, 94. doi:10.3847/1538-4357/abef69\n[Aschwanden(2022)]Aschwanden2022 Aschwanden, M. J. 2022, , 934, 33. doi:10.3847/1538-4357/ac6bf2\n[Bak et al.(1987)]Bak1987 Bak, P., Tang, C., & Wiesenfeld, K. 1987, , 59, 381. doi:10.1103/PhysRevLett.59.381\n\n[Burrows et al.(2005)]Burrows2005 Burrows, D. N., Romano, P., Falcone, A., et al. 2005, Science, 309, 1833. doi:10.1126/science.1116168\n[Chang et al.(2021)]Chang2021 Chang, X. Z., Peng, Z. Y., Chen, J. M., et al. 2021, , 922, 34. doi:10.3847/1538-4357/ac14b6\n[Cheng et al.(2020)]Cheng2020 Cheng, Y., Zhang, G. Q., & Wang, F. Y. 2020, , 491, 1498. doi:10.1093/mnras/stz3085\n[Chincarini et al.(2010)]Chincarini2010 Chincarini, G., Mao, J., Margutti, R., et al. 2010, , 406, 2113. doi:10.1111/j.1365-2966.2010.17037.x\n[Dai et al.(2006)]Dai2006 Dai, Z. G., Wang, X. Y., Wu, X. F., et al. 2006, Science, 311, 1127. doi:10.1126/science.1123606\n[Du et al.(2021)]Du2021 Du, M., Yi, S.-X., Liu, T., et al. 2021, , 908, 242. doi:10.3847/1538-4357/abd6bd\n[Giannios(2006)]Giannios2006 Giannios, D. 2006, , 455, L5. doi:10.1051/0004-6361:20065578\n[Hakkila & Preece(2011)]Hakkila2011 Hakkila, J. & Preece, R. D. 2011, , 740, 104. doi:10.1088/0004-637X/740/2/104\n[Hakkila et al.(2018)]Hakkila2018 Hakkila, J., Horváth, I., Hofesmann, E., et al. 2018, , 855, 101.  doi:10.3847/1538-4357/aaac2b\n[Hosking & Wallis(1987)]Hosking1987Hosking, Jonathan R. M. & Jamie Wallis.  1987, Technometrics, 29, 339. doi:10.1080/00401706.1987.10488243\n[Johnson(1994)]Johnson1994 Johnson, N. L., Kotz, S., & Balakrishnan, N.  1994, Continuous Univariate Distributions, Vol. 1\n[Kocevski et al.(2003)]Kocevski2003 Kocevski, D., Ryde, F., & Liang, E.,  2003, , 596, 389\n[Kumar & Zhang(2015)]Kumar2015 Kumar, P. & Zhang, B. 2015, , 561, 1. doi:10.1016/j.physrep.2014.09.008\n[Lazarian et al.(2020)]Lazarian2020 Lazarian, A., Eyink, G. L., Jafari, A., et al. 2020, Physics of Plasmas, 27, 012305. doi:10.1063/1.5110603\n  [Li et al.(2020)]Lxj1 Li, X.-J., Zhang, Z.-B., Zhang, C.-T., et al. 2020, , 892, 113. doi:10.3847/1538-4357/ab7a94\n doi:10.3847/1538-4357/aaac2b\n [Li et al.(2021)]Lxj2 Li, X. J., Zhang, Z. B., Zhang, X. L., et al. 2021, , 252, 16. doi:10.3847/1538-4365/abd3fd\n\n[Li et al.(2015)]Li2015 Li, Y.-P., Yuan, F., Yuan, Q., et al. 2015, , 810, 19. doi:10.1088/0004-637X/810/1/19\n[Lien et al.(2016)]Lien2016 Lien, A., Sakamoto, T., Barthelmy, S. D., et al. 2016, , 829, 7. doi:10.3847/0004-637X/829/1/7\n[Liu et al.(2017)]Liu2017 Liu, T., Gu, W.-M., & Zhang, B. 2017, , 79, 1. doi:10.1016/j.newar.2017.07.001\n[Lu & Hamilton(1991)]Lu1991 Lu, E. T. & Hamilton, R. J. 1991, , 380, L89. doi:10.1086/186180\n[Lyu et al.(2020)]Lv2020 Lyu, F., Li, Y.-P., Hou, S.-J., et al. 2020, Frontiers of Physics, 16, 14501. doi:10.1007/s11467-020-0989-x\n[Lomax (1954)]Lomax1954 Lomax, K. S. 1954, J. Am. Stat. Assoc., 49, 847. doi:10.1080/01621459.1954.10501239\n[Margutti et al.(2010)]Margutti2010 Margutti, R., Guidorzi, C., Chincarini, G., et al. 2010, , 406, 2149. doi:10.1111/j.1365-2966.2010.16824.x\n[Melatos et al.(2008)]Melatos2008 Melatos, A., Peralta, C., & Wyithe, J. S. B. 2008, , 672, 1103. doi:10.1086/523349\n[Mészáros(2006)]M2006 Mészáros, P. 2006, Reports on Progress in Physics, 69, 2259. doi:10.1088/0034-4885/69/8/R01\n[Romano et al.(2006)]Romano2006 Romano, P., Moretti, A., Banat, P. L., et al. 2006, , 450, 59. doi:10.1051/0004-6361:20054172\n[Tang et al.(2019)]Tang2019 Tang, C.-H., Huang, Y.-F., Geng, J.-J., Zhang, Z.-B. 2019, ApJS, 245, 1. doi:10.3847/1538-4365/ab4711\n\n[Wang & Dai(2013)]Wang2013 Wang, F. Y. & Dai, Z. G. 2013, Nature Physics, 9, 465. doi:10.1038/nphys2670\n[Wang & Yu(2017)]Wang20171 Wang, F. Y. & Yu, H. 2017, , 2017, 023. doi:10.1088/1475-7516/2017/03/023\n[Wang et al.(2021)]Wang2021 Wang, F. Y., Zhang, G. Q., & Dai, Z. G. 2021, , 501, 3155. doi:10.1093/mnras/staa3912\n[Wang et al.(2017)]Wang20172 Wang, J. S., Wang, F. Y., & Dai, Z. G. 2017, , 471, 2517. doi:10.1093/mnras/stx1728\n[Wei et al.(2021)]Wei2021 Wei, J.-J., Wu, X.-F., Dai, Z.-G., et al. 2021, , 920, 153. doi:10.3847/1538-4357/ac2604\n[Wei(2022)]Wei2022 Wei, J.-J. 2022, arXiv:2212.08813\n[Xie et al.(2022)]Xie2022 Xie, L., Wei, D.-M., Wang, Y., et al. 2022, , 934, 125. doi:10.3847/1538-4357/ac7c13\n\n[Yi et al.(2015)]Yi2015 Yi, S.-X., Wu, X.-F., Wang, F.-Y., et al. 2015, , 807, 92. doi:10.1088/0004-637X/807/1/92\n[Yi et al.(2016)]Yi2016 Yi, S.-X., Xi, S.-Q., Yu, H., et al. 2016, , 224, 20. doi:10.3847/0067-0049/224/2/20\n[Yi et al.(2017)]Yi2017 Yi, S.-X., Yu, H., Wang, F. Y., et al. 2017, , 844, 79. doi:10.3847/1538-4357/aa7b7b\n[Yi et al.(2022)]Yi2022 Yi, S.-X., Du, M., & Liu, T. 2022, , 924, 69. doi:10.3847/1538-4357/ac35e7\n[Zhang et al.(2006)]ZhangB2006 Zhang, B., Fan, Y. Z., Dyks, J., et al. 2006, , 642, 354. doi:10.1086/500723\n[Zhang & Yan(2011)]ZhangB2011 Zhang, B. & Yan, H. 2011, , 726, 90. doi:10.1088/0004-637X/726/2/90\n[Zhang & Zhang(2014)]Zhang2014 Zhang, B. & Zhang, B. 2014, , 782, 92. doi:10.1088/0004-637X/782/2/92\n[Zhang et al.(2022)]Zhang2022 Zhang, W.-L., Yi, S.-X., Yang, Y.-P., et al. 2022, Research in Astronomy and Astrophysics, 22, 065012. doi:10.1088/1674-4527/ac6aac\n\n\n\n"}