{"entry_id": "http://arxiv.org/abs/2303.07323v2", "published": "20230313174319", "title": "Constraint of the Nuclear Dissipation Coefficient in Fission of Hypernuclei", "authors": ["J. L. Rodríguez-Sánchez", "J. Cugnon", "J. -C. David", "J. Hirtz", "A. Kelić-Heil", "I. Vidaña"], "primary_category": "nucl-th", "categories": ["nucl-th"], "text": "\n\nAPS/123-QED\n\n\n\n[Corresponding author: ]j.l.rodriguez.sanchez@udc.es\nCITENI, Campus Industrial de Ferrol, Universidade da Coruña, E-15403 Ferrol, Spain\nIGFAE, Universidad de Santiago de Compostela, E-15782 Santiago de Compostela, Spain\n\nAGO department, University of Liège, allée du 6 août 19, bât. B5, B-4000 Liège, Belgium\n\nIRFU, CEA, Université Paris-Saclay, F-91191 Gif-sur-Yvette, France\n\nIRFU, CEA, Université Paris-Saclay, F-91191 Gif-sur-Yvette, France\nPhysics Institute, University of Bern, Sidlerstrasse 5, 3012 Bern, Switzerland\n\nGSI-Helmholtzzentrum für Schwerionenforschung GmbH, D-64291 Darmstadt, Germany\n\nINFN, Sezione di Catania, Dipartimento di Fisica “Ettore Majorana\", Università di Catania, I-95123 Catania, Italy\n\n\n             \n\n\n\nExperimental studies of nuclear fission induced by fusion, transfer, spallation, fragmentation, and electromagnetic reactions in combination with state-of-the-art calculations are successful to investigate the nuclear dissipation mechanism in normal nuclear matter, containing only nucleons. The dissipation mechanism has been widely studied by the use of many different fission observables and nowadays the dissipation coefficients involved in transport theories are well constrained. However, the existence of hypernuclei and the possible presence of hyperons in neutron stars make it necessary to extend the investigation of the nuclear dissipation coefficient to the strangeness sector. In this Letter, we use fission reactions of hypernuclei to constrain for the first time the dissipation coefficient in hypernuclear matter, observing that this coefficient increases a factor of 6 in presence of a single Λ-hyperon with respect to normal nuclear matter.\n\n\n\nConstraint of the Nuclear Dissipation Coefficient in Fission of Hypernuclei\n\n    I. Vidaña\n    March 30, 2023\n============================================================================\n\n\nIntroduction.– \n\nDissipation mechanisms play an important role in nuclear physics and astrophysics to describe the dynamics of nuclei and neutron stars (NSs), respectively. In nuclear physics one of the most intensively investigated nuclear dynamics mechanism involving dissipation is the fission process, in which a heavy nuclear system is deformed until it splits into two lighter  fragments with similar masses <cit.>. The general picture of this decay process naturally leads to the fission description in terms of a nuclear potential-energy surface as a function of the nuclear shape <cit.>, but its complete modeling also requires the knowledge of dynamic properties of the fissioning system, namely, the static nuclear configurations out of equilibrium, the coupling between collective and intrinsic degrees of freedom, and the dynamics of large amplitude collective motion. The dynamical evolution through the nuclear potential-energy landscape is dominated by the exchange of energy between the collective and intrinsic degrees of freedom, in which the transfer of energy is described as a dissipative process. According to a semiclassical picture, the most complete transport treatment is provided by approaches of motion based on the Langevin <cit.> or Fokker-Planck equation (FPE) <cit.>, where the viscosity coefficient appears as a free parameter. The collective coordinates usually exhibit a Brownian-like motion that can be simulated numerically as a random walk <cit.>. The simplicity of this approach together with its remarkable agreement with known data make it suitable for global studies of fission probabilities and other fission observables <cit.>.\n\nThe presence of hyperons (baryons with strange content) in finite and infinite nuclear systems, such as hypernuclei and neutron stars, make it necessary to extend the investigation of the nuclear dissipation coefficient to the strangeness sector. Hypernuclei, bound systems composed of nucleons and hyperons, can be produced by several reactions (see e.g. Ref. <cit.>) where hyperons can be captured by nuclei since their lifetimes (∼ hundreds of ps) are longer than the characteristic reaction times (∼10^-23 s) <cit.>. \nThe study of hypernuclei and their properties provides the opportunity to study baryon-baryon interactions <cit.> from an enlarge perspective and to extend, in this way, our present knowledge of conventional nuclear physics to the SU(3)-flavor sector <cit.>.\n\nIn astrophysics the dissipation mechanisms also play a crucial role in the understanding of the  oscillation modes of NSs, which have attracted interest for a considerable time. Significant effort has been aimed at understanding whether gravitational-wave emission sets the upper rotational frequency limit for pulsars, e.g., via the r-mode instability discovered by Andersson, Friedman, and Morsink <cit.> in 1998. This possibility is of particular interest since r-modes can lead to the emission of detectable gravitational waves in hot and rapidly rotating NSs. R-modes are predominantly toroidal oscillations (i.e., oscillations with a divergenceless velocity field and a suppressed radial component of the velocity) of rotating stars restored by the Coriolis force <cit.>, acting similar to Rossby waves in Earth’s atmosphere and oceans. It is of great importance to understand whether internal fluid dissipation allows the instability to develop in such systems or whether it suppresses the r-modes completely. There are many mechanisms in real NSs that compete with the gravitational wave driving of the r-mode. The instability can only develop when the gravitational radiation growth timescale is shorter than the damping timescales due to the various viscosity mechanisms, such as exotic bulk viscosity due to the presence of hyperons or quark matter <cit.>, and enhanced mutual-friction dissipation <cit.>. This defines a region in the spin-temperature parameter space where the r-mode instability is active. If the instability occurs, the star rapidly radiates its angular momentum via gravitational waves until the rotation frequency reaches the critical value, at which the r-modes become stable. This rapid process is accompanied by the NS reheating <cit.>. Therefore, the dissipation process suppresses this instability and makes cold and hot NSs effectively stabilized by shear and bulk viscosities <cit.>, respectively. Unfortunately, direct measurements of the shear and bulk viscosities in NSs do not exist yet.\n\nIn this Letter, we propose to investigate the dissipation coefficient in hypernuclear matter following the methodology proposed in pioneering works on nuclear fission, in which fission cross sections <cit.>, charge distribution of fission fragments <cit.>, multiplicity of γ-rays, neutrons, and light-charged particles <cit.> were used to obtain the nuclear dissipation coefficient in normal nuclear matter. For the present work we take advantage of the data collected during the hypernuclei experiments <cit.> performed at the COSY-Jülich facility (Germany) by comparing the fission cross sections induced in heavy hypernuclei to dynamical calculations based on the FPE approach, which also allows us for the first time to study the dependence of the dissipation parameter on the number of hyperons that constitute the nuclear system.\n\nTheoretical framework.–\nThe collision between the proton and target nuclei, the so-called spallation reaction, is described with the latest C++ version of the dynamical Liège intranuclear-cascade model (INCL) <cit.> coupled to the ablation model ABLA <cit.>, which are based on Monte Carlo techniques obeying all conservation laws throughout each reaction event. INCL describes the spallation reaction as a sequence of binary collisions between the nucleons (hadrons) present in the system. Nucleons move along straight trajectories until they undergo a collision with another nucleon or until they reach the surface, where they could possibly escape. The latest version of the INCL also includes isospin- and energy-dependent nucleus potentials calculated according to optical models <cit.>, isospin-dependent pion potentials <cit.>. INCL has been recently extended toward high energies (∼20 GeV) including new interaction processes, such as multipion production <cit.>, production of η and ω mesons <cit.>, and strange particles <cit.>, such as kaons and hyperons. Therefore this new version of INCL allows us to predict the formation of hot hyperremnants and their characterization in atomic (Z) and mass (A) numbers, strangeness number, excitation energy, and angular momentum. We remark that the good agreement of INCL calculations with experimental kaon production cross sections obtained from proton-induced reactions on light, medium-mass, and heavy nuclei at energies of few GeV <cit.>, as well as the reasonable description of hypernuclei production cross sections through strangeness-exchange reactions (π^+,K^+) <cit.>, allow us to guarantee a correct prediction of the excitation energy gained by the hyperremnants after the proton-nucleus collision.\n\nThe hyperremnants enter then the deexcitation stage that is modeled by the code ABLA. This model describes the deexcitation of a nuclear system through the emission of γ-rays, neutrons, Λ-hyperons, light-charged particles, and intermediate-mass fragments (IMFs) or fission decays in case of hot and heavy compound nuclei. The particle emission probabilities are calculated according to the Weiβkopf-Ewing formalism <cit.>, being the separation energies and the emission barriers for charged particles calculated according to the atomic mass evaluation from 2016 <cit.> and the prescription given by Qu and collaborators <cit.>, respectively. The fission decay width is described by the Bohr-Wheeler transition-state model <cit.>, following the formulation given by Moretto and collaborators <cit.>:\n\n    Γ_f^BW= 1/2 πρ_gs(E,J)∫_0^E-B_fρ_sp(E-B_f-ϵ,J) dϵ,\n\nwhere ρ_gs and ρ_sp are the level densities at the ground state and the fission saddle point, respectively, E is the excitation energy, J represents the angular momentum, and B_f is the fission-barrier height obtained from the finite-range liquid-drop model of Sierk <cit.> taking into account the influence of angular momentum and considering the ground-state shell effects <cit.>. In the case of hypercompound systems, the hyperenergy contribution Δ B_f^hyp released during the fission process due to the attractive YN force is added to B_f in Eq. <ref>. This hyperenergy Δ B_f^hyp is parametrized according to the description given by Ion and collaborators <cit.> as follows:\n\n    Δ B_f^hyp = 0.51( m_Λ - m_n + S_n - S_Λ)/A^2/3,\n\nwhere m_Λ (S_Λ) and m_n (S_n) are the Λ and neutron masses (separation energies), respectively, and A is the mass number of the hypercompound nucleus. This equation leads to small increases in the fission barrier height up to Δ B_f ∼ 1 MeV that are, for instance, compatible with the results obtained from more sophisticated calculations based on Skyrme-Hartree-Fock approaches <cit.>.\n\nThe slowing effects of nuclear dissipation are included by using the\nKramers-modified Bohr-Wheeler model <cit.> as follows:\n\n    Γ_f^K = [ √(1+ (β/2 ω_0)^2) -β/2 ω_0] Γ_f^BW,\n\nwhere β is the nuclear dissipation coefficient and ω_0 is the frequency of the harmonic oscillator describing the inverted potential at the fission barrier, calculated according to the liquid-drop model <cit.>. This equation provides the asymptotic value of the fission decay width, which is modified according to an analytical approximation to the solution of the one-dimensional Fokker-Planck equation <cit.>, developed by Jurado and collaborators in Refs. <cit.>, to take into account the time dependence of the fission-decay width. The Eq. <ref> was modified later to consider the initial quadrupole deformation of a compound nucleus, which provides a more realistic description of fission yields in the actinide region <cit.>. Under this approximation, the time-dependent fission-decay width is given as:\n\n    Γ_f(t)= W_n (x = x_sd ; t, β)/W_n (x = x_sd ; t→∞, β)Γ_f^K,\n\nwhere W(x; t, β) is the normalized probability distribution at the saddle-point deformation x_sd, being the saddle-point deformations calculated according to Ref. <cit.>.\n\nApplication to proton-induced fission reactions on hypernuclei.–\nIn the 1990's an experimental campaign was carried out at the COSY-Jülich facility to measure the lifetime of Λ-hyperons in the nuclear medium using fission reactions of heavy hypernuclei as a tool to reconstruct the Λ-hyperon decay vertex. The measurements were performed by using the recoil shadow method <cit.>, which also allowed for the first time to determine the hypernuclear fission cross sections for two nuclear systems: ^238U and ^209Bi. \n\n\n\n\n\nIn Figs. <ref> and <ref> we display the experimental cross sections obtained for hypernuclear fission reactions induced in ^238U and ^209Bi nuclei, respectively, as a function of the proton kinetic energy. These data are compared to INCL+ABLA calculations in which we have assumed different values for the dissipation parameter β: 4.5 (solid line), 20 (short-dashed line), and 40 (long-dashed line)× 10^21 s^-1. We can see that the hypernuclear fission cross sections decrease when increasing the value of the viscosity parameter, which is expected since the nuclear system evolves more slowly, needing more time to reach the saddle point configuration. This fact favors the cooling of the nuclear system by particle emission reducing the fission probabilities. In these calculations we also take into account the uncertainties in the nuclear level densities and fission barrier heights, which are displayed in the figures with dashed areas. These uncertainties do not exceed 18% of the total hypernuclear fission cross section, being the 16% of this uncertainty attributed to the fission barrier height. The comparison allows us to constrain the value of the viscosity coefficient for both nuclear systems, resulting in the values given in Table <ref>, where the uncertainties were calculated by propagating the uncertainty of each experimental fission cross section. The values are also compared to that obtained from spallation and fragmentation reactions of normal nuclei inducing fission.\n\nThe results of Table <ref> are also displayed in Fig. <ref> to illustrate the evolution with the presence of Λ-hyperons in the nuclear system. Here we believe the nuclear dissipation coefficient is well constrained for normal nuclear matter taking into account the large number of nuclear fission experiments performed in the last decades, so the value of (4.5 ± 2.0) × 10^21 s^-1 is quite robust <cit.>. Applying the same calculations to hypernuclear matter we find that the value of the dissipation coefficient increases roughly a factor of 6 due to the presence of a Λ-hyperon and the linear extrapolation of our findings to a larger number of Λ-hyperons leads to higher dissipation coefficients, for instance, β = 75 × 10^21 s^-1 for hypernuclei containing three Λ-hyperons.\n\nWe therefore conclude that the dissipation coefficient increases with the presence of hyperons, but we would like to remark here that for the nuclei used in this work there is only a single experimental data point and, thus, more measurements have to be performed to complete the evolution of the hypernuclei fission cross sections with the proton kinetic energy.\n\n\n\nSummary and conclusions.– \nThe hypernuclei fission cross sections measured at the COSY-Jülich facility with high energetic protons impinging onto target nuclei of ^209Bi and ^238U are used for the first time to investigate the nuclear dissipation coefficient in the presence of hypernuclear matter. The experimental data were compared to a state-of-the art dynamical model that describes the proton-nucleus collision and the subsequent deexcitations through particle and cluster emission as well as nuclear fission. The comparison allowed us to constrain the dissipation parameter in fission of hypernuclear matter, resulting in an average value of (28 ± 12) × 10^21 s^-1 <cit.>. This finding is 6  times larger than that obtained for normal nuclear matter <cit.>, which implies that in presence of hyperons the conversion of intrinsic energy into collective motion goes much slower.\n\nWe also conclude with this work that more experimental data are required to confirm the present results. This lack may be overcome with the construction of new facilities, such as the Facility for Antiproton and Ion Research (FAIR) <cit.> at Darmstadt (Germany) and the High Intensity Heavy-ion Accelerator Facility (HIAF) <cit.> at Huizhou (China), together with the design of state-of-the art detectors for hypernuclear matter research and the increase of luminosity for the production of relativistic radioactive beams. The forthcoming experiments could provide unique opportunities to study hypernuclear matter in a large range of atomic numbers, from light to heavy nuclei, and to investigate hypernuclei in extreme proton-neutron asymmetry conditions far away from the stability valley. \n\nMeasurement of other fission observables, such as the charge and mass distributions of the fission fragments as well as the multiplicity of emitted particles, in combination with relativistic proton-nucleus and nucleus-nucleus <cit.> collisions in inverse kinematics might shed light on the dependence of the dissipation parameter with the nuclear density and nuclear deformations, as already investigated with normal nuclei <cit.>. Moreover, the measurement of double-Λ hypernuclei fission reactions could be used to constrain the dissipation coefficient at a larger number of Λ-hyperons and to better understand the tendency shown in the Fig. <ref>. Therefore these kinds of experimental measurements could be helpful to extrapolate the values of the dissipation coefficient to hyperon matter in neutron stars.\n\n\nAcknowledgments.–\nWe thank Dr. Alain Boudard, Dr. Davide Mancusi, and Dr. Sylvie Leray for enlightening discussions and Dr. Georg Schnabel for his technical support. This work was partially supported by the P2IO LabEx (ANR-10-LABX-0038) in the framework \"Investissements d'Avenir\" (ANR-11-IDEX-0003-01), managed by the Agence Nationale de la Recherche (ANR) (France), and by the EU ENSAR2 FP7 project (Grant Agreement No. 654002). I.V. thanks the support of the European Union’s Horizon 2020 research and innovation programme under Grant Agreement No. 824093. J.L.R.-S. is thankful for the support by the Department of Education, Culture and University Organization of the Regional Government of Galicia under the Postdoctoral Fellowship Grant No. ED481D-2021-018 and by the \"Ramón y Cajal\" programme under the Grant No. RYC2021-031989-I, funded by MCIN/AEI/10.13039/501100011033 and by “European Union NextGenerationEU/PRTR”.\n\n\n\n*\n20\n\n\nMeitner1939\nL. Meitner and O. R. Frisch, Nature (London) 143, 239 (1939).\n\nHahn1939\nO. Hahn and F. Strassmann, Naturwissenschaften 27, 11 (1939).\n\nMoller2001\nP. Möller, D. Madland, A. Sierk, and A. Iwamoto, Nature 409, 785 (2001).\n\nWada1992\nT. Wada, N. Carjan, and Y. Abe, Nucl. Phys. A 538, 283 (1992).\n\nSierk2017\nA. J. Sierk, Phys. Rev. C 96, 034603 (2017).\n\nRisken1989\nH. Risken, The Fokker-Planck Equation (Springer, Berlin, 1989).\n\nGrange1980\nP. Grangé and H. Weidenmüller, Phys. Lett. B 96, 26 1980.\n\nRandrup2011\nJ. Randrup and P. Möller, Phys. Rev. Lett. 106, 132503 (2011).\n\nFrobrich1988\nP. Fröbrich and I. I. Gontchar, Phys. Rep. 292, 131 (1988).\n\nNadtochy2007\nP. N. Nadtochy, A. Kelić, and K.-H. Schmidt, Phys. Rev. C 75, 064614 (2007).\n\nRandrup2013\nJ. Randrup and P. Möller,  Phys. Rev. C 88, 064606 (2013).\n\nGal2016 A. Gal, E. V. Hugenford, and D. J. Millener, Rev. Mod. Phys. 8, 035004 (2016).\n\nPark2000\nH. Park et al., Phys. Rev. C 61, 054004 (2000).\n\nMillener1988\nD. J. Millener, C. B. Dover, and A. Gal, Phys. Rev. C 38, 2700 (1988).\n\nMaessen1989\nP. M. M. Maessen, Th. A. Rijken, and J.J. de Swart, Phys. Rev. C 40, 2226 (1989).\n\nTominaga98\nK. Tominaga, T. Ueda, M. Yamaguchi, N. Kijima, D. Okamoto, K. Miyagawa, T. Yamada, Nucl. Phys. A 642, 483 (1998).\n\nPolinder2006 H. Polinder, J. Haidenbauer, and U.-G. Meißner, Nucl. Phys. A 779, 244 (2006).\n\nHaidenbauer2013 J. Haidenbauer, S. Petschauer, N. Kaiser, U.-G. Meißner, A. Nogga, and W. Weise,\nNucl. Phys. A 915, 24 (2013).\n\nHiyama2018\nE. Hiyama and K. Nakazawa, Annu. Rev. Nucl. Part. Sci. 68, 131 (2018).\n\nHaidenbauer2020 J. Haidenbauer, U.-G. Meißner, and A. Nogga, Eur. Phys. J. A 56, 91 (2020).\n\nLenske2018 H. Lenske, M. Dhar, T. Gaitanos, and X. Cao, Prog. Part. Nucl. Phys. 98, 119 (2018).\n\nAndersson1998\nN. Andersson, Astrophys. J. 502, 708 (1998).\n\nFriedman1998\nJ.L. Friedman and S.M. Morsink, Astrophys. J. 502, 714 (1998).\n\nKolomeitsev2015\nE. E. Kolomeitsev and D. N. Voskresensky, Phys. Rev. C 91, 025805 (2015).\n\nLindblom2002\nL. Lindblom, B. J. Owen, Phys. Rev. D 65, 063006 (2002).\n\nMadsen1998\nJ. Madsen, Phys. Rev. Lett. 81, 3311 (1998).\n\nLindblom2000\nL. Lindblom and G. Mendell, Phys. Rev. D 61, 104003 (2000).\n\nAlford2012\nM. G. Alford, S. Mahmoodifar, and K. Schwenzer, Phys. Rev. D 85, 024007 (2012).\n\nNayyar2006\nM. Nayyar and B. J. Owen, Phys. Rev. D 73, 084001 (2006).\n\nAndersson2001\nN. Andersson and K. D. Kokkotas, Int. J. Mod. Phys. D 10, 381 (2001).\n\nJL2014\nJ. L. Rodríguez-Sánchez et al., Phys. Rev. C 90, 064606 (2014).\n\nAyyad2015\nY. Ayyad, J. Benlliure, J. L. Rodríguez-Sánchez, A. Bacquias, A. Boudard, E. Casarejos, T. Enqvist, M. Fernandez, V. Henzl, V. Henzlova et al., Phys. Rev. C 91, 034601 (2015).\n\nJL2015\nJ. L. Rodríguez-Sánchez et al., Phys. Rev. C 91, 064616 (2015); and Phys. Rev. C 92, 044612 (2015).\n\nCS2007\nC. Schmitt, K.-H. Schmidt, A. Kelić, A. Heinz, B. Jurado, and P. N. Nadtochy, Phys. Rev. C 81, 064602 (2010).\n\nJL2016\nJ. L. Rodríguez-Sánchez et al., Phys. Rev. C 94, 034605 (2016).\n\nOhm1997\nH. Ohm, T. Hermes, W. Borgs, H. R. Koch, R. Maier, D. Prasuhn et al. Phys. Rev. C 55, 3062 (1997).\n\nKulessa1998\nP. Kulessa et al., Phys. Lett. B 427, 403 (1998).\n\nMancusi14\nD. Mancusi, A. Boudard, J. Cugnon, J.-C. David, P. Kaitaniemi, and S. Leray, Phys. Rev. C 90, 054602 (2014).\n\nJL2022\nJ. L. Rodríguez-Sánchez, J. Cugnon, J. C. David, J. Hirtz, A. Kelić-Heil, and S. Leray, Phys. Rev. C 105, 014623 (2022).\n\nBou13\nA. Boudard, J. Cugnon, J.-C. David, S. Leray, and D. Mancusi, Phys. Rev. C 87, 014606 (2013).\n\nAoust2006\nTh. Aoust and J. Cugnon, Phys. Rev. C 74, 064607 (2006).\n\nMancusi2017\nD. Mancusi, S. Lo Meo, N. Colonna, A. Boudard, M. A. Cortés-Giraldo, J. Cugnon, J.-C. David, S. Leray, J. Lerendegui-Marco, C. Massimi, and V. Vlachoudis, Eur. Phys. J. A 53, 80 (2017).\n\nJCD2018\nJ.-C. David, A. Boudard, J. Cugnon, J. Hirtz, S. Leray, D. Mancusi, J. L. Rodríguez-Sánchez, Eur. Phys. J. Plus 133, 253 (2018).\n\nJason2018\nJ. Hirtz, J.-C. David, A. Boudard, J. Cugnon, S. Leray, D. Mancusi, Eur. Phys. J. Plus 133, 436 (2018).\n\nJL2018\nJ. L. Rodríguez-Sánchez, J. C. David, J. Hirtz, J. Cugnon, and S. Leray, Phys. Rev. C 98, 021602(R) (2018).\n\nJason2020\nJ. Hirtz, J.-C. David, A. Boudard, J. Cugnon, S. Leray, I. Leya, J. L. Rodríguez-Sánchez, and G. Schnabel, Phys. Rev. C 101, 014608 (2020).\n\nWe40\nV. F. Weisskopf and D. H. Ewing, Phys. Rev. 57, 472 (1940).\n\nmass2016\nW. J. Huang, G. Audi, M. Wang, F. G. Kondev, S. Naimi, and X. Xu, Chin. Phys. C 41, 030002 (2017).\n\nQu2011\nW. W. Qu et al., Nucl. Phys. A 868 1 (2011).\n\nBW39\nN. Bohr and J. A. Wheeler, Phys. Rev. 56, 426 (1939).\n\nMoretto75\nL. G. Moretto, Nucl. Phys. A 247, 211 (1975).\n\nSierk86\nA. J. Sierk, Phys. Rev. C 33, 2039 (1986).\n\nMoller95\nP. Möller, J. R. Nix, W. D. Myers, and W. J. Swiatecki, At. Nucl. Data Tables 59, 185 (1995).\n\nIon1989\nD. B. Ion, M. Ivaşcu, and R. Ion-Mihai, Rev. Roum. Phys. 34, 461 (1989).\n\nMinato2009\nF. Minato, S. Chiba, and K. Hagino, Nucl. Phys. A 831, 150 (2009).\n\nKR40 \nH. A. Kramers, Physica 7, 284 (1940).\n\nNix1967\nJ. R. Nix, Ann. Phys. 41, 52 (1967).\n\nBJ03\nB. Jurado, K.-H. Schmidt, and J. Benlliure, Phys. Lett. B 553, 186 (2003).\n\nBJ05\nB. Jurado, C. Schmitt, K.-H. Schmidt, J. Benlliure, and A. R. Junghans, Nucl. Phys. A 747, 14 (2005).\n\nHasse\nR. W. Hasse and W. D. Myers, Geometrical Relationships of Macroscopic Nuclear Physics, Springer-Verlag, Berlin, 1988.\n\nJB2017\nJ. Benlliure and J. L. Rodríguez-Sánchez, Eur. Phys. J. Plus 132, 120 (2017).\n\nRodriguez2016\nJ. L. Rodríguez-Sánchez et al., Phys. Rev. C 94, 061601(R) (2016).\n\nstd\nThe uncertainty is calculated with the standard deviation of the mean, using the results listed in the Tab. <ref> for hypernuclear matter.\n\nFairweb\nhttp://www.fair.de.\n\nHiafweb\nhttps://hiaf.impcas.ac.cn\n\nhades\nJ. Adamczewski-Musch et al. (The HADES Collaboration), Nat. Phys. 15, 1040 (2019).\n\n\n\n\n"}