{"entry_id": "http://arxiv.org/abs/2303.06665v1", "published": "20230312140627", "title": "Towards practical mass spectrometry with nanomechanical pillar resonators by surface acoustic wave transduction", "authors": ["Hendrik Kähler", "Robert Winkler", "Holger Arthaber", "Harald Plank", "Silvan Schmid"], "primary_category": "physics.app-ph", "categories": ["physics.app-ph"], "text": "\n\n\n\n\nInstitute of Sensor and Actuator Systems, TU Wien, Gusshausstrasse 27–29, 1040 Vienna, Austria.\n\nChristian Doppler Laboratory for Direct-Write Fabrication of 3D Nanoprobes (DEFINE), Institute of Electron Microscopy and Nanoanalysis, Graz University of Technology, Steyrergasse 17, 8010 Graz, Austria.\n\nInstitute of Electrodynamics, Microwave and Circuit Engineering, TU Wien, Gusshausstrasse 25, 1040 Vienna, Austria.\n\nChristian Doppler Laboratory for Direct-Write Fabrication of 3D Nanoprobes (DEFINE), Institute of Electron Microscopy and Nanoanalysis, Graz University of Technology, Steyrergasse 17, 8010 Graz, Austria.\nInstitute of Electron Microscopy and Nanoanalysis, Graz University of Technology, Steyrergasse 17, 8010 Graz, Austria.\nGraz Centre for Electron Microscopy, Steyrergasse 17, 8010 Graz, Austria.\n\nInstitute of Sensor and Actuator Systems, TU Wien, Gusshausstrasse 27–29, 1040 Vienna, Austria.\nsilvan.schmid@tuwien.ac.at\n\n\n\n             \n\n\nNanoelectromechanical systems (NEMS) have proven outstanding performance in the detection of small masses down to single proton sensitivity. To obtain a high enough throughput for the application in practical mass spectrometry, NEMS resonators have to be arranged in two-dimensional (2D) arrays. However, all state-of-the-art electromechanical transduction methods rely on electrical lines placed close to the mechanical resonators, which drastically restricts the density of 2D resonator arrays. An exception is the transduction by surface acoustic waves (SAWs), which has so far only been shown for the transduction of single nanomechanical pillar resonators. Here, we demonstrate the transduction of pillar pairs by surface acoustic waves. The pillars have a diameter of 700 and show a mass responsivity of -588±98^-1. The distances between the pillar pairs are 70 and 14.3. SAW transduction enabled us to measure both pillars of each pair with electrical lines no closer than 300, illustrating the potential of SAWs to transduce dense arrays of pillar resonators, a crucial step towards practical mass spectrometry with NEMS. \n\n\n\n\n\n\nTowards practical mass spectrometry with nanomechanical pillar resonators by surface acoustic wave transduction\n    Silvan Schmid\n    March 30, 2023\n===============================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nMass spectrometry is a key tool for life sciences and, in particular, for proteomics, the large-scale study of proteins <cit.>. Proteins are essential for organisms and control mechanisms, such as signaling and metabolism <cit.>. One of the most important properties of mass spectrometers is their sensitivity, which determines the minimal amount of a protein species needed to be detected. The sensitivity of conventional mass spectrometers is thousands of molecules <cit.>. In comparison, NEMS-based mass spectrometers are able to detect a single molecule <cit.>. However, nanomechanical resonators have an extremely low capture efficiency, so that it takes many molecules until one lands on the resonator for detection. To exploit the full potential of NEMS-based mass spectrometers, it is essential to reduce the sample loss. Besides an improved focusing of the molecular beam <cit.>, this can be done by the arrangement of multiple resonators in a 2D array <cit.>. The issue is that the standard electromechancial transduction methods do not allow the formation of dense arrays since electrical lines must be placed close to the resonators <cit.>. An exception is the transduction by surface acoustic waves (SAWs), which was recently demonstrated for the transduction of single mechanical pillar resonators <cit.>. The method is based on scattering of surface acoustic waves, which are launched and detected by interdigital transducers, distanced hundreds of micrometers away from the pillars.\n\nPillar resonators are well-suited for the sensing of masses and have two main advantages regarding mass spectrometry in comparison to horizontal mechanical structures: pillar resonators can be arranged in dense arrays due to their vertical structure and offer a defined landing position on the tip for the particles to be measured <cit.>. The latter enables a single mode operation of the pillars, instead of the 2-mode operation necessary for horizontal structures <cit.>. \n\nHere, we demonstrate on the one hand the transduction of pillar pairs with very small separation distances of 70 by SAWs. On the other hand, we show the SAW transduction of pillar pairs with a large separation distance of 14.3. Together, these results show the potential of SAWs to transduce dense arrays of pillar resonators, since in such arrays pillars can be closely and far separated. We measured the transmission scattering parameters of the overall devices as a function of frequency and modeled the results by a cascade of two port networks. In addition, we determine the response of the pillars to an added mass.   \n\n\n\n\n\n\n\n§ SAW TRANSDUCTION AND PILLAR FABRICATION\n\nA scanning electron microscope image (SEM) of a device used in this study is shown in Fig. <ref>(a). The substrate is 128^∘ Y-cut lithium niobate (LiNbO_3), which is piezoelectric. The piezoelectric effect is exploited to generate and detect SAWs by using interdigital transducers (IDTs). The IDTs are fabricated by photolithography and designed to focus Rayleigh-type SAWs. They have a central frequency of 280, a bandwidth of around 110, and each IDT covers an angle of 35^∘. In the focal point of the IDTs, we positioned either a single pillar resonator or a pair of pillars. The pillars are fabricated by Focused Electron Beam Induced Deposition (FEBID) using a platinum metal-organic precursor (MeCpPt^IVMe_3). The dimensions of the pillars were chosen so that their first compression mode falls within the frequency range of the IDTs <cit.>. All pillars had a diameter of 700 and defined heights between 2.3 to 2.9. However, the shape and material properties of different pillars can vary slighty, since FEBID is a very complex process. It involves a large number of independent variables, some of which are dynamically change during fabrication <cit.>. For this reason, we fabricated the two pillars of a pair simultaneously and not one pillar first and then the other.\n\nThe pillars are transduced by resonant scattering of SAWs, as illustrated in Fig. <ref>(a). One of the IDTs emits a SAW and the other IDT measures the SAWs generated by the vibration of the pillars at resonance. We performed all measurements with a network analyzer and used on-wafer calibration. Further details to the device fabrication, the SAW transduction scheme and the experimental setup can be found in Ref. <cit.>. \n\n\n\n§ EQUIVALENT CIRCUIT MODEL\n\nIt has been shown that the SAW transduction can be modelled by a cascade of two port networks described by scattering parameters, as illustrated in Fig. <ref>(b) <cit.>. Since the IDTs are designed equivalently, the transmission scattering parameter of the whole device is given by \n\n    S_21(f) =  C   S_IDT^2(f)   S_P(f)   ,\n\nwhere f is the frequency of the applied input signal, C is a constant, and S_IDT and S_P are the transmission scattering parameters of one of the IDTs and the pillar, respectively. In case of the transduction of a single pillar, the scattering parameter S_P is given by <cit.>\n\n    S_P(f) = S_eff f^2/f_0^2-f^2+i  f  f_0/Q_0  ,\n\nwhere S_eff is an effective scattering parameter, f is the frequency of the incident SAW, and f_0 and Q_0 are the eigenfrequency and the total quality factor of the resonator, respectively.  \n\nIf multiple pillars are to be measured, they can not be placed all in the center. The consequences are additional phase differences between the measured signals of each pillar. First, the total distance traveled by the SAWs from one IDT to the other can differ for different pillar positions. Second, the average phase velocity of the SAWs traveled from one IDT to the other depends on the pillar position if the substrate material is anisotropic. For our devices, the phase velocities along the symmetry axes of the IDTs differ less than 10 % <cit.>. Hence, we assume that the additional phase differences between the pillars of our pillar pairs are small taking into account the orientation of the pillar pairs to the IDTs, as illustrated in Fig. <ref>(a). \nIf we assume that the additional phase differences between the signals of multiple pillars are small and the pillars do not couple, the transmision scattering parameter of the pillars S_P is approximately given by \n\n    S_P(f) ≈∑_n=1^N S_eff,n f^2/f_n^2-f^2+i  f  f_n/Q_n  ,\n\nwhere N is the number of pillars or generally the number of uncoupled eigenmodes. Inserting Eq. (<ref>) into Eq. (<ref>) result in  \n\n    S_21(f) =  C   S_IDT^2(f)  ∑_n=1^N S_eff,n f^2/f_n^2-f^2+i  f  f_n/Q_n  .\n\n\n\n\n§ PILLAR PAIRS\n\nWe measured the frequency response of two pairs of pillars and a device without any pillar as a reference. The pillar pairs were separated by 70 and 14.3. The results of the measurements are shown in Fig. <ref> as well as SEM images of the pillar pairs. The pillars of each pair differed in height to distinguish them from one another. Two resonances are clearly visible for each pair. The resonances are well separated in frequency so that it can be assumed that the modes are not coupled <cit.>. To analyse the frequency response of the pairs, we first determined S_IDT^2 by measuring two focused IDTs facing each other (see Appendix) and then fitted Eq. (<ref>) to the data for N=2 assuming that both pillars of a pair have the same quality factor Q_0. We fitted |S_21| instead of |S_21|/|S^2_IDT|, since the normalization drastically increases the\nnoise outside the IDTs' frequency range. The fit of the model including the measured frequency response of the two IDTs is shown in Fig. <ref> and is in excellent agreement with the measured data of both pairs. \n\n\n\nIn Table <ref> the determined eigenfrequencies and quality factors of the pillars are listed. It can be seen that the ratios of the pillars' heights h_2/h_1 are equivalent to the inverse ratios of the their eigenfrequencies f_1/f_2. This indicates that we measured the first order compression mode of each pillar of a pair and not different eigenmodes of one of the pillars, since the eigenfrequency of a pillar's compression mode is inversely proportional to its height <cit.>. \n\n\n\n\n\n\n§ FREQUENCY RESPONSE TO MASS\n\n\nWe tested the platinum-carbon pillars for mass sensing applications and estimated the responsivity of the pillars to added mass. Previous studies have shown that the platinum-carbon material alters over time in ambient air <cit.>. For this reason, we not only added a mass to a single pillar, but used a second pillar as reference, which was always kept close to the sensing pillar. Both pillars had similar dimensions and are depicted in Fig. <ref>. It shows the frequency responses of the two pillars shortly after fabrication, after 160 days, and after the addition of an extra mass to one of the pillars (178 days). The sensing and the reference pillar had an eigenfrequency of 298 and 308 shortly after fabrication at 0 days, respectively, which we calculated by fitting Eq. (<ref>) to the data for N=1. After 160 days, the eigenfrequency of both pillars decreased by a similar amount: -9 and -8. Between 160 days and 178 days we added a mass to the sensing pillar, as shown in Fig. <ref>(c), which resulted in a frequency decrease of -21. The reference pillar only showed a decrease by -3 in the same time period. If we assume that the sensing pillar shows the same frequency drift over time as the refererence pillar, as it was nearly the case after 160 days, the added mass induced a frequency shift of roughly Δ f_0 = -18±2. The added mass was deposited by FEBID using the same precursor as for the pillars. The deposited material is a mixture of platinum and carbon and has a density of around 4.0±0.3 ^-3 <cit.>. The added mass had a diameter and height of 250 and 540±50, respectively, which gives a total mass of m_add = 106±13. In comparison, the sensing pillar itself had a mass of m_0 = 3.7±0.3.\n\nThe fractional change of the eigenfrequency per added unit mass, which is called mass responsivity, is defined by <cit.>\n\n    R_exp = Δ f_0/m_add 1/f_0  .\n\nWe measured a responsivity for the sensing pillar of R_exp = -588±98^-1 for f_0 = 289. For a pillar vibrating in the first compression mode with a mass added at the top, the theoretical responsivity is given by <cit.>\n\n    R_theo≈ -2/m_0  ,\n\nwhich result in R_theo = -541±44^-1. It can be seen that the measured responsivity is in good agreement with the theoretical expected responsivity. From Eq. (<ref>) it is clear that the responsivity can be improved by reducing the dimensions of the pillars.\n\n\n\n§ CONCLUSION\n\nWe demonstrated the transduction of two pairs of pillars by surface acoustic waves. The pillar pairs were separated by 70 and 14.3. We could actuate and detect the first compression mode of each pillar separately, which illustrates the potential of SAWs to transduce dense arrays of pillar resonators for mass spectrometry. After this successful proof of concept, the next step is to increase the number of pillar resonators, where coupling of the pillars becomes relevant due to the limited bandwidth of the IDTs. Coupling of the pillars complicates the interpretation of their frequency response, but also promises higher mass-sensitivity than individual resonators <cit.>. Additionally, coupling of the pillars can also be used specifically to modify the quality factor of the pillars when it is dominated by radiation losses <cit.>. On our device, we can not place much more than four platinum-carbon pillars without a relevant coupling of the pillars. To increase the number of uncoupled resonators, we could increase the IDTs' bandwidth. However, a strong increase in the IDTs bandwidth result in a reduced transmission scattering parameter of the IDTs <cit.>. A more promising approach is to improve the resonators quality factor. Previous results suggest that the pillars' quality factor is dominated by intrinsic losses, since it seems to be independent of the pillars' dimensions or vibrational mode <cit.>. Hence, the quality factor of the pillars can be improved by using materials with lower intrinsic losses.\n\nIn addition to the transduction of the pillar pairs, we measured the mass responsivity of the pillars. However, our devices were not optimized for mass sensing applications. We operated at a central frequency of 280, This is far away from the frequency limit of SAW devices, which is around several GHz. A modification of our devices to higher frequencies would allow us to transduce smaller pillars with higher responsivities, since the responsivity of the pillars is inversely proportional to their mass, as we discussed above. \n\n\n\nWe thank M. Buchholz for the fabrication of the IDT structures and R.G. West for many fruitful discussions. This work is supported by the European Research Council under the European Unions Horizon 2020 research and innovation program (Grant Agreement-716087-PLASMECS). The financial support by the Austrian Federal Ministry for Digital and Economic Affairs and the National Foundation for Research, Technology and Development is gratefully acknowledged (Christian Doppler Laboratory DEFINE).\n\n\n\n\n§ CONTRIBUTIONS\n\nH.K. designed the samples, performed the electrical measurements, analysed the data, and wrote the original draft. R.W. fabricated the pillar resonators under the supervision of H.P. and supported the data analysis. H.A. supervised the electrical measurements and their analysis. H.K. wrote the paper with input from all authors. S.S. helped conceptualize and supervised the project. All authors reviewed and edited the manuscript.\n\n\n\n§ APPENDIX: TRANSMISSION SCATTERING PARAMETER OF THE IDTS\n\n\nWe determined the transmission scattering parameter of the IDTs S_IDT^2 by measuring two focused IDTs facing each other. The IDTs were designed equivalently to the orthogonally arranged IDTs shown in Fig. <ref>(a) and were placed along the crystallographic X-axis of the LiNbO_3 substrate. The result of the measurement is shown in Fig. <ref>.\n\n\n\n\n\n\n\n\n\n\n"}