{"entry_id": "http://arxiv.org/abs/2303.06661v1", "published": "20230312134332", "title": "Bayesian Size-and-Shape regression modelling", "authors": ["Antonio Di Noia", "Gianluca Mastrantonio", "Giovanna Jona Lasinio"], "primary_category": "stat.ME", "categories": ["stat.ME"], "text": "\n\t\n\n\n\n\n\n\n\n\n\n\n\n\nDepartment of Computer Science, ETH Zurich & Faculty of Economics, University of Lugano\n\nDepartment of Mathematical Sciences, Polytechnic of Turin\n\nDepartment of Statistical Sciences, Sapienza University\n\n\n\n\n\t\n\t\n\t\n\tBayesian Size-and-Shape regression modelling\n    Giovanna Jona Lasinio\n    \n============================================\n\n\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nBuilding on <cit.>, this note presents the Bayesian estimation of a regression model for size-and-shape response variables with Gaussian landmarks. Our proposal fits into the framework of Bayesian latent variable models and allows a highly flexible modelling framework.\n\n\n\n\nBayesian Size-and-Shape regression modelling\n    Giovanna Jona Lasinio\n    \n============================================\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nShape data naturally arise in many research fields whenever our attention focuses on the shape structure of objects. For example, in biology, there is great interest in modelling the shape features of organisms, relating them to environmental conditions. In <cit.>, a study about the sex differences in the crania of a macaque species is reported, and environmental features could be included as well. Magnetic Resonance data can be seen as size-and-shape data. Their analysis is helpful to assess specific features such as the Fetal alcohol spectrum disorder or Schizophrenia Magnetic Resonance images (see ).\nImage analysis and computer vision are other natural fields of application. Generally speaking, image recognition could be approached in different ways, and, among others, the shape analysis approach has often given successful results, e.g., digit recognition ().\nIn genetics, it is common to use electrophoretic gel images (), and shape analysis could be successfully adopted to analyse them efficiently.\nIn chemistry, it is fundamental to assess the geometric structure of molecules by using three-dimensional coordinates, e.g., it has been used to evaluate shape features of steroid molecules ().\nAnd in bio-informatics, an important task is Protein matching, i.e. aligning molecules to find common geometrical structures in them. Shape analysis could be adopted to deal successfully with these tasks ().\n\n\n\n\n\t\n\n\t\n\n\n\n\n\n\t\n\n\nRecent advances rely on the development of methodologies to capture and explain changes in the shape of objects. Some smoothing methods have been proposed in <cit.>, but to our knowledge, the only regression methodology for size-and-shape data  has been proposed by <cit.> in the marginal likelihood estimation framework.\nThis paper proposes an alternative Bayesian regression methodology for size-and-shape response data. The model fits into the Bayesian latent variable models' framework and should be an appealing alternative since it is not affected by numerical issues e.g. local optima of optimization procedures. The latter is because it relies on a simple and efficient MCMC posterior inference procedure. Moreover, it potentially allows a more flexible model's specification, for example, by adding dependence between landmarks. The posterior distribution estimation is carried out by means of Gibbs sampling and Metropolis-within-Gibbs algorithm. Theoretical results are derived and discussed, some simulation results are provided, and some concluding remarks are given.\n\n\n\n§ A BAYESIAN MODEL FOR SIZE-AND-SHAPE\n\nLet 𝐗̃_i∈ℝ^(k+1)× p, with i=1,… , n  be a (k+1)× p dimensional configuration matrix, with k≥ p, that represents the Euclidean coordinates of k+1 landmarks (points of interest an object) in dimension p for the i-th recorded object, where p is usually equal to 2 or 3. To perform any size-and-shape inference, we have to remove information about the objects' location and orientation to model the data. Location information is usually removed post-multiplying by the Helmert submatrix  𝐇 <cit.>, with dimension (k+1)× (k+1), which has non-zero entries only on the lower triangular part and\nhas j-th row equal to (-d_j,-d_j, …, -d_j,jd_j, 0,…, 0) where d_j = 1/√(j(j+1)), obtaining the Helmertized configuration\n\n    𝐗̆_i = 𝐇𝐗̃_i.\n\nThe matrix 𝐗̆_i ∈ℝ^k× p is also called pre-form matrix. Following <cit.>, if we decompose 𝐗̆_i using the singular value decomposition, i.e. according to\n\n    𝐗̆_i = 𝐔_iΔ_i𝐑̆_i^⊤\n\nwhere 𝐑̆_i ∈ O(p) i.e. belongs to the space of the p × p orthogonal matrices, it could be readily proven that 𝐑̆_i contains all the information about orientation and 𝐘_i=𝐔_iΔ_i  is the size-and-shape version of the original configuration  𝐗̆_i,  it represents the object of the inference and the data we are modelling.  An important point is that allowing 𝐑̆_i ∈ O(p) the reflection information is lost, and if we want to retain it, we have to assume that 𝐑̆_i ∈SO(p), i.e., 𝐑̆_i is a rotation matrix with |𝐑̆_i| = 1, and SO(p) is the p-dimensional Special Orthogonal group or rotation group.\n\n\n\n\n §.§ The model\n\nLet us suppose that for each 𝐘_i we have an associated vector of d covariates 𝐳_i = (z_i1,z_i2, … , z_id)^⊤ and we are interested in the relation between 𝐳_i and  𝐘_i. Unfortunately, the size-and-shape space, where 𝐘_i lives, is a non-Euclidean manifold with a very complicated geometric structure that is not easy to handle, and even a distribution for 𝐘_i cannot be easily specified. The idea proposed in <cit.>, which here we extend to a Bayesian setting, \nis to model this relation using the latent variable 𝐑_i ∈SO(p) \n\nand to define a regressive-type relation between 𝐗_i=𝐘_i𝐑_i and 𝐳_i in the following way:\n\n    vec(𝐗_i) ∼𝒩_k p(  vec(∑_h=1^dz_ih𝐁_h), 𝐈_p ⊗Σ),   i = 1, … , n,\n\nwith  𝐗_i ⊥𝐗_i' if i ≠ i', where  vec(·)  indicates the vectorization of a matrix, Σ  is a non singular k × k covariance matrix and 𝐁_h, h = 1, … , d, is a k× p matrix of regressive coefficients. It should be noted that 𝐑_i is latent and hence a non-observable variable, which must not be confused with 𝐑̆_i which is the rotation matrix of the original data. \n\nThis latent  variable approach  avoids dependence on the rotation and leads to a proper inference that depends only on 𝐘_1, …, 𝐘_n.\n\nTo specify our Bayesian proposal of the model, we need to introduce the prior distribution for the model's unknown. To facilitate the notation and the derivation of the full conditionals, we use 𝐗_i,l and 𝐁_i,l to indicate the l-th column of 𝐗_i and 𝐁_i, respectively, we let \nβ_l=(𝐁_1,l^⊤,𝐁_2,l^⊤, …, 𝐁_d,l^⊤)^⊤\nβ = (β_1^⊤,… , β_p^⊤)^⊤ and we introduce the design matrix 𝐙_i = 𝐈_k⊗𝐳_𝐢^⊤, such that \n\n    ((𝐙_iβ_1)^⊤, (𝐙_iβ_2)^⊤, … , (𝐙_iβ_p)^⊤)^⊤ = vec(∑_h=1^dz_ih𝐁_h).\n\nWe then define the Bayesian model in the following way:\n\n    𝐗_i,l| β,Σ   ∼𝒩_k(  𝐙_iβ_l, Σ),      i = 1, … , n,     l = 1,…,p, \n    β_l    ∼ N_kd(𝐌_l, 𝐕_l),\n    Σ   ∼ IW(ν, Ψ),\n\nwith 𝐗_i,l|β,Σ⊥𝐗_i',l'|β,Σ if i≠ i' or l ≠ l' and where IW denotes the Inverse Wishart distribution.\nIt should be noted that (<ref>) and (<ref>), conditioning on β,Σ, identify the same distribution over the entire 𝐗_1,… , 𝐗_n, the conditioning is needed in (<ref>) since they are considered as random variables. \n\nIt must be remarked that\nan identification problem arises from the introduced model specification, which has not been pointed out by <cit.>. To make it evident, we show that the set of parameters {𝐁_1, …, 𝐁_d, Σ} and {𝐁_1Λ, …, 𝐁_dΛ, Σ} where Λ∈SO(p) is a rotation matrix, induce the same density over (𝐔_1, Δ_1, … , 𝐔_n, Δ_n). Let  μ_i = ∑_j=1^dz_ij𝐁_j and f indicates a density, we need to prove that \n\n    f(𝐔_i ,Δ_i; μ_i, Σ)/f(𝐔_i ,Δ_i; μ_iΛ, Σ) = 1,     ∀   i = 1,… , n.\n\nThe density of (𝐔_i, Δ_i) is derived in Theorem 1 by <cit.> which  allows  us to compute (<ref>) that is \n\n    f(𝐔_i ,Δ_i; μ_i, Σ)/f(𝐔_i ,Δ_i; μ_iΛ, Σ) = exp(-tr(μ_i^⊤Σ^-1μ_i) -  tr(Λ^⊤μ_i^⊤Σ^-1μ_iΛ)  /2).\n\nFrom the property of the trace operator, and since Λ^⊤ = Λ^-1, we have that \n\n    tr(Λ^⊤μ_i^⊤Σ^-1μ_iΛ) = tr(μ_i^⊤Σ^-1μ_iΛΛ^⊤) = tr(μ_i^⊤Σ^-1μ_i),\n\nwhich shows that (<ref>) holds true for any i=1,…,n. For this reason, an identification constraint is needed to  prevent any arbitrary rotation and/or reflection of μ_i. This can be achieved by assuming that for one of the 𝐁_h, e.g., the first, we have that \n\n    [𝐁_h]_wl = 0,     l>w,      [𝐁_h]_ll≥ 0,     l = 1,…, p-1.\n\nEquation (<ref>) is also a version of the transformation proposed by <cit.> to identify and isolate the size-and-shape information of the mean configuration μ_i.\nThe constraints can be imposed in two different ways. The first one is by changing the prior distributions over the parameters that identify the constraints in (<ref>) accordingly. The other way is to let the Markov chain Monte Carlo (MCMC) algorithm explore freely the posterior and then remap  each 𝐁_h^b, where b indicates the b-th posterior samples, to an identified version 𝐁̃_h^b, via the map \n𝐁_h^b↦𝐁̃_h^b:=𝐁_h^bΛ^b,\nwhere Λ^b = g(𝐁_h^b) ∈SO(p) is an appropriate rotation matrix defined by a function g: ℝ^k× p→SO(p), such that  𝐁̃_h^b satisfies (<ref>). We prefer the latter since it allows us to define a more straightforward MCMC algorithm, as shown below. \n\n\n\n\n\n\n §.§ The Markov chain Monte Carlo algorithm\n\n\n\nTo implement the MCMC algorithm, we derive the full conditional distributions of β, Σ, 𝐑_1, 𝐑_2, …, 𝐑_n, i.e., the distribution of one parameter given all the others and the data. Owing to the model specification given in  (<ref>), we can easily see that the full conditional of β and Σ are the same that we would obtain in the case of a standard  Bayesian regression  (see, e.g. ), that is \n\n    β_l|β_-l,Σ, 𝐑_1, … , 𝐑_n ,𝐘_1, … ,   𝐘_n  ∼ N_kd(𝐌_l^*, 𝐕_l^*),\n\n\t\n    𝐌_l^*  =   𝐕_l^* ( ∑_i=1^n 𝐙_i^⊤Σ^-1𝐗_i,l  +  𝐕_l^-1𝐌_l ),   𝐕_l^*  = ( ∑_i=1^n 𝐙_i^⊤Σ^-1𝐙_i  + 𝐕_l^-1)^-1\n\nwhere β_-l denotes the vector β without the element β_l,\nand \n\n    Σ|β, 𝐑_1, … , 𝐑_n ,𝐘_1, … ,   𝐘_n   ∼ IW(ν^*, Ψ^*),\n\n\t\t\n    ν^*  =  ν + np,   Ψ^*  = Ψ + ∑_i=1^n ∑_l=1^p(𝐗_i,l-𝐙_iβ_l)(𝐗_i,l-𝐙_iβ_l)^⊤.\n\n\t\nFor the derivation of 𝐑_i's full conditional, we can resort to the computation reported in <cit.>, which show, in Theorem 1, that such distribution is Matrix Fisher  <cit.> with parameter 𝐀_i = μ_i^⊤Σ^-1𝐘_i,  and density \n\n    f(𝐑_i|β, Σ,𝐑_1, … , 𝐑_i-1, 𝐑_i+1, …, 𝐑_n ,𝐘_1, … ,   𝐘_n ) ∝exp(tr(𝐑_i𝐀_i^⊤)).\n\nSampling from a Matrix Fisher distribution is generally not easy and requires acceptance-rejection methods, as described in <cit.>.  Interestingly, the case p=2 can be easily handled by expressing the rotation matrix as a function of the rotation angle θ_i ∈ [0, 2π), which can be shown to be von-Mises distributed with parameters (η_i,κ_i ) that can be derived setting the equation 𝐑_i𝐀_i^⊤ = κ_i cos (θ_i - η_i). The case p=3 can be handled by expressing 𝐑_i with the Euler angles θ_1∈[0,2π), θ_2∈ [0,π), θ_3∈[0,2π) by means of a 3-dimensional rotation map, and using a Metropolis step. \n\nRemark that the full conditionals are easily obtained and in the setting that we propose, any identifiability issue is solved relatively straightforwardly. This is a clear advantage of the Bayesian approach, which allows much more numerically stable estimation procedures. \n\n\n\n§ SIMULATION EXPERIMENTS\n\nBy means of a simulation experiment, we test the algorithm  when p =2 and 3, with  k=3  and d=1, meaning that 𝐳_i=1, ∀ i=1,…,n and  μ_i = μ, with \nvec(μ)=(β_1^⊤,β_2^⊤)^⊤ if p=2 and\nvec(μ)=(β_1^⊤,β_2^⊤,β_3^⊤)^⊤ if p=3.\nHence, we are modeling the data assuming that the linear model includes only an intercept and μ can be seen as a mean configuration. \nWe set β_1 = (60,1,100)^⊤, β_2= (10,30,180)^⊤, β_3= (20,400,0.5)^⊤ and Σ=κ𝐈_k and, for each p, we generate  scenarios with all possible combination of κ=0.1,0.3 and sample sizes n=20,50,100,300. \n\nThe algorithm is implemented assuming 𝐌_l = 0_3d,  𝐕_l = 10^6𝐈_3d, ν = k+1 and  Ψ = I_k and estimated using   5000 iterations of which 2000 are kept for inferential purposes. The rotation matrices are simulated using a Metropolis step.\n\nTo evaluate the performance of the method, we report the size-and-shape Riemannian distances (see ) denoted by ρ_p between the true mean configuration μ and the estimated one, i.e., the posterior mean of μ.\n\nThe results are reported in Table <ref>, where we empirically verified the consistency of the model and, as expected, the error tends to increase as the variability of the data increases. Moreover, for all datasets, the true value of parameters for each element of β_l and Σ was included in the associated 95% credible interval.\n\n\n\n\n§ FURTHER DEVELOPMENTS\n\n\nIn this paper, we showed how a size-and-shape regression model is easily implemented in a Bayesian latent variable framework, we discussed the model's identifiability issues and how to solve them.\nThe present work opens new possibilities in modelling size-and-shape data, especially in the formalization of complex dependence structures, which are possible to handle under the Bayesian setting. Hence, we can  imagine dependence structures among landmarks and future developments will see us introducing lattice-type modelling approaches into this field, where landmarks will be treated as locations. In this way, their dependencies will be described using spatially structured covariance matrices. We will also try to account for temporal dependence between observations, allowing us to inspect and model the temporal evolution of shape <cit.>. To conclude, as the linearity assumption could be too restrictive, a more flexible functional relation between the covariates and mean configuration could be introduced in order to account for deviations from linearity. \nelsarticle-harv \n\n\n"}