{"entry_id": "http://arxiv.org/abs/2303.06655v1", "published": "20230312130907", "title": "Single-Particle Spectra in Relativistic Heavy-Ion Collisions Within the Thermal Quantum Field Theory", "authors": ["Dmitry Anchishkin"], "primary_category": "nucl-th", "categories": ["nucl-th", "hep-ph", "quant-ph"], "text": "\n\n\n\n\n\n Bogolyubov Institute for Theoretical Physics, 03143 Kyiv, Ukraine\n Taras Shevchenko National University of Kyiv, 03022 Kyiv, Ukraine\nFrankfurt Institute for Advanced Studies,\n\n60438 Frankfurt am Main, Germany\n\n\n 12.40.Ee, 12.40.-y\n\n\n\n\n\nA quantum generalization of the Cooper-Fry recipe is proposed. The\nsingle-particle spectrum arising from relativistic collisions of\nparticles and nuclei is calculated within the thermal quantum field\ntheory framework. The starting point of consideration is the\nsolution of the initial-value problem of particle emission from a\nspace-like hypersurface. In the following steps, we obtain the\nsingle-particle spectrum using the “smaller” Green's function\nassociated with the fireball medium. Based on this result, several\nspecific examples of particle emission are considered.\n\n\n\nSingle-Particle Spectra in Relativistic Heavy-Ion Collisions\nWithin the Thermal Quantum Field Theory\n    D. Anchishkin\n    \n====================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nModels and approaches that are used to describe the processes occurring\nin the reaction region during relativistic nucleus collisions are\ninvestigated by comparing the predictions made with experimental data\non one-, two-, and many-particle momentum spectra, which contain information\nabout the source at an early stage (photons, dileptons) and at the stage\nof the so-called freeze-out (hadron spectra).\nThe freeze-out hypersurface Σ is a kind of spatial surface moving in time,\nwhich is an imaginary boundary between two regions: there is strong dynamics\ninside the surface, and outside the surface, particles freely propagate outward.\n\nWave function at the freeze-out times can be considered as the initial one for its\nfurther history, and, since its further evolution is free, it can be easily\ntaken into account (we do not discuss final state interactions so far).\nIntuitively, free evolution can be reversed, making it possible that the cross\nsection and other measurable physical quantities are determined through the\ninitial values of the wave function,\ni.e. the values of the wave function at the times of freezing.\nRigorous evaluations give exactly this result.\nOn the other hand, the strong dynamics acting inside a freeze-out\nhyper-surface leads to the creation of a certain quantum state at freeze-out times.\nConsequently, the wave function at the freeze-out times is the final state of\nstrong dynamics.\nBy representing experimentally measured quantities with the\nhelp of these states, we can study strong interactions in dense and\nhot nuclear matter.\nBecause of this creativity, the separation of the scales of interaction in space\nand time, which is carried out using the freeze-out hypersurface, looks\nvery attractive.\n\n\nIn this article, we consider the emission of hadrons from a space-like\nhypersurface, which is related to the initial-value problem.\nThe particles are emitted by the donor system (fireball), which exhibits\nsharp kinetic freezing: space-like and time-like hypersurfaces separate the\nexcited (interacting) particle system from its noninteracting stage in the\nevolutionary process.\n\n\n\n\n\n§ NOTION OF FREEZE-OUT HYPERSURFACE\n\n\n\n\n\n\nAn important question that can be clarified by studying the reaction zone\nis how the space-time boundary of the fireball is\nrelated to the so-called sharp freeze-out hypersurface.\n(A discussion of various approaches to the design and use of freeze-out hypersurface\ncan be found in\n<cit.>.)\n\nUsually, the sharp freeze-out hypersurface is defined by the parameter\nP(t, r) taking the critical value P_ c on the hypersurface.\n\n\nThat is, the equation of the hypersurface has a form\n\n\n    P(t, r) =  P_ c .\n\n\nThe parameter to for defining the hypersurface can be selected as:\n\n\n1) The density of particles <cit.>:   n(t, r)  =  n_ c ;\n\n\n\n\n\n\n\n\n\n\n\n\n\n2) The energy density <cit.>:   ϵ(t, r)  = ϵ_ c ;\n\n\n\n\n\n\n\n\n\n\n\n\n3)  The temperature <cit.>:   T(t, r)  =  T_ c .\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt should be noted that any definition of sharp freeze-out is possible precisely\nwith the selected accuracy.\n\nLet us list the basic notions of the relativistic kinetic theory <cit.>.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInvariant particle number density:\n\n    \n    n(x) = N^μ (x)   u_μ (x)  ,\n\n\nwhere N^μ(x) = ∫ (d^3 p/p^0)  p^μ  f(x,p) =\n(n_ lab, n_ lab v__ E) is the particle four-flow\nwith f(x,p) as the distribution function,\nand\nu^μ(x) = N^μ/(N^ν N_ν)^1/2\n= (γ__ E, γ__ E v__ E)\nis the collective four-velocity (the Eckart definition).\n\nInvariant particle energy density:\n\n    \n    ϵ(x) = u_μ (x)  T^μν (x)  u_ν (x)  ,\n\n\nwhere T^μν(x) = ∫ (d^3 p/p^0) p^μ p^ν f(x,p) is the\nenergy-momentum tensor.\n\nWith the help of relativistic transport model, the last two equations\n(<ref>) and (<ref>) were used to determine the freeze-out\nhypersurface for pions <cit.>.\nIn Fig. <ref> these freeze-out hypersurfaces, together with the\ncorresponding projections on three planes, can be seen for different collision energies.\nThe critical value was taken as n_ c = 0.08 fm^-3 for the particle density\nand ε_ c = 0.035 GeV/fm^3 for the energy density.\nThe freeze-out hypersurfaces in the figures are represented in\nquasi-four-dimensional form, the compactification of spatial transverse coordinates\nis made in the form (x,y) → r = √(x^2+y^2).\nThen the coordinates of the four-dimensional surfaces are (t, r, z), note the\ncoordinate r is reflected symmetrically to negative values.\n\n\n\n\n\nFrom comparing each pair of plots for the same energy, we can see that\nthere is no difference in determining the freeze-out hypersurface based\non particle density or based on energy density.\n\n\n\n\nThis can be considered as a statement that for the pion particle density\n\nn = n_ c = 0.035 GeV/fm^3 or the pion energy density\nε = ε_ c = 0.035 GeV/fm^3\nthe behavior of a pion system is very close to an ideal gas\n(for details see <cit.>).\n\n\n\n\n\n\n\n\n§ RADIATION OF QUANTUM FIELDS FROM SPACE-LIKE HYPERSURFACE: THE CAUCHY PROBLEM\n\n\n\n\n\n\nThe space-like  hypersurface, together with the time-like hypersurface,\ndetermines the boundary\nof the four-dimensional volume occupied by a many-particle system.\nKinetic freeze-out that occurs from a space-like hypersurface (any tangent to\nthis surface lies outside the light cone) can be treated as an initial-value\nproblem for the radiation of particles from a fireball.\n\nIn the present approach,  we first use a simplified shape of the\nfreeze-out hypersurface.\nThe space-like part of the total hypersurface will simply be a surface\nof constant time t=t_0.\nIt should be noted that such a condition is a standard approach that is commonly\nused in mathematical physics.\nOn the other hand, we do not lose generality, because the results obtained for an\nequal-time hypersurface can be converted to results for a space-like hypersurface\nof a given shape, as we will show later.\nAn example of an equal-time hypersurface for a spherically symmetric expansion of\na fireball is shown in Fig. <ref>, on left panel.\nOne more way is shown, how a complete freeze-out hypersurface, which also includes a\ntime-like part, can be reduced to an equal-time space-like hypersurface\neven in the general case (see the right panel).\n\n\n\n\nSo, our goal is to solve the initial-value problem for the propagation of free\nparticles to the detector when they are “emitted from the space-like hypersurface”.\nIn fact, we would like to reproduce and generalize the Cooper-Frye formula\n<cit.> for the emission of particles from a finite\nspace-time volume.\n\n\nAfter freeze-out, the particles propagate without interaction (this is the\nfreeze-out condition).\nThis system of “traveling” free particles is described by the field operator\nφ̂ (x), which satisfies the Klein-Gordon equation\n\n\n    (∂_μ∂^μ  +  m^2)  φ̂ (x)  =  0  ,\n\n\nwhere ∂_μ∂^μ =∂_t^2-∇⃗^2.\nThe Cauchy problem or the initial conditions for this equation are specified\non a space-like hyper-surface.\nWithout loss of generality, for simplicity, this hypersurface has the form\nx^0 = t_0 = const (see Fig. <ref>)\n\n\n    φ̂ (x^0, x)|_x^0=t_0  = Φ̂_0( x)   ,      ∂φ̂(x^0, x)/∂ x^0|_x^0=t_0 \n    = Φ̂_1( x)  .\n\n\nAs it is shown in the textbook <cit.>, equation (<ref>) together\nwith the initial conditions (<ref>) can be written  as an\ninhomogeneous differential equation (for details see <cit.>)\n\n\n    (∂_μ∂^μ  +m^2)  φ̂(x) \n    = δ(x^0-t_0)Φ̂_1( x) \n     + δ'(x^0-t_0)Φ̂_0( x)  ,\n\n\nwhere using the δ'(t)  function is well known:\n∫ dt F(t)δ'(t)=-∫ dt dF(t)/dtδ(t).\nThis equation can be solved with the help of the retarded Green's\nfunction of the Klein-Gordon equation (see, for example, <cit.>\nor <cit.>)\n\n\n    (∂_μ∂^μ + m^2)G_R(x-y)  = δ ^4(x-y)  ,\n\n\nwhere\n\n\n    G_R(x-y)    =    -∫d^4k/(2π )^4  e^- ik· (x-y)/(k_0 + iδ)^2- k^2 - m^2\n       =    i θ( x^0-y^0 ) ∫d^3k/(2π )^3 2ω ( k) [    f_ k(x)  f^*_ k(y)- f^*_ k(x)  f_ k(y) ]\n\n\nwith f_ k(x)=e^- i ω ( k)x^0+i  k· x\nand ω( k) = √(m^2+ k^2).\nHence, for the field operator, φ̂(x), from (<ref>)\none obtains\n\n\n    φ̂(x)\n       =   ∫ d^4y   G_R(x-y) [ δ(y^0-t_0)Φ̂_1( y)\n     + δ'(y^0-t_0)Φ̂_0( y) ]\n    \n       =   ∫ d^4y  δ(y^0-t_0)  [ G_R(x-y)   ↔∂/∂ y^0Φ̂(y^0, y) ]  ,\n\n\nwhere we update notations of the initial conditions in the following\nway: Φ̂_0( y) = Φ̂(y^0, y)|_y^0=t_0\nand\nΦ̂_1( y) = ∂Φ̂(y^0, y)/∂ y^0\n|_y^0=t_0.\nIndeed, we associate the field Φ̂(y^0, y) with the\ninteracting system which exists before freeze-out, i.e. at the times\nwhich are less then that on the hyper-surface, which represents the\ninitial conditions.\nIn particular case of the flat hyper-surface, y^0 = t_0, the field\nΦ̂(y^0, y) exists at times y^0 < t_0.\nHence, this field and its derivatives determine the initial\nconditions for particles emitted from the freeze-out hyper-surface\nwhich we described by the field φ̂(x).\n\nWe note, for the arbitrary space-like hyper-surface, σ(y), solution\n(<ref>) looks like <cit.>\n\n\n    φ̂(x)  = ∫_σ dσ^μ(y) [ G_R(x-y) ↔∂/∂ y^μΦ̂(y) ] .\n\n\n\n\n\n\nOn the other hand, in the free space\nfor the system without interaction solution of the Klein-Gordon equation\n(<ref>) can be written as expansion over eigne functions of the operator of\nmomentum with the infinite boundary conditions, that coincides with expansion\nin the Fourier integral\n\n\n    φ̂ (x^0, x)    =   ∫d^3k/(2π)^3  2ω_k [b( k) \n    e^-iω_k t+i k· x \n    +  b^+( k)    e^iω_k t-i k· x]\n    \n       =   ∫d^4k/(2π)^4  2πδ( k^2-m^2)  e^-ik· x  b( k) ,\n\n\nwhere ω_k=√(m^2+ k^2),   b( k) and\nb^+( k) are the annihilation and creation operators which\nsatisfy the following commutation relation\n\n\n    [b( k), b^+( p)]  =  (2π)^3   2ω_k  δ^3( k- p) .\n\n\nFor the real field, which we consider, these operators should obey\nequality\n\n\n    b(- k) = b^+( k)    ⇒  φ̂^+ ( x) = φ̂ ( x)  .\n\n\nWe assume that the detector measures asymptotic momentum eigenstates,\ni.e. that it acts by projecting the emitted single-particle state onto\n\n\n    ϕ^ out_ k( x,t)  =  e^ -i ω_k t+i  k· x ≡  f_ k(x)  ,\n\n\nwhere ω_k=ω( k)=√(m^2+ k^2) is the energy of the\nparticle and we label out-state by the value of measured momentum, i.e. k.\nEvidently, these functions are the solutions of eq.(<ref>).\nSo, we defined the set of the basic functions (asymptotic states)\n\n\n    f_ k(x) ≡  e^- i k· x | _k^0=ω ( k)  ,\n\n\nwhich are orthogonal with respect to the scalar product\n\n\n    ∫ d^3x  f^*_ k(x)   i ↔∂_x^0  f_ p(x) \n    =  (2π )^3  2ω ( k) δ ^3( k- p) ,   ∫ d^3x  f_ k(x)  i ↔∂_x^0 f_ p(x) = 0 .\n\n\nIn fact, the expansion (<ref>) is made in terms of the asymptotic states (<ref>).\nThen, if the field operator, φ̂(x), is known the annihilation\nand creation operators can be evaluated\n\n\n    b( k)  = ∫ d^3x  f^*_ k(x)   i ↔∂_x^0φ̂(x) ,   \n    b^+( k)  =  - ∫ d^3x  f_ k(x)  i ↔∂_x^0φ̂^+(x)  .\n\n\n\nThe goal of our investigation is a calculation of the single- and\ntwo-particle spectra which can be written with the help of\nannihilation and creation operators in the following way\n(see, for instance, <cit.>)\n\n\n    P_1( p) = ⟨  b^+( p)  b( p)  ⟩  ,\n      \n    P_2( p_1, p_2) = ⟨ \n    b^+( p_1)  b^+( p_2)  b( p_2)  b( p_1)  ⟩ ,\n\n\nwhere averaging is taking with respect to the states of the donor\nsystem described by the field Φ̂(x).\nThat is why we are interesting in exact expressions of the creation\nb^+( k) and annihilation b( k) operators at asymptotic\ntimes, t →∞.\nInserting solution (<ref>) into (<ref>) one obtains\n\n\n    b( k)    =   lim_x^0 →∞ ∫ d^3x  d^4y δ(y^0-t_0) f^*_ k(x) \n    i ↔∂/∂ x^0[ G_R(x-y) ↔∂/∂ y^0Φ̂(y) ]\n    \n       =   ∫ d^4y δ(y^0-t_0)[ f^*_ k(y)\n    i ↔∂/∂ y^0Φ̂(y) ] ,\n\n\nand\n\n\n    b^+( k)    =   lim_x^0 →∞ - ∫ d^3x   d^4y  δ(y^0-t_0)  \n    f_ k(x) i ↔∂/∂ x^0[ G_R(x-y) ↔∂/∂ y^0Φ̂^+(y) ]\n    \n       =    -∫ d^4y  δ(y^0-t_0) [ f_ k(y)\n    i ↔∂/∂ y^0Φ̂^+(y) ],\n\n\nwhere we use representation of the Green's function (<ref>) and\nthe orthogonal relations (<ref>).\nIt is seen that the projection of the donor field Φ̂(y) is\ntaken at the times of the freeze-out and all evolution history of the\nfree propagation (after freeze-out) is ridded out.\n\nActually, integration over measure d^4y  δ(y^0-t_0) in\n(<ref>) and (<ref>) is nothing more as integration over\nthe flat space-like hyper-surface, y^0=t_0.\nFor the arbitrary space-like hyper-surface, σ(x), the\nannihilation and creation operators expressed through the field\noperator Φ̂(x) look like\n\n\n    b( k)  =  i ∫_σ dσ^μ(x) [ f^*_ k(x) ↔∂/∂ x^μ Φ̂(x) ]   ,\n       b^+( k)  =  - i ∫_σ dσ^μ(x)  [ f_ k(x) ↔∂/∂ x^μ Φ̂^+(x) ]  .\n\n\n\n\n\n\n\n\n§ SINGLE-PARTICLE SPECTRUM\n\n\n\nWith creation and annihilation operators in hand we come to the\nevaluation of the single-particle spectrum.\nWe write\n\n\n    2E_p d N/d^3p= ⟨  b^+( p)   b( p) ⟩  ,\n\n\nwhere E_p=ω_p=√(m^2+ p^2).\nNext, introducing here creation b^+( k) and annihilation b( k)\noperators from (<ref>) and (<ref>) one gets\n\n\n    2E_p d N/d^3p   =   ∫ d^4x_1  d^4x_2  δ(x_1^0-t_0)  δ(x_2^0-t_0)\n    ⟨[\n    f_ p(x_1) ↔∂/∂ x_1^0Φ̂^+ (x_1) ] [  f^*_ p(x_2)\n    ↔∂/∂ x_2^0Φ̂ (x_2) ] ⟩\n       =   ∫ d^4x_1  d^4x_2 δ(x_1^0-t_0) δ(x_2^0-t_0)\n    ⟨[\n    f_ p(x_1) ∂/∂ x_1^0Φ̂^+ (x_1)\n    - (∂/∂ x_1^0 f_ p(x_1)) Φ̂^+ (x_1)]\n    \n          ×[  \n        f^*_ p(x_2) ∂/∂ x_2^0 Φ̂ (x_2)\n    - ( ∂/∂ x_2^0  f^*_ p(x_2)) Φ̂ (x_2)\n    ] ⟩ .\n\n\nAll this can be written in a compact form\n\n\n    2E_p d N/d^3p = ∫ d^4x_1   d^4x_2  δ(x_1^0-t_0)  δ(x_2^0-t_0)  [   f_ p(x_1)   f^*_ p(x_2)  ↔∂/∂ x_1^0↔∂/∂ x_2^0⟨Φ̂^+ (x_1)   Φ̂ (x_2) ⟩]  .\n\n\n\nOne immediately recognize that angle brackets on the r.h.s. of this\nequation give us the correlation function or the lesser Green's function\n<cit.>\n\n\n    i  G^<(x_2,x_1)  = ± ⟨Φ̂^+(x_1) Φ̂(x_2)\n    ⟩ ,\n\n\nwhere the plus sign reads for bosons and the minus sign for fermions (see Appendix).\nAs an example, in what follows  we consider the Bose statistics.\n\n\nHence, for the single-particle spectrum, we obtain the following basic expression\n\n\n    2E_p d N/d^3p  =  i ∫ d^4x_1  d^4x_2 δ(x_1^0-t_0) δ(x_2^0-t_0) [   f_ p(x_1)   f^*_ p(x_2)  ↔∂/∂ x_1^0↔∂/∂ x_2^0  G^<(x_2,x_1) ]  .\n\n\nAs seen from (<ref>) in covariant form the single-particle spectrum looks like\n\n\n    2E_p d N/d^3p  =  i ∫ dσ^μ(x_1)  dσ^ν(x_2) [  f_ p(x_1)  f^*_ p(x_2) ↔∂/∂ x_1^μ↔∂/∂ x_2^ν  G^<(x_2,x_1) ]  .\n\n\nThe formula (<ref>) (and (<ref>)) forms the basis for further\napproximations that take into account the special properties of the system\nemitting particles.\n\n\n\n\n\n §.§ A note on the description of fermionic radiation\n\n\nLet us assume that polarization effects are not taken into account when\nregistering fermionic particles.\nIn this case, all polarized states are summed, and the description of the\nfree state of the propagating particle does not require the details of the\nfermionic spin state.\nTherefore, for such an experiment, it is quite satisfactory to describe\nfreely propagating fermions as solutions of the Klein-Gordon equation.\n\n\nIndeed, let us consider freeze-out of the fermionic system.\nAfter freeze-out the fermions are described by the field\noperator ψ̂(x), which satisfies the free Dirac equation\n\n\n    (iγ^μ∂_μ -  m)  ψ̂(x)  =  0  ,\n\n\nwhere ψ̂ is the four-spinor (four-component column vector), and the\nγ-matrices satisfy the anticommutation relations\n{γ^μ, γ^ν} = 2g^μν with g^μν as the\nmetric tensor, sign(g^μν) = (1,-1,-1,-1).\nIn eq. (<ref>) the “Dirac” operator can be acted on\nfrom the left by the adjoint operator (iγ^ν∂_ν + m).\nUsing the anticommutation relations of the γ-matrices, we obtain that\neach component of ψ̂(x) must satisfy the Klein-Gordon equation\n(<ref>), i.e., (∂_μ∂^μ + m^2)  ψ̂(x) = 0.\n\n\nSo, we can conclude that if the experimental registration of fermions does not\nfix the polarization of particles, then we can use the solutions of the\nKlein-Gordon equation to describe the free propagation of fermions and use\nthe quantum generalization of the kinetic approach proposed in the present paper\nto describe fermion radiation.\n\n\n\n\n\n\n\n\n\n §.§ Single-particle spectrum from homogeneous system\n\n\n\nFor a homogeneous system the correlation function can be expanded in the\nFourier integral only with respect to a difference of coordinates\n\n\n    G^<(x_2,x_1)  =  G^<(x_2-x_1)  = ∫d^4k/(2π)^4 \n    e^-ik· (x_2-x_1)   G^<(k^0, k)  .\n\n\n \n \nSubstituting then the Green's function in this form into (<ref>)\nwe obtain\n\n\n    2E_p d N/d^3p   =   ∫d^4k/(2π)^4  d^3x_1   d^3x_2  \n    iG^<(k^0, k)  e^i( p- k)· ( x_1- x_2) ×\n          × ∫ dx_1^0   dx_2^0  δ(x_1^0-t_0)  δ(x_2^0-t_0)  [  e^-ip^0 (x_1^0-x_2^0)  ↔∂/∂ x_1^0↔∂/∂ x_2^0 \n     e^ik^0 (x_1^0-x_2^0)] ,\n\n\nwhere p^0=ω_p.\nFor two arbitrary functions we have\n\n\n    f(t_1,t_2)   ↔∂/∂ t_1↔∂/∂ t_2  g(t_1,t_2)\n    =\n     f ↔∂_t_1∂ g/∂ t_2\n     -\n     ∂ f/∂ t_2 ↔∂_t_1 g\n    =\n     f ∂ ^2 g/∂ t_1  ∂ t_2\n     -\n     ∂ f/∂ t_1 ∂ g/∂ t_2\n     -\n     ∂ f/∂ t_2 ∂ g/∂ t_1\n     +\n     ∂ ^2 f/∂ t_1  ∂ t_2  g\n      .\n\n\nThen, expression in square brackets in the last line in (<ref>)\ncan be easily calculated and one can rewrite (<ref>) in the following way\n\n\n    2E_p d N/d^3p   =   ∫d^4k/(2π)^4 d^3x_1  d^3x_2 \n    iG^<(k^0, k)  e^i( p- k)· ( x_1- x_2)( p^0+k^0 )^2\n    \n          × ∫ dx_1^0  dx_2^0 δ(x_1^0-t_0) δ(x_2^0-t_0) \n    e^-i(p^0-k^0)(x_1^0-x_2^0) ,\n\n\nwhat finally gives\n\n\n    2E_p d N/d^3p  = ∫d^4k/(2π)^4  i G^<(k^0, k) ∫ d^3x_1  d^3x_2 \n    e^i( p- k)· ( x_1- x_2)( E_p + k^0 )^2  .\n\n\n\n\n\n\nExpansion (<ref>) assumes that the donor many-particle system is big enough\nto neglect the surface effects.\nOn the other hand, following the common point of view\n<cit.> we\nassume that the Green's function significantly different from zero only when the\ndifferences of arguments, x_1- x_2, are close to zero.\nHence, the integrations on the r.h.s. of (<ref>) with respect to\nthe spatial coordinates x= x_1- x_2 can be done with\ninfinite limits, then, it gives the δ-function:\n(2π)^3δ^3( p- k).\n\nThus, the single-particle spectrum in a homogeneous system in the rest\nframe of the fireball reads\n\n\n    2E_p d N/d^3p  =  V ∫dω/2π ( E_p + ω)^2  i G^<(ω, p)  ,\n\n\nwhere V =∫ d^3X with X=( x_1+ x_2 )/2 as the 3D-volume of\nthe element from which particles are emitted.\n\n\n\n\n\n\n\n\nTo represent the single-particle spectrum (<ref>) in covariant form,\n\ninsert (<ref>) into (<ref>) and get\n\n\n    2E_p d N/d^3p  = ∫d^4k/(2π)^4   iG^<(k)\n    ∫ dσ^μ(x_1)  dσ^ν(x_2) [  f_ p(x_1)  f^*_ p(x_2) ↔∂/∂ x_1^μ↔∂/∂ x_2^ν\n     e^-ik· (x_2-x_1) ]  .\n\n\nCalculating the derivatives on the right-hand side of this equation,\nwe find that the single-particle spectrum of particles emitted by a\nhomogeneous system in covariant form is written as\n\n\n    2E_p d N/d^3p=      ∫d^4k/(2π)^4  (p+k)_μ (p+k)_ν  iG^<(k)\n    ∫_σ dσ^μ(x_1)  dσ^ν(x_2)  e^-i(p-k)· (x_1-x_2) \n    \n    =      ∫d^4k/(2π)^4  iG^<(k)\n    | ∫_σ dσ^μ(x)    (p+k)_μ e^-i(p-k)· x |^2  ,\n\n\nwhere p^0 = E_p = √(m^2 +  p^2).\n\n\n\n\n\n\n §.§  Single-particle spectrum from homogeneous system in\nthermodynamic equilibrium \n\n\n\nIf the system possesses a global thermodynamic equilibrium, which is\nan attribute of the homogeneous system under consideration, the\ncorrelation function G^<(k) can be expressed (see\n<cit.>, in particular in\nRef. <cit.>, eq.(2.19)) with the help of the\nspectral function and the equilibrium distribution function\n\n\n\n    i  G^<(k)  = θ(k_0)  A(k)  f(k^0)  \n    - θ(-k_0)  A(k) f(-k^0)\n\n\nwith\n\n\n    f(k^0)  = 1/e^ (k^0-μ)/T + a ,\n\n\nwhere a = - 1 for the Bose statistics, a = 1 for the Fermi statistics and\na = 0 for the classical Boltzmann gas.\n\nTo be specific, we consider the Bose statistics below and therefore take\nthe Bose-Einstein distribution function, that is, a = - 1 in (<ref>).\n\n\nIf the emitted 3D-area is an element of the freeze-out hyper-surface,\none can assume an absence of interaction on this surface.\nFor the system of free particles which are in thermal equilibrium\n\n(ideal gas) the spectral function expresses\nthat all particles are on the mass shell.\n \nHence, the spectral function of the free fields can be found as\n<cit.>\n\n\n    A_0(k)  =  2π δ(k^2-m^2)  [ θ(k^0)-θ(-k^0) ]  ,\n\n\nand satisfies the sum-rule <cit.>\n\n\n    ∫dk^0/2π  k^0  A(k^0, k) = 1  .\n\n\nUsing (<ref>), we can write the representation of the Green's function\nG^<(k) given in eq. (<ref>) as follows\n\n\n    i G^<(k) =\n     π/ω_k δ(k_0-ω_k)  f__ BE (k^0)  \n    - π/ω_k δ(k_0+ω_k)  f__ BE (-k^0)  .\n\n\nFor the single-particle spectrum (<ref>) we need the Green's function,\nG^<(k^0, p), where the measured momentum p is put on place of\nthe momentum k\n(remind, that is due to an integration with infinite limits of the spatial\ncoordinates x= x_1- x_2 in (<ref>))\n\n\n    i G^<(ω, p) =\n     π/E_p δ(ω - E_p)  f__ BE(ω) \n    - π/E_p δ(ω + E_p)  f__ BE(-ω)  .\n\n\nInserting this in <ref>) one gets\n\n\n    2E_p d N/d^3p =  V ∫dω/2π ( E_p + ω)^2 π/E_p [ δ(ω - E_p)  f__ BE(ω)  \n    - δ(ω + E_p)  f__ BE(-ω) ]  .\n\n\nDue to the presence of the factor (E_p + ω_p)^2 under the integral in\n(<ref>), the second term in square brackets does not contribute at all,\nbecause  ω = - E_p due to the delta-function.\n\nThis means that antiparticles do not contribute to the particle spectrum.\nThen the single-particle spectrum in the fireball rest frame in the case of\nglobal thermodynamic equilibrium has the form\n\n\n    d N/d^3p =  V   f__ BE(E_p)  ,\n\n\nwhere V is the spatial volume of the system from which the particles are\nemitted, and the system of bosons is taken as an example.\n\n\n\n\n\n\n §.§ The local thermodynamic equilibrium\n\n\n\nWe can go further.\nIn general case the Fourier expansion of the Green's function looks like\n\n\n\n    G^<(x_2,x_1)  = ∫d^4k/(2π)^4  e^-ik· x   G^<(X;k)  ,\n\n\nwhere we have made the following transformation of coordinates:\nx = x_1 - x_2 and X = (x_1 + x_2)/2.\n\nInserting this representation of the Green's function into basic\neq. (<ref>) and then calculating the derivatives on the right-hand\nside of this equation, we obtain\n\n\n    2E_p d N/d^3p = i ∫d^4k/(2π)^4\n    d^4X d^4x δ(X^0-t_0) δ(x^0) e^-i(p-k) · x\n    \n    [( p^0+k^0 )^2 G^<(X;k)\n    + ∂^2 G^<(X;k)/4 ∂ X_0^2]  ,\n\n\nwhere p^0 = E_p = √(m^2 +  p^2) and we  used identity\n\n    dX^0  dx^0 δ(X^0+x^0/2-t_0) δ(X^0-x^0/2-t_0)  \n    =  dX^0   dx^0 δ(X^0-t_0) δ(x^0)  .\n\nIn fact, eq. (<ref>) is a generalization of equation\n(<ref>), which was derived for a completely homogeneous system.\n\n\nWe can write also a generalization of the formula (<ref>) for\nthe single-particle spectrum of particles emitted by the\nsystem from a space-like freeze-out hypersurface in covariant form\n\n\n    2E_p d N/d^3p=      \n    i ∫d^4k/(2π)^4 ∫_σ dσ^μ(x_1)  dσ^ν(x_2)  e^-i(p-k)· (x_1-x_2) \n          ×[(p+k)_μ (p+k)_ν  G^<(X;k)\n    + 1/4∂^2 G^<(X;k)/∂ X_μ∂ X^ν]   ,\n\n\nwhere p^0 = E_p and X = (x_1 + x_2)/2.\nHere we returned  to the variables of integration (x_1,x_2) and used the\ntransition d^4x_1 δ(x_1^0-t_0) p^0 = dσ^μ(x_1) p_μ\nand the same for the x_2  coordinate.\n\n\n\nIf the Green's function G^<(X;k) weakly depends on the\nsum of arguments, X, it can be represented in\nthe form <cit.>\n\n\n    i  G^<(X; k)  = θ(k_0)  A(X; k)  f(X;k)\n     - θ(-k_0)  A(X; k) [ f(X;-k) + 1 ]   ,\n\n\nwhere A(X;k) is the spectral function and f(X;k) is the\ndistribution function, which in the kinetic approach is defined as\n\n\n    θ(k_0)  A(X;k)  f(X;k)  = θ(k_0)  i  G^<(X;k)  .\n\n\nThe unit in the square brackets on the r.h.s. of (<ref>) is due\nto the tadpole contributions and can be rid out upon subtracting of\nthe vacuum values as in the case of the vacuum quantum field theory.\nHence, we will skip it in the future.\n\nTo take into account the local equilibrium of the radiating system, we use\neq. (<ref>) with several approximations.\nIndeed, in the kinetic approach, the second derivatives of the distribution\nfunction are usually neglected due to the weak dependence on the\ncoordinates X = (x_1 + x_2)/2.\nTherefore, we neglect the second derivative of the Green's function on the\nright-hand side of (<ref>) and write\n\n\n    2E_p d N/d^3p = i ∫d^4k/(2π)^4  d^4X  δ(X^0-t_0) \n    (2π)^3 Δ(p-k) ( E_p+k^0 )^2   G^<(X;k)  .\n\n\nHere\n\n\n    (2π)^3  Δ(p - k)  =  ∫ d^4x  δ(x^0)   e^-i(p-k) · x ,\n\n\nis a kind of form factor that reflects the finiteness of the spatial volume of\nthe system.\nAs was argued before, we assume that the correlation function G^<(X,x) significantly\ndifferent from zero only when the differences of arguments, x_1- x_2,\nare close to zero.\nTherefore, the integrations in (<ref>) can be done with infinite limits, then,\nΔ( p -  k) →δ^3( p- k).\n\n\nFurther, as before, we assume that on the  freeze-out hypersurface\nG^<(X;k) ≈ G_0^<(X;k).\nTaking into account (<ref>) and (<ref>) only for particles\n(as we have seen, antiparticles do not contribute) in a system with a slowly varying\ninhomogeneity, the Green's function has the form\n\n\n    i G^<_0(X;k^0, k)  = π/ω_k δ(k^0 - ω_k) \n    f__ BE(X;k^0)  ,\n         where    ω_k = √(m^2 +  k^2) .\n\n\nThen, by inserting (<ref>) into eq. (<ref>), one can obtain a\nformula for calculating the single-particle spectrum in the fireball rest frame\nwhen the radiating system has a weak inhomogeneity\n\n\n    2 E_p d N/d^3p   =   ∫d^4k/(2π)^4  d^4X  δ(X^0-t_0) \n    (2π)^3 δ^3( k -  p)\n    ( E_p + k^0 )^2  π/ω_k δ(k^0 - ω_k) \n    f__ BE(X;k^0)\n    \n       =   ∫ d^4X δ(X^0-t_0)  2 E_p  f__ BE(X;E_p) .\n\n\nObviously, the formula for spectrum (<ref>) in a homogeneous system\n(without dependence on X) reduces to (<ref>).\nThe right-hand side of eq. (<ref>) can be rewritten in covariant notations\n\n\n\n    d^4x δ(x^0-t_0) p^0  = (d^3x p^0 - dtdydz p^x - dtdxdz p^y - dtdxdy p^z)\n    |_t = t_0 =  const ,\n\n\nwhere we keep in mind that for the equal-time initial conditions it is valid\ndt = dX^0 = 0.\nSo we get\n\n\n    d^4X δ(X^0-t_0) p^0  =  dσ_μ(X) p^μ .\n\n\nBy inserting this into eq. (<ref>), we rewrite it in covariant\nnotations as\n\n\n    E_p d N/d^3p  = ∫ dσ_μ(X) p^μ  f__ BE(X;p· u) ,\n\n\nwhere the particles are on the mass shell p^0=E_p=√(m^2+ p^2),\nand u(X) is the four-velocity at the point X = (X^0,  X) given on a\nspace-like hypersurface, on which the initial conditions are now taken into account.\n(Remind, to be specific the boson system is considered.)\n\n\nSo, for the particle spectrum we obtain covariant expression (<ref>)\nwhich is valid in any frame.\nThis expression coincides with the Cooper-Frye formula\n<cit.>.\nTo obtain it we assume the following:\n\n\n(1) The many-particle system possess a weak spatially inhomogeneity and\na stationarity of the system is weakly broken.\nDue to that reason in the basic equation (<ref>)\n\nwe have neglected the second derivative of the Green's function\nG^<(X;x) with respect to the “center of mass” coordinate X = (x_1 + x_2)/2.\n\n\n\n(2) The many-particle system is at least in the local thermodynamic equilibrium\nwhat is reflected in the dependencies T(X), μ(X) and u(X).\n\n\n\n(3) To obtain eq. (<ref>) and then eq. (<ref>), we assumed\nthat the particles are free on the freeze-out hypersurface, which leads to\nthe approximation G^<(X;k) ≈ G_0^<(X;k).\n\n\n(4) We have assumed that the correlation function G^<(x_1,x_2) differs\nsignificantly from zero only if the differences of the arguments\nx_1- x_2 are close to zero.\nTherefore, integrations in (<ref>) can be performed with infinite limits.\n\nIn fact, this is not the case for a system close to a second-order phase\ntransition, when the correlation length becomes large enough.\n\n\nMeanwhile, the covariant formula that takes into account all quantum effects is\nstill (<ref>).\nEven if we take into account approximations (1), (2) and (3)\nand therefore use the Green's function in the form\n\n\n    i  G^<(X; k)  ≈  i G_0^<(X;k)  \n    = θ(k_0)   2π δ(k^2-m^2)  f(X;k)  ,\n\n\nwe come to\n\n\n    2E_p d N/d^3p=      ∫d^4k/(2π)^4 ∫_σ dσ^μ(x_1)  dσ^ν(x_2)  e^-i(p-k)· (x_1-x_2) \n          ×  (p+k)_μ (p+k)_ν θ(k_0)   2π δ(k^2-m^2)  f(X;k) .\n\n\nAfter some simplification, we obtain\n\n\n    2E_p d N/d^3p \n    = ∫d^3k/(2π)^3 2ω_k ∫_σ dσ^μ(x_1)  dσ^ν(x_2)  e^-i(p-k)· (x_1-x_2) \n    (p+k)_μ (p+k)_ν  f(X;k) ,\n\n\nwhere p^0 = √(m^2 +  p^2) and k^0 = ω_k = √(m^2 +  k^2).\nReduction of (<ref>) to the Cooper-Frye formula (<ref>) is\npossible if we can integrate with respect to x =  x_1 -  x_2 on\nthe right-hand side of eq. (<ref>).\nThis integration will immediately result in delta function\nδ^3( p -  k), which helps to convert the integrand to the same form\nas in eq. (<ref>).\nHowever, this cannot be done for an arbitrary freeze-out hypersurface.\nThus, we can argue that eq. (<ref>) is a generalization of the\nCooper-Frye formula (<ref>), which takes into account quantum effects.\nIndeed, one can rewrite eq. (<ref>) as\n\n\n    2E_p d N/d^3p \n    = ∫_σ dσ^μ(x_1)  dσ^ν(x_2)  J_μν(x_1 - x_2,  p) ,\n\n\nwere we define the tensor J_μν\n\n\n    J_μν(x_1 - x_2,  p)  =  e^-i p· (x_1-x_2)∫d^3k/(2π)^3 2ω_k \n    e^i k· (x_1-x_2) (p + k)_μ (p + k)_ν  f(X;k) .\n\n\nAs one can see, the integral in (<ref>) includes interference of\nwaves with different momenta k, which are projected onto the out-state\nwith momentum p.\nThere is no such interference in the Cooper-Frye formula (<ref>),\nwhere k =  p is taken.\n\n\n\n\n\n\n\n §.§ Single-particle spectrum from spatially inhomogeneous\nbut stationary system\n\n\n\n\n\nFor the spatially inhomogeneous, but stationary system, the lesser Green's function\ncan be represented as G^<(x_2,x_1) = G^<(x_2^0 - x_1^0; r_1, r_2).\nThen, after the Fourier transform with respect to the time variable\nx^0 = x_2^0 - x_1^0\n\n\n    G^<(x_2^0 - x_1^0; r_1, r_2)  = ∫dω/2π \n    e^- i ω (x_2^0 - x_1^0)  G^<(ω; r_1, r_2)  ,\n\n\nwe represent the Fourier transform of the Green's function in the form\n\n\n    iG^<(ω; r_1, r_2)  =  A(ω; r_1, r_2) f__ BE(ω)  ,\n\n\nwhere A(ω; r_1, r_2) is the following spectral function\n\n\n    A(ω; r_1, r_2)  = ∑_k φ_k( r_1) φ_k^*( r_2) π/ϵ_kδ(ω - ϵ_k)  .\n\n\nHere {φ_k( r)} is the orthogonal and complete set of functions\ndescribing the spatial distribution of particles in a fireball.\n\nLet us check the reduction to the homogeneous case.\nWhen particles on the freeze-out hypersurface are free, their wave\nfunctions will be plane waves\nφ_k( r) → (1/√(V))exp(i  k · r) and\nhence ϵ_k → E_k = √(m^2 +  k^2).\nBy inserting this into eq. (<ref>) one gets\n\n\n    A(ω; r_1, r_2)  = ∫d^3k/(2π)^3 \n    e^i  k · ( r_1 -  r_2) π/E_k δ(ω - E_k)  .\n\n\nMaking the Fourier transform with respect to the relative coordinate\nr =  r_1 -  r_2 we come to the spectral function\n\n\n    A(ω, p)  = ∫d^3k/(2π)^3  d^3 r  \n    e^-i ( p -  k) · r π/E_k δ(ω - E_k)\n    \n    \n    = π/E_p δ(ω - E_p)  .\n\n\nThat is, in the case of a homogeneous system in thermal equilibrium, we arrive\nat the same free spectral function as in (<ref>).\n\n\nTo calculate the spectrum of particles we use the basic eq. (<ref>), where\nwe introduced the Green's function in the form (<ref>)\n\n\nand using representation (<ref>) we obtain\n\n\n    2E_p d N/d^3p   =   ∫ d^4x_1   d^4x_2  δ(t_1-t_0)  δ(t_2-t_0)  ∫_-∞^∞ dω/2π A(ω; r_1, r_2)  f__\n    BE(ω) ×\n          × [   f_ p(t_1, r_1)   f^*_ p(t_2, r_2)  ↔∂/∂ t_1↔∂/∂ t_2 \n     e^-iω (t_2-t_1)]  .\n\n\n\nWe calculate two-side derivatives (remind,\nf_ p(x) = exp(- i E_p x^0 + i  p · x))\n\n\n    [   e^-iE_p (t_1-t_2) ↔∂/∂ t_1↔∂/∂ t_2 \n     e^-iω (t_2-t_1)] \n     =  (ω + E_p)^2  e^-i(E_p - ω) (t_1-t_2) .\n\n\n\nThen we put everything together and rewrite (<ref>) as\n\n\n    2E_p d N/d^3p = ∫_-∞^∞ dω/2π f__ BE(ω)  (ω + E_p)^2 ∫ d^3r_1   d^3r_2   e^i p · ( r_1- r_2)\n    A(ω; r_1, r_2)  .\n\n\nUsing the spectral function representation (<ref>), we can go further\n\n\n    2E_p d N/d^3p   =   ∫_-∞^∞ dω/2π \n    f__ BE(ω)  (ω + E_p)^2 ∑_k φ_k(\n    p) φ_k^*( p) π/ϵ_kδ(ω -ϵ_k)\n    \n       =   ∑_k | φ_k( p) |^2 1/2 ϵ_k \n    (ϵ_k + E_p)^2  f__ BE(ϵ_k) ,\n\n\nwhere\n\n\n    φ_k( p)  = ∫ d^3r  e^i p · r φ_k( r) .\n\n\nIf the quasi-momentum k is assumed to be continuous variable, then the\nsingle-particle spectrum has the form\n\n\n    2E_p d N/d^3p  =  V ∫d^3k/(2π)^3 | φ_k( p) |^2 1/2 ϵ_k \n    (ϵ_k + E_p)^2  f__ BE(ϵ_k) .\n\n\n\nFor example, for a system in a box V = L^3 with the Dirichlet\nboundary conditions, the functions φ_n( r) satisfy the\nstationary Klein-Gordon equation\n\n\n    ( ϵ_ n^2 - m^2 + ∇^2 ) φ_ n( r)   =  0  .\n\n\nThe solutions of this equation normalized to unity have the form\n\n\n    φ_ n( r)   = √(8/V) sin(k_x  x)  sin(k_y  y)  sin(k_z  z)  ,\n\n\nwhere n = (n_x,n_y,n_z) with n_i = 0, 1, 2, … and\nk = (π/L n_x, π/L n_y, π/L n_z).\nEach quantum state of the system, marked with the symbol n, has a self energy\nϵ_ n = √(m^2 + (π/L)^2  n^2).\nThen, using the set of wave functions φ_ n( r) and the set of\nself-energies ϵ_ n, one can calculate the spectrum\n(<ref>) or for large volume of the box can use eq. (<ref>).\n\nFor greater realism, one can consider a cylinder extended along the z axis,\nor a cylinder with an elliptical cross section to take into account the\nazimuthal dependence of particle radiation.\n\n\n\n\n\n\n\n §.§ Radiation of particles from a system with a finite lifetime\n\n\n\n\nTo reflect the finite lifetime of the system, we can use the parameterization\nof the spectral function in the spirit of the Bright-Wigner distribution\nfunction since each particle of the system is characterized by the smearing\nof its energy in the same way as resonances.\nIt can be done by smearing the delta function in eq. (<ref>)\n\n\n    δ(k_0^2-ω_k^2) →  A_γ(k)  = 1/π mγ/(k_0^2-ω_k^2)^2 + (mγ)^2 ,\n\n\nwhere γ=1/τ with τ as the lifetime of the donor\nmany-particle system.\nHere we use the limit equality\nδ(x) = lim_γ→ 01/πγ/x^2 + γ^2.\n \n \n \n \n \n \n\n\n\n\n\n\n\n\n \nThen the spectral function of free fields (<ref>) is transformed\ninto a new spectral function A(k), which reflects the finite life time τ\nof the system\n\n\n    A_0(k)  →  A(k)  =  2π   A_γ(k) [θ(k^0)  - θ(-k^0) ]  .\n\n\nLet us check the sum rule (<ref>) for the resulting parametrization\n(<ref>) of the spectral function\n\n\n    ∫_-∞^∞dk^0/2π  k^0  A(k^0, k)\n       =   ∫_0^∞dk^0/π k_0  mγ/(k_0^2-ω_k^2 )^2+(mγ)^2 \n    - ∫_-∞^0 dk^0/π k_0  mγ/(k_0^2-ω_k^2 )^2+(mγ)^2\n       =   \n    2∫_0^∞dk^0/π k_0  mγ/(k_0^2-ω_k^2 )^2+(mγ)^2\n       =   ∫_0^∞ds/π  mγ/(s-ω_k^2 )^2+(mγ)^2 \n    =  0.5 + 1/πarctan( m γ/ω_k^2)\n    ≈ 1  ,\n\n\n\n\n\nwhere the last approximation is valid if the inequality\n\n\n    mγ ≪ ω_k^2   ,    →  γ ≪  m+ k^2/m .\n\n\nSince the inverse lifetime of the system γ is an average\nvalue, i.e. we do not separate γ and ⟨γ⟩,\nthe inequality (<ref>) can be considered as averaged for a thermal\nmany-particle system at a temperature T:\n\n\n    ⟨γ⟩ ≪  m + 2⟨ k^2/2m⟩\n    = m+3T  ,\n\n\n\nwhere the last equality uses the nonrelativistic relation\n⟨ k^2/2m⟩=3/2 T.\nFor example, for the thermal system of pions m_π=140 MeV, which\nis created in collisions of relativistic nuclei, the freeze-out temperature\nT≃ 150 MeV is known.\n\nTherefore, we can make the following estimate of the allowable width γ:\n1/τ = γ ≪  590 MeV.\nWith good accuracy (∫dk^0/2π k^0 A(k) ≈ 0.95),\nthe lower limit of the lifetime can be taken equal to\nτ_c≃ 2 fm/c (γ_c≃ 100 MeV).\nThen for the total lifetime of the multipion system τ greater than τ_c the\nspectral function (<ref>) satisfies the sum rule (<ref>).\n\n\n\nFollowing the spirit of the Breit-Wigner distribution function, we only\nuse it for positive energies.\nWith this in mind, we write the Green's function\n\n\n\n    i G^<(k_0, k)  =  2πθ(k_0)    A_γ(k_0, k)  f__ BE(k_0) .\n\n\nThen the single-particle spectrum (<ref>) can be expressed as\n(note, we introduce into (<ref>) the Green's function in the form\nG^<(k_0, p))\n\n\n    2E_p  d N/d^3p =  V ∫_0^∞ dk^0 ( E_p+k_0 )^2 \n    A_γ(k_0, p)  f__ BE(k_0)  .\n\n\nAnd, finally, we get the spectrum of particles emitted from the system with\na finite lifetime, τ = 1/γ,\n\n\n    2E_p  d N/d^3p \n    =  V ∫_0^∞dk^0/π ( E_p+k_0 )^2  mγ/(k_0^2-E_p^2)^2+(mγ )^2  f__ BE(k^0) .\n\n\n\n\nLet us check the convergence to the previous result.\nWhen γ→ 0, the integrand in (<ref>) is converted as\n\n\n    2E_p  d N/d^3p   =    V ∫_0^∞ dk^0  ( E_p+k_0 )^2 δ(k_0^2-E_p^2)  f__ BE(k_0)  .\n\n\nThat leads to\n\n\n    d N/d^3p =  V   f__ BE(E_p) .\n\n\nThis formula coincides with (<ref>), which gives the single-particle\nspectrum in the fireball rest frame in the case of global thermodynamic\nequilibrium.\n\n\n\n\n\n\n\n§ APPLICATIONS\n\n\n\n\nThe goal of this section is to compare on the basis of the specific\nexamples, the Cooper-Frye formula (<ref>) and a quantum\ngeneralization of the kinetic approach given in eq. (<ref>).\n\n\n\n\n\n\n §.§ Constant time hypersurface: Rapidity distribution\n\n\n\nIn case, of the constant-time space-like hypersurface, i.e., x_0 =\nt_0 = const on the hypersurface, we have dσ^μ(x) = d^4x\nδ(x_0 - t_0).\nTo make the comparison as transparent as possible, we consider the pion\nsystem in the global thermodynamic equilibrium.\nIn this case formula (<ref>) looks like\n\n\n    2E_p d N/d^3p   =   ∫d^3k/(2π)^3 2ω_k \n    f__ BE(ω_k)\n     | ∫_σ dσ^μ(x)  (p+k)_μ  e^-i(p-k)· x |^2\n     \n    \n    \n    \n       =   ∫d^3k/(2π)^3 2ω_k  f__ BE(ω_k) \n    (E_p + ω_k)^2\n     | ∫ d^2x_T   e^i( p_T -  k_T)· x_T ∫_0^L_z dz  e^i(p_z - k_z)z |^2   ,\n\n\nwhere p^0 = E_p =√(m^2 +  p^2) and k^0 = ω_k =\n√(m^2 +  k^2).\nOur goal is to calculate rapidity\ndistribution, then let us assume that in the transverse direction, a\n2D volume is big enough that the integration over the transverse\nspatial coordinates in (<ref>) leads to the\ndelta-function. In detail, it looks like\n\n\n    |∫ d^2x_T   e^i( p_T -  k_T)· x_T |^2   =  (2π)^2 δ^2( p_T -  k_T) ∫_(S_T)\n    d^2x_T  e^i( p_T -  k_T)· x_T   =  S_T  \n    (2π)^2 δ^2( p_T -  k_T)   ,\n\n\nwhere S_T is the square of the transverse cross section. After\ninserting the obtained δ-function into\neq. (<ref>) we get k_T = p_T and consequently\nm_T(k_T) = m_T(p_T).\nIntegration over z-direction over the\nlongitudinal size of the system L_z gives a one-dimensional form\nfactor\n\n\n    ∫_0^L_z dz  e^i(p_z - k_z)z   = e^i (p_z -\n    k_z)L_z - 1/i(p_z - k_z)  =  e^i(p_z - k_z)L_z/22sin[ (p_z - k_z)L_z/2]/i(p_z - k_z) .\n\n\nIn fact, this is a particular example of the relativistic form\nfactor introduced in eq. (<ref>).\n\n\n\n\n\n\nWe are going to consider the rapidity distributions and transverse\nmomentum spectra.\nThat is why it is reasonable to make\ntransform of the momentum coordinates: (p_x,p_y,p_z) → (φ,\np_T, y), where φ is the azimuthal angle, p_T = √(p_x^2\n+ p_y^2) is the transverse momentum and tanhy = p_z/E_p is the\nrapidity.\nFor the differential, we get d^3p = 2π E_p p_T dp_T\ndy, where we integrate over the azimuthal angle assuming the\nazimuthal symmetry.\nThen, inserting (<ref>) and\n(<ref>) into eq. (<ref>) for dependence of the\nspectrum on variables (p_T,y) we get\n\n\n    d N/2π  p_T dp_T dy =  S_T ∫dy_k/2π \n    f__ BE(m_T(p_T) coshy_k) \n    (coshy + coshy_k)^2   F_L(y_k;y,p_T)  ,\n\n\nwhere\n\n\n    F_L(y_k;y,p_T)  = [ sin[ L_z m_T(p_T) (sinhy\n    - sinhy_k)/2]/(sinhy - sinhy_k)]^2  ,\n\n\nis the longitudinal form factor and tanhy_k = k_z/ω_k is\nthe rapidity of particle with the momentum k.\nTo derive eq. (<ref>) we have used that m_T(k_T) = m_T(p_T),\nwhat results in k_z =  m_T(p_T) sinhy_k, and then dk_z =\nm_T(p_T) coshy_k  dy_k.\n\n\nOn the other hand, the Cooper-Frye spectrum in the fireball rest\nframe in the case of global thermodynamic equilibrium has the form\n(<ref>).\nIn the Cooper-Frye approach, the rapidity distribution\nfor the fixed transverse momentum looks like\n\n\n    d N/2π p_T dp_T dy =  S_T   L_z  m_T(p_T) coshy \n    f__ BE(m_T(p_T) coshy)  .\n\n\n\nHere, we have factorized the volume of the system V into the\ntransverse cross section S_T and the longitudinal size of the\nsystem L_z that is V = S_T L_z.\nTo compare the spectrum (<ref>) with the spectrum\n(<ref>) we set S_T = 1.\nAt the same time, to keep right dimensionality in the\nadopted system of units (c = ħ = 1) we take the numerical\nvalue of L_z as: N[L_z] fm → (N[L_z]/C_c) MeV^-1, where\nC_c = 197.3 (remind, C_c·MeV·fm = 1).\n\n\nThe calculated rapidity distributions are depicted in\nFig. <ref> in three panel in a correspondence with\nthree values of the fixed transverse momentum of the π-meson,\np_T = 100,  400,  800 MeV/c, respectively, and for a given\nlongitudinal size of the system L_z = 10 fm.\nParameters of the Bose-Einstein distribution function are\nT = 160 MeV, μ = 0.\nBlack solid curves, which are marked as QG, reflect calculations\nwith the help of eq. (<ref>), i.e., it is a quantum\ngeneralization of the kinetic approach.\nRed dashed curves, which are marked as CF, reflect calculations with\nthe help of eq. (<ref>).\n\nIt is seen that the difference between the two distributions goes up\nwith an increase in the transverse momentum.\n\n\n\n\n\n\n\n §.§ Radiation of particles from a system with a finite lifetime\n\n\n\n\nWe have calculated the spectrum of pions (<ref>), as a\ndependence on the | p| = p, using a representation of the\nelement of the momentum space in the form d^3p = sinθ\ndθ dφ p^2 dp.\nTo get the dependence of the spectrum only\non a modulus of the particle momentum p, we assume the isotropic\nsymmetry of the pion radiation and integrate over the angles. Then,\nformula (<ref>) can be written as\n\n\n    d N/4π p^2dp =  V ∫_0^∞dk^0/π ( E_p+k_0 )^2/2E_p  mγ/(k_0^2-E_p^2)^2+(mγ )^2  f__ BE(k^0) .\n\n\nOur goal is to compare this spectrum with the Cooper-Frye formula\n(<ref>), which for the isotropic symmetry of radiation looks\nlike\n\n\n    d N/4π p^2 dp =  V   f__ BE(E_p)  ,\n\n\nwhere E_p = √(m^2 + p^2).\nIn both formulae, we take the unit volume of the pion system, V = 1.\nTo show the quantum generalization we have calculated three patterns\nof the life time τ = 1/γ of the pion system, i.e.,\nγ = 50,  100,  150 MeV.\nThe spectra are plotted in Fig. <ref>, left panel.\nOne can see a significant difference in the dependencies\ngenerated by the two approaches.\nThe Cooper-Frye kinetic approach is\nrepresented as the Bose-Einstein distribution function f__\nBE, which on a logarithmic scale is just a straight line.\nMeanwhile, the quantum generalization of the kinetic approach, which\ntakes into account the finite lifetime of the radiating system\n(eq. (<ref>)), is represented by the curves, resembling power\ndependence, rather than an exponential one.\n\n\n\n\n\n\n\n\nOur following example implies a comparison of the pion transverse\nspectra at midrapidity in the case of the global thermodynamic\nequilibrium.\nTo calculate the spectrum based on the quantum\ngeneralization of the kinetic approach we use eq. (<ref>) and\nmake the transform of the momentum coordinates as in\nSection <ref>, (p_x,p_y,p_z) → (φ, p_T, y).\nFor these conditions the spectrum, which depends now on on the\ntransverse momentum p__T = | p__T|, looks like\n\n\n    d N/2π p_Tdp_T dy =  V ∫_0^∞dk^0/π ( m_T + k_0 )^2  mγ/(k_0^2-m_T^2)^2+(mγ )^2  f__ BE(k^0) ,\n\n\nwhere m_T = √(m^2_π + p_T^2) and y = 0.\nFor the sake of simplicity, we consider the many-particle system as a gas at\nrest (no hydrodynamical flows).\nFor instance, it is the pion system at\nmidrapidity in the laboratory frame created in the central Pb+Pb\ncollision in the collider experiment.\nThese calculations aim to\ncompare, on the most transparent basis, the spectrum of pions\nemitted by a system with a finite lifetime τ = 1/γ with\nthe Cooper-Frye formula, which at midrapidity y = 0 looks like\n\n\n    d N/2π p_T dp_T =  V   m_T(p_T)   f__\n    BE(m_T(p_T))  .\n\n\nIn both approaches, we assume the azimuthal symmetry. The spectra\nare plotted in Fig. <ref>, right panel. A straight\nblack line marked as “CF” was obtained in the Cooper-Frye\napproach.\nThree upper curves, which represent the quantum\ngeneralization approach, are marked by the digits 1,2,3 following\na value of the parameter γ = 5,  10,  50 MeV, respectively.\nBoth spectra are normalized to unity at p_T = 0.\nAgain, we can see a significant difference in the behavior of curves,\nwhich correspond to different approaches.\nThe Cooper-Frye kinetic approach leads to a straight line\n(on a logarithmic scale).\nMeanwhile, the quantum generalization of the kinetic approach, which takes\ninto account the finite lifetime of the radiating system (eq. (<ref>)),\nis represented by the curves, resembling power dependence at big p_T,\nrather than an exponential one.\n\nIt is interesting to compare our results with pion spectrum versus\ntransverse momentum at midrapidity in the transverse momentum range\n0.6 GeV/c < p_T < 12 GeV/c measured in Pb-Pb collisions at\n√(s_NN) = 2.76 TeV <cit.>.\nWe will see that\ndependencies obtained in the quantum generalization approach, which\naccounts for the finite lifetime of the system, and which are\ndepicted in Fig. <ref> on the right panel, have the\nsame tendencies as the experimental results, or can even fit the\ndata at big p_T.\nAt the same time, our calculations within the approach developed in\nSection <ref> show that the same behavior has the\nspectra of particles radiating from a spatially inhomogeneous system,\nfor example from a finite-size system.\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\n\n\n\nIn this work, we investigate the propagation of particles (quantum fields)\nfrom the fireball to the detector by solving the corresponding initial-value problem.\nWith the help of the “thermal” Green's function, which describes a system of\nmany particles created in collisions of relativistic nuclei and determines\nthe initial values, we are able to express the detected single-particle spectrum.\n\nFor the single-particle spectrum we obtain formula (<ref>), which coincide\nwith the Cooper-Frye prescription\n\n<cit.> (as an example we follow the Bose-Einstein statistics)\n\n\n    E_p d N/d^3p  = ∫ dσ_μ(X) p^μ  f__ BE(X;p· u) .\n\n\nWe obtained formula (<ref>) in the framework of the following  assumptions:\n(1) The many-particle system has a weak inhomogeneity;\n(2) The many-particle system is in local thermodynamic equilibrium;\n(3) Particles are in free states on the freeze-out hypersurface;\n(4) The correlation function G^<(x_1,x_2) differs\nsignificantly from zero only if the differences of the arguments\nx_1- x_2 are close to zero.\n\n\nThe latter assumption (4) cannot be applied if the system is close to a second-order\nphase transition, when the correlation length becomes sufficiently large.\nAt the same time, as we discussed in the Section <ref>,\nthis approximation excludes quantum effects.\nBased on the same assumptions (1) - (3), taking into account, in addition to\nkinetic contributions, also quantum effects, we obtain the formula (<ref>)\nfor the single-particle spectrum\n\n\n    2E_p d N/d^3p \n    = ∫d^3k/(2π)^3 2ω_k ∫_σ dσ^μ(x_1)  dσ^ν(x_2)  e^-i(p-k)· (x_1-x_2) \n    (p+k)_μ (p+k)_ν  f(X;k) ,\n\n\nwhere p^0 = E_p = √(m^2 +  p^2), k^0 = ω_k = √(m^2 +  k^2) and\nf(X;k) is the distribution function.\nIn the case of global equilibrium, this equation  reduces to\n\n\n    2 E_p d N/d^3p  = ∫d^3k/(2π)^3 2ω_k  f(k)  | ∫_σ dσ^μ(x)    (p+k)_μ e^-i(p-k)· x |^2  .\n\n\nwhere p^0 = E_p and k^0 = ω_k.\n\nWhen stationary many-particle system is in spatially inhomogeneous state,\nas discussed in the Section <ref>, we obtain the formula\n(<ref>) to calculate the single-particle spectrum in this case.\nTo reflect finite lifetime of a spatially homogeneous system of many\nparticles, we propose to use a parametrization of the spectral function\nsimilar to the relativistic Breit-Wigner function.\nThe emission of particles from a system with finite lifetime was discussed\nin Section <ref>, where the formula (<ref>) was\nobtained for calculating the single-particle spectrum in this case.\n\n\nIn order to clarify the differences in the results of the Cooper-Frye\nkinetic approach and a proposed quantum generalization,\nSection <ref> presents single-particle spectra obtained\nfor several specific cases.\nThe rapidity distribution, momentum, and transverse momentum spectra at\nmidrapidity were calculated to compare the emitted spectra of pions on\nthe most transparent basis.\n\n\n\n\n\nIn conclusion, we note that the generalization of the Cooper-Frye formula\n(<ref>), obtained in this article, takes into account quantum\neffects arising for various reasons.\n\n\n\nFirst, there is a complete quantum treatment of the emission process that\nincludes quantum interference, as in the formula (<ref>).\nSecond, the radiation from a spatially inhomogeneous system, as in the formula\n(<ref>), which, for example, is applied to a system with\na finite spatial volume.\nAnd, of course, taking into account the finite lifetime of a system of\nmany particles was obtained in the formula (<ref>).\n\n\nIn the next article, the author plans to consider the two-particle spectra\narising from relativistic collisions of particles and nuclei.\nMeanwhile, the reader can gain basic knowledge in this area\nfrom Refs. <cit.>.\nFor example, final-state interaction effects are very important when\nconsidering two-particle spectra (two-particle interferometry).\nAn introduction to this topic can be found at\nRefs. <cit.>.\n\n\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\nThe author is grateful to I. Mishustin, L. Csernai, L. Satarov, H. Stoecker for\nuseful discussions and comments.\nThe author also thanks the referees for their valuable comments and suggestions\nfor improving the manuscript.\nThe work is supported by the National Academy of Sciences of Ukraine\nby its priority project \"Fundamental properties of matter in the microworld,\nastrophysics, and cosmology\".\n\n\n\n\n\n\n\n§ QUANTUM STATISTICS\n\n\n\n\n\n\n\nIn quantum statistics, the mean value of the operator Â is defined as:\n\n\n    ⟨ Â ⟩ \n    = 1/Z  Tr( ρ̂ Â) \n    = 1/Z ∑_n ⟨Ψ_n | ρ̂ Â |\n    Ψ_n ⟩ ,\n      \n    Z  = ∑_n ⟨Ψ_n | ρ̂ | Ψ_n ⟩ ,\n\n\nwhere {Ψ_n( r_1, r_2, … , r_N)} is the complete set of\nmany-particle wave functions and ρ̂ is the density matrix.\n\n\n\nFor the local thermal equilibrium the density matrix reduces to the diagonal form\n\n\n    ρ_nn'  = δ_nn' e^E_n/T .\n\n\nThen, the average of the product of two field operators in the grand canonical\nensemble reads\n\n\n    ⟨ ψ̂^+(t_2, r_2)  ψ̂(t_1, r_1) ⟩ \n    = 1/Z ∑_n ⟨Φ_n | e^-(H - μ N)/T ψ̂^+(t_2, r_2)  ψ̂(t_1, r_1) | Φ_n ⟩ .\n\n\nThe lesser Green's function is defined on the base of this averaging\n\n\n    iħ  G^<(x_1,x_2) \n    = ± ⟨ ψ̂^+(x_2)  ψ̂(x_1) ⟩ ,\n\n\nwhere x = (t,  r), the plus sign reads for bosons and the minus sign\nfor fermions.\n\nIn accordance with the quantum fluctuation-dissipation theorem for the system\nwhich in local (global) thermal equilibrium the lesser Green's function can be\nexpressed as <cit.>\n\n\n    iħ  G^<(ω, k)  =  A(ω, k) f(ω)  ,\n\n\nwhere G^<(ω, k) is the Fourier transform of the Green's function\nG^<(x_1-x_2), A(ω, k) is the spectral function, f(ω) is the\nBose-Einstein or Fermi-Dirac distribution function.\n\n\n\n\n40\n\n    huovinen-2008\n    \n    P. Huovinen,\n    Chemical freeze-out temperature in hydrodynamical description,\n    Eur. Phys. J. A 37, 121 (2008); [arXiv: 0710.4379 [nucl-th]].\n\n    adamova-2003\n    \n    D.Adamova (CERES Collaboration),\n    Universal Pion Freeze-out in Heavy-Ion Collisions,\n    Phys. Rev. Lett. 90, 022301 (2003); [arXiv: nucl-ex/0207008].\n\n    russkikh-ivanov-2006\n    \n    V.N. Russkikh and Y.B. Ivanov,\n    Dynamical Freeze-out in 3-Fluid Hydrodynamics,\n    Phys. Rev. C 76, 054907 (2007); [arXiv: nucl-th/0611094].\n\n    sollfrank-1999\n    \n    J. Sollfrank, P. Huovinen, and P.V. Ruuskanen,\n    Mass number scaling in ultrarelativistic nuclear collisions from a\n    hydrodynamical approach,\n    Eur. Phys. J. C 6, 525 (1999).\n\n    gersdorff-1986\n    \n    H. von Gersdorff, L. McLerran, M. Kataja, and P.V. Ruuskanen,\n    Studies of the Hydrodynamic Evolution of Matter Produced in Fluctuations\n    in anti-p p Collisions and in Ultrarelativistic Nuclear Collisions,\n    Phys. Rev. D 34, 794 (1986).\n\n    strickland-2015\n    M. Nopoush, M. Strickland, R. Ryblewski, D. Bazow, U. Heinz, and M. Martinez,\n    Leading-order anisotropic hydrodynamics for central collisions,\n    Phys. Rev. C 92, 044912 (2015); [arXiv:1506.05278 [nucl-th]].\n\n    strickland-2016\n    M. Alqahtani, M. Nopoush, and M. Strickland,\n    “Quasiparticle anisotropic hydrodynamics for central collisions”,\n    Phys. Rev. C 95, 034906 (2017); [arXiv:1605.02101 [nucl-th]].\n\n\n    groot-1980\n    S.R. de Groot, W.A. van Leeuwen, Ch.G. van Weert,\n    Relativistic Kinetic Theory,\n    Noth-Holland P.C., Amsterdam, 1980.\n\n    anchishkin-2013\n    D. Anchishkin, V. Vovchenko, and L.P. Csernai,\n    Pionic freeze-out hypersurfaces in relativistic nucleus-nucleus collisions,\n    Phys. Rev. C 87, 014906 (2013).\n\n    cooper-frye-PRD-v10-1974\n    F. Cooper and G. Frye,\n    Single-particle distribution in the hydrodynamic and statistical\n    thermodynamic models of multiparticle production,\n    Phys. Rev. D 10, 186 (1974).\n\n    \n    vladimirov\n    V.S. Vladimirov,\n    Equations of the Mathematical Physics,\n    \n    Moscow: Mir Publishers, p. 464, 1983.\n\n    anch2007\n    D. Anchishkin, U. Heinz,\n    Two-particle correlations in the wave function and covariant current approaches,\n    \n    Phys. Atom. Nucl. 71, 1632-1646  (2008);\n    [arXiv: 0712.1104 [hep-ph]].\n\n    schweber\n    Silvan S. Schweber,\n    An Introduction to Relativistic Quantum Field Theory,\n    Row, Peterson and Co., N.Y., 1961.\n\n    peskin\n    Michael E. Peskin, Daniel V. Schroeder,\n    An Introduction to Quantum Field Theory,\n    Addison-Wesley Co., 1995.\n\n    GKW\n    M. Gyulassy, S.K. Kauffmann and L.W. Wilson,\n    Pion Interferometry of Nuclear Collisions. 1. Theory,\n    Phys. Rev. C 20, 2267-2292 (1979).\n\n    boal\n    D.H. Boal, C.-K. Gelbke and B.K. Jennings,\n    Intensity interferometry in subatomic physics,\n    Rev. Mod. Phys. 62, 553-602 (1990).\n\n    heinz99\n    U. Heinz and B.V. Jacak,\n    Two-particle correlations in relativistic heavy-ion collisions,\n    [arXiv: nucl-th/9902020].\n\n    anch98\n    D. Anchishkin, U. Heinz, and P. Renk,\n    Final state interactions in two-particle interferometry,\n    Phys. Rev. C 57, 1428 (1998); [arXiv: nucl-th/9710051].\n\n    chapman94\n    S. Chapman, and U. Heinz,\n    HBT correlators: Current formalism versus Wigner function formulation,\n    Phys. Lett. B 340, 250 (1994).\n\n    pratt90\n    S. Pratt, T. Csörgö, and J. Zimányi,\n    Detailed predictions for two pion correlations in\n    ultrarelativistic heavy ion collisions,\n    Phys. Rev. C 42, 2646 (1990).\n\n    kadanoff\n    L.P.Kadanoff, G.Baym,\n    Quantum statistical mechanics,\n    W.A.Benjamin, Inc., N.Y. 1962.\n\n    chou1985\n    K. Chou, Z. Su, B. Hao, and L. Yu,\n    Equilibrium and Nonequilibrium Formalisms Made Unified,\n    Phys. Rep. 118, 1 (1985).\n\n    blaizot\n    J.-P. Blaizot,\n    Quantum fields at finite temperature and density,\n    Saclay preprint SPhT/91/188.\n\n    mrowczynski-1990\n    S. Mrówczyński, P. Danielewicz,\n    Green function approach to transport theory of scalar fields,\n    Nucl. Phys. B 342, 345-380 (1990).\n\n    mrowczynski-1998\n    Stanislaw Mrówczyński,\n    Topics in the Transport Theory of Quark-Gluon Plasma,\n    [arXiv: hep-ph/9805435].\n\nabelev-2014\nB. Abelev, J. Adam, D. Adamová et al. (The ALICE Collaboration),\nNeutral pion production at midrapidity in pp and Pb-Pb collisions\nat √(s_NN) = 2.76 TeV,\nEur. Phys. J. C 74, 3108 (2014); [arXiv: 1405.3794 [nucl-ex]].\n\n\nanch-heinz-2008\nD. Anchishkin, U. Heinz,\nTwo-particle correlations in the wave function and covariant\ncurrent approaches,\nPhys. Atom. Nucl. 71, 1632 (2008), [arXiv: 0712.1104 [hep-ph]].\n\n\nanch-anch-heinz-2006\nD. Anchishkin, Ye. Anchishkin, U. Heinz,\nFinal State Distortions in Two-Particle Correlations,\nProceedings of Science, CFRNC2006, 025 (2006), [arXiv: nucl-th/0611088].\n\nanch-1996\nD.V. Anchishkin, W.A. Zajc, G.M. Zinovjev,\nCoulomb corrections in two particle correlations for the processes\nof high multiplicity,\nUkr. J. Phys. 41, 363 (1996).\n\n\n\n\n\n"}