{"entry_id": "http://arxiv.org/abs/2303.06654v1", "published": "20230312130328", "title": "Twice Regularized Markov Decision Processes: The Equivalence between Robustness and Regularization", "authors": ["Esther Derman", "Yevgeniy Men", "Matthieu Geist", "Shie Mannor"], "primary_category": "cs.LG", "categories": ["cs.LG", "cs.AI"], "text": "\n\n\n\n\n\n\n\n\nTwice Regularized Markov Decision Processes: \n The Equivalence between\nRobustness and Regularization\n    Esther Derman \n\n        Technion \n\n        estherderman@campus.technion.ac.il \n        Yevgeniy Men  \n\n       Technion \n\n       yevgenimen@campus.technion.ac.il\n       Matthieu Geist \n\n       Google Research, Brain Team \n\n       mfgeist@google.com\n       Shie Mannor \n\n       Technion & Nvidia Research\n\n       shie@technion.ac.il\n       \n    \n======================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\nRobust Markov decision processes (MDPs) aim to handle changing or partially known system dynamics. To solve them, one typically resorts to robust optimization methods. However, this significantly increases computational complexity and limits scalability in both learning and planning. On the other hand, regularized MDPs show more stability in policy learning without impairing time complexity. Yet, they generally do not encompass uncertainty in the model dynamics.  In this work, we aim to learn robust MDPs using regularization. We first show that regularized MDPs are a particular instance of robust MDPs with uncertain reward. We thus establish that policy iteration on reward-robust MDPs can have the same time complexity as on regularized MDPs. We further extend this relationship to MDPs with uncertain transitions: this leads to a regularization term with an additional dependence on the value function. We then generalize regularized MDPs to twice regularized MDPs  (MDPs), MDPs with both value and policy regularization. The corresponding Bellman operators enable us to derive planning and learning schemes with convergence and generalization guarantees, thus reducing robustness to regularization. We numerically show this two-fold advantage on tabular and physical domains, highlighting the fact that preserves its efficacy in continuous environments.   \n\n\n\n  reinforcement learning, robust Markov decision processes, robust optimization, regularization, Fenchel-Rockafellar duality\n\n\n\n\n\n§ INTRODUCTION\n\n\n \nMDPs provide a practical framework for solving sequential decision problems under uncertainty <cit.>. However, the chosen strategy can be very sensitive to sampling errors or inaccurate model estimates. This can lead to complete failure in common situations where the model parameters vary adversarially or are simply unknown <cit.>. Robust MDPs aim to mitigate such sensitivity by assuming that the transition and/or reward function (P,r) varies arbitrarily inside a given uncertainty set  <cit.>. In this setting, an optimal solution maximizes a performance measure under the worst-case parameters. It can be thought of as a dynamic zero-sum game with an agent choosing the best action while Nature imposes it the most adversarial model. As such, solving robust MDPs involves max-min problems, which can be computationally challenging and limits scalability.\n\nIn recent years, several methods have been developed to alleviate the computational concerns raised by robust reinforcement learning (RL).   \nApart from <cit.> who consider specific types of coupled uncertainty sets, all rely on a rectangularity assumption without which the problem can be NP-hard <cit.>. This assumption is key to deriving tractable solvers of robust MDPs such as robust value iteration <cit.> or  more general robust modified policy iteration (MPI) <cit.>. Yet, reducing time complexity in robust Bellman updates remains challenging and is still researched today <cit.>.\n\n \nAt the same time, the empirical success of regularization in policy search methods has motivated a wide range of algorithms with diverse motivations such as improved exploration <cit.> or stability <cit.>. <cit.> proposed a unified view from which many existing algorithms can be derived. Their regularized MDP formalism opens the path to error propagation analysis in approximate MPI <cit.> and leads to the same bounds as for standard MDPs. Nevertheless, as we further show in Sec. <ref>, policy regularization accounts for reward uncertainty only: it does not encompass uncertainty in the model dynamics.\nDespite a vast literature on how regularized policy search works and convergence rates analysis <cit.>, little attention has been given to understanding why it can generate strategies that are robust to external perturbations <cit.>.\n\nTo our knowledge, the only works that relate robustness to regularization in RL are \n<cit.>. <cit.> employ a distributionally robust optimization approach to regularize an empirical value function. Unfortunately, computing this empirical value necessitates several policy evaluation procedures, which is quickly unpractical. <cit.> provide a dual relationship with robust MDPs under uncertain reward. Their duality result applies to general regularization methods and gives a robust interpretation of soft-actor-critic <cit.>. Although these two works justify the use of regularization for ensuring robustness, they do not enclose any algorithmic novelty. Similarly, <cit.> specifically focus on maximum entropy methods and relate them to either reward or transition robustness. We shall further detail on these most related studies in Sec. <ref>.\n\nThe robustness-regularization duality is well established in statistical learning theory <cit.>, as opposed to RL theory.\nIn fact, standard setups such as classification or regression may be considered as single-stage decision-making problems, one-step MDPs, a particular case of RL setting. Extending this robustness-regularization duality to RL would yield cheaper learning methods with robustness guarantees. As such, we introduce a regularization function Ω_ that depends on the uncertainty set  and is defined over both policy and value spaces, thus inducing a twice regularized Bellman operator (see Sec. <ref>). We show that this regularizer yields an equivalence of the form v_π,  = v_π, Ω_, where v_π, is the robust value function for policy π and v_π, Ω_ the regularized one. This equivalence is derived through the objective function each value optimizes. More concretely, we formulate the robust value function v_π, as an optimal solution of the robust optimization problem:    \n\n    max_v∈^v, μ_0 s. t.  v≤inf_(P,r)∈T_(P,r)^πv,\n        RO\n \nwhere T_(P,r)^π is the evaluation Bellman operator <cit.>. Then, we show that  v_π, is also an optimal solution of the convex (non-robust) optimization problem: \n\n    max_v∈^v, μ_0 s. t.  v≤ T_(P_0,r_0)^πv -Ω_(π, v),\n            CO\n\nwhere (P_0,r_0) is the nominal model. This establishes equivalence as the two problems admit the same optimum for any policy. \nMoreover, the inequality constraint of (<ref>) enables to derive a twice regularized () Bellman operator defined according to Ω_, a policy and value regularizer. For ball-constrained uncertainty sets, Ω_ has an explicit form and under mild conditions, the corresponding Bellman operators are contracting. The equivalence between the two problems (<ref>) and (<ref>) together with the contraction properties of Bellman operators enable to circumvent robust optimization problems at each Bellman update. As such, it alleviates robust planning and learning algorithms by reducing them to regularized ones, which are known to be as complex as classical methods. \n\nTo summarize, we make the following contributions: \n(i) We show that regularized MDPs are a specific instance of robust MDPs with uncertain reward. Besides formalizing a general connection between the two settings, our result enables to explicit the uncertainty sets induced by standard regularizers. (ii) We extend this duality to MDPs with uncertain transition and provide the first regularizer that recovers robust MDPs with s-rectangular balls and arbitrary norm. (iii) We introduce twice regularized MDPs (MDPs) that apply both policy and value regularization to retrieve robust MDPs. We establish contraction of the corresponding Bellman operators. This leads us to proposing an MPI algorithm with similar time complexity as vanilla MPI. (iv) We also introduce a model-free algorithm, q-learning, that solves MDPs, and for which we establish theoretical convergence. (v) With the aim of extending q-learning to large state-spaces, we provide an easy method for estimating the value regularization term when a tabular representation is no longer available. Experiments on tabular and continuous domains prove the efficiency of for both planning and learning, thus opening new perspectives towards practical and scalable robust RL.[This paper extends the conference article Twice regularized MDPs and the equivalence between robustness and regularization published in Advances in Neural Information Processing Systems 2021 by . This manuscript extends the theory by introducing q-learning and proving its convergence. We additionally scale this approach to deep RL by proposing our new algorithm, double DQN. Experiments on both tabular and physical domains evaluate the performance of learning, thus confirming our previous findings on planning.]\n\n\n\n§ PRELIMINARIES\n\n\n \nThis section describes the background material that we use throughout our work. Firstly, we introduce some notations. Secondly, we recall useful properties in convex analysis. Thirdly, we address classical discounted MDPs and their linear program (LP) formulation. Fourth, we briefly detail regularized MDPs and the associated operators and lastly, we focus on the robust MDP setting. \n\n\n\n §.§ Notations\n\n\n=-1\nWe designate the extended reals by := ∪{-∞, ∞}.\nGiven a finite set , the class of real-valued functions (resp. probability distributions) over  is denoted by ^ (resp. Δ_), while the constant function equal to 1 over  is denoted by 1_. Similarly, for any set 𝒳, Δ_^𝒳 denotes the class of functions defined over  and valued in Δ_. The inner product of two functions , ∈^ is defined as , := ∑_z∈(z)(z), which induces the ℓ_2-norm := √(,). The ℓ_2-norm coincides with its dual norm, = max_≤ 1,  =:_*.\nLet a function f: ^→. The Legendre-Fenchel transform (or convex conjugate) of f is \nf^*() := max_∈^{, - f()}. Given a set ℨ⊆^, \nthe characteristic function δ_ℨ: ^→ is  δ_ℨ() = 0 if ∈ℨ; +∞ otherwise. The Legendre-Fenchel transform of  δ_ℨ is the support function \nσ_ℨ() = max_∈ℨ, <cit.>. \n\n \n\n\n\n\nLet C⊂^ be a convex set and Ω:C→ a strongly convex function. \nThroughout this study, the function Ω plays the role of a policy and/or value regularization function.\nIts Legendre-Fenchel transform Ω^* satisfies several smoothness properties, hence its alternative name smoothed max operator <cit.>.\n\nOur work makes use of the following result <cit.>. \n\n\n\n\nGiven Ω:C→ strongly convex, the following properties hold:\n\n\n    \n  (i) \n    ∇Ω^* is Lipschitz and satisfies \n    ∇Ω^*() = _∈ C, - Ω(), ∀∈^.\n\n    \n  (ii) For any c∈, ∈^, Ω^*( + c1_) = Ω^*() +c.\n\n    \n  (iii) The Legendre-Fenchel transform Ω^* is non-decreasing. \n\n\n\n \n\n\n §.§ Discounted MDPs and LP formulation\n\n\n\tConsider an infinite horizon MDP (, ,  μ_0, γ, P, r) with  and   finite state and action spaces respectively, 0< μ_0 ∈Δ_ an initial state distribution and γ∈ (0,1) a discount factor. Denoting \n\t:= ×, \n\tP∈Δ_^ is a transition kernel \n\tmapping each state-action pair to a probability distribution over  and r∈^ is a reward function. \n    A policy π∈Δ_^ maps any state s∈ to an action distribution π_s∈Δ_, and we evaluate its performance through the following measure:\n\n    ρ(π) := 𝔼[∑_t = 0^∞γ^tr(s_t, a_t) | μ_0, π, P] = v_(P,r)^π, μ_0.\n\nHere, the expectation is conditioned on the process distribution determined by μ_0, π and P,\nand for all s∈, v_(P,r)^π(s) = 𝔼[∑_t = 0^∞γ^tr(s_t, a_t) | s_0=s, π, P] is the value function at state s.\nMaximizing (<ref>) defines the standard RL objective,\nwhich can be solved thanks to the Bellman operators:\n\n    T^π_(P,r)v    := r^π + γ P^πv   ∀ v∈ℝ^, π∈Δ_^,\n    \n        T_(P,r)v    := max_π∈Δ_^T^π_(P,r)v   ∀ v∈ℝ^,\n    𝒢_(P,r)(v)    := {π∈Δ_^: T^π_(P,r)v = T_(P,r)v}  ∀ v∈ℝ^,\n\nwhere r^π := [π_s, r(s,·)]_s∈ and P^π = [P^π(s'| s)]_s',s∈ with  P^π(s'| s) :=   π_s, P(s' | s,·).\nBoth T^π_(P,r) and T_(P,r) are γ-contractions with respect to (w.r.t.) the supremum norm, so each admits a unique fixed point v^π_(P,r) and v^*_(P,r), respectively. The set of greedy policies w.r.t. value v defines 𝒢_(P,r)(v), and any policy π∈𝒢_(P,r)(v^*_(P,r)) is optimal <cit.>. For all v∈^, the associated function q∈^ is given by q(s,a) = r(s,a) + γP(·|s,a),v  ∀ (s,a)∈. In particular, the fixed point v^π_(P,r) satisfies v^π_(P,r) = π_s, q^π_(P,r)(s,·) where q^π_(P,r) is its associated q-function.\n\nThe problem in (<ref>) can also be formulated as an LP. \nGiven a policy π∈Δ_^, we characterize its performance ρ(π) by the following v-LP <cit.>:\n\n    min_v∈^v, μ_0 subject to (s.t.)  v ≥ r^π + γ P^πv. P^π\n\nThis primal objective provides a policy view on the problem. Alternatively, one may take a state visitation perspective by studying the dual objective instead:\n\n    max_μ∈^r^π,μ s. t. μ≥ 0  and  (𝐈𝐝_^ - γ P_*^π)μ = μ_0, D^π\n\nwhere P_*^π is the adjoint policy transition operator[It is the adjoint operator of P^π in the sense that  P^πv, v' = v, P_*^πv'  ∀ v, v'∈^.]:\n[P_*^πμ](s):= ∑_s̅∈P^π(s|s̅)μ(s̅)   ∀μ∈^,\nand 𝐈𝐝_ is the identity function in ^.\n\nLet 𝐈(s'| s,a) := δ_s'=s  ∀ (s,a,s')∈× the trivial transition matrix and\ndefine its adjoint transition operator as 𝐈_*μ(s) := ∑_(s̅, a̅)∈𝐈(s| s̅, a̅)μ(s̅, a̅)  ∀ s∈.\nThe correspondence between occupancy measures and policies lies in the one-to-one mapping\nμ↦μ(·, ·)/𝐈_*μ(·)=:π_μ\nand its inverse π↦μ_π given by\n\n    μ_π(s,a):= ∑_t = 0^∞γ^tℙ(s_t=s, a_t = a |μ_0, π, P)  ∀ (s,a)∈.\n\nAs such, one can interchangeably work with the primal LP (<ref>) or the dual (<ref>). \n\n\n\n §.§ Regularized MDPs\n\n\nA regularized MDP is a tuple (, ,  μ_0, γ, P, r, Ω) with (, ,  μ_0, γ, P, r) an infinite horizon MDP as above, and Ω:= (Ω_s)_s∈ a finite set of functions such that for all s∈, Ω_s: Δ_→ is strongly convex. Each function Ω_s plays the role of a policy regularizer Ω_s(π_s). With a slight abuse of notation, we shall denote by Ω(π):= (Ω_s(π_s))_s∈ the family of state-dependent regularizers.[In the formalism of <cit.>, Ω_s is initially constant over . However, later in the paper <cit.>, it changes according to policy iterates. Here, we alternatively define a family Ω of state-dependent regularizers, which accounts for state-dependent uncertainty sets (see Sec. <ref> below).] The regularized Bellman evaluation operator is given by \n\n    [T^π, Ω_(P,r)v](s) := T^π_(P,r)v(s) - Ω_s(π_s)   ∀ v∈^, s∈,\n\nand the regularized Bellman optimality operator by T^*,Ω_(P,r)v:= max_π∈Δ_^T^π, Ω_(P,r)v  ∀ v∈^ <cit.>. The unique fixed point of T^π, Ω_(P,r) (respectively T^*,Ω_(P,r)) is denoted by v^π, Ω_(P,r) (resp. v^*,Ω_(P,r)) and defines the regularized value function (resp. regularized optimal value function). \nAlthough the regularized MDP formalism stems from the aforementioned Bellman operators in <cit.>, it turns out that regularized MDPs are MDPs with modified reward. Indeed, for any policy π∈Δ_^, the regularized value function is v^π, Ω_(P,r) = (𝐈_ - γ P^π)^-1(r^π - Ω(π)), which corresponds to a non-regularized value with expected reward r̃^π:= r^π - Ω(π). Note that the modified reward r̃^π(s) is no longer linear in π_s because of Ω_s being strongly convex. Also, this modification does not apply to the reward function r but only to its expectation r^π, as we cannot regularize the original reward without making it policy-independent. \n\n\n\n §.§ Robust MDPs\n\n\nIn general, the MDP model is not explicitly known but rather estimated from sampled trajectories. As this may result in over-sensitive outcome <cit.>, robust MDPs reduce such performance variation. Formally, a robust MDP (, ,  μ_0, γ, ) is an MDP with uncertain model belonging to :=×, uncertain transition P∈⊆Δ_^ and\n reward r∈⊆^ <cit.>.\nThe uncertainty set  typically controls the confidence level of a model estimate, which in turn determines the agent's level of robustness.\nIt is given to the agent, who seeks to maximize performance under the worst-case model (P,r)∈. Although intractable in general, this problem can be solved in polynomial time for rectangular uncertainty sets, when = ×_s∈_s = ×_s∈(_s×_s) <cit.>. For any policy π∈Δ_^\nand state s∈, the robust value function at s is v^π, (s) := min_(P,r)∈  v_(P,r)^π(s)\nand the robust optimal value function v^*, (s):= max_π∈Δ_^v^π, (s). \nEach of them is the unique fixed point of the respective robust Bellman operators:\n\n    [T^π, v](s)    := min_(P, r)∈ T_(P,r)^πv(s)   ∀ v∈^, s∈, π∈Δ_^,\n    \n    [T^*, v](s)    := max_π∈Δ_^[T^π, v](s)   ∀  v∈^, s∈,\n\nwhich are γ-contractions. For all v∈^, the associated robust q-function is given by \nq(s,a) = min_(P, r)∈{r(s,a) + γP(·|s,a),v}  ∀ (s,a)∈, so that v^π,  = π_s, q^π,(s,·) where q^π, is the robust q-function associated to v^π,.\n\n \n\n\n§ REWARD-ROBUST MDPS\n\n\n \nThis section focuses on reward-robust MDPs, robust MDPs with uncertain reward but known transition model. We first show that regularized MDPs represent a particular instance of reward-robust MDPs, as both solve the same optimization problem. This equivalence provides a theoretical motivation for the heuristic success of policy regularization. Then, we explicit the uncertainty set underlying some standard regularization functions, thus suggesting an interpretable explanation of their empirical robustness. \n\nWe first show the following proposition <ref>, which applies to general robust MDPs and random policies. It slightly extends <cit.>, as Lemma 3.2 there focuses on uncertain-transition MDPs and deterministic policies. For completeness, we provide a proof of Prop. <ref> in Appx. <ref>.\n\n\n\nFor any policy π∈Δ_^, the robust value function v^π, is the optimal solution of the robust optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v≤ T_(P,r)^πv  for all    (P,r)∈. P_\n\n\n\nIn the robust optimization problem (<ref>), the inequality constraint must hold over the whole uncertainty set . As such, a function v∈^ is said to be robust feasible for (<ref>) if v≤ T_(P,r)^πv for all (P,r)∈ or equivalently, if max_(P,r)∈{v(s)  - T_(P,r)^πv(s) }≤ 0 for all s∈. Therefore, checking robust feasibility requires to solve a maximization problem. For properly structured uncertainty sets, a closed form solution can be derived, as we shall see in the sequel. \nAs standard in the robust RL literature <cit.>, the remaining of this work focuses on uncertainty sets centered around a known nominal model. \nFormally, given P_0 (resp. r_0) a nominal\ntransition kernel (resp. reward function), we consider uncertainty sets of the form\n(P_0 + )× ( r_0+ ). The size of × quantifies our level of uncertainty or alternatively, the desired degree of robustness. \n\n\n\n §.§ Reward-robust and regularized MDPs: an equivalence\n\n\n\nWe now focus on reward-robust MDPs, robust MDPs with = {P_0}×  (r_0+ ). Thm. <ref> establishes that reward-robust MDPs are in fact regularized MDPs whose regularizer is given by a support function. Its proof can be found in Appx. <ref>. This result brings two take-home messages: (i) policy regularization is equivalent to reward uncertainty; (ii) policy iteration on reward-robust MDPs has the same convergence rate as regularized MDPs, which in turn is the same as standard MDPs <cit.>.  \n\n\n\nAssume that = {P_0}×  (r_0+ ). Then, for any policy π∈Δ_^, the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - σ__s(-π_s)  for all  s∈,\n\nwhere σ__s is the support function of the reward uncertainty set (see definition in Sec. <ref>).\n\n\nThm. <ref> clearly highlights a convex regularizer Ω_s(π_s):= σ__s(-π_s)  ∀ s∈. We thus recover a regularized MDP by setting \n[T^π,Ωv](s) = T_(P_0,r_0)^πv(s) - σ__s(-π_s)  ∀ s∈. In particular, when _s is a ball of radius α_s^r, the support function (or regularizer) can be written in closed form as Ω_s(π_s):= α_s^rπ_s, which is strongly convex. We formalize this below (see proof in Appx. <ref>). \n\n\n\nLet π∈Δ_^ and = {P_0}×  (r_0+ ). Further assume that for all s∈, the reward uncertainty set at s is _s:= {r_s∈^: r_s≤α_s^r}. Then,  the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - α_s^rπ_s for all  s∈.\n\n\n\nWhile regularization induces reward-robustness,\nThm. <ref> and Cor. <ref> suggest that, on the other hand, specific reward-robust MDPs recover well-known policy regularization methods. In the following section, we explicit the reward-uncertainty sets underlying some of these regularizers. \n\n\n\n\n §.§ Related Algorithms\n\n\n \nConsider a reward uncertainty set of the form := ×_(s,a)∈_s,a. This defines an (s,a)-rectangular  (a particular type of s-rectangular ) whose rectangles _s,a are independently defined for each state-action pair. For the regularizers below, we derive appropriate _s,a-s that recover the same regularized value function. Detailed proofs are in Appx. <ref>. There, we also include a summary table that reviews the properties of some RL regularizers, as well as our function which we shall introduce later in Sec. <ref>. Note that the reward uncertainty sets here depend on the policy. This is due to the fact that standard regularizers are defined over the policy space and not at each state-action pair. It similarly explains why the reward modification induced by regularization does not apply to the original reward function, as already mentioned in Sec. <ref>.\n\nNegative Shannon entropy:\nLet _s,a^NS(π):= [ln(1/π_s(a)), +∞)  ∀ (s,a)∈.\nThe associated support function enables to write:\n\n    σ__s^NS(π)(-π_s) \n         = max_r(s,·):  r(s,a')∈_s,a'^NS(π), a'∈∑_a∈ -r(s,a)π_s(a) \n        =  ∑_a∈π_s(a)ln(π_s(a)),\n\nwhere the last equality comes from maximizing -r(s,a) over [ln(1/π_s(a)), +∞) for each a∈. \nWe thus recover the negative Shannon entropy Ω(π_s)= ∑_a∈π_s(a)ln(π_s(a)) <cit.>.\n\nKullback-Leibler divergence: Given an action distribution 0<d∈Δ_, let  _s,a^KL(π):= ln(d(a)) + _s,a^NS(π)  ∀ (s,a)∈. It amounts to translating the interval\n_s,a^NS by the given constant. Writing the support function yields Ω(π_s)= ∑_a∈π_s(a)ln(π_s(a)/d(a)), which is exactly the KL divergence <cit.>.\n\nNegative Tsallis entropy: Letting _s,a^T(π):= [(1-π_s(a))/2, +∞)  ∀ (s,a)∈, we recognize the negative Tsallis entropy Ω(π_s) = 1/2(π_s^2-1) <cit.>.\n\nThe worst-case rewards derived for the KL divergence and the Tsallis entropy are consistent with those obtained by <cit.>. Indeed, in both cases, taking the finite endpoint of the interval recovers the same worst-case reward. Yet, the dual view adopted there yields larger reward uncertainty, which may yield more conservative solutions when using approximate solvers. \n\n\n\n §.§ Policy-gradient for reward-robust MDPs\n\n\nThe equivalence between reward-robust and regularized MDPs leads us to wonder whether we can employ policy-gradient  <cit.> on reward-robust MDPs using regularization. The following result establishes that a policy-gradient theorem can indeed be established for reward-robust MDPs (see proof in Appx. <ref>). \n\n\n\nAssume that = {P_0}×  (r_0+ ) with _s= {r_s∈^: r_s≤α_s^r}. Then, the gradient of the reward-robust objective J_(π):= v^π, , μ_0 is given by\n\n    ∇ J_(π) = 𝔼_(s,a)∼μ_π[ ∇lnπ_s(a)(q^π, (s,a) - α_s^rπ_s(a)/π_s)],\n\nwhere μ_π is the occupancy measure under the nominal model P_0 and policy π. \n\n\nAlthough Prop. <ref> is an application of <cit.> for a specific regularized MDP, its reward-robust formulation is novel and suggests another simplification of robust methods. Indeed, previous works that exploit policy-gradient on robust MDPs involve the occupancy measure of the worst-case model <cit.>, whereas our result sticks to the nominal. In practice, Prop. <ref> enables to learn a robust policy by sampling transitions from the nominal model instead of all uncertain models. This has a twofold advantage: (i) it avoids an additional computation of the minimum as done in <cit.>, where the authors sample next-state transitions and rewards based on all parameters from the uncertainty set, then update a policy based on the worst outcome; (ii) it releases from restricting to finite uncertainty sets. In fact, our regularizer accounts for robustness regardless of the sampling procedure, whereas the parallel simulations of <cit.> require the uncertainty set to be finite. Technical difficulties are yet to be addressed for generalizing our result to transition-uncertain MDPs, because of the interdependence between the regularizer and the value function (see Secs. <ref>-<ref>). We detail more on this issue in Appx. <ref>. Recently, <cit.> established a robust policy gradient for transition-uncertain MDPs, but their setting focuses on a fixed mixture between the nominal kernel and an arbitrary transition matrix, = ((1-R)P_0 + RΔ_^ )×{r_0}. By design, this yields an (s,a)-rectangular uncertainty set included in an ℓ_∞-ball of size R around the nominal, whereas our setup considers more general s-rectangular uncertainty. \n\n\n\n§ GENERAL ROBUST MDPS\n\n\n \n\nNow that we have established policy regularization as a reward-robust problem, we would like to study the opposite question: can any robust MDP with both uncertain reward and transition be solved using regularization instead of robust optimization? If so, is the regularization function easy to determine? In this section, we answer positively to both questions for properly defined robust MDPs. This  greatly facilitates robust RL, as it avoids the increased complexity of robust planning algorithms  while still reaching robust performance.  \n\nThe following theorem establishes that similarly to reward-robust MDPs, robust MDPs can be formulated through regularization (see proof in Appx. <ref>). Although the regularizer is also a support function in that case, it depends on both the policy and the value objective, which may further explain the difficulty of dealing with robust MDPs. \n\n\n\nAssume that =   (P_0+ )×(r_0+ ). Then, for any policy π∈Δ_^, the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s)  -σ__s(-π_s) -σ__s(-γ v·π_s)  for all  s∈,\n\nwhere [v·π_s](s',a):=v(s')π_s(a)  ∀ (s',a)∈.\n\n\n \nThe upper-bound in the inequality constraint (<ref>) is of the same spirit as the regularized Bellman operator: the first term is a standard, non-regularized Bellman operator on the nominal model (P_0, r_0) to which we subtract a policy and value-dependent function playing the role of regularization. \nThis function reminds that of <cit.> also coming from conjugacy. This is the only similarity between both regularizers: in <cit.>, the Legendre-Fenchel transform is applied on a different type of function and results in a regularization term that has no closed form but can only be bounded from above. Moreover, the setup considered there is different since it studies distributionally robust MDPs. As such, it involves general convex optimization, whereas we focus on the robust formulation of an LP. \n\nThe support function further simplifies when the uncertainty set is a ball, as shown below. Yet, the dependence of the regularizer on the value function prevents us from readily applying the regularized MDP tool-set. We shall study the properties of this new regularization function in Sec. <ref>. \n\n\n\nAssume that =   (P_0+ )×(r_0+ ) with _s:= {P_s∈^: P_s≤α_s^P} and _s:= {r_s∈^: r_s≤α_s^r} for all s∈. Then, the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) -α_s^rπ_s - α_s^Pγvπ_s for all  s∈.\n\n\n\nWe restrict our statement to the ℓ_2-norm for notation convenience only, the dual norm of ℓ_2 being ℓ_2 itself. In fact, one can consider two different norms for reward and transition uncertainties. Thus, Cor. <ref> can be rewritten with an arbitrary norm, which would reveal a dual norm ·_* instead of · in Eq. (<ref>) (see proof in Appx. <ref>). As a result, our regularization function recovers a robust value function independently of the chosen norm, which extends previous results from <cit.>. Indeed, <cit.> reduce the complexity of robust planning under the ℓ_1-norm only, while <cit.> focus on KL and ℓ_2 ball-constrained uncertainty sets. Both works rely on the specific structure induced by the divergence they consider to derive more efficient robust Bellman updates. Differently, our method circumvents these updates using a generic, problem-independent regularization function while still encompassing s-rectangular uncertainty sets as in <cit.>.     \n\n \n\n\n§ MDPS\n\n\n \nIn Sec. <ref>, we showed that for general robust MDPs, the optimization constraint involves a regularization term that depends on the value function itself. This adds a difficulty to the reward-robust case where the regularization only depends on the policy. Yet, we provided an explicit regularizer for general robust MDPs that are ball-constrained. In this section, we introduce MDPs, an extension of regularized MDPs that combines policy and value regularization. The core idea is to further regularize the Bellman operators with a value-dependent term that recovers the support functions we derived from the robust optimization problems of Secs. <ref>-<ref>. \n\n \n\nFor all v∈^, define Ω_v, : Δ_→ as \nΩ_v, (π_s):= π_s (α_s^r + α_s^P γv). The Bellman evaluation and optimality operators are defined as \n\n    [T^π,v](s)    := T_(P_0,r_0)^πv(s)-Ω_v, (π_s)    ∀ s∈,\n        \n    \n        [T^*, v](s)    := max_π∈Δ_^ [T^π,v](s)= Ω_v, ^*(q_s)   ∀ s∈.\n\nFor any function v∈^, the associated unique greedy policy is defined as \n\n    π_s =  _π_s∈Δ_ T^π,v(s)= ∇Ω_v, ^*(q_s),   ∀ s∈,\n\nthat is, in vector form, π = ∇Ω_v, ^*(q) =: 𝒢_Ω_(v)  T^π,v = T^*, v. \n\n\nThe Bellman evaluation operator is not linear because of the functional norm appearing in the regularization function. Yet, under the following assumption, it is contracting and we can apply Banach's fixed point theorem to define the value function. \n \n[Bounded radius]\n\nFor all s∈, there exists ϵ_s > 0 such that \n    α_s^P≤min( 1-γ-ϵ_s/γ√(); min_𝐮_∈^_+, 𝐮_=1\n    𝐯_∈^_+, 𝐯_=1𝐮_^⊤ P_0(·| s,·)𝐯_).\n \n\n\n\n\nAsm. <ref> requires to upper bound the ball radius of transition uncertainty sets. The first term in the minimum is needed for establishing contraction of Bellman operators (item (iii) in Prop. <ref>), while the second one is used for ensuring monotonicity (item (i) in Prop. <ref>). We remark that the former depends on the original discount factor γ: radius α_s^P must be smaller as γ tends to 1 but can arbitrarily grow as γ decreases to 0, without altering contraction. Indeed, larger γ implies longer time horizon and higher stochasticity, which explains why we need tighter level of uncertainty then. Otherwise, value and policy regularization seem unable to handle the mixed effects of parametric and stochastic uncertainties. The additional dependence on the state-space size comes from the ℓ_2-norm chosen for the ball constraints. In fact, for any ℓ_p-norm of dual ℓ_q, ^1/q replaces √() in the denominator, so the bound becomes independent of  as (p,q) tends to (1,∞) (see Appx. <ref>). Although we recognize a generalized Rayleigh quotient-type problem in the second minimum <cit.>, its interpretation in our context remains unclear. Asm. <ref> enables the Bellman operators to admit a unique fixed point, among other nice properties. We formalize this below (see proof in Appx. <ref>).\n\n\n\nSuppose that Asm. <ref> holds. Then, the following properties hold:\n\n\n    \n  (i) Monotonicity: For all v_1, v_2∈^ such that v_1≤ v_2, we have T^π,v_1 ≤ T^π,v_2 and \n\n    T^*, v_1 ≤ T^*, v_2.  \n\n    \n  (ii) Sub-distributivity: For all v_1∈^, c∈, we have T^π,(v_1 + c1_)≤ T^π,v_1 + γ c1_ and T^*, (v_1 + c1_)≤ T^*, v_1 + γ c1_, ∀ c∈. \n\n    \n  (iii) Contraction: Let ϵ_*:= min_s∈ϵ_s>0. Then, for all v_1, v_2∈^, we have\n\n    T^π,v_1 -  T^π,v_2_∞≤ (1-ϵ_*)v_1-v_2_∞ and\n    T^*, v_1 -  T^*, v_2_∞≤ (1-ϵ_*)v_1-v_2_∞.\n\n\n\nWe emphasize that the contracting coefficient 1-ϵ^* from Prop. <ref> is different from the original discount factor γ. Yet, as Asm. <ref> suggests it, an intrinsic dependence between γ and \nϵ^* makes the Bellman updates similar to the standard ones: when γ tends to 0, the value of ϵ^* required for Asm. <ref> to hold increases, which makes the contracting coefficient 1-ϵ^* tend to 0 as well, the two contracting coefficients behave similarly. \nThe contracting feature of both Bellman operators finally leads us to introduce value functions.\n\n\n\n\n    \n  (i) The value function v^π, is defined as the unique fixed point of the Bellman evaluation operator: v^π,  = T^π,v^π,. The associated q-function is q^π,(s,a) = r_0(s,a) + γ P_0(·|s,a), v^π,.\n    \n  (ii) The optimal value function v^*, is defined as the unique fixed point of the Bellman optimal operator: v^*,  = T^*,v^*,. The associated q-function is q^*,(s,a) = r_0(s,a) + γ P_0(·|s,a), v^*,.\n\n\n\n\n\nThe monotonicity of Bellman operators plays a key role in reaching an optimal policy, as we show in the following. A proof can be found in Appx. <ref>.\n\n\n\nThe greedy policy π^*,  = 𝒢_Ω_(v^*, ) is the unique optimal policy, for all π∈Δ_^, v^π^*,  = v^*, ≥ v^π,. \n\n\n  \n\n\nAn optimal policy may be stochastic. This is due to the fact that our MDP framework builds upon the general s-rectangularity assumption. Robust MDPs with s-rectangular uncertainty sets may similarly yield an optimal robust policy that is stochastic <cit.>. Nonetheless, the MDP formulation recovers a deterministic optimal policy in the more specific (s,a)-rectangular case, which is in accordance with the robust MDP setting (see proof in Appx. <ref>). [The stochasticity of an optimal entropy-regularized policy as in the examples of Sec. <ref> is not contradicting. Indeed, even though the corresponding uncertainty set is (s,a)-rectangular there, it is policy-dependent. ]\n\n\n\n\n§ PLANNING IN MDPS\n\n\n\n §.§ Modified Policy Iteration\n\n \nR0.33\n\n\n\n \n\n\n\n\nAll of the results above ensure convergence of MPI in MDPs. We call that method MPI and provide its pseudo-code in Alg. <ref>. The convergence proof follows the same lines as in <cit.>. Moreover, the contracting property of the Bellman operator ensures the same convergence rate as in standard and robust MDPs, a geometric convergence rate. On the other hand, MPI reduces the computational complexity of robust MPI by avoiding to solve a max-min problem at each iteration, as this can take polynomial time for general convex programs. Advantageously, the only optimization involved in MPI lies in the greedy step: it amounts to projecting onto the simplex, which can efficiently be performed in linear time <cit.>. Still, such projection is not even necessary in the (s,a)-rectangular case: as mentioned in Rmk. <ref>, it then suffices to choose a greedy action in order to eventually achieve an optimal value function. \n \n\n\n §.§ Planning on a Maze\n\n\n \nWe aim to compare the computing time of MPI with that of MPI <cit.> and robust MPI <cit.>. The code is available at <https://github.com/EstherDerman/r2mdp>. To do so, we run experiments on an Intel(R) Core(TM) i7-1068NG7 CPU @ 2.30GHz machine, which we test on a 5×5 grid-world domain. In that environment, the agent starts from a random position and seeks to reach a goal state in order to maximize reward. Thus, the reward function is zero in all states but two: one provides a reward of 1 while the other gives 10.  An episode ends when either one of those two states is attained.  \n\nThe partial evaluation of each policy iterate is a building block of MPI. As a sanity check, we evaluate the uniform policy through both and robust policy evaluation (PE) sub-processes, to ensure that the two value outputs coincide.\nFor simplicity, we focus on an (s,a)-rectangular uncertainty set and take the same ball radius α^r (resp. α^P) at each state-action pair for the reward function (resp. transition function). Parameter values and other implementation details are deferred to Appx. <ref>. We obtain the same value for PE and robust PE, which numerically confirms Thm. <ref>. On the other hand, both are strictly smaller than their non-robust, non-regularized counterpart, but as expected, they converge to the standard value function when all ball radii tend to 0 (see Appx. <ref>). More importantly, PE converges in 0.02 seconds, whereas robust PE takes 54.8 seconds to converge, 2740 times longer. This complexity gap comes from the minimization problems being solved at each iteration of robust PE, something that PE avoids thanks to regularization. PE still takes 2.5 times longer than its standard, non-regularized counterpart, because of the additional computation of regularization terms. Table <ref> shows the time spent by each algorithm until convergence. \n \nWe then study the overall MPI process for each approach. We know that in vanilla MPI, the greedy step is achieved by simply searching over deterministic policies <cit.>. Since we focus our experiments on an (s,a)-rectangular uncertainty set, the same applies to robust MPI <cit.> and to MPI, as already mentioned in Rmk. <ref>. We can see in Table <ref> that the increased complexity of robust MPI is even more prominent than its PE thread, as robust MPI takes 3953 (resp. 3270) times longer than MPI when m=1 (resp. m=4). Robust MPI with m=4 is a bit more advantageous than m=1, as it needs less iterations (31 versus 67), less optimization solvers to converge. Interestingly, for both m∈{1,4}, progressing from PE to MPI did not cost much more computing time to either the vanilla or the version: both take less than one second to run.   \n\n\n\n\n\n§ LEARNING IN MDPS\n\n\nIn general, we do not know the nominal model (P_0,r_0) and can only interact with the underlying system. Therefore, in this section, we are interested in devising a model-free method that (i) achieves a robust optimal policy (ii) has low time complexity. We show that when the uncertainty set is (s,a)-rectangular, an q-learning scheme provably converges to the optimal robust q-value. In the remaining part of this work, we thus assume that = ×_(s,a)∈_s,a so there exists a deterministic policy which is optimal. We first formalize q-learning and its convergence guarantees in Sec. <ref>. Then, in Sec. <ref>, we numerically evaluate its properties on a tabular environment. We finally propose to extend q-learning to a deep variant in Sec. <ref>. In particular, we introduce an easy method for estimating the norm of the value regularizer in non-tabular settings. The source code for q-learning and its deep extension is available at <https://github.com/yevgm/r2rl>.   \n\n\n\n §.§ q-learning\n\n\n\nq-learning is an variant of vanilla q-learning <cit.> aiming to learn a robust optimal policy. Its pseudo-code can be found in Alg. <ref>. The only variation with standard q-learning is that we update an temporal difference (TD) to target an Bellman recursion. On the other hand, differently than robust q-learning <cit.>, q-learning does not involve any optimization problem in updating TDs. Indeed, robust q-learning requires computing the support function of the current value, which demands a linear program solver. Therefore, the additional time complexity is of 𝒪(^3) at least, the time required for multiplying square matrices using standard methods <cit.>. Instead, q-learning computes the norm of the current value, thus involving 𝒪() additional operations at most compared to vanilla q-learning.\n\n\n\nWe set the convergence of q-learning below. To prove it, we first construct an Bellman operator over state-action values, then establish the robust q-function as its fixed point. The rest of the proof relies on stochastic approximation theory <cit.> – see Appx. <ref>. Bellman operators for q-values are similarly defined in <cit.>. However, the robust q-value is established as a fixed point without proof there, whereas we show a formal equivalence in Appx. <ref>. Moreover, the q-learning algorithm derived in <cit.> is essentially a value iteration method that relies on a known nominal model. Here, q-learning is model-free and guaranteed to converge to the robust q-function, as stated below. \n\n\n\nFor any (s,a)∈, let a sequence of step-sizes (β_t(s,a))_t∈ satisfying 0≤β_t(s,a)≤ 1, ∑_t∈β_t(s,a) = ∞ and ∑_t∈β_t^2(s,a)< ∞. Then, the q-learning algorithm as given in Alg. <ref> converges almost surely to the optimal robust q-function. \n\n\nThe assumption ∑_t∈β_t(s,a) = ∞, ∀ (s,a)∈, implicitly requires that we must visit all state-action pairs infinitely often, which is a standard conjecture for convergence proofs <cit.>. Also, we emphasize that even in the (s,a)-rectangular case, the q-function q^π, from Def. <ref> associated with v^π, is generally not the same as the robust q-function q^π, obtained from the robust Bellman operators on state-action values (see proof in Appx. <ref>). This is similar to the regularized MDP setting where in general, the regularized value v^π,Ω does not equal q^π,Ω·π or equivalently, q^π,Ω·π does not necessarily correspond to the fixed point of a regularized Bellman operator <cit.>. Instead, the regularized action-value function is solely defined from the regularized value, itself being a fixed point of the regularized Bellman operator. The same phenomenon arises in the robust setting under s-rectangular uncertainty, and in the case regardless of rectangularity. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Learning on a grid\n\n\nAs proof of concept, we perform experiments in a tabular environment. Here, our goals are the following: (i) numerically illustrate the convergence of q-learning; (ii) highlight its computational advantage over robust q-learning concurrently with its robustness properties.\n\nWe consider a Mars Rover domain as in <cit.>. The objective is to find the shortest path to a goal state in a 10× 10 grid. However, taking a shorter path implies higher risk: the rover has a greater chance to hit a rocket and get a negative reward. The transition function is stochastic: the agent moves to the chosen direction with probability 1-ϵ, and randomly otherwise. At each step, it receives a small penalty r_step. An episode terminates whenever the rover reaches the goal state or hits a rock. The two scenarios yield a reward of r_success and r_fail respectively. We thus have r_success > 0 > r_step > r_fail. We compare our q-learning algorithm with two baselines: vanilla and robust q-learning. Vanilla is the standard method that ignores model uncertainty and assumes the reward and dynamics are fixed. Robust q-learning trains a robust optimal policy using robust Bellman updates as in Eq. (<ref>), thus requiring solving an optimization problem at each iteration <cit.>. \n\nFig. <ref> shows the convergence plot across iteration steps for the three agents: vanilla, robust and . All of them have similar sample complexity and fulfill the task within 100 iteration steps. The difference between them arises when we look at the time complexity of each algorithm. As we can see in Fig. <ref>, robust q-learning takes more than 2 minutes to converge, whereas vanilla and q-learning achieve the highest reward within 4 seconds (see also Fig. <ref> in Appx. <ref>). Similarly, we calculated the average time necessary to perform one learning step in each algorithm: one update takes 7.7± 5.9 × 10^-6 seconds to run, which is slightly slower than vanilla with 1.24± 0.89× 10^-6 seconds. On the other hand, a robust q-update takes 3 ± 0.9 ×10^-2 seconds, thus representing 10^4 higher cost than the other two approaches. This highlights the clear advantage of over robust q-learning in terms of computational cost. To check robustness, after training, we evaluate each policy under varying dynamics. In particular, we increase the value of ϵ to make the environment more adversarial. Fig. <ref> shows that the policy performs similarly to the robust one under more adversarial transitions when ϵ tends to 1, both being less sensitive than vanilla.\n\n\n  \n\n\n\n §.§ Scaling q-learning\n\n\nThe current expression of TD (line 6 of Alg. <ref>) suggests that we have access to the whole q-table for computing the current value's norm. This no longer applies when the state space is infinite or even continuous. Instead, we need to estimate the norm based on sampled observations. We thus keep track of a replay buffer that memorizes and updates past information online. At each iteration, we randomly extract a batch ℬ_t\n\nof samples thanks to which we derive an empirical estimate of the norm. Formally, v_t_ℬ_t^2 := ∑_s∈ℬ_tv_t(s)^2, \nwhere the index in ·_ℬ_t indicates the empirical nature of the norm. Finally, our approximate setting motivates us to stabilize value norm estimates. Thus, in the same spirit as <cit.>, we use a moving average mixing the previous estimate with the current one, at iteration t+1, the value norm squared is given by βv_t_ℬ_t^2 + (1-β)v_t+1_ℬ_t+1^2.  \nTo evaluate the reliability of our norm estimate, we compared it to an oracle. Practically, in Mars Rover, we stored the tabular value function obtained after convergence of q-learning, then measured how the norm estimated from batches evolves across iteration steps.[To avoid state duplicates in the norm expression (which may apply when q-learning starts converging), we further re-normalized each state by its number of occurrences: v_t_ℬ_t = ∑_s∈ℬ_tn_s/*ℬ_tv_t(s)^2, where n_s is the number of instances of state s∈ in the batch.] In Fig. <ref>, we see that decreasing β improves stability at the expense of convergence speed. This trade-off similarly occurs in <cit.>, although in the different context of conservative policy iteration. We could also think of a time-adaptive parameter β to take the best of both worlds, but leave this for future work.\n\n\n\n \n\n\n§ DEEP LEARNING\n\n\n\n\n\n \nWe are now able to scale tabular q-learning to a deep variant we name double DQN (DDQN) and compare it to vanilla and robust baselines. DDQN (resp. robust DDQN) is similar to DDQN <cit.>, except that it minimizes an TD (resp. robust TD) when updating the q-network q_θ. Defining the loss as:\n\n    l_ℬ_t(θ_t) = 1/ℬ_t∑_(s_j,a_j,s'_j,r_j)∈ℬ_t(y_j^baseline - q_θ_t(s_j, a_j))^2,\n\nthe target variable is:\n\n    y_j^=r_j - α^r+γ q_θ_t-1(s'_j,_b∈q_θ'_t-1(s_j',b)) \n        -γα^P*q_θ_t-1(·,_b∈q_θ'_t-1(·,b))_ℬ_t\n\nand the robust target variable is:\n\n    y_t^robust=   r_j-σ_ℛ(s_j,a_j)(-1)+γ q_θ_t-1(s_j',_b∈q_θ'_t-1(s'_j,b))\n       -γσ_𝒫(s_j,a_j)(-q_θ_t-1(·,_b∈q_θ'_t-1(·,b))),\n\nwhere θ and θ' denote the weights of the q-network and the target q-network respectively. Recall that we follow the method described in Sec. <ref> to estimate the norm in Eq. (<ref>).\nFor the three algorithmic variants, DDQN <cit.>, robust DDQN <cit.> and DDQN, we use a fully connected q-network with an input size corresponding to the dimension of the state space, 2 hidden layers of size 256, and an output size corresponding to the dimension of the action space. \n\nWe selected three physical environments from OpenAI Gym: Cartpole, Acrobot, and Mountaincar <cit.>. In Cartpole, the longer the episode, the higher the cumulative reward: at each step, the agent receives a reward of 1 if it maintains a small inclination angle and stays close to the starting x-position, and 0 otherwise. Oppositely, in Acrobot and MountainCar, the longer the episode, the lower the cumulative reward: the agent incurs a negative reward of -1 if it did not reach the goal area, and 0 otherwise–in which case the episode terminates. In each environment, the underlying transition model is directly affected by the physical properties assigned to the agent. Therefore, changing the environment properties implicitly introduces transition uncertainty into the MDP. \n\nWe train the three agents on one nominal environment and five different seeds. For a fair comparison, each seed set is taken to be the same for vanilla, robust and DDQN. Robust and DDQN are trained under the same uncertainty level, namely, α^P=α^r=10^-4. Fig. <ref> shows that all three agents converge to similar performance, except in Mountaincar where DDQN outperforms both vanilla and robust DDQN. \n\n\n\n\n\nTo check the computational advantage of DDQN over robust DDQN, we calculate the average time each algorithm takes to perform one update of the q-network. As we see in Tab. <ref>, one learning step of robust DDQN is slower than one update by an order of magnitude. This is expected, as robust DDQN must solve an optimization problem at each step. On the other hand, one update is approximately four times slower than vanilla because of the additional computations it requires. This confirms the results we obtained previously for MPI and q-learning: robust updates take much longer than updates, themselves being slightly slower than standard, non-robust updates.  \n\n\n\n\n \n\n\nWe finally aim to check the robustness of each algorithm to unseen or changing dynamics. After training, we select two environment parameters across a range of values and evaluate the average performance over several episodes run under the corresponding dynamics. We repeat the same procedure for all seeds and environments. Fig. <ref> displays the performance obtained by each agent undergoing such treatment. In all environments, achieves similar performance as robust DDQN. Both exhibit more robust behavior than vanilla DDQN except for mass pole changes in Cartpole, where the three algorithms demonstrate similar results. We also notice that in Mountaincar, is much more robust to changing gravity than the other two agents. To additionally evaluate their robustness to shock, we conduct the following experiment: each agent starts the task under the same nominal parameters as those it has been trained on but at time step t=20, the dynamics abruptly change and remain in this tweaked environment until the episode ends. As we can see in Fig. <ref>, and robust DDQN achieve higher performance than vanilla DDQN as the change becomes more abrupt or equivalently, as we look further away from the cell corresponding to the nominal parameters. \n\n\n \n \n\n\n§ RELATED WORK\n\n\n\nIn statistical learning, regularization has long been used as a computationally low-cost tool for reducing over-fitting  <cit.>. Later on, the theory of robust optimization <cit.> has enabled establishing formal connections between regularization and robustness in standard learning settings such as support vector machines <cit.>, logistic regression <cit.> or maximum likelihood estimation <cit.>. As stated in Sec. <ref>, these represent particular RL problems as they concern a single-stage decision-making process. In that regard, the generalization of robustness-regularization duality to sequential decision-making has seldom been studied in the RL literature. \n\nIt is only recently that policy regularization started being viewed from a robustness perspective <cit.>. In <cit.>, regularization is applied to the dual objective instead of the primal. This has two shortcomings: (i) It prevents the formulation of regularized Bellman operators and dynamic programming methods; (ii) The feasible set is that of occupancy measures, so the connection with standard policy regularization remains unclear. Whilst <cit.> address this shortcoming by providing relevant reward sets, their focus on the dual problem yields larger uncertainty. As mentioned in Sec. <ref>, although it is consistent with our results at optimality, using approximate solvers may result in overly conservative performance. Moreover, the optimization problem studied there is unrelated to robust dynamic programming, which hinders the facilitation of robust RL. Also, both of these works focus on reward robustness. Differently, <cit.> address reward and transition uncertainty by showing that policies with maximum entropy regularization solve a particular type of robust MDP. Yet, their analysis separately treats the uncertainty on P and r, which questions the robustness of the resulting policy when the whole model (P,r) is adversarial. Moreover, the dual relation they establish between entropy regularization and transition-robust MDPs is weak and applies to specific uncertainty sets. Both of these works treat robustness as a side-effect of regularization more than an objective on its own, whereas we aim to do the opposite, namely, use regularization to solve robust RL problems. \n\nTwo works that do use regularization as a tool for achieving robust policies are <cit.>. Through distributionally robust MDPs, <cit.> show upper and lower bounds between transition-robustness and regularization. There again, duality is weak and reward uncertainty is not addressed. Moreover, since the exact regularization term has no explicit form, it is usable through its upper bound only. Finally, regularization is applied on the mean of several value functions v^π_(P̂_i,r), where each P̂_i is a transition model estimated from an episode run. Computing this quantity requires as many policy evaluations as the number of model estimates available, which results in a linear complexity blowup at least. <cit.> extend the conference version of this work <cit.> by additionally constraining all kernels in P_0+ to reside in a probability simplex. This yields less conservative policies at the expense of additional computational cost. Moreover, similarly as <cit.>, <cit.> focus on model-based methods, whereas we provably extend regularization to model-free learning. \n\nPrevious studies analyze robust planning algorithms to provide convergence guarantees. The works <cit.> propose robust value iteration, while <cit.> introduce robust policy iteration. <cit.> generalize both schemes by proposing a robust MPI and determine the conditions under which it converges. The polynomial time within which all these works guarantee a robust solution is often insufficient, as the complexity of a Bellman update grows cubically in the number of states <cit.>. \n\nIn order to reduce the time complexity of robust planning algorithms, <cit.> propose faster methods able to compute robust Bellman updates in 𝒪(log()) operations for ℓ_1-constrained uncertainty sets, while the algorithms from <cit.> require  𝒪(log()) operations for ℓ_∞-robust updates. Advantageously, our regularization approach reduces each such update to its standard, non-robust complexity of 𝒪().\nMoreover, although <cit.> address both (s,a) and s-rectangular uncertainty sets, sets that are independently defined over each state-action pair or state only, they focus on transition uncertainty, whereas we tackle both reward and transition uncertainties in the general s-rectangular case. Finally, their contribution relies on LP formulations that necessitate restricting to one predefined norm while our method applies to any norm. This may come from the fact that our main Theorems (Thms. <ref> and <ref>) use Fenchel-Rockafellar duality <cit.>, a generalization of LP duality (see Appx. <ref> and <ref>). More recently, <cit.> proposed a first-order method to accelerate robust value iteration under s-rectangular uncertainty sets that are either ellipsoidal or KL-constrained, while <cit.> provide an algorithmic speedup for general f-divergence robust MDPs. To our knowledge, our study is the first one reducing the time complexity of robust to standard planning when the uncertainty set is s-rectangular and constrained with an arbitrary norm. \n\nDespite its theoretical guarantees, robust RL has been sparingly applied to deep settings. We believe this is due to its computational challenges, which this work aims to address. As mentioned in Sec. <ref>, previous methods require samples from several models to train a robust policy <cit.>. Besides their increased sample complexity, these parallel simulations bind the learning process to finite uncertainty sets. Differently, the robust fitted value iteration method of <cit.> learns a robust policy based on the nominal system's observations only. It derives the worst-case model in closed form, so it can iterate over the value function in a standard way. Yet, the dynamics should be deterministic and satisfy structural assumptions while the nominal model needs to be known. In contrast, we study a general MDP setting without structure in the environment and propose a model-free algorithm that is guaranteed to converge to a robust optimal policy. \n\nRecently, <cit.> leveraged the regularization technique to derive robust policies. There, as in <cit.>, an Bellman equation is provided for q-values without a formal equivalence to its robust analog being established. In fact, the uncertainty they consider here is not rectangular: the transition model is parameterized by uncertain parameters (like in <cit.>), but these lie in a ball regardless of the state or action. Finally, while several notions of robustness may be addressed in deep RL methods, action perturbation <cit.>, execution delay <cit.> or adversarial observations <cit.>, these are outside the scope of our study which focuses on robustness w.r.t. the transition and/or reward functions. \n \n\n\n§ CONCLUSION AND FUTURE WORK\n\n\n \nIn this work, we established a strong duality between robust MDPs and twice regularized MDPs. This revealed that the regularized MDPs of <cit.> are in fact robust MDPs with uncertain reward, which enabled us to derive a policy-gradient theorem for reward-robust MDPs. When extending this robustness-regularization duality to general robust MDPs, we found that the regularizer depends on the value function besides the policy. We thus introduced MDPs, a generalization of regularized MDPs with both policy and value regularization. The related Bellman operators lead us to propose a converging MPI (resp. q-learning) algorithm that achieves the optimal robust value function within a similar computing time as standard MPI (resp. q-learning), as confirmed by our tabular experiments. Then, we devised a scalable method to estimate the value regularizer in an approximate setting. Finally, we tested the resulting DDQN algorithm on physical domains. \n\nThis study settles the theoretical foundations for scalable robust RL. We should note that our results naturally extend to continuous but compact action spaces in the same manner as standard MDPs do <cit.>. Theoretical extension to infinite state space would be more involved because of the state-dependent regularizer in MDPs. In fact, it would be interesting to study the MDP setting under function approximation, as such approximation would have a direct effect on the regularizer. Similarly, one could analyze approximate dynamic programming for MDPs in light of its robust analog <cit.>. \nApart from its practical effect, we believe our work opens the path to more theoretical contributions in robust RL. For example, extending MPI to the approximate case <cit.> would be an interesting problem to solve because of the evaluation operator being non-linear. So would be a sample complexity analysis for MDPs with a comparison to robust MDPs <cit.>. Another line of research is to extend policy-gradient to MDPs, as this would avoid parallel learning of adversarial models <cit.> and be very useful for continuous control.\n\n\n\nWe would like to thank Raphael Derman for his useful suggestions that improved the clarity of the text, and Navdeep Kumar for noticing a mistake in the proof of Prop. <ref> from <cit.>. Although it has no effect on our results, this manuscript fixes it. Thanks to Roee Ben-Shlomo for taking part in the numerical experiments. Thanks also to Stav Belogolovsky for reviewing a previous version of this paper. Funding in direct support of this work: ISF grant. \n\n\n\n\n\n\n\nThis appendix provides proofs for all of the results stated in the paper. \nWe first recall the following theorem used in the sequel and referred to as Fenchel-Rochafellar duality <cit.>.\n\n[Fenchel-Rockafellar duality]\n\nLet X, Y two Euclidean spaces, f:X→ and g: Y→ two proper, convex functions, and A: X→ Y a linear mapping such that \n0∈core(dom(g) - A(dom(f))).[Given C⊆^, we say that x∈core(C) if for all d∈^ there exists a small enough t∈ such that x+td∈ C <cit.>.]\nThen, it holds that\n\n    min_x∈ Xf(x) + g(A x) = max_y∈ Y -f^*(-A^*y) - g^*(y).\n\n\n\n\n\n\n\n§ REWARD-ROBUST MDPS\n\n\n\n §.§ Proof of Proposition <ref>\n\n\n\n\nFor any policy π∈Δ_^, the robust value function v^π, is the optimal solution of the robust optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v≤ T_(P,r)^πv  for all    (P,r)∈. P_\n\n\n\n\n\n\nLet v^* an optimal point of (<ref>). By definition of the robust value function, v^π,  = T^π, v^π,  =  min_(P,r)∈ T_(P,r)^πv^π,. In particular, v^π, ≤ T_(P,r)^πv^π, for all (P,r)∈, so the robust value is feasible and by optimality of v^*, we get v^*,μ_0≥v^π, , μ_0. Now, we aim to show that any feasible v∈^ satisfies v≤ v^π, . \nLet an arbitrary ϵ > 0. By definition of T^π,, there exists (P_ϵ,r_ϵ)∈ such that\n\n    T^π, v^π,  +ϵ  > T_(P_ϵ,r_ϵ)^πv^π, .\n\nThis yields:\n\n    v - v^π,    = v - T^π, v^π,    [v^π,  = T^π, v^π, ]\n       <  v + ϵ - T_(P_ϵ,r_ϵ)^πv^π,    [By Eq. (<ref>)]\n       ≤ T^π, v+ ϵ - T_(P_ϵ,r_ϵ)^πv^π,    [v  is feasible for (<ref>)]\n       ≤ T_(P_ϵ,r_ϵ)^πv+ ϵ - T_(P_ϵ,r_ϵ)^πv^π,    [T^π, v ≤ T_(P,r)^πv  for all  (P,r)∈]\n       = T_(P_ϵ,r_ϵ)^π(v-v^π, )+ ϵ.    [By linearity of T_(P_ϵ,r_ϵ)^π]\n\nThus, v - v^π, ≤ T_(P_ϵ,r_ϵ)^π(v-v^π, ) + ϵ, which we iteratively apply as follows:\n\n    v - v^π,    ≤ T_(P_ϵ,r_ϵ)^π(v-v^π, ) + ϵ\n       ≤ T_(P_ϵ,r_ϵ)^π(T_(P_ϵ,r_ϵ)^π(v-v^π, ) + ϵ) + ϵ   [u≤ w T_(P_ϵ,r_ϵ)^πu≤ T_(P_ϵ,r_ϵ)^πw]\n       =(T_(P_ϵ,r_ϵ)^π)^2(v-v^π,  ) + γϵ + ϵ\n       ≤ (T_(P_ϵ,r_ϵ)^π)^2(T_(P_ϵ,r_ϵ)^π(v-v^π,  ) + ϵ)  + γϵ + ϵ\n         ⋮\n       ≤ (T_(P_ϵ,r_ϵ)^π)^n+1(v-v^π,  )  + ∑_k = 0^nγ^kϵ\n       = (T_(P_ϵ,r_ϵ)^π)^n+1(v-v^π,  )  + 1-γ^n+1/1-γϵ.\n\nBy definition of the sup-norm and applying the triangular inequality we obtain:\n\n    v - v^π,    ≤*(T_(P_ϵ,r_ϵ)^π)^n+1(v-v^π,  )_∞ + 1-γ^n+1/1-γϵ\n       ≤γ^n+1v - v^π, _∞ + 1-γ^n+1/1-γϵ   [T_(P_ϵ,r_ϵ)^π is γ-contracting]\n\nSetting n→∞ yields v - v^π, ≤ϵ/1-γ. Since both ϵ>0 and v were taken arbitrarily, v^* - v^π, ≤ 0, while we have already shown that v^*,μ_0≥v^π, , μ_0.\nBy positivity of the probability distribution μ_0, it results that v^*,μ_0 = v^π, , μ_0, and since μ_0 >0, v^π,  = v^*.  \n\n\n\n\n §.§ Proof of Theorem <ref>\n\n\n\n[Reward-robust MDP]\nAssume that = {P_0}×  (r_0+ ). Then, for any policy π∈Δ_^, the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - σ__s(-π_s)  for all  s∈.\n\n\n\n\nFor all s∈, define: F(s):= max_(P, r)∈{v(s) - r^π(s) - γ P^πv(s) }.\nIt corresponds to the robust counterpart of (<ref>) at s∈. Thus, the robust value function v^π, is the optimal solution of:\n\n    max_v∈^v, μ_0 s. t.  F(s)≤ 0  for all    s∈.\n\nBased on the structure of the uncertainty set = {P_0}×  (r_0+ ), we compute the robust counterpart:\n\n    F(s)    = max_r'∈ r_0 + {v(s) - r'^π(s) - γ P_0^πv(s) }\n       =max_r': r' = r_0 + r, r∈{v(s) - r'^π(s) - γ P_0^πv(s) }\n       =max_ r∈{v(s) - (r_0^π(s)  + r^π(s))- γ P_0^πv(s) }   [(r_0 + r)^π = r_0^π + r^π  ∀π∈Δ_^]\n       = max_ r∈{v(s) - r^π(s)-r_0^π(s) -  γ P_0^πv(s) }\n       = max_ r∈{v(s) - r^π(s)-T_(P_0,r_0)^πv(s) }   [T_(P_0,r_0)^πv(s)  = r_0^π(s) +  γ P_0^πv(s)]\n       = max_r∈{- r^π(s)} + v(s) - T_(P_0,r_0)^πv(s)\n       = max_r∈^{- r^π(s) - δ_(r')}+ v(s) - T_(P_0,r_0)^πv(s)\n       = -min_r∈^{ r^π(s) +δ_(r)}+ v(s) - T_(P_0,r_0)^πv(s)\n       = -min_r∈^{r_s, π_s +δ_(r)}+ v(s) - T_(P_0,r_0)^πv(s).    [r^π(s) = r_s, π_s]\n\nBy the rectangularity assumption, = ×_s∈_s and for all r:= (r_s)_s∈∈^, we have\nδ_(r) = ∑_s'∈δ__s'(r_s'). As such, \n\n    F(s)\n           = -min_r∈^{r_s, π_s +∑_s'∈δ__s'(r_s')}+ v(s) - T_(P_0,r_0)^πv(s)\n       = -min_r∈^{r_s, π_s +δ__s(r_s)}+ v(s) - T_(P_0,r_0)^πv(s),\n\nwhere the last equality holds since the objective function is minimal if and only if r_s∈_s. \n\nWe now aim to apply Fenchel-Rockafellar duality to the minimization problem. Let the function\nf :  ^→ defined as r_s  ↦r_s, π_s, and consider \nthe support function δ__s: ^→ together with\nthe identity mapping 𝐈𝐝_: ^→^. \nClearly, dom(f) = ^, dom(δ__s) = _s, and dom(δ__s) - 𝐈𝐝_(dom(f)) = _s - ^ = ^. Therefore, core(dom(δ__s) - A(dom(f))) = core(^) = ^ and 0∈^. We can thus apply Fenchel-Rockafellar duality: noting that 𝐈𝐝_ = (𝐈𝐝_)^* and (δ__s)^*(y) = σ__s(y), we get\n\n    min_r_s∈^{ f(r_s) + δ__s(r_s)}   = -min_y∈^{f^*(-y)+(δ__s)^*(y)} = -min_y∈^{f^*(-y)+σ__s(y)}.\n\nIt remains to compute\n\n    f^*(-y) \n        = max_r_s∈^ - r_s, y -r_s, π_s \n        = max_r_s∈^r_s, -y-π_s\n        =\n        0  if  -y-π_s = 0\n    \n        +∞ otherwise,\n\nand obtain\n\n    F(s)    = min_y∈^{f^*(-y)+σ__s(y)} + v(s) - T_(P_0,r_0)^πv(s)\n        = σ__s(-π_s) + v(s) - T_(P_0,r_0)^πv(s).\n\nWe can thus rewrite the optimization problem (<ref>) as:\n\n    max_v∈^v, μ_0 s. t. σ__s(-π_s) + v(s) - T_(P_0,r_0)^πv(s)≤ 0  for all    s∈,\n\nwhich concludes the proof.\n\n\n\n\n §.§ Proof of Corollary <ref>\n\n\n\n\nLet π∈Δ_^ and = {P_0}×  (r_0+ ). Further assume that for all s∈, the reward uncertainty set at s is _s:= {r_s∈^: r_s≤α_s^r}. Then,  the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - α_s^rπ_s for all  s∈.\n\n\n\n\nWe evaluate the support function:\n\n    σ__s(-π_s)    =  max_r_s∈^: r_s≤α_s^r r_s,-π_s(1)=α_s^r -π_s = α_s^r π_s,\n\nwhere equality (1) holds by definition of the dual norm. \nApplying Thm. <ref>, the robust value function v^π, is the optimal solution of:\nmax_v∈^v, μ_0 s. t. α_s^r π_s + v(s) - T_(P_0,r_0)^πv(s)≤ 0  for all  s∈,\nwhich concludes the proof. \n\nBall-constraint with arbitrary norm.  In the case where reward ball-constraints are defined according to an arbitrary norm ·_a with dual norm ·_a^*, the support function becomes:\n\n    σ__s(-π_s)    =  max_r_s∈^: r_s_a≤α_s^r r_s,-π_s=\n       α_s^r -π_s_a^* = α_s^r π_s_a^*.\n\n\n\n\n\n\n §.§ Related Algorithms: Uncertainty sets from regularizers\n\n \n\n\n\nNegative Shannon entropy. Each (s,a)-reward uncertainty set is _s,a^NS(π):= [ ln(1/π_s(a)), +∞).\nWe compute the associated support function:\n\n    σ__s^NS(π)(-π_s)    = max_r_s∈_s^NS(π)r_s, -π_s\n       = max_r(s,a'):  r(s,a')∈_s,a'^NS(π), a'∈∑_a∈ -r(s,a)π_s(a) \n       = max_r(s,a'):  r(s,a')≥ln(1/π_s(a)), a'∈\n        -∑_a∈π_s(a)r(s,a) \n       =  ∑_a∈π_s(a)ln(π_s(a)),\n\nwhere the last equality results from the fact that π_s≥ 0, and -r(s,a)π_s(a) is maximal when r(s,a) is minimal. \nWe thus obtain the negative Shannon entropy.\n\nKL divergence. Similarly, given d∈Δ_, let _s,a^KL(π):= ln(d(a)) + _s,a^NS(π)  ∀ (s,a)∈. Then\n\n    σ__s^KL(π)(-π_s) \n           =max_r(s,a'):  r(s,a')∈_s,a'^KL(π), a'∈∑_a∈ -r(s,a)π_s(a)\n       =max_r(s,a')+ ln(d(a)):\n      r(s,a')∈_s,a'^NS(π), a'∈∑_a∈ -r(s,a)π_s(a)\n       = max_r(s,a'): \n    \n        r(s,a')∈_s,a'^NS(π), a'∈∑_a∈ - (r(s,a) + ln(d(a))π_s(a)\n       = max_r(s,a'): \n    \n        r(s,a')∈_s,a'^NS(π), a'∈{-∑_a∈π_s(a) r(s,a) }-∑_a∈π_s(a) ln(d(a))\n       = ∑_a∈π_s(a)ln(π_s(a)) - ∑_a∈π_s(a)ln(d(a)),\n\nwhere the last equality uses Eq. (<ref>). \nWe thus recover the  KL divergence Ω(π_s)= ∑_a∈π_s(a)ln(π_s(a)/d(a)).\n\nNegative Tsallis entropy. Given _s,a^T(π):= [1-π_s(a)/2, +∞)  ∀ (s,a)∈, we compute:\n\n    σ__s^T(π)(-π_s)   =  \n        max_r(s,a'):  r(s,a')∈_s,a'^T(π), a'∈∑_a∈ -r(s,a)π_s(a) \n       = max_r(s,a'):  r(s,a')∈[1-π_s(a')/2, +∞), a'∈∑_a∈ -r(s,a)π_s(a)\n       =  ∑_a∈ -1-π_s(a)/2π_s(a)\n       = -1/2∑_a∈π_s(a) + 1/2∑_a∈π_s(a)^2\n        = -1/2+ 1/2π_s^2,\n\nwhere Eq. (<ref>) also comes from the fact that π_s≥ 0, and -r(s,a)π_s(a) is maximal when r(s,a) is minimal. \nWe thus obtain the negative Tsallis entropy Ω(π_s) = 1/2(π_s^2-1).\n\nThe reward uncertainty sets associated to both KL and Shannon entropy are similar, as the former amounts to translating the latter \nby a negative constant (translation to the left). As such, both yield reward values that can be either positive or negative. This is not the case of the negative Tsallis, as its minimal reward is 0, attained for a deterministic action policy, when π_s(a) = 1.\n\nTable <ref> summarizes the properties of each regularizer. \nFor the Tsallis entropy, we denote by τ: ^→ the function q_s↦∑_a∈𝔄(q_s)q_s(a)-1/𝔄(q_s), where 𝔄(q_s)⊆ is a subset of actions:\n𝔄(q_s) = {a∈: 1 + i q_s(a_(i)) > ∑_j=0^iq_s(a_(j)), i ∈{1,⋯, }}, and a_(i) is the action with the  i-th maximal value<cit.>.\n\n \n\n\n\n\n §.§ Proof of Proposition <ref>\n\n\n\n\nAssume that = {P_0}×  (r_0+ ) with _s= {r_s∈^: r_s≤α_s^r}. Then, the gradient of the reward-robust objective J_(π):= v^π, , μ_0 is given by\n\n    ∇ J_(π) = 𝔼_(s,a)∼μ_π[ ∇lnπ_s(a)(q^π, (s,a) - α_s^rπ_s(a)/π_s)],\n\nwhere μ_π is the occupancy measure under the nominal model P_0 and policy π. \n\n\nWe prove the following more general result. To establish Prop. <ref>, we then set α_s^P = 0 and apply Thm. <ref> to replace v^π,  = v_π, and q^π,  = q^π,.\n\n \n\nSet Ω_v, (π_s):= π_s (α_s^r + α_s^P γv). Then, the gradient of the objective J_(π):= v_π, , μ_0 is given by\n\n    ∇ J_(π) = 𝔼_s∼ d_μ_0,π[ ∑_a∈π_s(a)∇lnπ_s(a)q^π, (s,a) - ∇Ω_v, (π_s)],\n\nwhere d_μ_0,π:=μ_0^⊤(𝐈_ - γ P_0^π)^-1, with μ_0∈^× 1 the initial state distribution.\n\n\n\nBy linearity of the gradient operator, ∇ J_(π) = ∇ v^π, , μ_0. We thus need to compute ∇ v^π, . Using the fixed point property of v^π, w.r.t. the Bellman operator yields:\n\n    ∇ v^π, (s)\n    \n        =   ∇(r_0^π(s) + γ P_0^πv^π, (s) - Ω_v, (π_s))\n    \n        =   ∇(∑_a∈π_s(a)(r_0(s, a) + γP_0(·| s,a), v^π, ) - Ω_v, (π_s))\n    \n        =   ∑_a∈∇π_s(a) (r_0(s, a) + γP_0(·| s,a), v^π, )\n            + γ∑_a∈π_s(a)P_0(·| s,a), ∇ v^π,  - ∇Ω_v, (π_s)   [Linearity of gradient & product rule]\n    \n        =   ∑_a∈∇π_s(a)q^π, (s,a)+ γ∑_a∈π_s(a)P_0(·| s,a), ∇ v^π,  - ∇Ω_v, (π_s) \n                                                 [q^π, (s,a) = r_0(s, a) + γP_0(·| s,a), v^π, ]\n    \n        =   ∑_a∈π_s(a)( ∇lnπ_s(a)q^π, (s,a)+ γP_0(·| s,a), ∇ v^π, ) - ∇Ω_v, (π_s)\n          [∇π_s = π_s∇ln(π_s)]\n    \n        =   ∑_a∈π_s(a)( ∇lnπ_s(a)q^π, (s,a) - ∇Ω_v, (π_s) + γP_0(·| s,a), ∇ v^π, ).\n\nThus, the components of ∇ v^π, are the non-regularized value functions corresponding to the modified reward R(s,a):=  ∇lnπ_s(a)q^π, (s,a) - ∇Ω_v, (π_s). By the fixed point property of the standard Bellman operator, it results that:\n\n    ∇ v^π, (s)    =  (𝐈_ - γ P_0^π)^-1(∑_a∈π_·(a)(∇lnπ_·(a)q^π, (·,a) - ∇Ω_v, (π_·)))(s)\n\nand\n\n    ∇ J_(π)    = ∑_s∈μ_0(s)∇ v^π, (s)\n       = ∑_s∈μ_0(s)(𝐈_ - γ P_0^π)^-1(∑_a∈π_·(a)(∇lnπ_·(a)q^π, (·,a) - ∇Ω_v, (π_·)))(s)\n       = ∑_s∈ d_μ_0, π(s)(∑_a∈π_s(a)∇lnπ_s(a)q^π, (s,a) - ∇Ω_v, (π_s)),\n\nby definition of d_μ_0, π.\n\nThe subtraction by ∇Ω_v, (π_s) also appears in <cit.>. However, here, the gradient includes partial derivatives that depend on both the policy and the value itself. Let's try to compute the gradient of the double regularizer Ω_v, (π_s) = π_s (α_s^r + α_s^P γv^π, ). By the chain-rule we have that:\n\n    ∇Ω_v, (π_s)    = ∑_a∈∂Ω_v, /∂π_s(a)∇π_s(a)\n       + ∑_s∈∂Ω_v, /∂ v^π, (s)∇ v^π, (s)\n       =∑_a∈(α_s^r + α_s^P γv^π, )π_s(a)/π_s∇π_s(a)\n       + ∑_s∈α_s^P γπ_sv^π, (s)/v^π, ∇ v^π, (s).\n\nWe remark here an interdependence between ∇Ω_v, (π_s) and ∇ v^π, (s): computing the gradient ∇Ω_v, (π_s) requires to know ∇ v^π, (s) and vice versa. There may be a recursion that still enables to compute these gradients, which we leave for future work.  \n \n\n\n\n\n§ GENERAL ROBUST MDPS\n\n\n\n §.§ Proof of Theorem <ref>\n\n\n\n[General robust MDP]\nAssume that =   (P_0+ )×(r_0+ ). Then, for any policy π∈Δ_^, the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s)  -σ__s(-π_s) -σ__s(-γ v·π_s)  for all  s∈,\n\nwhere [v·π_s](s',a):=v(s')π_s(a)  ∀ (s',a)∈.\n\n\n\nThe robust value function v^π, is the optimal solution of:\n\n    max_v∈^v, μ_0 s. t.  F(s)≤ 0  for all    s∈,\n\nwhere F(s):= max_(P, r)∈{v(s) - r^π(s) - γ P^πv(s) } is the robust counterpart of (<ref>) at s∈. Let's compute it based on the structure of the uncertainty set  =   (P_0+ )×(r_0+ ): \n\n    F(s)   = max_(P',r')∈ (P_0+ )×(r_0+ ){v(s) - r'^π(s) - γ P'^πv(s) }\n       = max_P': P' = P_0 + P, P∈\n     r': r' = r_0 + r, r∈{v(s) - r'^π(s) - γ P'^πv(s) }\n       = max_P∈ , r∈{v(s) - (r_0^π(s) +r^π(s)) - γ (P_0^π + P^π )v(s) }  [(P_0 + P)^π = P_0^π + P^π,\n                                                           (r_0+r)^π = r_0^π+r^π]\n       = max_P∈, r∈{v(s) - r_0^π(s) -r^π(s) - γ P_0^πv(s) -γ P^π v(s) }\n       = max_P∈, r∈{v(s) - T_(P_0,r_0)^πv(s)-r^π(s) -γ P^π v(s) }  [T_(P_0,r_0)^πv(s)  = r_0^π(s) +  γ P_0^πv(s)]\n       = max_P∈{-γ P^π v(s)} + max_r∈{-r^π(s)} +v(s) - T_(P_0,r_0)^πv(s) \n       = -min_P∈{γ P^π v(s) }- min_r∈{r^π(s)}+v(s) - T_(P_0,r_0)^πv(s)\n       = -min_P∈^×{γ P^π v(s) + δ_(P)} - min_r∈^{r^π(s) + δ_(r)}\n           +v(s) - T_(P_0,r_0)^πv(s)\n       = -min_P∈^×{γP^π_s, v + δ_(P)  }\n        -min_r∈^{r_s, π_s +δ_(r)}\n           +v(s) - T_(P_0,r_0)^πv(s).                    [P^π v(s) = P^π_s, v, r^π(s) = r_s, π_s]\n\nAs shown in the proof of Thm. <ref>, min_r∈^{r_s, π_s +δ_(r)} = min_r_s∈^{r_s, π_s + δ__s(r_s)} thanks to the rectangularity assumption. Similarly, by rectangularity of the transition uncertainty set, for all P:= (P_s)_s∈∈^, we have\nδ_(P) = ∑_s'∈δ__s'(P_s'). As such, \n\n    min_P∈^×{γP^π_s, v + δ_(P)  }   = min_P∈^×{γP^π_s, v +  ∑_s'∈δ__s'(P_s')}\n       = min_P_s∈^{γP^π_s, v +  δ__s(P_s)},\n\nwhere the last equality holds since the objective function is minimal if and only if P_s∈_s. \nFinally,\n\n    F(s)    = - min_P_s∈^{γP^π_s, v +  δ__s(P_s)} - min_r_s∈^{r_s, π_s + δ__s(r_s)}+v(s) - T_(P_0,r_0)^πv(s).\n\nReferring to the proof of Thm. <ref>, we know that\n-min_r∈^{r_s, π_s +δ_(r)} = σ__s(-π_s), so \n\n    F(s)    = - min_P_s∈^{γP^π_s, v +  δ__s(P_s)} + σ__s(-π_s)+v(s) - T_(P_0,r_0)^πv(s).\n\nLet the matrix v·π_s∈^ defined as\n[v·π_s](s',a):=v(s')π_s(a) for all (s',a)∈. Further define\n φ(P_s) := γP^π_s, v, which we can rewrite as\nφ( P_s) =  γP_s, v·π_s.\nThen, we have that:\n\n    min_P_s∈^{γP^π_s, v +  δ__s(P_s)} = min_P_s∈^{φ( P_s) + δ__s(P_s)} = -min_∈^{φ^*( -) + σ__s()},\n\nwhere the last equality results from Fenchel-Rockafellar duality and the fact that (δ__s)^* = σ__s.\nIt thus remains to compute the convex conjugate of φ:\n\n    φ^*(-)    = max_P_s∈^{P_s, - - φ( P_s) }\n       =  max_P_s∈^{P_s,-  -γP_s, v·π_s}\n       =max_P_s∈^P_s, - - γ v·π_s\n       = \n       0  if  - - γ v·π_s = 0 \n    \n       +∞ otherwise,\n\nwhich yields min_∈^{φ^*( -) + σ__s()} = σ__s(- γ v·π_s). \nFinally, the robust counterpart rewrites as: F(s) = σ__s(-γ v·π_s)+ σ__s(-π_s) + v(s) - T_(P_0,r_0)^πv(s),\nand plugging it into the optimization problem (<ref>) yields the desired result.\n\n\n\n\n §.§ Proof of Corollary <ref>\n\n\n\n\nAssume that =   (P_0+ )×(r_0+ ) with _s:= {P_s∈^: P_s≤α_s^P} and _s:= {r_s∈^: r_s≤α_s^r} for all s∈. Then, the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) -α_s^rπ_s - α_s^Pγvπ_s for all  s∈.\n\n\n\n\nAs we already showed in Cor. <ref>, the support function of the reward uncertainty set is\nσ__s(-π_s)  = α_s^r π_s. For the transition uncertainty set, we similarly have:\n\n    σ__s(-γ v·π_s)    = max_P_s∈^: \n    P_s≤α_s^P P_s,-γ v·π_s\n       = α_s^P -γ v·π_s\n       = α_s^P γ v·π_s\n       = α_s^P γ vπ_s.    [ v·π_s^2 = ∑_(s',a)∈(v(s')π_s(a))^2 \n          = ∑_s'∈v(s')^2∑_a∈π_s(a)^2 =  v^2π_s^2]\n\nNow we apply Thm. <ref> and replace each support function by their explicit form to get that the robust value function v^π, is the optimal solution of:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - α_s^rπ_s - α_s^Pπ_s·γv for all  s∈.\n\nBall-constraints with arbitrary norms.  As seen in the proof of Thm. <ref> and Cor. <ref>, \nfor ball-constrained rewards defined with an arbitrary norm ·_a of dual ·_a^*, the corresponding support function is σ__s(-π_s) = α_s^r π_s_a^*. Similarly, for ball-constrained transitions based on a norm ·_b of dual ·_b^*, we have:\n\n    σ__s(-γ v·π_s)    = max_P_s∈^: \n    P_s_b≤α_s^P P_s,-γ v·π_s= α_s^P -γ v·π_s_b^*,\n\nin which case the robust value function v^π, is the optimal solution of:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - α_s^rπ_s_a^* - α_s^P -γ v·π_s_b^* for all  s∈.\n\n\n\n\n\n\n§ MDPS\n\n\n\n §.§ Proof of Proposition <ref>\n\n\n\n\nSuppose that Asm. <ref> holds. Then, we have the following properties:\n\n\n    \n  (i) Monotonicity: For all v_1, v_2∈^ such that v_1≤ v_2, we have T^π,v_1 ≤ T^π,v_2 and T^*, v_1 ≤ T^*, v_2.  \n\n    \n  (ii) Sub-distributivity: For all v_1∈^, c∈, we have T^π,(v_1 + c1_)≤ T^π,v_1 + γ c1_ and T^*, (v_1 + c1_)≤ T^*, v_1 + γ c1_, ∀ c∈. \n\n    \n  (iii) Contraction: Let ϵ_*:= min_s∈ϵ_s>0. Then, for all v_1, v_2∈^,\n\n    T^π,v_1 -  T^π,v_2_∞≤ (1-ϵ_*)v_1-v_2_∞ and\n    T^*, v_1 -  T^*, v_2_∞≤ (1-ϵ_*)v_1-v_2_∞.\n\n\n\n\nProof of (i).  Consider the evaluation operator and let v_1,v_2∈^ such that v_1≤ v_2.\n For all s∈,\n\n    [T^π,v_1 -  T^π,v_2](s) \n       =  T_(P_0,r_0)^πv_1(s) - α_s^rπ_s - α_s^P γv_1π_s\n           - (T_(P_0,r_0)^πv_2(s) - α_s^rπ_s - α_s^P γv_2π_s)\n       = T_(P_0,r_0)^πv_1(s) - T_(P_0,r_0)^πv_2(s) + α_s^P γπ_s (v_2 - v_1)\n       = γ P_0^π(v_1 - v_2)(s) + α_s^P γπ_s (v_2 - v_1)\n       = γπ_s, P_0_s(v_1 - v_2)+ α_s^P γπ_s (v_2 - v_1)\n        [∀ v∈^, P_0^πv(s) = ∑_(s',a)∈π_s(a)P_0(s'|s,a)v(s') \n                                                   = ∑_a∈π_s(a)[P_0_s v](a) =π_s, P_0_sv]\n       =  γπ_s( *π_s/π_s, P_0_s(v_1 - v_2)  + α_s^P  (v_2 - v_1))\n       ≤γπ_s( *π_s/π_s, P_0_s(v_1 - v_2)  + α_s^P  (v_2- v_1))   [∀ v, w∈^, v - w≤*v - w≤v-w].\n\nBy Asm. <ref>, we also have\n\n    α_s^P   ≤min_𝐮_∈^_+, 𝐮_=1\n    𝐯_∈^_+, 𝐯_=1𝐮_^⊤ P_0(·| s,·)𝐯_   =min_𝐮_∈^_+, 𝐮_=1\n    𝐯_∈^_+, 𝐯_=1*𝐮_, P_0(·| s,·)𝐯_   ≤*π_s/π_s, P_0(·| s,·)(v_2-v_1)/v_2-v_1,\n\nso that \n\n    [T^π,v_1 -  T^π,v_2](s) \n        ≤γπ_s( *π_s/π_s, P_0_s(v_1 - v_2)  + *π_s/π_s, P_0(·| s,·)(v_2-v_1)/v_2-v_1v_2- v_1)\n       = γπ_s( *π_s/π_s, P_0_s(v_1 - v_2)  + *π_s/π_s, P_0(·| s,·)(v_2-v_1)) =0,\n\nwhere we switch notations to designate P_0(·| s,·) = P_0_s ∈^×. This proves monotonicity. \n\nProof of (ii).  We now prove the sub-distributivity of the evaluation operator. Let v∈^, c∈. For all s∈,\n\n    [T^π,(v + c1_)](s) \n    \n        =    [T_(P_0,r_0)^π(v + c1_)](s) - α_s^rπ_s - α_s^P γv + c1_π_s\n    \n        =    T_(P_0,r_0)^πv(s) + γ c - α_s^rπ_s - α_s^P γv + c1_π_s   [T_(P_0,r_0)^π(v + c1_) = T_(P_0,r_0)^πv + γ c1_]\n    ≤     T_(P_0,r_0)^πv(s) + γ c - α_s^rπ_s - α_s^P γπ_s (v + c1_)\n    \n        =    T_(P_0,r_0)^πv(s)+ γ c - α_s^rπ_s - α_s^P γπ_sv\n           - α_s^P γπ_s c1_\n    \n        =    [T^π,v ](s) + γ c- α_s^P γπ_s c1_\n    ≤    [T^π,v ](s) + γ c.    [γ > 0, α_s^P > 0,  ·≥ 0]\n\n\nProof of (iii). \nWe prove the contraction of a more general evaluation operator with ℓ_p regularization, p≥ 1. This will establish contraction of the operator T^π, by simply setting p=2. \nDefine as q the conjugate value of p, such that 1/p + 1/q =1. As seen in the proof of Thm. <ref>, \nfor balls that are constrained according to the ℓ_p-norm ·_p, the robust value function v^π, is the optimal solution of:\n\n    max_v∈^v, μ_0 s. t.  v(s)≤ T_(P_0,r_0)^πv(s) - α_s^rπ_s_q - α_s^P -γ v·π_s_q for all  s∈,\n\nbecause ·_q is the dual norm of ·_p, and we can define the operator accordingly:\n\n    [T^π,_qv](s) := T_(P_0,r_0)^πv(s) - α_s^rπ_s_q - α_s^P γv·π_s_q  ∀ v∈^, s∈.\n\nWe make the following assumption:\n[A_q]\nFor all s∈, there exists ϵ_s > 0 such that α_s^P≤1-γ-ϵ_s/γ^1/q.\n\n\nLet v_1,v_2∈^. For all s∈,\n\n    *[T_q^π,v_1](s) -  [T_q^π,v_2](s) \n    \n         =   | T_(P_0,r_0)^πv_1(s) - α_s^rπ_s_q - α_s^P γv_1·π_s_q\n           - (T_(P_0,r_0)^πv_2(s) - α_s^rπ_s_q - α_s^P γv_2·π_s_q)|\n    \n         =   *T_(P_0,r_0)^πv_1(s)   - T_(P_0,r_0)^πv_2(s)  + *α_s^P γ (v_2 ·π_s_q  -  v_1·π_s_q)\n    \n        =   *T_(P_0,r_0)^πv_1(s)   - T_(P_0,r_0)^πv_2(s)  + α_s^P γ*v_2 ·π_s_q  -  v_1·π_s_q\n    ≤   *T_(P_0,r_0)^πv_1(s)  - T_(P_0,r_0)^πv_2(s) + α_s^P γv_2 ·π_s  -  v_1·π_s_q\n                                           [∀, ∈^, *_q - _q≤-_q] \n    ≤   γ*v_1 - v_2_∞ + α_s^P γv_2 ·π_s  -  v_1·π_s_q\n                                           [T_(P_0,r_0)^πv_1  - T_(P_0,r_0)^πv_2_∞≤γ*v_1 - v_2_∞]\n     \n         =   γ*v_1 - v_2_∞ + α_s^P γ(v_2 -v_1)·π_s _q\n                                           [∀ v, w∈^, v·π_s - w·π_s = (v-w)·π_s]\n    ≤   γ*v_1 - v_2_∞ + α_s^P γv_2 -v_1_q        [∀ v∈^, v·π_s_q≤v_q]\n    ≤   γ*v_1 - v_2_∞ + α_s^P γ^1/q*v_1 - v_2_∞  [∀ v, w∈^, v-w_q ≤^1/qv-w_∞]\n    \n         =   γ (1 + α_s^P^1/q)*v_1 - v_2_∞\n    ≤   γ(1 + 1-γ- ϵ_s/γ)v_1-v_2_∞        [α_s^P ≤1-γ-ϵ_s/γ^1/q by Asm. (A_q)]   \n    \n         =    (1- ϵ_s )v_1-v_2_∞\n    ≤   (1- ϵ_* )v_1-v_2_∞,\n\nwhere ϵ_*:= min_s∈ϵ_s. Setting q=2 and remarking that: (i) the first bound in Asm. <ref> recovers Asm. (A_q); (ii) T_2^π, = T^π,, establishes contraction of the evaluation operator. For the optimality operator, the proof is exactly the same as that of <cit.>, using Prop. <ref>. \n\n\n \n\n §.§ Proof of Theorem <ref>\n\n \n\n\n[optimal policy]\nThe greedy policy π^*,  = 𝒢_Ω_(v^*, ) is the unique optimal policy, for all π∈Δ_^, v^π^*,  = v^*, ≥ v^π,. \n\n\n\nBy strong convexity of the norm, the function\nΩ_v,  : π_s ↦π_s (α_s^r + α_s^P γv) is strongly convex in π_s. As such, we can invoke Prop. <ref> to state that the greedy policy π^*, is the unique maximizing argument for v^*,.  \nMoreover, by construction, \n\n    T^π^*, ,v^*,  = T^*, v^*, = v^*, .\n\nSupposing that Asm. <ref> holds, the evaluation operator T^π^*, , is contracting and has a unique fixed point v^π^*, ,. Therefore, v^*, being also a fixed point, we have v^π^*, , = v^*,. It remains to show the last inequality: the proof is exactly the same as that of <cit.>, and relies on the monotonicity of the operators.\n\n\n\n\n §.§ Proof of Remark <ref>\n\n\n\n\nAn optimal policy may be stochastic. This is due to the fact that our MDP framework builds upon the general s-rectangularity assumption. Robust MDPs with s-rectangular uncertainty sets similarly yield an optimal robust policy that is stochastic <cit.>. Nonetheless, the MDP formulation recovers a deterministic optimal policy in the more specific (s,a)-rectangular case, which is in accordance with the robust MDP setting.\n\n\n\nIn the (s,a)-rectangular case, the uncertainty set is structured as = ×_(s,a)∈(s,a), where (s,a):= P_0(·|s,a)× r_0(s,a)+ (s,a)×(s,a). The robust counterpart of problem (<ref>) is:\n\n    F(s)   = max_(P, r)∈{v(s) - r^π(s) - γ P^πv(s) }\n       =max_(P(·|s,a), r(s,a))∈(s,a)×(s,a){v(s) - r_0^π(s) - r^π(s)- γ P_0^πv(s) - γ P^πv(s) }\n       =max_(P(·|s,a), r(s,a))∈(s,a)×(s,a){ - r^π(s) - γ P^πv(s) } + v(s) - r_0^π(s)- γ P_0^πv(s)\n       = max_ r(s,a)∈(s,a){-r^π(s) }\n        +γmax_P(·|s,a)∈(s,a){ - P^πv(s) } + v(s)  - T_(P_0,r_0)^πv(s)\n       = max_ r(s,a)∈(s,a){ -∑_a∈π_s(a)r(s,a) }\n        +γmax_P(·|s,a)∈(s,a){ - ∑_a∈π_s(a) P(·|s,a), v}\n           + v(s)  - T_(P_0,r_0)^πv(s)\n       = ∑_a∈π_s(a)(max_ r(s,a)∈(s,a){ -r(s,a) }\n        +γmax_P(·|s,a)∈(s,a){P(·|s,a), -v})\n           + v(s)  - T_(P_0,r_0)^πv(s).\n\nIn particular, if we have ball uncertainty sets (s,a):= {P(·|s,a)∈^: P(·|s,a)≤α_s,a^P} and (s,a):= {r(s,a)∈: r(s,a)≤α_s,a^r} for all (s,a)∈, then we can explicitly compute the support functions:\n\n    max_r(s,a): r(s,a)≤α_s,a^r -r(s,a) = α_s,a^r  and max_P(·|s,a): P(·|s,a)≤α_s,a^PP(·|s,a), -v =  α_s,a^Pv.\n\nTherefore, the robust counterpart rewrites as:\n\n    F(s)    = ∑_a∈π_s(a)(α_s,a^r + γα_s,a^Pv)+ v(s)  - T_(P_0,r_0)^πv(s),\n\nand the robust value function v^π, is the optimal solution of the convex optimization problem:\n\n    max_v∈^v, μ_0 s. t.   v(s)  ≤  T_(P_0,r_0)^πv(s) - ∑_a∈π_s(a)(α_s,a^r + γα_s,a^Pv)  for all  s∈.\n\nThis derivation enables us to derive an Bellman evaluation operator for the (s,a)-rectangular case. Indeed, the regularization function now becomes\n\n    Ω_v, (π_s):= ∑_a∈π_s(a)(α_s,a^r + γα_s,a^Pv),\n \nwhich yields the following operator:\n\n    [T^π,v](s) := T_(P_0,r_0)^πv(s)-Ω_v, (π_s) ,     ∀ s∈.\n\nWe aim to show that we can find a deterministic policy π^d∈Δ_^ such that [T^π^d,v](s) = [T^*,v](s) for all s∈. Given an arbitrary policy π∈Δ_^, we first rewrite:\n\n    [T^π,v](s)    = r_0^π(s) + γ P_0^πv(s) -  Ω_v, (π_s)\n       = ∑_a∈π_s(a)r_0(s,a) + γ∑_a∈π_s(a)P_0(·|s,a), v - (∑_a∈π_s(a)(α_s,a^r + γα_s,a^Pv))\n       = ∑_a∈π_s(a)(r_0(s,a)- α_s,a^r + γ (P_0(·|s,a), v - α_s,a^Pv))\n\nBy <cit.>, we have that:\n\n    ∑_a∈π_s(a)(r_0(s,a)- α_s,a^r + γ (P_0(·|s,a), v - α_s,a^Pv)) \n       ≤max_a∈{r_0(s,a)- α_s,a^r + γ (P_0(·|s,a), v - α_s,a^Pv)},\n\nand since the action set is finite, there exists an action a^*∈ reaching the maximum. Setting π^d(a^*)=1 thus gives the desired result. \nWe just derived a regularized formulation of robust MDPs with (s,a)-rectangular uncertainty set and ensured that the corresponding Bellman operators yield a deterministic optimal policy. In that case, the optimal Bellman operator becomes:\n\n    [T^*,v](s) = max_a∈{r_0(s,a)- α_s,a^r + γ (P_0(·|s,a), v - α_s,a^Pv)}.\n\n\n\n\n\n§ Q-LEARNING\n\n\n\n\n\n §.§ The q-function\n\n\n\nAssume that = ({P_0} + ) × ({r_0} + ) and  is (s,a)-rectangular. Then, its corresponding robust action-value function is an optimal solution of:\n\n    max_q∈^q, μ_0·π s.t.  q(s,a)≤ T^π_(P_0, r_0)q(s,a) - σ_(s,a)(-1) - σ_(s,a)(-γ q·π)  for all  (s,a)∈,\n\nwhere [q·π](s'):= ∑_a'∈π_s'(a')q(s', a'), ∀ s'∈. \n\n\n\nIt is known from <cit.> that the robust action-value function is an optimal solution of:\n\n    max_q∈^q, μ_0·π s.t.  q(s,a)≤ T^π_(P, r)q(s,a)  for all  (s,a)∈, (P(·|s,a), r(s,a))∈(s,a),\n \nwhich can be rewritten as:\n\n    max_q∈^q, μ_0·π s.t.  q(s,a)   ≤ T^π_(P_0, r_0)q(s,a) +r(s,a) + γP(·|s,a)·π, q\n        for all  (s,a)∈, (P(·|s,a), r(s,a))∈(s,a),\n\nwith [P(·|s,a)·π](s',a'):= π_s'(a')P(s'|s,a), ∀ (s',a'∈). \nMore synthetically, the robust action-value function is an optimal solution of:\n\n    max_q∈^q, μ_0·π\n        s.t. max_(P(·|s,a), r(s,a))∈(s,a){\n    q(s,a) - T^π_(P_0, r_0)q(s,a) - r(s,a) - γP(·|s,a)·π, q}≤ 0\n        for all \n    (s,a)∈.\n\n\nWe now compute the robust counterpart. For any (s,a)∈ and policy π∈Δ_^, denote by:\n\n    F^π(s,a):= max_(P(·|s,a), r(s,a))∈(s,a){\n    q(s,a) - T^π_(P_0, r_0)q(s,a) - r(s,a) - γP(·|s,a)·π, q}.\n\nRemoving the constant terms from the maximization and using the indicator function yields:\n\n    F^π(s,a)    = q(s,a) - T^π_(P_0, r_0)q(s,a) + \n        max_(P(·|s,a), r(s,a))∈(s,a){- r(s,a) - γP(·|s,a)·π, q}\n       =q(s,a) - T^π_(P_0, r_0)q(s,a) - min_(P(·|s,a), r(s,a))∈(s,a){ r(s,a) + γP(·|s,a)·π, q}\n       = q(s,a) - T^π_(P_0, r_0)q(s,a) - min_r(s,a)∈(s,a)r(s,a) - min_P(·|s,a)∈(s,a)γP(·|s,a)·π, q\n       =  q(s,a) - T^π_(P_0, r_0)q(s,a) - min_r(s,a)∈{r(s,a) + δ_(s,a)(r(s,a))}\n            -min_P(·|s,a)∈^{γP(·|s,a)·π, q +δ_(s,a)(P(·|s,a))}.\n\nApplying Fenchel-Rockafellar duality to both minimization problems yields the desired result. \n\n\n\n\nIf, additionally, _sa is a ball of radius α_sa^P w.r.t. some norm · and _sa an interval of radius α_sa^r, then the\nrobust action-value function is an optimal solution of:\n\n    max_q∈^q, μ_0·π s.t.  q(s,a)≤ T^π_(P_0, r_0)q(s,a) - α_sa^r -γα_sa^P q·π_*  for all  (s,a)∈.\n\n\n\nThe upper-bound in the optimization problem enables to define the Bellman operator on q-functions as:\n\n    [T^π,q](s,a):= T^π_(P_0, r_0)q(s,a) - α_sa^r -γα_sa^P q·π_*\n\n\n\n\n §.§ Distinguishing between and robust q-functions\n\n\nWe aim to show that although we can interchangeably optimize an q-function or a robust q-value under (s,a)-rectangularity, \n\nthe q-function obtained from the value v is not the same as the q-function obtained from the original robust optimization problem. This nuance is reminiscent of the regularized MDP setting, where defining the regularized q-function w.r.t. the regularized value v is not equivalent to taking v as the expected q-function over a policy. \n\nLet thus assume that the uncertainty set is (s,a)-rectangular. Then, by Sec. <ref>, the value function v^π, is the unique fixed point of the Bellman operator as below: \n\n    [T^π,v](s) := T_(P_0,r_0)^πv(s)-∑_a∈π_s(a)(α_s,a^r + γα_s,a^Pv),     ∀ s∈.\n\nThis rewrites as: \n\n    v^π, (s)    = ∑_a∈π_s(a)(r_0(s,a) +γP_0(·|s,a), v^π,  -  α_s,a^r - γα_s,a^Pv^π, )\n       = ∑_a∈π_s(a)(q^π,(s,a) -  α_s,a^r - γα_s,a^Pv^π, ),\n\nwhere the last equality holds by definition of the q-function associated with v^π, (Def. <ref>). As a result,\n\n    q^π,·π(s) = v^π, (s) + [α^r + γα^Pv^π, ] ·π (s)\n\n\nAlternatively, by optimizing w.r.t. q∈^ instead of v∈^ and applying Cor. <ref>, the robust action-value function q^π, satisfies: \n\n    q^π, (s,a) = T^π_(P_0, r_0)q^π, (s,a) - α_sa^r -γα_sa^P q^π, ·π_*  for all  (s,a)∈.\n\nTaking the expectation over policy π yields:\n\n    q^π, ·π = r_0^π + P_0^π (q^π, ·π)  - ∑_a∈π_s(a)(α_sa^r -γα_sa^P q^π, ·π_*)  for all  (s,a)∈,\n\nso that q^π, ·π is a fixed point of the Bellman operator. By unicity of its fixed point, we obtain that q^π, ·π = v^π,. \nAs a result:\n\n    q^π, ·π   = v^π, \n    \n           = (q^π, - α^r-γv^π, α^P)·π\n       = q^π,·π  - [α^r + γα^Pv^π, ]·π\n\nTaking deterministic policies on each possible action, we end up with an element-wise identity: \n\n    q^π, (s,a)    = q^π,(s,a) - α^r_s,a-γv^π, α^P_s,a\n\n\n\n\n\n §.§ Convergence of q-learning\n\n\nFor any (s,a)∈, let a sequence of step-sizes (β_t(s,a))_t∈ satisfying 0≤β_t(s,a)≤ 1, ∑_t∈β_t(s,a) = ∞ and ∑_t∈β_t^2(s,a)< ∞. Then, the q-learning algorithm as given in Alg. <ref> converges almost surely to the optimal q-function. \n\n\n\nWe will use the convergence result from <cit.>.\nThe update rule is given by:\n\n    q_t+1(s_t,a_t)    = q_t(s_t,a_t) \n           + β_t(s_t,a_t)(\n      r_t+1 + γmax_b∈q_t(s_t+1,b) - α_s_t a_t^r -γα_s_t a_t^Pmax_b∈q_t(·,b)_*  - q_t(s_t,a_t))\n\nwhich we rewrite as:\n\n    q_t+1(s_t,a_t)    = (1-β_t(s_t,a_t))q_t(s_t,a_t)\n           + β_t(s_t,a_t)(\n      r_t+1 + γmax_b∈q_t(s_t+1,b) - α_s_t a_t^r -γα_s_t a_t^Pmax_b∈q_t(·,b)_* ).\n\nFurther let Δ_t(s,a):= q_t(s,a) - q^*,(s,a), ∀ (s,a)∈. Then Eq. (<ref>) rewrites as:\n\n    Δ_t+1(s,a)    = (1-β_t(s_t,a_t))Δ_t(s_t,a_t)\n       + β_t(s_t,a_t)(\n      r_t+1 + γmax_b∈q_t(s_t+1,b) - α_s_t a_t^r -γα_s_t a_t^Pmax_b∈q_t(·,b)_* - q^*,(s_t,a_t) ).\n\nWe introduce the following random variable:\n\n    G_t(s,a):= r(s,a) + γmax_b∈q_t(X(s,a),b) - α_sa^r -γα_s a^Pmax_b∈q_t(·,b)_* - q^*,(s,a),\n\nso that \n\n    𝔼[G_t(s,a) | ℱ_t ] \n           = 𝔼[r(s,a) + γmax_b∈q_t(X(s,a),b) - α_sa^r -γα_s a^Pmax_b∈q_t(·,b)_* - q^*,(s,a) | ℱ_t]\n       = r(s,a)+γ∑_s'∈max_b∈P(s'|s,a)q_t(s',b)- α_sa^r -γα_s a^Pmax_b∈q_t(·,b)_* - q^*,(s,a) \n       = [T^*,q_t](s,a)- q^*,(s,a) \n       = [T^*,q_t](s,a)- [T^*,q^*,](s,a).\n\nBy contraction property of the Bellman operator, we thus obtain:\n\n    *𝔼[G_t(s,a) | ℱ_t ]_∞   = *[T^*,q_t](s,a)- [T^*,q^*,](s,a)_∞\n       ≤ (1-ϵ^*)*q_t(s,a)- q^*,(s,a)_∞ = (1-ϵ^*)*Δ_t(s,a)_∞\n\n\n\n\n\n\n\n§ PLANNING ON A MAZE\n\n\n\n\n\nIn the following experiment, we play with the radius of the uncertainty set and analyze the distance of the robust/value function to the vanilla one obtained after convergence of MPI. Except for the radius parameters of Table <ref>, all other parameters remain unchanged. In both figures <ref> and <ref>, we see that the distance norm converges to 0 as the size of the uncertainty set gets closer to 0: this sanity check ensures an increasing relationship between the level of robustness and the radius value. As shown in Fig. <ref>, the plots for robust MPI and MPI coincide in the reward-robust case, but they diverge from each other as the transition model gets more uncertain. This does not contradict our theoretical findings from Thms. <ref>-<ref>. In fact, each iteration of robust MPI involves an optimization problem which is solved using a black-box solver and yields an approximate solution. As such, errors propagate across iterations and according to Fig. <ref>, they are more sensitive to transition than reward uncertainty. This is easy to understand: as opposed to the reward function, the transition kernel interacts with the value function at each Bellman update, so errors on the value function also affect those on the optimum and vice versa. Moreover, the gap grows with the radius level because of the simplex constraint we ignored when computing the support function of the transition uncertainty set. The work <cit.> accounts for this additional constraint to derive a regularization function that recovers the robust value under transition uncertainty. \n\n\n0.2in\n\n\n\n\n§ LEARNING EXPERIMENTS\n\n\n\nIn this section, we provide additional details and plots regarding our q-learning algorithm. \n\n\n \n\n\n\n\n\n\n"}