{"entry_id": "http://arxiv.org/abs/2303.07322v1", "published": "20230313174255", "title": "Coulomb-induced synchronization of intersubband coherences in highly doped quantum wells and the formation of giant collective resonances", "authors": ["Mikhail Tokman", "Maria Erukhimova", "Yongrui Wang", "Alexey Belyanin"], "primary_category": "cond-mat.mes-hall", "categories": ["cond-mat.mes-hall", "physics.optics", "quant-ph"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDepartment of Electrical and Electronic Engineering, Ariel University, 40700 Ariel, Israel \n\nBiraghigasse 8, 1130 Vienna, Austria\n\nDepartment of Physics and Astronomy, Texas A&M University, College Station, TX, 77843 USA\n\nDepartment of Physics and Astronomy, Texas A&M University, College Station, TX, 77843 USA\n\n\n\n\n\n\n\n\n\n\n\n\n\nMany-body Coulomb interactions drastically modify the optical response of highly doped semiconductor quantum wells leading to a merger of all intersubband transition resonances into one sharp peak at the frequency substantially higher than all single-particle  transition frequencies. Starting from standard density matrix equations for the gas of pairwise interacting fermions within Hartree-Fock approximation, we show that this effect is due to Coulomb-induced synchronization of the oscillations of coherences of all N intersubband transitions and sharp collective increase in their coupling with an external optical field. In the high doping limit,  the dynamics of light-matter interaction is described by the analytic theory of N coupled oscillators which determines new collective normal modes of the system and predicts the frequency and strength of the blueshifted collective resonance. \n\n\n\n\n\n\nCoulomb-induced synchronization of intersubband coherences in highly doped quantum wells and the formation of giant collective resonances\n    Alexey Belyanin\n    March 30, 2023\n=========================================================================================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\n\n\nIntersubband optical transitions in doped semiconductor quantum wells attracted strong recent interest due to their giant optical nonlinearities, tunability, and ultrafast response,  which promise a broad range of applications from nonlinear frequency mixing, ultrafast saturation, and mode locking to ultra-strong coupling in cavity quantum electrodynamics; see, e.g., recent papers <cit.> and references therein.    There has been a number of experimental and theoretical studies of dramatic changes in the intersubband absorption and emission in highly doped semiconductor quantum wells. These changes are the  manifestation of the Coulomb-induced collective effect called the depolarization field <cit.>, when in the presence of the electromagnetic (EM) radiation each electron is affected by an effective field induced by the excitations of other electrons. The main result of such coupling is the macroscopic polarization which is established in the quantum well as a result of collective modes of oscillations of the electron gas. When the electron density is low and only a single subband is occupied, the depolarization field results in a blue shift of the absorption peak with respect to the “bare” transition frequency. This resonance frequency corresponds to the so called intersubband plasmon <cit.>. The effect of the depolarization field is much more dramatic if the quantum well is highly doped so that several subbands are occupied. In this case, instead of several absorption peaks corresponding to transitions between different subbands, the experiment shows a single strong peak,  blueshifted from all “bare” transitions  <cit.>. This has been interpreted as the excitation of the collective mode of the system, the so-called multisubband plasmon <cit.>. The model describing this effect <cit.> was based on the formalism of “bosonization” of the electron gas. In this formalism the Hamiltonian describing the electron gas is reduced to the expression that contains bosonic operators instead of fermionic ones, namely the operators of creation and annihilation of excitations associated with a given intersubband transition. Such bosonic  operators are proportional to the dyadics  ρ̂_mn=â^†_nâ_m, where â^†_n and â_m are the creation and annihilation operators of electrons in corresponding states.  When the populations are assumed constant, the operators  ρ̂_mn obey the standard bosonic commutation relation [ρ̂_mn ,ρ̂^†_mn]=const. The same operators ρ̂_mn define the operator of the electric polarization which appears in the total Hamiltonian in the dipole gauge <cit.> as an independent variable and describes the effects of dipole-dipole interactions and the coupling of the electronic polarization with a quantized EM field <cit.>.   \n\nWe develop an alternative approach to describe the light-matter dynamics which does not rely on any approximations related to  bosonization and replacement of the fermionic Hamiltonian by effective bosonic one. We obtain the absorption spectrum of the high-density two-dimensional electron gas confined in a quantum well by solving von Neumann density matrix equations taking into account pairwise Coulomb interactions of electrons within the Hartree-Fock (HF) approximation. We show that at high doping the exchange interaction (Fock) terms become insignificant as compared to Hartree terms. Moreover, the exchange interaction effects contributing to the intersubband transition energy renormalization and the coupling of coherences nearly cancel each other. Therefore, the exchange interaction introduces negligible corrections to the spectrum, which is dominated by electron interaction through a common field. Mathematically, the problem is reduced to the system of linearly coupled 2N first-order differential equations for coherences excited at the intersubband transitions by an external monochromatic force, where N is a number of the intersubband transitions.  Therefore, the observed spectra can be understood within an intuitive and transparent picture of self-synchronization in a system of N coupled oscillators, which is a universal phenomenon in the nonlinear dynamics, with numerous analogies not only in quantum-well optics (e.g., self-synchronization of quantum-cascade laser modes <cit.> or Coulomb-induced Fermi-edge singularity <cit.>) and plasma physics (e.g., synchronization of oscillations of free electrons in the collective\nfield of a Langmuir wave), but across all areas of physics and other sciences <cit.>. We are able to obtain important analytic results, in particular the frequencies and oscillator strengths of the new collective normal modes of the system. The collapse of all transitions into a single absorption peak is naturally explained by the presence of Coulomb-induced couplings between intersubband coherences, similarly to the effect of springs connecting mechanical oscillators. In fact, the mechanical analogy can be made mathematically exact; see Fig. 1 and Appendix C. The action of these “Coulomb springs” leads to both the blueshift of the collective resonance frequency and giant enhancement of its oscillator strength.  \n\n\n\nThe paper is organized as follows. In Section <ref> we present the Hamiltonian of the system of Coulomb-coupled identical fermions in a quantum well within the second quantization formalism. In Section <ref> the von Neumann equations for coherences are derived in Hartree-Fock approximation. The final form of the equations taking into account the Hartree modification of the ground state and Hartree coupling terms, and neglecting the exchange interaction is presented. In Section <ref> the solution of this system of coupled equations for coherences at different intersubband transitions is obtained in a general form. The expression for the absorption spectrum of a highly doped quantum well with several occupied subbands is derived analytically. It represents the superposition of collective oscillation eigenmodes with amplitudes proportional to the oscillator strengths and eigenfrequencies different from the original “bare” intersubband transition frequencies.  In subsection <ref> we prove that the Coulomb interaction leads to a collapse of several excited intersubband transitions into one sharp peak at the frequency substantially higher than all the transition frequencies. This effect is illustrated by the mechanical model of “Coulomb springs”. The conditions imposed on the electron concentration and the quantum well thickness under which this effect dominates the optical response are formulated in subsection <ref>. The analytic expression for the frequency of a single bright resonance mode is obtained there. In subsection <ref> the numerically calculated absorption spectra of an electron gas with different concentrations and quantum wells with different thicknesses are presented. In Section <ref> we investigate analytically and numerically the impact of exchange effects on the absorption spectra and come to the conclusion that they are negligible at high doping. Appendix A describes the eigenfunctions and eigenstates of the Hartree Hamiltonian. Appendix B proves the sum rule for the new collective normal modes of the system. Appendix C derives the equations of motion for the mechanical model of “Coulomb springs” and Appendix D evaluates the screening effect coming from higher-order correlations. \n \n\n\n\n§  THE MODEL AND THE HAMILTONIAN\n\n\nIn the second quantization form, the Hamiltonian of the system of interacting identical electrons placed in the QW confinement potential and the potential of ions can be written as\n\n    Ĥ=Ĥ_0+Ĥ_ee+Ĥ_ei\n \nwhere \n\n    Ĥ_0=∫d^3rΨ̂^†_e(r)(p^2/2m^*+V_e(z))Ψ̂_e(r),\n \nis a free-particle term, \n\n    Ĥ_ee=1/2∫d^3r∫d^3r'Ψ̂^†_e(r)Ψ̂^†_e(r')V(|r-r'|)Ψ̂_e(r')Ψ̂_e(r),\n \ndescribes electron-electron interactions, and \n\n    Ĥ_ei=-N_2D∫d^3r∫d^3r'Ψ̂^†_e(r)Ψ̂_e(r)V(|r-r'|)ρ_i(z'),\n \ndescribes electron-ion interactions. \nHere m^* is the effective mass,  V_e(z) is the confinement potential, z is the growth direction of the quantum well structure, V(|r-r'|)=e^2/ε_0|r-r'| \nis the Coulomb interaction potential, ε_0 is the background dielectric constant, N_2D is the sheet doping density, and ρ_i(z) is the normalized doping profile of the ions, satisfying ∫ρ_i(z)dz=1. \nThe operator Ψ̂_e(r) can be expanded using the wave functions which form a complete one-particle basis. The basis functions are not necessarily wave functions which diagonalize a one-particle Hamiltonian \nĤ^0=p^2/2m^*+V_e(z); the only requirement is that these are eigenfunctions of the two-dimensional momentum operator\np_=-i ∂/∂R, \n\nwhere R is the coordinate in the plane of quantum well:\n\n    Ψ̂_e(r)=∑_nkφ_n(z)e^ikR/√(S)â_nk,\n \nwhere â_nk  is the fermionic annihilation operator in the corresponding state. The quantity S is the normalization area in the QW plane, \n\n    1/S∫_Sd^2R∫^∞_-∞dzφ^*_n(z)φ_m(z)e^-ikRe^ik'R=δ_nmδ_κκ'.\n \nThen we get for the components of the Hamiltonian in Eq. (<ref>)      \n\n    Ĥ_0=∑_mn∑_kH^0_mn(k)â^†_mkâ_nk,\n \n\n\n    Ĥ_ee=1/2S∑_mnlp∑_k_1k_2qV^ee_mnlp(q)â^†_mk_1-qâ^†_lk_2+qâ_pk_2â_nk_1=\n \n\n    =1/2S∑_mnlp.V^ee_mnlp(q)|_q=0∑_k_1k_2â^†_mk_1â^†_lk_2â_pk_2â_nk_1+\n \n\n    +1/2S∑_mnlp∑^q≠ 0_k_1k_2qV^ee_mnlp(q)â^†_mk_1-qâ^†_lk_2+qâ_pk_2â_nk_1,\n \n\n\n\n    Ĥ_ei=-N_2D∑_mn.V^ei_mn(q)|_q=0∑_kâ^†_mkâ_nk,\n \nwhere\n\n    V^ee_mnlp(q)=∫dz∫dz'2π e^2/ε_0qe^-q|z-z'|φ^*_m(z)φ_n(z)φ^*_l(z')φ_p(z')\n\n\n    V^ei_mn(q)=∫dz∫dz'2π e^2/ε_0qe^-q|z-z'|φ^*_m(z)φ_n(z)ρ_i(z').\n \nThe charge neutrality condition requires that SN_2D=∑_nkn_nk, where n_nk=⟨â^†_nkâ_nk⟩. The q=0 terms should be interpreted as\n\n    .2π e^2/ε_0qe^-q|z-z'||_q=0=lim_q→ 02π e^2/ε_0qe^-q|z-z'| =.V^2D(q)|_q=0-2π e^2/ε_0|z-z'|,\n \nwhere V^2D(q)=2π e^2/ε_0q is the two-dimensional Fourier transform of the Coulomb potential. Divergence of  V^2D(q) can be avoided by considering the screening effect, see Appendix <ref>.\n\n\n\n\nIn the presence of an optical field ℰ(t) polarized along with the growth direction the Hamiltonian contains another term,\n\n    Ĥ_e-ph=-ℰ(t)∑_mn∑_kμ_mnâ^†_mkâ_nk,\n \nwhere μ_mn are the dipole matrix elements. When the two indices are equal, μ_nn=ez_nn, where z_nn is the average position for level n. This element is only relevant for asymmetric QWs, otherwise it is just a constant in the Hamiltonian.\n\n\n\n\n\n§ DYNAMICS IN THE HARTREE BASIS\n\n\n\n\nThe dynamics of the density matrix elements ρ_nm(k)≡⟨â^†_mkâ_nk⟩ is described by the Heisenberg equations \n\n    iħd/dt⟨â^†_mkâ_nk⟩ =⟨[â^†_mkâ_nk, Ĥ_0+Ĥ_ee+Ĥ_ei+Ĥ_e-ph]⟩ .\n \nFor commutation with Ĥ_ee and  Ĥ_ei, it can be shown that the terms proportional to  .V^2D(q)|_q=0 give zero. For the rest of the terms we get\n\n    iħd/dtρ_nm(k)=∑_l(H^0_nl(k)ρ_lm(k)-H^0_lm(k)ρ_nl(k))\n     \n    +1/S∑_lpgṼ^ee_nlgpρ_lm(k)∑_k'ρ_pg(k')-1/S∑_lpgṼ^ee_lmgpρ_nl(k)∑_k'ρ_pg(k')\n      \n    -N_2D∑_l(Ṽ^ei_nlρ_lm(k)-Ṽ^ei_lmρ_nl(k))\n     \n    -ℰ(t)∑_l(μ_nlρ_lm(k)-μ_lmρ_nl(k))\n     \n    -1/S∑_lpg∑_q≠0V^ee_npgl(q)ρ_lm(k)ρ_pg(k+q)+1/S∑_lpg∑_q≠0V^ee_lpgm(q)ρ_nl(k)ρ_pg(k+q),\n \nwhere\n\n    Ṽ^ee_mnlp=-∫dz∫dz'2π e^2/ε_0|z-z'|φ^*_m(z)φ_n(z)φ^*_l(z')φ_p(z')\n \n\n    Ṽ^ei_mn=-∫dz∫dz'2π e^2/ε_0|z-z'|φ^*_m(z)φ_n(z)ρ_i(z').\n \nIn the derivation above, the random phase approximation (RPA) is used, namely we split quadruple correlators and only keep the density matrix elements which are diagonal with respect to k. \n\nIt is important that the first four lines in Eq. (<ref>) can be obtained by including only the coupling of electrons  through their collective Coulomb field and their interaction with the optical field, i.e., they follow from the single-particle Hamiltonian including the self-consistent field: \n\n    Ĥ^(1)=Ĥ^0-eϕ(z)+Ĥ^(1)_e-ph.\n \nHere the electric potential ϕ(z) obeys the one-dimensional Poisson's equation\n\n    ϕ^”_zz=-4π/ε_0Q(z),\n \nwhere the spatial charge density distribution Q(z) is self-consistently expressed via the density matrix elements:\n\n    Q(z)=eN_2Dρ_i(z)-e1/S∑_mn∑_kρ_mn(k)φ^*_m(z)φ_n(z).\n \nThe last line in Eq. (<ref>) is due to exchange interaction. It cannot be obtained in the single-particle picture. \n\nThe eigenstates of the single-particle Hamiltonian Ĥ^H=Ĥ^0-eϕ(z), in which the collective field ϕ(z) is self-consistently produced by electrons with an equilibrium diagonal distribution over these particular eigen tates, form the so-called Hartree basis. The Hartree Hamiltonian can be written as \n\n    Ĥ^H=Ĥ^0+2π e^2/ε_0N_2D∫dz'|z-z'|ρ_i(z')-\n    \n    -2π e^2/ε_01/S∑_m∑_kρ_mm(k)∫dz'|z-z'||φ_m(z')|^2.\n \nThe equation for eigenfunctions and eigenvalues is\n\n    Ĥ^Hφ_m(z)e^ikR/√(S)=(ħ^2k^2/2m^*+E^H_m)φ_m(z)e^ikR/√(S).\n \nHere ρ_mm(k) are equilibrium populations obeying the Fermi-Dirac statistics over the self-consistently obtained energies E^H_m. The equations that can be used for the numerical calculation of the Hartree basis are presented in the Appendix <ref>.\n\nConsidering the exchange interaction and the interaction with the optical field as perturbations, the equilibrium diagonal distribution over the Hartree states should be used as an unperturbed state of the system. Equation (<ref>) is greatly simplified in the Hartree basis defined by Eqs. (<ref>), (<ref>). In linear approximation with respect to  perturbations, the equations of motion for the nondiagonal density matrix elements  take the form\n\n    iħd/dtρ_nm(k)=(E^H_n-E^H_m)ρ_nm(k)+\n     \n    +1/S∑_p≠ gṼ^ee_nmgp∑_k'ρ_pg(k')(ρ_mm(k)-ρ_nn(k))+ \n     \n     -1/S∑_lp∑_q≠0ρ_pp(k+q)(V^ee_nppl(q)ρ_lm(k)-V^ee_lppm(q)ρ_nl(k))- \n     \n    -1/S∑_p≠ g∑_q≠0V^ee_npgm(q)ρ_pg(k+q)(ρ_mm(k)-ρ_nn(k))- \n     \n    -ℰ(t)μ_nm(ρ_mm(k)-ρ_nn(k)) .\n \n\n\nIf the exchange interaction is neglected, i.e., the third and the fourth rows in Eq. (<ref>) are dropped, one can sum over k and obtain much more compact equations for the dynamics of variables ρ_nm=1/S∑_kρ_nm(k):\n\n    iħd/dtρ_nm=(E^H_n-E^H_m)ρ_nm+∑_p≠ gṼ^ee_nmgp(ρ_mm-ρ_nn)ρ_pg-ℰ(t)μ_nm(ρ_mm-ρ_nn)-iħΓρ_nm.\n\nHere we have added the relaxation term in its simplest form. Equation (<ref>)  clearly demonstrates that the Coulomb interaction creates linear coupling of effective electron oscillators at different transitions between the subbands dressed by the self-consistent field. This coupling is stronger with increasing population differences. Note that Eq. (<ref>) contains total populations due to summation over k and therefore the population differences can be large despite the Pauli blocking of some k-states.  \n\nIn what follows, we analyze the absorption of a highly-doped QW system. We use Eq. (<ref>), where exchange terms are dropped. In Section <ref> we evaluate the effect of exchange terms on the absorption spectrum.\n\n\n\n\n\n\n§ THE ABSORPTION SPECTRUM OF HIGHLY DOPED QUANTUM WELLS\n\n\nEquations (<ref>) represent a system of first-order  differential equations for N_l  linearly coupled variables ρ_j=ρ_nm in the presence of an “external force”. Here N_l is a number of discrete levels (Coulomb-dressed subbands) involved in the interaction. The corresponding number of the transitions is N_t=1/2N_l(N_l-1). Introducing the index numerating the transitions j={nm}, where the transitions {nm}=j and {mn}=j' are counted separately, we can rewrite Eqs. (<ref>) in the form \n\n    ρ̇_j=-i∑^2N_t_l=1Z_jlρ_l+if_j(t)- Γρ_j.\n \nHere the elements of matrix ℤ are given by \n\n    Z_jl=ω_jδ_jl+ e^2/ħI_jl'Δn_j,\n \nwhere the notations are \n\n    ω_j=1/ħ (E^H_n-E^H_m), I_jl'=1/e^2Ṽ^ee_nmgp, Δn_j=ρ_mm-ρ_nn,  f_j(t)=1/ħμ_jℰ(t)Δn_j, μ_j=μ_nm\n \nfor j={nm},  l={pg}, l'={gp}.\n\nConsidering a monochromatic external field,\n\n    ℰ(t)=Re(E^ωe^-iω t),\n \nwe are looking for the induced solution of Eq. (<ref>), \n\n    ρ_j=ρ^ω_je^-iω t+ρ^-ω_je^iω t,\n \nfor which the differential equations Eq. (<ref>) are reduced to the algebraic ones: \n\n    -iωρ^ω_j=-i∑^2N_t_l=1Z_jlρ^ω_l+if^ω_j-Γρ^ω_j,\n \nwhere\n\n    f^ω_j=1/2ħμ_jE^ωΔn_j.\n \nEquation (<ref>) can be presented in the vector form, where the dimension of vector space is equal to  2N_t:\n\n    -iωρ^ω=-iℤρ^ω+if^ω-Γρ^ω.\n \n\nThe averaged dipole moment per unit area of the quantum well, excited as a response to the incident EM wave is calculated as \n\n    P(t)=∑_m,nμ_mnρ_nm=∑^2N_t_j=1μ_j(ρ^ω_je^-iω t+ρ^-ω_je^iω t).\n \nFor simplicity, we can assume that the matrix elements of the dipole moment are real, so that μ_mn=μ_nm. Effective absorbance, which determines the energy absorbed per unit area of the layer, is given by \n\n    Σ(ω)=4ω/c Im(∑^2N_t_j=1μ_jρ^ω_j/E^ω).\n \nIf the Coulomb interaction of electrons, and therefore the coupling of oscillations at different transitions, is neglected, the matrix ℤ  in Eq. (<ref>) is  diagonal, Z_jl=ω_jδ_jl, and the induced solution at frequency ω is defined by the standard Lorentzian:\n\n    ρ^ω_j=if^ω_j/i(ω_j-ω)+Γ.\n \nIn this case the absorbance given by Eq. (<ref>) yields\n\n    Σ(ω )= 4 ω/c Re(∑^2N_t_j=1μ_j f^ω_j/E^ω/ i(ω_j-ω)+Γ).\n \nTaking into account that ω_j=-ω_j',  μ_j=μ_j',  f^ω_j=-f^ω_j', Eq. (<ref>) can be transformed into \n\n    Σ(ω )=e^2N_2D/cm^*Re(∑^N_t_j(ω_j>0)F_j4ω/2Γω +i(ω_j^2-ω^2)).\n \nHere the dimensionless parameter F_j is the “oscillation strength” of the transition with frequency ω_j, multiplied (as compared with the standard definition) by the population difference at this transition normalized to the sheet doping density Δn_j/N_2D:\n\n    F_j=2m^*/e^2N_2Dω_jμ_jf^ω_j/E^ω=m^*μ^2_jω_j/ħ e^2Δn_j/N_2D.\n \nThese modified “oscillation strengths” still obey the sum rule,\n\n    ∑^2N_t_j=1F_j=1.\n \nThis can be proven with the use of the relation   ∑_m|μ_mn|^2ω_mn=e^2ħ/2m, which is true for any one-dimensional Hamiltonian. \nIf the transitions are well resolved, the absorption spectrum Eq. (<ref>) represents the combination of resonant lines with the peak absorbance values given by \n\n    Σ(ω_j)≈2e^2N_2D/cm^*F_j/Γ.\n \n\n        \n\n\n\nThe Coulomb interaction leads to coupling of oscillations at different transitions and enables a dramatic modification of the absorption spectra. The matrix ℤ in Eq. (<ref>) acquires off-diagonal elements.   By the linear change of variables\n\n    ρ̃_l=B_ljρ_j\n \nthe matrix ℤ can be transformed to the diagonal form, so that for the new variables ρ̃_l  Eq. (<ref>) takes the form \n\n    -iωρ̃^ω_l=-iΩ_lρ̃^ω_l+if̃^ω_l-Γρ̃^ω_l.\n \nThe transformation matrix ℬ={B_lj}   is composed of eigenvectors of the transposed Coulomb coupling matrix ℤ^T:\n\n    ∑_iZ_ijB_li=Ω_lB_lj,\n \nor in equivalent form, ℤ^TB_l=Ω_lB_l. The eigenvalues Ω_l of matrix ℤ (or matrix ℤ^T) are the frequencies of eigenmodes in the system of coupled oscillators. The “force vector” f^ω is transformed by the same matrix as \n\n    f̃^ω_l=B_ljf^ω_j.\n \nThe new components of the “force vector” are the projections of this vector onto the directions defined by the vectors B_l , i.e., they can be calculated as a scalar product\n\n    f̃^ω_l=(B_l·f^ω).\n \nThe solution of Eq. (<ref>) has a simple form, similar to Eq. (<ref>):\n\n    ρ̃^ω_l=if̃^ω_l/i(Ω_l-ω)+Γ.\n \n\n\n\nApplying the inverse transformation to Eq. (<ref>) and substituting the result into Eq. (<ref>) we get the following expression for the absorbance:\n\n    Σ(ω )= 4ω/c Re(∑^2N_t_lμ̃_lf̃^ω_l/E^ω/i(Ω_l-ω)+Γ) .\n \nIt looks exactly like Eq.(<ref>), but with different resonance frequencies, dipole moments, and external forces, defined for the new collective normal modes of the system. Note that the effective “dipole vector” μ is transformed according to the operator which differs from ℬ:\n\n    μ̃_l=(ℬ^-1)^H_ljμ_j.\n \nIt can be shown that new components of the “dipole vector” are the projections of this vector onto the directions defined by the eigenvectors of matrix ℤ (ℤD_l=Ω_lD_l):\n\n    μ̃_l=(D_l·μ).\n \nThe matrix ℤ is not symmetric, and therefore its eigenvectors are not orthonormal, and the matrix ℬ is not unitary. However, since matrix ℤ obeys the following relation, \n\n    Z_ij=-Z_j'i',\n \nfor every number l which counts a new normal mode, there exists such a number l' that Ω_l=-Ω_l', B_lj=B_l'j', D_lj=D_l'j'. As result, we have μ̃_l=μ̃_l' , f̃_l=-f̃_l'. Thus we can rewrite the expression for the absorption spectrum Eq. (<ref>) in the form  similar to Eq. (<ref>),\n\n    Σ(ω )=e^2N_2D/c m^*Re(∑^N_t_l(Ω_l>0)F̃_l4ω/2Γω +i(Ω^2_l-ω^2)).\n \nHere the “oscillator strengths” of new normal oscillators are introduced: \n\n    F̃_l=2m^*/e^2N_2DΩ_lμ̃_lf̃^ω_l/E^ω=2m^*/e^2N_2DΩ_l(D_l·μ)(B_l·f^ω)/E^ω.\n \nThe absorption spectrum in Eq. (<ref>) represents the superposition of resonant lines at frequencies of the new normal modes Ω_l with the peak absorbance values proportional to new “oscillator strengths” F̃_l: \n\n    Σ(ω =Ω_l)≈2e^2N_2D/cm^*F̃_l/Γ.\n \nIt is remarkable that the sum rule holds true for the new “oscillation strengths” as well (see the Appendix <ref> for the proof):\n\n    ∑^2N_t_l=1F̃_l=1.\n \n\n\nTo summarize this section, the Coulomb coupling of coherences at different intersubband transitions leads to the shift of resonant frequencies and redistribution of the “oscillation strengths” between new normal modes. In the next section we show that such redistribution leads to a dramatic effect in which most of the absorbance occurs  at one of the normal mode frequencies, which is  strongly blueshifted with respect to all “bare” intersubband transition frequencies.\n\n\n\n\n\n §.§ Coulomb-induced self-synchronization of dipole oscillations. The“Coulomb springs” regime\n\n\nIn this Section investigate the properties of the Coulomb coupling matrix ℤ (Eq. (<ref>)) and show that under certain conditions the eigenvector of this matrix corresponding to one of the normal modes is optimally oriented with respect to the “force vector”, so that  the “oscillation strength” for this normal mode dominates and reaches its maximum value (F̃_m=F̃_m'≈1/2). In other words, oscillations at different intersubband transitions get self-synchronized to produce one powerful collective mode of oscillations. We also show that the eigenfrequency for this mode is large compared with “bare” frequencies of intersubband transitions.  \n\nWe assume that the doping is high enough, so that  several subbands are populated in equilibrium, and there are 2N_t intersubband  transitions with significant dipole moments and total population difference. As an estimation, for an isolated symmetric QW N_t is a number of populated subbands and the relevant transitions are those between neighboring subbands, because they tend to have a much larger transition dipole matrix element as compared to the transitions between more distant subbands. One can of course modify and control the transition dipole moments and frequencies on demand by designing asymmetric coupled QW structures. \n\nFor analytic illustration of the effect, we take some averaged values of the transition frequencies, overlap integrals, dipole moments, and population differences for all transitions:\n\n    |ω_j|≈ω_0, |e^2/ħI_jlΔn_j|≈Ω, |μ_j|≈μ ,  |f^ω_j|=|1/2ħμ_jE^ωΔn_j|≈ f\n \n for all j. In a real system these parameters for different transitions are different, and the resulting response will differ from the ideal one, but the basic reasoning remains the same.\n\nSince there is a correspondence between the overlap integrals I_ij (see Eqs. (<ref>) and (<ref>)) and the dipole moments,\n\n    sign(I_ij)= sign(μ_iμ_j),\n \nthe coupling matrix ℤ can be presented in the following form:\n\n    ℤ≈ω_0( [  1̂   0;   0 -1̂ ])+Ω( [  ℚ  ℚ; -ℚ -ℚ ])=( [ ℤ_+ ℤ_±; ℤ_∓ ℤ_- ]),\n \nwhere  \n\n    dim(1̂) =dim(ℚ) =N_t× N_t,\n \n\n    Q_ij=δ_iδ_j, δ_i=  sign(μ_i).\n \nHere the numbering order of the subbands is chosen in such a way that ω_j>0 for 1≤ j≤ N_t and  j'=j+N_t. Then the “dipole vector” and “force vector” are equal to\n\n    μ=μ( [ δ; δ ])=( [ μ_+; μ_- ]),       f=f( [  δ; -δ ])=( [ f_+; f_- ]),\n \nwhere dim(δ) =N_t. It is taken into account in Eq. (<ref>) and Eq. (<ref>) that μ_j=μ_j', Δn_j=-Δn_j', and ω_j=-ω_j'.\n\nConsider the matrix  ℤ_+, which is the “positive frequency” part of matrix ℤ. The eigenvector of  ℤ_+ which corresponds to the in-phase addition of all oscillators, and therefore to the maximum  increase of the corresponding eigenvalue, turns out to be “co-directional” with both the “dipole vector” μ_+ and the “force vector” f_+, so that the corresponding scalar products are maximal.  Such an eigenvector is proportional to δ. Taking into account the coupling with “negative frequency” vector components, we search for the optimal eigenvector of matrix ℤ in the following form (marked by index “m”):\n\n    D_m=C( [       δ; (α -1)δ ]),\n \nwhere C is the normalization factor, whereas the parameter α is found from the equation \n\n    ℤD_m=CΩ( [        (ω_0/Ω+α N_t)δ; (ω_0/Ω-αω_0/Ω-α N_t)δ ])=Ω_mC( [       δ; (α -1)δ ]).\n \nSolving for it, we find \n\n    α =-ω_0/N_tΩ±√((ω_0/N_tΩ)^2+2ω_0/N_tΩ).\n \nThe frequency of the normal mode which corresponds to this eigenvector is\n\n    Ω_m=±√(ω_0^2+2ω_0N_tΩ).\n \nUnder the condition\n\n    N_tΩ≫ω_0\n \nthe frequency of this normal mode turns out to be much larger than a typical bare transition frequency\n\n    Ω_m≈√(2ω_0N_tΩ)≫ω_0.\n \nFor the effective dipole moment corresponding to this normal oscillator and for the “force vector” component, from Eq. (<ref>) and Eq. (<ref>) we obtain \n\n    μ̃_m≈μ(ω_0N_t/2Ω)^1/4, f̃_m≈ f(ω_0N_t/2Ω)^1/4 .\n \nAs a result, the “oscillator strength”, defined by Eq.(<ref>), is \n\n    F̃_m=2m^*/e^2N_2DΩ_mμ̃_mf̃^ω_m/E^ω≈2m^*/e^2N_2DN_tω_0μ f/E^ω_z.\n \n\nIt shows that the “oscillator strength” at the frequency Ω_m is N_t times higher as compared with the oscillator strengths at uncoupled transitions Eq. (<ref>). By virtue of the sum rule for the new “oscillation strengths” Eq. (<ref>), an almost total suppression of the optical response at all other normal frequencies will take place. From Eq. (<ref>) we obtain that F̃_m=1/2.  Furthermore, according to Eq. (<ref>) the frequency of this bright mode is √(2N_tΩ/ω_0) times higher than bare transition frequencies. Note that even if one subband were populated, N_t=1, the frequency of the effective oscillator taking into account Coulomb interaction of electrons would be still √(1+2Ω/ω_0) larger than the “bare” transition frequency. If several subbands are populated the frequency of the bright mode gets even higher.\n\nUnder the ideal conditions when the whole “oscillation strength” is concentrated in one oscillator the absorbance at this frequency reaches the value\n\n    Σ_max=Σ(ω =Ω_m)≈e^2N_2D/cm^*Γ.\n \n\n\n\n  \n\n\n\nTo summarize, Coulomb interaction leads to effective synchronization of the oscillations of coherences at different intersubband transitions. This effect can be illustrated by a simple mechanical model of coupled oscillators as in the sketch shown in Fig. <ref>, where corresponding equations are in Appendix <ref>. Each active intersubband transition can be modeled by a classical oscillator (the masses on a green spring) with frequency ω_j.   The Coulomb couplings of oscillators are shown by the effective additional grey “springs”. These “Coulomb springs”  synchronize the  oscillations in phase for all oscillators, which also leads to an increase of eigenfrequency. \n\n\n\n\n\n\n\n §.§ Conditions for a strong Coulomb effect\n\n\nLet us analyze the conditions for strong modification of the absorption spectrum in a QW with thickness L and two-dimensional electron gas density  N_2D. These two parameters determine the spectrum for a given shape of the quantum well potential and material parameters.\n\nThe parameter Ω is the characteristic frequency, which is a measure of the influence of Coulomb effects on the oscillations of the dipole moment in a QW. Its magnitude scales as (see Eq. (<ref>))\n\n    Ω∼e^2/ħ⟨ I_jl⟩⟨Δ n_j⟩ .\n \nFor strong Fermi degeneracy the population of the nth subband is equal to ρ_nn=m^*/πħ^2(E_F-E_n), where E_F is the Fermi energy. Hence it follows that if several subbands are populated, i.e. N_t>1, the averaged population difference at the transitions between neighboring levels a can be estimated as \n\n    ⟨Δn_j⟩∼m^*/πħ⟨ω_j⟩ ,     ⟨ω_j⟩ =ω_0 .\n \nMore than one subband is populated if N_2D>m^*/πħω_1, \nwhere ω_1 is the transition frequency between the first two levels.\n\nThe magnitude of one-dimensional overlap integrals I_jl is proportional to the QW thickness and can be estimated as\n\n    ⟨ I_jl⟩∼π/ε_0 L J,\n\nwhere J is the dimensionless factor defined by the shape of a QW potential. This parameter does not change much for different transitions between neighboring levels, For example, in a square potential J∼ 0.2. \n\nIt follows from Eqs. (<ref>), (<ref>), and (<ref>) that \n\n    Ω∼ω_0L/α^*J/ε_0,\n \nwhere α^*=ħ^2/e^2m^* is an analog of the Bohr's radius defined for an effective electron mass m^*. For example, for GaAs QWs with m^*=0.067m_e the value of α^*≈ 0.8 nm. The condition Eq. (<ref>) of strong Coulomb modification of the absorption spectrum in a QW with several populated subbands can now be written as \n\n    N_tL/α^*J/ε_0≫ 1.\n \nIt means that the quantum well thickness multiplied by the number of populated subbands must be sufficiently large. Taking the above parameters and  ε_0 ∼ 13 for the background dielectric constant <cit.>, the latter condition becomes \n\n    N_t L ≫ 50   nm.\n \n\n As follows from Eq. (<ref>) the resonance frequency of the main peak under the condition (<ref>) becomes \n\n    Ω_m∼ω_0√(2N_tL/α^*J/ε_0).\n \nThe intersubband transition frequencies ω_0 also depend on the QW thickness. The typical scaling is \n\n    ω_0∼ω^*(α^*/L)^2.\n \nHere  ω^*=e^4m^*/ħ^3π D, where D is a dimensionless factor between 1 and 10 which is defined by the quantum well potential shape distorted in some way due to the Hartree effect. For example, in an infinite square potential and neglecting the Hartree contribution, we have D=3/2π. \n\nTaking into account the dependence of transition frequencies on the quantum well thickness, Eq. (<ref>), the condition for several subbands to be occupied (N_t>1)  is reduced to \n\n    N_2DL^2>D,\n \nso that for QW thicknesses L∼ 10-20 nm, the 2D electron density needed to populate several subbands is of the order of N_2D∼ 10^12-10^13 cm^-2, as in the experiments <cit.>. \n\n\n\n\n\n\n\n\n\n\n\n §.§  Examples of absorption spectra\n\n\nIn the previous sections the analytical estimations for absorption spectra were obtained using rather rough simplifications Eq. (<ref>). Surprisingly, these estimations describe the effect quite well, as illustrated by the numerical examples below for a square-well potential. First, we solve numerically Eqs. (<ref>)-(<ref>) to find the matrix of transformation from the “bare” to Hartree basis, the energies of Hartree levels and their populations. Then we solve for eigenvectors and eigenvalues of ℤ matrix in Eq. (<ref>). This yields the frequencies of new normal modes Ω_l and corresponding vectors D_l and B_l which define the “oscillator strengths” of new modes  F̃_l in Eq. (<ref>)). The plots of absorption spectra (Eq. (<ref>)) are presented in Figs. <ref> and <ref> for different 2D electron densities in QWs of different thicknesses. The spectra are compared with the ones obtained from Eq. (<ref>) neglecting the Coulomb coupling. \n\n\n \n\n\n\n \n  \n\nThe series of plots presented in Fig. <ref> illustrates the transformation of the absorption spectrum with increasing electron density for a fixed quantum well thickness L=18.5 nm used in experiments <cit.>. At the highest density N_2D=2.2×10^13 cm^-2 corresponding to the experimental structure in <cit.>, five subbands are populated. Using the QW parameters similar to those in <cit.>, the resulting calculated absorption spectrum is in a good agreement with the experimental one; compare the top plot in Fig. <ref> with the spectrum in Fig. 2 of <cit.>. The analytically predicted strong modification of the spectra is obvious at higher dopings. The frequency of the blueshifted absorption peak agrees with the analytic estimation (<ref>). It is much higher than the frequencies of the absorption peaks due to “bare” intersubband transitions in the model neglecting Coulomb coupling. In fact, the modified spectrum demonstrates almost full transparency at the frequencies of “bare” intersubband transitions. The plots in Fig. <ref> show the spectral evolution with varying QW thickness for a electron density.  We see that the larger the width of the well, the greater the relative change in the spectrum associated with the Coulomb coupling. \n\n\n\n\n\n§ THE INFLUENCE OF EXCHANGE INTERACTION EFFECTS\n\n\nTo evaluate the effects of the exchange interaction, we plot the absorption spectrum for the doping density 2.2×10^13 cm^-2 and QW thickness L=18.5 nm by calculating the density matrix elements from Eqs. (<ref>) which take into account the exchange terms as perturbation to the Hartree ground state. These equations include different exchange (Fock) terms, namely, those responsible for the frequency shift of intersubband transitions (the third row in Eq. (<ref>)) and for the coupling of coherences (the fourth row in Eq. (<ref>)), which can be taken into account independently. In Fig. <ref> we show the absorption spectrum when different terms are included. We can see that the blueshifted strong peak is mainly due to Hartree terms in the coupling. Slight blue shift produced by Fock terms in the energy renormalization is almost completely compensated by red shift caused by Fock terms in coupling. This effect of compensation can be explained by comparing different terms in Eqs. (<ref>)  taking into account expression (<ref>) for the overlap integrals V^ee_mnlp(q). It is obvious that both “Fock” sums in Eqs. (<ref>) (the third and the fourth rows) are mostly defined by terms proportional to coefficients V^ee_mnlp(q) which tend to infinity with q close to zero.  Such divergences can be avoided by taking into account the screening effect (see Appendix <ref>), but these terms are still prevailing in the sums. The coefficients  V^ee,s_mnlp(q)  in these terms have indices m=n, l=p and only weakly depend on them, so that they can be approximately written as V^ee,s_mnlp(q)∼.V^2D,s|_q=0δ_mnδ_lp×ℱ(q), where V^2D,s(q) is the two-dimensional Fourier transform of the screened Coulomb potential and  ℱ(q) is a positive-value dimensionless decaying function with characteristic decay scale equal to 1/L. Here the superscript s stands for screened. Leaving  only these dominant terms, the part of the overall sum responsible for the Fock energy renormalization is \n\n    .iħd/dtρ_nm(k)|_Fock energy renorm=\n    \n    -1/S∑_lp∑_qρ_pp(k+q)(V^ee_nppl(q)ρ_lm(k)-V^ee_lppm(q)ρ_nl(k))∼\n    \n       -1/S.V^2D,s|_q=0∑_qℱ(q)(ρ_nn(k+q)-ρ_mm(k+q))ρ_nm(k) ;\n \nwhereas the part of the sum which defines the exchange effects in coupling is given by \n\n    .iħd/dtρ_nm(k)|_Fock coupling=\n     -1/S∑_p≠ g∑_qV^ee_npgm(q)ρ_pg(k+q)(ρ_mm(k)-ρ_nn(k))∼\n       -1/S.V^2D,s|_q=0∑_qℱ(q)ρ_nm(k+q)(ρ_mm(k)-ρ_nn(k)).\n \n\nThe region of wave vectors k+q∈δk_nm, where the population difference (ρ_nn(k+q)-ρ_mm(k+q)) is far from zero, coincides  with the region where the coherence ρ_nm(k+q) is excited.  Replacing these quantities in this region by their mean values  ρ_nn(k+q)-ρ_mm(k+q)≈ρ_nn(k)-ρ_mm(k), ρ_nm(k+q)≈ρ_nm(k), we get the following estimations for the two exchange effects: \n\n    .iħd/dtρ_nm(k)|_Fock energy renorm∼ -1/Sρ_nm(k)(ρ_nn(k)-ρ_mm(k)).V^2D,s|_q=0∑_q,k+q∈δk_nmℱ(q)\n \n\n    .iħd/dtρ_nm(k)|_Fock coupling∼1/Sρ_nm(k)(ρ_nn(k)-ρ_mm(k)).V^2D,s|_q=0∑_q,k+q∈δk_nmℱ(q) .\n \nOne can see from here that the blue frequency shift due to Fock terms in energy renormalization and red shift caused by Fock terms in coupling are of the same magnitude but opposite sign and therefore nearly compensate each other.  Indeed, by order of magnitude |ρ_nn(k)-ρ_mm(k)|≤ 2 and .V^2D,s|_q=0∼πħ^2/m^*, where the last expression follows from screening theory presented in the Appendix <ref>. Furthermore, the number of electron states in the region of wave vectors k+q∈δk_ nm is of the order of  Sm^*/2πħω_mn. Then for the frequency shifts we get\n\n    Δ_Fock energy renorm≈ -Δ_Fock coupling∼ω_0× o((k_FL)^-1),\n \nwhere in notations of Section <ref> ω_0 is the average transition frequency, k_F is the Fermi wave number for a typical transition, and the small value o((k_FL)^-1) is defined by the decaying function ℱ(q). Each of these frequency shifts separately is smaller than ω_0 and their difference is even much smaller.  The result is confirmed by numerical calculations in Fig. <ref> and provides the rationale for neglecting the exchange terms when calculating the absorption spectra of highly doped QWs. \n\n\n\n  \n\n  \n   \n   \n   \n\n\n§ CONCLUSIONS\n\n\nWe presented a consistent theoretical explanation of the effect of Coulomb-induced collapse of multiple intersubband absorption peaks in highly doped quantum wells into one strong and extremely blueshifted peak. The theory is based on the density matrix equations taking into account pairwise Coulomb interactions of electrons within the Hartree-Fock (HF) approximation. We show that in the high-doping limit the optical response is described by linearly coupled 2N first-order differential equations for intersubband coherences, where N is the total number of the intersubband transitions.  Therefore, the observed spectra can be understood within an intuitive and transparent picture of self-synchronization in a system of N coupled oscillators, which has numerous analogies including the exact mechanical analogy. \nAnalytic expressions are obtained for the frequencies and oscillator strengths of the new collective normal modes of the system, renormalized by strong Coulomb interaction through the collective field.  In the high doping regime, Coulomb-induced synchronization leads to a merger of all intersubband absorption resonances into one sharp peak at the frequency substantially higher than all “bare” intersubband transitions and accumulating all their oscillator strength. \n\n\n \n\n\n§  THE HARTREE BASIS\n\n\nThe eigen functions of the Hartree Hamiltonian Eq. (<ref>) can be found from equation Eq. (<ref>) written in “bare” (single-particle) basis, using the expansion over the eigen functions of a single-particle Hamiltonian Ĥ^0,  φ_m(z)=∑_nc^n_mφ^0_n(z):\n\n    ∑_mH^H_nmc^m_l=E^H_lc^n_l,\n         \nwhere the matrix elements of the Hartree Hamiltonian in the “bare basis” are given by\n\n    H^H_nm=E^0_nδ_nm-N_2DṼ^ei_nm+∑_lpqρ_ll(c^p_l)^*c^q_lṼ^ee_nmpq.\n\nHere the overlap integrals Ṽ^ei_nm and Ṽ^ee_nmpq given by Eq. (<ref>) and Eq. (<ref>) are calculated over “bare” basic functions. ρ_ll=1/S∑_kρ_ll(k) is the Hartree subband population, which in the case of an equilibrium Fermi distribution should be self-consistently calculated as\n\n    ρ_ll=m^*/πħ^2(E_F-E^H_l),\n\nwhere E_F is Fermi energy and  \n\n    N_2D=∑_lρ_ll.\n \n\nEquations (<ref>)-(<ref>) can be used for numerical calculation of Hartree states in the case of known “bare” states.\n\n\n\n\n\n§  THE SUM RULE FOR NEW COLLECTIVE NORMAL MODES\n\n\nHere we prove that the sum of new “oscillator strengths” defined for the normal modes is equal to the sum of “oscillator strengths” in the system of uncoupled partial oscillators:\n\n    ∑^2N_t_l=1F̃_l=∑^2N_t_j=1F_j=1.\n\nTaking into account Eq. (<ref>) we can rewrite the first sum in the form \n\n    ∑^2N_t_l=1F̃_l=2m^*/e^2N_2DE^ω∑^2N_t_l=1Ω_lμ̃_̃l̃f̃^ω_l=2m^*/e^2N_2DE^ω∑^2N_t_l,jD_jlμ_j∑^2N_t_k=1B_lkf^ω_kΩ_l\n \nThen, using the relation D_jlΩ_l=∑^2N_t_iZ_jiD_il we obtain\n\n    ∑^2N_t_l=1F̃_l=2m^*/e^2N_2DE^ω∑^2N_t_ljikμ_jB_lkf^ω_kZ_jiD_il\n \nTaking into account the relation D_ij=(B^-1)_ij and Eq. (<ref>), the following transformation is possible:\n\n    ∑^2N_t_l=1F̃_l=2m^*/e^2N_2DE^ω∑^2N_t_jikμ_jf^ω_kZ_jiδ_ki=2m^*/e^2N_2DE^ω∑^2N_t_kμ_kf^ω_kω_k+2m^*/ħ N_2DE^ω∑^2N_t_jkμ_jf^ω_kI_jk'Δn_j.\n \nUsing Eq. (<ref>) and the natural assumption that one-dimensional basic functions are real, so that   I_jk'=I_jk,  it can be shown that the second sum is equal to zero: \n\n    2m^*/ħ N_2DE^ω∑^2N_t_jkμ_jf^ω_kI_jk'Δn_j=2m^*/ħ^2N_2D∑^2N_t_jkμ_jμ_kΔn_jΔn_kI_jk=\n \n\n    2m^*/ħ^2N_2D∑^2N_t_jμ_jΔn_j∑^N_t_k,ω_k>0 μ_k(Δn_kI_jk-Δn_kI_jk)=0.\n \nAs result, taking into account Eq. (<ref>), we obtain Eq. (<ref>).\n\n\n\n§  THE MECHANICAL MODEL OF “COULOMB SPRINGS”\n\n\nHere write the equations of motion for the model of mechanical oscillators shown in Fig. <ref>. We consider one-dimensional (along axis x) mirror-symmetric oscillation mode of “upper” (blue) and “lower” (yellow) masses m coupled in pairs by green springs, when their coordinates are equal in absolute value and have a different sign. Let N_t be a total number of such oscillators (in Fig. <ref> N_t=3). The grey “Coulomb springs” couple each “upper” mass with all “lower” masses and vice versa. The equations for the distances l_i between the two masses in each oscillator are\n\n    1/2md^2/dt^2Δl_i=-k_iΔl_i-KΔl_i-1/2∑_j≠ iK(Δl_i+Δl_j),\n \nwhere Δl_i=l_i-l_0,  l_0 is the equilibrium spring length, k_i are spring constants of green springs which define partial frequencies of oscillations ω_i=√(2k_i/m). Note that the “Coulomb springs” not only couple different oscillators but also strengthen the coupling between the masses within each oscillator. Under the condition of a large stiffness of “Coulomb springs” as compared with the stiffness of green springs, \n\n    KN_t≫ k_i\n \nthere is obviously a normal mode with in-phase motion of all oscillators  Δl_i=Δl:\n\n    d^2/dt^2Δl=-Ω^2_mΔl.\n \nIts frequency is defined by the relation  \n\n    Ω_m≈√(2K/mN_t).\n \nIt is analogous to Eq. (<ref>).\n\n\n\n\n§  THE SCREENING EFFECT OF HIGHER-ORDER CORRELATIONS\n\n\nBeyond the Hartree-Fock approximation, the screening effect coming from higher order correlations should be included. To do this we need to replace the overlap integrals of the Coulomb potential V^ee_mnlp(q) in Eq. (<ref>) with their screened values V^ee,s_mnlp(q) in accordance with the following relations <cit.>:\n\n    V^ee_mnlp(q)=∑_ijϵ_mjni(q)V^ee,s_ijlp(q) ,\n \nwhere\n\n    ϵ_mjni(q)=δ_miδ_nj-V^ee_mnji(q)Π^0_mn(q),\n \nwith\n\n    Π^0_mn(q)=lim_ε→ 0^+∑_kρ_mm(k+q)-ρ_nn(k)/(H^0_mm(k+q)-H^0_nn(k))-iε  .\n\nNote that we use static screening <cit.>, <cit.>.\n\nWhen the denominator in Eq. (<ref>) is zero, the numerator will also be zero, so we need to consider the ways these two limits are approached. If |q|→ 0 and m=n, and we have\n\n    Π^0_nn(q→ 0)=-m^*/2πħ^2ρ_nn(k=0).\n \nIf |q|≠ 0, the denominator in Eq. (<ref>) can still be zero, let us say at k=k_0, in which case  \n\n    ρ_mm(k_0+q)-ρ_nn(k_0)/(H^0_mm(k_0+q)-H^0_nn(k_0))=.∂ρ_nn(k)/∂ H^0_nn(k)|_k=k_0=.∂ρ_mm(k)/∂ H^0_mm(k)|_k=k_0+q.\n \nSo, the elements in the summation of Eq. (<ref>) are always well-defined.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}