{"entry_id": "http://arxiv.org/abs/2303.06652v1", "published": "20230312125429", "title": "Interpreting Hidden Semantics in the Intermediate Layers of 3D Point Cloud Classification Neural Network", "authors": ["Weiquan Liu", "Minghao Liu", "Shijun Zheng", "Cheng Wang"], "primary_category": "cs.CV", "categories": ["cs.CV"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nwqliu@xmu.edu.cn\n\n   Xiamen University\n   Xiamen\n   China\n   361005\n \n\n\n23020191153186@stu.xmu.edu.cn\n\n\tXiamen University\n\tXiamen\n\tChina\n\t361005\n\n\n\n\nzhengshijun@stu.xmu.edu.cn\n\n   Xiamen University\n   Xiamen\n   China\n   361005\n \n\n\ncwang@xmu.edu.cn\n\n   Xiamen University\n   Xiamen\n   China\n   361005\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlthough 3D point cloud classification neural network models have been widely used, the in-depth interpretation of the activation of the neurons and layers is still a challenge. We propose a novel approach, named Relevance Flow, to interpret the hidden semantics of 3D point cloud classification neural networks. It delivers the class Relevance to the activated neurons in the intermediate layers in a back-propagation manner, and associates the activation of neurons with the input points to visualize the hidden semantics of each layer. Specially, we reveal that the 3D point cloud classification neural network has learned the plane-level and part-level hidden semantics in the intermediate layers, and utilize the normal and IoU to evaluate the consistency of both levels' hidden semantics. Besides, by using the hidden semantics, we generate the adversarial attack samples to attack 3D point cloud classifiers. Experiments show that our proposed method reveals the hidden semantics of the 3D point cloud classification neural network on ModelNet40 and ShapeNet, which can be used for the unsupervised point cloud part segmentation without labels and attacking the 3D point cloud classifiers.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[500]Computing methodologies Computer vision\n[300]Theory of computation Theory of computation\n\n[100]Networks Network design principles, Network reliability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInterpreting Hidden Semantics in the Intermediate Layers of \n\n 3D Point Cloud Classification Neural Network\n    Cheng Wang*\n    \n===========================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\nNowadays, deep neural network (DNN) models have outstanding performance in various tasks, especially classification problems. However, the classifier acts as a black box, and it is not clear what the black box learns inside. \nContaining obscure features with high dimensions, it is difficult to understand the decision basis and process of 3D point cloud DNNs.\nThe obscurity impedes the manipulation and promotion of DNNs, so interpreting what the DNNs learn inside has become an important research field. \n\nCurrently, interpreting the hidden semantics of DNNs give a deeper insight into such a black box. As an intuitive, effective and comprehensive interpretation, hidden semantics shows the activation of neurons or layers inside the network, and associate the activation with the entities, such as lines, surfaces or parts of the input instance. The explicit hidden semantics clarifies the meaning of each neuron and layer, which helps to strengthen the trust of human beings for the network<cit.>, clarify the decision-making path of the network <cit.>, diagnose the disentangled representation of the network <cit.>, and promote the researches in other fields, such as transfer learning <cit.>, semi-supervised learning <cit.>. \n\n\n\n\nInterpreting hidden semantics is associating the abstract concepts with the activation of some hidden neurons or layers <cit.>, driven from grandmother cell hypothesis<cit.>. It hypothesizes that the grandmother cell, \"a hypothetical neuron that represents a complex but specific concept or object\"  is activated when a person \"sees, hears, or otherwise sensibly discriminates\" <cit.> a specific entity, such as their grandmother. Similarly, the interpretation of hidden semantics is to build the relation between the activation of neurons or layers and some kind of entities. The most direct way to interpret the hidden semantics is by visualizing what the neuron or layer is \"looking for\" with a saliency map, as shown in Figure <ref>. \n\n\n\nAlthough there is some interpretable works on 2D image classifier, it lacks complete research on 3D point cloud classifier. <cit.> showed the corner points contribute more to the classification output, but ignored the interpretation for the intermediate layers, which is the key to open the network black box and represent the learning process of each layer. Besides, current researches are impeded by the unsystematic evaluation criteria for interpretability. <cit.> evaluated the interpretability on internal and external consistency, however, both of them only focus on the max-pooling layer, ignoring a large number of convolutional layers, which is crucial for interpretation. In this case, we study on the interpretation and evaluation of hidden semantics in 3D point cloud classifier intermediate layers.\n\n\nIn this paper, we propose Relevance Flow to interpret the hidden semantics of each intermediate layer. Inspired by LRP <cit.> and FLOWN <cit.>, we construct a path from output to the input, allowing the Relevance, a value decomposed from the prediction, flows backward, so each activated neurons related to the prediction has a Relevance value. We firstly group the neurons with Relevance value and associate the grouped neurons in same layer to the input points, then visualize the result of each intermediate layer using saliency map. \n\nSpecifically, from the saliency map, we find the plane-level and part-level salient region of hidden semantics appear at intermediate layer in 3D point cloud classifier consistently. We propose utilizing the variance of the salient points normals and the point intersection over union (IoU) of the salient points to evaluate the consistency on the intermediate layers. \n\n\nIn addition, to represent the application of 3D point cloud hidden semantics, we part the segmentation of 3D point cloud sample in an unsupervised manner. We train the 3D point cloud classifiers with class labels only, and use the consistent plane and part level hidden semantics to construct part detector and realize part segmentation. Besides, we generate the adversarial samples by moving the salient regions of hidden semantics to attack 3D point cloud classifiers.\n\t\n\n\nExperimental results show that our proposed method reveals the the hidden semantics of intermediate layer in 3D point cloud classifier. We conduct the experiments with PointNet<cit.>, PointNet++<cit.>, and PointConv<cit.> framework on the ModelNet10<cit.> and ModelNet40 <cit.> datasets. We also evaluate both plane-level and part-level hidden semantics of the intermediate layers in PointNet++ on ModelNet40 and ShapeNet<cit.> datasets. \nBesides, experiments show that our method achieves the 71.3% mIoU on the ShapeNet part dataset, and  the attack success rate of PointNet is the highest, followed by PointConv and PointNet++.\n\n\nOur contributions are as follows: \n\n\n  * We propose Relevance Flow to interpret the hidden semantics of the intermediate layer in 3D point cloud classification neural networks.\n\n  * We propose the plane-level and part-level criteria to evaluate the consistency of the hidden semantics, which qualitatively descripts the interpretability of the 3D point cloud classification neural networks.\n\n  * Experiments show that the interpreted hidden semantics can be employed for unsupervised part segmentation task and adversarial sample generation task.\n\n\n\n\n\n\n\n\n\n\n\n\n§ RELATED WORK\n \n\n\n §.§ Interpretation of 2D image classifiers\n\nThe interpretation of 2D image classifiers usually based on attribution, hidden semantics and decision. \n\nAttribution studies the impact of the input on the prediction, and uses a saliency map, a mask of the same size of the input image, to visualize the contribution value of the pixels.  <cit.> used the gradient value as the basis of the score, and back propagate it from the output.  <cit.> transformed the gradient value to get better performance. These type of methods are easy for people to understand, but lack of the analysis on the network itself.\n\nHidden Semantics aims to explore the activation of the hidden neurons and layers. To explore the hidden semantics in 2D image classifiers, the most direct way is visualizing the semantics appeared in the neurons by training the input image. <cit.> visualized the appearance that maximized the activation of the given neurons. <cit.> refined the appearance into edges, textures, patterns, parts and objects. Due to the severe deformation, the appearance is unrecognizable for human beings. Instead of training the input images, <cit.> preserved readability in some way by blurring the input image, but it is still not intuitive. <cit.> is an activation method to show the explicit semantics by masking the filters, and <cit.> gave the application about the semantics. However, both of them rely on the interpretability of the original network. \n\nDecision represents the decision path of the 2D image classifiers, usually by graph<cit.> or decision tree <cit.>. <cit.> proposed the method visualizing the saliency map of each layers by constructing an activation path from the output to the input, and constructed the decision path. Compared with other methods based on decision, <cit.> is relatively simple, and shows the semantics of the hidden layers, which is easy to understand for human beings. Inspired by it, we propose the Relevance Flow to interpret the hidden semantics of the 3D point cloud classifiers. \n\n\n\n\n §.§ Interpretation for 3D point cloud classifiers\n\nAt present, there are few works interpreting the 3D point cloud classification neural networks. <cit.> analyzed the sensitivity of the network to the input 3D point cloud based on the gradient value. It points out that the network pays more attention to corner points, but the conclusion is only at the input level and lacks inter-layer research. Although <cit.> defined the inter and outer consistency for 3D point cloud classification neural network, but it lacks an in-depth interpretation to answer what have been learned in the intermediate layers and how the network makes its decision. In this  paper, we explore the answer by interpreting the hidden semantics in the intermediate layers.\n\nIn addition, to test the vulnerability of 3D point cloud classifiers, PointGuard<cit.> attacked the network by adding, deleting, and modifying the input points. However, it requires a lot of calculations on looking for the modified points, and the principle is relatively complicated, which is not suitable for real application. <cit.> used Shaply Value to study the sensitivity of the network to the input regions, which is more intuitive and concise than PointGuard, but it mainly focuses on the single sample, lack of quantified research on the class-level, such as which category is more likely to be attacked.\n\n\n\n\n\n§ METHOD\n\n\n\n §.§ Overview\n\nHidden semantics is designed to associate abstract concepts with the activation of some hidden neurons <cit.>, described in mathematical language as\n\n    r: act(x; θ) ∼ x\n\nwhere x is the input, and act(x; θ) represents the activation of the neurons or layers in the network. ∼ denotes the association between the activation and input, and r means the consistency of the association.\n\nWe manifest the interpreted hidden semantics of each intermediate layer of 3D point cloud classifier by saliency map, as shown in Figure <ref>.\n\n\n\nSample operation samples the input data as X_center = s(X), where the input data of size N × d denoted as X={x_1, x_2, ⋯, x_n}∈ R^N, and X_center means the sampled data with the size of C × d, where C represents the number of sampling. Group operation combines the center and its neighbors, so that the data is divided into several local regions. It conducts as X_c^' = g (X_center, X_c), where X_c = {x_c^1, x_c^2, ⋯, x_c^K}, and K is the number of neighbors. For each of the x_c^k ∈ X_c, g conducts as x_c^k-x_center. Conv operation convolves each Group separately as H_c = h (X_c^'), where the size of H_c is K × d^', and d^' depends on the depth of the convolution. Moreover, h concerns three operations: conv1D, conv2D, conv3D. Pooling operation compress all the data in each group and use less data for representation, following X^' = p (H_c), where x^' with the size of d^'. \n\nThe operations above are concluded as X^' = p ( h ( g(s(X),X) )), which conducted by a trained 3D point cloud classifier. Our method is also applicable to other modules of the 3D point cloud neural network, such as T-Net<cit.> and Attention module<cit.>. In order to demonstrate the principle of the method, we take the PointNet++ module as an example to illustrate.\n\n\n\n §.§ Relevance Flow\n\nAs shown in the Figure <ref>, the path constructed by the red arrow represent a process that Relevance flows from output to input. At first, we decompose the prediction into a vector as the manner of LRP<cit.> (decomposing the prediction of a deep neural network down to the relevance scores, which is a [0,1,0,0] vector, and only the position where the predicted value is largest with value 1, the rest are 0). Then starting from the output layer, the Relevance flows to the activated neurons in the previous layer FC (Fully Connected Layer) as the back propagation manner, but the propagated value is no longer the gradient (The propagated value is calculated with the formula detailed in the following paragraphs). Finally, the activated neurons relevant to the prediction have the Relevance value in FC layer. By analogy, the Relevance flows at input layer, and all activated neurons related to the predict have Relevance value.\n\n\n\n\n The Relevance value between the activated neurons and output prediction is represented as R. If the R value of a neuron is larger, it means that the neuron is more related to the output prediction. The R is calculated with the formula:\n\n    R_i = ∑_0^ja_iw_ij/∑_0^ia_iw_ijR_j\n\n\nwhere a_i is the activation value of the neuron_i, and w_ij is the weight of the neuron_i to the neuron_j in next layer. R_i is the relevance value of the neurons in current layer, and R_j is the relevance value of the neurons in next layer. ∑ means the current relevance of the activated neurons relies on all the activated neurons related to it. The w_ij is further described in the following paragraphs.\n\n For a trained 3D point cloud classifier, the formulas of Relevance Flow are as follows:\n\n\n\nIn Sample operation, showing in the Figure <ref>, w_ij=1, so\n\n    R_i = R_j\n\n\nIn Group operation, the grouped data is related to the value of center and the value of itself before grouping, with the condition a_i-a_center=a_j, the weight of a_i to a_j is 1, and the weight of a_center to a_j is -1. So the formula is\n\n    R_i = ∑_0^ja_center/a_center-a_iR_j\n\n\nIn Conv operation\n\n    R_i = ∑_0^ja_iw_ij/∑_0^ia_iw_ijR_j\n\n\nMaxpooling can be regarded as a fully connected layer, only the pooled data weights 1, and the rest is 0, following\n\n    R_i = \n    { \n    0         ,     j ≠ index\n     \n    R_j    ,     j = index \n    .\n\n\n\n\n\n\n §.§ Evaluation of Hidden Semantics\n\nThrough the saliency map of the interpreted hidden semantics, we find that there are plane-level and part-level hidden semantics appeared in the Intermediate layers of the 3D point cloud networks consistently. Therefore, in each of the layers separately, we ultimate the normals and IoU of the salient points to measure the consistence of the plane-level and part-level hidden semantics. \n\nTo evaluate the consistency of the plane-level hidden semantics, we ultimate the normals of the salient points in the salient maps of each layer, following\n\n    C_p = n_p/n_t\n\n\n    n_p = 𝕀_var(N_i)<γ\n\nwhere n_p means the number of qualified objects, which measured by the variance of the salient point normals N_i with a thread τ. n_t is the number of the total object in the same class. C_p represents the score of the plane-level consistency.\n\nTo evaluate the consistency of the part-level hidden semantics, we take the IoU as the criterion. Different from the segmentation task, we trained the network with class labels, and test the IoU using segmentation labels. The formula is \n\n    IoU = n_cor/n_cls + n_seg - n_cor\n\nwhere n_cor means the numbers of points with the correct match. n_cls represents the total numbers of the salient points, and n_seg represents the numbers of the points in the part segmentation area.\n\n\n\n\n §.§ Unsupervised Part Segmentation Using Hidden Semantics\n\nTo reduce the dependence on the label, we implement unsupervised 3D point cloud part segmentation using the hidden semantics, as shown in Figure <ref>.\n\n\n\nFirst, we train the 3D point cloud DNNs with class-level labels. Secondly, we use Relevance Flow to obtain the hidden semantics of the intermediate layers, and select qualified part-level hidden semantics as part detector. Finally, we combine each part detector to realize unsupervised part segmentation of 3D point cloud samples. \n\n\n\n §.§ Generation of Adversarial Attack Samples\n\nTo explore the robustness and vulnerability of the 3D point cloud DNNs, we generate adversarial attack samples and attack the network, making the output wrong. \n\nAt first, we sort the salient points according to their salient value w derived from Relevance Flow. \nSecondly, we pick up the top N points as the centers, and group their K neighbors to form the attacked regions.\nThen, we generate the adversarial attack samples by moving the attacked regions to the non-salient area.\nFinally, we input the adversarial attack sample to the network, and obtain the new classification results. If the result is inconsistent with the original category, the attack succeeds, otherwise it fails. The attack progress is shown in Algorithm <ref>.\n\n\n\n\n\n\n\n\n\n\n§ EXPERIMENT\n \n\n\n\n §.§ Hidden Semantics of the Intermediate Layer\n\nIn this section, we represent the hidden semantics of PointNet<cit.>,  PointNet++<cit.> and PointConv<cit.> frameworks using our proposed Relevance Flow method on ModelNet10<cit.> and ModelNet40<cit.> dataset. \n\n\nThe saliency map of the hidden semantics in the intermediate layer is shown in Figure <ref>. The salient values are divided into three levels ordered the given interval with [0, 1/3d, 2/3d, d], where d means the difference between maximum and minimum of the salient value. In Figure <ref>, the blue region is insignificant, the pink is more significant, and the red is the most significant. The network is trained strictly as the original setting, due to the space limitation, we only display the hidden semantics of the layers in PointNet++ with radius 0.1, more details are shown in the supplementary material.  \n\nFrom the learning process of hidden semantics, PointNet++ focuses on different parts of the instance while the attention become concentrated. From Figure <ref>, we can see that the attention of the shallow layer close to the input is scattered, such as the SA1-conv2 (the second convolutional layer in first sample and group module<cit.>). The network learns the surface structure, such as the top plane of table and guitar, as well as the top surface of lamp holder in the SA1-conv3. In the deeper layer, the focus of the classifier on the objects tends to be concentrated, like SA2-conv1 and SA3, focusing on a region, like chair seat, chair leg, table leg, guitar body, and lamp holder. \n\nHowever, in Figure <ref>, PointNet and PointConv focus on the similar parts of the instance with the progress of strengthening the concentration from shallow layer to deep layer. \nIn PointConv network, the attentions of conv1 to conv3 in SA1 module are more scattered, while focused in SA2 and SA3 modules. For example, the class \"guitar\", the pink and red dots locate at the its body and neck in SA1 module, but in SA2 the number of red dots is increase, and in SA3 module the red dots mainly locate at its neck.\n\n\n\n\n §.§ Comparison of Salient Region\n\n\nWe compare the trend of the proportion of salient regions with different thresholds on PointNet, PointNet++, and PointConv network, as show in Figure <ref>.\n\n\n\n\nFrom the aspect of trend, the proportion of PointNet salient region is decreased, and the proportion of PointConv salient region is increased under different thresholds setting. The proportion of PointNet++ salient region fluctuates, especially in the SA3 module, the proportion jumps significantly.\n\nConcerned about the diversity of hidden semantics, PointNet++ has diverse hidden semantic, containing different structures and parts of the instance in different layers, that is the reason we choose this framework to conduct the rest experiments on Section 4.3 and Section 4.4. \n\n\n\n\n\n §.§ The Consistency of Hidden Semantics\n\n\nThrough the experiments, we find the salient regions of different sample in same category appear consistently in some layers.\n\n\n\n\n\n\n\n\n\n\n\nEspecially, we find PointNet++ has learned the plane-level and part-level consistent hidden semantics on ModelNet40, as shown in Figure <ref> and Figure <ref>.\n\n\n\n\n\n\n\n\n\n\n §.§ Evaluation of Consistency\n\n\nDiscovering the plane and part level hidden semantics, we evaluates the semantics at both levels separately on ModelNet40<cit.> and ShapeNet<cit.> part datasets.\n\nAs shown in Table <ref>, we evaluate the plane-level consistency of PointNet++ on ModelNet40 dataset. We choose the thread τ as 0.15, which can detect the plane structure with a fine range. Because of the limit of paper, we display the maximum C_p in each of the layer, which mainly comes from the SA1-layer3, and the whole data is detailed in the supplementary material.\n\n\n\n\n\n\n\nTable <ref> shows the part-level hidden semantics of the intermediate layers in PointNet++ framework on  ShapeNet . We only trained the network with the 16 class labels represented in first row, and test the IoU with the 49 segmentation labels partially represented in second row, detailed in the supplementary material. \n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Unsupervised Part Segmentation Using Hidden Semantics\n\nWe achieve unsupervised part segmentation using the plane-level hidden semantics of PointNet++ on ModelNet40. After getting the salient region, composed by the salient points, the bounding box of the salient segmentation is attained. Utilizing the bounding box, as a 3D-mask, it easy to divide the object into different parts, as shown in Figure <ref>. \n\nWe also conduct the part segmentation experiment on the ShapeNet part dataset. We trained the PointNet++ models without the segmentation lables, and feed the category labels only. Then we get the salient map as the part detector, as shown in Figure <ref>, of each layers by interpreting the hidden semantics of the network using our proposed Relevance Flow. Using the part detector of each layer, it is feasible to realize part segmentation. We calculate the mIoU of each category with the original sementation labels, as shown in Table <ref>. Compared with the state-of-the-art in point cloud part segmentation, our method get lowwer mIoU. The reason is that our method relies on the quality of the hidden semantics, however, without any part-level supervised learning, obtained from classification network, the hidden semantics is not a truly segmentation mask, as shown in Figure <ref>. The better effect requires subsequent improvements and restrictions on the training process. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Adversarial Attack Based on Hidden Semantics\n\n\n\n\n\n\nSuccess Rate and Time of Attack We conduct adversarial attack experiments on PointNet, PointNet++, and PointConv networks with dataset ModelNet10 and ModelNet40. \n\nThe result is show in Table <ref>, 'Ours' means using our method to pick up the centers of attacked regions, and 'Random' means picking up the centers of attacked regions randomly. \nIt shows that 'Ours' has higher success rate and lower time time consume than 'Random'. \nIn terms of attack success rate, PointNet has the highest attack success rate, followed by PointConv, and PointNet++ is the lowest. It means that PointNet++ and PointConv networks are more robust and more resistant to avoid attack than PointNet. \nIn terms of attack time, the time to attack PointNet is the shortest, followed by PointConv, and PointNet++ is the longest, because PointNet++ has the highest network complexity and the longest forward propagation time.\n\n\n\n\n\nTable <ref> shows the attack success rate and time in each of the class on PointNet. The number of regions is 5, and the number of neighbor points is 40. The 'Accuracy' refers to the classification accuracy of target category. 'Ours' means using our method to pick up the centers of attacked regions, and 'Random' means picking up the centers of attacked regions randomly. \"Rate\" means the success rate of adversarial attack, and 'time' refers to the time to generate an attack sample and attack the network at once. Table <ref> also shows the better performance of our method in attack success rate and efficiency.\n\n\n\n\n\nThe Impact of the Set of Attack Region We explore the impact of the number of attack region and the range of neighborhood on the attack result of PointNet network.\n\nFigure <ref>. shows the success rate varies with different attack region number N with the value: 1, 5, 10, 15, and 20. The abscissa in the figure represents number of regions, and the ordinate means the value of success rate, and different colors represent with different neighborhood range. \n\n\n\n\nIn general, The Figure <ref> shows that the attack success rate of PointNet increases with the increase of the number of attack region and the range of neighborhood.\n\n\n\n§ CONCLUSION\n\nIn this paper, the Relevance Flow, an interpretation method for 3D point cloud classification neural network, is proposed to interpret hidden semantics of the intermediate layers, and the saliency map is used to show the hidden semantics. Our proposed method reveals a explicit hidden semantics of different layers in PointNet, PointNet++ and PointConv frameworks. Particularly, we reveal the plane and part level hidden semantics in the intermediate layers of 3D point cloud classification neural network on the ModelNet40 and ShapeNet datasets. We use the normals and the IoU of salient points to evaluate the consistency of hidden semantics at both plane and part level. \nBeside, we part the segmentation of 3D point cloud using the hidden semantics in the intermediate layers with unsupervised manner, and generate the adversarial samples to attack the 3D point cloud DNNs.\nExperiment shows that the plane-level and part-level hidden semantics can be retrofitted for unsupervised point cloud part segmentation with the trained classification neural network, and the attack success rate of PointNet is the highest, followed by PointConv and PointNet++.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nACM-Reference-Format\n\n\n\n\n\n\n"}