{"entry_id": "http://arxiv.org/abs/2303.06649v1", "published": "20230312124319", "title": "Location-based Physical Layer Authentication in Underwater Acoustic Communication Networks", "authors": ["Waqas Aman", "Saif Al-Kuwari", "Marwa Qaraqe"], "primary_category": "eess.SP", "categories": ["eess.SP"], "text": "\n\n\n\n\n\nLocation-based Physical Layer Authentication in Underwater Acoustic Communication Networks\n    \n\nWaqas Aman1, Saif Al-Kuwari1, Marwa Qaraqe1 \n1Division of Information and Computing Technology, College of Science and Engineering, \nHamad Bin Khalifa University, Qatar Foundation, Doha, Qatar. \nwaqasaman87@gmail.com, smalkuwari@hbku.edu.qa, mqaraqe@hbku.edu.qa\n\n    \n============================================================================================================================================================================================================================================================================\n\n\n\n\n \nResearch in underwater communication is rapidly becoming attractive due to its various modern applications. An efficient mechanism to secure such communication is via physical layer security. In this paper, we propose a novel physical layer authentication (PLA) mechanism in underwater acoustic communication networks where we exploit the position/location of the transmitter nodes to achieve authentication. We perform transmitter position estimation from the received signals at reference nodes deployed at fixed positions in a predefined  underwater region. We use time of arrival (ToA) estimation and derive the distribution of inherent uncertainty in the estimation. Next, we perform binary hypothesis testing on the estimated position to decide whether the transmitter node is  legitimate or malicious. We then provide closed-form expressions of false alarm rate and missed detection rate resulted from binary hypothesis testing. We validate our proposal via simulation results, which demonstrate errors' behavior against the link quality, malicious node location, and receiver operating characteristic (ROC) curves.  We also compare our results with the performance of previously proposed fingerprint mechanisms for PLA in underwater acoustic communication networks, for which we show a clear advantage of using the position as a fingerprint in PLA.\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nUnderwater acoustic communication has gained significant attention due to its promising applications in marine life exploration, natural resource finding, underwater navigation, and military operations <cit.>. Recently, a considerable amount of research has been conducted to explore innovative approaches from design to signal processing techniques of underwater acoustic communication <cit.>. However, the broadcast nature of underwater acoustic communication makes it vulnerable to many types of malicious attacks <cit.>. One of the prominent attacks is the impersonation attack (also called spoofing), where a malicious node aims to mimic one of the legitimate nodes of the network in order to get access and compromise the integrity of the system  <cit.>. Traditionally, such attacks were countered using pre-defined secrets (also called passwords or keys) secured via different encrypted algorithms <cit.>. However, recent advances in computational resources and\nquantum computing may potentially jeopardize these crypto-based solutions <cit.>. Consequently, physical layer authentication (PLA), where physical layer features serve as device fingerprints. is becoming an attractive alternative approach to cryptography-based authentication. Both channel and hardware-based features can be used for PLA. Such hardware features include I/Q imbalance <cit.> and carrier offsets (phase and frequency) <cit.>  while channel features include pathloss <cit.>, channel impulse response (CIR) <cit.>, channel frequency response <cit.> and received signal strength <cit.>. \n\n\nTo counter the impersonation attack in underwater  acoustic communication networks, several works were recently published considering PLA <cit.>.\nTo the best of our knowledge, the first work exploiting distance and angle of arrival as device fingerprints for PLA in underwater acoustic sensor networks is reported in <cit.>, where closed-form expressions for error probabilities are derived. Similarly, the authors in <cit.> study the power delay profile of underwater acoustic channels using a deep reinforcement learning approach to detect impersonation. Adopting a different approach, the authors in <cit.> report two angles of arrival (azimuth and elevation) to counter impersonation in line-of-sight underwater acoustic communication. Recently, the authors in <cit.>  report time reversal resonating strength-based PLA in underwater acoustic sensor networks.\n\n\nIn this paper, we investigate how the physical position/location of the transmitting node can be used as a device fingerprint to detect impersonation attacks at the physical layer in underwater acoustic communication networks.  Although, the authors in <cit.> use position for authentication, they assumed that the estimates of the position of the transmitter nodes are already available at the receiver, which is a strong and unrealistic assumption. Instead, in this paper, we relax that assumption and for the first time, we systematically exploit the position of the transmitter node for authentication. We provide a step-by-step procedure for position-based PLA from estimation to hypothesis testing. To the best of our knowledge, this location-based authentication process has not been explored in terrestrial wireless communication networks either. The detailed contributions of this paper are as follows:\n\n    \n  * We used time of arrival (ToA) based localization to extract the coordinates of the transmitting node. For this, we use the best-unbiased estimator for ToA estimation <cit.>. We then find the distribution of the inherent uncertainty in the estimation process.\n    \n  * We build a test statistic for binary hypothesis testing in order to decide whether the estimated position belongs to a legitimate node or a malicious node. We derive the distributions of conditional events (i.e., test statistic given legitimate or malicious transmissions) and provide closed-form expressions for the two error probabilities: false alarm rate (FAR) (the probability of classifying a legitimate node as a malicious node) and missed detection rate (MDR) (the probability of classifying malicious  node as a legitimate node).\n\nWe use simulation-based evaluation to validate our proposed techniques. \n\n\n\n\n\nThe rest of this paper is organized as follows: Section <ref> presents our system model, and  Section <ref> presents the proposed PLA mechanism. We evaluate our proposals using simulation and present the results in Section <ref>. Finally, the paper concludes in Section <ref> with a few concluding remarks and future directions.\n\n\n\n\n\n§ SYSTEM MODEL\n\n\nWe consider an underwater scenario as depicted in Fig.<ref>, which consists of two static transmitting nodes, namely: legitimate Autonomous Underwater Vehicle (AUV) and a malicious AUV, and L number of reference nodes, that are used to estimate the position of transmitter AUVs. We assume that the reference nodes are perfectly synchronized and connected to the ground station or surface ship via a secure channel. \n\nIn this scenario, we build a one-way authentication system, where the malicious AUV is an intruder that occasionally sends malicious packets to the system while trying to impersonate the legitimate AUV. This means that  a systematic framework is needed to authenticate the sender of every packet being generated by the transmitting nodes, which will allow the ground station to reject packets from the malicious node. We consider a range-based localization technique (i.e., time of arrival (ToA)) to extract position coordinates from the received signals at the reference nodes. \n\nWe assume that the one-way authentication channel in Fig. <ref> is time-slotted. That is, packets arrive at the reference nodes at discrete-time instants t_m where t_m-t_m-1=T is the time gap between two successively received packets at reference nodes. We further assume that malicious AUV transmits with the same transmit power as legitimate AUV in order to stay stealthy in the environment; increasing the power can easily make their transmissions detectable. We also assume that all the L reference nodes are in line-of-sight with the transmitting node as per the requirements of position estimation.\n\n\nUnless specified otherwise, ‖ .‖_2 denotes euclidean norm, boldface lowercase letter (i.e., 𝐱) and uppercase letter (i.e., 𝐗 ) denotes vector and matrix respectively, subscript ._A and superscript .^A is used to indicate legitimate node while ._E and .^E is used to indicate malicious node, ∼𝒩(.,.),  ∼U(.,.) and ∼Γ(.,.) represent distributed as normal, uniform and gamma respectively. Finally, (.)^T is transpose operator, 𝔼[.] is expectation operator and P(.) denotes probability.\n\n\n\n\n\n\n§ PROPOSED PHYSICAL LAYER AUTHENTICATION FRAMEWORK\n\n\nThe proposed PLA mechanism comprises two steps: first, we estimate the position of the transmitter from its transmitted symbols using a range-based localization technique. Next, we do binary hypothesis testing on the estimated position to detect any impersonation attacks. In this section, we discuss these steps in detail.\n\n\n\n\n §.§ Position estimation\n\nPosition estimation is done via a range-based localization technique, where we use multiple reference nodes (also known as reference nodes) with known coordinates to estimate the distances separating them from the transmitter node based on ToA estimation.  Then, we extract the transmitter's coordinates from the reference nodes' estimated distances by solving the least square problem. \n\n\n\n\n  §.§.§ Distance Estimation\n\nLet t_i be the time of arrival (ToA) of a signal at the i-th reference node. We exploit the findings of <cit.> to estimate ToA of the transmitter nodes  in the presence of heavily frequency-dependent pathloss and colored noise using a best-unbiased estimator (i.e., meeting Crammer Rao bound (CRB)). Specifically, the distance between the transmitter node and the i-th reference node is estimated using the following distance equation:\nd̂_̂î=ct̂_i,   \nwhere c is the speed of sound in water, t̂_i ∼𝒩(t_i,σ̂_i^2) is the estimated ToA with t_i is the actual time of arrival and σ_i^2 is the variance of the best unbiased estimator <cit.>, which can be expressed as:\n\n    σ̂_i^2 =  P_n PL_i(f)/4P𝐬^𝐓𝐂^-1𝐬,\n\nwhere P is the transmit power, P_n is the noise power,  c is the underwater speed of sound, 𝐂 is the covariance matrix of colored noise. 𝐬 is the partial derivative of the pseudo-random sequence 𝐬[A random sequence or message a transmitter needs to transmit for ToA estimation <cit.> at the reference nodes.]. The estimated distance can be written as: d̂_i^2=d_i+n_i,\nwhere d̂_̂î is the estimated distance, d_i is the true distance of transmitter to the i-th reference node, n_i∼𝒩(0,σ_i^2)  is the uncertainty/noise in the estimator with variance σ_i^2= c^2 P_n PL_i(f)/4P𝐬^𝐓𝐂^-1𝐬. The pathloss PL_i(f) of a transmitter to i-th reference node is given as <cit.>:\n\n    PL_i(f)_[dB]= ν 10log_10(d)+dα(f)_[dB],\n\nwhere α(f)_[dB]=0.11f^2/1+f^2+44f^2/4100+f^2+2.75× 10^-4f^2+0.003 with f as operating frequency.\n\n\n  §.§.§ Coordinates Extraction\n\nUsing the definition of the standard Euclidean distance [The distance between two points in euclidean space is the euclidean norm of the difference of position vectors of that two points.], d_i can be written as: d_i^2=(x-x_i)^2+(y-y_i)^2. Assuming a high SNR regime we can write d̂_̂î^2≈(d_i+n_i)^2=d_i^2+2n_id_i.\nNow  d̂_̂î^2 in a 2D space can be expressed as\n\n    d̂_̂î^2=(x-x_i)^2+(y-y_i)^2+2n_i((x-x_i)^2+(y-y_i)^2)^1/2.\n\nNow for all ”i_s” the equation set resulted from the above equation can be written in a matrix-vector form as:\n𝐀𝐱+𝐧=𝐛,\nwhere \n\n    𝐀=-2\n    [  x_1  y_1 -0.5;    .    .    .;    .    .    .;  x_L  y_L -0.5 ] ,  𝐧=2\n      [ n_1d_1;      .;      .; n_Ld_L ], \n    𝐱=[       x;       y; x^2+y^2 ] and 𝐛=[ d̂_̂1̂^2-x_1^2-y_1^2;                    .;                    .; d̂_̂L̂^2-x_L^2-y_L^2 ].\n\nWe can verify that 𝔼[𝐧]=0, therefore the above matrix-vector form can be approximated as: \n\n    𝐀𝐱≈𝐛.\n\nEq. <ref> leads us to a least square problem, where the solution for 𝐱 can be obtained as\n\n    min_𝐱‖𝐛-𝐀𝐱‖_2^2\n    =min_𝐱(𝐛-𝐀𝐱)^T(𝐛-𝐀𝐗).\n\nOne can verify that Eq. <ref> is a convex function. To find the minimum we take the gradient ∇_𝐱 and equate it to zero gives us\n \n    𝐱=(𝐀^T𝐀)^-1𝐀^T𝐛,\n\nwhere (𝐀^T𝐀)^-1𝐀^T=𝐀^† also known as pseudo inverse of 𝐀.\nAs we are only interested in the x and y components of 𝐱, the desired vector can be written as:\n𝐱̂=[x(1)  x(2)]^T.\nNext, we derive the distribution of 𝐱̂.\nAs 𝐀^† is a 3*L dimension matrix and we know that our desired component of 𝐱 lies in 𝐱̂. Now, let 𝐀̂^†=𝐀_2*L^†, then Eq. <ref> can also be re-written as:\n𝐱̂=𝐀̂^†𝐛,\nOr, more precisely, the extracted coordinates  𝐱̂ can be split into two terms (i.e., actual and uncertainty) as:\n\n    𝐱̂=𝐀̂^†[ d_1^2-x_1^2-y_1^2;                 .;                 .; d_L^2-x_L^2-y_L^2 ]_True  Co-ordinates + 2𝐀̂^†[ n_1d_1;      .;      .; n_Ld_L ]_Uncertainty.\n \n\n\n\n\n\n\n §.§ Binary Hypothesis Testing\n\n Let 𝐱̂_A be the actual coordinates vector of the legitimate node and 𝐱̂_E of the malicious node. H_0 is the hypothesis (also known as a null hypothesis) that the legitimate node is the transmitter while H_1 is the hypothesis (also known as an alternate hypothesis) that malicious node is the transmitter. Then we define a test statistics TS as:\n \n \n    TS=‖ ((𝐀̂^†)^T𝐀̂^†)^-1(𝐀̂^†)^T( 𝐱̂-𝐱̂_A )‖_2^2.\n\nNow, the binary hypothesis test can be defined as \n\n    H_0 (no impersonation):    TS=‖𝐀̂^††( 𝐱̂-𝐱̂_A ) ‖_2^2. < ϵ_th\n    H_1 (impersonation):    TS=‖𝐀̂^††( 𝐱̂-𝐱̂_A ) ‖_2. > ϵ_th,\n\nwhere 𝐀̂^††=((𝐀̂^†)^T𝐀̂^†)^-1(𝐀̂^†)^T, and ϵ_th is a predefined threshold. \nEquivalently, we have:\n\n    TS≷_H_0^H_1ϵ_th.\n\nAt this stage, we need to find the error probabilities in terms of FAR and MDR. FAR can be defined as the probability that the binary hypothesis test decides a legitimate node as a malicious node while the MDR is the probability that the binary hypothesis test decides a malicious node as a legitimate node. The FAR P_fa can be expressed as:\n\n    P_fa=P(TS|H_0 > ϵ_th).\n\nTo compute the above probability we need to find the distribution of the conditional event TS|H_0, which can be expressed as:\n\n    TS|H_0   =‖𝐀̂^††(𝐱̂_A+𝐧_A-𝐱̂_A) ‖_2^2=‖𝐀̂^††𝐧_A‖_2^2 \n       =4( (d_1^An_1^A)^2+(d_2^An_2^A)^2+...+(d_L^An_L^A)^2 ) \n       = ∑_i=1^L (2 d_i^An_i^A)^2 = ∑_i=1^L  (n̂_i^A)^2,\n\nwhere 𝐧_A=2𝐀̂^†[ n_1^Ad_1^A     .        .        n_L^Ad_L^A ] ^T with d_i^A where i ∈{1...L} denotes the distance of legitimate node from i-th reference node and n̂_i^A =(2d_i^An_i^A)∼𝒩(0,4(d_i^A)^2(σ^A_i)^2), ∀ i.  One can find (n̂_i^A)^2 ∼Γ(1/2, 8(d_i^A)^2(σ^A_i)^2). Finally, Eq. <ref> is summation of total L gamma random variables with same shape parameter 1/2 and different scale parameter 8(d_i^A)^2(σ^A_i)^2.\n  So, the probability of false alarm can be computed as <cit.>:\n  \n  \n    P_fa  =√(1/2)∏_i=1^L √(1/κ_i) H_L+1,L+1^0,L+1[ e^ϵ_th|Ξ_L^1, (1,1,1)\n    Ξ_L^2, (0,1,1)\n    ],\n\n  where κ_i=8(d_i)^2(σ_i^A)^2, H_(.),(.)^(.),(.) is the Fox-H function, Ξ_L^1 and Ξ_L^2 represent the bracket terms as: \n  \n    Ξ_L^1= (1-0.5/8(d_1^A)^2(σ_1^A)^2,1,0.5),...(1-0.5/8(d_L^A)^2(σ_L^A)^2,1,0.5)\n\n  \n    Ξ_L^2= (-0.5/8(d_1^A)^2(σ_1^A)^2,1,0.5),...(-0.5/8(d_L^A)^2(σ_L^A)^2,1,0.5).\n\n \n  \nTo find the probability of missed detection, we need to find TS|H_1, which can be expressed as \n  \n    TS|H_1   =‖𝐀̂^††(𝐱̂_E+𝐧_𝐄-𝐱̂_A) ‖_2^2=‖𝐀̂^̂†̂†̂𝐧_𝐄+𝐝_𝐄𝐀‖_2^2 \n       =4( (d_1^En_1^E+(d_1^E)^2-(d_1^A)^2)^2+... \n       ..+((d_L^En_L^E)+(d_L^E)^2-(d_L^A))^2) \n       = ∑_i=1^L (2 d_i^Eσ_i^En̂_i^E)^2 \n     = ∑_i=1^L (2 d_i^Eσ_i^E)^2 χ_1^2(λ_i)\n\n  where 𝐧_E=2𝐀̂^†[ n_1^Ed_1^E     .        .        n_L^Ed_L^E ] ^T with d_i^E where i ∈{1...L} denotes the distance of malicious node from i-th reference node, n̂_i^E ∼𝒩(λ_i,1), ∀ i with λ_i=(d_1^E)^2-(d_1^A)^2/σ_i^E, χ_1^2(λ_i) denotes non-central chi-square random with 1 degree of freedom and non-centrality parameter λ_i  and 𝐝_𝐄𝐀=[ (d_1^E)^2-(d_1^A)^2     .        .       (d_L^E)^2-(d_L^A)^2 ] ^T. Finally, TS|H_1 is weighted sum of L non-central chi square random variables,\n  hence, the computed probability of missed detection P_md=P(TS|H_1 < ϵ_th) can be expressed as <cit.>:\n  \n \n    P_md= e^-ϵ_th/2β/(2β)^L/2ϵ_th^L/2/Γ (L/2+1)∑_k≥ 0k!ζ_k/(L/2+1)_k𝕃_k^L/2((L+2)ϵ_th/4βμ_0),\n\n  with β >0, μ_0 >0, ζ_k=∑_j=0^k-1ζ_j ξ_k-j/k, γ_i=4(d_i^E)^2(σ_i^E)^2,,\n  \n    ζ_0=2(L/2+1)^L/2+1exp-1/2∑_i=1^L λ_i γ_i (L/2+1-μ_0)/βμ_0+γ_i (L/2+1-μ_0)∙\n       β^L/2+1/L/2+1-μ_0)∏_i=1^L (βμ_0+γ_i (L/2+1-μ_0))^-1/2\n       ξ_j=-jβ(L+2/2)/2μ_0∑_i=1^L λ_i γ_i(β-γ_i)^j-1 (μ_0/(βμ_0+γ_i (L+2/2-μ_0)))^j+1\n       +(-μ_0/L/2+1-μ_0)^j+1/2(μ_0(β-γ_i)/(βμ_0+γ_i (L/2+1-μ_0)))^j+1,\n\n   Γ(.) indicates gamma function, 𝕃_k^. is the k-th  generalized Laguerre polynomial. \n\n\n\n\n\n\n\n\n§ SIMULATION RESULTS\n\n\nWe use Matlab to develop the simulations presented in this section. We consider a rectangular area of 1000×1000 m^2, with L total number of reference nodes, a legitimate AUV is fixed at origin (i.e., X_A=[0,0]). To obtain a more realistic result, we use the specifications of a commercially available acoustic modem <cit.>. Specifically,  we set the center frequency f=22KHz, transmission power P=100W, speed of sound c=1500m/s, 10 kHz of bandwidth and spreading factor ν=1.5. We chose two values for reference nodes, L=3  and 5, where L=3 is the minimum number of reference nodes required for ToA-based estimation. The upper limit can be any number greater than 3 but we chose  L=5 for this simulation. We fix the positions of reference nodes to [0,500], [-500,-500], [500,-500], [-500,500] and [0,-500].\n\n\n\n §.§ Error behavior against LQ\n\nWe choose link quality LQ=P/P_n (i.e., signal power to noise power ratio) as a controlled parameter or independent variable\n\nto generate Figs. <ref> and <ref>. For both figures, we sweep LQ from -10 dB to 20 dB, where -10 dB means noise power is 10 times the signal power and 20 dB means signal power is 100 times noise power.\nWe set L=3, and the position of malicious AUV for Figs. <ref> and <ref> as a random variable  uniformly distributed in a bounded region around X_A (i.e., X_E=[∼ U(-500,500m), ∼ U(-500,500m)]). We compare our mechanism with the performance of previously utilized fingerprints, i.e.,  distance <cit.>, angel-of-arrival <cit.> and CIR <cit.> [The fingerprint used in that work is time reversal resonating strength, which is a derived fingerprint from the fundamental CIR]. Note that due to multiple reference nodes, the minimum probability of error is considered among L probabilities for all the other fingerprints.\n\n\nFig. <ref> demonstrates the trend of the probability of false alarm  for different fingerprints with the increase in LQ. We can clearly observe that increase in LQ  lowers the FAR. This is due to the fact that the increase in LQ shrinks the variances σ_i^2 of the i-th estimator (Eq. <ref>),  which makes the estimated features close to the actual features <cit.>. We also observe that the performance of the position is the best among the others. One can rank the fingerprints in terms of strength as position, CIR, angle of arrival, and distance from strong to weak. \nOn the other hand, there is a clear trade-off between FAR and MDR when varying the threshold ϵ_th, as can be seen in the results below.\n\n\nFig. <ref> demonstrates the behavior of MDR against LQ. We observe that the probability of missed detection P_md decreases with the increase in LQ and the hypothesis testing threshold ϵ_th has a negative impact on P_md. This is due to the fact that ϵ_th extends the acceptance range around actual fingerprints of legitimate AUV X_A, which makes some of the noisy estimates of malicious AUV's transmissions appear in the acceptance range of legitimate AUV. \nGenerally, in PLA, MDR is more important than FAR because it is the probability of accepting malicious transmissions. In Fig. <ref>, we can see the actual strength of using the position as a fingerprint for PLA. We can see that MDR for using position is almost zero. In other words, it means that it is nearly impossible for a malicious node to clone the position of a legitimate AUV unless it collides with the legitimate AUV, or, uses high transmission power, but both scenarios will render the malicious node detectable. On the other hand, distance can be cloned while staying away from the legitimate AUV, the angle can also be cloned <cit.>, and due to the lack of scatters under the water, it is very likely that the two nodes away from each other have the same or closed CIRs as they have the same multi-paths structure.   Furthermore, we observe that the larger the value of ϵ_th the lower the FAR, but at the same time we get a larger MDR. This means that we can not minimize both errors at the same time (we need to trade off one for the other).\n\n\n\n\nNext, to have a more detailed evaluation of our proposed mechanism, we generate Figs. <ref> and <ref>.\n\n\n §.§ Impact of malicious AUV location\n\n To see the impact of near and far location of malicious AUV, we generate Fig. <ref>. In this plot, R is the distance/radius of a circle from the center/X_A, and malicious AUV is placed randomly at the circle of radius R. For better exposition, we set the Y-axis to log scale. Surprisingly, we observe that when a malicious node is close to the actual node for fixed values of ϵ_th and L, increasing LQ produces high MDR (which can be seen in Fig. <ref>) but quickly gets back to normal behavior (i.e., more LQ produces low MDR) as the malicious AUV goes farther away from X_A. We suspect that this abnormal behavior is due to the fact that more LQ means the noisy estimates are close to the true value and thus when malicious AUV is very close to legitimate AUV, the noisy estimates of malicious AUV are close to legitimate AUV, which is classified by hypothesis testing as legitimate AUV. We leave finding the exact position of malicious AUV from where the abnormal behavior starts as a future work. \n\n\n\n §.§ ROC\n\n\n\nReceiver operating characteristic (ROC) curves are important to evaluate PLA. Fig. <ref> presents the ROC of the proposed PLA mechanism. It is generated by carrying out an exhaustive search over ϵ_th and recording P_fa and P_md. Fig. <ref> shows a relation between the probability of detection P_d=(1-P_md) and FAR for two different locations (i.e., Loc1  X_E=[1m,1m] and Loc2 X_E=[2m,2m]) of malicious AUV and total number of reference nodes L. The upper subplot is generated for LQ=0dB while the lower subplot is generated for LQ=10dB. We observe that increasing LQ produces a high detection rate for low FAR. L has a similar effect on the detection rate as we see in the last figures, an increase in L produces a high detection rate. As expected we observe the impact of malicious node location on ROC, a malicious node near to legitimate node (i.e., Loc1) produces lower ROC than a farther location (i.e., Loc2). These ROC curves attest to the efficacy of using the position as device fingerprint for PLA where we can see that for moderate link quality LQ=10dB and 10% FAR, we achieve 100 % detection rate when malicious AUV is just 1m away from legitimate AUV. \n\n\n\n§ CONCLUSION\n\n\nIn this paper, we studied physical layer authentication (PLA) based on the position of the transmitting node. The position is estimated based on time of arrival (ToA) estimation for which the best-unbiased estimator was used. The distribution of uncertainty in estimation was derived. Further, to counter impersonation, binary hypothesis testing was used to classify the transmissions of transmitters into legitimate or malicious transmissions. The closed-form expression for errors resulting from hypothesis testing was derived. The simulation results were compared with the performance of other fingerprints utilized for PLA in the previous work. We observed from the simulation results that position can be used as a device fingerprint for PLA and it is superior to other fingerprints (particularly, in terms of MDR). In particular, the ROC curves obtained from our simulation show that for low false alarm and reasonable link quality, 100 % probability of detection can be achieved. Future extension of this work will consider PLA for mobile transmitters.\n\n\n\n§ ACKNOWLEDGEMENT\n\nThis work is partially funded by the G5828 “SeaSec: DroNets for Maritime Border and Port Security\" project under the NATO Science for Peace and Security Programme.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIEEEtran\n\n\n\n\n\n"}