{"entry_id": "http://arxiv.org/abs/2303.06642v1", "published": "20230312120221", "title": "Frugal Computing -- On the need for low-carbon and sustainable computing and the path towards zero-carbon computing", "authors": ["Wim Vanderbauwhede"], "primary_category": "cs.CY", "categories": ["cs.CY", "K.4.m"], "text": "\n\nGeneral Boolean Formula Minimization\n with QBF SolversThis project has received funding from the European Union’s Horizon 2020 research and innovation program under the Marie Skłodowska-Curie grant agreement No. 860621 and the MICINN project PROOFS\n(PID2019-109137GB-C21).\n    Eduardo Calò10000-0003-3881-8994 \nJordi Levy20000-0001-5883-5746\n\n    \n================================================================================================================================================================================================================================================================================\n\n\n \n The current emissions from computing are almost 4% of the world total. This is already more than emissions from the airline industry and are projected to rise steeply over the next two decades. By 2040 emissions from computing alone will account for more than half of the emissions budget to keep global warming below 1.5°C. Consequently, this growth in computing emissions is unsustainable.\n The emissions from production of computing devices exceed the emissions from operating them, so even if devices are more energy efficient producing more of them will make the emissions problem worse. Therefore we must extend the useful life of our computing devices.\n\n\nAs a society we need to start treating computational resources as finite and precious, to be utilised only when necessary, and as effectively as possible. \n\nWe need frugal computing: achieving our aims with less energy and material. \n \n\ndefining-computational-resources\n\n\n§ DEFINING COMPUTATIONAL\nRESOURCES\n\n\nComputational resources are all resources of energy and material that\nare involved in any given task that requires computing. For example,\nwhen you perform a web search on your phone or participate in a video\nconference on your laptop, the computational resources involved are\nthose for production and running of your phone or laptop, the mobile\nnetwork or WiFi you are connected to, the fixed network it connects to,\nthe data centres that perform the search or video delivery operations.\nIf you are a scientist running a simulator in a supercomputer, then the\ncomputational resources involved are your desktop computer, the network\nand the supercomputer. For an industrial process control system, it is\nthe production and operation of the Programmable Logic Controllers, IoT devices etc.\n\ncomputational-resources-are-finite\n\n\n§ COMPUTATIONAL RESOURCES ARE\nFINITE\n\n\nSince the start of general purpose computing in the 1970s, our society\nhas been using increasing amounts of computational resources.\n\nFor a long time the growth in computational capability as a function of\ndevice power consumption has literally been exponential, a trend\nexpressed by\nhttps://www.britannica.com/technology/Moores-lawMoore's law.\n\nWith this growth in computational capability, increasing use of\ncomputational resources has become pervasive in today's society. Until\nrecently, the total energy budget and carbon footprint resulting from\nthe use of computational resources has been small compared to the world\ntotal. As a result, computational resources have until recently\neffectively been treated as unlimited.\n\nBecause of this, the economics of hardware and software development have\nbeen built on the assumption that with every generation, performance\nwould double for free. Now, this unlimited growth is no longer\nsustainable because of a combination of technological limitations and\nthe climate emergency. Therefore, we need to do more with less.\n\nMoore's law has effectively come to an end as integrated circuits can't\nbe scaled down any more. As a result, the improvement in performance per\nWatt is slowing down continuously. On the other hand, the demand for\ncomputational resources is set to increase considerably.\n\nThe consequence is that at least for the next decades, growth in demand\nfor computational resources will not be offset by increased power\nefficiency. Therefore with business as usual, the total energy budget\nand carbon footprint resulting from the use of computational resources\nwill grow dramatically to become a major contributor to the world total.\n\nFurthermore, the resources required to create the compute devices and\ninfrastructure are also finite, and the total energy budget and carbon\nfootprint of production of compute devices is huge. Moore's Law has\nconditioned us to doubling of performance ever two years, which has led\nto very short effective lifetimes of compute hardware. This rate of\nobsolescence of compute devices and software is entirely unsustainable.\n\nTherefore, as a society we need to start treating computational\nresources as finite and precious, to be utilised only when necessary,\nand as frugally as possible. And as computing scientists, we need to\nensure that computing has the lowest possible energy consumption. And we\nshould achieve this with the currently available technologies because\nthe lifetimes of compute devices needs to be extended dramatically.\n\nI would like to call this “frugal computing”: achieving the same\nresults for less energy by being more frugal with our computing\nresources.\n\nthe-scale-of-the-problem\n\n\n§ THE SCALE OF THE PROBLEM\n\n\nmeeting-the-climate-targets\n\n\n §.§ Meeting the climate\ntargets\n\n\nTo limit global warming to 1.5°C, within the next decade a global\nreduction from 55 gigatonnes C_2 equivalent (GtCO_2e) by 32 GtCO_2e to 23\nGtCO_2e per year is needed <cit.>. So by 2030 that would mean a\nnecessary reduction in overall CO_2 emissions of more than 50%. By 2040,\na further reduction to 13 GtCO_2e per year is necessary. According to the\nInternational Energy Agency <cit.>, emissions from electricity are\ncurrently estimated at about 10 GtCO_2e. \n\nThe global proportion of\nelectricity from renewables is projected to rise from the current figure\nof 22% to slightly more than 30% by 2040 <cit.>. A more optimistic\nscenario by the International Energy Agency <cit.> projects 70% of\nelectricity from renewables, but even in that scenario, generation from\nfossil fuels reduces only slightly, so there is only a slight reduction\nin emissions as a result.\n\nIn other words, we cannot count on renewables to eliminate CO_2 emissions\nfrom electricity in time to meet the climate targets. The same is true for nuclear, offsetting and CCS: they will all come too late. Reducing the energy consumption is the only option.\n\nemissions-from-consumption-of-computational-resources\n\n\n §.§ Emissions from consumption of computational\nresources\n\n\nThe consequence of the end of Moore's law was expressed most\ndramatically in a 2015 report by the Semiconductor Industry Association\n(SIA) “Rebooting the IT Revolution: a call to action” <cit.>,\nwhich calculated that, based on projected growth rates and on the 2015\nITRS roadmap for CMOS chip engineering technologies <cit.>\n\n\ncomputing will not be sustainable by 2040, when the energy required for\ncomputing will exceed the estimated world's energy production.\n\n\nIt must be noted that this is purely the energy of the computing device,\nas explained in the report. The energy required by e.g. the data centre\ninfrastructure and the network is not included.\n\nThe SIA has reiterated this in their 2020 “Decadal Plan for\nSemiconductors” <cit.>, although they have revised the projection\nbased on a “market dynamics argument”:\n\n\nIf the exponential growth in compute energy is left unchecked, market\ndynamics will limit the growth of the computational capacity which would\ncause a flattening out the energy curve.\n\n\nThis is merely an acknowledgement of the reality that the world's energy\nproduction is not set to rise dramatically, and therefore increased\ndemand will result in higher prices which will damp the demand. So\ncomputation is not actually going to exceed the world's energy\nproduction.\n\n\nEver-rising energy demand for computing vs. global energy production is\ncreating new risk, and new computing paradigms offer opportunities to\ndramatically improve energy efficiency.\n\n\nIn the countries where most of the computational resources are consumed\n(US and EU), electricity production accounts currently for 25% of the\ntotal emissions <cit.>. According to the SIA's estimates, computation\naccounts currently for a little less than 10% of the total electricity\nproduction but is set to rise to about 30% by 2040. This would mean\nthat, with business as usual, computational resources would be\nresponsible for at least 10% of all global CO_2 emissions by 2040.\n\nThe independent study “Assessing ICT global emissions footprint: Trends\nto 2040 & recommendations” <cit.> corroborates the SIA figures: they\nestimate the computing greenhouse gas emissions for 2020 between 3.0%\nand 3.5% of the total, which is a bit higher than the SIA estimate of\n2.5% because it does take into account networks and datacentres. Their\nprojection for 2040 is 14% rather than 10%, which means a growth of 4x\nrather than 3x.\n\nTo put it in absolute values, based on the above estimate, by 2040\nenergy consumption of compute devices would be responsible for 5 GtCO_2e,\nwhereas the target for world total emissions from all sources is 13\nGtCO_2e.\n\n Other projections are of the same order, and the key message is that \"computing’s carbon footprint growing at a rate unimaginable in other sectors.\" <cit.>.\n \nemissions-from-production-of-computational-resources\n\n\n §.§ Emissions from production of computational\nresources\n\n\nTo make matters worse, the carbon emissions resulting from the\nproduction of computing devices exceeds those incurred during operation.\nThis is a crucial point, because it means that we can't rely on\nnext-generation hardware technologies to save energy: the production of\nthis next generation of devices will create more emissions than any\noperational gains can offset. It does not mean research into more\nefficient technologies should stop. But their deployment cycles should\nbe much slower. Extending the useful life of compute technologies must\nbecome our priority.\n\nThe report about the cost of planned obsolescence by the European\nEnvironmental Bureau <cit.> makes the scale of the problem very clear.\nFor laptops and similar computers, manufacturing, distribution and\ndisposal account for 52% of their\nhttps://www.sciencedirect.com/topics/earth-and-planetary-sciences/global-warming-potentialGlobal\nWarming Potential (i.e. the amount of CO_2-equivalent emissions caused).\nFor mobile phones, this is 72%. The report calculates that the lifetime\nof these devices should be at least 25 years to limit their Global\nWarming Potential. Currently, for laptops it is about 5 years and for\nmobile phones 3 years. According to <cit.>, the\ntypical lifetime for servers in data centres is also 3-5 years, which\nagain falls short of these minimal requirements. According to this\npaper, the impact of manufacturing of the servers is 20% of the total,\nwhich would require an extension of the useful life to 11-18 years.\n\nthe-total-emissions-cost-from-computing\n\n\n §.§ The total emissions cost from\ncomputing\n\n\nTaking into account the carbon cost of both operation and production,\ncomputing would be responsible for 10 GtCO_2e by 2040, almost 80% of the\nacceptable CO_2 emissions budget <cit.>, as illustrated in Fig. <ref>.\n\n\n\na-breakdown-per-device-type\n\n\n §.§ A breakdown per device\ntype\n\n\nTo decide on the required actions to reduce emissions, it is important\nto look at the numbers of different types of devices and their energy\nusage. If we consider mobile phones as one category, laptops and\ndesktops as another and servers as a third category, the questions are:\nhow many devices are there in each category, and what is their energy\nconsumption. The absolute numbers of devices in use are quite difficult\nto estimate, but the yearly sales figures <cit.> and estimates for the energy\nconsumption for each category <cit.>\nare readily available from various sources. The tables below show the\n2020 sales (Table <ref>) and yearly energy consumption estimates (Table <ref>) for each category of\ndevices. A detailed analysis is presented in\n<cit.>.\n\n\n\nThe energy consumption of all communication and computation technology\ncurrently in use in the world is currently around 3,000 TWh, about 11%\nof the world's electricity consumption, projected to rise by 3-4 times\nby 2040 with business as usual according to\n<cit.>. This is a conservative estimate: the\nstudy in <cit.> includes a worst-case\nprojection of a rise to 30,000 TWh (exceeding the current world\nelectricity consumption) by 2030.\n\n\n\nThe above data make it clear which actions are necessary: the main\ncarbon cost of phones, tablets and IoT devices is their production and\nthe use of the mobile network, so we must extend their useful life very\nconsiderably and reduce network utilisation. Extending the life time is\nalso the key action for datacentres and desktop computers, but their\nenergy consumption also needs to be reduced considerably, as does the\nenergy consumption of the wired, WiFi and mobile networks.\n\na-vision-for-low-carbon-and-sustainable-computing\n\n\n§ A VISION FOR LOW CARBON AND SUSTAINABLE\nCOMPUTING\n\n\nIt is clear that urgent action is needed: in less than two decades, the\nglobal use of computational resources needs to be transformed radically.\nOtherwise, the world will fail to meet its climate targets, even with\nsignificant reductions in other emission areas. The carbon cost of both\nproduction and operation of the devices must be considerably reduced.\n\nTo use devices for longer, a change in business models as well as\nconsumer attitudes is needed. This requires raising awareness and\neducation but also providing incentives for behavioural change. And to\nsupport devices for a long time, an infrastructure for repair and\nmaintenance is needed, with long-term availability of parts, open repair\nmanuals and training. To make all this happen, economic incentives and\npolicies will be needed (e.g. taxation, regulation). Therefore we need\nto convince key decision makers in society, politics and business.\n\n\n\n §.§ A vision for zero-carbon computing\n\n\nImagine that we can extend the useful life of our devices and even\nincrease their capabilities, purely through better computing science.\nWith every improvement, the computational capacity will in effect\nincrease without any increase in energy consumption. Meanwhile, we will\ndevelop the technologies for the next generation of devices, designed\nfor energy efficiency as well as long life. Every subsequent cycle will\nlast longer, until finally the world will have computing resources that\nlast forever and hardly use any energy.\n\n\n\nresearch-challenges\n\n\n§ RESEARCH CHALLENGES\n\n\nThis is a very challenging vision, spanning all aspects of computing\nscience. To name just a few of the challenges:\n\ncloud-computing\n\n\n §.§ Cloud computing\n\n\n  Saving energy during operation, optimising for energy consumption\n  (e.g. DVFS, accelerators, scheduling and placement), more\n  energy-efficient software on all layers;   better use of renewables through smarter scheduling.  Increasing the useful life, e.g reliability monitoring and\n  early-warning systems, degradation-aware operation\n\n\nultra-hd-video-vrar\n\n\n §.§ Ultra-HD video & VR/AR\n\n\n\nRoll-out could lead to order of magnitude increases in video/3D traffic. To mitigate this, we need better compression (e.g. tailored, AI), local rendering (e.g. using FPGAs), better caching, energy-efficient edge computing\n\n\niot\n\n\n §.§ IoT\n\n\n  The projected growth in IoT devices is huge, resulting in huge increase in\n  network traffic as well as in emissions from production.  To mitigate this , we need to increase the device lifespan; reducing energy\n  consumption helps primarily with this; and use edge computing to\n  reduce network traffic.\n\nmobile-devices\n\n\n §.§ Mobile devices\n\n\n  The projected growth in mobile devices is still very large, and current\n  lifespans much too short.  We mainly need longer-term software support, so better software engineering practices, in  particular relating to security.   Apps should be designed to minimise full-system energy consumption; user interfaces should nudge users towards energy efficient behaviour.\n\nresearch-directions\n\n\n§ RESEARCH DIRECTIONS\n\n\nWe can also consider the research directions that would contribute to\nthis vision. Again, this is not a comprehensive list.\n\nAs a necessary condition, our systems must be as energy-efficient and long-lived as possible. This requires advances in many areas:\n\n\n  * Operating systems: energy-aware resource allocation and scheduling\n\n  * Networking: Energy consumption as QoS criterion\n\n  * Software engineering: better processes and sustainable practices will\n  play a key role in extending lifetimes of systems.\n\n  * Data centre/cloud: energy efficient heterogeneous systems, resource\n  allocation, scheduling.\n\n\nSustainable systems need to be data-driven. Large systems produce huge\n  amounts of system data. Making sense of this data is crucial for\n  whole-system energy optimisation. \n\n HCI has a key role to play in achieving low carbon computing\n\n\n  * Make users aware of energy/carbon costs of their actions\n\n  * Nudge user behaviour towards more sustainable practice\n\n  * Human-computer interfaces influence both energy consumption and useful\n  life of devices\n\n\nFinally, formal methods also have a key role to play in many aspects of low-carbon computing:\n\n\n\n  * Programming languages need to become full-system energy aware.\n\n  * Algorithms need to focus on minimising overall minimal energy consumption\n\n  * Compilers need to compile for overall minimal energy consumption: not\n  just CPU, also RAM, DMA, I/O wait etc; compilers need to be much better at selecting the right algorithms for given architectures, as algorithms strongly influence performance.\n\n\n\n\n§ CONCLUSION\n\n\nMy position on the direction computing should take is clear: we should reduce emissions from computing by using less energy and less materials. From the computing science perspective, this provides us with the challenges of radical optimisation of energy efficiency and useful life of our computing resources. And this change needs to happen within the next two decades.\n\n10\n\nkey-1Rebooting the IT revolution: a call to action, https://www.semiconductors.org/resources/rebooting-the-it-revolution-a-call-to-action-2/Semiconductor Industry Association/Semiconductor Research Corporation, Sept 2015 \n\nkey-2Full Report for the Decadal Plan for Semiconductors,\nhttps://www.src.org/about/decadal-plan/decadal-plan-full-report.pdfSemiconductor Industry Association/Semiconductor Research Corporation, Jan 2021\n\nkey-3Assessing ICT global emissions footprint: Trends to\n2040 & recommendations, Lotfi Belkhir, Ahmed Elmeligi, https://www.sciencedirect.com/science/article/pii/S095965261733233XJournal of Cleaner Production 177 (2018) 448–463\n\nkey-4Our House is on Fire: The Climate Emergency and Computing's Responsibility, B. Knowles,  K.  Widdicks, G. Blair, M. Berners-Lee, A. Friday, https://dl.acm.org/doi/pdf/10.1145/3503916Communications of the ACM, Vol 6(6), June (2022) 38-–40\n\nkey-6Sources of Greenhouse Gas Emissions, https://www.epa.gov/ghgemissions/sources-greenhouse-gas-emissionsUnited States Environmental Protection Agency, Last updated on April 14, 2021\n\n\nkey-7Emissions Gap Report 2020, https://www.unep.org/emissions-gap-report-2020UN Environment Programme, December 2020\n\nkey-8The link between product service lifetime and GHG\nemissions: A comparative study for different consumer products, Simon\nGlöser-Chahoud, Matthias Pfaff, Frank Schultmann, https://onlinelibrary.wiley.com/doi/full/10.1111/jiec.13123Journal of Industrial Ecology, 25 (2), pp 465-478, March 2021\n\nkey-9Cool products don’t cost the Earth\n– https://eeb.org/library/coolproducts-report/Report, European Environmental Bureau, September 2019\n\nkey-10The life cycle assessment of a UK data centre, Beth\nWhitehead, Deborah Andrews, Amip Shah, Graeme Maidment, https://link.springer.com/article/10.1007/s11367-014-0838-7Building and Environment 93 (2015) 395–405, January 2015\n\nkey-11https://www.statista.comStatista, retrieved June 2021\n\nkey-12Global Energy & CO2 Status Report,\nhttps://www.iea.org/reports/global-energy-CO%E2%82%82-status-report-2019/emissionsInternational Energy Agency, March 2019\n\nkey-13Redefining scope: the true environmental impact of\nsmartphones?, James Suckling, Jacquetta Lee, https://link.springer.com/article/10.1007/s11367-015-0909-4The International Journal of Life Cycle Assessment volume 20, pages 1181–1196 (2015)\n\nkey-14Server Rack Power Consumption Calculator, https://www.racksolutions.com/news/blog/server-rack-power-consumption-calculator/Rack Solutions, Inc., July 2019\n\nkey-15Analysis of energy consumption and potential energy\nsavings of an institutional building in Malaysia, Siti Birkha Mohd\nAli, M.Hasanuzzaman, N.A.Rahim, M.A.A.Mamun, U.H.Obaidellah, https://www.sciencedirect.com/science/article/pii/S111001682030524XAlexandria Engineering Journal, Volume 60, Issue 1, February 2021, Pages 805-820\n\nkey-16On Global Electricity Usage of Communication Technology:\nTrends to 2030, Anders S. G. Andrae, Tomas Edler, https://doi.org/10.3390/challe6010117Challenges 2015, 6(1), 117-157\n\nkey-17BP Energy Outlook: 2020 Edition, https://www.bp.com/en/global/corporate/energy-economics/energy-outlook.htmlBP plc\n\nkey-182015 International Technology Roadmap for Semiconductors\n(ITRS), https://www.semiconductors.org/resources/2015-international-technology-roadmap-for-semiconductors-itrs/Semiconductor Industry Association, June 2015\n\nkey-19Net Zero by 2050 – A Roadmap for the Global Energy\nSector, https://iea.blob.core.windows.net/assets/deebef5d-0c34-4539-9d0c-10b13d840027/NetZeroby2050-ARoadmapfortheGlobalEnergySector_CORR.pdfInternational Energy Agency, October 2021\n\n\n\n\n"}