{"entry_id": "http://arxiv.org/abs/2303.07319v1", "published": "20230313174139", "title": "Observations of GRB 230307A by TESS", "authors": ["Michael M. Fausnaugh", "Rahul Jayaraman", "Roland Vanderspek", "George R. Ricker", "Christopher J. Burke", "Knicole D. Colon", "Scott W. Fleming", "Hannah M. Lewis", "Susan Mullally", "Allison Youngblood", "Thomas Barclay", "Eric Burns", "David W. Latham", "S. Seager", "Joshua N. Winn", "Jon M. Jenkins"], "primary_category": "astro-ph.HE", "categories": ["astro-ph.HE"], "text": "\n\n\n\n\n\n0000-0002-9113-7162]Michael M. Fausnaugh\nDepartment of Physics and Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\nMichael M. Fausnaugh\nfaus@mit.edu\n\n\n0000-0002-7778-3117]Rahul Jayaraman\nDepartment of Physics and Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n\n\nDepartment of Physics and Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n\n\nDepartment of Physics and Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n\n0000-0002-7754-9486]Christopher J. Burke\nDepartment of Physics and Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n\n\n0000-0001-8020-7121]Knicole D. Colón\nNASA Goddard Space Flight Center, 8800 Greenbelt Rd, Greenbelt, MD 20771, USA  \n\n0000-0003-0556-027X]Scott W. Fleming\nSpace Telescope Science Institute, 3700 San Martin Dr, Baltimore, MD 21218, USA\n\n\n0000-0002-7871-085X]Hannah M. Lewis\nSpace Telescope Science Institute, 3700 San Martin Dr, Baltimore, MD, 21218, USA\n\n\n 0000-0001-7106-4683]Susan Mullally\nSpace Telescope Science Institute, 3700 San Martin Dr, Baltimore, MD 21218, USA\n\n\n\n\n\n0000-0002-1176-3391]Allison Youngblood\nNASA Goddard Space Flight Center, 8800 Greenbelt Rd, Greenbelt, MD 20771, USA\n\n0000-0001-7139-2724]Thomas Barclay\nUniversity of Maryland, Baltimore County, 1000 Hilltop Circle, Baltimore, MD 21250, USA\nNASA Goddard Space Flight Center, 8800 Greenbelt Rd, Greenbelt, MD 20771, USA\n\n\n0000-0002-2942-3379]Eric Burns\nDepartment of Physics and Astronomy, Louisiana State University, Baton Rouge, LA 70803 USA\n\n\n\nCenter for Astrophysics | Harvard & Smithsonian, 60 Garden Street, Cambridge, MA 02138\n\n0000-0002-6892-6948]S. Seager\nDepartment of Physics and Kavli Institute for Astrophysics and Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\nDepartment of Earth, Atmospheric, and Planetary Sciences, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\nDepartment of Aeronautics and Astronautics, MIT, 77 Massachusetts Avenue, Cambridge, MA 02139, USA\n\n0000-0002-4265-047X]Joshua N. Winn\nDepartment of Astrophysical Sciences, Princeton University, 4 Ivy Lane, Princeton, NJ 08544, USA\n\n\nNASA Ames Research Center, Moffett Field, CA, 94035, USA\n\n\n\n\n\nWe present the TESS light curve of GRB 230307A.  We find two distinct components: a bright, prompt optical component at the time of the Fermi observation that peaked at TESS magnitude  (averaged over 200 seconds), followed by a gradual rise and fall over 0.5 days, likely associated with the afterglow, that peaked at  mag. The prompt component is observed in a single 200s Full Frame Image and was undetectable in the next TESS image (T_ mag > 17.79). Assuming that the onset of the optical transient was coincident with the gamma-ray emission, the prompt emission lasted less than 73.6 seconds, which implies the true peak was actually brighter than T_ mag = .  We also fit parametric models to the afterglow to  characterize its shape.  \nThe TESS light curve can be retrieved at <https://tess.mit.edu/public/tesstransients/light_curves/lc_grb230307A_cleaned.txt>. \n\n\n\n\n\n§ INTRODUCTION \n\n\nGRB 230307A was a long gamam-ray burst discovered by Fermi at BJD-2,460,000=11.15549 days (15:44:06 UT on 2023 March 7, GCN33405; ).  \nA fading optical afterglow was observed 9–56 hours after the GRB trigger by ULTRACAM (GCN33439; ), GMOS-S on Gemini South (GCN33447; ),  RASA36, and KMTnet (GCN33449; ).  The coordinates reported by <cit.> are  RA = 04:03:25.83, Dec = -75:22:42.7.\n\n\n\nThe Transiting Exoplanet Survey Satellite (TESS, ) observed the optical afterglow of GRB 230307A in the Full Frame Images (FFIs), sampled at 200 seconds. \nIn this research note, we present the TESS light curve and observed properties of the optical emission.\n\n\n\n\n\n\n§ OBSERVATIONS AND DATA REDUCTION\n\n\nTESS observed GRB 230307A as part of its normal operations in Sector 62, which lasted from 2023 February 12 to March 10. The FFI data from March 3–10 were downloaded from the spacecraft on 2023 March 10, processed by the Payload Operations Center (POC) at MIT, and delivered to the Mikulski Archive for Space Telescopes (MAST) as a TICA High Level Science product <cit.>.[<https://archive.stsci.edu/hlsp/tica>] The order of processing events was\n\n    \n  * March 10, 16:23 UTC—Deep Space Network (DSN) begins contact with the TESS spacecraft to downlink the data.\n    \n  * March 11, 10:56 UTC—Compressed data arrive at POC from the DSN; POC begins decoding data delivery and writing image files.\n    \n  * March 11, 16:35 UTC—POC begins calibrating data and fitting World Coordinate Solutions as part of the TICA data delivery.\n    \n  * March 11, 18:42 UTC—POC begins staging and verifying the TICA delivery to MAST.\n    \n  * March 12, 1:50 UTC—MAST begins data ingest.\n        \n  * March 12, 6:40 UTC—GRB data are made public on MAST, announced on the MAST holdings page,[<https://outerspace.stsci.edu/display/TESS/TESS+Holdings+Available+by+MAST+Service>] and announced on MAST social media.\n\n\nOnce the data were public, we processed the images with the difference imaging analysis pipeline described by <cit.>.  \n\nWe identified a transient point source in the TESS difference image overlapping with the Fermi trigger at BJD-2,460,000=11.15518 days, close to the coordinates reported by <cit.>. We measured the position of the source using flux-weighted centroids in a 5x5 square pixel aperture. We found a position of RA = 04:03:25.36, Dec = -75:22:41.31, which agrees with the position from ULTRACAM to 1.8 arcseconds.  This difference is consistent with the typical 1σ precision of TICA World Coordinate Solutions, about 2 arcseconds. These coordinates are also consistent with those reported in GCN33453 ().\n\nWe extracted light curves from the difference images using forced PSF photometry at the location of the afterglow reported by <cit.>.  Figure <ref> shows the resulting light curve. Based on the scatter of the light curve prior to the GRB discovery, we estimate a 5σ limiting magnitude of 18.63 in 1600 seconds. The TESS light curve is available at <https://tess.mit.edu/public/tesstransients/light_curves/lc_grb230307A_cleaned.txt>. Information on the file format and processing steps is available on the same website.[<https://tess.mit.edu/public/tesstransients/pages/readme.html>]\n\n\n The light curve shows two distinct components.  First is a prompt rise from zero flux to TESS mag T_ mag =  in a single FFI at BJD-2,460,000 = 11.15518 days (mid exposure). The quoted uncertainty includes a statistical uncertainty of 0.02 mag, but is dominated by uncertainty in the TESS instrument absolute flux calibration <cit.>. The source is not detected in the next FFI, with a 3σ upper limit of 17.79 mag. The second emission component starts just after the prompt emission, and consists of a gradual rise and fall in the TESS light curve over 0.5 days, likely associated with the afterglow. \n \n\n\n\n\n\n\n\n§ ANALYSIS OF THE AFTERGLOW\n\n\nWe fit two parametric models to the afterglow light curve, a fast-rise exponential-decay (FRED) model and a double power law model.  We fit the original data sampled at 200 seconds (the binned data shown in Figure <ref> are binned to 1600 seconds for display purposes). We excluded the prompt emission at T_ mag = 14.49 from the fits to the afterglow emission. The reported uncertainties correspond to the 68% confidence intervals of the fits. For both models, we fit a residual background error as a nuisance parameter, which is consistent with zero at 1σ.\n\nFrom the FRED model, we find that\n\n    \n  * the peak magnitude of the afterglow is ,\n    \n  * the rise-time t_ rise = , \n    \n  * the time containing 90% of the flux t_90 = ,\n    \n  * and the exponential decay timescale t_ exp = .\n\n\nFor the double power law model, we used the parameterization of <cit.>:\n\n\n    F = F_02[ ( t/t_ break)^α_1 ω + ( t/t_ break)^α_2 ω]^-1/ω\n\nwhere F_02 is the flux normalization at the break time t_ break, while α_1, and α_2 are slope parameters. We fixed the smoothing parameter ω to a value of 5.0.  The best-fit model yields\n\n    \n  * t_ break = ,\n    \n  * α_1 = ,\n    \n  * and α_2 = .\n\n\nWe also fit the TESS light curve with the deep r-band magnitudes reported by <cit.> and <cit.>, and found consistent results.\n\n\n\n\n§ DISCUSSION\n\n\nThe end time of the FFI with the prompt emission is BJD-2,460,000=11.15634 days, while the Fermi trigger is at BJD-2,460,000=11.15549 days. Assuming that the onset of the optical light curve is coincident with the onset of the gamma-ray emission observed by Fermi, the prompt emission observed by TESS lasted less than 73.6 seconds. A shorter duration implies a higher peak magnitude for the same fluence; we find  T_ mag = mag for a 73.6 second burst, and the peak could be even brighter if the duration of the prompt emission is shorter.   For a given luminosity distance D, the isotropic monochromatic luminosity at 7839 Å (the pivot wavelength of the TESS filter) would be greater than 9× 10^44(D/1   Gpc)^2 erg s^-1. This calculation is corrected for Galactic extinction at 7839 Å assuming a  extinction law and  E(B-V) = 0.0758 mag from , but does not take into account the unknown spectral shape of the GRB in the broad TESS filter (6,000–10,000 Å).\n\n\n\n\n\n\n\nThese data demonstrate the utility of wide-field, continuous monitoring for studies of fast extragalactic transients.  TESS data released approximately every 7 days as TICA High Level Science Products will facilitate these studies over the next several years.\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n\nWe thank the TESS-POC team at MIT and MAST for facilitating fast release of TESS FFIs through the TICA HLSP. This note includes data collected by the TESS mission, funding for which is provided by NASA’s Science Mission directorate.\n\n\n  Matplotlib <cit.>,\n  Numpy <cit.>,\n  Scipy <cit.>, \n  Astropy <cit.>,\n  Astroquery <cit.>,\n  gwcs[<https://doi.org/10.5281/zenodo.4271727>], \n  TICA <cit.>\n \n\n\n\n\n"}