{"entry_id": "http://arxiv.org/abs/2303.06637v1", "published": "20230312112805", "title": "Integrated Communication and Receiver Sensing with Security Constraints on Message and State", "authors": ["Mehrasa Ahmadipour", "Michèle Wigge", "Shlomo Shamai"], "primary_category": "cs.IT", "categories": ["cs.IT", "math.IT"], "text": "\n\t\n\t\n\t\n\t\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\tIntegrated  Communication and Receiver Sensing with Security Constraints  on Message and State \n    \n\t\tMehrasa Ahmadipour1, Michèle Wigger2, Shlomo Shamai3 \n\t\t\n\t\t1\n\t\t\tUMPA, ENS de Lyon\n\t\t\t<mehrasa.ahmadipour@ens-lyon.fr>\n\t\t1 LTCI Telecom Paris, IP Paris, 91120 Palaiseau, France, Emails:\n\t\t\t<michele.wigger@telecom-paris.fr>\n\t\t2 ,  Email: sshlomo@ee.technion.ac.il\n\t\t\n\t\n    \n=================================================================================================================================================================================================================================================================================\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\tWe study the state-dependent wiretap channel with non-causal channel state informations at the encoder in an integrated sensing and communications (ISAC) scenario. \n\t\tIn this scenario,  the transmitter  communicates a message and a state sequence to a legitimate receiver while keeping the message and state-information secret from an external eavesdropper. This paper presents a new achievability result for this doubly-secret scenario, which recovers as special cases the best-known  achievability results for the setups  without security constraints or with only a security constraint on the message. The impact of the secrecy constraint (no secrecy-constraint, secrecy constraint only on the message, or on the message and the state) is analyzed at hand of a Gaussian-state and Gaussian-channel example. \n\t\n\t\n\n§ INTRODUCTION\n\n\t\n\tGreat scientic and technological efforts are currently being made to eifficiently integrate sensing and communication (ISAC) into a common hardware and  bandwidth <cit.>. This trend is driven by spectrum scarcity, the enlargement of the communication spectrum closer to the traditional radar spectrum, the conceptual similarity between the two tasks (emitting specific  waveforms and detecting parameters based on  received signals), as well as economic pressure to reduce hardware costs.  Radar systems can be divided into two families:  mono-static radar  where the same terminal emits the waveform and senses the environment based on the backscattered signal and bi-static radar where  the  sensing terminal exploit the scattered signals emitted by other terminals. Information-theoretic works have considered both types of systems, where in the literature on  mono-static radar <cit.>   the radar receivers  typically have to reconstruct the channel's state sequence with smallest possible distortion , while in the literature on   bi-static radar <cit.> they aim to determine an underlying binary (or multi-valued) parameter with largest possible error exponent. This latter scenario has even been investigated for classical-quantum channels <cit.>.\n\t\n\tIn this work we consider an ISAC problem with bi-static sensing, where the sensing terminal coincides with the receiver of the data communication, see Figure <ref>. The receiver thus not only decodes the transmitted signal but also reconstructs the channel state-sequence up to a given distortion. We assume that the transmitter knows this state-sequence S^n perfectly and in advance (as in the famous Gel'fand-Pinsker  <cit.> or dirty-paper setups <cit.>) and can thus actively help the receiver in his estimation. Bounds on the optimal rate-distortion tradeoff of the described setup has been derived  in <cit.>. In the present work, we impose  the additional security constraints that  the  transmitted message and part of the state S^n have to be kept secret from an external eavesdropper. In this sense, our model is  an extension of the models in <cit.> but with an external eavesdropper that is not allowed to learn neither the message nor the state. It can also be considered an extension of the wiretap channel  with non-causal state-information <cit.> to include the sensing performance and the secrecy constraint on the state. The intriguing feature in our model is that the transmitter should describe the state to the legitimate receiver, but mask  <cit.> it from the eavesdropper. \n\t\t\n\n\n\n\n\n\nRelated to this work is also  <cit.>, which however considers a mono-static radar system, and <cit.> which considers  a state-dependent wiretap channel (without sensing) where   the transmitter additionally has to extract a key and  convey this to the receiver while keeping it secret from the eavesdropper. \n\nIn this paper we establish an achievable rate-distortion region  for the state-dependent wiretap channel with receiver state-sensing and where besides the message also parts of the state have to kept secret from an external eavesdropper. \n\t\tOur result is built on a two-layer superposition likelihooed encoding scheme, similar to   <cit.>. It includes as special cases the results we mentioned in above paragraph. At hand of a Gaussian example, we  numerically characterize the penalty on the rate-distortion tradeoff caused by the security constraints on the message and on the state.\n\n\t\n\n\n\t\n\n\t\n\t\n\n§ SYSTEM MODEL AND MAIN RESULT\n\n\t\n\tFormally, the model consists of the following elements.\n\t\n\t\t\n  * A memoryless state sequence {(S_i)}_i≥ 1 whose samples at any given time i are distributed according to a given law P_S over the finite state alphabet .\n\t\t\n  * Given that at time-i the Tx sends input X_i=x  and given  state realization S_i=s_i,  the Rx observes the  time-i output Y_i  and the eavesdropper observes signal Z_i distributed according to the stationary channel transition law P_YZ|SX(·,·|s,x),\n\t\t\n  * Input and output \n\t\talphabets , ,  , are assumed  finite. \n\t  \n\t\n\tA rate-R_M and blocklength-n code  consists  of:\n\t\n\t\t\n  * A message set _n{1,2,⋯, 2^nR_M};\n\t\t\n  * An encoder that assigns a symbol x_i (m, s ) ∈ X\n\t\tto each message m∈_n and each state\n\t\tsequence s^n∈^n; \n\t\t\n  * A decoder that assigns a message estimate m̂ and a state sequence estimate ŝ^n∈^n to each received sequence y^n∈^n where   is a given  reconstruction alphabet.\n\t\t\n\t\t\n  * An encoding function: f_n:_n×^n→^n\n\t\t\n  * A decoding function: ϕ_n: ^n→_n\n\t\t\n  * A state estimator  ψ_n ^n →^n.\n\t\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\tWe assume that M is uniformly distributed over the\n\tmessage set so P_M(m)=1/2^nR_M. \n\tThe probability of decoding error is defined as:\n\trCl\n\t\tP^(n)_e    :=    Pr( M̂≠M ).\n\t\n\tThe fidelity of the state estimate at the Rx is measured by the expected distortion\n\t\n    Δ^(n):= 1/n∑_i=1^n 𝔼[d_R(S_ i,  Ŝ_ i)],\n\n\tfor a given bounded distortion function d_R(·,·).\n\t\n\tThe eavesdropper should not be able to learn a random sequence Ξ^n that is obtained by passing the  state sequence S^n through a memoryless channel P_Ξ|S independent of the message and the communication channel. \n\n\n\n\tThe information leakage to the eavesdropper \n\tis   measured by the mutual information\n\t\n    l_s^(n)≜   I(M,Ξ^n;Z^n).\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t In the described setup, a rate-distortion pair (_M,  ) is called securely-achievable if there exists  a sequence (in n) of  rate-R_M and blocklength n-codes that simultaneously satisfy the three asymptotic constraints:\n\t\t\n\t\t\trCl\n\t\t\t\tlim_n→∞\tP^(n)_e \n\t\t\t\t   =   0 \n\n\t\t\t\tlim_n→∞\tl_s^(n)    =   0  \n\n\t\t\t\t_n→∞\tΔ^(n)    ≤    .\n\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\t\n\t \n\t\tNotice that Condition (<ref>) is equivalent to requiring that the sum of  mutual informations I(M;Z^n)+ I(Ξ^n;Z^n) vanishes asymptotically as n→∞.\n\t \n\t\n\t\n\t\n\t\tFor any pmf P_UVX| S so that for the associated tuple (S,Ξ, U, V, X,Y Z)∼ P_SP_Ξ|SP_UVX| S P_YZ|XS, the random variable Ξ is independent of the pair (U,Z),\n\t\t\n    Ξ⊥ (U,Z)\n and any function g(·) on appropriate domains, all pairs  \n\t\t(R_M, D) satisfying the following  inequalities\n\t\trCl\n\t\t\tR_M   ≤    I(U,V;Y)-I(U,V;S)  \n\t\t\t\n\n\t\t\tR_M   ≤    I(V;Y|U)-\tI(V;Ξ,Z|U) \n\t\t\t\n\n\t\t\t      +min{0, I(U;Y)-I(U;S)}\n\t\t\t\t\n\t\t\t\n\t\t\n\t\tand\n\t\trCl\n\t\t\tE[d(S,g(U,V,Y))]   ≤    D,\n\t\t\t\n\t\t\t\n\t\t\n\t\tare securely achievable. \n\t\n\t\n\t\n\tNotice that when the entire state S has to be kept secret, Ξ=S, then U has to be chosen independently of S and thus I(U;S)=0 and the minimum in the right-hand side of (<ref>) evaluates to 0. Moreover, for Ξ=S the right-hand side of (<ref>)  is larger  than the right-hand side of (<ref>) because I(V;S,Z| U)≥ I(V;S| U). Thus, for ν(S)=S, Constraint (<ref>) is less stringent than Constraint (<ref>) and we obtain the following corollary, after observing that U only plays the role of a convexification random variable. \n\t\n\t\tAssume Ξ=S. Then the convex hull of all rate-distortion pairs  \n\t\t(R_M, D) is achievable that\n\t\tsatisfy the constraints\n\t\trCl\n\t\t\tR_M   ≤    I(V;Y)-\tI(V;S,Z)\t\t\n\t\tand\n\t\trCl\n\t\t\tE[d(S,g(V,Y))]   ≤    D,\n\t\t\t\n\t\tfor some  function g(·) on appropriate domains and  pmf P_VX| S where the associated tuple (S,Ξ, V, X,Y Z)∼ P_SP_Ξ|SP_VX| S P_YZ|XS has \tS independent of Z, \n\t\t\n    S⊥ Z.\n\n\t\t\n\t\n\t\n\tOn the other extreme, we might only wish to keep the message secret but not the state, i.e. Ξ=const. As shown in Section <ref>,  in this case Theorem <ref>  simplifies  to:\n\t\n\t\tAssume Ξ=const. For any pmf P_UVX| S and any function g(·) on appropriate domains, all pairs  \n\t\t(R_M, D) satisfying\n\t\trCl\n\t\t\tR_M   ≤    min{ I(U,V;Y)-I(U,V;S) ,\n\t\t\t\n\n\t\t\t         I(V;Y|U) -\tI(V;Z|U)}\n\t\t\n\t\tand\n\t\trCl\n\t\t\tE[d(S,g(U,V,Y))]   ≤    D,\n\t\t\t\n\t\t\t\n\t\t\n\t\tare securely achievable   rate-distortion pairs. It suffices to consider pmfs  P_UVX| S so that I(U;Y) ≥ I(U;S).\n\t\n\tNotice that for sufficiently large distortion constraints D, Corollary <ref> recovers the achievability result for the state-dependent wiretap channel with non-causal state-information at the encoder <cit.>. \n\t\n\tFinally, we consider the special case where Z is independent of the input-state pair (X,S), which corresponds to the setup without secrecy constraint studied in <cit.>. In this special case, Theorem <ref> can be simplified by choosing U=const., in which case Corollary <ref> evaluates to: \n\t\n\t\tAssume that Z is independent of the input-state pair (X,S). Then, for any pmf P_VX| S and any function g(·) on appropriate domains, all non-negative rate-distortion pairs  \n\t\t(R_M, D) satisfying\n\t\trCl\n\t\t\tR_M   ≤     I(V;Y)-I(V;S)\n\t\t\n\t\tand\n\t\trCl\n\t\t\tE[d(S,g(V,Y))]   ≤    D,\n\t\t\n\t\tare  achievable. \n\t\n\t\n\tComparing Corollary <ref>  where both message and state have to be kept secret with Corollary <ref> where no secrecy constraint is applied, we see that the price for achievable double state-and-message secrecy in our scheme is that S has to be independent of Z and that the rate has to be reduced by the mutual information quantity I(V;Z|S)=I(SV;Z). \n\t\n\t\n\n §.§ A Gaussian Example\n\n\tConsider Gaussian channels both to the legitimate receiver\n\trCl\n\t\tY_i    =    X_i +S_i + N_i ,\n\t\n\tand to the eavesdropper \n\trCl\n\t\tZ_i    =    aX_i +bS_i + N_e,i,\n\t\n\tfor given parameters a=0.7, b=0.3,  where {S_i} is an independently and identically distributed  (i.i.d.) zero-mean Gaussian of power Q=3 and the noise sequences are also i.i.d. zero-mean Gaussian of variances σ^2=1 and σ_e^2=4 and independent of each other and of the inputs and the states.  The channel inputs are average blockpower constrained to power P=30. Also, assume that \n\t\n    Ξ = S+A,\n\n\tfor A a zero-mean Gaussian random variable independent of all other random variables and of variance σ_A^2≥ 0. This setup covers the scenario where the entire state-sequence has to be kept secret, with the choice σ_A^2=0. and (with a slight abuse of notation) the scenario where the state does not have be be kept secret at all, with the choice σ_A^2 →∞.\n\t\n\tWe use the squared error  d(s,ŝ)=(s-ŝ)^2 to measure the distortion at the receiver.\n\t\n\tWe shall numerically compare the achievability results in Corollaries <ref>, <ref>, <ref> for this Gaussian example, to quantify the rate-penalty imposed by the various secrecy-constraints. To this end, we choose the following Gaussian auxiliaries: \n\t\n\trCl\n\t\tU    =     F+ δS+G\n\n\t\tV     =    T+ αS+G\n\n\t\tX     =     T +F+ϵG+γS,\n\t\n\t\n\twhere T, F, and G  Gaussian random variable independent each of other and of the state S, and of variances σ_T^2, σ_F^2≥ 0 so that σ_T^2+σ_F^2+ ϵ^2 σ_G^2+ γ^2 Q ≤ P.\n\tNotice that for Ξ=S we are obliged to choose γ=-b/a to ensure that Z is independent of S.  In this case, we can also choose U  to be constant (i.e., F,G constants and δ=0), see Corollary <ref>. \n\t\n\t\n\tFigure <ref> illustrates the distortion-rate tradeoffs achieved  by our Corollaries <ref>, <ref>, <ref>  for the described choice of auxiliaries. Notice that without any secrecy constraint, in the Gaussian case the achievability result in Corollary <ref> is tight, as shown in <cit.>. The largest achievable rate equals the dirty-paper capacity <cit.> of the channel to the legitimate receiver C=1/2log(1+P/σ_N^2)=1.717. In this no-secrecy setup the minimum distortion is achieved by simply sending a scaled version of the channel and equals \n\t\n    D_min, no-secrecy=Q σ_N^2/(√(Q) + √(P))^2+σ_N^2=0.056.\n\n\tTrivially, the same minimum distortion is also achievable in the classical wiretap setup where only the message but not the state have to be kept secret.\n\t\n\tFinding the minimum distortion under a secrecy constraint on the state is more challenging, the same as finding the maximum rate when the message has to be kept secret (both in the scenarios with and without secrecy constraint on the state). We can however easily deduce that the minimum distortion under a secrecy constraint on the state cannot be achieved by an uncoded strategy. In fact, sending X^n=-b/a S^n without any additional codeword (recall that the transmit signal X has to subtract the term  b/a S^n so as to keep the state S^n secret from the eavesdropper) achieves distortion\n\t\n    D_min, uncoded,secret=Q σ_N^2/Q(1- b/a)^2+σ_N^2=1.516,\n\n\twhich is strictly larger than the minimum distortion 1.423 achieved by Theorem <ref> (see the red line in Figure <ref>) under the fully-secret state criterion Ξ=S and with the set of auxiliaries in (<ref>).\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n§ PROOF OF THEOREM <REF>\n\n\t\n\t\n\tChoose a conditional distribution P_XUV|S over 𝒳×𝒰×𝒱 for auxiliary alphabets 𝒰 and 𝒱, and a  reconstruction function g𝒰×𝒱×𝒴→ℝ_0^+ so that for the tuple (S,Ξ,U,V,X, Y,Z) ∼ P_SP_Ξ|SP_XUV|S P_YZ|XS the random variable Ξ is independent of the pair (U,Z): \n\trCl\n\t\tΞ⊥(U,Z)\n\t and the distortion constraint is satisfied: \n\t\n    𝔼[ d_R(S, g(U,V,Y)) ]≤ D_R.\n\n\tFix a small number ϵ>0 and a large blocklength n. \t\n\tPick auxiliary rates  R_I,  and R_J satisfying\n\t\n\t\trCl\n\t\t\tR_I      ≥    I(U;S )\n\n\t\t\tR_I+R_J     ≥     I(UV;S)\n\n\t\t\tR_J     ≥    \tI(V;Ξ,Z|U)\n\t\t\n\t\n\t\n\t\n\t\n\n §.§ Code Construction\n\n\tConstruct a superposition code as follows.\n\t\n\t\t\n  * A lower-level code 𝒞_U consisting of 2^n R_I codewords {u^n(i)}  is constructed by drawing all entries i.i.d. according to the marginal pmf P_U of \n\t\trCl\n\t\t\tP_SUVXYZ=\tP_SP_XUV|S P_YZ|XS. \n\t\t \n\t\t\n  * An upper-level code 𝒞_V(i) consisting of 2^n( R_J+R_M)  codewords {v^n(m,j| i)} is constructed for each i∈ [ 2^n R_I], by drawing the t-th entry  of each codeword according to P_V|U(·| u_t(i)) where  u_t(i) denotes the t-th entry of  codeword  u^n(i). \n\t  \n\tThe realization of the codebook is revealed to all parties.\n\t\n\t\n\n §.§ Encoding and Decoding\n\n\t\n\tThe transmitter applies a likelihood encoder. That means, based on the state-sequence S^n=s^n that it observes  and the message M=m that it wishes to convey, it randomly picks the indices (I^*,J^*) according to the conditional pmf\n\trCl\n\t      \tP_LE(i,j |m,s^n) \n\t\n\n\t      =  P_S|UV(s^n| u^n(i), v^n(m,j|i)) / i∈[2^n R_I]∑ j∈[2^n R_J]∑ P_S|UV(s^n| u^n(i), v^n(m,j|i) ).\n\t\n\tIt then generates the random input sequence X^n by passing the pair  of codewords u^n(I^*) and v^n (m,J^*| I^*) and the state sequence s^n through the memoryless channel P_X|UVS. \n\t\n\t\n\tThe receiver observes the channel outputs Y^n=y^n and looks for a triple (î, ĵ, m̂)  so that \n\t\n    ( u^n(î),  v^n (m̂,ĵ| î),  y^n) ∈𝒯_ϵ^(n)(P_UVY).\n\n\tIt randomly picks one of these triples and sets (Î,Ĵ, M̂)=(î,ĵ,m̂). Then it declares M̂ as the transmitted message, and produces the state reconstruction sequence \n\t\n    Ŝ^n = g^⊗ n(  u^n(Î),  v^n (M̂,Ĵ|Î),  y^n).\n\n\tIf no triple was found, the receiver  declares an error.  \n\t\n\t\n\t\n\t\n\n §.§ Analysis\n\n\t\n\t\n\n  §.§.§ Distortion and Error Probability\n\n\tWe consider two related experiments. To this end, notice that the encoding procedure is described in Figure <ref>. \n\t\n\t\n\tWe shall prove that the joint pmf P_MIJU^nV^nS^nX^n Y^n Z^n in this model is close in variational distance to an auxiliary distribution P̃_MIJU^nV^nS^nX^n Y^n Z^nŜ^n implied by the diagramme in Fig. <ref>, where the the indices I and J are assumed uniform over the index sets {1,…, 2^nR_I} and {1,…, 2^nR_J}, independent of each other and of the state sequence S^n and message M.\n\t\n\t\n\tNotice that  for each code construction the joint pmfs P_MIJU^nV^nS^nX^nY^nZ^nŜ^n and P̃_MIJU^nV^nS^nX^n Y^n Z^nŜ^n factorize in a similar way: \n\trCl\t\n\t      \tP_MIJU^nV^nS^nX^n Y^n Z^nŜ^n(m,i,j,u^n,v^n,s^nx^n,y^n,z^n,ŝ^n) \n\t\n\n\t      = 1/2^nR  P^⊗n_S(s^n) P_LE(i,j|m, s^n) 1{u^n(i)=u^n}\n\t\t\n\n\t\t        \n\t\t·1{v^n(m,j|i)=v^n} ·P^⊗n_XYZ|UVS(x^n,y^n,z^n|u^n,v^n,s^n)  \n\t\t\n\n\t\t          1{ŝ^n=g^⊗n ( u^n,v^n,y^n) } \n\t\n\twhere P_LE denotes the conditional marginal distribution induced by the likelihood encoder, and \n\trCl\t\n\t      \tP̃_MIJU^nV^nS^nX^n Y^n Z^n(m,i,j,u^n,v^n,s^n, x^n,y^n,z^n) = \n\n\t      1/2^n(R_M+R_I+R_J)  1{u^n(i)=u^n}  1{v^n(m,j|i)=v^n} \n\n\t\t        ·P^⊗n_S|UV(s^n|u^n,v^n)  P^⊗n_XYZ|UVS(x^n,y^n,z^n|u^n,v^n,s^n)\n\n\t\t       \n\t\t·1{ŝ^n=g^⊗n ( u^n,v^n,y^n) } .\t\n\n\n\n\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t Since  in the auxiliary system, codewords u^n and v^n are chosen uniformly at random over the codebooks, by standard typicality arguments, if \n\t\n\t\trCl\t\n\t\t\tR_I +R_J +R_M      <      I(U,V;Y)\n\n\t\t\tR_J +R_M      <      I(V;Y|U).\n\t\t\n\t the expected (over the random choice of the codebooks) probability of wrongly decoding indices (M,  I ,J) tends to 0 as n→∞. In fact, for any M=m, we have that \n\trCl\n\t\t𝔼[\tp(error|M=m)) ] →0     as  n→∞,\n\t\n\twhere expectation is with respect to the random codebook and \n\t\n    p(error|M=m):= [   Î =I   or Ĵ=J |M=m].\n\n\t\n\tWe now introduce the ideal system in Figure <ref>. \t\n\t\n\tIt only differs from the system in Figure <ref> in that error-free decoding is assumed. Notice that since under P̃ the decoding error probability vanishes as n→∞, we have on expectation over the random code construction: \n\trCl\n\t      \t𝔼[  Q_MIJU^nV^nS^nX^n Y^n Z^nŜ^n \n\n\t\t      \n\t\t-P̃_MIJU^nV^nS^nX^n Y^n Z^nŜ^n _1 ] →0, \n\t\n\twhere expectation is over the random choice of the codebooks. As a consequence, by the  boundedness of the distortion function, we have: \n\trCl\n\t\tlim_n→∞ 𝔼[\t\tΔ^(n) \t]  \n\t\t\n= d_R(S, g(U, V, Y) )  \n\t\t    ≤   D_R,\n\t\n\twhere  (U,V, S,Y)∼ P_UVP_S|UVP_Y|UVS and the last two equalities hold by the construction of the auxiliary system and by the choice of the auxiliary random variables. \n\t\n\t\n\n  §.§.§ Secrecy Analysis\n\n\tTo analyze the secrecy, we consider yet another system, the system in Figure <ref>.  The corresponding distribution is given by\n\trCl\t\n\t      \tQ̅_MIU^nξ(S^n)Z^n(m,i,u^n,ζ^n,z^n) \n\t\n\n\t      \t= 1/2^nR_M1/2^nR_I   1{u^n(i)=u^n}  P^⊗n_ν(S)Z|U(ζ^n,z^n |u^n). \n\t\n\t\nIn this idealized secrecy system  and for any choice of the codebook 𝒞_U, the pair (M, Ξ^n) is independent of (U^n,Z^n) and I_Q̅(M, Ξ^n; u^n(I) ,Z^n) =0. \n\n\n\n\t\n\tNotice next that by the generalized superposition soft-covering lemma <cit.> and by choosing\n\t\n    R_J > I( V;ν(S),Z|U),\n the distribution Q̅_MIU^n ξ(S^n)Z^n is close to Q_MIU^n ξ(S^n)Z^n, \n\trCl\n      \t\t[ Q̅_MIU^nξ(S^n) Z^n-  Q_MIU^n ξ(S^n)Z^n_1 ≤e^-nγ ]\n\t\n\n       ≥1 -e^-nδ,\n\t    ∀m ∈ℳ,\n\t\t\n\twhere probability is  over the random choice of the codebook.\n\t\n\tBy arguments similar to <cit.> (which use the boundedness of the alphabets), it  also holds that for \n\tany pair of codebooks 𝒞_U and 𝒞_V satisfying \n\t\n    P_MIU^nξ(S^n) Z^n -Q̅_MIU^nξ(S^n)Z^n≤ e^-nγ ,\n\n\twe have  that \n\t\n    | I_P(M,ξ(S^n);Z^n) - I_Q̅(M,ξ(S^n);Z^n) | → 0     as  n→∞.\n\n\tCombined with I_Q̅(M, Ξ^n; u^n(I) ,Z^n) =0 this establishes the desired secrecy requirement. \n\t\n\t\n\n§ CONCLUSIONS AND DISCUSSION\n\n\t\nWe introduced the concept of securing  state-information  (besides the message) from an external eavesdropper in an ISAC scenario. Notice that such a setup nicely unifies  the models for state-communication <cit.> and state-masking <cit.> into a single problem.  Specifically, we proposed a coding scheme for a state-dependent wiretap channel where the receiver wishes to estimate the state with predefined distortion, and information about this state-sequence has to be kept secret from an external eavesdropper. At hand of a Gaussian example, we numerically show the influence of the various security constraints on our achievable rate-distortion region.\n\n\n\nieeetran\n\n\t\n\t\n\n§ SIMPLIFICATION OF THE RATE-CONSTRAINTS FOR Ν(S)=CONST.\n\t\n\t\n\t\tApplying the Fourier-Motzkin elimination algorithm to the rate-constraints (<ref>) and (<ref>) results in the conditions\n\trCl\n\t\tR_M   ≤    I(U,V;Y)-I(U,V;S) \n\t\t\n\n\t\tR_M   ≤    I(V;Y|U)-\tI(V;ν(S),Z|U)\n\t\t\t\n\n\t\tR_M   ≤    I(U,V;Y)-I(V;ν(S),Z|U)-I(U;S)\n\t\n\t \n\n\tIf ν(S)=const., then similarly to <cit.> one can show that without loss in optimality one can restrict to random variables (U,V,X) so that I(U;Y)≥ I(U;S), in which case Constraint (<ref>) is not active and thus can be omitted. To show this, fix a triple (U,V,X) so that I(U;Y)< I(U;S). Then, define the new random variables\n\t\n\t\trCl\n\t\t\tU'    =    (U, Ṽ)\n\n\t\t\tV'   =    V\n\n\t\t\tX'   =     X,\n\t\t\n\t\n\twhere Ṽ is the outcome of passing V to a binary erasure channel with erasure probability ϵ∈ [0,1]. Also choose, ϵ so that \n\trCl\n\t\tI(U';Y)= I(U';S),\n\t\n\twhich is possible by continuity and  because for ϵ=0 we have I(U';Y)> I(U';S) and for ϵ=1 we have I(U';Y)< I(U';S) by assumption. Notice that by an appropriate change of the reconstruction function g,  the new triple (U',V',X') continues to satisfy the distortion constraint (<ref>).\n\t\n\tUnder condition (<ref>), constraints (<ref>) and (<ref>) are equivalent, and we shall thus ignore  (<ref>)  for the new tuple (U',V',X'). Notice further that  when  (U,V,X) is replaced by (U',V',X'),  Constraint (<ref>) remains unchanged whereas   constraint  (<ref>)  is relaxed because I(V; Z|U) ≥ I(V;Z|U')= I(V';Z'|U') due to the Markov chains U→ U' → V  and (U',V')→ (U,V) → Z. We can thus conclude that replacing (U,V,X)  by (U',V',X') relaxes Constraints (<ref>)–(<ref>), and for the latter triple Constraint (<ref>) is inactive. This  proves that for ν(S)=const., Constraints (<ref>)–(<ref>) can be replaced by the two constraints\n\trCl\n\t\tR_M   ≤    I(U,V;Y)-I(U,V;S) \n\t\t\n\n\t\tR_M   ≤    I(V;Y|U)-\tI(V;Z|U)\n\t\n\tand one can restrict to pmfs satisfying I(U;Y)≥ I(U;S).\n\n"}