{"entry_id": "http://arxiv.org/abs/2303.06636v1", "published": "20230312112424", "title": "Strong Converses for Memoryless Bi-Static ISAC", "authors": ["Mehrasa Ahmadipour", "Michele Wigger", "Shlomo Shamai"], "primary_category": "cs.IT", "categories": ["cs.IT", "math.IT"], "text": "\t\n\t=0\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\t\n\n\n\t\n\t[4]\n\tStrong  Converses for  Memoryless Bi-Static ISAC\n    \n\t\tMehrasa Ahmadipour1, Michèle Wigger2, Shlomo Shamai3 \n\t\t\n\t1\n\t\tUMPA, ENS de Lyon\n\t<mehrasa.ahmadipour@ens-lyon.fr>\n\t\t2 LTCI Telecom Paris, IP Paris, 91120 Palaiseau, France, Emails:\n\t\t\t<michele.wigger@telecom-paris.fr>\n\t\t3 Technion, Israel ,  Email: sshlomo@ee.technion.ac.il\n\t\t\n\t\n    \n==============================================================================================================================================================================================================================================================================================\n\n\nThe paper characterizes  the fundamental limits of  integrated sensing and communication (ISAC) systems with a bi-static radar, where the  radar receiver is located close to the transmitter  and  estimates or detects the state based on the transmitter's channel inputs and the backscattered signals. Two models are considered. In the first model, the memoryless state sequence is distributed according to a fixed distribution and the goal of the radar receiver is to reconstruct this state-sequence with  smallest possible distortion. In the second model, the memoryless state is distributed either according to P_S or to Q_S and the radar's goal is to detect this underlying distribution so that the missed-detection error probability has maximum exponential decay-rate  (maximum Stein exponent). Similarly to previous results, our fundamental limits show that the tradeoff between  sensing and communication  solely stems from the empirical statistics of the transmitted codewords which influences both  performances. The main technical  contribution are two strong converse proofs that hold for all probabilities of communication error ϵ and excess-distortion probability or false-alarm probability δ summing to less than 1, ϵ+δ < 1. These proofs are based on  two parallel change-of-measure arguments on the sets of typical sequences, one change-of-measure to obtain the desired bound on the communication rate, and the second to bound the sensing performance.\n\n\n\tIntegrated sensing and communication, strong converse, change of measure arguments.\n\t\n\n\n§ INTRODUCTION\n\nSensing is a promising new feature in the upcoming 6G  <cit.> and  WIFI standards <cit.>. In  particular,  huge technological efforts are  being made to integrate radar systems with communication systems. Such integrated systems are especially appealing for autonomous driving applications or autonomous manufacturing sites (as part of the Industry 4.0). In integrated sensing and communication systems (ISAC), the idea is to use the backscattered signals from communication for radar applications  to sense the environment, detect hazardous events, or infer properties of other terminals (e.g., velocities or directions of other cars). \n\n\n\tWhile ISAC has inspired  a  plethora of works in the signal processing and communications community, see  for example <cit.> and references therein, only few works were reported from the  information-theoretic community <cit.>. The results in <cit.> and the present manuscript all  focus on the system model in Figure <ref> consisting of a transmitter (Tx) sending a message to a receiver (Rx) over a state-dependent discrete memoryless channel (SDMC). A bistatic radar close to the Tx receives the backscattered signal modeled through generalized feedback. Due to the proximity to the Tx, this radar receiver also knows the Tx's  channel inputs and compares them to its feedback outputs. \n\t\n\t\n\tThe works in <cit.> determined the fundamental performance limits of a  detection-version of the model in Figure <ref>.  Specifically in these works, the state sequence {S_t} is assumed constant over time, taking on one of multiple possible values depending on a underlying hypothesis, and the radar receiver aims to guess this hypothesis. Sensing performance is measured in terms of exponential decay-rate of the probability of error, either the minimum exponential decay-rate over all hypotheses  <cit.>  or the set of decay-rates that are simultaneously achievable under the different hypotheses <cit.>. The work <cit.> also studies a  mono-static version of this problem, assuming that Tx coincides with the  radar receiver and thus can use the generalized-feedback signals also for communication purposes. For this mono-static radar scenario however only a coding scheme but no converse is presented. The problem is known to be hard as it relates to the challenging close-loop controlled sensing problem <cit.>. \n\t\n\tThe first information-theoretic work  <cit.> on ISAC determined the fundamental limits of the  rate-distortion version of the ISAC problem in Figure <ref>. assuming that the Tx can use the feedback signals also for coding (i.e., under the close-loop coding assumption).   Extensions to network scenarios and  to scenarios with secrecy constraints were subsequently presented in <cit.>.\n\nIn this paper, we consider both the rate-distortion version and the hypothesis testing  versions of the model in Figure <ref>. In our first model, the state sequence {S_t}_t≥ 1 is independent and identically  distributed (i.i.d.) according to a given distribution P_S and the radar wishes to  reconstruct this state sequence with smallest possible distortion. In our second model, the state-sequence {S_t} depends on a binary hypothesis ℋ∈{0,1}. If ℋ=0, then {S_t} is i.i.d. according to a distribution P_S or if ℋ=1, it is i.i.d.  according to a distribution Q_S. We measure sensing performance in terms of Stein's exponent, i.e., in terms of  the maximum exponential decay-rate of the missed-detection error probability (detecting P_S  instead of Q_S) under a permissible threshold on the false-alarm probability (detecting Q_S  instead of P_S). \n\t\n\t\t\n\n\n\tFor both our models, we determine the fundamental limits of  communication rates and  distortion/missed-detection error exponents that are simultaneously achievable. \n\tSimilarly to previous works <cit.>  our  limits  exhibit a tradeoff between the  sensing and communication performances, which however solely stems from the empirical statistics of the codewords used for communication.\n\n\t\n\tThe direct parts of our proofs follow immediately from existing works. Our contributions are the proofs of the converse results. In fact, we present strong converse proofs  that  hold whenever the maximum allowed probability of communication error ϵ and the maximum allowed distortion-excess probability or false-alarm probability δ satisfy ϵ+δ < 1. The converse proofs are extensions of the channel coding strong converse proof in <cit.> to incorporate also the sensing bounds. Interestingly, the same change-of-measure as in <cit.> can be used to obtain the desired bound on the rate of communication. Different  changes-of-measure are used to obtain the desired bounds on the sensing performances.\n\t\n\tStrong converse proofs based on change-of-measure arguments go back to  Gu and Effros <cit.> and can be also found in various other works, e.g., <cit.>. The proof method was formalized and first applied to channel coding by Tyagi and Watanabe <cit.>. Recent works <cit.> slightly modified and simplified the technique in <cit.> by restricting the new measures to sequences on typical or conditionally-typical sets. This feature allows to circumvent resorting to variational characterizations for the multi-letter and single-letter problems as proposed in <cit.>. Notice that the works <cit.> also showed the utility of the proposed converse proof method for scenarios with expectation constraints, in which case the fundamental limits depend on the permissible error probabilities. \t\n\t\n\t\n\n\t\n\n\n\n\n\nNotation:\nUpper-case letters are used for random quantities and lower-case letters for deterministic realizations. Calligraphic font is used for sets.   All random variables are assumed finite and discrete. We  abbreviate   the n-tuples (X_1,…, X_n) and (x_1,…, x_n) as X^n and x^n and the n-t tuples  (X_t+1,…, X_n) and (x_t+1,…, x_n) as X_t+1^n and x_t+1^n. We further abbreviate independent and identically distributed as i.i.d. and probability mass function as pmf.\n\n  Entropy, conditional entropy, and mutual information functionals are written as H(·), H(·|·), and I(·;·), where the arguments of these functionals are random variables and whenever their probability mass function (pmf)  is not clear from the context, we add it as a subscript  to these functionals. The Kullback-Leibler divergence between two pmfs is denoted by  D(··).  We shall use  𝒯_μ^(n)(P_XY)  to indicate the jointly strongly-typical set with respect to the pmf P_XY on the product alphabet 𝒳×𝒴 and parameter μ as defined in  <cit.>. Specifically, denoting by n_x^n,y^n(a,b) the number of occurrences of the pair (a,b) in sequences (x^n,y^n): \n  \n    n_x^n,y^n(a,b) =  | {t (x_t,y_t)=(a,b)  }| ,\n\n a pair  (x^n,y^n) lies in 𝒯_μ^(n)(P_XY) if \n\n    |  n_x^n,y^n(a,b)/n   - P_XY(a,b) | ≤μ,      ∀ (a,b)∈𝒳×𝒴,\n\nand n_x^n,y^n(a,b)=0 whenever  P_XY(a,b)=0.\n   The conditionally strongly-typical set with respect to a conditional pmf P_Y|X from 𝒳 to 𝒴,  parameter μ>0, and  sequence x^n∈𝒳^n is denoted 𝒯_μ^(n)(P_Y|X, x^n) <cit.>. It contains all sequences y^n∈𝒴^n satisfying \n \n    |  n_x^n,y^n(a,b)/n   -  n_x^n(a)/n P_Y|X(b|a) | ≤μ,      ∀ (a,b)∈𝒳×𝒴,\n\nand  n_x^n,y^n(a,b)=0 whenever P_Y|X(b|a)=0.  Here n_x^n(a) denotes the number of occurrences of symbol a in x^n. In this paper, we denote the joint type of (x^n,y^n) by π_x^ny^n, i.e., \n\n    π_x^ny^n(a,b)≜n_x^n,y^n(a,b)/n.\n\n Accordingly, the marginal type of x^n is written as π_x^n.\n \n \n\n\n \n\n\n\n\n\n\n\n\n§ MEMORYLESS STATE AND AVERAGE DISTORTION AS A SENSING MEASURE\n\n\nConsider the bistatic radar receiver model over a memoryless  channel in Fig. <ref>. A transmitter (Tx) that wishes to communicate a random message M to a receiver (Rx) over a state-dependent channel. The message M is uniformly distributed over the set {1,…, 2^nR} with R>0 and n>0  denoting the  rate and  blocklength of communication, respectively. The channel from the Tx to the Rx depends on a  state-sequence S^n=(S_1,…, S_n) which is i.i.d. according to a given pmf P_S.\n\nFor a given blocklength n, the Tx thus produces the n-length sequence of  channel inputs  \n\n    X^n = ϕ^(n) (M)\n\nfor some choice of the   encoding function ϕ^(n){1,…, 2^nR}→𝒳^n.\n\nBased on X^n and S^n the channel produces the sequences Y^n observed at the Rx and the backscattered signal Z^n. The channel is assumed memoryless and described by the stationary  transition law P_YZ|XS implying that the pair (Y_t,Z_t) is produced according to the channel law P_YZ|XS based on the time-t symbols (X_t,S_t).\n\nThe Rx attempts to guess message M based on the sequence of channel outputs Y^n:\n\n    M̂ = g^(n)(Y^n)\n\nusing a decoding function of the form g^(n)𝒴^n →{1,…, 2^nR}. \n\nPerformance of  communication  is measured in terms of average error probability \n\n    p^(n)(error) :=  [ M̂≠ M ]\n\n\n\n\n\nThe radar receiver produces as a guess a reconstruction of the state sequence \n\n    Ŝ^n = h^(n)(X^n,Z^n),\n\nbased on the inputs and backscattered signals. Radar sensing performance is measured as average expected distortion\n\n    dist^(n)( Ŝ^n , S^n)≜1/n∑_i=1^n   d (Ŝ_i, S_i),\n\nfor a given and bounded distortion function d(·,·). \n\n\nIn this context we have the following definition and result. \n\n\nA rate-distortion pair (R,D) is  (ϵ,δ)-achievable over the state-dependent  channel (𝒳,𝒴, P_Y|XS) with state-distribution P_S, if there exists a sequence of encoding, decoding, and estimation functions {(ϕ^(n), g^(n), h^(n))} such that  the average  probability of error satisfies\n\n    _n→∞  p^(n)(error) ≤ϵ\n\nand the excess distortion probability\n\n    _n→∞[ dist^(n)( Ŝ^n, S^n) > D]≤δ.\n\n\n\n\nFor any ϵ+δ <1, a rate-distortion pair (R,D) is (ϵ,δ)-achievable, if and only if, there exists a pmf P_X \n satisfying\n \n    R = I_P_XP_SP_Y|XS(X;Y)\n\nand \n \n    D ≥𝔼_P_XP_SP_Z|XS[  d(ŝ(X, Z),  S) ]\n\nwhere \n\n    ŝ(x,z) :=min_ŝ∈𝒮̂∑_s P_S|XZ(s|x,z) d( ŝ, s)\n\nand \n    P_S|XZ(s|x,z) := P_S(s) P_Z|XS(z|x,s)/∑_s' P_S(s') P_Z|XS(z|x,s')\n\n\n \n\n\nThe limiting case ϵ, δ↓ 0 of the theorem was already proved in <cit.>. Achievability of the theorem  follows thus directly from  this previous result. The converse is proved in the following \nsubsection, also using the next lemma, which is from <cit.>.\n\n\n\nWithout loss in optimality, one can restrict to the per-symbol estimator\n\n    h^(n)(x^n,z^n)= (ŝ(x_1,z_1), …, ŝ(x_n,z_n) ).\n\n\n\n\t\n\n §.§ Strong Converse Proof\n\n\n\nFix a sequence of  encoding and decoding functions {(ϕ^(n), g^(n))}_n=1^∞ and consider the  optimal estimator h^(n) in Lemma <ref>. Assume that   (<ref>)  and (<ref>) are satisfied. For readability, we will also write x^n(·) for the function ϕ^(n)(·). \n\nChoose a sequence of small positive numbers  {μ_n }_n=1^∞ satisfying\n\n    lim_n→∞μ_n      =    0 \n    lim_n→∞(n ·μ_n^2  )^-1    =    0.\n \n\n\n\nExpurgation:\n\nFix η∈ (0,1-ϵ-δ] and let  ℳ̃ be the set of messages m that satisfy the following two conditions:\n\n\trCl \n\t\t[M̂ ≠M|M=m ]    ≤     1-η \n\n\t\t[ dist^(n)( Ŝ^n, S^n) > D |M=m ]    ≤    1-η. \n\t\n\nSince the set of messages  not satisfying  (<ref>) is at most of size \n\n    ϵ/(1-η) 2^nR,\n\nand similarly also the set of \nmessages  not satisfying  (<ref>) is of size at most  δ/(1-η)2^nR, we can deduce that the set ℳ̃ (which is the complement of the union of these two sets) is of size at least \n\n    (1-  ϵ+δ/1-η)2^nR=(1-η - ϵ-δ)/(1-η)2^nR.\n\nDefine the random variable M̃ to be uniform over the set ℳ̃ and let \n\n    X̃^n=x^n(M̃),\n\nand thus \n\n    |ℳ̃|/2^nR≥(1-  ϵ+δ/1-η)= : γ.\n\n\nLet T  be a uniform random variable over {1,…, n}, independent of all other random variables and notice that \nrCl \n\tP_X̃_T(x)    =    1/n ∑_t=1^n P_X̃_t(x) \n\n\t    =     1/n ∑_t=1^n 𝔼[1{ X̃_t(M̃)=x}]\n\n\t   =      𝔼[π_x^n(M̃)(x) ]. \n\nLet now {n_i} be an increasing subsequence of blocklengths so that the probability vector P_X̃_T converges and denote the convergence point by P_X:\nrCl\n\tlim_n_i →∞  1/|ℳ̃| ∑_m∈M̃    π_x^n_i(m)(x) \n    =:     P_X(x), \n\t    ∀x ∈𝒳.  \nIn the remainder of this proof, we restrict attention to this subsequence of blocklengths {n_i}.\n\n\n\nProof of Channel Coding Bound:\nWe first prove the converse bound for channel coding. To this end, consider the two conditions\n\n\trCl \n\t\tg^(n)( y^n)    =    m  \n\n\n\t\t\n\t\t| π_s^n,x^n(m),y^n(a,b,c) - P_S(a) π_x^n(m)(b) P_Y|XS(c|a,b) |    ≤    μ_n , \n\n\t\n\nand define for  each message m ∈ℳ̃ the set \nrCl \n\t𝒟_𝒞,m    :=     {  (s^n,y^n)    (<ref>)   and   (<ref>) }. \n\t\n\t\n\nIntroduce the   new random variables (S^n_𝒞,Y^n_𝒞) of  joint conditional pmf\nrCl \n\t\n\t\tP_S^n_𝒞 Y^n_𝒞|M̃ (s^n,y^n|m)  \n\n\t   =      P_S^⊗n(s^n) ·P_Y|XS^⊗n(y^n |x^n(m), s^n)/  Δ_𝒞,m ·1 { (s^n,y^n) ∈𝒟_𝒞,m },\n\n\nfor \nrCl\n\tΔ_𝒞,m :=  ∑_s^n,y^n P_S^⊗n(s^n) ·P_Y|XS^⊗n(y^n |x^n(m), s^n)    \n\n\t        ·1 { (s^n,y^n) ∈𝒟_𝒞,m }.\n\n\n\n\n\nBy  <cit.> and Conditions (<ref>) and (<ref>), we have:\nrCl\n\t\n\t\n\tΔ_𝒞,m≥η-|𝒮||𝒳||𝒴|/4μ_n^2 n,   ∀m ∈ℳ̃.\n \nMoreover, for \nM̃=m:\nrCl\n\t\tP_Y^n_𝒞|M̃=m(y^n) \n\n\t   =      ∑_s^n  P_S^⊗n(s^n) ·P_Y|XS^⊗n(y^n |x^n(m), s^n)/  Δ_𝒞,m ·1 { (s^n,y^n) ∈𝒟_𝒞,m } \n\n\n\t   ≤   ∑_s^n  P_S^⊗n(s^n) ·P_Y|XS^⊗n(y^n |x^n(m), s^n)/  Δ_𝒞,m \n\n\t    =      P_Y|X^⊗n(y^n|x^n(m))/Δ_𝒞,m. \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContinue to notice that:\nrCl\n\tR    =    1/n H(M̃)    - 1/n logγ\n\n\t\n\t    (a)=    1/n  I( M̃ ; Y_𝒞^n)-  1/n logγ\n\n\t    =   1/n  H(Y^n_𝒞) -1/n H(Y_𝒞^n |M̃ )- 1/n logγ\n\n\t    \t≤     1/n  ∑_i=1^n H(Y_𝒞,i) \t-\t1/n H(Y_𝒞^n|M̃) - 1/n logγ\n\n\t   =    H(Y_𝒞,T |T)- 1/n H(Y_𝒞^n|M̃) - 1/n logγ\n\n\t   ≤    H(Y_𝒞,T)- 1/n H(Y_𝒞^n|M̃)   -1/n logγ,\n\nwhere we defined the random variable T to be uniform over {1,…,n} independent of the other random variables.  Here, (a) holds because M̃=g(Y^n_𝒞) by Condition (<ref>).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNotice next that \nrCl\n\tP_X̃_TS_𝒞,𝒯Y_𝒞,T(x,s,y)   \n\n\t   =   1/n  ∑_t=1^n P_X̃_tS_𝒞,tY_𝒞,t(x,s,y) \n\n\t   =   1/n  ∑_t=1^n 𝔼[ 1{X̃_t,S_𝒞,t,Y_𝒞,t)=(x,s,y)}] \n\n\t   =    [  π_x^n(M̃)S_𝒞^nY_𝒞^n(x,s,y)]  \n\t\n\t\n\t\n\nHowever, by Condition (<ref>) \nfor any triple (x,s,y) with positive P_S(s) P_Y|XS(y|x,s) the following inequality is satisfied with probability 1:\nrCl\n\t|π_x^n(m)S^n_𝒞Y_𝒞^n(x,s,y) -  π_x^n(m)(x) P_Y|XS(y|x,s)P_S(s) | \n\n\t        ≤μ_n.  \n\n\n\n\n\n\nNotice that  by (<ref>) and (<ref>) and \nsince μ_n_i→ 0 as n_i→∞:rCl\n\tlim_i →∞ P_ X̃_TS_𝒞,TY_𝒞,T(x,s,y)= P_X(x) P_S(s)P_Y|XS(y|x,s),  \nwhich by continuity of the entropy functional implies \n\n    lim_n_i→∞  H(Y_𝒞,T) =H_P_XP_SP_Y|XS(Y).\n\n\n\nNext, by  definition and by (<ref>):\nrCl\n\t1/n_i H(Y^n_i_𝒞 |M̃=m)  \n\n\t    =    - 1/n_i  ∑_y^n ∈𝒟_𝒞,m P_Y^n_i_𝒞|M̃=m(y^n_i) logP_Y_𝒞^n_i|M̃=m(y^n_i) \n\n\t    ≥   - 1/n_i  ∑_y^n_i ∈𝒟_𝒞,m P_Y^n_i_𝒞|M̃=m(y^n_i) logP_Y|X^⊗n(y^n_i|x^n_i(m))/ Δ_𝒞,m \n \n\n\t    =    -1/n_i ∑_t=1^n_i  ∑_y^n_i ∈𝒟_𝒞,m P_Y^n_i_𝒞|M̃=m(y^n_i) logP_Y|X(y_t|x_t(m)) \n\n\t        + 1/n_i logΔ_𝒞,m, \n\n\t    =    -1/n_i ∑_t=1^n_i  ∑_y_t∈𝒴 P_Y_𝒞,t|M̃=m(y_t) logP_Y|X(y_t|x_t(m)) \n\n\t       + 1/n_i logΔ_𝒞,m, \n\n\t    =    -1/n_i ∑_t=1^n_i  ∑_y∈𝒴  [   1{ Y_𝒞,t=y } |M̃=m] logP_Y|X(y|x_t(m)) \n\n\t      + 1/n_i logΔ_𝒞,m,\n\n\t    =    -   ∑_x∈𝒳 ∑_y∈𝒴 [1/n_i    ∑_t=1^n_i  1{x_t(m)=x,Y_𝒞,t=y } |M̃=m] \n\n\t       ·logP_Y|X(y|x)  \n\n\t       + 1/n_i logΔ_𝒞,m, \n\n\t\n\t    =    - ∑_x∈𝒳 ∑_y∈𝒴 ∑_s∈𝒮  [ π_x^n_i(m)S^n_i_𝒞 Y_𝒞^n_i(x,s,y)|M̃=m]\n\n\t       ·logP_Y|X(y|x)  \n\n\t      + 1/n_i logΔ_𝒞,m,\n\t\n\t\n\t\n\nwhere P_Y|X(y|x)=∑_s∈𝒮 P_Y|XS(y|x,s) P_S(s).\nAveraging over all messages m∈ℳ̃, we obtain:\nrCl\n\t1/n_iH(Y^n_i_𝒞 |M̃) \n\n\t   ≥    - ∑_x∈𝒳   ∑_y∈𝒴  ∑_s∈𝒮   [ π_x^n_i(M̃)S^n_i_𝒞Y_𝒞^n_i(x,s,y)  ] ·logP_Y|X(y|x) \n\n\t       +   [  1/n_i logΔ_𝒞,M̃].\n\n\n\nBy (<ref>) the term  E[  1/n_ilogΔ_𝒞,M̃] vanishes for increasing blocklengths, and thus using the definition of  P_X in (<ref>), \nfone can follow the same bounding steps as leading to (<ref>) to obtain: \nrCl\n\tlim_i→∞ 1/n_i H(Ỹ^n_i |M̃)  \n\n\t   =    - ∑_x∈𝒳 P_X(x) ∑_y ∈𝒴 ∑_s∈𝒮 P_S(s) P_Y|XS(y|x,s) logP_Y|X(y|x) \n\n\t   =   H_P_XP_SP_Y|XS(Y|X).\n\n\nCombining (<ref>) with (<ref>) and (<ref>), and since 1/n_ilogγ→ 0  as n→∞, we can conclude that \nrCl\n\tR    ≤    H_P_XP_SP_Y|XS(Y) - H_P_XP_SP_Y|XS(Y|X) \n\n\t   =     I_P_XP_SP_Y|XS(X;Y).\n\n\n\n\n\n\nProof of Distortion Bound:\nConsider the two conditions\n\n\trCl \n\t\tdist^(n)(h^(n)(x^n(m),z^n) , s^n)     ≤    D \n  \n\n\t\t| π_s^n,x^n(m),z^n(a,b,c) - P_S(a) π_x^n(m)(b) P_Z|XS(c|a,b) |    ≤    μ_n , \n\n\t\n\nand define for  each message m ∈ℳ̃ the set \nrCl \n\t𝒟_𝒮,m    :=     {  (s^n,z^n)    (<ref>)   and   (<ref>) }. \n\t\n\t\n\n\nRecall the definition X̃^n=x^n(M̃) and the limit in (<ref>).  \nDefine  the   new random variables (S^n_𝒮, Z^n_𝒮) of  joint conditional pmf\nrCl \n\t\n\t\tP_S^n_𝒮Z^n_𝒮|M̃ (s^n,z^n|m)  \n\n\t   =    P_S^⊗n(s^n) ·P_Z|XS^⊗n( z^n |x^n(m), s^n)/  Δ_𝒮,m  ·1 { (s^n,z^n) ∈𝒟_𝒮,m }, \n\n\nfor \nrCl\n\tΔ_𝒮,m := ∑_s^n,z^n P_S^⊗n(s^n) ·P_Z|XS^⊗n(z^n |x^n(m), s^n)    \n\n\t        ·1 { (s^n,z^n) ∈𝒟_𝒮,m }.\nNotice that by  <cit.> and Conditions (<ref>) and  (<ref>), we have:\nrCl\n\t\n\t\n\tΔ_𝒮,m≥η-|𝒮||𝒳||𝒵|/4μ_n^2 n,     ∀m ∈ℳ̃.  \n\n\nFollowing similar steps to (<ref>)–(<ref>), by (<ref>) and definition (<ref>),  we can conclude that \nrCl\n\tlim_n_i →∞ P_ X̃_TS_𝒮,TZ_𝒮,T(x,s,z) = P_X(x) P_S(s)P_Z|XS(z|x,s). \n\n\t\n\n\nBy Condition (<ref>), we have  with probability 1: \nrCl\n\tD     ≥   1/n  ∑_t=1^n d ( ŝ(X̃_t, Z_𝒮,t)  ,   S_𝒮,t).\n\nTherefore, \nfor any blocklength n_i:\nrCl\n\tD     ≥   1/n_i  ∑_j=1^n_i  𝔼[ d ( ŝ(X̃_j, Z_𝒮,j)  ,   S_𝒮,j)]  \n\n\t    =     𝔼[ d ( ŝ(X̃_T, Z_𝒮,T)  ,   S_𝒮,T) ],\n\nand by (<ref>) in the limit as n_i→∞:\nrCl\n\tD     ≥    𝔼_P_XP_SP_Z|XS[ d ( ŝ(X, S)  ,    S) ].\n\nThis concludes the proof of the converse.\n\n\n\n\n\n\n\n§ STEIN'S EXPONENT AS A  SENSING MEASURE\n\nIn this section we assume that the state-sequence S^n depends on a binary hypothesis ℋ∈{0,1}. Under the null hypothesis ℋ=0 it is i.i.d. according to the pmf P_S and under the alternative hypothesis ℋ=1 it is  i.i.d. according to the pmf Q_S. The radar receiver  attempts to guess the underlying hypothesis based on the inputs and backscattered signals, so it produces a guess of the form \n    ℋ̂ = h^(n)(X^n,Z^n) ∈{0,1}.\n\n \n\n\nRadar sensing performance is measured in terms of Stein's exponent. That means, it is required that the type-I error probability \n\n    α_n:=[  ℋ̂=1|ℋ=0]\n stays below a given threshold, while the type-II error probability \n\n    β_n :=[  ℋ̂=0|ℋ=1]\n\nshould decay exponentially fast to 0 with largest possible exponent. \n\n\n\n\n\nA rate-exponent pair (R,E) is  (ϵ,δ)-achievable over the state-dependent  DMC (𝒳,𝒴, P_Y|XS) with state-distribution P_S, if there exists a sequence of encoding, decoding, and estimation functions {(ϕ^(n), g^(n), h^(n))} such that for each blocklength n the average  probability of error satisfies \n\n    _n→∞ p^(n)(error) ≤ϵ,     ℋ∈{0,1},\n\nwhile the detection error probabilities satisfy:  \n\n    _n→∞α_n≤δ,\n\nand \n\n    -_n→∞1/nlogβ_n≥ E.\n\n\n\n\nFor any ϵ, δ≥ 0 satisfying ϵ+δ <1, a rate-exponent pair (R,E) is (ϵ,δ)-achievable, if and only if, there exists a pmf P_X \n satisfying\n \n    R ≤min{ I_P_XP_SP_Y|XS(X;Y),   I_P_XQ_SP_Y|XS(X;Y)},\n\nand \n \n    E ≤𝔼_P_X[D( P_Z|X Q_Z|X) ]\n\nwhere P_Z|X and Q_Z|X denote the conditional marginals of P_SP_Z|XS and  Q_SP_Z|XS, respectively.\n\n\n \n\nAchievability follows by standard random coding for a compound channel and by applying a Neyman-Pearson test at the radar receiver. The converse is proved in Appendix <ref>.\n\n\n\nThe works in <cit.>  consider degenerate state-distributions where P_S and Q_S are deterministic distributions. In this case, our Theorem simplifies as follows.[Recall that  <cit.>  required exponential decrease both for the type-I and type-II error probabilities α_n and β_n. Their result is thus not a special case of ours.] \n\n\nAssume degenerate state-distributions P_S(s_0)=1 and Q_S(s_1)=1 for two distinct symbols s_0,s_1∈𝒮. Then, for any ϵ, δ≥ 0 satisfying ϵ+δ <1, a rate-exponent pair (R,E) is (ϵ,δ)-achievable, if and only if, there exists a pmf P_X \n satisfying\n \n    R ≤min{ I_P_XP_Y|X^(s_0)(X;Y),    I_P_XP_Y|X^(s_1)(X;Y)},\n\nand \n \n    E ≤𝔼_P_X[D( P_Z|XS(·|X,s_0) P_Z|XS(·|X,s_1) ] ,\n\nwhere P_Y|X^(s)(y|x)≜ P_Y|XS(y| x,s) for any triple (x, s, y).\n\n\n\n\n§ CONCLUSION AND FUTURE DIRECTIONS\n\nIn this paper we established the strong converse for two ISAC problems with bi-static radar whenever ϵ+δ < 1. Interesting future research directions include extensions to mono-static radar systems where the transmitter can apply closed-loop encodings depending also on past generalized feedback systems or  systems with memory. Analyzing other sensing criteria is also of interest, such as the minimum exponential decay-rate over all hypotheses or the estimation error when the distribution of the state-sequence depends on a single continuous-valued parameter.\nThe setup where only part of the state or a noisy version of the state is to be estimated is also of interest, for instance, in scenarios in  state-dependent fading channels where one \n\thas no interest in estimating the fading. Notice that this setup is included in the rate-distortion model through an appropriate definition of the distortion measure. On a related note, our model also includes as special case the setups where the receiver has perfect or imperfect channel-state information by including this state-information as part of the output. \n\t\n\nieeetran\n\n\n\n\n\n\n§ STRONG CONVERSE PROOF\n\n\n\nFix a sequence of  encoding,  decoding, and estimation functions {(ϕ^(n), g^(n), h^(n))}_n=1^∞. Assume that   (<ref>)  and (<ref>) are satisfied. For readability, we will also write x^n(·) for the function ϕ^(n)(·). \nChoose a sequence of small positive numbers  {μ_n } satisfying\n\n    lim_n→∞μ_n      =    0 \n    lim_n→∞(n ·μ_n^2  )^-1    =    0.\n \n\n\nExpurgation: Fix η∈ (0,1-ϵ-δ] and let  ℳ̃ be the set of messages m that satisfy the following two conditions:\n\nrCl \n[M̂ ≠M|M=m ]    ≤   1-η\n\n\n[  ℋ̂=1|ℋ=0 , M=m ]    ≤    1-η.\n \n \n The size of the set  ℳ̃ satisfies \n\n    |ℳ̃|/2^nR≥(1-  ϵ+δ/1-η)= : γ.\n\n Define the random variable M̃ to be uniform over the set ℳ̃ and X̃^n=x^n(M̃).\n \n Let T be uniform over {1,…, n} independent of all other quantities  and notice that \nrCl \nP_X̃_T(x)   =      𝔼[π_x^n(M̃)(x) ]. \n \n\nConsider an increasing subsequence of blocklengths n_i so that the probabilities P_X̃_T(x) converge and denote the convergence point by P_X: \n \n    lim_n_i →∞ P_X̃_T= P_X(x),      x ∈𝒳.\n \n \n\n\nProof of Channel Coding Bound:  Considering the sequence of blocklengths {n_i}_i=1^∞ and following  steps (<ref>)–(<ref>) in the previous Section <ref>, once with the pmf P_S and  once with the pmf Q_S, one can show that \n\n    R ≤min{ I_P_XP_SP_Y|XS(X;Y),    I_P_XQ_SP_Y|XS(X;Y)},\n\nwhere P_X denotes the pmf in (<ref>). \n\n\n\nProof of Stein's Exponent:\nConsider conditions \n\nrCl \nh^(n)(x^n(m),z^n)  )     =     0\n  \n\n | π_s^n,x^n(m),z^n(a,b,c) - P_S(a) π_x^n(m)(b) P_Z|XS(c|a,b) |    ≤    μ_n , \n\n \n \nand define for  each message m ∈ℳ̃ the set \nrCl \n𝒟_𝒮,m    :=     {  (s^n,z^n)    (<ref>)   and   (<ref>) }. \n\n\n\nDefine  the   new random variables (Y^n_𝒮, Z^n_𝒮) of  joint conditional pmf\nrCl \n\nP_S^n_𝒮  Z^n_𝒮|M̃ (s^n, z^n|m)  \n\n   =    P_S^⊗n(s^n) ·P_Z|XS^⊗n( z^n |x^n(m), s^n)/  Δ_𝒮,m  ·1 { (s^n,z^n) ∈𝒟_𝒮,m },\n\n\nfor \nrCl\nΔ_𝒮,m := ∑_s^n,z^n P_S^⊗n(s^n) ·P_Z|XS^⊗n( z^n |x^n(m), s^n)    \n\n        ·1 { (s^n,z^n) ∈𝒟_𝒮,m }.\nBy  <cit.> and Conditions (<ref>) and  (<ref>), we have:\nrCl\n\n\nΔ_𝒮,m≥η-|𝒮||𝒳||𝒵|/4μ_n^2 n,     ∀m ∈ℳ̃.  \n\n\nFollowing similar steps to (<ref>)–(<ref>), we can conclude that \nrCl\nlim_n_i →∞ P_ X̃_TS_𝒮,TZ_𝒮,T(x,s,z)     \n\n     =     P_X(x) P_S(s)P_Z|XS(z|x,s). \n\n\nWe next notice the inequalities:\nrCl\nβ_n     =     [ ℋ̂=0 |ℋ=1] \n\n   =      1/2^nR ∑_m=1^2^nR [ ℋ̂=0 |ℋ=1, M=m] \n\n\n   ≥    |ℳ̃|/2^nR ·1/|ℳ̃| ∑_m∈ℳ̃ [ ℋ̂=0 |ℋ=1, M̃=m] \n\n    ≥      γ·𝔼_M̃[ [ ℋ̂=0 |ℋ=1, M̃=m] ],\n\nand therefore, \nrCl\n- 1/n logβ_n  \n\n    ≤    - 1/n log𝔼_M̃[ [ ℋ̂=0 |ℋ=1, M̃=m] ] - 1/n logγ,\n\n\nwhere notice that the term 1/nlogγ vanishes asymptotically for infinite blocklengths. \n\nDefining \nrCl Q_Z|X(z|x)   :=    ∑_s Q_S(s) P_Z|SX(z|x,w)\n\nP_Z|X(z|x)   :=    ∑_s P_S(s) P_Z|SX(z|x,w),\n\n we can further obtain: \nrCl\n - 1/n log𝔼_M̃[ [ ℋ̂=0 |ℋ=1, M̃=m] ]\n\n    =    - 1/n logP_X̃^n Q_Z|X^⊗n(ℋ̂=0) \n\n    =    1/n D( P_X̃^nZ_𝒮^n  (ℋ̂)     P_X̃^n Q_Z|X^⊗n (ℋ̂) ) \n\n    ≤   1/n D( P_X̃^nZ_𝒮^n     P_X̃^n Q_Z|X^⊗n ) \n\n\n\n\n    =    1/n ∑_m ∈ℳ̃  1/|ℳ̃| ∑_z^n P_ Z_𝒮^n|X̃^n(z^n|x^n(m)) \n\n        ·log P_ Z_𝒮^n|X̃^n(z^n|x^n(m))/ Q_Z|X^⊗n(z^n|x^n(m) )  \n\n     ≤   1/n ∑_m ∈ℳ̃  1/|ℳ̃| ∑_z^n P_ Z_𝒮^n|X̃^n(z^n|x^n(m))     \n\n        ·log P_ Z|X^⊗n (z^n|x^n(m))/ Q_Z|X^⊗n(z^n|x^n(m) )    \n\n        - 1/n ∑_m ∈ℳ̃  1/|ℳ̃|  logΔ_𝒮,m\n\n      =    1/n ∑_x^nP_X̃^n Z_𝒮^n(x^n,z^n) log P_ Z|X^⊗n (z^n|x^n)/ Q_Z|X^⊗n(z^n|x^n ) \n\n         - 1/n 𝔼[  logΔ_𝒮,M̃ ] \n\n       =    1/n ∑_t=1^n ∑_x_t,z_t P_X̃_t Z_𝒮,t (x_t,z_t) log P_ Z|X (z_t|x_t)/ Q_Z|X(z_t|x_t )  \n\n         - 1/n 𝔼[  logΔ_𝒮,M̃ ] \n\n        =     ∑_x,z P_X̃_T Z_𝒮,T (x,z) log P_ Z|X (z|x)/ Q_Z|X(z|x)  \n\n           - 1/n 𝔼[  logΔ_𝒮,M̃ ].\n\n\nCombining (<ref>), (<ref>), and (<ref>), and considering the subsequence of blocklengths {n_i}, we conclude  that \n\n    _i→∞ - 1/nlogβ_n_i≤𝔼_P_X[ D(P_Z|X Q_Z|X)  ],\n\nwhere we used that 1/n𝔼[  logΔ_𝒮,M̃] → 0 as n_i→∞ by (<ref>).\nThis concludes the proof of the converse.\n\n\n\n"}