{"entry_id": "http://arxiv.org/abs/2303.06634v1", "published": "20230312111810", "title": "Frequency-dependent Discrete Implicit Monte-Carlo Scheme for the Radiative Transfer Equation", "authors": ["Elad Steinberg", "Shay I. Heizler"], "primary_category": "physics.comp-ph", "categories": ["physics.comp-ph", "astro-ph.IM", "physics.plasm-ph"], "text": "\n\n \n\n\nelad.steinberg@mail.huji.ac.il\nRacah Institute of Physics, The Hebrew University, 9190401 Jerusalem, Israel\n\nshay.heizler@mail.huji.ac.il\nRacah Institute of Physics, The Hebrew University, 9190401 Jerusalem, Israel\n\n\nThis work generalizes the discrete implicit Monte-Carlo (DIMC) method for modeling the radiative transfer equation from a gray treatment to an frequency-dependent one. The classic implicit Monte-Carlo (IMC) algorithm, that has been used for several decades, suffers from a well-known numerical problem, called teleportation, where the photons might propagate faster than the exact solution due to the finite size of the spatial and temporal resolution. The Semi-analog Monte-Carlo algorithm proposed the use of two kinds of particles, photons and material particles that are born when a photon is absorbed. The material particle can `propagate' only by transforming into a photon, due to black-body emission. While this algorithm produces a teleportation-free result, it is noisier results compared to IMC due to the discrete nature of the absorption-emission process. In a previous work [Steinberg and Heizler, ApJS, 258:14 (2022)], proposed a gray version of DIMC, that makes use of two kinds of particles, and therefore has teleportation-free results, but also uses the continuous absorption algorithm of IMC, yielding smoother results. This work is a direct frequency-dependent (energy-dependent) generalization of the DIMC algorithm. We find in several one and two dimensional benchmarks, that the new frequency-dependent DIMC algorithm yields teleportation-free results on one hand, and smooth results with IMC-like noise level.\n\n\nFrequency-dependent Discrete Implicit Monte-Carlo Scheme for the Radiative Transfer Equation\n    Shay I. Heizler0000-0002-9334-5993\n    \n============================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe radiative transfer equation (RTE) is the key equation for modeling the transport of photons that interact with the matter, calculating the specific intensity of the phase space density of photons <cit.>. Solving the RTE is crucial for understanding many astrophysical phenomena (e.g. supernova, shock breakout etc.) <cit.>, as well as the modeling of inertial confinement fusion (ICF) <cit.> and in general high energy density physics (HEDP) <cit.>. \n\nThe RTE is the Boltzmann equation for photons, where the main physical events are absorption and black-body emission through the opacity of the material, which is usually a function of the temperature and the density of the material (under the assumption that the matter itself is in local-thermodynamic equilibrium, and the electrons are distributed with the Maxwell-Boltzmann distribution with a given temperature) <cit.>. In addition, scattering terms may be involved also, which can be elastic like the Thomson approximation or inelastic using the full Compton treatment <cit.>. \n\n\nThe Boltzmann equation is an integro-differential equation, where in the three-dimensions the phase space contains 7 independent variables, 3 spatial, 3 velocity components (usually replaced by energy and direction) and time <cit.>. A full analytic solution is rare, and can be achieved in very simplified problems. For general purposes, and specifically in higher dimensions, numerical solution are used, where the two main approaches is solving numerically the deterministic Boltzmann equation for photons, or using statistical approaches, such as Monte-Carlo techniques. The most common approximations for solving the deterministic Boltzmann equation are the spherical harmonics method (also known as the P_N approximation), where the intensity is decomposed into its moments <cit.>, and the discrete ordinates method (also known as the S_N method) where the intensity is solved on some discrete selected ordinates <cit.>. The statistical approaches use a particle based Monte-Carlo (MC) approach, where the most common one for radiative transfer is called the implicit Monte-Carlo (IMC) method, by Fleck and Cummings <cit.>. \n\nThe major innovation in IMC was the implicitization of the Boltzmann equation <cit.>. Since the radiation is coupled to the matter via black-body emission, the explicit way to solve the radiation transport is to use the temperature from the beginning of the time-step. In optically-thin media, this assumption is reasonable, where the matter and the radiation may differ significantly. However, in optically-thick media, where the radiation and matter energy may be both large, but similar to each other, there is a need for very small time-steps in order to keep the solution stable. Fleck and Cummings <cit.> have offered an implicit version of radiative Monte-Carlo by finite-differencing the matter energy equation, and substituting it into the radiation Boltzmann equation. This enables the use of sufficiently large time steps, even in optically thick media, and enables the radiative transfer to be modeled using reasonable computer resources. The second novelty of IMC is the use of implicit (or continuous) absorption algorithm <cit.>. Instead of treating the mechanism of absorption as discrete statistically events, the photon deposits its energy along its track in the spatial cells. This algorithm enables significantly smoother results than the naïve explicit MC. The IMC algorithm, with some modifications and improvements is being used during the last five decades <cit.>.\n\nHowever, IMC suffers from a well-known numerical disadvantage, called teleportation, where the photons propagate faster than they should due to finite spatial resolution and time-steps <cit.>. In the simplest IMC implementation, when photons reach a cold opaque cell, they are absorbed in the outer part of the cell, due to the small mean free path (mfp), changing slightly the temperature of the cell. In the next time-step, the photons that are emitted due to black-body emission are sampled uniformly from the whole volume of the cell, which causes artificial propagation. Moreover, at a finite spatial resolution, this may lead to a certain `magic' time-step in which the results are correct, while deceasing the time-step further, increases the numerical error <cit.>. One elegant way to solve this problem, called semi-analog MC (SMC) and proposed by Ahrens and Larsen <cit.>, uses two kind of particles, photons and matter-particles. A photon propagates with the speed of light c in the medium until it is absorbed, where it becomes a material particle (with zero-velocity). The material particle can transform into a photon due to a black-body emission process. In this way, the creation of photons can only be from the positions that they were absorbed, and the teleportation errors are avoided. Unfortunately, this scheme is explicit, and thus, enforces a small time-step when involving optically thick regions.\n\nRecently, in a seminal work, Poëtte and Valentin offered an implicit version of SMC, ISMC, that enables the use of sufficiently large time steps <cit.>. This new method offers a new implicitization technique that changes the RTE and the matter energy equation to be linear in both the radiation specific intensity and the matter-energy, and can be modeled via Monte-Carlo techniques using photons and material particles. The method was verified against one-dimensional gray benchmarks involving opaque media, yielding results that did not suffer from teleportation errors. Later, the ISMC method was generalized to frequency-dependent problems, yielding excellent results against many benchmarks, gray and frequency-dependent, both in 1D and 2D geometries (in both XY and RZ symmetries) <cit.>. \n\nAnother important work was published recently by Poëtte, Valentin and Bernede, that cancels the teleportation error within the frame of legacy (gray) IMC codes, called nssIMC (for no-source-sampling  IMC) <cit.>. The work presents the very few modifications that have to be done in legacy IMC codes, where the classic source sampling is canceled, and the source events are treated as `collisions events', thus teleportation is avoided. However, nssIMC converges slower than ISMC in both the spatial resolution and finite time steps (please see Fig. 3 in <cit.>). In addition, nssIMC produces noisier results in a given resolution comparing to ISMC (Fig. 4 in <cit.>) and is less robust. Therefore, where the ISMC modifications are allowable, the authors recommend to opt for ISMC rather than nssIMC.\n\nHowever, both SMC and ISMC yield noisier results compared to IMC, due to the discrete treatment of the absorption and black-body emission processes. In addition, since the total number of particles, both photons and material particles is constant, problems that have a big difference between the heat-capacities of the radiation and the material requires a large statistic to converge. Recently a new algorithm was offered, called discrete implicit Monte-Carlo (DIMC) <cit.> that uses the idea of two kinds of particles on one hand, and thus yields teleportation-free results, and uses the algorithm, of continuous (implicit) absorption on the other hand, yielding smooth results as IMC. This is attainable due to an algorithm that avoids the population of particles from exploding, and retaining the correct angular and spatial distributions. DIMC was derived using the IMC linearization, but this wasn't a mandatory choice, it could have been derived via the ISMC linearization and implicitization as well. This algorithm was tested against several gray benchmarks, both in 1D (with or without hydrodynamics) and 2D. In this work we expand the DIMC method to include frequency-dependent problems. The new frequency-dependent DIMC method will be examined against all the the frequency-dependent benchmarks that were tested using ISMC in <cit.>. We repeat the frequency-dependent benchmarks from <cit.>, adding to each figure the comparable DIMC result. \n\nThis work is structured as follows: In Sec. <ref> we present the frequency-dependent version of DIMC. In Sec. <ref> we present several 1D frequency-dependent benchmarks, while in Sec. <ref> we present a 2D frequency-dependent benchmark.  We finish with a short conclusions section in Sec. <ref>.\n\n\n\n§ FREQUENCY-DEPENDENT DIMC\n\n\n\nThe basic derivation is the classic derivation of IMC implicitization and linearization.\nFor the case of elastic (Thomson) scattering, the RTE and the coupled energy-balance equation for the material energy are <cit.>:\n\n\n\n    1/c∂ I(r,Ω,ν,t)/∂ t+Ω·∇ I(r,Ω,ν,t)   =\n        [t]\n           -(σ_a(ν,T)+σ_s(ν,T))I(r,Ω,ν,t)+σ_a(ν,T)B(ν,T)\n       +σ_s(ν,T)∫_4πI_ν(r,Ω',t)/4πdΩ'\n    \n    ∂ e(T)/∂ t   =c ∫_0^∞[σ_a(ν',T)(∫_4πI(r,Ω',ν',t)dΩ'-4π B(ν',T))dν' ],\n\n\nwhere I(r,Ω,ν,t) is the radiation specific intensity for a unit space r, unit direction Ω and unit frequency ν at time t, σ_a(ν,T) is the absorption cross-section (opacity) which is a function of the material temperature T and the frequency, σ_s(ν,T) is the scattering cross-section, e(T) is the thermal energy per unit volume of the medium, c is the speed of light and B(ν,T)=2hν^3/c^2(exp(hν/k_BT)-1)^-1 is the Planck function (h is the Planck constant and k_B is the Boltzmann constant).\n\nNote that the frequency integration over B(ν,T) is called the frequency integrated Planck function which equals to B(T)=aT^4/4π and a is the radiation constant. We define a convenient function which is the ratio of the Planck function to the frequency integrated one b(ν,T)≡ B(ν,T)/B(T)=4π B(ν,T)/aT^4.\n\nThe basic idea behind IMC, is to define the Fleck parameter,\n\n    f=1/1+βσ_a,P(T) c  Δ t\n\nwhere β≡∂ aT^4/∂ e is the ratio between the radiation and material heat capacities <cit.> (which is taken at the beginning of the time-step), Δ t is the discretized time-step and σ_a,p(T) is the Planck opacity σ_a,p(T)≡∫_0^∞σ_a(ν,T)b_ν dν (also taken at the beginning of the time-step). In a matter of fact, taking the heat-capacity and the opacities at the beginning of the time-step prevents the classic implementation of IMC to be a fully implicit algorithm <cit.>. Finite-differencing Eq. <ref> and using the definition of β yields (where the index n denotes the previous time step and n+1 the current time step):\n\n    B^n+1(T)=B^n(T)f+(1-f)∫_0^∞∫_4πσ_a,ν'/σ_a,p(T)I(r,Ω',ν',t)/4πdΩ'dν'\n\ni.e., B^n(T)=a(T^n)^4/4π and b^n(ν,T)≡ B^n(ν,T)/B^n(T)=4π B^n(ν,T)/a(T^n)^4.\n\nSubstituting Eq. <ref> in Eqs. <ref>, yields the final frequency dependent IMC equations:\n\n\n\n    1/c∂ I(r,Ω,ν,t)/∂ t+Ω·∇ I(r,Ω,ν,t)=\n        \n        -(σ_a(ν,T)+σ_s(ν,T))I(r,Ω,ν,t)\n       +fσ_a(ν,T)b^n(ν,T)B^n(T)+σ_s(ν,T)∫_4πI_ν(r,Ω',ν',t)/4πdΩ'+\n       (1-f)σ_a(ν,T)b^n(ν,T)/σ_a,p(T)∫_0^∞∫_4πI(r,Ω',ν',t)σ_a(ν',T)/4πdΩ'dν'\n\n    \n    ∂ e(T)/∂ t=c f(∫_0^∞∫_4πσ_a(ν',T)I(r,Ω',ν',t)dΩ'dν'-σ_a,p(T)aT^4).\n\n\nThese are the basic frequency-dependent IMC equations, where in addition to the physical scattering term (which is proportional to the frequency-integrated specific intensity), there is an additional, “effective\" scattering term which is proportional to 1-f. This effective scattering term, replaces the explicit process of absorption and black-body emission, which enables the use of large time-steps, with f<1.\n\nThe implicitization and linearization of DIMC is the same as classic IMC, i.e., linear only in I (as opposed to ISMC that is linear in both I and e <cit.>), and the matter-energy is treated via Eq. <ref>. The difference from classic IMC is that the material energy is also represented by material particles, where the sum of the energy of the material particles inside a numerical cell is exactly the total energy of the matter in the cell. Photons are allowed to be created only in positions of material particles, and are absorbed continuously, generating new material particles. To prevent population explosion, an algorithm of merging material particles weighted by their energy was derived, and limits at the end of the time step the number of material particles to be approximately 10-30 in each cell. For a more complete description of the DIMC algorithms, the algorithm of photon creation, the single photon propagation and the algorithm of material particle merging, see <cit.>. \nThe only difference in the frequency-dependent algorithm is that when a new radiation photon is emitted or when there is an effective scattering event, the photon's new frequency is sampled in the same manner as in the emission case in frequency-dependent IMC and ISMC. The propagation is determined via the frequency-dependency of the opacity. We note that as in classic IMC, the Monte-Carlo particles that represent the photons are not photons per se, but rather `packets of energy', which represent large number of photons (calculating real number of photons is unrealistic). As a consequence, there is not a direct relation between the frequency of the energy-packet and its energy, which may represent many low (or high)-energy photons.\n\nThe main sub-steps of each time advancement in the DIMC scheme are as follows:\n\n    \n  * The temperature of a cell is calculated from e (which is equal to the sum of energies from all the material particles in a given cell).\n    \n  * The values for f and β are calculated using the values at the beginning of the time step.\n    \n  * A given number of new photons N_photon (packets of energy) is created (a parameter by the user), where the total energy of the photons are determined by the black-body emission VΔ tf∫σ_a,p(T)cB(ν,T)dν (V is the volume of the cell), as classic IMC. New positions for the photons are sampled randomly from the positions of the material particles in the cell, weighted by their energy. Each packet of energy has the same energy, where its energy is then subtracted from the energy of the cell as well as from the sampled material particle. The frequency of the photon is sampled as in IMC, by randomly sampling the distribution ∫σ_a(ν,T)b(ν,T)dν/σ_a,P(T). Since the emission depends explicitly in the opacity σ_a, we build a (numerical) cumulative spectral distribution of the integral above, sampling uniformly from the opacity-Planck-weighted integrated distribution (for more details, please see section IVA in <cit.>). For the detailed algorithm of photon creation please see algorithm 1 in <cit.> which appears in the appendix.\n    \n  * If there are external radiation sources/boundary conditions, new radiation photons are created with their corresponding frequency distribution.\n    \n  * Radiation photons are transported with a velocity c where the distances for a collision d_collision, moving to a neighboring cell d_mesh or free flight d_time are calculated. The minimal distance is then taken and the reduction in the energy of the photon (a packet of energy, as explained previously) is then calculated continuously by Δ E=E_photon(1-exp(-fσ_a(ν)d)). This energy difference is then saved for when a new material particle is created.\n    \n  * If there is a collision, the photon is scattered and with a probability of (1-f)σ_a(ν)/((1-f)σ_a(ν)+σ_s(ν)) a new frequency is sampled from the same distribution as before (i.e., only for the effective scattering).\n    \n  * Once the photon exits the cell or reaches the end of the time step, the position of a new material particle is determined by averaging the photon energy loss track (see algorithm 2 in <cit.> which appears in the appendix). A new material particle is created at that location and its energy is equal to the sum of the energies that were deposited by the photon. The position of a new material particle when a photon crosses the boundary between cells, is not necessarily right at the boundary, but rather is determined by the track length of the photon in the old cell, due to the photon's deposition of energy inside the old cell.\n    \n  * Since each photon creates at least material particle in each time step, material particles are merged until we reach some desired number N_material particles in cell. The merging process retains the “center of mass\" (where here mass is the energy) of the material particles energy (see algorithm 3 in <cit.> which appears in the appendix). We note again that the main difference between DIMC and classic IMC is in the source sampling; the total energy of the cell is a global quantity. Therefore, DIMC should be consistent at least as classic IMC, and is better at avoiding teleportation errors.\n\n\nWe note that we haven't presented a theoretical proof that the DIMC algorithms are unbiased. However, from the numerical examples that are presented above, we see no evidence for bias. Our main concern of a source of bias, was the material particles merging algorithm. We performed extensive numerical checks with different methods of merging the material particles. Our proposed algorithm had the least bias among all of the tested methods, that included in addition to our method also Russian Roulette and a comb sort algorithms.\n\n\n\n§ 1D TESTS\n\n\nIn <cit.> we have collected the well-known frequency-dependent radiative transfer benchmarks that appear in the literature and tested the ISMC algorithm with them. In this section we use these benchmarks to test the new DIMC scheme in frequency-dependent scenarios in one-dimension, which includes the frequency-dependent benchmarks that was offered lately by Olson <cit.> and by Densmore et al. <cit.>, in several optical depth.\n\n\n\n §.§ Olson 2020 1D\n\n\nThe frequency-dependent Olson 1D benchmark <cit.> is a frequency-dependent extension setup to the optically thin source gray test that was introduced previously in <cit.>. The source term is a black body with a temperature of 0.5 keV whose spatial extent is given by Q(x)=B(0.5 keV)exp(-693· x^3), and is turned on at time t=0 and turned off at time ct=2. The initial temperature in the domain 0⩽ x ⩽ 4.8 (cm) is set to be T(t=0)=0.01T_ keV (T_ keV represents the temperature in the units of keV) and we run the simulation until a time ct=4 using reflective boundary conditions at both ends.\n\nThe material is composed of carbon-hydrogen foam, whose frequency-dependent opacity (in units of cm^2g^-1) is given by:\n\n    κ_a(ν,T)=min(10^7,10^9(T/T_ keV)^2)    hν<0.008 keV\n    3· 10^6 (0.008 keV/hν)^2/(1+200·(T/T_ keV)^1.5)    0.008 keV<hν<0.3 keV\n    3· 10^6 (0.008 keV/hν)^2√(0.3 keV/hν)/(1+200·(T/T_ keV)^1.5)+4· 10^4(0.3 keV/hν)^2.5/1+8000(T/T_ keV)^2   \n        hν >0.3 keV.\n\nThe macroscopic absorption cross-section is given by σ_a(ν,T)=ρκ_a(ν,T), where ρ=0.001 g/cm^3. The heat capacity is given by:\n\n\n\n    ρ C_V   =   aT_ keV^3H(1+α+(T+χ)∂α/∂ T)\n    α   =   1/2e^-χ/T(√(1+4e^χ/T)-1)\n    ∂α/∂ T   =   χ/T^2(α-1/√(1+4e^χ/T))\n\n\nwhere χ =0.1T_keV and H=0.1.\nFor all of the schemes we use a spatial resolution of 128 equally spaced cells and set a constant time step of Δ t = 10^-13. We have tried to achieve comparable noise level in the material temperature field between IMC, ISMC and DIMC. In the IMC and DIMC cases, we create 500 new photons each time step and limit the total number to be 4· 10^3, while in the ISMC case we create 5· 10^3 new photons each time step and limit the total number of particles to be 10^5. For the reference solution, we use the one calculated using a high order P_N scheme presented in <cit.>.\n\nFig. <ref>(a) shows the material temperature for different times compared with the reference solution, and the radiation energy density is shown in Fig. <ref>(b).\n\nThe frequency-dependent DIMC method yields the correct result and agrees well with both the IMC and ISMC solutions and the reference solution as well. As in the ISMC results, there is a difference between the discrete results of the different MC schemes and the smooth curves of the P_N, near the tails of the distributions, where the radiation intensity drops by several orders of magnitudes. \nSince all three methods are converge to the same solution with an infinite number of particles, we choose for the comparison of the efficiency between the different schemes the number of particles required to achieve a similar noise level in the matter energy (since in most cases this quantity is more informative than the radiation energy). Thus, the noise level in the material temperature is almost comparable in all three methods while in the radiation field the noise level in ISMC is lower than both IMC ad DIMC, as expected. However, the total number of particles of the ISMC run is higher by two magnitudes than the other two methods. That is because both IMC and DIMC need relatively low statistics to yield smooth material profiles, and in ISMC the noise levels of radiation and matter are similar. This means that for a given statistic, ISMC is much noisier than IMC or DIMC. For achieving similar level of noise using ISMC needs an overall run time that was a factor of 9.5 longer than the IMC run.\n\n\n\n §.§ Densmore et al. 2012\n\nDensmore et al. <cit.> (and also Cleveland et al. <cit.>) have presented one-dimensional frequency-dependent benchmarks with varying optical depth: optically thin material, medium-level (intermediate) opacity and optically thick material. In addition, they introduced a combination of two different materials or zones, i.e. the heat wave that initially propagates in optically thin material, `crashes' into an optically-thicker “wall\". The optically-thick media problems emphasize the difference between IMC, which exhibits a teleportation error, while ISMC and DIMC should be spatially converged at a lower spatial resolution with no teleportation error, even in frequency-dependent problems.\n\nFirst, in the single opacity Densmore et al. benchmark, the opacity has this form:\n\n    σ(x, ν, T) = σ_0(x)/(hν)^3√(k_BT)\n\nwhere σ_0(x)=10keV^7/2 for the optically-thin medium, σ_0(x)=100keV^7/2 for the optically-intermediate medium and σ_0(x)=1000keV^7/2 for the optically-thick medium.\nThe heat capacity is set to be C_V=10^15erg/T_ keV/cm^3. The initial temperature in the domain 0⩽ x ⩽ 5 (cm) is 1 eV, the left boundary is a black body bath source with a temperature of 1keV and the right boundary is a reflecting wall. The spatial resolution is taken to be small, 64 evenly spaced cells (for presenting the teleportation in opaque problems in IMC). The test is run to a time of t=1 ns with a constant time step of Δ t = 0.01 ns. For all of the runs we create 10^5 photons per time step and limit the total number of photons to be 10^6. The reference solution that we compare to is taken from Densmore et al. <cit.>. \n\nThe material temperature profiles at t=1 ns for all three methods along with the reference solution are shown in Fig. <ref>.\n\nWe can see that there is a good agreement between the three methods and the reference solution for the first two tests (optically thin and intermediate-opacity problems), while in the third test (optically thick), the IMC requires a spatial resolution of 256 cells in order to avoid teleportation errors, as opposed to the ISMC or DIMC that give a good result even with 64 cells. As a matter of fact, the DIMC yields even better results comparing to reference solution than ISMC. Again, all three methods converge to the same solution with an infinite number of particles and spatial resolution. Therefore, in this problem we choose for the comparison of the efficiency between the different schemes, the required spatial resolution for convergence. In this metric, IMC needs four times higher resolution for achieving the same accuracy as ISMC and DIMC.\n\nNext, Densmore et al. offered a two-media benchmark, testing the handling of sharp transition from an optically thin to an optically thick regime. The domain (with equally spaced cells throughout) is set to 0⩽ x ⩽ 3 (cm), and the opacity is\n\n    σ_0(x)=\n        10 keV^7/2/cm    x<2 cm,\n    \n        1000 keV^7/2/cm    x≥ 2 cm.\n\nIn Fig. <ref> we show the material temperature for the two-media benchmark (Fig. <ref>(b) is zoomed on the interface zone). As in the optically thick single-medium benchmark, we see that when optically thick material is present, the new DIMC algorithm (as well as the ISMC algorithm) requires less spatial resolution than IMC in order to achieve convergence, due to teleportation toward the opaque material in low spatial resolution in the IMC simulation. One again, DIMC yields even better accuracy with the reference solution than ISMC.\n\n\n\n\n§ OLSON 2020 2D TEST\n\n\nIn this section we present a frequency-dependent implementation of the new DIMC scheme in a full two-dimensional problem, using the most complex 2D problem presented in Olson <cit.>. In this problem, a complex-geometry 3.8 cm square on each side, composed of intermediate-opaque (thus, no teleportation errors should appear in the IMC simulations) aluminum blocks surrounded by the same foam from the previous 1D Olson benchmark problem. The exact setup is shown in Fig. <ref>. The aluminum blocks have the same density as the foam and their heat capacity has the same functional form as the foam (Eq. <ref>), but with H=0.5 and χ=0.3T_ keV. The opacity for the aluminum blocks is given by:\n\n    κ_a(ν,T)=min(10^7,10^8T/T_ keV)    hν<0.01 keV\n    10^7 (0.01 keV/hν)^2/(1+20·(T/T_ keV)^1.5)    0.01 keV<hν<0.1 keV\n    10^7 (0.01 keV/hν)^2/(1+20·(T/T_ keV)^1.5) + 10^6(0.1 keV/hν)^2/1+200·(T/T_ keV)^2    0.1 keV<hν<1.5 keV\n    10^7 (0.01 keV/hν)^2√(1.5 keV/hν)/(1+20·(T/T_ keV)^1.5) + 10^5(1.5 keV/hν)^2.5/1+1000·(T/T_ keV)^2   \n        hν >1.5 keV.\n\n\n\nThe computational region is divided into 380 equally spaced cells in each axis with reflecting boundaries. A black-body source, Q(r)=B(0.5 keV)exp(-18.7· r^3), is turned on at time t=0, and remains on for the entire duration of the simulation. A constant time step of Δ t = 10^-13 s is used, 2· 10^6 new particles are created each time step, and we limit the total number of particles to be 2.5· 10^7 for all of the schemes.\n\n\nFirst, in Fig. <ref>(b-d) we show a colormap of the radiation energy density in the entire domain as well as a reference from <cit.> (Fig. <ref>(a)). All MC methods, IMC, ISMC and DIMC agree very well with each other through the computational domain, and a good qualitative agreement with the P_N reference data, including all geometrical patterns.\n\nNext, Fig. <ref> shows slices along the diagonal for (a) the material temperature and (b) the radiation energy density, along with reference P_N data from <cit.>. Again, there is a good agreement between all methods in the range 0⩽ r⩽√(0.5). Farther away from the origin, the sharp discontinuity in the material properties causes a small difference between the MC methods and the reference solution. \n\n\n\n\n§ CONCLUSIONS\n\n\n\nIn this work we have presented a frequency-dependent (energy-dependent) generalization to the discrete implicit Monte-Carlo (DIMC) scheme that was introduced recently <cit.>. The DIMC is a classic IMC implementation on one hand, but on the other hand uses the concept of two-kind of particles for avoiding teleportation errors, as introduced by Ahrens and Larsen <cit.> and later by Poëtte and Valentin <cit.>. The main idea is when a photon continuously loses its energy due to absorption, a material particle is created, which is static. The new photons that emerge due to black-body emissions are sampled only from the locations of material particles, and thus, teleportation errors are avoided. DIMC has been checked before in gray opacity scenarios <cit.>, and this work completes the generalization and the testing to frequency-dependent opacity problems. We have seen in the optically-thin problems, both in 1D and the 2D problems that the DIMC yields good results compared to the reference solution, and yields smoother results than ISMC, with comparable noise level as IMC. On the other hand, ISMC required two order of magnitudes more particles in order to converge at the same noise noise level. In optically-thick benchmarks, DIMC yields the best results, having no teleportation error even with a very low spatial resolution, like the ISMC results, while IMC needed a spatial resolution four times higher in order to achieve similar results.The results of the numerical examples, show no reason to think that the DIMC algorithms are biased, however, a consistent proof of unbiasedness is reserved for future work.\nIn addition, the benchmarks were run with continuous frequency dependency, but the results should be valid also for a finite number of groups, i.e., in multigroup problems, which could be another direction for future work.\n\n\n\n§ APPENDIX: THE FUNDAMENTAL DIMC ALGORITHMS\n\n\nIn this appendix we present the fundamental algorithms of DIMC that were presented previously in the gray DIMC paper <cit.>. An outline of the photon creation process is given in algorithm <ref>. The full photon propagation algorithm is shown in algorithm <ref>. The merging algorithm for the material particles is presented in algorithm <ref>.\n\n\n\n\n\n\n\n\nieeetr\n"}