{"entry_id": "http://arxiv.org/abs/2303.06633v1", "published": "20230312110503", "title": "The case of Quantum Gravity with Spontaneous Collapse of the Wave Function", "authors": ["Lajos Diósi"], "primary_category": "gr-qc", "categories": ["gr-qc", "quant-ph"], "text": "\n\n\n\n\nWigner Research Centre for Physics, H-1525 Budapest 114, P.O.Box 49, Hungary\n\nEötvös Loránd University, H-1117 Budapest, Pázmány Péter stny. 1/A\n\ndiosi.lajos@wigner.hu\n\n\nWhen about half a century ago the concept of universal spontaneous\ncollapse of the wave function was conceived it was an attempt\nto alter standard non-relativistic quantum physics. As such, it was\nlargely ignored by relativistic field theory and quantum gravity\ncommunities. A central motivation of spontaneous collapse community\nhas been to replace the standard collapse-by-measurement that annoyed\nmany. With few exceptions, it did not annoy the field theory and quantum gravity\ncommunities. Concept of certain general-relativity-related universal \nirreversibility in quantum field theory had been initiated very long ago \nby Wheeler, Hawking and a few others independently from the concept\nof spontaneous collapse. Lately the two concepts started to converge and\nsupport each other.\n\n\n\n\n§ INTRODUCTION\n\nAllow the author to introduce the topics in a self-quotation from 2015 <cit.>.\n`The inception of a universal gravity-related irreversibility took place originally in quantum cosmology but it turned out soon that a universal non-unitary dynamics is problematic itself. Independent investigations of the quantum measurement postulate clarified that a non-unitary dynamics is of interest already in the non-relativistic context. An intricate relationship between Newton gravity and quantized bulk matter might result in universal non-relativistic violation of unitarity - also called spontaneous decoherence. The corresponding gravity-related spontaneous decoherence model is now on the verge of detectability in optomechanical experiments. It is also a toy-model of cosmic quantum gravitational non-unitarity, illuminating that the bottle-neck of quantum gravity is the quantum measurement postulate instead of quantum cosmology.'\n\nWe want to build our message around the appearance of the concept of \nfundamental irreversibility in two separate fields of foundational theoretical \nphysics. One is quantum cosmology. It has no consistent theory valid\ndown towards the Planck scale, despite various efforts using various advanced\nmathematical models. At the same time, semiclassical and heuristic\napproaches imply that fundamental irreversibilities may be part of quantum\ncosmology. But quantum irreversibility itself, especially when universal,\nhappens to be non-trivial both technically and conceptually. And here\nanother research field gains importance. Its tasks seem opaque compared\nto quantum cosmology's.  They include, e.g.,  the measurement problem,\nthe dynamics of wave function collapse, the quantum-classical transition \nand hybrid dynamics, but the relevant task is the quantum theory of macroscopia, \ncoined as the  cat problem. You should discuss the options of\nmacroobjects' quantum behavior, and you can do it non-relativistically,\nbefore you go for quantum cosmology! The hypothesis of spontaneous\nuniversal collapse in massive degrees of freedom, assuming\na fundamental gravity-related irreverisibility, may have perspectives for\nquantum cosmology as well, especially if fundamental irreversibility\nremains part of it.\n\n\n\n§ FUNDAMENTAL IRREVERSIBILITY? — TWO COMMUNITIES\n\nThe two fundamental issues in question are the following: unified theory\nof space-time with quantized matter (cf. quantum gravity, quantum cosmology)\nand the physics of quantum measurement (cf. wave function collapse, \nquantum-classical transition). These problems were considered unrelated for long time, \nstudied by two separate research communities. \nWe refer to the first one as quantum cosmologists and to other as \nmeasurement problem solvers or, with a spectacular touch, as  cat killers. \nQuantum cosmology has always been part of main stream physics, \nusing heavy artillery of mathematics, while  cat killers used light weapons \nand sometimes whimsical identification of their problems. \n\n\n\n\n\n §.§ Irreversible Quantum Gravity/Cosmology at the Planck Scale\n\nEmergence of irreversibility within standard physics  \nwas not derived by exact derivations but by heuristic arguments.\nA selection of earliest theoretical signatures could be the  following. \nIn 1936, Bronstein <cit.> was the first to point out that space-time\nmetric must have an ambiguity δ g_ab of different nature from\nthe dictum of Heisenberg uncertainty relationships. \nMuch later in 1962, Wheeler <cit.> proposed that space-time has a certain\nfoamy structure at the Planckian scale. After another decade, \nBekenstein <cit.> proved that black-holes behave \nthermodynamically, they have entropy:\n\n    S_BH=A/4,\n\nwhere A is the surface aera of the black-hole in Planck units \n(Boltzmann's constant k_B=1). \nThen Hawking <cit.> showed that, yes, in accordance with the above entropy, \nblack-holes emit thermal radiation of temperature\n\n    T_BH=1/8π M,\n\nwhere M is the black-hole mass. Later, Hawking <cit.>\nwent deeper and conjectured that unitarity of standard quantum theory is lost due to  \nthe instanton mechanism. The scattering processes must be non-unitary,\nthe non-unitary super-scattering operator $ acts on the density operator :\n\n    →$\n\nwhere the r.h.s. does not factorize into SS^†\nwith any unitary scattering operator S.\nInstead of Hawking's scattering process,\nBanks, Susskind and Peskin <cit.> considered a  detailed dynamical equation\n\n    d/dt=-i[,]-∫∫ [(x),[(y), ]]h(x-y)d^3xd^3y,\n\nwhere  is the Hamiltonian,\n is a relativistic quantum field and h is a positive kernel.\nThe authors show that the irreversible term on the r.h.s. violates the\nenergy-momentum conservation which cannot be restored in local\nfield theories.\n\n\n\n §.§ Irreversible Quantum Mechanics for Massive Objects\n\nAmong diverse incentives, including a metaphysical discontent about von Neumann's quantum measurement theory,  \nthe only relevant motivation is the problematic extendibility of \nquantum theory for massive degrees of freedom. \nThis led to heuristic modifications of standard\nquantum physics. According to that, the unitarity is violated in massive \ndegrees of freedom so that macroscopically different superpositions,\naka  cat states like\n\n    |Ψ⟩=|f_1⟩+|f_2⟩/√(2),\n\ncollapse spontaneously into one of the components. \nMilestones of the consept could be the following.\n\nIn 1966, Károlyházy <cit.>  proposed that, due to a conjectured spectrum of\nspace-time metric fluctuations δ g_ab at the Planck scale,\n cat states collapse before they get too large. He outlined a naive \nqualitative model of when and how the collapse happens.  \nIndependently and much later in 1986,\nGhirardi, Rimini and Weber <cit.> constructed a simple  model \nof universal spontaneous collapse in exact mathematical terms. \nThey postulated extreme rare and weak \nspontaneous collapses for the elementary constituents' wave functions\nwhich in turn yield robust localization of the macrosopic\ncenter-of-mass, i.e., the collapse of the  cat state. The GRW model has\nno reference to gravity. \nHowever, the present author  <cit.> proposed  gravity-related universal \nspontaneous collapse of massive superpositions, like  cats, \nbased on a master equation:\n\n    d/dt=-i/ħ[,]-G/2ħ∫∫ [(x),[(y), ]]1/| x-y|d^3xd^3y,\n\nwhere  is the non-relativistic quantized mass density field and G is\nNewton's constant. The master equation corresponds to a certain ambiguity δΦ=12 c^2 δ g_00 of the Newton potential. \n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Fundamental irreversibility? — Parallel pursuits\n\nThus, the desired quantum gravity and the unwanted  cats\nled both the heavy-armed relativistic and light-horse non-relativistic\nstudies to the same structure of heuristic master equations.\nAnd they suffer of the same problem of spontaneous creation of \nenergy and momentum. This coincidence is a spectacular instance\nto illustrate that the two, apparently distant theoretical tasks, share\nsimilar proposals and problems. Another instance has been the surprising \ncoincidence between\nthe  cat's collapse rate predicted by the non-relativistic master \nequation <cit.> \nand by the general relativistic arguments of Penrose <cit.>.\nFor possible reasons of coincidence, see ref. <cit.>.\n   \nMention should be made of Gell-Mann and Hartle <cit.> \nwho were perhaps the only ones at the time to recognize that quantum\ncosmology needed a more general measurement theory than von Neumann's.\nFor the relationship of their theory of decoherent histories to spontaneous\ncollapse theories, see <cit.>. \nMost recently, hybrid quantum-classical master equations have been\ntested in semiclassical cosmology by Oppenheim et al.  <cit.>,\nwith numerous references to spontaneous collapse models which are, in fact, the\nalternative formalism, see <cit.>.     \n\n\n\n\n\n§ SUMMARY\n\nThe failures of quantum gravity models may not be due to the inadequacy\nof the quantization methods tried so far, but the inadequacy of standard\nquantum theory for macroobjects, e.g., the spontaneous decay of \nmassive superpositions, aka -cats. We recalled that the idea of\nfundamental irreversibility has also been raised in quantum cosmology. \nThe roots of irreversibility may be common in\nquantum cosmology and in speculative models of spontaneous\ncollapse of the wave function. This may be so despite the fact\nthat one is predicted at the Planck scale while the other comes from\nnon-relativistic discussion of massive superpositions <cit.>.      \nConsiderations of  quantum cosmologists and advocates of \nspontaneous collapse (referred here extravagantly as  cat killers) \nwill have to come closer to each other. To support this suggestion,\nhere are two quotes. The author (cat killer) claimed \n`the measurement problem culminates in quantum cosmology\" <cit.>.\nThe cosmologist claims  `the principles of general relativity\nmust influence, and actually change, the very formalism of quantum mechanics'\n<cit.>.\n\nThis research was funded by the Foundational Questions Institute and Fetzer Franklin\nFund, a donor-advised fund of the Silicon Valley Community Foundation (Grant No's. FQXi-RFPCPW-2008,  FQXi-MGA-2103), the National Research, Development and Innovation Office (Hungary)\n“Frontline” Research Excellence Program (Grant No. KKP133827),\nand the John Templeton Foundation (Grant 62099).\n\n\n\n§ REFERENCES\n\n99\nErice2015 Diósi L 2015 Gravity related spontaneous decoherence: from\nWheeler-Bekenstein-Hawking to optomechanics (talk given in Erice) \nwww.wigner.hu/∼diosi/slides/erice2015.pdf\nBro36 Bronstein M 1936 Phys. Z. Sowjetunion 9 140 \nWhe62 Wheeler J A 1962 Geometrodynamics (New York: Academic Press)\nBek73 Bekenstein J D 1973 Phys. Rev. D 7 2333\nHaw75 Hawking S W 1975 Commun. Math. Phys. 43 199\nHaw83 Hawking S W 1982 Commun. Math. Phys. 87 395\nBPS84 Banks T, Susskind L and Peskin M E 1984 Nucl. Phys. B 244 125\nEllMohNan89 Ellis J, Mohanty S and Nanopoulos D V 1989 Phys. Lett. B 221 113\nGelHar90 Gell-Mann M and Hartle J B 1993 Phys. Rev. D 47 3345\nPen96 Penrose R 1996 Gen. Relativ. Gravit. 28 581\nKwoHog16 Kwon O and Hogan C J 2016 Class. Quantum Grav. 33 105004\nSud21 Sudarsky D 2021\nDo Wave Functions Jump? Perspectives of the Work of GianCarlo Ghirardi,\ned  V Allori, A Bassi, D Dürr, N Zanghi (Cham: Springer Nature Switzerland) p 291\nAnaHu22 Anastopoulos C and Hu B L 2021 AVS Quantum Science 4 015602\nOpp22 Oppenheim J and Weller-Davies 2022 J. High Energ. Phys. 2022 80; Oppenheim J, Sparaciari C, Šoda B and Weller-Davies Z 2022 Preprint arXiv:2203.01982\nKar66 Karolyhazy F 1966 Nuovo Cim. 42 390\nPea76 Pearl P 1976 Phys. Rev. D 13 857\nGis84 Gisin N 1984 Phys. Rev. Lett. 52 1657\nGRW86 Ghirardi G C, Rimini A and Weber T 1986 Phys. Rev. D 34 470 \nDio87 Diósi L 1987 Phys. Lett. A 120 377\nDio89 Diósi L 1989 Phys. Rev. A 40 1165 \nGRP90 Ghirardi G C, Rimini A and Pearl P 1990 Phys. Rev. A 42 78\nBedetal14 Bedingham D, Dürr D, Ghirardi G, Goldstein S, Tumulka R and Zanghi N \n2014 J. Stat. Phys. 154 623\nTilDio16 Tilloy A and Diósi L 2016 Phys. Rev. D 93 024026\nBasetal17 Bassi A, Grossardt A and Ulbricht H 2017 \nClass. Quantum Grav. 34 193002\nDio22  Diósi L 2022 AVS Quantum Sci. 4 015605\nDioetal95 Diósi L, Gisin N, Halliwell J and Percival I C 1995\nPhys. Rev. Lett. 74 203\nDio23 Diósi L 2023 Preprint arXiv::2302.13418\nDio18 Diósi L 2018 Entropy 20 496; \n                                                 2019 J. Phys. Conf. Ser. 1275\nDio92 Diósi L 1992 Quantum Chaos—Quantum Measurement\n(Springer)  p 299\nPen14 Penrose R 2014 Found. Phys. 44 557\n\n\n\n\n\n\n\n\n"}