{"entry_id": "http://arxiv.org/abs/2303.06631v1", "published": "20230312110015", "title": "Higher-order statistics and intermittency of a two-fluid HVBK quantum turbulent flow", "authors": ["Zhentong Zhang", "Ionut Danaila", "Emmanuel Lévêque", "Luminita Danaila"], "primary_category": "physics.flu-dyn", "categories": ["physics.flu-dyn"], "text": "\nFocus on Change: Mood Prediction by Learning Emotion Changes via Spatio-Temporal Attention\n    Soujanya Narayana, Student Member, IEEE, Ramanathan Subramanian, Senior Member, IEEE, Ibrahim Radwan, Member, IEEE, and Roland Goecke, Senior Member, IEEESoujanya Narayana, Ramanathan Subramanian, Ibrahim Radwan, and Roland Goecke are with the Human-Centred Technology Research Centre, Faculty of Science and Technology, Uni. Canberra, Bruce, ACT, Australia.\n    \n==========================================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tThe Hall-Vinen-Bekharevich-Khalatnikov (HVBK) model is widely used to numerically study quantum turbulence in superfluid helium. Based on the two-fluid model of Tisza and Landau, the HVBK model describes the normal (viscous) and superfluid (inviscid) components of the flow using two Navier-Stokes type equations, coupled through a mutual friction force term. This feature makes the HVBK model very appealing in applying statistical tools used in classical turbulence to study properties of quantum turbulence. A large body of literature used  low-order statistics (spectra, or second-order structure functions in real space) to unravel exchanges between the two fluids at several levels. The novelty in this study is to use a theoretical approach based on first principles to derive transport equations for the third-order moments for each component of velocity. New equations involve the fourth-order moments, which are classical probes for internal intermittency at any scale, revealing the probability of rare and strong fluctuations.\n    Budget equations are assessed through Direct Numerical Simulations (DNS) of the HVBK flow based on accurate pseudo-spectral methods. We simulate a forced homogeneous isotropic turbulent flow with Reynolds number of the  normal fluid (based on Taylor's microscale) close to 100.  Values from 0.1 to 10 are considered for the ratio between the normal and superfluid densities. For these flows, an inertial range is not discernible and the Restricted Scaling Range (RSR) approach is used to take into account the Finite Reynolds Number (FRN) effect.   We analyse the importance of each term in budget equations and emphasize their role in energy exchange between normal and superfluid components. Some interesting features are observed: i) transport and pressure-related terms are dominant, similarly to single-fluid turbulence; ii) the mathematical signature of the FRN effect is weak  in the transport of the third-order moment, despite the low value of the Reynolds number;   iii)  for the normal fluid at very low temperatures, the mutual friction  annihilates the effects of viscosity within the RSR. \n   The flatness of the velocity derivatives is finally studied through the transport equations and their limit for very small scales, and it is shown to  gradually increase  for lower and lower temperatures, for both the normal fluid and the superfluid. This similarity highlights the strong locking of the two fluids. The flatness factors are also found in reasonable agreement with classical turbulence. \n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nLiquid helium below the critical (lambda) temperature T_λ =2.17K is a quantum fluid, also called He II. Following the two-fluid concept suggested by  <cit.> and reformulated and enriched by   <cit.>, He II is represented as a  mixture of two fluids with independent velocity fields: a normal viscous fluid and an inviscid superfluid. A detailed recount of the historical events leading to the two-fluid model is offered by <cit.>.  A striking feature of the superfluid component is the nucleation of quantized vortices, with fixed (quantized) circulation  and fixed core diameter (of the atomic size). Stretching or viscous diffusion of vortices, which are essential vortex phenomena in classical fluids, are absent in the superfluid component. Complex interactions between quantized vortices lead to Quantum turbulence (QT), a relatively young investigation field opened by Vinen's 1957 experiments on thermally induced counterflow in He II  (see the review by <cit.>). Since then, considerable experimental and theoretical efforts (see dedicated reviews or volumes by <cit.>) were devoted to unravel properties of QT and underline similarities or differences with Classical turbulence (CT). \n\nSeveral investigation paths were explored for the study of QT. Since it is admitted that in He II below 0.3K, the normal fluid fraction is negligible, important focus was given to  characterize QT in the superfluid flow.  This state is also referred as superfluid turbulence, or vortex tangle turbulence, since it is generated in an inviscid flow from the interaction of a large number of quantized vortices tangled in space. Quantized vortices being topological line defects, with infinite velocity and singular vorticity at the centreline, they can be modelled by  'Vortex filament' methods. In such methods, the vorticity is represented by Dirac distributions localised at vortex line locations, which are moved following the Biot-Savart-Laplace law  for the velocity induced by neighbouring lines. Phenomenological models for vortex reconnection are applied. Since the pioneering work by Schwarz  in 1980s, numerous numerical studies of superfluid turbulence using the 'Vortex filament'  method were published (see the recent review by <cit.> and citations therein). Another model used for inviscid superfluid turbulence was  the Gross-Pitaevskii equation, which is a  nonlinear Schrödinger  equation describing at macroscopic level a quantum system of weakly interacting bosons, as in Bose-Einstein condensates. \nEven though the GP model offers only a partial description of the complexity of superfluid helium, it was extensively used  to explore properties of superfluid turbulence in an ideal setting containing only the superfluid <cit.>.\n \n Considering simultaneously the viscous and inviscid components of He II in a global model is a difficult problem, since characteristic scales range from Angstrom (size of the quantized vortex) to meter (size of the container). The Hall–Vinen–Bekharevich–Khalatnikov (HVBK)  model <cit.> follows the original idea of the two-fluid model. The  Navier-Stokes (NS) model describes the normal fluid motion and the superfluid motion is defined by an Euler-like equation <cit.>.  The two fluids do not slip one over other, as they are coupled through a friction force. The improvement over the original two-fluid model is that the expression of the friction force takes into account the influence of quantized vortices through a coarse-grained averaged superfluid vorticity. The average is considered  over an ensemble of parallel (polarized) vortex filaments and uses Feynman's rule to find an equivalent solid-body vorticity for a dense vortex bundle of line density ℒ. Derived initially for two-dimensional or rotating QT, the HVBK was widely used to study QT for general settings. \n \n  Recent modelling efforts were focused on more realistic estimations of the vortex line density\n  using approaches considering ℒ as an independent variable, described by an additional evolution equation (based essentially on Vinen's equation) <cit.>.   \n  \n  In <cit.>, the averaged vortex line density per unit volume  was introduced and its evolution equations were considered, for homogeneous, inhomogeneous, isotropic and anisotropic situations. \n  <cit.> studied   the effects of anisotropy and polarization in the hydrodynamics of inhomogeneous vortex tangles, thus generalizing the  HVBK equations. These effects contribute to the mutual friction force between normal and superfluid components and to the vortex tension force. An additional equation for the vortex line density was proposed. Applications pertained to  rotating counterflows, flow behind a cylinder, and other types of superfluid turbulence. \n  \n  Other recent contributions <cit.>  use ideas from the HVBK expression of the friction force to derive models for coupling NS equations with vortex filaments dynamics for superfluid vortices. These NS-VF models, which also include phenomenological approximations, are not discussed in this contribution.  \n  \n  These models are still flow dependent and a general theory of coupling Navier-Stokes equations with quantized vortex effects is not yet available <cit.>. \n   \n The focus of this paper is the detailed investigation of turbulent dynamics of the HVBK model, considered in its original form. The HVBK model has the merit to \n provide a physically consistent closed set of equations for the coarse-grained (two-fluid) dynamics of He II, and to yield results in  agreement with \n experimental studies of He II  <cit.>. The analysis presented here is based on Direct Numerical Simulations (DNS) of the model and thus could be easily adapted to further evolutions of the HVBK or other equivalent QT models based on Navier-Stokes type equations.  \n We adapt statistic analysis tools originally developed for CT governed by classical Navier-Stokes equations. \n Exploring similarities between CT and QT has been a permanent guideline for studying QT, <cit.>. \n \n The novelty of this study  is to push the analysis to high-order moments of each component of velocity, with the aim to probe internal intermittency, i.e. assess the 4th-order structure function, and the corresponding flatness of the velocity derivative. Previous contributions used low-order statistics (spectra, or second-order structure functions in real space) to describe exchanges between the two fluids. We derive transport equations for the 3rd-order moments based on first principles. New equations involve the 4th-order moments, which are classical probes for internal intermittency at any scale.  The general purpose of this contribution is therefore to build new bridges between CT and QT, as explained in detail below.\n \n\nPrevious studies have noted that QT in He II has a lot in common with CT. \nExperimental studies focused on the total velocity of the fluid, are unable, as yet, to distinguish between the normal and the superfluid components.  Several authors <cit.> have reported that, in the inertial range, the isotropic and homogeneous quantum turbulence velocity spectrum has a (-5/3) scaling law. The effective spectrum of superfluid vorticity (superfluid vortices averaged on a volume much larger than the inter-vortex length scale) scales as 1/3. Scaling laws such as 5/3, or 1/3 for the vorticity, are predicted by Kolmogorov theory and are well established for classical turbulence, when the Reynolds number of the flow is large enough <cit.>. \n\tNumerical studies of QT have proved the same large-scale behavior using the HVBK, 'Vortex filament' or GP models (see recent review by  <cit.>). \n\t\n\t\n\tTurbulence statistics received a  huge attention since 1941, when <cit.> argued that  small scales have the best prospect to exhibit universal properties.   This theory did not account for the internal intermittency, defined as strong fluctuations in space and time of the  local, instantaneous kinetic energy dissipation rate ε  <cit.>.  \n\t\n\tWhile the famous Kolmogorov turbulence theory in 1941 accounted for neither the internal intermittency phenomenon nor the finite Reynolds number effect (FRN), e.g.  <cit.>,   Kolmogorov theory 1962  <cit.> was underpinned by  modified similarity hypotheses, aimed at accounting for intermittency.   \n\tOne important merit of K41 and K62 is that they confer a phenomenological <cit.> and a theoretical <cit.> framework allowing to link statistics at large scales (presumably, within in an inertial range) and the smallest scales at which ε is properly defined.    Numerous  later studies  <cit.>  discussed the inappropriateness of these hypotheses, and proposed adequate amendments. One of them is the accounting of the FRN effect, which implies to consider in theoretical developments all specific physical phenomenon of the flow, such as decay, diffusion, production, etc.  The approach developed in this work follows this philosophy, and considers all terms in the transport equations, none of them being a priori neglected. \n\t\n\tTurbulence statistics which pertain to internal intermittency  usually encompass  two kinds of methods: i) one-point statistics of small scales (reflected by gradients of the velocity field); and ii)  two-point statistics, particularly by the scaling exponents of higher-order structure functions. Note that the small-scale limit of ii) fully recovers i).  Scaling laws of longitudinal structure functions of order p, defined as the difference of the velocity component u between two space points separated by the scale r, are sought as:\n\t\n    ⟨ (u(x+r) - u(x))^p ⟩∼ r^ζ_p,\n\n\twhere u is the x-component velocity in the (x,y,z)  reference system, r  the separation distance between the two points and ⟨⟩ denotes averaging.  Assessing the scaling exponents demands particular care. \n\tStrictly speaking, they can only be correctly assessed in a range of scales called  'inertial sub-range', which, in turn, requires a large Reynolds number. The exact value of the threshold depends on the flow: for instance,   <cit.> showed that Re_λ (based on Taylor's microscale λ) must exceed   500, which implies a minimum resolution of 1024 in a periodic box simulating homogeneous and isotropic turbulence. This requirement is very impelling for the computational resources of DNS. \n\tFor lower Reynolds numbers, it is common to designate as Restricted Scaling Range (RSR) those scales for which a scaling of different statistics can be discerned. In the RSR, the value of the scaling  exponent is smaller than the asymptotic prediction of Kolmogorov.  K41  predicts that, under the assumption of sufficiently high Reynolds numbers,   the structure function of order p should scale as ζ_p^K=p/3 within the inertial range (the superscript  K denotes 'Kolmogorov'). The prediction is exact for p=3 since the Kármán-Howarth-Kolmogorov equation is deduced from the Navier-Stokes equations and grants the 4/5 law for longitudinal 3rd-order structure function, for sufficiently high Reynolds numbers.  However,  for p>3, the deviation of the scaling exponent ζ_p from p/3 is often attributed to the  effect of internal intermittency, although the FRN effect is also mixed up with intermittency <cit.>. For classical turbulence, a solid theory for predicting higher-order moments scaling laws is still missing. One of the intricacies stands in the correct account of the FRN, and associated closures for the numerous terms highlighted in  transport equations <cit.>. \n\t Intermittency has also been addressed through GP models <cit.>. It is outlined that \nthe incompressible velocity are found to be skewed for turbulent states. Comparisons with  homogeneous and isotropic Taylor-Green flow, revealed  the universality of\nthe statistics, including a Kolmogorov constant\nclose to the one of classical fluid. \n\n\tThe  HVBK model of QT at finite temperature  it is the perfect framework to develop such statistical analysis, since the two components of the flow are governed by  Navier-Stokes type equations (over which the coupling, mutual friction term, is to be accounted for) and thus can be easily separated. The two components are denoted by subscripts 'n' and 's' standing for the normal fluid and superfluid, respectively. \tThe total density of the fluid is  the sum of each component densities, ρ=ρ_n+ρ_s. The density ratio is temperature-dependent. \tFor T ≈ T_λ,  ρ_n/ρ = 1 and for T = 0, ρ_n/ρ = 0. Both experimental <cit.> and numerical (based on the HVBK shell model) <cit.> studies were devoted to inspecting intermittency by analyzing the scaling exponents for  higher-order structure functions.  A consensus emerged that the intermittency of quantum turbulence is very similar to classical turbulence for temperatures close to T_λ,  or  close to absolute zero (see Table I in <cit.>). There is no clear conclusion for  intermediate temperatures (between T_λ and 0). Experimental studies covered a wide range of temperatures (0<T<T_λ) and concluded that for quantum turbulence, the higher-order scaling exponents are smaller than p/3 as in classical turbulence, and they are almost unaffected by the temperature <cit.>. However, HVBK shell model studies lead to different conclusions at intermediate temperatures, where ρ_n ≈ρ_s.  <cit.> claim that for the quantum turbulence in intermediate temperatures ρ_n ≈ρ_s, the scaling exponents are more significant than the Kolmogorov prediction,  ζ_p^c<ζ_p^K<ζ_p^q  (superscripts 'c' and 'q' stand for 'classical' and 'quantum',  respectively), while <cit.> found that scaling exponents are smaller than the Kolmogorov prediction and even smaller than the scaling exponents of classical turbulence,  ζ_p^q<ζ_p^c<ζ_p^K. <cit.>  performed DNS for a gradually damped HVBK model and provided support for the latter conclusion. This discrepancy is due to the additional effect of the mutual friction force  in both normal fluid and superfluid, in the case of ρ_n ≈ρ_s. \n\n\nIn the present work, we use DNS results based on the HVBK model for forced homogeneous isotropic turbulent flow with Reynolds number of the  normal fluid (based on Taylor's microscale) close to 100. We consider density ratios ρ_n/ρ_s between 0.1 and 10, corresponding to temperature spanning [0, T_λ].  Because of the moderate Reynolds numbers of the normal fluid, the range of scales over which statistics will be revealed are: the dissipative range, the RSR (intermediate scales), and large scales (comparable with the size of the simulation box, at which forcing is applied).   \nThe first question we address is  the role of the mutual friction in the transport equation of the  3rd-order structure function.   We deduce this  equation from the first principles (here, two-fluids HVBK) by accounting for the FRN  effect at each scale and different temperatures, as a function of the density ratio ρ_n/ρ. Each term of the balance equation is assessed from DNS data. We corroborate this analysis with \none-point statistics of velocity derivatives, which is another tool to probe turbulent intermittency.  We quantitatively study the tails of Probability distribution functions (PDFs)  of velocity derivatives  by computing the flatness, defined as the 4th-order moment normalised by the square of the 2nd-order moment. We then compare with CT, for which DNS at very high Reynolds numbers <cit.> revealed that the flatness of the velocity gradients is much larger than 3 (typical for a Gaussian distribution).\nDespite the easy accessibility of small scales in  numerical simulations of QT,  we are not aware of any report of  similar analysis for probing internal intermittency.\n\nThe paper is organized as follows. Section <ref> describes the two-fluids HVBK model and the main parameters of  direct numerical simulations.  Section <ref> is devoted to inspecting each term in the transport equation of the 3rd-order structure-function,  with particular attention paid to the influence of the mutual friction term over the whole range of scales and for different density ratios. Section <ref> reports one-point statistics of the longitudinal velocity gradients of each fluid component and the total velocity of the turbulent flow. Section <ref> deals with the flatness of the velocity derivative. Conclusions are drawn in Sect. <ref>. \n\n\n\n\n\n\n\n§ THE HVBK MODEL AND DIRECT NUMERICAL SIMULATIONS\n \n\nWe use the so-called incompressible  Hall–Vinen–Bekharevich–Khalatnikov (HVBK)  model <cit.>.  Navier-Stokes equations describe the normal fluid (variables with subscript 'n') and the superfluid motion (variables with subscript 's') is governed by an Euler-like equation:\n\n    ∇·v_n =0 ,  ∇·v_s =0,\n    \n    ∂v_n/∂ t+(v_n ·∇)v_n=-1/ρ_n∇ p_n  + 1/ρ_nF_ns + ν_n ∇^2v_n,\n    \n    \n    ∂v_s/∂ t+(v_s ·∇)v_s=-1/ρ_s∇ p_s  - 1/ρ_sF_ns+ ν_s ∇^2v_s,\n\nwhere ∇ stands for the nabla operator, v is  the velocity vector, ρ the density and p the pressure.   Note that the superfluid viscosity ν_s is theoretically zero, and it is added for the purpose of stability of numerical simulations at very low temperatures.  It may also be viewed as a crude surrogate for the superfluid dissipation processes at inter-vortex scales and below.\n\nThe two fluid components are coupled through a mutual friction force F_ns. The form of the friction force is  <cit.>,  <cit.>:\n\n    F_ns =  -B/2ρ_sρ_n/ρω_s  (ω_s   (v_s -v_n))/|ω_s |   -B'/2ρ_sρ_n/ρω_s   (v_s -v_n),\n\nwhere ω_s = ∇v_s is the coarse-grained superfluid vorticity (see below). \nWe assume that for the superfluid the predominant energy loss is due to macroscopic friction with the normal fluid. We implicitly neglect dissipation process by vortex reconnection. This certainly excludes the validity of such a model for temperatures very close to 0K, and does not allow to investigate scales smaller than the intervortex distance.    The perpendicular component of the force in Eq.  (<ref>) is neglected, since it does not contribute to the energy exchange.  A discussion on the impact of these simplifications is provided in Appendix <ref>.\n The simplified form of the friction force is then <cit.>:\n\n    F_ns = -B/2ρ_sρ_n/ρ|∇v_s|  (v_n -v_s),\n\nwhere B is a temperature related parameter, measured in various experiments (see for instance  <cit.>). We set the value B=1.5 corresponding to the averaged value extracted from experimental data. \n\n  This calculation of the mutual friction was based on Feynman's rule. Assuming that a large number of superfluid  vortices of quantized circulation κ are parallel (polarized) in a bucket, the equivalent  solid-body rotation vorticity is 2 Ω=|∇v_s| = |ω_s |=κℒ, where ℒ is the vortex line density per unit volume and Ω the equivalent angular velocity.  The equivalent averaged  coarse-grained velocity of the superfluid is then v_s = Ω×r. \n  The validity of  the expression of the mutual friction force (<ref>)  in general quantum turbulent flows, where vortex lines are randomly oriented rather than highly polarized, is still matter of debate. The existence in QT of dense vortex clusters (bundles) with quasi-parallel vortex lines <cit.> supports the idea of an averaged vorticity. Obtaining a model equation for the evolution of  L that accounts for non-polarized vortices is still an open question <cit.>.\n\n\nThe kinematic viscosity ν_n =μ/ρ_n in Eq. (<ref>) is a simulation parameter. Based on the concept of the two-fluid model, ρ_n decreases with temperature, while  the dynamic viscosity μ is also temperature-dependent. Naturally, the parameter μ in the two-fluid model should be taken as the dynamic viscosity μ_*, which was measured in superfluid helium for a range of temperatures 1K<T<T_λ (see <cit.>). It is common practice in HVBK simulations to fix μ as a constant, independent of temperature. We adopt this simplification, since the dynamic viscosity of the normal fluid could be different from μ_* at low temperatures because of other dissipative effects in the superfluid. We choose here to fix ν_n  as a constant, independent of the temperature.\n\n\nWe solved numerically the system of equations (<ref>)-(<ref>) using Fourier pseudo-spectral methods classically used for Navier-Stokes equations. Direct numerical simulations were performed by adapting a Navier-Stokes code that proved  efficient and accurate in computing high-order statistics of turbulent flows <cit.>.  Periodic boundary conditions were applied to a computational box of  length 2π. Grid resolution was 512^3, which was sufficient to reach a moderate Re_λ∼ 100, based on Taylor's microscale.  We have also performed numerical simulations with a better resolution of 1024^3 (see Appendix <ref>).  The results reported are not affected by the resolution, except the value of the flatness of the velocity derivative of the superfluid, as discussed later.  To achieve a quasi-stationary homogeneous isotropic turbulence, an additional forcing term was added in the momentum equations (<ref>) and (<ref>) at large scales. \n\n\n\nThe energy injection rate ε_* \n\n is constant in time,  for different temperatures, and for  both fluid components.   We set  ε_*=7e-4  for all simulations. The energy injected in superfluid is transferred by mutual friction and eventually dissipated by the normal fluid component. But, the energy transfer becomes less efficient for low temperatures because of ρ_n/ρ tending to zero. \n Accounting for an additional forcing term would result in unstable simulations. To maintain the stability of the simulations for very low temperatures, a common technique in the HVBK model is to impose an artificial viscosity ν_s to the superfluid.  To respect the two-fluid concept, one should make sure that the artificial viscosity of the superfluid is much smaller than the viscosity of the normal fluid,  ν_s≪ν_n. \n\n\n\n\n\n\nTo summarize, in the present work we fix ν_n as a constant independent of the  temperature, and ν_s=0.1ν_n for all numerical simulations. Other techniques exist, like the gradually damped HVBK model <cit.> and the shell model  <cit.>, for which a temperature-dependent normal fluid viscosity ν_n and temperature-dependent superfluid viscosity ν_s are imposed. The statistics of the DNS HVBK model were computed over 30 integration time scales. Table <ref> contains simulation parameters for all 7 considered cases.  The first part refers to the normal fluid, while the second one pertains to the superfluid.\n\n\n\n\n\n\n\n\n\n§ SCALE-BY-SCALE EVOLUTION OF THE THIRD AND FOURTH-ORDER STRUCTURE FUNCTIONS OF THE NORMAL AND SUPERFLUID\n \n\n\n\n\n\nWe present in this section the scale-by-scale budget equation for the 4th-order structure functions  of velocity increments in a HVBK turbulent flow. We start from the transport equation of the 3rd-order structure function for a single-fluid Navier-Stokes turbulent flow. This  equation was derived by  <cit.>  and <cit.> and assessed through experimental and numerical data by <cit.>, and <cit.>.  Denoting by  r the space increment, δ u=u(x+r)-u(x) the longitudinal velocity increment and δ v=v(x+r)-v(x) the transverse velocity increment, the following transport equation was established under the assumption of homogeneity and isotropy:\n\n    ∂_t D_111_Term1 + (∂_r+ 2/r) D_1111_Term2 - 6/r D_1122_Term2'= -T_111_Term3+ 2ν C_Term4- 2 ν Z_111_Term5,\n\nwhere ∂_r ≡∂/ ∂ r, ν is the kinematic viscosity and\n\n    D_111   =⟨(δ u)^3⟩, \n    \n    D_1111   =⟨(δ u)^4⟩, \n    \n    D_1122   =⟨(δ u)^2(δ v)^2⟩, \n      \n    C(r,t)   =-4/r^2 D_111 (r,t) + 4/r∂_r D_111 + ∂_r ∂_r D_111, \n    \n    Z_111   =3 ⟨δ u [(∂ u/∂ x_l)^2+(∂ u'/∂ x_l')^2]⟩.\n\nIn expressions (<ref>) double indices indicate summation (over l=1,2,3) and a prime refers to variables at point x+r. Term Z_111, also  called dissipation-source term, couples components of the dissipation with δ u, and thus acts at all scales (this will be discussed in detail later). Term T_111 is related to the pressure gradient and has the form:\n\n    T_111=3⟨( δ u)^2 δ( ∂ p/∂ x)⟩.\n\n\nWe apply the same approach to obtain a similar transport equation for  HVBK equations (<ref>)-(<ref>), which have Navier-Stokes  structure.\nWe denote by D_111^n and  D_111^s the  3rd-order longitudinal structure functions for normal and superfluid components, respectively.  The two transport equations are:\n\n    ∂_t D_111^n_Term1 + (∂_r+ 2/r) D_1111^n_Term2 + (-6/r D_1122^n )_Term2'=   -T_111^n_Term3+ 2ν_n C^n_Term4 +(-2 ν_n Z_111^n)_Term5\n       + ⟨(δ u_n)^2 (3 ρ_s/ρδ F_∥^ns)⟩_Term 6+3 ⟨(δ u_n)^2 δ f_∥^n⟩_Term 7 ,\n\n\n    ∂_t D_111^s_Term1 + (∂_r+ 2/r) D_1111^s_Term2 + (-6/r D_1122^s)_Term2'=   -T_111^s_Term3+ 2ν_s C^n_Term4 + (-2 ν_s Z_111^s)_Term5\n       + ⟨(δ u_s)^2 (-3 ρ_n/ρδ F_∥^ns)⟩_Term 6+3 ⟨(δ u_s)^2 δ f_∥^s⟩_Term 7.\n\nFor the sake of simplicity, we used the same notations for different terms as in Eq. (<ref>), while referring to either normal or  superfluid components.  New Term6 and Term7 appear. The former  comes from the mutual friction force F_ns (appearing with opposite signs in the two equations) and the latter from  forcing terms f^n and f^s added in both equations to force turbulence.\n\n\n\nEquations (<ref>) and  (<ref>) allow us to obtain exact expressions of the 4th-order structure function (and, further on, of the flatness factor). Recalling that  (∂_r+ 2/r)=(∂_r(r^2 ))/r^2, we obtain after integration with respect to the scale r: \n\n    D_1111^n=1/r^2∫_0^r s^2 (-Term1-Term2'+Term3+Term4+Term5+Term6+Term7)^n  ds,\n\n\n    D_1111^s=1/r^2∫_0^r s^2 (-Term1-Term2'+Term3+Term4+Term5+Term6+Term7)^s  ds.\n\n\nTo assess the importance of each term in transport equations (<ref>)-(<ref>) for the 3rd-order structure functions, we naturally start with the simulation case ρ_n/ρ=0.91 (see Tab. <ref>). For this case, where the normal fluid is predominant,  the results are expected to be similar to those known for a classical single-fluid turbulent flow <cit.>.  Figure  <ref> shows the scale-dependence of each term in  Eq. (<ref>), after normalization by ε_*^5/4ν_n^1/4, with ε_* the  constant energy rate injected to force turbulence.  \nNote that for this case the smallest resolved scale is smaller than the Kolmogorov scale η_n (see Tab. <ref>). \n\n\n\n\n  Term1  reflects the temporal decay of the 3rd-order structure function. This term is zero for steady-state flows and thus negligible here. Term2  (blue ∙ -) is the prevalent term over the scales within the RSR. The sum of the two transport terms Term2+Term2'  (red ∘) balances the pressure-related  Term3 (black - · ) fairly well, over the whole range of scales. \n \n  Term4 (red ×-, plotted with changed sign) is negative at small scales and positive at large scales. It represents the viscous destruction of the 3rd–order structure functions. As expected, this contribution is negligible over the RSR, but becomes important in the viscous range. At the smallest resolved scale, this is the most prevalent term and  is balanced by \n Term5 (black —), the dissipation source term. This term exhibits a plateau over the RSR, and it is 15 % of the other terms. Albeit smaller, this term cannot be ruled out. \n \n   Term6 (magenta -), representing the friction force coupling,  is the less important term. This seems reasonable behaviour for a fluid essentially composed of normal fluid.   Note also that Term6 is negative for the normal fluid, so  the figure illustrates (-Term6).  Finally,  the forcing term (Term7) (green - ·)  affects the very large scales only and its effect gradually diminishes towards small scales. \n\nThe analysis of this case suggests that, as in classical single-fluid turbulence <cit.>,  the two transport terms (Term2+ Term2') are only balanced by the pressure-related term Term3. This occurs over the whole range of scales, albeit the effect of the viscosity is obviously felt within the viscous range. The same conclusion was reached by\n <cit.> on the basis of experimental and DNS data. However, these authors did not calculate exactly the dissipation source term, neither the forcing term (which was neglected within the derivation, on the basis of the assumption of  very large Reynolds numbers). They also noted departures from homogeneity and isotropy, which are clearly observed in our simulations. \n\nAnother important remark is that, despite the low Reynolds number of the flow (R_λ≤ 100), all terms that might have represented the FRN effect (friction force coupling through Term6, forcing term Term7 and dissipation source term Term5) are negligible. Therefore, there is no direct imprint of the FRN effect on the 4th-order moments of velocity increments. There is the possibility that this effect might be indirect, through the pressure field.   The conclusion that FRN effect is negligible is further comforted by other simulations for different temperatures (see below). The consequences are that 4th-order structure functions are only shaped by the pressure field. This observation was revealed by e.g. <cit.>. The latter authors suggested a valuable model for the role of the pressure in turbulence. \n\n\nWe now extend our analysis to other cases (see Tab. <ref>). We consider the case ρ_n/ρ=0.5 (temperature around 2K) with balanced normal and superfluid fractions and the case ρ_n/ρ=0.09 (temperature close to 0.3K), with the superfluid dominating the flow. Terms in Eqs. \n(<ref>)-(<ref>) are depicted in Fig. <ref>. For the coherence of the message, we replot in  upper panels of Fig. <ref> the results obtained for ρ_n/ρ=0.91. \n\n\nTerm1  reflects the temporal decay of the 3rd-order structure function. As stated above,  this term is absent in our simulations. We have kept it in the transport equations, as it provides a way to assess the degree at which other terms influence its behaviour. For a direct cascade, D_111 is negative. An enhance of the cascade is consistent with positive values of the  temporal derivative of  (-D_111). For the normal fluid, this enhancement can be the result of the friction force coupling, via  Term6, which is negative (so -Term6 is positive).  Therefore, the cascade of the normal fluid may be enhanced by Term6. The opposite effect stands for the superfluid, for which Term6 is positive. The origin of this different sign is at the level of the HVBK model, for which the coupling term is accounted for with different signs, reflecting an enhancement of the momentum for the normal fluid, and a reduction of the momentum for the superfluid.  \n \nForcing terms (Term7)  are not shown in Fig. <ref>, because they only affect very large scales.\n\nGenerally speaking, as already emphasized, they exhibit similar behaviour to  classical turbulence, if  high temperatures are considered, corresponding to ρ_n/ρ=1. However, the additional mutual friction term Term6 plays a requisite role particularly for low temperatures, thus distinguishing the HVBK flow from classical fluids.\nIn the following section, we analyse  the results for each specific range of scales. \n\n\n\n\n\n\n\n\n\n\n\n §.§ Dissipative scales\n\nFor the normal fluid, similar to classical turbulence at small scales, the pressure source  Term3 and   transport terms (Term2 + Term2') scale as  r^3.  In contrast, the viscous Term4 and dissipation source  Term5 vary proportionally to r. The viscous Term4 balances the dissipation source  Term5 for the very small scales. Although small differences  between these two terms are noticeable  for the lowest density ratio  (ρ_n/ρ=0.09, see Figs. <ref> and <ref>), they are most likely due to the limited grid resolution. If we decrease r to very small values, the two terms  eventually cancel each other. \n\nMoreover, transport terms (Term2 + Term2') are nearly balanced by the pressure source  Term3 for the normal fluid (as already discussed and illustrated in the left column of Fig. <ref>).\n\nFor the superfluid (right column of Fig. <ref>), unlike classical turbulence at smallest scales,  transport terms are slightly larger than the pressure source term. This difference is most likely attributable to  the equipartition of energy <cit.>, which  finally results in the accumulation of energy at highest wavenumbers due to the very small value of the supefluid viscosity. \nMoreover, when the superfluid is dominant in the flow, the kinetic energy cannot be completely dissipated. This energy accumulates at the scales of the same order as the inter-vortex scale, which leads to an upward trend for the superfluid velocity spectrum. In quantum physics, this is associated with a partial thermalisation of superfluid excitations <cit.>. Note that the upward trend of the superfluid velocity spectrum depends on  simulation parameters of the HVBK model. The truncated HVBK model resolves two coupled viscous fluids with different, albeit constant,  viscosities. The ability to settle the smallest scales of both fluids requires, nonetheless, a sufficiently high resolution. \n\nFor small scales, the mutual friction term Term6 scales as  r^3 in both normal and superfluid components. Term6 decreases much faster than both  dissipation source and viscous terms. This underlines that  at small scales, the viscous and the dissipation source terms (both directly depending on the viscosity) are dominant.\n\n\n\n\n\n\n\n §.§ Intermediate scales\n\n\nConsidering the moderate values of the Reynolds number in these simulations, a clear inertial range is not established. We  prefer to refer to a restricted  scaling  range (RSR), defined as the range of scales over which different statistics exhibit a discernible scaling, albeit with exponents smaller than those predicted by asymptotic (for infinitely large Reynolds numbers) theories.     \n\n\n\n\n\n\nAn analytical form of the 4th-order longitudinal structure function can be obtained from Eq. (<ref>) by integrating the sum of  terms 1 to 5:\n\n    D_1111=1/r^2∫_0^r s^2 (-Term1-Term2'+Term3+Term4+Term5) ds.\n\nIn a statistically steady flow, Term1 is zero. In the RSR, Term4 is negligible. One  condition that D_1111 follows a pure power law is consistent with the requirement  that all terms on the right-hand side of Eq.  (<ref>) also exhibit pure power laws, or cancel each other. Term2' and Term3 are shown to follow similar power laws,  while the dissipation source  Term5 exhibits  a different exponent <cit.>.  It is important to shed some light on the difference between classical turbulence and HVBK quantum turbulence entailed by the mutual friction coupling effect quantified by  Term6.\n\nSimilar to classical turbulence,  the RSR is not clearly discernible due to the low value of the Reynolds number. Nonetheless, the pressure source Term3  perfectly balances transport terms (Term2 + Term2'), while the viscous  Term4 is negligible.  Unlike the classical turbulence in the RSR, the mutual friction Term6 acts as  a source term.  Since D_111 is negative, ∂_t D_111 < 0 reflects vortex stretching enhancement, whilst  ∂_t D_111 > 0 corroborates with reduced vortex stretching. The sign of Term6 (negative in Eq. (<ref>) and positive in Eq. (<ref>)), directly reflects enhanced vortex stretching in the normal fluid (thus, an accelerated cascade) and reduced  vortex stretching and cascade in the superfluid. \n\nFor the normal fluid, Term6 and the  dissipation source  Term5 have opposed signs. For decreasing values of the  density ratio ρ_n/ρ, the mutual friction Term6 gradually increases,  which in turn leads to an enhancement  of the dissipation source Term5. The physical picture behind this statistical equilibrium between terms  is  that the increase of the vortex stretching rate reflected by  Term5 requires damping  through the dissipation source term. For the flow to be statistically stationary at the highest normal fluid density ratio (ρ_n/ρ=0.91),  only a  small vortex stretching rate has to be introduced by the mutual friction. The normal fluid remains indeed unaffected by the superfluid, thus  behaving  as in classical turbulence. When the superfluid is  dominant (ρ_n/ρ=0.09), the mutual friction becomes important in the normal fluid, thus resulting in  a large dissipation source term. At the level of Eqs. (<ref>) and (<ref>), the dissipation source term is non-negligible. This term can effectively modify the scaling exponent of the 4th-order structure functions of velocity increment in the RSR. Interestingly, one can expect that for 0.09<ρ_n/ρ<0.5, the mutual friction term cancels  the dissipation source term completely. This could trigger an exact 4/3 scaling exponent for the 4th-order structure functions in the RSR,  for the normal fluid. Therefore, one of our important conclusions is that the normal fluid behaves at very low temperatures as a perfect fluid, since  viscous effects are annihilated by the mutual friction coupling.  \n\nFor the superfluid, the mutual friction  Term6 and the dissipation source Term5 are  positive and thus  reduce the vortex stretching. When one of them grows, the other one diminishes. In the inviscid limit ν_s = 0, only Term6 prevails. When the temperature goes to absolute zero, Term6 diminishes and  there is no source in the superfluid. In classical turbulence, the scaling exponent of the 4th-order structure functions of the velocity increment in RSR (or in the inertial range) should be ζ_4=4/3 as predicated by the Kolmogorov theory K41. \nIn the HVBK model, the viscosity of the superfluid ν_s is not exactly zero. For large superfluid density ratios (ρ_s/ρ =0.91) the mutual friction term is small and the dissipation source term prevails,  being comparable to Term6.  For low superfluid density ratios (ρ_s/ρ =0.09), the dissipation source term is negligible compared to the mutual friction term in the RSR. Both Term6 and Term5 are scale-dependent and they may impact  the scaling exponent of the 4th-order structure functions. \n\n\n\nFinally, the mutual friction terms make the behavior of the 4th-order structure function in the RSR to be more complicated than in classical turbulence. The normal fluid is associated with an enhanced dissipation source term in the RSR for lower and lower temperatures (decreasing ρ_n/ρ). In the superfluid, the mutual friction term acts as an addition to the dissipation source term. \n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\n\n\n\n\n\n\n\n\n\n\t\t\n\n\n\n\n\n\nIn the following, we complete our overview of the flow by focusing on the smallest scales, represented by velocity gradients. \n\n\n\n\n\n\n§ ONE-POINT STATISTICS OF  VELOCITY GRADIENTS\n \n\nWe focus on one-point statistics of the small-scale motion. Particular emphasis is put on the flatness of the velocity gradient, which reflects the effect of turbulence intermittency on small scales dynamics. The probability density function (PDF) of the longitudinal velocity gradient ξ = ∂_x u, for the same  density ratios as previously (ρ_n/ρ=0.91, 0.5, 0.09), are shown in Figs. <ref> and <ref>  for the normal and superfluid components, respectively. Similar to classical turbulence, PDFs exhibit non-Gaussian skewed shapes, with stretched tails skewed towards negative values of the velocity gradients. Note that negative values of velocity gradients are much larger than its variance.  For decreasing values of  the normal fluid density ratios, PDFs tails become more and more stretched. However, PDFs of the velocity gradients in the superfluid show non-monotonic trends. \n\nThe integration over the whole domain leads  to the pth-order moment of ξ:\n\n    ⟨ξ^p ⟩ = ∫_-∞^∞ξ^p PDF(ξ) dξ.\n\nThe normalized 4th-order moment is the flatness factor:\n\n    F = ⟨ξ^4⟩/⟨ξ^2⟩ ^2.\n\n\n\nFigure <ref> shows PDFs of gradients of longitudinal velocity (panels a and b) and normalized PDFs (panels c and d) as \n (ξ/σ)^4PDF, where σ = √(⟨ξ^2 ⟩ - ⟨ξ⟩^2) is the standard deviation of the velocity gradient.\n PDFs are well converged for large events, with errors smaller than 1%. This signifies  that flatness factors computed from the PDFs are accurate. Flatness factors  are plotted in Fig.  <ref> for all considered cases. For the normal fluid, the flatness factor increases monotonically when ρ_n/ρ diminishes, which indicates that the intermittency in normal fluid is enhanced for lower and lower temperatures.  The superfluid follows the same trend as the normal fluid. \n \n\n\nThis observation can be explained by the energy exchange between the two fluid components. On average, mutual friction acts as a  source term that enhances energy at all scales in the normal fluid. Since energy input is expected to occur mainly at locations with strong vorticity, we suggest the following scenario.\nFirst, vorticity distributions in the two fluids are coherent (aligned) and the mutual friction depends directly on the magnitude of the vorticity.\nAs the relative velocity seems to be uniformly distributed in space,  with a Gaussian PDF, we infer  that the mutual friction enhances locally the vorticity and thus the intermittency. When the density ratio ρ_n/ρ decreases, the mutual friction term in the normal fluid momentum equation is more important. As a consequence, the intermittency grows when  the temperature diminishes.    The superfluid is strongly locked with the normal fluid, thus following a similar trend.  \n\n\n\n\n\nWe further compute the flatness of the total longitudinal velocity gradient  ∂_x u = ρ_n/ρ∂_x u_n +ρ_s/ρ∂_x u_s, with u_n and u_s the longitudinal velocity components in the normal fluid and superfluid, respectively.\nFlatness factors of  the total longitudinal velocity gradient are plotted against ρ_n/ρ in Fig. <ref>. The flatness factor is controlled by the normal fluid for high ρ_n/ρ, and by the superfluid for low ρ_n/ρ.  The intermittency of the total fluid  continuously increases when the temperature diminishes. \n\nIn Fig. \n<ref>, horizontal short lines indicate DNS results of classical turbulence flatness factor for different values of R_λ <cit.>.  For Reynolds numbers close to that considered in our simulations (R_λ≈ 94),  the flatness F in classical turbulence ranges between 5.42 and 5.55. These values are very close to the flatness  we obtained  for ρ_n/ρ = 0.91, corresponding to R_λ≈ 90 in the normal fluid. When ρ_n/ρ decreases,   R_λ also decreases in normal fluid (due to the mutual friction), and the flatness factor increases for the total fluid. We obtained the value  F=5.786 for ρ_n/ρ=0.5. While a resolution of N=512 leads to a flatness that drops back to F=5.268 for ρ_n/ρ=0.09, an enhanced resolution of N=1024 leads to values comparable for both normal and superfluid, thus emphasizing their locking.\n\n\nHVBK quantum turbulence simulated here exhibits  the same degree of intermittency  as observed in classical turbulence.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ THE FLATNESS OF THE VELOCITY DERIVATIVE IN SUPERFLUID TURBULENCE\n \n\nAt this stage, it is important to go back to the theoretical framework provided by  first principles (here the HVBK equations) and to consider the limiting behavior of Eqs. (<ref>) and (<ref>).\n\n\n\n\n\n\n\n\n\n\nTo obtain the expression of the flatness derivative, we consider that r → 0 and apply a Taylor series expansion up to the fifth-order in r <cit.>.  Using the homogeneity hypothesis, we obtain:   \n\n    ∂/∂ x( ∂ u/∂ x)^2( ∂ ^2u/∂x^2)   = 0⟹ 2  (∂ u/∂ x) ( ∂^2 u/∂ x^2) =  -(∂ u/∂ x)^2 ( ∂^3 u/∂ x^3),\n\nand hence\n\n    (δ u)^3≃(∂ u/∂ x)^3 r^3 - 1/4(∂ u/∂ x)  ( ∂^2 u/∂ x^2)^2  r^5+....\n\nThe 4th-order structure function can be written as  \n\n    D_1111= (δ u)^4≃( ∂ u/∂ x)^4 r^4+ ...\n\nand similarly\n\n    D_1122= ⟨(δ u )^2(δ v )^2⟩≃( ∂ u/∂ x)^2 ( ∂ v/∂ x)^2 r^4+....\n\n\n\nAn equation for F, the velocity derivative flatness factor (<ref>), can be obtained <cit.>  by applying the following operator O  to terms in Eqs.  (<ref>) and  (<ref>):\n\n    O(Term) ≡lim_r→ 0Term/r^3/(δ u)^2^2/r^4=lim_r→ 0 \n    \tr ·Term/(δ u)^2^2.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe obtain that \n\n    O (Term 2')= -6 ( ∂ u/∂ x)^2 ( ∂ v/∂ x)^2  /  ( ∂ u/∂ x)^2^2 = -6 S_uv,2,\n\nwhere the notation S_uv,2 was introduced for the sake of simplicity. \nThe pressure term becomes, once O  is applied:  \n\n\n\n\n\n    O (Term 3) = - 3   (∂ u/∂ x)^2 ∂^2 p /∂ x^2/(∂ u/∂ x)^2^2.\n\nAfter applying the operator O to the coefficient  r^3, the dissipation term leads to \n\n    O (Term 4)|_r^3 =  9ν( ∂^3 u/∂ x^3)( ∂ u /∂ x)^2 /(∂ u/∂ x)^2^2.\n\n\nTerm5  leads to a linear combination\n\n    O (Term 5)|_r^3 = - 2ν( ∂^3 u/∂ x^3)(∂ u /∂ y)^2  +4ν(∂^3 u/∂ x^3)(∂ u /∂ x)^2/(∂ u/∂ x)^2^2.\n\n\nTerm6, specific to HVBK equations, leads after Taylor series expansion and application of the operator O, for the normal fluid:\n\n    O (Term 6)^n ∼ 3 ρ_s/ρ(∂ u/∂ x)^2(∂ F_∥/∂ x)^ns/(∂ u/∂ x)^2^2,\n\nand for the superfluid\n\n    O (Term 6)^s ∼ - 3 ρ_n/ρ(∂ u/∂ x)^2(∂ F_∥/∂ x)^ns/(∂ u/∂ x)^2^2.\n\nSimilarly, Term7 leads for the normal fluid\n\n    O (Term 7)^n ∼ 3  (∂ u/∂ x)^2(∂ f_∥/∂ x)^n/(∂ u/∂ x)^2^2,\n\nand for the superfluid\n\n    O (Term 7)^s ∼ 3  (∂ u/∂ x)^2(∂ f_∥/∂ x)^s/(∂ u/∂ x)^2^2.\n\n\nThe limiting form of Eqs. (<ref>) and (<ref>) as r → 0 can be finally presented as\n\n    6(F^n-S_uv,2^n)   =   O (Term 3)^n + O (Term 4)^n|_r^3 + O (Term 5)^n|_r^3+  O (Term 6)^n+ O (Term 7)^n,\n    6(1-S_uv,2^s/S_4^s) F^s   =   O (Term 3)^s + O (Term 4)^s|_r^3 + O (Term 5)^s|_r^3+  O (Term 6)^s+ O (Term 7)^s,\n\n\n\n<cit.> showed that S_uv,2 / F ≈ 0.85 if Re_λ >200 and this constant is independent of the Reynolds number. For the present study, values of  S_uv,2 / S_4 are shown for different density ratios in Tab. <ref>. These values remain almost unchanged for the ρ_n/ρ = 0.91,  0.5, but for ρ_n/ρ = 0.09, S_uv,2 / S_4 slightly diminishes and drops to 0.75 for the normal fluid, and 0.705 for the superfluid. \n\n\n\nTable <ref> shows that all terms in Eq. (<ref>) are very well balanced. This proves that all terms are correctly accounted for.  \n In the normal fluid, the balance between different terms is reached within an error of   0.05 % for the flatness F.  O(Term3) increases as the temperature diminishes (the normal fluid is less and less present). Viscous terms are not negligible in the case of present Re_λ. The combined contribution  of O(Term4)+O (Term5) increases, but this enhancement is counter-balanced  by the mutual friction force contribution O (Term 6).  The external force was neglected, as usually done for larger scales in classical turbulence. \n\n\n\nFor the superfluid, only the pressure-related  term O(Term 3) matters. This result corroborates with a scenario valid for large Reynolds numbers in classical turbulence.   O(Term 3) increases monotonically when  the temperature decreases. For the lowest temperature, the ratio S_uv,2 /F is the smallest and  both S_uv,2 and F are smaller than for higher temperatures.   This behaviour is corroborated with    the spectral cut-off inherently introduced in DNS at the inter-vortex scale, which  leads to an under estimation of high-order moments of small scales (here, represented by velocity  gradients). However, this behaviour can have a physical explanation in the superfluid helium by the energy accumulation at scales close to the inter-vortex scale. \nWe finally note that for ρ_n/ρ=0.09 the terms are not well balanced as in other cases and errors are up to  15%. This is due to the limited resolution for the superfluid at low temperatures.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n \n\n\nWe used direct numerical simulations of the HVBK model to inspect, for different density ratios,  the behaviour of the 4th-order structure function, as resulting from the transport equation of the 3rd–order structure function. Starting from the HVBK equations  for two fluids, we derived the 3rd-order structure function transport equations in both normal and superfluid. \nWithin the Restricted Scaling Range, we found that the mutual friction does not modify significantly the dynamics  of viscous scales. Similar to the classical turbulence, viscous terms and  dissipative source terms are less important than the other terms. The mutual friction term acts differently for the two fluid components. For the normal fluid, the mutual friction term has an opposite sign with respect to the dissipation source terms.  Depending on the density ratios,   it can diminish, and even completely cancel the action of  the dissipation source term.  \nFor the lowest temperature, we show that the normal fluid behaves, in the RSR,  as a fluid with zero viscosity.  \nIn superfluid, the mutual friction term is mostly irrelevant. It can be neglected when compared to the transport terms and the pressure source term. The dissipation source term, introduced by the (artificial) superfluid viscosity, has the same sign as the mutual friction term, finally resulting in a diminished cascade and reduced small-scales intermittency,  as reflected by the flatness of the velocity derivative. \nNote that RSR intermittency effects are not addressed here, as the conventional assessment of the scaling exponents is limited by the relatively low values of the Reynolds numbers. \n\nWe also used one-point statistics, PDFs of longitudinal velocity gradient to analyse the temperature dependency of small-scale  intermittency of quantum turbulence. We conclude that both the normal fluid and superfluid intermittency is enhanced when ρ_n/ρ  is decreasing.   This is consistent with the strong locking of the two fluids. The flatness factors are also found in reasonable agreement with classical turbulence. \n Further perspectives of this work include the account of a more general expression of the friction force, based upon at least one additional equation for e.g. the vortex  line density <cit.>. Another open question is the  coupling between Navier-Stokes like equations with Gross-Pitaevskii equation for very small scales and very low temperatures.\n \n\n\n\n\n\n\n\n\nThe authors declare no conflict of interest. \n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nThe authors acknowledge financial support from the French ANR grant ANR-18-CE46-0013 QUTE-HPC. This work used computational resources provided by  CRIANN (Centre Régional Informatique et d'Applications Numériques de Normandie).\nDrs. M. Gauding and G. Sadaka are warmly thanked for technical support and useful discussions. \n\n\n\n\n\n\n\n§ APPENDIX 1. ROBUSTNESS OF THE RESULTS FOR A SMALLER VISCOSITY RATIO\n \n\n\tWe have performed numerical simulations for a different viscosity ratio, i.e. 0.025, a quarter of that initially studied and reported in the corpus of the paper.  \nFigure <ref> shows the energy spectrum for different viscosity ratios, and  for the density ratio of ρ_s/ρ_n = 1. For smaller viscosity ratio ν_s/ν_n=0.025, the energy content at the level of the cut-off scales is slightly larger than for the  viscosity ratio ν_s/ν_n=0.1. While this  result is obvious, as the superfluid dissipates less, the difference is negligible. The dissipation scale η_s = (ν_s^3/ε_s)^1/4 (the Kolmogorov scale) for the smaller viscosity ratio ν_s/ν_n=0.025 is significantly reduced, and equal to   η_s = 0.0017, whereas it was of  η_s = 0.0034 for ν_s/ν_n=0.1. \nFor ν_s/ν_n=0.025, the viscosity of the superfluid decreases, while  the mean energy dissipation rate of the superfluid increases. The dissipation rate for ν_s/ν_n=0.1 was of ε_s = 1.8e-4, while  for ν_s/ν_n=0.025 we compute  ε_s = 5.5463e-4. The reason of this increase is the accumulation of the energy at small scales, resulting in an increase of velocity gradients. \n\n\n\n\nFigure <ref> shows terms in the equations for different viscosity ratios. Noticeable  is the fact that variations of the density ratio affect only the dissipation source term of the superfluid, viz.  (- x) and (- -) on the right column. The inertial terms are the same. We can therefore  conclude that the choice of the viscosity ratio has limited influence on the results,  as long as the ratio of viscosities is small (<0.1) and respects the concept of the HVBK two-fluid model.  The same result is supported by our simulations for other values of density ratios. \n\nFor lowest temperatures, the resolution currently used is not sufficient to capture the smallest scales motion. We recall that the mesh size should be smaller than both the normal fluid Kolmogorov scale η_n, and the inter-vortex length of the superfluid. The superfluid also has its Kolmogorov scale η_s but it should be irrelevant in the framework of  the HVBK two-fluid model.\n\n\n\n\n\n\n\n\n\n\n\n§ APPENDIX 2. THE EFFECT OF THE RESOLUTION ON THE RESULTS\n \n\nWe have performed additional numerical simulations, with a better resolution. Different statistics, such as  spectra  for  a number of grid points N=512 and N=1024 are depicted  in figure <ref> for ρ_n/ρ_s = 1 and ρ_n/ρ_s = 0.1 respectively. For  N=1024, the spectrum  is cut-off at higher wave numbers. The additional kinetic energy is, however, negligible. \n\nThe normalised 4th-order structure function (Fig. <ref>) tends towards a slightly  larger value at the smallest scales,  but still  within the error bars.  Figure <ref> depicts values for the flatness of the velocity derivative for two resolutions. While for the normal fluid the results are the same, we notice a slight increase of the flatness of the superfluid at the lowest temperature, from a value of 5.25 obtained for N=512 to a value of 6 for N=1024. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ APPENDIX 3.  EFFECT OF CONSIDERING THE FULL EXPRESSION OF THE MUTUAL FRICTION FORCE\n  \n\nWe test our claims by considering a generalized expression of the mutual friction force <cit.>, viz. \n\n\n    F_ns = B/2ρ_sρ_n/ρω_s×[ ω_s×  (v_n -v_s -L)]+Bp/2ρ_sρ_n/ρω_s×  (v_n -v_s - L),\n\nwhere L is the vortex line velocity due to the oscillation of the vortex wave and writes\n\n    L = κ/4πlog(l/a_0) ∇×ω_s\n\nl=√(κ/ω_s) is the inter-vortex length, a_0 is the vortex core size, and κ is the unit circulation. \n \nIn this work, we have made two simplifications. \nFirst, we neglected the velocity due to the vortex line oscillation L. Because in the limit of  high Reynolds numbers, l →𝒪(a_0) implies L→𝒪(κ). The latter  is too small compared to the characteristic velocity of the superfluid to be taken into account. \n\nOn the other hand, in the original idea of the mutual friction force proposed by Hall and Vinen, the vortex lines are considered as filaments with no mass, which implies that the inertial effects of the vortex lines are irrelevant. As a matter of fact, based on the concept of two-fluid model, the superfluid velocity resolved by the NS equations is a space-smoothed value ṽ_s, which is the velocity induced by the vortex line smoothed (or averaged) over a large volume of fluid. In this context, ṽ_s is equivalent to v_s + L. The velocity due to the vortex tangle oscillation is not actually neglected, but merged into  ṽ_s. \n\nAlthough we have ignored L into a simplified scenario, we do not suggest L should always be neglected. The contribution of L is interesting to be considered in some situations. For instance, when  v_n -v_s = 0, due to the contribution of L the mutual friction force is not zero.   However,  for the present work, we neglect L.\nThe mutual friction force then consists of two components: one is parallel to the relative velocity v_n -v_s, noted F_ns∥ = B/2ρ_sρ_n/ρω_s×[ ω_s×  (v_n -v_s)]. The other one is perpendicular to the relative velocity v_n -v_s, noted F_ns⊥ = Bp/2ρ_sρ_n/ρω_s×  (v_n -v_s). The mutual friction force is \n\n    F_ns = B/2ρ_sρ_n/ρω_s×[ ω_s×  (v_n -v_s)]+Bp/2ρ_sρ_n/ρω_s×  (v_n -v_s),\n\nand with the supposition that  ω_s ⊥ (v_n -v_s), it becomes \n\n    F_ns∥ = B/2ρ_sρ_n/ρω_s×[ ω_s×  (v_n -v_s)] = - B/2ρ_sρ_n/ρ|ω_s|(v_n -v_s),\n\nand \n\n    F_ns⊥ = Bp/2ρ_sρ_n/ρω_s×  (v_n -v_s).\n\nThe second simplification of the present work is to consider only the component  F_ns∥,  basically because  F_ns⊥ is considered as being non-dissipative and represents a Magnus effect associated with quantized vortices  <cit.>. It signifies that  F_ns∥ is responsible for  the energy exchange between the two components,  while F_ns⊥ does not contribute much to the energy exchange between the two fluids. \n\nA first validation  of our considerations is backed by the statistics of the angle made by  u_n and F_ns. Figure <ref> depicts the PDF of the angle made by the velocity vector   and different components  of the force F_ns⊥ and F_ns∥, for the normal fluid (left) and the superfluid (right). The PDF ∡ (u_n, F_ns∥) is skewed towards values of the angle between (0,π/2). This signifies that u_n is preferably aligned with F_ns∥. Therefore,  F_ns∥ injects energy to the normal fluid. The PDF of the angle ∡ (u_n, F_ns⊥) is  almost symmetric about the value of  π/2. This signifies that the F_ns⊥ does not inject energy to the normal fluid. \nThe same qualitative observation holds for  the PDF of ∡ (u_s, F_ns). The parallel component F_ns∥ extracts energy from the superfluid and F_ns⊥ does not affect, on average, the superfluid. These are arguments that serve as a basis in neglecting  F_ns⊥. \n\nFurthermore, the temperature-related coefficient B is generally larger than Bp. For example, for T=1.95K, B=0.98 and Bp=0.05. The spectrum of u_n,sF_ns⊥ is negligible compared to that of u_n,sF_ns∥, see figure <ref>. This is an additional reason for considering  the simplified form of the mutual friction force,  as provided by Eq. (<ref>), and considered  in the present work. \n \n\nThe scale-by-scale transport equation for the third–order structure function is not affected by the  consideration of the complete expression of the friction force,  (<ref>). \nAdditional numerical studies considering  the full expression of vortex oscillations will be performed in the future.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n64\n\tnatexlab#1#1#1#1 #1#1 #1#1#1#1#1#1\n\t#1#1#1#1 #1#1 #1#1\n\t#1#1#1#1#1#1#1#1\n\t\n\t[Abid et al.(2003)Abid, Huepe, Metens, Nore, Pham, Tuckerman &\n\tBrachet]Abid2003509\n\tAbid, M., Huepe, C., Metens, S., Nore, C., Pham,\n\t\t\tC., Tuckerman, L. & Brachet, M. E. 2003\n\tGross-Pitaevskii dynamics of Bose-Einstein condensates and\n\t\tsuperfluid turbulence.  Fluid Dynamics Research  33 (5-6),\n\t509–544.\n\t\n\t[Baggaley et al.(2012)Baggaley, Barenghi, Shukurov &\n\tSergeev]Baggaley_2012\n\tBaggaley, A. W., Barenghi, C. F., Shukurov, A. &\n\t\tSergeev, Y. A. 2012  Coherent vortex structures in quantum\n\t\tturbulence.  Europhysics Lett.  98 (2),  26002.\n\t\n\t[Balibar(2017)]QT-Balibar-Tisza\n\tBalibar, S. 2017  Laszlo Tisza and the two-fluid model of\n\t\tsuperfluidity.  Comptes Rendus Physique  18 (9),  586–591.\n\t\n\t[Barenghi et al.(1983)Barenghi, Donnelly &\n\tVinen]Barenghi_1983\n\tBarenghi, C. F., Donnelly, R. J. & Vinen, W. F. 1983\n\tFriction on quantized vortices in Helium II. A review.  J.\n\t\tLow Temp. Phys.  52,  189–247.\n\t\n\t[Barenghi et al.(2014a)Barenghi,\n\tL’vov & Roche]Barenghi_2013\n\tBarenghi, C. F., L’vov, V. S. & Roche,\n\t\t\tP.-E. 2014a  Experimental, numerical, and\n\t\tanalytical velocity spectra in turbulent quantum fluid.  Proceedings of\n\t\tthe National Academy of Sciences  111 (Supplement 1),\n\t4683–4690.\n\t\n\t[Barenghi et al.(2014b)Barenghi, Skrbek &\n\tSreenivasan]Barenghi_etal_2014\n\tBarenghi, C. F., Skrbek, L. & Sreenivasan, K. R.\n\t2014b  Introduction to quantum turbulence.\n\tProc. Natl. Acad. Sci.  111,  4647.\n\t\n\t[Batchelor & Townsend(1949)]Batchelor_Townsend_nature_1949\n\tBatchelor, G. K. & Townsend, A. A. 1949  The nature\n\t\tof turbulent motion at large wave-numbers.  Proceedings of the Royal\n\t\tSociety of London. Series A. Mathematical and Physical Sciences  199,\n\t238–255.\n\t\n\t[Biferale et al.(2018)Biferale, Khomenko, L'vov, Pomyalov,\n\tProcaccia & Sahoo]Biferale_2018\n\tBiferale, L., Khomenko, D., L'vov, V. S., Pomyalov,\n\t\t\tA., Procaccia, I. & Sahoo, G. 2018  Turbulent\n\t\tstatistics and intermittency enhancement in coflowing superfluid\n\t\t^4He.  Phys. Rev. Fluids  3,  024605.\n\t\n\t[Boschung et al.(2017)Boschung, Hennig, Denker, Pitsch &\n\tHill]Boschung2017\n\tBoschung, J., Hennig, F., Denker, D., Pitsch, H. &\n\t\tHill, R. J. 2017  Analysis of structure function equations up\n\t\tto the seventh order.  J. of Turbulence  18 (11),\n\t1001–1032.\n\t\n\t[Boué et al.(2015)Boué, L'vov, Nagar, Nazarenko, Pomyalov\n\t& Procaccia]Boue_2015\n\tBoué, L., L'vov, V. S., Nagar, Y., Nazarenko, S. V.,\n\t\tPomyalov, A. & Procaccia, I. 2015  Energy and vorticity\n\t\tspectra in turbulent superfluid ^4He from T=0 to\n\t\tT_.  Phys. Rev. B  91,  144501.\n\t\n\t[Boué et al.(2013)Boué, L'vov, Pomyalov &\n\tProcaccia]Boue_2013\n\tBoué, L., L'vov, V. S., Pomyalov, A. & Procaccia,\n\t\t\tI. 2013  Enhancement of intermittency in superfluid turbulence.\n\tPhys. Rev. Lett.  110,  014502.\n\t\n\t[Bradley et al.(2008)Bradley, Fisher, Guénault, Haley,\n\tO'Sullivan, Pickett & Tsepelin]Bradley_2008\n\tBradley, D. I., Fisher, S. N., Guénault, A. M.,\n\t\tHaley, R. P., O'Sullivan, S., Pickett, G. R. & Tsepelin,\n\t\t\tV. 2008  Fluctuations and correlations of pure quantum turbulence\n\t\tin superfluid ^3HeB.\n\tPhys. Rev. Lett.  101 (4),  065302.\n\t\n\t[Djenidi et al.(2017a)Djenidi, Antonia &\n\tDanaila]Djenidi2017PRF\n\tDjenidi, L., Antonia, R. A. & Danaila, L.\n\t2017a  Self-preservation relation to the\n\t\tKolmogorov similarity hypotheses.  Phys. Rev. Fluids\n\t2,  054606.\n\t\n\t[Djenidi et al.(2017b)Djenidi, Antonia,\n\tDanaila & Tang]Lyazid2017\n\tDjenidi, L., Antonia, R. A., Danaila, L. & Tang,\n\t\t\tS. L. 2017b  A note on the velocity\n\t\tderivative flatness factor in decaying HIT.  Phys. of\n\t\tFluids  29,  051702.\n\t\n\t[Donnelly(1991)]QT-book-1991-donnelly\n\tDonnelly, R. J., ed. 1991 Quantized Vortices in Helium\n\t\tII.  CUP.\n\t\n\t[Donnelly(2009)]2009_Donnelly_yearophysic\n\tDonnelly, R. J. 2009  The two-fluid theory and second sound\n\t\tin liquid Helium.  Physics Today  62 (10),\n\t34–39.\n\t\n\t[Galantucci et al.(2020)Galantucci, Baggaley, Barenghi &\n\tKrstulovic]QT-coupling-2020-gal\n\tGalantucci, L., Baggaley, A. W., Barenghi, C. F. &\n\t\tKrstulovic, G. 2020  A new self-consistent approach of quantum\n\t\tturbulence in superfluid helium.  The European Physical Journal Plus\n\t135 (7),  547.\n\t\n\t[Galantucci et al.(2021)Galantucci, Krstulovic &\n\tBarenghi]galantucci2021-bundle\n\tGalantucci, L., Krstulovic, G. & Barenghi, C. F.\n\t2021  Friction-enhanced lifetime of bundled quantum vortices.\n\tarXiv  2107.07768.\n\t\n\t[Gauding et al.(2017)Gauding, Danaila &\n\tVarea]gauding2017high\n\tGauding, M., Danaila, L. & Varea, E. 2017\n\tHigh-order structure functions for passive scalar fed by a mean\n\t\tgradient.  International Journal of Heat and Fluid Flow  67,\n\t86–93.\n\t\n\t[Gotoh & Nakano(2003)]Gotoh_Nakano_2003\n\tGotoh, T. & Nakano, T. 2003  Role of pressure in\n\t\tturbulence.  J. Stat. Phys.  113,  855–875.\n\t\n\t[Hall & Vinen(1956)]Hall_Vinen_1956\n\tHall, H. E. & Vinen, W. F. 1956  The rotation of\n\t\tliquid Helium II: Experiments on the propagation of second\n\t\tsound in uniformly rotating Helium II.  Proc. Roy.\n\t\tSoc. London  Ser A, 238,  204.\n\t\n\t[Halperin & Tsubota(2009)]QT-book-2009-tsubota\n\tHalperin, B. & Tsubota, M., ed. 2009 Quantum\n\t\tTurbulence. Progress in Low Temperature Physics 16.\n\tSpringer.\n\t\n\t[Henderson & Barenghi(2004)]henderson2004superfluid\n\tHenderson, K. L. & Barenghi, C. F. 2004  Superfluid\n\t\tcouette flow in an enclosed annulus.  Theoretical and Computational\n\t\tFluid Dynamics  18 (2),  183–196.\n\t\n\t[Hill(2001)]Hill2001\n\tHill, R. 2001  Equations relating structure functions of\n\t\tall orders.  J. Fluid Mech.  434,  379–388.\n\t\n\t[Hill & Boratav(2001)]Hill_Boratav2001\n\tHill, R. & Boratav, O. 2001  Next-order structure\n\t\tfunction equations.  Phys. of Fluids  13,  276.\n\t\n\t[Ishihara & Gotoh(2009)]Ishihara_2009review\n\tIshihara, T. & Gotoh, T.and Kaneda, Y. 2009  Study of\n\t\thigh-Reynolds number isotropic turbulence by direct numerical simulation.\n\tAnnual Review of Fluid Mechanics  41 (1),  165–180.\n\t\n\t[Ishihara et al.(2007)Ishihara, Kaneda, Yokokawa, Itakura &\n\tUno]Ishihara_2007\n\tIshihara, T., Kaneda, Y., Yokokawa, M., Itakura, K. &\n\t\tUno, A. 2007  Small-scale statistics in high-resolution direct\n\t\tnumerical simulation of turbulence: Reynolds number dependence of one-point\n\t\tvelocity gradient statistics.  J. Fluid Mech.  592,\n\t335–366.\n\t\n\t[Jou et al.(2011)Jou, Mongiovì &\n\tSciacca]jou2011hydrodynamic\n\tJou, D., Mongiovì, M. S. & Sciacca, M. 2011\n\tHydrodynamic equations of anisotropic, polarized and inhomogeneous\n\t\tsuperfluid vortex tangles.  Physica D: Nonlinear Phenomena\n\t240 (3),  249–258.\n\t\n\t[Khalatnikov(1965)]QT-book-1965-khal\n\tKhalatnikov, I. M. 1965 An Introduction to the Theory of\n\t\tSuperfluidity.  Benjamin.\n\t\n\t[Kobayashi et al.(2021)Kobayashi, Parnaudeau, Luddens,\n\tLothodé, Danaila, Brachet & Danaila]dan-2021-CPC-QUTE\n\tKobayashi, M., Parnaudeau, P., Luddens, F.,\n\t\tLothodé, C., Danaila, L., Brachet, M. & Danaila, I.\n\t2021  Quantum turbulence simulations using the Gross-Pitaevskii\n\t\tequation: High-performance computing and new numerical benchmarks.\n\tComputer Physics Communications  258,  107579.\n\t\n\t[Kolmogorov(1941a)]Kolmogorov1941\n\tKolmogorov, A. N. 1941a  Dissipation\n\t\tof energy in the locally isotropic turbulence.  Dokl. Akad. Nauk SSSR\n\t32(1),  16–18.\n\t\n\t[Kolmogorov(1941b)]Kolmogorov1941a\n\tKolmogorov, A. N. 1941b  The local\n\t\tstructure of turbulence in incompressible viscous fluids for very large\n\t\tReynolds numbers.  Dokl. Akad. Nauk SSSR  30(4),\n\t301–305.\n\t\n\t[Kolmogorov(1962)]Kolmogorov1962\n\tKolmogorov, A. N. 1962  A refinement of previous hypotheses\n\t\tconcerning the local structure of turbulence in a viscous incompressible\n\t\tfluid at high Reynolds number.  J. Fluid Mech.  13(1),\n\t82–85.\n\t\n\t[Krstulovic(2016)]krstulovic2016\n\tKrstulovic, G. 2016  Grid superfluid turbulence and\n\t\tintermittency at very low temperature.  Phys. Rev. E  93,\n\t063104.\n\t\n\t[Landau(1941)]Landau1941\n\tLandau, L. 1941  Theory of the superfluidity of\n\t\tHelium II.  Physical Review  60 (4),\n\t356–358.\n\t\n\t[Lipniacki(2006)]QT-Lipniacki-2006\n\tLipniacki, T. 2006  Dynamics of superfluid 4He: Two-scale\n\t\tapproach.  European Journal of Mechanics - B/Fluids  25 (4),\n\t435–458.\n\t\n\t[Lvov et al.(2006)Lvov, Nazarenko & Skrbek]Lvov_2006\n\tLvov, V., Nazarenko, S. & Skrbek, L. 2006\n\tEnergy spectra of developed turbulence in Helium superfluids.\n\tJ. of Low Temperature Physics  145,  125–142.\n\t\n\t[Maurer & Tabeling(1998)]Maurer_1998\n\tMaurer, J. & Tabeling, P. 1998  Local investigation\n\t\tof superfluid turbulence.  Europhysics Lett.  43 (1),\n\t29–34.\n\t\n\t[Mongiovi et al.(2018)Mongiovi, Jou & Sciacca]MONGIOVI2018\n\tMongiovi, M. S., Jou, D. & Sciacca, M. 2018\n\tNon-equilibrium thermodynamics, heat transport and thermal waves in\n\t\tlaminar and turbulent superfluid helium.  Physics Reports  726,\n\t1–71, non-equilibrium thermodynamics, heat transport and thermal waves\n\tin laminar and turbulent superfluid helium.\n\t\n\t[Nemirovskii(2013)]QT-review-2013-nemirovskii\n\tNemirovskii, S. K. 2013  Quantum turbulence: Theoretical\n\t\tand numerical problems.  Physics Reports  524,  85–202.\n\t\n\t[Nemirovskii(2020)]nemirovskii2020\n\tNemirovskii, S. K. 2020  On the closure problem of the\n\t\tcoarse-grained hydrodynamics of turbulent superfluids.  Journal of Low\n\t\tTemperature Physics  201,  254–268.\n\t\n\t[Nore et al.(1997)Nore, Abid & Brachet]Nore97a\n\tNore, C., Abid, M. & Brachet, M. E. 1997\n\tDecaying Kolmogorov turbulence in a model of superflow.  Physics\n\t\tof Fluids  9 (9),  2644–2669.\n\t\n\t[Roberts & Donnelly(1974)]Roberts_1974\n\tRoberts, P. H. & Donnelly, R. J. 1974  Superfluid\n\t\tmechanics.  Annual Review of Fluid Mechanics  6 (1),\n\t179–225.\n\t\n\t[Roche et al.(2009)Roche, Barenghi &\n\tLévêque]Roche_etal_2009\n\tRoche, P.-E., Barenghi, C. F. & Lévêque, E. 2009\n\tQuantum turbulence at finite temperature: the two-fluids cascade.\n\tEuropean Phys. Lett.  87,  54006.\n\t\n\t[Roche et al.(2007)Roche, Diribarne, Didelot, Français,\n\tRousseau & Willaime]Roche_2007\n\tRoche, P.-E., Diribarne, P., Didelot, T.,\n\t\tFrançais, O., Rousseau, L. & Willaime, H. 2007\n\tVortex density spectrum of quantum turbulence.  Europhysics Lett.\n\t77 (6),  66002.\n\t\n\t[Rusaouen et al.(2017)Rusaouen, Chabaud, Salort &\n\tRoche]Rusaouen_etal_2017\n\tRusaouen, E., Chabaud, B., Salort, J. & Roche, P.-E.\n\t2017  Intermittency of quantum turbulence with superfluid fractions\n\t\tfrom 0% to 96%.  Phys. of Fluids  29,  105108.\n\t\n\t[Salort et al.(2010a)Salort, Baudet,\n\tCastaing, Chabaud & Daviaud]Salort_etal_2010\n\tSalort, J., Baudet, C., Castaing, B., Chabaud, B. &\n\t\tDaviaud, F. 2010a  The rotation of liquid\n\t\tHelium II: Experiments on the propagation of second sound in uniformly\n\t\trotating Helium II.  Phys. of Fluids  22,  125102.\n\t\n\t[Salort et al.(2010b)Salort, Baudet,\n\tCastaing, Chabaud, Daviaud, Didelot, Diribarne, Dubrulle, Gagne, Gauthier,\n\tGirard, Hébral, Rousset, Thibault & Roche]Salort2010Specmeasure\n\tSalort, J., Baudet, C., Castaing, B., Chabaud, B.,\n\t\tDaviaud, F., Didelot, T., Diribarne, P., Dubrulle, B.,\n\t\tGagne, Y., Gauthier, F., Girard, A., Hébral, B.,\n\t\tRousset, B., Thibault, P. & Roche, P.-E.\n\t2010b  Turbulent velocity spectra in superfluid\n\t\tflows.  Phys. of Fluids  22 (12),  125102.\n\t\n\t[Salort et al.(2012)Salort, Chabaud, Lévêque &\n\tRoche]Salort_etal_2012\n\tSalort, J., Chabaud, B., Lévêque, E. & Roche,\n\t\t\tP.-E. 2012  Energy cascade and the four-fifths law in superfluid\n\t\tturbulence.  European Phys. Lett.  97,  34006.\n\t\n\t[Sasa et al.(2011)Sasa, Kano, Machida, Lvov, Rudenko &\n\tTsubota]Narimsa_2011\n\tSasa, N., Kano, T., Machida, M., Lvov, V.,\n\t\tRudenko, O. & Tsubota, M. 2011  Energy spectra of\n\t\tquantum turbulence: Large-scale simulation and modeling.  Phys. Rev. B\n\t84,  054525.\n\t\n\t[She & Lévêque(1994)]She_1994universal\n\tShe, Z.-S. & Lévêque, E. 1994  Universal scaling\n\t\tlaws in fully developed turbulence.  Phys. Rev. Lett.  72 (3),\n\t336.\n\t\n\t[Shi(2021)]Shi_qian_2021\n\tShi, J. 2021  Qian Jian (1939–2018) and his contribution\n\t\tto small-scale turbulence studies.  Phys. of Fluids  33 (4),\n\t041301.\n\t\n\t[Shukla & Pandit(2016)]Shukla2016\n\tShukla, V. & Pandit, R. 2016  Multiscaling in\n\t\tsuperfluid turbulence: A shell-model study.  Phys. Rev. E  94,\n\t043101.\n\t\n\t[Skrbek & Sreenivasan(2012a)]QT-review-sreeni-2012\n\tSkrbek, L. & Sreenivasan, K. R. 2012a  Developed quantum turbulence.  Phys. Fluids  24,\n\t011301(1–48).\n\t\n\t[Skrbek & Sreenivasan(2012b)]QT-book-sreeni-2012\n\tSkrbek, L. & Sreenivasan, K. R. 2012b  How similar is quantum turbulence to classical turbulence?\n\tIn Ten Chapters in Turbulence (ed. P. A. Davidson, Y. Kaneda\n\t\t\t& K. R. Sreenivasan),  p. 405.  Cambridge University Press.\n\t\n\t[Tang et al.(2017)Tang, Antonia, Djenidi, Danaila &\n\tZhou]Shunlin2017\n\tTang, S. L., Antonia, R. A., Djenidi, L., Danaila, L.\n\t\t& Zhou, Y. 2017  Finite Reynolds number effect on\n\t\tthe scaling range behavior of turbulent longitudinal velocity structure\n\t\tfunctions.  J. Fluid Mech.  820,  341–369.\n\t\n\t[Tang et al.(2018)Tang, Antonia, Djenidi, Danaila &\n\tZhou]Shunlin2018\n\tTang, S. L., Antonia, R. A., Djenidi, L., Danaila, L.\n\t\t& Zhou, Y. 2018  Reappraisal of the velocity derivative\n\t\tflatness factor in various turbulent flows.  J. Fluid Mech.\n\t847,  244–265.\n\t\n\t[Tisza(1938)]Tisza_1938\n\tTisza, L. 1938  Transport phenomena in Helium\n\t\tII.  Nature  141,  913.\n\t\n\t[Townsend(1951)]Townsend1951fine\n\tTownsend, A. A. 1951  On the fine-scale structure of\n\t\tturbulence.  Proc. R. Soc. Lond. A  208 (1095),  534–542.\n\t\n\t[Tsubota et al.(2017)Tsubota, Fujimoto &\n\tYui]QT-review-2017-tsubota-num\n\tTsubota, M., Fujimoto, K. & Yui, S. 2017\n\tNumerical studies of quantum turbulence.  J. of Low Temperature\n\t\tPhysics  188,  119–189.\n\t\n\t[Vinen & Niemela(2002)]QT-review-2002-vinen\n\tVinen, W. F. & Niemela, J. J. 2002  Quantum\n\t\tturbulence.  J. Low Temp. Phys.  128,  167–231.\n\t\n\t[Yakhot(2003)]Yakhot2003\n\tYakhot, V. 2003  Pressure–velocity correlations and\n\t\tscaling exponents in turbulence.  J. Fluid Mech.  495,\n\t135–143.\n\t\n\t[Yui et al.(2018)Yui, Tsubota &\n\tKobayashi]QT-coupling-2018-tsu\n\tYui, S., Tsubota, M. & Kobayashi, H. 2018\n\tThree-dimensional coupled dynamics of the two-fluid model in superfluid\n\t\tHe 4: deformed velocity profile of normal fluid in thermal counterflow.\n\tPhys. Rev. Lett.  120,  155301.\n\t\n\t[Zhou(2021)]zhou_turbulence_2021\n\tZhou, Y. 2021  Turbulence theories and statistical closure\n\t\tapproaches.  Physics Reports  935,  1–117.\n\t\n\n\n"}