{"entry_id": "http://arxiv.org/abs/2303.06627v1", "published": "20230312095332", "title": "Dark Matter Cosmology with Varying Viscosity: a Possible Resolution to the $ S_8 $ Tension", "authors": ["Amjad Ashoorioon", "Zahra Davari"], "primary_category": "astro-ph.CO", "categories": ["astro-ph.CO", "Astro-ph.co, hep-th and gr-qc"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    ḍ./fig/\n    \n    Ashoorioon, Davari]\n    \tAmjad Ashoorioon and Zahra Davari \n    \n    School of Physics,\tInstitute for Research in Fundamental Sciences (IPM), P.O. Box 19395-5531,  Tehran, Iran\n    \n    \n    Dark Matter Cosmology with Varying Viscosity: a\n    \tPossible Resolution to the S_8 Tension\n        [\n        \n    =======================================================================================\n    \n    \t\n    \t\n    \t\n    \tWe study varying forms of viscous dark matter and try to address the intriguing tensions of the standard model of cosmology with the recent cosmological data, including the Hubble and S_8 tensions. We note that assuming the dark matter viscosity depends on the Hubble parameter, dark matter density, or both, one can improve the statistics. Although the models tend to aggravate the Hubble tension a bit, they tend to reduce the S_8 tension, even in comparison with the constant viscosity case.\n    \t\t\n    \t\t\t\tDark Matter, Cosmological Parameters\n    \t\n    \n    § INTRODUCTION\n    \n    New observations on different scales have led us to a more comprehensive understanding of the universe's evolution based on  the standard ΛCDM model. However, due to the increasing accuracy of observational data, new issues have emerged on the large cosmic scale, for example, H_0 (the value of Hubble parameter observed today) and σ_8 (the rms fluctuation of density perturbations at 8 h^-1Mpc scale) tensions referring to disagreement between the predicted values of today’s expansion rate of the universe and matter clustering from CMB data in comparison with their locally determined quantities <cit.>.\n    \n    These issues lead to considering alternative approaches beyond the ΛCDM model such as general relativity modifications or a new description for dark energy (DE) <cit.> or different theories of dark matter (DM) <cit.>. Finding the reason for these apparent discrepancies has become the main driver of cosmological research.\n    \n    One of the main pillars and components in the standard ΛCDM model is dark matter. The existence of dark matter in our universe is undoubtedly confirmed by numerous kinds of astrophysical observations on a range of length scales from galaxy rotation curves and gravitational lensing to large scale structure (LSS) and the cosmic microwave background (CMB).\n    \n    Nevertheless, the physical nature of DM particles is unclear and an enigma after decades of research, largely because cosmic observations are only sensitive to the gravitational effects of DM rather than the properties of its particles. What we already know about DM in the ΛCDM model is that it is responsible for about 85% of the universe's matter content and is a non-luminous, dark component of matter which must be largely non-relativistic or cold, massive and collisionless. we consider it as perfect and ideal fluid <cit.>. \n    \n    There are many alternatives to cold dark matter, such as cannibal Dark Matter <cit.>, decaying dark matter <cit.>, dynamical dark matter, interacting dark matter<cit.> and, the interaction between dark energy and dark matter <cit.>. In these models, attempts have been made to address some of the tensions of the concordance model resorting to these alternatives.\n    \n    Among the various models to investigate dark matter from a thermodynamic point of view, an interesting proposal is \"an exotic fluid with bulk viscosity\".\n    In <cit.> is predicted a viscosity of the order of 10^-6 H_0 M_P^2 by the effective field theory of dark matter fluid on large scales. They claimed that this magnitude of viscosity could resolve the discordance between late time large-scale structural observations and Planck's CMB data.\n    \n    These viscosities in the cold dark matter can be engendered in two different ways. The first type of viscosity is generated due to the self interaction between the dark matter particles, and they are called \"fundamental viscosity\".\n    The second type of viscosity is known as \"effective viscosity\". This kind of viscosity is expected to be generated on large scales as the integrated effect of the back-reaction of small scales non-linearities <cit.>.\n    \n    During the 1940s and 1950s, the first theory to study bulk viscosity was developed, and called Eckart's theory <cit.>. But in the late 1960s and 1970s, it became clear that this type of approach suffered from problems of causality and stability <cit.>. Therefore, by including the second-order deviations from equilibrium, it led to the second-order or Müller-Israel-Stewart theory<cit.>. In addition to introducing a new parameter called relaxation time, the second order theory is a more complicated theory than the first order one. Therefore, the first-order theory has received more attention. We will also develop this work using the Eckart framework.\n    \n    In this paper, we investigate the dynamics of the universe and linear structure formation using Λ viscous dark matter model. Contrary to <cit.>, we assume that the viscosity parameter is not constant and depends on the dark matter energy density or Hubble parameter, or both these quantities. We notice that assuming such dependences, the total χ^2 gets reduced. Also except for when the viscosity is function of both the Hubble parameter and dark matter energy density, we can alleviate the σ_8 tension better. \n    \n    This paper is structured as follows: in section <ref>, first introduce the theory of this model and derive the main equations governing the evolution at background (subsection <ref>) and perturbation (subsection <ref>)  levels  for different scenarios. Then we review the key features of the background evolution of the universe.\n    We modify the public Boltzmann solver [<https://github.com/lesgourg/class_public>](the Cosmic Linear Anisotropy Solving\n    System) <cit.> for each type of dissipative mechanisms to the dark matter to calculate the\n    cosmological evolution and CMB anisotropies.\n    In section <ref>, we perform the Markov chain Monte Carlo (MCMC) scans by [<https://github.com/baudren/montepython_public>] <cit.> with a Metropolis-Hasting algorithm using the Planck 2018 TTTEEE+lowl+lowP+lensing data sets <cit.> in combination with other probes such as the Baryon acoustic oscillations, BAO (SDSS\n    DR7, BOSS DR12 <cit.>, eBOSS Ly-α combined correlations), the Pantheon SNIa catalog <cit.> and the cosmic chronometers (CC) data <cit.>. We review the basic properties and the cosmological effects of viscous dark matter models for the best value of free parameters in Section <ref>. According to the results obtained in Section <ref>, we will discuss cosmic tensions and finally conclude in Section <ref>.\n    \n    \n    \n    § PHENOMENOLOGY OF VISCOUS  DARK MATTER  MODEL\n    \n    \n     §.§ Background level\n    \n    In the beginning, we recall the phenomenology of the viscous dark matter models and investigate the effects of viscosity of DM on the solution of Einstein’s equation. In the framework of general relativity, we consider that our flat, homogeneous and isotropic universe  including radiation, baryons, the viscous dark matter as non-perfect fluid, and dark energy as cosmological constant (Λ)  is described by FLRW metric\n    \n    \n        ds^2=-dt^2+a^2(t)(dr^2+r^2dθ^2+r^2sin^2θ dϕ^2),\n    \n    where a(t) is the scale factor at the cosmic time t.\n    \n    We write the energy momentum tensor for non-ideal CDM fluid in the Landau frame, as\n    \n    \n        T_μν=T̃_μν+Δ T_μν,\n    \n    where T̃_μν is the energy–momentum tensor of a perfect fluid, i.e.\n    \n    \n        T̃^μν=(ρ+p)u^μ u^ν+pg^μν.\n    \n    Here ρ is the energy density and p the pressure in the fluid rest frame and Δ T_μν in\n    the first order gradient expansion is a tiny perturbation that corresponds to all dissipative processes (heat flux, anisotropic-stress, and bulk viscosity) <cit.> as\n    \n    \n        Δ T_μν=Π_B(u^μ u^ν+g^μν)+Π^μν,\n    \n    where Π_B and Π^μν represent bulk stress and\n    shear stress tensor respectively defined as\n    \n    \n    \n    \n    \n    \n    \n    \n        Π_B=-ξ u_;γ^γ, \n        \n              Π^μν=2ησ^μν=\n              -2η[1/2(Δ^μαΔ^νβ+Δ^μβΔ^να)-1/3Δ^μνΔ^αβ]▽_αu_β,\n    \n    where η and ξ represent shear and bulk viscosity. As shear viscosity is a directional process, the cosmological principle precludes its existence in the FLRW metric. Hence, only bulk viscosity is a unique process that is allowed to occur in an expansive, homogeneous, and isotropic background.\n    \n    Hence, let us examine the expressions <ref> in more detail\n    \n        u^γ_;γ=1/√(-g)∂_γ(√(-g)u^γ)=1/√(-g)∂_γ(√(-g))u^γ+∂_γ u^γ,\n    \n    where \n        √(-g)=r^2 sin^2θ a^3(t),\n     and\n    \n        (∂_γ(√(-g))u^γ=(∂_0√(-g))u^0=3r^2 sin^2θ a^2(t)ȧ(t).\n    \n    So that \n        1/√(-g)∂_0(√(-g))=3ȧ(t)/a(t)=3H,\n    \n    means\n    that bulk viscosity modifies the effective pressure as p_ eff=p-3Hξ which consists of a sum of two terms, equilibrium pressure p and bulk viscosity pressure, -3Hξ.\n    \n    Choosing a reference frame in which the hydrodynamics four-velocity u_μ is unitary, we can write Equation <ref> for imperfect viscous dark matter fluid as\n    \n    \n        T̃^μν=(ρ+p_ eff)u^μ u^ν+p_ effg^μν.\n    \n    From the conservation of energy, ▽_μ T^μ_ν=0,\n    assuming that no interactions take place among the cosmic fluid components the continuity\n    equations take the form,\n    \n    \n    \n    \n    \n    \n        ρ̇_r+4Hρ_r=0 ⟹ρ_r=ρ_r0 a^-4,\n              ρ̇_b+3Hρ_b=0⟹ρ_b=ρ_b0 a^-3,\n              ρ̇_ vdm+3H(ρ_ vdm-3Hξ)=0,\n              ρ̇_Λ=0       ⟹ρ_Λ=ρ_Λ 0.\n    \n    The dynamics\n    of the Universe containing these components is given by the Friedmann equation:\n    \n    \n        H^2=(ȧ/a)^2=8π G/3(ρ_r+ρ_b+ρ_ vdm+ρ_Λ).\n    \n    Using the definition of the dimensionless energy density\n    parameter Ω_i,0=ρ_i,0/ρ_ cr,0 , where ρ_ cr,0=3H_0^2/(8π G) is the current critical\n    energy density at a=1, the  Hubble parameter takes the following form:\n    \n    \n        H^2=H_0^2(Ω_ r0a^-4+Ω_ b0a^-3+y(a)+Ω_Λ),\n    \n    where we define y(a)=ρ_ vdm/ρ_ cr,0 and set the present density parameter of radiation (photon+relativistic neutrinos) as\n    \n    Ω_r0=Ω_γ0(1 + 0.2271 N_ eff). Here, we put the effective extra relativistic degrees of freedom  3.046 in agreement with the standard model prediction <cit.>.\n    \n    Applying the Friedman equation, which takes the form of\n    Σ_iΩ_i=1, we can write Ω_Λ=1-Ω_ r0-Ω_ b0+y(1).\n    \n    Equation <ref> can be rewritten in terms of the scale factor (d/dt=aHd/da) and the definition y(a) as follows,\n    \n        ady(a)/da+3y(a)-ξ̃/H_0√(Ω_ r0a^-4+Ω_ b0a^-3+y(a)+Ω_Λ)=0,\n    \n    where we have defined the dimensionless parameter ξ̃=24π Gξ.\n    \n    Equation <ref> can be solved numerically by fixing the value y(a=1)=Ω_ dm,0.  However, we implement the continuity equation <ref> in  of the public Boltzmann solver  and use\n    the shooting method described in <cit.> to compute the  present-day dark matter density.\n    \n    In the rest of the study, we consider four different functional forms of the bulk viscosity coefficient, ξ(ρ_ vdm,H,ρ_ vdmH):\n    \n      i- Designated as (M1), we consider ξ as constant. This is the model considered by <cit.>.\n    \t\n      ii- For the second model (M2), where we assume ξ to be proportional to powers of the energy density of viscous DM, ξ(ρ_ vdm/ρ_ vdm,0)^n and we would obtain the equation <ref> as\n    \t\n        ady(a)/da+3y(a)-ξ̃/H_0√(Ω_ r0a^-4+Ω_ b0a^-3+y(a)+Ω_Λ)\n              ( y(a)/Ω_vdm,0)^n=0.\n    \n        ady(a)/da+3y(a)-ξ̃/H_0√(Ω_ r0a^-4+Ω_ b0a^-3+y(a)+Ω_Λ)\n              ( y(a)/Ω_vdm,0)^n=0.\n    \n      iii- For the third model (M3), we consider ξ to be proportional to powers of the Hubble parameter, ξ(H/H_0)^m and the equation <ref> is given as\n    \t\n        ady(a)/da+3y(a)-ξ̃/H_0(H/H_0)^m+1=0.\n    \n      iv- For the fourth model (M4), coefficient is proportional to ξ(ρ_ vdm/ρ_ vdm,0)^n(H/H_0)^m, and the equation <ref> is given as\n    \t\n        ady(a)/da+3y(a)-ξ̃/H_0(y(a)/Ω_ vdm,0)^n(H/H_0)^m+1=0.\n    \t\n    The values assumed for  free parameter, ξ in all of the mentioned models are positive for thermodynamical reasons. The standard cold dark matter model is recovered in the limit ξ̃→ 0 for all models.\n    \n    \n     §.§ Perturbation Level\n    \n    In this subsection, we briefly survey the main mathematical form of the linear perturbation theory within the framework of viscous matter dark cosmologies.\n    We consider the density and pressure in terms of spatially homogeneous and isotropic background fields with small spatially varying perturbations: ρ(x,t)=ρ̅(t)+δρ(x,t)p(x,t)=p̅(t)+δ p(x,t). \n    We assume  perturbations in the variables δρ,δ p≪ρ̅, p̅ up to linear order, and we focus on scalar perturbations only. We use the normalized density contrast δ≡δρ/ρ̅ to expand the fluid dynamic equations in dimensionless measures of these perturbations and the velocity divergence θ≡∇⃗·v⃗.\n    \n    Note pressure and its perturbation are not independent quantity and they are related to density as:\n    \n    \n        w=p/ρ,     c^2_s=δ p/δρ,      c^2_ad=ṗ/ρ̇,\n    \n    where w, c_s^2 and c_ad^2 are the dynamical equation of state, the speed of sound in the medium and the adiabatic sound speed of the viscous DM respectively. Since cold DM is a pressureless ideal fluid, w = c^2_s = c^2_ ad = 0. The dynamical equations which govern the evolution of cosmological perturbations in Fourier space can be written in Synchronous gauge as\n    \n    \n        δ̇=-3H(c_s^2-w)δ-(1+w)(θ+ḣ/2),\n              θ̇=-H(1-3c_ad^2)θ+c_s^2/1+wk^2δ-k^2σ,\n    \n    and in the Conformal Newtonian gauge as\n    \n        δ̇=-3H(c_s^2-w)δ-(1+w)(θ-3ϕ̇),\n              θ̇=-H(1-3c_ad^2)θ+c_s^2/1+wk^2δ-k^2σ+k^2 ψ.\n    \n    One can then calculate w=-3ξ̃(ρ_ vdm,H,ρ_ vdmH)H/ρ and c^2_s=ξ̃(ρ_ vdm,H,ρ_ vdmH)θ/aρδ <cit.>. In <cit.>, it is assumed that c^2_ad is scale-independent and approximately equal to c^2_s, assumptions that we take to be valid in the current study.\n    For the evolution of shear stress, we have implemented Non-Cold Dark Matter Fluid Approximation (NCDMFA) in  as\n    \n    \n        σ̇=-3[1/τ+H(2/3-c^2_ad)]σ+4/3c^2_ vis/1+w(2θ+ḣ).\n    \n     c^2_ vis is a new parameter named viscosity speed and in implemenation of  is assumed as c^2_ vis=3wc^2_ad <cit.>.\n    \n    \n    We implement the perturbation equations <ref>- <ref> in module  of Boltzmann code \n    \n    \n    § MCMC ANALYSIS\n    \n    In this section, we present constraints on four viscous dark matter models that we discussed in the previous section. For MCMC analysis we use the Metropolis-Hastings algorithm  of the cosmological sampling package , connected to an altered version of the Boltzmann Solver .\n    We use the following datasets to perform the statistical inference:\n    \n      *  CMB:  One of the most important observables in\n    \tcosmology due to its well-understood linear physics and sensibility to cosmological parameters is the CMB. Here, we use Planck 2018 CMB temperature and polarization auto- and cross-correlation, both high-l and low-l and with the full set of nuisance parameters, as well as Planck 2018 CMB lensing in the multipole range 40 ≤l≤ 400<cit.>.\n    \t\n      *   BAO: Another important data for present and\n    \tfuture cosmology is the BAO thanks again to its well-understood linear physics. We use the BAO measurements from  the Baryon Oscillation Spectroscopic Survey Data Release 12 (BOSS DR12) <cit.>, eBOSS DR14-Ly-α combined correlations <cit.> and, WiggleZ <cit.>.\n    \t\n      *  SNe Ia: The Pantheon Super Novae (SN) sample consists magnitude measurements for 1048 SNe Ia with redshifts 0.01 < z < 2.3 <cit.>. Some recent studies have shown that H_0 tension depends directly on the SN Ia absolute magnitude, M_B <cit.>. Therefor here, we consider  the M_B as a nuisance parameter in our numerical analysis.\n    \t\n      *  Cosmic Chronometers (CC): The CC approach is\n    \tvery powerful in detecting the expansion history of the\n    \tUniverse obtained through the measurements of\n    \tthe Hubble parameter.\n    \tWe use the H(z) data points from the most recent, accurate estimates and  model-independent data in the redshift range 0.07≤ z ≤ 1.965 based on the relative age of passively evolving galaxies (the differential-age technique). These data are uncorrelated with the BAO data points <cit.>.\n    \n     We employ the χ^2 statistics to constrain our theoretical model,\n     \n        χ^2=(P_ obs-P_ th)^2/σ_P^2.\n    \n    Above P_ obs, P_ th and σ_P^2 indicate the observed value, the\n    predicted value and the standard deviation, respectively.\n    The total likelihood is given by:\n    \n        χ^2_ min≡-2lnL=χ^2_ CMB+χ^2_ BAO+χ^2_ SNIa+χ^2_ CC.\n    \n    Here, in addition to the six free parameters of the standard minimum model, i.e. (Ω_b,Ω_DM,10θ_ MC,ln 10^10A_s,n_s,τ_ reio), the viscous dark matter models introduced in the previous section include at most (ξ, n, m) in the M4 model. Model M1 has one parameter and models M2 and M3 has two parameters. The convergence of chains for each parameter is measured by the Gelman-Rubin criterion and one can obtain acceptable R-1 values (i.e. below 0.01 for every parameter) with an iterative strategy <cit.>. In Table <ref>, we report the best and the mean values and 68%CL intervals for main parameters including the total matter density\n    parameter (Ω_m=Ω_B+Ω_DM), the present-day\n    expansion rate of the Universe or the Hubble constant, H_0 and S_8=σ_8√(Ω_m/0.3) in different scenarios. We also show posterior distributions (1σ and 2σ intervals) as dark and light shaded contours, respectively in Figure <ref>. Some points in the Figure <ref> need to be stressed. First, we can see that the decrease of H_0 values is associated with the increase of Ω_m values and vice versa in both viscous and cold dark matter scenarios but the behavior of  Ω_m-S_8 and H_0-S_8 in two scenarios are different. Second, it seems that assuming viscosity improves the S_8 tension for the viscous dark matter scenario. We will discuss this further in  section <ref>.\n    \n    Next, to check whether the fit is good or not, and also to choose the best and most compatible model with the observational data, we use the simplest method that is usually used in cosmology, which is called the least squares method, χ^2_ min. In this case, the model with smaller χ^2_ min is taken to be a better fit to the data <cit.>. Comparing different viscous models, we note that models M2, M3 and M4 do better than CDM and even M1 scenario where the viscosity parameter was assumed to be constant. The difference between χ^2_ min of the M4 model and the CDM model is 4.47. However one should keep in mind that the model with the lowest χ^2_ min is not necessarily the best model because\n    \n    since adding more flexibility with extra parameters will normally lead to a lower χ^2.\n    That means that a poorly parameterized model should be penalized. In this work, M1 model has one parameter, M2 and M3 have two parameters and M4 has three parameters more than CDM scenario.  In order to deal with model selection a standard approach is to compute the Akaike Information Criterion (AIC),\n    \n    \n        AIC=χ^2_ min+2M+2M(M+1)/N-M+1.\n    \n    Above M is the number of free parameters in the model and N is the number of data points. Therefore in this criterion, we reduce the practical influence of M in χ^2_ min in favor of a model with a lower free parameter. Since N≥ M then we neglect the third term in Equation <ref>. We report the result of MCMC analysis for the best-fit χ^2 per observational data set and compare the viscous DM models to the reference CDM model in Table <ref>.  The results of this analysis can be interpreted with the Jeffreys' scale as follows: there is substantial support for all viscous DM models (|Δ AIC|<2) and an indication of the consistency of the two scenarios. Among the viscous DM models, the M3 scenario outperforms others.\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    § OBSERVTIONAL EFFECTS OF VISCOUS DM MODELS\n    \n    \n     §.§ Background level\n    \n    \n    To gain better insight into different models of viscous DM and compare it with the cold DM model, we will examine the evolution of the main cosmological quantities for the parameter values of Table <ref> below.\n    As we know one of the key cosmological parameters and a pivotal quantity in cosmology is the current value of the Hubble parameter since it is used to construct\n    the most basic time and distance cosmological scales. On other hand, because of the impact of Hubble's expansion the growth of matter perturbations, it is important to understand the behavior of H(z) in various viscous DM cosmologies. Therefore, we plot the evolution of H(z) and H(z)/(1+z) in Figures <ref> and <ref>. We present in the bottom panel of\n    Figure <ref>, the relative difference Δ H(z)= 100×[H_ Mi-H_ CDM/H_ CDM] of the\n    Hubble parameters  with respect to the CDM. As we see the quantity Δ H(z) is positive (negative) for large (small)\n    redshifts in all scenarios. But it should be noted that this difference is less for models M3 and M4 and which means that the corresponding cosmic expansion is smaller than that of the concordance CDM.\n    \n    We have plotted the evolution of the fractional energy densities of viscous dark matter in Figure <ref>. As we expect all viscous DM models mimic the CDM scenario and the universe evolves from a radiation-dominated phase to a matter-dominated epoch the density parameter of the dark matter decreases and the density parameter of dark energy has increased in the recent universe. Given to reported values in Table  <ref>, the density ratio Ω_DM/Ω_B for M3 and M4 models are ≃ 6 larger than CDM model (≃ 5).\n    \n    The last quantity that we plotted in this section is the equation of state parameter for viscous DM, w = P/ρ=-3 ξ̃(ρ_ vdm,H,ρ_ vdmH)H/ρ. As we see in Figure <ref>, in the past (when a→ 0), the viscous DM models behave like CDM (w→ 0), and currently, the value for w is negative for all models. The most negative w are respectively for the M4, M3, M1 and M2 models.\n    \n    \n    \n    \n     §.§ Perturbation Level\n    \n    In this subsection, we turn to the perturbation spectra. To draw the plots we have\n    used the best-fit values of the model parameters obtained\n    from all the observational datasets that we have used in\n    this work. First, we display the power spectra of the anisotropies in the CMB temperature, calculated for viscous DM models along with that for CDM in Figure <ref>.\n     As we can see in the lower multipoles (for l<50), there is a relative deviation of Δ D_l^ TT between the viscous DM models and CDM scenario. while for higher multipoles (for l > 50), we do not observe any significant differences in the curves.\n    \n    We can explain by noting that the CMB temperature is determined only by the energy density component of the energy-momentum tensor, T_00, whereas the density perturbations also depend upon the diagonal elements, T_ ii, which include the pressure. Since the viscous DM scenarios own pressure, this causes a difference between the viscous DM models and CDM. \n     Hence, as the evolution of density perturbations unfolds, small-scale structures are clearly suppressed in viscous DM compared to CDM, which can be seen in the Figure <ref>. The amount of suppression is larger at smaller k's. Respectively, models M3, M4, M1 and M2 suppress the nonlinear matter power spectrum. \t\t\t\t\t\t\t\n    \n     As we can see in Figures <ref> and  <ref>, the position of the acoustic peaks has not shifted therefore the viscous dark matter has not had much effect\n     \n    on the background expansion.\n     We also see a difference between models in the top plane of  the Figure <ref> for low l. This is due  \n     integrated Sachs-Wolfe (ISW) effect at such scales.\n     \n      Also the small l's of  CMB (TT and even better EE) give information on the reionization history. By using the best-fit values of free parameters, shown in Tables <ref>, we obtain the redshift of the reionization 7.69, 6.99, 8.42 and 8.65, respectfully for models M1, M2, M3 and M4. M2 and M4 have the biggest differences with the standard model (z_ reio,CDM=7.78).\n      \n      The present galaxy surveys provide powerful observational data for the combination fσ_8(z), where f is the linear growth rate of the density contrast, which is related to the\n    peculiar velocity in the linear theory, being defined by f(a)=a δ'(a)/δ(a) and σ_8(a)=σ_8(a=1)δ(a)/δ(a=1) is the root-mean-square mass fluctuation in spheres with the radius 8h^-1 Mpc. Here, we calculate the total density contrast of the matter (baryons + dark matter) as\n    \n        δ(a)=δ_b ρ_b+δ_ dmρ_ dm/ρ_b+ρ_ dm.\n    \n    \n    The linear growth rate, f, is an excellent tool\n    for distinguishing between various dark matter theories\n    based on the growth of large-scale structures.\n    In Figure <ref> we show the linear\n    growth factor f(a) for the different viscous DM and standard models studied in this work for the best-fit values for modes k=10^-4Mpc^-1 (the galaxy cluster scale) and k=1Mpc^-1. Since the linear growth rate is independent of the wave number k at the large scale factors (the low redshift regime), we see that for a→ 1, two modes behave similarly.  The bottom panel shows that for small-scale factors the growth function goes to unity, which corresponds to the\n    matter-dominated Universe and the amplitude of matter perturbations decreases at low redshifts in all scenarios with the dominance of dark energy. We observe that the suppression of the amplitude of matter fluctuations in M3 and M4 models that are proportional to the Hubble parameter starts sooner compared with other scenarios.\n    The change in σ_8 in the viscous DM scenarios can be seen as the relative decrease in P(k) in the Figure <ref> (although σ_8 is computed from the linear rather than non-linear power spectrum), thus improving the tension between these CMB-derived predictions and the actual LSS data. Looking at Figure <ref>, we notice that considering viscosity has the influence of slowing down the evolution rate of the dark matter perturbations. This means that structures cluster slower in the viscous dark matter models as we predicted from Figure <ref>. In particular scenario M4 and M3 suppress the power spectrum more in comparison with the CDM scenario.\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    § LARGE-SCALE COSMIC TENSIONS\n    \n    In this section, we reported the obtained results for the H_0 and S_8 tensions.\n    \n    \n     §.§ H_0 Tension\n    \n    \n    The Hubble tension is one of the most lingering tensions in the cosmology. This tension emerged\n    with the first release of Planck results and has grown in significance in the past few years. The last value of H_0 tension is obtained from the most recent analysis of Planck 2018 for the early-universe observation H_0 = 67.44±0.58 kms^-1Mpc^-1 for the ΛCDM model <cit.>. While the late-universe observation of Cepheid-calibrated SNe Ia distance ladder by SH0ES team gives the result of H_0 = 74.03±1.42 kms^-1Mpc^-1 <cit.>.\n    The big discrepancy between the two H_0 values  reaches ∼4σ <cit.>.\n    \n    One of the initial motivations of this work was to investigate this tension manipulating the properties of one of the main components of the universe, i.e. dark matter.\n    As the results of  Table <ref> and Figure <ref> demonstrate none of the models of viscous dark matter diminishes the H_0 tension.\n    On the other hand, H_0 tension is equivalent to the mismatch of the Pantheon SnIa absolute magnitudes, which when calibrated using the CMB sound horizon and propagated via BAO measurements to low z have a value M_B=-19.401 ± 0.027 mag <cit.>, while when calibrated using the Cepheid stars have a value M_B=-19.244 ± 0.037 <cit.>. In this study, for all of the models, absolute magnitudes obtained is ∼ -19.41 consistent with CMB observations. Therefore none of these models really help us in addressing the H_0 tension.\n    \n    \n    \n     §.§ S_8 Tension\n    \n    \n    Cosmic structures were formed based on primordial density fluctuations that emerged from the inflation era due to gravitational instability.\n    By studying the large-scale structure of the Universe and its evolution in cosmic epochs, it is possible to trace the growth of cosmic perturbations. The main difference between the standard model and other dissipative approaches lies in the behavior of the cosmological perturbations. While perturbations in standard cosmology are always adiabatic, dissipative models of the dark sector are intrinsically non-adiabatic. Associated with this observable, one of the current cosmological tensions is the growth tension. It has come about as the result of the discrepancy between the Planck value of the cosmological parameters Ω_m and σ_8 from weak gravitational lensing surveys, cluster counts, and redshift space distortion data. Since these two parameters have degenerate effects in the lensing surveys, usually S_8=σ_8√(Ω_m/0.3) (Weighted amplitude of matter fluctuations) is used as a parameter to compare the consistency with other observations.\n     Measurements of the\n    CMB temperature and polarization anisotropies by Planck yield S_8 = 0.834±0.016. On the other hand, weak gravitational lensing surveys provide constraints\n    via cosmic shear, e.g. S_8 = 0.759^+0.024_\n    -0.021 from the Kilo-Degree Survey (KiDS-1000) <cit.> and\n    S_8 = 0.780^+0.030_-0.033 from Hyper Suprime-Cam (HSC) <cit.>. The combination of shear and galaxy clustering from three-year data of DES yields S_8 = 0.776^+0.017_-0.017 and a combination of shear, clustering and galaxy\n    abundance from KiDS-1000 S_8 = 0.773^+0.028_\n    -0.030, while galaxy cluster counts from SPT-SZ\n    report S_8 = 0.766 ±0.025 and eROSITA results favour S_8 = 0.791^+0.028_-0.031.\n    We adopt the following estimator in order to quantify the discordance or tension in current determinations\n    \n    \n        T_S_8=|S_8^i-S_8|/√(σ^2_i+σ^2).\n    \n    Considering the reported value of the Kilo-Degree Survey KiDS-1000 as observational data, as we see in Table <ref>, all models of viscous dark matter are able to decrease this tension. More than any of the viscous models, M2 can reduce the tension between  Planck and KiDs-1000 data.\n    \n    \n    \n    \n    \n    § DISCUSSION AND CONCLUSION\n    \n    With the aim of finding a model more compatible with the universe and reducing the current controversial tensions in cosmology, this study questioned one of the properties of dark matter in the Standard Model of cosmology. We include a physical dissipation mechanism in the description of dark matter such as viscosity. In addition to the constant bulk viscosity case which was studied previously by <cit.>, we assessed the cases in which the bulk viscosity has the dependence on ρ_vdm, Hubble parameter, or both. We noticed that with such dependences of viscosity, the χ^2 for the cosmological datasets is reduced by roughly ∼4. Noting that we have added more parameters we computed the AIC criterion for these models and notice that for all of them |Δ AIC|<2. The least value for this parameter is obtained for the M3 model, |Δ AIC|≃0.22, where the bulk viscosity is assumed to be proportional to the powers of the Hubble parameter.   Our results in Tables <ref> and Figure <ref> show that the assumption of viscous dark matter can only reduce one of these tensions, namely the  S_8. In order to relax the observed tensions H_0 and S_8 simultaneously, perhaps in addition to viscous dark matter, the presence of relativistic components or early dark energy, should also be considered.\n    \n    \n    § ACKNOWLEDGMENTS\n    \n    This work is supported by Iran Science Elites Federation Grant No M401543.\n    \n    \n    mnras\n"}