{"entry_id": "http://arxiv.org/abs/2303.07383v1", "published": "20230313180152", "title": "Phylogenomic Models from Tree Symmetries", "authors": ["Elizabeth A. Allman", "Colby Long", "John A. Rhodes"], "primary_category": "q-bio.PE", "categories": ["q-bio.PE", "92B10, 92D15, 62R01"], "text": "\n\n \n\n\n\nPhylogenomic Models from Tree Symmetries\n    Elizabeth S. Allman, Colby Long, and John A. Rhodes\n    March 30, 2023\n=======================================================\n\n\n\nA model of  genomic sequence evolution on a species tree should include\nnot only a sequence substitution process, but also a coalescent process,\nsince different sites may evolve on different gene trees due to\nincomplete lineage sorting. Chifman and Kubatko initiated the study of\nsuch models, leading to the development of the SVDquartets methods of\nspecies tree inference. A key observation was that symmetries in an\nultrametric species tree led to symmetries in the joint distribution of\nbases at the taxa. In this work, we explore the implications of such\nsymmetry more fully, defining new models incorporating only the\nsymmetries of this distribution, regardless of the mechanism that might\nhave produced them. The models are thus supermodels of many standard\nones with mechanistic parameterizations. We study phylogenetic\ninvariants for the models, and establish identifiability of species tree\ntopologies using them. \n\n\n\nFunding: ESA and JAR were partially supported by NSF grant 2051760 and NIH grant P20GM103395. \n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe SVDquartets method of Chifman and Kubatko <cit.> initiated a novel framework for species tree inference from genomic-scale data. \nRecognizing that individual sites may evolve along different “gene trees\" due to the population-genetic effect of incomplete lineage sorting, \ntheir method is designed to work with site pattern data generated by the multispecies coalescent model of this process combined with a standard model of site-substitution. \nHowever, rather than try to associate particular gene trees to sites,\nthey regard the observed site pattern distribution as a coalescent mixture.\nThis effectively integrates the individual gene trees out of the analysis\nand allows them to formulate statistical tests based on an algebraic understanding of the site pattern frequencies.\nThese tests detect the unrooted species tree topology in the case of four taxa. \nFor a larger set of taxa, species trees can be found by inferring each quartet and then applying some \nmethod of quartet amalgamation. This leads to their SVDquartets method of species tree inference, which is implemented in PAUP* <cit.> and which continues to be an important tool for practical phylogenetic inference (e.g., <cit.>).\n\nThe inference of unrooted 4-taxon species tree topologies in the SVDquartets approach is based on \nan algebraic insight that a certain flattening matrix built from  the site pattern distribution should have low rank on a \ndistribution exactly arising from the model. The mathematical arguments for this in <cit.> are based on the existence of a rooted cherry (i.e., a 2-clade) on an  \nultrametric species tree, leading to a symmetry in the site pattern distribution. Since any rooted 4-taxon tree with unrooted \ntopology ab|cd must display at least one of the clades {a,b} or {c,d}, detecting that one or both of these clades\n is present is equivalent to determining the unrooted tree. \n The SVDquartets method tests precisely this, without determining which of the clades is present.\n\n\n\nIn this work, we examine the algebraic framework underlying the work of Chifman and Kubatko and its subsequent extensions. \nWe observe that the symmetry conditions implied by the  Chifman-Kubatko model are key to their inference approach. \nBased on this observation, we formulate several statistical models, \nencompassing those of <cit.> as well as several more general mechanistic models, which capture the fundamental assumptions needed to justify SVDquartets.\nIn contrast with the sorts of models generally used in empirical phylogenetics, \nwhich have a mechanistic interpretation\n(e.g., generation of gene trees by the coalescent process, generation of sequences by \nsite-substitution models on the gene trees), the models here have only a descriptive interpretation, as they are defined algebraically by constraints on site pattern distributions. \n\nOne consequence of defining our models in this way is that it becomes more clear that \nSVDquartets can give consistent species tree inference for mechanistic mixture models more general than that described in <cit.> (as hinted by results in <cit.>). \nIn fact, it is easy to formulate plausible mechanistic models with many parameters \n(e.g. mixtures with many different base substitution processes) for which many of the numerical parameters must be non-identifiable, but for which SVDquartets inference of the species tree topology is statistically \nconsistent. \nSuch generality can be viewed as a strength of SVDquartets, as model misspecification arising from assumption of a simple substitution process across the entire genome is avoided.\n\n\nA second consequence is that our models highlight a symmetry in the site pattern distribution that reflects the rooted \nspecies tree, a symmetry that is present even for 3-taxon trees.\nMethods for inference of the species tree root in the same framework were proposed \nin <cit.>, but both of these works considered four taxa at a time, which is the smallest unrooted tree size in which topologies may differ.\nSince rooted trees are determined by their rooted triples, focusing on the 3-taxon \ncase offers clear advantages for developing new inference methods. Unfortunately, \nin doing so, we lose the ability to naturally base statistical inference on rank conditions on \nmatrices of the sort that underlie SVDquartets. \nIndeed, the possible flattening matrices for DNA site pattern data from the \nChifman-Kubatko model in the 3-taxon case are all 4× 16 with full rank, so rank alone cannot distinguish them. \nAs a consequence, the matrix Singular Value Decomposition (SVD) of the flattening matrix, which is used to determine approximate rank in the \nSVDquartets method, has no obvious role. However, we present an alternative matrix that must satisfy certain rank conditions\nin the 3-taxon case, which suggests it may be possible to develop a 3-taxon method analagous to SVDquartets. \n \n\n\nOur work here is theoretical, dealing primarily with model definitions and algebraic consequences of those models. \nWe suggest its implications for data analysis, but do not explore \npossible methods based on these results in depth.\nWe begin the next section with a \nreview of the model of\n<cit.> and use it to motivate the introduction of our first model, the ultrametric exchangeable model. \nWe then discuss  a \nnumber of its submodels on ultrametric trees, and \nshow in Section <ref> that the species tree parameter of these models is\ngenerically identifiable and species tree inference by SVDquartets is justified for all. \nIn Section <ref>, we give a recursive formula for computing the dimension \nof the ultrametric exchangeable model, in terms \nof the dimensions of its subtree models joined at the root. \nThis indicates that the dimension depends on the topology of the tree, \nwhich has implications for inference methods. \nIn Section <ref>, we drop the assumption of an ultrametric species tree, \nreviewing the model of <cit.> in this setting\nand using it  to motivate our second model, the extended exchangeable model. In Section <ref>, we explore the extended exchangeable model in\nmore depth by restricting to 3-taxon trees and determining several algebraic invariants\nof this model. Finally, in Section <ref>, we show that\nthe species tree parameter of the extended exchangeable model, as well as \nthose of several mechanistic models that it contains, are generically identifiable.\n\n\n\n\n\n§ A GENOMIC MODEL OF SITE PATTERNS ON ULTRAMETRIC TREES\n\n\nWe begin by reviewing the simplest mechanistic model of Chifman and Kubatko <cit.>.   For emphasis, we call this model\n(and others) mechanistic since it incorporates models of both incomplete lineage sorting and of site substitution (e.g., GTR) in its formulation.\nMany mechanistic models, \nincluding that of <cit.>, will be included as submodels of the more general non-mechanistic models\nwe define below and for which the theory underlying SVDquartets applies more broadly.\n\nSpecifically, let σ^+=(ψ^+,λ) be an ultrametric rooted species tree on a set of taxa X, with rooted leaf-labelled topology ψ^+ \nand edge lengths λ in number of generations. Let N be a single constant population size for all populations (i.e., edges) \nin the species tree, and μ a single scalar mutation rate for all populations. For a DNA substitution model fix some GTR rate \nmatrix Q with associated stable base distribution π. \n\nThese parameters determine a DNA site pattern distribution as follows: a site is first assigned a leaf-labelled ultrametric gene tree T sampled \nunder the multispecies coalescent model on σ^+ with populations size N, with one gene lineage sampled per taxon. Then a site \nevolves on T according to the base substitution model with root distribution π and rate matrix μ Q. Site patterns thus have a distribution \nwhich is a coalescent independent mixture of site pattern distributions arising from the same GTR model on individual gene trees. We denote \nthis model by CK=CK(σ^+,N,μ,Q,π). \n(While  has a mild non-identifiability issue in that λ, N,  and μ \nare not separately identifiable, this will not \nbe of concern in this work since our focus is on inferring the topology ψ^+.)\n\n\n\n\nA key feature of the  model is an exchangeability property that it inherits from the multispecies coalescent, due to the nature of the substitution model. \nSpecifically, suppose {a,b}⊆ X is a  2-clade displayed on σ^+. Then for any metric gene tree T, let T' be the gene tree obtained \nfrom T by switching the labels a and b. Then the ultrametricity of  σ^+ together with exchangeability of lineages under the coalescent \nmodel implies T and T' are equiprobable. Now consider any site pattern z=(z_1,z_2,…, z_n) for X, where z_i∈{A,G,C,T} is the base \nfor taxon x_i∈ X, and let z' be the site pattern with the a and b entries interchanged. Then under the base substitution model the \nprobability of z on T equals the probability of z' on T'.\nThus, with 𝒯 denoting the space of all metric gene trees T on X,\n\n    (z |σ^+,N,μ,Q,π)   =∫_𝒯(z| T,μ,Q,π) (T|σ^+,N) dT\n       =∫_𝒯(z'| T',μ,Q,π) (T'|σ^+,N) dT'\n       =(z' |σ^+,N,μ,Q,π).\n\n\nThus any 2-clade  on the species tree produces symmetry in the site pattern frequency distribution. \nMoreover, since both the multispecies coalescent model and the sequence substitution model are well behaved with respect to \nmarginalizing over taxa, it immediately follows that 2-clades on the induced subtrees σ^+|_Y on subsets Y⊂ X \nwill produce symmetries in the marginalizations of the site pattern distribution to Y.\n\n\nThis motivates the following definition of an algebraic model of site pattern probabilities. \nIn this definition and in what follows, it will be convenient to regard a site pattern probability distribution P\nfrom a κ-state model on an n-leaf tree as an n-way site pattern probability tensor.\nThat is, we regard P=(p_i_1 … i_n) as a κ×⋯×κ array \nwith non-negative entries adding to 1, where p_i_1 … i_n denotes the probability that the n (ordered) taxa are\nin state (i_1, …, i_n).\n\n\n\n\nLet ψ^+ be a rooted binary topological species tree on X, and κ≥2. Then the κ-state ultrametric exchangeable model, \n_κ(ψ^+), is the set of all |X|-way site pattern probability tensors P, \nsuch that for every Y⊆ X, and \nevery 2-clade {a,b} on ψ^+|_Y, the marginal distribution P_Y of site \npatterns on Y is invariant under exchanging the a and b indices.\nThe collection of all distributions as ψ^+ ranges over rooted \nbinary topological trees on X is the UE model (or the UE_κ model to avoid ambiguity).\n\n\nAlthough this model has `ultrametric' in its name, note that the tree ψ^+ is a topological rooted tree, with no edge lengths. \n`Ultrametric' here refers to the motivation for the model, generalizing the  model on an ultrametric species tree discussed above. \nWhile one can contrive mechanistic models on non-ultrametric trees that lead to distributions in the _κ(ψ^+) \nmodel, we do not find them very natural, and prefer to highlight the ultrametricity that a plausible mechanistic model is \nlikely to require to lie within _κ(ψ^+).\n\nIt is important to note that unlike most models in phylogenetics, including the  model  above, the  model is not defined through \nmechanistically-interpretable parameters. Rather it has a descriptive form relating entries of the model's joint distributions, \nchosen to reflect certain implicit features of the  model.  The  model then can be viewed as a relaxation, or supermodel, of \nthat more restrictive model.    \n\n\n\n\n\nLet ψ^+ be the rooted 3-taxon tree (a,(b,c)) and consider\na 2-state substitution model with states {0,1}. A probability\ndistribution for the (  (a,(b,c)) ) model is P = (p_ijk), a\n2 × 2 × 2 array with entries the joint probabilities for assignments\nof states to the taxa, \np_ijk =  (a = `i', b =`j', c=`k').\n\nSince the constraints on the model arise only from subsets Y⊆{a,b,c} \nthat contain at least two taxa, there are four subsets of interest:\n\n    {a,b,c}, {b,c},  {a,b}, {a,c}.\n\nThen _2(ψ^+) is a subset of the probability simplex Δ^7⊂ℝ^8\ndefined by the following linear equations.\n\n    {a,b,c}   :  p_010 =   p_001\n    \n    \t p_101 =   p_110\n    {b,c}   :  p_001 + p_101 =   p_010 + p_110\n    {a,b}   :  p_010 + p_011 =   p_100 + p_101\n    {a,c}   :  p_001 + p_011 =   p_100 + p_110\n\nThe first two constraints, for  {a,b,c}, express that slices\non the first index of probability tensors in _2(ψ^+) are symmetric.  Specifically, \nif P_z ·· denotes the conditional distribution of b,c\nwhen a is in state z, then the 2× 2 matrix P_z ·· is symmetric for each z ∈{0,1}.\nThese imply the third equation, for {b,c}, expressing that marginalizing over the first index gives  a symmetric matrix.\nThe fourth equation, for {a,b}, is independent of the first three, but with them implies the fifth one, for {a,c}.\n\nTaking into account the probabilistic requirement that ∑_i,j,k∈{0,1}p_ijk=1, we see\nthe model is a restriction of a 4-dimensional affine space to the simplex Δ^7 \nwith 0≤ p_ijk≤ 1.\n\n\nIt is clear that far more complicated models of site pattern evolution\non a species tree than the  model give rise to distributions which also lie within the  model, since\nthe only requirement is that the resulting site pattern distributions reflect the symmetries of the species tree. \nFor instance, in <cit.>, an extension is given to allow for Γ-distributed rate variation across sites.\nA further generalization, allowing for edge-dependent\nvariation of the population size N = N_e, as well as time-dependent variation in the mutation rate μ \nacross the species tree, can also easily be seen to produce distributions lying within .\nSince the symmetry conditions arising from the species tree are  linear constraints on the site pattern probability distributions, \narbitrary mixtures of models exhibiting the same symmetries will again exhibit these symmetries.\nThus, the mechanistic models in <cit.> on ultrametric trees that allow for \nvariation in the substitution rate matrix across sites also are submodels of .\nSimilarly, it has been shown that a model of gene flow on a 3-taxon ultrametric species tree \nwill produce site pattern probability distributions that reflect the symmetry in the 2-clade of the species\ntree  <cit.>. In focusing on the  model we obtain results that apply to \nall these models, and possibly more to be formulated in the future.\n\n\n\n§ GENERIC IDENTIFIABILITY OF TREES UNDER THE  MODEL\n\n\nTo use a statistical model for valid inference, it is necessary that any \nparameter one wishes to infer be identifiable; that is,\na probability distribution from the model must uniquely determine the parameter. \nFor phylogenetic models, this strict notion is generally too strong to hold, but one can often \nestablish a similar generic result, that the set of distributions on which identifiability fails is of \nnegligible size (measure zero) within the model. The following theorem is in this vein.\n\n\n The rooted binary topological tree ψ^+ is identifiable \nfrom a generic probability distribution in the  model.\n \n Fix κ and a taxon set X. Since for each binary species tree topology\nψ^+ the symmetry conditions are expressible by linear equations, the   model \nfor ψ^+ is the intersection of a linear space with the probability simplex. \nWe establish the result by showing that the linear model spaces for different ψ^+ are not \ncontained in one another, since then their intersection is of lower dimension and hence of \nmeasure zero within them.\n\nThat the linear spaces are not contained in one another will follow by establishing that for each \nψ^+ there is at least one distribution in\n _κ(ψ^+) that fails to have any `extra symmetry' required for it to be in the model for a \n different tree.   To construct such a distribution, assign positive edge lengths to ψ^+ so that the tree is ultrametric, and \n consider on it the κ-state analog of the (non-coalescent) Jukes-Cantor (henceforth denoted JC) model. The resulting site pattern distribution P is easily seen to have the necessary symmetries to lie in the UE model.\n \n\nTo show P has no extra symmetries, suppose to the contrary that there is a Y⊂ X containing two taxa a,c where \nP|_Y is invariant under exchanging the a and c indices, yet a,c do not form a cherry on ψ^+|_Y. Then, after \npossibly interchanging the names of a,c, there is a third taxon b such that the rooted triple ((a,b),c) is displayed \non ψ^+|_Y. Moreover, by further marginalizing to Y'={a,b,c}, we have that P|_Y' arises from a \nJukes-Cantor model on a 3-taxon ultrametric tree with positive edge lengths and rooted topology ((a,b),c), and exhibits a,c symmetry.\n\nTo see that this is impossible, note that if P|_Y' has both a,b and a,c symmetry, then it also exhibits \nb,c symmetry. Thus, all marginalizations of P|_Y' to two taxa are equal. \nThis implies all JC distances between taxa, which can be computed from these marginalizations, are equal. \nThis contradicts that the tree was binary.\n\n\n\n\n\nNote that the proof above did not consider a coalescent process in any way in order to show that\nextra symmetries do not generically hold in (ψ^+).  However, since applications may consider submodels of the UE model, such as the CK model, it is necessary to ensure they do not lie within the exceptional set of non-generic points in the UE model where tree identifiability may fail. To address this issue, we seek an \nidentifiability result for more \ngeneral mechanistic models that have an analytic parameterization, by which we mean that for each topology ψ^+ there is an analytic map from a full-dimensional connected subset of ℝ^k, for some k, to the set of \nprobability distributions comprising the model.  \nFor example, if σ^+ is a rooted metric species tree with shape\nψ^+,   and site pattern frequency distributions are generated on gene trees arising under the coalescent using the\nGTR+I+Γ model, then the collection of such distributions is given by an analytic parameterization, \nand as such is a submodel of (ψ^+).\n\n  Consider any submodel of the  model \nwith an analytic parameterization general enough to \n\nhave the JC model as a limit.\nThen for generic parameters the rooted topological tree ψ^+ is identifiable.\n\n\n\n \nLet \n    f:Θ→  UE(ψ^+)\n denote the parameterization map for the submodel on tree ψ^+. Then f(Θ) cannot lie entirely in UE(ϕ^+) for any ϕ^+ψ^+, since, as shown in the previous proof, there are points from the JC model in the closure of  f(Θ) which are not in the closed set UE(ϕ^+). Thus the set f^-1(UE(ψ^+) ∩ UE(ϕ^+)) is a proper analytic subvariety of Θ, and hence of measure zero in it. Since there are only finitely many ϕ^+, for generic points in Θ the resulting distribution lies in the UE model for ψ^+ only.\n\n\n\nNote that the CK model, which is analytically parameterized, has the JC model as a limit, since after choosing a JC substitution process one can let the population size N→0^+. This effectively “turns off\" the coalescent process, as small population sizes result in rapid coalescence.\n\nGeometrically, the  model on a particular tree is a convex set, since it can be expressed as the solution set for a system of linear equations and inequalities. It immediately follows that mixtures of instances of the UE model on the same tree, whether \ndefined by integrals such as typical rates-across-sites models (e.g., the ultrametric GTR+Γ coalescent mixture \nof <cit.>) or as sums (e.g., an ultrametric mixture of coalescent mixtures, as in <cit.>), or both, are \nalso submodels of  on that tree. Provided the model has an analytic parameterization, as all these examples do, \nTheorem <ref> then says that the tree topology is generically identifiable. Even in cases of mixtures \nwhich have so many numerical parameters that dimension arguments show they cannot all be individually identifiable, \nthe species tree topology remains so. This is a potentially valuable observation, as a scheme designed for inference \nof a tree under the  model may avoid some issues of model misspecification that might arise with a  more \nstandard approach of restricting to very simple models \n(e.g. constant population size) so that all numerical parameters are identifiable as well.\n\n\n\nThe above theorems of course imply the weaker statement that for \nthe  model (and many analytic submodels of the  model) on four or more taxa, the unrooted species tree topology is identifiable.\nAs SVDquartets is designed to infer unrooted 4-taxon trees, \nthis gives hope that it might also be able to infer the unrooted tree \ntopology for distributions from the more general  model.\nFor this to be possible, it is necessary to prove that the specific flattening matrices\nconsidered in the SVDquartets method satisfy certain rank conditions,\nthe content of the next theorem.\n\nRecall that if a κ×κ×κ×κ array P has indices \ncorresponding to taxa a,b,c,d, then the flattening  _ab|cd(P) is a κ^2×κ^2 \nmatrix with row and column indices in κ×κ and  ((i,j),(k,l))-entry P(i,j,k,l). \n\n \nFor P∈_κ(ψ^+), and ab|cd any unrooted quartet induced from \nthe tree ψ^+, let P̃=P|_{a,b,c,d} denote the marginalization to the taxa a,b,c,d.\nThen for all such P, _ab|cd(P̃) has rank  at most κ+12, while for \ngeneric P, _ac|bd(P̃) and _ad|bc(P̃) have rank κ^2.\n\n\n Since ψ^+|_{a,b,c,d} has at least one cherry,  assume one is formed by a,b. Then symmetry under \nexchanging the a,b indices of P̃ shows that for each 1≤ i<j≤κ, the (i,j) and (j,i) rows of\n_ab|cd(P̃) are identical. Thus that flattening has at most κ^2-κ2=κ+12 distinct rows, and \nits rank is at most κ+12.\n\n\nWe prove the second statement for _ac|bd(P̃), noting that the argument for _ad|bc(P̃) is similar. To show that for generic P∈_κ(ψ^+), \n_ac|bd(P̃) has full rank, \nit suffices to construct a single P for which this flattening matrix is full rank. \nTo see that this is the case, consider the algebraic variety\n\n    V_ac|bd = { P ∈ℝ^κ^|X|| (_ac|bd(P̃)) = 0}.\n\nThis variety is defined by a single degree κ^2 polynomial and contains\nall of the points P for which _ac|bd(P̃) is singular.\nIf there is a single point P ∈_κ (ψ^+) for which _ac|bd(P̃) ≠ 0, then the affine space _κ (ψ^+) is not contained in V_ac|bd. Thus, \nthe intersection of _κ (ψ^+) with V_ac|bd \nis a proper subvariety of _κ (ψ^+), and hence of measure zero within it.\nThus, generically, _ac|bd(P̃) is full rank. \n\n\nTo construct such a probability distribution, assign any positive lengths to the edges of ψ^+ so that it \nbecomes ultrametric, and consider the κ-state JC model on it (with no coalescent process). This \nleads to a distribution P ∈_κ(ψ^+). Then P̃ arises from the Jukes-Cantor model \non the induced rooted 4-taxon tree. Since the JC model is time reversible, P̃ is also obtained by \nrooting the quartet tree at the MRCA of a and b, with non-identity JC Markov matrices on each of the \n5 edges of this rerooted tree. Let M_a,M_b,M_c,M_d \n\n \n denote the Markov matrices on the pendant edges \nand M_int on the internal edge, so that\nF=(1/κ) M_int is the distribution of pairs of bases at the endpoints of the internal edge. \nLet  N_ac=M_a⊗ M_c and N_bd=M_b⊗ M_d denote the Kronkecker products.\nThen, following the details of <cit.>,\nthe flattening matrix may be expressed as\n\n    _ac|bd(P̃)=N_ac^T D N_bd,\n \nwhere D is a κ^2×κ^2 diagonal matrix formed from the entries of F. \n\nSince M_int is assumed to be a non-identity JC matrix, F has no zero\nentries, so D has rank κ^2. Similarly, the JC transition matrices\n M_a,M_b,M_c,M_d are non-singular, and since the Kronecker product of non-singular\n matrices is non-singular, so are N_ac^T and N_bd. Thus\n_ac|bd generically has full rank. \n\n\nThe argument in this proof, that generically the ranks of “wrong” flattenings of quartet distributions are large, proceeded by constructing an element of the  model using a parameterized model in the absence of a coalescent process. However, just as was done in Theorem 3.2, we can extend the conclusion to analytic submodels of the  model, such as those incorporating the coalescent. For instance, since the CK model has the non-coalescent JC model as a limit,\nthis implies that there are points in the  model that \nare arbitrarily close to the point P constructed in the proof, which therefore must also have rank κ^2 flattenings, \nas matrix rank is lower semicontinuous. We can thus obtain the following  generalization of a result from <cit.>.\n\n  Consider any submodel of the (ψ^+) model \nwith an analytic parameterization general enough to \n\nhave the JC model as a limit.\nIf ψ^+ displays the quartet ab|cd,\nthen for all distributions P in the model,\nwith P̃=P|_{a,b,c,d}, _ab|cd(P̃) has rank  at most κ+12, while for generic \nP, _ac|bd(P̃) and _ad|bc(P̃) have rank κ^2.\n\n\n\nWe note that our proof of this theorem has avoided the explicit calculations and more intricate arguments that appear in \n<cit.> while also establishing the result in a more general setting. This is possible because of our use of a tensor P in the \nclosure of the  model, but not in the  model, as well as adopting the viewpoint of <cit.> on flattenings as matrix products.\n\n\n\nUsing the two preceding theorems on identifiability, the statistical consistency of the SVDquartets method can be obtained. When Chifman and Kubatko <cit.> proved essentially the same result on ranks of flattenings\nfor the  model, they highlighted it as an identifiability result, but did not explicitly make a claim of consistency. \nThe consistency result for SVDquartets was then unambiguously stated and proved in this setting in <cit.>, which also gave an analysis of the convergence rate.\n\n\n\nHere we show that their argument for the consistency of SVDquartets applies more generally to \nsite patterns generated under the  model, \n\nas well as many submodels.\nIn particular, it validates the consistency of\ninference under models allowing mixtures of coalescent mixtures which may have different substitution processes \nacross the genome, as described in <cit.>.\n\nTo be precise, we must first specify some method of quartet amalgamation M, which takes a collection of one quartet tree for each 4-taxon subset of X and produces an unrooted topological tree on X. \nIn order to establish consistency, we require that\nif all quartet trees in the collection given to the method M are displayed on a \ncommon tree T on X, then M returns T. \nFollowing <cit.>, we say such a method is exact\n while recognizing that for large sets X one generally must use a \nheuristic method  M' that seeks to approximate M.\n\n\nThe SVDquartets method, using an exact method to construct a tree from a collection of quartets,  \ngives a statistically consistent unrooted species tree topology estimator \nfor generic parameters under the  model, and under any submodel \nwith an analytic parameterization \ngeneral enough to \n\nhave the JC model as a limit.\n\n\n\n To simplify notation in the argument, let  _ac|bd(P) denote the ac|bd flattening of the marginalization  P|_{a,b,c,d}.\n\nBy Theorems  <ref> and <ref> for generic parameters giving a probability distribution P \nin the model and any  four taxa a,b,c,d such that ab|cd is displayed on the unrooted tree ψ, _ab|cd(P) has \nrank  at most κ+12, while _ac|bd(P) and _ad|bc(P) have rank κ^2. \nThis implies that _ab|cd(P) will have at least  κ 2 singular values of 0, while  \n_ac|bd(P) and _ad|bc(P) have all positive singular values. For a finite sample of s \nsites from the model, denote the empirical distribution by P̂_s. Then for any ϵ>0 and any norm\n\n    lim_s→∞Pr(|P̂_s-P|<ϵ) =1.\n\nSince the vector σ(M) of ordered singular values of a matrix M is a  continuous function of the \nmatrix, this implies that for each q ∈{ab|cd, ac|bd, ad|bc}\n\n    lim_s→∞Pr( σ(_q(P̂_s))-σ(_q(P))<ϵ) =1\n\nwhere · denotes any vector norm.\nWith the SVD score μ(M) defined as the sum of the  κ 2 smallest singular values \nof a κ^2×κ^2 matrix M, we know\n\n    0=μ( _ab|cd(P) )<min{μ (_ac|bd(P) ), μ(_ad|bc(P) ) }.\n\nBut it then follows that  \n\n    lim_s→∞Pr( μ(_ab|cd(P̂_s) )<min{μ(_ac|bd(P̂_s)),μ(_ad|bc(P̂_s))}) = 1.\n\nThus, as the sample size s grows, the probability that choosing the quartet tree on a,b,c,d \nminimizing μ gives the quartet tree displayed on ψ approaches 1.\n\nSince this probability approaches 1 for each of set of four taxa, and there are only finitely many such sets, \nthe probability that all quartet trees inferred by minimizing μ are displayed on the species tree \napproaches 1. Thus with probability approaching 1, the method M will return the correct species tree.\n\n\n\n\n\n§ DIMENSION OF  MODELS ON LARGE TREES\n\n\nAlthough the symmetry conditions of the  model have been expressed as linear constraint equations, \nthese constraints are not in general independent, as was shown for a particular 3-taxon species tree in Example <ref>. \nIn that example, it was \neasy to determine a basis of constraints, and thus the dimension of the model. \nIn this section we investigate larger trees and determine the model dimension.\n\nKnowledge of dimension is important for several reasons. First, it gives us a basic insight into how restrictive the model on a particular tree\ntopology is. Second, if one is to use these models for tree inference, the dimension is important for judging how close a data point is to fitting the model.\nIntuitively, data is conceptualized as coming from a true model point with `noise' added, and if a model has high dimension the noise tends to do less to move that data from the model than if it had lower dimension. Such dimensionality considerations are made rigorous in many model selection criteria, for instance \nthe Akaike Information Criterion and Bayesian Information Criterion.\n\n\n\nFor a rooted topological tree ψ^+ on taxa X we consider the model  _κ(ψ^+). Let d_κ(ψ^+) \ndenote the dimension of the affine space V(ψ^+)⊂^κ^|X| of all tensors satisfying the linear equations \nexpressing the symmetry conditions defining the model, as well as that\nall entries of the distribution tensor sum to 1 (i.e., the affine, or Zariski, closure of the model). \n\nBy dropping the condition that tensor entries sum to 1, we pass to the \ncone over the model, a linear space L(ψ^+) \nof dimension c_κ(ψ^+)=d_κ(ψ^+)+1.  We now give a recursive formula for \ncomputing the dimension c_κ(ψ^+).\n\n\nFor a rooted binary topological tree ψ^+ on a taxon set X,\nlet ψ_A^+ and ψ_B^+ be the rooted subtrees descendant from the child nodes of the root of ψ^+, \non taxa A and B respectively,  so that\nX=A⊔ B and ψ^+=(ψ_A^+,ψ_B^+).  Then \n\n    c_κ(ψ^+) =\n    c_κ(ψ_A^+)c_κ(ψ_B^+)\n     - κ2.\n\n\n\n\n\nFor a topological rooted species tree ψ^+ on X, \nwe can construct a set of equations defining the cone L(ψ^+) by considering every subset Y ⊆ X and every 2-clade {a, b} of each ψ^+_|Y as was done in Example <ref>.\nHowever, as we saw in that example, the equations we obtain in this way are not necessarily independent.\nAs a first step towards proving Theorem <ref>, we construct a smaller (though still not necessarily independent) set of linear \nequations defining the cone L(ψ^+). \nThis set is defined by associating a set of linear equations to each vertex of the topological rooted\n tree ψ^+ on X.\nSpecifically, for each internal vertex v of ψ^+ choose two taxa a ,b with v=(a,b). \nLet  P  be a |X|-dimensional κ×⋯×κ tensor of indeterminates, with \nindices corresponding to taxa in X and let P_a b denote the marginalization of P over \nall indices corresponding to taxa in (v)∖{a ,b}. \nEach choice of the indices corresponding to taxa in X ∖(v) determines a matrix \nslice of P_a b, with indices corresponding to a ,b. \nExpressing that each of these slices is symmetric yields a collection of linear equations.\nDenote this set of equations by 𝒮_v=𝒮(ψ^+,{a,b}).\nThough the set 𝒮_v will depend on the particular pair of taxa (a,b) chosen,\nfor our purposes the particular pair is irrelevant, so one can designate any consistent rule \nfor selecting the pair (a,b) so that the 𝒮_v are well-defined. \nIf v is not an internal vertex of ψ^+, define S_v to be the empty set.\n\n   \nLet ψ^+ be a topological rooted tree on X. \nThen the set  \n\n    𝒮 = ⋃_v ∈ V(ψ^+)𝒮_v\n\ndefines the cone L(ψ^+).\n\n\n\nIt is enough to show that if v=(a, b)=(a,c), then the linear equations expressing symmetry \nof slices of P_ac are contained in the span of those expressing symmetry of slices of P_ab together \nwith those equations in 𝒮 arising from nodes descended from v. We show this inductively, proceeding \nfrom the leaves of the tree to the root. The base case, when v has only two leaf descendants, is trivial. \n   Assume the result holds for the internal nodes descended from v. Let the children of v be \n   v_1, which is ancestral to or equal to a, and v_2, \n   which is ancestral to b,c since ψ^+ is binary. \n   Then w=(b,c) is a descendent of v_2. The equations arising from w express that any \n   entry of the marginalization of P over all descendants of w except b, c is invariant under \n   exchanging the b, c indices. Since the entries of P_ab arise from further marginalization, \n   the equations expressing symmetry of the ab-slices together with those arising from w imply  \n   those expressing the ac-slices of P_ac are symmetric.\n\n\nThe proof of the previous lemma explains the dependence of the equations we see in Example <ref>. The {a,b,c} constraints are the equations arising from MRCA(b,c), which \nin that example, required no marginalization of P. The {a,b} constraints are the equations arising from the root of the tree that express symmetry of P_ab which are obtained by marginalizing P over c. Together, these constraints imply the {b,c} and {a,c} constraints,\nthe latter of which express symmetry in the slices of P_ac. \n\n\n\n\nLet n_A=|A| and n_B=|B|.\nWith U= ℝ^κ^n_A and V=ℝ^κ^n_B, we identify W=U⊗ V=ℝ^|X| with the space\nof k^n_A× k^n_B real matrices. \nIn particular, we have L(ψ_A^+)⊂ U,  L(ψ_B^+)⊂ V, and L(ψ^+)⊂ W.\n\nWe first claim that L(ψ_A^+)⊗ L(ψ_B^+) is the subspace Z⊂ W defined by the subset 𝒮' of \n𝒮 = 𝒮(ψ^+) of Lemma <ref> containing only those equations arising from non-root internal nodes of ψ^+.\n\nTo see L(ψ_A^+)⊗ L(ψ_B^+)⊆ Z, consider an equation in 𝒮' associated to a non-root node v and its \ndescendant taxa a,b as in the lemma. Without loss of generality, we may assume v is a node of ψ_A. Then, ordering the \ntaxa so that a,b are the first two, this equation in 𝒮' has the form\n\n    ∑_ α_1 x_(i,j,α_1,α_2),β -∑_ α_1 x_(j,i,α_1,α_2),β =0\n\nwhere the summation over α_1∈ [k]^m runs through all assignments of states to taxa descended from v other than \na,b , α_2∈ [k]^n_A-2-m\n is a fixed choice of states for taxa in A not descended from v, β∈ [k]^n_B is a\n fixed choice of states for the taxa in B, and i j. This equation expresses that column β of a matrix in W satisfies \n an equation associated to v, a, and b in the definition of L(ψ_A^+). Thus it holds on all of L(ψ_A^+)⊗ L(ψ_B^+), and we \n obtain the desired inclusion.\n\nTo see L(ψ_A^+)⊗ L(ψ_B^+)⊇ Z, note that equation (<ref>) has shown that every \ncolumn of z∈ Z lies in L(ψ_A^+), and likewise every row of z lies in L(ψ_B^+). But from the singular value decomposition of z, \n\n    z=∑_i c_i⊗ r_i\n\nwhere the c_i form a basis for the column space of z and the r_i form a basis for the row space of z. Since c_i∈ L(ψ_A^+) and\nr_i∈ L(ψ_B^+), it follows that z∈ L(ψ_A^+)⊗ L(ψ_B^+), establishing the stated inclusion and that Z = L(ψ_A^+)⊗ L(ψ_B^+).\n\nNow the space L(ψ^+) is the subset of Z=L(ψ_A^+)⊗ L(ψ_B^+) defined by the equations in 𝒮∖𝒮', \nassociated to the root of ψ. To conclude that\n\n    c_κ(ψ^+) =\n    c_κ(ψ_A^+)c_κ(ψ_B^+)\n     - κ 2,\n\nit is enough to show that we can obtain an independent set of equations defining L(ψ^+) by taking an independent set \ndefining Z and augmenting it by κ 2 additional independent equations associated to the root. \n\nLet ℒ be any independent subset of  equations in 𝒮' that define Z, and ℳ=𝒮∖𝒮' \nthe set of κ 2 equations associated to \n\nthe root of ψ^+ (and the choice of a∈ A and  b∈ B).\nThen ℒ∪ℳ defines L(ψ^+). To see that ℒ∪ℳ is independent, first order indices so that \na and b indices are  listed first among A and B.\nThen, using `+' in an index to denote the sum over the assignment of all states\n[κ] = {1, 2, …, κ} in that index, \nfor any 1 ≤ i<j ≤ k, \n    x_i+…+,  j+…+ - x_j+…+,  i+…+=0\n \nmust be the unique element of ℳ that involves the variable x_ii⋯ i,  jj⋯ j (noting that each equation in ℒ involves variables that \nhave at least two distinct entries in the indices for A or two distinct entries in the indices for B).\nSince ℒ is an independent set, this implies ℒ∪ℳ is independent.\n\n\n\nThe theorem gives insight into model dimensions for families of `extreme' topologies:\nrooted caterpillars and fully balanced shapes.\n\n  Suppose ψ^+ is a rooted caterpillar tree on n taxa. Then the \ndimension of the _κ(ψ^+) model  is\n\n    d_κ(ψ^+)=κ^n+κ/2 -1.\n\n\n\n\nIf n=1, then the model is simply a base distribution for the sole taxon, so d_κ(ψ^+)=κ -1, \nconsistent with the stated formula.\nNow inductively assume the stated formula for the rooted caterpillar on n-1 taxa. Then by \nTheorem <ref>, for n taxa\n\n    c_κ(ψ^+)=(κ^n-1+κ/2)κ -κ2=\n    ( κ^n+κ^2/2) -(κ^2-κ/2)=\n    κ^n+κ/2,\n  and the claim follows.\n\n\nAlso from Theorem <ref> we can compute that the dimension of the  model on the 4-taxon balanced tree ((a,b),(c,d)) is\n\n    d_κ =  ( κ^2+κ/2)^2-κ 2-1=   κ(κ^3+2κ^2-κ+2)/4 -1.\n \nBy comparing the dimensions for the 4-taxon caterpillar and balanced trees, we see that d_k depends on the rooted tree topology, and \nnot only on the number of taxa.\n\nMore generally, for a fully balanced tree ψ^+ on n=2^ℓ taxa, Theorem <ref> yields that\n\n    d_κ(ψ^+)= (  ( κ(κ+1)/2 )^n/2 ).\n\nThus for fully balanced trees the dimension is o(κ^n/2), while \nfor rooted caterpillars on n taxa, Corollary\n<ref> shows the dimension is asymptotic to κ^n/2. \nFor a fixed number of taxa n = 2^ℓ, it follows that \nthe dimension of the balanced tree model will be smaller than that of the caterpillar.\n\n\n\nThis comparison of model dimension for caterpillars and balanced trees is intuitively plausible, as cherries on the \nfull tree lead to more symmetry requirements on a tensor than do cherries on subtrees. In general, the more balanced a tree is, \nthe smaller one might expect the model dimension to be. This leads us to pose the following\nconjectures, where RB(n) denotes the set of rooted binary n-leaf trees.\n\n\nFor all κ, there exists an m, such that for n ≥ m, \n d_κ(ψ^+) is maximized over ψ^+ ∈ RB(n) when ψ^+ is the n-leaf caterpillar tree. \n\n\n\nFor all κ, there exists an m, such that for ℓ≥ m,  d_κ(ψ^+) is minimized over ψ^+ ∈ RB(2^ℓ)\nwhen ψ^+ is the 2^ℓ-leaf balanced tree.\n\n\n\n\n\n\n\n§ A GENOMIC MODEL OF SITE PATTERNS ON GENERAL TREES\n\n\n\n\nIn this section, we examine a generalization of the CK model to non-ultrametric trees \nto motivate an algebraic model that encompasses it. \nMarginalizations (respectively, slices) of a site pattern probability tensor will be denoted by placing a `+' \n(resp. k) in the index summed over (resp. conditioned on). \nThe transpose operator will be denoted with an exponent `T.'\n\nFor example, we can generalize the equations derived in Example <ref> for the  model on the ultrametric 3-leaf rooted tree (a, (b,c)) for any value of κ using this notation as follows:\n\n\n\n\n\n4cm\n\n\n  (1)  P_k ··=P_k ··^T, \n\n  (2)  \nP_+··=P_+··^T.\n\n\n\n\n4cm\n\n\n  (3)  P_··+=P_··+^T,\n\n  (4)  P_·+·=P_·+·^T.\n\n\n\n\n\n\n\nIn the definition of the  model, these constraints arise from the taxon subsets \n(1)  {a,b,c}, (2)  {b,c}, (3) {a,b} and (4) {a,c}, and it is not hard\nto see that the equations in (1) and (3) imply those in (2) and (4), just as in Example\n<ref>.\n\n\n\n\n\n §.§ The Extended Exchangeability Model\n\n\n\nIn <cit.>, the  model is extended to permit non-ultrametricity of the species tree. This extension allows, for instance, the modeling of relationships between species when generation times or scalar mutation rates differ across \npopulations in the tree. \nIn this same work, flattening matrices are used to establish the generic identifiability of the \nunrooted species tree topology of the extended model from which it follows  \n\nthat SVDquartets is still a statistically consistent \nmethod of inference of the unrooted species tree topology for these models when combined with any exact method of quartet amalgamation.\n\n\nIn order to motivate our algebraic model, \nfirst consider a model obtained from the  by dropping the ultrametricity requirement \non the species tree. \nSuppose a and b are taxa in a 2-clade on σ^+, and let v be their common parental node. In the \nspecial case that the edge lengths of e_a=(v,a) and e_b=(v,b) equal, then the lineages a and b would be \nexchangeable under this site pattern model as shown for the  model. \nThus, for this particular tree the site pattern distribution \ncan be viewed as a tensor with symmetry in the a and b coordinates. On a general species tree, however, \nwhere e_a and e_b may have different lengths and mutation rates may not be consistent, \nall sites evolve over those edges according to the transition matrices \n\n    M_a   =exp (s_a Q ),   s_a=∫_0^ℓ(e_a)μ_e_a(t)dt,\n    \n    M_b   =exp (s_b Q ),   s_b=∫_0^ℓ(e_b)μ_e_b(t)dt,\n\nwhere ℓ(e) is the length of edge e and μ_e_a(t) and μ_e_b(t)\nare time dependent mutations rates. \n\n\nSupposing, without loss of generality, that s_a≤ s_b, define the Markov matrix \n    M=M_bM_a^-1=exp ((s_b-s_a) Q ).\n\n\nThen the site pattern distribution can be viewed as one obtained from a tensor with symmetry in a and b that has been acted on by M in the b-index. \nMore specifically, we imagine that on the edges leading toward both a and b, the Markov matrix M_a describes an initial substitution process, but on the edge to b there is a subsequent mutation process described by M. If we introduce an additional action by M on the edge to a, then in the resulting distribution we would regain symmetry in a and b. Since no coalescent events occur in these pendant edges, there are no complications arising from the coalescent events that do occur.\n\nTo formalize this mathematically, suppose\nP is an N-way κ×κ×⋯×κ tensor. \nDefine the action of a κ×κ matrix M in the kth index of P by Q=P*_k M where\n\n    Q(i_1,i_2,…,i_k,…, i_N)=vM,\n\nwith v the row vector determined by fixing the ℓth index of P to be i_ℓ for all ℓ k. \nFor example, for n = 3 and k=1, the tensor P*_1M is specified by \n(P*_1M)_ijk = (P_· j k M)_i.\nGiven an n-tuple of matrices (M_1,M_2,… M_n), let\n\n    P*(M_1,M_2,…, M_n)=(… ((P*_1M_1)*_2M_2)… *_nM_n)\n denote the action in each of the indices of P.\n\n\n\n\n\nLet ψ^+ be a rooted topological species tree on X with |X|=n. Then the extended exchangeable model, _κ(ψ^+), is the set of all n-way site pattern probability tensors P, \nsuch that there is an n-tuple M=(M_1,M_2,…, M_n) of κ×κ non-singular Markov matrices M_i and a non-negative array P̃ in the model _κ(ψ^+) such that P*M=P̃. \n\n\n\nWe note that    is a submodel of : any distribution in _κ(ψ^+) is seen to lie in _κ(ψ^+)  by taking all matrices M_i to be the identity. Also, to ensure that the  model does not include all distributions, it is important that the M_i be non-singular in this definition:  Otherwise, if the M_i describe processes where all states transition to the same state with probability 1, then for any tensor\nP, P*(M_1,M_2,… M_n)=P̃, a tensor with a single diagonal entry equal to 1 that is in UE.\n \n\n\n\nWhile the  model on a 2-leaf tree imposes constraints on the probability distribution of site patterns, the 2-leaf  model is dense among all probability distributions. Indeed, the  model on such a tree simply requires that the site pattern distribution have the form of P= M_1^-TSM_2^-1 with S  a  symmetric probability matrix and the M_i Markov. But a dense subset of all probability distributions can be expressed as P=DM for a  diagonal matrix D with entries from the row sums of P and an invertible Markov matrix M. We can thus take M_1=M, S=M^TDM, and M_2=I.\n\nFor a 3-taxon tree, though, the  model is typically not the full probability simplex Δ^κ^3-1. \nFor κ≥ 4, this follows from a simple dimension bound. The UE(ψ^+) model for a 3-taxon tree ψ^+ has, from Corollary 4.3, dimension\n\n    d_κ = κ^3+κ/2 -1.\n\nMoreover, the affine closure of the UE model on a 3-taxon tree is mapped to itself by the * action of (M^-1,M^-1,M^-1) for any Markov matrix M. Thus the dimension of the EE(ψ^+) model can be at most \n    (UE(ψ^+)+2κ(κ-1),\n where the second term is the number of parameters specifying two Markov matrices. Thus\n\n    (EE(ψ^+)≤κ^3+4κ^2-3κ/2 -1< κ^3-1\n for all κ≥ 4.\n\nAs we address in the remark following Corollary <ref>, \nwe can confirm computationally that for a 3-taxon tree and κ = 3, EE(ψ^+) is of lower dimension\nthan the probability simplex Δ^26 and that for κ = 2,\n\nthe Zariski closure of EE(ψ^+) is equal to Δ^7. \n\n\n\n\n A more restrictive variant of the  model, that is closer to the mechanistic models of <cit.> model, could be defined by requiring that all the `extension' matrices M_i arise as exponentials of the same GTR rate matrix.  While this common exponential condition is not expressible purely through algebra, there are other algebraic relaxations of it that one could impose instead, such as that the extension matrices M_i are symmetric and commute.\n\n\n\n\n\n§ THE  MODEL ON 3-TAXON TREES\n\n\nBy Definition <ref>, the  model on a 3-leaf rooted tree ψ^+ is the set of  κ×κ×κ probability tensors of the form\n\n    P=P̃ *(M_a^-1,M_b^-1,M_c^-1),\n \nfor some P̃∈ (ψ^+) and invertible Markov matrices M_a,M_b, and M_c.\n\nBecause of the matrix actions, this model has a non-linear structure. This makes it more difficult to fully characterize the model  in terms of constraints than it was for the affine linear  model. It also means that the optimization problem for maximum likelihood may not be a convex one, making direct use of constraints for inference more appealing than attacking the optimization problem inherent to maximum likelihood. \n\nWhile determining all equality constraints satisfied by the model (i.e., generators of the ideal of model invariants) is difficult computationally, here we focus on determining some of them. We will use these in  Section <ref> in our proof of tree identifiability under the  model.\nNoting that only a few constraints are utilized in the SVDquartets method, future work should investigate whether the constraints found here are useful for rooted tree inference.\n\n\n\n\n Let P be a tensor in the EE model on ψ^+=((a,b),c), and (A) denote the matrix of cofactors of a square matrix A.\nThen for all k ∈ [κ] the matrices \n\n    Q^a_·· k=P_+··(P_·+·)^T P_·· k\n\nand \n\n    Q^b_·· k=P_·· k(P_+··)P_·+·^T\n\nare symmetric: that is,\n\n    Q^a_·· k= ( Q^a_·· k) ^T\n\n\nand\n\n\n    Q^b_·· k=( Q^b_·· k)^T.\n\n\n\n\n\n\n\nIf P is in the  model,  then P=P̃ *(M_a^-1,M_b^-1,M_c^-1), with P̃∈  and M_a,M_b,M_c Markov.\nThen \n    P_·+·=M_a^-TP̃_·+· M_c^-1  and  \n    P_+··=M_b^-TP̃_+·· M_c^-1=M_b^-TP̃_·+·M_c^-1\n\nsince P̃∈   implies P̃_·+· = P̃_+··.\nThen, assuming necessary inverses exist, \n    P_·+·^-TP_+··^T=M_aM_b^-1,\n\n\nThus\n\n    P*_a(P_·+·^-TP_+··^T)=P̃*(M_b^-1,M_b^-1,M_c^-1).\n \nBut it is straightforward to check that every slice with fixed c-index of P̃*(M_b^-1,M_b^-1,M_c^-1) is symmetric, since that is true for P̃.\nThus \n    (P_·+·^-TP_+··^T)^T P_·· k=P_+·· P_·+·^-1 P_·· k\n\nis symmetric for every k.\n\nUsing the cofactor formula for the inverse of a matrix, and clearing denominators by multiplying by a determinant yields (<ref>). \n\n\nThe assumption of invertibility used in this argument can be justified for a dense set of choices of P̃. Indeed, it is enough to exhibit\none such choice, since that indicates the  subset leading to non-invertibility is a proper subvariety (defined by certain minors vanishing), and hence of lower dimension. Such a choice is obtained with the Markov matrices being the identity, and P̃ having non-zero diagonal entries, and zero elsewhere.\nSince the claim is established on a dense set, it holds everywhere by continuity.\n\nThe claim (<ref>) can be shown either in a similar way, or by conjugating (in the sense of multiplying by a matrix and its transpose) Q^a_·· k by P_· + · P_+··^-1  and removing determinant factors.\n\n\n\n\n Since Q^a_·· k and Q^b_·· k are conjugate for any tensor P (even one not in the  model), checking that one is symmetric implies the other is as well, provided the appropriate inverse exists. If these are used as necessary conditions for membership in the model, when applied to data it may still be desirable to check that both are approximately symmetric, since it is unclear how conjugation will effect the way we measure the inevitable stochastic error leading to violation of perfect symmetry.\n\n\n \n\nThe  model on ψ^+=((a,b),c) is contained in the algebraic variety defined by the degree κ+1 polynomials given by the entries of the 2κ matrix equations\n\n    P_+··(P_·+·)^T P_·· k   - P_·· k^T (P_·+·) P_+··^T,\n    \n    P_·· k(P_+··) P_·+·^T    -P_·+·(P_+··)^T P_·· k^T.\n\n\n\n\n\nThe polynomials of this corollary also arise as phylogenetic invariants for the general Markov (GM) model of sequence evolution <cit.> with no\ncoalescent process. \nIn the setting of that work, the tensors of interest are those in the orbits of 3-way diagonal tensors under actions of GL_κ in each index, while here they are the orbits of tensors symmetric in two indices under the same GL_κ actions. Since diagonal tensors display this symmetry, the invariants above must also apply to the GM model.\nHowever, the GM model on a 3-taxon tree has additional invariants of this form, for every pair of taxa, not just those in the cherry.\n\n\nUsing the computational algebra software Singular <cit.>, \nwe are able to show that for κ = 2,\nthere are no non-trivial polynomials vanishing on the  model. Thus,\nthe polynomial invariants implied by Corollary <ref> are identically zero. \nFor κ = 3, we verified computationally that these invariants are not identically zero.\n\n\n\n\n\n\nAs demonstrated by methods such as SVDquartets, reframing model constraints in terms of rank conditions can\nbe useful for developing practical methods of phylogenetic inference. \nWith this in mind, we can reinterpret the results of \nCorollary <ref> as rank conditions for the  model. \nTo do so, we use the following lemma, which follows a construction of G. Ottaviani that was suggested to us by L. Oeding.\n\n Let A,B,C,D,E, F be six κ×κ matrices, with B,E invertible, satisfying \n    CB^-1A+DE^-1F=0.\n\nThen the 3κ× 3κ matrix\n\n    [ 0 A B; D 0 C; E F 0 ]\n\nhas rank 2κ.\n\n\n\nObserve\n\n    [ 0 A B; D 0 C; E F 0 ]=[ I 0 0; 0 I D; 0 0 E ][                0                0                I;                0 -(CB^-1A+DE^-1F)            CB^-1;                I            E^-1F                0 ][ I 0 0; 0 I 0; 0 A B ].\n\n\n\n Tensors in the  model on ψ^+=((a,b),c) are contained in the algebraic variety defined by the degree 2κ+1 polynomials given by the  (2κ+1)× (2κ+1) minors of each of the 2κ matrices\n\n    [         0    P_·· k     P_·+·; -P_·· k^T         0     P_+··;  -P_·+·^T  -P_+··^T         0 ]\n\nand\n\n    [         0 P_· + ·^T   P_+··^T;   -P_·+ ·         0    P_·· k;    -P_+·· -P_·· k^T         0 ].\n\n\n Choosing A,B,C,D,E,F in Lemma <ref> as shown in these matrices makes the equation CB^-1A+DE^-1F=0 express that Q^a_·· k and  Q^b_·· k are symmetric, which was shown in Proposition <ref>.\n\n\nThe result of Corollary <ref> allows one to formulate necessary conditions for EE model membership on the 3-taxon tree in terms of rank conditions on matrices, much as the SVDquartets method is based on rank conditions on matrices\nin the 4-taxon case. \n\n\n\n\n\n\n\n§ TREE IDENTIFIABILITY UNDER THE  MODEL\n\nThe  model invariants of the previous section enable us to prove that the rooted tree topology is generically identifiable under the  model. \nWe establish these results for κ≥ 4, which includes the cases most relevant\nfor phylogenetic analysis. \n\n\nTo establish identifiability, we use the following non-identifiability result.\n\n  \nConsider a 2-taxon species tree (a x,b (ℓ-x) ), with 0≤ x≤ℓ with constant population size N above the root and any GTR rate matrix Q with stationary distribution π. Then the probability distribution matrix F of site patterns under the  model is symmetric and independent of x.\n\n Using time reversibility, the distribution can be expressed as\n\n    F=∫ _t=0^∞diag(π) M_x M_2t M_ℓ-xμ_N(t) dt\n\nwhere μ_N(t) is the density function for coalescent times,  and M_z=exp(Qz). Since the integrand, a GTR distribution, is a symmetric matrix, then so is F.\nSince the M_z commute, and M_xM_ℓ-x=M_ℓ,\n\n    F= diag(π) M_ℓ∫ _t=0^∞  M_2tμ_N(t) dt\n\nhas no dependence on x.\n\n\n  The rooted topological tree ψ^+ is identifiable from generic probability distributions in the _κ(ψ^+) model for κ≥ 4.\n \n \n\n\nWe first suppose κ=4. For the 3-taxon trees ϕ^+=((a,b),c) and ψ^+=((a,c),b), we show that (ψ^+)∩(ϕ^+) has measure zero within (ψ^+). \nTo do this, it is enough to construct one point in (ψ^+) that is not in the Zariski closure of (ϕ^+), since that implies the Zariski closure \nof the intersection of (ψ^+) and (ϕ^+) is of lower dimension than (ψ^+).\n\nLet N be an arbitrary effective population size and let\nϕ^+ = ((a 2, c 0) 1,b 1), with distances in coalescent units (number of generations divided by 2N). \nLet μ = 1/2N and define Q to be the Kimura 2-parameter (K2P) rate matrix\n\n\n\n    [ -4  1  2  1;  1 -4  1  2;  2  1 -4  1;  1  2  1 -4;    ]\n\nwith equilibrium distribution π =(1/4, 1/4, 1/4, 1/4).\nFinally, let P be the probability tensor that arises from this choice of\nparameters in the  model.\n\n\n\n\nThen letting M=exp(2Q), we see that P=P*(I,M,M) lies in (ψ^+), which implies that P∈(ψ^+). \nTo see that P does\nnot belong to the Zariski closure of EE(ϕ^+) by Corollary <ref> it suffices to show that for some k\n\n    P_+··(P_·+·)^T P_·· k \n    - P_·· k^T (P_·+·) P_+··^T  0.\n\n\nNote that\nP_+·· and\nP_·+· are probability distribution matrices\nfor the same model on the 2-leaf species trees (b 1, c 1) and (a 2, c0).\nBut, by Lemma <ref>,  \n\n    P_+·· = P_·+· = \n    P_+··^T = P_·+·^T,\n\nso\n\n    P_+··P_·+·^-T = \n    P_·+·^-1 P_+··^T  = \n    I_4.\n\nTo show (<ref>), it is thus enough to show that some\nP_..k is not symmetric. This can be verified without appealing to numerical computation: \nFor example, \n\n    (P_..1)_12 - (P_..1)_21=\n    110530e^-20-\n    122230e^-25-\n    120007e^-29.\n\nIf this were zero, then multiplying by e^29 would show e is a root of a rational polynomial, \ncontradicting its transcendence. \n\nThus (ψ^+)∩(ϕ^+) has measure zero within (ψ^+).\n\n\nInterchanging taxon names then shows the intersection of any two resolved 3-taxon tree models is of measure zero within them, and thus that a generic distribution in any single 3-taxon model lies only \nin that 3-taxon model. This establishes the theorem for 3-taxon trees when κ=4.\n\n\n\nFor larger trees ψ^+, each displayed rooted triple determines a measure zero subset of (ψ^+) containing all points where that rooted triple may not be identifiable from marginalizations of P to those 3 taxa. Since there are a finite number of such sets, for a generic P∈ (ψ^+), all displayed rooted triples are identifiable, and hence so is the tree ψ^+.\n\n\n\n\nFor κ>4, the proof follows by embedding \nthe 4-state rate matrix above in the upper left corner of a \nκ-state GTR rate matrix and setting the remaining entries to 0.\n\n\n\nSeveral comments are in order about the method of proof in Theorem <ref>. First, if the matrix Q is chosen to be  a Jukes-Cantor rate-matrix, then one finds that the same construction of P leads to a point on which the invariants for (ϕ^+) vanish. That is, P is not `sufficiently generic' to identify the rooted tree. This is explored more thoroughly in the Appendix. \n\n\nSecond, since the argument used an instance of the  model with a K2P rate matrix, it also establishes the following, which directly applies to models used for phylogenetic inference.\n\n\n\nFor κ =4, consider any submodel of  such that each ψ^+ has an analytic parameterization general enough to contain the Kimura 2-parameter coalescent mixture model with constant population size. Then for generic parameters the rooted topological tree ψ^+ is identifiable.\n\n\n \n\nFinally, while our proof of identifiability of a rooted tree under the  model fails for the  Jukes-Cantor model, unrooted trees are still identifiable under that model. To establish this,\nnote that a probability distribution for a 4-taxon tree on taxa a,b,c,d under the   model has the form P=P̃*(M_a,M_b,M_c,M_d),\nwith P̃ in the UE model and the Markov matrices invertible. As a result, its flattenings can be expressed as\n\n    _ab|cd(P)   =(M_a⊗ M_b)^T _ab|cd(P̃) (M_c⊗ M_d),\n    _ac|bd(P)   =(M_a⊗ M_c)^T _ac|bd(P̃) (M_b⊗ M_d),\n    _ad|bc(P)   =(M_a⊗ M_d)^T _ad|bc(P̃) (M_b⊗ M_c).\n\n\n\nSince M_a,M_b,M_c, and M_d have full rank, this implies the rank of each flattening of P is equal to the rank of the corresponding flattening of P̃.\nIt is then straightforward to obtain the following analog of Theorem <ref>.\n\n\n\n\nThe SVDquartets method, using an exact method to construct a tree from\na collection of quartets, gives a statistically consistent unrooted species tree topology estimator\nfor generic parameters under the EE model, and under any submodel with an analytic\nparameterization general enough to contain the CK K2P model.\n\n\n\n\n\n\n§ PSEUDO-EXCHANGEABILITY FOR THE JUKES-CANTOR MODEL\n\n\n\n\nThe proof of Theorem <ref>, on the generic identifiability of the tree topology under the  model, used a particular point in the  model arising from the  Kimura 2-parameter model. Here, we show that it is not possible to use similar arguments with a point in the  Jukes-Cantor model. We do this by specifically considering the  Jukes-Cantor model, and showing that the model always has `extra symmetries' that prevent the identification of the rooted triple tree by these invariants.\n\n\n \n Consider the  Jukes-Cantor model on the tree\n((aℓ_a,bℓ_b)ℓ_ab, c ℓ_c ).\nIf ℓ_a = ℓ_ab + ℓ_c then the resulting probability tensor P = (p_ijk) exhibits a,c exchangeability, that is,\np_ijk = p_kji. \n\n\n\nLet P = (p_ijk) be a probability tensor from the  Jukes-Cantor model on a 3-leaf tree.\nWhile P has 64 entries,\n\n\nbecause the site substitution model is the Jukes-Cantor model, it\n has at most five distinct entries.\nThus, we may group the coordinates of P into five equivalance classes,\nwhich we represent by\n\n    [p_AAA], [p_AAC],[p_ACA],[p_ACC],[p_ACG].\n\nFor any representative of the equivalence class\n[p_AAA], [p_ACA], or [p_ACG], \nswapping the first and third indices produces another representative\nof the same equivalence class. \nHowever, for representatives of the equivalence class\n[p_AAC], swapping the first and third indices produces a \nrepresentative of the equivalence class [p_ACC],\nand vice versa. Therefore, to prove the proposition, it \nsuffices to show that for P, [p_AAC] \nand [p_ACC] are equal. To establish this, \nwe prove that p_AAC = p_ACC.\n\n\nRestricting to the leaf set {a,b}, we obtain the \n2-leaf rooted tree\n(aℓ_a,bℓ_b) and the probability of observing\nstate ij from the  Jukes-Cantor model on this tree is\n\n    P_ij+ = p_ijA + p_ijC + p_ijG + p_ijT.\n\nLikewise, by restricting to the leaf set {b,c}, we obtain the\n2-leaf rooted tree\n(bℓ_b + ℓ_ab,c ℓ_c) and the probability of observing\nstate jk from the  Jukes-Cantor model on this tree is\n\n\n\n\n    P_+jk = p_Ajk + p_Cjk + p_Gjk + p_Tjk.\n\n\nNote that since ℓ_a = ℓ_ab + ℓ_c, \nthe 2-leaf species trees obtained by restricting to {a,b} and {b,c} \ndiffer only by the location of the root.\nBy Lemma <ref>, since the Jukes-Cantor model is a\nsubmodel of GTR, the probability distribution matrices for the\nJC models on these trees are symmetric and equal.\nTherefore, we have \n\n\nP_ij+ = P_ji+=  P_+ji = P_+ij.\n\nSpecifically, this implies P_AC+ = P_+CA, or\n\n    p_ACA + p_ACC + p_ACG + p_ACT = \n    p_ACA + p_CCA + p_GCA + p_TCA.\n\n\nUnder the JC model, p_ACG, p_ACT, p_GCA, and p_TCA \nall belong to the equivalence class of coordinates with \nthree distinct indices, which is to say, \np_ACG = p_ACT = p_GCA = p_TCA.\nThus, by cancellation, the equation above reduces to \np_CCA = p_ACC. Since p_CCA and p_AAC are in the same\nJC equivalence class, this implies\np_AAC = p_ACC.\n\n\nThe invariants of Corollory <ref> associated to all of the trees ((a,b),c), ((a,c),b) and ((b,c),a) vanish on all probability tensors P arising from the Jukes-Cantor  model on any of these trees.\n\n\nFirst consider P̃ arising from the  Jukes-Cantor model on the tree  ((aℓ,bℓ)ℓ, c   0 ). By the proposition, this tensor is fully-symmetric, that is, invariant under any permutation of the indices, for any positive value of ℓ. It thus lies in the  model for all three trees. Now\nthe probability tensor P from the  JC model on \n((aℓ_a,bℓ_b)ℓ, c ℓ_c ), \nwhere ℓ_a,ℓ_b≥ℓ and ℓ_c≥ 0 \ncan be expressed as\n\n    P=P̃*(M_a,M_b,M_c),\n\nwhere M_a, M_b, M_c are Jukes-Cantor matrices for edges of length ℓ_a-ℓ, ℓ_b-ℓ, ℓ_c-ℓ, respectively.  Thus P lies in the  model for all three trees. Therefore the invariants associated to all three trees vanish on it.\n\nMoreover, since the entries of probability tensors in the  model are parametrized by analytic functions of the edge lengths, composing these function with the invariants gives analytic functions that vanish on a full-dimensional subset of the parameter space, which must therefore be zero on the entire parameter space. Thus the invariants vanish  on the model even when the terminal edge lengths do not satisfy the assumed inequalities.\n\n\n\n\n\n\n\n\nalpha\n\n\n"}