{"entry_id": "http://arxiv.org/abs/2303.07318v1", "published": "20230313173943", "title": "The Masses of Supernova Remnant Progenitors in M33", "authors": ["Brad Koplitz", "Jared Johnson", "Benjamin F. Williams", "Mariangelly Diaz-Rodriguez", "Jeremiah W. Murphy", "Margaret Lazzarini", "Joseph Guzman", "Julianne J. Dalcanton", "Andrew Dolphin", "Meredith Durbin"], "primary_category": "astro-ph.HE", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "text": "\n\n\n\nM33 SNR Progenitor Masses\nKoplitz et al.\n\nBrad Koplitz \nbmk12@uw.edu\n\n0000-0001-5530-2872]Brad Koplitz\nDepartment of Astronomy, Box 351580, \nUniversity of Washington, Seattle, WA 98195, USA\n\n0000-0002-2630-9490]Jared Johnson\nDepartment of Astronomy, Box 351580, \nUniversity of Washington, Seattle, WA 98195, USA\n\n0000-0002-7502-0597]Benjamin F. Williams\nDepartment of Astronomy, Box 351580, \nUniversity of Washington, Seattle, WA 98195, USA\n\n0000-0002-4652-5983]Mariangelly Díaz-Rodríguez\nDepartment of Physics, Florida State University,\n77 Chieftan Way, Tallahassee, FL 32306, USA\n\n\nDepartment of Physics, Florida State University,\n77 Chieftan Way, Tallahassee, FL 32306, USA\n\n0000-0003-3252-352X]Margaret Lazzarini\nCalifornia Institute of Technology, \n1200 E California Blvd., Pasadena, CA 91125, USA\n\n0000-0001-8878-4994]Joseph Guzman\nDepartment of Physics, Florida State University,\n77 Chieftan Way, Tallahassee, FL 32306, USA\n\n0000-0002-7502-0597]Julianne J. Dalcanton\nCenter for Computational Astrophysics, Flatiron Institute, \n162 Fifth Ave, New York, NY 10010, USA\nDepartment of Astronomy, Box 351580, \nUniversity of Washington, Seattle, WA 98195, USA\n\n0000-0001-8416-4093]Andrew Dolphin\nRaytheon Technologies,\n1151 E. Hermans Road, Tucson, AZ 85706, USA\nSteward Observatory, University of Arizona,\nd933 N. Cherry Avenue, Tucson, AZ 85719\n\n0000-0001-7531-9815]Meredith Durbin\nDepartment of Astronomy, Box 351580, \nUniversity of Washington, Seattle, WA 98195, USA\n\n\n\nUsing resolved optical stellar photometry from the Panchromatic Hubble Andromeda Treasury Triangulum Extended Region (PHATTER) survey, we measured the star formation history (SFH) near the position of 85 supernova remnants (SNRs) in M33.\nWe constrained the progenitor masses for 60 of these SNRs, finding the remaining 25 remnants had no local SF in the last 56 Myr consistent with core-collapse SNe (CCSNe), making them potential Type Ia candidates.\nWe then infer a progenitor mass distribution from the age distribution, assuming single star evolution.\nWe find that the progenitor mass distribution is consistent with being drawn from a power-law with an index of .\nAdditionally, we infer a minimum progenitor mass of from this sample, consistent with several previous studies, providing further evidence that stars with ages older than the lifetimes of single 8 stars are producing supernovae.\n\n\n\n\n\n\n\n§ INTRODUCTION\n \n\nStellar evolution theory predicts that stars with a mass above ∼8 will end their lives as 1core-collapse supernovae (CCSNe) <cit.>.\nThe precise value of this lower limit has been the subject of multiple studies, some of which have found that red supergiants with masses 1as low as 7 1can be progenitors for Type IIP SNe <cit.>.\n\nIn addition to the uncertainty surrounding the lower mass limit of SN progenitors, there has been growing evidence that not all stars with masses >8 experience a canonical 1CCSNe (e.g. ).\nFor example, stellar evolution theory suggests that there is an upper mass cutoff of ∼30 for Type II SNe <cit.>.\nObservations, however, point to a new smaller upper limit of 17 - 19 <cit.>.\nThis discrepancy, along with the lack of high-mass progenitors in observations, was dubbed “the red supergiant problem” by <cit.>, who first argued that the discrepancy is statistically significant.\nMore recently, <cit.> suggested that some of the discrepancy can be attributed to the steepness of the luminosity-distribution of red supergiants as well as the small sample size.\nThey suggest the problem may not be as significant as previously believed, but also find a similar upper limit of 19^+4_-2 M_⊙.\nAbove this mass limit, some stars may instead collapsed straight into a black hole <cit.>.\nThese “direct collapse” systems would not produce a visible SN or leave behind a visible remnant.\nThe first observed black hole formation candidate occurred in the star-forming galaxy NGC 6946 <cit.>.\n<cit.> and <cit.> used the local stellar populations of the vanishing star to determine the progenitor was likely ∼10.6 Myr old which a single star progenitor points to an initial mass of ∼17 M_⊙.\n\nFurther progress on understanding the fates of massive stars requires increasing the number of CCSNe progenitors with mass constraints and expanding the measured distribution of progenitor masses to wider ranges of galaxy properties.\nThe traditional method for determining the mass of SNe progenitors is by directly imaging the progenitor stars (e.g. ).\nThis technique requires high resolution (better than ∼0.1\") images of the SN site both before and after the event, which involves a large amount of serendipity.\nThe difficult requirement of having spatially resolved photometry of the location before the explosion has resulted in only 34 SNe having their progenitor masses determined by this method, along with 140 upper limits constrained (;1). \nWhile the number of cataloged SNe has increased in recent years (e.g. ), few of these SNe have had their progenitor constrained due to insufficient precursor imaging.\n\nAn alternative method, which doesn't require pre-explosion images, uses an age-dating technique of the stellar populations surrounding a SN event <cit.>.\nThis technique leverages the stellar populations surrounding a SN to measure the local 1star formation history (SFH) by finding the model age distribution that best fits the color-magnitude diagram (CMD) of the resolved local stars.\nBy assuming the progenitor star belongs to the median population near the event, we are able to place statistical constraints on the age of the SN progenitor.\nWe can then infer the most likely mass of the progenitor by assuming that it was the most massive star that survives to that age according to the models.\n\nThis age-dating technique was shown to be a reliable way to infer progenitor ages for distances out to ∼8 Mpc <cit.>.\nAssuming only stars with masses ≳7 become CCSNe requires photometry that is sensitive to populations as old as 56 Myr <cit.>.\nBecause the technique does not require precursor imaging, it can be applied to any location where a SN has occurred in the recent past, including any known 1SN remnants (SNRs).\nAs a result, several previous works have shown that most young stars within 50 pc of a SN event are associated with the progenitor <cit.>.\nFor example, this technique was used to constrain the masses of SNR progenitors in the local star-forming galaxies M31 <cit.>, NGC 6946 <cit.>, as well as the Magellanic Clouds <cit.>.\nThis technique has also been used to constrain the mass of observed CCSNe <cit.>.\nProgenitor masses in M83 have also been constrained, including one with a most likely mass of 59 whose errors exclude ages older than 8 Myr, the highest mass progenitor inferred from the technique to date <cit.>.\n\nM33, or the Triangulum Galaxy, is an excellent target for our technique.\nIt is nearby, relatively face-on (i = 56; ), and is known to host over 200 SNRs <cit.>.\n<cit.>, hereafter J14, has already applied this technique to 33 SNRs in M33, finding that the distribution was well-fit by power-law distributions with indices that were significantly steeper than a standard Salpeter initial mass function power-law index of -2.35 <cit.>.\nHowever, their analysis in M33 was limited by the heterogeneous set of archival Hubble Space Telescope (HST) images available.\nThis heterogeneous coverage resulted in inconsistent filter coverage and photometric depths between observations containing SNRs.\nFurthermore, they did not fit a separate field star component to their ages, which could have resulted in age biases.\nHere, we follow-up on their work using the deep, uniform coverage provided by the 1Panchromatic Hubble Andromeda Treasury Triangulum Extended Region (PHATTER) survey <cit.> as well as updated fitting techniques.\n\nThe analysis we present here takes advantage of the work by <cit.>, hereafter DR18, who developed a Bayesian Hierarchical analysis capable of constraining the progenitor mass distribution index with an improved method for accounting for background effects as well as the minimum and maximum mass at which a star is able to undergo a CCSNe event from a set of SFHs.\nThey reanalyzed the SFHs from J14 as well as those from <cit.> which correspond to likely SNRs from <cit.>, finding a progenitor mass index closer to, but not consistent with, a Salpeter index (-2.96^+0.45_-0.25).\nThis combined M31 and M33 distribution pointed to a minimum mass of ∼7.3 and a maximum mass of >59 M_⊙.\nHowever, they found the SFHs from M31 led to a Salpeter progenitor mass distribution index (-2.35^+0.36_-0.48) with a minimum mass of 6.5 and a maximum mass of >46 M_⊙.\n\nIn this paper, we take an updated look at the ages of SNR progenitors in M33 using resolved stellar photometry from the PHATTER survey.\nOur larger sample and more homogeneous photometry catalog allow us to compare different fitting methods and quantify the impact these changes have on the age and mass results.\n1Additionally, we compare our custom SNR centered SFHs to those measured by <cit.> in grids, allowing us to determine whether grid SFHs are sufficient for inferring a progenitor age and mass.\nThe rest of the paper is outlined as follows:\nSection <ref> details our SNR source catalog, as well as how our SFHs were measured.\n1Section <ref> presents our progenitor age and mass estimates.\nIn Section <ref>, we discuss our constraint on the lower mass limit for CCSNe as well as the results of Kolmogorov-Smirnov (KS) tests on our observed distribution, then compare our results to similar studies in the literature.\nFinally, Section <ref> provides a short summary of our results. \nThroughout this paper, we assume a distance to M33 of 859 kpc <cit.>.\n\n\n\n§ DATA AND ANALYSIS\n \n\nOur technique has two main data requirements. \nFirst, we need to know the locations of past SN activity.  \nSecond, we require resolved stellar photometry of the current populations within 50 pc of the SNe, as stars tend to remain spatially correlated within about 100 pc of their siblings for about 100 Myr, even if the cluster is not gravitationally bound <cit.>.\nUsing these we can measure the star formation rate as a function of lookback time, known as the star formation history (SFH), at each SNR location.\nThe SFH provides the age distribution of the stars near each SN.\nWe then apply this age distribution to constrain the age and mass of the progenitor star.\nWe detail each of these steps below.\n\n\n\n §.§ SNR Locations\n \n\nFor the locations of past SN activity in M33, we take the locations of SNRs from the catalogs of <cit.> and <cit.>, hereafter L10 and LL14, respectively.\nL10 identified candidates based on their X-ray spectrum as well as having [S II]:Hα ratios ≥0.4.\nThe candidates in LL14 were identified based on their lack of blue stars, remnant morphology, and [S II]:Hα ratios ≥0.4.\nOf the 137 SNR candidates in L10, 120 are included in LL14's catalog of 199 candidates.\nThe remaining 17 locations were classified as likely superbubbles or H II regions, leading LL14 to exclude them from their final catalog.\nOf these 17 potential SNRs, 4 (L10-043, L10-050, L10-079, L10-098) are within the PHATTER survey footprint.\nWe include these 4 locations in our catalog since they may be SNRs located within larger star forming complexes.\nOf the 199 candidates from LL14, 81 reside in the PHATTER footprint, leading to our catalog of 85 SNR candidates.\n\nIn addition to the SNR locations, we produced 12 control 1catalogs of locations not associated with SNRs.\n1The first sample is 85 locations randomly distributed within the PHATTER footprint.\nThe second sample is 2,500 random draws of the grid SFHs from <cit.> which do not contain a SNR.\nDifferences between the random and SNR samples provide additional evidence that the stellar populations near the SNRs are likely related to the progenitors, and not chance spatial coincidences of young stars (see Section <ref> for details).\n\n\n\n §.§ Photometry\n \n\nOnce we had determined the historical SN locations, the second requirement was resolved stellar photometry at those locations.\nThis photometry was obtained from the PHATTER survey <cit.>.\nThe survey measured resolved stellar photometry for 22 million stars within M33 in optical (Advanced Camera for Surveys F475W and F814W), near-ultraviolet (Wide Field Camera 3 F275W and F336W), and near-infrared (WFC3 F110W and F160W) bands.\nOur photometry is derived from the optical images (F475W and F814W) of the PHATTER survey, rather than measure photometry in all 6 bands simultaneously.\nWe took samples from this photometry catalog for each SNR location and each control location, with the samples consisting of all of the stars within 50 pc (12”) from the SNR or random position.\nWe also collect samples of the wide spread young populations surrounding each SNR from 50 pc to 1000 pc (12” to 4').\nThese “background” samples allow us to identify young populations unique to the region containing the SNR.\n\nTo fit stellar evolution models to the photometric data, we require artificial star tests to correctly model the photometric completeness and uncertainty as a function of color and magnitude.\nWe used the artificial star tests from these data that were created by <cit.>, who used them to measure grid SFHs in M33, as discussed in Section <ref>.\nThese tests are obtained by adding stars of known flux to an image and blindly rerunning the photometry routine to measure the photometric bias, uncertainty, and completeness as a function of color and magnitude when fitting models to the data.\nThis is done at least 50,000 times within a region of interest.\n<cit.> and <cit.> found that one set of artificial stars could be used for all locations of similar stellar density, rather than creating a set for each location.\nThis greatly reduces the computation time required.\n<cit.> used this technique to optimize the number of ASTs that needed to be created.\nSince we are using the same photometry catalog as <cit.>, we are able to use the same ASTs when analyzing the SNRs in our catalog.\nThese tests and the optical photometry catalog are described in further detail in <cit.>.\n\n\n\n §.§ CMD Fitting\n\n\nOnce we had the photometry and artificial star tests necessary to study each SNR location, we used the CMD fitting program MATCH <cit.> to measure SFHs near the SNRs in our catalog.\nMATCH has been used to constrain the age of SN progenitors (e.g. J14; ) and SFH for nearby galaxies (e.g. ).\nMATCH fits the observed CMD using the PARSEC stellar evolution models <cit.>.\nFor each model age and metallicity, it creates a model CMD by assuming a Kroupa initial mass function <cit.>.\nIt then finds the highest likelihood linear combination of those models that provides the best-fit to the observed CMD using a maximum likelihood estimator and taking into account the bias, uncertainty, and completeness of the photometry as determined by artificial star tests.\nThis combination of models yields the distribution of ages and metallicities for the stars in the observed CMD, which we refer to as the SFH of the region.\n\nBelow, we provide a brief description of our technique for running MATCH.\nA more detailed account of the process can be found in <cit.>, which is identical to how we ran MATCH here.\nIn short, for each SNR location, we fit the CMD of the resolved stellar photometry with a grid of model CMDs generated from the PARSEC stellar evolution models <cit.>.\nOur model grid had time bins of size 0.05 dex from log_10(t/yr) = 6.6 to 8.0 while bins of size 0.1 dex were used from log_10(t/yr) = 8.0 to 10.2.\nSince M33 is known to have a sub-solar metallicity (e.g. ), we limited the metallicities MATCH applies to the model grid to be -0.5 ≤ [Fe/H] ≤ 0.1 using the zinc flag.\nMultiple massive stars can reside in the same location on CMDs even though they have different metallicities.\nAs a result, using the zinc flag forces MATCH to use models for the young stars that are within the known metallicity range of M33.\n\nAs in <cit.>, our model also includes a “background” or “contamination” CMD of the stars in an annulus between 50 - 1000 pc (12” - 4') from the SNR.\nThe contamination CMD is scaled to the size of our regions before fitting.\nThis allows use to identify young populations which are sparse in the surrounding field and more heavily weight the populations concentrated within the regions being fit.\n\nFurthermore, the fitting routine accounts for the effects of dust on the photometry.\nWe allowed MATCH to find the combination of reddening parameters, along with the combination of ages and metallicities, that provided the best fit to the observed CMD. \nSince young populations are often found in dusty regions, MATCH applies three types of extinction to the model CMDs when fitting the stellar populations.\nThe first, A_V, is the total foreground extinction over the full region.\nThe second, dA_V, is the extinction spread due to the stars along the line of sight.\nThe third, dA_VY, is additional differential extinction added to populations younger than 100 Myr old.\nThe default dA_VY value of 0.5 was used.\nTo determine A_V and dA_V for a SNR, we fit a range of possible values at the location.\nWe allowed A_V to be between 0.05 and 1.00 in steps of 0.05 while dA_V could be between 0.0 and 2.0 in steps of 0.2.\n\nOn average, our locations returned an A_V value of 0.30, higher than the <cit.> value of 0.114.  This higher A_V is not surprising given that MATCH takes into account the Milky Way and M33 reddening whereas <cit.> only accounts for the Milky Way.\nThe vast majority of dA_V values in our sample were 0.0, meaning the default differential reddening for the youngest stars (dA_VY = 0.5) was sufficient to account for differential reddening in most cases.\n\n\n\n §.§ Uncertainty Estimation\n\n\nRandom and systematic uncertainties are inherent to fitting stellar models to CMDs.\nMost of the random uncertainties in our fits arise from photometric errors as well as the number of stars used to determine the most likely progenitor age.\nThe systematic uncertainties are from any deficiencies present in the stellar evolution models used during the SFH fits.\n<cit.> has shown that there is good agreement between models sets for fits to young ages, and that the random uncertainties dominate the error budget in these fits.\nThus, we use the random uncertainties determination to estimate the uncertainties in our SFHs.\n\nTo estimate our random uncertainties, we used the  tool within MATCH <cit.>.\nThis task uses a hybrid Monte Carlo algorithm to accept or reject potential SFHs around the best-fit SFH based on likelihood.\nWe report the narrowest 68% of the distribution of accepted SFHs that decreases with look-back time in columns (4) and (5) of Table <ref>.\nA detailed description of how our uncertainties are estimated can be found in Section <ref>.\n\n\n\n §.§ SFHs from Previous Work\n \n\nRecently, <cit.> published recent SFH maps of the PHATTER region of M33.\nThey used the same PHATTER optical photometry to measure the SFH of M33's inner disk in a grid of 100 x 100 pc (24” x 24”) cells, which they have released to the community.\n<cit.> largely used the same MATCH fitting technique as we have, but there were a few differences.\nIn their analysis, time bins of size 0.1 dex were used for all bins (log_10(t/yr) = 6.6 to 10.2).\nSince they were measuring the total amount of star formation in each location, and not attempting to isolate very localized populations, a contamination CMD was not included during their fits.\n\nBeing able to constrain progenitor masses using such a grid of spatially-resolved age distributions would be very powerful, since it would avoid having to access the original photometry and artificial star tests and run custom fitting for each SNR location.\nThus, we also attempted to age-date the SNR locations using this grid of published SFHs by assigning a SFH from <cit.> that corresponded to the location of each SNR in our sample.\nWe then compare the ages and masses of custom fits to those taken from a less optimized, but more easily accessible, source.\n\n\n\n §.§ Constraining Progenitor Mass\n \n\nThe next step in constraining the masses of SNR progenitors is to convert the recent SFH from MATCH into a probability distribution for the age of the progenitor.\nThis calculation is done by determining the fraction of the total stellar mass present in each age bin.\nWe take this fraction to be equal to the probability that the progenitor is associated with that age.\nWe also take the error on that fraction as the error on the probability.\nWe provide an example of such a probability distribution in Table <ref>.\n\nThe age probability distribution presented in Table <ref> is for the SNR LL14-060.\nSimilar tables for each SNR with SF in the last 56 Myr are combined into one and made available in the online supplemental material.\n\nWhile the age probability distribution derived from the SFH is the most complete constraint on the progenitor age, we also provide a single progenitor mass estimate with uncertainties.\nThis age simplifies the mass inference, as well as comparisons with other measurements and mass distribution analysis.\nTo derive the most likely progenitor age, we use the SFHs and uncertainties produced by MATCH to calculate the median age of the stellar populations younger than 56 Myr surrounding each SNR.\nWe then take that age as the most likely progenitor age.\nWe determine the uncertainties on the median age as follows.\nWe recalculate the median age a million times by accounting for the uncertainties and resampling the SF rates in each time bin, then determine the narrowest 68th percentile of this distribution of ages which contain the best-fit. \nWe use a 56 Myr cut off for our SNR centered SFHs, rather than the 50 Myr used by other works, because of the results of our Bayesian analysis presented in Section <ref>.\n1A 56 Myr (log(t/yr) = 7.75) cut off is not possible for the grid SFHs since <cit.> ran MATCH with time bins of 0.1 dex.\n1As a results, we must decide whether to use a 50 or 63 Myr cut off (log(t/yr) = 7.7 or 7.8) 1for the grid SFH samples.\nWe adopt a 50 Myr cut off as this limits the number of contamination populations being included in our analysis.\nTo infer the progenitor mass for each age bin, we assume that the SNR progenitor is the highest surviving mass on the PARSEC stellar isochrone <cit.>.\n\nWe present an example of our progenitor age fitting results for SNR LL14-160 in Figure <ref>.\nSimilar summary plots are available for all of the SNR locations in the online supplemental materials associated with the paper.\n\nPast studies have shown that 1progenitor masses estimated from the SFHs produced by MATCH are consistent with estimates from other techniques (e.g. ).\nDR18 found that their combined M31 and M33 distribution pointed to a minimum mass for CCSN progenitors of ∼7 M_⊙, which corresponds to an age of ∼50 Myr assuming single star evolution.\nPopulations older than this are more likely to be unrelated to the SNR since they have had more time to distance themselves from their parent cluster.\nOlder stars in 1binaries have been shown to be possible SN progenitors (e.g. ); however, our current inference from age to mass requires that we assume single star evolution.\nFortunately, this assumption should not impact our age constraints, which come from the surrounding population, but it could significantly impact our conversions between age and progenitor mass if the progenitor system was a mass-exchanging binary.\n\n\n\n§ RESULTS\n \n\nWe present and provide the progenitor mass results from our own custom SFHs.\nWe then compare to results that we obtain from previously published SFHs, as well as control samples and results from SNR studies of other nearby galaxies.\nThese comparisons suggest that custom SFHs 1with a contamination CMD included in the fit to account for the more widespread populations are required to isolate the ages of the stars most likely associated with each SNR.\n\n\n\n §.§ Comparing Grid SFHs to SNR Centered SFHs\n \n\nWe present our progenitor mass constraints 1for the SNRs in our catalog in Table <ref> 1and compare the resulting age distributions in Figure <ref>, which reveals that the 2masses from <cit.> are systematically lower than our custom measurements.\nFor 42 of the 85 locations in our catalog (∼49%) the best-fit masses were not consistent with each other.\nKS-tests between these samples returned a p-value of 0.11, suggesting 1we cannot rule out that they are from the same parent distribution.\n\n1To isolate the cause of the observed difference, we reran our custom fits without including a contamination component, which returned a distribution similar to the one from the <cit.> grid SFHs.\nPerforming KS-tests between the SNR centered distributions returned a p-value of 0.09 while 0.27 was returned when comparing the grid distribution to the SNR centered without a contamination CMD sample.\nFigure <ref> is a histogram comparing the distribution of progenitor masses that resulted from using the grid SFHs as well as the SNR centered SFHs with and without a contamination CMD.\nEach distribution is normalized such that they integrate to one.\nThe overall distribution from the grid SFHs is similar to that of our centered SFHs without a contamination CMD, which is expected given that both SFHs were fit without a contamination CMD and the sample populations overlap.\n\n1Even though none of the distributions contain a progenitor that excludes masses <20 M_⊙, the grid SFHs produced 10 locations consistent with being more massive than 20 M_⊙ while the SNR centered SFHs returned 15 with a contamination CMD and 9 without one.\nA similar fraction of locations with masses between 7 - 15 and 15 - 25 were found in the grid and SNR centered without a contamination component distributions (86%, 13% and 86%, 11% respectively).\nThese show that the inclusion of the contamination CMD impact the resulting distribution the most, though the high-precision custom location does play a large role.\n  \n\n\n §.§ Type Ia Candidates\n  \n\nOf the 85 locations in our catalog, 1we classify 25 as Type Ia candidates.\n<cit.> showed that binaries with ages down to 200 Myr can produce delayed CCSNe; however, these systems have had enough time to move a significant distance away from their parent cluster, making the SF we measure older than ∼56 Myr likely contaminated by nearby populations that are not associated with the SN event.\nThus, any location without SF in the last ∼56 Myr we classify as Type Ia candidates since our technique cannot reliably determine the progenitor age beyond this.\n\nIncluding contamination CMDs in our SFH fits forces MATCH to only fit for SF above any 1background young stellar populations.\nWhile this requirement can be helpful in isolating populations more likely to be associated with an SNR, it can also cause some SNRs to be classified as Type Ia candidates when they are actually Type II or Type Ibc in origin, because their associated young population may be too similar to that of the larger surroundings.\nTo check how many of our Type Ia candidates could actually be CCSNe, we can use our results from the <cit.> SFHs which measured the total star formation in each location.\nThe SNRs with mass estimates in 1column (9) of Table <ref> but without a constraint in 1column (7) are less likely to be Type Ia in origin, as there are relatively high mass populations nearby, just not above the background level.\nOf the 25 Type Ia candidates from our SNR centered SFHs, only LL14-103's grid SFH contained no SF within the last 56 Myr, making it our best Type Ia candidate.\nThe other 24 Type Ia candidates had young stellar populations present but not in sufficient quantities to be detected above the larger surroundings, making them weaker Type Ia candidates.\nThese results suggest a Type Ia fraction between 1 - 29%.\nWhile this is not a tight constraint, it is consistent with the ∼15% expected for late-type spirals <cit.>.\n\n\n\n§ DISCUSSION\n \n\nOur progenitor age distributions probe the minimum mass at which CCSNe can occur, how SNe are spatially distributed in the disk of M33, and the power-law index of the progenitor mass distribution for the galaxy.\n\n\n\n §.§ Mass Limits for CCSNe\n \n\nUsing the Bayesian Hierarchical analysis developed by DR18, 1we use our SNR age sample to provide a constraint on the maximum age at which stars undergo CCSNe, t_max.\nOur analysis was sensitive to the assumed minimum age for CCSNe, t_min.\nTo account for this, we fit our distribution assuming t_min values of 6, 9, 10, 12, 15, and 18 Myr, with each returning similar results.\nWe report the t_min = 15 Myr fit since this is the lowest t_min value that stabilized the returned progenitor mass distribution slope, finding Myr as the best-fit t_max which corresponds to a M_min of M_⊙.\nFigure <ref> shows the distribution of t_max (left) and M_min (right) returned by the Bayesian analysis for the fit with t_min = 15 Myr.  \n\nThe analysis also attempts to constrain the upper mass 1limit for CCSNe and the progenitor mass distribution index when fitting a distribution.\nOur high mass progenitors, however, have large error bars which prevented the analysis from converging on 1a rigorous best-fit value for 1the upper mass limit.\nSince the upper mass is degenerate with the distribution index, it also did not return a reliable index.\nWe estimate the progenitor mass distribution index in Section <ref> using an alternate technique since it may be of interest to the community.\n\n\n\n §.§ Spatial Distribution of Progenitor Masses\n\n\nTo investigate the spatial distribution of SNRs in M33, we plot the locations of our catalog on an Hα image taken with the WIYN 0.9m telescope (Figure <ref>).\nThe progenitor mass and most likely SNe type are indicated by the color and symbol, respectively.\nLocations for which we have mass constrains in 1column (7) of Table <ref>, i.e. were able to measure SF within the last 56 Myr above the background level, are shown as circles.\nProgenitors with masses <9 are white, masses of 9 - 12 are red, masses of 12 - 15are orange, masses of 15 - 20 are yellow, and masses >20 are blue.\nOur Type Ia SNe candidates are shown as squares, where the color indicates the best-fit progenitor mass from the grid SFH that the SNR resides in from <cit.>.\n1The color show the mass that could have produced a CCSNe at the location, though these are less likely to be CCSNe than the colored circles due to the lower level of young SF.\nThe coloring depicts the same mass ranges as the circles, with the addition of black indicating 1the location of LL14-103, our best Type Ia candidate.\n\nOur entire catalog mostly traces the Hα emission and spiral arms of M33.\nThere are many squares (Type Ia candidates) inside star forming regions throughout the galaxy, indicating that young populations are present, just not enough to be detected in fits that include a contamination component.\nIn these cases, 1fitting without a contamination CMD (i.e. fitting the full population) often find some massive stars in the region when the contamination CMD included fit finds no such populations.\n\n\n\n §.§ Progenitor Mass Distribution Power-Law Index\n \n\nWhile the Bayesian Hierarchical analysis of DR18 was not able to converge on a power-law index for the progenitor distribution due to the uncertainties at very young ages, it may still be of interest to determine the closest power-law representation of our most likely progenitor masses.\nTo determine this value, we use KS-tests to determine the likelihood 1the locations in our catalog 1with young populations (<56 Myr) are drawn from various power law distributions.\nWe compared the data to power-law indices between -6.0 and 0.0, in steps of 0.1, and report the most likely index.\n1To estimate the uncertainties on the index, we employee a bootstrap analysis in which we sample the uncertainties on each mass 1,000 times.\nWe then find the indices which return p-values ≥0.05 (∼95% confidence) and report the extremes as our limits.\n\nPerforming this analysis on our full catalog of SNRs indicates the progenitor mass distribution is best matched by a power-law with an index of , which does contain the Salpeter index of -2.35 <cit.>.\nThe best-fit index 1has a p-value of 0.23.\n1Running the progenitor mass distribution from the grid SFHs through this same analysis 1found that the sample was best matched by an index of -3.8^+1.8_-0.4, significantly steeper than our SNR centered catalog 1though still consistent.\nThis is not surprising given that, as discussed in Section <ref>, L10-043 was the only progenitor found to be more massive than 25 M_⊙ 1in this sample.\n\n1Our power-law indices were estimated using only the locations that contained SF at ages younger than ∼56 Myr.\nTo estimate the impact that removing locations without young SF has on our indices, we refit the progenitor mass distribution index of our SNR centered sample while adding in the grid SFH progenitor mass for locations that did not contain young SF in our custom fit.\nThis combined sample was best-fit by a -3.2^+1.3_-0.6 index, which consistent with both the SNR centered and grid SFH indices.\nThis indicates that removing locations without young SF does not have a large impact on the returned progenitor mass distribution index.\n\nFigure <ref> shows our ranked progenitor mass distribution. \nThe red points indicate the progenitor mass of each SNR with a constraint in 1column (7) of Table <ref>, with uncertainties shown as red lines.\nOverplotted as gray lines are 50 draws from a power-law distribution with an index of , our best-fit index.\n\n\n\n §.§ Control Sample\n\n\nAs mentioned in Section <ref>, we also performed our analysis on control samples, random locations that did not contain SNRs.\n1We compared our SNR results to these control results to determine if the SNRs are indeed affecting our results.\nWe discuss both the control sample for the mass estimates based on custom SFH measurements and the control samples for mass estimates based on <cit.> SFH measurements below.\n\nOur first control sample, 1containing randomly drawn locations in the PHATTER footprint, returned fewer progenitors with masses >20 (5 in the control sample and 9 in our catalog).\nThere were also significantly more (133, ∼39% of the sample) Type Ia candidates (i.e. locations with no significant recent star formation above what is present in the contamination CMD) 1than our SNR centered distribution with a contamination CMD (25, ∼30% of the sample).\nBoth of these suggest that the regions in this control sample contained, on average, older populations than those found near SNRs.\n1The locations in this sample that contained SF at ages younger than 56 Myr were best-fit by a power-law index 1of -4.9^+3.2_-0.2, which is consistent with our contamination CMD and 1the grid distributions.\n1While the uncertainties do overlap, this can likely be attributed to the amount of wide spread SF within the PHATTER footprint of M33.\nComparing this random sample to our SNR centered sample returned a p-value of 0.08, suggesting these sample are only marginally consistent with being drawn from the same parent distribution.\n\nOf the 2,500 random draws in the grid control sample, ∼70% were consistent with the grid power-law index, with the remaining ∼30% resulting in steeper indices.\n1We found the median index to be -4.1 ± 0.5, which includes the grid SFH sample index of -3.8 but excludes the SNR centered index of -2.9, though the uncertainties do overlap.\nOf the 2,500 draws, 1,492 (∼60%) resulted in p-values ≤0.05 when compared to our grid sample.\nNo p-values ≥0.05 where found when compared to the SNR centered sample.\nAdditionally, our grid sample only contained 1 location without recent SF (LL14-103) whereas only 3 of the grid control draws contained as main or fewer such locations.\nMeaning that >99% of random draws had more locations without young stars present than we find in locations containing SNRs.\nThese results show that the grid SFHs that contain SNRs do differ from those that lack an SNR, 1with the similar power-law indices likely being explained, again, by the amount of wide spread SF in M33.\n\n\n\n §.§ Comparison to J14 and DR18\n \n\nJ14's catalog contained 33 SNRs in M33, of which 28 are in the PHATTER footprint.\nOur SNR centered progenitor mass estimates were consistent with those found by J14 for 16 of these 28 sources.\nOf the 12 sources that were not consistent between our estimates and those in J14, we identify 8 Type Ia candidates.\n1J14 found their full distribution of 33 SNRs was best-fit by an index of -3.8^+0.5_-0.4.\nUsing our SNR centered SFHs of the 28 overlapping locations, our analysis pointed to the distribution being well matched by a power-law index of -3.1^+1.2_-1.1, which is flatter than what J14 found.\nTheir steep index 1could be from the few progenitors with masses >20 1in their sample, which can likely be partially attributed to the low number of SNRs in their sample. \n1Poisson fluctuations for small numbers can randomly vary to zero quite easily.\nAdditionally, J14 did not include a contamination CMD when fitting, which may have biased their estimates towards older, less massive populations and reduced their number of Type Ia candidates.\nWe have shown 1in Section <ref> that CMD-based age-dating returns more low mass progenitors when no background CMD is included in the fitting.\nDR18 constrained the minimum mass for CCSNe to be 7.32^+0.12_-0.14 M_⊙ using the J14 measurements, which is consistent with the minimum mass we identified, suggesting that this cutoff may be the most reliable parameter returned from the SNR sample.\n\n\n\n §.§ Comparison to Other Galaxies\n \n\nIn addition to the SNRs in M33, J14 also constrained the progenitor mass distribution for 82 SNRs in M31 using photometry from the PHAT survey.\nTheir KS-test analysis found that this distribution was best matched by a power-law index of -4.4^+0.4_-0.4, which is not consistent with our distribution.\nInterestingly, one major difference between J14 and DR18 is that DR18 allows for a uniform background distribution when fitting for the progenitor mass distribution parameters.\nThis should have a similar 1effect to the use of a contamination CMD during the fitting process in that it accounts for the possibility that some of the measured SF may not be associated with the SN.\nWith the inclusion of the uniform background distribution, DR18 constrained the distribution index to be -2.35^+0.36_-0.48 and found the minimum mass for CCSNe to be 6.5^+0.6_-0.2 using 62 SNRs in M31.\nBoth of 1these measurements are consistent with what we 1have found in M33.\n\n<cit.> gathered the progenitor masses for 40 SNRs in the Milky Way and both Magellanic Clouds from the literature that were estimated using chemical abundances.\n1They updated many of the measurements using Fe:Si ratios and found a progenitor mass distribution consistent with both a Salpeter index and our measured index for M33.\n\n<cit.> examined 23 SNRs in the Small Magellanic Cloud, finding that 22 were likely core-collapse in origin.\nThey report the likelihood that the mass of each progenitor is between 8-12.5 M_⊙, 12.5-21.5 M_⊙, and >21.5 M_⊙ assuming single and binary evolution.\nRegardless of single or binary evolution, 170% of their progenitors had the highest likelihood in the most massive bin, whereas 19% of our SNRs were found to have progenitor masses in this range.\nThe large number of high mass progenitors led to their distribution being well matched by a power-law index of -1.84, though the uncertainties are consistent with a Salpeter index.\nA possible reason given by <cit.> for the top-heavy distribution is that the Small Magellanic Cloud has a lower metallicity than M33. \nIt has been shown that lower metallicity gas is more likely to produce a top-heavy stellar distribution (e.g. ).\n\n<cit.> constrained the progenitor mass of 199 SNRs in M83 using our technique.\nThey found that the progenitor mass distribution was well matched by a power-law index of -2.9^+0.2_-0.7.\nA KS-test between their M83 distribution and ours resulted in a p-value of 0.04, suggesting their parent distributions may differ, 1possibly due to the higher star formation intensity or lower metallicity of M33.\n\n<cit.> measured the progenitor mass of 169 SNRs, 8 historically observed SNe, and NGC6946-BH1, the first black hole formation candidate, in the galaxy NGC 6946 using our technique.\nThey found that gas emission impacted their broad V-band photometry, which biased some of their mass estimates.\nAs a result they only included the 46 sources that were least likely to be biased when constraining the progenitor mass distribution index.\nIn this sample they found 124% with masses ≥20 M_⊙, while we have 111% progenitors in our catalog with similar masses.\nThey found their distribution was best-fit by an index of -2.6^+0.5_-0.6, which is consistent with our 1measured index.\nKS-tests between their preferred sample and our distribution resulted in a p-value of 0.2.\n\nFigure <ref> compares our distribution of progenitor masses to those in M83 <cit.> and the preferred sample in NGC 6946 <cit.>.\nWe normalize each individually so that they integrate to one.\nEach is dominated by the low mass progenitors and those less massive than 25 have similar overall shapes.\nThese led to power-law indices that are consistent with each other.\nOur distribution is the only that lacks any progenitors with mass ≥40 M_⊙.\nHowever, this 1could be the result of the small number of high mass progenitors expected combined with the smaller number of SNRs in 1our sample.\n\n\n\n§ SUMMARY\n \n\nWe constrained the progenitor age and mass of 60 SNRs in the nearby galaxy M33, or the Triangulum Galaxy, using an age-dating technique of the stellar populations near the SNRs.\n1The remaining 25 showed no local SF within the past 56 Myr, making them potential Type Ia candidates.\nWhile it is possible that these candidates are binary systems producing delayed CCSNe with ages down to 200 Myr, our analysis is not able to reliably determine the progenitor age beyond ∼56 Myr.\n\nUsing the Bayesian Hierarchical analysis developed by DR18, we constrained the maximum age for CCSNe to be Myr, which assuming single star evolution corresponds to a minimum mass of M_⊙.\nA KS-test analysis determined that the progenitor mass distribution of our full catalog was best-matched by a power-law distribution with an index of , which includes the Salpeter index 1of -2.35.\nOur distribution is well populated by progenitors with masses 19 - 40 M_⊙. \n\nWhen using grid SFHs from <cit.>, rather than 1SNR centered regions with a contamination CMD included, the inferred progenitor mass 1was biased to lower values, with only 1 progenitor more massive than 25 M_⊙.\nThere 1were also fewer Type Ia candidates when using the grid SFHs, 1 from the grid SFHs and 25 from the SNR centered SFHs.\nAdditionally, the progenitor mass distribution index that 1came from the grid SFHs 1was steeper than the index from the SNR centered SFHs 1while KS-tests between these samples returned a 0.03 p-value.\nWithout a contamination CMD, our custom SFHs returned a similar distribution to the grid, finding a p-value of 0.14 between the two samples.\nThe grid 1results differ from a random distribution of grid cells that do not contain an SNR, though not as strongly as our SNR centered sample.\nThe stronger difference from the overall background suggests that the custom SFHs with a contamination CMD provide a more robust constraint on the age and mass of SNRs than SFHs measured in grids, 1where the background populations are not taken into account and the SNR may be anywhere in the grid cell.\n\nPreviously, J14 used archival HST images to constrain the age and mass of 33 SNRs in M33.\nWe present new age and mass estimates for 28 of these using the deep, uniform photometry from the PHATTER survey.\nPerforming KS-test analysis on the SNRs with updated mass estimates pointed to the distribution being well matched by a power-law index of -3.1^+1.2_-1.1, which is consistent with the index J14 found for their full catalog 1and our sample of 85 SNRs.\n\nOur normalized progenitor mass distribution is similar to that of M83 <cit.> and NGC 6946 <cit.>.\nEach distribution is dominated by low mass progenitors and have best-fit power-law indices which are consistent with one another.\nKS-tests between our sample and the preferred sample in NGC 6946 resulted in a p-value of 0.20, suggesting that these are likely drawn from the same parent distribution. \nA p-value of 0.04 was returned when performing KS-tests between our sample and the SNRs in M83.\n1A p-value just below 0.05 and the matching power-law indices means we cannot rule out that the samples are drawn from the same parent distribution.\n\n1Each of our distributions show a sharp drop in the number of progenitors at ∼20 M_⊙.\nFew progenitors are found more massive than this, which coincides with the upper limits found by <cit.> and <cit.> for Type II SNe.\nIt is possible that the reason we do not see many high mass progenitors is because not all experience a canonical CCSNe and instead collapse directly into a black hole <cit.>.\nNow that the JWST has launched, similar studies will be able to leverage red supergiants to constrain the age of SN progenitors with higher precision and may resolve the “red supergiant problem”.\n\nSupport for this work was provided by NASA through grants GO-14610 and GO-15216 from the Space Telescope Science Institute, which is operated by AURA, Inc., under NASA contract NAS 5-26555.\n\naasjournal\n\n\nccccccccccccc \n \n0pt \n13 \nAge Probability Distribution Results for LL14-060 \n\nT1     T2     SFR(Best)     -err     +err     PDF(Best)     -err     +err     CDF(Best)     CDF(Low)     CDF(High)     M1     M2\n\n(1)     (2)     (3)     (4)     (5)     (6)     (7)     (8)     (9)     (10)     (11)     (12)     (13)\n4.0       4.5      0.0000e+00      0.0000e+00      3.0515e-03         0.000      0.000      0.263         0.000        0.000         0.035      52.1      66.6 \n\n  4.5       5.0      0.0000e+00      0.0000e+00      2.7223e-03         0.000      0.000      0.264         0.000        0.000         0.101      42.0      52.1 \n\n  5.0       5.6      9.4464e-03      7.9741e-03      1.5900e-05         0.563      0.471      0.316         0.563        0.000         0.563      34.7      42.0 \n\n  5.6       6.3      0.0000e+00      0.0000e+00      2.2637e-03         0.000      0.000      0.273         0.563        0.169         0.576      29.2      34.7 \n\n  6.3       7.1      0.0000e+00      0.0000e+00      1.8153e-03         0.000      0.000      0.252         0.563        0.218         0.613      26.0      29.2 \n\n  7.1       7.9      0.0000e+00      0.0000e+00      1.3441e-03         0.000      0.000      0.219         0.563        0.260         0.645      23.1      26.0 \n\n  7.9       8.9      0.0000e+00      0.0000e+00      1.0684e-03         0.000      0.000      0.200         0.563        0.298         0.674      20.6      23.1 \n\n  8.9      10.0      0.0000e+00      0.0000e+00      7.8472e-04         0.000      0.000      0.171         0.563        0.332         0.701      18.7      20.6 \n\n 10.0      11.2      0.0000e+00      0.0000e+00      7.4253e-04         0.000      0.000      0.179         0.563        0.365         0.727      17.1      18.7 \n\n 11.2      12.6      0.0000e+00      0.0000e+00      6.5002e-04         0.000      0.000      0.177         0.563        0.398         0.753      15.7      17.1 \n\n 12.6      14.1      0.0000e+00      0.0000e+00      5.4978e-04         0.000      0.000      0.169         0.563        0.430         0.779      14.5      15.7 \n\n 14.1      15.8      0.0000e+00      0.0000e+00      4.8213e-04         0.000      0.000      0.167         0.563        0.461         0.804      13.4      14.5 \n\n 15.8      17.8      2.2299e-03      1.9046e-03      0.0000e+00         0.420      0.363      0.381         0.983        0.699         0.983      12.5      13.4 \n\n 17.8      20.0      0.0000e+00      0.0000e+00      4.0795e-04         0.000      0.000      0.176         0.983        0.734         0.983      11.7      12.5 \n\n 20.0      22.4      0.0000e+00      0.0000e+00      3.2564e-04         0.000      0.000      0.161         0.983        0.767         0.983      10.9      11.7 \n\n 22.4      25.1      0.0000e+00      0.0000e+00      2.3611e-04         0.000      0.000      0.135         0.983        0.794         0.983      10.3      10.9 \n\n 25.1      28.2      0.0000e+00      0.0000e+00      2.2838e-04         0.000      0.000      0.144         0.983        0.845         0.984       9.6      10.3 \n\n 28.2      31.6      0.0000e+00      0.0000e+00      1.5449e-04         0.000      0.000      0.114         0.983        0.876         1.000       9.0       9.6 \n\n 31.6      35.5      4.3935e-05      4.3935e-05      1.3031e-04         0.017      0.017      0.128         1.000        0.908         1.000       8.6       9.0 \n\n 35.5      39.8      0.0000e+00      0.0000e+00      1.2988e-04         0.000      0.000      0.119         1.000        0.931         1.000       8.1       8.6 \n\n 39.8      44.7      0.0000e+00      0.0000e+00      1.1090e-04         0.000      0.000      0.115         1.000        0.953         1.000       7.7       8.1 \n\n 44.7      50.1      0.0000e+00      0.0000e+00      9.9118e-05         0.000      0.000      0.115         1.000        0.981         1.000       7.3       7.7 \n\n 50.1      56.2      0.0000e+00      0.0000e+00      9.1503e-05         0.000      0.000      0.119         1.000        1.000         1.000       7.0       7.3 \n\n Columns (1) and (2) define the beginning and end of the age bin in log_10(t/yr). Column (3) is the best-fit SF rate, in that age bin in yr^-1. Columns (4) and (5) are the lower and upper limits on that rate. Column (6) shows the fraction of stellar mass younger than 56 Myr in the age bin according to the best-fit SFH equivalent to the probability of that progenitor age. Columns (7) and (8) are the negative and positive error bars on this probability. Column (9) provides the cumulative fraction of stellar mass over time for the best-fit SFH. Columns (10) and (11) are the lower and upper uncertainties of the cumulative mass fraction for a set of a million realizations of the SFH with the uncertainties in columns (4) and (5). Columns (12) and (13) give the mass of stars with lifetimes within the age bin in M_⊙.\nTable <ref> is published in its entirety in the machine-readable format. A portion is shown here for guidance regarding its form and content.\n\n\nccccccccc \n \n0pt \n9 \nM33 Supernova Remnants \n\nID^a,b     R.A. (J2000)^a,b     Decl. (J2000)^a,b     Stars     dA_V     A_V     Mass (M_⊙)     Region ID^c     Grid Mass (M_⊙)\n\n(1)     (2)     (3)     (4)     (5)     (6)     (7)     (8)     (9) \nL10-043     01:33:35.39     +30:42:32.4     5510     0.00     0.45     17.9^+0.8_-3.4     1206     45.3^+21.3_-33.6\n\nL10-050     01:33:40.73     +30:42:35.7     7591     0.00     0.30     16.6^+2.1_-4.9     1208     14.0^+1.7_-5.9\n\nL10-079     01:33:58.15     +30:48:37.2     5115     0.00     0.35     9.0^+4.4_-0.4     1791     8.6^+3.1_-0.5\n\nL10-098     01:34:12.69     +30:35:12.0     5334     0.00     0.40     10.8^+7.9_-0.5     0534     19.5^+3.6_-10.5\n\nLL14-050     01:33:21.56     +30:31:31.1     3471     0.40     0.40     14.0^+0.5_-1.5     0178     8.1^+5.3_-0.8\n\nLL14-054     01:33:24.01     +30:36:56.8     5599     0.00     0.25     7.3^+18.7_-0.3     0686     10.6^+1.1_-2.5\n\nLL14-060     01:33:28.10     +30:31:35.0     3965     0.00     0.40     35.5^+6.5_-23.0     0182     10.2^+3.2_-1.2\n\nLL14-061     01:33:29.04     +30:42:17.3     5522     0.00     0.40     7.2^+1.8_-0.2     1163     7.0^+6.4_-0.4\n\nLL14-067     01:33:31.38     +30:33:33.4     6592     0.00     0.15     9.8^+0.5_-1.7     0365     7.9^+1.1_-0.6\n\nLL14-068     01:33:31.32     +30:42:18.3     6023     0.00     0.30     7.2^+4.5_-0.2     1164     7.3^+0.8_-0.7\n\n...     ...     ...     ...     ...     ...     ...     ...     ...\n\nColumn (1) is the SNR identifier from L10 or LL14. Columns (2) and (3) are the R.A. and Decl. (J2000) of the SNR. Column (4) indicates the number of stars that were used to measure the SFH. Columns (5) and (6) are the best-fit dA_V and A_V values, respectively. Column (7) is the progenitor mass inferred from the median age calculated from the best-fit SFH, and associated uncertainties in M_⊙. Column (8) indicate which region from <cit.> the SNR is associated with. Column (9) is the progenitor mass and uncertainties that resulted from the grid SFH.\na<cit.> \nb<cit.> \nc<cit.> \n(This table is available in its entirety in machine-readable form.)\n \n\n \n \n \n\n \n\n \n\n \n \n\n\n\n\n"}