{"entry_id": "http://arxiv.org/abs/2303.06624v1", "published": "20230312094738", "title": "Collaborative Trolley Transportation System with Autonomous Nonholonomic Robots", "authors": ["Bingyi Xia", "Hao Luan", "Ziqi Zhao", "Xuheng Gao", "Peijia Xie", "Anxing Xiao", "Jiankun Wang", "Max Q. -H. Meng"], "primary_category": "cs.RO", "categories": ["cs.RO"], "text": "\nDark Matter Cosmology with Varying Viscosity: a\n\tPossible Resolution to the S_8 Tension\n    [\n    \n=======================================================================================\n\n\n\n\n\n\nCooperative object transportation using multiple robots has been intensively studied in the control and robotics literature, but most approaches are either only applicable to omnidirectional robots or lack a complete navigation and decision-making framework that operates in real time.\n\nThis paper presents an autonomous nonholonomic multi-robot system and an end-to-end hierarchical autonomy framework for collaborative luggage trolley transportation. \n\nThis framework finds kinematic-feasible paths, computes online motion plans, and provides feedback that enables the multi-robot system to handle long lines of luggage trolleys and navigate obstacles and pedestrians while dealing with multiple inherently complex and coupled constraints.\n\nWe demonstrate the designed collaborative trolley transportation system through practical transportation tasks, and the experiment results reveal their effectiveness and reliability in complex and dynamic environments.\n(Video[Video demonstration: <https://youtu.be/9z3sL6JDleg>.])\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nRobots are versatile tools for object manipulation and transportation, and have a broad range of applications, including industry assembly lines <cit.>, vehicle extraction <cit.>, and luggage collection at airports <cit.>, In many cases, the movement of large objects requires the coordination of multiple robots for enhanced strength or mobility.\nTransporting a chain of collected luggage trolleys in complex and congested environments such as international airports exemplifies such an application. \nThis task is challenging due to several factors: \n1) the robots have to carry a long stack of trolleys, \n2) the operating environment may be densely populated and with narrow corridors and tight corners, and \n3) the robots have to perform highly coordinated movements to maintain the integrity of the trolley stack.\n\n\nIn this paper, we present a practical multi-robot system along with a hierarchical navigation framework for the task of transporting a series of luggage trolleys with autonomous robots.\nTwo nonholonomic robots that were previously used in our trolley collection work <cit.> are further adapted and form a robot team for this transportation task. \nTo tackle the aforementioned challenges, we propose an end-to-end pipeline consisting of several modules that address perception, behavioral planning, global pathfinding, and collaborative motion planning. \nThe proposed framework enables our robot team to work collaboratively, transport a long stack of luggage trolleys, and safely navigate complex and dynamic environments in real time.\n\n\nIn this work, our contributions are threefold:\n\n    \n  * We develop a practical nonholonomic multi-robot system for the collaborative transportation of a series of luggage trolleys. \n    \n  * We propose a hierarchical real-time planning framework for the safe navigation of a nonholonomic multi-robot system, addressing intricate constraints with tight inter-robot motion couplings. \n    \n  * We demonstrate that the designed system can achieve collaborative luggage trolley transportation in complex and dynamic real-world environments. \n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n§ RELATED WORK\n\n\n\n\n\n\nCooperative manipulation and transportation have been traditionally approached as a control task, where the desired trajectories of manipulated objects are often predefined. \nThe robots need to compute control inputs in a central or distributed fashion to enable the manipulated objects to track the desired trajectories or paths. \nA decentralized control framework is brought forth in <cit.>, enabling robotic collaborative manipulation and transportation of large objects via separating locomotion and grasping. \n\nA number of works opt for the caging method <cit.>, in which the manipulated object stays in the interior of the formations formed by the robots. \n\nWithout any explicit communication and with merely local measurements, the approach along with the physical system proffered in <cit.> realizes multi-robot cooperative object transportation via force coordination under a leader-follower paradigm. \nIn <cit.>, the authors provide a distributed adaptive control algorithm for several omnidirectional robots manipulating a rigid body to track a desired trajectory in SE(3).  \nHowever, these works all assume known reference paths or trajectories and do not provide navigation solutions in dynamic environments. \nMoreover, control algorithms in <cit.> are all designed for omnidirectional robots without nonholonomic constraints, making them unsuitable for many practical scenarios, such as the luggage trolley transportation work mentioned in this paper. \n\n\nThe advancement of onboard computing power has unlocked real-time deployment of optimization-based robot planning and control methods like mpc. \nIn <cit.>, the authors formulate the local control of manipulating deformable objects as a convex optimization problem and propose to solve it in a receding-horizon fashion with a centralized/distributed planning approach. \nMany studies have also investigated aerial cooperative payload carrying<cit.> and connected vehicles<cit.>. \nAs expected, centralized optimization scales poorly with the number of robots. \nThereupon, decentralized trajectory optimization methods keep drawing the field's attention. \nThe authors of <cit.> provide us with a decentralized mpc planning and control scheme for moving polygon objects with a set of omnidirectional robots on a plane.\nThough a distributed algorithm for optimization with separable variables is leveraged in multi-robot manipulation <cit.>, it is not well-suited for multi-agent systems with highly nonlinear dynamics and strong couplings. \nRecent study have explored holonomically constrained collaborative locomotion <cit.> and their use in collaborative manipulation of cable-towed loads <cit.>.  \nNevertheless, none of the aforementioned approaches fits our task, which features tight coupling and complex constraints between robots, nonholonomic dynamics, and demand for high motion precision. \n\n\nPrevious collaborative object transportation work in similar settings to ours has mainly focused on control.\nYufka and Ozkan <cit.> take a formation-control perspective and propose a virtual leader-follower control scheme enabling multiple differential-drive robots to transport a pallet-like object. \nThe work in <cit.> investigates a decentralized control algorithm for two nonholonomic robots without direct communication and provides thorough theoretic analyses. \nThe authors of <cit.> employ risk-sensitive stochastic control for the same task, but only use this approach to compute one control input for a bi-robot system. \nWorks in <cit.> all lack a systematic navigation solution that is essential for robots to perform the transportation task in complex, dynamic, and uncertain environments. \nThe closest work to ours is, perhaps, <cit.>. \nThe proposed approach allows for the integration of tracking control and obstacle avoidance. \nNonetheless, the proposed method involves multiple handcrafted attractor functions and quite a few parameters that entail substantial fine tuning. \nIn contrast, our hierarchical approach in this paper features algorithmic flexibility at different decision-making levels, and the parameter tuning is more intuitive and practical. \n\n\n\n§ SYSTEM DESCRIPTION\n\n\n\n\n\n\n\n §.§ Framework Overview\n\n\n\nWe introduce an end-to-end autonomy framework for robotic collaborative trolley transportation in complex and dynamic environments. \nOur framework is illustrated in fig:framework. \nFor perception, multiple sensors are equipped to acquire both global and relative localization measurements, taking uncertainty into account. \nThe proposed hierarchical decision-making module comprises three parts: \n1) the global path planner, \n2) the behavior selector, and \n3) the collaborative motion planner. \n\nThe three planning parts are built for three core objectives that ensure the safety and reliability of the trolley transportation task: kinematic-feasible trajectory generation, obstacle avoidance, and trolley array integrity maintenance. \nStarting with a 2D occupancy grid map, the global path planner provides a sequence of navigation waypoints by treating the entire robot-trolley assembly as a single virtual vehicle and considering kinematic constraints.\nThen, the collaborative motion planner computes online the two robots' trajectories and velocity commands that track the reference path fed by the path planner and accounts for a variety of constraints, including nonholonomic dynamics, coupling formation constraints, and control bounds. \nThe behavior selector evaluates the risk of collision with detected dynamic obstacles like pedestrians nearby, and adaptively adjusts the parameters of the motion planner or directly modifies the velocity commands if necessary. \nThe advantage of such decomposition primarily resides in guaranteeing real-time performance for solving the complex planning and control problem with tight inter-agent couplings while still delivering precise and highly coordinated motions. \n\n\n\n\n §.§ Mechanical Design\n\n\n\n\n\n\nWe develop a multi-robot system consisting of a leader and a follower for the collaborative trolley transportation task.\n\n    \n\n  §.§.§ Components\n\n    \n    Adapted from the previous generation of luggage trolley collection robots <cit.>, the leader and follower share a similar compact structure and identical components, including a differential-drive chassis with suspension, an aluminum alloy frame, large-capacity batteries, wiring, multiple sensors (LiDARs, cameras, IMU, ), an onboard computer, and a manipulator, as shown in fig:design(a). \n\n    \n    \n\n  §.§.§ Manipulator Design\n\n    \n    The manipulator comprises a linear actuator and a gripper, which use leverage to grasp a trolley's handler or beam, as depicted in fig:design(c). \n    The manipulator's placement is adjustable and dependent on the height of the handler or beam being gripped. \n    To ensure that the gripper grasps the beam at the proper horizontal angle, the bottom of the manipulator must be at the same height as the beam. \n    This placement provides a secure grip and acts as protection preventing axial forces on the linear actuator during transportation. \n    As is shown in fig:design(a), the leader robot's manipulator is at a low position gripping the front beam of the trolley, while the follower robot's manipulator is positioned high to grip the handler. \n\n    To enable the two robots to transport trolleys collaboratively along curved paths, we employ a passive joint connecting the gripper and the robot, as shown in fig:design(b). \n    By aligning the rotation axis of the gripper with that of the chassis, we eliminate the torque caused by the force exerted by the trolley queue on the gripper. \n    This design effectively reduces the impact of the robots' angular error and the dynamic adjustment required by the collaborative trolley transport system.\n\n\n\n§ METHODOLOGY\n\n\n\nIn this section, we elaborate our hierarchical decision-making framework in three parts: the collaborative motion planner, the global path planner, and the behavior selector. \nIn addition, we introduce how we fuse information from multiple sources for reliable state estimation. \n\n\n\n\n §.§ Collaborative Motion Planning\n\n\n\nThe main challenges of the collaborative transportation task lie in the collaborative motion planning of the robot team. \nThe robots need to compute their control inputs such that the robot-trolley assembly follows a desired path yielded by the global path planning module and meanwhile, keep the trolleys sticking together and firmly attached to the robots. \nThese requirements involve multiple constraints over the local collaborative motion planning problem. \nTherefore, we opt for a nmpc based approach. \nThe nmpc framework provides great convenience for posing constraints, and has been successfully used in many robotic applications <cit.>. \nIn this section, we first describe the mathematical model of the robot-trolley system and then formulate an optimization problem for collaborative transportation motion planning. \n\n\n\n\nThe robot-trolley assembly consists of two differential-drive robots and an array of omnidirectional trolleys. \nSpecifically, one robot L, a leader, is in charge of steering the trolleys at the head of the array, and a follower robot F provides power and persists the formation configuration at the tail, as shown in fig:lfmodel. \nAssuming the trolleys are properly attached and the number of trolleys is known, we use the two robots' planar positions and heading angles as the assembly system's state and take the robots' linear and angular velocities as the system's input: \n\n    x   ≜[ x^L y^L θ^L x^F y^F θ^F ]∈ℝ^6  ,\n    u   ≜[ v^L ω^L v^F ω^F ]∈ℝ^4 ,\n\nin which {L, F} represents the role (“Leader” or “Follower”) of each robot. \nThereupon, the assembly's kinematics is formulated as two concatenated discrete-time unicycle model: \n\n    𝐱_k+1 = f(𝐱_k, 𝐮_k) = 𝐱_k + G(𝐱_k) 𝐮_k ,\n\nwhere \n\n    G(𝐱_k) ≜[ cosθ^L_k        0        0        0; sinθ^L_k        0        0        0;        0        1        0        0;        0        0 cosθ^F_k        0;        0        0 sinθ^F_k        0;        0        0        0        1;          ]\n    ,\n\nand  is the sampling time interval. \nHerein, we further denote a number of variables derived from the state. \nThe relative distance between the two robots is of great interest: \n\n    r ≜p^L - p^F ,\n\nwhere p^i ∈ℝ^2 for i∈{L,F} is the planar position of a robot. \nMoreover, we denote the angle difference between the orientation of each robot and that of the vector that starts from the follower pointing at the leader as\n\n    ϕ^i ≜θ^i - ( y^L-y^F, x^L-x^F ),    i ∈{L, F}\n    .\n\nfig:lfmodel illustrates the geometrical relationships among these variables.\n\nThe desired relative distance l between the two robots is a mapping κ:  N → l with respect to the number of trolley(s) N.\nThis quantity is assumed to be known from previous trolley collection tasks, so it is a constant here. \n\n\nAs shown in fig:lfmodel, the center of the trolley stack does not necessarily coincide with the center of the line connecting the two robots. \nUnder the condition that the trolleys are tightly arranged and the manipulators passively keep the same heading angle with the trolleys, we find that this slipping between manipulators and trolleys is negligible for motion planning in practice.\n\n\n\nNow we pose the collaborative motion planning problem as an nmpc problem as follows:\n\n\n\n    min_{x, u, ε}      J_T(x_T) + ∑^T-1_k=0 J_S(x_k, u_k, ε_k) \n     s.t.      x_k+1 = f(x_k, u_k) \n       x_0= x_init\n       |r_k - l| ≤ε_k \n       x_k ∈𝒳\n       u_k ∈𝒰,\n\n\nwhere J_T is the terminal cost, J_S is the stage cost, and ε_k is a slack variable. \n\n\nThe constraints are, from top to bottom, respectively: \n(<ref>) the kinematics constraint from (<ref>); \n(<ref>) initial conditions; \n(<ref>) the relative distance constraint, relaxed by a slack variable to avoid infeasibility; \n(<ref>) workspace constraints; \n(<ref>) admissible control constraints, in which the robots' velocities are bounded in the sense of |v^i| ≤ v_max^i, and |ω_i| ≤ω_max^i, and accelerations are bounded via discretization as well |v^i_k+1 - v^i_k| ≤ a^i_max, |ω^i_k+1-ω^i_k| ≤α^i_max. \n\nThe objective function (<ref>) contains several quadratic costs for path tracking and formation maintenance.  \nPath tracking is achieved by employing a pure pursuit strategy encoded in the terminal cost: \n\n    J_T(x_T) = p^L_T - p^L_ref^2_P^L_T + p^F_T - p^F_ref^2_P^F_T\n    ,\n \nwhere x_ A≜√(xAx). \nReference positions p^i_ref are derived from the waypoints q^d_n = [ x^d_n y^d_n θ^d_n ] for n=0,1,…, produced by the global path planner via\n\n    p^L_ref   = [ x^d + l/2cosθ^d y^d + l/2sinθ^d ]\n    p^F_ref   = [ x^d - l/2cosθ^d y^d - l/2sinθ^d ]\n        .\n\nFor stabilizing the formation of the robot team in order to keep the trolley stack's integrity, we design the stage cost as\n\n    J_S(𝐱_k) = \n            λ^r_k |r^2_k - l^2 |^2 + \n            λ^ϕ_k ( ϕ^F_k )^2 + \n            u_k^2_R_k + \n            w_k ε^2_k .\n\nThe first term intends to stabilize the distance to the desired value and contain the follower robot's orientation to line up with the trolley array. \nThe second term penalizes control efforts and the last term punishes the slack on the distance error. \nAll coefficients P^i_T, R_k, λ^r_k, λ^ϕ_k,, and w_k are positive(-definite). \n\n\n\n\n\n §.§ Global Path Planning\n\n \nIt is necessary to equip our system with a global path planner because the system is supposed to operate at potentially large-scale\nvenues like international airports. \nTo guarantee kinematic feasibility, we first model the robot-trolley assembly as a car-like virtual vehicle and then find an obstacle-free path given a 2D occupancy map of the operating environment. \nIn this work, we define the reference path 𝒟⊂ℝ^3 as a series of 3D waypoints q^d_n ≜[ x^d_n y^d_n θ^d_n ] for n=0,1,…, representing desired planar positions and global orientations of the robot-trolley assembly. \n\nThe choice of the path planner is flexible, and we employ the Hybrid A^∗ planner <cit.> for simplicity. \nThe adopted kinematics adapted from a bicycle model is as follows \n\n    x_k+1   = x_k + v cos(θ_k +β_k) \n    \n                y_k+1   = y_k + v sin(θ_k +β_k) \n    θ_k+1   = θ_k + vcosβ_kl( tanϕ^L_k - tanϕ^F_k  ) \n    β_k    = arctan( 1/2 (tanϕ^L_k + tanϕ^F_k  ) ) ,\n \nwhere q = [ x y θ ] is the 3D pose of a chosen reference point attached on the robot-trolley assembly, \nv denotes the tangent velocity, \nϕ^L and ϕ^F are the front and rear “steers” of the assembly, respectively, \nand l is the desired distance between the two robots. \nTo increase searching speed, we hold the tangent velocity v as a reasonable constant, and let the planner uniformly sample feasible steer control [ϕ^L, ϕ^F] to extend the virtual vehicle's poses between searching grids. \nThe resulting path will serve as a sequence of waypoints and be sent to the motion planning module. \n\n\n    \n\n §.§ Behavior Selector\n\n     \n    \n    \n    \n    Operating in densely populated environments like international airports, the robotic system needs to ensure safety and must not bump into people. \n    We identify that it is clumsy, unsafe, and even intimidating for the robots carrying a long array of trolleys to actively perform aggressive maneuvers for obstacle avoidance in such environments. \n    In light of this finding, we propose a fsa to manage the robots' behaviors. \n    \n    Concretely, we categorize the robots' behaviors in four modes— Navigation, Deceleration, Waiting, and Limited Navigation— and each mode consists of a state in the proposed fsa as shown in fig:fsm. \n    The transition between states depends on the relative position between the leader robot and detected dynamic obstacles in its vicinity. \n    The roi for dynamic obstacles detection covers an area 𝒪 = {γ = (ρ, δ)  | ρ∈[ρ, ρ], δ∈[π/3, 5π/3] . }, where γ = (ρ, δ) is the polar coordinate of a detected dynamic obstacle with the origin on the leader. \n    When there is no dynamic obstacles in the roi, , ∀γ∉𝒪, the robots are on Navigation mode and the motion planner works as default. \n    If obstacles are in the front blocking the robots' way, that is, ∃γ∈𝒪_1 = {γ | δ∈[ 2π/3, 4π/3] }, the robots transit to the Deceleration mode and smoothly slow down for a stop. \n    As the robots' velocities gradually decrease to a neighborhood of 0, the robots are in the Waiting state, making way for surrounding dynamic obstacles like humans. \n    The Limited Navigation mode is activated for smooth braking and starting when the robots perceive humans on either side of the robot-trolley assembly (∃γ∈𝒪_2 = 𝒪\\𝒪_1 ∀γ∉𝒪_1). \n    In this mode, the robots move with a lower speed limit. \n    The robots will switch back to Navigation if the detected humans move away, or enter Deceleration if any person moves from the side to the front. \n\n\n\n    \n\n §.§ State Estimation\n\n    \n    \n    It is of paramount importance to have reliable information on the robots' states due to the demand for high-motion precision of the formation collaboration in this transportation task.\n    As such, aside from using LiDARs, IMUs, and odemetry for the localization of each individual robot, we have added markers on the leader robot so that we can measure the relative pose between the two robots from the follower with its LiDAR readings. \n    \n    We adopt an ekf to fuse partial information coming from different sources: the localization modules on two robots and the relative pose measurement. \n    The system's discrete state-space representation is: \n    \n    𝐱_k+1   = f(𝐱_k, 𝐮_k) = 𝐱_k + G(𝐱_k) 𝐮_k + 𝐯_k\n    𝐲^L_k+1   = H_L 𝐱_k+1 + 𝐰^L_k+1\n    𝐲^F_k+1   = H_F 𝐱_k+1 + 𝐰^F_k+1\n    𝐲^Δ_k+1   = H_Δ𝐱_k+1 + 𝐰^Δ_k+1,\n\n    where \n    \n    H_L ≜[ I_3   0 ], H_F ≜[   0 I_3 ], H_Δ≜[  I_3 -I_3 ].\n\n    y^i_k ∈ℝ^3 for i∈{L,F} are pose measurements obtained from the robots' localization modules; y^Δ_k ∈ℝ^3 is a relative pose measurement. \n    We assume that all noises follow zero-mean Gaussian distribution and are independent of one another, , 𝐯_k ∼𝒩(0, V_k), 𝐰^i_k ∼𝒩(0, W^i_k) for i∈{L, F, Δ}. \n    Since we perform local motion planning in a centralized fashion, the prediction step is standard as that of any ekf.  \n    Measurements update at different frequencies, so we perform update steps asynchronously whenever an observation comes in. \n    In practice, we find this fusion of multi-source information critical to the smooth functioning of the motion planner and facilitative of highly cooperative operation of the robots. \n    \n    \n    \n    \n    \n    \n\n\n\n\n§ IMPLEMENTATION AND EXPERIMENTS\n\n\nWe present experimental results to validate the effectiveness of the proposed collaborative motion planning module and demonstrate our trolley transportation system in complex and dynamic environments.\n\n\n    \n\n §.§ Implementation Details\n\n        \n\n  §.§.§ Robot Setup\n \n        We use two autonomous robots to perform collaborative trolley transportation as mentioned in sub:design. \n        Our framework is implemented in Python and integrated through Robot Operating System (ROS). \n        Each robot is equipped with an Intel NUC (specs: Core i7-1165G7 CPU@4.70GHz, 32GB RAM) to perform all computations online. \n        Both robots communicate through a wireless ad-hoc network with their onboard WiFi routers. \n        \n        \n\n  §.§.§ Localization\n\n        Each robot runs its own global localization via AMCL <cit.> with a 2D occupancy map built using GMapping <cit.>. \n        For high-fidelity measurements of the robots' relative position, we install a cylinder marker with unique reflectivity at the leader's rotation center. \n        The follower then extracts the marker's position from the LiDAR scan points and takes it as the leader's position. \n        \n\n        \n\n  §.§.§ Planning\n\n        The global path planner is set up with 0.25m× 0.25m× 15^∘ resolution, and the virtual vehicle's size is slightly expanded for safety. \n        The motion planner runs at approximately 30Hz with a horizon of T=20 steps, each discretized by =0.1s. \n        The MPC problem is formulated by CasADi <cit.> and solved with IPOPT <cit.> on one robot's onboard computer in real-time. \n\n\n    \n\n    \n    \n\n §.§ Collaborative Motion Planning Evaluation\n\n    To test the tracking performance of our collaborative motion planning method, we conduct a real-world experiment transporting three trolleys to track a given reference path in a motion capture area without obstacles. \n    An OptiTrack motion capture system is used to provide precise localization feedback and validation. \n    The reference path consists of 30 waypoints sampled from a concatenation of two arcs both with a 0.4 m^-1 curvature. \n\n    \n    The tracking results are shown in fig:exp_in. \n    In this experiment, we focus on the X-Y position of a reference point attached on the robot-trolley assembly (in orange). \n    The experiment starts at (0,0) and the robots transport trolleys along the predefined reference path to the goal region with a center at (4.5, 4.2). \n    The two robots accomplish the collaborative transportation task in 12.2s with an average velocity of 0.491m/s, and stop when the distance to the goal is within 0.3m. \n    Along the entire way, the tracking error is 2.77± 1.68cm with a maximal error of 5.66cm.\n    [The tracking error is defined as the Euclidean distance between the two curves. For tracking error calculation only, the reference path which contains 30 waypoints is densified via cubic interpolation.]\n\n\n\n\n\n\n\n\n    \n\n §.§ Trolley Transportation Demonstration\n    \n    To demonstrate the practical applicability of our proposed system for trolley transportation in real-world environments such as airports or supermarkets, we conduct experiments in complex and dynamic scenarios where the robots need to transport multiple trolleys while navigating through cluttered static obstacles and pedestrians. \n    fig:setup illustrates the graphic representation of one experiment's setup. \n    As a result, the snapshots, the relevant data, and the visualization of the experiments are shown in fig:exp. \n    \n\n        \n\n  §.§.§ Narrow Space\n\n        In this scenario, the robots are collaboratively transporting 5 trolleys across a narrow space stuffed with 6 static obstacles and 3 pedestrians. \n        The trolley stack is 1.98 m long and weighs around 100 kg. \n        It is not easy even for an adult to manually handle a queue of more than five trolleys in such a complex environment. \n\n        As expected, the path planner successfully identifies a smooth global path, which is denoted as the orange curve in the visualization in fig:exp1. \n        Although the obstacles result in a serpentine path with several turns almost to the robot-trolley assembly's kinematic limit, the robots operate around their full speeds v^F_max = 0.7 m/s, v^L_max = 0.6 m/s when the path is clear of dynamic obstacles. \n        As pedestrians get in the way, the proposed behavior selector kicks in so the robots smoothly stopped, firmly hold the trolleys for safety, and resume moving when the path gets clear, just as is shown in the shaded areas of the velocity plot in fig:exp2, starting at time t ∈{15.8s, 36s, 46s}, respectively. \n        \n        Another critical requirement for successful transportation is to maintain the trolley array's integrity, which is reflected by the relative pose of the two robots. \n        Since the robots' manipulators are not rigidly fixed on the trolleys, large variations in the relative distance or orientation difference between robots will cause detachment or structural damage. \n        Deriving from the relative pose measured by the proposed LiDAR-marker detection method, fig:exp2 shows the error to the desired distance e_p = 14.9± 20.3  mm and the difference between the orientation of the trolley stack and those of both robots are well kept within the range of ± 45^∘. \n\n        \n\n  §.§.§ Populated Space\n\n        This scenario involves two robots transporting 8 trolleys with a total length of 2.56 m in a broad hall filled with more moving humans. \n        The velocity limits are set as v^F_max = 0.58 m/s, v^L_max = 0.5 m/s, and the acceleration are smaller. \n        As presented in fig:exp3, the robot-trolley assembly successfully avoids all obstacles, makes way for several humans, tracks the reference path, and reaches the goal position. \n        The fluctuations in the follower's velocity depicted in fig:exp4 indicate the adjustment to keep the trolleys stuck tight. \n        The relative distance error e_p to the desired distance is 2.55 ± 23.6 mm. \n        [The range accuracy of the Ouster OS1 LiDARs on the robots is 2.5 cm.] \n\n\n        These two experiments manifest the effectiveness of the proposed multi-robot system and demonstrate that our autonomy framework can provide highly cooperative motions despite a variety of underlying complex constraints for safe and smooth operation in collaborative trolley transportation. \n\n\n\n\n§ CONCLUSIONS AND FUTURE WORK\n\n\n\nThis paper presents a hierarchical navigation framework and integrates it into an autonomous multi-robot system designed for collaborative trolley transportation. \n\nBy dividing the various inherent constraints and tackling them at different decision-making levels, our framework is robust and fast enough to provide real-time solutions for the challenging collaborative trolley transportation task. \n\nWe demonstrate the proposed system to achieve cooperative trolley transportation in different scenarios. \nExperimental results have exhibited the efficacy and reliability of the proposed method and hardware system in cluttered and populated dynamic environments. \n\n\nIn the future, we will proceed with socially-aware motion planning and more large-scale outdoor realistic experiments. \nMoreover, we shall actively explore decentralized solutions of our framework to improve robustness and scalability. \n\n\n\n\n\n\n\n    \n    IEEEtran\n    \n\n\n"}