{"entry_id": "http://arxiv.org/abs/2303.07313v1", "published": "20230313173432", "title": "A data-driven analysis of UK cyber defence", "authors": ["Justin McKeown"], "primary_category": "cs.CR", "categories": ["cs.CR", "cs.CY"], "text": "\nNearest-Neighbor Inter-Intra Contrastive Learning from Unlabeled Videos\n    David Fan Deyu Yang Xinyu Li Vimal Bhat Rohith MV Amazon Prime Video \n\n{fandavi, deyu, xxnl, vimalb, kurohith}@amazon.com\n\n\n\n\n\n\n    March 30, 2023\n===================================================================================================================================\n\n\n\n\nJust as computational technologies are a dominant feature of 21st Century life, so too are the various ways in which computers may be exploited for malicious purposes. The ubiquity of computer-based threats is such that, for the UK and other nation states, cyber security is a matter of growing national defence significance. Evidencing this, the UK's most recent integrated review of security, defence and foreign policy mentioned the term  `cyber' 149 times, with the UK prime minister stating therein that by 2030 the UK aspires to be `one of the worlds leading democratic cyber powers'. To fulfill this vision, the UK must first have a sense of the nature of its threat landscape. In order to contribute to this understanding, our research addresses the question: What are the conditions of the UK’s cyber threat landscape? In asking this question, we are also seeking to answer a second, more pragmatic question: how can the UK’s cyber defences be improved? There is a tendency when addressing questions of national significance to focus on large complex challenges, such as the threats posed to  the UK by Advanced Persistent Threats (APTs). In this paper we take a different approach, choosing instead to focus on detectable, known and therefore potentially preventable cyber threats, specifically those that are identifiable by the types of malicious scanning activities they exhibit. We have chosen this approach for two reasons. First, as is evidenced herein, the vast majority of cyber threats affecting the lives and business endeavours of UK citizens are identifiable, preventable threats. Thus the potential exists to better improve UK cyber defence by improving how citizens are supported in preventing, detecting and responding to cyber threats; achieving this requires an evidence base. Second, it is potentially useful to build a quantifiable evidence base of the known threat space —that is to say detectable, identifiable and therefore potentially preventable cyber threats —to ascertain if this information may also be useful when attempting to detect the emergence of more novel, dangerous cyber threats; for example the kind more readily associated with APTs. Therefore, this research presents an analysis of malicious internet scanning activity collected within the UK between 1st December 2020 and the 30th November 2021. The data was gathered via a custom automated system which collected and processed data from Greynoise and Shodan APIs, cross referencing it with data from the Office of National Statistics and proprietorial data on UK place names and geolocation. The research was carried out after ethical approval by the University of Oxford's Computer Science Departmental Research Ethics Committee.\n\n\n\nThe data collated during the course of this research has been made available via the Open Science Foundation platform:\n\nhttps://osf.io/gtbw7/https://osf.io/gtbw7/  \n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\nCyber security incidents have become a common feature of 21st Century life. Owing to the ubiquity of computing technologies and the shared nature of cyber space, cyber threats not only affect governments and large corporations, but also SMEs, charities and domestic internet users.  According to the Cyber Security Breaches Survey 2021 39% of UK businesses and 26% of UK charities reported cyber security breaches in 2021 <cit.>.  Further, among medium to large size enterprises, the figure is approximately 65%, with 51% of higher income charities experiencing some form of cyber security breach between March 2020 and March 2021 <cit.>. In terms of frequency of attack, the report states that 27% of businesses and 23% of charities experience an attack at least once per week. It is not only businesses and charities, but also individuals who are affected by cyber security incidents; as an indicator of this the National Cyber Security Centre (NCSC) reported that 2.3 million suspicious emails were forwarded to their reporting service in 2020 <cit.>. In considering this report it is evident that beyond the headline grabbing occurrances of cyber attacks on the UK's Parliament <cit.>, UK universities <cit.>, and the mass disruption to the UK's National Health Care System (NHS) as a result of the WannaCry malware event <cit.> UK citizens and organisations face daily challenges in contending with threats in cyber space. Thus defending against cyber threats is a shared challenge, that requires a shared response.\n\n\n\nIn considering how we may make a useful contribution to improving UK cyber defence, we recognise that much scholarly effort is currently being expended in order to develop understanding and approaches to Advanced Persistent Threats (APTs), for example <cit.>. Arguably, less is being done to formally examine more prosaic cyber threats, the stuff of which makes up the bulk of most citizens and organisations daily cyber challenges. To this end we set out to collect and analyse data concerning detectable, identifiable and therefore potentially preventable cyber threats originating within the UK. In doing this the aim is to develop a body of data detailing the UK's threat landscape and, building on this, develop evidence-based proposals for helping to improve UK cyber defence.\n \n\n\nIn considering how we may further focus this research, we recognise there is a difference between targeted and non-targeted attacks. We define targeted attacks as those in which an individual or organisation is wilfully selected as the target for a planned cyber attack on the basis of something more than their systems vulnerabilities. For example an employee who has become disgruntled with their employer may decide to launch a cyber attack against them in recompense for their grievance. We define non-targeted attacks as those in which an individual or organisation is selected as the target for a cyber attack on the basis of the vulnerabilities presented by their accessible systems. For example the Mirai malware will scan networks in order to identify suitably configured - and vulnerable - hosts which it can infect. In order to further focus our research, we have decided that we do not want to actively examine targeted attacks and instead we will focus on the non-targeted attacks, which constitute the bulk of cyber threats commonly dealt with by individuals and organisations within the UK.\n\n\n \nA common feature of non-targeted cyber attacks is that they are opportunistic and utilise code in the form of malware to propagate opportunistically across networks and systems. A key technical behaviour of this propagation process is that such malware will perform internet scanning activity in order to identify suitable hosts presenting with the appropriate vulnerabilities. As such focusing on data collection of internet scanning activity originating within the UK will enable us to gain insight into the types and volume of cyber threats within the UK's geographical borders. With this we decided that one year's worth of such data should provide an ample amount of information for this initial study. In collecting this data we initially want to be able to answer simple questions such as how much malicious internet scanning activity is originating from UK based computer systems? What types of malware and other malicious activities are most prevalent and what type of threat might these pose? What types of operating systems are these scanning activities associated with and what regions of the country does this activity originate from?\n\n\n\nThe structure of the remainder of the paper is as follows. We will first provide some further information regarding motivation and  background in order to make evident why we believe this research is necessary and useful. Following from this we provide an outline of our methodology, followed by presentation and analysis of the data we collected between 1st December 2020 and 30th November 2021. Having presented the data we then present questions and implications arising from the data followed, finally, by a conclusion summarising key points in relation to our research questions and and evaluating limits of the study.\n\n\n\n\n§ MOTIVATION AND BACKGROUND\n\nA significant motivation for the initiation of this research in late 2020 was the findings of our initial scoping analysis of the UK's then current approach to cyber defence. At this time the foremost public document describing the UK's approach to Cyber Security was the National Cyber Security Strategy 2016-2021  <cit.>. Using this document as a starting point we set out to understand how, within the context of cyber, relationships between private citizens, public sector and private sector were envisioned. In so doing we were particularly interested in how responsibility for cyber response was formally and informally distributed across various individuals and organisations within the UK and what events or conditions cause them to become active during a cyber incident of growing intensity. This preparatory analysis surveyed a wide variety of sources including formal models of incident response employed in the UK  <cit.>; UK legislation  <cit.>; UK government reports and policies  <cit.>; educational frameworks  <cit.> and guides  <cit.>; as well as frameworks developed by UK professional bodies representing the cyber security industry  <cit.>. Our analysis indicated that while there was cohesion among stakeholders in specific verticals[We use the term `Verticals' to refer to business sectors. For example Health care is a vertical. Banking is a vertical. The use of this word in this way is common in business parlance, and is therefore used here.] there appeared to be less cohesion across verticals and thus overall a potential lack of cohesion in the UK's approach to cyber security. Further the key to improving the cohesion in UK cyber security response lay in improving communication and understanding across verticals between technical and non-technical stakeholders. In recognising this, we set out to develop data which could be used to develop a shared understanding of common threats across all verticals, thus mapping the bedrock of the UK's cyber threat landscape. Thus through addressing the previously raised questions regarding types, volumes, location of threats the groundwork could be laid for strategising an evidenced-based approach to more cohesive cyber response.\n  \n\n\nSince undertaking our initial scoping analysis the UK government has published The National Cyber Security 2022, which takes a very different strategic approach than the previous iteration of this strategy. Importantly, the updated version identifies building cohesion across all verticals —that is to say private citizens, public sector, private sector, government and military —as a requirement for building better cyber resilience, stating that an `holistic whole-of-society' approach is required to improve UK resilience <cit.>. While the updated Cyber security strategy identifies that cohesion must be created it does not detail how this should be achieved. On this point we argue that decision making should be predicated on evidence and informed by research. As such the work we have done, despite the refocusing of government cyber policy, remains relevant to the field. Indeed, just as our research is still relevant so too is some of the research that we have examined during the development of our work.  With this in mind, we felt it appropriate to highlight the key research that has informed and further motivated our own research process.\n\n\n\n\n §.§ Defining the problem space: Threat Actors, Target Domains, Defender and Technologies\n\nOne of the biggest challenges we faced when beginning this research was defining a model that adequately represented the cyber problem space. This challenge was not unique to our research and we note that at least early as 2001 researchers were grappling with the challenges of what `cyber space' actually is <cit.>. While the work of Mitra and Schwartz examined cyberspace as an emerging cultural phenomenon, other researchers examined it specifically from a security perspective. Marrone and Sabatino's <cit.> analysis of similarities and differences in strategic approaches to cyber space by different NATO member states is significant because it presents an evidence-based argument for the creation of a shared understanding in the form of regulatory and doctrinal framework, that enables better integration of cyber into other defence strategies <cit.>. In the UK's case this means integration into the vision set out in The Nation Cyber security strategy 2022. In considering the work of Marrone and Sabatino, while we agreed with their arguments and analysis, their approach to modelling the cyber defence space was reliant primarily on existing military and policy models and, for our needs, we sought a more simplistic first principles based approach to modeling the problem space. To this end we reduced the problem to threat actors, target domains and defenders.   \n\n\n\n §.§ Threat Actors\n\nOur initial literature review suggested that the dominant approach to threat actor classification is to define threat actors via their tactics, techniques and procedures (TTPs) and the Indicators of Compromise (IoCs) they leave behind <cit.>. While this approach is effective from a technical perspective, it is less useful when trying to define threats actors in terms that are useful to both technical and non-technical individuals communicating across differing verticals. To this end, we found the work of Mavroeidis et al. <cit.> instructive as it suggested an approach which advocated for the development of commonly agreed-upon controlled vocabularies for characterizing threat actors and their operations. This approach is in dialogue with Marrone and Sabatino's aims of developing a framework that allows for a shared understanding <cit.> and is a potentially viable strategy for ensuring effective communication across verticals between technical and non-technical stakeholders. Further, examples of this already exist in the intelligence community where `words of estimative probability' —commonly referred to as WEPs —are used to confer mathematical probability in plain English <cit.>.\n\n\n\nWith the above in mind we searched for an existing shared vocabulary describing threat actors, which is in common use across various verticals and used by technical and non-technical people. To this end we identified the five main categories of threat actor defined by The National Cyber Security Strategy 2016-2022 as a source of such a taxonomy. These categories are Cyber Criminals, State and State-Sponsored Actors, Terrorists, Hacktivists and Script Kiddies. Cyber criminals are those carrying out two specific types of acts: ‘cyber dependent crimes’ and ‘cyber enabled crimes’ <cit.>. State and state-sponsored threat actors are those threat actors that seek to penetrate UK networks for ‘political, diplomatic, commercial and strategic advantage’ <cit.> at the behest of a nation state. Terrorists are those whose actions fulfil the definition of terrorism given by a range of successive UK legislation passed between 2000 and 2021 <cit.>. Hacktivists are those groups or individuals who are decentralised and issue-orientated and who define targets in response to perceived grievances, ‘introducing a vigilante quality to many of their acts’ <cit.>. Script Kiddies are defined as ‘less skilled individuals who use scripts or programmes developed by others to conduct cyber attacks’ <cit.>. The updated National Cyber Security Strategy 2022 in no way precludes the use of these terms as part of the UK's current approach to cyber security. The question therefore arises, could these categories offer a starting point for the development of a controlled vocabulary for describing qualities and attributes of threat actors?\n\n\n \nIn considering the above further, it is apparent that each threat actor is defined by two key qualities and that these qualities are shared across all five terms. First is the threat actors technological capability. These range from script kiddies who have minimum technical capability, through to nation state actors who have very high technical capability. The second quality is political motivation, which range from cyber criminals who have no political motivation through the personal political motivation of hacktivists to the Political motivation of nation state actors. Thus we note that there may be scope for developing a cyber equivalent to the WEP vocabulary, which utilises technical capability and political motivation as metrics for descriptions of threat actors. The development of such a controlled language would have to be evidence-based and predicated on data which qualified the nature of threat actors. The data we collect during our research could potentially inform the development of such a controlled language and we will therefore return to this subject in the conclusion of this text, once we have presented and analysed our data.\n  \n\n\n\n §.§ Target Domains\n\nThreat actors do not operate in a vacuum and as such their activities effect people, systems or both. Herein we refer to the impact zones of a threat actors activity as the Target Domain. In reviewing scholarly literature regarding target domains,  we observed that most activity is focused within specific verticals. For example, there is a range of informative literature dealing exclusively with  Industrial control Systems and Critical National Infrastructure <cit.>. There is decidedly less literature analysing target domains across different verticals. In trying to understand why this is the case, we turned to the field of threat modeling. In reviewing literature in this space <cit.> it became apparent that because threat actors are commonly defined via TTPs and IoCs, their definition is fundamentally entwined with the targets of their attack. Thus threat actors who attack CNI are identifiable because of the TTPs they exhibit and IoCs they leave when interacting with CNI. Therefore it is logical that most research focused on target domains is domain-specific because the methods used to identify threat actors rely on the specificities of the interaction between specific threat actors and specific target domains.\n \n\n\nIn balance we found an alternative approach in the field of Threat Intelligence, and in particular in the work of Mavroeidis and Bormander <cit.>. In their research Mavroeidis and Bormander evaluated taxonomies and ontologies within cyber security, ultimately advocating for the development of a multi-layered cyber threat intelligence model. This aligns strongly with the aspirations of our research. In noting this we also note that one of the merits of collecting data regarding malicious scanning activity is that this activity originates from within several different target domains and thus crosses multiple verticals. As such, it creates an evidence base for addressing the question of what would a multi-layered cyber threat intelligence model look like? Further, could it be articulated in a controlled vocabulary that had utility across multiple verticals between technical and non-technical stakeholders? To achieve this we must first identify existing target domains that could be used when analysing our data. In support of this we note that the National Breaches Survey 2022 <cit.> divides various areas of UK civil endeavour up into the domains of UK micro and small businesses, medium and large businesses, charities, and education. These categories combined with those encompassed by CNI cover a significant amount of potential target domains within UK Society. To these domains we would add that of domestic environments, since this seems overlooked. We will return to this question of target domains, later in the analysis and conclusion of this text.\n\n\n\n §.§ Defenders\n\nHaving considered threat actors and target domains, we also sought to review literature which quantifies the roles, qualities and responsibilities of cyber defenders. We found limited scholarly literature in this domain, and conclude that it is therefore a developing field. Of the scholarly work we identify as relevant, the work of Malviya, Fink et al. was informative <cit.> as it sought to discover qualities that are common to good cyber defenders. In relation to our own study, their work had limited utility primarily because of its focus on military personal. Beyond academia, we found the work of two UK cyber security professional bodies informative. \nThe UK Cyber Security Council (UKCSC) —which the NCSC describe as the ‘voice of the cyber security profession in the UK’ <cit.> —list 16 specialisms within the field of cyber security <cit.>. In contrast, the Chartered Institute of Information Security `(CIISec) —which is the other main UK professional cyber security association —also attempts to quantify the range of specialisms within the UK cyber sector via the publication of a skills framework that lists fourteen different areas of specialisation <cit.>. In comparing these lists both professional organisations recognise Cyber Security management, Digital Forensics, Threat Intelligence, Secure Systems Architecture, Audit and Assurance, Secure Operations, Incident Response, and Security Testing as categories of cyber security defender endeavour within the UK. In terms of divergence UKCSC recognise Vulnerability Management, Cryptography and Communications Security, Secure Systems Development and Cyber Security Generalist as additional fields of specialism. In contrast CIISec recognise Information Security Governance and Management, Operational Security Management, Data Protection, Privacy and Identity Management, Business Resilience, Information Security Research, and Contributions to the Information Security Professional Development as additional categories of specialism for UK defenders. In considering these areas of convergence and divergence, it is of note that those categories defined by UKCSC are grounded in technical endeavour, whereas those defined by CIISec focus more on categories of management. What is clear from this is that, while there are some areas of agreement among professional bodies, there is no firm consensus on the categories of specialism within UK cyber defence and thus no clearly defined categories of cyber defenders. In nothing this we also note the UKCSC and a number of other bodies are currently working to better define categories of specialism within UK cyber defence. To this end the UK Cyber Body of Knowledge <cit.> —commonly referred to as CYBOK —has been developed and work is underway to map UK cyber endeavour to this framework. In considering the work of these bodies and the development of CYBOK, the question arises, could analysis of data on types of common threats tackled by UK cyber defenders better inform how we conceive of and define cyber defenders?\n\n\n\n\n\n §.§ Threat Modelling\n\nHaving defined threat actors, target domains and defenders the natural temptation is to attempt to model the relationship between these things. To this end we could turn to the field of threat modelling and utilise already existing practices, for example <cit.>. However, we will resist the urge to do this and instead turn to the collection, presentation and analysis of our data so as to provide an evidence-base for further addressing the key questions raised thus far in this text. Specifically: through addressing the questions of volume, type and location of malicious scanning activities is it possible to develop an evidence-base upon which one may be able to develop a multi-layered cyber threat intelligence model for the UK, which works across verticals between technical and non-technical stakeholders? Further, could a WEP-style be utilised in this?\n\n\n\n\n§ METHODOLOGY\n\nHaving undertaken the above discussed scoping analysis, we designed and built a system that would automate daily collection and analysis of data concerning internet scanning activity originating from within the UK. The system utilised a specially agreed academic API from Greynoise <cit.> to enable data collection. IP addresses were extracted from Greynoise data and then used to query the Shodan <cit.> internet search engine. This was done so as to further enrich the data gathered via Greynoise. Information from both Greynoise and Shodan was then further contextualised using data supplied by the Office of National Statistics (ONS) and proprietary geolocation data purchased from the UK company TownList <cit.>. This data collection and contextualising process took place on a daily basis. Each day at 10:07AM the process would begin with an automated request to Greynoise for the entirety of their previous days data concerning internet scanning activity originating from within the UK. After running an initial testing of the system for one month, we began formal data collection on the 1st December 2020 and ceased formal collection the 30th November 2021. Through analysis of the data and by examining it in light of the material covered in our initial scoping analysis we were able to develop a series of insights and recommendations regarding our reserarch questions.\n\n\n\n\n§ DATA PRESENTATION AND ANALYSIS\n\nIn this section we present the data gathered along with supplemental information to aid with its interpretation. Though before doing so it is important to discuss the quality of the data being analysed.\n\n\n\n\n §.§ Data Quality\n\nOver the 365 days of data collection, Greynoise reported that it detected and tagged a total of 851,972 internet scanning activities originating within the UK. From Greynoise's 851,972 detection records we were able to retrieve 491,668. The missing data is attributed to Greynoise capping the number of results it returned via the API it had made available for our research purposes. For clarity, of the missing 360,304 records, 301,467 are associated with unprecedented swells in internet scanning activity on the 18th and 19th of December 2020 and on the 15th and 16th April 2021. It is of note that these dates correlate with the SolarWinds and Microsoft Exchange Server attacks. These events may well be the reason for the unprecedented swell in internet scanning activity on these dates. While the Greynoise API did not allow us to capture complete datasets for these dates we did manage to retrieve partial datasets for each, consisting of 10,000 entries per day. The remaining 58,837 unaccounted for records are spread throughout the period from 4th July 2021 to 30th November 2021. Aside from the omissions noted, the data collected between 1st December 2020 and 3rd July 2021 is complete.\n\n\n\n\n §.§ Identifying UK based scanning activity\n\nOf the 491,668 complete records obtained, Greynoise classified 211,460 records as being from ‘unspoofable’ IP addresses. Greynoise classifies an IP address as ‘unspoofable’ when it has observed a complete TCP authentication process. Thus, we can conclude that 211,460 of the records account for activity originating from within the UK, while the remaining 280,208 may or may not originate from a UK based IP address. In considering this, for the purposes of accuracy, we will continue to focus only on activity which originates from ‘unspoofable’ UK IP addresses.\n\n\n\n\n §.§ Malicious, Benign and unclassifiable scanning activity\n\nOf the 211,460 ‘unspoofable’ records, Greynoise classified 7,410 as `benign'; 77,677 as `malicious' and the remaining 126,373 as `unknown'. Greynoise classifies activity as benign when it recognises the source of the scanning activity; for example, search engines such as Google. Where an entity exhibits behaviour that explicitly evidences malevolent intent it is classified as malicious; for example attempted use of the Bluekeep exploit <cit.> on one of Greynoise's cloud-based sensors. When scanning activity falls into neither category it is classified as ‘unknown’. Therefore some of the data classified as `unknown' may in fact be malicious activity that, at the time of collection, could not be accurately verified as such. The inverse of this statement is also true. Table 1 presents a breakdown of the monthly volume of internet scanning activity originating from the UK along with a breakdown of their Greynoise classification. In examining this data it is notable that the volume of `malicious' and `unknown' scanning activity is significantly larger than that of `benign' scanning activity.\n \n\n\n\n\n\n\n\n §.§ Types of malicious scanning activity\n\nFor the purposes of transparency, Greynoise also makes a number of distinctions in its tagging process which would be highly useful to a SOC analyst, but which are overly granular for the purposes of our analysis. For example Greynoise provides separate tags for Mirai malware and some of its derivatives. Further Greynoise also distinguishes between Eternalblue and activity which is highly probably Eternalblue. We have therefore chosen to ignore these minor distinctions and combine the data for these tags. This combination gives a detection count for Mirai of 27,361 and 18,107 for Eternalblue. With all of the above interpretations of the original Greynoise data accounted for, it is significant that of the 279 unique subcategories of scanning activities, The top 10 of these account for 61.85% of all malicious scanning activity originating from UK IP addresses during the period of study. Of these top 10, the top 5 are responsible for 44.71% of all malicious scanning activity originating within the UK (see Table 2). In making these claims it is important to be clear that they are based on counting the number of times various scanning activities were tagged by Greynoise and thus the claim is limited by the fact that the data is collected from a single source.  For thoroughness, below we provide a brief summary of what the top 10 detected malicious scanning activities are and the threats they represent.\n\n\n\n\n\n  §.§.§ Mirai\n\nBy volume of activity, Mirai malware and its variants are the most common source of malicious scanning activity detected within the UK during the research period. Mirai commonly infects so-called ‘smart’ devices that run ARC processors <cit.>. When Mirai infects a device, it turns it into a node in a botnet network and later uses it to launch DDoS attacks. Mirai spreads by scanning the internet looking for devices capable of hosting it. If the default name and password is not changed on such devices, then Mirai is able to log into the device and infect it. Greynoise applies the Mirai classification to devices that have exhibited behaviour indicative of infection with Mirai or a Mirai variant <cit.>. The risk arising from the Mirai threat is the hijacking and mobilisation of UK-based computer devices to launch attacks both within and outside the UK.\n\n\n\n\n  §.§.§ Web Crawler\n\nThe term web crawler is somewhat ambiguous when used in the context of malicious scanning activity. A web crawler crawls the web indexing sites using criteria set by the crawler’s authors. Given the lack of further detail available on the types of web crawling behaviours observed by Greynoise, we can only assume that the activity is indicative of intelligence gathering and the reconnaissance part of the cyber kill chain. The risk arising from these threats is therefore the targeting of individuals, organisations or websites via information gathered through this profiling activity. \n\n\n\n\n  §.§.§ Telnet Bruteforcer and Telnet Scanner\n\nTelnet scanners and Telnet bruteforcers both target the Telnet application protocol, though in slightly different ways. Both search the internet for servers exposing the Telnet to the web. When a server is discovered, the Telnet scanner will attempt to fingerprint any services running; a typical example of this is afforded via the Metasploit’s Telnet auxiliary modules <cit.>. Going beyond fingerprinting, the Telnet brute forcer will attempt to brute force the target system’s password.  Telnet scanning activity may well be a precursor to a Telnet bruteforce attempt. Further, both activities are highly likely to be a precursor to other forms of malicious activity. The risk therefore is further exploitation of the server, undermining the confidentiality, integrity  and availability of services hosted by the compromised system. The compromised system may also be used as a platform from which to launch more sophisticated attacks, such as those discussed above, against other servers.\n\n\n\n\n  §.§.§ Generic IoT Brute Force attempt\n\nGreynoise applies the tag generic IoT brute force attempt to any IP that has been observed attempting to brute force IoT devices via Telnet or SSH with generic default credentials <cit.>. Such activity therefore bears relationship to both Mirai and Telnet scanners both in terms of threat and behaviour; and accordingly, in terms of risk.\n\n\n\n\n  §.§.§ Eternalblue and SMbv1 Crawlers\n\nEternalblue is the name given to an exploit that targets a vulnerability (MS17-010) in Microsoft’s Sever Message Block (SMB) protocol. This exploit was a feature of both WannaCry and NotPetya <cit.>. The exploit was originally developed by America's National Security Agency (NSA), before being stolen and leaked to the wider internet by the Shadow Brokers hacking group. EternalBlue targets multiple versions of Windows and enables attackers to gain remote access to infected devices. Greynoise applies this classification to IP addresses observed trying to infect devices across the internet using the EquationGroup’s EternalBlue exploit <cit.>. Related to this, Greynoise classifies SMBv1 crawlers as those IP addresses which have been observed crawling the internet for SMBv1. Thus, the latter could in some circumstances be an activity that prefigures the former.\n\n\n\nThe threat posed by compromise of the SMB protocol – via EternalBlue or other means - is multifaceted and dependent on the accordances of the infected device, and what other devices it may be connected to. Worryingly, this could include Critical National Infrastructure as was the case with NotPetya. The risk therefore is compromise and disruption of services across the entire spectrum of domains in which computing devices are used.\n  \n\n\n\n  §.§.§ SSH Worm and SSH Brute Forcer\n\nGreynoise applies the tag SSH worm to IP addresses that have been observed attempting to brute force SSH server credentials and that also exhibit signs indicating that it was compromised and is operating on behalf of a another actor <cit.>. The SSH Brute Forcer classification tag is only applied to devices observed attempting to brute force SSH credentials. The risks arising from SSH worm activity and SSH brute forcing are the compromise of the confidentiality, integrity, or availability of SSH worm compromised servers and their further exploitation via malicious actors. This may include more severe attacks on other systems, organisations or even individuals depending on the nature of services and data hosted on the compromised machine.\n\n\n\n\n\n  §.§.§ HTTP Alt Scanner\n\nThis tag is applied to entities observed scanning web servers for open alternative http ports. This may be as part of an attempt to compromise servers hosting web services through non-standard ports. If a server is compromised via such a service then it may be used as a platform from which the attacker may launch other, more sophisticated attacks.\n\n\n\n\n\n\n§ SCANNING BY OPERATING SYSTEM\n\nHaving considered the various forms of malicious scanning activity, it is also insightful to consider the types of operating system most frequently associated with each top ten scanning activity. We present this  data in Table 3. In examining this information it is evident that computers running Linux Kernel 2.2-3.x are most frequently the source of malicious scanning activity. Linux Kernel 2.2 dates from 2000 with the earliest version of Linux Kernel 3 dating from 2012. The last version of Linux Kernel 3.x was released in 2015. This therefore suggests that the computers running these operating systems have not been updated due to neglect, or else they cannot be updated owing to either software dependencies or the critical nature of roles they perform while running.\n\n\n\n\nBeyond the top ten detected malicious scanning activities, it is instructive to examine the breadth of operating systems from which malicious scanning activity appears to originate. Within our study we detected 14 different variants of operating system associated with malicious scanning activity. There were also a multitude of scanning activities originating from operating systems which we could not resolve to a specific known fingerprint. We have categorised data originating from the later as being attached to `unknown' operating systems. In doing this we note that these unknown operating systems may be one of those already listed in the table, it is simply the case that the operating system could not be resolved at the time of detection. We present this data in Table 4.\n\n\n\nIn considering the implications of the data listed in Table 4, it is important to  note that the predominance of Linux in the listings does not imply that it is a less secure operating system. Indeed, FreeBSD is a Linux operating system and ranks below that of Mac OS X for times tagged in relation to malicious scanning activity.  The frequency with which an operating system is associated with malicious scanning activity is most likely attributable to a combination of factors. Firstly the proliferation of the operating system and secondly the context in which it ids used. For example, Linux is often the operating system of choice for server administrators setting up services which can be accessed from the internet.\n\n\n\n\n\n\n\n§ VOLUME OF UNIQUE IP ADDRESSES SCANNING\n\nWithin the period of study a total of 18,799 unique IP Addresses were detected performing malicious scanning activity  from within the UK. Almost all of these unique IP addresses were associated with multiple types of malicious scanning activity. Table 3 presents the number of the unique IP addresses associated with each of the top ten scanning activities. In reading between Tables 2 and 5 it is evident that, for example, 8,017 IP addresses were associated with 27,259 detected Mirari scanning activities.\n\n\n\n\n\n\n §.§ IP Addresses data interpretation\n\nIn considering the data presented in Table 5 it is important to note for less technical readers that unique IP detections do not neatly translate into the number of unique machines performing the associated activity. To be explicit: just because 8,017 unique IP addresses were detected performing behaviour indicative of Mirai malware scanning activity does not mean that there are 8,017 computers infected with Mirai scanning the internet looking for new hosts to infect. The reason IP address count does not neatly translate to the number of machines performing a given activity is because of the way in which IPv4 addresses are utilised as a finite resource for addressing networks and systems across the global internet. It is important to clarify how IPs are used as a resource so that we are precise in defining what the collected data can and cannot tell us.\n\n\n\n\n §.§ ASNs, IP Pools and ISPs\n\nAn Autonomous System Number (ASN) is an identification number given to the controller of a routable IP address range managed by a single entity or organisation. This organisation is responsible for the management, supervision and control of activities within the given IP range. An Internet Service Provider (ISP) provides one such instance of such an organisation. Thus, for example, the controller of ASN  AS9105 is UK-based ISP TalkTalk Communication Limited who are responsible for 3,032,320 IPs across a number of address ranges <cit.>.\n\n\n\nIn terms of day to day management, the IP addresses in a given ASN are essentially a pool of resources that are assigned and unassigned to different consumers for varying periods of time. For example, the IP addresses allocated to domestic internet users are frequently renewed by their ISPs. Thus a domestic customer's external network IP address may change every few days. Conversely, some business users may require fixed IP addresses to enable delivery of their services and thus may operate from fixed IP addresses all year round. When a customer leases an IP from an ASN controller — most commonly via and ISP — they may in turn use it to create a subnet. Thus a single IP address in an ASN may be the gateway address of a network comprised of hundred of different computing devices. The processes of assigning and unassigning IPs combined with the ability of those leasing IPs to subnet them is the reason  why we cannot neatly equate one IP address to one machine when reading the collected data.\n \n\n\nWith the above in mind, while it is not possible within the scope of the study to neatly equate the number of observed IP addresses to the number of machines performing malicious scanning activity, it is theoretically possible to use the collected data to not only count but also locate the machines performing the observed malicious scanning activity. Doing this would require retrieving additional data from multiple ASN controllers, though it is possible because as part of the management of their networks, ASN controllers are required to keep records of which IP addresses are assigned to which legal entities (i.e. people, businesses) including the date and time these were assigned and unassigned. As such, through direct working with ASN controllers, it would be possible to calculate the number of IP addresses responsible for each scanning activity and indeed identify the legal entities associated with these IP addresses; one would simply need to be important enough for multiple ASN controllers to be willing to collaborate on such a project. For example, one may need to be a government agency.\n\n\n\n\n\n\n §.§ Malicious Scanning by ASN Controller\n\nWhile the above calculations are beyond the scope of the data available to us, it it is possible to use the collected data to calculate the volume of scanning activity associated with various ASN controllers networks. We can do this by taking the IP addresses associated with malicious scanning activity and grouping these by ASN controller. In turn we can then use the existing mapping of IPs to malicious scanning activity to map malicious scanning back to ASNs. If we examine this data on a monthly basis we are able to gain insight into the number of times particular types of malicious scanning activity were tagged within each ASN controllers IP pool. From this we infer the frequency with which various activities were detected.\n\n\n\nWithin the data collected we identified 2,298 unique ASN controllers. Of these 2,298 ASN controllers, malicious scanning activity was observed to originate from just 406 of them. This suggests that 100% of the activity discussed herein are originating from IPs governed by 17.7% of ASNs.  Table 6 provides a summary of the 10 ASN Controllers in which malicious scanning activity was tagged most frequently. In contrast Table 7 provides a summary of the 10 ASN controllers in which the top ten malicious scanning activities were tagged in most frequently. It is of note that 9 of the providers feature in both Tables 6 and 7.\n \n\n\nIt is important to note that just because malicious scanning activity has not been observed to originate from an ASN controllers network does not mean that it is free of malicious scanning activity. Rather, it could equally be true that the type of malicious scanning activity originating in the network was not classifiable as malicious by Greynoise and therefore has evaded consideration in our study. Thus it may simply be that the nature of the nature of the activities conducted on the ASN's listed in Tables 4 and 5 is conducive to the types of infections we are examining. A further consideration is that, because our data is drawn from a single source —Greynoise —, then the concentration of scanning activity in a small percentage of ASNs may be reflective of the locations of Greynoise's detection systems. Clarifying exactly why we see this imbalance across ASNs is beyond the scope of this study, though we note that is worthy of further investigation in future research.\n \n\n\n\n\n\n\n\n\n\n\n§ SCANNING BY GEOGRAPHIC LOCATION\n\nHaving examined types of malicious scanning activity, volume of associated IP addresses and the ASN \tcontrollers associated with these IPs, it is interesting to also consider the geographic locations to which these IPs belong. In doing this, it must be noted that our ability to resolve IPs to geophysical locations is largely reliant on Greynoise's tagging of the city location, region and country from which various scanning activities originate. Table 8 presents a summary of the top cities in the UK from which malicious scanning activity appears to originate. Table 9 presents similar data, but with a focus on the top 10 scanning activities introduced in Table 2.\n \t\n\n\n\n\nIn examining the data presented in Tables 8 and 9 it is apparent that major UK cities are the main sites from which much malicious scanning activity appears to originate. Upon analysis of Office for National Statistics (ONS) data, population does not seem to be a defining factor in the frequency with which malicious scanning is tagged in various UK locations. It is more probable that population size and the infrastructure of internet routing plays a contributing roles with regards the frequency of tagging in relation to geographic locations. However, testing this proposal is beyond the scope of what has been possible so far with this research.\n\n\n\n\n\n\n\n§ SCANNING BY POLICE REGION\n\nIn further considering the geographic spread of malicious scanning activity it is interesting to note that Section 77 of the Police Reform and Social Responsibility Act (2001) <cit.> outlines seven national strategic policing requirements, which the Home Secretary requires regional police forces to prioritise. Among these are serious organised crime, child sexual exploitation and national cyber security incidents <cit.>. In light of this increasing demand on police to develop their capcity to cyber crime it is therefore insightful to consider how the data examined so far maps into UK policing regions. Table 8 presents this information for the entirety of the UK's policing services.\n\n\n\nIn examining the data in Table 10 in relation to that in Table 8 and 9, it is of note that there is some approximate mapping between the ranking of large cities by observed malicious scanning activity and the policing regions within which they are located. For example, City of London police and Metropolitan  police have jurisdiction over London and greater London. Thus, both London and Bexley which are cited in Tables 8 and 9, fall within their jurisdiction. Similarly, Birmingham is covered by West Midlands police, Cardiff by South Wales police,  Leeds by West Yorkshire police, Liverpool by Merseyside police and Southampton by Hampshire police. Norwich lies within the jurisdiction of Norfolk police, which is ranked 15th. Only the ranking of Bedfordshire police in 30th position, who have jurisdiction over Luton, seems anomalous.\n\n\n\nIn examining this data it is evident that, overall, City of London is the policing region from which by far the most malicious scanning activity was seen to originate from. The reasons for this are unclear, but the statistics are notable and prompt future study. \n\n\n\n\n\n\n\n\n§ QUESTIONS, IMPLICATIONS AND OPPORTUNITIES\n\nIn undertaking this research process we set out to examine if —through analysis of the volume, type and locations of detectable and therefore identifiable malicious scanning activities —it is possible to develop an evidence-base upon which one may be able to develop a multi-layered cyber threat intelligence model for the UK. In considering this we note that the data gathered evidences that it is possible to gather quantitative data regarding scanning activity from specific geographic regions, be these occurrences, cities, policing regions. Using this data it is possible to identify potentially malicious scanning activity that, in some instances, is indicative of known forms of detectable and therefore potentially preventable Malware. This tell us that it is possible to collect data which can be used to develop a UK focused threat intelligence model. For this model to be multi-layered then it should cross verticals, and be valuable to technical and non-technical stakeholders. In considering these requirements we note that the data gathered is not restricted to a single domain and in this respect fulfills part of our objectives. In terms of being valuable to technical and non-technical stakeholders, we must further consider if the insights gained from data analysis may suggest specific actions that could create value for technical and non-technical stakeholders in different verticals.\n \n\n\nThe data examined suggests that the top 5 most frequently tagged malware scanning activities accounts for 46.34% of the total volume of malware tagged in the period of study. If the data gathered is indicative of typical trends over a much longer period, then we argue that a campaign of activity directed towards the prevention, detection and response to emphMirai, Web Crawlers, Telnet Brute Forcers, IoT brute forcers, and emphEternalblue could improve the cyber-defences of UK citizens, charities and businesses. In arguing this we fully recognise that some of the scanning activities are much more challenging to address than others. Nonetheless, we propose that focusing part of the UK's civil cyber defence efforts on improving the understanding of technical and non-technical stakeholders with regards how to prevent, detect and respond to these threats could positively improve UK cyber defence. In suggesting this we also propose that a practical pilot study could be designed which tests the efficacy of taking such a targeted approach.\n    \n\n\nIn the study we noted that IP addresses can be resolved back to the ASN controllers. Some of these ASN controllers are also Internet Service Providers who lease IPs to domestic users, businesses and charities. An interesting finding of this study is that annually somewhere between 0% and 0.04% of almost all ASN controllers' IP addresses are associated with performing malicious scanning activity. This is a comparatively small percentage of their overall pool and given their responsibilities towards securing their own networks, the question arises could ASN controllers do more to alert users that their IP address is associated with malicious scanning activity, so as to support broader campaign of activity to improve UK cyber defence?\n\n\n\nBuilding on the above it was noted that, through working with ASN controllers it may be possible to resolve malicious scanning activities back to companies, individuals and potentially even devices in networks.  To achieve this would require collaboration between ISPs and a publicly trusted 3rd party. If this were undertaken as a public service in order to provide  private citizens, SMEs and charities with a publicly accessible tool through which to check their own IP addresses for malicious activity, then this could offer a means to create further value for both technical and non-technical stakeholders. In suggesting this we also note that if such a collaboration were undertaken as a security or policing endeavour then we speculate that this could invoke similar negative reactions as took place with the Investigatory Powers Act (2016) <cit.>, thus caution and an exploratory pilot study is advised to test the potential of this suggestion.\n\n\n\nThe final question that remain to be addressed is that of how the data collected may inform a WEP-style language that could be useful to technical and non-technical stakeholders across different verticals. Having analysed our data set, an obvious shortcoming is that because the data is comprised of detectable and therefore potentially preventable threats, it only covers part of the spectrum of threats faced by UK cyber defenders. Thus it does not provide an adequate basis to inform the complete requirements of a WEP-style language.  Further, having considered what the data does and does not tell us about the nature of cyber threats, it is questionable what purpose a WEP-style language would serve since from a technical perspective the utility of attribution is limited. In balance, we must also consider that while cyber incidents directly impact technical systems, they also indirectly, though often purposefully, impact  non-technical domains.  Thus we argue that that the value of a WEP-style language lies not in its ability to attribute cyber incidents to specific threat actors but rather in its potential to classify the character and severity of a threat in terms that enable precise communication between technical and non-technical stakeholders when attempting to prevent, detect or respond to specific cyber incidents. This may therefore enable technical and on-technical stakeholders to calibrate their efforts. To this end we return to the categories of Cyber Criminal, State and State-Sponsored Actors, Terrorists, Hacktivists and Script Kiddies <cit.> and propose that the relationship between political motivation and technical capability form an X, Y axis within which each of the five given categories could be plotted. Thus the data provides a starting point for further research in this domain.\n\n\n\n\n§ LIMITATIONS\n\nThis study would not be complete without some discussion of its limitations. A key limitation is that the data presented is collected via a single source —Greynoise —with further data collection and contextualization from the other cited sources. While Greynoise has a formidable collection system spanning many networks and countries, we have to recognise the limitations of a single source.  Another potential limitation is that our research is focused entirely on the UK. Thus we have not considered if the scanning activities we have observed in relation to the UK are typical or anomalous when compared to other countries. These limitations of data-source and geographic focus also present opportunities for further research and thus it may be possible to develop more informed insights.\n \n\n\nAnother note worthy limitation of our work is that the period of collection, though long enough for our initial study, is in comparative terms relatively short. It has therefore been a challenge to develop insights that would be indicative of trends in scanning behaviour. Therefore in future work we would aspire to work over a longer period of time, reporting results periodically. With these shortcomings in mind, we believe that our findings though modest establish a basis for future research that would enable us to more completely explore the questions we outlined in the background and motivation section of this text.  \n\n\n\n\n§ CONCLUSION\n\nThrough this study we have developed an evidence-based approach to UK cyber defence with a specific focus on addressing the types of cyber security threats faced most frequently by UK citizens. We have achieved this through a focus on detectable and therefore potentially preventable forms of malicious scanning activity, many of which are symptomatic of devices infected with malware. The findings of the study highlight those types of scanning activity which are most prevalent in the UK and provide suggestions for targeted strategies that may be initiated in order to reduce these activities. In doing this we also identify major stakeholders who could potentially work together for the public good and help reduce the threats identified herein. We believe their is sufficient evidence gathered to warrant the development of pilot schemes to explore practical approaches to supporting domestic internet users, SMEs and charities in better defending themselves against malicious internet scanning activities that target or infect their systems.\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENTS\n\nThis research was undertaken while completing MSc studies in Software and Systems Security at the University of Oxford, UK. With gratitude, I acknowledge the advice and encouragement I received from Professor Andrew Simpson while progressing this research.\n\n\nacm  \n  \n"}