{"entry_id": "http://arxiv.org/abs/2303.07301v1", "published": "20230313172554", "title": "Phantom dark energy as a natural selection of evolutionary processes $\\hat{\\rm a}$ $\\textit{la}$ $\\textit{genetic algorithm}$ and cosmological tensions", "authors": ["Mayukh R. Gangopadhyay", "M. Sami", "Mohit K. Sharma"], "primary_category": "astro-ph.CO", "categories": ["astro-ph.CO", "gr-qc"], "text": "\n\n\n\n\n\n\n\n              \n\n      \n                             \n                             \n\n\n\n\n\nmayukh_ccsp@sgtuniversity.org\n\n\n\n sami_ccsp@sgtuniversity.org,  samijamia@gmail.com\n\n\nmr.mohit254@gmail.com (Corresponding author)\n ^1Centre For Cosmology and Science Popularization (CCSP),\n\n        SGT University, Gurugram, Delhi- NCR, Haryana- 122505, India,\n^2Center for Theoretical Physics, Eurasian National University, Astana 010008, Kazakhstan.\n^3Chinese Academy of Sciences,52 Sanlihe Rd, Xicheng District, Beijing.\n\n\n\n\n\n\n\n\nWe employ a machine learning (ML) algorithm to analyze  cosmological background data and the linear red-shift space distortion (RSD) data in a model-independent way, with specific focus on the Hubble expansion rate and the growth of large-scale structure. We find strong evidence that the natural enhancement in the Hubble parameter at low redshifts is due to the underlying phantom nature of dark energy, rather than low matter density. As for the RSD data, we find a higher value of σ^8_(0) which is consistent with CMB's predictions, but the outcome of low matter density leads to unresolved tension. This might point towards a new physical phenomenon at the perturbative level in the low redshift regime. From a statistical perspective, we have demonstrated that our results hold greater preference compared to those obtained by the ΛCDM model. \n\nWe employ a Machine Learning(ML) algorithm to analyze cosmological background data, specifically pertaining to the Hubble expansion rate. Our findings indicate that the phantom dark energy is a natural selection of an evolutionary process that effectively resolves the Hubble tension. \n\n\n\nAdditionally, we incorporate red-\nshift space distortion data alongside low red-shift gravitational lensing data. Through the algorithm, we have observed a higher value for the amplitude of matter density perturbations that aligns with Planck's prediction. From a statistical perspective, we have demonstrated that our results hold greater preference compared to those obtained by the commonly accepted ΛCDM model. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Phantom dark energy as a natural selection of evolutionary processes\n â  la genetic algorithm\n  and cosmological tensions  \n    Mohit K. Sharma^1\n    March 30, 2023\n===============================================================================================================================\n\n\n\n\n\n\n\n\n\nDespite the wide recognition of the ΛCDM  as a suitable model for describing the evolution of the universe, recent low-redshift observations have subjected it to intense scrutiny, particularly with respect to the identification of a high expansion rate and low matter-density clustering <cit.>. These estimates are found to be in a significant level of tension with the high-redshift Cosmic Microwave Background (CMB) estimations on the ΛCDM model <cit.>. These low-redshift observations such as Supernovae H_0, for the Equation of State of DE (SH0ES) <cit.> and Kilo Degree Survey (KiDS) <cit.> have challenged Planck-18 estimates for H_0 and σ^8_0 by revealing discrepancies of about 4.4 σ and 3 σ, respectively. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo address these disagreements within a single framework, many different approaches have been put forward.\nThese approaches make use of interactions between dark energy and dark matter <cit.>, modifications of gravity at early <cit.> or late times <cit.>, and other related mechanisms <cit.>. However, \nin this letter, our main objective is to identify the fundamental cause(s) to which we can partially or fully attribute the existing problems. To do this, we adopt a model-independent technique that solely relies on \nthe data pertaining to the cosmological background and linear perturbative level to reconstruct the evolution of the universe.\nWe use a metaheuristic optimization algorithm that is inspired by the process of natural selection and genetics, wherein a fitness function evaluates the fitness of individuals in each step (or generation) \nand, as a result, the individuals from the population get selected to \nreproduce the offspring of the next generation <cit.>. Thus, individuals who can produce offspring with the highest fitness are identified in the population in an effort to emulate the process of natural selection. \n\nThe degree of effectiveness for each solution, which involves a single independent variable like redshift, is based on its ability to align with the observational data and achieve consistency. Our approach involves utilizing the Likelihood statistic as the fitness function to assess the “success” of reproducing species in each generation. The population which maximizes the  \nLikelihood is considered to have the highest fitness. Therefore, our stochastic process aims to maximize the Likelihood.\n\n\nIt is worth noting that the accuracy of the final optimal solution is largely unaffected by changes in the initial population. Regardless of the initial conditions, the optimization process will generally lead to the same optimal solution, unless any singularities are encountered along the way. The main advantage of using this method is that it can automatically discover most relevant complex features from the data which may be beyond the capability of standard parametric methods.\n\nIn order to execute the algorithm mentioned, we utilize observational Hubble data (OHD) to analyze the background cosmological data, and redshift-space distortion (RSD) data to analyze the growth of matter density perturbations. The former gives us the insight of \nhow does the dominance of dark energy (DE) is affecting the rate of expansion of the universe for \na given cosmological model. Also it further enables \nus to figure out when does the universe transited from deceleration \nto acceleration. The latter tells us about the evolution of the large-scale structure of the universe. For better \nunderstanding of each dataset, we opt to conduct separate study instead of merging both \ndatasets. \n\nWe take the OHD data in the red-shift range \nz ∈ [0.07, 1.965], and by defining the χ^2 function, we execute the search-based algorithm, which utilises a population size that is sufficiently large, around 𝒪(10^3). Additionally, we generate different random numbers for each run to investigate whether the initial population has an impact on the outcome.\n\nWe have observed that the minimum χ^2 value (corresponds to the maximum fitness) in our case has dropped to around 13.21 which for the ΛCDM is around 14.5, this represents a significant improvement in the fit of almost 8.84%. This suggests a strong preference of some late-time gravitational modification over the ΛCDM and various other models that mimics it. \n\n[Here we mention that while the best-fit χ^2 for each run may vary slightly from other runs or require more generations to converge, it consistently yields an almost indistinguishable cosmological evolutionary scenario.]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFigure (<ref>) demonstrates the 1σ evolutionary profile of the function H(z). While the Hubble parameter does follow the expected trend of decreasing with z, there is a noticeable deviation around a redshift of 0.2-0.4 where H(z) begins to shift towards higher values. This contradicts the prediction of various DE models, which suggest that the Hubble parameter will continue to decrease till it becomes almost constant in the far future. It is worth noting that if a particular constituent of the universe, which may be attributed to DE or a result of modified gravity, is intrinsically responsible for the enhancement in H(z) through a positive time-derivative, it would necessarily exhibit a phantom-like behavior <cit.>. \n\nAs is evident that the \nevolutionary profile of Hubble parameter in Fig. (<ref>) implies that the corresponding equation of state parameter, w__DE, must be super negative. \nIn order to quantitatively measure the effective DE contribution and its dynamics, let us compare it \nwith the standard flat-wCDM expression of the Hubble parameter:\n\n\n    ℋ(z) = H_0 √(Ω_m^(0) (1+z)^3 + (1 - Ω_m^(0))  (1+z)^1+w__DE) ,\n\n\nwhere H_0 denotes the Hubble constant, and Ω_m^(0) represents the the current density parameter.  Assuming a flat universe with pressure-less dust, the total equation of state parameter w__T of the system is related to  w__DE as w__T=Ω__DE w__DE. Now, in order to statistically compare H(z) with ℋ(z), we consider H(z) to be the true function, and measure the square of the ratio of its difference with the ℋ(z), normalized by the 1σ uncertainty in the H(z). This way, one not only estimates the best-fit parameters but also their uncertainties from the uncertainties in H(z). To carry out the analysis, we divide the range of redshift: z ∈ [0,2] into bins of size 0.1, and use the Markov Chain process as a sampling technique. We obtain \n\n\n    H_0 = 73.02 ± 1.2   [Km/s/Mpc],   Ω_m= 0.305 ± 0.032, \n           w__DE = -1.339 ± 0.175  ,\n\n\nwithin the 1σ level. It is worth noting that our estimation of H_0 aligns with the findings of SH0ES and other low-redshift observations such as the Megamaser Cosmology Project (MCP) <cit.>, H_0 Lenses in COSMOGRAIL's Wellspring (H0LiCOW) <cit.>. These observations measure H_0 = 73.9 ± 3, and 73.3^+1.7_-1.8, respectively. Let us here note that it is the phantom behavior of dark energy which is clearly responsible for the increase in H_0 and the resolution of the Hubble tension, rather than the speculated under-density of matter at low-z. In fact, the increase in H_0 causes a 6.7% increase in total (local) matter density: Ω_m h^2, than what is  predicted by the Planck results. Furthermore, from w__DE estimates, it clearly shows >1 σ level discrepancy with the base ΛCDM model. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn  what follows, we apply the same optimization algorithm to data related to matter perturbation i.e. redshift-space distortion (RSD).\nFor this dataset, we have used the compilation of \nf σ^8(z) observations (f:= growth factor, and σ^8 is the amplitude of power spectrum in 8h^-1Mpc) from different galaxy surveys in the redshift \nrange: z ∈ [0.02,1.94] <cit.>. The main motivation for opting for this specific subset of data is its exceptional level of organization and lack of anomalies.  The χ^2 for the \nsame is defined as: χ^2 = V^i C_ij^-1V^j, where V ≡ f σ^8(z)- [f σ^8(z)]_fit, and C_ij is the covariance matrix between different datasets. Just like the background analysis, here also we have conducted multiple simulations, all utilizing the same procedure as the one used for the cosmological background level. We have also verified for different \ninitial values to determine if there outcomes differ from one other.\n\n\n\nIn fig. (<ref>) we depict the evolutionary profile of f σ^8(z), which corresponds to the maximum fitness up to the 1 σ level. Notably, the value of f σ^8(0) is 0.381 ± 0.012, which is significantly lower (a level >2 σ) than the Planck result of 0.474 ± 0.015. \n\nBy revisiting the flat-wCDM model to figure out what does fig. (<ref>) indicates in terms of the cosmological \nparameters which are associated with the growth of matter perturbations, such as, \nΩ_m^(0), σ^8_(0) and w__DE. We again use the flat-wCDM model to analyze the analytical evolution of matter density contrast δ_m, which is given as\n\n\n    δ_m/a = \n     _2  F_1(w__DE-1/2w__DE,-1/3 w__DE;1-5/6 w__DE;\n     a^-3 w__DE(1-1/Ω_m^(0)))\n\n\nwhere a is the scale factor and _2  F_1 is the Hypergeometric function.\nUsing this one can determine the observable growth rate as\n\n\n    f σ^8(z) = f(z) σ^8_(0) δ^(m)(z)/δ^(m)(0) .\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHere once again, we adopt the same approach to statistically compare f σ^8(z) with Eq. (<ref>). The estimated values are given as follows [The obtained χ^2 value is almost 6.7% better than that of the corresponding ΛCDM model, and is also slightly better than that of the wCDM model.]:\n\n\n    w__DE = -1.065 ± 0.103  ,   Ω_m^(0) = 0.261 ± 0.014  \n         \n          σ^8_(0) = 0.792 ± 0.024  .\n\n\nHere also, we see that the equation of state for DE favours its phantom nature by leaning slightly towards lower values (<-1). On the other hand, the value of σ^8_(0) is significantly higher than what was predicted by low-redshift observations such as KiDS-450 <cit.>. As already mentioned that the KiDS-450 estimate of σ_8^(0) = 0.745 ± 0.039 exhibits a tension of more than\n2 σ with Planck result: σ^8_(0) = 0.811 ± 0.006. Notably, \nour estimate on σ_8^(0) does not show any tension with Planck's σ_8^(0) result and is in \nagreement within 0.76  σ level. Since, the best-fit value of w__DE is very close to that of the ΛCDM, the primary factor that plays the role in easing the tension of σ^8_(0) is obtaining a \nlower value of Ω_m^(0) than what was estimated by Planck. It is nevertheless interesting to note that \nthe Planck's tension with RSD appears to be with the value of Ω_m^(0) rather than with the value of σ^8_(0).\n\nFig. (<ref>) shows a comparison between the allowable parameter ranges obtained from the H(z) and RSD datasets to ensure compliance with both sets of estimations. The RSD dataset places stronger bounds on Ω_m^(0) and w__DE^(0) than H(z), while H(z) allows for the DE equation of state parameter to be more towards the phantom side compared to the RSD dataset. We find that the large negative DE equation of state for the background data and lower matter density parameter for the growth of perturbations are the main factors that can alleviate both tensions from their respective datasets. However, we also note that there is \nno common background parameter that can significantly reduce both tensions simultaneously, unless we introduce a separate mechanism which by introducing more parameters, will also affect the goodness of fit.\n\nBased on our RSD estimates, we observe that our σ^8_(0) value is in closer agreement with the Planck results. To verify the consistency of our estimates in the standard Ω_m^(0)-σ^8_(0) plane, which is commonly quantified by S^8_0 = σ^8_0√(Ω_m^(0)/0.3) <cit.>, we use the error propagation method. We find that S^8_0 = 0.738± 0.026, which is although compatible with low-redshift observations such as, KiDS-450 which gives S^8_0 = 0.745 ± 0.039 displays a significant 3.4σ level tension with Planck's estimate of S^8_0 = 0.834 ± 0.016. This tension is primarily due to the low estimated value of Ω_m^(0) which is linked to the low-phantom nature of DE as inferred from the RSD observations. If the DE equation of state were more phantom, similar to what we have obtained from the background estimation, it would require a high matter density parameter, which in turn would decrease the clustering amplitude. Therefore, unlike the H_0 tension, the S^8_0 tension cannot be resolved through standard cosmological parameters. It either indicates something fundamental in the evolution of cosmological perturbations or necessitates a careful cross-check of the systematic errors.\n\nNonetheless, our estimates have revealed the evolutionary profiles of f σ^8(z) with H(z) across a range of redshifts from -0.2 to 1.5 in fig. (<ref>). We have depicted the evolution of linear perturbation with the background expansion by utilizing the Planck best-fits with Ω^(0)_m=0.315 and σ^8_0 = 0.8111 in the plot. The figure demonstrates that both trajectories have evolved similarly in the past, but a change is observed at low-redshift, i.e., z<1. Particularly, the growth rate of matter perturbations, as per the Planck, achieves a maximum value significantly greater than our fit. After reaching the maximum value, the former shows a decreasing pattern with H(z). Nonetheless, due to the enhancement in H(z), f σ^8(z) declines further than it would from the Planck results.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe observation that the value of Ω_m^(0) derived from the Planck and RSD data exhibits a noteworthy level of inconsistency suggests that the tension is not solely associated with σ^8_(0). Instead, our background estimates, as well as those from Planck, shows that Ω_m^(0)≃ 0.3. As a result, the RSD dataset's distinctive low matter density parameter indicates that the tension could be attributed to systematics (atleast partially) rather than being largely impacted by the dark energy equation of state. We, therefore, emphasize that although the dark energy equation of state can alleviate the Hubble tension at the background level, it may not play a substantial role in resolving the S^8_0 tension.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn summary, we conducted two independent analyses to identify the reasons behind two tensions related to parameters H_0 and σ^8_0. Our cosmological model-agnostic findings demonstrate that the phantom nature of a weekly dynamical DE is required for the background, while a lower matter density parameter is necessary for the large amplitude of clustering of matter density perturbations. However, resolving one tension does not alleviate the other. Our model-independent approach makes our results applicable in general. We show that it is possible to address the σ^8_0 tension (i.e. making it compatible with the Planck results) by adopting a model that imitates ΛCDM and proposes a low matter density parameter. On the other hand, in order to bring σ^8_0 in agreement with the low-z observations by also having high Ω_m^(0), a purely phantom nature of DE is necessary. This suggests that while the phantom nature of DE plays a crucial role in satisfying the low-z observations at the background level, it is not the sole determining factor for reducing the σ^8_0 tension by using RSD observations. If these discrepancies are not in systematics, solving these discrepancies requires a certain mechanism which on the background level largely affect the DE, whereas at the perturbative level, enhances the matter perturbations clustering amplitude. On theoretical grounds, the effective phantom-like behavior can be successfully realized  generically by the disformal coupling between baryonic and dark matter in the Einstein frame; this coupling does not require an additional degree of freedom. Another possibility is provided by the interaction between dark matter and dark energy.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGEMENT\n\n\nThe work of MRG is supported by DST,\nGovernment of India under the Grant Agreement number\nIF18-PH-228 (Inspire Faculty Award). The work of MRG and MS is supported by Science and Engineering Research Board (SERB), DST, Government of India under the Grant Agreement number CRG/2022/004120 (Core Research Grant). MS is also partially supported by the Ministry of Education and Science of the Republic of Kazakhstan, Grant\nNo. 0118RK00935 and CAS President's International Fellowship Initiative(PIFI). \n\n99\n\nriess\nA. G. Riess et. al., A 2.4% Determination of the Local Value of the Hubble Constant, Astrophys. J., 826(1) (2016) 56, arXiv: 1604.01424 [astro-ph.CO]. \n\nholicow\nK. C. Wong et. al., H0LiCOW – XIII. A 2.4 per cent measurement of H0 from lensed quasars: 5.3 tension between early- and late-Universe probes, Mon. Not. Roy. Astron. Soc., 498(1) (2020) 1420-1439, arXiv: 1907.04869 [astro-ph.CO].\n\nkids450\nH. Hildebrandt et. al., KiDS-450: Cosmological parameter constraints from tomographic weak gravitational lensing, Mon. Not. Roy. Astron. Soc., 465 (2017) 1454, arXiv: 1606.05338 [astro-ph.CO].\n\nkids1000\nC. Heymans et. al., KiDS-1000 Cosmology: Multi-probe weak gravitational lensing and spectroscopic galaxy clustering constraints, Astron. Astrophys. 646 \n(2021) A140, arXiv: 2007.15632 [astro-ph.CO].\n\nplanck18\nN. Aghanim et. al., Planck 2018 results. VI. Cosmological parameters, Astron. Astrophys. 641 (2020) A6, arXiv: 1807.06209 [astro-ph.CO].\n\namendola\nB. J. Barros, and L. Amendola, and T. Barreiro, and N. J. Nunes, Coupled quintessence with a ΛCDM background: removing the σ_8 tension, JCAP 01 (2019) 007, arXiv: 1802.09216 [astro-ph.CO].\n\nsujikawa\nJ. B. Jiménez, D. Bettoni, D. Figueruelo, F. A. T. Pannia, and S. Tsujikawa, Probing elastic interactions in the dark sector and the role of S8, Phys. Rev. D 104(10) (2021) 103503, arXiv: 2106.11222 [astro-ph.CO].\n\npandey\nK. L. Pandey, T. Karwal, and S. Das, Alleviating the H_0 and σ_8 anomalies with a decaying dark matter model, JCAP 07 (2020) 026, \narXiv: 1902.10636 [astro-ph.CO].\n\ntrodden\nM. C. Carrillo, Mariana, Q. Liang, and J. Sakstein, and M. Trodden, Neutrino-Assisted Early Dark Energy is a Natural Resolution of the Hubble Tension, arXiv: 2302.09091 [astro-ph.CO].\n\ntrodden2\nJ. Sakstein, and M. Trodden, Early Dark Energy from Massive Neutrinos as a Natural Resolution of the Hubble Tension, Phys. Rev. Lett. 124(16) (2020) 161301, arXiv: 1911.11760 [astro-ph.CO].\n\ngeneric\nS. A. Adil, M. R. Gangopadhyay, M. Sami, and M. K. Sharma, Late-time acceleration due to a generic modification of gravity and the Hubble tension, Phys. Rev. D 104(10) (2021) 103534, arXiv: 2106.03093 [astro-ph.CO].\n\ngeneric2\nM. R. Gangopadhyay, S. K. J. Pacif, M. Sami, and M. K. Sharma, Generic Modification of Gravity, Late Time Acceleration and Hubble Tension, Universe 9(2) (2023) 83, arXiv: 2211.12041 [gr-qc].\n\nsilk\nE. D. Valentino, A. Melchiorri, and J. Silk, Planck evidence for a closed Universe and a possible crisis for cosmology, Nature Astron. 4(2) (2019) 196-203, arXiv: 1911.02087 [astro-ph.CO].\n\nelenora\nE, D. Valentino et. al., Cosmology Intertwined III: f σ_8 and S_8, Astropart. Phys. 131 (2021) 102604, arXiv: 2008.11285 [astro-ph.CO]. \n\n\nsigma8drag\nV. Poulin, J. L. Bernal, E. Kovetz, and M. Kamionkowski, The Sigma-8 Tension is a Drag, arXiv: 2209.06217 [astro-ph.CO].\n\npogosian\nK. Jedamzik, and L. Pogosian, Relieving the Hubble tension with primordial magnetic fields, Phys. Rev. Lett. 125(18) (2020) 181302, arXiv: 2004.09487 [astro-ph.CO].\n\nperivola\nG. Alestas, and L. Perivolaropoulos, Late-time approaches to the Hubble tension deforming H(z), worsen the growth tension, Mon. Not. Roy. Astron. Soc. 504(3) (2021) 3956-3962, arXiv: 2103.04045 [astro-ph.CO].\n\nsupratik\nR. Shah, A. Bhaumik, P. Mukherjee, S. Pal, A thorough investigation of the prospects of eLISA in addressing the Hubble tension: Fisher Forecast, MCMC and Machine Learning, arXiv: 2301.12708 [astro-ph.CO].\n\nGA\nS. Nesseris, and J. Garcia-Bellido, A new perspective on Dark Energy modeling via Genetic Algorithms, JCAP 11 (2012) 033, arXiv: 1205.0364 [astro-ph.CO].\n\n\ngum\nB. Gumjudpai, T. Naskar, and M. Sami, and S. Tsujikawa, Coupled dark energy: Towards a general description of the dynamics, JCAP 06 (2005) 007, arXiv: hep-th/0502191.\n\nmcp\nD. W. Pesce et. al., The Megamaser Cosmology Project. XIII. Combined Hubble constant constraints, ApJL 891(1) (2020), arXiv: 2001.09213 [astro-ph.CO].\n\ngrowthdata\nB. Sagredo, S. Nesseris, and D. Sapone, Internal Robustness of Growth Rate data, Phys. Rev. D 98(8) 2018 (083543), arXiv: 1806.10822 [astro-ph.CO].\n\nsunny\nR. C. Nunes,  and S. Vagnozzi, Arbitrating the S8 discrepancy with growth rate measurements from redshift-space distortions, Mon. Not. Roy. Astron. Soc. 505(4) (2021) 5427-5437, arXiv: 2106.01208 [astro-ph.CO].\n\n\n\n\n\n\n\n"}