{"entry_id": "http://arxiv.org/abs/2303.07300v1", "published": "20230313172435", "title": "Improvement of Geant4 Neutron-HP package: Doppler broadening of the neutron elastic scattering kernel and cross sections", "authors": ["M. Zmeškal", "L. Thulliez", "E. Dumonteil"], "primary_category": "physics.comp-ph", "categories": ["physics.comp-ph", "nucl-ex"], "text": "\n\n\n\n\n\n1,2]M. Zmeškalcor1\nzmeskma1@fjfi.cvut.cz\n3]L. Thulliez\nloic.thulliez@cea.fr\n3]E. Dumonteil\n\n[1]Dept. of Nuclear Reactors, Faculty of Nuclear Sciences and Physical Engineering, Czech Technical University in Prague, V Holesovickach 2, Prague, 180 00, Czech Republic\n[2]Research Centre Rez, Hlavni 130, Husinec-Rez, 250 68, Czech Republic\n[3]Université Paris-Saclay, CEA, Institut de Recherche sur les Lois Fondamentales de l'Univers, 91191, Gif-sur-Yvette, France\n\n[cor1]Corresponding author\n\n\n\nWhether it is for shielding applications or for safety criticality studies, numerically solving the neutron transport equation with a good accuracy requires to precisely estimate the Doppler broadened elastic scattering kernel in the thermal and epithermal energy range of neutrons travelling in a free gas. In , low energy neutrons are transported using evaluated data libraries handled by the Neutron High-Precision (Neutron-HP) package. Version 11.00.p03 of the code features in particular the Doppler broadened elastic scattering kernel, provided by the so-called 'Sampling of the Velocity of the Target' (SVT) method. However this latter fails for resonant heavy nuclei such as ^238U and can severely impact the solving of the Boltzmann equation in fissile media. To overcome this shortcoming, the Doppler Broadened Rejection Correction (DBRC) method has been implemented in and successfully validated with the reference Monte Carlo neutron transport code  (version 11). This development will be taken into account in the next release of the code. The cross section Doppler broadening process, which is performed on-the-fly, is also carefully investigated and ways to improve it on a simulation-by-simulation basis are presented. All the validations have been performed with an automated benchmark tool which has been designed to support the quality assurance of the Neutron-HP package. This tool is currently available on an ad hoc Gitlab repository and will be included in . \n\n\n\n\n\n\nNeutron-HP Neutron elastic scattering kernel Doppler broadening DBRC \n\n\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nMonte Carlo codes are routinely used for particle transport applications since they allow to track  particles individually and eventually to keep correlations between them. To this aim the open-source toolkit has been developed by an international collaboration with the aim of supporting high-energy physics applications, as well as other domains, like space science, medical physics, engineering and nuclear  physics.<cit.>. In the past decades, the physics range has been extended to lower energies, including low energy neutron transport (i.e. below 20 MeV) through the development of the Neutron High-Precision (Neutron-HP) package which is mainly based on evaluated nuclear data libraries to accurately describe neutron-matter interactions. During the last years in particular, the Neutron-HP package has been graduously improved  <cit.>, due to the increasing need for neutron transport capabilities in the broader context of multi-particle transport codes required by applications such as accelerator physics, medical imaging and radiotherapy, fundamental physics, nuclear industry, etc. These latest developments place the code close to be on-par with reference neutron transport codes such as <cit.> or <cit.>. \nNeutron transport simulations heavily rely on an accurate description of neutron-matter interactions and more specifically on a proper handling of the temperature of the material in which the neutron propagate because low energy neutrons (thermal and epithermal) are sensitive to molecular and atomic thermal motions. This latter cannot usually be neglected during neutron transport since it affects both the cross section and the final state of the reactions. Indeed the available energy in the centre of mass of the system depends on the relative velocity between the neutron and the moving target nucleus. This effect gives rise to the Doppler broadening process which can be written as:\n\n    σ_T(v_n)=1/v_n∫ v_r σ_T=0 K(v_r) ℳ(𝐕_t,T) d𝐕_t\n\nwith σ_T the Doppler broadened cross section at temperature T, ℳ(𝐕_t,T) the target velocity distribution, v_r=𝐯_n-𝐕_t the relative velocity between the neutron, 𝐯_n, and the target nucleus, 𝐕_t.\nThe cross section Doppler broadening can be performed exactly for example with the  algorithm <cit.>. The definition of the final state of the reaction has to be coherent with the Doppler broadened cross section value. Often in Monte Carlo neutron transport codes the final state definition is divided in three domains depending on the neutron energy E_n, as sketched in Figure <ref>. For E_n>SVT_E_max, with SVT_E_max=400k_B T (∼10.5 eV at 300 K) and k_B the Boltzmann constant, the target nuclei are considered at rest, leading to the use of the so-called 0 K asymptotic elastic scattering kernel. For E_n<SVT_E_max, the target nuclei are assumed to behave as a free gas, i.e. moving freely relative to each other, and are described by a Maxwellian velocity distribution which is a valid approximation for many targets (in particular metallic), therefore in the following ℳ(𝐕_t,T) is  set to be a Maxwell-Boltzmann distribution. The final state is then derived from Equation <ref> assuming a constant cross section over the relative velocity range leading to the so called 'Sampling of the Velocity of the Target' (SVT) method. Furthermore if the molecular and atomic bonds have a significant impact, i.e. for E_n<S(α,β)_E_max with S(α,β)_E_max=4 eV in , the free gas model does not hold true anymore and S(α,β) tables grasping the complex underlying physics of neutron-molecule or neutron-atom interactions have to be used to compute both the cross sections and scattering kernels. These tables are available for most materials used in nuclear reactor physics such as light water or uranium dioxide, since it can significantly impact the simulation predictions.\nThe SVT assumption used to compute the final state for E_n<SVT_E_max is not valid for resonant heavy nuclei since their cross sections vary rapidly by a few orders of magnitude over a narrow energy range. To overcome this shortcoming, after a presentation in Section <ref> of the tools used in this work, in Section <ref> the Doppler Broadening Rejection Correction (DBRC) algorithm implementation and validation in are presented. Then in Section <ref> the on-the-fly cross section Doppler broadening process in is carefully studied and improvements are suggested.\n\n\n\n\n§ BENCHMARK METHODOLOGY AND TOOLS\n\n\n\nThe developments performed in this work have been done with version 11.00.p03. The results are compared to the reference neutron transport codes  (version 11) and  (version 6.2). is developed since the mid-1990s at CEA-Saclay (France) and is used as a reference code by the main French nuclear companies <cit.>. is developed at Los Alamos National Laboratory (United States) and is used worldwide as a reference neutron transport code for many applications involving neutrons. Both codes are used for criticality-safety system studies, depletion calculations and shielding applications. They benefit from a very large verification and validation database gathering more than 1000 experimental benchmarks and are regularly validated/qualified using inter-code comparisons <cit.>.\nThe evaluated data library ENDF/B-VII.1 <cit.> is used in this work through the G4NDL4.5 library in .\nIn the following, the developments performed in are validated with a differential-microscopic benchmark referred to as the thin-cylinder benchmark <cit.>. Its geometry is a thin cylinder with a radius r=1 μm and a length L=2 m. Mono-energetic neutrons, with a mean free path λ_n, are shot along the cylinder axis. The cylinder dimensions are chosen to have at least one collision (λ_n<<L) and to ensure that only one collision will occur in the cylinder (r<<λ_n). The neutron characteristics after the collision are tallied such as energy, angle, etc. It has to be mentioned that this thin-cylinder benchmark is a part of a broader set of automated benchmarks, which also includes an integral-macroscopic benchmark called the sphere benchmark in which the neutron flux is tallied within a 30 cm radius sphere having a mono-energetic and isotropic source at its center <cit.>. These automated benchmarks have been developed to test and assess the quality of new releases with respect to its Neutron-HP package. In this framework, once the simulations are performed, this tool compares the results to or results aggregated in a database and tests the statistical significance of the results to alert on potential problems. Finally it outputs a report summarising the results. This code is made available to the community on the following Gitlab repository <cit.> and will be included to .\nIn this work, the thin-cylinder material is set to ^238U because it has low energy resonances in its cross sections. The primary neutron energies are chosen to be below the first three resonances, i.e. at 6.52 eV, 20.2 eV and 36.25 eV. The temperature effects on the elastic scattering kernels have been investigated with the ^238U material set at 300 K, 600 K and 1000 K. For each temperature-energy combination 10^8 neutrons are simulated.  \n \n\n\n§ DOPPLER BROADENED NEUTRON ELASTIC SCATTERING KERNEL\n\n\n\n\n\n §.§ Study of the SVT algorithm for heavy nuclei\n\n\nThe effect of thermal motion on the final state definition is mainly important for elastic scattering, because it is a non-threshold and non-absorbing reaction. Therefore in many neutron transport codes the SVT algorithm is just applied to elastic scattering whereas in it is applied to all reaction channels (elastic, capture, etc). In the following only the elastic scattering reaction is considered. \nThe target nucleus thermal motion changes the outgoing neutron energy and scattering angle probabilities. To take it into account, the sampling of the velocity of the target nucleus 𝐕_t has to be done in a way that preserves the reaction rate given by Equation <ref> <cit.>. This sampling can be transformed into a selection of the pair (μ,V_t), where μ is the cosine of the angle between the neutron and target nucleus velocities. By introducing the exact form of ℳ(𝐕_t,T) into Equation <ref> and integrating it over the azimuthal angle, the following joint probability distribution can be written:\n\n\n    p(V_t,μ) dV_t dμ=v_rσ_0(v_r) β^3/π^3/2 V_t^2 e^-β^2V_t^2 2π/v_nσ_T(v_n)dV_t dμ\n\nwith β=√(M/2k_BT) and M the target mass. In this distribution μ and V_t are correlated and cannot be sampled independently. When the assumption is made that σ_0(v_r)/σ_T(v_n) is constant over the relative velocity range v_r, the SVT joint probability distribution is obtained:\n\n\n    p_SVT(V_t,μ) dV_t dμ = C dμ/2_(A)(v_n+V_t)4β^3/√(π)V_t^2 e^-β^2 V_t^2dV_t _(B)(v_r/v_n+V_t)_(C)\n\nIn the SVT algorithm, μ is firstly sampled uniformly between [-1,1].\nThen in sampling V_t from (B), V_t is sampled from 4β^3/√(π)V_t^2e^-β^2V_t^2dV_t with probability P_1=v_n/v_n+2/√(π)β and then from 2β^4 V_t^3e^-β^2V_t^2dV_t with probability P_2=1-P_1 <cit.>. Finally the pair (μ,V_t) is accepted with the probability given by (C) where v_r=√(v_n^2+V_t^2-2v_nV_tμ). \nThe SVT method in has been recently revised and successfully benchmarked against  <cit.>. In this work it has been again benchmarked with an emphasis on resonant heavy nuclei, here on ^238U, to validate the SVT algorithm which is the building block of the DBRC method. The default value of SVT_E_max has been increased from 400 k_BT (∼10.5 eV at 300 K) to 50 eV to use the SVT algorithm for the first three ^238U resonances. The Figures - left column - <ref>, <ref> and <ref> show that the energy of secondary neutrons calculated with agree well with within the statistical uncertainties. There is also an overall good agreement with for the energy-temperature combination for which the SVT algorithm is used in . In fact the default energy threshold SVT_E_max=400k_BT in could not have been changed in this work. \nTheses comparisons ensure that the SVT method is well implemented in and allows to validate once again the building block of the DBRC algorithm for resonant heavy nuclei that is now studied. \n\n\n\n\n §.§ DBRC method for resonant heavy nuclei\n\n\nThe assumption of the constant cross section leading to the SVT method is valid for light and medium nuclei since often their cross sections are constant at low energies. In the past it was assumed to be valid because it was thought that heavy nuclei do not significantly take part in the neutron slowing-down process. However it was shown <cit.> that the effect of low energy resonances should not be overlooked in resonant heavy nuclei especially for shielding and nuclear reactor applications. In fact, for example,  have demonstrated that treating exactly the elastic scattering kernel for the ^238U resonances with DBRC instead of using the SVT assumption leads to a change of the k_eff value by as much as 350 pcm and Doppler coefficients by 16 % for an infinite array of identical fuel pin cells based on a PWR subassembly. It can also impact the extraction of resonance parameters from experimental data such as in <cit.>.\nTo overcome the SVT approximation shortcoming, in the mid-1990s, Rothenstein and Dagan <cit.> successfully developed scattering kernels for resonant nuclei in the epithermal region through the extension of S(α, β) tables to higher energy. The DBRC algorithm that is now considered has been firstly proposed by Rothenstein <cit.> and put again into light recently by Becker et al. <cit.>. To exactly sample the (μ, V_t) pair from Equation <ref> on top of the SVT algorithm (Equation <ref>) another rejection loop/criterion (D) is added to get the exact Doppler Broadened elastic scattering kernel <cit.>:\n\n    p_DBRC(V_t,μ)=C' p_SVT(V_t,μ)  ( σ_0(v_r)/σ_0^max(v_ξ))_(D)\n\nwith C' a normalisation constant and σ_0^max(v_ξ) the maximum 0 K cross section in the range v_n± 4√(2k_BT/M). This range is chosen to be in accordance with the integral limits of the  algorithm used for an exact Doppler broadening process <cit.>. \nFrom the rejection term (D), it can be seen, that the acceptance probability can be small near a resonance. Therefore this additional term increases the probability of selecting a velocity V_t that makes the neutron scattered at the resonance energy. This leads to a computation time increase because of the low acceptance probability.\nThe DBRC method has been implemented in G4ParticleHPElasticFS::GetBiasedThermalNucleus on top of the existing SVT algorithm as in previous works <cit.>. To use and modify the behaviour of the DBRC algorithm in , the users have access to five new commands allowing to modify its behaviour as sketched in Figure <ref>:\n\n\n    \n  * /process/had/particle_hp/use_DBRC \n    to enable (true) / disable (false) the DBRC algorithm. By default it is disabled.\n\n    \n  * /process/had/particle_hp/DBRC_A_min \n    to set the minimum atomic mass in neutron masses for which the DBRC algorithm is applied. The default value is set to 200 amu.\n    \n    \n  * /process/had/particle_hp/SVT_E_max \n    to set the maximum energy up to which the SVT algorithm is used. The default value is set to 400 k_BT. The 0 K scattering kernel is used above the user defined value.  \n    \n    \n  * /process/had/particle_hp/DBRC_E_min(max)  \n    to set the minimum (maximum) energy between which the DBRC algorithm is applied. The default value of E_DBRC_min is set to 0.1 eV, below the SVT algorithm is used. This value should corresponds to an energy below which there is no nuclear resonance for the considered isotopes. The default value of E_DBRC_max is set to 210 eV. These values are set in accordance with <cit.>. \n\n\n\nThe DBRC method being not implemented in the current release, the DBRC results are only compared to . This latter has been validated by Zoia et al. <cit.> who have performed an exhaustive validation of its implementation against other ways to compute the Doppler broadening elastic scattering kernel such as the use of S(α,β) tables extended to higher energies <cit.>, the Weight Correction Method (WCM) <cit.>, or direct computation of the integral given by <cit.> in <cit.>. \n\n\nThe thin-cylinder benchmark has been performed in the same conditions as for the SVT benchmark. The DBRC results presented in the right columns of Figures <ref>, <ref> and <ref> show a very good agreement between and inside the statistical uncertainties. As can be seen, the secondary neutron energy distributions changes significantly compared to those obtained with the SVT method. Table <ref>, presenting the average scattered neutron energy, shows that the average energy with the SVT method remains the same for the different temperatures while with the DBRC method it increases with the temperature. and agree well with each other since the relative errors are around 10^-3 % for both SVT and DBRC methods. The average neutron energy increase agrees with the increase of the up-scattering probability (i.e. ratio of neutrons undergoing scattering with a higher energy than the initial neutron) as shown in Table <ref>. Again, here, the results between and are in good agreement since the relative differences are less than 1 %. \nAll these results validate the DBRC algorithm implementation in .\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ON-THE-FLY CROSS SECTION DOPPLER BROADENING IN \n\n\n\nIn Monte Carlo neutron transport codes, cross sections can be Doppler broadened mainly with two methods. The first method consists in performing exactly the Doppler broadening (given by Equation <ref>) before the simulation for example with the  algorithm implemented in a pre-processing tool such as <cit.>. Therefore no additional computation time is spent during the simulation for this. The drawbacks of this approach lies in the limited number of available temperatures for the simulation and the need to have a large computer memory size to store these data. It is mainly used in reference neutron transport codes such as and . The second method is more demanding in terms of computational time since the Doppler broadening is done during the simulation, i.e. on-the-fly (OTF), but can be made at any temperature required by the user. This latter has been chosen in for its versatility allowing to suit any needs from users coming from very different physics communities.\nIn comparing the thin-cylinder benchmark results from and , it was found that the total reaction rate from was different from , while relative values (such as the up-scattering probability) agree well between the two codes. This discrepancy arises because of the stochastic OTF Doppler broadening method implemented in . Its implementation can be seen, for example, in the G4ParticleHPElasticData::GetCrossSection method for elastic scattering and can be summarised as followed:\n\n[mathescape=true, language=C++, basicstyle=,label=lst:DBGeant4_OTF, caption=Pseudo-code of the implemented on-the-fly stochastic integral of the Doppler broadened cross section in . ]\n\n///Initialization\nsize=max(10, T/60)\n\n///On-the-fly stochastic integral computation\nwhile (|σ_T^old(v_n)-σ_T^new(v_n)| > ϵ_xs·σ_T^old(v_n))\n    σ_T^old(v_n)=σ_T^new(v_n)\n    while (counter<size)\n        sample 𝐕_𝐭 from Maxwell-Boltzmann distribution\n        get σ(v_r)\n        σ_T^new(v_n)σ(v_r)·|𝐕_𝐭-𝐯_𝐧|/v_n\n        counter\n    \n    σ_T^new(v_n)=σ_T^new(v_n)/counter\n    size size\n\nreturn σ_T^new(v_n)\n\nwith counter the total number of loops performed by the algorithm and size the number of loops for each batch. At each step, the Doppler broadened cross section is computed and compared with its previous value. The algorithm stops when a convergence criterion ϵ_xs is met. \nBy default ϵ_xs are set to 0.03 and 0.01 respectively for capture and elastic reactions and for fission and inelastic reactions. However, these criteria do not guarantee sufficient cross section convergence as already pointed out in <cit.> and as can be seen in Figures <ref> and <ref>. Therefore the impact of ϵ_xs on the capture and elastic scattering has been studied with the thin-cylinder benchmark at 300 K and with 6.52 eV neutrons. The quantities of interest are the mean cross section, its standard deviation and its most probable value (MPV) since the distributions are not symmetric as can be seen in Figures <ref> and <ref>. The OTF algorithm has been performed 8000 times to get statistical significant results for each convergence criterion. The results are compared to cross sections which have been computed exactly in using the  algorithm with .\nThe Figures <ref> and <ref>, presenting the mean and MPV cross sections, show that the mean cross section converges when ϵ_xs decreases and that the MPV is always approximately the same for all convergence criterion values and is equal to the converged mean cross section value. \nWith the default value ϵ_xs=0.03, the mean capture and elastic cross sections are respectively around 2 % and 10 % lower than ones. For ϵ_xs<0.001, the elastic and capture mean cross sections are converged to a value 1 % higher than ones as shown in Figures <ref> and <ref>. This 1 % discrepancy could be caused by interpolation errors since results are compatible with cross sections taken at 6.520 eV± 1 meV. This discrepancy is therefore not investigated further.\nThe evolution of the cross section standard deviation is also quantified in Figure <ref> as a function of ϵ_xs and shows a decrease from 23 % for elastic cross section (9 % for capture) at ϵ_xs=0.03 to less than 1 % for both cross sections for convergence criterion at ϵ_xs=10^-4. With these results, one can be tempted to change the default ϵ_xs value to a lower one, however a lower convergence criterion leads to a higher number of loops and therefore a higher computation time. In fact the computation time rises drastically as a function of ϵ_xs and then its increase starts to slow down from ϵ_xs=10^-4. In the future it could be worth to evaluate how this OTF algorithm performs compared to other algorithms such as the regression method <cit.>, the multipole representation of the cross section <cit.> or methods based on explicit treatment of target motion at collision sites <cit.>.\nIt has to be pointed out that all the results presented in Section <ref> have been computed with a convergence criterion set to ϵ_xs=10^-4 which is a trade-off between the cross section precision and computation time. Unfortunately this only can be done for benchmarking purposes, because of the prohibitive computation time for one OTF Doppler broadening algorithm call. However this problem would not be so important for integral studies since the Doppler broadening will be performed many times (at different energies) and so in average will give the right result.\nIt finally has to be recalled that this behaviour arises because the resonant part of the cross section is investigated. In fact for non-resonant cross sections, such as for ^1H, Figure <ref> shows that the cross section mean and MPV are approximately the same for all convergence criteria and agree with cross sections. The capture cross section is again around 1 % higher, which could be caused by interpolation errors because the 0 K cross section for elastic scattering is almost constant at 6.52 eV, whereas the capture cross section significantly decreases. The standard deviation is under 1 % for elastic and 0.2 % for capture for the default convergence criteria as can be seen in Figures <ref> and <ref>. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSION\n\nThe Doppler Broadening Rejection Correction algorithm used to describe accurately the elastic scattering kernel of resonant heavy nuclei has been successfully implemented into . The validation performed with the reference Monte Carlo neutron transport code showed a very good agreement between the two codes within the statistical uncertainties. The DBRC algorithm will be implemented in the next release. This work makes the Neutron-HP package at the state-of-the-art regarding the description of Doppler broadened elastic scattering kernels. The importance of the convergence criterion for the on-the-fly Doppler broadening routine has also been investigated and showed that the default convergence criterion values should be adapted on a simulation-by-simulation basis depending on the observable under study. With the developments performed in this work, the last missing feature in compared to reference neutron transport codes is the description of the unresolved resonance region with probability tables. This last point will be addressed soon in a dedicated paper.\n\n\n\n§ ACKNOWLEDGEMENT\n\n\nThis work could be done thanks to the IAEA´s technical cooperation programme, which supported a fellowship of Marek Zmeskal at IRFU, CEA in the framework of national project CZR0011 - Strengthening Human Resources Capacity in Nuclear Science and Technology.\nThe authors wish to sincerely thank Cédric Jouanne and Alberto Ribon head of the Hadronic Working Group for fruitful discussions respectively regarding and . \n is a registered trademark of CEA. \n\n\n\n\n\nunsrtnat\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}