{"entry_id": "http://arxiv.org/abs/2303.07297v2", "published": "20230313172109", "title": "Disc population synthesis: decrease of the solid mass reservoir through pebble drift", "authors": ["Johan Appelgren", "Michiel Lambrechts", "Nienke van der Marel"], "primary_category": "astro-ph.EP", "categories": ["astro-ph.EP", "astro-ph.SR"], "text": " \n\n\n   \n   \n   Disc population synthesis\n\n\n\n   \n\n   \n    1 Lund Observatory, Department of Astronomy and Theoretical Physics, Lund University, Box 43, 22100 Lund, Sweden \n\n    email: johan@astro.lu.se \n\n    2 Center for Star and Planet Formation, GLOBE Institute, University of Copenhagen, Øster Voldgade 5-7, 1350 Copenhagen, Denmark \n\n    3 Leiden Observatory, Leiden University, P.O. Box 9531, NL-2300 RA Leiden, the Netherlands \n         \n             \n\n   \n\n\nSurveys of star-forming regions reveal that the dust mass of protoplanetary discs decreases by several orders of magnitude on a timescale of a few million years. This decrease in the mass budget of solids is likely due to the gas-drag-induced radial drift of mm-sized solids, called pebbles. However, quantifying the evolution of this dust component in young stellar clusters is difficult due to the inherent large spread in stellar masses and formation times. Therefore, we aim to model the collective evolution of a cluster to investigate the effectiveness of radial drift in clearing the discs of mm-sized particles. We use a protoplanetary disc model that numerically solves for disc formation, and the viscous evolution and photoevaporative clearing of the gas component, while also including the drift of particles limited in size by fragmentation. We find that discs are born with dust masses between 50 M_ and 1000 M_, for stars with, respectively, masses between 0.1 M_⊙ and 1 M_⊙. The majority of this initial dust reservoir is typically lost through drift before photoevaporation opens a gap in the gas disc for models both with and without strong X-ray-driven mass loss rates. We conclude that the decrease in time of the mass locked in fragmentation-limited pebbles is consistent with the evolution of dust masses and ages inferred from nearby star-forming regions when assuming viscous evolution rates corresponding to mean gas disc lifetimes between 3 Myr and 8 Myr.\n\n\n\n\n \n  \n  \n  \n   \n\n   \n\n   Disc population synthesis: decrease of the solid mass reservoir through pebble drift\n    J. Appelgren\n          1\n          ,\n          M. Lambrechts2,1\n          N. van der Marel3\n          \n    Received ; accepted \n==========================================================================================================\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nSurveys of young star-forming regions, such as the 1 Myr-old Perseus cluster, reveal typical dust disc masses that exceed 100 M_ <cit.>. Older star-forming regions, on the other hand, often show much reduced dust masses, by up to two orders of magnitude, although with large spread <cit.>. However, care should be taken in the interpretation of individual dust disc mass measurements, as these depend on model choices such as the chosen opacity prescription, particle size distribution, and assumptions on optically thin continuum emission <cit.>. \n\n\nThe dominant process responsible for removing dust is not yet completely clear. Two likely candidates are the radial drift of dust pebbles and the formation of planetesimals and planets. Radial drift occurs due to gas drag from gas on sub-Keplerian orbits removing angular momentum from the pebbles, which causes them to drift inwards in the disc <cit.>. If dust particles are sufficiently large, this occurs in most regions of protoplanetary discs but can be halted at locations with a pressure bump where gas drag is not present <cit.>. In <cit.> we studied the effect of radial drift in population synthesis models and found radial drift to be compatible with typical measurements of disc dust masses. However, this study only traced a single dust size and did not include gas disc clearing by photoevaporation. The effect of limiting dust growth by fragmentation and the impact of photoevaporation will be the focus of this population synthesis study. \n\nEstimates of dust grain sizes in protoplanetary discs have found maximum sizes on the order of mm-cm, based on measured opacity slopes <cit.>. However, if maximum dust sizes are estimated from the degree of polarisation in the emission from protoplanetary discs, typically lower maximum sizes of 0.10-0.15 mm are found <cit.>, although 1 mm is still possible for very low turbulence values <cit.>. Dust coagulation is a complex process where the collision of two particles can result in very different outcomes, including sticking, bouncing, fragmentation, mass transfer, cratering and erosion, depending on the sizes and velocities of the two particles <cit.>. The outcome of these coagulation processes sets the size, and therefore Stokes number, of the largest particles that characteristically hold a very large fraction of the total disc dust mass <cit.>. Importantly, the dominant particle size affects not only the speed of the radial drift of these particles but also their ability to form planetesimals via the streaming instability <cit.> and the efficiency of pebble accretion <cit.>.\n\nProtoplanetary discs are formed together with their host star when dense cores of giant molecular clouds collapse under their own gravity. The formation of the disc is thought to last a few hundred thousand years to ∼1 Myr <cit.>. As the disc continues to evolve, gas accretion removes gas from the disc over a timescale of a few to several million years <cit.>. The accretion of gas is driven by a redistribution of angular momentum in the discs. The mechanism behind the redistribution is not fully understood yet, but has been believed to be disc turbulence driven by the magnetorotational instability (MRI)<cit.> or disc winds <cit.> or a combination of the two. For a recent review on magneto-hydrodynamic disc processes see <cit.>. Due to the lack of understanding on what drives the turbulence, this is commonly parameterised by the well-known α-disc model <cit.>. During this time, gas accretion rates drop from as high as 10^-6 M_⊙/yr, for the youngest discs, to ≲ 10^-9 M_⊙/yr for discs as old as a few million years <cit.>. Simultaneously, the gas disc mass is reduced from ∼ 0.1 M_⊙ to ∼ 0.001 M_⊙ <cit.>. However, estimating gas disc masses from, for example, CO gas emission, is highly uncertain. Therefore, dust disc masses have been used to infer gas disc masses, under the crude assumption of a global dust-to-gas ratio of 0.01 <cit.>. This value is typical of the interstellar medium, but no longer valid when considering the effects of pebble drift <cit.>. Furthermore, dust disc masses themselves may be underestimated if the millimeter emission is optically thick. \n\n\n\nIt is important to include the correct range of stellar masses when trying to model the evolution of a cluster of discs. Lower mass stars are more commonly formed than solar mass stars according to the stellar initial mass function <cit.>. The dominating presence of sub-solar stars is of importance because the mass of dust discs has been found to scale with the stellar mass in nearby star-forming regions as M_dust∝ M_⋆^1.3-2.4, although with a large scatter <cit.>. Similarly, a trend has been found where higher stellar gas accretion rates relate to more massive dust discs, but again with a significant scatter <cit.>.\n\nThe final dispersal of the gas component of protoplanetary discs is suggested to be driven by photoevaporative winds <cit.>. A combination of EUV, X-ray and FUV radiation heats the gas at the disc surface to the point where the gas becomes gravitationally unbound and is lost from the disc. When the gas removal rate via photoevaporation and the gas accretion rate through the disc become comparable, the inner disc is no longer efficiently replenished by gas. This results in the efficient dispersal of the inner disc, creating an inner disc cavity that expands outwards with time.\n\n\nSeveral prescriptions of photoevaporation aimed for use in population synthesis models have been developed. <cit.> provide a prescription for X-ray-driven photoevaporation, which was extended with an updated X-ray photoevaporation prescription <cit.>. <cit.> provide an alternative prescription for photoevaporation driven by extreme ultraviolet (EUV), far ultraviolet (FUV), and X-rays, using a method similar to <cit.>. The importance of each of these drivers has been the subject of a number of studies. EUV and X-rays are more straightforward to model, whereas FUV is a bigger challenge because it is affected by dust evolution and chemistry <cit.>. <cit.> concluded that X-rays are the dominant driver of photoevaporation. <cit.> similarly argued that X-rays dominate over EUV. In contrast to this, <cit.> found that FUV-driven photoevaporation is dominant. We will explore the impact of both the <cit.> and the <cit.> models.\n\nIn this paper, we first elaborate on the method used for the population synthesis model (Sect. <ref>). We then present the results of the study. We focus on the evolution of the disc dust mass and how its evolution is affected by the strength of the assumed disc viscosity and the two different photoevaporation prescriptions available in the literature (Sect. <ref>). This is followed by a discussion of our results, their stellar mass dependency, and the implications on the gas and dust radius evolution with time in Sect. <ref>. Finally, we present our conclusions in Sect. <ref>.\n \n\n\n\n\n\n§ MODEL\n \n\nIn this paper we present an update to the disc model used in <cit.>. As in the previous paper, we calculate the evolution of discs around stars in a newly formed stellar cluster using viscous gas evolution and radial drift of solids. We briefly review the used methodology here. In addition, we now evolve the size of the dust particles, include clearing of the gas disc by photoevaporation, and we use a more complete temperature treatment.\n\n\n\n\n §.§ Disc formation\n\n\nThe formation of the protoplanetary disc is modelled from the collapse of an over-dense Bonnor-Ebert sphere, similar to <cit.>. The collapse occurs inside-out with the collapse front expanding outwards over time. The infall rate of gas mass onto the disc is given by \n\n    Ṁ_g, inf = 4 π r_cf( t )^2 ρ ( r_cf( t ) ) d r_cfd t,\n\nwhere r_cf is the radius of the collapse front, ρ(r_cf) is the density of the cloud core at this radius and dr_cf/dt is the velocity at which it expands outwards. A more detailed description of how these quantities are calculated can be found in Appendix A of <cit.>.\n\nThe gas is distributed across the disc according to the following equation \n\n    Σ̇_g, inf(r) = Ṁ_g, inf8π R_c^2( rR_c)^-3/2[ 1 - (rR_c)^1/2]^-1/2.\n\nThe infalling material lands on the disc within the centrifugal radius R_c, which is given by\n\n    R_c = Ω_0^2 r_cf( t )^4G M( r_cf, ),\n\nwhere Ω_0 is the rotation rate of the cloud core and M(r_c) is the mass interior to the collapse front radius. We assume here that the angular momentum of the infalling material is conserved. This is a simplification that ignores the role of magnetic braking <cit.> and possible anistropic accretion <cit.>. However, detailed modelling of the angular momentum of molecular cloud cores and their evolution during the collapse phase is beyond the scope of this article. \n\n\n\n\n\n §.§ Gas disc evolution\n \n\nWe evolve the disc viscously using the well-established alpha-disc prescription of <cit.>, where the viscosity of the disc is described by ν = α c_s^2/Ω. Here, c_s is the sound speed and Ω is the rotation rate in the disc, and α sets the strength of the viscosity. We treat α as the value which evolves the disc on a timescale consistent with measured disc lifetimes. We do not treat it as being a measure of the true level of midplane turbulence stirring the dust midplane of the disc, which has been observationally inferred to be much lower in the disc <cit.>. The latter we instead parameterise as α_t, which we also use to calculate the size of fragmentation-limited dust (see Sect. <ref>). \n\n\nUsing accretion rates of pre-main sequence stars, <cit.> found  α = 10^-2. However, recent estimates of line-width broadening by turbulent motions in outer disc regions have found values of α≲ 10^-3 <cit.>. Moreover, measurements of the fraction of stars with discs in star-forming regions suggest that the discs dissipate with a characteristic timescale of 2.5-3 Myr <cit.>. Such disc lifetimes of ∼ 3 Myr would suggest high α-values to drive  disc evolution. However, more recent measurements of the disc fraction finds that, in those star-forming regions that are not subject to external photoevaporation, the characteristic timescale for disc dissipation is ∼ 8 Myr <cit.>. The slower disc evolution that the longer disc dissipation timescale indicates would suggest lower values of α. We use a base value, which we label as α_ν, of either 10^-2 or 10^-3 in order to explore both scenarios of faster and slower disc evolution. In practise, α is calculated as \n\n    α = α_ν + e^-Q^4,\n\nwhich increases the disc viscosity when the disc becomes\ngravitationally unstable following <cit.>. Here, Q is the Toomre parameter expressing the gravitational stability of the disc. \n\n\nThe viscous evolution of the disc is calculated using the equation from <cit.>. The total surface density evolution of the disc is then given by \n\n    ∂Σ_g∂ r = 3r∂∂ r[ r^1/2∂∂ r( νΣ_g r^1/2)  ] +Σ̇_g, inf(r) - Σ̇_g, PE,(r)\n\nwhere Σ̇_g, PE is the mass loss due to internal photoevaporation. How we calculate this is explained in Sect. <ref> and Appenidx <ref>.\n\n\n\n §.§ Dust evolution\n\n\nThe infall rate of dust onto the disc is the infall rate of gas multiplied by the assumed dust-to-gas ratio of the cloud core. We assume this to be uniformly Z=0.01. \n\n\n\n  §.§.§ Dust drift\n\n\nThe evolution of the dust in the disc is governed by the radial gas flow and  the radial drift of the dust particles. Radial drift occurs because the dust feels a slight headwind from the gas that orbits at a sub-Keplerian velocity <cit.>. This headwind removes angular momentum from the dust causing it to drift inwards in the disc. The speed at which the dust drifts is given by\n\n    v_drift = - 2τ_s1 + τ_s^2η v_k.\n\nHere, v_k is the Keplerian orbital velocity and η is a measure of the radial pressure support in the disc given by\n\n    η = -12(Hr)^2 dln Pdln r.\n\nThe Stokes number, St, of the dust particles is a measure of how aerodynamically coupled particles are to the gas. The ratio H/r expresses the gas disc aspect ratio. To calculate the Stokes number we take into account the Epstein and the Stokes regimes given by\n\n    St =  √(2π)ρ_∙ a_dΣ_g    if a_d < 94λ_mfp, \n    49a_dλ_mfp√(2π)ρ_∙ a_dΣ_g    if a_d≥94λ_mfp.\n\nHere, ρ_∙ is the material density of the dust particle which we set to 1.6 g/cm^3 <cit.>. The size of the dust grains, a_p, is discussed further in Sect. <ref>.\n\nBecause the dust is coupled to the gas, small grains simply move along with the gas in the disc. Taking this into account, the total radial velocity of the dust, v_d, is given by \n\n    v_d,r = v_drift + v_g1 + St^2,\n\nwhere v_g is the radial velocity of the gas. The surface density of dust is then evolved with the following continuity equation\n\n    ∂Σ_d∂ t = -1r∂∂ r(rΣ_d v_d,r) + Σ_d,inf.\n\n\n\n\n\n\n  §.§.§ Dust sizes\n \n\nWe follow the evolution of the largest grains that carry most of the mass in typical dust size distributions <cit.>. The dust grows from an initial monomer size of 1 μ m to the fragmentation limit on a time scale given by \n\n    t_grow = Σ_gΣ_dΩ_K.\n\nFor grains that reach their maximum size limit by fragmenting, the maximum grain size is set by \n\n    a_frag = f_f23πΣ_gρ_∙α_tu_f^2c_s^2,\n\nwhere f_f = 0.37 is a fudge factor to better match detailed coagulation simulations <cit.>. We set the level of the midplane turbulence α_t to 10^-4, in line with the lower α values inferred from observations <cit.>. Note that we treat it as a separate parameter from α_ν (Eq. <ref>). The fragmentation threshold velocity, u_f, depends on the material properties of the grains. Laboratory experiments of silicate dust grain collisions suggest limits of about 1 m/s <cit.>.  Water ice was thought to be stickier than silicates and have a fragmentation speed of about 10 m/s <cit.>. However, more recent studies conclude that the fragmentation speed of water ice is likely to be lower. The stickiness of CO_2-ice is also thought to be quite low, with fragmentation speeds of about 1 m/s <cit.>. Similar results are found for mixtures of water and CO_2 ices <cit.>. Therefore the choice of 1 m/s as a global fragmentation velocity should be suitable. \n\n\nParticles that are not limited by fragmentation in their growth naturally approach their drift-limited sizes in our model. Their maximum size is then bound by \n\n    a_drift = f_d2Σ_dπρ_∙v_k^2c_s^2γ^-1,\n\nwhere f_d = 0.55 is a fudge factor with similar purpose as f_f and γ = |dln P/dln r| <cit.>. \n\n\n\n\n\n §.§ Disc temperature\n\n\n\n The temperature of the disc is calculated similar to <cit.>. We include irradiation and viscous heating. The temperature due to irradiation is given by  <cit.>\n \n    σ_SB T_irr, ⋆^4 = L_⋆4π r^2Hr(dln Hdln r - 1 ),\n\nwhere L_⋆ is the stellar luminosity. We assume that the luminosity of the star scales linearly as L_⋆ = L_⊙(M_⋆/M_⊙) <cit.>. \n\nThe heating rate due to irradiation is given by <cit.>\n\n    Γ_irr = 8σ_SB( T_irr, ⋆^4 + T_core^4 )τ/2 + 1/√(3) + 1/(3τ),\n\nwhere T_core = 10 K is the temperature of the cloud core, τ = κΣ/2 is the optical depth and κ is the opacity.\n\nThe heating rate due to viscous heating is given by <cit.>\n\n    Γ_Visc = 94νΣ_g(r ∂Ω∂ r)^2.\n\nHeat is lost from the disc by radiative cooling  <cit.>\n\n    Λ_rad = 8σ_SBT_mid^4 3( τ/2 + 1/√(3) + 1/(3τ) ),\n\nwhere T_mid is the midplane temperature of the disc. The midplane temperature due to irradiation and viscous heating is given by the balance of the heating and cooling rates. \n\nWe use an opacity prescription similar to <cit.>, where the opacity is that of solid grains and given by κ = 0.052 cm^2/g (T/K)^0.738 <cit.>. This opacity scaling assumed a solar composition of dust grains. However, above a temperature of ∼ 1500 K most dust will have sublimated. This will cause the opacity to drop and the disc to cool until the dust solidifies again. Unless the much lower gas opacity is enough to drive the disc to higher temperatures, this results in a temperature plateau around 1500 K. This effect has been found in more complex disc temperature models <cit.>. We therefore impose a temperature limit of 1500 K in our model. \n\n\n\n\n §.§ Photoevaporation\n \n\n\n\n\n\n\n\n\n\nPhotoevaporation removes gas from the surface of the protoplanetary disc by either EUV, FUV, or X-rays heating the gas until it can escape the disc <cit.>. In this work, we look at two different photoevaporation prescriptions, one by <cit.> (hereafter Pic21) and one by <cit.> (hereafter Kom21).\n\nThe two prescriptions differ in the physics that is included, and also in the methods used to derive photoevaporation rates. To model photoevaporation  includes X-rays and EUV radiation, although the X-ray component is the dominant contributor to the heating and mass loss rate <cit.>. The model from  includes X-rays, EUV, and FUV radiation, with here the FUV radiation being the dominant source of heating. In this model, the X-ray contribution is negligible, as illustrated in Fig. <ref> where mass loss rates are driven by the FUV radiation, even if the FUV fraction would be reduced by a factor hundred.\nWe, therefore, choose to present both these models to reflect the uncertainty in modeling photoevaporative mass loss (for a further discussion, see Sect. <ref>). \n \n\n\nThe equations and their parameters used to calculate the photoevaporation rates are given in Appendix <ref>. To find the parameters for stellar masses that fall in between the ones given in either model, we linearly interpolate over the grid of masses. For stellar masses that fall outside the range of masses modelled in the prescriptions we use the parameters for the lowest/highest mass given to avoid extrapolating. We do this because, in general, the parameters of either prescription are not monotonically increasing or decreasing with stellar mass. For the  model, this upper mass is 1 M_⊙ and stars above this mass will be very uncommon in our sample, therefore the choice of using the 1 M_⊙ cut off will be of little consequence. With the   model the lower mass is 0.3 M_⊙ and thus more stars will be affected since our stellar masses extend to ≲ 0.1  M_⊙, possibly leading to moderately overestimating the photoevaporation rate for very low-mass stars. \n\n\n\n\n\n\n\n\n\n §.§ Population Synthesis\n \n\nThe main cloud core parameters that are varied in the population synthesis are the mass and angular momentum. The masses of cores in molecular clouds are described by the so-called core-mass-function (CMF). This is similar in form to the initial mass function of stars (IMF) <cit.>. Therefore, we sample masses of the cloud cores from the Kroupa IMF <cit.>. We limit our sampling to masses between 0.1–2 M_⊙.\n\nTo set the angular momentum of the cloud core, we set the maximum centrifugal radius, which is connected to the angular momentum of the cloud core through Eq. <ref>. This is the largest radius at which any material will land on the disc during its formation. We select centrifugal radii from a normal distribution with a standard deviation of 30 au and a mean scaled linearly with the cloud core mass as \n\n    R_c = 10  au (M_core/M_⊙),\n\nas in <cit.>. In order to limit the number of parameters varied in the population synthesis, we chose to use a fixed value for the temperature of the cloud core of T_core = 10 K across all simulations.\n\nThe stars in a young star-forming cluster do not all form at the same time. \nFor instance, star formation in the star-forming region of Taurus is thought to have been going on for 1-2 Myr <cit.>. Across Orion, for discs in isolation, the spread in disc mass is likely related to an age spread <cit.>. Therefore, for the internal age spread of the discs, we use a value of 1 Myr. \n\nWhen a protoplanetary disc forms, it will inherit the dust-to-gas ratio of its parent molecular cloud core. The metallicity of a clump in a giant molecular cloud which forms s stellar cluster is thought to be very homogeneous, due to a very short mixing timescale <cit.>. Hence, we do not vary the initial dust-to-gas ratio of the cloud cores and keep the nominal value of Z = 0.01 for all cloud cores in the population synthesis.\n\nFinally, we run two population synthesis copies with the same cloud core masses and centrifugal radii, but one using the  prescription and the other using the  prescription. The discs are evolved for 10 Myr using α_ν = 10^-2 (Sect. <ref>) and α_ν = 10^-3 (Sect. <ref>) for disc lifetimes of 2.5 Myr and 8 Myr <cit.>, respectively.\n\n\n\n\n\n\n§ RESULTS\n\n\n\n\n\n\n §.§ Evolution of a single disc\n \n\n Before presenting the population synthesis results, we show the evolution of a single protoplanetary disc to illustrate the key physical processes at play. For this, we started a model with a molecular cloud core with a mass of 1 M_⊙ and a maximum centrifugal radius of 10 au. We used an α-viscosity of α_ν = 10^-2, together with the -photoevaporation prescription. Other model parameters are the same as described in Sect. <ref>. \n\n\n\n\nViscous evolution dominates the gas disc for the first ∼ 3.7 Myr, after which photoevaporation begins to quickly carve out a gap in the gas. A gap in the disc forms at an orbital distance of about 3–4 au. This is seen in Fig. <ref>, which shows the evolution of the temperature (left panel), gas surface density (middle panel), and dust surface density (right panel). Once the gap opens up, dust drift over this gap is prevented because the decreased pressure gradient at the gap edge (Fig. <ref>, panel b). For this nominal case, we find that 0.6 M_Earth of dust was trapped outside the gap, which gradually is pushed outwards as the inner cavity expands.\n\nThe radially inwards flux of pebbles is highest in the inner disc, early in its evolution (Fig. <ref>, left panel). However, during the early times (≲ 0.35 Myr) dust also has an outwards motion in the outer disc region between 10–400 au, because the gas in this region is expanding viscously outwards and the dust is well-coupled to it. The dust flux drops over time until a gap is opened up by photoevaporation. The dust remaining within the gap is quickly pushed inwards, whilst the dust retained outside the gap is slowly pushed outwards. This latter effect is represented by the thin sliver of dust shown in green in the top right of the left panel in Fig. <ref>. \n\n\nThe dust-to-gas ratio exceeds the initial value of 0.01 at two regions in time and space (Fig. <ref>, middle panel). It occurs when the disc is 0.2–0.4 Myr old at radii between 0.1–5 au, and at a later time, between 0.6–0.9 Myr, at radii between 0.1–1.5 au. The high dust-to-gas ratio makes these potential sites for planetesimal formation <cit.> (see also Sect.  <ref>). \n\nParticles do not grow beyond cm in size, except at early times, within ≲ 1 Myr (Fig. <ref>, right panel). Around 1 au there is a local minimum in the particle size distribution. This region is located where the disc transitions from the maximum temperature of 1500 K to lower temperatures at wider radii where stellar irradiation is dominant in setting the disc temperature rather than viscous heating. \n \n\n \n\n\n §.§ Population synthesis with α_ν = 10^-2\n \n\nIn this section we will present the results from the population synthesis model using α_ν = 10^-2. The value of α_ν which best matches observations of protoplanetary discs lifetimes is still a matter of debate, as discussed in Sect. <ref>. We show results for α_ν = 10^-3 in Sect <ref>. \n\n\n\n\n  §.§.§ Gas disc evolution\n\n\nThe evolution of the gas accretion rate over time for all discs in the population synthesis is shown in Fig. <ref>.  \nDiscs evolving under  photoevaporation (red curves) are dominated by viscous evolution for about 1–3 Myr before photoevaporation takes over. In the  prescription (black curves) discs undergo viscous evolution for longer times. Photoevaporation clears the inner parts of discs at the earliest after about 5–6 Myr, and for some discs photoevaporation never plays an important role during the 10 Myr that we simulate. \n\n\n\n\nNewly formed discs have gas masses ranging from 0.03 M_⊙ to 0.5 M_⊙. These gas discs are then depleted by accretion and photoevaporation (Fig.  <ref>). For both the  and  photoevaporation prescriptions, the mass reservoir diminishes until approximately 1 % of the initial mass remains. This remainder of gas is found outside the photoevaporative gap at large orbital radii. Therefore, it takes excessively long to deplete by photoevaporation. However, the gas surface densities in these gas-poor regions \n\n\n\n\n\n\n\n  §.§.§ Dust disc evolution\n \n\nRadial drift of pebbles reduces the dust mass of protoplanetary discs on a timescale of a few Myr. This is illustrated in the middle panel of Fig. <ref>, which shows the evolution of the dust mass as a function of disc age. Discs are formed from cloud cores with gas masses between ∼ 0.1  M_⊙ and ∼ 1  M_⊙, and are born with dust disc masses between of 50 M_ and 1000 M_ respectively. The least massive and shortest lived discs are depleted of dust within less than 1 Myr, whilst the most massive and longest lived discs last up to 7 Myr. This process is also seen in the evolution of the cumulative distribution of dust disc masses at cluster ages between 0.5 Myr and 5 Myr, as shown in Fig. <ref>. In the 0.5 Myr-old cluster, 73 % of discs have a disc dust mass higher than 10 M_. At 1 Myr this has decreased to only 45 % of discs having over 10 M_ of dust. From here on we see a continued decrease in the available disc dust mass as more and more dust drifts onto the star. \n\n\nWe do not find that photoevaporation is able to retain significant amounts of dust by gap opening. Using the  prescription, all discs retain  <0.1 M_ of dust. With the <cit.> model, we find that 20 % of all discs are able to retain at least 0.1 M_ of dust. However, of these discs the median mass retained is only 0.3 M_. The median mass of these discs right at the end of their formation, which is when they are the most massive, is 367 M_. Hence, these discs retain less than 0.01 % of their maximum dust mass.  For comparison, the observed median dust masses in protoplanetary disc surveys at ∼ 2 Myr are 3.0 M_ (Lupus), 3.2 M_ (Cham I), 6.2 M_ (Taurus), and 11.5 M_ (Cham II) <cit.>.\n\nThe retention of dust by gap opening can also be seen in Fig. <ref>, where the gas accretion rate as a function of dust disc mass is shown for each disc using both photoevaporation models. Discs start out with high gas accretion rates (∼ 10^-6 M_⊙/yr) and low disc dust masses. For the   model (red curves) some of these discs reach a phase where the gas accretion turns over at rates between 10^-8 and 10^-9 M_⊙/yr, due to photoevaporation clearing the inner disc of gas, whilst retaining some dust. These are the discs where photoevaporation has trapped dust outside the gas gap. None of the discs using the  model (black lines) go through this phase, showing that all these discs lost all of their dust before photoevaporation opened up a gap. \n\n\nThe efficient depletion of dust by radial drift agrees with our previous results from <cit.> where radial drift is the dominant process for removing dust from protoplanetary discs. Other mechanisms of dust removal, such as planetesimal formation and subsequent planet formation, would only further deplete the dust reservoir and will be discussed in Sect. <ref>. \n\nIf radial drift would not be effective, the dust would evolve by advecting with the gas and therefore be lost at the same rate as the gas. The cumulative distribution of disc dust masses in this case is shown with the thin coloured lines in the left plot of Fig. <ref>. For this experiment, we calculated these dust masses by multiplying the gas mass of each disc with the initial dust-to-gas ratio and kept it fixed at a constant value of Z=0.01 in our simulations (Sect.  <ref>). In this case, dust is lost very slowly, and the profile of the cumulative distribution remains similar throughout the evolution of the cluster. \n\nFor comparison, we show a sample of observed dust disc masses in different star-forming regions in the right plot of Fig. <ref>. The observed sample is taken from <cit.>. To get the occurrence fraction with respect to the full population of stars in the cluster, we scale the cumulative distributions of this sample according to Eq. <ref> (for more, see Appendix <ref>), assuming a gas disc lifetime of 2.5 Myr <cit.>. Note that the model disc masses presented in this paper are the masses as given directly by the model, that is the integrated surface densities. We do not take into account optical depth effects of the dust to model the dust disc mass that would effectively be observable. The observable dust disc mass would be expected to be somewhat lower than the model masses. \n\n\n\n\n\n\n\nAt a cluster age of 0.5 Myr and 1 Myr, we find in the model median dust disc masses of ∼ 30 M_ (0.5 Myr) and  ∼ 5.5 M_ (1 Myr). This can be compared to the Perseus sample, which has significantly higher median masses for class 0 objects (158  M_) and class I objects (52  M_) <cit.>. In these early stages of disc evolution radial dust drift could be less efficient than we find here. However, determining the masses of young embedded discs remains challenging <cit.>. \n\nFor the more evolved discs we find that the distribution of observed discs aged between 1–3 Myr all lie in between the 1–3 Myr old cluster in our population synthesis. The observed disc dust masses lie closer to the 2–3 Myr older model clusters than the 1 Myr model clusters. For the oldest observed cluster, Upper Scorpius, only the oldest model cluster (5 Myr) with the  photoevaporation model lies somewhat close. Using the  photoevaporation prescription, too much dust is retained in too many discs. However, the fate of solids concentrated at the cavity edge is uncertain (see Sect. <ref> and <ref>). \n\nIf we compare the observed sample to the expected dust mass for models without radial drift (thin coloured lines in Fig. <ref>) it is clear that the match is very poor, with the exception of the Perseus discs. This indicates that dust in discs that are a few Myr old has been lost at a higher rate than the gas. Therefore, the sometimes-used assumption that the gas mass in protoplanetary discs is 100 times their dust mass does not hold. We see this in the right panel of Fig. <ref>, which shows the evolution of the global dust-to-gas ratio of all discs as a function of their age. Note that, even though the cloud cores from which the discs form initially have dust-to-gas ratios of 0.01, efficient radial drift of dust very early in the disc evolution decreases the global dust-to-gas ratio, already very early in the disc evolution (≲ 10^5 yr). \n\nAlthough radial drift is able to qualitatively match the cumulative disc dust mass distributions well, there is one component of the observational sample which is not well-reproduced: the observed clusters show that there is a fraction (∼ 10%) of discs which retain large amounts (≥ 10 M_) of dust at late times <cit.>. In Appendix <ref> we show an experiment of halting dust drift in a subset of the most massive discs. We find that stopping dust drift in a fraction as low as 5 % of the discs can extend the high-mass tail of the CDF, bringing the model more in line with the observations. This supports the claim that ∼ 5%-10% of discs have a reduced efficiency, or complete halting, of radial dust drift. This group of discs can represent a population of discs in which radial drift is less efficient. A likely mechanism for preventing radial drift of pebbles is the presence of pressure bumps in the protoplanetary disc, possibly triggered by wide-orbit planets. We discuss this further in Sect. <ref>.\n\n\nAn important measure of disc evolution is the relation between the gas accretion rate onto the star and the dust disc mass. This is shown in Fig. <ref>, where the lines shown the model and the grey dots show observational measurements from <cit.>. Here, we see that a large region of parameter space with relatively low accretion rates of less than about 10^-8 M_⊙/yr and dust disc masses of over 1 M_ is populated by the observed sample. Our synthesis model with the  photoevaporation does not produce such dust-rich discs with low gas accretion rates. This region contains roughly half of the of observed sample. Using the  photoevaporation prescription, an even smaller region of the observed sample is reached. Only those discs with accretion rates of about 10^-8 M_⊙/yr or more are reproduced.\n\n\n\nThe disagreement between model and observation in the gas accretion rate and dust disc relation could originate from an overestimate in the model of the gas accretion rate onto the host star. Lower gas accretion rates onto the star are possible if disc winds remove some gas from the inner disc before it is accreted onto the host star <cit.>. Alternatively, dust could have been consistently retained in heavily gas-depleted discs, in apparent conflict with the evolution of the cumulative mass distribution (Fig. <ref>). Finally, our models could be consistent with the observations if the estimated mass flux onto the host star is somehow underestimated from the accretion observations.\n\n\n\n\n\n\n\n §.§ Population synthesis with α_ν = 10^-3\n \n\n\n\n\n\nLowering the viscous α_ν has a number of effects on the evolution of a protoplanetary disc. In general, the disc will evolve more slowly as angular momentum transport is less efficient. Although, when the disc is very young, the increased viscosity due to gravitational instabilities can dominate over the base viscosity, making early evolution somewhat similar for different base α_ν values (Eq. <ref>). The slower viscous evolution results in photoevaporation becoming dominant at later times and therefore longer gas disc lifetimes. Viscous heating is also less efficient, leading to a cooler disc, further slowing down the evolution.\n\nThe effect on the dust component is less straightforward. A slower gas evolution results in generally higher gas surface densities. This, in turn, results in lower Stokes numbers and slower dust drift (Eq.  <ref> and <ref>). However, the particle size in the fragmentation limit is linearly dependant on the gas surface density (Eq.   <ref>). Therefore, Stokes numbers do not change significantly (for a fixed value of α_t). However, the dust is also advected with the gas. At α_ν = 10^-3 the radial gas velocity is slower than at α_ν = 10^-2, resulting in less dust being removed from the disc by pure advection with the gas. The dust disc is therefore effectively drained at a lower rate at α_ν = 10^-3 compared to α_ν = 10^-2. \n\nWe do not find that the retention of dust by photoevaporative gaps is significantly different at α_ν = 10^-3 compared to α_ν = 10^-2 (Fig. <ref>). The dust discs are longer lived by a few million years at α_ν = 10^-3 compared to α_ν = 10^-2, the gas discs also evolve slower and a photoevaporative gap opens up typically 1-2 Myr later. The fraction of discs which retain >0.1  M_ of dust outside the photoevaporative gap is 20% at α_ν = 10^-2 and  15% at α_ν = 10^-3.  Using α_ν = 10^-2 the median dust mass retained outside the photoevaporative gap is 0.3 M_, compared to 0.2 M_ when using  α_ν = 10^-3.\n\nThe observed cumulative distributions (right panel of Fig. <ref>) were as before scaled according to Eq. <ref>, but with a disc lifetime of τ = 8 Myr, following <cit.>. This lifetime is derived by excluding regions with high external photoevaporation. It should therefore be more representative of the observational sample we are comparing to, which are not strongly exposed to external photoevaporation <cit.>. \n\nFor α_ν = 10^-3 and τ = 8 Myr, radial drift is overall consistent with the observed depletion of dust, as seen in the two panels of Fig. <ref>. Also here we find that radial drift alone is not able to reproduce a small fraction of the population of discs in the observed sample which retain large amounts of dust for more than several Myr, similar to what we found when assuming α_ν = 10^-2. This further supports the idea that there are some discs where radial drift may be less efficient.\n\nSlower evolving discs lead to lower accretion rates onto host starts, which manifest itself in the Ṁ_g - M_dust relation. However, we find that the combined evolution of both quantities is little different from the α_ν =10^-2 case. There is a slightly larger scatter in gas accretion rates, and a larger scatter in the disc dust mass at the end of the disc formation, as shown in Fig. <ref>. \n\n\n\n\n\n§ DISCUSSION\n\n\n\n\n\n\n\n §.§ Interpretation of disc dust masses\n \n\n\n\n\n  §.§.§ Dependency on the stellar mass\n\n\nThe fraction of the dust disc mass removed in a given time varies with disc and stellar mass. The dependency of the solid mass budget on stellar mass, for different cluster ages, is explicitly shown in Fig. <ref>. We find that dust clearing by radial drift is more efficient around low-mass stars, as was also found in previous works <cit.>. Observations point towards a linear or super-linear trend of dust mass with stellar mass, possibly steepening with time <cit.>. We find steeper power law profiles, given by M_dust∝ M_⋆^β with β = 2.4 at 2 Myr and β = 6.9 at 7.5 Myr, although in the latter case the data is poorly described by a single power law. When instead limiting the model sample to those discs with detectable masses above 0.1 M_, we recover much more moderate power law dependencies, with β = 2.2 at 2 Myr and β = 1.6 at 7.5 Myr, in line with the observed exponents. These relations may further be influenced by the stellar-mass dependent occurrence of giant planets that can reduce pebble drift, as recently argued by <cit.>.\n\n\n\n\nThis dependency on stellar mass is also reflected in the evolution over time of the profile of the cumulative disc dust mass distribution (Fig. <ref> and <ref>). The cumulative distribution becomes less steep with time. If dust removal was more efficient around more massive stars with more massive discs, the profile would become steeper with time. Conversely, if the efficiency is the same across all disc and stellar masses, the profile would appear similar in shape to the gas tracer profiles in Fig. <ref> and <ref>. In summary, radial drift not only removes dust on a timescale that agrees with observations, but it is also able to match the profile of the cumulative distribution well. \n\n\n\n\n  §.§.§ The role of pressure bumps\n \n\nDisc surveys have revealed that many of the resolved protoplanetary discs show significant substructures, with very pronounced rings and gaps in the dust <cit.>. These structures are thought to originate from pressure bumps trapping dust <cit.>. The high occurrence of substructures in observed discs suggests that they might be common in all discs. However, by design,  such surveys often target the largest and brightest protoplanetary discs, which could be more prone to forming gap-opening giant planets <cit.>. \n\n\n\n\n\nThe frequent occurrence of deep gaps and rings in the dust continuum of these large and long-lived discs may signal regions where pebble drift is delayed. The link between exoplanet statistics and disc substructures was investigated in detail by <cit.>. They found that the increased occurrence of extended, structured discs with stellar mass is similar to the increased occurrence of giant planets with stellar mass. This supports the idea that large scale gaps in protoplanetary discs originate from giant planets. Such pressure bumps can arise when growing planetary cores reach the pebble isolation mass and carve shallow gaps that are sufficient to halt pebble drift <cit.>. Other sources of pressure bumps that can slow down or halt pebble drift also exist, for example changes in the level of turbulence at the transition from regions where magneto-hydrodynamic instabilities are active <cit.>. It is thus plausible that the majority of discs are radial-drift dominated, but that in ∼5%-15% of discs, radial drift is reduced by the presence of giant planets. This may connect to the frequently inferred presence of giant planets interior to debris discs <cit.>, where the latter could have been the natural outcome of left-over pebbles clumping into planetesimals during disc clearing <cit.>.\n\n\n\n\n  §.§.§ The role of planet formation\n \n\nRadial drift is not the sole process by which pebbles are removed from protoplanetary discs, as we know that a fraction of them will form the planets and planetesimals that we observe in our own solar system, as well as in exoplanet systems and debris discs. In this work, we have shown that radial drift removes dust from protoplanetary discs on a timescale which agrees well with dust disc lifetimes as measured from observations. This suggests that radial drift is the dominant dust-removal process. However, since we do not include planetesimal or planet formation in the model, we cannot dismiss their potential importance. \n\nPlanetesimal formation could remove a substantial fraction of dust particles present in protoplanetary discs, but its efficiency, and how that might vary across stellar and disc mass, is currently not well understood. Planetesimals are thought to form by the streaming instability <cit.>, which is likely to happen in regions with a super-solar dust-to-gas ratio <cit.>. Pressure bumps at the gap edges of giant planets are a promising location for this process, as dust piles up in these regions, and large amounts of planetesimals could form <cit.>. Such planetesimals would then represent a second generation of late-formed planetesimals, as they are triggered by the presence of an already fully-formed giant planet.   \n\nSimilarly, the formation of planets should also be responsible for the removal of some fraction of the dust in protoplanetary discs. To assess the importance of this process, a possible future extension of this work could include a exoplanet synthesis model as well <cit.>. In this context, it is interesting to note that the mass of solids present in typical observed exoplanet systems is comparable to that found in class II discs <cit.>. In the earlier disc stages, the mass budget in pebbles is larger by more than one order of magnitude, so up until the class II stage the decrease in the mass in pebbles is mainly driven by dust drift, rather than planet formation. \n\n\n\n\n\n  §.§.§ What happens to the dust retained outside the photoevaporative cavity\n \n\nIn our model, the dust retained outside the photoevaporative cavity eventually moves into the location of the pressure maxima where there is no radial drift. Since our model does not consider any additional treatment of this dust, this results in narrow long-lived rings of dust that are slowly pushed outwards as the photoevaporative gap in the gas expands outwards. The high dust-to-gas ratio in these pressure bumps could make them favourable locations for the formation of planetesimals via the streaming instability <cit.>. However, the fate of the dust retained outside photoevaporative gaps is uncertain. For example, <cit.> found that this dust is effectively lost in a process where the largest particles grow until they fragment by collisions, replenishing the reservoir of small dust particles that are subsequently removed by radiation pressure. If the dust is turned into planetesimals, this could lead to the formation of debris discs. However, the median mass of dust outside the photoevaporative gaps is only 0.3 M_ for α_ν = 10^-2 and 0.2 M_ for α_ν = 10^-3. While this dust mass is similar to that present in the known debris disc population, the planetesimal population that creates this dust in debris discs could be significantly higher <cit.>. \n\n \n\n\n\n  §.§.§ The role of stellar binarity\n\n\nMost solar mass stars reside in multiple systems, and the stellar multiplicity fraction increases with stellar mass <cit.>. Observations have found that discs around binaries typically host dust masses below 50 M_, and that for binary separations below 100 au discs have dust masses below 10 M_ <cit.>.  Therefore, measuring the mean disc masses in young stellar clusters without taking into account the binarity of stars can lead to underestimating the typical mass of discs around single stars. A future extension of this work could include the effect of stellar binarity in driving faster disc dispersal <cit.> through tidal effects and stellar encounters truncating disc radii in the cluster stage<cit.>\n\n\n\n\n\n §.§ Transition discs\n\n\nTransition discs with dust-depleted inner cavities and low accretion rates have been suggested to be caused by photoevaporation of the inner disc <cit.>. However, we find that it is difficult to form discs that both show signs of gas accretion onto the hosts star and massive extended dust disc at wider radii. Gas within the photoevaporation gap is lost on very short timescales (≲ 10^5 yr), as seen in Fig. <ref>, while only retaining small amounts of dust trapped at the outer gap edge. \n\nAs discussed earlier, the fate of the retained dust is such that it might be lost on short timescales (Sect. <ref>). Therefore we do not find that photoevaporation, as formulated here,  is a likely pathway for forming the majority of transition discs. This is in line with the low occurrence of discs with a cavity radius within 10 au <cit.>, that would have been expected in classic photoevaporation models <cit.>. \n\n\n\n\n\n §.§ Evolution of the outer gas and dust disc radius\n\n\n\n\nPebble drift could also, in principle, be identified through tracing the evolution of the outer dust disc radius with respect to the outer gas disc radius <cit.>. This is nevertheless challenging as both radii could be influenced by late accretion events of gas and dust onto the disc <cit.>. Moreover, in our model, the outer gas edge continuously viscously expands outwards with time, while recent models have argued against this based on disc wind models <cit.>. However, an outwards expanding discs is seen in disc wind models that include the truncation of the outer disc <cit.>.\n\nFigure <ref> illustrates the evolution of the gas radius as a function of the dust radius for the population synthesis model using α_ν = 10^-3 and the  photoevaporation prescription.\nHere, we calculate the disc radius as the radius within which either 90% of the disc gas or dust mass is present. If a disc has opened up a gap by photoevaporation and retained > 0.1 M_ of dust outside the gap, the dust radius is taken as the outer radius where the dust is trapped and indicated with a triangle symbol. \n\nFor very young discs the gas and dust radii are similar because the dust is tightly coupled to the gas. As the disc evolves, the dust decouples from the gas and the dust radius begins to decrease while the gas radius still increases. In the here-used approximation of only tracing the largest particle size, the radius of the dust disc shrinks rapidly once radial drift becomes efficient while gas radii continue to expand due to viscous evolution. Finally, the triangular symbols represent those discs where photoevaporation has opened up a gap in the gas whilst retaining >0.1  M_ of dust outside the gap. The dust disc radii also increase, as the dust is pushed outwards as the outer edge of photoevaporative gap expands.  \n\nA direct comparison of synthetic with observed dust and gas radii is not straightforward. This would require post-processing our results with radiative transfer in order to determine the observable outer dust edge and gas edge, the latter using a CO gas tracer <cit.>. Nevertheless, for illustrative purposes, we show in Fig. <ref>, with grey points, the dust and gas (CO) radii determined for the discs in the sample by <cit.>. This uniformly-analysed collection of discs, drawn mainly from Taurus, Lupus, Ophiuchus, and Upper Sco, spans stellar masses between 0.15–2 M_⊙ and ages between 0.5 to 20 Myr. Similar to our results, all observed discs have dust radii located within their gas disc radii and only a few discs have severely drift-depleted discs with R_gas > 4R_dust. Previous work has argued that radial drift would rapidly deplete pebble discs and result in discs with a gas-to-dust size ratio smaller than four <cit.>. However, this is likely an effect of assuming larger fragmentation velocities (u_f=10 m/s) compared to this study (u_f=1 m/s, see Sect. <ref>). This then results in larger pebbles closer to the drift limit and an outer dust radius that moves inwards too rapidly.\n\n\n\n\n §.§ Uncertainty in photoevaporation prescriptions\n \n\nThe disagreement in derived mass-loss rates in different photoevaporation models reflects that the underlying physics driving photoevaporation is not entirely understood. <cit.> found that the chosen X-ray spectrum frequency matters significantly for the derived photoevaporation rates. This can explain why some studies <cit.> find very low mass loss rates for for the derived photoevaporation rates X-rays. Also, X-ray photoevaporation models, such as the  used here, may underestimate the cooling efficiency in the discs and therefore overestimate the photoevaporation rate <cit.>.\nSince we cover both low and high photoevaporation efficiencies here, we believe our conclusion on their relative small effect on dust evolution are robust. Nevertheless, this remains a clear area for future work, especially as recent works point towards photoevaporation and magnetic disc wind losses to be tightly linked <cit.>.\n\nSince our model does not track the population of small (≲ 100 μm) dust grains, and the  provides no scaling with the dust-to-gas ratio (a ratio of 0.01 is used), we do not model the effect that a decreasing or increasing amount of small dust present has on the FUV photoevaporation rate. A decrease in the available small dust grains reduces the opacity and thus increases the penetration depth of the photons, which can enhance the mass-loss rate. Simultaneously, fewer small dust grains also leads to less photoelectric heating, which reduces the mass-loss rate. <cit.> found that these two effects can to a large degree negate each other. However, at dust-to-gas ratios above ∼ 0.03, <cit.> found that a decrease in the dust-to-gas ratio increases the FUV photoevaporation rate. At lower dust-to-gas ratios, the photoevaporation rate instead decreases, but the inclusion of hydrogen ionisation by X-rays lessens the reduction in the photoevaporation rate due to the large amount of free electrons allowing for rapid recombination onto the dust grains. Similarly, <cit.> also concluded that at dust-to-gas ratios below 0.01 photoevaporation by FUV is reduced due to inefficient photoelectric heating. With these results in mind, and the fact that the discs in our model rarely exceed the initial dust-to-gas ratio of 0.01 (see middle panel of Fig. <ref>), including the effect of small grains of the photoevaporation rate would likely result in a reduced FUV photoevaporation rate compared to our current model. Since we already find that FUV photoevaporation has a negligible effect on the dust disc evolution, our conclusions would not change.\n\nWe also did not take into account that small dust particles may also be entrained in photoevaporative winds <cit.>, but this only affects very small dust, as the maximum particle size that can be effectively entrained in photoevaporative winds is ∼ 1  μm <cit.>. Therefore, this process does not impact significantly the mass budget of pebbles in the disc, but may be important for the determination of  gas mass loss rates in the upper parts of protoplanetary discs <cit.>. \n\nFinally, in this project, we did not include external photoevaporation. This choice is appropriate for the well-studied nearby stellar clusters considered here. Therefore, we do not include it in our model. Nevertheless, protoplanetary discs in more massive clusters with O and B stars would be subject to external photoevaporation from the strong FUV background radiation of said stars. This process may significantly shorten the disc lifetimes <cit.>.\n\n\n\n\n\n§ CONCLUSIONS\n \n\n    \n \n    \n  * We found that the depletion of protoplanetary dust by radial drift of pebbles is compatible with the depletion trend seen in observed protoplanetary discs. We explored dust depletion in synthetic clusters discs with disc depletion timescales of 2.5 Myr or 8 Myr, corresponding to, respectively, a high and low viscous alpha (α_ν = 10^-2 and α_ν = 10^-3). Both cases broadly reproduce the cumulative loss off pebbles from protoplanetary discs.\n    \n  * Our synthesis model is consistent with the evolution of the cumulative dust disc mass distribution with time. However, a fraction of about 5-10% of observed discs show signs of reduced radial drift compared to the model, possibly triggered by wide-orbit planet formation. Other relations that are well-reproduced are the moderate decrease of dust radius with gas radius with time and the trend between disc mass and stellar mass. However, the synthesis model does not recover a population of massive dust discs with low stellar accretion rates. The latter may point to our model not including inner disc winds, which could reduce the mass accretion rate onto the host star, or that observations underestimate stellar accretion rates.\n    \n  * Discs forming with a global dust-to-gas ratio of 0.01 do not retain this proportion of dust. Efficient radial drift, even during the build-up of the discs, lowers the disc's global dust-to-gas ratio below that of its birth environment. Hence, gas disc masses cannot be estimated by multiplying the dust mass by the ISM-ratio of 100, even without considering dust optical depth effects.\n    \n  * Photoevaporation plays a minor role on the evolution of the disc dust mass. Strong X-ray photoevaporation is able to retain some dust outside the photoevaporative gaps, but only a very small fraction (≲0.01 %) of the initial dust mass of the disc (50-1000 M_). Photoevaporation may aid in reaching the low gas accretion rates observed (≲ 10^-9 M_⊙/yr) in protoplanetary discs  <cit.>. However, this depends on the assumed photoevaporation efficiency, and is only achieved for maximally efficient X-ray photoevaporation prescriptions.\n\n\n \n\n\nWe thank Anders Johansen for his  comments on the manuscript. We also thank Andrew Sellek for helpful discussions and input on the photoevaporation models. J.A. acknowledges the Swedish Research Council grant (2018-04867, PI A. Johansen). M.L. acknowledges the Wallenberg Academy Fellow grant (2017.0287, PI A. Johansen) and ERC starting grant 101041466-EXODOSS.\n\n\n\n\naa\n\n\n\n\n\n\n\n\n\n\n\n§ PHOTOEVAPORATION PRESCRIPTIONS\n \n\n\n\n §.§ <cit.> photoevaporation\n \n\n provides a photoevaporation prescription derived from models of X-ray photoevaporation for different stellar masses using the photoevaporation model of <cit.>. \n\n\n\n\n\n\nThe photoevaporation rate is given by\n\n    Σ̇_PE( r ) = ln( 10 ) (   6 a ln(r)^5r ln( 10 )^6 \n    +  5 b ln( r )^4r ln( 10 )^5\n    +  4 c ln( r )^3r ln( 10 )^4\n    \n    +    3 d ln( r )^2r ln( 10 )^3\n    +  2 e ln( r )  r ln( 10 )^2\n    +   frln( 10 ) )\n       Ṁ_PE( r)2π r [M_⊙ au^-2 yr^-1],\n\nwhere Ṁ_PE( r ) is the  mass loss rate due to photoevaporation at a given disc radius. It is given by\n\n    Ṁ_PE( r )Ṁ_PE(L_X) =   10^alog(r)^6 +\n            blog(r)^5 + \n            clog(r)^4 + \n            dlog(r)^3 + \n            elog(r)^2 + \n            flog(r)  + \n            g,\n\nwhere Ṁ_PE(L_X) is the total mass loss rate due to X-ray photoevaporation. The parameters a,..., g for different stellar masses are given by Table <ref>. The X-ray luminosities for each stellar mass is shown in Table <ref>.\n\n\n\n\n\n\n\n §.§ <cit.> photoevaporation\n \n\n\n\n\n\nThe photoevaporation prescription of  is based on models which includes photoevaporation due to EUV, FUV, and X-rays. The rate of photoevaporation is given by Eq. (<ref>).\n\n    log( Σ̇_g, PE( r ) 1  g s^-1 cm^-2) = c_5 x^5 + c_4 x^4 + c_3 x^3  + c_2 x^2 + c_1 x + c_0,\n\nwhere x is given by\n\n    x = log( rr_g),\n\nand r_g is the the gravitational radius given by\n\n    r_g = G M_⋆( 10  km s^-1)^2 = 8.87  au(M_⋆1M_⊙).\n\n model photoevaporation in the range 0.1 r_g≤ r ≤ 20 r_g as this is where photoevaporation is thought to occur <cit.>. We therefore only include photoevaporation in the same range.\n\nThe parameters c_5,..., 0 in Eq. (<ref>) for different stellar masses are given in Table <ref>. X-ray and FUV luminosities for the same stellar masses are given in Table <ref>. To approximate the evolution of the photoevaporation rate as the star grows more massive we linearly interpolate between these stellar masses and parameter values.\n\n\n\n\n\n\n§ DISC FRACTIONS\n \n\nThe dust present in protoplanetary discs will result in an excess of infrared emission at mm wavelengths. As a disc in a cluster of young stars evolves, the dust component is depleted, and the infrared excess is lost. To determine the fraction of stars that have discs with mm emission, one often only targets those stars with discs that show an infrared excess. A number of attempts have been made at fitting a function describing how the infrared disc fraction evolves over time given a typical disc lifetime  <cit.>.   \n\nThe fitting function for the disc infrared fraction often used is\n\n    f_disc = e^-t/τ,\n\nwhere τ is the typical disc lifetime, and t is the age of the cluster. Disc lifetimes were long thought to be a few Myr, for example, τ = 2.5  Myr <cit.>. However, these lifetimes were derived using samples of young star clusters where external disc photoevaporation is both present and not. External photoevaporation can significantly shorten disc lifetimes. A more recent study of clusters without external photoevaporation found that discs in such environments have typical lifetimes of about 8 Myr <cit.>.\n\nThe ages of the star forming regions in the observational sample we compare to are taken from <cit.>. We assume that the of a cluster age is the mid-point of the given age range. These ages are then used in Eq. <ref> to calculate the disc fraction of a star forming region. The resulting disc fraction is then used to scale the cumulative distribution functions of dust disc masses.\n\n\n\n\n\n\n\n\n§ HALTING DUST DRIFT IN HIGH-MASS DISCS\n \n\n\n\nIn this appendix we illustrate how the halting of dust transport inwards in the disc, in a fraction of the most massive discs, can affect the cumulative dust disc mass distributions. Stopping, or slowing down, the inwards transport of dust could be caused by pressure bumps in the gas disc, which are discussed further in Sect. <ref>. In order to approximate dust trapping in pressure bumps we halted the pebble drift between the end of the disc formation stage and 2 Myr in 17% of the 30% most massive discs (corresponding to 5% of the total disc population). We show results in Fig. <ref> for a cluster with  α_ν = 10^-2 and using the  photoevaporation prescription.\n\nHalting the dust evolution in these 5% of discs naturally results in a cumulative distribution of the dust disc mass that extends to higher masses, as seen in Fig. <ref>. The thick lines shows the simulation including 5% of discs with halted dust evolution, and the thin lines shows the standard model. This experiment illustrates how halting pebble drift in a fraction of the most massive discs can help explain the presence of very massive dust discs seen in evolved star forming regions, whilst the majority of discs agree well with being drift dominated.\n\n\n\n\n\n\n\n\n"}