{"entry_id": "http://arxiv.org/abs/2303.12514v1", "published": "20230313171753", "title": "Algebraic Properties of Euclidean Geometry with Transcendental Curves", "authors": ["Nicole Venner"], "primary_category": "math.GM", "categories": ["math.GM", "01A20, 11R32"], "text": "\nDisc population synthesis: decrease of the solid mass reservoir through pebble drift\n    J. Appelgren\n          1\n          ,\n          M. Lambrechts2,1\n          N. van der Marel3\n          \n    Received ; accepted \n==========================================================================================================\n\n\n\n\n\tWhile geometry with transcendental curves, like the Quadratrix of Hippias and the Spiral of Archimedes, played a significant role in our modern developments of geometry and algebra. The investigation has fallen off in the modern era despite advancements in algebraic tooling. This paper [Discussion of original results begins with Definition def:beginningofresults] gives a description of the fields using modern techniques such as Galois theory while solving an open conjecture in a 1988 paper <cit.> to provide an answer to if these curves can solve the problem of doubling the cube.\n\n\n\tRecently extensions of classical euclidean geometry with paper folding have garnered significant interest in the mathematical community. Although these approaches do dramatically expand the domain of solvable problems, several important problems remain unconstructive in this approach. This paper takes an alternative approach, looking to the first historical attempt at extending euclidean geometry, the Quadratrix of Hippias to generate a field of numbers that can hopefully solve those problems.\n\n\t\n  * Fix Sympy Citation\n    \n  * \n\n\n\n\n§ A QUICK REVIEW OF GEOMETRIES\n\nOver 2000 years ago, the Ancient Greeks developed a system of mathematics in response to the discovery that some numbers such as √(2) were not constructible as proportions of integers. \n\n\tA point α is constructible if and only if α can be constructed as a point using an unmarked ruler and compass. More specifically those tools allow you to:\n\t\n\t\t\n  * Draw a line through any two points.\n\t\t\n  * Draw a circle centered at one point while passing through another point.\n\t\t\n  * For any 2 curves (either a line or a circle), you can draw points wherever they intersect.\n\t  \n\nAn extremely important step in the understanding of problems in euclidean geometry is the invention of thinking of points on the plane as pairs of real numbers and more recently as complex numbers a+bi. Thinking of individual points as numbers allow you to prove some very interesting theorems:\n\n\tGiven any 2 constructible points a, b∈𝒞 represented as complex numbers. Then the points with complex representations of a+b, a-b, ab and a/b are constructible.\n\n\n\tFor any constructible numbers a,b ∈ C that   0=a-a,and 1=a/a and a+b=a-((a-a)-b) and a· b = a/b/b÷ b. You can subtract and divide complex numbers using ruler and compass constructions as shown in Figure <ref> and fig:complexsub:\n\t \n\t\n\n\n\tFor any numbers a exist geometric constructions for: a̅,Re(a),Im(a),|a| and √(a)\n\n\n\tConstructing the |a| is relatively easy since the construction involves just constructing a circle with a as a point on the radius and finding the intersection with the real line. From there you can find a̅ since a̅=|a|^2/a. This also lets you say construct Re(a)=a+a̅/2 and Im(a)=a-Re(a). The construction involving square roots in the complex plane follows from the general square root construction from Euclid combined with an angle bisector.\n\n\n\n\nAs the Ancient Greeks were first developing geometry three classical problems remained unsolved. \n\n\t\n  * Construct a square with the same area as a circle.\n\t\n  * Construct a cube with double the volume of another cube.\n\t\n  * Trisect an angle. (In general arbitrary angle partitions)\n\t\n  * Construct a regular-sided heptagon (In general an any-sided regular polygon)\n\nUnder the classical rules of euclidean geometry, all three of these problems are impossible and we shall spend the next few sections giving a brief overview of why. The key insight comes from the fact that a solution to each one of these problems must involve constructing certain numbers, namely √(π), √(2) and sin(20^∘). (Importantly sin(20) happens to be the root of 8x^3 - 6x + √(3) = 0)\n\nSo what numbers can be constructed with Ancient Greek geometry? Since you are dealing with the geometry of a two-dimensional plane it makes sense to involve numbers that carry the same structure, namely complex numbers. From here you can define\n\n\nIt turns out that these are all the numbers you can construct with classical euclidean geometry, via the following theorem:\n\n\tAny Intersections that can be created with classic euclidean geometry (line intersected with line, circle and line, or circle and circle), can be represented using roots of quadratic polynomials\n\n\n\tSince in the cartesian plane, all circles can be written as (x-c)^2+(y-d)^2=r^2 and lines as y=ax+b. Then you can algebraically represent the x and y coordinates of intersections as solutions to polynomials, the calculations for a line intersecting a line and a circle intersecting a circle are relatively straightforward, so all that is left is to work out the algebra in the case of a circle intersecting with another circle.  \n\t\n\t\n\t\n\t\n\t\n\t\n\t\n    √(r^2-(x-a)^2)+c   =√(p^2-(x-b)^2)+d\n    √(r^2-(x-a)^2)   =√(p^2-(x-b)^2)+(d-c)\n    \n    \t\tr^2-(x-a)^2   =(√(p^2-(x-b)^2)+(d-c))^2\n    \n    \t  r^2-(x-a)^2   =p^2-(x-b)^2+2(d-c)√(p^2-(x-b)^2)+(d-c)^2\n    (r^2-p^2)+(x-b)^2-(x-a)^2-(d-c)^2/2(d-c)   =√(p^2-(x-b)^2)\n    (2b-2a)x+(b^2+r^2-p^2-a^2-d^2+2dc-c^2)/2(d-c)   =√(p^2-(x-b)^2)\n    ((2b-2a)x+(b^2+r^2-p^2-a^2-d^2+2dc-c^2))^2/4(d-c)^2   =p^2-(x-b)^2\n\n\tExpanding out yields:\n\t\n    2x^2(b-a)^2+4x(b-a)(b^2+r^2-p^2-a^2-d^2+2dc-c^2)+(b^2+r^2-p^2-a^2-d^2+2dc-c^2)^2/4(d-c)^2=(p^2-(x-b)^2)\n    \n    \t  2x^2(b-a)^2+4x(b-a)(b^2+r^2-p^2-a^2-d^2+2dc-c^2)+(b^2+r^2-p^2-a^2-d^2+2dc-c^2)^2=4(d-c)^2(-x^2+2xb-b^2+p^2)\n    \n    \t  2x^2((b-a)^2+2(d-c)^2)+4x((b-a)(b^2+r^2-p^2-a^2-d^2+2dc-c^2)-2b(d-c)^2)+(b^2+r^2-p^2-a^2-d^2+2dc-c^2)^2+4(d-c)^2(b^2-p^2)=0\n\n\tSince the x is solvable, we can obtain the y value by substituting x into either ax+b=y or (x-a)^2+(y-b)^2=r^2 yielding a quadratic as well. \t\n\nSince any quadratic can be solved using the quadratic formula, we can construct every constructible number, using the operations we have defined so far (+,-,×, ÷, √()) suffice to construct any constructible number. Having reduced the problem to algebra we can show it just isn't enough to solve those classic geometry problems.\n\n\n §.§ The Foldable Numbers\n\n\n\nKnowing that it is only possible to construct solutions of quadratics, it seems natural to ask if other possible sets of constructions could create more numbers. A recent modern example is the trigonometric numbers: \n\n\tA number α is in 𝒪 if the point representing the complex number α is constructible using simple reduced[Every other kind of simple paper fold can be completed using repeated applications of operation 3] origami folds\n\t\n\t\t\n  * Given two points P1 and P2, we can fold a crease line connecting them. \n\n\t\t\n  * Given two lines, we can locate their point of intersection, if it exists. \n\t\t\n  * Given two points P1 and P2 and two lines L1 and L2, we can, whenever possible, make a fold that places P1 onto L1 and also places P2 onto L2.\n\t\n\nThis may seem like an oversimplification of origami, but helpfully a proof from hull_origametry_2020 (originally proved by Lang in 2003) shows us that\n\n\tIf we only allow one fold at a time and assume all our creases are straight lines. Then any folding operation can be described by our three origami operations\n\nUsing these techniques it becomes possible to create solutions to cubic equations, consider the following construction for the cube root of 2 in Figure fig:cuberoot2\n\nThis is done by moving the x and y axes to intersect at (1,2) and then using our third rule to map (-1,0) and (0,-2), to the new axes. From there it is possible to use conventional geometry and an argument from similar triangles to argue that the side length of the square is the cube root of 2.\n\nThis exact argument can be easily generalized to solving any cubic as first proved by Lil.\n\n\n\tThe roots of any cubic can be expressed using simple paper folds.\n\nThe author's first exposure to this was in a video produced by polster_why_2019. Furthermore using a similar argument from algebra it turns out to completely describe the numbers you can make with simple folds in origami. [There do exist extensions of origami involving multi-folds that create multiple creases at once. While these drastically expand the numbers that can be produced. The author believes there are significant issues in using them for real-life demonstrations or educational purposes. Not only since the constructions require a large amount of technical skill to execute, but inaccuracies in the construction are known to propagate and grow, making developing intuition quite difficult.]\n\n\tThe intersections created by any origami fold can be described by a cubic polynomial.\n\nProof for this can be found in hull_origametry_2020\n\n\n\n\n\n\n\n §.§ Galois Theory and Unconstructible Numbers\n\nFrom here since we have 2 notions of geometry that can be modeled as algebraically solving polynomial equations, it remains if it is possible to construct different numbers like √(2) or transcendental numbers like π or e.\n\nThe original idea that these problems are impossible to construct in either comes from a branch of mathematics called Galois Theory, which we shall briefly stroll-through for the sake of brevity.\n\n    A polynomial is irreducible if it cannot be factored.\n\n\n\tA Field ℱ is a set of numbers that is closed under the operations required for traditional arithmetic (addition, subtraction, multiplication, and division). A Field Extension is a process of extending a field ℱ with new numbers to form a field 𝒢, this extension is often written as G/F\n\n\n\tA field ℱ splits over a polynomial p(x) if every root of p(x) is contained in ℱ. An extension ℱ/𝒢 is a splitting extension if for any irreducible polynomial in 𝒢 then either all or none of its roots are in ℱ.\n\nWhile this is a helpful definition, it might seem hard to come up with examples where this is true.\n\n\tFor any irreducible polynomial p(x with coefficients ℱ, then the extension smallest field containing all roots ℱ(x_1,x_2,…)/ℱ is splitting.\n\nthis can be shown to not be the case.\n\nSome examples and a short lemma might be helpful to understand the concept.\n\n\tOur first example is going to be the smallest field containing both the rationals and √(5), written as ℚ(√(5)). It is reasonable to ask what the elements of this field look like, and it turns out it is completely describable using 2 rational numbers like so: ℚ(√(5))={a+b√(5)| a,b ∈ℚ}. These form a field since you can prove they are closed under subtraction and division like so:\n\t\n    (a+b√(5))-(c+d√(5))   =(a-b)+(b-d)√(5)\n    a+b√(5)/c+d√(5)   =(ac-5bd/c^2-5d^2)+(bc-ad/c^2-5d^2)√(5)\n\n\tWe can also see that this field is the splitting field for the polynomial x^2-5 since both of its roots of √(5) and -√(5) are contained in it.\n\n\n\tIf a field ℱ is composed of a tower of fields ℚ⊂ℱ_1⊂ℱ_2⊂ℱ_3 ⊂…, where each extension is splitting. Then ℱ/ℚ is splitting.\n\t\n\nAs proved in <cit.>.\n\n\tA field automorphism is an invertible function on a field such that.\n\t\n    f(a-b)=f(a)-f(b)      f(a/b)=f(a)/f(b)\n\n\tBased on those properties we can conclude that f(a)· f(b)=f(ab) and f(a)+f(b)=f(a+b). And for any rational q then f(q)=q.\n\nThrough the power of field automorphisms, we can prove some useful results:\n\n\tIf f is a field automorphism defined on a splitting field ℱ defined by a polynomial with rational coefficients p(x), for any root z, then f(z) is also a root.\n\n\n\tIf z is a root of p(x), then we know by definition that\n\t\n    0=a_n z^n+a_n-1x^n-1 + … + a_1 x^n +a_0\n\n\tWe can now apply f to both sides of this equation, and since by the properties of a field automorphism we know that you can distribute across integer powers f(a^n)=f(a)^n (proven by using induction with multiplication) we can finish the proof.\n\t\n    f(0)   =f (a_n z^n+a_n-1z^n-1 + … + a_1 z +a_0)\n    \n    \t\t0   =f(a_n z^n)+f(a_n-1z^n-1) + … + f(a_1 z) +f(a_0)\n    \n    \t\t0   =a_n f(z^n)+a_n-1f(z^n-1) + … + a_1 f(z) +a_0\n    \n    \t\t0   =a_n f(z)^n+a_n-1f(z)^n-1 + … + a_1 f(z) +a_0\n\n\tThus f(z) is a root of p(x). (This applies generally to polynomials with irrational coefficients if the automorphism f keeps the coefficients fixed in place.)\n\n\n\tIf ℱ is a splitting field of a polynomial p(x) with rational coefficients, for any root z of p(x), then both the conjugate z̅ as well as the real, imaginary parts (z) and i ·(z) are in ℱ,\n\n\n\tConsider that the field automorphism f(a+bi)=a-bi. We can prove that this is a field automorphism with some basic algebra\n\t\n    f(a+bi)-f(c+di)=a-bi-c+di=(a-c)-(b-d)i=f(a-c+(b-d)i)\n\n\tFurthermore\n\t\n    f(a+bi)/f(c+di)   =a-bi/c-di\n       =(a-bi)(c+di)/c^2+d^2\n       =ac+bd/c^2+d^2+i ad-bc/c^2+d^2\n       =f(ac+bd/c^2+d^2+i bc-ad/c^2+d^2)\n       =f(a+bi/c+di)\n\n\t\n\tany root z=a+bi of a polynomial with rational coefficients, then consider the \n\nNow \n\n\tEvery field and field extension can be put into correspondence with a group, often written as Gal(ℱ) or Gal(ℱ/𝒢). Defined to be the group formed by all field automorphisms on your field. (The Galois Group of a field extension ℱ/𝒢 are the field automorphisms of 𝒢 that keep the values of ℱ unchanged.)\n\nA true understanding of galois theory is going to require a fair bit of understanding of the properties of groups. But even then an example might be helpful:\n\n\tLet ℱ be the smallest field where x^3-2 splits over the rationals. Since ℱ is the smallest field that contains all the roots of x^3-2 we can say ℱ=ℚ(√(2),ω√(2),ω^2√(2)), where ω^3=1. It also does have a representation using rational numbers like so:\n\t\n    ℱ={a+b· 2^1/3+c· 2^2/3+d·ω+e·ω 2^1/3+f·ω 2^2/3   |    a,b,c,d,e,f ∈ℚ}\n\n\tSince ℱ is a splitting extension over the rationals it is relatively easy to calculate its Galois group. Since the rationals (or your preferred base field) must remain fixed by any field automorphism, by the properties of the automorphism for any root z, then f(z) must also be a root. Likewise, since every element of your field can be written as an element of the base field p_n, times a product of roots to some polynomial α, applying the permutation yields:\n\t\n    f(∑_i=1^k a_i ·α_1^n_1_i·α_2^n_2_i·α_3^n_3_i·…)=∑_i=1^k a_i · f(α_1)^n_1_i· f(α_2)^n_2_i· f(α_3)^n_3_i·…\n\n\tThus the field automorphisms are given by any permutation of the roots of the polynomial while keeping all of their algebraic properties intact.\n\t\n\tFor our specific polynomial, the only algebraic properties the roots need to respect are:\n\t\n    x_0^3=x_1^3=x_2^3=x_0· x_1· x_2=2\n\n\tThus any permutation leads to a valid automorphism. Showing that the Galois group of x^3-2 is the symmetric group S_3.\n\n\n\tThe order of any (Galois) group G written as |G| is defined to be the number of elements (field automorphisms) in the group.\n\n\n\tFor any fields F⊂ G with a splitting field extension G/F. Then\n\t\n    |Gal(G/F)| · |Gal(F)|=|Gal(G)|\n\n\nFurthermore\n\n\tFor any irreducible polynomial p of degree n, the splitting field F containing all the roots F(p_1,p_2,…) then the order of Gal(F(p_1,p_2,…)/F) is divisible by n and divides n!.\n\nFor interested readers, the proofs for these statements are a combination and simplification of several proofs in the Galois theory chapter of dummit_abstract_2009. Using these 2 theorems we can show that the three problems are impossible. First starting by saying that\n\n\tEvery constructible number c is contained in a field with a Galois group with an order of 2^n for some natural number n.\n\n\n\tSince every constructible number is created using a finite number of ruler and compass constructions, you can interpret it as extending the base field of the rationals using a finite number of solutions to quadratic polynomials. Combining the previous 2 theorems, we get that the order of the final field containing our number c must be contained in a field with degree 2^n.\n\nLikewise following the same argument one can see that\n\nBut notice that classic problems of doubling the cube and trisecting the angle involve extensions of irreducible cubic polynomials, x^3-2 and 8x^3 - 6x + √(3). Thus any 'nice' field containing them must be divisible by 3[If you calculate them out it turns out that the first polynomial has a Galois group of order 6 and the second has order 3.] But since every number constructible with classic euclidean geometry has a degree with no factors of 3. \n\nWe can further see that the field of foldable numbers can solve these since:\n\nFrom here we have one final result \n\n\tFor any number o ∈𝒪_1 then the smallest field containing o is of degree 2^n · 3^k for any integers n and k\n\nSince it is possible to describe doubling the cube and trisecting the angle as the solutions of the cubics x^3-a and 3x^3-2x+c for c<1 and any a. However, some numbers are still out of reach, arbitrary angle division and arbitrary regular polygons are still unconstructible as well as the elusive square of the circle.\n\n\n\n\n\n\n\n\n§ THE QUADRATRIX OF HIPPIAS\n\nIn Ancient Greece, the first partial solution to the angle trisection problem comes from Hippias where he imagines a new curve in the plane drawn with a compass-like construction. The definition of the curve can be given as so. \n\n\n\tGiven a circle with center A and point on the radius B. The quadratrix is defined so that for any point on the circle X. Then the point on the quadratrix Z on the line AX is defined so that the arc-length of BX is equal to the distance from the line AB As seen in Figure fig:quaddef\n\n\n(Construction of the number π/7)\n\tUsing the definition of the quadratrix, we can try to find the points where it intersects the imaginary axis, since the imaginary line is angled at π/2 radians from the real line, then by fig:quaddef, it must intersect at the points ±iπ/2. Since the number iπ/2 is constructible, we can multiply by the constructible number -2i/7 to construct the point π/7.\n\n(Partition of an angle into 5 pieces)\n\t\n\nHippias also proved that this curve can partition an arbitrary angle, and can therefore create any regular-sided polygon. 130 years later the mathematician Dinostratus proved that it is also possible to square the circle as well. (Both techniques will be proved later by saying that the field containing quadratrix is also inside) But from here to the best of the author's knowledge no one has done a further dive into the quadratrix aside from reiterating the results from over 2 millennia ago.\n\n\n\n\n\n\n\n§ ALGEBRAIC DEFINITION OF 𝒯_1\n\nAs we have just seen, the majority of the power of the quadratrix in classic constructions comes from its ability to convert angles into segment lengths and segment lengths into angles, thus let us consider a field generated by those 2 constructions:\n\n\tThe field of ”Perpendicular Trigonometric” Numbers 𝒯_1 is defined to be the smallest field satisfying\n\t\n\t\t\n  * The set of rational numbers ℚ is contained in 𝒯_1 (Lemma <ref> lets us show that every constructible number is in 𝒯_1)\n\t\t\n  * The field is closed under the operation defined in Definition <ref>\n\t\t\n  * The field is closed under the operation defined in Definition <ref>\n\t\n\t\n\n\n\tFor any arc AB it is possible to construct a segment CD with length equal to the arc-length of AB\n\t\n\n\n\tFor any segment CD it is possible to construct a arc AB with arc-length equal to the length of CD\n\t\n\nIt is quite apparent that this field is already solving ancient problems from antiquity as since it is easy to construct a segment of length π, you can easily square the circle (Also showing that 𝒞(π)⊂𝒯_1).  It goes significantly deeper than that as the following theorem should show \n \n\n\tFor any real trigonometric α, then α is trigonometric if and only if e^iα is trigonometric. (Alternatively stated, for any |β|=1 is trigonometric if and only if ln(β) is trigonometric)\n\n\n\n\tIf a real number α is constructible then via T2 we can wrap the segment from 0 to α around the unit circle with an endpoint of cos(α)+isin(α)=e^iα. Likewise for any trigonometric point on the unit circle is expressible as cos(α) + i sin(α)=e^iαthen we can use T1 to unwind that to a segment length, thereby constructing α. (This can also be expressed by taking the natural log of any point on the unit circle in the complex plane.)\n\n\n\tAny real number α is trigonometric if and only if sin (α), cos (α), tan (α), are trigonometric.\n\n\n\tIts notable that if α is real and trigonometric then by theorem thm:exp, then e^iα is trigonometric and since:\n\t\n    sin(x)   =e^ix-e^-ix/2i\n    cos(x)   =e^ix+e^-ix/2\n    tan(x)   =-ie^ix-e^-ix/e^ix+e^-ix\n\n\tEvery number of this type is therefore constructible.\n\n\n\tUsing the functions above, it is possible to derive the following formulas using the socks and shoes rule ie. (f∘ g)^-1=g^-1∘ f^-1.\n\t\n    sin^-1(x)   =-i ln(√(1-x^2)+ix)\n    cos^-1(x)   = π/2+i ln(√(1-x^2)+ix)\n    tan^-1(x)   = i/2ln(1-ix/1+ix)\n\n\tWhere the inverse trig functions are defined for real values ([0,1] for sin^-1 and cos^-1, and the entire real line for tan^-1), then the values that are given to ln(x) are all of magnitude 1.\n\n\n\n\n§ GEOMETRIC DEFINITIONS OF 𝒯_1\n\nSo how does this curve relate to the quadratrix and other transcendental curves throughout history that have been used to solve similar problems? While it might be tempting to look at the fields generated by creating a \"quadratrix\" compass, or \"trigonometric\" compass that can draw these shapes and think about what intersections you might get, however trying this method can easily lead to intractable problems since by definition of your field is going to include solutions to equations like this:\n\n    α x = sin(x)\n\nSince it must include the intersections of a sloped line and the standard trigonometric curve. Based on that it makes sense to examine subfields with fewer allowed constructions.\n\n\n\n §.§ Trigonometric Curves\n\n\n\tConsider the field of numbers generated by allowing intersections with the curves x ↦ (x,sin(x)) or x ↦ (x, cos(x)), then consider the subfield:\n\t\n\t\t\n  * All the standard constructions in classic euclidean geometry, (ie, creating lines and circles, and finding intersections of any two lines, two circles, or a line and a circle)\n\t\t\n  * Given the curve x ↦ (x,sin(x)) or x ↦ (x, cos(x)) when graphed on ℝ^2, you can construct the intersection of the curves, and any vertical line.\n\t\t\n  * Given the curve x ↦ (x,sin(x)) or x ↦ (x, cos(x)) when graphed on ℝ^2, you can construct the intersection of the curves, and any horizontal line.\n\t\n\t\n\n\n\tThe field described in Definition def:trigt1field is equal to 𝒯_1.\n\n\n\tThe first direction of proving that 𝒯_1 contains the construction amounts to showing that all the intersections with vertical lines are constructible since this happens to be the same as evaluating the function, and horizontal lines are the same as finding function inverses. Thus applying Theorem thm:trig deals with both halves of our equivalence. Showing every number constructible using classic Euclidean constructions will wait until lemma lem:t1constructible\n\n\n\n §.§ Quadratrix of Hippias\n\n\n\tConsider a subfield of numbers constructible with the quadratrix, generated using these constructions:\n\t\n\t\t\n  * All the standard constructions in classic euclidean geometry, (ie, creating lines and circles, and finding intersections of any two lines, two circles, or a line and a circle)\n\t\t\n  * Given the standard quadratrix as constructed in Figure fig:quaddef, you can construct the intersection of the quadratrix and any line passing through the origin.\n\t\t\n  * Given the standard quadratrix as constructed in Figure fig:quaddef, you can construct the intersection of the quadratrix and any horizontal line.\n\t\n\t\n\n\n\tThe field described in Definition def:quadt1field is equal to 𝒯_1.\n\n\n\tTo proceed with this proof we shall show that every number in each field is present in the other\n\t(Quad ⇒𝒯_1). Notice that given any angle measure α, you can construct a ray at the origin where the angle formed with the real axis is α. Then by definition, the distance between the intersection and the real axis is α. Likewise, creating a horizontal line given by {x+i·α   x ∈ℝ}. Then find the intersection with the quadratrix and draw the line to the origin creating an angle with the real axis of value α. Showing every number constructible using classic Euclidean constructions will wait until lemma lem:t1constructible\n\n\t(𝒯_1 ⇒ Quad ). Consider a line drawn through the origin with angle α, by definition, the point on the quadratrix can be written as |α|+ i · |α|·(α). Since the point is expressible using trigonometric numbers, it does not extend the field further. Likewise, taking a horizontal line, by the first property we can turn its distance from the real axis into an angle value and see where that line intersects \n\t\n\n\n\n §.§ Archimedean Spiral\n\n\n\tThe field 𝒯_1 is equal to the field of constructible numbers with the additional ability to construct intersections with the Archimedean Spiral with lines passing through the origin and circles centered at the origin.\n\n\n\n\n\n\n\n\tConsider a subfield of numbers constructible with the Spiral of Archimedes, generated using these constructions:\n\t\n\t\t\n  * All the standard constructions in classic euclidean geometry, (ie, creating lines and circles, and finding intersections of any two lines, two circles, or a line and a circle)\n\t\t\n  * Given the standard Spiral of Archimedes as constructed in Figure fig:spiraldef, you can construct the intersection of the spiral and any line passing through the origin.\n\t\t\n  * Given the standard Spiral of Archimedes as constructed in Figure fig:spiraldef, you can construct the intersection of the spiral and any circle centered at the origin.\n\t\n\t\n\n\n\tThe field described in Definition def:spiralt1field is equal to 𝒯_1.\n\n\n\tTo proceed with this proof we shall show that every number in each field is present in the other\n\n\t(Archm ⇒𝒯_1).  Notice that if you have any angle, you can create a ray from the origin with an angle α the distance from the point of intersection on the spiral and the origin will be |α|, thus showing it is constructible. Likewise for any constructible real number r, then taking that number we can create a circle of radius r centered at the origin. Drawing a ray from the origin to this point lets us create a ray of z radians from the real axis. Showing every number constructible using classic Euclidean constructions will wait until lemma lem:t1constructible\n \n\t(𝒯_1 ⇒ Archem).   Notice the parameterization of the spiral of Archimedes as (t·cos(t),t·sin(t))., this lets us algebraically solve for the intersection points of any circle centered at the origin with radius r, namely rcos(t)+i· r sin(t). Likewise for any ray from the origin with an angle θ its intersection point will be defined by θcos(θ)+ i ·θ + sin(θ)\n\n\n\n\n\n§ TRANSCENDENCE OF 𝒯_1\n\nNow having established some various formulas for the algebra of 𝒯_1 we can continue deriving results first citing an important theorem in transcendental number theory.\n\n\tThe transcendence degree of a field ℱ is the smallest number of transcendental elements a_1, …, a_n such that every element of ℱ can be expressed as the roots of polynomials with coefficients in ℚ(a_1, …, a_n)\n\n\n\tFor any linearly independent set of algebraic numbers a_1,a_2,…,a_n, then the transcendence degree of ℚ(e^a_1,e^a_2…, e^a_n) is n\n\nA proof for this is available in natarajan_pillars_2020 \n\n\tπ is transcendental (not the root of any polynomial with rational coefficients)\n\n\n\tTo show that π is not algebraic, we must show that π being algebraic leads to a contradiction. If π is algebraic, then iπ is algebraic, and therefore the field ℚ(e^iπ)=ℚ(-1)=ℚ has transcendence degree 1. But ℚ trivially has a transcendence degree of 0, so π is transcendental.\n\n\n\tThe transcendence degree of 𝒯_1 is infinite.\n\n\n\tThe key to this will be the Lindemann–Weierstrass theorem.  Since the set\n\t\n    {i√(p)    |   p  prime}\n\n\tgives you an infinite set of algebraic numbers that are trigonometric and linearly independent. Via theorem thm:exp the number e^i √(p) is constructible. And since 𝒯_1 is contained in the extension\n\t\n    ℚ(e^i,e^i√(2),e^i√(3),e^i√(5)…) ⊂𝒯\n\n\tThus the transcendence degree of 𝒯_1 is infinite.\n\n\n\tFor a,b∈𝒯_1 and β∈ℝ, then α^β is constructible if and only if |α|^β is constructible. \n\n\n\tOne direction is simple since for real β then we can take the absolute value of α^β to give us |α^β|=|α|^β. For the other direction notice that for any trigonometric α we can break it down into α = |α|e^iδ. Like so\n\t\n    α   =|α|e^iδ\n    α^β   =(|α|e^iδ)^β\n    α^β   =|α|^β e^iδβ\n\n\tSince e^iδβ is trigonometric then if |α|^β is trigonometric then α^β is trigonometric.\n\n\n\tFor α∈ S_1 and trigonometric then √(α) is trigonometric. (Setting α =1 gives you the roots of unity.)\n\n\n\tThe special case of Theorem thm:exp1 where |α|=1 since 1^β=1. Any nth root of unity is constructible since e^2π i/n=ζ_n.\n\nFor the next result, we need a quick definition:\n\n\tA group is abelian, if for any 2 elements a,b then a ⋆ b = b ⋆ a.\n\n\n\tIf ℱ is a field with a finite abelian Galois extension then ℱ is contained in the field generated by some nth root of unity.\n\t\n\nDue to Kronecker and Weber the author originally found the theorem in dummit_abstract_2009 on page 600.\n\n\tEvery number inside a finite abelian extension of ℚ is contained in 𝒯_1. \n\nThis also with a quick lemma lets us take care of showing that our algebraic definition of 𝒯_1 also contains all constructible numbers\n\n\tEvery constructible number is contained in 𝒯_1, alternatively written as 𝒞⊆𝒯_1\n\t\n\n\n\tEvery quadratic has degree 2 and thus has galois group of at most degree 2!=2, since every group of order 2 is abelian it is contained in 𝒯_1\n\nThis shows that there is a vast array of polynomials that can be created through this process, including the roots of irreducible polynomials to any degree.\n\n\n§ ROOTS OF POLYNOMIALS WITH NONABELIAN GALOIS GROUPS IN 𝒯_1 AND DOUBLING THE CUBE IS NOT POSSIBLE WITH ANGLE PARTITONS\n\nThe main goal of this section will be to show that it is possible to construct algebraic numbers outside of the abelian numbers generated by the Kronecker-Weber theorem. And build the foundations for why certain numbers such as √(2) are probably not contained in 𝒯_1\n\n\n\n\tFor any nontrivial Pythagorean triple a^2+b^2=c^2  Then\n\t\n    a+bi/c\n\n\tis not a root of unity.\n\n\n\tVia the previous theorem, all we need to do is check that a+bi is not a root of unity of degree n where φ(n)=2, namely we have to check 3, 4 and 6. And since the 3rd and 6th roots of unity involve Gaussian integers divided by square roots. And the fact that a and b have to be not equal to zero takes care of the 4th roots of unity.\n\n\n\tMinimal polynomial of the trigonometric number √(a+bi/√(a^2+b^2)) for a,b ∈ℝ is x^2n -(2a(a^2+b^2)^-3/2)x^n+1\n\n\n\n    √(a+bi/√(a^2+b^2))   = x \n    \n    \ta+b√(-1)   = x^n√(a^2+b^2)\n    \n    \tb√(-1)   =x^n√(a^2+b^2)-a \n    \n    \t-b^2   =(x^n√(a^2+b^2) -a)^2 \n    \n    \t0   =(a^2+b^2)x^2n -2ax^n√(a^2+b^2)+a^2+b^2\n    \n    \t0   =x^2n-2a/√(a^2+b^2)x^n+1\n\n\n\n\t𝒯_1 contains algebraic numbers with nonabelian field extensions.\n\n\n\tConsider the number 3+4i/5, via Theorem thm:exp1, the number √(3+4i/5) is trigonometric. Since it's algebraic it must have a minimal polynomial and using lemma lem:minpoly1 it has a minimal polynomial of 5x^6 - 6x^3 + 5. The Galois group of this subgroup of the permutation group S_6 is generated by the following elements.\n\t\n    {(24),(35),(12),(34),(56)}\n\n\tThis group is not abelian since (24)(12)≠ (12)(24).[Calculated using the Magma CAS]\n\nWe can solve many more polynomials with nonabelian galois extensions.\n\n\tThe solutions for a reduced cubic polynomial x^3+px+q=0 are expressible using trigonometric functions:\n\t\n    x_k=2 √(-p/3)cos[1/3arccos(3 q/2 p√(-3/p))-2 π k/3]    for  k=0,1,2\n\n\nThis quite helpful result is given by nickalls_viete_2006 paper on Descartes and the cubic equation. Furthermore doing some results on the cubic discriminant quantity 3 q/2 p√(-3/p). Lets us conclude that the polynomial has 3 real roots if the discriminant has a magnitude less than or equal to 1. And has 2 complex roots and 1 real root otherwise.\n\n\tIf a cubic has three real roots then it splits over 𝒯_1\n\n\n\tThe proof for this hinges on the proof that when the input value to arccos namely (3 q/2 p√(-3/p)) is between -1 and 1, then the polynomial will have three real solutions. The alternative case where a cubic has 1 real and 2 complex roots, (ie x^3-2), will involve putting values with a magnitude greater than or equal to 1.\n\nDoes this describe all the polynomials we can create with our algebra? This and other questions have a nonzero probability of potentially being answered in this paper!\n\n\tThe polynomial x^2n+2cx^n+1 has solutions in 𝒯_1 for trigonometric and real |c|≤ 1\n\n\n\tConsider the minimal polynomial of\n\t\n    x=√(-1+√(c^2-1)/√(1+c^2-1))\n\n\tSince it is in our special form we can use Lemma lem:minpoly1 to say that the minimal polynomial is:\n\t\n    0   =x^2n-2(-1)/√(c^2)x^n+1\n    \n    \t\t0   =x^2n-(-2c)x^n +1\n    \n    \t\t0   =x^2n+2cx^n+1\n\n\tUnfortunately, the limitation is that √(c^2-1) must be real forces c to be in 0≤ c ≤ 1. Luckily doing some variable substitution and flipping the sign of a in our initial number gives us the minimal polynomial\n\t\n    x=√(1+√(c^2-1)/√(1+c^2-1))\n    \n    \t\t0=x^2n-2cx^n+1\n\n\tThus letting us conclude that |c|≤ 1.\n\n\n\tGiven a root z of x^2n+2cx^n+1, the polynomial splits over {z,z̅,zζ_n^1,z̅ζ_n^1,…,zζ_n^n,z̅ζ_n^n}\n\n\n\tThe step is to verify that if z is a root of x^2n+2cx^n+1 then so is zζ^k_n we can do this with substitution and the definition that (ζ_n^k)^n=1 we can simplify down\n\t\n    0   =(zζ_n^k)^2n+c(zζ_n^k)^n+1\n    \n    \t\t0   =z^n(ζ_n^k)^2n+cz^n(ζ_n^k)^n+1\n    \n    \t\t0   =z^n(ζ_n^k)^2n+cz^n(ζ_n^k)^n+1\n    \n    \t\t0   =z^n+cz^n+1\n    \n    \t\t0   =0\n\n\tThus verifying that zζ^k_n is a root. Since the polynomial has all real coefficients the conjugate of every root z ζ^k_n is also a root. Since the conjugate of any root of unity is also a root of unity, you can write the set of 2n roots as {z ζ^k_n,z̅ζ^k_n}\n\n\n\n\tFor any x composed of a linear combination of roots of unity ζ_n such that |x|=1. If x is equal to a minimal kth root of unity then φ(k)|φ(n). \n\n\n\tSince x is a root of unity ζ_k and all x,x^2,… are in the field extension given by the cyclotomic polynomial Φ(n). This implies that the field extension given by Φ(k) is a subfield of Φ(n). Implying that φ(k)|φ(n).2\n\n\n\tFor any natural number n, then φ(n) denotes the number of naturals less than or equal to n that are coprime to n. (Notice that every number less then any prime p is coprime to it, so φ(p)=p-1)\n\n\n\tThe degree of the splitting field of x^2n+cx^n+1 with coefficients in ℱ is |ℱ(z,z̅)|·φ(n).\n\n\n\tIf you extend the field of coefficients ℱ to include a root z and its conjugate z̅, then including the roots of unity will create the splitting field of x^2n+cx^n+1. Since the degree of the root of unity ζ_n is φ(n), we can calculate the degree of the entire field.\n\n\n\n\tGoing further we can see that the nice polynomial x^2n-2cx^n+1 has a root of\n\tz so using the field properties we have that 2(z)=z+z̅ is trigonometric. The minimal polynomial of this through computer algebra calculations yields interesting patterns.\n\t\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒ x^3 - 3 x - 2 c\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒ \n    \t\tx^4 - 4 x^2 - 2 c + 2\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒ \n    \t\tx^5 - 5 x^3 + 5 x - 2 c\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒ \n    \t\tx^6 - 6 x^4 + 9 x^2 - 2 c - 2\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒ \n    \t\tx^7 - 7 x^5 + 14 x^3 - 7 x - 2 c\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒ \n    \t\tx^8 - 8 x^6 + 20 x^4 - 16 x^2 - 2 c + 2\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒\n    \t\tx^9 - 9 x^7 + 27 x^5 - 30 x^3 + 9 x - 2 c\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒\n    \t\tx^10 - 10 x^8 + 35 x^6 - 50 x^4 + 25 x^2 - 2 c - 2\n    √(c - i √(1 - c^2)) + √(c + i √(1 - c^2))   ⇒\n    \t\tx^11 - 11 x^9 + 44 x^7 - 77 x^5 + 55 x^3 - 11 x - 2 c\n\n\tas computed by sympy.\n\n\tDo the polynomials as defined above follow the following patterns indefinitely?\n\t\n    S_2n+1(k)   =0\n    \n    \t\tS_0(k)   =1\n    \n    \t\tS_2(k)   =-n\n    \n    \t\tS_4(k)   =(k-1)(k-2)/2\n    \n    \t\tS_6(k)   =-(k-1)(k-2)(k+3)/6\n    \n    \t\tS_8(k)   =(k-1)(k-2)(k-3)(k+4)/24\n\n\t(S_4,S_6 and S_8 were found using the help of OEIS: https://oeis.org/A000096A000096, https://oeis.org/A005581A005581 and https://oeis.org/A005582A005582) \n\n\n\tEach of the minimal polynomials has at least n real roots. (Where n is the degree of the angle partition.) \n\n\n\tSince we are asking what the minimal polynomial of z+z̅, P(x) where z is a root of x^2n+2cx^n+1.\t\n\tNamely,\n\t\n    a_n(z+z̅)^n+a_n-1(z+z̅)^n-1+…+a_1(z+z̅)+a_0=0\n\n\tThen consider the field automorphism f_k on the roots of that polynomial mapping z ↦ z ζ_n^k and z̅↦z̅ (ζ_n^k)^-1. Since this automorphism has the property that f_k(z̅)=f_k(z). We now have that f_k(z+z̅)=f_k(z)+f_k(z) and it thus forms a valid automorphism on whatever the minimal polynomial of z+z̅ will be. Since there are n different f_k each with a different ζ_n^k, it shows that there will be a minimum of n different roots created by the images of the principal root. In addition, all roots must be real since 2 (z)=z+z̅.\n\n\n\n\n\tEach of the minimal polynomials has at least n real roots. (Where n is the degree of the angle partition.) \n\n\n\tSince we are asking what the minimal polynomial of z+z̅, P(x) where z is a root of x^2n+2cx^n+1.\t\n\tNamely,\n\t\n    a_n(z+z̅)^n+a_n-1(z+z̅)^n-1+…+a_1(z+z̅)+a_0=0\n\n\tThen consider the field automorphism f_k on the roots of that polynomial mapping z ↦ z ζ_n^k and z̅↦z̅ (ζ_n^k)^-1. Since this automorphism has the property that f_k(z̅)=f_k(z). We now have that f_k(z+z̅)=f_k(z)+f_k(z) and it thus forms a valid automorphism on whatever the minimal polynomial of z+z̅ will be. Since there are n different f_k each with a different ζ_n^k, it shows that there will be a minimum of n different roots created by the images of the principal root. In addition, all roots must be real since 2 (z)=z+z̅.\n\n\n\n\n\tThe degree of ℱ(z+z̅):ℱ is at most degree n.\n\n\n\tRecall de-moivres formula \n\t\n    (cos(θ)+i sin(θ))^n=cos(nθ)+isin(nθ)\n\n\tThen taking the real values of this expression we get that\n\t\n    cos(nθ)   =cos(θ)^n+a_n-2cos(θ)^n-2sin(θ)^2+a_n-4cos(θ)^n-4sin(θ)^4+…\n    cos(θ)   =P(cos(θ),sin(θ)^2)\n\n\tNotice that every component must have an even power of sin(θ), since the only way to get an odd coefficient would be to multiply together isin(θ) an odd number of times, giving you an imaginary value. However, we can use some substitution at this point, namely since |z|=1, we can let (z)=cos(θ) and (z)=sin(θ). Furthermore, using the geometric interpretation we can say that cos(nθ) is just the real value of the point we were partitioning, aka c. performing this substitution we get\n\t\n    c    = P((z),(z)^2)\n    \n    \t\tc    = P(z+z̅/2,(√(1-(z+z̅/2)^2))^2)\n    \n    \t\tc    = P(z+z̅/2, 1-(z+z̅/2)^2)\n    \n    \t\t0    =(z+z̅/2)^n+(z+z̅/2)^n-2(1-(z+z̅)^2/4)+(z+z̅/2)^n-4(1-(z+z̅)^2/4)^2+…-c\n\n\tClosely inspecting this polynomial we can see that it is a polynomial with coefficients in mathcalF with z+z̅ as a root that is at most degree n. Thus showing the degree of ℱ(z+z̅):ℱ is at most degree n.\n\n\n\tThe minimal polynomial of z+z̅ has all real roots.\n\n\n\tThe minimal polynomial of z+z̅ must be at most degree n but since it has n real roots all its roots must be real.\n\n\n\tLet 𝒫 be the field generated by allowing the traditional euclidean geometric constructions in addition to additional constructions allowing arbitrary partitions of any angle.\n\n\n\tThe field 𝒫∩ℝ (the field of real partitionable values) is splitting over ℚ.\n\n\n\tWe shall prove this by showing that 𝒫∩ℝ is generated by extensions of splitting fields of any quadratic with real roots, plus the minimal polynomials of z+z̅ where z is a root of x^2n+2c+1. The field extension ℱ(z,z̅):ℱ(z+z̅)=2. Since we can write z in this form.\n\t\n    z = z+z̅/2+i√(1-(z+z̅/2)^2)\n\n\tUsing our earlier lemmas about the minimal polynomial about numbers of the form a+bi then z must be the root of the polynomial\n\t\n    x^2-x(z+z̅)+1\n\n\tThus every element in our field can be generated using polynomials with all real roots and quadratics. Since every extension composed of repeated quadratics can be decomposed as quadratics with real roots, plus a single imaginary extension. Since every quadratic has either all real or all imaginary roots, then every member of the field can be constructed using a polynomial with real roots, plus real quadratic extensions plus an imaginary quadratic extension. Thus for any real number in 𝒫∩ℝ, it can be included in a tower of splitting fields with all real values. Thus the entire real field must be splitting.\n\n\tThe real constructible numbers and resultant constructions are generated using quadratics with real roots. The nth partition is taken care of using the minimal polynomial of z+z̅, since if you are partitioning an angle α, since you can calculate the cos(α), then the entire problem can be boiled down to calculating cos(α/n) luckily our number z+z̅ can be described as taking in our initial value c and applying this exact map.\n\t\n\t\n    z+z̅=2*cos(arccos(c)/n)\n\n\tWe can then replicate sinα/n by using the result of a real valued quadratic √(1-(z+z̅)^2/4). Since nth partitions of angles can be reduced to operations on the unit circle, this is enough to generate 𝒫∩ℝ. Since it is possible to generate the field using splitting fields, via Lemma lem:splittower, the entire field 𝒫∩ℝ is splitting.\n\n\n\n\tIf p(x) is an irreducible polynomial over the rationals with real and complex roots then it has no roots in 𝒫\n\t\n\n\n\tConsider what would happen if a real root k_R of p(x) was included, since 𝒫(x) ∩ℛ is splitting then every root of p(x) must be in 𝒫(x) ∩ℛ, this is impossible since some roots of p(x) are complex. Likewise any complex root k_I cannot be included since 𝒫 is splitting, but k_R cannot be included so neither can k_I.\n\nThe first form I have seen of a proof for this in the literature is <cit.>, where he proves a weaker version for cubics and angle trisection only using Cardano's closed-form solution. (There is an error in this earlier formulation where he states: \"A real cubic equation can be solved geometrically using ruler, compass, and angle-trisector if and only if its roots are all real\", this is true of irreducible cubics, but simple examples like x^3-1 disprove the general case.) \n\n\tEvery irreducible polynomial with an abelian galois extension has all real or all complex roots.\n\n\n\tVia Theorem thm:kron our polynomial must have all its roots constructible using angle partitions. Thus our polynomial must have all real or all complex roots via Theorem thm:thebigone.\n\n\n\tAny odd kth root of a prime number √(p), is not constructible using angle partitions, for any odd k greater than 3.\n\n\n\tSince the minimal polynomial x^n-p is irreducible via Eisenstein's criterion since p divides every coefficient except for the first and p^2 does not divide p. For n ≥ 3 the polynomial has both real and complex roots then √(p) is not constructible using partitions. (Also serves as an argument that doubling the cube is impossible with conventional euclidean geometry.)\n\n\nThis leads us to the following result that will be further expanded upon in the conclusion.\n\n\tSince doubling the cube is impossible with angle partitions it seems unlikely that it is possible in 𝒯_1.\n\n\n\n§ GENERAL INTERSECTIONS OF TRANSCENDENTAL CURVES\n\nLimiting ourselves to certain intersections let us use the similar geometric interactions of all curves to produce a field with an interesting algebraic structure. Letting in other kinds of intersections introduces a great amount of complexity to the problem.  Consider first the field created by allowing any sloped line intersections with simple trigonometric functions like sin and cos\n\n\n\tThe field generated by allowing sloped line intersections with sin or cos is the field 𝒯_1 adjoined with the roots of the expression sinx+ax+b\n\n\n\tIf both a and b are algebraic then any solution x, qsin^-1(x) are transcendental.\n\n\n\tFirst, assume that x is algebraic, then since a and b are algebraic then ax+b is algebraic, and therefore sinx is algebraic, but if x is algebraic then sinx is algebraic, but via [Lindemann–Weierstrass] sinx and x cant both be algebraic so by contradiction x is transcendental. Since ax+b is transcendental then sinx is also transcendental.\n\n\n\tUnder the constraints of Theorem thm:t2tran1 then for any solution x then sin^-1(x) must be transcendental\n\n\n\tBecause sinπ·p/q is algebraic, it contradicts the aforementioned theorem. Thus π·p/q is not a valid solution.\n\n\n\n\tFor any numbers a ∈ℝ and b ∈𝒯_1 the equation sin(x)=ax+(sin(b)-ab) has a trigonometric solution\n\n\n\tA solution of x=b satisfies the equation.\n\n\n\tThe problem statement is equivalent to finding all roots of bx-x^3/6+x^5/25+…\n\n\n\tUsing the Taylor series expansion for sin(x) we have that we are trying to find the roots of\n\t\n    -(b_1x+a_1)+(x-x^3/3!+x^5/5!-x^7/7!)\n\n\n\n\tAny sloped line intersecting the quadratrix involves finding the solution to a+b/x=(x)\n\n\n\t\n    ax+b   =x(π x/2)\n    \n    \t\ta+b/x   =(π x /2) \n    \n    \t\ta+b/x   =(x)\n\n\n\nFurthermore, some basic plots seem to indicate that there is a trove of complex solutions to even the simple base case of sin(x)-ax\n\nFurthermore, the where sin(x) and ax intersect and are tangent has a fascinating expression in the complex plane, where the complex solutions combine on the real line into a solution with a multiplicity of 2, before separating on the real line as seen in Figure fig:sintangent.\n\nWhat's interesting is that the characteristic equations for the quadratrix seem to buck the trend and only have solutions appearing on the real line.\n\n\n\n\n§ CONCLUSION\n\nDespite the best efforts of the author some important questions on this matter remain unresolved, \n\n\tDoes the field created by allowing arbitrary partition of angles 𝒫 completely encapsulate the algebraic numbers in 𝒯_1\n\nThe strategy used for this involved turning our geometric constructions into algebra and then using our base algebraic objects to construct the following class of functions that take in algebraic numbers and output algebraic numbers.\n\n    f_q: 𝔸→𝔸\n    \n    \tf_q(z)= e^q ·ln(z)\n\nHowever, saying that this class of functions generates all algebraic numbers would involve proving that there are no other \"ways\" of making algebraic numbers. For example, consider the function\n\n\n    g: 𝔸×𝔸×𝔸→ℂ\n    \n    \tg(a,b,c)=e^ln(a)ln(b)/ln(c)\n\nWe know that this function does produce algebraic output when c equals 0. Or when either a or b are expressible as c raised to a rational power. (Actually plugging in values gives you results that look like 2^log_3(5).) There might very well be a theorem in transcendental number theory that could easily resolve this.\n\nLikewise, there are a bunch of additional questions that could be answered about allowing general intersections, namely.\n\n\tAre all the fields allowing general intersections with the transcendental curves (trig functions, Quadratrix of Hippias, Archemedian Spiral) identical? (Do they form a larger 𝒯_2)\n\nI suspect that if it is true it would be very hard to prove, but on the other hand, it would be very pretty if it was true.\n\n\tDoes allowing general intersections in any of the transcendental curves allow the construction of algebraic numbers that are impossible in 𝒯_1\n\nThere might very well be a clever trick in the algebra to allow this and if any reader would be interested in continuing this work further I would recommend they consider starting here.\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nI would like to sincerely thank Dr. John Carter for advising me on this project and helping me through the publication process, as well as teaching the History of Mathematics class where the quadratrix was first introduced to me.\n\n\n\n\n\n\n\n\n\n"}