{"entry_id": "http://arxiv.org/abs/2303.07291v1", "published": "20230313171136", "title": "Anyon condensation in the string-net models", "authors": ["Chien-Hung Lin", "Fiona J. Burnell"], "primary_category": "cond-mat.str-el", "categories": ["cond-mat.str-el", "math-ph", "math.MP", "quant-ph"], "text": "\n\n\n\n\n\nSchool of Physics and Astronomy, University of Minnesota, Minneapolis, Minnesota 55455, USA\n\n\n\n\n\nWe study condensation of abelian bosons in string-net models, by constructing a family of Hamiltonians that can be tuned through any such transition.  We show that these Hamiltonians admit two exactly solvable, string-net limits: one deep in the uncondensed phase, described by an initial, uncondensed string net Hamiltonian, and one deep in the condensed phase, described by a final, condensed string net model.  \nWe give a systematic description of the condensed string net model in terms of the uncondensed string net and the data associated with the condensing abelian bosons.\nSpecifically, if the uncondensed string net is described by a fusion category 𝒞, we show how the string labels and fusion data of the fusion category  𝒞̃\ndescribing the condensed string net can be obtained from that of 𝒞 and the data describing the string oeprators that create the condensing boson.  \nThis construction generalizes previous approaches to anyon condensation in string nets, by allowing the condensation of arbitrary abelian bosons, including chiral bosons in string nets constructed from (for example) Chern-Simons theories, which describe time-reversal invariant bilayer states.  This gives a method for obtaining the full data for string nets without explicit time-reversal symmetry from such bilayer models.  \nWe illustrate our approach with several examples.  \n\n\n\nAnyon condensation in the string-net models\n    Fiona J. Burnell\n    March 30, 2023\n===========================================\n\n\n\n\n\nAnyon condensation in the string-net models\n    Fiona J. Burnell\n    March 30, 2023\n===========================================\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nThe universal, low-energy properties of gapped phases of quantum matter are described using two principles: symmetry and topological order.    \nConsiderable effort in recent years has gone into expanding our understanding of the resulting geneaology of quantum phases that cannot be described by the Landau paradigm of spontaneously broken symmetries, unveiling many new intriguing possibilities for strongly interacting systems.\nAmong the earliest notable exceptions to Landau's framework are topologically ordered phases in 2+1 dimensions,<cit.>, \nwhich harbor emergent point-like particles (known as anyons) with fractional statistics.\n\nThe long-ranged properties of topologically ordered phases are captured by a mathematical structure known as a unitary modular tensor category (UMTC) <cit.>, which describes the rules governing fusion and braiding of point-like excitations.  Thus our knowledge of the possible topologically ordered phases – much like our knowledge of the possible symmetry groups –  is quite be complete.   Given this, it is natural to ask which phases can, in principle, be related by second-order phase transitions?  \n\nIn the case of topological order, this question is closely related to the question of which topological orders are related by so-called anyon condensation transitions (see <cit.> for a brief review).  Such transitions were first studied in the context of conformal field theory<cit.>, and they have been discussed for general UMTC's in the mathematical literature <cit.>.  Refs. <cit.> described how, in the context of 2+1 dimensional topologically ordered phases, these transitions physically correspond to processes in which emergent bosons condense; the topological order obtained is then a direct consequence of the new, condensed, vacuum.  \n\nAnyon condensation has proven useful in understanding not only the structure of topological phases<cit.>, but also when they admit gappable boundaries<cit.>, and how to create non-abelian topological orders<cit.> or topological defects<cit.> from abelian ones.\nMoreover, the possibility of condensing anyons to change a topological order also opens up the door for novel second-order critical points which may not have analogues in conventional symmetry-breaking transitions<cit.>.  Recently, it has been observed that anyon condensation can also be used to study certain dynamical processes in open quantum systems and quantum codes <cit.>.\n\n\nIn studying anyon condensation, it is useful to have a lattice Hamiltonian that can be tuned between the two phases in question.  This establishes beyond a doubt that a direct transition between the two topological orders can occur, and enables a variety of analytical and numerical approaches to be used to study both the corresponding phase transitions, and verify the above description of the condensed phase <cit.>.   Lattice models of anyon condensation are also useful for constructing Hamiltonians realizing symmetry-enriched topological orders <cit.>.   \n\n\nThe present work focuses on a family of 2D topological orders known as Drinfeld centers, which are believed to be the most general class of (bosonic) topological orders compatible with gapped boundaries <cit.>.   These can be realized by commuting projector lattice models known as string nets <cit.>.  The string net construction begins not from the UMTC describing the anyon model, but from a pivotal fusion category C, which describes the Hamiltonian and ground states.  The full topological order (i.e. UMTC) is exhibited by studying so-called string operators, which realize point-like anyonic excitations at their end-points.  A number of works have previously studied anyon condensation in these models <cit.>.  \nHowever, the literature so far has focused primarily on transitions which condense a particular type of boson within these string net models, corresponding to excitations of only the plaquette term in the string net Hamiltonian.   For such condensation processes a general prescription exists<cit.> to modify the string-net Hamiltonian by adding a term which can drive anyon condensation; in the limit that this term is very large the Hamiltonian reduces to a new string net model realizing the topological order of the condensed phase, constructed from a sub-category of the original fusion category 𝒞.  In other words, the data for the string net model of the condensed phase follows straightforwardly from that of the uncondensed phase.  (The relation between the string operators of the condensed and uncondensed phases, however, is not quite so straightforward).  \n\nHere, we will describe a general formalism that describes condensation of arbitrary abelian bosons in string-net models.[An abelian boson is simply a boson that has a unique fusion outcome with any other anyon in the theory.]   First, we describe an extended version of the string net construction, obtained by extending the Hilbert space using an approach similar to that of Ref. <cit.>, albeit tailored to simplify the description of the condensed phase.  Within this extended Hilbert space, we construct a family of model Hamiltonians that can be tuned through a transition involving the condensation of any abelian boson, and outline the topological order expected for the resulting condensed phase.   Our modified model has the advantage that deep in the condensed phase, a general prescription can be given to identify both the low-energy effective Hilbert space and the ground state.   We describe how the Hilbert space of the condensed phase can be described by a new, effective,  set of string labels (i.e. a new effective fusion category 𝒞̃), whose relationship to the original label set can be calculated explicitly.  We further show that the ground state of the condensed phase is also a string-net ground state, described by the data of the new fusion category 𝒞̃.  In this regime, our Hamiltonian acts like the regular string net Hamiltonian on the new label set.  \nMoreover, we obtain an explicit expression for the fusion data of 𝒞̃ in terms of 𝒞 and the condensing bosons.  \n\n\nThe relationship between the topological order of the uncondensed and condensed anyon models can be \ncharacterized by the fate of  the anyons of the original topological order in this condensed vacuum.  First, anyons that braid non-trivially with any of the condensing bosons become confined, and are absent from the topological order of the condensed theory.  Second, two anyons that are related by fusion with one of the condensing bosons must be identified in the condensed phase, meaning that topologically speaking, they correspond to the same excitation.  Finally,  certain non-abelian anyons can split into multiple distinct anyon types after condensation.  For condensation of abelian bosons, these relationships are well known in conformal field theory, where they go by the name of central extensions<cit.>, and the S and T matrices of the final topological orders can be computed explicitly.\nHowever, as noted by Ref. <cit.>, the task of computing the full topological data - namely F and R matrices - is significantly more challenging.\nOur approach does not easily give us access to the full topological data of the anyon model – indeed, though the confinement, identification, and splitting of anyons in the final topological order is apparent from the form of our Hamiltonian, in our approach the associated topological data is inferred only indirectly, through the emergence of the new string net data 𝒞̃, which in turn implies a new set of anyon- creating string operators.  However, \nwe show that our approach to string net condensation does allow one to straightforwardly compute the data of the fusion category underlying the condensed phase, as we demonstrate explicitly in a number of examples.  \n\n\nAn interesting application of the condensation transitions studied here is that they can take a string net with an explicit time-reversal symmetry (of the type described in the original work by Levin and Wen<cit.>) into one that does not admit a naive time-reversal transformation (described in detail in Ref. <cit.>).  One example that we will discuss in detail is the transition from SU(2)_4 ×SU(2)_4 to U(1)_3 ×SU(2)_4, for which 𝒞 = SU(2)_4 has all of the symmetries assumed by Ref. <cit.>, while C̃ = TY_3 does not.  \n\n\n\nThe paper is organized as follows. In Sec. <ref>, we review some basics of general string-net ground states, and introduce the extended string-net Hilbert space that we use to study anyon condensation.\nIn Sec. <ref>, we introduce a family of modified string net Hamiltonians, which can be tuned across a transition condensing an arbitrary abelian boson.\nWe describe the effective Hilbert space deep in the condensed phase in Sec. <ref>, where we discuss how the string types in 𝒞̃ are related to those in 𝒞.   In Sec. <ref>, we study the condensed ground state, and show that it is indeed a string net.  In particular, we show how the new ground state allows one to describe the fusion data of 𝒞̃, verify that this fusion data is indeed consistent, and argue that the full Hamiltonian projected into the condensed Hilbert space is indeed the associated string net Hamiltonian. \nWe illustrate our construction with concrete examples in Sec. <ref>. A number of technical details are elaborated on in the appendices.\n\n\n\n\n\n\n\n\n\n\n\n\n§ EXTENDED STRING-NET MODELS \n \nIn this section, we introduce the extended string-net models that we will use for our models of anyon condensation. \n\n\n\n\n\n §.§ Review: Generalized string net models\n \n\nWe begin by reviewing the string-net construction.  Here we use the generalized string-net construction of Ref. <cit.> (see also Refs. <cit.>), since the symmetries assumed in the original construction<cit.> are not always present in the condensed phase.\n\nWe defer a discussion of string-net Hamiltonians to Sec. <ref>, and here focus on the string-net Hilbert space, together with its ground states and certain excited states.\n\n\n\n\n  §.§.§ The string-net ground state\n \n\nThe string net model consists of a Hamiltonian whose ground state(s) obey certain special properties, which we now describe.  \nThese string-net ground states live in a Hilbert space of string-net configurations, each of which is defined  on an  oriented, trivalent graph.   (Though the string-net Hamiltonians are defined on the honeycomb lattice, this lattice structure is not necessary to describe the string-net ground states.)  Throughout this work, we use the convention that all strings are oriented upward, i.e. the orientation vector has positive projection onto the ŷ direction.  We therefore require this projection to be non-zero, such that our strings cannot have horizontal tangent vectors. \n\nThe string net configuration is obtained by assigning to each edge i  a label (or string type) a_i. \nThe combinations of string types { (a,b; c)} that are allowed to meet at a vertex is dictated by a set of branching rules– i.e. if (a,b;c) is among the branching rules, then the vertices \n\n    -0.22in\n        < g r a p h i c s >\n        -0.22in\n        < g r a p h i c s >\n\nare allowed.  \nThe set of all string-net configurations which satisfy the above branching rules form an orthonormal basis for the string-net Hilbert space ℋ.  \nWe will call those states in this string-net Hilbert space string net states.\n\nIn order to be able to define a string-net ground state, our label set and branching rules must satisfy certain conditions.  \nFirst, defining  \n\n    δ^ab_c= {[                    1, if {a,b;c} is allowed;                    0,            otherwise. ].  ,\n\nthe branching rules must satisfy:\n\n    ∑_e δ^ab_e δ^ec_d = ∑_f δ^bc_f δ^af_d  .\n\nIt follows that if (a,b;c) is allowed, then so are  (c̅, a; b̅), (b, c̅; a̅), and (b̅ , a̅, c̅).  \n\nSecond, our label set must contain a null label, which we denote 0, and depict diagrammatically with a dashed line.  This label is trivial in the sense that edges carrying this null label can be added to or deleted without changing the physical state (i.e. a null labeled edge is physically equivalent to having no edge at all).  Note that we will use 0 to denote the trivial string label, and 1 to denote a trivial anyon.  \nFinally, for each string type a, we require that our label set contains a dual string type a̅, such that the branching rules must contain (a,a̅;0) and (a̅,a; 0) (but not (a,b;0) for any b ≠a̅). The null string 0 is self-dual, 0=0̅. \n\n \n\n\n\n\n\nThe string-net ground state  |Φ⟩ is described by two sets of parameters: a set of complex numbers F^abc_def, known as the F symbols, depending on 6 string types a,b,…,f, and a positive number d_a for each string type a, often called its quantum dimension.  These determine the relative coefficients of different string net configurations in the ground state, via the relations:\n\n\n    Φ(-0.22in\n        < g r a p h i c s >\n    )   =∑_f F^abc_defΦ(-0.22in\n        < g r a p h i c s >\n    ) \n    Φ(-0.22in\n        < g r a p h i c s >\n    )   =∑_c  √(d_c/d_a d_b)Φ(-0.22in\n        < g r a p h i c s >\n    ) \n    Φ(-0.22in\n        < g r a p h i c s >\n    )   =δ_c,d√(d_a d_b/d_c)Φ(-0.22in\n        < g r a p h i c s >\n    ) \n    Φ(-0.22in\n        < g r a p h i c s >\n    )   =∑_f (F^abc_d)_fe^-1Φ(-0.22in\n        < g r a p h i c s >\n    )\n\n\n\nHere a,b,c,… are arbitrary string types (including the null string) and the shaded regions represent arbitrary string-net configurations which are not changed from on side of the equation to the other. The symbol δ_c,d=1 if c=d and δ_c,d=0 otherwise.\n \nThe relative amplitudes in Eqs. (<ref>) are unchanged by horizontal bendings of the strings, but are not invariant under vertical bending.  Indeed, we do not allow smooth vertical bends in our string-net graphs at all; only kinks, which are equivalent to vertices (a, a̅; 0) or (a̅,a; 0).  These can be added or removed using the appropriate F symbols.  \n\n\nThe F-symbols and quantum dimensions are not free parameters.  Rather, \nto have a well-defined wave function Φ, the parameters {F^abc_cde,F̃^abc_cde,\nd_a} need to satisfy:\n\n\t\n    F^fcd_eglF^abl_efk   =∑_h F^abc_gfh F^ahd_egk F^bcd_khl\n    \n    \t\tF^abc_def   =1   if a or b  or c=0  \n    \n    \t\td_a   =d_a̅=1    if a=0   .\n\n\t\n\nThese constraints are in fact quite limiting; solutions are described mathematically by a pivotal fusion category.  \n\nIn addition, to ensure that the string-net Hamimltonian is Hermitian, we require:\n\n\t\n    (F^abc_d)^-1_ef   = (F^abc_dfe)^* \n    \n    \t\t|F^abb̅_ac0|    = √(d_c/d_a d_b)δ^ab_c \n    \n    \t\td_a     = d_a̅\n\n\t\t\n\nwhere (F^abc_d)^-1 is the matrix inverse of (F^abc_d), whose matrix elements are (F^abc_d)_ef≡ F^abc_def.\n\n\nThe conditions (<ref>) also imply that the quantum dimensions obey:\n\n    d_a d_b = ∑_c d_c\n\nwhere the sum runs over all values of c that satisfy the branching rules.  \n\n\n\n\n\nLocal unitary transformations of the string net wave function \nresult in new coefficients {F̂, d̂}, which are related to the original coefficients {F, d} via the gauge transformation: \n\n    F̂^abc_def   =F^abc_def·f^ab_ef^ec_d/f^bc_f f^af_d\n    d̂_a   =d_a  .\n\nHere f^ab_c parametrize the local unitary transformation; they are complex functions defined on upward vertices, with the downward vertices transformed by 1/f^ab_c.  To preserve the constraints listed above, we require\n\n    |f^ab_c|   =1,\n    \t\tf^ab_c=1  if a  or b=0.\n\n\nIt is convenient to note that the local rules (<ref>) imply the following identities:\n\n\t\n    Φ(-0.22in\n        < g r a p h i c s >\n    )   =∑_f [F^ab_cd]_efΦ(-0.22in\n        < g r a p h i c s >\n    ) \n    Φ(-0.22in\n        < g r a p h i c s >\n    )   =∑_f [F̃^ab_cd]_efΦ(-0.22in\n        < g r a p h i c s >\n    )\n\n\t\n\nwith \n\n\t\n    [F^ab_cd]_ef   \n    \t\t=(F^ceb_f)_da^-1 d_e d_f /d_d d_a\n    \n    \t[F̃^ab_cd]_ef   = F^ceb_fadd_e  d_f /d_a  d_d\n\n\t\n\n\n\n\n\n\n\n  §.§.§ Abelian string operators\n \n\nNext, we review the string operators that create point-like anyon excitations when acting on the ground state.  Here we focus on the case where these anyons  are abelian bosons, since these are the excitations we wish to condense.  (For a discussion of more general string operators, see Ref. <cit.>.)\nRecall that an abelian anyon is defined by the fact that it has a unique fusion product with any other anyon in the theory; it is a boson if it has trivial statistics with itself.\n\nTo create a particle-antiparticle pair (a, a̅) at two points in our lattice, we act on the string-net ground state with a string operator W_a(P) along an oriented path P.  This creates a at the final endpoint of P, and its antiparticle a̅ at the initial endpoint.  On a given string-net state X|, we depict this action by drawing an a-labeled string along the path P under the string-net graph.  The string label a specifies both a choice of one or more string types, and some extra data required to resolve crossings between the path P and \nthe string-net graph.  \n\nIf a ≡ϕ is an abelian anyon, the label ϕ corresponds to a single string type s,\nmeaning that in regions where P does not cross any edges of the string-net, we replace the label ϕ with s on upward-oriented segments of P, and s̅ on  downward-oriented segments of P.  Further, s (and s̅) must have a unique fusion product with all other string types, meaning that for each a, the branching rules contain (a,s; a') (and also (s,a; a')) for only one a', which we will sometimes denote as a' ≡ a × s.    It follows that \n\n    d_s = d_s̅ = 1,\n\nand thus d_a = d_a' by Eq. (<ref>).\nIn this case the coefficients associated with the moves (<ref>) and (<ref>) are unity.  \n\nFor abelian anyons, the crossings are resolved using the rules:\n\n    <-0.22in\n        < g r a p h i c s >\n    |=w_ϕ(a)<-0.22in\n        < g r a p h i c s >\n    |\n    <-0.22in\n        < g r a p h i c s >\n    |=w̅_ϕ(a)<-0.22in\n        < g r a p h i c s >\n    |\n\nHere w_ϕ(a),w̅_ϕ(a) \nare complex-valued functions of the string type a, with w_ϕ(0)=w̅_ϕ(0)\n=1.  \nThese rules, together with the local string-net rules (<ref>), dictate how to fuse the ϕ-string into the string-net graph,\ngiving a new string-net states X'|, multiplied by a product of w_ϕ,w̅_ϕ. \nThis defines the action of W_ϕ(P) in terms of the parameters (s,w,w̅).  For every abelian anyon ϕ, there is an inverse anyon ϕ̅, obeying ϕ×ϕ̅ = 1, where 1 denotes the identity anyon.  \n\n\nTo ensure that W_ϕ(P) creates point-like excitations in the string-net ground state, we choose the parameters (s,w,w̅) such that when acting on the string-net ground state |Φ⟩, the path independence condition:\n\n    W_ϕ(P)|Φ=W_ϕ(P')|Φ\n\nis satisfied for any two upward paths P,P' with the same end points.\nEq. (<ref>) will be satisfied if the corresponding parameters (s,w,w̅) obey\n\n\n    w_ϕ(a)w_ϕ(b)   =C_s(a,b,c) w_ϕ(c), \n    w̅_ϕ(a)   =w_ϕ(a)^-1\n    \n    \t\tw_ϕ(a)w_ϕ̅(a)   =C_a(s,s̅,0)^-1\n\n\n\nwith\n\n    C_s(a,b,c)=F^sab_c'a'cF^abs_c'cb'/F^asb_c'a'b'\n\nwhere x' = x× s  for x=a,b,c, and (a,b;c) is allowed by the branching rules.  Given a set of F-symbols satisfying (<ref>,<ref>) and a choice of the string s, in general we will find multiple solutions to Eqs. (<ref>) for w_ϕ.  We label these by m, and the corresponding anyon by ϕ=(s,m) where s is the string type created by the corresponding string operator W_ϕ and m labels distinct solutions for a given s.\n\nFor example, the ℤ_N string-net model has N string types a∈{0,1,…,N-1} with ℤ_N branching rules (a,b;c=a+b( mod N)).\nThere are N distinct solution to (<ref>)<cit.>\n\n    F(a,b,c)=e^2π i pa/N^2(b+c-[b+c]_N).\n\nlabeled by p=0,…,N-1. The arguments a,b,c take values in 0,…,N-1 and [b+c]_N denotes b+c (mod N) with values also taken in 0,…,N-1.  \nEach ℤ_N string-net model has N^2 topologically distinct quasiparticle excitations labeled by ϕ=(s,m) where s,m=0,1,…,N-1. The corresponding string operators W_ϕ are defined by the string parameters\n\n    w_ϕ(a)=e^2π i(psa/N^2+ma/N).\n\n\n\n\nThe braiding statistics of quasiparticles can be extracted from the commutation algebra of the corresponding string oeprators. (see Ref.  LinLevinstrnet, LevinWenstrnet, LinLevinBurnell for details). Specifically, the exchange statistics of ϕ=(s,m) is\n\n    e^iθ_ϕ = w_ϕ(s).\n\nThus self-bosons satisfy\n\n    w_ϕ(s)=1.\n\nIf ϕ = (s,m) and χ = (r,n) are two abelian bosons that we wish to condense simultaneously, then they must have trivial braiding.  This requires that<cit.>\n\n    w_ϕ(r) w_χ(s) = 1 .\n\n\n\n\n §.§ Extended string-net model\n\n\nIn the usual string-net construction, if s ≠ 0, W_ϕ(P) creates states outside of the string net Hilbert space,  since  near the endpoints of P there is no way to fuse an s-labeled string into the string net graph without creating vertices that violate the branching rules.  \nWhen we are only interested in the topological nature of the excitations, the resulting ambiguity in the action of W_ϕ(P) near the endpoints is unimportant, since it affects only the immediate vicinity of the excitation and hence cannot impact its topological properties.  In order to condense ϕ, however, we require a more careful treatment of these endpoints.  We achieve this by extending the string-net Hilbert space.  \n\n\n\n\n  §.§.§ Extended string-net Hilbert space\n\n\nThe extended string-net Hilbert space, ℋ_{ϕ}, is defined with respect to a set {ϕ}  of abelian bosons that we wish to condense.   \nSince every finite abelian group is isomorphic to a direct product of cyclic groups, we can assume without loss of generality that the group is G=ℤ_N_1×…×ℤ_N_k.   To understand how to condense all bosons in G, it is therefore sufficient to understand how to condense bosons in a single ℤ_N_j factor; thus in what follows, for simplicity we will often restrict ourselves to the case that the set of bosons to be condensed comprise a cyclic group.\n  \nThe string-nets in ℋ_{ϕ} are  oriented trivalent graphs with two types of edges, as shown in Fig. <ref>. The first type, which we will simply call edges, are edges connecting two trivalent vertices. Each such edge carries a string label as defined in ℋ.  \nThe second type of edge, which we will call sticks, has one end-point at a trivalent vertex, and one open endpoint.  A stick carries a |G|-spin label, which takes values in the set of abelian bosons {ϕ}.  This spin label ϕ=(s,m) also dictates a string label s associated with the stick; we require the labels at each trivalent vertex to satisfy the branching rules, and the total G-spin label (i.e. the sum of spin labels of all sticks) must be trivial.  \nAn orthonormal basis for the extended Hilbert space ℋ_ϕ is thus given by the set of all oriented trivalent graphs with sticks which (1) satisfy the branching rules at each trivalent vertex, and (2) have a net trivial G-spin.\n\n\n\n\n\n\n\n\n\nTo describe these extended string-nets on the lattice, we work on a decorated honeycomb lattice: at the center of each edge of the honeycomb lattice, we add an upward-pointing stick (see Fig. <ref> (b)). We introduce two types of spins on the decorated lattice: link spins, which live on its edges, and end spins, which live at the endpoints of each stick.\nThe link spins take values in the string types {0, a, b, c, ...} of the standard string-net model, and end spins take values in excitation labels {ϕ}.  We require a stick carrying a label ϕ=(s,m) to have the string label s, and that all trivalent vertices satisfy the branching rules.  \n\n\n\n\n\n  §.§.§ W_ϕ(P) in the extended string-net Hilbert space\n\n\nIn the following, we will use the extended string-net Hilbert space in two ways.  First, we may use it to describe a system whose ground state is the original string-net ground state, but which can also describe certain excited states that are not allowed in the original string-net Hilbert space.  In this case, sticks with non-trivial labels appear only in excited states, and the string-net ground state is exactly as described in Sec. <ref>.  \nSecond, in order to describe the condensed phase, we can view all sticks as part of the ground-state Hilbert space.  This will allow us to describe a modified set of local rules capturing the condensed phase, as we discuss in Sec. <ref>.\n\nHere, we take the first perspective, and describe the action of the string operator W_ϕ(P) in the extended Hilbert space.   The action of W_ϕ(P) on the string net ground state |Φ⟩ is exactly as specified in Sec. <ref> away from the end-points of P.  However, we now require P to begin and end on two sticks.  In adddition to its action on the edge labels, W_ϕ(P) acts by raising the end spin at the final and initial end-point of the path P by ϕ and ϕ, respectively. \n\n\n\n\n\n\n\n\n\n\n\nWhen {ϕ} is a set of abelian bosons with trivial mutual statistics,  we can describe any string operator W_ϕ(P) as a product of “basic string operators\" W^i_ϕ, each of which connects a pair of sticks on adjacent edges.  \nThe four basic string operators on the decorated honeycomb lattice act along the four paths p_1,p_2,p_3,p_4 shown in Fig. <ref>(a). \nThe operators W_ϕ^1,W_ϕ^2 act on paths p_1 and p_2 centered at upward vertices, while W_ϕ^3,W_ϕ^4 act on paths p_3 and p_4, centered at the downward vertices. \nTheir action is defined as follows.  Let a,b,c,d and e,f,g denote the initial link spin states along p_i and on the external legs of p_i respectively, and let ϕ_a,ϕ_b be the initial end spin states at stick a,b respectively (see Fig. <ref>). \nThe matrix elements of W^i_ϕ between an initial state a,b,c,d,e,f,g,ϕ_a,ϕ_b and a final state a',b',c',d',e,f,g,ϕ_a',ϕ_b' are then given by\n\n    W_ϕ,a'b'c'd';ϕ_a'ϕ_b'^1,abcd;ϕ_aϕ_b(efg)   =w̅_ϕ(f) δ_ϕ_a×ϕ,ϕ_a'δ_ϕ_b×ϕ̅,ϕ_b'×\n       F^eas_c'ca'\n    \t\tF^cfs_d'df'\n    \t\t(F^csf_d'c'f')^*\n    \t\tF^ss̅b_b 0 b'\n    \t\t(F^d s b'_gd'b)^*\n    \n    \tW_ϕ,a'b'c'd';ϕ_a'ϕ_b'^2,abcd;ϕ_aϕ_b(efg)    =\n    \tδ_ϕ_a×ϕ,ϕ_a'δ_ϕ_b×ϕ̅,ϕ_b'×\n       F^eas_c'ca'\n    \tF^fcs_d'dc'\n    \tF^ss̅b_b 0 b'\n    \t(F^d s b'_gd'b)^*  \n    \n    \tW_ϕ,a'b'c'd';ϕ_a'ϕ_b'^3,abcd;ϕ_aϕ_b(efg)   =w_ϕ(f) δ_ϕ_a×ϕ,ϕ_a'δ_ϕ_b×ϕ̅,ϕ_b'×\n       F^eas_c'ca'\n    \t\t(F^dfs_c'cf')^*\n    \t\tF^dsf_c'd'f'\n    \t\tF^ss̅b_b 0 b'\n    \t\t(F^d s b'_gd'b)^* \n    \n    \tW_ϕ,a'b'c'd';ϕ_a'ϕ_b'^4,abcd;ϕ_aϕ_b(efg)   =\n    \tδ_ϕ_a×ϕ,ϕ_a'δ_ϕ_b×ϕ̅,ϕ_b'×\n       F^eas_c'ca'\n    \t(F^fds_c'cd')^*\n    \tF^ss̅b_b 0 b'\n    \t(F^d s b'_gd'b)^*\n\nHere x' = x × s (or x ×s̅, if x=b), where \nwe use multiplicative notation for the abelian group operation on both edge and end spins. \n\n\nNotice that the matrix elements of open string operators are not invariant under local unitary transformations of the form (<ref>), and thus are gauge dependent.\nWhen ϕ are cyclic abelian bosons with trivial mutual statistics, there exists a convenient gauge\n\n    F(s^i,s^j,s^k)≡ F^s^is^js^k_s^(i+j+k)s^(i+j)s^(j+k)=1\n\nwhere s^i,s^j,s^k are any string types associated with condensing bosons (see Appendix <ref>).  We will work in the gauge (<ref>) in the rest of the paper.\n\nIn the gauge (<ref>), the basic string operators have the following important properties, which we derive in Appendix <ref>.\nFirst, all basic string operators commute with each other:\n\n    [W_ϕ^i,W_ϕ'^j]=0.\n\nSecond, one can show that\n\n    W^i†_ϕ =W^i_ϕ̅\n\nfor i=1,2,3,4.  \n\nFinally, a general string operator can be expressed as a product of simple string operators.\nFirst, W_ϕ_1^i, W_ϕ_2^i along the same path p_i can be combined as\n\n    W_ϕ_1^i · W_ϕ_2^i =W_ϕ_1×ϕ_2 ^i\n\nwhere the · operation is defined by\n\n    W_ϕ_3=ϕ_1×ϕ_2,a_3b_3̅c_3d_3;ϕ_a×ϕ_3,ϕ_b×ϕ̅_3^i,abcd;ϕ_aϕ_b(efg) = \n                W_ϕ_1,a_1b_1̅c_1d_1;ϕ_a×ϕ_1,ϕ_b×ϕ̅_1^i,abcd;ϕ_aϕ_b(efg) ×\n                W_ϕ_2,a_3b_3̅c_3d_3;ϕ_a×ϕ_3,ϕ_b×ϕ̅_3^i,a_1b_1̅c_1d_1,ϕ_a×ϕ_1,ϕ_b×ϕ̅_1(efg)\n\nfor i=1,…,4.  Thus if the set of condensing bosons is cyclic and generated by ϕ, we can express all basic string operators as products of the basic string operator W^i_ϕ.  \nSecond, \nlet P be a path obtained from a union of two basic paths, p_i(r_1,r_2), which begins on a stick at positions r_1, and ends on a stick at position r_2, and p_j(r_2,r_3), which begins on the stick at r_2 and ends on a stick at r_3 (see Fig. (<ref>)).   (Note that it is because w_ϕ(s) =1 that we can combine string end-points into a single string that crosses the sticks).  \nThen we have:\n\n    W_ϕ(P) =  W_ϕ^i, (12) W_ϕ^j,(23)\n\nand similarly for paths composed of more than two concatenated segments, as shown in the Figure.  Here we define W_ϕ^i, (12) = W^i_ϕ if p_i(r_1,r_2) is oriented upwards, and (W^i_ϕ)^† otherwise.  By joining string operators along multiple basic paths in this way, we can thus express W_ϕ(P) as a product of basic string operators for any path P.  (Note that since the basic string operators commute, the order in which we apply them is unimportant.)\nIt follows that any product of ϕ-string operators for ϕ in our chosen set of abelian bosons can be expressed as a product of basic string operators.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ LATTICE HAMILTONIANS FOR CONDENSING ABELIAN BOSONS\n \n\nNext, we identify a lattice Hamiltonian H(J) within the extended string-net Hilbert space that, by tuning a parameter J, can bring a system through a transition in which a set of abelian bosons is condensed.  \nOur lattice Hamiltonian has the general form\n\n    H(J)= H_𝒞 - J H_1  .\n\nHere H_𝒞 is a Hamiltonian in the extended string-net Hilbert space whose ground state is exactly the original string-net ground state; it can be viewed as a modification of the original string-net Hamiltonian (see Refs. <cit.>) appropriate to the extended string-net Hilbert space.  H_1 is a term which creates particle- antiparticle pairs of anyons in the set {ϕ} of condensing bosons.  Here, for simplicity, we take this set to be a cyclic group of order p, which we denote ϕ = {ϕ^i, i = 1, ... , p}. with ϕ^p = 1.  \n\n\nWe will show that H(J) has the following properties.  First,  H(J=0) is identical to the original string-net Hamiltonian when acting on states where all stick labels are trivial, and states with sticks carrying non-trivial labels ϕ^i have a finite energy cost.  Thus in this limit\n string-net eigenstates with sticks carrying non-trivial labels ϕ^i correspond to gapped excited states, and the ground state is the original string-net ground state |Φ⟩.\nSecond,  H(J = ∞) is a commuting projector model with a frustration-free ground state |Ψ⟩, in which excitations in the set ϕ have condensed, in the sense that they are present in arbitrary number in the ground state.  Third, |Ψ⟩ can be obtained by applying a certain projector to the J=0 ground-state | Φ⟩.  Thus we can describe the J= ∞ ground state explicitly in terms of the string types and local rules associated with |Φ⟩, and use this description to investigate the topological data of the condensed phase.\n\nIt is worth noting that, as we show below, the ground state of H(J) for any J contains only excitations on the sticks, and no plaquette defects.  Thus for ϕ^p = 1, the critical point separating condensed and uncondensed phases is always of the Potts or clock variety, depending on the specific choice of H_1.  Here we have chosen a Potts- like version, resulting in first order transitions for p ≥ 3.  \n\n\n\n\n\n §.§ The Hamiltonian H_𝒞 \n\n\n\n\nWe first define the Hamiltonian H_𝒞 in the extended string-net Hilbert space ℋ_ϕ of the honeycomb lattice (see Fig. <ref>).  \nH_𝒞 is of the form \n\n    H_𝒞=-∑_e Q_e -∑_p B_p^ϕ\n\nThe two sums run over end spins e and plaquettes p of the decorated honeycomb lattice.\nThe operator Q_e acts on the end spins\n\n    Q_e=δ_e,1\n\nwhere δ_e,1=1 if e=1 (no excitation) and δ_e,1=0 otherwise (ϕ excitations).\nThe operator Q_e penalizes the states with ϕ excitations at ends of sticks.  Note that unlike in the usual string-net Hamiltonian, we have not included a term imposing the branching rules at each vertex; instead, we will work exclusively in the string-net Hilbert space, where these are necessarily satisfied.  \n\n\nThe operator B_p^ϕ on the decorated honeycomb lattice is more complicated, but the main idea is as follows.  First, [B_p^ϕ, B_p'^ϕ] = [B_p^ϕ,Q_e] =0, ensuring that H_𝒞 is a sum of commuting projectors.  Second, analogous to the plaquette term in the usual string-net models<cit.>,B_p^ϕ maps between different string-net configurations in the extended string-net Hilbert space, ensuring that the ground states (for which all stick labels are trivial) obey the local rules (<ref>).   Indeed, when acting on states where all stick labels are trivial, our plaquette term is identical to that of the generalized string net models <cit.>. Third, unlike the plaquette term of the usual string-net models, B_p^ϕ commutes with the string operators W_ϕ^k(P) even for paths P ending or beginning on the plaquette p.   \n\nWe note that here we use a prescription that ensures that B_p^ϕ commutes with W_ϕ(P) for any choice ϕ = (s,m); this allows us to discuss all abelian anyon condensation transitions on the same footing.  For some classes of models, however (those for which the fusion category describing the string types is braided), an alternative and potentially computationally simpler formulation of the Hamiltonian resulting in the same condensed phase exists; this is discussed in Appendix <ref>.  \n\nWe now describe the operator B_p^ϕ in detail.  B_p^ϕ has the form:\n\n    B_p^ϕ=∑_s=0^N-1d_s/DB_p^ϕ,s\n\nwhere D=∑_s=0^N-1d_s^2 and B_p^ϕ,s describes a 27 spin interaction involving the 24 link spins around p and 3 end spins inside p (see Fig. <ref>). \nIts action can be understood as a sequence of three operations:\n\n    B_p^ϕ,s=∑_ϕ_10,ϕ_11,ϕ_12 W^†_ϕ_10,ϕ_11,ϕ_12 B_p^s W_ϕ_10,ϕ_11,ϕ_12\n\nwhere the sums run over the possible spin labels of the three sticks inside p, with\n\n    W_ϕ_10,ϕ_11,ϕ_12=\n    \t  (W_ϕ_10^1)^†𝒫_ϕ_10·\n    \tW_ϕ_11^1 𝒫_ϕ_11·\n    \t W_ϕ_12^3 𝒫_ϕ_12\n\nHere 𝒫_ϕ_a=|ϕ_aϕ_a| projects the end spin label of stick a onto ϕ_a, and  (W_ϕ_10^1)^†,W_ϕ_11^1,W_ϕ_12^3 are basic string operators (see Eq.  (<ref>)) that lower the spin label on sticks 10, 11, and 12 by ϕ_10, ϕ_11, and ϕ_12 respectively.  \nThe operator W_ϕ_10,ϕ_11,ϕ_12 therefore moves any excitations on the sticks \ninside the plaquette p to sticks outside of p:\n\n    <-0.32in\n        < g r a p h i c s >\n    |\n    \tW_ϕ_10,ϕ_11,ϕ_12=C_1 ·<-0.32in\n        < g r a p h i c s >\n    |.\n \nThis action is nontrivial only if {ϕ_10,ϕ_11,ϕ_12} contains non-trivial end spin labels.  In particular, it is trivial when acting on  ground states of H_𝒞.  \n\nThe second operation B_p^s is the same as the plaquette operator defined in the Ref. LevinWenstrnet which adds a loop of type-s string around the boundary of p:\n\n    <-0.32in\n        < g r a p h i c s >\n    \n    \t|B_p^s   =\n    \t<-0.32in\n        < g r a p h i c s >\n    | \n       =∑_i_1'… i_6' C_2  ·<-0.32in\n        < g r a p h i c s >\n    |.\n\nFinally, the operation W^†_ϕ_10,ϕ_11,ϕ_12 moves the excitations {ϕ^10,ϕ^11,ϕ^12} back to the appropriate sticks in p:\n\n    <-0.32in\n        < g r a p h i c s >\n    \n    \t|W_ϕ_10,ϕ_11,ϕ_12^†=C_3  ·<-0.32in\n        < g r a p h i c s >\n    |.\n\nHere C_1,C_2,C_3 are the corresponding matrix elements of the three operations. The product C_1 · C_2 · C_3 gives the matrix elements of B_p^ϕ,s.\n\n\n\nMore precisely, the matrix elements of B_p^ϕ,s are defined by\n\n    <-0.32in\n        < g r a p h i c s >\n    | B_p^ϕ,s\n       =∑_i'_1…'_6-0.32in\n        < g r a p h i c s >\n    |\n    \tB^s,i_1… i_6j_1… j_6_p,i'_1… i'_6j'_1… j'_6(e_1… e_12;ϕ_10,ϕ_11,ϕ_12)\n\nwhere \n\n    B^s,i_1… i_6j_1… j_6_p,i'_1… i'_6j'_1… j'_6(e_1… e_12;ϕ_10,ϕ_11,ϕ_12)=\n       d_s√(d_i_1d_j'_2d_i_3d_i_4d_j'_5d_j_6/d_i'_1d_j_2d_i'_3d_i'_4d_j_5d_j'_6)×\n       (F^s̅i_1 e_7_j'_1i'_1j_1)^*\n    \t\t(F^s̅j_1e_2_i'_2j'_1i_2)^*\n    \t\t(F^s̅i_2e_8_j'_2i'_2j_2)^*\n    \t\tF^s̅i_3e_3_j'_2i'_3j_2\n    \t\t(F^s̅i_3e_9_j'_3i'_3j_3)^* \n    \t\t(F^e_5i_4s_j'_5j_5i'_4)^* ×\n       F^e'_6j_6s_j'_5j_5j'_6 \n    \t\tF^j_6ss̅_j_6j'_60\n    \t\t(F^i_4ss̅_i_4i'_40)^*\n    \t\t(F^i'_6s̅i_1_e'_1j_6i'_1)^*\n    \t\tF^i'_4s̅j_3_e'_4i_4j'_3×\n       W^1,e_10e_13 j_4e_4;ϕ_10ϕ_13_ϕ̅_10,0e_13' i_4e_4';1ϕ_13'(i_4j_3f_4)\n    \t\tW_ϕ_10,e_10e_13 j'_4e_4;ϕ_10ϕ_13^1 ,0e_13'i'_4e_4';1ϕ_13'(i'_4j'_3f_4) \n    \t\t ×\n       W^1,e_14 e_11e_6i_5;ϕ_14ϕ_11_ϕ_11,e'_140e_6'j_5;ϕ_14'1(f_6j_6j_5)\n    \t\t W_ϕ̅_11,e_14 e_11e_6i'_5;ϕ_14ϕ_11^1 ,e_14'0e_6'j'_5;ϕ_14' 1(f_6j'_6j'_5) ×\n       W^3,e_15 e_12e_1i_6;ϕ_15ϕ_12_ϕ_12,e_15'0e_1' j_6;ϕ_15'1(f_1i_1j_6)\n    \t\t W_ϕ̅_12,e_15 e_12e_1i'_6;ϕ_15ϕ_12^3 ,e_15'0e_1'j'_6;ϕ_15'1(f_1i'_1j'_6)\n\nHere e_7,e_8… e_12 take values in abelian string types and thus j_p=i_p× e_p+6 for p=1…6 while e_1'=e_1× e_12,e_4'=e_4×e̅_10 and e'_6=e_6× e_11.\nThe matrix elements of W^1_ϕ,W^3_ϕ,W_ϕ^1†,W_ϕ ^3 † are defined in (<ref>) and (<ref>).  \n\n\nFrom this explicit form, one can check that the plaquette operator B_p^ϕ,s commutes with any basic string operator W_ϕ^i^j (and hence any string operator W_ϕ^i(P)): \n\n    [B_p^ϕ,s,W_ϕ^i^j]=0.\n\nWe leave the derivation to Appendix <ref>. \n\n We can now show that \nH_𝒞 (<ref>) has the following properties.  First, it is a sum of commuting projectors:\nclearly [Q_e, Q_e'] = [Q_e, B_p^ϕ] = 0, since B_p^ϕ does not alter the value of the spin-label on any stick, and hence preserves the eigenvalue of Q_e.  \nMoreover, in Appendix <ref> we show that [B_p^ϕ, B_p'^ϕ ] =0.  Essentially, this results from the fact that the two plaquette operators commute in the absence of excitations on the sticks, and also that the string operator used to move a stick excitation off the shared edge between two adjacent plaquettes commutes with B^ϕ_p, where p is the plaquette that the stick points outward from.  \n\nIt follows that, like the conventional string-net Hamiltonians, H_𝒞 is exactly solvable. \nSecond, there exists at least one state that satisfies Q_e=B_p^ϕ=1 for all e,p; this state is therefore a ground state.  Clearly, states with only trivial stick labels satisfy Q_e = 1 at every vertex; when restricted to theese states, H_𝒞 reduces to the original string-net model, whose ground state |Φ is an eigenstate of the plaquette term of the corresponding Hamiltonian with eigenvalue 1 on every plaquette<cit.>.   When Q_e ≡ 1, |Φ⟩ is therefore also an eigenstate satisfying B_p^ϕ≡ 1.  In other words, H_𝒞  is exactly solvable, and its ground state(s) are exactly the string-net ground states defined by the local rules (<ref>).  \n\nThough they have the same ground state(s), the excited states of our extended string-net model differ from those of conventional string-net Hamiltonians.   \nIn conventional string nets, where sticks are not included, \nexcited eigenstates are either string-net states with B_p^ϕ=0 on some plaquettes, or states that  violate the branching rules and hence are outside of the string-net Hilbert space (for which necessarily we also have B_p^ϕ=0 on some plaquettes). \nIn our models, however, there are ϕ^j-type excitations of  H_𝒞 satisfying B_p^ϕ=1 everywhere, with Q_e = 0 on some sticks.[We note that if we allow states outside of the string net Hilbert space, this leads to a redundancy,  since in our extended Hilbert space ϕ can also be realized by an eigenstate with Q_e ≡  1, with either some B_p^ϕ=0  or a violation of the branching rules.]\n  As a consequence, the ground state of H(J) satisfies B_p^ϕ≡ 1 for every positive J.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ The Hamiltonian H_1\n\n\n\n \nTo define H_1, we begin by defining the projector along the path p_i,i=1,2,3,4:\n\n    P_ϕ^i( r) =1/p∑_k=1^pW_ϕ^k^i ( r)\n\nwhere the sum runs over basic open string operators W_ϕ^k^i with ϕ^k ∈ϕ, and r indexes a unit cell of the honeycomb lattice.\nThe set of operators {P_ϕ^i} form commuting projectors.\nThe operator H_1 is defined as a sum of commuting projectors over all neighboring sticks\n\n    H_1=∑_i,  rP_ϕ^i ( r)\n \nBy (<ref>), we have [H_1, B_P^ϕ] =0. Thus, H_1 creates excitations only of Q_e in H_𝒞, while leaving the operator B_P^ϕ in its ground state on every plaquette.  \n\n\n \n\n\n §.§ Condensed phase and the J →∞ limit\n\n\n\nFor J sufficiently large, the string net describes a new topological phase, in which the anyons {ϕ^j, 1 ≤ j < q } have condensed.   \nThat this is so can be most easily understood by considering the limit J →∞. \n\nSince H_1 is a sum of commuting projectors, in the J→∞ limit, the low-energy Hilbert space ℋ̃ consists of states in the image of the projector:\n\n    P_ϕ=∏_i,  rP_ϕ^i ( r)  .\n\nThese states have eigenvalue 1 under all terms in H_1.  \n\nTo leading order in 1/J, the effective Hamiltonian, which acts within the low energy Hilbert space ℋ̃, is \n\n    H_𝒞̃=P_ϕ H_𝒞 P_ϕ=-∑_p P_ϕ B_p^ϕ+ const .\n\nIn the second equality, we use (<ref>) and the fact that H_ϕ≡∑_e P_ϕ Q_e P_ϕ is simply the number of ways to combine operators in P_ϕ to obtain a trivial label on every vertex, which is a system size independent constant.\nNote that since P_ϕ and B_p^ϕ are projectors, and [P_ϕ, B_p^ϕ ]=[B_p^ϕ , B_p'^ϕ ]=0, P_ϕ B_p^ϕ are also commuting projectors. \nMoreover, if |Φ is the ground state of H_𝒞, we have P_ϕ B_p^ϕ (P_ϕ |Φ ) =P_ϕ |Φ for every p.  Hence\nthe ground state |Ψ of H_D is given by[In fact, projecting any state |Φ_ex satisfying B_p^ϕ|Φ_ex =|Φ_ex in this way gives the ground state |Ψ of H_D.  This is because such states have the form |Φ_ex=W_ϕ(P)|Φ, and as P_ϕ W_ϕ(P)=P_ϕ, we have P_ϕ|Φ_ex=P_ϕ W_ϕ(P)|Φ=P_ϕ |Φ. ] \n\n    |Ψ=P_ϕ |Φ.\n\n\nTo show that |Ψ is indeed a state in which the bosons ϕ have condensed, we expand the projector \nP_ϕ according to:\n\n    P_ϕ=1/p^2 N_V∑_{ϕ_j, r_ij}W_{ϕ_j, r_ij}\n\nHere N_V is the number of vertices on our honeycomb lattice; for each such vertex there are two  simple string operators.  (Note that throughout this paper, we will assume boundary conditions where this is the case).  W_{ϕ_j, r_ij} is the composite string operator which creates excitations {ϕ_j} using string operators along the paths { r_ij} on the lattice, and the sum runs over all possible configurations  {ϕ_j, r_ij} on  the lattice, subject to the constraint that ∏_j ϕ_j = 1. \nWe can use (<ref>) to expand the new ground state (<ref>) as\n\n    |Ψ =1/p^2 N_V∑_{ϕ_j, r_ij} W_{ϕ_j, r_ij} |Φ .\n\nIn other words, the ground state |Ψ is a superposition of all possible configurations of ϕ excitations – a ϕ condensed state. \n\n\n\nWe can also make some educated guesses about  the topological order in the condensed phase by studying the effect of P_ϕ on low-lying excited states of H_𝒞.  These are created by generalized versions of the string operators W_ϕ(P), which we deonte W_α(P), where P describes a path on the lattice, and α is the anyon type.  The data associated with W_α(P) is essentially the same as that for W_ϕ(P), except that resolving string crossings requires a matrix Ω_α(a), rather than a scalar w_ϕ(a); a detailed description can be found in Ref. <cit.>.  Unless α = ϕ^j, here we require that P starts and ends at vertices of the lattice, rather than on sticks.  \n\n\nConsider how the operators P_ϕ^i ( r) act on the string operators W_α(P).   \nThe latter can suffer one of three possible fates.  First, if \n\n    W_ϕ(P)  W_α(P) = W_α'(P)\n\nthen the  operators W_α(P), W_α'(P) have identical actions on states in the image of P_ϕ.  This suggests that in the limit J →∞, the two anyons α and α' have been identified, meaning that they comprise a single anyon type in the condensed phase. For example, all of the condensing bosons {ϕ^k } are identified with the vacuum in the condensed phase.\nThis conclusion agrees with the expectations of other approaches to anyon condensation<cit.>.  \n\nNote that if\n\n    W_ϕ^r(P)  W_α(P) = W_α(P)\n\nfor r| p, then in the condensed phase W_α(P) becomes identified with r-1 distinct anyon string operators, rather than with q-1.  For example, if r=1,  W_α(P) does not become identified with any other anyon string operators.  Though this statement seems rather innocuous here, in fact in such cases α splits into multiple anyon types after condensation<cit.>.  We will not discuss the splitting at the level of anyons in detail here; however it is closely related to the splitting of string net labels which, as we show in Section <ref>, arises in the ground states of our condensed string net model.  \n\n\nSecond, if α braids non-trivially with one of the condensing bosons ϕ, then when the path P_1 crosses P_2, and ϕ is an abelian boson,<cit.>\n\n    W_ϕ̅(P_1) W_α(P_2) W_ϕ(P_1) =  S_αϕ/S_α1 W_α(P_2)   W_ϕ(P_1)\n\nIn this case, the string operator W_α(P)  maps states in the image of P_ϕ (for which W_ϕ(P_1) |Ψ⟩ = |Ψ⟩ for every choice of P_1) to states outside of this image.   This suggests that α anyons are no longer a point-like excitations in the condensed phase, and become confined, again agreeing with expectations based on other approaches to anyon condensation.  \n\n\n\nIn the following sections, rather than pursue the analysis of anyon string operators, we will instead focus on the fate of the string net ground state in the condensed phase. We will show how to describe the ground state of H_𝒞(J →∞)  \nas a conventional string net of the type described in Ref. <cit.>.  Such string net ground states can always be associated with a commuting projector string net Hamiltonian<cit.>, whose topological order can be inferred directly from the string net data.  (Specifically, it is the Drinfeld center of the fusion category comprising the string net).  Thus this approach allows us to identify the topological order of the condensed phase without requiring an explicit discussion of anyon string operators in the condensed phase.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ THE CONDENSED HILBERT SPACE\n  \n\n\nIn order to understand the condensed phase, \nwe begin by studying the effective Hilbert space\n\n    ℋ̃ = span{X̃|:X̃|P_ϕ = X̃|}.\n\nthat describes states of finite energy in the limit J →∞, which we refer to as the condensed Hilbert space. Our goal is to show that ℋ̃ can be thought of as a new (non-extended) string-net Hilbert space,  whose basis states are string-net states with new string labels and new branching rules.  \n\n\n\n\nTo construct a basis state X̃| in the effective Hilbert space defined by Eq. (<ref>), we begin with a reference state X| in the uncondensed string-net Hilbert space ℋ.  The corresponding  basis state in ℋ̃ is: \n\n    X̃|=X|P_ϕ\n\nSince W^i_ϕ^k ( r ) P_ϕ^i( r ) =  P_ϕ^i( r ) for every i and r, we have\n\n    W_{ϕ_j, r_ij}  P_ϕ = P_ϕ W_{ϕ_j, r_ij}  =P_ϕ .\n\nConsequently, if X' | =  X | W_{ϕ_j, r_ij}, then X|P_ϕ = X'|P_ϕ.  Thus, to construct a basis \n of ℋ̃, we must find a suitable basis {X_0|} of ℋ such that X^i_0| W_{ϕ_j, r_ij} | X_0^j⟩ = δ_ij. \n Since we are interested in identifying a set of string-net labels appropriate to the condensed phase, we take {X_0| } to be states in the string-label basis – i.e., X_0^j | has a fixed string label for every edge. \n\n\nTo find the new string-label basis {X̃|}, we consider two classes of condensing bosons. The first class is ϕ = (0,m) – i.e. the string operator W_ϕ(P) does not change the string labels of edges that it acts on.  This type of condensation, which does not require the extended Hilbert space, has been discussed in detail in Ref. <cit.>. The second class, with ϕ = (s,m), condenses bosons whose string operators do change the string net labels.  These condensation transitions do require the extended Hilbert space that we introduce here.  \n\nWe start with the first case, ϕ=(0,m). For any edge in the lattice, P_ϕ contains an equal contribution from ϕ^j-labeled strings that cross that edge, for every j (see Fig. <ref>).  Thus,\n\n    <-0.22in\n        < g r a p h i c s >\n    | P_ϕ= \n    \t<-0.22in\n        < g r a p h i c s >\n    |  1/p∑_i=1^p w_ϕ^i(a) =\n    \t<-0.22in\n        < g r a p h i c s >\n    |  δ_w_ϕ(a),1\n\nwhere p is the order of ϕ.\nThus, only string types a with \n\n    w_ϕ(a)=1\n\nremain after condensation of ϕ=(0,m) bosons. \nHence, the new string-label basis {X̃|} is simply the subset of states in X_0 | containing only string types a satisfying Eq. (<ref>).  We say that the remaining string labels, which do not appear in the low-energy Hilbert space after condensation, are confined.\n\n\nNow, we consider the second case, ϕ=(s,m). If ϕ contains a subgroup ϕ_m^j⊂ϕ which is generated by ϕ_m^j =(0,m^j), then by the same reasoning as above, the string types a that appear in the condensed Hilbert space must satisfy \n\n    w_ϕ_m^j(a)=1,\n\nwith other string types being confined.  \nWe find it useful to reorganize the deconfined string types into new string labels as follows. \nFirst, we define the new null string label via:\n\n    0̃= ⊕_j=0^q-1 s^j  .\n\nwhere we have assumed the condensing bosons form a cyclic group generated by ϕ = (s,m), with s^q= 1 and q|p.  Here the symbol ⊕ means that, in the original string net basis, an edge carrying the label 0̃ carries a superposition of labels in the set {s^j }.  \nSimilarly, other  condensed string types are given by superpositions of the form:\n\n    ã=⊕_j=0^q-1 (a × s^j ).\n\nIt is convenient to pick a particular representative for ã in the original label set, which we will denote a.  We denote the remaining terms on the right-hand side of Eq. (<ref>) as:\n\n    a^j  ≡  a × s^j   ,   a^0 ≡ a\n\nThen all a^j project to the same condensed string type, while if b ≠ a × s^j, then a and b project to different string types.  As we discuss in detail below, if one or more of the labels obey a^r = a for some r |q, in the condensed phase the single string type a splits into multiple string types ã_1, ... ã_q/r.  \nFinally, \nthe branching rules for the new string labels can be deduced from the branching rules of the original string labels.   In the absence of splitting, given the branching rules (a,b;c), the new branching rules are (ã,b̃;c̃).  We discuss the new branching rules in the presence of splitting in Sec. <ref>.\n\n\n\n\nThe condensed string labels, together with the associated branching rules, define the string-label basis in the condensed Hilbert space.\nSpecifically, a string-net state X̃ | ∈ℋ̃ has edges labeled with the condensed string types {0̃, ã, b̃, ... }, and satisfies the new branching rules (ã,b̃;c̃) at each vertex.  Note that ℋ̃ should be viewed as a conventional string-net Hilbert space, since after condensation all sticks are effectively in the trivial vacuum state.\n\n\n\n\n\n\n §.§ Mapping between new and old string net labels\n\n\nSince X̃| =  X | P_ϕ, any state in ℋ̃ can also be expressed as a superposition of string-net states in our original Hilbert space ℋ_ϕ.  This superposition contains states in which each edge label is replaced by an appropriate superposition of original string net labels, with the branching rules obeyed at every trivalent vertex, and arbitrary allowed labels on the sticks.  Notationally, we represent the resulting string-net configurations in the original label set by X∈X̃, where X represents a labeling of edges in the original string-net basis, and X̃ represents the corresponding labels in the condensed basis.  \nExplicitly, we may write\n\n    X̃|= 1/p^2 N_V∑_X∈X̃ C(X)X|\n\nwhere \nC(X) are numerical coefficients. \n\nThe coefficients C(X) are highly constrained.  \nFor any X_1,X_2∈X̃, X_1| is related to X_2| by the action of some composite string operator W({ϕ_j, r_ij}):\n\n    X_1|W({ϕ_j, r_ij})=W({ϕ_j, r_ij})_X_2^X_1 X_2 |\n\nwhere W({ϕ_j, r_ij})_X_2^X_1 is the relevant matrix element of W({ϕ_j, r_ij}), and for a fixed configuration ϕ_j, r_ij the state X_2 is unique as the condensing anyons are abelian.  Since the composite string operator is unitary, we equivalently have \nW({ϕ_j, r_ij})|X_2  = W({ϕ_j, r_ij})_X_2^X_1|X_1.  \nTherefore, the coefficients satisfy:\n\n    C(X_2)   =X̃ | X_2  = X̃ |W({ϕ_j, r_ij})| X_2 \n       = W({ϕ_j, r_ij})_X_2^X_1X̃ | X_1 \n        =W({ϕ_j, r_ij})_X_2^X_1 C(X_1)   .\n  \n where in the first line, we have used Eq. (<ref>).  Eq. (<ref>) allows us to determine the coefficients C(X), up to an  overall coefficient C(X_0) for each distinct reference configurations {X_0}.   \n\n\n\n\n\n\n\n §.§ Vertex coefficients\n \n\nSolutions { C(X) } to Eq. (<ref>) can be expressed C(X) = ∏_v C_v(X), where the product runs over all trivalent vertices in the extended string-net cofiguration X, and C_v(X) is a coefficient that depends only on the three string labels surrounding the vertex v.  \nThis is because the action of any string operator can be broken up into a product of actions of simple string operators, with  each simple string operator acting at a single honeycomb vertex and the vertices associated with nearby sticks.  \nThus for each simple string operator, Eq. (<ref>) can be reduced to a set of equations relating products of at most three of the vertex coefficients C_v(X) to at most three of the vertex coefficients C_v(X').   We will show that the resulting equations are self-consistent, and sufficient to fully determine the coefficients of any configuration X ∈X̃ from that of a reference configuration X_0.  \n\nTo parametrize the vertex coefficients C_v(X), we  define a set of root vertices, which contain one representative vertex (a,b; c) in the original string label set for each condensed vertex (ã, b̃; c̃).  \nThen any condensed string net state X̃ | can be obtained by projecting a reference string-net state X_0| for which all vertices are root vertices.   Conversely, any two states that differ by at least one root vertex project to two distinct states in ℋ̃. \nWe then define two types of vertex coefficients: {A^ab_c }  associated with the root vertices (a,b; c), and {B^a^jb^k_c^j+k}, associated with the remaining vertices (a^j, b^k; c^j+k), where a^j ≡ a × s^j.  The coefficients { B^a^jb^k_c^j+k} can be expressed in terms of {A^ab_c } using Eq. (<ref>).     On the other hand,  {A^ab_c }, which are associated with the vertex coefficients of our reference configuration, are not fully determined, and in some cases admit multiple, physically distinct solutions.   \n\nWe begin by defining the root vertices. Again, we have two cases to consider.\nThe first case is the ϕ=(0,m) condensed phases. In this case, we define the root vertices by\n\n    -0.22in\n        < g r a p h i c s >\n    ,  -0.22in\n        < g r a p h i c s >\n\nwhere a,b,c are the deconfined string types which satisfy (<ref>), and (a,b;c) satisfies the branching rules.  In this case all vertices are root vertices.\n\n\nThe second case is the ϕ=(s,m) condensed phase. In this case, for each new string label ã, we choose a representative label a ∈ã.  We define two classes of root vertices.  First, we have the root vertices:\n\n    -0.22in\n        < g r a p h i c s >\n    ,  -0.22in\n        < g r a p h i c s >\n    ,\n\nwhere s^i denotes the string type associated with the boson ϕ^j q + i, and 0 ≤ i < q.  (Here, as above, we take ϕ = (s,m), with ϕ^p = 1 and s^q = 0, where q|p.)  In this case, for reasons that will become apparent shortly, it is convenient to consider all different powers i to be root vertices, in spite of the fact that all of these correspond to the same projected label 0̃.  \nSecond, we have root vertices with two non-null string types in the two upper (lower) legs of upward (downward) vertices:\n\n    -0.22in\n        < g r a p h i c s >\n    ,  -0.22in\n        < g r a p h i c s >\n     with a,b ∉0̃ ,\n\nwhere (a,b;c) satisfies the original branching rules.\n\nThe vertex coefficients associated with root vertices for general ϕ=(s,m) are defined by:\n\n    C(-0.22in\n        < g r a p h i c s >\n    )∼ A^as^i, \n    \t   \t\n    \tC(-0.22in\n        < g r a p h i c s >\n    )∼1/A^as^i\n\nand \n\n    C(-0.22in\n        < g r a p h i c s >\n    )∼ A^ab_c, \n    \tC(-0.22in\n        < g r a p h i c s >\n    )∼1/A^ab_c with a,b∉0̃.\n\nfor root vertices (<ref>) and (<ref>) respectively.\nHere ∼ means equality up to factors associated with other vertices in the grey area. The vertex coefficients A^ab_c,A^as^i are complex numbers which satisfy that\n\n    A^ab_c=A^a s^i=1  if a  or b=0.\n\nIn the absence of splitting, these are not constrained, and can be any complex number of unit modulus; in particular, we may choose them all to be 1.  \n\n\nThe ϕ=(0,m) condensed phases can be thought of special cases of the ϕ=(s,m) condensed phases where s=0 and thus 0̃={0}. In this case, the vertex coefficients (<ref>) associated with root vertices (<ref>) correspond to a gauge choice for our string net model<cit.>. \n\nWhen s ≠ 0, to find the coefficients C(X) in Eq. (<ref>), we define a set of vertex coefficients associated with non-root vertices via:\n\n    C(-0.22in\n        < g r a p h i c s >\n    )∼ B^s^ia, \n    \t   \n    \tC(-0.22in\n        < g r a p h i c s >\n    )∼1/B^s^ia\n\nand \n\n    C(-0.22in\n        < g r a p h i c s >\n    )∼ B^a^jb^k_c^i+j,   \n    \tC(-0.22in\n        < g r a p h i c s >\n    )∼1/B^a^jb^k_c^i+j.\n\nwhere B^a^jb^k_c^i+j are complex numbers, and at least one of (k,j) are non-zero, such that at least one of a^j, b^k are not in our chosen set of reference labels.  \n\n\nThe division into A-type and B-type vertex coefficients is useful since the latter are fully determined by the root vertex coefficients A^ab_c,A^a s^i using Eq. (<ref>).\nThe coefficients A^ab_c and A^a s^i, on the other hand, are not fixed by Eq. (<ref>) provided that a × s^r ≠ a for any r< q.  \nIn this case, coefficients C(X) in (<ref>) can be parametrized as \n\n    C(X) =C(X_0) ∏_v∈ X B_v\n\nwhere the product runs over all vertices v in X and B_v is the corresponding vertex coefficient.  \n\nThe coefficient C(X_0) associated with the given reference configuration X_0 is determined by the root vertex coefficients via:\n\n    C(X_0) = ∏_v∈ X_0 A_v\n\nwhere v runs over all root vertices in X_0 and A_v is the corresponding root vertex coefficient.   When a × s^r ≠ a for any r< q we will find that all choices of root vertex coefficients are equivalent, and the freedom to choose C(X_0) amounts to a gauge choice.\n\n\n\nIf a^r = a for some r | q, the parametrization of C(X) is similar.  However, in this case Eq. (<ref>) imposes additional constraints on the root vertex coefficients A^a s^k.  In this case we find that only A^a s^k for k ≤ r are free parameters, and that there are q/r distinct solutions for each of these coefficients.  These distinct solutions correspond to the fact<cit.> that after condensation the label a splits into q/r distinct labels; correspondingly we also obtain multiple vertex coefficients A^a b_c.\nWe now discuss each of these cases in turn.\n\n\n\n\n\n\n\n\n\n\n\n\n  §.§.§ Case 1: a^k ≠ a\n\n\n\nFirst, let us verify that a solution to Eq. (<ref>) can be expressed as a product of vertex coefficients – i.e. that any mapping between two configurations with the same sets of initial and final vertices has the same numerical coefficient.  If a^k ≠ a for any a or k, then it suffices to consider sequences of simple string operators connecting the same inital and final vertex configurations.  The properties of basic string operators outlined in Eqs. (<ref>) - (<ref>), as well as the consistency conditions (<ref>) and (<ref>), ensure that all combinations of basic string operators relating a given initial and final set of vertices will have the same numerical coefficient.  \n\nSecond, we use Eq. (<ref>) to solve for the B-type vertex coefficients in terms of { A^a s^i, A^ab_c }.  \nFirst, consider vertices where both a and b legs are powers of the condensing label s.  In this case, in the gauge  (<ref>), and using w_ϕ(s^j) = 1, all non-vanishing string operator matrix elements are simply +1, and we have\n\n    A^0 s^j A^0 s^-jB^s^js^-j= A^00 = 1 \n       B^s^i s^j A^0 s^i A^0 s^j B^s^i+j s^-i-j = A^00 = 1  .\n\nIt follows that, given the condition (<ref>), \n\n    B^s^i s^j  = 1\n\nfor any i,j.  \n\nNext suppose a ∉0̃, with b=s^i, and a^j ≠ a.   In this case, we have\n\n    A^a s^k B^a^k, s^l-k B^s^l,s^-k = A^a s^l  (F^as^k s^l-k_a^l a^k s^l  )^*\n\nwhere the coefficient is obtained by acting on the vertex (a, s^l; a^l) with the product W^1_ϕ^k W^2_ϕ^-k.  \nGiven Eq. (<ref>), this fixes B^a^k, s^l-k in terms of A^a s^l and A^a s^k.\n\nIf a,b ≠ s^k, we have \n\n    A^a s^j A^b s^k B^a^j, b^k_c^j+k B^c^j+ks̅^j+k= W_jk (abc) A^ab_c  ,\n\n The matrix element is given by acting with the product W^2_ϕ^k W^1_ϕ^j on the vertex (a,b; c) (see Fig. <ref>):\n\n    W_jk (abc) =w̅_ϕ^j(b)  F^a b s^j_c^j c b^j (F^a s^j b_c^j a^j b^j)^* F^a^j b s^k_c^j+k c^j b^k (F^c s^j s̅^j_c c^j 0 F^c^j s^k s̅^j+k_c c^j+ks̅^j)^*\n\nGiven Eq. (<ref>), this fixes B^a^j, b^k_c^j+k in terms of A^ab_c and { A^a s^j}.\n\nFinally, using string paths of the form\n\n    -0.22in\n        < g r a p h i c s >\n\nwe have\n  \n\t\n    B^s^j a^i W_j̅ j (s^j, a^i, a^i+j)   = B^a^j s^i\n    \n    \tB^s^j a  W_j̅ j (s^j, a, a^j) \n    \t   = A^a s^i ,\n\n\nwhich shows that both B^s^i a and B^s^k a^j can be expressed in terms of A^a s^j-type vertex coefficients.  \nThese relations have a particularly simple form: From Eq. (<ref>), we can show that\n\n    W_j̅ j (s^j, a, a^j)\n    \t\t=    w_ϕ^j(a)\n\nwhere we have used  Eqs. (<ref>,<ref>), as well as the identity\n\n    F^a s^j s̅^j_a a^j 0 F^s^j s̅^j s^j_s^j 0 0 ( F^ a^j, s̅^j, s^j_a^j a 0)^* = 1\n\nwhich follows from Eq. (<ref>).  \n\nThis leaves us with the vertex coefficients A^ab_c and A^a s^j (where a, b ≠ s^k).  The former are clearly free parameters, since by definition there is no ϕ string operator that takes such a root vertex to another root vertex.  Indeed, they represent a choice of gauge for the F matrices describing the condensed phase (see Eq. (<ref>)), and can be set to 1.  \nTo see that A^a s^j are also free parameters, we note that there is a residual gauge freedom when solving (<ref>).   \nSpecifically, given a set of vertex coefficients that satisfy Eq. (<ref>),  \nwe can construct an infinite class of other solutions Ã^a b_c, B̃^a^j b^k_c^j+k via:\n\n    Ã^a b_c=A^a b_c ·g(a)g(b)/g(c) ,   B̃^a^j b^k_c^j+k=B^a^j b^k_c^j+k·g(a^j)g(b^k)/g(c^j+k) .\n\nHere a,b and c are any string labels (including s^j), and\n g(a) is any function with\n\n    g(s^i)g(s^j)=g(s^i+j),   g(0)=1.\n\nIt is straightforward to verify that the transformations (<ref>) do not alter the equalities dictated by the action of any of the basic string operators at a vertex.  \n\n\nWhen a^i≠ a^j for i≠ j (mod q), the gauge transformation (<ref>) fully fixes the coefficients A^a s^i: we can always choose the ratio g(a)/g(a^j) to set\n\n    A^a s^j = 1  .\n\nAccordingly, we have\n\n    B^s^j a = w_ϕ^j(a)  ,    B^a^j  s^i-j=  (F^as^js^i-j_a^ia^j s^i)^*\n\nby Eqs. (<ref>)  and  (<ref>).  \n\n\n\n\n\n\n  §.§.§ Case 2: a^r = a\n \n\nIf a^r=a for some r|q, \nthere are additional constraints relating the coefficients  A^a, s^nr, and we cannot set these to 1 using transformations of the form (<ref>).\n\nWe begin by considering configurations involving only vertices of the form (a, s^jr; a), j = 1,... q/r, and their cyclic permutations.  \nWe first show that for such configurations, there exists a solution to Eq. (<ref>) that can be expressed as a product of vertex coefficients.  To show this, we must establish that the coefficients relating configurations with the same sets of initial and final vertices do not depend on the relative positions of these vertices – an issue that did not crop up in case 1.  For example, using a W^1-type simple string acting on a vertex (a, s^j, a) with sticks on the two a legs carrying labels s^i and s^k, we can derive:\n\n    A^a s^(i+l) r A^a s^(k-l) r  =   A^a s^i r A^a s^k r  F^ a s^j r s^ l r_a a s^(j+l)r (F^ a s^ l r s^j r_a a s^(j+l)r )^* \n       × \n        F^a s^i r s^l r_a a s^(i+l) r F^ s^lrs̅^lr s^k r_s^kr 0 s^(k-l)r ( F^ a s^lr s^(k-l)r _a a s^kr )^*\n\nwhere we have removed a common factor of A^a s^j r (which is non-zero) from both sides, and used w_ϕ^j(s^k) =1 for all j,k.     \nThis can be true only if the coefficient does not depend on j.\nSimilar consistency requirements arise from acting with W^2_ϕ^lr on a vertex (s^jr, a; a) and with W^2_ϕ̅^lrW^1_ϕ^lr on a vertex (a, a̅; s^jr).  \n In Appendix <ref>, using the conditions (<ref>, <ref>), we show that in all three cases, in the gauge (<ref>), the coefficients are indeed independent of j.   (A similar result holds for vertices of the form (a, s^i + j r; a^i) with i<r, for which the coefficient is also indepedent of j).  \nThus we see that, for configurations with only vertices involving a^j, a̅^k (j,k < r), and powers of s^ i, the simple string operators at each vertex yield a consistent set of equations for the A^a s^j.  \n\n\nHaving established that a consistent solution exists, let us solve for the coefficients A^a s^nr.  (As above, the coefficients A^a s^i for i < r can be consistently set to 1 by a gauge transformation).   Taking k=l=1 in Eq. (<ref>),\n we find:\n\n    A^a s^(i+1) r  = A^a s^i  r A^a s^ r  F^a s^i r s^ r_a a s^(i+1) r   F^ s^rs̅^r s^ r_s^kr 00 F^a s^j r s^r_ a a s^(j+1)r  (F^ a s^r s^jr_a a s^(j+1)r )^*\n\nAs shown in Eq. (<ref>), in fact \n\n    F^a s^j r s^lr_ a a s^(j+l)r = F^ a s^lr s^jr_a a s^(j+l)r\n \nIt follows that in our gauge of choice,\n\n    A^a s^n  r   = (A^a s^ r )^n ∏_k=1^n-1 ( F^a s^k r s^ r_a a s^(k+1) r )\n\nThus of the q/r vertex coefficients A^a s^n r, we can freely choose only one, which we take to be A^a, s^r.  \n\nMoreover, the coefficient A^a s^ r is not unconstrained: taking n = q/r in Eq. (<ref>), and noting that s^(q/r) r = 0, we see that \n\n    (A^a s^ r )^q/r  = ∏_k=1^q/r-1 ( F^a s^k r s^ r_a a s^(k+1) r )^*\n\nThus, we see that A^a s^ r must be a q/r^th root of the product on the right-hand side, and we have exactly q/r possible choices for this coefficient, which we label (A^a s^ r)_i, i = 1, ... q/r.  \nWe note that the product on the right-hand side (and hence also (A^a s^ r)_i) has modulus 1, since by unitarity ( F^a s^k r s^ r_a a s^(k+1) r )^* F^a s^k r s^ r_a a s^(k+1) r =1.  \n.\n\n\nPhysically, the fact that we obtain multiple, physically inequivalent choices of A^a s^n r implies that in the condensed phase, the string label a \n“splits\" into q/r distinct label types, which we denote\n\n    ã_μ =(a, μ)   ,   μ=1,…,q/r\n\n Here (a, μ) indicates that any vertex associated with the label ã_μ is assigned a vertex coefficient consistent with the choice (A^a s^r )_μ= [ ∏_k=1^q/r-1 ( F^a s^k r s^ r_a a s^(k+1) r )^*]^μ r /q.\n\n\nArmed with this knowledge of splitting, we may return to scrutinize other types of vertices.   Vertex coefficients for vertices (a,b;c) where none of the three string labels split can be solved for as above; this includes all vertices of the form (b, s^j; b^j) for 0 ≤ j < q where b × s^j ≠ b for any j < q.   Thus consider a vertex of the form (a,b; c) (or one of its cyclic permutations), where a^r = a, but b and c do not split.  Attaching a stick carrying the label s^rl to the a edge, the analog of Eq. (<ref>) is:\n\n    (A^a s^(j+l) r)_μ A^b s^k B^a, b^k_c^j r+k B^c^jr+ks̅^jr+k= \n       (A^a s^l r)_μ F^a s^l r s^jr_a a s^(l+j)r W_jk (abc) A^ab_c   ,\n\n This set of equations allows for a consistent definition of B^a, b^k_c^jr +k in terms of A^ab_c only if the l-dependence of the two sides cancels.  Indeed, (see Eq. <ref>) \n\n    (A^a s^(j+l) r)_μ/(A^a s^l r)_μ (F^a s^l r s^jr_a a s^(l+j)r)^* = (A^a s^jr)_μ\n  \nso the l dependence is indeed trivial, and a consistent definition is possible.  Note that the coefficient B^a, b^k_c^jr +k on the left-hand side of Eq. (<ref>)\nwill depend on the choice of μ; correspondingly, we define the q/r vertex coefficients (B^a b^k_c^jr+k)_μ.  \n Similar considerations apply for the cyclic permutations (c̅, a; b̅), (b, c̅; a̅).\n\nFinally, consider a vertex of the form (a,b; c) where at least two of the labels split.   For example, suppose that a^r = a, c^r = c, and consider applying a W^1_ϕ^lr string operator to the vertex (a,b; c), with sticks on the a and c edges initially labeled by s^ir and s^kr respectively.  This gives the relation: \n\n    A^a s^(i+l) r A^c s^(k-l) r A^a b_c  \n       =A^a b_c A^a s^i r A^c s^k rw̅_ϕ^lr(b) F^ a b s^ l r_c c b^lr (F^ a s^ l r b_c a b^lr )^* \n       × F^a s^i r  s^l r_a a s^(i+l) r ( F^ c s^lr s^(k-l)r_c c s^k r  )^* F^s^lrs̅^lr s^ k r_ s^ k r 0  s^ (k-l) r\n\nNote that in this case, A^ab_c appears on both sides of the equation.  If the coefficient on the right-hand side does not depend on b, then we can simply cancel these factors and we recover an equation that is satisfied by solutions to (<ref>) (see Eq. (<ref>)).  However, in general the coefficient is invariant only under replacing b → b^jr for some integer j, and may be different for distinct choices of b (see Appendix (<ref>)).  The resolution to this is that we must replace Eq (<ref>) with the equation: \n\n    (A^a s^l r)_μ/(A^c s^l r)_ν (A^a b_c)^μ_ν  =   (A^a b_c)^μ_ν  M_l(a,b,c)\n\nwhere we have used Eqs. (<ref>) and (<ref>) to simplify the factors associated with vertices A^a s^ir, A^c s^jr, and \n\n    M_l(a,b,c)  =  w̅_ϕ^lr(b) F^ a b s^ l r_c c b^lr ( F^ a s^ l r b_c a b^lr )^*\n\n encodes the dependence on the label b.  \nThus either (A^a b_c)^μ_ν = 0, or \n\n    (A^a s^ l r)_ν = (A^c s^lr)_μ M_l(a,b,c) .\n\n In general, this gives us  a condition that fixes the values of (μ,ν) for which (A^a b_c)^μ_ν≠ 0, and hence specifies the fusion rules of the new, split anyon labels.  \n Note that the conditions for (A^a b_c)^μ_ν, (A^c̅ a_b̅)^μ_ν, and (A^b c_a)^μ_ν to be non-vanishing involve different coefficients in general.     \n\nIn Appendix <ref>, we show that when (a,b;c) is allowed by the branching rules, there is necessarily at least one choice of (μ,ν) such that (A^a b_c)^μ_ν≠ 0, and hence at least one choice of (μ,ν) for which (ã_μ, b̃; c̃_ν) is allowed by the new branching rules.   (We also show that the same is true for the cyclic permutations (A^c̅ a_b̅)^μ_ν, and (A^b c_a)^μ_ν  of this vertex).  Indeed, provided that b̃ does not split, generically there are q/r such solutions.  \nThis allows us to partially characterize the fusion rules of the new theory.  For example, suppose that only vertices of the form (c̅, a; b̅) are allowed by the branching rules, where b × s^v ≠ b for any 0 < v < q.  \nIn the condensed Hilbert space, we have\n\n    (∑_ν =1^q/rc̃̅̃_ν )  × (∑_μ =1^q/rã_μ ) =  q/r∑_b̃̅̃b̃̅̃\n \nwhere the sum on the right-hand side runs over all distinct choices of b̃̅̃ that are compatible with the original branching rules.  \nSince a × s^r = a, c × s^r = c, we have s^r ×( c̅× a) =  c̅× a; hence if  (c̅, a; b̅) is allowed by the fusion rules, then so is  (c̅, a; b̅^j r) for any j.   Consequently, provided that (c̅, a; b̅^k) is not allowed by the branching rules of the original theory for any 0<k < r, in the condensed phase there are q/r copies of b̃̅̃ in the fusion product c̃̅̃×ã. \nThis corresponds exactly to the number of distinct choices of (μ, ν) that solve Eq. (<ref>) – i.e. the number of choices of (μ, ν) for which (c̃̅̃ , ã_μ; b̃̅̃) is allowed by the new branching rules.  \nIn this case, each copy of b̃̅̃ can be associated with a distinct solution, such that typically the Hilbert space at the vertex (c̃̅̃ , ã_μ; b̃̅̃)  is one dimensional (i.e. the new theory does not have fusion multiplicity).   In particular, there is no fusion multiplicity associated with the vacuum 0̃, since the cyclic property of the fusion rules ensures that only vertices of the form (a, a; s^jr) are allowed.\n\nThe possible fusion rules for other types of vertices, such as vertices (ã_μ,  b̃_λ; c̃_ν ) where all three labels split, are discussed in Appendix <ref>.\n\n  \n\n\nIn summary, the new Hilbert space ℋ̃  consists of string-net states with  both unsplit string types of the form (<ref>), (<ref>), whose branching rules are fixed by those of the original labels, and split string types given by (<ref>), whose branching rules are fixed by a combination of those of the original theory, and the solutions to Eq. (<ref>).  \n\n\n\n\n\n\n\n\n§ STRING NET MODEL OF THE CONDENSED PHASE\n \n\nWe now show that the ground state |Ψ⟩ of our extended string-net model as J →∞ can be expressed as an ordinary string net ground state using the new label set {ã_i, b̃, c̃, ... }.  \nIn particular, we show how to use the vertex coefficients { A^ab_c , B^a^j, b^k_c^j+k} \ndescribed in the previous section to obtain the fusion data describing the string net in the condensed phase.  If there is no splitting, we find that the vertex coefficients, together with the fusion data of the original category, fully fix the fusion data for the condensed string net.  With splitting, these do not fully fix the fusion data; the remaining freedom can be eliminated by imposing the consistency conditions (<ref>).   \n\n\n\n §.§ The topological data for the condensed phases\n\n\nDeep in the condensed phase, the basis states in ℋ̃ allow us to express the condensed ground state |Ψ = P_ϕ |Φ as a new string-net condensed state with amplitudes\n\n    Ψ (X̃ )   ≡X̃|Ψ\n       = 1 /p^2 N_V∑_X∈X̃ C_X̃ (X)   X  |Ψ\n       ≡1 /p^2 N_V∑_X∈X̃   C_X̃(X) Ψ(X).\n\nHere \nthe sum over X∈X̃ is over all configurations of uncondensed string labels compatible with the configuration X̃.  Note that when one or more labels split there are multiple distinct solutions for the vertex coefficients, associated with the multiple distinct split string labels; in this case the coefficients C(X) depend not only on X but on the choice of which label in each set {ã_μ} is in the configuration X̃; to indicate this dependence, we have added a subscript, denoting the coefficient C(X)  as C_X̃(X). \n\n\n\n  §.§.§ Topological data in theories without splitting\n\n\nWe first describe how to use Eq. (<ref>) to obtain the topological data associated with the condensed string net in theories where none of the original labels split.  \nWe begin by simplifying Eq. (<ref>), using the relation:\n\n    C_X̃(X_1)Ψ(X_1)= C_X̃(X_2)Ψ(X_2)\t for any X_1,X_1∈X̃.\n\nTo see that these are equal, observe that on the one hand, we have\n\n    C_X̃(X_2)=C_X̃(X_1)W(P)^X_1_X_2\n\nfor any X_1,X_2 ∈X̃ by (<ref>,<ref>).\nOn the other hand, the new ground state |Ψ satisfies\n\n    Ψ(X_2) = X_2|Ψ=X_1|W(P)|Ψ/W(P)^X_1_X_2=Ψ(X_1)/W(P)^X_1_X_2.\n\nHere we use (<ref>) in the second equality and (<ref>) in the third equality.\nPutting (<ref>,<ref>) together, we establish (<ref>).\n\nBy using (<ref>), we can rewrite (<ref>) as\n\n    Ψ (X̃ )=  C(X_0)Ψ(X_0)\n\nwere X_0 denotes a reference configuration of our choice from the set X ∈X̃; in the following it will be convenient to choose X_0 to have only trivial labels on all sticks. \nObserve that in the absence of splitting,  each vertex in X̃ corresponds to q^2 configurations X, obtained by acting with W^1_ϕ_j W^2_ϕ^k for 0 ≤ j,k < q at each vertex.   Each such configuration appears p/q times when we act with P_ϕ on X_0. \nThus summing over X ∈X̃ and expressing all terms in terms of Ψ(X_0) gives a factor of p^2 for each vertex, which exactly cancels the normalization pre-factor. \n\n\nWe can use the amplitudes of this new ground state to define the new F-symbols F^ãb̃c̃_d̃ẽf̃ and quantum dimensions d_ã by\n\n\t\n    Ψ( -0.22in\n        < g r a p h i c s >\n    ) =∑_f̃F^ãb̃c̃_d̃ẽf̃Ψ(-0.22in\n        < g r a p h i c s >\n    )\n    \n    Ψ( -0.22in\n        < g r a p h i c s >\n    ) =  δ_c̃,d̃√(d_ã d_b̃/d_c̃)Ψ(-0.22in\n        < g r a p h i c s >\n    ).\n\n\t\n\nHere the grey regions denote the part of the configuration that is identical on both sides of the equation.\n\nTo relate the new coefficients to the old ones,\nconsider a pair of reference configurations X_0, X_0' related by one of the local moves in Eq. (<ref>). For convenience, we choose all reference configurations to be closed configurations in which all sticks carry the trivial label.  \nThese closed configurations are generated by those terms in P_ϕ containing only closed loops of simple string operators, all of which act as the identity on the ground state |Φ⟩ of the original string net.  (Recall that |Ψ = P_ϕ |Φ). \nThus when X_0, X_0' are closed configurations, Ψ(X_0) ∝Φ(X_0), and similarly for X_0'.  Note that the constant of proportionality here depends only on the number of closed loop string operators in P_ϕ, and is the same for all reference configurations. \n\nUsing the fact that Φ(X_0), Φ(X_0') are related by the original local rules, and applying (<ref>) to both sides of (<ref>),  \nwe conclude that when none of the labels ã, ... f̃ split, the old data and the new data are related by\n\n\t\n    B^ab_e B^ec_d  /B^bc_f B^af_d  F^abc_def=F^ãb̃c̃_d̃ẽf̃\n    \n    \t\t d_a = d_ã\n\n\t\n\n(The local moves (<ref>) and (<ref>) lead to the same definition (<ref>) of d_ã).\nHere B^ab_c (which can also be root vertex coefficients A^ab_c) are the vertex coefficients defined in (<ref>) -(<ref>) and { F^abc_def,d_a } are the original F-symbols and quantum dimensions for the ground state Φ.\nThe labels a,b,c,d in F^abc_def are chosen such that they are compatible with the branching rules of the old theory, and such that a∈ã,b ∈b̃, c∈c̃, d∈d̃.    \nThis expression thus fully fixes the new F-symbols in terms of the old F-symbols and the vertex coefficients.  Further, comparing this to the expression (<ref>) for gauge transformations of the F-symbols, we can see that the root vertex coefficients A^ab_c with a,b ≠ s^i are simply gauge transformations of the new F's.  (The remaining vertex coefficients, which are fully fixed by the choice of A^ab_c, ensure that the left-hand side of the equation is independent of the specific choice a,b,c,d,e,f used in the calculation.)\n\n\n\n\n\n\n  §.§.§ Topological data in theories with splitting\n\n\nIn theories with splitting, instead of expressing amplitudes in terms of a single reference configuration, we replace Eq. (<ref>) with: \n\n    Ψ (X̃ )= 1/N(X_0)∑_X_0 ∈X̃ C_X̃(X_0)Ψ(X_0)\n\nwere X_0 denotes the set of reference configurations that are compatible with the choice of condensed labels X̃, and contain only trivial labels on the sticks.  The reason for this replacement is that in theories with splitting, a single reference configuration X_0 may not be sufficient to uniquely fix X̃ via the choice of vertex coefficients entering C_X̃(X_0).  We therefore instead keep the minimum number of configurations in our sum necessary to ensure that the right-hand side describes coefficients associated with a specific condensed label set, which is a sum over all configurations compatible with X̃ for which all sticks carry the trivial label.  \n\nUnlike in the unsplit case, the number of configurations associated with each reference configuration X_0 in the sum does not, in general, fully cancel the pre-factor of 1/p^2 N_V in Eq. (<ref>).  \nHere N(X_0) counts the number of distinct products of simple string operators that leave X_0 unchanged – meaning that they change neither the labels on the sticks, nor any of the edge labels.  This number depends on the number of closed loops in X_0 along which all labels split.  Relative to the unsplit case, the number of distinct configurations X in the sum (<ref>) is reduced by N(X_0).   \n\n\n\nTo find F^ãb̃c̃_d̃ẽf̃,\nwe note that:\n\n    Ψ( -0.22in\n        < g r a p h i c s >\n    ) \n    \t   =   ∑_e∈ẽ(B^ab_e)^μν_λ  (B^ec_d)^λρ_σΦ(-0.22in\n        < g r a p h i c s >\n    )  \n        =    ∑_e∈ẽ(B^ab_e)^μν_λ  (B^ec_d)^λρ_σ\n          ×∑_f  F^abc_defΦ(-0.22in\n        < g r a p h i c s >\n    )\n\nIn the last equality, the labels μ, ν, ρ, σ identify the external split legs as ã_μ, b̃_ν, c̃_ρ, and d̃_σ respectively.  However, it can happen that there is more than one solution f̃_κ compatible with both the old label f, and the new fusion rules.  In other words, there may be more than one choice of κ for which (B^bc_f)^νρ_κ  (B^af_d)^μκ_σ≠ 0.  \nWe conclude that the old data and the new data are related by\n\n    ∑_e:e∈ẽ (B^ab_e)^μν_λ  (B^ec_d)^λρ_σ/ (B^bc_f)^νρ_κ  (B^af_d)^μκ_σ  F^abc_def=∑_f̃: f∈f̃ F^ã_μb̃_νc̃_ρ_d̃_̃σ̃ẽ_̃λ̃f̃_̃κ̃ .\n\n\nTo find d_ã, we observe that we also have:\n\n    Ψ (∑_X̃∈ X_0X̃ )\n    =1 /N(X_0) ∑_X̃∈ X_0    C_X̃ (X_0) Ψ(X_0).\n \nwhere in this case, we can choose a single reference configuration.  Letting X̃ be a configuration with single closed loop carrying the label ã, and X_0 to have a single loop carrying the label a, we find that the number of terms in the sum is precisely N(X_0), and that all terms in the sum contribute equally.  From this, we conclude that \n\n    d_a = ∑_ã: a∈ãd_ã .\n \n\n\nThus, we see that in theories with splitting, the original fusion data and vertex coefficients do not fully fix all  of the new F's.  In this case, the remaining freedom must be used to ensure that the new F's satisfy the consistency conditions (<ref>), as well as the unitarity conditions (<ref>).\n\n\n\n\n §.§ Consistency conditions for F^ãb̃c̃_d̃ẽf̃ \n\n\nWe now show that the new data { F^ãb̃c̃_d̃ẽf̃} satisfy the consistency conditions (<ref>).   \nWe begin with the condition (<ref>), which requires F^ãb̃c̃_d̃ẽf̃=1 if ã or b̃ or c̃=0̃.  \nWe wish to show that the right-hand side is equal to 1 if a, b, or c are powers of s. \nIndeed,  using Eq. (<ref>), one can show:\n\n    B^a b^i_c^i B^b s^i/B^c s^i B^a b_c  F^a b s^i_c^i c b^i  = \n    \t\tB^a s^i B^a^i b_c^i/B^a b^i_c^i  B^s^i b F^a s^i b_c^i a^i b^i  = \n    \t\tB^a^i b_c^i B^ s^i a/B^a b_c  B^s^i c F^s^i a  b_c^i a^i c  = 1\n\nIf a, b, or c are powers of s, then there are no sums in Eq. (<ref>); thus Eq. (<ref>) ensures that the new F's satisfy Eq. (<ref>).  \n\nTo see that the first term in Eq. (<ref>) is equal to unity, apply a W^2_ϕ^i-type string to the vertex (a,b;c), with the stick on the c edge carrying the label s^i.  From Eq. (<ref>), in the gauge (<ref>), the matrix element associated with this string operator is F^a b s^i_c^i c b^i, and Eq. (<ref>) implies that B^c s^i B^a b_c = B^a b^i_c^i B^b s^iF^a b s^i_c^i c b^i.  \nThe second equality is obtained by applying a product of the form W^2_ϕ^iW^1_ϕ^-i to a configuration with the two vertices (a, s^i; a^i) and (a^i, b; c^i), and using Eqs. (<ref>), (<ref>), and  (<ref>). \nThe third equality can be obtained by acting with a W^1_ϕ^i string on the vertex (a,b; c), with an s^i labeled stick on the c edge.  In our gauge of choice, the corresponding matrix element is w_ϕ^i(b) F^a b s^i_c^i c b^i (F^a s^i b_c^i a^- b^i)^*, which by Eq. (<ref>) is equal to w_ϕ^i(a) w̅_ϕ^i(c) (F^s^i a b_c^i a^i c)^*.  \nThis gives \n\n    A^ab_c A^c s^iω̅_ϕ^i(c) = F^s^i a b_c^i a^i cω̅_ϕ^i(a)A^a s^i B^a^i b_c\n\nUsing Eq. (<ref>), we obtain the stated result.  \n\n\n\nNext, we turn to the pentagon identity (<ref>).\nMultiplying both sides of (<ref>) by B^fc_g B^gd_e B^ab_f, and summing over f∈f̃ and g∈g̃, gives\n\n    ∑_f∈f̃,g∈g̃F^fcd_eglF^abl_efk    B^fc_g B^gd_e B^ab_f \n       =∑_f∈f̃,g∈g̃,hF^abc_gfhF^ahd_egkF^bcd_khl \n    \tB^fc_g B^gd_e B^ab_f\n\nWe fist consider the right hand side of (<ref>).  Using Eq. (<ref>), we have:\n\n    ∑_h,g∈g̃(∑_f∈f̃ F^abc_gfhB^ab_fB^fc_g)F^ahd_egkF^bcd_khlB^gd_e \n       =∑_h,h̃∋ hF^ãb̃c̃_g̃f̃h̃(∑_g∈g̃F^ahd_egkB^ah_gB^gd_e)F^bcd_khlB^bc_h \n       =∑_h̃,k̃∋ kF^ãb̃c̃_g̃f̃h̃ F^ãh̃d̃_ẽg̃k̃(∑_h∈h̃F^bcd_khlB^hd_kB^bc_h)B^ak_e\n       =∑_h̃,k̃∋ k,l̃∋ lF^ãb̃c̃_g̃f̃h̃ F^ãh̃d̃_ẽf̃h̃ F^b̃c̃d̃_k̃h̃l̃ B^cd_lB^bl_kB^ak_e\n\n(In the third line, we exploit the fact that ∑_h,h̃∋ h=∑_h̃,h∈h̃).  A similar treatment of the right hand side of (<ref>)\ngives ∑_l̃∋ l,k̃∋ kF^f̃c̃d̃_ẽg̃l̃F^ãb̃l̃_ẽf̃k̃B^bl_kB^ak_eB^cd_l.  \nThus the new F-symbols satisfy:\n\n    ∑_l̃∋ l,k̃∋ k F^f̃c̃d̃_ẽg̃l̃F^ãb̃l̃_ẽf̃k̃=∑_l̃∋ l,k̃∋ k∑_h̃F^ãb̃c̃_g̃f̃h̃F^ãh̃d̃_ẽg̃k̃F^b̃c̃d̃_k̃h̃l̃.\n\nIf a^r ≠ a for any r<q, then the sums over l̃ and k̃ can be dropped, and the new F-symbols automatically satisfy the pentagon identity (<ref>).  \nOtherwise, Eq. (<ref>) only constrains certain sums of the new F's, and we must use the remaining freedom to choose the new F's to satisfy Eq. (<ref>).  \n\n\n\n\n\n\n\n §.§ Effective Hamiltonian \n\n\n\n\nWe have seen that the ground state |Ψ⟩ of the condensed phase is a string net state, described in terms of the new labels {ã}, with new F symbols and quantum dimensions given by Eqs. (<ref>), (<ref>), together with the consistency conditions (<ref>).  Since |Ψ⟩ is also a ground state of the effective Hamiltonian in the condensed phase, this suggests that our effective Hamiltonian acts on the labels in the new basis as a (conventional) string net Hamiltonian.  \n\nIn the absence of splitting, it is relatively straightforward to see that this is indeed the case.  Consider the action of P_ϕ B^ϕ_p on a state ⟨X̃ | in our new string-net basis.  As above, we can use the fact that ⟨X̃ | P_ϕ B^ϕ_p = ⟨X̃ | B^ϕ_p =  C(X_0)  ⟨ X_0| B^ϕ_p, where X_0 is a configuration compatible with X̃, and for which all stick labels are trivial.   \nWe thus have \n\n    ⟨X̃ | B^ϕ,t_p    \n     = ∑_X_0' C(X_0)  ⟨ X'_0| B^t, i_1... i_6j_1...j_6_p, i_1'... i_6'j_1'...j_6'(e_1,... e_12;𝕀,𝕀,𝕀)\n\nwhere j_k= i_k, j_k'= i_k' for k=4,5,6, and e_10= e_11 = e_12 = 0.  Here ⟨ X'_0| is identical to ⟨ X_0| except on the boundary of the plaquette p, where edges labeled i_1 ... i_6, j_1... j_6 in ⟨ X_0| now carry labels i'_1 ... i'_6, j'_1... j'_6.  \nApplying Eq. (<ref>) repeatedly, we find that the matrix element can be expressed as a product of new F symbols:  \n \n    ∑_X'C(X_0)  ⟨ X'| B^t, i_1... i_6j_1...j_6_p, i_1'... i_6'j_1'...j_6'(e_1,... e_12;𝕀,𝕀,𝕀) =\n    ∑_X'  C(X')  ⟨ X'|   B^t̃,ĩ'_1…ĩ'_6 ĩ'_1…ĩ'_6_p,ĩ'_1…ĩ'_6ĩ'_1…ĩ'_6(ẽ_1…ẽ_6 0̃…0̃;𝕀,𝕀,𝕀)  \n    \n     = ⟨X̃'|  B̃_p,ĩ'_1…ĩ'_6^t̃,ĩ_1…ĩ_6(ẽ_1…ẽ_6)\n\nwhere the matrix elements of B_p^t are defined in (<ref>), with the old F-symbols in the first line replaced by the new F-symbols in the second and third lines.  Matrix elements of the plaquette string operator B^t̃_p acting on states with all sticks carrying the trivial label are exactly the matrix elements of the conventional string-net plaquette operator (see Ref. <cit.>) which we denote B̃_p,ĩ'_1…ĩ'_6^t̃,ĩ_1…ĩ_6(ẽ_1…ẽ_6) in the third line.\nThus our effective Hamiltonian in the string-net phase is exactly the new string net Hamiltonian.  \n\nThe situation in theories with splitting is similar, though more subtle due to the fact that a single label t in the original theory can represent multiple labels t̃_μ in the new theory.  \n\n\n\n\n\n\n§ EXAMPLES\n \nIn this section, we work out some illustrative examples.\nWe begin by considering condensation  in the abelian\nℤ_2, ℤ_4, ℤ_6, ℤ_4×ℤ_4 string-net models.  \nIn abelian theories there is never any splitting, and the new fusion data follows directly from the coefficients B^a_i, b^j_c^k+k.  \nWe also describe condensation of abelian bosons in two non-abelian string-net models, based on the fusion categories Rep(S_3) and SU(2)_4.\nIn these models, we also fully construct the new Hilbert space ℋ̃ after condensation and compute new F-symbols and quantum dimensions for the condensed phases.\n\nThroughout our discussion of abelian string-net models, we will use \n\n    F(a,b,c)=F^abc_def\n\nfor brevity, since other indices can be deduced from the abelian branching rules.  \nMoreover, for string nets based on the group G=ℤ_N, there are N distinct solutions to (<ref>), with the explicit form<cit.>\n\n    F(a,b,c)=e^2π i pa/N^2(b+c-[b+c]).\n\nThe integer parameter p=0,…,N-1 labels the N distinct solutions. The arguments a,b,c take values in 0,…,N-1 and [b+c] denotes b+c (mod N) with values also taken in 0,…,N-1.  \nFor each of the N distinct solutions, we can construct a corresponding string-net model. \nEach such string net model has N^2 topologically distinct quasiparticle excitations labeled by ϕ=(s,m) where s,m=0,1,…,N-1. The string operator W_ϕ(P) which creates ϕ=(s,m) is defined by (<ref>) with the string parameters \n\n    w_ϕ(a)=e^2π i(psa/N^2+ma/N)\n\n\n\n\n\n\n\n §.§ ℤ_2 string-net model\n\n\nTo set the stage, we begin with the ℤ_2 string-net model, whose condensation transitions and phase diagram have been studied extensively in the literature <cit.>.\nHere, we briefly review how our construction replicates these results.  \n\n\n\nThe ℤ_2 string-net model has two types of strings {0,1} with dual strings 0̅=0,1̅=1. The branching rules are {(a,b;c) with a+b=c mod 2 }.  \nThere are two distinct solutions F(1,1,1)=±1 to (<ref>). The corresponding models are the Toric code<cit.> and the double semion model respectively. \nThe Toric code has two ℤ_2 bosons ϕ=(1,0) and ϕ=(0,1), while the double semion model has one ℤ_2 boson ϕ=(0,1).\n\nWe first consider the condensation of ϕ=(0,1) in the two models, as the two condensed phases are identical. After condensation, only string type a which satisfies w_ϕ(a)=(-1)^a=1 remains, namely the remaining string type is 0̃={0} and thus the Hilbert space ℋ̃ is the vacuum state which is the same as the vacuum state in ℋ_ϕ. Hence, there is no string-net topological order after ϕ condensation.\n\nNext, we consider the ϕ=(1,0) condensation in the Toric code. After condensation, the new string type is 0̃={0,1} and thus ℋ̃ is the vacuum state which is the equal superposition of all states in ℋ_ϕ. Thus there is no string-net topological order after ϕ condensation.\n\nWith the Hamiltonian described here, all of these phase transitions are in the 2+1D Ising universality class.\n\n\n\n §.§ ℤ_4 string-net model\n\n\nWe next show how our construction allows us to construct certain condensed phases of the ℤ_4 string net model.  The full phase diagram of this model was studied in detail in Ref. <cit.>.\n\nThe ℤ_4 string-net model has four types of strings {0,1,2,3} with dual strings 0̅=0,1̅=3,2̅=2,3̅=1. The branching rules are {(a,b;c)  with a+b=c  mod 4}. The Hilbert space consists of all possible string-nets with the above string types and branching rules.\n\nThere are four distinct solutions to the self-consistency conditions (<ref>)\n\n    F(a,b,c)=e^i 2π p a(b+c-[b+c]_4)/4^2\n\nlabeled by p=0,1,2,3. Here [x]_n=x mod n.\nThe corresponding ℤ_4 string-net models realize the topological order described by the Chern-Simons theory with the K-matrix\n\n    K= ( [   0   4;   4 -2p ]).\n\n\n All four models have a ℤ_4 boson ϕ=(0,1) and a  ℤ_2 boson ϕ=(0,2). In addition, the p=0 model has other two ℤ_2 bosons ϕ=(2,0) and ϕ=(2,2).\nWe consider the topological order after condensation of each of these bosons.\n\nAs in the ℤ_2 case, condensing ϕ=(0,1) leads to a trivial order.  Thus, \nwe begin with the condensation of ϕ=(0,2).  In the condensed phase, the remaining string types a are those which satisfy w_ϕ(a)=e^i 2π2a/4=1, namely, the remaining string types are a∈{0,2}. \nThus the Hilbert space ℋ̃ after ϕ-condensation contains string-nets with the new string labels {0̃={0},1̃={2}} and the ℤ_2 branching rules.  \nAs discussed in Eq. (<ref>), in this case all non-vanishing vertex coefficients can be set to 1.  Solving Eq. (<ref>), \nwe then find that the F symbols of the condensed phase are simply a subset of those of the uncondensed phase.  Specifically:\n\n    all A=1   ,F(1̃,1̃,1̃)=1,    d_1̃=1\n for the p=0,2 models, and\n\n    all A=1,   F(1̃,1̃,1̃)=-1,   d_1̃=1\n for the p=1,3 models.\nThus, the ϕ=(0,2) condensed phase in the p=0,2 models is described by the Toric code while the ϕ=(0,2) condensed phase in the p=1,3 models is described by the double semion model.\n\nCondensing ϕ=(1,0) also leads to a trivial topological phase; thus we\nnext turn to the condensation of the ϕ=(2,0) and ϕ=(2,2) bosons in p=0 model.\nThe Hilbert space ℋ̃ for both cases contains string-nets with the new string types {0̃={0,2},1̃={1,3}} and the ℤ_2 branching rules.\nTo find the topological order for after condensation, we solve for the vertex coefficients, and use Eq. (<ref>) to deduce the topological data of the condensed phase.\nWhen the condensing boson is ϕ=(2,0), we find that\n\n    all A=1,   F(1̃,1̃,1̃)=1,   d_1̃=1.\n\nIn this case, the condensed F-symbols are simply a subset of the uncondensed ones; this is always the case when condensing (q,0)-type bosons in untwisted abelian lattice gauge theories.  Thus, the ϕ=(2,0) condensed phase is described by the Toric code.  \n\nWhen condensing boson is ϕ=(2,2), in contrast, not all vertex coefficients can be chosen to be unity.  In this case, we can choose:\n\n    A^t2=(-1)^t, other A=1,    F(1̃,1̃,1̃)=-1,   d_1̃=1.\n\nwith t=0,1,2,3. Thus, the ϕ=(2,2) condensed phase is described by the double semion model.\n\n\n\n §.§ ℤ_6 string-net models\n\nThe ℤ_6 string-net model has six types of strings {0,1,2,…,5}. The dual string type is defined by a̅=6-a  mod 6 while the branching rules are the triplets (a,b;c) that satisfy a+b=c (mod 6). By using the general solution\n\n    F(a,b,c)=e^i 2π p a(b+c-[b+c]_6)/6^2,\n\nwe can construct six distinct string-net models labeled by p=0,1,…,5. The corresponding topological order can be described by the Chern-Simons theory with the K-matrix\n\n    K= ( [   0   6;   6 -2p ]).\n\n\nAnalogously to the previous examples, condensing a ℤ_6 boson\nresults in a trivial topological phase.  Thus we  focus on condensing \nthe ℤ_2 and ℤ_3 abelian bosons, which are summarized for the 6 distinct ℤ_6 string-net models in Table <ref>.\n  \nWe  first consider condensing ℤ_3 bosons.\nCondensing ϕ=(0,2), which is a boson for any p, leaves the string types  {0̃={0},1̃={3}} with ℤ_2 branching rules.\nIn this case, the condensed phase is described by:\n\n    all A=1,   F(1̃,1̃,1̃)=1,   d_1̃=1\n for the p=0,2,4 models\nand \n\n    all A=1,   F(1̃,1̃,1̃)=-1,   d_1̃=1\n \nfor the p=1,3,5 models.\nThus, the ϕ=(0,2) condensed phase in the p=0,2,4 models is described by the Toric code while the ϕ=(0,2) condensed phase in the p=1,3,5 models is described by the doubled semion model.\n\nSecond, we condense the ℤ_3 boson ϕ=(2,0) in the p=0 model\nand the ℤ_3 boson ϕ=(2,2) in the p=3 model.\nThe new string labels are {0̃={0,2,4},1̃={1,3,5}} with ℤ_2 branching rules after condensation. \nAnalogous to the ℤ_4 case, we find\n\n    all A=1,   F(1̃,1̃,1̃)=d_1̃=1\n\nfor condensation of ϕ=(2,0) in the p=0 model and\n\n    A^12=A^32=A^52=-1,other  A=1,\n    \n    \tF(1̃,1̃,1̃)=-1, d_1̃=1.\n\nfor condensation of ϕ=(2,2) in the p=3 model.\nThus the two condensed phases are described by the Toric code and the doubled semion model respectively.\n\nNext, we consider condensing ℤ_2 bosons.\nWhen the condensing boson is ϕ=(0,3), the remaining string types are {0̃={0},1̃={2},2̃={4}} with ℤ_3 branching rules.\nAfter solving (<ref>), we find\n\n    all A=1,   F(ã,b̃,c̃)=e^i2πqã(b̃+c̃-[b̃+c̃]_3̃)/9,   d_ã=1\n\nwith q=0 for the p=0,3 models and q=1 for the p=1,4 models and q=2 for the p=2,5 models. \nThus, the ϕ=(0,3) condensed phase in the p=0,3 models is described by the ℤ_3 string-net model with q=0 while\nthe ϕ=(0,3) condensed phase in the p=1,4 and p=2,5 models is described by the ℤ_3 string-net model with q=1 and q=2 respectively.\n\nFinally, we condense the ϕ=(3,0),(3,1),(3,2) bosons in the ℤ_6 string-net models with p=0,2,4 respectively.\nThe new string types after condensation are {0̃={0,3},1̃={1,4},2̃={2,5}} with ℤ_3 branching rules.\nCondensing ϕ=(3,0) in the p=0 model, all vertex coefficients can be taken to be 1, and we obtain:\n\n    all A=1,   F(ã,b̃,c̃)=1,   d_ã=1.\n\nTo condense ϕ=(3,1) in the p=2 model, we may take:\n\n    A^13=A^43=e^i2π/3,A^23=A^53=e^-i2π/3,  other A=1\n       F(1̃,1̃,2̃)=F(1̃,2̃,1̃)=F(1̃,2̃,2̃)=e^-i2π/3, \n       F(2̃,2̃,1̃)=F(2̃,1̃,2̃)=F(2̃,2̃,2̃)=e^i2π/3,  other F =1\n       d_ã=1.\n\nFinally, to condense ϕ=(3,2) in the p=4 model, we obtain:\n\n    A^13=A^43=e^-i2π/3,A^23=A^53=e^i2π/3,  other A=1\n       F(1̃,1̃,2̃)=F(1̃,2̃,1̃)=F(1̃,2̃,2̃)=e^i2π/3, \n       F(2̃,2̃,1̃)=F(2̃,1̃,2̃)=F(2̃,2̃,2̃)=e^-i2π/3,  other F=1 \n       d_ã=1.\n\nThus the three condensed phases are described by the ℤ_3 string-net models labeled by p=0,2,1 respectively.\n\n\n\n We summarize the condensed phases after condensing abelian bosons in the ℤ_6 models in Table <ref>.\n\n\n\n\n\n\n\n\n\n §.§ ℤ_4×ℤ_4 string-net model\n\nThe ℤ_4×ℤ_4 string-net model has 16 types of strings labeled by a∈{(a_1,a_2),a_1,a_2∈{0,1,2,3}} with dual strings a̅=(a̅_1,a̅_2)=(4-a_1,4-a_2). The branching rules are {(a_i,b_i;c_i)  with  a_i+b_i=c_i  mod 4} with i=1,2. The Hilbert space consists of all possible string-nets with the above string types and branching rules.\n\n\nThe general form of solutions to the self-consistency conditions (<ref>) for ℤ_N ×ℤ_N string net models is known<cit.>.\nHere, we consider one such solution, for which: \n\n    F(a,b,c)=e^i 2π a^T 𝐍^-1𝐏𝐍^-1 (b+c-[b+c])\n\nwith \n\n    𝐍= ( [ 4 0; 0 4 ]),\n     𝐏= ( [ 0 2; 0 0 ]).\n\nHere the square bracket [b+c] denotes a 2-component vector whose i-th component is b_i+c_i (mod 4).\nFrom the solution (<ref>), we can construct the ℤ_4×ℤ_4 string-net Hamiltonian.\n\nWe focus on the four ℤ_2 bosons in the model and we denote them by\n\n    ϕ_1=(2,0,0,3),  ϕ_2=(2,0,0,1),\n    ϕ_3=(2,0,2,1),  ϕ_4=(2,0,2,3).\n\nHere the bosons are labeled by (s_1,s_2,m_1,m_2) with s_1,s_2 being the flux and m_1,m_2 being the charge carried by the particle.\nNow, we consider the condensation of the four bosons ϕ_i in the ℤ_4×ℤ_4 model in order.\nIn the ϕ_i condensed phase, we define the 2-component new string labels by\n\n    ã=(ã_1,ã_2)={(a_1,a_2),(2+a_1,a_2)}\n     with a_1∈{0,1},a_2∈{0,1,2,3}\n\nTo find the topological order for the ϕ_i condensed phase, we have to solve for the vertex coefficients.\nFirst, we find that\n\n    all A   =1  for ϕ_1 condensed phase\n    \n    \tA^a,(2,0)   =(-1)^a_2, other A=1 for ϕ_2 condensed phase.\n\nFor the ϕ_1 condense phase, we then solve Eq.  (<ref>) to find:\n \n    F(ã,b̃,c̃)=e^i 2πã^T 𝐍̃^-1𝐏̃𝐍̃^-1 (b̃+c̃-[b̃+c̃])\n\nwith \n\n    𝐍̃= ( [ 2 0; 0 4 ]),\n     𝐏̃= ( [ 0 1; 0 0 ]).\n\nFor the ϕ_2 condensed phase, the new F-symbol is gauge equivalent to (<ref>). \nThus the topological order in ϕ_1 or ϕ_2 condense phase is described by the Chern-Simons theory with K-matrix<cit.>\n\n    K= ( [  0  0  2  0;  0  0  0  4;  2  0  0 -1;  0  4 -1  0 ]).\n\n\nSecond, we find that\n\n    A^a,(2,0)   =(-1)^a_1+a_2, other A=1 for ϕ_3 condensed phase\n    \n    \tA^a,(2,0)   =(-1)^a_1, other A=1 for ϕ_4 condensed phase.\n\nFor the ϕ_4 condensed phase, we find that F(ã,b̃,c̃) is given by (<ref>)\nwith \n\n    𝐍̃= ( [ 2 0; 0 4 ]),\n     𝐏̃= ( [ 1 1; 0 0 ]).\n\nThe new F-symbol for the ϕ_3 condensed phase is gauge equivalent to (<ref>). \nThus the topological order in ϕ_3 or ϕ_4 condense phase is described by the K-matrix\n\n    K= ( [  0  0  2  0;  0  0  0  4;  2  0 -2 -1;  0  4 -1  0 ]).\n\n\n\n\n §.§ S_3 string-net model \n\n\nOur last two examples concern condensation transitions involving splitting.  \nWe begin with the S_3 string-net model (constructed from the fusion category Rep(S_3), which has three types of strings {0,1,2} with dual strings 0̅=0,1̅=1,2̅=2. The branching rules are \n\n    {(0,0;0),(1,0;1),(2,0;2), \n       (1,1;0)(1,1;1),(1,1;2),(1,2;1),(2,2;0)}.\n \nHere the triplets (a,b;c) are understood as the fusion a× b=c and are symmetric in the first two labels a,b. \nThe nontrivial F-symbols and d to self-consistency conditions (<ref>) are\n\n    F^111_1ef= \n    \t( [     1/2 -1/√(2)     1/2; -1/√(2)       0  1/√(2);     1/2  1/√(2)     1/2 ]) \n    \n    \tF^111_211=F^112_111=F^121_111=F^211_111=-1 \n    \n    \td_0=d_2=1, d_1=2\n\nwhere the matrix indices e,f can be 0,1,2. \n\nThe model has 8 quasiparticles. Among them, there is a ℤ_2 abelian boson, which we denote ϕ=(2,0). The corresponding string operator is defined by the string parameter\n\n    w_ϕ(a)=(-1)^a.\n\nSince 2 × 1 = 1× 2 = 1, condensing ϕ will cause the original string label 1 to split into two distinct labels, which we denote 1̃_1, 1̃_2.  \n\nTo describe the Hilbert space ℋ̃ after condensation, we first\nsolve (<ref>) for A^s^ia.  The \ntwo distinct solutions are: \n\n    (A^21)_1= (A^12)_2 =  1,   (A^12)_1 =(A^21)_2 =- 1.\n\nThus, the new string labels for ℋ̃ are \n\n    0̃={0,2},  1̃_1={1},  1̃_2={1}.\n\nThe branching rules can be deduced from the branching rules for the old string labels and are given by \n[Before condensation, we have 1×1=0+1+2. After condensation, the fusion becomes (1̃_1+1̃_2)×(1̃_1+1̃_2)=0̃+1̃_1+1̃_2+0̃.\tThus, 1̃_1,1̃_2 can be either self-dual or not self-dual. However, from the associativity of the fusion 1̃_1× (1̃_2×1̃_1)=(1̃_1×1̃_2)×1̃_1, we conclude 1̃_1×1̃_2=0̃,1̃_1×1̃_1=1̃_2,1̃_2×1̃_2=1̃_1.  This can also be deduced directly from Eq. (<ref>).]\n\n    {(0̃,1̃_1;1̃_1),\n    \t(0̃,1̃_2;1̃_2),\n    \t(1̃_1,1̃_2;0̃),\n    \t(1̃_1,1̃_1;1̃_2),\n    \t(1̃_2,1̃_2;1̃_1)}\n\nThus the condensed phase has ℤ_3 (abelian) branching rules. \n\nNext, we want to find the topological order in the ϕ condensed phase.\nA solution for the full vertex coefficients is given by Eq. (<ref>), together with:\n\n    (A^1 1_0)^1,2 =(A^1 1_0)^2,1=(A^11_2)^1,2=-(A^11_2)^2,1=1 \n        (A^11_1)^1,1_2 (A^11_1)^2,2_1=√(2),\n \nwhere (A^1 1_0)^1,2 is the coefficient that is relevant to the (1̃_1, 1̃_2; 0) vertex in the condensed phase, (A^11_1)^1,1_2 is relevant to the (1̃_1, 1̃_`; 1̃_2) vertex, and so on.  \nUsing this data, it is possible to solve (<ref>) for the fusion data in the condensed phase:\n\n    F^1̃_a 1̃_a 1̃_a_0 1̃_b 1̃_b\n    \t\t=F^1̃_a 1̃_a 1̃_b_1̃_a1̃_b 0\n    \t\t=F^1̃_a 1̃_b 1̃_a_1̃_a 0 0\n    \t\t=F^1̃_b 1̃_a 1̃_a_1̃_b 0 1̃_b=1\n\nfor a,b∈{1,2}.\nWith the data, we can construct ground states and lattice Hamiltonian for the condensed phase. It turns out the topological order in the condensed phase is described by the ℤ_3 string-net model charactered by the K-matrix\n\n    K= ( [ 0 3; 3 0 ]).\n\nIn other words, this is an untwisted (p=0) ℤ_3 string net model.  \n\n\n\n §.§ SU(2)_4 string-net model \n\nThe SU(2)_4 string-net model has five string types {0,1,2,3,4} with all strings being self dual. The branching rules are\n\n    {(a,0;a)  for a=0,1,2,3,4,\n       (a,a;0),(a,a;2),(a,2;1),(a,2;3)  for a=1,3,\n       (1,3;2),(1,3;4),(1,4;3),(3,4;1) \n       (2,2;0),(2,2;2),(2,2;4),(2,4;2),(4,4;0) }\n\nIf we only keep the even labels, the above branching rules (<ref>) are the same as the branch rules for the S_3 model (<ref>). The data {F,d} satisfying (<ref>) are known and we refer the readers to Ref. BondersonThesis for details. \n\n\nThe model has 25 particles. Among these, there is one ℤ_2 abelian boson, which we denote ϕ=(4,0). The corresponding string operator is defined by the string parameter\n\n    w_ϕ(a)=(-i)^a.\n\nWe consider the string net obtained by condensing ϕ=(4,0).\n\nSince the string labels obey 2 × 4 = 4 × 2 = 2, the label 2 will split into two distinct string types after condensation, which we denote 2̃_1 and 2̃_2.  \n We first define ℋ̃ after condensation. Specifically, solving for the vertex coefficients A^4,a, we obtain:\n\n    A^41=1,   A^43=-1,   A^14=A^34=-i,\n    \n    \t(A^42)_1 = (A^24)_2 = 1,   (A^24)_1 =(A^42)_2 =- 1.\n\nThus, the new string labels for ℋ̃ are\n\n    0̃={0,4},  1̃={1,3},  2̃_1={2},  2̃_2={2}.\n\nThe new branching rules can be deduced from the old branching rules, together with Eq. (<ref>), and are given by\n\n    {(1̃,1̃;0̃),(1̃,1̃;2̃_1),(1̃,1̃;2̃_2),\n    \n    \t(1̃,2̃_1;1̃),(1̃,2̃_2;1̃),\n    \n    \t(2̃_1,2̃_1;2̃_2),(2̃_1,2̃_2;0̃),(2̃_2,2̃_2;2̃_1).\n    \t}\n\nThus, ℋ̃ is the string-net Hilbert space with new string labels (<ref>) and branching rules (<ref>).\n\nNext, we want to find {F,d} in the ϕ condensed phase.\nA valid choice of the full vertex coefficients is given by (<ref>), together with: \n\n    (A^11_2)_1   =-√(2),    (A^12_1)^1=-1/√(2),    (A^22_2)^1 1_2=1/√(2),\n    \n    \t(A^11_2)_2   =1,      (A^12_1)^2=1,      (A^22_2)^2 2_1=-2,\n\nwhere (A^12_1)^2=1 pertains to the vertex (1̃, 2̃_2; 1̃) and so on.  \nUsing these, and Eq. (<ref>), \nwe find the nontrivial new F-symbols are \n\n    F^1̃1̃1̃_1̃00=\n    \t\tF^1̃1̃1̃_1̃02̃_a=\n    \t\tF^1̃1̃1̃_1̃2̃_a0=-1/√(3),    \n    \t\t   F^1̃1̃1̃_1̃2̃_a2̃_b=-1/√(3)e^-i 2π ab/3,\n       F^1̃2̃_a 1̃_2̃_b1̃1̃=F^2̃_a1̃2̃_b_1̃1̃1̃=e^-i 2π ab/3,\n    \t\t     F^1̃2̃_a2̃_b_1̃1̃0=F^2̃2̃_b1̃_1̃01̃=-1.\n\nHere a≠ b=1,2. Interestingly, the data (<ref>) are exactly the ℤ_3 Tambara-Yamagami category<cit.> (TY_3). The TY_3 category has 4 labels [0]=0̃,[1]=2̃_1,[2]=2̃_2,σ=1̃. The first 3 labels have ℤ_3 fusion rules. The last label σ represents the symmetry defect:\n\n    [a]×σ   =σ\n    σ×σ   =[0]+[1]+[2].\n\nWith the data (<ref>), we can construct the ground state and effective string-net model for the ϕ condensed phase. The braiding data of excitations, the S, T matrices, are known in Ref. TYcatST.\n\nThus, condensing the ℤ_2 boson in the SU(2)_3 string net, we obtain the TY_3 string net.  In this case, because the input fusion category is modular, this transition is analogous to condensing the ℤ_2 boson in the top layer of an SU(2)_4 ×SU(2)_4 bilayer system.  The resulting topological order is SU(3)_1 ×SU(2)_4, which is exactly that of the TY_3 string net.  \n\n\n\n\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\nIn this paper, we have systematically studied condensation of arbitrary abelian bosons in string-net models.  We have introduced a Hamiltonian that tunes the system through a condensation transition, and given a detailed description of the string net in the condensed phase.   \nWe have shown how, in the low-energy Hilbert space of the condensed phase, the input fusion category 𝒞 of the uncondensed string net becomes a new fusion category 𝒞̃, with both the effective Hamiltonian and the  ground state in the condensed phase being 𝒞̃ string nets. Finally, we have shown how both the labels and the fusion data for 𝒞̃ can be calculated directly from the data of the string operators of the condensing bosons, together with the fusion data of 𝒞.  \n\nBecause the transitions discussed here involve condensation of abelian bosons, the degrees of freedom that become gapless at the critical point can all be mapped onto variables in a Potts model, using a method similar to that described in Ref. <cit.>.  By modifying H_1, one could also achieve phase transitions in the clock universality class.  \n\nOne useful result of our construction is the possibility of systematically extracting not only the label set, but also the fusion data of 𝒞̃, by solving for the vertex coefficients implied by the string operators W^a_ϕ^j.  \nWe note that Ref. Eliens similarly introduced vertex coefficients when studying the effect of anyon condensation on the fusion and braiding data of the UMTC describing the topological order, and used these to determine the F and R symbols for the condensed theory. \nThe vertex coefficients that we introduce here can be viewed as analogs of Ref. Eliens's vertex coefficients, albeit for the fusion category underpinning the string net, rather than for the UMTC associated with the anyon model itself.  \n\nOne potential application of our construction, illustrated in the last example, is to obtain the fusion data for string nets of lower symmetry by condensing anyons in string nets with higher symmetry.  For example, we can begin with a string net that has explicit time-reversal symmetry, such as SU(2)_4 ×SU(2)_4, and condense a chiral abelian boson in one of the two copies, to obtain a string net that does not have time reversal symmetry.  This is useful because the data for many high-symmetry string nets, such as those constructed from rational conformal field theories, is known.  \n\nA second potential application is to string nets realizing symmetry enriched topological phases, where the enriching symmetry is abelian.  Specifically, condensing ℤ_p abelian anyons can be viewed as “un-gauging\" a ℤ_p symmetry, and a modification of the construction here can lead to condensed phases in which the models exhibit a global ℤ_p symmetry, similar to the constructions of Refs. Heinrich16,ChengAPS.  Such a construction may enable a simpler string-net realization of many of these symmetries than in the existing literature.  It also gives a framework that could be used to construct similar models with anyon-permuting symmetry at the boundary of a three-dimensional Walker-Wang string net.  \n\n\n\n\n\nNote added Shortly before completing this work, we became aware of Ref. <cit.>, which also discusses anyon condensation in string net models, including some non-abelian examples.    \n\n\n\n§ ACKNOWLEDGMENTS\n\nC.-H. Lin thanks Lan Tian, Chenjie Wang, and Yidun Wan for helpful discussions.  FJB is grateful for the support of NSF DMR 1928166.\n\n\n\n\n\n\n\n\n\n§ PROPERTIES OF ABELIAN STRING OPERATORS \n\nIn this section, we prove the basic properties of our abelian string operators that we use in the main text.\n\n\n\n §.§ Finding a gauge where F-symbols are trivial\n\n\nMany of the properties of abelian string operators that we will use are valid only in the gauge where F (s^i, s^j, s^k) =1, where we use the notation F(a,b,c) = F^a b c_abc, ab, bc appropriate to F-symbols involving only abelian string labels.  To see that such a gauge exists, we use the fact that if ϕ = (s,m) to be a boson, then  w_ϕ(s) =1.  (We note that while w_ϕ(a) is not gauge invariant for general a, w_ϕ(s), which represents the self-twist of the particle, is a gauge-invariant quantity). \nFrom Eq. (<ref>), we see that\n\n    w_ϕ(s) w_ϕ(s^j) = F(s, s^j,s) w_ϕ (s^j+1)\n\nIf s^2 = 0 and j=1, F(s, s^j,s) is gauge invariant, and this tells us that only if F(s, s^j,s) =1 can (s,m) be a boson.  Otherwise, under gauge transformations, we have\n\n    F̂(s, s^j,s) = F(s, s^j,s)   f^s s^j_s^j+1/f^s^j s_s^j+1f^s^j+1 s_s^j+2/f^s s^j+1_s^j+2\n\nwhere our string net construction requires f^s 0_s = f^0 s_s = 1.  \nFor 1 ≤ j < p-1, we can use the ratio  f^s^j+1s _s^j+2 / (f^ss^j+1_s^j+2) to fix F(s, s^j, s) = 1, where s^p = 0.  \n Further, we have w_ϕ(s) w_ϕ(s^p-1) = F(s, s^p-1,s) w_ϕ (0), and hence also F(s, s̅, s) = 1, where s̅ = s^p-1.  \nIt follows that in this gauge, for all i,j, we have \n\n    F(s, s^i, s) = 1  ,    F(s,s^i, s^j ) F(s^i, s^j, s) = F(s^i, s, s^j)  .\n\n In this gauge, we see that w_ϕ(s^j) = 1 for all j. \n \nNext, consider F(s, s^j, s^k) with k>1.  \nUnder gauge transformations, we have:\n\n    F̂(s, s^j,s^k) = F(s, s^j,s^k)   f^s s^j_s^j+1/f^s s^j+k_s^j+k+1f^s^j+1 s^k_s^j+k+1/f^s^j s^k_s^j+k\n\nFor k>1, and a fixed choice of f^s s^i_s^i+1 for each i, we can set all of these to 1 by fixing the ratio f^s^j+1 s^k_s^j+k+1/f^s^j s^k_s^j+k.  (In this case, this also works for j= p-1).  \n\nThus, if w_ϕ(s) = 1, we have enough gauge freedom to simultaneously set F(s, s^j, s^k) = 1 for all j,k.  Using the pentagon relation, we also have\n\n    F(s,s^i, s^j) F(s,s^i+j, s^k) F(s^i, s^j, s^k)  \n    \n    = F(s^i+1, s^j, s^k) F(s, s^i, s^j+k)\n\nIn the gauge where F(s, s^j, s^k) = 1 for all j,k, we find that \n\n    F(s^i, s^j, s^k) = F(s^i+1, s^j, s^k)\n\nfrom which it follows that F(s^i, s^j, s^k) = 1 for all i,j,k.  \n\n\n\n\n\n\n §.§ Basic string operators in a general gauge\n\n\nThe gauge choice F(s^i, s^j, s^k) = 1 is convenient, because the action of the operator W_ϕ(P) is identical to acting with a string operator with a fixed end-point that is located away from the stick, and fusing it into the lattice appropriately.  With a different gauge choice, the difference between the operator W_ϕ(P) and such open string operators can be described by a gluing operator O_l,  \nwhose action is defined by\n\n    <-0.22in\n        < g r a p h i c s >\n    |O_l\n    \t   =F(a,s_1,s_2)<-0.22in\n        < g r a p h i c s >\n    | \n    <-0.22in\n        < g r a p h i c s >\n    |O_l\n    \t   =F(s_2,s_1,a)^-1<-0.22in\n        < g r a p h i c s >\n    | \n    <-0.22in\n        < g r a p h i c s >\n    |O_l\n    \t   =<-0.22in\n        < g r a p h i c s >\n    | \n    <-0.22in\n        < g r a p h i c s >\n    |O_l\n    \t   =F(s_2,a,s_1)<-0.22in\n        < g r a p h i c s >\n    |\n\nHere a denotes the string label of the stick,  and \nthe grey region denotes the configuration which does not change.\n\n\n\nIn addition, in this gauge, when taking the product W_ϕ^1^i · W_ϕ^2^i, we may ignore the vertical bendings of the jointed path p^i∪ p^j. For example, consider two basic string operators W_ϕ^1^i,W_ϕ^2^i along the same path p_i. When acting the composite operator W_ϕ^1^i · W_ϕ^2^i on the vacuum state, we have\n\n    vac|W_ϕ^1^i· W_ϕ^2^i   =\n    \t<-0.16in\n        < g r a p h i c s >\n    |\n       =<-0.16in\n        < g r a p h i c s >\n    |\n       =<-0.16in\n        < g r a p h i c s >\n    | θ_s_1,s_2\n       =vac|W_ϕ^1×ϕ^2^i ·θ_s_1,s_2\n\nwith\n\n    θ_s_1,s_2=F(s_2,s̅_2,s̅_1)/F(s_1,s_2,s̅_1×s̅_2).\n\nHere we use (<ref>) to remove the loop in the second line at the expense of the factor θ_s_1,s_2.\n\n\n\nThus, in a general gauge, we do not have W_ϕ^1^i· W_ϕ^2^i=W_ϕ^1×ϕ^2^i.\nInstead, we find:\n\n    W_ϕ^3=ϕ^1×ϕ^2,a_3b_3̅c_3d_3;ϕ^a×ϕ^3,ϕ^b×ϕ^3^i,abcd;ϕ^aϕ^b(efg)= \n                W_ϕ^1,a_1b_1̅c_1d_1;ϕ^a×ϕ^1,ϕ^b×ϕ^1^i,abcd;ϕ^aϕ^b(efg) ×\n                W_ϕ^2,a_3b_3̅c_3d_3;ϕ^a×ϕ^3,ϕ^b×ϕ^3^i,a_1b_1̅c_1d_1,ϕ^a×ϕ^1,ϕ^b×ϕ^1(efg) ×θ_s_1,s_2,a,b ^-1\n\nwith \n\n    θ_s_1,s_2,a,b=F(s_2,s̅_2,s̅_1)F(s̅_2,s̅_1,b)/F(s_1,s_2,s̅_1×s̅_2)F(a,s_1,s_2)\n\nfor i=1,…,4.\n\n\nIn addition, one can show that\n\n    W^i †, a'b'c'd';ϕ^a'ϕ^b'_ϕ,abcd;ϕ^aϕ^b  (efg)= \n                W^i,a'b'c'd';ϕ^a'ϕ^b'_ϕ̅,abcd;ϕ^aϕ^b(efg) ·θ_s,s̅,a,b^-1\n\nfor i=1,2,3,4.\n\n\n\n §.§ Properties of basic string operators in the gauge F(s^i, s^j, s^k ) = 1\n\n\nNext, we establish the properties of basic string operators in the gauge \n\n    F(s^i,s^j,s^k)=1   .\n\nFirst, from equations (<ref>,<ref>), we see that in this gauge,\n\n    W_ϕ^1^i· W_ϕ^2^i =W_ϕ^1+ϕ^2^i\n\nand\n\n    W_ϕ^i†=W_ϕ̅^i.\n\n\nSecond, all basic string operators commute:\n\n    [W_ϕ^i,W_ϕ'^j]=0.\n\nThis follows from Eq. (<ref>) if i=j (i.e. if the two paths are the same).  If the two paths intersect only on one stick (for example, i=1, j=3), this follows from the fact that using Eq. (<ref>), one can show that the two operator products differ by a factor of F(s^i, b× s, s^j), which is unity if b labels a stick.  If i=1, j=2, we can use the identity\n\n    w_ϕ(f) w_ϕ(s) = F^s f s_f”, f', f' w_ϕ(f × s)\n\nto show that w̅_ϕ(f) F^s f s_f”, f', f' = w̅_ϕ(f × s), which shows that [W_ϕ^1, W_ϕ^2] = 0.  We can use this, together with Eq. (<ref>),  to show that [W_ϕ^i^1, W_ϕ^j^2] = 0.  A similar argument shows [W_ϕ^i^3, W_ϕ^j^4] = 0.\n\nMoreover, in this gauge we have F^s s̅ b_b' 0 b' = w_ϕ(b) = 1 when b is a string label associated with the condensing boson.  It follows that W_ϕ^1 W_ϕ^3 = W_ϕ (p_1 ∪ p_3), where the path p_1 ∪ p_3 crosses straight under the b-labeled stick.  Similar results hold for other products of simple string operators with paths that overlap only on a single stick.  Using the identity (derived from Eq. (<ref>)) F^f s̅ s_f, f×s̅,0  F(s̅ s s̅) = F^f ×s̅, s, s̅_f ×s̅, f, 0, the product W_ϕ^1 W_ϕ̅^2  can similarly be shown to be equal to an operator running along the path (p_1 ∪ p_2), which directly connects the two sticks.  (The consistency relations ensure that any deformation of this path which does not change the end-points yields the same operator).   \n\nThus, in this gauge, we may express a general string operator by concatenating string operators along a series of adjacent basic paths.\n\n\n\n\n\n\n\n\n\n\n§ DIAGRAMMATICAL REPRESENTATION OF THE B_P^Φ,S OPERATOR \n\n\n\nIn this section, we present the graphical representation of B_p^ϕ,s in H_𝒞 (<ref>) which lead to the matrix elements in Eq. (<ref>), as well as an alternative (simpler) formulation\n\n\nThe action of B_p^ϕ,s in H_𝒞 is defined by\n\n    B_p^ϕ,s=∑_ϕ_10,ϕ_11,ϕ_12W_ϕ_10,ϕ_11,ϕ_12 B_p^s W^†_ϕ_10,ϕ_11,ϕ_12.\n\nwith\n\n    W_ϕ_10,ϕ_11,ϕ_12=𝒫_ϕ_10 W^1_ϕ_10·𝒫_ϕ_11 W^1_ϕ_11·𝒫_ϕ_12 W^3_ϕ_12.\n\nHere the sums run over three end spins states ϕ_10,ϕ_11,ϕ_12 in p. The 𝒫_ϕ_i=|ϕ_iϕ_i| is the projector to the end spin state |ϕ_i and W^1_ϕ_10,W^1_ϕ_11,W^3_ϕ_12 are three basic string operators defined in (<ref>). The B_p^s is defined to add a loop-s to the boundary of p after W_ϕ_10,ϕ_11,ϕ_12 moves the excitations {ϕ_10,ϕ_11,ϕ_12} to the exterior of p. Finally, after fusing the loop-s to the boundary of p, W^†_ϕ_10,ϕ_11,ϕ_12 moves back the excitations to p.\n\n\nDiagrammatically, the matrix elements of B_p^ϕ,s can be obtained by\n\n\n    <-0.32in\n        < g r a p h i c s >\n    |B_p^ϕ,s\n    \t=<-0.32in\n        < g r a p h i c s >\n    |\n    \tW_ϕ_10,ϕ_11,ϕ_12 B_p^s W^†_ϕ_10,ϕ_11,ϕ_12\n    \t=C_1 <-0.32in\n        < g r a p h i c s >\n    | B_p^s W^†_ϕ_10,ϕ_11,ϕ_12\n       =C_1 <-0.32in\n        < g r a p h i c s >\n    | W^†_ϕ_10,ϕ_11,ϕ_12\n    \t=C_1 ∑_i_1'i_2'…_6' C_2_a<-0.32in\n        < g r a p h i c s >\n    | W^†_ϕ_10,ϕ_11,ϕ_12\n       =C_1 ∑_i_1'i_2'…_6' C_2_a C_2_b<-0.32in\n        < g r a p h i c s >\n    |  W^†_ϕ_10,ϕ_11,ϕ_12\n    \t=C_1 ∑_i_1'i_2'…_6' C_2_a C_2_b C_2_c<-0.32in\n        < g r a p h i c s >\n    | W^†_ϕ_10,ϕ_11,ϕ_12\n       =C_1 ∑_i_1'i_2'…_6' C_2_a C_2_b C_2_c C_3 <-0.32in\n        < g r a p h i c s >\n    | \n    \t≡∑_i_1'i_2'…_6'<-0.32in\n        < g r a p h i c s >\n    | B^s,i_1… i_6j_1… j_6_p,i'_1… i'_6j'_1… j'_6(e_1… e_12;ϕ_10,ϕ_11,ϕ_12)\n\nwhere\n\n    B^s,i_1… i_6j_1… j_6_p,i'_1… i'_6j'_1… j'_6(e_1… e_12;ϕ_10,ϕ_11,ϕ_12)=C_1C_2_a C_2_b C_2_c C_3\n\nwith\n\n    C_1=W^1,e_10e_13 j_4e_4;ϕ_10ϕ_13_ϕ̅_10,0e_13' i_4e_4';1ϕ_13'(i_4j_3f_4)\n    \t\tW^1,e_14 e_11e_6i_5;ϕ_14ϕ_11_ϕ_11,e'_140e_6'j_5;ϕ_14'1(f_6j_6j_5)\n             ×  W^3,e_15 e_12e_1i_6;ϕ_15ϕ_12_ϕ_12,e_15'0e_1' j_6;ϕ_15'1(f_1i_1j_6)\n       C_2_a C_2_b C_2_c=\n    \t\t1/d_s√(d_i'_1d_j_2d_i'_3d_j_3d_i'_4d_j_5d_j'_6/d_e'_1d_j'_2d_i_3d_e'_4d_j'_5)×\n            [F^i'_1e_7_s̅j_1]_i_1j'_1[F^j'_1e_2_s̅i_2]_j_1i'_2[F^i'_2e_8_s̅j_2]_i_2j'_2\n    \t\t[F̃_s̅j_2^i'_3e_3]_i_3j'_2\n    \t\t[F^i'_3e_9_s̅j_3]_i_3j'_3×\n            [F^j_5s_e_5i'_4]_i_4j'_5\n    \t\t[F̃_e_6'j'_6^j_5s]_j_6j'_5\n    \t\t[F̃_j_60^j'_6s̅]_sj_6\n    \t\t[F^i'_4s̅_i_40]_si_4\n    \t\t[F^j_6i_1_j'_6i'_1]_s̅e_1'\n    \t\t[F̃_i'_4j'_3^i_4j_3]_s̅e_4'\n       C_3=\n    \t\tW_ϕ_10,e_10e_13 j'_4e_4;ϕ_10ϕ_13^1 ,0e_13'i'_4e_4';1ϕ_13'(i'_4j'_3f_4) \n             × \n    \t\t W_ϕ̅_11,e_14 e_11e_6i'_5;ϕ_14ϕ_11^1 ,e_14'0e_6'j'_5;ϕ_14' 1(f_6j'_6j'_5) \n             ×   W_ϕ̅_12,e_15 e_12e_1i'_6;ϕ_15ϕ_12^3 ,e_15'0e_1'j'_6;ϕ_15'1(f_1i'_1j'_6)\n\nwhere ϕ'_13 = ϕ_13×ϕ_10, and similarly for ϕ'_14, ϕ'_15.  Each product is unique because all stick labels have abelian fusion rules.  \nHere e_7,e_8… e_12 take values in abelian string types and thus j_p=i_p× e_p+6 for p=1…6 while e_1'=e_1× e_12,f_1' = f_1 × e_12, e_4'=e_4×e̅_10, f_4'=f_4×e̅_10, e'_6=e_6× e_11 and f'_6=f_6× e_11. \nThe functions W^1,abcd;ϕ^aϕ^b_ϕ,a'b'c'd';ϕ^a'ϕ^b'(efg),W^3,abcd;ϕ^aϕ^b_ϕ,a'b'c'd';ϕ^a'ϕ^b'(efg) are defined in (<ref>), and we have used the fact that (W^j_ϕ)^† = W^j_ϕ̅. \nBy using (<ref>) to simplify (<ref>), we obtain B^s,i_1… i_6j_1… j_6_p,i'_1… i'_6j'_1… j'_6(e_1… e_12;ϕ_10,ϕ_11,ϕ_12) in Eq. (<ref>).\n\n\n\n §.§ Simplified condensation Hamiltonian for string nets constructed from braided fusion categories\n\n\nWhen the fusion category used to construct the string net is itself an anyon model, a somewhat simpler formulation can be used to describe certain condensation transitions.  We include it here as it may be of interest for, e.g., numerical studies <cit.>.   \nThe existence of a braiding means that in addition to the rules (<ref>), the string labels also obey rules to determine what happens when an a-labeled string crosses over or under a b-labeled one:\n\n    < g r a p h i c s >\n\nIn these models, if the string net labels correspond to anyons described by a unitary modular tensor category 𝒞, then the particle-like excitations of the string net are anyons in the category 𝒞×𝒞 – i.e. the string net realizes two copies of the anyon model, with opposite chiralities.  The bosons a ×a are plaquette defects<cit.>, and can be condensed as described in Ref. <cit.>.  Using the original string-net construction, however, a boson a (a), corresponding to an anyon in the category 𝒞 (𝒞), violates both vertex and plaquette terms.  However, using a modification of the \n Walker-Wang construction of 3D string nets<cit.>, it is rellatively straightforward to construct a modified plaquette term for which open string operators creating these anyons commute with all plaquette terms.  \n \n When the condensing anyons are all from 𝒞, we can do this in the generalized string-net Hilbert space depicted in Fig. <ref>, and impose the constraint that at each trivalent vertex in the new lattice, the combination of edge labels is allowed by fusion.   As in the construction outlined in the main text, we energetically penalize any sticks carrying a label other than the identity.  \n  Finally, we modify the plaquette operator's action on configurations where the sticks carry non-trivial labels, to ensure that B_p commutes with open string operators ending on the sticks.    This can be done by threading the loop carrying the plaquette label under  all sticks, and using the fusion and braiding rules (<ref>,<ref>) to resolve the diagram and obtain the matrix elements, using exactly the same procedure as in the 3D Walker-Wang string net models (see <cit.>).  Intuitively, this construction can be viewed as starting from a single layer of the Walker-Wang Hamiltonian, with a smooth lower boundary (see <cit.>),  and open vertical edges extending upwards out of the plane.  In the full 3D construction, our sticks thus correspond to edges of vertical plaquettes, and anyon condensation is achieved by adding “half-plaquette\" operators along these vertical plaquettes.  Commutativity of adjacent plaquette operators, as well as of plaquette operators with the anyon string operators corresponding to adding such vertical plaquettes, follows from commutativity of the full Walker-Wang Hamiltonian.  \n  \n\nSimilarly, to condense a set of bosons that are all from 𝒞, we reverse the procedure above, drawing a Walker-Wang model with a smooth upper boundary, and keeping half-plaquettes extending downwards from this plane.  In this case, plaquette operator matrix elements are obtained by drawing the plaquette loop over the sticks, and then using appropriate fusion and braiding rules.  Condensing some anyons in 𝒞, and some in 𝒞, can similarly be achieved by adding two sticks on each edge, one extending above the plane, and one below it.  \n\nThe procedure for identifying string net data in the condensed phase using this construction is exactly analogous to that of the more general construction outlined in the main text.  \n\n\n\n§ SHOWING THAT B_P_1^Φ,T_1,B_P_2^Φ,T_2 COMMUTE \n\nIn this section, we will show that the operators B^ϕ,t_1_p_1 and B^ϕ,t_2_p_2 commute with one another. We only need to consider two cases. One case is when two plaquettes are the same p_1=p_2. The other case is when p_1 and p_2 are adjacent since two operators will commute if p_1 and p_2 are further apart.\n\nThe first case is when two B_p^ϕ,t operators act on the same plaquette p_1=p_2=p. We will show B_p^ϕ,t_1 and B_p^ϕ,t_2 commute if the branching rules δ^t_1,t_2_u are symmetric in t_1,t_2.\nWe note that B_p^ϕ,t_1B_p^ϕ,t_2=∑_ϕ_10,ϕ_11,ϕ_12 W_ϕ_10,ϕ_11,ϕ_12 B_p^t_1B_p^t_2 W^†_ϕ_10,ϕ_11,ϕ_12. Thus, to show that B^ϕ,t_1_p,B^ϕ,t_2_p commute, it is sufficient to show that B^t_1_p, B^t_2_p commute.\n\n\nTo this end, we compute\n\n    -0.22in\n        < g r a p h i c s >\n    |    B_p^t_1B_p^t_2\n    \t\t=-0.22in\n        < g r a p h i c s >\n    | \n       =∑_u,u'-0.22in\n        < g r a p h i c s >\n    | √(d_u d_u')/d_t_1d_t_2\n       =∑_u-0.22in\n        < g r a p h i c s >\n    |\n    \t\t|[F^t_1t̅_1_uu̅]_t̅_20|^2 \n    \t\t|[F^ut̅_2_t_10]_t_2t_1|^2 \n    \t\td_t_1 d_u/d_t_2\n       =∑_uδ^t_1 t_2_u-0.22in\n        < g r a p h i c s >\n    |\n\nHere we use |[F^t_1t̅_1_uu̅]_t̅_20|^2=d_t_2/d_t_1d_u and |[F^ut̅_2_t_10]_t_2t_1|^2=|F^t_1t_2t̅_2_t_1u0|^2d_t_1d_t_2/d_u=δ^t_1t_2_u from (<ref>). Thus, we have\n\n    B_p^t_1B_p^t_2=∑_uδ^t_1 t_2_uB^u_p.\n\nIf δ^t_1 t_2_u is symmetric in t_1,t_2, then B_p^t_1B_p^t_2=B_p^t_2B_p^t_1 and thus B^ϕ,t_1_p,B^ϕ,t_2_p commute.\nIn general, δ^t_1 t_2_u is not symmetric in t_1,t_2 and thus B^ϕ,t_1_p,B^ϕ,t_2_p do not commute.\n\n\n\n\nThe second case is when the two B_p^ϕ,t operators act on two adjacent plaquettes p_1,p_2. We want to show that B_p_1^ϕ,t_1B_p_2^ϕ,t_2=B_p_2^ϕ,t_2B_p_1^ϕ,t_1. \nTo show this, we write down the matrix elements of the operators on each side by (<ref>) and then show they are equal. \nIn fact, it is sufficient to compare the factors for the two operations which are different. These factors depend on the spin states on the shared boundary between p_1,p_2 (see Fig. <ref>). \n\nSpecifically, we write down the factors which are different. First, the action of B_p_1^ϕ,t_1B_p_2^ϕ,t_2 on the shared boundary contributes the factors\n\n    ∑_a”b”a”'b”'w_ϕ(a”)/w_ϕ(a)[F̃^sa”_bt_2]_ab”[F^a”'s_t_1b”]_a”b”\n\nSecond, the action of B_p_2^ϕ,t_2B_p_1^ϕ,t_1 on the shared boundary contributes the factors\n\n    ∑_a'b'a”b”a”'b”'w_ϕ(a”')/w_ϕ(a')[F̃^sa”'_b't_2]_a'b”'[F^a's_t_1b]_ab'\n    \tF^t_1at_2_a”'a'a”F̃^t_1bt_2_b”'b'b”.\n\nHere x'=x × t_1,x”=x × t_2,x”'=x × t_1 × t_2 for x=a,b and a+s=b.\nAll we need is to show that (<ref>) = (<ref>).\n\nTo this end, we use (<ref>) and (<ref>) to simplify (<ref>) and (<ref>) as\n\n    ∑_a”b”a”'b”' w_ϕ(t_2)F^ast_2_b”bt'_2(F^t_1a”s_b”'a”'b”)^*/F^at_2s_b”a”t'_2.\n\nand\n\n    ∑_a'b'a”b”a”'b”'w_ϕ(t_2) F^a'st_2_b”'b't'_2 F^t_1at_2_a”'a'a” (F^t_1as_b'a'b F^t_1bt_2_b”'b'b”)^*/F^a't_2s_b”'a”'t'_2\n\nrespectively. Here t_2'=t_2+ s.\n\nThe next step is to simplify (<ref>) further. By using the two pentagon identities\n\n    F^a'st_2_b”'b't'_2F^t_1at'_2_b”'a'b”=F^t_1as_b'a'bF^t_1bt_2_b”'b'b”F^ast_2_b”b't'_2\n    \n    \tF^t_1at'_2_b”'a'b”F^a't_2s_b”'a”'t'_2=∑_hF^t_1at_2_a”'a'hF^t_1 h s_b”'a”'b”F^at_2s_b”ht'_2\n\nand the unitary conditions\n\n    ∑_b'F^t_1bt_2_b”'b'b”(F^t_1bt_2_b”'b'b”)^*=1 \n    ∑_a'F^t_1at_2_a”'a'a”(F^t_1at_2_a”'a'h)^*=δ_a”h,\n\nwe can show (<ref>)=(<ref>). This completes the proof that the B_p_1^ϕ,t_1,B_p_2^ϕ,t_2 terms commute with one another.\n\n\n\n\n\n\n\n§ SHOWING THAT [B_P^Φ,S,W_Φ^I]=0 \n\nIn this section, we show that B_p^ϕ,s and W_ϕ^i commute with one another. For our purpose, it is sufficient to show they commute in the gauge (<ref>). In fact, we check that B_p^ϕ,s and W_ϕ^i commute in any gauge.\n\n\n\n\n\nIt suffices to show that the basic string operators W_ϕ^i^k commute with B_p^ϕ,s since any W_ϕ^i can be constructed by gluing the basic string operators along the path.\nThus, we only have to consider the case when the basic string operators W_ϕ^i^k are around the vertices surrounding the plaquette p since it is clear that two operators commute if they are further apart.\n\nThere are two independent basic string operators which act around each vertex surrounding the plaquette p (see Fig. <ref>(a)). We need to show all 12 basic string operators commute with B_p^ϕ,s. Among 12 string operators, there are 6 string operators like W_ϕ^i^4, whose ends lie outside p, 4 string operators like W_ϕ^i^1 which intersect p and 2 string operators like W_ϕ^i^2 whose ends lie inside p. We will show that W_ϕ^i^4,W_ϕ^i^1, W_ϕ^i^2 commute with B_p^ϕ,s. In a similar way, one can show other basic string operators also commute with B_p^ϕ,s. \n\n\n\nFirst, we want to show that W^4_ϕ^i B_p^ϕ,s =  B_p^ϕ,s W^4_ϕ^i (see Fig. <ref>(b)). To show this, we write out their matrix elements and compare the factors which are different. Specifically, we need to show that the product from the left of the equation\n\n    W_ϕ^i,k_ir_i̅m_iq_i^4,krmq(pnt) W_ϕ^l,k_i+l0m_i+ln_l^3,k_ilm_in(pq_if)×\n       W_ϕ^l,k_ilm_in_s^3†,k_i+l0m_i+lf_s(pq_i+s̅f_s) (F^s̅q_ir_i̅_t_sq_i+s̅tF^f_ss̅q_i_m_i+l+sfq_i+s̅)^*\n\nand the product from the right\n\n    W_ϕ^i,k_ir_i̅m_iq_i+s̅^4,krmq_s̅(pn_st_s̅) W_ϕ^l,k_l0m_ln_l^3,klmn(pqf)×\n       W_ϕ^l,klmn_s^3†,k_l0m_lf_s(pq_s̅f_s) (F^s̅qr_t_sq_s̅tF^f_ss̅q_m_l+sfq_s̅)^*\n\nare equal.\nHere x_y=x+y and the matrix elements of W_ϕ^k are defined in (<ref>).\nBy using (<ref>) to write W_ϕ^k† in terms of W_ϕ̅^k and (<ref>,<ref>) to write w in terms of F symbols, we can then show they are equal by (<ref>).\n\n\nSecond, we want to show that W^1_ϕ^i B_p^ϕ,s =  B_p^ϕ,s W^1_ϕ^i (see Fig. <ref>(b)). Again, we write down the matrix elements of both sides of the equation and compare the difference between the two. Specifically, from the left is the product\n\n    W^1,abcd_ϕ^i,a_ib_i̅c_id_i(efg)\n    \t\tW^1,a_ib_i̅c_id_i_ϕ^b+ϕ̅^i,a_b0c_bd_b(efg)W^1†,a_b0c_bd_b+s_ϕ^b+ϕ̅^i,a_ib_i̅c_id_i+s(ef_sg_s)\n\nwhile from the right is the product\n\n    W^1,abcd_ϕ_b,a_b0c_bd_b(efg)W^1†,a_b0c_bd_b+s_ϕ_b,abcd_s(ef_sg_s)\n    \t\tW^1,abcd_s_ϕ^i,a_ib_i̅c_id_i+s(ef_sg_s)\n\nWriting everything in terms of F symbols by (<ref>, <ref>, <ref>), one can show they are equal by (<ref>).\n\nThird, we want to show that W^2_ϕ^i B_p^ϕ,s =  B_p^ϕ,s W^2_ϕ^i (see Fig. <ref>(b)). We write down the their matrix elements and compare the difference. Specifically, from the left we have\n\n    W^2,nbfd_ϕ^i,n_ib_i̅f_id_i(pcg)\n    \tW^1,ab_i̅cd_i_ϕ^b+ϕ̅^i,a_b+i̅0c_b+i̅d_b(ef_ig) ×\n       W^3,mn_i0p_ϕ^n+ϕ^i,m_n+i0o_n+ip_n+i(qrf_i) \n    \tW^1†,a_b+i̅0c_b+i̅g_s_ϕ^b+ϕ^i,ab_i̅cd_i+s(ef_i+sg_s) ×\n       W^3†,m_n+i0o_n+if_i+s_ϕ^n+ϕ^i,mn_i0p_s(qr_s̅f_i+s)\n    \tF^c_b+i̅f_is_g_sgf_i+s\n    \tF^f_iss̅_f_if_i+s0\n    \t(F^f_i+ss̅r_o_n+if_i r_s̅)^*\n\nand from the right we have\n\n    W^1,abcd_ϕ^b,a_b0c_bd_b(efg)\n    \t\tW^3,mnop_ϕ^n,m_n0o_np_n(qrf)\n       W^1†,a_b0c_bd_b+s_ϕ^b,abcd_s(ef_sg_s)\n    \t\tW^3†,m_n0o_np_n+s_ϕ^n,mnop_s(qr_s̅f_s)\n       W^2,nbf_sd_s_ϕ^i,n_ib_i̅f_i+sd_i+s(p_scg_s)\n    \t\tF^c_bfs_g_sgf_s\n    \t\tF^fss̅_ff_s0\n    \t\t(F^f_ss̅r_o_nf r_s̅)^*.\n\nSimilarly, by a straightforward but tedious computation, one can show they are equal by (<ref>).\n\n\n\n\n§ CONSISTENCY OF SOLUTIONS FOR VERTEX COEFFICIENTS IN THE PRESENCE OF SPLITTING\n \n\nIf a^r = a and c^r = c, then a W^1_ϕ^jr operator at a vertex (a, b; c) does not change the labels about this vertex; its only effect is to change the labels of the two adjacent sticks.  Thus, we obtain:\n\n    A^a s^(i+j) r A^c s^(k-j) r A^a b_c  =   A^a s^i r A^c s^k r A^a b_c  w̅_ϕ^jr(b) F^ a b s^ j r_c c b^jr (F^ a s^ j r b_c a b^jr )^* \n       × F^a s^i r  s^j r_a a s^(i+j) r ( F^ c s^jr s^(k-j)r_c c s^k r  )^*\n\nwhere we have used the gauge (<ref>).  If A^ab_c is non-zero, this can be true only if the coefficient does not depend on b.\n\nSimilarly, applying a W^2_ϕ^jr operator at a vertex (b, a; c), we obtain:\n\n    A^a s^(i+j) r A^c s^(k-j) r A^ ba_c  =   A^a s^i r A^c s^k r A^ b a _c  F^ b a s^ j r_c c b^jr\n       × F^a s^i r  s^j r_a a s^(i+j) r ( F^ c s^jr s^(k-j)r_c c s^k r  )^*\n\n\nFinally, applying W^2_ϕ^-jr W^1_ϕ^jr to a vertex (a,c; b) with a s^r= a and c s^r = c gives:\n\n    A^a s^(i+j) r A^c s^(k-j) r A^ ac_b  =   A^a s^i r A^c s^k r A^ ac _b  w̅_ϕ^jr(c) (F^ c s^jr s^- j r_c c 0)^*  \n       × (F^a s^jr c_b a c)^* F^a s^i r  s^j r_a a s^(i+j) r F^ c s^kr s^-jr_c c s^(k-j) r\n\n\nSimilar equations appear about downward-oriented vertices, involving the string operators W^3_ϕ^lr, W^4_ϕ^lr; however these do not impose any new conditions required for consistency.  \n\nWe now show that the coefficients identified above are independent of b for different choices of b that are related by fusion with s^rj.  Iterating this, we see that the coefficients are the same for any b in the fusion orbit of s^jr.  In particular, for j=1 we see that the coefficient is the same for any b in the fusion orbit of s^r.  Moreover, the string operator W^i_ϕ^jr =( W^i_ϕ^r)^j; hence we conclude that, or any j, the coefficients in Eqs. (<ref>- <ref>) are the same for  all b in the fusion orbit of s^r, and for any j.\n\n We begin with Eq. (<ref>).  Using Eq. (<ref> a), we find\n\n    F^ a s^j r b_c a b^jr F^a b^jr s^jr_c c b^2jr F^s^jr b s^jr_b^2jr b^jr b^jr \n    =F^ab s^jr_c c b^jr F^ a s^jr b^jr_c a b^2jr  .\n\nNext, we multiply  both sides of the equation by w_ϕ^jr(b^(jr)), and use Eq. (<ref>) to see that\n\n    w_ϕ^jr(b) w_ϕ^jr(s^jr) = w_ϕ^jr(b^(jr)) F^s^jr b s^jr_b^2jr b^jr b^jr .\n\nSince w_ϕ^jr(s^jr)  = 1, we thus find: \n\n    w_ϕ^jr(b)F^ a s^j r b_c a b^jr (F^ab s^jr_c c b^jr )^*\n    = w_ϕ^jr(b^(jr))F^ a s^jr b^jr_c a b^2jr( F^a b^jr s^jr_c c b^2jr)^*   .\n\nIterating this result, we see that the coefficient is the same for all choices of b in the same fusion orbit of s^r.  \n\n Next, consider Eq.  (<ref>).  Eq. (<ref> a) stipulates:\n\n    F^s^jr b a _c b^jr c F^s^jr c s^kr_c c c F^b a s^kr_cca = F^b^jr a s^kr_c c a F^s^jr b a_c b^jr c\n\nFurther, since s^jr c = c, we have\n\n    w_ϕ^jr(c) w_ϕ^jr(s^kr) =   F^s^jr c s^kr_c c c  F^ c s^kr s^jr_c c s^(k+j)r/F^c s^jr s^kr_c c s^(k+j)rw_ϕ^jr(c)\n \nand hence F^s^jr c s^jr_c c c = 1.  \nIt follows that F^b a s^jr_cca = F^b^jr a s^jr_c c a, and the coefficient is the same for any b in the fusion orbit of s^jr.  \n\nFinally, consider Eq. (<ref>).  We have simplified the coefficient on the right-hand side as follows.  Similar to Eq. (<ref>), the product of W^2_ϕ^-jr W^1_ϕ^jr on the vertex (a,c; b) can be expressed \n\n    w̅_ϕ^jr(c)  F^ a c s^jr_b^jr b c ( F^a s^jr c_b^jr a c )^* (F^b s^jr s^t-jr_b^t b^jr s^t)^* (F^b^jr s^-jr s^t_b^t b s^t - jr)^* F^a c s^-jr_b b^jr c\n       × F^a s^i r  s^j r_a a s^(i+j) r F^ c s^kr s^-jr_c c s^(k-j) r\n\n where the stick on the a edge initially carries the label s^ir, that on the c edge carries a label s^kr, and that on the b edge carries s^t.  \n \nHowever, we can use Eq. (<ref>) to show that when a s^r = a and c s^r = c, \n\n    F^b^jr s^-jr s^t_b^-t b s^t - jr F^b s^jr s^t-jr_b^-t b^jr s^t = F^b s^jr s^-jr_b b^jr 0 F^ s^jr s^-jr s^t_s^t 0 s^t-jr\n \nand\n\n    F^ a c s^jr_b^jr b c  F^a c s^-jr_b b^jr c F^c s^jr s^-jr_c c 0 =  F^b s^jr s^-jr_b b^jr 0\n \nThus, in the gauge (<ref>), Eq. (<ref>) can be simplified to give:\n\n    w̅_ϕ^jr(c)   ( F^a s^jr c_b^jr a c )^*  (F^c s^jr s^-jr_c c 0)^*\n\nWe can show that the coefficient is the same for any b in the fusion orbit of s^jr:\n\n    F^a s^jr c_b a c F^a c s^jr_ b^jr b c F^s^jr c s^jr_c c c = F^a c  s^jr_b^jr  bc  F^a s^jr c_b^jr a c\n \nCancelling the redundant factors on both sides, and noting that  by Eq. (<ref>), F^s^jr c s^jr_c c c =1, we see that F^a s^jr c_b a c =  F^a s^jr c_b^jr a c, and again by iterating we find our result.  \n\n\nNow, if b is an abelian particle, and a × s^r = a, c × s^r = c, then a × c = ∑_j b^jr + ..., where ... cannot contain b^l for l ≠ jr.  This follows from the cyclic property of the branching rules.  Suppose (a,c; b) and (a,c; b^j) are allowed by the branching rules.  Then so are (c, b̅^-j; a) and (b̅^-j, a; c̅).  However, if b^j = b × s^j = s^j × b, then we must also have (b̅, a; c̅^j).  If j = l r then c̅^j = c̅, and the outcome of fusing b̅ with a is unique.  Otherwise, however, we see that fusing b̅ with a can have at least two different outcomes; hence b is not an abelian string label.  In particular, if b = s^j, it follows that all equations associated with acting with string operators s^jr on the vertices (a,s^j; a), (s^j, a; a), and (a, a̅; s^j) are consistent.  This allows us to solve for the coefficients A^a s^j.\n\nIn general, however, vertices of the form (for example) (b, a;c) and ( g,a; c), where g ≠ b s^j, can lead to multiple equations of the form (<ref>), which relate the same pairs of coefficients A^a s^(i+l) r,A^c s^(k-l) r to  A^a s^i r A^c s^k r.  If F^ b a s^ l r_c c b^lr≠ F^ g a s^ l r_c c g^lr, these equations are mutually inconsistent unless we choose either A^ba_c = 0 or A^ga_c = 0.  The resolution to this is to recognize that since both a and c split, there are multiple non-zero choices for the coefficient: A^ba_c =(A^ba_c)_ij, denoting a choice of ã_i and c̃_j.   For a given b, we find that the coefficient F^ b a s^ l r_c c b^lr takes on at most p/r distinct values (and similarly for other vertices); hence we expect to find at least one non-zero (A^ba_c)_ij for each i.  \n\n\n\n\n\n §.§ Relations between coefficients A^a s^jr when a^r = a\n \n\nSuppose a^r = a.  Eq. (<ref>a) gives:\n\n    F^a s^lr s^jr_a a s^(l+j)r F^a s^(l+j)r s^k r_a a s^(l+j+k)r F^s^lr s^jr s^k r_s^(l+j+k)r  s^(l+j)r  s^(j+k)r\n     = F^a s^jr s^kr_a a s^(j+k)r F^a s^lr s^(j+k)r_a a s^(l+j+k)r\n\nIn our gauge of choice, taking j → j-1 and k=1 in the above expression gives\n\n    F^a s^lr s^jr_a a s^(l+j)r \n    =  F^a s^lr s^(j-1)r_a a s^(l+j-1)r F^a s^(l+j-1)r s^ r_a a s^(l+j)r/F^a s^(j-1) r s^r_a a s^jr\n\n\nUsing this expression repeatedly, we can show that\n\n    F^a s^lr s^j r_a a s^(l+j)r   = (  ∏_k = 0^j-1 F^a s^(l+k)r s^r_a a s^(l+k+1)r/∏_k = 1^j-1 F^a s^kr s^r_a a s^(k+1)r )  \n       = (  ∏_k = l^l+j-1  F^a s^k r s^r_a a s^(k+1)r/∏_k = 1^j-1 F^a s^kr s^r_a a s^(k+1)r )\n\nFrom this, we see that \n\n    F^a s^lr s^j r_a a s^(l+j)r/  F^a s^jr s^l r_a a s^(l+j)r   = (  ∏_k = l^l+j-1  F^a s^k r s^r_a a s^(k+1)r/∏_k = j^l+j-1  F^a s^k r s^r_a a s^(k+1)r )   (  ∏_k = 1^l-1 F^a s^kr s^r_a a s^(k+1)r/∏_k = 1^j-1 F^a s^kr s^r_a a s^(k+1)r )\n\nWithout loss of generality, assume that l>j.  Then: \n\n    (  ∏_k = l^l+j-1  F^a s^k r s^r_a a s^(k+1)r/∏_k = j^l+j-1  F^a s^k r s^r_a a s^(k+1)r )    =1/∏_k = j^l-1  F^a s^k r s^r_a a s^(k+1)r\n     (  ∏_k = 1^l-1 F^a s^kr s^r_a a s^(k+1)r/∏_k = 1^j-1 F^a s^kr s^r_a a s^(k+1)r )     = ∏_j^l-1 F^a s^k r s^r_a a s^(k+1)r\n\nso that \n\n    F^a s^lr s^j r_a a s^(l+j)r =   F^a s^jr s^l r_a a s^(l+j)r\n \n\n\n\nFurther, from the expression (<ref>),\n\n    (A^a s^n  r)_μ    = (A^a s^ r )_μ^n ∏_k=1^n-1 ( F^a s^k r s^ r_a a s^(k+1) r )\n\nwe see that \n\n    (A^a s^(j+l)  r)_μ/(A^a s^l  r)_ν    =  (A^a s^ r )_μ^j+l/(A^a s^ r )_ν^l ∏_k=1^j+l-1 ( F^a s^k r s^ r_a a s^(k+1) r )  /∏_k=1^l-1 ( F^a s^k r s^ r_a a s^(k+1) r )  \n        =  (A^a s^ r )_μ^j+l/(A^a s^ r )_ν^l ∏_k=l^j+l-1 ( F^a s^k r s^ r_a a s^(k+1) r )\n \nHence: \n\n    (A^a s^(j+l)  r)_μ/(A^a s^l  r)_ν (A^a s^j  r)_ρ    =  (A^a s^ r )_μ^j+l/(A^a s^ r )_ν^l (A^a s^ r )_ρ^j∏_k=l^j+l-1 ( F^a s^k r s^ r_a a s^(k+1) r )  /∏_k=1^j-1 ( F^a s^k r s^ r_a a s^(k+1) r )  \n        =  (A^a s^ r )_μ^j+l/(A^a s^ r )_ν^l (A^a s^ r )_ρ^j F^a s^lr s^j r_a a s^(l+j)r\n \nwhere in the last line, we have used Eq. (<ref>).  Evidently, if all factors come from the same solution (i.e. μ = ν = ρ), then the right-hand side is simply F^a s^lr s^j r_a a s^(l+j)r.  \n\n\n\n §.§ Vertices where multiple labels split\n\n\n\n  \n\nFor vertices where multiple labels split (and none of the labels are a power of s), we must address two questions.  First, is it the case that for every choice of b, there exists at least one pair (μ, ν) for which Eq. (<ref>) can be satisfied?  If not, we must conclude that at least one of the particles a,b, or c must be confined.  \n\nRecall that if s^q=1, then if w_ϕ^q(b) ≠ 1, n b does not correspond to any label in our effective Hilbert space; hence in this case we must set (A^ab_c)^μ_ν = 0 for all μ,ν.   \nWhen w_ϕ^q(b) = 1,  W^1_ϕ^q acts as the identity operator at the vertex (a,b;c), since it is an excitation of the form (0,m) which does not involve any fusion.  \nApplying the operator W^1_ϕ^r q/r times, in the gauge (<ref>) we obtain the matrix element\n\n    M_1(a,b,c))^q/r( ∏_k=1^q/r-1 F^a s^kr s_a a s^(k+1)r) ) ( ∏_k=1^q/r-1 (F^c s^r s̅^kr_c c s̅^(k-1)r)^* )\n\nSince W^1_ϕ^q = ( W^1_ϕ^r)^q/r, it follows that: \n\n    ( M_1(a,b,c))^q/r =  ( ∏_k=1^q/r-1 (F^a s^kr s_a a s^(k+1)r)^*  ) ( ∏_k=1^q/r-1 (F^c s^r s̅^kr_c c s̅^(k-1)r) )\n\n hence M_1(a,b,c) is a q/r^th root of the product \non the right-hand side.  Now, A^a s^r is a q/r^th root of ∏_k=1^q/r-1( F^a s^kr s^r_a a s^(k+1)r)^*, while A^c s^r is a q/r^th root of ∏_k=1^q/r-1 (F^c  s^krs^r_c c s̅^(k+1)r)^* =  (  ∏_k=1^q/r-1 F^c s^r  s̅^k r_c c s^(k+1)r)^-1, where we have used Eq. (<ref>). Thus A^a s^r/A^c s^r is also a q/r^th root of the product on the right-hand side.  It follows that for every b, there exists at least one choice of μ, ν for which Eq. (<ref>) is satisfied – in which case it is also satisfied for b^kr, 0 ≤ k < q/r.  \nThis suggests that for a fixed M_1(a,b,c) of modulus 1, we expect q/r distinct solutions A_μ^a s^r/A_ν^c s^r =M_1(a,b,c)e^ 2 π i n r/q, 0 ≤ n < q/r.   \n\n\nAt this point, it is worth commenting on the fusion rules of the new theory.  In the most general case, we have\n\n    (∑_μ =1^q/rã_μ ) × (∑_ν =1^q/rc̃_ν ) = q/r∑_b̃ | b × s^r ≠ b  c_b b̃  + ∑_d̃| d × s^v = d∑_λ c_d,λd̃_λ .\n \nThe first sum contains any terms that do not split, and the second contains terms that do).  \nAs discussed in the main text, if (a, c; b^k) is not an allowed vertex for any 0 < k < r, then c_b = 1; otherwise, c_b counts the number of distinct k, 0 ≤ k < r, for which (a, c; b^k) is allowed.   The second sum runs over labels d for which d × s^v = d, with 0 < v < q.  In this case, in the condensed theory a fusion channel d̃_λ  appears with a coefficient c_d, λ, whose value depends on v, r, and the number of values of λ for which the new fusion rules admit solutions.  \n\nAs discussed in the main text, when c_b=1, the number of distinct values of (μ, ν) for which (ã_μ, c̃_ν; b̃)  is allowed by the branching rules is equal to the number of copies of b̃ on the right, and the new theory need not have fusion multiplicity.  \nIf c_b >1, \n the label b̃ = ∑_j=1^q-1 b^j at the vertex (ã_μ, c̃_ν; b̃) may be associated with multiple different values of the coefficient M_l(a,b^j,c).  Each distinct coefficient then corresponds to a distinct set of solutions (μ,ν) to Eq. (<ref>).  Thus, if { M_l(a,b^j,c), 0 ≤ j < r } are all distinct, then we can find up to c_b q/r distinct solutions to Eq. (<ref>), and again the new theory need not have fusion multiplicities.   On the other hand, if these coefficients are not all distinct, then in general fusion multiplicities are expected, meaning that the coefficients (A^ab_c)^μ_ν are matrices.\n \nThe situation for vertices (ã_μ, c̃_ν; d̃_λ) is similar, except that in this case if v and r are not mutually prime, additional constraints are imposed which fix which coefficients (A^ab_c)^μ,  λ_ν are non-zero.   Again, we cannot rule out the possibility of fusion multiplicities and the need to make these coefficients matrices.\n\n\n \n\n\n\n\n"}