{"entry_id": "http://arxiv.org/abs/2303.07286v2", "published": "20230313170258", "title": "Gradient-Descent Based Optimization of Constant Envelope OFDM Waveforms", "authors": ["David G. Felton", "David A. Hague"], "primary_category": "eess.SP", "categories": ["eess.SP"], "text": "\n\n\n\n\nGradient-Descent Based Optimization of Constant Envelope OFDM Waveforms\nDavid G. Felton's efforts were supported by the Naval Research Enterprise Internship Program (NREIP) and David A. Hague's efforts were by the Naval Undersea Warfare Center's In-House Laboratory Independent Research (ILIR) program.\n\n    David G. Felton^1 David A. Hague^2\n^1Radar Systems Lab (RSL), University of Kansas, Lawrence, KS\n\n^2Sensors and Sonar Systems Department, Naval Undersea Warfare Center, Newport, RI\n\n    March 30, 2023\n===============================================================================================================================================================================================================================================================================================================\n\n\n\n\nThis paper describes a gradient-descent based optimization algorithm for synthesizing Constant Envelope Orthogonal Frequency Division Multiplexing (CE-OFDM) waveforms with low Auto-Correlation Function (ACF) sidelobes in a specified region of time-delays.  The algorithm optimizes the Generalized Integrated Sidelobe Level (GISL) which controls the mainlobe and sidelobe structure of the waveform's ACF.  The operations of this Gradient-Descent GISL (GD-GISL) algorithm are FFT-based making it computationally efficient.  This computational efficiency facilitates the design of large dimensional waveform design problems.  Simulations demonstrate the GD-GISL algorithm on CE-OFDM waveforms employing Phase-Shift Keying (PSK) symbols that take on a continuum of values (i.e, M_PSK = ∞).  Results from these simulations show that the GD-GISL algorithm can indeed reduce ACF sidelobes in a desired region of time-delays.  However, truncating the symbols to finite M-ary alphabets introduces perturbations to the waveform's instantaneous phase which increases the waveform's ACF sidelobe levels.  \n\n\n\nCE-OFDM, Waveform Design, Gradient-Descent, Dual-Function Radar/Communications\n\n\n\n\n§ INTRODUCTION\n\nThe Constant-Envelope Orthogonal Frequency Division Multiplexing (CE-OFDM) waveform is a constant envelope analogue of the standard OFDM waveform model.  The OFDM modulation is performed in either the instantaneous phase or frequency domain <cit.> and is essentially a form of Frequency Modulation (FM) which guarantees a constant envelope.  This makes the waveform better suited for transmission on real-world radar and communications transmitters than standard OFDM waveforms <cit.> whose complex envelope can vary substantially <cit.>.  CE-OFDM waveforms have recently been proposed for use in Dual-Function Radar/Communication (DFRC) applications <cit.> as the encoded communication symbols can also be utilized as a discrete set of parameters that can realize optimized constant modulus radar waveforms <cit.>.  \n\nRecent efforts in the literature have studied CE-OFDM as a potential radar waveform and analyzed the structure of the waveform's Ambiguity Function (AF) and Auto/Cross-Correlation Functions (ACF/CCF) <cit.>.  From a waveform design perspective, the OFDM symbols represent a discrete set of parameters that can be optimized to synthesize CE-OFDM waveforms with desirable AF/ACF characteristics.  However, to the best of the authors' knowledge, optimization methods to synthesize novel CE-OFDM waveform designs have not yet been developed.  This paper introduces a gradient-descent based algorithm that synthesizes CE-OFDM waveforms with low ACF sidelobes in a specified region of time-delays via minimization of a Generalized Integrated Sidelobe Level (GISL) metric.  This Gradient-Descent GISL (GD-GISL) algorithm leverages methods developed in <cit.> that were used to optimize Polyphase-Coded FM (PCFM) waveforms.   Since the GD-GISL algorithm's operations are largely comprised of FFTs, it is computationally efficient which facilitates synthesizing large-dimensional waveform design problems.  \n\nThe capabilities of this GD-GISL algorithm to optimize CE-OFDM waveforms are demonstrated by several illustrative design examples.  These examples use CE-OFDM waveforms that employ Phase-Shift Keying (PSK) where the symbols reside on the unit-circle and take on a continuum of values (i.e, M_PSK = ∞).  The results from these design examples show that the CE-OFDM waveform model can indeed be optimized to possess lower ACF sidelobes in a specific region of time-delays than pseudo-randomly generated PSK coefficients.  However, truncating the CE-OFDM symbols to finite M-ary alphabets will increase the waveform's ACF sidelobes.  The rest of this paper is organized as follows: Section II descibes the CE-OFDM waveform model and the design metrics used to assess the waveform's ACF characteristics.  Section III describes the GD-GISL algorithm.  Section IV evaluates the performance of this algorithm via several illustrative design examples.  Finally, Section V concludes the paper. \n\n\n\n§ CE-OFDM WAVEFORM MODEL\n\nA basebanded FM waveform with unit energy is expressed as\n\n    s(t)=(t/T)/√(T) e^jφ(t)\n\nwhere φ(t) is the waveform's phase modulation function, T is the waveform's duration, and 1/√(T) normalizes the signal energy to unity.  A CE-OFDM waveform utilizing Phase-Shift Keying (PSK) possesses a phase modulation function that is expressed as <cit.>\n\n    φ(t)=2π h∑_ℓ=1^L|Γ_|cos(2πℓ tT+ϕ_)\n\nwhere L is the number of phase modulation sub-carriers, |Γ_|= 1 and ϕ_ are the magnitude and phase respectively of the CE-OFDM symbol associated with the ℓ^th subcarrier, and h is the modulation index which along with L determines the waveform's  bandwidth <cit.>.  The waveform's corresponding frequency modulation function m(t) is expressed as\n\n    m(t)=1/2π∂φ(t)/∂ t=-2π hT∑_ℓ=1^L ℓ|Γ_|sin(2πℓ tT+ϕ_).\n\nThe CE-OFDM symbols ϕ_ are utilized as a discrete set of design parameters.  Modifying these parameters in an intelligent manner can produce waveforms with low AF/ACF sidelobes.  Additionally, the CE-OFDM's phase and frequency modulation functions are expressed as a finite Fourier series which are infinitely differentiable <cit.>.  This property makes these functions smooth and devoid of any transient components resulting in the vast majority of the CE-OFDM waveform's energy being densely concentrated in a compact band of frequencies.  Coupling this spectral compactness property with its natural constant envelope makes the CE-OFDM waveform model well-suited for transmission on real-world radar transmitter devices.  The design versatility and the transmitter amenability of the CE-OFDM waveform model makes it an attractive choice for a variety of radar applications.  \n\nThis paper assumes a Matched-Filter (MF) receiver is used to process the target's echo signal.  The narrowband AF measures the MF response to Doppler shifted versions of the transmit waveform and is expressed as\n\n    χ(τ, ν) = ∫_-∞^∞ s(t-τ/2)s^*(t+τ/2) e^j2πν tdt\n\nwhere ν is the Doppler shift.  The zero-Doppler cut of the AF, the ACF, provides the range response of the waveform's MF output and is expressed as\n\n    R(τ) = χ(τ, ν)|_ν=0 = ∫_-∞^∞ s(t-τ/2)s^*(t+τ/2) dt.\n\n\nThere are several metrics that describe the sidelobe structure of a waveform's ACF.  Two of the most common metrics are the Peak-to-Sidelobe Level Ratio (PSLR) and the Integrated Sidelobe Level (ISL).  The PSLR is expressed as\nrCl\nPSLR =  Δτ≤|τ|≤Tmax{|R(τ)|^2}0 ≤|τ|≤Δτmax{|R(τ)|^2} = Δτ≤|τ|≤Tmax{|R(τ)|^2}\n\n \nwhere Δ_τ denotes the first null of the ACF and therefore establishes the mainlobe width of the ACF as 2Δτ.  Note that the rightmost expression in (<ref>) results from the assumption that the waveform is unit energy and thus the maximum value of |R(τ)|^2 is unity which occurs at τ = 0.  The ISL is the ratio of the area under the sidelobe region A_τ of |R(τ)|^2 to the area under mainlobe region A_0 of |R(τ)|^2 expressed as\nrCl\nISL =A_τA_0 = ∫_Ω_τ|R(τ)|^2 dτ∫_-Δτ^Δτ|R(τ)|^2 dτ\n\n\nwhere the term Ω_τ denotes any sub-region of time-delays of the ACF excluding the mainlobe region -Δτ≤τ≤Δτ.  A lower ISL corresponds to an ACF with lower overall sidelobe levels in the region Ω_τ and/or a larger area A_0 under the mainlobe region which implies that the mainlobe width 2Δτ increases.   Note that while reducing the area A_τ will generally reduce sidelobe levels, it does not always directly translate to a lower PSLR <cit.>.\n\nThe Generalized Integrated Sidelobe Level (GISL) <cit.> generalizes the ISL metric in (<ref>) by evaluating the ℓ_p-norm <cit.> of the sidelobe and mainlobe regions of the ACF expressed as\nrCl\nGISL = (∫_Ω_τ|R(τ)|^p dτ∫_-Δτ^Δτ|R(τ)|^p dτ)^2/p\n\n \nwhere p ≥ 2 is an integer.  When p=2, the GISL becomes the standard ISL metric.  As p→∞, the integrals in (<ref>) approach the infinity norm ||·||_∞^2, also known as the max-norm, and correspondingly the GISL approaches the PSLR metric (<ref>) <cit.>.  However, from a waveform optimization perspective, the max-norm can produce a discontinuous objective function which prevents the efficient use of gradient-descent based waveform optimization methods.  Making p large but finite results in a smooth objective function which facilitates the use of gradient-descent based methods in the waveform optimization problem.  Empirical analysis <cit.> suggests that values of p ≥ 6 or so produces such a PSLR-like metric.  For this reason the GISL is the design metric this paper uses to optimize the ACF sidelobe levels of CE-OFDM waveforms.\n\nFigure <ref> shows an example CE-OFDM waveform's spectrogram, spectrum, AF, and ACF.  The waveform is composed of L=24 sub-carriers that employ PSK symbols ϕ_ with M_PSK=32 generated from a pseudo-random sequence as described in <cit.>.  The modulation index h=0.1856 is chosen to synthesize a waveform with the same RMS bandwidth <cit.> as that of a LFM waveform with a Time-Bandwidth Product (TBP) of 200 which can be calculated in closed form as <cit.>\n\n    h = TΔ f/2π√(2L^3+3L^2+L).\n\nAs explained earlier, the CE-OFDM waveform's frequency modulation function is a finite Fourier series and is therefore an infinitely differentiable and smooth function.  This smooth FM function is shown in panel (a) of Figure <ref>.  As a result of the smooth FM function, the vast majority of the waveform's energy is densely concentrated in a compact band of frequencies as is shown in panel (b) of Figure <ref>.  As is described in <cit.>, a CE-OFDM waveform utilizing PSK coding will essentially always produce a “Thumbtack-Like” AF shape.  The sidelobe pedestal is clearly visible in the ACF of the waveform shown in panel (d).  It is the goal of this paper to develope an algorithm that will further reduce the ACF sidelobe levels in a specified region Ω_τ of time-delays.  \n\n\n\n\n\n\n\n§ THE GD-GISL ALGORITHM\n\n\nThe first step in developing the GD-GISL algorithm is to discretize the waveform signal model and its design metrics.  The CE-OFDM waveform's instantaneous phase (<ref>) can be transformed from the amplitude-phase Fourier series representation to the standard real-valued Fourier series as\n\n    φ(t) = 2π h ∑_ℓ=1^L α̃_ℓcos(2πℓ tT)+β̃_ℓsin(2πℓ tT).\n\nThe Fourier coefficients α̃_ℓ and β̃_ℓ lie on the unit circle such that |Γ_ℓ| = √(α̃_ℓ^2 + β̃_ℓ^2) = 1 and are derived from ϕ_ℓ\n\n    α̃_ℓ   = |Γ_ℓ|cosϕ_ℓ, \n    β̃_ℓ   = |Γ_ℓ|sinϕ_ℓ.\n\nFrom here, (<ref>) can be written as a linear sum using discrete variables as\n\n    φ = [ 𝐁_c 𝐁_s ][ cos(ϕ); sin(ϕ) ]\n \nwhere the phase values are grouped into a L×1 vector ϕ= [ϕ_1, ϕ_2, …, ϕ_L ] and the M×L basis matrices 𝐁_c and 𝐁_s  contain cosine and sine harmonics respectively such that the ℓ^th columns\n\n    𝐛_c,    = cos(2π tT), \n    𝐛_s,    = sin(2π tT)\n\nare sampled at some sampling rate f_s which satisfies the Nyquist criterion. \n\nFrom here, the development of the gradient-based GISL algorithm largely follows the description given in <cit.>.  The GISL metric can be expressed in terms of the discretized ACF which is expressed as\n\n    𝐫 = 𝐀|𝐀𝐬̅|^2\n\nwhere 𝐫∈^(2M-1)  contains discretized samples of the ACF, 𝐬̅∈^(2M-1) is a discretized and zero-padded version of 𝐬, and 𝐀 and 𝐀 are (2M-1) × (2M-1) Discrete Fourier Transform (DFT) and Inverse DFT matrices respectively. The GISL metric is then expressed as the cost function <cit.>\n\n    J_p = ⊙𝐫_p^2⊙𝐫_p^2\n\nwhere the vectors  and  ∈^(2M-1) are non-zero in the extent of the sidelobe and mainlobe regions respectively.  In setting the cost function J_p to the GISL metric, the optimization problem can be formally stated as \n\n    min J_p.\n\n\nThe GISL is an L-dimensional and highly non-convex objective function across the CE-OFDM parameter space ϕ_ on the order of 2p in each dimension.  Therefore, convergence to the global minimum is most certainly not guaranteed.  Non-convex functions require a non-linear optimization routine, which is why here we expand upon the continuous nature of the CE-OFDM waveform and its modulation function to employ gradient-descent optimization.  Gradient-descent is an iterative approach which takes some step μ in the direction of steepest descent q_i\n\n    _i+1   = _i + μ q_i  \n    𝐪_i    = -∇__iJ_p\n \nwhere ∇_ is the gradient operator.  The gradient of (<ref>), derived in the Appendix, is expressed as\n\n\n\n\n\n\n\n\n\n\n    J_p=4 J_p 𝐃̅^T {𝐬̅^* ⊙𝐀[(𝐀𝐬̅) ⊙𝐏] }\n\nwhere \n\n    𝐏 = {𝐀( |𝐫|^p-2⊙𝐫⊙[ / - /])}.\n\nPerforming (<ref>) and (<ref>) iteratively until the Euclidean length of q_i is below some threshold g_min ensures that J_p is very near a local minima.  Alternatively, the routine may continue until it reaches a predetermined number of iterations I_max.\n\nWe employ heavy-ball gradient-descent which includes weighted versions of the previous search-directions with the current gradient.  This has been shown to converge quickly for these types of problems by dampening rapid transitions of the gradient thereby enforcing a smooth path to the minima. The search direction is altered by inclusion of previous gradients as\n\n    𝐪_i = -∇__iJ_p + β𝐪_i-1\n\nwhere β∈[0, 1].  Since this method does not always ensure a descent, if in fact the current search direction is an ascent (i.e., the projection of the gradient onto the current search direction is positive), the current search direction is reset to the current gradient.\n\n    if 𝐪_i(∇__iJ_p )> 0, then 𝐪_i = -∇__iJ_p.\n\nOnce the search direction is established, a simple backtracking method is used to calculate the step size μ for the line search that satisfies sufficient decrease via the Armijo condition <cit.>.  As mentioned earlier, to maintain continuity of the GISL gradient and to avoid diminishing returns thereafter, the parameter p should take on values much lower than infinity but larger than roughly 6 <cit.>.  These values for p have been shown to consistently generate waveforms with a flat sidelobe response.  On the other hand, letting p=2 results in waveforms whose ACFs possess more peaks and valleys, but overall less area in the specified sidelobe region Ω_τ.  The steps of the GD-GISL algorithm are listed in Algorithm 1.  Since the algorithm makes extensive use of FFTs in computing the GISL metric (<ref>), it is substantially more computationally efficient compared to a brute-force numerical computation.  \n\n\n\n\n\n§ SEVERAL ILLUSTRATIVE DESIGN EXAMPLES\n\n\nThis section demonstrates the GD-GISL algorithm using two waveform optimization design examples.  Both examples optimize the GISL (p=20) of the waveform from Figure <ref> over different sub-regions Ω_τ of the waveform's ACF.  The waveform time-series are sampled at a rate f_s = 5Δ f.  The algorithm was set to run for a max number of iterations I=100.   Figure <ref> shows the ACF, spectrum, and ACF zoomed in at the origin of the CE-OFDM waveform from Figure <ref> and the resulting optimized CE-OFDM waveform whose ACF sidelobes were minimized over all time-delays τ excluding the mainlobe region.  The initial waveform's GISL for p=20 and PSLR values were -14.73 dB and -15.21 dB respectively.  The optimized waveform's GISL was -22.14 dB corresponding to a PSLR of -20.72 dB.  It's also important to note that the mainlobe width of the optimized waveform stayed the same width as its initial seed waveform.  As explained in <cit.>, the CE-OFDM's RMS bandwidth, which controls the ACF mainlobe width, remains the same value for fixed L and h regardless of the PSK values ϕ_.  This precludes introducing constraints on RMS bandwidth to ensure the waveform's ACF mainlobe width stays largely fixed as was done for a closely related waveform model in <cit.>.  \n\n\n\nFigure <ref> shows the result of optimizing the GISL of the CE-OFDM waveform from Figure <ref> over a sub-region of time-delays Ω_τ∈Δτ≤ |τ| ≤ 0.1T.  The initial waveform's GISL and PSLR over this sub-region of time-delays was -16.8 dB and -17.51 dB respectively.  The resulting optimized waveform's GISL and PSLR values were -30.34 dB and -31.39 dB respectively, a substantial reduction of sidelobes in the specified region Ω_τ.  Again, the optimized waveform's mainlobe width stays fixed as does the waveform's spectral extent.  \n\n\n\n\n\n\n\n\n\n\n\n\nOne final important point is that the GD-GISL optimization routine assumes the CE-OFDM waveforms employ PSK with infinite granularity (i.e, M_PSK=∞).  Practical implementations of CE-OFDM waveforms will almost certainly employ a finite M-ary alphabet for the PSK symbols.  Truncating these continuous symbols to an M-ary representation will introduce perturbations in the waveform's instantaneous phase.  These perturbations are likely to degrade the desirably low ACF sidelobes of the M_PSK=∞ optimized waveform designs.  This issue is illustrated in Figure <ref> where the PSK symbols from the optimized waveform in Figure <ref> is approximated by finite M-ary alphabets.  As can be seen from the figure, as M_PSK is reduced, the degree of perturbations in the PSK symbols is greater and the ACF sidelobes increase in the region of time-delays Ω_τ where the optimization routine was run on.  There are two ways to mitigate this issue.  The first is to utilize a large M_PSK value to reduce the degree of perturbations in the implemented waveform.  The second is to modify the GD-GISL algorithm to operate on finite M-ary alphabets.  This approach may produce more favorable optimal designs with less perturbations than the waveforms shown in Figure <ref>.  This will be a topic of future investigation.\n\n\n\n\n\n§ CONCLUSION\n\n\nThe GD-GISL minimization algorithm synthesizes CE-OFDM waveforms with low ACF sidelobes in a specified region of time-delays.  The algorithm leverages methods developed in <cit.> which  exploits FFTs in the majority of its operations making it computationally feasible to optimize CE-OFDM waveforms with a large number of sub-carriers L.  Results show that the algorithm is indeed capable of reducing CE-OFDM ACF sidelobes in a user-specified sub-region of time-delays while also maintaining the waveform's ACF mainlobe width.  Truncating these PSK symbols to M-ary alphabets introduces perturbations to the optimal design that results in increased ACF sidelobes.  There are a number of avenues to pursue for future work.  The first obvious one is to modify the algorithm to work with finite M-ary alphabets for PSK and other digital modulation techniques such as Quadrature Amplitude Modulation (QAM).  The algorithm should also be generalizable to generating families of waveforms with desirable ACF and Cross-Correlation Function (CCF) properties such as the efforts of <cit.> and extendable to minimizing ℓ_p-norms on the AF of the waveform as well.   Lastly, these optimization algorithms should also be applicable to the Multi-Tone Sinusoidal FM (MTSFM) waveform <cit.> of which the CE-OFDM waveform is a special case.   \n\n\n\n§ DERIVATION OF THE GRADIENT OF THE GISL METRIC\n\n\nWe define the cost metric as the GISL in (<ref>) as\n\n    J_p = 𝐰_SL⊙𝐫_p^2𝐰_ML⊙𝐫_p^2=(𝐰_SL  |𝐫|^p𝐰_ML  |𝐫|^p)^2/p.\n\nThe Wirtinger definition of a complex derivative extended to vector calculus is <cit.>\n\n    𝐱= ( 𝐲𝐱)𝐲 + ( 𝐲^*𝐱)𝐲^*   𝐲∈ℂ\n    ( ∂𝐲/∂𝐱)𝐲   𝐲∈ℝ\n\nwhere for an arbitrary {𝐲(𝐱) : n_x → n_y } transformation from a n_x to a n_y dimensional space,\n\n    𝐲𝐱 = [   𝐱y_1   𝐱y_2      … 𝐱y_n_y ]\n \nis the n_y × n_x Jacobian matrix.\n\nWe begin with the real to complex mapping from  to 𝐬̅^*\n\n    J_p   = ( 𝐬̅^*)𝐬̅^*J_p + ( 𝐬̅)𝐬̅J_p\n       = -j𝐃̅(𝐬̅^* ⊙𝐬̅^*J_p) + j𝐃̅(𝐬̅⊙𝐬̅J_p)\n       = 2 𝐃̅^T {𝐬̅^* ⊙𝐬̅^*J_p}\n \nwhere the matrix\n\n    𝐃̅=-𝐁̅_c diag{sin()}+𝐁̅_s diag{cos()}\n\nresults from the chain rule, and where diag{∙} places the elements of the operand along the diagonal of a square matrix such that the ℓ column is \n\n    𝐝̅_ℓ=-𝐛̅_c,ℓsin(ϕ_ℓ)+𝐛̅_s,ℓcos(ϕ_ℓ)\n\nNote that 𝐁̅_c, 𝐁̅_s, and 𝐃̅ are zero padded such that their dimensionality is now ( 2M-1)×L. Next, we map from 𝐬̅^* to (𝐀𝐬̅)^*\n\n    ∇_𝐬̅^* J_p    = ( (𝐀𝐬̅)^* 𝐬̅^*)(𝐀𝐬̅)^*J_p+ ( (𝐀𝐬̅)𝐬̅^*)(𝐀𝐬̅)J_p\n       = 𝐀(𝐀𝐬̅)^*J_p\n\nwhere the second term simplifies to 0 since 𝐬̅ and 𝐬̅^* are considered independent variables. Next, mapping from (𝐀𝐬̅)^* to |𝐀𝐬̅|^2 yields \n\n    (𝐀𝐬̅)^*J_p   = ( |𝐀𝐬̅|^2(𝐀𝐬̅)^*)|𝐀𝐬̅|^2J_p\n       = ( (𝐀𝐬̅⊙(𝐀𝐬̅)^*)(𝐀𝐬̅)^*)|𝐀𝐬̅|^2J_p\n       = diag{𝐀𝐬̅}|𝐀𝐬̅|^2J_p\n       = (𝐀𝐬̅) ⊙|𝐀𝐬̅|^2J_p\n\nThen, since 𝐫 is a function of |𝐀𝐬̅|^2 via (<ref>), \n\n    |𝐀𝐬̅|^2J_p   =( 𝐫|𝐀𝐬̅|^2)𝐫J_p + ( 𝐫^*|𝐀𝐬̅|^2)𝐫^*J_p\n       = 𝐀^*  𝐫J_p + 𝐀𝐫^*J_p\n       = 2 {𝐀𝐫^*J_p}\n\nAnd, mapping from 𝐫^* to |𝐫|^p \n\n    𝐫^*J_p   = (|𝐫|^p𝐫^*)|𝐫|^pJ_p\n       = ((𝐫⊙𝐫^*)^p/2𝐫^*)|𝐫|^pJ_p\n       =   p/2diag{|𝐫|^p-2⊙𝐫}|𝐫|^pJ_p\n       = p/2|𝐫|^p-2⊙𝐫⊙|𝐫|^pJ_p\n \nAnd, since J_p is directly a function of |𝐫|^p, we solve for |𝐫|^pJ_p by use of the quotient rule followed by chain rule\n\n\n    |𝐫|^pJ_p   = 2/p(|𝐫|^p/|𝐫|^p)^2/p-1\n       ()()|𝐫|^p - ()()|𝐫|^p/()^2\n       =2/p J_p (/)  () - ()/()^2\n       = 2/p J_p [ / - /]\n\n\nFinally, using (<ref>)-(<ref>) and inserting (<ref>) into (<ref>) produces the final result\n\n    J_p   = 2 𝐃̅{𝐬̅^* ⊙𝐬̅^*J_p}\n       = 2 𝐃̅{𝐬̅^* ⊙𝐀(𝐀𝐬̅)^*J_p}\n       = 2 𝐃̅{𝐬̅^* ⊙𝐀[(𝐀𝐬̅) ⊙|𝐀𝐬̅|^2J_p] }\n       = 2 𝐃̅{𝐬̅^* ⊙𝐀[(𝐀𝐬̅) ⊙ 2 {𝐀𝐫^*J_p}] }\n    \n    \t   = 4 J_p 𝐃̅{𝐬̅^* ⊙𝐀[(𝐀𝐬̅) ⊙𝐏]}\n\nwhere \n\n    𝐏 = {𝐀( |𝐫|^p-2⊙𝐫⊙[ / - /])}.\n\nNote that a function is said to be conjugate symmetric if and only if its Fourier transform is real valued <cit.>. Under the assumption that  and  are defined to be symmetric about 0 delay, then ( |𝐫|^p-2⊙𝐫⊙[ / - /]) term exhibits conjugate symmetry since by definition, a waveform's ACF is conjugate symmetric.  Additionally, since we are applying a DFT matrix to a conjugate symmetric vector, the result is purely real and so the {∙} operator can be discarded. \n\n10\n\nurl@samestyle\n\n\n\n\n\n\n\n\nThompson_2\nS. C. Thompson, A. U. Ahmed, J. G. Proakis, J. R. Zeidler, and M. J. Geile,\n  “Constant envelope ofdm,” IEEE Transactions on Communications,\n  vol. 56, no. 8, pp. 1300–1312, 2008.\n\nChung_Comm\nC.-D. Chung and S.-M. Cho, “Constant-envelope orthogonal frequency division\n  multiplexing modulation,” in Fifth Asia-Pacific Conference on ... and\n  Fourth Optoelectronics and Communications Conference on Communications,,\n  vol. 1, 1999, pp. 629–632 vol.1.\n\nThompson_1\nS. C. Thompson, Constant envelope OFDM phase modulation.1em plus\n  0.5em minus 0.4emUniversity of California, San Diego, 2005.\n\nLevanon\nE. M. N. Levanon, Radar Signals.1em plus 0.5em minus 0.4emWiley-Interscience, 2004.\n\nAubry_2016_Optimization\nA. Aubry, V. Carotenuto, A. De Maio, A. Farina, and L. Pallotta, “Optimization\n  theory-based radar waveform design for spectrally dense environments,”\n  IEEE Aerospace and Electronic Systems Magazine, vol. 31, no. 12, pp.\n  14–25, 2016.\n\nIEEE_Sig_Proc_RadarComm\nA. Hassanien, M. G. Amin, E. Aboutanios, and B. Himed, “Dual-function radar\n  communication systems: A solution to the spectrum congestion problem,”\n  IEEE Signal Processing Magazine, vol. 36, no. 5, pp. 115–126, 2019.\n\nZhang_Radar_Comms\nQ. Zhang, Y. Zhou, L. Zhang, Y. Gu, and J. Zhang, “Waveform design for a\n  dual-function radar-communication system based on ce-ofdm-pm signal,”\n  IET Radar, Sonar & Navigation, vol. 13, no. 4, pp. 566–572, 2019.\n\nGini_2012_Waveform\nF. Gini, A. De Maio, and L. Patton, Waveform design and diversity for\n  advanced radar systems.1em plus 0.5em minus 0.4emInstitution\n  of engineering and technology London, UK, 2012.\n\nRigling\nL. K. Patton and B. D. Rigling, “Autocorrelation and modulus constraints in\n  radar waveform optimization,” in 2009 International Waveform Diversity\n  and Design Conference, 2009, pp. 150–154.\n\nMohseni\nR. Mohseni, A. Sheikhi, and M. A. M. Shirazi, “Constant envelope ofdm signals\n  for radar applications,” in 2008 IEEE Radar Conference, 2008, pp.\n  1–5.\n\nBlunt_CEOFDM\nE. R. Biehl, C. A. Mohr, B. Ravenscroft, and S. D. Blunt, “Assessment of\n  constant envelope ofdm as a class of random fm radar waveforms,” in\n  2020 IEEE Radar Conference (RadarConf20), 2020, pp. 1–6.\n\nBlunt_PCFM_Grad\nC. A. Mohr, P. M. McCormick, C. A. Topliff, S. D. Blunt, and J. M. Baden,\n  “Gradient-based optimization of pcfm radar waveforms,” IEEE\n  Transactions on Aerospace and Electronic Systems, vol. 57, no. 2, pp.\n  935–956, 2021.\n\nHague_Felton_CE_OFDM_1\nD. G. Felton and D. A. Hague, “Characterizing the ambiguity function of\n  constant-envelope ofdm waveforms,” 2023. [Online]. Available:\n  <https://arxiv.org/abs/2303.06009>\n\n\nboyd\nJ. P. Boyd, Chebyshev and Fourier spectral methods.1em plus 0.5em\n  minus 0.4emCourier Corporation, 2001.\n\nBlunt_Waveform_Diversity\nS. D. Blunt and E. L. Mokole, “Overview of radar waveform diversity,”\n  IEEE Aerospace and Electronic Systems Magazine, vol. 31, no. 11, pp.\n  2–42, 2016.\n\nPrabhuBabuI\nE. Raei, M. Alaee-Kerahroodi, P. Babu, and M. R. B. Shankar, “Design of mimo\n  radar waveforms based on lp-norm criteria,” 2021. [Online]. Available:\n  <https://arxiv.org/abs/2104.03303>\n\n\nPrabhuBabuIV\nJ. Song, P. Babu, and D. P. Palomar, “Sequence design to minimize the\n  weighted integrated and peak sidelobe levels,” IEEE Transactions on\n  Signal Processing, vol. 64, no. 8, pp. 2051–2064, April 2016.\n\nCook\nC. Cook and M. Bernfeld, Radar signals: an introduction to theory and\n  application, ser. Electrical science series.1em plus 0.5em minus\n  0.4emAcademic Press, 1967.\n\nArmijo\nJ. Nocedal and S. Wright, Numerical Optimization.1em plus 0.5em\n  minus 0.4emSpringer, 2006.\n\nHague_AES\nD. A. Hague, “Adaptive transmit waveform design using multitone sinusoidal\n  frequency modulation,” IEEE Transactions on Aerospace and Electronic\n  Systems, vol. 57, no. 2, pp. 1274–1287, 2021.\n\ncookbook\nK. B. Petersen and M. S. Pedersen, “The matrix cookbook,” 2012.\n\nProakis\nJ. Proakis and D. Manolakis, Digital Signal Processing: Principles,\n  Algorithms, and Applications.1em plus 0.5em minus 0.4emPrentice-Hall International, 1996.\n\n\n\n"}