{"entry_id": "http://arxiv.org/abs/2303.07277v1", "published": "20230313165248", "title": "Collective synchronization of dissipatively-coupled noise-activated processes", "authors": ["Michalis Chatzittofi", "Ramin Golestanian", "Jaime Agudo-Canalejo"], "primary_category": "cond-mat.stat-mech", "categories": ["cond-mat.stat-mech", "cond-mat.soft", "physics.bio-ph"], "text": "\nCollective synchronization of dissipatively-coupled noise-activated processes]Collective synchronization of dissipatively-coupled noise-activated processes\n\n\n\n^1 Living Matter Physics, Max Planck Institute for Dynamics and Self-Organisation, D-37077, Goettingen, Germany\n^2 Rudolf Peierls Centre for Theoretical Physics, University of Oxford, Oxford OX1 3PU, United Kingdom\nramin.golestanian@ds.mpg.de; jaime.agudo@ds.mpg.de\n\n\nA system of two enzymes mechanically coupled to each other in a viscous medium was recently studied, and conditions for obtaining synchronization and an enhanced average rate of the thermally-activated catalytic reactions of the enzymes were identified. The transition to synchronization occurred as the result of a global bifurcation in the underlying dynamical system. Here, we extend and generalize this idea to an arbitrary number of noise-activated cyclic processes, or oscillators, that are all coupled to each other via a dissipative coupling. The N coupled oscillators are described by N phase coordinates driven in a tilted washboard potential. At low N and strong coupling, we find synchronization as well as an enhancement in the average speed of the oscillators. In the large N regime, we show that the collective dynamics can be described through a mean-field theory, which predicts a great enhancement in the average speed. In fact, beyond a critical value of the coupling strength, noise activation becomes irrelevant and the dynamics switch to an effectively deterministic “running” mode. Finally, we study the stochastic thermodynamics of the coupled oscillators, in particular their performance with regards to the thermodynamic uncertainty relation.\n\n\n\n\n[\n    M Chatzittofi^1, R Golestanian^1,2  and J Agudo-Canalejo^1\n\n    March 30, 2023\n===============================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\nA system of driven, nonlinear coupled oscillators is nontrivial and can quickly lead to complex and unexpected situations when these oscillators synchronize, like in the famous case of the Millennium bridge <cit.>. Generic features of synchronization have been widely studied using minimal models such as the Kuramoto model <cit.>. Networks of such oscillators give rise to fascinating phenomena such as states displaying coexistence of synchronization and incoherence, known as chimera states <cit.>.\n\n\nIn biological systems, at the microscopic scale, the interactions are usually mediated by a viscous medium. For instance, hydrodynamic interactions can cause beating cilia or flagella to become synchronised  <cit.> displaying emergent phenomena such as metachronal waves <cit.>. At an even smaller scale, on the scale of enzymes and molecular motors, many relevant processes are stochastic and thermally-activated: thermal noise is required to push the system over free energy barriers, e.g. during chemical reactions inside enzymes or during the mechanical steps of molecular motors. These cyclic processes convert chemical energy into mechanical energy and heat <cit.>.\n\nEnzymes and other catalytically active particles can self-organize in space thanks to the gradients generated by their nonequilibrium chemical activity <cit.>. Additionally, the catalytic activity of the enzymes may be associated to conformational changes or oscillations in the enzyme shape <cit.>. The effect of such conformational changes on the spatial dynamics and the rheology of enzyme-rich solutions has been a topic of great recent interest <cit.>. In this context, a new mechanism for synchronization between two enzymes was recently reported, for enzymes that undergo conformational changes during their noise-activated catalytic steps, and which are coupled to each other through a viscous medium <cit.>. The model for coupled phase dynamics that emerges after coarse graining the microscopic degrees of freedom in this system has some very peculiar features and emergent properties that are entirely different from those in conventional models for synchronization such as the Kuramoto model. In particular, interactions between phases are dissipative, in the sense that they are mediated not by interaction potentials but rather by the mobility tensor (inverse to a friction tensor) that couples forces to velocities in the system. The same mobility tensor determines the stochastic noise in the system through the fluctuation-dissipation relation, making the model thermodynamically-consistent. Additionally, the transition to synchronization with increasing coupling was found to be due to a  global bifurcation in the underlying dynamical system, defined on the torus.\n\n\nInspired by these observations on the behaviour of two coupled enzymes, here we generalize the model to a system composed of an arbitrary number of stochastic oscillators, which interact with each other through a constant coupling of the dissipative kind. This could for example represent the interactions between enzymes in an enzyme-rich biomolecular condensate or metabolon <cit.>, see figure <ref>(a); but also any generic collection of noise-activated processes that are dissipatively coupled to each other. For simplicity, and in the spirit of minimal models of synchronization such as the original Kuramoto model <cit.>, we neglect the spatial structure and consider that each phase coupled with all other phases with equal strength, see figure <ref>(b). The individual dynamics of each process is governed by a tilted washboard potential, see figure <ref>(c). The resulting equations are rather generic and thus may find application as minimal models of not only catalytic processes but also other excitable systems <cit.>, such as Josephson junctions <cit.> or firing neurons <cit.>.\n\nBecause the model studied here is thermodynamically-consistent, it allows us to examine detailed features of its thermodynamic performance. A theoretical framework to understand the thermodynamics of fluctuating systems has been developed in recent years <cit.>. Of particular interest is a bound on the precision achievable by driven processes, determined by their entropy production, or equivalently their heat dissipation, known as the thermodynamic uncertainty relation <cit.>. There is a growing interest in understanding how synchronization affects such thermodynamic measures of precision or efficiency, with applications to e.g. beating cilia <cit.>, generic Kuramoto oscillators <cit.>, or molecular clocks <cit.>.\n\n\nThe paper is organized as follows. We begin by presenting the model of dissipatively coupled oscillators in its most general form, followed by its particularization to the minimal model studied here of N identical oscillators with global (all-to-all) coupling. We then present the results of stochastic simulations for small and large numbers of oscillators. Next, we focus on the large N limit, for which we show that the dynamics can be well understood using a mean-field theory. Finally, we study the stochastic thermodynamics of precision in the presence of coupling in our system.\n\n\n \n\n\n\n\n§ MODEL \n\n\n\n\n §.§ Dissipative coupling\n\n\nWe consider stochastic cyclic processes (oscillators) that are coupled to each other not through interaction forces, but through a mobility tensor that has nonzero off-diagonal components. That is, we will consider phases ϕ_α with α=1,...,N which evolve according to the coupled overdamped Langevin equations\n\n    ϕ̇_α = - M_αβ∂_β U + k_B T Σ_αν∂_βΣ_βν +  √(2 k_B T)Σ_αβξ_β\n\nwhere ∂_β≡∂/∂ϕ_β, the Einstein summation convention for repeated indices is used, and the stochastic equation is to be interpreted in the Stratonovich sense. Here, the first term represents the deterministic velocity of the phases. The mobility tensor M_αβ(ϕ_1,...,ϕ_N) can in principle be phase-dependent. For the dynamics to be thermodynamically consistent, this mobility tensor must be symmetric and positive definite <cit.>. Because there are no interaction forces between the phases, the potential U is separable and may be written as U(ϕ_1,...,ϕ_N)=V_1(ϕ_1)+...+V_N(ϕ_N). The third term represents the noise where, in order to satisfy the fluctuation-dissipation relation, Σ is the square root of the mobility tensor defined via M_αβ=Σ_ανΣ_βν, and ξ_β is unit white noise such that ⟨ξ_β(t) ⟩ = 0 and ⟨ξ_α(t) ξ_β(t') ⟩ = δ_αβδ(t-t'). The second term represents a spurious drift term that is only present when the noise is multiplicative, i.e. when the mobility tensor is phase-dependent.\n\nThe stochastic dynamics given by (<ref>) may equivalently be written in the Fokker-Planck representation for the evolution of the probability distribution P(ϕ_1,...,ϕ_N;t) as\n\n    ∂_t P = ∂_α{ M_αβ[ k_B T ∂_β P + (∂_β U) P ] },\n\nwhich highlights that, when the choice of potential allows it, the system will relax to a steady state corresponding to thermodynamic equilibrium such that we recover the Boltzmann distribution P(ϕ_1,...,ϕ_N) ∝exp [ - U(ϕ_1,...,ϕ_N)/k_B T], independently of the choice of mobility tensor M_αβ. In fact, because the potential U is separable, we may write P(ϕ_1,...,ϕ_N)=∏_α=1^N P_α(ϕ_α), with each phase independently satisfying the Boltzmann distribution P_α(ϕ_α)∝exp [ - V_α(ϕ_α)/k_B T].\n\nImportantly, when the choice of potential does not allow thermodynamic equilibrium, as in driven but periodic systems such as the ones that we will consider in the following, the system relaxes to a nonequilibrium steady state which (i) does depend on the choice of the mobility tensor M_αβ and therefore on the strength of the coupling between oscillators determined by its off-diagonal components; and (ii) is no longer separable, so that there are correlations between the different phases.\n\nA coupling of the form given by (<ref>) or equivalently (<ref>) arises naturally in processes that are coupled to each other through mechanical interactions at the nano- and microscale, as these are mediated by viscous, overdamped fields described by low Reynolds number hydrodynamics <cit.>. It represents a form of dissipative coupling, as it can be understood as arising from taking the overdamped limit of full Langevin dynamics in the presence of a friction force on phase ϕ_α going as f_α = - B_αβϕ̇_β, where B≡ M^-1 is a friction tensor.\n\n\n\n §.§ Noise-activated processes with global coupling\n\n\n\nAs anticipated, we will consider here N identical driven, noise-activated oscillators. This implies that the potentials for each phase are chosen to be identical, i.e. U(ϕ_1,...,ϕ_N)=V(ϕ_1)+...+V(ϕ_N), and V(ϕ) is chosen to be a tilted washboard potential of the form V(ϕ) = -Fϕ - vcos(ϕ+δ), with F<v and δ = arcsin(F/v) so that the minima are located at multiple integers of 2 π. The values of v and the driving force F can be related to the energy barrier E_ba of the noise-activated step and to the energy E_* released in each step, see figure <ref>(c), through E_ba = [2 √(1-(F/v)^2)-(F/v)(π - 2δ)] v and E_*= 2 π F <cit.>. For an uncoupled oscillator, the height of the energy barrier relative to the thermal energy k_B T controls the typical waiting time between stochastic steps, which scales as e^E_ba/k_B T for E_ba≫ k_B T <cit.>.  Note that, when F>v, the potential no longer displays energy barriers and becomes monotonically decreasing, so that the dynamics are no longer noise-activated.\n\nWe will consider the simplest possible dissipative coupling between the oscillators, where each of them interacts equally with all others via a mobility matrix M_αβ=μ_ϕM̃_αβ with constant diagonal coefficients M̃_αα=1, and constant off-diagonal coefficients M̃_αβ= h/(N-1) for α≠β. Here, μ_ϕ sets the mobility scale, and h is a dimensionless parameter that determines the strength of the coupling. This can be seen as an N-dimensional generalization of the two-dimensional problem studied in ref. <cit.>, with the additional simplification that the off-diagonal coefficients are constant, as it was shown in that work that this simplification does not affect the observed phenomenology. For the mobility matrix to be positive definite, the coupling strength must satisfy -1 < h < N-1. We will focus on positive values of h, for which the synchronization phenomenology is observed. Note that, since we choose the mobility matrix to be constant, the spurious drift term in the Langevin dynamics (<ref>) vanishes.\n\nThe deterministic (k_B T=0) version of the Langevin equation (<ref>) with the choice of washboard potential and mobility tensor just described can be written as ϕ̇_α = μ_ϕ{ F - v sin(ϕ_α+δ) + h/N-1∑_β≠α[ F - v sin(ϕ_β+δ)  ]  }. With the redefinitions ω≡ (1+h)Fμ_ϕ, a≡μ_ϕ v (1 - h/N-1), K ≡ h μ_ϕ v N/N-1, and θ_α≡ϕ_α-δ+π, it may be rewritten as θ̇_α = ω + a sinθ_α + K/N∑_βsinθ_β. It is worth noting that this dynamical system has been previously studied in the context of superconducting Josephson junction arrays <cit.>. These studies however focused mostly in the barrier-free regime where no fixed points exist (F>v or equivalently ω>a+K), and mostly in its deterministic behavior, with a few exceptions in which an ad-hoc white noise was added <cit.>. Here, on the other hand, we will focus on the stochastic dynamics of the system in the noise-activated regime (F<v or equivalently ω<a+K) where fixed points exist, and in the presence of a thermodynamically-consistent noise (satisfying the fluctuation-dissipation theorem). Furthermore we will focus on quantifying its collective, nonequilibrium stochastic dynamics (average speed, phase diffusion coefficient, phase correlations, and thermodynamic costs of precision), rather than on the properties of the underlying dynamical system.\n\n\n\n\n\n §.§ Quantitative measures of the stochastic dynamics\n\n\nIn order to quantitatively assess synchronization, we must construct an order parameter. The usual order parameter in traditional synchronization problems, such as the Kuramoto model <cit.>, is r≡|1/N∑_α=1^N e^iϕ_α|. However, in the context of noise-activated oscillators such as those studied here, the oscillators tend to spend a major fraction of the time in the stable fixed point corresponding to the minima of the driving potential (here at integer multiples of 2π), independently of the strength of the coupling. The order parameter r is thus not suitable in this context, as it would give r ≈ 1 even for uncoupled oscillators.\n\nFollowing ref. <cit.>, we will use the correlations between the stochastic dynamics of the oscillators as an order parameter. In particular, we may define the diffusion coefficient D_ϕ of an individual oscillator as\n\n    ⟨ (ϕ_α - ⟨ϕ_α⟩)^2 ⟩∼ 2 D_ϕ t\n\nwhich is independent of α, i.e. equal for all oscillators. The ∼ symbol indicates that the equality is achieved asymptotically, at long times t →∞. We may also define the diffusion coefficient D_δ of the phase difference between a pair of oscillators, as\n\n    ⟨ (ϕ_α - ϕ_β)^2 ⟩∼ 2 D_δ t\n\nwhich, due to the all-to-all coupling studied here, is identical for all pairs of oscillators α≠β. The two diffusion coefficients defined in this way are related to the correlation, or dimensionless covariance, between pairs of oscillators defined as\n\n    C = ⟨ (ϕ_α - ⟨ϕ_α⟩)(ϕ_β - ⟨ϕ_β⟩) ⟩/√(⟨ (ϕ_α - ⟨ϕ_α⟩)^2 ⟩⟨ (ϕ_β - ⟨ϕ_β⟩)^2 ⟩) = 1 - D_δ/2D_ϕ\n\nwhich we will use as our order parameter for synchronization, and is also identical for all pairs of oscillators α≠β. In particular, for uncorrelated oscillators we have D_δ = 2D_ϕ and thus C=0, whereas for perfectly correlated oscillators we have D_δ=0 and thus C=1. Anticorrelations would correspond to C<0, with a lower bound C=-1/(N-1) for maximally anticorrelated oscillators. Lastly, we will define the average speed Ω of the oscillators as \n\n    ⟨ϕ_α⟩∼Ω t .\n\nwhich again is independent of α.\n\n\n\n§ RESULTS\n\n\n\n\n §.§ Stochastic simulations\n\n\n\n\n  §.§.§ Small number of oscillators\n\n\nFor the case N=2 <cit.>, we previously found that the system exhibits synchronisation and an enhanced average speed above a critical h. Examples of stochastic trajectories resulting from numerical solution of the Langevin dynamics (<ref>) for N=2 are shown in figure <ref>(a)–(b). Note that, here and throughout the text, time is given in units of (μ_ϕ v)^-1. One clearly observes how, at zero or low coupling [figure <ref>(a)], the trajectories appear independent, whereas at high coupling [figure <ref>(b)] the two oscillators are strongly correlated. Moreover, the average speed increases: within the same timescale, a much larger number of steps is observed in the presence of coupling, and long “runs” of several consecutive steps are observed, as indicated by the black arrows. \n\n\n\nA similar behavior is observed for a larger, but still small, number of oscillators (2<N≲ 25). As seen in figure <ref>(c)–(d), with increasing coupling the oscillators become correlated, the average speed increases, and long runs become apparent (black arrows). The dynamics are quantified in figure <ref> as a function of number of oscillators N and strength of the coupling h. The average speed increases with increasing coupling, see figure <ref>(a), with this increase becoming significantly more pronounced at higher N. On the other hand, synchronization as measured by C appears strongest and is present at smaller values of the coupling for lower N, see see figure <ref>(b). Interestingly, the phase diffusion coefficient D_ϕ appears to peak at a specific, N-dependent value of the coupling, see figure <ref>(c). The phase-difference diffusion coefficient D_δ also appears to peak at intermediate h [figure <ref>(d)], but only for sufficiently large values of N, and to a much smaller extent than D_ϕ, so that the order parameter C still decreases with increasing h.\n\n \n\nIt is worth noting that enhanced phase diffusion in a tilted washboard potential has been previously reported for the motion of a single phase in such a potential <cit.>, in which case it was related to the transition from noise-activated dynamics to deterministic dynamics mediated by the saddle-node bifurcation of the system at F=v. However, in our case we have F<v in all cases, i.e. the dynamics remain noise-activated and integer values of 2π always correspond to stable fixed point of the ϕ_α's, independently of the strength of the coupling h. A relation between these two distinct systems can still be established (and will be further clarified when we study the large N limit in section <ref>). In ref. <cit.>, exploring the case N=2, it was found that at a critical value of h a global bifurcation of the underlying deterministic dynamical system (k_B T=0) occurs, giving rise to a splitting of the (ϕ_1,ϕ_2) phase space, which corresponds modulo 2π to a torus, into two disconnected regions, see figure <ref>(a)–(c). One region corresponds to the basin of attraction of the (ϕ_1,ϕ_2)=(0,0) stable fixed point, whereas the new region (in yellow) corresponds to a band of periodic orbits, along which ϕ_1 and ϕ_2 increase deterministically. This bifurcation had been previously reported in a study of two coupled Josephson junctions <cit.>. Our work further shows that this bifurcation is responsible for the emergence of synchronization, enhanced average speed, and the “running trajectories” in the stochastic system [k_B T>0, figure <ref>(b) and (d)]. The enhancement in the phase and phase-difference diffusion coefficients observed at intermediate h is therefore likely related to the transition from purely noise-activated dynamics before the bifurcation, to a mixture of noise-activated and deterministic dynamics once the periodic orbits have emerged. \n\n \n\nIndeed, an analysis of the deterministic dynamics for N>2 shows that a similar splitting of the phase space (now an N-torus) into disconnected regions occurs beyond an N-dependent critical value of h, one region corresponding to the basin of attraction of the fixed point, the others to periodic orbits along which all ϕ_α increase deterministically. The regions containing periodic orbits in the case N=3 can be seen in figure <ref>(d). In this case, there are two distinct “tubes” corresponding to periodic orbits in which ϕ_1, ϕ_2, and ϕ_3 advance in the order (... 1 2 3 1 2 3 ...) and (... 1 3 2 1 3 2 ...), respectively. For arbitrary N, the number of higher-dimensional “tubes” containing periodic orbits therefore is (N-1)!, the number of circular permutations of N distinct objects, as previously reported in the context of Josephson junction arrays <cit.>. We have measured the volume fraction of the phase space that is occupied by periodic bands as a function of h, for several values of N, see figure <ref>(e). For this purpose, periodic trajectories were operationally defined as trajectories that, starting at t=0 from a point in the unit cell -π<ϕ_α<π for all α, reach ϕ_α=6π for any α at some t>0, which implies that they do not end at the stable fixed point of the starting unit cell or any of its nearest neighbors. Beyond the critical h, the volume fraction grows from zero and saturates towards a limiting value as h increases. Interestingly, with increasing N, the growth of this volume fraction beyond the critical h becomes sharper, and the limiting value at large h becomes closer to one. Extrapolating this trend we may speculate that, for large N, a sharp transition occurs at a critical h at which the phase space becomes almost entirely occupied, or “crowded” <cit.>, by periodic orbits.\nIn figure <ref>(f), some stochastic trajectories are shown, for h beyond the critical value and several values of N. For N=2 we see longer periods in which the system is “resting” at the fixed point and the phases do not advance, interspersed with short deterministic runs. As N is increased, the resting periods become shorter while the runs become longer, as one may expect from the considerations just described regarding the phase space volume occupied by periodic orbits.\n\n\n\n\n\n\n\n  §.§.§ Large number of oscillators\n\n\nAs the number of oscillators increases, the behavior observed in stochastic simulations becomes largely independent of this number. We observe that, beyond an N-independent critical value of h, trajectories mostly run deterministically, without barely any resting periods at which the oscillators visit the fixed point of the dynamics, see figure <ref>. The stochastic dynamics are quantified for various values of N in figure <ref>. All relevant quantities Ω, D_ϕ, and D_δ depend only very weakly on N and approach an asymptotic limit as N →∞, with D_ϕ showing the slowest approach towards this limit.\n\nInterestingly, however, the synchronization order parameter becomes strongly nonmonotonic as a function of the coupling h, see figure <ref>(b): while synchronization is absent at low h, it rises sharply as we approach the critical h, but then quickly decreases back to zero (uncorrelated trajectories) as h is further increased. Intuitively, in light of the results described in the previous section, this implies that the oscillators are most correlated the phase space volume fraction occupied by periodic orbits is intermediate, neither too small (in which case trajectories are predominantly noise-activated, with independent steps by each oscillator) not too large (in which case trajectories are effectively deterministic and uncoupled). \n\n\n \n\n \n\n\n\n\n §.§ Mean-field theory in the large N limit \n\n\n\n\n  §.§.§ General case\n\n\nThe fact that the oscillators become uncorrelated in the large N limit suggests that we may describe the behavior of the system through a mean-field theory. Then we begin from the Fokker-Planck equation of this model which, following (<ref>), is  given by\n\n    ∂_t P(ϕ_1,...,ϕ_N;t) = ∂_α{μ_ϕM̃_αβ[ k_B T ∂_β P + (∂_β V(ϕ_β)) P ] }.\n\nTo study the large N limit we first coarse grain over (N-1) degrees of freedom to get an equation for the one-particle distribution ρ(ϕ;t), \n\n    ρ(ϕ;t) = ∫ d ϕ_2... dϕ_N P(ϕ,...,ϕ_N;t).\n\nBy assuming that the processes are uncorrelated, so that the two-particle distribution reads P_2(ϕ,ϕ_1;t) = ρ(ϕ;t) ρ(ϕ_1;t), we close the hierarchy of equations and obtain an equation for the one-particle distribution,\n \n    ∂_t ρ(ϕ;t) =μ_ϕ∂_ϕ{ k_B T ∂_ϕρ- [F+hf_ave-v sin(ϕ+δ) ]ρ},\n\n where\n  \n    f_ave = -∫^2 π_0 d ϕρ(ϕ;t) ∂ V(ϕ)/∂ϕ\n\n is the average force experienced by an oscillator. Therefore, in the mean-field approximation each oscillator feels an effective driving force F_eff=F+hf_ave, independent of the number of enzymes, with the strength of the deviation from the true driving force F governed by h. Notice that the equation of motion becomes nonlinear and nonlocal in ϕ, due to the presence of ρ in the definition of f_ave.\n \nThe steady state ρ_ss(ϕ) of the system can be found by imposing the condition of constant flux\n  \n    - J/μ_ϕ = k_B T ∂_ϕρ_ss - [F+hf_ave-v sin(ϕ+δ) ]ρ_ss,\n\n where J corresponds to the flux. This problem is identical to that of finding the steady state distribution of a single particle in a washboard potential with driving force F_eff=F+hf_ave, which is well studied and easily solved using standard methods <cit.>, except that here one must additionally solve for f_ave in the implicit equation f_ave = ∫^2 π_0 d ϕρ_ss(ϕ) [F-v sin(ϕ+δ)] (note that ρ_ss depends on f_ave), required for self-consistency, see (<ref>). Armed with this self-consistent value of f_ave and thus of F_eff, which is a function of all parameters of the system and in particular of the coupling h, we can then obtain the average speed Ω and the phase diffusion coefficient D_ϕ (which corresponds to D_δ/2 given the absence of correlations) using the known results for a single particle in a tilted washboard potential <cit.>. Additionally, we may calculate a critical value of the coupling h=h^* at which F_eff=v, i.e. the value of the coupling for which the energy barriers of the effective washboard potential vanish and the dynamics become deterministic (downhill). This further showcases the analogy between the giant diffusion observed at F=v for a single particle in a washboard potential, and that seen at h=h^* for both the phase and phase-difference diffusion coefficients in the present work.\n \n The values for Ω, D_ϕ, and D_δ obtained from this mean-field theory are compared to those obtained from stochastic simulations with N=200 in figure <ref>, for two different values of the noise k_B T. We observe an excellent match, except for D_ϕ at the critical coupling which is underestimated (as described above, the limit N→∞ is approached slowly for D_ϕ). Additionally, the critical coupling h^* obtained from the mean-field theory is plotted as the vertical line in figure <ref>, again with excellent agreement. As expected, it marks the transition between noise-activated and deterministic dynamics. In figure <ref>, the critical coupling h^* is shown as a function of the shape of the washboard potential [E_ba/E_*, see figure <ref>(c), which is in one-to-one correspondence with F/v], for various values of the noise strength. This defines a phase diagram marking the transition between noise-activated and deterministic dynamics.\n \n  \n\n  \n\n \n \n\n  §.§.§ Limit of vanishing noise \n\n \nFurther analytical progress is possible in the limit of vanishing noise T → 0. In this case, (<ref>) can be directly solved for ρ_ss, giving\n \n    ρ_ss (ϕ) = 1/2π√((F+hf_ave)^2-v^2)/F+hf_ave-vsin(ϕ+δ)\n\n where J has been used to enforce normalization ∫_0^2πρ_ss dϕ=1. As expected, in the absence of noise the steady state is only well-defined when F_eff>v so that the potential admits deterministic dynamics. Using (<ref>) in the self-consistency condition gives f_ave = √((F+hf_ave)^2-v^2)-hf_ave, and solving for f_ave and choosing the positive, physical root, we obtain\n \n    f_ave = Fh + √(F^2(1+h)^2-(1+2h)v^2)/1+2h.\n\nA real solution only exists when the term inside the square root is positive, which is possible when\n \n    h> v^2-F^2 + √(v^2-F^2)/F^2≡ h^*\n\n and serves to define the critical value of the coupling h^* above which deterministic, “running” trajectories exist in the vanishing noise limit. Naturally, such a critical coupling is only well-defined when energy barriers are present in the true washboard potential (F<v), and h^* → 0 from above as F → v from below. The critical coupling given by equation (<ref>) is shown as the T=0 line in figure <ref>, as a function of E_ba/E_* which (in one-to-one correspondence with F/v) defines the shape of the washboard potential.\n \n Interestingly, at the critical coupling we do not find F_eff(h^*)=v as one might have naively expected, but rather\n  \n    F_eff(h^*)=F+h^* f_ave(h^*) = v^2/F\n\n which implies that F_eff(h^*)>v when F<v, i.e. the effective washboard potential is already beyond the critical tilt, and the dynamics are therefore fully deterministic, when the critical coupling is reached. This is a reflection of the fact that the transition to the running state is discontinuous and noise-activated, as for h>h^* the running state still coexists with the static state corresponding the fixed point ϕ_1=...=ϕ_N=0 (the transition state separating the two corresponds to the negative root of the self-consistency condition, with a minus sign in front of the square root of (<ref>)). This also implies that, at the critical coupling, there is already a finite, non-vanishing average speed Ω of the oscillators in the running state. Indeed, the average speed may be calculated as\n \n    Ω = 2 π J =  μ_ϕ(1+h) f_ave\n\nand, at the critical coupling, we find\n \n    Ω(h^*) =  μ_ϕ(1+h^*) f_ave(h^*) = μ_ϕ v √(v^2-F^2)/F\n\n which is positive for any F<v. The zero temperature average speed as given by (<ref>) is plotted as the blue dashed lines in figure <ref>(b,d). We see very good agreement with the stochastic simulations and the mean-field theory at finite temperature, serving as further confirmation that the dynamics beyond the critical coupling are largely deterministic. \n \n\n\n\n\n §.§ Stochastic thermodynamics of precision\n\n\nThe coupling-induced transition marks a very strong change in the dynamics of the system, from noise-activated to deterministic. It is thus interesting to explore how does the transition affect the precision of the oscillators, which is bounded from below by the entropy production rate in the system <cit.>. Specifically, the thermodynamic uncertainty relation (TUR) states the bound <cit.>\n \n    σ̇ t  ϵ^2 ≥ 2k_B ,\n\n where σ̇ is the entropy production rate, and ϵ^2 is the relative uncertainty defined as\n  \n    ϵ^2 = ⟨ X^2 ⟩ - ⟨ X ⟩^2/⟨ X ⟩^2,\n\n where X is the observable of interest.\nThis inequality is crucial, since it implies that a higher precision in the catalytic rate (smaller ϵ) requires higher entropy production or equivalently heat dissipation (higher σ̇).\nIn our model the observable of interest is the total amount of phase advanced by the oscillators\n\n    X = ∑_i^N ϕ_i.\n\nThe entropy production rate σ̇ is easily calculated as\n\n    σ̇ T = F ⟨Ẋ⟩ ,\n\nand is directly related to the free energy E_* = 2 π F released in each noise-activated step, see figure <ref>(c). \n\n \n\nIn figure <ref>, we plot the dimensionless thermodynamic uncertainty ratio Q ≡σ̇ t  ϵ^2 / (2k_B) as a function of the coupling h, as measured in our stochastic simulations for several values of N. According to the TUR (<ref>), satisfies Q ≥ 1. A process satisfying Q=1 is performing optimally from a thermodynamic perspective (as precisely as possible given its energy dissipation). We see that, as expected, the TUR is always respected. The behavior of Q with increasing h is strongly non-monotonic. Starting from the uncoupled case h=0, Q first increases with increasing h, in the regime of noise-activated dynamics. After peaking around the critical h=h^*, however, Q sharply decreases as h is further increased and we venture further into the deterministic regime. Values of Q smaller than the value Q(h=0) are observed in this regime, implying that the coupling can enhance the thermodynamic performance of the oscillators. Finally, as we approach the upper bound of h<N-1 required by the positive definiteness of the mobility, Q is observed to rise again. We note, however, that the regime 1 ≪ h < N-1 is somewhat artificial, as it corresponds to cases where the effects of cross-interactions between oscillators are much stronger than those of self-interactions. Moreover, this regime only exists for finite N and becomes inaccessible in the thermodynamic limit N→∞.\n\n\n\n\n\n\n§ CONCLUSIONS\n\n\nWe have studied a minimal model describing the collective dynamics of noise-activated cylic processes, or stochastic oscillators, that are coupled to each other through a dissipative coupling. That is, the processes are not coupled to each other through an interaction potential (or interaction force), but through the mobility tensor that connects forces to velocities in the overdamped dynamics. This mobility tensor also defines the properties of the stochastic noise through the fluctuation-dissipation relation, ensuring that the dynamics are thermodynamically-consistent and relax to thermodynamic equilibrium when such an equilibrium is available. Previously, we have shown how this kind of coupling arises naturally for processes that are mechanically coupled (e.g. physically or through hydrodynamic interactions) in an overdamped, viscous medium <cit.>.\n\nFor low N, where N is the number of coupled oscillators, we found results analogous to those previously obtained for N=2 in ref. <cit.>. Beyond a critical coupling h^*, strong synchronization (as measured by the correlation function) and an enhancement in the average speed of the processes is observed. This transition can be understood as arising from a global bifurcation of the underlying dynamical system, defined on the N-torus, which leads to the emergence of periodic orbits that represent “running” trajectories, along which the phases of all the oscillators increase deterministically.\n\nFor large N, synchronization becomes confined to a narrow region near the critical coupling h^*. Below h^*, the dynamics are uncorrelated and stochastic (noise-activated). Above h^*, they are uncorrelated and effectively deterministic, and the average phase speed becomes greatly enhanced. We can understand this effect in two complementary ways: (i) analysis of the underlying dynamical system shows that, at large N, the volume fraction of the phase space occupied by periodic orbits increases very sharply at the bifurcation; and (ii) a mean-field theory shows that the energy barriers in the effective potential landscape experienced by each oscillator vanish at the critical coupling, and the dynamics become deterministic (downhill). The mean-field theory provides a great match to the results of stochastic simulations at large N and allows for analytical prediction of the critical coupling and the average speed of the oscillators, particularly in the limit of low noise.\n\n Finally, we have shown that the oscillator dynamics can become more optimal in the presence of coupling, in the context of the trade-off between precision and entropy production described by the thermodynamic uncertainty relation. This occurs within the deterministic regime of the dynamics, beyond the critical coupling h^*. Over the full range of coupling strengths, the behavior relative to the thermodynamic bound on precision is rather complex, and signatures of the stochastic-to-deterministic transition at the critical coupling are clearly apparent in the precision.\n \nDue to its simplicity, its general applicability to the description of coupled microscopic processes <cit.>, and its intriguing features in the context of nonequilibrium statistical physics and dynamical systems theory, we believe that the model presented here merits significant further investigation.\nFuture work may consider local interactions between the nearest neighbours rather than all-to-all interactions as studied here, endowing the model with a spatial structure, as well as the role of quenched disorder <cit.>. Of great interest would also be the interactions between non-identical oscillators, as only the synchronization between identical oscillators has been studied so far. Lastly, one may explore connections to Bose-Einstein-like condensation in driven scalar active matter <cit.> when interactions among particles are non-negligible.\n\n\n\n\n\n\n"}