{"entry_id": "http://arxiv.org/abs/2303.07267v2", "published": "20230313164521", "title": "CrysFieldExplorer: a software for rapid optimization of crystal field Hamiltonian", "authors": ["Qianli Ma", "Xiaojian Bai", "Erxi Feng", "Guannan Zhang", "Huibo Cao"], "primary_category": "cond-mat.str-el", "categories": ["cond-mat.str-el"], "text": "\n\n\n\n\nNeutron Scattering Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee, USA,37831\n\n\nNeutron Scattering Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee, USA,37831\nDepartment of Physics and Astronomy, Louisiana State University , Baton Rouge, Louisiana, USA,70803\n\n\nNeutron Scattering Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee, USA,37831\n\n\nComputer Science and Mathematics Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee, USA,37831\n\n\nNeutron Scattering Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee, USA,37831\n\n\n\n\n\n\n\n\nWe present a new lite python-based program, CrysFieldExplorer, for fast optimizing crystal electric field (CEF) parameters to fit experimental data. The main novelty of CrysFieldExplorer is the development of a unique loss function, referred to as the Spectrum-Characteristic Loss (L_Spectrum), which is defined \nbased on the characteristic polynomial of the Hamiltonian matrix. Particle Swarm Optimization and Covariance matrix adaptation evolution strategy are used to find the minimum of the total loss function. We demonstrate that CrysFieldExplorer can performs direct fitting of CEF parameters to any experimental data such as neutron spectrum, susceptibility, magnetizations etc. CrysFieldExplorer can handle a large amount of none-zero CEF parameters and reveal multiple local and global minimum solutions. Detailed crystal field theory, description of the loss function, implementation and limit of the program are discussed within context of two examples.\n\n\n\n\n\nCrysFieldExplorer: a software for rapid optimization of crystal field Hamiltonian\n    Huibo Cao*\n    March 30, 2023\n=================================================================================\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nSingle-ion magnetic anisotropy is one of the key elements for exotic quantum states in frustrated systems <cit.>. Crystal electric field (CEF) is responsible for single-ion magnetic anisotropy, and it occurs through Coulomb interaction and Pauli exclusion between the central cation and surrounding anions that splits the energy levels of electrons grouped by different orbitals of the central cation. In the absence of the CEF effect or in a spherically symmetrical field, these energy levels would otherwise be degenerate. The CEF effect is known to cause dramatic magnetic anisotropy which collectively produce exotic ground states in a wide range of quantum materials <cit.> and unconventional high temperature superconductors <cit.>. \n\nThe calculation of excited energy levels of magnetic ions in a crystalline environment has been well studied <cit.>. Stevens and Hutchings have illustrated systematically the process of determination of the perturbing Hamiltonian from the evaluation of the electrostatic potential experienced by the magnetic ion from the surrounding charges <cit.>. One of the common conventions to express the CEF Hamiltonian is using Stevens Operators. The crux of the CEF study is to solve the single-ion Hamiltonian by matrix diagonalization and retrieve eigenvalues and eigenfunctions from the CEF Hamiltonian to fit the corresponding crystal field excitations. Inelastic neutron scattering is a suitable experimental technique because it directly measures transitions between ground states and excited states of magnetic ions. It has gradually become one of the most popular experimental methods in conducting crystal field analysis. After obtaining neutron scattering and other bulk property data, the next step in the CEF analysis is fitting the CEF Hamiltonian to experimental observables. It has always been a challenging optimization problem to find a solution set that best describes the experimentally measured data. Efforts to tackle this problem include\nprograms such as SPECTRE <cit.>, McPhase <cit.>, Mantid <cit.>, SIMPRE <cit.> CFca <cit.>, FOCUS <cit.> and the latest PyCrystalField <cit.>. These programs use various techniques to calculate the CEF parameters but they all share the same approach that uses χ^2, a type of loss function, to find the global minimum. One of the disadvantages associated with choosing the χ^2 loss function is it relies on a set of starting parameters that needs to be adjacent to the true solution. As we will demonstrate in the next chapter, large energy boundaries in the χ^2 type loss function exist that could trap the optimization process on a local minimum. Typically, the point-charge model and Monte Carlo sampling are used to generate starting parameters. However, the point-charge model is a classical approximation by positioning several point charges around a magnetic ion to represent a distribution of valence electrons. This heavily limits the accuracy of the point-charge model. Additionally, building a point-charge model or Monte Carlo simulation can sometimes be none-trivial for inexperienced researchers. More importantly, when dealing with low local symmetry such as C_i, C_1, the number of none-zero crystal field parameters can be well into high 20s. The complexity and cost of computation of the multi-dimensional loss function increases exponentially and can easily overwhelm currently existing software. \n\nTo tackle these challenges, we have designed a special loss function, Spectrum - Characteristic Loss (L_Spectrum), based on the theory of polynomial characteristics and developed a lite python program called CrysFieldExplorer. CrysFieldExplorer takes advantage of particle swarm optimization (PSO) <cit.> and covariance matrix adaptation evolution strategy (CMA-ES) <cit.> to minimize a combination of Spectrum - Characteristic Loss and traditional χ^2 losses. It is able to quickly fit neutron spectroscopy data and any other experimental results such as susceptibility, magnetization, specific heat, neutron diffraction, etc with CEF model and yields a series of solutions containing information with local and global minima. It bypasses the step of using a point-charge model to estimate starting parameters. In the following chapters, we will show our methods can not only discover the solutions reported in literature, but also uncover multiple other solutions that could fit all provided experimental data equally well. This suggests that the data used in the traditional optimization process may not have enough resolution to distinguish one from another and require further measurements such as local magnetic susceptibility with polarized neutron diffraction <cit.>. Our findings suggest that the traditional standard of determining one set of best CEF parameters may be flawed. We, therefore, suggest that future CEF analysis should include a list of possible solutions and discuss their relative physical meaning and the reasons for the preferred solution.\n\n\n\n§ THEORY\n\n\n\n\n\n §.§ Crystal Electric Field Theory\n\nThe CEF potential can be constructed from a point-charge perspective detailed in Hutching's work <cit.>. The electrostatic potential due to the surrounding point-charges can be expressed using tesseral harmonic functions in Cartesian coordinates. Following this convention, the Crystal Field (CF) Hamiltonian can be expressed by Stevens operators as <cit.>:\n\n    H_CF = ∑_n,m B^m_nO^m_n=∑_n,m[A^m_n θ_n]O^m_n,\n\n\nwhere B^m_n (|m| ≤ n) is the CF parameters fitted from experimental measurements, O^m_n are the Stevens' Operators. The CF parameters can also be expressed in terms of A^m_n and θ_n, where θ_n represents reduced matrix elements and is also called as the Stevens factor. For rare earth ions, θ_n has been tabulated in Table VI of Ref. <cit.>.\n\n\n\n §.§ Neutron Scattering Cross-section\n\nInelastic neutron scattering spectroscopy is well-suited in studying the crystal field excitations because neutrons can directly excite electron spins from one level to another and measure the difference between two energy levels.  The observed intensity and excited energy levels can be used to fit the crystal field parameter B^m_ns in Eq. <ref>. The excited energy levels correspond to the energy difference between the lowest eigenvalues and the corresponding state of the CEF Hamiltonian. The observed intensity is related to the partial differential magnetic cross-section expressed as:\n\n    d^2σ/dΩ dE' = Ck_fk_i F(|Q|)S(|Q|,ħω),\n\nwhere k_f and k_i are the momentum of scattered and incident neutrons, C is a constant including the Debye-Waller factor, F(|Q|) is the magnetic form factor of the sample. S(|Q|,ħω) is the scattering function, ħω indicate the energy of neutrons.  From S(|Q|,ħω) the relative intensities from different states of the CEF exictations can be calculated. At constant |Q|, the S(|Q|, ħω) is,\n\n    S(Q, ħω)=∑_i,i'(∑_α|⟨i|J_α|i'⟩|^2)e^-β E_i∑_j e^-β E_j L(Δ E+ħω),\n\ni → i' indicates the transition between state i and i' for the magnetic ion. β=-1k_B T, k_B is the Boltzman constant, T indicates temperature. L(Δ E+ħω) is a Lorentzian function that guarantees the energy conservation when neutrons induce a transition from state i to i', which poses a finite energy width or lifetime. The ∑_α sums all three x,y,z component of the J_α matrix. Although many CEF experiments are measured at low temperature, high temperature measurements can be important for confirming or extracting the scattering signal originated from CEF excitations that can be calculated with Eq. <ref>.\n\n\n\n §.§ Magnetization and Susceptibility\n\n\nMagnetization under an external magnetic field 𝐇 can be readily calculated by combining CEF Hamiltonian and the Zeeman term. The overall Hamiltonian can be expressed as:\n\n    H=H_CF - μ_B g_J H·J.\n\nBy diagonalizing Eq.<ref>, we can calculate the eigenstates E_n and eigenfunctions |i⟩ of the CF Hamiltonian in a magnetic field 𝐇. The three components (α = x, y, z) of the magnetization in Cartesian coordinate system are given as,\n\n    M_α(𝐇,T)=g_j∑_n e^-β E_n⟨n|J|n⟩/Z\n\nwhere Z=∑_n e^-βE_n is the partition function. The powder average of the magnetization can be derived from Eq. <ref> by calculating the averaged magnetization on a unit sphere. \n\nThe magnetic susceptibility can be calculated by taking derivatives of the magnetization M_α,\n\n\n    χ_αβ=∂ M_α∂ H_β.\n\nThe powder averaged magnetic susceptibility can be calculated in the same fashion by substituting M_α with its powder-average version. Detailed information about the calculation can be found in ref.<cit.>.\n\n\n\n §.§ Loss Function\n\n\n\n\nThe core of an optimization problem is constructing a proper loss function that is smooth on the parameter space, sensitive to the change of input parameters and does not produce large energy boundaries around local and global minima. Currently, a few popular softwares such as SPECTRE <cit.>, PyCrystalField <cit.> and Mantid <cit.>, etc are able to fit the CEF Hamiltonian using experimental observables. Different to the existing software packages, here we introduce a newly designed loss function, Spectrum - Characteristic Loss. and demonstrate its advantage when deployed in CEF optimization.\n  \nThe foundation of the Spectrum - Characteristic Loss is from the theory of characteristic polynomial - det(λ I - A) = 0, where λ is the eigenvalue of matrix A, I is an identity matrix. The difference between the lowest and excited eigenvalues are neutron observed energy levels. Using this feature, we construct the loss function for the neutron measured energy levels as:\n\n    L_E = log_10(∑_i=1det{(E_exp[i]+E_cal[0])I                 -H }^2det{E_exp[i]I }^2),\n\n\nE_exp indicate the observed excitation levels from neutron scattering, the summation of i starts from 1 which is the first excited energy level observed by neutron experiment. E_cal[0] is the ground state eigenvalue from matrix H. E_cal[0] may not be 0.\n\nSubsequently, we construct the mean square root deviation for the intensity and the inverse susceptibility as:\n\n    L_Intensity = √(∑(I_true[i]-I_calc[i])^2)√(∑(I_true[i])^2),\n\nand\n\n    L_1/χ = √(∑(1/χ_true[i]-1/χ_calc[i])^2)√(∑(1/χ_true[i])^2).\n\n\nTo construct the Spectrum - Characteristic loss function, we combine Eq.<ref>, <ref> such that L_Spectrum=log_10(L_E)+L_Intensity. To fit other bulk measured physical properties, CrysFieldExplorer sums up L_Spectrum with other mean square root losses computed from the experimental data and conduct global optimization.\n\nFigure <ref> compares the Spectrum - Characteristic Loss with traditional mean square losses of the excited energy levels and relative intensities for an example material . It represents an optimization conducted on a 15-dimensional parameter space. More physical details about the fitting results are discussed in a later chapter. Here we show the computed loss along a straight line passing through the true solution of <cit.>. The line is chosen to point in a random direction within the 15-dimensional parameter space to simulate an optimization procedure (a real optimization may not follow a straight line). The loss is then projected onto the B^0_2 dimension for visualization. The upper panel shows the Spectrum - Characteristic Loss function while the lower panel is the standard χ^2 loss function. To compare the loss functions like-to like we also apply a log10 operation on the energy levels such that χ^2=log_10(χ^2_E)+χ^2_I. Comparing the upper panel to the lower panel, one can tell that the Spectrum - Characteristic Loss has a global structure around the minimum and does not produce sharp energy barrier at B^0_2 ∼ -0.02. Such an energy barrier can trick the optimization algorithm assuming it has already reached the global minimum. This can lead to a wrong solution if the starting parameters fall within the energy well. The Spectrum - Characteristic Loss also appears to be more sensitive to slight perturbations in CEF parameters. In the specific direction that the loss is computed, traditional χ^2 loss function is only able to converge at the true solution which is artificially designed such that the energy levels exactly match between calculated and observed, causing both L_Spectrum and χ^2 to appear sharp at the true solution. On the other hand, the Spectrum - Characteristic Loss function can discover at least three other minima in the parameter space. In reality the real global minimum is unknown for a measured material, so it is important to have a complete list including all potential minima for further examination as different CEF parameters from the list could all reproduce results identical to experimentally measured properties. As the number of CEF parameters increases, it requires more constraints to conclusively solve the CEF Hamiltonian. The multiple solutions CrysFieldExplorer discovered is an indication that the input observables do not impose enough constraints to reach the true solution. \n\nIn addition, CrysFieldExplorer can add any other experimental data such as specific heat, anisotropy g-tensors, magnetization, etc in the optimization process. The loss function for additional data can be added the same way as mean square root deviation. Users can also adjust weights for different losses to fine tune the optimization process.\n\n\n\n§ EXAMPLES\n\n\n\n §.§ Benchmark with Rare Earth Pyrochlore: Yb_2Ti_2O_7\n\n\nGeometrical frustration has been of great interest in condensed matter physics due to the ability to host rich order-disorder states. These exotic states of matter are results of collective behaviors that arise from frustrated interactions within the quantum many-body system. Understanding these phenomena is crucial for developing next generation quantum technologies <cit.>. Rare earth pyrochlore is the archetype of magnetic frustration in three dimensions. This system has been reported to host exotic magnetic states such as quantum spin ice <cit.>, quantum spin liquid <cit.> etc. The pyrochlore structure generally possesses chemical composition of A_2B_2O_7 (B= Sn, Ge, Pt, Zr, Ti etc) with a space group Fd3m and point group D_3d at A site. We selected this system as a high symmetry end to benchmark our optimization model. Its local site possesses a 3-fold rotation axis along the local [111] direction. Due to the symmetry constraints, the number of none zero CEF parameters is 6. In this chapter, we demonstrate the use of CrysFieldExplorer by comparing a list of optimized results with observables in typical measurements such as inelastic neutron scattering, susceptibility, magnetizations and anisotropy g-tensors.\n\n\n\nOne of the representative systems is the Yb_2Ti_2O_7, a promising quantum spin ice candidate with XY-type single-ion magnetic anisotropy <cit.>.  The ground states and crystal field effect of Yb^3+ have been well studied by Gaudet et al. in Ref.<cit.>. Yb^3+ has an electronic configuration of 4f^13, total angular momentum 𝐉=7/2. The crystal electric field effect originates from the surrounding O^2- ions of the Yb^3+ site. As a result, 2J+1=8 - fold degeneracy is expected to be lifted by the CEF effect from the ground state,  resulting in 7 excited levels. Additionally, Yb^3+ is a Kramers' ion, therefore the 8 - fold degeneracy are all doubly degenerate into 4 well separated doublets. A total of 3 excitations are expected to be observed through inelastic neutron scattering spectroscopy. Oxygen atoms around the local A-site form a distorted cubic structure shown in Figure <ref>. The most convenient placement of the local coordination system placing the local z - axis along the local three-fold <111> rotational axis perpendicular to the oxygen plane. The resulting Hamiltonian takes the form of:\n\n\n    H_CEF= B^0_2Ô^0_2 + B^0_4Ô^0_4 + B^3_4Ô^3_4 + B^0_6Ô^0_6 + B^3_6Ô^3_6 + B^6_6Ô^6_6.\n\n\nEq. <ref> follows the convention of Stevens operators for Ô^m_n, B^m_ns are CF parameters used to describe the Coulomb potential generated by the surrounding oxygen atoms. Inelastic neutron scattering results have been reported in Ref.<cit.>. \n\n\n1.25\n\n\nTable <ref> lists previous works on the CEF analysis for . Bertin et al.'s results <cit.> are obtained within the point-charge approximation and taken as starting parameters for the work by Gaudet etl al <cit.>. They deployed a typical mean-square-root deviation minimization algorithm that searched through the six dimensional parameter space in the vicinity of the starting values from Ref. <cit.>. By using a point-charge model to generate starting parameters, one assumes these starting values are close to the global minimum. However, Table <ref> shows that the refined value from point-charge model can be different by an order of magnitude (i.e, B^0_6, B^3_6). \n\nNow we will demonstrate the results of CrysFieldExplorer in the system. We adapt the searching algorithm using particle swarm optimization with our customized Spectrum - Characteristic Loss function discussed in previous sections. We construct the PSO model with a particle size N=400 and iteration number of 100 times. The details of the hyper-parameters can be found in Ref. <cit.>. The total loss is constructed as L_total=L_Spectrum+L1/χ, where χ in this case represents the susceptibility data. These are the same experimental data used to obtain results in Ref.<cit.>. We present CrysFieldExplorer's results in Figure <ref> and compare it with those reported in Ref.<cit.>. \n \nFigure <ref> lists all 150 results from CrysFieldExplorer on Yb_2Ti_2O_7 in a log scale along the y-axis. Each CEF parameter is plotted against a custom defined goodness of fit χ^2=[Expected Value-Observed Value]^2Expected Value^2. Readers should be aware of the definition of present χ^2 is simply the sum of percentage difference between true solution and calculated solution. It is calculated by comparing the excited energy levels and relative intensities, neutron spectroscopy, susceptibility and magnetization using CEF parameters provided in the Ref. <cit.>. This χ^2 is merely an indication of the agreement goodness between calculated and true observables. We chose χ^2 < 1 as a cut off number in present study as we find results below this number shows good overall agreement between fit and true solution. The solid grey circles represent 150 solutions generated using PSO algorithm. The solid red circles represent 13 solutions with χ^2 < 1. The blue circles mark the parameters reported from Ref. <cit.> and is taken as the \"true solution\" in this example. The χ^2 for the true solution is given an artifically 0 but shifted by 0.03 so it is visible on the log scale. One of the important observations from Figure <ref> is that there exists three local minima in the parameter space of crystal field. Observing Panel a), b), d), f) from Figure <ref> shows two out of the three local minima are concentrated regions where CrysFieldExplorer can easily converge. There is a third region that contains one acceptable solution with χ^2 <1. The true solution reported from Ref. <cit.> marked by blue circle falls in 1 of the minima. The green and black circles are in two other minima. Interestingly, while no constraints were set on B_4^3 and B_6^3, panels c) and e) show symmetric behavior w.r.t to 0 as expected by the symmetry of local crystalline environment.\n\nTo analyze the physical meaning of the CEF parameters found by CrysFieldExplorer, the main panels in Fig. <ref> a)-d) show the comparison between calculated and true results in terms of inelastic neutron scattering data, inverse susceptibility, magnetization and the ratio of g_z/g_x(y) for the Yb^3+. Unfortunately the experimentally measured susceptibility and magnetization data was not given in Ref. <cit.>. We assume the calculated susceptibility and magnetization using the CEF parameters provided from Ref. <cit.> as \"true solution\".  Each red lines in a)-c) and the red data points in d) indicate the calculated properties. The blue lines and open blue circles in a) - d) represents the true solutions. The black, green color scheme indicate two other minima results from present study corresponding to the same green and black data points in Figure <ref>. We also list our representative results (green and black data) as CEF parameters in Table <ref>. They are marked by a and b respectively. Clearly, Figure <ref> and <ref> demonstrate our PSO optimizer can successfully converge to the true CEF parameters region from Ref.<cit.>. A universal starting range of [-100,100] meV were set for all six B^m_ns in Eq.<ref>. For general users, we feel this range can be appropriately determined based on the magnitudes of excited energy levels. Additionally, as Spectrum - Characteristic Loss is smooth and can effectively avoid producing steep energy barriers seen in Fig. <ref>, a larger range for the CEF parameters should not be problematic. The average time for the PSO to converge to one solution in the 6-dimensional CEF parameter space was approximately 4.7 minutes on a 12th Gen Intel(R) Core i7-1265U laptop with single core processing. The maximum magnitude of the searching range compared to the order of the minimum CEF parameter B^0_6 is on the order of 10^4. CrysFieldExplorer can locate solutions within this vast range of parameter space within minutes. This is an example to show the powerful optimization capability with CrysFieldExplorer.\n\nObserving each panel in Figure <ref> reveals more details of CrysFieldExplorer's results. The main panels of a), b) and c) in Fig. <ref> compare the calculated solutions of χ^2 < 1 with the true solution. These solutions are over-plotted in red and form a region which makes it easier to identify the relative positions of the calculated solutions in from the true solutions. The insets of a), b) c) in Figure <ref> compare the true solution with the solutions a) and b) found and listed in Table <ref>. Solution a) and b) are indicated as green and black open circle in panel d). Readers should pay particular attention to solution a) and b) as they are in two different regions in the CEF parameter space. In panel a) of Fig.<ref>, the calculated spectrum shows good agreement with the true spectrum except at ∼ 76 meV. We estimate approximately ± 3% variation on the peak intensities from our calculated solutions compared to the true solution. The excitations at 81.8 meV and 116.2 meV matches well in both peak width and integrated intensity. In panel b), the inverse of susceptibility shows excellent agreement as well. The CEF fit and true solution are indistinguishable by eye. Panel c) shows the 10K magnetization data. The solid grey lines mark an region where the true solution and calculated solutions with χ^2 < 1 reside in. The inset of panel a), b), c) shows a similar story, no significant difference between true solution and solutions a) and b). Panel d) is the most interesting plot as it shows the ratio of the anisotropy g-tensors g_zg_x(y). Only in this panel we can distinguish solution b) from solution a) and the true solution. Observing panel d), most of the calculated anisotropy g-tensors are in one dominant region where the ratio of g_z/g_x(y) is ∼ 0.5 while g_x is close to 3.8.  Our best solution, represented by the green open circle, yields a set of g-tensor g_x(y) = 3.73 g_z = 2.07 that are within the uncertainty given from the published result of 3.69 ± 0.15 and 1.92 ± 0.20 <cit.>.The ratio of g_z/g_x(y) is of particular interest. Previous polarized neutron studies from Cao <cit.> reported g_x(y)=4.1 and g_z=2.25 resulting in a ratio of 1.82. Bertin's <cit.> and Gaudet's<cit.> results are listed in Table <ref> with g_z/g_x(y)= 2.0 and 1.92. From our solution a), the ratio can be calculated to be 1.79 closes to Cao 's result. Now we turn our attention to solution b). Despite having a good agreement with the experimental values in the bulk property measurements, it shows a strong ratio of g_z/g_x(y) ∼ 3.5, with g_z=4.51 significantly larger than solution a) and the true solution. This observation suggests solution b) represents a local minimum that fits well with limited constraints. By analyzing the anisotropy g-tensor, we conclude that solution b) does not agree with the physical model of .\n\nNow we turn our focus to solution a) which is in a different region with the true solution, but we cannot distinguish solution a) from the true solution by all the given measurements. Table <ref> compares the ground state wavefunctions between solution a) marked by green circle in Figure <ref> and that reported in Ref. <cit.>. Both solutions also produce similar ground state wavefunctions as reflected by the similarity in the anisotropy g-tensors. The dominant term in the ground state wave function from both solutions are the ±12 terms. \n\nCombining these results with previous discussions suggests solution a) is a degenerate solution under the existing constraints imposed by the experimental data reported in the system. Only one set of CEF parameters were reported in each paper from previous studies <cit.>, but our discovery implies that these papers may need more data to conclusively determine the CEF parameters. The ground state of has been extensively studied from various perspectives and our results do not imply whether the previous analyses are incorrect. However, it is an alarming discovery that suggests future CEF analysis should be cautious in confirming or denying their findings. In next chapter, we will show that lack of enough constraints may pose serious uncertainty in determining the true CEF parameters. \n\n\n2.2\n\n\n\n \nRegardless of which set of CEF parameters is correct, one of CrysFieldExplorer's biggest advantages is the capability to directly commence the fitting procedure starting from Eq. <ref> without any a priori knowledge of the starting parameters. This allows users to skip the step of building a point-charge model or conduct Monte Carlo simulation, either of which can be daunting for inexperienced users. CrysFieldExplorer only requires a wide fitting range to be given. All the parameters of were chosen from a range of [-100, 100] meV which can be estimated from the magnitude of the leading B_2^2 term. This range requirement can be easily estimated by users. Too large or too small beyond this range could result in the excited energy levels to be unreasonable large or small. \n\nTo conclude, in this section we demonstrate that CrysFieldExplorer can quickly produce a list of CEF solutions for including the ones reported in the literature. Our improved loss function L_Spectrum has a higher sensitivity to the change of CEF parameters and a better global structure that allows us to search through a wide range of parameter space. Identifying which one is the real solution is more complicated. On the one hand, there may not be enough constraints to conclude which solution is the correct one. On the other hand, as most of the experimental data are collected from powder sample, the information about the relationship between local coordinates and crystal structure is intrinsically missing, thus rendering the the model unable to reduce further to one result.\n\n\n\n\n\n\n §.§ Analysis on the Crystal Field Parameters of the Low Symmetry Tripod Kagome Lattice Er_3Mg_2Sb_3O_14\n\n\nNow we consider a more challenging case - a tripod Kagome lattice that hosts various exotic magnetic ground states depending on the constituent rare earth element <cit.>. We picked Er_3Mg_2Sb_3O_14 as the test case here. The CEF fitting becomes more challenging for a magnetic ion at low point-symmetry site because the number of none zero crystal field parameters increases. Fig. <ref> shows the local structure of an Er atom in the tripod Kagome lattice Er_3Mg_2Sb_3O_14 with a space group of R3m. The rare earth ion Er^3+ is surrounded by eight oxygen atoms similar to that in pyrochlore system. However, the local site symmetry becomes C_2h in the tripod Kagome lattice, much lower than D_3d in the pyrochlore lattice. The twofold rotational C_2 axis lies in the Kagome plane and is displayed in Fig. <ref> as the green arrow on the center Er atom. As a result, this system requires 15 CEF parameters to fully describe the crystal field Hamiltonian,\n\n    H_CEF=    B^0_2Ô^0_2 + B^1_2Ô^1_2 + B^2_2Ô^2_2 + B^0_4Ô^0_4 + B^1_4Ô^1_4 + B^2_4Ô^2_4\n        + B^3_4Ô^3_4 + B^4_4Ô^4_4 + B^0_6Ô^0_6 + B^1_6Ô^1_6 + B^2_6Ô^2_6 + B^3_6Ô^3_6 \n       + B^4_6Ô^4_6 + B^5_6Ô^5_6 +B^6_6Ô^6_6.\n\n\nAccording to Hund's rule, the total, spin and orbit angular momentum for Er^3+ are J=15/2, S=3/2 and L=6 respectively. This results in 2J+1=16 fold degeneracy for the ground state of Er^3+. Since Er^3+ is a Kramer ion, all 16 levels are doublets, 7 excited states are expected to be observed from inelastic neutron scattering measurement. Dun et al. <cit.> observed 6 out of 7 CEF transitions at 6.4(2), 10.5(3), 21.6(4), 50(1), 65(1) and 67.5(9) meV. Due to the large amount of none zero CEF parameters, they were not able to directly fit the CEF transitions with currently existing software packages such as PyCrystalField. A list of CEF parameters was obtained from an effective point-charge model which effectively reduced the number of fitted parameters. \n\nNow we demonstrate how CrysFieldExplorer can help provide insight to this problem and discuss why directly fitting the CEF parameters with given experimental data was not feasible. Due to the low site symmetry in Er_3Mg_2Sb_3O_14, the parameter space is magnitudes larger than that in and traditional mean-square-root loss function is less sensitive to the 15 CEF parameters comparing to L_Spectrum as demonstrated previously in Fig. <ref>. To handle this case, we need to improve the optimization from our previous particle swarm optimizer. We continue apply the L_Spectrum and deploy the Covariance Matrix Adaptation Evolution Strategy (CMA-ES) <cit.>, which converges rapidly on complex optimization problems where the global minimum is extremely sharp in the parameter phase space. \n\nFor a local site with low point group symmetry such as monoclinic in the present case, the choice of principle xyz axis can be somewhat arbitrary. In the case of tripod Kagome lattice, the y-axis is chosen to be parallel to the two-fold rotational axis C_2 such that none zero terms of the CEF parameters are expressed in Eq. <ref>. The choice of x and z axis is arbitrarily defined within a perpendicular plane to the C_2 rotational axis. The x-z plane is indicated as the green plane in Fig. <ref>. The dashed and solid arrows indicate x and z axis are not fixed within the plane perpendicular to y-axis.  Rudowicz <cit.> has demonstrated that within the 15 CEF parameters, certain rotations exists along y-axis that make one of the CEF parameters 0 . Here we deploy the transformation of rotating the CEF coordination system w.r.t local y-axis by an angle α such that B_2^0 is 0 for all the solutions. The rotational angle α is defined as,\n\n    tan(2α)=B_2^13 × B_2^0-B_2^2.\n\n\nThe rotational transformations of relevant CEF parameters have been tabulated in Table 2 from Ref.<cit.>. The CEF parameters reported here have all been transformed under this standardization rule with each set of parameters rotated by an angle α. A complete list of CEF parameters and the transformation angle α are plotted in SFig. 1 in the supplemental material. \n\nWe summarize our results in Fig. <ref>. Different to the case, CrysFieldExplorer can find a large number of solutions across the parameter space with no obvious segregation. We first look at Fig. <ref> c). As has 15 (14 independent) CEF parameters, we choose the B_2^0 as an example and plot the custom defined χ^2 loss on a log scale. The solid grey circles indicate all 150 solutions produced by CrysFieldExplorer in a time span of approximately 12 hours. We chose 1 as a cutoff number for the custom defined χ^2 and denote the best and worst 10 solutions with χ^2 <1 using green and blue open circles. Meanwhile, open blue circles indicate the true solution. The χ^2 for the true solution is artificially defined as 0 but shifted by a small number of 0.03 in order to be shown on the log plot.\n\nFigure <ref> a) and b) show the neutron data on the energy transfer range from -1 to 33 meV and 25 to 90 meV respectively. Fig. <ref> d) is the inverse susceptibility data. The solid grey lines in these three plots are an overlay of all the solutions with χ^2 < 1 found by CrysFieldExplorer using CMA-ES algorithm optimizing L_Spectrum. The open blue circle indicates the solution taken from Ref.<cit.> which are treated as true solution. Fig. <ref> a) b) and d) are the three data sets used by CrysFieldExplorer during the optimization process.\n\nFigure <ref> e) compares the calculated magnetizations with the true solution. The solid red lines and solid red lines mark the top and last 10 solutions with χ^2 < 1. Following the same color scheme, open blue circles are the true solution. We drew two solid grey lines to indicate a region where all the solutions stay within. The determination of the grey lines are guided by eye. \n\nFigure <ref> f) shows the ratio of the anistropy g-tensors. The grey squares indicate the ratio between the largest and smallest while the pink triangle indicate the largest and 2nd smallest anisotropy g-tensors for all solutions with χ^2 < 1. The green and red square represent the top and last 10 CEF fits with χ^2 < 1.\n\nFigure <ref> reveals several important features of CrysFieldExplorer when applied to the system. CrysFieldExplorer can perform perfect fits to the neutron data in panels a) and b) to the degree that is impossible for the human eyes to distinguish. We performed fitting on both the discrete CEF energy levels and their relative intensity as well as fitting directly on the neutron spectrum by applying a resolution limited Lorentzian function to compute the entire spectrum. There are 73 out of 150 sets of parameters with χ^2 < 1, all of them produced perfect match to human eyes between the true solution and CEF fit. Additional constraints were imposed when adding the inverse susceptibility data to the fit. However, within the χ^2 < 1 range, CrysFieldExplorer was still able to discover multiple solutions that fit all given experimental observables well. \n\nThe powder averaged magnetization data was not considered during the fit process but used as a benchmark to check the fitting results. Comparing magnetization data in panel e) of Fig. <ref>, we start noticing differences between each solution set. The top 10 solutions show good match to the true solution at all magnetic fields measured. However, the last 10 CEF fitted solutions with χ^2 < 1 begin to show small deviations at 4 T magnetic field. However, we argue our these 10 solutions still fit all the data well and could still be considered acceptable a few decades ago given the computing power at that time. This shows the efficiency and accuracy CrysFieldExplorer exhibits when being deployed on the latest high-performance computers.\n\nFigure <ref> f) is particularly interesting because it indicates all of the solutions produced by CrysFieldExplorer are Ising-like, that is one of the three g_x, g_y or g_z are dominant comparing to the other two. We do not distinguish g_x, g_y or g_z here because there is a certain degree of freedom in choosing the local frame. From present data, it is not possible to obtain the relationship between local frame and global frame. Similar to the case, the powder data measured with the mentioned techniques do not have crystal structure resolution. \n\n\n\n\n\n\nTo conclude, our results show that with increased free CEF parameters, the constraints required to narrow down to a single solution also increases drastically. CrysFieldExplorer was able to produce 73 solutions out of 150 searches that matches neutron data and susceptibility data well. The powder averaged magnetization data were not used in the fitting because it is computationally expensive to calculate the powder average. However, single crystal magnetization data could be added in the fitting without much penalty on the computational cost to impose more constraints. Despite not being able narrow down to one or a few solutions, CrysFieldExplorer is able to produce a list of acceptable solutions. These solutions produce excellent agreement between the observed and measured data such as inelastic neutron scattering spectrum, susceptibility, and magnetization measurements. We demonstrate in the case of , neutron spectroscopy and susceptibility do not impose enough constraints to fully describe the problem, thus making it an under-determined case when only considering limited experimental observables. Therefore, we agree with the statement in the original paper that direct fitting of the CEF parameter is not possible <cit.>. Nonetheless, in the system, by wrapping L_Spectrum into CMA-ES, we show the strong capability and high efficiency CrysFieldExplorer exhibits. The approximated time span to generate 150 sets of solutions is approximately 12 hours. We argue 73 of the 150 solutions produce acceptable results. Future updates can further improve the efficiency by leveraging high performance computing on multi-core processors on user-end computers. CrysFieldExplorer's results also suggest that when fitting a large number of CEF parameters, user should exercise extra caution when choosing the correct solution. In some of the previous research, a solution is believed to be valid when the neutron scattering data, susceptibility data, magnetization measurements, anisotropy g-tensors, etc are all consistent. However, utilizing CrysFieldExplorer's efficient algorithm, we show that these condition can all be met with very good agreement between experimental and fitted results in low site symmetry materials such as with 15 (14 independent) none zero CEF parameters. As the number of CEF parameter increases, more experimental data should be acquired to fit the CEF Hamiltonian with experimental model to obtain conclusive results. These can be, but not limited to, polarized neutron diffraction, specific heat etc. Future researchers should be cautious to draw conclusions on CEF analysis when considering limited experimental data.\n\n\n\n§ IMPLEMENTATION\n\n\nWe aim to provide the most straight forward implementations for CrysFieldExplorer to the research community. Users first need to specify the magnetic ions and local site symmetry. This allows CrysFieldExplorer to generate a list of none-zero CEF parameters. Then the total, orbital and spin angular momentum J, L and S can be automatically determined. The program will construct the Hamiltonian up to 6th order using the Stevens operators as well as the matrix representation of J_plus, J_minus and J_z. Then users can import the experimentally measured data into the program for fitting. In the present version of CrysFieldExplorer, it is able to fit neutron scattering data, susceptibility, single crystal magnetization, anisotropy g-tensor data all together with different weights. For neutron scattering data, relative intensities of the observed transitions from the ground state need to be specified by users from a data reduction software. The currently required data format is a two-column text file. The experimental data will be loaded into the optimization program. For high-symmetry cases the program will select particle swarm optimization and for low-symmetry system a more efficient CMA-ES will be chosen instead. The loss function will be predetermined as discussed before. Although CrysFieldExplorer does not require a set of specific starting parameters, a suitable range for all CEF parameters still needs to be given. However, this can be estimated from the magnitudes of the transition energy levels from the inelastic neutron scattering. The optimization strategy will minimize Spectrum - Characteristic Loss first. Once Spectrum - Characteristic Loss reaches -10, it will start optimizing magnetic measurements or any other user defined data. Users are able to prioritize different data by fine tuning their respective weights.  By default, CrysFieldExplorer will generate 100 converged CEF parameters in .csv file. These parameters can be checked with either CrysFieldExplorer or a 3rd party software for consistency. The detailed implementation of CrysFieldExplorer can be found at https://github.com/KyleQianliMa/CrisFieldExplorer.\n\n\n\n§ USE AND LIMITATIONS\n\nThe program CrysFieldExplorer presented here provides a fast converging, gradient free method that scans through large CEF parameter phase space to provide satisfactory results based on user input. It bypasses the need of determining initial parameters from point-charge model which can be difficult for inexperienced users. CrysFieldExplorer contains two optimization methods, PSO and CMA-ES, to minimize a set of specially designed loss functions. The choice of each optimization method is generally chosen such that for CEF parameters <6, PSO is chosen, otherwise CMA-ES is preferred. Although CrysFieldExplorer can successfully produce reliable solutions, it cannot interpret the physical meaning of each solution. Furthermore, if the problem is under-defined, that is experimental data does not pose enough constraints to the CEF Hamiltonian, multiple solutions produced by CrysFieldExplorer can be confusing to determine which solution is the correct solution. Although we provide two optimization methods, there has not been a standard way to choose the best optimization methods for different problems. The weight for different losses can also be tricky to balance. In some test cases it is easier to fit one experiment than another. Finally, the current version of CrysFieldExplorer does not provide a user interface. It requires users with basic knowledge of Python programming language.\n\n\n\n§ CONCLUSION\n\nWe have developed a lite python-based program CrysFieldExplorer to provide an efficient procedure of fitting the CEF parameters from experimental data. CrysFieldExplorer uses two evolutionary algorithms - particle swarm optimization (PSO) and Covariance Matrix Adaptation Evolution Strategy (CMA-ES) to minimize a newly designed loss function - Spectrum Characteristic loss L_Spectrum. Comparing L_Spectrum function with traditional mean-square-root loss, we showed that L_Spectrum is more sensitive to input parameters, significantly reduces the steepness of energy barriers on the parameter-loss space and has a better global structure around local and global minima. This allows CrysFieldExplorer to start the fitting procedure directly from the CEF Hamiltonian without prior knowledge of starting parameters. Although a fitting range of the CEF parameter is required, the range can be generously given such that it matches the magnitudes of the excited CEF energy levels. To demonstrate the use of CrysFieldExplorer, we have provided two examples in two different systems to show that our algorithm can discover multiple solutions that matches experimental data equally well. Our findings suggest that as the number of to-be-fitted CEF parameters increases, traditional experimental observables such as neutron scattering data, susceptibility and magnetization measurement may not impose enough constraints to fully describe the problem. Furthermore, neither the powder neutron spectroscopy nor the powder susceptibility data have crystal structure resolution to define the connection between local ion and crystal structure frame. This arbitrariness could further produce confusion when determining the correct CEF fit. Therefore, the present standard of reporting CEF parameters may not be conclusive as the CEF parameter phase space is highly degenerate. When conducting CEF analysis with limited experimental data, further measurements such as polarized neutron diffraction can provide additional information to help better determine the correct CEF Hamiltonian. \n\n\n\n§ ACKNOWLEDGMENTS\n\n\nThe research at Oak Ridge National Laboratory (ORNL) was supported by the U.S. Department of Energy (DOE), Office of Science, Office of Advanced Scientific Computing Research under the contract ERKJ387, and Office of Basic Energy Sciences, Early Career Research Program Award KC0402020, under Contract DE-AC05-00OR22725. A portion of this research used resources at the High Flux Isotope Reactor and the Spallation Neutron Source, DOE Office of Science User Facilities operated by the Oak Ridge National Laboratory.\n\n\n\n\n\n\n\n\n\n\n51\nfxundefined [1]\n ifx#1\n\nfnum [1]\n #1firstoftwo\n secondoftwo\n \nfx [1]\n #1firstoftwo\n secondoftwo\n \n\n\n\n\n\nnoop [0]secondoftwo\n\nref[1]@startlink#1@href\nhref[1]#1@endlink\nanitize@url [0]`\n12`$12`&12`#12`1̂2`_12`%12\nstartlink[1]\nendlink[0]\n\nrl [1]href #1\n\n\n\n\n\n\n\n\n\n\n\n\n@bib@innerbibempty\n\n[Gingras et al.(2000)Gingras, den Hertog, Faucher, Gardner, Dunsiger, Chang, Gaulin, Raju, and Greedan]PhysRevB.62.6496\n  author author M. J. P.  Gingras, author B. C.  den Hertog, author M. Faucher, author J. S.  Gardner, author S. R.  Dunsiger, author L. J.  Chang, author B. D. Gaulin, author N. P. Raju,   and author J. E. Greedan,  title title Thermodynamic and\n  single-ion properties of Tb^3+ within the collective\n  paramagnetic-spin liquid state of the frustrated pyrochlore antiferromagnet\n  Tb_2Ti_2O_7, 10.1103/PhysRevB.62.6496 journal journal Phys.\n  Rev. B volume 62, pages 6496–6511\n  (year 2000)NoStop\n[Gardner et al.(2010)Gardner, Gingras, and Greedan]Gardener\n  author author Jason S.  Gardner, author Michel J. P.  Gingras,  and author John E.  Greedan, title title\n  Magnetic pyrochlore oxides, 10.1103/RevModPhys.82.53\n  journal journal Rev. Mod. Phys. volume 82, pages 53–107 (year\n  2010)NoStop\n[Cao et al.(2009a)Cao, Gukasov, Mirebeau, Bonville, Decorse, and Dhalenne]huiboPRL\n  author author H. Cao, author A. Gukasov,\n  author I. Mirebeau, author P. Bonville, author\n  C. Decorse,  and author\n  G. Dhalenne, title title Ising versus XY Anisotropy in Frustrated\n  R_2Ti_2𝐎_7 Compounds as “Seen” by Polarized\n  Neutrons, 10.1103/PhysRevLett.103.056402 journal journal Phys. Rev. Lett. volume 103, pages 056402 (year\n  2009a)NoStop\n[Bertin et al.(2012)Bertin,\n  Chapuis, de Réotier, and  Yaouanc]Bertin_2012\n  author author A Bertin, author Y Chapuis,\n  author P Dalmas de Réotier,  and author A Yaouanc, title title Crystal\n  electric field in the R_2Ti_2O_7 pyrochlore compounds, 10.1088/0953-8984/24/25/256003 journal journal Journal of Physics: Condensed Matter volume\n  24, pages 256003 (year 2012)NoStop\n[Gaudet et al.(2015)Gaudet,\n  Maharaj, Sala, Kermarrec,\n  Ross, Dabkowska, Kolesnikov,\n  Granroth, and Gaulin]JoYb2015\n  author author J. Gaudet, author D. D. Maharaj,\n  author G. Sala, author\n  E. Kermarrec, author\n  K. A. Ross, author\n  H. A. Dabkowska, author\n  A. I. Kolesnikov, author\n  G. E. Granroth,  and author\n  B. D. Gaulin, title\n  title Neutron spectroscopic study of crystalline\n  electric field excitations in stoichiometric and lightly stuffed\n  Yb_2Ti_2O_7, 10.1103/PhysRevB.92.134420 journal journal Phys.\n  Rev. B volume 92, pages 134420\n  (year 2015)NoStop\n[Dun et al.(2021)Dun,\n  Bai, Stone, Zhou, and  Mourigal]zhilin\n  author author Zhiling Dun, author Xiaojian Bai,\n  author Matthew B. Stone,\n  author Haidong Zhou,  and  author Martin Mourigal,  title title Effective point-charge\n  analysis of crystal fields: Application to rare-earth pyrochlores and tripod\n  kagome magnets\n  R_3Mg_2Sb_3O_14,  10.1103/PhysRevResearch.3.023012 journal\n  journal Phys. Rev. Research volume\n  3, pages 023012 (year 2021)NoStop\n[Paddison et al.(2017)Paddison, Daum, Dun, Ehlers, Liu, Stone, Zhou,  and Mourigal]paddison2017continuous\n  author author Joseph AM  Paddison, author Marcus  Daum, author Zhiling  Dun, author Georg Ehlers, author Yaohua Liu,\n  author Matthew B Stone, author Haidong Zhou,  and author Martin Mourigal, title title Continuous excitations of the\n  triangular-lattice quantum spin liquid YbMgGaO_4, @noop \n  journal journal Nature Physics volume 13, pages 117–122 (year\n  2017)NoStop\n[Gaudet et al.(2019)Gaudet,\n  Smith, Dudemaine, Beare,\n  Buhariwalla, Butch, Stone,\n  Kolesnikov, Xu, Yahne,\n  Ross, Marjerrison, Garrett,\n  Luke, Bianchi, and Gaulin]JoPRL\n  author author J. Gaudet, author E. M. Smith,\n  author J. Dudemaine, author J. Beare, author\n  C. R. C. Buhariwalla, author\n  N. P. Butch, author\n  M. B. Stone, author\n  A. I. Kolesnikov, author\n  Guangyong Xu, author\n  D. R. Yahne, author\n  K. A. Ross, author\n  C. A. Marjerrison, author\n  J. D. Garrett, author\n  G. M. Luke, author\n  A. D. Bianchi,  and author\n  B. D. Gaulin, title\n  title Quantum Spin Ice Dynamics in the\n  Dipole-Octupole Pyrochlore Magnet\n  Ce_2Zr_2O_7, 10.1103/PhysRevLett.122.187201 journal journal\n  Phys. Rev. Lett. volume 122, pages\n  187201 (year 2019)NoStop\n[Bramwell and Gingras(2001)]Gingras2001\n  author author Steven T.  Bramwell and author Michel\n  J. P. Gingras, title title Spin ice state in frustrated magnetic pyrochlore materials,  10.1126/science.1064761 journal journal Science volume 294, pages\n  1495–1501 (year 2001), http://arxiv.org/abs/https://www.science.org/doi/pdf/10.1126/science.1064761\n  https://www.science.org/doi/pdf/10.1126/science.1064761 NoStop\n[Ross et al.(2011a)Ross, Savary,\n  Gaulin, and Balents]kate2011\n  author author Kate A. Ross, author Lucile Savary,\n  author Bruce D. Gaulin,  and  author Leon Balents, title title Quantum excitations in quantum spin\n  ice, 10.1103/PhysRevX.1.021002 journal\n  journal Phys. Rev. X volume 1,  pages 021002 (year 2011a)NoStop\n[Porée et al.(2022)Porée, Lhotel, Petit, Krajewska, Puphal, Clark, Pomjakushin, Walker, Gauthier,\n  Gawryluk, and Sibille]cefcehfo\n  author author Victor Porée, author Elsa Lhotel,\n  author Sylvain Petit, author Aleksandra Krajewska, author Pascal Puphal, author\n  Adam H. Clark, author\n  Vladimir Pomjakushin, author\n  Helen C. Walker, author\n  Nicolas Gauthier, author\n  Dariusz J. Gawryluk,  and author Romain Sibille, title title Crystal-field states and defect levels\n  in candidate quantum spin ice\n  Ce_2Hf_2O_7, 10.1103/PhysRevMaterials.6.044406 journal journal\n  Phys. Rev. Mater. volume 6, pages\n  044406 (year 2022)NoStop\n[Keimer and Moore(2017)]keimer2017physics\n  author author B Keimer and author JE Moore,  title title The physics of quantum\n  materials, @noop  journal journal\n  Nature Physics volume 13, pages\n  1045–1055 (year 2017)NoStop\n[Smith et al.(2022)Smith,\n  Benton, Yahne, Placke,\n  Schäfer, Gaudet, Dudemaine,\n  Fitterman, Beare, Wildes,\n  Bhattacharya, DeLazzer, Buhariwalla, Butch, Movshovich,\n  Garrett, Marjerrison, Clancy,\n  Kermarrec, Luke, Bianchi,\n  Ross, and Gaulin]evanprx\n  author author E. M. Smith, author O. Benton,\n  author D. R. Yahne, author B. Placke, author\n  R. Schäfer, author\n  J. Gaudet, author J. Dudemaine, author A. Fitterman, author J. Beare, author A. R.  Wildes, author S. Bhattacharya, author T. DeLazzer, author C. R. C. Buhariwalla, author N. P. Butch, author R. Movshovich,\n  author J. D. Garrett, author C. A. Marjerrison, author J. P. Clancy, author\n  E. Kermarrec, author\n  G. M. Luke, author\n  A. D. Bianchi, author\n  K. A. Ross,  and author\n  B. D. Gaulin, title\n  title Case for a U(1)_\n  Quantum Spin Liquid Ground State in the Dipole-Octupole Pyrochlore\n  Ce_2Zr_2O_7, 10.1103/PhysRevX.12.021015 journal journal Phys.\n  Rev. X volume 12, pages 021015\n  (year 2022)NoStop\n[Fulde et al.(1970)Fulde,\n  Hirst, and Luther]fulde1970superconductors\n  author author Peter Fulde, author LL Hirst,  and  author Alan Luther, title title Superconductors containing impurities\n  with crystal-field split energy levels, @noop  journal journal Zeitschrift für Physik A Hadrons and\n  nuclei volume 230, pages 155–177\n  (year 1970)NoStop\n[Mesot and Furrer(1997)]mesot1997crystal\n  author author Joël  Mesot and author A Furrer, title title The crystal\n  field in rare earth based high-temperature superconductors, @noop \n  journal journal Journal of superconductivity  volume 10, pages 623–643 (year 1997)NoStop\n[Lynn et al.(1980)Lynn,\n  Moncton, Passell, and Thomlinson]hightccef19809\n  author author J. W. Lynn, author D. E. Moncton,\n  author L. Passell,  and  author W. Thomlinson, title title Magnetic correlations and\n  crystal-field levels in the superconductor\n  (Ce_0.73Ho_0.27) Ru_2,  10.1103/PhysRevB.21.70 journal journal Phys. Rev. B volume 21, pages 70–78 (year 1980)NoStop\n[Metoki et al.(2004)Metoki,\n  Kaneko, Matsuda, Galatanu,\n  Takeuchi, Hashimoto, Ueda,\n  Settai, Ōnuki, and Bernhoeft]metoki2004magnetic\n  author author N Metoki, author K Kaneko,\n  author TD Matsuda, author A Galatanu, author\n  T Takeuchi, author S Hashimoto, author T Ueda, author R Settai, author Y Ōnuki,   and author N Bernhoeft,  title title Magnetic structure and the\n  crystal field excitation in heavy-fermion antiferromagnetic superconductor\n  cept_3si, @noop  journal journal\n  Journal of Physics: Condensed Matter volume 16,  pages L207 (year 2004)NoStop\n[Goremychkin et al.(2004)Goremychkin, Osborn, Bauer, Maple, Frederick, Yuhasz, Woodward, and Lynn]CEF2004hightc\n  author author E. A. Goremychkin, author R. Osborn,\n  author E. D. Bauer, author M. B. Maple, author\n  N. A. Frederick, author\n  W. M. Yuhasz, author\n  F. M. Woodward,  and author\n  J. W. Lynn, title title Crystal Field Potential of\n  PrOs_4Sb_12:\n  Consequences for Superconductivity, 10.1103/PhysRevLett.93.157003 journal journal\n  Phys. Rev. Lett. volume 93, pages\n  157003 (year 2004)NoStop\n[Rubio Temprano et al.(2000)Rubio Temprano, Mesot, Janssen,\n  Conder, Furrer, Mutka, and  Müller]hightccef1\n  author author D. Rubio Temprano, author J. Mesot, author S. Janssen,\n  author K. Conder, author A. Furrer, author\n  H. Mutka,  and author\n  K. A. Müller, title\n  title Large Isotope Effect on the Pseudogap in the\n  High-Temperature Superconductor\n  HoBa_2Cu_4O_8, 10.1103/PhysRevLett.84.1990 journal journal\n  Phys. Rev. Lett. volume 84, pages\n  1990–1993 (year 2000)NoStop\n[Boothroyd et al.(1992)Boothroyd, Doyle, Paul, and Osborn]boothroydcef\n  author author A. T. Boothroyd, author S. M. Doyle, author D. MK. Paul,   and author R. Osborn,  title title Crystal-field excitations\n  in Nd_2CuO_4,\n  Pr_2CuO_4, and related n-type\n  superconductors, 10.1103/PhysRevB.45.10075 journal journal Phys. Rev. B volume\n  45, pages 10075–10086 (year 1992)NoStop\n[Pickett(2021)]pickett2021dawn\n  author author Warren E  Pickett, title title\n  The dawn of the nickel age of superconductivity, @noop \n  journal journal Nature Reviews Physics volume 3, pages 7–8 (year\n  2021)NoStop\n[Stevens(1952)]Stevens_1952\n  author author K W H Stevens, title title Matrix elements\n  and operator equivalents connected with the magnetic properties of rare earth\n  ions, 10.1088/0370-1298/65/3/308 journal\n  journal Proceedings of the Physical Society. Section A  volume 65, pages 209–215 (year 1952)NoStop\n[Hutchings(1964)]hutchings1964point\n  author author M.T. Hutchings, title title Point-charge\n  calculations of energy levels of magnetic ions in crystalline electric\n  fields,  (publisher Academic Press, year\n  1964) pp. pages 227–273NoStop\n[Lea et al.(1962)Lea,\n  Leask, and Wolf]lea1962raising\n  author author KR Lea, author MJM Leask,  and  author WP Wolf, title title The raising of angular momentum\n  degeneracy of f-electron terms by cubic crystal fields, @noop \n  journal journal Journal of Physics and Chemistry\n  of Solids volume 23, pages 1381–1405\n  (year 1962)NoStop\n[Walter(1984)]walter1984treating\n  author author U Walter, title title Treating crystal\n  field parameters in lower than cubic symmetries, @noop  journal journal journal of physics and chemistry of solids  volume 45, pages 401–408 (year 1984)NoStop\n[Loewenhaupt(1990)]loewenhaupt1990crystal\n  author author M Loewenhaupt, title title Crystal\n  fields in low symmetry systems, @noop  journal\n  journal Physica B: Condensed Matter volume 163, pages 479–482 (year\n  1990)NoStop\n[Boothroyd(2014)]spectre\n  author author AT Boothroyd, title title Spectre, a\n  program for calculating spectroscopic properties of rare earth ions in\n  crystals, @noop    (year 2014)NoStop\n[Rotter(2013)]McPhase\n  author author M. Rotter, title title Mcphase,  http://www.mcphase.de/   (year 2013)NoStop\n[Arnold et al.(2014)Arnold,\n  Bilheux, Borreguero, Buts,\n  Campbell, Chapon, Doucet,\n  Draper, Ferraz Leal, Gigg,\n  Lynch, Markvardsen, Mikkelson, Mikkelson, Miller, Palmen, Parker, Passos, Perring, Peterson, Ren, Reuter, Savici, Taylor, Taylor, Tolchenov, Zhou, and  Zikovsky]Mantid\n  author author O. Arnold, author J.C. Bilheux,\n  author J.M. Borreguero, author A. Buts, author\n  S.I. Campbell, author\n  L. Chapon, author M. Doucet, author N. Draper, author R. Ferraz Leal, author M.A.  Gigg, author V.E. Lynch, author A. Markvardsen,\n  author D.J. Mikkelson, author R.L. Mikkelson, author\n  R. Miller, author K. Palmen, author P. Parker, author G. Passos, author T.G.  Perring, author P.F.  Peterson, author S. Ren, author M.A. Reuter,\n  author A.T. Savici, author J.W. Taylor, author\n  R.J. Taylor, author\n  R. Tolchenov, author\n  W. Zhou,  and author\n  J. Zikovsky, title title Mantid—Data analysis and visualization package for\n  neutron scattering and μSR experiments, https://doi.org/10.1016/j.nima.2014.07.029 journal journal Nuclear Instruments and Methods in Physics Research Section A:\n  Accelerators, Spectrometers, Detectors and Associated Equipment volume 764, pages 156–166 (year\n  2014)NoStop\n[Baldovi et al.(2013)Baldovi, Cardona-Serra, Clemente-Juan,\n  Coronado, Gaita-Ariño, and  Palii]baldovi2013simpre\n  author author Jose J Baldovi, author Salvador Cardona-Serra, author Juan M Clemente-Juan, author Eugenio Coronado, author Alejandro Gaita-Ariño,  and author Andrew  Palii, @noop  title Simpre: A\n  software package to calculate crystal field parameters, energy levels, and\n  magnetic properties on mononuclear lanthanoid complexes based on charge\n  distributions,  (year 2013)NoStop\n[R.Osborn(2017)]CFcal\n  author author R.Osborn, title title Cfcal, https://github.com/rayosborn/cfcal   (year\n  2017)NoStop\n[Fabi(1995)]fabi1995focus\n  author author Peter Fabi, @noop  title FOCUS: an interactive\n  crystal electric field parameter fitting package using neutron scattering\n  data (publisher Council for the Central Laboratory of the\n  Research Councils, year 1995)NoStop\n[Scheie(2021)]scheie2021pycrystalfield\n  author author Allen Scheie, title title Pycrystalfield:\n  software for calculation, analysis and fitting of crystal electric field\n  hamiltonians, @noop  journal journal\n  Journal of Applied Crystallography volume 54,  pages 356–362 (year 2021)NoStop\n[Bonyadi and Michalewicz(2017)]PSO\n  author author Mohammad Reza  Bonyadi and author Zbigniew  Michalewicz, title title\n  Particle Swarm Optimization for Single Objective Continuous Space Problems:\n  A Review, 10.1162/EVCO_r_00180 journal\n  journal Evolutionary Computation volume\n  25, pages 1–54 (year 2017)NoStop\n[Hansen(2006)]hansen2006cma\n  author author Nikolaus  Hansen, title title The\n  CMA evolution strategy: a comparing review, @noop  journal journal Towards a new evolutionary computation:\n  Advances in the estimation of distribution algorithms , pages\n  75–102 (year 2006)NoStop\n[Tokura et al.(2017)Tokura,\n  Kawasaki, and Nagaosa]tokura2017emergent\n  author author Yoshinori  Tokura, author Masashi  Kawasaki,  and author Naoto  Nagaosa, title title\n  Emergent functions of quantum materials, @noop  journal journal Nature Physics volume\n  13, pages 1056–1068 (year 2017)NoStop\n[Ball(2017)]ball2017quantum\n  author author Philip Ball, title title Quantum materials:\n  Where many paths meet, @noop  journal journal MRS Bulletin volume 42, pages 698–705 (year 2017)NoStop\n[Giustino et al.(2021)Giustino, Lee, Trier, Bibes, Winter, Valentí, Son, Taillefer, Heil, Figueroa et al.]giustino20212021\n  author author Feliciano  Giustino, author Jin Hong  Lee, author Felix Trier, author Manuel Bibes,\n  author Stephen M Winter,\n  author Roser Valentí,\n  author Young-Woo Son, author Louis Taillefer, author\n  Christoph Heil, author\n  Adriana I Figueroa,  et al.,  title title The 2021 quantum materials\n  roadmap, @noop  journal journal\n  Journal of Physics: Materials volume 3, pages 042006 (year 2021)NoStop\n[Cava et al.(2021)Cava,\n  De Leon, and Xie]cava2021introduction\n  author author Robert Cava, author Nathalie De Leon,  and author Weiwei Xie, @noop  title Introduction: quantum\n  materials,  (year 2021)NoStop\n[Bassman et al.(2020)Bassman, Gulania, Powers, Li, Linker, Liu, Kumar,\n  Kalia, Nakano, and Vashishta]bassman2020domain\n  author author Lindsay Bassman, author Sahil Gulania, author Connor Powers, author Rongpeng Li,\n  author Thomas Linker, author Kuang Liu, author\n  TK Satish Kumar, author\n  Rajiv K Kalia, author\n  Aiichiro Nakano,  and author\n  Priya Vashishta, title\n  title Domain-specific compilers for dynamic\n  simulations of quantum materials on quantum computers, @noop \n  journal journal Quantum Science and Technology  volume 6, pages 014007 (year\n  2020)NoStop\n[Lau et al.(2020)Lau,\n  Xia, and Cao]lau2020emergent\n  author author Chun Ning  Lau, author Fengnian  Xia,  and author Linyou  Cao, title title\n  Emergent quantum materials, @noop  journal\n  journal MRS Bulletin volume 45,  pages 340–347 (year 2020)NoStop\n[Stanev et al.(2021)Stanev,\n  Choudhary, Kusne, Paglione,  and Takeuchi]stanev2021artificial\n  author author Valentin  Stanev, author Kamal  Choudhary, author Aaron Gilad  Kusne, author Johnpierre  Paglione,  and author Ichiro  Takeuchi, title title\n  Artificial intelligence for search and discovery of quantum materials,  @noop  journal journal Communications\n  Materials volume 2, pages 105\n  (year 2021)NoStop\n[Kimura et al.(2013)Kimura,\n  Nakatsuji, Wen, Broholm,\n  Stone, Nishibori, and Sawa]kimura2013quantum\n  author author Kenta Kimura, author S Nakatsuji,\n  author JJ Wen, author\n  C Broholm, author MB Stone, author E Nishibori,  and author H Sawa, title title Quantum\n  fluctuations in spin-ice-like pr2zr2o7, @noop  journal journal Nature communications volume 4, pages 1934 (year 2013)NoStop\n[Martin et al.(2017)Martin,\n  Bonville, Lhotel, Guitteny,\n  Wildes, Decorse, Ciomaga Hatnean, Balakrishnan, Mirebeau,  and Petit]petit2017pr227\n  author author N. Martin, author P. Bonville,\n  author E. Lhotel, author S. Guitteny, author\n  A. Wildes, author C. Decorse, author M. Ciomaga Hatnean, author G. Balakrishnan, author I. Mirebeau,  and author S. Petit, title title\n  Disorder and quantum spin ice, 10.1103/PhysRevX.7.041028 journal journal Phys.\n  Rev. X volume 7, pages 041028\n  (year 2017)NoStop\n[Gingras and McClarty(2014)]gingras2014quantum\n  author author Michel JP  Gingras and author Paul A  McClarty, title title\n  Quantum spin ice: a search for gapless quantum spin liquids in pyrochlore\n  magnets, @noop  journal journal\n  Reports on Progress in Physics volume 77,  pages 056501 (year 2014)NoStop\n[Ross et al.(2014)Ross,\n  Qiu, Copley, Dabkowska, and  Gaulin]orderbydisorder\n  author author K. A. Ross, author Y. Qiu, author J. R. D. Copley, author\n  H. A. Dabkowska,  and author\n  B. D. Gaulin, title\n  title Order by Disorder Spin Wave Gap in the XY\n  Pyrochlore Magnet Er_2Ti_2O_7,  10.1103/PhysRevLett.112.057201 journal\n  journal Phys. Rev. Lett. volume 112,  pages 057201 (year 2014)NoStop\n[Bhardwaj et al.(2022)Bhardwaj, Zhang, Yan, Moessner, Nevidomskyy, and Changlani]bhardwaj2022sleuthing\n  author author Anish Bhardwaj, author Shu Zhang,\n  author Han Yan, author Roderich Moessner, author Andriy H Nevidomskyy,  and  author Hitesh J Changlani,  title title Sleuthing out exotic quantum\n  spin liquidity in the pyrochlore magnet Ce_2Zr_2O_7, @noop\n   journal journal npj Quantum Materials  volume 7, pages 51 (year\n  2022)NoStop\n[Cao et al.(2009b)Cao, Gukasov, Mirebeau, and Bonville]Cao_2009\n  author author H B Cao, author A Gukasov,\n  author I Mirebeau,  and  author P Bonville, title title Anisotropic exchange in frustrated\n  pyrochlore Yb_2Ti_2O_7, 10.1088/0953-8984/21/49/492202 journal journal\n  Journal of Physics: Condensed Matter volume 21,  pages 492202 (year 2009b)NoStop\n[Ross et al.(2011b)Ross, Savary,\n  Gaulin, and Balents]kate\n  author author Kate A. Ross, author Lucile Savary,\n  author Bruce D. Gaulin,  and  author Leon Balents, title title Quantum excitations in quantum spin\n  ice, 10.1103/PhysRevX.1.021002 journal\n  journal Phys. Rev. X volume 1,  pages 021002 (year 2011b)NoStop\n[Rudowicz(1986)]rudowicz1986standardization\n  author author Czesław  Rudowicz, title title\n  On standardization and algebraic symmetry of the ligand field hamiltonian\n  for rare earth ions at monoclinic symmetry sites, @noop \n  journal journal The Journal of chemical physics  volume 84, pages 5045–5058 (year 1986)NoStop\n[Rudowicz(1985)]rudowicz1985relations\n  author author Czesław  Rudowicz, title title\n  Relations between arbitrary symmetry spin-hamiltonian parameters bkq and bkq\n  in various axis systems, @noop  journal journal Journal of Magnetic Resonance (1969) volume\n  63, pages 95–106 (year 1985)NoStop\n\n\n\n\n\n"}