{"entry_id": "http://arxiv.org/abs/2303.07379v1", "published": "20230313180102", "title": "Dynamical abelian anyons with bound states and scattering states", "authors": ["Sven Bachmann", "Bruno Nachtergaele", "Siddharth Vadnerkar"], "primary_category": "math-ph", "categories": ["math-ph", "cond-mat.str-el", "math.MP", "quant-ph"], "text": "\n\n\n\n1]Sven Bachmann\n2]Bruno Nachtergaele\n3]Siddharth Vadnerkar\n\n[1]Department of Mathematics, University of British Columbia, Vancouver, BC V6T 1Z2, Canada\n[2] Department of Mathematics and Center for Quantum Mathematics and Physics, University of California, Davis, Davis, CA, 95616, USA\n[3]Department of Physics, University of California, Davis, Davis, CA, 95616, USA\n                 \n\nDynamical Abelian anyons with bound states and scattering states\n    [\n    March 30, 2023\n================================================================\n\n \nWe introduce a family of quantum spin Hamiltonians on ^2 that can be regarded as perturbations of Kitaev's abelian quantum double models that preserve the gauge and duality symmetries of these models. We analyze in detail the sector with one electric charge and one magnetic flux and show that the spectrum in this sector consists of both bound states and scattering states of abelian anyons. Concretely, we have defined a family of lattice models in which abelian anyons arise naturally as finite-size quasi-particles with non-trivial dynamics that consist of a charge-flux pair. In particular, the anyons exhibit a non-trivial holonomy with a quantized phase, consistent with the gauge and duality symmetries of the Hamiltonian.\n\n\n\n\n\n\n\n§ INTRODUCTION\n   \n\nWhen Leinaas and Myrheim published their remarkable paper <cit.>, the possibility of a new type of quasi-particles in two space dimensions with more general statistics than the well-established fermions and bosons, was a purely theoretical observation. This changed abruptly with the discovery of the fractional quantum Hall effect (FQHE) by Tsui, Stormer, and Gossard <cit.> and Laughlin's many-body wave function <cit.> as a proposed explanation shortly after the experimental discovery. Wilczek called these hypothetical particles with fractional statistics anyons <cit.> and they quickly became a central piece of many theoretical works on the FQHE <cit.>. Convincing experimental evidence for the existence of anyonic excitations in fractional quantum Hall materials has emerged in recent experiments <cit.>. \n\nAll this motivated several efforts to construct explicit Hamiltonian models of anyons and study their mathematical and physical properties. Many of such efforts focus on interpreting anyons as charge and flux tube pairs <cit.>. A relation between the filling fraction and the ground state degeneracy was proved in <cit.> for lattice models and in <cit.> for the Laughlin state. Haldane's pseudo-potential Hamiltonians have been derived in <cit.>. A truncated version of a pseudo-potential for the ν=1/3 filled Laughlin state introduced in <cit.> was shown to have a non-vanishing ground state gap in <cit.>. Other aspects were investigated in a variety of models <cit.>.\n\nThe possibility of topological quantum computation envisaged in <cit.> has been a further incentive to deepen our understanding of anyons. Among the Hamiltonian models in two dimensions developed for that purpose, the most famous ones are Kitaev's quantum double models <cit.> and his honeycomb model <cit.>, as well as the Levin-Wen string-net models <cit.>. They do exhibit localized excitations with anyonic statistics, can be extended to describe anyon condensation <cit.>, but these quasi-particles are not dynamical. In fact, the main purpose of these models is to realize, in their ground state space, a topological quantum field theory <cit.>. This has led to further developments in the classification of topological matter in the language of tensor categories <cit.>. Experimental realizations of these exotic topological phases have recently been proposed <cit.>.\n\nThese rigorous results recover some of the features of anyons in the theories for the FQHE mentioned above but it is fair to say that we are still lacking a coherent theory starting from first principles. In this paper we present Hamiltonian lattice models of anyons with short-range interactions of the type prevalent in condensed matter theories of real materials. It may also be realizable as an artificial system created in today's laboratories. We introduce our models as perturbations of Kitaev's quantum double models based on an arbitrary abelian group G and rely on the stability of its anyon structure under short-range perturbations proved in <cit.>. This generalizes earlier work on the case of G=_2, which starts with the Toric Code model <cit.>. These models have a unique gapped ground state on the infinite lattice, and the excitation spectrum can be described by a set of abelian anyons. They have a duality symmetry which is reflected in the structure of the anyons: they consist of two basic sets, which we call electric and magnetic charges that appear symmetrically in the Hamiltonian. Anyons that have both non-zero electric and magnetic charges obtained by fusion, appear with their own dispersion relation. We calculate the dispersion relation for single-anyon excitations and show that it exhibits a Dirac cone for these fused anyons with non-trivial braiding statistics.  We show that under a simple condition on the coupling constants and the energy and momentum, bound states appear that should be interpreted as finite-size quasi-particles with non-trivial dynamics. We also prove that bounds states do not appear when the Hamiltonian only includes separate hopping terms for electric and magnetic charges. In summary, we have constructed a family of lattice models in which abelian anyons arise naturally as charge-flux pairs with the expected properties. We explicitly find that the anyons exhibit a non-trivial holonomy with a quantized phase, consistent with the gauge and duality symmetries of the Hamiltonian. There is no need to introduce charge-flux pairs or tracer particles a priori <cit.>. The anyonic holonomy as observed in <cit.> arises directly from the many-body Hamiltonian.\n\nIn Section <ref> we introduce the family of Hamiltonians, discuss their symmetry properties, and describe the structure of the anyons and the associated superselection sectors for these models, including concrete instances of the corresponding GNS representations. The spectral analysis of the Hamiltonian in the invariant subspaces of the relevant GNS representations is carried out in Section <ref>. We illustrate our findings with a set of figures based on numerical calculations.\n\n\n\n\n\n\n\n§ THE MODEL\n   \n\n\n\n\n §.§ The (static) quantum double model\n\n\nLet us start with a quick reminder of the family of quantum double models (QDMs) with a finite Abelian group (G,·), which will allow us to set notations. We denote by Γ the cell complex given by a set 𝒱 = ^2 of vertices, a set ℰ of oriented edges and a set ℱ of faces. We denote by ∂ the standard boundary map of this cell complex. For simplicity, all `vertical' edges are oriented upwards while all `horizontal' edges are pointing rightward. We attach to each edge e∈ the | G|-dimensional Hilbert space ℋ_e = ℂ^| G| and label an orthonormal basis by group elements g ∈ G: {|g⟩_e:g∈ G}; If a statement is not specific to one particular edge, we shall simply denote . The observable algebra associated with each edge is _e = (_e). For any finite subset Λ⊂, the algebra is given by _Λ = (⊗_e∈Λ_e). As usual, Λ_1⊂Λ_2 yields a natural embedding _Λ_1↪_Λ_2 by the identification of A∈_Λ_1 with A⊗__Λ_2∖Λ_2. The algebra of local observables _loc is the union of these finite volume algebras, and the C*-algebra of quasi-local observables  is the completion of _loc with respect to the operator norm.\n\nFor any h∈ G, let L^h be the linear operator defined by its action on the basis:\n\n\n    L^h|g⟩ = |hg⟩.\n\n\nSimilarly, for any character χ∈Ĝ, let T^χ be the linear operator defined by\n\n\n    T^χ|g⟩ = χ̅(g)|g⟩,\n\n\nwhere χ̅ denotes the inverse of the character χ. These operators form a unitary representation of G, respectively Ĝ, on , and (L^h) = L^h̅, (T^χ) = T^χ, where h̅=h^-1, the inverse in G. Moreover, they satisfy the following commutation relation:\n\n\n    T^χ L^h = χ̅(h)L^hT^χ.\n\n\n\nIt will be convenient to label operators not only by an edge, but by pairs (v,e) with v∈∂ e or (f,e) with e∈∂ f. For a vertex-edge pair, ^h(v,e) = L^h_e and ^χ(v,e) = T^χ_e if the edge is outgoing from v, while ^h(v,e) = L^h̅_e and ^χ(v,e) = T^χ̅_e if it is incoming. Similarly for a face-edge pair with incoming (respectively outgoing) being replaced by the face being on the left (respectively on the right) of the edge. These conventions are illustrated in Figure <ref>. \n\n\n\nA string γ is a sequence of pairs {(v_i,e_i):v_i∈, e_i∈} such that ∂ e_i = {v_i,v_i+1}. If it is finite, the last vertex is not listed but it is uniquely determined by (v_N,e_N) and we denote it ∂_1γ; analogously, ∂_0γ = v_1, and we let ∂γ = {∂_0γ,∂_1γ}. We define similarly a dual string γ, where faces replace vertices, and the edge e_i is the unique edge in ∂ f_i∩∂ f_i+1, see Figure <ref>.\n\n\n\n We now define the following unitary string operators\n\n    ^g_γ = (f,e) ∈γ∏ℒ^g (f ,e)    ^χ_γ= (v,e) ∈γ∏𝒯^χ (v ,e)\n\nfor g∈ G, χ∈Ĝ. Note that the order in which the operators appear is irrelevant in the present context. The boundary of a face f∈ℱ is naturally associated with a string γ(f), while a vertex v ∈𝒱 is naturally associated with a dual string γ(v). We shall always consider these strings to carry a counterclockwise orientation. We define for any face f and vertex v \n\n    ^h_f= 1/|Ĝ|∑_χ∈Ĝχ(h) ^χ_γ(f),\n        χ_v= 1/| G|∑_g ∈ Gχ(g)^g_γ(v).\n\nThe normalization is chosen so as to make these operators into (orthogonal) projections, and one can check that they are mutually commuting: In fact,\n\n\n    _v^χ_v^ξ = δ_χ,ξ_v^χ = _v^ξ_v^χ,    _f^g_f^h = δ_g,h_f^g = _f^h _f^g,\n\n\nby the orthogonality of the characters. Their action on basis vectors is illustrated in Figure <ref>.\n\n\n\nFor any finite subset Λ⊂, the Hamiltonian of the (static) quantum double model is given by\n\n    H^0_Λ = v∈Λ∑ ( - ι_v) + f∈Λ∑ (  - ^1_f),\n\nwhere ι∈Ĝ is the constant character ι(g) = 1, 1∈ G is the neutral element, and v∈Λ means that {e∈:v∈∂ e}⊂Λ, and similarly for f∈Λ. This choice of boundary condition is arbitrary and made only for simplicity here; it will not play a role in the following discussion.\n\nIn fact, we shall be interested in the infinite-volume limit of the model. We recall some elementary properties of the model exhibited in the original <cit.>, and refer to <cit.> for a complete set of proofs. The sum (<ref>) is not convergent in norm, but it remains meaningful as the generator of the dynamics: for any local observable A, the limit\n\n\n    δ^0(A) = lim_Λ→^2[H^0,A]\n\n\nexists for all A∈_loc and extends to a densely defined unbounded *-derivation on . In this infinite volume limit, the model has a unique translation-invariant ground state ω_0 which is frustration-free and gapped – we shall henceforth call it the vacuum state. ω_0 is a ground state in the sense of being a positive normalized functional on  such that\n\n\n    -ω_0(Aδ^0(A))≥0\n\n\nfor all A∈_loc. That it is gapped means that there is g>0 such that \n\n\n    -ω_0(Aδ^0(A))≥ gω_0(A A)\n\n\nfor all A∈_loc such that ω_0(A) = 0. Specifically, g=1 here. Finally, the frustration-freeness is expressed  by\n\n\n    ω_0(ι_v)=1,    ω_0(^1_f) = 1,\n\n\nfor all v∈,f∈. \n\nAdditional properties of the vacuum state are that ω_0(χ_v)=0=ω_0(^g_f) for all non-trivial elements of G (respectively Ĝ) from which we deduce that\n\n\n    ω_0([_v^χ,A])=0,    ω_0([_f^g,A])=0,\n\n\nfor all A∈ by the Cauchy-Schwarz inequality.\n\nLet us briefly come back to the string operators introduced above. They satisfy the following commutation relations:\n\n\n    χ_∂_0 γξγ = ξγχξ̅_∂_0 γ,     χ_∂_1 γξγ = ξγχξ_∂_1 γ, \n       ^h_∂_0 γgγ = gγ^hg_∂_0 γ,\n        ^h_∂_1 γgγ =  gγ^hg_∂_1 γ,\n\n\nwhere we used that χ(g̅) = χ(g) = χ(g). Moreover, χ_v commutes with ξγ for v ∉∂γ and ^h_f commutes with gγ for f ∉∂γ. We further note that any (dual) string operators commute with all 's and all 's. We shall also need commutation relations between string operators of different types:\n\n\n    _γ^χ_γ^g = (χ(g))^c(γ,γ)_γ^g _γ^χ\n\n\nHere, c(γ,γ) is the number of signed crossings of the two strings: each crossing, from right to left, of γ and γ yields a factor χ(g); since a change in the orientation of a string amounts to the exchange of the charge with its inverse, a crossing from left to right yields χ(g) = χ(g).  \n \n\nLocalized excitations above the ground state are simple to characterize. These quasi-particles arise from the violation of the conditions (<ref>). Indeed, we shall say that a state ω carries an electric charge at vertex v if ω(ι_v) = 0, or a magnetic flux through face f if ω_0(^1_f) = 0. The commutation relations (<ref>) yield that\n\n\n    ω_0((F_γ^χ) A_∂_0γ^ξ F_γ^χ)=δ_ξ,χ,    ω_0((F_γ^χ) A_∂_1γ^ξ F_γ^χ)=δ_ξ,χ,\n\n\nso that it is natural to interpret the string operator ^ξ_γ as creating a pair of quasi-particles with opposite electric charges (χ,χ) at either ends of γ, while ^g_γ creates a pair of fluxes (g,g̅) on the two extremal faces of γ. This is consistent with the fact that if γ_1,γ_2 are such that ∂_1γ_1 = ∂_0γ_2, then ^ξ_γ_1^ξ_γ_2 = ^ξ_γ_1·γ_2, where γ_1·γ_2 denotes the concatenation of two strings.\n\nSince this Hamiltonian is a sum of strictly local commuting terms, we have that\n\n\n    δ^0(χ_v) = 0 = δ^0(^g_f),\n\n\nfor all χ∈Ĝ and g∈ G, showing that excitations are not dynamical. We shall in the next section introduce hopping terms for these quasi-particles which will define a dynamical version of the QDM. \n\n\n\n\n §.§ The dynamical quantum double model\n\n\nHopping of electric charges between two vertices along an edge e∈ will be induced by the following operator\n\n\n    T_e^ϵ = ∑_χ∈Ĝ,χ≠ι(\n    ℱ^χ_(v,e)ι_v'χ_v + ℱ^χ_(v',e)ι_vχ_v')\n\n\nwhere the edge e is between v and v'. Since (ℱ^χ_(v,e)) = ℱ^χ_(v,e)=ℱ^χ_(v',e), the second term is the adjoint of the first one and hence T_e^ϵ is self-adjoint. Flux hopping between two faces across e∈ can be defined similarly,\n\n\n    T_e^μ = ∑_h∈ G,h≠ 1(\n    ℱ^h_(f,e)^1_f'^h_f + ℱ^h̅_(f',e)^1_f^h_f')\n\n\nwhere the edge e is shared by f and f'.\n\nFinally, and in accordance with the fact that a flux-charge pair can be considered a particle of its own type, we also introduce a hopping such a pair:\n\n\n    T_e^ϵμ = ∑_h∈ G,h≠ 1 \n    χ∈Ĝ,χ≠ι{   (\n    ℱ^χ_(v,e)ι_v'χ_v +  ℱ^χ_(v',e)ι_vχ_v')(_f^h + _f'^h) \n    \n       + (\n    ℱ^h̅_(f,e)^1_f'^h_f + ℱ^h̅_(f',e)^1_f^h_f')(_v^χ + _v'^χ)\n    }\n\n\nwhere e,v,v',f,f' are illustrated in Figure <ref>.\n\n\n\nWith these definitions, we define the full Hamiltonian of the model by\n\n\n    H = H^0 + λ_ϵ H^ϵ + λ_μ H^μ + λ_ϵμ H^ϵμ,\n\n\nwhere H^♯ = ∑_e∈ T^♯_e, with ♯ stands for ϵ, μ or ϵμ, and the sum is interpreted as in (<ref>). We denote\n\n\n    δ = lim_Λ→^2[H_Λ,·] = δ^0+δ^ϵ+δ^μ+δ^ϵμ,\n\n\nthe generator of the dynamics in the infinite volume limit, while δ^♯ are the derivations associated with H^♯. The corresponding dynamics is denoted τ_t, respectively τ_t^♯. \n\nThe following proposition justifies the nomenclature that has been used thus far in describing the various terms of the Hamiltonian. The first part (<ref>) is a continuity equation for the charge ζ∈Ĝ and it should be contrasted with (<ref>). The operator _Λ^ζ has the natural interpretation of the total charge of type ζ in the volume Λ. The second part of the proposition shows that the hopping terms are gauge invariant. \n\n\nLet ζ∈Ĝ, ζ≠ι, and let Λ be a finite subset of . Let _Λ^ζ = ∑_v∈Λ^ζ_v. \n\n(i) Let ^ζ_(v,e) = (^ζ̅_(v,e)^ι_v'^ζ_v - ^ζ̅_(v',e)^ι_v^ζ_v'). Then\n\n\n    δ^ϵ(^ζ_Λ) = ∑_(v,e)∈∂Λ^ζ_(v,e),\n\n\nwhere (v,e)∈∂Λ if ∂ e∩Λ≠∅ and ∂ e∩Λ^c ≠∅. Moreover, δ^μ(^ζ_Λ) = 0. \n\n(ii) For any edge e∈, \n\n\n    ∑_v∈[T_e^ϵ, ^ζ_v] = 0.\n\n\n\n\n\nThe operators T_e^ϵ and ^ζ_v do not commute only if v is one of the vertices at the boundary of e, in which case as short calculation yields\n\n\n    [T_e^ϵ, ^ζ_v]    = ∑_χ∈Ĝ([^χ_(v,e),^ζ_v] ^ι_v'^χ_v + \n    [^χ_(v',e),^ζ_v] ^ι_v^χ_v') \n       = ∑_χ∈Ĝ(^χ_(v,e)(^ζ_v - ^ζχ_v)^ι_v'^χ_v\n    + ^χ_(v',e)(^ζ_v - ^ζχ_v)^ι_v^χ_v').\n\n\nWith (<ref>) and since ζ≠ι, we have that ^ζχ_v^χ_v = 0 as well as ^ζ_v^ι_v=0, and this further imposes that χ = ζ in both remaining terms, namely [T_e^ϵ, ^ζ_v] = ^ζ_(v,e). Claim (ii) immediately follows since [T_e^ϵ, ∑_v^ζ_v] = ^ζ_(v_1,e) + ^ζ_(v_2,e) = 0 by the antisymmetry of ^ζ_(v,e) under the exchange of the vertices. Claim (i) follows similarly: By the same argument, the contribution from all edges that are internal to Λ vanish, the only remaining ones being those on the boundary. Finally, δ^μ(^ζ_Λ) = 0 follows from the fact that both 's and dual strings are products of  operators, which are all mutually commuting. \n\n\nWe conclude this section by pointing out that a natural extension of the Hamiltonian above would be to introduce an external `vector potential' by twisting the various hopping term, as for example\n\n\n    -β_eℱ^χ_(v,e)ι_v'χ_v + β_eℱ^χ_(v',e)ι_vχ_v'.\n\n\nAn edge-dependent β:→ would allow one to add external `fluxes' through plaquettes. Of course, similar variations are possible with the other hopping terms. As we shall see shortly, such a flux attachment that is typical of anyons will appear intrinsically as soon as pairs of particles are present in the system.  \n\n\n\n\n\n §.§ Superselection sectors and anyons\n\n\nRecall that the state ω_0 is the unique translation invariant ground state. We briefly discussed above the states ω_0∘Γ_γ^χ where Γ_γ^χ = _γ^χ(·)_γ^χ creates a pair of excitations (χ,χ) localized at the ends of the string on top of the existing vacuum. \n\nIf γ = {(v_i,e_i):i∈} is an infinite string, the operator _γ^χ is not well-defined, but the corresponding automorphism Γ_γ^χ exists. Indeed, let γ^(N) = {(v_i,e_i):i=1,…,N} be its truncation to the first N edges. For any A∈_loc, the limit\n\n\n    Γ^χ_γ(A) = lim_N→∞_γ^(N)^χ A _γ^(N)^χ\n\n\nexists since the sequence of operators on the right hand side is eventually constant, and Γ_γ^χ extends to an automorphism of  since ‖Γ_γ^χ(A)‖ = ‖ A‖. In particular, the linear functional ω_0∘Γ^χ_γ defines a state on , which we shall refer to as a charged state. It is so that \n\n\n    (ω_0∘Γ^χ_γ)(_v^ι) = \n    0    if v=∂_0γ\n     1    otherwise  and   (ω_0∘Γ^χ_γ)(_f^1) = 1  for all f∈.\n\n\nNow, if λ is a (finite) closed loop, namely ∂_0λ = ∂_1λ, then the action of F_λ^χ is trivial on the vacuum state, namely\n\n\n    ω_0(_λ^χ A _λ^χ) = ω_0(A)    (λ closed)\n\n\nfor all A∈. This, and the composition property of string operators implies that \n\n\n    ω_0∘Γ^χ_γ = ω_0∘Γ^χ_γ̃\n\n\nfor all strings γ such that ∂γ = ∂γ̃. If γ is an infinite string, this shows that the state ω_0∘Γ^χ_γ depends only on the position of the initial vertex v = ∂_0γ, which justifies the notation ω_v^χ. Physically, the state ω_v^χ is a state carrying one electric charge χ at the vertex v and remains indistinguishable from the vacuum state everywhere else. It can be shown (<cit.>,<cit.>) that ω_v^χ is a ground state in the sense of (<ref>) for any χ∈Ĝ and any v∈.\n\nLet (_0,π_0,Ω_0) be the GNS representation of the vacuum state — we shall henceforth refer to it as the vacuum representation. \nFor a given state, all GNS representations are unitarily equivalent.\nA charged state ω_v^χ is not equivalent to ω_0. Its GNS representation can be given by (_0,π_0∘Γ_γ^χ,Ω_0), where ∂_0γ = v:\n\n\n    ω_v^χ(A) = ⟨Ω_0|(π_0∘Γ_γ^χ)(A) Ω_0⟩ = ω_0∘Γ_γ^χ(A).\n\n\n Similarly, if χ≠ξ, then ω_v^χ and ω_v^ξ are inequivalent.\n\n\nWhile the state ω_v^χ depends only on the endpoint v of the string γ, the GNS representation does depend on the entire string γ. The uniqueness of the GNS representation implies that for any two strings γ_1,γ_2 starting at v, the representations π_0∘Γ_γ_1^χ,π_0∘Γ_γ_2^χ are equivalent: this is very reminiscent of the freedom of choice of the flux line needed to introduce a flux piercing the plane in a 2d electron gas. We shall make a choice which will be convenient for the rest of the discussion: The string associated with the state ω_v^χ is taken to be extending vertically down from the vertex v, as illustrated in Figure <ref>.\n\nThe construction just discussed can be carried out with dual strings to yield charged ground states of the form ω_f^g = ω_0∘Γ_γ^g, and we pick those strings to be oriented vertically upwards from the face f.\n\n\n\nA superselection sector of δ^0 is a class of unitarily equivalent δ^0-ground state representations. The above discussion shows that group elements and characters label superselection sectors. We claim furthermore that states carrying the same charge but located at different vertices are equivalent. Indeed, the composition property of the string operators implies that two states ω_v^χ and ω_v'^χ are related by\n\n\n    ω_v'^χ(A) = ω_v^χ(^χ_γ(v'→ v) A ^χ_γ(v'→ v)),\n\n\nwhere γ(v'→ v) is any string such that ∂_0γ(v'→ v) = v' and ∂_1γ(v'→ v) = v. The operator ^χ_γ(v→ v') is a unitary element of the algebra, so that the two states are indeed unitarily equivalent. That these are all possible sectors is the following result of <cit.>:\n\n\nThe complete set of superselection sectors of δ^0 is labelled by elements of G×Ĝ. \n\n\n\nAs was already pointed out in the original paper <cit.>, the quasi-particles associated with each superselection sector are Abelian anyons. In the present language, this can be made precise in the sense of the DHR analysis <cit.>, see again <cit.>. While the anyonic nature of particles has a general abstract treatment in terms of the superselection sectors, see <cit.>, or <cit.> for the quantum double models, we can understand braiding here in the sense of parallel transport, close to the original description of Leinaas and Myrheim, namely by starting with the two-particle representation (_0,π_0∘Γ_γ^g∘Γ_γ^χ,Ω_0), and continuously braiding the electric charge χ around the flux g. For this, let λ be a closed string of length N such that ∂_0λ = ∂_1λ = ∂_0γ. Let Ψ_λ(t)∈_0 be defined by Ψ_λ(0) = Ω_0 and Ψ_λ(t) = F^χ_λ(t) Ω_0, where F^χ_λ(t) is given by\n\n\n    F^χ_λ(t) = (π_0∘Γ_γ^g∘Γ_γ^χ) (∏_j=0^N( + f(t - j)(ℱ^χ_(v_N-j,e_N-j) - ))),    (t>0).\n\n\nHere, f is a smooth switch function such that f(t) = 0 if t≤0 and f(t) = 1 if t≥1. At integer time steps t=k with 1≤ k≤ N, we have that \n\n\n    Ψ_λ(k) = (π_0∘Γ_γ^g∘Γ_γ^χ) (∏_j=0^k-1ℱ^χ_(v_N-j,e_N-j))Ω_0,\n\n\nand Ψ_λ(t) = (π_0∘Γ_γ^g∘Γ_γ^χ) (ℱ^χ_λ) Ω_0 for all t≥ N. It is now immediate to compute the holonomy associated with λ and note that it is quantized.\n\n\nLet η_λ = ⟨Ω_0|Ψ_λ(N)⟩. Then\n\n\n    η_λ = χ(g)^w_∂_0γ(λ),\n\n\nwhere w_∂_0γ(λ) is the winding number of the string λ around the face ∂_0γ.\n\n\n\nThe commutation relation (<ref>) implies that\n\n\n    (Γ_γ^g∘Γ_γ^χ)(ℱ^χ_λ) \n    = Γ_γ^g(ℱ^χ_λ) = χ(g)^w_∂_0γ(λ)ℱ^χ_λ\n\n\nwhich yields immediately η_λ = χ(g)^w_∂_0γ(λ)⟨Ω_0,π_0(ℱ^χ_λ)Ω_0⟩ = χ(g)^w_∂_0γ(λ) since λ is a closed string, see (<ref>). \n\n\n\n\n\n\n\n §.§ Symmetries\n \n\n\n\n\n  §.§.§ Charge conservation\n\n\nFor any χ∈Ĝ, let δ^χ be the *-derivation on  formally given by ∑_v[^χ_v,·]. Similarly, for any g∈ G, let δ^g be the *-derivation given by ∑_f[_f^g,·]. Let α^χ_s, respectively β^g_s be the corresponding groups of automorphisms. A slight extension of the proof of Proposition <ref> yields the following proposition:\n\n\nFor all χ∈Ĝ and all g∈ G,\n\n\n    α^χ_s ∘τ_t = τ_t∘α^χ_s,    β^g_s∘τ_t = τ_t∘β^g_s,\n\n\nfor all s,t∈.\n\n\n\n\n\n\n  §.§.§ Charge conjugations\n\n\nThere are two types of conjugations in these models, corresponding to a flux-anti flux exchange or a charge-anti charge exchange. We first define an antilinear transformation θ^μ on  by\n\n\n    θ^μ| g⟩ = |g̅⟩,\n\n\nand extension by antilinearity, for which (θ^μ)^2 =. It is immediate to check that\n\n\n    θ^μ L^g = L^g̅θ^μ,    θ^μ T^χ = T^χθ^μ,\n\n\nfor all g∈ G,χ∈Ĝ. The automorphism\n\n\n    Θ^μ(·) = lim_Λ→^2Θ^μ_Λ(·)Θ^μ_Λ,\n\n\nwhere Θ^μ_Λ = ⊗_e∈_Λθ_e, acts as\n\n\n    Θ^μ(_v^χ) = _v^χ,    Θ^μ(^h) = ^h̅.\n\n\n\n\nA second antiunitary on  is given by complex conjugation, namely\n\n\n    θ^ϵ| g⟩ = | g⟩,\n\n\nand extension by antilinearity. It again squares to the identity but\n\n\n    θ^ϵ L^g = L^gθ^ϵ,    θ^ϵ T^χ = T^χθ^ϵ,\n\n\nfor all g∈ G,χ∈Ĝ. It follows that\n\n\n    Θ^ϵ( _v^χ ) = _v^χ,    Θ^ϵ( ^h ) = ^h,\n\n\nwhere Θ^ϵ is the automorphism of  associated with the local θ^ϵ.\n\n\n\nFor all χ∈Ĝ and all g∈ G,\n\n\n    Θ^♯∘τ_t = τ_-t∘Θ^♯,\n\n\nwhere ♯∈{ϵ,μ}.\n\n\n\n\n\n\n\n  §.§.§ Duality\n\n\nThe Abelian quantum double models exhibit a duality symmetry that corresponds to the exchange of fluxes with charges. Using the Fourier transform associated with the finite Abelian group G, and the fact that G and Ĝ are isomorphic as \nAbelian groups, we can define a duality transformation U on the edge Hilbert space . For clarity we recall the standard definitions. \nSince ≅ℓ^2(G)≅ℓ^2(Ĝ), and using the orthogonality relation for characters, we can introduce an orthogonal \nbasis {|χ⟩|χ∈Ĝ}, labelled by the characters, by requiring ⟨χ|ξ⟩=χ(g). The conventional normalization \nthen gives:\n\n    ⟨χ|ξ⟩=|G| δ_χ,ξ,   χ,ξ∈Ĝ.\n\nThe two bases {|g⟩: g∈ G} and {|χ⟩: χ∈Ĝ} give rise to a unitary transformation U on =ℓ^2(G) such that \n\n    v̂ = Uv, v̂(χ) = | G|^-1/2∑_g∈ Gχ(g) v(g).\n\nand with the inverse given by\n\n    v(g) = | G|^-1/2∑_χ∈Ĝχ(g) v̂(χ).\n\nAs operators on ℓ^2(G), L^h and T^χ take the form\n\n    (L^h v)(g) = v(h̅ g),    (T^χ v)(g) = χ(g)v(g).\n\nThe Fourier transform interchanges their actions on ℓ^2(Ĝ) (up to a complex conjugate)\n\n    U L^h U^* v̂ (ξ) = ξ(h) v̂ (ξ),    U T^χ U^* v̂ (ξ) = v̂ (χξ).\n\nIt follows that the transformed Hamiltonian (⊗ U) H (⊗ U^*) is identical to H upon the replacement of G by Ĝ and the lattice by its dual lattice, and after interchanging λ_ϵ \nand λ_μ.\n \nNote that in the cyclic case G=_N, with the characters labelled by m=0,…,N-1, χ_m: j↦ω^mj, with ω=e^2π i/N, U is the usual finite Fourier transform:\n\n\n    U| j⟩ = 1/√(N)∑_k=0^N-1ω^jk| k⟩.\n\n\n\n\n\n\n §.§ Dynamics in Hilbert space\n\n\nThe vacuum state remains invariant under the full dynamics τ_t since ω_0∘δ = ω_0. It follows that\nτ_t is unitarily implementable in the vacuum representation, namely there is a strongly continuous unitary group t↦ U_0,t on _0 such that\n\n\n    U_0,tπ_0(A)(U_0,t) = π_0(τ_t(A)),     U_0,tΩ_0 = Ω_0.\n\n\nLet K_0 be its self-adjoint generator, normalized so that K_0Ω_0=0:\n\n\n    [K_0,π_0(A)] = π_0(δ(A)).\n\n\n\nWhile the charged states were also invariant under δ^0, this is not the case anymore in the presence of the hopping terms. However, the dynamics is still unitarily implementable in the charged representations. We start with the charged state having one electric charge χ. \n\n\n\nThe dynamics τ_t is unitarily implementable in the GNS representation of ω_v^χ: There is a strongly continuous unitary group t↦ U_γ,t^χ on _0 such that\n\n\n    U_γ,t^χ(π_0∘Γ_γ^χ)(A)(U_γ,t^χ) = (π_0∘Γ_γ^χ)(τ_t(A)),\n\n\nfor all A∈.\n\n\n\nSince the automorphism Γ^χ_γ is strictly local, in the sense that Γ^χ_γ(_Λ)⊂_Λ for any Λ⊂, its action on any Hamiltonian is naturally  defined by letting Γ^χ_γ act on every interaction term. Denoting the resulting Hamiltonian Γ^χ_γ(H) and the corresponding derivation δ^Γ^χ_γ(H), we have that\n\n\n    Γ^χ_γ∘δ = δ^Γ^χ_γ(H)∘Γ^χ_γ.\n\n\nA short calculation yields that\n\n\n    Γ_γ^χ(H^0) = H^0 + (^ι_∂_0γ - ^χ_∂_0γ)\n\n\nand\n\n\n    Γ_γ^χ(H^ϵ) = H^ϵ + ∑_e∈: \n    ∂ e = {∂_0γ,v}∑_ξ∈Ĝ,ξ≠ι(^ξ_(∂_0γ,e)^ι_v(^χξ_∂_0γ - ^ξ_∂_0γ)\n    + ^ξ_(v,e)(^χ_∂_0γ - ^ι_∂_0γ)^ξ_v).\n\n\nThe action of Γ_γ^χ on H^μ is trivial, up to the phase picked by all hopping terms across γ, see (<ref>), resulting in\n\n\n    Γ_γ^χ(H^μ) = H^μ + ∑_e∈γ∑_h∈ G,h≠ 1(\n    (χ(h)^c(γ,(f,e))-1) ℱ^h_(f,e)^1_f'^h_f + (χ(h)^c(γ,(f',e))-1)ℱ^h̅_(f',e)^1_f^h_f').\n\n\nFinally, we consider the action of Γ_γ^χ on H^ϵμ. The charge hopping corresponding to the first line of (<ref>) is affected as in (<ref>) since  operators are left invariant. The flux hopping corresponding to the second line of (<ref>) if affected in two ways: Firstly as in (<ref>), the hopping terms across the string γ pick up a phase, and secondly the projectors _∂_0γ^ξ are mapped to _∂_0γ^ξχ. \n\nBy (<ref>), all terms that contain an ^χ for χ≠ι or a ^g for g≠ 1 leave the vacuum state invariant. The same holds for H^0, and we gather the action of all of them under the notation δ^χ_γ,0. The only terms that have a non-trivial action on ω_0 are supported in a finite neighbourhood of ∂_0γ and given explicitly by\n\n\n    P^χ_∂_0γ = ^ι_∂_0γ\n    + ∑_e∈: \n    ∂ e = {∂_0γ,v}^χ_(∂_0γ,e)^ι_v^ι_∂_0γ∈_loc.\n\n\nSummarizing, we have that\n\n\n    δ^Γ^χ_γ(H) = δ^χ_γ,0+[P^χ_∂_0γ,·],\n\n\nand ω_0 is invariant under the action of δ^χ_γ,0. We conclude as in (<ref>) that δ^χ_γ,0 is implemented by a self-adjoint operator K_γ,0^χ and so\n\n\n    π_0∘Γ_γ^χ∘δ(A) = [K_γ,0^χ + π_0(P^χ_∂_0γ),π_0∘Γ_γ^χ(A)]     K_γ,0^χΩ_0 = 0.\n\n\nHence, U_γ,t^χ =  t K_γ^χ where K_γ^χ = K_γ,0^χ + π_0(P^χ_∂_0γ).\n\n\n\nThe Hamiltonian K^χ_γ — and its cousins to be described shortly — will be the main object of the spectral analysis carried out in the next section. Before doing this, we recall that, in the representation π_0∘Γ_γ^χ, the vector Ω_0 corresponds to the state having one electric charge χ at ∂_0γ. That this charge is dynamical is reflected in the fact that the propagator has a non-trivial action on Ω_0 since \n\n\n    K^χ_γΩ_0 = π_0(P^χ_∂_0γ) Ω_0\n    =Ω_0 + λ_ϵ∑_e:∂_0γ∈∂ eπ_0(^χ_(∂_0γ,e)) Ω_0,\n\n\nwhere we used that π_0(^ι_v)Ω_0 = Ω_0 for all v∈.\n\nThe results above extend with the obvious modifications to the case of a magnetic charge localized on a face. The case of both an electric charge χ∈Ĝ at vertex v and a magnetic flux g∈ G at face f is similar but requires a little more attention. The GNS representation of the state ω^χ,g_v,f is given by (π_0∘Γ^g_γ∘Γ_γ^χ,_0,Ω_0), where ∂_0γ = v and ∂_0γ= f, as in Figure <ref>. We denote K^χ,g_γ,γ the generator of the dynamics in the GNS representation. It is of the same form as (<ref>), namely\n\n\n    K^χ,g_γ,γ = K^χ,g_γ,γ,0 + π_0(P^χ,g_v,f),\n         K^χ,g_γ,γ,0Ω_0 = 0,\n\n\nwhere P^χ,g_v,f is again strictly local. The action of Γ_γ^g on (<ref>) is simple,\n\n\n    (Γ^g_γ∘Γ^χ_γ)(H^0)-H^0 =\n    (^ι_∂_0γ - ^χ_∂_0γ)\n    +(_∂_0γ^1 - _∂_0γ^g),\n\n\nproviding (^ι_∂_0γ + _∂_0γ^1) to P^χ,g_v,f. Secondly, Γ_γ^g adds phases to the hopping terms of (<ref>) that cross γ with only \n\n\n    ∑_e∈: \n     e = ⟨∂_0γ,v⟩χ(g)^-c((∂_0γ,e),γ)^χ_(∂_0γ,e)^ι_v^ι_∂_0γ\n\n\nnot leaving ω_0 invariant. Furthermore, the only non-trivial action of Γ_γ^g on Γ_γ^χ(H^μ) given in (<ref>) is at the end of the dual string ∂_0γ, which adds\n\n\n    ∑_e∈: \n     e ∈∂∂_0γ∩∂ fχ(g)^c(γ,(∂_0γ,e))^g_(∂_0γ,e)^1_f^1_∂_0γ.\n\n\nto P^χ,g_v,f.\nFinally, (Γ^g_γ∘Γ^χ_γ)(H^ϵμ) acts that act non-trivially on ω_0 if and only if ∂_0γ, ∂_0γ belong to the same site, namely ∂_0γ∈∂_0γ. In that case, there are four different possible hopping terms of either form above, as illustrated in Figure <ref>.\n\n\n\n\n\n\n\n\n\n\n\nAs expected, the see that in a two-particle state, the χ particle exhibits nearest neighbour hopping on the set of vertices, the g particle exhibits nearest neighbour hopping on the set of faces, and the hopping of the composite particle is to the neighbouring sites. The hopping of each type of single particle is influenced by the presence of the other type in its immediate vicinity.\n\n\n\n\n\n\n\n§ SPECTRAL ANALYSIS IN THE ONE-PARTICLE SECTORS\n   \n\n\n\n\n §.§ The Hamiltonian in one- and two-particle subspaces\n\n\nWe introduced in Section <ref> the derivations corresponding to the number operators. In the GNS representations discussed above, the derivation is implemented by the commutator with a self-adjoint operator, analogous to the number operator on Fock space. Let us first recall the definition of ^ζ_Λ in Proposition <ref>. We define\n\n\n    ^Ĝ_Λ = ∑_ζ∈Ĝ^ζ_Λ∈.\n\n\nIf ∂_0γ∈Λ, then\n\n\n    Γ_γ^χ(^Ĝ_Λ) = ^Ĝ_Λ + (^ι_∂_0γ - ^χ_∂_0γ).\n\n\nIn the vacuum representation, the limit\n\n\n    N_0^Ĝ = _Λ→π_0(^Ĝ_Λ)\n\n\ndefines an unbounded self-adjoint operator with a dense domain for which N_0^ĜΩ_0 = 0. It follows that the derivation lim_Λ→[_Λ^Ĝ,·] is implemented in the GNS space of ω_∂_0γ^χ by\n\n\n    N^Ĝ = N_0^Ĝ + π_0(A^ι_∂_0γ - A^χ_∂_0γ).\n\n\nIn particular, N^ĜΩ_0 = π_0(A^ι_∂_0γ)Ω_0 = Ω_0. Had we not summed over Ĝ, the same sequence of ideas would have given a generator N^ζ for any ζ∈Ĝ with the property that N^ζΩ_0 = δ_ζ,χΩ_0. \n\n\nReplacing ^χ's by ^g's, we obtain a second number operator denoted N^ G and such that N^ GΩ_0=0. Finally,\n\n\n    N = N^Ĝ + N^ G\n\n\nis the total number operator. \n\nTwo charged states differing only by the position of the particle are unitarily equivalent and the intertwiner of representations is explicit. (<ref>) shows that if T_v→ v' = π_0(^χ_γ(v'→ v)), then T_v→ v' (π_0∘Γ_v^χ)(A) T_v→ v' provides a GNS representation of ω_v'^χ on _0. The corresponding string does however not satisfy the gauge fixing condition. As shown in <cit.>, this can be remedied by introducing an additional unitary intertwiner V^χ which is explicitly given as a limit, in the weak operator topology, of operators corresponding to closed strings. In particular, V^χΩ_0 = Ω_0. Precisely,\n\n\n    Γ^χ_γ'(A) = lim_n→∞(_v,v',n^χ) (^χ_γ(v'→ v))Γ^χ_γ(A)\n    ^χ_γ(v'→ v)_v,v',n^χ\n\n\nfor all A∈_loc, and ω_0((_v,v',n^χ) A _v,v',n^χ) = ω_0 as well as V ^χ= _n→∞π_0(_v,v',n^χ), where _v,v',n^χ are illustrated in Figure <ref>. We conclude that\n\n\n    (_0, π_0∘Γ_γ^χ, T_v→ v'Ω_0)\n\n\nis a GNS representation of ω_v'^χ, with the gauge fixed as prescribed. \n\n\n\nFor notational clarity and simplicity, we denote the vectors T_v→ v'Ω_0 of _0 in the representation π_0∘Γ_γ^χ by {|χ,v'⟩:v'∈} and let _χ⊂_0 be the space they span; in particular, Ω_0 = |χ,v⟩. They satisfy \n\n\n    N|χ,v⟩ = |χ,v⟩\n\n\nfor all v∈ and we refer to them as one-particle states. The vector |χ,v⟩ corresponds to a state having exactly one charge χ localized at vertex v. The same holds for the dual picture, yielding one-particle vectors {| g,f'⟩:f'∈} of _0 in the representation π_0∘Γ^g_γ, for any g∈ G.\n\nFinally, in the GNS space of the states ω^χ,g_v,f, the corresponding vectors {| (χ,v), (g,f)⟩:v∈,f∈} are such that N| (χ,v), (g,f)⟩ = 2| (χ,v), (g,f)⟩ and we refer to their span _χ,g⊂_0 as a two-particle subspace. In fact, _χ,g is completely characterized by \n\n\n    ψ∈_χ,g  ⟺   Nψ = 2ψ and N^χψ = ψ, N^gψ = ψ.\n\n\nWe note here, and shall use it later, that\n\n\n    _χ,g≃ℓ^2(^2×^2).\n\n\nWe also point out that the transportability of charges remains simple in the two-particle state. Indeed, while  operators corresponding to intersecting strings and dual strings do not commute, the corresponding automorphisms do so: Γ_γ^g((_v,v',n^χ) (^χ_γ(v'→ v))Γ_γ^χ(A) ^χ_γ(v'→ v)_v,v',n^χ) = (_v,v',n^χ) (^χ_γ(v'→ v)) (Γ^g_γ∘Γ_γ^χ)(A) ^χ_γ(v'→ v)_v,v',n^χ. Hence,\n\n\n    (_0, π_0∘Γ^g_γ∘Γ_γ^χ, T^χ_v→ v'Ω_0)\n\n\nis a GNS representation of ω^χ,g_v',f, with the gauge fixed as prescribed. \n\nSince charge is conserved, we obtain the following:\n\n\nLet K^χ,g_γ,γ be the GNS Hamiltonian introduced in (<ref>). Then\n\n\n    K^χ,g_γ,γ_χ,g⊂_χ,g.\n\n\n\n\n\nWe now concentrate our attention on the Hamiltonian restricted to this two-particle (respectively one if either χ = ι or g = 1) invariant subspace. The fact that the GNS representation and K^χ,g_γ,γ are explicit allows us to compute all relevant matrix elements, allowing for a spectral study of the model.\n\n\n\n\n\n §.§ A matrix representation of the Hamiltonian\n \n\nTo start with an easy case, we first consider (<ref>), denote again v = ∂γ, and compute\n\n\n    ⟨χ,v_1 | K_γ^χ |χ,v⟩ = ⟨χ,v_1 | K_γ^χ | Ω_0 ⟩\n    =⟨χ,v_1 |Ω_0⟩ + λ_ϵ∑_e:v∈∂ e⟨χ,v_1 |π_0(^χ_(v,e)) Ω_0⟩\n\n\nIf v≠ v_1, then\n\n\n    ⟨χ,v_1 | χ,v⟩ = ⟨π_0(^χ_γ(v_1→ v))Ω_0 |Ω_0⟩ = ω_0(^χ_γ(v_1→ v))\n\n\nvanishes since π_0(^χ_γ(v_1→ v)) adds one pair of particles to the existing Ω_0. More formally, since χ≠ι, there is g∈ G such that χ(g)≠ 1; the invariance of ω_0 under the action of ^g_λ for any closed dual path λ and (<ref>) together yield that for any A∈,\n\n\n    ω_0(^χ_γ(v_1→ v)) = ω_0((^g_λ)^χ_γ(v_1→ v)^g_λ) = \n    χ(g)ω_0(^χ_γ(v_1→ v))\n\n\nwhenever λ winds once around v but not around v_1, and so ω_0(^χ_γ(v_1→ v)) = 0 indeed.\n\nFor the same reason, ⟨χ,v_1 |π_0(^χ_(v,e)) Ω_0⟩ is non-zero only if ^χ_γ(v_1→ v) = ^χ_(v,e) (in which case it is equal to 1) namely γ(v_1→ v) = (v_1,e). As could have been expected from the basic picture of a single particle freely hopping on the lattice, we conclude that the one-particle Hamiltonian reduces to a multiple of the discrete Laplacian:\n\n\n    ⟨χ,v_1 | K_γ^χ |χ,v_2⟩=\n    λ_ϵ   if d(v_1,v_2)=1, \n     \n    1    if v_1 = v_2,\n    \n    0   otherwise.\n\n\nThe same holds for any other type of particle, with the hopping amplitude adjusted accordingly. In the following, we shall renormalize the Hamiltonian by replacing K_γ^χ→ K_γ^χ-.\n\nIn the two-particle situation, it will be convenient to insist on the representation of the lattice using sites. We first rescale the lattice so that vertices are on v∈(4)^2 and faces lie on f∈(4+2)^2. The sites are then labelled by (2+1)^2. Physically, they correspond to the coordinates of the center of mass of pairs of particles, which we denote \n\n\n    X = 1/2(f+v) ∈ (2+1)^2.\n\n\nTheir relative position is given by the complementary coordinate\n\n\n    d = 1/2(f-v)∈ (2+1)^2,\n\n\nand a general two-particle wavefunction is given by ψ(X,d) in ℓ^2((2+1)^2×(2+1)^2). \n\n\n\n\n\n §.§ Dirac anyons\n\n\nWe now consider a two-particle state having a charge χ∈Ĝ at v∈ and a charge g∈ G at f∈. We let λ^ϵ = λ^μ = λ to ensure that the duality symmetry holds, and denote λ^ϵμ=ρ. We shall label the Hamiltonian K^χ,g_λ,ρ. As we shall see, the anyonic nature of the composite particle will reveal itself in the appearance of a non-trivial spectrum. \n\nLet us first consider the case λ = 0, ρ = 1. Let S = {(1,1),(1,-1),(-1,1),(-1,-1)}. The results of Section (<ref>), see also Figure <ref>, imply that the subspace ℓ^2((2+1)^2× S) is invariant for K^χ,g_0,1, and that its orthogonal complement is the kernel of the Hamiltonian. After Fourier transforming with respect to the variable X, we conclude that, for k∈^2, \n\n\n    K^χ,g_0,1(k) = 2 \n                [              0      cos(2k_y)      cos(2k_x)              0;      cos(2k_y)              0              0 χ(g) cos(2k_x);      cos(2k_x)              0              0      cos(2k_y);              0 χ(g) cos(2k_x)      cos(2k_y)              0;                ].\n\n\nAs discussed earlier, the phase χ(g) is accumulated by the hopping of the particles across each other's string, which happens only in the case (1,-1)↔(-1,-1), see again Figure <ref>. We obtain four bands given explicitly by\n\n\n    E^χ,g_0,1(k) = ±2√(cos^2(2k_x)+cos^2(2k_y)±|cos(2k_x)cos(2k_y)|√(2+2Reχ(g)))).\n\n\nGenerically, this exhibits a Dirac cone at (π/4,π/4), see Figure <ref>. The case χ(g) = -1, which arises for example for G = _2, is special in that two sheets are exactly degenerate.\n\n\nThe case χ(g) = 1 is trivial with dispersion relation ± 2cos(2k_x)±2cos(2k_y). It corresponds to simple bosons with no phase being accumulated as the strings cross each other. Unsurprisingly maybe, the anyonic nature of the quasi-particles manifests itself in the spectrum of the two-particles Hamiltonian.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Dirac cone is a consequence of the duality symmetry, and it is not stable under the breaking of the symmetry. If we consider an asymmetric hopping by giving a different weight to the two terms of (<ref>), namely (\nℱ^χ_(v,e)ι_v'χ_v +  ℱ^χ_(v',e)ι_vχ_v'\n)(_f^h + _f'^h) and (1+m)(\nℱ^h̅_(f,e)^1_f'^h_f + ℱ^h̅_(f',e)^1_f^h_f'\n)(_v^χ + _v'^χ), with m>0, the dispersion relation then reads\n\n\n    E^(χ,g)_0,1(k) = ±√(| c(k_x)|^2+| c(k_y)|^2±| c(k_x)|| c(k_y)|√(2+2Reχ(g))).\n\n\nwhere c(s) = 2 s + (1+m)-2 s opening up a gap of size 2 m at the Dirac point, see Figure <ref>.\n\n\n\n\n §.§ Bound states and scattering states.\n The dynamics discussed above is that of a strictly bound pair of a flux and a charge. In the presence of the additional terms producing independent hoppings of the charge and the flux, we now show that the bound pair may become unstable and decay into two freely moving particles scattering away from each other.\n\nFirst of all we prove that, in the extreme case ρ = 0 and λ≠ 0, there is no bound state of the two particles at all. The restriction of H^ϵ+H^μ to the invariant space _χ,g is immediately read off (<ref>,<ref>). As in Section <ref>, it reduces to a simple discrete Laplacian, up to the phase picked up whenever the χ particle crosses the string γ associated with the g flux and reciprocally. After subtraction of the constant, we obtain\n\n\n    K^χ,g_1,0(k) = 2cos(2 k_x)Δ⊗+2 cos(2k_y) ⊗Δ\n    +2cos(2 k_x) (χ(g) σ^+ + χ(g)σ^- - σ^x) ⊗Θ,\n\n\nacting on the fibers ℓ^2(2+1)⊗ℓ^2(2+1) and corresponding to the dynamics of the relative coordinate. Here\n\n\n    (Δψ)(z) = ψ(z-2) + ψ(z+2)\n\n\nfor any z∈ 2 + 1 and Θ is the multiplication operator by the characteristic function of {j∈2+1,j<0}. In the last term, σ^♯ are the Pauli matrices acting in the space spanned by |±1⟩ (as a function in ℓ^2(2 + 1), the vector | m⟩ for m∈2 + 1 is the normalized sequence whose only non-zero element is at m), and this term amounts to replacing the trivial phase accumulated along a hopping by χ(g), respectively χ(g), whenever the two strings cross. \n\n\nLet k≠(π/4,π/4) (modπ/2). The pure point spectrum of K^(χ,g)_1,0(k) is empty.\n\n\n\nWe recall the setting of <cit.>, which is very close to the current situation. For j=1,2, let T^A_j∈(ℓ^2((2+1)^2)) be the magnetic translations in the direction of the unit vectors e_j, associated with a magnetic vector potential A: (2+1)^2×(2+1)^2→:\n\n\n    (T_e_jψ)(x) = - A(x,x+2e_j)ψ(r+2e_j).\n\n\nHere A is so that -A(x,y) = A(y,x). A simple calculation yields that (T_e_j) = (T_e_j)^-1 = T_-e_j. They satisfy the following commutation relations\n\n\n    T_e_j^-1T_e_k^-1T_e_jT_e_k = -ϕ_(e_k,e_j),\n\n\nwhere\n\n\n    ϕ_(e_k,e_j)(x) = A(x,x-2e_j) + A(x-2e_j, x-2e_j-2e_k) - A(x-2e_k,x-2e_k-2e_j) - A(x,x-2e_k)\n\n\nis naturally interpreted as the flux through the face centred at x-e_k-e_j∈(2)^2; In particular it is equal to zero whenever j=k. Note that -ϕ_(e_k,e_j) is to be understood as the corresponding multiplication operator. \n\nThe magnetic Hamiltonian is given by\n\n\n    H = c_1(T_e_1 + T_-e_1) + c_2(T_e_2 + T_-e_2),\n\n\nwhere c_1,c_2 are real constants. Let q(x) = ⟨ x,x⟩, where ⟨,⟩ is the restriction of the Euclidean inner product to (2+1)^2. Let now\n\n\n    A = [H,q].\n\n\nWe observe that for any function f,\n\n\n    [T_e_j,f] = (D_e_jf)T_e_j\n\n\nwhere (D_e_jf)(x) = f(x+2e_j) - f(x), and that \n\n\n    D_e_jD_e_kq = 8 ⟨ e_j,e_k⟩.\n\n\nA computation now yields that\n\n\n    /8[H, A] = -∑_j,k=1^2(T_e_j-T_-e_j) c_j ⟨ e_j,e_k⟩ c_k(T_e_k-T_-e_k) + C,\n\n\nwhere\n\n\n    C = ∑_j, k=1^2(c_jc_k)(D_e_kq)[T_e_j + T_-e_j,T_e_k] + (c_jc_k)(D_-e_kq)[T_e_j + T_-e_j,T_-e_k]\n\n\nis only non-zero because of the non-commutativity of the magnetic translations, since\n\n\n    [T_e_j,T_e_k] = ( - -ϕ_(-e_j,-e_k)))T_e_jT_e_k.\n\n\n\nLet us now consider the specific case K^χ,g_1,0(k), namely\n\n\n    c_1 = 2cos(2k_x),   c_2 = 2cos(2k_y),  - A(x,x+2e_j)=χ(g) δ_j,1δ_x_1,-1δ_x_2<0.\n\n\nHere, the magnetic vector potential corresponds to a flux tube through the plaquette at (0,0). Hence, the factor 1 - -ϕ_(∓ e_j,∓ e_k)(x) appearing in C does not vanish if and only if x± e_j± e_k = (0,0). In particular, it vanishes if x∉ S and hence C is a finite rank operator.\n\nWe now note that q(x) = ‖ x‖^2 is constant on S and hence (D_e_kq)(x) vanishes for all (e_k,x) such that ϕ_(-e_j,-e_k)(x)≠ 0. It follows that C=0 and\n\n\n    /8[K^χ,g_1,0(k), A] = -∑_j=1^2c_j^2(T_e_j-T_-e_j)^2 = ∑_j=1^2c_j^2(T_e_j-T_-e_j)(T_e_j-T_-e_j),\n\n\nwhich is the sum of two non-negative, but mutually non-commuting, terms. The triangle inequality yields\n\n\n    | ((T_e_j-T_-e_j)ψ)(x)|≥||ψ(x+2e_j)| - |ψ(x-2e_j)||\n    =| ((T_e_j^0-T_-e_j^0)|ψ|)(x) |,\n\n\nwhere T_e_j^0 are translation operators with A=0. This is a discrete version of the diamagnetic inequality. Hence,\n\n\n    1/8⟨ψ,[K^χ,g_1,0(k), A]ψ⟩≥∑_j=1^2c_j^2‖ (T_e_j^0-T_-e_j^0)|ψ|‖^2\n\n\nand it suffices to show that Ker(T_e_j^0-T_-e_j^0) = {0} to rule out pure point spectrum. That is immediate since the only square summable solution of\n\n\n    ((T_e_j^0-T_-e_j^0)ψ)(x) = ψ(x+2e_j)-ψ(x-2e_j) = 0\n\n\nis the zero function.\n\n\nWe now turn to the full Hamiltonian K^χ,g_λ,ρ in the two-particle sector. Let P be the orthogonal projection onto the space spanned by |±1⟩. Then\n\n\n    K^χ,g_0,1(k) = cos(2 k_x)σ^x⊗(σ^z+P)+2 cos(2k_y) P ⊗σ^x\n    +cos(2k_x)(χ(g) σ^+ + χ(g)σ^-) ⊗(P-σ^z),\n\n\nwhich, combined with K^χ,g_1,0(k) given in (<ref>), yields the full Hamiltonian. \n\n\nFor any k∈^2, let R_λ(k) = 4 λ(|cos(2k_x)| + |cos(2k_y)|). Then\n\n\n    σ_ess(K^χ,g_λ,ρ(k)) = [-R_λ(k),R_λ(k)],\n\n\nin particular, the essential spectrum is independent of ρ.\n\n\n\nSince K^χ,g_λ,ρ(k) = K^χ,g_λ,0(k) + K^χ,g_0,ρ(k), the independence of the essential spectrum on the parameter ρ follows from the fact that K^χ,g_0,ρ(k) is a finite rank perturbation. It therefore suffices to consider (<ref>), which is the magnetic operator with a simple flux tube considered in Proposition <ref>. The claim follows from Section 2 of <cit.>: The vector potential given here is gauge equivalent to the Aharonov-Bohm gauge Ã and therefore K^χ,g_λ,0(k) is unitarily equivalent to the operator K̃^χ,g_λ,0(k) given by magnetic translations with Ã replacing A. If we now denote K_λ,0(k) the operator corresponding to A=0 (it does not depend on (χ,g) indeed), then K̃^χ,g_λ,0(k) - K_λ,0(k) is compact by Proposition 3 in <cit.>. Hence the essential spectrum of the full K^χ,g_λ,ρ(k) equals that of K_λ,0(k), which is a sum of two independent discrete Laplacians, concluding the proof.\n\n\nWe conclude with a proof that K^χ,g_λ,ρ(k) has bound states for a range of parameters λ,ρ. If λ>0 then in particular K^χ,g_λ,ρ(k) has a bound state for all ρ>0, in a neighbourhood of the two lines (k_x,π/4) and (π/4,k_y).\n\n\nLet | 1+ρ/λ|>1 and let k_x≠π/4 (modπ/2). Then there is a neighbourhood  of (k_x,π/4) such that if k∈, then K^χ,g_λ,ρ(k) has four possibly degenerate eigenvalues; The corresponding eigenstates are exponentially localized.\n\n\n\nFirst of all,\n\n\n    K^χ,g_λ,ρ(k_x,π/4) = λcos(2k_x) {   (χ(g) σ^+ + χ(g)σ^-)⊗(2Θ + ρ/λ(P-σ^z)) \n        + 2Δ⊗𝕀 + σ^x⊗(-2Θ+ ρ/λ(P+σ^z)) }.\n\n\nAs should be expected, this operator is diagonal in the second tensor factor. Therefore, it suffices to search for eigenstates of the form ψ⊗| j⟩ for any j∈ 2+1. Then K^χ,g_λ,ρ(k_x,π/4) ψ⊗| j⟩ =  2λcos(2k_x) (Δ_j^χ,gψ) ⊗|j⟩, where the matrix elements of Δ_j^χ,g are\n\n\n    (Δ_j^χ,g)_m,n = \n    1    if | m-n| = 2  and (| m|,| n| )≠ (1,1) \n    \n    b_j    if (m,n) = (-1,1) \n    b_j   if (m,n) = (1,-1) \n    \n    0    otherwise\n\n\nand the values of b_j are given by\n\n\n    b_j = χ(g)    if j<-1 \n    χ(g)(1+ ρ/λ)    if j=-1 \n    \n    (1+ ρ/λ)    if j=1 \n    \n    1    otherwise\n\n\nThis is amenable to a transfer matrix analysis. If ψ is an eigenvector of Δ_j^χ,g for the eigenvalue E, then the vector ϕ given by ϕ_n = (ψ_2n+1,ψ_2n-1)^T solves\n\n\n    Tϕ_n = ϕ_n+1,     \n    T = [  E -1;  1  0 ]\n\n\nfor all n∈∖{-1,0}, with boundary condition given by\n\n\n    ϕ_0 = \n    [  E/b_j -1/b_j;      1      0 ]ϕ_-1,    ϕ_1 = \n    [    E -b_j;    1    0 ]ϕ_0,\n\n\nnamely\n\n\n    ϕ_1 = B_jϕ_-1,     \n    B_j = [ (E^2-| b_j|^2)/b_j             -E/b_j;              E/b_j             -1/b_j ].\n\n\nThe two eigenvalues of the transfer matrix are equal to τ_±=1/2(E±√(E^2-4)) with eigenvectors v_±= (\nτ_±,1)^T. The eigenvector gives rise to a solution of the eigenvalue equation that decays exponentially at +∞, respectively -∞, if the corresponding eigenvalue has modulus <1, respectively >1. Both necessarily happen simultaneously since τ_+τ_- = 1. If | E|>2, then τ_± are real with τ_+>1. Otherwise τ_- = τ_+ and hence |τ_±| = 1. Therefore, a normalizable solution of the eigenvalue equation may only exist if | E|>2. In that case, we set ϕ_1 = α v_- for some α≠ 0 and ϕ_-1 = v_+ and the boundary condition (<ref>) reduces after elimination of α to an equation for the energy\n\n\n    (E^2 - | b_j|^2)τ_+^2 =2 Eτ_+ - 1\n\n\nor equivalently \n\n\n    | b_j|^2 = τ_+^2.\n\n\nSince |τ_+|>1, we conclude that a solution exists if and only if | b_j|>1, which in turn holds if and only if j=± 1 and | 1+ ρ/λ| >1. The eigenvalues are given by\n\n\n    E = τ_+ +τ_- = ±(B + B^-1),     B = | 1+ ρ/λ|,\n\n\neach of them being doubly degenerate since | b_1| = | b_-1|.\n\nIf | 1+ ρ/λ| >1, the rest of the spectrum of Δ_j^χ,g lies in [-2,2] and corresponds to oscillatory solutions. In particular, the spectrum of K^χ,g_λ,ρ(k_x,π/4) is characterized by a gap g(k_x) given by\n\n\n    g(k_x) = 2λ|cos(2k_x) |(B + B^-1 -2),\n\n\nand g(k_x)>0 for all k_x≠π/4 (modπ/2). Since the operator-valued function k↦ K^(χ,g)_λ,ρ(k)∈(ℓ^2((2+1)^2)) is smooth, the existence of four branches of eigenstates in a neighbourhood of (k_x,π/4) away from the degenerate points k_x≠π/4 (modπ/2) is ensured by spectral perturbation theory.\n\n\n\nA similar, and simpler, analysis can be carried out around (π/4,k_y). In that case, the Hamiltonian reduces to\n\n\n    K^χ,g_λ,ρ(π/4,k_y) =2 λcos(2k_y) ( ⊗Δ + ρ/λ P ⊗σ^x)\n\n\nwhich is now diagonal with respect to the first factor. It is a simple Laplacian (and therefore has no bound state) on the range of - P, while \n\n\n    K^χ,g_λ,ρ(π/4,k_y)P⊗ = 2 λcos(2k_y) P⊗(Δ + ρ/λσ^x)\n\n\nwhich is of the same form as above, with b_±1→ 1+ρ/λ. We conclude again that two bound states exist for any k_y provided | 1+ρ/λ|>1 and they are stable away from the degenerate points.\n\n\n\n\n\n\n\n\n\n\n\n\n §.§ Acknowledgements\n\nBased upon work supported by the National Science Foundation under grants DMS–1813149 and DMS–21083901 (B.N. & S.V.). S.B. was supported by NSERC of Canada. This work was initiated while B.N. and S.B. were attending the `Spectral Methods in Mathematical Physics' program held at the Institut Mittag-Leffler, April 2019. BN gratefully acknowledges kind hospitality at the Technical University Munich during the final stages of this work and the Alexander von Humboldt Foundation for support provided through a Carl Friedrich von Siemens Research Award.\n\nunsrt\n\n\n \n\n"}