{"entry_id": "http://arxiv.org/abs/2303.07261v1", "published": "20230313164137", "title": "Ab initio electron-lattice downfolding: potential energy landscapes, anharmonicity, and molecular dynamics in charge density wave materials", "authors": ["Arne Schobert", "Jan Berges", "Erik G. C. P. van Loon", "Michael A. Sentef", "Sergey Brener", "Mariana Rossi", "Tim O. Wehling"], "primary_category": "cond-mat.str-el", "categories": ["cond-mat.str-el", "cond-mat.stat-mech", "physics.chem-ph", "physics.comp-ph", "quant-ph"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntim.wehling@uni-hamburg.de\n\n\n\nThe interplay of electronic and nuclear degrees of freedom presents an outstanding problem in condensed matter physics and chemistry.\nComputational challenges arise especially for large systems, long time scales, in nonequilibrium, or in systems with strong correlations.\nIn this work, we show how downfolding approaches facilitate complexity reduction on the electronic side and thereby boost the simulation of electronic properties and nuclear motion—in particular molecular dynamics (MD) simulations.\nThree different downfolding strategies based on constraining, unscreening, and combinations thereof are benchmarked against full density functional calculations for selected charge density wave (CDW) systems, namely 1H-TaS2, 1T-TiSe2, 1H-NbS2, and a one-dimensional carbon chain.\nWe find that the downfolded models can reproduce potential energy surfaces on supercells accurately and facilitate computational speedup in MD simulations by about five orders of magnitude in comparison to purely ab initio calculations.\nFor monolayer 1H-TaS2 we report classical replica exchange and quantum path integral MD simulations, revealing the impact of thermal and quantum fluctuations on the CDW transition.\n\n\nAb initio electron-lattice downfolding: potential energy landscapes, anharmonicity, and molecular dynamics in charge density wave materials\n    Tim O. Wehling\n    March 30, 2023\n===========================================================================================================================================\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nThe coupling of electronic and nuclear degrees of freedom is an extremely complex problem of relevance to multiple branches of the natural sciences, ranging from quantum materials in and out of thermal equilibrium <cit.> to chemical reaction dynamics <cit.>.\nLong-standing problems include the simulation of coupled electronic and nuclear degrees of freedom for large systems and large time scales, in excited states of matter or systems with strong electronic correlations.\nA central contributor to these challenges is the complexity of first-principles treatments of the electronic subsystem usually required to address real materials.\n\nCharge density wave (CDW) materials exemplify these challenges.\nThe bidirectional coupling between electrons and nuclei results in a phase transition, where the atoms of the CDW material acquire a periodic displacement from a high-temperature symmetric structure <cit.>.\nUnderstanding the characteristics of the CDW phase transitions, the emergence of collective CDW excitations, the control of CDW states, and excitation induced dynamics of CDW systems <cit.> requires typically simulations on supercells involving several hundred or thousand atoms, where eV-scale electronic processes intertwine with collective mode dynamics at the meV scale.\nCDW systems thus define a formidable spatio-temporal multiscale problem.\nSolutions to this problem can be attempted with variational techniques <cit.>, which neglect certain anharmonic effects like the anharmonic phonon decay, or by trying to circumvent the multi-scale problem by scale-separation <cit.>.\n\nCorresponding complexity reduction strategies have been developed in distinct fields: multi-scale coarse-grained models, machine-learning models <cit.>, or (density functional) tight binding potentials <cit.> have been put forward.\nIn these methods, models\n are defined by fitting semiempirical or “machine learned” (neural networks, Gaussian processes, others) based parameter functions to reference data often taken from density-functional theory (DFT) <cit.> calculations.\n\nIn the field of strongly correlated electrons, one also deals with minimal models, which typically focus on low-energy degrees of freedom: The electronic system is divided into high- and low-energy sectors.\nThen, the high-energy states are integrated out via field theoretical or perturbative means, leaving an effective low-energy model <cit.>.\nMethods for the derivation of model parameters include the constrained random phase approximation (cRPA) <cit.>, constrained density functional perturbation theory (cDFPT) <cit.>, and the constrained functional renormalization group <cit.>.\nThe field theoretical integrating out of certain electronic states is often called “downfolding”.\n\nIn this work, we demonstrate how downfolding approaches for complexity reduction on the electronic side boost the simulation of coupled electronic and nuclear degrees of freedom—in particular molecular dynamics (MD) simulations.\nThe idea is to map the first-principles solid-state Hamiltonian onto minimal quantum lattice models, where “minimal” refers to the dimension of the single-particle Hilbert space.\nThree different downfolding strategies based on constraining, unscreening, and combinations thereof, are compared and demonstrated along example cases from the domain of CDW materials.\n\nWe start by introducing the first-principles electron-nuclear Hamiltonian and the minimal quantum lattice models together with the three downfolding schemes in Section <ref>.\nPotential energy surfaces resulting from the downfolded models are benchmarked against DFT for exemplary CDW systems in Section <ref>.\nMD simulations based on a downfolded model are presented in Section <ref>, where the CDW transition of 1H-TaS2 is studied as a function of temperature, and the computational performance gain from downfolding is analyzed.\n\n\n\n§ FROM FIRST-PRINCIPLES TO MINIMAL LATTICE MODELS\n\n\n\n\n\nThe general Hamiltonian of interacting electrons and nuclei in the position representation and atomic units, where in particular m  e = e = 1, reads\n\n    H FP = -∑_i Δ_i/2\n        - ∑_k Δ_k/2 M_k\n    \n        + ∑_i < j1/|r⃗_i - r⃗_j|\n        + ∑_k < lZ_k Z_l/|R⃗_k - R⃗_l|\n        - ∑_i kZ_k/|r⃗_i - R⃗_k|,\n\nwhere r⃗_i and R⃗_k are electronic and nuclear positions, Δ_i and Δ_k are the corresponding Laplace operators, and Z_k and M_k are atomic numbers and nuclear masses.\nThis Hamiltonian is also called “first-principles (FP) Hamiltonian”, since only fundamental laws (i.e., the Schrödinger equation, Coulomb potential, etc.) and fundamental constants (elementary charges etc.) enter.\nIt accounts for full atomic scale and chemical details.\nNumerical treatments leading directly from this Hamiltonian to physical results are called “ab initio”, cf. Fig. <ref> (left).\n\nIn principle, DFT provides us with a tool to calculate the total (free) energy and forces given fixed atomic positions R⃗_k as needed for MD simulations in the Born-Oppenheimer approximation <cit.>.\nHowever, since DFT calculations with large supercells are prohibitively expensive, it is desirable to obtain these energies and forces in a cheaper way, while remaining close to the quantum mechanical accuracy of ab initio simulations.\n\nHere, our goal is to use a reduced low-energy electronic Hilbert space for this purpose, with only a few orbitals per unit cell, cf. Fig. <ref> (right).\n\nWe thus aim to work with a lattice model\n\n    H = H el + H n + H el-n,\n\nwhich consists of the low-energy electronic subsystem\n\n    H el = H^0 el + H^1 el+ H DC\n\nwith one-body\n\n    H^0 el= ∑_k⃗ nϵ^0_k⃗ n\n        c_k⃗ n\n        c_k⃗ n,\n\nCoulomb interaction\n\n    H^1 el = 1/2 N∑\n        U_q⃗k⃗ m n k⃗' m' n'\n        c_k⃗ + q⃗ m\n        c_k⃗' n'\n        c_k⃗' + q⃗ m'\n        c_k⃗ n,\n\n and double counting (H DC) parts, the nuclear subsystem\n\n    H n = -∑_k Δ_k/2 M_k+V^0(u⃗_1,…,u⃗_N  n),\n\nand a coupling between the electronic and nuclear degrees of freedom\n\n    H el-n = ∑_q⃗k⃗ m n V_q⃗k⃗ m n(u⃗_1,…,u⃗_N  n)\n        c_k⃗ + q⃗ m\n        c_k⃗ n .\n\n\nThe electronic subspace is spanned by a set of low-energy single particle states |k⃗ n⟩, with k⃗ the crystal momentum, and n summarizing further quantum numbers (band index, spin).\nc_k⃗ n (c_k⃗ n) are the corresponding electronic creation (annihilation) operators.\nN is the number of k⃗ points summed over.\nThe nuclear degrees of freedom are expressed in terms of displacements (u⃗_1, …, u⃗_N  n) ≡u⃗=R⃗-R⃗_0 from a relaxed reference structure R⃗_0.\n\nH el describes the low-energy electronic subsystem in the non-distorted configuration (u⃗=0) with the effective electronic dispersion ϵ^0_k⃗ n and an effective Coulomb interaction U.\nIn this work, ϵ^0_k⃗ n is always taken from the DFT Kohn-Sham eigenvalues of the undistorted reference system.\nWhenever U≠ 0, a term H DC has to be added to avoid double counting (DC) of the Coulomb interaction already contained in the Kohn-Sham eigenvalues (see Appendix <ref>).\n\nV^0 plays the role of an effective interaction between the nuclei, or equivalently a partially screened deformation energy, which accounts for the Coulomb interaction between the nuclei and the interaction between the nuclei and the high-energy electrons not accounted for in H el.\nIn this work, we expand V^0 to second order in the atomic displacements u⃗,\n\n    H def   =V^0=-∑_i ℱ^0_i u_i + 1/2∑_i j\n        u_i C_i j u_j,\n\nwhere ℱ⃗^0 is a force vector and C a force constant matrix.\nThe coupling between the displacements and the low-energy electronic system from Eq. (<ref>) is expanded to first order in the displacements u⃗:\n\n    H el-n = u⃗∑_q⃗k⃗ m nd⃗_q⃗k⃗ m n\n        c_k⃗ + q⃗ m\n        c_k⃗ n.\n\nHere, d⃗_q⃗k⃗ m n=∇⃗_u⃗ V_q⃗k⃗ m n(u⃗), and u⃗·d⃗_q⃗k⃗ m n plays the role of a displacement-induced potential acting on the low-energy electrons.\n\nMD simulations are a major motivation for constructing the low-energy electronic model.\nThese simulations are here performed at various temperatures, using an electronic model that is established based on a single DFT and density functional perturbation theory (DFPT) calculation.\nThe effective free energy of the system at given nuclear coordinates R⃗ = R⃗_0 + u⃗ is\n\n    F(u⃗)=-kTlog Z(u⃗).\n\nHere, the partition function Z(u⃗)=_ elexp(-β H) traces out the electronic degrees of freedom but not the nuclei.\nThus, F(u⃗) plays the role of a potential energy surface, which governs the dynamics of the nuclei in Born-Oppenheimer approximation.\nForces acting on the nuclei are then ℱ⃗=-∇⃗_u⃗ F(u⃗) and can be conveniently obtained using the Hellman-Feynman theorem (see Appendix <ref>):\n\n    ℱ⃗\n        = -∑_q⃗k⃗ m nd⃗_q⃗k⃗ m n⟨ c_k⃗ + q⃗ m\n        c_k⃗ n⟩.\n\n\nC, U, and d⃗ entering the model Hamiltonian H are not bare but (partially) screened quantities.\nThe (partial) screening has to account for electronic processes not contained explicitly in H.\nHere, we consider three different schemes to determine C, U, and d⃗:\n\n    \n  Model I strictly follows the idea of the constrained theories <cit.>.\n        In these theories, the high-energy electronic degrees of freedom are integrated out to derive the low-energy model.\n        The parameters entering the low-energy Hamiltonian are therefore “partially screened” by the high-energy electrons.\n        In particular, we use cRPA for the Coulomb interaction U and cDFPT for the displacement-induced potential d⃗ and for the force constant matrix C.\n    \n  Model II again applies U from cRPA.\n        Now, however, d⃗ and C are based on the unscreening of the respective DFPT quantities using U inspired by Ref. <cit.>.\n    \n  Model III considers a non-interacting low-energy system, U=0.\n        d⃗ is taken from DFPT.\n        C is obtained from unscreening DFPT.\n        This approach is inspired by Ref. <cit.>.\n\n\nIn all models, the force vector ℱ⃗^0 entering H_ def in Eq. (<ref>) is chosen to guarantee that F /  u_i |_u⃗ = 0 = 0, i.e., vanishing forces also in the models for the reference structure R⃗_0.\nThe term -ℱ⃗^0 u⃗, thus, plays the role of a “force double counting correction” similar to Refs. <cit.>.\n\nSince the downfolding is done on the primitive unit cell for u⃗ = 0, and we are interested in the potential energy surface for displacements on supercells, we have to map the model parameters ϵ^0, C, U, and d⃗ from the unit cell to the supercell.\nFor displacements with the supercell periodicity, we can set q⃗ = 0 in Eq. (<ref>) and—within the random phase approximation (RPA)—also in Eq. (<ref>) and drop the corresponding subscripts.\n\nWe have implemented this mapping for arbitrary commensurate supercells defined by their primitive lattice vectors A⃗_i = ∑_j N_i ja⃗_j with integer N_i j <cit.>.\nIt relies on localized representations in the basis of Wannier functions and atomic displacements <cit.>, for which the mapping is essentially a relabeling of basis and lattice vectors.\n\n\n\n §.§ Unscreening in models II and III\n\n\n\nThe central idea of models II and III is to choose C entering H_ def such that ^2 F /  u_i  u_j |_u⃗=0=C DFT_i j, where the latter are the DFT force constants, accessible via DFPT.\nIn model II we additionally require that the screened deformation-induced potential and accordingly the screened electron-phonon vertex at the level of the static RPA matches the corresponding DFPT quantity.\n\nThe unscreening procedure is represented diagrammatically: The Green's function resulting from the undistorted Kohn-Sham dispersion ϵ^0_k⃗ n is shown as a black arrow line, G→[baseline=(0,-0.1)]\n    [el] (-1, 0) to (0, 0);.\nWe use a wavy line to denote the Coulomb interaction U→[baseline=(0,-0.1)]\n    [decorate,decoration=snake] (-1.5,0) – (-1,0.);\nobtained from cRPA.\nThe deformation-induced potential obtained from DFPT, which is by definition fully screened, is represented as a black dot, d⃗DFT=d⃗III→[baseline=(0,-0.1)]\n    [] (0.0,0) circle (3pt);.\n\n\n\n  §.§.§ Model II\n\n\nWe define the unscreened deformation-induced potential d⃗II→[baseline=(0,-0.1)]\n    [red] (0.0,0) circle (3pt);\n(red dot) entering model II via Eq. (<ref>) as\n\n    [red] (0.0,0) circle (3pt);\n        \n        =\n        [black] (0.0,0) circle (3pt);\n        \n        -\n        [baseline=(0,-0.1)]\n            [decorate,decoration=snake] (-1.5,0) – (-1,0.) ;\n            [el] (-1, 0) to[out=-70, in=-110] (0, 0);\n            [el] (0, 0) to[out=+110, in=+70] (-1, 0);\n            [] (0.0,0) circle (3pt);\n        ,\n\nwhich can be written in shorthand notation as d II = d - U  d, or explicitly as\n\n    d⃗II_k⃗ m n = d⃗_k⃗ m n\n        - 1/N∑_k⃗' m' n' αβ\n    φ_k⃗α mφ_k⃗β n\n        U_αβφ_k⃗' α m'φ_k⃗' β n'f(ϵ_k⃗' m') - f(ϵ_k⃗' n')/ϵ_k⃗' m' - ϵ_k⃗' n'd⃗_k⃗' m' n'.\n\nHere, ϵ_k⃗ n, φ_k⃗β n are the eigenvalue and -vector of band n from the undistorted Wannier Hamiltonian, and U_αβ is the cRPA Coulomb interaction in the orbital basis.\n\nThe definition in Eq. (<ref>) implies that the static RPA screening of the deformation-induced potential in model II indeed matches the DFPT input, since\n\n    [black] (0.0,0) circle (3pt);\n           =\n        [red] (0.0,0) circle (3pt);\n        \n        +\n        [baseline=(0,-0.1)]\n            [decorate,decoration=snake] (-1.5,0) – (-1,0.) ;\n            [el] (-1, 0) to[out=-70, in=-110] (0, 0);\n            [el] (0, 0) to[out=+110, in=+70] (-1, 0);\n            [] (0.0,0) circle (3pt);\n        \n       =\n        [red] (0.0,0) circle (3pt);\n        \n        +\n        [baseline=(0,-0.1)]\n            [decorate,decoration=snake] (-1.5,0) – (-1,0.) ;\n            [el] (-1, 0) to[out=-70, in=-110] (0, 0);\n            [el] (0, 0) to[out=+110, in=+70] (-1, 0);\n            [red] (0.0,0) circle (3pt);\n        \n        +\n        [baseline=(0,-0.1)]\n            [decorate,decoration=snake] (-3,0) – (-2.5,0.) ;\n            [el] (-2.5, 0) to[out=-70, in=-110] (-1.5, 0);\n            [el] (-1.5, 0) to[out=+110, in=+70] (-2.5, 0);\n            [decorate,decoration=snake] (-1.5,0) – (-1,0.) ;\n            [el] (-1, 0) to[out=-70, in=-110] (0, 0);\n            [el] (0, 0) to[out=+110, in=+70] (-1, 0);\n            [red] (0.0,0) circle (3pt);\n        \n        +…\n\n\nThe force constant matrix C = C DFT - Δ C RPA entering model II is obtained by unscreening the DFPT fully screened force constants C DFT on the RPA level, i.e., we subtract the second-order response in RPA of the electronic system to the atomic displacements, as given by the bubble diagram\n\n    Δ C RPA   =\n        [baseline=-0.6ex]\n            [el] (1, 0) to[out=-70, in=-110] (2, 0);\n            [el] (2, 0) to[out=+110, in=+70] (1, 0);\n            [] (1, 0) circle (3pt);\n            [red] (2, 0) circle (3pt);\n        .\n\n\n\n\n  §.§.§ Model III\n\n\nAgain, we construct the total free energy to be exact in second order.\nAs in model II, we have to subtract the unwanted second order, C = C DFT - Δ C III.\nThe change in the interatomic force constants for this non-interacting model is given by the bubble diagram (cf. Appendix <ref>)\n\n    Δ C III   =\n        [baseline=-0.6ex]\n            [el] (1, 0) to[out=-70, in=-110] (2, 0);\n            [el] (2, 0) to[out=+110, in=+70] (1, 0);\n             (1, 0) circle (3pt);\n             (2, 0) circle (3pt);\n        .\n\nThe unscreening is exact when the DFT force constants, the bubble diagram, and the free energy are evaluated at the same electronic temperature T DFT.\nThis electronic temperature facilitates the treatment of metals within DFT calculations.\nHowever, on the model side we have the freedom to evaluate the free energy at a different electronic temperature T_M.\nInterestingly, the resulting second order is still a very good approximation to the DFT force constants at temperature T_M <cit.>, as it will be demonstrated in this work.\n\n\n\nThis completes the definitions of models I, II, and III, which are also summarized in Table <ref>.\nIn the following, we will explain and demonstrate the downfolding according to models I–III along the case example of monolayer 1H-TaS2.\n\n\n\n§ CDW POTENTIAL ENERGY LANDSCAPES IN 1H-TAS2: DFT VS DOWNFOLDING\n\n\n\n\n\nMonolayer 1H-TaS2 exhibits a 3× 3 CDW <cit.>, where atoms are displaced from their symmetric positions as illustrated in Fig. <ref>a.\nCoupling between electrons within the low-energy subspace (highlighted in Fig. <ref>b) and the lattice distortions u⃗ is responsible for the 3× 3 CDW instability <cit.>.\nHence, we choose these three bands to span the low-energy subspace of electrons in the Hamiltonian H.\n\nWe present practical calculations using downfolding models I–III and benchmark the resulting potential energy landscapes against full DFT calculations.\nDetails of the DFT calculations are presented in Appendix <ref>.\nThe energy landscapes will be illustrated along the displacement direction of the CDW distortion: u⃗ = α (R⃗CDW - R⃗_0).\nHere, R⃗_0 is the symmetric relaxed structure, and R⃗CDW is the CDW structure as obtained by DFT.\nα plays the role of a scalar coordinate, where by construction α=0 yields the symmetric state and α=1 the CDW displacement pattern.\nNote, however, that the models readily yield the full energy landscape for arbitrary displacements.\n\nModel I starts with partially screened force constants C from cDFPT in H def, which exclude screening processes taking place within the low-energy electronic target space highlighted in Fig. <ref>b.\nThe “bare” harmonic potential energy versus displacement curves resulting from H def (dark gray cDFPT parabola) is compared to full DFT total energy calculations (crosses) in Fig. <ref>c.\nThe upward opened cDFPT parabola shows that the CDW lattice instability is induced by the electrons of the target subspace, in accordance with Ref. <cit.>.\n\n\n\nWe account for density-density type Coulomb matrix elements in H el, which we obtain from cRPA, and solve the resulting model Hamiltonian H for the potential energy landscape F(u⃗) in Hartree approximation.\nSee Appendix <ref> for a detailed description of the Hartree calculations.\nThe resulting total (free) energy versus displacement curve is compared to DFT in Fig. <ref>a.\nModel I generates an anharmonic double-well potential and thus features a CDW instability like DFT.\nThere is, however, no quantitative match between model I and DFT.\nThe harmonic term of the DFT free energy is not reproduced by model I.\nIn comparison to DFT, model I and its subsequent Hartree solution involve two additional approximations, which could be responsible for the deviations to second order: neglecting non density-density type Coulomb terms, and neglecting exchange-correlation effects.\n\nModel II suppresses deviations from the DFT potential energy landscape to second order in u⃗ by construction: Since the fully screened deformation energy from DFPT agrees with the DFT energy versus displacement curve (see Fig. <ref>b), as it must be, also the solution of the downfolded model II matches DFT to second order in the displacement (Fig. <ref>b).\nThe overall match between the downfolded model II and DFT is clearly much better than for model I and indeed almost quantitative also at displacements |α|≳ 1, where anharmonic terms are substantial.\n\nAlso model III, which involves non-interacting electrons coupled to lattice deformations via fully screened DFPT displacement-induced potentials, recovers the DFT potential energy vs displacement curve for the 3 × 3 CDW distortion in 1H-TaS2 almost quantitatively (Fig. <ref>c) and even slightly better than model II.\n\n\n\nWe also applied downfolding model III to monolayer 1T-TiSe2, a one-dimensional carbon chain, and monolayer 1H-NbS2 as examples of further CDW materials.\nThe resulting potential energy landscapes in Fig. <ref> show the agreement between DFT and the downfolded model.\nHence, model III captures the most important anharmonicities in these cases.\n\n\n\n §.§ Influence of Wannier orbitals and electronic Hilbert space dimension\n\n\nSince the electronic Hamiltonian [Eq. (<ref>)] is represented via Wannier functions, we have a certain freedom of choice.\nFrom a computational standpoint, we are aiming for a maximal reduction of the dimension of the single-particle Hilbert space, while maintaining a reasonable level of accuracy.\nThus, the natural question arises: How many and which Wannier orbitals to choose to create the single-particle Hilbert space?\n\nFor 1H-TaS2, we compare a “minimal” and a “maximal” model involving, respectively, three and eleven Wannier orbitals per unit cell: In the case of three orbitals, there are three d-type orbitals on the Ta atom (d_z^2, d_x^2-y^2, d_xy), and in the case of eleven orbitals, there are five d-type orbitals on the Ta atom (d_z^2, d_xz, d_yz, d_x^2-y^2, d_xy) and three p-type orbitals on both S atoms (p_x,p_y,p_z).\nNote, that these are the Hilbert space dimensions on the primitive unit cell.\nOn the 3×3 supercell calculations, the dimensions are 27 and 99 respectively.\n\n\n\nWe compare the energy-displacement curves resulting from model III for both Hilbert space sizes to DFT in Fig. <ref>.\nWhile the results are similar in both cases, the eleven orbital model is slightly closer to full DFT than the three orbital model.\nIn the eleven-orbital model, the displacement potentials directly induce changes in the d-p hybridization.\nWe speculate that anharmonicities associated with these rehybridization terms are responsible for the slightly improved accuracy of the eleven band model.\n\n\n\n §.§ Electronically generated anharmonicities\n\n\nModels I, II, and III are based on the electronic structure at the symmetric equilibrium positions of the atoms, as well as the linear response to displacements that is accessible in DFPT.\nBy construction, models II and III guarantee agreement with the full DFT calculation at small displacements u⃗, up to order u⃗^2 in the energy and up to order u⃗ in the electronic structure.\nOne might wonder if these models, based on linear response, can ever be useful for the description of the distorted phase, which is necessarily stabilized by anharmonicity and terms of order u⃗^3, u⃗^4, and beyond.\n\nThe close match between the significantly anharmonic DFT potential energy landscapes and models II and III in Figs. <ref>, <ref>, and <ref> at |α|≳ 1 might thus come as a surprise.\nThe reason behind the good match even in the anharmonically dominated region can be understood in the following sense: linear changes in the electronic potential lead to non-linear changes in eigenvalues of the electronic Hamiltonian and therefore in the total energy.\nThus, if the low-energy electrons are responsible for the anharmonicity that stabilizes the CDW, then a low-energy electronic model based on DFPT quantities has the possibility to describe this.\n\n\n\nThis hypothesis is further corroborated by the comparison of energy-displacement curves for 1H-TaS2 at different electronic smearings to those of the related system 1H-WS2, in Fig. <ref>.\n\nThe electronic band structure of WS2 <cit.> is very similar to the one of TaS2 (see Fig. <ref>b) with the key difference that it has one additional valence electron per unit cell.\nHence, the half-filled conduction band of TaS2 becomes completely filled in the WS2 case, which renders WS2 semiconducting and quenches the response of the low energy electronic system.\nSimilarly, an increased electronic smearing/temperature quenches the response of the low-energy electronic system.\nBoth WS2 and TaS2 at high smearing, are dynamically stable, which is indicated by the positive second order of the free energy in Fig. <ref>a.\nThis tells us that at least the harmonic term is significantly affected by the occupation of the low-energy subspace.\nFurthermore, in Fig. <ref>b, we show the corresponding anharmonic part of the free energies.\nThe flat shape of the high smearing (dark red) and the WS2 (gray) curves show that the anharmonicity is strongly reduced compared to the low smearing cases.\nThese observations suggest that the anharmonicities associated with the CDW formation in 1H-TaS2 indeed originate to a large extent from non-linearities in the response of the low-energy electronic system to the external displacement-induced potentials.\n\nAnharmonicities associated with the non-linear low-energy electronic response comprise single-particle and Coulomb contributions.\nWe analyze these contributions diagrammatically in the following for the grand canonical potential Ω:\n\nModel III has the Coulomb contributions accounted for indirectly via the fully screened DFPT deformation-induced potential and the diagrams contributing to anharmonicities in Ω are of the following types:\n\n\n    Ω^ IIIanh   =\n        [baseline=-0.6ex]\n            [el] (0, 0) +(30:1) – (0, 0);\n            [el] (0, 0) – +(-30:1);\n            [el] (0, 0) +(-30:1) – +(30:1);\n             (0, 0) circle (3pt);\n             (0, 0) +(+30:1) circle (3pt);\n             (0, 0) +(-30:1) circle (3pt);\n        \n        +\n        [baseline=-0.6ex]\n            [el] (0, -0.5) – (1, -0.5);\n            [el] (1, -0.5) – (1, 0.5);\n            [el] (1, 0.5) – (0, 0.5);\n            [el] (0, 0.5) – (0, -0.5);\n             (0, -0.5) circle (3pt);\n             (0, 0.5) circle (3pt);\n             (1, -0.5) circle (3pt);\n             (1, 0.5) circle (3pt);\n        \n        + …\n\n\nModel II has explicit Coulomb interaction entering and the diagrammatic content is determined by the approximation used to treat the Coulomb interaction in model II.\nWhen solving model II in self-consistent Hartree approximation, we generate terms screening the deformation-induced potential according to Eq. (<ref>).\nThus, the anharmonic contributions to the grand potential in model II, Ω^ IIanh, contain those diagrams also present in model III but also further ones.\nFor example, at order u⃗^4, model II contains a diagram of the form\n\n    [rotate=90,scale=1.5]\n         (-60:0.3) circle (2pt) ;\n         (-120:0.3) circle (2pt) ;\n         ((60:0.3)+(0,0.4)) circle (2pt) ;\n         ((120:0.3)+(0,0.4)) circle (2pt) ;\n         (-60:0.3) edge[draw,el] (-120:0.3);\n         (-120:0.3) edge[draw,el] (0,0) ;\n         (0,0) edge[draw,el] (-60:0.3) ;\n         ((60:0.3)+(0,0.4)) edge[draw,el] ((120:0.3)+(0,0.4)) ;\n         ((120:0.3)+(0,0.4)) edge[draw,el] (0,0.4) ;\n         (0,0.4) edge[draw,el] ((60:0.3)+(0,0.4));\n        [decorate,decoration=snake] (0,0) – (0,0.4);\n    ,\n\nwhich is not present in model III.\n\nBoth the Green's function (not shown here) and total energy or grand canonical potential in models II and III agree at small displacements (by construction) and disagree at higher orders in u⃗, and their difference scales with the strength of the Coulomb interaction.\nFundamentally, the Green's function of the exact DFT solution contains interaction-mediated anharmonic response to displacements, just like model II does.\nAt the same time, in our current implementation model II only contains Hartree-like diagrams of this kind and lacks other diagram topologies present in the exact DFT solution.\nThese additional diagrams can lead to substantial error cancellation.\nThus, it is hard to make general arguments about which model to prefer beyond order u⃗^2, given the opaqueness of the underlying DFT exchange-correlation functional.\nWe speculate that cancellations similar to those occurring in second order <cit.> in u⃗ could be also effective in higher orders.\nIn our numerical studies, we find that the total energy curves of model II and III are relatively close for the systems studied here.\n\n\n\n§ DOWNFOLDING-BASED MOLECULAR DYNAMICS\n\n\n\nSo far we have seen that the downfolded models can reproduce total free energies from DFT.\nIn the following Section <ref>, we assess the computational speed of these models, which ultimately paves the way to enhanced sampling simulations based on MD.\nAs a demonstration of this enhancement, we perform the downfolding-based MD for the case example of monolayer 1H-TaS2 in Section <ref>.\n\n\n\n §.§ Benchmark of model III against DFT: force and free energy calculations\n\n\n\nTo demonstrate the performance gain of model III, we benchmark the calculation of forces and free energies against DFT.\nFor this benchmark, we perform structural relaxations of 1H-TaS2 starting from random displacements |u_i| < 0.01 Bohr—to mimic the conditions of a MD simulation step—on different supercells.\nDurations are averaged over five steps, excluding the first step starting from the initial guess for the density in the DFT case.\nCalculations are performed on identical machines, using equivalent computational parameters (cf. Appendix <ref>).\nThe results are shown in Fig. <ref>.\n\n\n\nMore precisely, we benchmark two implementations of model III: Calculations on finite k⃗ meshes, as shown in the previous Section <ref>, currently require a lot of memory to store the deformation-induced potential in the real-space (d⃗_R⃗, R⃗') and reciprocal-space (d⃗_q⃗ = 0, k⃗) representations, which limits the system to similar sizes as achievable in DFT (Fig. <ref>a).\nThus, in this section, we instead use a sparse representation, which uses significantly less memory (Fig. <ref>b), reaching linear scaling with the system size (cf. Ref. <cit.>), but is currently restricted to k⃗ = 0, appropriate for large supercells.\nIt also increases the time needed to initialize the program (Fig. <ref>c, d), which however does not influence the MD simulations.\nComparing to the same DFT program we use to obtain the parameters for the downfolded model, i.e., the plane-wave code Quantum ESPRESSO <cit.>, we find a speedup of about five orders of magnitude in the downfolding approach for the relevant systems (Fig. <ref>e, f).\nNote that our implementation is based on NumPy and SciPy <cit.> and that optimizations both on the ab initio and on the model side are possible.\n\nThe computational advantage from the non-interacting model III over DFT is easily explained: While DFT relies on the self-consistent solution of the Kohn-Sham system, model III only needs a single matrix diagonalization to solve the Schrödinger equation.\nMost importantly, through downfolding, the matrix in model III only covers the low-energy subspace of the electronic structure, as opposed to DFT, whose matrix accounts for low- and high energy bands.\nIn fact, most of the time is spent on setting up the Hamiltonian matrix and evaluating the forces [Eq. (<ref>)].\nTo guarantee that the former is Hermitian and to make the use of sparse matrices more efficient, we have symmetrized d⃗_R⃗, R⃗' αβ = d⃗_R⃗ - R⃗', -R⃗' βα and neglected matrix elements smaller than 1 % of the maximum, the effect of which on the free-energy landscape is negligible.\n\n\n\n §.§ Enhanced sampling simulations based on downfolded model III\n\n\n\nWe now perform enhanced sampling simulations based on MD with the downfolding scheme defined by model III.\nTo this end, we implemented a Python-based tight-binding solver <cit.>, which delivers displacement field dependent forces and total free energies to the i-PI (path integral) MD engine <cit.>.\n\nAs stated in the previous section, we find a speedup of about five orders of magnitude in the downfolding approach.\nThus, the downfolding approaches make larger system sizes and longer time scales well accessible.\nWhile for instance Ref. <cit.> simulates the dynamics of 3 × 3 supercells of 1H-NbS2 with AIMD for time scales of about 6 to 12 ps, the downfolding-based MD allows us to address much larger 18 × 18 supercells for time scales of about 500 ps using a similar amount of CPU core hours.\n\nFor monolayer 1H-TaS2, we performed classical (and path integral) replica exchange MD simulations (see Appendix <ref>) on the 18 × 18 supercells using 26 replicas (and 10 beads) spanning a temperature range from 50 to 200 K in the canonical (NVT) ensemble.\nIn each MD step ν we record the position vectors of all nuclei R⃗_l(ν,T) for all temperatures T.\nDefining the structure factor\n\n    S(q⃗)=1/N|∑_l=1^N e^-iq⃗·R⃗_l|^2\n\nfor a given atomic configuration R⃗_l, we obtain the temperature-dependent MD ensemble averaged structure factors ⟨ S(q⃗)⟩_T.\nWe confine the summation to the positions of the tantalum atoms and normalize the structure factor such that S(q⃗=0)=1.\n\n\n\n\n\nThe resultant structure factor maps on the first Brillouin zone of 1H-TaS2 are shown in Fig. <ref> for temperatures T=50,81,96,200 K [We show those q⃗-vectors compatible with the periodic boundary conditions on the 18× 18 unit cell.].\nThe upper row corresponds to classical MD simulations.\nAt 50 K, we find peaks in the structure factor at q⃗=2/3 ΓM, which are characteristic of the 3 × 3 CDW.\nThese peaks broaden and become reduced in intensity upon increasing temperature.\nFig. <ref> shows the temperature dependence of ⟨ S(q⃗=2/3 ΓM)⟩_T in more detail.\nWe see the aforementioned temperature-induced reduction in ⟨ S(q⃗=2/3 ΓM)⟩_T with an inflection point around TCL≈ 96 K.\nWe take this inflection point as the finite system size approximation to the phase transition temperature that would be expected for an infinitely large simulation cell.\n\nWhile a 3 × 3 CDW has been observed in monolayer 1H-TaS2 <cit.>, the exact transition temperature is not known in this system.\nFor the three-dimensional bulk of 2H-TaS2 CDW, transition temperatures on the order of Texp≈ 75 K have been reported <cit.>.\nOur classical finite system size estimate exceeds these temperatures by about 25 %.\nOne possible origin of this deviation can be quantum fluctuations in nuclear degrees of freedom.\n\nTherefore, we performed path integral MD (PIMD) replica exchange simulations to assess the influence of nuclear quantum effects on the CDW formation.\nThe PIMD structure factor maps in the middle row of Fig. <ref> behave qualitatively similar to the classical counterpart.\nTheir ratio is quantitatively illustrated in the lowest row.\nThe overall area of the Brillouin zone turns from blue to white by heating up the system.\nThus, as expected, the classical and quantum simulations agree at high temperatures.\nHowever, the CDW fingerprints (q⃗=2/3 ΓM and q⃗=M) clearly increase in intensity and survive at higher temperatures in the classical case.\n\nThis difference between classical and quantum simulations can be inspected in more detail in Fig. <ref>.\nWhile the qualitative shape of the PIMD curve (dark blue) is similar to the classical MD (light blue) simulation, we find an effective shift of the curve and an inflection point at TPI≈ 82 K.\nThus, quantum effects can significantly reduce the estimated CDW transition temperature as compared to the classical estimate and lead to a closer match with experiment.\n\nFrom these demonstrator calculations it becomes clear that the downfolding-based MD developed in this work opens the gate for precise computational studies of CDW (thermo)dynamics, which were inaccessible in the domain of ab initio MD hitherto.\n\n\n\n§ CONCLUSIONS\n\n\nWe presented three downfolding schemes to describe low-energy physics of electron-lattice coupled systems—in particular CDWs—on a similar level of accuracy as full ab initio DFT: model I is based on constrained theories and models II and III are based on unscreening, where model II features explicit Coulomb interactions and model III is effectively non-interacting.\nThe central goal of these downfolding schemes is to reduce the complexity of first-principles electronic structure calculations.\nThis is achieved by mapping the general solid-state Hamiltonian onto minimal quantum lattice models with only a few localized Wannier orbitals per unit cell.\nThe solution of these models is significantly faster than DFT.\nFor model III, we found a speedup of about five orders for the example case of monolayer 1H-TaS2.\nDespite this enormous speedup and an complexity reduction, we demonstrated a quantitative recovery of DFT potential energy surfaces in downfolded models II and III.\n\nAs a demonstration, we performed classical and path integral MD simulations using model III of the 1H-TaS2 CDW systems.\nThe downfolding-based speedup opens the gate for enhanced sampling techniques and path integral simulations of nuclear quantum effects on the CDW transition.\nThis makes downfolding models the method of choice for precise computational studies of dynamics and thermodynamics in CDW systems, which were hitherto largely inaccessible to ab initio MD.\n\nWhile we focussed, here, on Born-Oppenheimer MD, the Hamiltonians resulting from downfolding models I–III are generic and likely applicable also when dealing with non-adiabatic phenomena, electron-lattice coupled dynamics in excited electronic states, and situations where strong electron-electron correlations are at play.\nDue to the explicit account of Coulomb interactions in models I and II, these schemes offer themselves for treatments of situations where electronic interaction effects beyond semilocal DFT are to be included in studies of coupled electron-nuclear dynamics.\n\nFuture applications of the downfolding schemes developed here might reach to the physics of (nonequilibrium) phase transitions involving CDW order <cit.> or the interplay of correlations and (dis)ordering <cit.> as well as driven quantum systems <cit.>.\n\n\nThe authors would like to thank Jean-Baptiste Morée for discussions of the RESPACK software package and Bálint Aradi for technical advice.\nWe gratefully acknowledge support from the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) through RTG 2247 (QM^3, Project No. 286518848) (AS, TW), FOR 5249 (QUAST, Project No. 449872909) (TW), EXC 2056 (Cluster of Excellence “CUI: Advanced Imaging of Matter”, Project No. 390715994) (TW, SB),  EXC 2077 (University Allowance, University of Bremen, Project No. 390741603) (JB), SFB 951 (Project No. 182087777) (MR), and SE 2558/2 (Emmy Noether program) (MAS).\nJB gratefully acknowledges the support received from the “U Bremen Excellence Chair Program” and from all those involved in the project, especially Lucio Colombi Ciacchi and Nicola Marzari.\nEvL acknowledges support from the Swedish Research Council (VR) under grant 2022-03090 and from the Crafoord Foundation.\nWe also acknowledge the computing time granted by the Resource Allocation Board and provided on the supercomputer Lise and Emmy at NHR@ZIB and NHR@Göttingen as part of the NHR infrastructure.\n\n\n\n\n\n\n§ FREE ENERGY CALCULATIONS OF THE DOWNFOLDED MODELS IN HARTREE APPROXIMATION\n\n\n\nThe Coulomb interaction in models I and II renders the electronic Hamiltonian interacting and requires approximate treatments.\nHere, we solve the interacting Hamiltonian in Hartree approximation, which is the simplest mean-field approximation and as such requires a self-consistency loop.\n\nFor the Coulomb interaction, we assume here a density-density type interaction\n\n    H^1el = 1/2 N∑_q⃗k⃗k⃗' αβ\n        U^q⃗_αβ\n         c_k⃗ + q⃗α\n         c_k⃗' β\n         c_k⃗' + q⃗β\n         c_k⃗α\n\nwith U^q⃗_αβ being cRPA density-density matrix elements evaluated at momentum transfer q⃗.\n\nThe Hartree decoupling of Eq. (<ref>) reads\n\n    H^1el   = 1/N∑_k⃗k⃗' αβ\n        U^q⃗=⃗0⃗_αβ(\n            c_k⃗α c_k⃗α⟨ c_k⃗' β c_k⃗' β⟩.\n       .\n                -1/2⟨ c_k⃗α c_k⃗α⟩⟨ c_k⃗' β c_k⃗' β⟩).\n\nSince the DFT input parameters of models I and II already contain Coulomb contributions, we have to avoid double counting.\nThe hopping terms t^0_k⃗αβ stem from the Kohn-Sham eigenvalues of the undistorted structure, which contain (among others) a Hartree term.\nHere, we choose HDC to compensate for the Hartree term of the undistorted structure:\n\n    HDC   = - 1/N∑_k⃗k⃗' αβ\n        U^q⃗=⃗0⃗_αβ(\n            c_k⃗α c_k⃗α⟨ c_k⃗' β c_k⃗' β⟩_0.\n       .\n                -1/2⟨ c_k⃗α c_k⃗α⟩_0\n            ⟨ c_k⃗' β c_k⃗' β⟩_0),\n\nwhere ⟨…⟩_0 denotes expectation values obtained for the undistorted structure.\n\nWe introduce the Hartree potentials U_α and U^0_α for the distorted and undistorted structures, respectively,\n\n    U_α\n        = ∑_β\n        U^q⃗ = 0_αβ n_β  and  U^0_α\n        = ∑_β\n        U^q⃗ = 0_αβ n^0_β,\n\nwhere n^(0)_β=1/N∑_k⃗' β⟨ c_k⃗' β c_k⃗' β⟩_(0) denotes local orbital occupations.\nThen, the electronic mean-field Hamiltonian written in the Wannier orbital basis of the supercell reads\n\n    Hel+Hel-n\n    \n        = ∑_k⃗αβ( t^0_k⃗αβ + u⃗d⃗_k⃗αk⃗β\n        + (U_α\n        - U^0_α) δ_αβ)\n             c_k⃗α\n             c_k⃗β\n    \n        - 1/2∑_αβ\n        U^q⃗ = 0_αβ ( n_α n_β - n^0_α n^0_β).\n\n\nThis Hamiltonian is solved self-consistently.\nThe converged electronic dispersion ϵ_k⃗ n and occupations n_α are used to determine the free energy:\n\n\n    F el = 2/N_k k_BT ∑_n k⃗ln( f [ -(ϵ_k⃗ n - μ) /kT ] )\n        + μ N el\n    \n        - 1/2∑_αβ\n        U^q⃗ = 0_αβ ( n_α n_β - n^0_α n^0_β).\n\n\nThe Coulomb matrix U^q⃗_αβ contains one divergent eigenvalue for q⃗→ 0, which is associated with the homogeneous charging of the system.\nSince we are working at fixed system charge, we exclude the divergent contribution of U^q⃗_αβ.\nIn practice we perform the eigenvector decomposition of Eq. (15) from Ref. <cit.> and exclude the contribution from the leading eigenvector.\n\n\n\n§ PERTURBATION EXPANSION OF GRAND POTENTIAL AND FREE ENERGY\n\n\n\nChanges of the grand potential of non-interacting electrons due to atomic displacements can be straightforwardly evaluated using diagrammatic perturbation theory <cit.>:\n\n    Ω   =\n        Ω|_0\n        + ∑_i Ω^(1)_i |_0 u_i\n        + 1/2∑_i jΩ^(2)_i j|_0 u_i u_j\n        + …\n       ≡Ω|_0 +\n        [baseline=-0.6ex]\n             at (0.5, 0) +;\n             at (2.5, 0) + …,;\n            [el] (0, 0) arc(-90:270:0.3);\n            [el] (1, 0) to[out=-70, in=-110] (2, 0);\n            [el] (2, 0) to[out=+110, in=+70] (1, 0);\n             (0, 0) circle (3pt);\n             (1, 0) circle (3pt);\n             (2, 0) circle (3pt);\n\n\nWithout loss of generality, we consider q⃗ = 0 in Eq. (<ref>) and drop the corresponding subscript.\n\nIn first order, we then have\n\n    Ω⃗^(1)   = k T/N∑_k⃗ n νd⃗_k⃗ n n1/ω_ν - ϵ_k⃗ n + μ\n       = 1/N∑_k⃗ nd⃗_k⃗ n n\n        f(ϵ_k⃗ n - μ),\n\nwith the Matsubara frequency ω_ν = (2 ν + 1) π k T.\n\nIn second order, we have\n\n    Ω^(2)   = k T/N∑_k⃗ m n νd⃗_k⃗ m n^ T1/ω_ν - ϵ_k⃗ m + μ1/ω_ν - ϵ_k⃗ n + μd⃗_k⃗ n m^T\n        \n       = 1/N∑_k⃗ m nd⃗_k⃗ m n^ Tf(ϵ_k⃗ m - μ) - f(ϵ_k⃗ n - μ)/ϵ_k⃗ m - ϵ_k⃗ nd⃗_k⃗ n m^T.\n\nWe deliberately have omitted the superscript zero from ϵ_k⃗ n [cf. Eq. (<ref>)] as in our models with linear electron-phonon coupling these formulas also hold for u⃗≠ 0 as long as d⃗ is represented in the electronic eigenbasis.\n\nThe number of electrons N el is typically conserved in DFT and MD calculations, so we are instead interested in the canonical ensemble and the free energy\n\n    F(N el) = Ω(μ(N el)) + μ(N el) N el.\n\n\nIts first derivative with respect to displacements is\n\n    F_i^(1)\n        =  F/ u_i\n        = ∂Ω/∂ u_i\n        + [\n            ∂Ω/∂μ + N el]\n        μ/ u_i=Ω_i^(1),\n\nsince ∂Ω / ∂μ = -N el.\nIn other words, the expression for the forces [cf. Eq. (<ref>)] is the same in the canonical and the grand-canonical ensemble.\n\nFor the unscreening of the force constants (cf. Section <ref>), we also need access to the second derivative of the free energy at constant electron density,\n\n    F_i j^(2)\n        =  F_i^(1)/ u_j\n        = ∂Ω_i^(1)/∂ u_j\n        + ∂Ω_i^(1)/∂μμ/ u_j.\n\nExpectedly, the first term on the right is Ω^(2)_i j from Eq. (<ref>).\nHere, the second term does not vanish, at least not for monochromatic perturbations with q⃗ = 0 <cit.>.\nThe change of the chemical potential upon atomic displacements follows from the electron conservation,\n\n    0  !=  N el/u⃗\n        = 1/N/u⃗∑_k⃗ n\n        f(ϵ_k⃗ n - μ)\n        \n    \n        = -1/N∑_k⃗ n[\n            d⃗_k⃗ n n - μ/u⃗]\n        δ(ϵ_k⃗ n - μ),\n\nwith δ(ϵ) = - f(ϵ) / ϵ.\nWe have used the Hellmann-Feynman theorem,\n\n    ϵ_k⃗ n/u⃗\n        = /u⃗⟨k⃗ n| H^0 el + H^0el-n|k⃗ n⟩\n    \n        = ⟨k⃗ n|/u⃗ (H^0 el + H^0el-n) |k⃗ n⟩≡d⃗_k⃗ n n.\n\nNote that here the matrix element of the deformation-induced potential d⃗_k⃗ n n is represented in the basis of eigenstates |k⃗ n⟩ of the perturbed Hamiltonian.\nRearranging Eq. (<ref>) shows that the change of the chemical potential is nothing but the Fermi surface (FS) average of the intraband deformation-induced potential,\n\n    μ/u⃗   = ∑_k⃗ nd⃗_k⃗ n nδ(ϵ_k⃗ n - μ)\n        /∑_k⃗ nδ(ϵ_k⃗ n - μ)\n        ≡d⃗_k⃗ n nFS.\n\nFrom Eq. (<ref>), we can also readily evaluate\n\n    ∂Ω⃗^(1)/∂μ\n        = 1/N∑_k⃗ nd⃗_k⃗ n nδ(ϵ_k⃗ n - μ)\n        ≡ρ(μ) d⃗_k⃗ n nFS,\n\nwhere ρ is the electronic density of states per unit cell.\nCombining Eqs. (<ref>), (<ref>) and (<ref>) yields\n\n    Δ C_i jIII\n        = Ω^(2)_i j\n        + ρ(μ)\n        d_i k⃗ n nFSd_j k⃗ n nFS.\n\nThe first term are the force constants in the grand canonical ensemble, i.e., at constant chemical potential.\nThe second term is the correction for going from the grand canonical to the canonical ensemble.\n\n\n\n§ COMPUTATIONAL PARAMETERS DFT\n\n\n\nAll DFT and DFPT calculations are carried out using Quantum ESPRESSO <cit.>.\nThe modification that is required for cDFPT is described in detail in Ref. <cit.>.\nFor the transformation of the electronic energies and electron-phonon couplings to the Wannier basis, we use Wannier90 <cit.> and the EPW code <cit.>.\nThe cRPA Coulomb interaction was calculated using RESPACK <cit.>.\nIn the following, we will list the specific DFT and DFPT parameters for each material individually:\n\n\n\n\n  1H-TaS2\n    Hartwigsen-Goedecker-Hutter (HGH) pseudopotentials <cit.>;\n    18×18×1 k⃗ mesh and 6×6×1 q⃗ mesh for unit cell;\n    Fermi-Dirac smearing of 5 mRy (Gaussian smearing of 0.1 Ry for Fig. <ref>b, d, f);\n    energy convergence threshold of 10^-15 Ry (10^-8 Ry per unit cell for Fig. <ref>);\n    lattice constant of 3.39 Å.\n    The cRPA Coulomb interaction has been calculated on a 32×32×1 q⃗ mesh taking 80 electronic bands into account.\n\n  1H-NbS2\n    HGH pseudopotentials <cit.>;\n    18×18×1 k⃗ mesh and 6×6×1 q⃗ mesh for unit cell;\n    Fermi-Dirac smearing of 3 mRy;\n    lattice constant of 3.34 Å.\n\n  1H-WS2\n    HGH pseudopotentials <cit.>;\n    18×18×1 k⃗ mesh and 6×6×1 q⃗ mesh for unit cell;\n    Fermi-Dirac smearing of 5 mRy;\n    lattice constant of 3.23 Å.\n\n  1T-TiSe2\n    Ultrasoft pseudopotential <cit.> from the SSSP library <cit.>;\n    18×18×1 k⃗ mesh and 6×6×1 q⃗ mesh for unit cell;\n    Fermi-Dirac smearing of 5 mRy;\n    lattice constant of 3.54 Å.\n\n  Carbon chain\n    Optimized norm-conserving Vanderbilt pseudopotential (ONCVPSP) <cit.> from the PseudoDojo library <cit.>;\n    200×1×1 k⃗ mesh and 20×1×1 q⃗ mesh for unit cell;\n    Fermi-Dirac smearing of 5 mRy;\n    lattice constant of 2.59 Å.\n\nIn all cases, we have applied the Perdew-Burke-Ernzerhof (PBE) functional <cit.>, set the plane-wave cutoff to 100 Ry, and minimized forces and pressure in the periodic directions to below 1 µRy/Bohr and 0.1 kbar.\nWe have used a unit-cell dimension of 15 Å to separate images in the non-periodic directions.\n\n\n\n§ REPLICA EXCHANGE\n\n\n\nIn order to characterize the CDW phase-transition, we employed replica exchange molecular dynamics (REMD) and replica exchange path integral molecular dynamics <cit.> (PI-REMD), as implemented in the i-PI code.\nFor the 18 × 18 1H-TaS2 supercell, we ran NVT simulations of 26 replicas in parallel that differed in the ensemble temperature.\nWe covered a temperature range between 50 and 200 K.\nIn the PI-REMD simulations, each temperature replica was represented by ten imaginary-time replicas (commonly called “beads” in the ring-polymer representation).\nThis amount of beads proved to be converged within 1 meV/atom for the potential and quantum kinetic energy at the lowest temperature of 50 K.\nWe note that due to the high dimensionality of the system, enhanced by the use of many imaginary-time replicas, the PI-REMD simulations with 26 temperature replicas in this range was not efficient in terms of the frequency of replica swaps, while the REMD simulations were.\n\n\n\n"}