{"entry_id": "http://arxiv.org/abs/2303.07259v3", "published": "20230313163526", "title": "A novel approach of empirical likelihood with massive data", "authors": ["Yang Liu", "Xia Chen", "Wei-min Yang"], "primary_category": "stat.ME", "categories": ["stat.ME"], "text": "\n \n \n  \nplain\n0.5mm\n\n\n\n\n\n\n\n\n\n  \n\n\n\n \tsemicolon,aysep=,yysep=,,notesep=:\n\n\n\n\n\n\n\n\n\n\n\nmythm1.5ex plus 1ex minus .2ex1.5ex plus 1ex minus .2ex\n    0.5em\nmythm\n\nlemLemma A.\nthmTheorem\nremRemark\ncrlCorollary\nexExample\n\nthmsection\ncrlsection\n\nremsection\nexsection\n\n\n\nε\nω\nγ\n\n∂\n\nφ\n\n\n    ⟶ FH̋εdp→̊ T\n    \n    § \n    [hang]  0.0ex\n    \n     §.§ \n    [hang]  0.0ex*\n    \n    § \n    0pt10pt4pt\n    \n    \n      A novel approach of empirical likelihood with massive data 4mm\n    \n     Yang Liu, Xia Chen[Corresponding author. E-mail: xchen80@snnu.edu.cn], Wei-min Yang School of Mathematics and Statistics, Shaanxi Normal University, Xi'an 710119, China\n    \n    \n     4mm\n    \n    \n     Abstract  \n    Statistical analysis of large datasets is a challenge because of the limitation of computing devices' memory and excessive computation time.  Divide and Conquer (DC) algorithm is an effective solution path, but the DC algorithm still has limitations for statistical inference. Empirical likelihood is an important semiparametric and nonparametric statistical method for parameter estimation and statistical inference, and the estimating equation builds a bridge between empirical likelihood and traditional statistical methods, which makes empirical likelihood widely used in various traditional statistical models. In this paper, we propose a novel approach to address the challenges posed by empirical likelihood with massive data, which is called split sample mean empirical likelihood(SSMEL), our approach provides a unique perspective for sovling big data problem. We show that the SSMEL estimator has the same estimation efficiency as the empirical likelihood estimator with the full dataset, and maintains the important statistical property of Wilks' theorem, allowing our proposed approach to be used for statistical inference. The effectiveness of the proposed approach is illustrated using simulation studies and real data analysis.\n    \n    \n     Keywords  \n    Empirical likelihood; Massive data; Divide and Conquer; Parameter estimation; Statistical inference\n    \n    \n    \n    § INTRODUCTION\n    \n    \n    With the development of science and technologies, the growth in the size of datasets is accelerating, large datasets are not unusual. The presence of massive data has presented new challenges for classical statistical methods, which can offer excellent theoretical properties for such data, yet are often difficult to implement in practice due to computation time and memory constraints. Additionally, when data is stored in a distributed manner, it may be infeasible to perform statistical analysis on the full dataset due to communication costs and privacy concerns. Thus, there is a growing need for a new statistical method to handle the challenges posed by massive data. In recent years, Divide and Conquer(DC) has been widely used to address the problems caused by massive data. The DC algorithms can be broadly classified into two categories, one is the one-shot approach<cit.>.\n    Its basic idea is that one can randomly partition the full dataset into multiple subsets, perform the parallel computation of the relevant statistics on each, and eventually produce the estimator via a suitable aggregation function. <cit.> studied penalized regression models utilizing the one-shot approach; <cit.> developed the one-shot approach for estimation and hypothesis testing in high-dimensional sparse models; <cit.> discussed the statistical inference of symmetric statistics under the one-shot approach; <cit.> examined the properties of the one-shot estimators of empirical likelihood and exponentially tilted empirical likelihood; <cit.> proposed a novel statistical inference for the one-shot estimator by empirical likelihood.\n    \n    The one-shot approach has the advantage of easy implementation and low communication cost, however, it requires sufficiently large subsets to ensure the accuracy of the final estimator. In practice, it will limit to call of more computational resources to reduce the computation time. While the first-order error of the one-shot estimator is equivalent to that of the full dataset, the second-order error of the nonlinear statistic is not negligible<cit.>. To address this challenge, the iterative approach<cit.> has been proposed. It aims to generate a final estimator by the iterative comunication of the gradient information of subsets, this approach requires more communication cost compared to the one-shot approach. <cit.> achieved the one-step estimator through the Newton-Raphson algorithm to update the one-shot estimator. <cit.> proposed a general framework called Communication-efficient Surrogate Likelihood (CSL) that aggregates gradient information from subsets to construct a CSL function, which is then used to obtain the final estimator through multiple iterative and optimization procedures. The framework also establishes the theoretical properties of CSL for statistical inference. <cit.> incorporated a strictly convex quadratic term that can be adaptively adjusted at each iteration step. This addition helps the CSL converge faster, resulting in improved performance. The DC algorithms can effectively handle the challenges of parameter estimation under large datasets, but the statistical inference is still a complex task. General statistical inference methods construct test statistics based on the asymptotic distribution of the estimator, but the covariance matrix is difficult to estimate under the full dataset. For more details on the distributed statistics can refer to <cit.>.\n    \n    Empirical likelihood is a significant nonparametric and semiparametric statistical method, it inherits Wilks' theorem of parametric likelihood<cit.>. Therefore, it produces confidence regions with data-driven shapes and constructs test statistics without estimating the covariance matrix. <cit.> demonstrated that empirical likelihood resembles parametric likelihood with Bartlett correction. Due to these advantageous properties, and empirical likelihood can easily incorporate side information, so it has gained significant attention and has been extensively investigated and utilized, e.g. regression models<cit.>, estimating euqations<cit.>, partially linear models<cit.>, bayesian settings<cit.>, quantile regression models<cit.>, U-statistics<cit.>, time series models<cit.>, high-dimensional statistical inference<cit.>.\n    \n    \n    Empirical likelihood is computationally intensive when the size of the dataset is large, which can limit the application of empirical likelihood to the large dataset. Because empirical likelihood is well adapted to traditional statistical models, it is necessary to address the challenges of empirical likelihood with massive data. Recently, <cit.> and <cit.> proposed split sample empirical likelihood (SSEL) and distributed empirical likelihood (DEL), respectively, to solve this problem. <cit.> constructed the empirical likelihood function with respect to each subset and defined the SSEL estimator as the maximizer of the product of these empirical likelihood functions. <cit.> obtained estimators for each subset and then averaged these estimators across all subsets to generate the DEL estimator. Both methods utilize parallel computing to tackle the challenges of massive data on empirical likelihood. Modern parallel computing structures have the potential to significantly reduce computation time. However, for large values of K (n=O(√(K))), the accuracy of estimation, particularly for non-linear statistics, cannot be ensured. Consequently, there are stringent limitations on the value of K required to obtain reliable estimators, and each parallel pool remains computationally expensive. On the other hand, the DEL is failing to meet Wilks' theorem, which eliminates the benefits of empirical likelihood and necessitates the exploration of alternative statistical inference methods.\n    \n    To address these issues, we propose a novel approach, which called split sample mean empirical likelihood (SSMEL). Under mild regularity conditions, we show that the SSMEL estimator retains the same asymptotic efficiency as that of the full dataset. Additionally, the SSMEL preserves the important property of Wilks' theorem, making it suitable for statistical inference. Different from other methods, the SSMEL does not require parallel computing and can be implemented efficiently with limited computational resources, making it more widely practical applicable. For distributed dataset, we designed the corresponding distributed algorithm for the SSMEL based on the algorithm in <cit.> which is a variant of the iterative approach. Simulations and real data analysis further demonstrate the efficiency of our proposed method.\n    \n    The remainder of this paper is organized as follows. In Section 2, we briefly review empirical likelihood and present the methodology of SSMEL. Section 3 investigates the theoretical properties of SSMEL. Section 4 designs a new algorithm applicable to the SSMEL. Sections 5 and 6 examine the performance of the proposed approach on simulated and real data analysis. Section 7 concludes the paper and discusses future work.\n    \n    \n    \n    \n    § METHODOLOGY\n    \n    Suppose that 𝒳 = {x_1,⋯,x_n} are d-variate independent and identically distributed samples with common distribution function F. Let θ∈ℝ^p be a vector of the unknown parameter of interest, and θ_0 is the true value. For the sake of completeness, we first briefly review empirical likelihood.\n    \n    \n    \n     §.§ Empirical likelihood\n    \n    \n    Assume that true value θ_0 satisfies constraints in the form of the r≥ p unbias estimating equation, i.e.\n    \n        𝔼g(X,θ_0)=0,\n    \n    where g(X,θ_0)=(g_1(X,θ_0),⋯,g_r(X,θ_0)). Then, the empirical likelihood ratio function evaluated at θ be defined as\n    \n    \n    R(θ)=sup{∏_i=1^nnp_i:p_i≥0,∑_i=1^np_i=1,∑_i=1^np_ig(x_i,θ)=0}\n    By the Lagrange multiplier method, we have\n    \n        p_i=1/n·1/1+λ^Tg(x_i,θ) where λ(θ) solves 1/n∑_i=1^ng(x_i,θ)/1+λ^Tg(x_i,θ)=0.\n    \n    Thus, the empirical log-likelihood ratio defined as\n    \n    \n    l(θ)=∑_i=1^nlog[1+λ^Tg(x_i,θ)]\n    \n    The maximum empirical likelihhod estimate θ̂_EL is calculated by\n    θ̂_EL=argmin_θ∈Θmax_λ∈Λ̂_n(θ)∑_i=1^nlog[1+λ^Tg(x_i,θ)]\n    \n    where Λ̂_n(θ)={λ∈ℝ^r:λ^Tg(x_i,θ)∈𝒱,i=1,⋯,n} for θ∈Θ and 𝒱 is an open interval containing zero, and Θ is the convex hull of {g(x_i,θ),i=1⋯,n)}. Under mild regularity conditions, <cit.> showed  that as n→∞,\n    \n        √(n)(θ̂_EL-θ_0)d⟶N(0,Σ),\n    \n    where Σ=[𝔼(∂ g(X,θ_0)/∂θ^T)^T(𝔼g(X,θ_0)g^T(X,θ_0))^-1𝔼(∂ g(X,θ_0)/∂θ^T)]^-1. Moreover, if Var(g(X,θ_0)) is finite and the rank p>0, then Wilks theorem is holded, i.e.\n    \n        2l(θ_0)-2l(θ̂_EL)d⟶χ_p^2, as  n→∞.\n    \n    \n     §.§ Split sample mean empirical likelihood\n    \n    \n    Empirical likelihood cannot generally be written in a closed form, so a numerical optimization algorithm is required for the solution, resulting in computational obstacles from massive data and distributed datasets. To address these challenges, we introduce our proposed SSMEL. Assume the size of full dataset n is very large, and randomly partition the full dataset 𝒳={x_1,⋯,x_n} into K subsets of size m=n/K. We denote S_k={x_i^(k),i=1,⋯,m} as kth subset, which x_i^(k) means ith sample in kth subset. Obviously, ⋃_k=1^KS_k=𝒳 and S_k⋂ S_t=∅, for any k≠ t.\n    \n    For each subset S_k,k=1⋯,K, we consider the following steps:\n    \n      *  By inputting the samples x_i^(k) from subset S_k into the estimating equation, we can obtain the sequence of estimating equations g(x_i^(k),θ),i=1,⋯,m.\n    \n    \n      *  Taking the mean of estimating euqation sequence {g(x_1^(k),θ),⋯,g(x_m^(k),θ)}, i.e.\n    \n        g̅^(k)(θ)=1/m∑_i=1^mg(x^(k)_i,θ).\n     \n    \n    With the aforementioned steps, we can derive mean estimating equations g̅^(k)(θ),k=1,⋯,K from K subsets. It can be easily seen that the mean estimating equation is still the estimating equation, i.e.\n    \n        𝔼g̅(θ_0)=𝔼[1/m∑_i=1^mg(X_i,θ_0)]=1/m∑_i=1^m𝔼g(X_i,θ_0)=0,\n    \n    \n    Thus, we can construct the split sample mean empirical likelihood(SSMEL) ratio function using the mean estimating equations,\n    \n    R_S(θ)=sup{∏_k=1^KKp_k:p_k≥0,∑_k=1^Kp_k=1,∑_k=1^Kp_kg̅^(k)(θ)=0}\n    and the split sample mean empirical log-likelihood ratio function defined as\n    \n    l_S(θ)=∑_k=1^Klog(1+λ^Tg̅^(k)(θ))\n    \n    The core approach of SSMEL is to compress the sample information and convert the large dataset into a small dataset. Therefore, the full dataset empirical likelihood is a special case of SSMEL, when K=n.\n    \n    Similar to Equation.(<ref>), the maximum split sample mean empirical likelihood estimator is\n    θ̂_S=argmin_θ∈Θ̅max_λ∈Λ̂_K(θ)∑_k=1^Klog(1+λ^Tg̅^(k)(θ))\n    \n    where Λ̂_K(θ)={λ:λ^Tg̅^(k)(θ)∈𝒱,k=1,⋯,K} for θ∈Θ̅ and 𝒱 is an open interval containing zero, and Θ̅ is the convex hull of {g̅^(k)(θ),k=1,⋯,K}. To solve Equation. (<ref>), a prerequisite is that Θ̅ have the zero vector as an interior point. Lemma 11.1 in <cit.> states that if Var(g(X,θ)) is finite and the rank p>0, then the zero vector must be contained in Θ. Obviously, because of Var(g̅(θ))=m^-1Var(g(X,θ)), if Var(g(X,θ)) satisfies this condition, then Var(g̅(θ)) also satisfies it. Figure <ref> shows the parameter space for partly subsets and the parameter space for SSMEL under the same segmentation. It can be seen from Figure <ref>(a) that when the subset size m is small, the convex hull consisting of g(x_i^(k),θ),x_i^(k)∈ S_k does not contain zero vectors with a higher probability, thus leading to poor estimation of SSEL and DEL when the value of K is taken to be large. In contrast, Figure <ref>(b) shows that the SSMEL has a much smaller parameter space and always contains zero vectors.\n    \n    \n    § ASYPTOTIC PROPERTIES\n    \n    \n    In this section, we establish the asymptotic properties of SSMEL. For the empirical likelihood, the critical aspect is to control the tail probabilities behavior of the estimating equation, i.e., to ensure ‖ n^-1∑_i=1^ng(x_i,θ)‖=O_p(n^-1/2). It is worth noting that K^-1∑_k=1^Kg̅^(k)(θ)=K^-1∑_k=1^Km^-1∑_i=1^mg(x_i^(k),θ)=n^-1∑_i=1^ng(x_i,θ). Therefore, the SSMEL and empirical likelihood have the same assumptions. The following assumptions are made.\n    \n      A.1θ_0∈ int(Θ̅) is unique solution to 𝔼g(X,θ)=0, where Θ̅ is a compact set and int(Θ̅) denotes the interior of Θ̅.\n    \n      A.2g(x_i,θ) is continuous with respect to θ at each θ∈Θ̅ with probability 1 and is continuously differentiable with respect to θ in a neighbourhood of 𝒩 of θ_0.\n    \n      A.3𝔼[sup_θ∈Θ‖ g(X,θ)‖^α]<∞ for some α>2, where ‖·‖ is the Euclidean norm for vector and the Frobenius norm for matrix.\n    \n      A.4Ω:=𝔼[g(X,θ_0)g(X,θ_0)^T] is nonsingular.\n    \n      A.5𝔼[sup_θ∈𝒩‖∂ g(X,θ)/∂θ^T‖]<∞, denotes 𝔼(∂ g(X,θ)/∂θ^T)=G, rank(G)=p.\n    \n    A.1-A.5 guarantees the existence and asymptotic normality of θ̂_S, further ensure Wilks' theorem holds. As discussed in the previous section, the assumption in A.1 of Θ̅ can be relaxed to Θ. These assumptions are similar to those found in <cit.>, which are the fundamental assumptions of empirical likelihood, and no additional assumptions are introduced in this paper.\n    \n    \n    Under assumptions A.1-A.5, we have\n    \n        √(n)(θ̂_S-θ_0)d⟶N(0,Σ), as n→∞\n    \n    where Σ=(G^TΩ G)^-1.\n    \n    Under the assumption of Theorem <ref>, we have\n    \n        𝔼[‖θ̂_S-θ_0‖^2]≤tr(Σ)/n+o(n^-1)\n    \n    where tr(·) represents the trace of the matrix.\n    \n    \n    Theorem <ref> shows that the asymptotic distribution of θ̂_S is the same as for θ̂_EL, and if the estimating equation g is the score function of the true parameter likelihood function, then the asymptotic distribution of θ̂_S is same as maximum likelihood estimator. Corollary <ref> shows that the mean squared error(MSE) upper bound for the SSMEL estimator, which is the same as the full dataset empirical likelihood, therefore they have the same estimation efficiency. Finally, we give the asymptotic behavior of SSMEL test statistic. Theorem <ref> summarizes the general conclusions, while Corollary <ref> provides the asymptotic distribution in the presence of nuisance parameters.\n    \n    \n    The split sample mean empirical likelihood ratio test statistic for H_0:θ=θ_0 is\n    \n        𝒲(θ_0)=2[l_S(θ_0)-l_S(θ̂_S)]\n    \n    Under assumptions of Theorem <ref>, 𝒲(θ_0)d⟶χ^2_p as  n→∞, when H_0 is ture.\n    \n    Let θ^T=(ϕ,γ)^T, and ϕ is q×1 vector, γ is (p-q)×1 nuisance parameters. The profile split sample mean empirical likelihood ratio test statistic for H_0:ϕ=ϕ_0 is\n    \n        𝒲(ϕ_0)=2[l_S(ϕ_0,γ̂(ϕ_0))-l_S(ϕ̂_S,γ̂_S)]\n    \n    where γ̂(ϕ_0) minimizes l_S(ϕ_0,γ) with respect to γ. Under H_0, 𝒲(ϕ_0)d⟶χ^2_q as n→∞.\n    \n    The theoretical results of SSMEL hold provided K→∞ as n→∞ , this means that m is a fixed positive integer.  Related to the choice of K, there are some practical considerations. As we formally use K samples, the computation time grows as K increases, therefore it is necessary to ensure that K is not excessively large. On the other hand, empirical likelihood can only be applied when K is larger than p (the parameter dimension). In the general setting, from our own experiences, we recommend 100 to be a suitable value for K, this is further demonstrated in the subsequent simulation and real data analysis.\n    \n    \n    § ALGORITHM FOR DISTRIBUTED DATASET\n    \n    The algorithms for solving empirical likelihood can be applied to the SSMEL, making the implementation of SSMEL estimation feasible on a single computing device. To extend SSMEL to the distributed dataset, we generalize the two-layer coordinate descent algorithm in <cit.>. The algorithm is briefly reviewed in the context of SSMEL.\n    \n    First, we define\n    \n    f(λ;θ) = 1/K∑_k=1^Klog_*{1+λ^Tg̅^(k)(θ)}\n    f(θ) = max_λ∈Λ̂_K(θ)f(λ;θ) \n    \n    where log_*(x) is twice differentiable pseudo-logarithm function with bounded support adopted from <cit.>:\n    \n        log_*(x) = {[                     log(x)                     if x≥ε; log(ε)-1.5+2x/ϵ-x^2/(2ε^2)                     if x≤ε ].\n    \n    where ε is chosen as 1/K in this paper. The SSMEL estimaotr θ̂_S is calculated by minimizing the following objective function:\n    θ̂_S = argmin_θ∈Θ̅f(θ)\n    \n    \n    We apply the two-layer coordinate decent algorithm in <cit.> to solve the problem. The inner layer of the algorithm is to find λ by maximizing f(θ) for a fixed θ. The outer layer of the algorithm is to search for the optimal θ̂_S, and both layers can be solved using coordinate descent.\n    \n    The inner-layer involves maximizing f(λ,θ) as defined in Equation (<ref>) for a fixed θ. Assuming the initial value of λ is λ^(0), we fix the other coordinates and calculate the value of λ_j, where j=1,2,⋯,r in the (M+1)th iteration, the \n    jth component of λ is given by\n    \n    λ̂_j^(M+1)=λ̂_j^(M)-∑_k=1^Klog_*^'(t_k^(M))·g̅_j^(k)(θ)/∑_k=1^Klog_*^”(t_k^(M))·{g̅_j^(k)(θ)}^2\n    where t_k^(M)=1+g̅^(k)(θ)^Tλ̂^(M), λ̂^(M)=(λ̂_1^(M),⋯,λ̂_r^(M))^T. The procedure cycles through all the r components of λ and is repeated until convergence. It is important to ensure that the objective function is optimized at each step. If not, continue halving the step size until the objective function is driven in the right direction. The procedure in Equation (<ref>) can be viewed as an optimization of a univariate sequence.\n    \n    The outer layer can also be solved using a coordinate descent algorithm. At a given λ, the algorithm updates θ_t, t=1,⋯,p by minimizing f(θ) defined in Equation (<ref>) with respect to θ_t with other θ_l is fixed. Assuming the initial value of θ is θ̂^(0), the (M+1)th Newton update for θ_t is given by\n    \n    θ̂_t^(M+1)=θ̂_t^(M)-∑_k=1^Klog_*^'(s_k^(M))[λ^T(∂g̅^(k)(θ̂^(M))/∂θ_t)]/∑_k=1^K{log_*^”(s_k^(M))[λ^T(∂g̅^(k)(θ̂^(M))/∂θ_t)]^2+log_*^'(s_k^(M))[λ^T(∂^2g̅^(k)(θ̂^(M))/∂θ_t^2)]}\n    where s_k^(M)=1+λ^Tg̅^(k)(θ̂^(M)), θ̂^(M)=(θ̂^(M)_1,⋯,θ̂^(M)_p)^T. The SSMEL can be implemented following the pseudo-code in <cit.> on a single computing device. For the distributed dataset, we give the pseudo-code in Algorithm <ref>.\n    \n    \n    It can be seen that the SSMEL only requires optimizing a single objective function, while other distributed methods require processing multiple optimization procedures in parallel. Thus, our approach is suitable for general computing devices.\n    \n    Algorithm <ref> is a simple implementation of SSMEL applied to distributed data that differs from the traditional iterative approach. Traditional iterative approaches generally require multiple optimization procedures, while this algorithm accomplishes a single optimization procedure through interaction between multiple computing devices. It is worth noting that the efficiency of SSMEL is not limited by the number of devices. The data stored on each machine can still be randomly partitioned and compressed and then transferred between machines.\n    \n    \n    § SIMULATIONS\n    \n    In this section, we demonstrate the behavior of the proposed approach through some simulations. The first example evaluates the behavior of SSMEL in reducing computation time for massive data and compares the estimation accuracy of SSMEL, DEL, and SSEL under different settings. The second example shows the estimation accuracy of SSMEL, DEL, and SSEL for increasing the dimensionality of the growth parameters under three different partitioning conditions. The third example provides the results of the hypothesis testing of SSMEL, DEL, and SSEL under different partition numbers K. The centralized empirical likelihood(CEL) in these examples represents the empirical likelihood under the full dataset. All simulations were implemented in R.\n    \n    Example 1 We generate data X_1,⋯,X_n from a normal distribution N(μ,σ^2), where the unknown parameters μ and σ are randomly generated from the uniform distributions Unif(-2,2) and Unif(0.5,2), respectively. The random variable X of the normal distribution N(μ,σ^2) satisfies the following moment conditions:\n     \n        𝔼[g(X,θ_0)]=𝔼[           μ - X;     σ^2-(X-μ)^2; X^3-μ(μ^2+3σ^2) ]\n        =0.\n    Case 1 To assess the efficacy of the proposed approach in terms of reducing computation time for massive data, we choose the full dataset size at n=200000 and vary K=[10,50,100,500,1000, 5000], with K=200000 being equivalent to the CEL. This procedure with 500 replications, the mean square error (MSE) for μ and σ, and total computation time (TCT) were recorded in Table <ref>.\n    \n    \n    \n    \n    Table <ref> shows that, with the proper K, our proposed approach can effectively reduce the computation time and achieve the estimation accuracy under the full dataset. This confirms the conclusion drawn in Corollary <ref>. A smaller value of K is not recommended, as this would over-compress the sample information, causing poor estimation accuracy and non-optimal computational efficiency.\n    \n    Case 2 In this case, the performance of CEL, SSMEL, DEL, and SSEL is compared by evaluating their accuracy in four different settings with 1000 repetitions. To further explore the sensitivity of each method with respect to K and m, we did not consider setting n extremely large, and the subsequent simulation settings were similarly based on this consideration. The logarithmic mean squared error (log-MSE) is shown in Figure <ref>.\n    \n    \n      (a) Fixing the subset size m, the split size K increases with the size of the full dataset n. We consider m=[50,100] and vary n=[1000,2000,3000,4000,5000].\n    \n      (b) Fixing the split size K, the subset size m increases with the size of full dataset n. We consider K=[10,50] and vary n=[1000,2000,3000,4000,5000].\n    \n      (c) Fixing the size of full dataset at n=12000 and vary K=[10,20,40,80,100,120].\n    \n      (d)  Fixing the size of full dataset at n=12000 and vary m=[100,200,400,800,1000,1200].\n    \n    \n    From the first and second rows of Figure <ref>, we can see that for fixed K and m, the log-MSE of SSMEL on μ and σ are closer to the behavior of CEL when the total sample increases. The SSEL and DEL perform poorly for the nonlinear statistic σ. With a fixed n, it can be seen from the third row of Figure <ref> that when K increases to 100, the estimation of SSMEL achieves the estimation efficiency under the full dataset. When m is large i.e. K is small, the log-MSE of SSMEL tends to increase due to excessive compression of information. Overall, the SSMEL performs more robustly compared to other methods.\n    \n    Case 3 In this case, we compare the performance of each method in terms of the reduction of computation time. Due to limited knowledge regarding parallel optimization of the likelihood components of SSEL, direct optimization of SSEL functions did not result in a significant reduction in computation time. We have restricted our comparison to the DEL and SSMEL. We consider n=12000 and 500 repetitions, and the results are presented in Table <ref>.\n    \n    \n    \n    From Table <ref>, we clearly see that the SSMEL reduces the computation time more efficiently than the DEL. It is worth highlighting that the SSMEL exhibits superior computational efficiency without relying on parallel computing devices. In contrast, the DEL may leverage parallel computing to decompose computation time, but its estimation accuracy may deteriorate as K increases.\n    \n    Example 2 In this example, we consider estimating the coefficients of a linear regression model with a varying number of parameters,\n    \n    Y_i =Z_i^Tβ+ε_i,   i=1,⋯,n\n    \n    where β=(β_0,β_1,⋯,β_p)^T, ε_i and Z_i=(1,X_i1,⋯,X_ip)^T are independent, εi.i.d∼N(0,1), and X_i=(1,X_i1,⋯,X_ip)^Ti.i.d∼N(0,Σ_p) with\n    \n        Σ_p=\n        [ 1 ρ ⋯ ρ; ρ 1 ⋯ ρ; ⋮ ⋮ ⋱ ⋮; ρ ρ ⋯ 1;   ]_p× p\n    \n    we refer to the setting in <cit.> that p=[4,8,18], β_0=(1,5,4,3,2,1_p-4^T)^T with 1_p-4^T=(1,⋯,1)^T for p>4, and β_0=(1,5,4,3,2) for p=4. ρ=[0,0.2,0.5,0.8] in Σ_p. We fix the full dataset size at n=20000 and K=[10,50,100]. We compare the performance of SSMEL, DEL, and SSEL estimators in terms of empirical MSE, i.e. the mean of ‖β̂ - β_0 ‖^2. Table <ref> summarizes these results base on 500 replications.\n    \n    \n    \n    \n    From Table <ref>, we can see that the MSE corresponding to SSMEL is very close to that of the CEL in most cases. The SSMEL exhibits poor performance when K is close to p due to the fact that the approach formally uses only K samples. When K is significantly greater than p, the SSMEL is computationally simple and the estimation is robust compared to other methods in various cases.\n    \n    \n    Due to the fact that a plane can only be formed by three points in two dimensions, the parameter space of SSMEL is the convex hull of {g̅^(k)(θ), k=1,⋯, K}. Therefore, when K is close to p, the convex hull formed by K points is unable to effectively encompass p-dimensional vectors, resulting in poor estimation performance.\n    Example 3 In this example, we examine the performance of the hypothesis test for the SSMEL. We generate data (X,Y) from the bivariate normal distribution N(μ_1,σ_1^2,μ_2,σ_2^2,ρ). We use a dataset size of 10000 and 500 replications with parameter values μ_1=μ_2=0, σ_1=σ_2=1, and ρ=0.5. The random vector (X,Y) of the N(μ_1,σ_1^2,μ_2,σ_2^2,ρ) satisfies the following moment conditions:\n     \n        𝔼[g(X,Y;θ_0)]=𝔼[                μ_1 - X;                μ_2 - Y;        σ_1^2-(X-μ_1)^2;        σ_2^2-(Y-μ_2)^2; (X-μ_1)(Y-μ_2)-ρσ_1σ_2 ]\n    \n    The hypothesis testing of DEL is challenging due to the failure to meet Wilks' theorem. To address this problem, <cit.> recently presented a statistical inference method for the one-shot estimator of average aggregation. The primary objective is to test the mean of the estimators of each subset using empirical likelihood. We applied the method to the DEL for hypothesis testing and compared it with the SSMEL, SSEL, and CEL. We consider the following null hypothesis:\n    \n      1.H_0:θ = (μ_1,μ_2,σ_1,σ_2,ρ) = (0,0,1,1,0.5)\n      2.H_0:ψ = (μ_1,σ_1) = (0,1)\n      3.H_0:ρ=0.5\n    \n    We choose K=[5,10,20,40,80,100], the false rejection rate at nominal levels α=0.05 for each method are recorded in Table <ref> and  the empirical frequencies of ρ∉{ρ:𝒲(ρ)=2(l_S(ρ)-l_S(ρ̂))≤χ^2_1,0.95} for a sequence of ρ values in Table <ref>. From Table <ref>, we can see that the false rejection rate when using the SSMEL is also affected by the choice of K. The false rejection rate of SSMEL closes the nominal level and the results of the full dataset as K increases, and the change becomes subtle when K grows to a certain level (K=100). In contrast to the SSMEL, the SSEL is negatively impacted by larger values of K, as the false rejection rate deviates further away from the nominal level. The DEL is a more complex method compared to others, as it involves a trade-off between the one-shot estimation accuracy and the error of the asymptotic χ^2 distribution of the empirical log-likelihood function. From Table <ref> we can see that the test power of SSMEL has a consistent performance with the empirical likelihood under the full datasets. Therefore, the SSMEL is an effective alternative to the CEL to address the challenges of statistical inference with massive data.\n    \n    \n    \n    § REAL DATA ANALYSIS\n    \n    \n     §.§ Protein dataset\n    \n    Physicochemical properties of protein tertiary structure dataset[<https://archive.ics.uci.edu/ml/datasets/Physicochemical+Properties+of+Protein+Tertiary+Structure>] are taken from CASP 5-9. There are 45730 decoys and sizes varying from 0 to 21 armstrong, which aims to predict the size of the residue(RSMD). The explanatory variables are as follows: X_1, total surface area; X_2, non polar exposed area; X_3, fractional area of exposed non polar residue; X_4, fractional area of exposed non polar part of residue; X_5, molecular mass weighted exposed area; X_6, average deviation from standard exposed area of residue; X_7, euclidian distance; X_8, secondary structure penalty; X_9, spacial distribution constraints (N,K Value). We randomly partition the dataset into a training set and a test set according to 7:3, where the training set has 32,010 samples and the test set has 13,720 samples. In this example, we use the training set to fit a linear regression model and the test set to evaluate the prediction performance of SSMEL under the K=[50,100,500]. We recorded the mean squared prediction error (MSPE) and computation time(CT) of CEL, DEL, and SSMEL under the different number of splits in Table <ref>. From Table <ref> we can see that the MSPE of SSMEL is very close to the CEL when K is close to 100, and the computation time is significantly reduced. \n    \n    \n    \n     §.§ the United Stated airline dataset\n    \n    In this section, we use the SSMEL to analyze the United States airline dataset, which is publicly available on the American Statistical Association (ASA) website[<http://stat-computing.org/dataexpo/2009>]. This airline dataset is very large, with nearly 120 million records. Each record contains information on every commercial flight detail in the United States from October 1987 to April 2008. The dataset is partitioned into 22 files based on year, each file containing 13 continuous variables and 16 categorical variables. However, due to the massive size of the dataset, a typical personal computer may not have sufficient memory to load the full dataset for statistical analysis. In this paper, we concentrate on the analysis of the 13 continuous variables, and only 5 have missing rates less 10%: ActualElapsedTime(actual elapsed time), CRSElapsedTime(scheduled elapsed time), Distance, DepDelay(departure) and ArrDelay(arrival delay). Therefore, we study these 5 variables. For more detailed information on the variables, refer to the ASA official website.\n    \n    Due to these variables being so heavy-tailed that the existence of finite moments becomes questionable. Similar to <cit.>, we perform a signed-log-transformation: log|x|· sign(x) on these variables. For each transformed variable, we examine the mean, standard deviation, skewness, and kurtosis, denoted as μ, σ, ξ, and κ. These statistics satisfy the following moment conditions:\n     \n        𝔼[g(X;θ_0)]=𝔼[           μ - X;     σ^2-(X-μ)^2; ξ - (X-μ)^3/σ^3;   κ-(X-μ)^4/σ^4 ]\n        =0\n    \n    To handle the large dataset used in this study, we implemented a strategy of loading one year's worth of data at a time while retaining only the relevant variables in memory and discarding the irrelevant ones. Due to the size of the dataset, using the empirical likelihood method was not feasible due to its impractical computation time. As a solution, we partitioned the data into 5 subsets for each year, resulting in a total of 110 subsets, and calculated the DEL for comparison with the SSMEL. The estimators and computation time for each variable are presented in Table <ref>. From Table <ref>, we can see that the estimators of the two methods are consistent for most variables, while the SSMEL has a better computation time than the DEL.\n    \n    \n    \n    § DISCUSSION\n    \n    In this paper, we propose a novel and straightforward methodology for calculating the empirical likelihood with massive data which we refer to as split sample mean empirical likelihood (SSMEL). The approach employs split and compression strategies to address the obstacles in empirical likelihood with massive data. We show that the SSMEL preserves the statistical properties of the original empirical likelihood, and thus can be used for parameter estimation and statistical inference. Our approach's efficacy is confirmed through extensive simulation and real data analysis. It is worth noting that our method does not involve parallel computation, making it applicable to a broad range of computing devices and more feasible for real-world applications. Furthermore, in order to facilitate the processing of distributed dataset, we have developed a corresponding distributed algorithm for the SSMEL.\n    \n    To conclude this paper, we discuss several interesting directions for future research. First, this paper has only studied the case of fixed dimensionality, high-dimensional massive data are prevalent in real-world applications, so extending the approach to the case where both n and p are large is an important direction. Second, it would be of interest to develop a similar idea to more general M estimators. Finally, although we have designed an algorithm for distributed dataset for the SSMEL, the algorithm is a simple extension in <cit.>, which has a high communication cost, so it would be an interesting direction to design a more efficient distributed algorithm for this approach.\n    \n    \n    cas-model2-names\n    \n    § APPENDIX: PROOFS\n    \n    The following Lemmas are similar from <cit.>.\n    \n    \n    \n    Under the assumption A.1- A.3, for any ξ with 1/α<ξ<1/2 and Λ_n={λ:‖λ‖≤ n^-ξ}, sup_θ∈Θ̅,λ∈Λ_n,1≤ k≤ K|λ^Tg̅^(k)(θ)|P⟶0, with probability tending to 1, Λ_n⊂Λ̂_K(θ) for all θ∈Θ̅.\n    \n    \n    By Assumptions A.3 and Markov inequality, we have\n    \n        sup_θ∈Θ̅‖ g(x_i,θ)‖= O_p(n^1/α)\n    \n    And on the other hand,\n    \n        max_1≤ k≤ Ksup_θ∈Θ̅‖g̅^(k)(θ)‖   =max_1≤ k≤ Ksup_θ∈Θ̅‖1/m∑_i=1^mg(x_i^(k),θ)‖\n           ≤max_1≤ k≤ Ksup_θ∈Θ̅1/m∑_i=1^m‖ g(x_i^(k),θ)‖\n           ≤max_1≤ k≤ Ksup_θ∈Θ̅1/m∑_i=1^mmax_1≤ i≤ m‖ g(x_i^(k),θ)‖\n           =max_1≤ i≤ nsup_θ∈Θ̅‖ g(x_i,θ)‖\n    \n    So it is obvious that\n    \n        max_1≤ k≤ Ksup_θ∈Θ̅‖g̅^(k)(θ)‖=O_p(n^1/α)\n    \n    Then by Cauchy-Schwarz inequality,\n    \n        sup_θ∈Θ̅,λ∈Λ_n,1≤ k≤ K|λ^Tg̅^(k)(θ)|≤ n^-ξmax_1≤ k≤ Ksup_θ∈Θ̅‖g̅^(k)(θ)‖=O_p(n^-ξ+1/α)p⟶0\n    \n    Under Assumpitons A.1-A.4, if θ̂∈Θ̅, θ̂p⟶θ_0, and 1/K∑_k=1^Kg̅^(k)(θ̂)=O_p(n^-1/2), then with probability tending to 1, λ̂=argmax_λ∈Λ̂_n(θ̂)l_S(λ,θ̂) exists, and max_λ∈Λ̂_n(θ̂)l_S(λ,θ̂)≤ O_p(n^-1).\n    \n    \n    Then the existence of λ̂∈Λ_n follows the statement in <cit.> by noting from Lemma A.<ref>, max_1≤ k≤ K|λ^Tg̅^(k)(θ)|p⟶0 for λ∈Λ_n.  Then by a Tyloy expansion around λ=0, where λ̇ satisfy ‖λ̇‖≤‖λ̂‖,\n    \n        K· l_S(θ̂,λ̂)=∑_k=1^Kλ̂^Tg̅^(k)(θ̂)-1/2λ̂^T[∑_k=1^K{1+λ̇^Tg̅^(k)(θ̂)}^-2g̅^(k)(θ̂)g̅^(k)(θ̂)^T]λ̂\n    \n    By Lemma A.<ref>, (1+λ̇g̅^(k)(θ̂))^-2>1/2 for all k with probability tending to 1. In addition by uniform weak law of large numbers \n    ‖1/K∑_k=1^Kg̅^(k)(θ̂)g̅^(k)(θ̂)^T-1/mΩ‖p⟶0, as n→∞.\n    Because λ̂ is the maximizer, we have with probability tending to 1,\n    \n    0=l_S(θ̂,0)≤ l_S(θ̂,λ̂)≤‖λ̂‖‖1/K∑_k=1^Kg̅^(k)(θ̂)‖-c/4‖λ̂‖^2\n    \n    This concludes ‖λ̂‖=O_p(n^-1/2) because ‖1/K∑_k=1^Kg̅^(k)(θ̂) ‖ = O_p(n^-1/2). Since ξ≤1/2, we have λ̂∈Λ̂_K(θ̂) with probability tending to 1. And this is easy to get max_λ∈Λ̂_K(θ̂)l_S(λ,θ̂)≤ O_p(n^-1) from (<ref>).\n    \n    Under Assumpitons A.1-A.4, we have ‖1/K∑_k=1^Kg̅^(k)(θ̂)‖=O_p(n^-1/2).\n    \n    It is worth noting that\n    \n        1/K∑_k=1^Kg̅^(k)(θ̂)=1/K∑_k=1^K1/m∑_i=1^mg(x_i^(k),θ̂)=1/n∑_i=1^ng(x_i,θ̂)\n    \n    Let 1/K∑_k=1^Kg̅^(k)(θ̂)=1/n∑_i=1^ng(x_i,θ̂)=g̅(θ̂), and for ξ in Lemma A.<ref>, λ̃=n^-ξg̅(θ̂)/‖g̅(θ̂)‖. By Lemma A.<ref>, max_1≤ k≤ K|λ̃^Tg̅^(k)(θ̂)|p⟶0 and λ̃∈Λ̂_K(θ̂) with probability tending to 1. Also, by Cauchy-Schwarz inequality and uniform weak law of largr numbers, ∑_kg̅^(k)(θ̂)g̅^(k)(θ̂)^T/K≤(∑_k‖g̅^(k)(θ̂)‖^2/K)Ip⟶CI, so that the largest eigenvalue of ∑_kg̅^(k)(θ̂)g̅^(k)(θ̂)^T/K is bounded above with probability tending to 1. By Tylor expansion, where λ̇ satisfy ‖λ̇‖≤‖λ̃‖, it holds with probability tending to 1,\n    \n        l_S(θ̂,λ̃)\n           =1/K∑_k=1^Kλ̃^Tg̅^(k)(θ̂)-1/2λ̃^T[1/K∑_i=1^K{1+λ̇^Tg̅^(k)(θ̂)}^-2g̅^(k)(θ̂)g̅^(k)(θ̂)^T]λ̃\n           ≥ n^-ξ‖g̅(θ̂)‖-Cn^-2ξ{1+o_p(1)}\n    \n    By the Lindeberg-Lévy central limit theorem the hypotheses of Lemma A.<ref> are satisfied by θ̂=θ_0. By θ̂ and λ̂ being a saddle point, this equation and Lemma A.<ref> give\n    \n    n^-ξ‖g̅(θ̂)‖-Cn^-2ξ≤ l_S(θ̂,λ̃)≤max_λ∈Λ̂_K(θ̂)l_S(θ̂,λ) ≤ O_p(n^-1)\n    \n    Also, by ξ<1/2, ξ-1<-1/2<-ξ. Solving Equation(<ref>) for ‖g̅(θ̂) ‖ then gives\n    \n        ‖g̅(θ̂) ‖≤ O_p(n^ξ-1)+Cn^-ξ = O_p(n^-ξ)\n    \n    We consider any ε_n→0. Let λ^*=ε_ng̅(θ̂), then λ^*=o_p(n^-ξ), so that λ^*∈Λ_n with probability tending to 1. Using the same arguments above, we can obtain\n    \n        ϵ_n‖g̅(θ̂)‖^2-Cϵ_n^2≤ O_p(n^-1)\n    \n    Then ϵ_n‖g̅(θ̂)‖^2=O_p(n^-1). Notice that we can select arbitrary slow ε_n→0, following a standard result form probability theroy, that if ε_nY_n=O_p(n^-1), for all ε_n→0, then Y_n=O_p(n^-1). So, we have ‖g̅(θ̂)‖=O_p(n^-1/2).\n    \n    Under Assumpitons A.1-A.4, we have θ̂_Sp⟶θ_0, 1/K∑_k=1^Kg̅^(k)(θ̂_S)=O_p(n^-1/2), λ̂_S=argmax_λ∈Λ̂_K(θ̂_S)l_S(θ̂_S,λ) exists with probability tending to 1, and λ̂_S=O_p(n^-1/2).\n    \n    Let g(θ)=𝔼[g(x,θ)], by Lemma A.<ref>, g̅(θ̂_S)p⟶0, and by uniform weak law of large numbers, sup_θ∈Θ̅‖g̅(θ)-g(θ)‖p⟶0 and g(θ) is continuous. By triangle inequlity,\n    \n        ‖g̅(θ̂_S)‖-‖ g(θ̂_S)‖≤‖g̅(θ̂_S)-g(θ̂_S)‖≤sup_θ∈Θ̅‖g̅(θ)-g(θ)‖\n    \n    We have g(θ̂_S)p⟶0. Since g(θ)=0 has a unique zero at θ_0, ‖ g(θ)‖ must be bounded away from zero outside any neighborhood of θ_0. Therefore, θ̂_S must be inside any neighborhood of θ_0 with probability tending to 1, i.e. θ̂_Sp⟶θ_0, giving the first conclusion. The second conclusion follows by Lemma A.<ref>. And by the first two conclusions, the hypotheses of Lemma A.<ref> are satisfied, so that the last conclusion follows from Lemma A.<ref>.\n    \n    Under Assumpitons A.1-A.4, θ̂_S and λ̂_S satisfy\n    \n        Q_1K(θ̂_S,λ̂_S)=0,   Q_2K(θ̂_S,λ̂_S)=0\n    \n    where\n    \n        Q_1K(θ,λ)   =1/K∑_k=1^K1/1+λ^Tg̅^(k)(θ)g̅^(k)(θ)\n        \n        \t\tQ_2K(θ,λ)   =1/K∑_k=1^K1/1+λ^Tg̅^(k)(θ)(∂g̅^(k)(θ)/∂θ)^Tλ\n    \n    The conclusion can be obtained from Lemma A.<ref> and Lemma A.<ref>, more details refer the proof of Lemma 1 of <cit.> or the proof of Theorem 3.2 of <cit.>Proof of Theorem <ref>\n    By LemmaA.<ref>, we have\n    \n        Q_1K(θ_S,λ_S)   =1/K∑_k=1^K1/1+λ_S^Tg̅^(k)(θ_S)g̅^(k)(θ_S)=0,\n        \n        \t\tQ_2K(θ_S,λ_S)   =1/K∑_k=1^K1/1+λ^T_Sg̅^(k)(θ_S)(∂g̅^(k)(θ_S)/∂θ)^Tλ_S=0\n    \n    As n→∞,\n    \n    \n        ∂ Q_1K(θ_0,0)/∂θ   =1/K∑_k=1^K∂g̅^(k)(θ_0)/∂θ^T\n        =1/K∑_k=1^K1/m∑_i=1^m∂ g(x_i^(k),θ_0)/∂θ^T\n           =1/n∑_i=1^n∂ g(x_i,θ_0)/∂θ^Tp⟶𝔼(∂ g/∂θ^T)=G\n    \n        ∂ Q_1K(θ_0,0)/∂λ^T   =-1/K∑_k=1^Kg̅^(k)(θ_0)g̅^(k)(θ_0)^T\n           =-1/K∑_k=1^K1/m^2(∑_i=1^mg(x_i^(k),θ_0)∑_i=1^mg(x_i^(k),θ_0)^T)\n           =-1/m1/n∑_i=1^ng(x_i,θ_0)g(x_i,θ_0)^T\n           -1/n∑_k=1^K(2/m∑_i≠ s^mg(x_i^(k),θ_0)g(x_s^(k),θ_0)^T)\n           p⟶-1/m𝔼(gg^T)+o_p(n^-1/2)=-1/mΩ+o_p(n^-1/2)\n    \n        ∂ Q_2K(θ_0,0)/∂λ^T   =1/K∑_k=1^K(∂g̅^(k)(θ_0)/∂θ^T)^T=1/K∑_k=1^K1/m∑_i=1^m∂ g(x_i^(k),θ_0)/∂θ^T^T\n           =1/n∑_i=1^n∂ g(x_i,θ_0)^T/∂θ^Tp⟶𝔼(∂ g/∂θ^T)^T=G^T\n    \n    By Tylor expansion around (θ_0,0), we can show\n    \n    \n        0   =Q_1K(θ̂_S,λ̂_S)=Q_1K(θ_0,0)+∂ Q_1K(θ_0,0)/∂θ(θ̂_S-θ_0)+∂ Q_1K(θ_0,0)/∂λ^Tλ̂_S+o_p(δ_K)\n        \n        0   =Q_2K(θ̂_S,λ̂_S)=Q_2K(θ_0,0)+∂ Q_2K(θ_0,0)/∂θ(θ̂_S-θ_0)+∂ Q_2K(θ_0,0)/∂λ^Tλ̂_S+o_p(δ_K)\n    \n    where both Q_2K(θ_0,0) and ∂ Q_2K(θ_0,0)/∂θ are 0, δ_K=‖θ̂_S-θ_0‖+‖λ̂_S‖, so\n    \n    \n        0   =∂ Q_2K(θ_0,0)/∂λ^T×(-∂ Q_1K(θ_0,0)/∂λ^T)^-1×[Q_1K(θ_0,0)+∂ Q_1K(θ_0,0)/∂θ(θ̂_S-θ_0)+o_p(δ_K)]+o_p(δ_K)\n           =G^T(1/mΩ)^-1Q_1K(θ_0,0)+G^T(1/mΩ)^-1G(θ̂_S-θ_0)+o_p(mn^-1/2)\n    \n        θ̂_S-θ_0   =-Σ G^TΩ^-1 Q_1K(θ_0,0)+o_p(n^-1/2)\n    \n     Because -√(n)Ω^-1/2Q_1K(θ_0,0) converges to standard multivariate normal distribution, i.e. -√(n)Ω^-1/2Q_1K(θ_0,0)=-√(n)Ω^-1/2g̅(θ_0)d⟶N(0,I), therefore as n→∞, we have\n    \n        √(n)(θ̂_S-θ_0)d⟶N(0,Σ)\n    Proof of Corollary <ref>\n    See literature Lemma 1 of <cit.>.\n    Proof of Theorem <ref>\n    The split sample mean empirical likelihood ratio test statistic is\n    \n        𝒲(θ_0)=2{∑_k=1^Klog[1+λ_0^Tg̅^(k)(θ_0)]-∑_k=1^Klog[1+λ̂_S^Tg̅^(k)(θ̂_S)]}\n    \n    By LemmaA.<ref>, we have Q_1K(θ̂_S,λ̂_S)=0, and by Tylor expansion\n    \n        λ̂_S   =[1/K∑_k=1^Kg̅^(k)(θ̂_S)g̅^(k)(θ̂_S)^T]^-1(∑_k=1^Kg̅^(k)(θ̂_S))+o_p(1) \n           =(1/mΩ)^-1Q_1K(θ̂_S,0)+o_p(1)\n    \n    Also by the Taylor expansion and  Euqation (<ref>),\n    \n    \n        Q_1K(θ̂_S,0)   =Q_1K(θ_0,0)+∂ Q_1K(θ_0,0)/∂θ^T(θ̂_S-θ_0)+o_p(1)\n           =Q_1K(θ_0,0)+G(θ̂_S-θ_0)+o_p(1)\n           =Q_1K(θ_0,0)-GΣ G^TΩ^-1Q_1K(θ_0,0)+o_p(1)\n    \n    \n    Further Taylor expansion for l_S(θ̂_S,λ̂_S), and by Equation (<ref>) and (<ref>) we have\n    \n    \n        2l_S(θ̂_S,λ̂_S)   =2∑_k=1^Klog[1+λ̂_S^Tg̅^(k)(θ̂_S)]\n           =2∑_k=1^Kλ̂^T_Sg̅^(k)(θ̂_S)-2∑_k=1^K[λ̂^T_Sg̅^(k)(θ̅_S)]^2+o_p(1)\n           =KQ_1K^T(θ̂_S,0)[1/K∑_k=1^Kg̅^(k)(θ_S)g̅^(k)(θ_S)^T]^-1Q_1K(θ̂_S,0)+o_p(1)\n           =KQ_1K^T(θ̂_S,0)(1/mΩ)^-1Q_1K(θ̂_S,0)+o_p(1)\n           =nQ^T_1K(θ_0,0)Ω^-1(I-GΣ G^TΩ^-1)Q_1K(θ_0,0)+o_p(1)\n    \n    Under H_0 is ture, similarly\n    \n        λ_0=Ω^-1Q_1K(θ_0,0)+o_p(1),   and   l_S(θ_0,λ_0)=nQ^T_1K(θ_0,0)Ω^-1Q_1K(θ_0,0)+o_p(1)\n    \n    Thus\n    \n        𝒲(θ_0)   =nQ^T_1K(θ_0,0)[Ω^-1-Ω^-1(I-GΣ G^TΩ^-1)]Q^T_1K(θ_0,0)+o_p(1)\n           =nQ^T_1K(θ_0,0)Ω^-1GΣ G^TΩ^-1Q_1K(θ_0,0)+o_p(1)\n           =[Ω^-1/2√(n)Q_1K(θ_0,0)]^T[Ω^-1/2GΣ G^TΩ^-1/2][Ω^-1/2√(n)Q_1K(θ_0,0)]+o_p(1)\n    \n    Note that Ω^-1/2GΣ G^TΩ^-1/2 converges to a standard multivariate normal distribution and that Ω^-1/2GΣ G^TΩ^-1/2 is symmetric idempotent, with trace equal to p. Hence the SSMEL ratio test statistic 𝒲(θ_0) converges to χ_p^2.\n    Proof of Corollary <ref>\n    See literature Corollary 5 of <cit.>.\n"}