{"entry_id": "http://arxiv.org/abs/2303.07256v1", "published": "20230313162852", "title": "An Ontology-Based Capability Description of MTP Modules", "authors": ["Christian Barth", "Tobias Klausmann", "Andreas Bayha", "Matthias Freund", "Kathrin Gerber"], "primary_category": "cs.SE", "categories": ["cs.SE"], "text": "\n\n\n\n\n\n\nAn Ontology-Based Capability Description of MTP Modules\n    Christian \nBarth1, Tobias Klausmann2, Andreas Bayha3, Matthias Freund1, Kathrin Gerber4 \n1Festo SE & Co. KG,\nEsslingen, Germany,\n{christian.barth, matthias.freund}@festo.com\n2Lenze SE,\nAerzen, Germany,\ntobias.klausmann@lenze.com\n3fortiss GmbH,\nMunich, Germany,\nbayha@fortiss.org\n4Festo Didactic SE,\nDenkendorf, Germany,\nkathrin.gerber@festo.com\n\n    March 30, 2023\n=============================================================================================================================================================================================================================================================================================================================================================\n\n\n\n\nThe MTP is an emerging standard for the software integration of process modules into a control system. The core concept of MTP is to separate process plants into autonomous modules called PEA which offer easy to use high level services. Applying the MTP concept leads to a modular production which can easily be adapted by adding, subtracting, or exchanging individual units. In order to leverage this flexibility, it is important to know the capabilities each PEA offers and expose them in a machine-readable way via its digital twin. As one realization of this requirement, this paper describes how a semantic annotation of MTP services using an ontology can be realised in conjunction with the AAS technology.   \n\n\n\nMTP, Capabilities, Skills, Modular Production, AAS, Industry 4.0, Digital Twin\n\n\n\n\n§ INTRODUCTION\n\n\nOne of the key aspects of modern automation is the decentralization of automation logic with a service-based architecture. Individual components or modules consisting of multiple components offer easy to use and easy to integrate functionalities. \nThe big advantage of this architecture is the possibility to adapt easily to changing requirements in the production process. The engineering effort to technically integrate the control logic of modules and components is very small due to standardized interfaces like MTP <cit.> or PackML <cit.>. Less optimized aspects of engineering are planning and purchasing. There have been first activities to systematically describe the capabilities of production modules <cit.>. In our paper, we build upon this, aligning with concepts of specifying and classifying the capabilities semantically as proposed in <cit.>. The goal is to create a formalism with which a flexible adaptation of production processes at minimal effort for most involved engineering domains is possible. \nWith this approach the planning for example could be improved in the following way:\nDuring the conception phase of a plant, an abstract process is defined. This is used to derive a set of capability requirements needed to execute the planned actions. Based on the capability descriptions of modules proposed in this paper, it is then possible to compile lists of suitable candidates automatically, reducing significantly the effort to select appropriate modules. \n\nThe remainder of the paper is structured as follows:\nSection <ref> gives an overview of the most relevant technologies for the paper topic. \nWe start with a brief description of the MTP including its purpose and current state. This is followed by a summary of the AAS, while mentioning how AAS can complement the MTP technology. The third and most comprehensive subsection is about Capabilities & Skills. Besides a general description of the concept, we explain the use of ontologies to describe capabilities and their relations. Furthermore we introduce the capability submodel for AAS.\nIn Section <ref>, we introduce our proposal for a capability ontology for PEA together with implications for the capability submodel, allowing for (semi-) automatic selection of modules. \nIn Section <ref>, we describe and discuss the implementation of the approach with the example of a painting module, including a critical reflection of the limitations of the approach.\nThe last section gives a summary of the paper and an outlook of possible future extensions.\n\n\n\n§ STATE OF THE ART\n\n\n\n\n §.§ MTP\n\nModular production is an approach to tackle the growing demand for shorter product lifespans, smaller lot sizes, and increased flexibility. To be able to implement this approach in the context of the process industry, several working groups of NAMUR (German user association of automation technology in process industries) and ZVEI (German association of automation technology vendors) are currently developing the MTP <cit.>. MTP thereby unifies the (automation) interface of a process module to enable its integration into any plant without the need for complex integration processes. This shall enable faster engineering & reconfiguration times for process plants as they can rely on a set of pre-engineered process modules.\n\nMTP files are based on AutomationML <cit.> and contain relevant information about a module type: A description of the provided communication and control interfaces of the components <cit.> (e.g. on an OPC UA server), an abstract representation of an HMI <cit.>, and a description of services (e.g. dosing or stirring) offered by the module <cit.>. The general structure of these services is standardized among others by means of a common state machine that each service must implement. However, MTP does not specify a common set of standard service functionalities but leaves the service design and naming to the module vendors. This makes finding the optimal module and service for a certain process step a complex task for the plant engineer.\n\nImportant relationships between the domains of process engineering and (MTP based) automation of a process plant are discussed in <cit.>: Each MTP service realizes one or multiple process functions[Translated from German: \"Prozesstechnische Funktion\"] that can be separated into main functions and utility functions. While <cit.> gives examples for such functions (e.g. dosing, tempering, or pressure adjustment), no complete list is given. Each of these functions can also be characterized by different attributes that again are only listed exemplary (e.g. maximum throughput for dosing). The guideline also discusses the description of services offered by a module and/or of service requirements for a modular plant as well as a procedure for the manual or semi-automatic selection of process modules' services based on these process functions. However, <cit.> does not state how services can be described or annotated in a machine-readable way, which is necessary for the (semi-)automatic selection of modules' services. \n\n\n\n §.§ AAS\n\n\nTo exchange information for components and modules, a digital twin <cit.> is a useful  container of the necessary information. As one implementation of a digital twin, the AAS meta model <cit.> can be used. The meta model consists of several sub-elements. A selection is presented here to reflect the basic structure of an AAS:\n\n    \n  * The AAS entry element serves as a container with references to the SM of the AAS as well as an asset information sub element.\n    \n  * The asset information element contains one global unique asset Id and may contain several specific asset Ids which are only unique in a local specific scope of a plant or product line etc. Furthermore, the asset kind can be distinguished between type and instance assets, reflecting e.g. a product line or a single particular product.\n    \n  * The SMs contain a varying number of SME.\n    \n  * The SMEs express the information of an AAS, e.g. a textual string or a number. The SMEs can be nested in SMC.\n\nAn overview of the AAS metamodel structure is presented in Figure <ref>.\nAll AAS elements can be semantically annotated by using their attribute \"semanticId\". The AAS submodels are additionally identified by a globally unique Id and thus can be referenced in arbitrary information models. The SMEs can be referenced using the SM Id and a SME idShort path list inside the corresponding SM. \n\n\n\n\nIn the scope of the BaSys 4.2 project[https://www.basys40.de/], a proposal has been made to represent modules specified by the MTP standard within Asset Administration Shells (AAS) <cit.>. The concept is currently being specified as an AAS submodel in the Industrial Digital Twin Association (IDTA)[https://industrialdigitaltwin.org/]. The IDTA is the host organization for AAS submodels as industry standards. \nEven though MTP explicitly focuses on the engineering phase of module types (i.e., aspects regarding the distribution of MTP files or the operation of a module are not discussed), there are two types of AAS models specified: an AAS for a type asset in which the MTP description file is attached or linked, and an AAS of an instance asset providing PEA-specific information which is relevant for actual operation of the module. These are for example the OPC UA endpoints and an identifier for the actual position and role of the module. The main benefit of having the MTP aspects represented in an AAS is to allow for relations and links between entities described in the MTP manifest and information modeled in other AAS submodels. These could e.g. be documentation or bill of material.\n\n\n\n\n §.§ Capabilities & Skills\n\n\nTo achieve the previously mentioned flexibility improvements of automation, a systematically modelled description of the various parts of a production system is required.\nThe PPR model <cit.> describes the aspects of production as a relationship between the products (e.g. work piece), the production process (e.g. recipes) and production resources (e.g. automation equipment). The capabilities and skills influence all three aspects and act as a connecting concept. In this paper we use the terms for capability and skill as defined in <cit.>: \"Skills represent the parameterizable and executable functionality\nof hardware or software components, and capabilities provide a meta level description of their effects.\" Thereby, \"meta level\" refers to product, process and resource independence. \n\n\n\nIn this paper, we distinguish between abstract capabilities and resource specific capabilities, refining the original capability term: An abstract capability provides a meta level description of an effect along with meta level properties for a detailed description, which can be defined in capability ontologies (see section <ref>). A resource specific capability <cit.> is based on the abstract capability and is only valid in the context of a resource. With the specified context, the meta level elements can be instantiated as model elements, for example by using the AAS meta model elements, see Section <ref>. The model elements can now be filled with information reflecting the context of the resource and the effect it can have in a production context.\n\n\n\nCapabilities have a describing nature and can not cause the desired effect in the real world. To achieve this, a skill is used, which is the executable counterpart of a capability. There are several options available to implement a skill as described in <cit.>. \n\nA skill is based on the information provided by a resource specific capability, potentially extending the level of detail of the model with e.g. environmental conditions or implementation specifics. With the resource specific capabilities and the skills available, a production process, which brings certain requirements to manufacture a product, can use the capabilities and the skills as follows: Based on the requirements, the resources can be queried in a two step procedure. First, a shallow match can be executed using the requirements and the resource specific capabilities, named capability matching. Following a successful capability matching step, a more detailed skill matching that takes the additional skill description into account can be conducted to assure that all requirements for the execution of process are met, see <cit.>. The two checks are described in more detail in <cit.>.\n\n\n\n\n\n\n\n  §.§.§ Capability Ontologies\n\n\n\nAn ontology is a formal representation of data and relations. It uses logically specified edges to model knowledge in a way that implicit relationships can be inferred by logic interpreters or reasoners. In this way, modelled information can be interpreted automatically and different sources of information can be combined effectively. The ontology is a semantic technology which offers high flexibility in modeling concepts. This leads to the problem of finding a suitable modeling structure. In <cit.>, a well-established approach has been chosen, which consists in dividing the modeled concepts in terms of general understanding, specific taxonomies, and actual data into so-called upper ontologies, domain ontologies, and application ontologies, respectively. Since the OWL[https://www.w3.org/OWL/] standard was chosen here, its import declaration can be used to represent dependencies between these ontologies. This C4I[downloadable at: https://www.w3id.org/basyx/c4i] ontology is presented in <cit.>.\n\n\n\n\n\n\n  §.§.§ AAS Capability Submodel\n\n\nWhile ontologies are an adequate concept to model the abstract capabilities themselves, in order to identify capabilities of a given resource, these ontological descriptions need to be linked with the assets providing the actual skills and implementing these capabilities. \nAs described in Section <ref>, when using the AAS for the asset's description, AAS SM are used to model the various aspects of production resources. \nThe capability submodel proposed in <cit.> is dedicated for describing the capabilities provided by an asset.\n \n\n\nFigure <ref> gives an overview about these notions and their relations with each other: \nontologies model the abstract capabilities themselves, while the AAS of the resources contain a capability submodel that describes the provided capabilities of this specific resource or resource type. \nWithin the capability SM, the dedicated capability model element of the AAS meta model can be used to model the resource specific capabilities.\nHereby, the semanticIDs of these capability elements reference the abstract capabilities in the ontology and associate them with the resource specific capabilities of the asset.\nBesides this reference to the abstract capabilities, the capability SM also contains the reference to the executable implementation of the capabilities, i.e. to the skills. \nIn accordance with Fig. <ref> this reference is named realizedBy.\n\nA similar reference as between the capabilities and the skills can be seen between the capabilities' attributes and the skill's parameters:\nwhile abstract capabilities in ontologies describe which attributes are relevant for an abstract capability, the resource specific capabilities describe the actual values of the resource's capabilities. \nFinally, the skill which realizes the resource specific capability could determine this value for every skill execution via a parameter that is taken into account for the skills execution.\n\n\n\nAn example for these notions could be the abstract capability dosing that can be further described with an attribute amount in an ontology. \nA concrete resource which implements dosing could then offer a resource specific capability dosing with a semantic ID to this ontology and an attribute amount with a value range of 0.2ml to 80.0ml.\nFinally, the skill which implements dosing can have a parameter amount that can be set to the value 65ml to make the skill dose this amount of liquid in it's next execution.\n\nWith these three concepts of abstract capabilities, resource specific capabilities, skills and the references between them, one can seamlessly find related information:\nfor every skill it is possible to see which capabilities it realizes; for every abstract capability it becomes possible to find resources that provide this capability by the skills in their implementation.\n\n\n\n§ APPROACH\n\n\n\nAs described in Section <ref>, a skill represents the parameterizable and executable functionality of hardware or software. Regarding the context of MTP, this is implemented by the concept of MTP services (cf.  Section <ref>): While the implementation of a service may be hidden by the module vendor, services can be directly invoked on a module via a set of variables provided on a public OPC UA server. Furthermore, services can also be parametererized – the set of parameters for each service is thereby defined in the MTP file.\n\nBased on this analogy and the integration of MTP into the AAS described in Section <ref>, the MTP concept can be combined with the concept of capabilities described in Section <ref>. The motivation of separating the capability information into a representation within AAS on the one side and the ontology on the other side is the following: The ontology can be used as an industry wide single source of truth, providing generally valid relations between process functions, basic process operations, educts and products. By limiting the capability modelling in the ontology to these building blocks, one avoids high complexity and modifications making it easy to integrate it e.g. into an engineering tool. With the help of reasoners translations between the the different elements of the above-mentioned ontology content is possible. The AAS representation on the other hand is meant to hold implementation specific information, which can vary significantly from one application to another. By describing the combination of process functions used to implement the specific PEA service functionalities and associating them to the respective ontology elements all relevant information for selecting modules according to different requirement specification is accessible. The downside of the approach is that the tooling needs to support both AAS and ontology technologies. Since the AAS ecosystem offers solutions for various engineering use cases, the additional effort of implementing AAS support can be used in multiple applications.    \n\nThe approach presented above can be used to enrich the MTP ecosystem with the currently missing aspects of automatically finding/selecting PEA/services (cf. Section <ref>) that can be realized based on the capability approach. \nHence, this section first presents an extension of the C4I ontology (cf. Section <ref>) that covers specific aspects of the process industries. After that, resulting implications on the capability submodel (cf. Section <ref>) are discussed. \n\n\n\n §.§ Ontology for MTP Modules\n\n\n\n\n\n\n\nAs already discussed in Section <ref>, a meta model for a capability ontology was developed in <cit.>. For factory automation the authors propose a handling domain ontology on the basis of the VDI guideline 2860. \n\nHowever, for process automation no such domain ontologies exist so far. As was also described in <cit.>, it is reasonable to take existing state of the art into account. For this reason, we searched for an existing taxonomy for process automation tasks and found a suitable candidate in the TGL 25000 standard <cit.>. This standard offers a categorization of so called basic process operations[English translation from the German term Verfahrenstechnische Grundoperationen]. It also categorizes them based on three states of matter: solid, liquid and gas. Additionally it defines educt and product per operation following these three types. We created an process industries specific domain ontology based on the informations listed in the TGL standard <cit.>. To project the educts and products in the ontology, we introduced the object properties usesEduct and producesProduct.\n\nThe example of distilling as depicted in Figure <ref> demonstrates how these concepts were realized in the ontology: The basic process operations of TGL 25000 <cit.> were modeled as classes under a class Basic Process Operation under the main class Capability as proposed in <cit.>. Additionally, we modelled the hierarchical categorization as a class hierarchy, as it can be seen in the example of distilling in Figure <ref>: Distilling is a subclass of separating. In addition to the hierarchical categorization we modelled a rule-based sub classification, further specifying the underlying principles of the capability as can be seen in the following: Distilling\ncan also be described in terms of products it can produce or educts it uses. For both, in this example there are two possibilities as described in TGL 25000 <cit.>. Distilling can either produce a non-defined amount (\"some\") of liquid products and at least one solid product or it can produce only a non-defined amount of liquid products. For this it uses either some liquid educts or at least one solid educt.\n\n\n\nWhen designing a chemical process, the basic process operations define the modifications of the material and are thus key elements for the process technician. However, the technical realizations of these basic process operations are of importance as well as they heavily influence the application area and performance of a solution. Hence, describing the capabilities should always relate to both the basic process operation(s) a PEA can provide as well as the technical realization that is used to realize these operations. As already introduced in Section <ref>, the technical realization can be described based on process functions. To reflect this in the ontology, we introduced the concept of process functions as specialized category of capability. Figure <ref> shows the resulting main structure of the ontology and the defined process functions. As there is no standard listing all or at least a decent amount of process functions that can be used in the process industry (cf. Section <ref>), the process functions that have been added to the ontology can only be seen as exemplary until a standardization is done in this regard. \n\nFinally, the object property canBeRealisedBy was added to the ontology to describe possible realizations (i.e. process functions) for a basic process operation. Figure <ref> shows this for the example of the basic process operation distilling that can be realized by a combination of the three process functions dosing, storing and tempering.  \n\n\n\n\n §.§ Implications for the Capability Submodel\n\n\nAs presented in the last section, basic operation capabilities are defined in an process industries specific ontology. Taking the capability SM shown in Section <ref> as a basis, additional implications coming from the MTP structure have to be addressed: An MTP module consists of several components. Hence, the module may have to form a complex capability that reflects its function as a composition of the built-in components' capabilities.\n\nAs an example, a painting module may consist of a tank, a pump, a valve, and a spray nozzle. While these components on their own have the capabilities store, pressure adjust, dose, and spray, they together form the complex capability paint which is also implemented by a specific skill. While ontologies are introduced in Section <ref> as a base for the definition of resource-neutral capabilities, a paint capability could also be realized by different resources and their related capabilities. For example, painting could also be realized by lowering the product into an immersion bath.\n\nTo facilitate the manual or automatic selection of modules' services, both the complex capabilities and the specific underlying  capabilities shall be exposed in the capability SM of the AAS. Furthermore, the composition relations between the capabilities are modeled as well.\nThis approach can be applied for complex capabilities in general. For example the capability pick&place used in factory automation is composed of move and grasp, where grasp may be a composition of hold and release.\n\n\n\n\n\n§ CASE STUDY PAINTING MODULE\n\n\n\n\n §.§ BaSys Demonstrator\n\n\n\n\n\nThe mostly virtual BaSys demonstrator[https://github.com/eclipse-basyx/basyx-demonstrators] highlights concepts developed in the BaSys 4.0 and BaSys 4.2 projects. A downloadable version can be used to evaluate the different aspects of an AAS-centric production including the BaSyx middleware[https://www.eclipse.org/basyx/]. \n\n\n\nAs part of the demonstrator, a fictional process of a tin assembly and painting is implemented. It is visualized using software from unity technologies[https://unity.com]. Fig. <ref> shows the layout of the virtual demonstrator. All resources that provide the automation functionalities used in the demonstrator have AAS representations with various SM describing technical data, capabilities, documentation, and control component interfaces (the latter being a BaSyx specific concept of wrapping skills of components and modules and offering unified execution interfaces and state information). The control component features adapters to translate commands and states to MTP or PackML and allows thus simultaneous orchestration of traditional integration methods from process industries and factory automation. The orchestration itself is implemented using Business Process Model and Notation (BPMN) scripts for the process descriptions. These workflows are then evaluated and executed by the open source engine Camunda[https://camunda.com], starting and stopping the skills of the various components and controlling the respective states. \n\n\n\n\n\n §.§ Painting-Module\n\nOne of the stations of the BaSys demonstrator is the painting module, a virtual PEA automated with the MTP standard. It features two reservoirs of paint, one with blue and one with yellow ink, both equipped with pumps and process valves. It offers three skills as MTP services: the paint service can color tins situated inside the module either in blue or in yellow by spraying. Additionally it offers a refill service for the reservoirs, and a self-cleaning service using water from a third tank. The user interface of the module is shown in Fig. <ref>.\n\n\n\n\n\n\n §.§ Capability SM realization\n\n\nTo satisfy the reference route from ontologies to skill via the capability SM as shown in Fig. <ref>, we realized a capability SM for the painting module based on the equally named painting module example given in section <ref>. The realization is shown in Fig. <ref>.\n\n\n\nAs already demonstrated in the example, the capability paint is a composition of the capabilities spray, dosing, store and pressure adjust. As per the structure introduced in Section <ref>, every capability has its own SMC with the contained capability SM meta model element and its underlying structure. With this, every capability can reference an abstract capability defined within an ontology. Furthermore, by expressing the whole structure, every capability can be expressed as a composition of other capabilities and allow for a realization reference to a matching skill.\n\n\n\n\n §.§ Limitations & Discussion\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn order to capitalize on a semantic capability description of production modules, it is key to have a common understanding of how to describe the capabilities. Our approach to use the established TGL 25000 standard for basic process operations and relate it to process functions is a good starting point. However, it needs to be completed and standardized to leverage its full potential in the engineering and operations phases. Especially the process functions are lacking an accepted and complete taxonomy as of now.\nFor common applications, a universal ontology is generally possible, while it presumably remains necessary for vendors of specialized equipment to build upon this, and to extend the existing ontology with particular capabilities and their relations. It remains to be investigated further if all required extensions can be constructed from the elementary process functions of the universal ontology. \n\nThe capability description is not a static document. While the original capability submodel of a PEA is supposed to be provided by the module vendor, it is possible that a PEA is used in a different  function compared to what is has been designed for. In this case, the capability description might also be extended by the system integrator or plant owner. \n\nA limitation of the approach is the fact that validating the capabilities for a given requirement is not enough to ensure that the given module is capable of carrying out the actual task. Resources might have multiple constraints as in under which conditions capabilities can be offered up to which extend. In order to fully specify the scope of provided capabilities, as also briefly discussed in Section <ref>, a large number of attributes might be necessary leading to very complex descriptions which are difficult to standardize.  This could already be the case for simple modules: a tempering unit, for example, might have numerous attributes like heating power, cooling power, temperature range, thermal stability, reaction time,  backup power and many more. For the purpose of automatic selection of modules, it is important to compare these attributes among different PEA. This can be achieved with a standardized sets of attributes. The AAS provides a suitable framework to implement this using e.g. the technical data sheet submodel. We call a validation of capabilities including all their attributes a feasibility check. It gives more confidence in a suitable selection of modules, however, even with a feasibility check further validation might be needed. This could be done for example with virtual commissioning using simulation models of the given resources. \n\n\n\n\n§ SUMMARY AND OUTLOOK\n\nIn this paper, we have presented an approach to semantically describe the services offered by an MTP module. Therefore, an existing capability ontology has been extended by concepts that are specific to modules in the process industry. Additionally, the analogy of MTP services and skills has been highlighted. This analogy was then used to realize the semantic annotation of MTP services based on an existing capability submodel for the AAS.\n\nThe proposed approach allows treating MTP services like any other form of skills. This has the benefit that enhanced tooling – e.g. for automatically selecting modules' services based on capability requirements – can be implemented in a generic way that is agnostic of any MTP or process industry specifics. This is particularly interesting for hybrid industries, which combine process automation and factory automation technologies, but it contributes also to a more homogeneous automation landscape in general.  \n\nIf the selection of modules can be fully automated,\nsuch tooling can be used for advanced Plug & Produce scenarios where modules' services are selected at runtime of a plant without extended engineering or planning phases. This provides the possibility to optimize the usage of the available resources such as PEA within a plant or even globally.   \n\nThe presented extensions of the capability submodel for the AAS that allow to describe the composition of capabilities can also be reused for applications within other domains like the factory automation and is thus another step towards unification between process and factory automation. Another interesting use case is the modelling of capability requirements, i.e. the capabilities a PEA needs from external devices in order to be complete for a given application. A use case for this would be direct module-to-module communication where either modules share equipment or together fulfill a common task where a redundant communication path is needed.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ ACKNOWLEDGMENT\n\nThe authors were partially supported by German Federal Ministry of Education and Research in the scope of the project BaSys 4.2 (01IS16022).\n\n\n\nIEEEtran\n\n\n"}