{"entry_id": "http://arxiv.org/abs/2303.07253v1", "published": "20230313162715", "title": "Effects of the transversely nonuniform plasma density in a blowout regime of a plasma wakefield accelerator", "authors": ["S. S. Baturin"], "primary_category": "physics.acc-ph", "categories": ["physics.acc-ph", "physics.plasm-ph"], "text": "\n\n\n\n\ns.s.baturin@gmail.com\nSchool of Physics and Engineering,\nITMO University, St. Petersburg, Russia 197101\n\n\n\nWe present an analytical study on the effects of the transverse plasma gradient in the blowout regime of a plasma wakefield accelerator (PWA). The analysis departs from a simple ballistic model of plasma electrons that allows us to derive a complete analytic solution for the pseudopotential and, consequently, for the wakefield. We demonstrate that the transverse plasma gradient modifies the bubble shape and affects the wakefield. Namely, the dipole plasma gradient results in a dipole component of the wakefield. Analysis suggests that, despite the asymmetry, the instability due to the fixed transverse plasma gradient is unlikely, as the total wakefield has a single stable point inside the bubble. The only effect that occurs is the shift of the electromagnetic center. We point out that random fluctuation of the transverse plasma gradient could become an issue.     \n\n\nEffects of the transversely nonuniform plasma density in a blowout regime of a plasma wakefield accelerator\n    S. S. Baturin\n    March 30, 2023\n===========================================================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\nBeam breakup (BBU) and emittance degradation are one of the main challenges on the way to the high luminosity collider based on a wakefield accelerator technology. <cit.>. Among others, <cit.> plasma-based wakefield accelerators (PWA) are considered the most promising candidate for the particle accelerators of the future  <cit.> as it possesses intrinsic focusing mechanism provided by the ions and extreme accelerating gradients at the same time <cit.>. In particular, in a so-called bubble regime, when plasma electrons are expelled, due to the high intensity of either laser or electron driver longitudinal (accelerating) electric field could be ∼ 50 GV/m <cit.>. Accelerating gradient is tightly connected with the transverse wakefield by the means of the Panofsky-Wenzel theorem <cit.>. When the longitudinal wake is axisymmetric, the transverse wake is zero, but even a tiny asymmetry is enough to seed the instability, that is caused by the transverse wake. The latter is connected with the fact that projected transverse beam emittance grows exponentially due to the BBU <cit.>. Moreover, even a short noise (a small random force or random asymmetry in the beam distribution) triggers the BBU.               \n\nDespite such a strong limitation, it tums out that BBU could still be controlled. Many mechanisms and approaches, including ion motion <cit.>, BNS damping <cit.>, and other methods of instability suppression have been investigated extensively. It was demonstrated that BBU is not just suppressed but eliminated in a certain parameter range.   \n\nIn the present study, we investigate how the local transverse asymmetry of the plasma gradient affects the wake and analyze these results from a beam dynamics perspective. The analysis is based on the ballistic model of the plasma electrons introduced in Ref.<cit.>. To an extent, present calculations echo the analysis of the Ref.<cit.>, where a flat bubble formation was investigated. In contrast to the Ref.<cit.>, where it was demonstrated that the wakefield is insensitive to the transverse plasma gradient, we show that in a commonly considered round bubble, transverse plasma gradient results in a transverse wake. Within the considered approximation we analyze plasma flow, derive an analytic expression for the pseudopotential, and provide a discussion of the possible consequences.\n\nThe paper is organized as follows. In Sec.<ref>, for the sake of convenience, we reproduce basic formulas and equations provided in Refs.<cit.> that we will use throughout the paper. In Sec.<ref> we derive the expression for the electromagnetic shock wave produced by the driver, and in Sec.<ref> we present an expression that describes the bubble shape within ballistic approximation. In Sec.<ref> plasma electron density is derived, and the outcome of this section is then used in Sec.<ref> to get to the main result of the paper - the expression for the pseudopotential.\n\n\n\n\n\n§ BASIC EQUATIONS \n\n\n\n\nWe start from the set of equations derived in Ref.<cit.>.  We use the same convention as the Ref.<cit.> and we use dimensionless variables: time is normalized to ω_p^-1, length to k_p^-1, \nvelocities to the speed of light c, and momenta to mc. We also normalize fields to mcω_p/e, forces to mcω_p, potentials to mc^2/e, the charge density to n_0 e, the plasma density to n_0, and the current density to en_0c. With e being the elementary charge, e>0.\n\nThe equation of motion for the plasma electrons could be written as \n\n    d𝐩/dt=∇ψ-𝐯𝐁, d𝐫/dt=𝐩/γ.\n\nHere 𝐩 is the momentum of the plasma electrons, γ=√(1+p^2) is the relativistic gamma factor of the plasma electrons, 𝐯=𝐩/γ is the velocity and ψ=ϕ-A_z is the pseudopotential that defines the wake field as\n\n    E_z=∂ψ/∂ξ,    𝐅_⊥=-∇_⊥ψ,\n\nand ∇=(∂_x,∂_y,-∂_ξ).\nHere 𝐅_⊥ is the transverse part of the Lorentz force  per unit charge of the test particle and ξ=t-z.\n\nEqs.(<ref>) have the following integral of motion\n\n    γ-p_z-ψ=1,\n\nas a consequence we have \n\n    1-v_z=1+ψ/γ.\n\nIn a quasi-static picture, it is convenient to replace the derivative by time t with the derivative by ξ.\nWe use the fact that\n\n    dξ/dt=1-v_z,\n\nconsequently for an arbitrary function f(ξ) we have.\n\n    df/dt=df/dξdξ/dt=(1-v_z)df/dξ=1+ψ/γdf/dξ.\n\nSince in the quasi-static picture momentum of the plasma electron is a function of ξ Eqs.(<ref>) with Eq.(<ref>) are reduced to\n\n    d𝐩_⊥/dξ=γ/1+ψ[∇_⊥ψ+ẑ𝐁_⊥]-B_z/1+ψ𝐩_⊥ẑ.\n\nEquation for the pseudopotential reads\n\n    Δ_⊥ψ=(1-v_z)n_e-n_i(x),\n\n here n_e is the plasma electron density and n_i(x) is the ion density that depends on x. In what follows, we will assume that\n \n    n_i(x)\n         =\n         1+gx,\n\n with g≪ 1.\n Equations for the magnetic field are \n \n    Δ_⊥ B_z=ẑ·(∇_⊥ n_e𝐯_⊥), \n       Δ_⊥𝐁_⊥=-ẑ∇_⊥ n_e v_z-ẑ∂_ξ n_e 𝐯_⊥.\n\n\nThe continuity equation reads\n\n    _ξ[n_e(1-v_z)]\n        +\n        ∇_⊥·\n        n_ev⃗_⊥\n        =\n        0\n        .\n\n\n\n\n\n\n\n§ SHOCK WAVE \n\n\n\n\nTo calculate the field distribution that is produced by the point driver that travels through plasma, we follow  Refs.<cit.>. Namely, we assume that driver fields are localized in an infinitesimally thin layer, i.e.  \nhave a delta-function discontinuity\n\n\n    𝐄_⊥   =𝐃δ(ξ), \n    𝐁_⊥   =ẑ×𝐃δ(ξ).\n\n\nThe transverse profile of these fields is defined by the 2D vector 𝐃.\n\nTo solve for the shock wave at ξ=0, we assume that the plasma density in front of the moving driver has a linear gradient\n    \n    n_0\n            =\n            1 + gx\n            ,\n\nwhere the uniform part of the density is 1, g is a constant, and x is the transverse coordinate. We assume a small gradient,\n    \n    g≪ 1\n            ,\n\nand use the perturbation theory.\n\nWe consider equation for the vector D⃗ that according to Ref.<cit.> reads\n\n    Δ_⊥D⃗ =n_0/γ_0D⃗.\n\nIf we split D⃗ into r and ϕ component then Eq.(<ref>) could be written in expanded form as\n\n    Δ_⊥ D_r-D_r/r^2-2/r^2∂ D_ϕ/∂ϕ =n_0/γ_0 D_r, \n       Δ_⊥ D_ϕ-D_ϕ/r^2+2/r^2∂ D_r/∂ϕ =n_0/γ_0 D_ϕ,\n\nwith the Laplace operator given by\n\n    Δ_⊥=1/r∂/∂ r[r ∂/∂ r]+1/r^2∂^2 /∂ϕ^2.\n\nIf we assume that n_0 is a constant then due to the axial symmetry we have D⃗=D_r(r)r⃗ and D_ϕ=0.\nThis immediately results in the equation for D(r) in a form\n\n    1/r∂/∂ r[r ∂ D_r/∂ r]-1/r^2D_r =n_0/γ_0 D_r.\n\nWith the unmodified plasma density, initial gamma set to unity (n_0=1, γ_0=1) and boundary conditions D_r(∞)=0, D_r(r→ 0)=2ν/r we have\n\n    D_r(r,ϕ)=2ν K_1(r).\n\nNext, we consider n_0 as given by Eq.(<ref>). We apply perturbation theory and seek a solution of the Eq.(<ref>) in a form\n\n    D_r=D_r^(0)+D_r^(1), \n       D_ϕ=D_ϕ^(0)+D_ϕ^(1).\n\nWith the D_r^(0)=2ν K_1(r), D_ϕ^(0)=0 and D_r,ϕ^(1)∼ g - small corrections. Substituting Eqs.(<ref>) and Eq.(<ref>) into the Eqs.(<ref>), equating terms of the same order and accounting for x=rcos(ϕ) we arrive at a set of equations for corrections in the form\n\n    Δ_⊥ D^(1)_r-D^(1)_r/r^2-2/r^2∂ D^(1)_ϕ/∂ϕ =D_r^(1)+2ν g K_1(r)rcos(ϕ), \n       Δ_⊥ D^(1)_ϕ-D^(1)_ϕ/r^2+2/r^2∂ D^(1)_r/∂ϕ =D^(1)_ϕ.\n\nNext we decompose D_r^(1) and D_ϕ^(1) in a Fourier series\n\n    D_r^(1)(r,ϕ)=∑D̃^r_n (r) cos(n ϕ), \n       D_ϕ^(1)(r,ϕ)=∑D̃^ϕ_n (r) sin(n ϕ),\n\nand substitute this decomposition into Eqs.(<ref>). Equating amplitudes of corresponding cosines and sines we have\n\n    1/r∂/∂ r[r ∂ D^r_1/∂ r]-2/r^2 D^r_1-2/r^2D^ϕ_1=D^r_1+2ν g K_1(r)r, \n       1/r∂/∂ r[r ∂ D^ϕ_1/∂ r]-2/r^2D^ϕ_1-2/r^2 D^r_1 =D^ϕ_1.\n\nNext we introduce new functions Ψ=D_1^r+D_1^ϕ and Φ=D_1^r-D_1^ϕ. Adding and subtracting Eqs.(<ref>) we get\n\n    1/r∂/∂ r[r ∂Ψ/∂ r]-4/r^2Ψ=Ψ+2ν g K_1(r)r, \n       1/r∂/∂ r[r ∂Φ/∂ r]=Φ+2ν g K_1(r)r.\n\nA general solution to the equations above is zero as none of the functions fulfill boundary conditions Ψ(∞)→ 0, Φ(∞→ 0) and Ψ(0)<∞, Φ(0)<∞. \nA specific solution on the other hand does not vanish and could be found via Hankel transformation. Forward and inverse Hankel transformation of the order n of some function f(r) are given by\n\n    f̂(k)=ℋ_n[f(r)]≡∫_0^∞r f(r) J_n(k r) dr, \n       f(r)=ℋ_n^-1[f̂(k)]≡∫_0^∞k f̂(k) J_n(k r) dk.\n\nHere J_n(k r) is the Bessel function of the fist kind of the order n.\n\nWe apply ℋ_2 to the fist equation and ℋ_0 to the second equation and get\n\n    Ψ̃=-4ν gk^2/(1+k^2)^2, \n       Φ̃=-4ν g1/(1+k^2)^2.\n\nInverse Hankel transform gives\n\n    Ψ=-4ν gℋ_2^-1[k^2/(1+k^2)^3]=-ν g/2r^2K_0(r), \n       Φ=-4ν gℋ_0^-1[1/(1+k^2)^3]=-ν g/2r^2 K_2(r).\n\nD^r_1 and D^ϕ_1 are recovered as\n\n    D^r_1=Ψ+Φ/2, \n       D^ϕ_1=Ψ-Φ/2,\n\nand reads\n\n    D^r_1=-ν g/4r^2[K_0(r)+K_2(r) ],\n       D^ϕ_1=-ν g/4r^2[K_0(r)-K_2(r)].\n\nFinally, first order corrections could be written as\n\n    D_r^(1)=-ν g/4r^2[K_0(r)+K_2(r) ] cos(ϕ),\n       D_ϕ^(1)=-ν g/4r^2[K_0(r)-K_2(r)] sin(ϕ).\n\n\n\n\n\n\n§ SHAPE MODIFICATION OF THE PLASMA BUBBLE \n\n\n\n \nWe neglect the effect of the plasma self-fields on the trajectories of the plasma electrons. This is a “ballistic” regime of plasma motion introduced in Ref.<cit.>; it assumes that the plasma electrons are moving with constant velocities.\n\nWe assume plasma electrons to be non-relativistic and v_z0≈1 and ν≪ 1 as well as  ν≪ r < 1. With help of Eq.(<ref>) and Eq.(<ref>) \nwe may write equations of motion for the plasma electrons as  \n\n    dx/dξ≈2ν/r_0cos(ϕ_0)-gν/2, \n       dy/dξ≈2ν/r_0sin(ϕ_0).\n\nSolution to the equations above gives electron trajectories\n\n    x=r_0cosϕ_0+2νξ[cos(ϕ_0)/r_0-g/4], \n       y=r_0sinϕ_0+2νξsin(ϕ_0)/r_0.\n\nFrom Eqs.(<ref>) one can deduce (see Appendix <ref>) an equation of an envelope surface that defines the boundary of the bubble in the ballistic approximation in a form\n\n    (\n        x+1/2νξ g\n        )^2\n        +\n        y^2\n        =\n        8νξ\n        .\n\nIt could be seen from the equation above that the circular cross sections of the bubble in x,y plane are shifted in the x direction by the distance νξ g/2 that is linearly increasing with ξ.\n\nWe introduce the coordinates  x̃ = x+gνξ /2, ỹ=y and r̃ = √(x̃^2+ỹ^2) and the angle ϕ̃ = arccosx̃/ r̃. Then Eqs.(<ref>) can be written as\n\n    r̃\n        =\n        r_0 + 2νξ/r_0,\n            ϕ̃\n        =\n        ϕ_0\n        .\n\n\nCondition d r̃/ d r_0=0 gives equation for the bubble boundary \n\n    r̃_b(ξ)= 2√(2νξ),\n\nin full agreement with Ref.<cit.>.\nSwitching back to the (x,y) we arrive at the final expression for the bubble boundary in the form\n\n    r_b(ξ,ϕ)=2√(2νξ)-gνξ/2cos( ϕ).\n\n\n\n\n\n\n\n§ AXIAL SYMMETRY OF THE CONTINUITY EQUATION IN THE BALLISTIC APPROXIMATION\n\n\nFirst, we refer to the continuity equation (<ref>) that in the ballistics approximation takes the form\n\n    _ξ n_e +∇_⊥· n_ev⃗_⊥ = 0.\n\nHere as before v⃗_⊥ is the vector of the transverse velocity of the plasma electrons that according to the Eq.(<ref>) reads\n\n    v⃗_⊥=(2ν/r_0cos(ϕ_0)-gν/2,2ν/r_0sin(ϕ_0) )^T.\n\nWe notice that\n\n    ∂/∂x̃=∂/∂ x,\n       ∂/∂ỹ=∂/∂ y.\n\n\nNext, if we assume that n=n(x̃,ỹ,ξ) then Eq.(<ref>) should be modified as\n\n    _ξ n_e+gν/2_x̃ n_e+v_x_x̃n_e+v_y_ỹn_e\n       +n_e_x̃v_x+n_e_ỹv_y = 0.\n\nIntroducing ṽ_⊥=(2ν/r_0cos(ϕ_0),2ν/r_0sin(ϕ_0) )^T, ∇̃_⊥=(_x̃,_ỹ) and noting that \n\n    _x̃v_x=_x̃ṽ_x,\n\n\nwe have \n\n    _ξ n_e +∇̃_⊥· n_eṽ_⊥ = 0.\n\nWe notice that in the new coordinates the plasma flow (in particular velocity field) has a cylindrical symmetry and thus continuity equation has a cylindrical symmetry as well and could be written as\n\n    _ξ n_e +1/r̃∂/∂r̃r̃ n_e ṽ_⊥ = 0.\n\nwith ṽ_⊥=2ν/r_0.\n\n\n\n\n\n§ PLASMA DENSITY IN THE BALLISTIC APPROXIMATION \n\n\n\n\nImmediately behind the driver, at ξ=0^+, the plasma density n_0 is given by Eq.(<ref>). \nIf we assume that electron trajectories are known then from  the continuity of the plasma flow we conclude that \n\n    n(x,y,ξ) dS = n_0(x_0,y_0) dS_0,\n\nfrom which it follows that\n\n    n(x,y,ξ) = n_0(x_0,y_0) dS_0/dS.\n\nthe ration dS/dS_0 is calculated though the Jacobian\n\n    dS/dS_0=|\n    [ ∂ x/∂ x_0 ∂ x/∂ y_0; ∂ y/∂ x_0 ∂ y/∂ y_0;           ]|.\n\nNear the bubble boundary, as far as maximum bubble radius r_bm∼√(ν) and ν≪ 1, we can use electron trajectories as defined by Eq.(<ref>). Accounting for the cylindrical symmetry in the (x̃, ỹ) coordinates we get \n    \n    n(r̃,ϕ̃,ξ)\n        =   n_0(r_0,ϕ_0)r_0dr_0/r̃d r̃= \n       n_0(r_0,ϕ_0) \n        r_0^3/r̃|r_0^2-2νξ|\n        ,\n\nwhere we have used Eq.(<ref>) to calculate dr̃/dr_0. \n\nThe initial radius r_0 in this equation should be expressed through r and ξ from Eq. (<ref>):\n    \n    r_0^±\n        =\n        1/2r̃±√(1/4r̃^2\n        -\n        2νξ)\n        =\n        1/2r̃(\n        1\n        ±√(    1    -    t    ))\n        ,\n\nwhere\n    \n    t\n        =\n        8νξ/r̃^2\n        =\n        r̃_b^2/r̃^2\n        <1\n        ,\n\nwith r̃_b≡ 2√(2νξ) as given by Eq.(<ref>).\n\nTwo solutions correspond to two trajectories that arrive from different initial radii r_0,ϕ_0 to a given point r̃,ϕ̃,ξ. One of these trajectories arrives before and the other one after it touches the envelope. Correspondingly, at a given ξ,r̃,ϕ̃, we need to sum the two densities for both trajectories.\n\nSubstituting (<ref>) into (<ref>) we obtain\n    \n    n_±(r̃,ϕ̃,ξ)\n        =\n        1/2(\n        1\n        ±√(    1    -    t    ))^3\n        /|\n        (\n        1\n        ±√(    1    -    t    ))^2\n        -t|\n        (1+gr_0^±cosϕ_0)\n        ,\n\nwhere we have used Eq. (<ref>) for n_0. In this formula we have to express r_0 through r̃ using Eq. (<ref>) and also use ϕ̃ = ϕ_0.  For the total density, after some simplifications, we find\n    \n    n(r̃,ϕ̃,ξ)\n           =\n        n_+(r̃,ϕ̃,ξ)+n_-(r̃,ϕ̃,ξ) \n       =\n        1/22-t/√(1-t)\n        +\n        gr̃4-3t/4√(1-t)cosϕ̃\n       =\n        2r̃^2-r̃_b^2/2r̃√(r̃^2-r̃_b^2)\n        +\n        g\n        4r̃^2-3r̃_b^2/4√(r̃^2-r̃_b^2)cosϕ̃\n        .\n\nAs a consequence of the singularity in the shock wave, plasma density has a square root singularity at the boundary of the bubble.\n\nWe switch back to the initial coordinates r,ϕ,ξ and keep only terms of the order g: \n\n    n(r,ϕ,ξ)=2r^2-r̃_b^2/2r√(r^2-r̃_b^2)\n       +g cosϕ/4 (r^2-r̃_b^2 )^3/2[(4 r^2-3 r̃_b^2 )(r^2-r̃_b^2 )-r̃_b^6/8 r^2].\n\nAs expected the first term in Eq.(<ref>) coincides with the electron density in the uniform case given in Ref.<cit.> while the second term provides correction that accounts for the initial transverse plasma gradient. \n\n\n\n\n§ PSEUDOPOTENTIAL \n\n\n\n\n\nEquation for the pseudopotential under the assumption of the non-relativistic plasma flow (v_z≪ 1) reads\n\n    Δ_⊥ψ=n_e-n_i,\n\n here n_e is the plasma electron density and n_i is the ion density that depends on x. In what follows, we will assume that\n \n    n_i(x)\n         =\n         1+gx.\n\nWe assume r_0≪ 1 and r≪ 1 switch to x̃ = x+gνξ /2, ỹ=y and r̃ = √(x̃^2+ỹ^2) and the angle ϕ̃ = arccosx̃/ r̃, account for the Eq.(<ref>) and Eq.(<ref>) and rewrite Eq.(<ref>) in the extended form\n\n    1/r̃∂/∂r̃[r̃∂ψ/∂r̃]   +1/r̃^2∂^2 ψ/∂ϕ̃^2=\n    2r̃^2-r̃_b^2/2r̃√(r̃^2-r̃_b^2)θ(r̃ -r̃_b)-1\n       +gr̃cosϕ̃(\n        4r̃^2-3r̃_b^2/4r̃√(r̃^2-r̃_b^2)θ(r̃ -r̃_b)-1) ,\n\nNext we decompose ψ in in a Fourier series\n\n    ψ(r̃,ϕ̃)=∑ψ̃_n (r̃) cos(n ϕ̃).\n\nConsequently we have\n\n    1/r̃∂/∂r̃[r̃∂ψ̃_0/∂r̃]=2r̃^2-r̃_b^2/2r̃√(r̃^2-r̃_b^2)θ(r̃ -r̃_b)-1,\n\nand \n\n    1/r̃∂/∂r̃[r̃∂ψ̃_1/∂r̃]   -ψ̃_1/r̃^2= \n       gr̃(\n        4r̃^2-3r̃_b^2/4r̃√(r̃^2-r̃_b^2)θ(r̃ -r̃_b)-1).\n\nWe introduce new normalized radius κ=r̃/r̃_b and rewrite Eq.(<ref>) and  Eq.(<ref>) in the universal form\n\n    1/κ∂/∂κ[κ∂ψ̃_0/∂κ]=r̃_b^2[2κ^2-1/2κ√(κ^2-1)θ(κ -1)-1],\n\n\nand\n\n\n\n    1/κ∂/∂κ[κ∂ψ̃_1/∂κ]-   ψ̃_1/κ^2= r̃_b^3 gκ[\n        4κ^2-3/4κ√(κ^2-1)θ(κ -1)-1].\n\n\nEquations above could be integrated and the solutions read\n\n    ψ̃_0(κ)={[                                       a_1+a_2 logκ-1/4r̃_b^2κ^2  κ<1; a_3+a_4 logκ+1/4r̃_b^2κ(√(κ^2-1)-κ)-1/4r̃_b^2 log(κ+√(κ^2-1))  1<κ≪∞;                                                                      ].,\n\nand\n\n    ψ̃_1(κ)={[                                                b_1κ+b_2/κ-1/8g r̃_b^3κ^3  κ<1; b_3κ+b_4/κ-1/16r̃_b^3 g κ{2κ^2-2κ√(κ^2-1)+log[κ+√(κ^2-1)/κ-√(κ^2-1)] }  1<κ≪∞;                                                                               ]. .\n\nHere a_i and b_i are constants that could be found from the condition ψ(r=0)<∞ for ξ≠ 0 and continuity of the pseudopotential and its derivative at the bubble boundary. \n\nFirst, we consider the monopole part ψ̃_0 ( r̃/r̃_b) Eq.(<ref>).\nCondition ψ̃_0(r̃=0)<∞ for ξ≠ 0 leads to a_2=0, continuity of the potential gives a_3=a_1 and continuity of the derivative requires a_4=0. Consequently we arrive at\n\n    ψ̃_0( r̃/r̃_b)={[                                                          a_1-r̃^2/4  r̃<r̃_b; a_1+r̃/4(√(r̃^2-r̃_b^2)-r̃)-r̃_b^2/4log(r̃/r̃_b+√((r̃/r̃_b)^2-1))  r̃_b<r̃≪∞;                                                                              ]..\n\n\nNext, we consider the dipole part ψ̃_1 ( r̃/r̃_b) Eq.(<ref>). Condition ψ̃_1(r̃=0)<∞ for ξ≠ 0 leads to b_2=0 continuity of the potential gives b_1=b_3+b_4 and continuity of the derivative requires b_1=b_3-b_4. Consequently b_4=0, b_3=b_1 and we arrive at \n\n    ψ̃_1 ( r̃/r̃_b)= {[                                                                   b_1r̃/r̃_b-1/8gr̃^3  r̃<r̃_b; b_1r̃/r̃_b-1/16 g r̃{2r̃^2-2r̃√(r̃^2-r̃_b^2)+log[r̃+√(r̃^2-r̃_b)/r̃-√(r̃^2-r̃_b)] }  r̃_b<r̃≪∞;                                                                                                ]..\n\n\nWe note that at large r̃≫r̃_b particular solution for the ψ̃_0 diverges as ∼ -r̃_b^2/4logr̃ and particular solution for the  ψ̃_1 diverges ∼ -r̃_b^2 g/8r̃logr̃ (See Appendix <ref> for the details). This is connected with the fact that we neglected screening effects in the considered approximation.\n\n\nWe switch back to the original coordinates r and ϕ. Noticing that cosϕ = cosϕ̃+𝒪[g] and accounting for the fact that ψ̃(κ) ∼𝒪[g] one may write\n\n    ψ(r,ϕ,ξ)=   ψ̃_0 ( r/r̃_b)+gr̃_b/16ψ̃^'_0 ( r/r̃_b) cosϕ\n    +    ψ̃_1 (r/r̃_b) cosϕ +𝒪[g^2].\n\n\nWe observe that, as expected, pseudopotential consists of two parts: monopole - that corresponds to the term ψ̃_0 ( r/r̃_b) and dipole - that is a combination of the total derivative by κ of the monopole term ψ̃^'_0 ( κ) and a correction ψ̃_1 (r/r̃_b). \n\nAt distances, r ∼ 1 plasma density should be unperturbed, and plasma electrons screen the field that arises from the bubble. This, in turn, results in the vanishing of the pseudopotential. To account for this and estimate the remaining unknown constants a_1 and b_1 we request pseudopotential to be zero at r =1. \n\nFist, we notice that at r ≫r̃_b expressions for the ψ̃_0 and ψ̃_1 reduces to\n\n    ψ̃_0 ( r/r̃_b) = a_1-r̃_b^2/8 - r̃_b^2/4log( 2 r/r̃_b)+𝒪[r̃_b/r], \n       ψ̃_1 ( r/r̃_b) = b_1 r/r̃_b -g r̃_b^2/16r- g r̃_b^2/8r log( 2 r/r̃_b)+𝒪[r̃_b/r].\n\nNext, keeping only divergent terms and setting r=1 we arrive at\n\n    a_1 ≈r̃_b^2/4log(2/r̃_b), \n    \n        b_1 ≈g r̃_b^3/8log(2/r̃_b).\n\n\nFollowing Eqs.(<ref>) and (<ref>) with Eq.(<ref>) and Eq.(<ref>) we arrive at the final expression for the pseudopotential inside the bubble in the form\n\n    ψ(r,ϕ,ξ)≈   r̃_b^2/4log(2/r̃_b)-r^2/4\n       -gr̃_b^2 cosϕ/8{ r/4- r log( 2/r̃_b)+r^3/r̃_b^2}.\n\nFor the analysis it is convenient to normalize pseudopotential to 1/r̃_b^2. We recall the definition of r̃_b given by Eq.(<ref>) and write the expression for the normalised pseudopotential\n\n    ψ/r̃^2_b=-1/8log(2νξ)-x_n^2+y_n^2/4\n       -g√(2νξ)/4 x_n{1/4+ 1/2log(2νξ)+x_n^2+y_n^2  },\n\nwith x_n=x/r_b and y_n=y/r_b.\n\n\n\n\n\n§ ANALYSIS\n\n\nWith the help of the Eq.(<ref>) and Eq.(<ref>) transverse part of the Lorentz force per unit charge of the negatively charged test particle could be evaluated as\n\n    F_x=-x/2-gr̃_b^2 /8[1/4-log(2/r̃_b)+3x^2+y^2/r̃_b^2], \n       F_y=-y/2-gxy/4.\n\nIt is convenient to normalize it to 1/r̃_b and present in terms of x_n=x/r̃_b and y_n=y/r̃_b\n\n    F_x/r̃_b=-x_n/2-g√(2 νξ)/4[1/4+1/2log(2νξ)+3x_n^2+y_n^2 ], \n       F_y/r̃_b=-y_n/2-g√(2 νξ)x_n y_n/2.\n\nWe note that pseudopotential has a cubic term in x_n that naturally leads to two fixed points of the vector field (one stable and one unstable). \nBy setting F_x=0 and F_y=0 one may find fixed points of the transverse wakefield by solving the corresponding algebraic system that follows from Eq.(<ref>): \n\n    y_n^F=0, \n       x_n^S=-g√(νξ)/4√(2)[1+2log(2 νξ) ], \n       x_n^uS=-√(2)/3g √(νξ)+g√(νξ)/4√(2)[1+2log(2 νξ) ].\n\nTo simplify the final formula, we kept only terms of the order g, i.e. we disregarded terms of the order 𝒪[g^2 ] in Taylor decomposition.\n\n In Fig.<ref> we show level sets of the pseudopotential given by Eq.(<ref>), transverse wakefield vector field Eq.(<ref>) and fixed points of the vector field Eq.(<ref>) for three different values of the longitudinal coordinate ξ. We chose extreme (and probably unreachable in practice) parameters of g=0.8 and ν=1 to emphasize the effect. We observe that at small values of ξ, where the model is directly applicable, only one stable fixed point exists within the bubble cross-section. Transverse gradient shifts the electromagnetic origin towards the higher densities of the ion column, but the net effect remains focusing albeit asymmetric. Further increase in ξ does not change the picture. The asymmetry in the focusing grows, but the structure of the wake remains the same. Interestingly, if we speculate and go beyond the formal applicability of the considered model. We may observe the situation when both stable and unstable fixed points are located inside the bubble cross-section. We point out, that despite the complex structure of the pseudopotential, the stable region (the region where the beam is attracted to the stable fixed point) occupies more than half of the bubble cross-section even in this unrealistic scenario. The latter indicates that most likely fixed transverse plasma gradient (a transverse plasma gradient that does not change in z) should not affect the driver dynamics (at least within considered approximation) and only results in some asymmetric distortion of the bubble shape and wake.\n \nIt is worth mentioning that the plasma gradient may fluctuate randomly due to the random fluctuations of the plasma density. Such random fluctuation will result in a random kick. It is well known (see Refs.<cit.>) that random kicks may lead to emittance growth and potentially may lead to driver instability. Indeed, in 1D emittance growth (see for instance Ref.<cit.>) due to the random kick reads\n\n    δε/δ s=⟨ x^2⟩⟨ F_x^2⟩/ε.\n\nHere ε is the beam emittance and τ is the characteristic time of the fluctuation. Following Eq.(<ref>) we can write\n\n    ⟨ F_x^2⟩∼⟨ g^2⟩∼⟨ n^2⟩-n_0^2.\n\nConsequently, the dispersion of the density fluctuation sets the growth rate for the emittance. This observation motivates further studies in more realistic scenarios by either applying Lu model <cit.> or proper extension of a numerical simulation <cit.>.   \n\n\n\n§ CONCLUSIONS\n\n\nWe have presented a detailed analysis of the wakefield in the presence of the transverse plasma gradient. A simple ballistic model from Refs.<cit.> was updated to account for the linear transverse inhomogeneity in plasma. As a result, we provide final analytic expressions for the pseudopotential and the transverse wakefield. We note that as in the flat bubble regime considered previously in Ref.<cit.>, the bubble shape in the present study shows similar distortion. Namely, a small perturbation to the plasma density results in the “bending” of the bubble toward a lower plasma gradient. However, in contrast to the flat bubble regime, in the round bubble transverse wake does not vanish.  \n\nWe point out that random fluctuation of the plasma density, which naturally occurs, may lead to emittance growth and potentially become a challenge. Consequently, further developments in this direction are in order. \n\nWe note that the numerical examples provided in the paper\nare synthetic, and we choose parameters for these examples to emphasize corresponding effects. In reality, the parameter\ng— a transverse plasma gradient should be on the order of\n1% or less as well as ζ≪ 1. We emphasize that the whole analysis is applicable only when plasma electrons are nonrelativistic. \n\nDespite the restrictions outlined above, the model presented is still useful, as it is complementary to the Lu model of the plasma bubble\n<cit.>. The model presented could be \"merged\" with the Lu model such that the results of the ballistic model may serve as\nan initial condition for the Lu equation. A combined model will be free of the empiric parameters and cover the whole range of the driver beam intensities. \n\nThe equation derived in the present paper could be used as a crude estimate for the transverse emittance growth due to the random fluctuations of the plasma density.  \n\n\n\n\n\n\n\n§ ENVELOPE SURFACES FOR THE BALLISTIC TRAJECTORIES \n\n\n\nFirst, we notice that if g=0, then as was shown in Ref. <cit.>, for a given ξ, the map Eq.(<ref>) when r_0 varies from 0 to ∞ and ϕ_0 varies from 0 to 2π leaves and empty circle of radius 2√(2νξ) centered at x=y=0. With a nonzero g, we can move the term -νξ g/2 from the right to the left-hand side. We then see that this empty circle is shifted by -νξ g/2 along x, and hence its equation is Eq. (<ref>).\n\n\n\nAnother approach is to consider an arbitrary ballistic trajectory as given by Eq.(<ref>). This trajectory could be represented in a vector form in xyξ space as\n\n    r=(x,y,ξ)^T\n\nwith x and y given by Eq.(<ref>). \nNext we consider a transformation of the xyξ space along ξ axis given by a rotation matrix \n\n    R_ξ=(\n    [  cosϕ_0  sinϕ_0       0; -sinϕ_0  cosϕ_0       0;       0       0       1;         ])\n\nand apply to Eq.(<ref>). With Eq.(<ref>) we have\n\n    R_ξ r = \n       ( r_0+2ξν/r_0-ξ g ν/2cosϕ_0,ξ g ν/2sinϕ_0,ξ)^T.\n\nNext we consider rotation along x axis\n\n    R_x=(\n    [     1     0     0;     0  cosθ -sinθ;     0  sinθ  cosθ;       ])\n\nsuch that tan(θ)=ν g/2sin (ϕ_0). Combining Eq.(<ref>) with Eq.(<ref>) we get\n\n    R_xR_ξ r = \n       ( r_0+2ξν/r_0-ξ g ν/2cosϕ_0,0,ξ√( 1+[g ν/2sinϕ_0]^2))^T.\n\nIt follows from Eq.(<ref>) that xyξ space could be rotated with the help of R_xR_ξ transformation such that after the combiner rotation any given trajectory will always lay in the Oxξ plane. Combiner rotation R_xR_ξ depends only on the initial polar angle ϕ_0 of the trajectory starting point and is independent of r_0. Consequently, we conclude that all trajectories with starting points with the same initial angle ϕ_0 are transformed by the rotation R_xR_ξ to the Oxξ plane as well. It is worth reiterating that all trajectories that start at the same initial angle ϕ_0 will stay in the same plane and, with the help of two rotations R_ξ and R_x, could be always translated into Oxξ plane. As far as the transformation R_x R_ξ is not degenerate and has only one stationary point (0,0,0) trajectories that start from different angles ϕ_0 never cross as different ϕ_0 defines different rotations of the xyξ space. This, in turn, effectively reduces the initial problem of finding an envelope surface for all trajectories to a problem of finding an envelope curve for families of the trajectories with the same angle ϕ_0 transformed to the Oxξ plane with the help of R_xR_ξ rotation.\n\nIf x̃≡ r_0+2ξν/r_0-ξ g ν/2cos(ϕ_0) then an envelope curve for each family according to Eq.(<ref>) could be written as\n\n    x̃_e=2√(2νξ)-ξ g ν/2cos(ϕ_0).\n\nThus, points on an envelope curve in a transformed plane have the coordinates \n\n    r̃_e = \n       ( 2√(2νξ)-ξ g ν/2cosϕ_0,0,ξ√( 1+[g ν/2sinϕ_0]^2))^T.\n\nInverse transformation R^-1_ξ R_x^-1 applied to the Eq.(<ref>) gives a set of points that resemble envelope curve that results from the trajectories that have fixed polar angle ϕ_0 for the starting points.\n\n    R^-1_ξ R_x^-1r̃_e= \n       ( 2√(2νξ)cosϕ_0-ξ g ν/2,2√(2νξ)sinϕ_0,ξ)^T.\n\nIf now x≡ 2√(2νξ)cosϕ_0-ξ g ν/2 and y≡2√(2νξ)sinϕ_0 then one can arrive at the Eq.(<ref>).\n\nThe analysis presented above has another important consequence. As far as each ϕ_0 family of the trajectories forms a separate and independent of others envelope line, plasma density that results from electron blowout could be derived exactly the same way for each family in the transformed plane. \n\n\n\n\n\n§ DIVERGENCE OF THE UNSCREENED PSEUDOPOTENTIAL FOR THE LARGE VALUES OF  KAPPA \n\n\n\nWe consider an asymptotic at κ≫1 of the right hand side of the Eq.(<ref>) \n\n    r_b^3 gκ   [\n        4κ^2-3/4κ√(κ^2-1)θ(κ -1)-1]≈\n       r_b^3 gκ[\n        θ(κ -1)-1-θ(κ-1)/4κ^2].\n\nWith this for κ>1 Eq.(<ref>) reduces to\n\n    1/κ∂/∂κ[κ∂ψ̃_1/∂κ]-ψ̃_1/κ^2≈-r_b^3 g/4κ.\n\nParticular solution has the form\n\n    ψ̃_1≈r_b^3 gκ/16(1-2logκ)\n\naccounting for the logκ≫1 we get\n\n    ψ̃_1≈ -r_b^3 g/8κlogκ.\n\n\n\nThe author is grateful to G. Stupakov for fruitful discussions. The work was supported by the \"BASIS\" foundation grant #22-1-2-47-17 and ITMO Fellowship and Professorship program.\n\nunsrt\n\n\n"}