{"entry_id": "http://arxiv.org/abs/2303.07250v2", "published": "20230313162408", "title": "The balance between contamination and predation determine species existence in prey-predator dynamics with contaminated and uncontaminated prey", "authors": ["Amit Samadder", "Arnab Chattopadhyay", "Sabyasachi Bhattacharya"], "primary_category": "q-bio.PE", "categories": ["q-bio.PE"], "text": "\n Topological phase transitions generated by order from quantum disorder \n     Fadi Sun^1 and Jinwu Ye^1,2   \n    March 30, 2023\n========================================================================\n\n\nIn freshwater ecosystems, aquatic insects that ontogenetically shift their habitat from aquatic to terrestrial play vital roles as prey subsidies that move nutrients and energy from aquatic to terrestrial food webs. As a result, these subsidies negatively affect alternative terrestrial prey by enhancing predator density. However, these aquatic insects can also transport contamination to the terrestrial community that is primarily produced in aquatic ecosystems. Which can reduce insectivore abundance and biomass, lower insectivore reproductive success, and increase predation pressure on alternative prey with consequences for aquatic and terrestrial food webs. Motivated by this, here we consider a prey-predator model where the predator consumes contaminated and uncontaminated prey together. We find that, at a high level of contamination, the vulnerability of contaminated prey and predator is determined by predation preference. More specifically, a very low predation preference towards contaminated prey ensures predator persistence, whereas a low, high preference excludes the predator from the system. Interestingly, either contaminated prey or the predator exist at intermediate predation preference due to bi-stability.\nFurthermore, when there is no contamination in one of the prey, the other prey can not coexist due to apparent competition for a specific range of predation preferences. However, when sufficient contamination exists in one prey, alternative uncontaminated prey coexists. With this, contamination also stabilizes and destabilizes the three species dynamics. Our result also indicates that if the intensity of the contamination in predator reproduction is low, then contaminated prey is more susceptible to the contamination.                \n\n\n\n\n§ INTRODUCTION\n\nAcross the globe is growing concern about environmental pollution in ecosystem health, as it is one of the direct drivers of ecosystem change at the global scale and a significant contributor to biodiversity loss <cit.>. Pollution can adversely affect a diverse range of organisms by impairing their neurological function, behavior, and life cycle parameters, like survival and reproduction <cit.>. Organisms exposed to the polluted environment often take up contaminants through food and water. These contaminants are then passed onto the higher trophic level through trophic interactions and consequently spread toxicity across the the food web. So, quantifying the risk of pollutants requires not only a prior knowledge of their effect on individual organisms but also an understanding of how interacting species respond to chemical stressors.\nSeveral theoretical studies have examined the impact of environmental contamination on ecosystem stability, persistence<cit.>. The earliest mechanistic models in this area were the works based on single species dynamics<cit.>. Further, it was extended for the trophic interactions. For instance, <cit.> predicts that high concentrations of methylmercury lead to the collapse of the entire bi-trophic food chain, while at intermediate toxin concentrations, predators become more vulnerable than the contaminated prey. <cit.> also point out that the consumer population is more susceptible to less extreme copper concentrations than the contaminated prey. Apart from the trophic food chain, the impact of contamination on complex, large food webs is also done and shows that in a more polluted environment, topological properties of the food web are more vital for stability <cit.>.   \nMost of these theoretical studies focus on the impact of contamination on interacting species dynamics by considering all the prey of the predator is contaminated. However, in a natural ecosystem, many generalist predators can consume contaminated and uncontaminated prey together. For instance, <cit.> find that Bonelli eagles acquire most of their burden through the intake of secondary consumers as mercury levels were very low in alternative prey. Further, some consumers tend to forage over larger spatial scales even up to kilometers, naturally they can consume prey from contaminated and uncontaminated sites. Again, prey that disperses from contaminant sites can transport contaminants to a spatially separated prey-predator community<cit.>. Recent evidence demonstrates that aquatic insects export substantial mercury from the aquatic environment to terrestrial insectivore communities, like songbirds, which frequently consume terrestrial and aquatic insects<cit.>. However, we know very little about how contamination affects these communities.\nTheory and experimental evidence predict that prey subsidies can support a denser predator population, consequently increase predation on the alternative prey population<cit.>. Despite the benefits of aquatic insect emergence as an alternative energy source to the predator, they can also degrade predators through the tropic transfer of aquatically derived environmental contaminants<cit.>, such as methylmercury, that primarily produced in aquatic environments <cit.>. Indeed, in the face of current environmental pollution, predators are predicted to be more susceptible than the contaminated prey<cit.>. However, it is difficult to predict the victim of contamination when a predator accumulate contaminates through the prey only and also have an alternative uncontaminated energy source,  because, while contamination negatively affects both the predator and contaminated prey, the flow of contamination to the predator also depends on the predator's diet composition<cit.>. So the predators more sensitive to the contamination may not suffer from considerable extinction risk if they rarely prefer to consume contaminated prey. Conversely, predators less sensitive to contamination can carry high extinction risk if they frequently consume contaminated prey. Furthermore, a high predation pressure can also have a determental effect for the contaminated prey and predator in highly contaminated environment <cit.>.  \nApart from the predator, contamination may also regulate indirect interaction between preys. In general, food web modules such as multi-prey with a common predator, prey is known to compete with each other indirectly, also known as apparent competition<cit.>. The idea of apparent competition is two prey species negatively affect each other by increasing the equilibrium density of the shared predator, and in an extreme case, one prey excludes another alternative prey from the community <cit.>. Experimental evidence also supports this phenomenon by showing that aquatic insects subsidiary suppress terrestrial herbivore insects by increasing predator density <cit.>. In apparent competition between terrestrial and aquatic emergent insects, contamination in aquatic prey can reduce top-down pressure on the uncontaminated terrestrial prey by decreasing the predator density, thereby can initiate its persistence. Conversely, predators that prefer quality over quantity can also increase predation pressure on uncontaminated prey by shifting their diet to more favorable prey <cit.>, thus can enhance its extinction risk. <cit.> find that contamination can alter the outcome of the direct competition by suppressing competitively superior species. Nevertheless, how contamination affects indirect competition between prey is yet to be known.          \nIn light of the above-known facts, here we formulate a prey-predator model where the predator consumes contaminated and uncontaminated prey together. We mainly attempt to answer the interrelated questions: (1) Does contamination become a precursor of extinction for the predator or the contaminated prey? (2) How does contamination affect the indirect competition between prey? (3) What is the role of predation preference in rescuing or imperiling each species in contaminated environments? We use bifurcation analysis to investigate this system's possible asymptotic states and hypothesize that direct and indirect species interaction have a profound effect in driving the dynamics of contaminated systems.\nThe rest of the paper is organized as follows. In section<ref>, we develop a toxin-dependent prey-predator model with uncontaminated prey. In this section, we also derive dimensionless form by suitable parameter substitutions. In section<ref>, we investigate the possible asymptotic states of our system with the help of bifurcation\ndiagrams. We also check the robustness of the result for other parameter sets and alternative assumptions. Finlay, in section<ref>, we complete the paper with a brief discussion.\n\n\n\n\n§ METHODS\n\n\n\n §.§ Modelling framework\n\n Our proposed model consists of three populations: X, Y, and Z. We assume that X is the contaminated prey density, Y is the uncontaminated prey density, and Z is the predator population density that consumes both prey with some preferences. We assume contamination pollutes water-based habitat, which enters into the prey X by direct absorption from water. When it comes to terrestrial habitat, terrestrial predators get contaminated by consuming that contaminated prey. We also assume that contaminated prey is the only source of contamination for the predator. We did not assume any direct competition between prey due to their dietary separation. In absence of the contamination in the prey X, the growth profile describes by the following set of differential equations:\n \n    dX/dt=r_1X(1-X/K_1)-aqXZ/ζ+qX+(1-q)Y\n\n \n    dY/dt=r_2Y(1-Y/K_2)-a(1-q)YZ/ζ+qX+(1-q)Y\n\n \n    dZ/dt=e( aqXZ+a(1-q)YZ/ζ+qX+(1-q)Y) -mZ\n\n The above model represents an apperent competition model under non-switching framework<cit.>.\n The parameters r_i (i=1,2) denotes the intrinsic growth of the preys, K_i (i=1,2) are the carrying capacities of the preys. We assume saturating functional response where a is the attack rate of the predator and q,  (1-q), (0≤ q ≤ 1) are the preferences of the predator for the prey X and Y respectively. e is the conversion efficiency of the predator and m is the natural mortality rate.\n \n \n\n  §.§.§ Modelling dynamics of the internal contamination concentration \n\n A general assumption in modeling the ecological dynamics of a system and pollution dynamics of the individuals together is that, the dynamics of the pollution in the species body operate much faster timescale than the ecological dynamics. So the internal concentration in an individual's body approaches the steady state before the population dynamics change significantly. Simultaneously, it reduces the model dimensions and facilitates analysis <cit.> . Bellow, we derive the internal concentration of the contamination in the individual body. \n A simple and mechanical  bio-dynamic model of internal concentration of contamination can be written by the following form<cit.>:\n \n    C_t^'=( I_W+I_F ) -k_eC_t\n\n where C_t is the internal concentration of the contamination of an organism's body at time t. I_W and I_F are the unidirectional fluxes of the contamination coming from environment and food respectively. k_e is the constant loss rate of the contamination from body of the organism. We can write I_W, I_F as,\n \n    I_W=k_u× C_c\n\n\n    I_F=AE× IR× C_F\n\nWhere C_c is the concentration of the contamination  in the environment, k_u denotes uptake constant in the body,  AE= assimilation efficiency, IR=egnation rate, C_F=concentration in food. Combining equation (2.4), (2.5) and (2.6) we get the steady state approximation of internal concentration of contamination by equating C^'_t=0 as a ratio of total uptake divided\nelimination rate constant <cit.> ,\n\n    C_ss=k_u× C_c+AE× IR× C_F/k_e\n\nThe internal concentration of the contaminant of the prey is:\n\n    C=k_u× C_c/k_e^prey\n\nThe internal contaminant in the predator can be written in terms of the prey contamination concentration(Prey internal concentration) as:\n\n    C_P=β× aqX/( ζ+qX+(1-q)Y ) k_e^predator× C\n\n\nβ is the assimilation efficiency of the predator.\n \n\n  §.§.§ Incorporating contamination in prey predator dynamics\n\n Before incorporating contamination in to our three species model we make following assumptions:\n \n     \n  * We let the growth of contaminated prey is r/1+kC, where C is the pollution in prey  and  k is the intensity of the pollution in the prey growth. We choose such type of effect of contamination in prey growth to avoid the prey extinction due to  contamination only. By doing this we can access other effects that may drive contaminated prey to the extinction. We also assume that contaminated prey have no contamination related mortality(but see  section <ref>).\n     \n  * We consider Y as a terrestrial herbivore which did not consume contamination due to boundary separation between contaminated and uncontaminated sites.\n     \n  * The reproduction of the predator Z directly affected by the consumption of the contaminated prey. We implement the reduction of the predator reproduction by rewriting the conversion efficiency in the form of max(0,1-bC_p)=max(0,1-β baqXC/( ζ+qX+(1-q)Y ) k_e^predator), b is the intensity of the pollution in the predator reproduction in other words 1/b is the internal concentration at which reproduction is zero.\n     \n  * We did not incorporate the effect of the contamination in the predator mortality as songbird is our model predator and studies found that songbird did not exhibit significant difference in the mortality between contaminated and uncontaminated sites<cit.>. \n \n \n Keeping above assumptions in mind we can write the contaminated prey predator system as:\n \n    dX/dt=r_1/1+kCX(1-X/K_1)- aqXZ/ζ+qX+(1-q)Y\n\n \n    dY/dt=r_2Y(1-Y/K_2)-a(1-q)YZ/ζ+qX+(1-q)Y\n\n \n    dZ/dt=e max( 0, 1-β baqXC/( ζ+qX+(1-q)Y) k_e^predator ) ( aqXZ+a(1-q)YZ/ζ+qY+(1-q)Y ) -mZ\n\n\n\n \n\n  §.§.§ Dimensionless Model\n\n To reduce the number of model parameters we dimensionless the above model by considering following substitutions:\n τ=r_1t,  x=X/K_1, y=y/K_1, z=Z/K_1, l=a/r_1, c=kC, η=ζ/K_1, r=r_2/r_1 λ=βr_1b/k_e^predatork, d=m/r_1, K=K_2/K_1\n The dimensionless form of our above model is:\n \n    dx/dτ=x/1+c(1-x)-lqxz/η+qx+(1-q)y\n\n \n    dy/dτ=ry(1-y/K)-l(1-q)yz/η+qx+(1-q)y\n\n \n    dz/dτ=el max( 0, 1-λ ql xc/η+qx+(1-q)y ) ( qxz+(1-q)yz/η+qx+(1-q)y ) -dz\n\n\n\n §.§ Model calibration and analysis\n\nMathematical analysis of positively and boundedness of the solutions carried out in Appendix.A to ensure that our model mechanistically well define.   Standard methods\nof linear stability analysis provides the analytical conditions for existence and\nstability of the various equilibrium of the system in appendix.B. \nWe perform extensive bifurcation analysis to explore possible emerge dynamics of the system (2.13-2.15). Numerical bifurcations are performed in MATLAB using numerical continuation software MATCONT <cit.>and father verified by tracing time series data trough deSolve package in R. For the lake of sufficient parameter values form existing literatures in the case of our modeled species we assume hypothetical parameter values which are biologically feasible:\nl=1, η_1=0.5, η_2=0.5, r=0.5, K=1, e=0.4, λ =1.7, d=0.1, parallely we also investigate the dynamics for aditional parameter sets in section <ref>. Throughout the analysis we set parameters such a way that make the species Y as inferior indirect competitor and X as superior indirect competitor in absence of any contamination. \n\n\n\n\n§ RESULTS\n\nIn this section we used few notations to describe dynamics of the following system. The stable coexistence equilibrium and oscillatory coexistence equilibrium denoted by SC, OC respectively. The contaminated and uncontaminated prey extinction equilibrium denoted by CPE, UPE while the predator extinction equilibrium referred to as PDE.    \n\n\n\n\n §.§ Prey predator dynamics in uncontaminated system\n\nBefore investigating the effect of contamination in this three-species food web module, we study our model without contamination to better understand the dynamical consequences when we will incorporate contamination. As predator preference is one of the key parameters of our uncontaminated model, we perform one parameter bifurcation w.r.t predator preference to quantify the qualitative outcomes. Figure <ref> depicted that when the predator performs as a specialist, that is, its preference is either very low or very high upon X(vice versa for Y) we observe unusable prey-predator dynamics, where prey and predator exhibit a stable limit cycle around the unstable fixed point. Further walking along the average preference from both sides, we find that the dynamics become stable through Hopf bifurcation(H), where three species system coexists in a stable equilibrium and oscillation dies out. When the predator performs as a generalist or its preference is around the average of the preferences, we observe another regime shift through transcritical bifurcation(TB); with this regime shift, the dynamics enter into one prey extinction equilibrium from a coexistence equilibrium(see Figure <ref>). This extinction occurs due to apparent competition between prey<cit.>. The idea of the apparent competition is that if two prey species coexist at equilibrium, the abundance of each is necessarily lower than if it were alone with the predator. Alternatively, if the predator persists and the two prey species cannot coexist, then one prey indirectly excludes the other from the community by sustaining the predator.\n\n\n\n §.§ Prey predator dynamics in contaminated sytem\n\nTo account the effect of contamination in our model system, we perform a one-parameter bifurcation diagram with contamination in prey. We fixed the predator preference q at three values; low contaminated prey preference(q=0.15), moderate contaminated prey preference (q=0.5), and high contaminated prey preference(q=0.85). The corresponding dynamics are depicted in Figure <ref>.\nAt low contaminated prey preference (q=0.15), we observe stable coexistence of three species at low contamination. Moving along the contamination axis, we see the entry and the exit of the stable coexistence state in unstable equilibrium through the initiation and elimination of the hopf bifurcation (H). This phenomenon is also known as the\" bubbling effect\" in ecological literature due to the shape of the bubble in the\none parameter space and also appear in other ecological studies<cit.>. We also observe that the equilibrium density of the contaminated prey decreases first with the contamination and then increases, while the equilibrium density of the uncontaminated prey consistently increases. With this, we also note that the predator's equilibrium density decreases and become extinct through transcritical bifurcation(TB).    \n\n\n\n\nIn Figure <ref>, at the moderate preference for the contaminated prey(q=0.5), moving along the contamination axes-c from zero contamination in prey, we observed equilibrium abundance of the contaminated prey increases. At the same time, the equilibrium abundance of the predator decreases and is also observed by another study <cit.>. That is, contamination affects the predator more than the prey, which releases the contaminated prey from being consumed by the predator, and prey abundance increases. In this case, we observed that uncontaminated prey is in extinction (Figure <ref>). However, after a threshold of the prey contamination, we see the rescue of the uncontaminated prey through transcritical bifurcation. Moving further, we observe that the equilibrium abundance of the contaminated prey and predator decreases while the equilibrium abundance of the uncontaminated prey increases. We also observe the bubbling effect as in the case of low preference for the contaminated prey. Followed by the disappearance of the unstable dynamics, we find bistability between two stable fixed points with one in predator extinction state(see Figure <ref>). Mathematically bistability arises due to saddle-node bifurcation, where the stability of the coexistence equilibrium is lost by colliding with another unstable coexistence equilibrium. The bistability region is from the transcritical point (c=1.103) up to the limit point (c=1.29). In this bi-stability region,  the population will go to the predator extinction equilibrium(PDE) for some initial conditions, while for others, in stable predator existence equilibrium(SC). Ecologically in this region, a considerable perturbation can bring the predator to extinction from the existing state or lead to predator establishment from the extinction state. The threshold density above which the predator can establish the prey's coexistent equilibrium or the critical density below which the predator will go to extinction from the coexistence equilibrium is the allee threshold of the predator <cit.>. \nMoving further, we find the disappearance of the bistable state through the limit point(LP, c=1.29) and the existence of the predator only extinction equilibrium (PDE)(see Figure <ref>) where prey contamination drives predator to the extinction due to reduction of the reproduction(see Figure <ref>). Following the extintion of the predator, both the prey reach to the carrying capacity due to the release from the predation(see Figure <ref>). We observe the region from the second limit point(c=1.84) to the second transcritical point (TB) at(c=2). In this region, two alternative fixed points exist one predator existence and another predator extinction equilibrium. That is, the predator can established to the system in the prey coexistence equilibrium. After the transcritical point, we observe two stable fixed points; in one, contaminated prey exists but the predator is in extinction. While in other, the predator exists, but the contaminant prey is in an extinction state. That is, if the predator is absent in the system and two prey exists, then the predator can established to the system if its density is above some critical density. However, it ultimately brings the contaminant prey to extinction due to apparent competition. On the other hand, if a predator and uncontaminated prey exist in the system, but contaminant prey is absent, contaminant prey can established the system if its density is above a critical density but drives the predator to extinction due to contamination.\nAt the high contaminated prey preference (q=0.85) we see the oscillation of three species(OS) at low contamination. Moving further, we observe that the dynamics become stable through hopf bifurcation (H). Followed by the hopf bifurcation, we see the equilibrium density of the contaminated prey and uncontaminated prey increase, and the equilibrium density of the predator decreases until the system goes to the saddle-node bifurcation where two equilibrium points exist, one is three species stable coexistence (SC) and another is predator extinction equilibrium (PDE). \n\n\n\n\n\n\n §.§ Two Parameter bifurcation diagram\n\nIn order to get insights more to the interplay between predation preference and contamination concentration in prey we perform two parameter bifurcation in bi-parameter space q-c. We also interested in the joint impact of contamination intensity in predator reproduction and the contamination in prey, to investigate it we perform two parameter bifurcation analysis in λ -c plane. The dynamics of the system in different bi-parameter spaces (simultaneous variation of two parameters) would be interesting and may\nreveal rich dynamical behaviors in the system.\n\n\n  §.§.§ Dynamical interplay between predation preference(q) and contamination in prey (c)\n\nIn Figure<ref>, the q-c parameter space  is divided into seven distinct regions of different dynamical behaviours and are separated by lines which represents different types of bifurcation curves. Moving along the contamination axis with low contaminated prey preference we observe the dynamics in region 3 where three species exhibits oscillatory coexistence (OC) and at high contamination the system enter into region 2 where the dynamics become stable through hopf bifurcation. In region 1 the uncontaminated prey become extinct and with contamination the dynamics enter into region 2 through transcritical bifurcation and the uncontaminated prey came back to the system. Further increasing the contamination, the system move from region 2 to region 5 for low contaminated prey preference or in region 4 at moderate contaminated prey preference. In region 5 the contaminated predator become extinct followed by transcritical bifurcation. If the contamination in prey increases further we observe bistability between PDE and CPE in region 6. At high contaminated preference and low or no contamination in prey, we still observe the oscillatory dynamics in region 3, with increasing contamination the dynamics either enter to region 7 through transcritial curve or via region 2 it fall in region 4. In region 7 we see bistability between OC and PDE. At region 4 we observe bistability between SC and PDE.\nWhen contamination of prey is low(c=0.5), moving along the prey preference axis from zero to one we observe the dynamical behaviour fall in region 1, 3. That is, at low contamination contaminated prey preference dose not effect predator persistence. At moderate contamination walking along the prey preference we see the shift of the dynamical behaviour from region 2 to region 4 or region 5 through the transcritical bifurcation curve. This transcritical bifurcation curve is the predator persistence line (red line). In the left hand side of this line the predator always persist but in the right hand side of this line predator dose not persist in some region and conditionally persist in other regions. In this bi-parameter space we also observe Saddle-node Trancritical  interaction point (ST), which have important ecological significance. At this point allee effect despair by colliding the saddle node point (LP) with transcritical point (TB), that is system enter to a smooth extinction state from abrupt extinction state<cit.>. \n\n\n\n\n\n  §.§.§ Dynamical interplay between intensity of contamination in predator reproductionand contamination in prey (c)\n\nTo demonstrate how the intensity of the contamination in predator reproduction and contamination in prey influences prey-predator dynamics, we carried out a two-parameter bifurcation diagram in Figure<ref>. At low contamination, we observe that uncontaminated prey is in an extinction state and contaminated prey and predator stably exist in region 1. Moving along the contamination axis,  we observe that the dynamics enter into region 2 through transcritical bifurcation (TB). In this region, three species coexist in stable equilibrium (SC). We also observe the region 3 surrounded by the Hopf curve of region 2, where three species exhibit unstable dynamics. When the effect of the contamination in predator reproduction is moderate, we observe that the dynamics enter from the region 2 to the region 4 through the Limit point curve. In this region, the model exhibit bi-stable dynamics between predator extinction equilibrium (PDE) and stable coexistence equilibrium (SC). If the severity of the contamination in predator reproduction further increases, the predator can not persist to the system in region 5. \nAt high contamination, if the intensity of the contamination in predator reproduction is low, we observe the extinction of the contaminated prey (CPE) in region 8. Where the region 8 is separated from 2 by the transcritical curve (TB), on the contrary, increasing the intensity of the contamination in predator reproduction, the dynamics can enter into the bi-stable region 6. In this region, the system's dynamics can reach the predator extinction equilibrium (PDE) for some initial conditions while for others, in the contaminated prey equilibrium (CPE).\n\n\n\n\n §.§ Robustness\n\n\n\n  §.§.§ Robustness for other parameter sets\n\nAlong with the above parameter set, we consider two additional parameter sets to ensure that the dynamics we have found are not a particular case. The dynamics in new parameter sets depicted in Figure <ref> The qualitative behavior of this species interaction module is almost identical, except some new regions appear and some previous regions disappear in these new parameter combinations. For instance the three species oscillation region 3 expand in <ref>(a,c) while in <ref>(b,d) is it become more narrow or completely absent as compared to Figure <ref>,<ref>. Further region 7 where we see the bi-stability between PDE and OC is completely absent in Figure <ref>(a,b).\n\n\n\n  §.§.§ Robustness for alternative functional form of prey reproduction and incorporation of contamination induced prey mortality\n\nOur main analysis assumes a nonlinear functional form for the reproduction of contaminated prey with contamination. We relax this assumption by replacing the function 1/1+c with the linear response of contamination max(0,1-c) in prey reproduction. Further, in the primary analysis, we did not assume any contaminated-related death in the contaminated prey. We add the term m_1cx in the equation (2.13) to incorporate contamination-related death of the prey. Where m_1 is the effect of toxin on the mortality, c is the contamination in prey and x is the contaminated prey density. Figure <ref> is the representation of the of the Figure <ref>, Figure <ref> for the parameter set given in the caption of Figure <ref>. We can observe that the qualitative dynamical behavior of the system more or less same with previous assumption.\n\n\n\n\n§ DISCUSSION\n\nMethylmercury (MeHg) was previously thought only to threaten aquatic biota and consumers of aquatic organisms, as aquatic environments provide ideal conditions for the conversion of inorganic mercury to MeHg<cit.>. However, recent studies have found elevated concentrations of MeHg in terrestrial consumers, which seeks special attention in conservation management due to the worldwide decline of insectivores<cit.>. The main reason behind the transfer of aquatic contamination to terrestrial consumers is the predation of emergent aquatic insects <cit.>. It is well known that aquatic prey can negatively affect terrestrial preys<cit.>through the increase of predator density. Furthermore, contamination can also drive insectivores and aquatic prey to the edge of extinction, which may also depend on predation. So, it is necessary to understand how contamination drives these species' dynamics to quantify the risk of contamination more preciously. In connection to this, in this work, we have examined the effect of harmful and beneficial prey associated with contamination on predator persistence. In addition, we also investigate the combined impacts of contamination and indirect competition in the prey-predator dynamics and how ecological and environmental factors shape community stability and species coexistence mechanisms. To do this, we connect the classical apparent competition model<cit.>  with the contamination in one of the prey. Where contamination decreases the reproduction rate of the prey, predator and the predator intake both prey with some preferences. We assume that the predator did not uptake contamination through the environment because here we consider the situation where aquatic insects transport contamination to the terrestrial predator <cit.>. We demonstrate that this ecological model has a rich repertoire of dynamical behaviors, including different species coexistence equilibrium, alternative stable states, and stable limit cycles.\n\n\n §.§ Indirect effect of contamination in uncontaminated prey\n\nWe first consider the case where there is no contamination in the system, and prey-predator dynamics depend upon the predator's preference. We observe the vulnerable region in the one-parameter space where uncontaminated prey can not persist in the system due to apparent competition(see Figure <ref>). Such species extinction due to indirect competition between prey has previously occurred in different studies <cit.>.  Further, we investigate how contamination affects the system when uncontaminated prey is in extinction (see Figure <ref>). We point out that a small amount of contamination is necessary for the three species' coexistence when predation preference is relatively higher toward uncontaminated prey. It occurs because contamination reduces the positive bottom-up effect of contaminated prey on the predator and decreases the predator population. As a result, top-down control on the uncontaminated prey decreases, which initiates its persistence. Thus a small amount of contamination can rescue the alternative prey in indirect competition; in direct competition, such effect is also investigated by <cit.>. Note that, such a strictly positive effect of contamination on alternative uncontaminated prey can be observed if predation preference is high enough towards the alternative prey than the focal prey (see region 1 in Figure<ref>). For instance, <cit.> did not find any significant positive effect of aquatic contamination on terrestrial prey. One reason behind it is that the predator prefers aquatic prey over terrestrial prey. We expect a positive effect of contamination in uncontaminated terrestrial prey where the uncontaminated prey is more depressed by predation due to aquatic subsidiary <cit.>.\n\n\n §.§ contamination can destabilize dynamics and effect of contamination in contaminated prey, predator\n\nPrevious studies reported that contamination stabilizes prey-predator dynamics when prey and predator are exposed simultaneously to a toxin or predator intake toxins through prey only<cit.>. In our study, we also observe that a high level of contamination can stabilize the system. However, when contamination is low on the prey, and the predator has a low or moderate preference for contaminated prey, in that case, contamination can also destabilize prey-predator dynamics(see Figure <ref>, q=0.15,0.5). We also observe that increasing level of contamination drives the predator to catastrophic extinction as reported by other studies <cit.>. Such an abrupt change involves bi-stability,  a slight change in environmental condition can drive the system to an alternative attractor, but to return it to the original state, a more extensive improvement of the environmental condition requires<cit.>.\nInterestingly, when predator consume both preys with equal preference (q=0.5), further increasing the level of contamination generate an alternative stable state at which the predator can persist with its two prey (right yellow region in Figure<ref>, q=0.5). Note that a higher level of contamination always leads to the predator's extinction from its coexistence state due to lower reproduction (see Figure <ref>). However, the predator can establish the two prey coexistence equilibrium if its initial density is above some critical threshold and decrease the density of the contaminated prey at such a critical level that it does not hamper the predator persistence. If the prey's contamination level increases further, predator and contaminated prey cannot coexist due to bi-stability. That is, depending upon the initial condition, either contaminated prey or the predator exists with uncontaminated prey in a stable equilibrium. Previous studies highlight that prey can benefit from contamination as it decreases the predator<cit.>. In our study, we observe that in the presence of alternative uncontaminated prey, the contaminated prey can go to extinction, but the predator can persist in an alternative equilibrium. With this prey extinction, the predator gets its potential reproduction rate with the limited resource (see Figure <ref> upper curve).  \n\n\n §.§ Role of predation preference and sensitivity of predator to contamination in species persistance\n\nPredator preference for contaminated and uncontaminated prey can affect its persistence which can be understood by Figure <ref>. In a more polluted environment, more preference for uncontaminated prey is always beneficial to the predator as it prompts its persistence from any positive initial condition; the regions to the left side of the red line exhibit such behavior in our model. Although predators can exist within the system under more polluted prey preference in region 6 and 4, these are bi-stable regions that do not guarantee predator persistence. It is interesting\nto note that, the region 6 is bounded below by region 5, which indicates that if predation preference for contaminated prey drops below a threshold than the contaminated prey can invade the system and drives the predator to extinction. The fact is, if a predator is initially abundant in the system, then a minimum predation pressure require to inhabit the establishment of the contaminated prey; otherwise, contaminated prey establish to the system and ultimately drives predator to the extinction through the trophic transfer of the contaminates. Note that, this predation pressure can not always inhabit contaminated prey establishment,  if the initial density of the contaminated prey is relatively higher then contaminated prey ultimately establish to the system.  Also note that region 6 also bounded above by region 5, that implies if predation preference for contaminated prey high enough then predator can not exist due to the higher flow of contamination. Figure <ref> unveil that if the effect of contamination in predator reproduction is low, then the existence of the contaminated prey is more hampered than the predator (region 8).  As we assume that there is no contamination-related mortality of the contaminated prey, we can intuitively say this is the combined effect of two mechanisms. First, contamination limits the prey's growth by reducing their reproduction rate thus decreases the flow of toxicity in per-capita predator population. On the other hand, uncontaminated prey maintains predator density; as a result, the top-down pressure on the contaminated prey increases and becomes extinct. Alternatively, we can say this occurs due to the combined effect of contamination and apparent competition<cit.>. Further, we observe that predator can not survive at a moderate level of contamination when the intensity of the contamination in predator reproduction is high 5. However, note that increasing further contamination predator can return to the system in region 6. Intuitively, this occurs because at a moderate level of contamination prey growth does not fall much compared to a high level of contamination; thus, a sufficient amount of contamination can flow to the predator and become a cause of predator extinction. However, if the contamination increases in the prey further and predator is initially abundant to the system, then the prey suffer from extinction risk due to lower reproduction and high predation pressure, as a result the predator can persist in the system.      \n\n\n §.§ Modelling caveats and future direction\n\nOur model includes a number of simplifications; for instance, our study did not incorporate any stage structure of the contaminated prey, although, in reality, aquatic insects are in stage structure. Stage structures are known to affect the prey-predator dynamics in various ways <cit.>. Incorporation of stage structure in this model requires proper knowledge about contamination's effect in different life stages, like the effect of contamination in metamorphosis and stage-specific mortality<cit.>. Further, it will enhance the complexity of the model and parallelly the dynamics. So we restrict our model without any stage structure. Future studies can incorporate it, which may create additional results that are more realistic in the present scenario. Also, our model merges all the contaminated, uncontaminated prey in single variables. However, in reality, a predator can consume more than two prey with specified preferences. In our model, we did not highlight this situation.\nMoreover, contamination-induced behavioral change is another limitation of our study<cit.>. We believe that incorporating these things does not alter our main conclusion. We also assume that terrestrial herbivore prey is totally uncontaminated; a low amount of contamination may present in terrestrial herbivores, which may unlikely affect their growth and the insectivores significantly. For instance, <cit.> find that terrestrial preys of spiders contain around nineteen times less contamination as in aquatic prey and also estimated methylmercury in some terrestrial insects is zero. Further <cit.> also found a significant difference of contamination in terrestrial herbivores and emergent aquatic insects, and some terrestrial insects contain a negligible amount of methylmercury.\nIn summary, our focus was to combine the effect of direct and indirect species interactions, such as predation and apparent competition, and their response to contamination in species dynamics. Our model highlights the significant possibilities through which contamination can affect this type of prey-predator dynamics. For instance, our study predicts that at higher contamination, contaminated prey can alone be the victim of contamination if there is an alternative prey in the system. Our results also predict that the negative effect of aquatic prey on terrestrial prey can be diminished if the aquatic ecosystem holds a small amount of contamination. Further, a predator can sustain in response to highly contaminated prey under more uncontaminated prey preference. Overall, this study may help to understand the ecotoxicological process and its consequence in community dynamics involving direct and indirect species interactions.\n\n\n\n\n\n§ APPENDIX A. POSITIVITY AND BOUNDEDNESS OF THE SOLUTION \n\n\n\n §.§ Appendix A.1. Existence, uniqueness and positive invariance\n\nThe right hand side of the system (2.13-2.15) is continuously differentiable and locally Lipschitz in the first quadrant which implies the existence and uniqueness of\nsolutions for the system in R_+^3. For positive invariance we rewrite the system as:\n\n    dX/dτ=F(X)\n\nWhere X=[x,y,z]^T ∈ R_+^3 and F(X)=[F_1(X),F_2(X),F_3(X)]^T. The solutions of the system remain in the first quadrant for any non-negative initial condition for all τ≥ 0, since F_i(X)|_X_i=0≥ 0 for all X_i=0 where i=1,2,3\n\n\n\n\n §.§ Appendix A.2. Boundedness\n\nLet B(t)=x(t)+y(t)+z(t) and differentiating B once yields\n\n    dB/dt   \n        =x/1+c(1-x)-lqxz/η+qx+(1-q)y+ry(1-y/K)\n        -l(1-q)yz/η+qx+(1-q)y\n       +el max( 0, 1-λ ql xc/η+qx+(1-q)y ) ( qxz+(1-q)yz/η+qx+(1-q)y ) -dz\n       =x/1+c(1-x)+ry(1-y/K)-l(1-e max( 0, 1-λ ql xc/η+qx+(1-q)y )) ( qxz+(1-q)yz/η+qx+(1-q)y ) -dz\n\nSince 1/1+c≤1, 1- emax( 0, 1-λ ql xc/η+qx+(1-q)y ) ≥ 0\n\n    dB/dt≤ x(1-x)+ry(1-y/K) -dz\n\nfor any arbitary positive real number N we get,\n\n    dB/dt+NB ≤ x(1-x)+ry(1-y/K)-dz+N(x+y+z)\n\nTaking N≤ d we get,\n\n    dB/dt+NB ≤ x(1-x+N)+y(r-yr/K+N)\n\nThe maximum values of x(1-x+N), y(r-yr/K+N) are (N+1)^2/4, K(r+N)^2/4r respectively. By letting A=(N+1)^2/4+K(r+N)^2/4r we get\n\n    dB/dt+NB ≤ A\n\nBy diffrential inequality\n\n    0< B(x,y,z)≤A(1-exp(-Nt))/N+B(x(0),y(0),z(0))exp(-Nt)\n\nSo for large values of t we have 0 ≤ B≤A/N. Hence the solution of the system are bounded in the positive quadrant.\n\n\n§ APPENDIX.B. LOCAL STABILITY ANALYSIS OF THE EQUILIBRIUM POINTS\n\nOur model exhibit seven possible equilibrium points E_0=(0,0,0), E_1=(1,0,0), E_2=(0,K,0), E_3=(1,K,0), E_4=(x_4,0,z_4), E_5=(0,y_5,z_5), E_6=(x_6,y_6,z_6). The jacobian matrix at any equilibrium point (x^*,y^*,z^*) is:\n\n    J=\n     [ J_11 J_12 J_13; J_21 J_22 J_23; J_31 J_32 J_33 ]\n\nWhere J_11=∂ dx/∂ x dt|_(x^*,y^*,z^*), J_12=∂ dx/∂ y dt|_(x^*,y^*,z^*), J_13=∂ dx/∂ z dt|_(x^*,y^*,z^*), J_21=∂ dy/∂ x dt|_(x^*,y^*,z^*), J_23=∂ dy/∂ y dt|_(x^*,y^*,z^*), J_23=∂ dy/∂ z dt|_(x^*,y^*,z^*), J_31=∂ dz/∂ x dt|_(x^*,y^*,z^*), J_32=∂ dz/∂ y dt|_(x^*,y^*,z^*), J_33=∂ dz/∂ z dt|_(x^*,y^*,z^*)\n\n    \n  * The jacobian at the trivial equilibrium point (0,0,0) is:\n    \n    J(E_0)=\n        [ 1/1+c     0     0;     0     r     0;     0     0    -d ]\n\n    and the eigenvalues of the Jacobian matrix are\n    1/1+c, r, -d. Since one of the eigenvalues of J(E_0) is positive, so the system at the equilibrium point E_0(0, 0, 0) is always unstable.\n    \n  * The jacobian at E_1 is: \n    \n    J(E_1)=\n        [                      -1/1+c                           0                           0;                           0                           r                           0;                           0                           0 emax(0,1-λ lqc/η+q)ql/η+q-d ]\n\n    Since r is a positive eigenvalue of the jacobian matrix J(E_1), E_1 is unstable.\n    \n    \n  * The jacobian at the equilibrium E_2 is:\n    \n    J(E_2)=\n        [              1/1+c                  0                  0;                  0                 -r                  0;                  0                  0 (1-q)lK/η+(1-q)K-d ]\n\n    The equilibrium E_2 is unstable as 1/1+c is the positive real root of the jacobian.\n    \n    \n  * The jacobian at the equilibrium E_3 is:\n    \n    J(E_3)=\n        [                                             -1/1+c                                                  0                                      lq/η+q+(1-q)K;                                                  0                                                 -r                                                  0;                                                  0                                                  0 emax(0,1-λ lqc/η+q+(1-q)K)ql+(1-q)lK /η+q+(1-q)K-d ]\n\n    As the lower diagonal of the jacobian matrix is zero then the roots are -1/1+c, -r, emax(0,1-λ lqc/η+q+(1-q)K)ql+(1-q)lK/η+q+(1-q)K-d. The first two roots are negative so the stability require that third root to be negative. For λ lqc/η+q+(1-q)K≥ 1 the last root is also negative and the system is stable. If λ lqc/η+q+(1-q)K< 1 then the stability require e(1-λ lqc/η+q+(1-q)K)ql+(1-q)lK/η+q+(1-q)K<d.\n    \n    \n  * The uncontaminated prey extinction equilibrium E_4=(x_4,0,z_4) can be expressed as\n    \n    z_4=(1-x_4)(η+qx_4)/lq(1+c)\n\n    Where x_4 is the positive root of the quadratic equation\n    \n    \n    x_4^2(eq-eλ qc l^2-q^2 d)+x_4(eη ql-2q η d)-d η^2=0\n\n    \n    The equation has atleast one positive real root if:\n    \n    (eη q l-2qη d)^2+4d(eq-eqcl^2-q^2d)≥ 0\n\n    \n    \n    (eη ql-2qη d) <0\n\n    The jacobian atE_4 is,\n    \n    J(E_4)=\n        [ P Q R; 0 S 0; T U 0 ]\n\n    The characteristic equation is \n    \n    (S-E)(E^2-PE-RT)=0\n\n    Where,\n    \n    P=1/1+c-2x_4/1+C-η lqz_4/η+qx_4\n\n    \n    Q=lq(1-q)x_4/η+qx_4\n\n    \n    R=-lqx_4/η+qx_4\n\n    \n    S=-η l(1-q)z_4+lq(1-q)x_4z_4/(η+qx_4)^2\n\n    \n    T=η q z_4/η+qx_4-η q x_4z_4+λη q^2 l c x_4 z_4/(η+qx_4)^3\n\n    E_4 will be stable if P<0 and T>0.\n    \n    \n  * The contaminated prey extinction equilibrium E_5=(0,y_5,z_5) can be write as:\n    \n    z_5=r(K-y)(η+(1-q)y_5)/Kl(1-q)\n\n    Where y_5=dη/(1-q)(e-d), the feasibility of the equilibrium require e>d.\n    The jacobian at E_5 is\n    \n    J(E_5)=\n        [ P 0 0; Q R S; T U 0 ]\n\n    The characteristic equation is \n    \n    (P-E)(E^2-RE-SU)=0\n\n    Where \n    \n    P=1/1+c-η lqz_5/η+(1-q)y_5\n\n    \n    R=r-2y_5r/K-η l (1-q)z_5/(η+(1-q)y_5)^2\n\n    \n    S=-l(1-q)y_5/η+(1-q)y_5\n\n    \n    U=η (1-q)z_5/(η +(1-q)y_5)^2\n\n    Therefore, the  equilibrium will be stable if the coefficients of the characteristic equation\n    satisfy P<0, R>0, SU<0\n    \n    \n  * The coexisting equilibrium E_6=(x_6,y_6,z_6) can be found by solving the non-linear equations\n    \n    1/1+c(1-x_6)-lqz_6/η+qx_6+(1-q)y_6=0\n\n     \n    r(1-y_6/K)-l(1-q)z_6/η+qx_6+(1-q)y_6=0\n\n    \n    el( 1-λ ql x_6c/η+qx_6+(1-q)y_6 ) ( qx_6+(1-q)y_6/η+qx_6+(1-q)y_6 ) -d=0\n\n\n\n\n51\nnatexlab#1#1\n\n\n\n\n\n\n\n\n\n[#1],#1\n[Abrams et al.(1998)Abrams, Holt and Roth]abrams1998apparent\nauthorAbrams, P.A., authorHolt, R.D.,\n  authorRoth, J.D., year1998.\ntitleApparent competition or apparent mutualism? shared\n  predation when populations cycle.\njournalEcology volume79,\n  pages201–212.\n\n[Alves and Hilker(2017)]alves2017hunting\nauthorAlves, M.T., authorHilker, F.M.,\n  year2017.\ntitleHunting cooperation and allee effects in predators.\njournalJournal of theoretical biology\n  volume419, pages13–22.\n\n[Bartrons et al.(2015)Bartrons, Gratton, Spiesman and\n  Vander Zanden]bartrons2015taking\nauthorBartrons, M., authorGratton, C.,\n  authorSpiesman, B.J., authorVander Zanden, M.J.,\n  year2015.\ntitleTaking the trophic bypass: Aquatic-terrestrial\n  linkage reduces methylmercury in a terrestrial food web.\njournalEcological Applications volume25,\n  pages151–159.\n\n[Baudrot et al.(2018)Baudrot, Fritsch, Perasso, Banerjee and\n  Raoul]baudrot2018effects\nauthorBaudrot, V., authorFritsch, C.,\n  authorPerasso, A., authorBanerjee, M.,\n  authorRaoul, F., year2018.\ntitleEffects of contaminants and trophic cascade\n  regulation on food chain stability: Application to cadmium soil pollution on\n  small mammals–raptor systems.\njournalEcological Modelling volume382,\n  pages33–42.\n\n[Baxter et al.(2005)Baxter, Fausch and\n  Carl Saunders]baxter2005tangled\nauthorBaxter, C.V., authorFausch, K.D.,\n  authorCarl Saunders, W., year2005.\ntitleTangled webs: reciprocal flows of invertebrate prey\n  link streams and riparian zones.\njournalFreshwater biology volume50,\n  pages201–220.\n\n[Beketov and Liess(2006)]beketov2006influence\nauthorBeketov, M.A., authorLiess, M.,\n  year2006.\ntitleThe influence of predation on the chronic response of\n  artemia sp. populations to a toxicant.\njournalJournal of Applied Ecology volume43,\n  pages1069–1074.\n\n[Chakraborty and Feudel(2014)]chakraborty2014harmful\nauthorChakraborty, S., authorFeudel, U.,\n  year2014.\ntitleHarmful algal blooms: combining excitability and\n  competition.\njournalTheoretical ecology volume7,\n  pages221–237.\n\n[Cristol et al.(2008)Cristol, Brasso, Condon, Fovargue, Friedman,\n  Hallinger, Monroe and White]cristol2008movement\nauthorCristol, D.A., authorBrasso, R.L.,\n  authorCondon, A.M., authorFovargue, R.E.,\n  authorFriedman, S.L., authorHallinger, K.K.,\n  authorMonroe, A.P., authorWhite, A.E.,\n  year2008.\ntitleThe movement of aquatic mercury through terrestrial\n  food webs.\njournalScience volume320,\n  pages335–335.\n\n[Dhooge et al.(2008)Dhooge, Govaerts, Kuznetsov, Meijer and\n  Sautois]dhooge2008new\nauthorDhooge, A., authorGovaerts, W.,\n  authorKuznetsov, Y.A., authorMeijer, H.G.E.,\n  authorSautois, B., year2008.\ntitleNew features of the software matcont for bifurcation\n  analysis of dynamical systems.\njournalMathematical and Computer Modelling of Dynamical\n  Systems volume14, pages147–175.\n\n[Donohue and Piiroinen(2018)]donohue2018technique\nauthorDonohue, J.G., authorPiiroinen, P.T.,\n  year2018.\ntitleA technique for analysis of density dependence in\n  population models.\njournalTheoretical Ecology volume11,\n  pages465–477.\n\n[Donohue and Piiroinen(2020)]donohue2020normal\nauthorDonohue, J.G., authorPiiroinen, P.T.,\n  year2020.\ntitleNormal-form analysis of the cusp-transcritical\n  interaction: applications in population dynamics.\njournalNonlinear Dynamics volume100,\n  pages1741–1753.\n\n[Faria and da Silveira Costa(2009)]faria2009interplay\nauthorFaria, L.D.B., authorda Silveira Costa, M.I.,\n  year2009.\ntitleThe interplay between predator's prey preference and\n  environmental heterogeneity in food web long-term stability.\njournalJournal of theoretical biology\n  volume258, pages339–343.\n\n[Garay-Narváez et al.(2013)Garay-Narváez, Arim, Flores and\n  Ramos-Jiliberto]garay2013more\nauthorGaray-Narváez, L., authorArim, M.,\n  authorFlores, J.D., authorRamos-Jiliberto, R.,\n  year2013.\ntitleThe more polluted the environment, the more important\n  biodiversity is for food web stability.\njournalOikos volume122,\n  pages1247–1253.\n\n[Garay-Narváez et al.(2014)Garay-Narváez, Flores, Arim and\n  Ramos-Jiliberto]garay2014food\nauthorGaray-Narváez, L., authorFlores, J.D.,\n  authorArim, M., authorRamos-Jiliberto, R.,\n  year2014.\ntitleFood web modularity and biodiversity promote species\n  persistence in polluted environments.\njournalOikos volume123,\n  pages583–588.\n\n[Hall et al.(2008)Hall, Aiken, Krabbenhoft, Marvin-DiPasquale and\n  Swarzenski]hall2008wetlands\nauthorHall, B., authorAiken, G.,\n  authorKrabbenhoft, D., authorMarvin-DiPasquale, M.,\n  authorSwarzenski, C., year2008.\ntitleWetlands as principal zones of methylmercury\n  production in southern louisiana and the gulf of mexico region.\njournalEnvironmental Pollution volume154,\n  pages124–134.\n\n[Hallam et al.(1983)Hallam, Clark and Lassiter]hallam1983effects\nauthorHallam, T., authorClark, C.,\n  authorLassiter, R., year1983.\ntitleEffects of toxicants on populations: a qualitative\n  approach i. equilibrium environmental exposure.\njournalEcological Modelling volume18,\n  pages291–304.\n\n[Hallinger et al.(2011)Hallinger, Cornell, Brasso and\n  Cristol]hallinger2011mercury\nauthorHallinger, K.K., authorCornell, K.L.,\n  authorBrasso, R.L., authorCristol, D.A.,\n  year2011.\ntitleMercury exposure and survival in free-living tree\n  swallows (tachycineta bicolor).\njournalEcotoxicology volume20,\n  pages39–46.\n\n[Henschel et al.(2001)Henschel, Mahsberg and\n  Stumpf]henschel2001allochthonous\nauthorHenschel, J.R., authorMahsberg, D.,\n  authorStumpf, H., year2001.\ntitleAllochthonous aquatic insects increase predation and\n  decrease herbivory in river shore food webs.\njournalOikos volume93,\n  pages429–438.\n\n[Holt(1977)]holt1977predation\nauthorHolt, R.D., year1977.\ntitlePredation, apparent competition, and the structure of\n  prey communities.\njournalTheoretical population biology\n  volume12, pages197–229.\n\n[Holt and Bonsall(2017)]holt2017apparent\nauthorHolt, R.D., authorBonsall, M.B.,\n  year2017.\ntitleApparent competition.\njournalAnnual Review of Ecology, Evolution, and\n  Systematics volume48, pages447–471.\n\n[Hooper et al.(2012)Hooper, Adair, Cardinale, Byrnes, Hungate,\n  Matulich, Gonzalez, Duffy, Gamfeldt and O’Connor]hooper2012global\nauthorHooper, D.U., authorAdair, E.C.,\n  authorCardinale, B.J., authorByrnes, J.E.,\n  authorHungate, B.A., authorMatulich, K.L.,\n  authorGonzalez, A., authorDuffy, J.E.,\n  authorGamfeldt, L., authorO’Connor, M.I.,\n  year2012.\ntitleA global synthesis reveals biodiversity loss as a\n  major driver of ecosystem change.\njournalNature volume486,\n  pages105–108.\n\n[Huang et al.(2015)Huang, Wang and Lewis]huang2015impact\nauthorHuang, Q., authorWang, H.,\n  authorLewis, M.A., year2015.\ntitleThe impact of environmental toxins on predator–prey\n  dynamics.\njournalJournal of theoretical biology\n  volume378, pages12–30.\n\n[Jackson et al.(2021)Jackson, Eagles-Smith and\n  Robinson]jackson2021differential\nauthorJackson, A.K., authorEagles-Smith, C.A.,\n  authorRobinson, W.D., year2021.\ntitleDifferential reliance on aquatic prey subsidies\n  influences mercury exposure in riparian arachnids and songbirds.\njournalEcology and Evolution volume11,\n  pages7003–7017.\n\n[Jackson et al.(2011)Jackson, Evers, Etterson, Condon, Folsom,\n  Detweiler, Schmerfeld and Cristol]jackson2011mercury\nauthorJackson, A.K., authorEvers, D.C.,\n  authorEtterson, M.A., authorCondon, A.M.,\n  authorFolsom, S.B., authorDetweiler, J.,\n  authorSchmerfeld, J., authorCristol, D.A.,\n  year2011.\ntitleMercury exposure affects the reproductive success of\n  a free-living terrestrial songbird, the carolina wren (thryothorus\n  ludovicianus).\njournalThe Auk volume128,\n  pages759–769.\n\n[Kooi et al.(2008)Kooi, Bontje, Van Voorn and\n  Kooijman]kooi2008sublethal\nauthorKooi, B., authorBontje, D.,\n  authorVan Voorn, G., authorKooijman, S.,\n  year2008.\ntitleSublethal toxic effects in a simple aquatic food\n  chain.\njournalEcological Modelling volume212,\n  pages304–318.\n\n[van Kooten et al.(2005)van Kooten, de Roos and\n  Persson]van2005bistability\nauthorvan Kooten, T., authorde Roos, A.M.,\n  authorPersson, L., year2005.\ntitleBistability and an allee effect as emergent\n  consequences of stage-specific predation.\njournalJournal of Theoretical Biology\n  volume237, pages67–74.\n\n[Kraus(2019)]kraus2019contaminants\nauthorKraus, J.M., year2019.\ntitleContaminants in linked aquatic–terrestrial\n  ecosystems: Predicting effects of aquatic pollution on adult aquatic insects\n  and terrestrial insectivores.\njournalFreshwater Science volume38,\n  pages919–927.\n\n[Lindmark et al.(2019)Lindmark, Ohlberger, Huss and\n  Gårdmark]lindmark2019size\nauthorLindmark, M., authorOhlberger, J.,\n  authorHuss, M., authorGårdmark, A.,\n  year2019.\ntitleSize-based ecological interactions drive food web\n  responses to climate warming.\njournalEcology Letters volume22,\n  pages778–786.\n\n[Liz and Ruiz-Herrera(2012)]liz2012hydra\nauthorLiz, E., authorRuiz-Herrera, A.,\n  year2012.\ntitleThe hydra effect, bubbles, and chaos in a simple\n  discrete population model with constant effort harvesting.\njournalJournal of mathematical biology\n  volume65, pages997–1016.\n\n[Luoma and Rainbow(2005)]luoma2005metal\nauthorLuoma, S.N., authorRainbow, P.S.,\n  year2005.\ntitleWhy is metal bioaccumulation so variable? biodynamics\n  as a unifying concept.\njournalEnvironmental Science & Technology\n  volume39, pages1921–1931.\n\n[Manning and Sullivan(2021)]manning2021conservation\nauthorManning, D.W., authorSullivan, S.M.P.,\n  year2021.\ntitleConservation across aquatic-terrestrial boundaries:\n  Linking continental-scale water quality to emergent aquatic insects and\n  declining aerial insectivorous birds.\njournalFrontiers in Ecology and Evolution\n  volume9, pages633160.\n\n[Marcarelli et al.(2011)Marcarelli, Baxter, Mineau and\n  Hall Jr]marcarelli2011quantity\nauthorMarcarelli, A.M., authorBaxter, C.V.,\n  authorMineau, M.M., authorHall Jr, R.O.,\n  year2011.\ntitleQuantity and quality: unifying food web and ecosystem\n  perspectives on the role of resource subsidies in freshwaters.\njournalEcology volume92,\n  pages1215–1225.\n\n[Murakami and Nakano(2002)]murakami2002indirect\nauthorMurakami, M., authorNakano, S.,\n  year2002.\ntitleIndirect effect of aquatic insect emergence on a\n  terrestrial insect population through by birds predation.\njournalEcology Letters volume5,\n  pages333–337.\n\n[Nelson(2005)]nelson2005drivers\nauthorNelson, G.C., year2005.\ntitleDrivers of ecosystem change: summary chapter.\njournalEcosystems .\n\n[Ortega-Rodriguez et al.(2019)Ortega-Rodriguez, Chumchal, Drenner,\n  Kennedy, Nowlin, Barst, Polk, Hall, Williams, Lauck\n  et al.]ortega2019relationship\nauthorOrtega-Rodriguez, C.L., authorChumchal, M.M.,\n  authorDrenner, R.W., authorKennedy, J.H.,\n  authorNowlin, W.H., authorBarst, B.D.,\n  authorPolk, D.K., authorHall, M.N.,\n  authorWilliams, E.B., authorLauck, K.C., et al.,\n  year2019.\ntitleRelationship between methylmercury contamination and\n  proportion of aquatic and terrestrial prey in diets of shoreline spiders.\njournalEnvironmental Toxicology and Chemistry\n  volume38, pages2503–2508.\n\n[Paetzold et al.(2011)Paetzold, Smith, Warren and\n  Maltby]paetzold2011environmental\nauthorPaetzold, A., authorSmith, M.,\n  authorWarren, P.H., authorMaltby, L.,\n  year2011.\ntitleEnvironmental impact propagated by cross-system\n  subsidy: Chronic stream pollution controls riparian spider populations.\njournalEcology volume92,\n  pages1711–1716.\n\n[Palma et al.(2005)Palma, Beja, Tavares and\n  Monteiro]palma2005spatial\nauthorPalma, L., authorBeja, P.,\n  authorTavares, P.C., authorMonteiro, L.R.,\n  year2005.\ntitleSpatial variation of mercury levels in nesting\n  bonelli's eagles from southwest portugal: effects of diet composition and\n  prey contamination.\njournalEnvironmental Pollution volume134,\n  pages549–557.\n\n[Polis et al.(1997)Polis, Anderson and Holt]polis1997toward\nauthorPolis, G.A., authorAnderson, W.B.,\n  authorHolt, R.D., year1997.\ntitleToward an integration of landscape and food web\n  ecology: the dynamics of spatially subsidized food webs.\njournalAnnual review of ecology and systematics ,\n  pages289–316.\n\n[Prosnier et al.(2015)Prosnier, Loreau and\n  Hulot]prosnier2015modeling\nauthorProsnier, L., authorLoreau, M.,\n  authorHulot, F.D., year2015.\ntitleModeling the direct and indirect effects of copper on\n  phytoplankton–zooplankton interactions.\njournalAquatic toxicology volume162,\n  pages73–81.\n\n[Saaristo et al.(2018)Saaristo, Brodin, Balshine, Bertram, Brooks,\n  Ehlman, McCallum, Sih, Sundin, Wong et al.]saaristo2018direct\nauthorSaaristo, M., authorBrodin, T.,\n  authorBalshine, S., authorBertram, M.G.,\n  authorBrooks, B.W., authorEhlman, S.M.,\n  authorMcCallum, E.S., authorSih, A.,\n  authorSundin, J., authorWong, B.B., et al.,\n  year2018.\ntitleDirect and indirect effects of chemical contaminants\n  on the behaviour, ecology and evolution of wildlife.\njournalProceedings of the Royal Society B\n  volume285, pages20181297.\n\n[Scheffer et al.(1993)Scheffer, Hosper, Meijer, Moss and\n  Jeppesen]scheffer1993alternative\nauthorScheffer, M., authorHosper, S.H.,\n  authorMeijer, M.L., authorMoss, B.,\n  authorJeppesen, E., year1993.\ntitleAlternative equilibria in shallow lakes.\njournalTrends in ecology & evolution\n  volume8, pages275–279.\n\n[Schiesari et al.(2018)Schiesari, Leibold and\n  Burton Jr]schiesari2018metacommunities\nauthorSchiesari, L., authorLeibold, M.A.,\n  authorBurton Jr, G.A., year2018.\ntitleMetacommunities, metaecosystems and the environmental\n  fate of chemical contaminants.\njournalJournal of applied ecology volume55,\n  pages1553–1563.\n\n[Selin et al.(2009)]selin2009global\nauthorSelin, N.E., et al., year2009.\ntitleGlobal biogeochemical cycling of mercury: a review.\njournalAnnual review of environment and resources\n  volume34, pages43–63.\n\n[Shan and Huang(2019)]shan2019direct\nauthorShan, C., authorHuang, Q., year2019.\ntitleDirect and indirect effects of toxins on competition\n  dynamics of species in an aquatic environment.\njournalJournal of Mathematical Biology\n  volume78, pages739–766.\n\n[Tweedy et al.(2013)Tweedy, Drenner, Chumchal and\n  Kennedy]tweedy2013effects\nauthorTweedy, B.N., authorDrenner, R.W.,\n  authorChumchal, M.M., authorKennedy, J.H.,\n  year2013.\ntitleEffects of fish on emergent insect-mediated flux of\n  methyl mercury across a gradient of contamination.\njournalEnvironmental science & technology\n  volume47, pages1614–1619.\n\n[van Veen and Hoti(2019)]van2019automatic\nauthorvan Veen, L., authorHoti, M.,\n  year2019.\ntitleAutomatic detection of saddle-node–transcritical\n  interactions.\njournalInternational Journal of Bifurcation and Chaos\n  volume29, pages1950104.\n\n[Veltman et al.(2008)Veltman, Huijbregts and\n  Hendriks]veltman2008cadmium\nauthorVeltman, K., authorHuijbregts, M.A.,\n  authorHendriks, A.J., year2008.\ntitleCadmium bioaccumulation factors for terrestrial\n  species: Application of the mechanistic bioaccumulation model omega to\n  explain field data.\njournalScience of the total environment\n  volume406, pages413–418.\n\n[Wesner et al.(2014)Wesner, Kraus, Schmidt, Walters and\n  Clements]wesner2014metamorphosis\nauthorWesner, J.S., authorKraus, J.M.,\n  authorSchmidt, T.S., authorWalters, D.M.,\n  authorClements, W.H., year2014.\ntitleMetamorphosis enhances the effects of metal exposure\n  on the mayfly, centroptilum triangulifer.\njournalEnvironmental Science & Technology\n  volume48, pages10415–10422.\n\n[Wolfe et al.(1998)Wolfe, Schwarzbach and Sulaiman]wolfe1998effects\nauthorWolfe, M.F., authorSchwarzbach, S.,\n  authorSulaiman, R.A., year1998.\ntitleEffects of mercury on wildlife: a comprehensive\n  review.\njournalEnvironmental Toxicology and Chemistry: An\n  International Journal volume17, pages146–160.\n\n[Wu et al.(2016)Wu, Cobbina, Mao, Xu, Zhang and Yang]wu2016review\nauthorWu, X., authorCobbina, S.J.,\n  authorMao, G., authorXu, H., authorZhang,\n  Z., authorYang, L., year2016.\ntitleA review of toxicity and mechanisms of individual and\n  mixtures of heavy metals in the environment.\njournalEnvironmental Science and Pollution Research\n  volume23, pages8244–8259.\n\n[Zhien et al.(1990)Zhien, Guirong and Wendi]zhien1990persistence\nauthorZhien, M., authorGuirong, C.,\n  authorWendi, W., year1990.\ntitlePersistence and extinction of a population in a\n  polluted environment.\njournalMathematical Biosciences volume101,\n  pages75–97.\n\n\n\n \n"}