{"entry_id": "http://arxiv.org/abs/2303.07249v1", "published": "20230313162238", "title": "The $CFK^\\infty$ Type of Almost L-space Knots", "authors": ["Fraser Binns"], "primary_category": "math.GT", "categories": ["math.GT", "57K18"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nL>l<#1\nmathbb #1AMSa\"39metatheoremMetatheorem[section]\ntheoremTheorem[section]\nlemma[theorem]Lemmametalemma[theorem]Metalemmacorollary[theorem]Corollaryconjecture[theorem]Conjectureproposition[theorem]Propositiondefinitiondefinition [theorem] Definitionclaim[theorem]Claimexample [theorem] Exampleremark [theorem] Remarkquestion [theorem] Questionconstruction [theorem] Constuctionthm[theorem]Theoremprop[theorem]Propositionlem[theorem]Lemmacor[theorem]Corollarydefinitionrem[theorem]Remarkdefin[theorem]Definition1Department of Mathematics, Boston Collegebinnsf@bc.eduThe ^∞ type of Almost L-space knots\n    Fraser Binns\n    March 30, 2023\n===================================\n\n\n    Heegaard Floer homology and knot Floer homology are powerful invariants of 3-manifolds and links respectively. L-space knots are knots which admit Dehn surgeries to 3-manifolds with Heegaard Floer homology of minimal rank. In this paper we study almost L-space knots, which are knots admitting large Dehn surgeries to 3-manifolds with Heegaard Floer homology of next-to-minimal rank. Our main result is a classification of the ^∞(-) type of almost L-space knots. As corollaries we show that almost L-space knots satisfy various topological properties, including some given by Baldwin-Sivek <cit.>. We also give some new cable link detection results.\n\n\n§ INTRODUCTION\n\n\nHeegaard Floer homology is a package of invariants in low dimensional topology due to Ozsváth-Szabó <cit.>. We will be interested in the 3-manifold invariant, which is due to Ozsváth-Szabó <cit.>, and the knot invariant which is due independently to Ozsváth-Szabó <cit.> and J.Rasmussen <cit.>. The three manifold invariant, denoted (-), satisfies the following rank inequality;\n\n\n    ((Y))≥ |H_1(Y;)|\n\n\nHere Y is a rational homology sphere and |H_1(Y;)| is the number of elements in H_1(Y;). This equation results from the fact that an appropriate decatigorification of (Y) yields |H_1(Y;)|. An L-space is a rational homology sphere for which inequality <ref> is tight. Understanding the geometric and algebraic properties of L-spaces is of central interest in low dimensional topology and the subject of Boyer-Gordon-Watson's “L-space conjecture\" <cit.>.\n\n\nDehn-surgery is a well studied operation on 3-manifolds. Let q∈ and K be a knot in S^3. q-surgery on K, denoted S^3_q(K), is the manifold obtained by removing a tubular neighborhood of K from S^3, then regluing it with framing determined by q. An L-space knot is a knot K for which S^3_n(K) is an L-space for for some n∈^≥ 0. The knot Floer homology of L-space knots is well understood, by work of Ozsváth-Szabó <cit.>.\n\nIn this paper we will study almost L-space knots. The following definitions are due to Baldwin-Sivek <cit.>.\n\n\nLet Y be a rational homology sphere. We call Y an almost L-space if ((Y))=|H_1(Y;)|+2.\n\n\nWe note that there is no rational homology sphere with ((Y))=|H_1(Y;)|+1, as the decatigorification from (Y) to |H_1(Y;)| respects parity. Almost L-spaces are thus the rational homology spheres for which  inequality <ref> is “almost tight\". There is a question of whether or not this is quite the “correct\" definition for almost L-spaces. See Section <ref> for some discussion.\n\n\n\n<cit.>\nA knot K in S^3 is called an almost L-space knot if there exists an n≥ 2g(K)-1 such that ((S^3_n(K)))=n+2.\n\n\nAs we will see, there are a number of equivalent definitions of almost L-space knots. The reason to include the condition n≥ 2g(K)-1 is that if K is an L-space knot then ((S^3_2g(K)-2(K)))=2g(K).\n\nWe turn our attention now to knot Floer homology. The strongest version of knot Floer homology is the filtered chain homotopy type of a chain complex ^∞(-). This is a finitely generated chain complex over [U,U^-1] equipped with two gradings; the U grading and the Alexander grading.  Our main result is a classification of ^∞(-) for almost L-space knots;\n\n\n\nLet K be an almost L-space knot. Then ^∞(K) has the filtered chain homotopy type of one of the following complexes;\n  *  A staircase complex direct sum a box complex.\n    \n  *  An almost staircase complex.\n\n\nThe definitions of the complexes referred to in this theorem are deferred to Section <ref>. They are illustrated, however, in Figures <ref>, <ref>, <ref> and <ref>.\n\n\nWe note in contrast that an L-space knot has ^∞ given by a staircase complex, as proven by Ozsváth-Szabó <cit.>.\n\n\nIt is straightforward to construct examples of almost L-space knots with ^∞(-) of type 2 by taking (2,2g(K)-3)-cables of L-space knots. Examples of knots with ^∞ of type 1 include the figure eight, the mirror of 5_2, T(2,3)# T(2,3), 10_139, and 12n_725. There are many almost staircase complexes which do not arise as the complexes of (2,2g(K)-3)-cables of L-space knots or as box plus staircase complexes. The author is unaware if any such complex arises as ^∞(K) for some K. Indeed, the author is likewise unaware of a classification of staircase complexes realised as ^∞(K) for some K.\n\n\nWe prove Theorem <ref> by adapting the techniques Ozsváth-Szabó use in classifying the ^∞ type of L-space knots. With Theorem <ref> at hand we can obtain the following result;\n\n*stabilityProposition <ref>\nLet K be a knot of genus g. K is an almost L-space knot if and only if ((S^3_p/q(K)))=p+2q for all p/q≥ 2g-1.\n\n\nThis is an analogue of the result that if K is a knot of genus g then K is an L-space knot if and only if ((S^3_p/q(K)))=p for all p/q≥ 2g-1. We prove this result with the aid of Hansleman-Rasmussen-Watson's immersed curve interpretation of the surgery formula in bordered Floer homology <cit.>.\n\n^∞(-) comes equipped with a grading called the Maslov grading. The differential lowers the Maslov grading by 1 while the U action decreases it by 2. There is a weaker version of ^∞(K), denoted (K), that carries only a Maslov grading and an Alexander grading. Theorem <ref> can be sharpened somewhat via the following proposition;\n\n\n*prop:delta0Proposition <ref>\n\\beginprop:delta0\n  Suppose K is an almost L-space knot with the ^∞ type of a box plus staircase complex. Then (K,0) is supported in a single Maslov grading.\n\\endprop:delta0\n\n This proposition is proven using involutive knot Floer homology <cit.> and Sarkar's basepoint moving map <cit.>. This result can perhaps be though of as a relative version of a result of Hanselman-Kutluhan-Lidman concerning the geography problem for ^+(Y,𝔰)– another version of Heegaard Floer homology – for 𝔰 a self conjugate spin^c structure, with (Y,𝔰) of next to minimal rank <cit.>.\n\n\nA number of topological properties of L-space knots can be deduced from the classification of their ^∞-type – for example that they are strongly-quasi-positive and fibered. Likewise Theorem <ref> allows us to show that almost L-space knots satisfy or almost satisfy various strong topological properties.\n\n*genus1classCorollary <ref>[<cit.>]\nSuppose K is a genus one almost L-space knot. Then K is T(2,-3), the figure eight knot or  the mirror of the knot 5_2.\n\n\nThis result is the analogue of the fact that the only genus one L-space knot is T(2,3).\n\n*compCorollary <ref>\nThe only composite almost L-space knot is T(2,3)# T(2,3).\n\n\nThis is the analogue of Baldwin-Vela-Vick's result that L-space knots are prime <cit.>*fiberedCorollary <ref>[<cit.>]\nThe mirror of 5_2 is the only almost L-space knot which is not fibered.\n\n\nThis is the analogue of the fact that L-space knots are fibered.\n\n\n*taukCorollary <ref>\nSuppose K is an almost L-space knot for which |τ(K)|< g_3(K). Then K is the figure eight knot.\n\n\nHere τ(-) is a knot invariant due to Ozsváth-Szabó <cit.>. Note that |τ(K)|≤ g_3(K) for all K. This result is the analogue of the fact that for L-space knots K, τ(K)=g_3(K).\n\n      The only almost L-space knots that are not strongly quasi-positive are the figure eight knot and the left handed trefoil.\n\n\nThis is the analogue of the fact that L-space knots are strongly quasi-positive.\n\n\nIn a different direction, Theorem <ref> allows us to recover a result of Hedden;\n\n*HeddCorollary <ref>[<cit.>]\n    Suppose K is a knot and ((K_n))=n+2. Then K is a non-trivial L-space knot and n=2g(K)-1.\n\n\nHere K_n indicates the core of n-surgery on K. We again prove this with the aid of Hanselman-Rasmussen-Watson's immersed curve invariant. From here we can obtain some link detection results for cables of L-space knots using the same arguments as were used by the author and Dey for similar purposes in <cit.>. Let K_p,q denote the (p,q)-cable of K. Here p indicates the longitudinal wrapping number while q indicates the meridional wrapping number. We have the following;\n\n\n*HFKcablesProposition <ref>\n\n      Suppose K is an L-space knot. If a 2-component link L satisfies (L)≅(K_2,4g(K)-2). Then L is a (2,4g(K)-2)-cable of an L-space knot K' such that (K')≅(K).\n \n\n\nHere we orient (2,2n)-cables as the boundary of annuli. Moreover we have a stronger result for link Floer homology, an invariant due to Ozsváth-Szabó <cit.>;\n\n \n*HFLcablesProposition <ref>\n    \n    Suppose K is a L-space knot and L satisfies (L)≅(K_m,2mg(K)-m). Then L is a (m,2mg(K)-m)-cable of an L-space knot K' with (K')≅(K).\n\n\nIn fact, the conclusion that K' is an L-space knot in the above two Propositions follows from the fact that (K)≅(K'), as is also true for the corresponding results in <cit.>. This observation follows either from examining the immersed curve invariant or a result of Lidman-Moore-Zibrowius <cit.>.\n\nAs a corollary we have the following detection results;\n\n    Knot Floer homology detects T(2,3)_2,2 and T(2,5)_2,6 amongst two component links.\n\nHere these two links are again oriented as the boundary of annuli. The corresponding result for Link Floer homology is the following;\n\nLink Floer homology detects  T(2,3)_m,2m and T(2,5)_m,6m.\n\n\nNote that T(2,3) and T(2,5) are L-space knots. The above two results thus follow directly from Propositions <ref> and  <ref>, Ghiggini's result that knot Floer homology detects T(2,3) <cit.>, and Farber-Reinoso-Wang's result that knot Floer homology detects T(2,5) <cit.>.\n\nWe also give a characterization of links with the same link Floer homology type as the (m,mn)-cables of almost L-space knots for large n, generalizing work of the author and Dey <cit.>;\n\n*almostLspacecablesProposition <ref>\n  Let K be an almost L-space knot.  Suppose L is a link such that (L)≅(K_m,mn) with m>2g(K)-1. Then L is the (m,mn)-cable of an almost L-space knot K' such that (K')≅(K).\n\n\n\nBy combining the above result and Corolllary <ref> we can also deduce the following;\n\n*genus1almostLspacecablesProposition <ref>\n    Link Floer homology detects the (m,mn)-cables of T(2,-3), the figure eight knot and the mirror of 5_2 for n>1.\n\n\nWe conclude this introduction with some questions;\n\n\nIs there a version of the L-space conjecture for almost L-spaces?\n\n\nThe L-space conjecture posits an equivalent characterization of L-spaces in terms of both an orderability condition on their fundamental groups, and whether or not they admit taut foliations <cit.>.\n\nGiven a property that L-space knots exhibit, it is natural to ask if almost L-space knots too exhibit that property. For example, L-space knots do not have essential Conway spheres by a result of Lidman-Moore-Zibrowius <cit.>, so it is natural to ask the following;\n\n\n    Do almost L-space knots have essential Conway spheres?\n\n\n\nThis paper is organised as follows. In Section <ref> we review aspects of the Heegaard Floer homology package relevant to subsequent sections. In Section <ref> we give some alternate characterizations of almost L-spaces and prove Proposition <ref> and Proposition <ref>. In Sections <ref>, <ref>, and <ref> we prove Theorem <ref>. In Section <ref> we give the applications.\n\n\n\n §.§ Acknowledgements\n\nThe author would like to thank his advisor John Baldwin for numerous helpful conversations as well as Jen Hom, Mihai Marian, Allison Moore and Liam Watson. He would like to thank Subhankar Dey and Duncan McCoy for some useful comments on an earlier draft. He is especially grateful to Hugo Zhou for explaining how to understand a key step in Section <ref>, as well as Francesco Lin for drawing his attention to Hanselman-Lidman-Kutluhan's result <cit.>, which lead him to the proof of Proposition <ref>.\n\n\n\n§ A REVIEW OF HEEGAARD FLOER HOMOLOGY\n\n\nIn this section we review background material on Heegaard Floer homology with an emphasis on aspects of the theory which will play a role in subsequent sections.\n\n\n\n\n §.§ Heegaard Floer homology for closed 3-manifolds\nHeegaard Floer homology, denoted (-), is an invariant of three manifolds due to Ozsváth-Szabó. It is defined using Heegaard diagrams, symplectic topology and analysis <cit.>. It can be defined with integer coefficients but we will take coefficients in /2 throughout this paper. (Y) splits as a direct sum over equivalence classes of non-vanishing vector fields on Y called ^c-structures. Let Y be a rational homology sphere. There is a non-canonical bijection between the set of ^c-structures on Y and H_1(Y;). Suppose Y is given by performing n-surgery on a knot K in S^3. Then K determines a canonical bijection between ^c(Y) and /n≅ H_1(Y;) as follows. Observe that the trace of n surgery, X_n(K), gives a cobordism from S^3_n(K) to S^3. Fix a Seifert surface Σ for K. Consider the surface Σ obtained by capping off Σ in X_n(K). Suppose 𝔰 is a ^c structure over S^3_n(K) that admits an extension 𝔱 over X_n(K) with the property that ⟨ c_1(𝔱),[Σ]⟩ -n≡ 2i2n. Then the map 𝔰↦ i is an isomorphism by a result of Ozsváth-Szabó <cit.>.\n\n\n \n\n §.§ Knot Floer homology\n\n There is a version of Heegaard Floer homology for knots in S^3 called knot Floer homology. This invariant is due independently to Ozsváth-Szabó <cit.> and J. Rasmussen <cit.>. The strongest version of knot Floer homology is denoted ^∞(-). This form of the invariant takes value in the category of finitely generated filtered chain complexes of [U,U^-1]-modules up to filtered chain homotopy equivalence. We will often conflate the ^∞-type of such a complex and the associated graded equiped with the induced differential. These complexes carry a grading called the Maslov grading. The U action lowers the Maslov grading by 2, and induces another grading on ^∞(-), called the U grading. The subcomplex generated by generators of U-grading 0 is denoted (K), and has homology denoted by (K). The other grading is called the Alexander grading.\n\n\n  Ozsváth-Szabó showed that ^∞(K) determines (S^3_q(K)) for all q∈ <cit.>.\n\n\n  \n\n §.§ Chain Complexes for almost L-space knots\n\n\n  Theorem <ref> states that the chain complexes of almost L-space knot admit particularly simple models. That is, there exist particularly simple models of their chain homotopy type. Throughout this paper we shall use i to indicate the U-grading on ^∞ and j to indicate the Alexander grading. To make the statement of Theorem <ref> we need the following definitions;\n \n\nA staircase complex is a set of generators { x_i}_1≤ i ≤ N∪{ y_i}_1≤ i ≤ N+1 where N∈^≥ 0 such that x_i and y_i only differ in i coordinate while x_i and y_i+1 only differ in j coordinate, and the non-trivial differentials are given by ∂ x_i = y_i + y_i+1 for 1≤ i≤ N.\n\nAn example of such a complex is shown in Figure <ref>.\n\n\n   Let N∈^≥ 0. A type 1 almost staircase complex is a complex admitting a basis {x_i}_0<|i|≤ N+1∪{y_i}_0< |i|≤ N∪{z} such that;\n  * x_i and y_i-1 only differ in i coordinate while x_i and y_i only differ in j coordinate.\n  \n       \n  *  Suppose x_-1 is of bigrading (a,b). Then z is of bigrading (a-1,b) and x_1 is of bigrading (a-1,b+1).\n\n       \n  *    The non-trivial components of the differential are given by; \n  * ∂ y_i = x_i + x_i+1 for i≠±1,\n           \n  * ∂ y_±1=x_± 2+x_1+x_-1,\n           \n  * ∂ x_±1=z.\n        \n       \nAn example of such a complex is shown in Figure <ref>. The N=0 case corresponds to the case of the left handed trefoil.\n   \n\n   Let N∈^≥ 1. A type 2 almost staircase complex is a complex admitting a basis {x_i}_0<|i|≤ N∪{y_i}_0<|i|≤ N∪{z} such that;\n  *  For i<0x_i and y_i only differ in i coordinate while x_i-1 and y_i only differ in j coordinate. For i>0x_i and y_i only differ in j coordinate while x_i and y_i+1 only differ in i coordinate\n       \n  *  Suppose y_-1 is of bigrading (a,b). Then z is of bigrading (a,b+1) and y_1 is of bigrading (a-1,b+1).\n\n       \n  *   The non-trivial components of the differential are given by; \n  * ∂ y_i = x_i + x_i+1 for i<0,\n           \n  * ∂ y_i = x_i + x_i-1 for i>0,\n           \n  * ∂ y_± 1=x_-1+x_1,\n           \n  * ∂ z=y_0+y_1.\n        \n       \nAn example of such a complex is shown in Figure <ref>. Almost staircases of type 1 arise as (2,2g(K)-3)-cables of L-space knots while almost staircase complexes of type 2 do not. This can be deduced using Hanselman-Watson's cabling formula for knot Floer homology in terms of immersed curves <cit.>. Indeed, the author is unaware of examples of almost staircase complexes of type 2 which arise as the knot Floer homology of some knot.\n\n\n\n    \n\nA box complex is a complex with of generators x_3,x_4,x_1,x_2 with coordinates (0,0), (0,1), (1,0) and (1,1) respectively, up to overall shift in bigrading,  differentials given by;\n  * ∂ x_2 = x_1 + x_4\n  * ∂ x_2 = ∂ x_4 = x_3.\n    \n  * 0 otherwise.\n\nAn example of such a complex is shown in Figure <ref>. With these definitions at hand, the statement of Theorem <ref> is made rigorous. We note however that there is a degree of overlap between complexes of type one and complexes of type two in the statement of Theorem <ref>. Namely, in light of Proposition <ref>, box plus staircase complexes for knots K with ((K,1))=2 can arise as almost staircase complexes. Note that the mirror of 5_2, T(2,3)#T(2,3), 10_139 and 12n_725 all satisfy this property.\n\n\n\n\n\n§ SOME REMARKS ON ALMOST L-SPACES AND ALMOST L-SPACE KNOTS\n\n\n\nIn this section we give some equivalent definitions of almost L-spaces and almost L space knots.\n\nFirst we give a definition of almost L-spaces in terms of of ^+\nLet Y be a rational homology sphere. The following conditions are equivalent;\n\n  * Y is an almost L-space.\n    \n  * ((Y,𝔰))=1 aside from for a unique ^c structure 𝔰_0 for which ((Y,𝔰_0))=3.\n    \n  * ^+(Y,𝔰)≅τ^+ aside from in a unique ^c structure 𝔰_0 for which ^+(Y,𝔰_0)≅τ^+⊕[U]/U^n for some n.\n    \n  * ^+_red(Y,𝔰)≅0 aside from in a unique ^c structure 𝔰_0 for which ^+_red(Y,𝔰_0)≅[U]/[U^n] for some n.\n\nHere τ^+ indicates a tower [U,U^-1]/U and ^+_red(Y,𝔰) is the submodule of ^+_red(Y,𝔰) generated by elements that are not in the image of U^n for sufficiently large n. The proof is routine.\n1 2 is just our definition of almost L-space.\n\nTo see that 2 3, note that in general ^+(Y,𝔰)=τ^+⊕^+_red(Y,𝔰). Now  considering the long exact sequence induced by the short exact sequence;\n\n\n    0 [r]    (Y,𝔰)  [r, \"\"]    ^+(Y,𝔰) [r, \"U\"]    ^+(Y,𝔰) [r]     0\n\n\nwe see that ^+(Y,𝔰)≅τ^+ unless 𝔰=𝔰_0. In the latter case observe that for each summand of ^+_red(Y,𝔰) we find two generators of (Y,𝔰_0). It follows that ^+_red(Y,𝔰_0)≅[U]/U^n for some n≥ 0.\n3 4 follows from the definition. 4 2 follows immediately from the long exact sequence used above.\n\n\n\n\nA similar statement can be made for ^-;\n\nLet Y be a rational homology sphere. The following conditions are equivalent;\n\n  * Y is an almost L-space.\n\n    \n  * ^-(Y,𝔰)≅τ^- aside from in a unique ^c structure 𝔰_0 for which ^-(Y,𝔰_0)≅τ^+⊕[U]/U^n for some n.\n    \n  * ^-_red(Y,𝔰)≅0 aside from in a unique ^c structure 𝔰_0 for which ^-_red(Y,𝔰_0)≅[U]/[U^n] for some n.\n\nHere τ^- indicates a tower [U] and ^-_red(Y,𝔰) is the U torsion submodule of ^-(Y,𝔰). The proof is again routine.\n\nThis follows just as in the case of the previous proposition but applying the following short exact sequence;\n\n\n\n    0 [r]    ^-(Y,𝔰)  [r, \"U\"]    ^-(Y,𝔰) [r, \"\"]    CF(Y,𝔰) [r]     0\n\nNote that one might reasonably have given a stronger definition of almost L-spaces as rational homology spheres with, say, ^+(Y;)≅τ^+⊕/2. It is not clear to the author if this would be a better definition.\n\n\n We now give the following alternate characterisation of almost L-space knots;\n\n\n\nLet K be a knot of genus g. K is an almost L-space knot if and only if ((S^3_p/q(K)))=p+2q for all p/q≥ 2g-1.\n\nWe find it convenient to prove this proposition by way of Hanselman-Rasmussen-Watson's immersed curve interpretation of bordered Floer homology <cit.>. This invariant can be thought of as assigning to each knot K a closed multi-curve  Γ(K) in the infinite strip [0,1]×, punctured at the points {0}×. Pulling γ(K) tight we obtain a collection of straight line segments. This is called a singular pegboard diagram in <cit.>. There is a unique such segment which is not vertical. Let m denote its slope. Let n be the number of vertical line segments, counted with multiplicity. Note that n-m is even. We will apply the following proposition of Hanselman;\n\n\nLet K be a knot with m and n as above ((S^3_p/q(K)))=|p-qm|+n|q|.\n\nWe now prove Proposition <ref>.\n\n\nWe first prove the forward direction. If K is an almost L-space knot, Theorem <ref> implies that m=2g(K)-1, n=2g(K)+1. Proposition <ref> immediately implies that ((S^3_p/q(K)))=p+2q for all p/q≥ 2g(K)-1.\n\n\n\nFor the opposite direction suppose that there exist p,q such that p/q≥ 2g(K)-1 and ((S^3_p/q(K)))=p+2q. We first show that K is an L-space knot or an almost L-space knot. Note that Proposition <ref> implies that, with m,n as above p+2q=n|q|+|mq-p|. Since K cannot be the unknot U as ((S^3_p/q(U)))=p, we have that 2g(K)-1>0 and may take  p,q≥ 0, so that p+2q=nq+|mq-p|. Suppose m> p/q. Then 2pq+2=n+m, so that 2m+2≥ n+m and m+2> n. But n-m∈ 2^≥ 0, so that n=m in which case K is an L-space knot and p/q=m-1. Otherwise we have that n=m+2. It follows in turn that ((S^3_s(K)))=s+2 for any sufficiently large s so that K is an almost L-space knot.\n\n\nWe conclude this section with the following proposition, taking as given Theorem <ref>;\n\n\n     Suppose K is an almost L-space knot with the ^∞-type of a box plus staircase complex. Then (K,0) is supported in a single Maslov grading.\n\n\nSuppose K is an almost L-space knot with the ^∞-type of a box plus staircase complex.\n\nWe first show that (K,0) is supported in a single grading. Consider Hendricks-Manolescu's involution ι on ^∞(K) <cit.>. Observe that ι^2 yields Sarkar's basepoint pushing map <cit.>. Thus ι^2 is determined up to filtered chain homotopy by the ^∞-type of K by a result of Zemke <cit.>. Consider the components of ι and Sarkar's basepoint pushing map acting on the box complex. Endow the box complex with the generators x_1,x_2,x_3,x_4 as in Definition <ref>. Let e denote U^-1x_3. Sarkar's basepoint pushing map is given by x_1↦ x_1, x_4↦ x_4, e↦ e and x_2↦ x_2+e. Suppose that z is not of the same Maslov grading as e and x_2. Observe that the component of ι(x_2) in (U,A)-grading (0,0) is given by either e+x_2 or x_2, while ι(e)=e. Neither of these maps square to Sarkar's basepoint pushing map, so we have a contradiction and that z is of the same Maslov grading as e and x_2.\n\n\n§ ^∞ OF ALMOST L-SPACE KNOTS AS A BIGRADED VECTOR SPACE WITHOUT MASLOV GRADINGS\n\n\n\nIn this section we determine ^∞ as a bigraded vector space for almost L-space knots without Maslov grading. We apply similar techniques as used by  Ozsváth-Szabó <cit.> in the proof of the corresponding result for L-space knots.\n\n\n\nRecall that (S^3_n(K)) admits a /n grading. We first determine the grading in which ((S^3_n(K),[i]))=3.\n\n\n    Suppose K is an almost L-space knot and n≥2g(K)-1 is an integer. Then ((S^3_n(K)),[i]) is 1 unless [i]=0, in which case it is 3.\n\n    The set of ^c structures admit a conjugation action which induces an isomorphism on (S^3_n(K)). This action sends (S^3_n(K),[i]) to (S^3_n(K),[-i]). Since there is a unique ^c structure in which (S^3_n(K)) is not one, it follows that this ^c structure is self conjugate. There are potentially two such ^c structures, namely 0 and n/2 if n is even. We show that the latter case is impossible. Since n≥ 2g(K)-1 we have that n/2≥ g(K). However, it follows immediately from Ozsváth-Szabó's surgery formula  <cit.> that (S^3_n(K);[i]) is of rank 1 for i≥ g(K), a contradiction.\n\n\nWe note in passing that if K is an L-space knot then ((S^3_2g(K)-2(K),[g(K)-1])=3.\n\n\nBefore proceeding we introduce some notation. ^∞ is a ⊕ graded complex, where the grading (i,j) indicates a U-grading of j and an Alexander grading of i. We denote by C(f(i,j)=0) the subcomplex of the associated graded consisting of generators of grading (i,j) satisfying f(i,j)=0.\n\n\n Set X_m={i≤ 0,j=m}, Y_m={i=0,j≤ m-1}. Let UX_m be the complex generated over {i< 0,j=-1}.\n\n \nFollowing, Ozsváth-Szabó's approach in the L-space knot setting <cit.>, observe that we have a pair of short exact sequences;\n\n\n\n         0[d]\n\n\n0[r]   C{UX_m}[r]   C(UX_m∪ Y_m}[r]    C{Y_m}[d][r]   0\n         C{X_m∪ Y_m}[d]\n         C{X_m}[d]\n         0\n\n\n\nThis yields a pair of exact triangles in homology shown in Figure <ref>. As noted by Ozsváth-Szabó <cit.>, the composition of the two horizontal maps is zero.\n\n\n\n\n\n\n\n\n\nWe first extract the following lemma from work of Ozsváth-Szabó <cit.>;\n   \n\nSuppose H_*(X_m∪ Y_m)≅, H_*(UX_m∪ Y_m)≅^3. Then 1≤(H_*(X_m))≤ 2.\n\n\n\n\n\nSuppose H_*(X)≅^n. In this specific context the exact triangles from Figure <ref> yield;\n\n^n[dr]      H_*(Y)[dr][ll,\"c\"]      ^n[ll,\"d\"]\n   ^3[ur, \"b\"]      [ur, \"a\"]\n\n\n\n\nIf a is injective then H_*(Y)≅^n-1, d has kernel of rank 1, b must have image of rank 1, and c must have kernel of rank 1. Since the composition of the two horizontal maps must be trivial it follows that 1≤ n≤ 2.\n\nIf a is trivial then d is injective and H_*(Y)≅^n+1 whence b has image of rank 2 and c has kernel of rank 2. It follows that the image of c∘ d is of rank n-1 or n-2, whence n=1 or n=2 since the composition of the two maps is trivial.\n\n\n\n\nSuppose H_*(X_m∪ Y_m)≅^3, H_*(UX_m∪ Y_m)≅. Then 1≤(H_*(X_m))≤ 2.\n\n\nThis follows from the proof of the previous lemma, after dualizing, noting that we are working over a field.\n\n\nOf course we are interested in computing H_*(0,m) rather than H_*(X_m). We now relate these quantities.\n\n\nWe have the following;\n  *  Suppose (H_*(X_m))=2. Then (H_*(0,m)) is one of (H_*({i<0,j=m}))-2,(H_*({i<0,j=m})) or (H_*({i<0,j=m}))+2.\n    \n  *  Suppose (H_*(X)_m)=1. Then (H_*(0,m)) is either (H_*({i<0,j=m}))-1 or (H_*({i<0,j=m}))+1.\n    \n  *  Suppose (H_*(X_m))=0. Then (H_*(0,m))=(H_*({i<0,j=m})).\n\nThere is a short exact sequence;\n\n\n    0[r]   C{i<0,j=m}[r]   C{i≤ 0,j=m}[r]   C(0,m)[r]   0\n\n\ngiving the exact triangle on homology shown in Figure <ref>.\n\n\nThe result follows directly.\n\n\n\nWe proceed now to compute the rank of H_*(0,n)– i.e. (K,n)– for each n.\n\n\nSuppose K is an almost L-space knot. Then ((K,A))≤ 1 for |A|>1.\n\nGiven Lemma <ref>, this follows directly from work of Ozsváth-Szabó in the setting in which K is an L-space knot as opposed to an almost L-space knot <cit.>.\n\n\nMoreover we have the following;\n\n\n    Suppose K is an almost L-space knot. Then there is a d∈ 2 such that:\n  * H_*(X_2)≅ 0, H_*(Y_2)≅_d or;\n        \n  * H_*(X_2)≅_d, H_*(Y_2)≅0.\n    \n\n    Moreover case (1) holds if the Maslov grading of the generator of minimal Alexander grading at least 2 is odd, while condition (2) holds if it is even.\n\nAgain this follows directly from work of Ozsváth-Szabó in the setting in which K is an L-space knot as opposed to an almost L-space knot <cit.> given Lemma <ref>.\n\n\nIt remains to determine H_*({(0,j)}) for |j|≤ 1.\n\nTo do so we combining Lemmas <ref>, <ref> and <ref> and obtain the following;\n\n\n\n  *  Suppose (H_*(i<0,j=1))=0. Then (H_*(i≤ 0,j=1))=(H_*(0,1)) is 1 or 2.\n \n\n\n  *  Suppose (H_*(i<0,j=1))=1. Then;\n\n\n  *  If (H_*(i≤ 0,j=1))=2 then (H_*(0,1)) is either 1 or 3.\n    \n  *  If (H_*(i≤ 0,j=1))=1 then (H_*(0,1)) is either 0 or 2.\n \n\n\nWe seek to exclude the case that (H_*(0,1))=3.\n\n\n\nSuppose K is an almost L-space knot. Then (H_*(0,1))≠3\n\n\n    If (H_*(0,1))=3 then  (H_*(i≤ 0,j=1))=(H_*{i<0,j=0})=2. We have the following cases;\n  * (H_*{i≤ 0,j=0})=1 so that (H_*(0,0))=1 or 3 by Lemma <ref>.\n        \n  * (H_*{i≤ 0,j=0})=2 so that (H_*(0,0))=02 or 4 by Lemma <ref>, a contradiction since this rank should be odd.\n    \n\n    \n\n\n    It thus remains to exclude the case that (H_*(i≤ 0,j=1))=2, (H_*(0,1))=3 and (H_*{i≤ 0,j=0})=1. This is straightforward as H_*(i≤0,j=-1)≅ H_*(i=-1,j≤ 0)≅ H_*(i=0,j≤ 1), which is of rank zero or 1, as can be seen by applying the exact sequences in Figure <ref> to determine H_*(Y_2). Applying the exact triangle in Figure <ref> we find that that (H_*(0,-1)) is 0,1 or 2, a contradiction, since it is supposed to be 3.\n\n\n\n\nWe also exclude the case that H_*(0,1)≅ 0;\n\n\n    Suppose K is an almost L-space knot. Then H_*(0,1)≇0\n\nWe note that if we counted all knots which admit a positive L-space surgery as almost L-space knots then this lemma would be false. In particular there there exist L-space knots K with H_*(0,1)≅ 0. For any such K, ((S^3_2g(K)-2(K)))=2g(K).\n\n\nSuppose H_*(0,1)≅ 0. Then we must have that H_*(i≤ 0,j=1)≅ H_*(i<0,j=0)≅. We have two cases according to Lemma <ref>. Applying the exact triangle in Figure <ref> in each instance  we have that;\n  *  If (H_*(j=0,i≤ 0))=1 then (H_*(0,0)) is 0 or 2, both of which are even, a contradiction.\n    \n  *  If (H_*(j=0,i≤ 0))=2 then (H_*(j=-1,i<0))=2. Since (H_*(j=-1,i≤ 0))=(H_*(i=-1,j≤ 0))≤ 1 as in the previous lemma, it follows that H_*(0,-1) is either 1, 2 or 3, a contradiction.\n\n\n\nWe are thus left with the cases; \n\n\n\n\n  * (H_*(i<0,j=1))=0 and (H_*(i≤ 0,j=1))=(H_*(0,1)) is 1 or 2\n  * (H_*(i<0,j=1))=1 and (H_*(i≤ 0,j=1))=2 and (H_*(0,1))=1.\n\n\n  * (H_*(i<0,j=1))=1 and (H_*(i≤ 0,j=1))=1 and (H_*(0,1))=2.\n \n\n\n\n\nWe now compute H_*(0,0), again by cases according to whether (H_*(i≤ 0,j=1))=(H_*(i<0,j=0)) is 1 or 2;\n\n\n  *  If (H_*(i<0,j=0))=2 then (H_*(0,0)) is 0,1,2,3 or 4 by Lemma <ref>. The even cases are excluded as (H_*(0,0)) must be odd and we must have that (H_*(i≤ 0,j=0))=1.\n            \n  *  If (H_*(i<0,j=0))=1 then (H_*(0,1)) is 0,1,2 or 3 by Lemma <ref>. The even cases are excluded as before and we must have that (H_*(i≤ 0,j=0))=2. \n        \n    \n\n\n\n\n\nIn sum we have the following possibilities; (K,1)≅ or ^2 while (K,0)≅ or ^3.\n\n \n\n§ MASLOV GRADINGS\n\nWe now proceed to compute the Maslov gradings of the bigraded vector spaces produced in the previous section. We proceed again by cases, following the argument given by Ozsváth-Szabó for their corresponding step in the L-space knot case. Essentially this amounts to keeping track of the Maslov gradings in the exact triangles shown in Figure <ref> and Figure <ref>. Specifically we apply the fact that the maps f,a,e,b in Figure <ref> preserve the Maslov grading, while maps c and d each lower it by 1. Likewise we use the fact that in Figure <ref> the maps a and b preserve the Maslov grading while map c decreases it by 1.\n\n\n\nWe assume throughout this section that the genus of the almost L-space knot in question is strictly greater than one. We are safe in this assumption as genus 1 almost L-space knots are rank at most two in their maximal Alexander grading and the only such knots are T(2,-3), the mirror of 5_2 and the figure eight knot by results of Ghiggini <cit.> and Baldwin-Sivek <cit.>– see Corollary <ref>.\n\n\n\nSuppose K is an almost L-space knot of genus at least two. Let x be the generator of lowest Alexander grading strictly greater than 1. Let m be the Maslov grading of x and A be its Alexander grading. We have that either;\n\n m is odd and one of the following holds;\n\n\n  1ai)(K,1)≅_m+1 and (K,0)≅_m.\n    \n    \n  1aii)(K,1)≅_d and (K,0)≅_m-1⊕_d-1⊕_d-1\n  1bi)(K,1)≅_m-1⊕_m-2 and (K,0)≅_m-3\n  1bii)(K,1)≅_a⊕_m-1 and (K,0)≅_a-1⊕_m-2⊕_a-1\n or m is even and one of the following holds;\n\n  2ai)(K,1)≅_m+1-2A and (K,0)≅_m-2A\n  2aii)(K,1)≅_b and (K,0)≅_m-2A+1⊕_b-1⊕_b-1\n  2bi)(K,1)≅_m-2A+1⊕_m-2A, (K,0)≅_m-2A+1\n  2bii)(K,1)≅_b⊕_m-2A+3, (K,0)≅_b-1⊕_b-1⊕_m-2A+2\nWe proceed by cases;\n\n  *  Suppose m is odd and, per Lemma <ref>, H_*(i<0,j=1)≅ 0.\n  *  Suppose H_*(0,1)≅_d. It follows that H_*(i≤ 0,j=1)≅_d, whence in turn H_*(i< 0,j=0)≅_d-2. \n        \n        \n        \n        \n  *  Suppose H_*(0,0)≅_a. Then H_*(i≤ 0,j=0)≅_b⊕_c. Then a=b and d-2=c. It follows that H_*(i<0,j=-1)≅_a-2⊕_d-4. It follows in turn that d-3=a-2. Indeed, H_*(i≤ 1,j=-1)≅_d-4. We then find that d-4-2(A-1)=m-2A-1, so that d=m+1.\n    \n\n        \n  *   Suppose H_*(0,0)≅_a⊕_b⊕_c. Then without loss of generality d-2=c-1  and H_*(i≤ 0,j=0)≅_a⊕_b, so that H_*(i< 0,j=-1)≅_a-2⊕_b-2. It follows without loss of generality that d-3=b-2. Indeed, H_*(i≤ 1,j=-1)≅_a-2. We then find that a-2-2(A-1)=m-2A-1, so that a=m-1.\n\n        \n        \n  *  Suppose H_*(0,1)≅_a⊕_b. Then H_*(i≤ 0,j=1)≅_a⊕_b.\n        \n        \n  *  If H_*(0,0)≅_c then H_*(i≤ 0,j=0)≅_b-2, c-1=a-2. It follows that H_*(i<0,j=-1)≅_b-4. Thus a-3=b-4. As before we find that a=m-1.\n\n            \n  *  If H_*(0,0)≅_c⊕_d⊕_e then without loss of generality e-1=a-2, d-1=b-2 and H_*(i≤ 0,j=0)≅_c. It follows that c-2=b-3 or a-3. Suppose c-2=b-3. Then we find that a-2-2(A-1)=m-2A-1 so that a=m-1. Suppose c-2=a-3 then we find that b=m-1.\n\n            \n        \n  *  Suppose m is even and, per Lemma <ref>H_*(i<0,j=1)≅_a. Then a=m-2(A-1). Moreover;\n       \n  *  Suppose H_*(0,1)≅_b. Then H_*(i≤ 0,j=1)≅_a⊕_b and H_*(i<0,j=0)≅_a-2⊕_b-2\n  *  Suppose H_*(0,0)≅_c. Suppose a-2=c-1 and H_*(i≤ 0,j=0)≅_b-2. It follow that H_*(i< 0,j=-1)≅_b-4, a contradiction. Thus b-2=c-1, and H_*(i≤ 0,j=0)≅_a-2. It follows that b-3=a-4.\n\n\n            \n            \n  *  Suppose H_*(0,0)≅ F_c⊕_d⊕_e. Then without loss of generality c-1=a-2,d-1=b-2 and H_*(i≤ 0,j=0)≅_e. It follows that e-2 is b-3.\n        \n  *  Suppose H_*(0,1)≅_b⊕_c. It follows without loss of generality that c-1=a and H_*(i≤ 0,j=1)≅_b while _b-2≅ H_*(i<0,j=0).\n\n        \n  *  Suppose H_*(0,0)≅_d. Then H_*(i≤ 0,j=0)≅_b-2⊕_d and H_*(i< 0,j=0)≅_b-4⊕_d-2. It follows that b-3=d-2, a-3=d-2.\n\n            \n  *  Suppose H_*(0,0)≅_d⊕_e⊕_f. It follows that f-1=b-2 without loss of generality. Similarly H_*(i≤ 0,j=0)≅_d⊕_e. Thus\n        H_*(i<0,j=-1)≅_d-2⊕_e-2. Thus {d-2,e-2}={b-3,c-3} i.e. without loss of generality d=b-1,e=c-1\n\n§ THE FILTRERED CHAIN HOMOTOPY TYPE OF ^∞\n\n\nIn this section we seek to determine the filtered chain homotopy type of ^∞ of almost L-space knots. We have 8 cases to deal with according to Lemma <ref>, although we will see that there is a certain amount of degeneracy amongst these cases.\n\nWe again assume throughout this section that the genus of the almost L-space knot in question is strictly greater than one. Again we are safe in this assumption as genus 1 almost L-space knots are rank at most two in their maximal Alexander grading and the only such knots are T(2,-3), the mirror of 5_2 and the figure eight knot by results of Ghiggini <cit.> and Baldwin-Sivek <cit.>– see Corollary <ref>.\n\n\n Let K be an almost L-space knot of genus strictly greater than 1. Then there exists an integer d such that either;\n  * H_*(i=0,j>1)≅_0 and there is an even integer d<0 with H_*(i=0,j<-1)≅_d and H_*(|i|≤ 1)≅_d+1.\n    \n  *    There is an odd integer d<0 such that H_*(i=0,j>1)≅_0⊕_d and H_*(i=0,j<-1)≅ 0 and H_*(|i|≤ 1)≅_d-1.\nH_*(i=0,j<-1)≅ H_*(j=0,i<-1)≅  H_*(j=2,i≤ 0)≅ H_*(X_2), up to appropriate gradings shifts. Moreover, H_*(Y_2)=H_*(i=0,j≤ 1). Lemma <ref> shows that (H_*(X_2),H_*(Y_2)) is either (_d,0)  or (0,_d) with d even in either case. \n\n\n\nH_*(i=0,j>1) can be computed using the is a short exact sequence;\n\n\n    0[r]   C(i=0,j≤ 1)[r]   C(i=0)[r]   C(i=0,j>1)[r]   0\n\n\nwhich yields exact triangle on homology;\n\n\n    H_*{i=0,j≤ 1}[rr]      H_*(i=0)≅_0[dl]\n   H_*(i=0,j> 1)[ul,]\n\n\n\nIt follows that H_*(i=0,j>1) is _0 or _0⊕_d according to whether or not H_*{i=0,j≤ 1} is _d-1 for some d or 0. Note here that Ozsváth-Szabó show that d-1<0 <cit.>, so the top map is necessarily trivial.\n\n\n\nThere is another short exact sequence;\n\n\n    0[r]   C{i=0,j< -1}[r]   C{i=0,j≤ 1}[r]   C{i=0,|j|≤ 1}[r]   0\n\n\ngiving an exact triangle on homology;\n\n\n    H_*{i=0,j< -1}[rr,]      H_*{i=0,j≤ 1}[dl]\n   H_*(i=0,|j|≤ 1)[ul]\n\nH_*(i=0,|j|≤ 1)≅_d or _d+1 in the case that that (H_*(X_2),H_*(Y_2)) is either (,0) or (0,).\n\n\n\n\n\n\n\nFor grading reasons this determines the  filtered chain homotopy type of the chain complex C((x,y):|y-x|>1), just as in the case for L-space knots.\n\nWe seek to determine the rest of the chain complex.\n\n\n\n    Suppose K is an almost L-space knot and (H_*(0,0))=1. Then ^∞(K) is an almost staircase complex.\n\nWe know that H_*(i=0)≅_0 and that (H_*(0,i))≤ 1 for i≠±1, 1≤(H_*(0,±1))≤ 2. Moreover, in (K)– which is identified with H_*(i=0)– the (M,A)-gradings of the 5 generators of smallest A-grading are either (0,d),(1,d+1),(-1,d-1),(A,d),(-A,d-2A) if d is odd or (0,d),(1,d+1),(-1,d-1),(-A,d),(A,d+2A) if d is even. We have a number of cases;\n\n\n  *  If d is even then;\n    \n    \n  *  if A>1 then H_*(i=0,j≤ 1)≅ 0 and H_*(i=0,j≥ A)≅_0. This forces C(i=0) to be of the desired form – i.e. as determine by the ^∞-type of an almost staircase complex of type 2– perhaps with the addition of components of the differential from (0,0) to (0,-A-1)– if there exists a generator of this grading – and from (0,-1) to (0,-A'), where A' is the smallest integer A'>A+1 for which C(0,-A') is non-trivial. C(j=0) is determined similarly, up to the addition of two components of the differential. In ^∞ the resulting additional 4 components of the differential can be removed by a filtered chain homotopy. In order that ∂^2=0 there must be two diagonal components to the differential on ^∞(K), as shown in Figure <ref>.\n\n        \n        \n  *  if A=1 then the fact that H_*(i=0)≅_0, H_*(i=0,j≤ 1)≅_d+2, H_*(i=0,j≤ -1)≅_d, H_*(i=0,j< -1)≅ 0 determines C(i=0), perhaps with the addition of components of the differential from (0,0) to (0,-2)– if there exists a generator of this grading – and from the generator of Maslov grading d-1 in bigrading (0,-1) to (0,-A'), where A' is the smallest integer A'>2 for which C(0,-A) is non-trivial. C(j=0) is determined similarly, up to the addition of two components of the differential. In ^∞ the resulting additional 4 components of the differential can be removed by a filtered chain homotopy. In order that ∂^2=0 there must be two diagonal components to the differential on ^∞(K), as shown in Figure <ref>.\n    \n  *  If d is odd then;\n\n\n  *  if A>1 then H_*(i=0,j≤ 1)≅_d-1 and H_*(i=0,j>1)≅_0⊕_d. This once again determines C(i=0), perhaps up to the addition of two components of the differential one from a generator of bigrading (0,A+1)– if such a generator exists – to the generator of grading (0,0) and from (0,A') to (0,1) where A' is the smallest A'>A+1 such that C(0,A') is non-trivial. C(j=0) is determined similarly, up to the addition of two components of the differential. In ^∞ the resulting additional 4 components of the differential can be removed by a filtered chain homotopy. In order that ∂^2=0 there must be two diagonal components to the differential on ^∞(K), as shown in Figure <ref>.\n    \n    \n  *  if A=1 then the fact that H_*(i=0)≅ H_*(i=0,j>1)≅_0, H_*(i=0,j≤ 1)≅ 0, H_*(i=0,j≤ 1)≅ 0 determines C(i=0) as being of the desired form perhaps with addition of two unwanted components. One of these components is from the generator of bigrading (0,2)– if it exists –  to the generator of grading (0,0), the other is a component from from (0,A') to the generator in bigrading (0,1) of Maslov grading d+1 where A' is the smallest A'>2 such that C(0,A') is non-trivial. C(j=0) is similarly determined.  In ^∞ the resulting additional 4 components of the differential can be removed by a filtered chain homotopy. In order that ∂^2=0 there must be two diagonal components to the differential on ^∞(K), as shown in Figure <ref>.\n\n\n\nTo deal with the case that (H_*(0,0))=3 we first understand the behavior of the complex near the diagonal;\n\n\n    Suppose K is an almost L-space knot and (H_*(0,0))=3. Then up to a filtered change of basis C_*({|j-i|≤ 1}) is the direct sum of a box complex and a staircase complex.\n\n\nWe proceed by cases according to (H_*(0,1)).\n\n\nSuppose H_*(0,1)≅_a, H_*(0,0)≅_a-1^2⊕_d, H_*(0,-1)≅_a-2. Note that these Maslov gradings are determined by Lemma <ref>.  Let x,y_1,y_2,z,w be the respective generators.  Note that there is a unique from ∂ can take on C(i=0|j|≤ 1) such that H_*(i=0,|j|≤ 1)≅_d, up to a basis change in C(0,0). It follows from here that (C(i,j:|j-i|≤ 1),∂) is determined up to the addition of diagonal components of ∂. The only way to add diagonal components is to have diagonal components from w to U^n+1x,U^nw for some n or vice versa. A filtered change of basis removes these components.\n\n\nSuppose now that H_*(0,1)≅_m⊕_d, H_*(0,0)≅_m-1^2⊕_d-1. Then we have that H_*(0,-1)≅_m-2⊕_d-2. Note that these Maslov gradings are determined by Lemma <ref>. Let x_1 be the generator of H_*(0,1) of Maslov grading m, y_1 be the generator of H_*(0,1) of Maslov grading d, x_2,x_3 be the generators of H_*(0,0) of Maslov grading m-1, y_2 be the generator of H_*(0,0) of Maslov grading d-1, x_4 be the generator of H_*(0,-1) of Maslov grading m-2 and y_3 be the generator of H_*(0,-1) of Maslov grading d-2.\n\nSuppose m-1∉{d,d-1,d-2}. Consider the restriction of the differential to C(i=0,|j|≤ 1).  Then after a basis change we may take ∂ x_1=x_2. Since m-1≠ d,d-1, we have ∂ x_3=x_4. The remaining component of the differential is then determined. Specifically, after mirroring we may assume that y_1 is the generator that persists and the remaining component of the differential is ∂ y_2=y_3. \n\nWe then have that in C(|j-i|≤ 0) the y generators form a single staircase and the x generators form boxes. The question remains over whether or not there are diagonal components. By inspection these come in pairs and can be removed by a filtered change in basis.\n\n\nWe now deal individually with the cases m=d+1, m=d and m=d-1;\n\n\n  * m=d+1\n  *  Suppose the Maslov grading d-2 generator is not the one which persists to H_*(i=0,|j|≤ 1). Then there is a component of ∂ from the Maslov index d-1 generator to the Maslov index d-2 generator. We have the following subcases;\n  *  Suppose the generator of H_*(0,1) of Maslov index d generator does not persist to H_*(i=0,|j|≤ 1). Then it has a component to the generator of H_*(0,-1) of  Maslov index d-1. The Maslov index d+1 generator must have a component to one of the generators of H_*(0,0) of Maslov index d. Such a ∂ clearly cannot be extended to C(|j-i|≤ 1) a contradiction.\n\n        \n  *  Suppose the generator of H_*(0,1) of Maslov index d persists. After a change of basis this determines the vertical components of the differential and it is readily observed that C(|j-i|≤ 1) is the direct sum of a staircase and a box complex.\n    \n  *  Suppose the Maslov index d-2 generator does persist to H_*(i=0,|j|≤ 1). This is impossible because it is of the wrong Maslov grading.\n\n  * m=d. In this case the chain complex is thin and so splits as a direct sum of boxes and staircases by work of Petkova <cit.>.\n\n    \n  * m=d-1\n  *  Suppose the Maslov index d-3 generator is not the one which persists to H_*(i=0,|j|≤ 1). After a change of basis we may assume the differential has a component from a single Maslov index d-2 generator to it. We have the following cases;\n  *  Suppose the other generator of H_*(0,0) of Maslov grading d-2 does not persist to H_*(i=0,|j|≤1). Then there is a component \nof the differential from the the generator of H_*(0,1) of Maslov index d-1 to it and indeed the whole vertical complex is determined. Indeed, the whole complex is seen to be a staircase complex plus a box complex. There can be no diagonal components to the differential for for grading reasons.\n\n            \n  *  Suppose the generator of H_*(0,0) of Maslov index d-2 persists to H_*(i=0,|j|≤ 1). Then the vertical components of ∂ are determined by the Maslov gradings. It is readily observed that this does not extend to a differential on C(|j-i|≤ 1).\n        \n\n\n\n\nThis determines the complex up to addition of additional arrows between C(i,j:|j-i|≤ 1), C(i,j:j-i>1), C(i,j:i-j>1). In order that H_*(i=0)≅ H_*(j=0)≅_0 it is readily seen that the staircases from C(|j-i|>1) and C(|j-i|<1) connect to form a large staircase. We now show that up to filtered chain homotopy there are no diagonal components;\n\n\n\nSuppose K is an almost L-space knot and (H_*(0,0))=3. Then ^∞(K) is the direct sum of a box complex and a staircase complex.\n\n\nBefore proving this result we find it convenient to broaden our definition of staircase complexes to include their duals. We proceed with this in mind.\n\n\n\nWe have shown that ^∞(K) contains a box complex and a staircase complex. Call them B and C respectively. We need to show that there is no component of ∂ from C to B after a filtered change of basis. The fact that there is no component from C to B then follows by dualizing the complex and the fact we have broaden our definition of staircase complexes.\n\nSuppose towards a contradiction that there is some component of ∂ from C to B. Consider the generators of lowest j-grading. Amongst these consider that of the highest i grading. There is a unique such generator, call it z.\n\n Let x_1, x_2,x_3,x_4 be the generators of C ordered as in Figure <ref>. Consider the components of ∂ z in C which has the lowest j grading. Amongst these consider those with the lowest i grading.\n\n\nSuppose this generator is x_4. In order that ∂^2=0, we must have that ∂ z has a component z' of the same j grading such that ∂ z' has a component x_3, or there is a component of the differential to x_1. In the first case either a filtered change of basis z'↦ z'+x_4 or z↦ z+x_2 removes both unwanted components of the differential. In the second case the change of basis z↦ z+x_2 removes the unwanted components of the differential.\n\nWe proceed now to the case that the generator is x_3. Performing the filtered change of basis z↦ z+x_1 or z↦ z+x_4 removes the unwanted components of the differential.\n\nSuppose this generator is x_2. In order that ∂^2=0 we have that there is a generator z' with the same j grading as z such that ⟨∂ z,z'⟩≠ 0 and that there is a component of the differential from z' to x_4. In fact, again in order that ∂^2=0, we must also have a component of ∂ from z' to x_1. Performing a filtered change of basis z'↦ z'+x_2 removes the unwanted components of the differential.\n\nSuppose this generator is x_1. We must have a generator z' of the same j grading as z such that there is a component of the differential from z to z' and there is a component of ∂ from z' to x_3. The filtered change of basis z'↦ z'+x_1 then removes the unwanted components of the differential.\n\n\n\n§ APPLICATIONS\n\n\n\n\n\nIn this section we prove the applications advertised in the introduction.\n\n\n\nSuppose K is a genus one almost L-space knot. Then K is T(2,-3), the figure eight knot, or the mirror of the knot 5_2.\n\nTheorem <ref> implies that if K is an almost L-space knot then the rank of (K) in Alexander grading 1 is at most two. The result then follows immediately from Baldwin-Sivek's classification of nearly fibered knots <cit.>– i.e. genus one knots with knot Floer homology of maximal Alexander grading of rank two – and Ghiggini's classification of genus 1 knots with knot Floer homology of rank one in their maximal Alexander grading <cit.>.\n\n\nThe only composite almost L-space knot is T(2,3)# T(2,3).\n\n\nLet K be an almost L-space knot. Knots of genus at most 1 are prime. If g(K)>2 then ((K,g(K)-1))=((K,g(K)-1))=1  by a result of Baldwin-Vela-Vick <cit.>. It follows that K cannot be prime just as it does in the L-space case <cit.>.\n\nSuppose g(K)=2 and K=K_1# K_2. Then since (K)≅(K_1)⊗(K_2) and (K) is trivial in Alexander gradings ≥ 2 and of Maslov grading 0 in Alexander grading 2, it follows that K_1, K_2 are both genus 1 <cit.>, fibered <cit.> and strongly quasi-positive <cit.>. It follows that K_1=K_2=T(2,3). It is readily checked that T(2,3)# T(2,3) is indeed an almost L-space knot.\n \nThe mirror of 5_2 is the only almost L-space knot which is not fibered.\n\nIf K is an almost L-space knot with g(K)>1 then the rank of the knot Floer homology of K in the maximal Alexander grading is 1 by Theorem <ref>. It follows that K is fibered by work of Ghiggini <cit.> and Ni <cit.>\nSuppose K is an almost L-space knot for which |τ(K)|< g_3(K). Then K is the figure eight knot.\n\n    This follows immediately from Theorem <ref> and Corollary <ref>.\n\n    The only almost L-space knots that are not strongly quasi-positive are the figure eight knot and the left handed trefoil.\n\n    If K is an almost L-space knot of genus strictly greater than 1, the result follows immediately from Theorem <ref>, Corollary <ref> and Hedden's result that knot Floer homology detects if fibered knots are strongly quasi-positive <cit.>. For the genus 1-case, the result follows from Corollary <ref> together with the fact that the mirror of 5_2 is strongly quasi-positive while the figure eight knot and T(2,-3) are not.\n\n\n\n\nWe now recover a result of Hedden;\n\n \n    Suppose K is a knot and ((K_n))=n+2. Then K is a non-trivial L-space knot and n=2g(K)-1.\n\n\nRecall here that K_n denotes the core of n-surery on K. Again we find it helpful to think of surgery in terms of Hanselman-Rasmussen-Watson's immersed curve invariants.\n\n\n\nThe immersed curve invariants of almost L-space knots are determined by Theorem <ref>. It follows that if K is an almost L-space knot then ((K_n))>n+2. Indeed, we have that if K is neither an L-space knot nor an almost L-space knot then ((K_n))≥((S^3_n(K)))>n+2. Likewise it follows immediately from the classification of immersed curves for L-space knots that if K is an L-space knot then ((K_n))=n+2 if and only if K is non-trivial and n=2g(K)-1. In sum we have that ((K_n))=n+2 if and only if K is an L-space knot and n=2g(K)-1.\n\n      Suppose K is an L-space knot. If a 2 component link L satisfies (L)≅(K_2,4g(K)-2). Then L is a (2,4g(K)-2)-cable of an L-space knot K' such that (K')≅(K).\n\nApplying <ref>, this result follows as in the proof of <cit.>.\n\n    Suppose K is an L-space knot (L)≅(K_m,2mg(K)-m). Then L is a (2,2mg(K)-m) cable of an L-space knot K' with (K')≅(K).\n\nApplying <ref>, this result follows as in the proof of <cit.>.\n\n\n\nWe now give a characterizations of cables of (m,mn) cables of almost L-space knots for sufficiently large m.\n\n\n\n Let K be an almost L-space knot.  Suppose L is a link such that (L)≅(K_m,mn) with m>2g(K)-1. Then L is the (m,mn)-cable of an almost L-space knot K' such that (K')≅(K).\n\nSuppose K is as in the statement of the theorem. The same argument as used by the author and Dey in <cit.> implies that L is the (m,mn)-cable of some knot K' such that ((K'_m))=m+4 and Δ_K'(t)=Δ_K(t).\n\nWe now show that K' is either an L-space knot or an almost L-space knot. Let γ be the immersed curve invariant of K'. Applying Proposition <ref>, we have that m+4≥((S^3_m(K'))=|m-a|+b≥ m where b is the number of vertical components in a singular pegboard diagram for γ counted with multiplicity and a is the slope of the unique segment which is not vertical. Suppose m< a. Then a+b≤ 2m+4<2a+2. b-a is an even non-negative integer. It follows that b=a+2 or b=a. If b=a then K' is an L-space knot, as shown by an application of Proposition <ref>. If b=a+2 then K' is an almost L-space knot as shown by an application of Proposition <ref>. If m≥ a then we have that b-a≤4. However, this yields only one new case, namely b-a=4. In this case it can be observed from the immersed curve formula for (K_m) that ((K_m))≥ m+6.\n\nSuppose now that K' is an L-space knot. Then m=2g(K')-2, as can be seen from Proposition <ref>. Since (K'_m,mn)≅(K_m,mn), K_m,mn and K'_m,mn have the same genus. Applying work of Gabai <cit.>, Neumann-Rudolph <cit.> and Rudolph <cit.>, it in turn follow that K and K' have the same genus, contradicting m>2g(K)-1.\n\nThus K' is an almost L-space knot. It remains to show that (K')≅(K). Observe that since K and K' share the same Alexander polynomial. Theorem <ref>  and Proposition <ref> imply that Δ_K(t) determines (K) for almost L-space knots, completing the proof.\n\n    Link Floer homology detects the (m,mn)-cables of T(2,-3), the figure eight knot and the mirror of 5_2 for n>1.\n\n   Let K be one of the knots in the statement of the proposition. Suppose L is a link such that (L)≅(K_m,mn) for some n>1. Proposition <ref> implies that L is as (m,mn) cable of an almost L-space knot K' with the same (-) type as K. Proposition <ref> shows that there are only 3 genus one almost L-space knots, namely those listed in the statement of the proposition. They are each distinguished by their Alexander polynomials, concluding the proof.\namsalpha"}