{"entry_id": "http://arxiv.org/abs/2303.07248v1", "published": "20230313162216", "title": "Channel Estimation for Underwater Visible Light Communication: A Sparse Learning Perspective", "authors": ["Younan Mou", "Sicong Liu"], "primary_category": "eess.SP", "categories": ["eess.SP", "cs.IT", "cs.LG", "math.IT"], "text": "\n\n\n\n\n\n\n@headings\noddhead\nevenhead\noddfoot\nevenfoot\nempty\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n    theoremTheorem\n    observation[theorem]Observation\n    lemma[theorem]Lemma\n    remarkRemark\n    propositionProposition\n    corollaryCorollary\n    sequation\n    DoWhileDoWhileGBKsong\n    Submitted paper Channel Estimation for Underwater Visible Light Communication: A Sparse Learning Perspective\n        \n            Younan Mou,\n            and Sicong Liu*, Senior Member, IEEE,\n    Younan Mou and Sicong Liu are with the Department of Information and Communication Engineering, School of Informatics, Xiamen University, Xiamen 361005, China. (Corresponding Author: Sicong Liu. email: liusc@xmu.edu.cn).\n    \n    \n    \n    \n    \n    \n    \n    \n    \n        March 30, 2023\n    ============================================================================================================================================================================================================================================================================================================\n    \n    empty1\n      The underwater propagation environment for visible light signals is affected by complex factors such as absorption, shadowing, and reflection, making it very challengeable to achieve effective underwater visible light communication (UVLC) channel estimation.\n      It is difficult for the UVLC channel to be sparse represented in the time and frequency domains, which limits the chance of using sparse signal processing techniques to achieve better performance of channel estimation.\n      To this end, a compressed sensing (CS) based framework is established in this paper by fully exploiting the sparsity of the underwater visible light channel in the distance domain of the propagation links.\n      In order to solve the sparse recovery problem and achieve more accurate UVLC channel estimation, a sparse learning based underwater visible light channel estimation (SL-UVCE) scheme is proposed. Specifically, a deep-unfolding neural network  mimicking the classical iterative sparse recovery algorithm of approximate message passing (AMP) is employed, which decomposes the iterations of AMP into a series of layers with different learnable parameters.\n      Compared with the existing non-CS-based and CS-based schemes, the proposed scheme shows better performance of accuracy in channel estimation, especially in severe conditions such as insufficient measurement pilots and large number of multipath components.\n    \n      underwater visible light communication, compressed sensing, sparse learning, deep-unfolding neural networks, channel estimation\n    \n    \n    \n    § INTRODUCTION\n    \n    Realization of high-speed underwater communication system provides an important guarantee for the exploration and development of marine resources.\n    At present, acoustic waves are widely used in underwater communication systems, but the performance is subject to strong frequency dependent attenuation, resulting in a transmission bandwidth of up to a few hundred kHz <cit.>.\n    In contrast, underwater visible light communication (UVLC) owns hundreds of THz unlicensed bandwidth for communication , and it also has the advantages of high security, low cost and low link delay, etc<cit.>.\n    The optical orthogonal frequency division multiplexing (OOFDM) technology has been widely applied in UVLC systems, which effectively mitigates the impact of frequency selective fading and supports high-rate transmission <cit.>.\n    \n    The study on channel modeling and estimation is among the key directions in the field of UVLC research.\n    It is critical for the UVLC system to obtain accurate channel state information in order to support high-speed and reliable underwater transmission. However, due to the complex underwater environment, the transmission of light waves is affected by many complex conditions such as absorption, scattering and turbulence <cit.>, which brings great difficulties to the effectiveness and accuracy of the modelling and estimation of UVLC channels.\n    \n    In existing research of UVLC channels, the main stream of channel modelling is to obtain the modelling and parameters of the UVLC channel impulse response (CIR) through Monte Carlo numerical simulations <cit.>.\n    However, realistic complicated trajectories and states of millions of photons need to be simulated, which costs high computational complexity <cit.>.\n    As for the channel estimation methods, a method for UVLC channel estimation is proposed based on inter-symbol frequency-averaging and intra-symbol frequency-averaging <cit.>.\n    However, due to the complex underwater environment, the accuracy of channel estimation is still a great bottleneck limiting the link performance of the UVLC system <cit.>.\n    Considering channel estimation for wireless communications, if some prior information such as channel sparsity can be introduced, the compressed sensing (CS) based methods might be utilized to improve the performance.\n    As for UVLC channel estimation, this becomes a difficult problem because it is difficult for the UVLC channel to be sparse represented in the time and frequency domains as is done for wireless communications.\n    \n    To this end, in this paper, we extract the inherent sparsity of the UVLC channel frequency response (CFR) and present its sparse representation in the distance domain of the propagation links, thus formulating a novel CS-based framework of UVLC channel estimation.\n    This makes it possible to use sparse recovery techniques to achieve better performance of channel estimation.\n    However, the restricted isometry property (RIP), i.e., a coherence metric, of the measurement matrix of the CS-based model for the UVLC channel is not as satisfactory as that of wireless communication channels due to the mechanism of sparse representation in the multipath distance domain.\n    This might limit the performance of CS-based algorithms in sparse recovery problem solving.\n    \n    Hence, deep learning techniques widely applied in various fields of wireless communications is introduced to solve the sparse recovery problem with unsatisfactory RIP property.\n    Specifically, model-driven deep-unfolding neural network models are devised according to the physical characteristics of the system, which can significantly reduce the data requirement and time consumption in training <cit.>.\n    Inspired by this, the classical iterative sparse recovery algorithm of approximate message passing (AMP) <cit.> is decomposed into a series of layers of deep neural networks (DNN) with learnable parameters, and thus a model-driven deep learning method is constructed to realize the estimation of the CFR of the UVLC.\n    \n    The rest of this paper is structured as follows: The CFR model of the UVLC system is established in Section +2;\n    Section +3 formulates the proposed CS-based framework of UVLC channel estimation, and presents the sparse recovery scheme based on model-driven deep-unfolding neural networks;\n    Section +4 reports the simulation results of the proposed scheme with discussions;\n    Finally, the paper is concluded in Section +5.\n    \n    \n    \n    \n    § SYSTEM MODEL\n    \n    \n    Considering the important role of UVLC in marine applications, we mainly investigate the visible light channel in the seawater environment in this paper.\n    Since the optical properties in seawater are only affected by the medium of seawater, the underwater propagation of light waves is affected by the combined effect of the inherent attenuation of pure water and the absorption and scattering of plankton, dissolved substances and suspended particles in the water <cit.>.\n    Therefore, it can be approximated that the optical properties of seawater are divided into two parts: absorption and scattering <cit.>, resulting in severe attenuation of light waves in seawater.\n    To sum up, the total attenuation coefficient of the light wave propagation in seawater can be described as\n    \n    \n        c( f ) = a( f ) + b( f ),\n    \n    where a( f ) and b( f ) are the absorption and scattering coefficients of seawater, respectively, and their sum c( f ) is the total absorption coefficient of light wave propagation seawater.\n    \n    \n    \n    The total attenuation coefficient of light wave propagation in seawater with respect to frequencies <cit.> is shown in Fig <ref>.\n    It can be shown that the attenuation coefficient of light wave propagation in seawater changes irregularly with frequency, which makes the impact of frequency selectivity more detrimental to the system.\n    Therefore, the OOFDM technology can be adopted to combat against the severe frequency selective fading of seawater channels.\n    \n    Note that the available bandwidth of optical spectrum can be up to several hundreds of THz, and the bandwidth actually used is limited by the bandwidth of the transmitter and the receiver, which is usually below of GHz and commonly tens of MHz, Thus, the attenuation coefficient as illustrated in Fig. 1 can be considered approximately regarded as quasi-linear. The channel attenuation coefficient can be modeled as a quasi-linear model c( f ) = c_1f + c_2 , so the CFR of the underwater wireless optical channel can be rewritten as <cit.>\n        H(f) = αe^ - ( c_1f + c_2)s,\n    \n    where α is the attenuation factor of light propagating underwater; s is the distance that light propagates underwater.\n    \n    \n    \n    \n    In addition to the absorption and scattering of the seawater itself, in the complex and changeable marine environment, the UVLC signals can be shielded, reflected or refracted, which leads to the visible light propagation in a number of paths as shown in Fig <ref>.\n    Therefore, the actual received signal is the superposition of the line-of-sight (LoS) path and multiple non-line-of-sight (NLoS) paths.\n    Then, the CFR of the underwater visible light channel is rewritten as <cit.>\n        H( f ) = ∑_l = 0^L -1α _le^ - ( c_1f + c_2)s_l,\n    \n    \n    where α _l and s_l are the attenuation factor and propagation distance of the l -th path, respectively; The frequency f = f_b + f_c is composed of the baseband signal frequency f_b and the optical carrier frequency f_c ; L represents the number of LoS and NLoS paths.\n    \n    A number of pilot subcarriers with equal spacing are employed to estimate the CFR of the UVLC system.\n    Assuming that P uniformly spaced pilot subcarriers are used, the pilot frequency ranges from f_min to f_max with the pilot frequency interval of Δ f = ( f_max - f_min)/( P - 1) .\n    Thus, the frequency of each pilot subcarrier is given by f_i = f_min + iΔ f , 1 < i < P .\n    Then, the received i -th pilot subcarrier can be represented by\n    \n    \n        H( f_i) = ∑_l = 0^L - 1α _le^ - [ c_1( f_min + iΔ f) + c_2]s_l,\n    \n    the received pilots { H( f_i)} _i = 1^P can be regarded as the measurement data of the CFR.\n    \n    \n    \n    \n    § CHANNEL ESTIMATION SCHEME FOR UNDERWATER VISIBLE LIGHT COMMUNICATION BASED ON SPARSE LEARNING\n    \n    \n    In order to make better use of the sparsity of the CFR in the distance domain, Eq. <ref> is rewritten as\n    \n    \n        H( f_i) = ∑_l = 0^L - 1α _le^ - [ c_1( f_min + iΔ f) + c_2]s_l  = ∑_l = 0^L - 1ω _l^i ·λ _l,\n    \n    where we define some channel parameters as ω _lΔ = e^ - c_1Δ fs_l and λ _lΔ = α _le^ - ( c_1f_min + c_2)s_l for the convenience of modelling and representation.\n    Note that {λ _l,0 ≤ l ≤L - 1} is only related to the propagation distance s_l of a specific UVLC path.\n    When the value of the channel parameters {λ _l,0 ≤ l ≤L - 1} and the path distance s_l is obtained, the value of the attenuation factor α _l can be calculated.\n    \n    Considering that in the actual seawater environment, the number of UVLC paths L between the transmitter and receiver is limited, the distances of all the L paths {s_l}_l = 0^L-1 are only a few values selected out of the distance domain, leading to the sparsity of the CFR in the distance domain, which is explained later in detail.\n    To facilitate the sparse representation of the distance domain, we can discretize the continuous distance s_l into discrete values, i.e., n_lΔ s , where n_l is the quantization coefficient, and Δ s is the minimum quantization step size of the path.\n    In practical application, a proper step size of Δ s can be determined to make a good tradeoff between computational complexity and channel estimation accuracy.\n    Increasing the step size can reduce the computational complexity, while it will also lead to a degradation in the accuracy of channel estimation.\n    \n    In the UVLC system, we can formulate the channel measurement vector using the received pilots, which is actually the sampling of the CFR as given by\n    \n    \n        y = [ H( f_1),H( f_2), ⋯ ,H( f_P)].\n    \n    \n    At this point, the channel estimation problem is transferred into a parametric sparse recovery problem, which can be solved effectively using CS-based methods by fully exploiting the sparse characteristics of the CFR in the distance domain.\n    Therefore, a CS-based UVLC channel measurement model is established as\n    \n    \n        y = Φx + w,\n    \n    where the observation matrix Φ∈ℂ^P × N is expressed as\n    \n    \n        Φ = [ [       v_0       v_1         ⋯   v_N - 1;     v_0^2     v_1^2         ⋯ v_N - 1^2;         ⋮         ⋮         ⋱         ⋮;     v_0^P     v_1^P         ⋯ v_N - 1^P ]],\n    \n    where v_k = e^ - c_1Δ fΔ s · k is the quantized expression of the parameter ω _l ;\n    w is the background noise vector;\n    The unknown vector x = [ x_0,x_1, ⋯ ,x_N - 1]^T is a sparse vector containing L non-zero elements.\n    For the convenience of expression, x is called the channel sparse proxy vector.\n    The subscripts of each element of x ranging from 0 to N-1 are related to the distance from 0 to ( N - 1)Δ s in the distance domain, respectively.\n    The length N of the vector x is determined by the NLoS path with the maximum distance s_max in the UVLC channel, i.e., N = ⌈s_max/Δ s⌉.\n    \n    For any element x_k in the channel sparse proxy vector x , if there exists a path with the distance of s_l = k ·Δ s in the UVLC channel, then the value of x_k is the distance-quantized expression of λ _l , i.e., x_k = α _le^ - ( c_1f_min + c_2)k ·Δ s ;\n    Otherwise, if the path does not exist, the corresponding element is simply zero, i.e., x_k = 0 .\n    In the UVLC channel environment, the actual number of paths L between the transmitter and receiver is limited, so the distances of all the L paths {s_l}_l = 0^L-1 are only a few values selected out of the discretized distance domain, i.e., L ≪ N .\n    Thus, the channel sparse proxy vector x is a sparse vector reflecting the sparse characteristics of the CFR in the distance domain.\n    The distance of each path is corresponding to a unique element of the channel proxy sparse vector x .\n    Then, the support Ω of the sparse vector x , i.e., the set of the subscripts of the non-zero elements, is given by\n    \n    \n        Ω  = {⌊s_l/Δ s⌋| l = 0, ⋯ ,L - 1.}.\n    \n    \n    As formulated in the CS-based UVLC channel measurement model in Eq. <ref> , the channel measurement vector y has been represented as the product of an observation matrix and an unknown sparse vector x .\n    Note that the observation matrix Φ is much underdetermined, i.e., the number of columns of the observation matrix is much larger than the number of rows.\n    This means that the amount of measurement data is much less than that of the size of the unknown vector to be reconstructed.\n    \n    The performance of the CS-based methods for sparse recovery is very much related to the mutual incoherence property (MIP) of the observation matrix Φ, which is a sufficient condition for the restricted isometric property (RIP) <cit.>.\n    RIP can be also regarded as a metric to indicate the incoherence of the observation matrix, which is an important constraint affecting the performance of CS-based methods <cit.>.\n    Since it is easier for the MIP to be quantitatively evaluated, it is used to measure the incoherence of the observation matrix in this paper.\n    Specifically, the MIP of the observation matrix Φ of the CS-based UVLC channel measurement model in Eq. <ref> is defined as\n    \n    \n        μ  = max_0 ≤ j,k ≤ N - 1,j  k| ⟨φ _j,φ _k⟩|/φ _j_2·φ _k_2,\n    \n    where φ _j and φ _k represent the j -th and k -th columns of the observation matrix Φ , respectively;\n    ⟨φ _j,φ _k⟩ is the inner-product of the two column vectors.\n    \n    According to Eq. <ref>, it can be derived that the MIP of the observation matrix given in Eq. <ref> is generally not small, and even might be close to one in some extreme case, resulting in weak RIP.\n    In this case, the classical CS-based methods for sparse recovery will suffer from significant performance degradation, or even do not work <cit.>.\n    To this end, we utilize the deep learning technology to enhance the sparse recovery methods for sparse UVLC channel estimation.\n    \n    Specifically, a deep sparse-learning-based framework of UVLC channel estimation is formulated as shown in Fig. <ref>.\n    The classical iterative sparse approximation algorithm of AMP is mimicked by a deep-unfolding neural network.\n    The parameters of each layer of the network can be learnt in training.  Considering the bottleneck of weak RIP of the observation matrix, we need to relieve the constraint on the incoherence of the observation matrix, and find another approach to compensate for the capability of sparse recovery.\n    Through the data-driven approach in deep learning, we can obtain some inherent features out of the UVLC channel apart from sparsity <cit.>.\n    In this way, the performance of deep sparse learning enabled channel estimation in UVLC environments can be significantly improved.\n    \n    The proposed scheme of sparse learning based UVLC channel estimation (SL-UVLC) consists of two phases, i.e., the training phase and inference phase, which is summarized in Algorithm 1.\n    \n    In Algorithm 1, x̂_t is the channel sparse proxy vector recovered by the t -th layer; v_t is the residual of the t -th layer, and b_tv_t - 1 is called the OnsagerCorrection term;\n    σ _t is the standard deviation estimate of v_t ;\n    B_t and ζ _t are the learnable parameters that vary with the number of layers, where B_t is initialized by the observation matrix, i.e., B_tΔ = Φ^H , and ζ _t is used to control the fidelity of the soft threshold function η(∙ ; ∙) , which is expressed as\n    \n    \n        [η(r_t ; ζ_t, σ_t)]_i    =η(|r_t, i| ; ζ_t, σ_t) \n           =sgn(r_t, i) max(|r_t, i|-ζ_t σ_t, 0).\n    \n    The loss function L_t( Θ) of the t -th layer is  given by\n    \n    \n        L_t(Θ)=1/D∑_d=1^Dx̂_T(y^(d) ; Θ)-x^(d)_2^2,\n    \n    where x^( d ) and y^( d ) represent the ground-truth channel sparse proxy vector and the channel measurement vector of the d -th training data sample, respectively, and x̂_T( y^( d );Θ) is the estimated channel sparse proxy vector which is the output of the network.\n    \n    \n    \n    In the training phase of Algorithm 1, using the UVLC channel training dataset {( y^d,x^d)}_d = 1^D , the learnable network parameters Θ = {B_t,ζ _t}_t = 1^T of the sparse learning based model-driven deep-unfolding networks are trained layer-wise to extract the inherent features of the UVLC channel.\n    When optimizing the t-th layer, the network parameters learned by the previous layer is fixed, and the learnable parameters Θ = {B_t,ζ _t}_t = 1^T of the current t -th layer is trained.\n    The loss function L_t( Θ) is jointly optimized by back propagation and the stochastic gradient descent.\n    If L_t( Θ) < L_t - 1( Θ) , the number of network layers is increased by one and the training is continued to the next layer;\n    Otherwise if L_t( Θ) > L_t - 1( Θ) , the training terminates and the final number of layers is set as T = t - 1 .\n    \n    \n    \n    In the inference phase of Algorithm 1, the realistic channel measurement vector y are input into the trained network, and a single feed-forward operation can be used to efficiently estimate the sparse proxy vector x̂ .\n    Then, the channel parameters {λ _l,0 ≤ l < L} , the propagation distance s_l and the attenuation factor α _l can all be obtained from x̂ according to Eq. <ref>, which realizes the estimation  of the UVLC channel.\n    \n    \n    \n    § SIMULATION RESULTS\n    \n    \n    In this section, the performance of the proposed SL-UVCE scheme for UVLC channel estimation based on sparse learning is evaluated by simulations with respect to the amount of available measurement pilots and the number of paths of the UVLC channel.\n    The existing non-CS-based least squares (LS) scheme <cit.> and the classical CS-based algorithm of orthogonal matching pursuit (OMP) <cit.> are also evaluated for comparison.\n    The simulation parameters used for UVLC channel estimation are listed in Table 1.\n    \n    \n    \n    For the training phase, randomly generate the training set {( y^d,x^d)}_d = 1^D of size D = 1000 according to the system model in Section +2, and generate the testing set {( y^s,x^s)}_s = 1^S of size S = 100 in a similar way to prevent overfitting of the deep-unfolding neural network. The Adam optimizer is adopted to optimize the learnable network parameters Θ = {B_t,ζ _t}_t = 1^T with the learning rate l_r = 0.01 .\n    The performance of UVLC channel estimation is evaluated by normalized mean square error (NMSE) defined as\n    \n    \n    \n        NMSE=𝔼[x-x̂_2^2/x_2^2],\n    \n    where x̂ represents the estimated channel sparse proxy vector result ; ∙_2 and 𝔼[∙] denotes the l_2 -norm and the expectation operator, respectively.\n    \n    \n    \n    The performance of the proposed scheme of UVLC channel estimation with respect to the amount of available measurement pilots is reported in Fig. <ref>.\n    It is observed from Fig. <ref> that the proposed SL-UVCE scheme achieves satisfactory performance in estimating the realistic UVLC channel.\n    It is shown that the NMSE decreases with the amount of available measurement pilots for the proposed scheme. With less than 70 pilots, the NMSE of the proposed scheme can reach below 10^ - 2 , which can already support reliable underwater wireless broadband transmission in case of severe channel conditions like offshore areas with relatively large number of channel paths. In comparison, it can be observed from Fig. <ref> that the performance of both the classical CS-based algorithm of OMP and the conventional non-CS-based LS scheme hardly improve with the pilot amount, which validates the effectiveness of the proposed scheme in estimating the complex UVLC channel.\n    It is also observed that the CS-based OMP algorithm outperforms the LS scheme, because the sparse characteristics of the UVCL channel is utilized.\n    However, due to the weak RIP condition of the observation matrix of the CS-based UVLC channel estimation model, the accuracy of the sparse recovery of the channel is limited. On the contrary, the proposed SL-UVCE scheme has introduced the deep-unfolding neural network to better extract the sparse features of the UVLC channel and to learn the inherent channel characteristics other than sparseness.\n    Therefore, in case of insufficient pilots, the proposed scheme can achieve significant performance improvement compared with the benchmark schemes.\n    \n    \n    \n    The performance of the proposed scheme of UVLC channel estimation with respect to the number of channel paths is reported in Fig. <ref>.\n    It is shown from the simulation results in Fig. <ref> that, the proposed SL-UVCE scheme can achieve satisfactory performance of UVLC channel estimation in condition of different number of channel paths.\n    Even in severe underwater conditions such as offshore areas with a relatively large number of channel paths, the proposed scheme can also reach high accuracy of channel estimation.\n    It can also be noted from Fig. <ref> that, the proposed scheme significantly outperforms the CS-based and non-CS-based benchmark schemes, which verifies the capability of the proposed scheme in the sparse feature extraction from the UVLC channel and the sparse recovery of CS-based measurement model with weak RIP for severe seawater environments.\n    \n    \n    \n    \n    § CONCLUSION\n    \n    \n    In this paper, a compressed sensing (CS)-based framework of underwater visible light communication (UVLC) channel estimation has been established to exploit the sparsity of the channel frequency response (CFR) of the UVLC in the distance domain.\n    A scheme of sparse learning based underwater visible light channel estimation (SL-UVCE) has been proposed to solve the formulated sparse recovery problem.\n    The inherent sparsity of the CFR in the distance domain corresponding to multiple channel paths has been fully utilized to formulate the sparse representation of the UVLC channel.\n    Moreover, in order to overcome the problem of weak RIP of the CS-based UVLC measurement model, a model-driven deep-unfolding neural network mimicking the iterations of the iterative sparse approximation algorithm has been devised, which can learn deeper features other than sparsity of the UVLC channel.\n    Simulation results have verified the accuracy and effectiveness of the proposed SL-UVCE scheme, which significantly outperforms the existing CS-based and conventional non-CS-based benchmark schemes, especially in complex conditions, such as insufficient available pilots or severe seawater environments with more channel paths.\n    It is promising for the proposed scheme to be applied in realistic complex environments like offshore and shallow sea waters to satisfy the requirements of effective and reliable broadband underwater transmission.\n    \n    \n    IEEEtr\n"}