{"entry_id": "http://arxiv.org/abs/2303.07378v1", "published": "20230313180049", "title": "Dark-ages reionization and galaxy formation simulation -- XXI. Constraining the evolution of the ionizing escape fraction", "authors": ["Simon J. Mutch", "Bradley Greig", "Yuxiang Qin", "Gregory B. Poole", "J. Stuart B. Wyithe"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA", "astro-ph.CO"], "text": "\n\nfirstpage–lastpage\nDynamical Abelian anyons with bound states and scattering states\n    [\n    March 30, 2023\n================================================================\n\n\n\n\n\n\nThe fraction of ionizing photons that escape their host galaxies to ionize hydrogen in the inter-galactic medium (IGM) is a critical parameter in analyses of the reionization era. In this paper we use the Meraxes semi-analytic galaxy formation model to infer the mean ionizing photon escape fraction and its dependence on galaxy properties through joint modelling of the observed high redshift galaxy population and existing constraints on the reionization history. Using a Bayesian framework, and under the assumption that escape fraction is primarily related to halo mass, we find that the joint constraints of the UV luminosity function, CMB optical depth, and the Lyα forest require an escape fraction of (18±5)% for galaxies within haloes of M≲10^9M_⊙ and (5±2)% for more massive haloes. When considered with respect to galaxy properties, we find that the transition from values of escape fraction from ∼18% to ∼5% occurs at stellar masses of M_⋆∼10^7M_⊙, nearly independent of redshift. As a function of redshift, we find that reionization is dominated by the smaller M_⋆≲10^7M_⊙ galaxies with high escape fractions at z≳6, and by the larger M_⋆≳10^7M_⊙ galaxies with lower escape fractions at z≲6. Galaxies with star formation rates of 10^-2.5M_⊙yr^-1 to 10^-1.5M_⊙yr^-1 provide the dominant source of ionizing photons throughout reionization. Our results are consistent with recent direct measurements of a ∼5% escape fraction from massive galaxies at the end of reionization, and support recent findings using both hydrodynamic simulations and direct observations which indicate that the dominant sources of escaping ionizing photons during reionization are low mass galaxies.\n\n\n\n\n\n\n\ncosmology: theory; dark ages; reionization; first stars; diffuse radiation; early Universe; galaxies: high-redshift; intergalactic medium; Astrophysics - Cosmology and Nongalactic Astrophysics; Astrophysics - Astrophysics of Galaxies\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\nThe Epoch of Reionization, during which the progenitors of modern day galaxies formed and reionized hydrogen throughout the intergalactic medium (IGM), is the least explored cosmic epoch. However, over the past two decades there has been significant progress in exploring the stellar growth history of these galaxies <cit.>, with a recent step-change in understanding that has arisen through the James-Webb Space Telescope <cit.>. At the same time, observations of the evolution of the ionization state of the inter-galactic medium has been narrowed towards a scenario where reionization completes at, or just below, z∼6 <cit.>. This constraint has been achieved through a combination of the integral measure of the reionization history obtained from CMB measurements <cit.>, and measurements of absorption signals against sources emitting Ly-α photons, including Ly-α forest optical depth, dark gaps and quasar Ly-α emission line damping wings <cit.>.\n\nStar forming galaxies are thought to provide the dominant source of ionizing photons to reionize the Universe <cit.>. However, we are unable to directly relate the observed star forming galaxy population to the evolution in the ionization state of the IGM due to the unknown fraction of ionizing photons which escape from the ISM of galaxies. Given the evolution of galaxy density with redshift, and the expected dependence of star-formation rate with host-halo mass, we expect that there is likely a dependence of escape fraction on these quantities <cit.>. For example, in a scenario where the dominant photon sources are low-mass haloes, reionization starts at higher redshift <cit.>. However, if galaxies in more massive haloes are the more dominant sources, then reionization will be delayed and conclude more rapidly <cit.>. Moreover, since this escape of radiation is likely through channels of low column density HI and dust, the escape fraction is expected to be direction dependent for individual galaxies and to have a large scatter with galaxy properties <cit.>.\n\nGiven the importance of the escape fraction to our understanding of reionization, there have been a number of studies to i) measure the escape fraction directly in individual galaxies <cit.>, ii) to directly simulate the ISM of star forming galaxies in a cosmological context <cit.>, and iii) to infer the average escape fraction properties by comparing observed star-formation rates with the reionization history <cit.>.  \n\nIn this paper we follow the third approach, using a semi-analytic model coupled with semi-numerical calculations of reionization, which offers a computationally efficient route to calculating the connection between galaxy formation and reionization <cit.>. We utilize the Meraxes semi-analytic model <cit.> to provide a realistic description of the galaxy population at z∼4-8, which can be extended to both redshifts higher than observed and to luminosities fainter than observed based on physical descriptions of galaxy formation physics. Meraxes couples this galaxy evolution to the evolution of the ionization state of the IGM self-consistently, with an assumed escape fraction. Our approach is to provide a flexible relationship between galaxy properties and the escape fraction, and then to constrain the parameters describing this relationship via a Bayesian framework. Efficient implementation of the Meraxes semi-analytic model makes this parameter space exploration possible, even though the model includes on the fly calculation of reionization and is directly run on a dark-matter halo population close to the hydrogen cooling limit within a large N-body simulation.\n\nThe paper outline is as follows. In Section <ref> we outline the relevant features of Meraxes. We then describe our implementation of the statistical sampling of the parameter space for Meraxes in Section <ref> before constraining our galaxy formation model parameters in Section <ref>. In Section <ref> we describe the reionization observations we employ before presenting our escape fraction model and the resulting constraints in Section <ref>. We finally provide our discussion and conclusions in Sections <ref> and <ref>, respectively. Throughout this paper, we adopt a standard ΛCDM cosmology with Ω_ m = 0.308, Ω_Λ=0.692 and H_0 = 67.8km/sMpc^-1.\n\n\n\n\n§ MERAXES\n\n\n\n The Meraxes semi-analytic model <cit.> is designed to explore galaxy formation across cosmic time, with a particular focus on the Epoch of Reionization and the first galaxies.\nSome of its key features include a delayed supernova feedback scheme which accounts for the finite lifetime of massive stars and the use of “horizontal” merger trees whereby the entire simulation volume is processed one snapshot at a time (necessary for an efficient treatment of reionization).\nHowever, the defining feature of Meraxes is its close coupling to a modified version of the semi-numerical reionization code, 21cmFAST <cit.>.\nThis allows the self-consistent modelling of reionization, both temporally and spatially, in tandem with the growth of the galaxy population.\nTaking into account both local and external ionizing radiation, we can explore how subsequent star formation is affected and how this feeds back on to the progression of reionization.\n\n\nAs with many other semi-analytic models, Meraxes includes treatments for star formation, supernova feedback, metal enrichment, cooling, AGN feedback, and galaxy mergers.\nIn this section we provide a broad overview of the model and any physical prescriptions that are directly relevant for this work.\nA full description of the model is provided in <cit.> and the subsequent papers referenced below.\n\n\n\n §.§ Tiamat\n\n\nSemi-analytic galaxy formation models work by post-processing dark matter halo merger trees either extracted from cosmological N-body simulations or created using Extended Press-Schechter (EPS) theory.\nIn order to fully model reionization, where the spatial distribution of galaxies directly influences their evolution, the former is required.\n\nIn this work, we utilise the Tiamat N-body simulation, run as part of the Dark-ages Reionization And Galaxy Observables from Numerical Simulations programme <cit.>.\nTiamat consists of 2160^3 collisionless particles following a Planck 2015 cosmology <cit.> in a comoving volume of (100  Mpc)^3, resulting in a particle mass of 3.89 × 10^6  M_⊙.\nThis allows us to identify the majority of atomic-cooling mass haloes across all redshifts during reionization within a large enough volume to provide a statistically representative realisation of the large scale process.\nTiamat has been run down to a redshift of z=1.8 with 101 snapshots output between z=49 and 5, evenly spaced in time with a cadence of ∼ 11  Myr, and a further 64 snapshots at z<5, logarithmically spaced in redshift.\nThis fine snapshot cadence at high redshift allows us to better track the progression of global reionization, which proceeds rapidly during its mid phases.\nIt also allows us to more accurately model the stochastic nature of star formation and its impacts on the reionization process at these high-redshifts <cit.>.\nFor more details on the Tiamat simulation, interested readers are referred to <cit.> and <cit.>.\nDetails on the halo merger tree construction can be found in <cit.>.\n\n\n\n §.§ Star formation and supernova feedback\n\n\n\nThe star formation and supernova feedback prescriptions implemented in Meraxes closely follow those of <cit.>, with updates presented in <cit.>.\n\nAt each time step in the simulation, we calculate the amount of gas required to be accreted by each host dark matter halo in order to maintain the required baryon fraction in the presence of the intergalactic ionization field.\nThis gas is assumed to be shock-heated to the virial temperature of the halo before cooling down to the central regions to form a rotationally supported exponential disc.\nAssuming angular momentum conservation of the gas as it cools, the scale radius of this disc is given by r_ disc = R_ virλ / √(2), where λ is the dimensionless spin parameter of the halo <cit.>.\n\nFollowing <cit.>, we assume that star formation in the disc only occurs once the cold gas density reaches a critical threshold, Σ_ crit, which can be linked to the instantaneous properties of the host dark matter halo.\nThe resulting star formation rate, ṁ_*, is calculated by assuming that some fraction, α_ SF, of the cold gas, m_ cold, above this threshold is then turned into stars per disc dynamical time, t_ dyn:\n\n    ṁ_* = α_ SF/t_ dyn(m_ cold - 2πΣ_ crit r_ disc^2 ) ,\n\n\nGalaxy mergers can also drive shocks and turbulence, resulting in enhanced star formation episodes. We model the fraction of cold gas converted into stars in such events following <cit.>:\n\n    m_ burst/m_ cold = α_ burst(m_ gal/m_ parent)^γ_ burst ,\n\nwhere m_ burst is the mass of newly formed stars, m_ gal and m_ parent are the total baryonic masses of the infalling and parent galaxies respectively, and γ_ burst and α_ burst are free parameters.\nFollowing <cit.>, we fix γ_ burst=0.7 and α_ burst=0.57.\n\nEnergy injection from supernovæ is thought to be the dominant feedback mechanism for controlling the growth of stellar mass (and hence the production rate of ionizing photons) at the high redshifts and low halo masses relevant for reionization <cit.>.\nWe assume that this feedback mechanism is dominated by massive, short-lived (≲ 40  Myr) stars, ending in energetic Type-II supernovæ.\nThe total supernova energy injected into the ISM, Δ E_ total, after a time, t, from past star formation episodes of mass δ m_* is given by:\n\n    Δ E_ total = ϵ∫_0^t δ m_*/dt' dξ(t') dt' ,\n\nwhere dξ is the metallicity dependent energy injection from stars of age t-t' which we calculate directly from the stellar population synthesis code Starburst99 <cit.>, assuming a <cit.> IMF.\nϵ is a free parameter which controls the efficiency with which the injected energy couples to the surrounding ISM.\nThe amount of gas assumed to be directly heated by this energy injection is modelled as\n\n    Δ m_ total = ηδ m_* ,\n\nwhere η is a free parameter commonly referred to as the mass loading factor.\n\nFollowing <cit.>, we assume ϵ and η to take the following functional forms:\n\n    ϵ = ϵ_0 (1+z/4)^α_ eject(V_max/60  km s^-1)^β  and\n\n\n    η = η_0 (1+z/4)^α_ reheat(V_max/60  km s^-1)^β ,\n\nwhere V_ max is the maximum circular velocity of the host halo, β = -3.2 (-1) for V_max < (≥) 60  km s^-1 <cit.> and α_ reheat=2 <cit.>.\nWe also assume α_ eject=0, as suggested by <cit.>.\n\nThe energy injected into the ISM is used to adiabatically heat the gas in the galaxy to the virial temperature of the host dark matter halo where it joins a hot gas reservoir.\nThe mass of gas added to the hot reservoir, Δ m_ hot, is given by\n\n    Δ m_ hot = 2Δ E_ total/V_ vir^2Δ m_ total .\n\nIf there is more energy available than is required to reheat the full Δ m_ total worth of gas to the virial temperature (i.e. Δ m_ hot > Δ m_ total) then the remainder of the energy is used to eject the remaining mass from the system entirely.\nFor more details on the supernova feedback prescription, see <cit.>.\n\n\n\n §.§ Reionization\n\n\n\nOne of the key features of Meraxes is its treatment of reionization, which is modelled using a modified version of the semi-numerical reionization code 21cmFAST <cit.>.\nAt each time step in the simulation, Cartesian grids of halo mass, stellar mass, star formation rate, and total matter density are constructed.\nThese are then filtered using an excursion set formalism to identify ionized cells where the number of ionizing photons is greater than the number of neutral atoms and recombination events.\nAs discussed in Section <ref>, the key free parameter controlling this process is the escape fraction of ionizing radiation from the source galaxies, f_ esc.\n\nWhen a patch of the IGM is reionized by UV photons, the temperature of the gas is raised to ∼ 2 × 10^4  K.\nThis acts to raise the local Jeans mass, reducing the amount of material accreted by low mass haloes.\nWe model this process using a baryon fraction modifier:\n\n    Δ m_ baryon = f_ b f_ mod M_ vir - m_\n      baryon ,\n\nwhere Δ m_ baryon is the freshly accreted baryon mass, f_ b=Ω_ b/Ω_ m is the universal baryon fraction, m_ baryon is the mass of baryons already present in the halo, and f_ mod is the baryon fraction modifier.\nThe value of f_ mod is calculated following <cit.> and depends on the mass of the halo, the strength of the local UV ionizing background (which is again strongly dependent on the ionizing escape fraction), and the time over which the halo has been exposed to this background.\nFor further details of the reionization prescription, see <cit.>.\n\n\n\n §.§ UV luminosities\n\n\nIn order to generate UV luminosities for each galaxy at a time t, we construct a full spectral energy distribution (SED) and apply a tophat filter centred on 1600, with a width of 100:\n\n    L_ UV(t) = ∫_1550^1650 dλ∫_0^t dt ∫_Z_ min^Z_ max dZ ψ(t-τ, Z)S_λ(τ, Z)T_λ(τ)\n\nwhere ψ(t-τ, Z) is the metallicity (Z) dependant star formation rate of a burst of age τ, S_λ(τ, Z) is the wavelength and metallicity dependent luminosity of a simple stellar population of age τ, and T_λ(τ) is the dust transmission function.\nWe calculate S_λ(τ, Z) using the publicly available starburst99 stellar population synthesis model <cit.>, including nebular emission lines and assuming a <cit.> IMF with Z_ min=0.001 and Z_ max=0.04.\n\n<cit.> explored a number of physically motivated parametrisations for the dust transmission, T_λ(τ), by constraining Meraxes to match both the evolution of the observed ultraviolet luminosity function (UVLF) and infrared excess (IRX)-β relation at z ≳ 4.\nFor this work, we employ the gas column density dust model whereby the optical depth, Γ_λ, is given by\n\n    Γ_λ = e^-a z(m_cold/10^10 h^-1M_⊙)^γ_ GCD(r_disc/h^-1kpc)^-2(λ/1600 )^n ,\n\nwhere a, γ_ GCD and n are free parameters and r_ disc and m_ cold are as introduced above.\nThe resulting transmission is calculated using the two phase model of <cit.>:\n\n    T_λ(t) =\n      exp(-(τ_ISM-τ_BC) Γ_λ)     t<t_BC\n    exp( -τ_ISMΓ_λ)     t ≥ t_BC ,\n\nwhere τ_ ISM and τ_ BC are again free parameters.\nHere, photons emitted by young stars with ages less than t_ BC must travel through both a dense birthcloud and the more extended ISM.\nAfter this time, the birthcloud is assumed to have been destroyed and the photons are only attenuated by the ISM.\nFor more detail on both the SED construction and dust model see <cit.>.\n\n\n\n\n §.§ Unique features for parameter space exploration\n\n\nOne of the key benefits of semi-analytic models over more detailed hydrodynamic simulations is their relatively low computational expense.\nThis opens up the potential for statistical exploration of the underlying free parameter space <cit.>.\nMeraxes has been designed to maximise this potential by being written to be as efficient as possible without loss of flexibility.\nSome of the relevant unique features of our model include the pre-loading of input data, the utilisation of graphics processing units (GPUs), and the suite of companion tools which have been developed to programmaticaly interact with the model and its output.\n\nIn order to provide a converged sampling of the underlying posterior probability distribution we require many tens-of-thousands of model evaluations for moderate dimensionality problems (∼10 free parameters).\nIn this situation, it is imperative that the model being evaluated can be run as quickly and efficiently as possible.\nFor Meraxes (running on our input N-body simulation, Tiamat) at least ∼70% of the time taken for a single model call is devoted to reading in the trees and dark matter density grids from disk, distributing them amongst all available processors, and processing their contents.\nTherefore, we have modified the SAM to be able to read in all input data once, store this in memory, and then to run multiple times without the need for any expensive input-output (IO) calls.\n\nA further computational bottleneck for Meraxes is its treatment of reionization using a modified version of the 21cmFast <cit.> semi-numerical code.\nThis currently requires the model to filter a number of 3D Cartesian grids using an excursion set formalism at every snapshot.\nEach of these excursion set calculations entails a large number of Fourier transforms and multiple loops over every cell (of which there are 256^3 for this work) in the gridded volume.\nTo reduce the amount of time spent doing this expensive calculation, and thus allow our analysis to be completed in a timely fashion, the reionization portion of Meraxes has been re-written to take advantage of the Graphics Processing Units (GPUs) commonly available on the majority of modern high performance computing systems.\nThis has sped up the reionization calculation by a factor of 8 for typical combinations of grid dimensions and hardware resources.\n\n\n\n§ PARAMETER SPACE SAMPLING\n\n\n\nIn order to carry out a statistical exploration of the Meraxes parameter space, we require a method to calculate the likelihood of the model predictions for a given set of parameters and to then provide the code with a new set of trial parameters for the next run.\nTo facilitate this, as well as future parameter space exploration and calibration studies with Meraxes, we have developed a new companion code called Mhysa which provides a flexible two-way communication layer between the model (written in C) and Python.\nMhysa was designed to efficiently facilitate calling Meraxes many times, with different parameter values, and allows us to interface any Python optimisation or sampling package with the model.\nIt also allows us to write all of our likelihood calculations in Python and to leverage its many available scientific and numerical libraries, vastly reducing development time.\nIn practice, Mhysa deals with initialising the model, updating its parameters, directly accessing in-memory galaxies and haloes, calling arbitrary Python code at the end of each snapshot, doing calculations on an independent processor in the background whilst the model is running, and orchestrating multiple instances of the model running concurrently.\n\nA further key feature of Mhysa which greatly enhances future science investigations with Meraxes, is that it is not only limited to statistical sampling.\nOften we wish to simply find the `best” model which matches our chosen observational constraints, without necessarily investigating parameter degeneracies or uncertainties.\nMhysa has been written with a flexible interface that can be used to carry out such a global optimisation of the model parameters using any suitable technique, and leveraging the many publicly available packages.\n\nFor this work, we make use of the publicly available Python package Ultranest <cit.> to carry out our parameter space sampling using the nested sampling <cit.> Monte Carlo algorithm MLFriends <cit.>.\nThe benefit of nested sampling over more traditional Markov Chain Monte Carlo (MCMC) methods for this work is four-fold:\nNested sampling does not require us to have an estimate of the global maximum likelihood parameter values in order to avoid a lengthy burn-in phase;\nit can more efficiently deal with multi modality or complicated degeneracies in probability distributions;\nit typically requires fewer likelihood evaluations to probe the underlying posterior probability distribution to a satisfactory degree of accuracy;\nand it naturally provides us with an estimate of the Bayes evidence that can be used to quantitatively compare the support for different escape fraction parametrisations.\n\nFor each of the parameter space sampling runs presented in this work, we use a minimum of 200 live points.\nThe default Ultranest stopping criteria were employed, with the exception of the maximum fraction of the remaining evidence and minimum effective sample size, which we set to 0.1 and 600, respectively.\n\n\n\n\n§ THE GALAXY UV LUMINOSITY FUNCTION AND Β-M_ UV RELATION\n\n\n\nThe galaxy UV luminosity function is the most direct observational probe of the reionizing galaxy population at z ≥5.\nIt traces the recent star formation at a fixed number density and hence, the total ionizing photon production rate and its spatial distribution <cit.>. \nTherefore, if we are to carry out a quantitative investigation of allowed escape fraction models, we must first calibrate our model against the observed UVLF.\n\n\n\nThe free parameters of the model which we allow to vary when fitting the UVLF are listed in Table <ref>. These are identical to the free parameters used by <cit.> and include four galaxy formation parameters controlling star formation and supernova feedback, as well as four parameters which control dust extinction and how it varies with cold gas mass. These parameters have been shown in previous works to be the most important for controlling the growth of early galaxies in our model <cit.> and reproducing the evolution of the UVLF <cit.>.\n\nThe assumed prior distributions for each parameter are presented in Appendix <ref>. They are selected to weakly encode our past experience and physical intuition, however, we have ensured that our conclusions are insensitive to our precise choices except where explicitly stated in the text.\n\nFor this work, we utilise the observational luminosity functions from <cit.>.\nFollowing <cit.> <cit.> we enforce a minimum uncertainty of 0.08 dex on all data points.\nSince reionization is known to be largely complete to within x_ HI∼ 0.05 by z ∼ 5 <cit.>, we only consider redshifts greater than this.\nThe volume of our input N-body simulation (100  Mpc)^3 also limits the brightest galaxies for which Meraxes can provide statistically significant predictions, due to the low number density of these biased objects.\nTherefore, at each redshift, we only consider luminosities below which observations indicate there should be at least 10 galaxies.\n\nWe calculate the likelihood of a model parameter set, θ, assuming uncorrelated, (log-)Normally distributed, errors:\n  \n    ln( L_ UVLF(θ)) = \n    \n        -1/2∑_i=0^N_d( (log_10(ϕ_i, obs) - log_10(ϕ_i,  mod))^2/σ^2_i - ln (2 πσ_i) ) ,\n\nwhere ϕ_i, obs and ϕ_i, mod are the observations and model predictions for data point i, respectively, σ^2_i = σ^2_i, obs + σ^2_i,  mod is the corresponding variance, and N_d is the total number of data points.\nFor the model variance, we assume a Poisson distribution with a mean equal to the galaxy number counts in each bin.\n\nIn order to fully constrain all eight free model parameters and break degeneracies in the dust extinction model, <cit.> found it necessary to additionally constrain against the evolution in the UV slope (β) as a function of magnitude (M_ UV). We do similarly here, utilising the biweight mean observations of <cit.> and again assuming uncorrelated, (log-)Normally distributed errors as per Equation <ref>.\n\n\n\n §.§ Constraints on galaxy formation parameters\n\n\n\n\n\n\n\nWe now explore the constraining power of the UVLF and β - M_ UV relation on the galaxy formation parameters of our model.\nIn <cit.>, we demonstrated that reionization feedback only plays a minor role in shaping the evolution of the observable z ≳ 5 galaxy population.\nWe therefore ignore our reionization constraints and turn off reionization feedback for this section, simplifying our interpretation and speeding up our calculations.\n\nThe model UVLFs are presented in Figure <ref>.\nShaded bands indicate the 68% and 95% confidence intervals of the model results, sampled from the underlying posterior distribution.\nThe model is able to replicate the observational data reasonably well, across all redshifts, however, the 68% range of the model ϕ at fixed M_ UV is noticeably smaller than that of the constraining observations.\nThis stems from a tension in matching all four redshifts simultaneously, especially around -21 ≲ M_ UV≲ -20, where the observed dϕ/dz varies non-monotonically.\nIn Figure <ref>, we show the corresponding β - M_ UV relation.\nHere, the uncertainty in the model results is more similar to that of the constraining observations at z=5. We also show in Figure <ref> the corresponding prediction for the star formation rate density (and volume averaged intrinsic ionizing emissivity) evolution together with their 68% and 95% confidence intervals. At redshift 8, the predicted emissivity can vary by ∼25%, decreasing to ∼ 10% by z≲5.\n\nThe maximum a-posteriori (MAP) parameter values, along with their marginalised posterior modes and highest density intervals (HDIs), are presented in Table <ref>.\nThe corresponding one and two-dimensional posteriors are also shown in Appendix <ref>.\nWith the exception of the critical surface density for star formation (Σ_n) and supernova energy coupling efficiency (ϵ_0), all of the parameters possess a well-defined peak in their posteriors which is independent of the imposed priors.\nThere are a number of degeneracies between the galaxy formation and dust model parameters. For example, a higher critical density for star formation (Σ_n) leaves more cold gas available for efficient star formation in massive systems and hence requires more dust attenuation there (controlled by γ_ GCD) to match the bright end of the UVLF.\nThe similarity of the ϵ_0 posterior distribution to its prior at all but the smallest values indicates that the model's supernova feedback energy coupling has a minimum viable efficiency, beyond which there is little change to the predicted UVLF. This is due to saturation effects. Once ϵ_0 is large enough, all available cold gas (as determined by the mass loading factor, η_0, and available cold gas reservoirs in the galaxy) is ejected and increasing the value of ϵ_0 has no effect.\n\n \n\n\n\n\n\n\n\n\n\n§ OBSERVATIONAL CONSTRAINTS ON REIONIZATION\n\n\n\nWhilst the evolution of the observed UV luminosity function allows us to constrain the ionizing photon budget as a function of time, it does not provide any direct constraint on the fraction of these photons which escape their source galaxy and participate in reionization (f_ esc).\nFor this, we turn to the following three observations.\n\n\n\n\n\n §.§ Thompson scattering optical depth\n\n\n\nThe integrated optical depth due to Thompson scattering of cosmic microwave background photons by free electrons can be expressed as:\n\n    τ_e =    ∫_z=0^∞c  dt/ dz(1+z)^3σ_ T\n       ×[Q^ m_ HII<n_ H> +\n                 (Q^ m_ HeII + 2Q^ m_ HeIII)\n                 <n_ He>]  dz ,\n\nwhere σ_ T=6.652× 10^-25  cm^2 is the Thomson scattering cross-section, Q^ m_X is the mass-weighted global ionized fraction of species X, and <n_ H> = 1.88× 10^-7 (Ω_ bh^2/0.022)  cm^-3 and <n_ He> = 0.148× 10^-7 (Ω_ bh^2/0.022)  cm^-3 are the average comoving density of hydrogen and helium, respectively <cit.>.\nIn order to calculate τ_e from our model we follow the assumptions outlined in <cit.>.\nIn particular, we assume that helium and hydrogen are singly ionized at the same rate (i.e. Q^ m_ HeII(z) = Q^ m_ HII(z) and Q^ m_ HeIII(z>4)=0.0) until z=4, after which helium is assumed to be doubly ionized <cit.>.\n\nWe utilise the <cit.> measurement of τ_e=0.058 ± 0.012 as our single data point.\nAs with the ionizing emissivity constraint above, we use use a standard χ^2 likelihood and assume Normally distributed errors.\nWe further assume that the uncertainty on the model prediction is negligible and that there is no missing or underestimated systematic uncertainties associated with the observational data.\n\n\n\n\n §.§ Ionizing emissivity\n\n\n\nThe instantaneous ionizing emissivity (the number of meta-galactic ionizing photons per unit time, per Hydrogen atom[Often commonly expressed as the number of ionizing photons per unit time, per unit volume]) at the latter stages of reionization, can be inferred from Lyman-alpha forest observations <cit.>.\nFollowing <cit.>, we calculate this quantity from Meraxes using:\n\n    Ṅ_γ = ṁ_* N_γ/m_⋆f_\n      esc/f_ bM_ tot(1-0.75 Y_ He) ,\n\nwhere ṁ_* is the total star formation rate in the full simulation volume, N_γ/m_⋆ is the number of ionizing photons per stellar baryon (fixed at 6000 to be consistent with our assumed <cit.> IMF, f_b=Ω_b/Ω_m is the universal baryon fraction, and Y_ He is the Helium mass fraction.\n\nIn this work, we constrain against the emissivities calculated by <cit.>.\nThese were derived by combining the most recent measurements of the IGM opacity and gas temperature out to z∼6 with a suite of high-resolution hydrodynamic simulations covering a broad range of IGM thermal histories.\nFor more details on both the methodology used to obtain the observed ionizing emissivity values and the treatment of the associated errors, we refer the reader to <cit.>. We utilise a standard χ^2 likelihood assuming Normally distributed and uncorrelated errors (c.f. equation <ref>).\nWe choose to restrict ourselves to z>5 in this work. While observations are available at z<5, and these ionizing emissivity data would place tighter constraints, at these redshifts the contribution from AGN can become non-negligible.\n\n\n\n\n §.§ Global neutral fraction\n\n\n\nThe volume averaged global neutral fraction can be probed observationally by a number of indirect methods.  These include Lyman-α source counts <cit.>, Lyman-α and Lyman-break galaxy clustering <cit.>, and QSO damping-wing absorption features <cit.>.\nDue to the small available sample sizes and model-dependent nature of these probes, the associated uncertainties on individual measurements are typically large.\nHowever, a direct measure of the volume averaged global neutral fraction, x̅_ HI, can also be obtained from the fraction of pixels with zero flux in high-z quasar spectra <cit.>.\nThe appearance of these `dark' pixels in the Lyman-α and/or β forests indicates the presence of intervening neutral hydrogen, providing an upper limit to the cosmological neutral hydrogen fraction.\n\nIn this work, we utilise a number of different neutral fraction constraints assembled from the recent literature,\nincluding both model dependent and independent sources <cit.>.\nWith the exception of the model independent dark pixel constraints, we restrict ourselves to only utilising observational values with error bars, rather than upper or lower limits.\nThis is largely motivated by the difficulty in sensibly assigning uncertainties to such limits.\nHowever, limited investigation has further suggested that the inclusion of these limits, with the most conservative assumption of a step function likelihood, leads to very little additional constraining power on the evolution of our model escape fraction in any case.\n\nWe use the 1-sigma uncertainties on each data point as presented and, following <cit.>, we model upper and lower limits as a one sided Gaussian with a likelihood of 1 below (/above) the observed value.\nThe model predictions are obtained by calculating the fraction of cells in our reionization grid with a neutral fraction less than 10^-4 at the central redshift of each data point.\n\n\n\n§ RESULTS\n\n\n\nIn this section we use our best fit model (MAP) combined with a flexible halo mass dependent model for escape fraction to constrain the relation between escape fraction and galaxy properties, and to compute their contribution to the ionizing photon budget.  \n\n\n\n §.§ Constraints on escape fraction evolution\n\n\n\nRecent numerical studies have indicated that there is a likely correlation between halo mass and the escape fraction of ionizing photons <cit.>\nThis is thought to be a result of low mass halos having shallower potential wells, allowing supernova to more efficiently clear high density gas in the IGM and provide channels for ionizing photons to escape the galaxy.\nIn this section, we thus investigate the constraining power of the Thompson scattering optical depth, ionizing emissivity, and neutral fraction evolution on f_ esc as a function of halo mass.\n\n\nWe fix all galaxy evolution parameters to their maximum a-posteriori (MAP) values found in Section <ref>, where we constrained the model against the evolution of the UVLF.\nWe note that this removes any extra scatter in the recovered escape fraction introduced by uncertainties in the evolution of ionizing source population, simplifying our interpretation. However the observed star-formation rate density is constrained by the luminosity function to a ∼ 10% level at z∼6 (see Figure <ref>), which is more precise than the observed uncertainties in the ionization rate in the IGM. The 10% uncertainty on the star-formation rate density (which is linearly related to the escape fraction with-respect-to the timing of reionization) is also smaller than the fractional constraints on the escape fraction derived below. We therefore find that the effect of simultaneously allowing our galaxy formation parameters to be free, in addition to the reionization parameters, would be minimal.  \n\n\n\n\n\n\nWe choose a logistic functional form for the escape fraction:\n\n    f_ esc(M_ vir) = f_ min + f_ max - f_ min/1 + exp(-γ_ esclog_10(M_ vir/M_ offset))\n\nwhere\n\n    γ_ esc = 4 df dlog_10M_ vir/(f_ max - f_ min)\n\nThis flexible, four parameter function allows the escape fraction to vary between f_ min and f_ max with a maximum rate of df/(dlog_10M_ vir) midway between the two, at a mass of M_ offset.\nWe use non-flat priors for these parameters, both to encode our physical intuition, and to improve the efficiency of our sampling.\nMore details can be found in Appendix <ref>, however, we have ensured that the precise choice of priors does not influence results except where explicitly discussed below.\n\n\nThe results of the model after constraining against the three observations are presented in Figures <ref> and the 1-D marginalised posterior distributions of the escape fraction parameters are presented in Figure <ref>. Coloured lines and shaded regions show the results of fitting the escape fraction to match each observation independently, whilst black lines and shaded regions show the results of constraining against all three observational datasets simultaneously.\n\n\n\n\n  \n*Thompson scattering optical depth:\nThe Thompson scattering optical depth is an integrated quantity spanning the full history of the IGM back to the surface of last scattering.\nAs such, it is sensitive to both the timing and effective mid-point of reionization.\nFrom panel (a) of Figure <ref> we see that the model is able to reproduce the <cit.> observations (dashed line and hatched region) when using a galaxy growth history consistent with observations.\n\nThe kernel density estimate (KDE) of the 1-D marginalised constraints on the escape fraction parameters are shown by the red lines in Figure <ref>.\nFrom here we can see that the optical depth provides very little constraining power on the escape fraction.\nIt merely demands that the escape fraction value be between ∼ 5 - 35% across the full range of contributing halo masses present in the model (10^8 ≤ M_⊙≲ 10^13).\n\nInterestingly, our model disfavours τ_e ≲ 0.52, even when not requiring a simultaneous match to the observed ionizing emissivity and neutral fraction evolution (red shaded regions).\nThis suggests that achieving lower optical depths requires an escape fraction model which has a stronger scaling with redshift than is possible with halo mass alone.\n\n\n\n  \n*Ionizing emissivity:\nThe total ionizing emissivity (Ṅ) directly constrains the number of ionizing photons entering the IGM and thus, when coupled with a fixed UVLF evolution, places the strongest constraints on the escape fraction.\nFrom the top two panels of Figure <ref> we see that ionizing emissivity prefers a mass independent escape fraction (f_ min≈ f_ max≈ 7 %).\nFor escape fractions parametrisations which vary with mass, there is a preference for a large positive slope (df/dlog_10M_ vir) centred around M_ vir∼ 10^9 - 10^10 M_⊙.\nThis corresponds to a rapidly increasing escape fraction with decreasing halo mass in our parametrisation, resulting in a constraint at M_ vir = 10^8 M_⊙ of f_ esc∼ 5 - 25 %.\nThis is driven by the observed flattening in the ionizing emissivity beyond z ≲ 6, requiring both a rapid increase in the emissivity using early-forming, low mass haloes and a reduced contribution from high-mass haloes to keep the emissivity as flat as possible at low redshift (see blue shaded regions in panel (b) of Figure <ref>).\n\n\n\n\n\n  \n*Neutral fraction evolution:\nThe range of allowed neutral fraction evolution models is shown by the green shaded regions in panel (c) of Figure <ref>.\nThe dark pixel fraction upper limits of <cit.> ensure that reionization is all but complete by z∼5.5.\nCombined with the higher redshift constraints, particularly that of <cit.>, the escape fraction parameters are driven towards producing a late and rapid reionization scenario, requiring a minimum escape fraction of ∼ 12 % across all halo masses (68% confidence).\nThe KDEs of the 1-D marginalised parameter distributions in Figure <ref> again indicate that these observations are consistent with a mass independent escape fraction.\nHowever, there is a weak preference for a positive slope (df/dlog_10M_ vir) and an increase in escape fraction with increasing halo mass.\nThis is contrary to our physical intuition and results from the desire to have as rapid evolution in the neutral fraction as possible, whilst maintaining a late start by keeping the contribution from early-forming, low mass haloes as small as allowed. \n\n\n\n  \n*Combined reionization constraints:\n\n\n\n\n\n\n\n\n\n\nThe black shaded regions in Figure <ref> and black dashed lines Figure <ref> show the result of calibrating the escape fraction model using all three reionization constraints together. For these combined constraints we also present the 2-D marginalised distributions for escape fraction model parameters in Figure <ref> and the corresponding summary statistics in Table <ref>.\nFrom Figure <ref> we can see that the model is able to successfully match all of the observational constraints simultaneously.\nBy including all constraints, we also greatly reduce the allowed range of model results, most notably those of the Thompson scattering optical depth (panel a) and ionizing emissivity (panel b).\nFigures <ref> and <ref> show that a negative df/dlog_10M_ vir (increasing escape fraction with decreasing halo mass) is strongly favoured.\nThe midpoint of the transition between f_ min and f_ max is also restricted to a much narrower range than was the case when constraining against any one observation alone.\n\nIn Figure <ref> we show the resulting constraint on the escape fraction as a function of halo mass.\nAt M_ vir≳ 10^10.5 M_⊙ the escape fraction is ∼ 5%\nThis is driven largely by a low escape fraction in high mass halos being needed to keep the ionizing emissivity as flat as possible at z = 5 - 6.\nThe lack of ionizing photons entering the IGM from high mass haloes reduces the ability of the model to achieve a rapid reionization, producing optical depths ≳ 0.062 and a slower neutral fraction evolution (see panels (a) and (c) of Figure <ref>).\nAt lower masses, the escape fraction rises to ∼ 15 - 30 %, required to start reionization early enough to match all three constraints.\n\nThe dotted line in Figure <ref> shows the maximum aposteriori escape fraction parameterisation (see Table <ref> for the corresponding parameter values). It is tempting to draw conclusions about physical processes colluding to put some particular significance on halo masses of M_ vir≈ 10^9.35  M_⊙, where the sharp transition in f_ esc occurs. However, the marginalised 68% highest density interval for the M_ offset parameter is broad (10^8.38 - 10^9.97  M_⊙; Table <ref>). From Figure <ref>, we can also see that the position of the step is correlated with the maximum and minimum escape fraction parameters. Indeed, this correlation is what drives the appearance of a gradual evolution in 68 and 95% confidence intervals of f_ esc vs. M_ vir in Figure <ref>.\n\nFigure <ref> shows the corresponding cumulative fractional contribution of halos to the instantaneous ionizing photon rate from halos below a given mass at different redshifts. As expected the typical halo mass producing ionizing photons increases during reionization. However, as noted above, the best fit f_ esc( M_ vir) model favours an escape fraction that is dominated by low mass galaxies, while reionization also supresses star formation in low mass halos. Together these effects result in a very rapid transition in the halo mass above which 50% of photons are produced from M_ vir≳10^8.5M_⊙ at z∼9 to M_ vir≳10^10.5M_⊙ at z∼5.\n\n\n\n\n\n §.§ Escape fraction evolution with galaxy properties\n \n\n\nPrevious studies of escape fraction evolution, both using simulations and observations, have found mean trends with galaxy properties such as stellar mass and colour <cit.>.\nIn this section, we use the MAP f_ esc(M_ vir) parameter values to investigate the predicted evolution of the escape fraction with stellar mass and star formation rate.\n\n\n\nThe upper panel of Figure <ref> shows the mean escape fraction as a function of galaxy stellar mass resulting from the f_ esc( M_ vir) model (Equation <ref>) with the MAP parameter values listed in Table <ref>.\nThe shaded region indicates the 95% confidence intervals on the mean, generated from 1,000 bootstrap samples. Since stellar mass correlates positively with halo mass in our model <cit.>, the results are qualitatively similar to the dependance on halo mass.\nThe typical escape fraction decreases from its maximum of ∼ 20% at M_⋆≲ 10^6  M_⊙ to ∼ 7% at M_⋆≳ 10^8  M_⊙.\nThis decrease begins at M_⋆∼ 10^6.5 M_⊙ at z ∼ 15 and shifts to smaller masses as reionization progresses due to a mild evolution of the typical stellar mass hosted by M_ offset = 10^9.25M_⊙ haloes, the pivot point of our MAP f_ esc(M_ vir) model.\n\nThe lower panel of Figure <ref> shows the corresponding cumulative fractional contribution of galaxies below a given stellar mass to the instantaneous ionizing photon rate. Since stellar mass correlates positively with halo mass we see a similar trend as Figure <ref> where the stellar mass above which galaxies dominate the ionizing photon budget increases during reionization. The stellar mass above which 50% of photons are produced is predicted to be close to a constant during the reionization era (M_⋆∼10^6M_⊙ at z≳ 7.5), but then increases rapidly to M_⋆∼10^8.5M_⊙ at z≲6.\n\n\n\nFigure <ref> shows how the mean escape fraction instead varies by star formation rate for our MAP model.\nWe see a similar evolutionary trend as was found with stellar mass.\nThe escape fraction has a more extended evolution with star formation rate as redshift decreases. The lower panel of Figure <ref> illustrates that galaxies with star-formation rates between Ṁ_⋆∼10^-1.5M_⊙yr^-1 and Ṁ_⋆∼10^-2.5M_⊙yr^-1 contribute the dominant sources of ionizing photons throughout reionization.\n\n\n\n\n\n\n\n\n§ DISCUSSION\n\n\n\nBefore concluding we compare our population based findings with other recent theoretical results and observational studies.\n\nSimulations typically show values of escape fraction that vary between a few and a few 10s of percent <cit.>, which is in agreement with our results and with prior empirical comparisons of galaxy luminosity functions and Ly-alpha forest constraints <cit.>. Hydrodynamic radiative transfer simulations further indicate that escape fractions decrease with halo mass for halos with M_ vir≲ 10^9 M_⊙ <cit.>. Most recently <cit.> have computed the escape fractions of reionizing galaxies within the Thesan project. They find that low-mass galaxies having M_⋆≲10^7M_⊙ are the main drivers of reionization above z≳7, while higher-mass galaxies with M_⋆≳10^8M_⊙ dominate the escaped ionizing photon budget at lower redshifts. When calculating the dependence on mean escape fraction as a function of halo mass, <cit.> report a value of a few percent in larger halos with a sharp rise towards halo masses below M_ vir∼10^9M_⊙. Inference studies by <cit.> also consider similar observational constraints to those used in this work (the UV luminosity function, CMB optical depth and dark pixels). Although their UV ionizing escape fraction has a simpler, power-law relation with the host halos mass, they also find f_ esc around 5–30pc for low-mass haloes, with no significant preference on the power-law index. All of these results are in qualitative agreement with our findings, especially when the different simulation techniques and mode of analysis are considered. \n\nIn addition to theoretical results we can compare our results in light of observational estimates of the escape fraction. Using stacked spectra of Lyman break galaxies at z∼3 <cit.> <cit.> find an average value for the escape fraction of 0.06 ± 0.01. Subsequently <cit.> find an anti-correlation between the escape fraction and stellar mass. In Figures <ref> and <ref> we reproduce the measurements of escape fraction from <cit.> for comparison with our model constraints (we stress that these measurements were not included as constraints on our model). The masses of these galaxies are at the upper end of those thought to be responsible for reionization (M_⋆≳10^8M_⊙). However both the value and correlation are qualitatively consistent with our results here, as well as with many of the simulation studies referenced above. \n\nFinally, we note that, whilst our N-body simulation, Tiamat, provides a good balance between mass resolution and simulated volume, it does not fully resolve all haloes down to the redshift-dependent atomic cooling mass threshold. However, we miss less than 3pc of stellar mass at z ≈ 6 and less than 35pc at z ≲ 12, therefore we do not expect this to significantly alter our conclusions <cit.>.\n\n\n\n§ CONCLUSIONS\n\n\n\nWe have used the Meraxes semi-analytic model to infer the mean ionizing photon escape fraction and its dependence on galaxy properties through joint modelling of the observed high redshift UV galaxy luminosity function and the available constraints on the reionization history with the Meraxes semi-analytic model. Meraxes couples galaxy formation to a semi-numerical description of reionization, and allows the self-consistent modelling of reionization, both temporally and spatially, in tandem with the growth of the galaxy population.\n\nIn this paper we present the application of nested sampling to Meraxes, allowing statistical exploration of the underlying free parameter space, including identification of the best fit model as well as statistical confidence intervals. Using a flexible model that relates  the escape fraction to halo mass, we use the joint constraints of the UV luminosity function, CMB optical depth, and the Lyα forest to evaluate the allowed range of escape fraction values and halo mass dependence. Our results show that available constraints require an escape fraction of (18±5)% for galaxies within halos of M≲10^9M_⊙ and (5±2)% for larger mass halos. \n\nBecause Meraxes provides the star-formation rates and stellar masses for each dark matter halo at each simulation snapshot, we can use these results to estimate the dependence of escape fraction on stellar mass and redshift. We find that there is a transition from an escape fraction of ∼18% to a smaller value of ∼5% which occurs at stellar masses of M_⋆∼10^7M_⊙. We find that this transition value is quite insensitive to redshift. Early in reionization it corresponds to star formation rates of Ṁ_⋆∼10^-1M_⊙yr^-1, and decreases towards Ṁ_⋆∼10^-2M_⊙yr^-1 by the end of reionization at z∼5.\n\nWhen considering the contribution of galaxies to the ionizing photon budget as a function of redshift, we find that reionization is dominated by the smaller M_⋆≲10^7M_⊙ galaxies with high escape fractions at z≳6, and by the larger galaxies M_⋆≳10^7M_⊙ with lower escape fractions at z≲6. These stellar masses correspond to galaxies with star formation rates of between Ṁ_⋆∼10^-1.5M_⊙yr^-1 and Ṁ_⋆∼10^-2.5M_⊙yr^-1, which represent the dominant sources throughout reionization. In sum, these results agree with recent direct measurements of a ∼5% escape fraction from massive galaxies at the end of reionization, and support results from hydrodynamic modelling and direct observation indicating that the escape of ionizing photons is dominated by low mass galaxies during reionization.\n\n\n\n\n§ ACKNOWLEDGEMENTS\n\n\nThis research was supported by the Australian Research Council Centre of Excellence for All Sky Astrophysics in 3 Dimensions (ASTRO 3D), through project number CE170100013.\nParts of this work were performed on the OzSTAR national facility at Swinburne University of Technology.\nThis work was supported by software support resources awarded under the Astronomy Data and Computing Services (ADACS) Merit Allocation Program. ADACS is funded from the Astronomy National Collaborative Research Infrastructure Strategy (NCRIS) allocation provided by the Australian Government and managed by Astronomy Australia Limited (AAL).\n\nThis research relies heavily, and with great thanks, on the Python open source community, in particular numpy <cit.>, scipy <cit.>, Cython <cit.>, matplotlib <cit.>, h5py, ultranest <cit.>, seaborn <cit.>, mpi4py <cit.>, jupyter <cit.>, jinja2, click, pandas <cit.>, and xarray <cit.>.\n\n\n\n§ DATA AVAILABILITY\n\n\nThe data underlying this article will be shared on reasonable request to the corresponding author.\n\n\n\n\n\n\n\nmnras\n\n\n\n\n\n\n\n\n\n\n\n\n§ PRIOR AND POSTERIOR PARAMETER DISTRIBUTIONS\n\n\n\nIn this Appendix we present the 2-D marginalised probability distributions (Figure <ref>) for the fits of the Meraxes model to the galaxy UV luminosity function and β-M_ UV relation discussed in Section <ref>. It is worth noting that <cit.> also used Meraxes with the same free galaxy formation and dust parameters as we do, but recovered different posterior distributions for some parameters (see their figure A3). This can largely be attributed to the different redshift range utilised for their constraints (z=7 - 4). The inclusion of lower redshift data, in particular, provides significant extra constraining power. The remaining differences are due to our different choice of priors which can have an impact on poorly constrained parameters.\n\nWe also provide detail of the prior probability distributions employed for all free parameters in this work. These encode the range in allowed values (e.g. efficiency parameters must be in the range 0–1). In some cases they also weakly encode physical intuition and the authors experience from past studies. We have ensured that the precise choice of priors makes no significant qualitative or quantitative difference to our findings except where explicitly noted in the text.  In appendix Table <ref> we present a tabulated description of the priors, and show these graphically in Figures <ref> and <ref>.\n\nNote that we do not use uniform priors as commonly employed in the galaxy formation literature. Our reasoning is that flat priors give extra, undue, weight to parameter values which we know from experience and physical intuition to be unlikely. When using such priors, one also must choose bounds for the parameter values, which in itself often imposes prior knowledge or intuition anyway. The use of weakly informative priors, such as the ones we employ, additionally provides numerous other statistical benefits <cit.>.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}