{"entry_id": "http://arxiv.org/abs/2303.07246v1", "published": "20230313161739", "title": "Modelling self-consistently beyond General Relativity", "authors": ["Ramiro Cayuso", "Pau Figueras", "Tiago França", "Luis Lehner"], "primary_category": "gr-qc", "categories": ["gr-qc"], "text": "\n\n\n\n\nPerimeter Institute for Theoretical Physics, 31 Caroline Street North, Waterloo, ON N2L 2Y5, Canada\nDepartment of Physics and Astronomy, University of Waterloo, Waterloo, Ontario, N2L 3G1, Canada\n\nSchool of Mathematical Sciences, Queen Mary University of London, Mile End Road, London, E1 4NS, United Kingdom\n \nSchool of Mathematical Sciences, Queen Mary University of London, Mile End Road, London, E1 4NS, United Kingdom\n\nPerimeter Institute for Theoretical Physics, 31 Caroline Street North, Waterloo, ON N2L 2Y5, Canada\n\n\n\n\nThe majority of extensions to General Relativity display\nmathematical pathologies –higher derivatives, character change in equations that\ncan be classified within PDE theory, and even unclassifiable ones– that cause severe difficulties to study\nthem, especially in dynamical regimes. We present here an approach\nthat enables their consistent treatment and extraction of physical consequences. \nWe illustrate this method in the context of single and merging black holes in a highly\nchallenging beyond GR theory. \n\n\n\nModelling self-consistently beyond General Relativity\n    Luis Lehner\n    March 30, 2023\n=====================================================\n\n\n\n\nIntroduction\nThe gravitational wave window provides \nexciting opportunities to further test General Relativity (GR), e.g., <cit.>.\nEspecially in the context of compact binary mergers, gravitational waves\nproduced by the strongest gravitational fields in\nhighly dynamical settings arguably represent the best regime to \nexplore deviations from GR, e.g., <cit.>.\n\nSuch effort, the ability to extract consequences and propel theory forward,\nrely on at least having some understanding of the characteristics\nof potential departures, to search and \ninterpret outcomes <cit.>.\n\nUnfortunately, the majority of proposed beyond GR theories have, at a formal level, \nmathematical pathologies which makes their understanding in general scenarios difficult.[For\na rather broad sample of beyond GR proposals, discussed in the context of cosmology, see <cit.>.] Such pathologies may include loss of uniqueness, a dynamical change of character in the equations of motion (e.g., from hyperbolic to elliptic) or, even worse, having equations of motion (EOMs) of unknown mathematical type (e.g., <cit.>). \nThis, combined with the need to use computational simulations to study the (non-linear/dynamical) regime\nof interest, pose unique challenges.\nOf note is that the standard mathematical approach to analyse PDEs  <cit.> –where\nthe high-frequency limit is examined– cannot be applied as it is in such regime\nthat the problems alluded above arise. Further, such regime is \nincompatible with the very assumptions made to formulate \nmost GR extensions which rely on Effective Field Theory (EFT) arguments <cit.>. Faced with this problem, solid novel ideas must be pursued to understand potential solutions.\n\n\nWe report here on a technique to fix the underlying\nequations of motion to an extent to which the viability of a given\ntheory can be assessed.[This approach is motivated in part by the Israel-Stewart formalism for viscous relativistic hydrodynamics <cit.>, though in such case, higher order corrections are known and can be called for to motivate the strategy.] In particular,\nit allows exploring relevant theories within their regime of\nvalidity and, in particular, monitor whether the dynamics keeps\nthe solution within it for cases of interest.\nThis technique, \npartially explored in toy models <cit.> and restricted settings (e.g., <cit.>) is here\ndeveloped for the general, and demanding scenario, of compact binary mergers. This requires further considerations not arising in the previously simplified regimes.\nSpecifically, we present the first self-consistent study of both single and binary \nblack hole (BH) merger in the context of an EFT of gravity where corrections to GR\ncome through high powers (naturally argued for)  in the curvature tensor leading to EOMs with\na priori unclassifiable mathematical character.\n\nWe adopt the following notation: Greek letters (μ, ν, ρ, ...) \nto denote full spacetime indices and Latin letters (i, j, k, ...) \nfor the spatial ones. We use the mostly plus metric signature, and set c=1.\n\n\nFocusing on a specific theory\nWhile we could take any of a plethora of proposed beyond GR theories –almost all sharing\nthe problems  alluded to earlier–, for definiteness here we\n consider a specific extension to GR derived naturally\nfrom EFT arguments <cit.>. In this approach,\nhigh energy (i.e., above the cutoff scale) degrees of freedom are integrated out, and their effects are\neffectively accounted for through higher order operators acting on the lower energy\nones. For the case of gravitational interactions, in vacuum assuming parity symmetry, and accounting for the simplest contribution, \nsuch an approach yields\nunder natural assumptions:[Other\noperators at this (and even lower) orders can be considered, though without loss of generality with\nregards to our goals we ignore them here so as to not overly complicate the presentation. ]\n\n    I_eff = 1/16 G∫ d^4x √(-g)R - 1/Λ^6 C^2 + ⋯ ,\n\nwhere  C=R_R^\nand the coupling scale Λ has units of [M_S]^-1 for some scale M_S. The equations of motion are G_ = 8  H_, \nwith G_ the Einstein tensor, ≡Λ^-6 and\n\n    H_   =     C[ R_-12∇_∇_ R-116 C g_ -R_ł R^ł_ł\n          +R^R_+12 R_ł̊R_^ł̊]  \n          +2(∇^C)[∇_ R_-∇_(R_)]\n            +R_^α∇_∇_C .\n\nH_ is covariantly conserved, since it is derived from an action possessing local diffeomorphism invariance.\n\nIn GR (ϵ=0) the resulting EOMs can be shown to define a hyperbolic, linearly degenerate, non-linear, second order, PDE system of equations with constraints\n(e.g., <cit.>). With suitable coordinate \nconditions, characteristics are given by the light cones and do not cross –thus\nshocks or discontinuities cannot arise. The right hand side (RHS) however, spoils all these considerations. Derivative operators higher than\nsecond order appear –which render the equations outside formal PDE classifications.\nHow is one to approach the study of this problem? First, one can simplify \nsomewhat the EOMs by applying an order reduction  and replace the Ricci tensor and the Ricci scalar. Since in this work we consider vacuum spacetimes Ric∼𝒪(ϵ), the contribution of the Ricci tensor to the RHS is 𝒪(ϵ^2) and we can ignore it at the order that we are considering. We are left with the following EOMs at O(ϵ):\n\n    G_μν = ϵ(4 𝒞 W_μ^μαβγ W_ναβγ   -g_μν2 𝒞^2+8 W_μαν^μανβ∇_α∇_β𝒞)\n     ,\n\nwhere W_αβγδ is the Weyl tensor since R_μνρσ=W_μνρσ + 𝒪(ϵ). Then, 𝒞=W_αβγδ W^αβγδ. System (<ref>), containing derivatives up to fourth order of the spacetime metric (in ∇_α∇_β𝒞), has no proper classification within PDE theory. \n\nPrototypical model\nFor interacting binaries one must deal with strong curvature regions which move \nand, crucially, merge. A successful general strategy must account for the backreaction\nof corrections onto the motion itself, otherwise at least secular terms will\nspoil the accuracy (and hence usefulness) of the\nsolution <cit.>. As a preliminary\nchallenge, consider the following model that captures key aspects of the problem,\n\n    ϕ = -ϵ ∂^4_t ϕ ,\n\nwith  denoting the standard d'Alembertian in Cartesian coordinates and a RHS which spoils its mathematical character. At an intuitive level one would regard the RHS as introducing small modulations\non a solution that travels at the light speed (assuming both a small parameter ϵ and regarding ϕ described by long-wavelength modes). However, a straightforward analysis indicates that\nthe higher time derivatives lead to ghost modes that grow without bound.\nOne can try to address this issue by `order reduction'. That is, replacing: (A) ∂^4_t ϕ≈∂_t^2 C(ϕ), with C(ϕ)=∂_xxϕ (the RHS of ∂_t^2 ϕ at zeroth order), or even (B) ∂^4_t ϕ≈∂_x^4 ϕ. Depending on the sign of ϵ, Option (A) leads\nto high frequency modes not propagating or blowing up, while (B) leads to even faster blowing up modes or acausal propagation. Neither is consistent with the intuition above. Generically, high frequency modes are problematic.[Recall, numerical implementations continuously feed high frequency modes through the discretization employed.] \nWhile in linear problems a frequency cut-off could be introduced, in non-linear ones  such a strategy is uncertain due to mode couplings potentially feeding long wavelengths into short ones, and vice versa. \nThe challenge is to control the equation, render the problem of interest well posed \nand achieve a method that incorporates the effect of corrections contemplated by the theory at long wavelengths  while sensibly controlling short wavelengths; and, doing so without unduly increasing the cost of obtaining trustable solutions. \nIn particular, it should allow inquiring whether a significant flow to the UV takes place which would indicate that the original theory generically abandons the EFT regime for problems of interest –unless\nsuch UV flow takes place hidden behind a stable horizon. \nIf the opposite is the case, to consistently incorporate\nthe effect of corrections to the theory. To address this challenge, starting from option\n(A) above,[Which is the most closely associated to our desired problem.] \nwe fix the equation as\n\n    ϕ = -ϵ ∂^2_t Ĉ , \n          τ∂_0 Ĉ +\n    σ (∂_t^2 - 2β^i∂_ti+β^iβ^j∂_ij)Ĉ = C(ϕ) -Ĉ ,\n\nwith ∂_0=∂_t - β^i ∂_i and β^i an “advection” vector. \nThe resulting second order system determines the evolution of the \nvariable Ĉ that is damped towards the “source” C(ϕ) on a \ntimescale σ/τ. Notice that a non-trivial stationary solution such that C(ϕ)=Ĉ cannot be achieved  for non-zero values of τ and σ (as the RHS is damped to zero, the  left hand side would continue to source it otherwise). The difference between Ĉ and its target value C(ϕ) decreases with τ and σ and ultimately these parameters should be chosen to minimise this difference while preserving numerical stability.\nTo demonstrate the effectiveness of Ĉ accounting for C(ϕ) \n(which we call “Tracking”) and the numerical stability of the fixed system, \nwe carried out a parameter exploration of τ and σ. We implement a 1D simulation in a periodic domain\nof size L=200, discretized by a uniform grid, sixth order accurate spatial derivatives, Runge-Kutta of fourth order for time stepping, and Kreiss-Oliger dissipation with Δ t/Δ x=1/4. \nAs initial data, we adopt  \nϕ(0,x)=10^-3  e^-1/2(x -100)^2, with Ĉ=ϕ_,xx and {ϕ_,t=ϕ_,x ; Ĉ_,t=ϕ_xxx} and fix ϵ = 10^-3. We also\nchoose β^i=δ_x^i, coincident with the speed of propagation of the main pulse\nin the uncorrected equation.\nDuring the evolution, beyond the advection\nof the main `pulse', the solution develops a distinctive long oscillatory tail \nas a result of the “correcting term”, without high frequency modes spoiling it.    \nWe evolved the system until the spatial extent of the tail becomes comparable to the size of the domain and compute a tracking measure as:\n \n     𝒯(C,Ĉ) = ||C(ϕ) -Ĉ||_2/||C(ϕ)||_2.\n \nThis is shown in figure <ref> for a range of {σ,τ}, overall obtaining good tracking.\nNotice the existence of a region where evolutions fail for values of σ < 10^-4 as the equations become stiff but we checked that a smaller timestep resolves this issue. Second, 𝒯 improves linearly with decreasing σ. Third, there is a linear dependence of 𝒯 with τ for large values, while it flattens for smaller ones and 𝒯 depends only on σ.\n\n\n\nGravity and Black holes\nWe turn now to the demanding task of simulating dynamical BH spacetimes \n(with single boosted BHs and binaries) in the chosen EFT extension to GR.\nMotivated by the previous discussion we \nfix the system (<ref>) by introducing a\nnew independent variable Ĉ in the following way, \n\n    G_μν = ϵ(4 Ĉ W_μ^μαβγ W_ναβγ -g_μν2 Ĉ^2 +8 W_μαν^μανβ ∇_α∇_βĈ) \n       (∂_t^2-2β^i∂_ti+β^iβ^j∂_ij) Ĉ = 1(  C-Ĉ -τ∂_0 Ĉ) ,\n\n where second time derivatives of the metric in the RHS are\nreplaced –following a reduction of order strategy– using the zeroth order Einstein equations.\nThe resulting system of equations involves at most second-time derivatives \nand Ĉ is damped to the physical 𝒞 on a timescale ≃σ/τ (for our choices, up to ≃ 10 M_S, which is shorter than any dynamical\ntimescales in the system). \nAs a result, beyond a lengthscale ≃σ^1/2 (for our choices, up to ≃ 0.2 M_S) the\nsystem reduces to the original one, while shorter ones are damped and controlled, and\nwe can explore even shorter scales through suitable extrapolation of our results, as\nwe discuss in the Supplemental Material.\nThe new variable Ĉ, in essence, brings back (some of) the degree(s) of\nfreedom integrated out to arrive to the EFT theory, in this case a massive scalar (see e.g., <cit.>) and our strategy defines a completion of the EFT.\nNotice that the operator ∂_0 with the advection vector (corresponding\nto the shift vector in the 3+1 decomposition) helps ensuring inflow towards\nthe BH(s). As we shall see, this is enough to control the whole system. That a single scalar suffices is related to it encoding the only contribution of higher derivatives and controlling it results in an overall effect ensuring high frequency modes are\nkept at bay. Depending on the structure in other theories, one might need to introduce further quantities (see e.g., <cit.>). Nevertheless, the overall strategy remains unchanged.\n\n\nInitial data\nWe define initial data by a single (for the single BH case) or a superposition of \nboosted BHs as described in GR and dynamically \n“turn on” the coupling ϵ bringing it\nfrom 0 to the desired value with a quadratic function in a window  t∈[10,30]M.\nThis allows the coordinate conditions to settle before incorporating deviations from GR, inducing only smooth constraint violations (which are damped through the now\nstandard use of constraint damping <cit.>) and by-passing the solution of initial data problem \nwithin the EFT theory, a task which in itself has received also limited formal and numerical attention. Again the presence of higher derivatives obscures the treatment.[See <cit.> for the case of a perturbed BH in spherical symmetry and <cit.> for the construction of initial data in scalar-tensor theories of gravity.]\n\nFor initial data in the single BH case,\nwe use a boosted BH solution derived from the conformal transverse-traceless\ndecomposition <cit.>, which uses an approximate conformal\nfactor solution to the Hamiltonian constraint, valid for small boosts.\nFor the binary BHs, we adopt Bowen-York-type-of initial data <cit.> describing two superposed\nequal mass, boosted, non-spinning BHs in a quasi-circular orbit.  The individual masses are m_i≈ 0.5M, i=1,2, and the separation is D∼ 12M (initial orbital\nfrequency ≃ 0.025/M). The momenta are tuned so this binary is initially\nin quasi-circular motion, and in GR it describes 12 orbits before merger (the initial\nBHs velocities are similar to those in the single boosted BH case).  \n\n\nEvolution\nWe use the  code <cit.> and the CCZ4 formulation of the Einstein equations <cit.> (see also <cit.>) which implements the system (<ref>)-(<ref>) with a distributed\nadaptive mesh refinement capabilities,[Here we use a 2:1 mesh refinement ratio.] using 6^th order finite difference operators for\nthe spatial derivatives and the method of lines for time integration through a Runge Kutta of 4^th order.[We use 6^th Kreiss-Oliger dissipation with a dissipation coefficient  σ_diss=2 (e.g., <cit.>).] In this way, we only need to use three ghost cells along each coordinate direction.\nWe adopt\na standard 1+log slicing condition for the lapse α and the Gamma-driver for the shift β^i, as implemented in the public version of the code and adopt\nSommerfeld boundary conditions at the outer boundaries.\nWe redefine the damping parameter κ_1→κ_1/α to ensure that it remains active inside the apparent horizon (AH) <cit.>; we decrease the damping parameter in the shift condition as well as increase σ in (<ref>) at large distances from the centre of the binary to ensure that no violation of the CFL condition arises due to grids becoming coarser  with our explicit time-stepping strategy (e.g., <cit.>).\nOtherwise, the chosen values for the constraint damping, shift and lapse conditions are \n{κ_1=1,κ_2=-0.8,κ_3=1,α_2=α_3=1,α_1=2,η_1=0.75,η_2=1/M} (<cit.>). In the code, the additional evolution equation (<ref>) is implemented in the obvious first order form. \nWe excise a region of the interior of BHs as in <cit.> which removes the role of correcting terms, achieving stable evolutions\nwith unduly high resolution (see the Supplemental Material for more details).\n\nWith the total ADM mass M of the system setting a scale, our\ndomain for the boosted BH case corresponds to the quadrant x∈ [-L,L] and y,z∈[0,L] as symmetry allows for restricting it.\nWe adopt L=384 M with a the coarsest grid spacing (for production runs) Δ=2 M; we then add another 6 levels of refinement. For the BH binary case the computational domain, exploiting symmetries, is given by x,y∈[-L,L] and z∈[0,L].  In this case we adopt, L=512M and coarsest grid spacing (for production runs) Δ=4 M; we then add another 8 levels of refinement (for convergence\ntests we consider up to Δ=8/3 M and same number of refined levels). We extract the gravitational waves at 6 equally spaced radii between R=50M and R=100M and extrapolate the result to null infinity. \nIn both cases we use the second (spatial) derivatives of the conformal factor[Recall that the conformal factor χ is one of the evolution variables in the CCZ4 formulation and it is related to the induced metric on the spatial slices γ_ij as χ=1/(γ)^1/3.] χ to estimate the local numerical error and determine whether a new level of refinement needs to be added; in addition, we fix the spatial extent of certain refinement levels to ensure that the resolution at the chosen extraction radii is high enough. \nLastly, we choose a scale value |ϵ|=10^-5M_S^6, which implies\na coupling scale for new physics beyond GR of Λ≈ 7/M_S ≃ 5 M_⊙/M_S km^-1. Notice for this small scale, correction effects will be undoubtedly subtle,\nwith a consequent high accuracy requirements to capture them.  Here  we undertake a first\nstudy mainly focused on demonstrating the ability of the method to control the system. We\nwill concentrate on assessing this and obtaining a qualitative description of observed\nconsequences.\nWe consider both signs for ϵ, the negative case satisfies the\nconstraints argued for in <cit.>, the positive one also provided\nazimuthal numbers of the solution are not large, which is our case. We here choose a conservative scale M_S= 10 M_⊙, i.e., somewhat below (but comparable)\nto the curvature scale set by the masses of the individual BHs for all detected gravitational wave events.  \nChoosing a smaller scale would imply that the modifications become O(1) during the inspiral <cit.> with arguably clear imprints on\nthe observed signal, which is  inconsistent with observations.  \nFurther, we note that it is\nnatural to expect the scale to remain fixed, thus the larger  the BH\nmass, the smaller the effect of corrections would be. This observation is particularly relevant\nas the BHs merge, as corrections after such regime would naturally become smaller.[Data analysis techniques can\nexploit these observations (e.g., <cit.>).] Since for larger masses corrections would be smaller, we here\nfocus on masses comparable to the length scale M_S \nwe thus adopt individual BH masses m_i=M_S/2=5 M_⊙.\n\n\n\nSingle boosted black holes\nWe confirmed our strategy's ability to evolve boosted (and stationary) BHs, with\nthe solution reaching a steady state behavior shortly after the corrections are fully\nturned on. The solution is smooth without inducing growth in high frequency modes or signs of instability. \nBeyond GR effects are naturally larger in the BH region. By comparing the value of Ĉ and 𝒞 we confirm the former tracks the physical one quite well\nand that lower values of {σ,τ} improve the tracking behavior. \nFigure <ref> illustrates the observed behavior of 𝒯(C,Ĉ). Importantly, examination of the relative difference between two values of Ĉ  obtained with two different values of σ\n(and analogously with 𝒞) indicates errors associated to the choice of this\nparameter do not severely accumulate, thus the solution is not degraded by strong\nsecular effects (see Fig. <ref>). For instance, it would \ntake ≈ 10^6 M for \nthe  relative error for Kretschmann scalar with σ=0.1 and 0.05 to be\nof order O(1). \nNumerical instabilities develop for smaller values of σ around the excision region, well inside the AH; these instabilities are sensitive to the details of the excision –improving with resolution. This suggests other forms of excision would be more robust \nas σ is decreased (e.g., <cit.>). With a successful handling of correction effects in single, moving BHs, we turn next focus on the\nchallenging setting of binary BH merger. \n\n\n\n\nBlack hole binary mergers\nThe binary tightens due to emission of gravitational waves which radiate energy\nand angular momentum from the system.\nFigure <ref> shows the gravitational wave strains\nfor different values of ϵ and contrasts them with the corresponding one in GR.\nThe solution is smooth, without any signs of instability throughout inspiral,\nmerger and ringdown. The corrections to GR and their high degree of non-linearity\nand higher gradients contributions certainly tax resolution requirements. Our\nstudies here are not focused on quantitatively sharp answers, but on testing\nthe approach with enough resolution for qualitatively informative results and \ncontrasting them with results in GR.\nIn particular, we see that positive/negative values of ϵ induce a (slight) merger phase delay/advance. This is consistent with expectations, \nwhere BHs in this theory have non-zero tidal effects, encoded\nto leading order in the Tidal Love Number κ∝ϵ  <cit.>.\nThe binary behavior in the \ninspiral regime can be captured through a Post-Newtonian analysis which shows tidal effects induce a phase offset ∝ - κ (hence ∝ - ϵ)  <cit.> (see also <cit.>) for BHs with size comparable to M_S. Leading order Post-Newtonian\nestimates for the phase difference give ≈± 5 × 10^-3 radians up to a\ncommon gravitational wave frequency (M f=0.01) for negative/positive values of ϵ in Fig. <ref>. Our obtained offsets –extrapolated to σ→ 0–  are consistent with the sign, though about 200 times larger \n(for a related study in Einstein-Scalar-Gauss\nBonnet theory see <cit.>).\n\nThe BHs coalesce and the resulting peak strain is \ncomparatively similar to that in GR and no significant further structure is induced in the multipolar decomposition of the waveforms,  confirming that the solution stays within the EFT regime. Moreover,\nsince the merger gives rise to a BH with roughly twice the\nindividual masses, corrections are reduced by ≈ 2^-6. Thus the final BH is closer to a GR\nsolution than the initial ones. After\nthe peak amplitude, the system settles quickly into a stationary BH\nsolution. This transition is described by an exponential, oscillatory behavior\ndescribed by quasi-normal modes (QNM). While QNM spectra have only been computed for\nslowly rotating BHs in this theory <cit.>, the departure observed in decay rates is consistent with extrapolation to higher spin values, though this is not the case in the oscillatory frequency. We note, however, that\nthe extracted values for the case in GR, have relative errors \n≈ 0.1%; since\nGR corrections to the QNMs in the case studied here \nare subleading by an order of magnitude such potential discrepancy can\nbe attributed to a need for even higher accuracy to capture them sharply.\n\nAlso, as the system approaches its stationary \nfinal state we confirm it is axisymmetric. Such symmetry is expected in stationary BH solutions in EFTs of gravity <cit.>.  By evaluating\ndifferent scalars, such as the conformal factor χ of the spatial metric\nand Ĉ, on the intersection of the AH (which in the stationary case coincides with the event horizon) with the equatorial plane,\nthe tendency towards axisymmetry can be confirmed (see figures <ref>,<ref>).\nLast, note that the difference in the innermost stable\ncircular orbit frequency between slowly rotating BHs in this theory and GR\ngoes as  δΩ_ISCO∝ -ϵ. Thus, extrapolating\nthis observation to general spins,  and following \nthe successful strategy to estimate the final (dimensionless) spin in BH\ncoalescence in GR <cit.>, one can argue that the final\nBH spin should be higher/(lower) for positive/(negative) values of ϵ as\nthe final `plunge' takes place with a higher/(lower) contribution of orbital\nangular momentum to the final BH.\nCautioning that a higher accuracy is required to confirm this expectation,\nour results are consistent with it. \n\n\n\nDiscussion\nWe have demonstrated the ability of the “fixing” approach to\nenable studies of beyond GR theories. This approach, in\nparticular, provides\na practical way to explore phenomenology in the highly non-linear and dynamical regime of compact binary mergers. Especially relevant is that it enables assessing whether the solution for cases of interest remains in the EFT regime and\nthe impact of corrections in gravitational wave observations. From this first set of analysis, we conclude the solution does remain in this regime for comparable mass, quasicircular mergers in the \nobservable region, i.e., the BH(s) exterior. Thus, much like in the case\nof GR, a strong UV energy flow takes place inside the horizon\nbut not in the outside region, staying\nwithin the valid EFT regime.\nWhile in the current work we have focused on a specific theory and scale,\nour choice was motivated by stress-testing the approach with\nhighly demanding challenges –brought by higher than second order derivatives\nand in the context of BH collisions. However, the underlying strategy is applicable\nalso in beyond GR theories with second order equations that\ncan induce change of character in the equation of motion (e.g., <cit.>). We note that for a particular class of non-linear theories (with second order equations\nof motion) consistent, non-linear studies have been presented <cit.>. However, they\nrequired significant supporting theoretical efforts to identify appropriate gauge\nconditions and merging BH solutions have been obtained up to \nsome maximum coupling value otherwise mathematical pathologies arise.\nOur approach, in principle, provides a way to robustly explore beyond such\ncoupling and, in general, study beyond GR theories self-consistently where such\nsupporting theoretical input is not available or even achievable without strong –and a priori unjustifiable– assumptions. \nOf course, practical application of the approach described here\nshould be mindful of checking results upon variations of\nad-hoc parameters to ensure, given a coupling length, scales\nare sufficiently resolved.\n\nAcknowledgements\nWe thank William East, Rafael Porto, Oscar Reula\nand Robert Wald for discussions.\nThis work was supported in part by\nPerimeter Institute for Theoretical Physics. Research\nat Perimeter Institute is supported by the Government\nof Canada through the Department of Innovation, Science and Economic Development Canada and by the\nProvince of Ontario through the Ministry of Economic\nDevelopment, Job Creation and Trade. LL thanks\nfinancial support via the Carlo Fidani Rainer Weiss Chair\nat Perimeter Institute. LL receives additional financial support from the Natural Sciences and Engineering\nResearch Council of Canada through a Discovery Grant and CIFAR. PF is supported by Royal Society University Research Fellowship Grants  RGF\\EA\\180260, URF\\R\\201026 and RF\\ERE\\210291. TF was supported by a PhD studentship from the Royal Society RS\\PhD\\181177.  The simulations presented used PRACE resources under Grant No. 2020235545, PRACE DECI-17 resources under Grant No. 17DECI0017, the CSD3 cluster in Cambridge under projects DP128 and DP214, the Cosma cluster in Durham under project DP174 and the ARCHER2 UK National Supercomputing Service under project E775. The Cambridge Service for Data Driven Discovery (CSD3), partially operated by the University of Cambridge Research Computing on behalf of the STFC DiRAC HPC Facility. The DiRAC component of CSD3 is funded by BEIS capital via STFC capital Grants No. ST/P002307/1 and No. ST/ R002452/1 and STFC operations Grant No. ST/R00689X/1. DiRAC is part of the National e-Infrastructure.[] The authors gratefully acknowledge the Gauss Centre for Supercomputing e.V.[] for providing computing time on the GCS Supercomputer SuperMUC-NG at Leibniz Supercomputing Centre.[] This research was also enabled in part \nby support provided by SciNet (www.scinethpc.ca) and Digital Research Alliance of Canada (alliancecan.ca).\n\n\n\n\n§ SUPPLEMENTAL MATERIAL\n\n\nExcision\nThe numerical treatment of solutions containing BHs\nrequires dealing with the singular behavior of its interior.\nIn GR, excising from the computational domains  trapped region(s) \n(which can be shown to lie within BHs and thus are causally disconnected from its exterior) or mapping\nthe interior of BHs to other causally disconnected asymptotic regions are practical and \nsuccessful techniques to address this issue. \nWith beyond GR theories, extensions of\nthese ideas can be adopted.\nHere, we follow a strategy implemented in <cit.>, where terms\nbeyond GR are “turned off” inside the AH, thus\nallowing one to follow the standard approach in GR and use puncture gauge to handle (coordinate) singularities inside BHs.  By turning off beyond GR terms well inside the AH we are modifying the theory in a region of spacetime that is causally disconnected from any external observer and where the theory itself should no longer be a valid EFT anyway. \n\nSince the higher-derivative terms enter the equations of motion as an effective stress-energy tensor T_, a measure of the weak field condition is provided by the “size” of the components of T_.  In the 3+1 decomposition, we have \n\n    =̊n^ n^ T_μν ,   S_i=-n^γ_i^iT_ν ,   S_ij=γ_i^iγ_j^iT_ .\n\nThen, a point-wise measure of the weak field condition is captured by the quantity\n\n    W = √(^̊2 + S_i S_j ^̣ij + S_ij S_kl^̣ik^̣jl)\n\nThis quantity need not be covariant nor anything special, it is just a measure where we can input a threshold; it is preferred to $̊ which goes to zero at the puncture (even though it is large in the surrounding region).[This is because we turn off the non-GR terms inside BHs, as we explain in the following paragraph.]\n\nGiven an energy-momentum tensor, we damp the “effective source” inside the AH and when  the weak field conditionWis too large  by a factore·T_whereeis a smooth transition function:\n\n    e(χ,W)    = 1 - (χ; χ̅, _χ) (W; W̅, -_W) ,\n    (x; x̅, _x)    = 1/1 + 10^1/_xx/x̅-1 ,\n\nwhereχis the conformal factor of the induced metric,χ̅andW̅are thresholds for the excision cutoff region and_χand_Ware smoothness widths. With this choice ofe(χ,W), the source approaches 0 exponentially wheneverχ< χ̅andW > W̅,  and is 1 otherwise. The parameters_χand_Wdetermine the width of the transition region; we typically choose them to be_χ=_W=0.1. Since in our working gauge the contours ofχtrack the AH very well (see the discussion below), we choose a thresholdχ̅that ensures that the excision region is well inside the AH. In practice we ended up takingW̅ = 0so that(W; W̅, -_W)is always effectively1and hence the excision region is solely determined by the value ofχ. In practice, for non-spinning BH binaries,  the choiceχ̅ = 0.09ensures that the excision region is well within the AH <cit.>. \n\n\nImpact of ad-hoc parameters\nAs described in the main text, the parameters{σ,τ}appearing in the evolution equation forĈ(<ref>)\nare ad-hoc and define a scale.[The analogous parameters appearing in Israel-Stewart formulations of relativistic viscous hydrodynamics can be related to transport coefficients of the underlying microscopic theory.] Their role is to control scales\nshorter (heavier) than theirs thus controlling the mathematical pathologies \ndiscussed. Naturally, the solution obtained for any set of values of \nsuch parameters can  depend on their values. Such dependency will\nbe strong if the solution displays a significant cascade to the UV, as in this\ncase the system tends to abandon the EFT regime and the fixing strategy would\nforce it to remain in it, damping energy in high frequency modes.\nOn the other hand, such dependency could be mild, not affecting qualitatively\nthe solution's behavior but might introduce minor variations in quantitative\ncharacteristics. Whenever the fixing strategy is employed (and arguably any other\nstrategy) to address the mathematical shortcomings, \nassessing the solution's dependency on whichever strategy is paramount. In\nour case, it means examining dependency on{σ,τ}.\n\n\nBy varying their values, we do identify a mild depdendecy on them,\nwhich we trace back to the role of the advection vectorβ^iand the terms it\nmultiplies in (<ref>), and not to a UV cascade taking\nplace outside the BH(s). These terms, which were\nintroduced to ensure advection into the BH, also affect to a small\ndegree the tracking, as we have seen. In particular, the difference  between𝒞̂and𝒞is linear, and increasing withσespecially where curvature is strong. This difference, although small, over long times affects somewhat physical quantities or observables. One can nevertheless, extrapolate\nsuch difference to values ofτ,σ→0(see also <cit.>). For instance, as displayed in figure <ref> we perform such extrapolation to obtain the time of peak amplitude of the strain forσ→0. In this figure we show\nsuch quantity depends linearly withσand the extrapolated time delay for the peak amplitude is≈30M. This extrapolation is further supported by the weak dependence onτand the fact that a linear behaviour withσis present in our toy model until very small values of this parameter. \nFurther, we can monitor the difference of between values of𝒞̂, or𝒞, upon varyingσas\ntime proceeds. Figure <ref> illustrates the \nobserved behavior for the single boosted BH case, illustrating that errors related to the value ofσaccumulate slowly. Indeed, it would take\naboutt≈10^6 Mfor the relative error\nfor Kretschmann scalar withσ=0.1and0.05to beO(1).\n\nAxisymmetry of the remnant Black Hole\nTo assess the axisymmetry of the final state, we evaluate two scalar quantities, namely the  the conformal factorχon thet=constslices\nand𝒞̂, at the intersection of the common AH with\nthe equatorial plane and compute their relative differences with the (arbitrary)\npointϕ=0, whereϕis the usual azimuthal angle on the AH two-sphere. As time progresses, such difference reduces significantly\nindicating a high degree of axisymmetry, consistent with the result of <cit.>. \n\n\nConvergence\nWe test convergence by comparing the evolution presented, which used a numerical grid coarsest spacing of= 4Mand 8 further levels of refinement, with two higher resolutions, with spacing= 3211M(medium) and= 83M(high). The particular setting for these simulations hasϵ= 10^-5 M_S^6,σ=0.1andτ=0.005.  Figure <ref> shows gravitational strain errors between low, medium and high resolutions, together with the estimates for second and fourth order convergence respectively based on the convergence proportionality factor\n\n    Q_n = _Low^n-_Med^n/_Med^n-_High^n .\n\nThis figure indicates approximately fourth order convergence for both the amplitude and the phase ofh^+_22.\n\n\n\n\n\n\n\n\n\napsrev4-2"}