{"entry_id": "http://arxiv.org/abs/2303.07237v1", "published": "20230313161012", "title": "The atomic-to-molecular hydrogen transition in the TNG50 simulation: Using realistic UV fields to create spatially resolved HI maps", "authors": ["Andrea Gebek", "Maarten Baes", "Benedikt Diemer", "W. J. G. de Blok", "Dylan Nelson", "Anand Utsav Kapoor", "Peter Camps", "Omphile Rabyang", "Lerothodi Leeuw"], "primary_category": "astro-ph.GA", "categories": ["astro-ph.GA"], "text": "\n\nfirstpage–lastpage\nSim-to-Real Deep Reinforcement Learning based Obstacle Avoidance for UAVs under Measurement Uncertainty\n    Bhaskar Joshi*, Dhruv Kapur*, Harikumar Kandath ^†\n    March 30, 2023\n=======================================================================================================\n\n\n\n\n\nCold gas in galaxies provides a crucial test to evaluate the realism of cosmological hydrodynamical simulations. To extract the atomic and molecular hydrogen properties of the simulated galaxy population, postprocessing methods taking the local UV field into account are required. We improve upon previous studies by calculating realistic UV fields with the dust radiative transfer code SKIRT to model the atomic-to-molecular transition in TNG50, the highest-resolution run of the IllustrisTNG suite. Comparing integrated quantities such as the mass function, we study to what detail the UV field needs to be modelled in order to calculate realistic cold gas properties. We then evaluate new, spatially resolved comparisons for cold gas in galaxies by exploring synthetic maps of atomic hydrogen at redshift zero and compare them to 21-cm observations of local galaxies from the WHISP survey. In terms of non-parametric morphologies, we find that TNG50 maps are less concentrated than their WHISP counterparts (median Δ C≈0.3), due in part to central deficits related to the ejective character of supermassive black hole feedback in TNG. In terms of the column density distribution function, we find discrepancies between WHISP and IllustrisTNG that depend on the total abundance in these datasets as well as the postprocessing method. To fully exploit the synergy between cosmological simulations and upcoming deep /H_2 data, we advocate the use of accurate methods to estimate the UV radiation field and to generate mock maps.\n\n\n\n\n\n\n\ngalaxies: ISM – galaxies: structure – ISM: molecules – radio lines: ISM – methods: numerical\n\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\nThe physical processes regulating the interstellar medium (ISM) are integral to understand the evolution of galaxies. The most important process in galaxy evolution, star formation, occurs in the cold and dense molecular ISM. For molecular hydrogen to form, enough atomic gas (potentially supported by the presence of dust) is required to cool and shield the molecular clouds against energetic ultraviolet (UV) radiation. This leads to the empirical correlation between the surface densities of gas and star-formation rate (the Kennicutt-Schmidt law, ; ), which is significantly tighter when using the surface density of molecular gas on sub-kpc scales (e.g. ). On the other hand, the ISM is actively shaped by various processes of galaxy evolution such as momentum and energy injections from supernovae and active galactic nuclei, chemical evolution due to metal return from evolved stars, large-scale galactic inflows from the gas residing in the halo, and interactions with other galaxies like ram-pressure stripping. These processes shape the ISM into a complex, multi-phase environment which is a prime target for observational campaigns targeted at understanding galaxy evolution.\n\nAs a dominant fraction of the mass of the ISM exists in the form of atomic hydrogen (), observations targeted at the 21-cm line of are useful to study the structure of nearby galaxies. Unlike Ly-α radiation, photons emitted due to the spin-flip transition which gives rise to the 21-cm line penetrate both interstellar dust clouds and Earth's atmosphere. exists in the ISM mostly in two equilibrium states, the warm (T∼5000K) and the cold (T∼100K) neutral media (WNM and CNM, e.g. ). 21-cm emission from the WNM is generally assumed to be optically thin which gives a trivial relation between the observable 21-cm flux density and the physical quantity of interest, the mass surface density. 21-cm observations of the Milky Way indicate that the WNM contains most of the mass (). The CNM is dense and cold enough for self-absorption to become important which complicates the relation between 21-cm flux and mass. For 21-cm emission observations, correction factors to account for the `hidden' mass in the CNM are rather uncertain. While earlier measurements in the LMC, M31 and M33 indicated a correction factor of ≈35 % (), the more recent study by <cit.> finds for the same objects a correction factor of ≈10 %, in line with the ALFALFA survey of local galaxies ().\n\n\nObservational campaigns using 21-cm observations to measure the galactic content of local galaxies include blind H i-selected surveys (HIPASS, ; ALFALFA, ) and surveys targeting samples representative of the galaxy population (GASS, ; xGASS, ). These spatially unresolved surveys made use of the superior sensitivity of the single-dish Parkes and Arecibo telescopes to measure galactic masses. With these data, multiple scaling relations between the atomic gas mass and other galactic properties such as stellar mass and star formation rate have been established (see  for a review), with far-reaching implications for galaxy evolution. Interferometric observations obtained spatially resolved 21-cm fluxes to map the structure and kinematics of (e.g. WHISP, ; THINGS, ; BLUEDISK, ). Such resolved data has been used to study radial surface density profiles (), morphologies in the context of mergers (), and the Tully-Fisher relation () constructed from spatially resolved kinematics ().\n\n\nThese observational insights into the cold gas content of galaxies provide a vital test for simulations of galaxy evolution. Modelling atomic and molecular hydrogen within galaxies numerically requires resolving the molecular clouds in the CNM to capture the formation of H_2 within a chemical network. For cosmological hydrodynamical simulations that follow the evolution of baryons and dark matter of large volumes (∼ 100^3 cMpc^3), modelling this chemical network on the required spatial scales is not feasible at present. Moreover, this chemical network depends on the local radiation field, which for current large-volume cosmological simulations run to z=0 is not explicitly followed. Hence, as a critical test for cosmological simulations, postprocessing of the simulation output is required to extract the atomic and molecular hydrogen content and compare to existing or future observational data. Such postprocessing studies (EAGLE: ; ; ; ; AURIGA: ; IllustrisTNG: ; ; ; ; ; ; ; ; ; SIMBA: ; FireBOX: ) mostly focus on redshift zero, where observational data is most available. Despite qualitative agreement, inferred discrepancies include the presence of spurious holes in the EAGLE simulation (), an excess of and too large disks in the AURIGA simulation () and an overabundance of at z=0 for TNG50 ().  \n\nFor molecular hydrogen, a robust comparison between simulations and observations is much more challenging (e.g. ; ). In contrast to the direct detectability of H i, molecular hydrogen is very difficult to observe directly due to the lack of a permanent dipole moment and high excitation temperatures. The molecular gas is usually observed through transitions of the second most abundant molecule, CO, introducing a rather uncertain factor to convert the CO line luminosity to the H_2 mass (see  for a review).\n\nKey to H i/H_2 postprocessing studies is a scheme to partition the neutral hydrogen simulation output into its atomic and molecular phases. Partitioning schemes based on analytical arguments or high-resolution galaxy simulations both consider the formation of H_2 on dust grains and H_2 photodissociation from UV radiation in the Lyman-Werner band (11.2-13.6 eV, 912-1108Å). Hence, applying such hydrogen partitioning models to cosmological simulations requires estimating the local radiation field strength at 1000Å since the partitioning models use this value as a proxy for the radiation field strength in the Lyman-Werner band. Two different approximations to estimate the UV field exist in the literature: <cit.> introduced a scaling with the local star-formation rate of gas cells. Cosmological simulations typically use a Kennicutt-Schmidt type relation above a specific density threshold to model star formation, while lower-density cells are not star-forming (see Section <ref>). This leads to a strong discontinuity in the estimated UV field. To overcome this limitation, <cit.> introduced a method which spreads the UV flux from star-forming gas cells without attenuation (but with an escape fraction of 10%) throughout the galaxy. Since attenuation by dust is significant in the UV these radiation field estimates introduce large modelling uncertainties. \n\nIn this study we improve upon previous methods by using the Monte Carlo dust radiative transfer code SKIRT (; ; ) to obtain a realistic estimate for the UV field. We describe our simulation methods and the simulation and observational datasets in Section <ref>. Using the highest-resolution installment of the IllustrisTNG simulation suite, TNG50-1, we explore how the different UV field estimates affect the H i/H_2 statistics of the simulated galaxy population in terms of mass functions and average radial profiles in Section <ref>. Exploiting the realistic UV fields and the high resolution of TNG50-1, we evaluate the realism of cold gas in cosmological simulations by generating spatially resolved maps. We compare the simulated maps to 21-cm data from the WHISP (Westerbork survey of Spiral and Irregular Galaxies) survey in terms of their non-parametric morphologies in Section <ref>. As complementary metric to non-parametric morphologies, we consider column density distribution functions (tracing how much exists per column density instead of how the columns are spatially distributed) in Section <ref>. We discuss and contextualize our results in Section <ref>, and conclude in Section <ref>.\n\n\n\n§ METHODS\n\n\n\n\n §.§ The IllustrisTNG simulations\n\n\nThe IllustrisTNG suite (; ; ; ; ) is a set of cosmological, magnetohydrodynamical simulations run using the moving-mesh code AREPO (). The simulation suite consists of three different volumes with box sizes of approximately 50, 100, and 300 comoving Mpc, each realized with three to four different resolutions. All of these simulations were run with the same physical model, which means that their subgrid parameters were not recalibrated (unlike the EAGLE simulation, ). For the cosmological parameters, the simulations use the 2015 results measured by the Planck satellite (). Since we explore synthetic maps which are sensitive to the spatial resolution we use the simulation with the highest resolution, TNG50-1, hereafter referred to as TNG50 (; ). We also consider the lower-resolution TNG50-2 and the larger-volume TNG100-1 (hereafter referred to as TNG100) runs to test the convergence of some of our results against resolution and box size. We summarize the box sizes and resolutions of the different IllustrisTNG simulations considered in this study in Table <ref>. In the following, we briefly describe the aspects of IllustrisTNG and its galaxy formation model (; ) that are most relevant to this study.\n\nTNG50 simulates a cube with box size of 51.7 comoving Mpc from z=127 to z=0. This volume is resolved with 2160^3 baryonic and dark matter particles, corresponding to a mean particle mass of 8.5×10^4 M_⊙ and 4.5×10^5 M_⊙, respectively. This mass resolution enables a spatial resolution of 70-140 pc for the densest star-forming regions of galaxies. Galaxies are identified using the SUBFIND algorithm (). The IllustrisTNG model incorporates gas radiative processes including metal-line cooling, evolution of stellar populations and chemical enrichment, and feedback from supernovae and black holes that drives galactic outflows and winds. Since molecular clouds cannot be resolved in the simulation, star formation is modelled stochastically for gas with n_H>0.106 cm^-3 according to the two-phase model of <cit.>. The ISM above this density threshold is emulated as cold, star-forming clouds with T=1000 K embedded in hot, ionized gas. This model prescribes an effective equation of state by calculating effective pressures and temperatures as averages over the cold clouds and the hot gas.\n\nAs we are interested in the cold gas properties of local galaxies we select all subhalos in TNG50 at z=0 with a gas mass larger than 10^7 M_⊙, such that the galaxies are resolved by at least ≈100 gas cells. Furthermore, the SKIRT calculation requires star particles to estimate the radiation field. We choose a minimum total stellar mass of 10^7 M_⊙ such that galaxies are resolved by at least ≈100 stellar particles. These criteria lead to a sample of 12'431 galaxies, comprising both centrals and satellites. This provides a broad base sample which contains the vast majority of galaxies detectable in 21-cm observations. To facilitate the comparison between the different simulation runs we apply the same galaxy sample criteria (M_gas>10^7 M_⊙, M_⋆>10^7 M_⊙) to TNG50-2 and TNG100 as well (the sizes of the galaxy samples are given in Table <ref>).\n\nFor all calculations in this study we consider the subhalos in the simulation individually, meaning that when modelling the H i/H_2 content of a galaxy we only select gas cells and star particles that are bound to this specific galaxy as identified by the SUBFIND algorithm. <cit.> find that for TNG100 at z=0, ≈98 % of the gas mass is bound to subhalos (for H_2 we expect an even higher fraction), hence we do not miss substantial amounts of H i/H_2 gas with our methodology.\n\n\n\n\n\n\n\n §.§ UV field estimates\n\n\n\n\n\nRadiation in the Lyman-Werner band (912-1108Å) can photodissociate molecular hydrogen. Consequently, the radiation field strength at 1000 Å (generally used as a proxy for the radiation of the entire Lyman-Werner band) is a key parameter for many partitioning schemes. We use three different methods to calculate the U_MW parameter, which is the UV field at 1000 Å normalized to the average Milky Way value of 3.43×10^-8 photons s^-1cm^-2Hz^-1 (). All methods rely on estimating the flux from stars and/or star-forming regions. For all gas cells we set a floor on U_MW of 0.00137 which corresponds to the homogeneous UV background (UVB) of <cit.> (in the updated 2011 version) at z=0 (the same UVB model is implemented in IllustrisTNG for the calculation of the ionization state of the gas). Dense gas could be self-shielded against the UVB which would lower the floor value of U_MW. However, such gas cells are typically near high star-formation areas so that the local UV radiation surpasses the UVB, rendering the actual floor value irrelevant. We consider three different schemes to estimate the UV field, summarized in Table <ref>.\n\nThe simplest method to estimate the UV field follows <cit.>. The `Lagos' approximation is based on the insight that the largest fraction of the UV flux typically comes from very young stars. U_MW is calculated by scaling the local star formation rate surface density by the typical Milky Way value:\n\n\n    U_MW=SFR·ρ/m·λ_J/ 10^-9 M_⊙ pc^-2,\n\nwhere ρ is the total gas mass density, m the gas cell mass, SFR its star-formation rate, and λ_J the Jeans length which approximates the size of a self-gravitating gas cloud (; ):\n\n\n    λ_J=√(γ(γ-1)u/Gρ).\n\nIn this equation, γ=5/3 is the ratio of specific heat capacities, u the internal energy per unit mass, and G the gravitational constant. Due to temporal and mass resolution limits in the simulation, it is impossible to resolve arbitrarily small star-formation rates for the gas cells. This leads to a minimum value for U_MW in the Lagos approach for the star-forming gas cells on the order of unity, while all gas cells with zero star-formation rate have U_MW=0.00137 (the UV background). Hence, this UV field approximation creates a substantial, unphysical dichotomy in the UV field distribution of the gas cells.\n\n\n<cit.> introduce an improved UV field calculation to overcome this limitation. In the `Diemer' approximation, star-forming gas cells are assigned a UV flux based on a Starburst99 () calculation of a continuously forming population of stars following a Kroupa IMF (). This UV flux is scaled to the star-formation rate of the gas cell, the flux of a 1 M_⊙yr^-1 cell at a distance of 1 kpc is 3.3×10^-6 photons s^-1cm^-2Hz^-1 corresponding to U_MW=96.2. It is assumed that a certain fraction of this radiation is absorbed by dust within the star-forming region and the remaining fraction propagates through a transparent medium. <cit.> calibrated this escape fraction to 10 % based on the SFR-UV relation in the solar neighbourhood. The propagation of the UV flux is calculated via a Fourier transform on a regular cubic grid. We refer the reader to Appendix A of <cit.> for details.\n\nWhile the `Diemer' method models in-situ absorption of UV flux generated from star-forming regions, it does not capture the significant absorption by diffuse dust in the ISM. Furthermore, older stellar populations can also contribute significantly to the galactic UV flux (; ; ). To generate realistic UV fields taking the complex galactic star-dust geometries into account, 3D radiative transfer modelling is required.\n\nHere we use the Monte Carlo dust radiative transfer code  (; ). We run SKIRT in the oligochromatic (i.e. single wavelength) mode at 1000 Å  including dust attenuation. A SKIRT simulation requires to define a box to set the domain for the radiative transfer calculation. We use a cube with side length 2· r_A[The same cube size is used to compute the Diemer UV field.], with the aperture radius r_A chosen such that a sphere with this radius contains at least 99.9 % of the neutral hydrogen gas mass bound to a specific subhalo (see Section <ref> for the calculation of the neutral hydrogen fraction). We choose the different components in a SKIRT simulation following <cit.>; <cit.> as follows:\n\n\n\n\n  * Evolved stellar populations: We select star particles bound to the subhalo within the spherical aperture to model the UV emission. Star particles with ages above 10 Myr are treated as evolved stellar populations and modelled with a Bruzual-Charlot spectral energy distribution () with Chabrier initial mass function (). We have verified that the choice of an alternative stellar population library (BPASS, ; ) does not affect our results.\n\n\n  * Star-forming regions: Bound star particles within the spherical aperture and with ages below 10 Myr are treated as star-forming regions and modelled with Mappings-III templates (). These templates contain the emission of the young stellar population and its subsequent attenuation by the surrounding dusty birth cloud. We refer to <cit.> for the determination of the various parameters required for the Mappings-III templates such as the compactness of the star-forming region or the ISM pressure.\n\n\n  * Diffuse dust: To track the radiation field and its attenuation by diffuse dust we select all gas cells bound to the subhalo within a cube of side length 2· r_A. We allocate dust only in relatively dense and cold gas cells that are in line with the criterion from <cit.>. We assume that 40 % of the metallic mass in these gas cells exists as dust ( and references therein), which we model with the THEMIS dust mix (). \n\n\n\nThe spatial discretization within SKIRT uses the imported Voronoi cell centers of the gas cells (). This allows SKIRT to reconstruct the same Voronoi mesh that was used in IllustrisTNG. Tracking the photon packages through a Voronoi mesh is computationally more expensive than octree grids, but the advantage of importing a grid instead of calculating one outweighs the additional cost here (see also ). We find converged results when running SKIRT with 10^5 photon packages, which runs two minutes for a large galaxy with M_⋆≈10^11 M_⊙ and eight seconds for a smaller galaxy with M_⋆≈10^8 M_⊙ on a 16-core machine.\n\nWith this `SKIRT' method we can calculate realistic 3D UV fields for IllustrisTNG galaxies taking dust attenuation into account. The largest modelling uncertainty in this approach lies in the modelling of the star-forming regions, since they require estimates of multiple parameters that are not directly available from the output of the cosmological simulation (see also <cit.>; ). We also tested an alternative template library for star-forming regions (described in Kapoor et al. in prep.) which requires parameters that are more readily estimated from the TNG50 output. We found that using this alternative template library typically yields integrated masses that agree with the MAPPINGS-III templates within one percent. Hence, we consider the MAPPINGS-III templates to be sufficiently accurate for this work.\n\nFor the UV modelling of TNG50-2/TNG100 galaxies, we note that these lower-resolution simulations can have very few star particles with our sample selection criteria (down to seven star particles for TNG100). For these barely resolved objects SKIRT cannot reproduce a meaningful UV field. Hence we use the Diemer UV field as replacement for the SKIRT UV field for galaxies with stellar masses below 10^8 M_⊙ for TNG50-2 and TNG100.\n\n\n\n\n\n\n §.§ Atomic and molecular hydrogen fractions\n\n\nThe z=0 snapshot data of IllustrisTNG contain the total and neutral hydrogen fraction in gas cells. Ideally, the neutral hydrogen fraction in the simulation is determined using on-the-fly ionizing radiative transfer calculations. For IllustrisTNG, the hydrogen ionization is approximated using the ionizing background () and gas self-shielding with the fitting formula from <cit.>. Note that the neutral fractions for star-forming gas cells are for the effective gas temperature and must be recomputed. Hence, we use the intrinsic IllustrisTNG value for the neutral hydrogen fraction only for non star-forming cells. For star-forming cells, we follow <cit.>[See Eqns. A1-A6 in <cit.>.] and calculate the mass fraction of cold gas in the two-phase model of <cit.>. This cold gas at a fixed T=1000 K is assumed to be fully neutral while the hot phase is fully ionized.\n\nThe breakdown of neutral hydrogen gas into its atomic and molecular constituents requires the use of partitioning schemes. A variety of partitioning schemes exist and have been used to postprocess cosmological simulations (see  for a detailed comparison between the different partitioning schemes and how that influences the and H_2 properties of IllustrisTNG galaxies). Empirical partitioning schemes based on observations of local galaxies (; ) find that the ratio between molecular and atomic surface densities scales with the hydrostatic midplane pressure as a power law. As shown by <cit.>, estimates of the midplane pressure are only physically reasonable when computed from a projection (in face-on orientation). The hydrogen partitioning then happens on this 2D grid on a pixel-by-pixel basis, hence 3D information is lost and it is only possible to create maps in face-on orientation (it is not possible to rotate the galaxies back into a random orientation). Since we consider maps in random orientation (as the WHISP data to which we compare the simulated maps consist of randomly oriented maps), we omit the empirical partitioning schemes completely from this study.\n\nAnalytical studies of <cit.>[The partitioning scheme of <cit.> is incorporated in the MUFASA and SIMBA simulations, splitting the hydrogen gas into its atomic and molecular phases at simulation runtime.] (KMT09), <cit.> (K13), and <cit.> (S14) consider idealized gas geometries with H_2 formation-dissociation balance to obtain the atomic and molecular hydrogen fractions. The main input parameters for these partitioning schemes are the surface density of neutral hydrogen, the dust-to-gas ratio, and (only for K13)[For the partitioning schemes of KMT09 and S14 the UV field strength drops out of the equations due to assumptions about the CNM-WNM pressure equilibrium.] the UV field strength at 1000 Å. Lastly, <cit.> (GK11) and <cit.> (GD14) use high-resolution (mass resolution up to 10^3 M_⊙) ISM simulations of isolated galaxies, coupled to a chemical network including H_2 formation on dust grains and photodissociation from Lyman-Werner photons, to partition the hydrogen based on the same three main parameters as the analytical partitioning scheme of K13. More specifically, the GK11 and GD14 approach consists of two steps: The first step consists of a cosmological simulation that is ran until z=4. This simulation extends over five virial radii of a system that would evolve to a typical M≈10^12 M_⊙ system. In a second step, the UV radiation field at 1000 Å and the dust-to-gas ratio are fixed to a grid of different values and the simulation is continued for 600 Myr. This setup allows for fresh gas infall into the galaxy, but cannot model effects from the larger environment such as mergers or filamentary accretion streams. \n\n\nIn this study we use the simulation-calibrated GD14 recipe as our default partitioning scheme as it is an update of the GK11 recipe (adding self-shielding of H_2 from line overlap) and has the UV field as an input parameter. Furthermore, it is more directly applicable to cosmological simulations as it is a hydrodynamical simulation that models the various ISM phases and outputs the and H_2 fractions averaged over larger patches of the galaxy, while the analytical partitioning schemes consider simpler geometries such as a spherical cloud of gas. For our results we display the default partitioning scheme and treat the other UV-dependent partitioning schemes (GK11, K13) as uncertainties, shown as shaded areas. For some results we also consider the UV-independent KMT09 and S14 models which are plotted separately. The application of all of these partitioning schemes to IllustrisTNG is described in detail in Appendix C of <cit.>, except for KMT09 which we present in Appendix <ref>.\n\n\nThe analytical and simulation-calibrated partitioning schemes used here have up to three main input parameters; the surface density of neutral hydrogen (Σ_H i+H_2), the dust-to-gas ratio relative to the average Milky Way value (D_MW), and the UV field strength at 1000 Å  relative to the average Milky Way value (U_MW). Our estimates for U_MW are described in Section <ref>. As in previous studies (e.g. ), we assume that the dust-to-gas ratio scales with metallicity (as found observationally, e.g. ; ; ) such that D_MW=Z/Z_⊙ with Z the metal mass fraction and Z_⊙=0.0127 the solar metallicity used in IllustrisTNG ().\n\nTo convert the mass density of neutral hydrogen (ρ_HI+H_2, calculated using the mass fraction of neutral hydrogen) into a surface density a certain length scale is needed. Two strategies to estimate surface densities from the simulation output have emerged: Volumetric modelling using the Jeans approximation and projected modelling using line-of-sight integration (). In the volumetric modelling approach, the surface density of neutral gas is obtained using the Jeans length λ_J:\n\n\n    Σ_H i+H_2=ρ_H i+H_2·λ_J=ρ_H i+H_2·√(γ(γ-1)u/Gρ).\n\nIn theory, the value of γ changes depending on the molecular fraction. Since the Jeans approximation by itself is already a crude approach we refrain from iterating the partitioning scheme to reach a self-consistent value of γ as in <cit.>. In the projected modelling approach the surface density is estimated by rotating the galaxies into face-on position and projecting the gas densities onto a 2D grid. The hydrogen partitioning is then performed on this 2D grid, making it impossible to rotate the galaxy back into random orientation as the 3D information is lost. As we consider maps in random orientation, we stick to the volumetric approach in this study and discuss projected modelling in the context of the different UV field estimates in Appendix <ref>. We remark that the Jeans approximation to calculate surface densities breaks down in some regimes. However, the Jeans approximation gives the same H i/H_2 results on average as the projected modelling approach ().\n\n\nThe main output of our H i/H_2 modelling consists of U_MW parameters for the SKIRT, Diemer and Lagos method as well as 11 different molecular mass fractions f_mol[We use f_mol to denote the mass ratio of molecular to neutral hydrogen.] (three different UV fields for GK11, GD14 and K13, plus the UV-independent schemes of KMT09 and S14). We store these values for all gas cells within the spherical aperture[Technically, only the SKIRT UV field calculation requires an aperture. To simplify the comparison between the different models we employ the same spherical aperture to store U_MW and f_mol for all our models. This aperture is defined as the radius that contains 99.9 % of the neutral hydrogen gas mass bound to the subhalo.], for all 12'431 galaxies within our TNG50 base sample. We emphasize that our default H i/H_2-model consists of the GD14 partitioning scheme with the SKIRT UV field.\n\n\n\n §.§ Observational data: The WHISP survey\n\n\n\n\n\n\nWe use observational data from the WHISP survey to compare to simulated maps from IllustrisTNG. The WHISP survey targets the 21-cm line of some 300 local galaxies across the Hubble sequence (), selected by their 21-cm flux density and their stellar disc size. This interferometric survey at the Westerbork Synthesis Radio Telescope (WSRT) provides spatially resolved 21-cm line profiles such that surface density maps and kinematics can be extracted. In this study we only focus on the surface density maps.\n\nIn the WHISP survey, each object is observed in three different resolutions, with an average FWHM of the beam of 14, 30, and 60 arcsec, respectively. The sensitivity of the observations increased from a typical root-mean square error of 3 mJy/beam to 0.8 mJy/beam when the instrument was upgraded, leading to an average surface density sensitivity of 0.18 M_⊙pc^-2 for the medium-resolution maps (). The observational characteristics that are relevant for this work are summarized in Table <ref>.\n\n\nThe field-of-view (FOV) of the WHISP observations is typically 0.25 square degrees, centered on the object of interest. A substantial amount of maps contain other galaxies, galaxy interactions or mergers. While a study of these objects would be interesting on its own (see ; ), we choose to avoid this additional complexity for the present study and analyze galaxies in IllustrisTNG one-by-one (i.e. processing each subhalo individually, see Section <ref>). Hence, we want to exclude observations that feature ongoing interactions or have other galaxies in their FOV. \n\n\nRecently, <cit.> compiled a catalogue of 228 galaxies observed within WHISP, containing only isolated objects (in their FOV, this does not refer to the environment in general) with good data quality. This sample is representative of the full WHISP sample in terms of galactic morphology. <cit.> also supplemented the WHISP data with infrared data from the WISE survey, enabling estimates of the stellar masses and star-formation rates. This is very advantageous for our purpose as we can select WHISP-like galaxies in IllustrisTNG based on their mass, stellar mass, and star-formation rate. Hence, we use the WHISP sample defined in <cit.> for this study. Additionally, we remove two objects (UGC4483 and UGC9128) as their stellar masses are below our IllustrisTNG selection threshold of 10^7 M_⊙, ending up with 226 galaxies in the observational galaxy sample.\n\n\nWe retrieve the moment-zero maps for these 226 galaxies in all three available resolutions from the online Westerbork database[<http://wow.astron.nl/>]. The moment-zero maps, ∑_ν S_ν, are stored in mJy/beam (S_ν denotes the flux in a specific channel). We convert them to surface density maps assuming optically thin 21-cm emission (e.g. ):\n\n\n    Σ_H i/M_⊙ pc^-2=8.85∑_ν S_ν/mJy/beamΔ v/km s^-1(Δα·Δδ/arcsec^2)^-1,\n\nwhere Δ v is the velocity channel width and Δα (Δδ) denote the FWHM of the major (minor) axes of the beam. We remark that for 47 WHISP galaxies the beam FWHM information was missing, for these galaxies we used the information from the online database for the highest-resolution observations and average values of 30×30 (60×60) arcsec^2 for the medium (low) resolution observations, respectively.\n\nTo select WHISP-like galaxies from IllustrisTNG, we need some additional parameters to describe the WHISP galaxies like the mass, stellar mass, and star-formation rate. Calculating these quantities requires a distance estimate. While <cit.> added distance estimates from the NASA Extragalactic Database (NED[<https://ned.ipac.caltech.edu/>]) to their galaxy catalogue, a substantial fraction is derived from redshifts, which can be unreliable for the local WHISP galaxies with a median distance of ≈20 Mpc (). Hence, we opt to compile our own distances from NED, using the most recent redshift-independent distance estimate for each galaxy. If such estimates are not available we use the distance estimated from the redshift, corrected for the influence of the Virgo cluster, the Great Attractor, and the Shapley Supercluster. \n\n\nFor each WHISP galaxy we compute the mass from the distance estimate and the surface density map (Eqn. <ref>). We use the medium-resolution maps of the WHISP galaxies to compute their masses, we note that the map resolution hardly affects the masses. For the stellar masses and star-formation rates, we exactly follow the steps outlined in section 3 of <cit.> using their compilation of WISE fluxes but our own distance estimate compilation.\n\n\n\n\n\n §.§ Creation of HI maps\n\n\n\n\n\n\nHere we describe how we generate maps for the simulation and observational galaxy samples. Part of the analysis of this paper compares different simulation postprocessing methods against each other. For these parts, we use a fairly basic algorithm to create `plain' maps for IllustrisTNG galaxies, described in Section <ref>. When we compare IllustrisTNG against observational data, we use a more advanced algorithm to generate `mock' maps (described in Section <ref>) with the aim of emulating the most important steps of the observations. Lastly, we also make some minor adjustments to the observational WHISP maps, described in Section <ref>. The main steps of the algorithm to create WHISP and mock IllustrisTNG maps are visualized in Figure <ref>.\n\n\n\n  §.§.§ IllustrisTNG: Plain maps\n\n\n(i) Orientation: When creating plain maps in random orientation, we leave the simulated galaxy in its intrinsic orientation. For plain maps in face-on orientation, we rotate the galaxies such that its angular momentum vector aligns with the z-axis of the simulation box. Following <cit.> we calculate the galactic angular momentum using all gas cells within the 3D gas half-mass radius. If there are fewer than 50 gas cells within this radius we use all star particles within two stellar half-mass radii instead.\n\n\n(ii) Projection: We always project the gas cells along the z-axis of the simulation box. We employ a consistent projection algorithm for these tasks, specifically we use the method that was introduced by <cit.> which we briefly summarize here. Since the moving-mesh cells of IllustrisTNG have complex shapes we apply an adaptive Gaussian smoothing kernel to the gas cells. For the smoothing kernel, we use a width of σ=0.5(m/ρ)^1/3. For the calculation of the surface density, the algorithm simply sums up the masses of all smoothed gas cells in each pixel and divides by the pixel area. The map size is set to lie within the spherical aperture such that the map side length is √(2)· r_A. We resolve the plain maps by a fixed number of pixels (128×128). \n\nIn some cases we are also interested in maps of other quantities than surface density. We employ the same projection algorithm in these cases. For quantities that are averaged (instead of summed) within each pixel (e.g. U_MW, D_MW) we weigh each gas cell by its total mass unless otherwise noted. \n\n\n\n\n  §.§.§ IllustrisTNG: Mock maps\n\n\nA fair comparison between observations and cosmological simulations needs the two galaxy samples to be broadly comparable. Furthermore, it requires some sort of mock-observation routine which mimics the observational procedure. We do not attempt to fully emulate the interferometric observations of WHISP but include the three most important effects: Mimicking the angular pixel sizes of the observations, smoothing with the beam of the instrument, and adding noise. This is a similar strategy as is applied in the MARTINI tool to create mock datacubes from cosmological simulations (), although there is no noise incorporated in MARTINI.\n\n\n(i) Selection: For each WHISP galaxy, we select IllustrisTNG galaxies with similar stellar masses (±0.2 dex) and star-formation rates (±0.3 dex). The tolerances for these quantities correspond to the 2-σ error bars adopted by <cit.>. For ≈20 % of the WHISP galaxies in the  sample, no SFR estimate is available because they were not detected in the WISE W3 band. For these galaxies we only used the stellar mass criterion. In a second step, we then select the five IllustrisTNG galaxies that are closest to the WHISP galaxy in terms of log_10M_HI out of the galaxies that are similar in terms of stellar mass and star-formation rate. The factor of five is chosen to increase the statistics of the simulated galaxy sample while keeping the mass distribution similar. As we find at least five similar IllustrisTNG galaxies (in terms of stellar mass and SFR) for each WHISP galaxy (typically dozens of IllustrisTNG galaxies conform to the stellar mass-SFR selection criteria), the `mock' TNG50 sample consists of 5·226=1130 galaxies. We remark that ≈20 % of this sample is just selected by M_⋆ and M_H i due to some WHISP galaxies being undetected in the WISE W3 band. We have verified that these TNG50 galaxies typically have low star-formation rates, as expected from their observational counterparts for which we only have an upper bound on the SFR.\n\n\n(ii) Orientation: We match the inclinations of the IllustrisTNG galaxies to their corresponding WHISP galaxies, by rotating IllustrisTNG galaxies such that the angle between the z-axis of the simulation box and the angular momentum vector matches the WHISP galaxy inclination. We retrieve the inclinations of the WHISP galaxies from the galaxy catalogue of <cit.>.\n\n\n(iii) Projection: We put the IllustrisTNG galaxies at the distances of their corresponding WHISP galaxies. The galaxies are then projected along the z-axis of the simulation onto a 2D grid. Each map is created in three different resolutions as in the observational data, the angular pixel sizes (5, 10, and 20 arcsec, respectively) are chosen to match the WHISP data. We use the same map size as in Section <ref> of √(2)· r_A.\n\n\n(iv) Smoothing: To emulate the effect of the WHISP beam we then convolve these maps with a circular 2D Gaussian kernel, using the average WHISP beam FWHM (14, 30, and 60 arcesonds, respectively) for the three different resolutions.\n\n\n(v) Noise: After beam convolution, we add Gaussian noise to the maps. We use the average 1-σ WHISP noise levels (see Table <ref>), which vary depending on the map resolution.\n\n\n(vi) Segmentation: For the calculation of the morphological parameters and the CDDF, the main object needs to be identified and separated from the background in the map. While we always project only one subhalo per IllustrisTNG map, it is possible that a subhalo consists of a neutral gas disk and additional disconnected neutral gas structures. For our analysis, we only want to consider the main object (in this case the neutral gas disk), and hence need to segment the map. We use the [We use the  function with the average 1-σ noise (see Table <ref>) as threshold and five pixels as the minimum number of connected pixels.]  package to find the object which belongs to the central pixel. If the central pixel is assigned to the background we instead use the largest object in the map. To make the segmentation map which cuts out the galaxy of interest more regular we smooth it with a uniform boxcar filter measuring five pixels in each dimensions. By visual inspection, we find that this algorithm reliably identifies the galaxy in the map.\n\n\n\n\n\n\n  §.§.§ WHISP: Observational maps\n\n\nThe extraction of maps for the WHISP galaxies is described in Section <ref>. We perform two additional steps to generate the final WHISP maps that we analyze in this study.\n\n\n(i) Noise: The WHISP maps are inherently 3-σ-clipped, meaning that they do not contain any background (all background pixels are set to NaN values). This is problematic for the calculation of the morphological parameters, as some of the parameters need a background in the image in order to be accurately computed. Hence, we replace all NaN pixels from the WHISP maps with Gaussian noise, using the average 1-σ WHISP noise levels depending on map resolution.\n\n\n(ii) Segmentation: We create segmentation maps for the WHISP galaxies using exactly the same algorithm as described in Section <ref>. Again, we find by visual inspection that this algorithm reliably identifies the main galaxy in the FOV of the observation.\n\n\n\n\n§ UV FIELD COMPARISON\n\n\n\nWe start our analysis by assessing the differences in the SKIRT, Diemer, and Lagos UV field estimates, and explore how this affects the and H_2 properties of the simulated galaxy population in TNG50.\n\nTo qualitatively compare the different UV field estimates we show 2D projections of the U_MW parameter (calculated using the plain map algorithm in random orientation, see Section <ref>) for an example TNG50 galaxy in the top panels of Figure <ref>. This galaxy has a stellar mass of 9.3×10^10 M_⊙, a high gas-to-stellar mass ratio of 2.1, and a star-formation rate of 9.0 M_⊙ yr^-1. The 3D stellar and gas half-mass radii are shown as solid and dashed circles, respectively. The angular momentum vector of the galaxy is almost parallel to the z-axis of the simulation, hence the random projection in Figure <ref> displays an almost face-on orientation of the galaxy.\n\nFor the SKIRT UV field (top left panel), some clumpy structure in the spiral arms due to the star-forming regions (young star particles with ages less than 10 Myr) that strongly emit UV is visible. In the outskirts (outside the gas half-mass radius), the attenuation and scattering by dust grains imprints some structure on the UV field. We remark that in the SKIRT UV field, radiation from the evolved stellar population is also modelled, unlike in the other UV field models. For the Diemer UV field (top center panel), radiation is emitted from all star-forming gas cells. These cells are more common but less luminous than the star-forming regions in the SKIRT recipe (star particles with ages below 30 Myr), leading to a less clumpy UV field in the spiral arms for the Diemer UV field. Since the radiation is transported without considering absorption/scattering the radiation field is very smooth in the galactic outskirts as well. We remark that there is a minor discontinuity in the Diemer UV field at the edges of a square enclosing the gas half-mass radius. This is due to numerical resolution issues in the calculation of the Diemer UV field as the algorithm splits the galaxy into a high-resolution region within the gas half-mass radius and a low-resolution region outside of it, allowing a significant speedup of the algorithm. We do not expect that this affects any of our results. Lastly, the Lagos UV field (top right panel) scales the UV flux to the star-formation rate of gas cells. Since there is no transport of radiation in this approach there is a strong bimodality between star-forming and quiescent gas cells. The gas cells without star formation only receive the homogeneous background UV field of U_MW=0.00137 (), note that this floor is applied to all three UV field estimates. \n\nWe also show maps of  surface densities and molecular fractions calculated with the three different UV field estimates in Figure <ref> (using our default partitioning scheme of GD14). Despite significant differences in the UV field, the Σ_H i and f_mol maps for this example galaxy appear almost identical for the SKIRT and Diemer UV field estimates. We remark that the neutral gas hole in the center of this galaxy is due to feedback from the supermassive black hole (see Section <ref>).\n\nIn Section <ref> and Section <ref> we examine whether the different UV field estimates lead to significant statistical discrepancies for ensemble quantities of the entire galaxy population (within our base sample of 12'431 galaxies) in TNG50.\n\n\n\n\n\n §.§ Radial profiles\n\n\n\n\n\n\nTo assess the impact of the UV field on the H i-H_2-transition on the galaxy population in a more statistical fashion, we calculate 1D projected radial profiles of UV fields and molecular gas fractions for the TNG50 base sample in this section. Following <cit.>, we only consider galaxies with M_H_2>10^8 M_⊙ (we use our default model here to calculate the mass for the galaxy selection) in this section as the f_mol profiles of galaxies with less molecular gas are noisy. The exact value of this cutoff does not affect our conclusions.\n\nWe show median U_MW radial profiles in Figure <ref>. The interquartile ranges are shown as hatched areas. For the calculation of the radial profiles we first rotated each galaxy into a face-on orientation (see step (i) of Section <ref>) and considered 2D radial profiles (i.e. using the projected distance to the galaxy center, not the 3D distance). For each radial bin, we then compute the median of the U_MW parameter of all gas cells within this bin (using the mean instead of the median would significantly bias U_MW for the Lagos UV field, as star-forming gas cells receive UV fluxes that are 4-6 orders of magnitude larger than non star-forming cells). If there are no gas cells for a galaxy within a radial bin U_MW is set to the uniform UV background. To compute a single average profile for the entire galaxy sample we stacked the galaxies by their gas half-mass radii and computed the median profile.\n\nAt the center the Lagos UV field exceeds the other estimates by more than an order of magnitude due to the large unattenuated UV field in star-forming gas. As the Lagos UV field is scaled to the gas cell star-formation rate and most of the gas cells at larger radii do not form stars, the Lagos UV field quickly decreases to the uniform UV background at U_MW=0.00137. The Diemer UV field has a steeper UV profile than the SKIRT field, which is due to the centrally concentrated star-forming gas cells being the only UV sources in the Diemer UV field. The SKIRT UV field is more extended as we treat all star particles as UV sources (see Table <ref>).\n\n\n\nWe compare the different calculations for the H_2 mass fractions by plotting the median projected radial profiles of f_mol in Figure <ref>. For each galaxy, we calculate its profile by computing the mean molecular fraction in each radial bin, similar to the calculation of the UV field profiles. If there are no gas cells for a galaxy within a radial bin, f_mol is set to zero. We find that if we instead ignore these radial bins for the calculation of the median profiles f_mol increases nonphysically for large radii. As for the UV field profiles, we stack the profiles of all galaxies by their half-mass radius and compute the median f_mol profile of the galaxy population. Applying the mean instead of the median to the stacked profiles (as is done in ) gives higher f_mol at larger radii and reduces the scatter between the different models substantially. As the mean profiles are dominated by few galaxies that have high molecular fractions at larger radii and for consistency with Figure <ref> we opt for median profiles in Figure <ref>. For the three UV models (SKIRT, Diemer, Lagos) we show the default hydrogen partitioning scheme (GD14) as solid lines and the spread between the UV-dependent schemes as shaded areas. We also show the UV-independent partitioning schemes (KMT09 and S14). The differences in the molecular fractions relative to the default model (GD14 with the SKIRT UV field) are shown in the bottom panels.\n\n\nThe significantly lower Lagos UV field (except in the center) manifests in higher molecular fractions. For the SKIRT and Diemer f_mol profiles, the spread due to the different partitioning schemes is much larger than the difference due to changing the UV field. The discrepancy in the f_mol profiles comparing the different UV fields reaches its maximum at ≈0.4 R_gas^1/2. This is not particularly surprising because f_mol is 20-40 % at this radius, so this is broadly the region at which the H i-H_2-transition takes place. The H i-H_2-transition occurs typically over a very narrow range in densities, and other parameters like U_MW can slightly shift this density range (see e.g. Figure 1 of ). This means that the gas density in this region is in a range where the partitioning schemes are particularly susceptible to changes in the UV field. Lastly, we remark that the default GD14 partitioning scheme minimizes the differences in the molecular fractions upon variation of the UV field. Hence, we expect more significant discrepancies in the H i/H_2 properties of galaxies between different UV field estimates when using other partitioning schemes (GK11 or K13).\n\n\n\n\n\n\n §.§ HI and H2 mass functions\n\n\n\n\nWe consider H i/H_2 mass functions for our base sample in the upper panels of Figure <ref>. As in Figure <ref> we display the UV-dependent partitioning schemes by showing the default partitioning scheme and spread between schemes for each UV field estimate individually (solid lines and shaded areas). Differences in the molecular fraction relative to the default model are shown in the bottom panel.\n\n\nThe mass function (HIMF) is very robust against variations of the partitioning schemes and UV field estimates, except for the high-mass end. masses calculated using the Lagos UV field are lower compared to the SKIRT and Diemer UV fields, with discrepancies in the HIMF up to 20 %. For the H_2 mass function (H2MF), discrepancies are similar but begin at much lower masses. The differences between the partitioning schemes are generally larger for H_2 than for . For both mass functions, the default GD14 partitioning scheme is the model with the least tension between the different UV models (as seen in Figure <ref>). Still, the shaded areas between the different UV models do not overlap for high or intermediate H_2 masses, indicating that the discrepancy between different UV models is robust to the choice of the partitioning scheme. For the UV-independent partitioning schemes, we remark that the S14 model is in good agreement while the KMT09 model significantly exceeds other HIMF model predctions at the high-mass end (and vice versa for the H2MF).\n\nWe note that our mass functions are not directly comparable to the results of <cit.> due to different sample definitions: <cit.> consider all galaxies above a certain gas or stellar mass threshold, while we need a minimal stellar mass for all galaxies for SKIRT to work properly. This means we miss galaxies with low stellar mass (M_⋆<10^7 M_⊙) and high gas fractions when calculating the gas mass functions. Since the H i-to-stellar mass fraction in TNG50 at a stellar mass of ∼10^7 M_⊙ reaches values up to ∼10 (, figures including the TNG50 simulation can be found online[<benediktdiemer.com/data>]), the calculated mass function is complete only above an mass of ∼10^8 M_⊙. Indeed, we find that our HIMF agrees with the one from <cit.> above masses of 2×10^8 M_⊙. For molecular hydrogen the stellar mass cutoff is irrelevant: Because the H_2-to-stellar mass fractions are always smaller than unity, a stellar mass cutoff at M_⋆=10^7 M_⊙ does not exclude any galaxies with M_H_2>10^7 M_⊙. Hence, our H_2 mass function calculated with the Diemer UV field matches the result from <cit.>.\n\n\n\n\n\n\n\n\n\n§ NON-PARAMETRIC MORPHOLOGIES OF HI MAPS\n\n\nTo test our model and to evaluate the realism of the spatial distribution of gas within TNG50 galaxies, we compare simulated surface density maps to 21-cm maps from the observational WHISP dataset. We use the full mock map algorithm (Section <ref>) to generate a WHISP-like sample of 1130 TNG50 maps, to be compared to 226 WHISP maps. To quantitatively compare the maps of the two samples we consider non-parametric morphologies (concentration, asymmetry, smoothness, Gini and M_20 statistics). We calculate these statistics for the TNG50 and WHISP maps consistently with the  tool (). \n\n\n\n §.§ Statmorph\n\n\n is a  tool for parametric and non-parametric analyses of astronomical images, and has already been used to study mock images in optical bands for IllustrisTNG (; ). Besides the image, the surface density map in our case,  requires a segmentation map and an estimate of the noise as input. A segmentation map separates all objects in the image from the background. As we process galaxies individually in IllustrisTNG and use a galaxy sample from WHISP that only contains isolated objects, we have only one object per image to analyze. The segmentation map is calculated as described in Section <ref>.\n\n also requires an estimate of the noise on the maps. We use the simpler gain option of  which calculates Poisson noise, the non-parametric morphologies are independent of the actual gain value. For ≈5% of the galaxies[This fraction is very similar for the WHISP and the TNG50 galaxy samples individually.],  does not finish properly, mostly due to irregular segmentation maps. Such galaxies are omitted from our analysis. We find that the results at medium resolution are most reliable, as they pick up more features than the low-resolution maps and  successfully runs more often than for the high resolution. Hence, we consider the medium-resolution maps of 30 arcsec as default in the following analysis.\n\n\n\n\n §.§ Morphological results\n\n\n\n\n\n\nWe show histograms of the non-parametric morphologies for the TNG50 and WHISP maps in varying angular resolution in Figure <ref>. To avoid overcrowded figures we only show our default partitioning scheme (GD14 plus SKIRT UV field) in this section, using other partitioning schemes or UV fields yields comparable results. We remark that the number of galaxies plotted in the histograms has a small dependency on the angular resolution, since  is not always able to measure the morphological parameters. We have verified that this does not affect the distributions in Figure <ref>, i.e. the galaxies that are lost in the high-resolution TNG50 maps do not differ significantly in terms of the morphological statistics from the overall galaxy sample.\n\nComparing the WHISP and TNG50 medium-resolution (30 arcsec) maps, we find that the asymmetry statistic matches well, the TNG50 smoothness statistic is slightly lower (i.e. the TNG50 maps are slightly smoother than the WHISP maps), and the distribution of the Gini statistic is a bit more skewed in the WHISP sample. For the TNG50 maps, the scaling with angular resolution seems to be weaker for the smoothness statistic and reversed for the asymmetry statistic. As the maps at resolutions other than 30\" are less reliable we do not investigate this discrepancy further. More significant differences arise in the concentration and M_20 statistics. Denoting the difference of the TNG50 and WHISP medians of a morphological statistic k as Δk̃, we have more concentrated WHISP maps (ΔC̃≈-0.32) and find ΔM̃_20≈0.30.\n\n\nWe further explore the deviations in the concentration and M_20 statistics in Figure <ref> by plotting their correlation for the medium-resolution maps. This is also the strongest cross-correlation between non-parametric morphologies found by <cit.> and can be used to identify interacting galaxies as outliers in the top right corner. Due to the definitions of C (increasing with brighter pixels in the galaxy center) and M_20 (increasing with brighter pixels in the outskirts), these statistics are usually anticorrelated. Such an anticorrelation is found in the WHISP data (see Figure <ref> or ), in synthetic optical images of IllustrisTNG galaxies (; ), and in images across the UV-submm wavelength range for both observed and simulated galaxies (; ; ).\n\n\nWe find that the two samples broadly follow the same anticorrelation, with the TNG50 galaxies shifted to the bottom right corner. Visual inspection of the maps with low concentration and high M_20 reveals that those are exclusively face-on galaxies, while the TNG50 outliers at intermediate concentration and high M_20 are mostly edge-on. These angular momentum trends are less pronounced for the WHISP galaxies. We do not find any other obvious characteristic such as mass that distinguishes the TNG50 outliers from the WHISP galaxies.\n\n\n\n\n §.§ Central HI holes in TNG50\n\n\nBy visual inspection of the TNG50 and WHISP maps, we find that many TNG50 galaxies feature large central holes, while such holes are much less prevalent in the WHISP data[On the other hand, by visual inspection of the 34 maps from the THINGS survey () it seems that central holes are prevalent in observed galaxies. This difference compared to WHISP could be related to different spatial resolutions (the THINGS beam has a FWHM of 6 \"). We point out that if central holes are washed out in WHISP due to the lower resolution, then the same should happen to the TNG50 maps as they are mock-observed at the WHISP resolution.] (see Figure <ref> for a typical example). Central holes could simultaneously explain the offsets in the concentration and M_20 statistics, with face-on galaxies deviating the most from observations as the impact of the central hole is maximized. In the following we discuss some possible sources of the apparently unrealistic prevalence of large central holes in TNG50.\n\nAn obvious mechanism to create large central holes is to ionize the neutral hydrogen or expel it from the galaxy center, for instance by feedback from active galactic nuclei (AGN). Indeed, <cit.> showed that related to AGN feedback, star-formation rates of TNG50 galaxies at z∼1 are centrally suppressed, in agreement with observational data. In IllustrisTNG, AGN feedback occurs along a thermal and a kinetic mode, depending on the black hole accretion rate. For galaxies with stellar masses roughly below 10^10.5 M_⊙, the AGN feedback is typically in the thermal mode with a continuous energy injection. For more massive galaxies, the kinetic mode kicks in and energy is injected in a pulsed, directed fashion into the surroundings (see  for more details). Furthermore, AGN radiation can ionize a substantial fraction of the hydrogen gas (see figure A6 of ). Recently, <cit.> found that the kinetic AGN feedback in IllustrisTNG is very effective at redistributing neutral gas from the central to the outer galaxy regions compared to the SIMBA simulation, hinting that AGN feedback could indeed create central holes. Upon examination of the neutral gas reservoirs of central and satellite galaxies in TNG100, <cit.> and <cit.> also speculate that some tension with observational data could arise due to AGN feedback ejecting/depleting neutral gas from the center.\n\nAs a first ad-hoc experiment to check if AGN feedback is responsible for the central holes in TNG50, we exclude all galaxies that experienced AGN feedback in the kinetic mode (≈25 % of the TNG50 sample of 1130 galaxies). This slightly reduces the tension in the morphological statistics to ΔC̃≈-0.23 and ΔM̃_20≈0.25. If we instead discard all TNG50 galaxies with an above-average energy injection in the thermal mode, the tension reduces to ΔC̃≈-0.18 and ΔM̃_20≈0.18. While it seems plausible that AGN feedback is at least partially responsible for the tension in the concentration statistic, we caution that the AGN feedback properties of the TNG50 galaxies are probably cross-correlated with other galaxy properties (e.g. stellar mass, gas-to-stellar mass ratio) which could also influence the morphological statistics. To unequivocally pinpoint the impact of AGN feedback, different cosmological simulation runs varying the feedback parameters need to be considered, which is beyond the scope of this paper.\n\nThe impact of AGN feedback is also somewhat depending on the numerical mass resolution of the cosmological simulation. For the IllustrisTNG suite, the feedback parameters are calibrated for TNG100, and are then kept the same for all IllustrisTNG runs (). Increasing the resolution of the simulation also increases the black hole accretion rate, especially in the thermal mode (see figure B1 of ). We test the impact of this numerical effect by repeating the construction of maps and morphological analysis for TNG100, which has a mass resolution twenty times coarser than TNG50 (see Table <ref>). We find that the tension is reduced to ΔC̃≈-0.16 and ΔM̃_20≈0.22 when using TNG100.\n\nLastly, it is also possible that there is neutral hydrogen in galaxy centers but the gas is predominantly molecular. To assess this, we check if the choice of the model affects the central holes. We find almost no changes in the morphological statistics upon variation of the UV field model or partitioning scheme, except for the UV-independent partitioning scheme S14 (which increases the tension in the C and M_20 statistics). However, when using `local' hydrogen partitioning schemes based on volume instead of surface densities (described in more detail in Section <ref>), we find that the tension reduces to ΔC̃≈-0.19 and ΔM̃_20≈0.20 (using the local GD14 scheme with the SKIRT UV field, this choice hardly affects the result). This could be related to the Jeans approximation breaking down for the dense galactic centers, as discussed in more detail in Section <ref>.\n\nWe point out that the unusual central holes could also be due to the AGN feedback in IllustrisTNG being too weak. If AGN activity would evacuate the cold gas from the entire galaxy instead of just the central region, the concentration statistics of such galaxies would increase and better match the WHISP data. It is also possible that such a reduction of cold gas in the galaxy leads to the object not being selected in the TNG50 sample, as it would be unobservable with WHISP. Indeed, results from <cit.> indicate that for TNG100, the AGN feedback quenches the star formation but only redistributes the cold gas instead of decreasing the galactic cold gas reservoir as is observed (). On the other hand, we caution that <cit.> did not mimic the observational steps to mock-observe the simulated galaxies. <cit.> used the same observational data and hydrogen postprocessing method as <cit.> but a careful mock-observation routine, finding excellent agreement for the cold gas reservoirs of TNG100 and observations.\n\n\nThe prevalence of central holes is reminiscent of the finding of <cit.>, who discover unrealistic holes in the disks of galaxies in the EAGLE simulation. <cit.> attribute this to the implementation of the stellar feedback in the physical model of EAGLE. Along similar lines, we partly attribute the large central holes in TNG50 to the AGN feedback implementation. The effect is stronger in the higher-resolution simulation TNG50 compared to TNG100 due to the IllustrisTNG calibration scheme. <cit.> found results along similar lines as the surface density profiles of IllustrisTNG galaxies exhibit central deficits compared to observational data from the Bluedisk survey (), with larger mismatches for higher resolution simulations. However, we note that the usage of local partitioning schemes reduces the prevalence of central holes. We conclude that these different effects (and potentially other systematics that we have not uncovered here) conspire to lead to the central holes and eventually the mismatch in the C and M_20 statistics.\n\n\n\n\n\n§ HI COLUMN DENSITY DISTRIBUTION FUNCTION\n\n\n\n\nThe column density distribution function is a widely used metric to quantify the distribution of atomic hydrogen in the Universe (e.g. ; ; ; ). In this study, we use the CDDF as the second metric (apart from the morphologies) to compare TNG50 to observational data. The CDDF is insensitive to the spatial distribution of the H i, it only probes how much atomic hydrogen per column density interval exists in the galaxy population. Hence, this CDDF comparison is somewhat complementary to the analysis of morphologies. We describe how we extract the CDDF from TNG50 (Section <ref>) and WHISP (Section <ref>), and compare them in Section <ref>. We only discuss the default model (GD14 + SKIRT UV field) for TNG50 in this section and compare to other partitioning schemes in Section <ref>.\n\n\n\n §.§ CDDF measurement from TNG50\n\n\nAs we intend to compare the CDDF from TNG50 to observational data, we use the full mock map algorithm (Section <ref>) to generate 1130 synthetic maps (in the three different angular resolutions of the WHISP survey) for TNG50 galaxies. We then follow the observational procedure to compute the CDDF, which consists of summing the area covered by columns within a specific column density interval over all galaxies (e.g. ; ):\n\n\n    CDDF_H i=c/H_0∑_jϕ(M_H i^j) w(M_H i^j) A(N_H i)^j/N_H i ln10 Δ(log_10N_H i),\n\nwhere c denotes the speed of light, N_H i is the column density, and Δ(log_10N_H i) is the constant logarithmic column density bin spacing. This equation is applicable when the sample from which the CDDF is derived (in our case the 1130 mock-selected TNG50 galaxies) is drawn from a broader underlying galaxy population (the base TNG50 sample of 12431 galaxies). The CDDF of the Universe can then be computed by scaling the CDDF from the smaller sample using some galaxy property (e.g. stellar mass or mass) in which the underlying broader sample is assumed to be complete[We remark that CDDFs calculated in this fashion are not necessarily representative of the broader galaxy population since only the M_H i distributions are matched. This does not affect our comparison between TNG50 and WHISP, as we follow the same methodology for the simulated and observed  CDDF. Hence, the mock TNG50/WHISP samples are equally (un-)representative of their broader galaxy populations.]. For the CDDF, the mass is a natural choice for this galaxy property (also adopted by e.g. ). Hence, the sum in Eqn. <ref> runs over bins of mass. The area function A(N_H i)^j denotes the area covered by columns within the (logarithmic) column density interval summing over all galaxies (in the smaller sample) within the j-th mass bin. The weight factor w(M_HI^j) corresponds to one over the number of galaxies in the smaller sample within the j-th mass bin, thereby normalizing the area function. To scale the CDDF to the entire galaxy population, the normalized area function (w(M_H i)A(N_H i)) measured from the smaller sample is then multiplied with the abundance of objects in the broader sample in the j-th mass bin per volume, ϕ(M_HI^j). Hence, ϕ(M_H i) corresponds to the mass function (derived from the broader sample), but without dividing by the (logarithmic) mass bin width.\n\nFor our calculation of the CDDF in TNG50, we compute the area function and the masses for the weight factor from the 1130 mock maps[Instead of computing the masses from the mock maps we could also use the `intrinsic' masses of the galaxies, simply summing the masses of the gas cells. However, this introduces inconsistencies with the observational procedure and the normalization of the CDDF.]. ϕ(M_H i) is calculated from the base TNG50 sample of 12431 galaxies. This approach is equivalent to observational determinations of the CDDF, where a smaller galaxy sample is observed with high spatial resolution to derive the area function. The area function is then scaled using the mass function derived from blind galaxy surveys which measure the broader galaxy population. For cosmological simulations, we have the option to generate spatially resolved maps directly for the broad galaxy population, circumventing the scaling of the CDDF from a smaller galaxy sample. As we want to emulate the observational procedure with realistic mock maps (which requires a mock sample selection and putting the galaxies at the expected distances), we find the approach using Eqn. <ref> more appropriate for this study. We test the simpler approach of measuring the CDDF from plain maps of the broader galaxy population in Section <ref>.\n\n\n\n\n\n\n\n §.§ CDDF measurement from WHISP\n\n\n\n\n\nThe CDDF at redshift zero can be measured with interferometric 21-cm surveys. A precise determination of the CDDF is presented in <cit.> based on WHISP data (see Section <ref> for details about the WHISP survey). Although we could measure the CDDF from the WHISP maps ourselves, we refrain from doing so as the <cit.> measurement constitutes the gold standard for the observational CDDF at redshift zero and their result is used in many studies (e.g. ; ; ; ).\n\nThe CDDF measurement from <cit.> is based on the full WHISP survey (in its three available resolutions). Since the smaller WHISP sample of <cit.> that we use throughout this study is representative of the full WHISP sample, we do not expect that the usage of different WHISP samples affects our results. <cit.> have scaled their measurement of the WHISP CDDF to the broader galaxy population (see Eqn. <ref>) using the mass function from the blind HIPASS survey ().\n\n\nWe add a cautionary note on H_0 correction factors. While the IllustrisTNG simulations were run with h=0.6774, the observational result from <cit.> was obtained with h=0.75. It would be desirable to correct the observational result to the more recent value of H_0. For the CDDF, however, this is an involved calculation due to the scaling factor ϕ (which is the HIMF modulo the mass bin width) in Eqn. <ref>. This HIMF is parametrized as a Schechter function with parameters that themselves depend on the value of H_0. Hence, H_0 propagates in a non-polynomial way into the CDDF result from <cit.>. We have run a test calculation of the CDDF based on the WHISP maps and the HIPASS mass function from <cit.> to emulate the <cit.> calculation (the actual CDDF calculation is more complex as  split the WHISP galaxies by morphological type and use type-specific mass functions). We find that updating h from 0.75 to 0.6774 decreases the CDDF by ≈10-20 %, except for the highest columns (N_H i>1.5×10^22 cm^-2) where the CDDF increases by ≈10 %. Since the H_0 correction factors that we find are much smaller than the difference between the original <cit.> result and our test calculation, we keep using the <cit.> result but multiply it with 0.85 to correct it to our value of h=0.6774.\n\nFurthermore, the various biases in the HIMF from <cit.> (e.g. selection effects, self-absorption) are not taken into account by <cit.> when calculating the WHISP CDDF. <cit.> find that the cumulative effect of these biases reduces the total abundance in the Universe by 11.6 %. As the CDDF propagates linearly into the abundance (see Eqn. <ref>), we additionally decrease the WHISP CDDFs uniformly by 11.6 %.\n\nFor studies of the CDDF, which extends over nine orders of magnitude for N_H i∼10^19-10^22 cm^-2, these correction factors are completely negligible. For our study, we also consider the abundance (which effectively corresponds to the normalization of the CDDF), which scales linearly with any correction factors to the CDDF. Hence, the H_0 and HIMF correction factors are not negligible for our purpose.\n\n\n\n\n\n\n\n §.§ CDDF results\n\n\nSince the CDDF measures the area covered by columns per column density interval, the total abundance in the Universe can be derived from the CDDF. Denoting the abundance Ω_H i as a fraction of the critical density of the Universe, Ω_H i=ρ_H i/ρ_c with ρ_H i the mass density in the Universe and ρ_c=1.274×10^11 M_⊙Mpc^-3, we can write the fractional contribution to Ω_H i per (logarithmic) column density interval as follows:\n\n\n\n    ΔΩ_H i/Δ(log_10N_H i)   =m_H i/ρ_cVN_H i∑_jϕ(M_H i^j) w(M_H i^j) A(N_H i)^j/Δ(log_10N_H i)\n       = m_H iH_0ln(10)/ρ_cc(N_H i)^2·CDDF_H i(N_H i),\n\nwhere m_H i is the mass of a hydrogen atom, V is the volume of the survey or the simulation box, and the sum in the first line of Eqn. <ref> runs over bins of mass.\n\nWe show our main CDDF result, Figure <ref>, as the conventional CDDF (left panel) and as fractional contribution to Ω_H i (right panel). Observational results from <cit.> (slightly modified as described in Section <ref>) are shown in grey to black markers for the three available WHISP resolutions. The TNG50 CDDFs for the different angular resolutions are displayed as colored lines. For our comparison it is more convenient to analyze ΔΩ_H i/Δ(log_10N_H i) instead of the conventional CDDF for two reasons: ΔΩ_H i/Δ(log_10N_H i) spans much fewer orders of magnitude which enables a more precise visual comparison for the different column density distributions. Furthermore, it also relates directly to the abundance as Ω_H i effectively corresponds to the integral of ΔΩ_H i/Δ(log_10N_H i) over the column density. To visualize this integral we also show ΔΩ_H i/Δ(log_10N_H i) with a linear y-axis in the inset in Figure <ref>, where the areas under the curves directly correspond to the abundance of TNG50 or the measured abundance in the Universe.\n\n\nWe caution that the comparison of the column density distributions becomes unreliable below the sensitivity limits, indicated by the arrows at the top of Figure <ref>. The segmentation for our TNG50 maps is more aggressive (the main object cutout is smaller) than the 3-σ-clipped WHISP maps used by <cit.> such that the TNG50 CDDFs decrease quickly for column densities below the sensitivity limits (note that the median sensitivity limits of WHISP and the TNG50 mock maps are equal due to our mock map generation algorithm, see Section <ref>).\n\nIntermediate column densities (N_H i≈10^20-10^21 cm^-2) are significantly more abundant in TNG50 than in WHISP. This leads to a substantial mismatch in the abundance comparing TNG50 and observational data. We point out that the abundance (equivalent to the normalization of the CDDF) as visualized in the inset of Figure <ref> is actually completely independent of the WHISP data or the TNG50 mock maps due to the scaling factor ϕ(M_H i) in Eqn. <ref>. Instead, the normalizations of the CDDFs are given by Ω_H i as measured by the blind HIPASS survey (for the WHISP CDDFs) or the total amount of in the TNG50 base galaxy sample of 12431 galaxies (for the TNG50 CDDFs), respectively. Hence, the tension in the CDDF at these intermediate column densities points towards an excess of in TNG50 or an underestimation of Ω_H i in blind surveys, which we discuss in more detail in Section <ref>.\n\nAt the highest column densities (N_H i>10^21 cm^-2), the effect of beam smearing becomes substantial both for WHISP and TNG50, which manifests in smearing out the high-density peaks. In this column density range, TNG50 significantly underpredicts the CDDF compared to WHISP. We find that there is neutral hydrogen in TNG50 in these column densities (see also ), but the hydrogen partitioning that we perform is very effective at converting into H_2 such that the abundance of high column densities in the simulation is lower than observed. We discuss this tension and a potential resolution in more detail in Section <ref>. Lastly, we point out that our result contrasts with other studies of the CDDF (; ; ) who find a good agreement between WHISP and cosmological simulations, especially at the high-column end. We attribute this primarily to the beam smoothing of the mock maps, which is not performed in these studies (see Section <ref> for more details). \n\n\n\n\n\n§ DISCUSSION\n\n\n\n\n\n §.§ Normalization of the CDDF: HI abundance in IllustrisTNG\n\n\n\n\nAs shown in the inset of Figure <ref>, the CDDF normalization (equivalent to Ω_H i) in TNG50 significantly exceeds the observational measurement. The observational value of Ω_H i at redshift zero is most reliably determined with blind surveys (see figure 14 of  for a data compilation). For HIPASS, <cit.> find Ω_H i=(3.9±0.4^stat±0.4^sys)×10^-4, consistent with the result for ALFALFA of Ω_H i=(4.0±0.1^stat±0.6^sys)×10^-4 (). Both of these measurements are corrected for various biases such as selection bias or self-absorption. Furthermore, we corrected these abundances to our adopted value of the Hubble constant, h=0.6774.\n\nAs the WHISP CDDF is scaled with the HIPASS HIMF, we expect the exactly same value of Ω_H i=3.9×10^-4 when calculating the abundance from the WHISP CDDF. With the raw CDDF from <cit.> we obtain Ω_H i=5.1×10^-4, but with the Hubble and HIMF biases correction factors (see Section <ref>) the abundance is reduced to the expected value of Ω_H i=3.9×10^-4 (with very little impact on the WHISP resolution). Hence, we consider our correction factors somewhat realistic, at least at the level of total abundance.\n\n\nStudies investigating the abundance in IllustrisTNG (; , ) found higher values of Ω_H i compared to blind surveys. The magnitude of this discrepancy depends on the simulation version of the IllustrisTNG suite and the postprocessing routines. Summing all in galaxies in the TNG100 simulation, <cit.> report Ω_H i=(5.4±0.5)×10^-4, in tension with the observational results. For TNG50, <cit.> report Ω_H i=(7.2±1.1)×10^-4, in significant excess of the data. The error bars on these values correspond to the scatter due to the different partitioning schemes considered by <cit.>. Using our default model (GD14 plus SKIRT UV field) for our base sample of 12431 galaxies in TNG50, we obtain Ω_H i= 6.0×10^-4. This is at the lower edge of the value reported by <cit.>, since the GD14 scheme typically predicts the highest molecular fractions (together with the S14 scheme) and because we miss a few gas-rich galaxies with very low stellar mass due to our galaxy sample selection.\n\n\n\n  §.§.§ Observational considerations\n\n\n\nA natural explanation for this excess of in IllustrisTNG is that Ω_H i is underestimated by the observations. gas in low-column-density gas could be difficult to detect, while very high columns are prone to self-absorption and hence an underestimation of the actual column density. Indeed, <cit.> find based on observations of M31, M33 and the LMC that self-absorption hides a significant fraction of gas. Correcting for this self-absorption, <cit.> claim that Ω_H i=(5.9±0.9)×10^-4. However, we remark that this study is questioned by more recent findings of <cit.> who use a more thorough model to measure the self-absorption correction. In any case, the distribution of in terms of column densities provides a convenient means to explore if we miss gas when measuring Ω_H i from 21-cm emission data.\n\n\nFrom the linear inset of Figure <ref>, we learn that Ω_H i is dominated by an intermediate column density regime of N_H i≈10^19-4×10^21 cm^-2. From our mock maps it is impossible to assess if column densities below N_H i≈10^19 contribute substantially to Ω_H i as the mock maps are segmented at approximately this column density (for the low-resolution maps). Generating plain maps (without noise and segmentation) for the full TNG50 base sample (see Section <ref> for more details), we find that column densities in the range 10^17-10^19 cm^-2 only contribute 2.2 % to the total abundance. At the other extreme, column densities above ≈4×10^21 cm^-2 hardly contribute to Ω_H i both for TNG50 and the WHISP data, indicating that self-absorption does not hide a significant amount of gas ( find that self-absorption only becomes important above N_H i≈10^22 cm^-2).\n\nIt is also possible that blind surveys simply miss a significant population of objects. If the additional gas in TNG50 stemmed from galaxies with very small masses, these objects could be missed, while very heavy galaxies could be rare and hence difficult to observe. For TNG50, we find from the HIMF (Figure <ref>) that the dominating objects for Ω_H i have masses within 3×10^8-3×10^10 M_⊙. We do not expect that our base sample selection (imposing M_gas>10^7 M_⊙ and M_⋆>10^7 M_⊙) or the limited simulation volume affects this finding. Galaxies in this mass range are easy to detect with blind surveys, for ALFALFA the sensitivity is good enough such that the HIMF can be precisely determined for masses larger than 10^7 M_⊙ (figure 2 of ). We conclude that the mismatch in Ω_H i (i.e. the CDDF normalization) between TNG50 and WHISP is due to an excess of atomic hydrogen in the simulation and not an underestimation by the observational data.\n\n\n\n\n  §.§.§ Simulation considerations\n\n\n\n\n\n\nA possible resolution of this Ω_H i discrepancy consists in mimicking the blind surveys like HIPASS or ALFALFA in IllustrisTNG, taking sensitivity limits and other observational effects into account (which were neglected in previous studies of Ω_H i in IllustrisTNG). While it is beyond the scope of this paper to fully emulate the ALFALFA or HIPASS observational setup, we assess the impact of the observational effect which probably affects the inferred abundance most, which is beam smoothing. An ALFALFA-like beam smoothing was used in <cit.> (based on ) to emulate the mass function measurement in IllustrisTNG. We follow their approach and apply a Gaussian beam with σ=70 kpc, i.e. we multiply the mass of each gas cell by exp[-r^2/(2σ^2)], with r being the 2D distance of the gas cell to the galaxy center in face-on projection (see (i) in <ref> for the algorithm to rotate galaxies into face-on projection). For our default model, we find that applying this beam smoothing effect reduces the abundance in TNG50 by ten percent to Ω_H i=5.4×10^-4. Hence, mimicking blind surveys reduces the tension in abundance and the CDDF normalization, but does not resolve it for TNG50.\n\n\nThe IllustrisTNG simulation resolution also affects the abundance. For the base galaxy samples of TNG50-2 (TNG100) and the default model, we find Ω_H i=5.1×10^-4 (Ω_H i=4.8×10^-4). Applying the ALFALFA-like beam smoothing further reduces these values by approximately ten percent. All observational and simulated inferences of Ω_H i are summarized in Table <ref>. The abundances of the lower-resolution simulations TNG50-2 and TNG100, taking the ALFALFA beam into account, are consistent with the observational values.\n\nWe show the CDDF for various IllustrisTNG simulations (calculated as described in Section <ref>) in Figure <ref>. Note that the scaling factor ϕ(M_H i) was computed as in Section <ref>, i.e. without ALFALFA-like beam smoothing. This means that the normalization of the IllustrisTNG CDDFs corresponds to the larger values in Table <ref> (e.g. 4.8×10^-4 for TNG100). Differences in the CDDF (left panel) for the various IllustrisTNG runs appear marginal, except at the highest column densities which are dominated by very few high-column-density pixels. In the linear inset in the right panel, it becomes clear that TNG100 is closer to the observational data than TNG50, which is due to the lower abundance in TNG100. Furthermore, we note that the effect of varying the simulation volume is negligible compared to varying the simulation resolution, as TNG100 and TNG50-2 have similar CDDFs (the TNG100 volume is roughly eight times larger than the TNG50-2 one, while the TNG100 mass resolution is comparable to TNG50-2, see Table <ref>).\n\nThe Ω_H i excess in TNG50 is reminiscent of the luminosity functions analyzed in <cit.>, who find that the lower-resolution TNG50-2 provides a substantially better match to observational data than TNG50. This is expected given that the physical model calibration for IllustrisTNG was undertaken at the resolution of roughly TNG100 (TNG50-2 has a comparable resolution). Indeed, <cit.> show that the stellar mass function in IllustrisTNG is converging, but not fully converged, as a function of numerical resolution. For a given dark matter halo, galaxies form slightly more stars at higher resolutions, shifting the stellar mass function. It is not surprising that these higher stellar masses lead to higher masses[This argument assumes that the H i-to-stellar mass ratio is independent of numerical resolution. Indeed, <cit.> find that this is true to first order and the fractions of various IllustrisTNG simulations agree well with an observational compilation from <cit.>.] and ultimately too much atomic hydrogen in the TNG50 galaxy population.\n\n\n\n\n\n §.§ Hydrogen partitioning based on volume densities\n\n\n\n\n\nThe simulation-calibrated partitioning schemes of GK11 and GD14 also exist in `local' variants that are based on volume instead of surface densities. At first sight this is a very attractive feature because it completely circumvents the difficulties of assigning surface densities to gas cells in simulations. According to <cit.>, a cosmological simulation using their local partitioning scheme needs to have a spatial resolution of L_cell∼100 pc. Additionally, <cit.> introduce a correction factor for the spatial resolution which is tested up to L_cell∼500 pc, well in excess of the median size of star-forming gas cells in TNG50 of 138 pc ().\n\nFor the morphologies, we find that the usage of local partitioning schemes provides a slightly better match to the concentration and M_20 indices between TNG50 and WHISP galaxy samples. Here, we test the local partitioning schemes in terms of the CDDF in Figure <ref>. The application of these schemes to IllustrisTNG with the relevant equations is described in Appendix <ref> and <ref>. Since the predictions of the local partitioning models are similar upon variation of the UV field scheme we only consider the SKIRT UV field here. For completeness we also check the CDDF using the two UV-independent partitioning schemes (KMT09 and S14) in Figure <ref>. We find that the KMT09 model (as well as the UV-dependent GK11 and K13 schemes which are not shown here) produces results comparable to the default GD14 partitioning scheme, while S14 underestimates the abundance of high-column gas even more than the other models.\n\n\nThe local partitioning schemes provide a perfect match at the high-column end, which is a substantial improvement over all other models. The higher concentration values of the maps using local partitioning schemes are related to this, as the central holes are less prevalent and more is formed in the dense galactic central regions (see Section <ref>). However, the abundance is very high with the local partitioning schemes (visible in the linear inset in the right panel of Figure <ref>), and reaches almost Ω_H i=10×10^-4 for TNG50, 2.5 times more than what is observed. This excess of using local partitioning schemes persists to TNG100, where we find Ω_H i=6.9×10^-4. This provides an a posteriori justification for refraining from using the local partitioning schemes, albeit they are conceptually appealing as they circumvent the need to estimate column densities for the 3D cosmological simulations.\n\nA naive explanation for the difference between conventional, column-density based and local partitioning schemes is that the Jeans approximation breaks down at high column densities. For the presumably star-forming gas cells in these high-density regions, the internal energy of the gas cell which is recorded by IllustrisTNG is an average over cold and hot phases in the context of the two-phase model of <cit.>. This means that the internal energy of the cold, neutral gas phase is overestimated, artificially increasing the Jeans length (see Eqn. <ref>) for the neutral star-forming gas. This unrealistically boosts neutral hydrogen column densities estimated from the Jeans approximation and molecular hydrogen formation, thereby explaining the low abundance of in high-density regions. <cit.> tested this issue by computing neutral hydrogen surface densities with the Jeans approximation, both with the internal energy recorded by IllustrisTNG and the internal energy of the cold gas (using T=1000 K for the cold gas). Surprisingly, they find that the Jeans approximation with the internal energy recorded by IllustrisTNG fits the true surface densities (estimated from projecting the gas cells) better.\n\n\nInstead of tweaking the Jeans approximation, a resolution for discrepancies in the morphological statistics and the CDDF is to use local partitioning schemes, under the assumption that there is simply too much neutral hydrogen in IllustrisTNG. For local partitioning schemes applied to TNG100, the abundance is approximately 1.75 times higher than the observational value. Scaling down the CDDF (computed from local partitioning schemes) by this factor yields an excellent agreement to the WHISP data, even at the high-column-density end. If the local partitioning schemes realistically split the gas into atomic and molecular phases, then the only way to reconcile the observational data with IllustrisTNG is to reduce the amount of neutral hydrogen in the simulation. To test if IllustrisTNG galaxies exhibit too much neutral gas requires mimicking both and H_2 abundance measurements using consistent postprocessing methods (i.e. a consistent hydrogen partitioning scheme). While this is beyond the scope of this paper, we note that results from <cit.> for TNG100 tentatively indicate that there is indeed an overabundance of molecular hydrogen (using conventional, column-density based partitioning schemes). It would be interesting to test if this H_2 overabundance persists when using local partitioning schemes. \n\n\n\n\n\n\n §.§ TNG-intrinsic CDDF and comparison to other studies\n\n\n\n\n  §.§.§ CDDF from plain maps\n\n\n\n\n\nOur results for the CDDF (Figure <ref>), especially the mismatch between simulations and observations for high column densities, contrasts with similar studies of the CDDF (; ; ). We attribute the discrepancies to our mock map creation (see Section <ref>) which takes observational effects into account, while other studies of the CDDF in cosmological simulations adopted simpler prescriptions to generate synthetic maps. To verify this and to assess the impact of the observational effects modelled in the context of our mock map algorithm, we construct the CDDF for TNG50 using simpler plain maps (see Section <ref>) in this section.\n\n\nWe generate plain maps for the TNG50 base sample of 12431 galaxies, and calculate the CDDF directly from this broad sample without the need of a scaling factor as in Eqn. <ref> (`TNG-intrinsic CDDF'):\n\n\n    CDDF_H i=c/H_0∑_jA(N_H i)_j/N_H i ln10 Δ(log_10N_H i) V,\n\nwhere the sum runs over all galaxies in the (broad) sample. Typically, the approach to extract the CDDF from cosmological simulations is to project the full simulation box onto a 2D grid and measure the CDDF there. However, since we focus on the high-density end of the column density distribution which traces gas within galaxies, we find Eqn. <ref> more appropriate here.\n\nThe intrinsic CDDF generated from plain maps is shown in Figure <ref> (dashed red line). The beam smoothing effect on the mock maps is clearly visible in Figure <ref>, as the CDDF from the mock maps (solid red line) has the highest column density peaks smoothed out and moved to intermediate densities, thereby increasing the tension with the WHISP CDDF. In fact, the CDDFs generated from plain maps (especially from the lower-resolution TNG50-2 and TNG100 runs which are not shown in Figure <ref>) show a good agreement with the observational data, as found in previous studies of the CDDF. We have verified that the choice of the map resolution of the plain maps (128×128 by default) does not impact our CDDF result.\n\n\n\n  §.§.§ Other studies of the CDDF in cosmological simulations\n\n\nA few studies which analyzed CDDFs in cosmological simulations exist. Here, we compare our CDDF to their findings to provide some additional context for our results. \n\n<cit.> computed the CDDF for a set of cosmological simulations which explicitly track collisional ionization, radiation from hydrogen recombination and the UV background which sets the hydrogen ionization state. The CDDF itself is calculated by projecting the entire simulation box onto one side, contrary to our approach of summing up the column density distributions of individual galaxies. Molecular hydrogen formation is modelled with the empirical partitioning scheme of <cit.>. <cit.> find an excellent agreement at redshift zero between their CDDF (green line in Figure <ref>) and the WHISP measurement by <cit.>, as their CDDF at the low-column end is lower and hence more in line with observational data. This difference probably arises due to the usage of different cosmological simulations (for instance, the reference simulation of  has baryonic particle masses two orders of magnitude larger than TNG50). \n\nWith radiation from local stellar sources added in <cit.>, the CDDF sharply falls by 0.6 dex for N_H i>10^21 cm^-2 due to a larger ionized hydrogen fraction at large column densities (blue line in Figure <ref>). This leads to a significant underestimation of the CDDF at these high columns. H_2 formation is not considered in <cit.>, leading to the upturn of the CDDF at the highest column densities. We remark that the calculation of the neutral hydrogen fraction in IllustrisTNG is based on <cit.>, without the correction of local stellar sources. Since we base the calculation of the neutral hydrogen fraction in star-forming gas cells on the fraction of gas in the cold phase instead of the IllustrisTNG output, it is not directly clear how the inclusion of local ionizing sources would affect the CDDF.\n\nMore recently, <cit.> postprocessed the TNG100 simulation with the UV-independent partioning scheme of KMT09 and computed the CDDF in a similar fashion as <cit.>, i.e. by projecting the full simulation box onto one side with 20`000×20`000 points. A notable difference to our method is the usage of the cell size instead of the Jeans length for the calculation of surface densities which are used for the KMT09 partitioning scheme. We find that for star-forming gas cells, the cell sizes are smaller than the Jeans lengths by approximately one order of magnitude. This should significantly lower the molecular fractions for the gas cells. Furthermore, their calculation of the CDDF consists of modelling the gas cells as uniform density spheres, and computing the column density from the length of the line-of-sight segment intersecting the spheres.\n\nWe find that their CDDF (purple line in Figure <ref>) is lower than ours for all columns below ≈5×10^21 cm^-2. The discrepancy rises to almost one order of magnitude at N_H i≈10^21 cm^-2, and this result holds even when we apply the KMT09 partitioning scheme to the TNG100 simulation for our result. We attribute this discrepancy to the usage of uniform density spheres in <cit.> when calculating the CDDF. We find that for N_H i∼10^21 cm^-2, the radius of a gas cell (modelled as a sphere) does not exceed R_sphere=290 pc: R_sphere=(3M_cell/(4πρ_gas))^1/3, where M_cell≈1.4×10^6 M_⊙ is the mass of a TNG100 gas cell and ρ_gas its gas mass density. The column density in <cit.> is calculated according to N_H i=d_segmentρ_H i/m_H i, with d_segment being the segment through the spherically modelled gas cell. Since d_segment<2R_sphere and ρ_HI<ρ_gas, we have R_sphere<√(3M_cell/(2π m_H iN_H i))≈290 pc for the TNG100 gas cell mass and N_H i=10^21 cm^-2.\n\nFor the 20`000×20`000 grid used by <cit.> to calculate the CDDF, the different line-of-sights are separated by ≈5 kpc, which means it is very unlikely for the high-density gas to be picked up by the line-of-sights. Since we smooth the Voronoi gas cells when projecting them to a 2D grid we can more accurately take the high-density gas into account. We stress that for our approach for the TNG-intrinsic CDDF (using plain maps), the map resolution (with a default 128×128 grid for each galaxy) does not affect the CDDF. The discrepancy in the CDDF between our result and <cit.> diminishes at the highest column densities, which we attribute to an underestimate of molecular hydrogen formation in <cit.>. This effect increases the CDDF at the highest column densities and hence counters the effect of missing high-density gas cells in <cit.>.\n\n\nLastly, <cit.> examined the H_2 CDDF in TNG50/TNG100 and its dependency on simulation and map resolution. The H_2 fraction is taken from <cit.> with different partitioning schemes, and the CDDF is calculated by summing over the contributions from individual galaxies as in the present study. In line with our results, <cit.> find that the map resolution (changing from 150 pc to 1 kpc maps) hardly affects the CDDF. The simulation resolution (comparing TNG50 and TNG100) affects the H_2 CDDF in the very high column density regime (N_H_2>10^22 cm^-2), with more molecular hydrogen formed in TNG100. This contrasts to our finding in Figure <ref> where there is more in TNG100 for N_H i>5×10^21 cm^-2 compared to TNG50.\n\n\n\n§ CONCLUSIONS\n\n\nWe postprocessed the IllustrisTNG simulations at redshift zero, partitioning the neutral hydrogen content into its atomic and molecular fractions. We explored how the UV radiation from different stellar populations and the propagation of the UV field through the dusty interstellar medium affect the molecular fractions with the radiative transfer code SKIRT. We generated WHISP-like mock maps for IllustrisTNG galaxies and compared them to 21-cm data from the WHISP survey. To compare these resolved maps, we used non-parametric morphologies and the column density distribution function. Our main findings are summarized as follows:\n\n\n\n\n    \n  * Realistic UV fields taking dust attenuation into account can substantially affect the distribution for a subset of individual galaxies, but for statistical averages such as the H i/H_2 mass functions (Figure <ref>) and average radial profiles (Figure <ref>) the dust attenuation effect is negligible compared to the optically thin (Diemer) scheme.\n\n    \n  * If the UV radiation is not propagated at all (Lagos scheme), significant statistical differences compared to the SKIRT/Diemer schemes arise. For instance, the mass function is underestimated by 25 % at the high-mass end, while the H_2 mass function is overestimated by 25 % for M_H_2>3×10^8 M_⊙ (Figure <ref>). We remark that our default partitioning scheme (GD14) minimizes the differences between the various UV fields.\n\n    \n  * For the 30\"-resolution maps (which are most reliable), the non-parametric morphologies of maps of WHISP observational data and mock maps of TNG50 galaxies are in good agreement for the asymmetry, smoothness and Gini statistics (Figure <ref>). On the other hand, the TNG50 galaxies feature lower C and higher M_20 values (Figure <ref>). Visual inspection of the TNG50 maps reveals that a substantial amount of TNG50 galaxies exhibits large central holes, which are not seen in the WHISP data. The TNG50 galaxies with a very low concentration statistic are exclusively face-on, where the impact of the central hole on C is maximized.\n\n    \n  * We attribute the prevalence of central holes in TNG50 galaxies mostly to feedback from AGN, which ionizes and/or expels the neutral hydrogen gas from galaxy centers. Excluding galaxies that experienced feedback from the kinetic channel or above-average energy injection from the thermal channel reduces the tension in the C and M_20 statistics. Switching to the lower-resolution TNG100 simulation (the resolution at which the IllustrisTNG physical model is calibrated) also lowers the tension.\n\n    \n  * The column density distribution function (CDDF) of TNG50 differs from the one based on WHISP data. TNG50 contains more at intermediate column densities (N_H i≈10^20-20^21 cm^-2), but less high-column-density gas compared to WHISP (Figure <ref>). As the bulk of the abundance (Ω_H i) stems from intermediate column densities, TNG50 also has Ω_H i exceeding observational estimates based on blind surveys (e.g. ALFALFA). The lack of high-column in TNG50 (and IllustrisTNG in general) is due to the beam smoothing in the mock map creation, an effect that was neglected in previous studies of the CDDF in cosmological simulations (; ; ).\n\n    \n  * As the bulk of the gas resides in a sweet spot for observational detection according to TNG50 (both in terms of masses and column densities), we attribute the Ω_H i tension to an overabundance of atomic hydrogen in TNG50 (and not to an underestimation of the observational value). For the lower-resolution TNG100 simulation, the abundance agrees with the observed value, leading to a better match in the CDDF as well. This result is expected as a TNG50 galaxy will generally have higher stellar and gas masses compared to a TNG100 galaxy in a similar dark matter halo, due to the IllustrisTNG model being calibrated at the TNG100 resolution.\n\n    \n  * The mismatch in the CDDF at the high-column-density end can be remedied by using local partitioning schemes (based on number instead of column densities). Local partitioning schemes also increase the atomic fractions in galaxy centers, which increases the concentration statistic of TNG50 maps and reduces the tension with the WHISP morphologies. Hence, we hypothesize that the conventional column-based partitioning schemes fail at the highest column densities as the Jeans approximation could break down. The drawback of the local partitioning schemes is that they significantly overpredict the overall abundance of atomic hydrogen. Hence, albeit conceptually appealing, we refrain from using local partitioning schemes for the main results of this paper.\n\n\n     \n\n\n\n\nBased on the various partitioning schemes and UV fields explored in this study, we recommend to use the column-based (not the local) GD14 model for hydrogen partitioning in cosmological simulations. The GD14 model is an update of the GK11 model, contains a factor to take the cell size into account to mitigate resolution dependencies, and nicely couples conceptually to cosmological simulations as it is itself a simulation-calibrated partitioning scheme. Furthermore, it predicts the largest H_2 fractions of all partitioning schemes considered in this study (except for S14, but this partitioning scheme leads to the most significant tensions in the non-parametric morphologies and the CDDF comparing TNG50 and WHISP), such that it provides the best match to the observational value of Ω_H i.\n\nFor the UV fields, we recommend to always spread the UV flux, i.e. to use the Diemer or SKIRT schemes. The effect of dust attenuation is negligible for statistical properties of the galaxy population like the CDDF or the HIMF. However, the dust attenuation effect can be significant for individual galaxies and becomes more pronounced for molecular hydrogen properties. Studies that consider H_2 in smaller galaxy samples or zoom-simulations could obtain significantly biased results if not correcting for the effect of dust attenuation.\n\n\n\n\n§ ACKNOWLEDGMENTS\n\n\nWe wish to express our gratitude towards Ana Trčka who helped setting up the SKIRT analysis of the present study. We also wish to thank Benne Holwerda and Nick Gnedin for fruitful discussions about non-parametric morphologies and partitioning schemes, and are grateful for feedback from Annalisa Pillepich and Matthew Smith.\n\nAG gratefully acknowledges financial support from the Fund for Scientific Research Flanders (FWO-Vlaanderen, project FWO.3F0.2021.0030.01). DN acknowledges funding from the Deutsche Forschungsgemeinschaft (DFG) through an Emmy Noether Research Group (grant number NE 2441/1-1). This work has received funding from the European Research Council (ERC) under the European Union’s Horizon 2020 research and innovation programme (grant agreement No 882793 `MeerGas').\n\nThis study made extensive use of the  programming language, especially the  (),  (), and  () packages.\n\nThe WHISP observation were carried out with the Westerbork Synthesis Radio Telescope, which is operated by the Netherlands Foundation for Research in Astronomy (ASTRON) with financial support from the Netherlands Foundation for Scientific Research (NWO). The WHISP project was carried out at the Kapteyn Astronomical Institute by J. Kamphuis, D. Sijbring and Y. Tang under the supervision of T.S. van Albada, J.M. van der Hulst and R. Sancisi.\n\n\n\n§ DATA AND CODE AVAILABILITY\n\n\nThe IllustrisTNG data used in this work is publicly available at <https://www.tng-project.org/> as described by <cit.>. The WHISP moment-zero maps in all resolutions are publicly available at <http://wow.astron.nl/>. WISE fluxes for the WHISP galaxies are publicly available at <https://academic.oup.com/mnras/article/502/4/5711/6095720> (). Distances to WHISP galaxies are taken from the publicly available NED database (<https://ned.ipac.caltech.edu/>).\n\nThe SKIRT code (version 9) is publicly available at <https://skirt.ugent.be/root/_home.html> and described by <cit.>. The  code () is publicly available at its github repository (<https://github.com/vrodgom/statmorph>). The algorithm to spread the UV field in an optically thin fashion (Diemer UV field) as well as the projection algorithm is part of the private  repository of Benedikt Diemer. We are happy to share all other parts of the code and generated data of this work upon request.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nmnras\n\n\n\n\n\n\n\n\n\n\n§ IMPLEMENTATION OF PARTITIONING SCHEMES\n\n\n\n\n §.§ Krumholz, McKee & Tumlinson 2009 (KMT09)\n\n<cit.> (KMT09) consider an analytical model of molecular hydrogen formation and dissociation akin to S14. The model is equivalent to K13 except for the estimation of χ which quantifies the balance between UV photodissociation and recombination of H_2. While this parameter depends on U_MW in <cit.>, it is estimated from the metal mass fraction in the gas cell, Z (Eqn. 7 in  or Eqn.4 in ):\n\n\n    χ=3.1(1+3.1(Z/Z_⊙)^0.365/4.1).\n\nThe molecular hydrogen fraction as well as the s and τ_c parameter are identically calculated as in the K13 model described in appendix C.4 of <cit.> (their Eqns. 18, 19 and 26). We remark that this partitioning scheme is used to partition the hydrogen in the cosmological simulations MUFASA () and Simba (), but with a clumping factor of ≈10 and the Sobolev approximation when calculating τ_c (we use a clumping factor of five and the Jeans approximation following ).\n\n\n\n\n §.§ Gnedin & Kravtsov 2011 (local version)\n\n\nThis partitioning scheme is the local version (having number instead of column densities as input) of the GK11 scheme. We refer to appendix C2 of <cit.> for the description of the g parameter (their equations 11 and 12), and write only the new equations for this local, UV-dependent partitioning scheme:\n\n\n    f_mol=1/1+exp(-4x-3x^3),\n\n\n\n    x=Λ^3/7ln(D_MWn_H/Λ n_∗),\n\nwhere n_H is the total hydrogen number density in protons per cm^3, n_∗=25 cm^-3, and Λ is\n\n\n    Λ=ln(1+gD_MW^3/7(U_MW/15)^4/7).\n\nNote that f_mol in this formalism technically corresponds to the mass fraction in molecular hydrogen compared to total hydrogen, while we use f_mol for the mass fraction in H_2 compared to neutral hydrogen. We use the two quantities interchangeably as under all conditions of interest, the ionized hydrogen fraction is negligible when molecular hydrogen forms.\n\n\n\n\n §.§ Gnedin & Draine 2014 (local version)\n\n\nEquivalently, this is the local version of the GD14 partitioning scheme. As this varies quite substantially from their partitioning scheme based on surface densities presented in appendix C3 of <cit.> we note the full set of equations here:\n\n\n    f_mol=1/1+exp(-x(1-0.02x+0.001x^2)),\n\n\n\n    x=wln(n_H/n_1/2),\n\nwhere n_1/2 is the hydrogen number density at which f_mol=0.5.\n\n\n    n_1/2=n_∗Λ/g,\n\n\n\n    w=0.8+Λ^1/2/S^1/3,\n\n\n\n    Λ=ln(1+(0.05/g+U_MW)^2/3g^1/3/U_∗),\n\n\n\n    n_∗=14 cm^-3D_∗^1/2/S,\n\n\n\n    U_∗=9D_∗/S,\n\n\n\n    D_∗=0.172+S^5/1+S^5,\n\nand S=L_cell/100 pc is a factor to correct for the spatial resolution of the simulation. Following <cit.> we approximate L_cell=(m/ρ)^1/3 for each gas cell. We remark that <cit.> calibrated this resolution correction up to cell sizes of 500 pc, which should be sufficient to reach the TNG50 cell sizes at which molecular hydrogen formation becomes important.\n\n\n\n\n\n§ PROJECTED MODELLING\n\n\n\n\nA troublesome aspect of hydrogen partitioning in cosmological simulations is the usage of surface (or column) densities in partitioning schemes, which are difficult and somewhat ambiguous to extract from the simulations. The approach adopted here and in most other studies is to calculate surface densities of gas cells with the Jeans approximation (`volumetric modelling', Eqn. <ref>). <cit.> find that the Jeans approximation introduces significant biases in the estimated surface densities. A possible resolution to overcome this issue is the usage of local partitioning schemes as discussed in Section <ref>. Another alternative suggested by <cit.> is to estimate surface densities by rotating galaxies into a face-on position, projecting the gas cells on a 2D grid to compute surface densities, and performing the hydrogen partitioning directly on this 2D grid (`projected modelling').\n\nFor the analytical and simulation-calibrated partitioning schemes considered here, <cit.> find that the volumetric and projected approaches lead to similar results on average for the entire galaxy population, but with large scatter for individual galaxies (see their figure 4). It is not obvious which approach should be preferred, as surface densities have different meanings across the various partitioning schemes. For instance, S14 consider an idealized interstellar gas cloud as a 1D slab, while GK11 consider columns calculated from lower-resolution gas cells with a size of ≈500 pc corresponding to the average thickness of galactic disks in their simulations.\n\nAn advantage of projected modelling is that it is significantly faster than volumetric modelling. For our purposes, however, an important shortcoming of the projected approach is that one can only generate maps in face-on projection. While this is fine to calculate masses and radial profiles, for the mock maps that we compare to the WHISP survey (which contains galaxies in random orientation) we cannot use the projected approach there.\n\nWe test here if the finding of <cit.> that the volumetric and projected approaches agree on average (for each partitioning scheme) extends to the SKIRT and Lagos UV fields. To this end we calculate and H_2 masses both in the volumetric and projected incarnation with our default partitioning scheme for the base TNG50 sample. For the projected modelling we generate the face-on maps of all quantities required for the hydrogen partitioning using the plain map algorithm (Section <ref>).\n\nFigure <ref> shows the deviation in galaxy H i/H_2 mass from the default model (volumetric modelling with the SKIRT UV field) when changing the UV field and/or switching to projected modelling. The lines indicate the running medians, the hatched areas correspond to the interquartile range. Unsurprisingly, the Lagos models deviate most from the default model, furthermore they also feature the largest difference between the volumetric and projected version (solid and dashed orange lines). For intermediate H_2 masses of ∼10^9 M_⊙, projected modelling leads to H_2 masses lower by a factor of two compared to volumetric modelling (with the Lagos UV field). \n\nFor the SKIRT and Diemer UV fields the discrepancies between the volumetric and projected models are mostly not significant as the interquartile ranges overlap. For our estimate of Ω_H i with the default model (volumetric SKIRT model), switching to the projected SKIRT model would slightly increase the abundance in IllustrisTNG by ≈5 %. Hence, this systematic uncertainty arising from volumetric/projected modelling does not affect the conclusions from Section <ref>. We note that the default model seems to underestimate the largest masses by ∼20 % compared to all other five models. Furthermore, we remark that although the mass functions between the different UV field estimates are mostly consistent (Figure <ref>), individual galactic H i/H_2 masses can differ a lot between different models, especially when comparing the Lagos UV field with the SKIRT/Diemer UV fields. \n\n\n\n\n\n\n\n\n\n\n"}