{"entry_id": "http://arxiv.org/abs/2303.07234v1", "published": "20230313160646", "title": "Multi-objective analysis of the Sand Hypoplasticity model calibration", "authors": ["Francisco J. Mendez", "Miguel A. Mendez", "Nicola Sciarra", "Antonio Pasculli"], "primary_category": "cond-mat.soft", "categories": ["cond-mat.soft"], "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMulti-objective analysis of the Sand Hypoplasticity model calibration\n    Francisco J. Mendez^1,*,  Miguel A. Mendez^2,   Nicola Sciarra^1 , Antonio Pasculli^1\n\n^1University G. D'Annunzio, Dept. of Engineering Geology (INGEO), Chieti-Pescara, Italy;\n ^2 von Karman Institute for Fluid Dynamics, EA Department, Sint-Genesius-Rode, Belgium\n\n^*Corresponding to: francisco.mendez@unich.it\n    March 30, 2023\n==========================================================================================================================================================================================================================================================================================================================\n\nempty\n\n\nThe Sand Hypoplastic (SH) constitutive law by von Wolffersdorff (1996) is a interesting hypoplastic model for soil mechanics. This model includes eight parameters, usually calibrated using the oedometric (OE) and the drained isotropically consolidated triaxial tests (CD). However, previous studies show that the SH model calibration in the CD test has conflicting requirements in predicting the evolution of stresses and strains.\n\nIn this work, we study the SH model calibration over a wide range of testing conditions using 12 OE and 25 CD tests by Wichtmann and Triantafyllidis (2016) on the Karlsruhe sands. The parameter space is extensively explored via Genetic Algorithm Optimization (GA) using the recently developed open-source software GA-cal (available at <https://github.com/FraJoMen/GA-cal>). This exploration allowed us to study the SH model's predictive limits and to identify, using a multi-objective analysis, the main parameters governing the compromise between the accurate prediction of stresses versus strain in the CD tests.\n\n \n\nKeywords  Automatic calibration, Hypoplasticity, Numerical optimization, Genetic Algorithm, Nonlinear Regression\n\n\n\n\n\n§ INTRODUCTION\n\nBased on the first Hypoplastic constitutive law <cit.>, several models have been developed to describe the stress-strain behaviour of clay <cit.> and sand <cit.>, with extensions available for cyclic loads  <cit.>. Arguably one of the most famous hypoplastic model is the one proposed by von Wolffersdorff <cit.>, often referred to as Sand Hypoplasticity (SH). This model has been successfully applied to a wide variety of problems in geotechnical engineering <cit.>,  despite its limitations <cit.>.\n\n\n\nThe SH model requires eight parameters. These are traditionally calibrated from geotechnical laboratory tests, as firstly proposed in <cit.>. The early approaches for the SH model calibration, however, relied on a large number of laboratory tests and estimates of the tangents to the response curves. Unfortunately, such estimates are usually impossible in some tests (e.g. in the oedometric curves) because of the coarse time-stepping, and are particularly sensitive to measurement noise in others (e.g. in the triaxial tests). \nMoreover, the formulas used to compute the model parameters are extremely sensitive to the input data, resulting in considerable uncertainties in the estimated parameters and the need for non-trivial manual adjustments to improve the model predictions.\n\nTo reduce the manual adjustments in the SH calibration, a more robust approach has been proposed in <cit.> and made available in the free software ExCalibre (<www.soilmodels.com/excalibre>). This approach solely relies on experimental data from the oedometric (OE) and drained isotropically consolidated triaxial tests (CD) tests and uses a combination of empirical relations and optimization. Interestingly, this approach ignores the SH model predictions of the volumetric strain and uses the OE data to calibrate some of the parameters and the CD data to calibrate others. This is a convenient but restrictive simplification because all parameters play a role in determining the soil response in both tests.\n\nMore general methods formulating the calibration of constitutive laws as a regression problem were proposed in <cit.>. The regression solution involves an optimization, for which both deterministic and stochastic approaches have been proposed, as reviewed in <cit.> and <cit.>. \n\nStochastic Optimisers (SO) are notoriously less sample efficient than deterministic ones (see <cit.>) but allow for better exploring the parameter space without being trapped in local minima. These optimisers are based on the generation of pseudorandom numbers commonly used by the  Monte Carlo method, which has also been applied in different fields in <cit.>. The most popular SO used in the parameter calibration of a constitutive model are the genetic algorithm (GA) <cit.>, the differential evolution  <cit.>, and particle swarm optimisation <cit.>. The authors recently proposed the first calibration of SH using GA in <cit.>. In this work, the GA was proven able to provide a good calibration and was also employed to quantify the model prediction's sensitivity, the model parameters' uncertainty and the potential correlations between them.\n\n\nThe availability of powerful optimization techniques and ever-increasing experimental datasets allows for exploring and stretching the SH model's predictive capabilities. To the author's knowledge, a practical problem that has yet to be addressed in the open literature is the extent to which the SH model can perform well in both OE and CD tests (thus, the calibration is possible) for different types of sands. While the SH model in the first calibration on the Hochstetten's sand by von Wolffersdorff <cit.> performed satisfactorily in all tests, many authors have reported on the limits of this model in predicting the volumetric deformations in the CD tests for other sands <cit.>. In this work, we study these limits and the conflicting requirements on the model parameter to predict stresses and strain in the CD test.\n\n\nBuilding upon an extensive exploration of the parameter space via GA, this work aims to investigate the SH model capabilities to describe the 12 OE and 25 CD tests[The data set is downloadable from the website <www.torsten-wichtmann.de/>] on the Karlsruhe sands published in <cit.>. Moreover, with the adaptive weighted sum approach to multiobjective optimization <cit.>, we analyze the relationship between the SH model parameters and the model performances in the CD tests. The analysis was carried out using the software GA-cal, an open-source software recently released by the authors <cit.> for solving the inverse problem of calibrating a constitutive law. The source code of GA-cal, a Fortran revisited version of the algorithms initially developed in Python <cit.>, is freely available at <https://github.com/FraJoMen/GA-cal>.\n\nThe article is organized as follows. Section 2 recalls the calibration problem, while Section 3 describes the dataset and the preprocessing. Section 4 presents the calibration results and Section 5 collects the conclusions. \n\n\n\n\n§ THE SH CALIBRATION PROBLEM\n\n\nThe SH model proposed by <cit.> links the time derivative of the Cauchy effective stress 𝐓̇ and the void ratio ė, with the granulate stretching rate 𝐃 and the state variable e and 𝐓.\nThis link depends on eight parameters; hence the SH model in the OE and CD test case can be written as a system of parametric nonlinear Ordinary Differential Equations (ODEs) as \n\n\n    𝐗̇=𝐇(𝐗; 𝐏) ; 𝐗(0)=𝐗_0 ,\n where 𝐗=[𝐓;e] is the state vector and 𝐏 is the set of parameters:\n\n\n    𝐏={e_c0 ,  e_d0 ,  e_i0 ,  h_s ,  φ_c ,  n ,  α ,  β} .\n The reader is referred to appendix <ref> for more details on this model.  \n\nFor the scopes of this work, it suffices to recall that the model calibration consists in identifying the parameters 𝐏 that make the trajectory of the system 𝐗(t) match with a set of experimental data 𝐗(t_k) available on a discrete set of times k=1,… n_t.\n\nThe experimental results are given in the plane (σ_v, e) for the OE test, with σ_v the effective vertical pressure, and in the triaxial deviatoric (ε_a, q) and triaxial volumetric  (ε_a, ε_v) planes for the CD test, with q the deviatoric stress, and ε_a and ε_v the volumetric and the axial deformations. \n\n\nFollowing the approach proposed in <cit.>, the calibration aims to find the parameters that minimise a cost function. This cost function C(𝐏) measures the discrepancy between model prediction and available data. As in <cit.>, we define it as:\n\n\n    C(𝐏)=w_1δ_1(𝐏)+w_2δ_2(𝐏)+w_3δ_3(𝐏) ,\n where w_i weights the discrepancy in each plane on the model performance evaluation (σ_v, e), (ε_a, q) and (ε_a, ε_v). The δ_i, with i=1,2,3 functions in the (<ref>) are the average Fréchet distances between data and predictions, measured in appropriate dimensionless plans (see <cit.>). \n\nThe weight in the (<ref>) can be used to prioritise the model performance on one plane or the other. In this work, we use these values to study the feasibility of identifying a set performing well on all planes and to reveal contrasting requirements.\n\nUsing the GA-cal code, we minimise (<ref>) and explore the parameter space (i.e. the set of possible parameters) with Genetic Algorithm (GA) optimisation.\n\n\n\n\n§ DATASET\n\n\nThe selected experimental data were collected on the Karlsruhe fine sand. This sand is characterised by the subangular shape of most grains and no fines content, a mean grain size d_50 = 0.14 mm and a uniformity coefficient C_u = d_60/d_10 = 1.5  <cit.>.  \n\nThe initial conditions for the OE tests are reported in Table <ref>, while the initial conditions for the CD tests are reported in Table <ref>. These tables also report the initial relative densities of the samples I_D0.\n\n\n    I_D0 = e_max - e_0/e_max- e_min .\n The minimum and maximum void ratios e_min = 0.677 and e_max = 1.054 were determined from standard tests at mean pressure p = 0 <cit.>. \n\n\n\n\n\n\n §.§ Pre-processing and Test Grouping\n\n\nTo speed up the cost function evaluation (and hence allow for better exploration of the parameter space), the calibration is not carried out on the full data set. Instead, a sub-sampling was carried out by interpolating the available data. 10 points were uniformly distributed between 10 and 400 kPa for the OE test, while 15 points were uniformly distributed between points between ε_a = 0.01 % and max(ε_a). \n\nThe significant sub-sampling drastically reduced the computational time with a negligible loss in accuracy, given the model predictions' smoothness.\n\nTo analyse the robustness of the model calibration, the large number of experimental tests were divided into six groups characterised by different initial relative densities I_D0. Among the initial conditions identifying each test, the initial void ratio was found to be the one that most influenced the model calibration. The different groups, labelled G1, G2,..., G6 are listed in Table <ref>. These also differ in the number of tests.\n\n\n\n\n\nAll input files, output files and the Python scripts for post-processing used in this work are made available in the folder Example in the GA-cal repository <https://github.com/FraJoMen/GA-cal>. \n\n\n\n\n§ RESULTS\n\n\nThis section is divided into two parts. In the first (Sec. <ref>), we analyse the GA calibrations on the previously defined groups to study the range of validity of each calibration and its sensitivity to the available data. In the second part (Sec. <ref>), we report on the Pareto front analysis to identify which parameters mostly influence the model performances in the different tests.\n\n\n\n\n §.§ The variability of SH model calibration \n\n\nFor each of the six groups of calibration data sets in Table <ref>, we consider four sets of weights (w_1,w_2,w_3) (see equation (<ref>)). These are (1,1,1),(1,0,0),(0,1,0),(0,0,1); that is, the first gives equal importance to all planes, the second only focuses on the (σ_e,e) plane, the third on the (ε_a,q) plane, etc.\n\nTable <ref> reports a set of 24 possible combinations of parameters obtained via GA (labelled as C02, C03, etc) together with the parameters indicated by Wichtman and Triantafyllidis (WT) <cit.> (labelled as C01) for reference. For each combination, the table reports the weights used in the cost function and the data group used in the calibration. Moreover, the last column collects the fitness score in (<ref>), weighted by the number of tests n_i in the group used for the calibration and the sum of weights:\n\n\n    η= C(𝐏)/∑^3_j=1 w_j  n_i\n This normalization enables a fair comparison between parameters that have been evaluated in a different number of planes. \n\n\nThe values of η show that the parameters derived by the GA calibration on all the data (combination C02-C07) outperform the parameter sets by Wichtman and Triantafyllidis (C01) according to the metrics in (<ref>). The error significantly reduces when the calibration focuses on one of the planes. Moreover, the test in group G2 apparently yields the largest error in the (ε_a, ε_v) plane.\n\n\n\n\n\nAll these sets of parameters lead to comparable cost functions and can thus be considered `optimal' candidates if evaluated in the data used for their derivation. However, as we shall see shortly, their fitness decreases significantly when evaluated on different data. \nMoreover, some parameters are more variable than others. This is further illustrated in Table <ref>, which shows the average value for each parameter, theirs standard deviation to mean ratio, and theirs minimum and maximum value. It is thus clear that the parameter h_s, α, β vary significantly among the various calibration, contrary to e_i0, e_d0, e_c0.\n\n\n\n\nTo evaluate the accuracy of each set of parameters, we now consider the mean deviation in the abscissa of each plane (σ_v, e), (ε_a, q) and (ε_a, ε_v), normalised by the corresponding maximum variation in the experimental data from each test. That is, given \n\n\n    ξ_i=|Y_num-Y_dat|/max(Y_dat)-min(Y_dat) · 100 ,\n with Y_num the SH model prediction and Y_dat the experimentally measured ones, in each plane, we define the global deviation as \n\n\n    ξ=𝔼(ξ_i),\n where, 𝔼 is the expectation operator. \n\nAlthough this fitness measurement is less suited than the Fréchet distance for calibration purposes because it evaluates the model errors only in one of the axes in each plane, it allows for a more intuitive evaluation of the model performances in relation to the data variability. Indicatively,  ξ≤ 20 % is acceptable for the CD test and ξ≤ 30 % for the OE test.\n\n\n\n\n\nThe SH model performances using all the sets in Table <ref> is illustrated in detail in Figure <ref>. The x axis provides the ID of each test and the plane in which the deviation ξ is measured. The first 12 IDs are given to the OE tests, evaluated in the (σ_v,   e) plane. The IDs from 12 to 37 are given to the CD tests evaluation in the (ε_a , q) plane, while the last IDs, from 37 to 62, are given to the CD tests evaluated in the plane (ε_a, ε_v).  \n\nFor each test, the upper portion of the graph indicates the minimum and the maximum deviation together with the associated parameter combination. The bottom portion of the graph shows the envelope of performances for all combinations, together with some illustrative cases. No combination reaches the minimal error in all planes. For the OE tests, ξ varies from 3.0 to 189.6 %, for the CD it varies from 3.1 to 181.1 %, in the (ε_a ,   q) plane and from 1.6 to 210.9 %, in the (ε_a ,  ε_v) plane. \n\nFor example, the combination C12 provides excellent results in the CD in the (σ_v,  e), with ξ∈ [4,30.7]%  and mean 14.5%, but fails in both (ε_a,  q) and (ε_a, ε_v) planes. Not surprisingly, the GA obtained this combination when the weights were set to (1,0,0). The trends for the combinations C03 and C20 are also shown using green and red lines in Figure <ref>. The combination C20 performs well in the plane (ε_a,  ε_v) with an ξ∈ [3.7,17.7%] and mean 7.9%, while the combination C03 perform well in the plane (ε_a ,  q) and ξ∈ [3.9,21.0%] and mean 8.5%. While this is in line with the choice of weights for C20 and C12, the combination C03 gave equal weights to all planes, thus showing that the amount and the kind of data used for the training play an important role. Figure <ref> provides a qualitative overview of the good agreement between the experimental data and the numerical prediction with the combinations C12, C03 and C20. \n\nAs shown in Figure <ref>, some experiments (CD11, CD12, CD13) can be well described with a single set of parameters (C05). We have ξ∈[2.5,23.4]%, with a mean of 9.1 %, for these tests.\n\n\n\n\n\nFigure <ref> also shows the average percentage deviation for the SH using the model parameters by Wichtman and Triantafyllidis (WT) <cit.> (combination C01) and for the combination C02, which was derived using all the dataset and giving all planes equal importance. Both C01 and C02 perform worst than the optimal combinations in each test, and the comparison shows that C01 favours the model accuracy in the planes (σ_v,  e) and (ε_a,q) over the ones in the plane (ε_a,  ε_v).\n\nTo further illustrate the performances of the different combinations, Figures <ref> and <ref> plot the experimental data \ntogether with the model predictions using the best combination on that specific set (black dashed lines) and the predictions using the parameters by Wichtman and Triantafyllidis (C01, with the blue dotted line). While all the identified optimal combinations outperform C01, the improvement comes at the cost of considering a different set of parameters for each test.\n\nThe relative importance of model accuracy in these planes depends significantly on the application. For example, in the slope stability analysis, one is more interested in the accurate modelling of the soil response in the plane (ε_a,q), and the combination C03 could suit that purpose. On the other hand, in the settlement prediction of a shallow foundation, one is primarily interested in the soil response in the plane (ε_a, ε_v), and hence combination C06 could be more appropriate.\n\nIn problems such as soil-structure interaction, where the behaviour in all planes are equally relevant, one must accept a compromise (see combination C02) and use a set of coefficients that is sub-optimal in each plane taken separately. The main conclusion in this analysis is that the model calibration in these three planes yields contrasting objectives that bring the SH model to its limits. We search for the parameters driving the compromise in the following section.\n\n\n\n\n\n §.§ The Pareto Front\n \nThe analysis of the combination C01 and C02, aimed at modelling the soil response in all planes, shows that the main discrepancies occurs in the planes (ε_a,q) and (ε_a,ε_v), in that the success in one of them yields failure in the other. \n\n\n\n\nIn this section, we further analyse the performances in these two planes and identify which parameters are mostly involved in the conflicting requirements. Specifically, we treat the calibration as a multi-objective optimisation which seeks to minimise the average Fréchet distances in these two planes, i.e. δ_2 and δ_3 in (<ref>). We then search for the optimal trade-offs between the two objectives, i.e. the Pareto front <cit.> for the problem. At the Pareto front, improvements in one plane cannot be attained without worsening in the other. \n\nThe search for the Pareto front was conducted using the weighted sum method <cit.>. This approach consists in performing a large set of single objective optimisations (in this case, 400) using weights defined as \n\n\n    (1,  w_p,  1)   and   (1,  1,  w_p)\n where w_p is a vector of linearly spaced values from 0 to 10 with 200 elements. For each calibration, we monitor the values of δ_2 and δ_3, averaged over the 25 tests in Table <ref>. The results are plotted in Figure <ref>, with markers coloured by two of the eight parameters in the optimal set obtained by the calibration: α and φ_c.\n\nThe Pareto front is qualitatively identified. Furthermore, the marker face colour allows us to reveal whether any of these parameters changes monotonically from one extreme of the front to the other, and is thus potentially correlated with the degradation of performances in one plane (and the consequent improvement in the other). \n\n\n\n\nThe parameter α was included because this is often considered to be the main responsible for the poor performances in the (ε_v, q) plane and is usually calibrated to reproduce the peak stress rather than the volumetric deformation <cit.>. However, the plot in Figure <ref> display no clear trend along the Pareto front and thus does not support this common belief. Similar observations holds for the other parameters h_s, n, β, e_i0, e_c0 and e_d0, which are thus not shown.\n\nOn the other hand, φ_c increases when moving from low δ_2 (high δ_3) to high δ_3 (low δ_2). Relatively low values of φ_c, in the range of 32-35 degrees, produce good predictions of the stress (low values of δ_2) but poor predictions in the strain (large values of δ_3). The opposite is true at the largest values of φ_c, in 36-39 degrees range. \n\n\nWu et al. <cit.> have shown that the SH model oversimplifies the constitutive law in <cit.> and yields an unrealistic relation between the initial Poisson ratio ν_i and the friction angle at critical state φ_c. We here further explore (and corroborate) the reasons for Wu et al. <cit.>'s concerns. Figure <ref> plots the initial Poisson ratio ν_i, computed a posteriori from the calibrated curves, and the GA calibrated critical state φ_c for the 400 choices of weights that lead to the Pareto front identification. The different initial conditions (see Table <ref>) are made visible using different markers for the initial mean pressure p_0 and a colour scale for the void ratios e_0. The analysis confirms Wu et al. <cit.>'s observation on the link between ν_i and φ_c and complements it with the critical role of the initial conditions: the mean pressure p_0 becomes particularly important for low values of void ratios.\n\nMoreover, the analysis confirms that the SH model yields nonphysical negative values for ν_i at large values of φ_c, while the parameter α appears entirely uncorrelated from ν_i. The range 36-39 degrees for φ_c is the one that yields the best model predictions in the (ε_a,ε_v) plane. \nTherefore, the nonphysical values of ν_i appear to be necessary for the SH model to overcome its underlying simplification, trading the accuracy in the prediction of the initial (contractile) phases with the accurate prediction of the expansion at the largest values of ε_v.\n\n\n\n\n\n\n\n\n\n\n\n§ CONCLUSIONS\n\n\nWe studied the calibration of the SH constitutive law <cit.> in the 12 OE, and 25 CD tests on the Karlsruhe sands Wichtman and Triantafyllidis <cit.>. The parameter space was extensively explored using GA <cit.>, by setting the calibration problem in the optimisation framework proposed in <cit.>. In this framework, the calibration involves identifying the model parameter set that optimises a global performance measure. This is a weight-ed average of model performances in the (σ_v, e), (ε_a, q) and (ε_a, ε_v) planes so that acting on the set of weights it is possible to prioritise accuracy on one plane over the others and study how the model parameters control the model performances. \n\nThe available data were divided into six groups. In each of these, the model was calibrated using four combinations of weights to obtain twenty-four sets of optimal parameters. \nThe analysis of the average relative deviation for each combination across the full dataset confirms that the SH model can be made sufficiently versatile to interpret all the tests, but only if a different set of parameters is used for each. \n Moreover, a calibration that gives equal weight to all planes provides parameters that perform significantly worse than those obtained when the focus is narrowed to two or even one of the planes. This confirms the need for a compromise in the calibration, particularly in the prediction accuracy for stresses and deformations in the CD tests.\n\nWe analysed the conflicting objectives in this compromise using a Pareto front analysis and identified the parameters primarily responsible for it. Contrary to the common belief that this compromise is ruled by the parameter α <cit.>, it was found that the trade-off in prediction accuracy for stresses and deformations in the CD tests is primarily due to the parameter φ_c. \n\nAs previously highlighted by Wu et al. <cit.>, this parameter is tightly linked to the initial Poisson ratio ν_i, which becomes unrealistically close to zero and eventually negative at the large values of φ_c required to obtain good prediction in the (ε_a, ε_v) plane. Furthermore, it was shown that the initial conditions strongly influence the relation between φ_c and ν_i, and negative values of ν_i are obtained for smaller φ_c in the samples with the highest void ratio e_0.\n\nIn conclusion, we have shown that the SH model can be used to predict the soil response in the (σ_v, e), (ε_a, q) and (ε_a, ε_v) planes if the focus is placed on each of these separately. Therefore, the SH model provides enough flexibility to study geotechnical problems such as slope stability or settlement prediction of a shallow foundation, which do not demand high accuracy in all planes simultaneously. However, the model performances are inherently limited for problems challenging it in all planes, such as soil structure interaction. The inevitable compromises needed in the calibration have been tightly linked to the parameter φ_c and thus to ν_i. \n\n\n\n\n\n\n\n\n§ CONFLICT OF INTEREST\n\nThe authors declare no conflict of interest.\n\n\n\n§ THE SH MODEL\n\nIn the formulation of SH by von Wolffersdorff <cit.>, the objective Zaremba-Jaumann <cit.> stress tensor  ∘𝐓 is:\n\n\n    ∘𝐓 = f_e f_b/(𝐓̂^2)( F^2 𝐃 + a^2(𝐓̂·𝐃)𝐓̂  +  f_d a F (𝐓̂+𝐓̂^*)‖𝐃‖)\n where   ‖ ‖ is the tensor norm ‖ A ‖=√((AA^T)), 𝐓̂^*= 𝐓̂-1/3 𝐈, with  𝐈 the  identity tensor and 𝐓̂=𝐓/(𝐓). \n\n\n\n\n    a\t\t\t\t=√(3)(3-sinφ_c)/2√(2)sinφ_c \n       F\t\t\t\t=√(1/8tan^2ψ+2-tan^2ψ/2+√(2)tanψcos 3θ)-tanψ/2√(2) ,\n where: \n\n    tanψ\t\t=√(3)‖𝐓̂^*‖\n       cos 3θ\t=-√(6) (𝐓̂^*3 )/[ (𝐓̂^*2)]^3/2  .\n The barotropy coefficients f_b and f_e are:\n\n\n    f_b=(e_i0/e_c0)^β h_sn1+e_i/e_i(-(𝐓)h_s)^1-n3+a^2-a √(3) ( e_i0-e_d0e_c0-e_d0)^α , \n       f_e\t\t\t\t=(e_c/e)^β .\n The pyknotropy coefficient f_d is defined as \n\n\n    f_d=(e-e_d/e_c-e_d)^α .\n The maximal (e_d), minimal (e_i) and critical (e_c)  void  ratio are linked by  the system:\n \n\n    e_i/e_i0=e_d/e_d0=e_c/e_c0=exp[-(-(𝐓)/h_s)^n] .\n The materials parameters 𝐏={e_c0 ,  e_d0 ,  e_i0 ,  h_s ,  ϕ ,  n ,  α ,  β} are:\n\n\n\n  * e_c0,  e_d0  e_i0. These are, respectively, the critical the minimal and the maximal void ratios, obtained when p_s=(𝐓)=0 in (<ref>). \n\n \n  * h_s is called granular hardness, and Its increasing increases stiffness and dilatancy.\n\n\n  * φ_c is the critical friction angle at the critical state.\n\n\n  * n is a parameter influencing the barotropy of the soil, influencing the stiffness, peak resistance and dilatancy. \n\n\n  * α is the exponent in the calculation of the pyknotropy  coefficient f_d and controls the dependency of peak friction angle on relative density. \n\n \n\n  * β is  a  coefficient influencing barotropy and  pyknotropy. Increasing β   produces  an increase of the stiffness of material and in particular the shear stiffness.\n\n\n\nThe reader is referred to <cit.> for more details on these parameters, and to  <cit.> for more details on the model formulation and the relevant simplifications related to the OD and CD tests. \n\n\n\n\n\n §.§ Acknowledgements\n\nThe authors gratefully acknowledge the support and the discussions with the engineer Pierantonio Cascioli, from GEINA srl, and Gabriele Sandro Toro, laboratory technician of the Department of Engineering and Geology of the Faculty Gabriele D'Annunzio of Chieti. \n\n\nieee_fullname\n\n\n\n\n\n\n"}