{"entry_id": "http://arxiv.org/abs/2303.07231v1", "published": "20230313160417", "title": "Closed-form propagator of the Calogero model", "authors": ["Valdemar Melin", "Edwin Langmann"], "primary_category": "quant-ph", "categories": ["quant-ph", "math-ph", "math.MP", "nlin.SI", "81Q80 (Primary) 81Q05, 33C50, 35K08 (Secondary)"], "text": "\n\n\n\n\n\n\nDepartment of Physics, KTH Royal Institute of Technology, SE-106 91 Stockholm, Sweden\n\nNordita, KTH Royal Institute of Technology and Stockholm University, SE-106 91 Stockholm, Sweden\n\n \n\n \nWe present an exact closed-form expression for the propagator of the Calogero model, i.e., for the integral kernel of the time evolution operator of the quantum many-body system on the real line with an external harmonic potential and inverse-square two-body interactions. \nThis expression is obtained by combining two results: first, a simple formula relating this propagator to the eigenfunctions of the Calogero model without harmonic potential and second, a formula for these  eigenfunctions as finite sums of products of polynomial two-body functions. \n\nClosed-form propagator of the Calogero model\n    Edwin Langmann\n    March 12, 2023\n============================================\n\n\n\nIntroduction. \nIntegrable systems have always played an important role in physics, with historic examples including the Kepler problem and the quantum mechanical model of hydrogen.\nToday, quantum many-body systems of Calogero-Moser-Sutherland (CMS) type <cit.>  \nhave become prime  integrable models due to their  successful applications in many different  areas of physics,  including (quantum) hydrodynamics, gauge theories, solitons, fractional quantum Hall effect, conformal field theory, and non-equilibrium physics; see e.g.    <cit.>. \nFurthermore, the intriguing mathematics behind  these models has received attention by mathematical physicists and mathematicians with specializations as diverse as representation theory, differential geometry, combinators, and the modern theory of special functions; see e.g. <cit.>. \nHowever, despite of all this work, we are still far from knowing all quantities of interest in physics for CMS-type models analytically. \nOne important such example is the propagator, i.e., the integral kernel of the time evolution operator in position representation. \n\nNumerical solutions of the time-dependent Schrödinger equation are typically restricted to small particle numbers and, for this reason, exact propagators are of interest to the large community of physicists trying to understand the dynamics of real quantum systems. \nUnfortunately, as for today, few examples of exact propagators are known in closed form; these examples include the heat kernel for the non-interacting case, the Mehler kernel for the quantum harmonic oscillators, and  and the Hille-Hardy formula for the propagator of the singular harmonic oscillator; see e.g. <cit.>. \nIn this paper, we present exact analytic formulas for the propagator of the quantum many-body system studied by Calogero in his seminal paper <cit.>; see (<ref>)–(<ref>) for one way to write our result in closed form. \nSince the Calogero model is a prototype for interacting systems in one dimension, we believe that our results are of general interest in physics. \nFurthermore, our exact results for the Calogero model suggest a new kind of ansatz to find approximate wave functions for generic quantum many-body systems taking into account non-trivial correlations (this is discussed in our conclusions). \nWe also  hope that our results can inspire future work finding exact propagators for other CMS-type quantum systems. \n\n\n\nCalogero model. \nThe Calogero model is a many-body generalization of the quantum harmonic oscillator to an arbitrary number, N, of particles with inverse-square two-body interactions; it  is defined by the quantum mechanical Hamiltonian (i<j is short for 1≤ i<j≤ N) \n\n    H = ∑_i=1^N1/2( -∂^2/∂ x_i^2 + ^2x_i^2 ) + ∑_i<jℓ(ℓ+1)/(x_i-x_j)^2\n \nwhere x_i∈ are the particle positions, and ≥ 0 and ℓ≥ -1/2 are parameters determining the strength of the harmonic potential and two-body interactions, respectively (we use units such that m=ħ=1). \n\n\nWe recall that the eigenfunctions of  H of interest in physics have the form\n\n    Ψ(x) =^- x^2/2_N(x)^ℓ+1P(x)\n \nwith P(x) \nsymmetric and analytic functions in the variables x=(x_1,…,x_N)∈^N, x^2 short for ∑_i=1^Nx_i^2,  and  _N(x)∏_i<j(x_i-x_j) the Vandermonde. \nIn particular, since the Vandermonde changes sign under particle exchanges x_1↔ x_2 etc., the Calogero models describes fermions and bosons for even and odd integers ℓ, respectively; for this reason, we restrict ourselves to integer ℓ≥ 0.\nFor >0, the  functions P(x) are symmetric polynomials which are natural many-variable generalizations of the Hermite polynomials <cit.>; in this case, the Calogero model has discrete energy eigenvalues. \nThe case =0 is special in that the Calogero Hamiltonian has continuous spectrum and the eigenfunctions are generalizations of (anti-)symmetrized plane waves; as will be seen, this case is important for us. \n \nThe propagator of the Calogero model is the time evolution operator in position representation for H in (<ref>), K_N(x,y;t)⟨ x|^- Ht|y⟩, using the Dirac bra-ket notation. \nMathematically, this propagator can be defined as integral kernel in the following solution of the time dependent Schrödinger equation \n∂_tψ(x;t)=Hψ(x;t), \n\n    ψ(x;t) = ∫_^N K_N(x,y;t)ψ_0(y) d^N y\n \nwith ψ_0(x)ψ(x;0) an arbitrary wave function at initial time t=0 <cit.>. \n\nOur explicit formula for this propagator in (<ref>) below is obtained by combining two results: \n(i) A relation between K_N(x,y;t) and the eigenfunctions Ψ_N(x;p) of the Calogero Hamiltonian H|_=0 in (<ref>) for =0 (Proposition 1), (ii) a simple explicit formula for Ψ_N(x;p) (see Proposition 2 for N=3 and (<ref>) with (<ref>) in general). \n\n\n\nRelation to wave functions. To motivate our first result, we recall the well-known propagator for the quantum harmonic oscillator H|_N=1 known as Mehler kernel, \n\n    K_1(x,y;t) = ^[(x^2+y^2)cos( t)-2xy]/2sin( t)/(2πsin( t)/)^1/2\n \n(x,y∈); see e.g. <cit.>. From this, one can obtain the propagator of the Calogero model in the non-interacting case ℓ=0, which describes non-interacting fermions in a harmonic potential, as follows: multiply the product of N Mehler kernels for the variables x_i, i=1,…,N, and anti-symmetrize, i.e., \n\n    K_N(x,y;t)|_ℓ=0= 1/N!∑_σ∈ S_N_σ∏_i=1^N K_1(x_σ(i),y_i;t)\n \nwith S_N is the permutation group and _σ=+1 and -1 for even and odd permutations σ∈ S_N, respectively.  \nWe note that (<ref>) can be written as \n\n    K_N(x,y;t) = ^(x^2+y^2)/2tan( t)/(2πsin( t)/)^N/2Ψ_N(x;- y/sin( t))\n \nwith Ψ_N(x;p)|_ℓ=0 = (1/N!)∑_σ∈ S_N_σ^ p· x_σ the plane-wave \n eigenfunction of the Hamiltonian H_ℓ=0,=0 describing non-interacting fermions on the real line without harmonic potential (we use the short-hand notation x_σ and p· x for (x_σ(1),…,x_σ(N)) and ∑_i=1^N p_ix_i, respectively).\nWe found that the propagator of the Calogero model is given by (<ref>) even for non-zero ℓ but where Ψ_N(x;p) is the eigenstate of the corresponding Calogero Hamiltonian H|_=0  without harmonic potential. \nTo be precise (see the Appendix for proof): \n\n\n\nProposition 1:  The propagator of the Calogero model is given by (<ref>) with the wave function Ψ_N(x;p) satisfying the following conditions:  \n(i) it solves the stationary Schrödinger equation \n\n    H|_=0Ψ_N(x;p)=(p^2/2)Ψ_N(x;p),\n \n(ii) it converges to (1/N!)∑_σ∈ S_N_σ^ℓ+1^ p· x_σ in the limit |x_i-x_i+1|→∞, i=1,…,N-1, where all particles are infinitely far apart, \n(iii) Ψ_N(x;p)/_N(x)^ℓ+1 is analytic and symmetric in the variables x, (iv) Ψ_N(x;p) satisfies the scaling relations\n\n    Ψ_N(sx;p) =Ψ_N(x;sp)   (s>0).\n \n \n\n\n\nWe believe this result deserves to be generally known: the wave function Ψ_N(x;p), p∈^N,  appearing in the exact formula (<ref>) for the propagator of the Calogero model is identical with the eigenfunctions of the translationally invariant Calogero Hamiltonian H|_=0  of interest in physics.\nIt is known that the conditions (i)–(iii) above determine these eigenfunctions uniquely; as shown in Appendix A, (iv) is implied by (i)–(iii). \n\n\n\nExplicit wave functions. \nThere exist several explicit formulas for the wave function Ψ_N(x;p) in the literature (such results can be found in <cit.>, for example); any of these provides an  explicit formula for the propagator K_N(x,y;t) by (<ref>). \nWe found a formula for this wave function which has a natural physics interpretation and is particularly simple from a computational point of view: \n\n    Ψ_N(x;p) = 1/N!∑_σ∈ S_N_σ^ℓ+1_N(x_σ;p) ^ p· x_σ\n \nwith _N(x;p) a finite(!) linear combination of products of the polynomials \n\n    F_k(X)∑_a=k^ℓ(ℓ+a)!/(ℓ-a)!(a-k)!1/X^a   (k=0,…,ℓ)\n \nin the variables 1/X=1/X_i,j with \n\n    X_i,j - (p_i-p_j)(x_i-x_j)   (1≤ i<j≤ N) ;\n \nsee (<ref>) below for general N and (<ref>) for N=3. \n\nTo motivate this result and explain the significance of the polynomials in (<ref>), we recall that the known eigenfunctions in the two-body case N=2 are given by  <cit.>\n\n    Ψ_2(x;p) = \n    ^(x_1+x_2)(p_1+p_2)/2(-)^ℓ+1z_ℓ(z)\n \nwith z (p_1-p_2)(x_1-x_2)/2, where _ℓ(z) are spherical Bessel functions <cit.>. \nOne can verify that (<ref>) can be written as in (<ref>) with  \n\n    _2(x;p)=F_0(X_1,2)\n \nthe function in (<ref>) for k=0 and with X_1,2 in (<ref>) (using e.g. <cit.>) <cit.>. \nThus, F_0(X) accounts for the two-body correlations in the Calogero model for =0. Since F_0(X)→ 1 as X→∞, Ψ_2(x;p) simplifies to symmetrized or anti-symmetrized plane waves in the limit |x_1-x_2|→∞ when the particles are infinitely apart, as expected. \nThe other functions in (<ref>) are descendants of F_0(X) in the following sense, F_k(X)=∂_s^kF_0(X/s)|_s=1 for k=1,…,ℓ. \nMoreover, the larger k, the faster F_k(X) decays as X→∞: F_k(X)=(ℓ+k)!/(ℓ-k)!X^k+… with the dots indicating terms vanishing faster as X→∞.  \nFor example, for ℓ=1 we have F_0(X)=1+2/X and F_1(X)=2/X, and for ℓ=2 these functions are F_0(X)=1+6/X+12/X^2, F_1(X)=6/X+24/X^2, and F_2(X)=24/X^2, etc. \n\nIn the N-body case and in the asymptotic region when all particles are infinitely far apart, the two-body interactions are irrelevant and the eigenfunction Ψ_N(x;p) can be obtained by symmetrizing or anti-symmetrizing a product of N one-particle eigenfunctions; this corresponds to (<ref>) with _N(x;p)→ 1 in the asymptotic region. \nMore generally, the function _N(x;p) must satisfy cluster properties as a consequence of the fact that interactions vanish for particles infinitely far apart: if we take the limit where we divide the particles into K groups of N_J particles, J=1,…,K and ∑_J=1^K N_J=N,  and such that  particles in the same group keep finite distances but particles in different groups become infinitely apart, the interactions between particles in different groups become irrelevant and   \n \n    _N(x;p) →∏_J=1^K _N_J(x_J;p_J)\n \n where x_J∈^N_J and p_J∈^N_J are the positions and momenta of the particles in the group J (_1= 1). \n Clearly, (<ref>) is a highly restrictive constraint on the function _N(x;p). For example, by choosing all N_J to be 2 or 1 one finds that  (<ref>) implies \n \n    _N(x;p) = ∏_1≤ i<j≤ N_2((x_i,x_j);(p_i,p_j))  + ⋯\n \nwhere the dots indicate sub-leading terms. \n\nThe considerations in the previous paragraph are general and apply to any translationally invariant quantum-many body systems with two-body interactions that vanish in the limit when particles distances become infinite. It thus is not surprising that (<ref>) holds true for the Calogero model with _2((x_i,x_j);(p_i,p_j))=F_0(X_i,j). \nWhat is special for the Calogero model is that the sub-leading terms in (<ref>) can be also written as linear combinations of products of two-body functions in (<ref>): we found that the function _N(x;p) in (<ref>) has the exact form  \n\n    _N(x;p) = ∑_𝐤 c_N(𝐤) ∏_1≤ i<j≤ N F_k_i,j(X_i,j)\n \nwith coefficients c_N(𝐤) depending on the integer vectors 𝐤=(k_i,j)_1≤ i<j≤ N in the finite set {0,…,ℓ}^N(N-1)/2. \nWe believe there is a simple general formula for the coefficients c_N(𝐤); at this point, we know this formula in some special cases, including N=3 and arbitrary integers ℓ>0: \n\n\n\nProposition 2. For N=3, the eigenfunctions of H|_=0 characterized in Proposition 1 are given by (<ref>) and \n\n    _3(x;p) = ∑_k=0^ℓ(ℓ-k)!/(ℓ+k)!k!F_k(X_1,2)F_k(X_1,3)F_k(X_2,3)\n \nwith F_k(X) in (<ref>) and X_i,j in (<ref>).\n\n\n\nWe discovered this formula by computer experiments and subsequently found a mathematical proof for all ℓ; since this proof is technical and it is easy to  verify the result for ℓ=1,…,10 using symbolic computing software on a laptop, we plan to publish this proof elsewhere. \nWe also obtained explicit results for larger values of N for the simplest non-trivial case ℓ=1; see Appendix B(ii). \n\nClearly, by combining Propositions 1 and 2, we obtain a fully explicit propagator for the Calogero model for the case N=3. Moreover, by finding an explicit formula for the coefficients c_N(𝐤) in (<ref>), this can be extended to other particle numbers N. \nBy combining cluster property (<ref>) with the results (<ref>) and (<ref>) for N=2 and N=3, respectively, many (but not all) of the coefficients c_N(𝐤) can be determined. \nFig. <ref> shows two examples of visualizations of the propagator for (N,ℓ)=(3,2). \n\n\n\n\n\nConclusions. We present exact analytic results for the Calogero model providing the following  many-body generalization of the Mehler kernel K_1 in (<ref>), \n\n    K_N(x,y;t) = \n    1/N!∑_σ∈ S_N_σ^ℓ+1∏_i=1^N K_1(x_σ(i),y_i;t) \n    ×∑_𝐦 C_N(𝐦) ∏_ i<j( -sin(ω t)/ω/(x_σ(i)-x_σ(j))(y_i-y_j))^m_ij\n \nwith 𝐦=(m_i,j)_1≤ i<j≤ N∈{0,…,ℓ}^N(N-1)/2 and postive-integer coefficients C_N(𝐦) which,  for N=2 and N=3, are given by\n((a,b,c) is short for (m_12,m_13,m_23)), \n\n    C_2(a) = (ℓ+a)!/(ℓ-a)!a!\n \nand \n\n    C_3(a,b,c) = C_2(a)C_2(b)C_2(c) \n    ×∑_k=0^min(a,b,c)(ℓ-k)!a!b!c!/(ℓ+k)!k!(a-k)!(b-k)!(c-k)!,\n \nrespectively. We expect that similar positive integer formulas for C_N(𝐦) exist for all N=4,5,…; see Appendix B(ii) for results on  C_N(𝐦) for ℓ=1 and arbitrary N. \n\nOur closed-form expressions for the propagator of the Calogero model provide analytic tools to compute the dynamics of a prototype quantum many-body system with non-trivial interactions.\nWe hope that this will find applications in, for example, non-equilibrium physics or realizations of the Calogero model in cold atom systems <cit.>. \n\n\nOne important ingredient to our result is a formula for the eigenfunctions of the Calogero model without harmonic potential which is of interest in its own right; see (<ref>) and Proposition 2.\nIn particular, we  propose to use this exact result as a guide to find approximate wave functions for other quantum many-body systems.\nThe simplest example would be (<ref>) with _2(x;p) obtained by solving the two-body problem (ignoring the dots) or, alternatively, one could try to find a mean-field type equation determining _2(x;p). \nMore generally, one could use (<ref>) as an ansatz for the three-body wave function with F_k(X_i,j) replaced by variational two-body functions _2^(k)((x_i,x_j);(p_i,p_j)), k=0,…,ℓ,  and then use (<ref>) for the many-body wave functions: in this way, one could try to systematically improve the approximate wave functions by increasing ℓ and having the  cluster properties (<ref>) always satisfied. \n\nOur result for N=2 was known before: in this case, the propagator given in (<ref>) and (<ref>) is a product of a Mehler kernel for the center-of-mass x_1+x_2,  and the propagator for the singular harmonic oscillator given by the Hille-Hardy formula <cit.> for the relative coordinate x_1-x_2. \nWe also mention an integral representation of the propagator of the Calogero model in the special case ℓ=-1/2 obtained in Ref. <cit.>. \nProposition 2 has relations to previous results in the mathematics literature <cit.>, as discussed in more detail in Appendix C(v) and (vi). \nClearly, it would be interesting to extend Proposition 2 to all particle numbers N>3.\n\nThe interested reader can find further results and further remarks on mathematical aspects of our work in Appendix B and C, respectively.\n\n\n\n \nAcknowledgements.  \nWe would like to thank Martin Hallnäs and Masatoshi Noumi for helpful discussions.\nWe are grateful to Martin Hallnäs for pointing out Ref. <cit.> containing results coming close to our Proposition 1. \nE.L. acknowledges support from the European Research Council, Grant Agreement No. 2020-810451.\n\n\n\n\nAppendix A: Proof of Proposition 1. We first show that properties (i)–(iii) of the eigenfunction Ψ_N(x;p) imply property (iv): Replacing x→ sx (s>0) changes H|_=0→ s^-2H|_=0. Therefore, (i) implies s^-2H|_=0Ψ_N(sx;p)=(p^2/2)Ψ_N(sx;p); clearly, this equation is also satisfied by Ψ_N(x;sp). \nMoreover, (ii) and (iii) are satisfied by Ψ(sx;p) if and only if they are satisfied by Ψ(x;sp). Since (i)–(iii) have a unique solution, (iv) follows. \nWe note in passing that (iii) is a technical condition ruling out unphysical solutions.\n\nTo verify that ψ in (<ref>) satisfies the pertinent time-dependent Schrödinger equation, we write K_N=GΨ_N with G short for ^(x^2+y^2)/2tan( t)/(2πsin( t)/)^N/2 and Ψ_N=Ψ_N(x;p) with p=- y/sin( t), suppressing arguments. \nWe compute, using the product and chain rules of differentiation, \n\n    (∂_t - H) K_N = G( (p^2/2)- H|_=0)Ψ_N \n    \n    + G /tanh( t)∑_i=1^N(x_j∂Ψ_N/∂ x_j - p_j∂Ψ_N/∂ p_j)\n    \n    +  Ψ_N( ∂_t -H|_ℓ=0 -(p^2/2))G;\n \nwe added and subtracted the same term (p^2/2)K_N in the first and last lines, respectively; \nthe first and second term in the second line come from ∇ G·∇Ψ_N and G∂_tΨ_N, respectively, using ∂_t p_j = - p_j/tan( t);  \nwe included the two-body and harmonic potential terms in the first and third lines, respectively. \nBy differentiating (<ref>) with respect to s and setting s=0 we obtain an identity showing that the terms in the second line in (<ref>) vanish.\nWe now use the fact that, in the non-interacting case ℓ=0, Proposition 1 is true by (<ref>) (this is explained in the main text). \nThis implies that (∂_t -H|_ℓ=0)GΨ_N|_ℓ=0=0. \nThus, setting ℓ=0 in (<ref>) and using that H|_=ℓ=0Ψ_N|_ℓ=0=(p^2/2)Ψ_N|_ℓ=0, we find that ( ∂_t -H|_ℓ=0 -(p^2/2))G=0; \nthis proves that the term in the third line in (<ref>) vanishes as well.  \nThus, if (<ref>) and (<ref>) hold true, then (∂_t - H) K_N=0, and this implies that ψ in (<ref>) is a solution of the time dependent Schrödinger equation ∂_tψ=Hψ.\n\n\nIn the limit t→ 0 of (<ref>), one can replace the functions sin( t)/ and tan( t)/ by t and Ψ_N(x;- p/sin( t)) by (1/N!)∑_σ∈ S_N_σ^ℓ+1^-· x_σ· y/t, respectively; the latter follows from (ii). \nThus, to compute the limit t→ 0 of ψ in (<ref>), we can replace K_N(x,y;t) in (<ref>) by  \n\n    ^(x^2+y^2)/2t/(2π t)^N/21/N!∑_σ∈ S_N_σ^ℓ+1^-· x_σ· y/t\n    = \n    1/N!∑_σ∈ S_N_σ^ℓ+1^(x_σ -y)^2/2t/(2π t)^N/2;\n \nthis is the well-known propagator of free fermions/bosons for even/odd ℓ, respectively, converging to the appropriate Dirac delta in the limit t→ 0. \nThus, ψ in (<ref>) satisfies ψ(x;t)→ψ_0(x) as t→ 0.  \n\n\n\n\nAppendix B: Further results. We give a further visualizations of our result in (i), and in (ii) we present results on the coefficients C_N(𝐦) in (<ref>) for ℓ=1 and N=4,5,…. \n\n\n\n(i) Fig. <ref> shows a visualization of the propagator for (N,ℓ)=(3,2) which is complementary to the one in Fig. <ref>: \nwhile Fig. <ref> shows K_3(x,y;t) for particular values of y=(y_1,y_2,y_3) and t as a function of the relative coordinates u=2^-1/2(x_1-x_2), v=6^-1/2(x_1+x_2-2x_3)  for fixed center-of-mass x_1+x_2+x_3=0 (we follows Calogero <cit.> in our choice of coordinates), Fig. <ref>  shows |K_3(x,y;t)| for these two examples (with everything else the same). \nTo set this result in perspective we note that, for N=1 (Mehler kernel), |K_1(x,y;t)| is a time dependent constant (independent of x and y), i.e., the non-trivial structure in Fig. <ref> is due to many-body effects. \nWe note in passing that the dark regions in Fig. <ref> containing the straight lines u=0 and v=± u/√(3) are a consequence of |K_3(x,y;t)| vanishing like |_3(x)|^3 as x_i→ x_j (1≤ i<j≤ 3). \n\n\n\n\n\n(ii) For ℓ=1, we computed the coefficients C_N(𝐦) for all N=2,…,5 using symbolic computer software.  \nAs explained below, our results suggest that the coefficients C_N(𝐦) have a combinatorial interpretation. \n\n\n\nFor ℓ=1, the components m_i,j of 𝐦=(m_i,j)_i<j are either 0 or 1, and one can represent 𝐦 by the graph obtained by drawing N nodes i=1,…,N and connecting those pairs of nodes (i,j) where m_i,j=1. We found that the value of C_N(𝐦) does not depend on the labeling of the nodes and, for this reason, only topologically inequivalent such graphs need to be considered; see Fig. <ref> for these graphs for N=2,…,5 and the corresponding coefficients C_N(𝐦). More specifically, our results in Fig. <ref> are all consistent with the following Conjecture: Let f_n be the rational numbers determined by the following conditions, \n\n    ∏_n=2^N f_n^Nn = ∏_n=2^N n!   (N=2,3,4,…),\n \ni.e., f_2=2, f_3=3/2, f_4=8/9, f_5=135/128 etc. Then \n\n    C_N(𝐦) = ∏_n=2^N f_n^q_n(𝐦)\n  \nwith q_n(𝐦) the number of cliques of size n in the graph associated with 𝐦 (a clique is a fully connected subgraph). \nIt is not manifest but true that all C_N(𝐦) obtained in this way are integers ≥ 1. \nThe conjecture implies, in particular, that for the vector 𝐦_max where all m_i,j=1 (corresponding to the maximally connected graph where all pairs of nodes are connected by edges), C_N(𝐦_max)=∏_n=2^N n!; we have a proof of the latter result for arbitrary N∈_≥ 2 (we plan to present this proof elsewhere). \n\nFor general ℓ∈_≥ 1, one can identify 𝐦 with multigraphs consisting of N nodes with m_i,j∈{ 0,…,ℓ} counting the number of edges between node i and j, and C_N(𝐦) can be interpreted as amplitude corresponding to this multigraph.\n\n\n\nAppendix C: Further remarks.  We give various remarks on mathematical aspects of our results. \n\n\n\n(i) We first obtained Proposition 1 by developing a quantum version of the projection method (which is a well-known method used to compute the exact time evolution of the classical variants of CMS systems <cit.>); this derivation of Proposition 1 is restricted to integer ℓ (we plan to present this derivation elsewhere). \nSubsequently, we discovered the elementary proof presented in Appendix A which applies even to non-integer ℓ. \n\n\n\n(ii)  It is interesting to note that (<ref>) implies \n\n    _N(x;p) = ∑_𝐦C_N(𝐦)/∏_i<j X_i,j^m_i,j\n \nwhere 𝐦=(m_i,j)_i<j∈{0,…,ℓ}^N(N-1)/2. \nWe conjecture that all coefficients C_N(𝐦) in this formula are non-negative integers (since this is true in all cases we understand), and that they have interesting combinatorial interpretations (we discuss such an interpretation for ℓ=1 in Appendix B(ii)).\n\n\n\n(iii) It is interesting to note that the eigenfunctions Ψ_N(x;p) (<ref>) of the Calogero Hamiltonian H|_ω=0 are invariant under the exchange x↔ p and, for this reason, they are also eigenfunctions of the differential operator \n\n    - ∑_i=1^N1/2∂^2/∂ p_i^2 + ∑_i<jℓ(ℓ+1)/(p_i-p_j)^2\n \nwith eigenvalue x^2/2. This property is known as bispectrality in the mathematics literature.  \n\n\n\n(iv)  The function _N(x;p)^ p· x is an eigenfunction of the Calogero Hamiltonian H|_ω=0 without harmonic potential, and the corresponding eigenvalue is p^2/2. \nIt is important to note that this eigenfunction is unphysical  since it is singular; the symmetrization (for odd ℓ) or anti-symmetrization (for even ℓ) in (<ref>) is needed to obtain the non-singular eigenfunctions Ψ_N(x;p) of interest in physics. \nTo be more specific: While while _N(x;p)^ p· x diverges in the limit x_i→ x_j  (i<j), the (anti-)symmetrized wave function Ψ_N(x;p) vanishes like _N(x)^ℓ+1 in any such limit (this is a consequence of Property (iii) in Proposition 1); this property is not manifest in our explicit formulas for Ψ_N(x;p). \nFor N=2, this property is implied by well-known representations of the spherical Bessel functions making manifest that zj_ℓ(z) vanishes like z^ℓ+1 as z→ 0. \nFor N≥ 3, this property can be proved using an explicit formula for the wave function Ψ_N(x;p)  obtained by specializing a known kernel function representation of the eigenfunctions of the hyperbolic Calogero-Sutherland model <cit.> (we plan to present details on this elsewhere). \nWe note in passing that this kernel function representation of Ψ_N(x;p) was useful for us during our work. \n\n\n\n\n(v)  The functions Ψ_N(x;p) is equal to Opdam's Bessel functions for the A_N-1 case <cit.>. \nMoreover, _N(x;p)^ p· x is known as Baker–Akhiezer function in the mathematics literature <cit.>, and explicit formulas for this function were obtained in <cit.>. \nWe believe our result in Proposition 2 is somewhat simpler from a computational point of view than previously known results.\n\n\n\n(vi)  An explicit formula for asymptotically free eigenfunctions of the trigonometric Macdonald-Rujsenaars operators for N=3 that is similar Proposition 2 was obtained by Noumi and Shiraishi <cit.>; it would be interesting to understand the precise relation between their and our result. \nIn particular, we hope that a future extension of  Proposition 2 to N>3 could help to find an extension of the Noumi-Shiraishi result to N>3.\n\n\n\n(vii) It would be interesting to extend our results to non-integer ℓ≥ -1/2 where the Calogero model is known to describe anyons <cit.>.\nWe expect that, for non-integer ℓ, the series corresponding to (<ref>) become infinite and, for this reason, nontrivial issues of convergence arise. \nIt would also be interesting to find other CMS-type models were the eigenfunctions can be expressed as finite sums of products of two-body functions.\n\n10\n\ncalogero1971\nF. Calogero, “Solution of the one-dimensional N-body problems with quadratic\n  and/or inversely quadratic pair potentials,” Journal of Mathematical\n  Physics, vol. 12, no. 3, pp. 419–436, 1971.\n\nmoser1976\nJ. Moser, “Three integrable hamiltonian systems connected with isospectral\n  deformations,” in Surveys in Applied Mathematics, pp. 235–258,\n  Elsevier, 1976.\n\nsutherland1972\nB. Sutherland, “Exact results for a quantum many-body problem in one\n  dimension. ii,” Physical Review A, vol. 5, no. 3, p. 1372, 1972.\n\ntoda1967\nM. Toda, “Vibration of a chain with nonlinear interaction,” Journal of\n  the Physical Society of Japan, vol. 22, no. 2, pp. 431–436, 1967.\n\nolshanetsky1976\nM. Olshanetsky and A. Perelomov, “Completely integrable Hamiltonian systems\n  connected with semisimple Lie algebras,” Inventiones mathematicae,\n  vol. 37, no. 2, pp. 93–108, 1976.\n\nolshanetsky1983\nM. Olshanetsky and A. Perelomov, “Quantum integrable systems related to Lie\n  algebras,” Physics Reports, vol. 94, no. 6, pp. 313–404, 1983.\n\npolychronakos1995\nA. P. Polychronakos, “Waves and solitons in the continuum limit of the\n  Calogero-Sutherland model,” Physical Review Letters, vol. 74,\n  no. 26, p. 5153, 1995.\n\ndhoker1998\nE. D'Hoker and D. Phong, “Calogero-Moser systems in SU (N) Seiberg-Witten\n  theory,” Nuclear Physics B, vol. 513, no. 1-2, pp. 405–444, 1998.\n\nabanov2005\nA. G. Abanov and P. B. Wiegmann, “Quantum hydrodynamics, the quantum\n  Benjamin-Ono equation, and the Calogero model,” Physical Review\n  Letters, vol. 95, no. 7, p. 076402, 2005.\n\nbettelheim2006\nE. Bettelheim, A. G. Abanov, and P. Wiegmann, “Nonlinear quantum shock waves\n  in fractional quantum Hall edge states,” Physical Review Letters,\n  vol. 97, no. 24, p. 246401, 2006.\n\nagarwal2006\nA. Agarwal and A. P. Polychronakos, “BPS operators in 𝒩= 4 SYM:\n  Calogero models and 2D fermions,” Journal of High Energy Physics,\n  vol. 2006, no. 08, p. 034, 2006.\n\nstone2008\nM. Stone, I. Anduaga, and L. Xing, “The classical hydrodynamics of the\n  Calogero–Sutherland model,” Journal of Physics A: Mathematical and\n  Theoretical, vol. 41, no. 27, p. 275401, 2008.\n\nwiegmann2012\nP. Wiegmann, “Nonlinear hydrodynamics and fractionally quantized solitons at\n  the fractional quantum Hall edge,” Physical Review Letters, vol. 108,\n  no. 20, p. 206810, 2012.\n\nestienne2012\nB. Estienne, V. Pasquier, R. Santachiara, and D. Serban, “Conformal blocks in\n  Virasoro and W theories: duality and the Calogero–Sutherland model,” Nuclear Physics B, vol. 860, no. 3, pp. 377–420, 2012.\n\nisachenkov2016\nM. Isachenkov and V. Schomerus, “Superintegrability of d-dimensional conformal\n  blocks,” Physical Review Letters, vol. 117, no. 7, p. 071602, 2016.\n\nberntson2020\nB. K. Berntson, E. Langmann, and J. Lenells, “Nonchiral intermediate\n  long-wave equation and interedge effects in narrow quantum Hall systems,”\n  Physical Review B, vol. 102, no. 15, p. 155308, 2020.\n\nspohn2023\nH. Spohn, “Hydrodynamic scales of integrable many-particle systems,” arXiv preprint arXiv:2301.08504, 2023.\n\nberntson2023\nB. K. Berntson, E. Langmann, and J. Lenells, “Conformal field theory,\n  solitons, and elliptic Calogero–Sutherland models,” arXiv preprint\n  arXiv:2302.11658, 2023.\n\nruijsenaars1999\nS. Ruijsenaars, “Systems of Calogero-Moser type,” in Particles and\n  fields, pp. 251–352, Springer, 1999.\n\npolychronakos2006\nA. P. Polychronakos, “The physics and mathematics of Calogero particles,”\n  Journal of Physics A: Mathematical and General, vol. 39, no. 41,\n  p. 12793, 2006.\n\nchalykh2008\nO. Chalykh, “Algebro-geometric Schrödinger operators in many\n  dimensions,” Philosophical Transactions of the Royal Society A:\n  Mathematical, Physical and Engineering Sciences, vol. 366, no. 1867,\n  pp. 947–971, 2008.\n\netingof2007\nP. Etingof and P. I. Etingof, Calogero-Moser systems and representation\n  theory, vol. 4.\nEuropean Mathematical Society, 2007.\n\nnekrasov2010\nN. A. Nekrasov and S. L. Shatashvili, “Quantization of integrable systems and\n  four dimensional gauge theories,” in XVIth International Congress On\n  Mathematical Physics: (With DVD-ROM), pp. 265–289, World Scientific, 2010.\n\nvandiejen2012\nJ. F. van Diejen and L. Vinet, Calogero–Moser–Sutherland Models.\nSpringer Science & Business Media, 2012.\n\nkhandekar1975\nD. Khandekar and S. Lawande, “Exact propagator for a time-dependent harmonic\n  oscillator with and without a singular perturbation,” Journal of\n  Mathematical Physics, vol. 16, no. 2, pp. 384–388, 1975.\n\nnowak2013\nA. Nowak and P. Sjögren, “Sharp estimates of the Jacobi heat kernel,”\n  Studia mathematica, vol. 218, no. 3, pp. 219–244, 2013.\n\nsakurai2014\nJ. Sakurai and J. Napolitano, Modern quantum mechanics. 2-nd edition.\nPerson New International edition, 2014.\n\nlassalle1991\nM. Lassalle, “Polynômes de Hermite généralisés,” Comptes rendus de l'Académie des sciences. Série 1,\n  Mathématique, vol. 313, no. 9, pp. 579–582, 1991.\n\nbrink1992\nL. Brink, T. Hansson, and M. A. Vasiliev, “Explicit solution to the N-body\n  Calogero problem,” Physics Letters B, vol. 286, no. 1-2,\n  pp. 109–111, 1992.\n\nbaker1997\nT. H. Baker and P. J. Forrester, “The Calogero-Sutherland model and\n  generalized classical polynomials,” Communications in Mathematical\n  Physics, vol. 188, no. 1, pp. 175–216, 1997.\n\nnekrasov1997\nN. Nekrasov, “On a duality in Calogero-Moser-Sutherland systems,” arXiv preprint hep-th/9707111, 1997.\n\nrosler1998\nM. Rösler, “Generalized Hermite polynomials and the heat equation for\n  Dunkl operators,” Communications in Mathematical Physics, vol. 192,\n  no. 3, pp. 519–542, 1998.\n\nfeigin2021\nM. V. Feigin, M. A. Hallnäs, and A. P. Veselov, “Quasi–invariant Hermite\n  Polynomials and Lassalle–Nekrasov Correspondence,” Communications in\n  Mathematical Physics, vol. 386, no. 1, pp. 107–141, 2021.\n\nremark2\nWe analytically continue time, t, so that ( t)>0.\n\ncalogero1969\nF. Calogero, “Solution of a three-body problem in one dimension,” Journal of Mathematical Physics, vol. 10, no. 12, pp. 2191–2196, 1969.\n\nchalykh1990\nO. Chalykh and A. Veselov, “Commutative rings of partial differential\n  operators and Lie algebras,” Communications in Mathematical Physics,\n  vol. 126, no. 3, pp. 597–611, 1990.\n\nopdam1993\nE. M. Opdam, “Dunkl operators, Bessel functions and the discriminant of a\n  finite Coxeter group,” Compositio Mathematica, vol. 85, no. 3,\n  pp. 333–373, 1993.\n\nchalykh1999\nO. Chalykh, M. V. Feigin, and A. Veselov, “Multidimensional Baker–Akhiezer\n  functions and Huygens' principle,” Communications in Mathematical\n  Physics, vol. 206, pp. 533–566, 1999.\n\nfelder2009\nG. Felder and A. P. Veselov, “Baker–Akhiezer function as iterated residue\n  and Selberg-type integral,” Glasgow Mathematical Journal, vol. 51,\n  no. A, pp. 59–73, 2009.\n\nDLMF\n“NIST Digital Library of Mathematical Functions.”\n  http://dlmf.nist.gov/, Release 1.0.26 of 2020-03-15.\nF.W.J. Olver, A.B. Olde Daalhuis, D.W. Lozier, B.I. Schneider, R.F.\n  Boisvert, C.W. Clark, B.R. Miller, B.V. Saunders, H.S. Cohl, and M.A.\n  McClain, eds.\n\nremark3\nOne can also verify directly that ^ p· x_2(x;p) is an\n  eigenfunction of H|_N=2,ω=0.\n\npolkovnikov2011\nA. Polkovnikov, K. Sengupta, A. Silva, and M. Vengalattore, “Colloquium:\n  Nonequilibrium dynamics of closed interacting quantum systems,” Reviews\n  of Modern Physics, vol. 83, no. 3, p. 863, 2011.\n\nfleury1998\nM. Fleury, “The propagator of the Calogero-Moser system in an external\n  quadratic potential,” Journal of Geometry and Physics, vol. 28,\n  no. 3-4, pp. 320–338, 1998.\n\nnoumi2012\nM. Noumi and J. Shiraishi, “A direct approach to the bispectral problem for\n  the Ruijsenaars-Macdonald q-difference operators,” arXiv preprint\n  arXiv:1206.5364, 2012.\n\nkazhdan1978\nD. Kazhdan, B. Kostant, and S. Sternberg, “Hamiltonian group actions and\n  dynamical systems of Calogero type,” Communications on Pure and\n  Applied Mathematics, vol. 31, no. 4, pp. 481–507, 1978.\n\nhallnas2015\nM. Hallnäs and S. Ruijsenaars, “A recursive construction of joint\n  eigenfunctions for the hyperbolic nonrelativistic Calogero-Moser\n  hamiltonians,” International Mathematics Research Notices, vol. 2015,\n  no. 20, pp. 10278–10313, 2015.\n\n\n\n\n"}