{"entry_id": "http://arxiv.org/abs/2303.07228v2", "published": "20230313160218", "title": "Estimate distillable entanglement and quantum capacity by squeezing useless entanglement", "authors": ["Chengkai Zhu", "Chenghong Zhu", "Xin Wang"], "primary_category": "quant-ph", "categories": ["quant-ph", "cs.IT", "math-ph", "math.IT", "math.MP"], "text": "\n\n\nThese two authors contributed equally.\n\nThese two authors contributed equally.\n\nwangxin73@baidu.com\nInstitute for Quantum Computing, Baidu Research, Beijing 100193, China\n\nEntanglement distillation is crucial in quantum information processing. But it remains challenging to estimate the distillable entanglement and its closely related essential quantity, the quantum capacity of a noisy quantum channel. In this work, we propose methods for evaluating both quantities by squeezing out useless entanglement within a state or a quantum channel, whose contributions are expected to be ignored for the distillable entanglement or the quantum capacity, respectively. We first consider a general resource measure called the reverse divergence of resources to quantify the minimum divergence between a target state and the set of free states. We then introduce the reverse max-relative entropy of entanglement and apply it to establish efficiently computable upper bounds on the distillable entanglement. We also extend the reverse divergence of resources to quantum channels and derive upper bounds on the quantum capacity. We further apply our method to investigate purifying the maximally entangled states under practical noises, such as depolarizing and amplitude damping noises, and notably establish improvements in estimating the one-way distillable entanglement. Our bounds also offer useful benchmarks for evaluating the quantum capacities of qubit quantum channels of interest, including the Pauli channels and the random mixed unitary channels.\n\n\n\nEstimate distillable entanglement and quantum capacity by squeezing useless entanglement\n    Xin Wang\n    March 30, 2023\n========================================================================================\n\n\n\n\n\n\n\n§ INTRODUCTION\n\n\n\n\n §.§ Background\n\nQuantum entanglement is the most nonclassical manifestation of quantum mechanics and has become a key ingredient in many quantum information processing tasks, e.g., teleportation <cit.>, superdense coding <cit.>, and quantum cryptography <cit.>. More specifically, the entanglement resource is usually assumed to be copies of the maximally entangled states. In a practical scenario, noises inevitably occur in quantum states, resulting in some mixed entangled states, which leads to the need for distillation or purification. A natural question is how to obtain the maximally entangled states from a source of less entangled states using well-motivated operations, known as the entanglement distillation.\n\nOne fundamental measure for characterizing the entanglement distillation is the one-way distillable entanglement <cit.>, denoted by E_D,→, which is also one of the most important entanglement measures motivated by operational tasks. It captures the highest rate at which one can obtain the maximally entangled states from less entangled states by one-way local operations and classical communication (LOCC):\n\n    E_D,→(ρ_AB)=sup{r:lim_n →∞ [inf_ΛΛ(ρ_AB^ n)- Φ(2^rn)_1]=0},\n\nwhere Λ ranges over one-way LOCC operations and Φ(d)=1/d∑_i,j=1^d |ii⟩⟨jj| is the standard d⊗ d maximally entangled state. Likewise, the two-way distillable entanglement E_D,↔(ρ_AB) is defined by the supremum over all achievable rates under two-way LOCC. We have for all bipartite states ρ_AB that E_D,→(ρ_AB) ≤ E_D,↔(ρ_AB). Notably, the distillable entanglement turns out to be closely related to the central idea of quantum capacity in quantum communication tasks, which is central to quantum Shannon theory. Consider modelling the noise in transmitting quantum information from Alice to Bob as a quantum channel _A→ B. The quantum capacity Q(_A→ B) is the maximal achievable rate at which Alice can reliably transmit quantum information to Bob by asymptotically many uses of the channel. By the state–channel duality, if the distillation protocol of the Choi state <cit.> J_AB^ of _A→ B yields the maximally entangled states at a positive rate, then Alice may apply the standard teleportation scheme to send arbitrary quantum states to Bob at the same rate. Thus, one has Q(_A→ B) ≥ E_D,→(J_AB^) since classical forward communication in teleportation does not affect the channel capacity. For the teleportation-simulable channels <cit.>, the equality here holds. Many recent works <cit.> have studied the properties of quantum communication over quantum channels, e.g., non-additivity and superactivation, which determines the complexity of calculating the quantum capacity.\n\n \nDespite many efforts that have been made in the past two decades, computing E_D,→(·) and Q(·) still generally remains a challenging task. Even for the qubit isotropic states and the depolarizing channels, it remains unsolved. Therefore, numerous studies try to estimate them by deriving lower and upper bounds (see, e.g., <cit.> for the distillable entanglement, e.g., <cit.> for the quantum capacity). For the distillable entanglement, a well-known lower bound dubbed Hashing bound is established by Devetak and Winter <cit.>, i.e., E_D,→(ρ_AB) ≥ I_(A⟩ B)_ρ, where I_(A⟩ B)_ρ is the coherent information of the bipartite quantum state ρ_AB. Considering upper bounds, the Rains bound <cit.> is arguably the best-known efficiently computable bound for the two-way distillable entanglement of general states, which can consequently be an upper bound of E_D,→(·). Recent works <cit.> utilize the techniques of finding upper bounds by constructing meaningful extended states. For quantum capacity, many useful upper bounds for general quantum channels are studied for benchmarking arbitrary quantum noise <cit.>. When considering some specific classes of quantum channels, useful upper bounds are also developed to help us better understand quantum communication via these channels <cit.>.\n\nIn specific, due to the regularization in the characterizations of E_D,→(·) and Q(·), one main strategy to establish efficiently computable upper bounds on them is to develop single-letter formulae. For example, one common approach is to decompose a state (resp. a quantum channel) into degradable parts and anti-degradable parts <cit.>, or use approximate degradability (anti-degradability) <cit.>. Another recent fruitful technique called flag extension optimization <cit.> relies on finding a degradable extension of the state or the quantum channel. However, the performance of these methods is limited by the absence of a good decomposition strategy. It is unknown how to partition a general state or quantum channel to add flags or how to construct a proper and meaningful convex decomposition on them. Thus, the flag extension optimization is only effective for the states and channels with symmetry or known structures.\n\n\n\n §.§ Main contributions\n\nThis work considers a family of resource measures called reverse divergence of resources. \n\nWith a specific construction, we define the reverse max-relative entropy of entanglement for quantum states, which has applications for estimating the distillable entanglement. \nIn the meantime, we introduce reverse max-relative entropy of anti-degradability for quantum channels as a generalization of the concept of that for states, which can be applied to bound the quantum capacity. All these bounds can be efficiently computed via semidefinite programming <cit.>. Furthermore, drawing on the idea of <cit.>, we thoroughly analyze different continuity bounds on the one-way distillable entanglement of a state in terms of its anti-degradability. Finally, we investigate the distillation of the maximally entangled states under practical noises and focus on the quantum capacity of qubit channels. We show that the bound obtained by the reverse max-relative entropy of entanglement outperforms other known bounds in a high-noise region, including the Rains bound and the above continuity bounds. The upper bound offered by the reverse max-relative entropy of anti-degradability also provides an alternative interpretation of the no-cloning bound of the Pauli channel <cit.>, and notably outperforms the continuity bounds on random unital qubit channels.\n\nThe rest of this paper is structured as follows. We start with some preliminaries used throughout the paper in section <ref>. In section <ref>, we introduce our conceptual contribution, a family of resource measures called the reverse divergence of resources. In section <ref>, we present the application of this concept on the distillable entanglement. Specifically, in subsection <ref>, we show how the reverse max-relative entropy of entanglement can be used to derive a useful upper bound on the one-way distillable entanglement. We derive different continuity bounds in subsection <ref>, with which we compare our bounds and the Rains bound by practical distillable states in subsection <ref>. We also extend our method to the two-way distillable entanglement in subsection <ref>. In section <ref>, we show the application of our method in deriving upper bounds on quantum capacity. We establish some analytical results for Pauli channels and compare our bounds with continuity bounds in subsection <ref> for random mixed unitary channels. In section <ref>, we conclude with a summary and some outlooks for future research.\n\n\n\n\n§ REVERSE DIVERGENCE OF RESOURCES\n \n\n\n §.§ Preliminaries\n\nLet  be a finite-dimensional Hilbert space, and () be the set of linear operators acting on it. We consider two parties Alice and Bob with Hilbert space ℋ_A, ℋ_B, whose dimensions are d_A, d_B, respectively. A linear operator ρ∈() is called a density operator if it is Hermitian and positive semidefinite with trace one. We denote the trace norm of ρ as ρ_1 = √(ρ^†ρ) and let () denote the set of density operators. We call a linear map CPTP if it is both completely positive and trace-preserving. A CPTP map that transforms linear operators in (_A) to linear operators in (_B) is also called a quantum channel, denoted as _A→ B. For a quantum channel _A→ B, its Choi-Jamiołkowski state is given by J_AB^≡∑_i, j=0^d_A-1|i⟩⟨j|𝒩_A → B(|i⟩⟨j|), where {|i⟩}_i=0^d_A-1 is an orthonormal basis in _A. The von Neumann entropy of a state ρ_A is S(A)_ρ := - (ρ_A logρ_A) and the coherent information of a bipartite state ρ_AB is defined by I_c(A⟩ B)_ρ := S(B)_ρ - S(AB)_ρ. The entanglement of formation of a state ρ_AB is given by\n\n    E_F(ρ_AB) = min_{p_i, |ϕ_i⟩}∑_i p_i S(A)_ϕ_i,\n\nwhere ρ_AB=∑_i p_i |ϕ_i⟩⟨ϕ_i|_AB and the minimization ranges over all pure state decomposition of ρ_AB. We introduce the generalized divergence D(ρ_A σ_A) as a map D: (_A)×(_A) ↦ℝ∪{+∞} that obeys:\n\n    \n  * Faithfulness: D(ρ_A σ_A)=0 iff ρ_A = σ_A.\n    \n  * Data processing inequality: D(ρ_A σ_A) ≥D[𝒩_A→ A'(ρ_A) 𝒩_A→ A'(σ_A)], where 𝒩_A→ A' is an arbitrary quantum channel.\n\nThe generalized divergence is intuitively some measure of distinguishability of the two states, e.g., Bures metric, quantum relative entropy. Another example of interest is the sandwiched Rényi relative entropy <cit.> of ρ, σ that is defined by\n\n    D_α(ρσ):=1/α-1logTr[(σ^1-α/2 αρσ^1-α/2 α)^α],\n\nif supp(ρ) ⊂supp(σ) and it is equal to +∞ otherwise, where α∈(0,1) ∪(1, ∞). In the case that α→∞, one can find the max-relative entropy <cit.> of ρ with respect to σ by\n\n    D_max(ρ || σ) = inf{λ∈ℝ: ρ≤ 2^λσ}.\n\n\n\n\n §.§ Reverse divergence of resources\n\nIn the usual framework of quantum resource theories <cit.>, there are two main notions: i) subset  of free states, i.e., the states that do not possess the given resource; ii) subset  of free operations, i.e., the quantum channels that are unable to generate the resource. Meanwhile, two axioms for a quantity being a resource measure (·) are essential:\n\n    \n  1). Vanishing for free states: ρ∈⇒(ρ) = 0.\n    \n  2). Monotonicity: ((ρ)) ≤(ρ) for any free operation . (·) is called a resource monotone.\n\nLet us define a family of resource measures called reverse divergence of resources:\n\n    _ℱ(ρ_AB) := min_τ∈ℱD(τ_AB||ρ_AB),\n\nwhere ℱ is some set of free states. By the definition of the reverse divergence of resources in Eq. (<ref>), one can easily check it satisfies condition 1). Whenever the free state set  is closed, by the data-processing inequality of D(··), condition 2) will be satisfied. Thus _ℱ(·) is a resource measure. Specifically, in the resource theory of entanglement, some representative free state sets are the separable states (SEP) and the states having a positive partial transpose (PPT). Examples of free sets of operations are LOCC and PPT. We note that the \"reverse\" here means minimizing the divergence over a free state set in the first coordinate, rather than the second one which has helped one define the relative entropy of entanglement <cit.> and the max-relative entropy of entanglement <cit.>. For some divergence of particular interest, e.g., the quantum relative entropy D(·||·), relevant discussion of the coordinate choices can be traced back to work in <cit.>. In <cit.>, the authors further studied properties of the quantity min_τ∈D(τ||ρ). Here, we try to further investigate meaningful applications of some reverse divergence of resources.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the following, we consider the generalized divergence as the max-relative entropy and study a measure called reverse max-relative entropy of resources,\n\n    _max,ℱ(ρ_AB) := min_τ∈ℱD_max(τ_AB||ρ_AB),\n\nwhere ℱ is some set of free states. If there is no such state τ_AB∈ that satisfies τ_AB≤ 2^λρ_AB for any λ∈ℝ, _max,ℱ(ρ_AB) is set to be 0. \n\nThis measure bears many nice properties. First, it can be efficiently computed via semidefinite programming (SDP) in many cases which will be discussed in the latter sections. Second, Eq. (<ref>) gives the closest free state τ_AB∈ to ρ_AB, w.r.t. the max-relative entropy. Third, _max,ℱ(·) is subadditive w.r.t the tensor product of states. In fact, _max,ℱ(ρ_AB) is closely related to the weight of resource W(ρ_AB) <cit.> and the free component Γ(ρ_AB) <cit.>, both of which have fruitful properties and applications <cit.>, as follows\n\n    2^-_max,ℱ(ρ_AB)  = 1-W(ρ_AB) = Γ(ρ_AB).\n\nWe note that each part of Eq. (<ref>) quantifies the largest weight where a free state can take in a convex decomposition of ρ_AB. When moving on to operational tasks that the free state can be ignored, what is left in a convex decomposition becomes our main concern. Optimization of the weight in the decomposition can be visualized as squeezing out all free parts of the given state. Thus, we further introduce the -squeezed state of ρ_AB as follows.\n\nFor a bipartite quantum state ρ_AB and a free state set , \n\n\n\n\n\nIf _max,ℱ(ρ_AB) is non-zero, the -squeezed state of ρ_AB is defined by\n\n    ω_AB = ρ_AB-2^-_max,ℱ(ρ_AB)·τ_AB/1-2^-_max,ℱ(ρ_AB),\n\nwhere τ_AB is the closest free state to ρ_AB in terms of the max-relative entropy, i.e., the optimal solution in Eq. (<ref>). If _max,ℱ(ρ_AB)=0, the -squeezed state of ρ_AB is itself.\n\n\n\n\n\nIn the following sections, we will illustrate the applications of the reverse max-relative entropy of resources as well as the squeezing idea on example tasks. One is giving upper bounds on the distillable entanglement of arbitrary quantum states. The other is to derive upper bounds on the quantum capacity of channels. \n\n\n\n\n§ APPLICATIONS ON DISTILLABLE ENTANGLEMENT\n \nIn this section, we investigate the information-theoretic application of the reverse max-relative entropy of resources in deriving efficiently computable upper bounds on the distillable entanglement. To showcase the advantage of our bounds, we compare the results with different continuity bounds and the Rains bound on the maximally entangled states with practical noises.\n\n\n\n §.§ Upper bound on the one-way distillable entanglement\n\nRecall that the one-way distillable entanglement has a regularized formula <cit.>:\n\n    E_D,→(ρ_AB) = lim_n→∞1/nE^(1)_D,→(ρ_AB^⊗ n),\n\nwhere \nE^(1)_D,→(ρ_AB) := max_T I_(A'⟩ M B)_T(ρ_AB),\nand the maximization ranges over all quantum instruments\nT:A→ A'M on Alice’s system. The regularization in Eq. (<ref>) for E_D,→(ρ_AB) is intractable to compute in most cases. However, there are some categories of states whose E_D,→ can be reduced to single-letter formulae. Two important classes are called degradable states and anti-degradable states.\n\nLet ρ_AB be a bipartite state with purification |ϕ⟩_ABE. ρ_AB is called degradable if there exists a CPTP map ℳ_B→ E such that ℳ_B→ E(ρ_AB) = _B(ϕ_ABE), and is called anti-degradable if there exists a CPTP map ℳ_E→ B such that ℳ_E→ B(ρ_AE) = _E(ϕ_ABE). Equivalently, a state is anti-degradable if and only if it has a symmetric extension <cit.>, thus is also called a two-extendible state. For the degradable states, it is shown that <cit.>\n\n    E^(1)_D,→(ρ_AB^⊗ n) = n  E^(1)_D,→(ρ_AB) = n I_(A⟩ B)_ρ, ∀ n∈ℕ,\n\nresulting in E_D,→(ρ_AB) =  I_(A⟩ B)_ρ. For the anti-degradable states, consisting of a compact and convex set, it always holds\n\n    E^(1)_D,→(ρ_AB) = E_D,→(ρ_AB) = 0.\n\nMoreover, E_D,→(·) is convex on decomposing a state into degradable and anti-degradable parts <cit.>. To better exploit this convexity, we introduce the reverse max-relative entropy of unextendible entanglement to help identify the anti-degradable (two-extendible) part of a given bipartite state ρ_AB:\n\n    _max,(ρ_AB) := min_τ∈D_max(τ_AB||ρ_AB),\n\nwhere  is the set of all anti-degradable states. In this resource theory, the resource we consider is the extendible entanglement, and the free states are bipartite states that are possibly shareable between A and a third party E, where E is isomorphic to B. Notably, the extendibility of entanglement is a key property in entanglement theory with many existing applications <cit.>. Here, combined with the idea of entanglement of formation, _max,(ρ_AB) can be applied to derive an upper bound on the one-way distillable entanglement of an arbitrary state ρ_AB as shown in Theorem <ref>.\n\nFor any bipartite state ρ_AB, it satisfies\n\n    E_D,→(ρ_AB) ≤ E_ rev^u(ρ_AB):=[1-2^-_max,(ρ_AB)]· E_F(ω_AB),\n\nwhere ω_AB is the -squeezed state of ρ_AB, _max,(·) is the reverse max-relative entropy of unextendible entanglement, and E_F(·) is the entanglement of formation.\n\n\nSuppose the ADG-squeezed state of ρ_AB is ω_AB and the optimal solution in Eq. (<ref>) for ρ_AB is τ_AB. It follows \n\n    ρ_AB = [1-2^-_max,(ρ_AB)]ω_AB + 2^-_max,(ρ_AB)τ_AB,\n\nwhere τ_AB is anti-degradable. Suppose ω_AB admit a pure state decomposition ω_AB= ∑_ip_i |ω_i⟩⟨ω_i|_AB. Since any pure state is degradable, we now can decompose ρ_AB into degradable parts and anti-degradable parts as\n\n    ρ_AB = [1-2^-_max,(ρ_AB)]∑_i p_i |ω_i⟩⟨ω_i|_AB + 2^-_max,(ρ_AB)τ_AB,\n\nAccording to the essential convexity of E_D,→(·) on decomposing a state into degradable and anti-degradable parts proved by Leditzky et al. <cit.>, we have\n\n    E_D,→(ρ_AB)    ≤ [1-2^-_max,(ρ_AB)]·∑_i p_i E_D,→(ω_i) + 2^-_max,(ρ_AB) E_D,→(τ_AB)\n       ≤ [1-2^-_max,(ρ_AB)]·∑_i p_i I_c(A⟩ B)_ω_i,\n\nwhere the second inequality is due to the fact in Eq. (<ref>) and Eq. (<ref>) of degradable states and anti-degradable states, respectively. After taking the minimization over all possible decomposition of ω_AB, we arrived at\n\n    E_D,→(ρ_AB)    ≤ [1-2^-_max,(ρ_AB)]·min∑_i p_i I_c(A⟩ B)_ω_i\n       =[1-2^-_max,(ρ_AB)]· E_F(ω_AB).\n\n\n\nThe bound E_ rev^u(ρ_AB) has a cartoon illustration as shown in Fig. <ref>. The main insight of it is to squeeze out as much of the free or useless part, the anti-degradable state here, as possible. We point out that squeezing all useless parts out does not necessarily give the tightest upper bound in terms of the one-way distillable entanglement, e.g., isotropic state <cit.>. Instead of squeezing out all the useless parts, there may be room for exploring more appropriate partitions when we try to decompose a specific quantum state. However, the approach we present in Theorem <ref> is an invaluable method for general states as shown in subsection <ref> and can be seen as a variant of the continuity bound in terms of the anti-degradability of the state.\n\n\nFor any bipartite state ρ_AB, it satisfies\n\n    E_D,→(ρ_AB) ≤E_ rev^u(ρ_AB) := [1-2^-_max,(ρ_AB)]·∑_iλ_i S(B)_ψ_i,\n\nwhere ω_AB=∑_iλ_i |ψ_i⟩⟨ψ_i| is the spectral decomposition of the ADG-squeezed state ω_AB of ρ_AB.\n\nCorollary <ref> is followed by the fact that E_F(ω_AB) has a trivial upper bound as E_F(ω_AB) ≤∑_iλ_i S(B)_ψ_i. We note that any other good upper bound on the entanglement of formation can also be applied to Theorem <ref>. In particular, the bound E_ rev^u(ρ_AB) is efficiently computable since _max,(ρ_AB) and 2^-_max,(ρ_AB) can be efficiently computed via an SDP. By Slater’s condition <cit.>, the following two optimization programs satisfy the strong duality, and both evaluate to 1-2^-_max,(ρ_AB). We denote P_BE as a permutation operator on the system B and E and remain the derivation of the dual program in Appendix <ref>.\n\n    Primal Program\n    min_ω_AB, τ_AB, τ_ABE    [ω_AB],\n     s.t.    ρ_AB =ω_AB+τ_AB, \n        ω_AB≥ 0, τ_AB≥ 0, τ_ABE≥ 0,\n        _E[τ_ABE] = _B[τ_ABE] = τ_AB,\n       Dual Program\n    max_M_AB,N_AB,K_AE    [M_ABρ_AB],\n     s.t.     M_AB≤ I_AB, \n         M_AB+N_AB+K_AB≤ 0,\n         N_AB⊗ I_E +P_BE(K_AB⊗ I_E)P_BE^†≥ 0.\n\n\nIt is worth mentioning that this new bound is related to the bound E_ DA(·) proposed in <cit.> utilizing the convexity of E_D,→(·) on decomposing a state into degradable and anti-degradable parts. Remarkably, such decomposition is challenging to construct since the degradable state set is not necessarily convex. Thus it is difficult to compute E_ DA(·) in <cit.>  in practice due to the hardness of tracking all possible decompositions. Whereas, E_ rev^u(ρ_AB) overcomes this difficulty and is efficiently computable. It outperforms the known upper bounds for many maximally entangled states under practical noises in a high-noise region, as shown in subsection <ref>. Furthermore, our method is flexible in selecting other decomposition strategies, i.e., the object functions in the SDP, other than trivially calculating the ratio at the sub-state decomposition.\n\n\n\n §.§ Continuity bounds of the one-way distillable entanglement\n\nNote that the insight of the bound above is considering the distance of a given state between the anti-degradable states set. With different distance measures, the authors in <cit.> derived continuity bounds on quantum capacity in terms of the (anti)degradability of the channel. Thus for self-contained, we introduce some distance measures between a state and the set  and prove the continuity bounds for the state version as a comparison with E_ rev^u(ρ_AB).\n\n\nLet ρ_AB be a bipartite quantum state, the anti-degradable set distance is defined by\n\n    d_ set(ρ_AB) := min_σ_AB∈ ADG1/2ρ_AB - σ_AB_1,\n\nwhere the minimization ranges over all anti-degradable states on system AB. \n\nAnalogous to the anti-degradable set distance, one also has the anti-degradable map distance as follows.\n\nLet ρ_AB be a bipartite quantum state with purification ϕ_ABE, the anti-degradable map distance is defined by\n\n    d_ map(ρ_AB):= min_𝒟:E→ B1/2ρ_AB - 𝒟(ρ_AE)_1\n    ,\n\nwhere ρ_AE = _B(ϕ_ABE) and the minimization ranges over all CPTP maps 𝒟.\n\n\nBoth parameters can be computed via SDP, ranging from [0,1], and are equal to 0 iff ρ_AB is anti-degradable. Similar to the idea in <cit.> for channels and the proof techniques in <cit.>, we utilize the continuity bound of the conditional entropy in Lemma <ref> proved by Winter <cit.> to derive two continuity upper bounds on the one-way distillable entanglement, concerning the distance measures above. The proofs can be found in Appendix <ref>. We denote h(p)=-plog p - (1-p)log(1-p) as the binary entropy and g(p):= (1+p)h(p/1+p) as the bosonic entropy. \n\n\nFor any bipartite state ρ_AB with an anti-degradable set distance ε_ set, it satisfies\n\n    E_D,→(ρ_AB) ≤ E_ SCB(ρ_AB) := 2ε_ setlog(|A|) + g(ε_ set).\n\n\n\nFor any bipartite state ρ_AB with an anti-degradable map distance ε_ map, it satisfies\n\n    E_D,→(ρ_AB) ≤ E_ MCB(ρ_AB) := 4ε_ maplog(|B|) + 2g(ε_ map).\n\n\n\n\n\n §.§ Examples of less-entangled states\n\nWe now compare the performance of different continuity bounds and the Rains bound with E_ rev^u(·) by some concrete examples. Due to noise and other device imperfections, one usually obtains some less entangled states in practice rather than the maximally entangled ones. Such a disturbance can be characterized by some CPTP maps appearing in each party. Thus for the task of the distillation of the maximally entangled states under practical noises, we consider Alice and Bob are sharing pairs of maximally entangled states affected by bi-local noisy channels, i.e.,\n\n    ρ_A'B' = _A→ A'⊗_B→ B'(Φ_AB).\n\n\n\n\n\n\n  \nQubit system Suppose Alice's qubit is affected by the qubit amplitude damping channel with Kraus operators\nK_0 = |0⟩⟨0| + √(1-γ)|1⟩⟨1|, K_1 = √(γ)|0⟩⟨1|, and Bob's qubit is affected by the depolarizing channel (ρ) = (1-p)ρ + p I_2/2. Set γ = 0.1 and the noise parameter of depolarizing noise varies in the range p∈[0.15,0.3]. E_D,→(ρ_A'B') has upper bounds as functions of p shown in Fig. <ref> (a).\n\n\n\n  \nQutrit system For the system with a dimension d>2, we consider the multilevel versions of the amplitude damping channel (MAD) <cit.> as a local noise for Alice. The Kraus operators of a MAD channel in a d-dimensional system are defined by\n\n    K̂_i j   ≡√(γ_j i)|i⟩⟨j|,   ∀ i, j  s.t.  0 ≤ i ≤ d-1, \n    K̂_0    ≡|0⟩⟨0|+ ∑_1 ≤ j ≤ d-1√(1-ξ_j)|j⟩⟨j|,\n\nwith γ_j i real quantities describing the decay rate from the j-th to the i-th level that fulfill the conditions\n\n    0 ≤γ_j i≤ 1,    ∀ i, j  s.t.  0 ≤ i<j ≤ d-1, \n    ξ_j ≡∑_0 ≤ i<jγ_j i≤ 1,    ∀ j=1, ⋯, d-1.\n\nSuppose Alice qutrit is affected by a MAD channel with γ_10 = γ_20 = 0.1,  γ_21 = 0. Bob's qutrit is affected by a qutrit depolarizing channel with the noise parameter p. Then E_D,→(ρ_A'B') has upper bounds as functions of p shown in Fig. <ref> (b).\n\n\n\n  \nQudit system For the qudit system, we consider Alice's qudit is affected by a MAD channel with d=4 defined in Eq. (<ref>) and Eq. (<ref>), where γ_10 = γ_20 = γ_30 = γ_21 = 0.1, γ_31 = γ_32 = 0.\nLet Bob's qudit be affected by a qudit depolarizing channel with noise parameter p, then E_D,→(ρ_A'B') has upper bounds as functions of p shown in Fig. <ref> (c).\n\n\n\n  \nNoisy Bell state Specifically for a Bell state destroyed by bi-local depolarizing noises, i.e., ρ_A'B'=_A→ A'⊗_B→ B' (Φ_AB), we give an analytical upper bound on E_D,→(ρ_A'B') as shown in Proposition <ref>. \n\nLet Φ_AB be a Bell state and _A→ A', _B→ B' be depolarizing channels on system A and B, respectively. The state ρ_A'B'=_A→ A'⊗_B→ B' (Φ_AB) either is anti-degradable with E_D,→(ρ_A'B')=0 or satisfies\n\n    2^-_max,(ρ_A'B') =3(p_A + p_B - p_Ap_B)\n\nand \n\n    E_D,→(ρ_A'B') ≤ 1 - 3(p_A + p_B - p_Ap_B),\n\nwhere p_A, p_B are noise parameters of _A→ A' and _B→ B', respectively.\n\n\nIn the beginning, we note that if 1 - 3(p_A + p_B - p_Ap_B)≤ 0, the state ρ_A'B' is anti-degradable according to Lemma <ref>, which gives E_D,→(ρ_A'B')=0. Then if 1 - 3(p_A + p_B - p_Ap_B)>0,\nwe will first prove 2^-_max,(ρ_A'B')≥ 3(p_A + p_B - p_Ap_B) use the primal SDP in (<ref>). We show that {ω̂_A'B',τ̂_A'B'E} is a feasible solution to the primal SDP, where\n\n    ω̂_A'B' = 1-3(p_A+p_B-p_Ap_B)/2(|00⟩⟨00| + |11⟩⟨11|+ |00⟩⟨11| + |11⟩⟨00|),\n\n\n    τ̂_A'B'E = (\n        [ 4ζ  0  0  0  0 2ζ 2ζ  0;  0  ζ  ζ  0  0  0  0 2ζ;  0  ζ  ζ  0  0  0  0 2ζ;  0  0  0  0  0  0  0  0;  0  0  0  0  0  0  0  0; 2ζ  0  0  0  0  ζ  ζ  0; 2ζ  0  0  0  0  ζ  ζ  0;  0 2ζ 2ζ  0  0  0  0 4ζ;    ]),\n\nwith ζ = p_A + p_B - p_A p_B/4. When the Bell state shared by Alice and Bob is affected by bi-local depolarizing channels _A→ A' and _B→ B' with noise parameters p_A and p_B, respectively, the resulting state is\n\n    ρ_A'B' =   _A→ A'⊗_B→ B' (Φ_AB)\n    \n        =    2-(p_A+p_B)+p_Ap_B/4(|00⟩⟨00| + |11⟩⟨11|)+ p_A+p_B-p_Ap_B/4(|01⟩⟨01| + |10⟩⟨10|)\n        + 1-(p_A+p_B)+p_Ap_B/2(|00⟩⟨11|+|11⟩⟨00|).\n\nThen the unnormalized state τ̂_A'B' = ρ_A'B' - ω̂_A'B' is\n\n    τ̂_A'B' =   5(p_A+p_B-p_Ap_B)/4(|00⟩⟨00| + |11⟩⟨11|)+ p_A+p_B-p_Ap_B/4(|01⟩⟨01| + |10⟩⟨10|)\n       + (p_A+p_B-p_Ap_B)(|00⟩⟨11|+|11⟩⟨00|).\n\nIt is straightforward to check that τ̂_A'B'E≥ 0 and _E[τ̂_A'B'E] = _B[τ̂_A'B'E] = τ̂_A'B'.  Thus, we have proven that {ω̂_A'B',τ̂_A'B'E} is a feasible solution to the primal SDP, implying that\n\n    1 - 2^-_max,(ρ_A'B')≤[ω̂_A'B'] = 1 - 3(p_A + p_B - p_Ap_B)\n\nand 2^-_max,(ρ_A'B')≥ 3(p_A + p_B - p_A p_B).\n\nSecond, we will use the dual SDP in (<ref>) to prove 2^-_max,(ρ_A'B')≤ 3(p_A + p_B - p_Ap_B). We show that { M_AB, N_AB, K_AB} is a feasible solution to the dual problem, where\n\n    M_AB = (\n        [ -1  0  0  2;  0 -3  0  0;  0  0 -3  0;  2  0  0 -1;    ]),\n        N_AB = K_AB = -1/2M_AB.\n\nTo check the constraints, we have M_AB≤ I_AB, M_AB + N_AB + K_AB = 0 and N_AB⊗ I_E + P_BE(K_AB⊗ I_E)P_BE^†≥ 0. By direct calculation, we have [M_ABρ_A'B'] = 1 - 3(p_A + p_B-p_A p_B). Thus, we have proven {M_AB, N_AB, K_AB} is a feasible solution, which implies that\n\n    1 - 2^-_max,(ρ_A'B')≥[M_ABρ_A'B'] = 1 - 3(p_A + p_B-p_A p_B),\n\nand 2^-_max,(ρ_A'B')≤ 3(p_A + p_B - p_A p_B). Combining the dual part with the primal part, we arrive at\n\n    2^-_max,(ρ_A'B') = 3(p_A + p_B - p_Ap_B)\n\nSince the normalized state ω_A'B' of ω̂_A'B' is a maximally entangled state with E_D,→(ω_A'B')=1, we have E_D,→(ρ_A'B') ≤ 1 - 3(p_A + p_B-p_A p_B).\n\n\nAs shown in Fig <ref>, we plot \nfour different upper bounds and the Hashing bound in different dimensional systems in a high-noise region. We can see that E_ rev^u(ρ_AB) is lower than the other two continuity bounds and the Rains bound in the orange dotted line, acting the tightest among all upper bounds. We demonstrate the advantage of our analytic bound in Proposition <ref> by comparing it with the continuity bounds and the Rains bound in Fig. <ref> (d), where the depolarizing noise parameter p_B is set to 0.1 and the noise parameter p_A is varied.\n\n\n\n\n §.§ Extending the method to the two-way distillable entanglement\n\nSimilar to the reverse max-relative entropy of unextendible entanglement, for a given bipartite state ρ_AB, we introduce the reverse max-relative entropy of NPT entanglement as\n\n    _max,(ρ_AB) := min_τ∈D_max(τ_AB||ρ_AB),\n\nwhere the minimization ranges over all  states. Based on the convexity of E_D,↔(·) on decomposing a state into the maximally correlated (MC) states and the PPT states <cit.> (see Appendix <ref> for more details), the reverse max-relative entropy of NPT entanglement can be applied to derive an upper bound on the two-way distillable entanglement as Theorem <ref>.\n\nFor any bipartite state ρ_AB, it satisfies\n\n    E_D,↔(ρ_AB) ≤ E_ rev^npt(ρ_AB):=[1-2^-_max,(ρ_AB)]· E_F(ω_AB),\n\nwhere ω_AB is the PPT-squeezed state of ρ_AB and _max,(·) is the reverse max-relative entropy of NPT entanglement.\n\nIt also follows an efficiently computable relaxation as E_ rev^npt(ρ_AB)= [1-2^-_max,(ρ_AB)] ∑_iλ_i S(B)_ψ_i, where ω_AB=∑_iλ_i |ψ_i⟩⟨ψ_i| is the spectral decomposition of the PPT-squeezed state ω_AB of ρ_AB. \n\nIn fact, E_ rev^npt(·) can be interpreted as an easily computable version of the bound E_ MP(·) in <cit.>, utilizing the convexity of E_D,↔(ρ_AB) on the convex decomposition of ρ_AB into MC states and PPT states. Since the set of all MC states is not convex, tracking all possible decompositions to compute E_ MP(·) is generally hard. However, E_ rev^npt(·) is efficiently computable by SDP and tightens the upper bound of the example states illustrated in <cit.>, whose details can be found in Appendix <ref>. We note that R(ρ_AB) ≤ E_ MP(ρ_AB)≤E_ rev^npt(ρ_AB) where R(·) is the Rains bound for the two-way distillable entanglement. Nevertheless, E_ rev^npt(·) connects the reverse max-relative entropy of NPT entanglement with the entanglement of formation, and we believe such connection would shed light on the study of other quantum resource theories as well. \n\n\n\n\n§ APPLICATIONS ON QUANTUM CHANNEL CAPACITY\n\n\nFor a general quantum channel _A→ B, its quantum capacity has a regularized formula proved by Lloyd, Shor, and Devetak <cit.>:\n\n    Q() = lim_n→∞1/nQ^(1)(^ n),\n\nwhere Q^(1)():= max_|ϕ⟩_A'A I_c(A'⟩ B)_()(ϕ) is the channel coherent information. Similar to the one-way distillable entanglement of a state, the regularization in Eq. (<ref>) makes the quantum capacity of a channel intractable to compute generally. Substantial efforts have been made to establish upper bounds. One routine is inspired by the Rains bound in entanglement theory <cit.>. Tomamichel et al. introduced Rains information <cit.> for a quantum channel as an upper bound on the quantum capacity. Then some efficiently computable relaxations or estimations are given in <cit.>. Another routine is to consider the (anti)degradability of the quantum channels and to construct flag extensions, which gives the currently tightest upper bound for quantum channels with symmetry or known structures <cit.>. \n\nA channel _A→ B is called degradable if there exits a CPTP map _B→ E such that ^c = ∘, and is called anti-degradable if there exits a CPTP map _E→ B such that = ∘^c. It is known that  is (anti)degradable if and only if its Choi state J_ is (anti)degradable. The quantum capacity of an anti-degradable channel is zero and the coherent information of a degradable channel is additive which leads to Q() = Q^(1)(). Also, the quantum capacity admits convexity on decomposing a channel into a convex combination of degradable channels and anti-degradable channels <cit.> which can give a simple upper bound on Q(). Concerning the (anti)degradability of a channel, the authors in <cit.> called a channel ε-degradable channel if there is a CPTP map _B→ E such that || ^c - ∘||_♢≤ 2ε. A channel is called ε-anti-degradable channel if there is a CPTP map _E→ B such that ||  - ∘^c||_♢≤ 2ε. Based on these, one has continuity bounds of the quantum capacity as follows.\n\n    Given a quantum channel _A → B, if it is -degradable, then it satisfies Q() ≤ Q^(1)() + log(d_E - 1) + h() + 2log d_E + g(). If _A→ B is -anti-degradable, it satisfies Q() ≤log(|B|-1) + 2log|B| + h() + g().\n\n\nWith a similar spirit of the reverse max-relative entropy of unextendible entanglement in Eq. (<ref>), for a quantum channel _A→ B, we define the reverse max-relative entropy of anti-degradability of the channel as\n\n    _max,(_A→ B) := min_'_A→ B∈_D_max('_A→ B||_A→ B),\n\nwhere _ is the set of all anti-degradable channels and the max-relative entropy of '_A→ B with respect to _A→ B is defined by\n\n    D_max('_A→ B||_A→ B):=  inf{λ∈ℝ: J_AB^'≤ 2^λ J_AB^}.\n\nIf there is no such a channel '_A→ B∈_ that satisfies J_AB^'≤ 2^λ J_AB^, _max,(_A→ B) is set to be 0. Similar to the state case, _max,(_A→ B) has a geometric implication analogous to the distance between _A→ B to the set of all anti-degradable channels. We can introduce the -squeezed channel of _A→ B as follows.\n\nFor a quantum channel _A→ B and the anti-degradable channel set _, if _max,() is non-zero, the -squeezed channel of _A→ B is defined by\n\n    _A→ B = _A→ B - 2^-_max,()·^'_A→ B/1-2^-_max,()\n\nwhere ^'_A→ B is the closest anti-degradable channel to _A→ B in terms of the max-relative entropy, i.e., the optimal solution in Eq. (<ref>). If _max,() is zero, the -squeezed channel of _A→ B is itself.\n \nNotably, _max,(), or 2^-_max,() equivalently, can be efficiently computed via SDP. The following two optimization programs satisfy the strong duality, and both evaluate to 1-2^-_max,(). We remain the derivation of the dual program in Appendix <ref>. \n\n    Primal Program\n    min_Γ_AB^, Γ_AB^', γ_ABE   [Γ_AB^],\n     s.t.     J_AB^ = Γ_AB^ + Γ_AB^', \n        Γ_AB^≥ 0, Γ_AB^'≥ 0, γ_ABE≥ 0,\n        _B[Γ_AB^'] = [Γ_AB^']/d_A · I_A,\n        _E[γ_ABE] = _B[γ_ABE] = Γ_AB^', \n       Dual Program\n    max_M_AB,N_AB,K_AB,R_A   [M_AB J_AB^],\n     s.t.     M_AB≤ (1- R_A/d_A)I_AB+R_A⊗ I_B, \n         M_AB+N_AB+K_AB≤ 0,\n         N_AB⊗ I_E +P_BE(K_AB⊗ I_E)P_BE^†≥ 0.\n\n\nThe conceptual idea we used here is similar to that for the state case in Eq. (<ref>) and Definition <ref>, which is to squeeze or isolate out as much part of anti-degradable channel as possible via a convex decomposition of the original channel. The insight here is that one can ignore the contribution from the anti-degradable part for the quantum capacity, and the quantum capacity admits convexity on the decomposition into degradable and anti-degradable parts. In this way, the following Theorem <ref> gives an upper bound Q_ sqz() for the quantum capacity of .\n\nGiven a quantum channel _A → B, if it has an ADG-squeezed channel _A→ B, we denote\n_A→ BB' as an extended channel of _A→ B such that _B'[_A→ BB'(ρ_A)] = _A→ B(ρ_A), ∀ρ_A∈(_A). Then it satisfies\n\n    Q() ≤ Q_ sqz() := [1-2^-_max,()]·min{ Q^(1)() |  _A→ BB'},\n\nwhere the minimization is over all possible extended channels of S_A→ B. If there is no such a degradable _A→ BB' exists, the value of this bound is set to be infinity.\n\n\nBy the definition of the -squeezed channel of _A→ B, we have\n\n    _A→ B = [1-2^-_max,()] ·_A→ B + 2^-_max,()·'_A→ B\n\nwhere '_A→ B is anti-degradable. We write an extended channel of '_A→ B as '_A→ BB'(ρ_A) = _A→ B(ρ_A) |0⟩⟨0|_B', which is obviously anti-degradable. Then we can construct a quantum channel _A→ BB' as\n\n    _A→ BB' = [1-2^-_max,()] ·_A→ BB' + 2^-_max,()·'_A→ BB',\n\nsuch that _B'[_A→ BB'(ρ_A)] = _A→ B(ρ_A) for any state ρ_A and _A→ BB' is degradable. This means after discarding the partial environment B', the receiver can obtain the original quantum information sent through _A→ B. In this case,  can certainly convey more quantum information than the , i.e., Q()≤ Q(). Note that the quantum capacity admits convexity on the decomposition into degradable parts and anti-degradable parts <cit.>. We conclude that\n\n    Q()≤ Q()    ≤ [1-2^-_max,()] · Q() + 2^-_max,()· Q(')\n        = [1-2^-_max,()] · Q^(1)(),\n\nwhere the equality is followed by the quantum capacity is additive on degradable channels and is zero for anti-degradable channels. Considering the freedom of the choice of _A→ BB', we obtain\n\n    Q_ sqz() := [1-2^-_max,()] ·min{ Q^(1)() | _A→ BB'}\n\nas an upper bound on Q().\n\n\nTheorem <ref> can be seen as a channel version of Theorem <ref>. However, in order to utilize the convexity of the quantum capacity after the squeezing process, it is challenging to decompose the ADG-squeezed channel into the sum of degradable ones. An alternative approach here is to use the idea of the extension channel. For the qubit channels specifically, this bound is efficiently computable and effective, as shown in subsection <ref>.\n\n\n\n\n §.§ Quantum capacity of qubit channels\n\nFor a quantum channel with dimension two in both input and output systems, we prove that the ADG-squeezed channel is always degradable. Thus, we give an efficiently computable upper bound on the quantum capacity using the idea of the reverse max-relative entropy of anti-degradability.\n\n    For any qubit channel _A→ B, it is either anti-degradable or satisfies\n    \n    Q() ≤ [1-2^-_max,()] ·max_p ∈[0,1] I_c(p|0⟩⟨0|+(1-p)|1⟩⟨1|, _A→ B),\n\n    where I_c(ρ, 𝒩) ≡ H(𝒩(ρ))-H(𝒩^c(ρ)) and _A→ B is the ADG-squeezed channel of _A→ B.\n\n\nBy the definition of the -squeezed channel of _A→ B, we have\n\n    _A→ B = [1-2^-_max,()] ·_A→ B + 2^-_max,()·'_A→ B\n\nwhere '_A→ B is anti-degradable and _A→ B is not anti-degradable. If _A→ B is also not degradable, we can further decompose _A→ B into = c _0 +(1-c)S_1 such that _0 is degradable and _1 is anti-degradable since the extreme points of the set of all qubit channels have been shown to be degradable or anti-degradable channels <cit.>. This conflicts with the definition of 2^-_max,(), which implies _A→ B is degradable. Thus,\n\n    Q()    ≤ [1-2^-_max,()] · Q() + 2^-_max,()· Q(')\n       = [1-2^-_max,()] · Q^(1)()\n       =[1-2^-_max,()] ·max_p ∈[0,1] I_c(p|0⟩⟨0|+(1-p)|1⟩⟨1|, _A→ B).\n\nNote that the last equality is because _A→ B is degradable, and diagonal input states outperform non-diagonal states during the optimization of the channel coherent information <cit.>.\n\n\n\n\n\n  \nMixed unitary channels \nTo compare the performance of our method with some best-known computable bounds, e.g., the continuity bound in Theorem <ref> and the bound R̂_α <cit.> generalized from the max-Rain information <cit.>, we consider the mixed unitary channel _A→ B(·) as follows:\n\n    (ρ) = ∑_i=0^k p_i U_i ρ U_i^†,\n\nwhere ∑_i=0^k p_i= 1 and U_i are unitary operators on a qubit system. In specific, we choose some fixed set of parameters and sample 1000 channels with randomly generated unitaries according to the Haar measure. We compute the distance between Q_ sqz and other bounds, then have statistics on the distribution of these channels according to the distance value. The distribution results are depicted in Fig. <ref> where the purple region corresponds to the cases Q_ sqz is tighter, and the pink region corresponds to the cases Q_ sqz is looser. We can see that in Fig. <ref>(a) and Fig. <ref>(c), Q_ sqz always outperforms the continuity bound of anti-degradability and in Fig. <ref>(b) and Fig. <ref>(d), our bound is tighter than R̂_α(10) for many cases.\n\n\n\n\n\n  \nPauli channels A representative qubit channel is the Pauli channel describing bit-flip errors and phase-flip errors with certain probabilities in qubits. A qubit Pauli channel Λ(·) is defined as:\n\n    Λ(ρ) = p_0 ρ + p_1 Xρ X + p_2 Yρ Y +p_3 Zρ Z,\n\nwhere X,Y,Z are the Pauli operators and ∑_i=0^3 p_i = 1 are probability parameters. Note that for the quantum capacity, we only need to consider the cases where p_0 dominates. Since if, for example, bit flip error X happens with probability larger than p_0, one can first apply a X flip, mapping that channel back into the case where p_0>p_1. After utilizing our method on Pauli channels, the ADG-squeezed parameter is characterized in Proposition <ref>,  whose proof can be found in Appendix <ref>. Thus, combined with Proposition <ref>, we can recover the no-cloning bound <cit.> on the quantum capacity of qubit Pauli channels.\n\nFor a qubit Pauli channel Λ(·) with p_0≥ p_i>0 (i=1,2,3), it is either anti-degradable or satisfies\n\n    2^-_max,(Λ) = (√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2\n\nwith an ADG-squeezed channel as the identity channel.\n\n\n\nFor a qubit Pauli channel Λ(·), its quantum capacity is either vanishing or satisfies \n\n    Q(Λ) ≤ \n            1-(√(p_1)+√(p_2))^2 -(√(p_2)+√(p_3))^2-(√(p_1)+√(p_3))^2\n\n\n\nOne recent work <cit.> studies the capacities of a subclass of Pauli channels called the covariant Pauli channel, where the parameters are set p_1 = p_2 with p_0+2p_1+p_3=1, i.e., Λ_ cov(ρ) = p_0 ρ + p_1 (Xρ X + Yρ Y)+ p_3 Zρ Z. Applying Theorem <ref> on the covariant Pauli channels, we can bound their quantum capacity as follows.\n\nFor a covariant Pauli channel Λ_ cov(·), it is either anti-degradable with a zero quantum capacity or satisfies Q(Λ_ cov)≤ Q_ sqz(Λ_ cov), where \n\n    Q_ sqz (Λ_ cov) = \n             3p_0 + p_3 -√(8(p_3-p_0p_3-p_3^2))-2.\n\n\nIn Fig. <ref>, we compare our bound with the upper bounds given in <cit.> and the continuity bound of anti-degradability in Theorem <ref>. It can be seen that our bound in the orange line, coinciding with the no-cloning bound, outperforms previous bounds, and thus can better characterize the quantum capacity of Λ_ cov(·) when it is close to being anti-degradable.\n\n\n\n\n§ CONCLUDING REMARKS\n\n\n\n\n\nWe have introduced a resource measure called reverse divergence of resources for quantum states. Specifically, by choosing target free state sets and max-relative entropy, we have employed the reverse max-relative entropy of entanglement which is also related to the \"weight of resource\" in general resource theory. From a conceptual and technical side, these concepts help us to quantify how much useless entanglement we can squeeze out from a state or a channel, which is meaningful in the distillable entanglement and the quantum capacity, respectively. As these quantities can be efficiently determined by semidefinite programming, they are useful in deriving efficiently computable upper bounds on the distillable entanglement and the quantum capacity. \n\n\nTo better explore entanglement distillation, we have derived different continuity bounds on the one-way distillable entanglement in terms of the anti-degradability of the state. In particular, our bound derived from the reverse max-relative entropy of unextendible entanglement outperforms the continuity bounds and the Rains bound in estimating the one-way distillable entanglement for the maximally entangled states under certain noises of interest. We also introduced the reverse max-relative entropy of NPT entanglement and established connections to prior results on the two-way distillable entanglement. Furthermore, we have established an upper bound on the quantum capacity based on the reverse max-relative entropy of anti-degradability of quantum channels.  Our method delivers improved results for random mixed unitary qubit channels, making it an improved benchmark for the quantum capacities of these noisy channels. Also, the analytical bound obtained from our method also recovers the no-cloning bound on Pauli channels <cit.>.\n\n\n\n\nThese results open a novel way to connect valuable quantum resource measures with quantum communication tasks. \nExcept for the existing applications of the reverse max-relative entropy of resources <cit.>, we expect the reverse divergence of resources will find more applications in quantum resource theories in both asymptotic and non-asymptotic regimes <cit.>. One may further consider choosing other divergences, e.g., the sandwiched Rényi relative entropy to solve problems in other tasks possibly. In addition, the reverse divergence of resources may potentially be helpful to the study of other quantum resource theories, including asymmetry <cit.>, thermodynamics <cit.>, coherence <cit.>, nonlocality <cit.>, non-stabilizerness <cit.>, and non-Gaussianity <cit.>. It is also an interesting problem to explore the idea of squeezing useless resources to estimate resource purification rates in quantum resource theories.\n\n\n\n§ ACKNOWLEDGEMENTS.\n \nPart of this work was done when C. Z. and C. Z. were research interns at Baidu Research.\nWe would like to thank Bartosz Regula and Ludovico Lami for helpful comments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nequationsection\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ PROPERTIES OF THE REVERSE MAX-RELATIVE ENTROPY OF RESOURCES\n\n\n\n\nFor bipartite states ρ_0 and ρ_1, it satisfies\n\n    _max,ℱ(ρ_0) + _max,ℱ(ρ_1)  ≥_max,ℱ(ρ_0⊗ρ_1).\n\n\n\nSince the max-relative entropy is additive, w.r.t, tensor products, we have\n\n    min_τ' ∈ℱD_max(τ' || ρ_0ρ_1)\n       ≤min_τ_0,τ_1 ∈ℱ D_max(τ_0τ_1 || ρ_0 ρ_1)\n       = min_τ_0 ∈ℱ D_max(τ_0 || ρ_0) + min_τ_1 ∈ℱ D_max(τ_1 || ρ_1),\n\nwhich completes the proof.\n\n\n\n\nLet Φ be a one-way LOCC, then for a bipartite state ρ, it satisfies\n\n    _max,ℱ[Φ(ρ)] ≤_max,ℱ(ρ).\n\n\n\nThis can be directly obtained by the monotonicity of the max-relative entropy with respect to the action of channels.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n§ DUAL SDP FOR THE SQUEEZED PARAMETER OF STATES AND CHANNELS\n\nThe primal SDP for calculating 2^-_max,(ρ_AB) of the state ρ_AB can be written as:\n\n\n    1-2^-_max,(ρ_AB) = min_ω_AB, τ_AB, τ_ABE   [ω_AB],\n     s.t.    ρ_AB =ω_AB+τ_AB, \n        ω_AB≥ 0, τ_AB≥ 0, τ_ABE≥ 0,\n        _E[τ_ABE] = _B[τ_ABE] = τ_AB,\n\n\nwhere Eq. (<ref>) corresponds to the anti-degradable condition of τ_AB. The Lagrange function of the primal problem is\n\n    L(ω_AB,τ_AB,τ_ABE,M, N, K)\n       = [ω_AB] + ⟨ M, ρ_AB-ω_AB-τ_AB⟩\n          + ⟨ N, _E[τ_ABE]-τ_AB⟩ + ⟨ K, _B[τ_ABE]-τ_AB⟩\n       = ⟨ M, ρ_AB⟩ + ⟨ I-M, ω_AB⟩ + ⟨ -M-N-K, τ_AB⟩\n          + ⟨ N⊗ I_E + P_BE(K_AB⊗ I_E)P_BE^†, τ_ABE⟩,\n\nwhere M_AB, N_AB, K_AB are Lagrange multipliers and P_BE is the permutation operator between B and E. The corresponding Lagrange dual function is \n\n    g(M,N,K) = inf_ω_AB,τ_AB, τ_ABE≥ 0 L(ω_AB,τ_AB,τ_ABE,M, N, K).\n\nSince ω_AB≥ 0, τ_AB≥ 0, τ_ABE≥ 0, it must hold that I-M_AB≥ 0, -M-N-K≥ 0, N⊗ I + P_BE(K ⊗ I)P_BE^†≥ 0. Thus the dual SDP is\n\n    max_M_AB,N_AB,K_AE   [M_ABρ_AB],\n     s.t.     M_AB≤ I_AB, \n         M_AB+N_AB+K_AB≤ 0,\n         N_AB⊗ I_E +P_BE(K_AB⊗ I_E)P_BE^†≥ 0.\n\n\nThe primal SDP for calculating 2^-_max,() of the channel _A→ B is:\n\n\n    1-2^-_max,() = min_Γ_AB^, Γ_AB^', γ_ABE   [Γ_AB^],\n     s.t.     J_AB^ = Γ_AB^ + Γ_AB^', \n        Γ_AB^≥ 0, Γ_AB^'≥ 0, γ_ABE≥ 0,\n        _B[Γ_AB^'] = [Γ_AB^']/d_A · I_A,\n        _E[γ_ABE] = _B[γ_ABE] = Γ_AB^',\n\n\nwhere Eq. (<ref>) corresponds to the anti-degradable condition of the unnormalized Choi state Γ_AB^'. The Lagrange function of the primal problem is\n\n    L(Γ_AB^, Γ_AB^', γ_ABE,M, N, K, R)\n       = [Γ_AB^] + ⟨ M, J_AB^-Γ_AB^-Γ_AB^'⟩ + ⟨ N, _E[γ_ABE]-Γ_AB^'⟩ + ⟨ K, _B[γ_ABE]-Γ_AB^'⟩\n          + ⟨ R, _B[Γ_AB^]-[Γ_AB^]/d_A · I_A⟩\n       = ⟨ M, J_AB^⟩ + ⟨ (1- R/d_A)I-M+R⊗ I_B, Γ_AB^⟩ + ⟨ -M-N-K, Γ_AB^'⟩\n          + ⟨ N⊗ I_E + P_BE(K_AE⊗ I_B)P_BE^†, γ_ABE⟩,\n\nwhere M_AB, N_AB, K_AB are Lagrange multipliers and P_BE is the swap operator between the system B and E. The corresponding Lagrange dual function is \n\n    g(M,N,K) = inf_Γ_AB^,Γ_AB^', γ_ABE≥ 0 L(Γ_AB^,Γ_AB^',γ_ABE,M, N, K).\n\nSince Γ_AB^≥ 0, Γ_AB^'≥ 0, γ_ABE≥ 0, it must hold that \n\n    (1- R_A/d_A)I_AB-M_AB+R_A⊗ I_B    ≥ 0\n    \n        -M_AB-N_AB-K_AB   ≥ 0\n    \n        N_AB⊗ I_E + P_BE(K_AB⊗ I_E)P_BE^†   ≥ 0.\n\nThus the dual SDP is\n\n    max_M_AB,N_AB,K_AB,R_A   [M_AB J_AB^],\n     s.t.     M_AB≤ (1- R_A/d_A)I_AB+R_A⊗ I_B, \n         M_AB+N_AB+K_AB≤ 0,\n         N_AB⊗ I_E +P_BE(K_AB⊗ I_E)P_BE^†≥ 0.\n\n\n\n\n\n§ TWO-WAY DISTILLABLE ENTANGLEMENT\n\nWe first start with the definition of the maximally correlated (MC) state. \n\nA bipartite state ρ_A B on ℂ^d ×ℂ^d is said to be maximally correlated (MC), if there exist bases {|i⟩_A}_i=0^d-1 and {|i⟩_B}_i=0^d-1 such that\n\n    ρ_A B=∑_i, j=0^d-1α_i j|i⟩⟨j|_A ⊗|i⟩⟨j|_B,\n\nwhere (α_i j) is a positive semidefinite matrix with trace 1 .\n\nWe note that every pure state is an MC state. Then, by the following lemma, one can easily arrive at the upper bound in Theorem <ref>.\n\n    The two-way distillable entanglement is convex on convex combinations of MC and PPT states.\n\n\nWe recall the example state given in <cit.>. Consider a d dimensional Hilbert space, the generalized Pauli operators X and Z are defined by their action on a computational basis {|k⟩}_k=0^d-1 as:\n\n    X|k⟩:=|k+1( d)⟩   Z|k⟩:=ω^k|k⟩,\n\nwhere ω:=exp (2 π i / d) is a d-th root of unity. The generalized Pauli operators satisfy X Z=ω Z X. Then the generalized Bell basis {|Φ_n, m⟩}_n, m=0, …, d-1 are defined as\n\n    |Φ_n, m⟩:=(I_d ⊗ X^m Z^n)|Φ⟩,\n\nwhere |Φ⟩:=1/√(d)∑_i=0^d-1|i i⟩. Now set d=3 and denote B={1,6,8}. After numbering |Φ_n,m⟩ = |Φ_3n+m+1⟩, we define the state\n\n    ω_AB = ∑_i,j=1^dα_i,j|Φ_B[i]⟩⟨Φ_B[j]|,\n\nwhere α = |ψ⟩⟨ψ|, |ψ⟩ = 1/3(|0⟩ + |1⟩ + |2⟩).\nThen consider the states of the form\n\n    ρ_AB = (1-p) ω_AB + pτ_AB,\n\nwhere p∈[0,1], the state τ_AB is the following PPT entangled state with a=1/2:\n\n    τ_A B=1/8 a+1(\n        [          a          0          0          0          a          0          0          0          a;          0          a          0          0          0          0          0          0          0;          0          0          a          0          0          0          0          0          0;          0          0          0          a          0          0          0          0          0;          a          0          0          0          a          0          0          0          a;          0          0          0          0          0          a          0          0          0;          0          0          0          0          0          0      1+a/2          0 √(1-a^2)/2;          0          0          0          0          0          0          0          a          0;          a          0          0          0          a          0 √(1-a^2)/2          0      1+a/2 ]).\n\nWe plot the different upper bounds on the two-way distillable entanglement E_D,↔(ρ_AB) in Fig. <ref>. It shows that our bound E_ rev^npt(ρ_AB) is tighter than E_ W and E_ MP as a function of p.\n\n\n\n\n\n\n§ PROOF OF PROPOSITION <REF> AND PROPOSITION <REF>\n\n\n\nFor any states ρ_AB and σ_AB such that 1/2ρ_AB-σ_AB_1 ≤ε≤ 1, it satisfies\n\n    |S(A|B)_ρ - S(A|B)_σ| ≤ 2εlog(|A|) + (1+ε)h(ε/1+ε).\n\n\n\n\n\n\n\nFor any bipartite state ρ_AB with an anti-degradable set distance ε_ set, it satisfies\n\n    E_D,→(ρ_AB) ≤ 2ε_ setlog(|A|) + (1+ε_ set)h(ε_ set/1+ε_ set).\n\n\n\nSince ρ_AB has a anti-degradable set distance ε_ set, we denote σ_AB the anti-degradable state with 1/2ρ_AB - σ_AB_1 ≤ε_ set. Let T:A^n → A'M be an instrument with isometry U_n:A^n → A'MN and denote Δ = 2ε_ setlog(|A|) + (1+ε_ set)h(ε_ set/1+ε_ set). Then we have\n\n\n    E^(1)_D,→(ρ_AB^⊗ n)    = max_U_n I_c(A'⟩ B^n M)_U_n ρ^⊗ n U_n^†\n       = max_U_n - S(A' | B^n M)_U_n ρ^⊗ n U_n^†\n       ≤max_U_n - S(A' | B^n M)_U_n (σρ^⊗ n-1) U_n^† + Δ\n       ≤max_U_n - S(A' | B^n M)_U_n σ^⊗ n U_n^† + nΔ\n        = nΔ,\n\n\nwhere Eq. (<ref>) follows by the fact that\n\n    ρ_0⊗ρ_1 - σ_0⊗σ_1_1 ≤ρ_0 - σ_0_1 + ρ_1 - σ_1_1,\n\nand Lemma <ref>. The inequality in Eq. (<ref>) follows by applying the same argument n times considering σ^ iρ^ n-i for i=1,...,n. After dividing Eq. (<ref>) by n and taking the limit n→∞, we arrive at\n\n    E_D,→(ρ_AB) = lim_n→∞1/nE^(1)_D,→(ρ_AB^⊗ n) ≤Δ.\n\n\n\n\n\n\n\n\nFor any bipartite state ρ_AB with an anti-degradable map distance ε_ map, it satisfies\n\n    E_D,→(ρ_AB) ≤ 4ε_ maplog(|B|) + 2(1+ε_ map)h(ε_ map/1+ε_ map).\n\n\n\n\nLet ϕ_ABE be a purification of ρ_AB, :E→ B be the CPTP map such that 1/2ρ_AB - (ρ_AE)_1 ≤ε_ map with an isometry W:E→ B'G. Let T:A^n → A'M be an instrument with isometry U_n:A^n → A'MN and denote Δ = 2ε_ maplog(|B|) + (1+ε_ map)h(ε_ map/1+ε_ map). For t=1,2,...,n, we can define pure states\n\n    ψ_A^n B^n B'_1 G_1...B'_t G_t E_t+1...E_n^t    = (W_1⊗⋯⊗ W_t) ϕ_ABE^n\n    θ_A' M N B^n B'_1 G_1...B'_t G_t E_t+1...E_n^t    = U_n ψ^t,  ω_A' M N B^n E^n = U_n ϕ_ABE^n\n\nWe further define ρ̂_AB' = (ρ_AE) which shares the same purification with ρ_AB listed above, thus an anti-degradable state. Then for t=n we have θ^n = U_n (W_1⊗⋯⊗ W_n) U_n^†ω, it yields \n\n    I_c(A'⟩ B^n M)_ω   =  I_c(A'⟩ B^n M)_θ^n_A' M N B^n B'^n G^n\n       = S(B^n M)_θ - S(A'B^n M)_θ\n       = S(A' N B'^n G^n)_θ - S(A'B^n M)_θ\n       = S(A' N B'^n G^n)_θ - S(A'B'^n M)_θ\n          + S(A' B'^n M)_θ - S(A' B^n M)_θ\n       = S(G^n|A'B'^n M)_θ + S(A' B'^n M)_θ\n          - S(A' B^n M)_θ\n\nwhere we abbreviate θ = θ^n_A' M N B^n B'^n G^n. Applying the same technique in the proof of Theorem 2.12 in <cit.>, we can bound\n\n    S(A' B'^n M)_θ - S(A' B^n M)_θ≤ nΔ.\n\nConsequently, it follows that\n\n    I_c(A'⟩ B^n M)_ω   ≤ S(G^n|A'B'^n M)_θ  + nΔ\n       ≤ S(G^n|B'^n)_θ  + nΔ\n       = S(G^n B'^n)_θ - S(B'^n)_θ  + nΔ\n       ≤ S(G^n B'^n)_θ - S(B^n)_θ + 2nΔ\n       ≤ S(G^n B'^n)_θ - S(A'M N G^n B'^n)_θ  + 2nΔ\n       ≤ I(A'M N ⟩ G^n B'^n)_θ  + 2nΔ\n       = I(A^n ⟩ B'^n)_ρ̂_AB'^ n  + 2nΔ\n       = n [I(A ⟩ B)_ρ̂_AB'+ 2Δ]\n       = 2nΔ,\n\nwhere the last equality is due to the anti-degradability of ρ̂_AB'. After dividing Eq. (<ref>) by n and taking the limit n→∞, we arrive at\n\n    E_D,→(ρ_AB) = lim_n→∞1/nE^(1)_D,→(ρ_AB^⊗ n) ≤ 2Δ.\n\n\n\n\n\n\n\n\n\n\n\n\n§ PROOF OF PROPOSITION <REF>\n\n\n\nA two qubit state ρ_A B is anti-degradable if and only if,\n\n    Tr(ρ_B^2) ≥Tr(ρ_A B^2)-4 √(det(ρ_A B)).\n\n\n\n\n\n\n\nFor a qubit Pauli channel Λ(·) with p_0≥ p_i>0 (i=1,2,3), it is either anti-degradable or satisfies\n\n    2^-_max,(Λ) = (√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2\n\nwith an ADG-squeezed channel as the identity channel.\n\n\n\nWe first will prove \n    \n    2^-_max,(Λ)≥ (√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2,\n\n    by using the SDP in Eq. (<ref>). We show that \n    Γ_AB^ = α/2(\n        [ 1 0 0 1; 0 0 0 0; 0 0 0 0; 1 0 0 1;   ]),\n is a feasible solution where α = 1-[(√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2]. \nNote that the Choi state of the Pauli channel is\n\n    J_AB^Λ = 1/2(\n        [ p_0 + p_3         0         0   p_0-p_3;         0   p_1+p_2   p_1-p_2         0;         0   p_1-p_2   p_1+p_2         0; p_0 - p_3         0         0   p_0+p_3;           ]),\n\nand the unnormalized state Γ_AB^' = J_AB^Λ - Γ_AB^ is\n\n    Γ_AB^' = 1/2(\n        [ p_0 + p_3 - α             0             0    p_0-p_3- α;             0       p_1+p_2       p_1-p_2             0;             0       p_1-p_2       p_1+p_2             0; p_0 - p_3 - α             0             0    p_0+p_3- α;               ]).\n \nRecalling that p_0 + p_1 + p_2 + p_3 = 1, it is then straightforward to check that _B[Γ_AB^'] = [Γ_AB^']/d_A · I_A. The constraint in Eq. (<ref>) corresponds to the anti-degradable condition of Γ_AB^'. By direct calculation, we have \n\n    [(Γ_B^')^2]    = 1/2(1-α)^2, (Γ_AB^') = p_1 p_2 p_3(p_0-α),\n    [(Γ_AB^')^2]    = α^2 - 2α p_0 + p_0^2 + p_1^2 + p_2^2 + p_3^2.\n\nThen Eq. (<ref>) holds and Γ_AB^' is anti-degradable by Lemme <ref>, which satisfy the constraint in Eq. (<ref>).  Thus, we have proven that Γ_AB^ is a feasible solution to the primal SDP, implying that\n\n    1 - 2^-_max,(Λ)≤[Γ_AB^'] = 1-[(√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2].\n\nIt yields 2^-_max,(Λ)≥ (√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2.\n\nSecond, we will use the dual SDP in Eq. (<ref>) to prove \n\n    2^-_max,(Λ)≤ (√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2.\n\nWe show that {M_AB, N_AB, K_AB, R_A} is a feasible solution to the dual problem, where\n\n    M_AB = (\n        [      η      0      0 -η + 1;      0      ξ      ζ      0;      0      ζ      ξ      0; -η + 1      0      0      η;        ]),\n        N_AB = K_AB = -1/2M_AB,\n        R_A = 0,\n\nand \n\n    η = -√(p_1) + √(p_2)/2√(p_3), ξ= -√(p_1)+√(p_3)/2√(p_2)-√(p_2)+√(p_3)/2√(p_1)-1, ζ=√(p_1)+√(p_3)/2√(p_2)-√(p_2)+√(p_3)/2√(p_1).\n\n\nIt is easy to check that when p_0≥ p_i>0 (i=1,2,3), we have M_AB + N_AB + K_AB= 0, \n\n    M_AB≤ (1- R_A/d_A)I_AB + R_A ⊗ I_B ⇔ I_AB - M_AB   ≥ 0, and\n    \n    N_AB⊗ I_E + P_BE(K_AB⊗ I_E)P_BE^† =1/2M_AB⊗ I_E + P_BE(1/2M_AB⊗ I_E)P_BE^†   ≥ 0.\n\nIt also satisfies [M_ABJ_AB^Λ] = 1-[(√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2]. Thus we have proven that {M_AB,N_AB,K_AB,R_A} is a feasible solution to the dual SDP in Eq. (<ref>), which implies\n\n    1 - 2^-_max,(Λ)≥[M_AB J_AB^Λ] = 1-[(√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2].\n\nThen it yields 2^-_max,(Λ)≤ (√(p_1)+√(p_2))^2 + (√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThus, we arrive at\n\n    2^-_max,(Λ) = (√(p_1)+√(p_2))^2 +(√(p_2)+√(p_3))^2+(√(p_1)+√(p_3))^2.\n\nSince Γ_AB^ is the Bell state after normalization, we know the ADG-squeezed channel is the identity channel.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}